{"title": "Chapter 68 – From the Great Wall of China to Sapporo", "id": 68, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-68-%E2%80%93-from-the-great-wall-of-china-to-sapporo", "volume_title": "Volume 1", "body": "<h1>Chapter 68 – From the Great Wall of China to Sapporo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Saturday morning, we tried to go to the other world as always but a problem has occurred.</p><br/><p>「Azide-san is still in the Suga town.」</p><br/><p>「Who is Azide-san?」</p><br/><p>「Have you forgot? He’s the merchant who travels around Delaidos kingdom, I put a tracking beacon on him.」</p><br/><p>「Oh.~ That person.」</p><br/><p>「Well then, I still can’t go to Ikebu town.」</p><br/><p>「Oh, it’s such a thing. What should we do?」</p><br/><p>「The 3 places where we can go currently are the Royal capital, Nippo and Suga?」</p><br/><p>「Ah, that’s right.」</p><br/><p>「Where can we go in this world, to Tokyo and Sapporo only?」</p><br/><p>「No, I can go to Beijing.」</p><br/><p>「N? Beijing? How??」</p><br/><p>「Some time ago, I met a person named Nancy who came to Japan for her tour around the world, I put a tracking beacon on that person.」</p><br/><p>When I checked the map, Beijing and the great wall of China were displayed. I wonder what would be the sightseeing scope of Nancy? Right now, she’s in Beijing Airport. It seems like she’s about to leave China.</p><br/><p>「We’ll suspend our trip to the other world today and go to China?」</p><br/><p>「Well, just for a short while.」</p><br/><p>「Yes, I’d also like to see many places.」</p><br/><p>「Well then, let’s go and take a look at the great wall of China.」</p><br/><p>「Kay~」「Yes.」</p><br/><p>When we flew to the great wall of China using【Teleportation】, suddenly, our surroundings turned white.</p><br/><p>「Oh, excellent view. But, it’s a little smoggy.」</p><br/><p>「Nice view.」</p><br/><p>「Eh? Elena-chan? Your way of talking suddenly became strange.」</p><br/><p>「The【Magic stone of Temporary Language Acquisition】probably had to correspond with Chinese.」</p><br/><p>「Only…a little bit…I don’t understand.」</p><br/><p>「It’s amazing enough that you can speak like that in a short period of time.」</p><br/><p>While having such talk, Elena began coughing all of a sudden.</p><br/><p>「*Gohon gohon*」</p><br/><p>「Elena, are you alright?」</p><br/><p>「It’s a little…difficult (to breath).」</p><br/><p>Umu, The PM2.5 is soaring a lot more these days, huh?1</p><br/><p>「Let’s leave China, we could still go and see『Sapporo』.」</p><br/><p>「Un, let’s do that.」「Yes.」</p><br/><p>「Well then,【Teleportation】!」</p><br/><p>We went to Sapporo using【Teleportation】.</p><br/><p>「This is Sapporo. The air is so good.」</p><br/><p>When we arrived at Sapporo, Elena’s coughing seemed to have stopped.</p><br/><p>Also, her Japanese had also returned to normal.</p><br/><p>「The atmosphere is a little bit different from Tokyo but it looks as amazing as Tokyo.」</p><br/><p>「Oh, because Sapporo is one of the 5 major cities of Japan.」</p><br/><p>「The rest of the 5 cities are, Osaka, Fukuoka and Nagoya, remember?」2</p><br/><p>「That’s right.」</p><br/><p>I’d like to be able to go to the 5 major cities in the future. Maybe if there’s someone in the company who would go on a business trip, I would attach a tracking beacon on him.</p><br/><p>「An-chan, let’s go and eat Sapporo ramen immediately!」</p><br/><p>「We’re not going!」</p><br/><p>「Whyyy!」</p><br/><p>「Noon is a bit too early to have ramen.」</p><br/><p>「Is that so?~ That reminds me, I’m not hungry yet.」</p><br/><p>Are you a child!? *kusuksu* Even Elena is giggling too.</p><br/><p>It might be necessary to re-educate Aya, some God-like person feels like saying it too. What to do……</p><br/><p>「Well, where should we go?」</p><br/><p>「First, to the『Flour mill factory』.」</p><br/><p>「「『Flour mill factory』?」」</p><br/><p>We went to a『Flour mill factory』a short distance away from Sapporo.</p><br/><p>「It’s a huge building.」</p><br/><p>「Oh, Wheat flour is being made here.」</p><br/><p>「Wheat flour, that wheat flour!?」</p><br/><p>「Un.」</p><br/><p>「This is great, I bet there’s a lot of millstone inside.」</p><br/><p>「Now then, how about it?」</p><br/><p>I inquired at the factory’s reception if we could tour the factory.</p><br/><p>「Yes, factory tour, is it? You can visit at anytime.」</p><br/><p>「A factory tour, it’s been a while since Elementary school.~」</p><br/><p>「I’m looking forward to see what it looks like.」</p><br/><p>An oniisan who was brimming with cleanliness became our guide.</p><br/><p>「First, please wear these work clothes.」</p><br/><p>We were made to wear a pure white worker clothing and hair net for complete protection.</p><br/><p>「W-, Why do we have to wear this!?」</p><br/><p>「Because hygiene management is essential inside the factory.」</p><br/><p>Elena seems to be surprised at the strictness in hygiene management.</p><br/><p>「First is this『Roller machine』, it finely grinds the wheat.」</p><br/><p>「There’s no millstone.」</p><br/><p>「Millstones grind the wheat with stones on the top and bottom, it became a principle of roller machine to grind with two rollers.」</p><br/><p>「The roller is not move by people.」</p><br/><p>「Yes, this whole factory is operating using electric power.」</p><br/><p>「Electricity…… it’s amazing.」</p><br/><p>Elena was astonished and dazed off a little. The oniisan guide also smiles wryly.</p><br/><p>「Next are the『Sifter』and『Purifier』, they sift the wheat flour.」</p><br/><p>「What is the difference between the two?」</p><br/><p>「The『Sifter』is a machine that sift the flour while the『Purifier』is a machine that blows the part called『Wheat bran』using wind power.」</p><br/><p>The oniisan brought a real wheat and taught us the『Wheat bran』part.</p><br/><p>「The Japanese wheat flour is so white because the『Wheat bran』is removed.」</p><br/><p>「I think the other countries also remove it but…… if the『Wheat bran』is not removed, the quality will deteriorate.」</p><br/><p>「It’s also delicious.」</p><br/><p>The oniisan guide explained it happily when he saw Elena was really into it.</p><br/><p>Afterwards, we also visited the bag filling machine, Elena was surprised that there’s almost no people at all.</p><br/><p>「The factory is amazing!」</p><br/><p>Elena is unusually excited. It was good to have brought her along.</p><br/><p>「Particularly, the『Purifier』, it can use wind magic, perhaps, I might be able to do it too.」</p><br/><p>「I see, will the quality of wheat be increased by magic? Elena, you must study more about wind then acquire【Wind magic】.」</p><br/><p>「Yes, I’ll study hard about wind.」</p><br/><p>Elena was fired up to study. I want Aya to also learn from you.</p><br/><p>After the tour was over, I learned from the reception that a 25 kg bag of hard flour can be purchased for 5,000 yen for business purposes. I decisively bought 4 bags. Since the 25 kg bag I purchased disappeared all of a sudden, the people at the factory were surprised. I’ve managed to cover it up somehow.</p><br/><p>「An-chan, why’d you buy so much flour?」</p><br/><p>「The Delaidos Kingdom has a shortage of wheat due to the influence of war, right? I think this can be of some help even a little.」</p><br/><p>「Seiji-sama, thank you very much in behalf of Delaidos kingdom.」</p><br/><p>When I heard such line, Elena is also a princess as expected, is what comes to mind.</p><br/><p>Translator notes and reference:</p><br/><p>1Not sure, here’s the raw: うーむ、はＰＭ２．５がくんでるなのかな？PM 2.5 is short for “Particulate Matter, 2.5 micrometers or less”, basically these “PM2.5 particles” are known to produce respiratory and cardiovascular illness. – Liberty ↩</p><br/><p>2Not sure if this ‘major’ meant largest though, since Fukuoka is 8th largest city in Japan and Yokohama should be here if it is.↩</p><br/>\n</div>"}