{"title": "Chapter 77 – New armors and strategy meeting", "id": 77, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-77-%E2%80%93-new-armors-and-strategy-meeting", "volume_title": "Volume 1", "body": "<h1>Chapter 77 – New armors and strategy meeting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>I went back to the inn in order to report the situation of the Scab village.</p><br/><p>「Eh? Oniichan, yobai1 this early morning?」</p><br/><p>「Seiji-sama, good morning.」</p><br/><p>「Good morning, Elena. Aya, it’s called yobai if it’s evening.」</p><br/><p>「Then, asa hai2?」</p><br/><p>「Aya, there’s no such thing. I’ve found the Scab village that’s why I returned quickly.」</p><br/><p>「N? You’ve already found it? You’re so fast oniichan.」</p><br/><p>When she said「fast」with a stunned look, she seemed to be unsatisfied or something……</p><br/><p>「There’s a horde of goblins gathered inside the Scab village.」</p><br/><p>「N? Goblins!? Why?」</p><br/><p>「Since I didn’t investigate properly, I can’t say it clearly yet. The goblins probably found the village uninhabited and settled in.」</p><br/><p>For some reason, I’m interested about the current situation inside the Scab village.~</p><br/><p>「How many goblins in there?」</p><br/><p>「There should be around 100 or more. If we’re unlucky, there might be 200.」</p><br/><p>「That many!? Then, there might be a high rank goblin present. 」</p><br/><p>「High rank? You mean, Goblin king?」</p><br/><p>「If the horde is around 200, I think there’s a Goblin Prince nearby.」</p><br/><p>A Goblin prince, huh?</p><br/><p>「Uh.~ Seiji-sama, I have a request.」</p><br/><p>「A request from Elena? How rare. What is it?」</p><br/><p>「The goblin subjugation, will you let me do it?」</p><br/><p>「Huh!? Elena!?」</p><br/><p>「The Scab village’s problem is Delaidos Kingdom’s problem, if possible, I want to solve it with my power.」</p><br/><p>Somehow, Elena is unusually aggressive.</p><br/><p>「Oniichan, since Elena shows so much determination, let’s cooperate.」</p><br/><p>「Oh, that’s right.」</p><br/><p>「Seiji-sama, Aya-san, thank you very much.」</p><br/><p>「Well then, we need it after all.」</p><br/><p>***</p><br/><p>We went to Nippo town.</p><br/><p>「Seiji, they’re all finished.」</p><br/><p>「Hello, Gamudo-san.」</p><br/><p>Gamudo-san showed me the finished armor sets.</p><br/><p>「C-, Cool!」</p><br/><p>「Of course, I put all my skills to meet your expectations.」</p><br/><p>My cool armor is a half-armor with kote that covered the fingers up to the elbow and boots that covered my toes up to the shin. In addition, they are all light.3</p><br/><p>「How is it? It’s light, right? It has a gem with weight reduction magic and defense reinforcement magic.」</p><br/><p>「That amazing!?」</p><br/><p>As for Aya’s armor, it’s a breastplate with elbow and knee armor pieces. It’s just right for Aya who focused on speed.</p><br/><p>「Isn’t this armor somewhat erotic?」</p><br/><p>「Aya, you also need to wear normal clothes underneath the armor, right?」</p><br/><p>「Oh, yeah. For a moment there, I thought it’s a bikini armor.」</p><br/><p>Aya, things like bikini armor only exists in two-dimension.</p><br/><p>Elena’s armor is a shining pure white breastplate and boots.</p><br/><p>「Elena-jouchan, it has magic defense and a magic that repels arrows and the like.」</p><br/><p>「Thank you very much!」</p><br/><p>「How is it? Do the three of you like them?」</p><br/><p>「「「Yes.」」」</p><br/><p>「By the way, how much is today’s equipment?.~」</p><br/><p>「*smack* What are you saying! These are the compensation for the whiskey last time. I’m not going to accept anything, even 1 Aurum in return for that.」</p><br/><p>「I see, it’s shame.~ I’ve brought a whiskey again with so much effort……」</p><br/><p>「What!?」</p><br/><p>I took out a whiskey and placed it on the table. It’s not a luxury good like last time but it’s what I usually bought at the supermarket.</p><br/><p>「If you don’t want to accept this whiskey then I wonder if I should just drink it?~」</p><br/><p>「What I said earlier was a lie! I accept this whiskey!」</p><br/><p>「……」</p><br/><p>Looking at the wistful face of ossan, it’s unpleasant.</p><br/><p>「It’s a joke. Because I brought this with so much trouble as a souvenir. Ah, but, it’s not like the expensive liquor last time so, please don’t expect too much.」</p><br/><p>「Is that so? But, even so, it’s also a whiskey. Let’s drink it quickly!」</p><br/><p>When Gamudo-san snatched the whiskey from me, he began to pour it into the glass I gave him last time and drunk it.</p><br/><p>「Kaaa! Splendid! Indeed, whiskey is the best!!」</p><br/><p>If some of the words are different, it’ll become dangerous line but let’s leave it alone.4</p><br/><p>「Well then, we’re going to return.」</p><br/><p>「Oh, please come again. When you have a whiskey souvenir, you’re welcome at anytime!」</p><br/><p>「Yes yes, I’ll come again.」</p><br/><p>「Bye bye.」「Excuse us to have disturbed you.」</p><br/><p>We, dressed in our new armors made by Gamudo-san, headed to the Scab village.</p><br/><p>***</p><br/><p>「Is this the Scab village?」</p><br/><p>「There really is a horde of goblins.~」</p><br/><p>We crouched down on top of a small hill, overlooking the Scab village.</p><br/><p>「Elena, do you really need to go?」</p><br/><p>「Wa, yes…… even if I’ll likely die, I’ll do my best!」</p><br/><p>「You don’t need to exhaust yourself that much. Because, we’ll also help.」</p><br/><p>「Un.」</p><br/><p>「Thank you.」</p><br/><p>「But, if Elena is going to be our main attacker, we need to think of a proper strategy.」</p><br/><p>「Strategy?」</p><br/><p>「No matter how you look at it, fighting all of them at the same time with that number is too reckless.」</p><br/><p>「But, how are we going to go about it?」</p><br/><p>「In this case, divide and conquer is the basic.」</p><br/><p>「Beating the kakko?」5</p><br/><p>This fellow Aya doesn’t seem to understand. orz</p><br/><p>「First, Aya will lure out the goblins.」</p><br/><p>「Oh, I understand now! I’m going to pull the mobs.」</p><br/><p>「Yeah.」</p><br/><p>「Then, Elena will finish them off using AOE skills?」</p><br/><p>「If there’s a large number of enemies, she has to use AOE skills but if it’s otherwise small, it might be better to use magic rod.」</p><br/><p>「What is an AOE skill?」</p><br/><p>「It’s a magic with a wide scope offensive. With Elena’s channeling spells【Cloudburst】and【Snowfall】which takes away body temperature, they are easy prey. Can you do it?」</p><br/><p>「Yes, I’ll try.」</p><br/><p>After deciding the strategy, we began to implement the operation goblin subjugation.</p><br/><p>Translator notes and reference:</p><br/><p>1Creeping at night into a woman’s bedroom.↩</p><br/><p>2She tried to make a morning version of yobai.↩</p><br/><p>3Half-armor is an armor protecting only a part of the body while kote is a gauntlet or gloves similar to this. ↩</p><br/><p>4Reference to Ro-kyu-bu! anime when Subaru said elementary school kids are the best. Thanks ReaderBot and Fein.↩</p><br/><p>5What Seiji said was divide and conquer/rule(/Kakko Gekiha) while what Aya said was Kakko Gekiha(かっこ). Kakko is a Japanese hourglass drum.↩</p><br/>\n</div>"}