{"title": "Chapter 74 – Karate club", "id": 74, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-74-%E2%80%93-karate-club", "volume_title": "Volume 1", "body": "<h1>Chapter 74 – Karate club</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>I was drowsy all day long on that day but with【Strength recovery potion】to restore my strength, I managed to get by somehow.</p><br/><p>I watched Aya using【Tracking】magic, she managed to finally get up around noon and went to Junior Collage.</p><br/><p>As for Elena, she managed to get up a little past noon. She ate the pudding from the refrigerator with a drowsy look and went back to sleep.</p><br/><p>When I watched Aya who went to Junior College, she charged towards the training room of the Karate club after school. </p><br/><p>As soon as she entered the training room of the karate club, she shouted.</p><br/><p>「*FORGIVE THE INTRUSION!*」</p><br/><p>What’s that, a dojo challenge?</p><br/><p>「Who are you?」</p><br/><p>There’s only one kid inside the training room. Kid? That’s the training room of the Junior College’s karate club?</p><br/><p>「I’m here to join the karate club…… who are you?」</p><br/><p>「I’m the captain of the karate club that you’d like to join.」</p><br/><p>Captain? This kid? No matter how you look at it, she’s1 about a primary school student.</p><br/><p>「So, where’s the T.R.U.E captain?」</p><br/><p>「Oh, I’m like this so I’m resigned to be misunderstood…… are you perhaps a freshmen? That attitude is kinda rude towards a senior.」</p><br/><p>After saying that, the kid’s atmosphere suddenly changed.</p><br/><p>「!?」</p><br/><p>Aya also noticed it and took a fighting stance.</p><br/><p>「Hou, that’s a strange stance, are you self-taught?」</p><br/><p>As soon as those words left her mouth, the kid kicked the floor and attacked Aya.</p><br/><p>Aya minutely dodged the kid’s attack and took the opportunity. But, she slipped due to her wearing socks and fell down.</p><br/><p>「Because this is a wooden floor, you’ll slide when wearing socks.」</p><br/><p>Said the kid captain. Aya took her socks off and threw it away.</p><br/><p>「Well then, shall we increase the speed a little?」</p><br/><p>The kid captain rushed with movements quicker than before. Having her socks off, Aya was able to move properly now and managed to fend off the attack easily.</p><br/><p>「How did you manage to avoid that!? That’s not karate in the least.」</p><br/><p>After that, Aya continued to dodge the quick attacks of the kid captain.</p><br/><p>「Iyaa, your movements are interesting. It’s like you can move at will.」</p><br/><p>「You shouldn’t talk.」</p><br/><p>「Hahaha! Thanks for the reminder.」</p><br/><p>The offense and defense repeated many times, Aya dodged the kid captain’s Foot Sweep Kick with a jump.</p><br/><p>「Eat this!」</p><br/><p>The kid captain canceled the Foot Sweep Kick and let out an upper which looked like an ascending dragon. Aya couldn’t dodge since she was in mid-air.</p><br/><p>*ka-pow* A dull sound resounded in the training room.</p><br/><p>Aya barely blocked it with a cross arm but was overwhelmed by the upper’s power and was blown off to the back. Her back hit the brick wall of the training room.</p><br/><p>「Ku!」</p><br/><p>「You were able to block that well, you’re really amazing.」</p><br/><p>The kid captain really praised her but Aya didn’t think so.</p><br/><p>Aya glared at the kid captain with an exasperated look and began to use【Strength recovery reinforcement】.</p><br/><p>Oy, stop it you idiot. Don’t use magic!</p><br/><p>「Huh? You, what are you doing? Something in your body changed a little, what was it?」</p><br/><p>It seemed the kid captain felt something. Is her perception that sharp?</p><br/><p>「You, are you doing some kind of trick? Show it to me a little more.」</p><br/><p>When the kid captain says so, she’s beckoning and provoking Aya. Aya’s blood rushed to her head. She took the kid captain’s provocation and rushed towards her.</p><br/><p>While Aya circled around the kid captain, she tried to catch her off-guard and performed knife-hand attacks but all of them were avoided.</p><br/><p>「It’s an interesting move but it’s a bit monotonous.」</p><br/><p>The kid captain kicked sharply and grazed Aya at the nose. Aya tried to dodge the sudden kick and tumbled away into the distance. The kick probably missed on purpose.</p><br/><p>Finally, Aya began to use【Movement speed reinforcement】magic.</p><br/><p>「Oh, I feel something strange. Is it a trick? It seemed to be something amazing!」</p><br/><p>Aya circled around the kid captain and unleashed a barrage of attacks with abnormal speed. The kid captain wasn’t able to completely dodge them and was forced to block occasionally.</p><br/><p>「Amazing! Amazing! What’s thisss!?」</p><br/><p>The kid captain frolicked in high spirits.</p><br/><p>Aya gets irritated that her attacks didn’t manage to hit.</p><br/><p>She began to use【Tailwind】and【Wind gust】. Aya, you’re going too far! orz</p><br/><p>「Wind……」</p><br/><p>Even the kid captain noticed the abnormal situation and her face became stiff.</p><br/><p>Aya gradually attacked and managed to graze the kid captain for the first time. The kid captain’s face soon turned serious. </p><br/><p>The speed of the two’s offense and defense increased bit by bit……</p><br/><p>「Wa?」</p><br/><p>The kid captain noticed something and made a big jump away from that spot immediately.</p><br/><p>A【Tornado】occurred at the spot where the kid captain stood previously. </p><br/><p>When the kid captain was astonished at the sight, Aya aimed at the kid captain who was in mid-air and unleashed a fist while jumping.</p><br/><p>*ka-pow* A dull sound resounded in the training room, this time, the kid captain was blown off to the wall of the training room.</p><br/><p>Aya who had seen it looked downwards and tried to land but at the moment!……</p><br/><p>「Ku!」</p><br/><p>Aya received an intense pain from her solar plexus and crouched down on the spot.</p><br/><p>The kid captain was blown away but just before she slammed into the wall, she fixed her posture in mid-air and kicked the wall, using that momentum, she attacked Aya who was trying to land on her solar plexus.</p><br/><p>「S-, Sorry, I didn’t mean to get serious.」</p><br/><p>The kid captain apologized to the crouching Aya.</p><br/><p>Aya, who was more frustrated with losing that the pain, *egu egu* started crying.</p><br/><p>「Oh, I’m really sorry. Please don’t cry.~」</p><br/><p>And then, a girl with glasses entered.</p><br/><p>「C-, Captain! What did you do!!?」</p><br/><p>「Yo! Yurie-kun. This young woman is sort of like a new member. Because she seemed interesting, we had a little bout.~ I didn’t mean to get serious……」</p><br/><p>Is the name of this young woman Yurie?</p><br/><p>「Are you serious, captain!? Is she alright!? Should we call an ambulance!?」</p><br/><p>Yurie-chan said something exaggerated. Well, if it’s an ordinary person who received that attack of the kid captain, it wouldn’t end with just being sorry.</p><br/><p>Yurie-chan rushed towards Aya and forcefully pulled Aya’s head into her chest. Aya was buried in the huge chest of Yurie-chan, she forgot to cry and struggled.</p><br/><p>「It’s fine already, I’ll cheer you up.~」</p><br/><p>「*Mumble mumble*……」</p><br/><p>「Yosh yosh, it was painful, wasn’t it?~」</p><br/><p>This kid captain is a dangerous person but this Yurie-chan is also dangerous in a different sense. Huge……</p><br/><p>Aya looked upwards in-between Yurie-chan’s breast,</p><br/><p>「Kyaa! She’s so cute! Would you like to stay at my house?」</p><br/><p>「Huh?」</p><br/><p>「Ah, Yurie-kun is a『Gachi2』so it’s better to be careful.」</p><br/><p>「You’re heartless captain! I’m not a『Gachi』.~ I just like cute girls!」</p><br/><p>「That’s called『Gachi』!」</p><br/><p>Is she such a person?…… It’ll be difficult to pick up Aya.</p><br/><p>Finally, when the 3 people regained their composure, they introduced themselves over again.</p><br/><p>「I’m Maruyama Aya, a freshman. I want to join the karate club. Nice to meet you.」</p><br/><p>「I’m Kawai Mai, karate club’s captain. Best regards.」</p><br/><p>「I’m the manager, Mihara Yurie. Aya-chan, please treat me well.」</p><br/><p>Such an event, full of ups and downs. That was how Aya joined the karate club.</p><br/><p>Translator notes and reference:</p><br/><p>1Assuming that Aya is joining the girl’s division of Karate club.↩</p><br/><p>2This one is really hard to put into words (at least for me), look it up here.↩</p><br/>\n</div>"}