{"title": "Chapter 73 – Japanese sweets’ power", "id": 73, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-73-%E2%80%93-japanese-sweets%E2%80%99-power", "volume_title": "Volume 1", "body": "<h1>Chapter 73 – Japanese sweets’ power</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After arriving at the『Ikebu town』with so much effort, we went home without exploring the town. I wish I could look around a bit before leaving.</p><br/><p>That night, I brewed 23【Stimulant potion +3】using the【Mandrake root】I bought, totaling 29. Setting aside the ones for the director, since there’s too many, let’s sell some of it this time. </p><br/><p>After that, the【Strength recovery potion】has been used as ingredients for【Stimulant potion】as well as the【Medicinal herbs】, all the materials has been used up. I should replenish my stock. </p><br/><p>There’s only 7【Strength recovery potion +3】left in my hand, since these may become useful for something, I’ll keep them.</p><br/><p>The next day, when I went to the company, I received a lunch invitation from the director. It seems like he wants to discuss about the you-know-what.</p><br/><p>While smacking his lips over the delicious eel at the luxurious eel shop, the director began to talk happily.</p><br/><p>「I intended to use the you-know-what on the day you gave it to me but my wife went out on a trip without notice. I finally had the chance to use it on Friday when she came back from the trip. I’ve only had a sip of that and was overwhelmed. It was only about a full sake cup.」</p><br/><p>The director was beaming with a smile that he never showed. The awkward relationship of the couple had improved. He told me that he consumed the you-know-what on the weekend.</p><br/><p>「I’m also happy that it was able to make you glad.」</p><br/><p>「That’s right! I found out that it’s not good to depend on the example too much, I’d like to have some bottles of the example. Can you give me?」</p><br/><p>I pretended to be reluctant to take it out.</p><br/><p>Please don’t misunderstand, I’m worried that it will have a side effect on the director’s body if he drink too much, I’m not thinking of raising its scarcity value, not at all!</p><br/><p>「I’m sorry Director but I can only prepare one of them right now.」</p><br/><p>I said and put only one【Stimulant potion +3】on the table.</p><br/><p>「Is that so? only one… that’s right, one can’t get these things so easily.」</p><br/><p>「Therefore, it’s better to only drink a little bit between uses.」</p><br/><p>「That’s right……」</p><br/><p>Because the Director seemed to be convinced, I’ll slow down the crafting pace in the future.</p><br/><p>「Director, there’s also a different matter……」</p><br/><p>While saying so, I took out 1 of the【Strength recovery potion +3】and placed it next to the【Stimulant potion +3】.</p><br/><p>「This is?」</p><br/><p>「This is a drink that recover strength. If you get tired from intense exercise1, drink this.」</p><br/><p>Because strenuous exercise when you get old seemed to be dangerous.</p><br/><p>「Is that right? Is this also a good thing?」</p><br/><p>「Because this one is easier to obtain than those examples, it may not be much.」</p><br/><p>「I see, is it fine to take it after the other one?」</p><br/><p>「Yeah, there’s no problem.」</p><br/><p>The Director and I cracked a smile.</p><br/><p>But the Director seemed to be worried about the potions on the table and was fidgeting.</p><br/><p>「W-, With that…… I prepared something as thanks for the second item, will you receive it?」</p><br/><p>「N? Ah, yes.」</p><br/><p>The Director looked left and right, he then took out a brown envelope from his breast pocket and presented it.</p><br/><p>I received the envelope and put it in my breast pocket. The Director wrapped the small vials of【Strength recovery potion +3】and【Stimulant potion +3】in a handkerchief protectively and placed them in a bag.</p><br/><p>「Hahaha! Iya, I’m so happy to have a good subordinate like you. Come on, let’s eat the eel and work hard for today!」</p><br/><p>Director, are you talking about working hard for the afternoon work? Or is it about the night work? Let’s not think about it too much. After that, the Director and I finished the afternoon work with the power of the high-class eel energetically.</p><br/><p>After returning home, I checked the contents of the brown envelope and there were 10 Yukichi-san2. Director, this is too much……</p><br/><p>***</p><br/><p>In the evening, the 3 of us are drinking tea after dinner when the chime of the intercom reverberated. Who could it be at such an hour? Somehow, I have a bad feeling.</p><br/><p>「Ye~s.」</p><br/><p>When I opened the door, it was innocent faced of the shopping district the other day.</p><br/><p>「If I remember correctly, you’re from the shopping district……」</p><br/><p>「N? Ah, yes. E-, Ehm, uh……」</p><br/><p>Calmed down young man.</p><br/><p>Come to think of it, I’ve only seen him from the【Tracking】magic so it’s our first meeting.</p><br/><p>「You escorted Elena here before. I’ve heard it from her.」</p><br/><p>「Ah, yes. I-, Is Elena inside?」</p><br/><p>「She is but do you have business with her?」</p><br/><p>But, why is this fellow so nervous?</p><br/><p>Does he thought that Elena is living alone and with that in mind, he came to attack!?</p><br/><p>「Well you see, i-, it’s because, ba-, babaa-chan said that she would like to me-, meet Elena at her final mo-, moment.」</p><br/><p>「At this hour? N? Final moments??」</p><br/><p>「T-, That’s because… babaa-chan’s physical condition suddenly worsened……」</p><br/><p>「Is that why!? Also, last moments!? You mean, her condition is that dangerous?」</p><br/><p>「Y-, yes.」</p><br/><p>「You should’ve said it earlier! Elena! Get ready, we need to go out.」</p><br/><p>When I went inside the house and shouted, Elena appeared.</p><br/><p>「Seiji-sama, what happened?」</p><br/><p>「This fellow’s obaa-chan’s physical condition has worsened and wants Elena to come.」</p><br/><p>「I understand, I’ll get ready immediately.」</p><br/><p>We were ready to go out after a while, the 3 of us, including Aya, went to the Japanese sweets shop at the shopping district led by innocent faced.</p><br/><p>「Babaa-chan, I’ve brought Elena.」</p><br/><p>「Did you really bring her? I said that it was fine.」</p><br/><p>「Be-, because, babaa-chan……」</p><br/><p>The Obaa-san lay on the futon and weakly turned her head this way.</p><br/><p>「Elena-chan, I’m sorry. This child must have said something unreasonable……」</p><br/><p>Elena rushed towards obaa-san and took her hand.</p><br/><p>「I’ll cure you immediately.」</p><br/><p>「Elena-chan, it’s already good that…you came…in my last moments…… in a short period of time…you showed kindness to this obaa-san, thank you……」</p><br/><p>Obaa-san said so and slowly closed her eyes.</p><br/><p>「It’s no good! I will heal you!!」</p><br/><p>Elena began to use【Recovery magic】to the fullest.</p><br/><p>This can’t be covered up with『Good luck charm』anymore.</p><br/><p>But, I can’t stop Elena.</p><br/><p>「Listen Elena. Don’t act recklessly.」</p><br/><p>「Yes! Seiji-sama, please take a look at her strength’s status.」</p><br/><p>「Understood.」</p><br/><p>I checked the status of obaa-san.</p><br/><p>┌─＜Status＞─</p><br/><p>│Name: Honda Umeko</p><br/><p>│Occupation: Wagashi shop owner</p><br/><p>│Age: 80</p><br/><p>│Condition: (Terminal malignant tumor)</p><br/><p>│</p><br/><p>│Level: 1</p><br/><p>│HP: 5 / 60</p><br/><p>│</p><br/><p>│Power: 4 Endurance: 2</p><br/><p>│Ability: 10</p><br/><p>└─────────</p><br/><p>「The HP is in danger.」</p><br/><p>「Okay.」</p><br/><p>With Elena’s【Strength transfer】, obaa-san’s HP began to recovery bit by bit.</p><br/><p>But, I’m worried about the『Terminal malignant tumor』.</p><br/><p>「Oi, young man, does obaa-san have a malignant tumor?」</p><br/><p>「Yes, we suppressed the pain using medicines but it also became ineffective recently.」</p><br/><p>In other words, it’s what they called『Palliative care』3.</p><br/><p>「Elena, it seems there’s a『Malignant tumor』inside the body of obaa-san, can you find it?」</p><br/><p>「Malignant tumor? I’ll try to find it using magic.」</p><br/><p>While maintaining the HP of obaa-san, Elena began to perform various trial and error and examined the body of obaa-san using magic.</p><br/><p>Elena’s MP also steadily decreased, though she’s somehow holding up using candy, you can’t fully recover using it.</p><br/><p>「Hey, young man.」</p><br/><p>「Yes, what is it?」</p><br/><p>「Can you get some stuff with lots of sugar?」</p><br/><p>「Okay, I understand.」</p><br/><p>The young man returned with Japanese sweets.</p><br/><p>「These are the last Japanese sweets made by Babaa-chan,」</p><br/><p>「Alright Elena, eat these Japanese sweets.」</p><br/><p>「Okay.」</p><br/><p>「I’ll help you.」</p><br/><p>Elena is busy using magic, so Aya got to feed her the Japanese sweets.</p><br/><p>Then, Elena’s MP began to recover instantly. Yey! With this, Elena will be able to recover her MP somehow!</p><br/><p>「Seiji-sama, I’ve found it. I saw the malignant tumor.」</p><br/><p>When I checked Elena’s status, there’s a newly added magic–【Lesion4 detector】.</p><br/><p>「Alright, good! Heal the malignant tumor.」</p><br/><p>「Yes!」</p><br/><p>Aya wiped Elena’s sweat and fed her Japanese sweets. The sight is a bit surreal……</p><br/><p>The young man without knowing the reason, continued to pray.</p><br/><p>Elena tried various ways to heal the malignant tumor of obaa-san, none of it work somehow. The struggle lasts for 2 hours and everyone began to show signs of fatigue.</p><br/><p>「Seiji-sama, it’s not going well. What should I do……」</p><br/><p>「Umu, what to do……」</p><br/><p>「If it’s a surgery you should remove the malignant tumor.」</p><br/><p>Aya said something good.</p><br/><p>「Remove? Huh?」</p><br/><p>「Yeah, if it’s a Japanese operation, you have to do ablation5 at once and wait for it to recover afterwards.」</p><br/><p>「I understand, I’ll give it a try.」</p><br/><p>After a while, Elena laughed and smiled.</p><br/><p>「Did you do it?」</p><br/><p>「Yes, but only a little. The tumor has been reduced.」</p><br/><p>「Alright, keep going!」</p><br/><p>「Yes!」</p><br/><p>After a while, Elena extracted her hand from obaa-san and stopped using magic. Her face cracked into a smile.</p><br/><p>「I did it, the malignant tumor has been cured.」</p><br/><p>「Well done.」</p><br/><p>I immediately checked the status of obaa-san.</p><br/><p>But the condition of (Terminal malignant tumor) wasn’t removed. Why!?</p><br/><p>「Elena, not yet. It’s not yet cured.」</p><br/><p>「Huh!? S-, Such.」</p><br/><p>Elena were astonished once again and used【Lesion detector】to obaa-san.</p><br/><p>「T-, that’s……」</p><br/><p>「What’s wrong?」</p><br/><p>「The same lesion as the one a little while ago, it’s all over the body……」</p><br/><p>Elena lowered her head with the hopeless situation.</p><br/><p>「Elena, do you give up?」</p><br/><p>「N-, No! I will not give up!!」</p><br/><p>Elena was once again fired up and turned towards obaa-san.</p><br/><p>***</p><br/><p>Time passed after that and the night has begun to fade into cracks of dawn.</p><br/><p>Finally, we managed to remove all the malignant tumors of obaa-san, I confirmed obaa-san’s status and the (Terminal malignant tumor) had also disappeared.</p><br/><p>More surprisingly, Elena’s【Recovery magic】went up to level 5. Raising magic to level 5 by relying on herself…… Elena is really amazing.</p><br/><p>「You’ve done well, Elena.」</p><br/><p>「Y-, Yes, obaa-san……was good……」</p><br/><p>Elena was finally exhausted and fell asleep.</p><br/><p>「Young man, it’s already fine. Obaa-san needs to rely on you afterwards.」</p><br/><p>「Y-, yes. Thank you very much.」</p><br/><p>The young man deeply bowed her head.</p><br/><p>「It’s all because of Elena, say that words to her.」</p><br/><p>「Okay.」</p><br/><p>I princess carry Elena with Aya who’s about to fall asleep at any moment and returned home.</p><br/><p>「S-, So tired……」</p><br/><p>I laid Elena and Aya on the bed, whipped my tired bodyー</p><br/><p>and went to the company.6</p><br/><p>Translator notes and reference:</p><br/><p>1( ͡° ͜ʖ ͡°)↩</p><br/><p>2Referring to Fukuzawa Yukichi on the 10,000 yen bank note, it’s the same as Americans calling $100 bill ‘Benjamin’.↩</p><br/><p>3Palliative care is a multidisciplinary approach to specialized medical care for people with serious illnesses. It focuses on providing patients with relief from the symptoms, pain, physical stress, and mental stress of a serious illness—whatever the diagnosis.↩</p><br/><p>4A region in an organ or tissue that has suffered damage through injury or disease, such as a wound, ulcer, abscess, tumor, etc.↩</p><br/><p>5The surgical removal of body tissue.↩</p><br/><p>6Bath and sleep are for the weak?↩</p><br/>\n</div>"}