{"title": "Chapter 89 – Slave merchant", "id": 89, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-89-%E2%80%93-slave-merchant", "volume_title": "Volume 1", "body": "<h1>Chapter 89 – Slave merchant</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Elena was dumbfounded.</p><br/><p>「Congratulations, Elena.」</p><br/><p>「T-, Thank you very much.」</p><br/><p>After the wind, she also acquired【Lightning magic】in spite of it being level 1.</p><br/><p>「I still couldn’t believe it. Other than Seiji-sama and Aya-san, only 1 person managed to acquire【Lightning magic】so far. To think that I acquired……」</p><br/><p>「Because Elena-chan has been living surrounded by electrical appliances in Japan.~」</p><br/><p>「Besides, have you been studying about electricity?」</p><br/><p>「Y-, yes.」</p><br/><p>With this, other than darkness, she was able to acquire all the magic from the places we visited. Our objective was completed!</p><br/><p>***</p><br/><p> We went to Gamudo-san’s shop to buy equipment that amplified magic.</p><br/><p>「Hello, Gamudo-san.」</p><br/><p>「Yo! Seiji, good thing you’ve come. The liquor?」</p><br/><p>「Is liquor your favorite word?」</p><br/><p>「Did you bring it?」</p><br/><p>「I brought it but not much.」</p><br/><p>I put the『Brandy』I bought at a liquor store in the shopping district on the table.</p><br/><p>「N? It’s not whisky?」</p><br/><p>「You understand well.」</p><br/><p>「Their fragrance is different.」</p><br/><p>As expected of a drinker.</p><br/><p>「It’s a different liquor since it’s raw material isn’t wheat but it’s also delicious.」</p><br/><p>「Oh, thanks. So, what do you need for today?」</p><br/><p>「Finally, we can get down to business. Please arrange a short account of all the equipment that amplified magic i.e【Water rod】and【Hair ornament of recovery】from before.」</p><br/><p>「N? Short account? What’s the matter? Doesn’t Elena-jouchan have water and recovery? By any chance, did your companions increased?」</p><br/><p>「That’s not it, she acquired new magic.」</p><br/><p>「Newly acquired? Is it Earth? Or Wind?」</p><br/><p>「It’s Wind, but since she can surely acquire Earth too, I’d like to buy it in advance.」</p><br/><p>「Elena-jouchan is an amazing magician. Please wait a moment for the hair ornament and rod.」</p><br/><p>Gamudo-san brought some hair ornaments and rods from the back.</p><br/><p>「Here,【Wind rod】and【Earth rod】,【Hair ornament of Wind】,【Hair ornament of Water】and【Hair ornament of Earth】.」</p><br/><p>「Eh? There’s no Fire?」</p><br/><p>「The rare ones aren’t placed here. If you really want, try to go to the weapon shop in Suga town.」</p><br/><p>「Thank you. We’ll go later.」</p><br/><p>「Then, these are the hair ornaments and rods, what would you do?」</p><br/><p>「I’ll buy them all, how much?」</p><br/><p>「It’s 1, 000A apiece, totaled 5, 000A. Since I’m indebted to Seiji, 3, 000A would do.」</p><br/><p>「Thank you very much.」</p><br/><p>I paid 3, 000A and obtained the hair ornaments and rods.</p><br/><p>I left Gamudo-san’s shop and went to the weapon shop in Suga town.</p><br/><p>***</p><br/><p>「Hello.」</p><br/><p>「Welcome, did you come to destroy the courtyard again?」</p><br/><p>「Please forgive me. It’s shopping.」</p><br/><p>「Oh, is that right? You’ve come to buy what?」</p><br/><p>「Are there【Fire rod】and【Hair ornament of Fire】here?」</p><br/><p>「If you’re looking for really rare ones, I have them.」</p><br/><p>「Well then, are there lightning, ice, darkness and light too?」</p><br/><p>「There should probably be【Darkness rod】and【Ice rod】. But no matter how badly you want the rest, I don’t have them. 」</p><br/><p>「You can’t make them?」</p><br/><p>「Though I can make them if there are materials, I don’t have the material,【Attribute reinforcement magic stone】.」</p><br/><p>「Where can we get it?」</p><br/><p>「In the magic stone shop in Ikebu town. It seems the owner have been abducted by the goblins all the while and have been rescued recently.」</p><br/><p>That person, huh.</p><br/><p>For the time being, we bought the【Hair ornament of Fire】,【Fire rod】,【Ice rod】and【Darkness rod】for a total of 12, 000A but―</p><br/><p>Upon leaving the shop, I noticed something strange.</p><br/><p>An『Orc』is being displayed on the map.</p><br/><p>「There’s an orc.」</p><br/><p>「N!? Where?」</p><br/><p>「It’s far away towards the forest.」</p><br/><p>「N? Such a distant enemy in the forest can be seen?」</p><br/><p>「I didn’t realize it until now…… but the monster type can now be seen too. I wonder why?」</p><br/><p>「Seiji-sama, isn’t it because you acquired【Wind magic】?」</p><br/><p>「Oh, that’s right! I acquired【Wind magic】and was able to detect the scent.」</p><br/><p>「N! Smell!?」</p><br/><p>For some reason, Aya glared at me while holding the area around her thigh. Are you trying to『Open farting1』?</p><br/><p>「It can only detect the scent of demon, I don’t know if it can detect as far as the smell of『Open farting』.」</p><br/><p>「Stupid oniichan! Die!」</p><br/><p>Putting Aya’s『Open farting』aside, the orcs’ numbers are troublesome, although they’re in the forest, there are 20 orcs.</p><br/><p>When I was thinking on what to do―</p><br/><p>Of the 20 orcs, 1 began to move towards the town.</p><br/><p>「1 of the orcs is headed this way!」</p><br/><p>「Seiji-sama, only 1 of them?」</p><br/><p>「Aa, it is so. What on earth is it up to?」</p><br/><p>We went over to village’s entrance near the forest to see the situation.</p><br/><p>After a while, a carriage went inside the town.</p><br/><p>「Look. The orc is riding on that.」</p><br/><p>We followed the carriage.</p><br/><p>The carriage advanced for awhile through the town and went inside a slave merchant’s shop warehouse.</p><br/><p>「I see, is that the hideout of the guy who has been helping the orcs?」</p><br/><p>「Helping the orcs? A human has been helping them?」</p><br/><p>「Oh, it seems so.」</p><br/><p>We boldly went inside the slave merchant’s shop.</p><br/><p>「I’m sorry. The slaves are out of stock right now……」</p><br/><p>「Out of stock? That’s odd, didn’t you bring one inside on board a carriage a while ago?」</p><br/><p>「No, errr… that’s……」</p><br/><p>「Oh, that’s right. What you brought in wasn’t a slave but a monster.」</p><br/><p>「N!? No, it’s not it!」</p><br/><p>「Then, what is it?」</p><br/><p>「That’s, um……」</p><br/><p>「If your mouth can’t say it, should I say it instead?」</p><br/><p>「Eh?」</p><br/><p>「You bandits, allying yourselves with the orcs. Disguising an orc as a slave using【Magic stone of Human transformation】and helping it abduct people. Am I wrong?」</p><br/><p>「……」</p><br/><p>The【Appraisal】’s result was『Occupation: Bandit』.</p><br/><p>The bandit–former slave merchant–glared at me.</p><br/><p>「Now, what would you do? By the way, the three of us, even if we fight against you one on one, are strong enough to win with a room to spare.」</p><br/><p>「Die!」</p><br/><p>Though the bandit said that, he who suddenly attacked fell into a swoon with a single punch from Aya.</p><br/><p>「The orc?」</p><br/><p>「It’s in the room at the back.」</p><br/><p>When we moved to the room at the back, a man who smells like a rotten fish scowled at us.</p><br/><p>「You, what?」</p><br/><p>「We’ve come to subjugate an orc.」</p><br/><p>「!?」</p><br/><p>The man who smells like a rotten fish suddenly attacked but was stunned by my【Lightning fist】.</p><br/><p>「Oniichan, we’re not going to kill that guy?」</p><br/><p>「Oh, I intend to use ‘it’ for a little『Entertainment』.」</p><br/><p>「Entertainment, is it?」</p><br/><p>「Aa. Aya, carry the bandit from a little while ago. We’ll bring it to the adventurers’ guild.」</p><br/><p>「Un.」</p><br/><p>I, with the man who smells like a rotten fish while Aya with the bandit, lifted them both by the head, and carried them to the adventurers’ guild.</p><br/><p>「Excuse meee!」</p><br/><p>「Yes…… !? What are these unconscious men!?」</p><br/><p>Aya and I put down the bandit and the man who smells like a rotten fish on the floor of the adventurers’ guild.</p><br/><p>「That man over there is a bandit while this man who smells like a rotten fish is a human disguised orc.」</p><br/><p>「Wa? What sort of joke is that?」</p><br/><p>「I’m not joking.」</p><br/><p>The adventurers and the guild’s staffs gathered around.</p><br/><p>「Well then, please look at this man who smells like a rotten fish. I’ll show you the real identity of this fellow!」</p><br/><p>As I declared so in a loud voice, I searched for the【Magic stone of human transformation】on the man who smells like a rotten fish in order for everyone to see.</p><br/><p>And then, the man who smells like a rotten fish transformed from human into an orc.</p><br/><p>「I-, It’s really… an orc!?」</p><br/><p>「The orcs are disguising themselves as humans using【Magic stone of Human transformation】. They are joining hands with the bandits and sneak into the towns by pretending to be slaves. That guy over there is a bandit who was pretending to be a slave merchant.」</p><br/><p>The adventurers’ guild was in an uproar.</p><br/><p>「Oh, this guy! He’s a bandit henchman on the wanted list.」</p><br/><p>The guild staffs seemed to know the man of the bandits.</p><br/><p>After that, there was a discussion at the guild and a unit was formed to subjugate the bandits. We said that we have other things to do and declined it.</p><br/><p>I think with this huge clamor, it would prevent the orcs from sneaking in.</p><br/><p>We left the Suga town and went to Ikebu town.</p><br/><p>Translator notes and reference:</p><br/><p>1Open farting.</p><br/>\n</div>"}