{"title": "Chapter 82 – Magic Stone", "id": 82, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-82-%E2%80%93-magic-stone", "volume_title": "Volume 1", "body": "<h1>Chapter 82 – Magic Stone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Several goblins were left inside the village but we cleared them up quickly and went towards the place where the people had been forced to work.</p><br/><p>「We’ve come to help, is everyone alright?」</p><br/><p>We discussed it amongst ourselves and decided to let Elena be the leader this time.</p><br/><p>「Huh!? You’ve come to help…… the goblins?」</p><br/><p>「Please rest assured, we have already defeated all the goblins.」</p><br/><p>「All of them!?」</p><br/><p>We told the captives that it’s already safe. Elena cast【Recovery magic】magic on each person whose strength was weakened and distributed food and water.</p><br/><p>「Well then, we aren’t going to be forced to work again?」</p><br/><p>「Yeah, it’s already safe.」</p><br/><p>「「Hooray!」」「「Freedom!」」「「Thank you very much!」」</p><br/><p>Everyone thanked Elena unanimously.</p><br/><p>I let everyone calm down and tried to ask various questions.</p><br/><p>「Where were all of you from?」</p><br/><p>「I’m from Suga town.」</p><br/><p>「I’m from Ikebu town.」</p><br/><p>When I listened to these people, about 5 people were from Suga town and the remaining 20-something people were from Ikebu town.</p><br/><p>「So, how did everyone become captives?」</p><br/><p>「I was suddenly attacked from behind in the town and when I regained my consciousness, I had already been captured by an orc.」</p><br/><p>「It’s also the same for me.」「Me too.」</p><br/><p>It seems everyone had been abducted in the town.</p><br/><p>There was something similar that happened before but how did they manage to abduct people inside the town?</p><br/><p>「It seems everyone had been forced to work here but what has everyone been told to do?」</p><br/><p>「We were making a magic stone.」</p><br/><p>「Magic stone? What kind of Magic stone?」</p><br/><p>「I don’t know.」</p><br/><p>「Although you were the ones making it, you didn’t know what kind of magic stone you were making?」</p><br/><p>「Rather than making a magic stone, it was more like we were just replicating it.」</p><br/><p>The one who answered was the craftsman-like man who was teaching how to make a magic stone.</p><br/><p>「Replicating the magic stone?」</p><br/><p>「Yes, using the goblins’【magic stone replicating tool】which was brought from somewhere, we were able to replicate a certain【magic stone】.」</p><br/><p>「A certain magic stone?」</p><br/><p>「Since I don’t have appraisal, I don’t know what kind of【magic stone】it is. Here.」</p><br/><p>I tried to use【appraisal】on the【magic stone】that was handed to me―</p><br/><p>┌─＜Appraisal＞────</p><br/><p>│【Magic stone of Human Transformation】</p><br/><p>│A magic stone that can transform the appearance of the user to Human.</p><br/><p>│Rarity: ★★★★</p><br/><p>└─────────</p><br/><p>『Human transformation』!</p><br/><p>Was it perhaps because of this that the orcs managed to sneak into the town and abducted humans!? It’s probably it judging from the situation.</p><br/><p>「Lastly, is there a person here who knows something about this village?」</p><br/><p>「We were only abducted from the other towns. The only thing we know is that this village had been destroyed by the demon lord’s army……」</p><br/><p>We’ve come this far and there’s still no clue?……</p><br/><p>「Ah! I’ve heard that there were several survivors of this village and they were in the Shinju town.」</p><br/><p>「There were survivors!?」</p><br/><p>「I heard that it was annihilated at first. One day, when approximately a month had passed, it seemed that survivors of this village unexpectedly appeared in Shinju town.」</p><br/><p>Let’s organize the story up to this point.</p><br/><p>・The goblins were making【Magic stone of Human Transformation】.</p><br/><p>・There’s a possibility that there are orcs and goblins with【Magic stone of Human Transformation】lurking inside the town.</p><br/><p>・There are survivors of Scab village in Shinju town.</p><br/><p>First, what are the goblins plotting with【Magic stone of Human Transformation】? There should be another reason than just merely increase the number of people to create a【Magic stone of Human Transformation】.</p><br/><p>If there are orcs and goblins with【Magic stone of Human Transformation】inside the town, it’s necessary to use【Appraisal】on suspicious individuals one by one. There were『danger』marks that appeared in the town occasionally, instead of criminals, they must have been『Human transformed』orcs and goblins. I didn’t use【Appraisal】thoughtlessly in consideration to privacy but it benefited the enemy instead.</p><br/><p>First, we should go to Suga town and Ikebu town, and look for human transformed orcs and goblins. Eliminate them if necessary.</p><br/><p>Next, go to Shinju town and look for the survivors of the Scab village.</p><br/><p>We transported the people who had been abducted to each of the towns using【Teleportation】. Of course, I reminded them to keep it a secret from other people.</p><br/><p>***</p><br/><p>Because the craftsman-like man wanted to thank us on behalf of the people who were captured, we decided to stop by the Magic Stone Specialty Shop in the Ikebu town.</p><br/><p>「It’s here, please come inside.」</p><br/><p>When we walked into the suspicious shop, there was an elderly woman and a young woman inside who were sitting in a chair with gloomy look.</p><br/><p>When we entered, the two people suddenly stood up.</p><br/><p>「Honey!」「Otousan!」</p><br/><p>They rushed towards the craftsman-like man in delight and embraced each other.</p><br/><p>「I’m glad you’re safe.」</p><br/><p>「Sorry for worrying the two of you.」</p><br/><p>「Otousan, where have you been!?」</p><br/><p>「I had been abducted by an orc and was rescued by these people.」</p><br/><p>「Is that true? You saved my husband this time, thank you very much.」「Thank you very much.」</p><br/><p>The parent and child kept on thanking us to the extent of showing us various magic stones.</p><br/><p>The magic stones in the shop were as follows.</p><br/><p>┌─＜Appraisal＞────</p><br/><p>│【Magic stone of Gentle Wind】</p><br/><p>│A magic stone that blows a gentle wind around.</p><br/><p>│The wind will become strong when magic power is applied.</p><br/><p>│Rarity: ★★</p><br/><p>└─────────</p><br/><p>┌─＜Appraisal＞────</p><br/><p>│【Magic stone of Spring Water】</p><br/><p>│A magic stone that gradually overflows with water.</p><br/><p>│The quantity of water will increase when magic power is applied.</p><br/><p>│Rarity: ★★</p><br/><p>└─────────</p><br/><p>┌─＜Appraisal＞────</p><br/><p>│【Magic stone of Refrigeration】</p><br/><p>│A magic stone that cools the surroundings.</p><br/><p>│The coolness will increase when magic power is applied.</p><br/><p>│Rarity: ★★★</p><br/><p>└─────────</p><br/><p>┌─＜Appraisal＞────</p><br/><p>│【Magic stone of Faint Light】</p><br/><p>│A magic stone that shines faintly.</p><br/><p>│The light will become brighter when magic power is applied.</p><br/><p>│Rarity: ★★★</p><br/><p>└─────────</p><br/><p>┌─＜Appraisal＞────</p><br/><p>│【Magic stone of Ignition】</p><br/><p>│A magic stone that gradually warms up.</p><br/><p>│It will become hotter when magic power is applied.</p><br/><p>│Rarity: ★★★</p><br/><p>└─────────</p><br/><p>There’s a magic stone of each attribute except the magic stone of Earth and Darkness.</p><br/><p>「Huh? Then, is there a magic stone of lightning?」</p><br/><p>「There is but since there is no use for it, I’m not displaying it in the shop.」</p><br/><p>┌─＜Appraisal＞────</p><br/><p>│【Magic stone of Biribiri】</p><br/><p>│A magic stone that makes *biribiri* when touched.</p><br/><p>│The *biribiri* becomes stronger when magic power is applied.</p><br/><p>│Rarity: ★★★</p><br/><p>└─────────</p><br/><p>「It makes *biribiri*?」</p><br/><p>「Yeah, just *biribiri* and nothing else.」</p><br/><p>「I see, well then―</p><br/><p>please, sell all your magic stone of biribiri to me!」</p><br/><p>「Huh!? Magic stone of biribiri?」</p><br/><p>This is something good! I want it all.</p><br/><p>「I understand. If such a thing is enough, I’ll give them all to you.」</p><br/><p>I obtained a huge quantity of【Magic stone of Biribiri】.</p><br/><p>「Then, could you also tell us about the magic stone replication?」</p><br/><p>「Okay, I understand.」</p><br/><p>Craftsman-san took out a【Magic stone】from a bag.</p><br/><p>「This thing is called【Magic stone of Nullpo】.」</p><br/><p>「Nullpo?」</p><br/><p>「Yes, you’ll find【Magic stones】in『Mines』and『Dungeons』. In『Dungeons』, you’ll find【Special magic stones】and【Attribute magic stones】. In『Mines』, you can mine【attribute magic stones】and this【Magic stone of Nullpo】.」</p><br/><p>Craftsman-san took out the【Magic stone replication tool】. He set the【Magic stone of Ignition】and【Magic stone of Nullpo1】on it and began to apply magic power.</p><br/><p>After a while, the【Magic stone of Nullpo】became red in color and turned into【Magic stone of Ignition】.</p><br/><p>「In this way, the【Magic stone of Nullpo】can be turned into another magic stone using【Magic stone replication tool】.」</p><br/><p>「I see, it can replicate in this way.」</p><br/><p>「With this【Magic stone replication tool】and【Magic stone of Nullpo】, we were forced to make a『Mysterious magic stone』back there. Because I managed to take it out from that village with your help, please take them.」</p><br/><p>「Is it okay?」</p><br/><p>「Of course, you saved us after all.」</p><br/><p>「Then, I’ll gratefully accept.」</p><br/><p>We left the shop after we obtained the【Magic stone replication tool】,【Magic stone of Nullpo】and【Magic stone of Human Transformation】and returned to Japan.</p><br/><p>Translator notes and reference:</p><br/><p>1Nullpo means null pointer/null pointer exception, this is a term often used in programming.↩</p><br/>\n</div>"}