{"title": "Chapter 90 – Attribute reinforcement magic stone", "id": 90, "volume": 1, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-90-%E2%80%93-attribute-reinforcement-magic-stone", "volume_title": "Volume 1", "body": "<h1>Chapter 90 – Attribute reinforcement magic stone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>We went to the magic stone shop in Ikebu town.</p><br/><p>「Hello.」</p><br/><p>「Hey there, Seiji-san. Welcome.」</p><br/><p>The shop manager of the magic stone shop is the one we had saved some time ago, it seems his name is『Kiseri』.</p><br/><p>「Kiseri-san, how are you after that?」</p><br/><p>「Thanks to you, I can work energetically. Is there something you need today?」</p><br/><p>「I came here because I heard that【Attribute reinforcement magic stone】is being sold here.」</p><br/><p>「【Attribute reinforcement magic stone】, huh. I can prepare it immediately if it’s Wind, Water and Earth.」</p><br/><p>「What I need are Lightning, Ice, Darkness and Light but……」</p><br/><p>「If it’s Ice and Darkness, I can prepare them if you can wait for about a month more. The same with Lightning and Light……」</p><br/><p>「Does it really take a month?」</p><br/><p>「When making Ice and Darkness【Attribute reinforcement magic stone】, you need to request a magician who can use those magic directly. Since there’s also time between contacting and going here, it really takes time.」</p><br/><p>I was hesitating whether to tell him or not that I could use those magic―</p><br/><p>I decided to make a proposal.</p><br/><p>「If I bring a magician who can use those magic here, will you teach him how to make it?」</p><br/><p>「Huh?」</p><br/><p>「Of course, I’ll also promise not to sell the crafted【Attribute reinforcement magic stone】.」</p><br/><p>「U-, Um… you’re my benefactor so I don’t particularly mind. But, a magician who can use such rare attribute magic is always busy, to comply easily……」</p><br/><p>「Please keep what I’m going to say after this a secret.」</p><br/><p>「Y-, Yes.」</p><br/><p>「I can use Darkness and Ice magic.」</p><br/><p>「N? Eee!?」</p><br/><p>「*Hush!*」</p><br/><p>「Ah, I-, I’m sorry. Is it true!?」</p><br/><p>I displayed【Shadow control】and【Generate ice】.</p><br/><p>「A-, Amazing! A person who can use both Darkness and Ice!」</p><br/><p>If I say I can also use Lightning, he might collapse.</p><br/><p>「With that, can you teach me how to make it?」</p><br/><p>「Yes! Of course.」</p><br/><p>Kiseri-san brought a【Magic stone of Nullpo】again from the back and placed it on top of the table.</p><br/><p>「【Magic stone of Nullpo】?」</p><br/><p>「Yes. By channeling 2 magic simultaneously to this, the【Attribute reinforcement magic stone】will be completed.」</p><br/><p>「Two magic?」</p><br/><p>「The first one is the attribute magic of the attribute you’d like to create, while the other one is the magic,【Magic power reinforcement】of【Body reinforcement magic】.」</p><br/><p>「【Magic power reinforcement】? So there’s such a magic.」</p><br/><p>「Right, because I can do【Magic power reinforcement】, I need Seiji-san’s attribute magic. Let’s start with【Ice magic】, would that be alright?」</p><br/><p>「Okay, I understand.」</p><br/><p>Kiseri-san and I placed a hand on【Magic stone of Nullpo】and held it between our hands.</p><br/><p>「Well then, let’s do it. 3, 2, 1, go!」</p><br/><p>Along with the cue, I channeled the【Ice magic】to the【Magic stone of Nullpo】.</p><br/><p>The【Magic stone of Nullpo】shone for a while.</p><br/><p>「Okay, it’s fine now.」</p><br/><p>The light settled down when I released my hold and the【Magic stone of Nullpo】turned into a light-blue magic stone.</p><br/><p>The【Appraisal】showed that it had become【Ice reinforcement magic stone】.</p><br/><p>「So, this is how it was created.~」</p><br/><p>「Y-, Yes… t-, that’s… right.」</p><br/><p>Looking suddenly to Kiseri-san, his complexion had become worse.</p><br/><p>「Kiseri-san, what happened!?」</p><br/><p>「This… operation… used up… considerable… magic power… but…… *haaa haaa*…… Seiji… -san’s… magic power… is enormous.」</p><br/><p>「Is that so!?」</p><br/><p>When I confirmed it myself, the MP had been decreased by about 100.</p><br/><p>It wasn’t a big deal for me. But for other people, 100 MP was a fair amount.</p><br/><p>「How did you learn how to use【Magic power reinforcement】?」</p><br/><p>「I think… you can learn how to use it… with a little practice of【Body reinforcement magic】.」</p><br/><p>「Is that so? Then, I’ll try to practice it.」</p><br/><p>「Huh!? Is it possible that you can also use【Body reinforcement magic】?」</p><br/><p>「Ah…… yeah, that’s right.」</p><br/><p>Oops, I unintentionally made a slip of the tongue.</p><br/><p>「Nothing, it really makes one jealous……」</p><br/><p>「Please, keep it a secret.」</p><br/><p>「Yes!」</p><br/><p>Oh, he seems to be a serious person, it would be fine.</p><br/><p>「So, this【Ice reinforcement magic stone】…… will you let me buy it?」</p><br/><p>「No need to buy it, because Kisari-san taught me how to create it, it’s yours.」</p><br/><p>「Such… usually, the work of channeling【Ice magic】receives a fair amount of money, so it won’t do.」</p><br/><p>「Then in exchange, can I have some interesting magic stone?」</p><br/><p>「I see. Suited for Seiji-san, right?」</p><br/><p>Kiseri-san brought a magic stone with strange shape from the back.</p><br/><p>「How about this?」</p><br/><p>「It’s a strange magic stone.」</p><br/><p>The magic stone’s shape is like a『Bottle gourd』.</p><br/><p>「This is called【Twin magic stone】, it was recently unearthed and a rare magic stone to some extent.」</p><br/><p>「About this【Twin magic stone】, can this be separated into two and combined into one?」</p><br/><p>「Yes.」</p><br/><p>Kiseri-san showed me how to detached the two attaching【Twin magic stone】.</p><br/><p>「In this way, it can be separated into two and they will stick together like a little while ago when you brought them close to each other.」</p><br/><p>「Just stick together?」</p><br/><p>「No no! Well, please wait here with it one of the pair.」</p><br/><p>Kiseri-san said so and gave me one of the magic stones, and moved to a slightly remote position.</p><br/><p>「Well then, I will now make the【Twin magic stone】vibrate.」</p><br/><p>*Tap tap*</p><br/><p>As Kiseri-san tapped the【Twin magic stone】he held―</p><br/><p>The【Twin magic stone】counterpart I held was similarly vibrating.</p><br/><p>「Oh!? It’s vibrating.」</p><br/><p>「That’s right, this【Twin magic stone】transmits a vibration to its counterpart. No matter how far, the counterpart magic stone will also vibrate in the same way.」</p><br/><p>「I seen, it’s an interesting magic stone.」</p><br/><p>「Well, because it only does that, it’s not that useful. Recently, it became popular by making two pendants with this magic stone and lovers wear it to ascertain their love with each other.」</p><br/><p>「That’s wonderful.」</p><br/><p>「I don’t know if it could be of help to you but how about it?」</p><br/><p>「Okay!! This is good!! I want more of this, do you have more?」</p><br/><p>「I’m sorry, there’s only this one set currently. The people who dig out magic stones have been borrowed for war. I think it would be difficult until the war is over.」</p><br/><p>「Is that so? When the war is over, can you procure this for me?」</p><br/><p>「Yes, I understand! I’ll procure it.」</p><br/><p>I shook hands with Kiseri-san and left the shop.</p><br/><p>「Oniichan, why do you want to obtain too many【Twin magic stone】? To make a harem and have them wear【Twin magic stone】pendants each?」</p><br/><p>「Well, look.」</p><br/><p>I took out paper cups and Sellotape from the inventory. I attached each part of【Twin magic stone】at the bottom of the paper cup one at a time.</p><br/><p>「Elena, hold this.」</p><br/><p>「Y-, yes.」</p><br/><p>I distance myself a little and talk in the paper cup.</p><br/><p>『Hello, Elena. Do you hear me?』</p><br/><p>At the other side, Elena was surprised.</p><br/><p>『Seiji-sama, I can hear you! How did this happen?』</p><br/><p>『Because sounds produce vibrations in the air. It’s possible to transmit vibrations at a distance using【Twin magic stone】.』</p><br/><p>『I-, It’s amazing!!』</p><br/><p>Now then, what should I use this unexpected product for?~</p><br/>\n</div>"}