{"title": "Chapter 102 – New weapon", "id": 102, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-102-%E2%80%93-new-weapon", "volume_title": "Volume 2", "body": "<h1>Chapter 102 – New weapon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When I returned to where Elena was, Elena and the adventurers were praising each other for the victory.</p><br/><p>「Elena, this place seemed to have cleared up.」</p><br/><p>「Seiji-sama, it’s the best that you’re safe.」</p><br/><p>When Elena found me, she threw herself into my arms and embraced me.</p><br/><p>But, Elena’s actions created unexpected state of affairs in the surroundings, though Elena herself didn’t notice it.</p><br/><p>The adventurers in the surroundings glared at me all at once.</p><br/><p>(Who is this guy?)</p><br/><p>(Someone who nonchalantly turned up after the battle was over?)</p><br/><p>(Embracing our idol, Elena-chan. He deserves to die 10000 times.)</p><br/><p>Such heartfelt voices filled with emotions and dreadful gazes, went through me.</p><br/><p>「Elena-san. Let’s entrust this place to everyone here, we must go the the next place.」</p><br/><p>「That’s right, I understand!」</p><br/><p>Elena, after saying goodbye to the adventurers, disappeared into the town’s back street along with me.</p><br/><p>『Who is that fellow!?』</p><br/><p>『He’s flirting with my Elena!』</p><br/><p>『Who is yours!? Elena belongs to me!』</p><br/><p>From the back, I thought I heard quarreling voices. Let’s pretend I didn’t hear anything, in order for us to escape, we teleport towards Ikebu town.</p><br/><p>***</p><br/><p> When we have arrived in Ikebu town, the soldiers are tense.</p><br/><p>There is indeed a horde of goblin on the way to the town but it’s still alright today.</p><br/><p>One’s body won’t last long if he’s too tense.</p><br/><p>When I went to the inn where Lela is, the soldiers at the entrance let us through with face pass.</p><br/><p>On the contrary, their attitude was almost like telling us, “I was waiting”.</p><br/><p>When we entered Lela’s room―</p><br/><p>I’ve been embraced by Lela.</p><br/><p>How did this happen!?</p><br/><p>「Lela, what’s wrong?」</p><br/><p>「Though you said you’ll rush immediately, why didn’t you come sooner!? What are you going to do if by any chance, I’m attacked!?」</p><br/><p>「It can’t be helped, the monsters haven’t made an attack yet!」</p><br/><p>「S-, Such, I don’t know! We just probably haven’t discovered them yet and they are hiding nearby!」</p><br/><p>「Don’t worry, they aren’t hiding nearby.」</p><br/><p>「T-, Truly!?」</p><br/><p>「Yah.」</p><br/><p>Last time, weren’t you enthusiastic to become a hero?</p><br/><p>Did she recall being taken away by High orcs that’s why she’s nervous again?</p><br/><p>「You want to become a hero, right?」</p><br/><p>「T-, That’s right……」</p><br/><p>「You’re the commanding officer of the troops left to defend this town! If you’re nervous, the soldiers will be too. Since the goblins will attack tomorrow, let the soldiers take a proper rest. If you don’t, they won’t last until tomorrow.」</p><br/><p>「Is that true!?」</p><br/><p>「Oh, I can grasp which position where the goblins are now at. So, take a rest too.」</p><br/><p>「Oh, I understand.」</p><br/><p>I told the soldiers outside Lela’s room the order the take a break.</p><br/><p>「Well then, since I’ll be going out in a bit, you take a rest properly.」</p><br/><p>「W-, W-, Where are you going!?」</p><br/><p>「It’s for weapons supply, because the current weapons are a bit unreliable.」</p><br/><p>「At any rate, there aren’t any weapon in this town’s weapon shop anymore, I’ve already collected everything for the defense of this town.」</p><br/><p>「It’s all right because I’ll go to other towns to buy.」</p><br/><p>「Other towns!?」</p><br/><p>「Didn’t you see it yesterday? Since I have teleportation magic, I can go there immediately.」</p><br/><p>「T-, Then, I will also come along.」</p><br/><p>「You’re the commanding officer. What kind of commanding officer leaves his troops behind?」</p><br/><p>「B-, But……」</p><br/><p>Really, she’s so frightened……</p><br/><p>That’s why the troops are tense.</p><br/><p>「Sorry, Elena. Please wait here for awhile.」</p><br/><p>「Okay, I understand.」</p><br/><p>Elena has Lela sit down and makes tea.</p><br/><p>Among other things you let a princess make tea, are you a person of importance?</p><br/><p>I left Lela to Elena and teleported to Nippo town using【Teleportation】.</p><br/><p>***</p><br/><p> I came over to Gamudo-san’s shop.</p><br/><p>「Helloo.」</p><br/><p>「Yo! Seiji. It’s unusual that you’re alone today. Did you obtain equipment with attribute reinforcement?」</p><br/><p>「Yes, I was able to gather everything.」</p><br/><p>「Oh, I see. What do you need today?」</p><br/><p>「Today, I would like to buy a weapon for myself.」</p><br/><p>「N? What happened to the Replica sword you bought previously?」</p><br/><p>「There was a guy who was difficult to deal with using Replica sword, I want a better one.」</p><br/><p>「What!? What did you fight against.」</p><br/><p>I should probably tell the truth to Gamudo-san.</p><br/><p>「Goblin Prince.」</p><br/><p>「Prince!!? Are you serious!?」</p><br/><p>「It’s true.」</p><br/><p>「I see, wait a moment.」</p><br/><p>Gamudo-san brought a sword from the back of the shop.</p><br/><p>「This here, is the best weapon I can sell in the shop.」</p><br/><p>Gamudo-san unsheathed the sword―</p><br/><p>Revealing a sword which shone in silver.</p><br/><p>It seemed somewhat great.</p><br/><p>I tried to use【Appraisal】―</p><br/><p>┌─＜Appraisal＞────</p><br/><p>│【Mithril sword】</p><br/><p>│Sword made from silver mithril.</p><br/><p>│Sharpness increases when magic power is applied.</p><br/><p>│Rarity: ★★★★</p><br/><p>└─────────</p><br/><p>「M-, Mithril?」</p><br/><p>「Oh, you recognized it well.」</p><br/><p>I received the mithril sword from Gamudo-san.</p><br/><p>Its weight and length fit perfectly in my hand.</p><br/><p>「You seem to like the sword. That sword is better than the Replica sword. That’s something you won’t be able to obtain unless you go to the Dwarf country. Until then, use that Mithril sword.」</p><br/><p>「Thank you. How much?」</p><br/><p>「I’d like to say ‘I need you to do something’ but, only priestesses would say that. It’s 50, 000 Aurum.」</p><br/><p>「I understand.」</p><br/><p>I forked out 500 pieces of 100 Aurum gold coins and put them on the table―</p><br/><p>「Wai-t, you-!」</p><br/><p>The table creaked and nearly broke.</p><br/><p>「Purchasing outright!?」</p><br/><p>「Is it bad?」</p><br/><p>「I intend to have you pay little by little and as interest during that time, I will request liquor each time. My plan was ruined.」</p><br/><p>「That’s, I’m sorry. Don’t worry, I will often come.」</p><br/><p>「I see, then it’s good.」</p><br/><p>Gamudo-san and I shook each other’s hands and laughed wildly.</p><br/><p>***</p><br/><p> Upon returning to Lela’s place―</p><br/><p>Elena and Lela are having a tea gracefully.</p><br/><p>「I’m back.」</p><br/><p>「「Welcome back.」」</p><br/><p>Elena is fine but it feels slightly strange being greeted by Lela.</p><br/><p>「So, what kind of weapon did you buy?」</p><br/><p>Thanks to Elena’s follow up, I seem to completely recover my composure.</p><br/><p>「Here.」</p><br/><p>When I remove the sword from the sheath, the two people’s eyes brightened.</p><br/><p>Especially the brightness of Lela’s eyes, it’s like the eyes of a maiden in love.</p><br/><p>「That’s, Mithril!?」</p><br/><p>「Oh, yes.」</p><br/><p>「My rapier is also mithril!!」</p><br/><p>As Lela said so, she retrieved her rapier and put it on top of my sword.</p><br/><p>「Oh, Lela’s is mithril as well?」</p><br/><p>「Y-, yeah. I-, It’s the same.」</p><br/><p>As Lela said so, she pleasantly smiled at me.</p><br/><p>Did Lela like mithril that much?</p><br/><p>Perhaps, she has some sort of mithril fetish?</p><br/><p>「By the way, it’s now late so, shall we look for an inn?」</p><br/><p>I put the sword away and tried to depart―</p><br/><p>「W-, Wait. Why don’t you stay here?」</p><br/><p>「Here? Isn’t this place reserved?」</p><br/><p>「It’s my room. So, y-, y, you may stay at this room!」</p><br/><p>「Isn’t there only 1 bed in this room?」</p><br/><p>「Y-, Yeah……」</p><br/><p>In the end, we received vacant rooms at both sides of Lela’s and decided to stay there.</p><br/>\n</div>"}