{"title": "Chapter 105 – Iron wall’s legend", "id": 105, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-105-%E2%80%93-iron-wall%E2%80%99s-legend", "volume_title": "Volume 2", "body": "<h1>Chapter 105 – Iron wall’s legend</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Goblin Prince!</p><br/><p>Isn’t it strange, appearing when the other goblins were completely wiped out?</p><br/><p>Its size and muscles were bigger than the Prince yesterday but it seemed to be dumber instead.</p><br/><p>*Thud thud* The Goblin Prince approached slowly, causing earth tremors.</p><br/><p>It felt like a detached house approaching.</p><br/><p>The soldiers and adventurers lost their confidence.</p><br/><p>They got a cold feet, backing away little by little.</p><br/><p>Lela turned around and looked behind. Raising her rapier, she shouted!</p><br/><p>「Everyone, retreat!」</p><br/><p>The adventurers and soldiers, who were waiting, began to retreat without looking back.</p><br/><p>Well, it can’t be helped. They did their best up to this point, we’re going to take care of the rest……</p><br/><p>However, Lela, who ordered the retreat, stayed in place despite her legs trembling.</p><br/><p>Contrary to expectations, she was too frightened to run away.</p><br/><p>Lela turned towards the Prince. She readied her shield and rapier once again.</p><br/><p>Although her legs were trembling, she did well.</p><br/><p>Elena and I held our weapons and joined Lela.</p><br/><p>I put【Slow】on the Prince and【Quick】on the 3 of us.</p><br/><p>The Prince swung down its ax towards Lela.</p><br/><p>I set up a【Barrier】when the ax was about to hit Lela’s shield, suppressing its power. From Lela’s whole body, *creak creak* unpleasant sounds can be heard.</p><br/><p>Lela grimaced in pain.</p><br/><p>Elena quickly recovered Lela’s wounds and strength using【Recovery magic】.</p><br/><p>Some of the soldiers heard the sound of collision of the Prince’s ax and Lela’s shied, they looked back to see what happened.</p><br/><p>Then, the soldiers seeing the others stopped, one after another stood in place.</p><br/><p>No matter how many times the ax lunged forwards, Lela blocked it with the shield. And, Elena healed the damage quickly.</p><br/><p>During that interval, I snuck around behind the Prince and hacked its back.</p><br/><p>The Prince’s body obstructed the view of my position from soldiers and adventurers.</p><br/><p>Due to the Prince being attacked in the back, its attacks became weak.</p><br/><p>Lela was able to gradually receive its attacks even without【Barrier】.</p><br/><p>The Prince, who was attacked from the back, got furious and finally became enraged. It turned around and attacked with all its might.</p><br/><p>However, I wasn’t there anymore. It’s movements were too slow.</p><br/><p>Due to the Prince turning around, its back was exposed to Lela and became defenseless.</p><br/><p>Making the opportunity count, Lela attacked continuously, piercing the Prince’s back many times.</p><br/><p>The Prince couldn’t withstand Lela’s accumulated attacks and collapsed.</p><br/><p>The Prince fell, like a collapsing building, it produced a tremendous sound.</p><br/><p>「「Uooooo!!」」</p><br/><p>Cheers broke out from behind and I looked behind to see what it was.</p><br/><p>The soldiers, who stood still in a remote position approximately 50 steps away, cheered towards Lela.</p><br/><p>The adventurers looked this way at a further distance approximately 100 steps away.</p><br/><p>Lela gasped for breath.</p><br/><p>And, pleasantly smiled towards me.</p><br/><p>I still faced towards the Prince, holding my weapon. Lela glanced towards the Prince as well.</p><br/><p>「Guwoooooo!!」</p><br/><p>The fallen Prince stood up and raised a battle cry. It madly glared towards Lela with anger in its eyes.</p><br/><p>Lela undauntedly glared back at the Prince.</p><br/><p>「「Guoo!」」</p><br/><p>When the Prince raised a battle cry once again, it poured power into the axe it held and the axe began to emit a strange light.</p><br/><p>Does it plan to use some technique!?</p><br/><p>The【Vigilance】magic informed me of『Danger』. This is bad.</p><br/><p>I dashed towards the Prince, so that it would chase after me instead of Lela.</p><br/><p>However, as if the Prince was carefully aiming at Lela, it approached her and swung down its ax which shone in strange light.</p><br/><p>I threw【Lightning fist】at once, trying to stop the Prince’s attack.</p><br/><p>Based on the ax’s inertia, as it is, it will hit Lela.</p><br/><p>I set up a【Barrier】but even so, it was also penetrated―</p><br/><p>It slammed into the mithril shield Lela poised and an earth-shattering sonic boom resounded throughout the area. </p><br/><p>Lela fell on her knees but she completely blocked the Prince’s ax with nothing but her shield.</p><br/><p>If you look closely, Lela’s shield was also wrapped in some kind of light. I wonder if she used some kind of shield technique.</p><br/><p>Still, Lela’s body received an impact, blood flowed from all over. It was clear that her strength greatly diminished.</p><br/><p>Elena restored Lela’s strength immediately.</p><br/><p>The Prince finally recovered itself from【Lightning fist】’s numbness and tried to pursue. </p><br/><p>Whether it reached its strength limit, it couldn’t move its foot forwards.</p><br/><p>The Prince also fell on its knees.</p><br/><p>Then, Lela, who had her strength recovered by Elena, stood up straight.</p><br/><p>Towards the Prince who could only scowl without being able to stand up, Lela poised her rapier and poured power into it.</p><br/><p>Lela’s rapier was wrapped in faint light.</p><br/><p>In the next instant!</p><br/><p>Lela’s rapier pierced deeply through the Prince’s forehead.</p><br/><p>The Prince slowly fell down on its back, completely dead.</p><br/><p>「「Uooooooooooooooooo!!」」</p><br/><p>The soldiers, who were watching around from the distance, raised a loud shout.</p><br/><p>They swarmed towards Lela’s position.</p><br/><p>Lela, towards the gathered soldiers,</p><br/><p>「Withdraw!」</p><br/><p>shouted.</p><br/><p>And, she lost consciousness and fell forward.</p><br/><p>I immediately caught her, preventing her from falling onto the ground.</p><br/><p>Repeated damage and recovery many times, she was probably quite exhausted mentally.</p><br/><p>She overdid herself a little too much……</p><br/><p>When I held Lela in princess carry, the soldiers briefly opened up a path.</p><br/><p>In the meantime, I walked towards the town while holding Lela.</p><br/><p>When we entered the town, the townspeople lined up on both sides and gave a grateful applause toward the soldiers, adventurers and the unconscious Lela.</p><br/><p>Afterwards, Lela has been remembered as a hero who defended the Ikebu town from the attack of the Goblin Prince’s army and survived with only 150 people. It was handed down from generation to generation.</p><br/>\n</div>"}