{"title": "Chapter 119 – Demon lord-sama’s fighting style", "id": 119, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-119-%E2%80%93-demon-lord-sama%E2%80%99s-fighting-style", "volume_title": "Volume 2", "body": "<h1>Chapter 119 – Demon lord-sama’s fighting style</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Demon lord-sama held a pitch-black Japanese sword.</p><br/><p>Cool! I want that katana!!</p><br/><p>『What’s wrong, Seiji? It’s dangerous for you to look away.』</p><br/><p>That’s right,</p><br/><p>I put【Slow】on the Goblin King and【Quick】on Aya, Demon lord-sama and me, and prepared the Mithril sword.</p><br/><p>『What’s this? It’s similar to body reinforcement magic.</p><br/><p>Were you the one who put it on, Seiji?』</p><br/><p>『Ah, yes. The magic has similar effect to【Movement speed reinfocement】.』</p><br/><p>『I see, humans’ magic is interesting.』</p><br/><p>While having such a talk―</p><br/><p>The Goblin King swung down its enormous club.</p><br/><p>I promptly took a distance.</p><br/><p>The Demon lord-sama took on the club with the pitch-black Japanese sword.</p><br/><p>At the same time, the ground shook.</p><br/><p>The Demon-lord-sama was as fit as a fiddle.</p><br/><p>『Hou, it has considerable offensive power,</p><br/><p>No wonder even Bunmi was injured.』</p><br/><p>Huh? Something is strange.</p><br/><p>When Bunmi-san blocked the King’s attack, the area under his feet became a crater.</p><br/><p>But it didn’t happen in the case of the Demon lord-sama.</p><br/><p>The Demon-lord took on the King’s attack 2 times, 3 times. Each time, a wave-like ripples spread through the ground.</p><br/><p>That’s it! Diffusing the impact using Earth magic!</p><br/><p>I immediately jump to test it out,</p><br/><p>as I land, I tried to diffuse the impact with Earth magic.</p><br/><p>Interesting! Although the ground’s surface is soft, it feels like concrete when I jump.</p><br/><p>Perhaps……</p><br/><p>I tried to further increase the impact I absorb from the ground.</p><br/><p>This time, I can jump similar to a trampoline!</p><br/><p>『Oy, Seiji. What are you playing at?』</p><br/><p>「Oh, I’m sorry. Just, it seemed interesting.』</p><br/><p>I’ve been scolded by the Demon lord-sama. The Demon lord-sama began to fight the King and isn’t it somewhat difficult to make a move on?</p><br/><p>Aya was troubled and didn’t know what to do.</p><br/><p>「Nee, oniichan. Who’s that person?」</p><br/><p>「That man is the Demon lord-sama.」</p><br/><p>「Ee, so that person is the Demon lord, huh.</p><br/><p>What were you doing a little while ago, oniichan?</p><br/><p>You made strange movements.」</p><br/><p>「Look at the Demon lord-sama’s feet carefully.」</p><br/><p>「Ah, he’s doing some kind of magic!」</p><br/><p>「That’s right, I was imitating it.」</p><br/><p>「How do you do that?」</p><br/><p>「Absorb the impact on the ground with magic.」</p><br/><p>「Absorb the impact?」</p><br/><p>「You do it like this.」</p><br/><p>I showed it by running and jumping.</p><br/><p>「I see, I’m going to try it as well.」</p><br/><p>As Aya said so, she began to run around the Goblin King quickly using the Earth magic’s impact.</p><br/><p>『You guys have been annoying since a little while ago!</p><br/><p>Be quiet.』</p><br/><p>『Sorry.』</p><br/><p>「Aya, it seems it annoys the Demon lord-sama.」</p><br/><p>「I didn’t know.」</p><br/><p>Aya, snuck around behind the King’s back and began to attack its foot.</p><br/><p>The Goblin King seemed to be annoyed by Aya’s attack and occasionally tried to stomp its foot.</p><br/><p>It’s dangerous.</p><br/><p>It can’t be helped, I’m going to fight as well.</p><br/><p>I kicked the ground with Earth magic, increasing my speed, and charged toward the Goblin King.</p><br/><p>The single blow of the Mithril sword had been nearly warded off, dealing a 30 cm deep scratch.</p><br/><p>The Goblin King grimaced from the pain and scowled at me.</p><br/><p>That action caused it to take its eyes off of Demon lord-sama for an instant.</p><br/><p>Demon lord-sama didn’t overlook the chance,</p><br/><p>with a single blow of the Demon lord-sama’s Japanese sword,</p><br/><p>30 cm below the knee of the Goblin King’s left leg had been completely severed.</p><br/><p>As one would expect, the Goblin King could not remain standing,</p><br/><p>and fell down on its knees……</p><br/><p>In the next instant!</p><br/><p>……</p><br/><p>Demon lord-sama landed and sheathed the Japanese sword―</p><br/><p>Behind him,</p><br/><p>with a *goron*, the Goblin King’s head rolled over to the ground.</p><br/><p>Fa!? When did Demon Lord-sama attack!?</p><br/><p>The Goblin King, who had been decapitated,</p><br/><p>keeled over just like that.</p><br/><p>The impact resounded throughout the surroundings.</p><br/><p>The Demon lord-sama held the freshly-severed head of the Goblin King,</p><br/><p>raising it up high.</p><br/><p>『『『Uooooo!!』』』</p><br/><p>『Demon lord-sama defeated the Goblin King!!』</p><br/><p>The demonkind soldiers cheered.</p><br/><p>The surviving goblins, who saw the freshly-severed head of the Goblin King, escaped at full speed.</p><br/>\n</div>"}