{"title": "Chapter 112 – Goblins vs. Adventurers", "id": 112, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-112-%E2%80%93-goblins-vs-adventurers", "volume_title": "Volume 2", "body": "<h1>Chapter 112 – Goblins vs. Adventurers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Dozen of goblins were lured in by the reconnaissance unit―</p><br/><p>Rachel-san created huge pit using Earth magic,</p><br/><p>Cassandra-san blew off the enemies, who detoured around the pit, throwing them into it using wind gust,</p><br/><p>and Misha-san drowned the fallen goblins.</p><br/><p>Having said that though, the ones who were attacking were normal goblins, in spite of that, the offensive was excessive.</p><br/><p>「Well, it feels good without worrying about the remaining magic power.」</p><br/><p>「Rachel~, the enemies are weak, they are unsatisfactory.~</p><br/><p>But even so, I can especially use magic freely.~」</p><br/><p>「That’s right, Misha.</p><br/><p>Oy, people from reconnaissance unit! </p><br/><p>Lure in a bit more goblins this time.」</p><br/><p>「Understood!」</p><br/><p>The adventurers seeing Rachel and the others’ magic, seemed to hold them in reverence,</p><br/><p>the people from reconnaissance unit obediently followed Rachel’s command.</p><br/><p>When Rachel and the others finished restoring their magic power with candies,</p><br/><p>the reconnaissance unit returned with about 100 goblins in tow.</p><br/><p>This time, not only goblins, there were also about 3 hobgoblins mixed in as well.</p><br/><p>「There are High Ranks!</p><br/><p>Misha, Cassandra, go on the usual offensive!」</p><br/><p>「Ye~s.」「Understood.」</p><br/><p>Misha-san created a huge amount of water.</p><br/><p>Cassandra-san hauled up the goblins with waterspout.</p><br/><p>Finally, Rachel-san threw a huge amount of stone pellets at the hauled up goblins, making them writhe in pain.</p><br/><p>The combination attack of the 3 finished off about 80% of the enemies but the 3 people had been exhausted of magic power.</p><br/><p>Leaving the remaining goblins and the hobgoblins which they didn’t manage to beat to the other adventurers.</p><br/><p>「Hilda, give me candy.」</p><br/><p>「Yes!」</p><br/><p>「Here as well, Hilda.~」「Me too.」</p><br/><p>「Yes!!」</p><br/><p>Hilda handed out candies to everybody energetically.</p><br/><p>「Aren’t we going to help, oniichan?」</p><br/><p>「We’ll also help but we must use only 1 attribute as to not attract attention.」</p><br/><p>「Eh, it’s troublesome.」</p><br/><p>「It can’t be helped.」</p><br/><p>「I got it already.~」</p><br/><p>Both Aya and I used【Ice magic】and slowly support the adventurers.</p><br/><p>Each hobgoblin was separated individually and were surrounded by several people. Other magicians attacked them with magic and were able to defeat them somehow.</p><br/><p>Some injured people also appeared but since there are also healers, they had been tasked to treat those people while licking candy.</p><br/><p>The battle was over and there were several people who had been exhausted of magic power,</p><br/><p>Hilda, with candies in hand, ran about the battlefield.</p><br/><p>After a while, the reconnaissance unit returned.</p><br/><p>This time, they brought along 200 goblins.</p><br/><p>「I’m sorry! It’s a bit too much!!」</p><br/><p>Rachel and the others made a continuous attack,</p><br/><p>but since there were some enemies who managed to avoid their attack,</p><br/><p>Aya and I also cast area attack ice magic, reducing their numbers.</p><br/><p>With that, almost all normal goblins were annihilated―</p><br/><p>and about 10 hobgoblins survived.</p><br/><p>「I’m going to help as well.」</p><br/><p>「I’m going too, oniichan.」</p><br/><p>Me with magic rod and Aya with Japanese-made knife, charged towards the hobgoblins.</p><br/><p>Aya weaved her way through the gaps between the adventurers and approached the rightmost hobgoblin, successively hitting its neck.</p><br/><p>Opposite to Aya, I approached the leftmost hobgoblin with the magic rod in hand,</p><br/><p>and sent it flying at a 45-degree angle to south-southwest.</p><br/><p>The hobgoblin flew with good momentum and disappeared into the distance.</p><br/><p>After the 200 enemies were annihilated, we decided to take a break for a moment.</p><br/><p>During the break,</p><br/><p>Hilda came over to me and handed me a candy.</p><br/><p>「Thank you.」</p><br/><p>When I pat Hilda’s head for giving me a candy,</p><br/><p>Hilda pleasantly smiled.</p><br/><p>「Your mouth is extending, oniichan.」</p><br/><p>「It’s not extending!」</p><br/><p>While having such silly talk―</p><br/><p>On the map, I noticed a group approaching here.</p><br/><p>「They’re coming!?」</p><br/><p>「Who is coming, oniichan?」</p><br/><p>「A part of the demon army is approaching here.」</p><br/><p>「N!? Isn’t it dangerous?」</p><br/><p>「Rachel-san!</p><br/><p>The demon lord’s army is approaching here.」</p><br/><p>「What did you say!!?」</p><br/><p>「The approaching demon army is about 3, 000.</p><br/><p>They are coming from south-southwest.</p><br/><p>Since it will become a pincer attack if this continues,</p><br/><p>I think we should retreat to the east.」</p><br/><p>「Alright, understood!</p><br/><p>Listen to me everyone!</p><br/><p>The Demon army is approaching here!</p><br/><p>We’ll retreat to the east for a moment!!」</p><br/><p>「「Ou!」」</p><br/><p>The adventurers started to move eastwards by Rachel’s command.</p><br/><p>「Oniichan, the south-southwest direction……</p><br/><p>wasn’t it the direction where oniichan sent the hobgoblin a little while ago?」</p><br/><p>「Oh, that’s right. It’s a bait for the demon army.」</p><br/><p>「Bait?」</p><br/><p>「If there has been a flashy magical battle within the forest and a hobgoblin flying over from there, who would feel worried about it?」</p><br/><p>「Then, are we going to let the goblins and demon army fight against each other while we watch as mere spectators?」</p><br/><p>「No, we’re going to defeat the Goblin King with the demon army.」</p><br/>\n</div>"}