{"title": "Chapter 111 – Start of War", "id": 111, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-111-%E2%80%93-start-of-war", "volume_title": "Volume 2", "body": "<h1>Chapter 111 – Start of War</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Next morning, Aya and I said our goodbye to Elena.</p><br/><p>「Elena, I’m off.」</p><br/><p>「Elena-chan, see you later.」</p><br/><p>「Seiji-sama, Aya-chan……</p><br/><p>As expected, I’d like to go as well. Please, bring me along.」</p><br/><p>「It’s no good. This time, Elena is participating in this war as a princess rather than an adventurer. </p><br/><p>So, it’s not a position that moves easily, is it?」</p><br/><p>「Y-, yes.」</p><br/><p>「Well then, lend me the magic rod.</p><br/><p>So I can also fight Elena’s part.」</p><br/><p>「Okay, I understand.」</p><br/><p>I received the magic rod from Elena.</p><br/><p>I, along with Aya, went to the rendezvous point.</p><br/><p>Upon arriving at the rendezvous point, 2, 000 adventurers had been assembled.</p><br/><p>「Hey, newbie. This way.」</p><br/><p>「Hey there, Rachel-san.」</p><br/><p>Rachel-san brought along everyone from the magician unit.</p><br/><p>Busty Misha-san was still hostile with Aya.</p><br/><p>Cassandra the Nekomimi seemed to be drowsy,</p><br/><p>and Hilda, who was carrying a great deal of luggage again, came as well.</p><br/><p>「By the way, newbie. Who’s that woman next to you?</p><br/><p>Your woman?」</p><br/><p>「It’s my imouto.」</p><br/><p>I introduced Aya to everyone of the magician unit.</p><br/><p>Aya seemed to be worried about Hilda, who was made to work as a luggage carrier.</p><br/><p>After a while, Lyle Gewalt appeared before the assembled adventurers.</p><br/><p>Lyle Gewalt went up to the morning-assembly-like pedestal and began to explain this time’s strategy to the adventurers.</p><br/><p>「Adventurers,</p><br/><p>I’m Lyle Gewalt.</p><br/><p>This time’s strategy will now be explained so listen carefully.」</p><br/><p>Lyle Gewalt explained that the Goblin King’s army is inside the forest and gave a subjugation order to the adventurers but……</p><br/><p>reluctantly said nothing about the fact that in the midst of the goblin army, the『King』is there.</p><br/><p>While concealing such important information, you’re letting them fight!?</p><br/><p>Such a heartless fellow.</p><br/><p>「Rondo・Warstar will designate the specific strategy.」</p><br/><p>Being called by Lyle Gewalt, Rondo climb up to the morning-assembly-like pedestal.</p><br/><p>「Kyaa! You’re so cool, Rondo-sama.~」</p><br/><p>You’re so noisy, Misha-san!</p><br/><p>「I’m Rondo. I will now designate the specific strategy.</p><br/><p>First, Rachel, come over here.」</p><br/><p>「N!? Me!?」</p><br/><p>Being called suddenly, Rachel went up to the morning-assemby-like pedestal with a tense look.</p><br/><p>For some reason, Misha and Cassandra went with Rachel as well.</p><br/><p>You guys weren’t called.</p><br/><p>「Oh, unbelievably big breasts.」</p><br/><p>The adventurers cheered towards Misha-san? But, it reached, improving Misha-san’s mood, she fought back with a flying kiss.</p><br/><p>What did you really go there for?……</p><br/><p>「Ahem! This person…these people are the members of the magician unit of our army. </p><br/><p>I want the people with combat experience with magic be move temporarily to this unit.」</p><br/><p>From the adventurers, about 30 magicians were selected and have been temporarily incorporated into the magician unit.</p><br/><p>「In any case, the goblin army has a large number.</p><br/><p>First, the magician unit will reduce their numbers,</p><br/><p>and the rest of you will attack and crush the discrete remainder.」</p><br/><p>Aya will belong to this unit as well.</p><br/><p>「The commander on-site is……</p><br/><p>Rachel. I entrust the command to you.」</p><br/><p>「M-, Me!? I-, I understand.」</p><br/><p>Rachel-san is the leader of the adventurers!?</p><br/><p>「Then, everybody, make a sortie!」</p><br/><p>With Lyle Gewalt’s command, the adventurers made a sortie for the goblin subjugation.</p><br/><p>***</p><br/><p>「I’m with the leader of this unit again.~」</p><br/><p>「Since I’m always the leader, isn’t it fine? I will display my best to Rondo-sama as well!」</p><br/><p>「By the way, leader.」</p><br/><p>「What is it, newbie?」</p><br/><p>「When a formidable enemy, who seems like we can’t beat, appears, what would we do?」</p><br/><p>「Haa!? There are 2, 000 adventurers, it would be impossible to not beat a goblin.」</p><br/><p>「There might be High Ranks, mightn’t there?」</p><br/><p>「What is the High Rank of goblin, Cassandra?」</p><br/><p>「Well, it’s Goblin, Hobgoblin, Goblin General, Goblin Prince and Goblin King, isn’t it?」</p><br/><p>「When a General appeared, it might become quite dangerous.」</p><br/><p>It’s already hopeless with a General?</p><br/><p>I completely forgot about the normal person’s common sense.~</p><br/><p>「Then, we’ll retreat if a General appeared.」</p><br/><p>「Which direction will we retreat?」</p><br/><p>「That’s, towards the headquarters…… is it no good?」</p><br/><p>「Oniichan, why don’t we retreat towards the demon army?」</p><br/><p>「Why would we need to retreat towards there, Aya?」</p><br/><p>「It’s MPK, oniichan.」</p><br/><p>「Hey, newbie. What’s『Empikee』?」</p><br/><p>「Well, uh, it’s a strategy to lure out the monsters into the enemy.」</p><br/><p>「I think it’s okay, isn’t it?」</p><br/><p>「If it fail, won’t we be pincer attacked by the Goblins and Demon army?」</p><br/><p>「Oh, as expected, that strategy is definitely a no!」</p><br/><p>When we advanced through the forest while having such talk, a report came in from the reconnaissance unit that they discovered the Goblins.</p><br/><p>「Now, how are we going to fight?」</p><br/><p>「Leader, let’s do something flashy.」</p><br/><p>「Flashy? Why?」</p><br/><p>「Aristocrats treat themselves as mere spectators and watch from a safe plain, right?」</p><br/><p>「So?」</p><br/><p>「Even if we simply defeat the goblins and return,</p><br/><p>they are going to be like『Oh, I see』in the end, right?</p><br/><p>They are watching as a mere spectators,</p><br/><p>so let’s show them・・a spectacle, a really great magic!</p><br/><p>And then, we might get an additional reward.」</p><br/><p>「That’s, fine……</p><br/><p>Oh, it’s useless after all.</p><br/><p>Our magic power won’t last after doing such flashiness.」</p><br/><p>「Then, leave that to me.</p><br/><p>I have a good stuff that can recover magic power.」</p><br/><p>「What did you say!?」</p><br/><p>I took out a candy and let Rachel eat it.</p><br/><p>「Oh, sweet! Magic power seems to recovery with this!」</p><br/><p>「Right?」</p><br/><p>「Such a good thing, is it fine?」</p><br/><p>「It’s fine since I have a lot of it.」</p><br/><p>「Alright! If we have this, let’s do something flashy!」</p><br/><p>I handed out candies to each of the 3 magicians,</p><br/><p>and gave the rest to Hilda.</p><br/><p>「Since I’m leaving these candies to Hilda,</p><br/><p>if there’s a person whom magic power is diminished, distribute them please,</p><br/><p>I’m counting on you.」</p><br/><p>「Y-, yes.」</p><br/><p>「Then, try to eat 1 as well.」</p><br/><p>「Is it okay?」</p><br/><p>I threw the sweetest candy into Hilda’s mouth.</p><br/><p>「Oh, sweet!! M-, My cheeks are melting!」</p><br/><p>「I’m counting on you.」</p><br/><p>「Yes!」</p><br/><p>Thus, the preparations were in order.</p><br/><p>The reconnaissance unit lured in dozen of goblins and returned.</p><br/><p>「Magician unit, commence firing!」</p><br/><p>Thus, the skirmish of the goblins and adventurers has began.</p><br/><p>The war will be called『The war of central plain』later on.</p><br/><p>It was this moment that the curtain was raised.</p><br/>\n</div>"}