{"title": "Chapter 129 – Temaki sushi", "id": 129, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-129-%E2%80%93-temaki-sushi", "volume_title": "Volume 2", "body": "<h1>Chapter 129 – Temaki sushi</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>「Because senpais are going to especially stay overnight,</p><br/><p>let’s have some temaki sushi for dinner.」</p><br/><p>I, according to Aya’s instruction, had come to the supermaket once again.</p><br/><p>Elena wanted to come along but was restrained by Aya just to change clothes.</p><br/><p>The shopping for the temaki sushi―</p><br/><p>Tuna, seared bonito, horse mackerel,</p><br/><p>eggs, salmon roe, walleye pollack roe,</p><br/><p>lettuce, cucumber, radish sprouts, green shiso leaves,</p><br/><p>crab sticks, canned tuna, canned corn, plum meat tube,</p><br/><p>I wonder if these are everything?</p><br/><p>When I was done shopping and returned home―</p><br/><p>the 4 people were having a DVD watching session.</p><br/><p>「Welcome back, oniichan.~」</p><br/><p>「Seiji-sama, welcome home.」</p><br/><p>「「Welcome back.」」</p><br/><p>To be welcomed by 3 + 1 bishoujos……</p><br/><p>I’m happy.~</p><br/><p>But, why is Aya glaring at me?</p><br/><p>Because the 4 people continued to watch the DVD peacefully,</p><br/><p>I began to prepare the temaki sushi.</p><br/><p>I finished the preparation of the ingredients,</p><br/><p>and after the vinegar rice was stirred in the ohitsu,</p><br/><p>I get rid of the moisture using Wind magic―</p><br/><p>「It smells delicious, oniichan.」</p><br/><p>Did you come here to see how things are going because you were tempted by the smell?</p><br/><p>After I let Aya carry the ingredients, the temaki sushi party starts.</p><br/><p>「How do you eat this, Seiji-sama?」</p><br/><p>「Then, observe because I’ll prepare one for you.」</p><br/><p>When I prepare Elena’s temaki sushi,</p><br/><p>the other 3 want me to prepare for them as well.</p><br/><p>This is『hand-rolled sushi』not『rolling sushi by lending a hand1』!!</p><br/><p>Elena, who was unable to just watch, rolled one for me.</p><br/><p>The sushi that Elena rolled was very delicious.</p><br/><p>After that, everyone, rolled one for me……</p><br/><p>Aya’s wasabi was too effective; I couldn’t stop my tears. It wouldn’t be on purpose, would it!?</p><br/><p>Mai-san’s had a lot of sushi rice that I almost spilled it.</p><br/><p>Yurie-san’s had only egg types, eggs, salmon roe and walleye pollack roe. Do you like eggs?</p><br/><p>We filled our stomachs and entered the bath in turn.</p><br/><p>The first to enter was me,</p><br/><p>then, Mai-san and Yurie-san,</p><br/><p>finally, Aya and Elena.</p><br/><p>Why did Mai-san and Yurie-san, as well as Aya and Elena enter in pairs?</p><br/><p>Excited voices in the bathroom could be heard.</p><br/><p>Resulting in Yurie-san’s blood rush to her head and nosebleed.</p><br/><p>The room assignment when sleeping were,</p><br/><p>Mai-san and Yurie-san in Aya’s room,</p><br/><p>Aya and Elena in my room,</p><br/><p>while I was to sleep in the living room.</p><br/><p>Well, it can’t be helped, huh.</p><br/><p>***</p><br/><p> Thanks to the『Wasabi』served by Aya, I couldn’t fall asleep easily.</p><br/><p>Anyway, that being the case, let’s check the tracking beacons.</p><br/><p>1. Elena</p><br/><p>Since she’s sleeping, let’s skip her.</p><br/><p>2. Azide-san</p><br/><p>Because of the war, I’ve had completely forgotten about him,</p><br/><p>It seems that he is still in Shinju town.</p><br/><p>Well, I wonder if it was because of the war or some other matters?</p><br/><p>3. Lela</p><br/><p>When I checked, she was just about to go to bed……</p><br/><p>『Seiji……』</p><br/><p>Eh? Lela murmured my name.</p><br/><p>Perhaps, she noticed that I’m peeking?</p><br/><p>Lela went to bed just like that,</p><br/><p>she was squirming for some reason……</p><br/><p>『It can’t be viewed in order to not violate the【Private policy】.』</p><br/><p>A message popped out and I can no longer view it.</p><br/><p>Eh? Is it a violation of【private policy】when sleeping?</p><br/><p>Well, let’s keep it in mind.</p><br/><p>4. Azos</p><br/><p>He was locked up in jail and was docile.</p><br/><p>There seemed to be no need to keep track of this guy.</p><br/><p>5. Nancy</p><br/><p>She was sightseeing Egypt.</p><br/><p>When I checked the map, it seems that she went to Egypt via Italy from Greece.</p><br/><p>I’d like to see the pyramids as well.~</p><br/><p>6. Me</p><br/><p>It was the beacon I attached to myself.</p><br/><p>Looking into the figure that looks exactly like yourself has a strange feeling.</p><br/><p>I’ll take it off later.</p><br/><p>There should be 2 of them left unused later.</p><br/><p>What should I use them for?</p><br/><p>That reminds me, I should’ve put a beacon onto the King of the Demonkind.</p><br/><p>By doing so, I could go to the Demon town immediately.</p><br/><p>Oh well, I could easily run at lightning speed.</p><br/><p>If I think about it, it won’t be necessary to rely on Azide-san’s travels anymore.</p><br/><p>***</p><br/><p> Since I’m not yet sleepy, I tried to check on medicine-related stock.</p><br/><p>There were 10 pieces of【Stimulant potion +3】remaining,</p><br/><p>and there was no【Strength recovery potion +3】left.</p><br/><p>It would be bad if I don’t stock up ingredients.</p><br/><p>I want to become able to craft Elixir soon.</p><br/><p>It’s necessary to raise the level of potioncraft in order to craft Elixir.</p><br/><p>To increase the level of potioncraft, I have to craft curse healing potions2.</p><br/><p>In order to craft curse healing potions, purple nettle and holy water are needed……</p><br/><p>【Light magic】is necessary in order to make holy water. Should I ask Lela, or acquire【Light magic】?</p><br/><p>I wonder where will the purple nettle can be found?</p><br/><p>I hope that it’s in towns I haven’t been before.</p><br/><p>I became sleepy while thinking such things so I decided to quickly go to sleep.</p><br/><p>Translator notes and reference:</p><br/><p>1A pun, written as かせ(temakase sushi) in Japanese.↩</p><br/><p>2Should I change this to Curse dispelling potion or something?↩</p><br/>\n</div>"}