{"title": "Chapter 148 – Vs. Stalker man", "id": 148, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-148-%E2%80%93-vs-stalker-man", "volume_title": "Volume 2", "body": "<h1>Chapter 148 – Vs. Stalker man</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After my cold had been completely cured and Elena was put to sleep,</p><br/><p> the stalker man had arrived at Ringo-san's house when I looked at his situation.</p><br/><p> Ringo-san's house is on the fifth floor of the apartment but</p><br/><p> that man is doing something creepy again, trying to peek inside.</p><br/><p> Furthermore, he continued to loiter around for hours without getting tired.</p><br/><p> The spirit of a stalker couldn't be understood by ordinary people.</p><br/><p> Aya and Ringo-san had finished shopping,</p><br/><p> and were eating a huge parfait in a coffee shop.</p><br/><p> A girl's stomach couldn't be understood by men.</p><br/><p> It was only for 3 minutes that I took my eyes off of the stalker man,</p><br/><p> however, when I looked back at him,</p><br/><p> that fellow―</p><br/><p> was inside Ringo-san's room.</p><br/><p> !!?</p><br/><p> Since when did he manage to sneak in!?</p><br/><p> Sh*t!</p><br/><p> Ringo-san's room has been trampled down by stalker man.</p><br/><p> I firmly endured the feeling of charging in at once and made a call to Aya.</p><br/><p>「What's the matter, oniichan?」</p><br/><p>「Listen carefully,</p><br/><p> the stalker man broke into Ringo-san's room.」</p><br/><p>「What!?」</p><br/><p>『What's wrong, Aya-chan?』</p><br/><p> On the other side of the phone is the anxious Ringo-san.</p><br/><p>『Nothing, don't worry Ringo-chan. It 's fine.』</p><br/><p>「Then, what will you do, oniichan?」</p><br/><p>「Borrow the key from Ringo-san and come over here by yourself.」</p><br/><p>「Why in the world will you do such a troublesome thing?</p><br/><p> If it's oniichan, despite appearances, you will be able to get in, right?」</p><br/><p>「Because there will be a need to explain it to the police this time, we need to avoid using magic if possible.」</p><br/><p>「Yes, I understand. I'll try to ask Ringo-chan.」</p><br/><p>『Nee, Ringo-chan.』</p><br/><p>『What's wrong, Aya-chan? You look grim.』</p><br/><p>『Please lend me the key to your room, Ringo-chan.』</p><br/><p>『What do you mean?』</p><br/><p> Stupid Aya, it was probably too fast of a straight ball pitch.</p><br/><p>『Is the stalker inside my room by any chance!?』</p><br/><p> Aya, who was at a loss for a while,</p><br/><p> quietly nodded.</p><br/><p> Why did you nod?</p><br/><p>『Please stay here, Ringo-chan. Because onii-chan and I will do something.』</p><br/><p>『I refuse!』</p><br/><p>『Why!?』</p><br/><p>『I will go as well!』</p><br/><p> Aya and Ringo-san glared at each other for a while.</p><br/><p>『I understand, let's go together.』</p><br/><p>『Un.』</p><br/><p> Idiot, Aya! Why are you going to bring her!!?</p><br/><p>「Oi, Aya, what are you trying to do?」</p><br/><p>「The two of us will go to the police station and bring along a policeman.</p><br/><p> Will that be fine?」</p><br/><p>「Okay, just hurry up because I'm going to stand watch in front of the room.」</p><br/><p>「Un.」</p><br/><p> I used【Teleportation】to go in front of Ringo-san's house and waited for the two people.</p><br/><p> After a while, Aya and Ringo-san came over with a policeman.</p><br/><p>「It's this room.」</p><br/><p>「Lend me the key.」</p><br/><p> The policeman borrowed the key from Ringo-san, opened the door and cautiously entered inside.</p><br/><p> The man was in the middle of drug injection inside Ringo-san's room.</p><br/><p>「You! What are you doing in a place like this!」</p><br/><p> When the policeman spoke,</p><br/><p> the man grinned with unfocused eyes―</p><br/><p> and abruptly rushed at the policeman.</p><br/><p> As one would expect of a policeman,</p><br/><p> the man's left arm was squeezed to the utmost towards his back.</p><br/><p> Did he do it?</p><br/><p> The man, in spite of his left hand being squeezed to the utmost,</p><br/><p> tried to stand up forcibly.</p><br/><p>「Hey, stand down!」</p><br/><p> The man's left hand is making unpleasant a *crunch crunch* sound.</p><br/><p> The man finally managed to stand up at the expense of his left hand,</p><br/><p> and threw the policeman to the side.</p><br/><p> The policeman, who didn't think that the man would counterattack at the expense of his left hand,</p><br/><p> hit the wall and fainted.</p><br/><p> The man, who noticed Ringo-san, raised a strange voice.</p><br/><p> Ringo-san fell onto her rear due to excessive fear.</p><br/><p> The man, whilst raising a strange voice,</p><br/><p> took out a small hidden knife and held it in reverse grip.</p><br/><p> Aiming at Ringo-san who was still sitting on her rear―</p><br/><p> he swung the knife down.</p><br/><p>*Busuri*</p><br/><p> An unpleasant sound of a knife piercing through the human flesh could be heard,</p><br/><p> and blood splattered around the area.</p><br/><p> The man,</p><br/><p> roared in joy at the sensation of stabbing a person.</p><br/><p>「Aya! Get Ringo-san to a safe place!!」</p><br/><p>「B-, But...... O-, Oniichan......</p><br/><p> your hand!」</p><br/><p>「Don't worry about that! Hurry!」</p><br/><p> It hurts!!!</p><br/><p> I've been planning to not use magic when in Japan and unconsciously caught the knife by hand.</p><br/><p> The man's knife was still piercing my left palm.</p><br/><p> *Guri guri* it grinds against my palm! It hurts!!</p><br/><p> When the man and I were struggling with each other,</p><br/><p> the policeman finally regained consciousness.</p><br/><p>「You-, are you okay!?」</p><br/><p>「It's too much, I'm not okay!」</p><br/><p> The policeman takes his gun out,</p><br/><p>「Put down your weapon. If you don't stand down, I'll shoot!」</p><br/><p> however, the man doesn't seem to hear it at all.</p><br/><p>*Pan!*</p><br/><p> The policeman fired a warning shot towards the wall.</p><br/><p> The man is still completely unfazed.</p><br/><p> Or rather, he's stimulated to a point which prevents him from hearing the surrounding sounds?</p><br/><p> The situation is completely out of control.</p><br/><p> I also cast【sleep】magic on the man a little while ago but it didn't work at all.</p><br/><p> Does the magic not work due to the abnormal secretion of adrenaline? It may be the effect of the drug.</p><br/><p> Ignoring the repeatedly fired warning shots, the man has turned the knife piercing my left hand violently.</p><br/><p> Finally, the policeman―</p><br/><p> shoots the man with his handgun.</p><br/><p> The bullet that the policeman fired hit the man's thigh.</p><br/><p> It seems like it hit badly,</p><br/><p> blood flows out of the man's thigh profusely.</p><br/><p> Isn't this bad?</p><br/><p> The man, leaving a hideous laughter with『Kukekeke』, slowly stopped moving.</p><br/>\n</div>"}