{"title": "Chapter 142 – I forgot", "id": 142, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-142-%E2%80%93-i-forgot", "volume_title": "Volume 2", "body": "<h1>Chapter 142 – I forgot</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Inside the King’s room of the pyramid, I put a tracking beacon on the bat,</p><br/><p>however, the bat went into the vent, disappearing from sight.</p><br/><p>When I check the beacon’s video, it is advancing through the vent slowly and unsteadily.</p><br/><p>「Seiji, what are you doing standing there absentmindedly?」</p><br/><p>Nancy called out to me anxiously.</p><br/><p>「Ah, no, because the bat from a little while ago went into the hole, I think it’s fine now.~」</p><br/><p>「Though it was the long-awaited pyramid, you were still worrying about such a thing?」</p><br/><p>「But.」</p><br/><p>「That reminds me, I’ve heard a『proverb』like this in Japan.」</p><br/><p>「N? What『proverb』?」</p><br/><p>「The bat or me, which is important?」</p><br/><p>It’s not a proverb!</p><br/><p>Well, there’s no use in saying it.</p><br/><p>「Isn’t it decided that Nancy is more important?」</p><br/><p>Then I patted Nancy’s head.</p><br/><p>「If that’s the case then good.」</p><br/><p>Nancy bloomed into a smile and hit my back.</p><br/><p>It hurts, Nancy.</p><br/><p>I’m completely no match for Nancy.</p><br/><p>Then, I confirmed on the map that the bat didn’t move after that.</p><br/><p>The 3 of us had plenty of fun and were satisfied with the pyramid tour.</p><br/><p>「The pyramid was fun. It was like a dungeon.」</p><br/><p>「Have you been in a dungeon, Elena.」</p><br/><p>「No, I haven’t.」</p><br/><p>Come to think of it, there is a dungeon called『Tower of sunrise』in Ikebu town, let’s try to go next time.</p><br/><p>We put off the pyramid tour and have a lunch at a cozy restaurant.</p><br/><p>「Iyaa, although travelling alone is fine, it’s also fun to go sightseeing with friends like this.」</p><br/><p>「Is Nancy travelling alone all the time?</p><br/><p>Amazing.~ I can’t do that at all.」</p><br/><p>「Well, I was also quite nervous in the beginning, I just started travelling when I met Seiji in Japan,</p><br/><p>and I was really saved by Seiji who treated me kindly.」</p><br/><p>「Is that so, I’m glad to be of help that time.」</p><br/><p>「And then, I’ve been helped by Seiji again, this time in Egypt……</p><br/><p>How should I say it, um…… it’s fate……」</p><br/><p>「Fate?」</p><br/><p>「Ah, it’s not it after all.」</p><br/><p>「What is it, don’t stop talking halfway, I’m interested.」</p><br/><p>「Ah, um……</p><br/><p>Ah! That reminds me!</p><br/><p>Wasn’t your sister together with you when you first helped me?</p><br/><p>What happened to that girl?」</p><br/><p>Sister??</p><br/><p>……</p><br/><p>「……I-, I forgot (Sweating profusely)」</p><br/><p>「Y-, You forgot!!?</p><br/><p>Did you perhaps leave her behind in the first town!!?」</p><br/><p>「That’s not it, that’s not it! She’s just gone off on her own.」</p><br/><p>「What, I was frightened.」</p><br/><p>Since it’s now 12:00 at noon in Egypt,</p><br/><p>it’s 19:00 in Japan.</p><br/><p>Aya had returned from Junior College,</p><br/><p>all alone……</p><br/><p>Well, there was never a time when Aya cried from being lonely (LOL)</p><br/><p>but it seemed she will be very angry when we return……</p><br/><p>Should I cover my stomach with an iron plate?</p><br/><p>「Sorry, Nancy.</p><br/><p>We have to go to where Aya is.」</p><br/><p>「I see……</p><br/><p>it’s lonely but it can’t be helped.」</p><br/><p>「If you get into trouble again, contact me,</p><br/><p>I’ll fly immediately.」</p><br/><p>「Haha, it really seems that you can fly everywhere if you say so, Seiji.」</p><br/><p>「Ou, of course!」</p><br/><p>「When my tour is over, I’ll go to Japan once again,</p><br/><p>ah, but, if Seiji were to come to the United States, contact me and I’ll welcome you as much as I can.」</p><br/><p>「Oh, I understand.」</p><br/><p>When I hold out a hand in order to shake hands,</p><br/><p>Without taking my hand, Nancy……</p><br/><p>suddenly came and gave me a hug.</p><br/><p>and a kiss on the cheek.</p><br/><p>I’ve felt something soft.</p><br/><p>My sense had almost run out of control for an instant,</p><br/><p>but thanks to Elena, who had her cheeks puffed out, poking my side, I somehow regained my sense.</p><br/><p>Nancy had separated from me,</p><br/><p>and attacked Elena this time,</p><br/><p>giving her a hug and a kiss on the cheek too.</p><br/><p>Elena also became stiff like me.</p><br/><p>「See yah, bye bye.」</p><br/><p>Nancy said so and left with a positive state of mind whilst waving her hand.</p><br/><p>We were dumbfounded for a while.</p><br/><p>Pulling ourselves together, we returned to Japan.</p><br/><p>***</p><br/><p>「We’re home.~」</p><br/><p>When I said so while taking my shoes off at the door,</p><br/><p>Aya attacked with a terrible momentum from the living room.</p><br/><p>「Oni.i.chan.~!!」</p><br/><p>Aya’s voice was trembling with anger? She was running while shouting.</p><br/><p>I quickly grabbed my chance,</p><br/><p>from 0 distance, I braced my stomach for a head-butt blow.</p><br/><p>「Guho!!」</p><br/><p>As expected, it’s good, that I put, an iron plate, in advance……</p><br/><p>The air in my lungs was instantly forced out,</p><br/><p>I lost consciousness……</p><br/><p>When I came to, I was laying on the sofa in the living room and had Elena casting recovery magic.</p><br/><p>「Ah, Seiji-sama, you’re awake.」</p><br/><p>Aya stood imposingly a bit further away from me,</p><br/><p>full of anger? She glared at me with bright red eyes.</p><br/><p>「You’re terrible, oniichan!</p><br/><p>Without any message, you didn’t return home.</p><br/><p>I’m not…… lonely,</p><br/><p>what the heck did you do, leaving out in the cold!」</p><br/><p>「Um……」</p><br/><p>What will happen afterwards seem to be scary if I don’t speak honestly here.</p><br/><p>「We took Nancy to Cairo,</p><br/><p>but we were attacked by bus hijacking en route.」</p><br/><p>「Bus hijacking!?」</p><br/><p>「It’s fine since I knocked them down.」</p><br/><p>「Well, it’s fine since it’s oniichan.」</p><br/><p>「After that, when we arrived in Cairo, we temporarily returned to Japan and because it was 1 o’clock in the evening in Japan, you were sleeping so I didn’t wake you up, Aya.」</p><br/><p>「Well, it can’t be helped if it’s 1 o’clock.」</p><br/><p>「And then we were invited by Nancy to eat dinner in a luxurious hotel.」</p><br/><p>「D-, Dinner!?」</p><br/><p>「She offered us a high class wine, we got drunk in a gulp and when I woke up, it was morning.」</p><br/><p>「……」</p><br/><p>「After that, we went to tour the pyramid.」</p><br/><p>「P-, Pyramid!!!?」</p><br/><p>「And returned home.」</p><br/><p>「……」</p><br/><p>「What is it, Aya?」</p><br/><p>「Die a 100 timessss!!」</p><br/><p>Aya’s anger seemed to reach ecstasy somehow or another, </p><br/><p>I took Aya’s various attacks and―</p><br/><p>once again lost consciousness.</p><br/>\n</div>"}