{"title": "Chapter 140 – Suite", "id": 140, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-140-%E2%80%93-suite", "volume_title": "Volume 2", "body": "<h1>Chapter 140 – Suite</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The long-distance bus that escaped from bus hijacking arrived at Cairo.</p><br/><p>When the bus arrived, the passengers got off and scattered in all directions like baby spiders.</p><br/><p>What about the police interview?</p><br/><p>Well, it would be trouble if we were to be interviewed.</p><br/><p>Did the passengers not want to get into trouble too and escaped?</p><br/><p>Whilst the driver was contacting someone, we left the bus hurriedly as well.</p><br/><p>Nancy regained her consciousness just before we arrived at Cairo but she didn’t know about the bus hijacking since she fainted. </p><br/><p>Well, let’s leave it alone since I’ll only be troubled if she inquired persistently.</p><br/><p>***</p><br/><p> We had come in front of the US Embassy.</p><br/><p>「I managed to get here somehow or another. Thank you, Seiji.」</p><br/><p>「Well then, we’re just going to be around here.</p><br/><p>Be careful from now on.」</p><br/><p>When I said so and tried to leave,</p><br/><p>「Wait!」</p><br/><p>「N? Is something wrong?」</p><br/><p>「Well, uhm,</p><br/><p>that’s right, let’s eat together. I’ll treat you to dinner as thanks.」</p><br/><p>「Ah, I don’t mind. Where are we going to meet?</p><br/><p>How long will the legal process take at the embassy?」</p><br/><p>「Well, I honestly don’t know.</p><br/><p>Tell me your email so I’ll contact you when it is over.」</p><br/><p>Email!</p><br/><p>Email, huh. It’s worrying~</p><br/><p>Why am I worrying like this, you ask?</p><br/><p>Although I have my smartphone, it can’t be used in Egypt.</p><br/><p>Why? Because it didn’t go through the procedures for overseas use.</p><br/><p>I’m supposed to be in Japan,</p><br/><p>however, if I use it willfully without going through the procedure for overseas use, the smartphone will be mistaken as stolen.</p><br/><p>Credit cards and the like aren’t usable for the same reason as well.</p><br/><p>Since it can’t be helped, I gave Nancy the address of my free mail.</p><br/><p>「Why is it free mail?」</p><br/><p>「My smartphone is broken……」</p><br/><p>「Well, Okay.</p><br/><p>Then, I’ll email you when the procedure is done.」</p><br/><p>Nancy said so and went inside the embassy.</p><br/><p>After seeing Nancy off, we returned to Japan.</p><br/><p>***</p><br/><p> It was 1:00 at night in Japan.</p><br/><p>「Well, though it’s such a time, I’m not that sleepy since I’ve taken a nap.」</p><br/><p>「Me too.」</p><br/><p>Alone with Elena in the middle of the night……</p><br/><p>I tinkered with a certain thing in front of Elena.</p><br/><p>「It’s ‘gunyu gunyu’-ing, is it soft?」</p><br/><p>「It’s not such a thing, would you like to try and touch it?」</p><br/><p>Elena tried to touch it fearfully.</p><br/><p>「Oh, it’s very hard.」</p><br/><p>Elena grabbed it with both hands affectionately. She stared at it fascinatingly and kissed it.</p><br/><p>「What are you doing, Elena!?</p><br/><p>It’s dirty.」</p><br/><p>「One of Seiji-sama’s thing can’t possibly be dirty.」</p><br/><p>Well, I think it’s alright since I’ve decomposed it once……</p><br/><p>Right! I,</p><br/><p>was decomposing silver coins, turning them into silver accessories.</p><br/><p>Good grief, there’s no need to kiss it just because you like Ringo-san’s accessory design.</p><br/><p>「Seiji-sama, can I try to put this on?」</p><br/><p>「I’m afraid to say but it’s not yet finished, Elena.」</p><br/><p>「N!? Is that so?」</p><br/><p>「Here, look carefully,</p><br/><p>there’s no metal pin for holding the hair, right?」</p><br/><p>「How are you going to make the metal pins?」</p><br/><p>「I don’t know either, let’s try ask Ringo-san next time.」</p><br/><p>Like this, the requested accessories of the 5 people were made without metal pins to kill time.</p><br/><p>***</p><br/><p> When we teleported to Egypt in response to the summons of the email,</p><br/><p>Nancy was waiting in front of the US Embassy.</p><br/><p>「Sorry to have kept you waiting.」</p><br/><p>「Yo! I was waiting.」</p><br/><p>「Then, where are you going to treat us?」</p><br/><p>「Look forward to it.」</p><br/><p>Led by Nancy, we walked through the night of Cairo.</p><br/><p>We were guided by Nancy to a seemingly very high class hotel.</p><br/><p>「Is it here, Nancy?」</p><br/><p>When I inquired cautiously,</p><br/><p>「The people in the embassy showed consideration for my situation and made a reservation here.」</p><br/><p>「I-, I see.」</p><br/><p>We were shown to a room……</p><br/><p>「Nancy, wait.</p><br/><p>What’s this room?」</p><br/><p>「Iyaa, it’s a luxury room.」</p><br/><p>Iyaa, this is not in the level of luxury anymore.</p><br/><p>This is probably at the top floor.</p><br/><p>As it is now, it feels like it has a layout of a large house than a room,</p><br/><p>it can hold parties in the living room, there are also 3 bedrooms,</p><br/><p>and the view from the window is great as well, you can get a bird’s-eye view of Cairo’s cityscape.</p><br/><p>「Seiji-sama, I can see some big buildings in the distance.」</p><br/><p>When I looked at where Elena was pointing―</p><br/><p>an illuminated pyramid can be seen in the distance.</p><br/><p>「P-, Pyramid!」</p><br/><p>「It’s really a wonderful view, right?」</p><br/><p>Nancy also came to my side and enjoyed the view.</p><br/><p>When we were enjoying the view for a while―</p><br/><p>the doorbell rang and the dinner has been carried inside.</p><br/><p>Various dished lined up,</p><br/><p>During dinner, we smacked our lips whilst looking at the pyramid.</p><br/><p>Because Nancy and I were having wine,</p><br/><p>Elena was looking at us enviously.</p><br/><p>「Would you like to drink too, Elena?」</p><br/><p>Nancy got drunk and jokingly offered a wine to Elena.</p><br/><p>Elena didn’t understand what Nancy had said in English, she thought it was juice and drunk the wine.</p><br/><p>「Ah! What are you doing!?」</p><br/><p>「S-, Sorry, I was just joking.」</p><br/><p>「Elena, are you alright?」</p><br/><p>「S-, Seiji-sama, this juice ins delicisou.」</p><br/><p>Elena was smiling cheekily with a bright red face and drowsy eyes.</p><br/><p>This is dangerous!</p><br/><p>Particularly, it’s more dangerous to my reasoning power.</p><br/><p>I nursed Elena, who had become a little strange, with utmost effort.</p><br/><p>It was Nancy who attacked this time.</p><br/><p>「Why can’t I drink my wine!?」</p><br/><p>「Wait, Nancy. You’ve drink too much.」</p><br/><p>When I keep Nancy company―</p><br/><p>「Seiji-sama, a drink for me too pwease.」</p><br/><p>Elena strikes from the opposite side as well.</p><br/><p>How did this happen!?</p><br/><p>The two people had me serve wine to drink alternately.</p><br/><p>The night of the sumptuous feast grew late……</p><br/>\n</div>"}