{"title": "Chapter 145 – Disease attack", "id": 145, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-145-%E2%80%93-disease-attack", "volume_title": "Volume 2", "body": "<h1>Chapter 145 – Disease attack</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Vol. 9 – Stalker</p><br/><p>The next morning,</p><br/><p>I’ve contracted a disease.</p><br/><p>「Oni.i.chan.~</p><br/><p>Don’t.die~!!」</p><br/><p>Lest she get infected, Aya was told not to enter the room.</p><br/><p>Outside the door, she was shouting something.</p><br/><p>「Seiji-sama, are you alright?」</p><br/><p>「I’m sorry for troubling you every time, Elena.~</p><br/><p>But since it’s contagious, it’s enough already.」</p><br/><p>To nurse my illness, Elena had stayed by my side.</p><br/><p>What a kind-hearted lady.</p><br/><p>「It’s fine, Seiji-sama. A person, who has acquired recovery magic, will become less prone to diseases.」</p><br/><p>「Is that so?」</p><br/><p>「Yes.」</p><br/><p>To think that there’s such an effect in acquiring magic.</p><br/><p>I want to immediately acquire recovery magic.</p><br/><p>「Oni.i.chan.~!!」</p><br/><p>「Ah, that’s enough! You’ve been so noisy since a little while ago, Aya!</p><br/><p>You’re making a big deal out of me having caught a cold.」</p><br/><p>「But.~!」</p><br/><p>「Tell Aya that I’m going to be fine, Elena.」</p><br/><p>「Okay, I understand.」</p><br/><p>Thanks to Elena comforting Aya, it has finally become quiet. </p><br/><p>I can finally sleep quietly.</p><br/><p>If I sleep soundly, I’ll immediately recover from the cold.</p><br/><p>The【Appraisal】have become『Abnormal condition: Cold』but there seems to be no problem.</p><br/><p>I put myself to sleep using【Sleep】magic.</p><br/><p>***</p><br/><p>After a while,</p><br/><p>I’ve woken up to an indescribable bad premonition.</p><br/><p>And, just then, Elena entered the room.</p><br/><p>「Have you woken up, Seiji-sama?」</p><br/><p>「Yah.」</p><br/><p>Elena seems to have carried a tray with something on it.</p><br/><p>However, that something on top of the tray,</p><br/><p>was emitting a strange eerie atmosphere……</p><br/><p>「T-, That is?」</p><br/><p>「It’s uhh… it’s a dish, for Seiji-sama, made by Aya-san……」</p><br/><p>Elena showed me what’s on the tray……</p><br/><p>It had a frightening color and,</p><br/><p>furthermore, it was giving off an offensive smell.</p><br/><p>I had experienced the greatest crisis of life,</p><br/><p>the way to retreat had already been blocked.</p><br/><p>Aya is watching the situation from the gap of the room’s door.</p><br/><p>Whilst preparing myself for death, I ate it.</p><br/><p>「!!?」</p><br/><p>I forcibly poured all of that hideous something into my stomach,</p><br/><p>I continued to desperately hold the reflux with all my might.</p><br/><p>「S-, Seiji-sama, are you alright?」</p><br/><p>「……I’m going to sleep because I’m full.」</p><br/><p>Leaving those words behind,</p><br/><p>I went to sleep.</p><br/><p>***</p><br/><p> When I woke up, it was early in the afternoon.</p><br/><p>N? </p><br/><p>Voices can be heard coming from the living room.</p><br/><p>Did someone come?</p><br/><p>I looked through the tracking beacon’s video.</p><br/><p>『Sorry for coming when your oniichan is sick.』</p><br/><p>The visitor was Ringo-san.</p><br/><p>Did she possibly come to consult about the stalker?</p><br/><p>『It’s fine since oniichan ate the porridge I’ve made. He’s now sleeping soundly.』</p><br/><p>Was that a『Porridge』?</p><br/><p>I’m sure…… no, it’s nothing.</p><br/><p>The 3 girls talked happily but I gradually got bored watching.</p><br/><p>That reminds me, how is that dangerous-looking nose-pierced man stalker doing?</p><br/><p>I tried to check the video of the tracking beacon attached to the stalker.</p><br/><p>!!?</p><br/><p>The front of my house was displayed on the video.</p><br/><p>Nose-pierced man leaned towards the door of my house, watching the happenings inside.</p><br/><p>G-, Gross! So gross!!</p><br/><p>And dangerous! Too dangerous!!</p><br/><p>I made a call to Aya with my smartphone placed on the bedside.</p><br/><p>「Huh? What’s wrong, oniichan?」</p><br/><p>「Listen carefully, Aya.</p><br/><p>Don’t let anyone go out of the house until I say that it’s good.」</p><br/><p>「N? What do you mean?</p><br/><p>Ringo-chan has come to play right now.」</p><br/><p>「Don’t let Ringo-san go out of the house too.」</p><br/><p>「N!!? What do you mean?」</p><br/><p>「Listen carefully so that Ringo-san doesn’t notice.」</p><br/><p>「O-, Okay.」</p><br/><p>「The stalker who appeared in the cosplay convention,</p><br/><p>is in front of the house right now.」</p><br/><p>「Eeeee!!!」</p><br/><p>『What happened, Aya-chan?』</p><br/><p>「Look! Don’t let Ringo-san know about it!」</p><br/><p>「I-, Is that so.」</p><br/><p>「Since the stalker bastard shows no sign of moving, let Ringo-san stay for a while.」</p><br/><p>「Shall I get rid of such a thing?」</p><br/><p>「You’ll die.」</p><br/><p>「How so?」</p><br/><p>「You don’t know how dangerous that guys is.</p><br/><p>That guy is like those fellow injecting dangerous drug on themselves.</p><br/><p>You don’t know what to do.」</p><br/><p>「S-, Seriously!?」</p><br/><p>「If you understand then tell it carefully to Ringo-san.」</p><br/><p>「O-, Ok.」</p><br/><p>Now, will Aya be able to tell it well?</p><br/><p>Aya, who had finished a call with me, talked to Ringo-san again.</p><br/><p>「Ringo-san, stay here for today.」</p><br/><p>「Though it was particularly fine, what was that phone call a little while ago?」</p><br/><p>「Uhh… It’s oniichan,</p><br/><p>he said the if Ringo-san goes home, he’ll die from loneliness……」</p><br/><p>Oiii!!!</p><br/><p>「N!? Your oniichan!?」</p><br/><p>Ringo-san too swallowed that story!</p><br/>\n</div>"}