{"title": "Chapter 179 – Tower of sunrise’s underground’s second floor", "id": 179, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-179-%E2%80%93-tower-of-sunrise%E2%80%99s-underground%E2%80%99s-second-floor", "volume_title": "Volume 2", "body": "<h1>Chapter 179 – Tower of sunrise’s underground’s second floor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>In the end, I decided not to go to the location of the aforementioned hidden room and explored the underground's second floor.</p><br/><p> Why on earth would I go to the underground's second floor?</p><br/><p> When I arrived at the underground's second floor, the air suddenly becomes dry.</p><br/><p> The wall also becomes sandstone-ish not soil.</p><br/><p> A cloud of dust flutters about and sand has also been accumulated on the floor.</p><br/><p> Although the red dots indicate that the enemies are scattered, I don't know what enemies they are so they are enemies I haven't encountered yet.</p><br/><p> However, it's hard to walk on sand.</p><br/><p> When I advanced for a while, there was a wooden door which is on the verge of collapse leading to a room.</p><br/><p> When I opened the door and entered inside―</p><br/><p> there was a huge black scorpion that came attacking in response to the sound of my steps on the sand.</p><br/><p> It approached as it pierced its legs which were like ice axes into the sand to advance.</p><br/><p> And, it swung down its right pincer.</p><br/><p> I tried to dodge with a back step but since I couldn't dodge properly on the sand, I parried with sword of trial and somehow managed to avoid without further problems.</p><br/><p> However, as if it was aiming for it, it attacked with its left pincer this time.</p><br/><p> I dodged it with a back step and a parry the same way as the right pincer.</p><br/><p> Then, I sensed intense【danger】from above.</p><br/><p>「Dangerous!」</p><br/><p> When I kicked the sandy soil hard with Earth magic, suctioned away my body with Wind magic and stepped back with all my strength―</p><br/><p> its tail's stinger pierced into the place where I've been before with a frightful momentum from above.</p><br/><p>「That was dangerous......」</p><br/><p> There's undoubtedly a poison in that attack.</p><br/><p> I should've brought a poison healing potion.</p><br/><p> The poison may not become a fatal injury if I drink that ahead.</p><br/><p> I braced myself again and ran toward the scorpion.</p><br/><p> I kicked down with the tip of my toes intently to deal with the sand properly, dodged the scorpion's pincer attack with minimal sideways movement, drew closer to it before its tail's stinger attack came and cut its head into two with the sword of trial.</p><br/><p>Zudoun!</p><br/><p> The scorpion collapsed, producing a sound.</p><br/><p> Since I couldn't dismantle it, the scorpion's corpse was stored in the inventory as is.</p><br/><p>『Level went up to 46.』</p><br/><p> Oh, my level went up after a long time!</p><br/><p> I thought I didn't acquire experience points from enemies with a level lower than myself but it didn't seem to be so too.</p><br/><p> Well, frankly, there's not much benefit even if my level rose~.</p><br/><p> After confirming it, each stats has increased by about 1%.</p><br/><p> When I entered the next room, there was a smaller scorpion than a little while ago.</p><br/><p> And, it was weaker than the first room's scorpion so I defeated it smoothly.</p><br/><p> Somehow or another, the first room's scorpion seemed to have been a mid-boss-like fellow.</p><br/><p> While hastening the exploration for a while, I managed to kill about 30 scorpions.</p><br/><p> There were about five enemies with similar sizes as the first scorpion,</p><br/><p> with the exception of the two fellows: one who spat fire while the other spat muddy water.</p><br/><p> Magic stones can probably be taken out from those fellows after dismantling.</p><br/><p> The sword of trial has become『63/100 monsters』.</p><br/><p> I've noticed something serious here.</p><br/><p> The red dots that are displayed on the map,</p><br/><p> I know what kind of enemies they are once I've encountered them once but......</p><br/><p> in this underground's second floor, there's only 1 enemy left that is unknown to me.</p><br/><p> In other words, isn't this undetermined one the boss?</p><br/><p> I wonder why I didn't notice it until now. orz</p><br/><p> Whilst avoiding the other enemies, I hurried to that fellow's location.</p><br/><p> It's the boss after all.</p><br/><p> If I noticed it early, I could've taken it more easily but......</p><br/><p> is the one inside the room a green scorpion?</p><br/><p> Its tail has a stinger, its both hands have become sickles rather than pincers.</p><br/><p> When I appraised it, the enemy seems to be called『Sickle Scorpion』.</p><br/><p> I'll be careful since it seems to be using Wind magic as well.</p><br/><p> When I took a distance and examine the enemy's movement―</p><br/><p> the Sickle Scorpion swung its sickle downward.</p><br/><p>Dangerous!</p><br/><p> I sensed【danger】and jumped to the side.</p><br/><p> Then, the wall behind the spot I've been before was completely cut off in a single vertical line.</p><br/><p> It was probably a『Whirlwind slash』-like【Wind magic】.</p><br/><p>「That magic is good.」</p><br/><p> I tried to do similar such attack before but wasn't able to do it after trying it in various ways.</p><br/><p> I'll steal that skill.</p><br/><p> Even if I say that, since I don't have a skill to steal the enemy's skill, I have no choice but to watch and learn it.</p><br/><p> I took a distance and had it to use that skill many times and I continued to observe.</p><br/><p> I could see its trajectory and dodged it somehow but couldn't quite grasp its true nature.</p><br/><p> When I boldly received it with the sword of trial, I felt the heaviness of its weight and dispersed it in order to repel the skill.</p><br/><p>「It seems like a mass of air.」</p><br/><p> It's a mass of air rather than a vacuum.</p><br/><p> In other words, it's something like wind gust, probably in a sharp form like a blade.</p><br/><p>「Alright, let's give it a try!」</p><br/><p> I, whilst dodging the enemy's attack, produced a blade-shaped mass of air with【Wind magic】and hurled it out from the sword.</p><br/><p> Although it flew out, the mass of air was slow, its shape collapsed at about 3 meters and dispersed.</p><br/><p>「Dang it!」</p><br/><p> I practiced it repeatedly several times, when finally, it started to reach some distance with a decent speed.</p><br/><p>「I did it!」</p><br/><p> I've tried to check my status and the skill called【Wind blade】has been added to the【Sword art】.</p><br/><p>「Here it goes, try to receive my【Wind blade】!」</p><br/><p> Whilst dodging the enemy's attacks, I invoked the newly acquired【Wind blade】.</p><br/><p> The【Wind blade】flew toward the enemy―</p><br/><p>*Slash!*</p><br/><p> The『Sickle Scorpion』's head had been completely severed and fell down with *koron*.</p><br/><p>「Ah!」</p><br/><p> The『Sickle Scorpion』fell down with a *thud* and no longer move.</p><br/><p> It had been defeated with a single blow......</p><br/><p> Well, whatever.</p><br/>\n</div>"}