{"title": "Chapter 194.5 – Reconfirmation of tracking beacon (Interlude)", "id": 194, "volume": 2, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-1945-%E2%80%93-reconfirmation-of-tracking-beacon-interlude", "volume_title": "Volume 2", "body": "<h1>Chapter 194.5 – Reconfirmation of tracking beacon (Interlude)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>194.5. Reconfirmation of the tracking beacon (Side story)</p><br/><p> The next day when Mai-san said she wanted to go in place of obaa-san.</p><br/><p> I was gonna...investigate the situation of the people attached with tracking beacon while working.</p><br/><p>***</p><br/><p>■Beacon 1: Elena, Beacon 9: Hilda</p><br/><p> It seems the two people are watching the『Magical girl・C』's DVD happily.</p><br/><p> However, after watching the episode 1, they have been discussing about the magic which turned up in the story they have been watching until a while ago and『how it came about out scientifically』.</p><br/><p> Contrary to expectations, they seemed to be studying magic seriously rather than idling about watching the DVD.</p><br/><p> I'd like for Aya to follow this diligence as well.</p><br/><p>■Beacon 2: Azide</p><br/><p> It's completely the turn of the missing journey of the merchant Azide-san but―</p><br/><p> he seemed to be going back and forth in Shinju town and Demonkind town these days.</p><br/><p> He was in Shinju town today―</p><br/><p> and seemed to be procuring goods to be taken to demonkind town.</p><br/><p> I will remove the beacon if he doesn't travel.~</p><br/><p>■Beacon 3: Lela</p><br/><p> For some reason, Lela was in Shinju town rather than in Ikebu town.</p><br/><p> She took several soldiers and was making rounds in Shinju town.</p><br/><p> Is she doing a work of public security maintenance?</p><br/><p> I'll try to ask her next time.</p><br/><p> As usual, the townspeople are looking at her with looks of respect.</p><br/><p> The gap between the current her and at the time we met is vast, huh.</p><br/><p>■Beacon 4: Aya</p><br/><p> She was having a class at the junior college.</p><br/><p> She yawned......</p><br/><p> is she listening seriously?</p><br/><p> It seemed she hasn't been listening properly―</p><br/><p> and started playing with her smartphone.</p><br/><p> What on earth are you looking at on your smartphone?</p><br/><p> Aya was reading a『Web novel』.</p><br/><p> It seems to be a story about a villain daughter breaking off the engagement......</p><br/><p> study seriously!</p><br/><p>■Beacon 5: Nancy</p><br/><p> She is wearing a cool lady's suit and currently attending a seemingly complicated meeting.</p><br/><p> It's fresh since I had only seen her dressed for her around the world trip.</p><br/><p> Perhaps, Nancy...</p><br/><p> is quite a great person?</p><br/><p>■Beacon 6: Myself</p><br/><p> When I was wondering who was the man making a clueless, stupid look that appeared, it was me......</p><br/><p>■Beacon 7: Nose-pierced man</p><br/><p> He was sleeping while receiving a drip-feed.</p><br/><p> And, he wasn't moving an inch.</p><br/><p> He's probably in a vegetative state due to the backlash of the dangerous drug......</p><br/><p> Monitoring this guy doesn't seem to be necessary anymore.</p><br/><p>■Beacon 8: Golden mask of curse</p><br/><p> A shady mask laid quietly in a dark room to protect treasures.</p><br/><p> Since the【curse healing potion】has been completed, should I splash it on it next time?</p><br/><p> I wonder what will happen to this mask once the curse has been dispelled?</p><br/><p>***</p><br/><p> That reminds me, my MP exceeded 10, 000 since my level rose―</p><br/><p> It should have also reach the point where I can attach 10 tracking beacon.</p><br/><p> Since I will take Mai-san there on Saturday, I'll put it on her~.</p><br/><p> I resumed my work while thinking such a thing.</p><br/>\n</div>"}