{"title": "Chapter 203 – Elena’s torture", "id": 203, "volume": 3, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-203-%E2%80%93-elena%E2%80%99s-torture", "volume_title": "Volume 3", "body": "<h1>Chapter 203 – Elena’s torture</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>「Then, I will torture that person!」</p><br/><p>「E-, Elena!?」</p><br/><p> Elena raised her hand cheerfully......</p><br/><p> I shook off my delusion―</p><br/><p>「Can you torture her, Elena?」</p><br/><p>「Yes, Aya-san also said that it was amazing.」</p><br/><p>「Aya?」</p><br/><p>「Un, Elena's torture is of『that』level.」</p><br/><p> Well, if Aya says so, let's leave it to her.</p><br/><p> It's better than a man doing the torture after all, right? That means......</p><br/><p> Elena will torture the female devil-kin spy.</p><br/><p>***</p><br/><p>『Which means, it's now or never if you want to spill out the scheme.</p><br/><p> If you don't want to talk no matter what, you will be subjected to a torture.』</p><br/><p>『Humph, I'm not going to talk even if you torture me.』</p><br/><p> Un, that's right.</p><br/><p> I suspected as much......it can't be helped, huh.</p><br/><p>「It seems she won't talk no matter what.</p><br/><p> Elena-sensei, please.」</p><br/><p>「Yes! Please leave it to me.」</p><br/><p> Elena replies energetically and steps forward in front of the female spy.</p><br/><p>『Haha, when is such an ojou-chan can torture?</p><br/><p> Are you trying to make me laugh to death? Hahah.』</p><br/><p> Afterward, the female spy who was laughing to death......</p><br/><p>『Stop it!! Giyahahaha!!!</p><br/><p> A-, Agonizing...... Giyahahahaha!!!!』</p><br/><p> Although Elena is touching the female spy,</p><br/><p> she's not tickling her in particular.</p><br/><p> The reason why the female spy is laughing―</p><br/><p> seems to be because the recovery magic is being cast on her.</p><br/><p> Why does it tickle with recovery magic?</p><br/><p> There seems to be a problem with how the recovery magic is cast.</p><br/><p> It just feels itchy when healing normal wounds but......</p><br/><p> when recovery magic is excessively cast on healthy part,</p><br/><p> it becomes intensely ticklish like this.</p><br/><p>『Haa haa, please stop it already......』</p><br/><p>『Are you going to talk now?』</p><br/><p>『……』</p><br/><p>「Elena, go!」</p><br/><p>「Yes!」</p><br/><p>「Gyaa-!!!!</p><br/><p> Guhahahaha!!!</p><br/><p> Hii---!!』</p><br/><p> The screams and laughs of the woman resounded in the prison.</p><br/><p> After a while, the woman was completely exhausted from laughing.</p><br/><p>『How is it? Are you ready to talk?』</p><br/><p>『If I talk...I'll be killed......』</p><br/><p>『So, the fact that you had a poisoned knife means that you probably intended to kill the demonkind, right?</p><br/><p> Although you were trying to kill the demonkind and me, you want yourself to live?』</p><br/><p>『Humph, no matter how many single horned or hornless die means nothing to me!』</p><br/><p>「Elena, again.」</p><br/><p>「Y-, yes.」</p><br/><p> As expected, Elena seems to be embarrassed too.</p><br/><p> It's understandable.</p><br/><p> The woman blacked out many times from laughing too much.</p><br/><p> I splashed water on her each time and continued the torture.</p><br/><p> Then, the torture was repeated for quite some time......</p><br/><p> the woman wasn't going to talk at all.</p><br/><p>「Seiji-sama, as expected, any more that this......」</p><br/><p>「I give up, to be stubborn up to here......</p><br/><p> What will you do, Bunmi-san?」</p><br/><p>「If there's no way to make her talk―</p><br/><p> let's kill the woman.」</p><br/><p>「「N!?」」</p><br/><p>「It seems to have happened before when we caught several devil-kin,</p><br/><p> even if we give them something, they will not eat then die.</p><br/><p> We can't let them go either so it's quicker to kill them.」</p><br/><p> Seriously!?</p><br/><p>「P-, Please wait.</p><br/><p> Please let me continue to torture her a little bit more.」</p><br/><p> Hearing that the woman will be killed, Elena started to get flustered.</p><br/><p> Well, it will be hard to wake her up with this......</p><br/><p>「But what will you do, Elena?</p><br/><p> There are no sign of her confessing at all even if you tickled her.」</p><br/><p>「I will use my trump card......」</p><br/><p> Trump card?</p><br/><p> It seems even Elena herself doesn't want to do it too much either.</p><br/><p> Just what kind of torture will it be?</p><br/><p>「I'm sorry but Bunmi-san and Hilda, please go outside.」</p><br/><p>「N? Why?」</p><br/><p>「Because it's something that can't be shown to a man and a minor......」</p><br/><p> Urged by Cassandra-san, Bunmi-san went outside and several female soldiers went in instead.</p><br/><p> Although Hilda didn't understand the circumstances well, she followed Elena's instructions.</p><br/><p>「Don't I have to go out as well?」</p><br/><p>「Actually, I don't want to show it to Seiji-sama either but</p><br/><p> it will not go well if there's no interpreter......」</p><br/><p>「I-, I see.」</p><br/><p> In order to prevent the female spy from being killed,</p><br/><p> Elena began her final torture as a last resort.</p><br/><p>『Higi--!!!</p><br/><p> Hiyaun!!!</p><br/><p> No--!!!』</p><br/><p> Completely different from a little while ago, a terrible scream resounded......</p><br/><p> The woman let out drool, tears, and various different liquids. Her eyes turned upward and her body twitched many times.</p><br/><p> It's a terrible torture......</p><br/><p> If only I'm the one doing it……</p><br/><p> Uh-oh, bad, I must stay in my position......</p><br/><p> I kept watching the state of the terrible torture without looking away.</p><br/><p> The torture continued for a while―</p><br/><p> the woman had her body twitched intensely and she became completely exhausted afterward.</p><br/><p> I decided to ask her again.</p><br/><p>『How is it? Are you ready to talk?』</p><br/><p>『......I-, I will...talk......</p><br/><p> I will talk...pwease, forgwive me......』</p><br/><p> Finally, the woman gives in......</p><br/><p> Elena who did it had her face bright red too.</p><br/><p> Aya, Mai-san, Cassandra-san and the female soldiers' faces became bright red too.</p><br/><p>***</p><br/><p> After waiting for the woman to calm down, I finally started to question her.</p><br/><p> After kidnapping a child,</p><br/><p> they will lure out the parents with the child as the bait and capture them to become slaves.</p><br/><p> Then―</p><br/><p> assassination of dignitaries―</p><br/><p> add poison to food and water―</p><br/><p> A number of extremely cowardly strategies were confirmed.</p><br/><p> Furthermore, although the strategy is similar,</p><br/><p> I've found out that they are also scheming even towards the humans' town.</p><br/><p> It seems to be necessary to do something about this.</p><br/><p>***</p><br/><p> The female spy who spilled out the scheme......</p><br/><p> was completely resigned herself and behaved inside the prison.</p><br/><p> She was also obediently eating when given a food.</p><br/><p> Is it the aftereffects of Elena's torture?</p><br/>\n</div>"}