{"title": "Chapter 213 – Hou Ren Sou", "id": 213, "volume": 3, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-213-%E2%80%93-hou-ren-sou", "volume_title": "Volume 3", "body": "<h1>Chapter 213 – Hou Ren Sou</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>I went to work and approached the director to talk right away.</p><br/><p>「Director, there's something I want to talk to you about.」</p><br/><p>「N? What do you want to talk about?」</p><br/><p>「Uhhm, I want you to ask the president to talk as well......」</p><br/><p>「I see, it's a talk related to 'that', huh.」</p><br/><p> The director seemed to understand what I wanted to talk about and immediately contacted the president.</p><br/><p>***</p><br/><p>「Oh, Maruyama-kun, I'm really indebted to you during that time with the medicine.」</p><br/><p> There might be someone who forgot but 『Maruyama』is me.</p><br/><p> The director, president and I held a secret meeting on the sofa of the president's office.</p><br/><p>「Then, don't stand on ceremony, what do you want to talk about?</p><br/><p> Well, since it's you it will be a wonderful talk again.」</p><br/><p> My value is soaring in the president.</p><br/><p>「Actually, I obtained something again but different from those ones,</p><br/><p> I thought I should report it to the director and the president first and foremost......」</p><br/><p>「That's also great but it's a different thing again?</p><br/><p> My interest is greatly piqued.」</p><br/><p>「Actually......」</p><br/><p> I lined up four types of potions on top of the lounge suit's table.</p><br/><p>「N? There are several kinds?」</p><br/><p>「Yeah.」</p><br/><p> First, I picked up the elixir―</p><br/><p>「This is a drink which hastens the recovery of a considerable serious injury.」</p><br/><p>「W-, What!?」</p><br/><p> I explained the other potions as well in rapid succession.</p><br/><p>「The other ones are drinks which deal with the hair, fat, and chest problems.」</p><br/><p>「!!?</p><br/><p> ......Sorry, what did you say just now?」</p><br/><p>「To put it plainly......</p><br/><p> these drinks are for bald, fat, and flat-chested.」</p><br/><p> The president and the director stiffened with their mouths wide open.</p><br/><p>「No, no! Such a thing is impossible!」</p><br/><p> That's right, it's impossible to suddenly believe such a thing.</p><br/><p>「It's reasonable that you can't believe it.</p><br/><p> Please forget this talk.</p><br/><p> I decided to consult others.」</p><br/><p> When I got up from my seat and was going to leave......</p><br/><p>「Wait a moment, Maruyama-kun!」</p><br/><p>「Yes, what is it?」</p><br/><p>「I-, I didn't say that I don't believe it in particular.</p><br/><p> Now, now. Sit.」</p><br/><p>「Haa.」</p><br/><p> As soon as I returned to my seat, the director tapped my shoulder.</p><br/><p>「I believed you from the beginning!</p><br/><p> Please give me each one for the hair, fat, and chest.」</p><br/><p>「Ah, so cunning!</p><br/><p> I'll take everything including the one for the wound too!」</p><br/><p>「No, give me 2 each of everything!」</p><br/><p>「Then, I'm 3 each!!」</p><br/><p> The director's stealing a march on the president became the trigger and started to compete to have them.</p><br/><p>「Please calm down you two.</p><br/><p> There isn't much of them.</p><br/><p> There are only 2 left of the one for the chest since my imouto used 1,</p><br/><p> the other ones, there are 3 each.」</p><br/><p>「T-, That's right......</p><br/><p> Then, I will take 2 each of the one for the hair and 1 each of the rest.」</p><br/><p>「Then, I will take 2 each of the one for the fat, of course, I will also take 1 each of the rest.」</p><br/><p> The president and the director will take 2 each of the one for the hair and the one for the fat respectively, huh......</p><br/><p> It seems like I can agree to the director with his body but......</p><br/><p> who will the president use it for?</p><br/><p> When I kept glancing around the president's head......</p><br/><p>「Don't misunderstand, okay?</p><br/><p> My hair is a natural hair!</p><br/><p> It's true!!」</p><br/><p> I haven't said anything but......</p><br/><p>「Umm, even if you pass it over to an acquaintance, please keep it a secret.」</p><br/><p>「Yes, of course.」</p><br/><p> The president and the director put away the bottles of medicine in a bag cheerfully.</p><br/><p>「By the way, Maruyama-kun,</p><br/><p> Did your imouto drink the one for the chest?」</p><br/><p>「Yeah, I think there's no need for her to drink but</p><br/><p> it's an earnest request of the person herself.」</p><br/><p>「And, how's the effect?」</p><br/><p>「Since she just drank it this morning, so shortly......</p><br/><p> Ah, but, I had her send a mail with her thoughts.」</p><br/><p>Pikon!</p><br/><p>「Oh, it seemed that I've received an e-mail」</p><br/><p> The president and the director leaned forward.</p><br/><p>「Let see,</p><br/><p> First, the drink's effect doesn't seem to appear immediately.」</p><br/><p>「T-, That's right.」</p><br/><p>「Then, it tastes like a green tea.」</p><br/><p>「Hou hou.」</p><br/><p>「After that, the way Elena-chan touch- eh?......</p><br/><p> Oops, this was an irrelevant content.」</p><br/><p>「Umu, the only thing we have understood so far is that it has a green tea flavor......」</p><br/><p> The president and the director seem to be concerned at the effect condition of the potion as expected.</p><br/><p> When the president had been lost in thought―</p><br/><p> I suddenly stood up and said such a thing.</p><br/><p>「Then, let's do it this way,</p><br/><p> The three of us will gather every day this week and hold a report meeting.</p><br/><p> The work's basic is called 『Hou Ren Sou[1]』!」</p><br/><p> Both the president and the director agreed toward my suggestion,</p><br/><p> and we had decided to hold the『that thingmajig's effect report meeting』 in the entire week.</p><br/><p>[1]Hou Ren Sou is very important thing on business. It's an abbreviation of \"hōkoku, renraku, sōdan\", which means \"report, contact, consultation.\"</p><br/>\n</div>"}