{"title": "Chapter 223 – Relief goods", "id": 223, "volume": 3, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-223-%E2%80%93-relief-goods", "volume_title": "Volume 3", "body": "<h1>Chapter 223 – Relief goods</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>It finally settled down,</p><br/><p> I tried to think slowly why Elena's recovery magic had become level 7.</p><br/><p> The base level goes up to 6 by the contract with the spirit,</p><br/><p> furthermore, with the +1 that the staff's effect has caused, it seems to have become 7 in total.</p><br/><p> However,『7』......</p><br/><p> Well, that aside―</p><br/><p> let's ask Butte-sama for that thing.</p><br/><p>「I'm sorry Butte-sama, but since we're here anyway,</p><br/><p> can we visit the mana crystal of recovery?」</p><br/><p> Money is fine, but will you make it cheaper since it only has that much function?</p><br/><p>「It's true that there's a lot of condition but......</p><br/><p> we can't say such thing to you guys.</p><br/><p> Everyone, please go and visit.」</p><br/><p> It's even free, lucky!</p><br/><p>----------</p><br/><p> Our visit results were,</p><br/><p> Aya and Mai-san's were level 1.</p><br/><p> Hilda's was level 2.</p><br/><p> Mine was level 3.</p><br/><p> Well, mine is far inferior to Elena's level 7,</p><br/><p> but it's thoughtless to even compared them.</p><br/><p> With that said, when I was rejoicing that I have gotten the recovery magic―</p><br/><p> the twin magic stones in my breast pocket vibrated with *ton-ton*.</p><br/><p> It's a signal from Lela.</p><br/><p>「The relief goods seem to have been prepared at the Shinju town.</p><br/><p> Since I'm going to get it, everyone please wait here for a moment.」</p><br/><p>「「Yes.」」 「Ye~s.」 「Un.」</p><br/><p>***</p><br/><p>「Lela, I'm sorry to have kept you waiting.」</p><br/><p>「Seiji......</p><br/><p> you will come immediately once I signaled, huh.</p><br/><p> This is somehow fun.」</p><br/><p>「Oi, Lela, don't use it for strange things, okay?」</p><br/><p>「I-, I know......」</p><br/><p>「Well then, where are the relief goods?」</p><br/><p>「It's prepared in the next room.」</p><br/><p> When I went to the next room―</p><br/><p> goods were piled up like a mountain.</p><br/><p>「You have procured so many, huh.」</p><br/><p>「I had a merchant to procure them.」</p><br/><p>「With this, the Ebisu town's people will also be saved.」</p><br/><p>「I see.」</p><br/><p> Although Lela only said a few words,</p><br/><p> her expression was happy.</p><br/><p> The fellow who was going to kill Aya in revenge for losing in the competition grew up so much.</p><br/><p> I put away all the prepared goods into the inventory.</p><br/><p>「Well then, I'm going to deliver them to Ebisu town.」</p><br/><p>「Ah, wait a moment.</p><br/><p> This is the goods' statement of delivery.</p><br/><p> Have them confirm it upon receipt and sign it.」</p><br/><p> Is this an express home delivery service!?</p><br/><p>「What should I do after I got them to sign it?」</p><br/><p>「Since the Reconstruction Support Unit that departed yesterday should arrive there the day after tomorrow, hand it over to them.」</p><br/><p>「Understood, I will do so.」</p><br/><p> Did you let the Reconstruction Support Unit depart yesterday? You did a good job, huh.</p><br/><p>「T-, That's right, Seiji......」</p><br/><p>「What is it?」</p><br/><p>「I always have you to help me with the transport of luggage, I'm sorry.」</p><br/><p>「What are you saying so suddenly?</p><br/><p> Since it's the devil-kin's fault this time, it can't be helped.」</p><br/><p>「I-, I see......」</p><br/><p> Lela has begun to fidget for some reason.</p><br/><p> Does she want to go to the toilet or something?</p><br/><p>「As thanks for helping me, it's......</p><br/><p> I'd like to do something to thank you......</p><br/><p> don't you have...something you want from..me?」</p><br/><p>「No, there's nothing that comes to mind in particular for now.</p><br/><p> It's fine since I'll be relying on you if there's something troubling happened again next time, I'll be sure to ask you at that time.」</p><br/><p>「I-, I see......」</p><br/><p> Lela looked disappointed for some reason.</p><br/><p> Did you want to thank me that much? What a dutiful fellow.</p><br/><p> I bid farewell to Lela,</p><br/><p> and went back to Ebisu town.</p><br/><p> However, as soon as I came back to Ebisu town,</p><br/><p> the vibration of the twin magic stone in my breast pocket had become faster.</p><br/><p> That fellow Lela has started to train again.</p><br/><p> She's really a training enthusiast, huh.</p><br/><p>***</p><br/><p> While feeling the twin magic stone in my breast pocket vibrates with *bikun bikun*, I went to the assembly hall which became the reconstruction emergency headquarters in Ebisu town.</p><br/><p> Butte-sama was taking the command of the reconstruction duty in the assembly hall.</p><br/><p>「Butte-sama, I got the relief goods from Lela of Shinju town.」</p><br/><p>「Oh, Seiji-san.</p><br/><p> Hm, Lela-san? Relief goods?</p><br/><p> What do you mean?」</p><br/><p> I took out the relief goods which have been entrusted to me by Lela and piled them in the corner of the assembly hall.</p><br/><p>「T-, This is......」</p><br/><p>「This is the relief goods' statement of delivery.</p><br/><p> Please check the goods and sign it.</p><br/><p> Since the Reconstruction Support Unit from Shinju town will seem to arrive the day after tomorrow, please hand the statement of delivery to those people.」</p><br/><p>「It's right after yesterday so in this way......</p><br/><p> Besides, how did you carry it?」</p><br/><p> Explaining is troublesome~.</p><br/><p>「I carried it using slightly special magic.</p><br/><p> Since I can't do it frequently, please don't rely on it so much.」</p><br/><p>「Y-, yes......」</p><br/><p> Butte-sama was dumbfounded,</p><br/><p> but oh, well.</p><br/><p>----------</p><br/><p> Since they said that Aya and the others were outside helping with the reconstruction, I went to meet them.</p><br/><p>「Oh Elena, how's the reconstruction going?」</p><br/><p> Elena was making a dish which was going to be distributed to the people who were working on the reconstruction.</p><br/><p>「Welcome back, Seiji-sama.</p><br/><p> Since it's almost over, please wait a little bit.」</p><br/><p>「Ou.」</p><br/><p> However, Elena's cooking figure is picture-perfect~.</p><br/><p>「Seiji-sama...」</p><br/><p>「What is it?」</p><br/><p>「I have a favor to ask.」</p><br/><p> Oh? It's rare for Elena to have a favor to ask.</p><br/><p>「If it's Elena's request, I'll comply with whatever it is.」</p><br/><p>「Thank you very much.</p><br/><p> Actually...</p><br/><p> didn't I get such a wonderful staff?」</p><br/><p>「That staff..... is a good stuff!」</p><br/><p>「But, Butte-sama may be in trouble that she doesn't have a staff.</p><br/><p> I'm wondering if we can give her a present as a substitute for the staff.....」</p><br/><p> Elena is kind~.</p><br/><p> I will pat her head later!</p><br/><p>「That's right, how about making a recovery reinforcement magic stone,</p><br/><p> and give her a staff with it as a present?」</p><br/><p>「That's wonderful!!」</p><br/><p>「Alright, well then, I will go to the Suga town's weapon shop before we return back to Japan and try to request the production of the staff.」</p><br/><p>「Yes!」</p><br/><p> After waiting for Elena to finish cooking,</p><br/><p> the two of us replicated the recovery reinforcement magic stone from a magic stone of nullpo with【magic stone replicator tool】.</p><br/><p> Then......</p><br/><p> the outcome magic stone―</p><br/><p> was a【Recovery reinforcement magic stone +5】!</p><br/><p> As expected of recovery magic level 7!</p><br/><p> A magnificent magic stone had been completed.</p><br/><p> Elena was rubbing the magic stone against her cheek with a fascinated expression.</p><br/>\n</div>"}