{"title": "Chapter 224 – The low-life shop manager", "id": 224, "volume": 3, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-224-%E2%80%93-the-low-life-shop-manager", "volume_title": "Volume 3", "body": "<h1>Chapter 224 – The low-life shop manager</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>We left Ebisu town and went to Suga town's weapon shop.</p><br/><p>「Hello~」</p><br/><p>「Oh, the guy who broke my courtyard.」</p><br/><p> Till when are you going to quote that joke material.</p><br/><p> Everyone might have forgotten it, but when I bought the【magic rod】here before, she had asked me to try it out which created a crater in the courtyard.</p><br/><p> And then, this manager-san is a beautiful female manager-san.</p><br/><p> However, the manager-san seems to be somewhat more displeased than usual.</p><br/><p> Is something wrong?</p><br/><p>「What did you came for?」</p><br/><p>「Uh......</p><br/><p> I was wondering if you can make us a staff......」</p><br/><p>「Make a staff?</p><br/><p> Is it the useless ready-made one?」</p><br/><p> Elena held out the new-made【recovery reinforcement magic stone +5】to the manager-san.</p><br/><p> The manager-san's eyes light up as soon as she saw the magic stone,</p><br/><p> and scrutinize it.</p><br/><p>「I see, it's a remarkably high-quality【recovery reinforcement magic stone】.</p><br/><p> It will not become a match with the ready-made ones.</p><br/><p> However......</p><br/><p> If such a luxurious magic stone is used, the raw materials of the staff should also have to be something of level.」</p><br/><p>「I'll ask you to make it in the best raw materials at once.」</p><br/><p>「Hou, that's also great~.</p><br/><p> How about 50, 000 Aurum?」</p><br/><p> E-, Expensive......</p><br/><p> Well, it can't be helped.</p><br/><p>「Then, we'll ask that.」</p><br/><p>「Thank you for your continued patronage!」</p><br/><p> Manager-san suddenly became good mood,</p><br/><p> and began to clean up the mess on the table.</p><br/><p> Huh?</p><br/><p> Those things she was putting away right now......</p><br/><p> on top of the table were a gourd-like magic stone and a small, wooden barrel-like cup.</p><br/><p> The gourd-like magic stone would be【twin magic stones】.</p><br/><p> And, one of the twin magic stone was embedded at the bottom of the wooden cup.</p><br/><p>「Is this by any chance......」</p><br/><p>「Oh, no good, no good. That's a top secret request.」</p><br/><p>「However......</p><br/><p> If it's a wooden cup, the vibration of the voice doesn't reach the twin magic stones, right?」</p><br/><p>「V-, Voice!? Vibration??</p><br/><p> Did you by any chance understand what this magic tool is made for?」</p><br/><p>「Isn't this a magic tool to speak with a distant person?</p><br/><p> Wasn't it requested by Kiseri-san?」</p><br/><p>「W-, Why do you know that?」</p><br/><p> It's like that after all, huh.</p><br/><p>「Didn't you see the paper cup prototype in Kiseri-san's place?</p><br/><p> It is I who made that.」</p><br/><p>「W-, What!?」</p><br/><p> Manager-san sidles up to me with bloodshot eyes.</p><br/><p>「I can't make it successfully no matter what.</p><br/><p> Tell me its problems.」</p><br/><p> Somehow or other, although it was requested, it seems she couldn't make it successfully and have gotten impatient.</p><br/><p>「The materials are no good with wood.」</p><br/><p>「However, there's no such high quality paper like that of the prototype,</p><br/><p> and there is nothing that can make a cup with paper.」</p><br/><p>「How about a monster's leather?」</p><br/><p>「Oh, there's a monster's leather, but......</p><br/><p> It's also impossible to make a cup with leather.」</p><br/><p>「It's not necessary to make the whole cup with leather,</p><br/><p> it's fine to only make the bottom with leather and the rest with wood.」</p><br/><p>「I see, so the material of the bottom of the cup is important.」</p><br/><p> Manager-san began to violently smash the bottom of the wooden cup with a hammer.</p><br/><p> It was quite bold.</p><br/><p>「Ah, when you attach the leather to it, it's better to stretch it out so that it will not loosen.」</p><br/><p>「I understand.」</p><br/><p> A leather had been attached to the wooden cup which had a hole opened up at the bottom, and then the magic stone was attached to the center of the leather part using some kind of an adhesive.</p><br/><p>「Is this now good with this?」</p><br/><p>「I think that it's fine.」</p><br/><p> When we try to perform an operational testing......</p><br/><p> on top of being durable, the sound is very audible and clearer than the paper cup version.</p><br/><p> This is good.</p><br/><p>「Yey! It's a success!!」</p><br/><p> Manager-san was so pleased that she took my hand and jumped up and down with *pyon pyon*.</p><br/><p> This person has a quite cute side too.</p><br/><p>「Guhehe~. There will be a large profit with this!」</p><br/><p> This person has a quite low-life side too.</p><br/><p>「Manager-san, do you know the matter of the devil-kin?」</p><br/><p>「Yes, they seem to be attacking humans' towns.」</p><br/><p>「Until that matter is settled, please don't sell this magic tool to the general public.」</p><br/><p>「N?</p><br/><p> Oh, I see!</p><br/><p> It's going to be exploited if the devil-kin get their hands on this!」</p><br/><p> Did you just notice it now?</p><br/><p>「Well, it can't be helped.</p><br/><p> Until then, the twin magic stones......</p><br/><p> are going to be bought up...guhehe.」</p><br/><p> Low-life, beyond low-life!!</p><br/><p> Since the creation of the staff will take about five days,</p><br/><p> we entrusted the magic stone to her and left the weapon shop.</p><br/><p>***</p><br/><p> Since I will leave for『Shinaga town』which is going to be the last destination,</p><br/><p> I had everyone to wait in Suga town,</p><br/><p> and ran eastwards from where we fought against the devil-kin with【Lightning flash】.</p><br/><p> After running for about an hour, the『Shinaga town』came into sight.</p><br/><p> Since everyone would be going to enter the town together, I went back to Suga town at once and went back with everyone using【teleportation】.</p><br/><p>「Ehh, so that place over there is the『Shinaga town』, huh~.</p><br/><p> N?</p><br/><p> Somehow, smoke is rising up...is it all right?」</p><br/><p>「Ah, it's true.」</p><br/><p> Although I didn't notice it until Aya said it,</p><br/><p> smoke rises up at many places of the town.</p><br/><p>「Seiji-onii-chan, those are blacksmith's smokes.」</p><br/><p>「N? Do you know this town, Hilda?」</p><br/><p>「Yes, I'm from this town.」</p><br/><p> Ehh, so Hilda is from this town, huh.</p><br/><p> However, there's a lot of smoke rising up,</p><br/><p> this town has a lot of blacksmith.</p><br/><p> When we arrived at the entrance of the town, we were called to a halt by the guard soldier.</p><br/><p> For the guard to prevent the infiltration of the devil-kin, he had performed a physical examination.</p><br/><p> Oi, stupid. Don't touch a strange place!</p><br/><p> Oh, by the way, it's fine since a female soldier was in charge in the girls' physical examination.</p><br/><p> There was really a lot of blacksmiths in『Shinaga town』.</p><br/><p> The shops which lined up in the main street, about one to two buildings was a blacksmith.</p><br/><p> Well, since we had no business in the blacksmith,</p><br/><p> we asked the passersby the location of the【Mana crystal of Fire】and the【Mana crystal of Light】and rushed toward the place.</p><br/><p>***</p><br/><p> When we arrived at the location of the【Mana crystal of Fire】,</p><br/><p> some kind of a construction work was being carried out.</p><br/><p>「Excuse me, we'd like to visit the【Mana crystal of Fire】but......」</p><br/><p> I tried to talk to the guards.</p><br/><p>「It's prohibited to visit for now.」</p><br/><p>「N!? Why?」</p><br/><p>「It seems to be a devil-kin countermeasure.</p><br/><p> It's to prevent the【Fire magic】from being exploited by the devil-kin.」</p><br/><p>「Such a thing......</p><br/><p> We have come here with so much trouble.」</p><br/><p>「Well, the visit that is allowed now......」</p><br/><p> Is there any condition?</p><br/><p>「seems to be those who can produce fire using magic.」</p><br/><p>「N? Then, the only ones who can visit are those who can use【Fire magic】?」</p><br/><p>「Well, it has been decided like that.」</p><br/><p>「Then, it's entirely insignificant, isn't it?」</p><br/><p>「Well, it seems so.」</p><br/><p> Umu, what to do.....</p><br/>\n</div>"}