{"title": "Chapter 234 – Going around the towns 2", "id": 234, "volume": 3, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-234-%E2%80%93-going-around-the-towns-2", "volume_title": "Volume 3", "body": "<h1>Chapter 234 – Going around the towns 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>When we finished going around the places I could go, I was pondering about what to do for the time being―</p><br/><p>「Hey, onii-san.」</p><br/><p>Mai-san tugged at my clothes.</p><br/><p>「What is it, Mai-san?」</p><br/><p>「Is Ojii-san’s place alright?」</p><br/><p>「Ojii-san’s place?</p><br/><p> Ah, the demon town, huh.」</p><br/><p>「Un.」</p><br/><p>It doesn’t mean that it’s already fine since it was attacked once.</p><br/><p>We decided to go to the demon town.</p><br/><p>***</p><br/><p>「Seiji-dono, it’s good that you came.」</p><br/><p>Mai-san’s worry seemed to have proven right,</p><br/><p>the demon town was under attack of monsters.</p><br/><p>「Bunmi-san, are you alright?」</p><br/><p>「These monsters are stronger than the last time, it’s shameful to say, but we are having a slightly hard time.」</p><br/><p>「What of the Demon Lord, and the Previous Demon Lord?」</p><br/><p>「They have already made preparations to fight soon.」</p><br/><p>The situation is as such, huh!</p><br/><p>「Onii-san, I will stay here.」</p><br/><p>「B-, But…...」</p><br/><p>「You will come to help if the situation becomes dangerous, right?」</p><br/><p>「Mai-san, since I haven’t put a tracking beacon on you, I can’t sense if you’re in danger.」</p><br/><p>「Then put a tracking beacon on me, and go.」</p><br/><p>「Is it fine?」</p><br/><p>「I-, I’ll endure it.」</p><br/><p>It can’t be helped if Mai-san says so.</p><br/><p>I-, I’m not particularly thinking of peeping on a little girl as much as I like, okay!!?</p><br/><p>I put on a【Tracking beacon】on Mai-san while she closed her eyes to endure the injection.</p><br/><p>Since there was no tracking beacon that could be removed anymore,</p><br/><p>I unwillingly removed Azide-san’s beacon.</p><br/><p>Sorry, Azide-san.</p><br/><p>「Hm? It’s already done?」</p><br/><p>「The beacon has been installed, you know?</p><br/><p> It didn’t feel unpleasant like【Appraisal】?」</p><br/><p>「Un, not at all.」</p><br/><p>What’s that? I thought she will be more embarrassed, but…...</p><br/><p>I-, I don’t particularly want to see a little girl feeling embarrassed, okay!!?</p><br/><p>「Elena, can you use that magic?」</p><br/><p>「Please give me a bit more Japanese sweets.」</p><br/><p>「Alright.」</p><br/><p>I took out the last Japanese sweets from the inventory and had Elena to eat them.</p><br/><p>「Seiji-dono, Elena-san, what are you trying to do by eating that much?」</p><br/><p>「We’re going set up a magic on the entire town.</p><br/><p> Please watch, it’s an amazing magic~.」</p><br/><p>「Hou.」</p><br/><p>Elena prepared to use the staff while having some bean jam smeared around her mouth.</p><br/><p>「Here it goes!」</p><br/><p>Light starts to pour out from the staff, and wraps up the entire town.</p><br/><p>The demon soldiers were a little surprised,</p><br/><p>but in fact, it was in the monsters’ direction that there was a change.</p><br/><p>The monsters seem to hate the【Divine protection of Recovery spirit】and aren’t going inside.</p><br/><p>「Elena, the monsters seem to hate it, but why is that?」</p><br/><p>「The Recovery spirit seems to be tickling the monsters who went inside.」</p><br/><p>They hate getting tickled, huh!?</p><br/><p>If done, it’s simply a hateful attack!</p><br/><p>Looking at the behaviour of the monsters, the demon soldiers completely became on the offensive.</p><br/><p>「Thank you, Elena-san.</p><br/><p> It seems we can now repel the monsters with this.」</p><br/><p>「You’re welcome.」</p><br/><p>With her magic power exhausted, Elena seemed to be having a tough time while saying so.</p><br/><p>「Bunmi-san, please treat Mai-san well, okay?」</p><br/><p>「Since she’s the Previous Demon Lord’s grandchild, I will protect her even if I have to exchange this body!」</p><br/><p>「Mai-san, please don’t overwork yourself.」</p><br/><p>「Ou!」</p><br/><p>As Mai-san said so―</p><br/><p>she plunged into the horde of monsters.</p><br/><p>…...did you not hear to what I’ve said?</p><br/><p>Now then, let’s check up on Lela’s situation again.</p><br/><p>***</p><br/><p>「How’s the situation, Lela?」</p><br/><p>「Seiji! So you’ve come!</p><br/><p> But the enemies are weak, and Elena-sama’s magic is also effective,</p><br/><p> it seems to be alright for the time being.」</p><br/><p>「Is that so, that’s good.</p><br/><p> By the way, what of the『Royal capital』’s side?</p><br/><p> Did you receive a message after that?」</p><br/><p>「『Royal capital』?</p><br/><p> Ah!</p><br/><p> I left the twin-magic-stone magic tool in the mansion…...」</p><br/><p>Oi, oi. You’re panicking too much, you know?</p><br/><p>What will you do if there’s a message coming from the Royal Capital?</p><br/><p>It has no answering machine function or something like that.</p><br/><p>I had Lela to order her subordinate to get it.。</p><br/><p>「What? If it’s such enemy, otou-sama will be able to handle it with room to spare.」</p><br/><p>Lela’s image for Lyle Gewalt is a strong father.</p><br/><p>Even though Lela is already stronger than him......</p><br/><p>I checked up on each town's situation for the time being.</p><br/><p>Elena ate all the Japanese sweets and was trying to recover her magic power while licking a candy.</p><br/><p>There seems to be no problem in the towns for now.</p><br/><p>When I was feeling relief, Lela’s subordinate brought the twin-magic-stone magic tool.</p><br/><p>「Sorry for troubling you.」</p><br/><p>Lela received it from her subordinate, and made a call with Lyle Gewalt.</p><br/><p>「Otou-sama, how’s the situation of the Royal Capital?」</p><br/><p>…...</p><br/><p>There’s no response.</p><br/><p>「Otou-sama?」</p><br/><p>…...</p><br/><p>It’s no good, there’s no response at all……</p><br/><p>What on earth is the matter?</p><br/><p>「W-, W-, W-, What to do? There’s no response coming from otou-sama!」</p><br/><p>「Calm down, Lela.」</p><br/><p>It can’t be helped, let’s try to go and see the situation.</p><br/><p>「Elena, let’s go and see the situation of the Royal capital.」</p><br/><p>「Yes.」</p><br/><p>「Seiji, I will rely on you.」</p><br/><p>Lela clung onto me with an expression that seemed to be on the verge of crying.</p><br/><p>「Leave it to me.</p><br/><p> Don’t worry, he probably went into the toilet or something.」</p><br/><p>At any rate, the devil-kin unexpectedly came out with such a large-scale mobilisation…...</p><br/><p>However, where did Yurie-san go……?</p><br/><p>Although I came here to search for Yurie-san, I don’t have time for it anymore.</p><br/><p>We parted with Lela,</p><br/><p>and went directly to the Royal Capital.</p><br/>\n</div>"}