{"title": "Chapter 242 – The female college student’s behind closed doors disappearance case", "id": 242, "volume": 3, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-242-%E2%80%93-the-female-college-student%E2%80%99s-behind-closed-doors-disappearance-case", "volume_title": "Volume 3", "body": "<h1>Chapter 242 – The female college student’s behind closed doors disappearance case</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator: Jei</p><br/><p>Proofreader: BlackKnight</p><br/><p>Yurie-san who notices the date is blown off, and starts to become confused.</p><br/><p>「Ah, she seems to have realized.」</p><br/><p>At Aya’s remark, the eyes of everyone who were there focused on the tracking beacon’s video.</p><br/><p>Yurie-san picked her cell phone up and tried to confirm it, but―</p><br/><p>she noticed that she received a lot of emails, and got more and more confused.</p><br/><p>And then, Yurie-san tries to call Mai-san first.</p><br/><p>「Mai-san, you understand, right?</p><br/><p>What happened in the other world is a secret, okay?」</p><br/><p>「U-, Understood.」</p><br/><p>Immediately after that, Mai-san’s cell phone began to ring.</p><br/><p>「Hello, Yurie-san?」</p><br/><p>『W-, W-, What should I-, I-, I-, I do……』</p><br/><p>She seems to be considerably confused.</p><br/><p>「Are you in your house right now?」</p><br/><p>『U-, Un.』</p><br/><p>「Please wait, I’ll go there right now.」</p><br/><p>『Un.』</p><br/><p>Mai-san, while covering the phone……</p><br/><p>「Onii-san, please go with me to Yurie-kun’s house right now!」</p><br/><p>「Yeah, understood.」</p><br/><p>———-</p><br/><p>Actually, it will be strange if they just talked on the phone and we rushed up immediately, but……</p><br/><p>Mai-san hurries up too much.</p><br/><p>Ten minutes after the phone call, Mai-san rang the doorbell of Yurie-san’s mansion[1].</p><br/><p>I sent Mai-san off and returned immediately, and checked the tracking beacon’s video.</p><br/><p>『C-, Captain—!』</p><br/><p>『Yurie-kun!』</p><br/><p>In the video, the two people hugged each other.</p><br/><p>『Yurie-kun, do you remember how were you until now?』</p><br/><p>『Uhh, if I remember correctly……』</p><br/><p>According to Yurie-san’s testimony―</p><br/><p>1. When she was preparing for her meeting with Mai-san, suddenly, she was in a shrine-like place.</p><br/><p>2. When she was being puzzled in the midst of the people who had two grown horns, a magic-like something was cast on her, and she lost her consciousness.</p><br/><p>3. When she noticed, she was transmigrated as a『bad girl』.</p><br/><p>4. She was ordered to go and teach the neighboring country which they have a disagreement with a lesson.</p><br/><p>she seems to have this knowledge.</p><br/><p>The shrine-like place is probably the devil-kin’s place.</p><br/><p>Is the magic-like something the【Sleep】magic?</p><br/><p>The things such as bad girl, and the disagreement are probably the influence of『confusion』.</p><br/><p>Accompanied by Mai-san, Yurie-san went to report to the police.</p><br/><p>***</p><br/><p>After Yurie-san was inquired about the situation by the police,</p><br/><p>the police asked her to receive a thorough examination at the hospital.</p><br/><p>Mai-san accompanied Yurie-san the whole time.</p><br/><p>『Captain, I’m sorry for everything.』</p><br/><p>『You can rely on me during such times.</p><br/><p>It’s because I’m the captain no matter what happens!』</p><br/><p>『Captain!』</p><br/><p>They hugged each other again……</p><br/><p>passionately.</p><br/><p>However, the way Yurie-san hugs…seems slightly different from before.</p><br/><p>Is it only my imagination?</p><br/><p>***</p><br/><p>After the thorough examination at the hospital,</p><br/><p>Yurie-san was inquired about the situation again at the police station.</p><br/><p>「I’m very sorry.」</p><br/><p>「Eh!?」</p><br/><p>A policewoman performs a dogeza in front of Yurie-san.</p><br/><p>Why does the police apologizing?</p><br/><p>「Actually, Yurie-san’s case right now has been leaked out into the TV station……」</p><br/><p>When the policewoman turns on the TV installed in the interrogation-like room……</p><br/><p>『A female college student suddenly vanished from behind closed doors!</p><br/><p>Where on earth has she disappeared to!?』</p><br/><p>Yurie-san’s matter is somehow being reported in a wide show[2]!</p><br/><p>『To begin with, what do you think, novelist Katsu-sensei?』</p><br/><p>It seems that the program style is the host will ask a comment from a celebrity.</p><br/><p>『This is what they commonly called murder behind closed doors.』</p><br/><p>『She’s not dead……』</p><br/><p>『Perhaps, the chain at the door is fastened afterwards……』</p><br/><p>『Fastened afterwards?』</p><br/><p>『It’s fastened to the door from the back of the house afterwards.』</p><br/><p>『It’s a mansion……』</p><br/><p>This novelist called Katsu or something like that is stupid.</p><br/><p>『Next, what do you think, Magician ○○-san[3]?』</p><br/><p>『This is simple.』</p><br/><p>『Well.』</p><br/><p>『A hole in the floor…』</p><br/><p>『It doesn’t have a hole.』</p><br/><p>『Then, in the wall…』</p><br/><p>『That place doesn’t have a hole too.』</p><br/><p>『Then, I don’t know.』</p><br/><p>This fellow is of no use as well.</p><br/><p>『In the end, the behind closed doors’ mystery remained a mystery……</p><br/><p>I hope that Yurie…no, Y-san to be found as soon as possible.』</p><br/><p>Uwa, this host……</p><br/><p>mentioned the real name in the live broadcast!!</p><br/><p>『Ah, please wait a moment.</p><br/><p>A new intel came in just now!</p><br/><p>It said that the missing Yu.. Y-san has been found.</p><br/><p>Reporter ×× is live in front of △△ police station.</p><br/><p>Reporter ××, how’s the situation?』</p><br/><p>『This is reporter ×× on the scene.</p><br/><p>Y-san’s whereabouts was unknown, but I found out that she came home this morning.</p><br/><p>It seemed that she came over to the policestation accompanied by a friend.</p><br/><p>As of now, it seems that a police interview is being carried out at this △△ policestation.』</p><br/><p>She’s completely being treated like a criminal……</p><br/><p>『What do you mean she came back home?』</p><br/><p>『According to the informed source’s information, it seemed that she was in her home when she got up this morning.</p><br/><p>She doesn’t seem to have the memory of the time when she had disappeared.』</p><br/><p>『She doesn’t know it anymore, huh. This is getting more and more interesting…don’t you think?</p><br/><p>Let’s continue this matter as soon as a new information becomes available.』</p><br/><p>You plan to pursue this further……?</p><br/><p>「Aya, be careful at the junior college tomorrow.」</p><br/><p>「Y-, Yes.」</p><br/><p>***</p><br/><p>「We came.」</p><br/><p>It was Mai-san and Yurie-san who opened the front door.</p><br/><p>Well, I knew that they will come since I was looking at the tracking beacon’s video……</p><br/><p>「I saw it on the TV.</p><br/><p>It seems to be serious, huh.」</p><br/><p>「I think that the reporter is waiting in front of my house……</p><br/><p>I’m sorry, but can you put me up for the night?」</p><br/><p>「Sure.」</p><br/><p>「Thank you very much.」「I’m sorry.」</p><br/><p>「Are you going to stay for the night too, Mai-san?」</p><br/><p>「Un, I’d like to be by Yurie-san’s side for a while.</p><br/><p>Is it fine?」</p><br/><p>「Sure, it’s fine.」</p><br/><p>Everyone had gathered in my house in the end.</p><br/><p>I hope that the reporter quickly gives up too~.</p><br/><p>Translators notes:</p><br/><p>[1]In Japan, mansions aren’t huge houses or estates for the rich and famous, they’re small-ish apartment for regular people.</p><br/><p>[2]”Wide show” means news and talk show, and is a terminology invented and generally used at present in Japan. Wide show usually picks up scandals.</p><br/><p>[3]The censored characters should be セロ(Cyril)</p><br/>\n</div>"}