{"title": "Chapter 248 – Communication network", "id": 248, "volume": 3, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-248-%E2%80%93-communication-network", "volume_title": "Volume 3", "body": "<h1>Chapter 248 – Communication network</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Saturday. We will also go to the other world this week.</p><br/><p>The purpose for this week is to look for information about that black thingy on Yurie-san’s thigh.</p><br/><p>Since Yurie-san is being kept in after school together with Mai-san,</p><br/><p>the members are the four of us–Aya, Elena, Hilda, and I.</p><br/><p>First, we went to where Butte-sama was.</p><br/><p>「Hello, Butte-sama.」</p><br/><p>「My, my, if it isn’t Princess Elena.」</p><br/><p>It seems Butte-sama completely ignored us except for Elena, huh……</p><br/><p>「Honestly……」</p><br/><p>I explained Yurie-san’s situation and asked whether she has any idea what it is.</p><br/><p>「I haven’t heard of such curse.</p><br/><p>Besides, I don’t have any idea what is if even the appraisal displays that it’s not a『curse』.</p><br/><p>I’m sorry, Princess Elena. I’m not much of a help.」</p><br/><p>Umu, now that would be a problem.</p><br/><p>Even Butte-sama doesn’t know what it is.</p><br/><p>「Ah, that’s right, do you want this, Butte-sama?」</p><br/><p>「What is it?」</p><br/><p>I handed Butte-sama a certain thing.</p><br/><p>「What’s this!!?」</p><br/><p>Butte-sama stares at it as if wanting to eat it.</p><br/><p>「S-, Seiji-sama!</p><br/><p>Why did you give Butte-sama our photo album?」</p><br/><p>「Eh? It’s a good result of much effort so, don’t you want various people to see it?」</p><br/><p>「B-, But……」</p><br/><p>We left Butte-sama who continued to eagerly look at Elena and Hilda’s photo albums alone.</p><br/><p>***</p><br/><p>Next, we went to where Lela was.</p><br/><p>Although there’s Yurie-san’s matter, I’m also worried about what happened to the battle with the devil-kin.</p><br/><p>「Yo! Lela, we came again.」</p><br/><p>「Seiji, you came!」</p><br/><p>Lela greeted us with a pleasant smile.</p><br/><p>「I returned hastily last week, is there any new information since then?」</p><br/><p>「Yes, there is!</p><br/><p>That twin magic stones’ magic tool has finally been distributed to each town.」</p><br/><p>「Oh, that’s good to hear.</p><br/><p>So, did you have any talk with each town?」</p><br/><p>「Umu, we shared what kind of situation each town was in after the war with the devil-kin last week,</p><br/><p>and it was decided that each town will interchange materials and the likes that were lacking.」</p><br/><p>They’ve used it quite constructively, huh.</p><br/><p>It feels good, isn’t it?</p><br/><p>「However, there’s one problem……」</p><br/><p>「What problem?」</p><br/><p>「All of the magic tool’s pairs are at my place.</p><br/><p>Properly speaking, I think they should be at otou-sama’s place.」</p><br/><p>「No, not at all. They’re here at your place to save me the trouble.」</p><br/><p>「N? Why is that?」</p><br/><p>「Aren’t you the only one who can contact me, Lela?</p><br/><p>Can’t you call out to me with the twin magic stones?」</p><br/><p>「Is that so!? That’s right, isn’t it!?」</p><br/><p>Lela is glad the she nods with *un un*.</p><br/><p>If there’s a surprise attack of the devil-kin at some town, I will know it through Lela.</p><br/><p>In that case, it’s the outline which we can rush there immediately.</p><br/><p>Oh, we can’t rush there immediately if it’s on weekdays, though.</p><br/><p>「Ah, that’s right. I have a favor to ask of you, Lela.」</p><br/><p>「What is it, say anything!」</p><br/><p>「I want you to check it using the communication network.」</p><br/><p>I told her about Yurie-san’s matter.</p><br/><p>「I see, to help a woman who was manipulated by the devil-kin……」</p><br/><p>「Can you ask the people of the other towns?」</p><br/><p>「Ah, understood, I promised that I will listen to anything you say.」</p><br/><p>Lela went to the string phone’s private room and asked everything to the feudal lord of each town.</p><br/><p>「For the time being, there’s no immediate information,</p><br/><p>but since there’s also a place where you can ask a well-informed person in each town too,</p><br/><p>let’s wait for now.」</p><br/><p>「Ah, thank you.</p><br/><p>But, do you communicate with this magic tool, Lela?」</p><br/><p>「N? What do you mean?」</p><br/><p>「Lela, if there’s someone who contacts you when you go out, wouldn’t you be in trouble?」</p><br/><p>「Ah, that’s right, huh.」</p><br/><p>「Isn’t it better to appoint an expert to receive the calls?」</p><br/><p>「Umu, is that so……?」</p><br/><p>Well, it’s something like a phone number.</p><br/><p>「Have trustworthy men to stand guard at this room in turns,</p><br/><p>and, it’s also better to keep a record of the conversation.」</p><br/><p>「I see…..</p><br/><p>You know a lot about such things, huh, Seiji.」</p><br/><p>Come now, taking a memo during a phone call is only a natural thing for me to do as a working adult!</p><br/><p>———-</p><br/><p>When I was relaxing at Lela’s place for awhile―</p><br/><p>we finally heard from each town.</p><br/><p>「In the end, we didn’t obtain any valuable information from any of the towns.」</p><br/><p>「Is that so? It can’t be helped.</p><br/><p>We have no choice but to check other places.」</p><br/><p>「Is there any prospect somewhere?」</p><br/><p>「That’s right~.</p><br/><p>they are places where we can’t hear from using the twin magic stones’ magic tool……</p><br/><p>the demon town, and the Nippo town’s pioneer village.」</p><br/><p>And, there’s also the dragon-kin village,</p><br/><p>but that place is a secret.</p><br/><p>「Or rather, even to those two places,</p><br/><p>shouldn’t we install a twin magic stone’s magic tool?</p><br/><p>Since there’s an opportunity, should I deliver one to them?</p><br/><p>There’s probably a surplus of the magic tool, right?」</p><br/><p>「That’s true, that would save us the trouble.</p><br/><p>Since I will talk to otou-sama regarding that matter, please wait a moment.」</p><br/><p>———-</p><br/><p>After a short time, Lela finished talking to Lyle Gewalt and came back.</p><br/><p>「Since we can’t directly hand the magic tool over to the demonkind’s king in the demon town,</p><br/><p>it seems he wants you to hand it over to the person called Cassandra who can speak Delaidos Common Language and a former special trade envoy.</p><br/><p>Do you know her?」</p><br/><p>「Yes, she’s an acquaintance.」</p><br/><p>「And about the pioneer village, since it’s an area under the direct control of Nippo town,</p><br/><p>he wants you to deliver one set of the magic tool to the pioneer village and Nippo town so that they will be able to communicate with the Nippo town.」</p><br/><p>「Roger that.」</p><br/><p>I received the twin magic stones’ magic tools from Lela,</p><br/><p>and teleported to the demon town first.</p><br/><p>***</p><br/><p>I met with Cassandra-san in demon town,</p><br/><p>and handed her the twin magic stones’ magic tool.</p><br/><p>『This is Cassandra.</p><br/><p>Can you hear me, Lela-sama?』</p><br/><p>『Yes, I can hear you.</p><br/><p>It seems it has arrived safely.</p><br/><p>If there’s something at the demon town, inform me with this magic tool.』</p><br/><p>『Yes, understood.』</p><br/><p>Cassandra-san and Lela confirm that they can talk properly, so my delivery mission here is completed.</p><br/><p>And when I gave Elena and Hilda’s photo album to Cassandra-san, she was very glad.</p><br/><p>I was asked if there was a photo album of Mai-san by Bunmi-san, but―</p><br/><p>it seemed to be a violation of the law if I make a photo album of Mai-san so……</p><br/><p>The people at the demon town didn’t understand Yurie-san’s case either.</p><br/><p>***</p><br/><p>Then, I met with Rondo, and Misha-san at Nippo town,</p><br/><p>while giving them the twin magic stones’ magic tool,</p><br/><p>I also gave them Elena and Hilda’s photo album.</p><br/><p>Misha-san was also pleased with Hilda’s photo album,</p><br/><p>and Rondo wanted a photo album of Aya, but I completely ignored it.</p><br/><p>***</p><br/><p>The third place is Rachel-san’s pioneer village.</p><br/><p>When I gave her the twin magic stones’ magic tool and confirmed they she can communicate with Rondo, Rachel-san was overjoyed.</p><br/><p>And after giving Elena and Hilda’s photo album to Rachel-san―</p><br/><p>Rachel-san was also very happy with Hilda’s photo album.</p><br/><p>「By the way, Rachel-san. Do you have any information about a woman who was manipulated by the devil-kin some time ago?」</p><br/><p>「I’m sorry, this village doesn’t have such information.」</p><br/><p>「Right~.」</p><br/><p>When I’m at a loss―</p><br/><p>「At any rate, if you don’t find any information―</p><br/><p>it may be helpful to go to Toki town.」</p><br/><p>「N? Toki town, is it?」</p><br/><p>「There’s a famous『diviner』with accurate predictions in Toki town.」</p><br/><p>Although I don’t believe in divination that much……</p><br/><p>let’s try to go there since there’s also no clue.</p><br/>\n</div>"}