{"title": "Chapter 280 – The scheme of Nancy’s mom", "id": 280, "volume": 3, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-280-%E2%80%93-the-scheme-of-nancy%E2%80%99s-mom", "volume_title": "Volume 3", "body": "<h1>Chapter 280 – The scheme of Nancy’s mom</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>I completed the accessories that Nancy’s mom and Ringo designed with difficulty.</p><br/><p>When I looked at the three accessories, they’re quite amazingly made.</p><br/><p>The delightful faces of Nancy and Megumi-chan, who will receive these accessories that Ringo designed, seem to come into my mind.</p><br/><p>Nancy’s mom? I guess so, but only this time.</p><br/><p>***</p><br/><p>The next day, on the way home from work; I contacted Ringo at once and together, we went to show the accessories to Nancy and her mom.</p><br/><p>「Seiji, Ringo, welcome.」</p><br/><p>「Welcome.」</p><br/><p>Nancy and her mom greeted us.</p><br/><p>Nancy’s mom seemed to have been waiting impatiently for the completion of the accessories, too.</p><br/><p>The president and Megumi-chan came immediately afterwards, too.</p><br/><p>「Well then, with everyone gathered in place-」</p><br/><p>I took out three wooden-box-like things, lined them up on the table, and then, opened their respective lid.</p><br/><p>「Fuwaaa!!」</p><br/><p>Ringo raised a voice of admiration at the very beginning.</p><br/><p>Ringo examined the accessories inside the wooden boxes that became empty one-by-one while breathing heavily with *haa haa*; finally, she lined up the three accessories and looked at them in a trance.</p><br/><p>I completed them with so much difficulty, I’m so glad that Ringo seemed to be pleased.</p><br/><p>However, Ringo’s eyes gradually lost their focus and she collapsed towards me unsteadily.</p><br/><p>「Ringo, what happened? Are you alright?」</p><br/><p>「I…I don’t, feel t-, too well.</p><br/><p>I’m, glad, glad……」</p><br/><p>Although you are delighted with the result of the accessories……</p><br/><p>Is it the joy of making something? Or you are greatly moved that such emotion pierced through?</p><br/><p>「My designed accessories…are so beautiful……</p><br/><p>I…can’t take it……anymore……」</p><br/><p>While Ringo, who was in my arms, was staring at me,</p><br/><p>she showed an ecstatic expression, her body convulsed with *bikun bikun* and then fainted.</p><br/><p>This-, will she be alright?</p><br/><p>Nancy receives the blue necklace and is frolicking too much.</p><br/><p>Megumi-chan is entranced, she has the president to attach the pink brooch.</p><br/><p>And speaking of Nancy’s mom……</p><br/><p>Hm? Nancy’s mom hasn’t moved since a while ago.</p><br/><p>What seems to be the matter?</p><br/><p>「A lie……</p><br/><p>it’s a lie……</p><br/><p>such accessories are impossible……」</p><br/><p>Nancy’s mom mutters *butsu butsu* while trembling all over with *wana wana*.</p><br/><p>「Mama-san, what happened?」</p><br/><p>「It’s impossible……」</p><br/><p>Umu, as expected, did I go a little too far?</p><br/><p>Ringo, Nancy and Megumi-chan’s delighted expressions that I wanted to see, are slightly too enthusiastic right now, aren’t they~?</p><br/><p>But, I don’t regret it. (Kiri-![1])</p><br/><p>From there, Nancy’s mom began to talk like a machine gun.</p><br/><p>「To begin with, it’s impossible to complete them in such a short period of time no matter how I think about it!</p><br/><p>And then, this metal. What’s this? Silver?? No, it’s different; Silver doesn’t have a strength like this. Besides, its radiance is more beautiful than silver. What’s this metal, really!!!?</p><br/><p>Then, this jewel. It should be the『Nullpo Stone』that I gave you.</p><br/><p>Although it was beautiful, that stone was difficult to process; it should’ve been something troublesome to deal with! However, just right after yesterday……」</p><br/><p>Then why did you let me use such a thing!?</p><br/><p>「And then, this design……</p><br/><p>I was considerably drunk during that time……</p><br/><p>it can’t be, such design……」</p><br/><p>It’s a lie……</p><br/><p>You didn’t design it properly!?</p><br/><p>「It’s a lie……</p><br/><p>Lie, lie……</p><br/><p>……there’s no such disgrace!</p><br/><p>……why……am……</p><br/><p>I captivated with the accessories that another person made!!?</p><br/><p>A-, Annoying……</p><br/><p>b-, but……」</p><br/><p>And then, Nancy’s mom doesn’t care about the public attention……</p><br/><p>she began crying *waah-waah*.</p><br/><p>「Wai-, mama, what’s wrong!?」</p><br/><p>Nancy’s mom snuggled up to Nancy and they went to the bedroom.</p><br/><p>Ringo has fainted with an expression of ecstasy,</p><br/><p>as for Megumi-chan, she’s entranced which seems to be called there in the body, but not in spirit while playing around with her brooch……</p><br/><p>Why did it became like this?</p><br/><p>I didn’t mean this to happen, I just want everyone to be glad.</p><br/><p>In the end, we broke up on that day and I brought Ringo, who fainted, home with me.</p><br/><p>***</p><br/><p>A few days passed after that. Friday night of that week……</p><br/><p>「Onii-chan, Nancy’s mom is on the TV.~」</p><br/><p>「What!?」</p><br/><p>When I looked at the TV, Nancy’s mom was surrounded by reporters.</p><br/><p>『From here, there’s going to be an announcement about a new jewelry product from the representative of Nancy・Jewelry, Jennifer・Anderson-san.』</p><br/><p>What!?</p><br/><p>I have a bad feeling about this……</p><br/><p>Somehow or other, that bad feeling seemed to have been proven right,</p><br/><p>the tiara that I made for Nancy’s mom was exaggeratedly carried from inside.</p><br/><p>『Good heavens! What a magnificent tiara!!</p><br/><p>It’s magnificent to the extent that you wouldn’t think that it is something of this world!!!』</p><br/><p>The female reported has an extremely high praise, too.</p><br/><p>『But Jennifer-san, the design has an atmosphere quite different from the Nancy・Jewelry has thus far, what’s your intention on it?』</p><br/><p>『This magnificent tiara isn’t my design.』</p><br/><p>『Pardon!!?』</p><br/><p>『Tonight, I will introduce a new designer of Nancy・Jewelry.』</p><br/><p>Oy, it can’t be that……</p><br/><p>While the reporters were astir,</p><br/><p>Ringo appeared with a frightfully tensed expression!!</p><br/><p>Or rather, Ringo……is too tense, her hand and foot are moving at the same time!</p><br/><p>『H-, H-, H-, Hello……</p><br/><p>It’s Sa-, Sa-, Sa-, Satou Ringo.』</p><br/><p>Ringo, you’re too tense!!</p><br/><p>『Satou-san is very young, but how old are you?』</p><br/><p>『I’m n-, nineteen years old. I’m attending a vocational school right now.』</p><br/><p>『Satou-san, what is your thought about being selected as a designer of the world-famous Nancy・Jewelry?』</p><br/><p>『I-, I-, I will try my best!』</p><br/><p>What a disaster it has become.</p><br/><p>Nancy’s mom had Ringo to step back and began to explain.</p><br/><p>『Actually, this tiara isn’t the only one of its kind,</p><br/><p>it’s one of the three works, the tiara, the necklace and the brooch.</p><br/><p>Well then, let’s introduce the two other works.』</p><br/><p>When Nancy’s mom sent the signal,</p><br/><p>Nancy, who wore a necklace,</p><br/><p>and Megumi-chan, who wore the brooch, appeared.</p><br/><p>Even Megumi-chan, why!?</p><br/><p>『Japan, which is called the Land of the Rising Sun, is a country surrounded by the sea,</p><br/><p>and when I came to this country, I felt the sincerity of its people.</p><br/><p>In connection with that, these three accessories……</p><br/><p>The red jeweled tiara is【The Sun】.</p><br/><p>The blue jeweled necklace is【The Sea】.</p><br/><p>And then, the pink jeweled brooch is named【The Heart】.』</p><br/><p>Waaaaaaaa!!</p><br/><p>The thunderous applause of the reporters resounded.</p><br/><p>As expected of Nancy’s mom, a capable/shrewd person.</p><br/><p>『By the way, these two people who wore the necklace and the brooch are?』</p><br/><p>『The one, who is wearing the necklace, is Nancy, my daughter.</p><br/><p>Nancy is going to work as the manager of the Nancy Jewelry Japan Store that’s going to open this time.』</p><br/><p>『I’m Nancy. People of Japan, please treat me well.』</p><br/><p>『And then, the one who is wearing the brooch is Yachiyo Megumi-chan; she is going to work as an exclusive model of Nancy・Jewelry this time. 』</p><br/><p>Megumi-chan smiled sweetly towards the reporters.</p><br/><p>Seriously!?</p><br/><p>Translator’s note:</p><br/><p>[1]きりっ (or キリリ) is a mimetic word that expresses an attitude of fortitude and resoluteness before calmly stating one’s opinion.</p><br/>\n</div>"}