{"title": "Chapter 290 – The Four Interviewers", "id": 290, "volume": 3, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-290-%E2%80%93-the-four-interviewers", "volume_title": "Volume 3", "body": "<h1>Chapter 290 – The Four Interviewers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>That week, I kept going to Nancy Jewelry making arrangements.</p><br/><p>Somehow or other, the Nancy Jewelry seemed to be using the system that our company developed.</p><br/><p>Because the developer is in the America head office, he doesn’t have knowledge about Japanese language, and Japanese law and tax and it seems he left the decision over the Japanese shop’s system to someone else.</p><br/><p>And then, Friday afternoon of that week.</p><br/><p>When I went to help Nancy again,</p><br/><p>Nancy was cleaning the office which had been left untidy until now.</p><br/><p>「Nancy, I’ve come.</p><br/><p>You suddenly start tidying up, what happened?」</p><br/><p>「I have an interview today.」</p><br/><p>「Interview?」</p><br/><p>「We found people who would like to work quickly.」</p><br/><p>「I see,</p><br/><p>then, should I help you in making arrangements and with the paperwork again next time?」</p><br/><p>「At any rate, please help me with the『interview』.」</p><br/><p>「Eh!?」</p><br/><p>「Since Seiji can speak both English and Japanese, you’ll save me the trouble if you’re there~.」</p><br/><p>Oi oi, don’t let someone from another company be present at the company’s interview.</p><br/><p>Well, I understand since mama-san isn’t here and you don’t have enough manpower.</p><br/><p>Somehow or other, it seems to be something called Nancy Jewelry’s opening staff’s first group interview.</p><br/><p>While having me to help with the paperworks and etcetera at first, she seems to be planning to have me work like a chief in the future.</p><br/><p>Isn’t it a considerably important interview……</p><br/><p>———-</p><br/><p>When I help her to clean until the scheduled time of the interview,</p><br/><p>Ringo and Megumi-chan came as usual.</p><br/><p>These two people always drop by to play with this and that as the reason, huh~.</p><br/><p>「I’ll work as an interviewer, too!</p><br/><p>At the same time, make Ringo an interviewer, too!」</p><br/><p>Megumi-chan said such a thing.</p><br/><p>「Me, too?」</p><br/><p>Even Ringo appears to be bewildered when such a sudden and strange subject is brought up.</p><br/><p>However, were these two people that close?</p><br/><p>Megumi-chan addresses Ringo without honorifics.</p><br/><p>With this and that, it was decided that the four of us–Nancy, Ringo, Megumi-chan and I–are going to work as the interviewers.</p><br/><p>It’s going to be difficult for the interviewee, too……</p><br/><p>———-</p><br/><p>It was time and the four interviewee gathered.</p><br/><p>However, I’m very interested in one particular person out of the four people~.</p><br/><p>「Well then, the first person,『Tomifu Kasumi』-san, please come in.」</p><br/><p>Why am I the one managing everything by myself?</p><br/><p>「Excuse~ me.」</p><br/><p>『Hello, to which extent can you speak English?』</p><br/><p>『Uhh, because I’ve lived in the United States before~, I can converse normally~.』</p><br/><p>This Tomifu Kasumi-san is proficient in English to the extent of being able to answer Nancy’s question……but she seems to be lacking a little in seriousness.</p><br/><p>『What is your reason for applying to this job?』</p><br/><p>Megumi-chan asks her a question in a proud manner.</p><br/><p>『Let me see~, because it’s a short-distance commute to work?』</p><br/><p>Megumi-chan seems to be glad that an adult answered her question and nods joyfully.</p><br/><p>Megumi-chan……don’t you have to tsukkomi when you heard such a strange answer!?</p><br/><p>『Do you like jewelry?』</p><br/><p>Ringo asks the question this time.</p><br/><p>『Some time ago~ I bought a jewelry when I was traveling abroad~</p><br/><p>it was practically fake~ I was so mad!』</p><br/><p>Is this person alright……?</p><br/><p>———-</p><br/><p>「Then, next,『Mizutani Mio』-san, please enter.」</p><br/><p>「Ye~s.」</p><br/><p>With only her reply, the unpleasant premonition is throbbing.</p><br/><p>However, looking at this person, her breasts are amazing, even I will get har…….no, it’s nothing.</p><br/><p>「『Mizutani Mio』de~su. Please treat me well.」</p><br/><p>Why are you facing towards me when saying that?</p><br/><p>『I’m sorry, but since the manager, Nancy, doesn’t speak Japanese, speak in English please.』</p><br/><p>『Ah, ye~s.</p><br/><p>It’s「Mizutani Mio」~. Please treat me well.』</p><br/><p>The words are in English, but……</p><br/><p>Somehow, she’s making eyes at me.</p><br/><p>I think if you want to curry favor, look towards Nancy.</p><br/><p>『What’s your reason for applying to this job?』</p><br/><p>Does Megumi-chan only have that question?</p><br/><p>『If it’s a luxurious jewelry shop like this place, I think I may be able to meet a rich person.』</p><br/><p>I’m not going to retort~!</p><br/><p>『Do you like jewelry?』</p><br/><p>Even Ringo only has one kind of question, huh.</p><br/><p>『I like getting one.</p><br/><p>But, since my ex-boyfriend gave me something which was in a branded box, I had high expectations, however, when I opened it, it was a cheap ring, so I sold it to a pawnshop, but then my boyfriend got mad.』</p><br/><p>I will probably lose if I retort……</p><br/><p>———-</p><br/><p>「Then, next is『Tsuchiya Renge』-san, please come in.」</p><br/><p>「Y-, Yes.」</p><br/><p>Tsuchiya Renge-san was someone who seemed to be a little chubby.</p><br/><p>『It’s Tsuchiya Renge.</p><br/><p>I can speak English a little. Please treat me well.』</p><br/><p>Finally, someone who seems to be serious.</p><br/><p>『What’s your reason for applying to this job?』</p><br/><p>Megumi-chan, did you prepare only that question?</p><br/><p>『U-, Uhh……</p><br/><p>I’m sorry, could you say it again?』</p><br/><p>Umu,</p><br/><p>I have expectations because it’s someone who seems to be serious, but……</p><br/><p>I think that this person isn’t that much good at English.</p><br/><p>It’s going to be a little hard if it’s the case since Nancy can only speak English.</p><br/><p>———-</p><br/><p>「Then, the last one,『Hiyama Ai』-san, please come in.」</p><br/><p>『Excuse me.</p><br/><p>I’m「Hiyama Ai」, please treat me well.』</p><br/><p>The last person seems to be serious and her English is perfect, too.</p><br/><p>『What’s your reason for applying to this job.』</p><br/><p>In the end, Megumi-chan faced them with only this one question, huh.</p><br/><p>『I like the Nancy Jewelry’s jewelry very much,</p><br/><p>particularly, the  which was released last year……』</p><br/><p>She began to talk about Nancy Jewelry’s products.</p><br/><p>We found out that she has a profound understanding about Nancy Jewelry.</p><br/><p>With this and that, the interview of the four people was over.</p><br/><p>———-</p><br/><p>『Seiji, Ringo, Megumi, how was the interview?</p><br/><p>Let me hear your thoughts.』</p><br/><p>『I think that the last person is good.』</p><br/><p>Ringo’s opinion is reasonable.</p><br/><p>『I think so, too. That last person is very good.』</p><br/><p>Megumi-chan says so, too.</p><br/><p>Well, if you think about it normally, the best and correct choice is to choose that person.</p><br/><p>But, with that person,</p><br/><p>there’s a fatal problem.</p><br/><p>To that person……</p><br/><p>the【Vigilance】magic indicates『caution』~.</p><br/><p>Translator’s notes:</p><br/><p>Please support the author by buying his work.</p><br/>\n</div>"}