{"title": "Chapter 297 – Heading off alone", "id": 297, "volume": 3, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-297-%E2%80%93-heading-off-alone", "volume_title": "Volume 3", "body": "<h1>Chapter 297 – Heading off alone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Work was over, I went to fetch Elena and Hilda up and went home.</p><br/><p>「Welcome home onii-chan, Elena-chan and Hilda-chan!」 </p><br/><p>「「We’re home.」」 </p><br/><p>「Aya, you seem to be happy, huh.」</p><br/><p>「That’s because, the exams are finally over!」 </p><br/><p>「I see, in other words, it’s summer vacation, huh.」</p><br/><p>「Right! Sum~mer va~ca~tion~!!!」</p><br/><p>Aya is delighted over summer vacation… are you a grade school student?</p><br/><p>「That’s why~, take us out to have fun, onii-chan!」</p><br/><p>「It’s no good because there’s still the matter about Nancy and the others.」 </p><br/><p>「S-, Such a thing~…」</p><br/><p>「Seiji-sama, what are we going to do about the conquering of the [Tower of sunrise]?」 </p><br/><p>「Because there’s the matter about Nancy and the others, huh~.」</p><br/><p>「Onii-chan, I want to go to the [Tower of sunrise] too. I’m the only one who remains to be low-leveled.」</p><br/><p>Hmmm, it’s a point that makes me waver. </p><br/><p>I can’t restore Yurie-san to her previous self if we don’t make progress in the conquering of the tower… </p><br/><p>(There’s no one saying that there’s no need for her to return to her previous self, is there? Right?)</p><br/><p>Having said that, it’ll be troublesome if something came up while we’re advancing in conquering of the tower.</p><br/><p>「Seiji onii-chan, I’d like to stay and guard Megumi-san.」</p><br/><p>Somehow or other, Hilda seemed to have been getting along with Megumi-chan a lot.</p><br/><p>Alright! It has been decided!</p><br/><p>「Hilda will guard Megumi-chan, while Aya will guard Ringo and Elena will guard Nancy and her mom. I’m going to conquer the [Tower of Sunrise] alone.」</p><br/><p>「Only onii-chan, it’s unfai~r.」 </p><br/><p>「You and Ringo are friends, right?」</p><br/><p>「T-, That’s… that’s right, but… leveling up…」</p><br/><p>「Such a thing as leveling up, you can do that at anytime, right? Since it’s the long-awaited summer vacation, how about you invite Ringo, Mai-san and Yurie-san to go out and have fun somewhere?」 </p><br/><p>「U~n, that’s right, huh. I’ll do that.」</p><br/><p>「Elena will be guarding two people, but prioritize in guarding Nancy than her mom.」 </p><br/><p>「Okay, leave it to me.」</p><br/><p>「Hilda, practice dancing and singing while guarding her since I’m going to pay for the lesson fees.」 </p><br/><p>「Yes.」</p><br/><p>「Eh? What? Dancing and singing?」</p><br/><p>Aya butted in.</p><br/><p>「When Megumi-chan was attacked by bad guys, Hilda drove the bad guys away with her dance ability. Right, Hilda.」</p><br/><p>「Yes!」</p><br/><p>「It’s good, huh~. </p><br/><p>I’d like to learn dancing, too~.」 </p><br/><p>「When Nancy and the other’s safety is guaranteed, we’ll learn dancing together.」</p><br/><p>「Really!?」 </p><br/><p>「Ah, because you can acquire Dance Skill when taking lessons in dancing, there won’t be a loss in acquiring it.」</p><br/><p>「Seriously? That’s good! Hilda-chan, show us your dancing!」</p><br/><p>「Y-, Yes.」</p><br/><p>Hilda nodded bashfully and showed us the [Evasion Dance] that she had just acquired.</p><br/><p>By the way, since I set up a barrier blocking the sound on the floor, it won’t cause any trouble for the people below the floor.</p><br/><p>「Wow, amazing, amazing! Hilda-chan is wonderful!!」</p><br/><p>After that, Aya and Elena were taught how to dance by Hilda until dinner was ready.</p><br/><p>⁂</p><br/><p>On the next day, Saturday, we went off on our own way.</p><br/><p>Aya meets up with Mai-san, Yurie-san and Ringo and sees a movie. </p><br/><p>Hilda goes into the lesson with Megumi-chan. </p><br/><p>Elena goes to Nancy’s place.</p><br/><p>Since Nancy and her mom said that they were going to a [bouldering] gym, Elena went to accompany them, too.</p><br/><p>[Bouldering] is a free climbing sport performed without using ropes. </p><br/><p>It seems like it’s fun.</p><br/><p>⁂</p><br/><p>After seeing everyone off, I went to the different world and came to Masamune-san’s place at the Demonkind’s town.</p><br/><p>「Hello~. Is the sword done?」</p><br/><p>「Ou, Seiji, it’s done.」</p><br/><p>Masamune-san brought the sword.</p><br/><p>「This fellow’s name is [Brown Belt Sword].」</p><br/><p>I thought the next one to the white belt is black belt, but brown belt, huh~. </p><br/><p>Is it black belt after this?</p><br/><p>┌───────────── </p><br/><p>│[Brown Belt Sword] </p><br/><p>│The sword that has become the proof that the sword art has been approved. </p><br/><p>│Absorbs the user’s habit and becomes strong. </p><br/><p>│Ability: Raises the power of [wind blade]. </p><br/><p>│ Raises attack power towards monsters with attribute. </p><br/><p>│Rarity: ★★★★ </p><br/><p>│Trial: </p><br/><p>│ Lightning-attributed monster subjugation 0/30 </p><br/><p>│ Ice-attributed monster subjugation 0/30 </p><br/><p>│ Darkness-attributed monster subjugation 0/30 </p><br/><p>│ Light-attributed monster subjugation 0/30 </p><br/><p>└─────────</p><br/><p>Some ability has increased. </p><br/><p>[Raises attack power towards monsters with attribute], huh~. </p><br/><p>Let’s try it out later.</p><br/><p>The trial seems to be similar when it was still White Belt Sword. </p><br/><p>It becomes Lightning, Ice, Darkness and Light, and the subjugation amount has increased from 10 to 30, too.</p><br/><p>Well, if it’s this much, I will be able to manage somehow or another.</p><br/><p>I thanked Masamune-san and headed off to conquer the Tower of Sunrise.</p><br/><p>⁂</p><br/><p>Conquering the Tower of Sunrise from the 45th floor.</p><br/><p>It was a metal-walled-labyrinth-like place and the atmosphere was completely different from the other floors so far.</p><br/><p>It completely feels like I’m on board a spaceship.</p><br/><p>When I try to touch the wall, a strong, tearing static electricity is generated many times.</p><br/><p>The enemy was an extremely strong [Orc]. </p><br/><p>Every one of those [Orcs] has hair standing on end, they look like they have evolved into [Super Saiyans], don’t they? </p><br/><p>For the time being, let’s call them [Super Orcs].</p><br/><p>The Brown Belt Sword was frightfully sharp, the [Super Orcs] were chopped up one after another.</p><br/><p>I climbed up the tower while checking on everyone’s situation once in awhile with [Tracking Beacon], I took a break once I got to the 50th floor.</p><br/><p>The [Super Orcs] seemed to be [Lightning] attributed and of the Brown Belt Sword’s trial, the [Lightning attribute subjugation] was cleared with 30/30.</p><br/>\n</div>"}