{"title": "Chapter 304 – Ally of justice?", "id": 304, "volume": 4, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-304-%E2%80%93-ally-of-justice", "volume_title": "Volume 4", "body": "<h1>Chapter 304 – Ally of justice?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The fourth warning of [Vigilance] magic. </p><br/><p>When I checked the [Tracking Beacon] to see what it was……</p><br/><p>It was a scene where a woman was hanging weakly in the air and her feet were swaying with sway sway.</p><br/><p>What the hell—!!</p><br/><p>When I looked around, it was a scene where [Hiyama Ai] was being strangled by [Gold].</p><br/><p>『Go-, Gold, -sama…… f-, for, give, m…』 </p><br/><p>『Because you failed in the beginning! My plan shouldn’t have become such a thing!!』</p><br/><p>Gold’s eyes became bloodshot and he squeezed her neck tight with all his might. Because of the excessive power that he was using, [Ai-san]’s feet rose up.</p><br/><p>Crap!!! </p><br/><p>I quickly transformed myself into a ninja and rushed there using [Teleportation].</p><br/><p>Bang!</p><br/><p>I give Gold a dropkick.</p><br/><p>Gold and Ai-san lost their balance and fell down, and I was able to somehow take them out from strangling-situation.</p><br/><p>『Cough, cough!!』 </p><br/><p>『Shit, what the heck are you doing!?』</p><br/><p>Phew, it seemed I was able to save Ai-san somehow. </p><br/><p>Now, what to do……</p><br/><p>Since the two of them are speaking in Chinese, let’s try talking to them in Chinese.</p><br/><p>『Hey.』</p><br/><p>『Eh? Waaa!! Who are you!!?』</p><br/><p>Gold notices me and is surprised like crazy.</p><br/><p>『I’m Japanese・Ninjaman, an ally of justice.』 </p><br/><p>『Y-, You sonnovavitch! It was said that you were the guy who intercepted the mafia! W-, What business do y-, you have with the me?』 </p><br/><p>『I’m an ally of justice, so I always come to eliminate an evil mastermind like you.』</p><br/><p>『Shit! I’m not going to be eliminated by the likes of you!』</p><br/><p>Gold took out a handgun–</p><br/><p>Bang!</p><br/><p>and suddenly pulled the trigger!!</p><br/><p>『Hey, hey! Do you plan to repeat your crimes over and over again?』</p><br/><p>『I-, Impossible…… to the dodge the bullet of the handgun……』</p><br/><p>I slowly approach Gold.</p><br/><p>『D-, Don’t come! You monster!!』</p><br/><p>Gold backs off. </p><br/><p>Then-! </p><br/><p>From the side, there was a fellow who threw herself between us.</p><br/><p>『G-, Gold-sama…… p…please…run away……』</p><br/><p>It’s Ai-san.</p><br/><p>Although you were nearly killed just a moment ago, you’re still going to protect him, huh…… </p><br/><p>Aren’t you still dizzy!?</p><br/><p>『Guhahaha!』</p><br/><p>Did he become insane or something? </p><br/><p>Gold began to roar with laughter.</p><br/><p>『Don’t come closer if you value this person’s life!』</p><br/><p>That guy, Gold, took out a knife from his breast pocket and pressed it on Ai-san’s neck. </p><br/><p>Jeez, it’s reversed……</p><br/><p>『Well, what’s the matter, if you’re an ally of justice, you wouldn’t ignore a hostage’s life!』</p><br/><p>『I’m telling you…… isn’t that woman your ally? Why would I save an enemy’s life?』</p><br/><p>『T-, That’s not it! This person isn’t my ally or something like that!』 </p><br/><p>『G-, Gold-sama……』</p><br/><p>『Well, even if she’s not your ally, I don’t have any social obligation to save that woman.』 </p><br/><p>『What did you say?! You’re an ally of justice, right!? What do you think of a person’s life?!』</p><br/><p>『You’re one to talk! If I let a bad person get away by saving a hostage’s life, the victims will just increase even more, don’t you agree? A guy, who doesn’t understand such a thing, can’t be called an ally of justice.』 </p><br/><p>『T-, This cannot be……』</p><br/><p>Actually, I know that Gold doesn’t have any intention to kill her, you see~. </p><br/><p>That’s why such a bluff works.</p><br/><p>Actually, when he takes Ai-san as a hostage, the [Vigilance] magic isn't notifying me of the danger.</p><br/><p>What's happening turns out to be the two people’s bogus. </p><br/><p>When I ignored it and rapidly advanced…… </p><br/><p>Gold pushed Ai-san away and escaped as fast as his legs could carry him.</p><br/><p>『Gue!!』</p><br/><p>I can’t let such a slow-footed guy free. </p><br/><p>After Gold suffered from my electric shock, he fell over flashily as he let out a strange cry and stopped moving.</p><br/><p>『You’re wasting my time.』</p><br/><p>I took down Gold and turned around to face Ai-san’s direction.</p><br/><p>『Hiii!』</p><br/><p>Ai-san seemed to have been paralyzed and couldn’t move from the spot.</p><br/><p>Hm? Did some tea or something spilled? </p><br/><p>Well, whatever.</p><br/><p>『Now then, woman. I’ll let you choose what will happen to this man from this moment on.』 </p><br/><p>『M-, Me…… c-, choose?』</p><br/><p>『That’s right, 1. I will kill this man. 2. You’ll report and turn him over to the police. Now then, choose.』 </p><br/><p>『S-, Such a thing…… I can't do something like betraying Gold-sama……』</p><br/><p>『I see, you chose number one, huh……』 </p><br/><p>『T-, That’s not it!! Somehow, please let us off!! Since if you do, I’ll give my life to you!!』</p><br/><p>『I don’t need something like your life! This man is the mastermind of the recent synchronized, multiple terrorist attacks; it’s impossible for me to let him off!』</p><br/><p>『……I understand…… I-, I will, report…him.』</p><br/><p>Ai-san finally made up her mind up to call the police.</p><br/><p>「Hello, is this the police? Uh, that, G-, Gold-sama…… is the mastermind of the recent terrorism incident and then, he tried to kill me……」</p><br/><p>When Ai-san finished the call, she broke down crying with waah-waah.</p><br/><p>⁂</p><br/><p>Since the police arrived in a few minutes, I disappeared using [Night Shade] and watched how things play out.</p><br/><p>「Are you the one who made the report?」 </p><br/><p>「Yes……」</p><br/><p>「Where’s the one called Gold?」 </p><br/><p>「He's collapsed over there.」</p><br/><p>About several police officers went to where Ai-san pointed at and found Gold, who's collapsed.</p><br/><p>「Hey, bring the stretcher!」 </p><br/><p>「Okay.」</p><br/><p>Gold was put on the stretcher and was carried away.</p><br/><p>「Do you have a moment? It seems you have been strangled, but what happened to that man?」 </p><br/><p>「That…… a ninja……」</p><br/><p>While Ai-san is being cautious towards me, who is invisible, she explains the situation to the police.</p><br/><p>「Shit! The ninja again!?」</p><br/><p>Huh? Am I being considered an enemy by the police? </p><br/><p>Did I act too flashy? </p><br/><p>But it can’t be helped, right? </p><br/><p>After awhile, a female police officer brought over a blanket and approached Ai-san, but……</p><br/><p>Ai-san held out both her hands out in front in an [arrest-me1]-pose. </p><br/><p>「Hm? Did something happen with your hands?」</p><br/><p>「T-, That’s not it, I’m Gold-sama’s accomplice and cooperated with Gold-sama in various ways……」</p><br/><p>When she spoke up to there, Ai-san burst into tears again.</p><br/><p>「I understand, I’ll listen to your story at the police station.」</p><br/><p>As such, the female police officer gently wrapped the blanket around Ai-san and led her towards the police car.</p><br/><p>Ahh, it’s finished, finished! </p><br/><p>I’m already at my limit!</p><br/><p>My mind and body are really exhausted…… </p><br/><p>Let’s quickly go back home and have Elena massaged my shoulders or something. </p><br/><p>I left the rest to the police and went home quickly.</p><br/><p>It’s actually “tie me with a policeman’s rope” or something.</p><br/>\n</div>"}