{"title": "Chapter 308 – The Magical Girl And The Female Ninja", "id": 308, "volume": 4, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-308-%E2%80%93-the-magical-girl-and-the-female-ninja", "volume_title": "Volume 4", "body": "<h1>Chapter 308 – The Magical Girl And The Female Ninja</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The next morning, after sending Elena and Aya to Nepal with [Teleportation], I went to the company.</p><br/><p>As for Hilda, since she was staying at Megumi-chan’s place, she told me that she’ll pass this time.</p><br/><p>Now then, is it going to be alright with just the two of them?</p><br/><p>I’ll fully monitor their situation while working.</p><br/><p>◊♦◊♦◊♦◊♦◊</p><br/><p>First, Elena and Aya acquired [Nepali], which is the local language, with [Temporary Language Acquisition Magic Stone +2], and then asked a passer-by for directions and went to the refugee camp.</p><br/><p>However, the two of them weren’t able to meet an injured person.</p><br/><p>Strange foreign girls suddenly coming and saying things such as wanting to meet the injured people, it’s impossible for them to trust the two.</p><br/><p>「What are we going to do, Elena?」</p><br/><p>「I’d like to meet them in person to use recovery magic, but there’s no way.」</p><br/><p>「Then, are you going to give up and go back?」</p><br/><p>「No.」</p><br/><p>Elena went to a location hidden from the public eye, she then transformed herself into a magical girl using the [Transformation Ring], took the [Rod of Aesculapius] out of her [Storage Bracelet], and then took a fighting stance.</p><br/><p>「Oh, Elena-chan, you’re doing that, huh! Then, just in case, put on that mask as well.」</p><br/><p>「Alright.」</p><br/><p>Elena, after putting the masquerade-like mask on, slowly channeled her magic power.</p><br/><p>Invoking the [Divine Protection Of The Recovery Spirit], a gentle pink-colored light spreads out with Elena as the center, enveloping the whole town.</p><br/><p>「What’s this light!?」</p><br/><p>「The light is spreading out from over there.」</p><br/><p>“What is it!”, the surrounding people, who noticed it, started making an uproar.</p><br/><p>Isn’t this bad?</p><br/><p>Elena is unable to move while she’s still using the magic.</p><br/><p>「Everyone! This way!」</p><br/><p>A citizen found Elena and shouted.</p><br/><p>When they heard that voice, all the citizens gather.</p><br/><p>Elena was finally surrounded.</p><br/><p>Crap.</p><br/><p>I was going to pretend to be going to the restroom and go to help, but…… the situation is somehow strange.</p><br/><p>The people, who were crowding around her, knelt on the spot and started praying.</p><br/><p>When Elena smiled sweetly at those people, the [Divine Protection Of The Recovery Spirit]’s light spread out even more, becoming one-level stronger.</p><br/><p>A short time later, the staggering number of the people praying completely filled the space around Elena.</p><br/><p>This, what is she going to do?</p><br/><p>However, Elena wasn’t embarrassed, she approached the people praying and stopped in front of a woman, who had an injured face.</p><br/><p>When Elena brought the [Rod of Aesculapius] near that woman, the Recovery Magic’s light envelops the woman and the injury on that woman’s face healed completely.</p><br/><p>The surrounding people started praying even more fervently and it became out of control.</p><br/><p>Even so, Elena didn’t stop and an injured person, whom she noticed, was being healed one after the other.</p><br/><p>As for Aya, when I tried to see what she’s doing……</p><br/><p>She changed into an appearance of a pink ninja for some reason and was going around applying [Recovery Magic] on the people with non-serious diseases.</p><br/><p>Why pink, and why ninja?</p><br/><p>Somehow or other, as the level of Aya’s Recovery Magic rises, the likes of non-serious injuries, too, are being healed on the way.</p><br/><p>Almost all the injuries and diseases are healed, and since the gathered people continue to pray around the two, it’s impossible for them to sneak out of the place.</p><br/><p>「I’d like to get out quietly, but…… it’s troublesome.」</p><br/><p>「At such a time, are you going to summon that!?」</p><br/><p>Aya hold the pendant she wore around her neck high up and shouted.</p><br/><p>「’Nii-chaan・Comee!」1</p><br/><p>What kind of parody is this?</p><br/><p>Well, I understood that she wants me to come.</p><br/><p>I pretended to be going to the restroom and put on [Invisibility], I then rushed towards the two people with [Teleportation].</p><br/><p>「Don’t call me in the midst of work.」</p><br/><p>I spoke to the two people in a low voice while still invisible.</p><br/><p>「Seiji-sama, I’m sorry to trouble you at such a busy time.」</p><br/><p>「Now then, onii-chan, take us to a safe place!」</p><br/><p>Don’t [take us!] me!</p><br/><p>Good grief.</p><br/><p>◊♦◊♦◊♦◊♦◊</p><br/><p>I sent the two people home.</p><br/><p>「Hm? We’re back home?」</p><br/><p>「It’s already enough for today. Do it again tomorrow.」</p><br/><p>「Alright.」</p><br/><p>It’s distressful, I can’t even work quietly.</p><br/><p>I immediately went back to the company.</p><br/><p>◊♦◊♦◊♦◊♦◊</p><br/><p>Since that day, Aya and Elena went to Nepal everyday and kept casting Recovery Magic at various places.</p><br/><p>And then, Friday night.</p><br/><p>The [Divine Protection Of The Recovery Spirit] was spread out across five places and covered a considerably large area.</p><br/><p>At the actual place, it seems to have become a talk about a goddess and a ninja are wandering around healing injured people at various places.</p><br/><p>They’ll go home after they finished today’s on-site activity; Hilda was the first one to return home and looked after the house.</p><br/><p>「I’m home, Hilda.」</p><br/><p>「Welcome back.」</p><br/><p>I finished having dinner with the four people after a long time, I was refreshed when I drank tea and had a talk with Elena and Aya.</p><br/><p>「Elena, Aya, let’s stop the activity in Nepal for now. If it continues as it is, unrelated people, who might get the wind of it, will come.」</p><br/><p>「Yes.」「Well, it can’t be helped, huh~.」</p><br/><p>The two people, too, seem to understand somehow and obediently listened.</p><br/><p>Well, a considerable number of injured and sick people had been healed, it’s a fairly good outcome.</p><br/><p>「Elena-chan, where should we go next?」</p><br/><p>Where should we go next!!?</p><br/><p>「Leaving that aside, we’re going to go to the 60th floor of The Tower of Sunrise on Saturday.」</p><br/><p>「Ah, that’s right!」</p><br/><p>Aya, did you forget?</p><br/><p>「Hilda, too, come here on Saturday.」</p><br/><p>「Yes.」</p><br/><p>「Boss fight, huh~. I’m itching to put my skills to use~.」</p><br/><p>Ao no Exorcist or Fate/Stay night or something else reference.</p><br/>\n</div>"}