{"title": "Chapter 313 – Acquiring Japanese Language", "id": 313, "volume": 4, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-313-%E2%80%93-acquiring-japanese-language", "volume_title": "Volume 4", "body": "<h1>Chapter 313 – Acquiring Japanese Language</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 313 – Acquiring Japanese Language</p><br/><p>While having dinner, I was watching the state of the [Tracking Beacon] searching for the Devil race’s town.</p><br/><p>「Onii-chan, the Devil race’s town wasn’t found in the end, what should we do?」</p><br/><p>「Since I have work on weekdays, I can only survey the area with [Tracking Beacons].」</p><br/><p>「Shall I survey the area?」</p><br/><p>「Aya, could you return here without [Teleportation Magic Stone]? If something happen, what will you do?」</p><br/><p>「Riled up.」</p><br/><p>According to the appraisal result of the [Teleportation Magic Stone], if one possesses the skill, [Space-time Magic], it can decrease the MP consumption.</p><br/><p>I should ask [Toki] if Aya and the others can acquire [Space-time magic].</p><br/><p>After having dinner, I summoned [Toki] in my room.</p><br/><p>「Mu? You don’t seem to be in the middle of a battle, but what’s your business, Human Seiji?」</p><br/><p>「Honestly, I want to have my friends acquire [Space-time Magic], but I want to get your permission.」</p><br/><p>「……」</p><br/><p>I wonder what’s wrong, [Toki] had been lost in thought.</p><br/><p>「It’s probably impossible.」</p><br/><p>「Impossible? What do you mean?」</p><br/><p>「You should’ve probably experienced studying about space and time, right?」</p><br/><p>Hmm, studying about the space and time?</p><br/><p>Come to think of it, I do this type of examination often at work.</p><br/><p>With regards to [Time], I often test the performance until the processing is completed.</p><br/><p>Afterwards, I handle a great deal of data in time with night batch processing1, review the database design to improve the processing speed, review the logic of the processing itself……</p><br/><p>And with regards to [Space], I’ve been in charge of systems related to cartographic information and GPS.</p><br/><p>Afterwards, I studied about things like 3D polygon display, too.</p><br/><p>「Don’t tell me, [Space-time Magic] can’t be acquired if one hasn’t studied this type of things?」</p><br/><p>「That’s right.」</p><br/><p>I see~.</p><br/><p>This seems to be a bit impossible for Aya and the others.</p><br/><p>[Toki] went back apologetically.</p><br/><p>Well, there’s nothing to be done for something impossible.</p><br/><p>Until Aya’s MP exceeds 3, 000, I won’t allow her to act alone over there.</p><br/><p>◊♦◊♦◊♦◊♦◊</p><br/><p>Then, changing the mood, I summoned [Oracle-chan] after [Toki].</p><br/><p>「Woohoo, it’s Seiji’s world~. Can I use the internet again?」</p><br/><p>「After you help me in making a magic stone.」</p><br/><p>「Woohoo.」</p><br/><p>This fellow, she suddenly became easy to handle after knowing the amusement of the net.</p><br/><p>「So, what kind of magic stone are we making today?」</p><br/><p>「I plan to make a [Language Acquisition Magic Stone] today as a test.」</p><br/><p>「Alright.」</p><br/><p>[Language Acquisition] assigns and implements two elements, the [language to acquire] and the [acquisition level].</p><br/><p>If this is made into a magic stone, are both elements fixed? Or is it different?</p><br/><p>The objective this time is to ascertain that area.</p><br/><p>「About [Language Acquisition], is it possible to reacquire a language you’ve already acquired?」</p><br/><p>「It’s possible~.」</p><br/><p>「Alright, well then, let’s try it out with Japanese language acquisition.」</p><br/><p>I have Oracle-chan enter inside the Nullpo Magic Stone and executed the acquisition of Lvl 5 [Japanese language].</p><br/><p>┌─＜Appraisal＞────</p><br/><p>│[Language Acquisition Magic Stone]</p><br/><p>│When loaded with Magic Power,</p><br/><p>│the specified language can be acquired.</p><br/><p>│When one possesses the skill, Information Magic,</p><br/><p>│it can decrease the MP consumption.</p><br/><p>│Rarity: ★★★★★★</p><br/><p>└─────────</p><br/><p>It’s completed.</p><br/><p>If I make Elena and Hilda use this, the level of the two’s Japanese should rise.</p><br/><p>Let’s try it out right away.</p><br/><p>「Elena, Hilda, try out the new magic stone I made.」</p><br/><p>「「Yes.」」</p><br/><p>I first handed the magic stone to Elena.</p><br/><p>It’s because I don’t know how much MP it will consume.</p><br/><p>That’s why Elena, who has a lot of MP, is the first one to try it.</p><br/><p>「Ah, Oracle-chan has come. Welcome.」</p><br/><p>Aya heard our conversation and came out of her room.</p><br/><p>「Alright, well then, try using the magic stone very carefully.」</p><br/><p>「Yes!」</p><br/><p>Elena focused her mind and poured Magic Power into the magic stone.</p><br/><p>The magic stone worked without a problem and Elena acquired the level 5 Japanese language.</p><br/><p>When I tried to appraise her, the MP consumption was 2, 000.</p><br/><p>The MP consumption has become twice of the amount when I used it.</p><br/><p>Is this because the level of Elena’s Information Magic is low?</p><br/><p>「How is it, Elena? Aren’t there any changes?」</p><br/><p>「Uh, Seiji-sama, what kind of magic stone is this in particular?」</p><br/><p>「That reminds me, I forgot to tell you what kind of magic stone it is! This is a [Language Acquisition Magic Stone]. Aptly named, the level of your Japanese should’ve become 5.」</p><br/><p>「Eh?」</p><br/><p>Elena opened the books about science and the like that she has always been studying and started reading them.</p><br/><p>「Seiji-sama, I can also read the complicated kanji characters smoothly!」</p><br/><p>「I see! It’s a success. Well then, what about writing the characters?」</p><br/><p>「I’ll give it a try.」</p><br/><p>Elena took out a notebook and started writing.</p><br/><p>「Let me see…… about that, I can write the characters very skillfully!」</p><br/><p>「Yes, somehow, it reached the point where you can tell what character is which!」</p><br/><p>There was also an ability to write characters skillfully in Language Acquisition, huh!</p><br/><p>I didn’t know that.</p><br/><p>Hm? Wait.</p><br/><p>I also wrote characters on the notebook as a test.</p><br/><p>「Ah, onii-chan, was your handwriting this good before?」</p><br/><p>「No, it became good just now.」</p><br/><p>「What do you mean?」</p><br/><p>Somehow or other, it seems that the previous level of my Japanese didn’t reach level 5.</p><br/><p>Even though I’m a Japanese…… oh well, it can’t be help since it’s a complicated language!</p><br/><p>When I explained it to Aya,</p><br/><p>「Me, too!!」</p><br/><p>and then, she selfishly snatched the magic stone from Elena and poured magic power into it.</p><br/><p>「Ugh, my head……」</p><br/><p>「It’s the overuse of magic power.」</p><br/><p>When I tried appraising her, Aya’s MP had been decreased by around 1, 700.</p><br/><p>Since the level of Aya’s Information Magic was level 2, it seemed that the MP consumption adjusted according to the skill’s level, becoming lesser than when Elena used it.</p><br/><p>Afterwards, I had Hilda use it, too and the four of us succeeded in raising the level of our Japanese to level 5.</p><br/><p>「Hey, onii-chan. Make a Language Acquisition Magic Stone for English, too.」</p><br/><p>「Go study!」</p><br/><p>「T-, That~.」</p><br/><p>1. The processing of previously collected jobs in a single batch.</p><br/>\n</div>"}