{"title": "Chapter 312 – Teleportation Magic Stone", "id": 312, "volume": 4, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-312-%E2%80%93-teleportation-magic-stone", "volume_title": "Volume 4", "body": "<h1>Chapter 312 – Teleportation Magic Stone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 312 – Teleportation Magic Stone</p><br/><p>On Sunday, the next day, the four of us split up and searched the forest from where we left off yesterday.</p><br/><p>However, this forest was quite vast and we weren’t able to find it so far.</p><br/><p>We are probably searching in the wrong direction.</p><br/><p>A short time later, I saw Aya waving a handkerchief in the [Tracking Beacon]’s video.</p><br/><p>I promptly rush to where Aya is with [Teleportation].</p><br/><p>「Aya, what happened?」</p><br/><p>「Onii-chan, look.」</p><br/><p>Around Aya, there were nearly ten dead orcs.</p><br/><p>Somehow, it feels like it’s been a while since I last saw an orc.</p><br/><p>「These guys, did you kill them, Aya?」</p><br/><p>「No, that’s not it. They were already dead when I got here.」</p><br/><p>It’s not clear, but it seems there’s something that killed the ten orcs, huh.</p><br/><p>「Since it seems somewhat dangerous, let’s regroup. Let’s go meet Elena and Hilda.」</p><br/><p>「Un.」</p><br/><p>I took Aya’s hand and meet the two.</p><br/><p>◊♦◊♦◊♦◊♦◊</p><br/><p>「Seiji-sama, are we going to move together now?」</p><br/><p>「Yeah, it’s for safety. The monsters are becoming strong as we advance towards the north.」</p><br/><p>「Alright.」</p><br/><p>「Well then, everyone, depart!」</p><br/><p>That is to say, in order to move together, the need to adjust to the slowest person arises.</p><br/><p>Among the four of us, the slowest is Hilda, but……</p><br/><p>Hilda’s speed is faster than I thought.</p><br/><p>Why’s that?</p><br/><p>When I appraised Hilda, the level of her [Body Reinforcement] magic rose from 2 to 3.</p><br/><p>Perhaps, the level of [Body Reinforcement] rose thanks to her running about in the forest the last few days.</p><br/><p>And Hilda, in order to catch up to us, doesn’t neglect to make an effort and makes full use of all her magics.</p><br/><p>We pushed the search in forest forward at a moderate speed.</p><br/><p>◊♦◊♦◊♦◊♦◊</p><br/><p>While pushing the search forward for a while,</p><br/><p>「Everyone, stop!」</p><br/><p>「What’s wrong, onii-chan? Is there something up ahead?」</p><br/><p>「Yeah.」</p><br/><p>When we stealthily approached towards where the reaction is, there were two monsters of different type fighting.</p><br/><p>It was a [normal orc] and a [black orc].</p><br/><p>Somehow or other, it seems to be a situation where the black orc attacked the base of the normal orc.</p><br/><p>「Onii-chan, what should we do? Should we attack them?」</p><br/><p>「The search will fall behind schedule, but……they may also attack a person somewhere if left alone. Let’s attack them.」</p><br/><p>The white and black orcs, receiving a surprise attack from the side while fighting, were quickly annihilated as easy as twisting a baby’s hand.</p><br/><p>「Eh? Were the orcs so weak like this?」</p><br/><p>「We became strong since our level rose considerably with the capture of the Tower of Sunrise~.」</p><br/><p>While putting the defeated orcs into the inventory, we headed towards the north once more.</p><br/><p>「Hmmm, there are only black orcs in this area.」</p><br/><p>We encountered black orcs many times as we advance towards the north.</p><br/><p>By sun set, nearly 100 black orcs were defeated, but our objective, the Devil race’s town, wasn’t found.</p><br/><p>The black orcs wandering around this area look calm, the Devil race’s town is probably somewhere else.</p><br/><p>[Tracking Beacons] were sent out to search in the forest radially in order to expand the search area and we decided to go home.</p><br/><p>「Onii-chan, can I try to use the [Teleporation Magic Stone] to go home?」</p><br/><p>「Okay, try it.」</p><br/><p>Unexpectedly, it’s going to be my first time seeing other people use [Teleportation].</p><br/><p>「Onii-chan, I’m going!」</p><br/><p>Aya grasped the [Teleportation Magic Stone] tightly and poured Magic Power into it.</p><br/><p>……</p><br/><p>「Eh? I didn’t get transferred?」</p><br/><p>「Why?」</p><br/><p>「Onii-chan, this is a defective product!」</p><br/><p>What’s wrong?</p><br/><p>Why didn’t she get transferred?</p><br/><p>「Elena, can you try and test it?」</p><br/><p>「Yes!」</p><br/><p>When Elena grasped the [Teleportation Magic Stone] tightly and poured Magic Power into it……</p><br/><p>Whoosh!</p><br/><p>Along with the sound of the wind, Elena disappeared.</p><br/><p>When I checked the [Tracking Beacon]’s video, Elena had returned home properly.</p><br/><p>「It seemed Elena could use it properly. Next, you try it, Hilda.」</p><br/><p>「Yes.」</p><br/><p>Whoosh!</p><br/><p>Hilda could use it, too.</p><br/><p>However-!</p><br/><p>When I checked the [Tracking Beacon]’s video, Hilda was sitting down on the spot where she had been teleported to at home.</p><br/><p>「Hilda’s situation is strange. Aya, let’s go home immediately.」</p><br/><p>「Un.」</p><br/><p>When I took Aya and returned home, Elena was nursing Hilda, who had sat down.</p><br/><p>「Hilda, what’s wrong!?」</p><br/><p>「I-, It seems I’ve used a lot of magic power.」</p><br/><p>What!?</p><br/><p>When I used [Appraisal] on Hilda――</p><br/><p>Hilda’s MP had been almost depleted.</p><br/><p>「Hilda, eat a candy quickly.」</p><br/><p>「Y-, Yes.」</p><br/><p>Hilda ate a candy and recovered her MP; her physical condition somehow returned to normal.</p><br/><p>「Hey, onii-chan, why did this happen?」</p><br/><p>「It seems the [Teleportation Magic Stone] uses a considerable amount of MP.」</p><br/><p>「Considerable amount, you say, how much?」</p><br/><p>「I think it’s around 3, 000. Since Hilda’s MP is a little bit over 3, 000, she can barely use it once and since Elena has 7, 000 MP, she can use it twice.」</p><br/><p>「Then, how about me, how much is my MP again?」</p><br/><p>「Aya’s MP is around 2, 500.」</p><br/><p>「I can’t use it!?」</p><br/><p>After that, as a result of doing various things and experiments――</p><br/><p>We found out that the transfer across worlds consumes 3, 000 MP while in the case of the transfer within a world, 1, 000 MP is consumed.</p><br/><p>In addition, we also found out that the transfer across worlds can only be used once a day just like mine previously.</p><br/><p>「Annoying! How can I be the only one who can’t use it!」</p><br/><p>Aya was stamping her feet in frustration.</p><br/><p>「You’ll be able to use it if you’re in Earth. Besides, isn’t 2, 500 MP also a lot more than an ordinary person’s?」</p><br/><p>「I also want to go back and forth between Earth and the other world! Onii-chan, how can I increase my MP?」</p><br/><p>「It will increase when the level of your magic increases.」</p><br/><p>「How can I increase the level of my magic?」</p><br/><p>「By studying.」</p><br/><p>「T-, That~.」</p><br/>\n</div>"}