{"title": "Chapter 326", "id": 326, "volume": 4, "url": "http://boxnovel.org/jikuu-mahou-de-isekai-to-chikyuu-wo-ittarikitari-chapter-326", "volume_title": "Volume 4", "body": "<h1>Chapter 326</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>TL: Suidish</p><hr/>We succeeded in forming contracts with the darkness spirit, wind spirit, and the water spirit.<br/><p>Following that, I was trying to form contracts with the ice and fire spirits. </p><br/><p>「【Summon Ice Spirit】!」 </p><br/><p>The summoned ice spirit was a voluptuous woman, who was surrounded by a bewitching atmosphere.</p><br/><p>Well, it’s a spirit so, the body size is smaller. </p><br/><p>「You, were you the one that summoned me?」</p><br/><p>「Yeah, I’m the one who summoned you」 </p><br/><p>Somehow, such an adult atmosphere is poor match for her~. </p><br/><p>「Is your goal to make a contract with me?」</p><br/><p>「A, Yes……」 </p><br/><p>「If it’s okay, then……,</p><br/><p>allow me to submit」 </p><br/><p>As soon as the ice spirit finsished saying that!</p><br/><p>I was immersed in ice and it hurts. </p><br/><p>「Cold……, I can’t move……」 </p><br/><p>I am able to breathe because there is a gap between my body and the ice……,</p><br/><p>I am shut in a thick layer of ice, that is approximately 3m, though unable to move.</p><br/><p>And it’s cold! </p><br/><p>First of all, I begin to restore my physical strength that was lost due to the cold, using 【Physical Reinforcement Magic】,</p><br/><p>I thought of methods to escape while curing the skin that has become frostbitten with 【Recovery Magic】.</p><br/><p>Just like the fight against the earth spirit, it seems that the use of【Teleportation】 is sealed.</p><br/><p>I have to melt the ice to escape. </p><br/><p>For the time being, I should try various other methods. </p><br/><p>First of all, when trying to use the unique 【Heating Wire Magic】, it seems that the distance between the ice and me is too small, so I’d probably get burnt.</p><br/><p>Is 【Fire Magic】 no good? </p><br/><p>「How about it? If you surrender, I’ll let you out?」 </p><br/><p>I will not surrender~. </p><br/><p>How about the laser beam?</p><br/><p>Is it possible for light to pass through the ice?</p><br/><p>Well, should I try it? </p><br/><p>The light converges, it possesses directionality, it is directed towards the ice. (T/N: をさせ、をたせて、にけする。, couldn’t do this one very well) </p><br/><p>I thought about shooting the beam from my eyes, but reconsidered when I thought that it would be bad for my eyes, I decided on shooting it from my finger tips. </p><br/><p>It’s no good.</p><br/><p>As expected, the laser beam pierces through the ice. </p><br/><p>「Foolish…… The light will not melt my ice」 </p><br/><p>The ice spirit watches with cold eyes.</p><br/><p>Look, look! I will make you speechless! </p><br/><p>It tries to change the wavelength of the light.</p><br/><p>I bring the light closer to the infrared wavelength that seems warmer. </p><div><div></div></div><br/><p>When the wave length reaches a certain area!</p><br/><p>The laser stop penetrating through the ice,</p><br/><p>and the ice finally started to melt. </p><br/><p>「What is that light! Why is the ice melting?」 </p><br/><p>The ice spirit was frightened by my thick laser. (T/N: は、のぶっといレーザーをてビビっていた。)</p><br/><p>I did it! </p><br/><p>Making use of the laser, I kept gradually melting the ice from my fingertips.</p><br/><p>To begin with, I made a thick hole in the ice, pushing out the water and taking in fresh air.</p><br/><p>With this, I will not get drowned, nor will I run out of oxygen. </p><br/><p>Gradually, I continued to melt the ice, increasing the size of the hole.</p><br/><p>And finally I was able to free myself from the ice. </p><br/><p>「Yatta! I broke out」 </p><br/><p>「Gununu.</p><br/><p>My ice…… with light…… you melted it…….</p><br/><p>Ho, How vexing, it is my defeat.</p><br/><p>As I promised, do whatever you like with me」 </p><br/><p>This person seems like they’re forcibly trying to do something perverted. (T/N: これじゃまるで、やりイケないことをしようとしているヘンタイみたいじゃないか。, couldn’t do this line too well)</p><br/><p>It’s just a simple spirit contract, is it not? </p><br/><p>I made the contract with the ice spirit, while feeling disappointed. </p><br/><p>「You have a contract with me, but don’t think you have my heart!」 </p><br/><p>I think not!</p><br/><p>This fellow is troublesome……. </p><br/><p>Then, Elena also made a contract with the ice spirit.</p><br/><p>It is a contract without a battle, again.</p><br/><p>Preferential treatment?… If you think about it, the amount of magical power consumption is intense, it seems that a battle before a contract can only be done once a day.</p><br/><p>Umu, will someone fight before me? </p><br/><p>———- </p><br/><p>It is the next, and final, spirit. </p><br/><p>「【Summon Fire Spirit】!」 </p><br/><p>Completely different from the last one, a cool girl came out, with a hot feeling. </p><br/><p>「Is it you who has called me!!!」</p><br/><p>「A, Yes」 </p><br/><p>「Your voice is small!!!!」</p><br/><p>「Ye,Yes!」</p><br/><p>「Oo!」 </p><br/><p>This person seems troublesome……. </p><br/><p>「You, you wish to fight me? Do you not?</p><br/><p>Yoshi!! Let’s fight now! Immediately, it is!!!」 </p><br/><p>The fire spirit suddenly, started to attack! </p><br/><p>……tte!</p><br/><p>Although it’s a fire spirit, why does it start with a fist fight? </p><br/><p>When I quickly avoided its attack, the fire spirit was angered. </p><br/><p>「How did you avoid it!!!」</p><br/><p>「Eh?」 </p><br/><p>What, is this fellow dense?</p><br/><p>If I don’t want to fight, I would have to avoid attacks. </p><br/><p>「More, from the front, attack me!!!」(T/N: This doesn’t feel right to me, 「もっとから、ぶつかってこいよ！！！」) </p><div><div></div></div><br/><p>It is quite bothersome……. </p><br/><p>As there was no way around it, I charged in straight from the front, and used a normal punch. </p><br/><p>「Ugyaaa!!!」 </p><br/><p>The fire spirit is easily blown away, and in the distance I can see it fall down.</p><br/><p>Crap… Crap…, was that too much? </p><br/><p>「You, not bad!!」 </p><br/><p>The fire spirit stood up and wiped its mouth with its hands.</p><br/><p>A, it looks okay. </p><br/><p>「Can I ask one question?」</p><br/><p>「What is it?」 </p><br/><p>「You, Fire spirit,</p><br/><p>Why did you not use fire magic?</p><br/><p>「Aaa!」 </p><br/><p>How did you forget! </p><br/><p>「Well then, please re-participate, (T/N: 「では、りなおして、)</p><br/><p>Showdown of flames, begin!!!」 </p><br/><p>As soon as the fire spirit said so, it started attacking with flames. </p><br/><p>As there is no way to help it,</p><br/><p>I opposed it using water magic. </p><br/><p>「Water is no useーーー!!!」 </p><br/><p>Juuu! </p><br/><p>The fire spirit which had water poured on it fell down and became unresponsive. </p><br/><p>「Ar, Are you okay?」 </p><br/><p>Because it was the spirit of fire, I thought that it would be weak towards fire.</p><br/><p>What is it……. </p><br/><p>「Yoyoyo……」 </p><br/><p>A,re? The fire spirit is…….</p><br/><p>As the fire went out, it became modest-looking suddenly? </p><br/><p>「Are you okay?」 </p><br/><p>「To splash me without warning, how cruel.</p><br/><p>I have become soaked……」 </p><br/><p>Oi! To express it in such a way! </p><br/><p>「Because you did this, I guess I have no choice.</p><br/><p>I will make a contract……」 </p><br/><p>Does the fire spirit feel discouraged, now that water has been sprinkled on it? </p><br/><p>The fire spirit looks at me with sorrowful eyes,</p><br/><p>At last the contract was made. </p><br/><p>「Nii-chan……</p><br/><p>That is the work of a brutish fiend!」 </p><br/><p>Aya, where did you learn such words?</p><br/><p>Well, you saw the exchange so far, did you not? </p><br/><p>「Seiji-sama, You’re amazing!</p><br/><p>Work of a fiend? it is!」 </p><br/><p>Elena……</p><br/><p>Do you really think that 『Brutish Fiend』 is a compliment?</p><br/><p>Do not blindly imitate Aya! </p><br/><p>「Saa, The last turn is Hilda’s turn,</p><br/><p>Do your best」</p><br/><p>「Yes!」 </p><br/><p>Hilda triumphantly used 【Summon Fire Spirit】, but…… </p><br/><p>the fire spirit, remains discouraged,</p><br/><p>It was difficult to watch while Hilda comfort them. </p><br/><p>The two became friends,</p><br/><p>Without fighting, it made a spirit contract. </p><br/><p>Ultimately, I was the only one who fought! </p><br/><p>———- </p><br/><p>「Well, let’s return to to Japan,</p><br/><p>Will you go to see the state of Yurie-san?」</p><br/><p>「「Y-es」」 </p><br/><p>We have successfully completed the 『Spirit Contract Festival』,</p><br/><p>And returned to Japan. </p><div><div></div></div><br/>\n</div>"}