{"title": "Chapter 5", "id": 5, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-5", "volume_title": "Volume 1", "body": "<h1>Chapter 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div><p class=\"p1\"><span class=\"s1\">The other young misses all knew each other, so when two unfamiliar faces showed up in their midst, it was unavoidable for some curious faces to continuously turn their way. </span></p><p class=\"p1\"><span class=\"s1\">Xie Zhen and Xie Xun were used to such looks since young. As they were magnanimous and big-hearted, they did not take offence and instead played amongst themselves, completely unaffected by the actions of the other misses. Most of the young misses felt that the two were too beautiful and didn’t dare to approach them. Only Ye Zhiying, having received her mother’s instructions, went forward and bashfully greeted them.</span></p><p class=\"p1\"><span class=\"s1\">Contrary to her expectations, Xie Zhen was very easy-going. “I’m called Ah Zhen, this is my younger sister Ah Xun, how about you?”</span></p><p class=\"p1\"><span class=\"s1\">Moved beyond words, Ye Zhiying immediately replied with her name.</span></p><p class=\"p4\"><span class=\"s2\">After introducing themselves, the three young misses started to play together. Upon witnessing this scene, others couldn’t help but be envious, and one by one they gradually approached and introduced themselves. </span><span class=\"s2\">After all, everyone was attracted to beautiful things, what more four and five-year old children.</span></p><p class=\"p4\"><span class=\"s2\">Before long, Xie Zhen and Xie Xun were surrounded by a crowd of people. Even the two younger sisters who had been with Gao Tongtong before joined in. Gao Tongtong, anxiously stomping her foot, looked angrily at Xie Zhen who was situated at the centre of the throng of people.</span></p><p class=\"p1\"><span class=\"s1\">However, at that moment, Xie Zhen turned and looked at her, with a smile in her eyes, innocent and unaffected, as though she had no idea what Gao Tongtong was angry about.</span></p><p class=\"p1\"><span class=\"s1\">Gao Tongtong turned back and returned back to Madame Gao, deciding that she wouldn’t play with these rascals<span class=\"Apple-converted-space\"></span>in the future.</span></p><p class=\"p1\"><span class=\"s1\">Soon, it was time to start the banquet and Xie Zhen and Xie Xun both returned back to Leng <em>shi</em>‘s side. Xie Xun, ecstatic, and waving her hands about, exclaimed, “Ah niang ah niang, I got to know so many people”.</span></p><p class=\"p1\"><span class=\"s1\">Leng <em>shi,</em> rubbing her head, smilingly asked, “Who did you meet?”</span></p><p class=\"p1\"><span class=\"s1\">Xie Xun looked down and poked her fingers together, ” Erm…erm.” After struggling for a while, her dumpling face turned red, and she said, “I forgot…”</span></p><p class=\"p1\"><span class=\"s1\">Beside her, Xie Zhen snorted in laughter–her younger sister was just too cute. She couldn’t help but wish to knead her dumpling face, ” What do you even remember? You only know how to eat.”</span></p><p class=\"p1\"><span class=\"s1\">Dissatisfied, Xie Xun then retorted, “Can big sis even recall everyone?</span></p><p class=\"p1\"><span class=\"s1\">Of course she could. Xie Zhen’s memory had always been excellent. On the spot, she recited</span><span class=\"s1\"> all the names of the various young misses , including their fathers’ office position and standing. Hearing Xie Zhen’s nonchalant tone as she recited, the dissatisfaction in her eyes changed into adoration. Xie Xun stared at her with bright eyes, just short of throwing herself forward and saying, “Big sis is the best!”</span></p><p class=\"p4\"><span class=\"s2\">Leng shi held them each and kissed and patted them lovingly, as though she hadn’t pampered them enough.</span></p><p class=\"p4\"><span class=\"s2\">However, this scene had been witnessed by Gao Tongtong, who stood up and asked, “Since Ah Zhen’s memory is so good, why not I give you a test?”</span></p><p class=\"p4\"><span class=\"s2\">However, Xie Zhen was currently busy cuddling up in Leng shi’s embrace, and had thought that Gao Tongong was speaking to someone else, so she paid no heed to her. </span></p><p class=\"p4\"><span class=\"s2\">Gao Tongtong’s expression darkened, and she asked once more.</span></p><p class=\"p4\"><span class=\"s2\">Xun <em>shi</em> hadn’t made any move to stop her. From her attitude, it was obvious she was proud of her daughter.</span></p><p class=\"p4\"><span class=\"s2\">Gao Tongtong was known in Qing Zhou as a talented young lady. Despite being merely seven to eight years old, she could already read, write and draw. She had even drew praises from her teacher, so there was no doubt that she was definitely a smart child.</span></p><p class=\"p1\"><span class=\"s1\">Xie Zhen finally turned her head to look at her, asking, “What do you want to test me on?”</span></p><p class=\"p1\"><span class=\"s1\">Gao Tongtong proudly raised her head, revealing her delight, “Have you learnt the Analects of Confucius? What is the twelfth sentence of the fifth chapter?”</span></p><br/><p>Actually, only children around her age were taught these Analects. Xie Zhen was only five years old, and she couldn’t have learnt this text, so how would she be able to know? Everyone present could tell that Gao Tongtong had deliberately made things difficult for the Xie elder miss, yet none of them spoke up . Leng <em>shi’s</em> expression changed, and just when she wanted to rescue her little lamb from the difficult situation, unexpectedly, little lamb, in a crisp voice, asked, “Older sister Gao, why do you ask me this, do you think I am that sort of person?”</p><br/><p>Gao Tongtong, taken aback, asked, “What?”</p><p class=\"p1\"><span class=\"s2\">Xie Zhen recited calmly. <span class=\"s1\">“Zi Gong said: Do not do unto others what you do not wish others to do unto you. Confucius replied: Yet this is still beyond you.”</span></span></p><br/><p>In actuality, Xie Zhen hadn’t really studied the Analects of Confucius. It just so happened that there had been once where in Xie Liqing’s study, while looking for picture books, she had accidentally found this book. Xie Liqing was a scholar and had off-handedly told her a few sentences to let her learn, and coincidentally one of the sentences was the one Gao Tongtong had asked her to recite.</p><br/><p>To put it simply, the meaning behind this sentence was, I am not willing to accept other people’s unreasonableness, nor am I willing to be unreasonble to others. In response, Confucius said, you have yet reached that stage.</p><br/><p>Gao Tongtong had only asked casually, not expecting a five-year old to be able to answer and turn the situation around. Upset, and unable to find a way to <span class=\"s1\">diffuse the situation, a flush rose up her neck and face. After a long while, she finally said, “…That is correct”.</span></p></div><div><br/><p>Xun <em>shi</em>, with an stiff smile on her face, praised, “Madame Xie’s young miss is really quick-witted.”</p><br/><p>Leng <em>shi</em> returned her smile.</p><br/><p>*</p><p class=\"p1\"> The banquet arrangements at the outer courtyard had been completed, and so Gao <em>fu’s</em> steward and Official Gao had come to invite the Old Madame to head towards the outer courtyard.</p><br/><p> The group of females stood up and headed for the outer courtyard.</p><br/><p>Xie Zhen and Xie Xun followed behind Leng <em>shi</em>, each troublemaker taking one side, giving each other winks and making hand signs, as though playing hide and seek.</p><br/><p>The atmosphere was great, and only Gao Tongtong who was following behind the Old Madame wasn’t in a good mood.</p><br/><p>Due to the unrelenting rainy weather, the leaks in the roof hadn’t been fixed. The two younger sisters behind her fooled around, taking turns to push each other. However, one couldn’t stop in time and collided with Gao Tongtong.</p><br/><p>Gao Tongtong staggered two steps backward, and coincidentally, she had been standing right below the moon gate, not paying attention to the person walking behind her, and therefore crashed right into him.</p><br/><p>After regaining her balance, she glared angrily at the two girls, saying, “How do both of you even walk?”</p><br/><p>Both of the two misses stood in fear, knowing that they had been in the wrong, and so not daring to reply.</p><br/><p>The Old Madame’s maid came to check, and seeing that Gao Tongtong wasn’t injured, then said to the person at the back, “Many thanks to the young master to rescuing our young miss.”</p><br/><p>Xie Rong had come to pick his mother and younger sisters up. Yet, he had unexpectedly been knocked into. Shaking his head, he replied, “There’s no need to stand on ceremony.”</p><br/><p>His voice sounded nice and pleasant, revealing a touch of sophistication. Gao Tongtong at this moment recalled that there was still someone around, and turned her head to thank him, “Many thanks for…”</p></div><br/><p>Definitions and Explanations:</p><br/><p>The sentence that Xie Zhen recites is from the Analects. The Analects is a collection of the sayings of Confucius, compiled by his disciples. Confucius, also known as  (kong zi), was a famous philosopher in Ancient China who believed in the pursuit of virtue. The Analects are made of 20 chapters.</p><br/><p>Moon gate : It is a circular opening in a garden wall that acts as a pedestrian passageway; a traditional architectural element in chinese gardens.</p><br/><p>Translator’s comments:</p><br/><p>The plot is getting more interesting now, with Xie Rong finally joining the party!!!</p><br/><p>Update on Bern’s Life: I got an Official Darth Vader plush and it is very cute. And expensive. But it’s official star wars merch so whatever. Hoping I can get a Porg soon but the last time I went they were all sold out </p><div>Even without finishing her sentence, she was attracted to the boy in front of her. Despite being only ten years old, Xie Rong was taller than most people his age, and his stature was as lean as bamboo. His facial features were all well-defined, and he was extraordinarily good-looking. When he grew older, he was sure to be the dream guy of many girls.</div><div></div><div class=\"panel-body\" id=\"htmlContent\"><br/><p>Gao Tongtong immediately blushed, and she finished her sentence, saying, ” Many thanks, young master”.</p><br/><p>Just when Xie Rong was about to say that it was alright, Xie Zhen came forward excitedly, looked up and said, “Big brother, why did you come? Did you come to see both Ah Xun and I?”</p><br/><p>Xie Rong bent down and rubbed her head, “Father said you slept on the way here and was worried you would feel cold, so he got me to bring a set of clothes for you”.</p><br/><p>Saying this, he called on his servant, who brought along a cherry-coloured jacket embroidered with hibiscus flowers. It was Xie Zhen’s favourite jacket, and it seemed that Xie Liqing had ordered the servants to return to Xie <em>fu </em>just to retrieve it.</p><br/><p>As Xie Rong helped her to put it on, she giggled and opened her arms to hug him, “Brother I want a hug.”</p><br/><p>Xie Rong laughed and said, “I’ll hug you when we return home.”</p><br/><p>The conversation between the two siblings gave Gao Tongtong a fright, and she widened her eyes in disbelief. He was actually Xie Zhen’s big brother?</p><br/><p>This, this Xie Zhen’s life was really too good…Appearance wise, she was already extremely pretty. But not only was she good-looking, but her brother was also outstanding.</p><br/><p>This made her even angrier, but still her gaze never wavered from Xie Rong.</p><br/><p>Even when returning Grandmother and her mother’s thanks, he still looked incredibly handsome.</p><br/><p>*</p><br/><p>There was a total of seventy tables set up for the banquet, and it just so happened to be the same number as the Old Madame’s age.</p><br/><p>For such a big celebration, if the courtyard wasn’t big enough, then it would really be humiliating. Gao <em>fu</em> was a reputable household in Qing Zhou, so for the Old Madame’s seventieth birthday celebration, they not only invited all of Qing Zhou’s officials and merchants, but also reserved seventeen tables for the commoners who lived nearby. It could be said that celebrating with the people would bless one with longevity.</p><br/><p>Leng <em>shi</em> brought her two daughters along with her to sit at the same table as the Old Madame, and as she’d gotten familiar with some people at the pavilion as she didn’t feel overly awkward sitting at the table. Song <em>shi</em> was also sitting on her left, so the pair could chat amicably.</p><br/><p>Xie Zhen popped out from behind Leng <em>shi, </em>exposing a pair of limpid eyes, “Aunt Song, why didn’t Big Brother Xiao Yu come?”</p><br/><p>Even till then, she was still thinking of Li Yu.</p><br/><p>After two months, Song <em>shi</em> completely adored her, and couldn’t stop herself from patting her head fondly, saying, “Yu <em>er</em> came today. Right now he should be with Gao Xun. Why, did Little Lamb miss him?”</p></div><br/><p>Gao Xun was the Third Young Master of Gao <em>fu</em>, and was the Second Madame Xu <em>shi</em>‘s seven year-old son.</p><div class=\"panel-body\" id=\"htmlContent\"><br/><p>The Li’s often visited Gao <em>fu</em>, and since Gao Xun and Li Yu were of similar ages, their relationship was quite good.</p><br/><p>Even though Xie Zhen was so young, she wasn’t that clueless, and asked, “Why is Big Brother Xiao Yu always hiding from me? Does he hate me?”</p><br/><p>Song <em>shi</em> repeatedly denied this. Who could bear to hate such a beautiful child?</p><br/><p>“Yu <em>er</em> just doesn’t know you that well, why would he hate you?”</p></div><br/><p>Comforted, Xie Zhen’s spirits quickly rose, and in the blink of an eye she forgot all her worries. She helped serve Xie Xun some food, as Xie Xun wasn’t good at using chopsticks, but she loved to eat, and without Xie Zhen taking care of her she wouldn’t be able to eat anything.</p><br/><p>As such, Xie Zhen didn’t manage to eat too much, but Xie Xun, on the other hand, ate till she was full.</p><br/><p>Using a handkerchief to clean Xie Xun’s lips, Leng <em>shi</em> said, ‘Next time you aren’t allowed to bother your sister again, after all she also needs to eat.”</p><br/><p>Xie Xun blinked innocently and obediently agreed.</p><br/><p>The little troublemaker clung onto Xie Zhen’s hand and guiltily tugged her to her side, saying, “Ah Niang, I want to bring Sis somewhere.”</p><br/><p>The banquet hadn’t ended yet, and Leng <em>shi</em> still needed to stay behind to talk with the Old Madame. To put her heart at ease, she had Shuang Yu and Shuang Yan look after them. “Don’t go too far, and remember to come back.”</p><br/><p>Agreeing, she and Xie Zhen ran far away in the blink of an eye.</p><br/><p>Walking along a narrow trail, they stopped in front of a moon gate, and Xie Zhen asked, confused, “Where are you taking me to?”</p><br/><p>Xie Xun raised her head confidently, and proudly declared, “Since Sis hasn’t eaten much, I’m bringing you to find some good food!”</p><br/><p>Just now when they were on the way to the outer courtyard, she’d smelt the aroma of good food, and had also seen maidservants walking out one by one with plates of food, so she’d assumed that that place was the kitchen.</p><br/><p>While being tugged along by her, Xie Zhen said, “Ah Niang will be angry if she finds out.”</p><br/><p>At this Xie Xun stopped, and to prevent her sister from refusing to go, immediately said, “If we don’t say anything, she won’t know!”</p><br/><p>Behind them Shuang Yu and Shuang Yan were silent, wondering if they should pretend that they hadn’t heard anything…</p><br/><p>After walking for a while, they realised Xie Xun had no sense of direction. The two small dumplings walked around in circles, and after fifteen minutes they had zero idea of where they were.</p><br/><p>Xie Xun pouted and cried out, “But the scent was obviously here!”</p><br/><p>Afraid that she would actually cry, Xie Zhen comforted her, “We can still ask other people for directions, furthermore Shuang Yu and Shuang Yan are still here, so we can definitely find it.”</p><br/><p>The main reason why Shuang Yu and Shuang Yan had followed them, after all, was to prevent them from getting lost.</p><br/><p>Just as she said that, she heard someone ask from behind. “Who are you?”</p><br/><p>Xie Zhen turned around, only to see a young man wearing a sea blue <em>jin pao</em>standing next to the fake hill. Originally her expression had been quite serious, but after turning her head, she was stunned.</p><br/><p>The young man immediately forgot his anger, and stared straight at her.</p><br/><p>Xie Zhen’s eyes gleamed, and seeing Li Yu next to the man, happily cried out, “Big Brother Xiao Yu!”</p><br/><p>Li Yu’s expression immediately turned to stone, and he turned his head away.</p><br/><p>Translators Comments:Gonna be watching TLJ again with my sis! I still ship Reylo really hard. Porgs are my favourite characters. Funko released this Porg Plush but it’s sold out! And I am sad. If y’all have watched The Last Jedi do y’all ship Rey and Kylo or no. (My friend is still adamant that Kylo was lying about her parentage and that they’re actually siblings and the whole thing is incest.)</p><br/>\n</div>"}