{"title": "Chapter 12", "id": 12, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-12", "volume_title": "Volume 1", "body": "<h1>Chapter 12</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>C12 – Lantern Festival</p><br/><p>The man was King of Dongping.</p><br/><p>Few days ago, King of Dongping had rushed from the fief to the capital with his concubines to celebrate the Empress Dowager’s birthday. Now, they just passed by the Yidu County of Qingzhou Province, so came to visit Xie Liqing. King of Dongping and Xie Liqing had dealt with each other before, they admired each other. It was a rare friendship between gentlemen.</p><br/><p>Concubine Dongping wasn’t feeling well. Therefore, he hadn’t brought her out with him in this trip, only brought one concubine.</p><br/><p>The Concubine Madame Qin was about the same age as Madame Leng, her face was beautiful, her body was slim like willow, it looked like she could be blew away very easily. She had a baby in her arms who looked like just a few months old.</p><br/><p>Madame Leng and Xie Liqing received the guests while Xie Zhen followed them. Originally, she wanted to join the fun, but she didn’t expect that King of Dongping would actually give her two beautiful lotus lanterns. She took it happily, thanked him sweetly, and told Madame Leng that she would play it with her little sister.</p><br/><p>Madame Leng didn’t object. She touched her head, “Go.”</p><br/><p>As she was leaving, Xie Zhen was in front of the Concubine Madame Qin. She narrowed her eyes innocently, smiling at Qin. However, Madame Qin’s gaze was very complicated. She watched Xie Zhen walking outside the flower door, then withdraw her gaze lonelily.</p><br/><p>Xie Zhen happliy came into the backyard with two lanterns in each hands, then saw that Xie Rong and Xie Xun were sitting under the porch, eating sweet dumplings with porcelain bowls. There was a small table under the porch, with a thick blanket on the ground and stoves around. They sat on each sides, looked very comfortable</p><br/><p>Xie Zhen suddenly became a bit angry. She angrily walked to them, “Brother, why didn’t you call me when you and Ah Xun were eating sweet dumplings? I want it too! ”</p><br/><p>Xie Rong put down the bowl and asked the servant girl to take another bowl of dumpling filling with red beans.</p><br/><p>He had just come here and found that Xie Xun was eating sweet dumplings without the care of adults, he simply sat down to eat together with her. He didn’t expect to be seen by Xie Zhen. The little thing really minded. She puffed out her cheeks and sat between him and Xie Xun, with her tiny lips curving up.</p><br/><p>Xie Xun used a silver spoon to scoop a sweet dumpling, sent to her mouth and said apologetically, “Big sister, eat this.”</p><br/><p>Xie Zhen looked at it for a moment, then opened her mouth and swallowed.</p><br/><p>After a while, the servant girl Shuang Yu brought up her bowl of dumplings and placed it in front of her. She ate some and finally stopped getting angry. She picked up the two lotus flower lanterns behind her and placed it on the table. One of them was given to Xie Xun, another one was left for herself. “This is given to us by King of Dongping. Do you like it?”</p><br/><p>Xie Xun’s eyes were lit up. Although she liked the Lotus lantern very much, she was still more persistent with food. After finishing eating the dumplings, she reached for the lotus lantern. The lotuses had a total of three layers, each one painted in different colors. When the wick inside the lantern was lit, the petals on the outside were colorful and pretty.</p><br/><p>The two sisters loved the lantern very much, played in the yard immediately.</p><br/><p>The two little things ran from one end to the other, the crisp laughter spreading to the Li family next door, making Li Yu, who was eating, hear it clearly.</p><br/><p>Li Yu bit a mouth of sweet dumpling and frowned his eyebrows.</p><br/><p>“What makes them so happy? Couldn’t they just be quiet?”</p><br/><p>The parents of the two families had not allowed them to go out after going to the streets last time, maybe they were a bit scared. Even Xie Zhen was rarely out of the house. Xie Liqing and Madame Leng had come to Li’s mansion to express their gratitude. They even gave many presents to Li Yu, thanking him for bringing Xie Zhen back from the street. Xie Zhen hadn’t come. It’s said that she was scared, had been a bit timid recently.</p><br/><p>Hearing the laughter, Li Yu didn’t feel that she was timid.</p><br/><p>Wasn’t she very vivid and lively?</p><br/><p>The King of Dongping was ready to leave with his concubine, but they met a heavy snowfall.</p><br/><p>The snow was falling down without any warning, becoming heavier. There was a thin layer on the ground in a short time.</p><br/><p>It seemed there would be more heavy snowstorm at night. To be safe, King of Dongping had to stay at Xie’s mansion temporarily, waiting for setting off tomorrow when the weather became better.</p><br/><p>Luckily, there were many rooms in the Xie’s mansion. Xie Liqing quickly ordered the servants to clean up a few empty rooms, burnt up the stove, used the incense to smoke the bedding blankets, and cleaned up, then asked King of Dongping come in. The Concubine Madame Qin lived in the west wing, because she had a child, so Madame Leng assigned a nannie to take care of them.</p><br/><p>The woman was the nannie of Xie Zhen, and had a lot of experience in caring children. Because she followed Madame Leng for a long time, she was highly respected in the House.</p><br/><p>Madame Qin placed the child on the bed and sat in front of the dresser for a while. She didn’t want to rest. Instead, she put on her fox fur cloak and walked out. Senior Servant Chen followed behind her, handed the stove over, “It’s cold outside. Lady, be careful of catching cold.”</p><br/><p>She stood in the doorway for a moment, looking at the endless snow, her eyes were filled with melancholy, and her face was pale.</p><br/><p>Senior Servant Chen felt strange, so she didn’t try to stop her. She accompanied her at the door.</p><br/><p>After a while, she gathered up the fox fur on her shoulders and asked casually, “What is Mrs. Xie doing now?”</p><br/><p>“Madam is in the main room, talking to her second and third daughters.”</p><br/><p>She nodded and asked, “Is Lord Xie not at home on such a cold day?”</p><br/><p>Chen felt strange in her heart, but didn’t show it on face. “Master’s is very busy. He should read in the study now.”</p><br/><p>As the concubine of the King of Dongping, why she was interested in what her Master and Madam was doing? Chen had to be careful, but the after questions were all very normal. They were just some ordinary things, like how Madame Leng usually took care of her children, what she did, and how to deal with Xie Liqing, etc.</p><br/><p>She was a person who just had a child, and it was reasonable to ask these questions.</p><br/><p>Chen answered one by one. Qin stood by the door for a long while, and soon, the cold air invaded her body and she couldn’t help sneezing a few times.</p><br/><p>Chen was prepared to send someone to call a doctor, but Madame Qin said, “My maidservants are not familiar with Qingzhou Province, so it’s better if you could go by yourself in order not to delay .</p><br/><p>Since concubine already ordered, she must follow the order as a servant, Senior Servant Chen agreed, first asked the instructions from Madame Leng and then went to street for a doctor.</p><br/><p>When she returned half an hour later, the Qin’s door was closed tightly. The maidservant guarding the entrance said, “The lady has fallen asleep, so nannie could come again tomorrow morning.”</p><br/><p>Didn’t she need a doctor?</p><br/><p>Senior Servant Chen stood at the door hesitantly. She was a servant, and dared not to break in to disturb her sleeping, but she was afraid that she would be implicated if the concubine was ill. After hesitating for a while, she sighed and went to the main room to tell Leng about this.</p><br/><p>The charcoal fire in the study burned vigorously.</p><br/><p>Xie Liqing was sitting up in front of the warping case to deal with his business affairs. He looked through all the cases in recent days, organized his thoughts, and took notes on paper. Looking up, snow was still falling outside the window. A few snowflakes had drifted into the study, fell on the warping case, and melted immediately.</p><br/><p>He rubbed his neck and called for a cup of tea, drank it and sat for a while before getting up and walking out of the study.</p><br/><p>The servant held up an paper umbrella for him. He walked out of the yard, after only a few steps, saw a graceful figure ahead.</p><br/><p>The slender figure was obscured by the snow, and it looked even more fragile from a distance view.</p><br/><p>He walked up and saw that it was actually the imperial concubine of the King of Dongping.</p><br/><p>Xie Liqing bowed and said, “Greetings, Esteemed Imperial Concubine.”</p><br/><p>Qin let him stand up and smiled, “You’ve been working too hard, I heard from nannie that Lord Xie is still working on such cold day.”</p><br/><p>Xie Liqing smiled frankly. “I appreciate the attention of lady, but I don’t feel that it’s hard for Bonian.”</p><br/><p>The snow gradually became heavier, and encircled the two people like the goose feathers. Many snowflakes fell on Xie Liqing’s navy blue robe, and then Qin tried to raise her hand to brush them off for him. He dodged slightly.</p><br/><p>He was just over thirty, just looked the same as when he was younger. Instead, he was a bit more mature and stable, even more beautiful than when he was a teenager.</p><br/><p>Qin’s expression was a bit awkward. She withdrew her hand and took the food box from the maid, “This is the snack I just picked up from the kitchen. I see a pavilion up ahead. If Lord Xie doesn’t mind, can you join me and have some snack?”</p><br/><p>Xie Liqing frowned and tactfully refused, “I’m afraid that’s not suitable according to the etiquette …”</p><br/><p>All he wanted to do now was go back to his wife Madame Leng, and hugged his two lovely daughters, and the whole family would sit around the fire. It was too cold outside. He didn’t want to stay longer, and could not stand staying with the Lady.</p><br/><p>Just as he was about to leave, Qin came up with tears in her eyes, “Does cousin really have no feelings for me anymore?”</p><br/><p>After a long while without hearing this, Xie Liqing shuddered, and his scalp began to tighten.</p><br/><p>He said, “Lady is now the concubine of the King of Dongping, so you must be careful when you speak.”</p><br/><p>Before he could finish his words, the Madame Qin came up to him. Tears filled her eyes and her slender body trembled like leaves in the wind. “Are you still angry at me? You’re angry that I married the king, so now you’re so cold to me? ”</p><br/><p>Where and why? He hadn’t thought of that at all. Xie Liqing glanced at the servants on both sides. He sincerely treated King of Dongping as a friend. If this matter reached the King’s ears, what could he deal with that?</p><br/><p>At bottom, he could only blame his youth for being ignorant.</p><br/><p>Qin and him were cousins. When he was young and had no parents, he had always been living in the mansion of Duke Dingguo. She had a good relationship with Xie Liqing, often followed after him to call him cousin.</p><br/><p>At that time, Xie Liqing was fifteen or sixteen, the age of first love. He would occasionally meet her privately and say a few words, but he also kept to the etiquette of a gentleman, didn’t overstep the boundaries.</p><br/><p>Just when Xie Liqing was prepared to confess to his mother that he wanted to marry Qin, the King of Dongping was chosing his wife. The Qin had followed the girls to the palace, attracted by the king’s mansion. After returning home, she had tried everything to attract the attention of the King, and finally succeeded.</p><br/><p>At first, Xie Liqing was depressed for a while, but then he passed. Especially after he married Leng, he understood what true love was.</p><br/><p>Now, he didn’t have affection for Madame Qin. When they met again, he wouldn’t be able to arouse any emotions in his heart.</p><br/><p>He walked past her. “The King of Dongping is a good husband, and lady should not do this behind him.”</p><br/><p>Qin hurriedly grabbed his hand, looked pitiful, “You don’t know what he did to me … …”</p><br/><p>Before Xie Liqing could ditched her hand, he raised his eyes and found Leng and Xie Zhen at the end of the path. Leng’s face was calm as she looked in his direction. Xie Zhen was wrapped up in a tight bundle and looked like a snowball from afar. She was wearing a white rolled-up cape and a white swan hat, and her dark eyes were staring curiously over him.</p><br/><p>Xie Liqing’s body was covered in cold sweat, and he hurriedly shook off Qin’s hand.</p><br/>\n</div>"}