{"title": "Chapter 17", "id": 17, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-17", "volume_title": "Volume 1", "body": "<h1>Chapter 17</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>C17 – Assassination</p><br/><p>Outside the house, Shuang Yu cackled twice, but no one answered.</p><br/><p>At first she thought Xie Zhen was talking to Li Yu, so she didn’t go in, but after a while they didn’t come out.</p><br/><p>Only then did she realize that something was wrong, and she entered the room.</p><br/><p>“Second Miss?”</p><br/><p>However, there was no one in the room. She walked around the screen and looked inside, but there was no sign of Xie Zhen and Li Yu!</p><br/><p>Panicking, she searched the room inside and outside, but she couldn’t find Xie Zhen.</p><br/><p>How was this possible, she had seen the second miss enter the room just now? How come she disappeared in the blink of an eye! Only now did she notice that the bed was a little messy and the window was slightly open. It was obvious that someone had just left.</p><br/><p>Shuang Yu hurried out of the room and chased after him. “Second Miss, Young Master Li!”</p><br/><p>The people in the temple were all busy fighting the fire, so no one noticed her situation. She didn’t dare to delay any further and hurriedly ran to the front to notify Xie Liqing and Madam Leng.</p><br/><p>Unfortunately, it was already too late. Xie Zhen and Li Yu had already been taken away.</p><br/><p>Xie Zhen was carried on someone else’s shoulder, a rag stuck in her mouth, and she couldn’t even scream. The man who carried her walked on the rough mountain road, making her stomach hurt. She was clearly extremely afraid, but she didn’t dare to cry out. She was afraid that if she made a sound, the other party would kill her.</p><br/><p>Just now, she had gone to Li Yu’s room to look for him. As soon as she entered the room, before she could see what was going on inside, a hand had covered her from behind.</p><br/><p>The hand was rough and dry with a thick cocoon on it. It was obviously not Li Yu’s hand.</p><br/><p>She was about to struggle when she saw another person pick up Li Yu and glare at her fiercely, “If you dare to shout, I’ll kill you.”</p><br/><p>The fair of eyes were so sharp and fierce that she immediately shut her mouth in fear.</p><br/><p>Li Yu had not expected her to come. He was calmer than she was, but he was still a child after all. He couldn’t help but yell at her: “Why are you standing there? Why don’t you run?”</p><br/><p>Without any hesitation, Xie Zhen broke away from the hand and turned to run.</p><br/><p>She thought that if she ran away, she could find her parents to save big brother Xiao Yu. She didn’t want to die here.</p><br/><p>But before she reached the door, the person carrying Li Yu regretted it. He raised his chin towards his partner and said, “Bring her with you, and we’ll settle it together.”</p><br/><p>The two people carrying them were both dressed in black with their faces covered. Their facial features could not be seen clearly, and one could only tell that they were martial artists that they were not weak. They each carried a child to the halfway point of the mountain. Originally, they wanted to resolve this problem on the spot, but they felt that they were too close to the temple and could easily be seen through.</p><br/><p>They nearly bounced out Xie Zhen’s breakfast and lunch out of her stomach before they stopped and threw her and Li Yu to the ground.</p><br/><p>The back of her head hit the trunk of the tree, and her upper and lower teeth caught her tongue, and the pain made her tear up.</p><br/><p>She sobbed and forced herself not to cry as she subconsciously reached out to grab Li Yu.</p><br/><p>Li Yu was slightly better off than her. At least he wasn’t injured. He quickly got up and stood in front of her. He lifted his delicate eyebrows and looked at the two men in black, “Who are you two? What are you going to do?”</p><br/><p>He hadn’t looked closely just now, but now he caught a glimpse of the sunlight. This brat really did look similar … The one in the Forbidden City …</p><br/><p>Even though he was still young, he could already see the outline between his eyebrows. As for his overbearing attitude, ordinary children would never be able to learn it.</p><br/><p>No wonder someone had tried to get rid of him.</p><br/><p>One of the burly men in black grabbed him by the arm and lifted him up. Did I bring you here to drink tea? ”</p><br/><p>As he said this, he took out his sabre from his waist, the cold blade edge reflecting a dazzling light under the sunlight. The light pierced into Li Yu’s eyes, causing him to subconsciously close his eyes, and then he felt a chill on his face. When he opened his eyes, the blade slid down his cheek all the way to his chest.</p><br/><p>Seeing that the man in black was about to stab into Li Yu’s chest, Xie Zhen hurriedly shouted, “No!”</p><br/><p>After saying that, she got up from the ground and stumbled over to the man in black. Holding onto his leg, she lifted up her delicate and innocent face, which had two pairs of watery eyes like black grapes. With tears in her eyes, she pleaded, “Don’t kill Brother Xiaoyu, I beg you, don’t kill him …”</p><br/><p>The black clothed person had never seen such a cute girl before. Regardless of whether it was the daughter of a famous clan or the princess, there was never a person who was so lovable. He was stunned for a moment before recovering and kicking her aside. “Don’t worry, the next one will be you!”</p><br/><p>Originally, they didn’t intend to kill her, but she had broken their action, so when she went back, she would definitely say something that she shouldn’t say to others. In order to reduce the trouble, it was better to silence her immediately.</p><br/><p>Li Yu’s shoulder was in so much pain from being grabbed that it seemed as if his bones were about to break. He clenched his teeth and said, “You dare …”</p><br/><p>You dare to touch one of her fingers.</p><br/><p>At this time, he was still young and did not know the meaning of the second half of the sentence. He only felt angry. He was angry because he was somehow implicated, because she was injured because of him.</p><br/><p>The man in black sneered. He probably thought that it was laughable to be threatened by a child, and didn’t even bother to explain himself.</p><br/><p>The sword cut through his clothes and stabbed into his chest.</p><br/><p>Li Yu frowned and asked, “Why did you kill us?”</p><br/><p>The man might think he was dying, or he might think he was talking to a child, but he didn’t understand. “Why? There’s no such thing as’ why ‘. If someone wants you to die, you can’t live on!”</p><br/><p>He stabbed the blade deeper as he spoke.</p><br/><p>Li Yu clenched his teeth in pain. The feeling of his flesh being cut was exceptionally clear. In the end, he couldn’t help but let out a sorrowful cry.</p><br/><p>However, when he tried to pierce Li Yu’s chest, he suddenly stopped. The man in black’s eyes were wide open as he looked down at the long blade that suddenly appeared in his chest. Blood was dripping from the tip of the blade. It was coming out from his chest.</p><br/><p>It was another man in black.</p><br/><p>That person didn’t pull out the blade. Instead, he grabbed the handle and spun it around. The pain immediately made the other party roll his eyes, release Li Yu, and fall to the side stiffly.</p><br/><p>The man opened his mask, revealing a cold and handsome face. The man opened his mask, revealing a cold and handsome face. He looked at the not completely dead black clothed person on the ground and gently opened his thin lips. He said, “To even chase and kill a child, she truly has a venomous heart.”</p><br/><p>The man in black stared at his face. He wanted to say something, but was unable to. In the end, he rolled his eyes and died.</p><br/><p>Both Xie Zhen and Li Yu were pampered little ancestors, so they were stunned when they saw such a bloody scene. Xie Zhen, in particular, stared dumbly at the man who made his move and asked, “Why did you kill him? Aren’t you guys on the same side? Did you betray him?”</p><br/><p>The man drew out his sword and handed it to the others who appeared behind him. “We are not in the same group.”</p><br/><p>Waves of guards rushed out of the forest and knelt respectfully behind him. Who was he?</p><br/><p>“So you’re going to let us go?” Xie Zhen asked in a low and frightened voice.</p><br/><p>The person actually nodded. His expression didn’t change. Instead, he spoke with a hint of mercy, “Go as far away as possible from the capital.”</p><br/><p>At a time like this, even if Xie Zhen didn’t understand what he had said she was going to nod and say, “Uh-huh, we’ll go!”</p><br/><p>That person took another deep glance in this direction, his gaze landing on Li Yu’s face. His expression changed unnoticeably, and he quickly regained his calm expression. He then turned around and led the group of people away.</p><br/><p>Li Yu’s chest had a hole pierced through. Although it wasn’t deep, it was still a wound that was constantly bleeding.</p><br/><p>There were only the two of them in the wilderness, and for a moment, Xie Zhen felt as helpless and lonely as ever. Facing the injured Li Yu, she didn’t know how to save him.</p><br/><p>Xie Zhen folded his hands and covered his injured area, “Big brother Xiao Yu, will you die? Don’t die, I’ll take you back to Auntie Song.”</p><br/><p>Li Yu couldn’t help but cough. This movement involved a wound to his chest, causing him to grimace in pain. His earlier calmness was long gone.</p><br/><p>Sweat appeared on his forehead, probably due to his earlier fear.</p><br/><p>Poor Xie Zhen had been terrified. They didn’t know where they were being taken, but they had the feeling that they were going so far that they couldn’t even see the temple. The sun was about to set, and if they didn’t get back to the temple soon, they would be eaten by the wolves and tigers.</p><br/><p>“Brother Xiaoyu, get up. Let’s go back quickly …”</p><br/><p>Li Yu nodded and followed behind her, clutching his chest.</p><br/><p>There were weeds on both sides of the road. Some were even half the height of a human, making walking very difficult. Moreover, the mountain was not yet civilized, and the road was full of gravel. It was very difficult to walk on it.</p><br/><p>Xie Zhen held Li Yu’s hand and walked for a while. She felt that it was harder and harder for her to drag Li Yu, until she couldn’t drag him any longer. She turned around and saw Li Yu lying on the ground, unmoving. The weeds on both sides of the road were almost dripping with his blood.</p><br/><p>“Brother Xiaoyu!”</p><br/><p>“Are you dead?” She screamed, fearing he would die just like the man in black. She shook his arm in panic. “Say something!”</p><br/><p>After a long while, Li Yu let out a slow breath and said leisurely, “How can I talk to you if I’m dead …”</p><br/><p>“You won’t die.” she muttered, as tears trickled down her face.</p><br/><p>Li Yu nodded.</p><br/><p>He didn’t want to die here.</p><br/><p>This time he could not move, and Xie Zhen could not bear to leave him behind. She put his arm around her shoulders and dragged him forward.</p><br/><p>He was taller than she was, so it wasn’t hard to help him up. But as time went on, she got tired.</p><br/><p>No matter how good the children’s feet were, they wouldn’t be able to get out of the mountain tonight. Not long after Xie Zhen helped Li Yu to walk, the sun went down. The forest was quickly enveloped by a layer of darkness. It was pitch black all around, and only a bit of light remained on the horizon.</p><br/><p>Xie Zhen was panicked and kept asking Li Yu, “What should we do? What should we do?”</p><br/><p>At this moment, the wound on Li Yu’s chest had already solidified and was no longer bleeding. Moreover, he was numb from the pain, so he could no longer feel any pain. He was about to say something when he heard a wolf’s howl in the far valley.</p><br/>\n</div>"}