{"title": "Chapter 25 - Growing Up", "id": 25, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-25-growing-up", "volume_title": "Volume 1", "body": "<h1>Chapter 25 - Growing Up</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>C25 – Growing Up</strong></p><br/><p>When Xie Zhen got home, she was frustrated for days.</p><br/><p>Li Yu left without a word. He didn’t even say goodbye.</p><br/><p>Did he really hate her? Then why invited her to fly a kite? After thinking about it for a few days, she still couldn’t figure it out. In the end, she made herself sick and laid on the bed for more than ten days.</p><br/><p>She used to be a little chubby, but now she was skinny.</p><br/><p>When she got better, she had the goose kite put away in the storehouse, and she never took it out again. Once, when she was passing by a corner in the backyard, she had someone bring her a ladder. She laid on the top of it and stared at the courtyard for a long time before silently climbing down again. She snuggled in Leng’s arms for a long time without making a sound.</p><br/><p>“Li Yu is gone, but Gao Xun is still here.” Madam Leng felt her sadness, “Gao Xun has been looking for you these days. Why don’t you see him? ”</p><br/><p>Ever since Gao Xun learned that Li Yu had left without saying a word, he had complained about him to the depths of his bones, scolding him from head to toe.</p><br/><p>“I’m suffering, Mother,” she said gloomily.</p><br/><p>At such a young age, she actually knew what suffering meant. Madam Leng couldn’t help but laugh as she kissed the space between her eyebrows. “What’s the big deal? There will be more people leaving you in the future, how can you care about any of them? Do you know what it means that people come and people go, little lamb? ”</p><br/><p>She raised her wet eyes. “A lot of people?”</p><br/><p>Leng nodded, “There are so many people in everyone’s life, some coming, some leaving. This is normal, we can’t avoid it.”</p><br/><p>“What do you mean, normal?”</p><br/><p>“It’s a very normal thing,” said Madam Leng.</p><br/><p>She thought for a moment. Was it normal for brother Xiao Yu to leave?</p><br/><p>She hugged Madam Leng’s waist, still brooding over one thing: “But brother Xiaoyu said he hates me.”</p><br/><p>Madam Leng brushed her nose, slowly saying, “Didn’t you often say that you hate brother Xiao Yu? Do you really hate him? ’</p><br/><p>She was silent, a little boyishly stubborn. “I didn’t hate him, but I hate him when he left.”</p><br/><p>Madam Leng laughed softly, pretending to be relieved. “Well, that’s enough. You guys are even. You don’t owe each other anything.”</p><br/><p>Xie Zhen looked up, blinking, and suddenly felt that her words made sense.</p><br/><p>Her gloomy mood improved as she grinned and leaned towards Leng, saying tiredly, “Mum, Kiss me …”</p><br/><p>Madam Leng let out a “you” with a helpless expression, but a smile appeared on her face.</p><br/><p>Gao Xun came to the Li Mansion several times, but never saw Xie Zhen.</p><br/><p>On this day, he persevered and did not expect to be invited to Spring Flower Dock. Surprised and flustered, he hurried over, just in time to see Xie Zhen swinging slowly by herself.</p><br/><p>He stepped forward and said cheerfully, “Ah Zhen!”</p><br/><p>She looked up and smiled at him. He didn’t think the flowers around him looked as good as she did.</p><br/><p>The swing brought her forward, then swung slowly back and stopped. He saw that she had lost a lot of weight, and the flesh on her face had reduced. When she smiled, a faint pear vortex appeared on both sides of her, making her look so beautiful.</p><br/><p>Xie Zhen pointed to another swing and said generously, “Ah Xun is not here. You can ride on her swing.”</p><br/><p>Gao Xun sat on it, “I thought you didn’t want to see me again.”</p><br/><p>“Why?” Xie Zhen was puzzled.</p><br/><p>He rubbed his nose and looked across at the Li’s courtyard. “Because I have a good relationship with Ah Yu …you played with me only because you like Ah Yu.”</p><br/><p>Now that Li Yu was gone, there was no connection between them anymore. She definitely didn’t want to see him again.</p><br/><p>So when she promised to see him today, he was overjoyed.</p><br/><p>Unexpectedly, Xie Zhe shook her head and righteously said, “Even without brother Xiao Yu, I will still play with you!”</p><br/><p>Gao Xun’s eyes sparkled. “Really?”</p><br/><p>She said, “Yes!”</p><br/><p>Gao Xun was finally relieved. He chuckled. His little fairy was willing to talk to him, and she was willing to smile at him, not because of Li Yu, which made him feel very satisfied.</p><br/><p>Thinking about Li Yu, he felt a little indignant, “But Ah Yu actually left without saying a word. He really doesn’t have enough sense of brotherhood! If I see him again in the future, I will beat him up for sure.”</p><br/><p>He turned around and asked, “What do you think about punching him, Ah Zhen?”</p><br/><p>Xie Zhen said, “You beat him up, I’ll just watch from the side!”</p><br/><p>Gao Xun waved his fist and began to depict the scene in his mind. His father had recently hired a martial arts master to teach him martial arts every morning. He had been studying diligently. In the future, he would definitely beat Li Yu, that brat, to the point where he laid on the ground, crying out in pain.</p><br/><p>After he imagined it, he was in a better mood. He went around behind her and grabbed the two ropes on the swing. “I’ll gave you a push. Do you want to fly?”</p><br/><p>Without waiting for a reply, he pulled the rope back and gently pushed her forward. Over and over, Xie Zhen flew higher and higher.</p><br/><p>The wind blew past her ears, and every time she rose, she could see the scenaries far away. In the distant blue sky, the wind was gentle and clear. She looked down and said to Gao Xun, “A little higher, a little higher!”</p><br/><p>Hearing this, Gao Xun pushed harder.</p><br/><p>Her clothes fluttered in the wind as her dress drew an arc in front of his eyes.</p><br/><p>Accompanied by her cheerful laughter, this scene was deeply engraved in his heart. He hadn’t forgotten it after many years.</p><br/><p>Li Yu’s departure did make her sad for a while, but after she figured it out, she slowly forgot about it.</p><br/><p>She was too busy growing up to remember so much in her little mind.</p><br/><p>Moreover, Gao Xun would come to the Xie Mansion every few days. He would either bring her knickknacks or good food. He told her jokes, making her laugh out loud.</p><br/><p>In the blink of an eye, seven years had passed, and she had unconsciously grown from a young and immature child to a young girl.</p><br/><p>She even rarely remembered the name Li Yu.</p><br/><p>On the day of her fourteenth birthday, after a meal with her family, Xie Zhen insisted on measuring each other’s height with Xie Rong. She stood in front of Xie Rong and gestured with her hand. Then, she looked at Xie Xun with an expression of anticipation. “Have I grown taller? Have I grown taller?”</p><br/><p>Xie Xun held a cup of apricot tea in her hands and shook her head honestly.</p><br/><p>“Ah!” She looked up at Xie Rong in disappointment. “Why is it that brother is getting taller and taller, but I haven’t grown for the past two years?”</p><br/><p>She had grown up fast when she was young, almost the tallest girl of her age, and she had been proud of herself. She didn’t expect that after she was twelve years old, she would have stopped growing. The girls around him were still growing up, and only she was still the same as when she was twelve.</p><br/><p>She was not short, but it was a little too small to stand beside the tall and slender Xie Rong.</p><br/><p>At the age of nineteen, Xie Rong’s facial features were extremely mature and handsome. He had reached the age of getting married. Many of the officials’ wives wanted to betroth their daughter to him, but the Xie family did not express their views. Therefore, they could only secretly feel anxious.</p><br/><p>Xie Zhen had asked what kind of girl he liked, but he thought for a long time and then said only one word: “Someone congenial to me.”</p><br/><p>She was still the same as when she was a child. She was full of clever ideas. The only thing that had changed was her face which had lost its infant fat. The cocoon had become a butterfly, making people unable to look away from it.</p><br/><p>Her face was exquisite, and every part of her was perfect. Her skin was like ice and snow, and she was like a fairy.</p><br/><p>However, she was not the little fairy that Gao Xun spoke of. Instead, she was more like a little fox. Sometimes, She threw a tantrum at Xie Rong, and He would tell her in all seriousness, “Little lamb, you can’t talk to anyone like this in the future.”</p><br/><p>She was confused. “what?”</p><br/><p>Xie Rong thought for a long time, but he still couldn’t find a suitable adjective.</p><br/><p>Her voice was soft and sweet. If she were to continue acting coquettish with others, any man would get crazy about her.</p><br/><p>Moreover, her face was beautiful, and just this fact alone was enough to attract many men to covet her.</p><br/><p>Madam Leng was becoming more and more cautious with her two daughters. She didn’t allow them to go out often. When they went out, they had to put on a tight veil to prevent anyone from seeing them. Although the others knew that the Xie Family had two peerless daughters, they didn’t know how exactly peerless they were.</p><br/><p>In these two years, it could be said that Xie Zhen didn’t grow up at all. At least in one place on her grew fast.</p><br/><p>In the night, her chest hurt, and when she touched it gently, it trembled miserably… If not for her mother saying that this was a normal reaction, she would have thought that she was sick.</p><br/><p>Madam Leng had sewn several Abdomen wraps up for her in a year. In the end, even she was embarrassed. “Mother, in the future, let me make my underwear…”</p><br/><p>Madam Leng looked up with a smile. “What, you know how to sew?”</p><br/><p>She said she couldn’t, so she snuggled up to Madam Leng. “I was just afraid that Mother would be tired.”</p><br/><p>Madam Leng was worried that the needle would pierce her, so she asked the maidservant to take the workbox further away. She stroked the hair by her temple and said with emotion, “You’ve grown up so much in the blink of an eye. You know how to care for your mother?”</p><br/><p>“Don’t accuse me wrongly, I have always cared for you.”</p><br/><p>Madam Leng shook her head and laughed softly.</p><br/><p>The mother and daughter chatted for a while before a maidservant came in from outside. “Second Miss, Young Master Gao is here. He is asking for see you.”</p><br/><p>The Young Master Gao mentioned by the maidservants was indeed Gao Xun. They had grown up these two years, and they had been dating less frequently than when they were children. Still, Gao Xun came to see her occasionally, sometimes to talk, sometimes to drink tea, like old friends for years.</p><br/><p>Xie Zhen let go of Leng’s hand, stood up and said, “Mother, I will go to the main hall.”</p><br/><p>As she spoke, she was about to leave.</p><br/><p>Madam Leng called out to her, wanting to say something but hesitated. In the end, she didn’t say anything. She waved her hand and said, “Go.”</p><br/><p>As her daughter grew bigger and bigger, what a girl cared about the most was her reputation. It wouldn’t be a good idea for her to continue getting along with Gao Xun like this. Leng wanted to ask her what she thought about Gao Xun. If she really liked him, they would discuss it and settle the marriage matter with the Gao Family.</p><br/><p>Leng knew Gao Xun was of the highest moral character, and that he had fallen in love with Xie Zhen for the past seven or eight years. If the little lamb were to marry him, there was nothing to criticize.</p><br/><p>On the other side of the room, Xie Zhen came to the main hall and began to climb the stairs. At first glance, she saw the tall and muscular figure in the room.</p><br/><p>Perhaps it was because of his martial arts practice, Gao Xun’s body became stronger every day. He was only sixteen, but just by looking at his back, he was already a man.</p><br/><p>He had broad shoulders and solid back, but he did not look rough.</p><br/><p>When he heard the voice, he looked back, and his eyes fell on her face, unabashed with fascination and wonder.</p><br/>\n</div>"}