{"title": "Chapter 21 - Angry", "id": 21, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-21-angry", "volume_title": "Volume 1", "body": "<h1>Chapter 21 - Angry</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Royal’s Cute Little Wife – C21 – Angry</p><br/><p>The scene was familiar to Xie Zhen.</p><br/><p>It was as if she had seen a similar scene not long ago.</p><br/><p>After thinking hard, she finally remembered when King of Dongping and his concubine had come to borrow a place a year ago. Dongping King’s concubine had held her father’s hand, and then his mother saw it. This was how her father had broken free.</p><br/><p>When she thought about it again, Dongping King’s concubine also called her father “cousin”.</p><br/><p>Cousins can just hold hands? She vaguely remembered that her mother had been unhappy, so she was a little upset now. As for why she was unhappy … She couldn’t tell. In short, she subconsciously thought that Li Yu could only hold her hand. How could he hold someone else’s hand?</p><br/><p>After Li Yu got rid of Ouyang Yi, for once, she didn’t continue to pester him. Instead, he focused all of his attention on Xie Zhen and asked again, “Who are you?”</p><br/><p>If it had been before, she would have answered, but today she deliberately dawdled, puffed out her cheeks, and blew out the ink. “My name is Xie Zhen.”</p><br/><p>Her voice was soft and soft, trailing a long tail sound. It was completely different from Ouyang Yi’s round and proper tone. With just four words, it made people feel as if they had just heard a melody.</p><br/><p>Ouyang Yi had clearly noticed this as well. She was a beautiful little girl who was much more beautiful than him. If she stood right in front of her, she would be immediately suppressed.</p><br/><p>It was like the difference between clouds and mud.</p><br/><p>Ouyang Yi recalled the scene when he first entered the room and looked at the painting on the table. “Why are you here?” “Don’t you know that my cousin doesn’t like someone else coming into his study?”</p><br/><p>Her tone was as if she was saying, “Only I can come in.”</p><br/><p>Actually, it wasn’t that serious. When Li Yu was reading in the study, there would usually be no maids entering the room to disturb him. It was only when Ouyang Yi arrived that he would occasionally come to the study room to harass him, which was why Li Yu had set this rule. In aother words, Li Yu just didn’t like Ouyang Yi coming into his study.</p><br/><p>Li Yu subconsciously looked at Xie Zhen. Seeing that she didn’t react, at that moment, he was worried that she would get angry.</p><br/><p>After a while, she said, “I came to play with big brother Xiao Yu, why can’t I come in?” Why don’t you tell me anything about yourself when you’ve asked me so much? “Who are you and what is your name?”</p><br/><p>Li Yu secretly let out a sigh of relief. But on second thought, how could she possibly be angry? He had never seen her angry in all the time they’d known each other, and she smiled every time they met, as if all the good things in the world had happened to her.</p><br/><p>Ouyang Yi grunted and was very dissatisfied with her changing the topic. “My name is Ouyang Yi. I’m Li Yu’s cousin.”</p><br/><p>As she said that, she suddenly remembered something and stopped pestering Xie Zhen. She grabbed Li Yu’s hand and ran out, yelling, “Cousin, come with me!”</p><br/><p>Li Yu frowned. He was still not used to her swift and decisive personality. He held the doorframe and stopped in front of the door, “If you have anything to say, don’t hold my hand. I will walk by myself.” He shook her hand off.</p><br/><p>Ouyang Yi was the only daughter of Madam Li. Since she was born seven or eight years ago, Madam Li had never been able to give birth to a son. In addition, Lady Li’s husband always went out to do business, so he didn’t have the time to discipline his children. Lady Li was also relatively weak, and as time passed, Ouyang Yi developed her current barbaric personality.</p><br/><p>This was the first time that Ouyang Yi had been rebuffed so harshly. In the past, Whatever she did, he had never given her so little face, although he was impatient, at most he would show a nasty face.</p><br/><p>Why? Because there was an extra person in the room?</p><br/><p>Ouyang Yi did not think that way. She was stunned for a moment before she quickly said, “If I didn’t hold you back, how would you know where to find me?”</p><br/><p>Out of the corner of his eye, Li Yu saw the figure in the room. He forced himself not to turn around and said, “This is my house, I know it better than you.”</p><br/><p>With that, he walked out of the study, his delicate face filled with displeasure.</p><br/><p>When Xie Zhen came out of the study, the yard was empty.</p><br/><p>Xie Xun and Xie Rong were nowhere to be found. Li Yu had also left with Ouyang Yi. She was the only one left in the previously bustling courtyard.</p><br/><p>She kicked at the edge of the door and pursed her pink little mouth. “Brother Xiao Yu is a bad guy.”</p><br/><p>Didn’t he want to reading books? Wouldn’t the teacher test him? Why did Ouyang Yi just call him and he ran out? To say that he didn’t have the time to play with her, he must be lying.</p><br/><p>Why would Ouyang Yi make him leave? Was it because they were cousins?</p><br/><p>The more she thought about it, the more unhappy she became. She took out the Plum Blossom painting she had just put away, tore it up, and threw it into the flower bed under the veranda.</p><br/><p>Jin Lv watched her from behind, and felt amused. A child is a child, willful, once she was a little displeased, she would take things out.</p><br/><p>After a few steps, Xie Zhen turned to her. “Do you know where Ah Xun and our brother are?”</p><br/><p>Jin Lv had been standing by the door, so she could see everything clearly. “The Third Miss of Xie family chased after that lopsided dog. Eldest Young Master Xie followed them. He should still be in the courtyard by now. If Second Miss wants to find them, this servant will have someone ask them for you.”</p><br/><p>Xie Zhen didn’t say a word, which was a tacit agreement.</p><br/><p>The two adults from the two families in the front courtyard were still talking. It seemed that they had no intention of leaving.</p><br/><p>For a while she walked aimlessly around the yard. She was not familiar with the Li family compound, and it didn’t take long for her to lose her sense of direction. They were surrounded by rooms and courtyards, as well as numerous moon gates and long corridors. The Li family was very big and wealthy, and the mansion was built in a very grand manner.</p><br/><p>Walking along a cobblestone path, and going further in, there was a small dilapidated courtyard filled with fallen branches and fallen leaves. There was nothing to see. Just as Xie Zhen was about to leave, Ouyang Yi’s voice came from inside. “Cousin, shall we put it back?”</p><br/><p>Huh?</p><br/><p>She could not help stopping.</p><br/><p>After a while, Li Yu’s voice rang out: “You can do it yourself.”</p><br/><p>What are you putting it back? Xie Zhen was very curious, but she was too embarrassed to get closer. If she was found out, wouldn’t that be embarrassing? She stood in a dilemma at the entrance of the courtyard. With a pinkish white and tender bun’s face, she had to put on a serious and grown-up appearance. When Jin Lv saw her, she couldn’t help but laugh.</p><br/><p>Before she finished laughing, she was glared at by Xie Zhen, who immediately covered her mouth and took two steps back tactfully.</p><br/><p>The conversation continued in the courtyard. Ouyang Yi’s voice was loud and clear. “The tree is so high, I can’t go up there! What if I fall?”</p><br/><p>Li Yu didn’t answer.</p><br/><p>She continued, “Why don’t you hold me? I put the bird back in the nest so it wouldn’t freeze to death. ”</p><br/><p>Oh. The bird had fallen.</p><br/><p>Xie Zhen pouted. What’s so strange about that? Birds often fell from the trees in the house, and her brother climbed them and put them back, without her or Ammu having to do it. How could Ouyang Yi be so stupid? She couldn’t even do such a simple task like climbing trees, to think she was still so arrogant just now.</p><br/><p>She didn’t know if Li Yu carried her or not, and she turned around and left first.</p><br/><p>Not long later, Jin Lv found the whereabouts of Xie Xun and Xie Rong.</p><br/><p>Jin Lv told her, “Eldest Young Master of Xie family and the third miss are in the backyard of prune garden. This servant will take you there.”</p><br/><p>Xie Zhen said yes.</p><br/><p>Prune garden was located in the southeast corner of the backyard, where dozens of prune trees were planted. When winter arrived, especially after snowing, the entire courtyard was covered in white snow, making the flower buds on the prune trees more delicate. One red and one white, embellished this bleak winter.</p><br/><p>As she followed Jin Lv, Xie Xun was circling the lapdog under a prune tree.</p><br/><p>The dog was tired from its run, and its speed was slowing down. It soon fell to the ground, paralyzed on the ground, unable to move anymore. Xie Xun and the dog were covered in snow. “Got you!”</p><br/><p>Xie Rong stood under the tree with his arms crossed, looking rather helpless.</p><br/><p>He was twelve years old, and already had the appearance of a young man. His facial features had faded from his youth, and he had become even more handsome. His straight body leaned against the tree, and a few flakes of snow fell from his shoulders. From a distance, he looked like a painting.</p><br/><p>Xie Zhen was in a much better mood. She spread his arms and shouted, “Brother!”</p><br/><p>Xie Rong turned around and saw her. He smiled as he held her in his arms. “How did the little lamb manage to find us here? Where’s Li Yu?”</p><br/><p>“Brother Xiao Yu left with his cousin and left me alone in the study.”</p><br/><p>The girl did mind, though she didn’t say anything along the way.</p><br/><p>Xie Rong rubbed her head. “It doesn’t matter. Brother will take you.”</p><br/><p>She made a crisp sound of agreement.</p><br/><p>Xie Xun finally managed to subdue the lapdog and came up to her with the puppy. He must have been tired from running, for beads of sweat appeared on his nose. “Sister will play with me. Can we give it a name?”</p><br/><p>The dog was tired, too, and listlessly let Xie Hun hold it and give up struggling.</p><br/><p>“Don’t run too far,” Xie Zhen swiped her sweat, and said. “Don’t run too hard. Mother said it was easy to get sick.” Then, she began to seriously think of a name. She tilted her head and asked, “What name? Do you know whose dog it is? What if its owner doesn’t agree? ”</p><br/><p>Xie Xun hadn’t thought about it, so she tightened his grip on the dog. “But…… I like it. I want to take it home with me, okay? ”</p><br/><p>Xie Zhen shook her head, and said, “Mom doesn’t like dogs.”</p><br/><p>Xie Xun was on the verge of tears. She raised her head and continued to look at Xie Rong.</p><br/><p>But Xie Rong was even more ruthless than Xie Zhe. “No, you can’t.”</p><br/><p>Madam Leng is allergic to the fur of these small animals, once close to the body will itch all over the body, if serious can also give a rash. This was the reason why the two sisters had never been able to raise small animals, even though they liked small animals.</p><br/><p>Xie Xun’s mouth fell open. She was about to say something, but then she heard a loud voice from behind her. “Where’s my Qiu Qiu?”</p><br/><p>This voice was only from Ouyang Yi.</p><br/><p>Sure enough, the few of them turned around and saw Ouyang Yi and Li Yu at prune garden’s entrance.</p><br/><p>Ouyang Yi’s eyes narrowed as she noticed the dog in Xie Xun’s arms. “Why are you holding my Qiu Qiu?”</p><br/><p>“This … this is your dog?” Xie Xun timidly dodged to Xie Rong’s side.</p><br/><p>When Ouyang Yi became excited, she could not control her voice. “Of course it’s mine. Could it be yours? Give it back to me!”</p><br/><p>Just a moment ago, she had been searching for the lapdog, but she didn’t manage to find it. However, after hearing the servant girl say that it was running over, she rushed over. She didn’t expect that it would be carried in someone else’s arms.</p><br/><p>As Xie Xun was about to cry, Xie Zhen was about to say something, but the dog suddenly got the strength to scuttle out of Xie’s arms, obediently crouching beside Ouyang Yi and wagging its tail. Not only that, it even called out to Xie Xun. Its bearing were exactly the same as Ouyang Yi’s.</p><br/><p>Xie Xun had just been told that she couldn’t raise a dog, and now Ouyang Yi had given her a beating. Now that her little friend had “betrayed” her, she couldn’t help but burst into tears, crying out loud.</p><br/><p>Ouyang Yi, on the other hand, did not feel the slightest bit guilty and added fuel to the fire. “Who told you to mess with other people’s dogs …”</p><br/><p>Xie Zhen pushed her away, warning her sharply, “Don’t bully Ah Xun!”</p><br/><p>The usually soft little lamb was angry and dignified.</p><br/><p>Ouyang Yi took two steps back and just happened to be standing beside Li Yu.</p><br/><p>In the situation just now, Li Yu didn’t even have the chance to intervene, so he could only stand behind and watch. He didn’t expect that Xie Zhen would misunderstand him and think that he and Ouyang Yi were on the same side.</p><br/><p>The angry look in her eyes made him feel a little uneasy.</p><br/><p>Just as he was about to speak, Xie Zhen said to Xie Rong, “Brother, I want to go home.”</p><br/><p>Xie Rong said yes and led her and Xie Xun out.</p><br/><p>When she passed by them, she didn’t even greet them.</p><br/><p>“Are you angry?” Li Yu asked after a moment of hesitation.</p><br/><p>Xie Zhen stared at him, with her big bright eyes no longer smiling.</p><br/>\n</div>"}