{"title": "Chapter 23 - Agreement", "id": 23, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-23-agreement", "volume_title": "Volume 1", "body": "<h1>Chapter 23 - Agreement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>C23 – Agreement</p><br/><p>When the kite left her hand, Xie Zhen reached out and said, “Hey, my kite…”</p><br/><p>She was afraid that the kite would break, so she tried to struggle free of Li Yu’s grip and climb down the ladder.</p><br/><p>But Li Yu wanted to say a few words to her and refused to let her go. He grabbed her hand tightly. “I’m not done speaking!”</p><br/><p>He didn’t control his grip, and the pain in her wrist stopped him with a groan. Fortunately, the kite was caught by the maidservants below, so it didn’t break. She felt assured and turned to face Li Yu: “What else do you want to say to me?”</p><br/><p>The ladder shook a little from the pull, startling the women below, and they held the ladder a little harder.</p><br/><p>The two kids were lying on the top of the wall, surrounded by servants. They were extremely nervous for them, and the two of them didn’t know what they were suffering for. They were still talking to each other as if there was no one around.</p><br/><p>When Xie Zhen looked down and saw a red mark on her wrist, her mouth curled up.</p><br/><p>In the sunlight, her skin was like bitty cream, white and tender, almost transparent. Only the piece that Li Yu held in his hands turned red. It was incongruous compared to other places, especially her pitiful expression, which made it seem as if he was bullying her.</p><br/><p>Li Yu hadn’t thought that she would be so weak. He had only lightly gripped her hand, how could he have hurt her?</p><br/><p>He pulled her hand over and rubbed it. “Does it hurt?”</p><br/><p>“Leave me alone.” She pulled his hand back and tucked her hand under her sleeve.</p><br/><p>She was still angry with him, not sure if it was because he hurt her or because he had left her in the study the last time. Actually, she wasn’t a narrow-minded girl. Normally, she wouldn’t be angry, but once she got angry, it would be extremely difficult to hiss her off.</p><br/><p>Li Yu hadn’t coaxed or apologized to anyone before. Even after several attempts, he still couldn’t say those three words.</p><br/><p>He wouldn’t let her go. She was a little dizzy from the sun.</p><br/><p>“What are you trying to tell me?” she asked.</p><br/><p>He was not used to her not bothering him anymore.</p><br/><p>Li Yu said, “My family has bought a new courtyard outside the city. The scenery there is good, and it is suitable for flying a kite.”</p><br/><p>No response.</p><br/><p>Didn’t she understand what he meant? Why is she so stupid!</p><br/><p>Li Yu was a little angry. He stared at her fiercely: “Didn’t you want to fly a kite? Your courtyard is so small, how can you fly a kite?”</p><br/><p>Xie Zhen：“……”“…”</p><br/><p>After a while, Li Yu’s face turned even redder when she looked at him. He turned his head, revealing only his red ears. “I can take you there.”</p><br/><p>Was he inviting her?</p><br/><p>“Why is your face so red?” Xie Zhen revealed his embarassment.</p><br/><p>He raised his arm to cover half of his face, revealing only a pair of sword-shaped eyebrows and a pair of glittering eyes. “Are you going?”</p><br/><p>Xie Zhen was curious, and she couldn’t help taking a few more glances.</p><br/><p>She thought for a moment, then asked seriously, “Will you leave me alone?”</p><br/><p>Li Yu lowered his arm and said decisively, “No, I won’t.”</p><br/><p>“What about your cousin?”</p><br/><p>“She won’t go.”</p><br/><p>Li Yu had never told Ouyang Yi about this matter. He kept avoiding her these days, so why would he take her to the courtyard to fly a kite?</p><br/><p>Just when Li Yu was waiting for Xie Zhen to agree, Ouyang Yi’s voice suddenly came from behind him, “Cousin, who are you talking to?”</p><br/><p>He turned around and frowned.</p><br/><p>Ouyang Yi was standing a few steps away. She narrowed her eyes and looked at Xie Zhen, who was standing on the other side of the wall. “Why is it you? What are you talking about with my cousin?”</p><br/><p>Xie Zhen stuck out her tongue at her. “I won’t tell you!”</p><br/><p>As she spoke, she climbed down the ladder and soon she was standing on the ground. Li Yu hadn’t had her answer. He was both anxious and angry at the same time. Why was she so anxious to leave so quickly? Angry that Ouyang Yi had really come at the wrong time, he stuck his head out and looked down at her. “You haven’t told me if you’re going or not!”</p><br/><p>Xie Zhen:“I…”</p><br/><p>Just as she said that, Xie Rong returned from the outside with nothing in his hands. He probably couldn’t find her kite. He called out to her from afar, and she immediately ran over, “Brother, I found my kite!”</p><br/><p>Li Yu was so angry. He secretly scolded her in the heart. He called out to her: “I’ll come to you on the eighth of next month!”</p><br/><p>Xie Zhen didn’t look back, and he didn’t know if she heard him.</p><br/><p>In the days that followed, Xie Zhen could always see Li Yu on the wall.</p><br/><p>And his reasons were strange. Either the thing had fallen in her yard, or the bird he kept had flown over. It was fine that he was lying on the wall by himself, but he always liked to call her up.</p><br/><p>Xie Zhen didn’t really like it at first. “Why do we have to stand in the sun and talk?”</p><br/><p>But Li Yu always had a way of tricking her and then saying something that didn’t make sense. Like what do you like? What do you hate? Why? Why do you hate me?</p><br/><p>Xie Zhen answered, and he didn’t seem satisfied. He didn’t say anything.</p><br/><p>“What are you asking me all this for? I don’t know,” she said.</p><br/><p>Her face was as white and transparent as it had been a few days before. A pair of jet black eyes stared at him gloomily. They were young and naive, making others want to bully them.</p><br/><p>Li Yu really wanted to bite her face again. He was so angry that she forgot what she had said and let him think about it all the way until now.</p><br/><p>He lowered his eyes and asked her, “Do you still hate me?”</p><br/><p>Because of the low voice and the noise Xie Xun made in the yard, it was hard for Xie Zhen to make out what he was saying. “Huh?”</p><br/><p>It was unknown which of his weak points had been stabbed. He suddenly raised his head and aggressively asked, “I wanna know, do you still hate me?”</p><br/><p>It turned out that the words “I hate you” that Xie Zhen said that day had always been engraved in his heart. In this period of time, she wasn’t as friendly towards him as she used to be, and she hadn’t called him brother Xiao Yu. He had always thought that she still hadn’t forgiven him.</p><br/><p>But he hadn’t even apologized to her, how could she forgive him?</p><br/><p>This time, Xie Zhe heard clearly. She had never been questioned so bluntly before. Her pretty face blushed and became a bit uncomfortable. Immediately, a bad idea flashed through her mind. She bit her lip and gave a sly smile. “Bad boy.”</p><br/><p>Her appearance was lovely.</p><br/><p>Li Yu’s face darkened, “Why?”</p><br/><p>“You don’t play with me. You’re always criticizing me, and you bullied Ah Xun with someone else.”</p><br/><p>Li Yu tried to defend himself, “I didn’t bully Xie Xun.” After a pause, he finally found an opportunity to mention the matter of the study. “That day in the study, it was I …”</p><br/><p>He couldn’t say a complete sentence for a moment, so Xie Zhen put her hands to her cheeks and waited with her big, dark eyes open.</p><br/><p>Li Yu watched her eyes, but he was even more speechless.</p><br/><p>“I …”</p><br/><p>“What?”</p><br/><p>He turned his head, and said seriously, “Whatever, don’t hate me!”</p><br/><p>Xie Zhen thought he was going to say something. She had been waiting for a long time, puffed up her cheeks and purposefully said, “I hate you, I just hate you. Hate!”</p><br/><p>Li Yu was truly angered, “No, don’t!”</p><br/><p>She grunted. “None of your business!”</p><br/><p>As she spoke, she ignored him and climbed down the ladder. She successfully landed in nannie Chen’s arms, made a face at him, turned her head, and ran off.</p><br/><p>Li Yu almost crawled over from the wall to catch her, but just as he was about to take action, Ouyang Yi discovered him.</p><br/><p>Ouyang Yi, who was standing below, asked with dissatisfaction, “Cousin, why are you climbing the wall again? I’m going to tell uncle and aunt!”</p><br/><p>Li Yu had no choice but to stop halfway and look unwillingly in the direction where Xie Zhen was running. He thought that if he caught her next time, he would make her take back what she said today.</p><ul><li></li></ul><br/><p>Recently, it had been raining continuously for quite a few times, as if there was no end to it.</p><br/><p>After the rain stopped, it was already the sixth day of the new year. During the last few days, Xie Zhen stayed inside the house and didn’t go out. She didn’t even see Li Yu on the wall in the backyard. Today, it is a good day, the sun is shining brightly, there were no clouds, Xie Zhen is going to the backyard to see Xie Rong fishing. She was wearing a white silk blouse and a flowery skirt with a pair of embroidered shoes with gold piping. As she was walking past a wall, a voice suddenly came from the top of the wall: “I’ll pick you up at 9:00 at your door the day after tomorrow.”</p><br/><p>She looked up and saw Li Yu staring at her.</p><br/><p>She patted her chest, “Brother Xiao Yu, you scared me!”</p><br/><p>Li Yu’s expression eased up slightly as he said with a taut face, “Then it’s settled.” After that, he descended from the top of the wall and disappeared in the blink of an eye.</p><br/><p>Xie Zhen touched her head. She didn’t know when she had made a agreement with him.</p><br/><p>At night, she specially ran over to the Leng’s room to talk about it, but didn’t expect the Leng to reject her. “If it’s just the two of you, you can’t go.”</p><br/><p>After all, she and Li Yu had ran into two accidents when they were together out, so she had no choice but to accept this.</p><br/><p>Xie Zhen coaxed and pestered Madam Leng, but She never allowed it.</p><br/><p>The next day, Madam Song made a special trip. They said that the place was very safe. There were more than ten servants inside and outside, and the yard was clean. Only then did Madam Leng reluctantly agree.</p><br/><p>However, Madam Leng still did not feel at ease. After all, she had learned her lesson, so she arranged seven or eight maids and women for Xie Zhen to accompany her.</p><br/><p>On the eighth day, the sky was clear and it was suitable for travelling.</p><br/><p>Xie Zhen said she hated Li Yu, but she was looking forward to flying a kite with him.</p><br/><p>She had cleaned everything up and waited, but Li Yu never came to pick her up.</p><br/><p>She thought he had some business to do, but instead she waited until it was dark.</p><br/>\n</div>"}