{"title": "Chapter 28 - Birthday Banquet", "id": 28, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-28-birthday-banquet", "volume_title": "Volume 1", "body": "<h1>Chapter 28 - Birthday Banquet</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>The Royal’s Cute Little Wife – C28 – Birthday Banquet</strong></p><br/><p>Madam Xu’s calculations were excellent, but Madam Leng was not someone to be bullied.</p><br/><p>Madam Leng sipped the tea, and said calmly, “this matter is not for me to decide, nor is it for my eldest sister-in-law to decide. My three sons and daughters have just returned from Qingzhou, and the Old Master is overjoyed. If I don’t let them go to the front to celebrate the old lady’s birthday, the Old Master and the Old Lady will definitely be unhappy. Not only that, I’m afraid he would have to say that Rong’er and the others are unfilial.”</p><br/><p>Her words were true. Anyone with a discerning eye could tell that the Old Master cared more about the Second Branch and loved their children even more. It was precisely because of this that the old lady’s opinion of the Second Branch grew. Today, she was able to put on a good face with great difficulty.</p><br/><p>Apparently, Madam Xu had received orders from the old lady and had come without the Old Master’s permission.</p><br/><p>Unfortunately, Madam Leng was still the same as many years ago. She was difficult to control, so she easily blocked her with a single sentence.</p><br/><p>Madam Xu laughed softly. It was precisely because of her personality that she was so straightforward with her. When Madam Leng had just entered the Duke Dingguo’s Mansion, Madam Xu had been very courteous to her. At least, they had maintained peace on the surface. However, she slowly discovered that Madam Leng was not hard or soft, but had a heart of stone. If you were to speak to her in a feigned manner, she would completely ignore you. Since she had provoked Madam Xu, they would no longer be polite.</p><br/><p>Even so, there was nothing she could do about Madam Leng.</p><br/><p>Like her, she had a good daughter, Xie Zhen. Xie Zhen had the same knack for pissing people off. When Xie Ying returned to the house, she lost her temper. The servants in the courtyard were all in a mess, and all of them were trembling with fear.</p><br/><p>Seeing that she was unmoved, Madam Xu took a step back: “The old lady is afraid that you will have to work hard on the way and won’t tire yourself out. She wants you to rest for a few more days. Since my sister-in-law doesn’t want to rest, I can’t force you. The next morning, there will be many distinguished guests coming to visit. Have the children be more cautious so as to not offend our noble guests.” After she finished speaking, she lifted the handkerchief and pointed at the corner of her mouth. “After all, you are used to being treated in Qingzhou. You don’t know the rules of the capital, but you have to learn many things slowly.”</p><br/><p>Leng looked at her, “Today, Father praised Zhen’er and Rong’er for their good manners in public. I’m afraid sister-in-law is overthinking it.”</p><br/><p>She mentioned Old Master from time to time, leaving Madam Xu speechless instead.</p><br/><p>Yet, what she said was the truth. No one could refute her even if they wanted to.</p><br/><p>She knew her children best, and although Xie Zhen and Xie Xun were not usually in tune, one was lazy, the other soft, the key moment was still a good one for her. Xie Zhen in particular, who knew the sense of propriety, knew the advance and retreat, on the big matters, was a very smart child. On the contrary, Leng was glad that they had lived in Qingzhou for almost ten years. They were naturally pure and kind, lively and adorable.</p><br/><p>After Madam Xu had finished speaking, she did not reap any benefits, but got some embarassment. Her faces were full of displeasure. She stood up and walked out of the room. “There’s no need for you to send me off,” she said to Leng.</p><br/><p>She looked back and saw Leng sitting upright in the rosewood chair, with no intention of getting up to send her off.</p><br/><p>She choked and turned around to follow the servant girl.</p><br/><p>Passing through Xie Zhen’s room, she met the dark eyes of the two girls. She wanted to smile kindly, but she couldn’t. The corners of her mouth drooped and she walked out of the courtyard with an unsightly expression.</p><br/><p>Xie Xun stood up and stomped her feet. She looked at Xie Zhen with a puzzled expression. “Sis, why does Auntie look so scary?”</p><br/><p>Xie Zhen was leaning against the smoke-cage, her nose scented with the fragrance of a heavy incense, and she was drowsy. She half closed her eyes and yawned. “She must have said something to our mother. It’s a pity she couldn’t get anything from the argument with our mother, so she got really angry with herself.”</p><br/><p>It had to be said that she had made a thorough analysis.</p><br/><p>Xie Xun nodded thoughtfully. “What did the auntie say to our mother?”</p><br/><p>It was warm in the room, steaming out the laziness in one’s bones, and gradually, with a tilt of her head, she collapsed on Xie Xun’s shoulder. “It’s nothing serious these days, it must have something to do with Grandmother’s birthday…”</p><br/><p>Before she could finish, she was already fast asleep.</p><br/><p>Xie Xun pushed her twice, but she still slept soundly. Xie Xun had to put her on the bed in the inner room with Shuangshu. Under the soft curtain, her breathing was steady and her face was peaceful.</p><br/><p>After returning to Duke Dingguo’s Mansion for two days, Xie Zhen quickly went around the house. She got familiar with every corner, deeply in her heart.</p><br/><p>Since the mansion hadn’t changed much since she was young, it wasn’t difficult for her to remember the details of the changes.</p><br/><p>On this day, she took Xie Xun to walk around the lake. When she came back, she passed a flowerbed with several fake mountains in the middle. Behind the flowerbeds, there were two people walking side by side on a long veranda. It was Third Miss Xie Ying and Fourth Sister Xie Yin.</p><br/><p>Xie Yin was the daughter Madam Wu, sho was of the third branch. She also had a beautiful face and was a beautiful girl. Her character was somewhat similar to that of Xie Zhen, both lively, but she was a little bit snobbish. For example, right now, the Old Lady doted on the third young mistress. Since the eldest branch had a lot of weight in their conversation, she was on good terms with Xie Ying. She was close with Xie Ying, but didn’t think much of the second branch at all.</p><br/><p>They talked on the veranda, where Xie Zhen and Xie Xun rested with a stone in the middle, but Xie Yin and Xie Ying didn’t notice them.</p><br/><p>Xie Ying seemed to be worrying about what to wear for old lady’s birthday banquet. Xie Yin made several suggestions, which she rejected. “Those clothes were from last year.”</p><br/><p>Xie Yin said, “Third Sister, why don’t you just cut up a piece of cloth and get a new one?”</p><br/><p>Xie Ying frowned, feeling that she was too stupid. “Tomorrow is Grandmother’s birthday banquet, so it’s definitely too late for a new one.”</p><br/><p>A while ago, she had someone make some new sets of clothes, but tomorrow, when the crown prince and the Sixth Prince came, she felt that the colors were too plain and did not stand out enough, so she wanted to choose a set of brightly colored clothes. No matter how hard she tried, she couldn’t be satisfied.</p><br/><p>Oh. Xie Zhen and Xie Xun looked at each other in silence. It’s just a piece of clothing, why was she so worried?</p><br/><p>On the other side, Xie Yin interjected enthusiastically, “If Third Sister doesn’t mind, I have some new clothes that I haven’t had time to wear. Why don’t you try it in my room? ”</p><br/><p>Xie Ying glanced at their statures. She was taller than Xie Yin and skinnier than she was.</p><br/><p>Xie Yin noticed this and rolled her eyes. “I think Fifth Sister is similar to you. How about …”</p><br/><p>Before she could finish her words, she rejected it. She shook her head in amusement: “Fifth Sister has lived in Qingzhou for such a long time and has long since lost knowledge of the capital’s most popular colors. Forget it, if we meet the Crown Prince, he will laugh at you.”</p><br/><p>Unmarried girls talked about men, not to mention this man was the future emperor. The fourth mistress was rather daring.</p><br/><p>Fortunately, there weren’t many people around. Xie Ying blushed, as if the crown prince was right in front of her, “Don’t talk nonsense.”</p><br/><p>Xie Yin smiled tacitly in acknowledgment, and the two of them left together.</p><br/><p>Behind the rockery, Xie Zhen and Xie Xun walked out, nonchalantly walking toward Jade Hall.</p><br/><p>Xie Xun couldn’t help but ask, “Elder sister, will the Crown Prince come tomorrow as well?”</p><br/><p>“Didn’t you hear what third Sis and fourth Sis said? Probably he will.”</p><br/><p>She didn’t know about this either. If she hadn’t heard Xie Ying and Xie Yin talking about it, she wouldn’t have known about it. She seemed to be able to guess why the eldest madam came to the Jade Hall. Now that Xie Ying had reached the age of marriage, it would be perfect if she could make use of this opportunity to get a good marriage.</p><br/><p>The old lady of the Duke Dingguo’s Mansion and the current empress dowager used to share a handkerchief with each other. Xie Ying’s grandfather served under the crown prince, and the old granny doted on Xie Ying. If he found an opportunity to speak with the empress dowager, perhaps she could even offer her a position of concubine. By then, she would be a phoenix.</p><br/><p>Of course, all of this was based on the premise that the Crown Prince had set his sights on Xie Ying first.</p><br/><p>On the day of the old lady’s birthday, Xie Zhen suffered a sudden illness.</p><br/><p>It wasn’t a serious illness, but the windows weren’t properly closed at night, so she caught a cold. She woke up in the morning feeling dizzy and her voice was muffled.</p><br/><p>Madam Leng hurriedly got someone to invite a doctor and prescribed two sets of medicine for typhoid fever. She asked the maidservants to fry it and feed it to her, only then did she feel better.</p><br/><p>“Why don’t you just rest in the house,” said Lady Leng. “I’ll leave the front yard to Ah Xun and me.”</p><br/><p>Xie Zhen nodded wanly.</p><br/><p>Madam Leng was worried about her, so she had Shuangyu and Shuangyan take care of her. If anything happened, they would have to report back to the front courtyard.</p><br/><p>This disease, the mother and daughter of the eldest branch were the happiest ones. Of course, Madam Xu didn’t show it on her faces. She even asked the maidservants to show her concern for her. Seeing that Xie Zhen was really sick, she didn’t care about her anymore.</p><br/><p>After taking the medicine, Xie Zhen slept for a while, and when she woke up, it was already bright, so she guessed that it was not even noon yet. She felt much more clear-headed. She wanted to go to the front to congratulate the old lady so that she wouldn’t be apprehended and accused of being unfilial. In the future, she wouldn’t be able to explain anything clearly. At first Shuangyu and Shuangyan disagreed, but could not resist her, so they added two extra layers of heavy clothing and let her go.</p><br/><p>She had combed her hair before she left, without makeup, and she knew best how she looked. This face was flawless. Instead of concealing its original color, it was rather plain and delicate.</p><br/><p>She wore no thick clothes, only a red embroidered peony cloak. She carried a small hand stove in her hand as she walked slowly towards the main courtyard.</p><br/><p>There were many people in the front courtyard. The old lady had only exposed her side before returning to rest. Her gaze was waiting for the arrival of the Crown Prince and the Sixth Prince.</p><br/><p>These two had noble statuses, so they definitely wouldn’t be sitting in the front courtyard like the others. They’d only come to send off gifts prepared by the empress dowager and empress, and then leave.</p><br/><p>They didn’t expect to meet Xie Zhen after waiting for half an hour.</p><br/><p>The old lady did not look too good. “Aren’t you sick? Why haven’t you rested properly?”</p><br/><p>“Grandmother’s birthday,” she said with a smile. “I have to come, no matter how uncomfortable I am.”</p><br/><p>The Duke of Dingguo liked her eloquence, but in the old lady’s case it was a glib tongue.</p><br/><p>The old lady was not pleased and only said a few words before sending her away.</p><br/><p>Xie Zhen didn’t stay longer. She thought she was all right, but she didn’t expect that after a long walk, she got a little exhausted. As she withdrew from the room, she let out a cloud of white mist and walked back.</p><br/><p>Walking out of the main courtyard, she saw two people from afar. Both of they two were tall, and with a single glance, she could tell that they were not ordinary people.</p><br/><p>One of them was probably the Crown Prince Xie Yin had spoken of.</p><br/><p>It’s too far away for him to run into her, and it would be bad for her reputation if she were spotted. She thought for a moment, then turned and walked the other way.</p><br/>\n</div>"}