{"title": "Chapter 31 - Reunion", "id": 31, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-31-reunion", "volume_title": "Volume 1", "body": "<h1>Chapter 31 - Reunion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>The Royal’s Cute Little Wife – C31 – Reunion</strong></p><br/><p>Princess He Yi and the Sixth Prince were the daughter and son of imperial concubine Hui. The Sixth Prince was found seven years ago, when they claimed that the Sixth Prince and Princess He Yi was twin of a boy and a girl when they were born. The Sixth Prince had been harmed by the palace people, so his whereabouts had been unknown for many years.</p><br/><p>Actually, there was a scandal in the palace involved, and outsiders did not know the truth.</p><br/><p>Princess He Yi were not the daughter of imperial concubine Hui. She had been exchanged with the Sixth Prince and had entered the palace, enjoying her glory and wealth.</p><br/><p>Originally, when the Sixth Prince returned, she should have recovered her original identity as well. But the fact that His Majesty doted on her so much that he didn’t want to release her from the palace so that he kept her title of princess.</p><br/><p>Only a few people knew about this matter.</p><br/><p>Yan Yao’an reluctantly said goodbye to Xie Zhen. Before leaving ,she asked, “Where do you live?”</p><br/><p>“How about I ask Sixth Brother to send you on a journey?”</p><br/><p>She really dared to say, how could Xie Zhen dare to let the prince send her? She used her family’s carriage to refuse her.</p><br/><p>The female attendant bowed and tactfully reminded, “Princess, His Highness has been waiting at the door for a while.”</p><br/><p>The Sixth Prince, Yan Yu, was out on business with the Crown Prince. When he came back, he passed by the crown prince’s residence and found out that Princess He Yi was also in the palace.</p><br/><p>Yan Yao’an stood up and dusted off her skirt before walking out.</p><br/><p>There was a carriage parked outside the crown prince’s residence. The carriage was simple but not luxurious. With a single glance, one could tell that the person sitting inside was either a rich person or a noble.</p><br/><p>There were eight guards standing at the corners of the carriage, each of them well-trained, as they closely guarded the Sixth Prince’s safety.</p><br/><p>When they saw Princess He Yi walking over, one by one, they bowed. One of the guards lifted the embroidered dark golden curtain to invite her in.</p><br/><p>Yan Yao’an bent over and entered the carriage. Lifting her eyes to take a look, she smiled and called out, “Sixth Brother.”</p><br/><p>Yan Yu was sitting on one side of the carriage, leaning against the carriage, resting with his eyes closed.</p><br/><p>For the past few days, he had been out with the crown prince. In order to investigate the assassination attempt on the crown prince, he had seldom rested.</p><br/><p>Hearing Yan Yao’an’s voice, he only slightly raised his eyes, but there wasn’t even the slightest emotion in his eyes. He simply asked, “Why are you so slow?”</p><br/><p>Yan Yao’an told the driver to set off, and she lowered the curtain. “We’ve been chatting with the Fifth Miss of the Duke Dingguo’s Mansion for a while.”</p><br/><p>Yan Yu closed his eyes again. He didn’t even ask.</p><br/><p>Yan Yao’an was used to his personality. As the sixth brother of hers, she always had an expression that kept him at bay, as if nothing could affect his mood, let alone attract his attention.</p><br/><p>He didn’t know what he was thinking all day, so couldn’t he say a few more words?</p><br/><p>She pursed her lips and took out the gold filigree sachet that Xie Zhen had given her, and toyed with the tassels under the sachet.</p><br/><p>In an instant, the carriage was filled with a rich fragrance. It was not strong, but it was elegant and delicate. It slowly spread and even made people feel refreshed.</p><br/><p>It was a very special fragrance. At the very least, Yan Yao’an had never smelled it on anyone else’s body before.</p><br/><p>The carriage moved forward slowly, leaving the crown prince’s residence behind. Yan Yu was still sleeping.</p><br/><p>Yan Yao’an suddenly thought of something as she excitedly asked, “Sixth Brother, did you see the Fifth Miss when you went back to Duke Dingguo’s Mansion?”</p><br/><p>“She’s more beautiful than any other girl I’ve ever seen. ”</p><br/><p>Yan Yu ignored her.</p><br/><p>She went on talking to herself: “She has a sister, and a pretty one too.”</p><br/><p>“She’s still young and a little afraid of strangers …”</p><br/><p>Her words reminded Yan Yu of someone else.</p><br/><p>His thoughts flew away, leaving him with only five or six years of his life.</p><br/><p>She was also a very pretty little girl, and she also had a little sister. She always called him ” Brother Xiao Yu” with a smile, pestering him to hold hands with her.</p><br/><p>Her voice was pleasing to the ears, she could sing beautiful children’s songs, and she could even carry him on her back for a very long distance …</p><br/><p>He was always impatient with her, because the first time he met her she touched his crotch.</p><br/><p>What a little bastard.</p><br/><p>He wondered why, after all these years, he still couldn’t forget her.</p><br/><p>Once he closed his eyes, he could clearly remember every single scene.</p><br/><p>He wondered how she looked like?</p><br/><p>She was like a little fox when she was young, but what about now?</p><br/><p>He lived in the palace, walking on thin ice at every step, trying to find out where she was, but afraid to hear from her.</p><br/><p>Perhaps it was because she was too homesick, or perhaps it was because she was afraid of causing trouble for her.</p><br/><p>Unconsciously, seven years had already passed.</p><br/><p>While he was immersed in his memories, Yan Yao’an was still chattering, “Look, this scented sachet was given to me by her!”</p><br/><p>“Sixth brother, do you smell it?”</p><br/><p>Seeing that Yan Yu did not react, she was not discouraged and continued, “I wonder if my body will be as fragrant as hers after wearing it for so long?”</p><br/><p>“She said that her sister Ah Xun had one, too, and that she made the spice by herself.”</p><br/><p>Before he could finish, Yan Yu suddenly opened his eyes. His black pupils were no longer calm, only shock remained, “What did you say?”</p><br/><p>Yan Yao’an had never seen his reaction before. She said dazedly, “I said she made the spice by herself …”</p><br/><p>“Not this.” Yan Yu grabbed her hand which held the sachet, asked again:“What did you say her sister’s name was?”</p><br/><p>Yan Yao’an opened her mouth. ” Ah Xun, Xie Xun.”</p><br/><p>After a long time, only silence remained in the carriage.</p><br/><p>Yan Yu released her hand and said, “Stop the carriage, stop right now!”</p><br/><p>The coachman was ordered to stop the carriage at the side of the road.</p><br/><p>He had originally wanted the carriage driver to turn around and return to the crown prince’s mansion, but he also felt that the carriage was going too slow. Thus, he directly took Yan Yao’an scented sachet from Yan Yao’an’s hands and strode out of the carriage.</p><br/><p>Yan Yao’an could no longer hold herself back. She lifted up the curtain to protest, “That’s mine!”</p><br/><p>When he did not hear, he let one of the guards get down from his horse, took the reins, and mounted.</p><br/><p>He didn’t even bother to say goodbye to Yan Yao’an as he directly called for his car and left in a cloud of dust.</p><br/><p>She had never seen him in such a hurry.</p><br/><p>Yan Yao’an stomped her feet in anger behind him. After regaining her senses, she began to wonder why he was acting so strangely.</p><br/><p>It seemed that from the moment he heard Xie Xun’s name …</p><br/><p>Did he know Xie Xun?</p><br/><p>When did you meet him?</p><br/><p>When Yan Yao’an said her surname was Xie, he didn’t think too much about it.</p><br/><p>Until he heard the name of Xie Xun.</p><br/><p>How many people who were beautiful and had a sister named Xie Xun in the world could there were?</p><br/><p>Perhaps there were many, but at this moment, he didn’t care too much. He only wanted to go back and see her.</p><br/><p>See her and see if she’s the little bastard he knew.</p><br/><p>Xie Zhen, Xie Zhen.</p><br/><p>That hateful and adorable little girl. After so many years, all his previous possessions have been destroyed. Is she still the same as when she was young?</p><br/><p>The wind whistled noisily by his ears, but he seemed to hear her coquettish voice calling him ” Brother Xiao Yu”.</p><br/><p>No news was good. He could suppress all his emotions to the bottom of his heart.</p><br/><p>Once he found out that she was in the capital, so close to him, he couldn’t wait.</p><br/><p>There were many pedestrians on the street, so he rode his horse quickly and forced his way through.</p><br/><p>When he arrived at the crown prince’s mansion, he dismounted from his horse and without waiting for the servants to tie him up, he walked straight to the courtyard, “Where did the Crown Princess set up the flowers feast?”</p><br/><p>The servant was stunned, unable to reply, “This …”</p><br/><p>“Is Your Highness going?”</p><br/><p>There were only girls there, so it didn’t seem appropriate for him to go, did it?</p><br/><p>Every time the Sixth Prince came to the Crown Prince’s residence, didn’t he usually go to the Crown Prince?</p><br/><p>Why did you think of admiring the flowers today?</p><br/><p>“Where?” he repeated impatiently.</p><br/><p>The servant had no choice but to say, “In the Peony Garden, this lowly one will bring you there.”</p><br/><p>He walked in a hurry, and it was not good for the servants to walk too slowly. They almost ran to take him there.</p><br/><p>However, when they arrived at the Peony Garden, they discovered that there was no one inside. The feast for admiring flowers had long since dispersed, and the girls had already returned home.</p><br/><p>The servant revealed a troubled expression, “Your highness …”</p><br/><p>Yan Yu stood still for a moment, holding the sachet in his hand. His knuckles were white, and he was holding it so tightly that even the sachet was deformed.</p><br/><p>Without a word, he turned around and walked out. When he reached the entrance of the crown prince’s mansion, he hopped on his horse and rode in the direction of the Duke Dingguo’s Mansion.</p><br/><p>He had followed Yan Tao to the Duke Dingguo’s Mansion last time, so he knew where he was heading.</p><br/><p>It was calmer than before, but his hands were sweating profusely. He could barely hold the reins.</p><br/><p>His lower jaw was tight and his face expressionless. He could finally see the main gate of the Duke Dingguo’s Mansion.</p><br/><p>There was a horse carriage parked by the door. It should be the two people who had just returned from the crown prince’s mansion. The maidservants lifted the curtains and two people alighted from the carriage.</p><br/><p>Xie Xun step down the yellow wooden stool, she still had a round apple face, with nothing change.</p><br/><p>Behind her, Xie Zhen walked slowly out.</p><br/><p>It was probably because she was tired from sitting on the carriage. She was a little tired, but it seemed Xie Xun had said to her something, and then a smile curved up on her lips, and her whole person immediately became lively.</p><br/><p>Her smile was curved and bright, just like it had been when she was a child.</p><br/>\n</div>"}