{"title": "Chapter 58 - Misunderstanding Cleared Up", "id": 58, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-58-misunderstanding-cleared-up", "volume_title": "Volume 1", "body": "<h1>Chapter 58 - Misunderstanding Cleared Up</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div class=\"title__3i-dQ\">C58</div><blockquote><br/><p><strong>C58: Misunderstanding Cleared Up</strong></p><br/><p>Arriving at the study room, Yan Yu asked Wu Ze to gather all the things Xie Liqing had done while he was in Qing Zhou.</p><br/><p>After Wu Ze left, he sat behind the desk and touched his face from time to time.</p><br/><p>Xie Zhen’s lips were soft and warm, touching his face with timidity and shyness, and he didn’t even have time to look at her expression before she ran away.</p><br/><p>He didn’t know how he had thought at the time, so when he got hot enough to ask, he didn’t know how to face Xie Zhen, so he hid himself in the study and spent the afternoon.</p><br/><p>Wu Ze went to the Crown Prince’s residence and brought back a lot of information. There were two stacks of documents.</p><br/><p>The Crown Prince had recently investigated the matter and wanted to take advantage of this opportunity to get rid of Lin Rui.</p><br/><p>Lin Rui is the eldest prince’s henchman. The eldest prince was born of the former empress, while the former empress died when he was six years old. Emperor Yuan Hui had made him the crown prince, but when he was ten years old, he tried to kill his second brother, Yan Tao, and was found out by Emperor Yuan Hui. Then the emperor exempted him from the crown prince’s position on the grounds of his brutal temperament, and he had changed the position of the crown prince to the second prince, Yan Tao.</p><br/><p>Throughout all these years, the First Prince had been hiding in the dark, accumulating his strength and energy. It was unknown when he would bite back.</p><br/><p>The Crown Prince had been afraid of the First Prince for so long that he had thought of ways to get rid of his men.</p><br/><p>Yan Yu opened a stack of documents that recorded Qing Zhou’s tax lists and military strength for the past ten years. He looked through the pages and realized that Xie Liqing truly had some skill and shouldn’t have been left unoccupied at home.</p><br/><p>He also didn’t know what the Emperor Yuan Hui was planning. He didn’t let him stay in Qing Zhou, nor did he give him any words of confirmation.</p><br/><p>Yan Yu kept reading from day to night, and the last rays of light from the evening sun slipped down from the western mountains. It quickly darkened, but he remained in a posture the entire time.</p><br/><p>At first, it was for Xie Zhen, but gradually, he was attracted by Xie Liqing’s ability and skills. He didn’t seem tired at all. With a jolt of his mind, he realized that it was already late at night.</p><br/><p>He called Wu Ze over, rubbed his forehead and asked, “What time?”</p><br/><p>Wu Ze replied, “Your highness, it’s a quarter past seven.”</p><br/><p>It’s so late.</p><br/><p>He got up, with his whole body stiff. He held down the papers he had prepared and walked out of the room. “Has the Princess eaten yet?”</p><br/><p>Wu Ze had been standing outside the door the whole time, as he did not know.</p><br/><p>When he returned to the main room, there was an oil lamp burning in the inner room. Through the window, he could see the shadows inside.</p><br/><p>Xie Zhen was sitting on the lady couch by the window, probably freshly showered. The servant maids was standing behind her, combing her hair. She tilted her head and sang softly.</p><br/><p>Her voice was as soft as ever, echoing through the window and softly coming into Yan Yu’s ears.</p><br/><p>Yan Yu stopped abruptly. He had only heard her sing a song once before, and just that single song, he would never forget it for the rest of his life.</p><br/><p>When he thought of her song, he would recall the first time they met.</p><br/><p>He listened for a moment, then went in through the front door.</p><br/><p>Xie Zhen caught a glimpse of him out of the corner of her eyes and remembered that she had just kissed him, so she felt a little embarrassed and a little shy.</p><br/><p>She grabbed the fan on the table and covered half of her face, revealing only her pair of black eyes. With a flicker, she asked, “Why are you back so late?”</p><br/><p>“Have you had dinner?”</p><br/><p>He shook his head. “Not yet.”</p><br/><p>“Oh …”</p><br/><p>He thought she was going to care about him, but she said regretfully, “But I did.”</p><br/><p>Yan Yu choked and asked her, “You didn’t leave any for me?”</p><br/><p>“Yes,” she said.</p><br/><p>Then she got up from the couch and asked Shang Yu to serve the meal.</p><br/><p>Knowing that he had been in the study, she did not disturb him, and was afraid that it would be more embarrassing for them to be in the same room, so she did not go to have dinner with him.</p><br/><p>Shang Yu warmed up the meal and brought it to the table.</p><br/><p>Sitting at the table, Yan Yu couldn’t help but look towards the inner room.</p><br/><p>He finished a bowl of rice in two or three mouthfuls and went to the next side room to take a shower. When he came back, Xie Zhen had already gone to sleep in the side room.</p><br/><p>Lying in bed, he couldn’t fall asleep.</p><br/><p>He sat up, put on his shoes, and knocked on the door. “Xie Zhen?”</p><br/><p>There was no respond.</p><br/><p>He pushed at the door but didn’t push it open.</p><br/><p>He was somewhat disappointed. He had thought that their relationship would progress after today’s matter, but he never expected that she would still reject him thousands of miles away.</p><br/><p>After standing by the door for a while, he was about to leave when Tan Mei opened the door from the inside, yawning as she went to the toilet.</p><br/><p>Upon seeing him outside the door, her mouth was wide open. “Your highness … your highness?”</p><br/><p>Yan Yu ignored her and walked straight into the room.</p><br/><p>Xie Zhen was lying in bed, with her back to him, sleeping.</p><br/><p>He closed the door behind him, bolted the door, and stepped over to the bed.</p><br/><p>He took off his shoes, got into bed, and slowly lay down beside her.</p><br/><p>“Xie Zhen?”</p><br/><p>He called out, but she didn’t respond.</p><br/><p>He leaned forward and took her hand in his, just in time to hold her in his arms.</p><br/><p>He put his ear close to hers and took a bite. His voice was low. “Xie Zhen, wake up.”</p><br/><p>When Xie Zhen was waken up, it was dark, then she realized she was being held, and she turned to him and tried to resist. “Who?”</p><br/><p>Yan Yu said, “It’s me.”</p><br/><p>Startled, she blurted out, “Why is it you again?”</p><br/><p>Last time, he had barged in just like this. That time, he had been afraid of thunder. What was it this time?</p><br/><p>Xie Zhen tried to get out of his arms, but she was not as strong as he was, so for a long time she couldn’t.</p><br/><p>She lowered her head and bit into his arm. “Let go of me!”</p><br/><p>Yan Yu frowned. No matter how she tried to bite him, he wouldn’t let go of her.</p><br/><p>She finally got tired of making a ruckus and panted in his arms. “You, you eat your words …”</p><br/><p>Yan Yu asked, “what words?”</p><br/><p>She said angrily, “You said you wouldn’t touch me, so why do you hug me?”</p><br/><p>Annoyed, she accused, “A big liar.”</p><br/><p>After a long pause, he finally said, “I’m not a liar.”</p><br/><p>“You are.”</p><br/><p>“I’m not.”</p><br/><p>“You–are–”</p><br/><p>Her voice was long and drawn-out, as if she was arguing with him until the end of time!</p><br/><p>Yan Yu paused, “…”</p><br/><p>“Oh.”</p><br/><p>Anyway, he had never won an argument with her.</p><br/><p>It would be better to let her go, and make her happier.</p><br/><p>Xie Zhen lowered her head, and looked to the wall. “What you say never counts. You always lie to me.”</p><br/><p>She tried to settle old scores, one by one. “You promised that we sleep in separate rooms, but you came to my room on our wedding night, and Shang Yu told me later. Don’t think I didn’t know.”</p><br/><p>He was silent and speechless.</p><br/><p>She added, “You hugged me at that raining night and yelled at me another day.”</p><br/><p>“…”</p><br/><p>“Aren’t you a liar?”</p><br/><p>Yan Yu didn’t expect her to remember everything so clearly. His face was pale and green, but she couldn’t see it clearly in the darkness, otherwise she would have laughed at him.</p><br/><p>“I didn’t lie to anyone.”</p><br/><p>She said indignantly, “Then you’re lying to me alone?”</p><br/><p>He did not retort. It seemed that he had tacitly accepted it.</p><br/><p>Xie Zhen recalled another matter. “You used to say you were going to take me flying a kite, and then you left without a word, so you’ve been a liar since you were a kid.”</p><br/><p>She grunted. “Little liar when you were young, while big liar when you grew up.”</p><br/><p>Yan Yu was simply angered to death by her. He carried her to his chest with both hands, rolled over and pressed her under him. He bit her ear in anger: “I can’t even protect my own life, how can I fly a kite with you?”</p><br/><p>Xie Zhen was hardly breathing under his press, and tilted her head with confusing. “What do you mean?”</p><br/><p>“Where’s Auntie Song?”</p><br/><p>She had always wondered where Auntie Song was, but she had asked him, and he didn’t tell her, and she had tactfully stopped.</p><br/><p>Since he spoke of it today, she couldn’t help but ask again.</p><br/><p>Yan Yu was buried his head in her neck, and his overbearing posture disappeared in an instant, leaving only pain and powerlessness. He said, “She’s dead.”</p><br/><p>Xie Zhen was shocked, with her mouth open, so for a moment she didn’t say a word.</p><br/><p>She remembered that Auntie Song was a very gentle and skilled person. Every time she went to the Li family, Auntie Song would treat her warmly and call her “Little Lamb” affectionately.</p><br/><p>After so long, she forgot about Auntie Song’s appearance but still remembered her gentle smile.</p><br/><p>Her eyes suddenly became moist as she stammered, “Then …”</p><br/><p>“What about your father?”</p><br/><p>He closed his eyes and shivered. “He’s dead, too.”</p><br/><p>The scene from a few years ago once again appeared in front of his eyes, and he still couldn’t forget his father and mother’s widened eyes, as well as the shards of blood.</p><br/><p>He watched them die in front of him, but he could do nothing about it.</p><br/><p>He thought that after so many years, he would only be left with hatred and no longer be in pain. He didn’t expect that he would still be unable to control his emotions when facing her.</p><br/><p>Everything in his childhood had been destroyed, except for her, and she was still the same.</p><br/><p>So to him, she was precious.</p><br/><p>After a long moment, Xie Zhen said slowly, “Get up.”</p><br/><p>He rolled away from her.</p><br/><p>The two of them lay face to face, the moonlight streaming over them from the window, and Xie Zhen wiped his eyes with her sleeve. “Don’t cry,” she said.</p><br/><p>Yan Yu looked at her. “I’m not crying.”</p><br/><p>She chuckled sweetly, “I know you’re holding it in. Actually, you can cry, but I won’t laugh at you.”</p><br/><p>Yan Yu stared at her, but in the end, he did not cry.</p><br/><p>She didn’t know what to say to comfort him. After all, she had never been experienced death of her family members.</p><br/><p>She wanted to ask who killed Auntie Song, but she was afraid that it would pierce his sore spot and he wouldn’t tell her, so she didn’t ask.</p><br/><p>The smile on her face gradually disappeared. She took the initiative to hold his hand and sniffled, “I didn’t know that it was like this …”</p><br/><p>He took her hand back. Perhaps it was her words that had done the job, perhaps it was because he had put up with it too hard. He had the urge to cry.</p><br/><p>He put his arms around her and held her tight to his chest. “Can I hug you?”</p><br/><p>Xie Zhen blinked. “Aren’t you hugging him?”</p><br/><p>He held her closer so she wouldn’t see his expression.</p><br/><p>After a long moment, Xie Zhen felt like her waist was about to be broken, and she twisted it. “I want to ask you something.”</p><br/><p>He asked, “What?”</p><br/><p>“So, you left that time, it was not because you hated me?”</p><br/><p>Even though she usually didn’t say anything, she did mind it in her heart.</p><br/><p>It had given her quite a blow, causing her to fall into depression for quite a while. When she grew up and met him again, she subconsciously felt a bit of fear.</p><br/><p>With the sudden exaltation of his identity, she was even more afraid to open her heart to him.</p><br/><p>Yan Yu held onto her waist, not letting her move. “I hate you?”</p><br/><p>She nodded. “Don’t you?”</p><br/><p>He rubbed his chin against the top of her head and said coldly, “I didn’t say that.”</p><br/><p>Xie Zhen tried to look up at him, but she could not move. “Really?”</p><br/><p>He coldly snorted, “Why would I lie to you?”</p><br/><p>Xie Zhen pursed her lips, and her hands quietly held to his sleeves. “You’re a big liar.”</p><br/><p>So he hadn’t said those words before. So it was Ouyang Yi who had lied to her …</p><br/><p>She felt that she was laughable. After being deceived for so long, why didn’t she ask for confirmation?</p><br/><p>After he said that, the gap between the two of them was narrowed, and the barrier between them was broken at once, as same as that of many years ago.</p><br/><p>No, it was still a little different …</p><br/><p>He rolled over on top of her and locked his eyes around her.</p><br/><p>She had a smile on her face, but she didn’t realize how ambiguous her words were.</p><br/><p>Yan Yu leaned over and said in a hoarse voice, “I am truly a liar.”</p><br/><p>He found her lips and kissed them without hesitation.</p></blockquote><br/>\n</div>"}