{"title": "Chapter 55 - Childish Things", "id": 55, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-55-childish-things", "volume_title": "Volume 1", "body": "<h1>Chapter 55 - Childish Things</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div class=\"title__3i-dQ\">C55</div><blockquote><br/><p><strong>C55: Childish Things</strong></p><br/><p>The name of Spring Blossom Castle, once ran through the whole of Xie Zhen’s childhood.</p><br/><p>Most of her joys and sorrows had happened here.</p><br/><p>At that time, Xie Liqing had built she and Xie Xun a house like this. Both of them had spent most of the day in it. It contained a vine swing, a small bridge, and two small turtles they raised.</p><br/><p>Every time someone came to visit them, they would invite their little friends to Spring Blossom Castle.</p><br/><p>As she grew older, she and Xie Xun still often went there and sat on their swings and whisper to each other, though they were no longer as noisy as they had been when they were children. When they returned to the capital, the things in Spring Blossom Castle could not be moved over, so they had no choice but to give up.</p><br/><p>So when she saw these three words, her first reaction was shock, then surprise.</p><br/><p>She walked up the steps, leaving Yan Yu behind, and walked impatiently into the yard.</p><br/><p>The scene was the same as before. In the middle of the courtyard, there was a wisteria rack. All the wisteria flowers had withered away, leaving behind only a few withered yellow branches. There was a swing beside it, and on the left was a small arched bridge with streams running under it. She walked to the water’s edge and saw more than a dozen carps and two turtles, one big and one small.</p><br/><p>Surprised, she walked to the bridge and looked down. Her eyes were filled with joy. “Big Qiansui and Little Qiansui!”</p><br/><p>On closer look, the patterns on the turtle shell were somewhat different, but it was enough. Seeing this, she was already very satisfied.</p><br/><p>When she got off the bridge, she kept coming to the swing, swinging it back and forth, holding the rope, and looking at Yan Yu with a bright smile. “Why did you come up with the idea to build this yard?”</p><br/><p>Yan Yu had been following her ever since she had rashly run in, watching her run from here to there, then from there to here. But somehow, seeing her so happy, his heart blossomed like a flower, one flower after another filling his chest.</p><br/><p>He tilted his head and looked away. “This courtyard is too remote. There’s no need for it. So I’ll use it to build something for you.”</p><br/><p>After finish speaking, he turned to check Xie Zhen’s reaction.</p><br/><p>Xie Zhen tilted her head, her eyes sparkling before saying softly, “But I like it.”</p><br/><p>When she smiled, her cheeks had a shallow pear swirl, her eyes were curved, like the crescent moon, bright and bright.</p><br/><p>Yan Yu’s ears were red, and the blush was spreading to his face. He stood under the sun and struggled, “Oh …” After a short pause, he added, “It’s good as long as you like it.”</p><br/><p>Xie Zhen really liked it. It would be better if only she could get Xie Xun to join her too. But she was grateful, for whatever reason, that he had the heart to build her a place like this.</p><br/><p>“Can I bring Ah Xun in later?” he asked.</p><br/><p>He nodded. The yard belonged to her anyway, and she could bring anyone she wanted. “Of course.”</p><br/><p>She looked up at him. “And my brother?”</p><br/><p>“Sure.”</p><br/><p>She then asked, “And my father and mother?”</p><br/><p>He was patient. “Sure.”</p><br/><p>She seemed excited and said many names in succession, “And Yaoan? And Ling Xiangyun? And Xie Ying and Xie Yin?”</p><br/><p>The corners of his eyes twitched. “Anything is fine.”</p><br/><p>After a long time, she asked, “And you?”</p><br/><p>He was stunned for a moment, then he could not restrain his delight, but he insisted, “I don’t like these things.” When he saw the disappointment in her eyes, he immediately regretted it and hurriedly added, “But I can accompany you.”</p><br/><p>Unfortunately, by the time he said this, Xie Zhen was distracted by something else.</p><br/><p>Behind the tree, there was a mottled deer. Its round eyes seemed rather familiar. She walked over, surprised and pleased. “Hey, you. Are you the deer at Mingqiu Lake? ”</p><br/><p>The deer, of course, would not answer her. She turned to Yan Yu, who was still lost in the conversation and nodded absently.</p><br/><p>Did she hear what he said next?</p><br/><p>If so, why not she say something? If she didn’t hear it, why did she get over it so quickly?</p><br/><p>Unaware of his entanglement, Xie Zhen sidles around behind the deer and grabbed its tail. “Why are you here? Who brought you here? ”</p><br/><p>Frightened, the deer broke free of her grip and ran quickly behind Yan Yu, showing a pair of antlers and a pair of eyes in curiosity and fear.</p><br/><p>“You brought it back?”</p><br/><p>“Yeah,” he said, trying to repeat what he’d just said. “Xie Zhen, I…”</p><br/><p>The deer ran away from him, and she hurried after it: “Wait for me!”</p><br/><p>Yan Yu was speechless.</p><br/><p>Finally the deer was chased out of the way and plopped into the pool, with Xie Zhen right behind it, who was unable to dodge in time and was splashed all over with water. The carps, alarmed, scuttled around.</p><br/><p>With beads of water on her face, she just stood there.</p><br/><p>Yan Yu walked over. He didn’t expect her to be like this in such a short time. After being stunned, he wiped her face with his sleeve and angrily asked: “Don’t you know how to dodge?”</p><br/><p>He couldn’t control his strength. The cloth rubbed hard against her delicate face, and she couldn’t help protesting, “It hurts.”</p><br/><p>Yan Yu stared at her, but the strength in his hands was noticeably lighter.</p><br/><p>He wiped the droplets off her face little by little and said in an unkind tone, “The deer is so funny?”</p><br/><p>She said, “I’ve never seen it before.”</p><br/><p>After a while, his sleeves gradually changed to hands, and he slowly rubbed his fingers over her eyes, unwilling to part with them.</p><br/><p>After waiting for a long time, Xie Zhen couldn’t help asking, “Did you clean it?”</p><br/><p>He said no, and touched her cheek a few more times before letting go. Her skin was unblemished,like white tofu, smooth and tender.</p><br/><p>He took her hand before she could go and coughed. “Did you hear what I said?”</p><br/><p>She was puzzled. “Which part?”</p><br/><p>Looking at her expression, she really hadn’t heard anything. Yan Yu pressed his eyebrows together and angrily asked, “What are you running around for if you didn’t hear it?”</p><br/><p>Xie Zhen winced, fear flashing in her eyes.</p><br/><p>He managed to make her smile again, and when he scolded her, she drew back into her shell. Yan Yu’s heart ached and he felt vexed. His tone of voice couldn’t help but lighten a lot as he repeated, “In the future, whenever you want to come here, I will bring you.”</p><br/><p>Xie Zhen nodded, but stopped smiling.</p><br/><p>She knew she was smug, but that made sense. How could she not be happy when she saw the exact same scene as when she was young?</p><br/><p>Was he angry because she was so presumptuous?</p><br/><p>On the way back, Xie Zhen stopped talking.</p><br/><p>Yan Yu walked distractedly in front, not knowing why she suddenly fell silent. Wasn’t she fine just now? Could it be that if he was a little more fierce with her, she would get angry?</p><br/><p>He scowled and ignored everyone.</p><br/><p>He walked a little way without hearing a sound behind him, and when he looked back, he saw that Xie Zhen was walking slowly behind him, holding up her skirt. He pursed his lips, strode back, stopped in front of her, bent down, and, without a word of explanation, picked her up, and as he walked he asked, “Why don’t you talk?”</p><br/><p>Xie Zhen was shocked, grasped his sleeve subconsciousnessly. “Talk What?”</p><br/><p>Yan Yu asked, “The road is not easy to walk, why didn’t you tell me to wait for you?”</p><br/><p>She was baffled and felt that this person was simply capricious. “Didn’t we have an argument?”</p><br/><p>He paused, his dark eyes staring straight at her. “Who said we had an argument?”</p><br/><p>His eyes were like a deep water, like bottomless abyss, making her easy to drown. “You promised you wouldn’t hit me or shout at me.”</p><br/><p>He felt guilty.</p><br/><p>Sure enough, her next sentence was, “You shouted at me just now.”</p><br/><p>Yan Yu tried to explain, “That is…”</p><br/><p>It was a pity that he was unable to make heads or tails of it.</p><br/><p>As they were making their way out of the most difficult part of the road, Xie Zhen got out of his arms and saw the main courtyard ahead of them, where she could walk on her own.</p><br/><p>Returning to the main courtyard, the two maids stood together.</p><br/><p>Shuang Yu and Qing Xia ushered her into the main room. Shuang Yu turned to pour tea, but Qing Xia repeatedly looked out the door.</p><br/><p>“What are you looking at?” Xie Zhen asked suddenly after noticing it.</p></blockquote><br/>\n</div>"}