{"title": "Chapter 68 - Bitterness", "id": 68, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-68-bitterness", "volume_title": "Volume 1", "body": "<h1>Chapter 68 - Bitterness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div class=\"title__3i-dQ\">C68</div><blockquote><br/><p><strong>C68: Bitterness</strong></p><br/><p>Calculating the time, it was nearly a year since the two of them had met each other last time.</p><br/><p>When he left Qing Zhou last year, Xie Zhen was only 14 years old, Gao Xun was still a straightforward youth. Now that he saw her again, they felt like they were in another world.</p><br/><p>Gao Xun was much darker than last year. It was probably because he had bathed in the sun when he was in the army. His skin was a healthy dark wheat color, and he was also taller than last year.</p><br/><p>Xie Zhen almost didn’t recognize him at first, and if he hadn’t looked at her with such familiarity, she would have thought it was some passing son of a official.</p><br/><p>Zhong Shang and Gao Xun walked up to her. Zhong Shang called “fourth sister” and then looked at Xie Zhen. He didn’t need any introductions as he had known her identity. “This must be the sixth prince’s wife.”</p><br/><p>Before they came here, they heard that the person who fell into the water was the six daughters of the Xie family. At this moment, they were standing close to each other, and the person who looked similar to Xie Xun could only be her older sister, Xie Zhen.</p><br/><p>With this thought, he patted Gao Xun’s shoulder without leaving a trace and introduced him with a natural attitude: “This is Gao Xun, and his father is a recording officer in Qing Zhou. He is in the same army camp as I am and holds the position of a Chiliarch.”</p><br/><p>This was the first time that Zhong Rou had met Gao Xun. She nodded at him and said, “My brother is in the army, so I’ll have to trouble you to take care of him.”</p><br/><p>When Zhong Shang heard this, he didn’t know whether to laugh or cry.</p><br/><p>Zhong Rou was only a year older than him, but she carried the airs of an old man everywhere. She cared for him and even looked down on his ability.</p><br/><p>She had never once looked at those unskilled young men he had brought home, but now that he had turned over a new leaf and made good friends with gentlemen, she only managed to change her opinion of him. Since then, she would thank the one he brought home once or twice.</p><br/><p>It seemed that the only reason he had today’s repentance was because of the other party’s achievements.</p><br/><p>Zhong Shang was already used to her actions, so he didn’t stop her. He only smiled and had an attitude of “watching on the wall”.</p><br/><p>Gao Xun regained his wits and shook his head. “Miss Zhong’s words are heavy. He took care of me most of the time. So I don’t dare to ask for credit in front of Miss Zhong.”</p><br/><p>After the end of the talk, his eyes involuntarily turned to Xie Zhen, who was standing at the side.</p><br/><p>Xie Zhen had recognized him. Her eyes were filled with smiles as if they were old friends who hadn’t seen each other for long time. “When did you come to the capital?”</p><br/><p>“Why didn’t you tell me?”</p><br/><p>She actually blamed him first.</p><br/><p>Gao Xun pursed his lips helplessly, and said frankly without any blaming tone. “What do you want me to tell you when you come to the capital without a word?”</p><br/><p>Xie Zhen knew it was her fault, so she smiled ashamedly. “We were in a hurry, and I wanted to tell you, but you were in the army, so I gave up.”</p><br/><p>She didn’t expect to meet him again in the capital. She was both surprised and happy. “Did you come by yourself?”</p><br/><p>“My uncle and aunt are not with you? ”</p><br/><p>He nodded, “I came by myself. I just arrived in capital not long ago.”</p><br/><p>The two of them were very familiar with each other, but they still observed each other’s etiquette and did not make any unconventional moves.</p><br/><p>Zhong Shang’s eyes roved between the two of them, and he could not help but feel painful for Gao Xun.</p><br/><p>He was full of love for her, but she didn’t know anything about it or even if she did, she couldn’t give him a response.</p><br/><p>It was just one sided love.</p><br/><p>Zhong Rou’s eyes were filled with doubt. “You know each other?”</p><br/><p>Xie Zhen nodded and explain to her. “We knew each other in Qing Zhou. We used to hang out together when we were kids, and Gao Xun took care of us like our older brother.”</p><br/><p>Zhong Rou understood.</p><br/><p>Gao Xun, on the other side, heard she take him an older brother. He only felt a bitter and unspeakable bitterness welled up from the bottom of his heart. It was worse than swallowing coptis, but he could not refute it.</p><br/><p>In the past, she was a little girl that had not married. She was a flower that he had taken care of all by himself, so perhaps he would be able to wholeheartedly pursue her and take care of her.</p><br/><p>Now that she was married, and had become the cute little wife in someone else’s house, he could no longer come too close to her as he had before, lest it hurt her reputation.</p><br/><p>The more he thought about this, the more miserable he felt in his heart.</p><br/><p>He could not say it. He could only suppress these emotions and change the subject. “On the way here, we heard about Ah Xun falling into the water. What’s the situation like?”</p><br/><p>“Is she alright?”</p><br/><p>When coming to this matter, Xie Zhen’s mood instantly dropped. Her eyebrows twisted and she slowly shook her head. “Not good. She’s getting a fever. I just fed her a bowl of medicine and now she’s sleeping again.”</p><br/><p>Xie Xun got a serious fever this time, because the cold water of the late autumn lake was not something she could bear. She had been shivering when she was rescued by Zhong Rou, and now she just got warm until she was covered in a few layers of bedding.</p><br/><p>When Xie Zhen came out, her cheeks were burning like an apple, and she wasn’t in the right frame of mind.</p><br/><p>The doctor said that if the fever does not go back the next morning, it may cause inflammation, so they should pay attention to.</p><br/><p>Gao Xun wanted to touch her head to comfort her, but then he realized that his status was no longer the same as it used to be, so he held himself back and lowered his hand.</p><br/><p>“Is the lake’s side slippery?”</p><br/><p>“How could he have fallen into the water without a hitch? Is there anyone around?”</p><br/><p>Before Xie Xun into a coma, she said someone was pushing her, and Xie Zhen had planned to ask her who it was when she woke up. Now that she didn’t know who it was, she couldn’t say too much: “Ah Xun is the most timid. She doesn’t go to dangerous places at all. ”</p><br/><p>“Now that something has happened, it’s my mother and I didn’t take good care of her.”</p><br/><p>She lowered her eyes, full of remorse.</p><br/><p>Zhong Rou understood the meaning of her words and called a servant maid at the end of the corridor. “Go to the backyard and ask around. Is there someone near the lake who was closest to Miss Xie.”</p><br/><p>“Or who saw the scene when the sixth girl of the Xie Family fell into the water?”</p><br/><p>“If you find out, just let me know.”</p><br/><p>The servant maid agreed and turned around to do so.</p><br/><p>When Zhong Rou asked if Xie Zhen knew the reason why Xie Xun fell into the water, she felt there was something fishy about it.</p><br/><p>The spot was not prone to accidents, and there were no moss growing on the rocks. There was only a willow tree blocking the way. Xie Xun’s servant maids were only a few steps away, so how could they just watch her fall?</p><br/><p>Xie Zhen thanked her, but she said, “we were the ones who didn’t take care of the six girl who had an accident at my house, so I just did what I should do”.</p><br/><p>She had seen what mattered. She was adept at handling small matters like this.</p><br/><p>Furthermore, there was a certain calmness in her bones that made people feel at ease. It was as if she was the one who would do everything, and she would always have a way to resolve anything.</p><br/><p>Xie Zhen was anxious about Xie Xun, so she said, “I’m going to take care of Ah Xun.”</p><br/><p>She turned back and looked at Gao Xun. “My big brother is in front. You can go talk to him.”</p><br/><p>Gao Xun nodded, but he did not move.</p><br/><p>Inside, Xie Xun’s situation was still not improving.</p><br/><p>She was talking nonsense, sometimes crying for help, sometimes just crying, Xie Zhen felt painful for her as she came up and took her hand and said softly, “It’s all right. You’ll be all right.”</p><br/><p>Before long, she quieted down.</p><br/><p>Since Madam Leng was still in the front yard, Xie Zhen stayed with her for a while.</p><br/><p>Not long after, Madam Leng and Xie Liqing came from the front, followed by Xie Rong.</p><br/><p>After Xie Liqing heard all of the story told by Madam Leng, he calmed down. After meeting up with the people in the general’s mansion, he let the nanny carry Xie Xun out and immediately returned home.</p><br/><p>As soon as they arrived, Yan Yu also came from the front.</p><br/><p>At the same time, Xie Zhen was standing in the porch, the biddy just carrying Xie Xun on her back, Xie Zhen was holding her up, and across from her were Zhong Shang and Gao Xun.</p><br/><p>Gao Xun had been on good terms with the family ever since he was young. When he saw Madam Leng and Xie Liqing, he did not have time to talk with them. At the time he saw that Xie Liqing didn’t look too good, he came forward to console him.</p><br/><p>When Xie Zhen turned around, Xie Liqing was just asking him why he had come to capital, and he replied truthfully. He raised his head and met Xie Zhen’s gaze. He smiled back.</p><br/><p>Xie Zhen pursed her lips and forced the corners of her mouth to bend.</p><br/><p>Yan Yu stepped forward and grabbed her hands, his eyebrows knitted into a knot. “What’s going on?”</p><br/><p>As he spoke, he separated the two of them, protecting Xie Zhen on his side, preventing him from touching her.</p><br/><p>Xie Zhen told the whole story, including the part that Zhong Rou saved Xie Xun. “Thanks to the fourth girl of Zhong family…”</p><br/><p>Her hands were cold, and even now, she still felt a little scared when she thought about it.</p><br/><p>It was no need to explain it clearly. Yan Yu had heard that something was wrong. His intuition was not simple at all. It should be someone who had planned to harm Xie Xun.</p><br/><p>He asked Xie Zhen. “Has sent anyone to take a check?”</p><br/><p>Xie Zhen said.” “Miss Zhong sent people to work it out. We still don’t know the results.”</p><br/><p>The women in the backyard hadn’t left yet. It shouldn’t be hard to find them …</p><br/><p>If Xie Xun hadn’t been unconscious, she would have been able to find out who the culprit was.</p><br/><p>Xie Xun had always been laying on the nannie’s shoulder. Perhaps it was because of the cold, she was still shivering and muttering, “I want some Red Jujube Rice Soup …”</p><br/><p>It wasn’t a loud sound, and neither Xie Zhen nor Madam Leng hear what she said.</p><br/><p>Only Zhong Shang who was a few steps away could hear it clearly.</p><br/><p>Zhong Shang and Zhong Rou were sending the guests off. He felt it was funny to hear that.</p><br/><p>….</p><br/><p>She was really a gluttonous cat, but who would have thought that she would be so gluttonous that she didn’t forget to eat even in such a situation.</p><br/><p>Just as he thought this, he paused as the nannie carrying Xie Xun on her back passed by him. The little girl suddenly opened her eyes, looking dazed and confused.</p><br/><p>She saw him. He had thought she was an ordinary, coquettish little girl, but he saw that she only dropped a tear without a sound. She didn’t want Madam Leng and Xie Zhen see this, so she turned to him and rubbed the nannie’s back.</p><br/><p>Her small face was flushed red and she must have been unpleasant, but from beginning to end, she said nothing other than that she wanted to drink the rice soup.</p><br/><p>Suddenly, Zhong Shang admired her.</p><br/><p>Her long lashes were wet from crying, lifted and lowered, and she looked at him for a moment, but she did not think of him at all, and then she forgot about him.</p><br/><p>When they reached the gate, the nannie put Xie Xun into the carriage.</p><br/><p>Xie Zhen was worried and wanted to go home with her.</p><br/><p>On the other side, Gao Xun sent Xie Liqing to the carriage, Xie Liqing had a good impression of him. And because he came to the capital alone, so as a senior he naturally had to take care of him a little more. He invited Gao Xun to come to his house. “There was an accident today, so I didn’t have time to talk to you. You come back with me and I’ll treat you properly.”</p><br/><p>Because of General Zhong’s birthday, the army gave them permission to leave for three days.</p><br/><p>Gao Xun thought for a moment before replying, “Then I’ll be troubling uncle.”</p><br/><p>Xie Zhen told Yan Yu that she would be with her families for only one day. Until Xie Zhen pulled through, she will get back to the sixth prince’s Mansion.</p><br/><p>Yan Yu agreed, but then suddenly changed his mind for some reason. He got on his horse and carried Xie Zhen up. “I’ll go with you.”</p></blockquote><br/>\n</div>"}