{"title": "Chapter 72 - Entrusting", "id": 72, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-72-entrusting", "volume_title": "Volume 1", "body": "<h1>Chapter 72 - Entrusting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>C72: Entrusting</p><br/><p>When they returned to the sixth prince’s Mansion, it only took for an incense stick to burn. Because the driver was in a hurry, driving hour was shortened by half.</p><br/><p>After getting off the carriage, the steward led Yan Yu and Xie Zhen to the Pavilion Changqing, “Your Highness and the Empress please come with me.”</p><br/><p>Not long after they entered the courtyard, a person arrived on horseback, barely stopping at the entrance of the mansion.</p><br/><p>Gao Xun dismounted from his horse and stopped a servant to ask, “I was the old friend of sixth prince, and we met by chance just now. But he just left in a hurry before we could even say a few words. May I ask if anything happened?”</p><br/><p>The servant, a porter at the gate, put his hands in his sleeves and looked him up and down, and seeing that he did not seem to be lying, said: “There is indeed something wrong.”</p><br/><p>There was a mother and a daughter coming into the mansion for no apparent reason. Since the sixth prince did not hide their identities, all the servants knew that they were the sixth prince’s aunt and cousin when he was in exile.</p><br/><p>However, no one really liked them. They ate and drank in the mansion, and even ordered them about as well as shout at them.</p><br/><p>It was their duty to serve, but that cousin lady was truly a bit too impolite. She treated herself as if she were the master of sixth prince’s mansion.</p><br/><p>After all, the masters in the sixth prince’s Mansion were only the sixth prince and the Prince’s wife.</p><br/><p>The servants were secretly discussing about them, guessing what kind of scheme she and Madam Li had, and how long they would stay here.</p><br/><p>If they really planned to stay here permanently, could the Prince’s wife bear with it?</p><br/><p>Gao Xun was right. He brought the horse over and asked, “What happened?”</p><br/><p>The servant glanced at the courtyard, covering his mouth with his hand as he said in a low voice, “A few days ago, a mother and a daughter came to the mansion. It is said that they are His Highness’s previous aunt and cousin.”</p><br/><p>“The aunt lady seemed to be dying, so the steward asked His Highness back to discuss the matter.”</p><br/><p>Aunt?</p><br/><p>Cousin?</p><br/><p>Could it be what he thought it was?</p><br/><p>Gao Xun frowned and deliberately asked, “His Highness’s mother is imperial concubine Hui, and imperial concubine Hui is the daughter of Minister Bai. How come I’ve never heard of him having other daughters …”</p><br/><p>The servant revealed a “you don’t know” expression, and probably because he had been holding it in in his heart for a long time, he could casually catch a person and talk for a long time, “His Highness has been living in seclusion for a period of time, and these two were his relatives at that time …</p><br/><p>“Now they know that our prince has honorable identity, so they came.”</p><br/><p>“I’d say how shameless they are.” He revealed a defiant expression.</p><br/><p>“Since His Highness has no relationship with them, saving their lives is already merciful …”</p><br/><p>The servant on the other side were still chattering away, but Gao Xun had already fallen into a trance.</p><br/><p>The mother and the daughter pair mentioned by the servant were most likely Madam Li and Ouyang Yi.</p><br/><p>He had some impression of these two. Because of Ouyang Yi’s domineering personality, he had a deep impression of her. At that time, she was living in the Li’s Mansion.</p><br/><p>Although she was obviously living under the protection of others, she did not comtrol herself, still being arrogant, so Li Yu rather disliked her.</p><br/><p>Who would have thought that after so many years, they would still have no change.</p><br/><p>Gao Xun nodded and looked deeply into the door. “You said just now that the aunt lady was dying?”</p><br/><p>The servant was quick to talk, and after a while, he disclosed the whole story. “Yes. She fell on the edge of the well early in the morning, and she’s almost dying.”</p><br/><p>Gao Xun understood what had happened, and clasped his hands to the servant. “Thank you, little brother, for your explanation.”</p><br/><p>With that, he led the horse to the side. The servant held him back and reminded him worriedly, “Don’t say to others…”</p><br/><p>He smiled. “I won’t.”</p><br/><p>However, when he turned around, the smile on his face immediately disappeared.</p><br/><p>He led his horse away, taking each step very slowly.</p><br/><p>Just as he approached the Pavilion Changqing, he heard the sound of crying coming from within.</p><br/><p>The mournful crying was nearly hoarse, causing people’s hearts to tremble.</p><br/><p>Yan Yu and Xie Zhen walked into the yard. There were two servant maids standing in the yard. They were quite bewildered, but when they saw the two return, they came up to them as if they were their backbones.</p><br/><p>Liu Lan hurriedly said, “Your Highness, esteemed princess, the aunt lady is dying!”</p><br/><p>As he walked into the room, Yan Yu asked, “Have you got the doctor to take a look?”</p><br/><p>Liu Lan nodded. “Yes. The doctor said that she is terminally ill and he has no way.”</p><br/><p>As soon as they entered the room, a strong smell of medicine assaulted their nose. It was accompanied by a bad smell, causing them to frown.</p><br/><p>Liu Lan explained. “The aunt lady can’t get out of bed these two days, so she ate and drank in bed all the time.”</p><br/><p>Since Yan Yu and Xie Zhen went to the Duke Dingguo’s Mansion, Madame Li’s condition became worse and worse. Her stomach hurt all night long, and sometimes she even vomited a mouthful of blood.</p><br/><p>Since the doctors had seen this, all of them could do nothing but shake their heads.</p><br/><p>She had been tormented by the pain for two days, and when she woke up this morning, her eyes were clear and her spirit was strong, so she personally went to the well to get water to wash her face. Unexpectedly, she couldn’t keep her feet steady, and she stepped on empty air, heavily knocking her head against the stones by the well, and then she never got up again.</p><br/><p>Ouyang Yi stayed by her side. She cried for an entire day, and her voice got hoarse from crying.</p><br/><p>All that was left was a low whimper. When the servant maids said that the sixth prince and the Prince’s wife had arrived, the crying gradually became louder.</p><br/><p>It was dark inside the room. Ouyang Yi was guarding Madame Madam Li’s bedside, hugging her as she called out to her mother. “Don’t leave me …”</p><br/><p>“Mother …”</p><br/><p>Madam Li was skinny on the bed. In just a few days, it seemed that there were only her bones remain. Her appearance was terrifying.</p><br/><p>Her eyes were half open, but still had a breath of air left. She slowly rolled her eyes to look at Yan Yu, as if she had noticed someone coming in.</p><br/><p>Xie Zhen was startled by Madam Li’s appearance as soon as he entered. She had never seen a person on the verge of death before, so she stopped a few steps away, not daring to approach.</p><br/><p>Yan Yu stepped forward and called out, “Aunt.”</p><br/><p>He paused and wanted to say something, but he couldn’t think of anything else to say.</p><br/><p>When Ouyang Yi heard the voice, she turned around. Her face was covered in tears and her eyes were swollen like walnuts. “Cousin …”</p><br/><p>This sound was filled with sorrow, and it lasted for a long time.</p><br/><p>She added, “Mother …”</p><br/><p>“Mother is dying …”</p><br/><p>Yan Yu looked at Madam Li expressionlessly.</p><br/><p>Madam Li was on the verge of death, but still knew it was him. She opened her mouth and called out, “Yu’er.”</p><br/><p>He lowered his eyes and said, “I will get a doctor.”</p><br/><p>Then, he really called for Xiang Lan to come over. Just as he was about to speak, Madam Li shook her head. “It’s useless …”</p><br/><p>“I know my body well. I’m afraid I’m at the end of my life, so I don’t need to cause you any trouble …”</p><br/><p>He tilted his head to the side. Facing her death, even she was had never been close to him before, he still seemed to be touched a little.</p><br/><p>Madam Li always been weak and cowardly, and she had always lived under the shadow of her husband’s family. She was used to being humble, and no matter who she spoke to, she was always humble.</p><br/><p>It was precisely someone like her who had given birth to such a domineering and arrogant daughter. With her personality, she would never be able to control Ouyang Yi and could only adopt a casual attitude.</p><br/><p>However, the more she let it go, the more undisciplined Ouyang Yi became. Only when she was about to die did she realize that she seemed to have done something wrong.</p><br/><p>She was worried about leaving her daughter alone.</p><br/><p>Madam Li stretched out her hand and with great difficulty grabbed Yan Yu’s sleeve. With a weak breath, she said, “The only thing I am worried about is Ah Yi …”</p><br/><p>She gasped a few times with each sentence, speaking very slowly: “If I die, can you take care of her for a while and let her stay in the mansion …”</p><br/><p>“If you don’t mind, let her be your concubine …”</p><br/><p>“I…”</p><br/><p>“I’ll …”</p><br/><p>Yan Yu’s body stiffened and he frowned as he looked at her.</p><br/><p>Her eyes widened. She must have reached the end of her tether. “Yu’er, can you …”</p><br/><p>Yan Yu pursed his lips and didn’t say anything.</p><br/><p>Madam Li cried. “Aunt begs you …”</p><br/><p>Unfortunately, he never said anything.</p><br/><p>In the next instant, Madame Li opened her eyes wide and no longer breathed, her hand still tightly grasping his sleeve.</p><br/><p>“Mother!”</p><br/><p>Ouyang Yi rushed forward and cried out loud.</p><br/><p>The servant maids handed over the scissors, Yan Yu cut off half of the sleeve. He turned around and saw that Xie Zhen was no longer in the room.</p><br/><p>He was worried. Just as he was about to leave, he was stopped by Ouyang Yi. “Cousin, my mother has gone …”</p><br/><p>“What should I do…”</p><br/><p>Yan Yu thought of Madam Li’s last words of entrustment, and he became frustrated. He coldly said, “I will find a good husband for you.”</p><br/><p>When she saw that he was about to leave, she quickly stood in front of him, tears streaming down her face. “Mother gave me to you. She hasn’t even been buried, yet you want to marry me off to someone else?”</p><br/><p>Yan Yu stopped and looked at her with cold eyes, “Then who do you want to marry?”</p><br/><p>She wiped away her tears and blushed a little. “Mother wants me to be your concubine …”</p><br/><p>“I’ll do as she said.”</p><br/><p>He clenched his teeth. There was no room for negotiation. “It’s impossible!”</p><br/><p>With that, he waved her away and strode out. He said to steward Zhao at the entrance, “I’ll leave the responsibility of handling Aunt’s funeral affairs to you. She’ll be buried at the mountainside, buried with the people from the Li family.”</p><br/><p>The steward answered, and was about to ask what wood was chosen for the coffin, when he looked up and saw that he had gone far away.</p><br/><p>Yan Yu went back. There was the only way back to Zhanyue Court, but he chased all the way until he saw no sign of Xie Zhen.</p><br/><p>Even when he got to Zhanyue Court, he still didn’t see her.</p><br/><p>He asked the servant maids where she was, and servant maids were all at a loss. “Princess has never been back.”</p><br/><p>His heart was burning with anxiety, as he turned around and walked out.</p><br/><p>He searched the inside and outside of the residence but he couldn’t find his wife.</p><br/><p>The servants did not know where Xie Zhen had gone, and all they knew was that the sixth prince was crazy. His face was full of anger, and it seemed that he was trying to dig up a hole in the ground to find the princess.</p><br/><p>The servants did not dare to act rashly. As it gradually darkened, they began to search the backyard with lanterns in hand.</p><br/><p>The servant guarding the door said that he hadn’t seen the Prince’s wife leave the mansion, so she should still be in the mansion.</p><br/><p>However, there were only a few places that the Prince’s wife frequently visited. Where could she go?</p><br/><p>Steward Zhao anxiously said, “Princess, please don’t do anything foolish …”</p><br/><p>As sound of his voice faded, Yan Yu glanced at him and he immediately fell silent.</p><br/><p>Yan Yu suddenly thought of a place, and his heart suddenly ignited with hope. He grabbed the lantern in the servants’ hands, threw the words “don’t follow me”, and quickly walked towards a small path.</p><br/><p>Steward Zhao was worried, so he followed him with two servants.</p><br/><p>He walked faster and faster until he stopped in front of a small courtyard on a cobblestone path.</p><br/><p>The night closed in all four directions, and it was not possible to see what was written on the courtyard’s signboard. The sixth prince strode into the courtyard, and soon, he was submerged in the darkness of the night.</p><br/><p>Steward Zhao stopped outside the courtyard, unsure if he should enter.</p><br/><p>Finally, he said, “Let’s wait outside.”</p><br/><p>The other two hurriedly agreed.</p><br/><p>Yan Yu walked into the yard and took a look at the surroundings with the lantern. It was very quiet and did not seem like there was anyone around.</p><br/><p>He did not give up and walked from the flower rack to the swing. Under the dim light of the lantern, he could barely see a person sitting on the swing.</p><br/><p>She held the rope gently in both hands, perhaps seeing him coming, but she did not speak or call to him, only tilted her head and looked at him quietly.</p><br/><p>Her black almond eyes were bright and even brighter than the stars in the sky.</p><br/><p>Yan Yu seemed to come back to life, his heart was softened by her gaze. He put the lantern on the ground and slowly walked over to her. “Xie Zhen?”</p><br/><p>He stepped closer, and she looked up.</p><br/><p>“Huh?”</p><br/><p>Her sound was long, making her more intoxicating in the moonlight.</p><br/><p>Before he lost her, Yan Yu had already experienced the joy of having recovered from his loss. He bent down and took her into his arms, “Why did you run around?”</p><br/><p>His tone was reproachful, but his arms tightened around her.</p><br/><p>When he faced her, he was always worried about his gains and losses. Sooner or later, he would be tortured into madness by her.</p><br/><p>Xie Zhen tried to pull away from him, but the more she struggled, the tighter he tightened his grip on her. She felt her bones about to shatter under his grip, and she grunted uncomfortably. “I just want to sit here.”</p><br/><p>His voice trembled. “Why didn’t you tell me?”</p><br/><p>The panic he felt when he couldn’t find her earlier was still there. His heart beat violently, and he was unable to calm down for a long time.</p><br/><p>Xie Zhen blinked and said calmly. “You’re going to be busy listening to your aunt’s words. She’s dying. I’m not going to bother you.”</p><br/><p>Yan Yu froze, “Her words…”</p><br/><p>Xie Zhen said, “I heard it all, that she wants you to take Ouyang Yi as your concubine …”</p><br/><p>Without waiting for her to finish speaking, he hurriedly explained, “I won’t take a concubine.”</p><br/><p>Did she come out because she heard this?</p><br/><p>He had already made up his mind when he looked for her just now. He wouldn’t take Ouyang Yi as his concubine. He would find her a good husband and marry her off as an answer to Madame Li.</p><br/><p>But it was impossible for him to accept her.</p><br/><p>Except for XieZhen, who else would he want?</p><br/><p>Xie Zhen tilted her head. “Madam Li entrusted Ouyang Yi to you on her deathbed. Won’t you accept her?”</p><br/><p>He crouched down slowly and wrapped his arms around her waist. “I won’t.”</p><br/><p>Xie Zhen fell silent. “Why not?”</p><br/><p>He buried himself in her stomach and said nothing.</p><br/><p>“Brother Xiao Yu?”</p><br/><p>“I just want you,” he finally said in a muffled voice.</p><br/>\n</div>"}