{"title": "Chapter 82 - Feast", "id": 82, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-82-feast", "volume_title": "Volume 1", "body": "<h1>Chapter 82 - Feast</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>C82 C82: Feast</p><br/><p>When the sky was about to brighten, Xie Zhen suddenly reached out and hugged his waist, and said with a voice as thin as a mosquito, “Don’t go.”</p><br/><p>How could she sleep when he hadn’t slept all night?</p><br/><p>This trip had a bumpy future and his fate was unknown. She did not know how Emperor Yuan Hui had hardened his heart to let him go. Didn’t they say that he doted on him the most? Wasn’t he afraid that he wouldn’t be able to return?</p><br/><p>At this time, Xie Zhen was extremely resentful towards the Emperor Yuan Hui.</p><br/><p>However, no matter what, he still had to leave. The horses outside had already been prepared, they were only waiting for him to rush to the city gate and leave with Xie Liqing. There were still hundreds of soldiers waiting at the door, not allowing her to be willful.</p><br/><p>Just as Xie Zhen finished speaking, he regretted his words. Silently taking back his hand, he lowered his head and added: “Actually, that’s not what I meant. Hurry up and get up. If you don’t leave now, it will be too late. ”</p><br/><p>It was just after five o’clock, two hours before departure, and they still had some time to talk.</p><br/><p>But what could he do? In such a short period of time, she could not say anything and could not do anything. This only added to her sadness. Yan Yu silently kissed her forehead. He was a man, serving his country was his duty. However, he just couldn’t bear to part with her. He just didn’t want to be separated from her.</p><br/><p>If only he could put her in his pocket and take her away.</p><br/><p>“Little Lamb…”</p><br/><p>His lips moved as he called to her softly.</p><br/><p>Xie Zhen made a sound of acknowledgement before her long eyelashes slightly lifted, sweeping over his chin, feeling a little itchy.</p><br/><p>He made up his mind and said with utmost seriousness, “Wait for me to come back.”</p><br/><p>At this time, Xie Zhen was exceptionally obedient, nodding without thinking, “Alright.” Then, he thought of something and worriedly reminded her, “I have prepared clothes for you all year round, put them in that big box with four kinds of patterns. I heard from my mother that it was very cold at the border, so I brought you a few pieces of winter clothes …” There were also some medicine to treat the pain, and they were all stored inside. “Oh, I heard that the situation there is serious, and I invited four or five doctors to go with you. If you get sick, there must be someone in the vicinity who knows medicine.”</p><br/><p>She had thought of everything, even though she was usually absent-minded and lazy, she was actually very meticulous at critical moments. She even prepared all of the things that Yan Yu would never have thought of.</p><br/><p>Yan Yu replied softly. He buried his head in her hair and didn’t say anything for a long time.</p><br/><p>No matter how reluctant he was, there was a time for him to part.</p><br/><p>It was dawn and the light outside the window was dim. servant maids entered the house to help them clean themselves.</p><br/><p>Yan Yu was dressed differently today. He was wearing a bright armor and a phoenix wing helmet. Xie Zhen stood on top of the embroidered pier and personally adjusted the red tassel on his helmet before saying smilingly: “When Big Brother Xiao Yu wears armor, he finally doesn’t look like a lady anymore.”</p><br/><p>This was deliberately teasing him.</p><br/><p>Ever since he was thirteen years old, he no longer looked like a girl. Instead, he looked like a handsome young man with sharp eyebrows and starry eyes. Furthermore, he had broad shoulders and a broad back. He was tall and thin, how did he resemble a girl? Even when he was young, other people would not treat him as a little girl. Only when she was crippled would they call him big sister Xiao Yu.</p><br/><p>Yan Yu silently glared at her, but she was smiling, making others unable to vent their anger on her.</p><br/><p>When he thought about leaving this little clown, he sighed in his heart, “Little Lamb, don’t talk anymore.”</p><br/><p>Xie Zhen did not understand, “Why?”</p><br/><p>He said, “If you say anything more, I won’t be able to stop myself from taking you away.”</p><br/><p>Xie Zhen glared at him, turned around, and no longer paid any attention to him.</p><br/><p>By the side, Yan Yu had finished tidying up. She also changed into a Mi He blouse made of leno s and a white dress that was scattered all over.</p><br/><p>Xie Zhen saw him to the door, and watched him mount the horse. With his hands behind his back and a smile on his face, he said in a completely obedient, “Big Brother Xiao Yu, you have a safe journey.”</p><br/><p>Yan Yu looked deeply at her, and worriedly warned steward to take good care of her, before calling him over for another round. Only after they had guaranteed the safety of Prince’s wife with their lives, did he harden his heart, and rode his horse to leave.</p><br/><p>The clatter of hooves could be heard as they disappeared into the distance, leaving only a straight back.</p><br/><p>Xie Zhen stood at the doorway for a long time. Only until she could no longer see him did she turn around and return to her room. She lowered her head and laughed, feeling that she had overthought things and was just about to send Shang Yu to Duke Dingguo’s Mansion to invite him in, but she didn’t expect that servant would suddenly say: “Empress, His Highness is back!”</p><br/><p>She was stunned, before she could digest this news, she saw Yan Yu walking in from the second door, and arriving in front of her like a gust of wind.</p><br/><p>Xie Zhen was shocked, “Why did you come back?”</p><br/><p>He didn’t have enough time to explain, so he pulled her by the hand and walked towards the study room in a hurry, as if there was something extremely urgent going on.</p><br/><p>Xie Zhen was unable to catch up to him, so he simply carried her and walked towards the study room in two or three steps.</p><br/><p>He opened the door and went into the inner room. He took a red kite from the top shelf of the bookcase and handed it to her: “I almost forgot to give it to you. Last time I asked you what you wanted for the new year, and when you asked for a kite, I took the opportunity to paste one for you.”</p><br/><p>The kite was not as exquisite as the ones sold on the street, but the skeleton was very sturdy. With one glance, one could tell that he had painted it himself. Every part of it had been personally made by him. The craftsmanship was very rough, but he had done it bit by bit. Xie Zhen’s eyes were a little sore. He looked at him with the kite: “You came back to give me this?”</p><br/><p>He nodded.</p><br/><p>“You don’t want to delay your departure?”</p><br/><p>Recently, he had been smiling quite a bit, and was no longer as devious as before. “Sorry for the delay.”</p><br/><p>However, if he didn’t personally hand the kite over to her, he wouldn’t be at ease.</p><br/><p>Xie Zhen rubbed his eyes, “No wonder I kept looking at you in secret all these while.”</p><br/><p>There was a time when he was alone in the study all day long and wouldn’t let anyone in. Every time she went to look for him, he seemed a little flustered, the table was clean, he asked her what he was doing and said nothing, only lied to her about checking the border.</p><br/><p>Who would believe that?</p><br/><p>Xie Zhen had wanted to investigate this matter thoroughly, but unfortunately, after the incident with the First Prince, his thoughts were gradually divided, and he had forgotten about this matter.</p><br/><p>Yan Yu also forgot, if it wasn’t for the fact that they remembered him when they were about to set off, this kite would probably have been dead by the time he came back.</p><br/><p>He took her hand and led her out of the study and all the way to the front door. He leaned over and kissed her cheek, touching her head. “Take care of yourself.”</p><br/><p>With that, he raised the whip and quickly left.</p><br/><p>Ever since spring, Xie Zhen rarely went out of the mansion. Firstly, it was to avoid the First Prince, and secondly, it was to not be able to lift his spirits.</p><br/><p>The spring red hurriedly thanked, this flower lost and opened again, the whole spring garden flowers did not stop. He seemed to be able to hear the sounds of flowers blooming when he woke up in the morning.</p><br/><p>Xie Zhen made a trip to the crown prince’s residence during this time.</p><br/><p>It was personally invited by the Crown Princess.</p><br/><p>Crown Princess asked her about a few things about the current situation of the house. She asked her if there was anything she was short of, whether the servant in the house were obedient and said that she would be assigned a few more female servant maids s. With enough people at Xie Zhen’s side, he politely rejected her. She knew that the Crown Princess had good intentions, but it was not a good thing to have too many people by her side.</p><br/><p>She sat in the crown prince’s residence for half the afternoon, and in the end, she stood up to leave. However, she met the crown prince, Yan Tao, behind the screen wall in the front courtyard.</p><br/><p>Ever since Xie Zhen knew that Yue Yang had schemed against her, she had always been ungrateful towards him and kept a certain distance away from him. Now that they had coincidentally met, she greeted a few steps away, “Second Brother.”</p><br/><p>Yan Tao should have just returned from the palace, so he was dressed very formally. His brows were a little solemn, and when he saw her, he stopped for a moment, “the sisth sister-in-law.”</p><br/><p>Xie Zhen wanted to leave, but it was not convenient for her to walk past him, so she explained: “Second sister invited me to the Palace for tea, it is getting late, I should go back.”</p><br/><p>Then, ignoring whether he agreed or not, she walked around him and headed for the door.</p><br/><p>Yan Tao suddenly said: “A letter came from the border region, saying that Sixth Brother and Third Master Xie have arrived at Wu Jiang.”</p><br/><p>Xie Zhen suddenly stopped.</p><br/><p>Three months after Yan Yu left, she had yet to receive a letter. She had gone to Duke Dingguo’s Mansion to ask about it, and Madam Leng had not received any letters from Xie Liqing and Xie Rong either. They guessed that the border crisis was serious, so ordinary people did not dare to enter or leave.</p><br/><p>Now that she had news of Yan Yu, she was naturally interested.</p><br/><p>But to ask the Crown Prince…</p><br/><p>She hesitated, then said, “When did you arrive?”</p><br/><p>Yan Tao gave a gentle smile and truthfully said, “The letter said that it was the sixth of the third month, exactly one month ago.”</p><br/><p>She opened her eyes with curiosity and asked impatiently, “Then how are he and my Abba? Have the border diseases spread? Is there any danger? When will they be back? ”</p><br/><p>In the end, she was still a fifteen-sixteen year old girl. She wasn’t calm enough, so she asked whatever she thought of.</p><br/><p>Yan Tao’s eyes revealed gentleness as he answered her questions one by one. “The letter said that they are all well and that the epidemic situation at the borders has already been controlled, so Sixth Brother and Third Master Xie shouldn’t be in any danger. the sisth sister-in-law can rest assured.” Pausing, he continued, “As for when I will return … I’m not sure about that. ”</p><br/><p>When Xie Zhen heard the words, he felt slightly more at ease. But when he heard the words, he felt his mood plummet again.</p><br/><p>Yan Tao couldn’t help but want to touch her head, to comfort her with a few strands of her golden hair.</p><br/><p>It was fortunate that he did not act impulsively. In the end, he only said, “Don’t worry the sisth sister-in-law, since Sixth Brother entrusted you to me, I will take good care of you, and you should also take good care of yourself.” As he spoke, he looked at her face and smiled: “Didn’t the servant advise you to eat more?”</p><br/><p>She’s been a little thin lately.</p><br/><p>Xie Zhen subconsciously took a step back. He felt that what he just said was a little excessive, so he turned his head and said forcefully: “Thank you second brother, I will take care of myself.”</p><br/><p>That was to guard against him.</p><br/><p>Yan Tao shook his head, but did not point it out, “That’s good, Sixth Brother can finally relax after you return.”</p><br/><p>She could not bear to listen any longer, so she pulled her skirt out and said, “I’m leaving.”</p><br/><p>After saying that, she only left him with a slender figure, and disappeared behind the image wall in the blink of an eye.</p><br/><p>Actually, Yan Yu had not thought about entrusting Xie Zhen to the crown prince from the beginning.</p><br/><p>After all, the crown prince had thought about Xie Zhen before. Even though Xie Zhen had already married him, there was no guarantee that Yan Tao would not follow the etiquette of a gentleman. If he didn’t have no other choice, Yan Yu would never ask Yan Tao for help.</p><br/><p>That was why he had placed guards around the prince’s mansion. The crown prince had wanted to put up with his actions, but had been rejected instead. The manor was filled with Yan Yu’s men. If possible, he wished that he could protect her even more.</p><br/><p>Xie Zhen did not know how Yan Yu had thought so much, and it was soon the end of the day. Grand Secretariat Gu’s wife, the Liu Family, had invited many noble women for a feast at home.</p><br/><p>Xie Zhen and Duke Dingguo’s Mansion were also invited.</p><br/><p>Seeing that the spring flowers were about to be lost, Liu Shi then thought to take advantage of this last bit of time to hold a banquet and discuss the ways of rearing flowers with the other wives.</p><br/><p>Since there was nothing to do during this period of time, Xie Zhen would be going.</p><br/><p>It was late spring, so Xie Zhen changed into a brocade dress and wore embroidered shoes with high soles. Two Golden Jade Plum Blossom hairpin were stuck at his temples. servant maids led them to the octagonal pavilion in backyard. From afar, they saw that a lot of people had arrived.</p><br/><p>Some of them were standing under the tree and talking sweetly, while others were sitting on the stone table and playing Go. Most of them were drinking the iced sour plum soup once, enjoying the peonies in the yard. Xie Zhen saw the Princess He Yi and Gu Ruyi who were sitting and talking in the pavilion with a single glance.</p><br/><p>Yan Yao’an looked up and greeted her from afar: “Ah Zhen!”</p><br/><p>In an instant, it attracted the attention of many people.</p><br/><p>Xie Zhen walked forward and sat beside her, “I didn’t expect you to come as well.”</p><br/><p>She had originally thought that this was just a small feast, but she hadn’t expected that she would see so many people today. There were many unfamiliar faces in the crowd that she didn’t recognize. He looked around and coincidentally met with a pair of unkind eyes. She was stunned, she looked at him carefully, only to see that the young lady was dressed in a red blouse made of leno, a blue chiffon dress, and a gold tightrope lantern hairpin. Behind her were a few servant maids servants, they were probably not ordinary people.</p><br/><p>But Xie Zhen had no impression of her at all.</p><br/><p>followed her gaze and asked curiously, “You know Provincial governor Lin’s daughter?”</p><br/><p>The Provincial governor Lin had a total of two daughters, one sixteen and one fourteen. The one in front of him was obviously less than sixteen, and she should be the Second Miss, “You said that she is Lin Huapin?”</p><br/><p>Yan Yao’an nodded his head, his face revealing a trace of unhappiness, “I don’t like the Lin Family, Sixth Brother is annoying them too, don’t bother with them.”</p><br/><p>That look was extremely disgusted.</p><br/><p>Xie Zhen could not help but laugh, it seemed like Yan Yao’an and Yan Yu were of the same heart, no matter what they did, they would stand on the same side.</p><br/><p>They didn’t like Lin Huapin, but that didn’t stop them from liking him.</p><br/><p>There were many ladies surrounding the two of them, watching Lin Huapin and Lin Jinpin play chess.</p><br/><p>The two were both skilled in chess. One of them was in charge of the dark while the other was in charge of the white game.</p><br/><p>Lin Huapin and Lin Jinpin, the two sisters, were famous girls in the capital for their talent. When they heard that Lin Jinpin could paint at the age of three and compose poems at the age of five, they made the Provincial governor Lin view her as a precious gem in her hands. Her two sisters’ reputations were spread far and wide. Before even reaching at her fifteenth birthday, countless people had already stepped over the threshold, wanting to tell one of them. It was a pity that Provincial governor Lin had very high standards of knowledge and thought that since his daughter was so outstanding, she had to marry someone extraordinary. Normal families would not be able to match them.</p><br/><p>Therefore, even though Lin Jinpin had passed the age of sixteen, he still had not told her about the marriage.</p><br/><p>Initially, Provincial governor Lin was not anxious, he thought that his eldest daughter would at least marry a prince. Unfortunately, his plan failed, and his daughter was not yet married, but he himself was unable to protect himself. Now, even if he wanted to propose marriage for his two daughters, others wouldn’t be willing to marry his daughter as a wife.</p><br/><p>Lin Rui was unwilling to give up. Not long ago, he had surrendered to the Crown Prince to show his loyalty, but the Crown Prince refused to accept his offer.</p><br/><p>He was in a hurry at home, but there was nothing he could do.</p><br/><p>The two daughters of the Lin Family knew that the family was sad, and also heard their father scolding Xie Liqing at home. Naturally, they blamed this on the Xie Family, to the point that they disliked Xie Zhen and Xie Xun.</p><br/><p>Now, seeing Xie Zhen and Princess He Yi talking and laughing, she felt even more indignant.</p><br/><p>Lin Huapin raised his eyes and looked at Lin Jinpin, showing a meaningful look.</p><br/>\n</div>"}