{"title": "Chapter 81 - Lord Ping", "id": 81, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-81-lord-ping", "volume_title": "Volume 1", "body": "<h1>Chapter 81 - Lord Ping</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div class=\"title__3i-dQ\"><br/><p>C81 C81: Lord Ping</p><br/><p>His eyes suddenly turned cold, and he slammed his fist against the carriage.</p><br/><p>A loud noise came from the carriage, startling the people outside.</p><br/><p>Wu Bin immediately asked: “Your Highness, what happened?”</p><br/><p>He walked down from the carriage, gritted his teeth and said: “Xie Zhen is gone.”</p><br/><p>Wu Bin was shocked, he immediately lifted up the carriage’s curtain and checked, only to see that there was no one inside, there was not even a trace of a struggle, it was clear that the person who brought Xie Zhen away was powerful in martial arts, and was not a normal person. He hurriedly chased them for dozens of steps, all the way to the mouth of the alleyway. He only saw the passersby, but did not find the slightest trace of them.</p><br/><p>Just then, Wu Ze borrowed a horse and brought it in front of him: “Your Highness, it is already late, we can only borrow one horse.”</p><br/><p>Right after he finished speaking, Yan Yu took the reins in his hand, and jumped up, running back to the road, he did not have time to say a single word to him. Wu Ze stood in place, not knowing what was going on. It was only when Wu Bin came over to tell him that the Prince’s wife had been taken away by someone did he suddenly realize something, and became anxious, “What’s going on? Didn’t you see it? ”</p><br/><p>Wu Bin explained to him the situation at that time. The other party had come prepared and was extremely skilled.</p><br/><p>The two of them looked at each other, then Wu Ze quickly untied the rope tied between the horse carriage and them and jumped on top of the horse carriage. He said to Wu Bin: “I will follow His Highness, go back to the as soon as possible and bring more people with you!”</p><br/><p>Wu Bin nodded and ran in the other direction.</p><br/><p>When Wu Ze was outside the streets, he was already far away.</p><br/><p>He asked around and finally found out that Yan Yu was going towards the lakeside.</p><br/><p>Why go there? Did His Highness know something?</p><br/><p>In actuality, Yan Yu had faintly guessed what was going on and who was behind it. He sped at top speed all the way to the teahouse where he had just met the First Prince. Finally, he galloped downstairs at top speed, only to discover that the teahouse had already closed. The door was shut tightly as a black-robed guard stood in front of the door. Upon seeing him, he stepped forward and greeted respectfully, “Greetings, Sixth Prince.”</p><br/><p>He was not in the mood to beat around the bush and went straight to the point, “Where is my Prince’s wife?”</p><br/><p>The guard said, “Your highness had guessed that you would come here, so he asked me to pass on a message to you. sixth prince Consort has nothing to do, I ask that Your Highness come to Lord Ping’s mansion. ”</p><br/><p>Furious, he bent over and pulled out the sword from the guard’s body, then stabbed at his opponent.</p><br/><p>The guard did not dodge, but received his sword.</p><br/><p>Yan Yu threw down his sword and turned his horse towards the Lord Ping’s mansion.</p><br/><p>When Wu Ze rushed over, just as he was about to go back, he followed him.</p><br/><p>There was some distance between Lord Ping’s mansion and this place. The original half an hour’s journey had been forcefully shortened by half a year’s worth of time. When he arrived at the entrance of the Lord Ping’s mansion, the door was ajar, as if waiting for him to arrive at any time.</p><br/><p>Yan Yu dismounted from his horse and walked into the manor without saying a word.</p><br/><p>The yard was brightly lit with lanterns hanging by the side of the road, but no one spoke a word. The steward led him to the great hall. Inside the hall, the First Prince, Yan Yun, was sitting on a treasure chair.</p><br/><p>“Sixth brother is here?”</p><br/><p>Seeing Yan Yu, he calmly stood up to allow her a seat, and asked the servant maids to bring her a cup of tea.</p><br/><p>Yan Yu did not sit, but stood in front of him expressionlessly, “Duke Ping kidnapped my Prince’s wife, what is his purpose?”</p><br/><p>Yan Yun sat back down on his seat, his sharp eagle-eyes revealed a smile, “Sixth Brother, why are you saying things that are so scary? Hijacking could not be said to be, but it is just inviting the sisth sister-in-law to come to the manor to take a seat. ”</p><br/><p>Yan Yu said coldly: “Where is she?”</p><br/><p>“When I heard Sixth Brother say that the sisth sister-in-law’s body wasn’t feeling well, this duke wanted to invite her into my house. Now that the wangfei is accompanying her, I believe the two of them must have had a pleasant conversation.”</p><br/><p>Hearing this, Yan Yu’s face turned slightly better, but he did not loosen up: “I’ve already sat down, so may I trouble Ping Wang to let me bring her home.”</p><br/><p>Yan Yun laughed instead. He did not respond, nor did he ask the servant to call Xie Zhen. Instead, he invited him to sit and chat.</p><br/><p>“If not for the presence of the sisth sister-in-law, I’m afraid that Sixth Brother would never have set foot in this Lord Ping’s mansion.”</p><br/><p>On the contrary, he was very self-aware and knew that Yan Yu deeply hated and detested him. However, there were some people who had thick skin and had no bottom line. As long as they wanted to achieve their goal, they had to do it no matter what methods they used.</p><br/><p>Yan Yu did not answer.</p><br/><p>He took a sip of tea and continued, “Sixth Brother and I have always been estranged. Why not take this opportunity to open up our hearts and speak? Have I offended you unintentionally?”</p><br/><p>Yan Yu sneered, “Ping Wang is overthinking it, there’s no such thing.”</p><br/><p>If there really was no such thing, would he not call him big brother and only call him the King?</p><br/><p>Yan Yun did not believe it.</p><br/><p>This Sixth Brother was arrogant and aloof. Other than walking a little closer to the Crown Prince, he did not have much contact with the other princes. However, Yan Yun could feel from his attitude that he loathed her.</p><br/><p>Yan Yun had wanted to recruit him again and again, but he remained unmoved. Right now, it was unlikely for him to maintain peace on the surface. The only thing he could do was openly talk and risk his life.</p><br/><p>Thinking about it till this point, Yan Yun did not seem to be in a hurry, and his eagle-like eyes became dim, “Then why is Sixth Brother so distant from me?”</p><br/><p>The First Prince looked like his mother, the Empress of the Guard. He had sharp eyebrows and eagle-like eyes, as well as deep facial features. Crown Prince Yan Tao, on the other hand, was more like a Emperor Yuan Hui.</p><br/><p>Yan Yu explained in a calm manner: “When I returned to the palace, you had already become king, and you were also ten years older than me. I should have been more respectful to you.”</p><br/><p>Nonsense!</p><br/><p>Yan Yun sneered in his heart, but remained unmoved on the surface. “Since Sixth Brother is so respectful to me, why have you continuously rejected my invitation?”</p><br/><p>He tilted his head and said, “My path is different from my big brother’s. I’m not scheming against him.”</p><br/><p>This was already stated very clearly. He was fully committed to working for the crown prince, and no matter how Yan Yun advised him, he would not waver.</p><br/><p>Yan Yun was not a fool, he naturally knew his determination. It was just that he was extremely curious as to where exactly he had offended him, to actually make him harbor such hatred until now. Then, he thought of something and smiled lightly. “If I remember correctly, Brother Spring has to go to the borders, right?”</p><br/><p>He said yes.</p><br/><p>Yan Yun sucked in a mouthful of air and looked at him with thoughtfully. “I wonder how many spring and autumn this trip will be, with the sisth sister-in-law alone at home, do you feel at ease, Sixth Brother?”</p><br/><p>As the voice faded, Yan Yu lifted his eyes and looked over fiercely.</p><br/><p>However, Yan Yun acted as if he didn’t know anything, and used an extremely sparse and ordinary tone, “If Sixth Brother doesn’t feel at ease, why not let me take care of the sisth sister-in-law instead?”</p><br/><p>He gnashed his teeth and said word by word, “No need for Big Brother to worry. I have my own considerations.”</p><br/><p>Yan Yun raised his eyebrows, “Oh? Sixth Brother, don’t think too long. After all, there isn’t much time left.</p><br/><p>It was a naked threat.</p><br/><p>Yan Yu held onto the cloud pattern armrest tightly, as if he would crush it in the next moment.</p><br/><p>Yan Yun took note of his actions, and sized him up, but did not expose him.</p><br/><p>Back then when he met Yan Yu on the cruise liner, he had carried that beautiful girl on his back and had guessed that she was not an ordinary person to him. After the investigation, they didn’t expect the two to be acquainted in Qing Zhou and were neighbors. Since they were childhood sweethearts, their relationship must be deeper than that of an average couple. He didn’t think that his Sixth Brother, who never cared about others, would actually stop drinking wine for her. It seemed like her position in his heart was even more important than he thought.</p><br/><p>It was only because of this that Yan Yun had the thought of using Xie Zhen to threaten Yan Yu.</p><br/><p>As he had planned, he wavered.</p><br/><p>Yan Yun revealed a meaningful smile, all of these were thanks to the Xie Zhen who was accompanying his wife.</p><br/><p>Thinking about Xie Zhen, he thought about her beautiful face.</p><br/><p>She was so beautiful that it was no wonder that the Sixth Brother was so infatuated with her.</p><br/><p>Xie Zhen also didn’t know how he came to the Lord Ping’s mansion.</p><br/><p>She had been sitting well in the car when she was suddenly seized by a man in black. She wanted to cry out for help, but she felt her vision darken. The next time she woke up, she was in Princess Ping’s room.</p><br/><p>She looked at the affectionate and smiling imperial concubine in front of her, still unable to make sense of the situation.</p><br/><p>It was dark outside, but there were lanterns lit up everywhere, as if they had been waiting for her for a long time. Other than this, the table was filled with snacks. Inviting people to be guests in the middle of the night shouldn’t be this way, right? Moreover, she had only seen Princess Pingyang once at the palace banquet, so there was no other interaction between them.</p><br/><p>Xie Zhen wanted to leave, but Ping Wangfei Li Yujun had to think of all sorts of ways to stall her.</p><br/><p>She would ask her about the beauty of the Qing Zhou and she would tell her some interesting stories about the capital, but she did not catch a single one.</p><br/><p>Xie Zhen could not wait any longer, he immediately stood up and walked out: “It’s too late, I will not bother eldest sister-in-law anymore.</p><br/><p>Just as he stepped through the doorstep, he was stopped by two tall and sturdy biddy s outside his door. “Empress Prince’s wife, please stay. My Royal Concubine rarely invites you here.</p><br/><p>Xie Zhen was so angry that he died.</p><br/><p>Is this an invitation?</p><br/><p>This was simply kidnapping!</p><br/><p>But she was currently in someone else’s territory, and without a servant maids by her side, falling out with others would only be disadvantageous for her. She gritted her teeth and turned around to face Princess Ping. “Sis, you didn’t call me here so late at night just to have a chat with me over tea, did you?”</p><br/><p>Princess Pingyang didn’t refute her, but thought that she had to know anyways, so she didn’t hide it from her. “My prince and my sixth brother have something to say, Your Highness wants me to take care of you first.” the sisth sister-in-law, don’t be anxious. Sixth Brother will come to pick you up in a while. ”</p><br/><p>You have something to say? What does it have to be in this way?</p><br/><p>Xie Zhen had a bad premonition and wanted to rush out, but he was too weak.</p><br/><p>She could only sit back down and stare unblinkingly at the door, waiting for Yan Yu to come and pick her up.</p><br/><p>Seeing her act this way, Princess Ping could not help but laugh, “I heard that your highness said that the relationship between the Sixth Brother and the the sisth sister-in-law is very deep. From the looks of it now, it seems that it is true.”</p><br/><p>Xie Zhen her mouth a thin line ignored her.</p><br/><p>After about fifteen minutes, they heard the servant maids say to the biddy outside, “sixth prince is here.”</p><br/><p>She suddenly sat up from the embroidered pier and rushed out anxiously to stand at in the porch. biddy was knocked to the side and muttered while holding onto her arm.</p><br/><p>She didn’t hear him clearly. Her eyes were only focused on the person walking towards her from afar.</p><br/><p>Yan Yu’s face turned ashen, and he walked over with the First Prince by his side.</p><br/><p>Xie Zhen rushed forward recklessly and spread her arms around his waist, “Big brother Xiao Yu, you’re finally here!”</p><br/><p>Yan Yu supported her shoulders, calming himself down, and made a soft sound of agreement.</p><br/><p>Yan Yun retreated to the side, and calmly looked at the two.</p><br/><p>Xie Zhen rubbed his chest a little, afraid that someone was present, he did not say a lot and swallowed everything back down. However, her dependent attitude could not fool anyone. Like a spoiled cat, she dragged her soft voice towards him and said, “Shall we go home?”</p><br/><p>Yan Yu agreed before he raised his head to look at Yan Yun and Li Yujian. Then, without saying a word, he turned around and left.</p><br/><p>Only after returning to the sixth prince Palace did Xie Zhen feel at ease with his feet on the ground.</p><br/><p>She thought of the words that the imperial concubine had told her. After washing her face and rinsing her mouth, she sat on the bedside and asked, “What did the First Prince tell you?”</p><br/><p>Yan Yu paused in the middle of changing his clothes, his expression did not change at all, but he remained calm.</p><br/><p>“Liar!” Xie Zhen did not believe him, if he really did not say anything, would he have to go through so much trouble, cause such a commotion? When she saw that he wasn’t dressed properly for a long time, she went up to straighten his sleeves. “What did he say?”</p><br/><p>“If Yan Yu didn’t tell her, she would glare at him angrily. If you don’t say anything, I’ll go to the side room! ”</p><br/><p>He gave a start, then quickly carried her to bed and dismissed the idea.</p><br/><p>After extinguishing the bedside lamp, the room quickly fell into darkness. Xie Zhen did not like sleeping with the light on, it would make her unable to sleep, so there was no light in the room. Even the small oil lamp on the table was extinguished, and only the moonlight outside the window could be seen, shining down upon the room with a silver sheen.</p><br/><p>Xie Zhen originally thought that he would be frank with her, but unexpectedly he only said, “Sleep.”</p><br/><p>His tone was tired.</p><br/><p>Xie Zhen heard and was about to climb down from his body, but he reacted fast, he flipped his body and pressed her down, then stared at her shining eyes in the darkness, “Where are you going?”</p><br/><p>She blinked. “Sleep in the side room.”</p><br/><p>She hadn’t slept in the side room for a long time, and the pillow and bedding inside were all empty. She didn’t really intend to sleep, she just wanted to force him to tell her the truth.</p><br/><p>Yan Yu was silent for a moment, then bit on her lips helplessly, “He asked me when I was going to the border entrance, how many soldiers did I have.”</p><br/><p>Xie Zhen felt that it was not that simple, his mind spun, and he reacted quickly: “Did he use me to threaten you?”</p><br/><p>She still had some understanding of the current situation of the imperial court. The First Prince and the crown prince did not get along well, and the imperial court was already divided into two factions. Yan Yu was the crown prince’s man, but it was hard to ensure that the First Prince would not be moved by the military power in his hands. If Yan Yu made a contribution to the border trial this time, it would be like adding wings to a tiger to the crown prince. When the First Prince was threatened, he would naturally not sit idly by and wait for death.</p><br/><p>Using her to restrain Yan Yu was indeed a good method.</p><br/><p>Yan Yu did not speak, but she knew that her guess was right.</p><br/><p>“What did he threaten you with?”</p><br/><p>Yan Yu paused, “He wants me to serve him.”</p><br/><p>“If you don’t agree, will I be in danger?”</p><br/><p>He held her close and said loudly, “I won’t let you be in any danger.”</p><br/><p>Xie Zhen was breathless from his embrace. She thought about it very simply and asked easily, “Then if I go with you to the border trial, will I be okay?”</p><br/><p>Stunned, he propped himself up and looked at her. “That place is desolate and desolate, without a single blade of grass. In the past, you would only suffer.”</p><br/><p>Xie Zhen said while beaming: “Will you protect me properly?”</p><br/><p>He nodded without thinking.</p><br/><p>“Then I’m not afraid of suffering.”</p><br/><p>His chest was filled with her smile. At this moment, he was extremely protective of her. His arms wrapped around her and pressed his face against hers. For a long time, he didn’t say a single word.</p><br/><p>Ever since Xie Zhen said that she would go to Wu Jiang with him, Yan Yu seriously thought about the possibility of doing so.</p><br/><p>It turned out that it still didn’t work.</p><br/><p>Putting aside the fact that the water and soil around the border were not suitable for her, her body was delicate and precious, making it impossible for her to live in such a place. The worst part was that after the battle, thousands of people had died in the city. Some of the corpses had not been disposed of and had caused some diseases. The spread of the disease was extremely fast, and it was said that hundreds of people had already died. What if she had followed and caught the same disease?</p><br/><p>Yan Yu couldn’t let her take the risk.</p><br/><p>However, if she stayed in capital, it would also be dangerous.</p><br/><p>In the past few days, Yan Yu had thought of countless ways, but when he went missing, he could not think of a foolproof plan.</p><br/><p>After the snow melted, the weather became warmer every day. Soon, he would be able to take off his winter clothes and change into a spring shirt. Which is to say, there were only around ten days left before Yan Yu’s departure.</p><br/><p>Xie Zhen heard about the situation of the Wu Jiang from him, but she never thought that it would have reached such a state of suffering that she didn’t want to go there, what about him? Where’s father and brother? Would they catch a disease?</p><br/><p>The more Xie Zhen thought about it, the more worried he became. He couldn’t bear to see Yan Yu in a difficult situation, so he said to him obediently: “Send more people to protect me.</p><br/><p>If he really could guard against Yan Yun so easily, then he would have been hibernating for nothing.</p><br/><p>Later on, it was the crown prince who noticed his abnormality.</p><br/><p>He only realized what had happened after asking.</p><br/><p>Yan Tao frowned, “Big brother, you are being unreasonable.”</p><br/><p>It wasn’t right, but they could do things that weren’t right, so who could do anything to them?</p><br/><p>Yan Tao thought for a while, and finally said: “Don’t worry, go to the border trials, leave a few more guards in the palace, I will send a few more people to help you if anything happens to your residence. the sisth sister-in-law is the princess concubine that you retrieved from the sect. No matter how rampant the Ping Wang was, he wouldn’t dare to hurt her. When it really gets to that point, I will inform the father that I do not believe that he will not let them go. ”</p><br/><p>Even though he said that, but if he was not by Xie Zhen’s side, how could he be at ease?</p><br/><p>Thinking about it, he could only do it according to Yan Tao’s method. He had left his own twelve guardians to protect Xie Zhen, and the moment something happened, he would immediately bring her back to the Duke Dingguo’s Mansion. The twelve guardians was the most outstanding guard trained by the palace. When Yan Yu faced the Western Yi, the Emperor Yuan Hui gifted these people to him, and now he had these people protect Xie Zhen. In addition, there were nearly a hundred guards outside the mansion, all spread out in the dark.</p><br/><p>No matter how wild the Ping Wang was, he wouldn’t brazenly come to the prince’s mansion to rob them. These people were more than enough to fend them off for a while.</p><br/><p>After everything was arranged, it was soon the day before he left.</p><br/><p>That night, Yan Yu did not sleep at all. He lied beside Xie Zhen and had a lamp light in his room. He just watched her quietly and watched her for the whole night.</p>\n</div>\n<div style=\"max-width: 870px;margin: 5px auto;background: repeating-linear-gradient( 45deg, #fff6cc, #fff6cc 5px, #f3ecc7 5px, #f3ecc7 10px );\">\n<!-- Composite Start -->\n<div id=\"M562762ScriptRootC864255\">\n</div>\n<script async=\"\" src=\"https://jsc.mgid.com/m/e/media.boxnovel.org.864255.js\"></script>\n<!-- Composite End -->\n</div>\n<hr class=\"chr-end\"/>\n<div class=\"chr-nav\" id=\"chr-nav-bottom\">\n<div class=\"btn-group\">\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/the-royals-cute-little-wife-chapter-80-part-2-birthmark-part-2\" id=\"prev_chap\" title=\"Chapter 80 part 2 - Birthmark (part 2)\">\n<span class=\"glyphicon glyphicon-chevron-left\"></span>\n<span class=\"hidden-xs\">Prev Chapter</span>\n</a>\n<button class=\"btn btn-success chr-jump\" type=\"button\">\n<span class=\"glyphicon glyphicon-list-alt\"></span>\n</button>\n<a class=\"btn btn-success\" href=\"http://boxnovel.org/the-royals-cute-little-wife-chapter-82-feast\" id=\"next_chap\" title=\"Chapter 82 - Feast\">\n<span class=\"hidden-xs\">Next Chapter</span>\n<span class=\"glyphicon glyphicon-chevron-right\"></span>\n</a>\n</div>\n</div>\n<div class=\"text-center\">\n<button class=\"btn btn-warning\" data-chr-id=\"329984\" id=\"chr-error\" type=\"button\"><span class=\"glyphicon glyphicon-exclamation-sign\"></span> Report chapter\r\n                        </button>\n</div>\n<div class=\"bg-info text-center visible-md visible-lg box-notice\">\r\n                        Tip: You can use left, right, A and D keyboard keys to browse between chapters.\r\n                    </div>\n</div>"}