{"title": "Chapter 91 - Annoying", "id": 91, "volume": 1, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-91-annoying", "volume_title": "Volume 1", "body": "<h1>Chapter 91 - Annoying</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Royal’s Cute Little Wife / C91 Add To Library C91 C91: Annoying</p><br/><p>There were always people visiting An Wang’s Mansion.</p><br/><p>Without exception, all of them came for congratulating him.</p><br/><p>There were important members of the imperial court, as well as royal sons. Two or three princes often come to An Wang’s Mansion, to celebrate or to scrounge food. One time, the Third Prince and the Fourth Prince came and insisted that Xie Zhen go over to accompany them. Although it was a sister-in-law, for the brothers was drinking wine, it was still a little inappropriate for her. Yan Yu protected her very well, and he did not even let them see her face, using the excuse that Xie Zhen was not feeling well, and only left the two of them to eat lunch, before sending them back.</p><br/><p>Since he had come to offer his congratulations, he could not come empty-handed. There were those who offered precious antiques, as well as those who gifted rare birds and strange beasts. However, most of them were gifts to their beautiful concubines and singers.</p><br/><p>Without exception, Yan Yu sent all those who sent women back, to the point where he did not even let them in.</p><br/><p>The officials went back resentfully, somewhat puzzled.</p><br/><p>In the end, no one knew how it spread, but it actually spread word of the sixth prince’s fear of outsiders. The commoners spread word that the An Wang was being controlled by the An Wang Fei and that they did not even dare to touch the fingers of other women. Even the women who sent them home were sent back home. Some said that the An Wang was a fearful person, and some said that the An Wang was a good man that was hard to come across in a hundred years, but without exception, they all thought that the An Wang Fei was a fierce woman.</p><br/><p>After Xie Zhen heard this, he became even angrier, complaining to Yan Yu: “How did I become a woman? How am I fierce? I am so beautiful! ”</p><br/><p>In the house, the servant maids was all holding back his laughter. He had never heard of someone praising him like this.</p><br/><p>Yan Yu did not laugh, and earnestly nodded his head: “I also feel that what they said is not true.”</p><br/><p>She sat on his lap and hugged his neck as she deliberately asked, “Why don’t you want those concubines? I took a look that day and it was pretty good. ”</p><br/><p>He allowed her to make a scene, but when he heard her words, he only frowned, “Did you see it?”</p><br/><p>She nodded. “Uh-huh.”</p><br/><p>He said, “I don’t care.”</p><br/><p>Xie Zhen thought for a while, before confidently adding, “But not as beautiful as me.”</p><br/><p>His lower his eyes looked at her, and his thin lips curved into a smile that was not a smile, and within his mischievousness, there was even a little bit of malice.</p><br/><p>But Xie Zhen was right.</p><br/><p>She already had an appearance of a natural disaster, beautiful without flaws. Her eyes were especially bright, and her smile was even brighter than the sun in the sky. Furthermore, Yan Yu had just reunited with her a few days ago, and in these two days, Yan Yu had not let her go. Every night, he would catch her under his body and love her over and over again, causing her to change greatly, as if she was a lot more beautiful than before.</p><br/><p>Yan Yu naturally wrapped his arms around her waist and raised his eyebrows, not saying a word.</p><br/><p>She was unwilling to let him go, and held his face so that he could look at her. “Big brother Xiao Yu, do I look good?”</p><br/><p>Yan Yu met her gaze, and pursed his lips: “Who could be like you …”</p><br/><p>Before she could finish, she kissed him on the lips and asked with a smile, “Am I not beautiful?”</p><br/><p>He was silent, his eyes moving.</p><br/><p>Since he wanted to see if she would make any further moves, he didn’t say anything.</p><br/><p>Just as expected, Xie Zhen laid on his face and seriously chewed on his mouth, trying to stick her tongue in and tease him. She insisted on asking a question, “Big Brother Xiao Yu, are they beautiful or am I beautiful?”</p><br/><p>All the girls loved to ask these nonsensical questions, over and over again, never tiring.</p><br/><p>Yan Yu supported her head, turning the tables and tasting the taste of her mouth before he said: “You look good.”</p><br/><p>She giggled and rubbed it against his neck, like a kitten.</p><br/><p>*</p><br/><p>The weather was getting hotter and hotter. It wasn’t even summer yet, but one could already hear the croaking of frogs from the backyard’s pond.</p><br/><p>Xie Zhen was so noisy that he couldn’t sleep at night. The next day, Yan Yu got the servant to catch all the frogs in the pond.</p><br/><p>She didn’t like the sticky feeling on her body. She took two baths a day, one in the morning and one in the evening.</p><br/><p>However, Yan Yu kept making her sticky.</p><br/><p>In this aspect, she could not resist at all. If she had been able to resist in the beginning, she would have been completely taken away by him in the end.</p><br/><p>Xie Zhen was very angry, thinking that he really could not control himself, and wanted to restrict the number of times he spent every night. But every time they talked well during the day, and at night he would change his mind, play the rascal, and lie to her for all sorts of reasons. Xie Zhen wanted to scratch his face, “You’re not keeping your promise!”</p><br/><p>Yan Yu held her hand, and stole a breath on her face, “I’ve stayed at the border for a year, can’t I come back and touch my own woman?”</p><br/><p>Xie Zhen fumed: “But I’m very tired.”</p><br/><p>He immediately put his hand on her waist. “Let me massage you.”</p><br/><p>A cat crying and a mouse showing mercy!</p><br/><p>Bad intentions!</p><br/><p>In an instant, all sorts of evil words popped out from his heart. Xie Zhen pushed him away and said, “No, no!” Who knew what would happen if he were to rub it? The last time he had said he would rub her, he had rubbed her clothes, but they were gone, and in the end her waist ached so much that she could not even hit him, and could only stare at him with pitiful eyes.</p><br/><p>She wouldn’t be fooled now!</p><br/><p>She wanted to take a bath, so Shuang Yu brought the hot water in and poured it into the tub. She dabbed at the temperature. Not too hot, not too cold. She chased Yan Yu out of the concubine and worriedly reminded him, “You’re not allowed to come in.”</p><br/><p>Yan Yu stood outside the door, looking at her cautious little face, he didn’t say anything.</p><br/><p>Xie Zhen had even told the two servant maids s to watch him and not let him in. Only then did he feel at ease to close the door and enter the house to take off his clothes behind the screen. Several marks on her body had yet to disappear and he had added a few more marks … In fact, Xie Zhen did not reject doing that thing. It would feel a little painful at the beginning, but once she got used to it, she would be able to experience joy from it.</p><br/><p>But he couldn’t think about it all the time!</p><br/><p>He was refreshed. She was the one who suffered.</p><br/><p>Xie Zhen’s mind raced as he sat down in the bathtub and dripped two drops of nectar, then he closed his eyes and rested. She wanted to take the opportunity to rest for a while. Since it was a hot day outside and she was covered in sweat, she might as well stay in the water for a while longer. Without realizing it, she fell asleep. She closed her eyes and dozed off.</p><br/><p>In her dreams, there was someone who licked her lips and even carried her in his embrace. She thought she had dreamt of that big dog again, but she didn’t expect that the moment she opened her eyes, Yan Yu was already sitting opposite to her.</p><br/><p>“…”</p><br/><p>When did he come in? She was saying why it felt like the bath barrel had become crowded…</p><br/><p>Before Xie Zhen could say anything, he leaned over to cover her mouth and swallowed all her words.</p><br/><p>*</p><br/><p>The sound of the water splashing could be heard clearly by the servant maids standing outside.</p><br/><p>The two servant maids s were both young servant maids s and they were around thirteen to fourteen years old.</p><br/><p>An hour later, An Wang Fei was carried out from An Wang and the two of them were dressed neatly. If they were not standing here, it would be impossible to guess what was going on inside.</p><br/><p>However, An Wang Fei’s white and tender cheeks flushed red. She closed her eyes and shrank into An Wang’s embrace, her long and perky eyelashes trembled, looking like two small fans scratching her heart, causing one’s heart to itch. After An Wang carried An Wang Fei and left, the two servant maids entered the house to pack their things. When they saw the scene inside, they were stunned.</p><br/><p>More than half of the water in the tub had spilled out, and the entire room was wet with it.</p><br/><p>It was enough to see what had just happened here.</p><br/><p>The two of them buried their heads into their chests, and cleaned up the mess with a blush. They thought to themselves that the An Wang and the An Wang Fei were really too lacquered, and couldn’t even bear to part after taking a bath for such a short amount of time …</p><br/><p>But Xie Zhen was very angry!</p><br/><p>Because of this, she did not take care of Yan Yu for an entire night.</p><br/><p>No matter what kind words Yan Yu said, she did not believe him. This was too much. Was it over? He didn’t even let her take a bath!</p><br/><p>During dinner, Xie Zhen hurriedly finished a bowl of Lotus Seed Eight Treasures Soup, then put down his chopsticks. He went to his room to wash up, then wrapped himself in his blanket and prepared to sleep. Not long after, Yan Yu also came over, and wanted to pull away her blanket to look, but who knew that this young lady was so stubborn, and did not allow him to underestimate her.</p><br/><p>She shouldn’t.</p><br/><p>“Little Lamb?”</p><br/><p>She still did not agree.</p><br/><p>Yan Yu waited at the side for a long time, before he finally got rid of her clothes. Only then did he realise that she was still wearing her daytime clothes, which was so warm that her small face was covered in sweat and even her neck was wet. Yan Yu wiped the sweat off her forehead with his hand, “Are you planning to sleep like this?”</p><br/><p>She turned to face him with the back of her head, determined to ignore him.</p><br/><p>He lay down beside her and put his arm around her. “Did I hurt you?” he asked.</p><br/><p>Not really…</p><br/><p>He played with her slender and soft fingers. After thinking for a long time, he couldn’t think of any other reason that made her angry with him. her mouth a thin line asked: “You don’t like me touching you?”</p><br/><p>When he thought of this reason, his expression immediately turned ugly.</p><br/><p>Xie Zhen moved his hand away and inched it towards the corner. Finally, he opened his mouth: “It’s so hot, don’t stick close to me.”</p><br/><p>He had learned act shamelessly at the border, so his skin was much thicker than before. While avoiding her, she stuck close to her, “Then tell me, why are you angry?”</p><br/><p>She lifted her foot and kicked him onto the ground, stopping him from moving any further. “Why did you come in when I was taking a bath today?”</p><br/><p>“I called you from outside, you shouldn’t. I thought something had happened to you, so I went in to see you.”</p><br/><p>She had fallen asleep and hadn’t heard him call her.</p><br/><p>Her tone relaxed a little. “Then why are you, why are you in the bath barrel …” Halfway through his words, he glared fiercely at him.</p><br/><p>Yan Yu said, “You don’t like it?”</p><br/><p>She fumed, “The servant maids heard it!”</p><br/><p>Furthermore, when they went in, they would definitely see the mess inside. How could she establish her dignity outside the servant?</p><br/><p>So it was because of this, Yan Yu promised quickly, “Then I can’t let them stand outside the door next time.”</p><br/><p>“…”</p><br/><p>Xie Zhen had never seen such a shameless person.</p><br/><p>She was angry with him. She had been ready to argue with him, but he had easily cut her off and she had nowhere to vent. She pointed at the floor and said, “You sleep here tonight. You’re not allowed to come up!”</p><br/><p>Only then did Yan Yu realize the seriousness of the situation, and immediately assured her that he would not be intimate with her in front of others, and that no one else would listen to him either. If any ignorant servant maids were to speak out, he would punish them severely. Hearing his words, Xie Zhen was satisfied, she raised her pinky and played with him, “Can’t you keep it up forever …”</p><br/><p>Yan Yu hooked his fingers around her pinky and covered her pink lips before she finished speaking.</p><br/><p>*</p><br/><p>Ten days had passed since the last palace banquet.</p><br/><p>After returning from the palace banquet, Yan Yu had steward Zhao hand Cui Shan over to the imperial guards. The guards led Cui Shan back to the palace and imprisoned her. Cui Shan was just a small servant maids, how could he have seen such a scene? He was immediately scared silly and continuously kowtowed to Yan Yu, telling him to spare her life.</p><br/><p>Yan Yu remained indifferent the entire time.</p><br/><p>Cui Shan was brought by the guards to the prison. When she heard that someone was going to interrogate her tomorrow, she was so scared that she could only cry, and couldn’t even speak properly.</p><br/><p>She was someone who had once met the First Prince when they were out buying vegetables. That person knew that she was from the sixth prince Palace, so he had asked if she was willing to work for the First Prince. The conditions offered by the other party were too tempting. It was enough for her to spend several generations of her marriage without having to be a servant or a servant. Thus, she agreed without much resistance. She thought that at most, they would just die if the matter was exposed, but now it seemed that even death wouldn’t be that easy. There were all sorts of torture instruments hung on the wall, and there were even some leftover chunks of meat.</p><br/><p>She had wanted to give away the First Prince before she went up to Xing, but before she could see the next morning’s sun, her tongue had been cut off at night by a knife and she could not hold on for much longer.</p><br/><p>The next day’s inspection could also be described as biting one’s tongue and committing suicide.</p><br/><p>The fact that someone had died in prison was heard by the Emperor Yuan Hui. Emperor Yuan Hui sat on the dragon throne and thought for a long time.</p><br/><p>Actually, on the night of the palace banquet, Yan Yu had already told him that he suspected that the First Prince had done it. He never thought that someone would actually make a move that night. After killing the servant maids, they fled back to the Lord Ping’s mansion and never came out again.</p><br/><p>Emperor Yuan Hui rubbed his glabella. That servant maids didn’t say anything, but Boss couldn’t wait to kill him. Could it be that it really had something to do with him?</p><br/><p>It could only be explained with guilt.</p><br/><p>Why did Yan Yun want to kidnap the An Wang Fei? Was it to win over Old Sixth, or to force him into a corner?</p><br/><p>If it was to rope him in, why would he, as the First Prince, try to rope in his younger brothers?</p><br/><p>His heart was unfathomable.</p><br/><p>The more Emperor Yuan Hui thought about it, the more he felt disheartened. He then called a few guards to continue watching the First Prince’s every move.</p><br/><p>When the news reached Yan Yu’s ears, he seemed to have already expected this to happen, and was not the least bit surprised.</p><br/><p>However, Xie Zhen was the one who was furious, he didn’t need to think to know what had happened. “It must be the First Prince who killed him, he’s afraid that Cui Shan will give him up!”</p><br/><p>Yan Yu declined to comment.</p><br/><p>Seeing that he did not react, she turned her head and asked curiously, “You knew he would do this? If we have no physical evidence, then we will suffer a loss. ”</p><br/><p>Yan Yu smiled and continued to kite for her. “If you can even think of the First Prince, why couldn’t father think of that?”</p><br/><p>He was clear about their every move. Even though Emperor Yuan Hui was old, he could not be underestimated.</p><br/><p>Xie Zhen seemed to understand what she meant. She thought for a while, then sat beside him and asked: “So, the First Prince is admitting it without fighting?”</p><br/><p>Yan Yu scratched her nose, “You’re right.”</p><br/><p>Xie Zhen bit her lips and smiled. She finally relaxed.</p><br/><p>Right now, there was no need for them to do anything. They could just hold on and not move. The first person who would not be able to sit still would definitely be the First Prince. It would not be hard to find out that the First Prince’s ambition was so strong that he did not even need to fight with the crown prince. At that time, Emperor Yuan Hui would be the first to not let him off.</p><br/><p>When he thought about the First Prince’s actions, Yan Yu’s eyes darkened.</p><br/><p>As soon as he lost his spirit, the bamboo shoot pierced into his finger and a bean-sized drop of blood quickly flowed out.</p><br/><p>Xie Zhen quickly threw the bamboo cane aside and carefully checked the wound on his hand. Luckily, the wound wasn’t too deep, she subconsciously stuck his finger into her mouth and licked the blood droplets off of it. The taste was a little fishy and a little salty, it wasn’t tasty at all.</p><br/><p>Yan Yu was startled, she only felt a warm and small tongue lick her tongue. Before he even had the chance to feel the taste, she had spit it out and used her handkerchief to wrap him up. Then she looked up at him, “Why are you so careless? Will we still be flying kites today? ”</p><br/><p>A year ago, the kite he gave her had already turned into a tidal wave and it couldn’t fly again. Since the two of them had nothing better to do at home, he told her that he would make her a new one.</p><br/><p>Yan Yu shook his head, “It’s just a small wound, nothing serious.”</p><br/><p>Saying so, he took the kite skeleton. Since he was just short of the last bit, he would finish it today. Before the spring ended, he could take her out of the city to fly a kite.</p><br/><p>So he sat on one side with the kite, and she watched.</p><br/><p>Once in a while, when the batter touched his face, she would wipe it off with the handkerchief.</p><br/><p>Xie Zhen was focused on watching him paste the kite when he suddenly used his index finger to wipe her face. She immediately jumped far away, “You — —” After speaking, she felt that her face was sticky, she wiped it with her hand, frowned her little face and said bitterly, “So dirty … Big Brother Xiao Yu is so annoying! ”</p><br/><p>Yan Yu held up the kite with the picture of a big cat. The big cat’s tail swayed in the wind, looking extremely energetic. He spread his hands and smiled at her. “Do I hate it? “Come and hug me.”</p><br/><p>She turned her head. “No!”</p><br/><p>If the mountain doesn’t come, then so be it.</p><br/><p>Therefore, Yan Yu extended his arm and scooped her up into his embrace, then used his dirty hands to rub her white face, “Do you still find me dirty?”</p><br/><p>She nudged him with her arms, trying to make a different tune: “Dirty, dirty, dirty to death.”</p><br/><p>He said, “Oh, then do you want my f * cking kite?”</p><br/><p>She said nothing.</p><br/><p>He raised his eyebrows and frowned, “If you don’t want it, I’ll have the servant take it and burn it.”</p><br/><p>She put her hand on his waist, then wrapped her arm around his strong waist and hugged him.</p><br/><p>…</p><br/>\n</div>"}