{"title": "Chapter 108", "id": 108, "volume": 2, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-108", "volume_title": "Volume 2", "body": "<h1>Chapter 108</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Royal’s Cute Little Wife / C108</p><br/><p>Add To Library C108 The letter was written by Zhong Shang, and it was written with a great deal of effort, that caused the entire piece of paper to be soaked in ink.</p><br/><p>Yan Yu gently placed Xie Zhen on the bed, and quietly studied the letter under the light of the lamp. He read for a long time, thinking about something. Finally, he placed the piece of paper on top of the candle, and the tongue of flame slowly swallowed the letter, burning it dry in an instant. The remaining ashes fell to the ground, just like Gao Xun’s life. He was so hot when burning, but because he was burnt too quickly, he died too early, only leaving behind a strand of green ash.</p><br/><p>He called the servant maids over to clean the floor and had someone heat up the place with hot water. He then helped himself to clean the handkerchief before sitting down on the bed and wiping Xie Zhen’s face. She was crying so hard that even when she slept, she started crying. She kept muttering, “Don’t die, don’t die …”</p><br/><p>Yan Yu used a handkerchief to wipe the tears at the corner of her eyes, and gently caressed her swollen eyes, “Are you feeling sad like this?”</p><br/><p>As he spoke, he tightly held onto the handkerchief in his hands.</p><br/><p>Even the veins on the back of his hands could not help but bulge out.</p><br/><p>Xie Zhen couldn’t hear his words. She cried out sadly as her tiny body curled up into a ball.</p><br/><p>As she cried, Yan Yu wiped her tears.</p><br/><p>In the end, he could not do it anymore. Seeing that he was about to burst his eyes from crying, he simply took off his shoes and went to bed. He covered her with his arms and slowly licked away the tears that were flowing out of her eyes. His voice was hoarse, as if he was trying his best to suppress something, “Don’t cry, Little Lamb, don’t cry like that in front of me.”</p><br/><p>Even if it’s because of Gao Xun, don’t cry like this …</p><br/><p>Thinking of Gao Xun, he couldn’t help but clench his fists.</p><br/><p>This bastard was truly despicable! Did he die to make them feel guilty? Did he really think that Xie Zhen could remember him for the rest of his life?</p><br/><p>If he knew about this earlier, he might as well have ruthlessly beaten him up on the day he went to the Lanling Mountains to wake him up!</p><br/><p>Yan Yu bent over, staring at the little girl who was gradually falling asleep, and pecked her on the lips. It was as if he was comforting her, yet also possessing her. He gradually descended downwards, kissing every place he passed by, branding himself on top of her. This place was his, and that place was also his.</p><br/><p>The next morning, Yan Yu woke up early and sent servant to deliver the letter. The letter described Gao Xun’s achievements in detail, including his title and rank behind him.</p><br/><p>The corpses of the dead soldiers were being brought back in batches, but there was no sign of Gao Xun.</p><br/><p>Zhong Shang sent a letter back to the Qing Zhou, saying that he would be returning to his homeland after death.</p><br/><p>Three days later, everything was ready.</p><br/><p>Xie Zhen gradually accepted the news that Gao Xun had left. Although he was no longer sad, he was still a little depressed. She thought for a long time before deciding to give the jade hairpin to Yan Yu, “You should also take this hairpin back to Qing Zhou … He will be buried together with big brother Gao Xun. He thought that this was my hairpin, but in reality … Since he likes it so much, I’ll just give it to him. ”</p><br/><p>Furthermore, she knew that Yan Yu was not happy to see this hairpin.</p><br/><p>Every time she picked up the hairpin, his eyes would become gloomy and unreadable. Actually, he did mind … It was just that Gao Xun had just left, he was not willing to care too much about it.</p><br/><p>Xie Zhen thought about it seriously, and felt that it was not a good idea to stay, which was why he made the decision.</p><br/><p>Yan Yu took it and called Wu Bin over, “Take this and Gao Xun’s clothes back to the Qing Zhou, if his family asks … Just say it’s his personal item. ” His family would understand.</p><br/><p>Wu Bin replied as he went down to settle some matters.</p><br/><p>The only two people left in the room were Xie Zhen and Yan Yu. The servant maids had been separated from them, for the past few days, Xie Zhen did not like being served by others. However, when there was no one around, her heart would become empty, as if she was the only one left in the universe.</p><br/><p>Whenever this happened, she would always like to hide in Yan Yu’s embrace.</p><br/><p>Recently, she had become a little annoying. She was probably scared, afraid that if he went to the battlefield, she would suffer the same fate as Gao Xun. It was nothing during the day, she just liked to look for him. At night, she thought that when he was asleep, she would secretly wrap herself around him, quietly embrace his waist, and put her face on his back and ask him: “Will Big Brother Xiao Yu also die?”</p><br/><p>Yan Yu rolled over and pressed her down. In the dark night, a pair of eyes gleamed: “I won’t die. As long as you are here, I won’t die. ”</p><br/><p>How could he bear to leave her alone?</p><br/><p>He was already prepared to spend the rest of his life with her. They had not yet given birth to children, so their deaths were not worth it!</p><br/><p>But Xie Zhen did not feel comforted at all. Her words were direct and direct, “But you still want to go to Lan Ling, right?”</p><br/><p>He didn’t say it, but she knew it.</p><br/><p>She knew all the things he had secretly prepared these past few days. He wanted to go to Lanling. Even though he knew she was worried, he still wanted to go.</p><br/><p>Yan Yu froze and didn’t know how to explain it to her, “I …” He was at a loss for words. He didn’t want to tell her because he was afraid that she would be worried and even more afraid that she wouldn’t be able to take it all at once. Actually, this trip to Lan Ling was something he could not escape from. He still had the two hundred thousand elite soldiers of the Da Jing in his hands, and if he did not go, then he would ignore the Da Jing.</p><br/><p>Moreover, Yan Yun had not been eliminated, how could he be at ease?</p><br/><p>When he thought of that person, his eyes went dark.</p><br/><p>This time, he had to personally understand Yan Yun. After waiting for so long, he couldn’t wait any longer. His parents’ death and Gao Xun’s death, both had to do with that person!</p><br/><p>Seeing that he did not say anything, Xie Zhen went straight to the point: “When are we leaving?”</p><br/><p>He was silent for a moment, then couldn’t help holding her hand. “Three days later.”</p><br/><p>So fast!</p><br/><p>Xie Zhen was angry, he was leaving three days later, but he did not even let her know? If she didn’t, was he going to keep it a secret? When she woke up on the day he left, did she discover that he had disappeared? Xie Zhen pushed him away and asked, “Can I not go?”</p><br/><p>In her eyes, Lan Ling had become a dangerous city, and no one would have a good ending if they went there. She didn’t want anything to happen to Yan Yu, so she privately thought that the crown prince would be enough.</p><br/><p>But it was no use, it was only her own opinion. Men and women were born with differences in certain opinions.</p><br/><p>After a long while, Yan Yu finally said, “Little Lamb, I must go …”</p><br/><p>Afraid that she would not understand, he explained the whole situation. The conflict between him and Yan Yun was unresolvable, and would only grow more intense. Either you die, or I live, and if he doesn’t take this opportunity to finish it, then we won’t have such a once-in-a-lifetime opportunity in the future. ” I will personally kill him, avenge my parents, and seek justice for the people of Da Jing. ”</p><br/><p>Xie Zhen knew that she could not persuade him, so she did not say anymore and turned around to face him with the back of her head.</p><br/><p>“If something were to happen to Big Brother Xiao Yu … I won’t cry. ”</p><br/><p>Unable to speak that word, she grumbled in frustration.</p><br/><p>Yan Yu held her from the back, his big hands covering her small hands, “If you keep on crying, you will tear your eyes apart, you are not allowed to cry.”</p><br/><p>She did not reply, and after a while he said again, “Don’t worry, we still need to give birth to a little lamb, how can I not come back? Yan Yun’s army is already at the end of the road. We will be able to reunite in at most two months. ”</p><br/><p>Lamb?</p><br/><p>She blushed and buried her head in the quilt. “No!”</p><br/><p>How shameless, she was clearly angry, who wanted to talk about having a baby with him?</p><br/><p>Just as Yan Yu’s hand touched the soft little bunny on her chest, she slapped it back, “Don’t touch me …” The voice was angry and coquettish, adding a few hints of seduction.</p><br/><p>For Gao Xun’s matter, Yan Yu had not touched her for a few days, and now that he was leaving, how could he endure it?</p><br/><p>When she wouldn’t touch it, he would eat her earlobes with his mouth.</p><br/><p>Her whole body went limp from the food, and she stared at him with her watery eyes.</p><br/><p>The servant maids outside knew what was going on. He pretended that he did not hear anything, as his cheeks flushed red from embarrassment. The night went on for a long time, and after half the night, he still did not sleep. Xie Zhen’s voice turned hoarse, and with a helpless crying voice, he begged Yan Yu to stop.</p><br/><p>Afterwards, he asked for hot water to coax her, only stopping when the sun was about to rise.</p><br/><p>When Yan Yu left with the two hundred thousand soldiers, Xie Zhen did not send him off.</p><br/><p>He led the way out of the city, past the moat, and couldn’t help looking back.</p><br/><p>That girl was ruthless, she really was invisible. She should be scolding him in the An Wang’s Mansion at this time. When he left the house this morning, he promised her that he would be back in two months. She did not believe him, and she tilted her head, almost provocatively, and asked, “What if you don’t come back?”</p><br/><p>He pressed his forehead against hers and met her eyes. “Then I will be at your disposal.”</p><br/><p>She pursed her lips and pushed him out of the room.</p><br/><p>The words were firmly engraved in his mind.</p><br/><p>She was still angry at him in her heart. Otherwise, she wouldn’t even be willing to send him out.</p><br/><p>Yan Yu sighed, he had no choice but to admit that he was a little disappointed. He just left and couldn’t wait to see her again. He didn’t know how he would survive the next two months.</p><br/><p>He urged his horse forward, travelling day and night at the same time as he hurried along. He arrived at Lan Ling seven or eight days early.</p><br/><p>The Crown Prince received him with great dignity and explained to him personally the current state of the war.</p><br/><p>Yan Yun’s army looked sturdy but they were unable to withstand a single blow. He and the Western Yi were linked. The Da Jing had always been wary of the People of Western Yi, so they could not truly work together. The Da Jing did not obey the Da Jing, and the military camp was in chaos. If he was struck in the head with this matter, he would definitely be utterly defeated.</p><br/><p>Yan Yu and Yan Tao discussed the situation for a while and decided to cut the mess quickly. They didn’t give the First Prince any time to react and would attack his army the next day.</p><br/><p>Yan Yu’s two hundred thousand soldiers were brave and battling, they could ride on horses and fire well, they attacked from the front and hid in the back. There were also Yan Yu’s soldiers on the other side of the lake. Some of them wanted to escape from the water, but they did not expect that the water had already formed a trap for them, and the moment they jumped into the water, they were pierced through by the sharp blades. In the blink of an eye, a layer of blood-red light appeared on the surface of the lake.</p><br/><p>This battle was destined to be a victory and a defeat. Only the First Prince, Yan Yun, was still struggling bitterly and refused to give up.</p><br/><p>He rode his horse to meet the enemy, and with his sword in hand, he rushed to the front, looking straight into Yan Yu’s eyes, which were filled with viciousness and viciousness. Sixth brother did not disappoint my expectations, and the moment he attacked you, he wanted to take your brother’s life. ”</p><br/><p>Yan Yu’s gaze was ice-cold, and her words were without any ripples. “Is it not enough to let you live for a few more years?”</p><br/><p>Yan Yun laughed, he did not say anymore, and after he gave the order, the soldiers behind him charged into the battle, and the two sides started fighting once again.</p><br/><p>Taking advantage of the chaos, Yan Yun indicated for the people behind him to release their arrows, the cold arrows aimed at Yan Yu’s chest one by one.</p><br/><p>Was Gao Xun treated like this the day he died?</p><br/><p>Yan Yu remembered the soldier’s description of Gao Xun when he died. His entire body was full of holes and there was not a single spot good for him.</p><br/><p>That was his good brother, his good partner.</p><br/><p>His jaw tensed, he did not manage to dodge the arrow, and rushed straight towards Yan Yun.</p><br/><p>Arrows rained down from the sky.</p><br/><p>Yan Yun did not expect him to not dodge and was stunned for a while. He used a snake spear to deflect the incoming arrow. The arrow shot into his shoulder did not even make him frown. In the blink of an eye, he was already in front of him. He raised the snake spear and stabbed forward!</p><br/><p>Yan Yun had barely dodged, and exchanged two blows with him on the horse, but the hatred that he had accumulated for many years burst out like a hot knife through butter, and he was actually unable to resist it.</p><br/><p>Yan Yu’s eyes were filled with hatred, he had beaten him until he could only defend, with no room for retaliation. Yan Yun gradually revealed an opening, he raised his snake spear and pierced towards his chest, jumping off the horse’s back, the two of them fell to the ground. The snake spear pierced through Yan Yun’s chest, nailing him to the ground.</p><br/><p>The floor was covered in blood.</p><br/>\n</div>"}