{"title": "Chapter 111", "id": 111, "volume": 2, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-111", "volume_title": "Volume 2", "body": "<h1>Chapter 111</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>C111 C111: Vomiting During Pregnancy</p><br/><p>These few days, it could be said that Yan Yu was holding Xie Zhen in his hands, treating her extremely precious, afraid that she would make a mistake. No matter what she did, he would follow by her side.</p><br/><p>Xie Zhen wanted to walk around by the lake, but he kept walking along the side that was close to the shore, worried that she would fall into the river, so he protected her tightly. He also told servant maids to go back to the house and bring a cloak for her. This caused Xie Zhen’s interest to drop, and she could only return in disappointment.</p><br/><p>After returning back into the house, her legs accidentally tripped the embroidered pier, so Yan Yu made servant maids wrap the corners of the tables, chairs and chairs in cotton cloth, so that she wouldn’t be injured in the future.</p><br/><p>The hairpin Chai Yu and other sharp objects were all kept away …</p><br/><p>The incense and spices had stopped.</p><br/><p>Not only that, but even the three meals a day were exchanged for dishes that were beneficial to the body, each of them nourishing Yin and replenishing nourishment. Never mind, she originally had no appetite for food, so everything was the same. But Yan Yu had actually kept all of her fat lips, not letting her find them!</p><br/><p>Although she wasn’t used to it, but as a girl, who didn’t like this cosmetic powder? It would be better to put it on the dressing table for a look!</p><br/><p>Xie Zhen was so angry that she laid on his arm and bit on it hard. She spoke in a low voice: “Give it back to me!”</p><br/><p>Those who were pregnant had a violent temper, they acted recklessly, and Xie Zhen was no exception. Normally, she would be well-behaved and quiet. Occasionally, she would be angry at him because she was unhappy. Today, she could not stand it any longer and decided to bite him mercilessly.</p><br/><p>“Those things contain lead, some contain musk, which is not good for you and the child.”</p><br/><p>Xie Zhen was unreconciled, and took another bite at a different place, feeling rather wronged: “But I like … I’ll just look at them, and won’t use them. ”</p><br/><p>Yan Yu still refused to let go. It was not that he didn’t believe her, but that he didn’t dare to joke around with her and the child.</p><br/><p>The servant maids in the house could be trusted, but there could be no accidents. If there were those unrighteous servant tampering with her spices and makeup, it would be too late to discover them.</p><br/><p>Yan Yu had heard the doctor say before that pregnant women were all emotionally weak, they could not be compared to them. They had to coax them to be in pain, everything they said was right, everything you said was wrong. Especially a girl like Xie Zhen who was born for the first time, she herself wasn’t very old yet, but she still had to be a mother before her mind was fully mature.</p><br/><p>Yan Yu didn’t really understand it at first, shouldn’t having children be something to be happy about? Why was she so emotional? Now he completely understood, and was even unwilling to say a heavy sentence to Xie Zhen. This was because as long as she revealed those watery, pitiful eyes, he would be helpless.</p><br/><p>For example, right now, Xie Zhen bit her lips, staring at him angrily yet at the same time coquettishly: “Give it back to me … …”</p><br/><p>Yan Yu had to have a very firm stand before he could refuse. He clapped his hands together and covered her eyes, “No!”</p><br/><p>Xie Zhen pulled away his big hands, immediately changing his face to another face, and accused him with angrily: “Big brother Xiao Yu is so bad!” In the end, she was still afraid that he would really throw them away. Those cosmetics were very valuable, she had hidden a lot of them. “When can you return them to me?”</p><br/><p>Yan Yu thought for a while, “After the child is born.”</p><br/><p>That would take months!</p><br/><p>Xie Zhen thought about how she had to look messy for the next few months. It was unbearable, she focused on appearances the most, she had to dress beautifully no matter where she went, how could she endure that? She pointed with her delicate finger and drove him away with her angrily. “Get out, get out …”</p><br/><p>Yan Yu stood there motionlessly, feeling a little helpless: “I’m doing this for your own good.”</p><br/><p>Xie Zhen’s almond-shaped eyes were round, without the slightest hint of gratitude, “Who would be as exaggerated as you? When my eldest sister and second sister were pregnant, their heads were filled with jade. Eldest sister and second sister husband are not as cautious as you! ”</p><br/><p>She also knew that he was being cautious.</p><br/><p>After all, this child had been looking forward to it for so long. He did not want to make any mistakes.</p><br/><p>He didn’t want anything to happen to her either.</p><br/><p>Yan Yu did not move a muscle, when he saw her red face, her messy hair, and the few strands of hair on her forehead, made her look like a lunatic. He smiled suddenly, as if he understood why she was so angry. He pulled her hair from her face, revealing her smooth forehead. He leaned over and kissed it lightly. “Even if you don’t wear those things, you’ll still look good.”</p><br/><p>He rarely said these explicit words of love, and he was probably not used to it either. His voice was a little hoarse and astringent, as if he was trying to please her.</p><br/><p>Xie Zhen snorted, she turned her head away, not showing any gratitude.</p><br/><p>He quickly promised, “I’m telling the truth.”</p><br/><p>Xie Zhen slowly turned her head around and looked at him with her beautiful almond eyes.</p><br/><p>He coughed in embarrassment. Right at this time, servant maids came in with lunch, and a plate was placed on top of the round table outside. He seemed to have finally found the stairs, “Let’s go eat.”</p><br/><p>Xie Zhen pursed her her mouth a thin line. “No.”</p><br/><p>Eating everyday was a huge event, and Yan Yu had to worry about it. Her tastes were becoming more and more picky. She didn’t eat either, and even the sweet and sour pork she used to love had lost its appetite. Yan Yu had no choice but to let the kitchen cook. If there was a dish she ate two more times, Yan Yu would definitely order someone else to serve the dish.</p><br/><p>Just like this, the meat that she had lost weight in the past two months was finally being reared back bit by bit by Yan Yu within the next few days.</p><br/><p>Under Yan Yu’s persuasive words, Xie Zhen was finally willing to sit down and drink a bowl of medlar and red date black chicken soup. However, she had only taken two mouthfuls when she frowned and covered her mouth, turning her head to spit out the soup that she had just drunk.</p><br/><p>Even though her stomach was empty, she still could not help but vomit.</p><br/><p>The servant maids immediately surrounded her, and Shuang Yu wiped her mouth with a handkerchief. Shuang Yan served a cup of tea to her, and let her rinse her mouth with it.</p><br/><p>Yan Yu took the handkerchief from Shuang Yu’s hands, wiped the corner of her mouth and asked: “What’s wrong, does the kitchen not taste good?”</p><br/><p>She shook her head, refusing to look at the table. “The moment I smell it, I feel disgusted. Take it away.”</p><br/><p>Then, Yan Yu got someone to carry away the black chicken soup and asked her what she wanted to eat. However, she glanced at the table, and without wanting to eat anything, she crawled into his embrace using her hands and legs, and buried her head into his chest while holding his waist: “I don’t want to eat anything at all.”</p><br/><p>But how could she not eat anything? She wasn’t one person right now. There was still one more in her body.</p><br/><p>She was sick of the meat, so Yan Yu asked the kitchen to make a few light and delicious dishes. She ate a bit, and also ate a bowl of walnut cheese. After that, Yan Yu escorted her back to her room, and also asked the mama by her side about it. Mammy Gui had just returned from the countryside yesterday, so after knowing that Xie Zhen was pregnant, she was so happy that she didn’t sleep well for the entire night. When she heard Yan Yu’s question, she immediately replied with a nod of her head, “Your Highness, don’t worry. “It’ll be fine after this period of time.”</p><br/><p>After Yan Yu heard this, he was finally relieved.</p><br/><p>But he was still worried, so he told Wu Bin to go to the warehouse and bring out the hundred old ginseng that the Emperor Yuan Hui had bestowed upon him. He cut them into pieces and put them into Xie Zhen’s mouth.</p><br/><p>Xie Zhen laid on the bed, his hand still holding onto his sleeve, “My hairpin …”</p><br/><p>Yan Yu couldn’t do anything about her, he pinched her nose and asked: “I’ll return it to you, promise me that you’ll eat properly in the future.”</p><br/><p>Her eyes lit up, and she couldn’t help but smile. “Alright.”</p><br/><p>Hence, early the next morning, Xie Zhen saw her putting all of her jewelry and makeup back into her marriage dowry, not a single one was missing. What she didn’t know was that Yan Yu had someone check her rouge powder the whole night to make sure there were no problems before returning it back to her.</p><br/><p>The news of Xie Zhen’s pregnancy reached Duke Dingguo’s Mansion ten days later. At the start, Xie Zhen’s body was weak, Yan Yu did not want anyone to disturb her, so he intentionally sealed off the news. After ten days, her body was more or less stable and she had to be visited.</p><br/><p>Madam Leng and Xie Xun had arrived immediately, and brought her a lot of supplements, as well as warning her about a lot of things.</p><br/><p>The Madam Leng had also brought two biddy s with her, so she had a certain understanding of having children. If she stayed by Xie Zhen’s side, it would be easy for her to order him around in the future.</p><br/><p>Xie Zhen was very willing, she and Yan Yu didn’t understand anything and kept joking around. With two biddy by their side, they could really help a lot.</p><br/><p>She had only been here for three months, but her stomach was full. Her figure was still as slim and graceful as before.</p><br/><p>Xie Xun immediately became more sensible and no longer pestered her to play with her. She sat on the side of the bed with her hands on her cheeks and asked, “sis, how does it feel to have a child?”</p><br/><p>Xie Zhen tilted her head and thought for a while, “I just feel like there’s something extra in my body … Let me not eat, let me not sleep, often worry about. ”</p><br/><p>The answer was quite a solid one.</p><br/><p>Xie Xun placed his hand on her stomach, rubbing it, “Does it hurt?”</p><br/><p>She giggled. “It’s still not hurting yet. My mom said that when it grows up, it’ll kick someone. When that happens, it’ll hurt.”</p><br/><p>Xie Xun opened her mouth slightly, but like her, she felt that something was off. She immediately retracted her hand, not daring to touch her again, as she was afraid of ruining the child’s touch.</p><br/><p>Madam Leng and Xie Xun did not stay for long. Yan Yu did not want to tire her out, so he stood by the door and tactfully reminded her to rest. Madam Leng and Xie Xun stayed for a while longer before they got up and left.</p><br/><p>After that, the Madam Leng would send supplements over from time to time.</p><br/><p>On the first day of winter, the crown prince and General of Agile Cavalry returned from Lanling and arranged a banquet in the palace.</p><br/><p>This celebratory feast was unprecedented in history, it repelled all internal and external troubles, and the citizens of capital raised their goblets to celebrate. Not only that, I heard that the Emperor Yuan Hui has plans to relinquish the throne and pass on the throne to the next emperor.</p><br/><p>This matter originally had nothing to do with Yan Yu and Xie Zhen. However, some news came out from somewhere, saying that the Emperor Yuan Hui was very dissatisfied with the Crown Prince’s expedition to Lanling, and thought that he was indecisive. Instead, he rather admired the sixth prince’s valiant resolution … It wasn’t certain who would be the true ruler of this position.</p><br/><p>After hearing Wu Ze’s report, Yan Yu waved his hand expressionlessly, “I understand.”</p><br/><p>Wu Ze wanted to say something but stopped in the end, he still obediently withdrew himself.</p><br/><p>Yan Yu did not tell Xie Zhen about this matter, in case she thought too much into it. There was a banquet at the palace that night, and the two of them went out together.</p><br/>\n</div>"}