{"title": "Chapter 123", "id": 123, "volume": 2, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-123", "volume_title": "Volume 2", "body": "<h1>Chapter 123</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>C123 Xie Zhen only felt a “bang” sound in her head, which shook her to the point that she almost lost her balance. If not for Yan Yu’s support, her entire body would have fallen to the ground.</p><br/><p>Her hands and feet were cold. She asked word by word, “What did you say?”</p><br/><p>The wet nurse was also panicking, her arms that were supporting her on the ground were still shaking, but she was quick to speak, “Yes, this old servant is useless … After coaxing the crown prince and the princess to sleep, I went to the Warm Pavilion to take care of them. I didn’t expect that after waking up, the young prefecture lord and Madame Ge would both be gone …”</p><br/><p>Madam Ge was Yan Jin’s wet nurse. Initially, she didn’t expect to be born against the twins of mixed sex and only invited the Ye Family. After the child was born, steward invited the Ge Clan to the residence. After hearing that her hands and feet were clean, that her family background was clean, and that people were living well, she did not pay much attention to her, but she did not expect such a mishap to occur!</p><br/><p>The wet nurse, Ye Shi was regretful. She stood up and slapped herself twice, “It’s all because this old servant is useless, so I shouldn’t sleep late…”</p><br/><p>Putting aside the main punishment she received for losing the county, just the fact that she had been taking care of her two children for the past six months had given her feelings for them. The two little fellows were both made of jade and snow, and she had long since treated them as her own children. Now that she had lost one, her heart felt extremely bad.</p><br/><p>But no matter what, it was not worse than Xie Zhen.</p><br/><p>In such a short time, her hands and feet were already cold. She didn’t believe it until she went to the next hall to take a look.</p><br/><p>Inside the hall were two bamboo cribs, one with Yan Su lying on it, the other empty. Yan Su did not know what was going on at all, and was still playing with his own feet. Seeing that Xie Zhen had arrived, she opened her arms to hug him.</p><br/><p>Xie Zhen was so saddened that her eyes immediately turned red.</p><br/><p>There were still two people in the morning, but why was there only one left? Her heart felt as if it had been hollowed out and couldn’t be mended back.</p><br/><p>Yan Yu’s eyes were cold as he gazed at the row of servant maids kneeling outside, his tone filled with unconcealable rage: “So many people watching yet you’re able to throw your child away? Are you trash? ”</p><br/><p>servant maids lowered his head in apology. One of them was a little bolder, and couldn’t help but explain: “The Ge Clan is usually kind and kind. No one would have thought that she would take away the young prefecture lord … The crown prince and princess were sleeping in their rooms while the servants were waiting outside. It had always been this way, but who would have thought that something would happen today? I wonder how the Ge Clan took away the young prefecture lord … ”</p><br/><p>With servant maids outside, it was impossible for Madam Ge to go out. But there was a window in the side hall that opened to the northeast. The window was not tall, and you could jump out of it with the support stick. After staying in An Wang’s Mansion for such a long time, the Ge Clan had long familiarized themselves with the plants here. It wouldn’t be difficult for them to bring Yan Jin out.</p><br/><p>Yan Su called steward over and told him to go to the entrance to ask when Madame Ge came out of her residence and in which direction she went. He said while gritting his teeth, “You have to find three feet of earth for this king as well!”</p><br/><p>steward received the orders and quickly led his men to investigate.</p><br/><p>Xie Zhen carried Yan Su out of the cradle, his arms slightly trembling, her forehead close to Yan Su’s forehead. The little guy seemed to be able to sense his mother’s fear. He blinked his big watery eyes, and after waking up, he didn’t cry nor make a fuss. He opened his arms and wrapped them around her neck.</p><br/><p>It looked like he was coaxing her.</p><br/><p>Not long after, the steward came back from outside, and reported to Yan Yu: “My prince, Madame Ge left from Jiaomen, and was seen by a servant maids at that time. It’s a pity that the servant maids only saw the back of that person, and didn’t notice if she was hugging the young prefecture lord …”</p><br/><p>Yan Yu looked over with a fierce gaze, and he shivered. Finally he got to the point: “But servant maids still remember that she was heading towards the north.”</p><br/><p>Yan Yu’s residence was located in the northeastern part of capital. There was a crown prince’s mansion between the and the palace.</p><br/><p>In the evening, the things that Yan Yu had ordered his men to look into came to a conclusion.</p><br/><p>The guard knelt down and reported, “Soon enough, there will indeed be a woman in the Crown Prince’s Palace entering and exiting. After the time it takes for an incense to burn, servant maids s would be coming in and out of the manor. This subordinate will follow them and realize that servant maids is going out to the streets to buy shoes for a half year old. ”</p><br/><p>Yes, Mrs. Ge carried Yan Jin away in too much of a hurry to put on her child’s shoes. When she arrived at the Crown Prince’s Palace, she couldn’t do it in time, so she could only go to the street and buy some ready-made goods.</p><br/><p>The Crown Prince must have taken A’ge away!</p><br/><p>Xie Zhen wiped away her tears and sat up on the bed. She felt anger in her chest, gritted her teeth and said, “I want to go to the Crown Prince’s Palace to get my child back.”</p><br/><p>She did not care about what the crown prince was planning, but why would he involve his children in the matters of their parents? Yan Jin was only half a year old. She didn’t even know how to speak. What could be hindering her?</p><br/><p>But after walking a few steps, he was stopped by Yan Yu. He pulled her hand from the back, and said with a hoarse voice, “Ah Zhen, don’t be rash. If it was really second brother’s doing, then it would be useless even if you went.”</p><br/><p>When he looked at her from behind, he felt that she was tense all over, her fists clenched at her sides, her thin back straight. He walked up to her and took her by the shoulder, turning her to face him. “Second Brother likes Ah Jin, he definitely won’t hurt her if he takes her in …”</p><br/><p>Halfway through, she saw Xie Zhen’s tear-stained face and was suddenly stunned.</p><br/><p>His heart ached as he wiped away the tears on her face. It had been a long time since he had seen her cry so helplessly. He just wanted to lure me over. I assure you, Jin will be fine. ”</p><br/><p>Xie Zhen wiped her hands randomly and raised her red eyes to look at him: “Why did he lead you there? He was about to ascend to the throne the day after tomorrow. “How far do you want us to go before we are willing to give up?”</p><br/><p>It turned out that she already knew that even if he didn’t say anything, her heart was still as clear as a mirror.</p><br/><p>Yan Yu pulled her into his embrace and patted her back soothingly, “Leave it to me, I will settle this.”</p><br/><p>Xie Zhen moved in his arms. She would never ask him about this in the past, but today, she was completely terrified and asked uncertainly: “Big Brother Xiao Yu, are you going to threaten him? Do you want to be a prince or … ”</p><br/><p>The servant maids in the house had all been sent out. Today, although the young prefecture lord made a mistake, it was also because of their carelessness. Therefore, Yan Yu punished each of them with twenty boards and left the house, allowing the steward to add another group of obedient new disciples.</p><br/><p>Yan Yu caressed her head. It was already so late, yet he was still in the mood to joke around, “Are you willing to go to the Three Palaces and Six Houses for being an emperor?”</p><br/><p>Xie Zhen was silent for a long time, before fiercely twisting his waist.</p><br/><p>Her hands were small, so that when she twisted them, it didn’t hurt at all. Yan Yu sighed as he leaned against her head. When he thought of Yan Tao, the expression on his face once again became ice-cold. It wasn’t that he hadn’t thought about that position, but the allure of power and status to men was boundless. Being able to stand above the Heavenly servant and rule over thousands of miles of land was indeed very touching. However, if he was going to use his wife and children to replace all of this, he would rather stand by Xie Zhen’s side and teach the two children to grow up before going white with Xie Zhen.</p><br/><p>Yan Tao did this in a rather despicable manner. He wanted to use Yan Jin as a hostage to threaten him. What was the difference between this and the First Prince?</p><br/><p>If he didn’t hurt Yan Jin, it would still be alright. But once he hurt his daughter, he wouldn’t let him off even if it meant a mountain of blades or a sea of flames!</p><br/><p>That night, Yan Yu sent someone to the crown prince’s mansion to inquire about the situation, and also used his dictum to probe out the news of the crown prince’s mouth — — Just say that the young prefecture lord of An Wang’s Mansion had lost it, and see how Yan Tao would react.</p><br/><p>It was a pity that Yan Tao’s appearance was perfect, he had even sent people to help him search the streets, looking like he did not know anything.</p><br/><p>Yan Yu smashed three small ink colored bells in the mansion, and finally calmed himself down and said: “To the crown prince’s mansion.”</p><br/><p>Xie Zhen followed closely behind him, “I’m coming too!”</p><br/><p>But he had asked her to stay in the house, and there were things that were difficult to say in front of a woman, and the sight of them would frighten her: “. Stay in the mansion and wait for me. I will definitely bring A’ge back. ”</p><br/><p>… ….</p><br/><p>Arriving at the crown prince’s mansion, Yan Tao personally sat in the parlour to welcome him. The outside of the courtyard was brightly lit, and the hall was lit up with giant candles. Presumably, he had been waiting for a long time.</p><br/><p>Yan Tao was sitting on an armchair above them. He turned the thumb ring on his thumb: “How is it, did you find A Jin?”</p><br/><p>Yan Yu walked up, and did not bow, and looked straight at him: “No.”</p><br/><p>He frowned, pretending to look the same, “Since you didn’t find it, how could Sixth Brother have the free time to come to my house? Aren’t you afraid that A’Jin will fall into the hands of the evil? ”</p><br/><p>Hearing that, Yan Yu laughed instead, and leisurely sat on a chair by the side. Wu Ze followed him into the house with a blade at her waist, standing close to him. He asked, “Second Brother, do you want to pretend to be confused with me? Where did A’ge go you don’t know? ”</p><br/><p>Wasn’t that so-called evil person himself?</p><br/><p>Yan Tao revealed surprise, “How would I know?”</p><br/><p>These brothers of his were better at acting than the other. They usually wore a mask to see who was better at acting. In the past, they were on the same side, so their relationship was closer than others. Now that they were faced with benefits, the only thing they could do was to lose all decorum.</p><br/><p>Yan Yu asked someone to bring up a servant maids, who was the person who watched the Ge Clan leave from the Horned Gate. servant maids had never seen the crown prince before, he just knelt on the ground and tremblingly described the situation before. Only then did Yan Yu let her down.</p><br/><p>Second brother heard it, to the north of An Wang’s Mansion is only to walk in your mansion, who else could it be other than you?</p><br/><p>Yan Tao lowered his head without saying a word, and after a while he gave a slight smile, “Just based on those words, Sixth Brother was able to guess that it was me?”</p><br/><p>Yan Yu raised his brows, “This is enough.”</p><br/><p>He was quite frank as he waved his hand to disperse the servant maids s on both sides of the room and had them stand guard outside. It is enough. I have taught you this for a long time. Now that I’ve made use of this loophole, you can only blame yourself for not taking second brother’s words to heart. ”</p><br/><p>The only people left in the room were him, Yan Yu and Wu Ze who were at the side. He was not worried about Wu Ze making a move, because he had hostages in his hands, he was safe and sound.</p><br/><p>Madam Ge was arranged by him half a year ago. She was a widow from Crown Princess. Her two children were dead and none of the neighbors dared to ask her for a kiss. She couldn’t bear to stay at home any longer, so Yan Tao brought her to the capital, intentionally getting close to the An Wang’s Mansion to be Yan Jin’s wet nurse.</p><br/><p>After half a year, it was finally useful.</p><br/><p>Yan Yu placed his hand on the arms of the sculpture, he clenched his fists and asked, “What do you want to do?”</p><br/><p>Yan Tao thought that he had compromised, and was not surprised. He regarded Xie Zhen so highly, their child should naturally be cared for as well. So he smiled and said, “I told Sixth Brother, did you forget? Those three cities to the south are rich and prosperous. You will live with the An Wang Fei and I will return A’Jin to you in three years. ”</p><br/><p>Three years later, his strength would be weakened, and by then, he would be completely spent. There would be no room for resistance at all.</p><br/><p>Moreover, who knew what he would do to Yan Jin in these three years?</p><br/><p>Yan Yu glared at him angrily, her hands trembling from anger. With a wave of her hand, she smashed the teacup on the square table far away. The teacup shattered into pieces on the ground, and the tea water splattered all over. He quickly stood up and pulled out the blade on Wu Ze’s waist, placing it on Yan Tao’s neck, “Dream on!”</p><br/><p>Yan Tao appeared to be in no hurry. The blade was clearly pressed tightly against his neck, but there was no trace of fear on his face. “Sixth Brother wants to kill me?”</p><br/><p>Yan Yu used a little more strength, the thin blade cutting into his skin, causing blood to ooze out, “Do you think I don’t dare?”</p><br/><p>His eyes darkened and his lips curved in a mocking smile, “Have you forgotten that A Jin is still in my hands? With just a word of mine, she will never be able to return to your side.”</p><br/><p>So it turned out that he had a trump card in his hand, which was why he seemed so confident.</p><br/><p>Unfortunately, he was too arrogant, and also underestimated Yan Yu.</p><br/><p>Not long after that, Xie Zhen appeared at the door while carrying a baby. The baby in his arms was Yan Jin, her eyes gently tucked in the corner, looking at Yan Tao with only hatred in her eyes. Thinking of something, she suddenly smiled, looking exceptionally charming under the light. “Second Brother has never taken care of a child, right? The shoes I bought for A’ge don’t fit my feet. The skin of a child is soft, so it’s impossible to wear cotton shoes. It will be red. ”</p><br/><p>Yan Tao’s pupils contracted as he stared at her in disbelief.</p><br/><p>He had clearly ordered his men to look after the child, but why was he so easily found? What about the others? Why didn’t she report to him?</p><br/><p>Looking at Yan Yu, he was no longer as angry as before. Both of his eyes were calm and collected, even his hand that was holding onto his blade had become steady. It turned out that his previous performance was all an act, just to make him be careless.</p><br/>\n</div>"}