{"title": "Chapter 126", "id": 126, "volume": 2, "url": "http://boxnovel.org/the-royals-cute-little-wife-chapter-126", "volume_title": "Volume 2", "body": "<h1>Chapter 126</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>C126 Until the late night, the rain did not seem to stop. Lightning and thunder roared outside the carriage, and a lot of raindrops fell into the carriage through the curtains, hitting Zhong Shang on the face, bringing about a cool air. The guard sat on the carriage, soaked from the rain, but he didn’t dare complain. He looked at you and asked tentatively, “Young Master, are we going back?”</p><br/><p>Layers of dark clouds blocked the moon. It must be the end of the tenth century.</p><br/><p>Zhong Shang did not say a word the entire time, her exquisite jaw drew a cold arc, and only after a long time did she say: “No.”</p><br/><p>The guard sighed and resigned himself to his fate.</p><br/><p>From the looks of it, he would have to wait outside for the whole night.</p><br/><p>At the same time, the Duke Dingguo’s Mansion was brightly lit, it was a lively scene.</p><br/><p>Gu Yi couldn’t refuse, so he stayed for the night. If he wanted to stay, Madam Leng and Xie Liqing naturally could not ignore him. Not only did they invite him for a meal in the hall, they even had servant maids send blankets after the meal. Gu Yi was flattered and thanked him profusely. In truth, Xie Rong had a few blankets here, he could casually tidy up a room for him to live in, but the Madam Leng was too attentive, afraid that he would be wronged if there was anything that was not thoughtful.</p><br/><p>Gu Yi had sent someone to meet him at home earlier, saying that he would stay in the Duke Dingguo’s Mansion tonight and return tomorrow morning. Because it was raining at night, Xie Rong and Gu Yi took a rest early after washing up. The sound of rain could be heard outside the courtyard, accompanied by the sound of the wind blowing. To the ears, it sounded like the sound of wailing.</p><br/><p>The heavy rain lasted all night and did not stop until dawn.</p><br/><p>The courtyard was filled with shallow puddles of water while the in the porch was still dripping water. Raising his head, the sky was as clear as if it was a clean sheet of white. Xie Xun used warm water to wash her face, as she walked out of the house while wiping her face. Looking at the courtyard, she asked: “Mr. Gu rested at Big Brother’s place last night?”</p><br/><p>She had slept early last night, and hadn’t even gone to the front hall for dinner. It was this morning that she had heard servant maids speak. When he heard this news, he couldn’t help but rejoice that he had slept early … If he hadn’t fallen asleep, he would definitely have been called out by his mother for dinner. At that time, it would have been very awkward facing Gu Yi.</p><br/><p>Her father and mother wanted to pair her up with Gu Yi, so she knew. She had seen Gu Yi a few times and knew that he was a graceful, noble, and elegant young master. In the past, when they were able to meet openly, it was all her parents’ fault for wanting her to marry him. It was so much that now, when she saw him, she felt unnatural.</p><br/><p>Thinking about it, Xie Xun sighed, and handed the handkerchief over to servant maids. Fortunately, Gu Yi left early this morning, and they didn’t have a chance to meet.</p><br/><p>After changing his clothes, Xie Xun walked towards the front to eat breakfast. Looking around, there was only Madam Leng and Xie Liqing. It seemed that Gu Yi had indeed left.</p><br/><p>“Did Ah Xun sleep well last night?” Madam Leng scooped a prawn dumpling into her bowl.</p><br/><p>Xie Xun liked to eat shrimp dumplings the most. She could eat seven or eight of those in one go. Looking at the table, there were quite a few dishes that she loved to eat. She forgot about the depression caused by Gu Yi staying the night. She picked up a dumpling and dipped it in sauce before taking a bite and saying, “Sure!”</p><br/><p>When Madam Leng saw her greedy look, she could not help but laugh: “Look at your greedy look … Did you sleep last night without eating? ”</p><br/><p>She bit the dumpling and nodded her head, blinking her big eyes. “I was tired, so I went to sleep early.” She was afraid that the Madam Leng would talk about Gu Yi so she quickly changed the topic, “Big brother didn’t wake up yet?”</p><br/><p>Unfortunately, the conversation failed. Madam Leng shook her head and said, “I’ve already ordered some people to call him. He probably hasn’t woken up yet. You didn’t know that Mr. Gu was staying at our residence when you fell asleep yesterday. Maybe the two of them spoke a little late. ”</p><br/><p>Xie Xun buried herself in the silence, concentrating on eating her breakfast without saying another word.</p><br/><p>Just because she did not speak did not mean that Madam Leng would let her go. Her children’s wedding had always been a big matter in her heart, out of the three children, only Xie Zhen had smoothly married off, the most important thing was to not let her worry, the other two were more worried than the rest. Xie Xun was 16 years old and had not gotten married yet. Even though Xie Rong was 23 years old, if he continued to drag things on, it would bring about trouble!</p><br/><p>Madam Leng asked indirectly: “You have also seen the Mr. Gu, what is your impression of him? I saw a painting in your room with his private seal on it. When did you get to know each other? ”</p><br/><p>Xie Xun’s face immediately flushed red, the hand holding the chopsticks stopped in midair, and in the end, she still stubbornly picked up the three silverear dishes, and explained as she ate: “That’s not what I wanted … It was brother who asked for it for me. I don’t have much of a relationship with Mr. Gu, Mother, don’t think too much. ”</p><br/><p>At a time like this, of course she had to use his big brother as a shield.</p><br/><p>Hearing that, Madam Leng’s face revealed disappointment, “I think that this Mr. Gu is pretty good.”</p><br/><p>The more she said, the more she felt that she couldn’t continue listening to her anymore. Xie Xun hurriedly bit her lips and picked herself up, saying, “I’m full. Father, Mother, please sit for a while. I will be going back first.”</p><br/><p>With that, she turned around and left, with the intention of fleeing.</p><br/><p>Madam Leng hurriedly stopped her. “Don’t go, what’s the rush! I still have something for you. ”</p><br/><p>She stopped by the door and asked in puzzlement, “What do you want to tell me?”</p><br/><p>Madam Leng took a bright red intertwined lotus flower pattern box from servant maid’s hands and handed it over to her. “Ronger still hasn’t come, I’m worried that the food will get cold soon. Take these to his courtyard.”</p><br/><p>Xie Xun obediently received it, “Oh.” It wasn’t a big deal to give her big brother a meal. It wasn’t something like this in the past, so she agreed without thinking too much.</p><br/><p>Xie Rong’s courtyard was called Star Seizing Department. The distance between them was a little far, so they had to pass through two long walkways and a path filled with gingko trees. As Xie Xun walked along the road, she thought that Gu Yi should have left already, right? It’s already been so late, did he still want to stay for lunch if you don’t leave? Well, now that she thought about it, she wasn’t so nervous anymore.</p><br/><p>Arriving at the Star Embracing Courtyard, Xie Xun went straight to the main room, skipped over the threshold and said crisply, “Big Brother, Mother wants me to bring you breakfast!”</p><br/><p>As soon as she said that, she was stunned.</p><br/><p>Where was my brother? Only Gu Yi was sitting on the Eight Immortals’ chair. His face was a little pale, and when he saw her, he stood up and bowed. “Seventh Miss.”</p><br/><p>Embarrassed, she opened her mouth and replied, “Oh … Mr. Gu still hasn’t left? ”</p><br/><p>With that, she looked around, but did not see Xie Rong. She stood there awkwardly, but it was not good for her to turn around and leave. She could only find something for herself to do. She placed the food box on the square table beside her and ordered the dishes inside one by one. “Where’s my brother?”</p><br/><p>Gu Yi said apologetically, “Speaking of which, I’m not afraid of your jokes. I spent the night here and woke up feeling dizzy. I must have caught a cold.” Yong Chang just went to prepare the carriage, and I was just about to return home, to bother you all for an entire night, I am truly sorry. ”</p><br/><p>Xie Xun softly exclaimed, because the other party was a guest. She still had to do it with face, no matter what, she had to look out for her, “Are you alright? Would you like a doctor? ”</p><br/><p>He smiled and shook his head. “It’s just a minor ailment, so there’s no need to trouble yourself.”</p><br/><p>Xie Xun did not try to force him, as she lowered her head to see the Huntuns on the table. she then personally scooped up a bowl and brought it to servant maid, and let the servant maid bring to him, “You have never used a morning meal, right? Do you want to drink a bowl of wontons? The cooking skills of our family’s cooks are very good, and the cooking is very delicious. ”</p><br/><p>Gu Yi suffered from the cold and had no appetite at the moment. However, seeing the passionate look on the girl’s face, he couldn’t bear to ignore her good intentions. Therefore, he picked up a spoonful of wonton and put it in his mouth. His skin was thin and tender, and his flesh melted in his mouth. Indeed, the taste was not bad. He smiled as he praised, “It really is delicious.”</p><br/><p>Xie Xun smiled, “Then eat more.”</p><br/><p>Thus, the two of them sat there, one eating wonton while the other held onto his face, bored out of his mind. Fortunately, Xie Rong didn’t make them wait much longer and returned very quickly. He gestured to Gu Yi, “The carriage is ready, I’ll send you out.”</p><br/><p>Gu Yi put down his blue and white porcelain bowl. “Thank you, Brother Yongchang.”</p><br/><p>Since the guests had to leave, as the host, she naturally had to send them off. Xie Xun followed behind Madam Leng and Xie Liqing, and watched Gu Yi get on the carriage. Only then did she turn around and return to the manor. Before him leaving, her mother even said to Gu Yi, “I will be going to the Temple of Precious Elephant to burn some incense in two days. Go back and help me ask if your hall is free. The first young master can also accompany you. ”</p><br/><p>The last sentence was the main point, as Mother did everything she could to get her to work with Gu Yi.</p><br/><p>Xie Xun’s face turned red at the back, if not for the two families’ face, she would have turned and left a long time ago. But now, it’s all right. That day Mother Xiang would definitely call her over. Should she go or not?</p><br/><p>As Xie Xun was feeling vexed, the gatekeeper ran to her side and bowed respectfully. “Miss, there is someone looking for you outside.”</p><br/><p>Xie Xun stopped, “Who’s looking for me?”</p><br/><p>She looked ahead, Madam Leng and Xie Liqing had already walked far away and did not hear the servant’s words.</p><br/><p>The servant lowered his head, and spoke in a mysterious manner: “It’s someone from General Zhong’s residence, I heard that Miss Zhong Rou wishes to see you.”</p><br/><p>Zhong Rou and Xie Xun’s relationship was extremely close. Xie Xun would often go to the Zhong Residence, and Zhong Rou would also send people to the Duke Dingguo’s Mansion to pick her up. So even though she did not make a promise before, Xie Xun did not suspect now. She only thought that Zhong Rou came to find her because she had something on his mind. She turned around and walked out, “Why didn’t you invite Big Sister Zhong Rou in? It’s been raining outside. It’s so cold. ”</p><br/><p>The attendant laughed. “I’ve already told Miss Zhong, but Miss Zhong said it would be inconvenient for her to enter. Please go over and meet her.”</p><br/><p>Xie Xun tilted his head, what’s so inconvenient about it? It wasn’t like Sister Zhong Rou hadn’t come here before.</p><br/><p>As she turned back to the door, she saw a carriage with a flat roof and a golden embroidered curtain that was soaked through. She didn’t know how long it had been waiting for her to arrive. She hurriedly walked forward, and stood outside and called out: “Big Sister Zhong Rou, aren’t you going to follow me into the Palace?”</p><br/><p>There was no sound from the carriage, so she called out again, “Sister Zhong Rou?”</p><br/><p>Did he fall asleep from waiting?</p><br/><p>The servant maid put down her pedals, she stepped onto the carriage and opened the curtain, “servant said that you had something to talk to me about …” The mood of the carriage was rather gloomy, with a tinge of rain and moisture. Before she could finish speaking, she had no strength to pull herself into her embrace, immediately crashing into a pair of firm chests.</p><br/><p>Zhong Shang held her tightly, the hot air spraying on her neck as he asked softly, “What did you tell Gu Yi?”</p><br/>\n</div>"}