{"title": "Chapter 03 – First Conversation", "id": 3, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-03-%E2%80%93-first-conversation", "volume_title": "Volume 1", "body": "<h1>Chapter 03 – First Conversation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner (Cast: an English Clown and a French Pierrot)</p><br/><p>Clown: I feel like these chapters are getting longer…</p><br/><p>Pierrot: Well, the universe is expanding, after all.</p><br/><p>Clown: What does that have to do with chapters getting longer?</p><br/><p>Pierrot: Well, since time is relative, wouldn’t time be expanding as well?</p><br/><p>Clown: … you know, the typical expectation in our profession is that we are fools. If you talk like that, you will lose customers!</p><br/><p>Pierrot: Then what do I do?</p><br/><p>Clown: Tell them a stupid joke. That’s what I do to keep up the image!</p><br/><p>Pierrot: Alright… what do you call that pink goo between an elephant’s toes?</p><br/><p>Clown: … cotton candy?</p><br/><p>Pierrot: Slow clowns.</p><br/><p>Clown: …</p><br/><p>.</p><br/><p>.</p><br/><p>Empowerment Arc</p><br/><p>Chapter 03 – First Conversation</p><br/><p>Did someone say “Little One”?</p><br/><p>No matter how I think about it, they were probably talking about me…</p><br/><p>But rather than a voice, it felt more like being directly made aware of those words. At any rate, I don’t got ears to hear.</p><br/><p>(Oi! You can hear me, can’t you? Responding would be good!)</p><br/><p>I can hear you!</p><br/><p>But, however! Since I lack a voice, I cannot respond.</p><br/><p>As a test,</p><br/><p>(Too loud, baldie!)</p><br/><p>That’s the answer I tried to project in my head.</p><br/><p>Well, not like you hear it anyways, so you should be fine. But, how did I respond…</p><br/><p>(… Ho, Hoho! To deign us a baldy, aren’t You a brave one!!! It has been long since I have last had company so I may have started poorly, but this one seems to be searching for death!)</p><br/><p>This is bad. He heard that one.</p><br/><p>But hey, when I think words in my head, I can respond! Had I been taught that earlier, I wouldn’t have to anger my partner.</p><br/><p>And besides, I don’t even know what my partner is like at all.</p><br/><p>Well, that’s that. Time to throw in the towel.</p><br/><p>Let’s properly apologize here.</p><br/><p>(I’m sorry! I didn’t know how to respond, so I decided to try whatever seemed appropriate. I sincerely apologize!</p><br/><p>And on that note, I must note that I have no eyes to see with, so I cannot behold your visage.)</p><br/><p>Did that reach?</p><br/><p>Well, although I can’t see him, who would expect him to actually be bald? Though if that’s the case, then any amount of rage can only be expected.</p><br/><p>Let’s also refrain from thoughtless statements (?).</p><br/><p>(Fufufu. Fuhaha. Fuahahahahaha!)</p><br/><p>And suddenly, laughter.</p><br/><p>A perfect, three step laughter. Simply breathtaking.</p><br/><p>Has the anger passed?</p><br/><p>(Interesting. Truly, stated without beholding my appearance as I suspected, but for you to lack eyes. Slime species are typically thoughtless creatures that only [Absorb], [Dissolve], and [Regenerate]. I have yet to behold one leaving their territory.)</p><br/><p>Somehow, he started telling a tale?</p><br/><p>Rather than abating his anger, did I win his interest…?</p><br/><p>At any rate, this is first contact. This is the first chapter in my life’s (slime) story.</p><br/><p>I want to proceed on favorable terms.</p><br/><p>And learn a lot from him.</p><br/><p>(When a slime suddenly rammed my body, I naturally found it rather bizarre. At an exceptionally high speed, at that. What are You? A named monster? A unique monster?</p><br/><p>Named? Unique? I don’t understand.</p><br/><p>(I apologize, but I don’t really understand the meaning of what you said. Truth be told, since I have been born only 90 days have…)</p><br/><p>(Ay. Self-awareness is something impossible for a slime. Named monsters are those that have received a name, but to have had only 90 days pass since birth… in that case, unique?)</p><br/><p>(What would you mean by “unique”?)</p><br/><p>(Unique monsters are those who have undergone some mutation and possess unusual powers. Rarely, such are born in areas with high magical energy density… I see, your birth was founded on magical energy drawn from myself!)</p><br/><p>Mumu? And what would that mean?</p><br/><p>Let’s see if past world’s knowledge can be used figure this one out.</p><br/><p>In other words, from this old man (assumption) magical energy flows, and thus it has become abundant in around here.</p><br/><p>And when that energy gathered, the monster that was born from it–the slime = myself? Is that it?</p><br/><p>(Ay. In these 300 years, a monster who could approach myself had not existed. Being born from my power, perhaps You could even lay your hands upon myself!)</p><br/><p>(Hoho… in that case, you would be something akin to my parent?)</p><br/><p>(A parent would be the wrong way to call it. After all, I do not possess reproductive capabilities. Some monsters can reproduce, and some cannot.)</p><br/><p>(Normally, lacking such capabilities would be normal, no? If monsters born from condensed magical energy, wouldn’t reproduction be unnecessary?)</p><br/><p>(… Little one, you are surprisingly intelligent. Normally, the monsters who think are few in number, but those that possess true intelligence would be only the Majin…</p><br/><p>But that is fine, I will respond to your question.</p><br/><p>There are inferior tribes which reproduce. Goblins and orcs, along with lizardmen–to name a few. These are special among the monsters, and are commonly referred to as demi-humans.</p><br/><p>Among demi-humans, there also those who have befriended humanity. Elves, hobbits, and dwarfs–those belonging to the fair magical races.</p><br/><p>Well, in a few words, those the support the Majin are called monsters, and those that support humans are recognized as a part of their species.</p><br/><p>These demi-humans would be the representatives of the reproducing monsters. Though to me they are no more than trash!</p><br/><p>Next, about the Majin.</p><br/><p>Although these have been born from magical energy, they are generally beasts and magical beasts who have evolved beyond themselves.</p><br/><p>Reproductive capabilities and true intelligence are considered their special features. Most of all, these tend to vary as individuals.</p><br/><p>Among these, there also the high class majin. They are the most disorganize and diverse bunch.</p><br/><p>The conclude, the giants, the vampires, and the devils are the high class majin with the longest life span.</p><br/><p>Although these too can reproduce, they normally abstain. Hosting overwhelming magical energy, their flesh never decays.</p><br/><p>And so, there is no need to leave offspring. Though perhaps if their numbers were to decrease due to a war or some great calamity, that may change.</p><br/><p>As one would expect, they are strong. I myself have fought with them many times, yet they are not an opponent you can face many at a time.</p><br/><p>A perfect brawling partner!</p><br/><p>All together, these are referred to as the demonic races.</p><br/><p>Of high intelligence, capable of reproduction, and laying waste to humanity–these are deigned as demons by them.</p><br/><p>As for why I cannot reproduce… there is simply no need.</p><br/><p>I art a “A being perfect as one, one of the four existing dragons.</p><br/><p>The Storm Dragon Veldora!” Such is I!</p><br/><p>I am bound by neither time nor flesh! A mass of pure magical energy, and thus I art endless!!!</p><br/><p>Fu…. hahahahahahaha!!!)</p><br/><p>And there he goes with his high pitched laughter…</p><br/><p>So basically, since he has no lifespan, he needs no children! That kind of thing?</p><br/><p>His explanation dragged on, but it was pretty useful.</p><br/><p>Storm Dragon Veldora… a dragon, huh?</p><br/><p>Fighting high class majin for fun, ain’t he a dangerous fellow?</p><br/><p>This would fit the taste of most people engrossed in manga, anime, and light novels.</p><br/><p>With all that I know, there is no question that the Storm Dragon Veldora is dangerous.</p><br/><p>And the fact that he explained everything so politely just makes this feel more ominous.</p><br/><p>Now… what to do next…</p><br/><p>(Is… is that so! What an easy to understand explanation, thank you very much! Well then, I’ll excuse myself!)</p><br/><p>With those words, I tried to take my leave.</p><br/><p>(Wait. I have explained myself. Is it not your turn? Hmm?)</p><br/><p>Doesn’t seem like a situation where I need to quickly run away.</p><br/><p>Yeah~. Let’s talk about myself… but wait. I reincarnated into a different world! If I said that, would he even believe it?</p><br/><p>As a slime possessing high intelligence, deceiving him would be unthinkable.</p><br/><p>If anything, if he will figure out that I am trying to deceive him… that would raise a death flag, wouldn’t i?</p><br/><p>Oh, well.</p><br/><p>Whether he believes me or not, is not for me to decide.</p><br/><p>Having come to a decision, I discussed everything that happened until now.</p><br/><p>・</p><br/><p>・</p><br/><p>・</p><br/><p>・</p><br/><p>・</p><br/><p>(And well, that’s the thing! Ain’t it strange!)</p><br/><p>Without mentioning anything about my skills, I discussed everything from when I got stabbed, to waking up as a slime, and situations I’ve lived through.</p><br/><p>As I was saying this, it strangely did not seem a troubling situation at all, but, well, it was pretty bad.</p><br/><p>The fact that I can’t see being the worst part of it all.</p><br/><p>If this goes on, won’t I pass on every cute girls and beautiful women around?</p><br/><p>That makes me said…</p><br/><p>(I see. You had reincarnated as I thought. What a truly rare method you used.)</p><br/><p>(Eh? Method? And hey, aren’t you supposed to be doubtful or surprised?)</p><br/><p>What’s with that response. Isn’t reincarnation supposed to be something really rare? From the way he says it, normal birth is beginning to seem more unusual!</p><br/><p>(Ay. Reincarnated tend to appear once in a while. Souls with strong intentions engraved in them.</p><br/><p>Those among them who remember their past life are not all that unusual</p><br/><p>But to have reincarnated from a different world… that is rare.</p><br/><p>Moreover, you’d normally be born from a human. But to be born as a monster, and from magical energy to say the least… that I have never heard of.</p><br/><p>To have crossed the boundaries of the worlds, just having a strong soul is not enough. Had you not stabilized your soul in this demonic body, your soul would have vanished.</p><br/><p>You are special.)</p><br/><p>(Is that so? I wasn’t self aware, though… So there are those who have reincarnated from a different world, huh?)</p><br/><p>(Ay. Although there haven’t been successful cases of world travel, some have wandered from there to this side.</p><br/><p>A “Foreigner” and a “World Traveler”–so they are called, and they possess special intellect. Also, they tend to have acquired some special skills.</p><br/><p>Records of reincarnated being renowned for their wisdom do remain. Though there are most likely those that were never recognized.)</p><br/><p>I see. Other worlds.. I do not know whether they are from my Earth or not, but meeting them would not be a bad idea.</p><br/><p>Maybe, there are a few Japanese around.</p><br/><p>Might as well make meeting one my goal.</p><br/><p>(I see! In that case, I’ll go see if I can meet any “World Traveler”. Maybe, I’ll find a compatriot among them.)</p><br/><p>(Still, little one. You can’t even see.)</p><br/><p>(Ah… right.)</p><br/><p>If I can’t see, then what?</p><br/><p>It’s inconvenient, but if I carefully hop around, I’m certain to meet them someday. Probably.</p><br/><p>(I shall restore your sight.)</p><br/><p>Huh? What?</p><br/><p>Oi oi, this old man, no, this Storm Dragon Veldora… ain’t he a good man (dragon)?</p><br/><p>Can I really expect this miracle?</p><br/><p>(Eh? Will you really?)</p><br/><p>(Ay. But, there is a condition. How about it?)</p><br/><p>A condition… huh. Ominous, but…</p><br/><p>(What sort of condition?)</p><br/><p>(A simple one. When you regain your sight, do not fear me. And, please come talk to me again. How about it?)</p><br/><p>Is just that fine?</p><br/><p>And could it be… was this dragon just lonely? Solitude borne of strength?</p><br/><p>And just as I thought the conversation went on for a while. He must not have had anyone to talk to in a while.</p><br/><p>Maybe he’s just a big softy.</p><br/><p>But, maybe he’s not even a real dragon. Or maybe the dragons of this world aren’t all that impressive.</p><br/><p>Yup. This is certainly a good deal.</p><br/><p>(Is just that much enough?)</p><br/><p>(Ay. Truth be told, I had been sealed away for three hundred years. And so, I have been so plagued by boredom. How about it?)</p><br/><p>(If you are alright with it, then I will happily accept!)</p><br/><p>(Ay. Then it’s a promise. Keep it!)</p><br/><p>(I will! As they say, I am a dependable slime!)</p><br/><p>Of course, only I think so.</p><br/><p>(Very well. There exists a [Magic Perception] skill. Can you use it?)</p><br/><p>(No, I cannot. What type of skill is it?)</p><br/><p>(You perceive the surrounding magical energy. It’s not a major skill, and acquiring the skill is rather simple.)</p><br/><p>(Ho ho. Simple you say!))</p><br/><p>※Truly, it is actually not simple at all.</p><br/><p>(Ay. For those like I, it is as simple as breathing–you don’t even know you are doing it.)</p><br/><p>(I see! If I were to acquire it, would I be able to see?)</p><br/><p>(That is the idea. The world is covered in magical energy. There is a difference in concentration. And, light and dark possess a wave like property, did you know?)</p><br/><p>(Yeah, light wave and dark waves, right?)</p><br/><p>(You know well, is that knowledge from the other world? Well, it is so.</p><br/><p>But observing these fluctuations, you can calculate the appearance of the surrounding. Simply, right?)</p><br/><p>Haa? What the hell?</p><br/><p>This guy… how is that simply?!</p><br/><p>(Iya~, sounds a little difficult…)</p><br/><p>(What? With this, even if your eyes and ears are crushed, you can continue combat. Ambushes become impossible. It’s an indispensable skill!)</p><br/><p>(Iyaiyaiyaiya! Let’s leave the matter of combat aside from now, I just want to be able to see!)</p><br/><p>(Muu~, if you say so. I’ll help with acquisition! And by the way, I don’t know another way!)</p><br/><p>(Wha… can you even do it?! Aren’t you a beginner at this yourself?)</p><br/><p>(Don’t worry. You are among the lucky few who possesses past world memories. Thus, you know what light and darkness looks like.</p><br/><p>If you had not known, making you see would have been impossible even for me. You are indeed blessed!)</p><br/><p>I see, explaining light and darkness would be difficult for those who have never seen them</p><br/><p>I know I couldn’t do it.</p><br/><p>It took Hellen Keller 2 years to learn the meaning of words.</p><br/><p>In other words, due to other world’s knowledge, I can obtain pseudo-sight and hearing through the [Magic Perception] skill…</p><br/><p>Not like I can refuse to try anyways.</p><br/><p>Being unable to see is far too inconvenient.</p><br/><p>Moreover, I’ve forgotten about it, but I also have the [Great Sage] skill.</p><br/><p>Surely something will come from this!</p><br/><p>(Please teach me!)</p><br/><p>(Nay, fret not; it is truly simple. First, try to move the magical energy inside your body.)</p><br/><p>This, I somehow understand. I think I can use the same principle as moving through the water.</p><br/><p>(Like this?)</p><br/><p>While enclosing it in my body, I verify movement of magical energy.</p><br/><p>(Ay. Though you said otherwise, you seem quiet apt at this. In this case, the energy that moves within you and that which is beside you–do you feel the difference?)</p><br/><p>This is actually pretty simple.</p><br/><p>It’s a good thing I spent all that time feeling magical energy–I mean, I live by absorbing it after all! Feeling it is a must!</p><br/><p>(That much I understand! Since I eat it, you know?)</p><br/><p>(Kukuku. Since you understand that much, the rest is simple. Feel the movement of magical energy outside of yourself.)</p><br/><p>That’s what I don’t understand, though.</p><br/><p>Anyways, as instructed, I tried to feel it.</p><br/><p>I do feel it swaying. Back and forth, back and forth…</p><br/><p>Right! Let’s active [Great Sage]!</p><br/><p>＜＜Verified. Extra skill [Magic Perception]… has been succesfully acquired＞＞</p><br/><p>＜＜Will you use extra skill [Magic Perception]? [YES]/[NO]＞＞</p><br/><p>Eh?</p><br/><p>Did I really just acquire it that easily?</p><br/><p>Well yeah, of course, [YES].</p><br/><p>As expected, [Great Sage] is reliable as always!</p><br/><p>The moment I had activate the extra skill [Magic Perception], my mind was filled with information.</p><br/><p>Never, even as a human, had I processed that much information at once.</p><br/><p>Little by little, magical energy moving along–waves of light and darkness.</p><br/><p>Having grasped all of the incoming information, I convert it into one I can understand.</p><br/><p>And so, I can now see 360 degrees around me, without a single blindspot.</p><br/><p>A boulder’s shadow, the scenery 100 meters away: if I direct my consciousness there, I can see it.</p><br/><p>If a human’s mind was filled with that much information… it just might fry.</p><br/><p>But, I am a slime. Every one of my cells is a muscle and a brain cell!</p><br/><p>I can definitely manage this much.</p><br/><p>And so…</p><br/><p>＜＜Linking extra skill [Magical Perception] and unique skill [Great Sage]… complete＞＞</p><br/><p>My field of vision cleared up.</p><br/><p>Moreover, I was not attacked by a burning pain in my brain.</p><br/><p>That I wasn’t able to do this until now is strange in itself, this is an obvious form of “vision”.</p><br/><p>[Great Sage] just might be a cheat.</p><br/><p>That certainly is not an overstatement.</p><br/><p>If others held it, I would certainly be crying foul. But the one possessing it, is me.</p><br/><p>So there’s no problem.</p><br/><p>(Well… I somehow seem to have managed it. Thank you very much!)</p><br/><p>When I said that, I finally beheld “that.”</p><br/><p>What do you know… a real dragon.</p><br/><p>Gleaming like black steel, flexible and durable, like the scales of a fish….</p><br/><p>The visage of an evil dragon…</p><br/><p>(Geh! Dragon!!!!!!)</p><br/><p>An appearance more evil than I was expecting, a scream had escaped from my heart.</p><br/><p>.</p><br/><p>.</p><br/><p>Status</p><br/><p>Name: Mikami Satoru</p><br/><p>Species: Slime</p><br/><p>Title: None</p><br/><p>Magic: None</p><br/><p>Techniques: Unique Skill [Great Sage], Unique Skill [Predator], Slime-specific skill [Dissolve], [Absorption], [Regeneration], skill [Hydraulic Propulsion], Extra Skill [Magic Perception].</p><br/><p>Resistances: Thermal Fluctuation Resistance EX, Physical Attack Resistance, Pain Resistance, Electricity Resistance, Paralysis Resistance.</p><br/><p>TL Note: Majin , would be translated as either magical men or demonic men. The closest word we have in English would probably be devils, but the author decided to use it later. Thus, I decided to leave it as it is.</p><br/>\n</div>"}