{"title": "Chapter 07 – First Battle", "id": 7, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-07-%E2%80%93-first-battle", "volume_title": "Volume 1", "body": "<h1>Chapter 07 – First Battle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner (Cast: An English Clown and a French Pierrot)</p><br/><p>Clown: Opening day for our first new banner!</p><br/><p>Pierrot: … *Sob*… why am I not there?</p><br/><p>Clown: Umm… not the right scenery?</p><br/><p>Pierrot: I quit.</p><br/><p>Clown: Wait, wait! Listen. This was just practice–a temporary solution. The resolution was wrong so the quality is bad.</p><br/><p>Pierrot: That’s what they all say!</p><br/><p>Clown: Okay, here’s the truth… the drawing tablet broke… so until I fix it, just hang in there!</p><br/><p>Pierrot: Promise?</p><br/><p>Clown: Absolutely!!!</p><br/><p>Pierrot: Very well…</p><br/><p>Clown: Oh and speaking of hanging, I’ve heard a politician say this: “I think they should bring back hanging and we should watch it live on TV and call it Noose at 10”!</p><br/><p>Pierrot: I’ll take you up on that…</p><br/><p>Clown: No, wait!!!</p><br/><p>.</p><br/><p>.</p><br/><p>Empowerment Arc</p><br/><p>Chapter 07 – First Battle</p><br/><p>A path leading out of from the underground lake.</p><br/><p>It was a single tunnel.</p><br/><p>With a *boyo boyo*, I ascend the path.</p><br/><p>Moving around is actually more pleasant than you’d expect.</p><br/><p>Even places that light fails to reach are perfectly visible to [Magic Perception].</p><br/><p>I would more around slowly–checking every step–when I was blind; and, slimes aren’t that fast to begin with.</p><br/><p>Now, I normally move at a walking pace, but can also run. Nor do I get tired.</p><br/><p>But, since I don’t have any reason to hurry, I move at a moderate pace.</p><br/><p>I swear this is not the result of a trauma from the first time I ran and fell into the lake!</p><br/><p>A short while after, a giant gate had appeared before my eyes.</p><br/><p>A human made structure inside the cave.</p><br/><p>Nothing that strange about it. But, that’s because this development is common in RPGs.</p><br/><p>It’s normal to have a door in front of the boss’s room.</p><br/><p>So… how should I get it open?</p><br/><p>Should I cut it with the [Water Blade]?</p><br/><p>When I though that,</p><br/><p>Gigigiiiiiii!!!</p><br/><p>With a creaking noise, the door is opening.</p><br/><p>A little flustered, I hid by the edge of the path, and observed the situation.</p><br/><p>「It finally opened, huh. Lock fell apart and the doors rusted…」</p><br/><p>「Hey, that’s only to be expected. Don’t they say that no one entered here in 300 years?」</p><br/><p>「Not on record, at least. But more importantly, are we really going to be fine? We won’t be attacked suddenly, right?」</p><br/><p>「Gahahaha! Don’t worry. He might have been unrivaled 300 years ago, but times have changed. I mean, ain’t he just a big lizard! I’ve subjugated Basilisks by myself. Leave it to me!!!」</p><br/><p>「About that, I’ve wondered for a while, but that’s a lie, isn’t it? Basilisks are ranked B+, right? Solo subjugation would be impossible for Cabal-san, wouldn’t it?」</p><br/><p>「Fool! I am a B rank myself! They are just big lizards; no trouble at all!」</p><br/><p>「Okay, okay, I got it, so would you please not let your guard down? Well, if it comes down to it, I’ll just escape using “Forced Withdrawal”…」</p><br/><p>「Guys, I got the extent of your friendship, so could you please be quiet? You’ll blow my “Camouflage Skill”」</p><br/><p>Somehow, a boisterous trio had entered.</p><br/><p>I wonder why…</p><br/><p>Actually… why do I understand their words?</p><br/><p>＜＜Solution. In cases where intentions are vocalized, [Magic Perception] converts them to appropriate words and transmits them to the brain.＞＞</p><br/><p>I see.</p><br/><p>I can’t talk to them, but at least I can understand them.</p><br/><p>Thank goodness. I had always been bad with English.</p><br/><p>I think that if you live in Japan there should be no need to study foreign languages.</p><br/><p>Those who plan to go abroad can struggle by themselves.</p><br/><p>But that excuse won’t work here. I’ll probably have to learn eventually.</p><br/><p>Well, that matter can rest for now.</p><br/><p>What should I do?</p><br/><p>This dilemma is worse than the previous one–how to open the door.</p><br/><p>I don’t know what they came to do… but they seem like adventurers.</p><br/><p>Did they come searching for treasures and stuff?</p><br/><p>They are the first humans I meet in this world. sort of want to go and greet them.</p><br/><p>But… if a mute monster slime (a.k.a I) were to go out there…</p><br/><p>I’d be killed without questions.</p><br/><p>Let’s wait for now.</p><br/><p>Meeting humans will have to wait until I can talk.</p><br/><p>For now, I observed this situation in hiding.</p><br/><p>After the skinny man had done something, the appearance of the three has dimmer. But, I can still see them.</p><br/><p>Did he call this… camouflage?</p><br/><p>Probably a type of skill.</p><br/><p>Is he just trying to peek? What an outrageous guy… Does he even know why they came here?</p><br/><p>Probably should get to know him later.</p><br/><p>When the three had finally left, I started moving again.</p><br/><p>Nothing to worry about.</p><br/><p>Not like I won’t meet people anymore.</p><br/><p>I’ll move while checking every step. As people have always said, “haste makes waste”.</p><br/><p>Leaving these matters for later, I quickly went through the gate in case the three had returned.</p><br/><p>.</p><br/><p>A little while past the gates the path diverged and became rather complex.</p><br/><p>I wonder which way leads to the surface?</p><br/><p>Though even if I thought about it, there’s no way for me to know.</p><br/><p>I chose a path and went down it.</p><br/><p>*Chiro chirori!*</p><br/><p>Our eyes met.</p><br/><p>Just a bit above the ground… in front of my eyes, there was a giant serpent.</p><br/><p>Like the past world’s snakes, you could consider it cute. It was harder, covered in scales, and pitch black in color.</p><br/><p>Like a frog in front of snake? Nope, I am a slime, not a frog.</p><br/><p>Let’s pretend I’m air. It would be best, though, if it doesn’t notice me.</p><br/><p>Well, let’s just try to slither away.</p><br/><p>*Kisha–!!!*</p><br/><p>I was threatened.</p><br/><p>No good. I won’t let you go! Or so it would probably say if I could hear it.</p><br/><p>A fight, huh…!</p><br/><p>I have a secret skill that I gained from a week’s long practice!</p><br/><p>But even so… you’ve got to be resolved to die if you want to fight this beast.</p><br/><p>To summarize, I’m pretty darn scared!</p><br/><p>Don’t panic. If I think hard enough, I can imagine something far scarier.</p><br/><p>Yes, Veldora. Let’s compare it to that dragon.</p><br/><p>Oh? Doesn’t seem that scary now.</p><br/><p>Can’t I do this?</p><br/><p>After calming myself, I began quietly observing the serpent.</p><br/><p>The snake seems to have let its guard down, thinking I was so afraid I that I couldn’t move.</p><br/><p>Probably planning on how it will cook me.</p><br/><p>Yeah.</p><br/><p>Well then, let’s not hold back either…</p><br/><p>*Bishun!*</p><br/><p>Without hesitation I fired a “water blade” at the serpent’s neck.</p><br/><p>*Zuban!!! Hyuuuun, dosu. Gorogoro… zun.*</p><br/><p>It was but a moment.</p><br/><p>I couldn’t believe my eyes.</p><br/><p>Without even a hint of resistance the “water blade” beheaded the serpent.</p><br/><p>I could only gulp; up until a second ago, there was an ominous sneak right there.</p><br/><p>This… is even more powerful than I had thought.</p><br/><p>Had I been forced to use it on the adventures, it would end gory. Good thing my first enemy was a monster.</p><br/><p>Oh and by the way, my stomach is currently occupied at 30%: Veldora 15%, Water 10%, Medicine and other crap 2%, metals and resources 3%.</p><br/><p>“Water Bullet” uses less than a cup of water (and I can regulate the size–with the intention of increasing it, of course).</p><br/><p>Thus even if I fire thousands of these, I won’t have to worry about the amount left.</p><br/><p>This just might be better than magic.</p><br/><p>If monsters come out, let’s meet them with a “water blade”.</p><br/><p>.</p><br/><p>Now, about this snake.</p><br/><p>If I eat and analyze it, would I steal its powers?</p><br/><p>Well, let’s try it.</p><br/><p>The result…</p><br/><p>Inherent skill [Heat Detection]… the ability to see nearby heat sources. Furthermore, camouflage skills are nullified.</p><br/><p>Inherent skill [Noxious Mist Breath]… the ability to release a powerful toxic (corrosive) breath. Released at 120 degrees for a distance of 7 meters.</p><br/><p>(TL Note: 22 feet)</p><br/><p>Along with these two skills, I could also mimic the snake.</p><br/><p>The poison’s main effect seems to be corrosive damage (damage to both equipment and flesh). Would be pretty effective against normal adventurers, eh?</p><br/><p>Though with this world’s magic, it just might be an easy win.</p><br/><p>And so I spent some time analyzing the snake’s skills.</p><br/><p>Best to increase my hand while I can.</p><br/><p>Things I’ve confirmed:</p><br/><p>1. I’ve gained the ability to transform into the snake.</p><br/><p>2. I can use the acquired skills even without transforming. But, their strength decreases.</p><br/><p>Those two things.</p><br/><p>If I had to explain them,</p><br/><p>1. … I can stock up on the bodies of monsters I ate and analyzed.</p><br/><p>My body had repaired the section I previously damaged, but it kind of has the feel of stitches… made with cells.</p><br/><p>2. … Inherent skills are skills specific to that monster race. Similar to my [Dissolve, Absorb, and Regenerate].</p><br/><p>Regarding the skill, if I am not transformed into the appropriate monster, I cannot use it with 100% effectiveness.</p><br/><p>However, there also skills like [Heat Detection], which I can make completely my own.</p><br/><p>To summarize, it’s like this.</p><br/><p>I totally dig [Predator].</p><br/><p>It’s another skill which is super useful.</p><br/><p>3 days have passed since I fought the snake.</p><br/><p>I’m still inside the cavern.</p><br/><p>I don’t feel cold, but it’s probably below freezing in here.</p><br/><p>Sunlight doesn’t reach here at all.</p><br/><p>And so, I kept worrying over one fear.</p><br/><p>I know, I know.. there’s no way it’s true.</p><br/><p>But no matter what, I just couldn’t get it out of my head.</p><br/><p>Yeah… what if…</p><br/><p>I am lost?</p><br/><p>No, no, there’s no way.</p><br/><p>I mean… right? Who’s heard of someone getting lost in the beginner’s cave?</p><br/><p>Isn’t this supposed to be the easiest part?</p><br/><p>Besides, even those three adventurers got this far without being lost.</p><br/><p>I should be fine. It’s probably just a long path.</p><br/><p>But, it’s probably a good thing I was reborn as a slime.</p><br/><p>Had I come here as a normal “World Traveler”, I’d definitely collapse from hunger by now.</p><br/><p>Who would have thought that I’d be thankful for being a slime.</p><br/><p>However, not knowing the way is troubling.</p><br/><p>Isn’t there like a map of this place or something?</p><br/><p>＜＜Solution. Should I display the current location? [YES]/[NO]?＞＞</p><br/><p>Replay the current narration..?</p><br/><p>Just couldn’t help making a pun.</p><br/><p>But seriously, what the hell! Let me know sooner if I have such a useful ability!!!</p><br/><p>Absolutely [YES]!</p><br/><p>Curse you auto-mapping!</p><br/><p>I also had a time when I thought that.</p><br/><p>Back in old games, you’d sit down with a pencil and a piece of paper, and record every step to get to the goal.</p><br/><p>It was fun to plan every step.</p><br/><p>However, many people began relying on game guides, and eventually mapping became a standard game feature.</p><br/><p>No more pleasure of the hunt…</p><br/><p>Moreover, had you gotten used to that feature once, you can never go back again.</p><br/><p>Well, it’s also true that without this feature, you’d be stuck in most recent games.</p><br/><p>Anyways, let’s put this useful skill to use.</p><br/><p>I look at the map displayed in my head.</p><br/><p>This has got to be some mistake… I’ve been walking in circles.</p><br/><p>For me, who has compiled game guides before, to have been lost?! Impossible!</p><br/><p>…………</p><br/><p>…….</p><br/><p>…</p><br/><p>Definitely possible.</p><br/><p>According to the map, I’ve entered previously unexplored regions.</p><br/><p>So, I’ve spent three days looking at the world no one has seen before.</p><br/><p>Fufufu.</p><br/><p>To have mislead me… the dungeon is a worthy opponent!</p><br/><p>Let’s pointlessly praise the dungeon.</p><br/><p>And don’t even begin to think that I have no sense of direction!</p><br/><p>Is the entrance close by?</p><br/><p>There is various moss and weed growing around here.</p><br/><p>The light reaches from somewhere, bathing the grass in light and color.</p><br/><p>So it must be day.</p><br/><p>I’ve fought many battles to come this far.</p><br/><p>A centipede monster (Evil centipede: rank B+)</p><br/><p>Big, black spider (Black spider: rank B)</p><br/><p>Vampire bat (Giant Bat: Rank C+)</p><br/><p>Carapace Lizard (Ammosaurus: rank B-)</p><br/><p>Those are the four species I encountered.</p><br/><p>There was that one serpent, but I haven’t seen another.</p><br/><p>They were all powerful foes.</p><br/><p>Defeated with one “Water Blade”…</p><br/><p>Well, the bat evaded it a few times, and the shooting angle was bad for the centipede.</p><br/><p>Can’t relax just yet.</p><br/><p>For example, the centipede erased its presence and attacked from behind.</p><br/><p>Luckily, that kind of attack wouldn’t work on someone with [Magic Perception] and [Heat Detection].</p><br/><p>So I shot out a few water blades from my back.</p><br/><p>The big spider was pretty dangerous.</p><br/><p>In the first place, I’m no good with spiders.</p><br/><p>It’s a psychological thing. Just a sight of one makes me want to cower.</p><br/><p>But, maybe due to my heart become stronger through reincarnation, I somehow managed to fight without running away.</p><br/><p>My bad, but I’m going full force! With that thought, I cut it up with five water blades.</p><br/><p>It wasn’t an opponent I wanted to look at, after all.</p><br/><p>And of course, I ate them all.</p><br/><p>It’s survival of the fittest in this world. If you lose, you get eaten.</p><br/><p>And well, I did hesitate to eat the centipede and the spider.</p><br/><p>But I did do my best.</p><br/><p>But, if a cockroach monster exists, I’ll absolutely run away without eating it.</p><br/><p>There’s these wonderful words in this world: he who fights and runs away will live to see another day.</p><br/><p>Here’s the skills I got as a result,</p><br/><p>Centipede monster [Paralysis Breath]</p><br/><p>Big spider [Sticky Thread, Steel Thread]</p><br/><p>Vampire Bat [Vampirism, Ultrasound Waves]</p><br/><p>Carapace Lizard [Body Armor]</p><br/><p>And so, having gotten my hands on new powers, I successfully left the cave.</p><br/><p>For the first time since being reborn, I was bathed in the light of the sun.</p><br/><p>Status</p><br/><p>Name: Rimuru Tempest</p><br/><p>Species: Slime</p><br/><p>Divine Protection: the Storm Crest</p><br/><p>Titles: None</p><br/><p>Magic: None</p><br/><p>Skills: Unique Skill [Great Sage], Unique Skill [Predator], Slime-Specific Skills [Dissolve, Absorb, Regenerate], Extra Skill [Water Manipulation], Extra Skill [Magic Perception], Acquired Skill–Serpent [Heat Detection, Noxious Breath], etc.</p><br/><p>Resistances: Thermal Fluctuation Resistance, Physical Attack Resistance, Pain Resistance, Electricity Resistance, Paralysis Resistance.</p><br/>\n</div>"}