{"title": "Chapter 18 – The End of Turmoil", "id": 18, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-18-%E2%80%93-the-end-of-turmoil", "volume_title": "Volume 1", "body": "<h1>Chapter 18 – The End of Turmoil</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner (Cast: an English Clown and a French Pierrot)</p><br/><p>Clown: First, for those who only follow my translation, for chapter 14-17 please refer to links provided on the chapter list page. As appeared in chapter 14, I think, the skill I previously translated as [Coercion] will now be known as [Intimidation]. Other notes…</p><br/><p>Pierrot: Are you going to explain why you fear mimes?</p><br/><p>Clown: Where?!… those terrifying creatures… they don’t speak, create invisible furniture. They twist reality! I have always viewed them as proof of Descartes’ methodic doubt</p><br/><p>Pierrot: Umm… what?</p><br/><p>Clown: His famous principle? That the only fact we can be sure of is that we, ourselves, exist.</p><br/><p>Pierrot: What’s the punchline?</p><br/><p>Clown: There is none.</p><br/><p>Pierrot: Hilarious. Have you ever considered a career as a Clown?</p><br/><p>Clown: …</p><br/><p>Pierrot: Never even considered it, huh?</p><br/><p>Clown: I am a Clown!</p><br/><p>Pierrot: No way. Clowns make people laugh, not report on the situation.</p><br/><p>Clown: Fine! What happens when a frog’s car breaks down? It gets toad away!!!</p><br/><p>.</p><br/><p>.</p><br/><p>Empowerment Arc</p><br/><p>Chapter 18 – The End of Turmoil</p><br/><p>Now… then.</p><br/><p>Of course, hitting a Cabinet Minister is very bad.</p><br/><p>Of course…</p><br/><p>「Brother… what have you done?」</p><br/><p>So said Kaidou, having brought in the soldiers.</p><br/><p>Never missing a day of service, his earlier absence was surprising.</p><br/><p>He was so diligent, that even when invited to go drinking, he’d refuse by saying he had duties to attend to.</p><br/><p>Thus, for an incident to occur while he was on duty, was naturally surprising.</p><br/><p>They could easily run away, but that would be a poor choice…</p><br/><p>「Hmph! Just some light punishment the idiot who dared being rude to my benefactor Rimuru-danna.」</p><br/><p>He replied while pointing at Minister Bester who was being nursed by four soldiers.</p><br/><p>Bester, on the other hand, was so shocked and surprised that he couldn’t even stand.</p><br/><p>Blood was dripping from his nose, he glared stupidly at me.</p><br/><p>Not even in his wildest dreams had he imagined being punched. Thus, he was so surprised, that he probably didn’t even feel the pain.</p><br/><p>「Oi oi… “just some light punishment”…? Making an enemy of the minister is very bad…」</p><br/><p>Kaidou muttered with a foreboding sigh.</p><br/><p>「Anyways… I’ll have to restrain the people present.」</p><br/><p>He said, and gave his subordinates an order.</p><br/><p>But, only audible to us, he added,</p><br/><p>「We won’t harm you, so please come peacefully!」</p><br/><p>He mumbled.</p><br/><p>Of course, I had no intention of causing further trouble.</p><br/><p>Thus, moving towards Mama-san, I handed her five gold coins.</p><br/><p>And, in reply to her surprise,</p><br/><p>「I included the inconvenience fee! I’ll be back!」</p><br/><p>Such were my salutations.</p><br/><p>This is a good shop, and I’d be very upset if I could no longer come here.</p><br/><p>That is how we were being escorted away by the soldier… aren’t we forgetting something?</p><br/><p>Right! We forgot Gobuta.</p><br/><p>We didn’t bring that idiot to the shop.</p><br/><p>In any case, that foolish action seems to have earned Kaijin the punishment in the “Psychidae Hell”.</p><br/><p>I’d thought they’d hang him upside down or something, so this seems bad.</p><br/><p>Which is why, I wrapped Gobuta up with [Sticky Thread] and hung him from the ceiling.</p><br/><p>「Wait! That’s heartless! Take me there, too!!!」</p><br/><p>And though he cried out similar grief-stricken phrases, hoping that we’d listen.</p><br/><p>But to these words,</p><br/><p>「Idiot! Your actions have their own consequences! If you don’t like it, just summon up the rest (storm fang wolves)!」</p><br/><p>We left him with hanging there with, what we thought, was an impossible task.</p><br/><p>Anyways, the goblins, or rather the hobgoblins, should be fine even if they receive no food or water for a week.</p><br/><p>Though if it the confinement continues any longer, we’ll have to break out and save Gobuta.</p><br/><p>And having so decided, I forgot about him for the time being.</p><br/><p>My conscience did ask “Isn’t this too pitiful?”, but he’s a sturdy guy! He’ll be fine!</p><br/><p>So the five of us were brought into the royal palace.</p><br/><p>But I may have exaggerated a bit–we weren’t restraint with much force. Felt more like we were coming voluntarily. Well, were coerced into doing so…</p><br/><p>As a result, we spent two days in prison.</p><br/><p>Or so I’d like to call it, but we received good food and the room was amicably furnished.</p><br/><p>All five were placed in the same place, so rather than a prison, it was just a big room.</p><br/><p>Their treatment of us was also relatively pleasant.</p><br/><p>「My short temper got you in this mess… forgive me!」</p><br/><p>Kaijin came over to apologize.</p><br/><p>However, no one gathered here particularly minded in the first place.</p><br/><p>「Kaijin-san, we’re fine! Don’t sweat it!」</p><br/><p>「Exactly. Don’t worry about it, pops!」</p><br/><p>「….!.」</p><br/><p>The three seemed to be of the same opinion.</p><br/><p>「That aside, once we’re freed, we intend to come along with Kaijin-san!」</p><br/><p>「Rimuru-danna, would our presence be a bother?」</p><br/><p>「……??」</p><br/><p>The third also seemed like he wanted to say something, but as I clearly lack the power to understand, I was just happy with the sentiment.</p><br/><p>「Alright! I guess I’ll say it again: you’ll be in my care! However, I plan to work you hard, so be prepared!」</p><br/><p>「「「Yeah!」」」</p><br/><p>And, well, that’s the kind of discussion we had.</p><br/><p>The first day had thus passed, and on the second night,</p><br/><p>「Oh, about that Cabinet Minister, he really seemed to hate Kaijin, didn’t he? Is there a reason for that?」</p><br/><p>I nonchalantly asked.</p><br/><p>But hearing this, Kaijin grimaced, and began his tale.</p><br/><p>So apparently Kaijin used to be one of the captain’s of the royal knights.</p><br/><p>That is, there are seven platoons among the royal knights, with each having their own captain.</p><br/><p>Construction Platoon, Commoner Platoon, Emergency Relief Platoon.</p><br/><p>Heavy Armament Platoon, Magic Assault Platoon, Magic Support Platoon.</p><br/><p>And, the most important, the King’s personal Royal Guard.</p><br/><p>Kaijin served as the captain of the construction platoon.</p><br/><p>His aide at the time, was none other than Bester.</p><br/><p>「That guy, was from a family of a Marquess, and they say he bought his status with gold… Thus he was jealous of me, who was a commoner born of commoners.</p><br/><p>Must have been difficult, I imagine. Receiving orders from a mere commoner must have been very disgraceful.</p><br/><p>I, myself, did not try to be considerate of my subordinates’ feelings. I just desperately tried to please his Majesty…</p><br/><p>And then, that incident occurred…」</p><br/><p>Having so it introduced, he continued to discuss that incident.</p><br/><p>An incident that resulted in Kaijin leaving the army.</p><br/><p>Magic Battle Gear Incident.</p><br/><p>At the time, the construction platoon had no new inventions and was evaluated the worst among the seven platoons.</p><br/><p>“In a nation founded on technological progress, the Construction Platoon should be flourishing!” So claimed Bester’s group.</p><br/><p>“For now, we should carefully continue our research!” So claimed Kaijin’s group.</p><br/><p>The arguments fueled further rivalry, and debates never produced any results.</p><br/><p>At the same time, they did have a joint project with the Elves on the “Magical Battle Gear”.</p><br/><p>“We must succeed with this project and forever establish our name!” was what Bester thought.</p><br/><p>As a result of his independent and rash action, the “Demonic Sorcery Core” had gone out of control, and the project halted indefinitely.</p><br/><p>Had they carefully assembled the most talented group, the “Magic Battle Gear” project would not have met such an end!</p><br/><p>……….</p><br/><p>……</p><br/><p>…</p><br/><p>In conclusion, Kaijin took the blame, and left the army.</p><br/><p>As for Bester, he was so desperate to push his failure on Kaijin, that he had forged military records and planted other false evidence.</p><br/><p>In short, Bester is a stereotypical villain. And in some sense, he’s easy to understand.</p><br/><p>So to summarize, “Kaijin was waiting for the time the country would need him and would immediately jump at the opportunity to come back, without realizing that it would cause him harm!”–that kind of story?</p><br/><p>But really, wouldn’t the death penalty suit cowardly bastards like Bester the best? Well, maybe the death penalty would be going too far.</p><br/><p>「Well, in any case, with my departure, maybe even he can finally relax.」</p><br/><p>Those words ended his tale.</p><br/><p>After hearing about the incident, the three brothers also seem to have started to hate the Minister.</p><br/><p>Well, such a story will make even me hate him.</p><br/><p>However, he did hit a noble.</p><br/><p>It would be strange for him to leave without any trouble.</p><br/><p>And in response to my worries,</p><br/><p>「It should be fine, probably. Although retired, my position as a captain did earn me the rank of Baronet.</p><br/><p>Had it been a case of a commoner hitting a noble, I probably wouldn’t be able to avoid the death penalty!」</p><br/><p>Having said that, he laughed loudly.</p><br/><p>I couldn’t laugh at all, though…</p><br/><p>If worst comes to worst, we’re breaking out! As for the completely unrelated person–me, I’ll just pretend to be a normal slime until things quiet down.</p><br/><p>So I silently thought</p><br/><p>And, the day of the trial came.</p><br/><p>We were lead before the king.</p><br/><p>The dwarfs’ Hero King.</p><br/><p>Though in front of him, you couldn’t feel that overpowering aura.</p><br/><p>The current king–Gazelle Dwargo.</p><br/><p>With his eyes closed, he sits deeply on the throne.</p><br/><p>Looking like a typical dwarf, he had a sturdy build. His armor concealed his excessive energy.</p><br/><p>Though he could easily be distinguished by his darker skin, and jet black hair, swept back.</p><br/><p>He’s strong!</p><br/><p>Been a while since my instincts last cried out in alarm.</p><br/><p>To both of his sides, the knights stand at attention.</p><br/><p>Though I feel that those two are strong as well, they seem dull in comparison to the king.</p><br/><p>As that guy is just a monster.</p><br/><p>I had planned to run away if needed, but with this…</p><br/><p>His mere presence forced my distracted mind to focus.</p><br/><p>This was probably the first time I felt danger in this world.</p><br/><p>There was one man kneeling before the king as if confirming something.</p><br/><p>Having received the king’s permission, he stood, and,</p><br/><p>「The trial shall now begin! Silence your voices!!!」</p><br/><p>He informed us of its beginning.</p><br/><p>Taking up an hour, both sides’ stories were presented.</p><br/><p>The parties in question–ourselves–were not permitted to speak.</p><br/><p>The only ones who could freely speak are nobles rank “Count” and above.</p><br/><p>The rest, must wait for the king’s explicit permission.</p><br/><p>If I had to speak, what would I say?</p><br/><p>Speak out of turn, and your guilt shall be confirmed. Moreover, we’ll also include a free “Insult the King” special!</p><br/><p>Even if the charges against you were false, the rules stay the same.</p><br/><p>No choice but to leave everything to your representative.</p><br/><p>That representative, these past two days, has shown his face many times.</p><br/><p>If I had to say, he’s kind of like our lawyer.</p><br/><p>I wonder if he’s any good?</p><br/><p>Those kind of worries tend to prove true too often…</p><br/><p>「Thus, in this way, the drunk and relaxed Bester-dono, while making his way into another shop, was assaulted!</p><br/><p>Such action must not be pardoned easily!!!」</p><br/><p>「Is that the truth?」</p><br/><p>「Ay! I, more than listening to Kaijin-dono, have investigated with the shop owners!</p><br/><p>All my previous statements are, in fact, completely true!!!」</p><br/><p>… Huh? Umm… what did he say?</p><br/><p>Someone we thought to be our ally had unexpectedly betrayed us?</p><br/><p>Isn’t this… bad?</p><br/><p>When I look at Kaijin’s face, it first turned bright red, but slowly paled.</p><br/><p>Well, that’s to be expected.</p><br/><p>I mean, he can’t even complain.</p><br/><p>Oh and by the way… the representative is not allowed to lie.</p><br/><p>If his lies get revealed, he gets the death penalty. So without some extreme circumstances, to lie is unthinkable…</p><br/><p>Thus the system that forbids those of lower birth (in this case, the accused) to speak in front of the king, is being abused in the worst of ways.</p><br/><p>「Your Majesty! Have you heard enough? Please bestow a harsh punishment on them!」</p><br/><p>High with excitement, Bester proposes thus to the king.</p><br/><p>Moreover, while looking at us, he shows a triumphant smile.</p><br/><p>That bastard… I really should have clobbered him…</p><br/><p>The king, with his eyes closed, refuses to move a muscle.</p><br/><p>Seeing this, those close by announce his decision.</p><br/><p>「Silence!!! We shall now announce the verdict!</p><br/><p>Assailant, Kaijin! You are sentenced to 20 years of forced labour in the mines.</p><br/><p>The rest, accomplices! You are sentenced to 10 years of forced labour in the mines.</p><br/><p>That, concludes this…」</p><br/><p>「Wait…」</p><br/><p>A deep, heavy voice resounded through the hall.</p><br/><p>The king opened his eyes and looked at Kaijin.</p><br/><p>「It’s been a while, Kaijin! Are you in good health」</p><br/><p>「… Ay! More importantly, I am happy to see his Majesty in good health!」</p><br/><p>Thus answered Kajin.</p><br/><p>Seems like answering the King’s questions is allowed.</p><br/><p>「Enough. Those with you are the real question! Do you have intention of returning to service?」</p><br/><p>The hall immediately filled with noise.</p><br/><p>Bester’s face turned blue.</p><br/><p>The representative who betrayed us, turned deathly pale.</p><br/><p>「I fear, your Majesty, I already have a master!</p><br/><p>That pledge has become this one’s treasure. This treasure, even if it be his Majesty’s order, I shall never part with!!!」</p><br/><p>Angry words resounded in return.</p><br/><p>The Royal Guard directed their killing intent at Kaijin.</p><br/><p>Even then, Kaijin faced the king without a hint of fear, but rather with grand price.</p><br/><p>Seeing this, the king closed his eyes again.</p><br/><p>「Is, that so…」</p><br/><p>Having so muttered,</p><br/><p>He ordered his attendant to call silence again.</p><br/><p>And,</p><br/><p>「I’ll declared the verdict. Steel your hearts!!!</p><br/><p>Kaijin and company, I deport you from the kingdom.</p><br/><p>You shall not be permitted to remain here even a single night longer.</p><br/><p>That is all. Now, begone from my sight…」</p><br/><p>The king opened his eyes wide and so proclaimed.</p><br/><p>That’s the air of the king!</p><br/><p>Intimidating enough to make my body tremble.</p><br/><p>But even so… the king looked rather lonely to me.</p><br/><p>And thus, with the conclusion of the trial, we returned to Kaijin’s store.</p><br/><p>Just went for a little drink, but it became such an incident.</p><br/><p>Now then, we need to quickly pack, and set off!</p><br/><p>And speaking off… is Gobuta alright?</p><br/><p>Well… only three days had passed…</p><br/><p>With some worry in my heart, we opened the “punishment room”, and…</p><br/><p>「Ah! You have returned! Was it fun? Next time, please bring me along!」</p><br/><p>Waking on top of the sofa, Gobuta said these word.</p><br/><p>What… the hell?</p><br/><p>How did he break free from the [Sticky Thread]?</p><br/><p>If I look closely… what I thought was a pillow as a storm wolf.</p><br/><p>Really? He really summoned them?!</p><br/><p>「Oi, oi, Gobuta-kun. You, were able to summon the wolves?」</p><br/><p>「Yeah! I was! “Please come!” I called, and they came!」</p><br/><p>He makes it sound too easy.</p><br/><p>No hobgoblin had succeeded with summons up until now.</p><br/><p>Maybe… did nutrient deprivation awaken some latent ability?</p><br/><p>Nah… no way. That’s impossible for Gobuta.</p><br/><p>Must have been just luck.</p><br/><p>And, that’s when I noticed the petrified dwarf that had finally noticed the wolf.</p><br/><p>「What are you doing? Not going to prepare?」</p><br/><p>I asked the dwarfs.</p><br/><p>「Oi, oi, wait a second! Why is there a black fang wolf in here!!!」</p><br/><p>「That’s right! There’s a B rank monster blocking our escape!!!」</p><br/><p>They seem to be panicking.</p><br/><p>That was an interesting… a comical reaction.</p><br/><p>「It’s fine, it’s fine! No problem. No different from your average dog! I keep him at home!」</p><br/><p>I had intended for those words to calm them, but they were struck speechless instead.</p><br/><p>Since we have no time, I couldn’t waste any of it for explanation.</p><br/><p>So while having the dwarfs change into traveling gear, I chased the rest out.</p><br/><p>Remaining in the building, I began to absorb everything.</p><br/><p>Not even close to full capacity.</p><br/><p>But, I decided to refrain from absorbing the whole building, as that would probably get me arrested again.</p><br/><p>Thus, we had finished the preparations for our journey, and thus we headed towards the meeting spot.</p><br/><p>Militaristic State Dwargon.</p><br/><p>We’d be involved with it many times from now on.</p><br/><p>But to us who were escaping from it, that kind of thing we could not even imagine.</p><br/><p>Status</p><br/><p>Name: Rimuru Tempest</p><br/><p>Species: Slime</p><br/><p>Divine Protection: the Storm Crest</p><br/><p>Titles: One who Commands Monsters</p><br/><p>Magic: None</p><br/><p>Skills: Unique Skill [Great Sage], Unique Skill [Predator], Slime-Specific Skills [Dissolve, Absorb, Regenerate], Extra Skill [Water Manipulation], Extra Skill [Magic Perception], Acquired Skills: Black Serpent [Heat Detection, Noxious Breath], Centipede [Paralysis Breath], Spider [Sticky Thread, Steel Threat], Bat [Ultrasound Waves], Lizard [Body Armor], Wolf [Supreme Sense of Smell, Telepathic Communication, Intimidation, Shadow Step, Black Lightning]</p><br/><p>Resistances: Thermal Fluctuation Resistance EX, Physical Attack Resistance, Pain Resistance, Electricity Resistance, Paralysis Resistance</p><br/><p>−−−−−−−−−−−−−−−−−−−−−−−−−−−−−</p><br/><p>That place was wrapped in silence.</p><br/><p>To such extent, that you wouldn’t believe it was ever noisy,</p><br/><p>Since the five criminals had been expelled from this hall, not a single person had moved.</p><br/><p>As if breaking the silence,</p><br/><p>「Now, Bester. Is there anything you’d like to say?」</p><br/><p>「Wi… with all due respect, your Majesty! This is a misunderstanding! There must be some mistake!」</p><br/><p>Such was Minister Bester’s unsightly appeal, that seemed to want to grab onto the king.</p><br/><p>In contrast, the King had showed no emotion, and remained stoic.</p><br/><p>「A misunderstand, huh… that would have been losing a faithful minister.」</p><br/><p>「What are you saying! I cannot fathom how come you believe that that man had sworn his loyalty to your Majesty…」</p><br/><p>「Bester! You are mistaken. The case with Kaijin had been lost long ago…</p><br/><p>The faithful minister I had lost, is none other than you.」</p><br/><p>A quiet voice revealing no emotion.</p><br/><p>Whereas Bester shrieked in response.</p><br/><p>“I must come up with an excuse!” He frantically thought.</p><br/><p>But he couldn’t form a coherent thought.</p><br/><p>What had, the king, just said?</p><br/><p>The one he lost is… me? That means…</p><br/><p>Bester wanted to come up with something. But no thoughts would form.</p><br/><p>「I’ll ask again. Bester. Do you have anything left to say?」</p><br/><p>Frightening.</p><br/><p>His head was filled with fear.</p><br/><p>I have to answer his question! He thought, but no words would come out!!!</p><br/><p>「With… with all… with all due respect…」</p><br/><p>「Enough, I had expected more from you. I always waited. Even for you to come clean on the Magical Battle Gear Incident.</p><br/><p>But, even now… look!」</p><br/><p>The King said pointing at two items.</p><br/><p>Sometime previously, an attendant had brought htem.</p><br/><p>Bester stared at them with empty eyes.</p><br/><p>Something he had never seen before, a liquid sphere wrapped in cloth.</p><br/><p>And a single longsword.</p><br/><p>「Do you know what this is?」</p><br/><p>As he was asked, he carefully observed.</p><br/><p>The sphere he had not recognized, but the sword was the one that Kaijin always carried.</p><br/><p>「Think!」</p><br/><p>In place of the King, the attendant had explained.</p><br/><p>Bester’s mind would require many more hours to understand the transpired.</p><br/><p>Not a revival pill, but a restoration pill made from Hipokte grass. That of complete restoration.</p><br/><p>With dwarven technology, the best they could achieve was a purity of 98%.</p><br/><p>At 98%, it would never have the effect of high grade medicine. But this, was at 99%!!!</p><br/><p>Bester’s face lit up in surprise. He wanted to know the extraction method.</p><br/><p>But what should have surprised bester more was the longsword.</p><br/><p>The demon ore used in the blades had begun to adapt itself to the user, so was reported.</p><br/><p>“But that’s impossible… it normally takes ten years for that to happen!”</p><br/><p>Bester, in shock, was beset by such thoughts.</p><br/><p>“If that is true!” such was the thought that dominated his mind.</p><br/><p>「The one who had produced these items was the slime. Thanks to your efforts, we no longer have a connection to the slime. Do you have anything to say for yourself?」</p><br/><p>Bester knew all too well the depth of the King’s anger.</p><br/><p>There was nothing else he could say…</p><br/><p>「Nothing… I have nothing to say, your Majesty.」</p><br/><p>Tears welled up within him.</p><br/><p>“I had been abandoned by the king!” He finally understood.</p><br/><p>He had just wanted to be of use to the king. And to be recognized.</p><br/><p>That was his with, and yet…</p><br/><p>Since when did he go wrong?</p><br/><p>Was it when he got jealous of Kaijin?</p><br/><p>Or was it well before then?</p><br/><p>That he did not know. All that he knew what that he betrayed the king’s expectations. That sole truth.</p><br/><p>「Is, that so. Then, Bester! You are forbidden from entering the kingdom ever again. Never show yourself before me from now on</p><br/><p>However, I’ll leave you some parting words… You have served well!!!.」</p><br/><p>Upon hearing the king’s words, Bester responded with a deep bow.</p><br/><p>And thus left the hall.</p><br/><p>To repay the foolish act he had committed…</p><br/><p>At the same time as Bester left,</p><br/><p>The guards restrained his accomplice, the treacherous representative.</p><br/><p>That he saw from the corner of his eyes.</p><br/><p>「Spies! Keep watch over the slime! Never let him leave your sight! EVER!!!」</p><br/><p>The king had raised his voice so to give this order.</p><br/><p>That usually quiet king, to raise his voice!</p><br/><p>Everyone tensed at the gravity of the order.</p><br/><p>「Even at the cost of our lives!」</p><br/><p>The spies having so replied, disappeared.</p><br/><p>The king pondered thus.</p><br/><p>What was that monster?</p><br/><p>That was a unique creature. Letting him loose upon the world…</p><br/><p>Will probably end our peace…</p><br/>\n</div>"}