{"title": "Chapter 11 – Evolving Monsters", "id": 11, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-11-%E2%80%93-evolving-monsters", "volume_title": "Volume 1", "body": "<h1>Chapter 11 – Evolving Monsters</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner (Cast: an English Clown and French Pierrot)</p><br/><p>Clown: Rimuru was so evil last chapter. Setting up wire traps and arrow slits, and manipulating the enemy into certain death! How terrifying!</p><br/><p>Pierrot: Meh, could have been worse. For example, why didn’t Rimuru try to coat the arrows in paralysis breath? Just imagine all those wolves falling down motionless only to be surrounded and slaughtered by the goblins!</p><br/><p>Clown: Well then, master strategist, how would you have dealt with the goblin fortification?</p><br/><p>Pierrot: Set it on fire, of course. That, or try to gas them out. Though the best option by far would be to cut off their supplies and starve them out. Time is one’s worst enemy during a siege.</p><br/><p>Clown: I see…</p><br/><p>Pierrot: Speaking of time, have you even started drawing a banner with both of us on it?</p><br/><p>Clown: Huh? Umm, yeah! Totally! Like, it’s almost done. Yep.</p><br/><p>Pierrot: You suck at lying.</p><br/><p>Clown: Hmm, is it the time for the daily joke? Alright, here’s one… what animal keeps the best time? … A watch dog!</p><br/><p>.</p><br/><p>.</p><br/><p>Empowerment Arc</p><br/><p>Chapter 11 – Evolving Monsters</p><br/><p>The wolves are showing no intentions to move.</p><br/><p>This could be bad…</p><br/><p>Are they planning on rushing at me with a “Death rather than servitude!”-like howl?</p><br/><p>Then it’d become total war.</p><br/><p>They have no chance of victory, but we also wouldn’t come out unscathed.</p><br/><p>Having come this far without injury… we’d definitely win, but I’d rather avoid further combat.</p><br/><p>Compared to earlier noise, an eerie silence fills the battlefield.</p><br/><p>The fang wolves are have all focused their sight on me.</p><br/><p>I slowly began to move.</p><br/><p>I don’t know how they’ll react to what I’m about to do, but this is at least necessary for them to recognize the death of their leader.</p><br/><p>I approached the leader’s corpse. No one moved to stop me.</p><br/><p>Nearby wolves took a step back.</p><br/><p>And then, I devoured the wolf leader using [Predation].</p><br/><p>That much is the right of the victor.</p><br/><p>＜＜Analysis has been completed.</p><br/><p>Ability to mimic the Fang Wolves has been acquired.</p><br/><p>Species-specific skills [Supreme Sense of Smell, Telepathic Communication, Coercion] have been acquired.＞＞</p><br/><p>[Great Sage] reported in my mind.</p><br/><p>Alright.</p><br/><p>These guys… though they’ve just seen their leader eaten, they aren’t moving a muscle.</p><br/><p>Hmmm.</p><br/><p>Totally thought that they’d either run away in panic or grovel in fear if I went this far…</p><br/><p>Oh, right! I did say Servitude or Death…</p><br/><p>Damn it… adrenaline rushed to my head, and this is the result.</p><br/><p>Well, only one thing to do. I guess I’ll give them a way out.</p><br/><p>With that thought, I mimicked the Fang Wolf.</p><br/><p>And,</p><br/><p>*Guru, Uooooooooooon!!!*</p><br/><p>While activating [Coercion], I howled out.</p><br/><p>「Kukuku! Hear me! I’ll let you off the hook this once. Those who would not obey, leave now!!!」</p><br/><p>So I declared to the wolves.</p><br/><p>With this, even these mutts should have the courage to run.</p><br/><p>Or so I thought,</p><br/><p>(We as one, shall follow You!!!)</p><br/><p>They responded and knelt before me.</p><br/><p>Though honestly, they really look just like bunch of tired, sleepy dogs.</p><br/><p>In any case, they seem to have chosen servitude.</p><br/><p>So… when they were motionless–they were busy discussing this?</p><br/><p>And with that, the battle of the Goblin Village had concluded.</p><br/><p>.</p><br/><p>Or so I’d like to say, but it wasn’t over yet!</p><br/><p>What came after–reconciliation and repairs–was far harder than the fight itself.</p><br/><p>“Who the hell ordered this house to be destroyed” and the like…</p><br/><p>What to do next? And, what to use for the goblins’ beds?</p><br/><p>And, who’ll walk the dogs…</p><br/><p>Though many of them had died, there are still about eighty remaining.</p><br/><p>About that… well, let’s just say the day is done! Leave all the thinking for tomorrow.</p><br/><p>Thus for now, I ordered the dogs to standby, and went to rest by the goblins’ bonfire.</p><br/><p>Thus came morning.</p><br/><p>I thought all night, and finally came up with:</p><br/><p>“Make the goblins look after the fang wolves!” Plan.</p><br/><p>The goblin fighting force number seventy four members. No casualties from the battle.</p><br/><p>There were some scratches, but that’s the extent of their injuries.</p><br/><p>Of the dogs, eighty one remain.</p><br/><p>There were many injured, but with immediate treatment, they have begun recovery.</p><br/><p>Even without further meddling, they’ll heal nicely. That’s how potent their recovery ability is.</p><br/><p>After waking up, I had the goblins line up.</p><br/><p>The kids and elderly wanted to sneak a peek, but with no houses around, they really stood out.</p><br/><p>The village chief was waiting by my side.</p><br/><p>He seems to intend to take care of me, which is nice and all… but there’s no way I’d be happy getting an old goblin’s attention.</p><br/><p>That much is dictated by my aesthetic sense.</p><br/><p>That is, no matter how many times I reincarnate as a monster, my tastes I shall not yield!</p><br/><p>And, as cute things don’t exist in this village, so I’ll just have to give up for now.</p><br/><p>Then, I lined up the wolves in front of the goblins.</p><br/><p>Now, then…</p><br/><p>「So…. guys. From now on, I’ll have you become a pair and proceed together」</p><br/><p>I wait for their reaction.</p><br/><p>However, showing no intention of making noise, they simply await further instructions.</p><br/><p>No one seems particularly repulsed by the notion.</p><br/><p>This is going good, so far.</p><br/><p>「You get what I said, right? Make a group: one goblin and one wolf」</p><br/><p>When I said that,</p><br/><p>The goblins and wolves sat by each other and exchanged glances.</p><br/><p>And,</p><br/><p>「Guga!」 (Please take care of me!)</p><br/><p>「Gau!]」(Likewise!)</p><br/><p>Is how quickly they got along.</p><br/><p>This is the “Yesterday’s enemy is today’s friend” type of thing, I guess.</p><br/><p>And that’s when I got the thought.</p><br/><p>“They are nameless, aren’t they”</p><br/><p>Calling out to them would be really inconvenient.</p><br/><p>And while glancing at the goblin-wolf pair,</p><br/><p>「Chief, it’s really inconvenient to get your attention. So, I was thinking of giving you names. Would that be fine?」</p><br/><p>Every head turned to me, and every eye focused on me, when I said that line.</p><br/><p>The same was true even for the civilians.</p><br/><p>「Wou… would you really bestow such honor on us?」</p><br/><p>The head asked, overcome by awe.</p><br/><p>Hmm? What’s with this excitement?</p><br/><p>「Ah, yeah. If it’s okay with you, I was planning on giving you names.」</p><br/><p>The moment I finished the sentence, as if they were all holding their breath, the goblins shouted for joy.</p><br/><p>What’s up with them?</p><br/><p>The situation is basically: GREAT EX-CIT-MENT!!!</p><br/><p>If they wanted names this much, they should’ve just come up with ones….</p><br/><p>That’s how carefree I was then.</p><br/><p>Let’s start with the chief.</p><br/><p>First, I asked for his son’s name. It was “Rigur”.</p><br/><p>And so, I named the Chief “Rigur-do”, Rigurdo.</p><br/><p>Not that the name had any specific meaning, I just thought it sounded good.</p><br/><p>“Were his son around, I’d call out to him “Rigur!” and the chief would reply “Do!”…” When I said that as a joke, he suddenly got very serious.</p><br/><p>Moreover,</p><br/><p>「To have been honored with the name of my son, please permit these tears of gratitude!」</p><br/><p>How much he exaggerates!</p><br/><p>To give him a name on a whim kind of makes me feel guilty…</p><br/><p>But, oh well! And the feeling went away.</p><br/><p>Continuing, the Goblin Leader will succeed his brother’s name.</p><br/><p>I could add “the 2nd” to it, but it sounds like a pain. So, he’s now “Rigur”.</p><br/><p>And when he’s called such, he falls prostate as if praying to me.</p><br/><p>Really, these guys take things too seriously… like father, like son, I guess.</p><br/><p>And while I’m at it, might as well go through the parent-child groups first.</p><br/><p>Then, I named the single goblins and the orphans.</p><br/><p>I wonder if they guys will continue reusing these names in the future.</p><br/><p>With the birth of a grandchild, the chief will probably be called “Rigurdodo”.</p><br/><p>And with a great grandchild, the infant will be called “Rigur” and the chief “Rigurdododo”.</p><br/><p>“Seriously?” Is what would be appropriate to say, then… but, oh well!</p><br/><p>And like that, I gave them names.</p><br/><p>Then, they said to me,</p><br/><p>「Rimuru-sama, we have no words to express our gratitude… but are you sure that this was alright?」</p><br/><p>The Chief… Rigurdo asked with a slightly flustered voice.</p><br/><p>「What is?」</p><br/><p>「Oh, well, we do know that Rimuru-sama possesses great magical energy… but, even so, to give out those many names at once…」</p><br/><p>What’s he talking about? I’m just giving them a name…</p><br/><p>「Oh? Well, no problem, I guess…」</p><br/><p>And so, I continued giving out names.</p><br/><p>It seems like Rigurdo wanted to say something, but I didn’t pay attention.</p><br/><p>Having finished naming the goblins, I proceeded to the wolves.</p><br/><p>Their next leader is the previous one’s son.</p><br/><p>He looks like his father with that sturdy build, and carries the same air around him.</p><br/><p>Looking at those blood-red eyes, I think of a name.</p><br/><p>That’s right! Let’s go with the kanji for tempest fang–“Ranga”!</p><br/><p>(TL Note: one of the readings for  (storm, tempest) is ran, and for  (fang) is ga.)</p><br/><p>I know, my names suck.</p><br/><p>I just took my family name and mixed it with their species.</p><br/><p>Well, “It’s good to give appropriate names”… those words I will not heed.</p><br/><p>At that moment!</p><br/><p>I felt the magical energy being sucked out from my body.</p><br/><p>And, I was attacked by extreme lethargy!</p><br/><p>What… the?</p><br/><p>I’ve never felt this tired since being reborn.</p><br/><p>＜＜Explanation. You have used magical energy beyond your capabilities! Switching over to lowered activity state.</p><br/><p>Complete restoration predicted in three days.＞＞</p><br/><p>I am conscious.</p><br/><p>Since I don’t need sleep.</p><br/><p>I can also hear [Great Sage]’s explanation. After which, I finally comprehended the situation.</p><br/><p>I used too much magical energy? So, I ran out of MP, huh?</p><br/><p>However, what caused that too happen? Had all the skills I used till now come bite me at once?</p><br/><p>But it doesn’t feel like that’s the case.</p><br/><p>Can’t move my body.</p><br/><p>So lowered activity state is like hibernation… without sleep.</p><br/><p>While panicking, Rigurdo is nursing my body.</p><br/><p>In any case, there’s not much they can do; so, they just sat me by the bonfire…</p><br/><p>Conscious yet inactive.</p><br/><p>So, I was thinking about that phenomenon.</p><br/><p>My magical energy decreased when I was giving out names.</p><br/><p>Giving names uses up my magical energy, huh…</p><br/><p>Come to think of it, a lot of magical energy was used when giving the fang wolves’ leader a name.</p><br/><p>So giving monsters names requires magical energy.</p><br/><p>That conclusion took me two days to work out.</p><br/><p>This would be the cause of Rigurdo’s worries, wouldn’t it.</p><br/><p>Wait a second… is it common sense in this world?</p><br/><p>Speak up!!! How would I know if you don’t tell me…</p><br/><p>If I could complain, I’d be screaming my lungs out.</p><br/><p>Well, if I could move my body, I’d complain.</p><br/><p>Screaming my lungs out? Who said such a thing?</p><br/><p>But anyways, when I stopped moving the goblins, of course, got worried…</p><br/><p>And, a fight started out about who’d be taking care of me first.</p><br/><p>What the hell are they doing… stop joking around. I can do without a goblin harem.</p><br/><p>… I was basically treated like a divine ornament that blessed those that stroked it.</p><br/><p>And so, three days passed.</p><br/><p>COMPLETE RE-CO-VE-RY!</p><br/><p>After having run out of magical energy, aggregate amount of magical energy and magic power seemed to have increased.</p><br/><p>Magic power allows us to operate.</p><br/><p>Magical energy is what we utilize.</p><br/><p>Somehow, I seem to have understood it. I think.</p><br/><p>So to summarize, “What doesn’t kill you makes you stronger” type of thing.</p><br/><p>Should I experiment? Is what I thought, but I decided against it.</p><br/><p>I don’t see a particular reason to do it, and dying during the experiment would be sad.</p><br/><p>For you see, I have already crossed that line.</p><br/><p>“If you let down your guard, you die!” so I learned.</p><br/><p>Now, then…</p><br/><p>Having noticed that I have awoken, the goblins immediately gathered.</p><br/><p>The fang wolves, too, entered the village.</p><br/><p>That being good and all… but, what’s up with this…?</p><br/><p>「You guys… you’re huge!」</p><br/><p>Yes.</p><br/><p>Goblins are normally 150 cm tall. However, they are at least 180 now.</p><br/><p>(TL Note: From about 5 feet to 6 feet)</p><br/><p>The guy in front of me is over 2 meters tall. (6.5 feet)</p><br/><p>The fang wolves, as well: their olive brown fur has turned jet black, giving off a charming shine.</p><br/><p>Furthermore, they are now three meters in length (about 10 feet). Last I saw them, they were at most, two (6.5 feet).</p><br/><p>And, silently walking over here, giving out a strange aura, was a five-meter long wolf (16 feet).</p><br/><p>Damn, that’s scary.</p><br/><p>And,</p><br/><p>「My master! Your recovery fills me with endless joy!!」</p><br/><p>He fluently said.</p><br/><p>… that can’t be… “Ranga”, right?</p><br/><p>What the hell happened here these days…</p><br/><p>While I was at a loss, the monsters filled the forest with a roar of delight!</p><br/><p>Status</p><br/><p>Name: Rimuru Tempest</p><br/><p>Species: Slime</p><br/><p>Divine Protection: the Storm Crest</p><br/><p>Titles: One who Commands Monsters</p><br/><p>Magic: None</p><br/><p>Skills: Unique Skill [Great Sage], Unique Skill [Predator], Slime-Specific Skills [Dissolve, Absorb, Regenerate], Extra Skill [Water Manipulation], Extra Skill [Magic Perception], Acquired Skills: Black Serpent [Heat Detection, Noxious Breath], Centipede [Paralysis Breath], Spider [Sticky Thread, Steel Threat], Bat [Ultrasound Waves], Lizard [Body Armor], Wolf [Supreme Sense of Smell, Telepathic Communication, Coercion]</p><br/><p>Resistances: Thermal Fluctuation Resistance EX, Physical Attack Resistance, Pain Resistance, Electricity Resistance, Paralysis Resistance</p><br/>\n</div>"}