{"title": "Chapter 12 – Preparing our Environment", "id": 12, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-12-%E2%80%93-preparing-our-environment", "volume_title": "Volume 1", "body": "<h1>Chapter 12 – Preparing our Environment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner (Cast: an English Clown and a French Pierrot)</p><br/><p>Clown: Tututu! May*shi desu!… Clown desu! We have almost caught up with chapters that needed re-translation.</p><br/><p>Pierrot: The plan is to finish up to 13 today, right? What’s next?</p><br/><p>Clown: Well, there seems to be three groups working on Tensei Shitara right now: yours truly, Wuxia, and Guro. Wuxia has not responded to any form of communication, so I don’t know about them. Just met Guro today.</p><br/><p>Pierrot: That’s not what I meant. When are the new chapters coming?</p><br/><p>Clown: Oh. If I finish 13 today, then I’ll do 18 and 21 tomorrow. If Guro allows me to edit his, I might only do 18 and edit 19-20.</p><br/><p>Pierrot: So that’s the status update, eh? Rather unorganized, don’t you think?</p><br/><p>Clown: Don’t blame me! We just started!</p><br/><p>Pierrot: Alright, I’ll leave it at that.</p><br/><p>Clown: Well then, without further ado: the daily joke! What do you make a clown’s outfit out of?</p><br/><p>Pierrot: Poly-jester.</p><br/><p>.</p><br/><p>.</p><br/><p>Empowerment Arc</p><br/><p>Chapter 12 – Preparing our Environment</p><br/><p>Hmmm.</p><br/><p>The monsters really grew these past three days.</p><br/><p>How shocking…</p><br/><p>This is what you call.. evolution, huh…</p><br/><p>Does receiving a name prompt evolution?</p><br/><p>Come to think of it, Veldora had mentioned something about names…</p><br/><p>Something about “nameless” and “named monster”.</p><br/><p>I see! For a monster to get a name is for them to become a named monster!</p><br/><p>So their stats increase, and the result–evolution!</p><br/><p>I see… that’s why they were jubilant.</p><br/><p>That also explains why I used up so much power.</p><br/><p>Monster evolution is absurd.</p><br/><p>Rather than growing up, it’s probably better to say that they became a different being.</p><br/><p>The goblins eyes sparkle in delight, reflecting their profound wisdom, and directed at the females….</p><br/><p>What the hell! They actually look feminine!</p><br/><p>I’m so surprised I can’t even scream!</p><br/><p>Eh? …. EHH???</p><br/><p>I couldn’t believe my eyes.</p><br/><p>Though they were small monsters, resembling monkeys…</p><br/><p>The males became hobgoblins.</p><br/><p>The females became goblinas.</p><br/><p>Thus they evolved.</p><br/><p>According to what Rigurdo said, they heard the “Voice of the World”.</p><br/><p>“This is the great and rare evolution that I’ve heard legends about!” Is how excited he was when he told me about it.</p><br/><p>The goblin females used to be covered from head to toe but due to the evolution some particularly voluptuous parts are visible.</p><br/><p>“The walls are jealous of your figure!” ~ is a joke I can no longer say.</p><br/><p>The males are certainly happy.</p><br/><p>And they aren’t wearing much either…</p><br/><p>I guess of the three necessatities of life, we’ll have to figure out clothing first.</p><br/><p>.</p><br/><p>And then there’s the “Ranga” problem.</p><br/><p>He’s been so happy with my recovery, that he doesn’t leave me alone for even a second.</p><br/><p>And while I can’t say I don’t like the soft fur… I’m more of a cat person.</p><br/><p>Don’t get me wrong: I don’t hate it.</p><br/><p>「So, Ranga, I only gave you a name, so why did the rest of the pack evolve?」</p><br/><p>That’s right. As soon as I gave Ranga the name, that unpleasant incident occurred…</p><br/><p>「My beloved master! We of the fang wolves are “many as one”. The name you bestowed had become the name of our species!」</p><br/><p>I see, I see.</p><br/><p>A shared name, so everyone evolved.</p><br/><p>According to him, the previous alpha did not favor this principle.</p><br/><p>If he had, that battle might have gone a little differently.</p><br/><p>Oh and with regards to that, Ranga seems to have secured his leadership in the pack.</p><br/><p>And thanks to that, the species changed from fang wolves to storm fang wolves.</p><br/><p>So to summarize, they’ve gotten stronger! Is what he wants to say.</p><br/><p>Seems like he wants to be praised, so…</p><br/><p>「Well done!」</p><br/><p>And he happily waved his tail.</p><br/><p>As you’d imagine, if a five meter monster starts waving his tail, you’ll be blown away.</p><br/><p>Funnily enough, a scowl is enough to make him dejected.</p><br/><p>The problem, however, was in the wolves’ care.</p><br/><p>Since becoming pairs, the wolves and goblins live together…</p><br/><p>Or rather, for lack of housing, the goblins use the wolves as pillows.</p><br/><p>Clothing is an issue, and so is housing.</p><br/><p>So… what to do…?</p><br/><p>.</p><br/><p>There was a mountain load of food in front of me.</p><br/><p>So with regards to the nourishment, that answered any concern.</p><br/><p>It seems that at the same time as I ran out of magical energy, everyone began to evolve.</p><br/><p>And, after it finished a day later, they decided to celebrate together.</p><br/><p>However, as I was still continuing my recovery, they only continued to gather food.</p><br/><p>So during recovery, although I could feel being caressed, I could not sense either the evolution or the party preparations.</p><br/><p>Lowered activity state makes me surprisingly defenseless. Have to be more careful.</p><br/><p>However, to wait for my orders even in that situations–that is praiseworthy.</p><br/><p>It seems that their intelligence increased during the evolution.</p><br/><p>Perhaps the spirit is affected greater than the body.</p><br/><p>Originally, the goblins would hunt and gather the food, and so survive.</p><br/><p>Now, with the wolves’s help, their habitat has greatly increased.</p><br/><p>What is more surprising, however, is that the goblin-wolf pair can use telepathic communication.</p><br/><p>They have become the wolf-riding goblins.</p><br/><p>Thus, the wolves no longer are just an addition to our fighting strength.</p><br/><p>Goblin–a monster which had never won before has now become an expert hunter.</p><br/><p>And the amount of food they procured over two days is the proof.</p><br/><p>However, there is a problem.</p><br/><p>Life dependent on the fruits of the forest is rather uncertain.</p><br/><p>I’ll have to teach them crop farming sooner rather than later.</p><br/><p>I guess I need to start by looking for a good crop plant… maybe rice.</p><br/><p>I’ll keep an eye out.</p><br/><p>For now, let’s just thoughtless enjoy the party!</p><br/><p>And so that day, in celebration of their evolution, the battle’s end, my recovery, the banquet continued long into the night.</p><br/><p>.</p><br/><p>And the sun rose again.</p><br/><p>Everyone had gathered.</p><br/><p>There are many things to do today, but I must first convey the most important matter.</p><br/><p>That is, the rules of this village.</p><br/><p>Those must be decided in the very beginning.</p><br/><p>Any community requires rules. A natural notion for the Japanese people.</p><br/><p>“A rule is something that protects, not something that is protected”</p><br/><p>Some adults (me included) used to joke like that, but that is currently unimportant.</p><br/><p>I have thought of three basic rules.</p><br/><p>At the very least, I want to keep these three.</p><br/><p>Any other rules they can make and enforce themselves.</p><br/><p>「Has everyone gathered? In that case, I’ll announce the rules! There are three, and I want you all to solemnly swear to uphold them」</p><br/><p>Having said so, I announced these rules.</p><br/><p>1. Do not attack humans</p><br/><p>2. Do not fight comrades</p><br/><p>3. Do not look down on other races</p><br/><p>So were the three rules.</p><br/><p>With extra thought many more rules should be added, but they will be hard to uphold at first.</p><br/><p>For me personally, I established the most important ones.</p><br/><p>Now then, how will they react?</p><br/><p>「Is this fine? For what reason should we avoid fights with humans?」</p><br/><p>So asked Rigur.</p><br/><p>In response, Rigurdo glared at his son with a furious expression. Does he understand my intentions?</p><br/><p>They really should take it easy once in a while though.</p><br/><p>「Simple. I like humans. End of story.」</p><br/><p>「I see! Understood!」</p><br/><p>Eh? He… understood?</p><br/><p>Wait a second; that easily?</p><br/><p>But from what I can see, everyone is content with my explanation.</p><br/><p>I thought there would be more displeasure with that rule. I guess being wrong once in a while is a good thing,</p><br/><p>「Ah, well. Humans live in groups, you see. If you reach for them, they might answer with force.</p><br/><p>It would be difficult to survive if they come at us seriously.</p><br/><p>And so, meddling in their affairs is strictly forbidden!</p><br/><p>And besides, it’d be better if we got along with them…」</p><br/><p>I had nothing else planned, so I decided to also tell them the official reason.</p><br/><p>Of course, “I love humans” is the real one. I was a human, after all.</p><br/><p>Hearing my explanation, Ranga deeply bowed.</p><br/><p>Anyhow, I got what I wanted.</p><br/><p>He must have his own reasons to avoid humans.</p><br/><p>Additionally, the hobgoblins’ expression also read: “We hear and obey!”</p><br/><p>「Anything else?」</p><br/><p>「To not look down on other races… what would that mean?」</p><br/><p>「Oh, well, you guys have evolved and gotten strong, right? So getting arrogant and acting high and mighty before weaker races! That’s what it would mean.</p><br/><p>Even if you have gained some strength, don’t mistake it for absolute power.</p><br/><p>Wouldn’t it be silly if the one you put down grows stronger and takes revenge against you?」</p><br/><p>Everyone listened with enthusiasm.</p><br/><p>Seems like everything will be fine.</p><br/><p>And in in the future, even with this warning, some are bound to disobey.</p><br/><p>Even so, I’d be happy if this prevents even just a few incidents.</p><br/><p>「And that’s that. Do your best to follow these rules!」</p><br/><p>And that is how I decided this village’s new rules.</p><br/><p>However, a tragedy would later be born from one of these rules.</p><br/><p>Of course, I had no way of knowing at the time.</p><br/><p>I am not omniscient nor possess precognition abilities…</p><br/><p>Everyone nodded in acknowledgment.</p><br/><p>With this, a new chapter began for our community.</p><br/><p>.</p><br/><p>Now then, after the rules, we discussed division of labour.</p><br/><p>Those who are on lookout duty.</p><br/><p>Those who search for food.</p><br/><p>A team for gathering raw production materials.</p><br/><p>And a group for structure and equipment maintenance.</p><br/><p>I left the lookout duty to the storm fang wolves–due to their “Telepathic Communication”.</p><br/><p>There were seven wolves without a pair… well, considering that Ranga was clinging to me with all his might, there were six I guess. I left the observation to them.</p><br/><p>I’ll leave the details to the village chief Rigurdo.</p><br/><p>「Rigurdo! I’ll have you become the Goblin Lord! Govern the village with pride!」</p><br/><p>Frankly, I’m just giving him all the responsibility.</p><br/><p>That, in particular, is the one thing I truly want to avoid.</p><br/><p>However, I also want him to think about it.</p><br/><p>I used to work as a simple general contractor. Ruling is not for me.</p><br/><p>And besides, I’d rather not get bogged down at this village and miss the opportunity to visit human ones.</p><br/><p>I must be adamant about this, even if I have to force him.</p><br/><p>However,</p><br/><p>「Ay!!! This unworthy one shall happily accept this great honor!!!」</p><br/><p>Getting chocked on tears, he readily accepts.</p><br/><p>Good. I’d rather be the leader in name only.</p><br/><p>“The sovereign reigns, but does not rule”</p><br/><p>A good advice, in my opinion. If need be, I’ll voice my thoughts.</p><br/><p>But really… Rigurdo. This unsteady and wrinkled old goblin with one foot in the grave had become a robust and muscular hobgoblin.</p><br/><p>On a good day, would he be stronger than his son Riguru, I wonder?</p><br/><p>Geez… monsters really do keep surprising me.</p><br/><p>「Yup. I leave it to you! Oh and by the way, I’ve seen your method of building houses… you suck.」</p><br/><p>Frankly, I can’t even call those “houses”.</p><br/><p>「What an embarrassing topic You bring up… to tell You the truth, we have never had the need to build large structures before…」</p><br/><p>「Right. Well, you’ve increased in number now. Oh, and about clothing… there are too many holes–anything you can do about that?」</p><br/><p>「Ah! We have been dealing with a few groups regarding that. Surely their members would be capable of procuring clothing!</p><br/><p>Moreover, as skillful as they are, they would surely know house-building!」</p><br/><p>I see.</p><br/><p>As a person from general contractor services I myself have some experience, but I am at a do-it-yourself level.</p><br/><p>I am not a jack-of-all-trades and there is a limit to my abilities.</p><br/><p>If we meet those partners, perhaps we could hire somebody…</p><br/><p>Not like we lose anything by asking.</p><br/><p>「Alright. It may be beneficial to go and ask them. So, what did you use to make the deal? Gold?」</p><br/><p>「No, we did trade some items and belongings we “got” from adventurers, but that is not an option.</p><br/><p>Rather than money, we’d barter, do odd jobs, and thus slowly collect enough money for the trade.</p><br/><p>All the equipment we own we received from them」</p><br/><p>「Oh? So, what race are they?」</p><br/><p>「The dwarfs!」</p><br/><p>Dwarfs!</p><br/><p>The expert blacksmiths, the famous race!</p><br/><p>We must go!</p><br/><p>In the first place, while the goblins’ clothing definitely needs replacement, their armor is likewise falling apart.</p><br/><p>And although the armor is sure to last far longer than a rotting cloth, the sizes just won’t fit.</p><br/><p>So that’s another spot for improvement.</p><br/><p>However… we don’t have any equipment “dropped” by adventurers, and no money.</p><br/><p>What to offer in a trade…? Nothing comes to mind right now.</p><br/><p>「I’ll go to them. Rigurdo, can I leave preparations to you?」</p><br/><p>「!!! Please leave it me! I shall have everything prepared by noon!!!」</p><br/><p>High-tension Rigurdo.</p><br/><p>I’ll leave this to him. He’ll probably scavenge around for remaining funds, too.</p><br/><p>This world’s currency, huh… I’ll laugh if it’s paper.</p><br/><p>Come to think of it, I, myself, know nothing about it.</p><br/><p>If I plan to visit human cities, I must at least know about their currency exchange.</p><br/><p>Well, let’s ask the dwarfes about this.</p><br/><p>So, while the goblins are busy with construction, shall we leisurely visit the dwarfs?</p><br/><p>And someday I’ll visit a human city.</p><br/><p>From what I hear, the dwarfs live in a pretty large city–for a demi-human, that is.</p><br/><p>They also seem to have crowned a king, not that the goblins could ever meet him.</p><br/><p>In the first place, just entering the city is an impressive feat.</p><br/><p>Discrimination towards goblins… I wonder if this’ll go well.</p><br/><p>I, for one, am but a slime; hopefully they won’t be too surprised.</p><br/><p>While I am worried, I also expect a lot from this visit.</p><br/><p>It’s been a long time since I was this thrilled.</p><br/><p>Status</p><br/><p>Name: Rimuru Tempest</p><br/><p>Species: Slime</p><br/><p>Divine Protection: the Storm Crest</p><br/><p>Titles: One who Commands Monsters</p><br/><p>Magic: None</p><br/><p>Skills: Unique Skill [Great Sage], Unique Skill [Predator], Slime-Specific Skills [Dissolve, Absorb, Regenerate], Extra Skill [Water Manipulation], Extra Skill [Magic Perception], Acquired Skills: Black Serpent [Heat Detection, Noxious Breath], Centipede [Paralysis Breath], Spider [Sticky Thread, Steel Threat], Bat [Ultrasound Waves], Lizard [Body Armor], Wolf [Supreme Sense of Smell, Telepathic Communication, Coercion]</p><br/><p>Resistances: Thermal Fluctuation Resistance EX, Physical Attack Resistance, Pain Resistance, Electricity Resistance, Paralysis Resistance</p><br/>\n</div>"}