{"title": "Chapter 25 – Human Transformation!", "id": 25, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-25-%E2%80%93-human-transformation", "volume_title": "Volume 1", "body": "<h1>Chapter 25 – Human Transformation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Human Transformation!</p><br/><p>Shizu-san said.</p><br/><p>She passed me her life’s only goal.</p><br/><p>Now, to realize the goal that befalls me, I must start to gather information about “Demon Lord”.</p><br/><p>I had accepted it easily, but the promise I made must be fulfilled. .</p><br/><p>I am a man who keeps his promises.</p><br/><p>She left me with a new ability.</p><br/><p>Unique Skill ”Shapeshifter” and Extra Skill “Fire Manipulation”.</p><br/><p>Incidentally, it seems I also ate Flame Giant (Ifrit).</p><br/><p>Even though it wasn’t my enemy, this guy is still dangerous.</p><br/><p>After all, this guy surpasses rank A.</p><br/><p>Without a question, neither Black Snake nor Black Wolf would be able to win against it.</p><br/><p>I need to research its abilities, little by little.</p><br/><p>But before that!</p><br/><p>There was something more important that I need to check right now.</p><br/><p>Right! Humanization!!!</p><br/><p>I enter a simple tent, newly set up for my personal needs.</p><br/><p>No one can enter! I said and closed the door.</p><br/><p>Ku kuku, Kuha ha, Ku ha hahaha!</p><br/><p>I correctly execute a three-stage laughter. (TL: it likes how villains laugh. Like the one Verudora use in chapter 3.)</p><br/><p>“Traaaaan~ form!”</p><br/><p>Although there aren’t any sound effects, executing Mimicry: Human!</p><br/><p>It’s a first time I’m looking forward to the mimicked body this much.</p><br/><p>However,</p><br/><p>............ What?</p><br/><p>Oyaoyaoya.....</p><br/><p>The black fog that always appeared during mimicking didn’t come out.</p><br/><p>What’s going on! So, I thought, but my eye level became slightly higher.</p><br/><p>I could also feel hands and feet.</p><br/><p>And, my skin color changed from the normal pale blue.</p><br/><p>Mu, mu mumu?</p><br/><p>Though I don’t really get it, I feel somewhat different than from what I had intended.</p><br/><p>It’s a shame that there was no mirror.</p><br/><p>However,</p><br/><p>Although, I don’t want to admit it but I remember once feeling the same way.</p><br/><p>A long time ago… around 30 years ago.</p><br/><p>Feels just like when I had been attending elementary school.</p><br/><p>I wanted to stop to think for a bit.</p><br/><p>But there was something I had just notice; there was a big difference.</p><br/><p>It’s gone.</p><br/><p>In the new form I had taken, my Son had been missing....!!!!!!</p><br/><p>What is the meaning of this?</p><br/><p>I panicked.</p><br/><p>I immediately went to check.</p><br/><p>Thus, I came to know a shocking fact....</p><br/><p>No...., none.</p><br/><p>Smooth, there was nothing.</p><br/><p>We~ll well, if you think about it, when I mimicry monsters, I had never wondered about such things.</p><br/><p>With no need for excretion, I can’t be expecting to suddenly have those organs, can I…</p><br/><p>An obvious truth… I, who doesn’t reproduce, has no need for reproductive organs.</p><br/><p>The answer......, the state I in right now, the fact was.....</p><br/><p>With deep sense of loss, I understand! Suddenly a worry beset me.</p><br/><p>No way! I try checking my head in a hurry. It had bushy and soft feel.</p><br/><p>I let out a sigh of relief.</p><br/><p>I don’t look like an alien or some suspicious person… thank goodness!</p><br/><p>Come to think about it, the black wolf’s fur was also bushy.</p><br/><p>Just imagining a fur-less monsters makes me feel bad.....</p><br/><p>Stop. Any further thoughts may prove dangerous.</p><br/><p>Now, had I, who always maintains a cool head, became flustered?</p><br/><p>By this time, I had already accepted the thing regarding my son.</p><br/><p>However, it’s rather painful that I can’t check this body......</p><br/><p>And then, a nice idea comes to mind. Can I use “Clones”?</p><br/><p>As expected from myself.</p><br/><p>Whether it’s possible to use in this state—I don’t know; but, let’s try it.</p><br/><p>Black fog gushes out from my body, it gathers in front of my eyes and turns into human form.</p><br/><p>In a moment, it completed.</p><br/><p>This.... is dangerous</p><br/><p>It’s dangerous, in many ways</p><br/><p>First the appearance.</p><br/><p>The figure is lovely silver haired, beautiful girl? Or beautiful boy? It’s natural because there is no sex, but....</p><br/><p>In any case, the features were more like those of a girl.</p><br/><p>Probably, because the original body was Shizu-san’s, my genes were nowhere to be seen.</p><br/><p>That was, well… probably to be expected.</p><br/><p>A lovely child, standing naked. Well, there are no parts to be hidden…</p><br/><p>But that’s not the problem, this seems morally dangerous.</p><br/><p>But, the insanely cute face. To Shizu-san &gt; GOOD JOB! Let me say that.</p><br/><p>I was a Nice Guy, but never this beautiful.</p><br/><p>Thus, I honestly thank you.</p><br/><p>I was wrapped in fur, and the clone also appeared with it.</p><br/><p>Right now, I still had not prepared any clothes.</p><br/><p>The reason why it’s dangerous was.</p><br/><p>Because of its abilities.</p><br/><p>The clone had excellent thinking capabilities, and completely linked to me.</p><br/><p>Which mean, both are me.</p><br/><p>There is no difference between the main body and the clone.</p><br/><p>No, the ability of the flame giant (Ifrit)’s clones clearly are inferior.</p><br/><p>Yet, I feel that my clone are not inferior. No, I wonder if it is lacking.....</p><br/><p>There are differences.</p><br/><p>In the magic power capacity. Originally the amount of magic power you can use is limited. It can’t use more than originally given to it.</p><br/><p>It’s possible to keep giving it more magic power, however.</p><br/><p>I have quite a lot of magic power. Depending on how I use it, it can be pretty powerful.</p><br/><p>However, the flame giant (Ifrit)’s created about 10 clones,whereas my high performance clones are limited to a single body.</p><br/><p>Though, if seen from opponent’s side, it’s definitely a cheat.</p><br/><p>The last reason.</p><br/><p>There was a lack of discomfort when mimicking..</p><br/><p>I noticed it when the black fog did not occur.</p><br/><p>For example, black wolf.</p><br/><p>When turning into the black wolf, the mimicry configures it inside the black fog. But, it’s inferior to slime’s body abilities.</p><br/><p>Even though slime’s body doesn’t have limbs, there are no restrictions on its physical movement, because the cell abilities were abnormally high.</p><br/><p>Each one of the cells is muscle, brain, and also nerve.</p><br/><p>Do you get it? The eye transmits information that the brain then processes.</p><br/><p>But the slime avoids this process.</p><br/><p>With “Great Sage” correction my perception speed are 1000 times the norm. Thus my reaction speed, is far about the ordinary person.</p><br/><p>However, the body created inside the black fog has some lag-time—for the thoughts to reach the brain=actual brain.</p><br/><p>Perhaps,the drop in quality of the clone was caused by this.</p><br/><p>But, mimicking the human being does not release black fog....?</p><br/><p>Because its reaction speed is equal to the slime. Thus, no discomfort.</p><br/><p>And, due the fact that there are limbs now, its motor movements are better… But, it’s a child.</p><br/><p>Still, it’s easier to move than as slime.</p><br/><p>Also, because there no need for black fog, there is no need to consume magic power.</p><br/><p>From now on, let’s try considering this as the main form! So I thought.</p><br/><p>Suddenly I got an idea, so I issue an order to the clone.</p><br/><p>To change itself, smoothly.</p><br/><p>The clone began to growth!!!</p><br/><p>The physique becomes slurry. Fluttering Silver hair. Beautiful, medieval looks</p><br/><p>Perfect!</p><br/><p>Furthermore from it, it can change into woman or man of any type.</p><br/><p>It can become macho or fat, it also can became young man or old man.</p><br/><p>I found it possible to mimic into variety of conditions. Also, the reason for the black fog was apparently to accommodate the additional mass, so turning into an adult requires it.</p><br/><p>This might be good as I can thus enhance my physical strength.</p><br/><p>Although the reaction speed decreases, it is more advantageous to have larger strength.</p><br/><p>Well, speed are also one of the more important elements in a fight! So, I think.</p><br/><p>From then on I carried out more experiments, and got used to this body’ abilities.</p><br/><p>Thus I, in this world,got my hands on a human body!</p><br/>\n</div>"}