{"title": "Chapter 33 – Audience", "id": 33, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-33-%E2%80%93-audience", "volume_title": "Volume 1", "body": "<h1>Chapter 33 – Audience</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner (Cast: an English Clown and French Pierrot)</p><br/><p>Pierrot: What a rude hospital!</p><br/><p>Clown: Really? I thought the doctor was actually pretty helpful towards the end.</p><br/><p>Pierrot: I met this nurse, she didn’t get my jokes!</p><br/><p>Clown: That’s cause those aren’t jokes, Pierrot. A joke is more… colorful! Or maybe, light? Like here’s one: I become faint and nauseous during every minor medical procedure, such as making an appointment over the phone.</p><br/><p>Pierrot: So stating facts is considered humorous now? Where has the world gone… I despa…</p><br/><p>Clown: Stop! You’ve already made that reference last chapter, come up with a different one!</p><br/><p>Pierrot: Have to stop the invasion to make sure the doujinshi continue selling?</p><br/><p>Clown: G*TE, huh? What else you got?</p><br/><p>Pierrot: The only one who can kill a (clown) is a human.</p><br/><p>Clown: H*llsing parody?</p><br/><p>Pierrot: Yeah, I’ve got nothing…</p><br/><p>Clown: Then let me end with a status update to the Audience. So AK and I (we?) have been adding somethings to the website–primarily a character page. When will it be finished? I don’t know. At the moment, I plan on calling the tab: “The Slime’s World” but that may change in the future.</p><br/><p>Pierrot: Any plans of taking a break?</p><br/><p>Clown: Clowns are magical and don’t need one!!!</p><br/><p>.</p><br/><p>.</p><br/><p>Forest Disturbance Arc</p><br/><p>Chapter 33 – Audience</p><br/><p>The Lizardmen’s Head nodded once in response to the report on the progress of battle.</p><br/><p>Since meeting Souei four days had passed.</p><br/><p>Tomorrow they would be reinforced. With no great casualties thus far, they’ll most likely see the sun rise again.</p><br/><p>Orc’s attacks have intensified to the extreme.</p><br/><p>Depending only on their resources, the passageways are overflowing with orcs. Orcs were affected little by the labyrinth, and merely swarmed through it.</p><br/><p>By placing traps along the passageways, they managed to decrease their numbers–if slightly.</p><br/><p>But still, thanks to the labyrinth the lizardmen were able to avoid any real losses. The labyrinth diverges many times, and emergency escape passageways are still usable.</p><br/><p>They’ve been alternating the squads that fight the orcs most often, and quickly reinforce teams that have engaged the enemy.</p><br/><p>Since this battle is under his direct command, he has no intention of becoming conceited.</p><br/><p>Because the reinforcements are coming, because there is hope, everyone is somehow struggling by.</p><br/><p>In reality, those who have fought the orcs were surprised by their strength.</p><br/><p>These orcs were worlds stronger than the usual.</p><br/><p>Right now, a single orc can challenge up to three lizardmen. Moreover, their power seems to be increasing.</p><br/><p>This is, of course, the result of the Orc Lord’s command.</p><br/><p>The Head also strictly ordered that those injured must immediately switch with out. Since, should the injury result in death, the orcs will become stronger.</p><br/><p>Carefully, and without error thus far, they have been maintaining the defense line.</p><br/><p>And only a day left.</p><br/><p>When the reinforcements arrive, they’ll probably be able to make use of the terrain to crush every orc.</p><br/><p>At the very least, they could at least alternate with the members stationed at the most important defense points.</p><br/><p>Thus filling his head with wishful thinking, the Head relaxed a bit.</p><br/><p>That’s when it came.</p><br/><p>The news of Gabil’s return…</p><br/><p>.</p><br/><p>Gabil was indignant.</p><br/><p>What’s with this! The prideful Lizardmen were cowardly hiding in holes from some lowly pigs! He was going blind from anger.</p><br/><p>However, all would soon be fine. He had returned, and, like a proper Lizardman, would fight with pride.</p><br/><p>With that thought, he headed to the Head.</p><br/><p>「Well done, Gabil. I presume you’ve been able to obtain the goblin’s support?」</p><br/><p>「Ay! We’ve been joined by 7,000 warriors.」</p><br/><p>「Is that so… with this, we’ll somehow make it.」</p><br/><p>「In that case, let’s engage the enemy at once!」</p><br/><p>After reporting thus to the Head, he prepared himself for batle.</p><br/><p>Now that he had returned, he could not permit the orcs’ selfish actions. Surely the head had been waiting for him to return.</p><br/><p>However,</p><br/><p>「Hmm? No, the time hasn’t come yet. While you weren’t here, we had been offered an alliance. They will be arriving tomorrow. And then, after holding a strategy meeting, we will be striking against the orcs!」</p><br/><p>Completely out of the blue. Such unthinkable things the head had said.</p><br/><p>“What? The head was not waiting for me?”</p><br/><p>That thought let to dissatisfaction, which further worsened Gabil’s mood.</p><br/><p>To depend on some unknown reinforcement against some lowly orcs…</p><br/><p>「Head, if you send me out, I’ll quickly crush the orcs. Order me to go!」</p><br/><p>His indignation growing, he was hoping to vent it on the enemies. However,</p><br/><p>「No. We shall fight tomorrow! You must be tired, so rest up.」</p><br/><p>Completely ignored.</p><br/><p>Gabil’s mind went blank in anger. Completely ignoring him, and depending on some strangers! Unforgivable.</p><br/><p>「Head, no, father! Stop this foolishness! You seem to have gone senile, you just don’t see the truth.」</p><br/><p>「What was that? Gabil, what are you planning!」</p><br/><p>Up until now, he was holding back in respect of his father.</p><br/><p>In fact, there were many admirable qualities that he possessed. So Gabil was obedient.</p><br/><p>However, he refused to recognize Gabil, and that Gabil could not forgive.</p><br/><p>His time had finally come, that’s all.</p><br/><p>So nodding once, he shot his subordinates the signal.</p><br/><p>「Father, your time has come to an end. From now on, I am the new Lizardmen’s Head!」</p><br/><p>Gabil loudly declared.</p><br/><p>At this declaration, the goblins noisily ran into the Head’s chamber.</p><br/><p>Armed with stone spears, they surrounded the Head and his guards.</p><br/><p>Gabil’s subordinates, the handpicked elite, also readied themselves behind the goblins.</p><br/><p>「Gabil, what is the meaning of this?!」</p><br/><p>Unable to understand the situation, the Head raised a panicked voice. How unusual.</p><br/><p>However, that only pleased Gabil’s superiority complex.</p><br/><p>「Father, good work up until now! Leave the rest to me, and enjoy your retirement!」</p><br/><p>His subordinates then disarmed the Head and his guards.</p><br/><p>And then, Gabil took the head’s, no, his father’s spear into his hands. The spear, a magic item called the Water Vortex Spear, is the symbol of the Lizardmen themselves.</p><br/><p>An item with overflowing magical power. Held by the strongest lizardman. A weapon that was most fitting for Gabil.</p><br/><p>And looking at his father and the guards,</p><br/><p>「Leave the rest to me! You’ll probably be restrained until the war is over, but bear with it, okay?」</p><br/><p>So he called out.</p><br/><p>「Wait, Gabil! Stop this selfishness! At least, wait until tomorrow!!!」</p><br/><p>Ignoring his father’s pleas,</p><br/><p>「What an eyesore. Take him away!」</p><br/><p>So he ordered.</p><br/><p>Of course, he had no intentions of having him killed. He needed him out of the way, though.</p><br/><p>Gabil needed to personally beat the head.</p><br/><p>Of course, as a new hero who’d stand atop of all the lizardmen, such an event was necessary.</p><br/><p>Surely then his father would recognize his strength and praise him.</p><br/><p>The mere thought made him giddy.</p><br/><p>The new head, taking along his goblins, proceeded to take command over the lizardmen. They will soon hear about the usurpation anyways.</p><br/><p>And once they acknowledge him, they will set off to fight.</p><br/><p>Gabil could not imagine the possibility of defeat.</p><br/><p>His father’s warning were completely wasted on him.</p><br/><p>From the beginning, Gabil’s followers were cheering on, demanding the opening act of the play.</p><br/><p>The ones he found in the prison were the same.</p><br/><p>Drunk on their praise, Gabil enjoyed sitting on the throne.</p><br/><p>His time had finally arrived.</p><br/><p>He had completely ignored the trivial things like an orc invasion.</p><br/><p>.</p><br/><p>What a…</p><br/><p>The Head was tormented by regret.</p><br/><p>Don’t be hasty! So he was told many times before. And this was the situation he had found himself in.</p><br/><p>He was certain in his control over his brethren.</p><br/><p>But to have been betrayed by his own son…</p><br/><p>This is very bad.</p><br/><p>If this goes on, the lizardmen will attack without waiting, and will meet certain demise.</p><br/><p>Making up his mind, he looked at the Guard Captain.</p><br/><p>He is another one of his sons, Gabil’s brother.</p><br/><p>Guard Captain noticed the Head’s signal and nodded.</p><br/><p>「Go!」</p><br/><p>The moment the Head screamed that word, the Guard Captain broke free of the restraints and took off running.</p><br/><p>They needed to let their ally know about this situation.</p><br/><p>That messenger, Souei did not hide his aura.</p><br/><p>So, surely upon getting out of the labyrinth, he would know where to go.</p><br/><p>Betting on that fleeting possibility, the Head sent his son out.</p><br/><p>He had thought about restraining Gabil’s subordinates. However, he did not have the heart to hurt his brethren, so decided to simply escape.</p><br/><p>The Head, intending to take responsibility, stayed in prison.</p><br/><p>And prayed that his son may make it out safely.</p><br/><p>Only 5 days.</p><br/><p>That promise he could not keep, and now lamented his failure.</p><br/><p>And hoped that his failure did not result in them being abandoned.</p><br/><p>Surely he was offered an alliance because of some value they had seen in the lizardmen. Perhaps now they had lost what little value they had.</p><br/><p>Gabil was probably busy making his debut.</p><br/><p>In that case, no one will be sent to replace the tunnel defense squads.</p><br/><p>With reinforcements, the orcs will gradually grow stronger, and the defense teams will be eventually overrun.</p><br/><p>The women and civilians we had gathered in the center of the labyrinth will then be defenseless.</p><br/><p>Should that happen… but, grieving won’t stop this.</p><br/><p>We will defend them to the end.</p><br/><p>That was the Head’s decision.</p><br/><p>To buy even a bit more time. That was the only thing he could do.</p><br/><p>−−−−−−−−−−−−−−−−−−−−−−−−−−</p><br/><p>Side Story</p><br/><p>A wide conference room.</p><br/><p>Made from fragrant wood, a table that must have cost a fortune.</p><br/><p>A true round table, capable of sitting more than 10 people.</p><br/><p>The number of chairs currently set: 12. Surpassing the most extravagant designs, even royalty would have a hard time acquiring it.</p><br/><p>A rug that textile workers too more than ten years to weave covered the floor.</p><br/><p>One wall was decorated by a painting of some wondrous landscape by a heavenly artist.</p><br/><p>Any article in the room would cost ten years worth of an aristocrat’s income.</p><br/><p>And by the entrance of the room,</p><br/><p>A single man, dressed like a clown, refrained from entering.</p><br/><p>And seemingly to an empty room,</p><br/><p>「For gathering despite your busy schedules, I offer my gratitude!」</p><br/><p>Respectfully offered his greetings.</p><br/><p>Carefully, as if to avoid losing the interest of the beings inside.</p><br/><p>Today’s guests. They were those whom you must never anger, supreme beings.</p><br/><p>As if out of thin air, a shadow of a man appeared in one of the chairs.</p><br/><p>Lacking details, a hazy shadow.</p><br/><p>「What plot are you intending to humor us with today? We tire of this, how about starting already?」</p><br/><p>A woman replied.</p><br/><p>A room that was previously empty was now occupied by a number of auras.</p><br/><p>「Guhahahaha. Fret not, it shall be soon, no? The tragic birth of a new “Maou“?」</p><br/><p>(TL Note: Maou – demon lord. You might as well know this word)</p><br/><p>「Fufufu. A Maou? We have plenty of those already! Any more won’t be amusing in the slightest, no?」</p><br/><p>「Hey, don’t say that. The ruler of Jura Forest has disappeared. A new one is needed, right?」</p><br/><p>「In that case, shouldn’t we just claim it for ourselves?」</p><br/><p>「Hmph. It’s because of people like you that the Nonaggression pact may be annulled!」</p><br/><p>「Shut up! I know.」</p><br/><p>And other similar egoistic conversations were held among them.</p><br/><p>The clown by the entrance felt as if covered by sweat from their very presence, and yet couldn’t wipe it off.</p><br/><p>Because he is a demon. He doesn’t sweat.</p><br/><p>He, the demon Gelmudo, simply wished to explain the stage he had prepared for them.</p><br/><p>「Now then, ladies and gentlemen! I wish to explain the play, if you may permit?」</p><br/><p>Fearfully he called out.</p><br/><p>The noisy conversation suddenly stopped and all eyes focused on Gelmudo.</p><br/><p>Intimidating him without having said a word.</p><br/><p>Were they insulted to be interrupted by a lower rank Gelmudo?</p><br/><p>Worry spread in his heart. Were he to earn their displeasure, someone like Gelmudo would be erased in a blink of an eye…</p><br/><p>Contrary to his fears,</p><br/><p>「Begin already! Didn’t I already say I was bored of boredom?」</p><br/><p>They permitted it.</p><br/><p>Relieved, he began the explanation.</p><br/><p>He had planted the seeds of conflict in the forest. There were some that failed to bloom, but there were plenty fruitful ones.</p><br/><p>He had also intended to plant some seeds among the Ogres and the Treants, but those seems were refused.</p><br/><p>The ones he manipulated were still powerless.</p><br/><p>However, on the ones who rejected being named by him–the ogres, he had passed his judgment.</p><br/><p>So overall he was satisfied with the results.</p><br/><p>「Now then, let us open the curtain on this tragedy! The threat of the orc lord met with an alliance of the races! The one left standing shall be proclaimed the new “Maou“!!!」</p><br/><p>Right.</p><br/><p>This was all planned to create a new “Maou“. That task was left to Gelmudo.</p><br/><p>He was overjoyed with this order. If he handled this well, he could obtain a maou for his personal use.</p><br/><p>He worked hard towards that end.</p><br/><p>Until now, for 300 years, he had been planning a species war.</p><br/><p>However, Veldora’s disappearance caused the plans to spiral out of control.</p><br/><p>So he gave up on having a war between the named monsters born from the goblins, lizardmen, and other such races.</p><br/><p>Instead, he sent out the Orc Lord. This was a not in the plan, but it was something he could use well.</p><br/><p>An orc lord loyal to his order.</p><br/><p>The game’s rigged, but there’s nothing he could do about it now.</p><br/><p>After crushing the goblins and the lizardmen, the Orc Lord will become the new “Maou“.</p><br/><p>He also got rid of those annoying ogres.</p><br/><p>Now, there was nothing to worry about. As long as the orcs avoided invading the treants territory, that is.</p><br/><p>All according to plan!</p><br/><p>He had feared the many maou that had been manipulating him until now, but he finally had the chance to return the favor.</p><br/><p>He would soon be able to manipulate a maou! A birth of one loyal to his command.</p><br/><p>Hiding his excitement, Gelmudo continued the explanation…</p><br/><p>He could already see the Orc Lord that would bow before him.</p><br/><p>The day his ambitions would be fulfilled would come soon.</p><br/><p>He honestly believed that…</p><br/><p>.</p><br/><p>.</p><br/><p>Translator’s Corner</p><br/><p>Clown: I know what you’re all thinking: “I knew clowns were evil!!!”</p><br/><p>ヽ(￣д￣;)ノ=3=3=3</p><br/>\n</div>"}