{"title": "Chapter 52 – Journey", "id": 52, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-52-%E2%80%93-journey", "volume_title": "Volume 1", "body": "<h1>Chapter 52 – Journey</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Editor’s corner (cast: Yuuka, Smoggy and The Psychiatrist)</p><br/><p>*Yuuka enters Psychiatrist’s office*</p><br/><p>Yuuka: Good afternoon.</p><br/><p>Psychiatrist: Good afternoon, now take a sit. *shuffling of papers* Do you know why you’re here today?</p><br/><p>Yuuka: I was told that everyone had to go for a checkup before we’re deemed safe to work. Don’t worry doc, I’m perfectly sane.</p><br/><p>Psychiatrist: I’m sure you are, but I’ll still need to ask you some questions, it’s protocol, nothing I can do about it.</p><br/><p>Yuuka: Ask away doc.</p><br/><p>Psychiatrist: Okay, first question: You see a crying child alone, what do you do?</p><br/><p>Yuuka: Eat him.</p><br/><p>Psychiatrist: … *ahem* Okay, second question: Who is your role model, or rather, “senpai” as you people call them?</p><br/><p>Yuuka: DemolitionD+ Senpai.</p><br/><p>Psychiatrist:(I need to get out of here) Okay, final question: Who or what inspires you?</p><br/><p>Yuuka: I look to Filthy Frank for inspiration.</p><br/><p>Psychiatrist: *Runs for the door and shouts* EVACUATE THE BUILDING NOW!</p><br/><p>Yuuka: Hey wait! I need you to approve that I’m mentally sane before I can work~ *chases after doc*</p><br/><p>Psychiatrist: GET AWAY FROM ME, YOU ARE NOWHERE NEAR SANE!</p><br/><p>Yuuka: *Master Spark*</p><br/><p>…</p><br/><p>Yuuka: Phew, now that I am deemed as ‘Mentally stable’, I better go find that bear…</p><br/><p>Following day’s news headlines: Terrorist Attack on Psychiatric Clinic! Is The Government Responsible?</p><br/><p>Smoggy: My, that’s terrible! Weren’t you there yesterday?</p><br/><p>Yuuka: No idea.</p><br/><p>.</p><br/><p>.</p><br/><p>Life in the Royal Capital</p><br/><p>Chapter 52: Journey</p><br/><p>ED NOTE: There are some parts that even I don’t understand myself; forgive me for any errors.</p><br/><p>The Devil Myulan was relieved to finally be able to report.</p><br/><p>She had left her best friend and the violent Demon lord Milim behind in the city which they were to monitor, but, this was something completely outside of her expectations.</p><br/><p>It surprised her that a weak little slime is the head of the city, furthermore, Milim’s behavior was also something she couldn’t understand.</p><br/><p>The way a demon lord thinks is something an ordinary person will never understand.</p><br/><p>Rather, isn’t that particular Demon Lord a little, no, relatively eccentric?</p><br/><p>On a cultural level, it seems the demon lord has made friends in the city they were monitoring.</p><br/><p>What’s more, the fact that the head of the town is a slime who can take on the form of a masked person was also being reported.</p><br/><p>Just to be safe, the fact that Milim was staying in the city was not reported.</p><br/><p>I don’t think she’ll do anything that will violate the agreement between the demon lords.</p><br/><p>But, considering the fact I can’t understand what Milim is thinking, I must be very cautious.</p><br/><p>We definitely cannot use magic in front of Milim.</p><br/><p>I judged that communication magic or magic in general, will instantly be detected by Milim.</p><br/><p>If she doesn’t know my identity, there is a chance that she might not make a move.</p><br/><p>These are the types of things you report.</p><br/><p>「I see…I can use this. Good work, please continue to monitor them.」</p><br/><p>Clayman said this happily, seemingly having come up with something.</p><br/><p>But this has nothing to do with Myulan.</p><br/><p>As the garrison’s Shaman, she is serving as an officer.</p><br/><p>(Stupid humans. I’m a devil, and yet they don’t suspect a thing.)</p><br/><p>Although she looked down on them, talking to them for some time stirred up strange emotions in her heart.</p><br/><p>(I’ll let it be for the time being.I wish to enjoy these moments for a little longer.)</p><br/><p>She made such a wish subconsciously.</p><br/><p>Thus, she went back to work without being too concerned.</p><br/><p>.</p><br/><p>The Demon Grucius, now a member of the frontier garrison, followed his platoon as they advanced into the forest.</p><br/><p>For a beastman such as he, horse-riding was mere child’s play.</p><br/><p>As such, he naturally stood out in the team.</p><br/><p>Even when he held back his true abilities, he couldn’t possibly be inferior to humans.</p><br/><p>Therefore, he was offered the role of vice captain for one of the three platoons.</p><br/><p>However, he refused stating that a newcomer should not hold such a position even after the platoon commander insisted.</p><br/><p>Even though he drew some attention to himself, as long as he maintained his current situation, everything will be fine. That’s what he believed.</p><br/><p>However, what he is currently interested in is the group of goblin wolf riders that followed them.</p><br/><p>The strangely evolved Star wolves and their riders the hobgoblins.</p><br/><p>As if they were a skilled team, even their breathing is synchronized. This suggests a high level of proficiency .</p><br/><p>Above all, The one known as Gobuta was the best amongst the hobgoblins.</p><br/><p>Based on his intuition, the best course of action is to kill him on sight.</p><br/><p>Grucius curled his tongue.</p><br/><p>Originally, he was only planning to invite the Oni, but in this situation it’s very likely there are many other talented individuals.</p><br/><p>There are a total of 100 Goblin wolf riders, and every one of them have talents I want by all means.</p><br/><p>Amongst them are captain Rigur and vice captain Gobuta.</p><br/><p>These two have an overwhelming presence over the others.</p><br/><p>There are also others, like the Dragonewts I see time to time. They will also become good warriors with some training.</p><br/><p>The Orc Pioneers, they aren’t much on their own, but truly shine when together in a group.</p><br/><p>I heard they were led by an orc lord called Gerudo, but I haven’t seen him around the city.</p><br/><p>I heard he’s always out transporting goods, but he’s most likely a powerful individual.</p><br/><p>(What do you know, I’ll be darned! This city is crazy! If I make a move, all this war potential will be ours!)</p><br/><p>In fact, when I look a closer look at the Oni, they’re either my equal or even above me.</p><br/><p>Even though he is the weakest amongst the servants of the Beast King, this is still clearly something abnormal.</p><br/><p>Well, it’s fine isn’t it? It’s more fun this way!</p><br/><p>Having strong comrades is something good. Even if we failed, having powerful enemies is also desirable! That much is true.</p><br/><p>We, the Beastmen, are a race that thrives in battle. Strong enemies are something that we welcomed.</p><br/><p>Thus, while pondering about how he should invite them, he continued with his Frontier Garrison duties.</p><br/><p>＊ ＊ ＊</p><br/><p>YAHHOO ——- Nice!</p><br/><p>I am very satisfied with the feeling of spaciousness after such a long time.</p><br/><p>When I was in the city, I had to pay attention to what I say, my mind feels like it’s about to burst.</p><br/><p>Thus, I left all the problems in the city to the two Oni.</p><br/><p>But, Benimaru said this himself:</p><br/><p>「Please leave everything regarding the city with us two Oni, we’ll be able to accomplish anything!」</p><br/><p>That’s what he said. I’m sure he’ll manage somehow.</p><br/><p>Ranga has been on guard the whole time, but no signs of movements were spotted. Now it’s Souei’s turn to take over guard duty._</p><br/><p>He who doesn’t sleep, Souei.</p><br/><p>By creating clones, he can get some sleep in shifts. Even though it’s certainly a useful ability, I don’t want to tell him that he must sleep.</p><br/><p>From the looks of things, no one’s showing their true colors.</p><br/><p>To me, even though they don’t seem to be related to Milim, they may be acquaintances.</p><br/><p>Because this cannot be handled carelessly, we must monitor them carefully.</p><br/><p>Unfortunately, they don’t seem to have made a move at all.</p><br/><p>If that’s the case, then all we can do is to continue to be vigilant. Since I can immediately return to the city with 『Shadow Step』, I decided to leave the city for a little while.</p><br/><p>Or rather, I speculate that as soon as I’m gone, they’re going to start making their move. Milim has also just left, so they must make their move now.</p><br/><p>I was on alert whilst thinking about this, but after first day I went out of town nothing happened whatsoever.</p><br/><p>After 3 days had passed, I’m starting to think that I may be overly worked up about things.</p><br/><p>They also seem to be fairly strong.</p><br/><p>“Leave it to me!”</p><br/><p>And because he said that I entrusted him to lead the way.</p><br/><p>After hearing that, I am now enjoying the spacious feeling after such a long time.</p><br/><p>I’m taking this route because roads haven’t been developed yet.</p><br/><p>After getting off the streets, I followed the animal trail.</p><br/><p>Is this really all right?</p><br/><p>If that’s not enough, we advanced through a variety of different routes. However, there’s a veteran here, so I left it to him.</p><br/><p>Even though he has a tearful face, lets believe in him.</p><br/><p>Besides, it’s not like this is the first time he has come by here.</p><br/><p>One moment later,</p><br/><p>「Oi oi, we’re not actually lost are we?」</p><br/><p>I said that as a joke.</p><br/><p>「Hahaha. There’s no way we would have gotten lost here…」</p><br/><p>His wording has became strange, everything is fine right?</p><br/><p>Referring to the map in my mind, it seems we walked by here just now. I must be imagining things.</p><br/><p>「Oi! This is no joke. You’re lost, aren’t you!”</p><br/><p>The 3 looked at each other,</p><br/><p>「「「WE’RE VERY SORRY!!!」」」</p><br/><p>And they apologized.</p><br/><p>Anyway, it seems that they have gotten lost trying to take a shortcut. Are these guys really professionals?</p><br/><p>Well whatever.</p><br/><p>I guided them back onto the road, the one they are familiar with.</p><br/><p>We passed by a field of Illusion Flowers in full bloom, that might be the cause of us getting lost. I didn’t tell them though.</p><br/><p>「How could we have gotten lost in such a place……」</p><br/><p>「I may have lost a little self-confidence……」</p><br/><p>「I’m overwhelmed, If you professionals paid more respect to the road and followed it then maybe we would not have been lost.」</p><br/><p>They looked a little pitiful, so I told them about the Illusion flowers.</p><br/><p>「That’s a B rank harvesting mission objective!, It’s pretty difficult ya know!」</p><br/><p>Ellen proclaimed enthusiastically.</p><br/><p>In addition to being material for magic items, it’s also quite a rare flower.</p><br/><p>After a lot of trouble, we returned to pick some. We managed to pick 40, and divided it up to 10 per person. Perhaps, I can understand its uses by storing it in my stomach to analyze.</p><br/><p>About a week’s worth of time has passed, and we finally arrived at the exit of the forest.</p><br/><p>Certainly, but I wonder how much less time would be wasted if I took out the number of days we spent being lost.</p><br/><p>Well, there’s no need for me to rush for this journey. Rather, long trips are much more fun.</p><br/><p>Well, a slime’s body can’t get tired anyway, but I’ll need to remain clean, so I asked Ellen to use〈Cleaning Magic〉.</p><br/><p>Because Ellen used〈Cleaning Magic〉, I learned it.</p><br/><p>When I tried using it, my magic amplified the effects of the spell, cleaning everyone in the process. Thanks to that, the journey was more pleasant than usual.</p><br/><p>Starting a fire was easy, and I stayed up all night as the night-watch.</p><br/><p>「RIMURU SAN! LET’S ADVENTURE TOGETHER FOREVER!!!」</p><br/><p>Ellen exclaimed this emotionally, but as usual, I declined.</p><br/><p>If this was before I met anyone, that would have been a good idea, but I’m the head of a city now. I can leave the governing to the others, but I can’t leave it uncared for.</p><br/><p>Anyways, if someday my presence isn’t needed anymore , I’ll think about the offer then.</p><br/><p>A thought suddenly crossed my mind-Even if I accepted, this will depend on whether or not she’s still alive by that time.</p><br/><p>I wonder is this how Milim feels? To make an important friend, only to out live them, would I choose loneliness instead?</p><br/><p>I don’t know.</p><br/><p>The current me doesn’t have enough experience to determine that.</p><br/><p>.</p><br/><p>I shook my sadness away, and we went towards the roads.</p><br/><p>Our destination is the small country of Brumund. This particular country is so small that all the nobles are feudal lords of villages. It’s really just a country which comprises of its royal capital.</p><br/><p>I was being led by the trio to the city which housed Brumund’s Freedom Association Branch.</p><br/><p>However, the capital is the only large city and in the castle town lies the Brumund’s Freedom Association Branch.</p><br/><p>We have arrived in the first village earlier than expected, and the carriage left as scheduled.</p><br/><p>We arrived at noon, and ate lunch at a restaurant.</p><br/><p>Seems like the traffic is not congested as it is a small country, which is always nice.</p><br/><p>「Hear me, I am the Mighty Axe, WAARGH~ and with a single swing, I killed this fellow!」</p><br/><p>「Wow~ As expected of Biddo san!」</p><br/><p>「Big Brother Biddo, this is a strong monster isn’t it? You mean you killed it by yourself?」</p><br/><p>「More or less, a single horned bear is no match for me!」</p><br/><p>When we heard the conversation, we took a peek at the horned bear they were talking about.</p><br/><p>The main subject of the story, the horned bear, made me almost spit out all the food in my mouth when I saw it.</p><br/><p>It was only the horn of a horned rabbit embedded into the forehead of the bear, laid on the floor as if it was a monster’s corpse.</p><br/><p>The bear is not a monster but rather, is classified as an animal, but it’s hard to tell the difference.</p><br/><p>Fortunately I have my analyze ability, without it, I wouldn’t have been able to tell the difference.</p><br/><p>A clear way to tell the difference is whether a “magic stone” drops or not. Even so, for an ordinary person that’s simply just cruel because it’s so rare.</p><br/><p>Even if it didn’t drop a “magic stone” due to it being an animal, who knows how many of them animals would have been killed before people realize that they are animals, not monsters.</p><br/><p>Well, even though demonic energy seeps from monsters, it’ll still be rather difficult to judge. In the end, due to the high level of my skill , I am able came up with this conclusion.</p><br/><p>「Oi, the guys in that corner are all proud about that fake horned bear, aren’t they just like ants?」</p><br/><p>「Huh? A fake? You saw through the trick?!」</p><br/><p>「Of course! It’s the horn of a horned rabbit, welded on with magic……」</p><br/><p>「As expected, you saw through it?」</p><br/><p>「No, Danna. That person’s purpose is not to flaunt. If they took this over to the king, they may become this village’s hero! They’re doing this not to protect the village, but rather to fill their bellies and live in fancy inns.」</p><br/><p>I see.</p><br/><p>I understand the guild members’ explanation. In short, they’re scammers. The world has so many different kinds of scammers that It has become a profession.</p><br/><p>I was planning to leave after exposing them,</p><br/><p>「Oi oi, wait a moment! You just accused me of being a fake! Making a fool out of me, I hope you’re prepared for the consequences?」</p><br/><p>I wonder, why do all the dumb ones have such good hearing. Furthermore, they even decided to pick a fight when I still idling…</p><br/><p>You people even believed in such a fraud…</p><br/><p>「Huh, isn’t that Cabal-san……」</p><br/><p>「Ellen-san’s also here!」</p><br/><p>「Isn’t that person over there Gido!」</p><br/><p>After hearing these words, people flooded the dining room immediately</p><br/><p>「Wha, what’s this……you three are terrible, you should have given me a shout out if you came back!」</p><br/><p>「Who are you, have we met before?」</p><br/><p>「Oh come on, I may look all rundown and tattered now, but it’s me biddo! I was receiving guidance from you in the capital after picking a fight, it’s me biddo!」</p><br/><p>Well that was unexpected.</p><br/><p>This group of 3 (idiots), are unexpectedly famous.</p><br/><p>They seem acquainted with the fraud to a certain degree, but the other people seem to respect the three.</p><br/><p>It’s rather strange that they don’t seem all that happy even though they’re being respected.</p><br/><p>But, the biggest surprise to me was the fact these 3 are actually famous adventurers.</p><br/><p>They are mainly famous for their sudden rise in prominence recently.</p><br/><p>……Even so, it’s because they have brought along monsters from my town with them during missions, that’s why they were able to perform so significantly well…</p><br/><p>I looked at the 3, and they looked away in a panic.</p><br/><p>I’ll not press them on this matter.</p><br/><p>That’s probably something they don’t want to mention to the people here.</p><br/><p>Even so, even if I don’t touch the matter, it’s still there.</p><br/><p>「Do you get it now?」</p><br/><p>「「「OF COURSE!!! WE’LL GUIDE YOU TO THE CAPITAL! EVERY STEP OF THE WAY!!!」」」</p><br/><p>Then it’s all good.</p><br/><p>The trip ended smoothly even after such a thing happened.</p><br/><p>Thus, we arrived at the royal capital of the small country of Burmund.</p><br/>\n</div>"}