{"title": "Chapter 68 – Soul and Hope", "id": 68, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-68-%E2%80%93-soul-and-hope", "volume_title": "Volume 1", "body": "<h1>Chapter 68 – Soul and Hope</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Soul and Hope</p><br/><p>3 days have passed.</p><br/><p>Shion hasn’t woken up yet.</p><br/><p>I think she sleeps too much. Really, I wish she would stop doing such a thing.</p><br/><p>……</p><br/><p>No, I know.</p><br/><p>I know she will never open her eyes again.</p><br/><p>However, I did not want to admit it.</p><br/><p>I wish she could always fool around and making her usual crap and unpleasant cooking.</p><br/><p>But, such wishes will not come true.</p><br/><p>Because a dead person will never come back again.....</p><br/><p>《Notification. The analysis of the barrier that covers the surroundings had ended.</p><br/><p> Cancellation is possible. Do you want to execute it? YES/NO 》</p><br/><p>No, you may not execute it yet.</p><br/><p>It seems, the analysis of the barrier by『Great Sage』had ended.</p><br/><p>It took more time than I thought, perhaps it’s because of the size of the barrier that covers the whole city. Maybe, it was possible to completely analyze it because I ate some part of the barrier.</p><br/><p>Whatever.....</p><br/><p>The barrier too, I don’t care anymore.</p><br/><p>How is the result of the other investigation?</p><br/><p>《Notification. The search result, not found. Magic related to reviving the dead was not discovered.》</p><br/><p>Is that so.....?</p><br/><p>No, that’s might be so.</p><br/><p>Such convenient magic like that, there’s no way for it to be discovered so easily. It’s natural.</p><br/><p>Still, perhaps there might be another possibility, isn’t there?</p><br/><p>Only thinking about it is useless, even if it's only a futile struggle, I will not be stopped by such things.</p><br/><p>Shion doesn’t open her eyes.</p><br/><p>Isn’t it natural for her to sleep.....?</p><br/><p>However, I’ll muster all my abilities, and I will seek if there is a way or not.</p><br/><p>I will protect their body with my magic power, not just Shion, but also the bodies of all people that sleep here.</p><br/><p>So their body will not decay.</p><br/><p>Their bodies will be sustained by magic power, they will never disappear.</p><br/><p>It might be useless. However, I’m still hung up on such wish.</p><br/><p>But, there was no result.</p><br/><p>From the magic book I obtained at the school, Revival magic didn’t exist.</p><br/><p>Is that so? Of course it is.</p><br/><p>I’m praying that you all will awake someday, so please sleep inside me for the time being.</p><br/><p>So I thought, when I try to absorb everyone,</p><br/><p>「Danna, I’m sorry.... I’m late.」</p><br/><p>「Rimuru-Danna, how should I says it?.....」</p><br/><p>Some people’s voices are calling me, there are some people approaching.</p><br/><p>Please wait a bit longer; I will soon get back on my feet.</p><br/><p>Or so I thought,</p><br/><p>「Rimuru-san, you see....</p><br/><p>Although the possibility are low...., erm, it’s closer to zero actually.....</p><br/><p>There are several fairy tales about reviving the dead.」</p><br/><p>Hearing those words, I feel my alienated mind stuck back with a click.</p><br/><p>I sense my mind return to my body.</p><br/><p>「Please tell me the details, Ellen」</p><br/><p>I turn around and face the three adventurers</p><br/><p>As long as there is a possibility, I will not hesitate to take it.</p><br/><p>Ellen nods, and starts her stories....</p><br/><p>.............</p><br/><p>..........</p><br/><p>......</p><br/><p>I heard Ellen’s stories.</p><br/><p>Although it’s just some fairy tales, it seems to be based of real event. </p><br/><p>The story went like this:</p><br/><p>A Girl and Her Pet Dragon.</p><br/><p>Once upon a time a Girl helplessly watched her Dragon die, the Girl lamented the death of her pet Dragon who was her only sole friend, in her rage She destroyed the country responsible for the Dragon’s death by Herself.</p><br/><p>In that country resided 10.000 souls.</p><br/><p>Thus, the Girl evolved into a Demon Lord. At that moment, a miracle occurred.</p><br/><p>The Girl’s soul became connected to the Dragon’s. As the Girl evolved the Dragon also evolved.</p><br/><p>However, the miracle only reaches that far before it ended.</p><br/><p>The dragon’s soul already disappeared when It died, so lacking a soul It revived as a wicked chaos dragon.</p><br/><p>As if it was faithful to what the girl had wished, to bring calamity to the world, it transformed into a wicked dragon.</p><br/><p>When she returned from her rage, the girl had become a demon lord, while grieving, she decided to personally sealed the chaos dragon who was both her pet and sole friend.</p><br/><p>Thus, the story ends with the Girl sealing the Dragon.</p><br/><p>Besides that, there were also stories about a vampire girl who revived after her blood was drained, or about a spirit magician who was revived. In every story the character inside had a great change in their personality, as if they had become a completely different person.</p><br/><p>It had been written in the prohibited forbidden books.</p><br/><p>At the Secret Library of Sorcery Dynasty of Sarion, the only copy of the stories exists.</p><br/><p>But, it doesn’t matter.</p><br/><p>So the problem now....</p><br/><p>Is evolution, huh?</p><br/><p>It’s a fact that the evolution of a monster is vague. Just having a name is something significant.</p><br/><p>Isn’t there is possibility? That if I also become a Demon Lord......</p><br/><p>However, it’s meaningless if the monster lacks soul... but...</p><br/><p>No, wait! At this place, there is a barrier that no monster can pass.</p><br/><p>If you think carefully, isn’t there also a possibility that the soul won’t become dispersed?</p><br/><p>《Solution. The possibility for the Shion’s and others’ souls still exist, is 3.14%》</p><br/><p>Isn’t that Pi (π)! No, not that...</p><br/><p>Although it seems low, but on the contrary, for me it is tremendously high.</p><br/><p>There is 3% probability to revive them from the death; it’s something to be believed on.</p><br/><p>After all, I can’t believe that the stubborn Shion will be dead just like that. I must bear it.</p><br/><p>At last I see hope. Now, the problem is how to accomplish it!</p><br/><p>Whether it’s possible for me to become a Demon Lord, however...</p><br/><p>《Solution. Master has already fulfilled the conditions for Demon Lord’s Seed.</p><br/><p>To fulfill the condition for evolving into the Demon Lord (for Seed to sprouts), it is necessary to sacrifice 10.000 Human beings (Souls).》</p><br/><p>So, is it only that? So easy.</p><br/><p>Demon Lord? To become it. So easy.</p><br/><p>I only need to dispose 10.000 trashes, what an easy work.</p><br/><p>If it’s still not enough, I’ll just need to dispose more.</p><br/><p>Right, fortunately, the food was already here. The wheels had turned.</p><br/><p>At that time,</p><br/><p>「Ellen, for telling me the stories, you had my gratitude. However...</p><br/><p>Is it all right? For you, to let me become a Demon Lord?」</p><br/><p>I stare at Ellen while saying that.</p><br/><p>Ellen cast her head down and become silent.</p><br/><p>Then she raise her head and replied with resolve.</p><br/><p>「I originally come from Sorcery Dynasty of Sarion.</p><br/><p>To tell the truth, I yearn for the freedom of an adventurer.</p><br/><p>But it’s all right.</p><br/><p>I also want to help Shion-chan.</p><br/><p>The Church, is unforgivable.</p><br/><p>Just because it was a monster, it was evil? I really hate this idea.</p><br/><p>I’m talking with you, because I already understand that things will not stay the same like before.</p><br/><p>Even if I continue as Adventurer, surely I’ll only cause problems to the Freedom Association.</p><br/><p>So, you see...</p><br/><p>I have decided to join this country.</p><br/><p>I want to spend my remainder life in this country.</p><br/><p>It’s okay, right? Rimuru-chan?」</p><br/><p>Hearing those words, Cabal silently shakes his head, Gido stares at the sky with his eyes closed.</p><br/><p>I look at them as if waiting for their response,</p><br/><p>「Well~. If Ojou-sama says so, as a bodyguard I don’t object.」</p><br/><p>「Neesan....,No, Ellen-sama. Is it all right?」</p><br/><p>The two of them look at Ellen resolvedly.</p><br/><p>It seems, they are not just a mere adventurers.</p><br/><p>Ellen, her real name is Eryune, she seems to be a noble from Sorcery Dynasty of Sarion.</p><br/><p>And then, she studied at Royal Capital Academy, she left the country because she yearned to be an adventurer afterward.</p><br/><p>The two bodyguards followed her.......</p><br/><p>「Maybe, when Rimuru-chan becomes a Demon Lord, the information about me would be leaked out and become known.</p><br/><p>The information about me will surely become known by the Intelligence Bureau.</p><br/><p>Even if I say my refusal, the country will try to bring me back.</p><br/><p>So, you see, I want help the best I can.</p><br/><p>Until the last minute, I want to see how this will end with my own eyes.」</p><br/><p>Her serious eyes are looking at me.</p><br/><p>I already obtained the needed information.</p><br/><p>I don't know how much the response of the neighboring Sorcery Dynasty of Sarion will influence this country, but I can't disregard the fact that Ellen may be forcefully taken away.</p><br/><p>However, I had judged that there is still no explicit danger to her for now.</p><br/><p>That will be a matter for another day.</p><br/><p>「Well, it will be a matter for later time.</p><br/><p>I want to avoid doing things that would increase the number of enemies.」</p><br/><p>「 So? It’s inevitable.</p><br/><p>Even so, whether or not Shion-chan can be saved? Do you mind if I stay till the end?」</p><br/><p>「I see, it’s thanks for information Ellen-san gave.</p><br/><p>Till the end, I don’t mind if you want to stay.</p><br/><p>However, if I become a Demon Lord, and my personality change, don’t hold me responsible if I end up attacking you, understood?」</p><br/><p>「Unnn... Even if I don’t like it, so be~ it.</p><br/><p>I believe in Rimuru-chan!」</p><br/><p>「Heyhey... Ojou... you got us involved as well?</p><br/><p>Really, so be~ it...」</p><br/><p>「There is no other way, Danna. Ellen-sama is always like this every time.」</p><br/><p>Even if those two are sighing, they don’t oppose it.</p><br/><p>Whatever the impression they made, these two are deeply devoted to Ellen.</p><br/><p>Still, the decision had already decided by now.</p><br/><p>To save Shion!</p><br/><p>For that reason, if it is necessary for me to become a Demon Lord, that’s fine.</p><br/><p>In about 3 days, the enemy main army will conduct their attack.</p><br/><p>The situation had already been confirmed.</p><br/><p>Now, how should we proceed?</p><br/><p>To decide this ambitious plan, it’s too early to talk about it.</p><br/><p>To conduct a preparatory meeting, it is necessary for everyone to attend it.</p><br/><p>If the barrier is lifted up suddenly, Shion’s and others’ soul may disperse and disappear.</p><br/><p>Fearing that, I erect the greatest barrier that covers the entire city using my magic power.</p><br/><p>A surprising amount of energy is consumed by doing it, but I am not concerned about it now.</p><br/><p>Instead, compared to the sense of hopelessness that I felt yesterday, I am now feeling delighted.</p><br/><p>Despite it might seem useless if you think about it, I’m glad I analyzed the barrier. Thanks to it, there’s a possibility for the revival of Shion and the others.</p><br/><p>Receiving the report that the executives had gathered promptly, I go towards the conference room.</p><br/><p>In that place, there are three uninvited people.</p><br/><p>The executives don’t understand why the three are here, so they are perplexed</p><br/><p>「Danna, I apologize for things that happen now...... I didn’t think my country would do such reckless action.」</p><br/><p>Youmu said that while bowing his head.</p><br/><p>The two people beside him Grucius and Myulan also bowed their head.</p><br/><p>For some reason Myulan doesn’t raise her bowed head and kept looking down.</p><br/><p>I thought it’s suspicious.</p><br/><p>「Grucius, Because you helped Youmu to inform me, You have my gratitude.</p><br/><p>By the way, there’s an important question.</p><br/><p>I remember that there’s a barrier that’s covering this city that prevent any monsters from entering, so how did you guys pass it?」</p><br/><p>「Wh, what are you saying? I’m a Human......」</p><br/><p>「Sorry, but there’s no time to play dumb. I know the facts that you and Myulan are Devil.」</p><br/><p>I ask the question I had prepared before, Grucius stopped playing dumb.</p><br/><p>Youmu is not surprised by that. It seems he had already known about it.</p><br/><p>「It exposed huh.... Even though I thought my disguise as a human was perfect.</p><br/><p>The barrier had also influenced me and Myulan.</p><br/><p>In fact, I’m only assisted, Myulan was the one who actually lifted up the barrier herself.」</p><br/><p>「That’s..., right. It’s my specialty, not only Black Magic (Jujutsu/Hex) and Magic Arts (Majutsu/Sorcery), Barrier Arts is also my specialty.....</p><br/><p>Entry is possible if you obstruct the flow of energy. But it will be restored once you enter....</p><br/><p>Other than that, there is something that I must ask to you for your forgiveness.」</p><br/><p>It was the first time she raised her head, and made eye contact with me.</p><br/><p>Something she wants to be forgiven for? I don’t think there is anything like that.</p><br/><p>While drinking the tea that Shuna served, I decide to hear the three’s stories.</p><br/><p>[Actually, I’m a subordinate of Demon Lord Clayman....</p><br/><p>Clayman is the Demon Lord that was called as the Marionette Master.</p><br/><p>The mission he gave to me was to do a secret investigation of this city.</p><br/><p>And so, I reported to him the information about this city that I obtained, at that time he was in a good mood and said,</p><br/><p>“After you finish the next ordered task, you will be released.” Something likes that.</p><br/><p>I was deprived from my heart by Clayman, my life and death was in his hands.</p><br/><p>Because of that I can’t go against any of his orders, so I was rejoiced that he would reward me with my freedom.</p><br/><p>And the last order he gave me was...」</p><br/><p>Youmu and the Frontier Garrison suddenly received a summoning order to return and report.</p><br/><p>Even if it sounds strange, all of them couldn’t disobey the order and so they returned to the Earl fiefdom in Falmas Kingdom.</p><br/><p>Then, when they entered the Earl fiefdom, they noticed that there were a lot of soldiers.</p><br/><p>When the scout returned with the information, which said: there will be an attack on the Monster’s country.</p><br/><p>Youmu that recognized this as Rimuru’s Country, immediately asked Grucius and Myuran to relay this information.</p><br/><p>Those two are new recruits, they are also not the Earl’s subordinate, so their face hasn’t been known yet.</p><br/><p>So they can be left out from the Earl summons.</p><br/><p>Receiving their orders, Grucius was to report to me, while Myuran was to inform the City.</p><br/><p>But then, the tragedy occurred.</p><br/><p>The reason was, because the report from Myuran never arrived. That was the reason why Myuran is asking for my forgiveness.</p><br/><p>The cause why she never sent the message was because she received Clayman’s order.</p><br/><p>This is what Clayman said that time.</p><br/><p>「It has become interesting! For a war between Human and Monsters to occur.</p><br/><p>What an ideal development.</p><br/><p>Myulan, this is my last order.</p><br/><p>Don’t relay the message to the Monster’s City.</p><br/><p>Human and monster detest each other, so induce them so they come to war!」</p><br/><p>The purpose was to cause a war.</p><br/><p>Although he said that this was the last order, she never received her heart back.</p><br/><p>And thus we come to this condition right now.</p><br/><p>「Danna! You can be angry. But, I hope if you can, please forgive Myulan!」</p><br/><p>Youmu is desperately protecting Myulan.</p><br/><p>However, does the fault lie with Youmu?</p><br/><p>The one, who wronged me, was not Youmu, but the government of Falmas Kingdom. No! It is the king himself.</p><br/><p>Youmu and I had a common goal, he also regrets he wasn't able to inform me, but he didn't have any bad intentions.</p><br/><p>This guy (Youmu) has a strong sense of responsibility.</p><br/><p>I think he was a good guy.</p><br/><p>I then stand up, and walk naturally to besides Youmu.</p><br/><p>And, I casually move my hand and pierce Myulan’s chest.</p><br/><p>「Danna!!!」</p><br/><p>I heard Youmu’s voice panicking, I’m Ignoring it.</p><br/><p>Myulan opening her eyes widely in astonishment, and resigned herself to her fate.</p><br/><p>Because there’s a clear difference in ability, it’s useless to resist. A wise decision.</p><br/><p>With my hands, I crush Myulan’s temporary heart, and lift the curse, and then I create a new core.</p><br/><p>It’s something easy for me to do now.</p><br/><p>While she opened her eyes widely with a confused look, I speak to the motionless Myuran.</p><br/><p>「It was fortunate, there is a possibility that Shion and the others can be revived.</p><br/><p>If I haven’t heard about the stories, you would be dead by now.」</p><br/><p>「Eh?」</p><br/><p>「She, still... alive?」</p><br/><p>「!?」</p><br/><p>I ignore the reactions from those 3 people.</p><br/><p>「This is your last chance. So, use it well.」</p><br/><p>I speak.</p><br/><p>Yes, I won’t forgive another failure.</p><br/><p>「Myuran, with this you are now free.</p><br/><p>Be good to Youmu. From now on, go where you want to go and do what you want to do.</p><br/><p>But, before that please tell me everything you know about that damn bastard Clayman.」</p><br/><p>Myuran nods to my request.</p><br/><p>And so, I learned many information about Clayman.</p><br/><p> ………</p><br/><p> ……</p><br/><p> …</p><br/><p>So in conclusion, it is Clayman who instigated Gelmudo to manipulate the Orc Lord’s rampage incident?</p><br/><p>To that question, Myulan silently nods.</p><br/><p>Hearing this, Benimaru and Hakurou fold their hand with a glum look on their face.</p><br/><p>That person, I decided in my heart that I will personally murder him.</p><br/><p>Manipulating people and bringing conflicts.</p><br/><p>Not only that, this time he also caused our city to be swallowed up in this great misfortune.</p><br/><p>Forgive him? Like Hell I will!</p><br/><p>I had heard enough information, now is to ask her what she want for her future.</p><br/><p>「Well... even though I finally got a taste of my long awaited freedom, I think it is fine to be tied again for the short period of a human lifetime~」</p><br/><p>So that is her answer.</p><br/><p>Youmu face turns red.</p><br/><p>There is not much that I can do in this situation, but giving them my blessing.</p><br/><p>「I see. By the way, Youmu. I have something to ask you for....」</p><br/><p>「It’s my pleasure. If it is what Danna wish for, I will do anything.」</p><br/><p>Good.</p><br/><p>I knew he would say that.</p><br/><p>It’s like what I planned, just like helping Myulan.</p><br/><p>I didn’t had any plan like this before, but now I won’t permit any failure.</p><br/><p>「You, please become a king」</p><br/><p>I said it like it was a petty thing.</p><br/><p>Wha? Youmu looks at my face.</p><br/><p>I then explain my idea to everyone.</p><br/><p>Basically, this time everyone who attacks us will be eradicated.</p><br/><p>This point is not negotiable anymore.</p><br/><p>Then the next problem is the Falmas Kingdom.</p><br/><p>Shall I massacre every citizen in there? So it’s like that, but there is no reason to do such thing.</p><br/><p>If the sacrifice (souls) numbers isn’t sufficient to fulfill the requirement to evolve into Demon Lord, I would, without any second thoughts massacre them all, but fortunately it seems that the number of people who are going to attack are sufficient.</p><br/><p>From the information Youmu had, the number of troops exceeds 10.000.</p><br/><p>It was really helpful, this is what I really think. It’s weird that I would say it was helpful for the enemy to have a large numbers.</p><br/><p>Because the requirement is to kill, it is something that I can easily do right now.</p><br/><p>So after annihilating the army, what will I do next after becoming a Demon Lord?</p><br/><p>This is the problem.</p><br/><p>Even if I kill everyone who dares to attack, if it possible I want to held a cease fire agreement.</p><br/><p>But after I kill everyone in the upper echelon of the government. Who will be the responsible party for such agreement?</p><br/><p>Not only that, if the central government is empty, the citizens will surely become concerned.</p><br/><p>「So? That is when your role come into the stage.」</p><br/><p>How’s that? Youmu is thinking.</p><br/><p>Youmu’s role is to purge all the corrupt officials.</p><br/><p>Thought I will kill every bastard that comes into my sight, I want someone to depend on to cleanse all the remaining trashes that still remain in the country.</p><br/><p>At the same time, calming the citizens, and to be crowned as the new king.</p><br/><p>It’s for the sake of establishing diplomatic ties between our countries.</p><br/><p>「Don’t say it so lightly... Me? Become a king?」</p><br/><p>「Isn’t it easy? Even I become a King. So you can also become one too.」</p><br/><p>Well, even if I become a king, it’s more like a Demon King.</p><br/><p>「Youmu, Rimuru-sama think if it’s you then you can do it.</p><br/><p>I also will, in the stormy days or in the sunny days, I promise to always be there to support you.」</p><br/><p>Those words of Myulan acts as his support.</p><br/><p>Now with heartfelt resolution, Youmu nods to me.</p><br/><p>Those two, they are really affectionate to each other.</p><br/><p>We shake hands.</p><br/><p>The preparatory meeting had completely ended with every detail pointed out.</p><br/><p>Now about whether I become a Demon Lord or not.</p><br/><p>About, whether Shion and others can be revived or not.</p><br/><p>Someone who lost their life cannot return ever again.</p><br/><p>However, Shion and the others haven’t been lost yet.</p><br/><p>So there is a possibility.</p><br/><p>I am an atheist. I don’t believe in any gods. But, now I decide to hold a prayer.</p><br/><p>To the one who governs all miracles.</p><br/><p>If it was Hinata, in this situation, she might choose to ignore such a useless act.</p><br/><p>It might really be useless.</p><br/><p>But if I sincerely believe when I pray,</p><br/><p>Shion and the others will surely be okay.</p><br/><p>The moonlight's reflection, which basks me with those small lights.</p><br/><p>And those lights, seems to gently affirm my prayer.</p><br/><p>-----------------------------------------------------------------</p><br/><p>TL: thanks to Valadilene who help on correcting the tenses and other mistakes. ^_^</p><br/>\n</div>"}