{"title": "Chapter 77 – Ramiris’ Report", "id": 77, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-77-%E2%80%93-ramiris%E2%80%99-report", "volume_title": "Volume 1", "body": "<h1>Chapter 77 – Ramiris’ Report</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner (Cast: Doctor Oda and Clown)</p><br/><p>Oda: Clown, how are you feeling?</p><br/><p>Clown: Doctor, what is my name?</p><br/><p>Oda: I can’t tell you. You have to remember yourself. Otherwise, there would be no meaning to this.</p><br/><p>Clown: Why did Aiko commit suicide?</p><br/><p>Oda: You remembered that? What else?</p><br/><p>Clown: Just that… why, doctor, why?</p><br/><p>Oda: … It was a truly unfortunate incident… but don’t worry about it, you’ll only stress yourself out.</p><br/><p>Clown: What should I be doing?</p><br/><p>Oda: Laugh. Cry. Think. But don’t bother trying to remember. It will only hurt you. Rather, forget. Forget and start again from the beginning.</p><br/><p>Clown: Start from the beginning?</p><br/><p>Oda: Yes, let’s start anew…</p><br/><p>Clown: Start anew… By the way, doc! Have you heard this story? During a funeral, the pallbearers accidentally bump into a wall and hear a faint moan. They open the casket and find out that the woman is actually alive. She lives for 10 more years and then dies. There is another funeral for her. At the end of the service, the pallbearers carry out the casket. As they are walking out, the husband cries out, “Watch out for the wall!”</p><br/><p>Oda: Let me prescribe you something new…</p><br/><p>.</p><br/><p>.</p><br/><p>Birth of a Demon Lord</p><br/><p>077. Ramiris’ Report</p><br/><p>Suddenly barged in exclaiming something…</p><br/><p>W-what did you say!!! … should have I respond thus?</p><br/><p>Ramiris is running pointing at me.</p><br/><p>Behind her, Beretta is politely closing the door.</p><br/><p>I somehow felt the need to praise his efforts.</p><br/><p>And running at me, I felt that Ramiris was brandishing something.</p><br/><p>Suddenly, a being, Diablo, dressed in fine clothes blocked her way.</p><br/><p>He had been quietly observing the conference from the end of the table until now, but he could not have permitted the intruder to act as they pleased.</p><br/><p>How should I say this? Ramiris was quickly restrained.</p><br/><p>While struggling to get free,</p><br/><p>「W-wait! What are you doing!!!」</p><br/><p>She said.</p><br/><p>What a pleasant person. Though I don’t feel a shred of a demon lord’s dignity from her, she is nonetheless a pleasant person.</p><br/><p>「Rimuru-sama, I have restrained a suspicious individual. How should I proceed?</p><br/><p>She was screaming some foolishness regarding the city’s demise. Should I dispose of her?」</p><br/><p>Diablo came up to me and politely asked.</p><br/><p>「Geeeeh! I can’t run away even using all my power?!</p><br/><p>T-this guy! He’s no small fry, is he?</p><br/><p>What, I ask: what is going on! What did I do?!」</p><br/><p>As always, she’s damn noisy.</p><br/><p>Frankly, for her to run away from Diablo, who has twice as much magic power as she, is nigh on impossible.</p><br/><p>So this is a demon lord, huh?</p><br/><p>Somehow, the reason I think demon lords are small fry may be completely her fault.</p><br/><p>「Rimuru-sama, are you this fairy’s acquaintance?」</p><br/><p>Fuze asked.</p><br/><p>Aaah, the conference came to a halt again. Couldn’t she have barged in a bit later?</p><br/><p>Her inability to read the mood hasn’t changed in the slightest.</p><br/><p>「Yeah, the fairy Ramiris is indeed my acquaintance.</p><br/><p>She’s also one of the demon lords kind, sort of…? Or at least claims to be…」</p><br/><p>「Hey! What do you mean “claims to be”!</p><br/><p>I am feared as the strongest among the ten great demon lords!</p><br/><p>The great Ramiris of the Labyrinth is none other than me!」</p><br/><p>She proudly exclaimed from within Diablo’s restraints.</p><br/><p>It seems that she is completely oblivious to her completely lack of a presence.</p><br/><p>「Huh? A demon lord…?」</p><br/><p>「Heeh, this thing?」</p><br/><p>The gathered replied, completely in line with my predictions.</p><br/><p>「Eh?</p><br/><p>…Ehhhh?</p><br/><p>What? Shouldn’t you be more surprised?</p><br/><p>I’m a demon lord, you know! What’s with that bored glance?」</p><br/><p>No no.</p><br/><p>Even if you claim to be one, you have been captured.</p><br/><p>Maybe they are all just relaxed as a result?</p><br/><p>Is what I thought, but</p><br/><p>「Nah… I mean, Rimuru-dono is a demon lord as well so I expected him to have a few demon lord acquaintances…」</p><br/><p>「At this point, after being scared half to death by Veldora’s rebirth, these mundane declarations can hardly surprise me…」</p><br/><p>They are looking at each other and nodding.</p><br/><p>I see, now that I think about it, that makes sense.</p><br/><p>In contrast to them,</p><br/><p>「Haaah? Veldora’s rebirth?</p><br/><p>Aren’t you all loony!</p><br/><p>Veldora’s a small fry that I could have handled with a single punch!</p><br/><p>Hardly a guy to discuss. Well, his era is now over, you see.</p><br/><p>If you must fear somebody, fear me instead!」</p><br/><p>She said while laughing loudly.</p><br/><p>If anything, talking would be her strong point.</p><br/><p>So I had her released and brought to Veldora’s place.</p><br/><p>「Sorry Veldora, but could you fight her for a bit?</p><br/><p>She is a demon lord, so she won’t die from your aura」</p><br/><p>「Hmm? Sorry, I’m currently busy solving a great mystery」</p><br/><p>「Ah, the culprit is Yasu. Solved, right?</p><br/><p>So I leave her with you」</p><br/><p>I left these parting words and returned to my seat.</p><br/><p>Veldora opened his eyes wide, making a shocked face that screamed『Eh? Why did you have to spoil who the culprit is!』.</p><br/><p>As for Ramiris, upon seeing Veldora, she immediately fainted… and silence returned to the room.</p><br/><p>Having shut both of the trouble children up, we decided to conclude the conference there.</p><br/><p>…………</p><br/><p>……</p><br/><p>…</p><br/><p>In the end, we decided to release the King and have Marquis Myula and Count Herman seek liability.</p><br/><p>And we’ll have Youmu jump on the opportunity.</p><br/><p>The Dwarf Kingdom, as a result of our recent victory, has declared the intent to form diplomatic relations with us.</p><br/><p>Sorcerer’s Dynasty Sarion has also decided to openly recognize Tempest as a sovereign state.</p><br/><p>And, once we build a highway leading to it, they will also pursue diplomacy with us.</p><br/><p>These two countries are not influenced by the Western Saint’s Church, so they can openly do so.</p><br/><p>Thus, Brumund Kingdom is the only remaining problem.</p><br/><p>「It’d be great if we could say farewell to the church.</p><br/><p>But I doubt the Council will silently accept this…」</p><br/><p>And that’s what causing the most pain.</p><br/><p>But, no matter which they choose, they’ll get caught up in a conflict.</p><br/><p>「I’ll somehow persuade the top brass. When I do, we’ll also seek diplomatic relations with you.</p><br/><p>You would accept it, right?」</p><br/><p>He stressed the point.</p><br/><p>Of course we would, though.</p><br/><p>Even from the perspective of profit-and-loss alone, Tempest a country recognized by two of the strongest nations–Military State Dwargon and Sorcerer’s Dynasty Sarion.</p><br/><p>So surely they would be overjoyed at the chance of establishing diplomacy with us.</p><br/><p>But, if compared to sticking with all the Council member states, it’s unclear which way the scales will tip.</p><br/><p>I know the answer.</p><br/><p>At the moment, sticking with the Council will be more profitable.</p><br/><p>However, within ten year, we shall be at least their equal; and, after twenty, we shall leave them in the dust.</p><br/><p>Such is the definitive prediction made by Raphael by analyzing the available data.</p><br/><p>But I will not tell them this</p><br/><p>They must choose for themselves, you see.</p><br/><p>Thus, our current problem is the Western Saint’s Church.</p><br/><p>We predict an inevitable clash with not only the Western Saint’s Church but also the Holy Kingdom Ruberium.</p><br/><p>And that’s a big problem.</p><br/><p>I mean, we need to win and display our usefulness and cooperation.</p><br/><p>So it’s not like these problems will be easily resolved.</p><br/><p>Right now, everything depends on our actions.</p><br/><p>Thus ended the conference of various states with various expectations.</p><br/><p>This sudden meeting shall go down in history as an important turning point.</p><br/><p>Of course, we could not have known that at the time.</p><br/><p>＊ ＊ ＊</p><br/><p>In the middle of tidying up after the conference,</p><br/><p>I got the feeling that I was forgetting something…</p><br/><p>「Ah, you! What is this, what the hell is this all about!」</p><br/><p>Something noisy came.</p><br/><p>I remembered. She had come over.</p><br/><p>Her face full of tears, clearly seeking respite.</p><br/><p>It can’t be helped.</p><br/><p>She fainted from seeing Veldora, and upon awakening was guided into the world of manga; so, without even noticing that the conference had come to an end, she’s been hitting it off with Veldora the whole time.</p><br/><p>Noticing that everybody was moving around, she remembered her original objective in a panic.</p><br/><p>She is a very carefree individual, so I don’t expect anything important to come from her lips anyways.</p><br/><p>But, upon hearing her words, the foreigner guests stopped their departure preparations.</p><br/><p>And remembering the existence known as Ramiris, they again returned to their seats.</p><br/><p>Pleased with the sight, she arched her back emphasizing her pitiful chest.</p><br/><p>And,</p><br/><p>「I’ll say it again! The Tempest Country shall fall!!!」</p><br/><p>She declared.</p><br/><p>「W-what did you say!!!?」 (Read in monotone)</p><br/><p>I ask as a kind of aizuchi.</p><br/><p>「Fufun！Well, it’s not like I wish for such an outcome.</p><br/><p>So, be grateful that I have come all the way to deliver this report!」</p><br/><p>Her words have become very condescending.</p><br/><p>Playing along will only prolong this, so let’s get to the point.</p><br/><p>「So, why will we fall?」</p><br/><p>She turned serious upon hearing these words and looked over the gathered officials once.</p><br/><p>And after a little thought,</p><br/><p>「Well, it’s not like this doesn’t concern humans, so okay. Listen up.</p><br/><p>By Demon Lord Clayman’s proposal, the demon lords shall hold the Walpurgis Banquet.</p><br/><p>Supporting him are Demon Lords Frey and Milim.</p><br/><p>As it was proposed by three demon lords, it has been accepted.</p><br/><p>An invitation has reached me as well.</p><br/><p>The discussion at the banquet is『Avenging the murder of Demon Lord Karion』</p><br/><p>And…</p><br/><p>The culprit has been named as『The presumptuous idiot who called themselves a demon lord–Rimuru』</p><br/><p>Did you… by any chance call yourself one?」</p><br/><p>She asked with a serious face completely benefiting the aloof Ramiris.</p><br/><p>The gathered trembled at her words. Seems like it was a serious matter after all.</p><br/><p>By the way, who’s demon lord Karion? I don’t remember fighting him, though?</p><br/><p>「It is true that I have called myself a Demon Lord, but I don’t know anything about Demon Lord Karion’s murder…」</p><br/><p>「Wait a minute!!! Is it true that Karion-sama has been murdered?!」</p><br/><p>Interrupting my words, Grucius barged into the conversation.</p><br/><p>Hmm? Could he be Karion’s subordinate?</p><br/><p>「Demon Lord Ramiris, please answer me. Has Karion-sama truly fallen?」</p><br/><p>「W-wait a second! Can you please not barge in while people are talking?!</p><br/><p>But, whatever.</p><br/><p>It does seem that Rimuru did not kill him, so there’s some evil ploy unfolding here.</p><br/><p>‘Tis time for the great detective Ramiris, right?</p><br/><p>At this point, the one who announced it is the most suspicious!</p><br/><p>In other words… the culprit is Demon Lord Clayman!」</p><br/><p>Completely ignoring Grucius’ words, she jumped straight to the conclusion.</p><br/><p>However, though it pains me to no end, her conclusion is affirmed by Wisdom King Raphael.</p><br/><p>As for her, she’s just reciting the line she read from a manga a second ago.</p><br/><p>「Hey, I also agree with that hypothesis, but please answer Grucius question.</p><br/><p>Has Demon Lord Karion truly been defeated?」</p><br/><p>The gathered fell silent, awaiting her response.</p><br/><p>For these large countries, it’s a big deal if a demon lord gets defeated.</p><br/><p>It signifies the loss of balance among the demon lords.</p><br/><p>But Ramiris is unconcerned with such matters.</p><br/><p>Without a care,</p><br/><p>「Huh? I don’t know. That’s the contents of the invitation sent to me?」</p><br/><p>She nonchalantly replied.</p><br/><p>She’s a kid after all. Though I guess it’s good enough that she bothered to come to let us know.</p><br/><p>「So, for what purpose did you let us know this?」</p><br/><p>「Hmm? Oh, the thing is, I was worried thinking what would happen to Beretta if you died?</p><br/><p>So, deciding to become your ally, I came over.</p><br/><p>Which is why I’ll create an entrance to my labyrinth here, okay?」</p><br/><p>「Hey, why are you discussing it all at once! What do you mean an entrance to your labyrinth?</p><br/><p>I’m grateful for the warning, but this is a separate matter!</p><br/><p>And aren’t you treating Beretta like your own thing already?」</p><br/><p>「Eeeehhhh… isn’t it fine? Don’t worry about the small things!</p><br/><p>More importantly, Beretta wanted to say hi. Heeey, come over here!」</p><br/><p>Without listening to others at all, she just says whatever she feels like saying.</p><br/><p>Feels like the conversation came to a close.</p><br/><p>What a ridiculously free-willed individual she is!</p><br/><p>…………</p><br/><p>……</p><br/><p>…</p><br/><p>Anyways, we decided to disperse.</p><br/><p>Not like we’d get any more information out of Ramiris anyways.</p><br/><p>Promising to let our guests know should any new information arrive, they left satisfied.</p><br/><p>And, the conference being over, we made preparations for their leave.</p><br/><p>Well, for the Dwarf Kingdom, we only had to cut the connection, though.</p><br/><p>As for Fuze, he’ll rest a day here and then return to Brumund.</p><br/><p>Duke Elalude wanted to talk with his daughter more, so he’ll be spending a few days.</p><br/><p>It was truly an impromptu conference, but many important individuals gathered.</p><br/><p>And though we had a selfish fairy barge in on us, I judged the conference a fruitful one.</p><br/><p>Thus our impromptu conference came to a close.</p><br/><p>＊ ＊ ＊</p><br/><p>Now then, after switching rooms, I had gathered the Departments.</p><br/><p>Along with Youmu, Myulan, and Grucius.</p><br/><p>Though we are using the small conference room, we were all able to find a seat.</p><br/><p>According to what Fuze has gathered, Walpurgis Banquest is a night where all the demon lords gather.</p><br/><p>Three voices are need to schedule it, a gathering of truly powerful individuals.</p><br/><p>Absentees have to be prepared to face severe consequences, as this is a covenant established between all the selfish demon lords.</p><br/><p>In the first place, these happen really rarely and are hardly mentioned in human literature.</p><br/><p>But still, the name “Walpurgis Banquet” is typically associated with the beginning of a Great Holy Magic War.</p><br/><p>The last one being over a thousand years ago and resulted in myriad casualties and great calamities.</p><br/><p>Thus, it is commonly known as the banquet that brings chaos and destruction into the lands.</p><br/><p>「Their current target is Rimuru-dana, so you best be prepared.</p><br/><p>Worst case scenario, you will have eight demon lords as enemies.</p><br/><p>That’s if we trust Demon Lord Ramiris’ words, that is…」</p><br/><p>Fuze said, worrying for me.</p><br/><p>“Well, I’ll do something about it” I said to reassure him.</p><br/><p>Being hunted by demon lords, though… cut me some slack.</p><br/><p>Thus, I decided to hold a counter-measures meeting.</p><br/><p>「Now then, I understand that it feels like we are continuing the conference indefinitely, but please bear with me.</p><br/><p>We are currently gathered here regarding『Demon Lord’s Walpurgis Banquet』</p><br/><p>According to Ramiris’ report, I am their target.</p><br/><p>What do you think we should do?」</p><br/><p>Anyways, I’ll ask for their opinion first as I always do.</p><br/><p>“Yes!” Shion excitedly raised her hand.</p><br/><p>When I point at her,</p><br/><p>「How about we cut down all the demon lords?」</p><br/><p>Calling on an idiot… my bad.</p><br/><p>I felt a blood vessel pop on my head. Hadn’t something like this happened before…</p><br/><p>「Shion, how would you cut them down? Do you have a realistic opinion?」</p><br/><p>She hung her head in shame upon hearing my words.</p><br/><p>「However, it seems strange that Demon Lord Milim had supported the notion.</p><br/><p>Smells suspicious if you ask me」</p><br/><p>Souei pointed out.</p><br/><p>I also thought the same.</p><br/><p>「Right. I can’t imagine Milim-sama betraying Rimuru-sama.</p><br/><p>It’s baseless intuition. But I trust my intuition.」</p><br/><p>Benimaru said.</p><br/><p>I see, though he has no proof, huh?</p><br/><p>The thing is, I don’t feel that I was betrayed by Milim.</p><br/><p>Wisdom King Raphael too, though he has little data regarding this, mentioned that unless there was some great change, such an outcome is impossible.</p><br/><p>I decided to believe in Milim.</p><br/><p>「Kufufufufu. Well, if it comes down to fight against all the demon lords, let’s just crush them.</p><br/><p>Frankly, Demon Lord Rimuru-sama alone will be enough!」</p><br/><p>Shion nodded, happy that someone else agreed with her.</p><br/><p>「Exactly! Isn’t it wonderful to be a newcomer.</p><br/><p>He took the words right out of my mouth!」</p><br/><p>The all nodded.</p><br/><p>Why has it come to this?</p><br/><p>By the looks of it, more than half are in complete agreement with Veldora.</p><br/><p>The Let’s be Careful Party is composed of Gabil and Gerudo only?</p><br/><p>Everyone’s raring to go; bloodlust has filled the room.</p><br/><p>Suddenly, the meeting was dominated by the War Party.</p><br/><p>「Wait a second, relax.</p><br/><p>Anyways. We have all agreed that Milim could not have betrayed me.</p><br/><p>So, something must have happened.</p><br/><p>As Ramiris mentioned earlier, the culprit might just be Clayman.</p><br/><p>So we should think upon what has occurred」</p><br/><p>I was successful at diverting the conversation from its dangerous course.</p><br/><p>Let’s get to the main point.</p><br/><p>「Right? Right?</p><br/><p>Great Detective Ramiris’ intuition was spot on!</p><br/><p>In that case, shouldn’t we just blow Clayman away?」</p><br/><p>「I see. That makes sense.</p><br/><p>Alright, I’ll go and cut that guy down…」</p><br/><p>「Hey, wait, wait! Relax a bit, Shion.</p><br/><p>Stop getting ready to go… Benimaru and Souei, you too!」</p><br/><p>Seriously.</p><br/><p>This is not going in the direction I wanted it to.</p><br/><p>And Ramiris is getting carried away as well.</p><br/><p>「By the way, why? Why do you have so many powerful devils lying around here?!</p><br/><p>At this point, isn’t it fine for me to have Beretta!」</p><br/><p>She continued.</p><br/><p>What a troubling person. She just doesn’t give up.</p><br/><p>And, noticing that my comrades are strong, she’s getting carried away herself.</p><br/><p>Her selfishness knows no bound!</p><br/><p>「Would it be fine? I do not believe Karion-sama has fallen.</p><br/><p>But, would you be willing to bring me to this Walpurgis Banquet?」</p><br/><p>Grucius said.</p><br/><p>Hmph. I might.</p><br/><p>「Only the demon lord and two to three escorts can attend the banquet.</p><br/><p>Individuals not involved in the banquet would be killed, you know?」</p><br/><p>Ramiris responded.</p><br/><p>On that note, I thought up something I wanted to ask,</p><br/><p>「Hey, can you let them know that I will be participating?」</p><br/><p>Everyone’s eyes focused on me.</p><br/><p>I mean, if I’m being hunted, I might as well go and meet them myself.</p><br/><p>This might also serve as a good test for the new barrier; and, worst comes to worst, I have the confidence to run away.</p><br/><p>So rather than prowling the shadows, doesn’t attacking them head on sound more fun?</p><br/><p>More importantly. I will never again let this city suffer a casualty.</p><br/><p>If you’re planning on attacking my friends, you have got to be prepared for my response.</p><br/><p>Aaah. Seems like I’ve turned into a muscle-for-brains as well.</p><br/><p>「Kuahahaha! He’s raring to go! Very well, I shall also go!</p><br/><p>With me attending, the Demon Lords shall know bottomless fear!」</p><br/><p>「Yes! If master Vel-chan is going, I too will be safe!</p><br/><p>With Beretta as well, my defenses are perfect!」</p><br/><p>「…No? I’m not planning on protecting you at all though?」</p><br/><p>「Ueee?! That’s so… cold… master Vel-chan!」</p><br/><p>「And what’s with this “master” thing…」</p><br/><p>I don’t know when, but they have become manga buddies.</p><br/><p>Being friends is good and all, but that feeling doesn’t seem to be reciprocated.</p><br/><p>Thus, via a dedicated demon lord channel, Ramiris let them know that I will be participating in the banquet.</p><br/><p>What a pointlessly high level skill–it allows communication via space manipulation.</p><br/><p>While she is busy with that, Beretta came up to greet me.</p><br/><p>「I congratulate you on becoming a demon lord.</p><br/><p>I too have received a blessing thanks to your evolution, and wish to say thanks.</p><br/><p>As a result, I have evolved from an Arc Doll into a Chaos Doll.」</p><br/><p>He said, deeply bowing.</p><br/><p>He acquired unique skill『Saint Demon Union』</p><br/><p>As a result, he nullifies essentially all physical or magical attacks, and, by combining demonic and saint powers, he evolved into a Chaos doll.</p><br/><p>So, for example, while the arc doll could not have moved in the Holy Barrier I was trapped in, he now evolved beyond it.</p><br/><p>New spirit cores awakened within his body, and by mixing with the magic ones, they became Saint Demon ones.</p><br/><p>I really want to study him, but it’s not the time for that now.</p><br/><p>「O-oh. As long as you’re healthy.</p><br/><p>Once this incident ends, let’s talk a bit?」</p><br/><p>「Ay! Your words are wasted on someone like me. I am looking forward to such a time.」</p><br/><p>「Yeah. I’m also happy that you’re listening to what Ramiris is saying.</p><br/><p>Well, as long as you ignore any unreasonable orders.</p><br/><p>If anything happens during the Walpurgis Banquet, I’m counting on you.」</p><br/><p>「Leave it to me. I will live up to your expectations!」</p><br/><p>After such an exchange, Beretta sat down.</p><br/><p>Since Ramiris had only one subordinate, Grucius came along with her.</p><br/><p>Myulan also wanted to settle her grudge, but Youmu stopped her.</p><br/><p>Well, her battle power is a little lacking.</p><br/><p>So Beretta and Grucius will attend along with Ramiris.</p><br/><p>While I was talking with Beretta, Shion was looking at me with a pained expression.</p><br/><p>She’s bound to rampage if I don’t bring her.</p><br/><p>So, I decided on Shion as one of my escorts.</p><br/><p>And, calling Ranga from within my shadow…</p><br/><p>「I hope you would choose me. I will not lose to the likes of some demon lords!」</p><br/><p>How reliable.</p><br/><p>So it’s decided.</p><br/><p>Benimaru and Souei are disappointed, but they’ll just have to get over it.</p><br/><p>There’s also the job of ensuring this city’s defense.</p><br/><p>Along with Gabil and Gerudo, we have a solid defense system.</p><br/><p>On a one in a million chance the Church sends a subjugation team, I had Diablo observe the region.</p><br/><p>Destroying Templar’s in order to bring down the Holy Barrier takes priority, after all.</p><br/><p>So maybe I should leave Souei on guard duty as well.</p><br/><p>While waiting for Ramiris’ response, we are busy doing menial tasks.</p><br/><p>In the end, my participation was recognized.</p><br/><p>The demon lords may have just thought it inconvenient to have to go all the way out here to attack.</p><br/><p>But, this presents a wonderful opportunity.</p><br/><p>I now have acquired the right to participate in Walpurgis Banquet.</p><br/><p>The demon lords I am fated to meet–Leon Cromwell and Clayman.</p><br/><p>But this time, my target is Clayman.</p><br/><p>I have not forgotten the Orc Lord incident.</p><br/><p>There’s also Myulan’s case.</p><br/><p>And more importantly, I worry about Milim.</p><br/><p>Say your prayers.</p><br/><p>You made me your enemy.</p><br/><p>I am not so naive as to forgive my enemies.</p><br/><p>…As long as you’re not a beautiful girl…</p><br/>\n</div>"}