{"title": "Chapter 81 – At the Banquet", "id": 81, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-81-%E2%80%93-at-the-banquet", "volume_title": "Volume 1", "body": "<h1>Chapter 81 – At the Banquet</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner (Cast: Clown and Staff)</p><br/><p>Clown: Thank you for all your help.</p><br/><p>Staff: Huh? Oh, well… I guess.</p><br/><p>Clown: No, really, I’ve been recovering thanks to your support.</p><br/><p>Staff: Not seeing any delusions any more?</p><br/><p>Clown: Nope. Ready to start a brand new life.</p><br/><p>Staff: I see… want to hear a joke?</p><br/><p>Clown: Sure?</p><br/><p>Staff: 20 years ago we had Johnny Cash, Bob Hope, and Steve Jobs. Now we have no cash, no hope, and no jobs.</p><br/><p>Clown: Haha…</p><br/><p>Staff: By the way, I’m not really supposed to do this, but you have a message. From some detective. Here, I’ll leave it with you. Let me know if you need anything.</p><br/><p>Clown: Oh? I wonder what does it say…</p><br/><p>–Do not trust doctor Oda. Your sister did not commit suicide. Remember!</p><br/><p>.</p><br/><p>.</p><br/><p>Birth of a Demon Lord</p><br/><p>081. At the Banquet</p><br/><p>Clayman felt himself to be triumphant.</p><br/><p>The old generation which looked down on him now looked with utter surprise.</p><br/><p>From only hitting one arrogant brat.</p><br/><p>So when these stubborn geezers would fall prostrate before him, then he could finally create a world for monsters.</p><br/><p>So Clayman thought in his heart of hearts.</p><br/><p>But… was this fine?</p><br/><p>This question came to mind.</p><br/><p>That honorable person had mentioned not to stand out, but here he was at the center of attention.</p><br/><p>This thought, Clayman quickly dismissed.</p><br/><p>It’s alright. Recommending a subjugation was a matter of persuasive power, after all.</p><br/><p>Besides, by showing Milim as his follower surely he would dissuade them from opposing him.</p><br/><p>What demon lord would oppose the strongest demon lord Milim?</p><br/><p>But is that actually the case?</p><br/><p>Did he go to far? Why is he feeling anxiety?</p><br/><p>Truly, there was no need to hit Milim.</p><br/><p>Moreover, thinking about the Walpurgis Banquet and the possibility of failing to garner the demon lords’ support made him truly uneasy…</p><br/><p>No, wait. Isn’t something off?</p><br/><p>Why were alarm bells going off in Clayman’s head?</p><br/><p>If the current plan failed, the following one would be jeopardized. And that was no good.</p><br/><p>He had to get advice from that honorable person…</p><br/><p>But he was currently forbidden from contacting that person.</p><br/><p>Besides, he still had the trump card called Milim.</p><br/><p>And, thank to his unique skill『Puppeteer』she was currently completely under his control.</p><br/><p>In front of her overwhelming power even that Karion was eliminated without offering a hint of resistance.</p><br/><p>And after calming his fears thus, a smile appeared on his face.</p><br/><p>「Now then, let me thank you all from the bottom of my heart for gathering upon my summons.</p><br/><p>Let’s begin my banquet.</p><br/><p>Thus I declare that the Walpurgis Banquet has begun!」</p><br/><p>As per his rights as the one who gathered them, Clayman declared the start of the banquet.</p><br/><p>And so, for the first time in many hundreds of years, begun the banquet attended by every demon lord.</p><br/><p>＊ ＊ ＊</p><br/><p>Guy was observing Clayman with a smirk on his face.</p><br/><p>He almost started laughing looking at this joke of a man, and was truly proud of himself for holding it back.</p><br/><p>Clayman is completely misunderstanding.</p><br/><p>Rather, he just doesn’t get it.</p><br/><p>Though they are called the ten great demon lords, that’s a name the humans selfishly decided for them and not one Guy recognizes.</p><br/><p>Whether there are ten or hundred matters little to him.</p><br/><p>But, the Holy Demon Great War 500 years ago left less than ten of them.</p><br/><p>And then, the new demon lords suddenly decided to fight for dominance and decided to keep the number at ten.</p><br/><p>The humans must have been overjoyed to hear that the number of dangerous beings would decrease.</p><br/><p>So this rule is more of an unspoken agreement, if anything.</p><br/><p>Guy is the first demon lord.</p><br/><p>He granted the wish of his powerless summoner and destroyed an enemy nation.</p><br/><p>As payment, he destroyed the summoner’s country.</p><br/><p>And with this, though it was unnecessary, he noticed his awakening as a true demon lord.</p><br/><p>The two Arch Demons he summoned to destroy the first country evolved into Demon Officials after destroying the latter one.</p><br/><p>And, he permitted them to continue serving him.</p><br/><p>There was another being who awakened as a demon lord at the same time as Guy.</p><br/><p>Milim.</p><br/><p>One of the four “dragons”, the first among them, created a child with a human.</p><br/><p>Interestingly enough, most of the “dragon’s” power was taken by this child.</p><br/><p>Thus, the “dragons” declared the making of children a taboo.</p><br/><p>The “dragon” who lost his power took on flesh, and became the founder of the dragon family.</p><br/><p>From then on, the mass of natural holy spirits came to be called the Dragon Race.</p><br/><p>Presently, the many dragons who inhabit the world can trace their roots to this founder</p><br/><p>The “Dragon Race”, Star King Dragon Veldanava.</p><br/><p>That dragon reincarnated as his daughter’s pet dragon and was killed by some country.</p><br/><p>Thus, these fools came to know the meaning of imperial wrath.</p><br/><p>In her anger, Milim destroyed the country.</p><br/><p>And awakened as a true demon lord.</p><br/><p>Unconscious, she fought with Guy.</p><br/><p>That battle continued for seven days and seven nights, transforming the bountiful lands in the west into a wasteland.</p><br/><p>Eventually, the battle concluded.</p><br/><p>Milim regained her consciousness and the battle ended.</p><br/><p>The one who returned her sanity was none other than Ramiris.</p><br/><p>In the process, the ruler of spirits Ramiris absorbed the evil magic of demons and the powerful aura of dragons and began to change.</p><br/><p>But, she was able to stop Milim’s rampage.</p><br/><p>And the three settled this dispute.</p><br/><p>These three were the first demon lords.</p><br/><p>The decided that each of the three would be different than the other two.</p><br/><p>One would pursue the ultimate power.</p><br/><p>One would live as one pleased.</p><br/><p>One would judge the world.</p><br/><p>And that was fine.</p><br/><p>Because their objectives were different, they could recognize each other.</p><br/><p>Later, the protectors of Heaven’s Gates the Giant, the ancient Vampire, and the being who fell from heaven itself increased their numbers to six.</p><br/><p>They were the second generation.</p><br/><p>Demon Lords inferior to the oldest.</p><br/><p>The Giant, due to holy power ingrained in his body, rejected the Demon Lord Seed.</p><br/><p>But, he had unbelievable power and was an amusing guy.</p><br/><p>Due to the many wars the demon lords started to eliminate the giants and the fairies, he awakened as a true demon lord.</p><br/><p>Even so, he has yet to acquire an Ultimate Skill–that Guy and Milim possess.</p><br/><p>But, he did see the chance for such awakening for the Vampire and the Fallen Angel.</p><br/><p>It was a matter of time. And Guy patiently waited for it.</p><br/><p>And, Clayman.</p><br/><p>That fool thought he could control Milim.</p><br/><p>It’s so impossible that it’s hilarious.</p><br/><p>There’s no way an insect like Clayman could do something that Guy never managed to do.</p><br/><p>Those who possess an ultimate skill are not affected by lower abilities.</p><br/><p>Every rule of the world is ultimately reduced to this unique level.</p><br/><p>In other words, they will not be affected by any form of magic–highest or not.</p><br/><p>And since ultimate skills do not require an incantation, merely wishing for something can produce results.</p><br/><p>A series of attacks of certain affinity could have an effect, though.</p><br/><p>Spiritual Attacks, however, are completely meaningless.</p><br/><p>A soul weak enough to be affected by such an attack could never acquire an ultimate skill.</p><br/><p>So to counter an ultimate skill you need another ultimate skill.</p><br/><p>Therefore, Clayman can do nothing to Milim.</p><br/><p>So right now, he’s dancing in the palm of her hand.</p><br/><p>What a fool.</p><br/><p>Thus with a smirk, Guy was awaiting the conclusion.</p><br/><p>What a fun banquet this could become, he thought.</p><br/><p>＊ ＊ ＊</p><br/><p>Clayman proudly began his explanation.</p><br/><p>So, according to human informants, I have killed Demon Lord Karion.</p><br/><p>Though to me, it’s more of a: who the hell is Karion?!</p><br/><p>I know that he’s something akin to a father to Grucius, but I had never met him.</p><br/><p>Oh and Clayman’s explanation is dragging on forever.</p><br/><p>Though I don’t need to sleep, I feel sleepy. Could this be a spiritual attack?</p><br/><p>In a word… annoying.</p><br/><p>Can’t he cut me some slack here.</p><br/><p>「Umm… can I ask a question?」</p><br/><p>When I asked, he looked over irritated and,</p><br/><p>「What?」</p><br/><p>He asked.</p><br/><p>「Nah, just… do demon lords fancy these kinds of pointless conversations?</p><br/><p>I mean… aren’t we more into… Power Rules and Talk with Our Fists type of thing?」</p><br/><p>I said, provokingly.</p><br/><p>At this line, a silver haired girl began to laugh.</p><br/><p>She had looked at me with anger until now, so was I able to diminish it a bit?</p><br/><p>Oh, and when she laughs, she looks very cute.</p><br/><p>「Clayman, it’s as he says.</p><br/><p>Your speech is tiresome. State your point」</p><br/><p>The girl told Clayman.</p><br/><p>Upon hearing these words, Clayman turned red in anger.</p><br/><p>He’s that simple? Or that much of a small fry?</p><br/><p>Though if this is an act, then he’s truly impressive</p><br/><p>「Ku… don’t underestimate me, you lowly slime!」</p><br/><p>「Eh? Is there something wrong with me being a slime?</p><br/><p>You know, I came over here not to listen to your shitty speech.</p><br/><p>Oh, and what were you trying to achieve by hitting Milim?</p><br/><p>I put up with it in the beginning of the conference, but isn’t it about time?</p><br/><p>Just say what you want to say; those will be your last words, anyways.」</p><br/><p>His face convulsed upon hearing my words.</p><br/><p>Rather than anger, I saw an ominous black aura float around him.</p><br/><p>As expected of a demon lord. It is intimidating. A tiny bit.</p><br/><p>And at that moment, the doll-like Milim, for a split second, looked as she wanted to fist pump me.</p><br/><p>Nah, I probably just imagined it.</p><br/><p>Seriously, how pitiful. I’ll free you soon, Milim.</p><br/><p>I swore in my heart.</p><br/><p>「Ku, everyone. Did you hear that?</p><br/><p>This lowest of all beings acquired the Demon Lord Seed by chance and after becoming a demon lord, behold how haughty he has become.</p><br/><p>Besides, they even began a war with the humans!</p><br/><p>I do not believe we can leave this being as is. I propose we purge him, what are your thoughts about it?」</p><br/><p>He waved his hands flamboyantly, trying to measure the demon lords’ response.</p><br/><p>But.</p><br/><p>「Hey, is taking control of one’s spirit during Walpurgis Banquet permitted?」</p><br/><p>I said, kicking the table into the air.</p><br/><p>The huge round table flew and crashed far behind him.</p><br/><p>Creating an opening in the middle.</p><br/><p>「Nay. At this place, overtaking your opponent with words alone is considered just」</p><br/><p>A red haired demon lord – the most dangerous looking one of them all – responded.</p><br/><p>Amused, he lightly laughed.</p><br/><p>I glanced at Shion, who immediately launched a barrage of attacks at at Clayman.</p><br/><p>Filling her fists with aura, she landed about thirty hits in a split second.</p><br/><p>And with a truly refreshed face,</p><br/><p>「Is this fine?」</p><br/><p>She asked.</p><br/><p>…</p><br/><p>Seriously, girl, shouldn’t you ask that before you hit someone?</p><br/><p>Besides, I only glanced at you for a second!</p><br/><p>True, I did want you to shut Clayman up…</p><br/><p>But I didn’t think you’d beat him up the very next moment.</p><br/><p>Well, what’s done is done.</p><br/><p>Besides, Wisdom King Raphael picked up the effect of some activity in play during his speech.</p><br/><p>I bet he was trying to set things up to his own convenience, but that plan I foiled.</p><br/><p>So when we shut Clayman up a second ago, that was a legitimate case of self-defense.</p><br/><p>So if there’s demon lords who get mad at me and decide to fight me, then nothing can be done about that.</p><br/><p>「Y-y-you… bastard!!!」</p><br/><p>The ominous black aura released by Clayman quickly regenerated his wounds.</p><br/><p>This ability far surpassed the one displayed by the Orc Lord.</p><br/><p>Well, that much should be expected from a demon lord.</p><br/><p>「Unforgivable…『Marionette Master』!」</p><br/><p>Clayman cried out taking out five dolls from within his cloak.</p><br/><p>Each doll transformed into a devil and attacked Shion.</p><br/><p>Each a high ranking devil.</p><br/><p>Chances are, that ability allows him to make dolls out of devils whose soul he stole.</p><br/><p>Wisdom King Raphael was able to analyze that skill with just a glance, and so explained.</p><br/><p>But, frankly… what of it? That’s what I want to say to him.</p><br/><p>As expected, with her herculean strength and her beloved sword, she cut the devils down.</p><br/><p>「Hahaha, aren’t you a little skilled! But, it’s no use.</p><br/><p>Marionette Dolls can immediately regenerate and continue to attack!」</p><br/><p>Clayman called out, while beginning his incantation.</p><br/><p>Shion just shrugged in response.</p><br/><p>And, the dolls did not move at all.</p><br/><p>「N-no way… why aren’t they being reborn?」</p><br/><p>Clayman cut the incantation short in a panic.</p><br/><p>I really want to tell him that instead of saying such pointless things, he should have continued his chant.</p><br/><p>「Yeeaaah. It’s a pain, so I’ll tell you.</p><br/><p>Shion’s odachi is a soul eater.</p><br/><p>Those dolls, of course, aren’t protected against attacks to their soul.</p><br/><p>So since they were so poorly made, they fell from a single hit」</p><br/><p>I explained as if it was the most natural thing in the world.</p><br/><p>I mean, since he’s become my grub in the end, I’ll teach him whatever he wants to know.</p><br/><p>There’s no reason to hide this much either.</p><br/><p>「A sword that hits the soul as well!?」</p><br/><p>「It’s not rare, right? The humans have these too?」</p><br/><p>「R-ridiculous! That’s a treasure sword, isn’t it!」</p><br/><p>「Hmph. I wouldn’t know. Cause we made it」</p><br/><p>Shion’s odachi I improved using Hinata’s sword as a reference.</p><br/><p>Though I did remove that foolish seven-hit feature. It eats the soul from a single strike.</p><br/><p>As a result, though it’s not a certain-kill weapon, it does do both physical and spiritual damage.</p><br/><p>So you need to be on your guard as otherwise you’ll be devoured.</p><br/><p>And if you don’t protect yourself against physical attacks, you’ll end up a bloody mess.</p><br/><p>「Huh. So this was “Hercules’ Edge Revised” huh!」</p><br/><p>Did you yourself not know…</p><br/><p>Haven’t I explained it on our way here? Ah, whatever… It’s Shion after all.</p><br/><p>At that moment Clayman stood up.</p><br/><p>He desperately completed his incantation and set off his spell.</p><br/><p>「I’ll add that impudent swords woman to my collection.</p><br/><p>Devour her, Demon Marionette!!!」</p><br/><p>That ominous light attacked not me, but Shion.</p><br/><p>And seeing this,</p><br/><p>「Kukukukuku. Be glad, it’s the ultimate incantation that can even control a demon lord!</p><br/><p>It’s shame to have someone like you as a devil, but whatever.</p><br/><p>Surely you are sick of serving a lowly slime?</p><br/><p>After all, for someone who had so much trouble killing a lowly Orc Lord, to die by their subordinate’s hand is a fitting end!</p><br/><p>After you dispose of your master, I’ll make you my pawn」</p><br/><p>He declared.</p><br/><p>Pointless. For a second I did want to say『Oh no! I’m doomed!』to get him riled up a bit, but this is too annoying.</p><br/><p>This guy… is too weak.</p><br/><p>He’s someone who’d be taken out by Hinata in a moment.</p><br/><p>No, rather than weak, maybe I’m just accustomed to seeing Benimaru, Souei, and other department members who are overly strong.</p><br/><p>By magic energy alone, he’s weaker than Shion.</p><br/><p>Besides… Shion has that skill『Perfect Memory』that preserves her memories even after death.</p><br/><p>In other words, she can exist as a soul alone.</p><br/><p>So Soul Control Archive abilities are completely ineffective. Moreover, spiritual attack damage is also largely ignored.</p><br/><p>In other words,</p><br/><p>「Yo, what kind of attack is this? I don’t feel pain or anything.</p><br/><p>How long are you planning to keep me waiting?」</p><br/><p>I could hear Shion’s slightly irritated voice coming from the darkness.</p><br/><p>Raphael had analyzed the effect and predicted that Shion would be unaffected; seems like he was correct.</p><br/><p>So even though he introduced this as some grand secret technique, this is all it amounted to.</p><br/><p>「T-this cannot be!!!</p><br/><p>A skill that even put Milim–demon lord Milim under my control cannot possibly have no effect on someone like you!!!」</p><br/><p>Shion blew away the aura.</p><br/><p>Seeing this, Clayman fell into a state of panic. The match has been decided.</p><br/><p>「Everyone, will you permit this one to continue her rampage?!</p><br/><p>They are looking down on all the demon lords. We must punish them at once!</p><br/><p>In fact, let’s remember the fate of poor Karion!」</p><br/><p>His eyes bloodshot, he sought support from the other demon lords.</p><br/><p>The moment I entered battle mode, a barrier was erected isolating the room.</p><br/><p>Well, I had expected this much when I kicked the table away.</p><br/><p>But what a troublesome guy he is.</p><br/><p>The moment he realizes he can’t win he runs to get help from others.</p><br/><p>Dagrule and Dino opened their mouths as if to say something.</p><br/><p>They are probably trying to come to my defense. It’s a good thing I spoke to them earlier.</p><br/><p>But at that moment,</p><br/><p>「Hey, hey. Who said that I kicked the bucket?</p><br/><p>And that’s the first time I’m meeting this monster named Rimuru?」</p><br/><p>A low, elegant voice resounded.</p><br/><p>From one of the subordinates of the winged woman who came in along with Clayman.</p><br/><p>He was wearing a cool mask, so I couldn’t see his face…</p><br/><p>But at that moment the mask fell off and a violent aura gushed forth.</p><br/><p>Haa!!!</p><br/><p>And transforming his clothing, before us appeared the Beast Demon Lord Karion.</p><br/><p>Like my “Anti-demon Mask”, his held back his aura.</p><br/><p>Had I paid attention I could have realized this ahead of time, but since I hadn’t met Karion before, I had no way to know.</p><br/><p>Um, so… what does this mean?</p><br/><p>「N-no way! Why are you alive!!!</p><br/><p>…</p><br/><p>If that…. You’ve betrayed me! Frey!!!」</p><br/><p>His eyes bloodshot, he shot the accusation at the winged woman.</p><br/><p>By the looks of it, rather than betraying him…</p><br/><p>「Ara? Since when had I become your ally?」</p><br/><p>She nonchalantly replied.</p><br/><p>Women are scary.</p><br/><p>「D-d-don’t screw with me! You wretch!!!</p><br/><p>Whatever. I got it. No forgiveness for any of you」</p><br/><p>Clayman quickly regained his composure.</p><br/><p>Does he have a trick up his sleeve?</p><br/><p>With a smirk on his face, Clayman loudly declared</p><br/><p>「Milim, slaughter everyone here!!!」</p><br/><p>The air tensed in the room, and everyone’s expressions froze.</p><br/><p>Most, like I, were in the middle of calmly preparing ourselves.</p><br/><p>And we all looked at Milim.</p><br/><p>His trump card.</p><br/><p>I was sure Milim was being controlled.</p><br/><p>And I guess she was…</p><br/><p>Well, this is certainly bad. Clayman is an insect at most, but Milim is dangerous.</p><br/><p>Even now, my chances are not so good. Even so, I want to save her.</p><br/><p>No, I will save her!</p><br/><p>I will release…</p><br/><p>The moment I thought so,</p><br/><p>「Why should I do such a thing? Rimuru is a friend you now?」</p><br/><p>Milim replied without a care.</p><br/><p>Ummm, eh? What???</p><br/><p>I wasn’t the only one confused.</p><br/><p>The demon lords as well had a face that said: “Eh? But she just took a hit from him a second ago!”</p><br/><p>What does this mean?</p><br/><p>Without any care for our confusion,</p><br/><p>「Hey, Frey! Did you take care of that thing for me?」</p><br/><p>「Yes, yes, this, right?</p><br/><p>But seriously… trying to fist pump people, grinning like an idiot…</p><br/><p>You can’t act at all. Well, I guess I should praise you for allowing those attacks.」</p><br/><p>「That was natural. Rimuru getting angry for my sake made me really happy.</p><br/><p>And if we weakened Clayman’s resolve a bit more, the truth would come out by itself!」</p><br/><p>While thus talking, Frey took something out from her bag and handed it to Milim.</p><br/><p>The dragon knuckles that I gifted her.</p><br/><p>Happily taking the knuckles, she immediately put them on. And a wide smile appeared on her face.</p><br/><p>「I had wanted to get a bit angrier, but this is fine. I hope you’ve said your prayers, Clayman!」</p><br/><p>She said, shooting a glance at him.</p><br/><p>So, in other words… they performed this script?</p><br/><p>The other demon lords have by now started to catch up to the event.</p><br/><p>As I thought.</p><br/><p>I thought.</p><br/><p>That’s just how it is.</p><br/><p>I thought I heard a voice say within me.</p><br/><p>But,</p><br/><p>「W-wait a second, Milim. Y-you weren’t being controlled by him?</p><br/><p>So you tortured me on a whim?</p><br/><p>And you blew away that holy mountain on your own free will?」</p><br/><p>Demon Lord Karion asked, with a vein popping on his head.</p><br/><p>「Hmm? Don’t sweat the small details!</p><br/><p>Come on, Clayman has been cornered. Let’s have him spill the beans!」</p><br/><p>「What small details! If you handled that poorly we’d all be dead!</p><br/><p>But whatever. Not like you’re listening anyways~」</p><br/><p>For some reason, I felt some pity.</p><br/><p>Seeing a crying Karion made me want to pet him.</p><br/><p>Everyone is quiet, probably deep in thought.</p><br/><p>Well, Grucius is happy, so I’m glad he’s alive.</p><br/><p>By the way…</p><br/><p>Milim played the part of a marionette to foil Clayman’s plans.</p><br/><p>Why did she do that? I thought for a second, but decided that Clayman comes first.</p><br/><p>We can solve that problem after we deal with him.</p><br/><p>The event is spiraling towards a conclusion.</p><br/><p>Only finishing touches left now.</p><br/>\n</div>"}