{"title": "Chapter 85 – The words that reached", "id": 85, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-85-%E2%80%93-the-words-that-reached", "volume_title": "Volume 1", "body": "<h1>Chapter 85 – The words that reached</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Saint Demon Confrontation Arc</p><br/><p>085. The words that reached</p><br/><p>Storm Dragon Veldora has been reborn.</p><br/><p>This report caused a great panic within the Western Saint’s Church.</p><br/><p>.</p><br/><p>The connection that was lost with the subjugation team was quickly discovered.</p><br/><p>They were strictly ordered to report at regular intervals, so a loss of connection indicated some misfortune.</p><br/><p>So upon hearing this report, Hinata immediately decided to set off to Tempest.</p><br/><p>But, at that moment came the surprising news of Storm Dragon Veldora’s revival.</p><br/><p>Which resulted in Hinata, who was preparing to set off, to be summoned by the Holy Empire Ruberion’s most influential officials.</p><br/><p>The Seven Celestial Sages these wisemen are called.</p><br/><p>It is said that each has transcended a hero-class existence and is a legendary being that is often in charge of rearing new heroes.</p><br/><p>These beings are completely secluded and never appear in public,</p><br/><p>And are only discussed as legends in fairy tales and other such stories.</p><br/><p>Nor are the Seven Celestial Sages an existence that Hinata could talk about.</p><br/><p>Obviously, they are not an existence that the Templar Knights would know about.</p><br/><p>So why does Hinata know of them…</p><br/><p>Because she is the last disciple of the Seven Celestial Sages.</p><br/><p>They typically train their successor personally, and no one knows when the successor takes over.</p><br/><p>In other words, the fact that they all trained one person is beyond unusual.</p><br/><p>Hinata was just that excellent.</p><br/><p>And because she was so excellent she was able to learn all the skills and battle abilities that they could teach her.</p><br/><p>In a sense, you could call her a work of art.</p><br/><p>Few people from the Holy Empire of Ruberion could order Hinata around.</p><br/><p>In other words, you could even say that all power was vested in her.</p><br/><p>After inheriting her post from her predecessor, she began her reign in the top echelons of the country.</p><br/><p>Who could order her?</p><br/><p>The current emperor and the Seven Celestial Sages.</p><br/><p>Furthermore, only the Seven Celestial Sages can directly meet with the emperor, so Hinata has never met him.</p><br/><p>Nor has she even heard this voice.</p><br/><p>Which is why, when discussing beings who can order her, only the Seven Celestial Sages remain.</p><br/><p>This time, she was summoned directly by them via telepathy.</p><br/><p>And she was told about Storm Dragon Veldora’s rebirth.</p><br/><p>Thus, though she had prepared troops to set off to Tempest, she decided to put that order on hold.</p><br/><p>As a result, her attack on Tempest while Rimuru was away did not occur.</p><br/><p>Which was fortunate.</p><br/><p>Had she attacked Tempest along with her Knights Templar while he was away, there’s a high chance the battle would have went in her favor.</p><br/><p>Anyways, Monsters’ Country Tempest narrowly escaped death.</p><br/><p>Was this a failure on Hinata’s part? By no means.</p><br/><p>What surprised her, that is, wasn’t only the report she received from the sages.</p><br/><p>As a messenger she sent to Tempest, Reihim, has returned.</p><br/><p>But his appearance was completely different. A thin layer of dirt and tattered clothing covered his body.</p><br/><p>His eyes darted, his body vehemently convulsed.</p><br/><p>He looked as if he tasted unimaginable fears.</p><br/><p>100 trusted Knight Templars guided Reihim into the main chamber.</p><br/><p>Cardinal Nicholas also came to hear his report.</p><br/><p>Reihim was brought into the chamber as he was. He was offered to change, but he adamantly refused.</p><br/><p>And, insisted that he had urgent information that had to be shared.</p><br/><p>Thus he stood in the main chamber, inside the towering cathedral in the center of the Holy Empire Ruberion.</p><br/><p>In all of the empire, this was the most holy and impregnable place.</p><br/><p>And there he knelt.</p><br/><p>Hesitantly, he lifted his face to confirm Hinata’s presence.</p><br/><p>He seemed a little relieved seeing her there. And then he stood, his expression quickly turning into even a deeper despair.</p><br/><p>Reihim removed the tattered clothing that covered his body.</p><br/><p>Seeing what was beneath, the Templar Knights covered their faces.</p><br/><p>Even Hinata looked repulsed.</p><br/><p>Everyone’s gaze was focused on Reihim’s exposed body.</p><br/><p>As a myriad of faces were protruding from it.</p><br/><p>Still alive, some showed anguished expressions, others of despair. There were even some mad ones smiling…</p><br/><p>As if mocking the holy land upon which he stood.</p><br/><p>「First… behold my body. It is the punishment for evoking their King’s wrath…</p><br/><p>I was a fool. A terrifying, a truly terrifying enemy I have made!</p><br/><p>A demon lord.</p><br/><p>By our hand we gave birth to a new demon lord!」</p><br/><p>Perhaps even proudly, Reihim declared in a loud voice, his eyes bloodshot.</p><br/><p>And thus he told them of the terrifying demon lord and his birth.</p><br/><p>Without concealing any of Reihim’s wrongdoings.</p><br/><p>He was not ordered to do so. Rather, he himself was obsessed to disclose all this.</p><br/><p>To free himself from the torment, to be forgiven by god.</p><br/><p>He thought he needed to confess his sins. But… surely he could not be forgiven with just this much…</p><br/><p>The templars trembled upon hearing of a new demon lord’s birth.</p><br/><p>And when they heard about his absurd power, they could no longer hide their astonishment.</p><br/><p>Before his light attack, every anti-demon barriers, large scale magic barriers, and even holy barriers are utterly foolish.</p><br/><p>And none have ever heard of such magic.</p><br/><p>If faced with an attack that cannot be blocked, even those gathered in the room could not survive it… perhaps.</p><br/><p>But Hinata did not tremble.</p><br/><p>Based on what Reihim reported, it was an attack that used the rays of the sun, she figured.</p><br/><p>And if you understand the nature of the attack, it’s easy to counter it.</p><br/><p>Seeing the stoic Hinata reassured the Templar Knights; thus, they calmed down.</p><br/><p>If their commander Sakaguchi Hinata did not fear the demon lord, then there was no chance they would be defeated.</p><br/><p>Their confidence was directly tied to their unwavering faith in her.</p><br/><p>The report continued.</p><br/><p>The news that Arch Demon had appeared again provoked an uproar.</p><br/><p>This wasn’t something they could ignore any longer.</p><br/><p>It is absolutely crucial that an arch demon, which harbors the Demon Lord Seed, be immediately destroyed.</p><br/><p>Besides, if it was a simple Arch Demon that was born depending on abilities, three Knights Templar should be able to destroy it.</p><br/><p>And if they brought five knights, there was no way they could lose.</p><br/><p>But this would prove difficult if they allowed it to continue existing and accumulating experience.</p><br/><p>They had to destroy it now. Such was the rule regarding dealing with an appearance of an Arch Demon.</p><br/><p>「Hinata-sama, this is an urgent matter. My team will subjugate this demon. Please order us!」</p><br/><p>「In that case, we shall also go. Please order us to attack!」</p><br/><p>The young templars exclaimed following their elders example. The others too, in lieu with common sense, did not oppose the measure.</p><br/><p>After all, the sooner they subjugate the Arch Demon the better.</p><br/><p>But…</p><br/><p>Reihim’s story did not end.</p><br/><p>He still had things to say.</p><br/><p>… Rather, he hasn’t even mentioned the main points yet.</p><br/><p>But the templars could not have known of this.</p><br/><p>Which is why they could discuss such pointless things as subjugating an arch demon.</p><br/><p>「Please wait a moment. Do not pay any heed to the Arch Demon subjugation.</p><br/><p>The light magic I mentioned. As I just said, when it hit us, we were completely wiped out.</p><br/><p>However, that doesn’t portray the scene appropriately.</p><br/><p>There were 15 thousand of us. And this elite force was completely destroyed by a single monster’s terrifying attack.</p><br/><p>I meant that literally.</p><br/><p>Not as an army, but every single individual…</p><br/><p>Massacred. That’s no exaggeration. That’s exactly as it happened」</p><br/><p>Silence enveloped that holy room.</p><br/><p>A heavy atmosphere in which no one could utter a single word.</p><br/><p>A monster which could massacre 15 thousand men. It made them recall a certain legend.</p><br/><p>A legend speaks of a monster which became a demon lord after destroying a city.</p><br/><p>Truly, the monster fit the description of the word “Demon Lord”. The monster sowed chaos and destruction.</p><br/><p>Beings that exceed human capabilities are usually limited to the Special S Class Dragons.</p><br/><p>Currently, three of them remain and one has been sealed until now.</p><br/><p>These three beings are designated Special S class.</p><br/><p>But in reality, it wouldn’t be unusual to recognize two more special s ranked individuals from among the demon lords.</p><br/><p>The reason they are not recognized so is simple.</p><br/><p>They were mostly active before the church has been formed and have yet to produce any further causalities.</p><br/><p>In other words, should they resume their rampage, they will be recognized as Special S ranked beings.</p><br/><p>They will be recognized as a being that cannot be defeated by human hands. That’s what Special S rank means.</p><br/><p>As for their activity before the church had been established, that’s a tale of a thousand and a few hundred years ago.</p><br/><p>According to traditional records, it would have been a thousand and two hundred years ago.</p><br/><p>Even then, two beings called demon lords and which would now have been recognized as Special S rank existed–Lord of Darkness Guy Crimson and Destroyer Milim Nava.</p><br/><p>Furthermore, some believed that other demon lords awakened as true demon lords, but none of these openly wrought havoc.</p><br/><p>Which is why, in order not to increase the people’s anxiety for no reason, every demon lord has been classified as S ranked.</p><br/><p>A being that can’t be opposed with human strength alone.</p><br/><p>Because when a generation lacks a hero, they had to declare that humanity would not lose against demons.</p><br/><p>But, this new monster…</p><br/><p>Just became a demon lord but may be immediately recognized as a Special S rank.</p><br/><p>Heavy silence continued to rule the room.</p><br/><p>A silence which displayed a desire to reject accepting the birth of a new demon lord.</p><br/><p>Simple demon lords and true demon lords are an existence that towers over humans.</p><br/><p>But…</p><br/><p>「Hmph, it’s pointless to stand here in silence.</p><br/><p>Hey, Reihim. Did you see it awaken?」</p><br/><p>Ending the silence, Hinata asked.</p><br/><p>In response</p><br/><p>「Yes. I believe an offering of 15,000 lives was sufficient…」</p><br/><p>He replied, confident.</p><br/><p>「Is that so…」</p><br/><p>Hinata muttered and began to think.</p><br/><p>As things stood, she was fortunate not to have gone to Tempest yet.</p><br/><p>If her opponent was an awakened, if he turned into a True Demon Lord, then the number of troops didn’t matter.</p><br/><p>Even if you gathered powerful soldiers, should they lack the strength to oppose that monster directly then they are useless.</p><br/><p>The subjugation army’s disaster only proved this point.</p><br/><p>Moreover, even though the monster hasn’t awakened by then it was still capable of destroying the army alone.</p><br/><p>From time immemorial a hero and her carefully selected team would venture to defeat the demon lord.</p><br/><p>And since that’s the case…</p><br/><p>「I guess I’ll have to go, huh?」</p><br/><p>She muttered.</p><br/><p>If the opponent is a demon lord, Hinata would have to go herself.</p><br/><p>And since there was no need to further increase the number of corpses, there was no need to send out normal soldiers.</p><br/><p>An elite few.</p><br/><p>Perhaps… a hundred knight templar could win this battle and have a higher chance of victory than a larger force.</p><br/><p>Hinata accelerated her thoughts.</p><br/><p>Again and again and again.</p><br/><p>Because she had to ascertain her victory.</p><br/><p>And as if interrupting her thoughts a pained expression appeared on Reihim’s face.</p><br/><p>And, from within his chest a new face arose.</p><br/><p>Reihim’s pained expression quickly turned serene…</p><br/><p>「Ah ah, test test test. Can you hear me?</p><br/><p>(It’s already recording)</p><br/><p>(Eh? Already? Seriously?)</p><br/><p>… ah, whatever?</p><br/><p>*Cough*</p><br/><p>Should I say: pleased to meet you? I am the lord of Tempest, Rimuru.</p><br/><p>I’ll say this in advance, this is a message.</p><br/><p>Even if you address this messenger, I won’t hear you, so keep that in mind」</p><br/><p>The face said.</p><br/><p>A number of soldiers came at Reihim sword drawn but were stopped by these words.</p><br/><p>That’s a speech they probably had to hear.</p><br/><p>The Knights Templar couldn’t hide their surprise.</p><br/><p>Whereas Hinata’s expression did not change. She was merely awaiting the next words.</p><br/><p>Her head was calculating various possibilities. But her expression did not show it.</p><br/><p>That’s just how much control she had over her heart and mind.</p><br/><p>「Did the messenger suit your tastes?</p><br/><p>Good taste, right? Oh, but I didn’t design him.</p><br/><p>Don’t get any weird ideas.</p><br/><p>(Umm~ this wasn’t my idea either…)</p><br/><p>(Shut up. They might be listening in on this!)</p><br/><p>(Is that so. Good thing they didn’t hear this)</p><br/><p>But let’s forget about tastes.</p><br/><p>Let’s get to the question at hand. I’m wondering how much you’re planning to pay me to end this fight.</p><br/><p>I’ll say this in advance: you started this fight.</p><br/><p>I have witnesses so you can’t overturn this fact. So what will you do?</p><br/><p>Personally, if you apologize for this incident, I am willing to forgive you this time.</p><br/><p>But, should you refuse to make amends with “monsters”, then we will crush you with our entire force.</p><br/><p>Without any reserve, without any mercy, without a second thought we shall crush you.</p><br/><p>(Eh? Even if a time to rethink this comes up?)</p><br/><p>(Didn’t I tell you to shut up? What will you do if they hear you? I won’t look cool anymore!)</p><br/><p>Which is why, I ask you to carefully consider the next step</p><br/><p>That being so… is Hinata there?</p><br/><p>This message will only be played if your presence is recognized.</p><br/><p>But that aside, here’s what I wanted to say.</p><br/><p>Well done attacking a person without listening to a single thing they had to say.</p><br/><p>A wonderful funeral you planned for me! But, too bad.</p><br/><p>I am alive.</p><br/><p>The next time you come at me, I will respond with my true power.</p><br/><p>But… I want to hold a serious conversation before that.</p><br/><p>So I’d appreciate it if you gave it some thought.</p><br/><p>If you still desire to fight me after that, then that’s that.</p><br/><p>Let this messenger know your response.</p><br/><p>The ones embedded in his body are the Blood Shadows–I think they are called.</p><br/><p>They killed my friends so I cannot forgive them.</p><br/><p>So, I killed them and embedded their heads into this guy.</p><br/><p>This messenger is also dead. Yet I made him undead so that “they” continue to suffer.</p><br/><p>After receiving your reply he will come back to me, so don’t worry about that.</p><br/><p>Should you decide to dispose of him, he’ll automatically disintegrate thanks to your skill that I analyzed.</p><br/><p>But if you choose to only half kill him, that’ll only increase his suffering so keep that in mind.</p><br/><p>Currently, I’m headed off to the Demon Lords’ Walpurgis Banquet.</p><br/><p>So if you want to talk, decide upon it, and we’ll talk after I return from there alive.</p><br/><p>Chances are it’s going to be a week from now, so keep that in mind.</p><br/><p>Well then… I’m looking forward to your reply!」</p><br/><p>And ending this monologue, the message conclude.</p><br/><p>The templars, their mouths agape, looked at their trusted Hinata.</p><br/><p>Without being perturbed by it, she met their gaze.</p><br/><p>She was busy processing the newly obtained information.</p><br/><p>There were a few things worth of note but there was not time for that.</p><br/><p>Though he had an aloof attitude, the message’s content could not ridiculed.</p><br/><p>The most important point was that “Disintegration” had been analyzed.</p><br/><p>Now, should she fight, she probably wouldn’t be able to use it on him.</p><br/><p>Perhaps he was only bluffing, but she could hardly depend on such empty optimism.</p><br/><p>Her biggest mistake was that she didn’t notice his survival during their last battle.</p><br/><p>She felt a sense of… regret! Yes, that rare feeling burned in her chest.</p><br/><p>He also mentioned other important things.</p><br/><p>When he spoke of making amends with monsters, he must have had the Church’s doctrine in mind.</p><br/><p>So he’s probably searching for a chance to make peace with them.</p><br/><p>But that’s something that everyone, Hinata included, would describe as naive.</p><br/><p>And, lastly,</p><br/><p>That, monster Rimuru was most definitely not lying during their last meeting.</p><br/><p>The fact that he was also a World Traveler and that he reincarnated as a monster.</p><br/><p>That… was probably true.</p><br/><p>His Japanese was far too natural.</p><br/><p>That was the nostalgic Japanese that could only come from that world.</p><br/><p>At some point in time Hinata had opened her previously closed eyes.</p><br/><p>And, without a word, she erased Reihim with Disintegration.</p><br/><p>If Rimuru’s words were true, then quickly erasing him would be his salvation.</p><br/><p>And,</p><br/><p>「Do not be tempted by him. Our creed is absolute. We should pay no heed to some lowly monster!」</p><br/><p>She declared to the knights.</p><br/><p>Though she may have just contradicted herself, that wasn’t something she could admit to.</p><br/><p>That is, if they were to ignore the monster’s words, there was no need to disintegrate Reihim.</p><br/><p>It was because she believed him that she did it, but the knights didn’t notice it.</p><br/><p>She was the “Emperor’s Personal Guard Captain” and led the knights herself.</p><br/><p>As their captain she had to serve as the absolute example.</p><br/><p>Thus leading the hardened templars was the reason for her previous words.</p><br/><p>(Now then, what should I do…)</p><br/><p>She wasn’t sure she could win this time.</p><br/><p>Though Hinata fell into melancholy, her face did not show it.</p><br/><p>What a difficult dilemma befell her!</p><br/><p>But for Hinata, this was something she could just solve by continuing her calculations. So she thought.</p><br/>\n</div>"}