{"title": "Chapter 91 – VS. Holy Knights Part 2", "id": 91, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-91-%E2%80%93-vs-holy-knights-part-2", "volume_title": "Volume 1", "body": "<h1>Chapter 91 – VS. Holy Knights Part 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner</p><br/><p>A girl was walking through the street with a bright smile and a one piece dress. She was going from clothing store to clothing store trying to find what she liked.</p><br/><p>「What do you think about this one? No good? Then how about this one?」</p><br/><p>She asked her friend.</p><br/><p>「Hmm? Did the doctor let me out? Oh, well, I am perfectly alright now. Besides, listen, listen! He invited me to a party! He said all his friends will be there and he wanted me to go with him! I have to pick out the best dress」</p><br/><p>She tried on numerous dresses, pouting that none fit her tastes.</p><br/><p>「You think that blue one would be good? Okay, one second!」</p><br/><p>She tried on a blue evening dress which revealed her thigh. Though it was long, due to the design it was relatively easy to move in. She approached the cash register and handed the cashier a card.</p><br/><p>「I would need to see an identification」</p><br/><p>The girl sighed, reached into her wallet, and pulled out what a new passport.</p><br/><p>「Miss Oda Aiko? I apologize for that. Would you like the dress packed or mailed?」</p><br/><p>Yes, the doctor bribed a few government offices to have Yuuko registered under his name. Her past erased, the doctor wanted to give the girl a new future. One where he controlled her as a toy.</p><br/><p>The girl picked up the dress and headed out of the shop. She was getting ready for what she was sure would be the best night in her life.</p><br/><p>.</p><br/><p>Note: ( ) – denote thought communication. 「」spoken word.</p><br/><p>Saint Demon Confrontation Arc</p><br/><p>091. vs Holy Knights pt. 2</p><br/><p>At the same time as Arnaud abandoned himself to a desperate struggle,</p><br/><p>Every other division too abandoned any hopes of being able to set up a barrier.</p><br/><p>For example, let’s see how one squad fared…</p><br/><p>.</p><br/><p>Auburn haired team Captain Grenda.</p><br/><p>Her squad was smoothly setting up the barrier.</p><br/><p>And suddenly they saw a single young lad walking towards them.</p><br/><p>He was strolling in their direction, his blue hair parted by two horns.</p><br/><p>These horns signified him as a non-human being.</p><br/><p>Grenda clicked her tongue, left the setting up of the barrier to her adjutant, and readied a squad to engage.</p><br/><p>「Are you also this city’s denizen?」</p><br/><p>Though it was obvious, she asked in order to buy some time.</p><br/><p>And though she didn’t expect a response,</p><br/><p>「Correct. Let me give you a warning. Peacefully sit down and wait.</p><br/><p>If you do, no harm will come to you, you know? That’s the best outcome for you lot」</p><br/><p>He said completely looking down on them.</p><br/><p>Grenda snorted and rebuked the offer.</p><br/><p>In the first place, you can’t make a deal with a monster and there was only a single one before them.</p><br/><p>Though he seems like a high ranked ogre he would hardly be a threat to them.</p><br/><p>Ogres tend to favor combat focusing on raw strength.</p><br/><p>They slaughter their enemies by wielding heavy weapons with their brute strength.</p><br/><p>Furthermore, these are also individuals who can protect themselves with incredibly tough muscles and high regenerative abilities.</p><br/><p>Ogres are an adventurer’s natural enemies.</p><br/><p>But they are the knights templar. Not a group that could possibly lose against an ogre.</p><br/><p>They have never seen an A ranked ogre.</p><br/><p>The monster before has an appearance of a particularly weak ogre. But, he carries the air of dominance about him.</p><br/><p>Chances are, it’s a named unique monster.</p><br/><p>Its confidence must come from the fact that it’s among the strongest beings in the forest.</p><br/><p>If so, they needed to teach it the strength of the Templars.</p><br/><p>Like teaching a frog that has never left its birth-swamp how wide the world is. So that it would never look down on them again.</p><br/><p>(Well, we will kill it here so it won’t have that chance)</p><br/><p>Grenda thought closing her eyes.</p><br/><p>「Attentiont! Single target. Danger rating A-! Three members, dispose of it!」</p><br/><p>She had thought to wait until her subordinates set up the holy barrier, but there was only a single enemy.</p><br/><p>It didn’t release a powerful aura, so it’s danger rating was rate low.</p><br/><p>That rating, however, decided Grenda Squad’s fate.</p><br/><p>「You are being careless. Aren’t you looking down on your enemy too much?」</p><br/><p>As soon as the three knights approached the lad the scene turn hazy for a split second.</p><br/><p>And, passing right through the knights, the lad continued the leisurely stroll.</p><br/><p>Why did he pass the knights… no, the knights have already collapsed.</p><br/><p>The moment they were in range he had completely immobilized them.</p><br/><p>These three powerful knights were rendered defenseless. In a single moment.</p><br/><p>「W-what did you do?!」</p><br/><p>「You bastard… what are you?!!」</p><br/><p>She heard her adjutants cry out and an intense feeling of deja vu assaulted her.</p><br/><p>She was remembering what Commander Hinata has said so many times…</p><br/><p>And the enemy before her emitted strength that could make you despair.</p><br/><p>At this point, she understood the meaning of Hinata’s warning. But, it was far too late…</p><br/><p>Shadows creeping from behind her have already disabled her entire team.</p><br/><p>Completely expressionless, a group of lads with identical face disabled them and disappeared.</p><br/><p>It seems that he had cloned himself and encircled the enemy from the very beginning.</p><br/><p>Just like Hinata, the moment he warned them the battle had been decided.</p><br/><p>He did not look down on them at all but prioritized results.</p><br/><p>Grenda lost.</p><br/><p>「I could tell you my name, but it’s a pain.</p><br/><p>I have a reason to keep you alive.</p><br/><p>Tell me everything you know about the church.</p><br/><p>I’m currently studying torture, so if you don’t answer I’ll be experimenting on you.</p><br/><p>Of course, feel free to resist.</p><br/><p>Now then, what will you do? I don’t care either way」</p><br/><p>The lad muttered, completely uninterested, his expression unchanging.</p><br/><p>Coupled with his beautiful face, the scene filled Grenda’s heart with fear.</p><br/><p>Resistance is futile. If so, will she choose to talk or to die?</p><br/><p>Then she noticed that he had left all her friends alive. Maybe, if she were to choose death he would offer the same to every one of them.</p><br/><p>Thinking that, she decided to buy some time by choosing to be tortured…</p><br/><p>「Torture me or whatever you wish! We shall never bow before a monster」</p><br/><p>Grenda said as if she were giving up.</p><br/><p>She drew her blade and filled it with spiritual energy. While thus awakening her spiritual weapon, she confronted the enemy.</p><br/><p>Even if her strength wasn’t enough, she would at least satisfy her pride.</p><br/><p>The blue-black haired beautiful lad, Souei, looked at her with a slightly displeased expression.</p><br/><p>And sighed at her foolishness.</p><br/><p>「I see, you chose to resist. I care little about ranks and such, so I’d rather you just tell me whatever you know」</p><br/><p>Faster than he could complete the sentence, Grenda moved.</p><br/><p>Her sword quickly pierced the body before her.</p><br/><p>But, perhaps she cut only a clone because the enemy simply faded away.</p><br/><p>Grenda undestood. If she couldn’t find his true body, she had no hopes of victory.</p><br/><p>「Now then, let’s begin the torture. Let me know when you decide to talk」</p><br/><p>A sweet voice whispered into her ear.</p><br/><p>Grenda intended to fight but Souei did not consider her as a being that could hurt him at all.</p><br/><p>And suddenly, Grenda felt waves of pleasure overcome her.</p><br/><p>Souei had begun to stimulate her erogenous nerves with a thread. Rather than pain, a heavenly pleasure attacked her.</p><br/><p>「Now then, I have sealed your ability to faint. So do talk before you go mad」</p><br/><p>Grenda struggled inside this hell of pleasure.</p><br/><p>But… unfortunately, she soon gave up.</p><br/><p>＊ ＊ ＊</p><br/><p>As if threatened off the battlefield by Shion, Gobuta and Gabil headed towards a small group of knights.</p><br/><p>As some point Hakurou was running beside them and Souei’s Shadow squad had joined.</p><br/><p>「Don’t hold us back, dearest brother!」</p><br/><p>「Who asked you to come?! And you should make sure you don’t hinder me」</p><br/><p>That was Gabil’s and Souka’s exchange.</p><br/><p>Though they always seem hostile, everyone knows they actually treasure each other. Only they themselves don’t notice it.</p><br/><p>And after this exchange they had finally reached their destination.</p><br/><p>The knights too felt a group of monsters approaching them and finished their preparations.</p><br/><p>They filled their weapons with spiritual power and were thus fully armed.</p><br/><p>「Beware! Those monsters don’t seem like small fry!」</p><br/><p>「By Captain, there’s six dragonewts among them?</p><br/><p>And those monsters that aren’t wearing armor are ogres, right?」</p><br/><p>「No, though it’s hard to believe, those are not ogres. They are the fair oni.</p><br/><p>Unlike ogres that depend on raw strength, these unique beings utilize special abilities!」</p><br/><p>「Oh, sounds annoying. But their dragonewt vanguard also seems to have unusual air about him」</p><br/><p>The knights discussed.</p><br/><p>The approaching monsters were surely the main force of the monster country.</p><br/><p>The captain clicked his tongue in annoyance. But, even if they abandoned constructing the barrier here surely another site would succeed.</p><br/><p>That just proves how well Hinata has read their plan.</p><br/><p>It’s a good thing that their main force had come here.</p><br/><p>「Alright! I will defeat those large dragonewts.</p><br/><p>You two defeat the oni!</p><br/><p>The other five deal with the other five dragonewts!」</p><br/><p>「Understood! Wait, didn’t you forget about that hobgoblin?」</p><br/><p>Captain Gregory gave the inquirer an incredulous look, and</p><br/><p>「Tch. So what that I overlooked some small fry. I’ll deal with him in a single moment later!」</p><br/><p>He said and the knights nodded in response.</p><br/><p>They knew the captain’s power. The likes of hobgoblins would not even be able to land a single hit on him.</p><br/><p>But… why is the hobgoblin included with the rest of them? A few of them thought, suspicion growing.</p><br/><p>Not a single monster introduced themselves.</p><br/><p>Nor did they intend to allow them to do so,</p><br/><p>「Drop dead you hindrance! Haou yougekizan “High King Spirit Beheading”!」</p><br/><p>Swinging his halberd, he fired a powerful shock-wave at the monsters.</p><br/><p>The energy that escaped Templar Gregory’s body intended to annihilate the monsters in a single striker.</p><br/><p>In addition to that, he fired the Holy Cannon from his hand, the bullets spiraling around the halberd’s attack.</p><br/><p>The energy from the halberd and the bullets combined into a single energy bolt.</p><br/><p>This yougekizan was Gregory’s secret anti-monster certain kill technique.</p><br/><p>This shock-wave pressed on in a straight line as if light itself.</p><br/><p>Right in the direction of Gabil and Souka, who had already avoided the attack.</p><br/><p>As for the remaining Gobuta and Hakurou… Hakurou had jumped onto the trees and moved via branches towards the knights.</p><br/><p>So only Gobuta remained.</p><br/><p>「Wha! Seriously~su?!」</p><br/><p>The path was exceedingly narrow, so only someone with Hakurou’s agility could avoid the attack.</p><br/><p>For Gregory, as long taking out two or three enemies with this attack would have been ideal, but he would be satisfied as long as he killed that small fry.</p><br/><p>And thus, completely forgetting about the Hobgoblin, he diverted his attention to the dragonewts approaching from the sky.</p><br/><p>Thus began this battle.</p><br/><p>The one in most danger was Gobuta.</p><br/><p>Anyone and everyone that could have saved him have gone on ahead.</p><br/><p>「Seriously, what a joke~su! How cruel to leave this frail me behind~su」</p><br/><p>Gobuta grumbled preparing for an attack.</p><br/><p>Unlike the ridiculous department heads, there was little he could do. Nor did he want to be treated the same as them.</p><br/><p>(Excuse me, Wisdom King Raphael-san! It’s an emergency~su. What should I do?)</p><br/><p>≪Solution. If you, individual: Gobuta, get hit by that, you will perish.</p><br/><p>You should『Unite』with the Star Wolf, slip into the shadow, and attack the enemy from behind≫</p><br/><p>(Understood~su! Thanks for always saving me~su!)</p><br/><p>Surprisingly enough, as long as a thought link was established, Gobuta could communicate with Raphael.</p><br/><p>And, using Raphael’s calculations, Gobuta immediately sprung into action.</p><br/><p>After uniting with the star wolf and diving into the shadows, he was able to avoid the shockwave. And in this state he continued to move.</p><br/><p>He felt a great increase in his abilities and his raw strength at least double.</p><br/><p>Without doubting Raphael’s calculations at all, Gobuta sneaked behind the knight who had attacked him.</p><br/><p>He was completely oblivious to the fact that this enemy was the squad captain and one of the more powerful opponents. In fact, he blindly obeyed the Wisdom King’s directions.</p><br/><p>Knight Templar Gregory by no means let his guard down. That is why he was able to respond to that presence.</p><br/><p>When he felt a monster suddenly appear behind him, he rolled forward to escape that place.</p><br/><p>Moreover, he was able to dodge the attack of the wolves fangs coming at him from behind. And even launch a counterattack with his halberd.</p><br/><p>Gregory was surprised that the hobgoblin whom he had written off as dead a second ago had come out unscathed and attacked him.</p><br/><p>But, on this field of battle, he quickly recovered and focused on the opponent.</p><br/><p>The thought that he had underestimated his enemy was now gone from his mind, and he deemed the one before him a worthy foe.</p><br/><p>Gobuta and Gregory.</p><br/><p>Without losing or letting each other gain a single inch, a violent battle erupted between the two.</p><br/><p>Since he traveled via the shadow, Gobuta appeared amidst the enemy faster than anyone else.</p><br/><p>This surprised not only the knights but Gabil and the rest as well.</p><br/><p>「Shadow step, huh. How disgraceful. To think he could use the shadows better than we could…」</p><br/><p>「No, Gobuta-chan is amazing!」</p><br/><p>「Yeah, yeah. He’s stronger than us, you know?」</p><br/><p>Touka and Saika responded to Souka’s complaint.</p><br/><p>Though she had never heard anyone describe Gobuta as strong until now, she knew he was not weak.</p><br/><p>Truly, the Monster Country Tempest simply had too many strong individuals.</p><br/><p>The extent of her master Souei’s power she could not even fathom. She could hardly be surprised by him.</p><br/><p>「Right, I guess we also need to show off our powers a bit」</p><br/><p>She said, and took to the skies in order to fight off the soldiers who advancing towards Gobuta.</p><br/><p>Thus effectively crippling their communications.</p><br/><p>Souka’s group was thus able to fight the knights one on one.</p><br/><p>Gabil immediately set off to overwhelm the two adjutants.</p><br/><p>As Gregory’s direct assistants, by no means were they weak.</p><br/><p>But their choice of weapon failed them this time.</p><br/><p>The weapon which was meant to cut off the opponent’s magic energy just couldn’t pierce Gabil’s natural armor.</p><br/><p>Though these knights certainly had other skills to use, Gabil himself was a first rate warrior.</p><br/><p>Blocking Gabil’s spear, snapped their swords in half.</p><br/><p>Moreover, the knights’ prided ability of using spirit magic without an incantation had no effect on him.</p><br/><p>So they couldn’t gain an advantage by suddenly firing off magic at him.</p><br/><p>In short, they couldn’t deal him any damage and even the most pettiest of tricks–throwing sand in his eyes wouldn’t work due to『Magic Perception』ability.</p><br/><p>They were completely powerless.</p><br/><p>「Guwahahaha! What’s wrong? Is this all you can do?</p><br/><p>With this much you wouldn’t last even an hour of Hakurou-dono’s training session!」</p><br/><p>Gabil said, while freely playing with the adjutants.</p><br/><p>From the very beginning, Gabil had a resistance to the Holy Attribute and paid little mind to their〈Spirit Magic〉archive.</p><br/><p>Besides, they were inferior in sword skill and other physical abilities.</p><br/><p>Thus, Gabil was a monster who could overwhelm two Adjutant Class Holy Knights.</p><br/><p>Unable to accept the existence of such a monster, the adjutants decided to try to buy some time.</p><br/><p>As long as they could hold out until Gregory would cut down that Hobgoblin, it would be their victory.</p><br/><p>It seems that these men have long forgotten about the fair oni who was no longer in sight.</p><br/><p>The rest of the squad too, though called a force that could crush a thousand enemies by themselves, were barely able to hold back the dragonewts.</p><br/><p>And thus the battle continued, with every group resisting their respective opponents.</p><br/><p>There was someone who overlooked this battle from the treetops.</p><br/><p>Hakurou.</p><br/><p>While looking at this scene,</p><br/><p>「Hmph. Gabil is having too much fun.</p><br/><p>Souka’s group was able to find good opponents. If a battle is too easy, it doesn’t teach you anything.</p><br/><p>Thank goodness they were able to find good opponents. Practice cannot teach one to feel danger」</p><br/><p>He muttered, observing their battles.</p><br/><p>Of course, should any one of them had wound up in trouble, he intended to support them right away, but that was clearly unnecessary.</p><br/><p>「Gobuta you bastard, if you can do that much why were you running away then…</p><br/><p>But I guess he’s doing his best now. ‘Tis all the guidance of our Wisdom King Raphael-sama」</p><br/><p>He said with a satisfied nod.</p><br/><p>Everything was going according to plan.</p><br/><p>When Shion suggested they stage a fight with similar ranked people – though it was completely idiotic – Hakurou and Raphael decided to turn it into training.</p><br/><p>Though Hakurou could see Benimaru finding out about this arrangement later and demanding that they do the fight over.</p><br/><p>Truly, he hoped that Shion would learn the fear of pain.</p><br/><p>「No, it’s probably useless even if she gets hurt…」</p><br/><p>He muttered and sighed.</p><br/><p>Now then, with regards to the plan…</p><br/><p>Using the thought link he could communicate with the Wisdom King.</p><br/><p>Chances are, it was Raphael who had decided what abilities would be given to them.</p><br/><p>After having decided what kind of servants would most benefit their common lord–Rimuru.</p><br/><p>At the present moment, without any doubt or suspicion, they fully depended on Raphael’s advice.</p><br/><p>Though Raphael often saw no need to reply, this time Raphael did.</p><br/><p>And this carefully designed battle continued. With this, Gobuta and Souka’s proficiency may increase.</p><br/><p>But,</p><br/><p>「Gabil’s no good. He’s having too much fun. When this is over, I’ll work him to the bone」</p><br/><p>Hakurou muttered dissatisfied.</p><br/><p>But the pitiful Gabil did not know these things, and haughtily fought the knights.</p><br/><p>His fun times would continue a little longer.</p><br/>\n</div>"}