{"title": "Chapter 97 – Compensation and future relations!", "id": 97, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-97-%E2%80%93-compensation-and-future-relations", "volume_title": "Volume 1", "body": "<h1>Chapter 97 – Compensation and future relations!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translated: Smoggy the Bear</p><br/><p>Edited: WhiteSamurai</p><br/><p>~Staring, White, Black, Gray, Yellow, Blue, Red, Orange and Silver~</p><br/><p>[Inside the Samurai Lair]</p><br/><p>(White)</p><br/><p>“Well, since Clown-chan has asked me to help out with the editing of Shitara Slime, I suppose I should make a formal introduction.”</p><br/><p>(Black)</p><br/><p>“Cut to the chase White, or you might lose interest and goof off again…”</p><br/><p>(White)</p><br/><p>“I would not!</p><br/><p>At any rate…</p><br/><p>My name, is WhiteSamurai, known more so for my work on Re:Monster, another Novel, as well as the head of Pacem Community Translations and writer of my own novels of ‘Ant Tense’ and ‘Nameless Hero’.</p><br/><p>(Black)</p><br/><p>“You’re totally self advertising!”</p><br/><p>(White)</p><br/><p>“IT’S INTRODUCTIONS, it’s totally different!”</p><br/><p>(Gray)</p><br/><p>“You two are always fighting with each other. Seriously, you two would get so much more done if you weren’t always arguing.”</p><br/><p>(Yellow)</p><br/><p>“Gray, you need to just be quiet and let master White speak. White’s word is law, you should never threaten the balance of Black and White!”</p><br/><p>(White &amp; Black &amp; Gray)</p><br/><p>“…”</p><br/><p>(Blue)</p><br/><p>“Hah… You guys are always so noisy… I just want to sleep and your noise is so bothersome…”</p><br/><p>(Red)</p><br/><p>“Gaaaah, BLUE WAKE UP. It’s because of your laziness that White is like this… I JUST WANT TO MURDER YOU SOMETIMES!”</p><br/><p>(Orange)</p><br/><p>“Red, one must be calm if you are to incite reason into the hearts of men. Without proper balance, nothing shall ever be accomplished.”</p><br/><p>(Black)</p><br/><p>“Hah… White, this is you just seriously playing around isn’t it? I mean, EVERYONE’S shown up for this introduction.”</p><br/><p>(White)</p><br/><p>“Well… not everyone…”</p><br/><p>*Rumble* *Rumble* *Loud Explosion*</p><br/><p>(Silver)</p><br/><p>“AHAHAHAHAHAHAHAHHAA, SOME IDIOT LEFT MY DUNGEON’S DOOR OPEN. I’M FREE! AHAHAHAHAA. I’LL DESTROY EVERYTHING, I HATE EVERYTHING, I HATE ALL OF YOU. TIME TO DIE YOU ******* ********. BURN IN MY FIREY WRA-”</p><br/><p>*Gray closes the Dungeon’s door*</p><br/><p>(Gray)</p><br/><p>“SILVER, SIT.”</p><br/><p>(Blue)</p><br/><p>“I’M AWAKE NOW!”</p><br/><p>(Red)</p><br/><p>“I think i’m going to be sick…”</p><br/><p>(White)</p><br/><p>“Well, on to the chapter!”</p><br/><p>(All But White)</p><br/><p>“WAIT? WHAT ABOUT GOL-”</p><br/><p>-Scene-</p><br/><p>——————————————————————————————</p><br/><p>~097: Compensation and future relations!</p><br/><p>Well, this and that happened, and now for some reason it’s suddenly become a banquet.</p><br/><p>There was a large quantity of various alcohols available. Well, it’s probable that it’s just various forms of diluted whisky and other beverages, but there was ample quantities of ice prepared. We spared no means to bring such a necessary item out for the festivities.</p><br/><p>But, well, as expected, it was simply too much to ask for Japanese style sake, but since I had desired them, an abundant variety of drinks had been prepared.</p><br/><p>As it would turn out, the drinks were rather popular amongst the Holy Knights.</p><br/><p>In their semi-drunken state, I had hoped that talks of a regular “ Tempest Martial Arts competition” would be forgotten, but it would seem that my hopes won’t be fulfilled.</p><br/><p>This chain of events will probably proceed steadily.</p><br/><p>Thus, the next day came.</p><br/><p>The discussion between Hinata’s group and my own will finally be completed. Various discussions about the future relations between Tempest and the Church will probably ensue.</p><br/><p>As it would stand, as we’re the victim’s side and the one that had received the most substantial level of heavy damage. A lenient response in light of the current situation is simply not possible for the sake of future face and general common sense.</p><br/><p>However, a specific increase in the severity of the charges placed on the actual criminal sect known as the Blood Shadow was emphasized. It was certainly different from the desired intentions of the Church.</p><br/><p>Because of a little thing known as management, the responsibility for recent events have not fallen completely from a certain party’s responsibility.</p><br/><p>Although the Holy Knights should end up paying a certain amount of war reparations for their subjugation war’s failure this time around. Well, since the location of Tempest is too far away from the territory they control, even if territory was to be passed onto me, I wouldn’t be able to use it that much.</p><br/><p>Not to even think about mentioning the fact that this can simply be solved with money.</p><br/><p>To be honest, I see establishing friendly relations abroad as a priority above the acquisition of gold and whatnot.</p><br/><p>While thinking of such things, the meeting had finally begun in earnest.</p><br/><p>The participants from Tempest would include Rigurdo, Benimaru and myself. Aside from that, we also have the Goblin Chiefs who were, for this purpose, promoted to Minister status.</p><br/><p>From the Church’s side would be Hinata and her 5 Captains.</p><br/><p>At first, I had wanted both sides to acknowledge reciprocal recognition. As this was my main goal from the beginning, gaining any additional compensation can be brought up afterwards.</p><br/><p>With that said, before we truly started the conference, both parties decided it would be beneficial to exchange general information. Such information generally consisted of each party’s respective situations, such as their current exportable goods and so on.</p><br/><p>After that, the main conference started.</p><br/><p>While watching from a middle ground perspective, I watched for any changes in the balance of the negotiations.</p><br/><p>If there were to be any misalignments or complications from either party, it would be best if they were corrected in the early stages of the negotiations.</p><br/><p>After a few minutes, I began to gather how the negotiations are panning out.</p><br/><p>Needless to say, from our side, the list of grievances began with the Church’s sponsored invasion from the Farmas Kingdom.</p><br/><p>The direction of the negotiations changes depending on the attitudes of the other party, yet the stances of each party remained unchanged.</p><br/><p>As for the Church’s position, Hinata mentioned that there was a problem with the current request from the Church’s perspective.</p><br/><p>Basically, the acknowledgement of the Monster Country is something that contradicts the very teachings of the Church. This is an important matter that could very well lead to the mistrust of the believers.</p><br/><p>If there was nothing done, this matter could very well lead to the estrangement of the believers. Thus resulting in the loss of the Church’s influence, or at the very least the diminishing of it.</p><br/><p>This was apparently the reason why the annihilation of said Monster Country was of the utmost necessity.</p><br/><p>That’s why, according to Hinata, the Church needed a just cause and a cover story to deal with the situation.</p><br/><p>Hence, they chose to utilize the fact that the Farmas Kingdom had openly showed their desire to secure their profit. Giving the Kingdom a suitable level of claim to act, they attacked Tempest along with the Farmas Kingdom.</p><br/><p>Well…. they have admitted that they are completely at fault here but… the fact that they were manipulated into action was unexpected.</p><br/><p>(Hinata)</p><br/><p>“Fufufuf… I suppose it can’t be helped. We’re completely defeated, so I doubt we’ll be able to make headway if I don’t give you some acknowledgement.</p><br/><p>Besides…</p><br/><p>I, the representative of the Church, believe in the sole existence that protects the lands and people.</p><br/><p>Those very people that convert to the Church find their salvation, and they cut off all other beliefs besides the Church.</p><br/><p>There is a limit to the number of people I can save alone. I had believed that only saving those who followed the Church’s teachings was true justice.</p><br/><p>That’s also how I think even now… but…</p><br/><p>I think that I have been mistaken.</p><br/><p>I should have lent my hand out to those who had striven to survive, to life and be happy. In such, I suppose my actions was not true justice at all.</p><br/><p>I… no, if we had helped others for the simple reason of helping them, perhaps we would not have become so overpowered by this sense of arrogance.</p><br/><p>For, if we are true believers, we should help all those in need, not merely those who follow our teachings. That is the blindness of our arrogance.</p><br/><p>To even seek to accomplish this with every ounce of our power is probably the least we can do.”</p><br/><p>As if making a mental breakthrough, and as a result finding some level of fulfillment, Hinata’s face showed a bright smile as she spoke.</p><br/><p>For the old Hinata, to only save believers was the logical choice. To abandon those who do not believe in the Church’s teachings.</p><br/><p>She didn’t have the strength to save every last person who needed help, who looked into the sky begging for a savior. It was a wish she probably thought was something that could never be realized.</p><br/><p>That’s why she decided that those who followed the teachings of god should be given priority to be saved.</p><br/><p>Her logical and calculative personality had cut off the non-believers cold-heartedly.</p><br/><p>While she stayed true to her personal dogma, in her heart, she was only lying to herself up until now.</p><br/><p>In the end, the number of people she saved was quite limited. The very lines she drew limited the life that could have been sustained. She could never be everywhere at once, but limiting the choice of who to save ended up leading to making incorrect decisions.</p><br/><p>In the end, while it is impossible to save everyone, there were far more lives that could have been saved.</p><br/><p>The line that Hinata had drawn before her own heart was whether a person was a believer or not. To not acknowledge someone as a true person unless they were a believer to forget the pain of not saving them.</p><br/><p>That’s why Hinata greatly feared a decrease in the number of believers. If the number of people who believed decreased, it was like saying the number of people she could protect was reduced.</p><br/><p>Well, she’s was little hardheaded in the beginning. Her train of thought is also a bit skewed, though I can understand her reasoning more or less. I too came from the same world as her after all.</p><br/><p>Those who place all of their trust in god, leaving their decisions to those who interpret said god’s teachings often end up narrowminded. Those who lack the capacity to make their own decisions will often make the wrong ones, leading to a spiral of decay.</p><br/><p>I’m only treated like an enemy because of the current interpretation of the Church’s doctrine. With that alone, I don’t mind their actions, though religion in general becomes suspicious.</p><br/><p>If people were just more flexible and tried to see other points of view, the number of conflicts would be reduced severely.</p><br/><p>Well, there’s always the other reason for conflicts. Human nature. Often war ends up being waged over profits, authority, and the like. Leading to them beating each other until they’re black and blue.</p><br/><p>In the end, there are those who seek to enrich themselves to obtain an advantage, whereas those who are devout adherents to their faith will often be left crying in defeat.</p><br/><p>Well, it is story that’s quite easy to gauge really, I simply need to be the one who doesn’t cry in the end… Or rather, I should say the one who strives to not fall behind.</p><br/><p>In short I need to consider my own intentions.</p><br/><p>Rather than complaining to others, if they use their heads, they will be able to come up with better solutions. Well, most people are quite formidable in turning a viewpoint around to place themselves in an advantageous position. It’s almost second to human nature if one thinks about it.</p><br/><p>Well, it might just be an idea, but it’s a good idea to not just believe in a partner blindly.</p><br/><p>In this regard, I think Hinata may be a bit too serious.</p><br/><p>From now on I recommend that she should live more freely. Get some proper life experience besides her narrow minded upbringing.</p><br/><p>At any rate, thanks to Hinata being so candid and admitting to her own faults, the talks were able to proceed smoothly.</p><br/><p>It seems that there were no objections from the Captains either.</p><br/><p>It’s probable that they have a strong belief in Hinata, so they wouldn’t voice any objections to what Hinata says.</p><br/><p>A large part of the discussion was examining both the situation, as well as both parties’ recognition that the conflicts between both sides are now over with the Church admitting to their faults.</p><br/><p>Now comes to the point of discussion compensation, but before that happened…</p><br/><p>(Hinata)</p><br/><p>“My apologies, but there are certain things that I want to say in that regard.”</p><br/><p>With that, Hinata began to share her thoughts.</p><br/><p>After listening to what she said, it seems that her higher-ups in the Church within the Holy Kingdom, Ruberius, had no involvement with her attack.</p><br/><p>It seems that the hierarchy of the Church, or at the very least the positions relating to it are rather complex.</p><br/><p>The Pope, the Sage King, or whomever, it seems that there are multiple individuals who stand at the ‘top’ of the Chruch’s hierarchy.</p><br/><p>However, the true person that reigns at the top is the Holy Knight leader, Nicolas Cardinal.</p><br/><p>The rampage that had been unleashed this time, as well as the subjugation war had nothing to do with the Kingdom where the Church is located.</p><br/><p>Therefore, in the end, the involvement of the Holy Kingdom Ruberius is limited to only Hinata.</p><br/><p>So even if I had demanded some form of compensation, Hinata’s confession ended any hopes of me pursuing that direction.</p><br/><p>From her viewpoint, it’s because she held the post as the head of the Pope’s personal knight that things had become rather complicated.</p><br/><p>To note, Personal Knights and Holy Knights are two entirely different groups.</p><br/><p>Taking action solely from the Pope’s demands, the so called “Personal Knights” never leave the vicinity of the Pope without his command.</p><br/><p>Only the head of the Personal Knights, Hinata herself, was given permission to act freely to act and protect the growth of the Church. That basically included overseeing the growth of the Holy Knight branch.</p><br/><p>It’s because of her position that the Holy Kingdom isn’t completely unrelated to the current incident.</p><br/><p>While it wasn’t said openly, the responsibility of this incident falls completely on Hinata. It was in order to prevent any blame to the Holy Kingdom that Hinata had withdrawn from her position as the Head of the Personal Knights.</p><br/><p>It’s not like this was the end of the story either. Hinata had already been informed by her teachers that she could have been disposed of at any time.</p><br/><p>These teachers are known as the “Seven Celestial Sages” as it were.</p><br/><p>Though it’s not necessary to be too suspicious about this matter, i’d wager a guess that these first-class sages are rather brave and powerful.</p><br/><p>Since the Holy Kingdom of Ruberius had already made thorough preparations to cut ties with Hinata should she fail or cause trouble with her current actions, it’s impossible to hold them accountable anymore.</p><br/><p>In this case at least, we will have to consider this as a separate issue from the Western Church as it were.</p><br/><p>I suppose it will be necessary to consent with the Western Church this time.</p><br/><p>Hah… then what’s going to be done about the compensation?</p><br/><p>As I had previously mentioned, i’m not aiming for money for this situation.</p><br/><p>The aim was for the Church’s side to acknowledge our existence, so after they give their acknowledgement, I want to press for a non aggression pact.</p><br/><p>Well, my thoughts were interrupted by the Holy Knight named Arnaud.</p><br/><p>(Arnaud)</p><br/><p>“I don’t really see any problems with this. If you or your people were truly evil, there’s no reason for us to still exist right now.”</p><br/><p>With those words, he showed his approval.</p><br/><p>In contrast to the Holy Knight Arnaud’s opinion was the Vice Captain, the Holy Knight called Leonard.</p><br/><p>(Leonard)</p><br/><p>“However, there’s still a problem. How are we supposed to deal with the current teachings of the Church? Especially when the entire authority of the Church depends on it…”</p><br/><p>When he said this, his brow furrowed, conveying he is rather unconvinced.</p><br/><p>With both this, and Hinata’s worries being conveyed, they seem to be the same.</p><br/><p>In the worst case scenario, there’s even the chance of the Church’s dissolution.</p><br/><p>The important issue is to protect the people during the resolution of current hostilities. I don’t care what happens to the Church in all honesty, with that i’ll be focusing on the protection of the people first.</p><br/><p>Unlike the rational pragmatic Hinata, the believers of the Church will likely focus all of their contempt towards the Church.</p><br/><p>If the Church itself vanishes, the Holy Knight order that defends the people from monsters will likely scatter.</p><br/><p>As if to break my train of thought, the deeply troubled Leonard spoke gain.</p><br/><p>(Leonard)</p><br/><p>“Even so, the inhabitants of this country are certainly not ‘Wicked beings’ like we had previously thought. Why not simply let this information be announced instead?</p><br/><p>In fact, even the Goblins and Orcs, which makes up a majority of the population, have figures quite similar to that of human beings. As for the Lizardmen, well, they were already considered to be demi-humans anyways. There’s no need to think about the Dragonewt class’ position.</p><br/><p>Even in the case of the Onis, rather than be considered a low class monster, there are many humans who even view them to be within the ranks of land Gods and Deities.</p><br/><p>In short, there’s no teachings that state that Demi-humans and Demigods are ‘Wicked’ right?”</p><br/><p>In short, the monsters aren’t monsters, and thus aren’t “Wicked” as the Church’s doctrines teach. Basically what he’s saying is to admit my entire population into Demi-human status, allowing us the same treatment as the Dwarves.</p><br/><p>This can probably lead to, at the very least, some level of mutual understanding.</p><br/><p>This is similar to points that Arnaud had mentioned before in the discussion, but he wasn’t able to really drive the point home.</p><br/><p>Basically, this is a point of compromise that is entirely political.</p><br/><p>We decided to adopt this opinion and were then able to rapidly carry out a negotiation examining every possible detail.</p><br/><p>In this fashion, we managed to create a basic draft for the compromise.</p><br/><p>By the way, it seems that the Hierarchy of the Church accepted and recognize the current status of our citizens. This was accompanied by us being informed that the Holy Knights would preforming a regular cultural in place of a regular compensation.</p><br/><p>Above everything else, as an additional compensation, we were given a failed experiment of theirs. Basically a set of experimental equipment that they weren’t able to complete.</p><br/><p>As for Hinata’s broken sword, we were given that as well, and the few pieces of spirit armor that weren’t completely destroyed. Analyzing them was fairly simple. At any rate, I passed over a duplicated sword to Hinata to replace her sword since she was pretty much defenseless currently.</p><br/><p>To note, the analysis of the Spirit Armor was actually a major development. I also had the chance to analyze the Spirit Equipment the Holy Knights used.</p><br/><p>My current attributes are Darkness and Magic. Basically I wouldn’t be able to use the Holy attribute affiliated equipment as is, but I think there’s a possibility to modify them.</p><br/><p>It would seem that these are State-Secret class weapons, yet we’re sitting here, perfectly fine to just analyze them. If I were to take this as a compensation, I suppose there’s no problem with this much.</p><br/><p>With this country of ours, things will gradually grow more advanced and sophisticated. Not to mention, more well armed.</p><br/><p>After we received our ‘compensation’, we began to chat and I ended up gathering some ridiculous information as a result.</p><br/><p>I mean, to most others, this would just be common sense, but this is the first time I’ve ever heard of it.</p><br/><p>Basically, it was information on the Great Tenma wars that occur roughly every 500 years or so.</p><br/><p>This came about when I was discussing future policies.</p><br/><p>To begin with,</p><br/><p>(Hinata)</p><br/><p>“Well… Tempura, a bowl of white rice… even sashimi… Rimuru, you are, without a doubt, a fellow Japanese. There’s no longer any doubt in my mind about it.</p><br/><p>But to reproduce our world’s food here, I have to say i’m both surprised and amazed. What you’ve said is true, you’ve managed to achieve your desired environment in just two years….</p><br/><p>If I hadn’t already seen all of this with my own eyes, I would never believe it for my entire life!”</p><br/><p>Hinata had begun with these casual segments, but….</p><br/><p>(Rimuru)</p><br/><p>“No, there’s still far more to do.</p><br/><p>Logistics are still far too slow, communication is still out of the question.</p><br/><p>Since there’s magic, casual life and food preservation are possible for the time being.</p><br/><p>The worst part right now is definitely culture. There’s still just far too little depth in our environment.</p><br/><p>It will take some time, but one day it will be worked into the society.</p><br/><p>My aims currently are the main developments of our highway network and its maintenance. I want to get a safe and secure passage to be developed. We’re currently working on it, and it’s progressively taking shape.</p><br/><p>Following that I want to work on information transfer. I gave up on wireless communication a while ago since I just have no knowledge on the subject.</p><br/><p>However, though transmission is greatly enhanceable via the incorporation of Magic Steel, so I plan on taking advantage of this for the short and mid term.</p><br/><p>When the magic steel is connected intercity through a space through the use of shadow step, it’s possible to communicate with them without the use of an excessive quantity of magic.</p><br/><p>What do you think? Convenient isn’t it?”</p><br/><p>Well… I boasted a little.</p><br/><p>In reality, not only between our cities, but a network that will connect even the villages is planned.</p><br/><p>Bester’s been developing a long range telecommunication technology he’s calling Comm-Gems.</p><br/><p>It’s too magic intensive if a visual image is also being conveyed during the communication, so it’s currently impossible to include each village. It’s something to look into for the future.</p><br/><p>If the steel wires were to be processed and finally stretched out, it’s possible to handle it with manpower alone.</p><br/><p>If the Shadow Step space were to be used instead, then this process could be done effortlessly without any obstacles.</p><br/><p>After that, we’ll have to just wait for the development and refinement of the receiver point.</p><br/><p>As expected, from a person who lived in the Era of Information, the speed of transferring information takes a special place in my desires.</p><br/><p>Hinata was obviously amazed by my plans.</p><br/><p>(Hinata)</p><br/><p>“Uh… um… well… er, that’s all well and fine…</p><br/><p>Be careful not to go too far… you’ll be attacked by an angel…”</p><br/><p>Hinata said this with a casual tone.</p><br/><p>Angel!? What the heck was that? What about an Angel?</p><br/><p>Hinata seemed to notice my puzzlement and continued.</p><br/><p>(Hinata)</p><br/><p>“Ara? You didn’t know?</p><br/><p>Every five hundred years, the gates of heaven will open, allowing the Angels to commence their invasion.</p><br/><p>Based on fundamentals, they don’t attack human settlements all that often, but overly developed towns end up destroyed.</p><br/><p>Research indicates that the Angels despise civilization as yang to their ying if you will.</p><br/><p>The only one’s that have managed to escape from their onslaught is the Dwarven Kingdom.</p><br/><p>Their domain only has two entrances. Large scale invasions don’t work either because dragons inhabit the mountain ranges.</p><br/><p>Therefore, they’ve managed to defend themselves somehow.</p><br/><p>That’s more or less the reason why civilization is stagnate to a certain level.</p><br/><p>The only exception is the Ingrasia kingdom. It’s also the reason why the council is there in the first place. It’s in order to perform research and try to mitigate the damage of each invasion.</p><br/><p>Every five hundred years, the Imperial Capital is redesigned based on how much damage is caused after an invasion. It’s basically trial and error.</p><br/><p>This is something that each country has unanimously agreed on and something that all residents understand completely.</p><br/><p>It’s also because their research hasn’t been over the top that the destruction and devastation has been kept to a minimal.</p><br/><p>Each nation gives out support and carries out their research in total secret. Any discoveries are generally concealed and only the Kings of each country can utilize the latest in technological development.</p><br/><p>If they were to spread the results to the people, the angels would certainly unleash their full wrath upon them.</p><br/><p>This system was carefully determined and agreed upon. Only discoveries that are determined to not cause incident are released to the masses.</p><br/><p>The purpose of the angels are to eliminate monsters as well.</p><br/><p>I suppose it’s something that you really shouldn’t be overlooking.”</p><br/><p>Is this something that everyone knows about?</p><br/><p>This is always the kind of feeling I get when I get explanations like this… Arg…</p><br/><p>But what was that about Angels? How have I never heard about them….</p><br/><p>(Rimuru)</p><br/><p>“Oi, did you know anything about this?”</p><br/><p>Well, at least it’s not everyone. When I questioned Rigurdo and the others present, they didn’t know anything about this at all.</p><br/><p>I don’t know anything about the Angel’s invasion, but I do know that when the Angels do come to attack, it could only mean a war between the Demon Lords and the Angels.</p><br/><p>Well, I did wonder about that war that occurred five hundred years ago. I was curious if it was a war between the Demon Lords or a war against Humankind.</p><br/><p>No… when you think about it, if it were merely a fight with humans, it would have been a joke and a half if any form of truce were ever really made or honored.</p><br/><p>Although I never really thought deeply about it, now I’m starting to get an idea based on everything i’ve been told. I suppose it makes sense now.</p><br/><p>However… every five hundred years the Angels invade huh… and only the technologically advanced…</p><br/><p>They don’t make a move on humans, but what’s with this hatred for civilization?</p><br/><p>Is it just that they want to interfere with humankind, or are they afraid of something?</p><br/><p>Honestly, I couldn’t make heads or tails of the meaning behind their actions.</p><br/><p>(Rimuru)</p><br/><p>“So? Do they leave some countries alone? What happens if someone defeats an Angel?”</p><br/><p>Well, the answer to my question was rather obvious.</p><br/><p>It’s a really bad idea. If you really wanted to make an enemy of a race that’s higher than most monsters or demons, well, you can figure out the rest yourself.</p><br/><p>Indeed, demons are troublesome enough, I probably don’t want to go out and make another enemy.</p><br/><p>As it stands, there’s no need to conduct any interference with undeveloped humans. However, what’s the cut-off line for technology that will be destroyed?</p><br/><p>Do they hate the otherworlder’s tastes perhaps? Maybe gunpowder isn’t any good then.</p><br/><p>It seems that the Angels are individually close to a B+ rank, so they always come in armies of roughly… 1,000,000 strong or more…</p><br/><p>In addition, there are leaders of Captain/ Commander classes that are stronger and organize the invasion.</p><br/><p>It seems like there are General level classes as well, but the combat capabilities of these individuals are unknown.</p><br/><p>A Demon Lord’s Body is probably stronger though.</p><br/><p>They’re also under the Holy attribute, so any real attacks or intervention from the Church will probably be useless.</p><br/><p>Though, even if nothing is done, the helpless monsters will generally be slaughtered under the Angelic invasion.</p><br/><p>However, they don’t seem to be allies of humanity either, not even Hinata knows that much about them.</p><br/><p>Well, it’s to be expected since no humans currently have seen an Angel for over five hundred years. The only reason they are known is through the recordings of history and rumors.</p><br/><p>Given that, there’s a good reason as to why the Church considers monsters as the enemies, and also why demons exist.</p><br/><p>Amongst the monsters, there seems to be an organization that is exceptionally hostile towards humans. There’s even a Demon Lord in their midst that clearly hates humans as well. Well, was of course…</p><br/><p>Clayman was the representative of that faction, but he’s beyond dead now.</p><br/><p>With Clayman dead, there aren’t any Demon Lords amongst the Eight-Star Demon Lords that have a clear cut hostility towards humankind.</p><br/><p>(Hinata)</p><br/><p>“HUH?! Clayman’s dead?!”</p><br/><p>Oh, it surprised Hinata.</p><br/><p>(Rimuru)</p><br/><p>“Yep, he’s dead. I killed him and destroyed his soul.”</p><br/><p>While I went for a nice, salty and oily potato chip, I offered my carefree reply.</p><br/><p>Ah, potato chips are the perfect snack..</p><br/><p>Rather than talking about that small fry, I much rather talk about the Angels that were coming. But it was clear that she was conflicted on whether or not she should give up on this matter.</p><br/><p>That kind of small fry… what happened to him doesn’t matter at all if i’m perfectly honest. Well, that’s what I thought, but….</p><br/><p>From what Hinata told me about him, Clayman had always been acting secretively and they were never able to get any leads on him.</p><br/><p>However, his extreme hostility towards humanity was clear, and if there weren’t an internal balance check between the Demon Lords, and the necessary agreement of several other Demon Lords, he would have probably went to war with them ages ago.</p><br/><p>Then I remembered.</p><br/><p>(Rimuru)</p><br/><p>“Oh right, I just remembered that Clayman mentioned his lord being the Demon Lord Kazaream or something of the nature. Ah, he’s likely to have some connection with Yuuki, so best to be cautious.</p><br/><p>The Holy Knights who hadn’t heard this yet were thusly told.</p><br/><p>(Anon Holy Knight 1)</p><br/><p>‘Hah? The Leader of the Freedom Association might be the Demon Lord Kazaream?”</p><br/><p>(Anon Holy Knight 2)</p><br/><p>“However… we can’t just openly examine him on this… If handled wrong, this could lead to an all out war between the Church and the Freedom Association…”</p><br/><p>(Rimuru)</p><br/><p>“Well, Kazaream is alive and we assume he managed to manipulate Clayman…</p><br/><p>That would mean the boss of the hostile demons is Kazaream. Even if he isn’t the de-facto leader, the chance that he’s monitoring them is possibly very high.”</p><br/><p>I said that while eating a few potato chips.</p><br/><p>But, contrary to their serious facial expressions, their hands continued to bring new potato chips to their mouths.</p><br/><p>These guys… aren’t you acting a bit too familiar?</p><br/><p>Heck, even Hinata was reaching her hands out and nibbling on various items.</p><br/><p>Wait, what’s this about?! Is this really a topic that you can so casually discuss?</p><br/><p>So on and so forth, but I ended up just muttering rashly, especially since it doesn’t really have anything to do with me anymore anyways.</p><br/><p>(Rimuru)</p><br/><p>“Oh well. It’s just a possibility anyway. It’s best that we don’t act careless though.</p><br/><p>However, I do admit that there are plenty of people going after the “Otherworldly” children, so I don’t want to alert them if I don’t have to.”</p><br/><p>(Hinata)</p><br/><p>“Regarding that, I think I might know of a place. I’d like to go and examine further, but do you mind if I do so?”</p><br/><p>(Rimuru)</p><br/><p>“Eh? Uh… Ah.. Did you need to ask so carefully? Is there some professional informant in the Freedom Association?”</p><br/><p>Hinata probably had a similar idea.</p><br/><p>I could probably figure out what she was planning, and if it’s what I think it is, it isn’t a bad idea to entrust it to her.</p><br/><p>Thinking this, I tentatively nodded in my agreement.</p><br/><p>Indeed, even though there is no tangible evidence, this isn’t something that can be just left alone as is.</p><br/><p>This matter will all be determined by the information that we manage to gather. Hinata’s eyes showed me that she was also aware of the importance of the situation at hand and we nodded at each other.</p><br/><p>Thusly, our future relations with the Church have been successfully laid out. We were able to complete a friendly meeting and spent our time meaningfully.</p><br/><p>I was even able to obtain some unexpected information, but it’s best I leave ‘that’ person to examine it.</p><br/><p>Hinata also stayed around for another two or three days before she returned.</p><br/><p>For the sake of an emergency contact, allowing either party to instantly contact the other, several people were left behind. However, monitoring us is no longer their purpose here.</p><br/><p>Since we’ve already ceased all open hostility, it’s best to just establish friendly connections in the future.</p><br/><p>If possible, i’d like to maintain relations as is.</p><br/><p>Like this, the series of Conflicts with the Church, has officially reached a tentative completion.</p><br/><p>———–</p><br/><p>White’s note:</p><br/><p>(White)</p><br/><p>“Good grief! Well, the difference between Clown-chan, Guro-san and the Kuma-Hana team is apparent. It’s not as bad as when i’m working with people using Google Translate by a LONG SHOT. Though there are points where the translation was wrong.</p><br/><p>I’d suggest that they use the Translation aggregator to double check their work.</p><br/><p>http://versetranslations.wordpress.com/translation-app/#TAGuide</p><br/><p>I recommend using the JPasar, ATLAS, and Honyaku as reference. Other than that, well done with what you put out.</p><br/><p>Rough estimation of time used to complete: 280 minutes…</p><br/><p>I’m out of practice… it was only 20 pages… though I DO type out each word…</p><br/><p>Enjoy o/</p><br/><p>~White</p><br/><p>Yuuka: I’ll be taking a break now due to exams; everyone please miss me.</p><br/><p>Smoggy: White San, I type out each word too (Mate, you’re good at this)… and Yuuka San, you will be missed.</p><br/>\n</div>"}