{"title": "Chapter 95 – Complete Victory", "id": 95, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-95-%E2%80%93-complete-victory", "volume_title": "Volume 1", "body": "<h1>Chapter 95 – Complete Victory</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Complete Victory</p><br/><p>Inside the time that had been prolonged by 1 million fold, we faced each other.</p><br/><p>That was, a thought space created by Wisdom King Raphael, that dragged Hinata into this space.</p><br/><p>It succeeded in creating a forced thought link with Hinata’s consciousness, which I could have not predicted.</p><br/><p>Well, why did it do such a thing?</p><br/><p>The answer was Shizu-san.</p><br/><p>(It was my request. To Rimuru’s ability, Wisdom King Raphael.)</p><br/><p>Shizu-san says so, while smiling gently.</p><br/><p>The Izawa Shizue who was seen by Hinata and I was not the real person.</p><br/><p>It was the remains of the real person’s Soul. A fragment of her mind.</p><br/><p>At the time I absorbed her, her soul was also taken. Thanks to the evolution of Wisdom King Raphael, it seems that the analysis of her soul was a success.</p><br/><p>Really.........</p><br/><p>Since the time it was still ‘Great Sage’, what has it done secretly and silently behind me? This fellow…</p><br/><p>Wasn’t the true Mastermind Wisdom King Raphael-san? I thought so too, but it might also not be true.</p><br/><p>Inside the constructed thought space, Hinata was being embraced by Shizu-san.</p><br/><p>“You have done well”, Shizu-san said while praising Hinata.</p><br/><p>That ruthless Hinata had a relieved expression like a child. Seeing such an appearance I felt a strange feeling.</p><br/><p>Then, Shizu-san’s hands plucked the wicked insect that was coiling around Hinata’s head, and burnt it completely with her flame.</p><br/><p>That was, the “Curse’s Crystal” that had started Hinata’s Thought Restraint [1].</p><br/><p>「Wait, hey! Wisdom King Raphael. I also met Yuuki, could I also be under Thought Restraint?」(Rimuru)</p><br/><p>Although I didn’t think so, I asked to make sure.</p><br/><p>This Wisdom King Raphael fellow maybe doing something without permission, but it was not a negligent fellow.</p><br/><p>《Notification. Master is not under Thought Restraint.</p><br/><p>However, the traces of Thought Guidance were confirmed.</p><br/><p>Because of the ability’s evolution, the effect of Thought Guidance has disappeared now.</p><br/><p>The report came nonchalantly from Raphael as if it was a trivial matter.</p><br/><p>This fellow, if there were signs, then the probability that Yuuki was the mastermind was high.</p><br/><p>Even I was not convinced to doubt at that level! This fellow (Raphael), really.......</p><br/><p>Oh well, perhaps to obtain definitive evidence, it attempted to reproduce Shizu-san’s soul.</p><br/><p>This fellow was too much of a perfectionist, it won’t report to me, if the information was not absolutely 100% correct.</p><br/><p>Since my analysis was imperfect, it will trouble and confuse me, if it reported every trivial information one by one.</p><br/><p>As if it understood what my intentions were, I don’t have any complaint about it.</p><br/><p>And thus, time passed for a while.</p><br/><p>Hinata raised her head, did she calm down?</p><br/><p>Her expression was calm, her previous tense mood had been eased.</p><br/><p>Perhaps she was actually a kind child, but she might have acquired her ruthless and brutal tendency to survive through the harsh world.</p><br/><p>If you think about it, was this what Shizu-san had regrets about?</p><br/><p>Maybe for this reason, Wisdom King Raphael reproduced Shizu-san’s Soul, because it wanted an opportunity to exchange information with her.</p><br/><p>(Hinata, I’m sorry for neglecting you.</p><br/><p>Please live strongly, faith is important, but don’t misjudge the reality/enemy.)[2]</p><br/><p>「Shishou (Sensei).........But, even now, I am still confused.</p><br/><p>I believe the condition in Holy Empire of Ruberion was not wrong.」(Hinata)</p><br/><p>(Hinata...... Which is correct? Which is wrong?</p><br/><p>To decide it one-sidedly is not good. Be flexible, okay?)</p><br/><p>Shizu-san admonishes her gently.</p><br/><p>She still wanted to talk more. This woman (Hinata) even if she was smart, she was too stubborn.</p><br/><p>She doesn’t really lend her ear to any of my words, but there are occasions when she showed her flexible nature.</p><br/><p>But just as expected she still didn’t listen to my words......</p><br/><p>「I understand. One more time, I will start over. Seeing with these eyes, and deciding with my own heart.」 (Hinata)</p><br/><p>Hinata nodded honestly.</p><br/><p>Oi......... was it because Shizu-san’s the one who was talking that she became this obedient? Or, because she was released from Thought Restraint that she became obedient?</p><br/><p>It was because of the Thought Restraint. Yes, there’s no mistaking it.</p><br/><p>After all, it’s not like I expected anything while having a hard time persuading Hinata.</p><br/><p>That means, the bad one was all Yuuki.</p><br/><p>Was there a possibility that guy was also manipulated....?</p><br/><p>Could Raphael give me an answer about this?</p><br/><p>「Oi, I understand that Kagurazaka Yuuki is the mastermind. But, for confirmation....</p><br/><p>Is there a possibility that Yuuki is also being manipulated?</p><br/><p>If I say accurately, by the “Sorcery King (Curse Lord)” Kazaream!」(Rimuru)</p><br/><p>I press the question about the real issue at hand sternly.</p><br/><p>If it is not inquired now, the core issue may never come out.</p><br/><p>「Yuuki is manipulated by “Sorcery King” Kazaream, how?</p><br/><p>Wasn’t he a former Demon Lord that was slain by Demon Lord Leon, right? How can he still be alive?」(Hinata)</p><br/><p>「Nn? Ah! Before this, that person’s subordinate Clayman said that Demon Lord was still alive.</p><br/><p>He said that person’s Spiritual body seemed to have revived.</p><br/><p>Because he had detailed information from the human side, I guessed that he was possessing a human.」(Rimuru)</p><br/><p>「He is alive? And, he is in a place where he could gather information easily.</p><br/><p> In the first place, to apply Thought Restraint on me, it doesn’t seem possible for Yuuki to do it at the same time when I arrived at this world.</p><br/><p>Above all else, his intention or objective was unknown. But, if you say that Kazaream is the mastermind.....」 (Hinata)</p><br/><p>「Nn? Do you know something?」(Rimuru)</p><br/><p>To my question, Hinata only replied in silence.</p><br/><p>This fellow was still not being honest with me.</p><br/><p>Oh well. What I wanted to hear was not from Hinata.</p><br/><p>「Answer me, Wisdom King Raphael」</p><br/><p>To my question, I felt relieved as if it was answered.</p><br/><p>A Spiritual body can’t use their ability excessively. Additionally, there was a possibility that it could possess a body and move from one to another.</p><br/><p>Or, there was a possibility that somehow, through the protection of the Spiritual body, the soul did not vanish. Kazaream was left roaming around and fused with Yuuki when he accidently came into this world.</p><br/><p>Although the probability of the former was higher, the communication with Clayman came too slowly. As Clayman said, the contact suddenly came several tens of years ago [3], until then his movement was a mystery.</p><br/><p>In case of the latter.</p><br/><p>The probability was too low, it was something unimaginable, but..... There was a dying person who reincarnated as a Slime, so it can’t be said to be completely impossible.</p><br/><p>Eh? Wasn’t that was about myself?! I let out such a Tsukkomi.</p><br/><p>If one can’t be said with certainty, Kaguzaka Yuuki’s personality might have already vanished or not.</p><br/><p>However, there was also a possibility that Yuuki’s personality could have been swallowed or dominated by Kazaream.</p><br/><p>Wisdom King Raphael considered various possibilities, but it doesn’t want to declare until there was certainty.</p><br/><p>Since its perfectionist nature could be considered a merit and a demerit.</p><br/><p>「Anyway, currently without any doubt, Yuuki is a dangerous opponent. Because of that, we must be cautious.」</p><br/><p>So, I concluded.</p><br/><p>(However, that child was seen as a really normal and kind child. There was no uncomfortable feeling.</p><br/><p>That was why I worried about him, Hinata. You must never get close to Yuuki.</p><br/><p>I have a very unpleasant premonition........</p><br/><p>Good bye, Hinata. Please live and become happy)</p><br/><p>Shizu-san said so at the end, she then disappeared from Hinata and my sight.</p><br/><p>She was finally able to tell Hinata what she was worried about, what she regretted had she disappeared.</p><br/><p>After Shizu-san disappearance, Hinata kept offering a silent prayer towards that direction. That appearance, I will always remember it.</p><br/><p>And then......</p><br/><p>《Notification. The purpose was achieved. Now releasing the thought link》</p><br/><p>Immediately after it said that, I felt like I was wrapped in a bright light.</p><br/><p>(Rimuru, thank you about Hinata. As expected you really are a kind person...... This place is very comfortable.....)</p><br/><p>I thought I heard Shizu-san’s voice.</p><br/><p>Was it only my imagination? Or, was it an illusion? However, Shizu-san’s anxiety certainly disappeared.</p><br/><p>While sprouting a gentle smile, Shizu-san bowed her head to me.</p><br/><p> −−−−−−−−−−−−−−−−−−−−−−−−−−</p><br/><p>I opened my eyes after the signal from Wisdom King Raphael.</p><br/><p>The time that had been prolonged 1 million fold was returning to its normal flow, and thought link was released.</p><br/><p>The vicinity was shrouded with scent of the battlefield and we were glaring at each other with the same stance we had a little while ago.</p><br/><p>In real time, half hour had passed since the beginning of the fight.</p><br/><p>Even though I felt like the fight took place a long time ago, did my one on one fight with Hinata start only 30 minutes ago?</p><br/><p>Though I felt like time had already elapsed for several days, it looked like it never happened.</p><br/><p>「Well then, shall we continue again?」(Hinata)</p><br/><p>Like nothing happened, Hinata drew her sword.</p><br/><p>Eh, wait a minute.</p><br/><p>「Hey! The last time I had the advantage over you, I stopped! So, why did you nonchalantly ignore it!」 (Rimuru)</p><br/><p>「I don’t know. Isn’t it common sense to end a battle after delivering the final blow?」 (Hinata)</p><br/><p>「Ku......... This bastard.....」 (Rimuru)</p><br/><p>「Besides, after my subordinates became like that, I cannot afford to withdraw silently, right?」 (Hinata)</p><br/><p>What was she saying?</p><br/><p>So I thought, and looked around at my surroundings.........</p><br/><p>「Impossible, it is already impossible. Do as you like, you damn monster!」 (Anon Holy Knight)</p><br/><p>「Kufufufufu. It was more enjoyable than I thought. Let’s us have a break for a while」(Diablo)</p><br/><p>「What, rest!? Whatever! Damn it!」 (Anon Holy Knight)</p><br/><p>「Kufufufufu. Oh dear, don’t say so!」(Diablo)</p><br/><p>Such was exchange between Diablo and the Holy Knights.</p><br/><p>「Go away! You nuisance.」(Souei)</p><br/><p>「Aa, Souei-sama.......how mean!」(Tortured Female Holy Knight)</p><br/><p>For some reason, a redhead and beautiful onee-san leaned coquettishly against Souei.</p><br/><p>How should I put it, what were you doing in the fight? My anger was about to gush forth slightly, you know?</p><br/><p>「I am terribly sorry, Rimuru-sama. I was torturing her, but it seems I made a mistake.</p><br/><p>Somehow it became like this...........」 (Souei)</p><br/><p>Souei apologized to me while he pushed aside the redhead Holy Knight while being annoyed.</p><br/><p>Although I was puzzled by what kind of torture he had conducted, I was more worried about what kind of torture that could cause such a reaction.</p><br/><p>I really don’t understand what’s going on there.</p><br/><p>「You, get away from Souei-sama!」(Souka)</p><br/><p>Souka shouts vigorously with loud voice.</p><br/><p>But the voice doesn’t match with her completely exhausted appearance. She looks likes she was unable to stand up.</p><br/><p>If you look around, Gobuta, Gabil and also Souei’s Shadow squad were exhausted and looked like they wanted to collapse.</p><br/><p>Next to them was Hakurou sighing.</p><br/><p>「You guys, will be drilled and tempered by me」(Hakurou)</p><br/><p>So he grumbled. As the words became the final blow, Gobuta and the others suddenly collapsed.</p><br/><p>Next to Gobuta and others, the Holy Knights were also similarly worn-out and laying around. It seems like an intense battle had unfolded there.</p><br/><p>But it seem their battle was not satisfying for Hakurou, didn’t they do their best with Holy Knights as the opponent?</p><br/><p>「I was deceived-ssu. My opponent was the strongest one, so cruel-ssu!」(Gobuta)</p><br/><p>「To end up drawing a Hobgoblin as an opponent...... That? I am also not in a good position......」 (Gregory)</p><br/><p>「It can’t be!......... I have tried my best! And yet why!?」(Gabil)</p><br/><p>Unanimously, they were complaining about something. Oh well, I have nothing else to say except condolences.</p><br/><p>Well, this was still okay, even though I still don’t understand what happened to Souei’s opponent, I will just leave it behind.</p><br/><p>But I soon caught a glimpse of a grievous scene that made me want to avert my eyes, I think they were Holy Knight who had become playmates of Ranga and Shion</p><br/><p>Looking by a glance, lying in front of Ranga were eight people that were left with only tattered pants.</p><br/><p>Ranga seemed to have carried them with his mouth, while wagging his tail energetically.</p><br/><p>「My master! These people were the best to check my condition after my evolution」(Ranga)</p><br/><p>Ranga said so happily.</p><br/><p>Although I told him not to do things excessively.........Well, at least he didn’t kill them.</p><br/><p>「O, ou. Good for you then.....」 (Rimuru)</p><br/><p>「Ay! Can I play more?」 (Ranga)</p><br/><p>「No, please stop. Those people might be tired already....」 (Rimuru)</p><br/><p>「Is that so? I understand.」 (Ranga)</p><br/><p>Was he not playing enough? His tail has hung down but.........</p><br/><p>Were they relieved by my words? I think I heard relieved voices from the people under Ranga’s feet.</p><br/><p>Yup, it was their voice, all right.</p><br/><p>If Ranga played another round with them, those people will die.</p><br/><p>Frankly, they were saved! Their faces, with their thankful eyes, were directed towards me.........</p><br/><p>Was it alright for the Holy Knight to do that? I became a bit worried, but it can’t be helped, since their opponent was Ranga.</p><br/><p>The main problem was about Shion’s opponent’s condition.</p><br/><p>Why? Why did everyone’s limbs disappear and their body left to squirm on the ground?</p><br/><p>I believed that Shion’s smug face was a bad premonition. It really was.</p><br/><p>「.......Oi. Shion. What did you do to those people?」(Rimuru)</p><br/><p>「Ay! For the commendation, thank you very much!</p><br/><p>These things (people)[4], because they dared to try and oppose Rimuru-sama, I punished them a little.」(Shion)</p><br/><p>I’m not praising you! You idiot.</p><br/><p>Although Shion proudly answered, but.......</p><br/><p>No matter how you look at it, it was too overboard. In the beginning, except for my subordinates, I didn’t really care about the people who opposed me or trash or something like that.</p><br/><p>「Oi...... Although I said do your best, no matter how you look at it you are overdoing it! Don’t kill them! Didn’t I say that?」(Rimuru)</p><br/><p>「It’s alright. Everyone still lives energetically like this!」(Shion)</p><br/><p>No no!</p><br/><p>Even if they are alive, they were not in a good condition. Didn’t those who lost their arms and legs have a blank and hollow expression?!</p><br/><p>What's more, since they were protecting people, if they lack arms and legs, how could they fight against monsters?</p><br/><p>She doesn’t understand what I want to say, this fellow.......</p><br/><p>「Shion, it seems like it’s just you that did not obey my order.</p><br/><p>If you don’t have any explanation......」 (Rimuru)</p><br/><p>Just when I attempted to speak,</p><br/><p>「Oops! I forgot! You guys, be delighted and express your gratitude to Rimuru-sama!」</p><br/><p>While saying such words, in a great haste she collects all the squirming Holy Knights under her feet in one swoop.</p><br/><p>And then sprinkles over the Full Potion (Complete Recovery Medicine).</p><br/><p>In front of my sight, the Holy Knights’ limbs were growing back.</p><br/><p>Although I don’t understand her ability, she obtained a very terrifying ability, that Shion.</p><br/><p>Did she manipulate the system’s effect? An absurd dangerous skill had awakened in this troublesome girl.</p><br/><p>I cannot stop myself from sympathizing with her opponent.</p><br/><p>The Holy Knight that had their arms and legs restored, were sharing their joy with each other.</p><br/><p>Their joy was great since they weren’t turned into a disabled person, which is understandable because of how many daily training they had.</p><br/><p>Well, it’s because of Shion’s rampage, from now on I decided to pay more attention to her.</p><br/><p>Well, as long as Holy Knights safety was confirmed, so I thought.</p><br/><p>However, oh well......</p><br/><p>About Hinata, is it because she saw her subordinates in a miserable condition?</p><br/><p>You reap what you sow, but this is just an excuse.</p><br/><p>It couldn’t be helped. To set up the fence again, so let’s become an enemy, huh?</p><br/><p>「I understand. It can’t be helped, I will be your opponent.</p><br/><p>However, no hard feelings in this! Can you swear if you lose fairly, you will not meddle with this country?」 (Rimuru)</p><br/><p>「......... I understand. Let’s promise, this match is the last!」 (Hinata)</p><br/><p>I believe in you, Hinata.</p><br/><p>Unlike the previous time, the hesitation inside Hinata’s eyes was gone.</p><br/><p>It also didn’t look like she was exacting the revenge for the poor treatment of holy knights, maybe it’s because she had properly listened to my words.</p><br/><p>That’s good. You can’t stay stubborn all the time.</p><br/><p>Well then, this was the last match.</p><br/><p>While holding each one’s sword, we closed our distance together.</p><br/><p>Everyone, including the holy knights, were watching us intently.</p><br/><p>What is Justice, tedious talk is also not good.</p><br/><p>In the end, although it was annoying to resort to violence, it was easy to understand.</p><br/><p>To bet their beliefs, the fight between two people had restarted.</p><br/><p>……… </p><br/><p>…… </p><br/><p>…</p><br/><p>However.</p><br/><p>Frankly, there was no possibility for me to lose.</p><br/><p>After all, there was『Future Attack Prediction』.</p><br/><p>Although Holy attribute can pierce through Covenant King Uriel’s Absolute Defense, I already have eyes that can see all the sword lines.</p><br/><p>Having such thoughts, I must never think carelessly.</p><br/><p>In my vision, 『Future Attack Prediction』 emitted light for the line of all predicted attacks</p><br/><p>Nn???</p><br/><p>Surprised. What was the meaning of this? To me, who was having such thoughts, </p><br/><p>《Notification. The Individual: Sakaguchi Hinata’s growth was confirmed. She most likely posses “Hero’s Egg”.</p><br/><p>Because of this reason, she has become an existence that surpasses logic, and because of this result, she seemed to gain a resistance against Result Prediction System’s ability.》</p><br/><p>In other word, I must avoid using my own power?</p><br/><p>Why did this happen! Didn’t I have the upper hand during the previous positions?</p><br/><p>To grow in the middle of the fight, although it was wonderful, to happen at this time was too much!</p><br/><p>Damn, what the hell does this mean! Seriously,</p><br/><p>Even the Gluttonous King Beelzebub vanished in the fight before......</p><br/><p>While thinking such things, I desperately warded off Hinata’s sword.</p><br/><p>Even though she became “Hero’s Egg”, it seemed to not strengthen her suddenly.</p><br/><p>That was a relief. Because I can still deal with her somehow.</p><br/><p>However, I can’t win just by evading. There must something that I can do if not....</p><br/><p>Towards me who was lost in thoughts,</p><br/><p>《Notification. There is no problem. Gluttonous King Beelzebub’s revival is possible.》</p><br/><p>Huh? Wasn’t it annihilated....... </p><br/><p>《Notification. Although it was annihilated, it was possible to revive it, there was no problem.》</p><br/><p>What the past tense for! Even so shouldn’t you say that earlier! Shouldn’t you?</p><br/><p>I was wavering between delight and annoyance, Wisdom King Raphael let out an even more explosive statement.</p><br/><p>《Notification. Should Covenant King Uriel’s Absolute Defense be activated? YES/NO 》</p><br/><p>Hey! Why didn’t you activated it since a little while ago?</p><br/><p>To my question, Wisdom King Raphael answered about this matter, I almost reached the limit of my surprise.</p><br/><p>Anyway, </p><br/><p>《Solution. Holy attribute can pass through Covenant King Uriel’s Absolute Defense.</p><br/><p>Therefore, there was no point to activate it. 》</p><br/><p>Etc, so it announced.</p><br/><p>Even a perfectionist has a limit.</p><br/><p>During the fight with Hinata before, it said that the movement of Holy attribute’s attack was impossible to predict.</p><br/><p>Based on Raphael’s analysis, about why it was possible to penetrate the Absolute Defense was because its substance was only “Spirit Substance” and “Shadow Substance”. It could pass because Absolute Defense’s barrier which only protects against Magic Power.</p><br/><p>Raphael had reasoned that because it makes small scale moves at random, prediction of its contact point was impossible.</p><br/><p>So why was Raphael talking about this while filled with confidence?</p><br/><p>In other words, it means that Raphael had devised a perfect way to defend against Hinata’s attack, right?</p><br/><p>《Solution. Not long ago, the data of Melt Slash [5] that annihilated Gluttonous King Beelzebub was collected.</p><br/><p>The result, Holy Sword technique: Melt Slash was acquired.</p><br/><p>In this case, it was an event not covered in the prediction; it was now possible to percept the law of Spirit Substance’s movement.》[6]</p><br/><p>Hmm.......</p><br/><p>Nn? Wait a minute, waaiiiit a minute.</p><br/><p>Eh? So that means, even If I received a direct hit from Hinata’s sword a while ago, there was a possibility that I wouldn’t receive any damage?</p><br/><p>《……》</p><br/><p>Oi! You ignoring me? This bastard.......</p><br/><p>So it means, not answering was the answer, huh?</p><br/><p>Eh? But.....</p><br/><p>Wait a minute, even if I received the direct hit from Hinata’s Melt Slash before, I would not die?</p><br/><p>《Solution. Of course. There was a possibility to receive large damage, but it was also possible to regenerate immediately.》</p><br/><p>Then, why did it seem like you were panicking? Perhaps......... it was because you wanted me to eat and analyze Melt Slash, right?[7]</p><br/><p>《……》</p><br/><p>Oh! You still don’t want to answer again!</p><br/><p>This fellow, gradually the response becomes high class. If it is compared to Human, it was good at scheming.</p><br/><p>Even if it had an ego, I could honestly believe it.</p><br/><p>........But, certainly. It’s because that was something I had wished for.</p><br/><p>Can I withstand that attack? Can I also use it?</p><br/><p>In that moment it understood my wishes and immediately executed it, huh? This ability (Raphael) was no joke (overpowered).</p><br/><p>This ability was way too good for someone like me.</p><br/><p>《No. I only exist for Master’s sake》 [8]</p><br/><p>You immediately refuted it.</p><br/><p>Humph, thank you.</p><br/><p>Hereafter, I will be relying on you, Partner! But... I beg you to not do something secretly.</p><br/><p>Inside Thought Acceleration, the exchange between Wisdom King Raphael and I ended instantly.</p><br/><p>And, invoking Covenant King Uriel’s Absolute Defense, my left hand caught Hinata’s sword.</p><br/><p>Astonished, Hinata opened her eyes wide.</p><br/><p>That was so. In my life, that was the fastest strike.</p><br/><p>Facing Hinata, </p><br/><p>「Complete victory for me, Hinata!」[9]</p><br/><p>So I announce it, I use Melt Slash.</p><br/><p>A shining flash.</p><br/><p>A strike flash that even eyes cannot follow, the sword in Hinata’s hand was broken, and then the strike stops right before Hinata’s neck.</p><br/><p>The match was decided.</p><br/><p>Hinata was frozen because of the surprise but, </p><br/><p>「It was my complete defeat, Rimuru. You may do anything you like........」</p><br/><p>So she muttered, and closed her eyes.</p><br/><p>The fight was over with my victory.</p><br/><p>Well then.</p><br/><p>Finally, it seems Hinata has become meek to me, did she finally agree to listen to my words? </p><br/><p>Thus, the Holy Knights’ attack was completely fended off.</p><br/><p>Or precisely, I felt it was too one-sided. I think I would deliberately pretend to have never seen it.</p><br/><p>The cleaning up afterwards will be difficult, but the problem was solved for the time being.</p><br/><p>[1] Thought Restraint () will change after there more explanation about this ability</p><br/><p>[2]  (テキ) = Reality (Enemy) double meaning</p><br/><p>[3] It means 10-19 years ago.</p><br/><p>[4] Shion use Kono monotachi.... Mono rarely used for people, it mainly used for things. So Shion really look down on them.</p><br/><p>[5](メルトスラッシュ) = Houmareikozan -&gt; Spirit Destroying Magic Slash (Melt Slash)</p><br/><p>[6] I dub this Spiritodynamic. (The study of movement / change of Spirit Substance)</p><br/><p>[7] Rimuru was tricked by Rimuru’s own skill?</p><br/><p>[8] Damn it Rimuru, just take it/she as your main waifu, and ditch Shion!</p><br/><p>[9] TITLE DROP!</p><br/><p>TL: thanks to Steve-san for the edit.</p><br/>\n</div>"}