{"title": "Chapter 94 – Mastermind", "id": 94, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-94-%E2%80%93-mastermind", "volume_title": "Volume 1", "body": "<h1>Chapter 94 – Mastermind</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner</p><br/><p>Tables filled with food, faces full of smile, expensive alcohol, and an otherwise nauseating atmosphere. A group of perhaps the least honest people employed in honorable fields were gathered here. Human traffickers employed by the army, politicians who managed drug distribution channels, doctors who killed and sold patient organs. Of course, Doctor Oda was among them. After all, tonight was a feast, with a bewitching main attraction.</p><br/><p>「Oda-sensei, I hear you have prepared another wonderful “gift” for us?」</p><br/><p>One of the guests asked.</p><br/><p>「Hah. I bet you will be surprised. I trust the previous one you have thoroughly enjoyed?」</p><br/><p>The doctor said with a wicked smile.</p><br/><p>「That would be an understatement. But where have you found this “merchandise” and how prone is it to… create problems?」</p><br/><p>「Why, it is twin of the previous one. And, after I retract her registration tomorrow, she’ll just be another crazy person on the streets.」</p><br/><p>「Careful doctor, not “her”, “it”.」</p><br/><p>The two men laughed. But in reality, Doctor Oda was slightly worried, as the attraction has yet to show herself. Surely she was supposed to arrive ten minutes ago, nor was she in a state where she could refuse. So where was she?</p><br/><p>And then, the door to the balcony looking over the hall opened, and out stepped out a young girl. A cruel smile on her face.</p><br/><p>.</p><br/><p>.</p><br/><p>Saint Demon Confrontation Arc</p><br/><p>094. Mastermind</p><br/><p>Sakaguchi Hinata thought herself fortunate to have been able to meet Izawa Shizue.</p><br/><p>Though the time they spent to together was truly short, only to Shizue was Hinata able to truly open up her heart.</p><br/><p>A single month.</p><br/><p>In that short time, she had stolen all her skills and left her.</p><br/><p>She was afraid to be rejected. As her theft ability was terrifying.</p><br/><p>Moreover,</p><br/><p>「We’re bothering Shizu-san.</p><br/><p>The Association is not so rich as to support people who don’t work.</p><br/><p>So would you like to work together with me?」</p><br/><p>So said a boy from her world.</p><br/><p>She understood that he was simply trying to recruit her, but his words – that they were being a bother – deeply hurt her.</p><br/><p>That’s when Hinata decided to leave.</p><br/><p>When she was setting off, these were the boys parting words,</p><br/><p>「We’ll definitely meet again! When we do, help me!」</p><br/><p>She took those words literally.</p><br/><p>Lacking in information, Hinata opened her heart up to the boy just because he was a fellow World Traveler.</p><br/><p>So she nodded at his words without any hesitation.</p><br/><p>And set off on a journey.</p><br/><p>A world filled with despair, where life could be taken easily, such a world.</p><br/><p>She obtained power in order to survive.</p><br/><p>A country she was staying in got attacked,</p><br/><p>By a Disaster-class monster, leaving many people dead. There were plenty people fighting to protect the children.</p><br/><p>The adults would not run away, but would desperately attempt to shield their children.</p><br/><p>Even though she had thought they would run away without a second thought trying to save themselves.</p><br/><p>Those fighting were called the Knights Templar (Holy Knights).</p><br/><p>They would at times be passing through this city on patrol, protecting the people and enforcing justice.</p><br/><p>“That’s where I want to live,” Hinata felt.</p><br/><p>And thus without a doubt…</p><br/><p>Ten years had passed.</p><br/><p>Though Hinata did not believe in god, she had reached one of the highest posts in the church.</p><br/><p>An ironic tale perhaps, but she was performing the sacred duty of protecting the lives of people and the citizens of the Holy Empire of Ruberion.</p><br/><p>Hinata did not doubt anything, and believed this to be her justice.</p><br/><p>Live for others. Even at the cost of your own life.</p><br/><p>If you did so, then everyone could be happy. Similarly, the monsters must be destroyed.</p><br/><p>Since every single time, it was the monsters that threatened the peoples’ happy lives.</p><br/><p>Though the capital was protected by a barrier, the same was not true for the cities and villages in the region.</p><br/><p>The patrolling knights decreased the number of casualties while fighting off daily onslaught of monsters.</p><br/><p>Unlike the monsters of Jura Forest region, these had no other food source.</p><br/><p>A desolate wasteland spread to the west.</p><br/><p>A result of a battle between two demon lord-like beings.</p><br/><p>This wasteland has many areas of dense miasma from which monsters spawn. Thus, the knights embody the peoples’ hope itself.</p><br/><p>There have been times when the knights have been deceived and killed by monsters.</p><br/><p>Due to these occurrences, the church decreed dealing with a monster was strictly forbidden.</p><br/><p>This creed conveyed the many hundred year long wisdom of the knights who had survived while protecting people.</p><br/><p>And at some point, Hinata had decided that peoples’ happiness was directly connected to this creed.</p><br/><p>Though she did not originally believe the creed, she was won over by its logic.</p><br/><p>And, at some point…</p><br/><p>She decided that protecting the creed was her justice, a truly ironic tale.</p><br/><p>The days spent fighting the monsters.</p><br/><p>When was it that she found this routine boring&gt;</p><br/><p>The day she became squad captain and started drafting plans, the number of casualties greatly decreased.</p><br/><p>That was thanks to her Monster Spawn point prediction and Casualty prediction. Methods of communication, and patrol timing.</p><br/><p>Thus people began to see the results of her optimization of the system.</p><br/><p>This is why the knights have so much faith in Hinata, she thought.</p><br/><p>This is why she absolutely could not violate the creed.</p><br/><p>She has the responsibility, the mission to protect the people.</p><br/><p>Having received the trust of her subordinates, she created a place to return to.</p><br/><p>Even Nicholas claimed to love her…</p><br/><p>In the end, Hinata was simply afraid.</p><br/><p>Even though she tried not to get attached to anything, she was still afraid of losing everything.</p><br/><p>People could live happily only under complete control.</p><br/><p>Hinata so believed.</p><br/><p>And the existence of the Controlled Society Ruberius only proved her point.</p><br/><p>That’s how it was supposed to be.</p><br/><p>Which is why, like always,</p><br/><p>She only needed to defeat monsters; that is all.</p><br/><p>A simple point. But that’s how it was.</p><br/><p>Protecting the creed was her reason to exist, her justice.</p><br/><p>Such was her warped heart that never knew parental love.</p><br/><p>This belief was the only thing that supported her heart.</p><br/><p>To protect that belief, she decided to fight.</p><br/><p>And, now.</p><br/><p>Things were so bad, she wanted to laugh.</p><br/><p>But as a result, she made a breakthrough.</p><br/><p>She simply stopped worrying, stopped thinking.</p><br/><p>Was she right, was she wrong? Not even that mattered anymore.</p><br/><p>She could not see the amount of power of the enemy before her even with『Mathematician』skill.</p><br/><p>An enemy clearly above her. Worlds apart from his previous strength. She could only lament having let him escape last time.</p><br/><p>Her tedious days,</p><br/><p>Would now come to an end.</p><br/><p>Fighting a losing battle is a fool’s action. Even so, Hinata was excited.</p><br/><p>(Am I wrong? In that case… prove it, Demon Lord Rimuru!)</p><br/><p>She drew the large sword, Dragon Slayer, from its scabbard to oppose the demon lord.</p><br/><p>A thin smile appeared on her face.</p><br/><p>And with her heart elated, sword pointing at Rimuru, she advanced.</p><br/><p>＊ ＊ ＊</p><br/><p>I again considered my fight with her.</p><br/><p>This girl leaves no openings.</p><br/><p>Thanks to thought acceleration, I am currently able to perfectly receive her hits.</p><br/><p>After a brief exchange, though my attacks don’t even scratch her, hers seem to be able to scratch me.</p><br/><p>Not that they don’t though–not that I can be proud of that.</p><br/><p>Which is why, we’re currently trying to exploit an opportunity or a mistake made by the other, but none had presented itself yet.</p><br/><p>Hinata is a real beast to be able to fight me like this even after I awakened as a Demon Lord and have Raphael’s support.</p><br/><p>Frankly, I had expected myself to overwhelm her.</p><br/><p>She seems to be able to easily read my sword, and blocks it without fail. And, responds with a accurate slashes.</p><br/><p>Last time, I was truly not a threat.</p><br/><p>Moreover, she didn’t even go all out last time.</p><br/><p>While lightly blocking her attacks, I observe Hinata.</p><br/><p>A faint smile on her lips, she is looking straight at me.</p><br/><p>But, her eyes don’t reflect our movement. Her eyes are moving like sensors trying to observe the entire area around us.</p><br/><p>Her posture does not waver, she is able to keep up a natural pose ready to counter any attack.</p><br/><p>Her movements don’t depend on strength and seem to originate from nowhere.</p><br/><p>I am not sure how she is able to so easily predict my attacks, but it’s clear that she knows.</p><br/><p>Whereas I, when I see her attack, I just desperately try to evade it.</p><br/><p>Of course, I’m the one with lots of wasted movement.</p><br/><p>Because I have enough power to overwhelm her, I can dodge without being hit.</p><br/><p>Our proficiency levels cannot be compared–Hinata is far higher.</p><br/><p>Even so, she does not let her guard down.</p><br/><p>At this point, all her tricks and skills have been rendered meaningless, so she fights me with a sword clad in her fighting spirit.</p><br/><p>That spirit being of the Holy Affinity, I will probably be hurt if I get hit by that.</p><br/><p>According to Raphael, the special ability of that sword will let it cut through even my barrier.</p><br/><p>Well, I guess depending on the reliable sword rather than on gaudy skills is just what I would expect from Hinata.</p><br/><p>In reality, other than me, only Hakurou could defend against her attacks.</p><br/><p>But, Hakurou would not be able to win by relying on magic attacks.</p><br/><p>Whereas Hinata has decided that magic attacks would not be effective against me, hence decided not to use them.</p><br/><p>She is a fighting genius.</p><br/><p>Even if I send out my clone to fight, she will probably cut it down in a second.</p><br/><p>One of the only weaknesses of ultimate skills is that only the true body can use them.</p><br/><p>In other words, even I were to project a copy or create a clone,</p><br/><p>While I could use the skills by moving my consciousness to them, multiple “me” cannot.</p><br/><p>I cannot leave ultimate skills to clones.</p><br/><p>The same is true for unique skills, although the copy does possess some of the skills of the true body, these are not perfectly copied.</p><br/><p>Souei has gotten good at this and can bestow only the useful skills to his clones.</p><br/><p>At a time like this, where I am fighting with the support from an ultimate skill, a cheap clone will quickly be hit and vanish.</p><br/><p>It would be great if a clone could create an opportunity for me to strike at her, but if that backfires… I’ll die from embarrassment.</p><br/><p>A simple plan would be to focus on Hinata’s endurance. I mean, I never tire.</p><br/><p>Even if neither one of us lands a hit, time still passes.</p><br/><p>But, it seems like the surrounding battles have finished.</p><br/><p>Some people are lying down, others are sitting on the ground, all seem to be exhausted and unable to move.</p><br/><p>But, their eyes are glued to our battle.</p><br/><p>They certainly cannot follow our attacks, so are they just trying to ascertain the result?</p><br/><p>Anyways, I don’t have the time to be looking around.</p><br/><p>I have to resist Hinata with all my strength.</p><br/><p>The land is filled with the sound of our clashes.</p><br/><p>The sword Hinata held, the one as large as she is, had an edge that looked like as if it was made of blue crystal.</p><br/><p>It was a beautiful sword.</p><br/><p>As if not feeling its weight, with a speed unimaginable for its size, Hinata wielded it freely.</p><br/><p>She’s probably depending on some skill for that, but it’s still marvelous sword play.</p><br/><p>And her expression,</p><br/><p>Now… it is that of an innocent girl, a smile on her face.</p><br/><p>Not the cold sneer that she carried before.</p><br/><p>She is simply swinging her sword. Without thinking about anything else, focused on the battle.</p><br/><p>A genius, huh.</p><br/><p>If I think about it, I was fortunate.</p><br/><p>I’ve had my share of troubles, but after being born as a monster, I made some friends and had lots of fun.</p><br/><p>What about Hinata?</p><br/><p>According to what Shizu-san had said, after obtaining all her skills in a single month, Hinata had left.</p><br/><p>I hadn’t noticed it before, but there’s something strange about this.</p><br/><p>Would Shizu-san really allow Hinata to go off on her own? That’s a point I find strange.</p><br/><p>And that it truly is.</p><br/><p>A power too strong for a girl with a mind of someone who was going through puberty or just finished.</p><br/><p>Is it because I am an adult that I noticed it?</p><br/><p>Aside from Hinata as she is now, in that unbalanced state she was given a Dominance-type skill.</p><br/><p>Could you possibly allow her to leave?</p><br/><p>Considering this suspicion, and using other information I had gathered, I had Raphael run an analysis.</p><br/><p>The result was a truly questionable possibility. That is, Hinata’s thought process has been restricted.</p><br/><p>That could only have been possibly in the first months of coming to this world.</p><br/><p>Though I haven’t obtained all of Shizu-san’s memories, the original Hinata was rather meek.</p><br/><p>To suddenly decide to go on a journey after a single month…</p><br/><p>Moreover, considering the presence of one more person by Shizu-san’s and Hinata’s side…</p><br/><p>「Hey, why did you decide to leave Shizu-san’s place?」</p><br/><p>I asked as if catching my breath during our sword fight.</p><br/><p>I have gotten used to her timing. Blocking her attacks is not much of a challenge now.</p><br/><p>Seems like I had lots of room for improvement.</p><br/><p>In comparison, Hinata is not struggling, but sweat had appeared on her face.</p><br/><p>An obvious result considering that she is fighting with all her strength.</p><br/><p>Moreover,</p><br/><p>「Why do you ask so now? I don’t want to remember, but let’s see…</p><br/><p>Cause I didn’t want to be a bother, I think」</p><br/><p>She honestly replied.</p><br/><p>I didn’t expect an answer, thinking she was going to just ignore the question, so I’m surprised.</p><br/><p>But when I heard the response, I felt pain in my heart.</p><br/><p>Hmm? Pain in my heart? What a strange sensation.</p><br/><p>Thinking that it’s not a problem even if I were to ignore the response, I put more strength into my sword. Our clashes now created shockwaves.</p><br/><p>「Shizu-san had never thought you a bother though?」</p><br/><p>(Yes. I never thought so…)</p><br/><p>「Fu, now of all time… And please don’t speak of Shizu-san」</p><br/><p>She increased the sharpness of her attacks.</p><br/><p>Seems like she has yet to go all out.</p><br/><p>Let’s wait and see.</p><br/><p>While desperately blocking the sword and countering,</p><br/><p>「But, she was worried! That she made you lonely!」</p><br/><p>(Right… I was worried. But… there was someone else I had to worry more about)</p><br/><p>Eh?</p><br/><p>I wasn’t just hearing things a second ago, right?</p><br/><p>Hearing Shizu-san’s voice…</p><br/><p>「Ha! Don’t say it like you know! What could someone like you understand!!」</p><br/><p>My words angered the calm Hinata.</p><br/><p>She seems very mad. Faster than I could think about the reason,</p><br/><p>「You let your guard down, it’s my win! Melting Slash!!」</p><br/><p>The speed of her swings again accelerated becoming light itself.</p><br/><p>That sword, wrapped in various types of magic,</p><br/><p>≪Announcement. Impossible to block. Impossible to evade!!≫</p><br/><p>(Damn! That can actually kill me?!)</p><br/><p>First time I heard Raphael’s worried voice.</p><br/><p>And, accelerating my thoughts to 10 million times the norm, I could only slowly watch as the sword approached me.</p><br/><p>At that angle, with such timing.</p><br/><p>I cannot evade, barriers are useless, but I guess I can try to move my consciousness into a clone.</p><br/><p>But, since that attack fires off a light that erases everything. If I use the skill a moment too late, I’ll be burned to death.</p><br/><p>Did she respond to get me to lower my guard?</p><br/><p>Didn’t seem that way, but as a result she got me.</p><br/><p>≪Announcement. I propose annihilating it using Gluttonous King Beelzebub. Please do not give up≫</p><br/><p>Raphael advised the course of action that the highest chance of success.</p><br/><p>And as Raphael said, I will be activating Beelzebub.</p><br/><p>The moment her sword touches me, I’ll have Beelzebub eat the sword and the skill.</p><br/><p>If that fails, I might disappear.</p><br/><p>But there’s no room for hesitation.</p><br/><p>I trusted Raphael, and activated Beeelzebub at that precise moment.</p><br/><p>…………</p><br/><p>……</p><br/><p>…</p><br/><p>The result, I survived.</p><br/><p>I thought I would die, but I survived.</p><br/><p>Hinata opened her eyes and looked at me.</p><br/><p>For but a brief second.</p><br/><p>She soon readied her sword and came at me again.</p><br/><p>I, personally, was still in the process of being happy about surviving, but I guess fighting her comes first.</p><br/><p>Seriously, this girl, so dangerous!</p><br/><p>Honestly, the moment her skill touched me, a lot of my magic energy had disappeared.</p><br/><p>If converted into HP, I’d say about 50% was gone.</p><br/><p>Well, I did survive though…</p><br/><p>I won’t let my guard down again.</p><br/><p>Actually, the only reason I did in the first place was because I started hearing Shizu-san’s voice for some reason.</p><br/><p>While thus complaining and blocking her attacks…</p><br/><p>≪Announcement.『Future Attack Prediction』has been acquired. Activate? [YES]/[NO]≫</p><br/><p>I almost screamed in surprise.</p><br/><p>Suddenly, Raphael had acquired a new skill.</p><br/><p>What a great person Raphael is.</p><br/><p>While observing Hinata I had been trying to predict her movements, so maybe because of that… let’s just go with that.</p><br/><p>I hastily activated it.</p><br/><p>A number of lights appeared before me. Though it’s a sense, I actually visualize it?</p><br/><p>A single light fired at me.</p><br/><p>I moved my sword in anticipation of the light, and interestingly enough it blocked Hinata’s sword perfectly.</p><br/><p>It seems like that light</p><br/><p>That light originates from her posture and displays possible attacks which follow a displayed trajectory.</p><br/><p>If she’s trying to do something, the lights turn black.</p><br/><p>In this case, prediction is impossible, but it means a real attack is coming soon.</p><br/><p>In other words, feints and the like can now be calculated.</p><br/><p>A master like Hinata can certainly use attacks that cannot be anticipated.</p><br/><p>But what’s scary about this skill is that it does not predict the attack but the result.</p><br/><p>That is, even if the chances are low, only a specific attack could follow the prediction line.</p><br/><p>If that’s the case… Hinata’s not a threat anymore.</p><br/><p>Her flowing attacks all predicted with『Future Attack Prediction』, I easily flick away her sword.</p><br/><p>It’s the end! I won’t kill you, but I’ll have you feel some pain!</p><br/><p>While I was thinking this, I lowered my sword, only to have an unbelievable illusion appear before me.</p><br/><p>Both of her hands outstretched, Shizu san stood in front of me.</p><br/><p>With no burn marks, a face of an adult without a mask.</p><br/><p>Her face older than mine, and a calm aura about her.</p><br/><p>Hinata seemed to also be able to see this illusion as she angrily scowled at me.</p><br/><p>And to both of us,</p><br/><p>(Rimuru, and Hinata. No one else)</p><br/><p>No way…</p><br/><p>An illusion can talk?</p><br/><p>Hinata seemed to be able to hear it, cause she just sat there.</p><br/><p>And… suddenly, my sword was pressing against her neck.</p><br/><p>At that moment, time seemed to stop.</p><br/><p>This is… though acceleration? And I am linked with Hinata?</p><br/><p>「What did you do? What the hell are you planning?」</p><br/><p>Her eyes bloodshot, Hinata asked.</p><br/><p>I don’t remember thrusting at her at all.</p><br/><p>But, I am the one who wants to ask.</p><br/><p>「No idea! I want to know myself!」</p><br/><p>Though she seems as if about to disappear, I can see a phantom of Shizu-san.</p><br/><p>A slight smile on her face, she so said to us.</p><br/><p>(I’ll borrow a little of your time. Would you listen to me?)</p><br/><p>And, the phantom began to speak.</p><br/><p>Her words dispelled all of my suspicions, or rather, it confirmed all of my hypotheses.</p><br/><p>In other words, the original cause of all of this.</p><br/><p>Why did Shizu-san abandon Hinata?</p><br/><p>And, are Hinata’s thoughts limited?</p><br/><p>These questions.</p><br/><p>These were all answered by her words.</p><br/><p>(I’ll be frank. I worried about Kagurazaka Yuuki.</p><br/><p>I knew that Hinata was strong. But even so, choosing him even I found strange.</p><br/><p>Now I understand. My thoughts were restricted. By his ability…)</p><br/><p>「No way! Yuuki would never do that!」</p><br/><p>Interrupting Hinata, Shizu-san shook her head and continued.</p><br/><p>(You are also affected, Hinata. Even now you are…)</p><br/><p>She said with a pained voice.</p><br/><p>Hinata had nothing to say in response.</p><br/><p>That’s to be expected. She was just told she had been manipulated up until now.</p><br/><p>But, these words confirmed my own conclusions.</p><br/><p>“Right…” I said, satisfied.</p><br/><p>Now the doubts have been cleared.</p><br/><p>As there was a person who willingly manipulated a single girl who thought that if she tried hard enough, someone would one day be nice to her.</p><br/><p>That culprit is…</p><br/><p>「In other words, Kagurazaka Yuuki is the mastermind behind all of this?」</p><br/><p>Surprised at my question, Shizu turned around and with a distraught face nodded.</p><br/><p>As I thought.</p><br/><p>Now everything makes sense.</p><br/><p>At this moment, a flame of anger against the mastermind was lit within me.</p><br/>\n</div>"}