{"title": "Chapter 100 – Underground Labyrinth", "id": 100, "volume": 1, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-100-%E2%80%93-underground-labyrinth", "volume_title": "Volume 1", "body": "<h1>Chapter 100 – Underground Labyrinth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Alas, after struggle, I am finally done!</p><br/><p>Oh how happy I am!</p><br/><p>I must admit that it was fun.</p><br/><p>The rhyme here sucks, which I do admit.</p><br/><p>But I finished this chapter!</p><br/><p>So to boast please do permit.</p><br/><p>Anyways, please do enjoy this, though it took a while.</p><br/><p>And let me sleep.</p><br/><p>Since I’ve got work left–and it’s quite a pile.</p><br/><p>Crappy poetry aside, I apologize for the delay.</p><br/><p>~Clown</p><br/><p>Founding Demon Capital Arc</p><br/><p>100. Underground Labyrinth</p><br/><p>After finishing the meeting with Fuze, I headed back to Tempest.</p><br/><p>I can move to any previously visited location via『Spatial Travel』you see.</p><br/><p>It does use up some magic energy, but my reserves are so vast that I don’t even feel it.</p><br/><p>So it’s a super useful skill that lets me transfer to places without any detriment.</p><br/><p>When I neared the city, Gerudo contacted me via telepathy.</p><br/><p>(We seek your immediate guidance, Rimuru-sama!)</p><br/><p>What could be wrong?</p><br/><p>With that thought, I transferred to Gerudo.</p><br/><p>In a leap completed in a single moment, I head towards Gerudo. It truly is a very useful skill.</p><br/><p>Not that I’m going to appear right by his side, rather I am going materialize in the near vicinity.</p><br/><p>If necessary, I could appear exactly on a desired spot, but this time let’s transfer a little further away.</p><br/><p>Well, in fact, since it’s a place I’ve visited before, I don’t actually need to focus on transferring to the individual.</p><br/><p>And at this point it’s easier to move towards him by foot.</p><br/><p>Gerudo was at the tunnel that Veldora had blown up.</p><br/><p>Pieces of demon steel were spread across the landscape barely obscuring the ruined tunnel.</p><br/><p>I had ordered it to be restored, yet no work seems to have been done.</p><br/><p>I wonder why?</p><br/><p>Gerudo seems to be arguing with somebody.</p><br/><p>「I’m telling you~! We’re now occupying these tunnels!」</p><br/><p>「Even if so you say, we have not recognized your claims.</p><br/><p>Please allow me to consult Rimuru-sama first.」</p><br/><p>「No way! Can’t you see, we’ve abandoned the labyrinth?!</p><br/><p>Are you seriously planning on making us homeless?」</p><br/><p>「No one is saying that. By the way, stop trying to sneak demon steel out of here.」</p><br/><p>「Tch. How sharp! Don’t sweat the small things, or my Beretta will–Wha!!」</p><br/><p>Erasing my presence, I successfully captured Ramiris.</p><br/><p>And looked her right in the face.</p><br/><p>No question about it, it’s Ramiris.</p><br/><p>「What the hell are you doing?」</p><br/><p>「Y-yahoo! What’s up, Rimuru?」</p><br/><p>Averting her eyes, Ramiris greeted me.</p><br/><p>Even without asking, I know exactly what she was planning on doing.</p><br/><p>She’s planning on claiming the demon steel and connecting the tunnel into the labyrinth.</p><br/><p>She’s said something about building an entrance around here before, after all.</p><br/><p>「So, you were planning on building a labyrinth here and you were discovered by Gerudo?」</p><br/><p>「Eh… no, there’s now way… I think. Maybe…?」</p><br/><p>「In other words, I’m right. Seriously…」</p><br/><p>「Aha, ahahaha…..」</p><br/><p>She tried laughing the matter off.</p><br/><p>Looking around, there’s a clear need to reclaim the resources and repair the land, I thought.</p><br/><p>But, maybe it’s a good idea to have her build the labyrinth here after all?</p><br/><p>I mean, think about my last conversation with Myormiles.</p><br/><p>We want people to continuously revisit Tempest.</p><br/><p>But, perhaps not every day, but at least every season.</p><br/><p>So, is there something we could do that would attract people that often?</p><br/><p>For example… how about we create a dungeon (labyrinth)?</p><br/><p>This might be a good idea.</p><br/><p>I look at Ramiris. Without a care, she’s just smiling at me.</p><br/><p>She’s a little… no, she’s very unreliable, but maybe she’ll manage.</p><br/><p>Steeling myself, I expressed my proposal.</p><br/><p>＊ ＊ ＊</p><br/><p>My proposal.</p><br/><p>It’s very simple, really.</p><br/><p>I’ll have Ramiris create a labyrinth and act as it’s manager.</p><br/><p>And we’ll thus have the labyrinth generate some profit.</p><br/><p>Ramiris will live there, and I’ll get some pocket change.</p><br/><p>Of course, this idea requires her complete support, but she doesn’t seem opposed to it?</p><br/><p>In fact, when I disclosed the plan,</p><br/><p>「Eh, eh? In other words, I can make a labyrinth here?!</p><br/><p>…Actually… could this be a chance to finally dispel that horrid nickname: NEET?!」</p><br/><p>Opening her eyes wide, she exclaimed.</p><br/><p>Well, I did think of it more as a joke though.</p><br/><p>「U-umm… it is true that I can earn some money this way?」</p><br/><p>Swallowing hard, she asked me with a serious expression.</p><br/><p>She’s probably afraid that I’ll change my mind.</p><br/><p>Though there’s no way I would. Well, not like all my promises are enforceable, though.</p><br/><p>「I’m serious. But, I wouldn’t know how much profit we can make until we try it…</p><br/><p>Well, there will be related expenses, so how about 20% of the profits?」</p><br/><p>「Umm… how much would that be?」</p><br/><p>「Well, if a thousand adventurers visit in a single day, you’d be getting 2 gold coins.」</p><br/><p>「Geh!! S-s-such a f-f-fortune?!」</p><br/><p>「Well, actual earnings might be higher or lower than predicted.</p><br/><p>And since you need to build a place to live anyways, you don’t suffer as a result, right?」</p><br/><p>She violently shook her head.</p><br/><p>In the first place, had she built the labyrinth anywhere she wanted, she would still have to maintain it.</p><br/><p>So there was nothing disagreeable about this.</p><br/><p>She hugged me tightly out of joy.</p><br/><p>Since both parties seem satisfied, this will become another project that I will oversee.</p><br/><p>Adding Gerudo to our discussion, we polish out the details.</p><br/><p>First, we have overnight plans to lay a road from the city here.</p><br/><p>It’s a trip that wouldn’t even take half a day.</p><br/><p>We had chosen this place as it was on the outer perimeter of the city.</p><br/><p>About 10 km away, I’d like to say? Once the road is done, we also plan to build a stable nearby.</p><br/><p>We had wanted to lay rails to transport people and baggage from here.</p><br/><p>Since letting horses and magic beasts into the city would lead to new hygienic problems.</p><br/><p>Reclaiming the demon steel is necessary for that goal, but I can just prepare some more.</p><br/><p>Since it’s relatively close to the city, an inn here would unlikely bring many customers.</p><br/><p>So, we decided to build a motel instead.</p><br/><p>But if we will build a labyrinth here, then an inn would be in order.</p><br/><p>If they wanted to truly relax, they could always come back to Tempest. It’s a good idea to keep work housing and home separate.</p><br/><p>And if we build a labyrinth here we are bound to attract some adventurers.</p><br/><p>It might be a good idea to also service the carriages coming to and from the Dwarf Kingdom and the (ex) Farmas Kingdom.</p><br/><p>Drawing up the plan, I have Gerudo confirm it.</p><br/><p>He finds it acceptable.</p><br/><p>Moreover, the site of our battle with the knights is only a few steps away.</p><br/><p>Two kilometers towards the city, where a number of roads intersect, is the planned site of the arena.</p><br/><p>It’s relatively close to the city, so we expect the guests to walk there.</p><br/><p>Unlike our world, people tend to walk here.</p><br/><p>It’s unimaginable to not walk a round trip of less than 20 km. They also follow the early to bed, early to rise policy.</p><br/><p>So if we hold the tournament from 10:00~15:00, that should give them enough time to make the trip.</p><br/><p>As for the staff, we can probably have them stay at the inn.</p><br/><p>Having thus agreed with Gerudo, we moved on to discussing the arena blueprint.</p><br/><p>After talking to Myormiles, I finally envisioned how I wanted it to look.</p><br/><p>Normally, I would spend hours in front of my laptop creating the plan, but now I can do it by hand.</p><br/><p>Raphael really is useful at these minor things.</p><br/><p>Accepting my design with a “No problem”, Gerudo left.</p><br/><p>When I looked at Ramiris,</p><br/><p>「Uhehe… now even I will be making money, huh.</p><br/><p>Gone are the days when I was made fun of as the Poverty Demon Lord!」</p><br/><p>Is she tripping? She seems completely lost in her world.</p><br/><p>Well, I guess she’ll be fine.</p><br/><p>She’s been significantly ridiculed up until now.</p><br/><p>Though who has heard of a demon lord in want of money?</p><br/><p>(TL Note: “in want of” means to lack)</p><br/><p>Though more than money, not working is the problem I believe…</p><br/><p>True, Ramiris’ Labyrinth was rather devoid of… people.</p><br/><p>She was probably really bored and really lonely.</p><br/><p>I really hope adventurers show up. For Ramiris’ and my sake.</p><br/><p>Dragging Ramiris back into reality, we go over the detail of the labyrinth.</p><br/><p>Ramiris is showing a determined face, the likes that I never have seen from her before, and is ready to go.</p><br/><p>I had five questions for her.</p><br/><p>How many floors can be constructed underground?</p><br/><p>How many days would it take to finish?</p><br/><p>What about the monsters inside?</p><br/><p>Can interior layout be altered? Further, can treasure chests be set up?</p><br/><p>In case of death, could we set up a system where they are reborn on the surface?</p><br/><p>Is what I asked.</p><br/><p>Here’s what she answered.</p><br/><p>There’s no limit, but realistically, at most 100 floors.</p><br/><p>It’s possible to finish in a day. Thanks to species-skill『Labyrinth Creation』it can be created in a single moment. The interior aside.</p><br/><p>Whatever we wish since Spirits inhabited the previous one, they did not spawn. But, if magic concentration falls, only weak monsters will spawn.</p><br/><p>It’s possible. Actually, customizing the interior is one of the functions of her skills. It’s also possible to create a rotation of floor patterns, but only one floor at a time. If not the structure but the interior–that can be changed relatively simply.</p><br/><p>It’s possible. But, you would have to wear a special item created via『Labyrinth Creation』</p><br/><p>Is what she said</p><br/><p>「Wonderful! It’s wonderful, Ramiris-kun!」</p><br/><p>「Really, like really really? Am I really amazing?」</p><br/><p>「Yeah. Now our ambitions have overlapped!」</p><br/><p>「Really? I was just thinking the same thing」</p><br/><p>We nodded at each other.</p><br/><p>「I’m looking forward to working with you, Ramiris」</p><br/><p>「Yeah, I’ll be in your care. Joining a large organization is like riding a big ship. It’s reassuring」</p><br/><p>Big ship, huh. Let’s hope we’re not the Titanic.</p><br/><p>Since our sizes are different, we couldn’t really shake hands but we were one in spirit.</p><br/><p>I decided to have Ramiris take the demon steel scattered around.</p><br/><p>Since it seems that she will make something really useful.</p><br/><p>We continued to exchange ideas regarding the design and concept of the dungeon.</p><br/><p>While being very merry.</p><br/><p>Me and Ramiris “being merry” and discussing the dungeon.</p><br/><p>To say the least, our conversation went into a weird direction and we drafted out a design of a super advanced dungeon.</p><br/><p>Next is production.</p><br/><p>As Ramiris declared, it will easily be done by tomorrow.</p><br/><p>So promising to come visit, I return to the city.</p><br/><p>I need to have Kurobee hand over all those test armors and weapons that won’t be seeing the marketplace any time soon.</p><br/><p>「Is this fine, Rimuru-sama? These articles are imperfect and can hardly be used by the average person.」</p><br/><p>「Nah, it’s fine. I’ll leave these aside to receive the spirit’s blessing and have them soak up some magic energy.</p><br/><p>They might become magic items, you see」</p><br/><p>「Is that so. In that case, do as you see fit」</p><br/><p>He said and took out the products from the cellar.</p><br/><p>I accepted them and expressed my thanks.</p><br/><p>However, to think that he had so many trial products.</p><br/><p>At some point, he had added a hundred items to this list. There are full sets here as well, and all of these items are far better than what you would find being sold in a store.</p><br/><p>But, as Kurobee mentioned, these are imperfect items to which the user could never adjust to.</p><br/><p>So these can hardly be called tools.</p><br/><p>But in exchange for sucking up magical energy and converting it into raw strength, the user can temporarily obtain unbelievable physical power.</p><br/><p>Well, it’s not like you should only use it if you have a death wish, but only a fool would use an untested product.</p><br/><p>Not that I’d take responsibility for that, though.</p><br/><p>So what should I do about this product line?</p><br/><p>I’m actually playing on putting it into treasure chests inside the dungeon and having special monsters guard these.</p><br/><p>To think I would have a chance at a real life dungeon creator… this is too exciting.</p><br/><p>Well, it is true that just auctioning these products off would bring a lot of gold.</p><br/><p>Actually, that might be the best option.</p><br/><p>But, that’s no good. What’s most important is the ongoing advertisement of Tempest.</p><br/><p>If they see the beauty of our city and feel it’s charm, surely they will come again.</p><br/><p>Honestly, when I told Ramiris that she can create an entrance to her labyrinth, I originally intended it to be in the middle of the city.</p><br/><p>But, I soon realized the benefit of having a tavern town for adventurer’s convenience.</p><br/><p>Equipment and the like should be bought up in the city.</p><br/><p>Just think about how much money will be spent. Even if we stock up ahead of time, we’ll probably run out.</p><br/><p>With the money left over for maintenance and purchase of raw material, we can probably offer sales for return customers.</p><br/><p>That way, the adventurers will speak of us among themselves and Tempest will certainly gain fame.</p><br/><p>Moreover, it’s probably a good idea to keep the citizens busy.</p><br/><p>The Tournament will probably be held at most twice a year, but we’ll certainly hold other events.</p><br/><p>Military drills, adventurer tests.</p><br/><p>So we’ll definitely put all these buildings to use. And the dungeon will certainly draw even more attention.</p><br/><p>Thus, having assembled all these parts, I have finally decided to gain the one being necessary to make it all work out.</p><br/><p>Veldora.</p><br/><p>Veldora’s in my room.</p><br/><p>He’s grown very accustomed to it.</p><br/><p>「Hey, Veldora, I’ve got a favor to ask of you.」</p><br/><p>「Hmm? Can’t you see that I’m busy?」</p><br/><p>Yeah. You’re reading manga.</p><br/><p>And clearly have nothing to do.</p><br/><p>「I see… that’s too bad. And, I was just about to offer something fun to do.</p><br/><p>If you’re busy, it can’t be helped. I guess I’ll just ask Diablo」</p><br/><p>I said, and pretended to leave</p><br/><p>「Hey, wait up. I’m busy, but I’ll listen to your request.</p><br/><p>Speak!」</p><br/><p>Hook, line, and sinker.</p><br/><p>How easy to manipulate he is.</p><br/><p>It’s as easy to manipulate this old geezer as taking a candy from a baby.</p><br/><p>But that aside,</p><br/><p>「The thing is, we were thinking about building a dwelling for you.</p><br/><p>Ramiris and I were talking about it, and she’s currently building it.」</p><br/><p>「W-what did you say?! Seriously?</p><br/><p>But, why did you call it a favor?」</p><br/><p>Whether he’s deeply interested or not, he has a serious look on his face.</p><br/><p>Seriously… too easy.</p><br/><p>I told Veldora about the Dungeon plan.</p><br/><p>「So the thing is, we need a king to rule over the dungeon.</p><br/><p>Ramiris will supervise it. And, on the 100th floor we’ll create an entrance leading to the spirits’ labyrinth.</p><br/><p>We need a strongest guardian to protect this gate.」</p><br/><p>「I see… and you want me to do it?」</p><br/><p>「Exactly. And while in the labyrinth, I want you to constantly flaunt your aura」</p><br/><p>「Seriously? It’s okay?」</p><br/><p>「It is」</p><br/><p>I nodded.</p><br/><p>Frankly, I don’t care at all about the guardian.</p><br/><p>What I want is Veldora’s aura.</p><br/><p>If he releases it around here, it will so densely concentrate, that normal people won’t be able to survive.</p><br/><p>But if he keeps it in too long, releasing it will create an explosion like last time.</p><br/><p>So it’s probably not a good idea to keep it in that long. So there’s a need to release it.</p><br/><p>Which means, that we needed to find a place for him to do so…</p><br/><p>The cave of the seal could not completely restrain all of Veldora’s aura.</p><br/><p>That’s why I had the dungeon be made 100 floors deep and once he freely release his aura.</p><br/><p>And it’s true purpose…</p><br/><p>Once the magic concentration increases, monsters will naturally spawn.</p><br/><p>As it trickles upwards, the upper floors will certainly be occupied by small fry with strong beings further in.</p><br/><p>Even the cave had A- ranked Tempest Serpents spawn.</p><br/><p>Just what kind of monster will he spawn now, I can’t even begin to imagine it.</p><br/><p>Perhaps another intelligent slime will spawn among them.</p><br/><p>So Veldora releasing his aura will only benefit us.</p><br/><p>Killing two birds with one stone, essentially.</p><br/><p>「… And when I see adventurers,</p><br/><p>『Kuahahaha, you have done well coming this far! Let me welcome you, insects!』</p><br/><p>or something like,</p><br/><p>『Kuahahaha, you can’t run away from me. Didn’t you know? You can’t run away from the Storm Dragon!』</p><br/><p>And fight them, right?」</p><br/><p>Veldora said.</p><br/><p>He’s completely into it by now. He didn’t seem to into it in the beginning, though.</p><br/><p>I nodded,</p><br/><p>「Moreover, it would also be possible to face entire units of adventurers.</p><br/><p>It’s like, a Real Simulation Game, you see.</p><br/><p>How about it? Doesn’t it sound fun?」</p><br/><p>Veldora stood up, and put the manga in his pocket.</p><br/><p>And facing me,</p><br/><p>「As expected of you, Rimuru. I always knew you could do great things」</p><br/><p>He said, and shook my hand.</p><br/><p>Thank god he’s an idiot.</p><br/><p>And thus, I have (with great difficulty?) recruited Veldora.</p><br/><p>The next day.</p><br/><p>Veldora and I went to see Ramiris.</p><br/><p>As she promised, the labyrinth was completed.</p><br/><p>「Yo, Ramiris, you doing good?」</p><br/><p>「Ah, master! It has been a while. I am in perfect health!」</p><br/><p>These two are friendly as always.</p><br/><p>Ramiris was already sitting on Veldora’s shoulder by the time they began the exchange.</p><br/><p>And after exchanging greetings, we got right into the explanation.</p><br/><p>As I had wanted, the labyrinth was created via a number of blocks.</p><br/><p>That was, once every few days we can change its layout.</p><br/><p>Every ten floors we have set up save points.</p><br/><p>Upon reaching this point, the next time you enter you can continue from where you left off.</p><br/><p>To that end, we had decided to grant licenses to adventurers to use magic teleportation circles.</p><br/><p>Selling maps is probably too evil. It’ll also be a pain to make new ones every day.</p><br/><p>And let’s not forget about the most important item.</p><br/><p>The charm made by Ramiris’『Labyrinth Creation』</p><br/><p>It will only work once.</p><br/><p>Any death that occurred in the labyrinth will be negated, and the user will be returned to the surface.</p><br/><p>It will activate ten seconds after death has been confirmed.</p><br/><p>There’s also an emergency escape item that returns the user to the surface.</p><br/><p>These safeguards we plan to sell at the entrance. Whether they buy these or not is their choice.</p><br/><p>But if you don’t but it and die… you only have yourself to blame.</p><br/><p>I, personally, would definitely buy it.</p><br/><p>As for the price, we can decided that later. For now, all done.</p><br/><p>Hopefully this will all end as well as we want it to.</p><br/><p>There are still many things left to implement, but that’s for later.</p><br/><p>We exchanged glances, and laughed like the villains we are.</p><br/>\n</div>"}