{"title": "Chapter 107 – Tournament – Finals Part 2", "id": 107, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-107-%E2%80%93-tournament-%E2%80%93-finals-part-2", "volume_title": "Volume 2", "body": "<h1>Chapter 107 – Tournament – Finals Part 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Tournament – Finals Part 2</p><br/><p>The first match was a complete victory for Benimaru</p><br/><p>Gozurl need to discipline himself and fix his temper. Anyway it was decided for him to be secluded alone inside the Dungeon.</p><br/><p>Weighted bangles and anklet will be put on him, it'll make him have disadvantage when fighting against the challengers.</p><br/><p>Even with that handicap, he was still too strong.</p><br/><p>Looking at the spectator’s appearances, even though they didn’t comprehend the situation, it ooks like they vaguely understand Benimaru’s strength.</p><br/><p>It seems the excitement will continue, let’s have another great battle.</p><br/><p>Oh well, because the irresponsible announcement and commentary from Souka, it was impossible to comprehend the current match.</p><br/><p>Souka, although I said that you were allowed to give an explanation, however, your specialty is deception to some extent, there is no need to give explanation for this match.</p><br/><p>Oh well, though there was no plan to expose their true ability.</p><br/><p>Suddenly I feel that someone was looking at my direction, it was a girl with a slightly long ears that’s staring (?) at me.</p><br/><p>I remember, she participates in yesterday’s second match and was blown off the grounds instantly.</p><br/><p>Was she a Half Elf[1]? I thought so because her ears were a bit small.</p><br/><p>Hmm. There was no need for her to keep her eyes on me.</p><br/><p>Oh well, it must be my imagination.</p><br/><p>Near the seat of that girl, there were people who I recognize.</p><br/><p>They were the Tengus.</p><br/><p>What!? That girl who was the granddaughter of the elder, her face was deep red.</p><br/><p>Although the guards near her seems to call her, but she didn’t move a bit.</p><br/><p>Was she sick? Oh well, if there were something they will say it.</p><br/><p>So I ponder, and then I leave my seat.</p><br/><p>Yakisoba, if I don’t go quickly it will be sold out. Though there was no need to eat, I must purchase it before it run out.</p><br/><p>After all, it was a delicious food so it can’t be helped.[2]</p><br/><p>After the lunch break ends, it was time for the start of the next match.</p><br/><p>The second match…… Souei vs Dagura</p><br/><p>There was no need to watch it, it was Souei’s victory.</p><br/><p>Although, it seems Souei also intended to hold on for exactly 30 minutes.</p><br/><p>Without forgetting to service the spectator, he didn’t neglect to liven it up.</p><br/><p>A reliable man was different after all.</p><br/><p>However, there was a problem. And that was......,</p><br/><p>「Well~then, it finally starting! It is the match of our Souei-sama!!</p><br/><p>Contestant Dagura who have no other redeeming features than having a little muscle power. Well then, how will he fight!?</p><br/><p>Against Souei-sama, I think he’s a worthless small fry, but at most I wish for your cooperation to liven up the match!」</p><br/><p>What a favoritism announcement.</p><br/><p>It was already at the level to feel sorry for Dagura.</p><br/><p>I interrupted the match at once, and declared the change of the announcer.</p><br/><p>As expected, she overdid it. I will stop using Souka for Souei’s match.</p><br/><p>And because of that, Shuna enter and replace Souka as the Announcer.</p><br/><p>Different from Souka, the adorableness and the tidiness of Shuna seizes the spectator’s heart in a blink of an eye.</p><br/><p>That is as if she was using a Skill, but it’s just her natural charm. </p><br/><p>「Begin!」</p><br/><p>This time for sure the match was starting.</p><br/><p>Dagura was,</p><br/><p>「UoOOOO! Please look at this, Shion-dono!</p><br/><p>The awesomeness of my growth!!」</p><br/><p>So he shouts, while cladding his whole body in touki[3], and tackle[4] himself towards Souei with intense power.</p><br/><p>That was, just like a huge energy ball, it had a power to blow away the opponent who comes in contact with it.</p><br/><p>However,</p><br/><p>「It’s just an afterimage.」</p><br/><p>Yes.</p><br/><p>It’s not a clone, but it was a real afterimage.</p><br/><p>A small remnant of magic power particles was left behind by the 『Spatial Transfer』.</p><br/><p>Since it have mass and presence, the leftover afterimage body can even be called as a clone.</p><br/><p>When you use clone technique to the utmost limit, at that moment it will began to produce false body.</p><br/><p>It’s a super high difficult technique, even if you acquire the skill, you might not be able to use it. To master it, you have to keep practicing it, only then you can use the ability well.</p><br/><p>He appeared behind Dagura and from his blind spot, an energy ball hit Dagura’s nape.</p><br/><p>The energy ball was as big as a fist, but it didn’t have penetration power as strong as Benimaru. However, the effect should be tremendous because it was a blow aiming at the vital point.</p><br/><p>By the way, when Benimaru defeated Gozurl with one blow, he uses the energy that he had tempered for 30 minute.</p><br/><p>The youki[5]was denser than it usually emitted, it’s refined with the addition of penetration attribute.</p><br/><p>Because it has the disposition to break through magic barrier, to defend against that pure aura was impossible.</p><br/><p>Against superior enemy than us that mastered the use of multiple barriers, this was one of the effective special technique.</p><br/><p>Souei’s energy ball this time, did not have penetration power that strong, it’s just a normal condensed energy ball.</p><br/><p>And yet, Dagura was kneeling on one knee after being hit by that attack precisely on the nape of the neck.</p><br/><p>「You’re good...... Although I judge you only as a bug who just following Shion-dono, you are quite strong.</p><br/><p>Just because you’re a bit popular. Don’t get carried away, you know!</p><br/><p>Even your certain kill hit, it won’t be able to inflict even a wound on this great me!」</p><br/><p>.......Eh?</p><br/><p>Dagura, what do you say?</p><br/><p>If you say like that, what about the telephone punch that you made while kneeling?</p><br/><p>A wound..... Wasn’t that obvious that the aim was not that!?</p><br/><p>My surprise was unrelated, Dagura was raising his touki.</p><br/><p>The leaked out youki filled the inside of the barrier, the air near Dagura’s surroundings clearly made a strange fluctuation and started to drift away.</p><br/><p>The density was so high that the normal spectator can see it.</p><br/><p>Certainly. Only this fellow’s energy was a Demon Lord class.</p><br/><p>However, he still didn’t understand how to use it at all. That was, the reason why he was sent and came to this country to study.</p><br/><p>Also, it will soon hit the 30 minutes mark. It will end with the next attack.</p><br/><p>「Take this! My best attack!! Forest BlasterWrath of Mother Nature[6]!!」</p><br/><p>It was a haphazard attack technique.</p><br/><p>With all of his strength, he didn’t think about defense at all. If described in one word, he is an idiot. </p><br/><p>He concentrates all of the youki that cladding his body on one point, and then he discharged it towards Souei.</p><br/><p>It was spreads yet it concentrated only at one point. There is no way to escape, a full offensive technique.</p><br/><p>But, that’s only if the opponent can’t use transfer.....</p><br/><p>「Fuhahahaa! Though you transfers and run away, I will pursue you anywhere! </p><br/><p>To pursue an opponent that’s teleporting, are you really able to do that?</p><br/><p>Because it was inside the barrier, he will soon discover him. Anyway, I spot a problem on that technique.</p><br/><p>The greatest problem was, it didn’t leave any Youki for defense.</p><br/><p>If the attack he received just then was a killing blow then he will be defeated, it was the basic to value defense more than offense.</p><br/><p>And then, 30 minutes passed.</p><br/><p>Souei just uninterestingly transfer from place to place, just when the time became 30 minutes,</p><br/><p>「Death SentenceHazy Life Reaping Slash・ Weak version」[7]</p><br/><p>A one-step kill.</p><br/><p>Two katana inside one blade, a sword that can attack even the soul.</p><br/><p>Physical and spiritual. A sword with different purposes.</p><br/><p>This time, a blow with katana that kill the soul. If he uses a skill, he would inflict a fatal damage.</p><br/><p>If Souei was not going easy on his opponent, he will already be dead by now.</p><br/><p>「It just striking with the back of the sword!」So Shuna explains, the spectator was clapping and cheering, but it was a frightening technique.</p><br/><p>Originally, it can cut till the soul, but Souei stop it exactly before it cut the soul.</p><br/><p>This guy, not only he fights by using thread, his sword skill is also excellent. Really, I don’t know which one was the better between Souei and Benimaru.</p><br/><p>Hearing this Wisdom King Raphael tries to tell me, but I pass. I want to hold on the anticipation.</p><br/><p>With this, the second match ended.</p><br/><p>The third match…… Gobuta vs Hero Masayuki</p><br/><p>Well then, the highlight of this match was, whether the Hero Masayuki was the real thing or not.</p><br/><p>Though the Hero Masayuki’s leg seems to trembles a bit, was this guy trembling with excitement?</p><br/><p>Really? Was he really the same as Hinata?</p><br/><p>I paid my attention to the grounds.</p><br/><p> −−−−−−−−−−−−−−−−−−−−−−−−−−</p><br/><p>(Masayuki’s POV)</p><br/><p>Nice to meet you my name is Honjou Masayuki.</p><br/><p>What are I’m doing right now? That is what I want to know!</p><br/><p>In front of me, stands a slightly cool[8] warrior. It is a Hobgoblin according to what the announcer Onee-san said.</p><br/><p>Hobgoblin? She must be lying! How can she said such a cool warrior evolves from a goblin</p><br/><p>Or rather, such thing is not important.</p><br/><p>The problem is, for what reason I am in a Colosseum-like place, and become the opponent of that Hobgoblin? That is what I want to ask.</p><br/><p>This, no matter how you look at it is a duel right now,</p><br/><p>No way....... Seriously, I will fight!?</p><br/><p>One year has not passes since Masayuki came to this world.</p><br/><p>The place he arrived was called Ingrasia Kingdom, he don’t understood the reason why he somehow on that place.Then he was helped by a boy who introduces himself as the leader of Freedom Association.</p><br/><p>Though Masayuki thinks that the boy was on the same generation like him, but the boy said that it has been more than 10 years since he came here.</p><br/><p>That boy was Kagurazaka Yuuki, he was taking care of Masayuki who didn’t understand anything.</p><br/><p>However, from that time Masayuki’s head start to become hazy, at that time he feel his behavior became like someone else.</p><br/><p>Just remember it right now, Masayuki realize that he possess Unique Skill『The Chosen One[9]』, he think at that time he consulted about it to Yuuki.</p><br/><p>It was a story of the time when 3 months have not yet passed since he came here.</p><br/><p>Unique Skill 『The Chosen One』, the effect of the skill was tremendous.</p><br/><p>There will be an excellent explanation for him for every action the opponent takes, whatever he does will results as a heroic act and will be praised, it was such an unfair ability.</p><br/><p>Moreover, because Masayuki himself attracted super-good luck, the result of his normal attack will become Critical Hit[10].</p><br/><p>Well, although the level of Masayuki's kendo skill was just at a hobby level so it’s not a big deal, but he was peerless against bandits or low class monsters.</p><br/><p>Masayuki enter the Freedom Association by the recommendation of Yuuki, and began as adventurer.</p><br/><p>At that time, he thinks that his abnormally high offensive ability was unnatural when compared with the others, this is when Masayuki first noticed his ability.</p><br/><p>However, the real frightening thing about this ability was another.</p><br/><p>The effect was also applied to the companions of Masayuki.</p><br/><p>And also, even if it was a deed done by his companion, everything will become Masayuki’s achievements.</p><br/><p>In other words, all attack of his companions will also become Critical Hit, as they received his blessing. And, every admiration for his companions will become Masayuki’s.</p><br/><p>If he remember, because Masayuki possess the desire to become a hero[11] it bring forth this ability.</p><br/><p>When Masayuki consulted about this ability to Yuuki, it seemed a smile spout on Yuuki’s face.</p><br/><p>After that, his head starts turns hazy, day after day he started to feel like he was becoming someone else.</p><br/><p>Masayuki and his companions, growth at an overwhelming speed, after around half a year has passed, he was called as the “Hero[12]”.</p><br/><p>He also participated in Ingrasia‘s Tournament but he easily became the champion.</p><br/><p>Anyway, just by drawing his sword out, the opponent declared「I give up」 and defeated. The spectator, who saw it, seems to misunderstand it as an instantaneous attack, but actually there was nothing happening at all.</p><br/><p>It was one of the effect of Unique Skill『The Chosen One』, they just got hit by the “hero’s Haki[13]”.</p><br/><p>To oppose this ability, if it was not an Unique Skill holder with equal power, then the opponent couldn’t resist it. However, it’s never been said that it was an omnipotent ability.</p><br/><p>And yet, Masayuki who until yesterday didn’t have any doubt.</p><br/><p>We are Invincible. We can win against any kind of opponent. Even if it was baseless he still believed in it.</p><br/><p>(WHY! I believe in such foolish delusion....... Or rather, I want to run away. I really want to run away!)</p><br/><p>While in confusion, Masayuki tries to comprehend the situation desperately.</p><br/><p>If things like this, it was better if his head remains in haze........</p><br/><p>So. To begin with, why has the haze cleared up? That was the question Masayuki have.</p><br/><p>He remembered! Last night.</p><br/><p>He went and saying things like「Prepare yourself, the one who will defeat you is this me!」To the silver haired boy (?) who was the Demon Lord. </p><br/><p>Then,「Oh really? Do your best!」While saying that, s/he taps his shoulder.</p><br/><p>And then, when he sleeps at night, his head feels refreshed, he awake properly.</p><br/><p>Eh? Why am I in this place? It was his judgment on his current situation.</p><br/><p>No, the memory was intact, but he doesn’t understand why things had become like this.</p><br/><p>Honestly, as just by remembering what he had said, he was surprised by the excessive emotion.</p><br/><p>The trust in the looks of the companions he brought with him, he felt shaken by the excessive emotions from it.</p><br/><p>「So~, the third match finally starting!</p><br/><p>What kind of bewitching fight will it be between the greatest young warrior of Tempest and the Hero Masayuki!?</p><br/><p>Well now, the two is staring at each other at the center!」</p><br/><p>(Crap. There’s really no time.)</p><br/><p>Masayuki’s mind become flustered.</p><br/><p>Normally he would have inexhaustible curiosity about how the announcer one-san tail connected to her bottom, however he don’t have it now.</p><br/><p>He turns his gaze to the opponent. Then, was it a coincidence? Their gaze perfectly met each other.</p><br/><p>If he watched carefully, the opponent was also nervous, the opponent seems can’t settle down.</p><br/><p>It resembles the appearance of the opponent in Ingrasia’s Tournament.</p><br/><p>So Masayuki thought. Though the haze was cleared up, it doesn’t meant his ability disappeared.</p><br/><p>Then, wasn’t the effect of turning his every action into something that’s considered as a heroic act also still remained?</p><br/><p>If that’s true.... even if he run away from here, the spectator might interpret it as such, right?</p><br/><p>Alright, then let’s go! Masayuki decided it. </p><br/><p>After all, if the match begins, he will end up got beaten up. Even if his ability can influence his current opponent, he was uncertain if it can be used on the next opponent.</p><br/><p>Because, even though he only took a glance at that large black wolf and the dragonewt warrior, it doesn’t seem to be an opponent he could win against.</p><br/><p>Even with weapon made from Mithril[14], he doesn’t think it's possible to penetrate that steel fur and the scales.</p><br/><p>Here, let’s run away. That is not a mistake.</p><br/><p>What excuse would he make? He suddenly thought about such thing, but he chooses to leave without saying anything. </p><br/><p>He was shy, he thought various good excuses..... That’s right! There are the spectators.</p><br/><p>So he thinks,</p><br/><p>「Wait. This match, I withdraw.」</p><br/><p>He frantically tries to mask his trembling voice, and only say things to that extent.</p><br/><p>And then without any additional remarks, he immediately turns his back and left.</p><br/><p>Having to concentrate this much to move his legs, it was the first experience in his life.</p><br/><p>Thus, Masayuki carried out a magnificent escape from the biggest pinch in his whole lifetime. </p><br/><p>(Masayuki’s PoV end)</p><br/><p> −−−−−−−−−−−−−−−−−−−−−−−−−−</p><br/><p>Staring at each other in the center of the stage were Gobuta and Masayuki.</p><br/><p>And yet, Masayuki suddenly declare a withdrawal, and then he left the place immediately.</p><br/><p>As expected, was he only a bluffing brat? Or there were some other intentions?</p><br/><p>Gobuta was taking guts pose but,</p><br/><p>「Oooooto!? An unexpected happening. It was an unexpected withdrawal from the contestant Hero Masayuki!</p><br/><p>However, given the current situation, we will able to see Contestant Gobuta’s true ability in the next match~</p><br/><p>Is his opponent contestant Gabil? Or is it contestant Ranga!? Please look forward for it!」</p><br/><p>So was the announcement from Souka who returned on this match, she seems to have recalled the next opponent.</p><br/><p>Immediately Gobuta’s face turned pale.</p><br/><p>If its like this, it had been better if I was defeated right now-ssu! So was the audible voice that comes from Gobuta’s heart.</p><br/><p>Though the spectators begun to become noisy,</p><br/><p>「That’s it! Is it because he in front of the Demon Lord he can’t be serious!?」</p><br/><p>「Now that you mention it! Because the Demon Lord didn’t participate in this tournament, he withdraw!」</p><br/><p>「Well, isn’t it because he won’t be able to fight the demon lord that he doesn’t have a reason to stick around?, in any case the strongest one will be made clear as black and white.」</p><br/><p>「So he didn’t have a hobby to beat up the subordinates, except for the Demon Lord himself? As expected from Hero Masayuki!」</p><br/><p>And so forth, they start to consent with the astonishing explanation.</p><br/><p>Then,</p><br/><p>『Ma~Saayuki, Ma~~Saayuki!!』</p><br/><p>It has becomes a large chorus.</p><br/><p>To this cheering, Masayuki answered by raising one hand.</p><br/><p>Although his action was a bit clumsy.</p><br/><p>What is this? Is this a religion!?</p><br/><p>I somewhat felt startled by it.</p><br/><p>Why does just by declining to a match, he received such high evaluation? I can’t understand what the people were thinking.</p><br/><p>But, why he stopped the match suddenly?</p><br/><p>《Solution. Last night, because the contact with master, the brainwashing by Yuuki was lifted off. That is the result from his judgment.》</p><br/><p>Ah! So that was it.</p><br/><p>Or rather, I can lift it with my youki? His last night condition must be because the effect of the Brainwashing = Thought Manipulation[15].</p><br/><p>However, if the brainwashing was cleared suddenly, then, he must be feeling nervous. It then leads to.......... him withdrawing, did he decide that action after he thinks about it desperately?</p><br/><p>If that’s the case, it was wonderful one.</p><br/><p>I need to commend him later. He was a good example of Japanese Person. I want to hear his stories too.</p><br/><p>I will ask Hakurou later to make Sushi, however I will need to ask him to come.</p><br/><p>Anyway, though it was unexpected, the third match also ended.</p><br/><p>The fourth match…… Gabil vs Ranga</p><br/><p>Well then, it was the final match for today.</p><br/><p>This match, frankly I already know the outcome.</p><br/><p>So pitiful, no matter how hard he works, there was no chance for Gabil to win.</p><br/><p>As I thought, Gabil begin to attack Ranga with his spear as soon as the starting signal was given, but it was repelled by Ranga’s fur so the attack didn’t reach. </p><br/><p>The compatibility was the worst as well.</p><br/><p>Vortex of water was produced, it tried to seize Ranga, but the vortex’s momentum was killed by Ranga’s Tempest ability.</p><br/><p>He attacks from the sky too, but because Ranga has acquired the ability to run in the sky, it can’t become an advantage for Gabil.</p><br/><p>Obviously, the breath attacks also useless against Ranga.</p><br/><p>This was a very unlucky lot.</p><br/><p>He met an opponent he can’t win against.</p><br/><p>Was it the side effect of『Tuner』? There was a time where he was lucky, but there also times where he was unlucky.</p><br/><p>Although it’s easy for him to be lucky at critical moment but I think on other occasions his bad luck will come out.</p><br/><p>Last time, like when he was fighting against the Holy Knights, it might be the result because he was lucky.</p><br/><p>Thanks to that, this time the situation becomes like this.</p><br/><p>Well now, the attack from Gabil ends, and everything were end up useless.</p><br/><p>The rest was the delightful play time for Ranga.</p><br/><p>It was harsh too. Since Gobuta win the last match by default, the match remaining time was added onto this match.</p><br/><p>For one whole hour, Ranga will be playing to his heart's content.</p><br/><p>Oh well, it becomes a training for Gabil, it also becomes a good appeal for the spectators.</p><br/><p>Gabil, do you best!</p><br/><p>I’m cheering for Gabil inside my mind.</p><br/><p>And I join my hands for prayer.</p><br/><p>[1](ハーフエルフ) = Han mimi naga zoku (haafu erufu) – half long ear race. A certain emp%$##.</p><br/><p>[2]Delicious Food is Justice! Rimuru joins Hiiro on the Gourmet’s way.</p><br/><p>[3]Fighting Spirit</p><br/><p>[4]Taiatari.</p><br/><p> Dagura use Tackle against Souei! </p><br/><p> Souei takes no damage!</p><br/><p> It’s just an afterimage!</p><br/><p>[5]Demonic Aura</p><br/><p>[6]のり(フォレストブラスター) Daishizen no Okori (Foresuto Burasutaa).</p><br/><p>[7]・(シノセンコク) Oborodatsuinochizan ・yowa (Shinosenkoku).</p><br/><p>[8]Chotto Ikashita = somewhat cool/stylish.</p><br/><p>[9](エラバレシモノ) = Eiyuu Hadou ( Erabareshimono) - The Supreme Way of hero (The Chosen One).</p><br/><p>[10](クリティカルヒット) Chimei Kougeki = Fatal Strike| (Kuritikaru Hitto).</p><br/><p>[11](ヒーロー) = Eiyuu (hiiro) - hero</p><br/><p>[12] = Yuusha – Hero/Brave</p><br/><p>[13] = eiyuu Haki (Will of hero)</p><br/><p>[14](ミスリル) = Hijiriginsei – Sacred Silver | (Misuriru) - Mithril</p><br/><p>[15] = Shinen Sousa - Thought Manipulation | Different with the one used in chapter 95  Shinen Seigyo</p><br/>\n</div>"}