{"title": "Chapter 102 – Audience with Monsters", "id": 102, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-102-%E2%80%93-audience-with-monsters", "volume_title": "Volume 2", "body": "<h1>Chapter 102 – Audience with Monsters</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Audience with Monsters</p><br/><p>One and a half months have passed since I had ascended to a Demon Lord.</p><br/><p>The construction of the Colosseum has also progressed well. Gerudo’s command and capacity for construction has allowed the project to progress just as planned.[1]</p><br/><p>Furthermore, the youngest of the three Dwarf Brothers, Mildo, had actually revised my blueprint and made it into a gorgeous building with a high artistic value. As expected from a dwarf, no, this was the work of a true artist. Simply splendid craftsmanship.</p><br/><p>With this, the workmanship can even please those from royal families. For me, who has a rather low level of artistic capacity, it’s quite helpful to have someone around with such talents.</p><br/><p>Even with Mildo’s additions, there will still be plenty of time before my debut and the Tournament are scheduled to begin.</p><br/><p>Regarding Underground LabyrinthDungeon, the prospect for it was very good,[2] there were still various things that I wanted to look into further, such as the Labyrinth’s design, but I had to entrust the remaining details to Ramiris and Veldora.</p><br/><p>Though there were plenty of things I wanted to get involved in, I simply don’t have the time to help out with everything.</p><br/><p>To celebrate my ascension, or rather, to truly ascertain it whether I really am a Demon Lord, the representatives of various races have begun gathering one after another at the Monster’s CountryTempest.</p><br/><p>It would seem that they wish to swear their loyalty to the Demon Lord, and as a result, gain the Divine Protection that such a Lord could provide.</p><br/><p>However, if said Demon Lord lacked the ability to lead, said Lord would surely plunge them into a certain path of destruction, rather than prosperity.</p><br/><p>Until now, the Great Forest of Jura was under the Divine Protection of Veldora, who had protected the region, turning it into a non-aggression zone.</p><br/><p>The nonaggression area was now governed and under control of the new Demon Lord.</p><br/><p>This region was now under the governing body of the newest Demon Lord who suddenly appeared. Moreover, it became known to most that this Demon Lord was still quite a novice at such things. To discover that the new protector of the forest was such a being, certainly it would not be unreasonable for the representatives of said races to feel rather insecure about their futures.</p><br/><p>Today, I was dressed in ceremonial fashion.</p><br/><p>Today, I was worshiped as a Great Demon Lord.</p><br/><p>In the appearance of Slime.</p><br/><p>It would seem that I’ve already been turned into an ornament and treated like the like Kagami mochi[3] that decorates a Kamidana[4].</p><br/><p>Wouldn’t it just be fine to leave a clone instead of me having to sit here…?</p><br/><p>Well, I did say this, but it was immediately rejected with smiles. Yep, it sure is so wonderful that the Department heads are in complete agreement at times like this. I really appreciate their desire to have me wait here.</p><br/><p>Reluctantly, I was displayed and was ‘requested’ not to move.</p><br/><p>Honestly, I was amazed at their preparation for the event to the extent that they even had Magic clothes for a Slime prepared and everything…</p><br/><p>I looked down upon the kneeling monsters who wished for an audience with me.</p><br/><p>I think that such formalities such as dressing up and kneeling are unnecessary, but showing dignity is important. Reluctantly I had to go along with the Department’s demands. It can be said that the usual slime versionform didn’t have dignity.</p><br/><p>Well, I don’t really care.</p><br/><p>However, what was interesting were the reactions from the various races.</p><br/><p>Because I didn’t do or say a thing, as if I was an ornament, I silently cast my gaze upon the monsters as they introduced themselves.</p><br/><p>The reactions could be said to be divided into three groups. These were those who held admiration, those who were observing, and finally, those who held great fear.</p><br/><p>From those who were observing, there were even a few that were looking down on me a bit, but that might end up being rather convenient.</p><br/><p>The real problem falls with those who are frightened. Those often cause the real problems.</p><br/><p>I accepted an audience while thinking on it further.</p><br/><p>The first people who I granted an audience were those who believed in my capabilities and held great respect for me. Mostly those who I have already established ties to previously.</p><br/><p>This time, it was the Lizardmen’s Chief[5], Gabil’s father, and Clan Heads of the High Orc.</p><br/><p>「It has been a long time, Rimuru-dono…. no… I should say Demon Lord Rimuru-sama…. On such a joyous occasion, we also-[6]」(Gabil’s Father)</p><br/><p>Seeing as he was so tense and talks stiffly, I cut him off.</p><br/><p>「Ah, it certainly has been a long time, Chief. There’s no need for you to be talking so formal.</p><br/><p>I’m quite indebted to you for the alliance, so please treat me well from now on, just as you have before.」(Rimuru)</p><br/><p>So I spoke.</p><br/><p>With that, I managed to dispel his troubles and his worries seemed to disappear. After that, he seemed to be able to return to his original bold personality suited to the leader of a species.</p><br/><p>「No no! There is no reason for such kind words, Rimuru-sama!</p><br/><p>By the way, that Gabil..... Has he been any use to you?</p><br/><p>Honestly.... that good for nothing son..........」</p><br/><p>To the public, Gabil was exiled and disowned by his father. From his tone, it doesn’t seem like there was any intention to recall him back publicly right now.</p><br/><p>His father is a serious person, but he also has many good qualities about him and is a good leader.</p><br/><p>As I was pondering this, I suddenly ended up with an idea.</p><br/><p>「Oh, that’s right, Chief. Allow me to give you the name ”Abil”. After all you are Gabil’s father, or rather for you having no name is a bother.」 (Rimuru)</p><br/><p>Oh, it was the nostalgic name granting.</p><br/><p>I emphasized the father’s part, I do want to have this disownment problem solved slowly.! And, I also don’t forget to persuade him indirectly.</p><br/><p>I wonder if he noticed my intent…? Chief. No, Abil nods with his thanks.</p><br/><p>「As your will! I swear upon this name, my loyalty to Rimuru-sama!</p><br/><p>I shall never forget any moment of this!!」(Abil)</p><br/><p>So, he says and nods with great vigor, he then departed from this place.</p><br/><p>I passed a wink over to the waiting Rigur to have him guide Abil towards Gabil’s residence.</p><br/><p>Rigur nodded and left with Abil.</p><br/><p>By the way, it was certain that Abil will evolve into Dragonewt.</p><br/><p>The name bestowed quite a large amount of Divine Protection onto him and cost a bit of power, but it’s still a problem that i’m naming people thoughtlessly.</p><br/><p>Above all I don’t have intention to do that. Please excuse me from a death march. [7]</p><br/><p>This time, naming the Head was a form of gratitude for Gabil’s efforts, but in the future I must control my tendencies to name people.</p><br/><p>Continuing after Abil was Clan Heads of the High Orc, They had come to offer their greetings with only a few people as escort.</p><br/><p>They didn’t bring any guards with them, maybe because they trust me fairly highly.</p><br/><p>The several people they did bring were their child and grandchildren.</p><br/><p>Naturally, their food situation were improved, their lifestyle also improved.</p><br/><p>Above all, the children were born, and that every child was born as a High Orc. Because of that they felt a great level of astonishment and joy, they wanted to report it to me directly.</p><br/><p>I thought to myself that it would only be natural that their children would become High Orcs, but I was told that it was actually exceptionally rare.</p><br/><p>As it would turn out, the birth of a variant would normally be limited to a single generation. With their birth rates now decreased, they could now focus on child care and development.</p><br/><p>As the future working force, I instructed them to raise the children with great care.</p><br/><p>A child was a treasure. Even in a different world, this still remain as an unchanging truth.</p><br/><p>I had been worried about how they would manage, but it would seem bestowing names onto each of them turned out to be the right decision.</p><br/><p>I had wondered it might have gotten complicated for them to use the names that I gave them, but it seems that using their names came naturally to them.</p><br/><p>I’m glad. Oh well, they might not get used to it. But after awhile, they will get used to be called with that name.</p><br/><p>Since they originally got along just fine without any names at all without problems, I was probably just worrying too much.</p><br/><p>As the last member that composed the Great Jura Forest Alliance.</p><br/><p>The Treants[8] also came to offer their greetings.</p><br/><p>Well, I say the Treants, but since they can’t move, the one that came was actually the Dryad’s[9] Trainee-san from before.</p><br/><p>As usual, I sense a large pool of magical power.</p><br/><p>「It’s been a long time, Rimuru-sama.</p><br/><p>Our congratulations for your ascension to a Demon Lord.」 (Trainee-san)</p><br/><p>Without any hesitation, she offered her greetings.</p><br/><p>I was also helped by her in the past, so I owe her and the Treants quite a bit.</p><br/><p>From there we ended up discussing our mutual relationship.</p><br/><p>As for now, it seems there wasn’t any immediate problem, but it seemed that moving was troublesome for her.</p><br/><p>Actually, before me Trainee-san’s body become rather thin.</p><br/><p>「Well, this and that.....</p><br/><p>Until the Fairy Queen has completed her reincarnation, we had to remain behind.</p><br/><p>Since we couldn’t move freely, we can only manage this much…」(Trainee-san)</p><br/><p>Did... she just say something interesting....?</p><br/><p>Fairy Queen...... No.......she doesn’t mean......</p><br/><p>That Chibikko[10] was such an outrageous person....</p><br/><p>In my mind, I can only remember Ramiris’s innocent smiling face.</p><br/><p>「Eh, really? The Fairy Queen you say? Do you know the name?」(Rimuru)</p><br/><p>「Yes, it‘s the Great Ramiris-sama.</p><br/><p>Several thousand years ago, it was she who arbitrated with evil people, and after that her appearance vanished............」 (Trainee-san)</p><br/><p>I want to pretend I don’t hear anything.</p><br/><p>The Ramiris in my mind and the Ramiris in Trainee-san’s image were absolutely not match. I’m certain of that.</p><br/><p>However…… It seems that she was always waiting for her return.</p><br/><p>She must never think that the Fairy Queen had becomes one of the Demon Lords....</p><br/><p>Should I let her know and then recruit them as my subordinates?</p><br/><p>「Umm...... I may have a clue about such person, but.......」 (Rimuru)</p><br/><p>「EEEH!? Is that... is that true!?」 (Trainee-san)</p><br/><p>She reacted with earth-shattering power after hearing my words.</p><br/><p>Let’s just introduce her. If she saw that Chibikko, she might get disillusioned. Though, I never expect that Ramiris was actually someone important.</p><br/><p>I will not be discouraged.</p><br/><p>Resolving my will, I decided to let Traynee-san meet Ramiris.</p><br/><p>The result.</p><br/><p>The Impressed Trainee-san weeps greatly.</p><br/><p>SERIOUSLY? Ramiris was the reincarnated (?) form of THE Fairy Queen.....</p><br/><p>「Ah, that unchanging beauty, the elegant appearance......」(Trainee-san)</p><br/><p>Trainee-san was admiring while choking because of the tears of gratitude.</p><br/><p>Who do you said that again? I don’t really understand.</p><br/><p>Especially, the elegant part... Even if you search Ramiris from top to bottom you would found NOTHING that match with the description.......</p><br/><p>「You heard that!? Hey, you heard just a moment ago, right?! You, just get a better opinion of me, right?」(Ramiris)</p><br/><p>Proudly, Ramiris came over and began boasting towards me.</p><br/><p>Annoyingly.</p><br/><p>She flying and buzzing around me.</p><br/><p>「How~dat!」(Ramiris)</p><br/><p>Such feeling, she really overjoyed.</p><br/><p>Oh well, I don’t care.</p><br/><p>To meet with comrade by chance was a happy event.</p><br/><p>By the way, to had joyous reunion was just the first part, so I spoke once again</p><br/><p>「Anyway, how about moving into Ramiris’s labyrinth?</p><br/><p>You see, since that place is near Tempest and it was also Ramiris’s territory, you know?」(Rimuru)</p><br/><p>「Ah! That’s might be good...</p><br/><p>The floor can be enlarged easily, there are also a lot of empty floor, there also a JungleForest floor too!」(Ramiris)</p><br/><p>Ramiris agreed with my proposal.</p><br/><p>After all, inside the labyrinth Ramiris’s subordinates will be immortal. Since they will end up serving their original role, I decided to make such a suggestion.</p><br/><p>「However..... As a someone who lives in Jura Forest, shouldn’t’ we will be affiliated under Rimuru-sama......?」 (Trainee-san)</p><br/><p>Trainee-san was seriously worried about that.</p><br/><p>The actual place, when I gave Ramiris the permission to establish the labyrinth, I also granted her extraterritorial rights on that place.</p><br/><p>The Inside of the labyrinth was under both of my and Ramiris’s control, it was a special area under the administration of a joint sovereignty.[11]</p><br/><p>As I explaining that and I also added that for now immigration wouldn’t be an issue.</p><br/><p>Although Trainee-san was hesitating, she quickly recovered and decided to consult about this matter with the Treant elders.</p><br/><p>After that, she returned using teleportation.</p><br/><p>As expected of someone with the ability to manipulate the magic power of nature, she had quite the convenient skill.</p><br/><p>Although it looked like spatial transfer, its invocation was quick.</p><br/><p>But if I use my analysis ability, I would probably be able to learn it soon.</p><br/><p>After three days, the consultation between the elders had been completed smoothly and Trainee-san once again came.</p><br/><p>She then immediately requested for an audience, and the first thing she spoke was,</p><br/><p>「We, the Treant and Dryad, would like to relocate under the protection of Ramiris-sama.</p><br/><p>Can you give us your approval, Rimuru-sama?」 (Trainee-san)</p><br/><p>Her request was stated as so.</p><br/><p>Naturally, I gave out my approval to her.</p><br/><p>「Thank you very much!」(Trainee-san)</p><br/><p>After I gave my consent, Trainee-san was elated.</p><br/><p>However, there was one problem, how on Earth were they going to relocate the gigantic trees? That was the question.</p><br/><p>However, even so the solution was unexpectedly easy.</p><br/><p>Ramiris will opened the labyrinth door over there, and transfer them as they were to the Labyrinth.</p><br/><p>Because, I don’t think that the Treants could relocate by themselves.</p><br/><p>However, since Ramiris’ subordinates will be increasing, then it could lead the labyrinth inside to become stabilized in the coming weeks.</p><br/><p>The increased control of the magic power and air management will make running the Labyrinth remarkably easier.</p><br/><p>And, although the numbers of the Dryad was only a few, they were suited as the guides inside the labyrinth.</p><br/><p>The 95th floor was established as the residence of the Treants to reside, they could replace Ramiris and Veldora to establishing that floor</p><br/><p>Thus it will become a floorstage of overgrown greeneries.</p><br/><p>That floor had the widest area, with a diameter of 5 km.</p><br/><p>And, around the door that lead to the 96th floor was the last Record SiteSave Point[12] and there would also establishment like Inn and etc before the boss.</p><br/><p>They could also open a business like Equipment Shop that offered high quality weapons and armors in their storefront, which can only be found and purchased here.</p><br/><p>But since the customers visiting will be very rare, I don’t doubt that opening the shop will just be a hobby.</p><br/><p>Surrounding the area was the completed Treant’s Village.</p><br/><p>Thanks to the thick magical power concentration, everyone could live vividly,</p><br/><p>I also got the agreement of the Dryads to help with the management of the Labyrinth. Rather, it was the other party that wished to be useful.</p><br/><p>I believe I have secured a group of loyal and cooperative workers.</p><br/><p>Later on, on that Floor, one forest-type city will be founded.</p><br/><p>A city that confer solace, for those who suffered many struggles to penetrate the Jungle.</p><br/><p>It was known as the “Labyrinth City”, the flourishing Metropolis of Illusions.</p><br/><p>A town that won't grant its blessing to anyone except for those who could successfully reach it.</p><br/><p>However..... That was still a story in the future, which even for my current self couldn’t imagine happening.</p><br/><p> −−−−−−−−−−−−−−−−−−−−−−−−−−</p><br/><p>After that, the second group of those who observing me.</p><br/><p>Those people were people of high-ranking race from Great Jura Forest.</p><br/><p>As for the breakdown, they were the representative from Tengu[13], Gozu[14], and Mezu[15] Race.</p><br/><p>The Tengu reside in the mountain range near where the High Orc mountain clan settled. Furthermore, they had established their village before the gate to some other realm on an inaccessible mountain summit.</p><br/><p>Although it was once believed that there could be no one capable of inhabiting that place, it seems that those of high ranking races aren’t bothered so much by such environments.</p><br/><p>As the representative of their elder, the granddaughter, a youthful girl named Momiji, came baring their greetings.</p><br/><p>Though the male’s nose was long just like their name[16], the females of the species have normal ones as it would turn out.</p><br/><p>What stands out was that their skin color is rather reddish.. or perhaps that the male’s noses aren’t as long as I thought they would be. Well, I suppose if it was too long, it would become an inconvenience, so perhaps this is to be expected.</p><br/><p>However..... this race. Their pride was surprisingly high.</p><br/><p>The very first thing that she said to me was,</p><br/><p>「Hmph. To think that there would come an age where we would come to be ruled over by a lowly slime. How amusing.</p><br/><p>So amusing, I can’t laugh at it.... Oh well, what’s done is done.</p><br/><p>We will give our recognition of your rule over this forest. However, we won’t tolerate if you meddle in our affairs.」(Momiji)</p><br/><p>So, she declared in front of the department heads.</p><br/><p>Twitching, Shion was started to burst out. But, the surprising thing was she able to restrain herself.</p><br/><p>Whatever things that were changing inside that girl’s mind, she won’t lose herself in rage over these small matters.</p><br/><p>Although it was a good tendency, it was..... Somewhat eerie at the same time.</p><br/><p>However, it may be accumulated and exploded.</p><br/><p>I stopped looking at the changes on Shion behavior.</p><br/><p>「I see, I can come to an understanding of the Tengu’s intentions.</p><br/><p>On the matter of not interfering with your affairs, we will also won’t send any assistance to you either. Is this arrangement fine with you?」(Benimaru)</p><br/><p>Benimaru, taking the role of the representative asks her.</p><br/><p>As for what had been said, if you didn’t want to accept being ruled by Demon Lord, then you won’t be ruled. If it was another Demon Lord, s/he may annihilated people who shown disrespect behavior.</p><br/><p>But, I was generous and didn’t care about such thing.</p><br/><p>Or rather...... it was quite troublesome.</p><br/><p>Moreover, I already told everyone to do what they think will be best for the race that gives such reaction.</p><br/><p>When Benimaru received those words, he was only reconfirming it.</p><br/><p>「Yes, that’s fine.」(Momiji)</p><br/><p>As such, when she gave her answer, I offered a nod.</p><br/><p>And then, Benimaru takeover the conversation.</p><br/><p>「I see. Then, let’s go with the nonintervention with each other.</p><br/><p>However, please acknowledge the privilege of the High Orc that settles down upon the mountain.</p><br/><p>Do you also want to perform trade agreement like food or other goods?」(Benimaru)</p><br/><p>「That’s true. The mountain’s blessings are not within our right to claim.</p><br/><p>For things like mineral ores, it is practically things that are useless for us.</p><br/><p>Regarding the High Orcs that have settled upon the mountains, we will just leave them alone.</p><br/><p>We just didn’t want other party interfere with our affairs.</p><br/><p>So long as we will not be called for any military purpose, then it will be fine.」(Momiji)</p><br/><p>「We understand. There is no problem about this agreement. As for the military, you will not need to be concerned about it.</p><br/><p>I think that it’s more preferable for the military to use volunteer system.</p><br/><p>This talk ends here.</p><br/><p>Well then, since you have had to trouble yourself to come to this country from far away, why don’t you rest before you return?</p><br/><p>Oh yes, the warrior of this country had planned to hold a tournament.</p><br/><p>It’s an exhibition, or perhaps I should say an entertainment. I think that this is a spectacle that will be rarely seen.</p><br/><p>I’m certain, that you will be enjoying this.」(Benimaru)</p><br/><p>The conversation ended on such a note.</p><br/><p>I haven’t heard about military voluntary system, I became a little surprised and also impressed.</p><br/><p>For forming a desirable friendly relationship, because she had troubling herself to came here, and then sees the tournament. I think she will return after enjoying herself in this country.</p><br/><p>But, the granddaughter of the Tengu’s elder, Momiji was,</p><br/><p>「Fufu. I want to see what kind of level the subordinate of the slime.</p><br/><p>Anyway, I think that it was just a good strike of luck for it to become a Demon Lord, right? [17]」(Momiji)</p><br/><p>She impudently declared such words, and then immediately departs.</p><br/><p>But, to directly declaring her own intention and asking me to agree with her, her personality must not a meek one.</p><br/><p>After Momiji had left,</p><br/><p>「Though I endured it, isn’t that too much?」(Shion)</p><br/><p>So Shion starts speaking.</p><br/><p>「Indeed. I'm also a bit irritated.」(Benimaru)</p><br/><p>Even Benimaru too.</p><br/><p>Well, maybe it because she belongs to a High Race, that can be classified as Rank A.</p><br/><p>Certainly, they were powerful. Even if they want to have nonintervention, there was no need for them to be unreasonably deprecating themselves.</p><br/><p>So, that was I had thought,</p><br/><p>「What sort of behavior was that? It was not as if we had asked them to become a subordinate, what was with such unchecked hostility?</p><br/><p>Or rather, I thought that it would be better for them to hand over the claim on the Mountain.</p><br/><p>It isn’t like we can honestly afford to stop harvesting the various resources of the mountain. If we were to ever expand our interests there and it causes trouble, certainly that could end up being a casus belli for war.</p><br/><p>If the other side was not an equal, shouldn’t they need to be worried about the other party had done and match their behavior to match the situation, right?」</p><br/><p>I want to admonish those two carefree couple.</p><br/><p>The problem was about the rights for mining. Oh well, in the first place it’s not about who owns the mountain.</p><br/><p>Now, I’m going to officially proclaim and made myself well-known, thus if there were any races that were objecting to my rule or my person, they will obviously show their hostility in the behavior.</p><br/><p>Well, nonintervention was good.</p><br/><p>Although I could easily crushed them, as much as possible I want to foster good relationship with them.</p><br/><p>Responding the more or less impertinent conduct, let’s just close one eye at that.[18]</p><br/><p>Continuing after that were two races.</p><br/><p>These were the Gozu and Mezu.</p><br/><p>Both races were on bad terms with each other, from what I’ve heard they have continuing their war for 100 years.</p><br/><p>Even so, they came together even if they oppose each other.</p><br/><p>The atmosphere was so tight that it felt as if the two representatives would break out into a fight at any moment. Though for the time being they restrained themselves while in my presence.</p><br/><p>And,</p><br/><p>「Yo, Demon Lord-sama. We, Gozu are useful in war, you know?</p><br/><p>Will you lend your help destroying the poor Mezu?」(Gozu Representative)</p><br/><p>「Hmph, Don’t be stupid! As the Demon Lord have a sharp eye.</p><br/><p>There’s no need to hesitate, form an alliance with us the Mezu.</p><br/><p>Let alone Gozu, we will massacre all monster that dare to disobey!」 (Mezu Representative)</p><br/><p>What a troublesome bunches rather than passionate, that had come here.</p><br/><p>However. In the moment when I saw those fellows, an idea flashed inside my mind.</p><br/><p>That’s right! Speaking about labyrinth, it must have Minotaur!</p><br/><p>Such thing like, weren’t the Gozu really suitable as boss character?</p><br/><p>I want them. I want them by all means, as a boss unit, I want to leave them around 30th floor.</p><br/><p>Such feelings continued to pour out after my initial idea.</p><br/><p>However, on the contrary of such feelings, these monsters were having low loyalty towards me.</p><br/><p>A good employer was able to do these kinds of things.</p><br/><p>And, it was really obvious, that their ulterior motive was using me to destroy the other.</p><br/><p>I winked at Shion.</p><br/><p>Shion was going like “Eh? Is it okay?” After she showed such expression, immediately a wicked smile began to sprout on her face. .......</p><br/><p>「YOU ALL are in the presence of my king, THERE IS A LIMIT FOR DISRESPECT!</p><br/><p>If you all do not give appropriate courtesy, you had BEST PREPARE YOURSELVES TO RECEIVE SUITABLE TREATMENT.」</p><br/><p>To summarize what happened, both of them were beaten up viciously.</p><br/><p>It didn’t take even one minute.</p><br/><p>Both of their clan youngsters that they had taken with them had no time to interfere. It was a very quick work.</p><br/><p>With a single glare, the subordinates of the two were silenced, Shion then bowed to me.</p><br/><p>With this, all was fine.</p><br/><p>These fellows were different from the Tengu before, I could use them.</p><br/><p>Or rather, I could use them without any reservation.</p><br/><p>In the first place, in their 100 years war they were repeatedly looting each other, yup, an annoying and troublesome duo of races.</p><br/><p>Actually, in case of their fighting strength, they might above the Ogre[19].</p><br/><p>In simple combat, either one of them could be called the strongest race in the Great Jura Forest. I don’t know just how many of them could qualify for rank A though.</p><br/><p>However, that racial-conflict that has been raging n for 100 years has been constantly causing trouble for the surroundings.</p><br/><p>Before the other race raised their complaint, I think it was not a problem to give them punishment.</p><br/><p>「You guys seem to have plenty of excess power, so I will prepare the stage for you guys to mettle it out.</p><br/><p>If you oppose, what await you guys is only destruction.</p><br/><p>However, if you manage to achieve victory, it would be useful as appeal to me, think about this well.</p><br/><p>At best, you should strive yourself for victory with your utmost effort.」(Rimuru)</p><br/><p>I declared exaggeratedly while not permitting them to raise any objection.</p><br/><p>At the same time, I erased my presence while at the same time released the entire of『Demon Lord’s Haki』with the intent to slightly intimidating them.</p><br/><p>Perceiving such presence, the Gozu and Mezu fall prostrating.</p><br/><p>They begin to trembling and shaking, there wasn’t the slightest hint of the insolent attitude that they had earlier.</p><br/><p>Eh? Should I emitted『Demon Lord’s Haki』from the beginning.......</p><br/><p>No, there’s no need to be excessive. Besides, I’m fairly certain it was more effective if it was emitted at the right time.</p><br/><p>Anyway, I will make these two people participate in the Tournament.</p><br/><p>And then, suitably, I put them to work at the labyrinth.</p><br/><p>In my head, there was only joy because I obtained such good Boss materials.</p><br/><p>『We will strive with all our hearts to meet your expectations! Therefore, we beg you for your forgiveness for our rudeness!!』(The Duo | Gozu and Mezu)</p><br/><p>So it turned out like that, though I didn’t pay any attention to the two and their frantic, pleading voices.</p><br/><p>Those two poor subordinates left with pale face, the other races outside could only guess wildly as to what event had transpired.</p><br/><p>After that, the other audiences progressed smoothly.</p><br/><p>Though there several selfish races, there weren’t any of them that pushed their luck too far like what the Gozu and Mezu had done.</p><br/><p>With such feeling, I end the audience with me.......</p><br/><p>But, the people who were having the last audience were bringing a problem.</p><br/><p>Color coded for your convenience.</p><br/><p>The translation note with GREEN color is from Yukkuri Oniisan. The red is from Guro. Black is shared</p><br/><p>[1] This isりKeikakudoori.</p><br/><p>[2] The business opportunity seems good. Like that</p><br/><p>[3] Kagami Mochi literally mirror rice cake, is a traditional Japanese New Year decoration. It usually consists of two round mochi (rice cakes), the smaller placed atop the larger, and a daidai (a Japanese bitter orange) with an attached leaf on top. Nowadays it is usually placed in a household Shinto altar, or kamidana.</p><br/><p>[4] Kamidana are miniature household altars provided to enshrine a Shinto kami.</p><br/><p>[5] Shuryo () can mean head, chief, leader. Chief sound better than Head.</p><br/><p>[6] He is using Keigo/Polite talk here.</p><br/><p>[7] We forgot to translate this line before</p><br/><p>[8] Treant = (トレント) Written as Treemen race read as Treant.</p><br/><p>[9] Dryad = (ドライアド) Written as Tree Fairy read as Dryad.</p><br/><p>[10] Child, Shorty, Midget.</p><br/><p>[11] Also known as Condominium in International Law.</p><br/><p>[12] (セーブポイント) = Kiroku Chiten (Seibupointo) Written as Record Site read as Save Point.</p><br/><p>[13] Tengu = (テング) Written as Long nose race read as Tengu.</p><br/><p>[14] Gozu = (ゴズ) Written as Ox head race read as Gozu.</p><br/><p>[15] Mezu = (メズ) Written as Horse head race read as Mezu.</p><br/><p>[16] Their Race kanji mean Long nose.</p><br/><p>[17] Believe me, This WILL bite her back, thousandsfoldly.</p><br/><p>[18] In other word. Ignore it.</p><br/><p>[19] Ogre =(オーガ) Written as Great Oni race read as Ogre.</p><br/><p>White’s Corner:</p><br/><p>(White)</p><br/><p>“Well, with that, it’s complete. I had intended to get it done on the 7th, but various events caused me to push it back.</p><br/><p>At any rate, now it’s done and ready to be released.</p><br/><p>Hmmm, I suppose since I’ll be editing more pieces, I’ll have to think up of some interesting to use besides just the Samurai Lair…”</p><br/><p>(Black)</p><br/><p>“That’s simple, just throw us into a short story with plenty of action. You’re a decent writer, think of something that won’t bore me… I mean them.”</p><br/><p>(White)</p><br/><p>“...”</p><br/><p>(Guro's Corner) starting Guro and ??</p><br/><p>\"Sorry for delay guys, been busy these days.</p><br/><p>BTW do Mana sound better than Magic power for the translation for Mamoto?\" (Guro)</p><br/><p>\"Tell us if you find any mistake!\"</p><br/><p>\"I will correct it tomorrow\" (Guro)</p><br/><p>(Yukkuri Oniisan's Corner)</p><br/><p>\"Umm.... Nah ... I'm too lazy....\"</p><br/>\n</div>"}