{"title": "Chapter 119 – The way to enjoy a dungeon", "id": 119, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-119-%E2%80%93-the-way-to-enjoy-a-dungeon", "volume_title": "Volume 2", "body": "<h1>Chapter 119 – The way to enjoy a dungeon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Translator’s Corner (Another tale of the Clown 2)</p><br/><p>Dear readers, ’tis I the fool</p><br/><p>Who has come to you again tonight,</p><br/><p>To deliver a chapter so joyful</p><br/><p>That die from laughter you might.</p><br/><p>Now, without further delay,</p><br/><p>Let us return to the tale of that poor lass,</p><br/><p>Who was woken up by the sun’s ray,</p><br/><p>And through her door did she pass.</p><br/><p>You see, she was just a normal lass,</p><br/><p>Who was heading to her job,</p><br/><p>Who was merely trying to surpass,</p><br/><p>Her dreadful boss Bob.</p><br/><p>On that day, she did stumble,</p><br/><p>And nearly fell because of that too,</p><br/><p>But–no, she did not crumble</p><br/><p>And instead heard: “I got you!”</p><br/><p>And thus she met him, a handsome man</p><br/><p>Who was merely walking by</p><br/><p>And thus her love for him began,</p><br/><p>Yes–for that average guy…</p><br/><p>To be continued!</p><br/><p>Chapter 119. The way to enjoy a dungeon</p><br/><p>Gobuta has returned.</p><br/><p>Milim seems to have beat some sense into him, judging by his broken state.</p><br/><p>Did he become stronger? I don’t know. It does look painful though.</p><br/><p>「Hehehe, I… finished… I cleared it!」</p><br/><p>Gobuta kept repeating this line.</p><br/><p>With a big nod,</p><br/><p>「Yes, great job! I didn’t think you could clear hell mode!」</p><br/><p>Milim praised him.</p><br/><p>If Milim praised him, he must have truly accomplished something.</p><br/><p>When I asked him about it later, her training regiment was constant combat.</p><br/><p>Constantly fighting devils of equal fighting strength or higher.</p><br/><p>「As Milim-sama said,</p><br/><p>『You have already reached the pinnacle of your power and will not be able to draw any more magical energy.</p><br/><p>But, that changes when you fuse with Ranga.</p><br/><p>So, the only problem remaining is being used to controlling that power!</p><br/><p>Let Ranga increase the power output, you focus on polishing your feel for it!』</p><br/><p>Since then I’ve constantly worked to improve my battle sense.」</p><br/><p>He said with a smile.</p><br/><p>Having acquired the extra skill『Wiseman』his processing speed has increased.</p><br/><p>He has really become quite something.</p><br/><p>Now that Milim has come to play I think it’s time to take out the item I had prepared.</p><br/><p>Veldora, Ramiris, and Milim: these three are looking with great interest at the item in my hand.</p><br/><p>We are in Veldora’s room.</p><br/><p>On the lowest floor of the dungeon.</p><br/><p>「Gather around, folks! I have a special item here.</p><br/><p>Never seen before, a breakthrough the likes this world has never seen.</p><br/><p>I have come up with another way to pass the time!」</p><br/><p>I said and distributed the item to the three of them.</p><br/><p>This I have developed thanks to Sarion’s Empress and Duke Elalude, based on the Homunculus.</p><br/><p>That is, I found something pretty nifty while playing around with artificial bodies.</p><br/><p>「What’s this?」</p><br/><p>「Never seen anything like it? Is it food?」</p><br/><p>「Hmph, looks like a vessel for a soul…」</p><br/><p>They all voiced various thoughts.</p><br/><p>Veldora’s hypothesis is really close. This is indeed a pseudo-vessel for the sole based on the Homunculus project I personally revised.</p><br/><p>But Ramiris… food? Seriously?</p><br/><p>You don’t think that all I do is for food, do you?!</p><br/><p>Ah, whatever.</p><br/><p>「Veldora is basically right. This is a vessel for a soul.</p><br/><p>Preparing a soul is rather difficult, so I tried making a monsters’ pseudo soul.</p><br/><p>I want you to hold it and think of a shape you really like.</p><br/><p>You can imagine a monster that actually exists if you want」</p><br/><p>「A goblin or an orc, for example?</p><br/><p>Or a horned rabbit, or a man-eating bear?」</p><br/><p>「Hmm? Anything goes. But pick something you like.</p><br/><p>No take backs later, got it?」</p><br/><p>Their questions satisfied, they all closely held the object in their hands.</p><br/><p>And the magic power swirled around them coiling into the object, giving birth to the monster.</p><br/><p>Of a form the master desired.</p><br/><p>First, mine:</p><br/><p>Of a light existence, a ghost was born.</p><br/><p>Negating all physical attack, a body made of pure magic.</p><br/><p>I’ll omit the status, but it’s special skills were〈Chemical Magic〉and〈Negate Physical〉</p><br/><p>Well, such a ghost would naturally ignore physical attacks.</p><br/><p>Next, Veldora’s:</p><br/><p>Upon his wish, bones stood up.</p><br/><p>A skeleton. It can’t use magic, but it may be learn it later. As a special skill it learned〈Battle Spirit〉.</p><br/><p>But it can’t use it yet.</p><br/><p>Next, Milim.</p><br/><p>A plump and soft body formed. But without limbs. It’s a bright red… slime…</p><br/><p>Hey…</p><br/><p>「Hey, why a slime? Are you making fun of me?」</p><br/><p>「No, I mean, you said… to pick a monster you really like… is it a problem?」</p><br/><p>Right back at me! Damn it…</p><br/><p>Well, at least she’s happy with her slime.</p><br/><p>But why the hell is it red?</p><br/><p>Finally, Ramiris.</p><br/><p>A knight? No, armor?</p><br/><p>She made living armor. A full plate set.</p><br/><p>And her monster is the largest amongst ours.</p><br/><p>I bet she made it particularly large due to her own complex about her height.</p><br/><p>There is nothing inside the armor.</p><br/><p>Well, I guess it fits her.</p><br/><p>Everyone was staring at the monster they created in wonder.</p><br/><p>But the fun was yet to begin.</p><br/><p>「Friends, please listen.</p><br/><p>Our fun has yet to begin. Please sit down somewhere and make yourself comfortable.</p><br/><p>Then, addressing your monster, recite the possession chant」</p><br/><p>Nodding at my words, they found a place to rest.</p><br/><p>It’s Veldora’s room, but he’s got a bunch of chairs and cushions so it’s not hard to find a comfortable corner.</p><br/><p>And we recited the possession chant.</p><br/><p>My consciousness blacked out and quickly returned.</p><br/><p>I felt the radius of my『Magic Perception』decrease along with my overall perception of the world.</p><br/><p>The pseudo-senses are there, so this is still worlds better than when I first reincarnated.</p><br/><p>But the others have probably never experienced anything like it, so it must be tough.</p><br/><p>Once I survey the room I see a skeleton moving around and a slime moving much too fast.</p><br/><p>And a full body of armor moving squeaking along.</p><br/><p>Once they got used to their bodies,</p><br/><p>『This is amazing!』</p><br/><p>They exclaimed.</p><br/><p>Yes, this feels even better than I thought.</p><br/><p>Just like my own body. But my abilities have dropped so it’s hard to move.</p><br/><p>But, after recognizing its abilities it’ll be easy to predict actual movement. I’m already able to move it as I like.</p><br/><p>「Yep, it’s a success.</p><br/><p>Now then, you understand exactly what we should do with these forms?」</p><br/><p>「Ku ku ku. What a foolish question. I already now. It’s a game!」</p><br/><p>「What? Really, Veldora?!」</p><br/><p>「Master! In that case, I must defeat enemies while in this form?</p><br/><p>And this body will grow…?」</p><br/><p>As expected of Veldora.</p><br/><p>He immediately understood what I wanted to do.</p><br/><p>Right, it’s pseudo-VRMMO.</p><br/><p>Err, rather than MMO, is it more of a MO? Well, that doesn’t matter really.</p><br/><p>What’s important is to enjoy the labyrinth we have built.</p><br/><p>「Fufufu, I knew you’d understand, Veldora. You have seen through my plan. Ramiris, we will not defeat enemies. We will conquer this labyrinth. And have these bodies level up! Oh, and of course we’ll slaughter any adventurers in our path.」</p><br/><p>『Ooooh, I see!!』</p><br/><p>Yes, now I see the light in the end of the tunnel! Our faint hope for fun.</p><br/><p>For revival we put on Ramiris’ bracelets–and not those that break after a single use.</p><br/><p>And now,</p><br/><p>「Now then, we need equipment.</p><br/><p>If you can move around now, let’s go see Kurobee for some equipment!」</p><br/><p>「Ah I see! I am no skin and all bone!」</p><br/><p>「Fufu, what a fool. I am the high speed ultra slime! I have no need for any equipment!」</p><br/><p>「Hey, listen. As a piece of armor… what else do I need?」</p><br/><p>「Who knows? He’ll figure something out? Well, let’s go!</p><br/><p>Milim, if you don’t need anything, please watch the house for me」</p><br/><p>「D-don’t be stupid! Even I need to pick out something nice!」</p><br/><p>What a selfish kid.</p><br/><p>Of course, I too want some equipment. Let’s return to our bodies, and go get some.</p><br/><p>「To return just wish to “End Possession.” You’ll then return」</p><br/><p>I told them after returning to my body and storing the gem in a bag.</p><br/><p>By the way, Veldora nad Ramiris returned, but Milim jumped on my lap in that form.</p><br/><p>And,</p><br/><p>「I’ll go like this!」</p><br/><p>She exclaimed.</p><br/><p>She seems to really enjoy it. So childish… well, she’s a kid.</p><br/><p>Kids will be kids, right?</p><br/><p>So we headed out.</p><br/><p>After heading over to Kurobee’s smithy we placed an order for custom made equipment.</p><br/><p>I got a Death Scythe and Hell Cloth.</p><br/><p>Even though I’m a ghost, I can equip it because it is magical equipment.</p><br/><p>Veldora got a Death Sword, Hell Armor, and a Gate Shield–fully protected.</p><br/><p>Milim the slime could only get some really simply equipment.</p><br/><p>Death pick and a Crimson Robes.</p><br/><p>「Can’t get the effect if you don’t equip it, right?」</p><br/><p>She mused with a smile on her face.</p><br/><p>Hey, as long as she’s happy!</p><br/><p>And, Ramiris.</p><br/><p>I had a heavy full plate prepared for her.</p><br/><p>Ramiris was skeptical, and when she had her living armor equip it…</p><br/><p>Her armor absorbed it.</p><br/><p>It then fell to pieces,</p><br/><p>Was scattered with the wind,</p><br/><p>And came together, having changed from Living Armor to Living Custom Armor.</p><br/><p>Not an evolution, but a clear change.</p><br/><p>「Wow! It’s so much easier to move now!」</p><br/><p>As Ramiris said, her armor now moved as if someone had oiled it–really smooth motions.</p><br/><p>Seems like the armor had an effect on her mobility. Never would have expected that to happen.</p><br/><p>Happy Ramiris now went to pick out a weapon.</p><br/><p>「Fufun! I have no need of a shield!」</p><br/><p>She said, and picked the heaviest and largest weapon.</p><br/><p>The Death Axe. It is the most overwhelming weapon, but is also hard to use.</p><br/><p>Well, anything goes, I guess. Normally she gets called a good-for-nothing, so all of this must have really fueled her ego.</p><br/><p>I got to see an interesting part of her.</p><br/><p>Thus, I, having shed physical form, specialize in magic.</p><br/><p>My class is a wizard. Maybe I’ll learn some restoration magic later on.</p><br/><p>Veldora can do anything. He’s also planning on learning some magic</p><br/><p>His class is a magic knight… though he doesn’t know any magic yet.</p><br/><p>Milim is a high-speed, one-shot-one-kill kind of lass. Well, who wouldn’t want to defeat an enemy with a single punch?</p><br/><p>The plan is to have her fall from the ceiling and trap our enemies.</p><br/><p>If it works it’s be great, if it doesn’t? Well, she can just run away then. She is fast.</p><br/><p>In a sense, she’s the perfect slime.</p><br/><p>Her class is an Assassin. We could have Souei teach her, but it’s bad to have pleasure interfere with actual business.</p><br/><p>Ramiris is all about that strength. She may actually be pretty sturdy and reliable.</p><br/><p>Her class is a Berserker. Not that’s she’s mad, but that her swings are dangerous.</p><br/><p>Once she and Veldora get the hang of their classes, they’ll make great tankers.</p><br/><p>Now then, our shiny new gear is ready and equipped.</p><br/><p>Our equipment is ranked unique. But, since we had to make it so that our type of monsters could wear it, its effects are not that high.</p><br/><p>For beginners, though, it is extremely good equipment.</p><br/><p>Well, even if someone tries to steal it, we’ve cursed the equipment so it won’t work.</p><br/><p>Thus, our preparations are in order.</p><br/><p>For us who do not hunger, we had no need to prepare any provisions.</p><br/><p>And our spirits high, we headed to the dungeon… to fill it with adventurers’ blood!</p><br/><p>By the way, as for my body that I left, I planted a piece of my consciousness into it, so I can react.</p><br/><p>Since we can’t play around all the time, my body is in my Tempest office for emergencies.</p><br/><p>So I missed nothing.</p><br/><p>Having thus quickly returned to the labyrinth, we are ready for departure.</p><br/><p>Our adventure has only begun!</p><br/><p>Thus, we enjoyed ourselves a little.</p><br/><p>Though we had some failures, our game proceeded smoothly along.</p><br/><p>Of course, the rest of the world did not stay still.</p><br/><p>I did collect information while having fun, and heard of something I could never have imagined.</p><br/><p>Even we demon lords are not gods. What we do not know we cannot predict.</p><br/><p>Happiness always comes to an abrupt stop.</p><br/><p>Like a midsummer night’s dream, we awaken.</p><br/><p>And upon hearing these news, these days of pure bliss came to an end.</p><br/><p>End of Founding the Demon Capital Arc</p><br/><p>Some translator notes:</p><br/><p>Milim you’re too damn cute!</p><br/><p>…I also want to play this game!</p><br/><p>Damn, I really do like the way Fuse-sensei writes!</p><br/>\n</div>"}