{"title": "Chapter 135 – After the Incident", "id": 135, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-135-%E2%80%93-after-the-incident", "volume_title": "Volume 2", "body": "<h1>Chapter 135 – After the Incident</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Clown’s note: I bet you’re sick and tired of hearing this, but: I’m sorry for the delay! Just finished writing a 17 page memorandum on granting a summary judgment in the 4th Circuit for a 42 U.S.C. § 1983 action… I’ll see if I can finish another chapter soon.</p><br/><p>Demon Lord’s Gambit Arc</p><br/><p>135. After the Incident</p><br/><p>Leon’s subordinate, a knight clad in silver, Alrose suddenly appeared before me.</p><br/><p>Without dallying even a minute after his arrival,</p><br/><p>「Leon-sama is engaged in mortal combat with Kagurazaka Yuuki.</p><br/><p>We beg for your assistance!」</p><br/><p>He exclaimed.</p><br/><p>Umm? Leon you bastard, you slipped out before we agreed on a formal alliance?</p><br/><p>I mean, I don’t really have an obligation to assist, but…</p><br/><p>Oh well.</p><br/><p>I guess this gives me a chance to steal Leon’s prey…</p><br/><p>Besides it would suck if Leon just kicked the bucket from hubris. And I wouldn’t want to let Yuuki slip away again.</p><br/><p>That kind of dangerous guy needs to be killed as soon as possible.</p><br/><p>I guess I might as well go.</p><br/><p>「Alright. Lead the way」</p><br/><p>「Ay! Right this…」</p><br/><p>I decided to interrupt Alrose, and said</p><br/><p>「Actually, I’ll just tap into your memories for a bit」</p><br/><p>I entered his mind without waiting for approval.</p><br/><p>And easily established a thought-link. He did consent to it… afterwards.</p><br/><p>I then contacted Benimaru and Shion and had them begin Yuuki-subjugation preparations.</p><br/><p>Even as I was communicating with them, I was already stepping through space towards the battlefield.</p><br/><p>This is the first time I rely on others’ coordinates to make the jump.</p><br/><p>Even though I am slightly anxious, I have faith in Raphael’s support.</p><br/><p>Thus, without a single blunder, we successfully appeared in the skies above the battlefield. Shion was surely running late.</p><br/><p>But I have Ranga in my shadows, and I can just summon Veldora if need be. First things first is to save Leon…</p><br/><p>Is what I thought.</p><br/><p>But by then Yuuki had already escaped. What. the. hell. Seriously?</p><br/><p>Now then, these is the current state of affairs.</p><br/><p>The land was deformed, reflecting a wonderful battle. Pieces of the mountain were gouged out, and the nearby forests rotted.</p><br/><p>The grounds itself reeks of death, and a single (beautiful) crater was in the center of it.</p><br/><p>The size of the crater basically tells me that this was a typical battle-manga style battle.</p><br/><p>But wait… aren’t we over the Dwarf’s Kingdom? Though there’s a lot of rock between the top and the kingdom itself, with the battle at this scale I wonder if they caused any earthquakes.</p><br/><p>By the looks of it, I can expect at least magnitude four? I can’t see below, but I guess there might be some casualties.</p><br/><p>This isn’t a volcano, but if an earthquake is bad, people might have died.</p><br/><p>We should check the kingdom out. Just when I thought so, Shion appeared.</p><br/><p>「Hey, go see the Dwarf’s Kingdom</p><br/><p>If there’s lots of casualties help out. And tell the king I said hi」</p><br/><p>「Ay, understood. What about the enemies?」</p><br/><p>「Oh, they already ran away. It’s not dangerous anymore, so don’t worry.</p><br/><p>And please try to be polite」</p><br/><p>「Ay!」</p><br/><p>I sent Shion off.</p><br/><p>Shion’s entourage follow suit. She trains them well.</p><br/><p>Wait, don’t I recognize three people with her. Aren’t those Demon Lord Dagrule’s sons?</p><br/><p>Is that fine? To bring another Demon Lord’s sons to battle?</p><br/><p>…what do I care? I’ll just pretend I didn’t know. I’m not responsible!.. Not how it works, you say? Nope! If it bothers you, you lose.</p><br/><p>So let’s pretend I never thought any of this. Rather, let’s go talk to Leon.</p><br/><p>「Well, well, well. Leon, care to explain?」</p><br/><p>Leon is sorting through some meat.</p><br/><p>Seems like he’s digging out a red lump of… oh, it’s parts of a woman clad in red armor…</p><br/><p>After locating the woman, he cleaned up the rest of the flesh with a purifying light.</p><br/><p>When he was finished, he finally looked at me.</p><br/><p>「It’s as you see」</p><br/><p>He said, with a look of “don’t you get it?”</p><br/><p>I do get it~!</p><br/><p>I wanted to scream at him,</p><br/><p>「I want to hear it from you」</p><br/><p>I responded with a smile.</p><br/><p>Did I just see a vein pop on his head?</p><br/><p>Is this silent gentleman mad at me?.. If I were a girl would he still be mad at me?</p><br/><p>…I guess he would. Definitely.</p><br/><p>「We too like to hear an explanation. Of course, in grand detail, Leon.」</p><br/><p>Wonderfully timed, Ruminas.</p><br/><p>She dropped from the sky with her seven sages.</p><br/><p>Seems like Leon sent for Ruminas as well. And she actually came to help!?</p><br/><p>She actually came when called by a person she barely knows?</p><br/><p>「Hmph. So you came. I thought I could handle that human Yuuki.</p><br/><p>My bad, I let him get away. I underestimated him」</p><br/><p>Leon confessed when we both pressed on.</p><br/><p>But before he explained what had occurred.</p><br/><p>In the midst of gouged earth and rotting forests, an elegant tea set.</p><br/><p>The Seven Sages began preparing tea. As Ruminas was lying relaxed on a sofa they set, and Leon was sitting in an elegant chair.</p><br/><p>Hey… just how comfortable are you going to get?</p><br/><p>「Please, here」</p><br/><p>A sage with a young voice directed me into a comfortable chair. And I sat.</p><br/><p>It was really comfy. What a fine chair it is.</p><br/><p>Another sage was fanning Ruminas. Our tea party would have seemed eerie to onlookers, but I guess I shouldn’t mind it.</p><br/><p>「Well then, explain」</p><br/><p>Ruminas said, and Leon began explaining.</p><br/><p>In short, after my visit Leon decided to attack Yuuki alone. And the result is as we see here.</p><br/><p>There’s two reasons why he didn’t invite us.</p><br/><p>He underestimated Yuuki and didn’t want to reveal his power.</p><br/><p>「In other words, if we fought together would you fight at full strength?」</p><br/><p>Ruminas and I had trouble responding to Leon’s question.</p><br/><p>「Why, of course we would. We trust thee」</p><br/><p>Ruminas responded with a smile.</p><br/><p>What a blatant lie. Wait, weren’t monsters unable to lie?!</p><br/><p>I remember that our existence gets erased or something like that</p><br/><p>≪Solution. Beings who have surpassed the bounds of flesh, those who achieved spirit bodies are able to lie≫</p><br/><p>Ah, I see.</p><br/><p>I guess Milim can also lie without a problem.</p><br/><p>So if you’re strong it’s alright. Whether that’s right or not, who knows, but let’s proceed on this assumption for now.</p><br/><p>As for Ruminas’ lie–well, maybe it’s not a lie, maybe she would have fought with all her might–whether we came here or not may not have changed the outcome at all.</p><br/><p>After Yuuki had awakened his ultimate skill, we might have just hid our powers and managed to stall him.</p><br/><p>Frankly, I too was willing only to reveal Gluttonous King Beelzebub, and hide the rest.</p><br/><p>We are fellow Demon Lords but are hardly friends. No, we are allies, but that doesn’t mean I can trust them with my life.</p><br/><p>I had no choice but accept Leon’s words.</p><br/><p>In the very end, Leon lost a subordinate and Yuuki escaped death.</p><br/><p>But fortunately, the Black Knight Claude was able to sneak into Yuuki’s camp.</p><br/><p>Yuuki had brainwashed him once, but Chloe set him straight. Her methods are unclear, but we should be fortunate that she can reverse mind control. Yuuki probably did not notice, so Claud will continue to spy on him.</p><br/><p>And yet we must stay vigilant against Yuuki’s ability.</p><br/><p>Steal life, steal one’s heart. And convert another’s energy into one’s own, what ability could it be?</p><br/><p>≪Solution. He likely possess ultimate skill Greedy King Mamon≫</p><br/><p>Huh? You know that much?</p><br/><p>Seems like Raphael was able to arrive to an answer in a second. Seems like it is a higher level steal ability, and Raphael does not think it dangerous to me at all,</p><br/><p>Among skills of our level it is the weakest.</p><br/><p>…where does Raphael get all that confidence from?</p><br/><p>Ands is it just me, or did Raphael seem really smug when dissing Mamon? Well, we should be fine as long as we don’t let our guard down.</p><br/><p>After listening to Leon’s explanation we decided to wait for Claude to contact us.</p><br/><p>The only problem remaining is the fact that Milim’s pet dragon was resurrected.</p><br/><p>And it’s a big problem.</p><br/><p>This really will be a pain for us to solve…</p><br/><p>「Hmm? Oh, you are friends with Milim right? I’m glad to have you here」</p><br/><p>Leon said with a bright smile on his face.</p><br/><p>Why did he suddenly become so happy?</p><br/><p>Wait, this bastard isn’t planning…</p><br/><p>「Well, we have heard enough, and ’tis time for us to bid you adieu」</p><br/><p>Ruminas is ready to dash.</p><br/><p>How devilish!.. Well, she is a demon lord. So I guess I am the one at fault for expecting her cooperation.</p><br/><p>Though I could never hope to be forced to clean up this mess…</p><br/><p>Hmm? Alrose and Blue are kneeling in front of Red Knight.</p><br/><p>They can’t possibly think her to still be alive?</p><br/><p>I looked closely. She is 100% dead. Normally that would be it, but…</p><br/><p>「Hey, Ruminas. Can’t you reverse death?」</p><br/><p>「Tch. Do not spout other’s secrets, plebian!」</p><br/><p>「Ah, my bad. But hey, look ‘ere」</p><br/><p>With an empty apology, I called Ruminas over.</p><br/><p>Ruminas came over, despite preparing to leave a second ago.</p><br/><p>「We see, she may be dead, but she may live agani」</p><br/><p>Ruminas pronounced her judgment after looking at the girl.</p><br/><p>This girl still has her soul. Two souls to be exact.</p><br/><p>「Really?! Sis is alive?!」</p><br/><p>「Nay, she is not alive. Nor is she dead.</p><br/><p>Death is but a state of the body; true death is the vanquishing of the soul.</p><br/><p>This girl still has her soul. So she is not dead」</p><br/><p>「But this is strange. Why did her soul not disappear upon death?」</p><br/><p>Normally, a soul disappears when its vessel is destroyed.</p><br/><p>Beings like I can survive death of the flesh, but normal monsters and people are different.</p><br/><p>So how could this be?</p><br/><p>≪Solution. Mamon’s ability brings one’s life to absolute zero, but this is the merely the state of apparent death≫</p><br/><p>I see, thank you Raphael-sensei.</p><br/><p>Now then, why does she have two souls? Did you catch on already?</p><br/><p>≪Solution. I have, Chaos Dragon’s soul is mixed in with ers.</p><br/><p>Nor is it in its cursed state, but rather has been purified≫</p><br/><p>…S-Seriously?!</p><br/><p>If there’s no curse, we can revive them both. More than avoiding Milim’s wrath, we would attain her eternal gratitude!</p><br/><p>「Hark, you all. We must resurrect this girl at all cost.</p><br/><p>I have caught on something amazing, and wish for you to listen」</p><br/><p>And thus I told them about Raphael-sensei’s conjectures.</p><br/><p>Judging by Blue’s words, they must be related to this red one. He seems like he wants to say something, but Alrose is preventing him from doing so.</p><br/><p>When Demon Lords converse mere servants have no say. But it’s his own sister, so he can hardly contain himself.</p><br/><p>I’ll keep his thoughts in mind when we make a decision.</p><br/><p>We can separate their souls. I have a jewel to plant the soul into as well.</p><br/><p>Using it as the core, we would be able to resurrect the dragon. But it would greatly weaken–which is the problem.</p><br/><p>But Milim will probably be fine with it. I don’t think she would want him for his strength.</p><br/><p>To that end, we need to resurrect Red. So Ruminas’ help is needed.</p><br/><p>Doctor Ruminas, it’s time you reverse death itself!</p><br/><p>She probably doesn’t want to show us this skill. With a face full of displeasure, she eventually gave in.</p><br/><p>I guess she also doesn’t want to see a mad Milim; or maybe she’s just nice.</p><br/><p>「Ruminas, you aren’t a tsundere by any chance?」</p><br/><p>Say it again and you’re dead, was her response.</p><br/><p>Since it seems a bit dangerous, I think I’ll end the teasing here.</p><br/><p>Red was revived, resulting in Blue crying in thanks to Ruminas and I.</p><br/><p>Just leave me alone, I didn’t do anything.</p><br/><p>Thus the post-battle clean-up concluded.</p><br/><p>I deposited the jewel into my stomach. As for Milim, it was unanimously decided–without a single word–that I’ll be handling it.</p><br/><p>Well, that’s to be expected.</p><br/><p>No one would want to face that degree of danger.</p><br/><p>Leon and Ruminas promised to let the rest know before acting in the future.</p><br/><p>They’ll be using me as an intermediary between them, so thus the Demon Lord Yuuki Subjugation Group was formed.</p><br/><p>Human Countries and Demon Lords.</p><br/><p>Many powerful allies surround Tempest.</p><br/><p>These relationships will continue to develop from now on.</p><br/><p>Even as a turbulent storm was approaching…</p><br/>\n</div>"}