{"title": "Chapter 145 – Underground Labyrinth Capture-Capture of Irresistible Force-", "id": 145, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-145-%E2%80%93-underground-labyrinth-capture-capture-of-irresistible-force-", "volume_title": "Volume 2", "body": "<h1>Chapter 145 – Underground Labyrinth Capture-Capture of Irresistible Force-</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Underground Labyrinth Capture-Capture of Irresistible Force-</p><br/><p>The report both surprised and shocked us.</p><br/><p>It was about the appearance of people who finally captured the Dungeon’s 50th floor.</p><br/><p>Certainly, this year the adventurers had improved their skills considerably.</p><br/><p>Groups that were able to capture the 30th floor had gradually begun to appear. The devised floor capturing strategies used the phenomenon known as barely escaping death, Zombie Attack Plan (Coming back from death Strategy)[1] or Abandoning Scapegoat Plan (For Glory Strategy)[2] and so forth.</p><br/><p>There were people that used a frontal attack as well, accompanied by the proficiency of their skill and the improvement of their equipment, they also had their ability improved.</p><br/><p>But, after the 30th floor, not only was there a trap that killed everyone at the beginning, the monsters also came groups and fought together.</p><br/><p>It becomes difficult to handle that when using the unorthodox capturing methods.</p><br/><p>So, the most recent leading capture group was mimicking the capture method that Masayuki and his party used against the guardian of the 40th floor but...</p><br/><p>The guardian of 40th floor was Tempest Serpent.</p><br/><p>It was the black snake I had met way back in the beginning. It had breath attack that was effective against groups, and many people had watery eyes after their equipment was destroyed by it.</p><br/><p>Then, because I was nice, I kindly rent them equipment with the Tempest crest.</p><br/><p>They would need to compensate us if they broke.</p><br/><p>Well~ the earnings they got till now were completely deprived, we thought that it was a reliable guardian that would bring us a wonderful fortune.</p><br/><p>If a person that could defeat it appeared, then...</p><br/><p>Besides, the guardian of the 50th floor was Gozurl. He was violence incarnate when his restraint were removed.</p><br/><p>After all, Gozurl wasn’t weak. Either way, maybe thanks to the restraints placed on him while on the 30th floor, he was able to come up with a creative way of battling for this floor.</p><br/><p>The old, foolish Gozurl, that only depending on his own strength, had disappeared.</p><br/><p>It was the same with Mezurl. Wracking his brains together with Gozurl, the two devised their fighting style by discussing with each other.</p><br/><p>Before we were aware of it, the arguments they would hold whenever they met were now forgotten, and the two had become close friends now.</p><br/><p>The two alternated guarding the 50th floor.</p><br/><p>I remembered that I set the equipment drop to 100% for the first time win only, as a reward in case someone was able to defeat them.</p><br/><p>It was a unique class equipment, the Minos series.</p><br/><p>It was equipment that boasted very nonsensical power named after the ruler of labyrinth, Minotaur.</p><br/><p>The weapon was either a Minos Bardiche (Cow-Head Devil’s Battleaxe)[3] or a Minos Trident (Horse-Head Devil’s War Spear)[4].</p><br/><p>There was no shield. After that was the pieces for a complete set of armor.</p><br/><p>It was the jewel which Kurobee’s best disciples had used the best of their ability to create.</p><br/><p>Because I believed that there wouldn’t be many people capable of reaching this place so easily, I had only prepared 10 sets, and no more.</p><br/><p>In the first place, Gozurl and Mezurl had become stronger after I gave them names, so if a person capable of defeating them appeared, I might scout them.</p><br/><p>Because of this, I had arranged that an emergency message would be sent if they were defeated.</p><br/><p>Either way, if a lot of adventurers attacked them in waves, the two would accumulate fatigue and be defeated.</p><br/><p>But no matter the methods the adventurers used to defeat them. I wanted to know about the people that manage to defeat Gozurl and Mezurl.</p><br/><p>In case they didn't want to be scouted, there was a possibility that the other party was hostile.</p><br/><p>This time as well, were they attacking in waves because of Masayuki's charisma?</p><br/><p>When I thought so, my expectations were overturned.</p><br/><p>In the report, it was said that Gozurl was defeated by just three people.</p><br/><p>Furthermore, they weren’t people that had been active recently, they seemed to be newcomers that had arrived recently.</p><br/><p>It was necessary to promptly collect information on the newcomers.</p><br/><p>That was why I cancelled the long awaited test-run of the improved surveillance magic, and went to the command room that had been prepared inside the labyrinth.</p><br/><p>When I entered the room, Ramiris and Veldora were there.</p><br/><p>Dino and Bester seemed to have taken a day off today.</p><br/><p>Disregarding Dino, Bester had accumulating fatigue since he had come to this place recently, so it was just perfect for him.</p><br/><p>Ramiris and Veldora were full of energy. These two people were probably strangers to the concept of tiredness.</p><br/><p>It was the so-called “children’s stamina.”</p><br/><p>If children were doing things that they were interested in, then they wouldn’t get tired at all.</p><br/><p>「Oh, you came, Commander! There's no change in the situation today!」</p><br/><p>I didn’t understand what was it that hadn’t changed.</p><br/><p>Perhaps, she might have said it because it suited the mood.</p><br/><p>I looked at the picture projected onto the big screen.</p><br/><p>Projected onto the screen were three youngsters.</p><br/><p>It seemed they traversed the floor with like an unstoppable force. The way they fought was really unique as well.</p><br/><p>With a clearly abnormal throwing power, there was a person that grabbed air and threw it.</p><br/><p>He had a large, sturdy build, and brown hair. With his fine, chiseled features, he had a considerably good appearance.</p><br/><p>He wasn't wearing heavy equipment like iron armor, instead he was wearing chain mail made from weaved steel fiber, and a coat over it.</p><br/><p>They all looked pretty much the same.</p><br/><p>The skinny one had concealed his entire body with a pitch black robe, another one seemed to be wearing a white robe over the chain mail.</p><br/><p>He looked Asian, and the white robe was the kind often seen in hospitals.</p><br/><p>In every aspect, he was Japanese-like. Without a doubt, he seemed to be an \"Otherworlder\".</p><br/><p>A group of six Death Wolves (Ghost Wolves) came running. With a speed that typical adventurers couldn’t perceive, the wolves closed the distance in a dash.</p><br/><p>It seemed to have judged the situation instantly from a distance, it would only receive attacks one-sidedly.</p><br/><p>As expected of the monsters above the 50th floor. Even a monster that looked like a small fry had considerable intelligence.</p><br/><p>By the way, one Death Wolf is considered B+ rank, so it spelled trouble if six of them gathered.</p><br/><p>It was also a Ghost-type monster with the trait of nullifying damage if they weren’t attacked with a Holy attribute weapon or a Magic weapon.</p><br/><p>Even if its body vanished, it would regenerate immediately. So even just one wolf was dangerous if you didn't possess the countermeasure for it.</p><br/><p>You would be devoured instantly if careless...</p><br/><p>「Don't underestimate me, you dogs! Uoryaaaa!!」</p><br/><p>The one with brown hair who had been grabbing and throwing air until now, took out an ominous battleaxe and swung it powerfully.</p><br/><p>With one sweep, three Death Wolves turned into light particles and disappeared.</p><br/><p>Ah, that ominous battle axe, I soon remembered that it was Minos Bardiche.</p><br/><p>It was a Unique class equipment, and naturally, it belonged to the Magic weapon category.</p><br/><p>Even if someone couldn’t cast magic, it was still possible to damage a monster with the magic power possessed by the weapon.</p><br/><p>Furthermore, this was related to the raw materials used to make the Minos series. Silver that had been mixed with Demon steel and turned into Mithril.</p><br/><p>It was a specialized weapon that could easily inflict a great deal of damage to Undead-type and Ghost-type monsters.</p><br/><p>「Ah, if it's Minos Bardiche, then Death Wolf will be defeated in one blow.」</p><br/><p>「Yeah. That weapon is the thing that Gozurl dropped.</p><br/><p>The combat sense and weapon adaptability of the person that picked up the weapon seems to be great.」</p><br/><p>Veldora agreed with my grumble.</p><br/><p>After that, I heard the story of their battlesuntil now while observing their combat style.</p><br/><p>As for the snack, nowadays, I preferred potatoes.</p><br/><p>Based on the story I heard about them, their battles until now were mostly of that brown-haired guy defeating the enemy.</p><br/><p>I saw it myself and understood it. The brown haired guy was certainly strong.</p><br/><p>But, what happened to the various traps in the labyrinth?</p><br/><p>Regarding those, the black robed guy smoothly discovered them, and seemed to have told his friend their position.</p><br/><p>As for incomprehensible traps or tricky traps, those were a crucial part from the 50thfloor and below.</p><br/><p>As if he could see it, the black robed guy precisely indicated the trap's location.</p><br/><p>I was certain that it was some kind of ability. You could say that he was an indispensable person for capturing a labyrinth.</p><br/><p>The last one was the white robed guy, his turn had only come up once until now. That was during the fight against Gozurl.</p><br/><p>I had seen the footage through the Thought Link, but I was certain that this fellow was also someone with a Unique class ability.</p><br/><p>He had taken out syringes from his pocket, and given them to his two companions.</p><br/><p>Immediately after that, Gozurl's movement had rapidly became dull.</p><br/><p>He might have received some kind of abnormal status, but as Gozurl's movements became dull, he became an easy mark for the brown-haired guy.</p><br/><p>The one who landed the finishing blow was the white robed guy.</p><br/><p>He had taken out a scalpel that shone silver, from his pocket, and in an instant, he had cut the blood vessels on Gozurl's nape.</p><br/><p>I noticed that he was from the intelligence faction, which assesses the situation and takes the time to wait for a change in the situation, unlike a muscle head that didn't think about anything.</p><br/><p>Their party was very balanced.</p><br/><p>《Notification. The result of the analysis is in. The attack that “Individual: Gozurl” received was something similar to a neurotoxin.</p><br/><p>The room was filled with poisonous gas, the poison obstructs the movement of those who lack immunity to it. There is no remaining effect now.》</p><br/><p>Ah, poisonous gas.</p><br/><p>And in addition, he seemed to be able to come up with strategies that worked against the enemy, on the spot.</p><br/><p>I considered the results of the analysis, which Raphael had made based off of the data, which remained in the air.</p><br/><p>I’d guessed based off of his white robe, but there’s probably no doubting that was a medical-related Unique Skill[5].</p><br/><p>At that time, I heard a knocking sound from the door. Then the door opened, and Shuna entered the room.</p><br/><p>She came in holding an entry paper, which had the registered information of the three from the Adventurer’s Guild, which had became a branch of the committee.</p><br/><p>「This is the registered information of the three that succeeded in capturing the 50th floor.」</p><br/><p>Shuna handed over the paper after bowing.</p><br/><p>I received it with a nod and confirmed its contents.</p><br/><p>Shinjy ..... 23 years old, Wizard[6]</p><br/><p>Mark ..... 26 years old, Warrior[7]</p><br/><p>Zhen ..... 17 years old, Hunter[8]</p><br/><p>So, only the minimum information had been filled out.</p><br/><p>Their place of origin was a small country near the Empire, the reason for coming here that was written on the paper was that they had heard rumors about the Dungeon from a merchant.</p><br/><p>Well, well, that was a lie no matter how you looked at it.</p><br/><p>If I recalled correctly, Magicians needed to make a contract with spirits to use magic ―― Sorcerers handled chants based on their knowledge of elements―― Wizard was a high-rank job that needed the expertise of both jobs.</p><br/><p>It was a lofty, and difficult, occupation that not everyone could attain.</p><br/><p>Warriors were similar in that they needed both the expertise from the Fighter job and the Swordsman Job, because a Warrior was a close combat expert capable of using every type of weapon.</p><br/><p>Obviously, it wasn’t an easy occupation to attain.</p><br/><p>We arrived at the last one, a Hunter. This occupation could be called the peak for those who hunt monster. It was an occupation that relied mostly upon, and belonged to, the subjugation guild.</p><br/><p>In this world, there were few people with excellent skills in detecting traps or monsters with the Thief job.</p><br/><p>That was because, currently, Thief really meant thief in the truest sense.</p><br/><p>Meanwhile, calling oneself a Hunter was possible since there was no native hunting tribe here.</p><br/><p>Certainly they were a good, balanced party, but if it was true that they had come from the Empire, without a doubt, they were Spies.</p><br/><p>However, were they foolishly honest enough to have written the truth?</p><br/><p>They might have done that, but I thought that there were other choices, like they could have decided to say that they came here from the Demon Lord territory under Milim's rule, or from another continent under Leon’s rule.</p><br/><p>Oh well.</p><br/><p>The truth didn’t matter, there was one person which I surely needed to pay attention to.</p><br/><p>The black-haired, white robed, young man, Shinjy.</p><br/><p>Instead of Magic, he was using a mysterious ability.</p><br/><p>Or rather, Shinjy... no matter how you looked at it, it was Shinji.</p><br/><p>The brown-haired guy was Mark.</p><br/><p>He had not only thrown air bullets and monster's corpses, but falling rock as well...</p><br/><p>Anyway, it seemed he could throw anything as long as he could grab it.</p><br/><p>He grabbed a living monster and threw it, inflicting damage to both enemies, and defeated them together, which almost made me spew out the tea.</p><br/><p>But it seemed his being a Warrior was not a lie, since he handling Minos Bardiche skillfully.</p><br/><p>The black robed guy was Zhen.</p><br/><p>This guy seemed to have eyes capable of seeing through traps perfectly.</p><br/><p>In the beginning I had thought that his intuition was sharp but it seemed to be Sense Danger, Sense Monster, and Sense Trap. With all of those, he managed to evade everything beforehand.</p><br/><p>He looked at the places with traps, and conferred their location to his friends, and I was certain that it wasn’t a coincidence.</p><br/><p>Originally, on the 50th floor and beyond, there were increasingly brutal traps that became the main threat instead of the monsters’ strength.</p><br/><p>Without looking strange, the room could have been filled with Ghost-type monsters, had its air pressure changed, been without oxygen, or had poisonous water.</p><br/><p>Like that, I had set traps of a dangerous level to prevent the capture of the dungeon, but everything was seen through by him, so they were all useless.</p><br/><p>Moreover, his sense of direction was also excellent. He wasn’t deceived by the floor’s rotation and the like, and easily advanced using the shortest route.</p><br/><p>Obviously, a maze wasn’t effective.</p><br/><p>If there was an injury, the white robed youth, Shinjy, could easily treat it.</p><br/><p>Although they were just three people, they were people specialized in capturing labyrinths.[9]</p><br/><p>However, the three of us joyfully watched their method of capturing the dungeon.</p><br/><p>No, there was no way that we would use them as a reference for when we were going to capture the dungeon, or anything like that, don't you think like that!</p><br/><p>Hey, you over there, I was only honestly praising the strong person’s way of fighting.</p><br/><p>Shuna poured the three of us another cup of tea while astounded.</p><br/><p>The tea today was Black Tea with the pleasant fragrance of apple.</p><br/><p>Starting from the 50th floor was the real thing, but the degree of difficulty didn’t change even if there was someone that hadn’t activated the trap until the 50th floor.</p><br/><p>If that was so, I thought that to truly test their ability, I would use the result of whether they could defeat the 70th floor’s guardian or not.</p><br/><p>The guardian of the 60th floor was the Ghost King Adalman.</p><br/><p>It was a high-ranking Undead King that looked like a polished skeleton.</p><br/><p>It was a high-ranking Priest who had gone to purify the dead spirits that had gushed forth from the remains of a battlefield in Jura Great Forest, but he had become the shadow of his former self after becoming an undead, because of an undead’s abnormal status, that is, undeadification.</p><br/><p>But, as a result, Priest Adalman had become an Undead with enormous magic power, though it was a case of the tail wagging the dog.</p><br/><p>It had become the King of Ghosts with that magic power, and seemed to spend its time quietly in a cave.</p><br/><p>When I assumed the position of Demon Lord, I specially went to greet him. At that time, it was almost purified, it wasn't a funny story.[10]</p><br/><p>That him, was guarding the 60th floor.</p><br/><p>Unfortunately, I believed that those three were at a disadvantage.</p><br/><p>Ghost King Adalman had a fighting power beyond A rank [EP:44,000].</p><br/><p>Naturally, he had a higher rank than Gozurl and Mezurl.</p><br/><p>His strength was not on par with the devils, but it couldn’t be helped since its weak point was too obvious.</p><br/><p>He was awfully weak to the Holy attribute and Light Attribute.</p><br/><p>He was an extremely troublesome being if you fought it seriously since it could summon Ghost Knights and Ghost Wolves endlessly――If he attack a town, he would be acknowledged as a Disaster――Although it could be said that they also shared the same attribute weakness.</p><br/><p>Therefore, for this floor, since they would have gotten used to the traps, I had set an easy to clear boss.</p><br/><p>The people who were able to defeat Gozurl and Mezurl using only brute force, may defeat it easily if they only paid attention to the attribute’s weakness.</p><br/><p>Moreover,</p><br/><p>「It was a mistake, with Minos Bardiche they could defeat an enemy with one blow...</p><br/><p>That thing was made from Holy attribute Mithril, it delivered double the damage to Undead-type and Ghost-type enemies.」</p><br/><p>「Because of the limited, first-time-only, service, or something like that, they got a bit cocky, right?」</p><br/><p>So.</p><br/><p>I did something bad to Ghost King Adalman.</p><br/><p>Unfortunately, he wouldn’t be capable of stopping those three.</p><br/><p>Well it might have been my fault, but I hoped he could forgive me.</p><br/><p>So, as I thought that, I was looking forward the guardian of the 70th floor.</p><br/><p>[1] り (ゾンビアタック) Shi modori sakusen (Zonbi Atakku).</p><br/><p>[2] ののに(イケニエおきざりプラン) Eikou no Na no shita ni sakusen (Ikenie Okizari Puran)</p><br/><p>[3] の(ミノスバルディッシュ) Gozu Majin no Senpu (Minosu Barudisshu).</p><br/><p>[4] の(ミノストライデント) Mezu Majin no Senyari (Minosu Toraidento).</p><br/><p>[5] Originally the kanji used is  for Doctor. But I changed it to match the skill ability, you will know about the skill’s ability in the next chapter.</p><br/><p>[6] Madoushi(Wizādo) (ウィザード) - Magic Master (Wizard)</p><br/><p>[7] Sentoushi (Wōria) (ウォーリア) - Combater (Warrior)</p><br/><p>[8] Shuryouka (Hantā) (ハンター) - Hunter</p><br/><p>[9]As in capturing/conquering/clearing Dungeon.</p><br/><p>[10] The line is a bit vague, it’s either Adalman that almost been purified or Rimuru. There weren’t enough details about it.</p><br/>\n</div>"}