{"title": "Chapter 149 – Night Before the War Begin", "id": 149, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-149-%E2%80%93-night-before-the-war-begin", "volume_title": "Volume 2", "body": "<h1>Chapter 149 – Night Before the War Begin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Night Before the War Begin</p><br/><p>An Imperial Conference was about to begin in front of the Emperor.</p><br/><p>The situation now was different from the time of peace. Tension spread among the civil officers that sat in a row much less the officers that participated.</p><br/><p>People that didn’t have any relation to the conference didn’t come near the big conference room, as if they had felt the atmosphere there.</p><br/><p>Everyone felt that this time, the conference was different from a usual one.</p><br/><p>When the arrival of emperor was announced, everybody lowered their head at once.</p><br/><p>The Union Emperor, Ludra Nam Ul Nasca.</p><br/><p>The top of Nasca Namrium Ulmeria Eastern Alliance Union Empire, the strongest country.</p><br/><p>To ensure that his true disposition would not be known to others, his figure was hidden behind the blinds, and could not be seen. </p><br/><p>To make him the one and only, Supreme Ruler.</p><br/><p>There were only a few people who could give their opinion to the Emperor.</p><br/><p>In the conference room, there were a little less than 100 people.</p><br/><p>The leader of each corps, and their aides.</p><br/><p>The elites of the guard army were sitting in a row.</p><br/><p>The ministers that conducted the government of the country, and grand noble houses that were the center of the country.</p><br/><p>All distinguished faces gathered and lowered their heads.</p><br/><p>When the Emperor glanced at the gathered people from the other side of the blinds, he took a seat with an uninterested mood.</p><br/><p>The prime minister took it for a sign and signaled to everyone with his eyes.</p><br/><p>Everyone understood it and simultaneously, words of salutation resounded, causing the large room to tremble..</p><br/><p>The Emperor commanded with one hand,</p><br/><p>「Enough with the stiff formalities. We don’t desire such things. Just start」</p><br/><p>The Emperor ordered the start of the conference.</p><br/><p>Thus, the grand conference that would decide the start of the war, that would be carved in history, began.</p><br/><p>First, what was the reason to start the war?</p><br/><p>It was a silly question.</p><br/><p>They thought it was because the Emperor wanted it.</p><br/><p>Was that possible?</p><br/><p>The opinions was greatly divided.</p><br/><p>There was someone who advocated a careful basis, and there was someone who insisted on invading directly from the front.</p><br/><p>The civil officers insisted that they should begin with diplomatic negotiations such as threats and other tactics.</p><br/><p>Starting the war was the Emperor’s intention, there was no place to raise an objection.</p><br/><p>If there was someone that said the preparation was lacking and the chance of winning was low, that person would receive criticism of being called an incompetent who could not do any preparations properly.</p><br/><p>Anyway, not only had their preparations been completed, there were people who were confident in their absolute military force. There was no one who would make such an assertion be known.</p><br/><p>However... </p><br/><p>「With all due respect, Your Majesty. I’m against it」</p><br/><p>One person reported that he was against the war.</p><br/><p>Gadra, the Imperial Court Magician.</p><br/><p>He was the person that was called the Empire’s great magician.</p><br/><p>Gadra spoke out, without fear of the Emperor, and told the Emperor his own thoughts.</p><br/><p>「I think that there should be no problem if we only attacked the west side.</p><br/><p>However, the wicked dragon Veldora is in the Jura Great Forest.</p><br/><p>Also, it’s the territory ruled by the Demon Lord Rimuru who made his name widely known recently.</p><br/><p>It seems likely that the wicked/evil dragon has joined forces with Demon Lord Rimuru..</p><br/><p>To act of mutual non-aggression is the usual course against a Demon Lord.</p><br/><p>It’s a different story if it is the other party that starts it though,</p><br/><p>Was there any kind of meddling from this side….?」</p><br/><p>Some of the civil officials nodded in agreement with Gadra’s opinion, but,</p><br/><p>「You fool! Have you become a coward, Roushi!?</p><br/><p>If it’s us, the Empire’s strongest Magic Beast Corps, we can handle someone like a Demon Lord you know!」</p><br/><p>「What insolence!! Does Gadra-dono intend to go against the Emperor’s thoughts!?」</p><br/><p>「HaaHaaHaa, Roushi-dono. You have grown old.</p><br/><p>Your magic knowledge is the Empire’s treasure.</p><br/><p>Although you have cooperated in the development of the new type magic weapon of our Armored Corps…</p><br/><p>I cannot let that remark go! Are you a coward?」</p><br/><p>Gadra was bathed in sneers from both the military authorities and the nobles.</p><br/><p>Amongst the ministers, that only thought about the imagined profits they would get, was one person who rolled his eyes and didn’t seemed to be amused from Gadra who objected the war.</p><br/><p>「You lot… do you understand? That wicked dragon is the strongest species in this world that rules over storms you know?」</p><br/><p>「Roushi, I don’t understand. The empire army is different from before.</p><br/><p>We have learned the knowledge of various places of the many different worlds, the thing called “Science”. We have obtained the new technology system which is called magic science.</p><br/><p>With this new technology, our military force has increased its power dozens of times from the first generation.</p><br/><p>Isn’t it because of outdated magicians like you, even now, you still have a bitter experience of having your own corps dissolved!!」</p><br/><p>Calgurio, the commander of Armored Corps, argued against Gadra’s words.</p><br/><p>In fact, the Magic Corps that was once called one of the Empire’s three great corps was dissolved, nowadays any capable person will get assigned to Technology Department or other department.</p><br/><p>The reason there was no movement from the Empire in these few decades, was because a military reorganization had happened and given birth to the new Three Great Corps.</p><br/><p>Armored Corps, the corps where science and technology of the different world fused as magic technology.</p><br/><p>The Empire’s corps with the largest size, the number of total soldiers that could be mobilized exceeded 2 million.</p><br/><p>However, in reality the number of soldiers who could participate immediately in the military deployments is 1 million since some of the forces were on standby in every place in the Empire.</p><br/><p>Even so, the scale of the corps could be said as abnormal.</p><br/><p>It was arranged to select the best war potential for this time.</p><br/><p>As for the breakdown,</p><br/><p>Armored Remodeled Legion… </p><br/><p>-Legion of soldiers who received magic remodeling by magic and technology of the different world. </p><br/><p>-The individual ability increases and has ability considerable to B-A ranks.</p><br/><p>-Even at the lowest, the corps consisted of people stronger than C+ rank. Number of soldiers affiliated, 700,000 people.</p><br/><p>-It’s the star unit that was called the Empire main force.</p><br/><p>Magic Tank Division… </p><br/><p>-Magic Tank 4.000 unit. Number of soldiers affiliated, 200.000 people.</p><br/><p>-The Empire’s secret weapon, piloted by 5 people. The main armament is Magic cannon.</p><br/><p>-Optimized by other world’s technology, the cannon amplifies magic and fires it.</p><br/><p>Aerial Fighter Legion…</p><br/><p>-Airship 400 aircraft. Number of soldiers affiliated, 100.000 people.</p><br/><p>-One aircraft can be boarded up to 400 people.</p><br/><p>-To operate it, needs about 50 staff.</p><br/><p>-The other personnel is engaged in bombardment relations. It’s useful as transportation means.</p><br/><p>-It could be said that there’s no concept of air supremacy in this era.</p><br/><p>-While the enemy is caught unprepared, it’s a threat that can become a transport for a large scale military deployment.</p><br/><p>-A lot of Magic Reinforcement Cannons were installed on the airship, many member of former Magic Corps were affiliated with this corps.</p><br/><p>The above was the actual force of the Armored Corps.</p><br/><p>In the Armored Corps, half of the affiliated member were given a forced magic remodeling.</p><br/><p>The degree of the remodeling fluctuated suitably, but everyone's ability increased greatly, although there was some degree of differences.</p><br/><p>It’s the same with the soldiers standing by in various places in the Empire, everyone had strength above a certain level.</p><br/><p>It overwhelms even the union of other countries in both quality and quantity.</p><br/><p>It’s a corps that showed the might of the Empire.</p><br/><p> The magic beast corps captured various magic beasts, bred, strengthened, and trained them.</p><br/><p>The culture of the magic beast was by DNA analysis, the technology of the other world.</p><br/><p>And, the strong people of the empire riding on their back.</p><br/><p>Inborn strong people were said to have the blood of the hero who played an active part in the old times.</p><br/><p>If magic remodeling was a technique to change an ability-less person into a hero, they are born heroes.</p><br/><p>Born Heroes having an overwhelming ability.</p><br/><p>A minor Corps with only 30,000 personnel was said that one of them had the ability of 10,000 people.</p><br/><p>But, the magic beast they rode, all had the strength appropriate to A- Rank.</p><br/><p>It’s a Corps with only 30,000 people that call themselves the strongest elite corps that the Empire boasts of.</p><br/><p> The last entry, Mixed Corps.</p><br/><p>This corps, so to speak, was a mish and mash.</p><br/><p>The den of dropouts, where black sheep were gathered, or so the people generally thought.</p><br/><p>However, while it may be true that they were dropouts, it didn’t mean they don’t have ability.</p><br/><p>It may be said that various experiments and new trials are carried out by this corps.</p><br/><p>The corps own their own technology development department, it also have magic research department, their potential was unknown.</p><br/><p>This corps employs the most Otherworlders as combatants.</p><br/><p>The total number of soldiers, 200,000 people.</p><br/><p>However, a lot of them were intelligence officers and general office work soldiers, the number of soldiers that can actually fight were around 100,000 people.</p><br/><p>In disfavor of Magic Remodeling, people who can’t ride magic beasts and people of the former magic corps that have no place to go were taken into this corps.</p><br/><p>But, it had been already recognized that the forces were more than the former magic corps although it was such a jumble.</p><br/><p>Despite its newly created status, it tied against the Armored Remodeled Legion in a mock battle though it’s under the same number condition.</p><br/><p>A high future was anticipated from this corps.</p><br/><p>Its flexibility came due to the condensation of the good points and then reorganized it. It’s a Corps that was established with such a purpose.</p><br/><p>These are the Empire’s New Three Great Corps.</p><br/><p>A large force.</p><br/><p>1,130,000 soldiers may went to the frontline without any problem even if an order for a military campaign was given right now.</p><br/><p>Judging from the prediction about the West side’s total military force and armaments that the Intelligence Bureau obtained, the empire’s army could be said to be too overwhelming.</p><br/><p>Calgurio could speak openly because he had confidence as he within the strongest and in addition, the Corps with the largest personnels.</p><br/><p>There’re many people who fear Veldora but Calgurio was not afraid of it.</p><br/><p>After all, it’s only a dragon right? So he thought.</p><br/><p>There are dragons residing in the Qanat Great Mountain Range. It’s surely a strong monster.</p><br/><p>In case of Lesser Dragon that inhabits the foot of the mountain, when an individual grew up to medium dragon, its strength becomes more than of A Rank.</p><br/><p>The force of one squadron from the Armored Remodeling Legion is needed even if it’s just an individual.</p><br/><p>He handled the dragon subjugation in military drills several times and he familiarized himself with the information about such things.</p><br/><p>Even so.</p><br/><p>On the contrary, the more he familiarized himself with it, the more he could come up with countermeasures against an individual, even for a dragon.</p><br/><p>‘It’s just one dragon, what do we have to fear?’ Calgurio reached such state of mind.</p><br/><p>A monster’s strength is decided on the amount of energy.</p><br/><p>It doesn’t change no matter how strong an individual is.</p><br/><p>The reason why a dragon is strong is because it can act with agile movements compared to its mass.</p><br/><p>Also, the extreme hardness of its dragon scale. Its breath attack was dangerous too, but it’s true nature was the amount of energy.</p><br/><p>If that is the case, there’s no need to fight from the front.</p><br/><p>There’s also weakening with magic, and there’s also the new technology called a Magic Canceller (Magic Essence Disturbance Radiation).</p><br/><p>It can obstruct a magician’s casting, a new technology that enables the weakening of a monster in battle.</p><br/><p>The victory will be certain if he just fire the magic cannon of the main armaments of the 4,000 magic tank, but he need to be extremely cautious if there’s a countermeasure.</p><br/><p>He experimented it with the captured dragon, but he was able to kill it with one shot of the magic cannon even if it was a Young Dragon of A Rank.</p><br/><p>As for a monster, energy (magic essence amount) which was the basis of its existence will be disturbed if exposed to the Magic Canceller and it will be difficult for it to take an action.</p><br/><p>In short, it’s weakened.</p><br/><p>If he fire volley of main armaments of the 4,000 magic tank to the weakened target, the annihilation will be certain even if it’s an ancient wicked dragon.</p><br/><p>The content of the strategy that Calgurio devised for battle against Veldora is as follows.</p><br/><p>・Encirclement by 300 airship.</p><br/><p>・Containment of Veldora’ action with Magic Canceller.</p><br/><p>・Approximately 200.000 standby remodeled soldiers to confined Veldora.</p><br/><p>・Volley of main armament by 4.000 magic tank.</p><br/><p>That’s all.</p><br/><p>Airship is a secret weapon that can be said as the fruits of magic technology.</p><br/><p>Its maximum speed can surpasses the speed of sound. It’s impossible for creature with flesh body to escape from this speed without depending on magic.</p><br/><p>The winning chance of the battle can increase with the accumulation of information after all.</p><br/><p>The airship had buried a great number of dragon and accumulation of information is everything.</p><br/><p>Calgurio was convinced of the victory and had an absolute confidence.</p><br/><p>Gadra, the Imperial Court Magician, an ex-hero that once called that have grew old by now.</p><br/><p>He will be at Calgurio’ mercy if he threaten him with several soldiers equipped with Magic Canceller without being able to resist anything.</p><br/><p>But, Calgurio think that he must not lack in etiquette as Gadra still a hero...</p><br/><p>(Ffu. He was a person of the past after all. Even till now, old people still cause problem...)</p><br/><p>War potential reinforcement depend on the passage of times.</p><br/><p>He’s a pitiful old man that can’t follow it.</p><br/><p>「Your Majesty, Gadra-roushi seem to fear Veldora very much, but I’m different.</p><br/><p>Please give an order for the wicked dragon subjugation to this Calgurio by all means!」</p><br/><p>Calgurio who stands up and bows from the other side of the blinds, said that request to the Emperor.</p><br/><p>Gadra turned a sharp gaze to Calgurio, but he let out a sigh like he have given up and reseated deeply.</p><br/><p>Yuuki watched that exchanges with relish.</p><br/><p>It’s because the fool (Calgurio) seemed to move as he thought.</p><br/><p>Anyway, the biggest wall for the rise of coup d’état is Armored Corps.</p><br/><p>He thought that he wanted this corps to weaken quickly.</p><br/><p>Calgurio was a man who should be call as officer than a soldier. He’s strong in battle but he’s concerned about plan and certain victory, a riskless man.</p><br/><p>But, he had the aspect not to mind a loss as he was greedy, and he will move if there’s a worthy reason.</p><br/><p>The important thing is as long as he given a reason, it’s all good.</p><br/><p>The Monster’s Country Tempest has money. And, there’s surely new technology that developed there from a different viewpoint that still unseen by the Empire.</p><br/><p>Yuuki had guessed that Calgurio will moved if he showed the thing indirectly.</p><br/><p>Money will attracts the nobles supporting Calgurio.</p><br/><p>It will be a different story if a new technology is hidden, Calgurio will not move only by being requested by the nobles.</p><br/><p>He will turn his fang greed not only to Tempest but also the satellite city and the labyrinth itself.</p><br/><p>According to Yuuki’ expectation, Calgurio seemed to dance wonderfully.</p><br/><p>「Calgurio, are you going to steal the march?</p><br/><p>Your Majesty, my Magic Beast Corps can also be deployed anytime.</p><br/><p>Please give the wicked dragon subjugation to this me by all means!!」</p><br/><p>The Beast King Gladim which kept silence before so roars.</p><br/><p>Just by standing up, there was a feeling of overwhelming coercion in the place.</p><br/><p>Definitely the personality of a ruler.</p><br/><p>A great general that proud of the outstanding fighting power within the Empire which even rule the magic beasts under the power.</p><br/><p>He’s a person said to be the second strongest man in the Empire.</p><br/><p>Calgurio and Gladim let their gaze intersected to restraint each other. </p><br/><p>Seeing that situation, Yuuki let out a sigh in his mind.</p><br/><p>The Magic Beast Corps was certainly strong but it’s obvious that this corps wasn’t suitable for this campaign.</p><br/><p>So, he didn’t think that Gladim will announced himself for it.</p><br/><p>Though he doesn't deny that this corps is suitable for attacking, it’s not cut out to challenge Veldora.</p><br/><p>At any rate, the damage given will be not little and it’s doubtful whether in the first place there are chances of victory.</p><br/><p>Because Yuuki knew that the Armored Corps had working over for Veldora countermeasures, he can finish reading the strategy but he think that Magic Beast Corps will be hardly effective against Veldora.</p><br/><p>From what he heard from Chloe’s story, Veldora could be expected to have high combat ability.</p><br/><p>It’s not so bad when it’s Armored Corps, but it will be difficult for Magic Beast Corps to won against Veldora.</p><br/><p>And in this case, joint struggle don’t have any meaning either.</p><br/><p>In the first place, war is decided with number.</p><br/><p>Even if there are 30.000 joined in, it will be overshadowed in front of an army that had size of hundred thousand.</p><br/><p>No matter how strong that unit was, if their movement are limited, then it will be difficult to dealt an effective blow.</p><br/><p>Not to mention, in case the few number separated, the worst case they will get encircled by the enemy army and each will be crushed...</p><br/><p>Above all, it’s ideal for Armored Corps and Veldora to face each other.</p><br/><p>Therefore it’s necessary for Veldora to come out to the front though――</p><br/><p>About it, Yuuki don’t worry that much.</p><br/><p>It’s still good enough if it crush Rimuru’ executives or his subordinates’ army even if Veldora doesn’t appear.</p><br/><p>Comparing Rimuru’ army and Armored Corps, Armored Corps might be superior.</p><br/><p>There seem to be several strong individuals among the executives but as for it this side also similar.</p><br/><p>Calgurio was greedy, but he’s not weak at all.</p><br/><p>There are protégé special duty officer and strong soldiers also enrolled, so if Veldora doesn’t appear then the chance of victory wouldn’t waver.</p><br/><p>It’s wasteful to lose to Magic Beast Corps here.</p><br/><p>Yuki thinks that it’s necessary to do something.</p><br/><p>「Please wait. I think it’s better to entrust this to Calgurio-dono」</p><br/><p>Calgurio float a thin smile to Yuuki’ remark, Gladim have a bitter face.</p><br/><p>And for the first time the Emperor, permitted the remark.</p><br/><p>「Say it, state your thought」</p><br/><p>Yuuki state the strategy with a humble look while hiding his thought in his mind.</p><br/><p>First, the Armored Corps will invades from the front of Jura Great Forest area.</p><br/><p>Sensing the invasion of large corps, it’s certain that vigilance will be concentrated in Jura Great Forest area.</p><br/><p>Then, from the north side will come another invasion in order to stun the west side as a simultaneously invasion.</p><br/><p>「Do you say north side? Do you mean to pass through the Qanat Great Mountain Range?」</p><br/><p>To Gladim’ question, Yuuki denied it with a smile.</p><br/><p>And, without any taunting feel,</p><br/><p>「We can evade the battle against dragon if we go through the sea route」</p><br/><p>So he declared.</p><br/><p>Surely, judging from the flying range of the dragon, the sea route was out from the dragon’s sphere of influence.</p><br/><p>However, large sea monster inhabit the sea, and it’s difficult to get rid of damage even if they went by a fleet.</p><br/><p>It’s difficult to keep the superiority with the exhausted force even if it arrived at the north side’s port after it pass through a disadvantageous naval battle.</p><br/><p>In addition, the Empire owns several number of sea battleships, it exists to be used for subjugation against sea monster or large sea magic beast.</p><br/><p>It’s a reason needed to link the transportation fleet to transport the corps, but it will be not in time if prepared now.</p><br/><p>The nobles and also the ministers raised a question to Yuuki’ remark.</p><br/><p>But,</p><br/><p>「It’s possible right? Calgurio-dono?」</p><br/><p>Yuuki bring the subject to Calgurio with a smile.</p><br/><p>Calgurio realizes Yuuki’ intention at that point.</p><br/><p>(Tch! This shitty brat… Did he aware of the existence of the treasured Airship?</p><br/><p>Even though I concealed it so much and built it in secrecy…)</p><br/><p>But, Calgurio thought about it.</p><br/><p>It wasn’t a bad strategy.</p><br/><p>Calgurio had also considered the strategy to attack from the north side.</p><br/><p>But, he stopped it this time because there will be a problem in the number of soldiers and the formation if he greatly distributed his corps.</p><br/><p>He concentrate on Veldora and the labyrinth.</p><br/><p>That was the decision that Calgurio put out though…</p><br/><p>(It’s interesting. The airship transports the Magic Beast Corps and afterward it devoted itself on support and supply.</p><br/><p>As for snatching only the profit, this might be possible.</p><br/><p>In any case, if I arranged a large force to launch a surprise attack from the north side of the west alliance,</p><br/><p>It can be a reason to forestall the people to not turn their eyes to the other side.</p><br/><p>The military gains are big. Of course, it will become a feat for Aerial Fighter Legion)</p><br/><p>Calgurio quickly calculated it in his head.</p><br/><p>The scales incline toward profit and lead to a decision.</p><br/><p>「Well well, I can’t be careless to Yuuki-dono.</p><br/><p>I wonder where did you obtained that information from…</p><br/><p>It’s really astounding」</p><br/><p>「No, no, it’s because I have connections.</p><br/><p>There’re many acquaintances from the same town you see」</p><br/><p>「I see.. I consent it.</p><br/><p>It have been exposed earlier, but sure.</p><br/><p>There’s a new weapon called “Airship” which developed in my corps.</p><br/><p>The Aerial Fighter Legion is making use of this new weapon.</p><br/><p>This is the centerpiece, the trump card.</p><br/><p>It possible for Aerial Fighter Legion to transport the Magic Beast Corps!」</p><br/><p>By Calgurio’ remark, the inside of the conference hall grows excited instantly.</p><br/><p>It’s because there’s a way to invade the western countries without going through Jura Great Forest</p><br/><p>It was natural that they were excited.</p><br/><p>「However, approximately the maximum number of soldiers that can be transported is 100.000 people.</p><br/><p>It might be difficult to conquer the west with only this.</p><br/><p>Thus, I insist on the simultaneous strategy!」</p><br/><p>Calgurio announces the strategy that he made in his mind while revising his own strategy.</p><br/><p>100 ships of Aerial Fighter Legion will deal with Veldora, the remaining 300 ships will support the Magic Beast Corps.</p><br/><p>The strategy will succeed perfectly if he send the best of the magician to fight Veldora.</p><br/><p>While considering it, Gladim groans.</p><br/><p>It will be a honor for soldier to fight against the strongest dragon named Veldora.</p><br/><p>However, this strategy came with a reason.</p><br/><p>Above all, there’s seems to exist a group that specialized in individual combat that said to be the strongest group called Holy Knight Order in the west.</p><br/><p>It seemed their number were only 200 people, but he thought that he wanted to have a fight with them once.</p><br/><p>Besides, there exists a country with faith as the cornerstone in the west called Holy Empire Ruberios.</p><br/><p>There seem to be Guard Army under the Pope’ direct control that rival the Holy Knight in that country.</p><br/><p>He will crush that Guard Army and trampled its holy capital.</p><br/><p>Gladim felt that the beast’s blood that flows in his body began to boil hot.</p><br/><p>「It might be good! Let’s go with that strategy!!」</p><br/><p>The excitement in the large conference hall has risen further with the words of agreement roared by the Beast King Gladim.</p><br/><p>「We’ll win, we’ll win without a doubt!!」</p><br/><p>「Victory for us, people of the Empire!」</p><br/><p>「Long live, Your Majesty the Emperor!!」</p><br/><p>So in such situation, they were already entranced with imagination of the victory.</p><br/><p>The strategy was worked out smoothly and the plan was settled without a hitch.</p><br/><p>They finally got the permission from the Emperor and the strategy was approved.</p><br/><p>A simultaneous two sides invasion strategy was decided with the sortie of the Empire.</p><br/><p>Yuuki sneers in his mind.</p><br/><p>Everything was going according to his expectations and he become desperate to endure his laughter.</p><br/><p>With this, he can push away the nuisance Magic Beast Corps to distant place, and the weakening of Armored Corps will be certainly done too.</p><br/><p>Even if Veldora doesn’t come out particularly, the strategy is a success even if it just decreasing Rimuru’ handpieces.</p><br/><p>It can be say that best result is both side can be exhausted.</p><br/><p>And he can consume the weakened empire from the inside and surge into a great war with all forces it has.</p><br/><p>While the chaos arises in the world, let’s aim at an opportunity to kill Rimuru in that gap.</p><br/><p>Guy Crimson and Rimuru.</p><br/><p>Two people who Yuuki should be careful with. He cannot be too careful with the other Demon Lords either, but he will manage it somehow if he had time.</p><br/><p>Letting Chloe who is the strongest Hero dispose one, and in that gap he would get rid of the rest together with Chloe in one against one fight.</p><br/><p>If he do so, the limitation of his own ultimate ability will disappears and it’s possible to put Milim under his control.</p><br/><p>But...</p><br/><p>There was a reason why Yuuki didn’t carry it out.</p><br/><p>The reason why Guy Crimson didn’t move for a long time is unknown.</p><br/><p>The reason why that arrogant Demon Lord didn’t move.</p><br/><p>That’s a uneasiness whether it’s because of something which he should be cautious of.</p><br/><p>He should be careful.</p><br/><p>Therefore Yuuki hesitated about using his trump card named Chloe.</p><br/><p>(Anyway, if this war become big and the world falls into disorder, something will happen.</p><br/><p>Then, I may see the thing hidden if that happen right!)</p><br/><p>Yuuki laughed happily and thinking about the event in the future.</p><br/>\n</div>"}