{"title": "Chapter 160 – The Clean-up annihilation war.", "id": 160, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-160-%E2%80%93-the-clean-up-annihilation-war", "volume_title": "Volume 2", "body": "<h1>Chapter 160 – The Clean-up annihilation war.</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Special thank to Lion san and Co. once again…and the editor credits goes to those who’re gonna point out the various stupid mistakes I’ve made.</p><br/><p>160 </p><br/><p>The Clean-up annihilation war.</p><br/><p>カリギュリオのへは、ながせられていた。</p><br/><p>From his subordinates, Calgurio had received many despairing reports.</p><br/><p>はにで、ののはらかであった。</p><br/><p>The situation was very grim; it’s evident that this war was a failure.</p><br/><p>いや、それではい。</p><br/><p>No, that’s not all.</p><br/><p>ことここにって、このからきてるかどうか、はそこまでしったものとなっていたのである。</p><br/><p>It had already reached the point where the odds of retreating out of the forest alive were questionable.</p><br/><p>（どうしてこうなった？ いや、そもそもいつから……？）</p><br/><p>(How did this happen? No, to begin with when did……?)</p><br/><p>カリギュリオはループするをににそうとしてし、もうなをめてりるがなをする。</p><br/><p>With this thoughts locked in a desperate loop and failing to break out of it, Calgurio once again evaluates the hopeless situation whilst determining their possible courses of action.</p><br/><p>このののでるなどしてないのだが、それでもはであり、のにしてあるなのだ。</p><br/><p>Even though he couldn’t do anything to turn this worse case scenario around, as the corps captain he is still responsible for the lives of his officers and soldiers.</p><br/><p>がをげすだけは、してしてはならないだったのである。</p><br/><p>That was the one thing he would never turn his back away from.</p><br/><p>にされたは、がとになったとうものであった。</p><br/><p>The first reported had initially intended to convey that the capital-offense troops have engaged with the enemy forces.</p><br/><p>はしており、になりつつある、と。</p><br/><p>The heated battle is on the verge of reaching a deadlock.</p><br/><p>のでなのが、しでしてないのをり、はしているらしい。</p><br/><p>Despite their overwhelming advantage in numbers, they couldn’t push through the enemy’s impregnable defensive formation; the enemy was fighting with fervor.</p><br/><p>ものも、がによりされ、そのをずににわる。</p><br/><p>The sorcery cannon and magician’s wide-scale magic were all completely tanked by the enemy’s defensive barrier, unable to exert their effects.</p><br/><p>ながらなであった。</p><br/><p>Despite being the enemy it was a praiseworthy defensive formation.</p><br/><p>とがした、はうようにまない。</p><br/><p>Since they have lost contact with the dungeon capturing squad, they could only head towards the capital.</p><br/><p>ののをめているでは、してい。</p><br/><p>This isn’t the time to praise the enemy’s defenses.</p><br/><p>カリギュリオもそれはしており、ににがくなっているをしめたのがこのであった。</p><br/><p>By the time Calgurio had linked the dots, he had already realized that he was backed against a wall.</p><br/><p>だが、にすぎたのである。</p><br/><p>But, it was already too late.</p><br/><p>はにきめる。</p><br/><p>The situation had escalated swiftly.</p><br/><p>たながした。そのはをした。</p><br/><p>A new enemy had emerged. That troop was the living embodiment of terror.</p><br/><p>ないをち、をしめる。</p><br/><p>With an oppressive force, they had begun tramping all over them.</p><br/><p>にしてののそのに、にがやられていくのだ。</p><br/><p>Their numbers hardly reach one-tenth of their own, yet they could do nothing against it.</p><br/><p>エネルギーのでも、のいがされていた。</p><br/><p>According to the reports of the energy measurement team, there were several individuals with a vast quantity of magical essence within them.</p><br/><p>TN Note: It’s over 9000! This never gets old 😄</p><br/><p>しかし、そののは、にべてもエネルギーは。</p><br/><p>However, the majority of enemy troops, their energy values were comparable to that of their own forces.</p><br/><p>Ａランクのなのはないようなのだ。</p><br/><p>The number of A rank monsters isn’t a lot.</p><br/><p>それなのに、はでりげられているり、がいめられていっていた。</p><br/><p>Yet, the results had unfurled before him, and their own forces were cornered into a corner.</p><br/><p>にがく。</p><br/><p>There were even further developments.</p><br/><p>ののから、ながたれたのだ。</p><br/><p>From within the enemy’s impregnable formation, unparalleled wide-scale magic was unleashed.</p><br/><p>いましたそのやにより、にながじめる。</p><br/><p>Due to the strikes from the enemy magic and Youjutsu, there were a great number of causalities in the empire’s forces.</p><br/><p>のにされたをきらすのいは、のをにらせて、をにするだったのだとくいた。</p><br/><p>The objective of the purple armored troops was to spread unified fear, causing the empire’s armies to fall into confusion, eventually noticing the barrier weakening.</p><br/><p>なであった。</p><br/><p>It was a display of brilliant cooperation</p><br/><p>しかし、これだけであったならば、まだてしはきいたのだ。</p><br/><p>However, if it was only to this extent, they could still regroup.</p><br/><p>には、、として10づつにけていた。</p><br/><p>The capital offensive troops vanguard and rearguard have 100,000 soldiers each.</p><br/><p>がされたで、がににり、れわったでをわせる。</p><br/><p>when the vanguards begin to collapse, the rearguards could provide support, change positions with the vanguards and regroup.</p><br/><p>にいてなをつからこそな、の。</p><br/><p>This was possible precisely because of their overwhelming advantage in numbers, a sure-win strategy.</p><br/><p>（にてただけでも、のはてただろう）</p><br/><p>(Even if it’s only a temporary upper hand, we’ve preserved the dignity of the Demon Lord)</p><br/><p>TN Note: Like how Germany let Brazil score a goal in FIFA semi-finals so they didn’t suffer a complete defeat, except in this case we all know what happens next.</p><br/><p>にがくなりつつあるをしつつも、カリギュリオにはまだがあったのだ。</p><br/><p>Once he was aware he was backed into a corner, he had just gained a bit of coverage.</p><br/><p>そのがくなったのは、のである。</p><br/><p>Except said coverage had vanished into thin air immediately right after.</p><br/><p>キロれたからにより、をしていたカリギュリオむ。</p><br/><p>Through the use of telescopic magic, the empire army’s advisors including Calgurio were observing the battlefield a few kilometers away.</p><br/><p>がでをった。</p><br/><p>Everyone was at a loss for words in an instant.</p><br/><p>まだっていたてのがえったのは、このである。</p><br/><p>Any remaining feeling of coverage, had immediately dispersed.</p><br/><p>エネルギーがでったようにびめた。</p><br/><p>The energy measurement team screamed like a madmen and cried out in fear.</p><br/><p>「い、すぐにを！！」</p><br/><p>“O, order a retreat immediately!!”</p><br/><p>と。</p><br/><p>They said.</p><br/><p>てはれだったのだが……。</p><br/><p>Except everything was too late……</p><br/><p>そののをするよりもく、ののがてをえてくれた。</p><br/><p>Rather than trying to comprehend the meaning of his words, it was much quicker observing the situation before him.</p><br/><p>しつつあるのにろうとしていたに、がれたのだ。</p><br/><p>The rearguard troops who wanted to support the vanguards had all been struck by tragedy.</p><br/><p>の、””によって。</p><br/><p>A type of nuclear strike magic, “Gravity Collapse”</p><br/><p>なエネルギーをする、ながをきらす。</p><br/><p>Releasing an absolute energy, a brutal magic that spreads tyrannical violence.</p><br/><p>のをわせて、そこになをさせる。</p><br/><p>Causing gravitational magnetic fields to run rampart like that of a star, it creates a localized high-intensity gravity field.</p><br/><p>なのにきまれたは、てがしされるになるのだ。</p><br/><p>Everything in the affected region would feel its effects and be crushed.</p><br/><p>そのままをけるならば、やがててのエネルギーがにし、ながにてするになるだろう。</p><br/><p>If everything keeps on being compressed, all the energy would be pressed into a single point, causing a mini supernova on the ground.</p><br/><p>、のはそこまでではかったようだ。</p><br/><p>This time, it seems this wasn’t the objective of the enemy.</p><br/><p>のをしたで、のはきえた。</p><br/><p>when the majority of the soldiers were crushed to death, the effects of the magic disappeared.</p><br/><p>だが、のの、たしてきれたのか……</p><br/><p>Even so, amongst the 100,000 soldiers, the ones still alive number to……</p><br/><p>「ば、けです。たった……たったで、あのを……</p><br/><p>でしかないのに……</p><br/><p>このでわれたのない、なエネルギーをとするのに……」</p><br/><p>“A mo, monster. Th…there was just one of the, yet that galactic magic……</p><br/><p>A magic that only exists in theory……</p><br/><p>It’s impossible to use it here, the energy consumption required is astronomical……”</p><br/><p>そう、カリギュリオでもっている。</p><br/><p>Indeed, Calgurio has knowledge about it.</p><br/><p>、があるとされるだけで、だの。</p><br/><p>Theoretically, it was possible, however it’s still in research stage.</p><br/><p>にされているではなく、ののをめ、のもし、のみてからしているのなのだ。</p><br/><p>It wasn’t a magic confirmed in the past, but rather the amalgamation of the empire’s technology, the knowledge from another world, and a compilation of theories creating a new type of wide-scale magic being researched upon.</p><br/><p>TN Note: clearly it isn’t</p><br/><p>それを……なでしてせた。</p><br/><p>Yet……it was perfectly activated.</p><br/><p>それもたったのが、だ。</p><br/><p>And it merely took a single monster.</p><br/><p>。</p><br/><p>Demon Lord.</p><br/><p>そのが、なをって、カリギュリオのにする。</p><br/><p>Those words, alongside a realistic sense of fear, had reached the brain of Calgurio.</p><br/><p>は、してをしてはならぬにだししてしまったのではないのか？ と。</p><br/><p>We, have lifted our hands against someone we should have never laid our hands on didn’t we?</p><br/><p>TN Note: you think so?</p><br/><p>そもそも、あののをつには、10でもないのである。</p><br/><p>In the first place, to activate a magic of that magnitude, even with 10 magicians it might not succeed.</p><br/><p>のとはにならぬエネルギーがとされ、それをコントロールするがければをく。</p><br/><p>Its energy consumption couldn’t be compared with that of an average nuclear strike magic, and without perfect concentration would only result in accidental discharges of energy.</p><br/><p>それを……でにしてせるなどと、のけのとしかえない。</p><br/><p>Even so……to have the ability to stop it completely midway through, it could only be think of as the ability of a inhuman monster.</p><br/><p>マジックキャンセラー</p><br/><p>「しかし……にはまだ、にが……」</p><br/><p>“However……we still have the scientific weapon the magic canceller……”</p><br/><p>「いや、ぐにすべきです、カリギュリオ」</p><br/><p>“No, we should immediately retreat, Calgurio sama”</p><br/><p>テントにってたが、カリギュリオにそうした。</p><br/><p>The man who suddenly barged into the tent, said this to Calgurio.</p><br/><p>はを、そういそのをて、</p><br/><p>When thinking about what the heck were the guards doing, he saw the man,</p><br/><p>「こ、これはクリシュナ、か？」</p><br/><p>“A, aren’t you Krishna Dono?”</p><br/><p>におけるにて、ににする。</p><br/><p>In the Empire’s battle for positions, this man would often rank in a high position.</p><br/><p>かもったがあったが、してないをつだった。</p><br/><p>He too had participated in these battles often himself, he was a swordsman you couldn’t be careless around.</p><br/><p>そのが、ぼろのようにやつれたとなり、</p><br/><p>レジェンド</p><br/><p>であるのさえも、にきくがりにはがいていた。</p><br/><p>This man, with a haggard appearance, donned the empire’s strongest legendary ranked equipment, and there was a gaping hole at his chest plate.</p><br/><p>なまでののをしていたのである。</p><br/><p>There were still signs of a death struggle on it.</p><br/><p>「いいか、バザンとレイハもんだ。カンザスにミニッツまでも……</p><br/><p>それに””が。そのでてないけがにるんだ。</p><br/><p>そこでをしたが、それをしたヤツはらくではないぞ。</p><br/><p>アークデーモンのけが、でされている。</p><br/><p>に、それのデーモンロードも、だ。</p><br/><p>のも、らくはそうしたけどものによるものだろう。</p><br/><p>ここはこう。してではない、してくれ！」</p><br/><p>“Look, Bazan and Raiha are already dead. Colonel Kansas and Major General Minutes too.</p><br/><p>In addition, 2 ‘Otherworlders’. There are monsters in there that can’t be taken down even with that kind of power.</p><br/><p>We’ve detected a grand magic just now, but we’re afraid that’s not the demon lord.</p><br/><p>Several Arc demon class monsters had already been identified within the dungeon.</p><br/><p>Furthermore, there are even Demon Lord classes. That magic we’ve detected, it’s most likely used by one such individual.</p><br/><p>Retreat now. There’s no shame in this, decide quickly!”</p><br/><p>TN Note:…I think the author mixed up Demon lord and demon duke, but the raws say Demon Lord…I might change it to demon duke at my own discretion in the future.</p><br/><p>「ではない？</p><br/><p>それに、あのけがもいる？</p><br/><p>デーモンロード、だと！？</p><br/><p>これのものなのか……</p><br/><p>この、ヴェルドラまでされると……ちがない。</p><br/><p>まだリムルはいてもいないというのか……</p><br/><p>をめよ！ 、するぞ！！」</p><br/><p>“Not the Demon Lord?</p><br/><p>And, there’s several more of those monsters?</p><br/><p>Demon Lords?!</p><br/><p>So it was something on this level……</p><br/><p>And above this, the wicked dragon Veldora still hasn’t made his appearance……</p><br/><p>And the Demon Lord Rimuru hasn’t moved yet……</p><br/><p>Gather the soldiers, we’re retreating at once!”</p><br/><p>つあったのののつ、シンジからりげたものはがしっていたカリギュリオ。</p><br/><p>Out of the three revival bracelets confiscated from Shinji and co, Calgurio had taken one and hid it for himself.</p><br/><p>つがにてされており、そののつをクリシュナはりけていたのだそうだ。</p><br/><p>2 were given to the Technology department for analysis, and one of them was given to Krishna.</p><br/><p>によるはであり、もをわずにししたのだという。</p><br/><p>Since the Emperor’s orders were absolute, the Technology department could only hand it over without complaint.</p><br/><p>つはにされており、ちせたのはのつだっただが、そののおでクリシュナはたのだ。</p><br/><p>One had been completely taken apart thus this was the only one that could be used, and thanks to said bracelet Krishna was able to revive.</p><br/><p>これにより、のはかめられたが、にがかったもまたされたである。</p><br/><p>And thus, while the revival effects of the bracelets were confirmed, the replicas having no effect was also confirmed.</p><br/><p>のは、のでした、そういうになるだろう。</p><br/><p>the soldiers in the dungeon, in the truest sense of the words, were wiped out.</p><br/><p>35ものが、……。</p><br/><p>350,000 soldiers, all wiped out.</p><br/><p>カリギュリオはめるが、はそれどころではない。</p><br/><p>Calgurio’s complexion paled, but now’s not the time for that.</p><br/><p>はんだよりも、きているをがすがなのだ。</p><br/><p>Rather than the dead, those who are still alive are more important.</p><br/><p>に400、こののとし、をしをする。</p><br/><p>There are the tank corps and 400 airships, they should first regroup with the them, get a grasp of the situation, and then reorganize the army.</p><br/><p>はまでるになるだろうが、このままするよりはマシとうものだ。</p><br/><p>At worse they would retreat back to the empire, but it was much better than complete annihilation.</p><br/><p>カリギュリオはし、をす。</p><br/><p>Calgurio had decided, and was about to give out the orders.</p><br/><p>しかし、にし。</p><br/><p>However, it was too late.</p><br/><p>TN Note: you guys would make bad office workers, always a bit too late.</p><br/><p>「クフフフフ。それはります。しはのもしてわないと」</p><br/><p>“Kufufufu. Now that would be troubling. Why don’t you be my opponent for a bit”</p><br/><p>はにびり、れなをしてがすはいのだ。</p><br/><p>The demon had crept in, never allowing their pitiful prey to escape.</p><br/><p>にがった。</p><br/><p>Tension was in the air of the Headquarters.</p><br/><p>してたはたった。</p><br/><p>Only a single monster had intruded.</p><br/><p>だが、そのからたれるは、てにしたどのようなよりもなをっている。</p><br/><p>However, the aura emitting from it, was more overwhelming than any monster they’ve met so far.</p><br/><p>とじのが、なドラゴンになのをわせているのだ。</p><br/><p>A monster with a similar stature to theirs, yet emitting magical essence more concentrated than a gigantic dragon.</p><br/><p>しかも、そのはのもじさせずにここまでしてている。</p><br/><p>Furthermore, it had intruded without anyone noticing.</p><br/><p>それだけのを、じさせるなくをたしたというなのだから。</p><br/><p>Even with that kind of aura, he stilled managed to intrude without anyone sensing.</p><br/><p>にしをける。</p><br/><p>The guards pointed their swords at the intruder.</p><br/><p>しかし、はく、のでをげるがなくなる。</p><br/><p>However, Calgurio’s body felt heavy, he couldn’t raise his sword as he willed.</p><br/><p>「クフフフフ。なるが、とにえるとでも？」</p><br/><p>“Kufufufu. You inferior trash wish to battle me as equals?”</p><br/><p>いのその、ディアブロはう。</p><br/><p>The red-haired monster, Diablo laughed.</p><br/><p>カリギュリオはクリシュナにをけるが、クリシュナはにっている。</p><br/><p>Calgurio looked at Krishna, but Krishna had already kneeled.</p><br/><p>なまでのをじり、したのだろう。</p><br/><p>Krisha had probably perceived the overwhelming different in ability, and was despairing.</p><br/><p>カリギュリオはのみをかけて、ディアブロにをちかけた。</p><br/><p>Calgurio held onto a small silver of hope, and tried to negotiate with Diablo.</p><br/><p>「、はカリギュリオとす。</p><br/><p>こののであり、のである。</p><br/><p>のおをおきしてもしいか？」</p><br/><p>“Pardon my rudeness, My name is Calgurio.</p><br/><p>I am the leader of this Corps, and the highest authority bearer in this operation.</p><br/><p>May I please ask for thine name?”</p><br/><p>TN Note: apparently  is a slightly rude way of saying I…according to the dictionary. Overall his tone was really polite though.</p><br/><p>「おや？ これはごに。</p><br/><p>の””は、ディアブロ。リムルのなるです」</p><br/><p>“Oya? You’re a polite one.</p><br/><p>My “name” is Diablo, a loyal servant of Demon Lord Rimuru.”</p><br/><p>TN note: he also used シモベ on top of , so he’s actually calling himself the loyal lowly servant of Rimuru.</p><br/><p>カリギュリオのてり、そのはきであった。</p><br/><p>As Calgurio had guessed, this was a named monster.</p><br/><p>もっとも、このクラスがをたないのがじられぬなのだが。</p><br/><p>Or rather, it would be strange if something of this caliber didn’t have a name.</p><br/><p>にとがるをし、カリギュリオはにをした。</p><br/><p>Confirming that the other part had reason and intellect, Calgurio had hopes with the negotiation.</p><br/><p>「ディアブロ、はをしたい。</p><br/><p>このままがとなってうより、もがないであろう？</p><br/><p>どうだろう？</p><br/><p>、はうし、のをえるをする。</p><br/><p>テンペスト</p><br/><p>いや、ろとのによるもえられよう！</p><br/><p>ははれぬ。どうだろう？</p><br/><p>リムルにりいではえぬだろうか？」</p><br/><p>“Diablo Dono, we wish to offer our surrender.</p><br/><p>If this battle continues we would have more dead soldiers, your side would also sustain more damages no?</p><br/><p>What do you say?</p><br/><p>Of course, we would pay compensation, and promise to refrain from all acts of invasion in the future.</p><br/><p>No, we could even have an alliance between Tempest and our Empire!</p><br/><p>We wouldn’t forget this kindness. How about it?</p><br/><p>Could you please pass this onto Demon Lord Rimuru sama?”</p><br/><p>をえるに、35は。</p><br/><p>Considering the current situation, all 350,000 of the dungeon capturing team are dead.</p><br/><p>にけたの、がしたかになっている。</p><br/><p>As for the Capital offense team, over half were either dead or could no longer continue to fight.</p><br/><p>にはがれない、はちの15にきりをえて20。</p><br/><p>Unable to contact any other troops, the current fighting forces on hand are 150,000 members including survivors totaling to a little less than 200,000.</p><br/><p>となってれられるにはろしいであろうし、なるとなるこのはのがあるとする。</p><br/><p>There will be a number of causalities should they act violently, so if they want a complete victory this is a considerable proposal.</p><br/><p>カリギュリオはでそうし、をすようすべくリムルへのをしれる。</p><br/><p>Calgurio had made a split-second decision, rather than fleeing, he tried to negotiate with Demon Lord Rimuru via an intermediary.</p><br/><p>のはにである。</p><br/><p>This military operation was a complete washout.</p><br/><p>をりにもくしぎていた。</p><br/><p>They had completely underestimated the enemy forces.</p><br/><p>を３にどってもてるとするだったのだ。</p><br/><p>It was a prided battle force that could have went up against 3 old demon lords simultaneously and still triumph.</p><br/><p>のをわせても、このののでしかい。</p><br/><p>Even if they combined all the battle strength of the west, they still wouldn’t be able to compare to</p><br/><p>one-third of the empire’s forces.</p><br/><p>なるのがあったのに、はこの。</p><br/><p>They were convinced of absolute victory, yet this was the result.</p><br/><p>、つまりデーモンロードのけが、リムルのにるとは……</p><br/><p>Demon Lord class, and several more demon lord class individuals, all under the banner of the Demon Lord Rimuru.</p><br/><p>TN Note: …yeah, I think デーモンロード should have been Demon Duke…</p><br/><p>ここはをってでもき、のにけるべきであった。</p><br/><p>They should pay compensation here and retreat, then rebuild their forces henceforth.</p><br/><p>に50いがたのだ、カリギュリオのはけられぬだろうが、これのはのすらもしかねない。</p><br/><p>There are already almost 500,000 deaths, and Calgurio will no doubt be done for, but anymore than this then the empire’s backbone would collapse.</p><br/><p>カリギュリオはではあったが、ではかった。</p><br/><p>Calgurio was greedy, but not incompetent.</p><br/><p>だからこそ、このをしたのである。</p><br/><p>That’s why, he had offered this proposal.</p><br/><p>がのをするならば、はになってもいというもっていたのだ。</p><br/><p>If the enemy demanded for the lives of the generals, then he must be prepared to sacrifice himself.</p><br/><p>だが、てはにすぎたのである。</p><br/><p>But, it’s all too late.</p><br/><p>TN Note: At this point they’re just cursed. Kamijou is that you?</p><br/><p>「クフフフフ。その、しすぎました。</p><br/><p>に、きっているのはのみです」</p><br/><p>“Kufufufu. This proposal, came a little too late.</p><br/><p>At this point, you’re the only ones alive.”</p><br/><p>をわれたのか、ないカリギュリオ。</p><br/><p>Calgurio couldn’t understand what he was told.</p><br/><p>もで、ディアブロのがないでいる。</p><br/><p>The advisors too, were befuddled by his words.</p><br/><p>だが、ディアブロはにしたもく。</p><br/><p>However, Diablo generated a gust of wind with his mind.</p><br/><p>パチン！ とをらした。</p><br/><p>*Pachin! And snapped his fingers.</p><br/><p>、がきび、のがカリギュリオのにる。</p><br/><p>In moments, the tent was blown off, and the outside scenery had entered Calgurio’s sights.</p><br/><p>そこには、のの。</p><br/><p>And there was, a mountain of corpses.</p><br/><p>はの、まるでるようにんでいた。</p><br/><p>The soldiers in the middle of their work, laid dead as if they were asleep.</p><br/><p>まるで、だけをきられたかのように……</p><br/><p>It was almost as if they soul was pulled out of them……</p><br/><p>いや、だけをきられたのだろう、はをされずにいのディアブロにをわれたのだ。</p><br/><p>No, their soul was probably actually pulled out, the soldiers were unable to resist and had their souls ripped out by the red haired demon Diablo.</p><br/><p>そもそも、ディアブロがをしてするなどというをかけるもない。</p><br/><p>Diablo had no reason to put in time and effort to want the enemy soldiers flee to begin with.</p><br/><p>にくをてすのも。</p><br/><p>And killing them all would also be troublesome.</p><br/><p>そういうから、いりるとに”の”により、のみをりっていた。</p><br/><p>And so, as he descended he had also simultaneously activated “End・Of・World”, reaping the souls of every enemy soldiers.</p><br/><p>は、『』だけでもさせるはだが、それではぎがきくなるからである。</p><br/><p>In actuality, he could have killed them with madness via 『Demon lord’s Haki』, but that would have caused too great of a commotion.</p><br/><p>ディアブロはをすつもりはからくかった。</p><br/><p>Diablo didn’t plan to allow even a single enemy alive.</p><br/><p>であるからこそ、っりくさせるに、まるでいがかったのである。</p><br/><p>Precisely because of that, he quickly annihilated the enemy, without a shred of hesitation.</p><br/><p>そもそもが、はりをむ。</p><br/><p>To begin with, he always preferred being a lone wolf.</p><br/><p>のをたないのもそれが。</p><br/><p>That is also why he doesn’t have his own subordinates.</p><br/><p>にたないなど、うもいのだから。</p><br/><p>They are but useless tools that aren’t even worth using.</p><br/><p>はヴェノムというがにいてているが、がにつならばう。</p><br/><p>Currently there’s been a small fry called Venom who’s been selfishly following him around, but if he proves useful then he’ll be used.</p><br/><p>ディアブロにとってとは、にさをせてこそがある、そうえていた。</p><br/><p>for Diablo, a tool’s worth is in its utility.</p><br/><p>だからこそなはらないし、もまた、にとってのなであらねばならぬのだ。</p><br/><p>That’s why useless subordinates are uneeded, he himself too, must prove himself to be a useful tool (lowly servant) to his master Rimuru.</p><br/><p>「う、う……うぉおおおおおおおおお！！」</p><br/><p>“U,u…..UOOOOOOOOOO!!”</p><br/><p>カリギュリオはし、をくいでディアブロをみける。</p><br/><p>Calgurio screamed, glaring at Diablo as if he was vomiting blood.</p><br/><p>TN Note:  means “cry of despair” word for word</p><br/><p>をされたりが、をしたのだ。</p><br/><p>The rage from having his comrades slain had overlaid his fears in an instant.</p><br/><p>その、くしいがカリギュリオをみみ、なをりさせる。</p><br/><p>At that instant, An awe-inspiring radiant armor had wrapped around Calgurio, and his mind calmed down.</p><br/><p>のよりわるの。</p><br/><p>The strongest armor from the era of gods.</p><br/><p>よりされた、の。</p><br/><p>Borrowed from the Emperor, A god class equipment.</p><br/><p>たった４のにのみをされた、である。</p><br/><p>Permitted to by worn only by the 4 Corps Captains, it was a testimony to the Empire’s greatest fighting power.</p><br/><p>「さんぞ、め！ してくれるわ！」</p><br/><p>“Unforgivable, Demon! I’m going to murder you!”</p><br/><p>「クフフフフ。それでこそ、くなるとうものです」</p><br/><p>“Kufufufu. That’s more like it, now this is getting interesting.”</p><br/><p>はみい、のいがまった。</p><br/><p>They had a standoff, and the final battle began.</p><br/><p>しかし、それはいとべるモノではい。</p><br/><p>However, it couldn’t be called a fight.</p><br/><p>ならば、ディアブロにとってカリギュリオなどのにぎず、そのなのには</p><br/><p>のまるでをたないのだから。</p><br/><p>That’s because, to Diablo Calgurio was nothing more than a lesser life form, even god class equipment is nothing before mighty strength.</p><br/><p>とは、いこなせてこそ、がある。</p><br/><p>Tools only have meaning should you know how to use it.</p><br/><p>いがをきせない、しいものはい。</p><br/><p>It’s naught but a pitiful tale if an owner couldn’t bring out the full potential of his tool.</p><br/><p>カリギュリオでは、ディアブロがをすにするはく、それはともべぬなるのりりでしかなかったのだ、</p><br/><p>Calgurio didn’t even manage to get Diablo to get serious, it was nothing but the simple reaping of a single soul.</p><br/><p>がにしたにっていたは15。</p><br/><p>There were 150,000 soldiers of the empire’s army encamped outside in the vicinity of dungeon.</p><br/><p>そのてはのをき、がをされたのかするもないままにされるとなる。</p><br/><p>Apart from the few of the higher ups, none of them realized what caused them to be annihilated.</p><br/><p>こうして、のへけてしてたのてのは、したをげるもないままにした。</p><br/><p>In this fashion, the entirety of the empire’s forces that came to invade tempest, was completely annihilated without leaving behind any major achievements.</p><br/><p>りえずのはったのである。</p><br/><p>And so the crisis has passed for now.</p><br/><p>――たして、それがだったのかどうか、それはによりがかれるであったのだが。</p><br/><p>――In actuality whether this could actually be called a crisis or not is left to the people to determine.</p><br/><p>テンペスト</p><br/><p>ののへけたは、こうしてにわったのだ。</p><br/><p>And so the Empire’s invasion of Tempest, has ended in failure.</p><br/><p>_________________________________________________________________</p><br/><p>Note to lion san</p><br/><p>You know Lion san, after reading your TN Notes…I think you’re forgetting you’re suppose to be Karion under a mask, not an actual lion…oh well.</p><br/>\n</div>"}