{"title": "Chapter 187 – The One Who Observes", "id": 187, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-187-%E2%80%93-the-one-who-observes", "volume_title": "Volume 2", "body": "<h1>Chapter 187 – The One Who Observes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The One Who Observes</p><br/><p>Pulling it out of thin air, Dino held up a great sword comparable to himself in size.</p><br/><p>A thick, wide single-edged sword, it seemed to have high killing power and was capable of decimating enemies with its weight.</p><br/><p>A massive weapon that didn’t match any lightweight equipment like leather armor, it was a God class great sword inscribed with the name “Crumbling Fang”.</p><br/><p>Beretta, on the other hand, was completely bare handed; however, his body was composed of Demon Steel that was originally created by Rimuru.</p><br/><p>But in this moment, as the result of his form adapting well to Beretta’s magic power, the materials had transformed into Adamantite (Bio-Demon Steel) similar to that of Zegion’s.</p><br/><p>As magic power circulated within him, it[1] had become a deadly weapon that had power stronger than even that of a Legend class weapon.</p><br/><p>Its toughness was unparalleled in the labyrinth to the extent that a normal weapon couldn’t even scratch it. That was Beretta.</p><br/><p>Against Dino who used a weapon, it wouldn’t mean that Beretta, who was weaponless, was at a disadvantage.</p><br/><p>However, the offensive ability of Dino’s weapon seemed to exceed Beretta’s defensive ability.</p><br/><p>Thus, Dino moved light-heartedly to break the tension that ran between the two.</p><br/><p>Beretta skillfully warded off Dino’s sword strike despite being unarmed.</p><br/><p>Without receiving the attacks headfirst, Beretta led Dino around with movements that fused both offense and defence.</p><br/><p>While Dino’s attacks only came from the sword, Beretta’s whole body was a weapon. Being unarmed didn’t become a disadvantage - on the contrary, it enabled him to use many more methods of attacking.</p><br/><p>For Beretta, who was a Chaos Doll, attribute transformation was his forte.</p><br/><p>He drove the Holy attribute into the place that was adapted for Demonic attribute attacks. Thus, Dino’s position was sealed off by Beretta’s localized Holy Barrier for anti-individual use.</p><br/><p>He confronted Dino with calculated movements so that he obtained the advantage.</p><br/><p>But, Beretta’s true state of affairs was a situation in which he barely maintained the current delicate operation similar to that of threading a needle.</p><br/><p>At any rate, the attribute attacks, both Holy and Demonic, didn’t become a decisive blow.</p><br/><p>Dino is a Fallen Angel. He’s originally an existence of the Holy attribute that shifted into the Demonic attribute, so he should be weak to Holy attribute.</p><br/><p>But for Dino, Holy and even Demonic are familiar attributes to him. Because of this, he had no weaknesses.</p><br/><p>Beretta was saved by the fact that Dino couldn’t handle both attributes.</p><br/><p>Also, it’s a situation where only a single blow of the fusion of both attributes by Beretta’s Unique Skill『Holy-Demonic Fusion』could somehow cause damage to him.</p><br/><p>On the other hand, even if it’s only a sword strike, its single strike could cut Beretta easily.</p><br/><p>The strength of Adamantite became very helpless in front of God class weapons.</p><br/><p>At a glance, Beretta had continued the battle in an advantageous position but the situation could be immediately reversed with one incorrect move.</p><br/><p>Beretta, who understood this situation well, was devoting himself to stalling and buying time, as he wasn’t fighting for victory.</p><br/><p>He understood that he couldn’t win against Dino, but victory for him was not the defeat of his opponent.</p><br/><p>Certainly, It would’ve been great for him to win, but true victory in this situation was the completion of his task of protecting Ramiris.</p><br/><p>As long as he could protect Ramiris, then even if he was defeated, it was possible for him to revive later.</p><br/><p>Therefore, Beretta placed priority in stalling for time above all else, and as such he chose the strategy that relied, potentially on sacrificing himself, meaning that he must never get impatient while dealing with Dino’s attacks.</p><br/><p>Dino, on the other hand, accurately saw through Beretta’s intentions.</p><br/><p>However, saying that he’d shatter it just because he saw through it, wasn’t the case.</p><br/><p>What he only needed to be cautious of is the compound attack by『Holy-Demonic Fusion』.</p><br/><p>The aura that interweaved both holy attribute and demonic attribute which clad Beretta’s body could attack and pierce through attribute defense.</p><br/><p>Basically, defending against this attack was impossible. He will certainly receive damage unless he exceeds it with his willpower and magic power.</p><br/><p>Although it’s only a Unique Skill, it’s wonderful because it could damage Dino, who possessed an Ultimate Skill.</p><br/><p>He should praise his - Beretta’s - high offensive capabilities that were to the extent of being surprising.</p><br/><p>However, this ability had no use in defense.</p><br/><p>Because of his excessively-high defensive ability, he seems to be poor in self-defense technique.</p><br/><p>Currently Beretta is dealing well against Dino’s attacks, but that was only because Dino was persistently cautious of receiving Beretta’s strikes.</p><br/><p>In the case Dino shifted into attacking seriously, Beretta definitely would not have gotten off safely.</p><br/><p>Dino carefully ascertained that Beretta didn’t have any hidden items.</p><br/><p>It’s very troublesome but it’s a necessary work for neutralizing Beretta in this place.</p><br/><p>Anyway, Beretta will revive immediately even if he’s killed.</p><br/><p>It was what caused him to make the guardians of each labyrinth floor sleep.</p><br/><p>He could kill people if they weren’t one of Ramiris’ subordinates by destroying their ‘Bracelet of Revival’, but if her subordinates were killed then they would revive.</p><br/><p>A very troublesome ability that was given to Ramiris.</p><br/><p>Therefore, Dino didn’t defeat Ramiris’ subordinates inside the labyrinth but instead, he neutralized them.It was necessary to kill Ramiris who was the foundation if such an opportunity arose.</p><br/><p>(It’s really troublesome. Even against Beretta alone takes this much of effort……)</p><br/><p>By the way, at first Dino didn’t grasp that the ceremony of evolution was held at the victory celebration party.</p><br/><p>By the request from Yuuki, he contacted Guy in the middle of the victory celebration party and schemed to cause a clash between him and Rimuru.</p><br/><p>And then he was watching the situation while hiding so that he didn’t get involved in it.</p><br/><p>Everything was part of Yuuki’s plan, so he was in the position to cooperate with it.</p><br/><p>The plan went well, and there was a sign that Guy seemed to begin to rampage. But, Guy open his heart. It became peaceful for some reason and he realized that the plan had failed.</p><br/><p>“If things are going like this, even my spy conduct would’ve gotten exposed,” fortunately, dino had decided to withdraw at the right time…...</p><br/><p>He noticed that the state inside the labyrinth was odd.</p><br/><p>It became quiet as if it had fallen asleep.</p><br/><p>It was his chance.</p><br/><p>For the sake of him serving that personage - the person lying dormant inside Yuuki - Ramiris’ existence had become an obstacle.</p><br/><p>He didn’t personally dislike Ramiris, but she who was living as she pleased like she’d forgotten her original role became a dangerous existence to Dino’s master.</p><br/><p>No, to be accurate it’s not Ramiris who was dangerous…… it’s the labyrinth which she created that was far too dangerous.</p><br/><p>The labyrinth with many Devils rivaling the immortal Demon Lords living inside.</p><br/><p>It wasn’t an impregnable place.</p><br/><p>Not to mention, a research of the latest technology that can be called the core of the lost civilization was conducted in the deepest part of the labyrinth.</p><br/><p>Because an ordinary war potential invading it from the front to destroy the research facility was certainly unachievable.</p><br/><p>Thus, it was necessary to seal the labyrinth at any cost.</p><br/><p>The simplest way for it was to erase Ramiris. Dino decided that he had no time to be thinking about any other way.</p><br/><p>Yuuki had always regarded the labyrinth as dangerous.</p><br/><p>Also, Ramiris’ ability.</p><br/><p>It could be said that when someone gets caught inside the labyrinth and the entrance is closed, escaping would be difficult.</p><br/><p>Ramiris’『Labyrinth Creation』is a too dangerous ability, as it’s a glimpse into the ability that created the world.</p><br/><p>Dino also agrees with this thought.</p><br/><p>Thus, he needs to kill Ramiris in this place.</p><br/><p>As he deprived the physical strength of the strong individuals in the labyrinth, they fell asleep quite easily.</p><br/><p>If it’s right now, there’ll be no obstacles coming.</p><br/><p>He was a little sorry about killing Ramiris since she was a close friend, but even so, he had no hesitation.</p><br/><p>「Beretta, you did well. Sleep now, “Fallen Hypno (Slothful Sleep)”!!」</p><br/><p>Dino, without hesitating, releases the now reusable ability of his Ultimate Skill[2].</p><br/><p>A strong hypnosis induction.</p><br/><p>Resisting it with willpower is useless. For those who need rest, they would certainly fall into an eternal sleep.</p><br/><p>It was the strongest of Dino’s abilities that exerted a wide-range effect.</p><br/><p>Because Dino knew that it was meaningless even if he killed Beretta, he brought Beretta down with the effect of the ability.</p><br/><p>Similarly like him, even Ramiris who was being protected fell asleep under the influence of Dino’s ability.</p><br/><p>「Seriously there are just too many strong people in this place. Really, what a pain...」</p><br/><p>Confirming that Beretta has collapsed, Dino muttered so.</p><br/><p>He glanced at Ramiris who was sleeping soundly,</p><br/><p>「Actually, I didn’t want to do a thing like this….. but I’m not telling you to forgive me.</p><br/><p>Goodbye, Ramiris.」</p><br/><p>(EN: sayonara is written in katakana here, for some reason. Maybe it’s just there to make it more dramatic?)</p><br/><p>With a ruthless light in his eyes, Dino, without any hesitation, extended his hand towards Ramiris――</p><br/><p>A Demon is a race that doesn’t need to sleep</p><br/><p>Therefore, Beretta had barely succeeded in resisting Dino’s ability.</p><br/><p>He protected Ramiris from Dino’s spear hand that shone using his body as a shield.</p><br/><p>Dino’s spear hand pierced through Beretta's Adamantite body with ease.</p><br/><p>He seems to not care about Beretta’s defense power as currently he’s not clad in defense of magic power.</p><br/><p>Rather saying he succeeded in resisting the ability, he simply doesn’t need sleep.</p><br/><p>He forcibly make Beretta entered Sleep Mode and Beretta already has no combat ability.</p><br/><p>But,</p><br/><p>「Fu, fufufu. I purposely let my core be destroyed. As a result, now I’ll die and revive flawlessly.</p><br/><p>It still not the end yet, Dino. I will not let you kill my master!」 </p><br/><p>Beretta’s voice didn’t have any sign of despair and was convinced with their victory.</p><br/><p>「Fool. During the little time until you revive, there’s no obstacle for me to kill Ramiris!」</p><br/><p>Dino shouted, denying Beretta’s words.</p><br/><p>However, Beretta’s confidence was proper.</p><br/><p>While he stalling to buy some time, the situation had improved for the better.</p><br/><p>Rather than, in this first place inside this labyrinth――</p><br/><p>「No, I will not let you do it.</p><br/><p>This “Gehenna Lord (Dark Soul Lord)” Adalman will be your opponent!」</p><br/><p>One man―― No, one skeleton entered the Research Room as if responding to Dino’s voice.</p><br/><p>「I request you to delay him, Adalman.」</p><br/><p>As Beretta called out to him with trust, he became light particles and disappeared.</p><br/><p>Adalman gave a big nod and began taking over the fight.</p><br/><p>Inside the labyrinth, a second battle had begun.</p><br/><p> −−−−−−−−−−−−−−−−−−−−−−−−−−</p><br/><p>He really was really getting fed up with this.</p><br/><p>That was not Dino’s fake impression.</p><br/><p>Even Adalman isn’t a threat for Dino. However, without destroying his “Bracelet of Revival”, Adalman cannot be killed completely.</p><br/><p>On the contrary, from Adalman’s side, being able to stall for some time against Dino, who was of a higher rank, was already enough.</p><br/><p>Not to mention,</p><br/><p>「Do you have time to be looking away right now?」</p><br/><p>A voice is heard, and a sharp slash grazes Dino’s cheek.</p><br/><p>It’s Albert’s - who appeared after Adalman - sword.</p><br/><p>A single strike with a God class weapon from Albert, who was a top swordsman.</p><br/><p>Albert didn't seem to have mastered the armor yet, and it’s certain that Dino is advantageous yet……</p><br/><p>Attacks towards Adalman were tanked by the two people - Albert and the revived Beretta.</p><br/><p>And then, the attacks of those two reached Dino with the aid of Recovery Magic in the powerful Support Magic category.</p><br/><p>Magic doesn’t affect a person who possesses a Ultimate Skill.</p><br/><p>In a sense, this was the natural result because Ultimate Skills are of a higher rank of magic. But, it’s effective even if it only gives an indirect effect rather than a direct one.</p><br/><p>In other words, weakening magic and the like wouldn’t work, but giving support to an ally vanguard was effective.</p><br/><p>And in addition to that, it’s the compound effect of〈Undead Magic〉with〈Divine Magic〉of Adalman who was a top Grand Priest Class.</p><br/><p>Beretta had been able to show the ability that exceeded this a while ago, Albert is also in his top condition.</p><br/><p>The exchange of super special moves by the two vanguards who can damage even a spiritual life-form.</p><br/><p>Regarding the special sleep, it didn’t have effect as Undead and Demon didn’t need sleep.</p><br/><p>He, who should have been at an overwhelmingly higher rank, was having a hard fight against 3 people with lower ranks than him, which was causing him to lose his confidence…… “Have I weakened because of my lazy habit for a long time?”.</p><br/><p>Though it could be said that Dino still had composure, being able to think about such joking thoughts.</p><br/><p>「Shut up! And yet you two people came to attack the weak me, don’t say it so proudly!</p><br/><p>Damn it! Besides, why? The timing was too good, you know!?」</p><br/><p>This was too much for Dino, the timing when Adalman appeared was too perfect.</p><br/><p>It was unnatural for Adalman to appear immediately after Dino had used his ranged attack that was “Fallen Hypno”.</p><br/><p>It’s like the coming of that attack had been predicted since the beginning……</p><br/><p>(No, as expected I’m over thinking it…..)</p><br/><p>He denied his own thought, and finished dealing with the attack of those two vanguards.</p><br/><p>Dino is also a high level swordsman that equalled Albert in sword technique, who possessed a Super-Special Move.</p><br/><p>However, he is able to fight evenly because of his physical ability rather than his techniques.</p><br/><p>Because Dino’s『Slothful King Belphegor』had a special ability of increasing his power if he didn’t move.</p><br/><p>If you say it plainly, he could basically increase his energy by saving his energy.</p><br/><p>Though there’s a limit to the maximum amount that he could let out at a time, he could arbitrarily use it in the Hyper Mode to go beyond his usual state.</p><br/><p>With that ability, Dino can get a temporary overwhelming fighting power.</p><br/><p>Therefore, because he still had surplus of power, he must ascertain the most efficient way to kill the 3 people in front of him…..……</p><br/><p>「Fuu, fuhahahahaha! I’m happy I’m happy. It might be not a problem even if I inform you.</p><br/><p>You were observed you know.</p><br/><p>That’s only natural right? Have you thought about the place you are in right now?</p><br/><p>After all, it’s the territory of the Great Demon Lord Rimuru-sama. You cannot do whatever you please.</p><br/><p>Of course, this battle is being observed (monitored) too」</p><br/><p>Adalman informed Dino totally as if what he said was a known fact.</p><br/><p>No, if he gave it more thought he, too, would agree.</p><br/><p>Even Dino could see that Demon Lord Rimuru possessed fearsome ingenuity, enough to set up this deeply laid plan. </p><br/><p>If that was the case, even if they succeeded in resisting “Fallen Hypno” at first, they would not immediately come over, he might need to be cautious about re-using it.</p><br/><p>Since Dino knew that they would revive even if he had killed them, it was expected that he would surely aim to neutralize them with a sleeping attack.</p><br/><p>And if they grasped the time for its reuse, he would have no effective means to completely silence them.</p><br/><p>Above all else――</p><br/><p>(This, me….. the “Observer”, is being observed, he said!?)</p><br/><p>――that was humiliating.</p><br/><p>It stimulated Dino’s pride, who originally lazy in nature, and Adaman succeeded in making Dino angry.</p><br/><p>It was a rule for Dino to achieve the biggest result with a little effort, therefore he avoided the use of an ability that consumed energy needlessly.</p><br/><p>But, it doesn’t mean that he wouldn’t do it.</p><br/><p>(It might be good if I end it quickly!)</p><br/><p>Dino releases all his power in anger, his unwilling nature had disappeared.</p><br/><p>He made the biggest mistake by failing to realise who was truly being observed and as such, he cannot let the people who know this information live.</p><br/><p>「It’s troublesome, but I cannot say so either.</p><br/><p>Don’t think badly about me! “Fallen Catastrophe (Temptation towards Destruction)”!!」</p><br/><p>The law is rewritten, and the positive factor starts reverting to minus.</p><br/><p>Energy that lead to the suspension of activity, regardless of being living or undead. However, since there was no compelling force, it was the target of the technique who voluntarily walked on the road to destruction.</p><br/><p>It can be seen as a kind of hypnotism, but the effect caused by this ability was on a different level.</p><br/><p>Because everyone who failed in resisting this will surely die.</p><br/><p>The point of the inducement this time was “Destruction”, but Dino could make the target conduct a specific result with the hypnosis. It was a versatile ability.</p><br/><p>Because it didn’t use sound as medium, a barrier or the like can’t defend against it which may be its notable point.</p><br/><p>As one of the seven deadly sins, “Sloth” could also be called one of the most dreadful ultimate abilities..</p><br/><p>That’s because it’s an ability that could exert absolute control over people with emotion and intelligence.. </p><br/><p>Due to the activation of Dino’s ability, everyone who was in this place fell down and their deaths were confirmed.</p><br/><p>Dino had a harder time than he thought.</p><br/><p>They were existences that hadn’t acquired Ultimate Skills yet, nevertheless he shuddered at the fact that they were only the subordinates of a sole Demon Lord.</p><br/><p>To be precise, Beretta holds two position as he was Ramiris’ subordinate, but such a thing was an irrelevant point.</p><br/><p>(Really…… they were not the highest ranking people among Demon Lord Rimuru’s subordinates, right?)</p><br/><p>It’s a justified point that Dino wants to complain.</p><br/><p>According to Dino’s opinion, his opponents now could be the key figures amongst Rimuru’s subordinates.</p><br/><p>But after battling Albert and others, it seems that he ought to make an upward adjustment in his evaluation.</p><br/><p>Since it had became a state of emergency, the high rank group had been dispatched. Among the remaining high ranked people, he had confirmed that Benimaru had went elsewhere.</p><br/><p>The only remaining threat for Dino was Shion, but she hadn’t awakened an Ultimate Skill yet.</p><br/><p>He was extremely cautious and, after confirming the situation, it seemed to be a correct answer for him to wait until the last minute when the success rate increased.</p><br/><p>Because if Benimaru, Shion and Souei had also participated in the fight with the three that he had just defeated, the situation would’ve become more difficult even if he didn’t lose.</p><br/><p>Being relieved for the time being, Dino stretched out his hand and towards Ramiris’ corpse in order to confirm the result.</p><br/><p>“Fallen Catastrophe” is an ability that scattered a wave of hypnosis inducement to the surroundings, so there’s no escape from it.</p><br/><p>The effect is shown if the target is basked in it, even in sleeping state. Rather, the target would die without being able to resist it in their sleep.</p><br/><p>Dino was convinced of Ramiris’ death and touched the body.</p><br/><p>―― He touched it (the corpse), or what it should’ve been.</p><br/><p>The corpse turned into light particles, as it took the shape of a butterfly and flew around Dino’s surroundings.</p><br/><p>As if it was sneering at Dino…… </p><br/><p>(――No way…… it was an illusion!?)</p><br/><p>He doesn’t want to believe it as it was unbelievable.</p><br/><p>But…… surely, Adalman had said so.</p><br/><p>“This battle is being observed too”.</p><br/><p>(Was that a provocation? In order to make me use my trump card……!?)</p><br/><p>So, when he thought about it, it was unnatural for Adalman to say that remark there even though it didn’t create an advantage against Dino.</p><br/><p>But, even if it could create an advantageous situation, it wasn’t something that he could understand.</p><br/><p>In other words……</p><br/><p>Thunk, thunk――</p><br/><p>Slowly, someone's footsteps were heard.</p><br/><p>The beautiful butterfly of light flew, as if dancing, towards the person who walked calmly and touched that person’s hand.</p><br/><p>And the butterfly returns to the form of a fairy sleeping adorably…… Ramiris, who slept innocently and seemingly happily.</p><br/><p>Ramiris was handed over to a man with blackish blue hair beside the hand’s owner, who stood without any presence and before anyone was aware of him,</p><br/><p>「Souei-dono, I leave Ramiris-sama to you」</p><br/><p>A man said it calmly.</p><br/><p>「Yeah, leave it to me. Support?」</p><br/><p>「There’s no need. I alone is enough」</p><br/><p>From the beginning, defense for Ramiris was conducted perfectly.</p><br/><p>In the safest labyrinth depths, multiple layers of trap were set up.</p><br/><p>By the instructions of a certain person, they were ordered to fight minimally in order to strip the ability of the person who come as a spy.</p><br/><p>They followed the order faithfully.</p><br/><p>The only one who didn’t know about this was Ramiris. </p><br/><p>And, now――</p><br/><p>The strongest existence inside the labyrinth had begun to move.</p><br/><p>It had engulfed itself in a cocoon in order to evolve its ability, but its consciousness had always been awake.</p><br/><p>It was always paying attention due to Thought Link, and it completely grasped the situation.</p><br/><p>Due to its blessing of overwhelming, absolute defense, Ramiris’ safety was ensured.</p><br/><p>Inside the labyrinth, the third fight began.</p><br/><p>Standing in front of Dino was the “Mist Lord (Phantasmal Lord)” Zegion.</p><br/><p>He who was the strongest being in this labyrinth. </p><br/><p>[1] Beretta’s body. It’s wholly Adamantite.</p><br/><p>[2] Think that his ability has cooldown.</p><br/><p>Guro's Note</p><br/><p>You met Cliff-san here too!</p><br/>\n</div>"}