{"title": "Chapter 186 – First Move", "id": 186, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-186-%E2%80%93-first-move", "volume_title": "Volume 2", "body": "<h1>Chapter 186 – First Move</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>First Move</p><br/><p>Soon after Rimuru went to rescue Veldora, the ones who had been left behind immediately shifted into an emergency reorganization.</p><br/><p>They entered a state of high alert under Benimaru’s command so that any situation that might arise could be swiftly dealt with.</p><br/><p>The reorganization was swiftly completed without any incident immediately after the Empire Invasion. However, it excluded the people who received the effect of evolution.</p><br/><p>Benimaru confirmed that the reorganization was finished, with Souei and Shion, the 3 of them had made the arrangements.</p><br/><p>Gabil returned to the cave due to the evolution, Gerudo went to the meeting in the Empire Military Headquarters in order to organize it.</p><br/><p>The defense of Tempest in Rimuru’s absence was left to the ones left behind.</p><br/><p>It was natural that Benimaru and Shion acted as usual as they had not been affected by the evolution.</p><br/><p>They had some qualms believing that the grand “Dragon kind” Veldora had fallen into enemy hands, but they didn’t need to worry about it since their master had already left to deal with the situation.</p><br/><p>Because their master, the Demon Lord Rimuru, is the strongest of the Demon Lords who possessed both strength and fearsome insight to an abnormal degree.</p><br/><p>During Rimuru’s absence, they believed that the probability of some trouble occurring would be very high.</p><br/><p>「Benimaru…… Is it all right? You know, that one. How’s your work as the chief?」</p><br/><p>「Wa! What are you saying, Shion! In this emergency state, I’m too preoccupied to even think of that!?」 </p><br/><p>To the rather blunt question of Shion, who pried too much into other people’s business, Benimaru tried to dodge the question while trembling.</p><br/><p>However, he was unsuccessful and the place was filled with an awkward atmosphere.</p><br/><p>The reason for this was his marriage (soul binding) with Momiji, which had been approved in the time of the victory celebration party. It was celebrated then, but there were various traditions that had not ended yet.</p><br/><p>He was also concerned about this, but Benimaru thought that he should restrain himself until it soon reached such circumstances.</p><br/><p>Above all, the situation immediately progressed to an emergency state after Guy’s attack and Veldora’s rampage. He had no time to think about such matters now.</p><br/><p>Now at last, they could have a relatively short amount of calm.</p><br/><p>Although, the demons (Diablo’s group) were summoned with a transfer not long ago and just made a sortie, this didn’t change the fact that he couldn’t let his guard down in the event of something happening later.</p><br/><p>The words said by Benimaru were true but,</p><br/><p>「No, that’s an important task.</p><br/><p>Benimaru, as it’s currently unknown what will happens hereafter, I think that you should do the thing you could do ahead of time.」</p><br/><p>Souei who heard the conversation urges Benimaru.</p><br/><p>After all, in this situation he would give a reason somehow or another to obviously postpone the problem. For Souei who has long been acquainted with him, he clearly understood his close friends thoughts.</p><br/><p>「However, you…… Although Rimuru-sama went to the front line, only I’m in such――」</p><br/><p>Like giving up, Benimaru argues vehemently,</p><br/><p>「There’ll be no problem. There are 12 Guardian Lords with several others standing by in here.</p><br/><p>My subordinates said that they didn’t get enough highlights, so we can cope with it even if you are not here.</p><br/><p>Apart from that, the quicker you do it and awaken, you can become more useful to Rimuru-sama, right?」</p><br/><p>「I know that but…… How about you, Shion?</p><br/><p>Why you can’t evolve? What reason do you have?」</p><br/><p>Shion pursued and made further attacks on Benimaru. But, she was asked in return.</p><br/><p>The two stared at each other and the place became more awkward.</p><br/><p>Souei expressed his disappointment and let out a sigh,</p><br/><p>「Benimaru, it’s alright to entrust this place to us. Currently, I had strengthen the surveillance in various places.</p><br/><p>If there are any signs of movements, we could immediately deal with it. You should fulfill your duty.」</p><br/><p>He supported Benimaru who still lacked determination.</p><br/><p>After the brief exchanges were over, Benimaru decided to accompany Momiji towards the village over the boundary to greet the Tengu’s elder.</p><br/><p>The deciding factor for this was the report that Rimuru had succeeded in liberating Veldora.</p><br/><p>Souei and Shion looked at each other and blew out a sigh of relief.</p><br/><p>Benimaru who was the head from the time they were still Ogres, was an important existence among their companions.</p><br/><p>And, it was similar for Shion who was of the same race.</p><br/><p>Thus, Benimaru was finally determined because of those two’s prodding.</p><br/><p>However, as if choosing the time when Benimaru would depart, one person began to act.</p><br/><p>This action became the first move for the incoming great war.</p><br/><p> −−−−−−−−−−−−−−−−−−−−−−−−−−</p><br/><p>The merry atmosphere of the victory celebration party changed completely with the later turn of events.</p><br/><p>Even for Ramiris who had returned to the innermost part of the labyrinth.</p><br/><p>Ramiris was in high spirits as the evolution of her subordinates, the dragon kings, finished without incident as well. However, when she heard that her teacher Veldora had been caught by the enemy, even her merriment faded away leaving her looking uneasy.</p><br/><p>Ramiris wanted to spend every day happily. She thought of the place that granted this wish as a splendid one.</p><br/><p>Ramiris had spent a long time alone distracted herself from loneliness with the existence of the spirit, so she never wanted to lose something that had become so important her.</p><br/><p>Therefore, it could be said that the one who worried the most about Veldora’s matter was her.</p><br/><p>「Geez! Teacher was absolutely letting his guard down. I’m sure of it.</p><br/><p>Really, geez. It can’t be helped right, if he was careless, Teacher should be invincible…….」 </p><br/><p>Ramiris mutters inside the laboratory on the bottom layer where she spent many times together with Veldora.</p><br/><p>She flies around and around inside the room with no sign of her calming down.</p><br/><p>The thing that finally calmed Ramiris down was the report from Shuna saying that Veldora was finally liberated safely.</p><br/><p>「Well I believe that teacher will be all right though!</p><br/><p>When Rimuru went for it, there’s nothing to be worried about」</p><br/><p>She finish saying such a thing magnificently and drank the juice joyfully.</p><br/><p>“Yeah, yeah it’s so.” So Shinji and co eludes her.</p><br/><p>Beretta, who was standing beside Ramiris, didn’t show any agitated behavior from the beginning as he kept taking care of his unsettled master.</p><br/><p>(I need to follow Beretta-san’s example a bit, I should calm down a little……)</p><br/><p>Shinji had such impressions towards his employer, but he never said them. If he said such a thing, it would rouse needless anger and his salary might get reduced.</p><br/><p>(Even so, Shuna-san is lovely as usual~)</p><br/><p>Shinji dispelled the thought quickly, as it can’t be helped, even if he was thinking about his employer.</p><br/><p>Even Shuna’s figure which bowed when leaving the room, was dignified and had no flaw. Her appearance seems delicate, but it’s a famous story that she was scary if you made her angry.</p><br/><p>It was not only Shinji, but Mark and the new helpers, Michel and Raymond, who also yearned for Shuna.</p><br/><p>After Shuna left the room, he saw his employer Ramiris.</p><br/><p>He unintentionally let out a sigh.</p><br/><p>「…… Wait a moment, Shinji. If you have anything to say I will listen, though?」</p><br/><p>「No, there’s nothing.」</p><br/><p>He denied in panic. His feeling seemed to have appeared on his face.</p><br/><p>「Your control over your emotions was still insufficient!」</p><br/><p>Gadra-roushi who is his master had scolded him about this, but he was now convinced.</p><br/><p>Certainly he was not too good at controlling his emotion, which is indispensable to a magician. He wanted to learn from the quite expressionless Xing.</p><br/><p>Oh well, it might be rude to compare Shuna with Ramiris.</p><br/><p>Just like, an adult to a child. Rather, there seemed to be further differences.</p><br/><p>Because although Shuna’s appearance still looks like a young girl, her demeanor is of a refined adult.</p><br/><p>Although she seemed to be alive for many years now, Ramiris, who has the appearance and mind of a child, couldn’t stand a chance against Shuna.</p><br/><p>He thought that Ramiris was cute (pitiful) and that he should treat her more kindly.</p><br/><p>However, Shinji remembered the state of the victory celebration party not long ago.</p><br/><p>An out of place report that said the god-like existence[1] named Veldora was caught by the enemy came flying suddenly, but the series of events during the victory celebration party were beyond his mind's capabilities to comprehend.</p><br/><p>The devils had an unimaginable power.</p><br/><p>They pledged their loyalty to the Demon Lord Rimuru.</p><br/><p>Shinji is an Otherworlder and he was conceited in thinking that he might be a high-ranking existence. But after he saw that scene, such thoughts were swept away.</p><br/><p>He understood that the war potential of the Empire army that came to invade Tempest was less than 30% of the total forces of Tempest.</p><br/><p>Moreover, it’s a story completely from before the victory celebration party.</p><br/><p>Right now, they can evolve further based on their title. Tempest’s Executives seem to start evolving into the Awakened Demon Lord Class.</p><br/><p>To be honest, he doesn't understand the meaning of it.</p><br/><p>But they were really glad that they took a refugee from the Empire to Tempest! So Shinji thanked Gadora-roushi once again.</p><br/><p>Like that, knowing the safety of Veldora, Ramiris and Shinji’s group were relieved.</p><br/><p>「Eh, Dino-san? Where had you gone?</p><br/><p>That reminds me...... Rimuru-sama was looking for you, you know?」</p><br/><p>「Ah, my bad my bad. It’s just a small business. By the way, is Ramiris here?」</p><br/><p>Such conversation was heard.</p><br/><p>Dino who had been missing came back, and Mark seemed to notice him.</p><br/><p>「Ah, Dino! Hey you, what you have done? Rimuru is searching for you in anger you know!?」 </p><br/><p>Ramiris stops drinking her juice and flies up, she’s about to go towards Dino.</p><br/><p>And then, Dino confirms it,</p><br/><p>「What do you intend to do, Dino-sama?」</p><br/><p>Dino’s thrust out hand in front of Ramiris was gripped by Beretta from the side instantly.</p><br/><p>Although Dino moved at a speed that even Shinji and co couldn’t follow with their eyes, Beretta seemed to prevent it.</p><br/><p>It seems that because the reaction was too quick, they could only compensate by guessing.</p><br/><p>「……Is that so, you’re still here huh. Oh dear, There are many real hindrances in this place. 」</p><br/><p>Dino let out a sigh like he was bored while looking at Beretta with his eyes closed partly.</p><br/><p>Finally Shinji and co grasped the situation, it seems that the situation wasn’t a trivial matter.</p><br/><p>However, someone still not catching up with the situation, </p><br/><p>「…… Eh? Eh!?」</p><br/><p>Ramiris looked at Beretta and Dino alternately, she seemed to be desperately trying to understand the situation.</p><br/><p>Shinji moved quickly and stood in a position to protect Ramiris beside Beretta.</p><br/><p>Similarly, Xing also moved but Mark collapsed on his spot.</p><br/><p>Dino might have eliminated Mark, as he was a hindrance, when he extended his hand toward Ramiris.</p><br/><p>Mark, the same as Shinji, was a subordinate of Ramiris. Therefore revival is possible even if he died….. even so, Shinji was not able to endure himself as his friend was killed.</p><br/><p>Shinji burned with anger,</p><br/><p>「Hey, you! What did you do so suddenly?」</p><br/><p>He asked Dino.</p><br/><p>However, Dino only fixed his eyes on Ramiris without considering Shinji or the other people……</p><br/><p>「”Manager” Ramiris, the time has come.</p><br/><p>Even you who lost your memory and mutated must not be a harm to that person.</p><br/><p>If I bury you now, this labyrinth will be sealed.</p><br/><p>The devils in this labyrinth are too dangerous.</p><br/><p>If you’re not useful, at least don’t be a hindrance, so please die obediently――」</p><br/><p>With serious face, he said that to Ramiris.</p><br/><p>But,</p><br/><p>「Huh? You, are you losing your mind?</p><br/><p>Saying such a thing, if I tell Guy, he will beat you, you know?」</p><br/><p>He was turned down flatly by Ramiris’s words.</p><br/><p>Dino who heard it began to laugh.</p><br/><p>「That’s right. As expected, I thought that you would say so.</p><br/><p>But actually…… I’m serious.</p><br/><p>Though unwillingly, I’m an existence created with the purpose of “Observer[2]”.</p><br/><p>The truth is, I don’t want to work though.</p><br/><p>The world where I don’t need to work is an ideal, well, so it goes.</p><br/><p>Because such a thing, please try your best to resist.</p><br/><p>But, I can’t cut corners too.</p><br/><p>Because there’s another “Observer” besides me, so try your best as much as you can and drive me away」</p><br/><p>As if it’s his usual expression to be lazy and carefree, he restated his words while waving his hand.</p><br/><p>But, contrary to such behavior, Dino’s atmosphere changed to that of a refined person.</p><br/><p>Since things have come to such a pass, Ramiris seemed to finally realized the reality.</p><br/><p>「Wait, you! You seem to say it seriously.</p><br/><p>Some nerve you have, I will be your opponent.</p><br/><p>Because I have Dragon Kings as my subordinates!」</p><br/><p>「Ah, about them.</p><br/><p>If they appears, it would be very troublesome, as you cannot kill them inside the labyrinth right?</p><br/><p>Therefore, I’ll make them go to sleep.</p><br/><p>Their evolution didn’t seem to be finished completely, it was great that my ability was effective.</p><br/><p>I can remove the hindrances without getting any trouble.</p><br/><p>Right now, the only people awake inside the labyrinth are the two of us.」</p><br/><p>「Haa? Such a thing......」</p><br/><p>「It is, that’s with my ability, Ultimate Skill『Slothful King Belphegor』, I made this labyrinth fall asleep!」</p><br/><p>「Whatever! Send him to his end, Beretta-san!」</p><br/><p>Ramiris shouted so, not knowing what influenced her.</p><br/><p>Dino also,</p><br/><p>「Please survive as long as possible and take some defensive measures!」</p><br/><p>He started attacking Beretta while saying those words.</p><br/><p>It was so sudden, the laboratory which had a considerably large space turned into a battlefield.</p><br/><p>Dino seemed to reveal his private circumstances intensely, but Shinji thought that this Dino was a guy he would never be able to comprehend.</p><br/><p>Though Ramiris wasn’t aware enough to think of such a thing, there was no need to talk about it.</p><br/><p>Coming from Dino, there was no need to stall for time, because time was precious.</p><br/><p>He thought about how they failed to notice he was leaking information because he was accepted as a comrade.</p><br/><p>But even so, he couldn’t believe him because he may intend to deceive people.</p><br/><p>Another thought was that Dino believed everything would be alright if he eliminated everyone.</p><br/><p>However, if that’s the case then time is precious, there’s no merit in leaking information.</p><br/><p>Really, he was unreliable as an ally but it could be said that he would be a more troublesome type of person as an enemy.</p><br/><p>The battle between Dino and Beretta grew more intense while such analysis from Shinji was an unrelated matter.</p><br/><p>This became the preliminary skirmish of the Great War.</p><br/><p>[1] An existence above the clouds.</p><br/><p>[2]  Kanshisha = Observer, Watcher, Surveillant, Supervisor.</p><br/><p>Guro's Note:</p><br/><p>Any suggestion for better wording and etc are welcome.</p><br/><p>Thanks for reading!</p><br/>\n</div>"}