{"title": "Chapter 198 – Gobuta & Karion vs The Four Fiends of the Heaven Commanders’ Vega", "id": 198, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-198-%E2%80%93-gobuta-karion-vs-the-four-fiends-of-the-heaven-commanders%E2%80%99-vega", "volume_title": "Volume 2", "body": "<h1>Chapter 198 – Gobuta & Karion vs The Four Fiends of the Heaven Commanders’ Vega</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Gobuta &amp; Karion vs The Four Fiends of the Heaven Commanders’ Vega</p><br/><p>“I’m going to die-ssu! That one just now was considerably dangerous you know-ssu!!”</p><br/><p>Karion let out a deep sigh while sending a sidelong glance at Gobuta who was running, trying to escape while screaming.</p><br/><p>‘This guy, he’s clearly doing it intentionally!’ so Karion thought, as Gobuta repeatedly evaded Vega’s attacks at the last moment.</p><br/><p>Yes certainly, if he was late by one beat, Gobuta would be hit by the magic bullets and die. There’s no doubt about it.</p><br/><p>But, that’s only the case if he’s hit.</p><br/><p>『Karion-san, take a half step to the right, and then jump slightly-ssu!』</p><br/><p>Karion receives Gobuta’s instructions and followed them without hesitation.</p><br/><p>He carried it out obediently without asking questions. This action hasn’t changed since the their special training with Milim.</p><br/><p>Soon after moving according to those instructions, magic bullets hit the spot he was standing before, and the ground was gouged out by the magic bullets which bombarded his feet. Thankfully, there was no effect on Karion as he moved according to Gobuta’s instructions.</p><br/><p>(As I expected, this guy is really a genius)</p><br/><p>Karion cannot see it.</p><br/><p>Even the aura bullet from before came flying faster than the speed of sound. The magic bullet was much quicker after being shot, despite it needing some time to knead magic power into the aura.</p><br/><p>Evading them with sight is difficult. Karion thought not just that it might be impossible to dodge himself, but even more to give instructions to other people.</p><br/><p>If was communicated using voice, then it would be impossible. Because before someone understood the content of the instructions, they would’ve received a direct hit from the attack.</p><br/><p>That’s why Karion and Gobuta converse with『Telepathy』but......</p><br/><p>How fast does someone have to think to be able to see through the enemy’s attack, movement, ascertain the kind of attack being used, then predicting the timing and the location of impact.</p><br/><p>Karion was interested in how far Gobuta had forseen, as he could barely respond with super instinct ability that was beyond his imagination.</p><br/><p>He remember the conversation happened when Gobuta arrived a little while ago.</p><br/><p>「Karion-san, it will be bad if you are still like that-ssu. Can’t you use『Beastification[1]』just for a moment and immediately cancel it-ssu?」</p><br/><p>He said such a thing.</p><br/><p>Karion understood that he was in a dangerous situation as he more or less lost half of his body. However, he couldn’t understand the meaning of Gobuta’s words.</p><br/><p>「Huh? You, what are you saying……?」</p><br/><p>「It’s easy, you know-ssu. You just need to activate『Beastification』 and immediately tell your mind to cancel it-ssu!」</p><br/><p>Although he didn’t understand the meaning, he carried it out just as Gobuta had said.</p><br/><p>Because Gobuta is his bestie, he did it and matched Gobuta’s timing.</p><br/><p>And then, an unbelievable thing happened.</p><br/><p>In a moment, his ability rose tremendously and his body regenerated due to the effect of super restoration.</p><br/><p>And, he should have transformed, but 『Beastification』 didn’t activated because he cancelled it.</p><br/><p>In other words, only the recovery effect was activated. With the added bonus of his energy recovering about half by taking in the surroundings’ magic essence.</p><br/><p>(Haaaaaa!? What the hell is this!!)</p><br/><p>Karion was astonished.</p><br/><p>He didn’t clearly understand what happened, but was certain he was able to recover while keeping『Beastification』.</p><br/><p>「Wow, as expected from Karion-san, you’re able to do it in one try-ssu!</p><br/><p> In case you failed I had a Full Potion-ssu, but with potions-su your energy wouldn’t restore right-ssu.</p><br/><p>How is it, convenient right? I also taught this to Gabil-san, I’m overjoyed-ssu!」</p><br/><p>Gobuta said those words.</p><br/><p>In other words, it’s possible for people who possess transformation type abilities to receive the complete recovery effect by canceling the transformation at the right time.</p><br/><p>‘How can you know this without a transformation ability!!’ so Karion wanted to ask Gobuta, but he needed to act rationally now and strongly endured it.</p><br/><p>Anyway, right now it’s time for him to defeat Vega.</p><br/><p>(Actually, that guy looks like a bad joke……)</p><br/><p>While Karion thought so, he kept avoiding Vega’s attacks by following Gobutas’ instructions.</p><br/><p>Vega felt that he had never before been made a fool by a Hobgoblin, who impudently came to support his opponent.</p><br/><p>It’s so weak to the extent that it would die if I hit it with one bullet.</p><br/><p>His opponent is only a small and weak devil class with a meager amount of magic power whose barely surpass A rank.</p><br/><p>His attacks couldn’t hit this opponent.</p><br/><p>(Shit! Stop messing around!!)</p><br/><p>He violently throws out the aura bullets without refining them against the ground.</p><br/><p>The aura bullets explode on the ground, blowing the earth and sand to the sky.</p><br/><p>(Humph! With this I’ve deprived them of their sight. You insolent trash!!)</p><br/><p>Hidden by the raised dust, Vega molds an extra-large magic bullet. And then, against his targets who have their sight deprived from them, he releases his sure kill attack.</p><br/><p>The large magic bullet goes on while blowing away the dust.</p><br/><p>However, he notices that the presence of his targets disappeared right before the large magic bullet hit them.</p><br/><p>（――！？）</p><br/><p>Vega’s question was answered by a short sword stabbing his flank.</p><br/><p>「Waa! It’s so tough-ssu. My hand that tried to stab him became numb-ssu!」</p><br/><p>That damn impudent goblin seems to have sensed the place where magic power was refined beyond the blockage of the dust and at the same time tried to stop it.</p><br/><p>Gobuta didn’t immediately utilize the smokescreen and attack. Instead, he completely suppressed his presence and slipped into Vega’s bosom under the cover of the earth and sand.</p><br/><p>「Don’t make fun of me, you lowly goblin!!」</p><br/><p>Vega who’s enraged, shouts so.</p><br/><p>But, Gobuta without panicking,</p><br/><p>「Ooh, you have mistaken-ssu. I’m a Hobgoblin-ssu!」</p><br/><p>So, Gobuta corrected Vega’s statement in a cheerful manner.</p><br/><p>Vega’s mind is boiling with anger due to Gobuta making fun of him</p><br/><p>But, that state of mind is a reaction that Gobuta expected...... Karion who had been forgotten by Vega, who can’t think straight because of anger, is getting closer to Vega while suppressing his presence.</p><br/><p>Then,</p><br/><p>「Die, Beast Roar!」</p><br/><p>Vega who nearly attacked Gobuta at that moment received a direct hit from Karion without being able to react.</p><br/><p>Gobuta splendidly made Vega dance in his palm.</p><br/><p>It’s a deadly blow from the Lion King Karion, not just surface-grazing power. Half of Vega’s body had been blown off by the magic particle cannon.</p><br/><p>However, even in such conditions, this isn’t a serious problem for Vega.</p><br/><p>Because his auto-recovery ability activates immediately, his body simply starts regenerating.</p><br/><p>The problem was the inferior race, a hobgoblin, who was currently leading him around by the nose for no good.</p><br/><p>「Damnnnnn!! I will not forgive this, you inferior insect trashhhh!!」</p><br/><p>So Vega shouted.</p><br/><p>He’s already wanting to smash it with all of his power.</p><br/><p>His eyes burn with anger, there’s no longer any fragment of his pride to prevent him from doing things seriously, or make him underestimate weak opponents.</p><br/><p>Vega, for the first time, recognized Gobuta as his opponent.</p><br/><p>At the same time Vega recognized Gobuta as an enemy, he regained his calm train of thought.</p><br/><p>He changed his thoughts, ‘If it was an enemy he himself recognized then he was not made a fool of, it’s just a great opponent’.</p><br/><p>「Kukkuku. Is that so? That’s right. Yours truly wouldn’t have much trouble against a mere goblin.</p><br/><p>You’re pretending to be a goblin, but you’re not actually an ordinary one, something like that right?!」</p><br/><p>Vega revealed a thought that he himself agreed with, while laughing.</p><br/><p>Karion looked on with eyes that said ‘What is this guy talking about?” and ignored him, Vega then continues.</p><br/><p>「But…… Yours truly doesn’t have a bad eyes. Your true abilities have been seen through easily!!</p><br/><p>Well now! You should reveal your true colors quickly! Yours truly will destroy you!!」</p><br/><p>Saying so, he pointed his finger at Gobuta.</p><br/><p>To Vega, who said such a thing,</p><br/><p>「Huu, good grief-ssu. If it’s been seen through then there’s no other choice-ssu.</p><br/><p>Okay-ssu. I will show you-ssu! My true form!!」</p><br/><p>Gobuta’s playing along well.</p><br/><p>And while acting like that,</p><br/><p>『Well then, without any delay. Karion-san, get behind him and fire another one-ssu!』</p><br/><p>Gobuta gave out the most cowardly instructions to Karion.</p><br/><p>Even so, Karion didn’t have any reason to object to it.</p><br/><p>He left Gobuta, who was saying his catchphrase and for some reason taking a strange pose, to sneak around behind Vega.</p><br/><p>「 “Star Lord” Ranga, it’s your turn-ssu! Activated『Star Wolf Summon』!!</p><br/><p>『Right now-ssu!!』</p><br/><p>See this carefully! “Transform”!!」</p><br/><p>Gobuta shouts, and in an instant, Ranga jumps out of the shadow.</p><br/><p>(Well well, I’m tired of waiting you know, Gobuta)</p><br/><p>(Well~ it takes time to reach the climax you know-ssu!)</p><br/><p>Vega hadn’t imagined such exchanges happening.</p><br/><p>Vega looked at Gobuta, with a surprised and delighted expression, as Gobuta was wrapped in light and the appearance of a huge amount of magic power was fused with him.</p><br/><p>Karion, who had done with his preparations, fired out a Beast Roar at Vega’s back.</p><br/><p>Alas, it has no effect on Vega even though he had already been hit by it many times. Even the holes in his body got healed in an instant.</p><br/><p>He shoots it with the maximum power, but even the 1 decimeter wide flash didn’t seem to burn Vega completely.</p><br/><p>It’d be the same even if he did it with Diffusion Roar.</p><br/><p>He’s able to understand that the result wouldn’t change, even if 9 magic particle cannons were fired at the same time, it wouldn’t stop Vega from recovering.</p><br/><p>He understood it now.</p><br/><p>Vega wasn’t really doing things seriously.</p><br/><p>Karion shot his technique according to Gobuta’s instructions, Vega already received more than three direct hits as he was careless due to the smokescreen and his aura bullets.</p><br/><p>Thanks to that, Karion’s energy was about to run out. Because the timing for the skill he learnt a while ago was difficult, restoration wasn’t an option, it has a low success rate so it can’t be expected much.</p><br/><p>Above all,</p><br/><p>「It cannot be used many times-ssu. Because it is absorbing the magic essence from the surroundings-ssu, the concentration of the magic essence will get thinner and eventually the restoration won’t happen-ssu.</p><br/><p>If someone powerful like Rimuru-sama or Veldora-san did it, who have much of their own magic power, such worry is not needed…..」</p><br/><p>Because of that.</p><br/><p>Karion could certainly understand that it’s not a technique that could be abused.</p><br/><p>Meanwhile, what’s the purpose of attacking so many times while knowing that it’s useless?</p><br/><p>At first even Karion questioned it, he was able to understand the purpose a bit now.</p><br/><p>Vega was looking down on them and never going seriously. With that, his weaknesses can be analyzed by attacking him from various angles and positions.</p><br/><p>And Gobuta wonderfully provoked the self-conceit Vega by showing off that weakness and taking the role as the decoy.</p><br/><p>(Splendid, As expected of Gobuta……</p><br/><p>If we used full power from the start, then we wouldn’t have been able to draw information smoothly up to now……)</p><br/><p>Karion praises Gobuta’s strategy honestly.</p><br/><p>But, the result was only this dangerous feeling he got, that was, Vega didn’t have a weakness.</p><br/><p>Vega had taken root in the ground and absorbed the nourishment from it.</p><br/><p>And he’d take in the organic matters such as corpses and plants to made up his body. The only saving grace was how it seems he’s unable to use inorganic substance for his body.</p><br/><p>The battlefield continued spreading, and so new corpses are being mass-produced on the ground.</p><br/><p>It was possible for Vega to restore his body near limitlessly.</p><br/><p>Karion bit his mouth and thought unpleasantly, as he saw that the wound he just gave to Vega was quickly restored.</p><br/><p>However, in front of Karion and Vega, the light which came from Gobuta became jet black fog that was cladding Gobuta inside it.</p><br/><p>‘Transform!’ so Gobuta’s voice reached Karion’s ears.</p><br/><p>Then――</p><br/><p>What appeared was the figure that Karion had witnessed several times during their special training before.</p><br/><p>This is the combined state of Gobuta and the Black Storm Star Wolf, Ranga, in this form Gobuta has energy levels comparable to an awakened Demon Lord[2].</p><br/><p>In other words, gathering the information was done. From now on, it was the real performance.</p><br/><p>『Karion-san, please move back and refine your aura-ssu!</p><br/><p>I request one big shot-ssu, on my signal!』</p><br/><p>『But, I’m already out of energy.</p><br/><p>Unfortunately, I can’t shoot anymore……』</p><br/><p>『What are you saying! You still have『Dragon Body』don’t you-ssu?</p><br/><p>With that, please pour all your magic power in that one shot–ssu!』</p><br/><p>Karion steels himself.</p><br/><p>It’s his trump card, but it will not mean anything if he didn’t use it.</p><br/><p>If not right now, then when will he use it?</p><br/><p>『Understood. I will use it, but it only has a 10 minute duration, is that good?』</p><br/><p>『Ehh!? Wasn’t it 3 minutes before-ssu!? As expected from you-ssu!</p><br/><p>But, I intend to end this battle with a huge one.</p><br/><p>Don’t worry about what happens later, let’s go with a bang-ssu!』</p><br/><p>Gobuta, cheery to the end, said it with a carefree tone like he wasn’t worried about anything at all.</p><br/><p>Karion can’t help but smile wryly to Gobuta’s cheerfulness, which blew away even his worries.</p><br/><p>『Gotcha. I’ll leave it to you!!』</p><br/><p>The conversation ended with Karion’s reply as the last.</p><br/><p>And with Vega, who became serious, Gobuta’s true battle has begun.</p><br/><p>A Vega who became serious, was strong.</p><br/><p>「Guhaahhahahaha!!</p><br/><p>For yours truly to play seriously, you should feel honored!」</p><br/><p>「Ehhh, that’s my line-ssu!!」</p><br/><p>Both of them clashed.</p><br/><p>With just that, they made the surroundings’ air vibrate and made explosions occur.</p><br/><p>It’s a clash of pure energy</p><br/><p>It was an exchange of supernatural powers beyond Karion’s imagination.</p><br/><p>Ultimate Skill『Evil Dragon Lord Azi Dahaka』 possessed the ability to manipulate organic matter.</p><br/><p>He constitutes his body with an aggregation of very small bacteria. Thus, he can freely regenerate himself.</p><br/><p>Even acquiring new abilities by predation thanks to imitating the structure of his prey, this he can freely use too.</p><br/><p>He was an existence that should be called an Imitation Slime (Pseudo-Artificial man-made Slime) which Yuuki created.</p><br/><p>He had taken the characteristic of various creatures and added improvements to the original, allowing him to use it efficiently.</p><br/><p>What he let out on the surface was only a small part of him which transformed into a humanoid form, while his main body stays hidden.</p><br/><p>In other words, beyond what’s standing on the surface, everything is connected to the ground, so it’s possible to replenish himself without limit.</p><br/><p>And, not only his detached kin whom he give a simple order like the evil dragon beasts from before, he can create several clones of himself.</p><br/><p>His clones have all of his abilities.</p><br/><p>But, because there’s a limit to his ability to control a person, they have the weakness that they can’t perform a complicated action even if he commanded them at the same time.</p><br/><p>Vega knew this well, so he was only using the ability to regenerate himself and stopped making evil dragon beasts which could only take simple orders.</p><br/><p>However, this usage of the ability didn’t make use of the true capabilities of『Evil Dragon Beast Azi Dahaka』.</p><br/><p>Ultimate Skill『Evil Dragon Beast Azi Dahaka』</p><br/><p> …Thought Acceleration, Parallel Thought, Organic Matter Control</p><br/><p> Duplication Mass Produce, Ability Absorption, Space Control, Multidimensional Barrier.</p><br/><p>Those are the full contents of this ability.</p><br/><p>A dreadful ability, with very high performance .</p><br/><p>It was an ability that could be strengthened to the utmost if someone could master it.</p><br/><p>If someone could master it……</p><br/><p>Unfortunately Vega didn’t have many experiences after he was born.</p><br/><p>He grew up at a dreadful speed and his capability rose, but he didn’t get to master his abilities.</p><br/><p>If he was able to master Parallel Thought, he might be able to control two or more main bodies, even if there was a restriction of standing on the surface.</p><br/><p>Such threat would be unimaginable, but that was just an assumption.</p><br/><p>In the reality, Vega couldn’t master it.</p><br/><p>And so, Gobuta saw it through accurately.</p><br/><p>He used his own body as a decoy, making Vega careless, and succeed in landing several strikes on Vega.</p><br/><p>Knowing the ability of the enemy when fighting with full power; will directly connect to a life or death situation.</p><br/><p>Gobuta had been taught that he should use his trump card only after he’s finished analyzing the enemy’s power as much as possible.</p><br/><p>―― The combat experience of the absolute master who Gobuta respected, the Great Demon Lord Rimuru, was the proof for this.</p><br/><p>As the most senior subordinate, Gobuta always witnessed Rimuru’s fights.</p><br/><p>It was carved in his heart, that what was most important, above anything else, was information.</p><br/><p>Therefore――</p><br/><p>With Karion’s cooperation, He judged that he had gathered enough information.</p><br/><p>With Vega’s characteristics, which were informed by Rimuru, and the sensation that he felt when he fought him before.</p><br/><p>The answer went out naturally as he compared and matched the details.</p><br/><p>The memory and ego seem to transferred to the main body even if the part seen on the surface was erased. His regeneration is near infinite as long as he’s connected with the ground.</p><br/><p>But when the temporary main body disappears and disconnected with the ground, there was some time lag that occurred during the memory and consciousness transfer.</p><br/><p>In other words, Vega’s true main body is in the ground. No, he thought that there’s a possibility that Vega would not be able to transfer the memory and consciousness if he vanishes at a place separated from the ground.</p><br/><p>(What a troublesome opponent-ssu. Even so, he’s not invincible-ssu!)</p><br/><p>He finished analyzing most of the enemy’s abilities, Gobuta was convinced of victory.</p><br/><p>「Then, I’m going-ssu!!」</p><br/><p>He spoke to encourage himself and Ranga, so Gobuta went full power combat mode.</p><br/><p>Vega admired the high fighting power of Gobuta.</p><br/><p>Much like when he guessed before that this goblin was not an ordinary one, Vega trembled with joy.</p><br/><p>Vega was defeated overwhelmingly in a contest of speed.</p><br/><p>The power is on par with him, no, it seems to surpass him slightly.</p><br/><p>But, Vega was still able to continue thanks to his marvelous recovery power.</p><br/><p>He steadily amplifies his power. If he could steal his enemies abilities, his power would rise sharply in an instant.</p><br/><p>Therefore, the stronger the enemy is, the stronger he can be.</p><br/><p>He was convinced that the Ultimate Skill『Evil Dragon Lord Azi Dahaka』that he obtained was certainly the ultimate invincible ability.</p><br/><p>「Guhaahahahahaha!! You’re pretty good. As expected from the man recognized by yours truly!」</p><br/><p>Gobuta ignored Vega’s praises.</p><br/><p>(Ranga-san, be ready for it soon, please your help-ssu!)</p><br/><p>(Kukukku. Very well, I understand!)</p><br/><p>That is because it’s almost over.</p><br/><p>Vega got cocky before he himself recognized the real threat, he now understood that he needed to fight seriously.</p><br/><p>And he was correct.</p><br/><p>「Vega-san, unfortunately-ssu, it’s my victory-ssu!」</p><br/><p>「As if, for a goblin, no I admit that you’re strong and I can’t think of you as a goblin.</p><br/><p>But, yours truly is still the strongest, you still have a long way to go――」</p><br/><p>「Is that so-ssu? Then, is it okay for those to be your last words-ssu?</p><br/><p>Oh yeah, I will correct you once again Vega-san before you die-ssu, I’m a Hobgoblin you know-ssu!」</p><br/><p>「――what!?」</p><br/><p>Gobuta and Vega locked onto each other.</p><br/><p>Vega’s bacteria began its corrosion effect attack and preyed on Gobuta, but all of it was blocked by the Demon Wind Barrier of Ranga which clad Gobuta’s body.</p><br/><p>The magic power of the wind has deadly corrosion and decaying effects which destroyed Vega’s bacteria.</p><br/><p>Gobuta declared the end to Vega who was irritated he couldn’t eat him.</p><br/><p>Immediately after that, Gobuta and Vega soared up into the sky due to the wind’s power.</p><br/><p>All the corpses and vegetations on the ground were rolled up to the sky.</p><br/><p>It’s the effect of Ranga’s power which allow him to freely manipulate the atmosphere. The ground became a cleared surface due to the corrosion effect of the wind, all of the germs crawling on the ground and all of organic matter were ejected to the sky.</p><br/><p>「Yo, you! It, it can’t be, yours truly’s ability is――!?」</p><br/><p>「Ohhh, seeing you panic so much, did I hit the bull’s-eye-ssu?」</p><br/><p>“Death Heralding Wind” included both “Storm of Destruction” and “Lightning of Destruction”.</p><br/><p>「Guoooooooo!! Damn you, stop it!! Stop it right now!!」</p><br/><p>Vega shouts, but Gobuta didn’t stop.</p><br/><p>Because he has no reason to stop.</p><br/><p>「It’s a joke, I only gathering Vega-san’s existence-ssu!」</p><br/><p>He lightly gathered up all of organic matter into a big sphere.</p><br/><p>A huge black storm sphere is completed, and Vega who is inside is being shredded to small pieces by the blades of wind and by the small thunder balls made of lightning.</p><br/><p>He was gave in to flow of the winds.</p><br/><p>「Karion-san, are you ready-ssu?」</p><br/><p>「Yes, sorry for the wait!『Dragon Body』!!」</p><br/><p>At Gobuta’s signal, Karion activated his ability.</p><br/><p>And,</p><br/><p>「I only need to shoot a huge one at that sphere right?」</p><br/><p>「That’s right-ssu, please-ssu!!」</p><br/><p>Karion noded.</p><br/><p>For the perfect setting, a smile appeared on his lips.</p><br/><p>(As expected from Gobuta. I’m really glad that he’s an ally.)</p><br/><p>And he poured all of the magic power he refined into his Byakko-Seiryuu Lance.</p><br/><p>Then, imagining the figure of his master, Milim.</p><br/><p>Her overwhelming destructive power which destroyed the sacred mountain of the Beast Kingdom “Yuurazania”, his homeland, that――</p><br/><p>「Stop it, you damn insects!! Stop――」</p><br/><p>「Here I go! Eat this!! Dragon Roar!!」</p><br/><p>A massive flash of light pierces the black storm ball which Gobuta controls.</p><br/><p>The destructive energy is devastating.</p><br/><p>It was an ultimate secret technique that Karion invented while thinking of mimicking Milim’s Dragon Nova.</p><br/><p>The direct hit of the Dragon Roar set off the small thunder balls inside the black storm sphere with a chain reaction of explosions.</p><br/><p>And then, it became one huge explosion sphere.</p><br/><p>The super-high temperature of the discharged plasma burnt all of Vega’s bacteria into nothing.</p><br/><p>Only a vast empty land remained later.</p><br/><p>It was a landslide victory thanks to the combined technique of Gobuta &amp; Karion.</p><br/><p> −−−−−−−−−−−−−−−−−−−−−−−−−−</p><br/><p>Faraway, where the black storm ball explosion could barely be seen, a person slowly begins to get up.</p><br/><p>That person is the Vega who should have been destroyed just now.</p><br/><p>「That was dangerous, really dangerous……</p><br/><p>But, in the end it’s my victory.</p><br/><p>Yours truly still can be stronger. As long as there’s『Evil Dragon Lord Azi Dahaka』, I’m invincible!!」</p><br/><p>Vega smiled with a broad grin and laughed.</p><br/><p>While thinking that it was the right decision to have left a clone as an insurance.</p><br/><p>It was possible for him to transfer his memory and consciousness at the last second to the clone he had left behind.</p><br/><p>He hasn’t been able to master his ability yet, but there’s no doubt that he will become the strongest existence when he finally masters his ability.</p><br/><p>That’s right, he believes that even the “Stellar Dragon King” Veldanava would kneel on his feet soon.</p><br/><p>「You seemed to enjoy yourself―――― I found you.</p><br/><p>It’s as what Rimuru-sama had said.</p><br/><p>He thought that a coward like you would surely do this.」</p><br/><p>Vega didn’t doubt his evolution or his being the strongest, until he heard a cold voice from behind.</p><br/><p>But reality wouldn’t permit him that.</p><br/><p>Vega begun to feel himself floating.</p><br/><p>It’s too late, when he finally noticed he was up in the air far from the ground.</p><br/><p>Vega was already trapped and isolated from the surrounding ground by a huge barrier.</p><br/><p>「Die, you lowlife!! “Abyss Annihilation”!!」</p><br/><p>Exceeding the explosion from before, the energy of destruction trampled upon the inside of the barrier.</p><br/><p>「――Gyaa, pulisuhu shopu――――――」</p><br/><p>This honest plead for mercy, the first time in his life Vega had let out, didn’t reach Carrera.</p><br/><p>As if she had heard something filthy from a lowlife, Carrera annihilated everything without mercy.</p><br/><p>Like this, Vega, one of the Four Fiends of the Heaven Commanders, received his complete “death”.</p><br/><p>[1] I’ll go with Beastification for it.</p><br/><p>[2] Well, Ranga is a Demon Lord after all XD</p><br/>\n</div>"}