{"title": "Chapter 199 – Rimuru Disappearance[1]", "id": 199, "volume": 2, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-199-%E2%80%93-rimuru-disappearance1", "volume_title": "Volume 2", "body": "<h1>Chapter 199 – Rimuru Disappearance[1]</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Rimuru Disappearance[1]</p><br/><p>After leaving Diablo and Co. behind, I blitzed towards where Milim was.</p><br/><p>Milim's furious attacks, rained down upon the silver haired angel.</p><br/><p>Each and every one of those attacks were deflected away by the shield of \"Castle Guard\".</p><br/><p>Thinking back, when Rudra used the ability, I don't seem to recall it being able to deflect or reflect attacks....</p><br/><p>《It is possible that the ability was originally meant to be a \"commander\" type skill.</p><br/><p>As it was a skill used by someone who didn't need to directly attack, there was no need for that effects.</p><br/><p>Chances are, alterations are being made to the skill by that person.</p><br/><p>Making changes as required by the situation, you could think of it as something more \"flexible\" now.》</p><br/><p>(Hmm? You mean, she has an ability that’s similar to yours?)</p><br/><p>《――mmm.</p><br/><p>Though there's no way to say for sure, the possibility that it may be an evolved skill cannot be denied either.》</p><br/><p>Fumu.</p><br/><p>If it really is an evolved skill then this isn't all too unbelievable.</p><br/><p>But if that's the case, the silver haired angel would be the avatar of 『Justice King Michael』's ego.</p><br/><p>If Rudra losing control really was caused by intervention from Justice King Michael, this might not be impossible after all.</p><br/><p>The problem now, would be how capable it is.</p><br/><p>If it had calculation power and freedom that is on par with Ciel, it would make for a pretty nasty opponent to deal with.</p><br/><p>(What do you think? Is it an existence on the same level as you?)</p><br/><p>《Fu. As if.》</p><br/><p>Woah!?</p><br/><p>Did Ciel-sensei just totally deny that statement?</p><br/><p>Plus, that haughtiness. Makes me wonder where she learned how to show such expressions.</p><br/><p>Also she seems to be somehow giving off an air of belittling the opposition. It kinda feels like the aura of some bigshot.</p><br/><p>Somehow, that feels mighty reassuring.</p><br/><p>Well, I understood what Ciel was trying to say. \"Don't lump me in together with 'that'!\" would be it.</p><br/><p>(Does that mean, you know how to neutralize opponents that have \"Castle Guard\"?)</p><br/><p>I tried probing without expectations,</p><br/><p>《Of course. Regarding that, I have put together a plan.》</p><br/><p>She nonchalantly replies, quite matter of factly.</p><br/><p>I had no words for how amazing she is.</p><br/><p>Could it be, that I'm actually kinda unneeded? Though such thoughts ran through the back of my head, that is definitely not the case.</p><br/><p>This is where I need to protect my dignity, and humbly accept the facts.</p><br/><p>(I wouldn't expect any less. I believed! Always believed you'd easily crack this \"Castle Guard\" problem!)</p><br/><p>Regardless of what I \"believed\", this was an ability that Velda would have had anyway, which we would be able to overcome by eliminating Velda's underlings. That was what I thought anyway.... At this point, it's not much of an issue now.</p><br/><p>Since we can neutralize her, it's a good idea to quickly restrain that silver haired angel.</p><br/><p>Trusting Ciel, I went ahead and landed right in front of the silver haired angel, a.k.a Lucia.</p><br/><p>At the moment I stood before her, she turned her attention to me.</p><br/><p>Showing perfect composure, even while she's being attacked by Milim.</p><br/><p>「My my, if it isn't demon lord Rimuru. I have been notified of your existence.</p><br/><p>The fool who dares oppose Velda-sama.</p><br/><p>Also, the nuisance of a demon lord, who dares to get in my way.」</p><br/><p>「Hmm? That's an honour. Now then, just what are you?</p><br/><p>An angel, or.... Justice King Michael's ego?」</p><br/><p>It was fine if she didn't answer, I only asked as a \"formality\" of sorts.</p><br/><p>It was on the level of getting some information, depending on how she reacts.</p><br/><p>「Seems like a self introduction would be proper.</p><br/><p>I, I am the one who has been bestowed the name \"Lucia\" from Velda-sama.</p><br/><p>As you have guessed, I was borne from Ultimate Skill『Justice King Michael』.</p><br/><p>Perhaps you would understand if I were to call myself \"Manas\"....</p><br/><p>Let's just say, an ultimate existence of sorts.」</p><br/><p>She showed a mysterious smile from her beautiful face, as she said her piece.</p><br/><p>So the silver haired angel's identity, is Manas: Lucia.</p><br/><p>But Manas, huh....</p><br/><p>I was honestly surprised, that Manas other than Ciel-sensei were born.</p><br/><p>《This is unpleasant. So this is the emotion of \"displeasure\".》</p><br/><p>Ciel mumbled, seemingly in a bad mood.</p><br/><p>Maybe she is feeling unhappy about the fact that there is another existence which could possibly be equal to herself.</p><br/><p>But looking at her, she's really starting to understand how emotions work now. I guess this is something amazing, but I don't really get the point.</p><br/><p>Well, there's no doubt it would be pretty amusing to have a conversation with her now.</p><br/><p>Just as I was thinking that,</p><br/><p>《How dare she look down on Master, that lowly Manas!》</p><br/><p>That's what you're concerned about!?</p><br/><p>I almost took a jab at her out of reflex there.</p><br/><p>Also, \"that lowly Manas\", aren't you one yourself!?</p><br/><p>She seems to be ignoring that fact, and feels like she has passed the point of being displeased to being fairly pissed, at Lucia.</p><br/><p>「Lucia, huh. So, what are you up to?</p><br/><p>Are you enraging Milim, so as to dominate her?」</p><br/><p>「Fufufu, so you have the minimal ability to understand that much.</p><br/><p>That is exactly it. Milim-sama, is the great Velda-sama's daughter.</p><br/><p>After the destruction of the world with her \"cooperation\", she is the being most suited to become the \"Mother of the New World\"!</p><br/><p>For that purpose, her trifle memories are unneeded.</p><br/><p>Those filthy memories of this world, should be returned to nothingness.</p><br/><p>And you, are the greatest representative of this \"filth\". An existence that should be cleansed.</p><br/><p>I should give you credit though, for noticing what was happening here.</p><br/><p>But, it is already too late.</p><br/><p>――this should be about enough now.</p><br/><p>Time for you to perish, vile demon lord.</p><br/><p>Destroy that demon lord, Milim-sama! Regalia Dominion!!」</p><br/><p>Fumu.</p><br/><p>So that, really was what they were aiming for. Just as predicted by Ciel.</p><br/><p>Milim, who was clobbering Lucia's \"Castle Guard\" with fists enchanted with unreal amounts of magic, took a direct hit from \"King's Rule\" and froze in place.</p><br/><p>――or so that's what it looked like.</p><br/><p>(Hey, isn't that just an act?)</p><br/><p>《No doubts about that. From what has been analyzed earlier, Milim・Nava is still in total control of her emotions.》</p><br/><p>Though it looks pretty realistic, it's kinda obvious that it's all an act.</p><br/><p>She looked pretty happy when she saw me too, she also removed the Dragon Knuckles that I gave her as a present, so as not to damage them....</p><br/><p>The best evidence, would be that if she really has lost her sanity, she'd attack us too without provocation, which hasn't happened at all.</p><br/><p>On that point, she's a really bad actor.</p><br/><p>Though she seems really confident that she hasn't been found out, that's still pretty naive for her.</p><br/><p>But, this is where I should play along with her ploy.</p><br/><p>「Ge, geh!! Milim just got dominated!!」</p><br/><p>《....that, is just too exaggerated, Master――》</p><br/><p>I got penalized by Ciel for that.</p><br/><p>Seems like I'm not much of a better actor myself.</p><br/><p>Seeing as I was going to have to deal with someone who had inherited Justice King Michael's abilities anyway, I went ahead and prepared some measures against domination type abilities beforehand.</p><br/><p>Which naturally, has been disseminated to not just Milim, but all of the other demon lords as well.</p><br/><p>This is pretty obvious already, as this ain't a game of chess we're playing here, having our fallen allies become enemies is really annoying to deal with.</p><br/><p>As a countermeasure, I went and got Guy to teach us the『Mind Power』technique.</p><br/><p>What this『Mind Power』does, is that it simply lets us awakened demon lord class beings resist abilities such as \"King's Rule\" as long as the being in question isn't under heavy pressure; this even has Ciel's seal of approval.</p><br/><p>This technique has an almost equal level of performance as Ciel's “Mind Protect”.</p><br/><p>That was why, if it was under normal circumstances there wouldn't even be a need to worry.... But if Milim really did lose her sanity, things would obviously be different.</p><br/><p>Here I was expecting the worst and hurried over.</p><br/><p>Only to be needlessly worrying myself.</p><br/><p>It seems like Milim has a plan of some sort, and I’ve no need to worry that she's going to fall under the control of \"King's Rule\".</p><br/><p>I'll listen to what she is planning to do later, time to decide how to deal with Lucia.</p><br/><p>Ciel did say she has a plan to get around that \"Castle Guard\", seems like things will end without too much trouble.</p><br/><p>Those were my intentions when I began \"hostilities\" with Milim....</p><br/><p>But that Milim, came at me for real. As I could see she was grinning, I knew that she was doing this purposefully.</p><br/><p>She may have wanted to fight me for real.</p><br/><p>How \"troublesome\" this has become.</p><br/><p>Milim drew her sword, and began her assault unto me, I too drew my katana and received her attack.</p><br/><p>Sparks flew as we furiously exchanged blows. I couldn't even see her movements in the past, so I was honestly surprised with myself now that I have breathing space.</p><br/><p>If it was the old me, I would have been left numb from just receiving a single attack, which would have also greatly drained my stamina.</p><br/><p>Now there was no difference in the level of our weapons, and I have simply powered up physically. As expected of a body that is similar to that of a \"True Dragon\".</p><br/><p>I have now become able to battle evenly, even against Milim's absurdly violent strength.</p><br/><p>For a bystander looking at us, our furious exchanges would look as though we are going at it seriously.</p><br/><p>But, I could tell.</p><br/><p>That even Milim hasn't put in any real effort, not yet.</p><br/><p>Just as I have one, Milim too, has what you would call a \"Magic Generator\" that can be used as a Status Booster.</p><br/><p>For me, it would be the void energies of『Void God Azathoth』's “Turn Null”. Said energy would be regulated from within the void space, it is then possible to \"inject\" that energy into my body.</p><br/><p>As my body is mostly made up of Magic Essence, that means I would power up if there was more Energy.</p><br/><p>It works similarly for Milim.</p><br/><p>Having reached a similar level, I now felt like I could understand the secrets to what was previously seen as unreasonable.</p><br/><p>Well that should be the gist of it, and as we were battling it out with our techniques....</p><br/><p>『Are we connected now, I wonder.... Hey Rimuru, can you hear me?』</p><br/><p>I received a telepathic message suddenly.</p><br/><p>Seems like, Milim has been trying to establish a “Secret Telepathy” connection with me, all while still in combat with me.</p><br/><p>That is another form of telepathic communication, as Milim wasn't connected to me via the \"Soul Corridor\", she needed to \"run a line through\" so to speak, if she wanted to use it.</p><br/><p>It was also possible with the normal directional telepathic messaging, but the danger of the message being heard by unwanted third parties would increase.</p><br/><p>To summarize, if you wanted to make use of “Secret Telepathy”, it would take some time and preparation.</p><br/><p>It seems like Milim has been pretty cautious for awhile now, so as not to let her movements be picked up by our enemies.</p><br/><p>This is all still under the pretext that she was dominated, and also still very enraged.</p><br/><p>『Yep I can hear you. So how long should I keep up with this act of yours?』</p><br/><p>『Wahahahaha! As expected of Rimuru, so you noticed.</p><br/><p>When you went「Ge,geh!! Milim just got dominated!!」just now, I got real worried that you actually thought I was dominated you know!』</p><br/><p>Ouu....</p><br/><p>That exaggerated reaction of mine was taken for real it seems.</p><br/><p>Looks like I really underestimated how simple Milim is.</p><br/><p>『That ain't it! Wasn't it really obvious, and very purposeful!?』</p><br/><p>『Eh!? Ah, right. That's right, I totally noticed that yea!</p><br/><p>――anyways, enough of that.</p><br/><p>Back to business, I got a favor to ask. Frey and her underlings went and got beaten by Lucia's flunkies earlier.</p><br/><p>Though I don't think it's anything worrying, can you go tend to them? 』</p><br/><p>『Nn? Got it.』</p><br/><p>And Milim tried to cover up her \"blunder\".</p><br/><p>I overlooked that with my magnanimous heart.</p><br/><p>So, before I arrived, Frey and some guards were defeated. Maybe Milim used that as her \"reason\" for getting enraged.</p><br/><p>They probably aren't as injured as Milim made them out to be, as she had already said.</p><br/><p>(Diablo, can you hear me?)</p><br/><p>(Yes, Rimuru-sama.)</p><br/><p>(Before supporting me, go tend to Frey and co.'s wounds.)</p><br/><p>(Then, I shall delegate the task to Testa and the others.</p><br/><p>As of now, I have just received the message that the 4 other angels have been dealt with.)</p><br/><p>Eh, already? That's way too fast!</p><br/><p>Aren't those 4 angels, on par with awakened demon lords....</p><br/><p>More like, it's somewhat troubling that I could only think of the awakened demon lord class as a comparison. As I am now, any single awakened demon lord isn't even a threat.</p><br/><p>This might just be what Veldora-san's point of view is like. This almost justifies him letting it get to his head, going around picking fights with any other being.</p><br/><p>Not like I would go around doing something as childish as that, neither do I need to.</p><br/><p>(Is that so, I'll leave that to you then. So, are you heading to my position then?</p><br/><p>(Yes. I am by your side, while totally hiding my presence!)</p><br/><p>(Alright then, standby as you are for now. Don't be letting that angel Lucia sense your presence.)</p><br/><p>(Of course!)</p><br/><p>Fumu.</p><br/><p>Now that I think about it. Seems like Ciel has noticed his presence, but I don't notice him if I don't concentrate on him.</p><br/><p>Guess I should have Diablo standby in case something actually happens.</p><br/><p>『Looks like there aren't any problems. I got a report from one of my underlings.』</p><br/><p>『Is that so, thanks!』</p><br/><p>I gave Milim a reply.</p><br/><p>A report from Testa came in, stating Frey and co. are all fine.</p><br/><p>As I was communicating with Milim, we were exchanging blows at the same time.</p><br/><p>Though it was an exchange between a sword and a katana, we were flying around and really shifting the ground around us. As we were moving around with quite a bit of force, to onlookers it was really flashy.</p><br/><p>And towards me, Lucia has been launching magic attacks every so often.</p><br/><p>It's obvious she can attack, during the short pauses when \"Castle Guard\" isn't in use.</p><br/><p>Would I be able to make a move on her if I manage to work out the timing?</p><br/><p>《Unfortunately, as it works automatically, my prediction would be that the defenses would be prioritized.》</p><br/><p>That much was obvious huh.</p><br/><p>On that point, she's making more efficient use of the ability than Rudra did.</p><br/><p>She's the Manas borne from the actual skill anyway, this much should be nothing for her.</p><br/><p>What a troublesome opponent to deal with.</p><br/><p>『That angel, she's getting annoying. But, I kinda want to earn her trust somehow.』</p><br/><p>『Hah? Why would you need that? She *is* troublesome, but her attacks are being blocked, which is why we're ignoring her right?』</p><br/><p>『You know....</p><br/><p>She spouted some \"Velda is my father, \"Stellar Dragon King\" Veldanava\".</p><br/><p>I was thinking, I need to dole out some punishment for her insolence.』</p><br/><p>Here I was thinking she wanted to get Lucia to lower her guard as she had no means of beating her as is, instead she was thinking of something else altogether.</p><br/><p>After hearing the details, she intends to work out the unknown location of our enemy, and defeating \"him\" instead.</p><br/><p>It's true, that in this great war, there isn't much meaning even if we manage to be victorious on all fronts. We still needed to deal with the root of the problem which is Velda.</p><br/><p>Even if we did defeat the Four Fiends of the Heaven Commanders and get the strategic victory, it's still defeat for us if Velda manages to get away.</p><br/><p>『I get your point, your aim is to earn Lucia's trust, so you can travel to where Velda is.』</p><br/><p>That makes much more sense now.</p><br/><p>This was a logical plan, the type that you would expect from Milim. This was why she isn't one to be underestimated.</p><br/><p>《There is only one problem with your plan. As we have no idea how powerful Velda is, your safety isn't guaranteed.》</p><br/><p>That, was my only concern.</p><br/><p>Although Milim is one of the most powerful among us Demon Lords, isn't it still too dangerous for her to head into the heart of enemy territory alone?</p><br/><p>『Wahahahaha! Fret not. You can leave it to me to pinpoint the location.</p><br/><p>In other words. I'm gonna be a Spy!</p><br/><p>I have studied, just for a moment like this! Stop worrying!』</p><br/><p>Ahh, thinking back a little, she *was* watching a movie that was somewhat relevant....</p><br/><p>It was part of an experiment to crystallize the footage from my memories into a \"film\"; it was that movie from my memories, the one we extracted then.</p><br/><p>Milim was among them, the ones whose eyes were sparkling, which were also glued to the screen watching the story that was filled with riveting spy action[2].</p><br/><p>Ahh, she ended up picking up some fairly unneeded knowledge.</p><br/><p>But, if you think about it, this is an unexpectedly good plan for our current situation.</p><br/><p>It's best to discuss the itty bitty details, and decide on our course of action.</p><br/><p>But, before that....</p><br/><p>(Ciel, *that* is getting annoying, I want to disable Lucia first.)</p><br/><p>《Understood. Then――》</p><br/><p>As per Ciel's explanation, I pieced together the relevant abilities in my head.</p><br/><p>And then,</p><br/><p>「You've been getting really annoying since earlier on, time for you to learn who's in charge here!!」</p><br/><p>I intimidated Lucia with something suitable.</p><br/><p>Reading the situation, Milim also faked being blown away by a swing from my katana, and entered a state of not getting in my way.</p><br/><p>She's doing great there.</p><br/><p>Looking down upon Lucia, I thrust my right hand forward.</p><br/><p>There was actually no need for this movement, but theatrics are still important.</p><br/><p>「Fufufu. You won't be able to penetrate my defenses no matter what you do.</p><br/><p>This is where the true worth of \"Castle Guard\" really lies.」</p><br/><p>「Is that so. But, let's see if you can still say the same after receiving this.」</p><br/><p>After saying that, I began channeling『Void God Azothoth』's “Turn Null” energies onto my right hand, and maintaining control of it.</p><br/><p>This was a lot harder to control that what I previously thought it would be.</p><br/><p>This stuff, would cause a massive explosion if i were to release it as it is. This ain't the kind of stuff that's practically usable without Ciel's support.</p><br/><p>After seeing the ultra compressed energy mass, there was an obvious change in expression even for Lucia.</p><br/><p>Even if she would be unharmed, there was no doubt the remainder of the angels army would get annihilated though.</p><br/><p>「You fiend, it's pointless for you to do that!!</p><br/><p>Even if you were to turn the surroundings into a wasteland, it won't accomplish anything――」</p><br/><p>「Silence, I get to decide if there's a point in doing this.</p><br/><p>Now are you done with your prayers before the afterlife? Bye! Offensive Barrier \"Eternal Pain\"!!」</p><br/><p>With the channeled energies, I activated a certain spell combination, shutting the screaming Lucia up.</p><br/><p>As experimented from before, activating magic using this energy instead of the normal elemental magic results in multiple times the usual resulting output.</p><br/><p>Such a spell, constructed using the ridiculous output of the ‘Turn Null’ energies, headed towards Lucia.</p><br/><p>As she had utter confidence in her defenses, this was a major blunder for her.</p><br/><p>The spell successfully made contact with Lucia, without any resistance.</p><br/><p>Obviously, explosions or other direct forms of damage would not cause even a scratch whatsoever on Lucia.</p><br/><p>But.... There was no need to cause damage to Lucia in the first place.</p><br/><p>As per Ciel, this is what you would call \"a change of perspective\".</p><br/><p>《There are no doubts that ANY kind of attack would have absolutely no effect.</p><br/><p>That ability activates an \"Impregnable\" effect.</p><br/><p>No matter what kind of attack it is, all known effects that cause \"damage\" would be shut out.</p><br/><p>Which means――》</p><br/><p>Simply, be it a nuke or poison, regardless of the damage it would inflict, all of that stuff would be blocked.</p><br/><p>Even if I made use of『Void God Azothoth』and launched a high output attack, even if it was an attack that could destroy the stars, Lucia would survive in the end.</p><br/><p>She would survive even if she was in outer space.</p><br/><p>Well, that's also including the fact that she doesn't need to eat or breath as she is an angel which is a spiritual entity, such logic wouldn't work for Rudra who is human.</p><br/><p>To sum it up, the fact is, there are no real means to \"defeat\" her as of now.</p><br/><p>But, that doesn't mean there are no loopholes.</p><br/><p>\"Castle Guard\", with its highly reflexive nature, limits the user's actions while active; this can be seen as a demerit of the ability.</p><br/><p>For example, \"Castle Guard\" would activate and defend its user from say a sneak attack when the user is attacking something else, the user's own attack would get cancelled as well during that instance.</p><br/><p>To sum it up, \"Castle Guard\" gets full priority.</p><br/><p>So much to the point, that it puts a restriction on even simple movement.</p><br/><p>Rudra, was totally restricted on movement when \"Castle Guard\" was active. But as expected of Lucia, she is capable of walking and simple flight, but that was the limit for her.</p><br/><p>So I made use of that property.</p><br/><p>I surrounded Lucia, with an offensive barrier that when triggered will constantly attack, limited to within a fixed space.</p><br/><p>With my \"Space Time Control\" ability, fixing the coordinates for the barrier was a piece of cake.</p><br/><p>So what happens? When you apply an offensive trigger, within a barrier?</p><br/><p>The answer is simple.</p><br/><p>Lucia would be restricted where she is, with \"Castle Guard\" constantly active.</p><br/><p>And the space around the barrier is locked as an extra effect, so her movement is also effectively restrained.</p><br/><p>With the space time properties added in, the effects would be sustained for a few hundred years. For such a simple barrier, the effects were pretty broken.</p><br/><p>Well, a fair amount of energy was poured into the spell.</p><br/><p>For me or Veldora, it would be possible to break through such a barrier with brute force if we don't mind taking some damage, but for someone who has \"Castle Guard\" forcefully activated constantly, this becomes a different story.</p><br/><p>Lucia too understands, that if she were to deactivate \"Castle Guard\", she would no doubt take a concentrated barrage of damage for doing so.</p><br/><p>The plan to totally restrain her has succeeded.</p><br/><p>It is unknown if she is able to deactivate \"Castle Guard\" manually or not, but in the event she does deactivate it and break through the offensive barrier \"Eternal Pain\", I only need to hit her with another even more powerful one.</p><br/><p>In terms of determining Lucia's capabilities, this \"attack\" of mine was an effective one.</p><br/><p>Anyway, it looks like Lucia is unable to break out of the offensive barrier \"Eternal Pain\".</p><br/><p>「Fuh! You shall twiddle your thumbs in there alone and in despair, for an eternity!」</p><br/><p>I said that, as I struck a cool finishing pose.</p><br/><p>That was perfect.</p><br/><p>Lucia was screaming something in anger.</p><br/><p>But, as she was impeded by the barrier, her voice failed to reach me. My voice too doesn't reach Lucia, so taking advantage of that I taunted her with my pose.</p><br/><p>Offensive barrier \"Eternal Pain\", was a spherical shaped growth enchanted barrier. What that means, is that whenever Lucia's \"Castle Guard\" makes contact with the barrier, small explosions would occur; the energy generated from the explosions is then re-absorbed into the barrier, and is used for the growth of the barrier to increase its strength.</p><br/><p>This was well thought out, a fearsome combination of nasty properties.</p><br/><p>Hats off to Ciel there.</p><br/><p>《Magnificent! Especially that pose at the end, it was perfect!》</p><br/><p>Eh, that part?</p><br/><p>Ciel showed no interest in the effects of the barrier or the results, as though they were invisible to her eyes.</p><br/><p>And instead, reacted to my taunting pose, showering it with praise.</p><br/><p>(Kufufufufu. I expected no less from Rimuru-sama!)</p><br/><p>I felt Diablo's praises too telepathically, and he too, had no negative feedback about me.</p><br/><p>Though I kinda wanted to be praised for succeeding in activating the spell that Ciel came up with on my first attempt, Ciel notwithstanding, getting praises from Diablo felt a little off too.</p><br/><p>It felt like, getting elated from getting praise from someone who is usually very strict, that kind of feeling.</p><br/><p>Well, now isn't the time to think of such luxuries. It's not like I know of any such beings who are close to me.</p><br/><p>I should be happy for now, that nobody made jabs at me for the 8th grader syndrome-ish pose that I did.</p><br/><p>I discreetly, breathed an empty sigh of relief.</p><br/><p>So that was how, I succeeded in handily restraining Lucia.</p><br/><p>Shortly after, with the addition of Diablo, Milim and the two of us started our discussions.</p><br/><p>And of course, that was done while we were still in combat. That was done pretty damned skillfully if I were to say so myself.</p><br/><p>While we were doing that, I received word from Carrera telepathically, reporting that Vega got his ass handed to him by Gobuta.</p><br/><p>Plus, he did it handily too.</p><br/><p>《――! As expected of Gobuta. He really showed his worth as his growth was one of the hardest to predict.</p><br/><p>Though I did give him the Unique Skill『Genius(False Wiseman)』, to think he was this capable.》</p><br/><p>Ciel gave Gobuta her honest praise.</p><br/><p>I really want to question her, as to why she doesn't show such praise for me[3].</p><br/><p>And when did she give him the Unique Skill『Genius(False Wiseman)』. And yea, it's a fake[4].</p><br/><p>Gobuta and『Genius(False Wiseman)』, it's hard to tell if it actually fits him or not....</p><br/><p>Oh well, he *is* a genius of sorts.</p><br/><p>I did have a grasp on the abilities of everyone who had training of some form in the labyrinth, there were some parts that were unknown to me as Gobuta did his training in secret.</p><br/><p>Even after considering the overall limits, it was predicted that he would have a hard battle with Vega as his opponent.</p><br/><p>But then, it's quite the feat, for him to exceed Ciel's predictions as he has.</p><br/><p>Even if we assumed he managed to reach his highest potential, the prediction was that he would gain victory, but only marginally; just what is Gobuta made of....</p><br/><p>It probably *was* a tough battle. But after considering Gobuta's personality, it may have just \"looked\" like he managed to get the victory handily.</p><br/><p>I shall leave it at that.</p><br/><p>Now then, we have come to a decision.</p><br/><p>First, I would take my leave from the battlefield, with my \"defeat\".</p><br/><p>(Rimuru, first up is for you to \"disappear\"!)</p><br/><p>As per Milim's words, our plan was finalized.</p><br/><p>In other words, a plan where I \"play dead\".</p><br/><p>(Kufufufufu. This is going to cause quite the ruckus!)</p><br/><p>Diablo happily snickered.</p><br/><p>For some reason, Ciel suggested that we do not relay the information regarding my \"death\" to my remaining followers.</p><br/><p>《This is a prime opportunity, to smoke out the remaining problematic elements who are eluding us.》</p><br/><p>That was the reason.</p><br/><p>Though I don't think there would be any traitors among my comrades, this is a good opportunity to gain knowledge about the plans of the other demon lords; and according to Ciel, there is a chance of problems arising from the human countries.</p><br/><p>Be it the western countries or the empire, we have been forcefully keeping them in check.</p><br/><p>There might very well be some who hold discontent against us.</p><br/><p>Maybe it's the empire soldiers who I revived, they might cause a rebellion after knowledge of my \"death\" reaches them.</p><br/><p>(Won't this just cause greater confusion?)</p><br/><p>Diablo's earlier reaction, was the answer to my amazingly \"normal\" question.</p><br/><p>A cleansing storm would be whipped up, upon the ones who would plan to rebel.</p><br/><p>(Also, I kinda feel bad, as I'll be deceiving the others too.)</p><br/><p>I said that as I was thinking how I'll be worrying the others,</p><br/><p>(Kufufufufu. There won't be any problems. Their happiness when they find out you are alive would be far greater!)</p><br/><p>And, my pleas were declined as such.</p><br/><p>According to Milim's plan, saving Lucia after dealing with me, would get her the greatest amount of trust.</p><br/><p>In addition, it would lure Velda into lowering his guard, making him bolder and more complacent in his moves.</p><br/><p>The plan was gleefully accepted by everyone except me.</p><br/><p>And thus, a storm of great confusion would engulf the world.</p><br/><p>On just the first day of the great war, major changes among the world's factions are about to occur.</p><br/><p>[1] , Kanji used in the title can mean Disappear, Vanish, Missing, Dead, Cease to exist, Extinct, Eliminated and many others.</p><br/><p>[2] TN: They be watching some Skyfall I bet lol</p><br/><p>[3] TN: Ooh rimuru is jelly huh lol</p><br/><p>[4] GN: Rimuru so S</p><br/>\n</div>"}