{"title": "Chapter 205 – Vs Dagruel Part 1", "id": 205, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-205-%E2%80%93-vs-dagruel-part-1", "volume_title": "Volume 3", "body": "<h1>Chapter 205 – Vs Dagruel Part 1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Vs Dagruel Part 1</p><br/><p>Dagruel’s army had reached the Holy Kingdom Ruberios and kept on their march through its border.</p><br/><p>And they mowed down all of the people who blocked their path and aimed at the Holy Capital with great vigor.</p><br/><p>The Holy Capital was protected by a threefold barrier.</p><br/><p>The large-scale magic essence warding barrier blockaded the city’s outskirts.</p><br/><p>It was a barrier which obstructed the accumulation of magic essence to prevent outbreaks of monsters. However, it is naturally not invincible, just like in the present situation, there may be an outbreak of rare monsters due to the barrier’s destruction that might come to invade the city.</p><br/><p>To prevent this invasion, an anti-monster defence barrier had been installed, which protected the daily lives of the holy capital and its surroundings.</p><br/><p>As its name suggests, it was intended to prevent the invasion of monsters.</p><br/><p>It was a barrier with a strong magic essence isolation ability, but it only had influence on a certain level of monster and weaker. It didn’t affect vampires, its true masters.</p><br/><p>Its purpose was to protect the citizens of the Holy Capital from field monsters.</p><br/><p>The Holy Knights usually patrolled between the first and the second barriers. And their work included searching for tears in the barrier and restoring them.</p><br/><p>It was common knowledge that the Holy Kingdom Ruberios was protected by a twofold barrier, but the existence of the third one was only known by the high ranking people of the holy capital.</p><br/><p>The Evil Purification Barrier.</p><br/><p>It was the protection barrier of the highest level that had protected the sacred Holy Capital for a long time.</p><br/><p>It was a barrier that could be called the perfected version of the holy field, the barrier which attacks monsters with the only exception of those registered with an identification code.</p><br/><p>Everything inside the ramparts of the Holy Capital was within the scope of its influence. It was the largest-scale barrier of its level, but it still couldn’t cover the entire range.</p><br/><p>Even so, it was the strongest barrier, worthy to protect the Holy Capital.</p><br/><p>The transfer gate was established within the anti-monster invasion prevention barrier and outside the Evil Purification Barrier. The reason was because Ruminas didn’t want the subordinates of the other Demon Lords acting freely within the Holy Capital.</p><br/><p>That was a reasonable argument, because not only it was troublesome to set and register identification codes for individuals, there was no guarantee that they wouldn’t be hostile by next time.</p><br/><p>Therefore, the Evil Purification Barrier was applied to every monster with the only exception being Ruminas’ subordinates.</p><br/><p>The effect was applied even to the high ranking monsters in Shion’s entourage.</p><br/><p>Thus, Shion’s elite corps who arrived from the transfer gate organized themselves at the peripheral of the living area without entering the Holy Capital.</p><br/><p>The battlefield was outside the anti-monster invasion prevention barrier.</p><br/><p>It was the decision of the conference the night before.</p><br/><p>The barrier was ineffective against the angel army ―― or rather, the anti-monster has no meaning against the holy attributed angels ――the monster army led by Shion and Co. were suitable to oppose Dagruel.</p><br/><p>The ironic thing is that the Immortal Legion led by Aldaman, which could be considered evil itself, didn’t receive the effect due to『Holy-Demonic Inversion』.</p><br/><p>However, it would be a problem if undead came and went within the Holy Capital like they owned the place, so that’s one of the reasons why Aldaman was assigned to the interception forces.</p><br/><p>Tempest’s group will engage Dagruel, Ruminas’s group will suppress the angels.</p><br/><p>That is the plan.</p><br/><p>Immediately sensing that Dagruel’s army had destroyed the large-scale magic essence warding barrier that had stretched around the border, Shion notified the entire army.</p><br/><p>As preparations were everything, Shion had finished stationing her elite corps.</p><br/><p>The Immortal Legion which Adalman had summoned stood at the front in perfect order.</p><br/><p>With 2.000 Death Knights as the main force.</p><br/><p>The rest of the Legion’s composition was as following:</p><br/><p>100.000 Zombie Soldiers (Carrion Soldiers).</p><br/><p>20.000 Pawn Soldiers (Skeleton Soldiers).</p><br/><p>10.000 Pawn Archers (Skeleton Archers).</p><br/><p>10.000 Pawn Knights (Skeleton Knights).</p><br/><p>There were such overwhelming numbers.</p><br/><p>They were an army that had been created by Aldaman by using the corpses gathered from Great Jura Forest.</p><br/><p>They usually wandered around the floors of the labyrinth, but they all sortied this time.</p><br/><p>The 100.000 Zombie Soldiers are the monsters prepared urgently for this war. Most of them were once the soldiers of the Empire.</p><br/><p>Deployed inside the labyrinth, the ones which had their rotten flesh neatly removed were the Pawn Soldiers.</p><br/><p>Among them there might be those which were once adventurers who had died inside without buying a bracelet, but this was a rare example.</p><br/><p>In preparation for this Great War, they had gathered the corpses which had been vacated by their souls, it was quite a large number.</p><br/><p>As there was a possibility that they might evolve into a higher rank being if they are able to survive this Great War, they excitedly decided to participate in the war.</p><br/><p>Thanks to that, the total number was a little less than 150.000.</p><br/><p>Under Adalman’s rule, they received an ability increase effect. Furthermore, due to『Holy-Demonic Inversion』, they wouldn’t be affected by the effects of the barrier’s magic essence isolation.</p><br/><p>Unlike inside the labyrinth, they cannot revive if destroyed however…… They won’t be purified by Undead Purification: Turn Undead.</p><br/><p>They became such a dreadful existence, because as undead that had turned into holy attributed beings, they won’t be affected by Holy Magic.</p><br/><p>And because they couldn’t die from normal attacks either, the only way to stop their movement is to completely destroy them.</p><br/><p>And then, Shion’s elite corps.</p><br/><p>10.000 Terror Knights.</p><br/><p>Like the Death Knights, their strength was equivalent to “A-” rank. And after the previous battle with the Empire, they had grown stronger.</p><br/><p>The true main force this time was Shion’s elite corps.</p><br/><p>The only problem was that the commanders of the elite corps were the sons of the enemy leader, Demon Lord Dagruel.</p><br/><p>Shion believed that Dagruel’s sons would not betray her since they had sworn loyalty to her lord, Rimuru.</p><br/><p>However, even without betrayal, whether or not they could fight was another story.</p><br/><p>「Hey you guys. The enemies are your relatives, can you guys fight them?」</p><br/><p>Shion summoned the three and asked them directly.</p><br/><p>And the three brothers responded as if it were natural,</p><br/><p>「Of course, Nee-san! Whether it’s our old man, or uncle, we will defeat them!」</p><br/><p>「Yeah! We will show our seriousness!」</p><br/><p>「Fuu~ fuu fuu! My stomach is growling.」</p><br/><p>His stomach is growling……?[1]</p><br/><p>For an instant, Shion thought ‘What is this guy talking about?’, however she splendidly ignored it.</p><br/><p>Oh well, since he’s fat, it couldn’t be helped that it would growl. However, Shion never thought that it would ever manifest in a form of motivation.</p><br/><p>However, it was troublesome for her to tsukkomi it.</p><br/><p>It will be alright if the people in question are ok. The problem might actually be their uncle.</p><br/><p>「Dagruel has a younger brother?」</p><br/><p>「Yes! It seems our old man has two.</p><br/><p>One of them is our old man’s aide, but I’ve never met the other one.」</p><br/><p>「They said that he’s a dangerous person so it seems he had to be sealed because of that, right?」</p><br/><p>「Oh well, it will be easy-peasy if you entrust the task to us!」</p><br/><p>When the third son Debura said so, for some reason Shion became uneasy.</p><br/><p>Oh well, they are her cute subordinates who had became strong enough to equal the former Demon Lord standard. She decided to believe in them, and she succeeded in pushing away her uneasiness.</p><br/><p>To such a Shion,</p><br/><p>「However, for such an upright person as Dagruel-dono to turn out to be a traitor…… it was something hard to believe.」</p><br/><p>Adalman said so while letting out a sigh.</p><br/><p>When he was installing the transfer magic formation, Dagruel was quite cooperative, and he got along well with Adalman who also had an upright character.</p><br/><p>Therefore, Adalman felt that it was simply too unbelievable.</p><br/><p>「Oh well, it seems he was was acquainted with the person who calls himself Velda, so he might have some kind of old ties with him.」</p><br/><p>Shion concluded so.</p><br/><p>No matter what was said, holding back against him was unnecessary, as he was an enemy.</p><br/><p>After all, Shion would not forgive that Velda-scum who had babbled such nonsense like destroying her dearest master Rimuru.</p><br/><p>If Dagruel is assisting that person, that would be the same as telling Shion you’d like to die, huh?.</p><br/><p>If it were the old Shion, she would have gone ahead and attacked by herself and struck him with all her might.</p><br/><p>「Fu. If you think about it, I have also become well rounded.」</p><br/><p>Shion sprouted a smile, she was satisfied with the growth of her heart.</p><br/><p>「Eh? Shion-sama isn’t round at all[2]!?」</p><br/><p>Because Debura shouted in surprise, Shion struck his stomach with her hand like she was going to gouge his stomach.</p><br/><p>It was the so-called corkscrew punch.</p><br/><p>「You shit-for-brains――I’ll kill you!!」</p><br/><p>So, she spat those words at Debura (the third son) who crouched down on the ground.</p><br/><p>Debura was someone that no matter how much he ate, the nutrients just went to his sides and never did reach his brain.</p><br/><p>He was the number one fool among the trio.</p><br/><p>「Th-this reward is――」</p><br/><p>Debura had a joyful smile on his face for some reason and then fainted.</p><br/><p>His two older brothers who saw this envied him, the other two brothers are fools as well.</p><br/><p>Shion imagined a cold sweat going down her back. ‘What a frightening bunch’, she thought.</p><br/><p>Gradually she has begun to not need to hold back against them. If only assessed from durability, the three brothers would rank first place without a doubt.</p><br/><p>In this world, there are really frightening people. In various meanings[3].</p><br/><p>Whilst Shion was thinking about this, she immediately turned her attention and glared at the approaching troops of Dagruel to her front.</p><br/><p>With a simple『Magic Power Perception』, she investigated Dagruel’s army.</p><br/><p>She perceived some people with large amounts of energy. However, only a few of them were worth watching out for. If it’s with her current power, enemies that she should be cautious to that extent did not exist.</p><br/><p>However, that’s assuming that the results of the『Magic Power Perception』were accurate.</p><br/><p>At least the Demon Lord Dagruel seems to be a martial artist who had had a one vs one battle against Veldora in the past. Shion’s perception hadn’t perceived anyone who had such huge power amongst the troops.</p><br/><p>That reminded her……</p><br/><p>Suddenly Shion remembered it. That Veldora and Dagruel had talked about training to suppress their magic power.</p><br/><p>(No, it can’t be. It’s not something that can be so easily attained. I want to think that……)</p><br/><p>However, she felt that it was possible when she thought about the growth speeds of Dagruel’s sons and their foolish tenacity.</p><br/><p>‘I’ll think about it when the time comes’, thus Shion made up her mind after she gave up thinking about it.</p><br/><p>Dagruel’s army had shown its perfect appearance.</p><br/><p>Chain of Restraint Titan Army, total number 100.000.</p><br/><p>Shion’s army was advantageous in number. Yet it might be inferior in terms of quality.</p><br/><p>There were Giant Ogres and Cyclops. Even big shots like some Hecatoncheires[4] of the Titan races.</p><br/><p>Various types of giants were approaching in crowds.</p><br/><p>In Shion’s honest impression, ‘No matter how many bones there are, it wouldn’t matter, right?’ or so she thought. </p><br/><p>「Oh dear, what a magnificent view. This may be a bit harsh for my cute skeletons.」</p><br/><p>「A bit?」</p><br/><p>「……somewhat, it’s a bit tough, but they should manage somehow or another.」</p><br/><p>「Ho….. do you have a plan?」</p><br/><p>「Hmm, I can’t say it’s a plan, but Albert’s command abilities are quite good.</p><br/><p>In addition, please look at them properly. The equipment of the Pawn Soldiers are complete.」</p><br/><p>Shion noticed it as Aldaman said it to her.</p><br/><p>Needless to say about the Death Knights, the Pawn Soldiers were equipped with leather armor.</p><br/><p>It was the best quality goods with the Tempest mark and made in the dwarf’s workshop.</p><br/><p>The Pawn Knights were, surprisingly, only equipped with simple breastplates.</p><br/><p>They seemed to be stingily made with demon steel exclusively for the skeletons to use, but the performance was guaranteed. Judging from the dull light they’re emitting, they might be charged magic items.</p><br/><p>As one might expect, the Zombie Soldiers received cheap makeshift equipment……</p><br/><p>「Hey…… aren’t you overdoing things? How did you obtain that amount of demon steel?」</p><br/><p>「What? It was an easy matter. From various sources, like the melted cheap equipment from adventurers, or iron ores I procured via Arnaud.</p><br/><p>Oh yes, from everyone of the imperial soldier before, it was a joyous thing for there were so many people who had quite good equipment!</p><br/><p>However, the most delicious was the Iron Golem Subjugation though.」</p><br/><p>Shion understood Adalman’s explanation whom had been speaking in a cheerful voice.</p><br/><p>He was not just playing inside the labyrinth, it seemed that he was also steadily collecting materials.</p><br/><p>Among the monsters included in the golem group which sometimes appears, Iron Golems contain an abundance of iron. Whenever such a monster was defeated, he would store it inside the labyrinth, and then high quality demon steel was completed before anyone realizes.</p><br/><p>Whilst doing combat training against Iron Golems, material can be collected too. It was precisely killing two birds with one stone.</p><br/><p>As things are now, the other floor guardians might do something to raise money too.</p><br/><p>(Tte, by any chance has he been earning more money than me!?)</p><br/><p>Shion is a former monster and doesn’t have any deep attachments towards money. However, she has recently been having quite a hard time thinking of a way to prepare equipment for her subordinates.</p><br/><p>In the first place, Shion was always unconcerned about money and other such things. It was only a recent change for her to begin paying attention to such matters. ‘It’s ridiculous for me to make money’, and thus Shion didn’t have any money.</p><br/><p>The first priority of the workshops of Tempest was the second army led by Gerudo.</p><br/><p>Recently, the equipment had been distributed to all of its members, though the maintenance was also a problematic issue since there are a lot of members. Since the equipment was made from demon steel, it would repair itself from the majority of damage, however it was also a fact that it was mostly used up for them.</p><br/><p>Next was the businesses for selling to the adventurers.</p><br/><p>Because this was a national policy, it could be that the aim is to earn foreign currencies, so Shion couldn’t interfere.</p><br/><p>Thus, by reserving her free time, she had laboriously obtained the equipment through wholesale.</p><br/><p>Of course, it was for free.</p><br/><p>Because, they were all things that had been made by the blacksmiths for practice, which were then handed over to her.</p><br/><p>She hadn’t had any dissatisfaction until now, however it was not amusing for her that the simple Pawn Soldiers were equipped with magic armor.</p><br/><p>Before the Empire came to attack, she had received a number of sets of armor from Rimuru. They were beautiful full plates all with a certain bluish purple color.</p><br/><p>However, it was only given to the members of Yomigaeri and the commanders, it had not been distributed to the newcomers that had recently joined. For them, the similarities in their equipment were limited to the color.</p><br/><p>Since it couldn’t be helped, she was going to report it to Rimuru with the thought of getting new equipment, but……</p><br/><p>After seeing how the newcomer Adalman hadn’t relied on Rimuru and had prepared the equipment by himself, it made Shion have second thoughts.</p><br/><p>‘It seems I have depended too much on Rimuru-sama’ so.</p><br/><p>(What a guy! I will display that we can procure equipment by ourselves!)</p><br/><p> Suddenly, Shion mustered her motivation.</p><br/><p>Regardless, in front of them stood an army of giants in large suits of armor. Materials that they were free to take.</p><br/><p>「Listen you guys. I won’t say much. But do you guys understand what you need to do?」</p><br/><p>「「「Uooooooo!! One’s equipment is gained by one’s own efforts!!」」」</p><br/><p>In response to Shion’s question, the elite corps displayed their motivation.</p><br/><p>Shion nods satisfied to that.</p><br/><p>Adalman, who was next to her, felt that something was a little off, however he couldn’t quite place it.</p><br/><p>Adalman, because he has a perspective similar to that of a human, he had bribed the craftsmen through various means in order to receive the equipment.</p><br/><p>He wouldn’t say unreasonable things such as ‘Do it for free!’ like Shion.</p><br/><p>(Not good. It would be better for me to not say anything to Shion-dono.)</p><br/><p>Yesterday, a guy had suddenly appeared and claimed that Rimuru was dead, Aldaman had a hard time calming Shion down.</p><br/><p>‘Rimuru-sama won’t perish that easily!’ He had frantically calmed Shion, ‘The blessing hasn’t disappeared, so in the worst case he may have been sealed somewhere’ was how he tried to convince Shion into calming down.</p><br/><p>However,</p><br/><p>「Sealed you say!? Then, I must leave immediately in order to help him!!」</p><br/><p>To Shion who began to say unreasonable things,</p><br/><p>「The enemy’s commander is approaching!</p><br/><p>Umm, if it’s the person named Dagruel, he might know about the details!」</p><br/><p>He said that, and thus succeeded in turning Shion’s anger towards the enemy.</p><br/><p>Even this time, with the matter about the armor, he had nearly ended up picking a fight with Shion, as such he was scared about whether she would snatch the Pawn Soldiers’ armor.</p><br/><p>No, Adalman certainly thought that it wasn’t strange to make a comparison about the quality of the equipment even though the Pawn Soldier are small fry compared to Shion’s Elite corps.</p><br/><p>Adalman had felt relieved since he was splendidly able to divert Shion’s attention away.</p><br/><p>The tongue is the origin of calamity. Saying needless things will just catch Shion’s interest, and dwelling on it any further could be dangerous, was what Adalman thought.</p><br/><p>Therefore, he pointed her aggression towards the enemy,</p><br/><p>「Well then, Shion-dono. May I perform the opening strike?」</p><br/><p>He asked.</p><br/><p>He was worried that if he did as he pleased, afterwards there would be complaints from her.</p><br/><p>If Shion was the one who opened the battle, he would only be able to support. Since it would be impossible for him to use his large scale attacks as he would hit his allies as well once both army collides.</p><br/><p>So if possible, he wanted to be the one who opened the battle, however…... that was solely up to Shion’s decision.</p><br/><p>「Very well, I will permit you to do it. You better rampage to your heart’s content!」</p><br/><p>Shion gave permission whilst in high spirits, as the prospect of obtaining equipment was in sight.</p><br/><p>Shion’s cold eyes gazed like a predator who had her prey in sight.</p><br/><p>When Adalman heard Shion’s words,</p><br/><p>「Thank you very much. Well then!」</p><br/><p>He bowed to Shion and moved elsewhere.</p><br/><p>Shion who saw that, laughed lightly.</p><br/><p>‘To the ones who mock the Great Demon Lord Rimuru, die!</p><br/><p>And if by any chance Rimuru-sama is sealed, I will show that I will rescue him.’</p><br/><p>Those were her thoughts.</p><br/><p>By the way, she was satisfied as she seemed to be about to be able to renew her subordinates’ equipment and also able to go wild against a suitable foe.</p><br/><p>At the same time, in her mind, a cool-headed calculation was being carried out.</p><br/><p>Though their numbers surpass the enemy’s, they were inferior in terms of quality. She mustn’t look down on this battle.</p><br/><p>Worst case scenario, even if she loses her entire army, she thought that it may be necessary in order to defeat Dagruel.</p><br/><p>In the sky and on the ground.</p><br/><p>Since when being attacked from two sides, the defense will immediately collapse should one of the sides be defeated.</p><br/><p>Even in the worst case, this side must absolutely not be defeated.</p><br/><p>Shion engraved that fact in her mind whilst conversing with the fools and Adalman.</p><br/><p>Glancing at Dagura, Ryura, and Debura, the three that are Dagruel’s sons, Shion thought even further.</p><br/><p>How strong is Dagruel, truly?</p><br/><p>Dagruel seems to have two younger brothers too, and the ability of those two are yet unknown.</p><br/><p>They are opponents that she must never be careless with.</p><br/><p>Even so, the victor will be me!</p><br/><p>Shion smiled fearlessly still.</p><br/><p>Her smile encouraged her allies and gave them strength.</p><br/><p>The battle would begin soon.</p><br/><p>[1] EN: For once, I have to agree with Shion's tsukkomi.</p><br/><p>[2] It’s a pun that doesn’t translate well. The pun is: Shion says: もくなったものだ. くなった means her personality become rounded/mellowed. Someone that is rounded (belly) is fat, so the Dagura heard it and interpret it as: I have become fat / gain weight). Hence the pun…</p><br/><p>[3] Yeah, like how there’re three creepy M who adores you. XD</p><br/><p>[4] https://en.wikipedia.org/wiki/Hecatoncheires The singular form: Hecatoncheir (meaning “Hundred-Handed Ones\"), also called the Centimanes. They are a giant/Titan with a hundred arms.</p><br/>\n</div>"}