{"title": "Chapter 213 – Unjust Ending", "id": 213, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-213-%E2%80%93-unjust-ending", "volume_title": "Volume 3", "body": "<h1>Chapter 213 – Unjust Ending</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Unjust Ending</p><br/><p>A knife glitters, and the straight sword repels it.</p><br/><p>An intense offense and defense were unrolled since a while.</p><br/><p>Each of them made their feints and schemes in order to advance in the fight advantageously.</p><br/><p>High-level psychological warfare was carried out.</p><br/><p>While Souei and Laplace were fighting, their fight was interrupted as Kazaream has fallen while being completely scorching together with a roaring sound.</p><br/><p>By the impact from when Kazaream was flung against it, the hall floor split open and the fragments scatter around.</p><br/><p>As proof that Kazaream’s body was burnt with high temperature, the marble which covered the floor began to melt.</p><br/><p>Naturally, Kazaream was not unharmed.</p><br/><p>Half of his body was burnt by fire, it became a terrible sight that normally no one would think that he’s alive.</p><br/><p>But, Kazaream was alive even in such condition.</p><br/><p>「Ah, nee-san!」</p><br/><p>Laplace was surprised and ran toward Kazaream in a hurry.</p><br/><p>In such panic as no one would imagine from his arrogant attitude.</p><br/><p>Even Leon and co who were treating their injury while watching the fight of Souei and Laplace, have their movement stopped as they seen the terrible sight of Kazaream.</p><br/><p>Everyone was able to understand from the mere sight of his appearance.</p><br/><p>Benimaru won, and Kazaream’s life begun to exhausted.</p><br/><p>Spiritual lifeforms were the people who stood at the top of this world with their tenacious vitality.</p><br/><p>However, from the moment their mind was broken and acknowledging one’s defeat, their vitality (=energy) quickly decreases and leads to their death.</p><br/><p>Kazaream’s situation was exactly that, everyone can see his defeat with their eyes, his energy started to decrease very fast.</p><br/><p>Souei didn’t stop paying attention to Laplace while being cautious.</p><br/><p>He didn’t think that it was a ruse, if it was a scheme, he judged that it would be dangerous to move carelessly.</p><br/><p>Comparing both of them, Laplace and Souei were almost equal.</p><br/><p>He would get defeated when he shown a fatal mistake, he was able to understand it from the bout he had a little while ago.</p><br/><p>Souei watched Laplace’s behavior carefully.</p><br/><p>Benimaru landed without a sound from the sky next to them.</p><br/><p>「Did you end it? But, aren’t you overdoing it a little?」</p><br/><p>「No, his energy exceeded mine.</p><br/><p>There’s no reason to go easy on him.</p><br/><p>If I didn’t finished it with my full power, it would be a war of attrition.</p><br/><p>If it happen, this side will lose if I make a bad mistake.」</p><br/><p>Benimaru answered Souei’s question.</p><br/><p>In fact, if you compare the size of the base energy, Kazaream has twice more of Benimaru.</p><br/><p>Benimaru borrowed the energy from Rimuru through the Soul’s corridor and barely obtained a power equal to Kazaream.</p><br/><p>It was a combat method to borrow power from a higher ranking person that he learned from Diablo.</p><br/><p>Naturally, the requirements were hard and of course he couldn’t fully utilize Rimuru’s power in combat.</p><br/><p>Besides, it was impossible to borrow it beyond one’s max energy.</p><br/><p>That’s because it would be uncontrollable.</p><br/><p>Moreover, there are some fine limitations, but it may be said that it’s a forbidden secret art to be able to use abilities beyond one’s power.</p><br/><p>Only the top three, Diablo, Zegion and Benimaru were able to do it.</p><br/><p>It was the ultimate art that was concealed from the other executives.</p><br/><p>(But, the only thing I can’t understand till now, is Diablo’s intention when he taught me this……)</p><br/><p>With such question in his mind, Benimaru didn’t change his relaxed attitude with Souei.</p><br/><p>Actually, he was able to defend against Kazaream’s holy demonic fusion attack by letting the nihility energy that he borrowed from Rimuru accelerate and cladding himself with it.</p><br/><p>If it was only his own power, he was certain that it would be a considerably hard fight.</p><br/><p>If it was said whether he would be able to win or not, he think that he might barely win, but Benimaru didn’t think that he want to actually try so.</p><br/><p>Anyway, one of the Four Fiends of the Heaven Commanders, Kazaream was a powerful enemy.</p><br/><p>「Well that might be true. Against such monstrous class, it’s unknown what kind of technique he’s hiding.」</p><br/><p>「Right so」</p><br/><p>Souei didn’t pursuit the matter anymore and nodded slightly.</p><br/><p>As Souei understood so, Benimaru begun to walk to deliver the final blow on Kazaream.</p><br/><p>The victory is certain, but there’s a possibility for Kazaream to revive if he’s not eliminated in this place.</p><br/><p>Since there’s no insurance that he can win the next fight, Benimaru was going to erase him without fail.</p><br/><p>But, when Benimaru was going to approach him, he heard Kazaream’s voice muttering.</p><br/><p>When he hears the words, Benimaru stops walking.</p><br/><p>「Hey, Laplace…… where did I make a mistake?」</p><br/><p>He heard Kazaream mutter with eyes which could not see anything towards the empty sky.</p><br/><p>Kazaream’s recollection continues.</p><br/><p>「In the beginning, I only wanted a place where we could live in happily……</p><br/><p>Because the shortcut for it is to become a Demon Lord, I became one――</p><br/><p>Then, I guess I had got carried away......」</p><br/><p>「Eh, such thing. It was someone else who was getting carried away!」</p><br/><p>「That’s right, I remembered it. I felt aggravated by Leon who introduced himself as a Demon Lord in spite of him being a human.</p><br/><p>Fussing over such dull matter, I provoked Leon for a fight......</p><br/><p>Hahaa, I have awakened a sleeping dragon......</p><br/><p>And so I was killed and I bore a grudge against Leon and lived for it all this time......</p><br/><p>But, it’ mystery.</p><br/><p>Why for such a thing all this time――</p><br/><p>We were only living happily......</p><br/><p>Laplace, you’re mistaken, you see...... I ...... I, made a mistake......</p><br/><p>Again, we happily――――――」</p><br/><p>Kazaream’s consciousness sinks to the bottom of the everlasting darkness.</p><br/><p>――Ah……That’s right……I must apologize to Clayman too――</p><br/><p>It was the last words that come to Kazaream’s mind.</p><br/><p>「Nee-san? Kazaream-sama? Hey, it’s not good, being stubborn is ya redeeming feature you know!</p><br/><p>If ya give up, it would be the end. It’s a lie, this can’t bae……</p><br/><p>I ain’t be deceived, stop bullshiting me! Once again together, we happily――</p><br/><p>Do ya think we would let you leave us so easily!? uuauooooooo!!!」</p><br/><p>Laplace cried aloud.</p><br/><p>He was too defenseless, and it was enough to stop Benimaru’s steps.</p><br/><p>「Eh, this…… a lie, Kazaream-sama?」</p><br/><p>Tear who feebly sat down, she became absent minded due to her inability to accept the reality.</p><br/><p>Silence filled the room like time has stopped――</p><br/><p>「Hoohoohooho! Now is the time for my turn right!」</p><br/><p>With unnatural movement like a machine, Footman sprang up suddenly.</p><br/><p>He hold an ominous round ball in his hands.</p><br/><p>When he hold up the ball in his hand over the sky. It occurred.</p><br/><p>『Yo, my name is Velda.</p><br/><p>It seems like Kazaream was defeated? Or the brainwashing was removed?</p><br/><p>Well, either way is good.</p><br/><p>Well now, I won’t be speaking for a long time, I need to collect my objective quickly.]</p><br/><p>The ball emits light and drawn the figure of the youth―― Velda―― in the air.</p><br/><p>The image linked with the form and clearly showed the figure of the boy.</p><br/><p>And the image spoke those words out.</p><br/><p>Everyone stopped moving hearing the words. Not because they’re not interested with the boy’s talk, it was because they can’t understand his goal and were at lost.</p><br/><p>Moreover, a certain intimidating aura can be felt from the boy.</p><br/><p>Whether it was the descend of his main body or it was just his body double?</p><br/><p>Even Mizari and Leon who were high ranking existences were overwhelmed by the aura they felt from the boy, and they’re not able to act carelessly.</p><br/><p>They stand alertly.</p><br/><p>「What is it……? Kazaream-sama was brainwashed ye said!?」</p><br/><p>It was Laplace who reacted.</p><br/><p>「Ye bastard! What do ye think mah comrades are!!」</p><br/><p>Laplace showed his anger which was rare to see.</p><br/><p>But, his voice didn’t reach Velda. He simply acted indifferently towards his goal without any interest about Laplace.</p><br/><p>Velda hold up his right hand towards Kazaream without minding the reaction of the others.</p><br/><p>At that moment, a light separates from Kazaream’s burnt body and sucked into Velda’s hand.</p><br/><p>「As if I let you do so!」</p><br/><p>Souei with a very quick speed threw a stab at Velda, but his stab passes through the image and didn’t activated the effect of one hit kill.</p><br/><p>「it’s not an illusion? Illusion with real substance……?」</p><br/><p>「This!? Some kind of parallel existence?」</p><br/><p>Towards Leon and Mizari’s analysis,</p><br/><p>『Ah, you guys better not thinking too much about me. This is just a recording image.</p><br/><p>Because I’m talking while expecting you guys’ behavior, there bout to be a slight sense of incongruity.</p><br/><p>Well, I have finished collecting my purpose, it’s time for me to disappear.</p><br/><p>Oh yeah, I think I should give you all a present for the end――』</p><br/><p>Velda said that he’s a recorded image of himself.</p><br/><p>It was Benimaru who was the first to notice the abnormality.</p><br/><p>Benimaru had sensed beforehand that it was recorded image of Velda, and without being confused he dashed towards the spot of Footman who held the ball.</p><br/><p>The ball finished emitting light and started to pulsating, it begun to erode Footman’s body.</p><br/><p>「Be careful! That fat guy――」</p><br/><p>It simultaneously happened with Benimaru’s warning.</p><br/><p>Kazaream’s body emitted light, then a powerful light and destructive power were unleashed to the surroundings.</p><br/><p>It made all of the combined holy demonic energy goes amok and caused a condensed explosion.</p><br/><p>The magic power swelled to its maximum inside the container and was released instantly.</p><br/><p>With a flash, the castle’s hall is filled with heatless destructive lights.</p><br/><p>The overwhelming killing power scattered and attacked the people who were alive.</p><br/><p>Velda’s intention was when he retrieved the power he gave to Kazaream, he at the same time manipulated the energy inside Kazaream’s body and make him explode.</p><br/><p>「Tch!」</p><br/><p>There’re few people who were able to react.</p><br/><p>Among them, Benimaru evaded all of flashes of the explosion which could be said a difficult feat while observing the surrounding situation.</p><br/><p>Souei who was a distant away from Kazaream, in an instant he positioned Footman as his shield and deploy multiple barriers as his defense.</p><br/><p>Mizari who didn’t have any change in her expression, invoked barrier magic which wraps her whole body and she was able to nullify half of it. She received damage from the remaining energy, but as a spiritual life form the injury instantly regenerates.</p><br/><p>Laplace was directing his anger towards Velda beside Kazaream, but his life was saved due to his foresight power.</p><br/><p>He moved to Tear’s location who was not able to react before the moment of the explosion, and he created a barrier while covering Tear. Even so, he bore a serious injury on his back, but he seemed to be able to avoid death barely.</p><br/><p>And then, Leon’s subordinates――</p><br/><p>All of them seemed to be safe due to the barrier which the Demon Lord Leon created and Leon who shielded them like a shield with his own body.</p><br/><p>But, Leon who prioritized protecting his subordinates over his own self, had received tremendous damage and was unable to move after being bathed in the destructive light which he couldn’t nullify.</p><br/><p>However, there’s still light of unyielding will shining in Leon’s eyes and he didn’t let Velda go from his sight.</p><br/><p>The attack just now was brutal, but there’s no one who died.</p><br/><p>Benimaru who perceived the situation let out a relieved sigh, but there’s a small uncomfortable feeling.</p><br/><p>He was able to sense that uncomfortable feeling coming from Footman.</p><br/><p>(What is this……?)</p><br/><p>He has such question but,</p><br/><p>『How’s it? Was the fireworks beautiful?</p><br/><p>Well now, it’s a present, but I think it’s about time it join too.</p><br/><p>I gave that Footman over there Vega’s egg.</p><br/><p>Although it’s reproduced body transplanted with Ultimate Skill『Evil Dragon Lord Azi Dahaka』, it have the same ability.</p><br/><p>If it absorbs the explosion energy of Kazaream just now and acquired the holy demonic energy, I wonder what would happens?</p><br/><p>Oh well, whether it succeeds or fails, both are good.</p><br/><p>Well then, please enjoy it to the fullest. Bye bye!』</p><br/><p>He lost consciousness for only an instant as he understood the meaning of Velda’s words.</p><br/><p>The words that were just was a shock.</p><br/><p>(Is that Transfer Technique? Did he returned after getting the core inside Kazaream in his hand?)</p><br/><p>Benimaru is analyzing, but he was not confident whether it was the correct answer.</p><br/><p>He had no time for it, as he has the produced evil monster as the current problem.</p><br/><p>He had received the report of its combat ability from when one of the Four Fiends of the Heaven Commanders, Vega was rampaging. It was fiendish monster having a considerable immortal characteristics.</p><br/><p>The effective way against such monster is only by annihilating it with overwhelming energy.</p><br/><p>However, if such monster got holy demonic attribute, the usable means of attacking would decrease.</p><br/><p>It means that monsters which he can’t defeat if he was not skillful enough.</p><br/><p>(This is bad. I used Prominence Acceleration in the fight before, I haven’t recovered my energy yet......)</p><br/><p>If Benimaru uses the strongest attack he has, he may exterminate it surely. However, even if he borrows Rimuru’s nihility energy, he calmly concluded that it was dangerous as the loss rate of his energy is too large.</p><br/><p>In other words, he can’t help but conclude that the war potential is insufficient against the monster―― the current Vega class―― which possess resistance to holy demonic attribute.</p><br/><p>It backfired as Benimaru had used his strongest attack against Kazaream.</p><br/><p>He could defeat him even if taking a bit of time, but he ended the fight with a swift attack so he could take care of Laplace. That was Benimaru’s decision.</p><br/><p>If he was fighting only against Laplace, he would have enough remaining magic power. There’s also Souei here, and so he judge that there’s no problem even if there’re 4 of awakened Demon Lord class.</p><br/><p>It may be said that Benimaru’s decision which aim for a quick conclusion was never wrong.</p><br/><p>But, he’s just regretting his own hastiness currently.</p><br/><p>For the current war potential here, Leon is wounded all over his body and it’s hard to say that Mizari is unharmed.</p><br/><p>Although Souei is uninjured, his ability is specialized against an individual. Because he doesn’t have a long range attack, he’s not suitable for erasing Vega.</p><br/><p>Above all, it’s uncertain how will Laplace moves, preparation for that is needed.</p><br/><p>People below than it are not included in the war potential.</p><br/><p>The strategy that can be taken here might be only for him to be the leader and asking Mizari to assist him.</p><br/><p>He can’t help but expect that Mizari has means for a wide area attack like Carrera.</p><br/><p>In case she didn’t has such means, she only need to buy some time for him to recover his energy.</p><br/><p>Velda said everything that he wanted to say, all his traces has suddenly vanished.</p><br/><p>As the person itself said, it seemed to be a recorded image beforehand.</p><br/><p>What he need to be cautious is only Footman who carried Vega’s egg.</p><br/><p>The time needed for Benimaru to finished collecting his thought was only a short time of 1/1000 or less than one second.</p><br/><p>But, even if that thinking was just an instant, it was a decisive period.</p><br/><p>When Benimaru turned his sight to Footman, it had already happened.</p><br/><p>「Hooohoohooho. Did you see, Laplace?</p><br/><p>I, Footman the Angry Clown just killed that hateful Leon.</p><br/><p>Including Kazaream-sama’s regrets, I will clear myself from this anger now!」</p><br/><p>Footman are saying as if he’s the greatest.</p><br/><p>Like backing his words, Footman pulls out his thrust out hand from Leon’s chest.</p><br/><p>A large amount of blood flowed out.</p><br/><p>「「「Le, Leon-sama!!」」」</p><br/><p>Leon’s subordinates panicking.</p><br/><p>Meanwhile, Leon collapses in slow movement and vomits blood from his mouth in large quantities.</p><br/><p>His heart was pierced, and anyone was able to see that it was a fatal injury.</p><br/><p>Having his consciousness almost taken by Velda’s attack is one of the cause, Leon who was covered by wounds all over his body, he’s already not be able to deal with Footman’s movement.</p><br/><p>Leon who is one of the Octagram was on the verge of being killed now.</p><br/><p>In case of Mizari who is a spiritual lifeform, her core would be likely to be able to regenerate as long as it was not destroyed.</p><br/><p>However, Leon is a high ranking human who possess holy body.</p><br/><p>He was an awakened Hero, which was similar to existence which don’t have lifespan but―― certainly it was depending on the physical body.</p><br/><p>If he evolves to be a spiritual lifeform and become a demi god, the matter might have been different.</p><br/><p>Footman continues laughing loudly.</p><br/><p>「Are ye a fool……</p><br/><p>Didn’t ye hear Nee-san’s last words……」</p><br/><p>Laplace tsukkomi to Footman although he’s serious.</p><br/><p>However, it didn’t enter Footman’s ear.</p><br/><p>Footman has already lived in his delusion, his reason and his mind, everything already eaten away by Vega’s egg.</p><br/><p>「What’s this, Footman. Ye too has already broken――」</p><br/><p>Laplace frustratingly muttered.</p><br/><p>His eyes clearly sees the future where Footman breaks.</p><br/><p>Vega’s power continues eroding him, Footman’s anger, mind and even memory are consumed to nothing.</p><br/><p>In that case, the only thing left is merely an incarnation of destruction.</p><br/><p>「I ain’t going to forgive ye, Velda!!!」</p><br/><p>Laplace swore for a revenge with anger in his heart.</p><br/><p>「Tear, go away for a moment. I will start to be serious, after a long time.」</p><br/><p>「Eh, but…… Footman……?」</p><br/><p>「Footman is been controlled. By that bastard guy, Velda.</p><br/><p>Therefore, I should quickly end it.」</p><br/><p>「――Understood. Don’t act rashly!」</p><br/><p>「By the way, are ye keeping anything from Velda?」</p><br/><p>「I don’t have anything…… Probably, because I stick to Kazaream-sama all the time.</p><br/><p>Laplace, don’t leave me alone please……?」</p><br/><p>「Hahaha, leave it to me. I’m actually stronger than Kazaream-sama ye know?」</p><br/><p>「Yes. I knew.」</p><br/><p>Laplace turned his sight to Footman while saying “what did ye know”.</p><br/><p>His eyes already swallowed all feelings and all the unrest in his heart disappears.</p><br/><p>The Devil, Laplace staggeringly stood up.</p><br/><p>And then, he walks carefreely to Benimaru’s side,</p><br/><p>「Say, let’s have a temporary truce.」</p><br/><p>So he suggested that brazenly.</p><br/><p>Benimaru accepted the suggestion.</p><br/><p>There’s possibility that’s a lie and a trap, but he was willing to do it including it.</p><br/><p>Since Leon who he expected for the biggest attack has fell, he would use any usable hands that can be used.</p><br/><p>Above all, Souei can be added to the war potential as Laplace’s alertness is dispelled.</p><br/><p>Souei didn’t opposed it, he investigate Laplace’s movement with his clone. Both parties were engaged it together.</p><br/><p>They did a strategy meeting while restraining Footman’s rampage.</p><br/><p>He was worried about Leon’s condition, but he gives priority to defeat Footman currently.</p><br/><p>「If I’m not mistaken, that Vega guy suck up magic essence from the ground right?」</p><br/><p>「As long as he’s in contact with the ground, he could reproduce endless.」</p><br/><p>To Benimaru and Souei’s converstation,</p><br/><p>「Please don’t worry.</p><br/><p>This castle is isolated from the world by a spherical isolation barrier even from the ground.</p><br/><p>Even the hole made by Benimaru-sama and Kazaream-sama a while ago, its already been completely restored」</p><br/><p>Mizari answers.</p><br/><p>It seems to have worked without a flaw.</p><br/><p>However, Benimaru expects that there’s no means for long range attack.</p><br/><p>Naturally Mizari can use Nuclear Strike Magic, but he judges that a simple magic is not effective.</p><br/><p>「Then, you Clown. Do you have any big move or something?</p><br/><p>Because his regenerative power is too high, he can recover immediately even if I cut him down you know?」</p><br/><p>「Call me Laplace.</p><br/><p>For the answer of the question…… I’m sorry.</p><br/><p>I’m too, like that Niisan over there, specialized in anti individual.」</p><br/><p>「What, you can’t use it …… Didn’t you boast yourself stronger than Kazaream just a while ago!?」</p><br/><p>「What a stupid thing to say! If it’s about underhanded trick like Seraphim absorption or Awakened Demon Lord Transformation, I can’t use it, that kind of talk.</p><br/><p>Even that such underhanded tricks, even no matter how many I am, I can’t win.</p><br/><p>Therefore, I have 10 spirit bombs left, if I let them explode in chains――」</p><br/><p>Laplace shrewdly shown the bomb from his pocket for an instant.</p><br/><p>‘Oh?’ so Benimaru nod.</p><br/><p>The four people were holding a meeting while evading the attacks that the highly nimble Footman launched.</p><br/><p>The power was sublime, but they were saved because the attack speed was slow.</p><br/><p>It was good currently, but there was possibility that they won’t be able to deal with the speed later on. It will be a suicidal act to prolong this.</p><br/><p>「Okay, his current energy is not so big as he just have taken the remains of Kazaream.</p><br/><p>If we want to defeat him, now is the time!</p><br/><p>Besides, if we spend a lot of time his body will complete adjust to Vega’s power.」</p><br/><p>「――That’s right. His attack speed gradually increases.</p><br/><p>Since the attack has holy demonic attribute, it will be impossible to completely defend against if you receive it.」</p><br/><p>In fact, if there’s no one who can put barrier of both holy and demonic, either attribute would passes through.</p><br/><p>It will be nullified if Foootman become able to master it like Kazaream even if there was barrier against both attributes.</p><br/><p>「Mizari, I entrust you to maintain the barrier with all your effort. Even in the worst case, don’t let this guy replenish his power more than this!</p><br/><p>Souei and Laplace, you two please set the bomb. I left the competition signal to Souei.</p><br/><p>Because I will blast everything at the same time as the signal, you two must not fail to get out in time!」</p><br/><p>The four people have begun to move at once under Benimaru’s command.</p><br/><p>It was an impromptu plan, but they shows a wonderful cooperation, with Laplace and Souei’s strings, Footman is fastened.</p><br/><p>As 10 spirit bombs floats in Footman’s surroundings, Souei gave a signal.</p><br/><p>「Right now!」</p><br/><p>At the same time, Benimaru multiplied the barrier meticulously that he deploys.</p><br/><p>He thoroughly probe the surroundings and made sure that there was no other Footman’s fragments.</p><br/><p>On top of that, he enclosed it so that there was no room for Footman to create a clone.</p><br/><p>「Take this, Hell Prominence!!!」</p><br/><p>Flames of hell sweep over inside the barrier.</p><br/><p>At the same time, the spirit bombs explode and caused a chain explosion inside the barrier.</p><br/><p>It was originally an attack of holy demonic attribute that could be defended against.</p><br/><p>Yes, originally……</p><br/><p>「It’s, it’s lie right!? That Footman, he eat the explosion energy!!!」</p><br/><p>The energy of the union of holy and demonic attribute was too compatible with Footman who obtained Kazaream’s attribute.</p><br/><p>Even while his body is burnt, as his body were regenerated by his super recovery ability, his lost energy was replenished. Footman didn’t keep his original form anymore and his size was enlarged into three meters, becoming an incarnation of violence.</p><br/><p>「Why do you use something like explosions of holy demonic attribute!」</p><br/><p>「How cruel! Aren’t ye the one who agreed to it!」</p><br/><p>Although Benimaru and Laplace was quarreling and screaming, that was an act to lighten the atmosphere even a bit.</p><br/><p>It might be said that the situation was the worst.</p><br/><p>As the current attack was not working, the only way left is to wait until Benimaru’s energy to be restored; it was such a pessimistic plan.</p><br/><p>It was unknown whether it would succeed, it was also clear that Footman would became able to master Vega’s power if they’re buying time for it.</p><br/><p>The current Footman rage recklessly as he lost his ego.</p><br/><p>He will kill all the living people in this place completely.</p><br/><p>The only point that can be said as saving grace was his egoless attack which was means of survival for Benimaru and co.</p><br/><p>「It can’t be helped…… it will be a war of attrition, I guess we only have to do it.」(Benimaru)</p><br/><p>「That’s right, there’s no other way.」(Souei)</p><br/><p>「I shall accompany you.」(Mizari)</p><br/><p>「No helping it. Prioritize yerself to survives above all else.」(Laplace)</p><br/><p>The four people were prepared for it.</p><br/><p>But, the overwhelming determination and touching emotion of the four people was destroyed in the next moment.</p><br/><p>「Kufufufufu. So, this is what said that ‘you are never careful enough in the final stage’, Benimaru-dono.」 (Highlight stealing Demon)</p><br/><p>No one knew when he arrived, an evil demon suddenly appeared behind Footman and gripped his head.</p><br/><p>And just like that, he flung it against the ground.</p><br/><p>The demon turn around and shrugged his shoulder like he was showing his disappointment.</p><br/><p>「Against such small fry of this level, what are you guys playing around?」(Rimuru’s Demon Butler)</p><br/><p>With a sarcastic smile, he said those words.</p><br/>\n</div>"}