{"title": "Chapter 216 – Vs Dagruel Part 5", "id": 216, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-216-%E2%80%93-vs-dagruel-part-5", "volume_title": "Volume 3", "body": "<h1>Chapter 216 – Vs Dagruel Part 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Vs Dagruel Part 5</p><br/><p>‘This might be impossible――’</p><br/><p>That’s the honest impression of the Demon Lord Ruminas Valentine.</p><br/><p>Her plan was to kill Dagruel using her strongest technique in the first attack, but it had no effect.</p><br/><p>With Death’s Blessing, the life and death reversing technique, Dagruel should have died.</p><br/><p>However, the result was that the instant death effect was nullified, and Ruminas’ secret technique was defeated.</p><br/><p>At that time, Ruminas was able to partly foresee that thing would proceed this way.</p><br/><p>The one on one fight between Albert and Grasword continued.</p><br/><p>Both of them didn’t even take a step back, it seemingly an even fight. However, when the fight between the two was observed with Ultimate Skill『Lustful Lord Asmosdeus』, the situation shows a different outlook.</p><br/><p>Against Grasword who’s a mass of energy, Albert was distributing energy into every important point of his body.</p><br/><p>The decrease of their vitality was insignificant, but the difference in the aggregate amount gave hint of the outcome of the battle.</p><br/><p>In other words, before Albert finished to cut down Grasword, the outcome will be decided.</p><br/><p>Albert’s defeat, that was the situation would be.</p><br/><p>However, no one could criticize Albert. Rather, with his wonderful skill, he was fighting evenly against the sword king.</p><br/><p>If the difference of the energy was not taken into consideration and only the sword techniques matters, it can be said that Alberto’s superior.</p><br/><p>However, even so, the situation didn’t change.</p><br/><p>The way things are going right now, Albert’s defeat was just a matter of time.</p><br/><p>On the other side, the battle between Adalman and Fenn also growing intense.</p><br/><p>The young man with black hair who wears the jet black colored priest clothes against the skinny, small giant who wielding Gleipnir.</p><br/><p>Adalman had possessed and combined with the Death Dragon Wenti, and his energy has increased greatly.</p><br/><p>However, even so, the difference was obvious as Fenn who is in front of Adalman can rival a True Dragon.</p><br/><p>For Ruminas who can see vitality in numerical form, the differences were despair inducing.</p><br/><p>Against Fenn who’s called both the Fighting God and Fist God, for Adalman to be able to survive this far was a miracle.</p><br/><p>In the flurry of throwing, punching, and joint locks, it was obvious that physical strike was the main constituent.</p><br/><p>Joint locks were meaningless, since for a spiritual life form, physical damage would completely recovered in an instant.</p><br/><p>He just barely able to modify the technique to perform a throwing technique to deal and blow away the opponent. However, in the end, that technique was for defending, Adalman couldn’t expect Fenn to be damaged by the throw.</p><br/><p>In other words, he just stalling for time.</p><br/><p>After Adalman understands his own disadvantage, he was fighting with the objective of exhausting the enemy by a long period of combat and not aiming for victory.</p><br/><p>However even so, he was concentrating so hard like he was treading on thin ice.</p><br/><p>In Ruminas’ sight, she could see Adalman’s appearance who ward off Fenn’s attack by casting away all of his defense and manipulated his energy to concentrated on a point.</p><br/><p>In order to cover the difference of the energy density, Adalman was fighting by concentrating all of his power on one point.</p><br/><p>It was already such ability that could be called as a miracle.</p><br/><p>However, it won’t continue more longer, Ruminas thought that it wouldn’t take a long time for Adalman to lose.</p><br/><p>And then, Shion.</p><br/><p>The woman who fighting against Dagruel and standing up many times in front of him.</p><br/><p>Her appearance reminded Ruminas of the Hero Chloe who saved her in the past.</p><br/><p>Blood flows out from her head without any sign of stopping. Even the wound in her whole body, bore new wounds after recovering.</p><br/><p>Shion’s attack couldn’t touch Dagruel, she was mortally injured due to Dagruel’s counterattack.</p><br/><p>Even so, Shion stood up, she kept challenging Dagruel over and over.</p><br/><p>「Ah, Nee-san! Please stop it already!」</p><br/><p>「Shion-sama! You can’t win against our pops――」</p><br/><p>「It, it’s dangerous. As it is right now, Shion-sama will……」</p><br/><p>Even Dagruel’s sons were flustered at first.</p><br/><p>However, would they broke through their hesitation mid-battle and,</p><br/><p>「Uooooooooo! Pops!! We will be your opponents!」</p><br/><p>「There’s no other way. I’m prepared for it!」</p><br/><p>「I’ll do it! And then, I’ll get praised!」</p><br/><p>Exactly as stated in their determination, they went to face Dagruel.</p><br/><p>And right now, they were barely alive bearing serious injury, lying on the ground while being powerless to stand up.</p><br/><p>Those three were strong as majins. That’s why they were alive.</p><br/><p>However, that’s all. In front of Dagruel’s absolute strength, it was all useless.</p><br/><p>(This is impossible right. There’s no reason that we can win. Even I only able to go this far huh―)</p><br/><p>To Ruminas’s ear who reached the stage of resignation partly,</p><br/><p>「Princess, the preparation for the retreat was complete ――」</p><br/><p>Such whispered voice was heard.</p><br/><p>The “Seven Celestial Sages” who command the raid seems to have advanced the preparation for a concealed transfer secretly.</p><br/><p>They have judged that there’s no chance for victory in this war and likely to have made their safety a priority.</p><br/><p>Certainly――</p><br/><p>That’s right, certainly, if she was the Ruminas from before, she would withdrew without any hesitation.</p><br/><p>Such thing as going to war with no chance of winning was nonsense.</p><br/><p>The country can be rebuild, it wasn’t something she need to be concerned with.</p><br/><p>Ruminas and her kin has eternal life, there’s no reason for them to fight betting their life on it.</p><br/><p>However ――</p><br/><p>(Will I be really fine? Will it be a correct action for me to withdraw from this place?)</p><br/><p>Ruminas hesitated.</p><br/><p>Shion was barely being able to stand up because Ruminas’ support.</p><br/><p>She used an ability increasing skill, so even a near death serious injury would recover immediately......</p><br/><p>Improving Shion’s regeneration power to the utmost limit was also one of Ruminas’ ability.</p><br/><p>If Ruminas withdrew now, it meant Shion would die immediately.</p><br/><p>(Abandoning the front and running away alone by myself? Such a thing, such an ungraceful action, I’ll never accept it!</p><br/><p>I’m the proud “Queen of Nightmare”, you know!!)</p><br/><p>And so, Ruminas steeled herself.</p><br/><p>「I won’t. I won’t retreat. If by any chance I get killed here, go select the next master from the seven lords.</p><br/><p>I’m one of the proud Octagram.</p><br/><p>Such thing as running away ungracefully is not fitting for me. Don’t you think so?」</p><br/><p>She said so and sprouted a beautiful smile.</p><br/><p>An alluring smile which didn’t suit the face of a young girl.</p><br/><p>The “Seven Celestial Sages” who heard it have their eyes wide opened with surprise instantly.</p><br/><p>Their master who attached so much importance to life, surprised them with such boast.</p><br/><p>However ――at the same time, they were deeply aware.</p><br/><p>That’s right, it didn’t suit Demon Lord Ruminas Valentine who called as the Queen of the Night to be running away.</p><br/><p>Because she’s the vampire princess who always acted gracefully and reigned nobly.</p><br/><p>「I’ll not obey such order.」</p><br/><p>「Yes.」</p><br/><p>「At the time of your ruin, we’ll also follow.」</p><br/><p>The “Seven Celestial Sages” disobeyed Ruminas’ order for the first time.</p><br/><p>Although she was surprised by it, it wasn’t unpleasant feelings which perplexed Ruminas.</p><br/><p>Far from it, it was instead pleasant feelings.</p><br/><p>「Fuu, you fools. Then, strengthen the barrier quickly! Hurry up, you blockheads!!」</p><br/><p>Ruminas cheerfully ordered them.</p><br/><p>『As your will! Then, the city defense will――』</p><br/><p>「I see. Change the barrier’s attribute using the Holy Demonic Inversion technique.</p><br/><p>Don’t allow those angels invading the Holy City! As long as we buys some time, Demon Lord Rimuru will send reinforcement!」</p><br/><p>「――Princess, do you believe in Demon Lord Rimuru……?」</p><br/><p>「Humph! I don’t believe in him. However――</p><br/><p>There are people who believe in their master while fighting. Don’t you think that the act is worth believing in?」</p><br/><p>As she said so, the “Seven Celestial Sages” shifted their focus on the battlefield.</p><br/><p>How the Demon Lord Rimuru’s subordinates were fighting couldn't be assessed as just stalling for time.</p><br/><p>In this situation, even they’re betting their life to buy time, despite it practically having no meaning at all.</p><br/><p>It may be reasonable for their own country, but they had devoted their own life in order to defend the territory of an allied country.</p><br/><p>Their action was a strong proof of them believing that their master would never abandon them.</p><br/><p>「Indeed…… ‘Believing’――Such word, we have forgot about it for a long time.」</p><br/><p>「Well then, we will start the strategy.」</p><br/><p>「May fortune with you, Princess!」</p><br/><p>Bowing all together, the “Seven Celestial Sages” left.</p><br/><p>‘Will it be really alright?’ so Ruminas hesitated.</p><br/><p>But, she didn’t regret.</p><br/><p>In front of her, Shion stood up once more.</p><br/><p>No matter how she was wounded, she rises up many times.</p><br/><p>‘That’s right, I, I should do the only thing I can do!’ and so, at the moment Ruminas tried to support Shion again――</p><br/><p>「Good grief, I have become the opponent because I feel the sign of awakening, but it’s disappointing.</p><br/><p>Or…… because there’s a person who defends you, you can be at ease?</p><br/><p>If that’s the case, first I’ll deal with your recovery means. That way, you might grow a bit.」</p><br/><p>She heard Dagruel’s muttering voice.</p><br/><p>It took a moment for her to realize the meaning of it.</p><br/><p>「St, stop it!」</p><br/><p>Shion shouted in panic, but she received Dagruel’s blow and became silent.</p><br/><p>She didn’t seem to be dead, but it was very unlikely for her to move.</p><br/><p>Glancing at her, Dagruel turned around and began to walk towards Ruminas.</p><br/><p>Ruminas prepared herself.</p><br/><p>「Very well, Dagruel. I shall become your next opponent!」</p><br/><p>Ruminas put herself on guard towards Dagruel.</p><br/><p>The words she said for herself, she felt funny in her mind.</p><br/><p>Far from being an opponent, to Dagruel someone like Ruminas was equal to garbage, so she thought.</p><br/><p>「Fumu. As expected, Ruminas. The pride of a Demon Lord is not just for show heh.」</p><br/><p>To Dagruel’s words, she laughed thinly.</p><br/><p>Such thing as pride, she didn’t think about it at all. However, Ruminas just thought that she didn’t want to betray Shion.</p><br/><p>(It’s strange. Unlike with Chloe, I haven’t associate with her for a long time.</p><br/><p>Fighting against Dagruel even though there’s no chance for me to win.</p><br/><p>Why didn’t I run away?</p><br/><p>――Did I also believe? That someone would come to help.</p><br/><p>Such thing, such convenient thing, would not happen.)</p><br/><p>She pondered and understood.</p><br/><p>Suddenly, the image of that selfish and carefree black dragon crossed in her mind.</p><br/><p>A smile floats naturally on her mouth.</p><br/><p>Her appearance make Dagruel felt strange, but he ignored it without saying anything ――</p><br/><p>「Well then, HERE I GO!」</p><br/><p>At the same time as him shouting, his fist was thrust out towards Ruminas.</p><br/><p>Her soul was frozen in fear. However, Ruminas didn’t run away.</p><br/><p>Evasion was impossible.</p><br/><p>Recognized that, Ruminas mocked herself.</p><br/><p>(――it’s so different. Struggling till the end. I’m like a different person……)</p><br/><p>But, there was no dissatisfaction, instead, she puffed her chest proudly.</p><br/><p>At least at the end she has her pride as a Demon Lord, and she can boast as she challenged a strong person without running away.</p><br/><p>At least, in her final moments, with her hand, that hateful arrogant evil dragon――</p><br/><p>Ruminas’ mind then stopped for a moment.</p><br/><p>It occurred immediately before Dagruel’s fist reached Ruminas.</p><br/><p>The time had stopped because of Velzard.</p><br/><p>Right now, currently.</p><br/><p>Something happened before Dagruel’s fist reach Ruminas.</p><br/><p>――The powerful fist in front of her eyes.</p><br/><p>And then, a palm of someone with tanned skin received it.</p><br/><p>Dagruel’s attack which had an overwhelming power was obstructed by a man who suddenly appeared in front of Ruminas.</p><br/><p>Then,</p><br/><p>「Kuahahaha! I, have arrived[1]!」</p><br/><p>While laughing loudly, the man shouted in loud voice.</p><br/><p>However, time was currently stopped, the man’s voice didn’t reach anyone.</p><br/><p>With the exception of Dagruel.</p><br/><p>No, it reached Ruminas actually.</p><br/><p>(Did he come here!!?)</p><br/><p>However, Ruminas was conscious but her body can’t move.</p><br/><p>In such confusing situation, Veldora’s voice reached Ruminas――</p><br/><p>(What’s this, I can’t speak!? Has time stopped......? But who did it?)</p><br/><p>She was flustered because she shouted instinctively, but Ruminas noticed that she couldn’t speak.</p><br/><p>And so, trying to grasp the situation, finally she realized that currently the world’s movement had stopped.</p><br/><p>(What a carefree guy! Even when the world stopped, for him to be able to move like it’s natural――)</p><br/><p>It was surprising as Ruminas continuously thought.</p><br/><p>At the same time, it became very ridiculous. The tension that strained her before death had loosened, she felt a sense of relief filled her heart for some reason.</p><br/><p>(Impossible. For me to feel relieved just because Veldora have came――that can’t be possible!)</p><br/><p>She threw away such feelings which crossed in her mind and focus on the current situation.</p><br/><p>There was no light, she couldn’t understand anything inside the stopped world.</p><br/><p>However, Ruminas’ super perception began to perceive the situation faintly.</p><br/><p>Only Veldora and Dagruel who calmly moving.</p><br/><p>She listened carefully to the conversation of those two,</p><br/><p>「What…. the…!? Even though I have make my entrance coolly with a lot of trouble….. for the world to be stopped?!」</p><br/><p>「Oh, it’s Veldora. It was a miraculous timing, but you have my condolences.</p><br/><p>Even though I said that, I’m not the one who do it, okay?」</p><br/><p>「Unuuu, I know. The one who can do thing like this is probably my aneue[2].</p><br/><p>As for the length, enough to stop time for two seconds, that person has the useless habit of stopping time for a long time.」</p><br/><p>「Oh well, there’s no meaning to stop time for a long time. If there’s someone else who can move inside the stopped world, stopping time doesn’t have any meaning.」</p><br/><p>「That’s right. I have advised her several times, but she doesn’t listen to me. Oh well, it’s fine as I don’t really care anyway. She messed around such as stopping time when it was punishment time…… oh well, forget it.</p><br/><p>There’s another thing to discus――」</p><br/><p>「Uh, what?」</p><br/><p>「Umu. To match the timing when the time moving again, I want to redo my arrival.</p><br/><p>So, as I decided to be cool, it’s necessary to make Ruminas impressed you know」</p><br/><p>「……can I hear the reason?」</p><br/><p>「Kuahahahaha! What, it’s simple y’know. I till now have done various thing</p><br/><p>Therefore, Ruminas considerably resents me.</p><br/><p>If I make her indebted to me while displaying how cool I’m, she would forget everything, that’s the plan.</p><br/><p>Kukukuku. For that reason, I was hiding myself from sight.</p><br/><p>I don’t know when you might go berserk so I was a bit worried here.</p><br/><p>Yet…..</p><br/><p>Even though I had made my entry so cool with a lot of trouble, it was ruined because of my aneue.</p><br/><p>That’s the reason. Can I ask you for that?」</p><br/><p>‘Haaーーーー’, Ruminas seemed to hear Dagruel’s tired sigh.</p><br/><p>And then, Ruminas also felt the same.</p><br/><p>(This rotten lizard, I’ll strangle him later!)</p><br/><p>Ruminas raged with her face turning red.</p><br/><p>If she could move now, she’d gifted him a kick without a doubt.</p><br/><p>‘Perhaps, I’d be able to move because of anger?’ Thinking so, she hated Veldora’s attitude.</p><br/><p>Veldora didn’t think that Ruminas can hear him in the stopped world, she deemed it to be his carelessness.</p><br/><p>“I’ll teach him a lesson without fail later!” Ruminas sworn so in her mind.</p><br/><p>At the time when Dagruel about to answer Veldora’s offer, there was a person who tried to stand up with a staggering movement.</p><br/><p>It was Shion.</p><br/><p>Her eyes were bloodshot, the open wounds on her whole body haven’t recovered.</p><br/><p>However, it was strange that no blood flowing out.</p><br/><p>While cladding in a strange atmosphere, Shion completely stood up.</p><br/><p>‘Hm?’ so Dagruel gazed at her,</p><br/><p>「Shion, huh. You were able to move even in the stopped world……?</p><br/><p>Hm,『Envy』seems to have disappear. This is, I see――」</p><br/><p>Veldora noticed something and stopped talking.</p><br/><p>Then as if to interrupted his word,</p><br/><p>「――Ve, Veldora-sama….. th, that person… is my prey. Wo, would you hand over him to me?」</p><br/><p>Shion asked Veldora while panting, using her sword as a cane to stand.</p><br/><p>Veldora looked at her while squinting his eyes,</p><br/><p>「I see, very well. I will lend you a bit of my power. Fight well to your heart’s content,!」</p><br/><p>He responded so.</p><br/><p>「Th, thank you very much――」</p><br/><p>Shion seemed ready to fall, so Veldora supported her.</p><br/><p>And, from where Veldora touched Shion, his energy flowed.</p><br/><p>「Hu! Although I had said that I would lend it to you, there is no fragment of restraint from you eh. (Perhaps, I should collect it later from Rimuru ……)」</p><br/><p>Veldora grumbled, looking worn out while Shion’s complexion improved fast.</p><br/><p>The wounds on her body healed, even her clothes, before anyone aware, had become as good as new.</p><br/><p>Dagruel raised one of his brow tolerating it, standing silently waiting for Shion’s preparation to complete.</p><br/><p>Then――</p><br/><p>《Individual: Shion undergo ability evolution, Ultimate Skill『Tyrannous Lord Susanoo』was acquired.》</p><br/><p>Unchanged by even the stopped world, “The Voice of the World” was heard.</p><br/><p>It was the moment when Shion had awoken ultimate power.</p><br/><p>「I have kept you waiting. However, as you hoped for, I shall give you some amusement.」</p><br/><p>「Fumu. Well then, I shall accept your offer.」</p><br/><p>The two nod to the other gladly and once again confront each other.</p><br/><p>In the stopped world where it was difficult to perceive the opponent’s presence, the fight between Shion and Dagruel begun.</p><br/><p>Meanwhile――</p><br/><p>(By any chance, is my turn only……)</p><br/><p>Veldora was anxious about such thing, there was no one who noticed it.</p><br/><p>[1] Momotaros’ reference. Den-O</p><br/><p>[2] Elder sister (formal).</p><br/>\n</div>"}