{"title": "Chapter 212 – Foolish Kazaream", "id": 212, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-212-%E2%80%93-foolish-kazaream", "volume_title": "Volume 3", "body": "<h1>Chapter 212 – Foolish Kazaream</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Foolish Kazaream</p><br/><p>Souei and Laplace squared off against each other, grasping for each other’s openings.</p><br/><p>They fell into a deadlock after several bouts of offense and defense in the blink of an eye.</p><br/><p>All of Laplace’s unseen knives that were thrown towards Souei in the beginning had pierced Souei’s body.</p><br/><p>Laplace thought that he had killed Souei with his surprise attack, but it was no more than a parallel existence that Souei had created.</p><br/><p>Souei is being cautious.</p><br/><p>Against the enemy that he seen for the first time, he must not act like challenging him carelessly.</p><br/><p>Regardless of whether or not he will lose or win and whether or not the enemy is superior or inferior, Souei didn’t let his guard down.</p><br/><p>「Is this how you fight? With such strength, even if you fight fair and square you would be quite good.」</p><br/><p>「Hahaha, I’ll receive th’ praise, but I think I juist want to enjoys ‘n’ win.</p><br/><p>Still…… you’re verry troublesome, Nii-san[1].</p><br/><p>Even though I act because I culd see a certain vision of I killing ye, t’was just an imitation.</p><br/><p>Just like what my intuition says, to withdraw is th’ correct answer.」</p><br/><p>Laplace prepared several knives in his hand while shaking his head in disappointment.</p><br/><p>And, from his mouth comes an enjoying smile.</p><br/><p>Just like his title as Wonder Clown, Laplace is enjoying fighting as something to live for.</p><br/><p>He pursued the presence of the Souei’s main body while killing all of the created mirror images.</p><br/><p>He analyze the magic power wave that Souei releases and might be said that he memorized it.</p><br/><p>「Oh, how skillful. Carelessly intercepting it is difficult heh.」</p><br/><p>One of the clones exploded at the same time as it repelled Laplace’s knife.</p><br/><p>It seemed to be a bomb which disguised as a knife.</p><br/><p>And in addition to that, it’s spirit bomb. Having all of 7 attributes, it’s an object that contains the Omnipotent attribute to counter the Demonic and the Holy attributes.</p><br/><p>「Hehehe. Since Nee-san’s attribute is th’ Omnipotent attribute, I have receive a bit o’ it.</p><br/><p>To be frank, isn’t it impossible for ye to defeat Nee-san who have both demonic ‘n’ holy attribute?</p><br/><p>Although that Nii-san is also extremely dangerous, but it woull be less embarrassing if ye just be obedient, ye know?」</p><br/><p>「Do you really think so?」</p><br/><p>「――well, I guess sae? Och well, I wull only force ye to stay here.</p><br/><p>I don’t know whither there’s a lot o’ real body or fake ones―― mibbie it’s all real―― a clone user is really troublesome.</p><br/><p>You see, even when I don’t know th’ real body, if I surround ye wi’ spirit bomb, even you’d not be able toe do anythin’ richt?」</p><br/><p>All of the knives have been already camouflaged by Laplace’s Unique Skill 『Deceiver』.</p><br/><p>Or rather, only his word is feigned, all of the knives are spirit bomb.</p><br/><p>Without hesitation, he intended to kill Souei.</p><br/><p>「FFu. Surround me you say? Such thing will be not significant if I can transfer.」</p><br/><p>While Souei says so, he transfers with『Space Control』.</p><br/><p>That’s all according to Laplace’s plan.</p><br/><p>「Hahahahha! Nii-san, ye don’t seem to be careful.</p><br/><p>The Spirit Bombs had been configured to chain explode due to dimensional vibration.</p><br/><p>It woull flows all at once into th’ distorted space o’ transfer series skill ‘n’ explode inside it!</p><br/><p>If ye receive that explosion, this side wull get entangled too ‘n’ receive damage, so t’was fearful ye know.</p><br/><p>Well, th’ cause o’ yer defeat is that ye didn’t notice mah puppet strings which had wrapped ye around.」</p><br/><p>Laplace wraps the knife with his puppet strings and let it twined around Souei.</p><br/><p>Not only just that, he linked the knife with the other knives, which were flying nearby, and set it to react to the movement of the other clones.</p><br/><p>Hypothetically, if Souei didn’t use his transfer ability, there would be no problem even if Souei come charging while ignoring the spirit bombs.</p><br/><p>Because even if most of this audience hall got blown away, it would be easy to retrieve his comrade that is Tear and Footman and to escape.</p><br/><p>Laplace fiddled with the timing of the explosion as it was not a problem for him.</p><br/><p>After all, with his Unique Skill『Seer』, he could see it clearly Souei’s figure being swallowed up by the explosion.</p><br/><p>Without hesitation, Laplace begun his attack with conviction that he could surely kill Souei.</p><br/><p>Laplace laughs loudly, pleased that his plan would end well.</p><br/><p>「Sorry, it’s a bad place for you to be pleased so much, but let’s end this soon.」</p><br/><p>Laplace heard a cold voice from his back.</p><br/><p>And then, he cannot hide his surprise as a straight sword[2] stuck out from his chest.</p><br/><p>Laplace can’t understand what happened.</p><br/><p>「This can’t be……」</p><br/><p>Could do nothing but to speak such stupid word.</p><br/><p>It was simple when the truth was revealed.</p><br/><p>Souei from the beginning concealed his main body in the darkness.</p><br/><p>It was not his main body which was surrounded by the bombs, it was only one of his parallel existence.</p><br/><p>He calculated the position of Leon’s castle with “Eye of the Moon” of his Ultimate Gift『Shadow Moon[3] Lord Tsukuyomi』and carried out a direct transfer to the inside of the barrier.</p><br/><p>And then, he concealed his main body with shadow using『Law Manipulation (Shadow)』 and launch a surprise attack with the effect of “One-hit Kill”.</p><br/><p>Without any sign of naivety like Benimaru, that’s Souei’s way of fighting.</p><br/><p>But――</p><br/><p>「Geez. I never think that mah younger brother…… would git so easily killed lik’ this――」</p><br/><p>「Younger brother, you say? Mu!?」</p><br/><p>In response of the blood thirst, Souei jumped aside from that spot.</p><br/><p>With the eyes which foresee everything, he sensed a danger simultaneously with an uncomfortable feeling.</p><br/><p>At the same time, the knife which stuck in Laplace’s corpse was scattered by the explosion of the body.</p><br/><p>If his evasion was a bit late, Souei would rolled up in the explosion and would not come out unharmed.</p><br/><p>「Just kidding~! Did ye really think that I have a younger brother?</p><br/><p>To tell you th’ truth, I have a similar ability as ye too.</p><br/><p>The truth is, just lik’ you I hud thought to dae a surprise attack, but that won’t be guid, hence I reveal myself.</p><br/><p>Well~ it’s been a while. For mah clone to be killed!」</p><br/><p>Laplace spouts lies brazenly while preparing his surprise attack.</p><br/><p>He narrows his eyes and smiles.</p><br/><p>His behavior of making fool of someone is just like him, a hedonist.</p><br/><p>Marionette Master Clayman.</p><br/><p>Laplace is Clayman’s master. He made a magic doll which modeled after himself and manipulated it with automatic operation.</p><br/><p>And, his target――</p><br/><p>「Well then, it’s been a long time since I rampaging seriously.</p><br/><p>For underestimating me, I’ll show ye a painful experience. It’s time for ye tae be prepared!]</p><br/><p>「It’s you who need to be prepared. You need to stop the foolish delusions such as you defeating me, and you should immediately return to the darkness.」</p><br/><p>And the two people fought each other and their fight reached a deadlock.</p><br/><p>Benimaru and Kazaream had broken through the barrier which Miazari had set up and also the city barrier, the two were now having a battle airspace high above.</p><br/><p>Kazaream begins to violently attacking Benimaru taking the advantage of his enormous energy.</p><br/><p>The fight between a fellow spiritual lifeform could be said as a struggle to investigated the enemy’s energy. One would win if they deprived the enemy of their power and decreased their existence power.</p><br/><p>His Ultimate Skill was means for that, Kazaream made Benimaru consume his energy by effectively releasing his ability.</p><br/><p>――No. He was under impression that he did so.</p><br/><p>「Well, how’s it!! You can’t counterattack!? What happened with your condescending attitude from before?」</p><br/><p>Kazaream who rely fully on his power, concentrated his energy to his fists and hits Benimaru repeatedly.</p><br/><p>For Kazaream who been optimized by his Ultimate Skill『Dominion Lord Melchizedek』, he was convinced that the Octagram won’t be his opponent.</p><br/><p>In fact even Leon would be just like a baby in front of Kazaream.</p><br/><p>He was able to see that Mizari, who had been preaching before, was a worthless existence who could only receive a single blow from him.</p><br/><p>That’s right.</p><br/><p>In front of his ultimate optimization called『Holy Demonic Unification』, which integrated the power of demon and angel, holy and demonic, he was confident that there was no angel nor demon that could be his equal.</p><br/><p>Kazaream thought that there was no reason for him to lose if himself was above in both quantity and the quality of the energy.</p><br/><p>In fact, he succeed in offsetting Leon’s holy strike and even Mizari’s demon power equally and adding a counterattack.</p><br/><p>Even if Kazaream does nothing, his enemies would destroy themselves on their own.</p><br/><p>It was the Counter lapse that Kazaream had devised.</p><br/><p>Of course he activated it when he was attacked.</p><br/><p>He let the damage accumulate by offsetting the attack while depriving the enemy’s energy by crashing his energy.</p><br/><p>He won’t lose unless his enemy surpasses his energy, it was an ability that ensure certain victory.</p><br/><p>And, as one of the Four Fiends of the Heavenly Commanders who have the strongest power, Kazaream thought that there was no other existence that’s more superior than himself.</p><br/><p>「What happened!! Are you unable to do anything when I get serious?</p><br/><p>When you realized about my power, it has already be too late you see.</p><br/><p>What a fool. If you didn’t obstruct me, you would have be able to live a little longer.</p><br/><p>I want to see Leon’s crying face without any delay, so I will kill you soon.」</p><br/><p>Kazaream was about to finish off Benimaru while laughing evilly.</p><br/><p>Kazaream was merry because of his strengthened ability, he was completely convinced that no one can oppose him.</p><br/><p>Certainly that it’s a strong ability, it might be not weird for Kazaream to think so.</p><br/><p>However, it could be said that it was a too foolish act.</p><br/><p>Kazaream was convinced that his ability is the strongest and doesn’t have weakness. Therefore, he was too overconfident with his ability.</p><br/><p>That’s why, he didn’t notice.</p><br/><p>His attacks didn’t do any damage to Benimaru.</p><br/><p>「Ora ora ora ora! How’s that how’s that!!」</p><br/><p>Moreover Kazaream was getting carried away,</p><br/><p>「Shut up!」</p><br/><p>The fist that Benimaru threw hit Kazaream’s face.</p><br/><p>「Buboaa!!」</p><br/><p>Just with that one blow, it had robbed most of Kazaream’s consciousness.</p><br/><p>「Bubaa, ha, a, gaa!?」</p><br/><p>Kazaream turned his gaze to Benimaru with his eyes opened wide in astonishment.</p><br/><p>While looking like he’s pitying Kazaream, Benimaru pointed out the reality.</p><br/><p>「Your attacks doesn’t work against me at all you see.」</p><br/><p>So he said.</p><br/><p>Kazaream couldn’t understand the meaning behind Benimaru’s word</p><br/><p>That might be so.</p><br/><p>Kazaream was conceited that he had obtained the strongest power; because until just now, he had stood as the strongest.</p><br/><p>And yet, that there is an enemy whom his attacks wouldn’t work against is something that he would never deem as possible.</p><br/><p>「Do, don’t be joking! Wha, what a stupid thing to say!!</p><br/><p>Is, is that so…… I understood! It’s a bluff, you must be bluffing!</p><br/><p>Hahaha, what a shrewd guy. I won’t get deceived by such foolish lie!」</p><br/><p>He unreasonably interpret the fact on his own.</p><br/><p>Then, he condensed his energy with the maximum output in both his hands, and took a stance toward Benimaru.</p><br/><p>「You’re finished.</p><br/><p>Even if I fall into your tricks, you would be hopeless in front of my absolute power.</p><br/><p>How~ unfortunate! A fool won’t understand it.」</p><br/><p>Grinning and sprouting a smile, Kazaream regained his composure and felt the reliable power in both of his hands.</p><br/><p>「Well then, good bye. If you want to resent, resent your own powerlessness! Arc Depression (Ruler’s Melancholy)!!!</p><br/><p>What he had shot out was a dreadful energy wave that could be called as Holy Demonic Wave Cannon which would rapidly exhaust the target’s energy.</p><br/><p>Even with speed surpassing dozens of times the speed of sound, it might be impossible to avoid it, and that sure-kill wave was rushing towards Benimaru.</p><br/><p>But, there was no change in Benimaru’s expression, with his cherished katana “Guren” in his hand, he calmly took a stance.</p><br/><p>「Do you know? Speed is power. In other words――」</p><br/><p>Swinging his beloved katana, Benimaru ward off Kazaream’s sure-kill attack and nullified it with his Rebirth Flame.</p><br/><p>He could have counterattacked, but he deliberately held back.</p><br/><p>Because he was going to kill Kazaream with the next attack.</p><br/><p>「Ha? Huh!?」</p><br/><p>Kazaream who opened his eyes wide to their limits was astonished.</p><br/><p>He witnessed an impossible spectacle in front of his eyes and his mind can’t catch up with it.</p><br/><p>「Well, such a dull attack of yours can’t reach me you know.</p><br/><p>In other words, it means that your attack can’t effect me.</p><br/><p>There’s one thing I can praise you for, you were certainly superior than me only in the total amount of power.</p><br/><p>But, if it’s about the quality, I’m overwhelming superior than you.</p><br/><p>Just that.</p><br/><p>Can you understand it?</p><br/><p>Then, die! Prominence Acceleration!!」</p><br/><p>Kazaream’s movement stopped as he was too astonished and had entered a panic state, received Benimaru’s special attack.</p><br/><p>The black sunlight which took the shape of an Oriental dragon swallowed half of Kazaream’s body while moving as if it has its own will.</p><br/><p>The quality was exactly like Benimaru had stated, the nature of the released energy was so terrifying like a Tyrant.</p><br/><p>The reason was because the nihility energy that his adored and respected master, the Great Demon Lord Rimuru has.</p><br/><p>Some of Rimuru’s subordinates had approached to the nihility nature of Rimuru through the Soul’s Corridor.</p><br/><p>Therefore, it wasn’t weird for Benimaru to offsetting Kazaream’s attack which had the holy and demonic attributes.</p><br/><p>It was blocked by Benimaru’s energy which superior in quality and the attack was nullified.</p><br/><p>Although it can’t be compared with Rimuru the originator, as the original was moving in super high speed and had enhanced energy, it was still a finishing move.</p><br/><p>In all aspects, it may be said that Benimaru was skillful.</p><br/><p>「Tch. I still can’t control it perfectly yet.」</p><br/><p>Benimaru grumbled.</p><br/><p>Although he had no complaint about the power, the accuracy didn’t go as he wanted.</p><br/><p>The technique was a technique in which Rimuru instructed Benimaru to imitate Cardinal Acceleration which was the ultimate attack of the “Scorch Dragon” Velgrind.</p><br/><p>Unlike Velgrind who was a high density spiritual lifeform by nature, it was still premature for Benimaru to master it, seeing that he had just finished evolving.</p><br/><p>But, Benimaru’s ability was the Ultimate Skill『Blazing Sun[4] Lord Amaterasu』, with Light and Heat Control (acceleration) as the abilities crux, there were still a lot of things which he could learn from Velgrind’s ability.</p><br/><p> Or rather――</p><br/><p>(It just my guess, but I think I inherited the ability that Rimuru-sama acquired from Velgrind-sama.)</p><br/><p>――Benimaru comprehended.</p><br/><p>And―― Zegion, Ranga and the other, might have inherit the ability from Veldora-sama.</p><br/><p>As for Diablo,</p><br/><p>(That guy seem to inherit a direct ability from Rimuru-sama.)</p><br/><p>So, he remembered the opponent he engaged in desperate struggles inside the labyrinth for many times.</p><br/><p>Using the labyrinth characteristic where they can’t die, Benimaru and Diablo had performed real combat trainings over and over again.</p><br/><p>The result was his complete defeat on every match.</p><br/><p>Aside from places the public can watch such as the Tournament, Diablo never holds back against his opponent.</p><br/><p>(Although it’s good that I had a glimpse of the end of his strength, that fellow, I’ll beat him someday!)</p><br/><p>‘Kufufufufu’. Benimaru felt a bit unpleasant as he remembered Diablo’s loud laugh.</p><br/><p>Benimaru knew about it, but recently Diablo seemed to be considerably feigning ignorance in front of Rimuru.</p><br/><p> However, if it might be said that, on the contrary, it could thought that he was close with Diablo that he could saw his hidden true self.</p><br/><p>While forcibly making himself agreed to it, Benimaru moved his gaze to Kazaream who fell down and went towards him to deliver the final blow.</p><br/><p>[1] Not the brother meaning but for young man, laddie.</p><br/><p>[2]  Chokutou lit. Straight Sword. They’re straight Japanese blade which were used before the invention of Tachi. Tachi have Curve while Chokutou didn’t.</p><br/><p>[3]  when the kanji translated separately it becomes Moon Shadow/Shadow Moon. When the kanji is combined it literally translated as Moonlight, Moonbeams, Moon.</p><br/><p>[4]  separately Sun Flame/Blazing Sun. Combined Heat Haze (Kagerou).</p><br/>\n</div>"}