{"title": "Chapter 222 – Royal Capital Disturbance -Sudden Change-", "id": 222, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-222-%E2%80%93-royal-capital-disturbance-sudden-change-", "volume_title": "Volume 3", "body": "<h1>Chapter 222 – Royal Capital Disturbance -Sudden Change-</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Royal Capital Disturbance -Sudden Change-</p><br/><p>Hinata stood up while gazing at Reiner coldly.</p><br/><p>There’s no trace of gentleness in her eyes, it was buried completely by the color of contempt.</p><br/><p>「Hi-hinata-sama―― Are you alright? Can’t you leave the matter to Masayuki-dono?」</p><br/><p>Nicholas called out Hinata, but she didn’t respond.</p><br/><p>Masayuki heard Nicholas’ word, but he stiffened as though he was startled</p><br/><p>On Hinata’s mouth, there’s a small smile.</p><br/><p>It was a frightening smile, reminiscent of the former Hinata.</p><br/><p>「No, there’s no problem. That’s right….. There’s no problem. Everything was as expected.」</p><br/><p>Rather than answering Nicholas, Hinata muttered instinctively to feel convinced that what she thought is correct.</p><br/><p>In fact, it’s true.</p><br/><p>Hinata had believed in his guess and went along with it.</p><br/><p>That’s right. Hinata had seen everything up to this result.</p><br/><p>In a word, everything was as she expected.</p><br/><p>Even when she was tormented by Reiner, all were expected events.</p><br/><p>Actually, these days Hinata had been attacked by an intense sense of déjà vu.</p><br/><p>She could see a scene from a few seconds to a few minutes ahead as if she had experienced it.</p><br/><p>She experienced the same thing several times, she was convinced that it was the experience of a bit later in the future.</p><br/><p>This time luckily―― although it may not be so―― she was tormented by Reiner, she had been able to see the scene where he cut her limbs and gouged out her eyes.</p><br/><p>(As expected, it’s difficult to restore cut limbs; though it’s not amusing if the face was wounded ――)</p><br/><p>That’s Hinata’s thought.</p><br/><p>Her face which was clean of injury was unnatural, it’s not because Reiner going easy on her, the correct answer was because Hinata had evaded all of the attacks.</p><br/><p>As for her limbs, she normally received the attacks, to the extent of her tendons was cut.</p><br/><p>She was able to do this and that because she knew the future.</p><br/><p>And so, Hinata’s victory condition wasn’t to survive until the truth was exposed to the people, it’s for the people taking shelter in the church to not be harmed.</p><br/><p>In case she poorly resisted, the knight under Reiner’s command would start attacking the church, it was one of the possible futures that she saw.</p><br/><p>(Is the cause because I’m connected with Chloe’s soul? I don’t think it’s my ability after all.)</p><br/><p>With a terrifying accuracy, Hinata sees the fact.</p><br/><p>Due to a small connection with Chloe, a fragment of Chloe’s ability had shown memory of the future to Hinata.</p><br/><p>However, Hinata was indifferent to such thing.</p><br/><p>The important thing is only the reality that led to the best results.</p><br/><p>As things going as Hinata planned, Reiner, the subject of scorn is in front of her.</p><br/><p>He was the man who tormented her until now, she has no sympathy at the slightest for him.</p><br/><p>「Well then. Did you say your name is Reiner?</p><br/><p>You wanted to fight me right. Very well, I shall fight you seriously.」</p><br/><p>Hinata sprouts a smile full of kindness and look on Reiner</p><br/><p>However, her eyes are cold.</p><br/><p>「Damn you! I’ll kill you and also that Hero. I’m the strongest, the result is obvious.</p><br/><p>I’ll slaughter everyone who knows about the matter!」</p><br/><p>Reiner shouted with a mind full of madness.</p><br/><p>And then he raised his sword charging towards Hinata.</p><br/><p>Without panicking, Hinata raised her rapier.</p><br/><p>Unlike the one-sided torment a while ago, there’s no need for her to hold back now.</p><br/><p>She evaded the big slash from Reiner’s sword, and without hesitation, she stabbed his foot.</p><br/><p>「Gyaaaーーーーー!!」</p><br/><p>Reiner screamed.</p><br/><p>Due to the intense pain, he recovered a bit of his sense.</p><br/><p>(What, what the heck is this pain――)</p><br/><p>Reiner was grinding his teeth as he felt an abnormal pain.</p><br/><p>He couldn’t conceal his confusion as the skill『Pain Perception Blockade』that he had hadn’t shown its effect.</p><br/><p>The damage was not a big deal, but there’s no sign of any injury.</p><br/><p>「Ufufufufu. Is it painful? Raise your voice more and entertain me more!」</p><br/><p>With an expression of ecstasy, Hinata moistened her lips with her bewitching tongue.</p><br/><p>Nicholas and Fritz sent a hot gaze towards current Hinata.</p><br/><p>As one would expect, it’s only Leonard who grieved due to it.</p><br/><p>「――Hinata-sama…… Your image just improved with a lot of trouble, it’s spoiled now――」</p><br/><p>Certainly, her image was spoiled, but her gesture brings forth some wild enthusiastic fans.</p><br/><p>That suited Hinata very well.</p><br/><p>Because it reminded people that the strong predate the weak.</p><br/><p>Hinata started pursuing Reiner without showing any behavior of minding the response of the surroundings.</p><br/><p>Afraid of the attack which caused him intense pain even if it just grazed him, Reiner naturally fought defensively.</p><br/><p>「You-you bastard! Enchanting the sword with magic is unfair.」</p><br/><p>Reiner accuses foulmouthed.</p><br/><p>However, Hinata only showing a smile, she didn’t respond to Reiner’s accusation.</p><br/><p>Because it’s a fact, she didn’t intend to deny it. Moreover, enchanting her sword with magic was not a bad reason either.</p><br/><p>Her sword is a Unique class Magic Sword.</p><br/><p>Hinata’s spiritual armaments were transferred to Chloe leaving her with nothing, even if she borrowed a mass-produced type spiritual armament before, she didn’t have enough power to activate it.</p><br/><p>At that time, this rapier was sent by Rimuru.</p><br/><p>It’s called Phantom Pain (Phantom Rainbow Spirit Sword).</p><br/><p>It was a sword with abilities that could be said the upgraded version of the magic sword Hinata used before.</p><br/><p>Naturally, it’s possible to use it to cause the opponent to die in the seventh attack like『Dead End Rainbow』.</p><br/><p>If it’s the former sword, it was to destroy the spiritual body at the seventh strike.</p><br/><p>But, the sword given by Rimuru was frighteningly able to destroy even the astral body.</p><br/><p>Originally it’s a legend class weapon, but it has been readjusted so Hinata able to use it.</p><br/><p>(The one before can’t be compared with the performance of this one. Even I who lose my power can use it)</p><br/><p>While slightly admiring it, Hinata was satisfied with the sword’s ability.</p><br/><p>And then she narrowed her eyes and sent a cruel smile towards Reiner.</p><br/><p>Right now, she already hit Reiner with five attacks.</p><br/><p>It’s possible to kill him immediately in the next two attacks, but she thought it would be not interesting.</p><br/><p>And, even in such situation this sword is useful.</p><br/><p>「Well, let’s wrap it soon. I’m tired of seeing your unpleasant face.」</p><br/><p>Telling Reiner so, Hinata raised her sword.</p><br/><p>「Do-don’t underestimate me, you female fox! Th-there’s no way for me to be defeated by the likes of you!」</p><br/><p>Reiner shouted with squeaky voice while he swung his sword.</p><br/><p>「Don’t think I’ll be so kind and let you live because you’re a woman―― Become mincemeat! Violent Decapitating Slash Wave!」</p><br/><p>The power of the high-speed rotation produced by Reiner’s trained body was transmitted through the sword, the target hit by the impact would be pulverized.</p><br/><p>Surely, a person who receives it will be turned into pieces of meat, it was the strongest attack Reiner can bring out.</p><br/><p>However――</p><br/><p>「How naïve. It’s only of this level――」</p><br/><p>Reiner’s attack slipped through Hinata who was sneering.</p><br/><p>It was Hinata’s afterimage.</p><br/><p>Blood rose to Reiner’s head as he fell to the beginner trick that Hinata used.</p><br/><p>「Im-impossible!」</p><br/><p>「Goodbye. Please die and taste the eternal suffering in these three minutes. Dead End Pain!!」</p><br/><p>Reiner unwillingly tasted the true power of Hinata who he underestimated as a weak person.</p><br/><p>Coupled with the surprise of his strongest attack missed, he was unable to react to Hinata’s attack.</p><br/><p>Hinata’s blow accurately pierced through Reiner’s heart.</p><br/><p>(Only this extent! With my『Body Recovery ex』, I can regenerate even a heart――</p><br/><p>And then, I will no longer forgive this woman. I’ll kill you, you female fox!)</p><br/><p>Reiner admonished himself for being careless and swore to seriously kill Hinata next time.</p><br/><p>However ――</p><br/><p>(Ha? What, why the pain…... ha?)</p><br/><p>Reiner tried to activate his『Body Recovery ex』 to restore the wound he received, but the ability won’t active……</p><br/><p>Not just that skill, even the effect of the skill of the body control series such as『Pain Sense Blockade』『Physical Condition Control』had also disappeared.</p><br/><p>「Gugiyaooooooーーーーー」</p><br/><p>Reiner was gasping and writhing in pain.</p><br/><p>For a long time, Reiner didn’t feel pain due to the effect of『Pain Perception Blockade』, but now he felt intense fear and suffering.</p><br/><p>That’s one of the abilities of Hinata’s weapon.</p><br/><p>『Dead End Pain』 which activate at the time of the 6th attack.</p><br/><p>After sealing off the enemy’s abilities, the effect of complete destruction of the spiritual body began after three minutes.</p><br/><p>It was a frightening ability which wouldn’t let the enemy fell to madness and kill them while making them feel despair and pain.</p><br/><p>The pain of their soul destroyed is not physical pain.</p><br/><p>A person who received this attack might felt the three minutes as if it’s an eternity.</p><br/><p>「Good night. Have a good dream.」</p><br/><p>Hinata spoke gently like putting Reiner to sleep.</p><br/><p>And then, Hinata gazes at Reiner who writhing in agony with a satisfied feeling.</p><br/><p>(Oh well. The pain that I received, I had returned it back ten thousand times.)</p><br/><p>Satisfied, Hinata loses her interest in Reiner.</p><br/><p>The pain was not repaid back ten thousand times, but Hinata didn’t really care.</p><br/><p>Anyway, the hopeless situation was averted.</p><br/><p>That’s most important than anything else.</p><br/><p>Rolling on the ground, Reiner was screaming.</p><br/><p>However, no one tried to help him.</p><br/><p>The soldiers who were instigated by Reiner and the prince were also unable to determine to correct action as they try to understand the situation.</p><br/><p>With the appearance of Hero Masayuki who is the hero of the people, the public opinion had gone away from Reiner and co.</p><br/><p>The prince’s confession was decisive.</p><br/><p>Being the royal family’s guard is the duty of the Guard Knights, but there’s no reason for them to defend a regicide.</p><br/><p>In this place, there’s no one who swore their loyalty to Prince Elrick.</p><br/><p>At the same time, it’s obvious there’s no righteousness in their leader, Reiner.</p><br/><p>「Wh-what we should do now……?」</p><br/><p>The knights and soldiers were trembling.</p><br/><p>Seeing everyone currently, as the chance has arrived, Masayuki stands up.</p><br/><p>「Everyone! Which side is correct, and which side is wrong? I think it’s obvious if you look at this spectacle.</p><br/><p>If all of you are wise, all of you will know the correct answer even if I don’t say it――</p><br/><p>Please, I want you all to believe in that answer. I also want to believe in everyone!」</p><br/><p>Actually, Masayuki still had hesitation.</p><br/><p>The development was too fast, he didn’t catch up with the situation.</p><br/><p>However, his instinct told him that this is the biggest chance to lead the people opinion.</p><br/><p>So as not to be his own opinion, he decided to induce the people with provisional wording.</p><br/><p>(It’s perfect. Like this, even if I make a mistake, I won’t be blamed.)</p><br/><p>Masayuki was praising himself inside his mind.</p><br/><p>「Ooh, Masayuki-sama is trusting us……」</p><br/><p>「What have we done!」</p><br/><p>「If we must to meet Masayuki-sama’s expectation――」</p><br/><p>In response to Masayuki’s words, the knights threw away their sword and kneeled.</p><br/><p>Their act shows that they have no hostility against Masayuki.</p><br/><p>Seeing the knights like that, relieved mood begins to flow through the people.</p><br/><p>And then――</p><br/><p>「Hero-sama seem to have straightened out the problem……」</p><br/><p>「The prince have the king――」</p><br/><p>「But, luckily we have Hero Masayuki-sama!」</p><br/><p>「The mastermind is the Knight Leader, Reiner.」</p><br/><p>「That’s mean, Hinata-sama is……」</p><br/><p>「But, it’s Masayuki-sama who see the truth and save Hinata-sama from the predicament!?」</p><br/><p>「As expected from Hero-sama!」</p><br/><p>In this way, naturally, Masayuki’s exploits had increased</p><br/><p>It spread quickly among the people,</p><br/><p>『MA~SAYUKII, MA~~SAYUKII!!』</p><br/><p>It didn’t take a long time for it to be the usual grand cheering.</p><br/><p>Masayuki raised one hand awkwardly to response the people while having stiff cheeks.</p><br/><p>He had teary eyes inside his mind.</p><br/><p>However, that was a usual occurrence too.</p><br/><p>After waiting for the place to quiet down, Hinata walked to Masayuki.</p><br/><p>And then she held out her right hand,</p><br/><p>「I have been indebted to you.」</p><br/><p>So, she requested a handshake from Masayuki.</p><br/><p>Masayuki felt nervous as he looked at Hinata closely due to her beauty.</p><br/><p>There were a lot of beautiful women in Tempest, but Hinata’s pretty face had a different peculiar charm from them.</p><br/><p>Masayuki trying to respond Hinata’s request and panicky rubbing his hands.</p><br/><p>But――</p><br/><p>As Masayuki was charmed by Hinata, he tripped by a pebble and like a skilled mime he fallen down on his feet.</p><br/><p>As the result…...</p><br/><p>He felt a soft sensation on his right hand.</p><br/><p>And he felt hair smoothly tickling his cheek……</p><br/><p>A sweet smell that made his mind astray stimulates his nose.</p><br/><p>(Wh-why it becomes like this……)</p><br/><p>To the rest of the event, Masayuki can’t see the reality for a moment.</p><br/><p>(Or rather, this feeling on my right hand, it’s like touching a finest quality cushion, it can’t be……)</p><br/><p>That’s right.</p><br/><p>Masayuki stumbled and just like that he pushed down Hinata.</p><br/><p>Carefully, his right hand was groping Hinata’s plump breast.</p><br/><p>Even to this extent, he’s a lucky pervert.</p><br/><p>However, it was Masayuki who feared that the result will be frightening.</p><br/><p>When Masayuki tried to stand up and making an excuse while his face turning pale ――</p><br/><p>(Huh? What just now……)</p><br/><p>Masayuki realized that something passed over his head.</p><br/><p>He felt a shock as if something passed through the back of his head.</p><br/><p>(Oh! From where did I get sniped!?)</p><br/><p>However, it was somewhat different from Masayuki’s imagination.</p><br/><p>Masayuki realized that it was the shockwave that arrived late, not the attack.</p><br/><p>In other words, the attack passed with a little difference when Masayuki fell down.</p><br/><p>If Masayuki didn’t get tripped by the pebble, his life would be gone.</p><br/><p>「Tch. Impossible―― for you to evade my assassination!?」</p><br/><p>A person appeared in front of Masayuki and co, raising his astonished voice.</p><br/><p>A man who is dressed in black priest outfit, pure white wings sprouted from his back.</p><br/><p>He’s the leader of the Executioners, Arios.</p><br/><p>Masayuki was confused due to the appearance of an unfamiliar man. He’s not able to catch up with the situation completely.</p><br/><p>However, Venom who was guarding Masayuki immediately responds to the situation.</p><br/><p>「Well done, as expected from Masayuki. I have been vigilant, but sorry!</p><br/><p>I couldn’t grasp any presence of that guy at all. Masayuki, you noticed him well.」</p><br/><p>Saying those words, Venom came in front of Masayuki.</p><br/><p>Without noticing that Masayuki who heard it was turning pale.</p><br/><p>In fact, Venom was always scanning for any presences while guarding Masayuki.</p><br/><p>It didn’t mean he let down his vigilant, but he couldn’t catch the enemy’s presence at all. In other words, the man in front of him was a very dangerous person.</p><br/><p>「I don’t know what your purpose it, but if you want to lay your hand on Masayuki, I’ll be your opponent. It’s alright, Masayuki?」</p><br/><p>「Eh? Ah, yes――」</p><br/><p>Masayuki nods instinctively.</p><br/><p>In the first place, Masayuki thinks that’s unreasonable for him to fight the enemy.</p><br/><p>If Venom wanted to take his place, there’s no reason for him to refuse.</p><br/><p>And, to Masyuki who was still confused, he heard reliable voices.</p><br/><p>「Masayuki an-chan, we also here! We will show growth here!」</p><br/><p>「If Masayuki-san watching, we can be relieved too!」</p><br/><p>「Onii-chan, please see Alice and co’s efforts!」</p><br/><p>Masayuki worried about how to reply to the children.</p><br/><p>He was wondering of letting the children to fight in this trip.</p><br/><p>(But, the children are actually stronger than me…… It can’t be helped right!)</p><br/><p>In the end, he decided to approve them.</p><br/><p>「Well, how long do you intend to groping my chest?」</p><br/><p>Masayuki jumped back panicking at that word.</p><br/><p>「I-I’m sorry. It-it’s not on purpose……」</p><br/><p>Masayuki can’t make a good excuse, but his word is interrupted by Hinata.</p><br/><p>「I understand. On the contrary, I want to thank you. That man was aiming at me right?」</p><br/><p>That said, Hinata was thanking Masayuki.</p><br/><p>(Well, I didn’t aim for it …… I feeling relieved of what happened though…..)</p><br/><p>He wanted to say that, but Masayuki felt that destruction was waiting for him if he said it, he had no choice but to kept silent.</p><br/><p>Actually, Arios’ target was Hinata.</p><br/><p>The reason was one.</p><br/><p>It was because Yuuki used to be worried about Hinata before.</p><br/><p>Although she was not special existence anymore, he was still anxious.</p><br/><p>He thought he should deal with her quickly as she was not a person worthy enough for him to kill.</p><br/><p>However, as he knew Reiner and co’s plan, he tried to assassinate Hinata during the gap.</p><br/><p>Velda declared that don’t aim at the royal capital, he didn’t want to interfere as much as possible but――</p><br/><p>Reiner failed.</p><br/><p>Therefore, he thought that he would assassinate her in an instant and immediately withdraw.</p><br/><p>However, He failed.</p><br/><p>Masayuki’s luck had thwarted the timing of Arios’s plan.</p><br/><p>「It’s can’t be helped for things to be like this. Sadly, I’ll have everyone dead!」</p><br/><p>「Shut up! I’m strong, you know? We have Masayuki here too!」</p><br/><p>Venom responded to Arios’ statement fearlessly.</p><br/><p>And so, the fight started quietly.</p><br/>\n</div>"}