{"title": "Chapter 227 – Labyrinth’s Encroachment Part 2", "id": 227, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-227-%E2%80%93-labyrinth%E2%80%99s-encroachment-part-2", "volume_title": "Volume 3", "body": "<h1>Chapter 227 – Labyrinth’s Encroachment Part 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Labyrinth’s Encroachment Part 2</p><br/><p>A control room was located on the lowest floor of the labyrinth.</p><br/><p>The room, which could be called as the center of the labyrinth, was made to manage everything inside the labyrinth.</p><br/><p>A big monitor was installed at the center of the room, showing the appearances of Zero and co in combat inside the labyrinth.</p><br/><p>The inside of the control room had been remodeled with decorations that have no particular meaning and there were also devices and such that kept blinking.</p><br/><p>「It started heh.」</p><br/><p>「Yeah. Everything is going as planned――」</p><br/><p>Ramiris nods to Benimaru’s mutters.</p><br/><p>Ramiris is sitting on a luxurious chair which made exclusively for her personal use, taking a contemplative pose of putting her clasped hands in front of her chin.[1]</p><br/><p>Benimaru stands on her right side, looking at the screen keenly.</p><br/><p>Although the two people are conversing as if their atmosphere is serious……</p><br/><p>「Don’t fool around, do your work!」</p><br/><p>Shuna hits Benimaru’s head with a folded fan in her hand.</p><br/><p>「Ouch! Hey, it’s hurts if it’s folded! Don’t you have any gentleness for your beloved older brother!?」</p><br/><p>「There’s none. That kind of thing is unimportant, please do your job seriously!」</p><br/><p>Shuna cut him down in single hit.</p><br/><p>There’s another person who supporting Shuna with their words.</p><br/><p>That person is Beretta.</p><br/><p>「Why are you fooling around, Ramiris-sama…… If you don’t stop, I will report this to Rimuru-sama, you know?」</p><br/><p>「Wai! You, what are you talking about! I’m being serious~!」</p><br/><p>Ramiris panicking after hearing Beretta’s tsukkomi.</p><br/><p>She stops doing her competitive behavior and starting to explain in panic.</p><br/><p>「You too, Benimaru. It’s not time for playing around, a very serious crisis is approaching, be more conscious……」</p><br/><p>Scolded by Souei, Benimaru meekly nods.</p><br/><p>Although he and Ramiris are enjoying themselves with the atmosphere…… it seems to be taken negatively by the serious people.</p><br/><p>(This is because these guys are not playful……)</p><br/><p>(Hey. I only playing around a bit, I wish Rimuru wasn’t mad at me……)</p><br/><p>Their gaze intersect, Benimaru and Ramiris are communicating their inner feelings.</p><br/><p>However, they can read the mood and so they decided to stop playing anymore.</p><br/><p>In fact, the situation is unsatisfactory.</p><br/><p>The floors that have been invaded so far by the enemy are displayed on the big screen.</p><br/><p>According to the display, the enemy is fighting the boss of the 50th floor currently.</p><br/><p>With a terrifying speed, the enemy broke all of the past records.</p><br/><p>In such critical situation, Benimaru and Ramiris still have time for their behavior.</p><br/><p>Which isn’t surprising……</p><br/><p>A little while ago, an order from Rimuru had reached Benimaru.</p><br/><p>Rimuru conveyed the enemy’s predicted goal and the countermeasures.</p><br/><p>As for defending the labyrinth, Benimaru and the others[2] are not needed.</p><br/><p>To this matter, Ramiris and Zegion agreed, intercepting the intruder by themselves is decided unanimously.</p><br/><p>Benimaru presents everybody’s intentions to Rimuru who still anxious about the labyrinth war potentials.</p><br/><p>And then, from Rimuru, ‘Defend the labyrinth till the end!’ such order was received.</p><br/><p>Benimaru still hasn’t recovered from the exhaustion after his fight with Kazaream, but there’s no worry about that.</p><br/><p>After all, it’s due to the thick density of the magic essence inside the labyrinth which beyond comparison from the outside. Noticeably, he can feel that his energy is recovering.</p><br/><p>Moreover, probably because he released magic essences to the limit once, he has a hunch that he can take in the energy of『Turn Null』while becoming more used to it.</p><br/><p>Filling and mixing it while emptying the container little by little, in a sense replenishing magic essence at the same time.</p><br/><p>(Huff! Like this, I think I can considerably control this energy!)</p><br/><p>The top group of the defense war potential of the labyrinth is still alive, in the worst case; Benimaru might also need to go too.</p><br/><p>Prediction of the enemy’s action can be made, and the war potentials are alive.</p><br/><p>There’s no factor to be uneasy of.</p><br/><p>「Well. Then, should we work seriously now?</p><br/><p>Ramiris-sama, what is the percentage of the labyrinth that has been eroded by that guy currently?」</p><br/><p>「That’s right…… right now, it’s 15% I think. There’s still more to spare!」</p><br/><p>「Understood. So, when Gozurl and Mezurl on the 50th floor are defeated, do we commence the strategy?」</p><br/><p>「Well. As my preparations will be done with just a bit more, it’ll be the right time.」</p><br/><p>「Then, we will start.」</p><br/><p>After such exchange, Benimaru began to issue instructions regarding the specific strategy.</p><br/><p>Ramiris also resumes her work.</p><br/><p>Gozurl and Mezurl who were defeated easily are revived on the lowest floor.</p><br/><p>And then they come to the control room ashamed.</p><br/><p>「Good work! Well, please rest at ease.」</p><br/><p>「We’re very sorry, we have no excuse to offer, Benimaru-sama. We wanted to exhaust the enemy even a bit though……」</p><br/><p>「We are not even an obstacle to that guy……」</p><br/><p>「Don’t mind it. You guys aren’t weak, it's just those guys are strong.</p><br/><p>Be relieved as everything is as planned.」</p><br/><p>Gozurl and Mezurl who hanged their heads in front of Benimaru seem to have been relieved a little when they heard those words.</p><br/><p>With meek faces, they sit on the reserved chairs.</p><br/><p>At the same time――</p><br/><p>「Well then. As planned, the strategy will start! Everyone, on your position!!</p><br/><p>The strategy will be put into action now.</p><br/><p>And then, at the time of the retrieval of the Demon Golem (Demon Lord Protector Colossus), the strategy will shift to its second stage.</p><br/><p>Everything is as planned. Everyone, accomplish your own work without rushing! Leave the rest to the combat group!!」</p><br/><p>Benimaru ordered so.</p><br/><p>Tension runs through to the Ramiris’ subordinates, the Dragon Kings and the operator, the dryads with Trainee as their leader.</p><br/><p>「Well then, Ramiris-sama. I shall depart too.」</p><br/><p>Beretta respectfully told Ramiris.</p><br/><p>「Ok! You can lose, but dying is not permitted!」</p><br/><p>「Fufufu, what a joke. If I lost so many times, then I’ll be branded as a loser. I’ll surely triumph this time.」</p><br/><p>Leaving behind those words, Beretta immediately teleport away.</p><br/><p>Then, he already stood by Zegion’s side.</p><br/><p>And so, the battle inside the labyrinth slowly intensifies……</p><br/><p> −−−−−−−−−−−−−−−−−−−−−−−−−−</p><br/><p>The guardian of the 60th floor is the Demon Golem.</p><br/><p>It received order to eliminate the intruder, showing its overwhelming destructive power, it’s a violence machine.</p><br/><p>Modified by Gadra-roushi, it’s equipped with various weapons; its viciousness is nothing like before.</p><br/><p>However, in front of Dino and co, even with its power, stalling the enemy didn’t come true.</p><br/><p>「Geez, it’s so much trouble……this thing is stupidly strong……」</p><br/><p>「Rather than that, why doesn’t it vanish as light particles?</p><br/><p>Just probably though…… This golem won’t revive, right…..?」</p><br/><p>「It won’t I guess. Oh well, even if it did, it’s not a threat anyway.</p><br/><p>But if it’s about this thing is troublesome, I’d agree.」</p><br/><p>To Dino’s grumble, Pico and Garasha respond respectively.</p><br/><p>Indeed, Dino thinks that it’s absurd for Golem which is an artificial object to revive, but recalling Ramiris’ wicked smile, there was an uneasiness which makes Dino unable to deny it.</p><br/><p>(If it’s that person, it might be possible……)</p><br/><p>It’s not Ramiris who has the power to be a threat, but that can’t be said with the other people in the labyrinth.</p><br/><p>Not to mention, their threat level are beyond imagination with the bestowed immortality inside Ramiris’ controlled area.</p><br/><p>Besides, Ramiris’ ability is unreasonable, it won’t be strange if she was able to grant the effect even to an artificial being.</p><br/><p>From Dino’s point of view, Ramiris’『Labyrinth Creation』 was such a threat.</p><br/><p>「However, the enemy was suddenly gone. From floor 61, I’m sure that ghost type enemy would come out in swarms, right? 」</p><br/><p>「That’s true. I sighted low-class wraiths, but they’re only small fry…… In that case, the upper floors were more troublesome, right?」</p><br/><p>As Pico and Garasha said, they can’t see any appearance of enemies after they defeated the Demon Golem and descended a floor below.</p><br/><p>But, Zero knew the reason why. That’s because Adalman and co went outside to intercept Dagruel, which Zero witnessed himself.</p><br/><p>Because there’s no reason to tell it, Zero keeps his silence.</p><br/><p>「Oh well, maybe because of that. Perhaps, they went to intercept Dagruel I guess.」</p><br/><p>Dino carelessly said the correct answer.</p><br/><p>Zero hears it, he thought that he needs to raise his evaluation of Dino a bit.</p><br/><p>Zero thought that Dino is a foolish guy, but he’s surprised due to Dino’s sharpness in the situational awareness.</p><br/><p>「Eh, did that means all monsters from here on were outside? Can you do such a thing?」</p><br/><p>「Rather than that…… Using the monsters living inside the labyrinth as an army…… Honesty, isn’t that a foul play?」</p><br/><p>「I dunno, don’t say it to me. Say your complains to Rimuru!」</p><br/><p>Because enemies won’t come out, Dino and co have such free time to have such talkative quarrel.</p><br/><p>Zero who indifferently watched them, opened his mouth.</p><br/><p>「You guys, listen.</p><br/><p>I’m going to return to the 60th floor, I’ll concentrate in my work to steal the authority of this labyrinth.</p><br/><p>Even now I have eroded the labyrinth as we travelled, but only about 15% taken by me and it’s not advancing.</p><br/><p>However, I succeeded in containing the transfer function.</p><br/><p>Above the 60th floor has become my area.</p><br/><p>However, it will take time to erode 61th floor and below.</p><br/><p>As the way things are going, it won’t progress well.</p><br/><p>I leave the rest to you guys, rampage as much as you can and earn me time.」</p><br/><p>Zero was able to analyze mostly of the enemy’s war potential.</p><br/><p>As he attacking with a small group of people, there’s no fear of the group being divided into parts.</p><br/><p>It would be the suitable time soon.</p><br/><p>With the roots of his ability stretched around since the time he entered, he succeeded in stealing a part of the authority of the labyrinth’s power.</p><br/><p>After that he thought to concentrate himself in eroding the labyrinth and finish this mission quickly.</p><br/><p>Shutting down the teleport means that a direct attack to Zero inside the labyrinth becomes impossible.</p><br/><p>Then, he judged that by letting Dino and co advance and rampaging around, in that opportunity he would be able to concentrate in taking over the control of the labyrinth.</p><br/><p>「Ahh, leave it to me!」</p><br/><p>Dino responded powerfully to Zero’s words.</p><br/><p>Zero nods to the answer, he says「Rampage as much as you want」and then he turned his back.</p><br/><p>Zero returns to the 60th floor’s boss room while confirming the safety of the surroundings.</p><br/><p>And then, he unleashes the ability of the completed and evolved Ultimate Skill『Evil Dragon Lord Azi Dahaka』and begins the encroachment of the labyrinth.</p><br/><p>In order to usurp the labyrinth complexly.</p><br/><p>『Evil Dragon Lord Azi Dahaka』has the ability to make clones infinitely by spreading its roots to the ground, but it was originally ability of『Energy Absorption』 on the surroundings.</p><br/><p>It assimilates into surroundings’ natural environment, and make it possible to regenerate himself infinitely as part of the nature.</p><br/><p>That’s, the truth of Ultimate Skill『Evil Dragon Lord Azi Dahaka』 and its correct usage.</p><br/><p>The environment that has its energy sucked up empty will be ruined and destroyed.</p><br/><p>By assimilating to this labyrinth, he will plunder the authority of the labyrinth.</p><br/><p>If he does so, Zero will be able to steal the power of Ramiris’『Labyrinth Creation』.</p><br/><p>Even in case he fails, he could cancel the authority and nullify it.</p><br/><p>Then, at his side has four strong people of awakened Demon Lord Class, they would be superior in fighting power, so was Zero’s calculation.</p><br/><p>(In the worst case, I will suck up the energy of this labyrinth and destroy it</p><br/><p>Then, in any case, the enemy doesn’t have refuge. They will hastily flee and rounded up by Mai’s concentrated attack. Although, if I finish assimilating with this labyrinth, I won’t let the enemy escape――）</p><br/><p>Zero is convinced of the victory.</p><br/><p>Zero thought that immortality inside the labyrinth is troublesome, and by manipulating the dimension and space making it impossible for an army to capture the labyrinth is invincible.</p><br/><p>However, if ability of the labyrinth is sealed off, it’s Zero’s side’s turn to invade.</p><br/><p>He didn’t think that it’s funny that Dino and co so abnormally wary inside the labyrinth.</p><br/><p>Certainly, it’s a dangerous ability.</p><br/><p>However, for Zero, the more dangerous the labyrinth is, greater the power as the reward after he deprives it.</p><br/><p>(Velda-sama, it’s our victory!)</p><br/><p>Zero sits with his legs crossed and concentrated his mind on eroding the labyrinth.</p><br/><p>The three people go ahead, leaving Zero behind.</p><br/><p>Although Dino declared his reply impressively to Zero, inside his mind is……</p><br/><p>(Idiot. From the start, don’t expect someone else to help your work and such.</p><br/><p>But, I can’t even run away from Velda-sama’s side……</p><br/><p>Because there’s a thing with Rimuru too, I can’t do careless action……</p><br/><p>Ahhhh how troublesomeーーー!!）</p><br/><p>So, various conflicts jumbled together.</p><br/><p>Consequently, with that gloomy Zero gone, it becomes very refreshing.</p><br/><p>Dino and co felt uneasy due to being observed so much.</p><br/><p>In either case, escaping was already impossible.</p><br/><p>Dino and co give up and go to the other side.</p><br/><p>「Hey~, isn’t that guy is super strict! Who do he think he is?」</p><br/><p>「That’s right. Ordering us self-importantly, to be frank, I hate it. Why did you do exactly what he told you to do, Dino?」</p><br/><p>「Right right! Dino, please beat that guy!」</p><br/><p>「Yeah. If you kill that guy, we will cooperate so it will not be exposed Velda-sama, you know?」</p><br/><p>‘That guy you mention, is Zero you know!?’ so Dino thought while laughing vaguely to dodge the issue.</p><br/><p>There’s no way to not be exposed, and to be honest, it’s troublesome.</p><br/><p>With this and that, Dino and co arrives at the 70th floor.</p><br/><p>However, that place is naturally empty……</p><br/><p>「As expected, Adalman has gone to the battlefield.</p><br/><p>It would be troublesome if that guy remain here, aren’t we lucky?」</p><br/><p>Dino thinks positively.</p><br/><p>Pico and Garasha also agree and then they go ahead.</p><br/><p>However, even below floor 71th, no enemies appear.</p><br/><p>「Isn’t this strange? This place should be the paradise of the insect type monster though……」</p><br/><p>When Dino says his doubt――</p><br/><p>『Hoohohohoho! You came, Dino.</p><br/><p>You had betrayed me not a long ago, I will make you regret it now!!』</p><br/><p>Ramiris’s loud laughter echoed in the surroundings, suddenly, the structure of the floor changes.</p><br/><p>And then 4 shadows appeared.</p><br/><p>Gabil, Gerudo, Beretta and then Zegion.</p><br/><p>Those 4 are the one who appear to meet Dino and Co.</p><br/><p>「Tch. They come out as expected heh――」</p><br/><p>Dino looked up above and saw Zegion.</p><br/><p>『Eh? Dino, you guys are only three people?』</p><br/><p>Ramiris asked Dino.</p><br/><p>In Dino’s eyes who looking at Ramiris who waiting for answer, he saw Ramiris being projected with stereoscopic imaging.</p><br/><p>(She does such elaborate action for weird stuff……)</p><br/><p>‘Oh well whatever’ so he sighs,</p><br/><p>「One person is late due to his business.」</p><br/><p>So, Dino replied indifferently.</p><br/><p>Besides,『Hmm.』 and nodding, Ramiris drops a bombshell statement.</p><br/><p>『Well then, Dino’s opponents are Zegion and Beretta heh~』</p><br/><p>So.</p><br/><p>’What did she say?’ Dino fails to understand it.</p><br/><p>But, when her words reach his brain, he understands the meaning.</p><br/><p>「Don’t joke around, you idiot!! Like hell I could win!!」</p><br/><p>Dino’s scream who understands the meaning of Ramiris’ words echoed inside the labyrinth.</p><br/><p>[1] For those who didn’t realize what Ramiris doing, she’s doing Gendo Pose.</p><br/><p>[2] Meant for those who went outside Tempest and not present and defending Tempest from the start like Gabil and Gerudo.</p><br/>\n</div>"}