{"title": "Chapter 257", "id": 257, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-257", "volume_title": "Volume 3", "body": "<h1>Chapter 257</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>My message was shown on the c.o.c.kpit’s monitor.</p><br/><p>It seems like the aviation transmission decoder is reporting that to the captain with a pale face. I can perfectly grasp the situation with my Spatial Grasp.</p><br/><p>I also let them know that I am aware of the c.o.c.kpit’s situation.</p><br/><p>As expected of the aviation warrior elites.</p><br/><p>They moved exactly as I had predicted. A smile appeared on their faces-as if to show that they were excited because this boring flight turned into something fun.</p><div></div><br/><p>More than anything, using my name was important.</p><br/><p>It was an order from the top of the top of their companies.</p><br/><p>Of course they would be in high spirits.</p><br/><p>After that, things progressed smoothly.</p><br/><p>“Hyaaahhaaaa! You see, I am in need of some strong subordinates. You people, you young and talented people! If you become my subordinate, I will spare your liiiiiveeess!!”</p><br/><p>I understand you’re completely on board with this but can’t you do something about how you talk?</p><br/><p>If he keeps on doing this every time and if by chance someone were to know that he is my underling……</p><br/><p>No, let’s not think of something so far ahead.</p><br/><p>More importantly, I should enjoy this moment.</p><br/><p>“Y-you b.a.s.t.a.r.d! To do this to an honourable teacher of Tempest Development of Human Resources Academy—Guhaa?!”</p><br/><p>A brave teacher challenged Laplace as he was getting too excited.</p><br/><p>But, needless to say, he was beaten up.</p><br/><p>The teachers are more or less brilliant but even the head of the year is about A rank at most.</p><br/><p>Normal teachers like these are of about B or A rank so there’s no way they could win against Laplace.</p><br/><p>That teacher has good prospects. It would be troublesome if he were to quit so I guess I will go visit him later with some gifts.</p><br/><p>“Fuffuuuunn~ I am the strongest! Did you think you could win against me with just that? Naive~ Naive, naive, naiveee!”</p><br/><p>Laplace got pa.s.sionate with his acting.</p><br/><p>He was glancing towards me, as if he wanted compliments or something.</p><br/><p>I hurriedly averted my gaze.</p><br/><p>That idiot, what does he plan on doing if they know we are allies? On top of that, the sign he slightly made with his hand was saying that he wanted more chips as reward. It is true that his acting is quite good but what a cheeky little brat.</p><br/><p>And well, I was exasperated by Laplace but the same couldn’t be said of the other pa.s.sengers.</p><br/><p>They were just about to panic.</p><br/><p>However—-</p><br/><p>“Alriiightt, stopp! I just checked up right now but it looks like there are quite a few students aboard, huh? Captain, how about we kidnap these kids this time? Even if we kidnap that old man over there…… doesn’t feel like he will be of any use even if we train him from now.”</p><br/><p>Tia, eh?</p><br/><p>It seems like she came over to this side after the linking with the ship was done.</p><br/><p>In the end, no more fights broke out on the ship.</p><br/><p>Because Tia came in with two pa.s.sed out ride conductors.</p><br/><p>They were actually acting pa.s.sed out.</p><br/><p>As even B rank experts were no match for them, even the academy’s teacher group gave up.</p><br/><p>After all, there’s a fear of the ship itself getting destroyed if a serious fight broke out.</p><br/><p>They probably made their decision considering that.</p><br/><p>And like that, they obeyed Laplace and the students got on Laplace’s ship.</p><br/><p>“Listen here now, don’t you kids go around and be riotous on the ship, alright? If you do, I will be supeer angry, you know!”</p><br/><p>That’s probably him being serious.</p><br/><p>This ship is extremely precious to Laplace. He probably would rampage immaturely if even the insides of the ship got damaged.</p><br/><p>Or rather, I am impressed he even agreed to using this ship. It seems like there are more reasons behind it other than the letter of marque I suggested… ah, he was probably intimidated by Diablo.</p><br/><p>Laplace was aware that he had a hard time dealing with Diablo so he probably went for the letter of marque rather than trying to defy him.</p><br/><p>If so, then I should think that this situation is completely within Diablo’s prediction.</p><br/><p>As expected of Diablo-seems like he read my movement quite accurately.</p><br/><p>After this and that, the students all got on board Laplace’s ship.</p><br/><p>Even the ones from the luxurious rooms. It looks like Tia went ahead and made them shut up beforehand.</p><br/><p>And like this, just as I had expected, we succeeded in getting everyone related to the academies on Laplace’s ship and headed towards Maldorando island.</p><br/><p>By the way, this is what happened on the ship after we had left.</p><br/><p>“—We are extremely sorry for the commotion. The air pirates just now were just a side show our leader, Rimuru Tempest had thought up of. It was planned to have the pa.s.sengers feel a stimulation on this boring flight. Moreover, we haven’t let the people related to the academies know of this to have them learn how to deal with emergencies. We are extremely sorry for the troubles-”</p><br/><p>Such a broadcast was circulated.</p><br/><p>With this, the pa.s.sengers’ anxiety and fear was rubbed off and a sense of relief brought on a feeling of excitement for them.</p><br/><p>There was no complaints as my name was said.</p><br/><p>Well, there was no damage or problems either so…</p><br/><p>It can’t be helped if people a.s.sociate this incident with the rioting Laplace later on.</p><br/><p>If that time comes, I swore to myself to declare that they are copycat criminals.</p><br/><p>—-Besides, them a.s.sociating this relation is also within calculations. After all, it would turn out to be an implicit threat that Rimuru-sama won’t permit anyone else to fly these skies—-</p><br/><p>I felt like someone chuckled a bit but I guess it’s just me imagining things.</p><br/>\n</div>"}