{"title": "Chapter 251", "id": 251, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-251", "volume_title": "Volume 3", "body": "<h1>Chapter 251</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Slime</p><br/><p>Chapter 258 Side Chapter – Rimuru’s Elegant Escape Plan – 02</p><br/><p>Now that I could relax a bit, I decided to observe my surroundings.</p><br/><p>Just like the conductor had said, there are many students on board.</p><br/><p>As there are a lot of exchange students all year round, about 20% of the Tempest Airline’s customers were students.</p><div></div><br/><p>The system of getting exchange students started after the thought of reviving the three academies by taking in each other’s good parts.</p><br/><p>After all, education policy in each of the academies differ from each other, so I decided it would be best to have this exchange in order to broaden one’s outlook.</p><br/><p>At the Tempest Human Resource Development Academy, we have the curriculum of training one’s mental and physical condition, on top of education, to make them into an immediate a.s.set.</p><br/><p>It seems that in the Ingracia Synthesis Academy they are teaching the culture, social etiquettes of n.o.bles and economics on top of the general education programs this world had before.</p><br/><p>At NNU Magic and Science Investigation Academy, they are mainly focusing on research and investigating fusing other worlds’ science with magic to create new techniques everyday. It is a famous but strict academy which requires a high level of talent from the students and evicts anyone who is deemed talentless.</p><br/><p>The reason Mai is affiliated with this academy is because it develops the most cutting edge tech officially. But in reality, the actual cutting edge tech is being developed deep within the labyrinth but only an extremely small number of people know of it.</p><br/><p>Now then, these are the three academies at this point but what most of them generally do is learn the basics from Ingracia kingdom and then transfer to any of the other academies which suit them.</p><br/><p>If you want to train yourself and be of use to the world, you go to Tempest.</p><br/><p>If you want to deepen your knowledge about a particular field, you go to NNU.</p><br/><p>If you want to use human resources and bear the responsibility of making living harmonious for the people, you stay in Ingracia.</p><br/><p>To be honest, there is no age limit when it comes to getting admitted to NNU or Tempest but only the talented people can get in. The reason for this was simple-if they don’t have the required talent, they simply can’t follow the lectures.</p><br/><p>This is why I came up with the exchange student system.</p><br/><p>With this, you can experience each of the academies before deciding about your future.</p><br/><p>The other reason behind the exchange student system is to readmit the students who can’t keep up with the lectures of Tempest or NNU back to Ingracia Academy.</p><br/><p>It is all up to the students, whether they want to get better or stay down.</p><br/><p>If they work hard and actually do get better, they can get admitted to Tempest once again.</p><br/><p>But if they were to stay down, that is as far they go.</p><br/><p>There’s the repeating a grade system in Ingracia’s academy but only up to two times.</p><br/><p>It is because the country bears all the education cost, students who don’t have any will to study are expelled.</p><br/><p>Although there were no superiority between the academies once a student graduates, it is generally acknowledged that the Tempest graduates are well-built in physique and the NNU were the brains.</p><br/><p>And based on that, it was generally accepted by the public that graduating from Ingracia’s academy was easier.</p><br/><p>And because of these reasons, the planes are used pretty much every month by students to move between Ingracia and Tempest.</p><br/><p>Although the conductor thought I am one of those students, it is actually convenient for me that way for the time being.</p><br/><p>And so, I feigned ignorance and continued my observation.</p><br/><p>“Like I said, why do I have to use the same seats as these poor people?”</p><br/><p>“You are absolutely correct, Julius-sama. However, it is decided by the academy so please overlook it this time-”</p><br/><p>“Hmm, I understand. But, still. Couldn’t the academy prepare a better ship than this?”</p><br/><p>“That’s right, Julius-sama. This is also proof that the academy is taking us, the n.o.bles, lightly. I must ask my father and restrain the academy!”</p><br/><p>“That’s exactly right! At that time, please let me help, as well!”</p><br/><p>While I was gazing from the rear seat, a noisy bunch came in crowding into the general seats section.</p><br/><p>They were wearing cla.s.sy clothes so they probably came from Ingracia’s academy.</p><br/><p>Although the Ingracia kingdom changed its name to Ingracia College Town, it seems like the previous n.o.bles can’t shake off their n.o.ble feeling.</p><br/><p>It is a problem seeing how there are people who still look down on Tempest as a city of demi-humans or monsters and scorn NNU, saying the Empire is uncivilized and what not…</p><br/><p>The tall, smug-looking guy seems to be called Julius. Judging from the fact that he is still a student, he has probably not inherited his family’s leadership yet.</p><br/><p>And the person trying to b.u.t.ter up to him was a well-dressed guard knight. Although uncouth, he seemed like a sincere guy. The guard was probably the n.o.ble kid’s aide who is now acting alongside him as the n.o.ble kid is now a student.</p><br/><p>As he isn’t carrying any weapons because it would stand out here, I am guessing he is a knight from his demeanor. There’s a rule to keep all weapons of the customers in custody.</p><br/><p>Well, there are many loopholes but I can’t be bothered to think about it all. The conductor will handle things if something were to happen but generally, one needs to take care of themselves, after all.</p><br/><p>If one doesn’t bother other pa.s.sengers, those things are overlooked to a certain extent.</p><br/><p>Other than the n.o.ble guy, there were two n.o.ble girls and a butler for each.</p><br/><p>The girls were wearing the girls’ student uniform. However, the butlers were wearing custom made-to-order battle uniforms.</p><br/><p>Although they looked like normal butler uniform, they were made from special fabric for fighting, just like the conductor’s. They are probably ordered to protect their masters, the n.o.ble girls. They were more or less strong-about ‘C+’ in rank, I would say.</p><br/><p>These kids seem like quite the elite.</p><br/><p>But, what’s with students having butlers?</p><br/><p>It feels a bit too overprotective considering that they set out to learn to be independent. Well, this world can be quite dangerous so I guess the parents would be worried.</p><br/><p>There were mixed reviews about this but the academy decided to tolerate it.</p><br/><p>Well, leaving that aside.</p><br/><p>These students… did they just say ‘couldn’t prepare a better ship than this’?!</p><br/><p>And to also insult the academy-these kids are very c.o.c.ky.</p><br/><p>That’s not something you should be saying considering that Tempest is a.s.sisting the three academies from its taxes.</p><br/><p>I got a bit irritated and shifted my gaze towards them.</p><br/><p>As I did that, I noticed that the other students were also not taking it well.</p><br/><p>I mean, of course they would not.</p><br/><p>It’s the worst pattern-to be complaining even though you’re studying for free.</p><br/><p>Even if these kids were n.o.bles, inside the academy, there is an ironclad rule saying that they were all equal. Although we are tolerating them bringing along guards and butlers, we are definitely not going to allow partiality towards them…</p><br/><p>It looks like their sense of being the chosen people isn’t fading…</p><br/><p>“Oi, you guys, that’s enough! ‘Being poor or rich is completely dependent on the family and it does not affect the student’s skill’-that’s the common ideal between all the academies, you know?!”</p><br/><p>A red-haired youngster couldn’t tolerate it anymore and raised his voice. In response to that, the young man called Julius made a scorning expression and said over his shoulder,</p><br/><p>“Hah, to think the likes of you stinking beasts would come directly talking to me. What blasphemy.”</p><br/><p>“Oi?!”</p><br/><p>Reacting to Julius, a few other students stood up.</p><br/><p>They seem to be students of Tempest as they had prominent characteristics like monsters or demi-humans.</p><br/><p>It is only natural for them to be angry but… hmm, what should I do?</p><br/><p>It’s sad seeing people like these exist even 8 years after completing the academies. These things are not reported to me but it seems like there’s a need to conduct an internal audit.</p><br/><p>“You guys, what are you doing?! Just sit down already!”</p><br/><p>Just when I started pondering on what to do about the situation, a bald man came in and shouted.</p><br/><p>He seems like one of the teachers and couldn’t overlook this commotion.</p><br/><p>I thought the teacher at least wouldn’t discriminate but…</p><br/><p>“Julius-sama, I will punish these students so please spare them. And also, I negotiated with the crew to move you to the high cla.s.s section as there’s a s.p.a.ce empty because someone cancelled. Please move there.”</p><br/><p>And like that, he started being toady to Julius.</p><br/><p>And the moment that teacher came in, the Tempest students looked down as if they had given up.</p><br/><p>Seems like they gave up early thinking that they can’t win against a teacher.</p><br/><p>“What is with that guy…”</p><br/><p>I ended up muttering out.</p><br/><p>“Oho, that’s thoughtful of you. However, I can’t really expect much if someone cancelled on it.”</p><br/><p>“That is true but it will surely be better than here.”</p><br/><p>“Hahahaha. I guess I will have to show face if Mr. Jujilas says so much. Well then, guys, let’s go.”</p><br/><p>Saying that, the Julius party left.</p><br/><p>That cancelled room is probably the one I was going to use.</p><br/><p>I guess they are treating it as cancelled since I didn’t show up on time…</p><br/><p>At situations like these, it is completely the pa.s.senger’s responsibility and so they won’t return my 10 gold coins.</p><br/><p>‘Should I go and drive them out?’-I even ended up thinking something like that.</p><br/><p>But, if I were to do that, things would get troublesome and there’s a chance of my ident.i.ty getting revealed so I won’t, though.</p><br/><p>But, what did he call that guy again? Jujilas? That guy is getting fired.</p><br/><p>The management of the Ingracia Synthesis Academy is not under my jurisdiction but Tempest is supporting them with huge sums of money. With my authority, firing such a teacher will be a peace of cake.</p><br/><p>“You, is this seat empty?”</p><br/><p>Someone came asking me, while I was enraged at that teacher.</p><br/><p>“Eh? Ahh, it is.”</p><br/><p>Saying that, I shifted towards the side.</p><br/><p>And so he happily sat beside me.</p><br/><p>“Hey there. You ended up having to see that, didn’t you? I haven’t seen you before so you are entering the academy first time this year, right? The whole academy isn’t like that-just that there’s an old-fashioned fraction like that still remaining. We are also bothered by them. But, people like those are very few so I am sure a lotta fun things are waiting for you! So I want you to not have a weird preconception about it.”</p><br/><p>Just as he sat, he started talking to me.</p><br/><p>This guy is wearing an NNU uniform so he’s probably from a different academy than Julius before. But it seems like he knows him.</p><br/><p>He also probably heard me there and this might be his way of following up.</p><br/><p>“Is that so? Well, are you having fun?”</p><br/><p>I thought about introducing myself but giving my real name would be bad.</p><br/><p>So for now, I plan on leaving things as they are if he doesn’t introduce himself.</p><br/><p>Thinking that, I asked the question.</p><br/><p>I wanted to know his true opinion for research as it might be helpful later.</p><br/><p>After all, it would be easy to have him talk since we are both students.</p><br/><p>But it seems like he didn’t expect such a question since he looked surprised.</p><br/><p>“Aha, ahahaha! You’re interesting. My name is Magnus. I might not look like it but I am a fourth year student of NNU Magic and Science Investigation Academy.”</p><br/><p>I don’t know what he found so interesting but he burst out in laughter.</p><br/><p>Since he introduced himself, it would look weird if I did not.</p><br/><p>“Ah, my name is Satoru. I am heading to Ingracia to take care of something.”</p><br/><p>“Hmm, Satoru-kun, eh? Or is it Satoru-chan?”</p><br/><p>“Well, I would prefer -kun.”</p><br/><p>“Got~it! So, you are also in the academy-”</p><br/><p>The student who introduced himself as Magnus came talking to me over-familiarly.</p><br/><p>He seems refreshing but it is kinda concerning how overly friendly he is being.</p><br/><p>It is also a bit unpleasant how he casually comes invading my personal s.p.a.ce. I don’t need to worry about being directly touched as I have a ‘multidimensional barrier’ up unconsciously but…</p><br/><p>How should I explain this… like, he has this self-important att.i.tude?</p><br/><p>He probably doesn’t have experience of getting rejected as he’s talented.</p><br/><p>“Hey you, you’re acting too friendly with Magnus-sama!”</p><br/><p>I had been feeling it too but it seems that that is how it looked to others, as well.</p><br/><p>But, it is upsetting how she says it, making it sound like I am the one being too friendly.</p><br/><p>“Now, now, Rozari. This is Satoru-chan. He’s a new student enrolling this year. I was just about to ask him where he plans to get in to.”</p><br/><p>Don’t joke around with me, I told you to use -kun, didn’t I?</p><br/><p>Looks like he is quite the confident type who doesn’t really listen to others.</p><br/><p>“But this kid… despite being less than a student who hasn’t even enrolled yet, isn’t he being too cheeky to a senpai?”</p><br/><p>The female student called Rozari came b.u.t.ting into our conversation, judging me as cheeky.</p><br/><p>Well, that’s fine and all but I don’t see any reason for them to be so self-important by being senpai when I haven’t even enrolled yet.</p><br/><p>“Cheeky… now listen here…”</p><br/><p>“Hmm. The only people allowed to talk to me are fourth year students. Either that, or people who are within rank 100 based on results. I am not someone people like you can speak to. If you understand then give up your seat already!”</p><br/><p>Looks like she doesn’t plan on listening to me at all and acted like she was driving out a dog.</p><br/><p>She probably wants the seat next to Magnus.</p><br/><p>She probably likes him or something and I am in the way.</p><br/><p>This is extremely bothersome.</p><br/><p>“Even if you were to talk about being a senpai and what not, it doesn’t matter to me as I am not even a student yet. Besides, I couldn’t care less if you are a fourth year student or whatever. I don’t plan on giving up this seat so you better get lost.”</p><br/><p>To my reply, Rozari began shaking in anger.</p><br/><p>And then left, saying ‘you will regret this’ and giving me a scornful glance.</p><br/><p>The general age at which students get enrolled to the academies is around 15, when the body is complete. It is normal to increase one’s fundamental academic skills at a near educational inst.i.tute until then.</p><br/><p>There’s an admission exam, so if one can pa.s.s that, they can enter the academy.</p><br/><p>The highest grade is the 6th year grade so one would have quite the merit if they are in the fourth year.</p><br/><p>And so it’s not like I don’t understand why she was being so pompous but I can’t accept the att.i.tude of looking down on others.</p><br/><p>“Oho, you can sure talk!”</p><br/><p>“That n.o.ble, and now that woman and her meaningless pompousness, is the academy really okay?”</p><br/><p>“Ahahaha. Well, it does hurt when you say it like that. I mean, you are considered an elite if you graduate from the academy, right? And so the people who rank high in results tend to be very arrogant. She isn’t a bad kid.”</p><br/><p>“Hmm, I guess that needs to be fixed as well.”</p><br/><p>“-Eh?”</p><br/><p>“Nothing.”</p><br/><p>I aborted the conversation to dodge the topic.</p><br/><p>These kids are like problem children themselves.</p><br/><p>Who knows what kind of problems my Tempest Development of Human Resources Academy is facing.</p><br/><p>It’s a relief that that red-haired student had his ideals right but it is also a concern because he is being too docile. However, since there are some discriminating even among the teachers, this is a huge problem.</p><br/><p>If there are students and teachers like these all over the academy, I can’t help but think there’s someone intently wanting me to know about this so that I can eliminate the corruption…</p><br/><p>Right, for example-</p><br/><p><i>&gt;</i></p><br/><p><i>Eh, *fuming*……?</i></p><br/><p><i>It is true that I doubted this might be one of Ciel’s scheme but she went and dodged the question before I even asked.</i></p><br/><p><i>But, I too am learning. Judging from how she said that, she isn’t denying it.</i></p><br/><p><i>‘I didn’t do it’-she isn’t declaring that. That was the moment I started doubting Ciel-san even more.</i></p><br/><p><i>&gt;</i></p><br/><p><i>Eh?! You had a right to remain silent? That’s the first I am hearing of it…</i></p><br/><p><i>Well, that’s fine.</i></p><br/><p><i>I do feel like that itself is like an answer.</i></p><br/><p><i>Besides, this isn’t something I can neglect.</i></p><br/><p><i>&lt;well, then?=””&gt;&gt;&lt;/well,&gt;</i></p><br/><p><i>Yeah, it seems like I might need to take some drastic measures.</i></p><br/><p><i>&gt;</i></p><br/><p><i>Then, is there an unpopulated island on this flight route? With a lower level of danger, if possible.</i></p><br/><p><i>&gt;</i></p><br/><p><i>Lower cla.s.s demon lord seed?!</i></p><br/><p><i>That’s danger level low?-or so I thought but it seems like Ciel-san is also annoyed by the students’ att.i.tude.</i></p><br/><p><i>I guess it’s fine. It’s a bother, so that island will do.</i></p><br/><p><i>I thought of a plan to give the pep talk.</i></p><br/><p><i>Arrogant people who can’t rid their n.o.ble-like feeling.</i></p><br/><p><i>Overconfident youngsters.</i></p><br/><p><i>Even with a sense of justice, too docile youngsters.</i></p><br/><p><i>There’s a problem with every one of them.</i></p><br/><p><i>The teacher is out of the question as his disposal is confirmed but I would like to believe that the students can be rectified.</i></p><br/><p><i>And for that…</i></p><br/><p><i>I guess I will ask for cooperation from the person who probably knows my situation at the moment. And while I am at it, might as drag in the idle ones.</i></p><br/><p><i>&gt;</i></p><br/><p><i>And like that, I got to know of the inside situation of the academy and decided on going forward with a plan to improve it.</i></p><br/><p><i>10 days until the forum.</i></p><br/><p><i>The question is, whether I will be able to rectify these guys without letting them find out who I am.</i></p><br/><p><i>Looks like first time in a while, it’s time for the teacher part of me to take the stage.</i></p><br/><p><i>While thinking of a plan to reform these distorted students, I was feeling excited.</i></p><br/><p><i>And then, I contacted the only person who knew about my movement.</i></p><br/><p><i>Proofreader’s Notes: Didn’t I see this plot in Gilligan’s Island? ? Ciel is awesome. ?</i></p><br/><p><i>Proofreader: Userunfriendly.</i></p><br/>\n</div>"}