{"title": "Chapter 256", "id": 256, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-256", "volume_title": "Volume 3", "body": "<h1>Chapter 256</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>They made Laplace shut up and gave him the job of kidnapping the students with the air pirate ship.</p><br/><p>“As I thought, you’re planning on using my ship-”</p><br/><p>“This is a message from Rimuru-sama but… he said if you’re able to complete the mission, he would even prepare a letter of marque-”</p><br/><p>“I will do it! Please leave it to me!”</p><br/><p>Laplace’s whole face was lit up with a smile and he took Tia and happily rushed out.</p><div></div><br/><p>It would be better to limit the use of Spatial travel so that Milim doesn’t notice. Souei had already decided that this mission would best fitted for Laplace when Souei received the mission from Rimuru at first.</p><br/><p>However, it was their blunder that they didn’t know there was such a rage among airships currently.</p><br/><p>Diablo and Souei reflected on that on the inside.</p><br/><p>And after that, the two of them began discussing about the second objective.</p><br/><p>It had been a while after the ship had taken off.</p><br/><p>Although the duration of flight is affected by the weather, the plane would arrive at Ingracia Academy City within 10 hours.</p><br/><p>However, this time, a certain event will soon commence.</p><br/><p>And exactly when I was thinking of that, Laplace came.</p><br/><p>The announcer had announced that the plane was now entering a state of emergency.</p><br/><p>Magnus kept on talking to me frequently so Laplace really saved me.</p><br/><p>Why do I need to tell this guy about my favourite food or hobby and stuff?</p><br/><p>He isn’t trying to hit on me, is he?</p><br/><p>I don’t think so ’cause I look very plain now as I was wearing round spectacles, a mask and also had black hair.</p><br/><p>Well, I guess it doesn’t really matter since Laplace is here.</p><br/><p>After all, starting now, he won’t have the leeway to be hitting on people.</p><br/><p>“Hyaaahhaaaa!! This ship is now under the rule of the air pirates-Greed Circus!! Cry, scream and despair as you please!”</p><br/><p>A cheerful voice echoed inside the ship.</p><br/><p>Laplace, that b.a.s.t.a.r.d, looks like he’s enjoying this to the fullest.</p><br/><p>He wanted a letter of marque because he wanted to do this, eh?</p><br/><p>Well, it doesn’t really matter as it won’t really affect me.</p><br/><p>He won’t dare attack any of the Tempest Airline’s ships and it isn’t really fun seeing the ships the other countries develop emerge into the sky.</p><br/><p>For what it matters, I have already confiscated all the techniques related to airships from the Empire.</p><br/><p>It was among one of the conditions to acknowledge the Empire as independent. After all, I would like the monopoly of the sky to remain under Tempest.</p><br/><p>Although I don’t think it will ever happen but, to prevent the usage of airships in wars between countries, this matter was one of the highest importance.</p><br/><p>After all, if you were to get rid of the skies among sky, land, and the sethere’s only limited area where you can fight.</p><br/><p>Although I don’t think there are any idiots out there who would come picking a fight with us, it would be difficult to stop other countries from fighting amongst each other. We can be the mediators but intruding in their problems even before a war breaks out would only buy their animosity.</p><br/><p>And when I thought about it considering all that, to have those wars not affect any civilians, removing flying forces would be the most effective.</p><br/><p>Airships are inventions which completely change the concept of wars. And because of this, there was a need for us to keep it to ourselves.</p><br/><p>As such, there was also a need to crush the airship-related inventions made by other countries. And so I was thinking of coming up with something to stop that. So if I were to just leave it to Laplace, he would happily do these tasks.</p><br/><p>All that’s left is to make sure they don’t find out I am the one behind this. I should be careful to not leave any evidence behind.</p><br/><p>While thinking of such things, I was observing the course of events.</p><br/><p>“You can rest easy. I will protect you!”</p><br/><p>This Magnus dude took my hand and said so without even feeling the least bit embarra.s.sed.</p><br/><p>What’s this, what’s this?!-I felt like shouting that out loud.</p><br/><p>What ‘you can rest easy, I will protect’, huh?</p><br/><p>Don’t s.h.i.t around with me, you idiot. In the first place, I told you I’m a guy.</p><br/><p>My heart is undoubtedly that of a guy. This Magnus dude really doesn’t listen to other people.</p><br/><p>I ended up grumbling about him. I guess I will let it rest since I didn’t say it out loud.</p><br/><p>Putting Magnus aside, I should go and do my job.</p><br/><p>A jolt raced through the ship, signifying that Laplace’s ship had connected.</p><br/><p>The c.o.c.kpit is probably in a state of panic right about now.</p><br/><p>First, let’s rest at ease.</p><br/><p>I predicted such situations to occur and installed emergency transmission devices in every ship.</p><br/><p>I brought out a ‘sticky steel string’ from my fingertip and promptly connected to one of those devices.</p><br/><p>With this, I can produce letters on the monitor using transmission codes.</p><br/><p>It would have been easy if I used ‘Thought Transmission’ but……</p><br/><p>I decided to not use skills which leave traces behind as much as possible but this is turning out to be quite difficult.</p><br/><p>Or so I am complaining but actually, I installed these devices ’cause I wanted to enjoy moments like these.</p><br/><p>I am glad they are coming in handy. I will keep it a secret that I am having fun feeling like a spy.</p><br/>\n</div>"}