{"title": "Chapter 267", "id": 267, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-267", "volume_title": "Volume 3", "body": "<h1>Chapter 267</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>George sneered at Mondo-kun’s excuse.</p><br/><p><span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-671\"></span>Certainly, if he gets hungry and laments easily, you can’t really expect him to hold his fights for long. But still, like he says, he might shine in power.<span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-673\"></span></p><br/><p>At the very least, it is a big plus point that his resistance is high.</p><br/><p>It seems like his body can resist neurotoxins so if he trains that part, he might have an interesting growth.</p><br/><p>“Well, what are we going to do?”</p><br/><p>A while after going into the forest, George gathered the group mates and asked.</p><br/><p>George was this group’s leader.</p><br/><p>“Shall we search for a water place first?”</p><br/><p><span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-672\"></span><span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-674\"></span></p><br/><p>“Right~ the instructors were saying that too. Securing water is of utmost importance. I can see water coming into the forest from the mountains so let’s head there~”</p><br/><p>Marsha answered and Aina agreed.</p><br/><p>And so, we started walking towards the water place–in other words, the river.</p><br/><p>◇◇◇</p><br/><p>“Hyaahha–! Fishing here is the best~!”</p><br/><p>The one who raised that excited voice was, me.</p><br/><p>I was having a really good time fishing.</p><br/><p>About how it got like this–</p><br/><p> </p><div class=\"code-block code-block-1\"></div><br/><p>We secured water and used magic to see if it was drinkable.</p><br/><p>It had slight toxins and parasitic magical insects but was perfectly dealt with boiling magic.</p><br/><p>George and the other 3 are from NNU Magic and Science Investigation Academy and so they are a bit weak at battle magic. But on the other hand, it seems they were doing research to improve lifestyle magic and so surprisingly enough, we were able to procure water quite efficiently.</p><br/><p>We could make water with magic too but it’s always better to have another supply.</p><br/><p>We were lucky to secure water.</p><br/><p>Moreover,</p><br/><p>“Alright, perfect!”</p><br/><p>Marsha grinned.</p><br/><p>Who would have thought, this Marsha girl is a user of &lt;Space Expansion&gt; while still being a 4th year.</p><br/><p>This is the lesser version of &lt;Space Storage&gt; and can only increase the capacity. However, space-type magic are extremely difficult so being able to use even this is praiseworthy.</p><br/><p>When compared to &lt;Transition Magic&gt; which is already developed as techniques, this &lt;Space Expansion&gt; is much harder as it’s still being researched.</p><br/><p>Even just this proves that this Marsha girl has potential.</p><br/><p>George and Mondo frantically scooped up the water and Aina purified it with magic.</p><br/><p>And Marsha kept on putting purified water into the ordinary survival flasks.</p><br/><p>That had good coordination considering how much they were complaining.</p><br/><p>And, as for me–</p><br/><p>“Ah, you can’t use magic, right, Satoru-kun? You don’t seem like you have much stamina either so could you search this area for any edible food?”</p><br/><p> </p><div class=\"code-block code-block-7\">Translations by AsianHobbyist Website</div><br/><p>George told me.</p><br/><p>By this area, he meant as far as their eyes could see.</p><br/><p>I am not a kid so I don’t plan on going away alone anyway but…</p><br/><p>It seems like from their eyes, I am still quite young.</p><br/><p>What is this treatment? I am pretty sure I have set my appearance as a 15 year old.</p><br/><p>But either way, it’s no use complaining so I decided to do what I could.</p><br/><p>—As such, I attached a string to a tree branch and made a simple fishing tackle.</p><br/><p>At times like this, clothes with threads come in handy. I am producing the strings by my own but this way I can easily deceive them.</p><br/><p>As for the bait, I used the insects under the waterside rocks.</p><br/><p>Insects which come up in your house are enemies, a target for annihilation, a subject for hatred but–it’s weird how I can go around searching for insects myself in places like these.</p><div class=\"code-block code-block-12\"></div><br/><p>I even disassembled the trap which the instructors gave us in case a harmful monster came up. And then I used it as a net to put the fish I catch in.</p><br/><p>My preparations are perfect.</p><br/><p>And like this, I prepared the tools and bait and started fishing.</p><br/><p>“What are you doing?”</p><br/><p>Marsha asked.</p><br/><p>It seems like their job of collecting water is done.</p><br/><p>When I looked at the other 3, I found them lying down, exhausted.</p><br/><p>Their stamina and mana probably ran out.</p><br/><p>“Fishing. I was wondering if I could catch a few fishes and have them for dinner.”</p><br/><p>I had already caught about 30.</p><br/><p>Seems like this fishing place is really good as no one else has fished here before.</p><br/><p>It’s my own personal record–catching 20 fishes in an hour.</p><br/><p>“Fishing? Sounds interesting! Can I do it too?”</p><br/><p> </p><div class=\"code-block code-block-5\">Translations by AsianHobbyist Website</div><br/><p>She asked with glittering eyes so I handed over the tools and showed her the basics.</p><br/><p>It seems Marsha had never gone fishing before and was very interested.</p><br/><p>After teaching her for a while, I told her to try it herself and she had immediately gotten enthusiastic about it.</p><br/><p>She’s quite something considering that the other 3 are exhausted and she is fine despite the fact that she used the most mana.</p><br/><p>While giving her advice, I started making a second fishing rod–</p><br/><p>Or I wanted to but…</p><br/><p>By the time I was finished, Aina came by and by the time I had finished the 3rd one, George came and participated too.</p><br/><p>At the end, even Mondo wanted to fish so the total amount of fish I caught that day was stopped at 33.</p><br/><p>But still, not only did we secure water, the total amount of fish we caught was 104.</p><br/><p>One could say this is more than enough.</p><br/><p>But while returning, Marsha used &lt;space compression&gt; on the whole net and Aina used weight limit magic on it. Then George and Mondo did the physical labor of carrying it. I have decided to not think about how all the fish we caught would have gone to waste if they hadn’t done all that.</p><br/><p>All’s well that ends well.</p><br/><p>And like this, the first day of harvesting in the forest had come to an end.</p><br/><p>Proofreader’s Notes: Remember the first episode of “No Game No Life”? Sora was snacking on CalorieMate.</p><br/><p>Proofreader’s Notes: Tia is actually Tear. This was my mistake, as Tear didn’t have a big role in the WN. (she has a bigger role in the anime and LN) Besides, Tia is Romanji for Tear.</p><br/><p>Proofreader: Userunfriendly.</p><br/>\n</div>"}