{"title": "Chapter 264", "id": 264, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-264", "volume_title": "Volume 3", "body": "<h1>Chapter 264</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 262 Side chapter – Rimuru’s Elegant Escape – 06</p><br/><p>Julius’ coming forward as the leader, whether it was good or bad…</p><br/><p>Either way, a roll-call was done and they pa.s.sed food to everyone.</p><br/><p>“Getting dragged in even though you’re not even a student yet… tough luck.”</p><br/><p>One of the instructors pa.s.sed me the food saying that but… the food was so simple that it even made me long for CalorieMate.</p><div></div><br/><p>The food was in a pack for carrying, made mainly for when conquering the Labyrinth.</p><br/><p>It’s commonly referred to as ‘ration'(battle food).</p><br/><p>The instructor was called Irina and she was a researcher in NNU Magic and Science Investigation Academy.</p><br/><p>The battle type instructors and students were careful and had at least a day’s worth of energy food with them but the research students weren’t that prepared.</p><br/><p>And so, amongst all that, this Irina brought out these ‘rations’ from her ‘s.p.a.ce Storage’.</p><br/><p>It seems she was researching the pa.s.sing of time inside the ‘storage s.p.a.ce’ and had a lot of food in it.</p><br/><p>But unfortunately, the time in ‘storage s.p.a.ce’ is the same as normal if it’s used with magic or ability.</p><br/><p>However, if one were to put food in a sterilized storage s.p.a.ce without any germ in it, there’s no chance of it getting spoiled.</p><br/><p>Even then, the ultimate conclusion we reached was that complete preservation was impossible due to insufficient processing and various other reasons.</p><br/><p>Actually, my ‘imaginary s.p.a.ce’ can preserve things in it perfectly as it’s not ruled by time but we’re not talking about that right now.</p><br/><p>Not only the ration, all the food everyone had on them was collected and was managed by Julius’ group.</p><br/><p>And with that, 3 days worth of food supply was gathered, considering 2 meals a day for everyone.</p><br/><p>It seems that the food supply the battle type people were carrying came in handy and provided some leeway.</p><br/><p>Apart from the taste, it had proper nutrition.</p><br/><p>Something can be done about water by magic so for now, n.o.body will be dying of starvation during this one week.</p><br/><p>As I was having my somewhat sweet but not delicious food, a good smell came drifting my way.</p><br/><p>It was from Julius’ group.</p><br/><p>Those guys, despite this situation, they had prepared a table and chairs and were having an elegant lunch.</p><br/><p>That too was cooked in a simple cooking set and served like in a top restaurant.</p><br/><p>“Julius-sama, the quality of the food will be subpar due to the circ.u.mstances. Please, forgive me.”</p><br/><p>“Hm, it can’t be helped. Although I am reluctant, I do understand that I have to be the model for the people.”</p><br/><p>“Thank you very much for your kind words.”</p><br/><p>While sucking on the ration, I stared at them, exasperated.</p><br/><p>The butler apologizing to Julius was the student Maria’s escort, if I am not wrong. Yep, that’s probably it considering that they’re sitting on the same table.</p><br/><p>Other than them, there’s also a boy and another girl sitting there, with both of their butlers serving as well.</p><br/><p>As if they were in a different world.</p><br/><p>I had a boat load of things I wanted to say to him like where they got those food or that this is the time to be working together or if they actually knew what they’re talking about, but for now, there’s one thing I understood well and it’s that this guy really can’t read the atmosphere.</p><br/><p>Karma looked annoyed and Magnus just gave a bitter smile while looking towards Julius.</p><br/><p>Normally they would probably flare up at him but the situation was so bad that they didn’t even have the willpower to complain.</p><br/><p>“Looks so good. This much isn’t really enough for me……”</p><br/><p>Beside me, a fat student let out a sad sigh.</p><br/><p>Judging from his fat, that amount of food is certainly quite sad.</p><br/><p>“Don’t complain! This has been optimised to have the perfect nutrition balance and makes you feel full, you know?”</p><br/><p>A girl beside him scolded him for whining.</p><br/><p>That’s exactly right. Although the taste isn’t very good, this ration is a top quality product.</p><br/><p>“Hmm. But, you know, I am a battle type too so… That kind of deception doesn’t work for me……”</p><br/><p>The boy repeatedly sighed.</p><br/><p>It seems he was trained against illusions and neurotoxins so the effect which had some merit to him was also ineffective now.</p><br/><p>It might be that he’s just being gluttonous but it sure is pretty rough when there’s a limit to how much you can eat.</p><br/><p>“It’s half-eaten but do you want some of mine?”</p><br/><p>And so I offered him mine but…</p><br/><p>“Eh, is it okay? Then, uwah-”</p><br/><p>“Ah! Mondo-kun, you okay? I will have a look at you so come here.”</p><br/><p>A branch suddenly came falling directly onto this Mondo kid’s head.</p><br/><p>Mondo was now being held up by instructor Pyuri, who had pretty, silver hair.</p><br/><p>“Oi, is he alright?”</p><br/><p>“Ah, ehh, you are?”</p><br/><p>“Ah, I am Satoru. I am just a normal person who got caught up-”</p><br/><p>“Eh, umm. Satoru-kun, eh? He is fine so you don’t need to worry, okay? Ah, right, in situations like this, I think it’s not good to give your food to others, you know?”</p><br/><p>She said, after hesitating for a moment there.</p><br/><p>Is she thinking of me as impertinous or is she really worried as an instructor?</p><br/>\n</div>"}