{"title": "Chapter 261", "id": 261, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-261", "volume_title": "Volume 3", "body": "<h1>Chapter 261</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Notice: Undefined variable: zoom_front_end in /home/xiaoxiao/public_html/wp-content/plugins/zoom-widget/zoom.php on line 386</p><br/><p>Chapter 261 Side chapter – Rimuru’s Elegant Escape – 05</p><br/><p>The students left behind had various reactions.</p><br/><p>Majority of the students broke down in despair.</p><br/><p>I guess it isn’t that weird that they fell into a state of panic and disorder since the people they had been relying on, the instructors, didn’t stand a chance.</p><br/><p>However, a portion of the students took the initiative and started gathering to confirm what kind of items they had at hand.</p><div></div><br/><p>Moreover, it seems the non-combat instructors also hadn’t forgotten about their professional duty.</p><br/><p>“The instructors’ conditions have stabilized. We couldn’t confirm any after-effects of the fight nor any curse type spell traces. They will probably wake up after a day’s worth of rest.”</p><br/><p>The doctor was a silver-haired pretty woman.</p><br/><p>She was very calm and acted without forgetting about her job.</p><br/><p>She laid down the 4 instructors defeated by Laplace and brought out her emergency aid kit.</p><br/><p>She also brought out a blanket from her ‘s.p.a.ce Storage’ and was also careful about hygiene.</p><br/><p>As expected of a Tempest Development of Human Resources (Tempest DHR from now on) instructor.</p><br/><p>By the way, although the pa.s.sengers’ belongings are checked when they are getting on the plane, these ‘s.p.a.ce storages’ are not subject to it.</p><br/><p>And as a matter of fact, checking it would be a ha.s.sle.</p><br/><p>Or rather, the current state was such that the guards would stay silent unless someone is carrying a weapon clearly.</p><br/><p>The reason behind this is simple-a person who is actually strong, will be strong bare handed as well. I decided that it wasn’t worth fussing over a weapon that much.</p><br/><p>The belonging inspection is just for face, what’s actually important is spreading the information that using skills or magic inside the plane is forbidden.</p><br/><p>And for that, I made the system which monitors the usage of magic or skills inside the place perfect.</p><br/><p>The magic canceller which was being researched in the Empire has been downsized and installed in all parts of the plane. With this, no one can use magic inside the plane.</p><br/><p>Although, it is also true that for people like me, who can use magic freely without intonation, it doesn’t seem to work.</p><br/><p>However, the downsized magic jammer is proving to be a very useful monitoring device. It can detect a distortion in s.p.a.ce due to mana tremors.</p><br/><p>Not only can it detect normal magic use, it can also detect when one uses ‘s.p.a.ce Storage’ or ‘Spatial Travel’ and it has more uses other than its original purpose.</p><br/><p>Thanks to that, it is possible arrest someone who performs a forbidden act inside the plane instantly.</p><br/><p>Ah, I got off tracked there.</p><br/><p>And because of these reasons, the beautiful silver haired doctor could carry her work-related tools with ‘s.p.a.ce Storage’.</p><br/><p>It seems she also had a simple tent with her which she promptly started setting up.</p><br/><p>A few students helped and a quite big sized tent was made within a very short amount of time.</p><br/><p>One could say that a field hospital has been set-up here.</p><br/><p>And if I were to also add, by this moment, the doctor’s score had crossed 20.</p><br/><p>It was clear that a.s.sisting actions were much more effective in scoring points than fighting against monsters. That in itself goes to show that how important helping each other is here rather than acting by oneself but who knows how many of them have realized.</p><br/><p>As far as I could tell, only the students who helped looked like they had realized that.</p><br/><p>Although the survival had just started, I was extremely interested in how the students would act depending on the situation during this one week.</p><br/><p>The doctor wasn’t the only one who took quick action.</p><br/><p>Even the research instructor who is a member of the research laboratory was loyal to his duty.</p><br/><p>This one seems to be affiliated to the NNU Magic Science Investigation Academy (NNU MSIA from now on).</p><br/><p>“It seems we can’t contact the outside world. There is probably a high density magic storm covering the whole island. If the storm were to be blown away with a strong magic from an edge of the island, we might be able to make contact temporarily……”</p><br/><p>He too was calm and simply explained the grave situation.</p><br/><p>I could already spot a few students break down in tears as they were hoping to make contact with the outside world now that Laplace was gone.</p><br/><p>Although I do feel pity for them, this is also a test. I need them to try their best.</p><br/><p>Putting that aside, this instructor…</p><br/><p>Was he planning on making the students realize the situation by going out of his way to state the graveness of it?</p><br/><p>Can one actually inversely become calm being in a close to panicky situation knowing that it is unlikely for help to come?</p><br/><p>While I am not certain if he aimed for it or not, although there are students who looked to be saddened, there weren’t any students acting rashly.</p><br/><p>Besides, there’s a way.</p><br/><p>It seems the portion of the students who were skilled thought up of a plan after listening to that instructor’s explanation.</p><br/><p>“In other words, we just have to find the point where the magic storm is the weakest at the edge of the island. On top of that, everyone other than the communication team will keep trying to make it possible to make contact, is that correct?”</p><br/><p>NNU’s student-Rosalie, asked the instructor a question as the representative of the rest.</p><br/><p>Without answering, the instructor contemplated.</p><br/><p>“Hmmm…… Whether that’s possible or not, I can’t say for sure. Just that that is one of the options we have on the table. If we are to wait in this situation where our connection with the outside world has been cut off, we only have two choices-either to abide by this Greed Circus’ saying or go against it. Just think of it like this-another option has been added to that, which is asking for help within the week. Either way, you will have to believe in your judgement.”</p><br/><p>He finished saying, sounding indifferent.</p><br/><p>Rather than telling them the answer, he probably wants to entrust this to the students’ free will.</p><br/><p>Quite the guts this instructor has, to be able to do that under these circ.u.mstances.</p><br/><p>Amongst all that, an Ingracia Synthesis Academy instructor spoke up.</p><br/><p>“I have just finished a.n.a.lyzing the performance of this bracelet. It seems to be an item made by high-level magic techniques. It also has features enabling us to communicate among ourselves and view our stats. It’s structure resembles that of parasitic monsters so it will be difficult to remove.”</p><br/><p>He started announcing the result of the parasite bracelet a.n.a.lysis.</p><br/><p>He seems to be quite the skilled instructor, as he also noticed the hidden function.</p><br/><p>This communication function in the bracelet makes it possible to communicate between 6 people in total and he’s pretty good if he was able to find that out.</p><br/><p>Well, they would know immediately once they actually use it, though.</p><br/>\n</div>"}