{"title": "Chapter 273", "id": 273, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-273", "volume_title": "Volume 3", "body": "<h1>Chapter 273</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Diablo did the same in a black shirt and pants.</p><br/><p><span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-671\"></span>However.<span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-673\"></span></p><br/><p>And this was true of Souei and Diablo’s clothes, the material was high-quality material that had magic threads made in Tempest, woven into the fabric. They were so expensive, that most onlookers would go pale just imagining how much they would cost.</p><br/><p>On top of that, they also wore accessories that were imbued with ultra-advanced magic, and it was hard to imagine a more extravagant way to dress while walking outside.</p><br/><p>However, it wasn’t the clothes they wore that was drawing attention.</p><br/><p>The main reason was clear, once it was noted that the ratio of men and women staring at them favored women quite heavily.</p><br/><p>To put it plainly, they were two very handsome men that were walking.</p><br/><p>“They are looking at us. They are so rude.”</p><br/><p>Normally there was not a single person with a death wish in the central office who would dare look straight at Diablo.</p><br/><p>Be they civil officer or even military officer, all would kneel and look down when passing him in the hallway.</p><br/><p><span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-672\"></span>Indeed, there were only a handful of individuals aside from the ones higher up who could take a casual attitude around Diablo.<span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-674\"></span></p><br/><p>“Don’t let it bother you. It’s just that your clothes stick out too much.”</p><br/><p>“What are you saying. I am all in black and look very plain…”</p><br/><p>Souei ignored Diablo’s grumbling, but Diablo was not satisfied.</p><br/><p>He had prepared his most plain clothing because they would be going out into the city in secret. And so it was only normal for him to be annoyed at the suggestion that he was drawing too much attention.</p><br/><p>(There will be a punishment when we return.)</p><br/><p>He decided, even though he couldn’t even remember the face of the person in charge of his clothes. Still, this was not enough to calm his annoyance.</p><br/><p> </p><div class=\"code-block code-block-1\"></div><br/><p>“I know! What if we recognize the action of staring at us as aggression, and have them all killed…”</p><br/><p>“Don’t do that. This is why I didn’t want to come here with you.”</p><br/><p>Diablo had made this suggestion very happily, but Souei callously rejected it.</p><br/><p>And so they continued to be stared at by residents until they reached their destination.</p><br/><p>Tempest Development of Human Resources Academy–</p><br/><p>It was Tempest’s central education facility that was built under Rimuru’s sponsorship.</p><br/><p>And this place was one of the best educational facilities and was one of the three great schools of the world.</p><br/><p>Rimuru had ordered that Souei investigate it, and Diablo had come along as well.</p><br/><p> </p><div class=\"code-block code-block-7\">Translations by AsianHobbyist Website</div><br/><p>They were in front of the gate now, and Souei was talking with someone.</p><br/><p>Diablo began to look around aimlessly, and then he spotted a strange group of people.</p><br/><p>They wore matching white robes and had hoods that covered their faces.</p><br/><p>They seemed to have a detection blocking effect as well, and he could not tell what their races or abilities were.</p><br/><p>Demon Lord Milim’s ‘Dragon Eye’ would have been able to see through it without a problem, but Diablo’s ‘Demon Eye’ did not allow him to pry deeper.</p><br/><p>(Hmph, how boring.)</p><br/><p>Diablo said with annoyance.</p><br/><p>Diablo was hardly a perfectionist, and he had his subordinate, Moss to gather information for him. But still, having people who he could not detect standing right in front of him was a problem that he could not ignore.</p><br/><p>As Rimuru had released information, the magic in this country had advanced greatly.</p><br/><p>Because of this, anti-devil weaponry had also been improved, and now the demons could no longer feel completely safe, even though they were the strongest race.</p><br/><p>These days, if you just had the money, it was possible to acquire weapons that were the equivalent of Legend grade.</p><br/><p>Even this was still inconsequential to Diablo. But the fact that there was now concealment magic that exceeded his own on the market, was something he couldn’t just leave.</p><br/><p>That being said, Diablo was currently pretending to be human and only using one-hundredth of his magic. His abilities had dropped accordingly, and his power now was a far cry from what it usually was…</p><br/><p>Diablo’s ‘Demon Eye’ was also affected by his magic, so comparing it to Rimuru or Milim, whose powers did not depend on it, was not exactly fair.</p><br/><p>But that wasn’t an excuse for Diablo. He did not like this at all.</p><br/><p>(The wearers are estimated to be holy knight level. But they acquired Legend weapons and gained power. Something like that…)</p><br/><p>They were not strong enough for him to be cautious.</p><br/><p>Even now, if Diablo took them head-on, he could kill all of them in less than a minute.</p><br/><p>But still, something about this irritated him. It had to do with the atmosphere that oozed out from the group.</p><div class=\"code-block code-block-5\"></div><br/><p>Diablo was about to take a step forward, but someone grabbed his shoulder with a ‘Don’t.’</p><br/><p>“You try to cause trouble the moment that I take my eyes off of you.”</p><br/><p>Souei said with exasperation.</p><br/><p>“Hehehe. No, that’s just not true. Those people were unsettling, so I thought I might talk to them…”</p><br/><p>“That is what I mean by ‘causing problems.’”</p><br/><p>Souei said and shook his head.</p><br/><p>However, he knew that this would happen the moment that Diablo had started to talk about coming with him, and so while he was exasperated, he did not complain.</p><br/><p>Souei glanced at the group that Diablo had indicated but continued to talk calmly without the faintest change in expression.</p><br/><p>“We got a message from Moss. He arrived safely and contacted a magic teacher from the Ingracia Academy called William Roaz, who was cooperating as a spy.”</p><br/>\n</div>"}