{"title": "Chapter 279", "id": 279, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-279", "volume_title": "Volume 3", "body": "<h1>Chapter 279</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>She already had enough points, and so I had asked for her help.</p><br/><p><span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-671\"></span><span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-673\"></span></p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“I…as you know, am not very good at cooking…”</p><br/><p>She seemed worried, but it was no problem.</p><br/><p>What I was going to ask Marsha was not cooking, but a new type of magic experiment.</p><br/><p>I thought that her talent for magic was genuine, and so I wanted to use this opportunity to perform an experiment that I had thought of.</p><br/><p>Besides, if I needed any help, there was also an instructor who was healing from an injury that I could ask.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Alright, I’ll be back once at midday.”</p><br/><p>“Leave the firewood to me!”</p><br/><p>“See you later!”</p><br/><p><span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-672\"></span><span class=\"ezoic-adpicker-ad\" id=\"ezoic-pub-ad-placeholder-674\"></span></p><br/><p>So saying, the three of them set out.</p><br/><p>Now, it was time to start preparing the food.</p><br/><p>As I had caught the monster alive, the meat would be very fresh.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>I asked the combat supervisor, who had recovered from an injury, to remove the blood and process the meat.</p><br/><p>There was something awe-inspiring about watching it happen.</p><br/><p>If I wanted to–well, I could perform it in auto-mode with Ciel’s help, but I didn’t want to draw any attention.</p><br/><p>I just want to make it very clear, it had nothing to do with my sore muscle.</p><br/><p>You could say that the instructor’s efforts were a huge help.</p><br/><p>On the first day, we had done a fish barbecue, but today we would have meat skewers.</p><br/><p>I added some wild vegetables that looked highly nutritious along with the meat as I skewered them.</p><br/><p>Then I sprinkled some of the prepared salt over them and finished it off with some ground up grass on top.</p><br/><p>Now I just had to cook them.</p><br/><p>To be honest, it looked quite delicious already.</p><br/><p>After all, I had used ‘Appraisal’ to find out the right amount of salt and adjust the flavor with the herbs.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>This meant that under the circumstances, it was in the best possible state.</p><br/><p>However, I was not finished yet.</p><br/><p>The main dish would be the soup I was making now, through boiling the bones.</p><div class=\"code-block code-block-1\"></div><br/><p>“How is it?”</p><br/><p>I asked Marsha.</p><br/><p>And then–</p><br/><p>“I can’t believe it… How…there is no magic depletion, so how is it possible to control magic with such accuracy for a long period of time!?”</p><br/><p>She replied with much excitement.</p><br/><p>It seems to have worked. I gloated inwardly.</p><br/><p>I actually wanted to test it myself, but that was just not possible. My identity needed to stay hidden, and it wouldn’t make sense for me to teach new types of magic when I wasn’t even a student.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>And so.</p><br/><p>I had Old William become my assistant.</p><br/><p>Well, I asked him to be sort of an instructor.</p><br/><p>Last night, I had secretly talk with William, saying that I would have Marsha stay as a helper. That was when William would naturally start to talk to her and eventually instruct her. That was the plan.</p><br/><p>And it was going well.</p><br/><p>As for the rest…</p><br/><p>◇◇◇</p><br/><p>After I finished preparing the bones to be boiled in the large pot, I started talking to Marsha.</p><div class=\"code-block code-block-7\">Translations by AsianHobbyist .com Website. Stop reading at pirate sites like that steals translations. Check novelupdates. com for legit fan translations</div><br/><p>That was the signal to start.</p><br/><p>“Marsha, I’m sorry. But could you adjust the flames with magic?”</p><br/><p>I asked her in the most natural way.</p><br/><p>And since Marsha accepted it as planned, the adjusting of the flames while the bones were boiling became her job.</p><br/><p>But it wasn’t the easiest job.</p><br/><p>While Marsha had a lot of magical power and was good at controlling mana, you needed to be able to concentrate well in order to do it.</p><br/><p>As I watched from the side, William saw his opportunity and approached her.</p><br/><p>He called to Marsha, who was having trouble, and gave her some advice while also trying to change the subject.</p><br/><p>“Ah, that reminds me, Marsha. I have this magic item passed on to me by a friend…perhaps you will be able to use it. Do you want to give it a try?”</p><br/><p>While helping her, he casually referred to this thing as if just remembering it. Then he pulled out what appeared to be seven playing cards from his pocket.</p><br/><p>The material that they were made of was pure ‘Demon Steel.’</p><br/><p>“Master, what is this…”</p><br/><p>“This is…”</p><br/><p>William explained it to her just as I had explained it to him last night.</p><br/><p>He glanced at me several times to make sure he was getting it right, but it seemed like Marsha didn’t notice it.</p><br/><p>He was mostly right anyway, and so I gave him the okay signal.</p><br/><p>With renewed confidence, William returned to his explanation.</p><br/><p>What I had given him last night was a new type of magical device that I had devised.</p><br/><p>There were eight media cards that formed the basis.</p><br/><p>These represented the eight great attributes of the power of spirits that made this world.</p><br/><p>Light and shadow, time, and earth, water, fire, wind, and sky.</p><br/><p>What Marsha had received, was seven of those eight.</p><br/><p>Time alone could not be used by people, and so I had excluded it.</p><br/><p> </p><div class=\"code-block code-block-5\"></div><br/><p>The light could purify, nurture and regenerate.</p><div class=\"code-block code-block-9\">Translations by AsianHobbyist Website.</div><br/><p>The shadow could conceal, was psychological, and could destroy.</p><br/><p>The earth had the power to pull, break and condense.</p><br/><p>The water could solidify, stop and be released.</p><br/><p>The fire burned, accelerated and exploded.</p><br/><p>The wind was in waves, had an impact and vibrated.</p><br/><p>The sky was space, existence, and information.</p><br/><p>Like that, the media cards had primitive words that represented the different natures carved into them.</p><br/><p>And so all you needed to do was allow magic to flow into the card and will it, and it would be possible to create that effect.</p><br/><p>As the media card itself controlled the magic, the effect would not be interrupted even if the person using them became distracted.</p><br/><p>What was important was your imagination when activating the magic.</p><br/><p>You did not even need to chant.</p><br/><p>Nothing would happen if you will a shadow effect while using the light card. And while you did need to make the right choices and follow the procedures, that was just a matter of becoming familiar.</p><br/><p>I decided to call this new form of magic–Anagram Magic.</p><br/><p>Currently, it only had the most basic letters carved in, but I intended to eventually make it more complex and layered.</p><br/><p>For instance, I could combine earth-type(condense) and fire-type(explosion) and create ‘Gravity Collapse.’</p><br/>\n</div>"}