{"title": "Chapter 285", "id": 285, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-285", "volume_title": "Volume 3", "body": "<h1>Chapter 285</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Then there was only one answer left.</p><br/><p>Julius was fighting alone, without help from anyone.</p><br/><p>And like Elrick had said… No, Julius was even cleverer than what he had suggested.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>He had started up an enterprise aside from his studies without any of the nobles surrounding him realizing it.</p><br/><p>It hired people from other worlds at a high rate. And it was conducting all kinds of research in order to become a body that would give birth to new cultural activities.</p><br/><p>It was nothing short of a gamble, but it appeared that Julius had won. Not only had he increased his hidden fortune, but he had also made enough money to go against the enemy forces that tried to surround him and the other nobles.</p><br/><p>Though, this was partly due to the cooperation of the members of the Hero, Masayuki’s party, who would sometimes visit.</p><br/><p>After all, the people from other worlds that were hired were people that Masayuki had brought.</p><br/><p>It was after doing much research on all of these facts, that Diablo and Souei had visited Elrick.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Through hearing about what Julius was like as a person, they became sure that there was a discrepancy in what he showed to those around him, and what he was really thinking.</p><br/><p>They were also sure that with Julius’ personality, even if he did become the shrine to bring the Ingracia Kingdom together, he was not so foolish as to become a puppet king.</p><br/><p>They understood that he was harsh on others, but even harsher on himself.</p><br/><p>“It seems that Julius is a serious and capable person. I am sure that many people will find it uncomfortable, the day he becomes king.”</p><br/><p>“Do you mean the people of the Council? I doubt they can do anything about it yet…”</p><br/><p>As he was under the supervision of the Committee now, there was nothing that the Council, which was made of members of various nationalities, could do.</p><br/><p>Besides, the last great purge had taken out everyone who would have been good at such maneuvering.</p><br/><p>“I do wonder… But perhaps there is someone like that outside of the Council?”</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Hmm. I won’t deny the possibility.”</p><br/><p>“Of course.”</p><br/><p>Souei said grimly.</p><br/><p>In other words, it would be best to consider that this Kingdom of Ingracia was being targeted by someone.</p><br/><p>(I see. I see. This must be in the vein of the economic war that Rimuru had predicted…)</p><br/><p>They could not fight back in a war of military power.</p><br/><p>However, in terms of economic exchange, there was a possibility of standing on top of some others.</p><br/><p>Those who thought this way may have instigated such an economic war. If that were the case, the various developments now would connect into a single line.</p><br/><p>After all, this had been predicted as a path that could not be avoided while negotiating for coexistence and mutual prosperity.</p><br/><p>However, such methods would not work against Tempest…</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>If you wanted to advocate for democracy, then numbers trumped all.</p><br/><p>It would be one thing if it was only within the country, but when something like the</p><br/><p>multi-cultural Council makes decisions–It is not about a proportion of the total population or power of the country, even if things were decided by a majority in the name of such flowery words such as equality…</p><br/><p>The decision of the three schools was a good example.</p><br/><p>A vote by the majority is in no way a system of equality.</p><br/><p>A country should not be swayed by the opinions of other countries.</p><br/><p>This was why Tempest had opted for the bicameral system. It took on its own system of government that could be called a democracy under an imperial government.</p><br/><p>There was no way to take advantage of it.</p><br/><p>Then what could you do?</p><br/><p>If you wanted to target something, it would be, economic activity.</p><br/><p>Translations by AsianHobbyist .com Website. Stop reading at pirate sites like that steals translations. Check novelupdates. com for legit fan translations</p><br/><p>The only means left is to force them to accept your terms, while using your economic ties as a shield.</p><br/><p>It would take a terribly long time for this plan to work.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>And the enemy had a surprising amount of patience.</p><br/><p>And they had seen traces of those hands reaching out not to just Tempest, but deep into other countries as well.</p><br/><p>This was an opponent that should not be underestimated.</p><br/><p>(It’s been a while since I had this much fun…)</p><br/><p>Diablo had no understanding of the economy, and he didn’t care to.</p><br/><p>He was not interested.</p><br/><p>As someone who believed that you should just take what you wanted, he had no interest in money.</p><br/><p>Gold, silver, jewels. Diablo thought of such things as bait to manipulate the greed of humans.</p><br/><p>What Diablo desired in the truest sense, was not something that an object could replace.</p><br/><p>In negotiating, several conditions were laid out on a table, and both parties would discuss possible compromises. But Diablo felt that this was all pointless.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>If the person was strong enough to just flip the table over, you would need to have an equal amount of strength, or there was no way to negotiate.</p><br/><p>Diablo could not understand why some people put so much faith in the goodness or wisdom of others.</p><br/><p>Though Diablo did believe that promises had to be kept, he would never make a promise with someone who was not his equal.</p><br/><p>It was because of all of this, that Diablo could only see this economic war that humanity was waging against the Great Demon Lord Rimuru as futile.</p><br/><p>(–How foolish. Even ignoring Lord Rimuru, to try and control the world through the economy… I would never allow such a thing.)</p><br/><p>Diablo felt that anyone who could not understand this must be very foolish.</p><br/><p>“Hey. You aren’t thinking about killing everyone who is behind it now, are you?”</p><br/><p>“How dare you… I may have been on edge after being separated from Lord Rimuru, but I am quite calm now. There is no way that I would think of such a thing.”</p><br/><p>Souei had made the jab with the perfect timing. Almost as if he could read his mind.</p><br/><p>Diablo was surprised, but lightly denied it.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Translations by AsianHobbyist Website.</p><br/><p>“That’s good then. Lord Rimuru has forbidden the subjugating of others through violence.”</p><br/><p>Just like Souei said, Diablo’s beloved master, Rimuru, cared deeply for humans.</p><br/><p>And while he did not entirely avoid using his power, he tried not to use it more than was necessary against other countries.</p><br/><p>As Diablo was always close by, he could hardly be ignorant of this, and he, of course, understood it.</p><br/><p>Because of this, Diablo decided on a whim that he too would use his brain, rather than his strength, to deal with this opponent.</p><br/><p>While this may be a war to the humans, it was all a game to Diablo.</p><br/><p>Humans–weak, foolish, greedy, and yet, there were some with strong and noble souls and some who were more intelligent than demons.</p><br/><p>He was not interested in the economy, but he was interested in humans.</p><br/><p>Hehehehehe. Diablo sneered.</p><br/><p>He had a feeling that this game–this entertaining money game, was about to begin.</p><br/><p>And like that, the third day came to an end.</p><br/><p>And in turn–the tumultuous fourth day began.</p><div class=\"code-block code-block-8\" style=\"margin: 8px 0; clear: both;\"></div><br/>\n</div>"}