{"title": "Chapter 284", "id": 284, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-284", "volume_title": "Volume 3", "body": "<h1>Chapter 284</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“The best thing about the Kingdom of Ingracia was that it was safe. But that is a thing of the past. If we wish for future developments, we must invest in personnel training. Yes, just like a certain person once said.”</p><br/><p>“Oh? What person?”“The Great Demon Lord, Rimuru.”</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“I see.”</p><br/><p>“…Hmm. Indeed. Lord Rimuru did come to see the Kingdom of Ingracia once.”</p><br/><p>“Yes. There was such a time when I had so much work to do.”</p><br/><p>Diablo usually stuck very close to Rimuru, but when the great war was over, all of the leaders had flocked to him.</p><br/><p>The anger towards Rimuru for his deceit had been directed towards Diablo and not Rimuru.</p><br/><p>Even Diablo could not go against the many complaints of the leaders, and so he had no choice but to run about and deal with the aftermath.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Yes. It was during that time. I was being held responsible for what happened, but the Hero Masayuki came out with me, and I was saved. It was then that I was so lucky to have met him. Once I saw him with my own eyes…”</p><br/><p>He chuckled as if the memory was amusing to him.</p><br/><p>“I would never again think of going against him.” He said while looking Diablo straight in the eyes.</p><br/><p>After that, Elrick related what their conversation had been about.</p><br/><p>What Elrick said was this–</p><br/><p>The Kingdom of Ingracia had been built in the plains where there were fewer monsters, as it was far away from the Great Jura Forest. These favorable conditions allowed it to become a center for politics and culture, where the leaders of all the other countries came to meet.</p><br/><p>However.</p><br/><p>Now that Great Demon Lord Rimuru had unveiled a plan of coexistence and mutual prosperity, the level of danger in the Great Jura Forest had dropped dramatically.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Not only that, the country of Tempest now had improved means of transportation through a network of railways, and had developed to a point where it could be considered the current center of the world.</p><br/><p>In fact, the main headquarters of the Freedom Arbitration Committee was in Tempest.</p><br/><p>A country could no longer stand out by being safe alone, and the center of politics, culture, and finance had all moved away from the Kingdom of Ingracia.</p><br/><p>And so it was necessary for this country to have something to call it’s own.</p><br/><p>“It was something I heard 10 years ago, and years later, it became reality. Those who were able to revolutionize their way of thinking have managed to deal with it, but there are still people who believe that they are the center of the world. It is a force that is splitting the former nobles.”</p><br/><p>Those who had once sat in the center of so much splendor would find it difficult to relinquish their seats. He suggested that civil war might have erupted if the Committee was not monitoring them.</p><br/><p>“Julius is like a shrine for the conservative noble forces. He accepts their grievances and uses them to his own gain. Furthermore, he contains the revolutionaries who attempt to use force to bring about democracy. He adjusts things so that change comes slowly. Even as his older brother, I am nothing but amazed at his handiwork. Even his arrogant behavior is probably calculated. A king is not permitted to ever bow his own head. Those who want to restore the royal family would never allow it.”</p><br/><p>Erick said, bringing his story to an end.</p><br/><p>Diablo nodded and pondered on this.</p><br/><p>This meant that this Julius Prince was acting like a noble while understanding everything.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>That was why he was unable to be stopped, even if was a student now.</p><br/><p>“Well then, would the money from the royal family that he is allowed to freely use really be enough to maintain that lifestyle? Are you sure he is not receiving monetary support from somewhere?”</p><br/><p>Diablo asked.</p><br/><p>“No. He is very proud, so I doubt he would accept such a thing.”</p><br/><p>Translations by AsianHobbyist .com Website. Stop reading at pirate sites like that steals translations. Check novelupdates. com for legit fan translations</p><br/><p>Elrick said flatly.</p><br/><p>Diablo nodded with satisfaction upon hearing this.</p><br/><p>“That’s useful to know. I am thankful for all the information you provided.”</p><br/><p>“Well, then. We should be leaving…”</p><br/><p>Diablo and Souei offered words of gratitude and got up from their seats.</p><br/><p>“–Um… Did my brother… Did my brother do something?”</p><br/><p>Elrick asked in a voice that seemed somewhat distressed.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Diablo smiled and answered as if to put his worries to rest.</p><br/><p>“No, not at all. There is no need for you to worry. Besides–and this is just an example, if a student really did do something, then it would be the parents, teachers and the state who should be responsible. That is what Lord Rimuru would say.”</p><br/><p>“But…”</p><br/><p>“Classes such as nobles and commoners have no meaning there. No, they are not allowed to have meaning. What your younger brother is doing is wrong, but it is the teachers who are allowing it, and it is the establishment that is the school that should take the blame. And as long as the school is under Lord Rimuru’s sponsorship, then we must think of all the students as being under his protection. The actions of your younger brother require punishment, but the student Julius will not be convicted of any crimes. I can assure you of that.”</p><br/><p>“I see…that is good. Unlike me, he does not think of Lord Rimuru in a kind way… He idolizes the Hero Masayuki…”</p><br/><p>And so Elrick explained that he was worried that his brother would do something rude towards Lord Rimuru, who he owed a great debt to. After that, he saw Diablo and Souei leave. Bowing his head for one final time, he said, ‘please help my brother.’</p><br/><p>◇◇◇</p><br/><p>After leaving the mansion where Elrick was being held, Diablo and Souei headed for the airport.</p><br/><p>Translations by AsianHobbyist Website.This meeting was the last part of their information gathering, and so they had no intention of staying any longer.</p><br/><p>And since they did not want to draw attention, they decide to travel by sky instead of a magic circle</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>As said before, Space Transfer was out of the question.</p><br/><p>The two wasted no time on the way to the airport, as they traded their opinions on what they had heard.</p><br/><p>“As I thought, someone has definitely made contact with him. However, it is most likely that Julius is not their coconspirator.”</p><br/><p>“That seems to be the case. Julius is seen as a shrine of sorts to the nobles. He must be avoiding any monetary aid so he does not appear weak.”</p><br/><p>“He must have a stronger spine than I thought. Interesting. Very interesting.”</p><br/><p>“–Yes.”</p><br/><p>Souei agreed with the conclusion that Diablo had come to.</p><br/><p>In fact, the previous day’s investigation had allowed him to understand the situation regarding the fortune of all of the nobles.</p><br/><p>This included money that was not written in the books, and he would know if there was some abnormal circulation of money happening.</p><br/><p>It was clear that Elrick was speaking the truth.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>There was no one in the world who could help Julius with money while keeping all traces of it out of their eyes.</p><br/>\n</div>"}