{"title": "Chapter 282", "id": 282, "volume": 3, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-282", "volume_title": "Volume 3", "body": "<h1>Chapter 282</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>People were never cautious of me and just entered my tent like it was nothing.</p><br/><p>Was that alright? I wondered. But it was a little late for that.</p><br/><p>There was a line of girls outside of the tent who had apparently heard rumors.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The tent was quite large, but could only house about ten people at once.</p><br/><p>We had borrowed one of the large tents just for this.</p><br/><p>And because of this, it looked like it would be a long time until all of the girls were finished.</p><br/><p>And one other thing.</p><br/><p>Being able to see the frustrated expression of Julius and the others was a very pleasant surprise.</p><br/><p>This bath was made by Marsha, so no one could try and cut the line.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>I would not allow such a thing.</p><br/><p>It was prepared because I wanted to take a bath, so why should I allow anyone to go first?</p><br/><p>That’s ridiculous! I am sure of it.</p><br/><p>But this was a good day.</p><br/><p>A dinner that was much more delicious than what those damned, snooty children of nobility were eating. And also the best possible bath under these circumstances.</p><br/><p>I was able to fulfill these two strong desires of mine.</p><br/><p>I was so full of satisfaction as I headed back to my tent.</p><br/><p>Just then, my ‘Magic Detection’ felt a strong wave of magic.</p><br/><p>It was detecting the presence of a monster that was coming towards this base, while brimming with tense emotion.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Was this emotion–appetite!?</p><br/><p>&lt;&lt;I expected that this would happen. As you noticed yourself, the herbs that were mixed in Julius and the others’ food had something in it that stimulates the appetites of monsters. The effect of it is now starting to lure surrounding monsters here. &gt;&gt;</p><br/><p>I hadn’t noticed it actually. And so what?</p><br/><p>No, I see… I remember feeling strangely irritated yesterday over being hungry. It must have been because of those herbs.</p><br/><p>It had nothing to do with my own lack of patience.</p><br/><p>That must be it.</p><br/><p>There was no way that an adult like me could be so impatient. Yes, I thought it was very strange.</p><br/><p>Wait, there are more pressing matters right now.</p><br/><p>–Have the instructors noticed it?</p><br/><p>&lt;&lt;It seems like a few of them have. They were specially selected, after all.&gt;&gt;</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Hmm, then that’s fine.</p><br/><p>I was relieved to see that they weren’t the useless types who would fail to be cautious.</p><br/><p>Now then, if Julius and the other were mixing monster-luring herbs into the food…</p><br/><p>What was their aim?</p><br/><p>If anything, they were eating it, which meant they would be in the biggest danger…</p><br/><p>–Could it be that Julius is being tricked into doing it?</p><br/><p>&lt;&lt;I think that is highly likely. Julius has more wounds than on the first day. But I believe that this development was also unexpected for the culprit. It is the Poison Tiger, one of the strongest creatures on this island, that leads the pack of monsters. They probably wanted to be rid of Julius and that group in a natural-looking way. But they will only attract attention like this. No, not only that–it may even be hard to survive this if they hide the power that they must have. We may be able to find the culprit by watching this fight.&gt;&gt;</p><br/><p>The Poison Tiger which prowled the southern poison jungle was great indeed.</p><br/><p>It was not something that could be reasoned with, so you had no choice but to kill it.</p><br/><p>But still, getting rid of Julius, huh?</p><br/><p>While I wasn’t sure if the intention was to kill, I did not like the method at all.</p><br/><p>Considering that it was mixed into the food, there must be a traitor.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>This was clearly planned out, likely even before my own survival plan. In other words, I had been used.</p><br/><p>That was terribly, unamusing to me.</p><br/><p>Ciel already had her eye on a suspect, and she was probably 99% certain of it.</p><br/><p>But could these culprits kill the Poison Tiger? It might be best to prepare just in case.</p><br/><p>According to my own plans, none of the students were to be exposed to danger.</p><br/><p>I would not allow this interference to cause any deaths.</p><br/><p>–Do you think that all of the students will make it out safely?</p><br/><p>&lt;&lt;It will be difficult if things continue like this.&gt;&gt;</p><br/><p>I thought as much.</p><br/><p>Well then, I must give them a little helping hand.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>I walked away from my tent while drying my hair.</p><br/><p>Translations by AsianHobbyist .com Website. Stop reading at pirate sites like that steals translations. Check novelupdates. com for legit fan translations</p><br/><p>And like that, I pretended like was I taking a walk in order to cool off, and headed for a secluded spot.</p><br/><p>Once I was sure that there were no students around me, I activated ‘Detection Block’ magic.</p><br/><p>All sound was erased, and I was surrounded in silence.</p><br/><p>“You’re here, aren’t you, Moss?”</p><br/><p>I said into the darkness.</p><br/><p>“Here, my Lord.”</p><br/><p>As if in answer to my call, a figure appeared and bowed reverently towards me.</p><br/><p>Moss was a Great Demon.</p><br/><p>A Grand Duke of the demon world who stood above all of the Demon Lords.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>And–while he was the lieutenant of Devil Lord Testarossa, at some point he had become Diablo’s errand runner.</p><br/><p>Are you sure about this, Great Demon? I did wonder sometimes, but he had very useful abilities.</p><br/><p>It was Testarossa’s fault, anyway.</p><br/><p>She allowed Diablo to use her subordinates as he pleased.</p><br/><p>But then again, I was also using Moss when it was convenient for me, so I couldn’t say too much…</p><br/><p>Even now, he had immediately appeared after I called him, and paid homage to me.</p><br/><p>But really, this guy was useful.</p><br/><p>He was stronger than even the former Demon King, so even if he was a ‘clone,’ he was still stronger than the monsters on this island.</p><br/><p>“I have a task for you.”</p><br/><p>“That brings me the utmost pleasure.”</p><br/><p>Whenever I ask him to do something, he always accepted it very happily.</p><br/><p>Maybe I should buy him dinner sometime.</p><div class=\"code-block code-block-8\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>I think a barbecue would be good. No, I’ll think about that later.</p><br/><p>“Hmm. Then let me ask you this, can you protect everyone from the monster that is coming towards us?”</p><br/><p>“That will be the easiest thing. My Lord.”</p><br/><p>“Good. Then do it. It would be best if there are no deaths. However, I would like for you to hide your presence as much as possible.”</p><br/><p>“Haha, I understand. I shall protect them from the shadows then.”</p><br/><p>Moss bowed once again and then vanished from my sight.</p><br/><p>Now I could relax a little.</p><br/><p>Translations by AsianHobbyist Website.</p><br/><p>I returned to the others as if nothing had happened.</p><br/><p>Oh, I forgot to invite him for a meal to show my gratitude.</p><br/><p>I could ask Diablo to send him a message, but that seemed like too much trouble, so I should just tell him the next time we meet.</p><br/><p>You should always thank people in person. And so I decided to show Moss my appreciation for this occasion.</p><br/><p>Now, how will this play out?</p><br/><p>I was sure that the worst possible scenario had now been avoided, so I might as well just lay back and watch.</p><br/><p>Who was the culprit that had tricked Julius? And what was their aim?</p><br/><p>And how capable were the instructors going to be in dealing with this danger? How strong were the students that Julius was leading?</p><br/><p>Within this dangerous situation, everything would be revealed.</p><br/><p>I would use it all to my advantage. That’s what I thought, as I smiled.</p><br/><p>And then–</p><br/><p>The first thing that echoed was the ferocious roar of the monster.</p><br/><p>It was the signal of the very long night ahead of us.</p><br/>\n</div>"}