{"title": "Chapter 320", "id": 320, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-320", "volume_title": "Volume 4", "body": "<h1>Chapter 320</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>And she had no hope of changing, and so she wished for nothing but to die at my hands now.</p><br/><p>This was all very annoying.</p><br/><p>“By the way, who do mean when you talked about someone from your home? The people who died in the war with the empire were mostly brought back to life.”</p><br/><p>The reaction of those three to my question far exceeded mere surprise.</p><br/><p>Apparently, it was news to them.</p><br/><p>“Hey, hey. Didn’t the resurrected soldiers tell you anything?”</p><br/><p>“N-no. We had heard, but we couldn’t believe it. We thought perhaps they had hallucinated it amidst the horrors of the war…”</p><br/><p>“Yes. How could we believe such a thing…”</p><br/><p>Magnus and Rozari shook their heads in firm denial.</p><br/><p>Hmm, I suppose so.</p><br/><p>But, it did happen.</p><br/><p>“Shinji Tanimura. Also Mark Lauren and Shin Ryusei… People from my home… They were ‘otherworlders’ who came here. I searched for them desperately, but could not find them. You killed them, didn’t you? Even if it was the work of your subordinates, it is ultimately your…”</p><br/><p>“STOOOP!!”</p><br/><p>It was probably her answer to my question, but Irina looked me straight in the eyes and began to talk.</p><br/><p>And the names that came out of her mouth were all familiar to me.</p><br/><p>I told her to stop and gave her the truth quite plainly.</p><br/><p>“You know, they are alive?”</p><br/><p>What are you saying? I shall not be fooled! She seemed to say as she glared at me.</p><br/><p>But it’s the truth…</p><br/><p>“I mean, I guess they haven’t bothered to contact their friends?”</p><br/><p>“As for that, Lord Rimuru…”</p><br/><p>Souei seemed to know the reason.</p><br/><p>Shinji, Mark and Shin had all betrayed the empire and defected. That was why they could not contact anyone.</p><br/><p>And…</p><br/><p>“They are very obsessed with their research and rarely leave the country. But they do enter the labyrinth occasionally for exercise and stress relief.”</p><br/><p>Well, there you go.</p><br/><p>Ramiris would have laughed loudly in this situation.</p><br/><p>Now that I think of it, Ramiris and Veldora were rather quiet recently.</p><br/><p>I was worried that maybe they were plotting something, but it looked like it was just their research.</p><br/><p>“Hehehe. Now that I think of it, they had been asking for more personnel. Among the documents in Benimaru’s room, there was a request for an increase of workers.”</p><br/><p>Diablo had a sharp eye and had looked through the documents addressed to Benimaru.</p><br/><p>In fact, I had known about it.</p><br/><p>However, there was no one that we could send, and it had been ignored.</p><br/><p>It had to be someone knowledgeable with a resistance to mana.</p><br/><p>Such personnel didn’t come easily…</p><br/><p>Hmmm? Personnel…</p><br/><p>“Irina. If you don’t believe me, why don’t you go and see them?”</p><br/><p>“What!?”</p><br/><p>“On one condition!”</p><br/><p>I could see that Irina had tensed up.</p><br/><p>I smirked and continued.</p><br/><p>“You will have to work there as a researcher too. And if you refuse this offer, you will be subject to a one hundred years sentence. Then you will not be able to confirm that what I have said is true, and you will not be able to meet them if it is. It’s up to you. Choose as you will.”</p><br/><p>Irina’s expression was deeply troubled.</p><br/><p>However, she came to a decision surprisingly quickly.</p><br/><p>“Regardless of it being true, research is preferable to a sentence. I will work there even if you are lying to me. Besides, you…protected the students. I do not think you are the kind of Demon Lord who would lie and toy with the hearts of others…”</p><br/><p>I did not know if she was being sincere, but she said this as she accepted my offer.</p><br/><p>Just one last push now.</p><br/><p>“Of course. After all, you were honest enough to tell me your plans. Quite freely too. How could I not have taken that into consideration?”</p><br/><p>I smiled devilishly and nodded.</p><br/><p>“But! Do not say that.”</p><br/><p>Irina looked very embarrassed.</p><br/><p>“Hehehe. Irina. While I do not lie, it is no difficult thing for me to play with the hearts of people. I might tell Shinji and the others about this. Especially when we are drinking. It can’t be helped, can it?”</p><br/><p>“AHHHHH!!!”</p><br/><p>Irina imagined this scene and shouted with embarrassment.</p><br/><p>“I, I swear to be loyal to you. But, please don’t talk to them about this…?”</p><br/><p>“I will think about it!”</p><br/><p>I said victoriously and nodded.</p><br/><p>Magnus had listened to this whole exchange.</p><br/><p>“Satoru…no, Great Demon Lord Rimuru. I, no, I don’t care what happens to me. But could you not forgive Rozari for her crimes?”</p><br/><p>“Lord Magnus!?”</p><br/><p>“I am very aware that this is very selfish of me. But she was only following my orders. If you could at least allow me to take the blame for it and forgive her…”</p><br/><p>I had thought he was one of those shallow types, but this was rather dashing of him.</p><br/><p>Well, he was actually part of the imperial family.</p><br/><p>I wanted to avoid earning anymore hatred through dealing with him too harshly.</p><br/><p>It would be a diplomatic issue, and I didn’t care to act so extremely just because I could.</p><br/><p>So, what to do?</p><br/><p>As I wondered about this, I heard a knock on the door.</p><br/><p>I felt the presence of two people.</p><br/><p>It was probably them.</p><br/><p>I was expecting them—well, I wanted them to come.</p><br/><p>Good.</p><br/><p>Now I could prepare a point of compromise.</p><br/><p>“Come in.”</p><br/><p>I gave them permission before Souei could stand up.</p><br/>\n</div>"}