{"title": "Chapter 326", "id": 326, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-326", "volume_title": "Volume 4", "body": "<h1>Chapter 326</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The impact upon landing had done nothing to them, and he began to take stock of the situation with calm movements.</p><br/><p>Ramiris also looked around with deep curiosity.</p><br/><p>And then, right in front of them—Beretta slowly floated downwards.</p><br/><p>“…Oh, dear. This is exactly why Lord Rimuru said we must be careful… Well, it’s too late now. But don’t blame me if he is furious about it.”</p><br/><p>“…What!? Beretta. Why are you pretending to be some goody two shoes that has nothing to do with this! You’re our accomplice in crime!”</p><br/><p>Ramiris frantically tried to implicate Beretta, but it would be hard to say that she succeeded.</p><br/><p>Beretta stayed calm and ignored her words.</p><br/><p>And just like Veldora, he began to look around and inspect this world they had come to.</p><br/><p>He understood that trying to argue with Ramiris seriously would only result in her putting the blame on him. And so Beretta decided to end it immediately.</p><br/><p>‘Oh, fine. We’ll talk about this later, when there’s time,’ Ramiris said, temporarily delaying her victory over Beretta.</p><br/><p>And it would indeed be temporary, for she had every intention of having Beretta take responsibility.</p><br/><p>It was done in the spirit of wanting to lessen the degree of anger directed towards her.</p><br/><p>Veldora was in total agreement concerning this, and so Beretta’s position here was very dangerous.</p><br/><p>Honest people are not always rewarded for being honest.</p><br/><p>And as someone who had known Ramiris for a long time, Beretta had experienced this first-hand.</p><br/><p>Not only that, but the embodiment of irresponsible, Veldora, was also present.</p><br/><p>While Beretta’s position was bad, he was able to buy some time.</p><br/><p>After that, he would just have to tell Rimuru what really happened and prove that he was not involved—but then he realized that the situation was much more serious than he had thought.</p><br/><p>“This is bad. We have lost any connection with our world. The Different Gate has closed…”</p><br/><p>“Yes. After all, we used the ample energy available deep within the labyrinth, and that’s what kept the magic circle working. So it only makes sense that it could not continue to stay up in this world, where there is no energy.”</p><br/><p>“Hey, master!? You sound very calm, but we will be able to get back, right?”</p><br/><p>“Hmm…”</p><br/><p>“What, are you serious? Beretta. What’s going on here!?”</p><br/><p>“Didn’t I tell you? This is because you ignored Lord Rimuru’s warning and acted on your own…”</p><br/><p>Beretta said with an exasperated shake of his head.</p><br/><p>Veldora looked away and whistled unconcernedly.</p><br/><p>He had actually expected the other world’s energy to be enough in maintaining the gate.</p><br/><p>He had not expected this at all. That it would require energy on the other side as well.</p><br/><p>“Wait! What! What! That makes it sound like it’s all my fault!!”</p><br/><p>It was Ramiris and Veldora’s fault no matter what way you looked at it. And so it was a little horrifying that they weren’t conscious of it.</p><br/><p>Or so Beretta thought, but he didn’t waste his time voicing it.</p><br/><p>There were more important matters to deal with now.</p><br/><p>“Hmm. What a predicament. Not only is there no energy, but the oxygen is also very thin. And there are places with some very serious pollution too?”</p><br/><p>“Are you serious? Now that I think of it, it is quite cold. And dark…”</p><br/><p>Ramiris now noticed it as well.</p><br/><p>The sky was covered in thick clouds, covering the sunlight.</p><br/><p>Because of this, the temperature on the ground was near freezing point.</p><br/><p>While they did not require oxygen and had a resistance to toxins, it still did not feel very nice.</p><br/><p>Besides—</p><br/><p>“…Hey? What if there are no people here, or life of any kind? I was looking forward to communicating with different cultures, but it doesn’t look likely.”</p><br/><p>Ramiris muttered with disappointment.</p><br/><p>There was no point in coming to other worlds if there was no life there.</p><br/><p>Still, it was possible they had just landed in a bad location, and she had not abandoned all hope just yet.</p><br/><p>“This is really bad. This world is a miss.”</p><br/><p>“There are ‘hits’ and ‘misses’ with worlds?”</p><br/><p>Beretta asked.</p><br/><p>“Hmm. Why wouldn’t there be?”</p><br/><p>“Exactly. I told you. We came to look at other world cultures and try to search for something interesting!”</p><br/><p>I see. Beretta was satisfied.</p><br/><p>This place was polluted and the temperature was near the freezing point.</p><br/><p>There wasn’t much hope of there being intelligent life here, and so Veldora and Ramiris’s wish was not likely to come true.</p><br/><p>(I understand what they mean by ‘miss.’ However, to run such an operation alone and in secret…perhaps they just wanted to discover a new civilization first and brag about it to Lord Rimuru… )</p><br/><p>Even as Beretta thought about this with exasperation, Veldora and Ramiris were having a conversation.</p><br/><p>“Oh, I hate this. The cold aside, there isn’t much spirit power here, which is weakening me. Besides, it’s dark and all you can see in the distance is wild flatlands… It’s, you know… Like those planets Rimuru knew about. Like Mars.”</p><br/><p>“Ohh…you know a lot, Ramiris. I was actually thinking the same thing.”</p><br/><p>Translations by AsianHobbyist Website.“Right! Right!”</p><br/><p>“Judging from how polluted this place is, maybe there was a nuclear war here!”</p><br/><p>“Ohhh! Very impressive master! You sure know a lot!”</p><br/><p>“Kaaaha—ahahahaha! Oh, you are exactly right about that!”</p><br/><p>Veldora and Ramiris continued their carefree conversation.</p><br/><p>As he listened to them, Beretta started to feel like it was stupid for him to think about this problem alone.</p><br/><p>Still, there were certain things he needed to ask them. And so he waited for them to calm down before asking Veldora.</p><br/><p>“So, Lord Veldora. Do you think it is possible for us to return?”</p><br/><p>“Hmmm…”</p><br/><p>Veldora took a long pause and closed his eyes to think.</p><br/><p>Ramiris was also very interested in his answer, and so she waited quietly.</p><br/>\n</div>"}