{"title": "Chapter 334", "id": 334, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-334", "volume_title": "Volume 4", "body": "<h1>Chapter 334</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“I am relieved that you enjoy it.”</p><br/><p>“Yes. It is very interesting indeed. By the way, does the taste change if you put it in water?”</p><br/><p>Veldora’s curiosity was limitless.</p><br/><p>He wondered if the muddy, odorous water would be drinkable if the tablet were mixed with it.</p><br/><p>However, the answer was most disappointing.</p><br/><p>“This tablet does not dissolve very well in water.”</p><br/><p>“Aye. Didn’t you taste it earlier when you bit into it directly? It tastes very bad if you take it by itself. And us cyborgs, who do not require solid food, will swallow it down with some water. There are also ways to remove your taste buds, but that is quite sad.”</p><br/><p>Sharma denied it and Zaza explained in detail.</p><br/><p>So cyborgs still had taste buds.</p><br/><p>There were some who discarded it as unnecessary, but not Zaza.</p><br/><p>Zaza took out a taste ball–which was an incredibly expensive luxury item–and showed it to them.</p><br/><p>“This thing send low-frequency waves to stimulate your tongue. Feeling it with your tongue cause special electric signals to be sent to your brain. It won’t satisfy your hunger, but it’s an important thing in keeping what’s left of your humanity.”</p><br/><p>Veldora and Ramiris watched Zaza explain this with dazzled eyes.</p><br/><p>“Master, master!”</p><br/><p>“Don’t get ahead of yourself, Ramiris. I understand your excitement at this, but you must calm down.”</p><br/><p>But they were both very excited.</p><br/><p>Beretta was calm and stood quietly behind them.</p><br/><p>Sharma looked at the three of them and thought.</p><br/><p>(–I do not understand these people. Did they really not know? But if they were lying. Why? I cannot understand it and…)</p><br/><p>In her fifty years of life, Sharma had never eaten anything but this food.</p><br/><p>It had the perfect nutritional balance, kept you from getting underweight or overweight and made it difficult for you to get sick.</p><br/><p>And so it was not like Sharma at all, that she now felt like asking them about it.</p><br/><p>She waited for them to calm down a little and then asked them quietly.</p><br/><p>“Hehe. But I am quite interested. If you do not know how to eat this, what kind of food do you normally eat?”</p><br/><p>If these two had been lying to her, what would they say now?</p><br/><p>What lies could they have prepared–she wondered.</p><br/><p>However, the answer that Sharma received exceeded anything she could have ever imagined.</p><br/><p>“Oh, you mean like cookies or cakes? I also like eating fruits as they are, but the tarts that Shuna makes are even better!”</p><br/><p>“Ramiris, those are snacks! For food, I like tempura a lot!”</p><br/><p>“Yes, tempura is delicious! If that’s what we’re talking about, I like barbecued meat and hamburger steaks too!!”</p><br/><p>Veldora and Ramiris seemed to be fighting over who could offer the most answers to Sharma’s question.</p><br/><p>However, none of the words had any meaning to Sharma.</p><br/><p>These dishes did not exist in this world–to be precise, they stopped existing three generations ago.</p><br/><p>Only Zaza, who was the oldest of the three, knew what Ramiris meant when she said cookies.</p><br/><p>He understood.</p><br/><p>(Cookies? Yes, before the war started… I had assumed that such things did not exist anymore, but what if we were to search? No, no, if there were any left, they would be in the center of the imperial city… So is that where they came from…?)</p><br/><p>Zaza wondered.</p><br/><p>But as if to disregard the confusion that Zaza was currently feeling, Ramiris did something most unexpected.</p><br/><p>“Oh, right! I thought something like this might happen…!!”</p><br/><p>Ramiris shouted. Then she cast magic on the cup that was on the table.</p><br/><p>The cup was half her size, but it now floated up into the air where it was enveloped by a sphere of water and purified.</p><br/><p>“Yes, yes. My spirit power is weak, but I can still do this much.”</p><br/><p>She nodded with satisfaction, and then pulled out a bottle that was the same height as herself.</p><br/><p>It was a thermos.</p><br/><p>It contained some hot tea that had been made beforehand.</p><br/><p>“Ramiris. I would also prefer some tea over this muddy water.”</p><br/><p>“Okay! How about you? Do you want to drink it too?”</p><br/><p>Sharma and the others were stunned by what they had just witnessed.</p><br/><p>“Huh? What?”</p><br/><p>“Hey, wait! What just happened? Water is so…no, but…!?”</p><br/><p>“Is it a trick? An illusion? No, it can’t be…”</p><br/><p>None of them could understand it, and they reacted with confusion.</p><br/><p>“Okay! Then you guys can have some too!”</p><br/><p>Ramiris interpreted their reactions as assent, and so she purified their cups without waiting for further answer.</p><br/><p>The cups and plates were all sucked into the sphere of water that appeared in the air.</p><br/><p>And then after a few seconds, cleanly washed cups and plates were lined up on the table.</p><br/><p>Ramiris ignored the shocked spectators and then took something else out of her breast pocket and put it on the table.</p><br/><p>“Look at this! It’s some snacks I smuggled in!”</p><br/><p>It was pound cake and cookies.</p><br/><p>She served them on each plate.</p><br/><p>And the cups were filled with steaming and fragrant tea.</p><br/><p>“Alright then. Let’s eat!”</p><br/><p>And with that, Ramiris began to eat the food that was quite huge relative to her size.</p><br/><p>Veldora happily grabbed a cookie and shoved it into his mouth.</p><br/><p>Then he nodded with satisfaction.</p><br/><p>“Mmm. Yes, this is the stuff. Oh, please don’t be so modest. Eat up.”</p><br/><p>Veldora said, encouraging Sharma and the others to eat, as they were still frozen.</p><br/><p>Upon hearing this, Sharma and the others began to move, even though the situation felt too bizarre to be real.</p><br/><p>Zaza moved first.</p><br/><p>He looked away from the plate of cookies and pound cake, saying, ‘I do not require food…’ and his hand went for the tea.</p><br/><p>He took a sip and closed his eyes.</p><br/><p>(It’s real… How nostalgic. But that means…)</p><br/><p>He realized what it meant, and he suddenly opened his mouth.</p><br/><p>“Sharma. Rindo. Let me warn you–you must be prepared if you are going to eat this.”</p><br/><p>“Is it…poison?”</p><br/><p>Rindo said cautiously.</p><br/><p>But Sharma knew what he meant.</p><br/><p>“Oh. I see…Zaza. So it is real…”</p><br/><p>She muttered under her breath.</p><br/><p>And then she continued.</p><br/><p>“However, we have a duty to eat this food. After all, it was without a doubt I who asked them about what they usually eat. And I must take responsibility for my actions…”</p><br/><p>Sharma said. And then she quickly grabbed one of the cookies as if to allow no hesitation to come over her.</p><br/><p>And then she put it into her mouth.</p><br/><p>It was so deep and spread so wide. This unknown taste.</p><br/>\n</div>"}