{"title": "Chapter 331", "id": 331, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-331", "volume_title": "Volume 4", "body": "<h1>Chapter 331</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>This is a very long chapter.</p><br/><p>Thanks to Сергей for the donation.</p><br/><p>Tensei Shitara Slime Datta Ken 285</p><br/><p>Bonus – Visit to the Unknown – 03 Food Situation</p><br/><p>Zaza was stunned.</p><br/><p>It could not believe what was happening in front of its eyes.</p><br/><p>Of course, Murder Dogs were known as the embodiment of fear, and Beretta had killed three of them in an instant, so it could not be helped.</p><br/><p>(Is-is this real!? I cannot believe it…)</p><br/><p>Without being able to accept it, Zaza stood in shock.</p><br/><p>Then a voice sounded from behind Zaza.</p><br/><p>“Kaaaa—hahahaha! Oh, Ramiris, I have found a survivor! We thought this world was a miss, but there may even be other life if we look for them.”</p><br/><p>“Hmmm. Master. That’s fine and all, but my whole body feels tingly and it hurts…”</p><br/><p>Zaza jumped and then turned around.</p><br/><p>A beautiful brown-skinned man with blonde hair was standing there.</p><br/><p>Not only that, he looked natural, as if his body had not been altered at all. He just wore casual clothes and stood there.</p><br/><p>Of course, it was Veldora.</p><br/><p>“He-hey, you! Are you crazy!? You can’t dress like that with all of the radiation!?”</p><br/><p>Zaza could not help but shouting. And Zaza could not be blamed.</p><br/><p>Veldora’s clothing was completely abnormal.</p><br/><p>In fact…</p><br/><p>This entire surface world was full of danger.</p><br/><p>There was the thin oxygen and poison in the atmosphere.</p><br/><p>The reason that the enemy could use nuclear weapons without regard over the destruction of the environment was that the environment was already polluted beyond repair.</p><br/><p>This world was already on its way, at a rapid speed, towards destruction.</p><br/><p>But there were those who had a will to fight this fate and created an organization. The resistance that Zaza was a part of–Light of Dawn–.</p><br/><p>“Hahaha. Isn’t it cool? This outfit was designed by Rimuru and made by Shuna. What do you think?”</p><br/><p>“Who cares about how you look? More importantly, this thing about thick radiation has an ominous ring to it. And my body kind of hurts. It’s important, so I’m going to say it again. It’s tingling and painful!!”</p><br/><p>It was here that Zaza noticed another strange thing about Veldora.</p><br/><p>A voice. Something was sitting on Veldora’s shoulder and saying they felt pain–Zaza’s eyes went to Ramiris and widened.</p><br/><p>“No, no. This is not about pain! Are you really fine…? And what is that small thing!?”</p><br/><p>Ramiris ignored Zaza and continued to wail.</p><br/><p>“Hey, master! I just remembered something. Didn’t Rimuru say that radiation was bad for human bodies!”</p><br/><p>“It should be fine, I think? He said that it was fine if it was only a small amount. After all, if the sunlight is fine, then there should be no problem…”</p><br/><p>“Hey, wait! Wait! It may be fine for someone like you, since you can live outside of the atmosphere, but it’s bad for a weak fairy like me! And that young man over there just said that it was very dense!!”</p><br/><p>“Hey, don’t cry like that. Oh, well. I shall make a little barrier then and nullify this radiation thing…”</p><br/><p>Veldora mumbled excuses against Ramiris’s complaints as he started to strengthen the barrier.</p><br/><p>Fairies took damage from radiation? Zaza wondered about this, but decided not to ask.</p><br/><p>Ramiris finally regained her calm after Veldora was finished.</p><br/><p>If she really had been taking damage, it would already be too late for her. But seeing as that was not the case, it was clear that she had been imagining the pain because she was scared.</p><br/><p>“I was wondering, master… If you can do that, I would have liked it if you did it in the beginning. Didn’t I tell you? You’re supposed to protect me! Oh, I knew it. I should have had Beretta protect me instead…”</p><br/><p>“Let go of it already. I will do better next time. Don’t worry about it.”</p><br/><p>“Really? Are you sure? You better mean it!?”</p><br/><p>Veldora and Ramiris continued their bickering as Zaza stood in shock once again.</p><br/><p>Ultimately, Veldora gave in and the matter was settled.</p><br/><p>But while they talked, Zaza was so stunned that he could not open his mouth.</p><br/><p>He didn’t know what to do, and his reasoning could not keep up with the situation.</p><br/><p>And so it was Beretta, who had killed the Murder Dogs in an instant, who spoke first.</p><br/><p>“I meant to capture them, but they were accidentally destroyed. This is not good. I tried to use magic to restrain them at first, but I could not activate it. There is no energy here. Not being able to use magic means that I will have to completely rethink the way I fight. But it is so hard to adjust…”</p><br/><p>Beretta said as he finished inspecting the destroyed Murder Dogs before standing up.</p><br/><p>Veldora and Ramiris heard him and stopped their fighting.</p><br/><p>At the same time, Zaza realized that what was happening now was not a dream, and he was finally able to speak.</p><br/><p>“He-hey. I don’t know what is happening here, but you have my thanks for saving me. But this place is dangerous. I want to retreat to a safe area. Will you people come with me? I would like to repay you and ask some questions…”</p><br/><p>“Oh? Would this place happen to have other intelligent creatures–that is, humans?”</p><br/><p>“Yes. We will have to take a longer route in order to avoid being followed, but my comrades will be there.”</p><br/><p>Veldora and Ramiris listened to him and then looked at each other and nodded.</p><br/><p>If there were others here, then there would surely be someone who knew a lot about the culture of this world.</p><br/><p>And so they decided to follow Zaza.</p><br/><p>Beretta had known them for long enough to see what they were thinking, and so he obeyed without any objections.</p><br/><p>“Very well. We have things we would like to ask as well. You may lead us to this place then!”</p><br/><p>Veldora said, representing the others. Zaza nodded.</p><br/><p>As for Zaza, he did not completely trust these two–three, including Ramiris–just yet.</p><br/><p>But he decided that if the Empire had sent these three for the purpose of finding their hideout, then they would not have gone as far as to destroy three very expensive Murder Dogs.</p><br/>\n</div>"}