{"title": "Chapter 357", "id": 357, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-357", "volume_title": "Volume 4", "body": "<h1>Chapter 357</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“It’s nothing but hypocrisy!!”</p><br/><p>Rindo shouted.</p><br/><p>He was glaring at Michelle with eyes that burned with hatred.</p><br/><p>And then he continued his attack.</p><br/><p>“You want us to suffer while you live in comfort. And yet you have no shame at all!!”</p><br/><p>Michelle glanced at Rindo without changing her expression in the least.</p><br/><p>This was because she was talking to Sharma, the representative, not Rindo.</p><br/><p>“Rindo. Be quiet.”</p><br/><p>“But—!?”</p><br/><p>“That’s an order. Michelle is talking to me. I am speaking for us all!”</p><br/><p>Sharma was intimidating enough that Rindo became silent.</p><br/><p>Though Sharma did feel that Rindo’s outburst had allowed her to realize that Michelle had yet to address the real issue here.</p><br/><p>“…I see. In other words, the people of the city do not trust us…”</p><br/><p>“Yes. You people were unable to trust us as well. You would have suspected a trap and we would not have been able to cooperate. After all…”</p><br/><p>It was impossible for every survivor of the great war to enter the cities.</p><br/><p>And so there was a need to select.</p><br/><p>Fairness was lost. As was justice.</p><br/><p>Those who already lived in the city and the refugees. They were all human life. And it was because of this, that individual talent became the deciding factor.</p><br/><p>But who could decide?</p><br/><p>—How could humans who are not God decide the worth of a human?—</p><br/><p>And so the standard for selection became very simple.</p><br/><p>Those who already lived in the city and those who didn’t.</p><br/><p>Such an explanation would not be satisfactory.</p><br/><p>Of course, it wouldn’t.</p><br/><p>And so the Emperor of the Mechanized Empire of Almsbine initiated it without explanation and by using force.</p><br/><p>Michelle explained this to them, but it was meaningless.</p><br/><p>She never believed that they would understand.</p><br/><p>Which was no surprise, as she herself did not understand.</p><br/><p>“–That was the decision at the time. No one could go against it. I know you will not understand and I realize you must be angry. However, it is the truth.”</p><br/><p>“Understand!? How dare—”</p><br/><p>Rindo stopped here and broke into a fit of tears.</p><br/><p>The others all listened to Michelle in a state of shock.</p><br/><p>It was hardly a surprise.</p><br/><p>The difficult lives they had lived, the deaths of friends, all manner of hardships—The was no clear reason why it had to be them who had been burdened with it all…</p><br/><p>“And so why…are you helping us? Do you want to prolong our suffering!?”</p><br/><p>“No, that’s wrong. The man over there was close. I don’t care if you call us hypocrites. However, I truly want to do good.”</p><br/><p>“Bu-but…”</p><br/><p>“One day, the cities will no longer be able to function. When that time comes, the people who have been living comfortably will find it very difficult to survive. So, from the perspective of danger management, wouldn’t it be important to consider all kinds of possibilities?”</p><br/><p>“In other words, as long as we survive, the cities can fall?”</p><br/><p>“Yes.”</p><br/><p>“That is—that is an incredibly arrogant way to think!!”</p><br/><p>Sharma shouted, but Michelle didn’t budge.</p><br/><p>Belief in what you were doing was right. It was something she had decided on the moment she joined the military.</p><br/><p>It was justice in her eyes.</p><br/><p>“Well then, let me ask you this. What do you think would have been the right thing to do back then?”</p><br/><p>“Th-that…”</p><br/><p>Sharma hesitated.</p><br/><p>She had not been born back then, and yet not a day went by where she didn’t think about it.</p><br/><p>She hated this world and wanted to know the reason that the empire had made things this way. It was because of those crimes that they felt they were on the side of justice.</p><br/><p>But was it really right to say that the empire was evil–Sharma had always had this doubt in her mind.</p><br/><p>“You cannot answer? Well, let me tell you then. If they had made the wrong decision back then, humanity would have gone extinct long ago.”</p><br/><p>Michelle declared without hesitation.</p><br/><p>“You are saying that you helped us because we could possibly be a way for humanity to survive? Do you think we would believe that? The words of someone who stands at the top of the empire?…”</p><br/><p>There was pain in Sharma’s voice.</p><br/><p>She was now finding it difficult to believe that Michelle was lying, however, it was too much to take in all at once.</p><br/><p>“Hmmm. We will not be able to start negotiating if you do not believe me…”</p><br/><p>Michelle said in a troubled voice—</p><br/><p>“Surely it is fine now, General Michelle? Miss Sharma, Rindo. I am working for the empire. I am sorry for hiding this from you. But it was necessary…”</p><br/><p>Zaza had been watching quietly up until now, but he suddenly opened his mouth.</p><br/><p>◆◆◆</p><br/><p>There was an uproar after that, but Sharma silenced them with a shout.</p><br/><p>Still, it became necessary to move to someplace quieter.</p><br/><p>They were currently in a corner of a warehouse that was used for meetings.</p><br/><p>“Why was I called here as well?”</p><br/><p>“It’s probably because everyone knows you are amazing now, master?”</p><br/><p>“Oh? Tell me more!”</p><br/><p>“Uh, like I said…”</p><br/><p>“Lord Ramiris is right. You did wonderfully in that fight. So that is what happens when Lord Veldora gets serious! I was very impressed. It is no wonder that your presence was required here!”</p><br/><p>“Hoho! I see!”</p><br/><p>Such words were exchanged in the room, but no one else chimed in.</p><br/><p>Michelle was the only one who looked at Veldora with interest. But she still gave little more than a curious glance.</p><br/>\n</div>"}