{"title": "Chapter 350", "id": 350, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-350", "volume_title": "Volume 4", "body": "<h1>Chapter 350</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“Huh? Well, ohohohohoho—”</p><br/><p>Sharma, who was holding a plate, tried to run away as she laughed.</p><br/><p>“Wait. Wait just one minute. Miss Sharma, you can’t possibly be involved with this!?”</p><br/><p>“Oh, how rude! That’s preposterous! What a thing to say. But, you know, Zaza. It is sometimes important to keep an open mind. That is my opinion!”</p><br/><p>She said.</p><br/><p>Zaza was exasperated.</p><br/><p>This was so ridiculous.</p><br/><p>“But…”</p><br/><p>“Zaza.”</p><br/><p>After thinking about it for a moment, Zaza was about to tell Sharma what he really thought, but she interrupted him.</p><br/><p>Zaza gave up under her stare.</p><br/><p>Sharma nodded and looked at him very seriously.</p><br/><p>“Look here, Zaza. I have made a decision. I am not giving up on everything. We are going to talk to the Empire. Obviously, this will have to be discussed with the rest of Light of Dawn, but I believe we can confront the Empire in a way that doesn’t involve fighting. Yes, that is what I believe.”</p><br/><p>“You want to talk to them. But I doubt the Empire has the ear to listen…”</p><br/><p>“Indeed. We may not get the opportunity. But when that happens, we just need to fight them and take what we need. Just like Veldora over there said. Don’t you agree?”</p><br/><p>“Fight and take? But that is insane!”</p><br/><p>Karman said as he butted into their conversation.</p><br/><p>While he was chuckling, his words left no room for argument.</p><br/><p>“Look. It was quite impressive that you beat us. I am surprised by it myself. However, the Empire’s latest cyborg soldiers are monsters that have ceased to be humans in the truest sense. You’ll all be slaughtered.”</p><br/><p>Karman said as he looked around them.</p><br/><p>The children laughed as they ate their hotcakes.</p><br/><p>“Tsk!”</p><br/><p>Karman clicked his tongue.</p><br/><p>“Don’t even try. It’s not really for me to say, but you’ll probably remain undiscovered if you continue to lay low as you always have. We were lucky this time when we found you… But you know, its all this Zaza’s fault, as they tried to steal from us on such a large scale! And so…”</p><br/><p>“But!”</p><br/><p>Sharma stopped him.</p><br/><p>And then with an expression of determination, said:</p><br/><p>“I want to give the children hope. You know, we weren’t even aware that such wonderful food as this existed until yesterday! And I was thinking, do we bear the responsibility for that? We polluted the world and then lived on like this… That great war. It has nothing to do with our children, does it!? And so I have decided. It doesn’t have to be every day. Even once a year is fine. But I want to receive some of the base materials and grow them. And then we can all celebrate. Is that so bad?”</p><br/><p>Karman was at a loss for words as she stared at him.</p><br/><p>He could not argue with her.</p><br/><p>No matter how much he hated the resistance up until now, it was really just anger that had lasted this long through not knowing them.</p><br/><p>Now, with the children in front of him, his convictions had weakened.</p><br/><p>(…She’s right. These kids aren’t responsible for that…)</p><br/><p>It was a problem that Karman had been avoiding in his own mind.</p><br/><p>Up until now, Karman had only faced warriors who had been trained for battle. He believed they were in the wrong, and that allowed him to be as cruel as he wanted.</p><br/><p>Even when first lieutenant Hiragi used the nuclear missile, he didn’t feel an ounce of remorse. The resistance was their enemy. Karman’s imagination did not lead him to think of them as individuals.</p><br/><p>But now that he knew, something different was in his heart. A struggle.</p><br/><p>Even without the cigar—the emotion suppressant—anger did not well up in him. He was that confused.</p><br/><p>(Tsk. Damn it!!)</p><br/><p>It was a question without an answer, and he cursed inwardly.</p><br/><p>“…If we could survive without the city, we would do so gladly. Unfortunately, I have had these hotcakes analyzed, and they are primarily made from flour. And there are also such valuable ingredients such as chicken eggs and cow milk mixed in it. We have no way of acquiring such things. If it were only the flour, perhaps we could read the genetic information and recreate it within the shelters, but it does not work that way with livestock. We cannot solve this problem on our own.”</p><br/><p>Rindo said.</p><br/><p>Sharma had ordered him to find out if they couldn’t recreate the food themselves.</p><br/><p>Sadly, the answer was that it was impossible.</p><br/><p>“…Indeed. They do have the genetic information of animals from the last century and there are even animals that are raised for food in the city. But still, it is only just enough so that the citizens of the city don’t starve! Even if you want it, we can’t just say, ‘here, take it!’”</p><br/><p>“And that is why we want to negotiate first. Perhaps we could be useful to each other. We wish to make a non-aggression pact and build a cooperative relationship. But…”</p><br/><p>“If you refuse to accept us no matter what, we will have to fight for our survival. If there is even a little hope for us in this world, then we will gladly give our lives for the coming war.”</p><br/><p>But in the end, Rindo added that the resistance was still not unified in their decision.</p><br/><p>However, they could predict the outcome of the talks before they happened.</p><br/><p>All their branches were barely holding on. They all knew that they needed the help of the cities. Their machines would not last much longer.</p><br/><p>Up until now, they had searched for other ruins with power-supplying machines and used them.</p><br/><p>But this was not really a solution to the problem. There was always a desperate attempt to find a replacement as the old machines slowly died.</p><br/><p>If the machines were to stop working before they found a spare, then they would lose the ability to provide the bare minimum amount of food they needed to survive.</p><br/><p>This unease and fear was something the adults of the resistance had to live with constantly.</p><br/><p>If they could receive the cooperation of the city, then they would likely be able to repair their machines.</p><br/>\n</div>"}