{"title": "Chapter 363", "id": 363, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-363", "volume_title": "Volume 4", "body": "<h1>Chapter 363</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>He said.</p><br/><p>And then Fudora produced a sphere, which he then set into Kristoph’s chest.</p><br/><p>“Your Majesty. It is true that the Machinery Four, your greatest works, have wonderful capabilities. The Auto-Healing ability allows them to regenerate, and then there is the incredible durability brought by the special alloy. They can use space expansion and are equipped with high-output nuclear reactors. Their power is several times stronger than our other weapons. But more than anything, they individually have the Ether Ring Barrier, which is the heart of the city’s defense. It is no wonder they are considered to be the strongest… However, that is a thing of the past. The Bionoids that I have created have the flexibility of living beings. See, as evidence…”</p><br/><p>As Fudora talked with a look of ecstasy, the fallen Kristoph began to rise from the floor.</p><br/><p>It left only the important organs, the rest were absorbed and broken down and then rebuilt.</p><br/><p>It still looked like Kristoph, but the insides were completely different.</p><br/><p>However, the memories and skills, everything about Kristoph had been replicated completely…</p><br/><p>No…</p><br/><p>The aging face of Kristoph had regained the features of his youth.</p><br/><p>The biological cells and memory cells that do not age were able to read Kristoph’s genetic information and recreate it. It was not his current age, but a younger face that was full of the power of his best days.</p><br/><p>It would seem that such appearances had little meaning for a cyborg, but that was not the case.</p><br/><p>Degradation of the brain, ability to make decisions, recognition and reaction speeds would occur.</p><br/><p>Such weaknesses were now gone, and Kristoph had been reborn as the strongest Bionoid.</p><br/><p>But he no longer had a heart. His will was to obey Fudora.</p><br/><p>“…Greetings, father. I am Kristoph, your shield and your sword. I await your orders.”</p><br/><p>And like that, the most terrifying Bionoid was born.</p><br/><p>Emperor Almsbine was too shocked to speak.</p><br/><p>His most trusted friend had died in front of his eyes.</p><br/><p>And on top of that, he had been reborn as the most dangerous of enemies.</p><br/><p>It was no wonder that he was at a loss.</p><br/><p>“No-no…and Alvin!?”</p><br/><p>The Emperor finally realized that Alvin had not betrayed him, but had been remade in secret.</p><br/><p>It was obvious, considering he had regenerated a head that had been destroyed.</p><br/><p>“Yes, that is very perceptive of you. He refused to help me, so I had no choice.”</p><br/><p>“Bastard!!”</p><br/><p>“Hahaha. Didn’t I tell you? This is all because you continued to hide the Mobius System. That would solve all our energy problems. With that power, we wouldn’t have to wait for the results of these sluggish experiments. We can purify this world!”</p><br/><p>“I told you. That…”</p><br/><p>“Silence! I have no intention of following your slow plans!!”</p><br/><p>“Exactly. Brother, I agree with what Fudora is saying. I do not want to be the emperor of such a wretched world. I want to rule a planet that is beautiful. And so our aims matched, and I agreed to help. You can die in peace and leave the rest to me.”</p><br/><p>Amit surrendered to his evil desires and stared at the Emperor.</p><br/><p>Kristop and Alvin–the two Bionoids watched on in silence.</p><br/><p>Fudora watched this with the conviction that his ambitions were halfway to completion.</p><br/><p>The time had come.</p><br/><p>One part of the plan that had been carried out in secret had now been achieved.</p><br/><p>These four had been modified by the Emperor himself. They were the finest works from the mind of a genius.</p><br/><p>As the old Emperor could not replicate them, they could be called a ‘lost art.’</p><br/><p>And so it had been necessary for Fudora to develop technology that could go against them.</p><br/><p>And he had done it.</p><br/><p>Human experiments had been carried out in secret and data was collected.</p><br/><p>And finally, Fudora succeeded in his lifeform modification experiments.</p><br/><p>He implemented it on himself one month ago.</p><br/><p>Things moved quickly after that.</p><br/><p>Amit had secretly agreed to help him. They lured Alvin and then killed him.</p><br/><p>And then he was reborn as their greatest pawn, a Bionoid.</p><br/><p>And now…</p><br/><p>Their biggest obstacle, Kristoph, was in their hands. Michelle was the last person in their way.</p><br/><p>As for the clown who only had his position because he was the Emperor’s younger brother, he could be dealt with at any time.</p><br/><p>“Haaahahahahaha!! Brother, this is goodbye!! Leave the rest to—!?”</p><br/><p>Kristoph’s fist slammed into the fool’s head, destroying it in a flash.</p><br/><p>Fudora nodded with satisfaction before preying on the body.</p><br/><p>And by doing that, he himself was recreated into the strongest being.</p><br/><p>—The special lost arts of the Emperor were now combined with the fruits of his research.</p><br/><p>And with that, the old body of Prime Minister Fudora also transformed into a youth with black hair.</p><br/><p>“Fudora…you…”</p><br/><p>The Emperor muttered in shock. Fudora looked at him with a surprisingly gentle expression.</p><br/><p>“Your Majesty, no, Senior Al. You really weren’t fit to be emperor. I will do the rest for you. But I just need to take your knowledge…”</p><br/><p>And with that, Fudora granted Emperor Almsbine eternal rest.</p><br/><p>That was the end of a man who had ruled an empire for one hundred years.</p><br/><p>“…Now. It seems that Michelle really has hidden the Mobius System. I am glad that the plan succeeded, but it’s annoying that we have more work to do. Still…”</p><br/><p>Then Fudora looked at Jegyll.</p><br/><p>“We have bait. I can use this thing to get her without any difficulty.”</p><br/><p>He said with an evil laugh.</p><br/><p>“N-No! Stop…!!”</p><br/><p>And then—Jegyll’s consciousness was swallowed by shadows.</p><br/><p>Her wish was in vain. She would also be reborn as a Bionoid.</p><br/><p>Become a pawn for Fudora, stripped of free will..</p><br/><p>And like that, his plans went to their final phase.</p><br/><p>◆◆◆</p><br/><p>—Five days had passed since Veldora and the others arrived in this world.</p><br/><p>The sounds of something sizzling as it cooked echoed.</p><br/><p>That should be enough to predict who it was.</p><br/><p>Veldora.</p><br/><p>Veldora was cooking again. This time there was meat on his grill.</p><br/><p>“Hey—you!! You! What is wrong with you!?”</p><br/><p>And the person who was shouting was also easy to guess.</p><br/><p>Zaza.</p><br/><p>He had been with the rear guard, but the moment they stopped to set up camp, he had been met with a sight that caused him to scream in abandon.</p><br/><p>“Kaaa-hahaha! You’re late, Zaza. We’ve already started, you know? But don’t worry. I saved some for you!”</p><br/>\n</div>"}