{"title": "Chapter 364", "id": 364, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-364", "volume_title": "Volume 4", "body": "<h1>Chapter 364</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Veldora said with a smile.</p><br/><p>Obviously, this was his way of bullying him.</p><br/><p>He liked to tease Zaza, who could not eat.</p><br/><p>“Stop this at once! In the first place, problems always seem to arise whenever you start cooking! It’s almost as if that grill is cursed!”</p><br/><p>“How rude! I had this grill prepared for making snacks. It is by no means a haunted item!!”</p><br/><p>“That’s right, Zaza. Master’s grill is a normal grill. But then again, saying that could raise a flag!”</p><br/><p>“Kahahaha! Don’t say that, Ramiris. What will you do if something really does happen?”</p><br/><p>“That’s true, master. I will be careful!”</p><br/><p>“Yes! You should do that.”</p><br/><p>Zaza couldn’t stay angry while these two talked.</p><br/><p>He finally regained his calm and asked the biggest question that was on his mind.</p><br/><p>“This is such a dirty place. How did you even…”</p><br/><p>Zaza said that much before suddenly freezing.</p><br/><p>He had been so angry that it had escaped him at first, but he now realized that the sight before him was incredibly strange.</p><br/><p>After separating with Michelle, they had gone down an underground passage that led to the surface.</p><br/><p>This was so they could head to a different hideout that Michelle had prepared for them.</p><br/><p>As they were nearly one thousand people in all, progress was slow.</p><br/><p>And the journey would have been hard even without factoring that in.</p><br/><p>This was because they had to gather protective suits that were left at different bases along the underground passage, and everyone had to wear them.</p><br/><p>They were like astronaut suits in structure, and supplied the wearer with enough nutrition and water to survive for a week without taking them off.</p><br/><p>But while there was some mechanical aid, the suit was still heavy and a burden on the wearer.</p><br/><p>It was one thing for adults to wear them, but it was very hard for children.</p><br/><p>After some time, there were some people who started to get sick, and so it had become necessary to stop and rest…</p><br/><p>You couldn’t even eat with the suits on.</p><br/><p>While they did offer nutrition, that just meant drinking liquid food from a straw.</p><br/><p>You could not eat the meat that Veldora was cooking unless you removed the suit.</p><br/><p>And this was the surface.</p><br/><p>The atmosphere was polluted by radiation and toxic gases.</p><br/><p>Taking the suits off here was the same thing as comitting suicide. Only a crazy person would start cooking meat here.</p><br/><p>And yet…</p><br/><p>Right in front of Zaza’s eyes.</p><br/><p>Children were happily eating cooked meat and vegetables.</p><br/><p>(What the hell is happening?)</p><br/><p>Zaza could only watch in shock.</p><br/><p>“While it may be hard to believe, Zaza. This area here isn’t polluted for some reason…”</p><br/><p>Karman, who was also part of the rear guard and also very surprised, said as he reported the substance analysis results.</p><br/><p>In surprise, Zaza asked Rindo, the captain of the advance team.</p><br/><p>“Ri-Rindo! What’s going on here?”</p><br/><p>“Ah, this. It really tastes amazing!”</p><br/><p>“You idiot! That’s not what I was asking!!”</p><br/><p>“Haha. Mister Zaza. I am only joking. Well, Mister Veldora suddenly said, ‘If we’re going to have a picnic, let’s make it a barbecue! The weathers great for it!’”</p><br/><p>“So it was him after all?!”</p><br/><p>“Yes. But I thought it was odd that he would say that about the weather…”</p><br/><p>Just then, Zaza realized that it was oddly bright around where they were.</p><br/><p>As his vision was seen through mechanical eyes, it had taken him a while to notice it.</p><br/><p>But in fact, the place was filled with a light he had not seen in years. In other words, it was sunlight that shone down on them.</p><br/><p>“…Can it be…the sun?”</p><br/><p>Zaza looked up in surprise.</p><br/><p>There was a light that shone so bright that it was blinding.</p><br/><p>It was the sun.</p><br/><p>The sun should have been covered by thick clouds, but now it was showing its face.</p><br/><p>The truth was that Veldora had used his power to blow away the clouds and purify the atmosphere in this area.</p><br/><p>After that, he had used ‘Probability Manipulation’ to adjust things so that more pollutants wouldn’t fly towards them.</p><br/><p>It was an incredible thing to do so casually, but only Ramiris and Beretta knew of it.</p><br/><p>“I can’t believe it. The sun!?”</p><br/><p>“The environment here is not normal…and…”</p><br/><p>Zaza was stunned.</p><br/><p>However, Rindo spoke to him calmly.</p><br/><p>“There’s no point in thinking about it. According to Mister Veldora, ‘We’re lucky. Such a thing can happen with enough amazing ‘probabilities’ overlapping!’”</p><br/><p>He had said it with a smile.</p><br/><p>(That’s ridiculous!!)</p><br/><p>Zaza screamed inwardly.</p><br/><p>However, the reality was that this place was safe, and everyone had taken their suits off and were enjoying the barbecue.</p><br/><p>As Rindo said, it was stupid to worry so much about it.</p><br/><p>And so Zaza returned to Veldora.</p><br/><p>With no purpose in particular, he sat down on a rock and watched Veldora work.</p><br/><p>He looked so happy as he cooked the meat–which had unknown origins—on his trusty grill.</p><br/><p>Karman came to down to sit next to Zaza and then offered him one of his cigars.</p><br/><p>“Thank you.”</p><br/><p>“It’s nothing. Zaza, I’ve been thinking. That guy is probably a lot greater than we’ve assumed.”</p><br/><p>“Aye. I think so too. I don’t want to admit it, but his boundless cheerfulness has saved us. However, it pains me to see things that way. After all, he’s also quite the troublemaker…”</p><br/><p>“That’s true. Even when General Michelle came, he started frying pancakes on his grill.”</p><br/><p>“Right? And this meat. Where did he get it from? The more I think about him, the more mysterious he seems. I don’t even know how to talk to him anymore.”</p><br/><p>“Hahaha. But he doesn’t seem like a bad fellow. However, uh, ‘flags’, was it? I would not be surprised if something happens again.”</p><br/><p>“Hey-hey, stop that Karman. Everyone’s out here without their suits on. We wouldn’t be able to deal with any trouble.”</p><br/><p>It was just as Zaza had finished saying this.</p><br/><p>Karman’s expression froze on his face.</p><br/><p>“Hey-hey, stop it. Do you think this is funny?”</p><br/><p>Zaza laughed as he slapped Karman on the shoulder. Then he followed his eyes–and saw it.</p><br/><p>That thing that should have been in the world of the underground.</p><br/><p>The thing with paranormal abilities, mankind’s enemy.</p><br/><p>It was called—the Super Beast.</p><br/><p>“I told you this would happen!! That grill is cursed!!”</p><br/><p>Zaza’s scream thundered.</p><br/><p>And with that, the sudden arrival of the beast turned the scene into one of chaos and fear.</p><br/>\n</div>"}