{"title": "Chapter 375", "id": 375, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-375", "volume_title": "Volume 4", "body": "<h1>Chapter 375</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>“So, did you do it then?”</p><br/><p>“Yeah. It wouldn’t do to test it during an actual fight. I felt as if the flow of time had slowed down the moment I turned it on. It’s as if all sensations leave your body and you don’t have a care in the world. After all, you can see your entire body in your brain monitor. It’s almost as if you can see yourself from the outside and control your body.”</p><br/><p>Karman was a military man, so he was more concerned with his current state than Zaza, who mainly worked in intelligence. And so he had already checked his new features.</p><br/><p>Pain, heat, and coldness were now just numbers displayed as information. He could look at how the numbers were affected to see what damage he was taking.</p><br/><p>He tried cutting himself with a high-frequency blade as a test. The appropriate numbers dropped. However, they returned to normal after a short while and the cut on his arm disappeared.</p><br/><p>“So it has a self-repairing feature…”</p><br/><p>“Aye, it seems that it does. And when in battle mode, the Powered Suit—no, the Powered Armor, can be controlled remotely. You can call it and make it do some scouting or simple combat automatically.”</p><br/><p>“…Really!? I guess it just does everything now.”</p><br/><p>Electromagnetic storms could block nearly all forms of transmissions with the exception of the military’s secret satellite transmissions. So it was shocking that these suits could communicate wirelessly.</p><br/><p>And yet the modification surgery they had underwent now allowed them to not only communicate wirelessly, but control things remotely through ‘Telepathy Line.’</p><br/><p>It was all very hard for Zaza to comprehend.</p><br/><p>Maybe he should try pushing it—the devil whispered into his ear.</p><br/><p>However, Zaza had a will of iron.</p><br/><p>He knew that they were all looking at him now and smirking.</p><br/><p>(No. I do want to test it out in case of an emergency, but not now. I don’t want to become their plaything…)</p><br/><p>Zaza thought.</p><br/><p>“What is it, Zaza? Don’t be so modest. You should test the power out if you really want to.”</p><br/><p>“Yes, Zaza. I’m looking forward to seeing it. You should go out and fight with Karman!”</p><br/><p>But why?</p><br/><p>They were treating him like a toy. He wanted to say.</p><br/><p>“Ramiris is right. We should see which of you is the strongest once and for all. Don’t worry. As long as you take less than 80% damage, you will be able to auto-repair.”</p><br/><p>“Exactly. We used ‘Demon Steel,’ so a little damage won’t mean much to you anyway.”</p><br/><p>Veldora was insisting that Zaza and Karman have a test fight.</p><br/><p>Even Beretta was nodding. He agreed that such a thing was not likely to lead to any lethal wounds.</p><br/><p>Did they want them to fight so bad then?</p><br/><p>Perhaps they had betted money on which of them would win…?</p><br/><p>Such things went through Zaza’s mind.</p><div class=\"code-block code-block-1\"></div><br/><p>He decided that he had to find out.</p><br/><p>“Hey, Mister Veldora. You wouldn’t be betting any money on this, would you? Like, which of us is stronger. The one who is a fighter or the one with more firepower. Surely you and Ramiris would not do something so pointless?”</p><br/><p>He knew it was a little on the disrespectful side, but he still asked this through squinted eyes.</p><br/><p>The result…</p><br/><p>“O-of course, not? Of course, we are not doing something like…that?”</p><br/><p>“Wh-what are you saying!? Zaza! Who do you think we are? Why would we modify you just to test something silly like that?”</p><br/><p>“Oh, Zaza. I am glad you did not lump me in with these two. So you understand then? I have no interest in such base things!”</p><br/><p>As Zaza predicted, Veldora and Ramiris had become very suspicious in their behavior.</p><br/><p>While they strongly denied having any such intentions, their behavior was a clear answer in itself.</p><br/><p>But what was most surprising, was the Beretta seemed to be a part of it.</p><br/><p>“Mister Beretta, were you betting on this too? Which of us were you betting on winning?”</p><br/><p>While Zaza only thought about it, Karman asked him straight up.</p><br/><p>Beretta heard this and froze.</p><br/><p>(Is this Karman a fearless hero!?)</p><br/><p>Even Zaza was surprised and did not know how to react.</p><br/><p>“Ho-hohoho. How absurd, Mister Karman. Mister Veldora and the others would never involve themselves in gambling.”</p><br/><p>It was Sharma who saved the day.</p><br/><p>“You are too wise, Sharma. Zaza and Karman here are very narrow-minded. You have to look at the bigger picture!”</p><br/><p>“Ye-yes. Master is right!”</p><br/><p>“I won’t say anything this time, but be careful in the future!”</p><br/><p>After Sharma came to their rescue, Veldora and the others quickly caught on and made a successful escape.</p><br/><p>It went without saying, that this was possible because Zaza did not say anything.</p><br/><p>◇◇◇</p><br/><p>And so the fight between Zaza and Karman was dismissed.</p><br/><p>As they had covered up the fact they had been placing bets, Veldora and the others were now too afraid to push for it.</p><br/><p>Regardless, the party continued on their way to their destination without much event.</p><br/><p>No, there were some problems…</p><div class=\"code-block code-block-9\"></div><div class=\"code-block code-block-5 ai-viewport-1 ai-viewport-2\"></div><br/><p>The automated battle machines that patrolled the area.</p><br/><p>Monsters that mutated due to the radiation. These were not Super Beasts.</p><br/><p>And there were also armored cyborg bandits that were not part of the resistance, The Light of Dawn.</p><br/><p>Monsters without human hearts that lived in the ravaged land.</p><br/><p>Such threats would not let these unusual busses go without interruption.</p><br/><p>And so they were targeted. However, Karman’s men were able to deal with them swiftly.</p><br/><p>“These features are insane…”</p><br/><p>“I’m surprised, really. You just turned at a right angle, didn’t you?”</p><br/><p>“Yeah. I was moving at the speed of sound, and yet I could easily change course… My body is one thing, but how can my brain withstand that burden?”</p><br/><p>“I don’t know. I don’t understand it at all…”</p><br/><p>There was no need for Zaza or Karman to go out.</p><br/><p>Super abilities and super firepower.</p><br/><p>Their notions of what was possible had been destroyed the other day, and now Karman’s men were obliterating the enemy with overwhelming power.</p><br/>\n</div>"}