{"title": "Chapter 376", "id": 376, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-376", "volume_title": "Volume 4", "body": "<h1>Chapter 376</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>As long as they were protecting the buses, everyone was safe.</p><br/><p>“You know. I was thinking it would take two weeks if we were lucky. And over three weeks at worst. And I assumed it would be impossible for us all to reach it alive. But at this rate, we’ll arrive at our destination in just an hour.”</p><br/><p>Zaza muttered with a faraway look.</p><br/><p>It was a wonderful thing, but it was almost too easy, which made it difficult to see it as reality.</p><br/><p>They were all relaxing in an air-conditioned bus with cold drinks in their hands…</p><br/><p>Sometimes, Zaza wondered if he was dreaming.</p><br/><p>“Well, now. You’re thinking too much, Zaza.”</p><br/><p>Karman said consolingly. He then took a sip of his chilled drink as if its existence was not the strangest thing.</p><br/><p>It was pure, delicious water. And there was no fear of being poisoned.</p><br/><p>This cold and luxurious water was enough to raise Karman’s spirits.</p><br/><p>He forgot his worries and anxiety. He trusted Veldora and the others now.</p><br/><p>Zaza was feeling the same.</p><br/><p>“Yes, there is no point in worrying about things.”</p><br/><p>Zaza nodded back.</p><br/><p>If they were powerful enough to do such modifications as these in one night, then there would be little they could not do.</p><br/><p>He would only look like a fool if he kept worrying. He finally felt free.</p><br/><p>(Yes, that’s it. It’s stupid to hold on to what you think is normal!)</p><br/><p>He had finally realized it.</p><br/><p>And like that, Zaza and the rest of the party arrived at the destination that Michelle had sent them to.</p><br/><p>They punched in the code and the door to the underground hideout opened.</p><br/><p>The door was hidden behind a boulder, and beyond it were stairs that led to an underground area.</p><br/><p>It was big enough for one thousand people to live in comfortably.</p><br/><p>However, as it had not been cleaned or had life supporting machines installed, it would not be very relaxing to be in.</p><br/><p>In any case, they had to first contact the resistance’s headquarters and discuss what they would do next.</p><br/><p>There were many things they had to do.</p><br/><p>Or so Zaza, Sharma and the others thought…</p><div class=\"code-block code-block-1\"></div><br/><p>“Hey, Karman. I’ve been waiting for you.”</p><br/><p>“Reiz! If you’re here, that means the person who prepared this place…”</p><br/><p>“Yeah, it’s me. On General Michelle’s orders.”</p><br/><p>Someone was already there.</p><br/><p>In fact, it was a whole group of armored soldiers.</p><br/><p>“Karman. Who are these people?”</p><br/><p>Rindo asked him cautiously as he stepped out and in front of Sharma.</p><br/><p>However, before Karman could reply, the man called Reiz lifted his arms with a laugh.</p><br/><p>Then he said,</p><br/><p>“Hey, we’re not your enemies. General Michelle gave us a secret order to come here to the south as combat engineers.”</p><br/><p>However, Rindo did not let his guard down after hearing this.</p><br/><p>“Can you prove it?”</p><br/><p>He said to Reiz.</p><br/><p>Even Karman had only just recently heard about Michelle’s true purpose, and he wasn’t sure who he was supposed to trust.</p><br/><p>And so he gave Zaza a questioning look…</p><br/><p>“Sorry. I am not in a position to know all of the others. In fact, none of us who were sent on secret missions were allowed to contact each other. Michelle didn’t want to risk putting the rest in danger if one of us got caught.”</p><br/><p>I see. Rindo and the others nodded.</p><br/><p>However, this meant that it would be difficult to prove that Reiz was on their side.</p><br/><p>“However, wouldn’t the fact that we were waiting here prove that General Michelle had told us of the situation?”</p><br/><p>“That’s true. Rindo, you are worrying too much. General Michelle has been helping the resistance in secret and very few people are aware of it. Because it is unquestionably an act of treachery against the empire. And yet they know and are here. I think that is enough to believe that they are moving at her command.”</p><br/><p>“B-but, Mister Zaza!? If that was true, wouldn’t she have told us directly…”</p><br/><p>“No, that would be difficult. Didn’t he just say it? If someone had a loose tongue, the others would be put in danger. While I doubt it, there could be spies from the empire among us. She would be wary of such a possibility. Everyone from the empire has ‘Dog Tags’ implants. Officially, we were purged by General Michelle. That’s when she destroyed our dog tags.”</p><br/><p>“That’s right, Rindo. I don’t have a dog tag either. That’s why I can’t enter the city and had to make my scheduled reports outside. It was really inconvenient. It’s not possible to prepare a shelter like this without cooperators inside of the city. You must understand how important it is to keep their identity a secret.”</p><br/><p>“If you say it like that…”</p><br/><p>Indeed, it would not have been possible for a collaborator on the outside, without access to supplies, to be able to prepare this place.</p><div class=\"code-block code-block-9\"></div><div class=\"code-block code-block-5 ai-viewport-1 ai-viewport-2\"></div><br/><p>Rindo could understand that.</p><br/><p>“Sorry. I shouldn’t have suspected you so much.”</p><br/><p>He apologized.</p><br/><p>Reize laughed and forgave him.</p><br/><p>“Well, it’s only normal to be cautious. After all, on the surface, our job is to investigate the area and wipe out any resistance members we encounter. But, well, we’re kind of infamous as being the useless guys who often have our supplies stolen while on the move.”</p><br/><p>Reiz said. Everyone could not help but laugh.</p><br/><p>◇◇◇</p><br/><p>As Reiz and his men had set up the place, Sharma and the others were able to act quickly.</p><br/><p>They decided to leave the children with Veldora as they contacted the other leaders of the resistance.</p><br/><p>And so they went to the room with the communications equipment, along with Zaza and Rindo.</p><br/><p>“We have now arrived in the hideout provided by General Michelle, as I said we would in my last report.”</p><br/><p>Sharma said to the other directors.</p><br/><p>‘I see. So there was someone trustworthy within the empire…’</p><br/>\n</div>"}