{"title": "Chapter 381", "id": 381, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-381", "volume_title": "Volume 4", "body": "<h1>Chapter 381</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>‘Are you listening? We are cyborgs, but people think we’re weak without the Powered Suits. Well, they wouldn’t be entirely wrong, but Mister Veldora’s modification skills are incredible. I haven’t even received much damage from Jegyll’s attack just now. And the repairing ability is also great. It seems that my stomach injury will be completely healed in just three minutes.’</p><br/><p>‘I see! In that case, maybe the Powered Suits…’</p><br/><p>‘Yes. They might still be usable. So don’t lose hope, alright? If we can only escape from this supply transport ship…’</p><br/><p>He had said as much. And then that hope was cruelly crushed.</p><br/><p>“Miss Jegyll. We have finished. The Powered Suits have been completely destroyed, as you ordered.”</p><br/><p>Reiz said as he entered the bridge with a foolish smile.</p><br/><p>“Good. And the results of the analysis?”</p><br/><p>“I did try and get some data, but much of it was impossible to analyze with the equipment on board this ship. While it was a waste, I prioritized its destruction. After all, they would have combat abilities to match the Empire’s Cyborg Soldiers if they put those on. So it was obvious they had to be destroyed. But, then again, they would still have no chance against us Bionoids. Perhaps I was being paranoid?”</p><br/><p>No matter how advanced the weapon was, it could be easily destroyed before it was used.</p><br/><p>Reiz said with a laugh.</p><br/><p>This meant that Karman’s last hope was gone.</p><br/><p>“…Damn you all!”</p><br/><p>Karman shouted.</p><br/><p>“Oh? He’s still alive. Miss Jegyll, did you go easy on him?”</p><br/><p>“I thought he was just some mad dog, but he turned out to be tougher than I thought.”</p><br/><p>“I see. But then…”</p><br/><p>Reiz smiled mischievously. His right hand then transformed into a blade.</p><br/><p>He meant to deal the final blow with that.</p><br/><p>But just then…</p><br/><p>There was a loud bang followed by a small explosion.</p><br/><p>Part of the ship’s control computers had been shot with a blaster.</p><br/><p>‘Warning. The ship’s control systems have encountered a fatal error. This ship will crash in 50 seconds. I repeat. This ship’s control systems have encountered a fatal error. This ship will crash in 50 seconds…’</p><br/><p>The automatic alarm played. The scene immediately became frantic.</p><br/><p>Karman smirked.</p><br/><p>“Hehe. Well, there you go. We may not be able to win like this, but now that the ship is out of your control, we can take you down with us. This ship is going to kiss the ground faster than the speed of sound. So, are you tough enough to survive that?”</p><br/><p>He pulled out a cigar as he said this with a look of confidence.</p><br/><p>He put the cigar in his mouth and inhaled before slowly exhaling the smoke.</p><br/><p>His men were also smiling and laughing. Not one of them had a fear of death.</p><br/><p>They were ready to do what they had to has military men.</p><br/><p>“How troublesome. This cannot be fixed. Who would have thought they had blasters hidden on them. I underestimated you as some meathead, Mister Karman.”</p><br/><p>“How vexing. This is why I hate dogs. I have no idea why Michelle ever thought you ruffians would be useful to her? And why have I…”</p><br/><p>Reiz said with a shrug, and Jegyll shook her head and continued.</p><br/><p>However, Reiz then said something that crushed all of Karman’s confidence.</p><br/><p>“Too bad, Mister Karman. But we are able to escape this ship, even though it is moving at such a speed.”</p><br/><p>“What!?”</p><br/><p>“Isn’t it obvious? Unlike you ancient cyborgs, Bionoids are special.”</p><br/><p>“Exactly. I wanted to kill you with my hands, but it appears there is no time. I don’t want to die here with you, so we’ll be leaving now.”</p><br/><p>“Consider this ship a present, Mister Karman. Enjoy your luxury coffin.”</p><br/><p>Jegyll and Reiz said before evacuating.</p><br/><p>“Damn you! Come back here…”</p><br/><p>Karman’s shout echoed sadly.</p><br/><p>However…</p><br/><p>This was all according to Karman’s plan.</p><br/><p>“Phew. That was amazing, captain.”</p><br/><p>“Good work on that acting!”</p><br/><p>“We somehow made it through.”</p><br/><p>“Now we just have to survive this crash…”</p><br/><p>His men said.</p><br/><p>Karman looked at them and shouted.</p><br/><p>“You damn idiots! There’s no time to waste. Gather around!”</p><br/><p>He ordered, and they came together in a circle.</p><br/><p>Karman looked at them and nodded.</p><br/><p>“Sorry about that. But that’s what you get when you’re with me.”</p><br/><p>They stayed silent.</p><br/><p>However, they all had mischievous grins on their faces. No one looked like they regretted being there.</p><br/><p>Karman chuckled before continuing.</p><br/><p>“According to Mister Veldora, my battle body has the same structure as General Michelle. In other words, I can use the Ether Ring Barrier that only the Machinery Four can use. It might sound unbelievable, but I can see it in my brain menu.”</p><br/><p>“Are you serious…?”</p><br/><p>“I thought it was a joke too. But you’ll have to trust me on this. Well, trust Veldora anyway…as hard as that may be.”</p><br/><p>If he was lying, then they would all die.</p><br/><p>If he wasn’t, they might just survive this.</p><br/><p>In that case, Karman would laugh and believe—that was the path they would take.</p><br/><p>‘…2 seconds until the crash.’</p><br/><p>“Alright, here it goes! Ether Ring Barrier!!”</p><br/><p>Karman howled. The thermonuclear fusion reactor converted all of his energy into special wavelengths—and a ring of black particles surrounded Karman and his men.</p><br/><p>Veldora, Ramiris, and Beretta had modified the faulty feature until it was as close to the original as possible.</p><br/><p>Ether Ring Barrier—theoretically, it was a powerful shield that protected you from almost any attack.</p><br/><p>–And now, the 70-meter medium-sized transport ship was moving at a dozen times faster than the speed of sound—and it was about to crash into the ground—</p><br/><p>And Karman and his men entrusted their lives to this shield.</p><br/><p>◆◆◆</p><br/><p>At the same time.</p><br/><p>There was an earth-shattering sound.</p><br/><p>It was an explosion so large that it was as if the sun had fallen to the earth.</p><br/><p>—Six Tyrant—</p><br/><p>A weapon of the devil that the Empire had created.</p><br/><p>That being said, the principle was quite simple.</p><br/><p>An Ether Ring Barrier would be created for a brief moment. At the same time, at the peak of the hexagram in the center of the Ether Ring Barrier, six gigaton-grade atomic bombs would go off.</p><br/><p>The shock waves and heat that would result from this would not be able to be contained within the Ether Ring Barrier. This will cause unimaginable destructive power to be created inside of it.</p><br/><p>That was the Six Tyrant.</p><br/><p>With such power before them, even the Machinery Four would not go unscathed.</p><br/><p>While surprise attacks wouldn’t work on them and they could protect themselves with Ether Ring Barrier, they would likely still be burned to death before the rage of the explosion died down.</p><br/><p>It was such a horrifying superweapon that now turned its fangs on Veldora and the others…</p><br/>\n</div>"}