{"title": "Chapter 392", "id": 392, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-392", "volume_title": "Volume 4", "body": "<h1>Chapter 392</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Ramiris didn’t mean to do it, but her natural personality was only making Kristoph more angry.</p><br/><p>“You arrogant rats. You called yourselves Veldora and Ramiris, I believe… Yes, Jegyll said something about that in her report. Some secret weapon that Michelle fought with. Unfortunately, it seems that Michelle held back and now you have a false sense of confidence. You think you are a god in this small world, but I am here to give you a taste of reality.”</p><br/><p>As a fighter and Hero.</p><br/><p>Kristoph saw Veldora as an enemy.</p><br/><p>An enemy he did not have to hold back when fighting.</p><br/><p>“Kahahaha! You think you can beat me? How amusing!”</p><br/><p>“I don’t think this guy is going to quit. Get him, master!”</p><br/><p>Veldora laughed in reply. Ramiris was leaving it all to him.</p><br/><p>There was no need for Ramiris to act reserved when their victory was assured.</p><br/><p>And Veldora didn’t need any encouragement.</p><br/><p>“Hehehe. This reminds me of those days when I trained with Zegion. You have some good points as well. Your martial arts make sense, not that they would be effective on me.”</p><br/><p>As Kristoph looked on in shock, Veldora continued to be as calm as was possible.</p><br/><p>“You’ll regret your boasts in hell!!”</p><br/><p>With those words said, Kristoph himself turned into a speeding bullet of light.</p><br/><p>Veldora still stood there, confident.</p><br/><p>He would crush the insolence out of him.</p><br/><p>The afterglow remained like an illusion, confusing the senses of the enemy.</p><br/><p>Through leaving energy behind, you could disable their heat sensors.</p><br/><p>As you were moving faster than the speed of sound, measuring the sound waves was pointless.</p><br/><p>And like that, a most deadly attack was created at an incredible speed.</p><br/><p>“Maximum Impact!!”</p><br/><p>The body of a Bionoid could change shape at will and also regenerate when damaged. One of only three Star Systems that existed in this world was installed in him. This man, who was the greatest of fighters.</p><br/><p>General Kristoph, the strongest of the Machinery Four.</p><br/><p>His fists had never seen defeat in the battlefield before, and they now thrust into Veldora…</p><br/><p>…And.</p><br/><p>All of the kinetic energy bounced off into his fist.</p><br/><p>The result.</p><br/><p>Kristoph’s right arm blew off at the shoulder.</p><br/><p>“…What!?”</p><br/><p>He couldn’t help but move away from Veldora in shock.</p><br/><p>All the while, he could hear Ramiris and Veldora talking.</p><br/><p>“I knew it! Master, it’s just as I thought. This guy isn’t too different from Zaza and Karman in terms of energy. So that Michelle woman must have been special!”</p><br/><p>“That’s true. I wasn’t able to see it with Appraisal. But this guy’s energy flow is easily read. It seems like it really will be best if we cooperate with her after all.”</p><br/><p>“Yes, yes. And then we can install that engine in Beretta!”</p><br/><p>“What? What exactly are you trying to do with him?”</p><br/><p>“Why not! Then Beretta can have a major power up!”</p><br/><p>In spite of Kristoph being there as an enemy, the two seemed to have forgotten about him completely.</p><br/><p>(This is ridiculous. Can they really not see me!?)</p><br/><p>His brain felt like it was burning. A rage was welling up deep within him.</p><br/><p>He had never felt so much emotion since he had been reborn as a Bionoid.</p><br/><p>He was a being who stayed calm no matter what the situation. A pawn to be moved at Fudora’s command…That was how Kristoph had seen himself.</p><br/><p>However, it seemed that he was mistaken.</p><br/><p>(So the warrior within me has not died…)</p><br/><p>He had never felt happy about being worshipped as a Hero.</p><br/><p>He just wanted to live up to the expectations of his friend, Almsbine. That was his only wish.</p><br/><p>He remembered that now.</p><br/><p>Kristoph looked at his dismembered arm and then looked back at Veldora.</p><br/><p>Now, his heart had calmed completely.</p><br/><p>“What did you do? My fist should have had you. It had an Ether Ring Barrier around it!”</p><br/><p>He said slowly. At the same time, he tried to regenerate his right arm.</p><br/><p>He was a new Bionoid, and the features of his body obeyed his will spectacularly.</p><br/><p>In the blink of an eye, his arm was restored.</p><br/><p>“—Still, I appear to have underestimated you. Forgive my insolence. I was convinced that there was no substance that could withstand my strength. But I suppose it is not so much a feature of your body, but a type of art?”</p><br/><p>Kristoph swallowed back the anger and admitted that Veldora was powerful.</p><br/><p>The fist that destroyed everything had been blocked–the answer to this, could only be that Veldora was a master who had acquired skills that were not a part of Machinery Arts. That was what Kristoph determined.</p><br/><p>And so he tried to talk to Veldora in order to receive a hint as to what it could be.</p><br/><p>The strongest attacks were based on ultimate defense.</p><br/><p>And Kristoph had attacked safely. He hadn’t been reckless. And yet, the result had been the loss of his right arm.</p><br/><p>It was no wonder that he was shocked.</p><br/><p>However, he had still not given up winning.</p><br/><p>He pretended to talk, all the while, he ran the Star System at full power.</p><br/><p>“Oh, you can tell? ‘Flexibility trumps strength’! To put it simply, it is the secret of martial arts.”</p><br/><p>Veldora answered proudly.</p><br/><p>Of course, it was all lies.</p><br/><p>The reason that Kristoph’s attack hadn’t worked, was because Veldora was a spiritual life form.</p><br/><p>It was simply a matter of energy density that caused Kristoph’s attack to be pushed back.</p><br/><p>Veldora hadn’t even defended himself.</p><br/><p>It had nothing to do with ‘flexibility trumps strength.’</p><br/><p>If anything, it should be, ‘strength trumps flexibility.’</p><br/><p>Kristoph was the strongest man in this world.</p><br/><p>The reason for his defeat, was that he was fighting against someone from another world who seemed to move by completely different rules.</p><br/><p>It was a fight that Kristoph had no way of winning in the first place.</p><br/><p>However, Kristoph was not able to accept the reality.</p><br/><p>His ideas of the world got in the way, and he could not see any other possibility.</p><br/><p>How could it be true that Veldora hadn’t used any form of defense…</p><br/><p>Kristoph had been the strongest being in this world.</p><br/>\n</div>"}