{"title": "Chapter 393", "id": 393, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-393", "volume_title": "Volume 4", "body": "<h1>Chapter 393</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>And so when something of another level appeared, he was unable to process it.</p><br/><p>No.</p><br/><p>Perhaps his instincts did realize it. However, he was in denial.</p><br/><p>After all, Kristoph was supposed to be the greatest work of the genius Almsbine.</p><br/><p>And so he continued to judge things by what he knew.</p><br/><p>And he challenged Veldora once again.</p><br/><p>“Nonsense! Don’t you dare think that you’ve beaten me with that level of skill!”</p><br/><p>Kristoph shouted. He was risking everything based on his reputation.</p><br/><p>However, it would not pay off.</p><br/><p>“Dragon PUUUUUUUUNCH!!”</p><br/><p>Veldora allowed much of the force to weaken as his fist slammed into Kristoph.</p><br/><p>And yet, in front of such a fist, Kristoph’s Ether Ring Barrier was meaningless.</p><br/><p>It broke in an instant. And the impact caused Kristoph’s body to go numb.</p><br/><p>His rising energy had no place to go and began to disperse into the air.</p><br/><p>“No…it can’t be…”</p><br/><p>Kristoph could not admit defeat. He meant to fight as a warrior until the end.</p><br/><p>However, his timing was bad.</p><br/><p>Veldora had already lost all interest in him.</p><br/><p>After all, Fudora had just opened the door.</p><br/><p>—The door to destruction.</p><br/><p>Veldora’s instincts told him of this.</p><br/><p>He had had a bad feeling the moment that Michelle’s energy began to rise rapidly.</p><br/><p>That’s why he knew that this was no time to be playing. It was an emergency and Veldora sensed danger.</p><br/><p>“Sorry. It seems something has happened with Michelle. So I don’t have time to play with you anymore. Maybe next time. I suggest you train a little more!”</p><br/><p>Veldora said with a boisterous laugh. And with that, he and Ramiris left.</p><br/><p>Kristoph remained…</p><br/><p>“He-hehehe… Surely not. They couldn’t really have lost interest… But he was strong… Is he human? No, more important, I…”</p><br/><p>Confused, troubled, he thought.</p><br/><p>He was so disturbed that he could not stand up.</p><br/><p>Veldora’s attack had freed him from what control Fudora had over his body that had been printed into his instincts.</p><br/><p>But it would take a little while longer for Kristoph to realize this…</p><br/><p>◆◆◆</p><br/><p>Veldora reached Michelle in a single jump.</p><br/><p>It was an emergency, and so he did not hold back.</p><br/><p>He used ‘Teleportation’ without hesitation.</p><br/><p>But he almost regretted what he saw once he arrived.</p><br/><p>“…Master. This looks really bad!”</p><br/><p>“I know, Ramiris. There is nothing I can do now. Let’s leave and pretend like we didn’t see anything.”</p><br/><p>“But, wouldn’t that mean abandoning, Zaza, Sharma, Rindo, the children, Karman and everyone we met in this world? We can save ourselves, but I don’t want to abandon them as well!”</p><br/><p>“Hmm. Yes… However, there really is nothing…”</p><br/><p>“Even you can’t do anything, Master?”</p><br/><p>“I can’t. After all…”</p><br/><p>After all, the scene in front of them was very appropriate for signaling the end of the world.</p><br/><p>Alvin was making a desperate attempt to neutralize the energy that flowed out of Michelle. Fudora’s eyes bulged, blood-shot as he attempted to control it.</p><br/><p>Neither of them even noticed that Veldora and Ramiris were there.</p><br/><p>Veldora understood what was happening at a glance.</p><br/><p>His reading had revealed that Michelle had more energy than Beretta, and now it was all being released.</p><br/><p>But what was more dangerous…</p><br/><p>(To think it would be this bad. I hadn’t been able to read the power reactor, but it seems different in principle from the others. This isn’t a sun. Once a sun’s life is exhausted, it becomes a supernova—no, collapsar? The energy that is being discharged is immense, but what is most dangerous, is the speed at which it absorbs the matter surrounding it…)</p><br/><p>—This is bad, Veldora thought.</p><br/><p>It wouldn’t be impossible to nullify the leaking energy, but it would be hard to stop the power that was absorbing things.</p><br/><p>If he waited until the collapsar was satisfied, it might eventually stabilize. However, that was only if there was a single collapsar.</p><br/><p>But Veldora’s eyes caught two of them, and they were growing larger at an alarming rate.</p><br/><p>One of them was sucking the substances in, while the other unleashed pure energy.</p><br/><p>In other words, it would never be satisfied. It reminded him of Beelzebuth and its insatiable ‘stomach’…</p><br/><p>“…Because it’s like Rimuru’s power?”</p><br/><p>“Exactly.”</p><br/><p>Ramiris found the answer, and Veldora nodded.</p><br/><p>“What will you do? If this continues, everyone will…”</p><br/><p>Veldora could not immediately answer her question.</p><br/><p>Had he seriously wanted to neutralize it, he would be able to buy them quite a lot of time.</p><br/><p>However, any other methods—for instance, isolating it with a barrier… It would still be difficult to control this much energy.</p><br/><p>Eventually, it would break through, and the world would be destroyed.</p><br/><p>After all, this was on a different level.</p><br/><p>While it was fine now, if left alone, this was bad enough to swallow up the entire universe.</p><br/><p>“Oh, well… I don’t feel like it, but I’ll do what I can to stop it.”</p><br/><p>“Are you sure, Master?”</p><br/><p>“I have no choice but to try.”</p><br/><p>There was no option that included leaving things as they were.</p><br/><p>Yes, he had talked about running away, but he would have done so by now, had he really meant it.</p><br/><p>Veldora was fond of the people here who lived so desperately.</p><br/><p>The arrogant Zaza and the brazen-faced Karman.</p><br/><p>Serious Rindo and surprisingly tough Sharma.</p><br/><p>The children, who never despaired regardless of the situation.</p><br/><p>Veldora would never abandon such lovable people.</p><br/><p>Perhaps their meeting had only been a coincidence, but there must be some meaning to it.</p><br/><p>Even a chance meeting is due to fate–There was no difference between coincidence and the inevitable to Veldora.</p><br/><p>He would succeed if he was going to do it at all.</p><br/><p>Veldora’s pride would not permit failure.</p><br/><p>And so Veldora decided to use whatever he could.</p><br/><p>“It will stabilize if you can succeed in neutralizing it while I hold it back. Are you listening to me, humans? I don’t really want to, but I will help you this one time. It must be tuned speedily and completely so the size of the Mobius is identical!!”</p><br/>\n</div>"}