{"title": "Chapter 395", "id": 395, "volume": 4, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-395", "volume_title": "Volume 4", "body": "<h1>Chapter 395</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Michelle was in despair.</p><br/><p>She had been betrayed by Jegyll, the one friend who she trusted and could be real with.</p><br/><p>Her body could not move.</p><br/><p>Her brain had been disconnected from it, and now her own body felt like it was far away.</p><br/><p>Ah, I’m so tired—Michelle thought.</p><br/><p>When the ideals that her father had dreamed of were shattered, Michelle decided to live while hiding her true feelings.</p><br/><p>As a leader, she decided to prioritize the values of the majority over her own.</p><br/><p>Save those who needed to be saved, even though it came with sacrifices.</p><br/><p>You couldn’t save everyone, but save those that you could.</p><br/><p>And in the worst-case scenario, you might have to sacrifice a hundred to save one. She had that resolve when it came to politics.</p><br/><p>Kill your emotion and only act based on the logic of numbers you could trust.</p><br/><p>It was people who could do this that were fit to lead.</p><br/><p>So, no matter how much she agonized over something, she didn’t complain in front of anyone.</p><br/><p>She had always acted as if what she was doing was right. And she would lead them with pride.</p><br/><p>—However, it had been different with Jegyll.</p><br/><p>And now she was betrayed. It dealt more damage to Michelle than she could have ever imagined.</p><br/><p>And that was why the lock to the door had broken.</p><br/><p>(I don’t care about what happens now…)</p><br/><p>She muttered without a voice.</p><br/><p>Despair and then resignation. It seemed natural enough.</p><br/><p>But…</p><br/><p>–Don’t give up, Michelle. If you give up, the Mobius System will become uncontrollable—</p><br/><p>Her father’s voice awakened her consciousness.</p><br/><p>(Yes… It’s too early to give up…)</p><br/><p>Even though she could not move her body, her mind was healthy.</p><br/><p>The Mobius System was already running, but she could still…</p><br/><p>Besides, there was something strange about Jegyll’s betrayal.</p><br/><p>(Yes, now that I think about it…)</p><br/><p>When she thought back on it, Jegyll had seemed odd.</p><br/><p>Her voice and movements were the same as usual. Michelle had occasionally said things that referenced their past as they talked. And Jegyll had reacted properly every time.</p><br/><p>And so Michelle assumed that the strangeness she had felt must be nothing. However, now she considered the possibility that something she wasn’t aware of was at play here.</p><br/><p>The ‘brain’ was an important organ and was protected in several ways. That meant that hypnosis and brainwashing should not work, but she couldn’t be completely confident about it either.</p><br/><p>After all, something similar was happening to herself currently.</p><br/><p>Perhaps Jegyll had also had her ‘brain’ isolated from her body and had the information stolen—in spite of knowing very little, Michelle was able to make a guess that was very close to the truth.</p><br/><p>(If that’s true, then I cannot give up here!!)</p><br/><p>Her fighting spirit burned anew, and she considered what it was that she could do now.</p><br/><p>Her body wouldn’t move.</p><br/><p>The only thing that she could do now was to pray for Jegyll and the resistance.</p><br/><p>However…</p><br/><p>Michelle’s consciousness was combined with overwhelming energy that overflowed from her. Her thoughts now moved silently, but faster than the speed of light, towards the hearts of those she believed in…</p><br/><p>◆◆◆</p><br/><p>Michelle’s prayer reached Jegyll as well.</p><br/><p>However, it was too late to change anything.</p><br/><p>……</p><br/><p>…..</p><br/><p>…</p><br/><p>Karman had transformed most strangely. And Jegyll could no longer handle him.</p><br/><p>At first, Jegyll had had the advantage with Machinery Arts, but now, none of the attacks could deal a finishing blow.</p><br/><p>Karman had incredibly healing ability—it was superior to even the Super Beasts, and he healed immediately after Jegyll dealt any damage.</p><br/><p>No. If anything, it seemed like his defense ability was improving every time he healed. Just as a broken bone is stronger after being healed, the Dragonic Armor seemed to react as if it were a living creature.</p><br/><p>Furthermore, Karman showed that he could adapt to Jegyll’s movements.</p><br/><p>While Jegyll should have been the more skilled of the two, her attacks were no longer hitting their target.</p><br/><p>Yes, it was as if he had eyes on the back of his head. He was able to deal with attacks from all directions.</p><br/><p>And it wasn’t just that.</p><br/><p>She was able to place her palm on his armor, but it was poisoned.</p><br/><p>The powerful acid would burn her hand.</p><br/><p>The shock from the hits and the plasma that hit her upon contact. It was so bad that all of the previous damage did not seem like much to Jegyll.</p><br/><p>The various firearms and methods of counterattack.</p><br/><p>It was at the same level as the Machinery Four or even higher in terms of energy output.</p><br/><p>And this perfect defense that Jegyll could not penetrate.</p><br/><p>Karman had completely stopped Jegyll’s most powerful method of attack, End Vibration.</p><br/><p>It took apart molecules and atoms by causing a certain area to vibrate. It was an incredibly destructive skill that was supposed to be impossible to defend against.</p><br/><p>As far as Jegyll was aware, the only way to do this was to create a special barrier that rejected and sealed away any external forces…</p><br/><p>Yes, Karman was using the Ether Ring Barrier.</p><br/><p>(What’s happening? You shouldn’t be able to control the Ether Ring Barrier without the Star System… You have to create ‘ethers’ with the use of a linked particle accelerator…unless, he recreated it!? Do those strange suits they wear come with the Star System installed!?)</p><br/><p>Jegyll could not help but come to that conclusion.</p><br/><p>She didn’t want to believe it, but when it was happening right before her eyes like this, she did not have much of a choice.</p><br/><p>(How could the resistance of all people have access to such technology…?)</p><br/><p>She had so many questions, but now was not the time.</p><br/><p>As her strongest attacks had been ineffective, Jegyll had no way of defeating Karman.</p><br/><p>And before she knew it, Karman’s men had joined the fight as well.</p><br/><p>They were wearing the Powered Suits that should have been destroyed as they toyed with Reiz and his men.</p><br/><p>The Super Beasts were there as well, and the battle turned into chaos.</p><br/><p>She could not expect reinforcements or the possibility of being revived after death.</p><br/>\n</div>"}