{"title": "Chapter 405", "id": 405, "volume": 5, "url": "http://boxnovel.org/tensei-shitara-slime-datta-ken-chapter-405", "volume_title": "Volume 5", "body": "<h1>Chapter 405</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>       </p><br/><p>I beat the air with the fan so that it cracked loudly.</p><br/><p>Veldora was stunned as his eyes looked to me with worry.</p><br/><p>\"By the way, about your punishment for acting without my permission…\"</p><br/><p>I paused ominously and cracked the paper fan in the air again.</p><br/><p>I continued only after confirming that Veldora's eyes were shifting uncomfortably.</p><br/><p>\"I think I will exclude you and Ramiris from my next plan.\"</p><br/><p>\"What!?\"</p><br/><p>\"…Huh? Me too!?\"</p><br/><p>\"Yes, why shouldn't I? Both of you broke your promise and went off by yourselves.\"</p><br/><p>I said. Now it was not just Veldora. Ramiris was getting very nervous too.</p><br/><p>Ramiris seemed to assume that she had nothing to do with it. Did she really think that I would overlook her?</p><br/><p>If that was true, she was too naive.</p><br/><p>\"But I have nothing to do with this! I was just dragged in!\"</p><br/><p>\"Wait, Rimuru! There is a reason here that is deeper than the sea!\"</p><br/><p>\"Waaah! It's not like that, Rimuru!! I was abducted by Master, that's what happened!!\"</p><br/><p>\"Hey, shut up!! Stop spouting lies! You were quite happy to plot along with me!\"</p><br/><p>And then the ugly fight between them began.</p><br/><p>\"…However, I have considered the possibility of not asking about it. Thankfully, I am the only one who knows about your little escapade. So, it you would listen to what I have to say…\"</p><br/><p>I said this as if it were really too good for them. They immediately took the bait. It was quite amusing.</p><br/><p>\"KA-HAHAHA! Well, why didn't you say so sooner. Ask us anything you want, Rimuru!\"</p><br/><p>\"I'll do anything, okay? Leave it all to me!\"</p><br/><p>They were so easy.</p><br/><p>\"…I'm not sure…\"</p><br/><p>\"I swear to keep my promises from now on! We won't run away!!\"</p><br/><p>\"Me too! Besides, it's more interesting with you there, Rimuru!\"</p><br/><p>Veldora and Ramiris made their desperate appeals.</p><br/><p>Beretta was looking at them with exasperation. It was as if he knew that this would happen.</p><br/><p>Well, no real harm had come from it, and they both seemed to be sorry.</p><div><div></div></div><br/><p>\"So, no more forestalling?\"</p><br/><p>\"Yes!\"</p><br/><p>\"I promise!\"</p><br/><p>They might do it again once they forget their fear, but they should be obedient for a while.</p><br/><p>This was enough for now.</p><br/><p>And so I nodded and forgave both of them.</p><br/><p>◇◇◇</p><br/><p>\"So, what is it you want us to do?\"</p><br/><p>\"I'll do anything!\"</p><br/><p>Both of them rushed me on as if they were still worried that I would change my mind.</p><br/><p>They really didn't need to. I wasn't mad anymore.</p><br/><p>And so I left it in the past and answered their question.</p><br/><p>\"I can't really leave this world as it is, so I want to save it as soon as possible. That will be easy for you two won't it?\"</p><br/><p>I said casually.</p><br/><p>\"Hey, hey. Are you sure, Rimuru? Wasn't it you that forbid anyone from interfering too much with this world?\"</p><br/><p>\"E-exactly? Saving this world? We won't be able to do that while looking like we're not involved?\"</p><br/><p>It was incredibly rare for these two to say something that made sense.</p><br/><p>Perhaps it was due to my daily efforts to educate them. There was a sense of normalcy that had taken root and was growing.</p><br/><p>However, it was a bit late for that.</p><br/><p>\"How can we leave this world and go home, when we know that it's headed for destruction?\"</p><br/><p>Not being able to sleep at night would be the least of my problems.</p><br/><p>It would be one thing if I didn't know about it. But now that we did, I didn't think it was wrong to lend them a hand.</p><br/><p>\"Kaa-hahaha! Yes, that's true. Then I will hesitate no further in helping them. That's what you want, right?\"</p><br/><p>\"Yeah. Do it.\"</p><br/><p>I gave my permission.</p><br/><p>It would be a farewell once we returned to our own world.</p><br/><p>And so there was no need to worry about being used over and over.</p><br/><p>\"All right! All right! Can I wake up the sleeping spirits and share the power?\"</p><br/><p>\"I don't mind, but that power…\"</p><br/><p>\"Oh, don't play dumb! Of course, I'm going to get it from you, Rimuru!\"</p><br/><p>Ah, I knew it.</p><br/><p>Of course…</p><br/><p>\"Well, fine. But only this once, okay?\"</p><div><div></div></div><br/><p>\"Okay! You can trust me on this!\"</p><br/><p>But, I don't trust you at all?</p><br/><p>I thought. But Ramiris seemed very enthusiastic. There was no need to dampen her spirit.</p><br/><p>Besides, she was right about one thing. Making the spirits active again would mean extending this planets lifespan.</p><br/><p>In order to maintain an environment that was rich with nature, the role of spirits was very important.</p><br/><p>And so the two began to act.</p><br/><p>\"Let's begin then!\"</p><br/><p>Veldora shouted loudly as he returned to his original form.</p><br/><p>A great, black dragon.</p><br/><p>The aura he had been holding back was now unleashed, and immense energy now surrounded the planet.</p><br/><p>Impressive. Seeing it like this, he definitely exuded a sense of dignity.</p><br/><p>Unfortunately, Veldora's everyday attitude ruined it…</p><br/><p>\"Kaaa-hahaha! I shall give you my blessing! Fertile Paradox!!\"</p><br/><p>Immense energy was unleashed into the atmosphere-it purified the toxins and caused a miracle-</p><br/><p>Barren wasteland. Contaminated dirt. As I watched, it all started to fill with greenery.</p><br/><p>The thick clouds that obstructed the sun began to be blown away by the storm.</p><br/><p>The dark clouds that appeared were full of water that fell as torrential rain.</p><br/><p>The terrain changed and gained color.</p><br/><p>And when the rain stopped, the warm sunlight fell down on them.</p><br/><p>-Veldora had revived the greenery, created water, and filled the land.</p><br/><p>Well, well. It really was incredible when you saw it with your own eyes.</p><br/><p>Now that I think about it, I had received a complaint from Ruminas after the great war.</p><br/><p>The deserts had turned into jungles and the cities were swallowed up by the trees.</p><br/><p>She strongly reproached Veldora for being excessive.</p><br/><p>However, Veldora had run away. So I had to apologize profusely in his place.</p><br/><p>Now that I saw the scene in front of me, I could understand her complaint a little more.</p><br/><p>In conclusion, it was all Veldora's fault.</p><div><div></div></div><br/>\n</div>"}