{"title": "Chapter 7: Off to be Outstanding in Chang'an", "id": 7, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-7-off-to-be-outstanding-in-changan", "volume_title": "Volume 1", "body": "<h1>Chapter 7: Off to be Outstanding in Chang'an</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 7: Off to be Outstanding in Chang'an</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Early the next morning, Ning Que and Sangsang woke up and then began to pack in morning twilight. They had a few disputes, but they mostly kept silent.</p><br/><p>Ning Que pulled out a long bag that had been hidden under the mud wall outside, and took a bow and some arrows out of it. He checked them carefully and then handed them over once he had ensured that they were fine. Sangsang took them and put them into a big bag made of cotton. She then took out three sheathed straight knives, covered with rust, out from under the fence. Ning Que took them from her and carefully scrubbed at the rust and looked at the edge of the knives while facing the sun, he then nodded and tied them with a straw rope to his back.</p><br/><p>He took out a black umbrella from behind the door and tied it on Sangsang's back with the rest of the straw rope. This black umbrella was made from an unknown material and looked as if there was some sort black oil on it that absorbed light and it appeared a little heavy. It looked large before it was fastened to Sangsang's thin and small body but, once it was attached it almost touched the ground.</p><br/><p>After preparing for the journey, Ning Que and Sangsang climbed over the shabby fence in tandem. They looked back at the small bluestone road and the tiny run-down hut at the same time. Looking up at Ningque's jaw, Sangsang asked, \"Young master, do we need to lock the door?\"</p><br/><p>\"No.\" Ning Que went silent for a while and said, \"Evermore... maybe we hardly come back.\"</p><br/><p>...</p><br/><p>...</p><br/><p>The wooden wheel, covered by iron, rolled over the wet and soft ground. The noble's convoy set out slowly, they were going to the outside of the City of Wei. Five carriages, from the front to the rear, attracted a lot of attention on the frontier. Today, there were many people lined along the road to say farewell. However, their focus was not on the noble's carriage, but on the young man and handmaiden sitting in the first horse carriage. Boiled eggs were given to them from time to time, and some aunt, with black and red cheeks, said something and cried while clutching a dirty handkerchief.</p><br/><p>\"Wicked Ning Que, you are so bad. My distant nephew is a fine man, yet you won't allow Sangsang to marry him. Now you are taking her to those horrifying places with you! You listen carefully. You must take good care of my Sangsang!\"</p><br/><p>Sitting on the shaft, Ning Que looked awkward as he answered, \"Aunt, you have been asking Sangsang to get married since she was just 8, how could I let this happen?\"</p><br/><p>It began to rain and some of the people complained and made jokes. The slight drizzle lightly sprinkled on the line of people and it was a little cold. But, no one left, including the relatives of the soldiers of the City of Wei who were busy seeing Ning Que off or settling debts with him. The crowd was very boisterous.</p><br/><p>In the rear of the group, the most exquisite carriage's curtain opened a little, and that proud and indifferent maidservant popped her head out to look around. She couldn't help but knit her brows.</p><br/><p>When the carriages were ready to leave this border town, Ning Que stood up on the carriage and then saluted to the crowd.</p><br/><p>Carrying the three old swords on his back, the lad saluted with bare hands in the rain. This scene made him feel a little brave and grand.</p><br/><p>\"Everyone, menfolk, children, sisters, and aunts, I don't have many words to express my gratitude.\"</p><br/><p>After saying this, he opened his arms wide and clenched his fists in the rain, showing his chest muscles and his arms which were not very strong. He posed stupidly like this and shouted, \"This time I will go to Chang'an City and if I don't become someone, I will never come back!\"</p><br/><p>His words were just like the platform from which a storytelling man used to start his talk or like in Egypt when a bloody head fell to the ground. The crowd cheered for him along the way.</p><br/><p>In the only decent tavern in the City of Wei, Ma Shixiang and some of his trusted military officers were drinking. The noble had told them not to see them off and they didn't want to send the young man off either. However, they saw the scene clearly. One of the officers thought about what Ning Que had said when he stood on the carriage and he could not help but sigh. \"If he doesn't become something, he won't come back, will he? It seems that the unsuccessful lad really won't come back.\"</p><br/><p>Ma Shixiang sat at the wine table and thought about the three sentences Ning Que had said to him last night. He could not help but touch his beard and said happily with comfort at seeing that carriage leaving out the gate of the city slowly. \"It's better not to come back, you jerk. Make trouble for the outside world.\"</p><br/><p>...</p><br/><p>...</p><br/><p>They were far from the City of Wei and well into the grasslands. The spring drought that had troubled the Tribe of Savages and the new Chanyu did not make an impact here. The spring wind had made the leaves and grass green. They were crushed by wheels and trampled by the horses' hooves while some butterflies chased each other endlessly.</p><br/><p>The steeds ran through the grasslands towards hills and the soft ropes between the horses and the carriages tensed tight as iron or dropped loose as a leave. The luxury carriage was covered with some cotton quilts and blankets which billowed gently as the horses ran. The comely maidservant stared at the scene outside, flying past the window. Her face was a little stiff while she thought about the desolate northern part; her eyes were full of expectations of the unknown future.</p><br/><p>There was a boy, wearing luxurious fur clothing, hugging his legs, inside the carriage. He lifted his head from his knees and mumbled some Central Plains words, asking if he could go outside to play for a while.</p><br/><p>The maidservant turned around and rebuked the boy strictly, but she quickly softened again. She took him in her arm and hugged him while she rubbed his head favorably.</p><br/><p>The wind lifted one corner of the curtain and the spring wind touched her face, however, it was not as delicate as before. The maidservant squinted to the front of the convoy with a scowl.</p><br/><p>At the front of the line, there was the young soldier named Ning Que who was sitting on the shaft of the simple carriage. His head hung as if he were falling asleep. As a guide, he should have been actively guiding the group, but instead, he slept most of the time. He was far from being a qualified guide.</p><br/><p>Even so, that was not the reason the maidservant scowled, it was something else.</p><br/><p>Ning Que fell asleep on the shaft and looked as if he could fall down from the speeding carriage at any time. So, the small handmaiden Sangsang kept guard and watched him alertly. She supported him with her thin and small body and while her expression could not be seen clearly on her dark face, her pain could be felt.</p><br/><p>Suddenly, the carriage bounced over a very shallow stream and woke Ning Que. He rubbed his eyes and accessed the time of day. It was dusk now, so, he raised his arm and beckoned the group to stop and camp.</p><br/><p>No one protested his decision even though he had just woken up.</p><br/><p>Every decision the young man made had proven to be right ever since they had left the City of Wei. Over the last few days, this included path selection, campsites, safety defense, water and food and possible ways for evacuation. He had yet to make a wrong decision and the group was moving quite fast under his leadership.</p><br/><p>Several barbarians, which reined in grasslands, initially looked down on the border soldiers of Wei, but now they just admired the young soldier as a guide.</p><br/><p>Along the stream, people dug and leveled the ground, collected firewood and boiled water in silence. The maidservant got out of the protected carriage and found Ning Que lying on the grass comfortably while enjoying some boiled meat. Her frown deepened when she found the thin, black handmaiden getting water, she lifted the pot and collected firewood.</p><br/><p>Upon seeing her step out, a strong guard stood up. She shook her head to prevent him from following her and she walked along the stream through the fire smoke.</p><br/><p>She had to admit that Ning Que's guidance was not bad, but much better than the young men in capital city Chang'an. If he were a nobleman in Chang'an, maybe she would admire his attitude. However, he was just a poor underclassman and he bullied the small girl who should share woe and happiness with him. This made the maidservant unhappy and it invaded her thoughts.</p><br/><p>Walking over to Sangsang, the maidservant smiled at her gently and gave her a sign to put down the heavy firewood so she could talk to her.</p><br/><p>Sangsang walked toward her until Ning Que nodded to her when she saw him. The maidservant took out a handkerchief from her waist to pass it to Sangsang but Sangsang shook her head. Even though she had done a lot of work, there was no sweat to be wiped away.</p><br/><p>At this point, Ning Que finally stood up from the meadow. He dusted the grass off his body, wiping green grass juice on his coat, and made a salute to the maidservant.</p><br/><p>The maidservant didn't even turn her head and said coldly, \"I don't like you, so you can save your ingratiation. People like you look young and gentle, but in fact, you are rotten to your core and I find it disgusting.\"</p><br/><p>Saying this without emotion, she lifted her jaw and expressed her noble character even though she did not intend to keep distant. As a maidservant of the princess of Tang, she could give orders to most of the officials in the country including Ning Que.</p><br/><p>Ning Que shook his head while smiling and then turned to the mud stove near the stream.</p><br/><p>He only had the one small handmaiden while the noble had numerous maidservants. His only handmaiden was taken to chat, for fun, by one of the maidservants, and the noble still had other servants to serve her while he was left to feed himself.</p><br/><p>Maybe the sand and wind had thickened his face, but there was no awkwardness on his face at all.</p><br/><p>...</p><br/><p>...</p><br/><p>Sangsang came back with a pile of cheese at sunset, while Ning Que was staring painfully at his burnt meat porridge. Seeing the snacks, he took them from her and gobbled them up.</p><br/><p>\"Why does she like to talk with you so much? She doesn't even consider me and the fact I have not had a good meal for several days... The cheap sympathy of a noble was given in the wrong place. Her smile is like a grandmother wolf who wants to eat small girls. She thinks she is decent and warm, but she is faker than the people who sell artificial wine at the tavern in the City of Wei.\"</p><br/><p>\"She is a good person.\" Sangsang picked up the bowl of burn porridge besides him, intending to make a new one, but she was stopped by him.</p><br/><p>\"What do you talk about these days?\" asked Ning Que.</p><br/><p>Sangsang furrowed her brows and tried to recall what had been said. Then she answered, \"You know I don't enjoy talking... and she was talking about what had happened in the grasslands, most of the time. I don't remember much of what she said actually.\"</p><br/><p>Upon hearing this, Ning Que immediately felt happier. He hummed a tune while he chewed on the delicious cheese and said, \"If she wants to talk to you again, remember to tell her to pay you or let you bring back more cheese.\"</p><br/><p>Soon night fell.</p><br/><p>After the water was heated, Sangsang extinguished the fire with water from the brook and then walked to the small tent with the bucket of hot water. People near the stream were familiar with this as the small handmaiden was often seen preparing water for Ning Que to wash his feet with and they exuded disdain on their faces.</p><br/><p>Of course, their disdain was for Ning Que.</p><br/><p>After washing his feet, Ning Que slid into the wool comforter, and then hugged the small cold feet of Sangsang's in his arms. He groaned but one couldn't tell if it was from pain or enjoyment. After yawning twice, he said, \"Good night.\"</p><br/><p>Sangsang was more exhausted than Ning Que, so she had sunk into a deep sleep before long.</p><br/><p>Startled, Ning Que opened his eyes and looked up at the sky through the tent. It had patches and it took him a moment to focus on a particular handkerchief.</p><br/><p>He knew he was right when he saw the golden-edged handkerchief clutched in the maidservant' hands. But, he just didn't know what he was right about.</p><br/>\n</div>"}