{"title": "Chapter 2: Rain in City of Wei and a Lad with a Servant", "id": 2, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-2-rain-in-city-of-wei-and-a-lad-with-a-servant", "volume_title": "Volume 1", "body": "<h1>Chapter 2: Rain in City of Wei and a Lad with a Servant</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 2: Rain in City of Wei and a Lad with a Servant</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>In the spring of the 13th year of Tianqi era of Tang, there was rain in City of Wei.</p><br/><p>This military border town, which was located in the northwest of the extensive empire, was built to hold off the invasion of grassland barbarians. The cob walls were ramparted firmly around the city and they looked like a stocky earth block.</p><br/><p>When the northwestern wind started to blow in the dry seasons, the floating dust on the cob walls would flutter around and land on the crude barracks or the soldiers. The whole world would become ocher and there would be a sandstorm when people were turning their quilts during sleep.</p><br/><p>This rain was right in time and the soldiers were very pleased in this dry spring. The light rain was washing off the roofs, as if it could also wash people's eyes to be brighter.</p><br/><p>At least Ma Shixiang's eyes were pretty bright now.</p><br/><p>As the top military officer in the City of Wei, he was pretty humble now. He successfully covered his dissatisfaction with the footprints on the expensive carpet and pretended to act a little surprised.</p><br/><p>Saluting to the elder with a dirty robe sitting at a low tea-table, he said in a low voice, \"Dear Sir, does the noble need anything? If she insists on leaving tomorrow, I could send a hundred soldiers to protect her and make a record at the Military Ministry right away.\"</p><br/><p>The elder pointed at the figures inside the tent, shaking his head to agree with a smile. At that moment, a cold and arrogant woman's voice sounded in the tent. \"That's OK. Just tend to your own business.\"</p><br/><p>It took very little time for Ma Shixiang to figure out who was in the carriage when they had crashed into City of Wei this morning. So he had no feelings about her cold attitude and didn't dare to complain.</p><br/><p>The person inside the tent suddenly spoke after a while. \"The trip from City of Wei to the capital has to go through Min Mountain, right where the roads might have been washed out by the rain. Assign a guide from the army for me.\"</p><br/><p>Ma Shixiang was stunned and thought about that irritating guy. He lowered his head and said, \"There is a candidate.\"</p><br/><p>...</p><br/><p>...</p><br/><p>Several lieutenants were staring at each other outside the barracks with different looks on their faces, some with regretful or shocked expressions. Apparently, none of them expected that Ma Shixiang would choose that person to be the guide for the noble.</p><br/><p>\"General, are you really ready to let him go like this?\" A lieutenant asked with surprise.</p><br/><p>City of Wei was very small, with less than 300 soldiers including the officers. It was more like a group of outlaws. The so-called general was really just a lowest ranking officer. However, Ma Shixiang was strict with his soldiers, and as the head of the bandits, he liked to be called general. His subordinates didn't dare to talk to him without using the title general, even in the daily conversation.</p><br/><p>Ma Shixiang cleaned his face and looked at the tawny pools of water around the barracks. He sighed. \"We can't always keep him in this damn place. The recommendation letter was received six months ago. That guy has a great future and he'll go to the capital to take his first test at the Academy after all. Luckily, he could go together with that noble. Let me do her a favor.\"</p><br/><p>\"I don't think that noble will feel grateful... \" His lieutenant angrily replied.</p><br/><p>The door of the barracks was pushed open and a pretty maidservant walked in. She looked at Ma Shixiang and the lieutenants and coldly said, \"Show me the guide.\"</p><br/><p>As the noble's maidservant, she didn't hide her slight arrogance when facing the military officers of the imperial court.</p><br/><p>The prime minister's gatekeepers, nobles' closest maidservants, and princes' retainers were the three most troublesome kinds of people in all of the bureaucracy. Ma Shixiang really didn't want to deal with them. So after chitchatting for a few seconds, he called a lieutenant to go with the maidservant to find the guide.</p><br/><p>The rain temporarily stopped, washing the City of Wei clean. A few willows on both sides of the street sprouted, it was beautiful. But the city was so small that they didn't walk long to reach their destination, where there was a noisy barrack.</p><br/><p>There was a lot of noise in that house. The maidservant slightly frowned and thought, \"How could some people drink in the barracks in the daylight?\" As the door curtain was blown open, the sounds inside became clear. They were playing a finger-guessing game, but not the good sort—listening to the noise, the maidservant's face turn red and she clenched her fists in her sleeves.</p><br/><p>\"Let's play the lewd finger-guessing game! Who's dirty, you're dirty! Who's dirty, I'm dirty! Who's dirty, he's dirty!\"</p><br/><p>The noise kept up for a very long time and there was no winner. The maidservant grew angry, picked up a corner of the door curtain, and looked at those people irritably. She immediately saw a youngster at the other side of the square table.</p><br/><p>That youngster was fifteen or sixteen with a standard military, cotton-padded jacket, the front of which was full of oil and dirt. Maybe he had naturally curly black hair, or he hadn't washed his hair for a long time so it was oily and curly. However, he had an extremely clean face, therefore his eyebrows, as well as several freckles on his face were outstandingly clear.</p><br/><p>\"Who's dirty, you're dirty!\"</p><br/><p>The game was very lewd, as opposed to the youngster's expression which was significantly focused and serious. He looked holy and noble without any lewd qualities. He was gesticulating \"scissor\", \"stone\", and \"cloth\" with his right hand and it seemed that the game was more important than his life.</p><br/><p>Several green-headed flies with strong vitality were trying to land on the oil-tainted front of his cotton-padded jacket and were driven off by the youngster's fists.</p><br/><p>\"I won!\"</p><br/><p>The finger-guessing game was so long that it would cost all the air in the two battlers' lungs, and it finally came to the end. The black-haired youngster wielded his right arm to declare his victory and laughed happily with a cute dimple on his left cheek.</p><br/><p>But the youngster's opponent wouldn't surrender. He insisted that the youngster had changed his gesture during the final game. Therefore, they were arguing and every soldier in the room took sides. At this moment, a voice sounded from nowhere. \"Follow the old rules. Sangsang has the final say.\"</p><br/><p>Everyone looked at the corner in the room where there was an eleven-year-old girl moving a bucket. She was short and thin, with dark skin and common eyes. She was wearing loose handmaiden clothes, which seemed to be stolen from somewhere by her master, and carrying a bucket which was heavier than herself.</p><br/><p>That little handmaiden named Sangsang put down the bucket and turned around. The soldiers looked at her nervously, just like gamblers that were waiting for the dealer to reveal the outcome of a dice game. And obviously, it wasn't the first time for this scene.</p><br/><p>The little handmaiden frowned and gave the youngster a look. Then she looked at that angry soldier at the other side of the table and said seriously, \"At round twenty-three, you were showing a 'scissor' and he a 'stone'. But you said, 'He's dirty.' So you lost.\"</p><br/><p>The room was filled with laughter and the people cleared out of the room. The soldier paid unwillingly with dirty words. The youngster happily accepted the money, wiped it with the oil and dirt on his chest, and then touched the soldier's shoulder to comfort him.</p><br/><p>\"Take it easy. In City of Wei... no, in the whole world, no one can beat Ning Que.\"</p><br/><p>The maidservant's face turned ugly, so the lieutenant's face was ugly too because he was observing her. He clutched the curtain in his hand and took a deep breath. He was trying to cough but was stopped by the maidservant.</p><br/><p>The maidservant stopped the lieutenant and followed that youngster and the little handmaiden as they left the barracks. She observed and watched quietly. No one knew what she intended to do, and the lieutenant had to believe that the noble's close supporters were all filled with eccentricities.</p><br/><p>That youngster named Ning Que didn't do anything special along the way. He leisurely bought some food and said hello to the fat aunt in the tavern. The only thing weird which made the maidservant feel strange and angry was that the thin little handmaiden was trying to drag the bucket, but the youngster wasn't willing to help.</p><br/><p>The empire was a strictly hierarchical state. But people here were simple and honest. Even in the capital Chang'an, where it was flashy and gloomy, the most indifferent noble couldn't see such a thin and weak girl of eleven or twelve carry the bucket so strenuously without being moved.</p><br/><p>\"Are soldiers allowed to have a maidservant?\" the pretty maidservant asked depressingly.</p><br/><p>The lieutenant scratched his head and answered, \"Numerous immigrants rushed to the south and the borders during the years of the drought in Hebei Province. There were dead people everywhere. It's said that Sangsang was saved by Ning Que from among the dead bodies, and because Ning Que was also an orphan, the two of them have lived together since then.\"</p><br/><p>\"And then he registered to be a soldier and his only condition was to take this little girl with him.\" He looked at the maidservant and carefully explained. \"It's known that this isn't allowed in the army, but their situation is special. After all, we couldn't sentence a little girl to death. So everybody just ignored it.\"</p><br/><p>Listening to this explanation, the maidservant's face looked a little better. But when she saw Ning Que strolling with a grilled half-chicken and the little handmaiden dragging the bucket behind him with difficulty, her mood turned bad again. She coldly said, \"This isn't living together, this is killing her.\"</p><br/><p>City of Wei was indeed small. Not long after, those four people arrived at a cabin in the south, with small stones on the ground outside. The cabin was surrounded by crude fences. The maidservant and lieutenant stood outside and looked at the cabin.</p><br/><p>The little handmaiden moved the bucket, which was half her height, to the water vat and stepped on the stool, tried her best to pour the water into the vat. Then she began to wash rice and vegetables. She took up a dust cloth to wipe the tables, chairs, doors, and windows before the rice was steamed, and sometimes her body was enveloped by the steam.</p><br/><p>There was a rain last night and left an ugly trace on the windows. The little handmaiden cleaned the traces of the raindrops and the cabin was soon clean and bright.</p><br/><p>Apparently, she did all this every day and she did it expertly. But still, there was compassion for her, seeing her working like an ant with sweat and a red face.</p><br/><p>There were no such feelings held by Ning Que. He lay on a bamboo chair peacefully with an old book in his left hand. He wrote on the wet ground while reading. When he ruminated with his hands stretching, a cup of hot tea was put into his hand.</p><br/><p>The soldier in City of Wei was familiar with this scene, so he wouldn't be surprised, but the maidservant wasn't. Especially when she saw the little handmaiden busy with cooking while looking after the lad, she became pensive.</p><br/>\n</div>"}