{"title": "Chapter 1: The Beginning", "id": 1, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-1-the-beginning", "volume_title": "Volume 1", "body": "<h1>Chapter 1: The Beginning</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 1: The Beginning</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>A long long time ago, there were many unknown places, in which there lived many unknown people.</p><br/><p>...</p><br/><p>...</p><br/><p>The sun was a massive fireball setting in the distance of the wilderness, radiating blistering red flames, retracting at a slow continuous decline. The newly sprouted moss that had appeared after the snowmelt had spread everywhere, and resembled burn scars. Silence prevailed, only to be interrupted by the occasional screech of an eagle or the trotting sound of gazelles in the distance.</p><br/><p>There were three individuals that stood in the open and barren wilderness, and under a small tree, is where they had gathered. They didn't greet one another, instead, all three of them were looking down in tacit unison as if something under the tree had sparked their interest and was worthy of careful inspection.</p><br/><p>There were two ant colonies fighting around the tree's roots that had broken through the icy soil. Perhaps a home as perfect as this was truly hard to find in this desolate place, and the battle was getting brutal, instantly leaving thousands of dead ant bodies behind. This might have sounded very tragic and bloody, though, in reality, all that was left was a peppering of little black dots on the ground.</p><br/><p>The weather was frigid, but the three individuals weren't wearing much as if cold didn't bother them at all. They kept watching attentively, until one of them broke the silence and whispered, \"In this worldly kingdom of ants, wherefore is the Grand Tao?\"</p><br/><p>He was a slim, short and boyish-looking lad, wearing a pale blue collarless shirt, and he was carrying a sheathless, thin wooden sword. His jet black hair was carefully combed into a bun and held in place with a wooden fork that looked like it could slip out at any time, but at the same time, it remained unshakably rooted, firmly, like a pine tree.</p><br/><p>\"While the chief monk was preaching, I saw countless ants flying up as they bathed in the sunlight.\"</p><br/><p>It was a young monk who spoke this time. He was dressed in tattered cotton kasaya, and there was black, sharp, stubble sprouting from his scalp. This somehow resembled the strength and determination written on his face and conveyed by his words.</p><br/><p>\"Ants may be able to fly, but they will fall eventually. They shall never touch the sky,\" the lad carrying the wooden sword exclaimed as he shook his head.</p><br/><p>\"If you hold this belief, then you will never be able to understand the true meaning of the Taoist Heart,\" said the young monk as he slowly blinked his eyes, still looking down at the warring ant colonies, \"I heard your temple dean recruited a new child disciple with the surname of Chen. Then you should understand that you would never be the only prodigy at a place like the Zhishou Temple.\"</p><br/><p>The lad with the wooden sword raised an eyebrow and replied with a sneer, \"I will never understand how someone constrained like you is qualified to represent Xuankong Temple as its wayfarer in the world.\"</p><br/><p>\"The ants will fly, just like they will fall. However, they are better at climbing, and they are good at letting their fellow ants climb upon them. They are not afraid of sacrifice and as they pile upon one another, as long as there are enough of them, they shall eventually pile up high enough to touch the sky,\" said the young monk as he ignored the defiant comment and continued gazing at the anxiously scurrying ants below.</p><br/><p>Amidst the increasing twilight, an eagle screeched sharply, sounding terrified. Perhaps it was the three strange individuals standing under the tree, or maybe it was the imagery of an enormous pile of ants that had reached the sky, or could it be something else entirely?</p><br/><p>\"I am really frightened.\"</p><br/><p>The wooden sword lad admitted abruptly while straightening his thin shoulders.</p><br/><p>The young monk agreed by nodding, even though his facial expression remained just as calm and determined.</p><br/><p>The third youth standing under the tree was of strong build and wrapped in clothing that resembled animal skin. His naked legs were as solid as rock and under the rough skin, the muscles seemed to contain explosive strength. He had remained quiet, without uttering a word, and yet the goosebumps on his skin exposed how he really felt at that very moment.</p><br/><p>These three young men came from the three most mystical places of the universe, wayfaring this world under the order of their respective sects. They resembled the brightest of the stars across the world, but even they could not help but sense an overwhelming fear as they stood here in the wilderness on this day.</p><br/><p>Eagles should not fear ants since they are simply black dots to the former. Ants should not fear eagles either because they are not even worth a bite to the eagle. The world of the ants had never seen or heard of a creature as powerful as the eagle, hence the latter remained unfathomable to the former.</p><br/><p>Nevertheless, over the span of many centuries and millennia, a few very distinguished ants among the crowd would, out of enigmatic reasons, decide to strip their gaze from the rotten leaves and just for once, gaze up at the crystal blue sky...and then, the world was never the same to them.</p><br/><p>The fear comes from seeing.</p><br/><p>...</p><br/><p>...</p><br/><p>The three youths were now looking at a shallow ditch only a few dozen feet away. There was nothing but darkness in the ditch, and it contrasted sharply with the mottled surface of the wilderness.</p><br/><p>The ditch had appeared out of nowhere about two hours ago and immediately stretched all the way off into the horizon as if it was hacked by an invisible ghost with a massive hatchet the size of a mountain, or drawn out by a pillar-sized brush used by the divine craftsman. This was utterly shocking, puzzling and terrifying.</p><br/><p>\"I always thought Invariant Yama was just a legend,\" said the wooden sword lad as he stared at the black gash.</p><br/><p>\"According to the legend, Invariant Yama bore seventy thousand offspring, perhaps one of them happened to be wandering in this world.\"</p><br/><p>\"Legend is just legend,\" said the wooden sword lad, with a poker face, \"Legend says a sage shall be born every millennium, and who has seen one in the past few millennia?\"</p><br/><p>\"If you really didn't believe in it, why don't you dare cross that black slash?\"</p><br/><p>No one dared to cross the shallow ditch, regardless of how proud or powerful they may be.</p><br/><p>Ants could crawl over it, insects could hop over it, gazelles could leap over it, eagles could fly over it, but not the humans.</p><br/><p>They dared not cross it, precisely because they are human.</p><br/><p>\"If that child really exists, then...where is he?\" asked the wooden sword lad as he gazed off at the horizon.</p><br/><p>By that time, the sun was almost set and darkness poured in from all directions while the temperature in the wilderness plummeted. A harrowing sensation began to unravel throughout the world.</p><br/><p>\"The dark night has befallen, and it is spreading everywhere. Where could you search in this?\"</p><br/><p>The youth in animal skin finally broke his silence. In contrast to his age, his voice sounded deep and coarse, its vibrations resembling that of a tumultuous river, or the sound of rusty blades being sharpened on rocks.</p><br/><p>Upon saying this, he left, in a rather peculiar way.</p><br/><p>Several flames suddenly flared up from his strong naked legs, wrapping his lower body in a burst of crimson red, while the howling wind rolled the fine rocks off the ground incessantly. Then, as if grabbed by a source of an invisible force, his body flew up more than 40 meters into the sky, then he was howling and pounding down on the ground, and with this impact he bounced up immediately. Like this, the youngster bounded away like a rock in a seemingly arbitrary manner, looking extremely clumsy yet with extraordinary strength and speed.</p><br/><p>\"His name is Tang, just Tang. I don't know his full name.\"</p><br/><p>Thoughtfully, the wooden sword lad stated, \"In another time and in another place, between him and I, only one will live. How powerful would his master be if the disciple is already so adept? ... I heard his master has been pursuing the practice of '23 Year Cicada', I wonder whether he will end up carrying a thick shell once he emerges.\"</p><br/><p>There was nothing but silence. No one said anything. Puzzled, he turned his head.</p><br/><p>The young monk had his eyes tightly closed, his eyelids trembled, as if thinking hard about something that was truly perplexing, actually the young monk had withdrawn himself to this bizarre state ever since the other youth in animal skins spoke the words about the dark night.</p><br/><p>Sensing his gaze, the monk slowly opened his eyes and grinned, showing a sense of mercy instead of what used to be a determined and calm expression. Crushed flesh, blood, and what remained of his chewed up tongue showed through his slightly parted lips.</p><br/><p>The wooden sword lad frowned upon seeing this.</p><br/><p>Slowly he removed his prayer beads from his wrist and solemnly put them back around his neck, the young monk walked away. His footsteps were heavy and steady, very slow, yet his shadow almost disappeared afar in an instant.</p><br/><p>Left alone under the tree, the wooden sword lad erased all emotion from his face, showing absolute calm, or more like an absolute indifference. Gazing at the rock-like bouncing shadow in the distant northern dust, he scoffed, \"Evil devil.\"</p><br/><p>Then gazing off at the shadow of the young monk walking quietly towards the west, he stated, \"Heretic outcast\".</p><br/><p>\"Unworthy.\"</p><br/><p>The Tao of the evil devil and the heretic outcast is one that is unworthy.</p><br/><p>After making his statement, the thin wooden sword he carried on his back whistled and vibrated unprompted, suddenly turning into a ray of light as it shot up in a squeal, shredding the small tree into 53333 parts, turning its leaves, branches, and trunk into a fine dust that was raining down onto the euphoric ants.</p><br/><p>\"The mute shall utter words, salt to be sprinkled to the bread.\"</p><br/><p>The young lad strolled towards the east while humming a song, and the little wooden sword followed quietly, drifting in the air just a few meters behind him.</p><br/><p>...</p><br/><p>...</p><br/><p>In the first year of the Great Tang's Tianqi era, the most extraordinary phenomenon had befallen the Wilderness, gathering World Wayfarers from all of the sects, to no avail.</p><br/><p>Starting from that day, Qinian the successor of the Xuankong Temple never uttered another word as he began to practice a Silent Meditation. Tang, the successor of the Devil's Doctrine had become a recluse off in the desert, his whereabouts still remained unknown. Ye Su, the successor of Zhishou Abbey, conquered his ultimate bottleneck and went about touring the nations. All three of them seemed to have gained something.</p><br/><p>Unbeknownst to the three of them, on that very same day, as the dark night was about to fall, on the other side of the black ditch that no one had dared to cross, by the side of a small pond not far from the capital, sat a scholar. A scholar wearing straw shoes and a ragged coat.</p><br/><p>The scholar seemed oblivious to the powerful and forbidding nature that the black ditch stood for. He simply sat there, with a book in one hand, and a wooden cup in the other. He read a book when he could, took a rest when he was tired, drank water when he was thirsty, looking perfectly happy and peaceful despite his thorough dusting.</p><br/><p>As the three people from afar left and as the sand managed to gradually fill up the shallow black ditch splitting The Wilderness, the scholar finally stood up. He lightly dusted off his clothes, tied the wooden cup to his waist and carefully put his book back inside his coat. He then glanced briefly towards the direction of the capital before walking away.</p><br/><p>...</p><br/><p>...</p><br/><p>There was a long lane in the Chang'an capital, to its east sat the residence of the Counsel Official, and to its west sat the residence of the Xuanwei General. Albeit they were not considered top-notch officials, even though they boasted a deep sense of power and authority. While this area normally enjoyed a lovely peace and quiet, that was not going to be the case today.</p><br/><p>The residence of the Counsel Official was to receive good news, as the midwives were busy at work. Strangely, everyone from lords to young maids looked as if their joy was mixed with some other emotion, and no one dared to laugh. The maids holding water basins, rushing, around the corner of the wall even looked terrified as they overheard the noise coming in from outside.</p><br/><p>The famously fearless and valiant Xuanwei General Lin Guangyuan was no longer to be fearless or valiant, as he had displeased the empire's number one fearless and valiant general Xiahou. He had been accused of treason for colluding with the enemy, and after several months of interrogation by His Highness the prince, the outcome was finally settled.</p><br/><p>The outcome was clear and the punishment simple: confiscation of all property and decapitation of each and every person in his family.</p><br/><p>The gates in front of the Counsel Official's residence remained firmly closed. The chamberlain nervously peeked through his gate at the similarly firmly closed gate of the general's residence. He could overhear the sounds of heavy blades hacking into flesh, and a sound that resembled watermelons rolling around the floor, he couldn't help but shiver in fear.</p><br/><p>The two families had been neighbors for many years, and he knew them well over at the General's Residence, from the chamberlain to the gatekeeper. Listening to the terrifying sounds coming from across the lane, he could almost visualize the countless sharp blades cutting open their necks, their heads with their familiar faces rolling relentlessly on the quartzite floor, then clashing with the door, and eventually piling together in a heaping bloody mess.</p><br/><p>Blood seeped under the gate of the General's Residence, looking rather dark and sticky, like sticky rice puree mixed with cinnabar, containing some bits and pieces of flesh that looked like purple yam mash. The chamberlain stared at the sight his face as white as a sheet. No longer able to contain his emotions, he doubled over while bracing on the door, and promptly began to vomit.</p><br/><p>Suddenly there was the hurried sound of horses approached from outside the gate, and people being chided, followed by abrupt knocking sounds. There was a faint cursing and then yelling that seemed to say that someone had escaped from the General's Residence. From his horse, a private general of the Prince's Residence yelled his order at his men, \"No one can go missing!\"</p><br/><p>Meanwhile, there were scratches and blood stains on a wall in the inner gardens of the residence of the Official of Counsel.</p><br/><p>\"Young master, please listen and obey, you must not go out, let Xiaochu go, let him go please...\"</p><br/><p>Inside a firewood shed not far from there, a blood-soaked chamberlain of the General's Residence stared at a pair of 4-5 year-old boys, his lips trembled as he uttered deeply unpleasant and husky sounds, while his wrinkled and dirty face expressed nothing but despair and struggle, so much so that murky tears squeezed out of the corner of his eyes.</p><br/><p>It didn't take the Yulin Royal Guards long to find this firewood shed once they had broken into the Official of Counsel Residence. Upon carefully inspecting the two dead bodies of an old man and a little boy, the lieutenant looked relieved and reported energetically: \"All dead, none are missing.\"</p><br/><p>...</p><br/><p>...</p><br/><p>The easiest way to depict the term of \"unworldly sublime being\" is that sublime beings are normally unworldly, thus those who are unworldly tended to be sublime beings. This is quite obvious, though there is some sense in it. To the mere mortals, what the sublime beings fear is often out of their reach, and their joys are similarly unfathomable.</p><br/><p>As a result, the mortal world remained ignorant of what happened outside of their realm, while the unworldly would pay no attention to the deaths or births taking place in the mortal world. Just like they wouldn't care about a butcher's scale being tricked, a drunkard's cellar being chewed through by rats, the death of a Xuanwei General, or some government official welcoming a newborn daughter.</p><br/><p>There was never any connection between the joys and sorrows of the two worlds.</p><br/><p>It would take the power of a saint if a connection was ever to take place.</p><br/><p>In the suburbs of Chang'an capital stood a high-rising mountain that was mostly hidden up in the clouds. Along the steepness of its west side, a man was climbing up slowly. He looked very tall and strong from the back, wearing a black jacket over a thin shirt and holding a meal box.</p><br/><p>He finally managed to work his way against the wind and arrived at a cave, he sat down, opened the meal box, took out his chopsticks and picked a slice of ginger which he put into his mouth and chewed carefully, followed by another two slices of lamb, and let out sigh showing pleasure and approval.</p><br/><p>Chang'an at sunset was soon to be obscured by the dark night, while a heavy rain and dark clouds were gradually approaching from afar.</p><br/><p>\"It almost feels like I am seeing you like in the old times,\" said the tall man rather emotionally, as he gazed at some place within the capital.</p><br/><p>Then he raised his head to look at the sky, and pointing at it with his right hand, he said: \"And you, what is the point of flying so high after all?\"</p><br/><p>Obviously, he was talking to two different people.</p><br/><p>After a brief silence, the tall man downed his bowl of rice wine in one gulp, and held up the empty bowl and cheered in all directions around him saying, \"wind blowing, rain falling, and the night shall befall.\"</p><br/><p>As if in unison with his words, the wind came from beyond the mountain, blowing through his collar making a howling sound, and the old trees rooted on the rocks shook fervently while the mountain rocks kept falling. The cloud that hovered on top of the capital suddenly darkened, and countless threads of rainwater joined each other to splash down amidst the last shred of twilight. By the time he uttered the last word, a dark night had prevailed covering most of the sky, making it as black as the pupils of the king of hell.</p><br/><p>The man slammed down the wine bowl, and muttered angrily: \"So damn black...\"</p><br/>\n</div>"}