{"title": "Chapter 17: Out of the Mountains with a Little Girl", "id": 17, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-17-out-of-the-mountains-with-a-little-girl", "volume_title": "Volume 1", "body": "<h1>Chapter 17: Out of the Mountains with a Little Girl</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 17: Out of the Mountains with a Little Girl</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>This brutal and bloody battle came to an end. Something in the survivors' eyes had changed when they looked at Ning Que. Since they left the City of Wei, they might have perhaps treated him as a competent guide, but surely not a decision maker. When it came to something important, he was no more than a large rock in their eyes. But now, with the end of this battle, everything seemed to have changed, as they would voluntarily consult Ning for anything.</p><br/><p>Having received approval from Her Princess, the bodyguard leader followed Ning Que's advice for their next move. They would not immediately retreat from the mouth of Northern Mountain Road, and rather, they would stay where they were for some rest and recuperation while hoping their aid would reach here before dawn.</p><br/><p>Lyu Qingchen, pale and weary, silently watched the lad by the bonfire, with an imperceptible smile crossing his face. The elder rubbed his thumb against his index finger slowly, and then gently shook his head.</p><br/><p>Two bonfires were made nearby the carriage. Although the forest and shrubbery were dense, there was no worry of a fire disaster, as the leaves were laden with night dew. The bodyguard leader and the others who were wounded gathered at one bonfire, saving another for Her Princess, the lad, and the elder. As bad as a situation like this was, the guards never forgot subordination.</p><br/><p>After binding the wounded and having some food, the grassland barbarians couldn't help drinking spirits and passing around bags of wine. When a bag passed to Sangsang, she softly shook her head. The barbarian named Dumu walked up to Ning Que with a solemn and respectful look, passing his wine bag to him with both hands.</p><br/><p>Noticing this unusual scene, the princess raised her eyebrows and was certainly aware that, before they kneeled to her, these loyal barbarians were the unruly Horse Gang on the grassland. Seldom did they show their respect to someone who was not one of their kind. A distinct fear emerged on their face. \"Given what just happened, Ning Que did save their lives and they probably felt indebted, but where on earth did the fear come from?\" She wondered.</p><br/><p>Taking over the wine bag, Ning Que swallowed a gulp, instantly furrowing his brow—it was quite strong! With his heart pounding fast, Ning Que, seeing the elder sitting by the bonfire, propped up his weary body, stood up, and walked towards him. Before he could manage a bow or put his palms together devoutly, or even kneel down when he did as a child for respect and inquiry, a faint sound caught him unexpectedly.</p><br/><p>\"Sit.\"</p><br/><p>Ning Que turned his head, looking at the maidservant, whose face was glowing, lit by the firelight, and his heart gave out a soft sigh. Ning Que gave a salute to her in a reverent fashion, and sat down somewhere neither close nor far from her.</p><br/><p>He insisted, much different from what others appraised the princess to be, that she was a dimwit. Well, no matter what he thought of her, she was far superior to him, as a shining star in the sky was to a base worm in a paddy field. Therefore, he was still required to pay attention to his manners and be respectful.</p><br/><p>The reason for this was quite simple, which was that she was the Fourth Princess of Tang Dynasty, Lee Yu, and by no means some ordinary maidservant.</p><br/><p>Examining Ning Que's young and plain face, Lee Yu could not recognize anything special, except some speckles on his cheeks and dimples whenever he smiled, a couple of times perhaps.</p><br/><p>It was this ordinary soldier's valor in the battle that made her feel like she was watching a fierce tiger springing from the bushes for prey. For some unfathomable reason, a sense of calmness came over her as long as she knew Ning Que was around, though she still dreaded to think of the not-long-ago assassination.</p><br/><p>She thought, \"Maybe it's this fearless 'tiger' that's guarding me.\"</p><br/><p>The problem was that she did not like this lad whatsoever, based on what she observed since she pretended to be a maidservant. She quitted the disguise, finding herself still not able to take a liking to this little solder's manner.</p><br/><p>To her dismay, she felt that what Ning Que did for her was mere pretense, not out of his heart, and even sensed that he often derided her behind her back. You must admit that a woman's instinct was sometimes her most powerful weapon—be it for rural housewives, or for sullen royalties in courtyards.</p><br/><p>The most honorable princess of the Tang Dynasty had every reason to be angry as long she thought someone was mocking her. Now, nevertheless, the princess felt a sense of comfort, security, and protection sitting together with him by the bonfire.</p><br/><p>She quite enjoyed this feeling, and yet was a bit dissatisfied with the fact that it was Ning Que who caused such emotions. Feeling somewhat embarrassed, she intentionally adjusted her tone to somewhat cold and insensitive.</p><br/><p>\"During the assassination earlier on, it seemed you that were trying to save me?\"</p><br/><p>Lee Yu thought to herself, \"Anyway, that was not me in the carriage at the time, your intention to save the princess was no grander than your ambition to win honor for yourself.\"</p><br/><p>\"I knew you were the real princess since you were in City of Wei.\"</p><br/><p>Ning Que explained to her in earnest, \"As the maidservant was the real princess, so the one in the carriage should be someone else. This little act may be helpful when luring the enemy, but only a shoddy trick to the one who is observant.\"</p><br/><p>Frowning, Lee Yu didn't ask him how he could recognize her real identity. She slowly formed a good impression of him after the battle mostly because of the sense of security he gave her.</p><br/><p>She suddenly asked coldly, \"You said you learned your killing skills in the military, but till now you're only fifteen or so. You were no more than a kid when you were enlisted. How come the military would enlist you?\"</p><br/><p>Planning to make up something to fool her, Ning Que thought,\"You married off to the far-away grassland at sixteen, why couldn't I be enlisted at that age?\" At that time Sangsang quietly walked over and sat beside him.</p><br/><p>Watching Sangsang sitting beside him and the dancing fire nearby her, Ning Que suddenly softened and said, \"You must already know that I met Sangsang on the road. We were very little then, and were somehow lost in Min Mountain. We met an old hunter as we were almost dying of thirst.\"</p><br/><p>He raised his head, saw the princess' profile, and continued, \"The old hunter was not a sage or master. He saved us, but this proved nothing. Anyway, he taught me how to hunt. Later, he died. I and Sangsang, we lived off what I hunted in the mountain.\"</p><br/><p>Though a very simple and short account about his childhood, vivid pictures flashed before the princess' eyes. A ten-year-old boy carried a five-year-old girl on his back, searching in a mountain full of beasts and perils. He carried a small boxwood bow and the girl had a barrel of arrows.</p><br/><p>They might get nothing for days, or might be chased by a leopard and fall off of hills. They might get excited just about a dead rabbit, or might watch the lights from a small village for a time from a distance, and then silently walk away.</p><br/><p>Now Lee Yu reckoned that Ning Que seemed not to be as awful as he was before, and asked, \"Living in the mountains is quite dangerous, why didn't you just go to the local council? The allowances for orphans in our country are generous and fair.\"</p><br/><p>Ning Que lowered his head, picked up a charred piece of wood and said in a soft tone, \"It's easier to live in a place with fewer people.\"</p><br/><p>Such a simple reason, but yet it revealed the kinds of hardship they had met. Lee Yu stared at the two with no words, asking suddenly, \"How, how did the old hunter die?\"</p><br/><p>Ning Que lifted his head, and answered peacefully, \"I killed him, with a knife.\"</p><br/><p>As for why he did so, he didn't say further, and would not explain it to this princess, who would never understand how base and dark life was for people like them, and probably never to anyone. He caressed Sangsang's little head gently, holding her in his arms closely.</p><br/><p>...</p><br/><p>...</p><br/>\n</div>"}