{"title": "Chapter 24: You Were Supposed to Know My Talent...", "id": 24, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-24-you-were-supposed-to-know-my-talent", "volume_title": "Volume 1", "body": "<h1>Chapter 24: You Were Supposed to Know My Talent...</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 24: You Were Supposed to Know My Talent...</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>\"Everyone says that there are countless martial warriors and Sword Masters in Chang'an, such a statement is way too exaggerated though. But this is the capital, after all, the most prosperous place with numerous elites from around the world. In Chang'an, you don't need to worry about anything while in the academy, but you do need to be careful about your words and actions outside to avoid conflicts.\"</p><br/><p>\"I see,\" Ning Que answered, and then asked, \"Sir, are there any people or groups that I need to pay extra attention to? Or are there any powerhouses?\"</p><br/><p>Lyu Qingchen glanced at the lad and sneered. \"I remember it was you who didn't want to talk about this the other night.\"</p><br/><p>Ning Que laughed embarrassingly and rubbed the back of his head.</p><br/><p>\"That doesn't matter though.\" Lyu Qingchen laughed and shook his head, saying, \"There's one thing you should bear in mind, which is, although there are a lot of factions of cultivation, the major ones are always Buddhism, Taoism, Devil's Doctrine, and the academy. Buddhism is usually located in desolate places, Taoism builds many abbeys in various places, not to mention Devil's Doctrine. Haotian Taoism, which I was from, has formidable cultivators for each generation and they're all respected by royal families of every country. If you have ever heard of the West-Hill Divine Kingdom, you would know that it's precisely the main abbey of Haotian Taoism.\"</p><br/><p>\"Respected by each royal family? Even the Tang?\" Ning Que asked with his eyebrows wrinkled.</p><br/><p>Lyu Qingchen smiled bitterly. As the strongest force around the world, the Tang was the only one who dared not to bow down to Haotian Taoism, and Haotian Taoism could do nothing about it. So, Lyu still faced an embarrassing situation in Haotian Taoism as a citizen of Tang.</p><br/><p>\"What about Devil's Doctrine? Do they have any special elites?\" Ning Que changed the topic as soon as he noticed that the elder started feeling embarrassed. \"Speaking of which, I remember that you said the techniques the Great Sword Master used in the Northern Mountain Road are the Dark Methods. But I'm curious about what kind of skills can be considered as real Dark Methods? \"</p><br/><p>Hearing the words 'Dark Methods', Lyu Qingchen turned serious and said, \"Forget everything about it and don't tell this to anybody.\"</p><br/><p>\"Yes, sir.\"</p><br/><p>\"No matter if in Buddhism, Taoism or the academy, positive cultivation requires sensing the breath of nature to reach harmony. Controlling primordial Qi is basically like using the forces of nature.\"</p><br/><p>Lyu Qingchen closed his eyes and it seemed like he recalled something. Then he said pensively, \"Devil's Doctrine is different from any other factions. People in it absorb the Qi of Heaven and Earth into their body forcefully.\"</p><br/><p>\"Any problem with it?\" Ning Que thought for a while and didn't find anything wrong with it. Literally, it seemed much easier than those of other factions.</p><br/><p>\"No more speaking like this. You'll definitely be expelled from the faction, or even face harsh punishment, if you speak like this in the academy or Haotian Taoism.\"</p><br/><p>Lyu Qingchen warned him seriously. \"Compared with nature, the human body is just nothing but ants. It reaches the limitation by storing itself Psyche Power into the body already. How could we survive from forcefully absorbing the Qi of Heaven and Earth into our bodies? Otherwise, we would die just like that Great Sword Master.\"</p><br/><p>\"But now that Devil's Doctrine is a faction...\" Ning Que asked cautiously, \"There must be many cultivators in the world, how do they inherit if they easily die from absorbing the Qi of Heaven and Earth?\"</p><br/><p>\"They have their way to change their body mechanism so that they can absorb these micro Qi of Heaven and Earth. However, the whole process is extremely bloody and cruel. The elder mentors say that only two or three cultivators can suffer through the extreme pain out of a hundred of cultivators.\"</p><br/><p>\"What a cruel process!\"</p><br/><p>Ning Que wrinkled his eyebrows and said. He was thinking silently that there were only a few potential cultivators in the world. The way that Devil's Doctrine cultivated could only waste a lot of cultivators, maybe that was why it was not allowed to exist by other righteous factions.</p><br/><p>Lyu Qingchen probably guessed what the lad was thinking, and said more seriously with a cold voice, \"How can they be deemed as normal people after being forced to change their body mechanism?</p><br/><p>\"Humans are those who live in nature, and nature is what's beyond humans!</p><br/><p>\"To absorb primordial Qi into their bodies, they have to integrate their bodies into nature.</p><br/><p>\"While only Haotian can be taken as real nature!</p><br/><p>\"As a result, what Devil's Doctrine do is extremely evil and never would be allowed!\"</p><br/><p>...</p><br/><p>...</p><br/><p>When they were approaching Chang'an, Ning Que came to the elder's carriage again without an invitation one night. The starry night made the campsite appear silver, and made him seem even sneakier.</p><br/><p>The light in the carriage was still on, Lyu Qingchen was reading the notes that Ning Que took during these days. Looking at the tiny regular script on the papers, he couldn't figure out how he could write such exquisite calligraphy in such a shaky carriage. His face was filled with admiration.</p><br/><p>All of a sudden, he wrinkled his eyebrows and put down the papers in hand, and said towards the curtain, \"Come in.\"</p><br/><p>Ning Que stepped up into the carriage and sat in the previous position with his hands on knees, asking after a while of silence, \"Sir, I still can't figure out why you spend so much time in teaching me since I don't have any potential to be a cultivator?\"</p><br/><p>The lad looked up with his extraordinary bright eyes and asked with a shaking voice, \"Is it because of your discovery of my talent?\"</p><br/><p>Lyu Qingchen looked at him surprisingly with his mouth opened up slightly, asking after a while of hesitation, \"What's... your talent?\"</p><br/><p>Now it was Ning Que's turn to be surprised, he asked embarrassedly, \"If I knew what my talent was, I'd not come to ask you.\"</p><br/><p>The elder shakingly pointed to the lad's nose with his thin finger. He didn't know what else to say to him.</p><br/><p>\"Sir, I have a lot of secrets.\" Ning Que seemed not to be giving up on convincing this sublime being at Seethrough State that he had extraordinary talents. He rubbed his face nervously and said, \"After I came to the City of Wei, people there all think that I'm so lazy that I even would fall asleep in the carriage anytime. But that's not true. Actually, I meditate when I'm sleeping.</p><br/><p>\"You don't have to be surprised, it's true... You know there's no entertainment in a border town, the only thing I love to do every day is writing, and I'm also reading the Article on the Response of the Tao during my spare time. You also know that book is really boring, and I can't help feeling sleepy while I'm reading it. But as I recall now, that's meditation instead of sleeping.\"</p><br/><p>Ning Que said seriously, \"At the beginning of sleep, I could feel that the buildings, people, and everything around me were flying away from me. The entire world became a place where everything was infusing together. I could even vaguely feel some mysterious breath...\"</p><br/><p>Lyu Qingchen's expression was becoming more serious. Although doing meditation while sleeping was extremely rare, it was still recorded before and could be found in the Classics of Haotian Taoism.</p><br/><p>...</p><br/><p>...</p><br/>\n</div>"}