{"title": "Chapter 27: Long Time No See, the Great City", "id": 27, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-27-long-time-no-see-the-great-city", "volume_title": "Volume 1", "body": "<h1>Chapter 27: Long Time No See, the Great City</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 27: Long Time No See, the Great City</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Ning Que was awakened by a sudden pain, with his pupils filled with horrification. He unbuttoned his shirt and started groping his chest, but all he could feel was sweat instead of a broken heart hanging on the cracking breastbones. Relieved, he patted himself on the chest and slowed down his breathing.</p><br/><p>He turned to stare at Sangsang, who was still sound asleep. He looked at the little bead of sweat on Sangsang's small nose, suddenly feeling that it was a blessing to be alive.</p><br/><p>He didn't plan to tell Sangsang, or anyone else, about the horrifying nightmare he had just dreamed. As it made him awful to merely recall a small portion of the dream, he decided to forget about it.</p><br/><p>The rough carriage started to travel again with the squeaky noise made by its wheels the next day. It followed the cavalries team, which kept growing larger, to move southwards. Around ten in the morning, the team stopped at a small village near Chang'an. A messenger from the capital, who represented the entire official court and complex rituals, had already been waiting for the princess for the past few days.</p><br/><p>Ning Que jumped off the shaft of his carriage and stood by the side of the cheering crowd. He glared into the sky at the border of town. There was a hint of a dark gray structure of a city. Nevertheless, it was so far away that he could not see it clearly even if he had squinted his eyes. Ning Que guessed in his mind—it must be Chang'an.</p><br/><p>The intricate and fancy guards of honor started to move forwards slowly. However, the young master and the little handmaiden were not asked to follow this time.</p><br/><p>Ning Que and Sangsang stood on the sidewalk and watched the fancy carriage slowly pass them. The window was closed tightly. Ning Que thought of the bonfire as he was thinking about the princess and the little prince of the Tribe of Savages sitting inside the carriage. He could not help touching his face and smiled.</p><br/><p>The corner of the curtain of the fourth horse carriage was lifted as it passed them. Lyu Qingchen combed his white beard and smiled at Ning Que. Ning Que bowed deeply in return.</p><br/><p>The bodyguards and grassland barbarians made obeisances to Ning Que for farewell without dismounting from their horses when they passed by Ning Que. Guilty smiles appeared on their faces. The guard of honor of the empire was strictly managed. Although the bodyguards' leader, Peng Guotao, was expected to have a great future back to Chang'an, he didn't dare to show any emotions in front of the court officials. As for the several grassland barbarians, they were relieved after bidding farewell to Ning Que as they began to imagine the happy life in prosperous Chang'an, without the wood-chopper around Shubi Lake.</p><br/><p>The cavalries from the Gushan Commandery, who were assigned to go last, observed the surroundings with caution. Their leader, Senior Captain Hua Shanyue, rode the horse with one hand and gave a glance at Ning Que. Then he sped up as if he had not even noticed Ning Que. Of course, he might have forgotten about this nobody totally.</p><br/><p>Ning Que did not care much about the Hua Shanyue's attitude. Afterall, he was the son of a high-class noble family and the most outstanding leader among the younger generation of the Tang's military in Chang'an. In contrary, Ning Que was only a commoner in the lowest class since he had left the army. Even if he were lucky enough to get into the academy, he would still merely be at the bottom of the Empire's court officials. He would have nothing to do with this Senior Captain Hua Shanyue, who had been hostile towards Ning Que and even wanted to kill him.</p><br/><p>However, was Ning Que willing to live in that way? Of course not. As a result, he knew he would meet the proud young general again one day shortly.</p><br/><p>After the princess and her cavalries had left, the population of the small town decreased a lot. However, it became livelier. The vendors and dealers, who had been frightened to come out before, suddenly showed up. The merchants, who had tried to avoid conflicts by shutting their doors, now reopened their stores and began to do businesses.</p><br/><p>Ning Que sold the shabby horse carriage for a low price at a store in the town that collected all kinds of rags. He patted on Sangsang's shoulder to show consolation as the shabby carriage and old horse had followed them for many years in the City of Wei. Anyone would be reluctant to sell such a thing, but memorizing and feeling sad was not suitable at that moment when Chang'an was just right in front of them.</p><br/><p>They chose to stroll along the field ridge beside the official route instead of walking on the road, on which eight horses could run side by side. In the furrow, flowers were flourishing with butterflies and bees flying around. The tear stains in the canthus of the little handmaiden's eyes gradually dried up. She grasped the laces of the bag, which appeared to be bigger than her, tightly and walked on the field ridge with occasional smiles on her face.</p><br/><p>In the sunlight, Ning Que took over the heavy package and chatted with the little handmaiden. Even though he usually could not get a reply from her, he was still happy to continue the conversation while admiring the scenery of the countryside. He waved his hands as he saw a farmer resting in the near field. He pretended to catch butterflies as they flew in front of him.</p><br/><p>He had left Chang'an when he was very young. Then he had been living in Min Mountain, the grassland, the Wilderness and the little border town. In his surroundings, there were merely vicious jungles, boring grasslands, and ubiquitous danger. Now, he returned to the center of the empire. He was excited and happy to observe such a peaceful and harmonious image of life.</p><br/><p>They kept walking for about two or three hours. Then a shadow suddenly spread over their heads from a brook and a peach forest in the front. Ning Que thought that it was still not night yet and there were no signs of rain before in his mind.</p><br/><p>He looked up confusedly, and then he saw a black wall in front of him. This wall was so high that it seemed to have no edge. It covered half of the sky and also covered the sun, which was still in the sky. Faintly, they could see three black dots continuously flying in a circle in a high position near the wall.</p><br/><p>They could not find the end of the wall in both the right and left directions. They were surprised by how big this city was. It stood silently between the heaven and the land. Sangsang's eyes widened as she looked at the great city and the crowd on the official route, which was not far away from them. In awe, she asked, \"Is this Chang'an?\"</p><br/><p>The three black dots in the sky flew to a lower position. It turned out that two eagles were helping their child practice flying. They were going back to their nest on the dark wall. As this wall had experienced rain wash and weathering for thousands of years, it seemed ragged on the surface, but it was still solid and indestructible inside.</p><br/><p>The younger eagle learned how to fly and returned to its nest. Ning Que looked up at the greatest city in the world and smiled sincerely. He finally returned after he had traveled for many years.</p><br/><p>Long time no see, the city of Chang'an.</p><br/>\n</div>"}