{"title": "Chapter 26: The First Dream", "id": 26, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-26-the-first-dream", "volume_title": "Volume 1", "body": "<h1>Chapter 26: The First Dream</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 26: The First Dream</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>For the past few days, Ning Que had been torn apart between hope and disappointment, causing him to feel slightly unhappy. He then decided not to think about them anymore. Regardless of whether they were happy or unfortunate incidents, they were good reasons for him to drink till he drops. Just right, Sangsang's old sickness was back that night and her small legs were as cold as frozen branches. Thus, both of them opened a jug of strong alcohol and drank to their hearts' content.</p><br/><p>The little handmaiden drank more than half of wine in the large jar, but yet Ning Que was the first to drop. Sangsang, with much difficulty, moved him to the cushioned area, spread the blanket and covered him. She then crawled under the blanket and as usual, squeezed her little legs in his arms.</p><br/><p>As the air covered with the fragrance of the wine, Ning Que had a dream.</p><br/><p>In his dream, he felt that he was beside a warm sea. However, this time, he did not attempt to stretch out his arms and tried to fish for the water like what he did in the past. Perhaps it was due to the advice from Lyu Qingchen that reminded him that he was just dreaming. Thus, he stood in the warm sea and calmly stared out into the sea, like a total stranger or a bypasser who would not care much for what was happening out there.</p><br/><p>He smiled in his dream as he recalled: \"Everything is just an illusion. Nothing's going to scare me.\"</p><br/><p>It might be due to the extreme calmness within Ning Que which he never had before, this time, he could vividly remember the look of the sea. That limitless sea was not blue, but green, and the color was extremely dark yet translucent. It looked like a beautifully carved piece of gleaming jade.</p><br/><p>Standing in the green sea, he did not bend forward to fish for the slow flowing green water, but instead, he quietly looked at them and wondered where they would flow towards in the next moment, and the shapes they would form.</p><br/><p>Suddenly, two white flowers appeared from the green sea. Their petals were as white and pure as snow. No other common colors were seen from the flowers, they were just dull and monotony white.</p><br/><p>The seawater slammed against the root of the white flowers. If they did have roots, with the moisture from the green sea, the two white flowers would indeed grow at a rapid rate, where one could see the difference with his naked eyes. The petals fell off one by one, and each of them bloomed into a new white flower the moment they landed on the surface of the sea. With such a fast pace, the white flowers swiftly spread across the sea and soon, the whole sea surface in front of him was covered with white flowers as they extended all the way to the horizon.</p><br/><p>Ning Que looked at the magnificent view in front of him. He could not help but feel excited as he raised his leg to step upon the flowers and headed towards the horizon. He could sense the tenderness of the white petals touching his bare feet as they bounced up and down when he walked on them. That soft, gentle and tender feeling was amazing.</p><br/><p>...</p><br/><p>...</p><br/><p>Inside the carriage beside the field, Ning Que lay on his side on top of a cushion. Half of the blanket on his body was already thrown back. His forehead was covered with perspiration as he hugged the pair of small legs in his arms. The skin on the little handmaiden's legs was much prettier and fairer as compared to the rest of her body, and they looked like two delicate white flowers.</p><br/><p>He frowned his eyebrows and curled his lips at times. It was unsure what he was dreaming of, but his legs under the blanket had subconsciously kicked. When his legs touched a certain spot, he felt a sense of comfort and stopped fidgeting as he revealed a look of satisfaction on his face.</p><br/><p>...</p><br/><p>...</p><br/><p>Feeling dazed and distracted, Ning Que had long forgotten that he was in a dream. Though his heart and mind were feeling confused, he had managed to walk calmly on the surface of the sea. Walking on the white flowers floating on the sea, a thought suddenly struck his mind as his body started to float away from the flowers and flew swiftly towards the sky.</p><br/><p>When he flew to a certain height, he lowered his head and looked down. The white flowers floating on the green sea had disappeared as he faintly saw a red platform beneath the deep green sea and it was extending in all directions across the seabed.</p><br/><p>He then broke through the seawater, dived and swam towards the deep green sea.</p><br/><p>After a long time of diving into the sea, he finally saw the red layer—it was a layer of water formed by the viscous dark red serous fluid. There was no boundary to the red layer and it looked somewhat like a widespread of tomato sauce, or maybe, more like a layer of blood that was about to solidify.</p><br/><p>Then the layer of blood started to boil and suddenly, numerous standing figures of humans were formed. There were no features on their faces. They fell, stood up and fell again. He watched them struggling and silently wailing in pain. No matter how painful they struggled, their features on their faces would forever be imprisoned in the silent world beneath the thin layer of blood.</p><br/><p>This scene had gradually caused Ning Que to overwhelm with fear and turned him into a statue. He stood beside the sea of blood blankly and watched the silent cruelty scene in front of him.</p><br/><p>The sea of blood then turned into a ground, and a sky was formed.</p><br/><p>Ning Que stood in between the sky and the ground, as he realized that he was right in the middle of the wilderness. Numerous corpses were lying by his feet and far away, including the corpses of the cavalries from Tang Empire, warriors from the Yuelun Kingdom, archeries from the South Jin Kingdom and many skillful grassland barbarians' horse-riders. A large amount of blood flowed out from these corpses and dyed the whole wilderness into blood red.</p><br/><p>Then three columns of dark smoke appeared far away, as though they were alive and were coldly staring at the bloody scene that was happening on this side.</p><br/><p>\"The sky is darkening.\"</p><br/><p>\"I've said this before. The sky is darkening, and yet no one believes me.\"</p><br/><p>Someone spoke beside Ning Que's ears scornfully. Ning Que turned around instantly, but he did not manage to catch a glimpse on the speaker. Instead, he saw many people were raising their heads and staring at the sky. There were people like pedlars who appeared confused, officers who looked bitter, mistresses who were filled with fear and monks that laughed crazily. Regardless of how different their clothing and expressions were, all of them shared a unique common point. They were all facing at and looking into the sky, like hungry fat gooses who were waiting to be fed.</p><br/><p>In the wilderness, many were looking in the sky in astonishment, and Ning Que had subconsciously followed them. He realized that it was still daytime and the sun was shining mercilessly in the sky. However, all of a sudden, the temperature of the wilderness fell abruptly and the light from the sun became dim. It was as if the night was about to fall.</p><br/><p>A piece of darkness was suddenly seen extending from the horizon towards them. There was nothing special about the darkness, just that it was absolutely black, like the white flowers that he saw at the beginning of his dream. There was no other mixture of colors, and it depicted the deepest darkness in a human's dream.</p><br/><p>The people who were looking into the sky were very frightened and Ning Que was filled with fear, but yet no one knew the true reason for them to be afraid.</p><br/><p>Ning Que glanced around him to look for the person who spoke to him, hoping to seek answers from that person as to what was happening and why the sky became so black. However, no matter how hard he tried to search around, he could not find that person. All he could vaguely see was the back view of an extremely tall and big-sized person walking through the crowd, away from the wilderness.</p><br/><p>He rushed over to that tall person and shouted, \"Hey! Was that you? Tell me what exactly is happening now!\"</p><br/><p>The tall man did not turn around. His back view looked desolate among the crowd and it disappeared. However, Ning Que's exclamation had shocked the crowd who were looking at the sky in the wilderness. Then someone grumbled. \"The night is falling, yet you're here disturbing our final moment of silence instead of watching, you disgusting little pest.\"</p><br/><p>Only a few of them had grumbled, and most of them in the wilderness withdrew their attention from the sky and stared shockingly at Ning Que. The look in their eyes had changed. Some of them appeared shocked, some looked touched, while others even had tears flowing from their eyes. A drunkard and a butcher stood beside Ning Que and watched him quietly as if they were waiting for him to speak up. Everyone was looking at Ning Que, as though he was a glimmer of hope for them in the absolute darkness.</p><br/><p>The feeling of being the spotlight of the world made Ning Que feel weird, so did the feeling of being the only hope. Ning Que could suddenly sense the respect and honor the world had for him and he even felt sacred. Yet, he was just an extremely ordinary man, and he had no idea how and why this Night Fallen world will become. Hence, the insecure and fear in him made his heart beat so rapidly to the extent that he could felt an extreme pain in his chest, as though it was being torn apart.</p><br/><p>...</p><br/>\n</div>"}