{"title": "Chapter 35: The First Guest of Old Brush Pen Shop", "id": 35, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-35-the-first-guest-of-old-brush-pen-shop", "volume_title": "Volume 1", "body": "<h1>Chapter 35: The First Guest of Old Brush Pen Shop</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 35: The First Guest of Old Brush Pen Shop</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>This was Ning Que's ideal lifestyle: a fantastic night accompanied by a good set of writing brush, inkstick, paper, inkstone and a beautiful handmaiden, enjoying a cup of light tea, three burning incenses besides the table, and a bright moon outside the window. He could roll sleeves to write as much as he wished and could stop to raise his head, lightly flicking a finger to swiftly shoot a hiltless flying sword suddenly from the beam traveling thousands of miles to kill a general.</p><br/><p>The first night spent in Lin 47th Street made him feel infinitely closer to his dream state, despite the cheap calligraphy stationery, despite the night being still but not yet deep, despite there was only water instead of light tea, and only porridge and sesame seed pancakes to satisfy his hunger, despite there being no burning incenses on the table and no moonlight outside the window, despite his handmaiden being too tiny, dark-skinned and ugly, and despite the fact that he now thought of cultivation as a very stinky fart...</p><br/><p>Despite all of these things, he still felt very happy to be able to let his brush dance presumptuously on the snow-white paper, so much so that he even considered Sangsang's proposal of selling calligraphy as a rather genius idea.</p><br/><p>In City of Wei, their life was neither poor nor rich, but only bitter. The military shipments would not include goods such as calligraphy stationery. So it was costly for him to write a few volumes of calligraphy. But right here and right now, he had at his disposition infinite amount of writing materials with which he could produce as much calligraphy as he wished. And Sangsang would have nothing to complain about since he could sell the calligraphy for money. In his mind, there could be nothing that made him happier in this world.</p><br/><p>Painful and torturous times always dragged on like years, but happy and enjoyable moments flew by quickly. When he finally looked up, downed the bowl of water, and rubbed his aching wrist and shoulders getting ready to rest, it was already early dawn out there and he could hear faint sounds of water-pouring as well as vendors yelling from a distance.</p><br/><p>After a whole night of calligraphy, he had already been surrounded by paper volumes. Even though he began with two Kuangcao calligraphy works to vent his feelings, eventually he strove to carefully write what would sell better according to Sangsang. They were seemly unplanned works but in fact included vertical, horizontal and long scrolls as well as a massive full sized Dazhongtang scroll. Random piles of paper volumes of different sizes and shapes piled up all around him waiting to be framed.</p><br/><p>Having been copying thousands of calligraphy volumes for many years, Ning Que was rather confident of his own skills. However, it was a pity that here in Chang'an he could not make use of certain masterpieces [TN: referring to the famous calligraphy work of Collected Poems from the Orchid Pavilion] that he was most proud of given that his true home was another time and another place with a different history. And there was no answer if any spectator asked about the ninth year of Yong He and the Kuaiji Mount which obviously did not exist in this world. As a result, he had to copy some existing collections of poems and some widely-circulated scriptures. Even so, he still believed that after the paper volumes were hung on the wall, there must be countless high-ranking government officials, celebrities and men of letters who would come to appreciate his calligraphy as soon as they heard about it.</p><br/><p>\"Alas, the threshold will be trampled off in two days, so we'd better get ready to get it repaired in advance.\"</p><br/><p>Immersed in this sense of vanity, Ning Que stretched his right hand and casually ripped off the paper volumes left by the original house owner as if they were a pile of rubbish. Just as he was about to call Sangsang to find a frame shop to frame and hang his own masterpiece, he found the little handmaiden sound asleep in the corner with her arms wrapped around her knees.</p><br/><p>\"Well, I was just about to ask you to go and get two bowls of those famous Chang'an style hot and spicy shredded noodles...\"</p><br/><p>Looking at the soundly asleep little girl, he just shook his head and covered her with a blouse. Then he pushed the door and went out, following the highly appetizing aroma of chopped green onions and the sound of vendors selling breakfast in the beautiful morning light.</p><br/><p>\"Uncle, how much for the shredded noodles?\"</p><br/><p>\"So expensive?\"</p><br/><p>\"You see, my shop is just over there... so can I get a better price for being a good neighbor?\"</p><br/><p>\"That's right! That's the shop, still waiting for me to name it.\"</p><br/><p>\"Actually I do have a name in mind, but I just need to make a shop sign... Did you say what name?\"</p><br/><p>\"Old Brush Pen Shop.\"</p><br/><p>...</p><br/><p>...</p><br/><p>The fact that Ning Que casually made up a shop name for the sake of getting cheaper noodles did upset Sangsang slightly, even though she had no better idea as of the shop name either. For this, she nagged at Ning Que for several years thereafter.</p><br/><p>All in all, with one owner/calligrapher and one handmaiden/assistant, this oddly named calligraphy store finally debuted in Lin 47th Street.</p><br/><p>The only thing Ning Que disliked about this shop was its distance from the framing shop. Since framing took a long time and he himself lacked the skills to do so himself, he had to remain patient and wait for another two days.</p><br/><p>On another rainy in Chang'an, Ning Que's shop was quietly in operation in Lin 47th Street. Wearing a brand new indigo scholar robe, Ning Que held a cheap red-mud teapot in his hand and stood in front of the wall of works and behind the threshold, as if seeing his new life waving at him. This new life looked truly adorable.</p><br/><p>\"Spring rain is as precious as oil. It's a good sign!\"</p><br/><p>Standing behind the threshold and contemplating the rain outside, he took a sip of tea and exclaimed. \"Such delicious and hypnotic aroma of the tea and the ink! All the power and ambitions in life cannot compare to this!\"</p><br/><p>The juvenile face and a scholar robe made him look rather funny instead of handsome. And it was adorable when he tried to look mature by holding the teapot and speaking in an old-fashioned tone.</p><br/><p>Outside the threshold and under the eaves was someone taking a shelter from the rain. He just heard what Ning Que said and turned around to glance at him. He was slightly startled at first, but then burst out laughing. It was a middle-aged man with a clean turquoise robe and a sword tied loosely around his waist. His handsome complexion conveyed a sense of freedom and ease, and his charming smile seemed to light up the falling rain.</p><br/><p>It was only then that Ning Que realized there was someone outside. Knowing that his sentimental words had been overheard, he felt slightly embarrassed and cleared his throat awkwardly before turning around to pretend that he was looking at the distant palace under the rain, as if nothing had happened.</p><br/><p>Probably feeling a little bored, this middle-aged man walked into the shop and casually glanced over the wall with his hands behind his back. His eyes sparkled with appreciation and surprise, despite not showing any interest to make a purchase.</p><br/><p>Since all scholars take pride in their pride, Ning Que was not eager to greet the guest, despite the fact that this man was the first to step inside Old Brush Pen Shop ever since its opening, which took on a deep historical significance.</p><br/><p>After touring the shop, this middle-aged man walked back to Ning Que and said with a smile, \"Young boss...\"</p><br/><p>Before he could finish his sentence, the man was interrupted by Ning Que who corrected him with a smile. \"Please simply call me boss. Don't call me young boss for my young age, just as I did not call you swords... man for carrying a sword.\"</p><br/><p>\"Fine then, young boss,\" the man still did not change the address and said with a smile, \"I'm curious about why you'd like to rent this shopfront that no one was willing to rent for the past three months.\"</p><br/><p>Ning Que answered, \"It's quiet with a pleasant environment, with a shop in front and a house behind. I just couldn't figure out a reason for not renting it.\"</p><br/><p>The man smiled again and said, \"I just want to remind you that, the reason why this shop was so cheap but still had no tenant was not because of everyone else being less smart than you, but because of the warehouse expansion of the Logistics Department that is under the Ministry of Revenue. Chang'an Local Government has waited a long time trying to buy back the shop fronts on this street. As you may know, official compensation always tends to be very low, which means that renting a shop front here incurs high risk for which the tenant may lose everything anytime. You say it's quiet here but did you not realize that all the other shop fronts around you are closed?\"</p><br/><p>Ning Que frowned suspiciously and asked, \"How do you know about these things?\"</p><br/><p>This middle-aged man calmly replied, \"Because the shop fronts on both sides of this street all belong to me.\"</p><br/>\n</div>"}