{"title": "Chapter 42: The Boiling Hot Dewdrop on the Lotus Petal", "id": 42, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-42-the-boiling-hot-dewdrop-on-the-lotus-petal", "volume_title": "Volume 1", "body": "<h1>Chapter 42: The Boiling Hot Dewdrop on the Lotus Petal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 42: The Boiling Hot Dewdrop on the Lotus Petal</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>In the eyes of the lady and the personal maidservant, Xiaocao, Ning Que currently looked as though he was mesmerized by that full-figured lady and had turned into a foolish penguin who could not move an inch. The little maidservant became unhappy as she stared at the full-figured yet delicate-looking lady and said, \"Dewdrop, this is an order from Grandma, you dare to defy?\"</p><br/><p>Dewdrop was the current most popular lady in the House of Red-Sleeves. Though she did not manage to participate in the top courtesan contest for consecutive two years, she was very popular with men with her pretty little face and dew-like delicate fair skin. Even so, she dare not defy Mistress Jian's order. She rolled her eyes, giggled as she stepped forward and held Ning Que's hand. She said, \"Since it's an order from Grandma, I would definitely obey. It's just that I really adore this kid a lot, and especially love it when he blushes. Come, follow me to play in the courtyard.\"</p><br/><p>Naturally, Ning Que would not reject the offer as he allowed the lady to pull him by his hand along the small stream, through the flowers and trees, into the courtyard. The lady, who was following behind, chuckled yet did not stop them. However, that maidservant, Xiaocao, shouted, \"Grandma said no one is supposed to serve him!\"</p><br/><p>\"Ah? Are you serious?\"</p><br/><p>Ning Que was taken aback as he turned his head around. In his heart, he was thinking if Mistress Jian had such a high authority and if words were to spread, would the brothels in the whole Chang'an city refuse to serve him anymore? If so, what should he do?</p><br/><p>The maidservant, Xiaocao, looked at him complacently and said, \"Else what do you think Grandma means?\"</p><br/><p>Ning Que was speechless. Now he understood why the history books always said that the scary people were not the Emperor, but the eunuchs who gave the fake orders. At such thoughts, he could not help but feel depressed in his heart as he could understand the endless miseries they caused. Despite all these, he still felt a need to follow the popular lady, Dewdrop.</p><br/><p>After they entered the courtyard, there were no fanciful happenings. Dewdrop folded her legs and sat on the couch as she ordered her maidservant to serve some fruits to Ning Que. Yet she herself was relaxingly enjoying the melon seeds as she kept questioning him about his meet-up with Mistress Jian, and the situation at the frontier fortress.</p><br/><p>Ning Que was usually good with such talks. He had gained various experiences from talking in the inn at City of Wei and the casino in the military, which were great places for him to master his abilities to gauge people's mind. Tonight, he started off with a chat with Mistress Jian, then he was faced with the maidservant and now, a popular prostitute in the Chang'an city was right in front of him, but yet he was not afraid at all. He was casually enjoying the fruits while chatting with the prostitute, as though he were at his own home.</p><br/><p>The purpose of him to chat with her was to obtain some information from her, and yet Dewdrop had not noticed it. With her finishing half a plate of her melon seeds, their conversation topics had switched from City of Wei to the Chang'an city, and the contents had changed from whether barbarians women were pretty to what kind of customers did they usually serve at House of Red-Sleeves, who got jealous easily and which customer's wife got jealous easily.</p><br/><p>Though speaking of customers were against their ethnic policies, but honestly, this was what these ladies in the brothels enjoyed doing during their free time other than their usual dancing, singing, poetry and painting. Hence, Dewdrop did not suspect anything, instead, she was enjoying every moment of it.</p><br/><p>Ning Que lowered his head to pick a fruit and appeared to pay no attention to the topics. He looked as if he was just casually asking and listening, but in fact, he was attentive to the details as he tried to filter the list of names he heard. Suddenly, his finger froze.</p><br/><p>\"I've never met someone who fears of his wife so much. He's an officer of Fourth or Fifth Rank, but yet he always had to dress up to pretend whenever he's here for fun. Despite being timid and useless, he's really a glib talker. No wonder he's known as the Silver Tongue Censor...\"</p><br/><p>It was unexpected that the censor's great capability of socializing became sourly criticized by the ladies in the brothel in this manner. Ning Que recalled seeing Zhang Yiqi and his few satisfied-looking concubines outside the Zhang's mansion, and instantly, an image of a silver-haired censor bending over to \"work hard\" in between the concubines' legs appeared in his mind. This almost caused him to spit out the fruit in his mouth as he choked and coughed.</p><br/><p>After Dewdrop said that comment, she felt that it was indeed inappropriate and was hoping that this lad would not read between the lines. Yet she did not expect him to have such a big reaction and understood what she meant, which made her felt embarrassed. She pretended to be angry and gently punched him in the shoulder. She blushed and said, \"What do you guys do at the border town, how come a kid like you will know such things.\"</p><br/><p>After teasing and joking for a while, the maidservant came over and whispered into Dewdrop's ear. Ning Que saw the view outside the courtyard. He knew that it was getting dark and it was time for him to leave, so he stood up and politely bade goodbye.</p><br/><p>Dewdrop pouted and thought for a while before she took out a silver from the drawer beside her pillow. She handed it over to him, smiled and said, \"This isn't a big angbow (red packet), but since you've chatted with me for so long, I can't be giving you nothing at all, so don't look down at me. I'm not sure of the reason, but I'm really happy chatting with you.\"</p><br/><p>Ning Que was not surprised as he was certain of it. Usually, those customers would only love to talk about love and passion with them, and not everyone could be like him acting like an old aunt in the village lying casually on the couch, chatting with a few vulgarities coming out of his mouth at times. However, he indeed loved chatting with this lady, Dewdrop, for she was honest and nice to chat with... Moreover, she had a pretty face and a great figure, yet not to the extent of seductive. He took over the silver and said, \"Then I'll take it as a welcome gift from Sister.\"</p><br/><p>Upon hearing what he said, Dewdrop's eyes brightened. She went forward, hugged him in her arms and snuggled his head. She was looking cheerful as she said, \"Though I'm not sure why Grandma wants to be careful of you, but do feel free to visit me when you have time.\"</p><br/><p>She was a prostitute, and Ning Que was a young scholar. Though they were able to sit side by side in the courtyard within the brothel and chat with one another, when they leave this place, they would be two separate people who belonged to the two different worlds. Hence, when Ning Que called her Sister, she was naturally happy about it, but she did not take him as her brother immediately—after all, every Chang'an lady had her own arrogance and attitude, even if she was just a prostitute.</p><br/><p>...</p><br/><p>...</p><br/><p>Back to the shop at Lin 47th Street, Sangsang casually mentioned to Ning Que that there were two people who came over in the evening to ask for the boss. Ning Que didn't mind, so Sangsang boiled a kettle of water to warm her legs and went to bed.</p><br/><p>The lights were out and the room was dark. As usual, Ning Que hugged the pair of tiny legs as he recalled the images he had seen and news he had heard at House of Red-Sleeves tonight. Initially, he was thinking over Censor Zhang Yiqi's matters, but after a while, his mind was filled with Dewdrop's beautiful face, her cute smile, her sexy body and soft fair skin. It was especially vivid the moment when she snuggled his head in her arms. It was as though he could still feel the softness on his face and the flower scent from her body still lingered.</p><br/><p>With the thought of the scene, he felt a warm gush in his body. Hugging Sangsang's tiny legs made him feel even warmer. It was only when he felt his knee was blocking an uprise where would definitely grow full in near future, did he feel himself extremely warm under the blanket.</p><br/><p>One would eventually grow up someday, and it could not carry on. Ning Que took off the blanket and sat up as he stared at his maidservant, who was woken up by the sudden movement. He then smiled and said, \"Chang'an is coming hotter much earlier than the border town, seems like we'll need to sleep separately.\"</p><br/><p>Little Sangsang rubbed her eyes as she said in a daze, \"But there's no fireplace here. I'm feeling even colder.\"</p><br/>\n</div>"}