{"title": "Chapter 58: A Battle of Two Persons", "id": 58, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-58-a-battle-of-two-persons", "volume_title": "Volume 1", "body": "<h1>Chapter 58: A Battle of Two Persons</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 58: A Battle of Two Persons</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Chao Xiaoshu's sword transformed into five sword blades.</p><br/><p>Three sword blades buzzed as they evaded the copper bowl and shot towards the sadhu. The remaining two sword blades did not return back to protect Old Chao, and instead, completely ignoring the robed swordsman's cyan-light short sword, and sharply tilted to stab right towards him!</p><br/><p>Even though it was a battle between cultivators, this middle-aged man in indigo robe was still concentrating on what was the motto of Chang'an Jianghu world, \" If you kill me, you'll also die. I've been cultivating in Chang’an Jianghu world for many years, so I don't fear death or anything else. While you've cultivated under the wing of famous masters for many years, don't you fear death? \"</p><br/><p>The robed swordsman feared death. With a slightly pale face, he combined two fingers as one sword to strike, forcefully recalling the cyan-light short sword that had firmly flown out half way. At this most dangerous moment, it struck two sword blades attacking towards his eyes. But this movement made his right hand slightly tremble and blue veins on the back of his white hand visible.</p><br/><p>That sadhu nearby, heavily concentrating on those three sword blades attacking him, had found it too late to recall that heavy copper bowl to protect him. When he clumsily shouted a vague word, the prayer beads hanging between his thumb and forefinger started to hover in the air and whizzed as it rotated around his body. Only a series of flames were visible around and no one knew how many times they have collided with the unexpected three sword blades!</p><br/><p>The shadow of the sword arrived, piercing through the air, and the copper bowl rose with water. The cyan-light short sword pierced straight towards the mansion entrance. Finally the dull gray shadow of sword became five sword blades, the cyan-light short sword fled backwards like lightning, and the prayer beads floated to guard the body. Each section contained a terrifying danger. The three strongmen would die with spilling blood as long as there was a single mistake among them.</p><br/><p>In the world of the strong, the scale of time was fundamentally different. What seemed like a complicated, dangerous and long course was only a very short instant in real life. In fact, at that moment, the water spilling over from that copper bowl was still transforming into splashes of glazed tiles in the air that had not ever fallen on the floor. Rain continued to fall slowly. The elite troop of Tang with crossbows did not have any reaction at all.</p><br/><p>Rat-tat! Rat-a-tat!</p><br/><p>The elite troop of Tang reacted as soon as possible, quickly pushing the trigger to make tens of arrows carrying the powerful wind-ripping force shoot towards the mansion entrance. At this moment, those five sword blades were fighting with two cultivators inside Rain-enjoying Building. Chao Xiaoshu had no ability to protect himself and could only watch the crossbow arrows rush towards him, on the verge of turning him into a sick facsimile of a hedgehog.</p><br/><p>And just in this instant, when the crossbow arrows were about to hit Chao Xiaoshu, one shiny, snow-bright blade light shone in the courtyard, making layers of the rain visible and sucked in all the densely-packed crossbow arrows!</p><br/><p>With the boots struck in watery puddles before Chao Mansion's main entrance, like nails chiseling into the ground, and two hands firmly gripping onto the hilt like steel, Ning Que circled to the front of Chao Xiaoshu, tightening and relaxing the muscles of his wrist and forearm at a speed difficult to imagine. He drove that snow-bright podao swiftly swiveling around the wrist, which changed into a silvery circular shield to illuminate the old black mask on his face and batted those densely-packed crossbow arrows away.</p><br/><p>\"Bang, bang\", a tinkling shattering sound was heard before the two as numerous crossbow arrows were batted away by the powerful blade. They flew in all directions at a high speed, sticking into the signboard of Chao Mansion, which later gave out a flurry of thudding sounds.</p><br/><p>Tens of crossbow arrows fell unexpectedly like rapid rain. Even though he had good podao techniques, Ning Que could not completely block them. But at this moment, with shrank pupils and a sharp sight like an eagle flying in the open sky of a grassland, he saw all the details before him and kept the state of mind as calm as an eagle, relying on his senses to intercept the shooting angles of crossbow arrows. He waved his podao only at the arrows that might injure himself and Chao Xiaoshu, ignoring the rest.</p><br/><p>In this instant, this lad, who had gone through countless struggles of life and death, perfectly presented a polished sensitivity to danger and good judgement polished by the terrors he had gone through. Those crossbow arrows that seemed to be especially dangerous brushed past his earlobe, penetrating through his robe fiercely and piercing into rain-soaked blue flagstone cracks without causing any harm to him.</p><br/><p>\"Attack!\" The leader of the elite troop of Tang yelled sternly.</p><br/><p>Following the order, the elite troop of Tang that had fired one round of crossbow arrows split into two groups. One group quickly pulled the springs and set arrows, while the other group of more than ten soldiers silently drew the steel blades at their waists and came charging at Chao Mansion's main entrance.</p><br/><p>Clump! Clump! Clump! Clump! A Tang elite soldier trod repeatedly on the wet ground with two feet, as if they were following the last round of crossbow arrows. Before getting to the main entrance, he howled once and wielded a blade with his two hands before leaping up high, hacking down towards Ning Que's head with an irresistible force.</p><br/><p>The two eyes showing from the black mask lowered slightly. Ning Que looked at the wet ground in front, as though not seeing the ferocious strike about to land, but only flicked his wrist to turn his podao's edge into a white brightness, hacking at the last two crossbow arrows precisely. Then... the podao's gleam suddenly disappeared.</p><br/><p>In the pitch-dark rainy night, there was light hidden inside the building. When the podao was raised, the edge that shone with big movements became a bright surface. There was only one possibility if the podao's shine disappeared without a trace. The podao had to be in a state of stillness at the moment.</p><br/><p>At this moment, the common-styled podao in his hand was in that Tang elite soldier's neck, which was wedged deeply into the neck roughly half its width.</p><br/><p>The podao's edge tore open the skin, and tightly clamped in bones and flesh. Blood gushed out from the very tiny tip of the podao's edge, and then was quickly washed clean by the rain which was getting heavier. Ning Que held onto the hilt's bottom with his left hand and the opposite top of the hilt with his right hand, slightly lowering his head to watch the muddy rain blossoms splashing on the blue flagstones, and then maintained his posture of lowered knee and turned waist.</p><br/><p>Time seemed to have stopped, but it would not truly stop. Ning Que pulled his left arm at a lightning fast speed and the podao's edge in the Tang elite soldier's neck emitted a sound that would make one's teeth chatter. That was the sound of that metal grinding against strong neck bones. Just as the Tang elite soldier died and fell over with both eyes open, Ning Que tightly gripped and pushed forward the hilt with his left hand. The podao's edge abruptly jumped up with rainwater and pierced into the second enemy's throat.</p><br/><p>With his two hands crossed to grasp the podao's long handle, he leaped to and fro within a small range like a quick leopard in the grassland. Ning Que slashed with his opposite hand to chop at an enemy attacking from the left side, and then immediately spun his body to attack abruptly. With the podao's edge, he cut through the rain curtain, a blade through the night scene and the fourth enemy's shoulder.</p><br/><p>After the face-to-face encounter, four elite troops of Tang died underneath his blade, with sprayed blood all over from their ravaged bodies that seemed to be even more intense than the rain. Ning Que had kept his promise, not letting a single person or crossbow arrow injure Chao Xiaoshu. As for the more and more boundless rain, it was not the thing he should care about.</p><br/><p>The elite troop of Tang originally thought that they had come across the best opportunity to attack when the three cultivators were amidst a battle of life and death using Qi of Heaven and Earth as the stage. But they had not thought that the lad silently standing behind Chao Xiaoshu was such a violent character. Probably intimidated by Ning Que's sharp and strange blade techniques, the elite troop of Tang felt that black mask was a bit terrifying, subconsciously slowing down their advancing steps.</p><br/><p>Ning Que gripped the podao with both hands. The rain-soaked black mask raised and fell slightly, and then he frowned.</p><br/><p>The Tang's army was the most disciplined army in the world with the greatest fighting strength. These soldiers showing up in Chao Mansion tonight were Tang elite soldiers, who would absolutely not retreat when coming across fearsome enemies as long as their superiors did not give the retreating order. In other words, even if there was a ten-thousand-zhang abyss in front of them, they would still bravely charge over and not slow down without an order.</p><br/><p>When the triggers gave out the sound of \"whoosh, whoosh, whoosh\", the torrential rain plopped as it fell down, beating atop Rain-enjoying Building's roof and making the solid blue flagstones emit a thunderous noise that successfully concealed the former three tiny sounds of triggers.</p><br/><p>But Ning Que did not relax for the whole process, gazing at the seemingly fearful elite troop of Tang, and tightly gripped the hilt with both hands, carefully listened to any other sounds in the rainy night. So at the first instance of hearing the three extremely soft sounds of triggers, he had made the judgement: Shenhou crossbow!</p><br/><p>Shenhou crossbow was the most terrifying weapon carried by the Tang soldier. With a storing box inside, it could fire ten crossbow arrows at one time. Even more fearsome was that with a special design of trigger, Shenhou crossbow could shoot out crossbow arrows at an especially fast speed, which had in history brought about countless glories when Tang Empire conquered the land. Unfortunately, the special steel required to make Shenhou crossbow was becoming rarer and rarer, and it gradually phased out of the Tang troops' standard equipment. No one would have thought that it would actually appear tonight.</p><br/><p>In the beginning, the elite troop of Tang ambushing in Chao Mansion had not used Shenhou crossbow, for they did not have the confidence of using Shenhou crossbow to successfully shoot good-condition Chao Xiaoshu dead. Besides, that lad wearing a black mask was unworthy of Shenhou crossbow to deal with. They originally thought of using normal crossbow arrows as well as the sadhu and the robed swordsman to gradually wear down Chao Xiaoshu's strength before launching a final fatal attack with Shenhou crossbow. But the situation now did not allow them to do so. Without Shenhou crossbow, they could not even kill that lad wearing a black mask, not to mention Chao Xiaoshu.</p><br/><p>A raindrop of a soybean size rolled along from the top of the black mask to the bottom. Within such a short time, Ning Que had figured out those things, and at the same time had silently put his left hand out of the long hilt, extending to his own back with his fingertip nearly touching that big black umbrella wrapped by coarse cloth.</p><br/><p>He was not a powerful cultivator but just an ordinary lad. Even though countless bloody battles made him slightly unordinary, he still did not have the confidence to just rely on the podao in his hand to overcome the Shenhou crossbow.</p><br/><p>Just in that instant, a series of tiny but clear sounds resonated within the rain in Chao Mansion again. These sounds were even clearer than the sounds of raindrops falling on instrument strings and much faster than the most enigmatic musician's plucking movements.</p><br/><p>Ding ding ding ding... Ding ding ding... Ding ding... Ding!</p><br/><p>Five extremely dim shadows of sword silently returned from Rain-enjoying Building, flying back and forth to dance like bees in the fields at high speed in the courtyard and weaving a thick net that did not even let the wind pass. They captured the trajectories of each Shenhou crossbow's crossbow arrows precisely and intercepted all ten of those arrows to strike them away as if they were alive!</p><br/><p>Standing in the rain, Chao Xiaoshu showed nothing but calmness on his slightly pale face. When he slowly opened his right hand hanging outside of his sleeve, those five sword blades whistled to fly to his front, circling around them in a fast-flying speed. The curtain of rain surrounding the two was pierced with multiple holes by the blades, emitting several white lines.</p><br/>\n</div>"}