{"title": "Chapter 72: The Academy", "id": 72, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-72-the-academy", "volume_title": "Volume 1", "body": "<h1>Chapter 72: The Academy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 72: The Academy</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>It was unknown how many streets of property, such as Lin 47th Street, that Spring Breeze Pavilion Old Chao owned or how esteemed the officers that he liaised with were. And as such, for a man of such stature to leave Chang'an City, the people that he would bid farewell to certainly would not be the normal shop owners on Lin 47th Street. Yet before he departed today, he specifically made a trip down to Lin 47th Street to say goodbye to those owners. Perhaps in the eyes of the nobles from the Empire, they would probably have thought that this middle-aged man was attempting to give a clear warning by using the street that sparked off the Spring Breeze Pavilion incident, which was: \"Don't any one of you dare to stir trouble after I leave\".</p><br/><p>But Ning Que knew that that was not his true purpose for coming to Lin 47th Street—He had come here to bid goodbye to Ning Que, someone who had fought hand in hand with him against their enemies in the spring rain and had sat side by side with him to enjoy noodles with fried eggs. Since Ning Que wanted to hide his identity and now that he was also a secret guard in the palace, that middle-aged man then thought of patiently saying goodbye to all of the shop owners to prevent anyone in Chang'an City from taking note of his existence.</p><br/><p>Thinking about that, even someone as cold as Ning Que could not help but feel a warm and cozy sensation in his heart. Staring at the middle-aged man in the turquoise robe smiling in the middle of the crowd and approaching in his direction, Ning Que felt a little bit uneasy.</p><br/><p>When Chao Xiaoshu reached the entrance of the Old Brush Pen Shop, he looked and gently smiled at the lad and little handmaiden who were in the shop. He then greeted them with a bow with his hands folded in front and said, \"Boss Ning, nice to meet you.\"</p><br/><p>Ning Que saw the great number of people that stood at his door and the curious commoners who had crowded around to view the scene. He smiled embarrassingly as he followed Chao Xiaoshu in greeting with a bow with his hands folded in front and replied, \"Nice to meet you, Second Brother Chao.\"</p><br/><p>Those three words \"Second Brother Chao\" were first heard from the Deputy Commander, Xu Chongshan. He thought that this way of addressing him was appropriate since it not only showed his respect, but also drew their relationship closer. Instead, this caused Chao Xiaoshu to be taken aback. Slowly, a suppressed smile was revealed on Chao Xiaoshu's face as the group of threatening-looking men that stood behind him nodded their heads and stared at Ning Que with a friendly, teasing look. Everyone in Chang'an City addressed Chao Xiaoshu as Spring Breeze Pavilion Old Chao, and the brothers in the Fish-dragon Gang would address him as Gang Leader or Big Brother. But, only a few would address him as Second Brother Chao, hence, Ning Que had unknowingly let the cat out of the bag.</p><br/><p>\"I'll be leaving Chang'an very soon, so I brought along a few of my gang brothers to visit the shop owners along the street. Should Boss Ning have any issues in the future, do feel free to look for them. Of course, I believe as long as Boss Ning puts in the effort to run his business, the business will definitely prosper and it'll be successful. Do not forget to help my gang brothers out when that time comes.\"</p><br/><p>Chao Xiaoshu gently smiled and looked at him as he pointed his right finger at the handful of fierce-looking men behind him. He added, \"I believe you've seen Qi IV before. The others are Chang III, Liu V, Fei VI, and Chen VII. They are the brothers that I trust the most.\"</p><br/><p>\"As long you put in the effort, your business will definitely prosper.\" Chao Xiaoshu had mentioned those similar words at other shops as well. However, to Ning Que, there were other hidden meanings within them. Ning Que understood, and so did the group of men that stood at the entrance of the Old Brush Pen Shop. Chang III and Liu V glanced at each other and saw the others' look of surprise. They then took a step forward and silently bowed toward Ning Que.</p><br/><p>All of them knew what had happened that night in the spring rain and, even though they had never met him, they already liked Ning Que. At the same time, they knew that Chao Xiaoshu had high regards for this lad. What they did not know was that Chao Xiaoshu regarded him so highly, to the extent that they could feel their big brother secretly trusting his important tasks to him.</p><br/><p>Chang Siwei looked at Ning Que and said in a friendly manner, \"Boss Ning, should we face any issues in the future, it is unavoidable that we may need disturb you.\"</p><br/><p>After the conversation in the palace last night, Ning Que finally understood that these men were secret guards who had been arranged by His Majesty and placed among the commoners before. Since their identities were already out, they would most probably be called and reinstated with official positions in the palace soon. Of course, he naturally could not reject their requests, but he somewhat felt that something was off from their words.</p><br/><p>Indifferent Chang III, Cruel Qi IV, Domineering Liu V, Ferocious Fei VI, Cunning Chen VII—these were the remarks given by the Chang'an commoners to the five Fish-dragon Gang generals. Due to the warm and friendly look from Chang Siwei, Ning Que somewhat could not think of him as indifferent and had not known that Chang Siwei actually had a plan deep in his heart to hang onto him for some time.</p><br/><p>Since they wished to keep this relationship a secret, Chao Xiaoshu and the others could not stay too long in the Old Brush Pen Shop or they would attract too much attention. After they exchanged a few casual words, Chao Xiaoshu grinned at Ning Que and said three words:</p><br/><p>\"Time to go.\"</p><br/><p>It was another drizzling day. The drizzle was so light and gentle that the passengers did not even bother putting their bamboo rain hats on. Ning Que silently stood in the alley alongside Lin 47th Street as he saw the group gradually disappear from his sight. Looking at the back of the ever-elegant middle-aged man in the turquoise robe, he felt a sense of regret in his heart.</p><br/><p>\"One needs time to prove themselves worthy of being another's brother. To be your brother just because you want it, isn't that foolish for me? I was thinking that perhaps after a few years, and if our friendship is still strong, that I wouldn't mind being your brother. Yet, now that you decided to just leave abruptly, you're still making me look like a fool.\"</p><br/><p>Ning Que shook his head and let out a sigh. He turned around as he held onto Sangsang's hand and walked into the alley. A few peach blossom stalks had grown out from the cracks on the wall. No one knew when the spring rain had cut away their roots as they fell and scattered onto the cement ground.</p><br/><p>Similar flowers were found scattered all around the cement ground near the city gate. Inside one of the wine shops, Chao Xiaoshu and his brothers, whom he shared life and death with, were all celebrating with the peach blossom wine that was sold in Chang'an City. They drank their fill before saying their goodbyes.</p><br/><p>…</p><br/><p>…</p><br/><p>The spring rain came and went just like the passersby that entered and left our lives. The lad and his handmaiden that had come from the City of Wei had unwittingly stayed in the capital for a month. Today was a very important day for Ning Que, and of course, that was excluding those days where he had to get rid of those enemies.</p><br/><p>Today was the reopening of the Academy. Yup, that was right, it indeed was the reopening of the Academy, because the first day of school in the Academy was the day of the Academy entrance exams. Whoever passed the Academy entrance exams would honorably become a student of Chang'an Academy. And those who failed would at least have the chance to participate in the solemn Academy reopening ceremony and take a look at the interior of the Academy. There was no doubt that the experiences that they had on the first day of the Academy would give them unforgettable memories, which might provide them with some comfort despite failing to become students.</p><br/><p>Early in the morning at five o'clock, Ning Que and Sangsang woke up and started preparing for the Academy. The first day of the year in the Academy was important not only to the Tang Empire, but it was also an important matter to the whole world. And for the commoners living in Chang'an, it was a day which they looked forward to. Most of the food stalls were open earlier than usual, so the young master and his handmaiden were fortunate to have their bowls of hot and sour noodle slice soup in the morning.</p><br/><p>Ning Que could not stop himself from yawning as he rubbed his slightly teary eyes. It was obvious that he had not slept well the night before. Sangsang also had two dark circles around her eyes, which were darker than her facial skin tone. She appeared to be much more anxious than her young master.</p><br/><p>The Ministry of Rites had arranged horse carriages to fetch the examination candidates from their locations to the Academy. However, since Ning Que wanted to bring Sangsang along, he chose to rent his own horse carriage instead. Knowing the identity of the customer, the private horse carriage driver did not dare to delay a single minute and was fully prepared in the middle of the night before the big day. Thus, the moment that the young master and his handmaiden were out of the Old Brush Pen Shop, they immediately headed south to their destination.</p><br/><p>The traffic was fine in Eastern City, but the moment their horse carriage entered Southern City, the traffic was packed. It was before dawn, so the wide and broad Vermilion Bird Avenue was dim and fully packed with hundreds of horse carriages. There was a light drizzle falling from the sky as the wheels from hundreds of carriages were rolling and numerous horses were fiercely splashing the puddles of rainwater on the wet cement ground.</p><br/><p>The horse carriages sent by the Ministry of Rites were given the priority to go first, followed by those carrying candidates who showed their Academy entrance exam certificates. After much effort, a path was finally cleared to make a long queue towards Vermilion Bird Gate. Today, the candidates at the Academy in Chang'an were the most important people. Other carriages with officers or noble families that were heading to the Academy to attend the ceremony were all asked to wait off to the side. And the rich scholars who purchased tickets just to attend the ceremony out of curiousity were impolitely being pushed to the end of the queue.</p><br/><p>The candidates were more important than the officers, and were even more important than those rich businessmen who contributed the most taxes in the Empire. Though this seemed unthinkable, but in fact, when one looked at the quiet and elegant horse carriages as well as the bodyguards whose expressions were normal despite such treatment, one could imagine that for the past several years, the Academy had been like this.</p><br/><p>Ning Que and Sangsang sat in the carriage as they drew open the corner of the curtain from time to time to glance around at their surroundings, which somewhat calmed down their anxiety gradually. As the horse carriage finally drove out of the Chang'an Southern Gate and the broad pathway stretched far toward the south where there were mountains, white clouds, and blue sky, Ning Que was even in the mood to admire the beautiful scenery in front of him.</p><br/><p>The spring rain was still falling, yet the view from the river to the grassland and to the mountains had not been influenced at all. That was because there was a clear view to the front of the mountain peak, and the peak was way above the rainy clouds. So, when the morning sun rose and cast its first light, the cliff reflected its light and dispersed it out to the world, making the scenery look quite cozy and warm.</p><br/><p>Looking at the marvelous scenery in front of him as the carriage slowly drove in the light drizzle, Ning Que felt exceptionally calm. Though he was not sure of the reason, he felt that there were something in this scenery that greatly attracted him, and it gave off a feeling that he liked it.</p><br/><p>At the southern part of Chang'an, at the bottom of the mountain, there was the Academy.</p><br/><p>It was a place that was built a thousand years ago without any modification to its name. Its history was longer than the history of the Tang Empire, and it was a place that cultivated numerous world-famous officers. Not to the extent of being mysterious, but it was considered a holy Academy.</p><br/><p>It was also a place that Ning Que was dying to enter, even if he had to put out tremendous effort.</p><br/><p>…</p><br/><p>…</p><br/><p>A mountain could be unknown, yet could stand up between the grasslands and the rivers as it grew higher into the sky.</p><br/><p>And an academy could be unknown, yet could be built in the corrupt mortal world as it stood there for generations.</p><br/><p>Numerous horse carriages drove their way to the bottom of the mountain. The soft laughter from inside the carriages stopped upon reaching their destination. The candidates who came for the exams did not feel pressure at all, but in fact, they kept quiet because they felt the need to show their respect to this holy place.</p><br/><p>Under the exquiste light cast by the morning sun, the bottom of the mountain was covered with a large area of green highland meadows. The fluctuations of the slopes seemed like a solidified wave and the greenness of the meadows seemed like a drawing. In that drawing, there were over 10 roads crisscrossing one another in a complicated manner. Beside these roads, there were a few flowers and trees. In the middle of the meadow, there were several flowers and trees gathered together. They were either apricot flowers or peach blossoms in powdery-white colors as they spread across the highland in a disorganized, yet amazing way, which made them look extraordinarily beautiful.</p><br/><p>Looking out of the carriage window, Ning Que and Sangsang were mesmerized by this beautiful scenery. As they saw a stretch of black and white architecture on the lowland meadows, they were somewhat lost in their thoughts. After keeping quiet for a long while, he turned around to look at Sangsang and said very sternly, \"I must get into the Academy!\"</p><br/><p>Sangsang lifted her small face and looked at him worriedly. She then spoke, saying, \"Young Master, have you completed... those few Academy entrance exam mock questions?\"</p><br/><p>Ning Que was silent for a long time before he spurted out angrily, \"I need lucky words! Kiddo, do you even understand what I mean by lucky words!?\"</p><br/>\n</div>"}