{"title": "Chapter 76: I Chopped a Mass of Peach Blossom that Spring (IV)", "id": 76, "volume": 1, "url": "http://boxnovel.org/nightfall-chapter-76-i-chopped-a-mass-of-peach-blossom-that-spring-iv", "volume_title": "Volume 1", "body": "<h1>Chapter 76: I Chopped a Mass of Peach Blossom that Spring (IV)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 76: I Chopped a Mass of Peach Blossom that Spring (IV)</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The instructors all shook their heads and expressed that they had no idea why he chose Er to be his answer. Some took interest in Ning Que and picked out his Etiquette and Calligraphy papers in advance to see if he would merit grade A. Much to their dismay, though being finished neatly, the two papers were riddled with loads of hot air. One instructor irritatedly pounded his fist on the desk, then passed the papers to others to examine, and had considerable regret.</p><br/><p>\"What a waste of such good handwriting! I dare say that few of us have seen such perfectly written Hairpin-style Small Regular Script before in the past Academy Entrance Exams! Who would have thought that his answer would simply be trash? I'd say he well deserves an F! How furious I am now!\"</p><br/><p>Some picked up his papers and commented amusingly, \"Empty talk no doubt, but you must admit that it is quite pleasant to look at. How about a D- due to such neat handwriting?\"</p><br/><p>\"No way!\" The angry instructor responded irritably, \"What on earth was in his mind to write papers with such delicate handwriting like that which court ladies often write? What was he up to? I must say that he was intent on insulting our intelligence! He was simply challenging the prestige of the Academy!\"</p><br/><p>Eventually, Ning Que's clever trick was considered as a disrespectful insult to the Academy. Consequently, the two papers were marked two F's, the lowest one which students could get.</p><br/><p>Ning Que hitherto had little idea that both his Etiquette and Calligraphy were sentenced to death, but it was clear to him that he could procure no good results from the two tests. Whether he could be enrolled as an official student of the Academy was now completely dependent on achieving high grades on the Driving and Archery tests, given that he had already quit Music. More precisely, the best marks possible needed to be made.</p><br/><p>A loud neigh could be heard on the meadow of the Academy as the students handed out their candidate numbers, entered the examination place, and were randomly paired with military horses. Considering that people of the Tang were esteemed warriors, it was therefore foreseeable that most students chose to ride on horses instead of driving carriages.</p><br/><p>Students awaiting their turn stood outside of the fences, watching attentively. Some students performed handsomely, some did poorly by contrast and fell off from the horses' backs onto the meadow, spattered with mud. Luckily enough, a student would have been seriously crippled by a jumping horse but for the captain, who reined it timely. It was universally understood by the students that the Driving test depended on some luck. If you picked a docile and healthy horse, it was highly probable you passed; on the contrary, if a fierce and bucking one was chosen, you would be fortunate enough not to be trampled.</p><br/><p>As being ridden particularly in the Academy Entrance Exam, the horses were carefully chosen beforehand by the Military Ministry. Most were robust and handsome, standing quietly aside, making no sounds or movements and looking at either the meadow or peach blooms.</p><br/><p>A black stallion on the meadow caught the attention of all the students. Some were concerned, and some even looked terrified. Three students had fallen off of it already, and one female student dressed in a bright red outfit was tossed away, fell hard, and was almost crippled by its hooves. That indeed was a dangerous scene to behold.</p><br/><p>The wailing female student was then helped to walk outside of the fences to collect herself. Those awaiting students looked very solemn and serious, and prayed earnestly to Haotian in their hearts that they would not be paired with the black horse.</p><br/><p>The pairing results came out, and some students finally caught their breath, at the same time showing their sympathetic looks to the unfortunate guy. Someone had to accept the bad luck, which usually fell upon on our hero. As the saying goes: no pain, no gain—or put in this situation: an unruly horse makes a hero.</p><br/><p>Being stared at with looks of pity, Ning Que slowly walked into the fenced meadow, appearing to be serene, yet cursing inside. Of course, it was not difficult for him to tame a fierce horse as he had grown up in the grassland. But it was the highest mark of Driving that he was aiming for, and he worried that he might have insufficient time to tame the horse.</p><br/><p>All of the horses on the meadow were equipped with bridles, the black one included. Strangely, no matter how hard the captain pulled on its bridle, the black horse stood still next to the fence, and even stuck its head over the fence to consume some peach buds, looking very content with itself and not troubled by the bit in its muzzle whatsoever.</p><br/><p>The way that the horse showed off, whether chewing on peach buds or wagging his tail, made many students want to curse.</p><br/><p>The captain who oversaw the test horses wiped the sweat off of his brow, and as he saw Ning Que walking his way, he said with deep sorrow in his voice, \"I don't know what happened to him today. He seems to be very astir, and a bit flower-addicted. Be careful!\"</p><br/><p>The captain then withdrew outside of the fences. Ning Que strode toward the black horse, stretched out a hand, and patted his strong crest. The horse glanced sideways at Ning Que impatiently, full of discontent and disdain.</p><br/><p>Regarding how to tame a horse, Ning Que knew hundreds of skills, yet it was the limited time that he was concerned with and competed against. He pretended not to notice the challenging look in the horse's eye as he smiled and said, \"Serve me well, Big Blackie!\"</p><br/><p>\"Or you'll be a dead horse,\" continued Ning Que, beaming innocently with dimples on his cheek.</p><br/><p>Suddenly, the horse seemed disturbed with fear. The menacing words which came from the young lad somehow did work on the horse, turning him to almost a cockhorse. Shaking his mane uneasily, the horse became stiff, and those peach buds in his muzzle fell onto the meadow. Obviously, he felt unmistakably threatened by Ning Que's killing intention.</p><br/><p>Though not being able to understand human language, military horses often could perceive men's feelings very well—experienced ones in particular. They knew it when an imminent peril or a real intent of killing came.</p><br/><p>Starting when he was a 4-year-old boy up until he was a 16-year-old young man, Ning Que had been used to killing—from Chang'an, Min Mountain, to the City of Wei, the grassland, Shubi Lake, and back to Chang'an again. Heads had been chopped off and blood had been shed. The grassland had been conquered by the notorious wood-chopper of Shubi Lake, and the toughest horse-gang leader had to succumb to him.</p><br/><p>Ning Que's danger might have been imperceptible to men, but not for a horse, especially when he emphasized that he might kill it.</p><br/><p>A burst of surprised cries was exclaimed from outside of the fences. Both the cautious students and the captain looked at the corner of the meadow, astoundingly and admiringly.</p><br/><p>At the corner, Ning Que was walking the black horse to the starting line, who at first appeared to be fierce and unruly, not as docile and quiet as a trained maidservant.</p><br/><p>Farther away on a slope, Sangsang was sitting, who put away the black umbrella under her bottom, and yawned lazily with her small hand over her mouth. It was probably only she, now looking bored, that did not worry about her young master's life.</p><br/><p>…</p><br/>\n</div>"}