{"title": "Chapter 108: A Bowl of Noodles at Summer Night, a Tea Specialist beside the Lake", "id": 108, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-108-a-bowl-of-noodles-at-summer-night-a-tea-specialist-beside-the-lake", "volume_title": "Volume 2", "body": "<h1>Chapter 108: A Bowl of Noodles at Summer Night, a Tea Specialist beside the Lake</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 108: A Bowl of Noodles at Summer Night, a Tea Specialist beside the Lake</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Chang'an was a perfect city, except for its summer.</p><br/><p>Entering June, the sun became brighter and brighter, and the temperature became higher and higher. Every street and alley was full of summer heat, and the occasional breeze also brought the tiresome hot heat, causing the green and full leaves to wither and the grapes on trellis to turn purple. What was more, the noble families had to take out their ice cube and the commons opened their doors and windows.</p><br/><p>The doors and windows of all shops at Lin 47th Street were open.</p><br/><p>Compared to the risk of being stolen, dying of stroke was obviously more terrible. The toilsome manservants and labors just sat down on the stone steps and looked around languidly to guard against thieves, who actually also stayed at home for coolness. What was more, the shopkeepers and masters were sitting in the alleyway on bamboo chairs with their water buckets.</p><br/><p>With trees blocking the sun at daytime, the narrow and quiet alleyway was a suitable place for them. In addition, the night wind became cooler while passing through the narrow way, and thus people would feel more comfortable.</p><br/><p>All kinds of bamboo beds and small square tables had totally blocked the narrow alleyway. The residents chatted while lying on the bamboo beds, snacking on cold fruit and nuts on the small square tables beside them.</p><br/><p>For someone who was used to seeking happiness in difficulty, he even gobbled down a bowl of spicy Youpo noodle. The sweat triggered by the pepper and the sweat stimulated by the heat mingled together, as if telling himself that the night was not so hot.</p><br/><p>A clear \"Pa\" sound would occasionally appear in the alley. It sounded like an adult beating a naughty child, but in fact, it came from people flapping their sweaty backs with soaked towels.</p><br/><p>\"I say no! You still want to find a concubine to warm your bed in such hot weather?\"</p><br/><p>The couple at the fake antique shop quarreled about the concubine issue every day. The people at Lin 47th Street were already used to it, and even wondered if it was a special flirting way for the couple.</p><br/><p>There was also a back door to the alleyway at the Old Brush Pen Shop. It was useless in the past several months until now. Ning Que lay on the bamboo chair and accepted the wet towel Sangsang handed him He rubbed his naked upper body with a sigh. Listening to the quarrel from the bamboo beds near them, he thought that there indeed was not any fun in the town life written by scholars.</p><br/><p>Since it was boring, Ning Que stood up sulkily and left with his wet towel on his shoulder after greeting the neighbors beside him. Sangsang followed him with difficulty, holding a bucket in one hand and dragging the bamboo chair with another.</p><br/><p>The handmaiden was in a thin blue shirt today, with her little arms and legs naked and her black face flushed red. Though she usually would not sweat due to a deficiency-cold syndrome, it did not mean that she could not feel the extreme heat in the air. Contrary to that, it would make her feel even more stifled. Looking at Ning Que beside the well, she asked, \"Young master, can I take off my outer shirt?\"</p><br/><p>Ning Que had just gotten a bucket of fresh cool water from the well and intended to pour it over his head. He became more annoyed and reprimanded her without turning around when he heard that. \"You might be young, but you're still a girl. You shouldn't take off your clothes in front of a man. You aren't three or four years old when I could rub or take a shower for you. You're already a young woman, please be aware of that.\"</p><br/><p>Sangsang stared at Ning Que irritably and replied, \"Young master, you haven't answered my previous question! Is it so interesting to take revenge? You aren't bored of it even though you've killed a person every few days.\"</p><br/><p>\"This killing business has nothing to with interest.\"</p><br/><p>Ning Que replied, \"Now we eat leftover food and go to toilet to shit every day. Isn't it repetitive and boring? No matter what, you have to do these things, because you'll starve to death if don't eat food and you also will die if you don't shit. As for the killing, we have no choice but to complete it for a more peaceful life, even if it's boring.\"</p><br/><p>After finishing the sentence, he raised his hands with the bucket and then turned it over. The whole bucket of cool well water splashed on his body with a \"Hua la\" sound, and then flowed around the stone floor of the courtyard. Ning Que quickly felt refreshed, but his lower body also felt cooler. He looked down confusedly and realized that his cotton shorts had been pushed down away some distance by the well water.</p><br/><p>Sangsang, looking at his half-naked butt and the waistband tightly around his butt, let loose a rare giggle, failing to conceal her happiness through her hand covered her lips.</p><br/><p>Ning Que quickly pulled up his shorts and then angrily rebuked as he turned his head back. \"What're you looking at? Killing people is more interesting than this kind of thing after all.\"</p><br/><p>Sangsang put down her hand and looked at Ning Que. She answered carefully, \"I'll make a bowl of fatty intestine noodles later.\"</p><br/><p>...</p><br/><p>...</p><br/><p>In summer of Chang'an, the time before dawn was both the darkest and the coolest. The residents, who had to sleep on the street and count on the alleyway wind due to the long hot night, went back to their houses. They wanted to have the most wonderful and comfortable sleep during this short cool time, hoping to make up for the time they lost in the day.</p><br/><p>No one slept at the Old Brush Pen Shop.</p><br/><p>Sangsang cooked a bowl of sweet-smelling noodles, with soup and lots of chive and six or seven sections of fatty intestine and two big intestine heads.</p><br/><p>After gobbling it down enjoyably, Ning Que rubbed his mouth, put on a common but shabby shirt, wore a new but ordinary hat and covered most of his face with a mask, and then wrapped his podao and big black umbrella. Later, he pushed open the back door of the courtyard and went into the dark night after bidding Sangsang goodbye.</p><br/><p>Ning Que walked through the streets and alleys in the peaceful Eastern City, accompanied by the cool night breeze. Both the tired people and vigilant dogs were sleeping soundly. It seemed as if the whole city was in a deep sleep. Only the sound uttered by the water-delivering carts pressing the slate would appear occasionally and suddenly, but they soon faded away gradually.</p><br/><p>The weak lantern light shakingly illuminated the road before the cart.</p><br/><p>When the water-delivering cart passed a corner of the downtown street in Southern City, Ning Que, who had been squatting silently at the gap of the big water buckets jumped down quietly and landed on feet. He quickly ran into the dark side alley. Then, he took out of the hand-painted map Sangsang made, and had a last glance at it under the very weak light.</p><br/><p>It was no wonder why Sangsang felt confused. Ning Que's plan to kill one person periodically was totally discordant with the peaceful, hard but happy life in Academy and also was disharmonious with the carefree but boring downtown life in Lin 47th Street. What's more, the repetitive killings were indeed quite boring. However, for Ning Que, who returned to Chang'an from City of Wei, it had been a very important part in his life, even a living habit, to enjoy fatty intestine or fired-egg noodles and then killing someone for revenge, just like his meditating for several hours after practicing handwriting.</p><br/><p>Every time he killed an enemy and erased a name from his revenge list, he could feel less weight on his shoulder and feel a little relieved. Also, the thick blood on his hand would be a little thinner. Everyone instinctively looked forward to the easy and happy life, and thus his instinct prompted him to continue with the revenge plan.</p><br/><p>The preparation of his podao, wrapper, mask, coat, hat, map and even the target's daily schedule and habit were conducted by Sangsang. A little black-face handmaiden who walked around the alley of Chang'an, hardly attracted other people's attention. Ning Que was not worried about her safety. But most importantly, he believed in her ability.</p><br/><p>Therefore, he never second-guessed whether his blade would fail to cut down his target's head when he was ready to pull out his podao. He had already used that person as a sacrifice to the deceased of General Xuanwei's Residence and that village while going into the downtown street silently by the cover of darkness and walking straight to the lake behind the teashop.</p><br/><p>Today, he would erase the third name of the list on the oilpaper.</p><br/><p>The owner of the head was Yan Suqing, 41, a former Military Clergy Appraiser.</p><br/><p>The man excelled in tea culture and seal verification. After being expelled from the Military Ministry by the imperial court with an excuse, he was specially employed by a well-known tea merchant as a tea specialist. According to Zhuo Er's research, the ironclad proof concluding Xuanwei General's treason at that year—the three writings—was verified by the man in person, and was perhaps even counterfeited by himself.</p><br/><p>What was more, the man had much unclear and misty relation with the village-slaughter case in the border of the Yan territory. Back then, General Xia Hou's army had attacked the Yan Kingdom. Yan Suqing was in General Xia Hou's army when the army failed to arrive at the border of Min Mountain on time. It was curious why a military clergy appraiser would appear in the bloody battlefield.</p><br/><p>At present, Yan Suqing lived in a lakeside small house which the tea merchant bought for him. As Ning Que walked along the lake silently, the sight of the closer peaceful house beside the lake and the view of the seemingly-irregular but picturesque bamboo wall and grass house suddenly made him feel that something wrong. His eyebrows which were outside the mask rose slowly.</p><br/><p>In a word, the lakeside small house was too peaceful and beautiful.</p><br/><p>To settle in Chang'an was very difficult. Every inch of land in Chang'an was worth its weight in gold. Among the hustle and bustle in the whole city, the words \"peaceful\" and \"beautiful\" meant noble and even powerful. Though Ning Que knew that Yan Suqing was highly trusted and appreciated by the tea merchant, he also believed that it was impossible for a tea merchant to give such a lakeside small house to a tea specialist, even if the businessman was very wealthy and generous.</p><br/><p>The morning light had yet to arrive, so the vision of the lake remained dark. Only the reflection of lamplights from someone' s house could be seen on the ripple, as if presenting a little-sequestered light. Ning Que walked to the front of the lakeside small house. Separated by the alienated bamboo wall, he looked at the large stone chair below the stone steps in courtyard and the emaciated middle-aged man in the chair. After a short pause, he pushed the door open and walked in.</p><br/><p>A small oil lamp was lighted up. The thin middle-aged man sat on the stone chair, with his left hand holding a big but crude teacup made of mud and his right hand gently knocking a corner of the ebony tea table. He looked at the lad calmly with a cold smile suddenly showing up on his skinny face, and then said in a low voice.</p><br/><p>\"The so-called tea ceremony in tea culture is just using a complicated and repetitive procedure to intensify the sense of ceremony so as to bring about a sense of dignity.\"</p><br/><p>\"Many people think when I enjoy the tea at home, I would burn incense, take a shower, worship Haotian for a long time and wash the cups for a while before sending the tea into my mouth. In fact, I've always enjoyed drinking the tea with a large cup best. Maybe the habit was formed in the army. I prefer a more direct way in handling affairs.\"</p><br/><p>\"This is such a hot summer night. Instead of sleeping at home, you choose to stroll around a lake. You... must be here to kill me.\"</p><br/><p>...</p><br/><p>...</p><br/>\n</div>"}