{"title": "Chapter 101: Successor of the Divine Talisman Master", "id": 101, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-101-successor-of-the-divine-talisman-master", "volume_title": "Volume 2", "body": "<h1>Chapter 101: Successor of the Divine Talisman Master</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 101: Successor of the Divine Talisman Master</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The tall and thin Taoist dipped his finger in wine and continued to write on the rosewood table. Very soon, he had copied all the twenty-nine characters on the note. He sucked his finger and put his hands down. He lowered himself to take a closer look at the table, carefully scanning over the pieces of paper in the account book.</p><br/><p>His eyebrows became more tightly knitted as he continued. He shook his head more and more frequently with even more confusion. \"What kind of writing style is this? I've never seen it before. There's no fluctuation in the primordial Qi, so why would it be found in abundance here? The characters are obviously messy, but why do I feel a tightness in my mind when I trace them with my concentration?\"</p><br/><p>Shaking his head, he stood up and straightened his body. He paced inside the room before quickly returning to the rosewood table, examining the characters on the paper. His eyebrows remained tightly knotted. He shook his head and mumbled repeatedly, \"Blocked! It's all blocked! Not blocked? No!\"</p><br/><p>Regardless of how much conflict there was between the three main cultivating factions or countries, no one had ever dared to show disrespect to the Divine Talisman Masters. In this world, cultivators were rare, and such masters rarer still. They sat at the crossroad of worldly literature and art and cultivation. With a rise and drop of their brush, they could command gusts and startle the supernatural. They were too important to cultivation and warfare and considered to nearly non-renewable resources. Thus, they were always treated with the utmost respect.</p><br/><p>Though the Tang Empire was the most powerful nation in its time, yet possessed not more than 10 Divine Talisman Masters. Most of those masters had long removed themselves from the secular world, choosing to seclude themselves in the Academy or the wooden mountains to pursue Taoism, devoting themselves to exploring the secret of the law of nature. This left few masters in the earthly world. Out of the four masters from the South School of Haotian Talisman, two were envoys that the West-Hill Divine Palace sent to Chang'an to demonstrate its power and influence. Thus, they weren't permanent residents of Chang'an. In that sense, that meant there were only two Divine Talisman Masters from the South School of Haotian Taoism left.</p><br/><p>The man visiting the House of Red Sleeves tonight was one of the two.</p><br/><p>He was called Yan Se, the second brother of the Master of the Tang Empire, Li Qingfeng. He was the Minister of Offerings in the South School of Haotian Taoism. He favored strong wine, beautiful women, and clever calligraphy. His talisman art made him one of the most extraordinary masters in the world. In the torrential downpour that night, it was his marvelous trick to draw a talisman out of the rainwater in the alley and frightened the self-proclaimed cultivation genius of the Tang Empire, Wang Jinglue, into a crying little fat child.</p><br/><p>Besides various Martial Arts of Talisman, Divine Talisman Masters were commended for their ingenious state and writing skill. It was said that a great calligrapher or painter couldn't become a Divine Talisman Master without a cultivation potential, but all Divine Talisman Masters were famous calligraphers or painters crowned with eternal glory in their own right.</p><br/><p>Yan Se was a Divine Talisman Master who indulged in brothels but he was someone who could be the top calligraphy master in the world if he wanted to. Yet his attention was captivated by the messy script on the paper torn from an account book. He still couldn't find a solution after racking his brains, only repeating the word, \"Blocked.\" If the other calligraphers and powerful cultivators found out, they would be shocked speechless. They would also gain an interest in Ning Que, whose script had puzzled a Divine Talisman Master. Just who on earth was he?</p><br/><p>The messy script with 29 characters had put Yan Se, the great Divine Talisman Master, into a state of confusion. Yet it wasn't because Ning Que was capable. For various reasons, his mental state had somehow perfectly corresponded with his style of writing at that point in time.</p><br/><p>The books in the old library had inspired him today, so what he had done was remember the form yet neglect the meaning. Driven by such exultance, he visited the brothel with his classmates to drink like a fish. In a drunken stupor, he randomly picked up the brush and composed those words hastily. The inspiration he had received allowed him to dispel all the strict restrictions of penmanship. His drunkenness helped him subconsciously flout the rules of the strokes. Twisting plum blossoms and pushing down the grape trellis, he was driven by his tipsiness to frantically and excessively drag his brush, in hopes of precisely creating an illegible script.</p><br/><p>His writing style had opened up a new path, using a clumsy and awkward path to wedge a different and concealed cultivating path. A talented calligrapher in Chang'an might not have found it unique, but in the eyes of this Divine Talisman Master, it seemed as if the calligraphy had caused an itch in him. Perhaps it was an itch that hadn't been scratched for the past 60 years, something that itched to the core of his bones.</p><br/><p>Yan Se's comments about Ning Que's calligraphy being 'blocked' was correct. Ning Que was born 'blocked' - obstructed by the rules of cultivation. All of his acupoints in Snow Mountain and Ocean of Qi remained closed off. He was now seeking a longer, winding path to reach the top, yet there existed boulders at the end of the path as well. How could he pass?</p><br/><p>The meaning between lines referred to the fact that each stroke in the middle and the one thereafter illustrated the mental state and the thought of the writer on the spot. Every single word in this messy script was illogical. That was because the real meaning was buried in fuzzy ink and became unclear. Yan Se's copy managed to uncover the feeling imprisoned in the strokes, no matter how powerful the shackle was. That feeling permeated into the rosewood table through the wine and suffused the House of Red Sleeves with the flavor of wine...</p><br/><p>When Ning Que wrote the note for Sangsang, he was still at his height of drunkenness. He apparently wanted to convey that he wanted to stay in the House of Red Sleeves, yet his true feeling was revealed when the hidden meaning was diffused. He himself didn't know of this feeling. Perhaps he was unwilling to admit it.</p><br/><p>In the courtyard with a couple of plum trees located in the west, Lu Xue was sunk into silence as she held her bamboo flute. Her delicate face was haggard, her expression deeply sorrowful. She stared at the long withered old plums at the far end of the courtyard, longing for the spring in her hometown in the south.</p><br/><p>In the courtyard with a cluster of bamboo located in the east, Dewdrop was staring in a daze at the twinkling stars reflected on the water inside the basin. Her crystal-like tears flowed down her smooth cheeks, plopping into the basin with a soft sound.</p><br/><p>Behind the bead curtain in the room on the top floor of the House of Red Sleeves, Mistress Jian stared at the portrait beside her bed. Her smooth forehead was knitted into a frown as she looked at the young scholar riding a donkey in the portrait, his raised eyebrows, his cheerful and even arrogant laughter. She slowly shed tears, mumbling her complaint. \"Ke Haoran, you jerk. Back then, I made chicken soup and waited for you to come back each day, yet you wouldn't. Are you happy now? You can't drink any even if you want to. I don't even know if… you're doing well in the other world.\"</p><br/><p>She suddenly frowned and tightened her grip on the handkerchief in her hand. She took quick steps to reach the handrail and looked at the courtyard downstairs. She knew about Dewdrop's guest, yet seemed to feel no fear at all. Instead, she was annoyed and angrily scolded, \"What an insolent old man! Why did you come to my brothel to evoke my memories of that scoundrel?\"</p><br/><p>Walking under the shadow of the bamboo in her courtyard, Dewdrop made her way back into the room after washing up and putting on a light layer of makeup. When she saw how her guest was shaking his head at the table, her body stiffened. She stepped ahead to take a look and asked with a frown, \"Mister, I kept thinking that I caught the smell of chicken soup. Why is that?\"</p><br/><p>\"It's not the smell of chicken soup. It's the taste of home.\"</p><br/><p>Yan Se shook his head and pointed at the 29 scribbled characters on the accounting paper. \"When the person wrote this note, he desperately wanted to return home and drink the bowl of chicken soup. That doesn't mean the soup is tasty. I'm curious about Sangsang. For him to act this way, I wonder if she's his ferocious wife or strict mother?</p><br/><p>\"That's… Isn't that written by Ning Que?\" Dewdrop's delicate face was filled with confusion. \"He didn't seem like he wanted to go home then. Sangsang isn't his wife either. It's his little handmaiden.\"</p><br/><p>\"Little handmaid? Then that makes this even more illogical.\"</p><br/><p>Yan Se shook his head again, ignoring this. He had remained a bachelor all his life because he had seen too many ferocious wives in the Tang Empire, especially in Chang'an. He preferred the brothels and the company of different women. Thus he couldn't understand the writer's longing for a little handmaiden and a bowl of chicken soup.</p><br/><p>The next morning, that tall and thin Taoist left in a horse carriage without inquiring what Ning Que, the one who scribbled the 29 messy characters, was like. After a short while, Dewdrop appeared mid-yawn and rubbed her sleepy eyes. The feelings last night had all escaped her mind. She accepted the warm cup of tea from her maidservant and sipped on it. She subconsciously glanced at the table, only to find Ning Que's ragged memo had somehow disappeared. The messy script that her guest had copied last night on the rosewood table with wine had dried and vanished.</p><br/><p>She shook her head with a smile. When she put down her cup, she accidentally knocked her green jade bracelet on the rosewood table. She heard a light noise and saw the flutter of a layer of red and fine powder on the table.</p><br/><p>Dewdrop was stunned and widened her eyes curiously. She hesitated for a moment before pulling out her handkerchief to softly wipe away the powder. Unexpectedly, she found a line of scribbled words under the red powder. They seemed shallow but was actually deeply carved into the wood, unable to be wiped away at all.</p><br/><p>\"Sangsang, your master is drunk today and won't be home to sleep. Remember to drink the chicken soup left in the pot.\"</p><br/><p>Dewdrop's eyes were wide as she stared at the words. She vaguely came to a realization. She didn't know her guest was a legendary Divine Talisman Talisman nor could she predict what achievements Ning Que might make in the future. But she was clear this Taoist wasn't an ordinary person and wished sincerely that Ning Que had a good prospect. Most importantly, she was instinctively sensitive to opportunities after meeting all kinds of people in her life in brothels after a long time. Thus, she immediately ordered her maidservant to carefully put the table away and take good care of it for future use.</p><br/><p>On the other side, Yan Se boarded a worn horse carriage after leaving the brothel. Not long after, he came across a young Taoist with a yellow paper umbrella under his arm. The young Taoist greeted him with great respect, saying, \"Uncle, I've found the information you wanted. The person is named Ning Que and he has escorted the princess all the way... Lyu Qingchen has confirmed that he has no potential at all. The Academy had also tested him a while back, but he failed even in the course of magic skills.\"</p><br/><p>Yan Se sighed. Never mind this person's relationship with the princess, it was a problem that his acupoints were all blocked. Could he ask the West-Hill Divine Palace to gather the powers of the Great Divine Priests and forcibly break his acupoints by imposing Grand Spiritism on him? It wasn't easy to find a successor of the fine Martial Arts of Talisman. He had finally found one last night yet it was someone born deficient. What a pity.</p><br/><p>…</p><br/>\n</div>"}