{"title": "Chapter 119: The Story of the Big Black Umbrella", "id": 119, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-119-the-story-of-the-big-black-umbrella", "volume_title": "Volume 2", "body": "<h1>Chapter 119: The Story of the Big Black Umbrella</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 119: The Story of the Big Black Umbrella</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Ning Que had recalled some wondrous things that happened yesterday morning including those fantasy sufferings, but not dreamscapes, that he had experienced when he was in a coma in the street. The strong power of the cultivator had been fully revealed at the lakeside villa. He would not have defeated his rival even if he had brought all three podaos with him that day. As for the sufferings in the street, they were really dangerous. He could not have survived or even received such a lucky chance without the bestowments of Haotian.</p><br/><p>He firmly believed that Haotian had its own sake to make him come into this world, and thus he thought that he would not die for any reason. This belief supported him to get through the most difficult period of his childhood and each critical moment of his life and death. To him, the big black umbrella at Sangsang's bedside... was the gift from Haotian.</p><br/><p>The big black umbrella looked very ordinary, and no peculiarities could be seen except for its immensity.</p><br/><p>However, if it did not protect him from the invincible flying sword at the most crucial moment during that fierce battle in the early morning yesterday, and if did not help to keep him from the Yan Suqing's lifelong cultivating Sword Intent, Ning Que would have already died.</p><br/><p>The story of gaining the big black umbrella was nothing unusual, just like the situation where he found Sangsang.</p><br/><p>Many years ago, Ning Que held a baby girl, walking on the official road. It seemed as if it was going to rain, and he happened to see the discarded black umbrella by the roadside, so he picked it up.</p><br/><p>When the little boy held the thick handle of the big black umbrella, nothing strange happened. For instance, the pouring rain did not appear after the dark clouds; the distant Min Mountain did not totter; many dark clouds of smoke did not rise to the sky; no golden armor broke out of the clouds to say a lot of nonsense, and so on.</p><br/><p>He was not frugal when he was young, so he was ready to throw the black umbrella away after that rainy season due to its dirtiness. No matter how it was washed, it would not get clean. Furthermore, it was too heavy and troublesome for him, since he had to hold the baby girl along with the umbrella as he vied for food that was distributed by the officials with tribes of savages, who were moving south due to the drought in the grasslands.</p><br/><p>However, what was wondrous was that little Sangsang always began to cry when the umbrella was not found in his arms. Probably she had spent a long time sleeping with the big black umbrella. And no matter what Ning Que did, she did not stop crying, even the stolen candies did not have any effect. He had no choice but to pick the big black umbrella back up.</p><br/><p>Since then, many experiences over the past several years had proven that Sangsang's crying and Ning Que's decision were absolutely brilliant. The seemingly ordinary big black umbrella gradually showed its peculiarities on the occasions when he was hunting with those old hunters or by himself.</p><br/><p>It was unclear what the greasy fabric of the umbrella was made of. It saved Ning Que and Sangsang in several circumstances with its particular quality of being completely unafraid of the burning of fire and the cuts and stabs from knives and swords. Thus, they could survive the steep mountains and this perilous world. They owed much to it.</p><br/><p>Ning Que and Sangsang had been with this umbrella for many years. Only they had long regarded it as a very important partner in their life did Sangsang say those words at the gate of Chang'an that day, \"Where there is the umbrella, there're you and me.\"</p><br/><p>In addition to its being completely unafraid of the burning of fire and the cuts and stabs from knives and swords, the big black umbrella had many peculiarities. Although he was unable to discover them temporarily, Ning Que strongly believed that the umbrella needed a slow exploration.</p><br/><p>That fight that happened yesterday morning was the same as those most dangerous battlefields over the past 10 years. He instinctively and totally gave his life to the big black umbrella at the last minute of his life and death, and it turned out that the big black umbrella did not disappoint him. And at the same time, he discovered another secret of the umbrella.</p><br/><p>It could make the invincible flying sword lose all of its power, and it could make a sword master's lifelong cultivations unable to breakthrough, which was beyond the original physical defense peculiarities that it had previously demonstrated. And it entered into another fantastic state. Ning Que even faintly felt that the big black umbrella could probably restrain the abilities of all cultivators!</p><br/><p>It could be invulnerable and impervious, which could also be explained by its fabric, being made of some rare materials. But if his inference was correct, then what kind of reasons could be used to explain all of this?</p><br/><p>The big black umbrella, lying quietly next to Sangsang's little black face, was just a dead lifeless object which was incapable of speaking or moving. Yet in the eyes of Ning Que, its tightly bundled greasy surface began to release a kind of mysterious and chill Breath, and then the Breath instantly disappeared when it was carefully observed.</p><br/><p>Generally speaking, humans would instinctively feel frightened when facing mysterious things, but Ning Que simply did not, because the world of cultivation he stayed in was replete with the Qi of Heaven and Earth and many magical legends, with he himself being the most mysterious participant. Besides, the umbrella, which had helped keep out the wind and rain and which was used as a sleeping pillow and shield since his childhood, had become an indispensable part of his and Sangsang's life, so they would not feel fear for it.</p><br/><p>\"What... on earth are you?\"</p><br/><p>Having not recovered from his severe injuries and having been hit by the dizzy surprise and happiness, in addition to a few glasses of wine, Ning Que already felt sleepy. He then fell asleep, watching the big black umbrella, and subconsciously hugged Sangsang into his arms over the thin sheets.</p><br/><p>\"Snap!\" The cattail-leaf fan fell to the ground with a slight sound.</p><br/><p>…</p><br/><p>…</p><br/><p>The sun with its dim light was hanging above the silent wilderness as the dark night was falling. The surrounding temperature was very low. A piece of the purest and the most extreme darkness spreading from the distance would soon occupy the entire world.</p><br/><p>The silence of the wilderness did not mean that no humans existed there. Instead, there were many and all kinds of people. They watched Ning Que rather than look up to the sky, with their eyes full of hope, scorn, doubt, and complicated emotions.</p><br/><p>Ning Que knew that he had started dreaming again. Those dreams of the sea he had when he was not in meditation were the continuation of that dreadful dream from the journey. Although he was clear that he was in the dream, he still felt cold, as if the eyes of those people that he confronted in the wilderness, regardless of any kind of emotions that they had, concealed at least some subtle hostility.</p><br/><p>Darkness gradually invaded the wilderness, and half of the sky was covered by the pure night. At that moment, a thunderous sound was heard, and then instantly spread throughout the entire world.</p><br/><p>Many people in the wilderness were stricken by that roar of thunder. They fell to the ground, miserably moaning. For those people who could still stand, their expressions suddenly disappeared as if they were lifeless statues looking up again at the sky, looking at the place where the thunder had resounded.</p><br/><p>The holy light lit up the entire firmament instantly.</p><br/><p>Above the lofty firmament and in the brightest and centermost position of the holy glories was an extremely large golden door. When it was slowly opened, a huge golden dragon, which was indifferently poking its head out, was faintly seen.</p><br/><p>The thunder was the exact sound of that door opening.</p><br/>\n</div>"}