{"title": "Chapter 127: A Perceptive and Touching Friendship", "id": 127, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-127-a-perceptive-and-touching-friendship", "volume_title": "Volume 2", "body": "<h1>Chapter 127: A Perceptive and Touching Friendship</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 127: A Perceptive and Touching Friendship</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>There were six subjects in the Academy and they all had their own difficulties. Mathematics, Driving and Toxophily were easy for Ning Que, but the other three like Etiquette, Calligraphy, and Music were torturous.</p><br/><p>He could at least memorize Etiquette and Calligraphy. He believed that he could get through them as long as he possessed a heart that loved grades instead of money.</p><br/><p>However, music was out of his grasp. He was neither good at it, nor did he like it. He could not help but think of Chen Pipi's messages when he troubled over the flute in the study room daily. Chen Pipi had compared him unflatteringly to a dumb piece of wood in those messages, that he was a flute that could not make any sound. Looking at the flute in his hands, he could not help but feel that this must be a limitation that Haotian had placed upon himself.</p><br/><p>If he wanted to graduate from the academy and enter the Second floor, he must not miss any examinations. He had already missed the last semester exam. As there was no hope for Music, so he had to work extra hard for the other five subjects. Other than the pressure of schoolwork, there was another reason for his current misery.</p><br/><p>The students in the Academy including most of those from Classroom Three had thought he had faked illness to skip the exams and was very lazy. While they did not take jibes to him in his face, they were unwilling to speak to him more than what was required of them. They mostly just tried to stay away from him.</p><br/><p>He wasn't that bothered about being left out intentionally. He had never been one to pant after those who ignored him. If he was left out, so be it, he would just study. However, sometimes he felt rather down when he walked alone around the Academy.</p><br/><p>At times like this, he would comfort himself with images of being ignored by other students in his previous life when he received medals for being the best student in his province. As the saying goes, the tree that is the highest will have its branches broken by the wind. The bump in the river will be washed away by the rapids. A person who is of higher caliber will always have to endure gossip. The beam that pokes out will rot first. The fattest pig in the pen…</p><br/><p>Pft! Ning Que spat into the damp grassy ground. He raised his head and ignored the students who were going to ignore him. He held the paper bag in his hand and walked to the old library leisurely.</p><br/><p>He walked to the second floor of the old library and bowed to the female professor. Leaving the paper bag on the table by the west window, he walked to the shelves and scanned at the books on cultivation. Now that he could feel the Breath of nature and was able to win a lot of money from it, he felt regret that the books were still like Greek to him, completely incomprehensible. He could remember the strokes of each character, but not a single word stayed in his brain.</p><br/><p>He held the thick book called Diverse Laws Appreciation Dictionary and sat on the ground under the west windows. He looked at the bright sun shining through the cracks of the windows and began to read lethargically.</p><br/><p>As the seconds ticked by, the sunlight disappeared from the window slits. When he reached the seventeenth page using the Eight Laws of Eternity, the sun had dipped into the horizons completely. Darkness encompassed the old library and yet, he made no move to leave.</p><br/><p>The female professor at the eastern windows had completed her calligraphy of the day. She kept her brushes and inkwell before rolling her wrists gently. She could not help but smile warmly as she watched Ning Que looking at the dictionary dazedly. She did not remind Ning Que that it was late, but left the old library quietly.</p><br/><p>As the night deepened, the symbols on the shelf began to glow. Ning Que was not frightened, but stared at the symbols intently as the glow faded and the symbols returned to its original crude greyish-white state. He watched as the shelf slid away from the wall silently, revealing a chubby lad who was panting heavily.</p><br/><p>Other than the numerous correspondence via messages, this was the second time Ning Que and Chen Pipi met in person. The first time they met, it was late into the night and Ning Que had straddled the fine line between life and death. When he awoke lethargic in the morning, he did not see how the fellow looked like clearly. However, he would not miss the opportunity this time. He opened his eyes wide and looked at him for a long time.</p><br/><p>\"I must say, you really are quite fat.\"</p><br/><p>Ning Que looked at Chen Pipi in admiration. \"I wonder what you've been eating in the past 16 years to get so fat. It's a good thing you're rather solid, so you don't look that disgusting. But there is something I really don't understand. Are you really the first person to score six A plus in the entrance exam in a hundred year? Did you get A plus in Driving as well? Where did they find a horse that can tolerate your weight and run fast at the same time?\"</p><br/><p>Chen Pipi's round face was full of displeasure upon hearing this long disparaging remark upon their meeting. His eyes which looked like beans were filled with annoyance. He huffed, \"Driving… I chose to drive in that exam!\"</p><br/><p>A look of comprehension filled Ning Que's face. He praised Pipi sincerely, \"That was a wise choice.\"</p><br/><p>Chen Pipi held his hands up to his forehead. He couldn't be bothered to continue the conversation and asked directly, \"What did you want to see me for?\"</p><br/><p>Ning Que smiled gently and said, \"Let's talk about those non-important things later. I brought you something to eat.\"</p><br/><p>He dug into the paper bag and brought out several large white buns as well as some other small dishes. He said enthusiastically, \"Let's talk while we eat. The Academy's canteen has got really good salted vegetables. I don't know if you guys get it in the mountains. The buns are a little cold, I don't know if you're used to it or if it'll fill your tummy.\"</p><br/><p>Chen Pipi looked at the food and refused to sit down. \"I know you have something to ask of me, but I really didn't expect you to just bring a few cold buns and salted vegetables. Is this how you beg for help? Shouldn't you at least bring some crab porridge?\" he said incredulously.</p><br/><p>\"You have to pay for the crab roe porridge from the canteen, it isn't included in our dormitory fees. That's such a waste.\" Ning Que smiled and continued to indicate for Chen Pipi to sit down. \"Furthermore, there's no need for us to say such things like begging for help. It's called sharing information.\"</p><br/><p>\"Sharing?\" Chen Pipi looked at him contemptuously. \"With your lowly skills and my genius?\"</p><br/><p>Ning Que did not let his scorn hinder him but continued to wave his hands at Chen Pipi, asking him to take a seat. He answered seriously, \"I just started on the path, but who knows which one of us would end up further? If you're nice to me now, I will be able to reciprocate in the future. There is no loss for you. Furthermore, I can teach you math, why not?\"</p><br/><p>Chen Pipi was somewhat persuaded by Ning Que's words. He sat down with a proud sniff and reached out for a cold bun and some salted vegetables before cramming them into his mouth.</p><br/><p>\"Why do you only move around at night? Isn't it better for us to meet in the day?\" Ning Que said.</p><br/><p>Chen Pipi answered with a mouth full of bun, \"Senior sister Yu stays here all day to write calligraphy. How would I dare come? You have to understand, the Academy bans us from helping students outside of this building. I am risking a beating from the seniors just by leaving you instructions in the message. Shouldn't you be more grateful for this?\"</p><br/><p>\"Am I not treating you to buns right now?\" Ning Que answered with a smile. \"I know that the rules of the Academy are strict. The instructors wave their fists around indiscriminately for no rhyme or reason. Why do I hear that you're more afraid of Second Brother?\"</p><br/><p>Chen Pipi looked at him. He knew that the lad was very curious about the happenings in the mountains behind the Academy. After a cold laugh, he said, \"The cold hard rules of the Academy are practically made of cotton as compared to Second Brother's fists.\"</p><br/><p>The two sixteen year olds ate with much gusto, and before you knew it, the buns and salted vegetables were gone. Chen Pipi found the female professor's water bottle under the east windows and drank from it before rubbing his tummy. He looked at Ning Que and pretended to be nonchalant, saying, \"What do you want to know today? If it is about how you can enter the second story, you might as well forget about it. Teacher might dote on me, but I cannot say anything about things like that.\"</p><br/><p>\"We've known each other for some time now. Do I look like someone who would hanker over a free lunch?\" Ning Que smiled cheekily to hide his disappointment. \"I wanted to ask you, now that I can feel the Breath of nature, what should I do next?\"</p><br/><p>\"You've only just entered the Initial Awareness State. You have to cultivate your heart and stabilize your cultivation. You mustn't be greedy.\" Chen Pipi explained seriously. His brows scrunched suddenly and his right hand which was drawing secretly behind his back froze. He looked into Ning Que's eyes and asked uncertainly, \"You only have 10 open acupoints?\"</p><br/><p>Ning Que answered honestly, \"I tried to look into it yesterday, but the image in my brain was too blurry. The Ocean of Qi and Mountain of Snow looked like two black blobs and I couldn't make out how many points were blocked. I would like for you to help me look today.\"</p><br/><p>Chen Pipi sighed and shook his head. \"No need, you only have ten acupoints. You're straddling on the fine line between being able to cultivate and not. If your willpower was even one notch lower, you will definitely not be able to.\"</p><br/><p>He looked at Ning Que without expression, all the while thing that Ning Que, that fellow, had eaten such precious Heavenly Power Pills. He might not know it himself, but there must definitely be other interesting incidents. He had finally been able to successfully open his acupoints and change his fate, which was a feat by itself, but he had only managed to open 10, and was below average amongst cultivators. It was such a pity.</p><br/><p>Ning Que did not show any disappointment, but had only smiled after freezing up slightly. \"It's better to have 10 than not a single one at all.\"</p><br/><p>\"You don't have to be entirely disappointed. Not everyone who enters the second floor is geniuses at cultivation.\" Chen Pipi felt that he had to comfort Ning Que even more when he didn't display any self-pity. He patted his shoulder and said, \"The teachers don't pick disciples by looking just at their potential for cultivation. If you're able to excel at a certain subject, you might get noticed too. You'd most certainly be able to enter the second floor then.\"</p><br/><p>Ning Que knew that Chen Pipi was trying to comfort him and he smiled gratefully. His gaze landed on the row of shelves behind him subconsciously. He knew that the path to the legendary second story laid behind those shelves. He just didn't know if he'd be lucky enough to pass through it. Or would he have to, as the female professor puts it, pry it open?</p><br/><p>He retracted his gaze and continued asking, \"If the Initial Awareness State is to know the existence of the breath of nature, how do you continue to use it? I can perceive the existence of objects through the breath of nature, but I cannot move them. I am not being greedy, but am just curious.\"</p><br/><p>\"You can perceive the existence of objects?\" Chen Pipi looked at him with wide eyes.</p><br/><p>\"That's right,\" Ning Que held up a finger and listed the objects he felt. \"The first night, I perceived the flames, and then the pillow, paper, bed…and the silver under it, the tree in the courtyard and a bowl of hot and sour noodles.\"</p><br/><p>Chen Pipi's eyes got even wider if it was even possible. He thought to himself, one needed to be in harmony with the Qi of Heaven and Earth as well as be able to communicate with it to perceive objects. But this… could only be done in the Perception State. How did Ning Que manage it?</p><br/><p>...</p><br/><p>...</p><br/>\n</div>"}