{"title": "Chapter 133: If You Hadn't Danced That Year", "id": 133, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-133-if-you-hadnt-danced-that-year", "volume_title": "Volume 2", "body": "<h1>Chapter 133: If You Hadn't Danced That Year</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 133: If You Hadn't Danced That Year</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The dawn light got brighter and brighter. General Xia Hou walked to the eastern front emotionlessly. He was followed by Gu Xi and a team of personal guards who were all silent. The light of rising sun shone on his armor, emitting a faint white luster, which made him look like a mighty statue of God standing in the holy halo.</p><br/><p>After Xia Hou entered the temporary Middle Army Tent and listened to his subordinates' report on the left-wing cavalry's attacking Yan territory this morning, he kept silent for a long time and then looked up to say, \"Kill three hundred Yan prisoners as a penalty.\"</p><br/><p>At this moment, there was no third person in the tent besides himself and Gu Xi. Gu Xi looked at him, bit his lip, and then tried to persuade him not to. \"General, you have decided to keep the assassination as a secret before, only sending a secret letter to his Majesty. If you kill the prisoners of war before the battle, I'm afraid it might be difficult to conceal the incident. Not to mention, those Yans will certainly take the initiative to kick up a fuss over the matter.\"</p><br/><p>Xia Hou said indifferently, \"Yan army entered Tang territory. They violated the old and the weak and burnt their villages. We should kill three hundred Yan prisoners of war as revenge. I'm sure no one dares to object it.\"</p><br/><p>After a moment of silence, Gu Xi said, \"But it's ominous to kill prisoners of war, His Majesty... won't like it.\"</p><br/><p>Xia Hou pulled aside his helmet and quietly watched the loyal subordinate who had accompanied him for more than twenty years and said, \"You should know His Majesty doesn't like me much. I have managed to survive up till now because I have achieved an imeasurable feat for the Empire. The Tang Empire always strictly enforced the rules for reward and punishment. As long as I continue to contribute and the officials in the court don't have any evidence against me, His Majesty won't bother me. So it doesn't really matter whether His Majesty likes me or not. And if His Majesty likes me too much, I really don't know what to do. \"</p><br/><p>Only two of them could understand the hidden meaning in this dialogue, especially in the last sentence. After a moment of silence, Gu Xi was about to say something, but the horizontal embroidery on his cuff suddenly brightened up.</p><br/><p>\"Go ahead.\" Xia Hou said.</p><br/><p>Gu Xi silently bowed with hands folded in front and left the tent.</p><br/><p>In the empty tent, Xia Hou smiled bitterly and self-mockingly. He whispered, \"I' m so lucky to meet such a kind emperor like His Majesty, or I really don't know how many times I'd have died. Gentleman can be bulled by reasonable methods, but is it possible for me to bully His Majesty with benevolence? The emperor just cares about old friendship that was unknown to others, so he allows me to live for these years.\"</p><br/><p>After a short moment, Gu Xi lifted the curtain and walked back. He held a secret letter with fire-lacquered paint in his hand and walked towards Xia Hou. He said softly, \"The Military Ministry has delivered a written letter, saying that it was a bit unsafe in Chang'an these days. There seemed to be a murder in Southern City and it even alerted the Yulin Royal Guards.\"</p><br/><p>Xia Hou said with faint sarcasm, \"The court officials took advantage of his Majesty's kindness and tried to kill my subordinates. They have suffered losses because of Chao Xiaoshu a few days ago. Haven't they learned to behave themselves in front of his Majesty?\"</p><br/><p>\"It really has nothing to do with the court officials.\" Gu Xi shook his head and replied. \"There was a Seethrough state master who died in that murder in Southern City, and that person used to be a former Military Ministryy official. That is how the fuss came about.</p><br/><p>Xia Hou gaze hardened and squinted at him. He said, \"Continue.\"</p><br/><p>\"Do you still remember this person called Yan Suqing, a former Military Clergy Appraiser? Few people know he was a Great Sword Master... \"</p><br/><p>After a pause, Gu Xi looked at the general meaningfullyand continued. \"This person should have received enlightenment and learnt Swordsmanship in Haotian Divine Hall of West-Hill. He was expelled from the Military Ministry due to a certain matter and has followed a tea merchant of Chang'an to dawdle all his days. No one expected his sudden death in the end.\"</p><br/><p>The atmosphere gradually became tense within the tent. The candlelight in the corner flickered with unease. After being quiet for a long time, General Xia Hou asked indifferently, \"In the thirteenth year of Tianqi era... how many people died like him?\"</p><br/><p>Gu Xi softly answered. \"The censor Zhang Yiqi died of a car crash. The former Xuanwei General Chen Zixian suddenly died in Eastern City. With Yan Suqing whose head was cut off, there are three people who died this year.\"</p><br/><p>Tang Empire's folk custom was simple and firm. There was a large population in Chang'an. Although its law and order was excellent, there was one or two unnatural deaths every day. The three people mentioned did not refer to the number of unnatural deaths in the thirteenth year of Tianqi era, but the deaths related to past events.</p><br/><p>\"If Her Majesty hasn't stopped her birthday banquet this year and allocated some free money to the Military Ministry, they wouldn't have thought about searching for the veterans to send consolation money and found that the forgotten Chen Zixian has already died.\"</p><br/><p>Gu Xi looked at Xia Hou and softly said, \"Now Yan Suqing's head has been cut off. The modus operandi is very similar to the former case. If we can make sure the so-called accident of the censor Zhang Yiqi... is also a murder, then we can find the truth.\"</p><br/><p>\"Not everything has its truth.\" General Xia Hou said indifferently, \"Those people in the two cases have already died. And who will remember these things?\"</p><br/><p>Gu Xi replied, \"When the fisherman tosses out his fishing net, he would always think that he could catch all the fish. But in fact every time he pulled the net out, he would always find a few has slipped through the net. On my notes, there are at least eleven people alive from Xuanwei General mansion.\"</p><br/><p>General Xia Hou slowly closed his eyes and said, \"Those who survived were some casual laborers. They were set free according to the laws of Tang Empire. But those servants and maidservants who were bonded for life have all died. I don't believe those casual laborers who had nothing to do with them dare to harbor hatred towards the imperial court and have laid low for many years to wait for revenge.\"</p><br/><p>\"We still need to investigate it.\" Gu Xi said anxiously, \"At least we should send someone to investigate the censor, Zhang Yiqi's death as we have said previously. And I don't believe there are related people left in the two cases. But I'm worried that a certain noble in the imperial court has taken advantage of the series of murders to better his position in court.\"</p><br/><p>Xia Hou said blandly, \"The Princes are still young, and the fourth Princess is nothing but a little girl. If it is His Majesty who wants to bypass the law to deal with me, he would have sent someone to cut my head off ten years ago, there is no need to use those mean methods.\"</p><br/><p>\"But there is another noble in the imperial court.\" Gu Xi glanced at his face and said carefully.</p><br/><p>Upon hearing this remark, Xia Hou's face suddenly went pale and he stared at Gu Xi coldly . \"Twenty years ago, when you swore the oath to follow me, I warned you not to mention that noble in front of anyone as long as I was alive. Have you forgotten?\"</p><br/><p>Gu Xi buried his head deeply in repentance. His heart was filled with weary and he sighed helplessly. He thought to himself, \"General, you don't want to let the world know the relationship between you and the noble. I'm afraid the noble doesn't want to let the world know either. But you chose to get away from Chang'an and keep mum. Who can be sure if the noble would use some more extreme methods? As we all know, we gain a heart of steel upon entering the palace gates...\"</p><br/><p>Xia Hou looked at his repentant subordinate in front of him. He thought of his loyalty and recalled those years where they have arduously crossed the strait by ferry in the rapid rivers. His expression cleared and he said in a low voice, \"But you're right. The murders in Chang'an must be investigated. Dispatch a Psyche Master. \"</p><br/><p>After a brief pause, he added emotionlessly. \"Warn the serviceman. Even if he finds out something, he is forbidden to act on his own. Present all the evidence to the Military Ministry and Chang'an Local Government. The investigation is a matter for the imperial court after all.\"</p><br/><p>Gu Xi accepted the order and left.</p><br/><p>In the empty tent, Xia Hou relieved the heavy armor from his body and then sat on the couch. He silently watched the faint candlelight that would be swallowed by the bright sky outside the tent and kept motionless like a statue.</p><br/><p>His face was a bit pale. His previous thunder-like cry had killed two cultivation masters. It had looked mightly and tough, but no one knew he had been injured from it.</p><br/><p>As a strong man of Peak state of Martial Arts in the world, his power could be considered unparalleled. With a little Psyche Power, there would be vigorous Qi of Heaven and Earth travelling inside and outside his body. Psyche Power could not hurt him, nor could the flying sword. In fact, he could have chosen a simpler and non-destructive method to kill those two cultivation assassins from Yan Kingdom,.</p><br/><p>However, he was General Xia Hou who was known for his ruthlessness, coldbloodedness and brutality. There were too many powerful enemies for him in the world. He must maintain the invincible image in front of enemies and his subordinates. Therefore, he must choose the most arrogant and mighty means as a response, even at the expense of his hurt body and psyche.</p><br/><p>In order to cease the steady stream of assassinations, he needed use arrogant means to forcibly crush most enemies' fighting desire. It was probably what a lot of unworldly sublime beings were forced to do.</p><br/><p>The curtains lifted and a manservant carrying a bowl of well-prepared bird's nest and Chinese date porridge carefully entered. The manservant looked pretty and the refined beautiful porcelain bowl on the plate was obviously not an ordinary object.</p><br/><p>General Xia Hou took the porridge bowl indifferently and drank it. He then waved his hands signalling for the manservant leave.</p><br/><p>He knew that those officials who were jealous of him in Chang'an have been secretly spreading the rumor that General Xia Hou liked pretty manservants and had different kind of sexual taste. He was indifferent to this rumor and was not angry at all. His Majesty and those who truly dreaded him were well aware of the fact that he had not been close to a woman and refused to have any maidservant to serve him ever since he killed his favorite concubine by boiling her to death.</p><br/><p>The incident happened when the censors' attack was the strongest and the general's position was precarious. Those who thought they knew the inside story assumed that he used prying into military secrets as an excuse to use such a cruel mean to kill his favorite concubine to deter a certain eunuch who was ordered to enter the barrack to question him.</p><br/><p>However, only Xia Hou himself knew that, the fact that the eunuch came to question him at that time had nothing to do with the papers of the censors from the imperial court. The things he were afraid of were also unrelated to the censors who did not have enough power.</p><br/><p>It was a summer with short nights and long days. The luster spread by Haotian was not only warm but blazing. Serious questioning letters from the West-Hill Divine Kingdom were handed over to the Chang'an Imperial Palace directly. Even the Unknown Place expressed grave concern. In the vast Min Mountain not far from the the barrack, there were countless vague Taoist and sword lights.</p><br/><p>\"Shuang, you shouldn't have danced the devil dance that day.\"</p><br/><p>Xia Hou stared at the gradually frozen porridge in his hands and thought that the gentle woman he loved most would be the first to notice. He then took out a handkerchief with a smile and gently wiped it off. He could not help but shake his head and repeated expressionlessly. \"You really shouldn't have danced that dance, although... you were really beautiful dancing it.\"</p><br/>\n</div>"}