{"title": "Chapter 132: The Great General As Powerful As Thunder", "id": 132, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-132-the-great-general-as-powerful-as-thunder", "volume_title": "Volume 2", "body": "<h1>Chapter 132: The Great General As Powerful As Thunder</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 132: The Great General As Powerful As Thunder</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The middle-aged Yan citizen didn't see the electrifying gaze from the remote tent. However, as the most powerful psyche master in seclusion at Yan Kingdom, he could sharply capture the changes of Qi of Heaven and Earth and felt an icy air as if it was from the deepest earth was heading towards him, breaking through the air and entering him.</p><br/><p>Frightened by the change, the middle-aged man adjusted his breath and made a move first! His skinny hands made an emblematic gesture in front of his abdomen. Dappled blood spots appeared on his palms like red wintersweet flowers, and psychic power spewed out of his body!</p><br/><p>The air in the far-off tent was affected by this psychic power and suddenly whirled as a storm. The middle-aged general lying in a bed of luxurious furs raised his eyebrows slightly.</p><br/><p>The luxurious furs under his body split and rolled up like living things, and a leather sheet was ripped into ropes by force, wriggling like snakes and instantly binding him downward.</p><br/><p>Although these split furs and leather ropes seemed powerful and horrible, they could not bind the general. What truly worked were the vigorous Qi of Heaven and Earth and the strong invisible psyche power attached to them!</p><br/><p>The young man was a great sword master from Yan Kingdom who had recently achieved fame. He had stepped into the seethrough state when he was barely thirty years old. Being deemed as a cultivation genius, he was naturally proud. The young one knew that they have been found by the enemy when he saw that his partner was terrified as if there was a great enemy in front of him. Considering that their enemy was ruthless and powerful, the young one was serious rather than slight. Raising up his sword-like eyebrows, he bit his tongue, spat out blood on his sword and gestured sword formulas and completely drained his power.</p><br/><p>Slipping out of its sheath, the sword behind him became a silver dragon and pierced through the tent. It split the thick darkness before dawn and stabbed into the middle army tent with shaking light.</p><br/><p>The middle-aged man remained indifferent as he allowed the leather ropes infused with the Qi of Heaven and Earth and the invisible forces of psyche power to bind him as the torn furs danced in the air rapidly. The iron body hidden beneath his clothes showed no sign of fight.</p><br/><p>He stared at the flying sword buzzing in front of him with his furrowed brows and looked at the shadow of the sword flying like a dragon, powerful and untraceable. All of a sudden, his brows relaxed and smiled scornfully.</p><br/><p>The ropes which were powered by Qi of Heaven and Earth and that invisible psyche power tightened around the middle-aged man, splitting them into grids. At this time, the flying sword came one meter of him in a sharpness speed, humming. The sword would stab into his forehead in the next moment. He was in an extremely dangerous situation.</p><br/><p>At this moment, the middle-aged man tightened his mouth, and casually said, \"Attack!\". He wore a bored, disdainful and tired expression.</p><br/><p>The word \"attack\" came out of his mouth easily, clearly but not loud. However, when this voice echoed in the tent, the dark clouds above swirled quickly, enveloping the earth. Then a Haotian thunder cracked in clouds.</p><br/><p>Boom!</p><br/><p>Nobody could figure out where the thunder came from. Was it from the clouds or the mouth of the disinterested man? After the thunder, a roar resounded all the middle army tent of Tang. A powerful breath which was too strong to resist enveloped the camp.</p><br/><p>The flying sword that had broken into the middle army tent suddenly quivered as if had been hit by an invisible giant hammer. Quivering and whining, the flying sword struggled to escape. Unfortunately, the eyes of the man were like lightning and his words were like thunder. Is there anything faster and stronger than thunder in the world?</p><br/><p>Crack! The former silver-dragon sword was shattered into a hundred brittle pieces, splattering everywhere. No one knew where these pieces went.</p><br/><p>The waving luxurious furs were ripped into pieces and seemed to be fixed, floating in the air in silence. The ropes that had bounded the middle-aged man tightly were like snakes chopped by sharp knives, dropping down onto the ground lifelessly. They could no longer control him!</p><br/><p>Yet this thunder, from clouds and the man's lips, didn't come to an end. Instead, it thundered through the tent, and released an unparalleled power once more. The grand and firm middle army tent exploded, like a wineskin filled with too much wine, then numerous tent debris mixed with items flew out!</p><br/><p>In the next moment, a small tent near the middle army tent was overturned and blasted into pieces. Tang bodyguards in it were awakened, rubbing their eyes, helplessly staring at the vast sky. They have yet to figure out what had happened and were frightened by a horrible explosion and sprawled on the ground subconsciously.</p><br/><p>Tents of Tang army were blown up into the air one by one, like flowers sprouting at the frontier. A straight crack appeared southwards from the ruined middle army tent. No matter tents or stables, where the crack passed, they collapsed in a minute. But it was amazing that neither soldiers nor horses were injured.</p><br/><p>All of sudden, the booming power came to the end of the crack where the two people from Yan Kingdom were hidden. Bearing the power, the middle-aged one knew that they had no chance of escape. He glanced at his young partner who was shivering with pity subconsciously before he shook his head slightly.</p><br/><p>A fierce gale sprang up and the small tent was pulled apart in a breath.</p><br/><p>The cervical spine of the middle-aged one was broken with a click. His head shook off his body, then, like a ripe watermelon, fell into the ground and exploded, leaving a body filled with fear pitching forward and splashing blood everywhere.</p><br/><p>The desperate eyes of the powerful young one who was in a seethrough state spurted blood. Then his whole body withered like a sand sculpture blown down by wind, becoming a horrible pool of flesh and blood.</p><br/><p>...</p><br/><p>...</p><br/><p>An alarm bell rang hurridly. Frontier soldiers of Tang quickly responded and strengthened the defense of their camp. The left-wing cavalry started to prepare their knives and horses, marching toward Yan territory with a poker face. But at the center of the camp everything kept in order. Heavily armed generals and bodyguards patrolled the ruins, searching for the enemies.</p><br/><p>All of a sudden, no matter the bodyguards who were searching for enemies, the soldiers who were cleaning rubble, or those grooms who were comforting startled horses, everyone all stopped almost at the same time. Standing straight at where they were, they put their right hand on the chest and saluted in awe. \"General Xia Hou!\"</p><br/><p>There were calm steps. The middle-aged man walked over indifferently. He was wearing a shiny suit of armour. Some indescribable talisman inscriptions with certain meanings on the armour could be seen faintly. These talisman inscriptions in black didn't dilute the coldness, but added a bit more power.</p><br/><p>He was one of the top four generals in Great Tang military.</p><br/><p>He was... great general Xia Hou who controlled the whole army.</p><br/><p>General Xia Hou ranked first in martial arts as a cultivator in the world. His body was as strong as steel. Besides his indifferent expression, he had brutal rules in managing his troops and was fierce and fearless. Over the past twenty four years, he had been unbeatable in North China. Gaining territory for the Emperor and defeating the enemy, he had a high position in the imperial court and was respected by subordinates. Yet in the hearts of Yan people who suffered great pain because of him, he was a devil on earth.</p><br/><p>The military intelligence tent which was torn into pieces had already become a ruin. Subordinate officers cleaned up at their fastest speed and surrounded it with warning tape, waiting for general's inspection respectfully.</p><br/><p>Looking at the beheaded body of the psyche master, Xia Hou said after a moment of silence. \"Twenty four years ago, you were a commander of a pioneer camp and suffered a disastrous defeat by me. You were frightened and escaped because of shame. I heard you have been hiding in West Yan these years and never expected that you would have the courage to kill me years later. \"</p><br/><p>Finishing these words, he looked down at the pool of flesh and blood without expression. He sniffed at it and said, \"You actually dared to try to kill me as a little sword master in a seethrough state. You were looking for death.\"</p><br/><p>At this time, a middle-aged man walked up calmly. Wearing civilian clothes, the man saluted to the general and then presented several broken objects respectfully. He said, \"Barracks found out that there was nothing wrong with defense. These two assassinaotors could implement their lunatic plan and infiltrate the military camp without any problems because they brought with them seal documents issued by military ministry.\"</p><br/><p>Hearing this infromation, Xia Hou silently stared at this man's eyes and didn't speak for a long time.</p><br/><p>Other subordinates would be trembled beneath his calm gaze and kneel down to beg for forgiveness without knowing the reason. But this man was different. This man named Gu Xi. No one knew where he came from, but they knew that he was good at strategy and dealt with private business for Xia Hou. He was Xia Hou's most trusted man. Meeting his gaze without fear, Gu Xi said peacefully, \"It doesn't mean anything even though the document came from the military ministry of Chang'an\"</p><br/><p>Gu Xi knew that the last thing the general wanted to hear was that this assassination was connected to Chang'an city. What's more, there was no evidence to prove it. So he answered very surely.</p><br/><p>General moved his gaze away from Gu Xi and didn't bring up any topics related to Chang'an military. He held his hands behind his back and looked at the twilight in silence for a long time. Then he narrowed his eyes and said with no emotion, \"They found a psyche master who harboured resentment against me most of his life and a young sword master who was cocky, arrogant and self-opinionated enough to assassinate me. It seems that some Yan people don't want that crown prince to return.\"</p><br/><p>This time, Yan Kingdom had sent a genius great sword master and a secluded psyche master to assassinate him. It seemed that they have paid a heavy price and spent all their energy and expectations on it. And the situation was indeed very dangerous. Nevertheless, compared to the general's unparalleled martial, this assassination was more like a desperate death trip.</p><br/><p>Hearing the seemingly illogical analysis, Gu Xi praised, \"General, you are indeed wise. It is the right year that the Crown Prince returns to Yan Kingdom. No matter the assassin succeeds or fails, his majesty will burst into rage. If you submit a written statement, I am afraid that the Crown Prince will have to continue staying in Chang'an city. \"</p><br/><p>Xia Hou said without emotion, \"I will never let their wish fulfilled. Give orders to all officials that they are not to mention this assassination. Later, I will write a secret letter myself to explain the whole thing to His Majesty. The Yans wish to keep Prince Long Qing at Chang'an to restore their national power. They are daydreaming! \"</p><br/><p>\"Maybe Prince Long Qing himself dosen't want to stay at the Yan Kingdom either.\" Thinking of the information sent by military ministry the other day, Gu Xi said with a smile, \"He can go to the second floor of the Academy to study with the headmaster of Academy. It's better than being a back up prince. \"</p><br/>\n</div>"}