{"title": "Chapter 130: A Young Man Faded into Oblivion in the Academy", "id": 130, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-130-a-young-man-faded-into-oblivion-in-the-academy", "volume_title": "Volume 2", "body": "<h1>Chapter 130: A Young Man Faded into Oblivion in the Academy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 130: A Young Man Faded into Oblivion in the Academy</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Following the Second Brother across the slate ground, along a trail up the mountain wreathed in mist, Chen Pipi took a while to digest the shocking news and couldn't help going back to the original question.</p><br/><p>\"Second Brother spent fifteen days to clear the three States. I took seventeen days, and it took merely fourteen or fifteen days for Ning Que. Could he already be at the same level as us? Or was it that he contemplated and accumulated the Psyche Power ever since he was born, and that now he reversed his destiny and all the Psyche Power gushed out and helped him break through three States at once? If we counted from his birthday, it was nearly the same for Ning Que as for the second brother who had put in 16-17 years to step into No Doubts State. Then, it should not be a big deal, right?\"</p><br/><p>The words came out from Ning Que the other day in old library\"No one can be sure who will stay longer on this road.\"Upon recalling the secret competition between Eldest Brother, Second Brother, Ning Que and himself, Chen Pipi shuddered to think that the idiot might overtake him some day, his large figure trembled slightly.</p><br/><p>\"Among the seventeen Qi orifices of Ocean of Qi and Mountain of Snow, Ning Que had got through ten of them. Even though his built-up Psyche Power of sixteen years was pure and strong, it was highly probable that an out-of-tone tune was all he could do. Without access to Knowing Destiny State, Ning Que could only manage to pull some shoddy tricks or pilfer some silver due to his inconsistent and unstable breath of nature, even at the pinnacle of Seethrough State. I am a real deal, no doubt. There is no way he could catch up with me.\"</p><br/><p>\"Alas, the poor Ning Que! Though you have been introduced to the road of cultivation, you would still be easily pushed around given your frail physique and breath of nature.\"</p><br/><p>After perusing this, Chen Pipi felt relieved and thought he'd better give the lad a heads-up, lest he might pride himself on being some gifted man and go around to show off, then get beaten up someday by real ones.</p><br/><p>Arriving at the residence, the Second Brother asked suddenly before heading off, \"Only fourteen days?\"</p><br/><p>Chen Pipi looked down at his fingers, counting earnestly himself, and recollected the night when he saw Ning Que severely wounded. Chen Pipi was not sure that his orifices were got through at that time or after taking Heavenly Power Pill, as it simply pivoted when he reshaped the Snow Mountain. Chen Pipi looked up and said in a reverent manner, \"It could be fourteen or fifteen days, or maybe fifteen and a half if he woke in the morning.\"</p><br/><p>Staring into his eyes solemnly, Second Brother answered, \"Younger Brother, a man living in the world should conduct himself rigorously. Precision is a necessity for philosophy of life, that is, one is one and two is two, and your answer is vague and imprecise. You go and find out how long exactly he spent on reaching the third States. This is a test for you.\"</p><br/><p>After his long preach, Second Brother crammed both his thumbs in his golden silk waistband, strode forward in a triumphant and solemn fashion. A few faint words wafted in the night air.</p><br/><p>\"Like I said … it can't be fourteen days.\"</p><br/><p>…</p><br/><p>…</p><br/><p>Though the Article on the Response of the Tao was learnt by heart; contemplation was executed all the time during the stay in City of Wei; conversations were exchanged with Lv Qingchen along the journey, chats and talks with Chen Pipi were made in the old library, Ning Que had a little knowledge of the world of cultivation whatsoever, nor did he understand why he could cultivate all of sudden, let alone he was conscious of which State he was in so far, in short, largely ignorant of the theories and the practicals.</p><br/><p>He was not aware that his speed of improvement had troubled Chen Pipi and the Second Brother, and thought perception of breath of nature and outside world was a natural course of cultivation. Hence, it was nothing special, as he felt it was the same as those cultivators who practiced in mountains, Buddhist and Taoist temples.</p><br/><p>The Academy life and attitudes from peers gave him a hint. As the days went by, the aftershock of his sick leave in the semester exam had abated, and it started to be felt. No one continued to secretly point fingers or glanced at him from corners or by windows, as a matter of fact, no one cared about his existence ever since.</p><br/><p>Presently, he didn't attend lessons in Toxology, Driving, Mathematics or Music, the first three were unnecessary for him, and the last one was useless for him. Without semester exams, there was no chance for him to correct the early slander or reclaim his reputation.</p><br/><p>The Academy was one singular body, in that case, collective awareness could be both blindfolded and manipulated. Though students would not mock or scorn at you in your face, gossip never ceased behind your back, and suddenly came to a halt when you neared. Of course, Ning Que was never invited to any parties, and a growing intangible estrangement formed between them and Ning Que.</p><br/><p>The estrangement made those who believed in him in the first place gradually drift away from him, conforming to the collective consciousness. Chu Youxian treated his as usual though, Ning Que's prolonged stay in old library and Chu's frequent absence from lessons led to decreasing contact between them, despite Chu Youxian's consistent attitudes towards him. As for Situ Yilan, she knew that his majesty appreciated Ning Que and that Ning Que's sick leave was no escape, yet she couldn't bring herself to stand up for him in such atmosphere.</p><br/><p>Ning Que's temperament would not allow him to beg for friends. On account of having no company, he leave quickly to take away lunch as soon as the bell rang and tour around pond to the old library. Consequently, there was much less time he spent with his classmates, and they drifted away even further.</p><br/><p>In the course of time, Ning Que, the fortress soldier who once scored three Grade As in the Academy Entry Examination, the assiduous student who made Xie Chengyun spit blood, the handsome lad who earned his name at the House of Red Sleeves, gradually faded into oblivion, and became a long forgotten student in the Academy.</p><br/><p>The recent trends among young students in the Academy were something like —— a fine paper written by Wang Ying from Lin Chuan, a beautiful poem composed by Zhong Dajun, the achievement of Perception State by Chen Simiao, a student recommended by the Military institute who resided in Grade B dormitory beat an instructor in a class of Toxology, Miss Situ reprimanded Chu Zhongtian again …</p><br/><p>Xie Chengyun, an outstanding gifted young man from South Jin kingdom, remained popular in the limelight of the Academy. Two hot topics followed since he obtained five Grade As in semester examination: one was that he was seen cuddled with Jin Wucai, the granddaughter of Old Chancellor. The other was he finally broke the Perception State, and proceeded into No Doubts State. The instructor Cao Zhifeng had a look at his improvement, and commented that it was highly likely that he could enter into the Second Floor next Spring.</p><br/><p>Time went by quietly and quickly, a sudden cool breeze blew off some yellowish leaves from branches, ushering in the Autumn.</p><br/><p>Ning Que in his autumn academic uniform walked out of dining hall, towards the old library, with a bowed head along the way. Before he stepped onto a lane cut across all buildings to the wetland, a group of people came into view, and a handsome male student seemed to be their leader.</p><br/><p>It dawned upon Ning Que that the student's name was Chang Zhengming, who was from the Yulin Royal Guards, he had been recommended bt the Military Ministry just like himself. He heard from his peers' occasional talks that it was this young man that shot ten successive gold rings, and even defeated an instructor once. He was a rising star in the Academy.</p><br/><p>Ning Que thought it had nothing to do with him anyway, and was about to take a detour. Unexpectedly, Chang Zhengming suddenly addressed him in low voice, \"Ning Que, we are all recommended by the military. Are you planning to continue idling away? Submission without a fight is not something a man from the Tang military should do.\"</p><br/><p>Ning Que came to a halt, turned back and said smilingly, \"Though we were students recommended by the military, we are now here, and no longer military. It is best not to claim ourselves as Tang military. As for submission or idling away, I have nothing to comment since this is just what you think and has nothing to do with me.\"</p><br/><p>Chang Zhengming frowned, and said, \"If you want to prove yourself, then you ought not to give up opportunities. Should you take lessons in Toxology, I'll give you a chance to challenge me.\"</p><br/><p>\"Is this charity?\" Ning Que looked at him, shaking his head and said, \"It seems that you have no idea what I said the other day in the study room. Let me be clear, I am no delicate flower in a greenhouse. There is no need for gentle breeze nor special care to prove my perseverance and capability. While you were with Yulin Royal Guards, I was stationed at the fortress, my merits and chopped heads were all on the military records. I believe other things are not necessary to prove myself.\"</p><br/><p>Finishing this, he turned around and left.</p><br/><p>Chang Zhengming was far from cheerful as before as he gazed at the retreating figure. Ning Que's absence of semester exams on pretext of sickness made those students from military ministry feel rather shamed. As a tradition, Tang military prided their glory more than anything. Chang Zhengming, therefore, couldn't figure out what was Ning Que thinking about.</p><br/><p>Out of the lane to one side of wetland, Ning Que came to notice that there were two female student giggling nearby the lake. One with slender figure laughed absentmindedly, and he could discern some sorrowful and admiring looks in her eyes.</p><br/><p>Chu Youxian once told him that the girl's uncle served in the royal court, which meant that no one dared to offend her. As such, he wondered where her blues came from.</p><br/><p>Following their eyes across the serene lake, frolicking ducks and soft meadow, Ning Que saw a young man and woman standing shoulder by shoulder. The handsome man and the beautiful woman, were Xie Chengyun and Jin Wucai. The two seemed to be enjoying themselves. A soft waft lifted their billowing clothes slightly, making them almost look like a pair of god and goddess. It was a treat for the eyes indeed.</p><br/><p>Ning Que watched the admirable couple, the jealous young girl looking from afar, the picturesque lake and students around the lake quietly. He smiled, shook his head, and left. left.</p><br/><p>He was growing calmer and more composed these days, deliberately dismissive of exclusion and scorn from his peers. He found himself even taking a liking to this tranquility since something fundamentally changed in his mentality. He was not who he was before.</p><br/><p>On the road of cultivation, after all the trials and tribulations, a broader and wider world now presented itself in front him in comparison with one where he used to live. Fondness, hatred and envy, these emotions on the earthy plains havd become plain to him. Being on the path of cultivation, he was confident that he could go far on the path. Those hidden towers, misty mountains and formidable enemies would eventually become the ornamental landscape to his road. Since this is so, why not calm down and carry on?</p><br/><p>There was no shortage of beauty, nor the eyes to find beauty. As long as you are level-headed, beauty would come easily. The lake, the couple, the Academy and all these were beautiful in Ning Que's eyes, even Xie Chengyun was. The scenery of the Academy was beautiful despite the fact that he was all but forgotten by the Academy.</p><br/><p>Due to the exclusion from peers, Ning Que kept himself busy with reading and cultivating in the old library. He strolled alone through the academy. While this may seem forlorn in others' eyes, he was the only one who knew how great the academy was when you savour it alone, especially the places that only he knew of.</p><br/><p>Along the path by the wetlands, there was trail near the old library leading to the mountain. Behind a row of lush old trees, Ning Que found a large carpet of uncharted meadow, in which a forest of unknown trees towered, tall and straight. Most trunks were free of branches, probably due to strong gales. Only a few twigs and branches sat at the top. The hundreds of tall trees stood closely, leaving an impression of countless wooden swords thrusted in the meadow upside down, serried and grand.</p><br/><p>Casually walking among these trees, Ning Que sat under one of them and leaned against the trunk. He took out his notes and started reading the first part of A Brief Introduction on Five Clutivation States . Not long ago, he finally managed to avail himself of Eight Strokes Calligraphy of Yong to recombine the books of old library, and learned them all by heart. The note was one of the copies he made for himself through sheer memory.</p><br/><p>The woods were quite far from the Academy, separated from the wetland by two stretches of meadow and known to few people. Ning Que, therefore, was not concerned that someone might see what he was reading. He buried himself in the notes and murmured to himself, \"I can now lift paper, move candlelight and silvers with willpower, then does it mean I am in the No Doubts State? If so, why were those students so excited when Xie Chengyun broke into No Doubts State?\"</p><br/><p>A soothing and soft voice flowed behind him, \"Xie Chengyun was not twenty years old yet, so his entrance into No Doubts State was considerably difficult for him. It was justifiable for them to cheer for him. As for your strange experience, Pipi was a kind-hearted child and willing to help you, so your entrance is a matter of fact.\"</p><br/><p>Startled, Ning Que recollected himself after recognizing the voice. He stood up swiftly and dusted grass off clothes, bowing to the female professor standing behind him by the tree. \"So it is you.\"</p><br/><p>The female professor walked around from the tree. She had a delicate figure and kind countenance, yet an air of maturity and gentleness could be felt. Her appearance and demeanor was not helpful in guessing her age, which gave her a charmingly mysteriuos air.</p><br/><p>She looked at the lad and sighed, \"I have been practicing regular script for about twenty years in the old library and you are the only intruder to my seclusion. This Unyielding Sword Woods was my favorite spot in the Academy, and here you are, What a pain in the neck!\"</p><br/><p>Ning Que looked at the female professor whoes name he still did not know despite having known for half of year. His eyes brightened suddenly.</p><br/><p>\"Do not presume that every encounter was by chance.\"</p><br/><p>The female professor smiled and said, \"I will not teach you. If I were to do so some day, you don't need to ask.\"</p><br/>\n</div>"}