{"title": "Chapter 131: A Tranquil and Chill Autumn", "id": 131, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-131-a-tranquil-and-chill-autumn", "volume_title": "Volume 2", "body": "<h1>Chapter 131: A Tranquil and Chill Autumn</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 131: A Tranquil and Chill Autumn</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Ning Que scratched his head and gave her an embarrassed grin, knowing the female professor saw through his intentions.</p><br/><p>The female professor smiled and said, \" There is no need to avoid me, I'm here just for a casual stroll.\"</p><br/><p>Ning Que picked up the topic, asking reverently, \"May I ask why you are fond of these woods, professor?\"</p><br/><p>There was a short pause. The female professor, with her hands behind back, lifted her head and observed the autumn leaves for a moment before answering calmly. \"Years ago, someone used to practice Tao enlightenment in this Sword Woods. That person was the one and only I truly admired in the Academy. I thought his scent might still linger here, and every time I came here, I felt quite gay. \"</p><br/><p>\"The one and only you truly admired?\" asked Ning Que, confusedly. \"Was it the headmaster who practiced Tao enlightenment here?\"</p><br/><p>The female professor smiled without saying anything.</p><br/><p>Ning Que watched the slender figure with hands behind back looking up at the sky with an air of grandeur around her. He scratched his head and said, \"Should the master you admired still be here, you two might become friends.\"</p><br/><p>The female professor shook her head, said softly, \"Should we meet, I would like to try his sword energy and see for myself if it was really that majestic and unparalleled.\"</p><br/><p>Ning Que thought of the book on Haoran Sword in the old library, which remained an enigma to him when he heard the words \"sword energy\".</p><br/><p>\"There is a real spirit in this woods, if you can observe and interpret it, then don't waste it, and have a closer look.\"</p><br/><p>The female professor turned around, shot him a glance and said, \"Though cultivators do not deign to contend with common people, you should not indulge yourself overly in this simple life of reading books and enjoying the scenery. After all, how could one achieve his ambition if they were too unambitious? Tang students of your class will all go to the frontier fortress to gain some experience next autumn. You ought to lay the groundwork firmly this year, otherwise wouldn't it be a pity to die in battlefields? \"</p><br/><p>Ning Que made bowed wholeheartedly for her enlightening words, and noticed the word she used. He asked curiously, \"Teacher, are you not from the Tang empire?\"</p><br/><p>Shaking her head slightly, the female professor resumed her gentle steps out of the woods.</p><br/><p>Ning Que gazed at her beautifully retreating figure, and inquired, \"Professor, as your student, I do not know your name yet.\"</p><br/><p>\"My name is Yu Lian.\"</p><br/><p>Yu Lian? Ning Que thought to himself, \"What an average name, it even sounds a bit tacky! How could a female professor have such a name?\" Suddenly, the old question resurfaced in his mind, and he braced himself to ask loudly, \"Professor, could you reveal your age?\"</p><br/><p>The corner of Yu Lian's lip curled up, but she didn't stop or turn around. Her soft voice wafted through the woods as she said, \"If I recall rightly, it is not polite to inquire about a woman's age.\"</p><br/><p>Watching her disappearing figure, Ning Que mocked himself, \"Why would I be interested if you didn't look like a sixteen-year-old girl by all outward appearance and yet exude a mature air of thirty-year-old woman?\"</p><br/><p>…</p><br/><p>…</p><br/><p>It was a clear and crisp Autumn. The skies were high and littered with white clouds. The forest was filled with red-tinged leaves like rouge on a girl’s face, and the thawing frost cleansed dusty hearts at every corner of the world. In the Academy, Ning Que studied and practiced cultivation as usual and was less anxious than before. Slowly immersing himself in the world of cultivation, Ning Que patiently went to great lengths to concentrate his willpower by establishing contact with candlelight, paper and silver over and over again. However, he was not in a hurry to find his Natal Item. Sometimes, he would converse casually with Chu Youxian, discuss math questions with Situ Yilan in an inconspicuous corner, banter with Chen Pipi through letters, or chat with him directly by over two bowls of crab spawn porridge at midnight.</p><br/><p>There was no more hatred and no more blood. Studying and waiting became Ning Que's life. He awaited the day when his strength improved, his enemies drop their guards and grew weary. He awaited the winter in autumn. After winter came spring and that was when the Second Floor admitted new blood. And next autumn, he will return to the frontier fortress.</p><br/><p>Ning Que finally had time to lead a life of his own and not merely struggle to survive ever since he picked up his sword and chopped off heads at four years old. When he reminisced upon his life later, his time in the Academy was one of the most peaceful and blissful period of his life other than when he was without the company of Sangsang.</p><br/><p>The borders of Tang and Yan Kingdom embraced Autumn as well, nonetheless, the stationed troops of both kingdom in the valley did not appreciate its scenery and tranquility. While major war had not broken out for years, to be stationed at distant frontier itself was not an easy mission. The borders were situated in the north and temperatures dropped as autumn came. The masses all resorted to blowing on their numb hands and rubbing them together, leaving no mood for enjoying autumn.</p><br/><p>At near dawn, two men dressed in Yan clothes crossed the border and walked into the Tang military camp. This was the most fortified military forces of Tang, and was also the place where Defender-general of the State camped. As such, the inspection for those who enter was extremely rigorous and thorough. The two men produced a secret seal issued by the Military and successfully passed through all the checks after a long time.</p><br/><p>Waking into a tent where the Information Agency temporarily camped, the younger of the two turned around and stole a glance quickly at the nearby grand Middle Army Tent. As his gaze landed on the waving military flag, a cold look flashed through his eyes.</p><br/><p>After entering the tent and making sure that no one was listening in, the middle-aged man stared at his company coldly. He reprimanded in low voice, \"It cost our court an arm and a leg to obtain the secret seal from the Military in Chang’an. We cannot afford any mistake in today's assassination. Precaution is everything. You should not have looked there just now.\"</p><br/><p>The younger Yan soldier was full of indignation, and said, \"It is just a butcher. As if my faraway glance would alert him that there was an imminent assassination.\"</p><br/><p>\"You have no idea that how many want that butcher dead. And yet he is still alive and kicking.\" The middle-aged Yan man stared at him coldly and said, \"The distance from here to the Middle Army Tent was meticulously calculated by the Privy Council, and was good enough to start a sneak raid. However, did it ever occur to you that he would also be aware of our existence from there.\"</p><br/><p>\"There is no need to be overcautious.\" The younger one complained disobediently.</p><br/><p>At that moment, the middle-aged man's face changed dramatically as he looking outside of the tent incredulously.</p><br/><p>…</p><br/><p>…</p><br/><p>Though it was not far from the capital of Liang Zhou state, no one dared to return to the capital for a rest due to the rigorous rules of the Tang military. The border between Yan and Tang was even more strictly watched. The military took the opportunity before winter dawned to put pressure on their enemy country. As such, no soldier dared to return to the city without permission. Tens of thousands of troops camped here like an endless ocean. Amongst the military flags topping the tents of the campsites which looked like little hills, the flag on the Middle Army Tent flew the highest.</p><br/><p>Outside the Middle Army Tent, no patrolling soldiers were visible. It was as quiet as back gardens of the royal family. Inside, the light was dim. A kerosene lamp hung from the tent top, lightening up a bed with expensive furs spread out on it.</p><br/><p>A middle-aged man attired a plain-looking undergarment laid on the expensive furs lying. He had thick eyebrows like black worms, red lips as if had been drinking blood and had a strong-built body visible beneath his thin clothes. Even though he was in a sound sleep, an aura of death could still be felt.</p><br/><p>As if he could feel that something amiss, the middle-aged man opened his eye and looked outside the tent. While he remained straight-faced, the glare in his eyes was electrifying.</p><br/><p>…</p><br/><p>…</p><br/><p>-</p><br/>\n</div>"}