{"title": "Chapter 161: The View in the Spring Morning", "id": 161, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-161-the-view-in-the-spring-morning", "volume_title": "Volume 2", "body": "<h1>Chapter 161: The View in the Spring Morning</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 161: The View in the Spring Morning</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Yan Se was so mad that his entire body was trembling with rage. However, he had not had the chance to react before he heard another voice.</p><br/><p>\"Oh, I was wrong. Both you and Li Qingshan do dare to complain. Only children who complain will get milk to drink. Your trouble now is that you don't know which side of the breast to drink from.\"</p><br/><p>Yan Se was startled by his words. He did not know whether to laugh or cry and angrily said, \"Why must you be so crass?\"</p><br/><p>Second Brother turned around and looked at him calmly. \"Both shit and pee are natural. As long as the reasoning is sound, why you care about the vocabulary used?\"</p><br/><p>Yan Se nodded frantically and looked uprighteous for a moment, and not like someone who was uneducated. He sighed and said, \"Jun Mo, oh Jun Mo, how do you want people to view you? I really don't understand how someone as proud as you are could live for so many years.\"</p><br/><p>Second Brother smiled slightly and placed his hands behind his back and stood behind the cliff, looking at the curling clouds. He replied, \"I rarely leave the mountain and I don't annoy those I cannot afford to, not that there are many. The rare few who can annoy me dare not ascend the mountain to do so. This is why I can live as I am. As for you, you will never be someone I cannot afford to annoy unless you outlive me for a couple of decades. No matter abilities, state or seniority, which one can you surpass me in? That is why I can be prideful in front of you.\"</p><br/><p>\"Don't you understand what it means to be respectful of the elderly and the wise?\" Yan Se rubbed his sleeves angrily.</p><br/><p>\"If someone who has managed to live for a long time deserves respect, wouldn't I have bashed my forehead in kowtowing to everyone as a child? There is logic behind being respectful to the elderly and wise, but you, Yan Se, which part of you is wise?\"</p><br/><p>Second Brother looked at the Divine Talisman Master's wizened face with some scorn and exasperation. He coldly said, \"If you were not so stupid to swear your entrance into the path of calligraphy using the Chunyang oath, would you be stuck in the Knowing Destiny state and be unable to move forward?\"</p><br/><p>The words along with Second Brother's pitying tone pierced directly Master Yan Se's heart. He waved his sleeves around crazily and shouted, \"I may not have been able to move forward, but it's not like you did either!\"</p><br/><p>Second Brother raised his head to look at the heavens. He said, \"You are old and your body is weak. You don't have many more years to go. Unlike you, I have felt and know that I may still have a chance. I will definitely be able to move forward.\"</p><br/><p>Yan Se paused. He thought of something and then, smiled sinisterly. \"Rumor is that Liu Bai from the South Jin Kingdom made the first step forward and had managed to enter the turbid waves of the Huang River. When will you ever make it to the clouds?\"</p><br/><p>Second Brother's expression changed upon hearing Liu Bai's name. He did not raise his guard though, but said excitedly, \"He was a genius and was also a disciple of the Headmaster of the Academy. If he didn't make that step, wouldn't he be ashamed of himself?\"</p><br/><p>Yan Se was speechless. There really was nothing he could do if even Liu Bai, the strongest cultivator in the world, could not make a dent in his pride and confidence. There was a silent pause before he asked, \"What about... Ye Su?\"</p><br/><p>Second Brother's brows furrowed and a look of hate spread on his face. They were talking about Yan Se, but how dare he compare himself to someone who was as useless as a pile of firewood. How ludicrous.</p><br/><p>Yan Se took a deep breath and thought to himself, \"Are you not going to care about the World Wayfarer now?\"</p><br/><p>He continued aloud, \"What do you think of the other two? How are their chances?\"</p><br/><p>Second Brother looked at the Divine Talisman Master and felt that his questions were getting stupider and refused to answer. He replied, \"Stop talking nonsense. Are you more interested in finding a successor or does the Southern Gates need another Divine Talisman Master?\"</p><br/><p>Master Yan Se asked bewilderedly, \"What is the difference?\"</p><br/><p>Second Brother remained silent, waiting for Yan Se to think for himself.</p><br/><p>Yan Se suddenly comprehended the hidden meaning in his words, and did not hesitate to say, \"Of course we want both!\"</p><br/><p>Second Brother tilted his head and looked at him. After a pregnant pause, he said, \"You really think so, don't you?\"</p><br/><p>Yan Se asked with knitted brows, \"What do you mean?\"</p><br/><p>Second Brother shook his head and lamented, \"You really think so, don't you, dream on.\"</p><br/><p>Yan Se was speechless.</p><br/><p>Second Brother looked at him and said, \"I've already taken a step back. If you insist on taking two steps forward, we might just as well fall off the cliff together. We can see who survives then. If I do, I will let it go, if I die, you can do what you like. I think my solution is pretty simple, what do you think?\"</p><br/><p>Yan Se could not be bothered, he said, \"I am a man of the Talisman Taoism. If you don't allow me to prepare, I will, of course, be flattened when I fall. You'll survive when you release the magic on the mountain. How could you come up with such a cruel solution.\"</p><br/><p>\"The choice is simple. Why do you hesitate for so long?\" Second Brother waved his hand and said, \"From what I see, having a successor is more important. When you die, there will be no one to send you off on your deathbed. Wouldn't it be a pity to turn into ashes after a lifetime devoted to the Talisman Taoism? As for the Southern Gates of Haotian, they won't need a Divine Talisman Master as long as the Tang Empire doesn't fall and the priests of West-Hill do not preach within our lands.\"</p><br/><p>He continued, \"I can decide on behalf of the Academy. As long as you do not pressure Ning Que to enter Hoatian Taoism when he enters the Second floor, you may teach him your rubbish talisman.\"</p><br/><p>Yan Se said angrily, \"They are Divine Talismans, not rubbish talismans! Jun Mo, don't you dare be so high and mighty. I can just let it go if the Headmaster says so, but you are just a student of the Academy, how dare you...\"</p><br/><p>He did not even manage to finish his rant when Second Brother glared at him and waved for him to stop. He said, \"Just tell me if you want it or not. If you weren't the first to realize Ning Que's potential, we wouldn't even give you this opportunity. Do you really think the Academy cannot find any other Divine Talisman Masters?\"</p><br/><p>The conclusion of all debates ended not on one's ability to talk, but their true capabilities. With a simple statement, the Academy's capabilities were displayed and Yan Se withered like a leaf in autumn.</p><br/><p>Yan Se finally made a decision after a lengthy struggle. He looked down at the clouds beneath the cliff and the distant City of Chang'an and sighed in his heart, \"I've let you down, junior.\"</p><br/><p>...</p><br/><p>...</p><br/><p>In a certain room within the Academy, Prince Lee Peiyan was working on a certain somebody's education. No matter which teachings of great sages he used, Ning Que would only give one standard reply.</p><br/><p>Ning Que looked at Lee Peiyan and smiled earnestly. \" I am a student of the Academy, I obey the instructions of the Academy.\"</p><br/><p>The smile on Lee Peiyan's face gradually disappeared. He looked at Ning Que coldly and said blandly, \"Very well.\"</p><br/><p>Ning Que seemed not to have noticed the change in Lee Peiyan but smiled politely, \"Your Highness, you have honored me.\"</p><br/><p>Lee Peiyan pushed open the door angrily. If Ning Que was allowed onto the Second floor, what were they going to do with Prince Long Qing? If his royal brother found out about this, would he blame him for not doing his job well? How would the court answer to the West-Hill Divine Kingdom?</p><br/><p>His face turned even darker as he thought about this. He looked at the official beside him and asked hopefully, \"What did the Academy say? This is a win-win situation for us all, I don't think they'd think otherwise?\"</p><br/><p>The official smiled bitterly, \"Your Highness, the notice is out. They have confirmed that Ning Que will enter the Second floor. I have asked them for the reason, and Professor Huang He said that this was a decision made by the Second floor, they need not tell us why.\"</p><br/><p>Lee Peiyan stiffened at the reply and the rage boiled within him. He might be the prince of the Tang Empire, but he had no influence on the Second floor. It would not benefit him to get mad and scold anyone. In that moment, he transferred all that rage onto Ning Que.</p><br/><p>Eunuch Lin appeared beside him and reminded him, \" Your Highness, according to your lowly servant, you need not worry how to answer to the West-Hill Divine Kingdom. Perhaps ignoring Ning Que might be better.\"</p><br/><p>...</p><br/><p>...</p><br/><p>Once he was certain the Prince and court officials have all left the Academy, Ning Que left the room and walked around the lake. He suddenly spotted a chubby figure under the willow tree.</p><br/><p>Ning Que walked up and bowed deeply, saying, \"Many thanks.\"</p><br/><p>Chen Pipi said seriously, \"Since you want to thank me, you should go about it in a more practical manner.\"</p><br/><p>Ning Que thought about it and replied, \"I will invite you to my place for dinner soon. I'll have Sangsang make you Hot and sour noodle slices soup. Her cooking skills match the stall at Eastern City. I have never told anyone about this.\"</p><br/><p>Chen Pipi did not reply, but said, \"We will be seniors and juniors from now on.\"</p><br/><p>Ning Que looked at his round face and while he did not want to, he sighed and bowed once more, saying, \"Senior.\"</p><br/><p>Chen Pipi smiled. He held out his hands but made no move to stop Ning Que. He looked at Ning Que's head and smiled like a cat that caught the canary and said, \"Junior, there is no need to be so polite.\"</p><br/><p>Ning Que raised his head, and the two smiled at each other.</p><br/><p>They have known each other for an entire year now. A pile of broken firewood who could not cultivate had finally joined the Second floor. No matter Ning Que himself nor Chen Pipi who had witnessed this miracle could express their awe at this.</p><br/><p>Chen Pipi said sentimentally, \"Teacher had said once, that there is a type of cicada in the driest land of the West. They stay beneath the ground for 20 to 30 years and awaken when the snow and ice melt and bathe them in it. They dry their wings in the cold breeze, and fly out into the skies then.\"</p><br/><p>Ning Que smiled and shook his head.\"Do you need to say this to me? Unless you'd like for me to flatter you?\"</p><br/><p>Chen Pipi said, \"I'm not exaggerating. You were once a pile of useless firewood but have sudden ascended the skies. What's even more shocking is that you have the potential to be a Divine Talisman Master and even caught the attention of Master Yan Se of the Southern Gates.</p><br/><p>Ning Que had not known what was happening up till then. He had never heard of Master Yan Se, but have heard that he was a great Divine Talisman Master and was the senior to the Master of Nation. What did he see in him?</p><br/><p>...</p><br/><p>...</p><br/><p>Ning Que spotted a familiar skinny figure in a familiar place, by the familiar lake.</p><br/><p>He walked up and looked at Sangsang's haggard face. There were pieces of grass and leaves in her slightly yellowing hair. He brushed them off and said gently, \"You've waited for long. You've had it hard.\"</p><br/><p>Sangsang lifted her small face and looked at him. She said seriously, \"Young Master, you, are the one who have had it hard.\"</p><br/><p>After experiencing an entire night of pain in both his psyche and physical body and being assaulted by the joy of succeeding, Ning Que fainted on the peak of the mountain. While he had rested, his thoughts were still scrambled.</p><br/><p>Sangsang did not tell him that she had hidden beneath the big black umbrella all night alone like a wounded animal. She hid from the wild and cruel gales and was tired, scared and weak.</p><br/><p>The two held onto each other and walked away slowly into the sunlight.</p><br/><p>...</p><br/><p>...</p><br/><p>The front of the Academy was quiter than it had been last night. The officials and envoys have left early in the morning. Most of the students of the Academy had stayed behind. They gathered beneath the notice and raised their heads to look at the boy they had deliberately ignored for the past six months. Today, he had scared them speechless by reminding them of his existence in such a cruel method.</p><br/><p>The students did not leave after finding out the results of the Second floor entrance test. They might have wanted to see Ning Que subconsciously, to prove that this was not a hallucination. In fact, it might one might say that they're punishing themselves by doing so.</p><br/><p>The sun had dipped slightly and swallowed the foot of the hill behind the Academy along with the gentle spring breeze. Everyone's eyes turned towards the two figures, one slightly larger than the other, walking from behind the Academy.</p><br/><p>Ning Que's school robes were torn and tattered after rolling around on the mountain for an entire night. He looked exceptionally pathetic with streaks of mud and traces of snacks splattered all over him. Sangsang who was beside him did not look any better for she was covered with dirt. There were still plenty of grass on her hair and shoulders. The big black umbrella she was carrying looked even older and dirtier.</p><br/><p>However, to the students of the Academy, the two who were walking slowly towards them were enveloped in the glow of sunlight. They looked extremely clean with the spring breeze dancing around them and looked like a part of the glow and dancing wind.</p><br/><p>This, was what they call being glamorous.</p><br/><p>...</p><br/><p>...</p><br/><p>Ning Que stopped before the students and retrieved the handkerchief. He whipped it around to get rid of the remnants of the snack before handing it to Chu Youxian with a smile on his face. His gaze was heated with glee and enthusiasm.</p><br/><p>While life had not been difficult for Ning Que, it hadn't been great either since the semester exam six months ago. Other than the meadow and the and the old library, the only person who had stood by him was this friend of his.</p><br/><p>Ning Que's best quality was that he would never forget a grudge. However, the only ones he remembered were those that required bloodshed and not sarcasm that barely affected him. He would also always remember those who had done him a good turn. Other than Chan Xiaoshu and Chen Pipi, he would remember the two before him as well.</p><br/><p>Ning Que looked at Situ Yilan who was enveloped in sunlight and smiled, \"I rarely disappoint my friends.\"</p><br/>\n</div>"}