{"title": "Chapter 177: Disobedient Dots", "id": 177, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-177-disobedient-dots", "volume_title": "Volume 2", "body": "<h1>Chapter 177: Disobedient Dots</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 177: Disobedient Dots</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>There was a shop in front and a courtyard behind Old Brush Pen Shop, but both of them were really small and dangerous for Ning Que to practice the damned flying sword. It was acceptable to hurt the plants and flowers, but would Sangsang wash rice and cook under the protection of the big black umbrella? Therefore, Ning Que did not practice swordsmanship after going back to Lin 47th Street. Once again he stood in front of the desk, using the brush to dip in ink and staring at that snow-white paper.</p><br/><p>Today he was not in a daze like a statue, but took a deep breath from time to time. He lowered the waist and paced around, making eyes frequently and even vaguely humming. His right hand holding the brush was no longer as heavy as it was the previous days, but easy to be suspended in the air where he painted with a distance from the desk. Although he still hadn't painted, he looked much more relaxed.</p><br/><p>Sangsang cut the pumpkin into vertical bars and put them in the rice bowl for steaming. When she went into the house to take off the apron, she saw what Ning Que was doing. She curiously looked at Ning Que who walked around the desk and kept turning with his hands holding the brush to constantly wave in the air. Soon she felt a bit dizzy, so she clutched her forehead and said, \"Young master, if you really want to write, then just do it.\"</p><br/><p>Ning Que stopped the random hopping pace as he said smilingly, \"I know I can't, so why try it?\"</p><br/><p>Sangsang wiped her wet hands and said with a smile, \"Even if not now, you can just paint some ink paper to sell.\"</p><br/><p>Ning Que listened to these words and started to laugh. Suddenly Sangsang reacted and then surprisedly looked at Ning Que. She thought about what had happened today, for the young master actually did not turn into an idiot after holding the brush but actually was free to gossip with her.</p><br/><p>Then Ning Que accompanied her to eat and asked her to make a pot of tea after the meal. He moved a chair to the small courtyard, sitting to stargaze and drinking tea for a leisure talk, and seemed extremely relaxed and happy. Until late night with open light, he walked into the room and took off his coat leaning on the bed. Suddenly he took out a book to read whole-heartedly, slightly furrowing his brows from time to time and slowly rubbing his fingers.</p><br/><p>Sangsang took the feet-washing water into the house, thinking of many strange things tonight, and then could not help feeling puzzled. After living with Ning Que for so many years, she was very clear that he would desperately struggle like the other days before when he was trapped in the puzzle. She really did not understand why he would suddenly become so relaxed today. Has he already felt desperate for solving that puzzle?</p><br/><p>\"Young master, what book are you reading?\" She asked as she looked at the old book in his hands.</p><br/><p>Ning Que was startled by her question and then glanced at the pornographic book he secretly brought out from the back mountain's cave. He coughed twice to cover up his embarrassment and turned away to avoid her vision. He said, \"Something between men and women. You're too young to read it.\"</p><br/><p>Sangsang took off his shoes and socks from his feet, and then moved the stool to the other side of the footbath. She patted his thigh and gestured him to put his feet into the bowl. She said, \"It is nothing but something romantic between gifted scholars and beauties. What's worth reading?\"</p><br/><p>Ning Que laughed and said, \"How can you understand the joy in it... oh... great... don't scratch my feet bottom.\"</p><br/><p>...</p><br/><p>...</p><br/><p>In the cliff square of the back mountain in the Academy, fog faded and the scenery was quiet and elegant. A waterwheel behind the house was spinning with a squeak. Some depressing blacksmith sounds sometimes came from inside the room. With the sound of iron put into the water, water vapors filled the room inside.</p><br/><p>In dark corners, Fourth Brother observed Talisman inscriptions' directions on the sand table under the glimmer from the window. When the water vapors blowed him, he slightly frowned and waved his hands to drive them off. But he still kept watching the sand table, looking rather focused.</p><br/><p>The complicated and inexplicable lines on the sand table started to move slowly, following some unspeakable laws and extending toward each other. Until their final contact, the lines changed again and were to be combined into a new mode. Fourth Brother's eyes became brighter and brighter, but his face became paler and paler. From his serious expression, people could know that this time the Talisman inscription's calculation came to the most crucial moment.</p><br/><p>However, at this moment, a loud panic sound was heard on the cliff square outside the house, followed by an unobtrusive wind-breaking sound. Then a gray shadow of sword was seen, flying into the door crookedly.</p><br/><p>Sixth Brother who was concentrating on blacksmithing suddenly furrowed his bushy eyebrows and used his right hand to carry a heavy hammer as if carrying a piece of paper so as to smash the shadow of sword. His smashing looked extremely easy and wonderful. No one could play such a delicate and accurate hammer-smashing without decades of blacksmith life for lifting the hammer day after day.</p><br/><p>However... because of the controller's panic and terrible abilities, that gray shadow of sword moved extremely slowly, but its crooked direction actually did not have any regular patterns. Because of irregularity, it appeared to be somewhat elusive. It sometimes flew upwards like proud Second Brother, while it sometimes hovered in the air swinging like Eleventh Brother who was addicted to philosophy. It really went an unusual way and coincidentally avoided Sixth Brother's hammer-smashing, flying to the dark corner with a whizzing!</p><br/><p>With a snap, the hiltless flying sword deeply hit into the sand table in the corner, with its blade body trembling slightly and its tip accurately hitting at the line's intersection of those Talisman inscriptions. Those lines suddenly broke down inch by inch as a rope that was suddenly liberated and no longer restored to the previous state.</p><br/><p>Sixth Brother held the hammer and glanced at the sand table in the corner. With a simple and honest smile, he turned around and continued to forge iron.</p><br/><p>Until now did Fourth Brother notice this flying sword, for he has been absorbed in the sand table. He looked at the broken lines in the sand table and suddenly became extremely pale, with his body trembling violently.</p><br/><p>A figure appeared in the doorway, who gasped and flatteringly laughed. \"Senior Brothers, I'm really sorry.\"</p><br/><p>Fourth Brother suddenly turned around and stared at that clean and lovely face at the door as if seeing the world's most dirty and hateful thing. As his pale face suddenly became red, he heavily spanked the sand table and growled. \"Ning Que! Can't you find another place? This is the third time! If it happens next time, I'll tear you to pieces!\"</p><br/><p>...</p><br/><p>...</p><br/><p>\"It's said that horses all stumble and men all make mistakes. So Headmaster of Academy will also be hungry. I just began to practice Haoran Sword, so it's understandable for me to make some mistakes. I really don't understand why Fourth Brother is so angry.\" Ning Que carried the wood sword walking along the lake. He murmured to himself, \"Luckily, Sixth Brother did not hit the sword. If he smashed the sword, I had to ask Second Brother for another one.\"</p><br/><p>His ability of controlling the flying sword was really bad to the extreme. With ten acupoints in his Ocean of Qi and Mountain, he could only control a little Qi of Heaven and Earth. With a non-smooth procedure, he naturally had a very poor command on the grass-roots forces. It was basically a wishful thinking for him to hit what he aimed for, for the sword often hit somewhere else.</p><br/><p>He walked pass Mirror Lake to come in front of a luxuriant jungle, opposite to Sixth Brother's iron house. He thought that in terms of his state and cultivation, even if he made an inner outbreak, he still could not make the sword fly across the lake. Therefore, he suddenly felt a lot calmer in his heart. He adjusted his breathing and pushed the sword with Psyche Power after a moment of meditation. The wood sword in his hands flew upwards once again and circled around his head slowly for two laps.</p><br/><p>Looking up at the flying sword in the blue sky, Ning Que felt extremely satisfied in heart and muttered with a praise, \"I feel so good. Although I can't use it to kill, I can still use it for a juggle.\"</p><br/><p>When he was thinking so, that hiltless flying sword instantly got out of his Psyche Power's control and suddenly dived down from the air, with its tip pointing at his face. He was so startled as to hug his head directly lying on the ground, which looked extremely embarrassing.</p><br/><p>Before the flying sword was about to land, it might receive his Psyche Power or something else. So it forcibly resurrected in a weird way and flew again with its tip up. With a whiz, it rubbed his scalp and obliquely flew into the luxuriant jungle.</p><br/><p>Ning Que lying on the ground outstretched his fingers to make Sword Formulas, only to find that the flying sword has gone beyond his sense of perception. Therefore, he scolded while climbing up. \"This disobedient dot.\"</p><br/><p>At this time, there was a burst of rustling sounds in the jungle. Ninth Brother Beigong Weiyang came out, clutching his forehead in one hand and holding a vertical bamboo flute as well as the flying sword in the other hand. He looked very miserable.</p><br/><p>Ninth Brother went in front of Ning Que, looking at Ning Que blankly, and then pointed to his own forehead. Then he picked up the vertical bamboo flute to gently tap the wooden sword twice and solemnly said, \"Younger Brother, if you don't have this talent, then don't force yourself... If you go on like this, it doesn't matter to hurt our Senior Brothers and Sisters. But if you scare away the birds in the woods, who else can listen to the sounds of our bamboo flute and zither?\"</p><br/><p>Ning Que forced himself not to laugh and stepped forward to take over the wooden sword. He suddenly thought of one thing and said with a smile, \"Ninth Brother, if there is no bird listening to the fantastic sounds, why not play one to your Younger Brother like me?\"</p><br/><p>...</p><br/><p>...</p><br/><p>In the Inner-lake Pavilion, Seventh Sister embroidered while humming a soft and pleasant southern song. Suddenly she slightly furrowed her brows and put her wrist upside down. Then with a terrifying piercing sound, a fine embroidery needle in her fingers very precisely hit the wooden sword out of nowhere beside her right cheek. With a snap, the wooden sword fell to the bottom of the lake.</p><br/><p>Ning Que breathlessly ran to the lake, waving to Senior Sister in the pavilion, and said, \"Seventh Sister... could you help Younger Brother to fetch that flying sword? I have been in the lake to fetch it for three times today. I really have no clothes to change.\"</p><br/><p>Seventh Sister slightly furrowed her brows and looked at him to say, \"Leave me alone. The dignified Haoran Sword was actually changed by you and turned into a wasp's tail needle, weird but powerful. If people from the back mountain didn't have the self-protection ability, I'm afraid they might have suffered your sword injury.\"</p><br/><p>Ning Que sadly said, \"Seventh Sister, this is not what I expected. It doesn't obey my order. What can I do? I can't beat it as a revenge.\"</p><br/><p>Those words were really kind of lovely. Seventh Sister used her sleeves to cover her face and smiled. Suddenly her eyeballs moved, with her fingers slightly flipping.</p><br/><p>After a slight whiz, Ning Que suddenly felt something more on his collar. He looked down and saw a glittering fine needle piercing the collar and stopping there, nearly piercing into his own neck.</p><br/><p>He stunnedly looked up to Seventh Sister in the pavilion, thinking that she was so far from him but still had such an accuracy and intensity and she had such a terrifying needle craft.</p><br/><p>Seventh Sister stood up and looked at him as she said with a smile, \"You idiot, since you can't control so much Qi of Heaven and Earth, why you have to learn the flying sword? Why not try the flying needle?\"</p><br/><p>Ning Que startledly stood beside the lake.</p><br/><p>...</p><br/><p>...</p><br/><p>\"A needle is too thin and needs him to control Qi of Heaven and Earth like silk with his Psyche Power. And it is too difficult to wrap Qi around a needle. The problem is that it's smaller than the flying sword and needs a very high accuracy to be controlled by Perception State.\"</p><br/><p>\"I can't try it as I wish. The wooden sword's tip is polished round. However, even if this needle is polished flat, people still will hurt when stabbed by it. If it really stab a certain Senior Brother, he will certainly not spare me by hitting me twice like that goose.\"</p><br/><p>In the pine forest of the Academy's back mountain, Ning Que stared at the thin needle in his fingers and enchantedly murmured to himself. When he thought that he had been chasing after by that white goose stabbed by a needle in its buttock for half a mountain, he could not help feeling a bit shuddered.</p><br/><p>\"Rest, I must rest for a while.\"</p><br/><p>He stood up from a pine tree and went deeper. He slightly sniffed the light oily smell with his nose and easily found two Senior Brothers focusedly playing under an ancient pine.</p><br/><p>\"Senior Brothers, please play chess with me.\"</p><br/><p>Fifth Brother saw him and became extremely embarrassed and shockedly said, \"Younger Brother, how did you find us?\"</p><br/><p>Ning Que honestly replied, \"I've learnt hunting in Min Mountain since childhood. So it's very easy for me to find a person in mountains.\"</p><br/><p>Fifth Brother glanced at the guy looking samely embarrassed at the opposite side and tremblingly said, \"Eighth Brother, I'm your Senior Brother... Since today we still did not escape him, then you can accompany the rookie to play chess.\"</p><br/><p>...</p><br/><p>...</p><br/><p>One day.</p><br/><p>Ning Que did not practice Haoran Sword, but honestly helped Sixth Brother in the iron house. From early morning to evening, no one knew how many times he has lifted up the hammer. Even if he has a strong body, he also felt sore all over his body.</p><br/><p>Sixth Brother took off the leather apron in front of his naked upper half body and took a scoop of water to Ning Que. Then he asked with a smile, \"What is the matter on earth. You can say it now.\"</p><br/><p>Ning Que poured the water into his abdomen and uttered a lament of comfort to say, \"Senior Brother, Seventh Sister suggested me to try the flying needle. But the flying needle is too light and not easy to grasp. So I would like to ask you for its solution.\"</p><br/><p>\"Although you are still in No Doubts State, you should have thought of your Natal Item. Right?\" Sixth Brother asked.</p><br/><p>Ning Que distressedly said, \"It's funny to mention it. Now I have the reaction to taels of silver, but I don't think I can take the silver ingot as the Natal Item.\"</p><br/><p>Sixth Brother was stunned for a moment and said after a moment of silence, \"Then I'll... make some silver needles for you.\"</p><br/><p>Ning Que's eyes became slightly bright as he said, \"Can they be a little heavier?\"</p><br/><p>Sixth Brother looked at him and said, \"Then it would be gold.\"</p><br/><p>Ning Que seriously said, \"Although I haven't tried gold ever, I do believe I have a stronger feeling to it than silver.\"</p><br/><p>Sixth Brother became silent again and helplessly said after a long time, \"The gold needle is too soft. I'll mix it with something else.\"</p><br/><p>Ning Que became extremely joyful and greeted a bow with hands in front. Then he suddenly thought of certain possibility and had much brighter eyes.</p><br/><p>...</p><br/><p>...</p><br/><p>The second day.</p><br/><p>In a calligraphy shop in Lin 47th Street of Chang'an City, a little handmaiden with a black face unhappily threw away a pot and rags, with an extremely bad mood. So she decided to take her private savings today to purchase many cosmetic powders in Chenjinji Cosmetics Store. And her young master had robbed a pile of silver notes out of home like a bad gambler and exchanged them for real silver and gold. Then he happily went back to the Academy's back mountain.</p><br/><p>When the rough cloth was untied, three podaos that have been polished shiny appeared in front of Sixth Brother.</p><br/><p>Ning Que stood next to the three knives, hopefully looking at Sixth Brother.</p><br/><p>Sixth Brother looked at podao and the gold and silver beside and became silent for a long time. Then he looked up and watched excited Ning Que to seriously ask, \"From these things, I think Younger Brother you are going to play... flying knife?\"</p><br/><p>\"Right.\" Ning Que rubbed his hands and nervously said, \"Senior Brother, I am best at playing with knives. Since a sword can fly, of course, a knife can also fly. Besides, with your help of mixing it with gold as well as silver, I believe it must be better than the flying sword.\"</p><br/><p>Sixth Brother finally turned to a stiff face. \"But... have you seen such a big flying knife in the world?\"</p><br/><p>...</p><br/><p>...</p><br/><p>In the opinion of Ning Que, all the enemies hate him, so their word attacks were all wort a fart. Those clever people were best at speaking, so their language attacks were also worth a fart. However, such a simple and honest good man like Sixth Brother deeply hurt his self-esteem when Senior Brother mistakenly issued language attacks occasionally and inadvertently.</p><br/><p>Because of the depression and his hurt self-esteem, Ning Que decided to calm down to think about what to do in the future. So he slipped into the Mountain Path and went straightly into the flower trees. He found Eleventh Brother who was muttering deep inside the trees.</p><br/><p>\"Senior Brother, gain any new experience? Share with your Younger Brother.\"</p><br/><p>...</p><br/><p>...</p><br/><p>Someone flew a sword at the lake, smashing the flowers as well as grass and hitting Senior Brother's head. It also disturbed Senior Sister's embroidery in the spring, those magical lines on the sand table, blue waves in the lake and wet grass in the water.</p><br/><p>Someone flew a needle in the forest, adding a few more bloody wounds on his body. Not for too long, he was seen to be chasen after by a fat white, screaming over the mountain.</p><br/><p>Someone forged iron in the blacksmith house, with all kinds of strange materials piled at his feet. They were mainly gold and silver, supplemented by precious stones. Sixth Brother stood aside to help him to finish the design, with a simple and honest face filled with grievances.</p><br/><p>In the late spring of the fourteenth year of Tianqi era, these pictures repeatedly occurring in the Academy's back mountain. Many years later, people living in the back mountain still felt afraid when missing and recalling those days.</p><br/><p>The Younger Brother, who has just stepped into the Second floor, practiced his broken sword as well as his broken needle and thought of those bad ideas to torment his Senior Brothers and Sisters. All in all, he really made them extremely distressed.</p><br/><p>\"Are you crazy lately?\"</p><br/><p>Chen Pipi put his meal box down, watching Ning Que who was still satisfied when losing three rounds of chess to Eighth Brother, and then lamentedly asked.</p><br/><p>\"What do you mean? Try a flying needle or a flying knife?\" Ning Que confusedly asked.</p><br/><p>\"All of them...\" Chen Pipi said snappily, \"You haven't learnt the Haoran Sword, or known much Talisman Taoism from Master Yan Se. Why do you have so much energy to make so many bizarre things?\"</p><br/><p>\"It's always good to learn more.\"</p><br/><p>\"Why are you in such a hurry? Cultivation is a gradual and orderly progress. The most important thing is to lay the foundation first.\"</p><br/><p>\"My qualification is so poor, no matter how good the foundation is. So it's better to learn more.\"</p><br/><p>Chen Pipi sighed and said, \"In my opinion... you had better still focus on Talisman Taoism. What it needs is the talent not the foundation.\"</p><br/><p>Ning Que curiously asked, \"Why not learn them together?\"</p><br/><p>Chen Pipi frowned and said, \"Insatiable greed is not good for cultivation.\"</p><br/><p>Ning Que laughed and said, \"Since childhood, I've learnt a truth. No greed, no success.\"</p><br/><p>Chen Pipi was so angry as to laugh to say, \"Until now do I realize that you are such a stubborn person, even more stubborn than Second Brother.\"</p><br/><p>\"I won't tell it to Second Brother.\"</p><br/><p>\"A bowl of crab porridge.\"</p><br/><p>\"Impossible. Recently I've taken too much gold and silver out of home and Sangsang has been very unhappy.\"</p><br/><p>\"Well... how much did you take.\"</p><br/><p>\"Two hundred Liang taels of silver.\"</p><br/><p>\"Two hundred? Why did you make so many silver needles? You want to learn medical acupuncture!\"</p><br/><p>\"It's none of your business.\"</p><br/><p>\"Well, well. Then I'll curse you with a few more words of idiots.\"</p><br/><p>\"Pipi, you should remember that the back mountain is the Second floor of the Academy. Since we are all in the Second floor, naturally all of us are idiots.\"</p><br/><p>\"... \"</p><br/><p>\"Idiot Chen, don't you agree?\"</p><br/><p>\"I... agree.\" Chen Pipi looked at Ning Que as if seeing a madman and said biting his teeth, \"Even if you make those things for cultivation, why do you every day harass Senior Brothers? At the beginning, you were scared to pale when hearing that you were about to listen to their music and play chess. Why did you suddenly change the temper to listen to music and play chess every day?\"</p><br/><p>Ning Que laughed and replied, \"I did not like it at the very beginning because I didn't like being forced by someone to listen to music and play chess. Now Second Brother has ordered everyone not to force me. So I still can do them when I choose to do them myself. Senior Brother Bei Gong is really good at blowing the vertical bamboo flute. Besides how can I look for the opportunity to play against the two major national players outside the Academy?\" \"In the non-cultivation time, I can take those activities as an entertainment and cultivate my sentiments. In the future, I can boast to impress others with these things like World Wayfarers.\"</p><br/><p>Chen Pipi startled upon hearing it and held his own chubby cheeks to ask, \"How about Eleventh Brother? Why do you annoy him?\"</p><br/><p>\"But Eleventh Brother doesn't feel me annoying.\"</p><br/><p>Ning Que leaned down and lowered his voice to say, \"Have you ever noticed that listening to Eleventh Brother talk about those mysterious problems can not only help people sleep, but also help people get into meditation?\"</p><br/><p>...</p><br/><p>...</p><br/><p>All disciples on the Second floor of the Academy held a collective meeting in the back mountain the same night. Even the scholar of the small book house in the cave was also asked to be present. But the old man holding an old book has been concentrating on reading, not caring about what the people around were saying.</p><br/><p>Ning Que did not attend this meeting, not for he had already returned to his house in Chang'an, but for the main topic of this meeting on the Second floor of the Academy was to study how to deal with his current problems.</p><br/><p>\"Don't you think Younger Brother is very miserable? Haoran Sword was trained to become a wasp's tail needle... This is certainly not what he wants. But his qualification is limited, so he was forced to think about these messy ideas. I mean you should tolerate him more. Though he laughs every day, I always feel that he has hidden tears in his laughter, with a shadow in his heart.\"</p><br/><p>The meeting was held at Second Brother's small courtyard. Seventh Sister was holding an embroidery rack, cross-legged sitting in the deepest part of a Lohan bed. Her posture was extremely casual, which proved that she was not afraid of Second Brother.</p><br/><p>Listening to these words, Fourth Brother with the most serious face frowned and said, \"It's not a matter of tolerance. Am I really mad with Younger Brother? Now the most important question is how to help solve his cultivation problem.\"</p><br/><p>Third Sister Yu Lian quietly sitting in the corner of the room slightly smiled but did not say anything.</p><br/><p>Fifth Brother frowned and said, \"I think the primary problem is to enhance Younger Brother's self-confidence. He bothers me and Eighth Brother to play chess with him every day. Even if he loses a lot, he also grins and laughs. It's obvious that he has lost to numbness, even some metamorphosis. We can't let him be like this.\"</p><br/><p>All of them thought that those words seemed to make sense indeed.</p><br/><p>Ninth Brother tapped the vertical bamboo flute pipe and looked somewhere after a short moment of pondering. He said, \"Since the teacher and Eldest Brother are not here, now Second Brother you're the one we respect in the back mountain. To be honest, that day when he practiced the sword at the lakeside, what Second Brother you have said really hurt him. It says that it is better for the doer to undo what he has done. If Second Brother you can sincerely praise Younger Brother, he might be able to reinstate his confidence in practicing Haoran Sword.\"</p><br/><p>Everyone looked at Second Brother sitting in the middle.</p><br/><p>After a long time of silence, Second Brother said, \"I... can not lie.\"</p><br/>\n</div>"}