{"title": "Chapter 181: Eating Rice but Flowing Eggs out", "id": 181, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-181-eating-rice-but-flowing-eggs-out", "volume_title": "Volume 2", "body": "<h1>Chapter 181: Eating Rice but Flowing Eggs out</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 181: Eating Rice but Flowing Eggs out</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Ning Que certainly felt very excited after successfully completing the first Fu in his life, but soon he became calm and then a little emotional. This time, his happiness was not as strong as the ecstasy when he entered the cultivation road last year. He had been thinking of cultivation for more than ten years, and he suddenly succeeded almost as he was to give it up. In comparison, the success of Talisman Taoism was reasonable and predictable, because he knew he had the ability to comprehend it and the only problem was time.</p><br/><p>He felt excited but peaceful, so it was impossible for him to inform everyone by beating drums and gongs in streets and alleys. He just told those people close to him, but then he found in surprise that these guys' reactions were much stronger than his, which made him doubt who on earth wrote that water Fu on the white paper on his desk.</p><br/><p>In order to celebrate it, Sangsang unexpectedly employed the cook of Victory House to make noodles. The Senior Brothers and Senior Sisters in the Second Floor of the Academy all shared the news with each other. They thought that their Younger Brother would be absorbed in Talisman Taoism from now on and would give up practising his terrible flying sword. They happily jumped, danced, sang and played the flute because their heads and the ass of the big white goose would be much safer. When Master Yan Se heard of it, he was shocked and silently sat for a while in the South Gate Office at first, and then went to the House of Red Sleeves for an indulgent drinking. As he was highly drunk, two lines of old tears somehow flowed down along his old face.</p><br/><p>The third day after that summer rain, the old and noble Chancellor of Tang organized a grand banquet in his mansion for a random reason. More than ten government officials were invited and they all drank for entertainment in the rain-proof corridor of the courtyard. Actually, they all felt confused but didn't dare to ask the host.</p><br/><p>Those bigwigs of imperial court naturally wouldn't sit with those middle-level officials at the same courtyard. Instead, they were chatting with the Old Chancellor in the main room. Upon listening to the cheerful laughter of the Old Chancellor, they felt much more confused than those officials outside the room. They were guessing what kind of joyous thing could make the Old Chancellor so happy, who led the literary field with his well-known academic articles and seldom laughed. Was it because the border army succeeded in fighting a big area of land for Tang, or because his granddaughter was to get married?</p><br/><p>In such occasion, the atmosphere should be very joyful and hilarious, no matter what was the reason. However, when they saw another old white-hair lord sitting by the left side of the Old Chancellor, they felt strange and embarrassed, even the Minister of the Ministry of Rites kept silent as much as he could.</p><br/><p>That lord was Wang Shichen, the Grand Secretary of the Imperial Library. In the whole court, few people dare to embarrass the Old Chancellor except several persons like the prime minister. Also, the Grand Secretary was one of them. In addition, all people knew that the two old lords were at odds all the time.</p><br/><p>The two lords had been a inharmonious relationship for a long time, but it had nothing to do political and party competition. Tang put its law first, requiring every government departments to conduct their work according to the law. Even for nobles or royal members, they didn't dare to break the law. Though there wasn't cruel punishment, it was very difficult to illegally circumvent the law or do some tricks. In such case, few officials dared to secretly form cliques for private benefits.</p><br/><p>Several ministers and high officials in the main room knew clearly that the resentment between the Old Chancellor and the Grand Secretary was due to a thing on competing for a female's love at their young ages. At that time, both of them were students of the Academy, and they were close friends in the same class. Unfortunately, they both fell in love to a beautiful and well-disposed female in their class, who was the daughter of the prime minister back then. Most pitifully, the prime minister only had one daughter, so...</p><br/><p>Having a sneer and gently stroking his white beard, the Grand Secretary Wang Shichen looked at the Old Chancellor beside him and then said, \"I heard you often sent your steward to Lin 47th Street recently, and subpurchased several pieces of handwriting works from other people?\"</p><br/><p>\"Right. Are you jealous?\" The Old Chancellor grinned and said to Wang Shichen, \"You don't have to say something about the face of imperial court. After all, Ning Que is a student of the Academy, so he is our alumnus. What's more, he has already entered the Second floor. Though I am much older than him, is there any problem for me to show my respect to him? Besides, I heard that these days you also frequently sent your stewards to the Old Brush Pen Shop, so don't criticize me.\"</p><br/><p>\"Look at you, how would you an old man reply so much words to my few questions, if there is nothing shameful in your heart?\" Grand Secretary Wang sneered, \"Ning Que's handwriting is truly excellent. Both his Majesty and I appreciate it. Thus, is there something unsuitable for me to send some stewards to the Old Brush Pen Shop? I don't know whether your hard work gives you some authentic work, but I really feel sorry for you.\"</p><br/><p>Before the Old Chancellor answered, Grand Secretary Wang burst into laughter and said to other officials around the table, \"I think everyone knows that Mister Ning's Chicken Soup Calligraphy is in my mansion now. I feel very well when I take a look at it in my spare time.\"</p><br/><p>Knowing that the word was against him, the Old Chancellor slightly raised his eyebrows.</p><br/><p>Grand Secretary Wang also raised his eyebrows and continued saying, \"Actually, the number of Ning Que's handwriting works outside his shop isn't at a small number. However, I think no other works can be compared with the \"Bloom in the Opposite World\", except my Chicken Soup Calligraphy with implicit sense of Divine Talisman. Indeed, it cost me a lot to get the Chicken Soup Calligraphy. If I am not an old friend of Master Yan Se, how could I get the fantastic works?\"</p><br/><p>Then he turned to the Old Chancellor and smilingly said, \"Old man, I heard that your steward bought two pieces of rubblings of Yan on the Chicken Soup Calligraphy in the House of Red Sleeves? It is indeed needless. If you really want to view the authentic works of the Chicken Soup Calligraphy, just tell me. You don't have to invite me to this meal and bother other fellows, right?\"</p><br/><p>The Old Chancellor got a little angry and, with his hands on the table, sneered, \"If I want to have a look, you will bring it here?\"</p><br/><p>\"That's impossible!\" Grand Secretary Wang smilingly said, \"His Majesty knows the Chicken Soup Calligraphy is in my mansion and has already asked it for three times, but I refuse. If the works was sent to the palace, it definitely won't come back. If I send it here, I am certain that you won't give it back to me even if you have to abandon your face, so I won't bite at the bait. This month, his Majesty has already visited my mansion twice, if you really want to appreciate the works, just come to my house.\"</p><br/><p>\"Big Head Wang! Don't be so arrogant!\" The Old Chancellor violently banged the table and angrily rebuked.</p><br/><p>Out of anger, the moral and literature master directly called the nickname of Wang Shichen now, which was very unexpected and embarrassing. If it happened in the past, Wang Shichen would definitely humiliate the Old Chancellor as his counterattack. But today, he took advantage of the Chicken Soup Calligraphy and acted like a winner. He unconcernedly shook his head and said in a sympathetic tone, \"Discomposure. You are too discomposed!\"</p><br/><p>Thinking of the purpose of today's banquet, the Old Chancellor forcibly suppressed his anger. Then he slowly took a seat and sneered, \"Today's banquet is certainly for something important. For inviting you? You think your face is big enough because your head is big?\"</p><br/><p>Grand Secretary Wang just smiled and ignored it.</p><br/><p>Watching two high officials who had served for three emperors ridiculing to each other, other ministers and officials around the table didn't dare to interrupt. Actually they had been used to this kind of scene. They had no other choices but to keep silent, because they knew it was useless to reconcile the quarrel.</p><br/><p>After a while, it seemed that some guests were coming, as some sound appeared in the courtyard.</p><br/><p>Grand Secretary Wang looked out of the door and then slightly frowned.</p><br/><p>The Old Chancellor laughed and stroke his long beard with satisfaction, when he looked at the young lad who was entering the courtyard in the middle of other youngsters. Then he squinted at Grand Secretary Wang and said, \"The authentic works of the Chicken Soup Calligraphy? Let's look at the author of the Chicken Soup Calligraphy first!\"</p><br/><p>Right now these bigwigs from imperial court had already guessed the identity of the young lad. Before then, they knew the young guy more or less, but they still couldn't help sighing with emotion in their hearts, because the young lad was so young.</p><br/><p>Grand Secretary Wang looked very embarrassed.</p><br/><p>Back in spring, the whole Chang'an was shocked at the presence of the author of the famous handwriting works \"Bloom in the opposite world\". Many high officials and noble figures wanted to get close to the author, so as to please his Majesty. Even for Grand Secretary Wang, apart from managing to get the Chicken Soup Calligraphy from Yan Se, he also sent his steward to invite the author for a banquet. However, to everyone's surprise, the man was deaf to all invitation and continued living steadily and peacefully in an ordinary alley.</p><br/><p>For ordinary calligraphers, if they treated bigwigs of Tang in this way, they would be immediately desolated and forgotten by others, even if they are the second Master of Calligraphers. However, this calligrapher was deeply favored by his Majesty and he was a student of the Second floor of the Academy. Thus, these bigwigs didn't dare to suppress or threaten him and just unwillingly left him alone.</p><br/><p>As time passed, these bigwigs found that the man treated all people with the same attitude and never accepted anyone's invitation. They though the man, a cultivator, might be more interested in other hobbies, so they gradually forgot it. They kept purchasing his expensive works without hesitation, but stopped showing enthusiasm to the person. Today, however, no one had expected that...this man would appear at the banquet of Old Chancellor!</p><br/><p>These government officials of Tang were all very clever, so, after few seconds, they figured out why the calligrapher broke his regular behavior. With a sneer, Wang Shichen looked at Old Chancellor and ironically said, \"Congratulation on you having a good granddaughter.\"</p><br/><p>In fact, there were some vicious meaning hidden behind the word. However, as how Grand Secretary Wang replied Old Chancellor with normal words before, this time Old Chancellor acted like a victor. He just smilingly and sarcastically said, \"It is a pity that your granddaughter failed to pass the examination of Academy.\"</p><br/><p>This sentence directly stabbed the biggest pain of Grand Secretary Wang these three years. With his facial expression slightly changing and fingers trembling, Grand Secretary Wang pointed to Old Chancellor's face with his finger and angrily rebuked, \"You the old man, don't be so complacent!\"</p><br/><p>Old Chancellor said with emotion, \"As the first old man who succeeded in inviting Mister Ning to a banquet, it is difficult to be not complacent.\"</p><br/><p>Looking back to Ning Que outside the courtyard, Grand Secretary Wang irritatedly said, \"Is it necessary to watch the old chicken when enjoying chicken soup?\"</p><br/><p>Old Chancellor laughed and sighed with his head shaking, \"Discomposure. You are too discomposed!\"</p><br/><p>...</p><br/><p>...</p><br/><p>In a summer storm the day before yesterday, Ning Que said that sentence to Sangsang as he finished an ink Fu in white paper, and then they began accepting others' invitations. After sorting out the invitation cards, they surprisingly found that they had saved dozens of invitations within two months.</p><br/><p>They clearly knew that these bigwigs in Chang'an treated him so politely and warmly because of the face of his Majesty. Previously, he wasn't afraid of refusing them, for he was backed by the Academy. However, if he started accepting the invitations, it was of necessity to pay attention to the sequential order, because the Academy would be also embarrassed to speak for him if he offended a high official in etiquette.</p><br/><p>Yesterday by the river bank of Academy, Ning Que carefully consulted to Situ Yilan about the issue. Finally, he decided to put Old Chancellor's invitation in the first place. The reasons were very simple. First, as Old Chancellor was a noble and literary official, it was reasonable for Ning Que to visit him as a calligrapher student. More importantly, Jin Wucai, the granddaughter of Old Chancellor, was his classmate. This kind of relation wouldn't be criticized in any situations anywhere.</p><br/><p>The dishes in the Old Chancellor's mansion were, of course, much better than those in the imperial court, but also too light. Besides, the talk at the banquet was really lack of fun. Remembering an everlasting truth that you have to politely show your enough respect if a big wig favored you, Ning Que modestly and earnestly answered their words and behaved very well.</p><br/><p>After the meal, Old Chancellor naturally ordered his servants to get ready for calligraphy stationery and invited Ning Que to show handwriting talent.</p><br/><p>After completing the writing, Ning Que, accompanied by Jin Wucai and Situ Yilan, walked out of the mansion. Through a short chatting, Ning Que knew that Xie Chengyun had already returned back to South Jin Kingdom during these days when Ning Que was busy learning Talisman Taoism. He noticed that when Situ Yilan mentioned Xie Chengyun, Jin Wucai's facial expression was still peaceful, but some sadness could be unavoidably seen from her eyes.</p><br/><p>Since Ning Que had attended a banquet, there was no chance for him to refuse others. According to the schedule made by Situ Yilan, he should have visited the minister of the Ministry of Rites the second day. However, he had to change the original plan to visit Grand Secretary Wang first, for he had met Grand Secretary Wang at the banquet of Old Chancellor last night. Before agreeing the request of Grand Secretary Wang at the banquet last night, Ning Que had clearly felt that if he refused the invitation of the white-hair Grand Secretary Wang, this guy would perhaps send some people to smash his shop in Lin 47th Street.</p><br/><p>The dinner at Grand Secretary Wang's mansion was more extravagant than that of Old Chancellor. Obviously, this old lord didn't serve him as an old hen that could be treated well just with some rice. Instead, he invited a lot of high officials from six ministries and three councils. If carefully counted, about half of the officials who were qualified to attend imperial court meeting were possibly standing in this courtyard!</p><br/><p>Looking at these high officials who wore all kinds of government robes in the courtyard, Ning Que was speechless out of shock. He thought how he would be worth such a grand face as he was just a young calligrapher?</p><br/><p>However, Grand Secretary Wang thought Ning Que was worth it. Standing in front of the step and joining Ning Que's hand, he made a grand introduction of Ning Que to everyone present.</p><br/><p>For Academy and Headmaster of Academy, for imperial palace and his Majesty, for South Gate Office and Yan Se, Grand Secretary Wang didn't mind giving enough face. Of course, he implicitly wanted to show off. On one hand, he would like to, by these officials' mouth, tell the whole country that Ning Que had attended his banquet. On the other hand, he wanted to let Ning Que know that he was more careful and attentive than Old Chancellor in entertaining him. In this way, Grand Secretary Wang implied that Ning Que should first let him appreciate handwriting works in the future, and should tell him what his Majesty thought...</p><br/><p>All people didn't leave after dinner. Grand Secretary Wang showed that precious Chicken Soup Calligraphy for others' appreciation. Later, the old lord requested Ning Que to stamp his private seal on the memo paper which was still wrinkled after repairing.</p><br/><p>With Ning Que's fingers slightly raising, the seal was separated from the surface of Chicken Soup Calligraphy, leaving a lump of eye-dazzling redness. A great rejoicing suddenly filled the whole mansion. Other officials were cheering by praising and clapping hands, the chamberlain of the mansion was moved due to happiness, and all servants were muttering with each other. The old servant, who followed the family from hometown and had served Grand Secretary for nearly seventy years, was crying out of excitement. Holding his walking stick, he looked at the brightly-lit courtyard and tremblingly said, \"My lord, young master defeated that Jin old man. The hatred of 'robbing wife' was finally revenged a little...\"</p><br/><p>After stamping the seal, Ning Que breathed a sigh of relief and thought maybe the assignment was finished. However, to his surprise, Grand Secretary Wang didn't want to let him leave. Instead, like Old Chancellor yesterday, he ordered his servants to get ready for calligraphy stationery. From the speed of placing the calligraphy stationery by stewards, no one present believed that they weren't overtime trained on it before.</p><br/><p>Blankly looking at the super-large Huangzhou art paper in front of him, Ning Que felt like weeping but no tears. He thought last night Old Chancellor just took a piece of ordinary paper, but Grand Secretary Wang...wanted me to write a central scroll? Was it too cruel?</p><br/><p>After leaving the mansion of Grand Secretary, Ning Que sadly said to Sangsang, \"We won't attend such banquet in the future.\"</p><br/><p>Sangsang asked in confusion, \"Young master, several days ago you said we can't depend on only one skill if we want to achieve something ambitious, so we had to build a good relationship with those bigwigs in mortal world while paying most attention to cultivation. But why now you say we won't attend such banquet in the future?\"</p><br/><p>\"When it comes to having meals, chatting, praising bigwigs and bootlicking, I am actually very good at it, because I am unblushing after all.\"</p><br/><p>Ning Que shook his head and said with emotion, \"But I have to leave a piece of handwriting after having a meal. Yesterday I was requested to write on an ordinary volume, but today the host asked for a central scroll. Tomorrow if the prime minister invites me, what should I write? Fill the newly-painted white wall with characters?\"</p><br/><p>\"These bigwigs aren't inviting me to their banquets; instead, they are totally robbing my money!\"</p><br/>\n</div>"}