{"title": "Chapter 190: Here Comes an Ox Cart", "id": 190, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-190-here-comes-an-ox-cart", "volume_title": "Volume 2", "body": "<h1>Chapter 190: Here Comes an Ox Cart</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 190: Here Comes an Ox Cart</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>There was an ox cart in the wilderness.</p><br/><p>The cart was an ordinary wooden cart that had slightly misshapen wheels from the long journey. It emitted slight creaks as it traveled on the hard grassland. It bumped up and down, leaving behind an untraceable print behind him. The wheels would dig deeply into the soft wet ground and little fish would jump out as they passed.</p><br/><p>The ox was ordinary as well. Its strong legs held strong even though it had traveled far and wide. It grunted occasionally as it walked on the hard ground. Sometimes, it would lower its head to munch on the grass, leaving behind a grass trail and flattened grass when it dug its hoof deeply into the wet ground.</p><br/><p>An ordinary wood cart and an ordinary ox from the Central Plains appearing in the wilderness was something extraordinary. Anyone witnessing this would find it rather incredible.</p><br/><p>The driver of this cart was a wide-eyed scholar. His dusty robes seemed more tattered that it was. However, his expression was friendly and trustworthy. It was curious how his straw slippers did not fall apart even though he had been on the road for more than a year. A water ladle hung at his waist and it swayed along with the movement of the ox cart.</p><br/><p>A sudden song wafted from the ox cart</p><br/><p>\"I wasn't allowed home... it worries me..\"</p><br/><p>The scholar driving the place smiled. He patted the ox lightly, signaling for it to stop. He turned around and said, \"Headmaster, do you want to go home?\"</p><br/><p>The curtains raised. A tall man with white hair walked out. He rubbed his waist and stretched his arms. He looked at the empty wilderness and said angrily, \"We've been out for more than a year, and yet, we hang around in the wild, have nothing to eat and nothing to do. Who wouldn't want to return to Chang'an?\"</p><br/><p>The old man was the Headmaster of the Academy.</p><br/><p>Eldest Brother smiled and helped Headmaster off the cart and onto a bench he retrieved from the cart. He said placatingly, \"It's good that we were able to see the sights along the way.\"</p><br/><p>The Headmaster was so tall that his robes covered the short bench completely. He looked as if he was squatting on the grassland and it looked rather funny.</p><br/><p>The Headmaster said, \"What scenery is there to see? The Hot Sea has frozen, we can't even think of going for a hot bath in the springs!\"</p><br/><p>\"We had really good peony fish even though we didn't manage to soak in the hot springs.\" Eldest Brother said.</p><br/><p>There was a sea in the extreme north that had an underwater volcano. The waters there never froze, giving it the name Hot Sea. There was fish called \"peony\" in the depth of the Hot Sea. Peony fish were fat and succulent and when cut straight down with a knife, looked like a peony flower.</p><br/><p>Only people like the Headmaster and Eldest Brother would know about this.</p><br/><p>Headmaster stroked his long beard and nodded in agreement. He said, \"Child, I cannot agree more with what you just said. All the difficulties in this journey are well worth it as long as we get to eat peony fish.\"</p><br/><p>Eldest Brother retrieved a knife as well as other cooking utensils and a pail from the cart. He thawed out a peony fish and began to slice it.</p><br/><p>The Headmaster looked at the wriggling fish on the board and praised, \"Food has to be eaten fresh. The heat from the Hot Sea along with the cold in the northern regions have made this fish so succulent. It makes the long journey totally worth it.\"</p><br/><p>Eldest Brother smiled and did not reply. He carved the fish carefully. The fish was fat and succulent. Even the sharpest knife could hardly pierce its skin. Eldest Brother cut the fish slowly, his two different strokes looked as if they landed on the same spot. However, when he lifted his knife, it glistened with a thin slice of flesh.</p><br/><p>\"You can't slice river fish too thinly, or it'd lose its texture. But the Peony fish lives in the deep sea and its flesh is extremely bouncy. The thinner it is, the better. Child, you have indeed learned some things about life after all these years.\"</p><br/><p>Headmaster shook his head in praise. He retrieved soy sauce and a green colored condiment as well as ginger with his left hand and reached for the thin slice of fish with his right hand. He dipped the flesh in the bowl and brought it to his mouth.</p><br/><p>Headmaster closed his eyes in delight as he chewed. He had an expression of utter bliss on his face that seemed as sweet as the fish he savored. His eyes flicked open and he stared at the chopping board and the knife that moved too slowly. He said urgently, \"Quick, quick.\"</p><br/><p>Eldest Brother smiled but did not move faster. He continued to cut it slowly.</p><br/><p>The Headmaster could not wait any longer and snatched the knife over. He sighed, \"Child, you are good at almost everything. But you're just too slow. I can't wait any longer.\"</p><br/><p>Eldest Brother explained respectfully, \"Your student is stupid, that is why I am willing to think for a bit longer before doing anything.\"</p><br/><p>\"You have to learn more from Little Mo. Think when you should and don't when you don't have to.\"</p><br/><p>\"Second younger brother is amazing. I cannot compare with him.\"</p><br/><p>\"Wouldn't he be ashamed of his younger self if he heard you saying that.\"</p><br/><p>Headmaster started carving and was done within seconds. The board was filled with slices of fish that was as white as snow. It bore an uncanny likeness to a blossoming white peony flower.</p><br/><p>The bones and organs were wrapped in a thin film and it looked like a piece of amber.</p><br/><p>Eldest Brother retrieved two pairs of chopsticks. He only helped himself to the fish after Headmaster had eaten his fill. He then fed the amber like bones and organs to the ox.</p><br/><p>It was a fact that oxen ate grass. But... the ox ate fish. It chewed vigorously and shook his head, looking extremely happy.</p><br/><p>Headmaster was drinking a pot of wine when he saw this. He said angrily, \"This is such a waste of good food! A cow eating peony fish! Should the fish be eaten in this way?\"</p><br/><p>Headmaster retrieved another fish from the bucket after he said that. He rolled up his sleeves and started carving at the fish. There were slices of fish that resembled peony on the board within seconds.</p><br/><p>Headmaster picked up a slice of fish with his chopsticks. He threw it into the ox's mouth after dipping it in the sauce.</p><br/><p>Giving the ox peony fish was not a waste. Instead, not being able to taste the fish completely was a waste.</p><br/><p>The ox chewed and stopped still. He teared up, shook his head and stomped his hoof while mooing.</p><br/><p>Eldest Brother asked, \"Headmaster, is he happy or was it too spicy?\"</p><br/><p>Headmaster replied, \"Of course he is happy.\"</p><br/><p>Eldest Brother thought to himself, that the Headmaster is always correct. He picked up the chopsticks and fed the ox more fish.</p><br/><p>...</p><br/><p>...</p><br/><p>Even the Desolate Man could not bear to stay in the extreme north anymore, yet the ox managed to make it there and back without even shaking. Instead, he was as fit as before. This was not an ordinary ox. It was not difficult to understand why he ate fish and not grass.</p><br/><p>Eldest Brother washed the utensils and sat down, looking towards the south. He said, \"I wonder how the Academy is like now. How large was the impact of Desolate Man moving southwards?\"</p><br/><p>Headmaster sat down on the cart with his knees crossed. He replied while holding on to the book he was reading. \"We will find out when we get back.\"</p><br/><p>Eldest Brother smiled and looked at the Headmaster. \"I wonder who entered the Second floor.\"</p><br/><p>Headmaster looked at his book and lowered his head. He said, \"You'll find out when you see it.\"</p><br/><p>Eldest Brother shook his head and smiled, \"It's too far away, we can't go back anytime soon.\"</p><br/><p>He stood up and looked towards the north of the grassland and smiled.</p><br/><p>A tall shadow appeared. It was made up of snowfield direwolves that had been chased to the south along with Desolate Man. Hundreds of wolves stood in line like soldiers. Their large size made them look really impressive, but it did not garner any reaction from both the Headmaster and Eldest Brother.</p><br/><p>On the contrary, the reaction of the snowfield direwolves was rather odd. The ox from the central plains that was rarely seen by them should be as delicious to them as peony fish. But ferocious wolves did not leap over, but looked afraid and started whining before retreating. It seemed as if they could sense a fearsome aura from afar.</p><br/><p>These wolves were the very same ones that fought with the Tang siblings. The skinny male wolf brought along the beautiful female wolf, separating from the pack and towards the ox cart. The ordinary male wolf stopped about a hundred steps away from the cart and did not dare to move forward.</p><br/><p>The scrawny male wolf looked at the cart and seemed very agitated. It shivered and stepped backward. It raised its two front paws, looking like a student bowing at its teacher or seniors.</p><br/><p>Eldest Brother looked at the male wolf and remarked in surprise. \"Teacher, isn't this the wolf from seven years ago? It got married.\"</p><br/><p>The headmaster smiled and did not say anything.</p><br/><p>Eldest Brother looked at the Headmaster. When he noticed that the Headmaster showed no sign of refuting his statement, he left the cart and walked towards the ordinary looking male wolf. He raised his hand and pointed at the north-west of the grassland and said, \"Do not continue southwards. There are too many people there. Walk in that direction. There is a large patch of boreal forest in five hundred miles.\"</p><br/><p>The wolf waved his front paws, mimicking a bow. He laid down with his head on the ground for a long while before standing up. He whined and looked at the ox cart, bidding it goodbye reluctantly before leading his pack towards the north-west.</p><br/><p>\"Let's return to Chang'an.\"</p><br/><p>The Headmaster rolled up his book, lifted the curtain and entered the ox cart.</p><br/><p>Eldest Brother looked at the meadows afar before sitting on the driver's seat and patted the ox's back lightly.</p><br/><p>The ox cart sped towards the south, clattering on the ground.</p><br/><p>...</p><br/><p>...</p><br/><p>Tang Xiaotang held the sleeping snow wolf in her arms and stood up as she watched the cart disappear beyond the grassland. Her face was filled with disconcertment. She mumbled to himself after a long while. \"That... that's the Headmaster?\"</p><br/><p>Tang stood by her side, nodding as they watched the tracks left behind on the grassland by the cart.</p><br/><p>Tang Xiaotang shook her head. She felt that the gluttonous old man was completely different from the Headmaster she had imagined.</p><br/><p>After a moment of silence, Tang said, \"I wanted to see if there was an opportunity for you to become the Headmaster's student. Since he did not show any sign of accepting you, it shows that it is not time yet. Let's talk about it when the time comes in the future.\"</p><br/><p>Tang Xiaotang was surprised and asked, \"Do you mean that the Headmaster knew that we were watching here?\"</p><br/><p>Tang turned around and walked towards the end of the meadow and said, \"He is the Headmaster. He knows everything.\"</p><br/>\n</div>"}