{"title": "Chapter 200: A Dark Blue Lake Like a Waist (III)", "id": 200, "volume": 2, "url": "http://boxnovel.org/nightfall-chapter-200-a-dark-blue-lake-like-a-waist-iii", "volume_title": "Volume 2", "body": "<h1>Chapter 200: A Dark Blue Lake Like a Waist (III)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 200: A Dark Blue Lake Like a Waist (III)</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Due to the Lee royal family of Chang'an controlling the world and the West-Hill Divine Palace, the relationship between the Central Plains countries and the Tang Empire had never been in harmony. Although they were terrified of the Tang Empire's powerful military force and dared not to show any rudeness, they absolutely had no good feelings for the Tangs deep in their hearts. However, the Great River Kingdom was a special case.</p><br/><p>There were forests and the vast territory of the South Jin Kingdom between the Great River Kingdom in the southern part of the mainland and the Tang Empire. It was very difficult for them to get in touch with each other. However, the great distance might have been the reason for the great admiration of the Great River Kingdom. Since a long time back, the Great River Kingdom's emperor and common people had always admired the Tang culture and sent envoys and students from time to time regardless of the difficult and long-distance traffic. The culture of Chang'an City was extremely popular in the Great River Kingdom. Many details from Great River Kingdom's official system to the daily life of its people reflect the impact of the Tang culture.</p><br/><p>The boys and girls who appeared beside the jungle and the blue lake wore light-colored dresses and had a gorgeous broad waistband. It was the most popular clothing style in the Kaihua years of the Tang Empire. These boys and girls had calm and supple facial features, with focused but determined gazes. The wooden swords with black sheaths on their waists which were long and slightly curved were slender swords unique to the Great River Kingdom.</p><br/><p>From these details, Ning Que soon decided that they belonged to the Great River Kingdom. Both generations of two countries had a natural sense of closeness and trust for each other. They did not believe that the other side would commit malicious acts against themselves. Therefore, Ning Que did not hesitate to put down the bow and arrow in his hands. As he expected, when these boys and girls knew of his identity as a Tang, they soon showed their goodwill and reported their own sect and division.</p><br/><p>Great River Kingdom's Black Ink Garden was a place where Master of Calligrapher Master Wang cultivated. These boys and girls who had appeared in the Wilderness of northern Yan were naturally the disciples of Master of Calligrapher. Most of them were female disciples, and only three or four were male disciples.</p><br/><p>The girl who was targeted by Ning Que with a boxwood bow came forward, blinking with curious eyes. She looked at Ning Que as if she was looking at an interesting object and asked, \"Are you really a Tang?\"</p><br/><p>The girl wearing a lotus colored dress had a shaggy scarf around her face and neck probably for the fear of coldness. With a naive face and smart big eyes, she looked particularly lovely.</p><br/><p>Ning Que laughed and replied, \"Do I have any benefits by pretending to be a Tang?\"</p><br/><p>The girl covered her mouth to laugh and said, \"In addition to the Tang merchants in the city, I have not seen Tangs from Chang'an City. So I'm a bit curious.\"</p><br/><p>A woman about 20 years old stepped forward and apologized to Ning Que with a bow. Then she took an identity document issued by the Military Ministry of Yan Kingdom from her arms and then invited Ning Que to take out his identity document.</p><br/><p>After all, it was the Wilderness, not far from the battlefield. So they did not give up their vigilance just based on Ning Que's words. Ning Que understood their cautiousness and removed his backpack, and held out the document issued by Tuyang City to her.</p><br/><p>After confirming Ning Que as a Tang, these disciples from Black Ink Garden of the Great River Kingdom immediately became more relaxed. The girls gathered together and looked at him curiously from a distance. The woman apologized sincerely and said, \"I did not know your identity previously. So I was so rude to hold you at the sword point and point an arrow at you. I hope that young sir can forgive me.\"</p><br/><p>Tang girls were known for their rudeness and unreasonableness. Both Lee Yu and Situ Yilan had such characteristics. So Ning Que rarely saw such a gentlewoman like this. He glanced at Black Ink Garden's male disciples who stood at a distance honestly and well-behaved. He remembered the rumors that women came first and men second in the Great River Kingdom and could not help feeling a little strange. Since the Great River Kingdom valued girls over boys, why were these female disciples of Black Ink Garden so gentle and reasonable, and even too soft?</p><br/><p>He smiled and shook his head, \"You're too polite. It's you who first discovered this hot spring. So I'm the unpleasant guest. If there is someone who should apologize, it should be me.\"</p><br/><p>The twenty-year-old woman said after a moment's hesitation, \"As expected, you as a Tang do say gentle words and have a generous temperament. I'm Black Ink Garden's third disciple, Zhuo Zhihua. If you like this hot spring, why not... \"</p><br/><p>If Ning Que was a normal soldier of the Tang Empire, the third disciple of Black Ink Garden would not be so gentle and courteous. Just because this place was not far from Dongsheng Stockaded Village and that black gown Ning Que wore showed the world's first-rate quality in material and embroidery work, for it was a farewell gift from Mistress Jian in House of Red Sleeves. The women of the Great River Kingdom all understood the Tang clothing and guessed Ning Que certainly had an uncommon origin just after a glance. Maybe Ning Que was one of those Academy students who was practicing in Dongsheng Stockaded Village. So her attitude became gentler and humbler.</p><br/><p>\"It's not true.\" Ning Que laughed and said, \"I just wandered around the lake, and found that the lake was different. I guessed there might be mountain streams. I did not expect it to be a hot spring beforehand. You don't need to care about me.\"</p><br/><p>Upon listening to these words, the woman retained her calm expression but felt much relieved in her heart. Based on Great River Kingdom's respect for the Tang Empire, especially when she guessed Ning Que's uncommon identity, at any other time she would probably leave with her Younger Sisters and Brothers so as to offer this hot spring to Ning Que. But now it was inconvenient...</p><br/><p>\"If so, we'll not disturb your rest.\"</p><br/><p>Zhuo Zhihua saw that he did not plan to reveal his identity and felt inconvenient to rudely ask him. She smiled and bowed politely. Then she took the group of boys and girls and walked towards the jungle.</p><br/><p>Ning Que looked at the depths of the jungle, vaguely seeing water fogs coming from the hot spring and a yellow cloth curtain around one-half-man size. He thought that the girls of Great River Kingdom probably took a shower in the hot spring behind the curtain. So there was no wonder that they had been so nervous beforehand. It would be terrible if they let other men peep at those naked girls.</p><br/><p>Ning Que actually did not expect to meet the female disciple of Black Ink Garden in the Great River Kingdom when walking along the lake. Today his luck did not seem to be too bad. He picked up his backpack on the ground and turned around to walk towards where he came from. He remembered that he had previously passed a lake and the scenery of a shallow pool among white stones there was not bad. So he intended to go there to meditate and rest.</p><br/><p>Just then, the rustle of footsteps suddenly came behind him. He turned curiously and saw the Great River Kingdom girl that he had pointed at with his bow and arrow running over. Her face was flushed red because she was running too fast, And the hairy beast tail around her neck has long come undone, which made her look much cuter.</p><br/><p>Ning Que asked, \"What is the matter?\"</p><br/><p>The girl, with her dark, big eyes, gazed at Ning Que's warm expression. She thought of the calm and cold-headed archer she had seen previously and subconsciously scratched her head, asking, \"Could you tell me, when I came out of the woods with so many Senior Brothers and Sisters, why did you choose to aim at me with a bow and an arrow?\"</p><br/><p>\"If I say, to catch bandits, first catch the ringleader, do you believe it?\" Ning Que replied smilingly.</p><br/><p>The girl laughed, shaking her head, and said, \"Of course not. I have always been the worst among so many disciples of Black Ink Garden. Besides, at that time I had no weapons in my hand and Senior Brothers had bows and arrows in their hands, and Senior Sisters had slender swords on their waists. You are so powerful. Of course, you didn't see me as the most threatening one.\"</p><br/><p>Ning Que did not expect that she could think of so many things from that aiming. After a slight pause, he honestly replied, \"The reason why I aimed at you is that you are the weakest one in the crowd.\"</p><br/><p>Then he added. \"When one is fighting against heavy odds, it would be better to aim at the most important or vulnerable one among the enemies. Then he would have better chances to bargain with them next.\"</p><br/><p>The girl looked at him curiously and asked, \"If... there was really a misunderstanding, would you really shoot me?\"</p><br/><p>There was no sense of resentment or exasperation, just pure curiosity.</p><br/><p>Ning Que nodded his head.</p><br/><p>The girl's dark eyes revealed her astonishment at that and she said, \"Will the Tangs also bully the weak?\"</p><br/><p>\"The Tangs are also ordinary people, including good ones and bad ones.\"</p><br/><p>The girl puzzled and asked, \"But you are not a bad guy.\"</p><br/><p>Ning Que looked at this cute cub-like little girl and could not help rubbing her head. Then he said smilingly, \"There are no good or bad men on the battlefield, only the dead or the living.\"</p><br/><p>After a short pause, he looked at her reddish tender face. Maybe because he was affected by those memories, the smile on his face gradually faded away. He said seriously, \"In the battlefield, you kill the enemy or the enemy kills you. Little girl, if you don't want to die here, you must remember this.\"</p><br/><p>The girl nodded hard.</p><br/><p>\"So you ran over to ask about these things?\" Ning Que asked.</p><br/><p>\"Ah.\" The girl laughed like an early lotus, with a touch of flush on her face. \"And I wanted to tell you, my name is Cat Girl.\"</p><br/><p>After she finished this sentence, she turned to run toward the hot spring of mountain stream and never looked back.</p><br/><p>Ning Que looked at the girl's back and could not help laughing. He thought he had always heard that the names of those from the Great River Kingdom were very interesting. But he really did not expect someone to be called Cat Girl. This name really sounded not so nice, but really matched with the girl's curious dark eyes and hairy cuteness.</p><br/><p>He walked back along the lakeside not too far and looked at a pond leaking out of white stones in the lower edge of the shore. The rocks in the bottom of this clear pool were as clear as book pages, whose scenery looked good. After he confirmed it was far enough and would not be misunderstood by those Great River Kingdom girls behind the yellow cloth curtain, he unloaded his package and sat down.</p><br/><p>The lake's air still had a smell of sulfur. The mountain stream was actually a hot spring, which was not potable. So he realized why neither the Wilderness tribes nor Yan Kingdom's coalition army chose this place to set up a camp.</p><br/><p>\"As is written in the story, the Great River Kingdom girls really like hot spring spa.\"</p><br/><p>He looked back at the distant corner of the vague yellow cloth curtain and subconsciously gently closed around the round stone beneath his right hand. This action did not show he was obscene but only showed that he recalled the previous touch on Cat Girl's head. After a brief moment of recalling, he understood this kind of feeling at this time was because he had not rubbed Sangsang's head for a long time.</p><br/><p>The scenery was beautiful around this lake and stone pool. It was quiet and pleasant. Most importantly, it was surrounded by an abundance of Qi of Heaven and Earth. Since he could not jump into the stream to bathe with Great River Kingdom girls, Ning Que was naturally reluctant to give up such a good place for cultivation.</p><br/><p>The next day, he came to the lake riding the Big Black Horse.</p><br/><p>He sat in the lake wind in a quiet meditation with eyes closed. Then he opened his eyes and raised his fingers in the wind to gently paint some hard-to-understand lines. Only he knew that these lines were put together to become Fu characters.</p><br/><p>His gaze followed his fingertip to move in the air. When he met some difficult moments, he frowned thinking for a long time and waved his hand to erase all the imaginary Fu characters. And then he continued to use his fingers to paint intangible Fu characters.</p><br/><p>Before he knew it, the sun had moved to the highest point and the slightly cold wind became a little warm due to the sunshine. He undid his collar and stood up to stretch his upper body, relaxing his stiff body and slightly sore arms.</p><br/><p>After a lazy stretch of and a pleasant extension of his arms, his gaze naturally floated to the right in front, on the vague yellow cloth curtain in the faraway woods and stream. Perhaps this was his body's natural response or psychological one. In short, he looked over to the other side and even heard the splash sound of water and silvery laughter.</p><br/><p>\"The Great River Kingdom girls really like hot spring spa.\"</p><br/><p>He once again had a lament and thought if they soaked in the hot spring yesterday, today and even every day, their smooth white skin would turn into wet white paper. Did those girls not worry about it?</p><br/><p>Outside the forest and stream, a few Black Ink Garden's male disciples stood guard. It proved the rumor of Great River Kingdom's valuing girls more than boys. Ning Que could not help thinking that Great River Kingdom's predecessor monarch was an empress and the legendary female who was disguised as a male traveling to Chang'an City for studies and had some spread unclear story with the previous Emperor of the Tang Empire... If the Empress had no son or the country had no Master of Calligrapher, Great River Kingdom men's position might be even more miserable.</p><br/><p>The hot spring water was like goat's milk and the frolicking young girls were like deer. After all, this kind of imagination could not make Ning Que full. So he left the stone pool and looked for a dry land to begin putting up a stove for cooking. Today, he prepared to make a pot of milky mutton soup.</p><br/><p>\"Can you cook?\"</p><br/><p>Cat Girl appeared on the shore of the lake, looking at Ning Que who was lighting a fire with curious eyes opening wide. She said, \"I heard that men in the Tang Empire did not cook but only ate ready-made meals?\"</p><br/><p>Ning Que had long known that she had come. He did not lift his head and said, \"In Chang'an City, I naturally don't cook. But in this wilderness, what else can I do except cooking by myself?\"</p><br/><p>Cat Girl patted her palms, turned her black pupils, and squatted beside him, saying bravely, \"I can help you.\"</p><br/><p>Ning Que saw her hopeful face. Though he very much distrusted this Great River Kingdom girl's cooking, he still laughed and made space for her.To his surprise, Cat Girl cooking actually had extremely consummate cooking skills despite her young age. Only after a while, she has completed all the procedures and then cleaned her hands. They were just waiting for the food to finish cooking.</p><br/><p>Ning Que listened to the boiling sound in the pot and sniffed the meat scent that has begun to overflow from it. Ning Que looked at her in surprise and became more confused about how the Great River Kingdom women were like. In a society that valued girls over boys, how did those women have such a gentle temperament and good cooking skills?</p><br/><p>Ning Que lifted up the pot and ladled a bowl of soup before handing a bowl over to her. Cat Girl smiled and they two began to drink slightly the hot soup when sitting in the cold wind of the lakeside. From the body to the heart, they have become warmer.</p><br/><p>\"Is it warm in the Great River Kingdom?\"</p><br/><p>\"Yes,\" Cat Girl nodded, watching the thin ices on the lake surface, and said with a shiver. \"I really didn't expect it to actually be so cold in the Yan Kingdom. The cotton clothes I bought in West-Hill seem not to be wind-proof.\"</p><br/><p>\"In a few days, when the real winter comes, or when you go into the real depths of the Wilderness, you will know what is a knife-like wind. Since you are so young, why did you follow your Senior Sisters to the frontline?\"</p><br/><p>\"I am fourteen this year.\" Cat Girl kept her eyes wide open, puzzledly looking at him, and then asked, \"Still young?\"</p><br/><p>\"Fourteen is not young?\"</p><br/><p>Cat Girl slightly furrowed her brows and said with a pout, \"If one is fourteen, she can be married. I'm not young at all.\"</p><br/><p>It seemed that according to the Tang laws, a girl can only be married at the age of sixteen? Ning Que held a bowl of soup, watching the faraway hot fogs slowly rising from the lake surface. He recalled that Sangsang was just fourteen years old this year. Could she get married in the Great River Kingdom?</p><br/><p>After drinking the mutton soup, Cat Girl ignored Ning Que's opposition and took off the hairy collar from her neck quickly, rolled up her sleeves and washed the pottery tableware clean.</p><br/><p>Ning Que looked at the busy little figure in the lakeside and naturally thought of Sangsang once again. It had been more than one month when he left Chang'an City, he rarely thought of his little handmaiden at home. Perhaps it was their similar age, figure or something else, but after encountering Cat Girl, he thought of Sangsang more and more often.</p><br/><p>\"A little gift, showing my thanks for you.\"</p><br/><p>When Cat Girl said goodbye to him, Ning Que took a small box of cakes from his luggage and handed it to her.</p><br/><p>Cat Girl meant to decline, but looked at the beautiful emblem on the wooden box, her big eyes suddenly brightened up. She surprisedly shouted. \"Is this Chang'an City's... Osmanthus Cake from the Lotus Store?\"</p><br/><p>\"It seems like it.\"</p><br/><p>Mistress Jian asked Xiaocao to prepare the cakes for Ning Que's bag and undoubtedly the cakes Xiaocao had prepared were basically Sangsang's favorite food. He vaguely remembered that it really seemed to be called Osmanthus Cake of a certain store.</p><br/><p>\"The sub-branches of Lotus Store sell the other cakes but Osmanthus Cake, for this Osmanthus Cake was made with the osmanthus outside Daming Palace.\"</p><br/><p>Cat Girl was delighted with the surprise and held the cake box as she was holding a precious thing. She carefully took out a piece and put it into her mouth and chewed, showing a very happy intoxicated smile on her face.</p><br/><p>Ning Que looked at the girl's smile on her face, feeling very happy. He recalled last year when he brought cakes to Sangsang from House of Red Sleeves, she also smiled like Cat Girl. Why was he thinking of Sangsang again?</p><br/><p>...</p><br/><p>...</p><br/><p>My love was on the mountainside. It was difficult to find her in such a high mountain. My sweetheart sent me Osmanthus Cake, but what should I send to her? The medicine to make her sleep? Ning Que always felt like he had read such a poem, but could not remember the specific date of this memory. He only got distracted by the words \"Osmanthus Cake\" in the poem. He thought that he should cause the young girl disciple to misunderstand him. Although there was no pear flower growing on his head, he did not want to bully a tender flower or a small grass.</p><br/><p>The fact has proved that Ning Que had thought too much, or Black Ink Garden people had had a coping plan for this kind of thing. After he sent Osmanthus Cake, the very next day, the female disciple Zhuo Zhihua brought a big pot of fish soup for him as a return.</p><br/><p>The taste of stewed fish was really sweet and creamy. He could not pick up the slightest mistake with the attitude of those Great River Kingdom girls, making him feel overwhelmed by their special favor. Ning Que felt that he could not be such a freeloader. So he once again took out a box of cakes as a return.</p><br/><p>The time gradually flew away in an exchange between a variety of Great River Kingdom's stewed meals and various Chang'an City cakes. It became colder and colder in the Wilderness of northern Yan and the winter was officially coming. The thin ice around the lakeside got together, gradually melt and froze again like a whole piece of mirror. Only the ice surface beside the hot spring bank was still blue.</p><br/><p>Although they did not talk too much or even meet too many times. Ning Que became familiar with those Black Ink Garden girls in the Great River Kingdom, after all. The girls did not ask about his origin, sect or name. He did not ask them why they did not camp in the coalition barracks but chose to come to this wilderness.</p><br/><p>It became colder and colder in winter. Behind the yellow cloth curtain, the hot spring cascaded down along a cliff and turned into a stream and even a pool. White water vapors spread everywhere, making the place as warm as spring.</p><br/><p>Because of the high temperature inside the cloth curtain, Cat Girl sat on the wet stones by the stream wearing only a small fur clothing and kicked her two feet. She happily ate several cakes held in her hands, with her thin fur clothing stuck to her growing body by the air of moisture, showing a few slightly raised body curves.</p><br/><p>She looked at the pool below the warm stream and shouted. \"The last two Osmanthus Cakes, you really don't want them?\"</p><br/><p>Zhuo Zhihua went to the creek, looking at the direction of the pool, and said smilingly, \"Hill Master, have a try.\"</p><br/><p>Only a vague figure could be seen behind the milky mists widespread above the pool. Suddenly a burst of cold wind blew from the depths of the mountains, disturbing the hot fogs above the pool through the cloth curtain. Then their view became slightly clearer.</p><br/><p>There was a rock protruding out of the pool surface.</p><br/><p>A young girl was sitting quietly on the rock, opposite the stream bank. Her lower body was wrapped in a thin white wet cloth and her upper body was naked. Her black hair fell down on her naked jade-like back like a waterfall, with water droplets slowly falling from her hair end.</p><br/><p>\"You guys have it.\"</p><br/><p>Zhuo Zhihua watched the girl in the pool and said anxiously, \"Hill Master, the coalition forces are totally unwilling to care about us. The logistical men and camp quarter both make things difficult for us. Should we stay here all the time?\"</p><br/><p>Cat Girl tossed the wet hair on her shoulders behind her back and walked to the edge of the pool and angrily said, \"In my opinion, we might as well simply go to Dongsheng Stockaded Village. The general of the Tang Empire will certainly welcome us.\"</p><br/><p>Zhuo Zhihua rubbed her head and said reluctantly, \"Although the Great River Kingdom and the Tang Empire have always had a good relationship, We, Black Ink Garden disciples, came here after accepting Divine Hall's edict after all. His Majesty dare not offend the Divine Hall. And don't forget, our master is a visiting professor of Divine Hall. If we leave the coalition to the Tang camp, we will bring trouble to our master.\"</p><br/><p>Cat Girl turned her black pupils and said, \"Senior Sister, you can simply reveal your identity to them. A few days ago Flower Addict, Lu Chenjia, went to the Military camp along with Revelation Institute, and those Yans and Yuelun Kingdom guys were rather honest and respectful. If you let them know that you are here too, they dare not to be so bad to us.\"</p><br/><p>The black-hair girl on the rock in the pool said softly after a short moment of silence, \"Why would you fight for such meaningless things?\"</p><br/><p>...</p><br/><p>...</p><br/><p>There was a day when Ning Que came to the lakeside earlier than usual. He put down his luggage next to the stone pool and thought that the Black Ink Garden girls should still be resting. So he glanced at that place.</p><br/><p>Then he saw a picturesque view.</p><br/><p>He saw a picture as beautiful as a view.</p><br/><p>In the dawn light stood a girl at the end of a branch diagonally extending towards the winter lake.</p><br/><p>The girl was dressed in thin white clothing, with her black hair casually tied behind her back like a waterfall. Her naked feet stepped on the delicate branch end. The branch rocked up and down gently, as did her body due to the blowing wind from the lake surface, It looked extremely comfortable as if it was not the winter wind of the Wilderness but the warm spring breeze blowing on her face.</p><br/><p>Ning Que looked at her quietly and did not make a sound, for he subconsciously did not want to destroy this picture.</p><br/><p>The girl in white clothing who stood at the bottom of an inclined branch seemed to have sensed his eyes on her. So she softly lifted up her white sleeves, instantly disappearing behind the yellow cloth curtain.</p><br/><p>Only that thin branch was still swinging gently in the lake wind.</p><br/><p>Ning Que looked at the trembling branch and slowly lifted his brow tips.</p><br/><p>He did not see her face clearly but only remembered that blue ribbon tied around her waist when she disappeared like a ghost.</p><br/><p>Her white clothing was like a cloud above the lake.</p><br/><p>Her blue ribbon was like the water in the lake.</p><br/>\n</div>"}