{"title": "Chapter 201: Tomes of Arcane Lost in the Wilderness", "id": 201, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-201-tomes-of-arcane-lost-in-the-wilderness", "volume_title": "Volume 3", "body": "<h1>Chapter 201: Tomes of Arcane Lost in the Wilderness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 201: Tomes of Arcane Lost in the Wilderness</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The girl in white disappeared behind the cloth curtain and never came out again. From early morning to late afternoon, Ning Que looked from time to time into the direction of the mountain stream, his neck and eyes starting to ache, yet he still failed to see the scene of a white cloth with a blue waist again.</p><br/><p>He secretly guessed the identity of that girl, but except for his confirmation of her identity as a girl disciple of Black Ink Garden in Great River Kingdom, he could figure out nothing more. So what he could do was only resentfully packing up his bags and returning to the Dongsheng Village.</p><br/><p>During this period when winter shrouded the Wilderness, the situation in the Northern Yan Kingdom silently but clearly changed. The sporadic fighting between the coalition forces of Central Plains and the palace of Left-Tent left a hundred more corpses of cavalry on the Wilderness, which meanwhile prevented all trades between the two parties. Now the determination and the chips of the two parties were quite obvious. Therefore, Chanyu of the Left-Tent Palace sent his messenger unexpectedly to the Central Plains to show his intention of conducting peace negotiations.</p><br/><p>As was analyzed by Ning Que, no matter the West-Hill Divine Palace or the Chang'an City, they never regarded the Left-Tent Palace as their true enemy. What's more, the Left-Tent palace was not the vulnerable one that could be defeated by one blow. Those barbarian cavalries migrating around the winter grass, though suffered losses from the Desolate Men returning to the south, didn't actually feel fearful of the people of Central Plains, especially the troop of Yan Kingdom in the east battlefront. Therefore, the coalition forces of Central Plains accepted the negotiating request of the Chanyu of Left-Tent only after some scoldings and discussion on the surface.</p><br/><p>Since it was necessary to start negotiation, there must be somebody who was responsible for unifying idea and leading the negotiation process. General Xia Hou naturally couldn't leave the Tuyang City and come to negotiate personally, and the Tang Empire would not allow the West-Hill Divine Palace to be in charge of the affair. So after several rounds of arguing, they finally decided that they all send representatives.</p><br/><p>The trial attack and defense in the wilderness had nothing to do with Ning Que, and the on-coming negotiation had nothing to do with him either. Although the top leaders of the Yan Kingdom Army knew he had a terrifying background, after all he did not have any military identity. In fact, his current status had made him qualified to conduct the negotiation on behalf of the Tang army. However, how could those strategists from the General's Mansion of Tuyang City dare to let him take a risk in the Wilderness, just like what they did in the past two months.</p><br/><p>The North wind was roaring outside the window yet inside it was warm. Ning Que was focused on reading books beside the table by a dim light.</p><br/><p>The captain looked at him and said, \"Three days ago, some guys camouflaged as a trade team and fled out of the Tuyang City. Their target might be the Wilderness. Although peace talks will be started, the ban on trade has not been lifted. I do not know what these people are anxious about. I always feel they are not spies in the Military camp.\"</p><br/><p>The captain, as a secret guard of the Tang Empire, began to follow Ning Que's lead after knowing his identity. Normally a secret guard should only report what he confirmed rather than speculated. However, at the thought of the strange trade team of Tuyang City, he finally failed to hold his mouth and probingly said, \"I heard... general Xia Hou is the visiting professor of West-Hill Divine Palace.\"</p><br/><p>\"Don't probe like a twat. I don't know what His Majesty wants to do. And it is also unnecessary for you to know what secret task His Majesty has given me to the Wilderness in the North of Yan Kingdom.\"</p><br/><p>Ning Que put down the volume of books, looked at him and shook his head, saying, \"The whole world knows general Xia Hou is the visiting professor of West-Hill Divine Palace, so what? Liu Bai, the Sage of Sword, is also a visiting professor of the Divine Hall, and my master is a Great Divine Priest of the Divine Hall. Our Tang people believed in Haotian, then can we say that it is also sinful?\"</p><br/><p>Looking at this subordinate who hesitantly opened his mouth, he smiled and waved his hand, continuing, \"If the general Xia Hou wants to meet people from the West-Hill Divine Palace, then any time is ok, but why did he choose the wartime, and choose to secretly do it in the Wilderness of the North of Yan Kingdom? He is not an idiot, so do not think too much. You just continue to watch the Tuyang City for me.\"</p><br/><p>The captain accepted the order and went out.</p><br/><p>Looking at the oil-light flame turning faint, Ning Que slowly wrinkled his brows. As he had said earlier, the Tang people worship Haotian. However, it was known to all that the Empire and the Divine Hall were different, or else there would not be the South School of Haotian. As a general of the Empire, Xia Hou should be a visiting professor of the West-Hill Divine Palace... Why was His Majesty so tolerable towards him? Why after so many years, His Majesty suddenly lost his confidence in him? If Xia Hou really colluded with West-Hill Divine Palace underground and attempted to do harm to the Empire, what should he do? And the key point was what the Divine Hall could give him.</p><br/><p>When winter really came, the first snow visited the North of Yan Kingdom, and an Array Tactical Master also visited the Dongsheng Stockaded Village. The Array Tactical Master had the letter of identification by the Middle Military Camp, saying that because of the bitter chilliness, the Middle Military Camp was afraid that the array tactical on all defense lines of the frontier fortress might be damaged, thus sending him to check and repair the possible damages.</p><br/><p>In the world, the number of cultivators was extremely small, and Talisman Masters and Array Tactical Masters were even rarer. No matter it was in a prosperous city or a bitterly cold frontier, such figures were always honored and respected. On the battlefield in particular, such good Array Tactical Masters could help to strengthen the soundness of military defenses. So this Array Tactical Master was warmly welcomed by commanders as well as ordinary soldiers.</p><br/><p>General of Dongsheng Stockaded Village diligently welcomed the Array Tactical Master into his tent and was preparing to slaughter livestock to treat him. But unexpectedly the Array Tactical Master waved his hand to signal for the servant soldiers to leave. After confirming that nobody was around, he seriously asked, \"Is Mr.Thirteen here?\"</p><br/><p>...</p><br/><p>...</p><br/><p>It seemed that the black ID token couldn't reflect any light, yet dull darkness revealed no sense of dirty, which looked more like an inky jade having immersed in the Ink Lake of the Great River Kingdom for thousands of miles.</p><br/><p>The two ID tokens slowly approached to each other. When there was only a thin seam between them, they automatically connected as if they were drawn by some suction. Those hidden talismans, which seemed not eyecatching yet were in fact wonderfully and perfectly matched.</p><br/><p>Ning Que looked at the ID tokens and curiously said, \"It actually has such a function.\"</p><br/><p>\"ID tokens of Imperial Center Administration are all made for special purposes, and it is even difficult for the West-Hill Divine Palace to make a fake one. So when you see the ID token, you can confirm the identity of its holder.\"</p><br/><p>The Array Tactical Master from the Middle Military Camp explained to Ning Que with a few words and then stood up to greet a deep bow. He respectfully said, \"Qv Xiangge, Array Tactical of MastersImperial Center Administration, greet you!\"</p><br/><p>Looking at the gray hair of the Array Tactical Master, Ning Que did not want to accept the greeting. So he quickly propped him up, saying, \"I'm just an unofficial personnel of the Imperial Center Administration, so don't call me master.\"</p><br/><p>The Array Tactical Master looked at the black ID token in his hand with lament and smile in his eyes, explaining, \"Master, it is impossible for an unofficial personnel to hold such an ID token as yours. This kind of ID token has very high authority. Except the Master of Nation and charge of the Imperial Center Administration, even the World Wayfarers of the South School have no right to order you.\"</p><br/><p>Ning Que took the ID token back and put it in the air to examine it for quite a while, yet finding nothing special in it. He thought to himself that the day when His Majesty finally gave him this ID token, he even felt unsatisfied. If this ID token was really so powerful as what he had said, he seemed to have misunderstood His Majesty.</p><br/><p>\"Even if not considering my official post in Imperial Center Administration, I was still the 34th generation of disciple of South School of Haotian. Since you are a descendant of Master Yan Se, you are my grandmaster. Then do you want me to kneel down and make kowtow towards you?\"</p><br/><p>Ning Que laughed and waved his hand, \"I know I'm senior in generation, but I never expected it is up to such a high level. Let's come to the point, you must have something important to tell me with this special visit.\"</p><br/><p>\"The Desolate Men going south have forced the tribes of the Left-Tent palace to go south too. Anyway, that affair is not important. So after the Divine Hall issued the edict, the imperial court felt it quite strange. Even if they are afraid that remaining forces of Devil's Doctrine will revitalize because of the Desolate Men, it is still unreasonable for them to be so serious.\"</p><br/><p>\"As for the Apologetic Cavalry, it can be understood as the Divine Hall's demonstrating power to the world. However, besides Prince Long Qing, the Divine Hall has sent other more powerful figures. And many spies from the Judicial Department have hidden themselves in the Wilderness, and we don't know what is the result. Then what on earth do they want to do?\"</p><br/><p>The Array Tactical Master looked at Ning Que's eyes and seriously said, \"The imperial court ordered the Imperial Center Administration to make an investigation about the reason why the Divine Hall got into such a big arrangement. We have arranged many manpowers, which even include personnels of the Divine Hall who are disciples from our school... \"</p><br/><p>The end of Ning Que's brow slightly tilted up when he heard the words, and then he asked, \"Our Imperial Center Administration should have personnels in the Divine Hall?\"</p><br/><p>The Array Tactical Master nodded and smilingly explained, \"Anyway, the South School and the Divine Hall have the same origin. The Divine Hall has definitely sent spies in the South School, then naturally the South School can hide spies in the Divine Hall. So people of South School are natural people of our Imperial Center Administration.\"</p><br/><p>\"You have explained quite clearly, please continue.\"</p><br/><p>\"We spent a month to find out that it has something to do with the seven volumes of the Tomes of Arcane. But master, I'm sorry to say that we have none other evidences than a piece of cloth.\"</p><br/><p>The Array Tactical Master took a piece of cloth out from his sleeve. From the way of sewing it could be found that the cloth was from the lower edge of the robe, which was torn off by brute force. Then they found there were two dull-red characters on the cloth which was almost as dark as ink: \"Ming Volume\".</p><br/><p>Looking at the two characters, Ning Que furrowed and fetched his hand out to touch the dark-red characters, saying, \"This is a letter written with blood.\"</p><br/><p>The Array Tactical Master looked at him and whispered, \"Our companions in the Divine Hall tried all means to send out only this piece of cloth, then no more information was sent out. Perhaps it has been found by others.\"</p><br/><p>It could be figured out that the spy of Imperial Center Administration in West-Hill who could find such a big secret and moreover send the information out from West-Hill Divine Palace must be of high status in Divine Hall.</p><br/><p>Looking at the two blood characters frowningly, Ning Que asked after a long time of silence, \"Just based on these two characters... How can we confirm it has something to do with the seven volumes of Tomes of Arcane? If not, his death is really pitiful.\"</p><br/><p>The Array Tactical Master answered, \"When seeing the two blood characters, nobody in the Imperial Center Administration related it to the legendary seven volumes of Tomes of Arcane. Then the Master of Nation saw it and confirmed that Ming Volume was one of the seven volumes of Tomes of Arcane.\"</p><br/><p>Ning Que clutched the piece of cloth in his hand and looked up at his eyes. After a moment of pondering, he asked, \"Then how to confirm that the Divine Hall sent powerful men to the Wilderness has relations with this matter?\"</p><br/><p>\"Because this volume of Tomes of Arcane is probably held by the Desolate Men.\" The Array Tactical Master answered.</p><br/><p>Ning Que felt puzzled and asked, \"The Devil's Doctrine is born in the tribes of Desolate Man, but why the Tomes of Arcane of Haotian were in the hand of Desolate Man?\"</p><br/><p>The Array Tactical Master looked at him with complicated expression, wondering why this core disciple of the Headmaster of Academy, also the future Master of Nation of Tang Empire, should have no idea about the most famous history of the cultivation world.</p><br/><p>\"Master... many years ago, The Desolate Men controlled the northern part of the mainland and, as is known to all, established the strongest country stretching from the south to the north. Back then, the Divine Hall of Haotian sent the Great Divine Priest of Light to the Wilderness to deliver their sermon, aiming to cover the Desolate Man with Divine light of Haotian.\"</p><br/><p>However, no one had expected that the Great Divine Priest of Light, who were superb in doctrine and of high moral prestige, should go astray in the process of delivering their doctrine to the Desolate Man and created an approach of cultivation which was totally different from the main doctrine.\"</p><br/><p>Ning Que rubbed his head and unbelievably asked, \"Is it the cultivation of Devil's Doctrine?\"</p><br/><p>\"Yes.\"</p><br/><p>The creator of Devil's Doctrine was actually the Great Divine Priest of Light of West-Hill Divine Palace? It was only until now did Ning Que know this secret history, thus feeling shocked inside. He thought to himself. \"Finally we were all from one family.\"</p><br/><p>The Array Tactical Master continued, \"The Great Divine Priest of Light is superb in practicing and strict in teaching, and he is most adept at inspiring the mortals. That year, the Divine Hall has put great expectation on him and even lets him take away one volume of Tomes of Arcane. Therefore, when he created the Devil's Doctrine and became the eternal enemy of the Divine Hall, the volume of Tomes of Arcane was naturally left in the Wilderness and never came out again on the Central Plains.\"</p><br/><p>\"Decades ago, the devil sect hidden in the Central Plains was totally exterminated by the main sects of the Central Plains, and even the mysterious Front Gate of Devil's Doctrine has been chopped into ruins by a sublime being of senior generation with a single sword. However, they still didn't find the volume of Tomes of Arcane.\"</p><br/><p>A man had chopped the Front Gate of Devil's Doctrine into ruins with a single sword. Listening to these stories of the sublime being, Ning Que seemed to have seen those pictures, and felt stirred in his mind and numb in his skin. But not knowing why, he faintly felt that sublime being probably had something to do with him, or at least had something to do with the Academy.</p><br/><p>\"Who's the sublime being?\"</p><br/><p>\"I don't know.\"</p><br/><p>\"... \"</p><br/><p>\"Since there is no such book even at the Front Gate of Devil's Doctrine, then there is only one possibility, that is, as early as a thousand years ago, it was already brought to the extremely cold region in the north by the Desolate Man. That region is too chilly and remote, and the Desolate Man is strong. Even Grand Cultivators at Knowing Destiny State dare not rashly enter the region. So it is still a conjecture. But now, now that the Desolate Man migrated to the south from that extremely cold region in the north, of course the Divine Hall will find the volume of Tomes of Arcane back.\"</p><br/><p>Upon hearing those words, Ning Que finally realized why the imperial court made such judgment on the intent of the Divine Hall. He also believed that the West-Hill Divine Palace, in order to reclaim the lost volume of Tomes of Arcane, would initiate a bloody war with no hesitation at the risk of thousands of people's lives, and even send Prince Long Qing or other more important people to risk their lives.</p><br/><p>From imperial monarchs to hawker pawns, all of us in the world knew that the seven-volume Tomes of Arcane were the most sacred Classics of the Haotian Taoism. But few knew what was the seven-volume Tomes of Arcane and what it was about.</p><br/><p>There were many legends about the seven volumes of Tomes of Arcane. Some people said that it recorded the will of Haotian to the world. Some said that it contained predictions about the world. Some said that the book itself was a supreme Taoism vessel condensed with power of heaven and earth. Some even said that mortals could practice cultivation at one look of the Tomes of Arcane, cultivators could break the realm at one look of the Tomes of Arcane, ghosts in the Underworld could be refined and reborn at one look of the Tomes of Arcane and sages could become immortals with one glance at the Tomes of Arcane.</p><br/><p>Ning Que had heard of these legends, but at that time his life had little relationship with the seven volumes of Tomes of Arcane, so he didn't care about them. He even didn't believe that there were Tomes of Arcane in this world. Today, he finally realized that the seven volumes of Tomes of Arcane did exist, yet he still couldn't believe those legends were true. He thought the seven volumes of Tomes of Arcane were more probably secrets of Haotian Taoism, which recorded some world-shaking and peerless cultivation approaches.</p><br/><p>At this moment, he did not know that his name had appeared in the first volume of Tomes of Arcane.</p><br/><p>...</p><br/><p>...</p><br/><p>\"The Tomes of Arcane is very important, and everybody wants it. But does it matter to me?\"</p><br/><p>After all, he is a disciple of the Second floor of the Academy. Although he was still a bit too weak in state, he didn't remain too long in the shock and quickly awakened from it because he was more or less influenced by his crazy and proud Senior Brothers and Sisters at the Back Mountain. Then he looked at the Array Tactical Master and asked.</p><br/><p>The Array Tactical Master looked at the outside of the window and said softly to his ear, \"Master of Nation asked me to give you a message. It is difficult to find the Tomes of Arcane in the Wilderness. Ordinary cultivators didn't have any power in the face of the Divine Hall. And after all Master Yan Se is still a Great Divine Priest of Divine Hall, so it is inconvenient for him to do it. You are just at the North of Yan Kingdom, so... \"</p><br/><p>\"So the task falls on me?\" Ning Que stared at him and asked.</p><br/><p>\"Exactly. As for the piece of cloth with blood characters, it is sent to you by a specially-assigned person from Chang'an City under the order of the Master of Nation himself.\"</p><br/><p>Staring at the snowflakes floating outside the window, Ning Que kept in silence for a long time and suddenly asked, \"What are the Tomes of Arcane like?\"</p><br/><p>The Array Tactical Master respectfully replied, \"I don't know.\"</p><br/><p>Ning Que's eyes fell on his face and continued to ask, \"And size?\"</p><br/><p>The Array Tactical Master honestly replied, \"I don't know.\"</p><br/><p>The eyebrow tip of Ning Que slightly twitched. He forcibly suppressed his anger and continued to ask, \"Which volume did the Divine Hall lose?\"</p><br/><p>The Array Tactical Master shook his head, answering, \"I do not know, either.\"</p><br/><p>Then he pointed to the piece of cloth clutched in Ning Que's hand and said, \"Maybe the Ming Volume.\"</p><br/><p>Ning Que took several looks at the cloth and frowningly asked, \"Which volume... is Ming Volume?\"</p><br/><p>The Array Tactical Master made several coughs. He looked at Ning Que and cautiously said, \"As I have said before, I don't know.\"</p><br/><p>Ning Que was enraged and said, \"You do not know anything, then how can I find it!\"</p><br/><p>The Array Tactical Master innocently looked at him and hesitantly said, \"I heard that even the Divine Hall doesn't have the quality to hold the seven volumes of Tomes of Arcane. The Tomes of Arcane are from the Unknown Place, then how can an ordinary one like me to know it?\"</p><br/><p>The words \"Unknown Place\" had made Ning Que's eyebrow even more frowned. He thought of the half-revealed background of Chen Pipi and those little information he occasionally heard in the Academy, then he felt it quite troublesome.</p><br/><p>\"Master, you are the future Master of Nation of Tang Empire and the core disciple of the Headmaster of Academy. Every day, you practice cultivation at the Back Mountain of the Academy and can touch many more things than me. Then you should be clearer of the appearance of the Tomes of Arcane.\"</p><br/><p>Ning Que stiffened and thought, \"Every day he was occupied with cultivation and shooting arrows at the Back Mountain of the Academy and didn't care about those secret legends of the cultivation world at all, nor did he have the opportunity to gossip about such things from Senior Brothers and Sisters. Then shall I tell such things to you?\"</p><br/><p>After the Array Tactical Master left, Ning Que sat beside the window to see the blizzard attacking from the direction of the Wilderness and pondered for a long time.</p><br/><p>It was until today did he realize that he still underestimated himself after entering the Second floor of the Academy. He had never expected that even the legendary things like the seven volumes of Tomes of Arcane should have relations with him. If he could know it, he would have induced Chen Pipi to tell him his background with crab porridge and asked for the secrets of the Unknown Place and the seven volumes of Tomes of Arcane.</p><br/><p>Suddenly, he recalled that the General's Mansion of Tuyang City had assigned people to disguise themselves as trade team to enter the Wilderness, then his eyebrow tip gradually frowned again. Did it mean Xia Hou wanted to get the Tomes of Arcane that had been lost for thousands of years? If so, no matter how difficult it would be, he should make good preparations and arrangements for things he might encounter after entering the Wilderness.</p><br/>\n</div>"}