{"title": "Chapter 208: Chaos in Chang'an (I)", "id": 208, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-208-chaos-in-changan-i", "volume_title": "Volume 3", "body": "<h1>Chapter 208: Chaos in Chang'an (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 208: Chaos in Chang'an (I)</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>All was silent at the southern gates temple at the feet of the imperial city. In fact, it was slightly lonely. The taoist priests and nuns walked along the streets silently, occasionally raising their heads to look at the young taoist before lowering their heads quickly.</p><br/><p>The young taoist had a yellow oil paper umbrella under his arm. His expression was placid and warm. He was the eldest disciple of the Tang Master of Nation, He Mingchi. Everyone in the temple knew that He Mingchi was a good-natured man. However, they knew that the discussion within the hall must have been very important to have someone of his status visit. Nobody dared to bother him.</p><br/><p>In the depth of the taoist temple laid two cushions on the dark wooden floors. Master of Nation, Li Qingshan looked at Master Yan Se who sat across him and said, \"Senior Brother, that person should be heading towards Chang'an.\"</p><br/><p>Li Qingshan would usually return to the looks of his youth, being cheeky and full of laughter, before the Emperor and his respected Senior Brothers. However, his expression was unusually stern and especially serious today.</p><br/><p>Master Yan Se looked at him. His deep-set eyes were devoid of their usual pervertedness. Instead, there was a hidden sadness within them. He said, \"God had barely escaped from that god forsaken place. Why would he come to Chang'an? Who is he looking for? Or is he looking for death?\"</p><br/><p>Li Qingshan smiled. \"Great Divine Priest of Light from the Divine Hall, the second person of Peach Mountain... Someone like this would want to shake up the entire of this city even if he was here to seek death.\"</p><br/><p>Master Yan Se spoke after a moment of silence. \"The reason. I want to know why he's coming.\"</p><br/><p>Li Qingshan retrieved a thin letter and placed it on the dark floors. He said, \"According to the Hierarch Lord's guess, it has something to do with what happened fourteen years ago.\"</p><br/><p>Master Yan Se frowned and did not continue this topic. It was evident that they did not wish to talk about what happened fourteen years ago.</p><br/><p>\"What does the letter say?\"</p><br/><p>\"It is unknown how he escaped from the divine hall, but he managed to escape confinement. Great Divine Priest of Judgment linked his Taoist Heart with the confinement and was injured by the backlash. Many other taoists and priests have been injured or maimed. The divine hall deduced that he would come to the empire and hope that we can capture of killing him at all cost.\"</p><br/><p>Li Qingshan noticed that Senior Brother's gaze deepened when he heard that. He paused before continuing.\" The letter also mentioned that Great Divine Priest of Relation has taken the strongest warriors of Revelation Institute's library towards the border. They are willing to come forth to Chang'an to assist us as long as the court agrees.\"</p><br/><p>\"If it wasn't for the fact that the Great Divine Priest has been injured, and that most of their people from the Judicial Department have been sent to the Wilderness, they wouldn't send anyone from the Revelation Institute. But I didn't think that that old man still had the strength to commit such an incredible act after being imprisoned for so many years. If it weren't for the situation now, he might be able to find the Tomes of Arcane for the Divine Hall if he headed to the Wilderness.\"</p><br/><p>It was uncertain if Master Yan Se was praising him or expressing his regret.</p><br/><p>Li Qingshan's eyebrows rose when he heard of the Tomes of Arcane. He said, \"The Wilderness and the lands above have been in a fervor over this issue. But the tomes have been lost for ages and might not even be in the Desolate Man camp. That's why only the younger generation have been sent to search for it. If you, Senior Brother appear in the midst of man again, you'd definitely have more sway.\"</p><br/><p>Master Yan Se shook his head and did not pursue the line of conversation. \"What did the Emperor say?\" asked he.</p><br/><p>\"His Majesty wanted him dead long ago since he took advantage of the tumultuous times when His Majesty had just ascended the throne. However, His Majesty had made his stand clear. Even if we wanted to kill him, we can only use our own men. We will never allow those from the Divine Hall into our lands to commit the act.\"</p><br/><p>Li Qingshan looked at Master Yan Se in silence. \"Senior Brother, you were very good friends with him then. Let me handle this matter.\"</p><br/><p>Master Yan Se shook his head. He said without expression, \"Since this is a matter of the sect, there is no need to ask for help from the Academy. We cannot hope to kill him just by the strength of the Southern Gates and the Imperial Center Administration.\"</p><br/><p>Li Qingshan replied, \"We cannot decide on things of this world just by impressions alone. Nothing in the world is impossible.\"</p><br/><p>\"He was stronger than you back then. I believe that he is stronger than before now.\" Master Yan Se said directly.</p><br/><p>Li Qingshan smiled slightly, \"In the \"Collections of Huyang\" from the Southern gates, recorded several interesting stories. There used to be a Grand Cultivator of the Knowing Destiny State called Nan Jin. He traveled across the Great River Kingdom and was killed by a little rogue who wanted his money.\"</p><br/><p>Master Yan Se knew what he was trying to say and could not help but furrowed his brow.</p><br/><p>Li Qingshan added tea to his senior brother's cup and said, \"Senior Brother, while I am not of great talent, but I have entered the Knowing Destiny State a few years ago. As the Master of Nation of Tang, I'm still stronger than that little rogue.\"</p><br/><p>\"One can be above God, but still under the Heavens.\"</p><br/><p>Master Yan Se looked at Li Qingshan and said warmly, \"Younger Brother, you have to remember this.\"</p><br/><p>\"Anyone who has the ability to sit on the godly throne of Peach Mountain is someone who has the right to control the beings of the secular world. In the Taoist sect, the hierarch is the most respected and is of the highest status. However, if we just talk about one's Taoist Heart, the hierarch might not be any stronger than the three Gods, much less the Great Divine Priest of Light whom you have your heart set on killing.\"</p><br/><p>Li Qingshan smiled and did not say anything else.</p><br/><p>Yan Se knew that he did not take his words seriously and sighed in his heart. He thought of his friend's character and shook his head, saying, \"Do your best, care not for those that are not easy. Everything is fate and Haotian will arrange it.\"</p><br/><p>Yan Se stared at the dark wood floors in a daze for a long while after Li Qingshan left. His old withered body looked exceptionally lonely in the cold halls and floors.</p><br/><p>He picked up the cold tea before him and dipped his finger in it. He wrote on the floor and wiped his hands on his dirty Taoist robe before leaving.</p><br/><p>The tea water on the floor dissipated gradually, leaving behind only a slight trace. One could still see, if they looked closely, that the word said \"chaos\".</p><br/><p>...</p><br/><p>...</p><br/><p>The old man was called Wei Guangming (Defending the Light).</p><br/><p>He was not called that because he was the Great Divine Priest of Light. He had been named so more than eighty years ago when he was born and only became the Great Divine Priest of light after using the name for decades and enjoyed the respect of millions of disciples.</p><br/><p>He only realised that not only was everything in life the will of heaven, but so was one's name as well. If it wasn't for Haotian making the decision for him to be born to farmers in the Kingdom of Song, how would he have a name like this?</p><br/><p>As the highly respected Great Divine Priest of Light of the Haotian Sect, there were still many willing to sacrifice for him even though he had been imprisoned for more than a decade. There were also many more who were loyal to him in other Taoist temples. Now that he had escaped from the Peach Mountain, there would, of course, be someone who would be willing to take him to Chang'an secretly.</p><br/><p>He got off the horse carriage outside the city walls and walked through the deep Souther Gates tunnel. He walked along the stone path slowly with drooping eyes and a hunched body. He stiffened when he stepped on Vermilion Bird Avenue, as if he felt something, and then he turned eastwards and walked in that direction.</p><br/><p>To those watching, the old man was merely inconvenienced by a bad leg. They did not sense anything amiss. Nor did they know that when the old man's right foot landed on the streets, the stone statue of the Vermilion Bird had opened his eyes slightly.</p><br/><p>The statue shut his eyes again after some time.</p><br/><p>...</p><br/><p>...</p><br/><p>\"What a great formation.\"</p><br/><p>The old man smiled as he thought that to himself. He held his hands behind his back and continued walking on the streets with his back hunched.</p><br/><p>After a moment, he slowed down and stopped outside a certain well at a certain alley. His gaze landed on a withered yellow leaf and his brows furrowed.</p><br/><p>The withered leaf had veins on it and looked odd. However, it did not look odd to the old man. His eyes were able to see through all the darkness in the world. Everything that happened to him seemed as if it was covered by a layer of gauze. The truth was never hidden, but life and fate were.</p><br/><p>The old man held his hands behind his back and walked towards the inn at the end of the alley with his back hunched.</p><br/><p>He shook his head and thought, \"What a great formation.\"</p><br/><p>...</p><br/><p>...</p><br/><p>The great formation of Chang'an had never been ignited and was hidden. The old man could not see the Dark Shadow he had been searching for over fourteen years. However, the great formation that he was in awe of did not show any signs of discovering that he was the strongest of the strong from West-Hill.</p><br/><p>That was because he was not the Great Divine Priest of Light right now. He had held in all his aura and abilities and even forgot his Taoist heart. Right now, he was just an ordinary old man.</p><br/><p>He picked an ordinary inn and stayed in it. He visited the ordinary sights, the ordinary markets and ordered ordinary dishes while drinking ordinary tea. He listened to ordinary songs and spent an ordinary time walking around Chang'an with his hands behind his hunched back like the most ordinary old man in Chang'an.</p><br/><p>When winter came and the cold fronts got stronger, he bought an ordinary thick wool robe.</p><br/><p>An ordinary old man did not need to sleep much. On a certain morning, he woke up as the sky brightened. He walked around randomly and found a stall selling hot and sour noodle slice soup. He bought a bowl after being lured by the aroma. When he was done, someone spilt wine on the front of his robe.</p><br/><p>A young woman carrying a meal box walked over. She looked at the pathetic old man expressionlessly and pulled out a large towel from her sleeves like a magician pulling a rabbit out of his hat. She then wiped the stain off his robes and bought him another bowl of noodles.</p><br/><p>The old man thanked her. She shook her head and left with her meal box.</p><br/><p>The old man was stunned. He handed the bowl of noodles to a beggar from the Yan Kingdom who was even more skinny than he was and followed the young woman.</p><br/><p>The old man followed her to a street called the Lin 47th Street. He spotted a shop called Old Brush Pen Shop and he watched the young woman busy herself within it all day.</p><br/><p>The old man felt that the young woman was a fresh breath of air and was very adorable indeed. Her appearance and aura were that of a clear crystal bead. It would shine brightly when a single drop of sunlight meets it.</p><br/><p>The young woman had slightly tanned skin.</p><br/><p>She was dark but clean, and oh so bright.</p><br/><p>That was why, the Great Divine Priest of Light from West-Hill stood on Lin 47th Street in a daze. He liked her very much indeed.</p><br/>\n</div>"}