{"title": "Chapter 214: Get on the Horse and You're a Thief (II)", "id": 214, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-214-get-on-the-horse-and-youre-a-thief-ii", "volume_title": "Volume 3", "body": "<h1>Chapter 214: Get on the Horse and You're a Thief (II)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 214: Get on the Horse and You're a Thief (II)</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>No one dared to check out what was going on there at night, nor did others, like Ning Que who knew what had happened but did not want to take a look either. Only the next morning did people in the camp discover that the Horse Gangs that had stayed in the north had all disappeared but, they did not have time to be happy as they heard the sound of hoofs and sharp whistles again. The Horse Gangs had shown up again at dawn. What was different was that they kept a distance between them and the people in the camp this time, and were not as arrogant as they were yesterday.</p><br/><p>Zhuo Zhihua severely reprimanded the generals of the Yan forces instead of those girls from the Great River Kingdom who were cultivators of Black Ink Garden because they had different identities after all. Thus, those generals had no choice but to listen as the sulked, and then regrouped the team according to the given instructions. Regardless of the Horse Gangs outside who were hesitant, they went through a gentle slope in the south, and then continued to march towards the palace towards the northeast.</p><br/><p>Only going out of the camp did people see a few dead horses lying in the southwest. They thought that there might have been a chaotic situation there yesterday. Scorched horses had been eaten by wild dogs in the wilderness and the site was awful. There was a trace of white flames left on the gravel, and it looked as though it had been burning the whole night. Both cavalries of the Yan Kingdom and the ordinary carriage drivers were in a total panic, and no one dared to speak.</p><br/><p>In the days that followed, the Horse Gangs continued to follow the grain-delivery team, but they were more cautious. They provoked them but they never launched an attack. It was unknown why the group had been divided into several small teams. Each member nearest to the Horse Gangs that is about ten rides away from the grain team, was equipped with two horses, which obviously showed that they wanted to increase their speed.</p><br/><p>These people had gone deep into the Wilderness, which was not far from the Left-Tent palace. They might only need four or five days to reach there if the elite cavalries could ride as fast as possible. However, the team was marching at a slow speed because the grain carriages and civilians were included in the team now. Looking at their current speed, they would need at least half a month to catch up with the cavalries of the palace.</p><br/><p>After Ning Que spoke these words, they were perplexed about the background of these Horse Gangs, and they could not help but feel confused. Even if they caught up with the cavalries of the palace, there was a possibility that they might not be safe.</p><br/><p>Horse Gangs were walking around,sometimes they assembled and other times they scattered, seemingly the number fluctuated up and down. They always ensured that a certain number could be seen so as to maintain the pressure on the grain team. During these several days, although both sides were not really at war, people of the grain team were undermined by fear of being attacked at anytime and the depressive atmosphere, especially since some civilians looked extremely pale. It looked as if one strike of thunder in the sky could make them fall apart in fear.</p><br/><p>Zhuo Zhihua came to the carriage, looked at those distant Horse Gangs with worry, and then said, \"We must do something to scare these Horse Gangs. If they keep following us in this way, our team might collapse on us even if they don't launch an attack. What's more, it would be beneficial as it would increase the distance between us.\"</p><br/><p>The so-called benefits could not be revealed as this would inconvenience them, but the disciples of Black Ink Garden close to the horse carriage were clearly aware that if the camp collapsed, they as cultivators would be naturally faster and therefore get away, if the Horse Gangs were further away. As for the encounter of the Yan force and the civilians, no one could care less about them in this dangerous Wilderness.</p><br/><p>Ning Que did not participate in the discussion.</p><br/><p>Both the Tang Empire and the Great River Kingdom were both on friendly terms. Ning Que also had a very good relationship with these young girls. However, he was taking them into the wilderness on the basis of their strength only. At this dangerous moment, it was inconvenient for him to make too many comments.</p><br/><p>Apart from that, the more important reason was that his attention was still on the horse carriage.</p><br/><p>On Mo Shanshan, the girl in white with black eyebrows.</p><br/><p>After seeing the fire talisman that night, Ning Que could faintly figure out the identity of the girl in white. Remembering the scene when he traveled back from the wilderness with the disguised princess of Tang last spring, he could not help but marvel at his own destiny and at Haotian's fate. No matter what kind of danger he met, it would be less dangerous for him being with such a person.</p><br/><p>The Cavalries of the Yan Kingdom who guarded the grains were more in number than the Horse Gangs together with the addition of the young disciples from Black Ink Garden. Thus it was hard to tell which side was stronger. Perhaps it was precisely due to this reason that the Horse Gangs had been just tightly encircling the grain team rather than launching an attack. Not even a night attack had been launched after the tragedy of the burning wildfire that night.</p><br/><p>The Horse Gangs did not ambush them at night, but the grain team on patrol could still not relax and instead only got more and more nervous. Maybe no one was able to see, except Ningque who woke up every night, Mo Shanshan in white appear at the border of the camp in the darkness. He knew she was laying talisman arrays.</p><br/><p>This situation lasted for a few days. No matter how strong Mo Shanshan was, her Psyche Power rapidly reduced, and she wasn't able to continue for a longer time. Seeing her round cheeks behind the curtain gradually becoming thinner and paler, Ning Que finally decided to get involved.</p><br/><p>He had learned Talisman Taoism from Master Yan Se, and he knew that the Talisman Masters could only be based on defense and that they were hard to make an attack, before entering the Knowing Destiny State. Although Mo Shanshan was in a high and profound state, she lacked much experience in using Talisman Taoism in combats.</p><br/><p>It was deep at night, and there was no half-moon, but only a few stars, were hanging in the sky. Lights were bright in the camp, while the surrounding Wilderness was enveloped in darkness. No one knew how much danger was hidden there.</p><br/><p>The horse carriage slightly shook with Mo Shanshan's quietly getting off. She was ready to get to the camp to draw talismans and lay arrays. All of a sudden her eyes went dim, she turned around and took a cold glance at the humble tent behind the carriage.</p><br/><p>Ning Que lifted the curtain and came out. He looked at her and said, \"If you were the only person here, the Horse Gangs outside would be certainly unable to resist you. Yet now you're not alone, and you have to take care of so many companions and grain vehicles, not knowing how long it'll last. So if you keep going this way, you won't be able to hold on for much longer.\"</p><br/><p>Mo Shan looked at him as if she was gazing at the dark night behind him, with her eyes full of indifference. She then slightly lowered her eyes with the long and sparse eyelashes gently winking, without saying a word.</p><br/><p>Ning Que quietly stared at her and continued, \"If you're a Divine Talisman Master, you can certainly burn out all the Horse Gangs by drawing a piece of talisman. The problem lies in that you aren't a Divine Talisman Master as of yet, so you have to change your method.\"</p><br/><p>Mo Shan raised her head and looked at him, asking indifferently, \"What method?\"</p><br/><p>Ning Que replied, \"It doesn't matter whether the Horse Gangs out there are true or not; or whether they're raised by the Left-Tent palace or the Yan Kingdom. To deal with them, we must use the way of the Horse Gangs.\"</p><br/><p>The faint starlight falling on Mo Shanshan's beautiful and somewhat dull face reflected her dark eyebrows clearer. She watched Ning Que and asked after a moment of silence, \"What way?\"</p><br/><p>\"There's only one possible reason why the Horse Gangs would turn back, that is, profit. They'll naturally retrieve as long as they're assured that the price they pay will go beyond their profits.\"</p><br/><p>Ning Que continued, \"It is clear that the information that these Horse Gangs have doesn't mention you, and they don't know of your existence, so they will be forced to change their plan. Under this circumstances, we have the upper hand.\"</p><br/><p>Mo Shanshan quietly looked at him, and suddenly asked, \"Do you know who I am?\"</p><br/><p>Ning Que did not answer this question.</p><br/><p>Mo Shan repeated the previous question, \"In what way can we get rid of these Horse Gangs?\"</p><br/><p>Ning Que answered, \"The so-called Horse Gang while on the horse he's a thief, when off the horse he's a civilian. They don't believe in moral judgment, and they even don't mind what the world trend is. Instead, they only care about whose knife is sharper. If we want to deter or shock them to retreat, just do as I said earlier, the way of the Horse Gangs.\"</p><br/><p>Mo Shanshan continued to repeat, \"What way?\"</p><br/><p>Ning Que looking at the girl's pretty but indifferent cheeks. He then suddenly laughed and said, \"As I've said earlier, the way of the Horse Gangs.\"</p><br/><p>He was very persistent and bored, but more so with Mo Shanshan. She continued to repeat, \"What way.\"</p><br/><p>Ning Que shook his head with a smile, and replied, \"We get on the horses, become thieves and go and kill them.\"</p><br/><p>Mo Shanshan concisely said, \"I won't kill people.\"</p><br/><p>Ning Que simply said, \"I can teach you.\"</p><br/><p>Mo Shanshan simply answered, \"Ok.\"</p><br/><p>A moment later, Ning Que and Mo Shanshan respectively led a big black horse and a fine white horse, and walked slowly towards the dark Wilderness outside the camp. Mo Shanshan suddenly asked with the night breeze blowing in her beautiful hair,\" Where do these horse Gangs come from?\"</p><br/><p>He could not make an accurate judgment about the Horse Gangs who stayed around and seemed to ambush at any time -- he was acquainted with the Wilderness in the west and the Horse Gangs in the Wilderness. Furthermore, if he was to start with the cause of the problem, he also lacked enough information and analytical ability of the political situation.</p><br/><p>The grain team that was supervised by the girls from the Great River Kingdom carried the goodwill of the Central countries , as well as the intent of making peace with the Divine Hall. Now due to the tensions in the Wilderness, the original Horse Gangs had already fled away. These Horse Gangs that appeared here, obviously wanted to kill people and grab the grains but their main purpose had nothing to do with the grains, but instead sabotage the peace negotiations.</p><br/><p>There were a few reasons for this. The tribes of the Desolate Men who had moved southwards from the extremely cold northern part would not be able to raise such a large group of Horse Gangs in such a short period of time. Even if the Yuelun Kingdom would like to harm citizens of the Great River Kingdom, no one would be so bored and evil as to occupy a mild stream. Yan Kingdom had long been afflicted by the Left-Tent palace. Therefore, they would not want to miss the opportunity to pacify the North in one stroke. However, would the empire of the Yan risk taking a secret shot and offend the Divine Hall?</p><br/><p>After much deliberation, Ning Que was only able to come up with several simple possibilities. After all the deductions, he couldn't figure out who else was capable of raising such a large group of Horse Gangs on the grassland.</p><br/><p>However, not being able to resolve this question did not really trouble him. With regard to the creature, Horse Gangs, whom he had been fighting with for many years, Ning Que 's attitude had always been clear - only the dead Horse Gangs were good ones.</p><br/><p>Then, he would kill a dozen Horse Gangs that strayed to close to him.</p><br/><p>There was a cloud drifting over the night sky, hiding the last few stars. The surrounding Wilderness, far away from the light of the camp, was dark. Only the weak sounds of hooves were faintly heard.</p><br/><p>Coming to the meadow that was within a stone's throw away distance to the hidden location where there were a dozen Horse Gangs, Ning Que gently lifted the reins. The big black horse shook its head with some impatience, but still stopped as required.</p><br/><p>Horse Gangs were certainly vigilant. Even the weakest sound of hooves would wake them up.</p><br/><p>Ning Que, with the slight strength of his waist and abdomen, placed his feet on the pedal to stand up, and then took the boxwood bow out from his back.</p><br/><p>Mo Shanshan gave him a glance, thinking what was the point of using arrows when they were so far away from them.</p><br/><p>The Horse Gangs in the distance were awake, ready to confront the fight.</p><br/><p>In the dark night, Ning Que could not see his five fingers that were holding the bow, so he quietly stared at that place and then slowly closed his eyes. He drew his bow and aimed somewhere, and then released the bowstring.</p><br/><p>The bowstring was buzzing in the sky.</p><br/><p>A Horse Gang in the distance was hit by an arrow in the chest, and a pinch of blood burst out. He then fell to the ground with a muffled groan.</p><br/>\n</div>"}