{"title": "Chapter 222: Victory, has Nothing to Do with Light", "id": 222, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-222-victory-has-nothing-to-do-with-light", "volume_title": "Volume 3", "body": "<h1>Chapter 222: Victory, has Nothing to Do with Light</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 222: Victory, has Nothing to Do with Light</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The commander of the cavalryman of Divine Hall emotionlessly looked at the lower part of the meadow, caring nothing about the lives of those people on the grain team in the camp. He just wanted to see whether he could have an appropriate opportunity to dispatch his troops during the chaos.</p><br/><p>From the lower part of the meadow there suddenly passed a fierce shock of Qi of Heaven and Earth, and the strong and subtle-stated aura of Talisman Taoism was clearly and directly reflected in his sense of perception, resulting in a dramatic change in his emotion.</p><br/><p>Quni Madi was a stone-hearted old woman. The wrinkles on her face didn't move a bit when she saw those flocks of Horse Gangs waving their Curved Knives towards civilian workers of the Yan Kingdom who had no little time to escape.</p><br/><p>But when the horse carriage broke into pieces, the girl in white floated out into the air and drew the talisman. All the wrinkles on her face suddenly changed from the stony lines to disorderly catkins in the wind which were all piled up in a state of shock and amazement.</p><br/><p>\"She's the Talisman Master from the camp!\"</p><br/><p>\"Should she actually draw Infinitive Talisman? Does it mean she has entered the Knowing Destiny State?\"</p><br/><p>Quni Madi with a sombre expression, looked back at the carriage in the midst of the cavalry, and secretly thought about how her beloved niece would react if she knew.</p><br/><p>The curtain of the horse carriage was tightly closed, and the girl as tranquil and pure as orchid had perceived the terrible power of the talisman from below the meadow and gradually raised her head. A a faint feeling of realization came over her face, and then she softly said to herself, \"It's sister Mo.\"</p><br/><p>She figured out the identity of the Talisman Master across the curtain just by the fluctuation of the talisman power. It seemed that this young maiden was not totally unaware of what was happening below the meadow outside the horse carriage.</p><br/><p>...</p><br/><p>...</p><br/><p>The Half Divine Talisman changed into an invisible, high-speed air mass and instantly broke the air above the camp like the mighty fists of the gods. It blew out a huge hole in the firewall and more than ten horsemen were killed by the shock. Then it came to the leader of Horse Gang and suddenly condensed with the winter wind.</p><br/><p>The leader of the Horse Gang knew that now was the crucial time to test his mettle. So with a stuffy groan, his fingers hanging beside the saddle trembling fiercely,his thumb slightly and speedily tapped the lines of his middle and index finger. By doing so, he forced out all his Psyche Power in the sense of perception mercilessly.</p><br/><p>The dense Psyche Power that had been accumulated from over ten years' of meditation was forced out and suddenly collided with the power of Divine Talisman attacking head-on. The collision of the two strange powers had produced numerous weird white lines around the leader of Horse Gang.</p><br/><p>Those white lines were tiny torrents in the air, which flew at a different speed from the surrounding air, thus appearing white because they produced deviated refraction of light.</p><br/><p>It could break the blank air so fiercely and make it roar at very tiny points. How terrible it was for the Half Divine Talisman and the power that a great Psyche Master had accumulated for over ten years to collide with each other.</p><br/><p>In the numerous air torrents filled with madly-drifted catkin, several blood drops splashed out from the corner of the Horse Gang leader's eye, and the horse's foot-steps retreated in a tumultuous and confused way.</p><br/><p>Because of the overwhelming power of this unfinished Divine Talisman, the Horse Gang leader had to condense all his Psyche Power to confront it and attack the falling Psyche Power of Ning Que who was squirting blood. It was only natural that his mind went blank for a very short period.</p><br/><p>Over ten thousand steel needles in Ning Que's sense of perception suddenly disappeared and the pain lingered in his mind. But finally he woke from the faint and muddled-state and remained sober for a while.</p><br/><p>This brief moment of soberness was more than enough.</p><br/><p>He drew out the big black umbrella from behind his back and shook his wrist. The thick cloth was torn, and the big black umbrella, which had not seen the sun for months, came to light, and bursted open like a black lotus on his head.</p><br/><p>The big black umbrella slowed down the speed at which he fell down and prevented him from falling to his death. The key point was, the surface of the big black umbrella which looked extremely greasy and dirty absorbed most of the terrible Psyche Power attacking from below.</p><br/><p>When his body was still drifting in the air, Ning Que dropped the knife downwards.</p><br/><p>Now there was still some distance between him and the Horse Gang leader below, so the podao couldn't chop his enemy. However, needles were successively shooting out from his wrist to break the air and directly probed in the eyes of the Horse Gang leader along a strange, unpredictable and invisible line like what happened every day at the Back Mountain of Academy!</p><br/><p>The Horse Gang leader was a great Psyche Master at Seethrough State and his state of cultivation was almost the same as Mo Shanshan, the girl in white. However, it was still difficult for him to fight against the unfinished Divine Talisman and his whole body was restrained by the fatal primordial Qi in the air.</p><br/><p>What was even beyond his expectation was that Ning Que, who had obviously been badly injured and was about to die, had hidden such a skill. The trace of silver needle, which was almost invisible because of its high speed, was about to probe into his eyes, yet he could only forcily lower his head at the risk of being hurt by the torrent of primordial Qi before him.</p><br/><p>\"Poof!\" The silver needle probed into his brow ridge in an instant!</p><br/><p>The needle was so deeply probed in that nobody could trace its end, and then a drop of blood like a port-wine mark immediately appeared.</p><br/><p>The Horse Gang leader felt a sharp pain in his brain and then everything before his eyes went black.</p><br/><p>The darkness was not caused by the pains, it was just really dark.</p><br/><p>Because the big black umbrella fell before him.</p><br/><p>Under the big black umbrella, Ning Que clearly and directly waved his podao out.</p><br/><p>In an instant, the blade cut into the body and broke the bones.</p><br/><p>In a flash.</p><br/><p>An arm flew to the sky.</p><br/><p>...</p><br/><p>...</p><br/><p>A terrible bloody scar appeared on the right shoulder of the Horse Gang leader, blood gushing out like a fountain. The force of the podao still remained, so he yelled painfully and with a howl, he fell off his horse's rump and fell heavily to the ground.</p><br/><p>Before he fell down, his skinny right hand pointed at Ning Que who was about to land on his back and abruptly open it.</p><br/><p>Ning Que was rather badly wounded. His chest felt like it was suffocating and gushed out blood again. Finally he fell down.</p><br/><p>He exactly fell down on the horse of the Horse Gang leader.</p><br/><p>He was not aware of the fishy sweet smell between his lips and tongue . Before losing his consciousness, he chopped his podao again towards the Horse Gang leader, yet this time, what he chopped was not the Horse Gang leader who had already been chopped off, but the crupper.</p><br/><p>A deep bloody scar suddenly appeared on the crupper.</p><br/><p>The horse, which was startled by the pain, crazily rashed to the front and collided head-on with the burning firewall!</p><br/><p>...</p><br/><p>...</p><br/><p>Then another hole on the firewall in the camp was made below the transparent hole previously produced by the penetration of the Divine Talisman into the firewall.</p><br/><p>A burning horse carrying the badly-injured and feeble Ning Que rashed ahead and ran wildly through the hole with yells. Its horsehair and horsetail had already been burnt into ashes and almost devoured by the violent flame.</p><br/><p>The inferno caused by the Fire Talisman was so terrible that the horse forcibly ran through it and was burnt to death instantly and flopped to the ground. Ning Que, who was lying on its back, fell down to the ground at the same time and came to a halt after several rolls.</p><br/><p>Despite the protection of the big black umbrella, the corners of his clothes were still spitting flames, which might at any time turn into a big flame. He sat down on the ground and turned his head and looked around. His voice was hoarse and he shouted, \"Water!\"</p><br/><p>Under his previous order, the Cat Girl prepared a big bucket of clear water and waited by the side. She didn't participate in the defense and she was anxious as she witnessed her Senior Sisters fighting a bloody battle with the Horse Gangs. She couldn't wait to kick the bucket over and never expected that the situation of the battle could change so dramaticly. It was only until now that she understood Ning Que's earlier intentions.</p><br/><p>With a swoosh sound, the whole bucket of water was poured over Ning Que, which put off the burning flames on Ning Que's clothes in an instant. He was as weak as a cat and was directly knocked to the ground by the pouring water.</p><br/><p>The Big Black Horse approached him at a high speed from one side of the camp. The horse appeared to be anxious, lowering its head and constantly rubbing against Ning Que. It seemed to worry that if Ning Que fell down, he would no longer stand up again.</p><br/><p>Falling to the wet ground, Ning Que was really too weak to stand up. Luckily he didn't lose consciousness and still opened his eyes.Looking at the horse's face, which was very close to his face, he drew a smile with great difficulty.</p><br/><p>From the beginning of the fight till now, especially the last moment when he killed the Horse Gang leader,he encountered numerous extremely dangerous situations and countless suffering. It was man's instinct to automatically fall into a coma when confronting unbearable mental and physical sufferings. However, he seemed to have some talent when it came to fighting against his physical instincts and managed to maintain his last bit of soberness.</p><br/><p>With a great deal of difficultly, he raised his right arm and put the big black umbrella, which was even more dirty presently, on his chest, and then he put the ace-pack that had been constantly tied to his middle finger in his arms.</p><br/><p>It was only when he had done these two things that he was truly relieved, but he was still strong and determined not to faint from his lack of energy. Thrusting his knife into the wet ground next to him, he stood up with a muffled grunt, looking at the fighting around the camp, and trying to help, only to find that his body had been badly hurt by the Psyche Power.</p><br/><p>Probably he would not die because he had done what he had to. As for those who were still fiercely fighting with each other around the laager, he was powerless to change them.</p><br/><p>Something came to Ning Que's mind and he turned back to have a look.</p><br/><p>In the messy camp, the horse carriage that had been blown into pieces was presently only left with its lower body plate. On the plate sat Mo Shanshan, whose white clothes were covered in mud.</p><br/><p>The maiden Talisman Master had forcibly used the Divine Talisman which could only be exerted by a Divine Talisman Master. It was more than she could handle and she was seriously counter-attacked by her own talisman, which, coupled with the exhaustion of the Psyche Power in her sense of perception, had directly made her fall into a coma in the air and she fell down.</p><br/><p>Perhaps it was due to the shock that Mo Shanshan had now awakened.</p><br/><p>She slightly lowered her head and her hair on her forehead was in a mess. She pressed her right hand on the ground to support herself and her long and thin eyelash which could be faintly seen among her hair were constantly trembling. All that could be perceived on her face was feebleness, as if she might faint again.</p><br/><p>Suddenly thunderous hoofbeats were faintly heard from the far distance. Looking at the gust of dirt that had been stirred up on the meadow, Ning Que knew that the cavalryman of Divine Hall had started to act as he had expected. Then he said to the Cat Girl beside him, \"Later when you clean the battlefield, look for my two podaos.\"</p><br/><p>...</p><br/><p>...</p><br/><p>The firewall on the front of the camp was intended to give Ning Que an opportunity to kill the Horse Gang leader, yet it didn't cover an area large enough to ward off those Horse Gangs. During the previous tangled fight, the Horse Gangs yelled and waved their curved knives and rushed in when the laager consisting of plates and hay bags was already badly damaged. Those disciples of Black Ink Garden, holding their sharp knives, fought against the enemy with great determination, but the fight took a heavy toll on those soldiers and workers of Yan Kingdom in a very short time.</p><br/><p>At the moment, the Horse Gang leader was missing. Nobody knew whether he had been taken away by his trusted subordinate because of his serious injury, or if he had died and his corpse stamped into the mud by the hoofbeats. This had greatly impacted the Horse Gangs and the assaulting queue was in an array of disorder. Moreover, the defense forces in the camp were on the edge of great danger.</p><br/><p>If the cavalryman of Divine Hall on the upper part of the meadow remained unmoved at the moment, then who could predict whether the camp would be slaughtered or the flock of Horse Gang would collapse under unbearable pressure.</p><br/><p>Those big wigs in the meadow were all shocked by the astounding Half Divine Talisman that Mo Shanshan previously drew, yet they neglected Ning Que who jumped over the firewall and finally killed the Horse Gang leader.</p><br/><p>The commander of the cavalryman of Divine Hall had felt something, his sharp eyes had faintly noticed the trace of a figure on the other side of the burning firewall, but he didn't know what exactly was happening at that time. But... he saw the badly-injured Horse Gang leader forcibly taken away by several riders and the current mess of the flock of Horse Gang who were about to be defeated.</p><br/><p>The cavalrymen of Divine Hall who refrained from rushing downwards from the meadow to save those in the camp were afraid of the two or three hundred tough Horse Gang who were heavily guarded and still good at fighting, so the commander didn't want to take the risk of losing the noble lives of the cavalrymen of Divine Hall. But presently, the Horse Gang leader was dead and the Horse Gang was about to collapse. This was the time for the cavalrymen of Divine Hall to show their power and accumulate their battle achievement. As a commander who was excellent in fighting, he would definitely seize this opportunity.</p><br/><p>\"The Horse Gang is massacring followers of Haotian, so as the Papal Guardian of Divine Hall, you know what you should do.\"</p><br/><p>The commander of cavalrymen of Divine Hall drew out his official sword from his waist and pointed towards the extremely chaotic and bloody camp on the lower part of the meadow and said sternly. The sunlight shone over his solemn and upright face, which had a righteous countenance and looked holy.</p><br/><p>\"For the light, go!\"</p><br/><p>Under the instruction, a hundred cavalrymen of Divine Hall moved ahead, with weapons carved with Fu characters tightly held in their hands. They raised their whips to order the horses to rush to the campsite from the upper part of the meadow with high speed, which stirred up a large amount of gravel.</p><br/><p>Their black armour, painted in a complicated golden design, looked like countless sunflowers blooming under the sun and shining brilliantly. Those cavalrymen of Divine Hall initiated their rescue effort with an upright and brave spirit.</p><br/><p>Faced with the Papal Guardians who had the finest cavalry in the world, the Horse Gang, who had fought for half a day and were almost exhausted, sank into a state of panic and confusion because their heavily-injured leader had left, thus they had no power to resist them and retreated in defeat.</p><br/><p>Even the strongest and most ferocious Horse Gangs couldn't defeat ordinary cavalrymen of Divine Hall, not to speak of their curved knives, which were as fragile as a branch or wooden sticks compared to the talismans of the cavalrymen of Divine Hall.</p><br/><p>It didn't take long for the cavalrymen of Divine Hall to defeat all the Horse Gangs around the camp. The idea and plan of the commander had been perfectly executed at a low cost.</p><br/><p>Light, won the victory again.</p><br/><p>...</p><br/><p>...</p><br/><p>The six hundred Horse Gangs suffered heavy losses from death and wounds, with the remaining ones escaping to all directions. The cavalrymen of Divine Hall had to clean the battlefield, chop off the heads and protect the noble on the upper part of the meadow, so they just chased the fleeing Horse Gangs as a symbolic pursuit, that gave the Horse Gangs, who previously fought with the cavalry of Yan Kingdom, a chance to escape away from the battlefield.</p><br/><p>The fight on the meadow was violent, and the fight between the two hundred cavalrymen of Yan Kingdom and the Horse Gangs was equally horrific. At this moment, only forty of them rode back to the camp and all of them were somewhat injured.</p><br/><p>The fight which started in the morning had caused people to die constantly. But thanks to the laager and the braveness of Black Ink Garden disciples, the number of the dead was not huge. On the contrary, the most grievous casualties appeared during the last period of the battle. Since the broken laager and Mo Shanshan who had used out all her Psyche Power could no longer protect more people, countless soldiers and worriers of Yan Kingdom were killed by the curved knives of Horse Gang.</p><br/><p>A young male disciple of Black Ink Garden was besieged by several Horse Gangs and died in a horrible way.</p><br/><p>Zhuo Zhihua and other girls from the Great River Kingdom stood numbly before his Younger Brothers dead body, their eyes were filled with sorrow and indignation. The Cat Girl, the youngest one of them, had already burst into tears and her eyes were all swollen up.</p><br/><p>The was an air of sadness in the camp,and and there was a sound of heavy hooves outside the camp.</p><br/><p>The cavalrymen of Divine Hall had turned back from the short-distance chase of the defeated and dispersed Horse Gangs and had regrouped.Their black and gold-plated armor gleamed in the sun, and their orderly processions seemed to be full of order and power.</p><br/><p>If these were ordinary times, those soldiers and workers of Yan Kingdom who believed in Haotian Taoism would probably show admiration and enthusiasm towards them out of their absolute respect to the West-Hill Divine Palace, or would have even knelt down on the ground and bowed sincerely. However, presently they were too sorrowful to notice the cavalrymen of Divine Hall outside the camp. Those who occasionally looked at them appeared to be indifferent and their eyes faintly revealed a sense of hatred.</p><br/><p>If these cavalrymen of Divine Hall had rushed to help them instead of waiting on the meadow, they would definitely have defeated the Horse Gangs with the cooperation of the disciples of Black Ink Garden, especially that powerful girl Talisman Master. However, they didn't and this directly caused the heavy casualty on the camp at the end.</p><br/><p>Many cold dead bodies now lying on the ground in the Wilderness should have been warm, and many dead ones should have survived and returned to Yan Kingdom to see their beloved ones. However, all this would not be possible because of the selfishness and cruelty of the cavalrymen of Divine Hall.</p><br/><p>Therefore, nobody in the camp would welcome the cavalrymen of Divine Hall.</p><br/><p>Men never see the back of their heads, and light never finds its own darkness, especially when you think too highly of yourself and when you regard yourself as the absolute light.</p><br/><p>The cavalrymen of Divine Hall who lined up outside the camp, did not think there was anything wrong with their earlier inaction. At the time, the Horse Gangs were still energetic and strong to fight, and should they have let their noble cavalrymen of Divine Hall to fight for those ordinary civilians and shed blood? On the contrary, in their mind, the Horse Gangs were finally defeated because of them. They protected the lives of those presently in the camp, so they were qualified to be praised and appreciated, rather than treated so coldly and with such hostility.</p><br/><p>The different and solemn faces of some cavalrymen of Divine Hall even revealed a sense of contempt and indignation. But for the silence of the commander, they would have easily rushed into the camp, drown out those civilians who dared to cast hostile eyes towards them and whipped them bitterly.</p><br/><p>Looking at their indifferent faces , and thinking of their earlier shameful aloofness and their present disgusting expression, the Cat Girl flushed in anger. She wiped away her tears and was about to rush towards them and curse them out.</p><br/><p>Zhuo Zhihua drew her behind and forcibly suppressed her sadness and indignation. She bowed before the commander of the cavalryman of Divine Hall riding high on the handsome horse and then led her younger sisters to deal with the affairs on the camp, saying nothing.</p><br/><p>All those left were distressed. The soldiers and workers of Yan Kingdom had wounds all over their bodies, so they supported each other. Looking at the scattered dead bodies of their compatriots, and their broken arms and legs and the blood, it was impossible to feel happy that they survived a big disaster. Many of them began to yell with tears, and the whole camp was shrouded in thunderous cries.</p><br/>\n</div>"}