{"title": "Chapter 233: Would I Tell Lies (I)", "id": 233, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-233-would-i-tell-lies-i", "volume_title": "Volume 3", "body": "<h1>Chapter 233: Would I Tell Lies (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 233: Would I Tell Lies (I)</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Looking at that black horse taking off with such speed, many herdsmen and Palace soldiers chased after it in excitement. However, students of the Revelation Institute were still silently standing on the meadow. Many of them had already guessed Ning Que's real identity. Remembering the matter that had been kicked around in the cultivation world from spring to this moment, they could not help worrying about Princess Chen Jia's emotional state.</p><br/><p>Princess Chen Jia's fiancé was Prince Long Qing. This excellent man had lived a good life. Neither the Elder of Lanke Temple nor the chief of the Revelation Institute could break his perfect inner and outer composure. He was only defeated once in the mountaineering of the Academy in the south of Chang'an, although not many people knew the specific circumstances of that event. Nevertheless, failure was failure.</p><br/><p>Is today the day when Lu Chenjia first meets the man who defeated her fiancé? Students of the Revelation Institute worried that she might feel depressed, hence, they did not dare to look at her, which probably caused her to feel embarrassed and angry. They had to slightly lower their heads, seeming to look unwittingly at the ground of the Wilderness.</p><br/><p>Seven Lotus Petals were scattered everywhere on the meadow making a big mess. There was no sign of embarrassment on Lu Chenjia's pretty face, but her calm mind which resembled peaceful water began to be restless.</p><br/><p>After pulling out a rare scarf from the side of the saddle of her Snow Horse, she walked to the broken flower pots, and picked up the lotus that was almost withered and that had turned black in the cold wind, and then carefully wrapped it up. She mounted the horse with the lotus in her arms, and then rode towards her own tent.</p><br/><p>One of the disciples of the Revelation Institute behind her picked up the courage and reminded her, \"Your Highness, today the Divine Hall will have a meeting to summarize the border issues that have arisen in the past few months and to discuss a plan on how to deal with Desolate Men next year. It's important that you attend the meeting.\"</p><br/><p>Lu Chenjia lightly lifted the reins, without ignoring the voice behind her or the meeting that the Divine Hall called. Instead, she silently watched the distant big black horse that was approaching the tent while lost in deep thought.</p><br/><p>After the news of the opening of the second floor of the Academy in spring came out, she quietly paid attention to the Second floor. She prayed that her partner would get his own reward and enter the Back Mountain to become one of the core disciples of the Headmaster of Academy. However, she did not expect that such a proud and confident guy who seemed unlikely to be defeated, actually... failed.</p><br/><p>Since then, Prince Long Qing returned to West-Hill. Although they never discussed the matter on the Second floor of the Academy, she could clearly feel that there were some subtle differences between the present Longqing and the former Longqing. He was still proud and confident full of dazzling glory, but under his proud exterior there was something hidden that was unclear and unnatural, and a very pale black shadow clouded his glory.</p><br/><p>Lu Chenjia knew that all this was caused by that guy, Ning Que.</p><br/><p>For people like Prince Long Qing and her, failure was not a terrible thing. They had accurately understood the relationship between failure and success at an early age when the started learning cultivation. However, Longqing was at a very high cultivation state with a clear Taoist Heart, only one step away from the Knowing Destiny State, while the guy called Ning Que had just learned the cultivation, weak in strength and low in the cultivation state. When there exists such a huge gap in cultivation, defeat by a person of a lower cultivation could be an unimaginable blow to the mental state of Taoist cultivators.</p><br/><p>In a relationship between two people, generally one's joy and sadness are always based on that of the other one, while ignoring the joy and sadness of the outside world. As for the guy who defeated Longqing to enter the Back Mountain of the Academy, she certainly disliked him to the point of hostility. If it wasn't that the barrier of the Taoist Heart could only be lifted away by Longqing himself, she might have even gone quietly to Chang'an and humiliated that guy.</p><br/><p>Other than feelings of hostility and displeasure, she was inevitably a little curious about him. She, just like everyone else, did not think that the Headmaster of Academy would practice favoritism in receiving disciples and that the Academy would use shameless tricks to recruit students. Then, what on earth made that guy named Ning Que to be better than Longqing in the eyes of the Headmaster? What kind of person was he?</p><br/><p>Today she finally saw him, and finally knew what kind of a person he was.</p><br/><p>She believed that she would never forget Ning Que's vicious and bitchy appearance when he smashed the flower pots and taunted her. In spite of this, she still could not forget the time he had spent in the Academy. She felt miffed and embarrassed.</p><br/><p>She grasped tightly on the reins with her fine hands, watching senselessly the Big Black Horse in the distance. The horse that was going to enter the tent was being chased by many people. She silently thought in her heart, \"Are all disciples of the Back Mountain of the Academy as shameless as Ning Que?\"</p><br/><p>...</p><br/><p>...</p><br/><p>The countries in the Central Plains were ordered by the edict of the Divine Hall to help the Yan Kingdom resist the barbarians. The Tang Empire and the Yan Kingdom were located in the North frontiers, and sent a large number of cavalrymen. The other clans of the Central Plains sent their younger generation of practitioners to come and serve their orders. Now that the Allied Forces had made peace with the Royal Court, it was only natural for the forces of the various countries to come together and plan for the future. There was no doubt that the convener was also the Divine Hall.</p><br/><p>The Left-Tent palace spent a lot of manpower and materials putting up a fairly large tent where the bigwigs of the Divine Hall would discuss business. They had shown their sincerity. The tent had a circumference of about a hundred steps. It used the bamboo as the backbone and all its components were stretched together by the use of cloth. There was adequate light in the tent. It was so spacious that even if there were hundreds of people staying together inside the tent, it wouldn't seem crowded.</p><br/><p>The Priest of the Revelation Department of the Divine Hall was the most distinguished person in the tent. He was naturally sitting in the middle position. On his right hand sat Shu Cheng, General of the Tang Empire, but on his left the position was empty.</p><br/><p>Generals of Yan Kingdom, disciples of Sword Garret of South Jin Kongdom, monks of White Tower Temple of Yuelun Kingdom, and other disciples of the sects of smaller tributaries were all sitting at their proper positions according to their rankings. Seats for the disciples of Revelation Institute were still empty, while the Calligraphy Addict, Mo Shanshan, and disciples of the Black Ink Garden of Great River Kingdom had already sat idly on the seats on the opposite side.</p><br/><p>The positions of the disciples of Black Ink Garden were close to the people from the Tang Empire, ranking higher than those of South Jin Kingdom and, Yuelun and other countries. The Great River Kingdom was weak, and they would not have such a courteous reception. Mo Shanshan was so famous for being a Calligraphy Addict that no one in the tent, except for a few people, was eligible to sit on her left-hand seat, thus the Divine Hall had no choice but to make this exception.</p><br/><p>The proceedings had not yet got to the point. At this time, an old woman with white hair and wrinkled skin in a ragged garment was walking slowly into the tent, with a crutch in her hand, coughing from time to time.</p><br/><p>The Priest of the Revelation Department bowed to show his respect. He then smiled and said, \"Sorry to trouble you, Aunt.\"</p><br/><p>Including Shu Cheng General, all people in the tent stood up and saluted the woman, the elder sister of the Lord of Yuelun Kingdom. Although she abandoned the title of Princess Royal because of cultivation, powerful Buddhism Sects and temples hid behind her. Both the Divine Hall and the Tang Empire would not neglect her.</p><br/><p>Mo Shanshan did not stand up. Instead, she just quietly looked at the lower hem of her white dress, as if she had found some unpleasant dirt there. She did not get up to show her respect, neither did the disciples of Black Ink Garden who was behind her. These girls knew that the old woman was on the meadow that day, thus they all revealed some hatred in their eyes.</p><br/><p>If everyone was drunk and only one was sober, then the one who was awake would become the odd one out. If all people stood up and only one was seated, then the one who was seated would become the odd one out.The bustling sounds from people in the tent who were exchanging pleasantries with the old woman and the scene of waves of people bowing down one after another, made the girls from the Great River Kingdom who remained seated stand out. It gradually quieted down in the tent, and the atmosphere suddenly became quiet and strange.</p><br/><p>Aunt Quni Madi glared at the girls, who still looked refreshed and pleasant from their month away in the wilderness. She was angered by their lack of respect and by the hostility in their eyes. She was even more furious when she waved her sleeves to sit by the Priest and without waiting for anyone to speak, she said in a gloomy voice, \"The North wilderness tribes have an inseparable relationship with the Devil's Doctrines. No one knows exactly how many evils of the Devil's Doctrine still hide in the Desolate Men. To punish and dispose of evils is inevitable for people like me, thus it was not hard work. However, the first step in dealing with Desolate Men is to strengthen our own ability by fostering internal solidarity in the sects. \"</p><br/><p>The old woman looked at the young disciples of the younger generation in the tent, and then said in a cold voice, \"You performed well during these few months of fighting. However, some of you behaved improperly and the result was terrible, which nearly ruined the event of the Divine Hall. Whether you'll get punishment or not, I think you should do some self-reflection first.</p><br/><p>By this time, most people in the tent had already understood that the disciples of Black Ink Garden had escorted the grains here and that they were attacked by Horse Gangs. They thought that Aunt Qu was probably talking about this matter, and they did not know how the Calligraphy Addict and the disciples of Black Ink Garden would explain the situation.</p><br/><p>As expected, Quni Madi revealed a sense of scorn and slight anger in her deep eyes. She then said in a cold voice, \"In order to foster cordial relations with different countries, the Divine Hall decided to aid the palace by sending forage. Now that batch of forage has been totally destroyed. Although Chanyu did not say anything, and the agreement didn't go wrong, someone needs to take responsibility for this, as Haotian is always upholding justice.</p><br/><p>Hearing how the respected Aunt directly made that clear, the tent fell into a deep silence and only some long-short breath could be vaguely heard. Many people turned to look at Mo Shanshan who had been sitting silently.</p><br/><p>Hearing these words, the Priest smiled. He was aware that the old woman was not pleased with Black Ink Garden and wanted to take advantage of the issue to elaborate her own ideas. Nevertheless, he was told by the Great Divine Priest of Relation when he left to come here that Mo Shanshan was a recluse. If they wanted her to become the backbone of the Divine Hall in the future, she still needed to be sharpened. So he did not comment on the issue.</p><br/><p>General Shu Cheng came a long way from Chang'an City, but did not care about these internal fissures in the Divine Hall. Yet the Empire had been friendly with Great River Kingdom. Now he was a bit displeased seeing that girls of Great River Kingdom were under the coercion of Quni Madi. He then slightly frowned and asked, \"What happened on earth?\"</p><br/><p>The Priest of the Revelation Department through his beard and hair had all turned white, he still looked very young. After giving it some thought, he said mildly, \"Chen Bachi, the commander of the Papal Guardians of the Judicial Department has personally experienced the matter. Let him tell you.\"</p><br/><p>These words seemed arbitrary, but in fact extremely subtle. The Papal Guardians of the Divine Hall were governed by two Priests of the Judicial Department, and they had nothing to do with his Revelation Department. It was because of this reason that he let the commander give his comments, knowing that no matter what happened afterward, the Revelation Department would keep out of the affairs and maintain a transcendent and fair position.</p><br/><p>That guy named Chen Bachi who was the commander of the cavalryman of Divine Hall looked at the crowd in awe and said, \"... that day the disciples of Black Ink Garden faced the battle with cowardice and fear. They actually let the Horse Gangs break into the camp, and the soldiers and civilians of Yan Kingdom suffered great casualties. I saw that things were going wrong, so I took the risk and led the troops in a surprise attack, and they finally surrounded the Horse Gangs...\"</p><br/><p>The disciples of Black Ink Garden looked at each other in despair as cold chills run down their bodies. They were speechless and their clenched fists slightly trembled. They had been living in Mogan Mountain since childhood, and they were shocked that there was such a shameless guy in the world.</p><br/><p>Cat Girl's face was flashed, and she shouted angrily at the commander of the cavalry, \"Chen Bachi, Shame on you!\"</p><br/>\n</div>"}