{"title": "Chapter 246: Breaking the Confinement", "id": 246, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-246-breaking-the-confinement", "volume_title": "Volume 3", "body": "<h1>Chapter 246: Breaking the Confinement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 246: Breaking the Confinement</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The curtain was lifted up, bringing wind along with snow into the room. It made the dim bonfire flicker suddenly and almost die out, and the temperature inside decreased sharply. It was so cold that the breath of the Desolate mother and her son, who were sleeping under the quilt, turned into mist. However, despite the cold, they did not wake up.</p><br/><p>The three deacons of the Judicial Department of the Divine Hall were dressed in black. They were staring at the mother and her son and listening to their long and peaceful breathing. The three deacons paced toward the sleeping people, while reaching their hands out from inside their sleeves.</p><br/><p>Suddenly, the Desolate woman lifted the quilt with her hand. She had a small crossbow in the other hand and aimed it in the direction of the deacon in front. Actually, she had woken up a while ago but, looking for an opportunity to attack them unexpectedly, she pretended that she was still fast asleep.</p><br/><p>A sharp arrow was fired from the crossbow and flew toward the deacon.</p><br/><p>The deacon waved his sleeve, which was like a black cloud.</p><br/><p>The arrow went into his sleeve and disappeared.</p><br/><p>Then, with a glowing light rising from that sleeve, a slim Taoist Sword flew out, breaking through the dim flame and dashing toward the woman's chest.</p><br/><p>But somehow, the woman's body moved suddenly, and the Taoist Arrow missed her chest and passed by her shoulder.</p><br/><p>The arrow ripped open her fur robe and only caused a small wound on her dark skin—it was as if her skin was even harder to break through than steel.</p><br/><p>Sensing the strangeness in the tent, the other two deacons looked in the dark corner of the room while the first deacon reached out toward the little boy, who had just woken up and was still sleepy, and dragged him to his feet. Then he summoned the Taoist Arrow back and fired it directly at the little boy's throat.</p><br/><p>The Desolate woman fell on the ground because of the arrow that hurt her previously. Although the wound was not serious, it seemed that she was suddenly weakened by the strange power of the arrow. Unable to rescue her child from the arrow, she made a sad groan like a dying female animal.</p><br/><p>Somehow, with a clear sound, the countless tiny sharp Taoist Arrows went into the ground, which had been softened due to the burning bonfire, turned into small dark holes, and disappeared.</p><br/><p>But the Desolate boy did not die—Just when the Taoist Arrows were about to stick into his body, an invisible hand dragged him away.</p><br/><p>Just like his partners, the last deacon also turned his head toward the corner. Only hearing two different breaths, the deacons had not expected more people to be there. But they were certain about the presence of other enemies because, just then, more sounds of breathing drifted out from the corner.</p><br/><p>The two people hiding in the corner revealed their breath.</p><br/><p>Ning Que previously noticed the movement of Mo Shanshan's right hand and knew that she had saved the little boy. He was now more confident about the following situation.</p><br/><p>Mo Shanshan looked at the three men hidden under their black hats. Their dark outfits covered them all the way to their feet, reminding Mo Shanshan of an Institute of the West-Hill Divine Palace, which frightened or disgusted people the most. She frowned, and asked, \"Are you deacons of the Judicial Department?\"</p><br/><p>The three deacons did not nod or answer. They were staring at Mo Shanshan and Ning Que silently. Mo Shanshan and Ning Que could not see their eyes because of the angle of the light, but they could sense their enemies' threatening power and brutality.</p><br/><p>Mo Shanshan frowned even more. Although she understood why the Divine Hall was so nervous about the Desolate Men, she still could not figure out why the deacons from the Judicial Department wanted to kill the mother and her son secretly. She thought to herself that maybe the mother and the son actually were important figures who could make a serious impact on the Divine Hall.</p><br/><p>Nicknamed Book Addict, she was not as afraid of the black deacons as the normal Haotian followers were. But she was still a true believer of Haotian, and her master was a visiting professor of the Divine Hall, who had come to the Wilderness by order of the Divine Hall. Based on those two reasons, she would not choose to stand against the three deacons from the Judicial Department.</p><br/><p>So, to make sure the three deacons did not misunderstand her intentions, she decided to tell them who she was.</p><br/><p>But at that moment, the deacon leader asked first, \"Are you from the Central Plains?\"</p><br/><p>His voice was neither as hoarse as the sound made by stones rubbing against each other, nor was it tough. He was just talking normally and peacefully, but it still made people scared.</p><br/><p>Mo Shanshan was taken aback for a moment. But when she saw the Desolate mother and her son, who were standing behind Ning Que and protected by him, she believed she knew why these deacons were so hostile. \"We are from the Central Plains, but don't misunderstand,\" she explained mildly.</p><br/><p>Before her words were finished, the leader deacon shook his head and said unemotionally, \"I don't misunderstand at all.\"</p><br/><p>\"You are from the Central Plains, but you are with Desolate people,\" the second deacon said coldly.</p><br/><p>The third deacon also said in the same nonchalant way, \"Since you didn't kill these two Desolate people, you are either betrayer of Haotian, or the remnants of the Devil's Doctrine.\"</p><br/><p>The leader of the deacons calmly concluded, \"Therefore, there is no misunderstanding. You deserve to die.\"</p><br/><p>There was no pause when the three deacons said their words in turn. The words just flowed out of their mouths naturally, as if they had said those same words countless times, or maybe they did not even need to think about it because they were just so right.</p><br/><p>Ning Que was amazed at the speed and fluency of the deacons' speaking. He did not understand why their boss, Prince Longqing, was not just as interesting when they had met in Chang'an.</p><br/><p>He could not help chuckling at that thought. He turned to Mo Shanshan and said, \"I said no one would believe you, but you didn't agree with me.\"</p><br/><p>Then he said to the three deacons, \"Is it necessary for people who want to become deacons to be able to say those lines without thinking? Speaking of that, it must be challenging to say it as well as you can.\"</p><br/><p>It was funny that he said those words seriously.</p><br/><p>These three deacons from the Judicial Department of the Divine Hall came to the Wilderness because they wanted to kill several Desolate people, including this mother and her son. They considered killing a serious job—whether it was for the magnificence of Haotian, the prosperity of the Central Plains, or the long-standing foundation of the Divine Hall.</p><br/><p>But Ning Que was good at making serious things funny, and funny things serious. He also made the three deacons very angry because they felt like he was humiliating them about their beliefs.</p><br/><p>The flickering anger in their eyes was covered by their black hats. But the shivering black coats and the dramatic undulation of the Qi of Heaven and Earth in the room revealed the deacons' outrage and also delivered a message: These deacons were about to fight.</p><br/><p>Mo Shanshan looked at them nonchalantly. \"We can explain.\"</p><br/><p>The leader responded in a cold voice, \"We will hear your explanation after you surrender.\"</p><br/><p>Before the words had finished, he stepped forward, his thin and pale hands reaching out of his sleeves and reaching down toward Ning Que's head. Countless golden lights poured out from his fingertips. Ning Que was locked in a cage made by those lights.</p><br/><p>Since the three deacons had appeared, there was no noticeable expression on Mo Shanshan's face because Mo Shanshan believed that, even if they were to become enemies, she and Ning Que would not be defeated. However, when seeing the golden lights, a twinge of surprise flashed across her face. \"Is that the Confinement?\"</p><br/><p>The Confinement was one of the most profound Taoists skill in Haotian Taoism, and a secret of the Judicial Department, that confined the enemy by forcing the fluctuation of the Qi of Heaven and Earth to change. And when used successfully, it could defeat people who were two states higher. It was said that the Confinement was almost like a Divine Skill when used by the leader of the Judicial Department.</p><br/><p>Seeing that the deacon could easily use the Confinement, Mo Shanshan was certain that he had to be an important figure in the Judicial Department. She frowned and tried to remind Ning Que, \"Don't fight back.\"</p><br/><p>...</p><br/><p>...</p><br/><p>The surface of the light threads was light gold, the same color as the clouds at sunset in the Central Plains. Looking at these threads, which were too tiny to be seen clearly with the naked eye, Ning Que was very confused. He did not believe that these lines were real, however, he could sense that the Qi around him was cut into tiny pieces. This showed that he was in great danger.</p><br/><p>He was always cautious about tricks that he could not understand, let alone that he heard Mo Shanshan's warning, therefore, he did not immediately fight back. He was just so confused about the mechanism of using Taoist Law to control space. If the Confinement could cut space, then when used on enemies, it would cut them all into small pieces!</p><br/><p>However, this deacon did not do that. Ning Que knew it was certainly not because people from the Divine Hall were lenient. The truth was that his enemy was unable to do it, which meant that the Confinement that he was using was not a real Spacial Taoist Law... Speaking of which, you needed to reach the highest State of the Five States to manipulate real space. So, it would not be so easy to meet such a person.</p><br/><p>Ning Que was studying those tiny lines around him. Thanks to his great perception, he could clearly see the structure of the lines. He found that this Taoist Law did not cut space, it just formed turbulence in the air around him by interfering with the fluctuation of the Qi of Heaven and Earth.</p><br/><p>The streams of Qi were like the wooden bars of a prison cell—they appeared to be unbreakable. Because of the thorns that lurked within them, if you pushed with your bare hands, they would end up covered in blood.</p><br/><p>Buried in his own thoughts, Ning Que appeared silent, or even a little dumb. It did not mean that he surrendered to his enemies though, he was just observing the current situation. However, he did not know that his enemies were very similar to him in terms of personality.</p><br/><p>Just like Ning Que, these deacons would not stop attacking their enemies until their enemies were clearly losing. The leader of the deacon group nodded slightly. Reflected by the light of the fire, his face looked pale and peaceful. Then he made a loud and low yell. At that moment, his palms turned really bright and a dark shadow flew toward Ning Que's belly.</p><br/><p>The belly was where the cultivators' acupoints of Snow Mountains and Ocean of Qi were. Once attacked in the belly, it was very possible that the cultivators would die. Hence, the dark shadow sent by that deacon was very threatening.</p><br/><p>Watching what was happening, Mo Shanshan started feeling very angry.</p><br/><p>But she did not get the chance to fight back.</p><br/><p>Because, before she could, Ning Que did.</p><br/><p>Suddenly, in the dark tent, a clear stunning blade flashed, outshining both the shimmering bonfire and the golden Confinement in the deacon's hands.</p><br/><p>Ning Que waved his podao toward the Confinement in front of him. When the sharp blade touched the golden lines, a buzzing sound was heard. It was as if the lines were melting the blade. However, suddenly the intricate Talisman inscription on the blade turned bright.</p><br/><p>A strong power carried by the Fu character gushed out of the blade and smashed the gold lines into ashes. It easily defeated the Divine Light of Haotian, which was carried inside the Confinement.</p><br/><p>Thousands of sounds broke out at the same time when the lines were cut. It sounded like the strings of thousands of iron musical instruments or iron kites had simultaneously broken.</p><br/><p>\"Clap! Clap! Clap!\"</p><br/><p>Thousands of gold lines were cut into small pieces, flying with the wind like soft catkins, having no power at all.</p><br/><p>What happened was not because the Confinement Taoist Law was unworthy of its name, but because the deacon was unable to use the real Taoist Law. It was not because Ning Que suddenly leaped from the No Doubts State to the Seethrough State either, but because his podao and the Fu character were made by his two Senior Brothers of the Back Mountain.</p><br/><p>There was no way that a single nameless figure from the Judicial Department could be a match for the wisdom and state of the core disciples of the Headmaster of the Academy.</p><br/><p>...</p><br/><p>...</p><br/><p>Breaking the Confinement was only the beginning.</p><br/><p>Ning Que was more merciless than the people from the Judicial Department. Once he started fighting, he would rarely stop before his enemies were dead.</p><br/><p>So, after cutting the gold threads, his blade went straight into the chest of the deacon without any hesitation.</p><br/><p>The flash of the blade illuminated the deacon's pale face against his black robes.</p><br/><p>A tiny silver needle plunged into his eyeball, with only the end of it glistening outside.</p><br/><p>It happened too fast for the deacon to cry out in great pain or be amazed by Ning Que's advanced ability to control the Qi of Heaven and Earth. He only had enough time to realize that his gathered Psyche Power had dispersed because of the pain in his head.</p><br/><p>Then he was cut into two pieces by the falling flash of the blade.</p><br/><p>His body had not yet come apart, and only a clear line of blood was seen on him.</p><br/><p>And suddenly, he died.</p><br/><p>...</p><br/><p>...</p><br/><p>The second deacon stepped backward with his hand waving in front of his body, throwing out many Divine Light threads.</p><br/><p>Ning Que threw his sword away and jumped up like a flexible monkey. He avoided those dangerous lines and jumped on top of the deacon.</p><br/><p>A small piece of clothing fell down.</p><br/><p>Ning Que reached out his hands and grabbed the bones on the deacon's face and, at the same time, his knees hit the deacon's chest as fast as lightning.</p><br/><p>After a snap was heard, the deacon's chest bones were all broken.</p><br/><p>Both of them fell outside the tent and landed on the ground, which was covered with snow.</p><br/><p>Ning Que tightened his hands and broke the deacon's neck.</p><br/><p>...</p><br/><p>...</p><br/><p>The third deacon went quietly behind Ning Que and reached out toward him. The light between his hands was as bright as a flickering blaze.</p><br/><p>Ning Que ignored him.</p><br/><p>Suddenly, in the deacon's palms, the flickering Divine Light turned into real fire.</p><br/><p>His hands and his entire body were burning underneath his black coat.</p><br/><p>He suddenly turned into coal.</p><br/><p>And in the next second, his body turned into ash.</p><br/><p>With nothing inside to support it anymore, the black coat fell to the ground.</p><br/><p>Ning Que turned to Mo Shanshan with a smile showing on his face. Then, he went back to the tent and picked up his podao.</p><br/><p>At that moment, the body of the deacon who had died first slowly separated into two parts. Blood flowed out from the tent, dying the snow on the ground red.</p><br/><p>At some point, the clouds had drifted apart, and several stars shone in the sky.</p><br/><p>Everything looked pale.</p><br/><p>And Mo Shanshan also turned pale.</p><br/>\n</div>"}