{"title": "Chapter 249: The Beginning of One's Cultivation", "id": 249, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-249-the-beginning-of-ones-cultivation", "volume_title": "Volume 3", "body": "<h1>Chapter 249: The Beginning of One's Cultivation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 249: The Beginning of One's Cultivation</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>\"How did you manage to shoot those Horse Gang that night?\"</p><br/><p>\"It's simple. I used my Psyche Power to determine their positions in the dark.\"</p><br/><p>\"How did you make sure you would wound them considerably?\"</p><br/><p>\"I used my Psyche Power.\"</p><br/><p>\"They were so far away. How did you manage that?\"</p><br/><p>\"That's because my Psyche Power is strong.\"</p><br/><p>...</p><br/><p>...</p><br/><p>\"But... your potential for cultivation is not great. You aren't able to control much of the Qi of Heaven and Earth.\"</p><br/><p>\"A needle might not be as strong as a knife, but it can still pierce a person's skin.\"</p><br/><p>\"That's such an odd way of thinking. Furthermore... don't you think it's such a waste to use this method in a fight? You have to use your Psyche Power to determine the position of your opponents and you still have to gauge their silhouettes. You'll drain your Psyche Power in the sense of perception too quickly.\"</p><br/><p>\"As I've said before, my Psyche Power is strong.\"</p><br/><p>...</p><br/><p>...</p><br/><p>\"Have you thought of becoming a great Psyche Master?\"</p><br/><p>\"No.\"</p><br/><p>\"Why not?\"</p><br/><p>\"Because I am a genius in Talisman Taoism. I want to become a Talisman Master like you.\"</p><br/><p>...</p><br/><p>...</p><br/><p>\"You didn't use a talisman that night when you killed the deacon of Divine Hall.\"</p><br/><p>\"I am accustomed to using my knife. There is a talisman carved on my knife.\"</p><br/><p>\"Your method of fighting is really different from other cultivators.\"</p><br/><p>\"I am a genius. Of course, I would take an unusual path.\"</p><br/><p>\"But why do I feel that you were forced to make this decision.\"</p><br/><p>\"My pride is injured by you once again.\"</p><br/><p>\"I do not know how to lie.\"</p><br/><p>\"That is why you were able to injure me.\"</p><br/><p>...</p><br/><p>...</p><br/><p>\"Do you feel the high levels of Qi of Heaven and Earth in this forest?\"</p><br/><p>\"Yes, a little.\"</p><br/><p>\"You seem to be rarely aware of the aura of Heaven and Earth around you.\"</p><br/><p>\"I care more about the aura in my own body.\"</p><br/><p>...</p><br/><p>...</p><br/><p>These were the kinds of conversation between Ning Que and Mo Shanshan all the way from the peak of the snow cliffs in the Wilderness to the bottom of Cang Mountain. Sometimes, Ning Que would feel as though he was back in the Back Mountain of the Academy or in the old library, talking to the annoying Chen Pipi who could not stop spewing nonsense.</p><br/><p>What he considered nonsense was very important to Mo Shanshan though. The young talent who was addicted to calligraphy and talisman could understand Ning Que's methods in cultivation better through their conversations. Her expression got more and more worried, frustrated and lost as the two approached the Snow-capped Peak of the Tianqi Mountain.</p><br/><p>The two rested beside a hot spring stream. Ning Que looked at her slightly hooded lids and the long lashes on her pale white skin. He thought of the changes in her emotions as they journeyed and could no longer suppress the curiosity within him. He asked seriously, \"What are you worried about?\"</p><br/><p>Mo Shanshan lifted her head and looked at Ning Que silently as if he was a sparkling jewel about to be buried in a sandstorm. Her eyes were filled with worry as she said softly, \"I am worried that you will join the Devil.\"</p><br/><p>Ning Que was startled, and then, he smiled.</p><br/><p>Due to the combination of having been influenced by novels in the other world, life experience in this world as well as the jovial atmosphere in the Academy, he had indeed found it hard to feel any disgust for the Devil's Doctrine. However, he was also a practical person. He knew that there was no sin in thinking, but if he were to cultivate the Devil's Doctrine's arts, he would attract a lot of trouble.</p><br/><p>He smiled, \"I am a core disciple of the Headmaster of the Academy. I will not be like those poor souls who are unable to retaliate after having been shamed and trod on. Unlike them, I will not sell my soul to the devil for power.\"</p><br/><p>Mo Shanshan looked at his clean and adorable face silently. She thought of what she had seen and heard throughout the journey and was certain that he was a person who would do anything to reach his goals. She could not sense an ounce of respect for Haotian in him. The method of cultivation he had chosen passively or impassively placed emphasis on his physical skills and lacked communication with the Breath of nature. If he continued on this way, it would be easy for him to go astray.</p><br/><p>This was especially so now that he was getting closer and closer to the mountain ranges abandoned by Haotian.</p><br/><p>Mo Shanshan lifted some snow by the hot spring and blew it. She stared at the black and white mountain ranges not far away. After a moment of silence, she said, \"Will you promise me something?\"</p><br/><p>Ning Que asked, \"What is it?\"</p><br/><p>Mo Shanshan turned around and looked at him. She said seriously, \"If we encounter any arts from the Devil's Doctrine, please do not learn them.\"</p><br/><p>Ning Que could not help but be surprised when he heard that. He looked at the desolate mountain ranges that hung between Heaven and Earth as he wondered. He had heard about someone from the Divine Hall entering this mountain from the Desolate Man tribe and guessed that it had something to do with the Tomes of Arcane. But why would Mo Shanshan mention about the arts of the Devil's Doctrine suddenly?</p><br/><p>Mo Shanshan blinked and said softly, \"The Front Gate of the Devil's Doctrine is within this mountain range abandoned by Haotian. The mountain is large. Other than the sublime being who destroyed the Front Gate, not many people know of its existence.\"</p><br/><p>Ning Que's shock gradually dissipated. He frowned at the mountain and said after a pause. \"I did not know about this. No one told me about it.\"</p><br/><p>\"The information from the Desolate Man tribe stated clearly that the people from Divine Hall created trouble in the Wilderness in order to attract attention from the powerhouses and senior statesman of the Divine Hall. The true powerhouses of the Divine Hall have all infiltrated this mountain.\"</p><br/><p>\"News from Chang'an say that the Divine Hall is searching for the Tomes of Arcane and they think that the Desolate Man tribe have it. I wonder why they have entered the mountain then.\"</p><br/><p>He retracted his gaze and looked at Mo Shanshan with furrowed brows. \"If the Divine Hall think that the Tomes of Arcane is within the Front Gate of the Devil's Doctrine, and they have always been within the Tianqi Mountain, why did the Divine Hall not come in search of the Tomes of Arcane before this then? Why would they only come when the Desolate Man have moved southwards?\"</p><br/><p>Mo Shanshan shook her head. She tucked a loose strand of hair behind her ears and said, \"It is the will of heaven for supermundane items such as the \"Ming\" Handscroll from the Tomes of Arcane to appear in the world. We cannot understand or guess this Lucky Chance. But in my opinion, the probability of the Tomes of Arcane being in the Desolate Man tribe is not as high as it appears in the Front Gate of the Devil's Doctrine.</p><br/><p>Ning Que asked, \"Why\"</p><br/><p>Mo Shanshan answered, \"Because items like the Tomes of Arcane should belong to the Unknown Place.\"</p><br/><p>Their conversations in the forest at the foot of the mountain surprised Ning Que constantly. A hazy memory of a mention of the Unknown Place floated in his mind, but he could not remember it clearly.</p><br/><p>He asked solemnly, \"What is the Unknown Place?\"</p><br/><p>Mo Shanshan was shocked. She realized that he was not joking and answered gravely, \"It's a place where people cannot go.\"</p><br/><p>Ning Que rubbed his forehead and said helplessly, \"Can you explain further?\"</p><br/><p>Mo Shanshan looked at him with furrowed brows as if she was looking at a very odd tree. After a moment, she continued, \"The Unknown Place are mysterious lands outside of the secular world. It is rare for people to see these places with their own eyes. People who have entered the place will not talk about it either. That is why there are only rumors of the Unknown Place floating about in the cultivation world after thousands of years.\"</p><br/><p>Ning Que asked confusedly, \"If the Divine Hall is an Unknown Place, then the Devil's Doctrine is a branch of the Divine Hall in my opinion. Why would it's Front Gate be considered an Unknown Place?\"</p><br/><p>Mo Shanshan answered his question grimly, \"I asked my teacher the same question when I was little. According to the teacher, it is because the Great Divine Priest of Light who started the Devil's Doctrine had already become a devil that had gone beyond five states when he started the Front Gate of the Devil's Doctrine. That is why.</p><br/><p>\"Beyond Five States?\"</p><br/><p>Ning Que thought of the sage that Lyu Qingchen mentioned as well as the terrifying states of Tianqi and No Rules and could not help but felt his heart waver. He felt that one probably shouldn't get near to that Unknown Place.</p><br/><p>\"Other than the abandoned Devil's Doctrine's Front Gate, I believe that there are other powerhouses who have gone beyond the five states in the Unknown Place. It is just that there aren't a lot of them and they don't appear in our realm. Only a young apprentice would enter the human realm every few years or so and they'd be called a World Wayfarer. Once these World Wayfarers enter the human realm, they would be Grand Cultivators in the Knowing Destiny State. Even Liu Bai, the Sage of Sword from the South Jin Kingdom would fear them.\"</p><br/><p>Mo Shanshan looked at Ning Que with conflicting emotions in her eyes. The message that her eyes gave off was that the world she had seen with her own eyes were different from what she had just talked about. She did not believe it.</p><br/><p>Ning Que did not notice that. He ruminated over the shocking news that had just been shed about the cultivation world. He thought about his daily life in the Back Mountain of the Academy and was rather annoyed that Second Brother, Third Sister, and Chen Pipi didn't even mention something so important to him.</p><br/><p>He frowned and said, \"If something like the Tomes of Arcane can only exist in an Unknown Place, those who are able to steal the Tomes should be the World Wayfarers from the Unknown Place. I thought that the competition was just people of the Tao Addict or Long Qing's caliber and that I had a chance. But if we meet Grand Cultivators in the Knowing Destiny State, we have no chance against them.\"</p><br/><p>Due to some reasons, Mo Shanshan felt that she could not understand what the lad was trying to say. Her brows looked tightened as though they were drawn with ink. \"What exactly are you thinking about?</p><br/><p>Ning Que answered earnestly and honestly, \"I was thinking if we should return to the south immediately. If you are unhappy, I can invite you to Chang'an and treat you to Osmanthus Cake.\"</p><br/><p>Mo Shanshan stared at him with wide eyes and looked at him incredulously. She did not know what she should say.</p><br/><p>Ning Que did not know what to say either and contemplated in silence.</p><br/><p>It was rather ludicrous how the trip to the Wilderness had ended up like this. Incident after the incident had occurred right before their eyes. No one had reminded or given him any warnings. He was only informed of news as important as the \"Ming\" Handscroll of the Tomes of Arcane right at the end. No matter how he thought about it, the way things have been dealt with are very much different from what the reputation of the Tang Empire or the Academy would do.</p><br/><p>The Emperor and Nation Master, Li Qingshan, probably wouldn't hurt him. Master Yan Se wouldn't either. The Senior Brothers and Sisters in the Academy might not have been involved in this matter. He trusted that Second Brother would at least show some excitement about the Unknown Place. But why did all these people let him come without telling him anything?</p><br/><p>His Majesty, as well as the elders of Southern Gates, probably had their own plans for him as the first person of the Second Floor of the Academy to participate in the practice. But what was Second Brother thinking? Ning Que thought about it. His eyes gradually brightened and then dulled as if he had received a sudden scare. His entire body stiffened.</p><br/><p>He thought of something someone had said, \"Fate itself is a very cruel guy. If you're chosen to assume the mission, and then before confirming that you're qualified, it will do everything possible to break every bone in you and to strip every trace of your flesh and blood, allowing you to suffer the most extreme pain in the world so as to make your volition and temperament tough and eligible enough to be chosen by fate...\"</p><br/><p>...</p><br/><p>...</p><br/><p>Chen Pipi was the one who told him this.</p><br/><p>Second Brother was the one who told Chen Pipi about it.</p><br/><p>The legendary Youngest Uncle was the one who said this.</p><br/><p>Everyone in the Back Mountain of the Academy knew that Second Brother was the most ardent follower of Youngest Uncle. He was his most passionate fan. He tried to imitate Youngest Uncle no matter in his way of speech or behavior. This reminded him of the famous statement made by Youngest Uncle. Second Brother had tossed Ning Que into the empty Wilderness. Ning Que, a weak cultivator in the No Doubts State had to face the powerhouses of the Divine Hall and the World Wayfarers from the Unknown Place. He had to face the cruelties of life and receive an answer.</p><br/><p>Ning Que could not help but shuddered as if he was a child who was about to drown. He stared at the mountain helplessly and cursed Second Brother bitterly for his stupidity.</p><br/><p>At this moment, the Big Black Horse trotted over after having filled his belly somewhere. Its eyes filled with bitterness.</p><br/><p>Ning Que looked at the Big Black Horse and thought of the time when he ran at a supernatural speed at the palace. The fear and unease in his heart gradually calmed. He frowned for a long time before asking,</p><br/><p>\"Is the outcome more important, or is it the process?\"</p><br/><p>Mo Shanshan froze for a second before answering, \"I think the process is more important.\"</p><br/><p>Ning Que shook his head. \"I used to think the outcome was more important. And when I was learning talismans, I thought the process was more important. I now understand that they are equally important. But it is just that without the process, there will be no outcome.\"</p><br/><p>Mo Shanshan said, \"You are usually not a person who would say something like that.\"</p><br/><p>Ning Que suddenly smiled. \"That is because I now know why I am here in the Wilderness.\"</p><br/><p>\"Why?\"</p><br/><p>\"It has nothing to do with the \"Ming\" Handscroll of the Tomes of Arcane or the Front Gate of the Devil's Doctrine. I came to the Wilderness to join the Academy's practice. The students of the Academy practice in order to join the army and the war. I practice cultivating.\"</p><br/><p>Ning Que said certainly, \"The Academy sent me to the Wilderness so that I will learn something from everything I've gone through. This is the process. The goal of this cultivation journey is to break the realm and enter the Seethrough state.\"</p><br/><p>Mo Shanshan lifted her eyebrows and said incredulously, \"You've only received enlightenment at the beginning of spring and attained a sense at the end of spring before proceeding to the No Doubts State. It hasn't even been a year and you're thinking of breaking into the Seethrough state?\"</p><br/><p>Ning Que replied earnestly, \"I have told you once that I am not far from the Seethrough state.\"</p><br/><p>Mo Shanshan shook her head lightly and said, \"Wang Jinglue from the Tang Empire entered the Seethrough state at 16, but he received enlightenment at four. I entered the Seethrough state at 14 but received enlightenment at three. I do not know about the Tao Addict, but I am sure that Prince Long Qing had spent a lot of time on cultivation even though he entered the Seethrough state at a young age. I have never heard of anyone attaining this state within a year. Even though you are a core disciple of the Headmaster of the Academy, you have never met him. This idea is...\"</p><br/><p>Ning Que smiled as he thought to himself, \"It's because you have never stayed in the Back Mountain of the Academy. There are too many perverts in cultivation there. It was just that other than Second Brother, the other Senior Brothers and Sisters did not seem very interested in cultivation. If they only spent their passion for chess, music, and flowers on cultivation, they would have long entered the Knowing Destiny State.</p><br/><p>Ning Que's confidence was renewed when he thought of the Senior Brothers and Sisters whom he could rely on in the Back Mountain of the Academy. He looked at the snow mountain and felt a boundless sense of pride filling his chest. He said loudly, \" Are World Wayfarers that impressive?\"</p><br/><p>Mo Shanshan's ruby red lips parted but no sound emerged upon hearing that. Her expression bordered between annoyance and helplessness. How did she end up like such an idiot by the Ink Lake that summer?</p><br/><p>Ning Que looked at her speechless expression and smiled in satisfaction. \"Do not be shocked. Do not respect me either. I am such a person who would dare face the cruelties of life, fresh blood and dangers head-on.</p><br/><p>...</p><br/><p>...</p><br/><p>Prince Long Qing stood by the black rock walls. He was tired of looking at the fluttering snowflakes further away from the leaden clouds. He turned back to look at the desolate depths of the mountain ranges. That was the end of the northern foothill of Min Mountain. However, it was called the Tanqi Mountains no matter in the dialect of the barbarians of the grassland or the annals of the Divine Hall.</p><br/><p>After having betrayed the Divine Hall and starting the Devil's Doctrine, the Great Divine Priest of Light led his disciples there and built the Front Gate of the Devil's Doctrine. From then on, the mountain that had been desecrated by filth was abandoned by Haotian.</p><br/><p>A snowflake was carried by the wind from the cliff wall before him. It did not manage to touch his beautiful face before it was blown away. His brows gradually furrowed.</p><br/><p>Another Great Divine Priest of Light had betrayed the Divine Hall after a thousand years. What kind of mark would this leave the brightness of Haotian and what would be the impact of this on the Divine Hall's work?</p><br/><p>Even though he was brought up and cultivated as a promised child of heaven by the Divine Hall and was the perfect gentleman in the eyes of the world who held the majority of the authority in the Judicial Department, he was still inexperienced. Ranking above him was the Tao Addict, Ye Hongyu, the God of the Judicial Department, and the Hierarch Lord. He did not have much right to participate in matters regarding the betrayal of the Great Divine Priest of Light. He could only think about it.</p><br/><p>The Great Divine Priest of Light had destroyed confinement, left the You Prison, and betrayed the Peach Mountain. He had left behind chaos in the West-Hill Divine Palace. At almost the same time, the Great Divine Priest of Relation who had returned from the south had sacrificed half a head of white hair in exchange for a decree from Haotian.</p><br/><p>Due to the Desolate Man moving south, the desecrated Unknown Place within the Tianqi Mountain had finally appeared on earth after more than ten years.</p><br/><p>The Divine Hall had never given up on finding the \"Ming\" Handscroll of the Tomes of Arcane lost in the Wilderness. According to rumors, the Taoist sect had once visited after the madman demolished the Front Gate of the Devil's Doctrine with a single sword, but nothing was found. That was why the Divine Hall had thought that the Desolate Man had brought the scroll from the Tomes of Arcane to the northern Cold Region.</p><br/><p>However, it was at this time when the Great Divine Priest of Relation had sent such a decree.</p><br/><p>Prince Long Qing's frown tightened. It did not affect his handsome face but made it look more somber.</p><br/><p>The Devil's Doctrine Front Gate was the only Unknown Place that had been destroyed. But should they reopen the place, it was certain that they will discover many new things. Those things might not be important to the madman or the person who went in search of the Tomes of Arcane after but was very precious to the Tao Addict, himself as well as various young cultivators in the world.</p><br/><p>He believed in Haotian fervently and had a heart that faced the light. He would of course not be interested in the filthy dark arts of the Devil's Doctrine. However, he was still a priest of the Judicial Department and knew of the truth that had been buried by time. Even though he might not be able to find the \"Ming\" Handscroll of the Tomes of Arcane, it would be a large boon to gain something from the madman's teachings.</p><br/><p>How much Lucky Chance would that require though?</p><br/><p>Prince Long Qing looked at the mountains abandoned by Haotian. \"This must be a form of cultivation as well,\" He said calmly.</p><br/><p>Ten feet below, a deacon of the Judicial Department dressed in black robes appeared. He bowed to Prince Long Qing respectfully and said something. His voice seemed to be broken by the piercing wind. It would have been indiscernible to an ordinary human but was exceptionally clear to Prince Long Qing.</p><br/><p>The skilled cultivators of the Divine Hall have appeared. Powerhouses of the Desolate Man and even some senior statesman have been attracted to the west. The eastern side of the Tianqi Mountain seemed exceptionally empty today. Except...</p><br/><p>\"13 deacons have gone missing?\"</p><br/><p>Prince Long Qing looked at the subordinate below the cliff expressionlessly. It seemed as if it was a routine question. There were no emotions in his speech. Only he himself knew that he was irritated when he heard the name of that deacon.</p><br/><p>Of the 13 missing deacons of the Judicial Department, was one named Luo Weiyang. He was a subordinate of his in the Lower Seethrough state. This did not mean anything. What was more important was that he was Luo Kedi's brother.</p><br/><p>Luo Kedi was not very important either. But the thing was, he was the favored commander of the Hierarch Lord.</p><br/><p>The subordinate below the cliff was extremely fearful and nervous due to the prince's dark expression. He lowered his head and continued his report. \"Mr.Thirteen from the Second floor of the Academy has already left the palace. He should be heading here. We do not know which route he is taking, but we know that he should be traveling with the Calligraphic Addict from the Black Ink Garden.\"</p><br/><p>Prince Long Qing's sword-like eyebrows lifted and an enigmatic smile appeared on his face. He muttered to himself, \"That's interesting. You've started to travel the world. But has there been a World Wayfarer as weak as you over the past thousand years?\"</p><br/><p>The smile dropped from his face slowly, and together with the cold winter gales that drifted past his face, turned into ice.</p><br/><p>As a powerhouse who had the right to be proud, Prince Long Qing had only been defeated by Ning Que once in his life. That was why his pride would fade into anger and unhappiness after hearing Ning Que's name.</p><br/><p>It was true that he had hidden it well as he remained peaceful and calm as usual. From the beginning of spring to start of the cold winter, nobody from the Divine Hall could sense it. But he knew that those anger and unhappiness were always there.</p><br/><p>Due to his loss, he found himself started aiming for the threshold into the Knowing Destiny State when spring left Chang'an that year. It was there on the other end of the mountain, waiting for him to cross it. But also due to his loss, he found no way to get closer to it, much less crossing it even though he could see it on the mountain.</p><br/><p>Anger and unhappiness would not affect one's Taoist Heart. However, the resentment and unbalance would affect the path towards the light for one's Taoist Heart.</p><br/><p>He was proud, which was why he was resentful. He did not dare second-guess the Headmaster's choice. But he felt that there were other reasons resulting in his loss to Ning Que since the academy entrance exam was not presided over by the Headmaster personally.</p><br/><p>Because he could not be any less skilled than Ning Que.</p><br/><p>He had to attack and even ruin that guy from all aspects to prove this point.</p><br/><p>That was what the God of the Judicial Department had said. While the hierarchy did not say anything, his cold gaze did. The contemptuous smile of that crazy woman, Ye Hongyu, said the same. That was why he knew this was what he needed to do.</p><br/><p>\"I will wait for you in this mountain.\"</p><br/><p>Prince Long Qing looked at the black and lowly rocks at the foot of the snow-capped peak. He laughed self-deprecatingly. \"How can the first man who was going to defeat a World Wayfarer not feeling any sense of accomplishment at all?\"</p><br/>\n</div>"}