{"title": "Chapter 241: A Small Pause", "id": 241, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-241-a-small-pause", "volume_title": "Volume 3", "body": "<h1>Chapter 241: A Small Pause</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 241: A Small Pause</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>When one did not have a breath or could not shut his eyes, it was the so-called dissatisfied death. Ning Que did not close Lin Ling's eyelids in the tent and did not feel anything heavy in his heart, and even quickly forgot this matter after leaving the tent.</p><br/><p>He had killed too many people in his life and had seen too many dead bodies as well as many people with dissatisfied deaths. So he did not care about it at all. The deceased wanted to retaliate out of resentment? Then did not hesitate to come back as a ghost.</p><br/><p>Ning Que never felt forgiveness for those who tried to kill him. As long as he was able to achieve his own goals, any vows or promises were worthless.</p><br/><p>Previously he had not sworn by his own personality but by the Headmaster's. Naturally, it was because his personality was not as worthy as the Headmaster's. As for whether the Headmaster's personality would become bankrupt because of his behavior...</p><br/><p>Anyway, the Headmaster did not know about it. Those who do not know anything cannot blame anyone else for it.</p><br/><p>If others knew the truth about this matter, they might find it kind of immoral for Ning Que to do so. For instance, the Imperial Center Administration spy beside Ning Que at this time, who had a nervous expression on his face. No one knew what this spy was thinking.</p><br/><p>This was because they did not know the nickname Ning Que had acquired in the City of Wei when he was a child -the immoral one.</p><br/><p>Ning Que was such an immoral person. But as he left the frontier fortress with Sangsang to return to Chang'an City, the things they had experienced, grand or bloody or marvelous, didn't give him a chance to show his immorality.</p><br/><p>The Horse Gang who had attacked the grain team and tried to assassinate him, and the remaining leaders and chiefs had all died out. The matter on the Tang Middle Military Camp had also been carried out very smoothly without any accident.</p><br/><p>This cavalry belonged to the northeast Border Army. But General Shu Sheng was ordered by the Emperor to come here. Therefore, the vice general Xu Yin, the cavalry commander, who was suspected of covering up for the Horse Gang, had no reason for resistance but only held his hands up awaiting capture.</p><br/><p>General Shu Cheng pointing out the identity of Ning Que who had investigated the Horse Gang case, was naturally one of the important reason for suppressing the battalion soldiers. But the most important reason was the discipline of the Tang army. Though the Tang Northeast Border Army has been under the command of General Xia Hou for many years, it was still an imperial army, not Xia Hou's private army.</p><br/><p>Today, the Tang Empire held great power and an all-encompassing heart. So the idea of allegiance to the Emperor has been deep in the minds of every proud soldier. Because of this, the people in Chang'an City never worried about any heresy showing up in the four border armies.</p><br/><p>In the Middle Military Camp, Ning Que talked to General Ning Que about the previous situation, and then selected some records of the secrets Lin Ling had confessed. He asked some generals and private guards to write those records on a volume and send it back to Chang'an City.</p><br/><p>That Imperial Center Administration spy has already returned to his own tent. Besides, a secret document would be delivered to the Nation Master through the Imperial Center Administration via a relevant channel and then be directly handed over to the imperial palace.</p><br/><p>So Ning Que was not worried that the Horse Gang case would disappear. He was more worried about another thing at this time. -- Why did Xia Hou want to kill him? There wasn't sufficient reason to even if Lin Ling suspected that Ning Que had a connection with the censor's case and decided to act on his own. Ning Que was a core disciple of Headmaster of Academy. Even if Xia Hou was the Emperor's favored official, Xia Hou must take a great risk to kill Ning Que. If there was no motivation or incentive persuasive enough, why did Lin Ling bring trouble to his own master?</p><br/><p>General Shu Cheng saw that Ning Que seemed to be in deep thought and assumed that Ning Que was thinking of something else. So he said softly, \"Although Lin Ling was a Psyche Master of the northeast Border Army, this matter may have nothing to do with the general. After all, there is only one confession and no record on the spot. Mr. Thirteen, I'm only responsible for reporting this matter to Chang'an.\"</p><br/><p>Ning Que laughed to show that he understood that even if he now had a very distinguished status, this kind of honor belonged to the Academy's Back Mountain rather than the secular world. In fact, it was kind of delusional to ask the imperial court to inquire a border general because of only one sentence.</p><br/><p>Under the complicated gazes of the people in the Military camp, he walked out of Middle Military Camp and went to his own tent. Within a few steps, he saw a small figure running towards him outside a fence.</p><br/><p>Cat Girl flushed slightly, waved her hand with a gasp and said, \"Senior Brother, your luggage is too heavy. I really can't move it. Do you want to take it yourself?\"</p><br/><p>Ning Que had originally wanted to move back to the Tang camp where all the Tang soldiers lived. After all, it was where his people were staying. But today he had killed a number of Horse Gangs disguised by the northeastern Border Army Inner Battalion and also caused the highest officer of this army be handcuffed. Although no one dared to show him the slightest disrespect or hostility, the complicated emotions in those eyes really made his headache.</p><br/><p>\"No need.\"</p><br/><p>He stretched his hand through the gaps in the fence and patted the little girl's head. Then he said with a smile, \"I'll go back to sleep at night.\"</p><br/><p>Cat Girl was overjoyed. She clapped her hands together and said, \"Great. Senior Sisters said you wouldn't come back.\"</p><br/><p>...</p><br/><p>...</p><br/><p>After the identity of Ning Que as a disciple of the Second floor of the Academy came to light, the girls of Black Ink Garden thought that he had no reason to stay with them any longer and would certainly move back to the Tang camp. Perhaps they might not see him in the future. So when they thought of the mutual support they had given each other along the way, the jokes as well as the golden roasted goats, they could not help but feel regretful and sad.</p><br/><p>Therefore, when Ning Que took the Big Black Horse and showed up outside the tent, they received a warm welcome from the young girls. Even the Big Black Horse was patted many times by the girls' soft and fragrant hands. It gently shook its head, kicked the hard floor under its feet, flipped its thick lips from time to time, and looked particularly proud and pleased.</p><br/><p>Only Calligraphy Addict Mo Shanshan was indifferent or stiff as usual. It could be said that she looked even more indifferent.</p><br/><p>Ning Que walked into the tent and saw she was looking down and writing small characters. He said a few words to her but did not get any response. He could not help but feel somewhat weird and went forward to see what she was writing. But he was scared by her cold stare and retreated.</p><br/><p>\"I won't be angry with you since you're shortsighted.\"</p><br/><p>Ning Que silently comforted himself and walked out of the tent to the Big Black Horse. He pulled out some stuff that looked like dry grass roots from his arms and put them into the Big Black Horse's mouth.</p><br/><p>Suddenly the Big Black Horse's eyes became bright and swallowed them into its belly after a few mouthfuls of chewing. And then it lowered its head and kept rubbing his face, just like a little coquettish dog asking for a few more. But its body was too huge, it looked so funny trying to cozy up to Ning Que, much less to snuggle up to him.</p><br/><p>Ning Que was too lazy to care about it and annoyedly pushed its big head away. He then looked towards a faraway place covered by northern clouds.</p><br/><p>It was a place where the Desolate Man lived.</p><br/><p>Ning Que looked at it quietly and understood some things.</p><br/><p>A lot of people were going over there.</p><br/><p>The imperial court and the Academy did not send people there. He represented the imperial court and the Academy.</p><br/><p>Xia Hou wanted to do some things there and did not want any interference or be found by the imperial court or the Academy. So he did not hesitate to kill Ning Que at a great risk, for he was willing to fight to his death for that matter.</p><br/><p>What could this army general be so desperate for in the barren cold wilderness,?</p><br/><p>It was Tomes of Arcane, of course.</p><br/><p>Ning Que looked at the northern Wilderness and thought to himself smilingly. \"This matter arose from Tomes of Arcane and seems to end with Tomes of Arcane. But I don't know whether there is a good-looking vixen among those parties snatching Tomes of Arcane.\"</p><br/><p>\"I like your black horse.\"</p><br/><p>A voice came from behind him suddenly.</p><br/><p>Ning Que turned around and saw a beautiful girl in white next to the Big Black Horse. He looked at her red lips that were pursed in a straight line and her combed neat black hair. He always felt that there was a pause in the middle of the sentence he had heard, but also felt that he might have been mistaken.</p><br/><p>Because she still looked stiff and her eyes, as well as brows, still looked so beautiful, without any charm or shyness or change.</p><br/>\n</div>"}