{"title": "Chapter 259: Ning Que's Destiny for Whether Entering Knowing Destiny State Or Not", "id": 259, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-259-ning-ques-destiny-for-whether-entering-knowing-destiny-state-or-not", "volume_title": "Volume 3", "body": "<h1>Chapter 259: Ning Que's Destiny for Whether Entering Knowing Destiny State Or Not</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 259: Ning Que's Destiny for Whether Entering Knowing Destiny State Or Not</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Ye Hongyu floated to Prince Long Qing. She furrowed her thin brows slightly, looking rather serious. She stretched her jade-like palm and put it on his head. A light and pure Taoist aura spewed out from her palm, instantly covering his body.</p><br/><p>The light and pure aura gradually became denser and glittered with a golden beam just like Haotian Divine light. She placed a pill on his lips with her left hand. She gently shattered the pill and pushed it into his stomach.</p><br/><p>Her concise and rapid movements caused the overflow of blood in Prince Long Qing's chest and abdomen to magically stop. One could vaguely feel that a very intense aura of life was repairing something.</p><br/><p>This pill was a superb medicine Tao Addict had brought from the temple in her childhood. The Taoist aura with a very intense aura of life was the secret skill of the Peach Mountain. She actually dragged Prince Long Qing back from the edge of death with it.</p><br/><p>Prince Long Qing looked very pale, but it was unlikely that he would die on the spot. However, no matter what Ye Hongyu did, he did not respond. He merely bowed silently and looked at his chest.</p><br/><p>A drop of sweat slipped down from his temple and was instantly blown away by the snowy wind under dark clouds. In order to save Prince Long Qing, she had suffered a great deal of damage in a very short period of time.</p><br/><p>She simply said, \"It was too fast.\"</p><br/><p>Normally, proud Tao Addict would never bother to explain anything, even if the other was Judge God. However, today she had been on the snow cliff for the purpose of protecting Long Qing. But she had not stopped the arrow, and this had resulted in his injury. So she felt it necessary to explain to him.</p><br/><p>The arrow had been so fast that she could not react in time.</p><br/><p>Prince Long Qing did not answer her. Maybe it was because of his injury or maybe he had other reasons.</p><br/><p>He looked at his chest without any emotion. He knew that he could cure his physical injury within months. However, the Ocean of Qi, especially the damaged Taoist Heart that had broken the realm, could never be repaired.</p><br/><p>In his sense of perception, the stars had been broken into hundreds of millions of cluttered lenses. The dark sky was twisted into a mess and floated around in space, gradually occupying all the corners of his eyesight.</p><br/><p>He looked at the hole in his chest like a fool as if seeing this chaotic world. He recalled memories and experiences he had had.</p><br/><p>A torrent of vivid images flashed before his eyes. Indifferent faces reflected by fire; semi-scorching bodies on stakes and their painful cries; bony corpses in You Prison; the proud and calm faces of those watching; all changed into countless pieces of snow. These images flashed by and swept over his black Taoist robe.</p><br/><p>He had killed a lot of people, including strong and violent men; chaste and tender virgins; charming and plump whores; old and thin elders; young and lovely children. He had put all his mind into the Taoist pursuit and been loyal to Haotian. He had not hesitated to kill those people.</p><br/><p>However, he found that the feelings he had once had killed others at the stake had all been unreal. Only the pain of his being destroyed was real.</p><br/><p>He envisioned his dark and hopeless future.</p><br/><p>Ye Hongyu stared at his gloomy face, knowing that his pride and strong cultivation had been completely destroyed by the arrow. She could not help exclaiming, \"Do you want to destroy yourself?\"</p><br/><p>Prince Long Qing suddenly laughed. His hoarse laughter sounded weak. He looked to be in extreme pain and confusion in the gradually increasing snowstorm. He softly murmured, \"I've already been destroyed.\"</p><br/><p>For a Son of God in West-Hill who was willing to devote his life to the bright Haotian and Taoist cultivation, if he could no longer enter the Knowing Destiny State, he would only survive like a dog.</p><br/><p>With difficulty, he turned around painfully. He looked towards the snow and wind outside the cliff and the increasingly dark sky deep in the Wilderness. He said with frustration,\"I'm the Prince. I should be the Yan Emperor. My feet were once standing on two sides of the Taoist sect and the mortal world. I should be unique in the world. But I was destroyed. And now I've been abandoned by Haotian in this cruel dark world.\"</p><br/><p>In the eyes of Taoist people, fortune was a gift Haotian bestowed to human beings, while misfortune was a punishment. He had been lucky all his life. But today in the mountains he had been abandoned by Haotian. He suddenly found himself ruthlessly abandoned. No matter how strong his will or how pure his Taoist Heart, he could not deal with such a terrible result.</p><br/><p>He slowly stood up. His severely wounded and extremely weak body shook in the snow and wind. He painfully uttered a beast-like cry as he struggled to straighten his body.</p><br/><p>He ignored Ye Hongyu at his side and took a direct step forward.</p><br/><p>With no ground below his feet, he rolled down the snow cliff.</p><br/><p>With an oppressive impact sound, he fell to the bottom of the cliff.</p><br/><p>Wrapped in his black robe, lying in the snow, his body became motionless.</p><br/><p>Ye Hongyu went to the edge of the cliff and silently watched the snow land below.</p><br/><p>As time went on, the snow and wind on the cliff became stronger. Prince Long Qing, who was almost buried beneath the snow, suddenly moved and stood up with extreme difficulty. He clutched his chest and lamely walked down the mountain. He occasionally fell down and then climbed up, as he moved slowly toward the dark clouds in the northern Wilderness.</p><br/><p>He was worse than death, just like a fool.</p><br/><p>He could not enter the Knowing Destiny State; he was like a wounded wild dog without a home.</p><br/><p>Because of his violent struggling action, the arrow wound in his chest that had been temporarily stopped by the Taoist aura burst open again. The fresh blood spilled from his fingers and dripped onto the snow, leaving a long red trail below the cliff.</p><br/><p>It did not last long for it was quickly covered by the snow and wind.</p><br/><p>His miserable and pitiful figure was also covered by the snow and wind in the end.</p><br/><p>Ye Hongyu watched his figure disappear into the snow and wind. She remained silent.</p><br/><p>She did not know when he would fall down again, unable to climb back up, and eventually turn into an icy cadaver in the frigid Wilderness. She only knew that the guy who had once been capable of threatening her was alive in body but dead in the heart.</p><br/><p>After an unknown period of time, she slowly turned around and quietly looked towards the verdant valley on the other side of the snow cliff. She said with no emotion, \"Some people have to die, so... \"</p><br/><p>She stopped speaking abruptly and stared into the distance, falling into silence for a long time. The snow and wind gradually blew her face, making her detached beautiful face as cold as an ice-carved beauty.</p><br/><p>Suddenly, she blinked.</p><br/><p>The icy frost on her eyelashes fell into pieces.</p><br/><p>The grass, which had previously occupied the entire snow cliff, was rapidly wilting with the destruction of Prince Long Qing. The peach blossom on the firewood was also dying petal by petal. But as she blinked, the situation on the snow cliff changed again.</p><br/><p>The green grass no longer withered or flourished. The peach blossom no longer died away nor reopened. They just remained in stillness in her blinking moment, as if time had frozen all living things.</p><br/><p>Some things were not frozen. The snowstorm still blew quietly on the cliff and her red dress danced with the wind.</p><br/><p>The cold wind swirled with snowflakes circling around her body, gradually becoming a clear snow girdle. It continued to spiral around her waist at a high speed. The two pieces of lace floating behind her red dress were blown up by the wind and gently tapped the snow girdle on her waist as if a brush was dipped into clean water. The snow girdle suddenly became bright red.</p><br/><p>...</p><br/><p>...</p><br/><p>On the two steep cliffs in the depth of the Tianqi Mountains, the Zhishou Abbey Wayfarer, Ye Su, and the Devil's Doctrine Wayfarer, Tang, were sitting silently opposite a deep and dark canyon that stood in the middle. When the peach blossom beside Prince Long Qing had opened or Ning Que had broken the realm as he cooked the fish, they had not had the slightest emotional change on their faces. The only trace of emotion was in the moment when the arrow flew through the entire verdant valley.</p><br/><p>\"A nice shot.\"</p><br/><p>\"It was a good shot.\"</p><br/><p>Ye Su gazed into the distance and said indifferently, \"Only the Academy could have such a good arrow.\"</p><br/><p>Tang looked at the other on the opposite cliff and said in a low voice. \"I only know you lost.\"</p><br/><p>Standing behind her brother, Tang Xiaotang clenched her blood-color huge blade, watching vigilantly and slightly excitedly.</p><br/><p>Ye Su slowly stood up. His thin body and simple Taoist bun looked particularly lonely among the gray and dark cliff walls. Suddenly he felt something and again looked into the distance. He tilted his lip corners and showed a warm smile.</p><br/><p>Tang also felt the movement on the opposite snow cliff and his expression changed slightly.</p><br/><p>...</p><br/><p>...</p><br/><p>Ning Que slowly put down his arm. His hand that held the iron bow trembled slightly, for this shot had cost him too much Psyche Power. His shoulder muscles were severely hurt. But he still could not help showing a happy smile on his pale cheeks.</p><br/><p>The dazzling light in Prince Long Qing's sense of perception suddenly extinguished. Even if he did not die, he could not open the heavy door of the Knowing Destiny State. If what Mo Shanshan had said was true, he might never again in his life enter the Knowing Destiny State.</p><br/><p>It was his first time using Primordial Thirteen Arrows in actual combat. Ning Que did not feel surprised at their terrifying power to destroy a strong man like Prince Long Qing. When he had been in the back of the mountain, he had been in No Doubts State. But now he was in Seethrough. When Brother II had shot the arrow, it had shattered his sleeves. Prince Long Qing had been in a critical moment of breaking the realm. Could Prince Long Qing be stronger than Brother II?</p><br/><p>Mo Shanshan looked at him with her dark eyes wide open, looking rather confused. She closed her thin red lips tightly. She seemed endlessly puzzled and shocked.</p><br/><p>Ning Que rubbed his shoulders, looked at her and said with a smile, \"Are you shocked by my bow and arrow?\"</p><br/><p>Mo Shanshan gently nodded.</p><br/><p>Ning Que proudly said, \"Isn't it powerful?\"</p><br/><p>Mo Shanshan nodded again.</p><br/><p>Then she said solemnly, \"You've won the gamble. Why did you still shoot?\"</p><br/><p>Ning Que said, \"The purpose of fighting is not to win, but to make the enemy fail.\"</p><br/><p>Seeing her puzzled gaze, he continued. \"Winning without the enemy's failure is a fake victory. If one appears to lose but makes his enemy fail, that's a real victory.\"</p><br/><p>He had modified many of Mo Shanshan's thoughts completely. So she was almost able to understand his interpretation of battles. But there were still many things she could not understand, such as why he must make Prince Long Qing suffer such a terrible failure.</p><br/><p>\"Although you're the Wayfarer of the Academy and have the support of the Tang Empire, Prince Long Qing is still a great leader of this young generation. He is favored by Great Divine Priests in the Peach Mountain and a Son of God in West-Hill in the eyes of the Haotian believers. You destroyed him in such a way. Have you not considered what consequences this might lead to?\"</p><br/><p>Ning Que replied without emotion, \"If this is a gamble, he has to pay the price after losing. If this is a battle, I never consider the consequences until the enemy is absolutely defeated.\"</p><br/><p>Mo Shanshan looked at his eyes and shook her head. \"This justification is not sufficient. You're clever enough. You should be very aware that even if he entered the Knowing Destiny State, he dared not to kill you. You should be more aware of what consequences this would lead to after you killed him. But you still chose to shoot the arrow without hesitation. Why?\"</p><br/><p>After a short moment of silence, Ning Que said with a smile. \"He shouldn't have mentioned Sangsang.\"</p><br/><p>...</p><br/><p>...</p><br/><p>When Ning Que heard others mention Sangsang, he would become the coldest, most terrifying and shameless person in the world. He would do anything to kill someone who tried to threaten or control him with Sangsang.</p><br/><p>Only in this way could he be sure that others would not threaten him, and he could avoid anxiety and pain. It had become his living habit and greatest instinct.</p><br/><p>This kind of instinct had begun 14 years ago. It had continued from the drought and famine in the northern part of the Tang Empire to the bathing cask of Old Hunter in the wild forest of Min Mountain and had accompanied him to kill countless Horse Gangs in the grassland outside the City of Wei.</p><br/><p>Sangsang was his weakest point and his greatest principle. He would never allow others to hurt her, whether it was Prince Long Qing or the Tang Emperor or even the Headmaster of Academy.</p><br/><p>In Chang'an City, the princess, Lee Yu, thought that she had discovered Ning Que's weakness and lifeline, namely Sangsang. On the snow cliff a few days ago, Prince Long Qing had tried confirming Sangsang as his weakness and lifeline according to the intelligence of the Divine Hall.</p><br/><p>However, all of them were wrong.</p><br/><p>Sangsang was not Ning Que's lifeline.</p><br/><p>Sangsang was Ning Que's life.</p><br/><p>...</p><br/><p>...</p><br/><p>Therefore, in order to save Sangsang, it was natural for Ning Que who most feared death to ignore his own life and the lives of others. He did not care about the war or peace in the world, either. Therefore, even if the other party was Prince Long Qing, Ning Que would still choose to kill him with one arrow. And Ning Que never minded the consequence and felt very happy.</p><br/><p>After a short rest in the meadow, Ning Que recovered himself a little and prepared to put the Primordial Thirteen Arrows back in his wooden box. Suddenly he tilted his brows and felt a slight pain in his eyes, as though he had been stabbed by a needle.</p><br/><p>He was shocked. He looked up again to the snow cliff in the distance. Suddenly a very bright light appeared in the peaceful and silent world of the sense of perception. The light was incandescent, cold and powerful, even more dazzling than the one when Prince Long Qing had tried to break the realm. It made others feel very frightened.</p><br/><p>Someone was breaking the realm!</p><br/><p>Someone was breaking the realm on the snow cliff!</p><br/><p>Someone was entering Knowing Destiny State on the snow cliff!</p><br/><p>The person who was entering Knowing Destiny State was stronger than Long Qing!</p><br/><p>Ning Que felt the aura of the Haotian Divine Light in the incandescent light and inferred the identity of this person in the shortest time and the fastest speed. Suddenly he became extremely shocked.</p><br/><p>But he did not hesitate or think of anything else. He quickly picked up the iron bow, put an arrow on it, took a deep breath and shot the arrow toward the faraway cliff!</p><br/><p>The static lake became violently turbulent; the air in the forest was ill at ease.</p><br/><p>Before the white turbulence of Qi of Heaven and Earth disappeared in front of the iron bow, Ning Que quickly took out the embroidered purse Master Yan Se had given him and firmly clenched it in his palm. He stared at the broadleaf forest in the south of the valley and said to Mo Shanshan in a low voice.</p><br/><p>\"Get ready to kill another person... Tao Addict is coming.\"</p><br/>\n</div>"}