{"title": "Chapter 286: Join the Devil (XV)", "id": 286, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-286-join-the-devil-xv", "volume_title": "Volume 3", "body": "<h1>Chapter 286: Join the Devil (XV)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 286: Join the Devil (XV)</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>No matter how strong the cultivator was, once the heart was being stabbed, he should be dead, right?</p><br/><p>Ning Que remained alert, because the old monk's state and potential were way beyond any opponent he had ever met. He was not sure of the survival skill of the other party, who was five states above him.</p><br/><p>Hence, he did not remove the blade immediately. Instead, he stared into the eyes of the old monk who was right in front of him. He was searching for any sign of life in the old monk's frail-looking eyes. He turned his wrist with a jerk, destroying the old monk's heart directly with his cold, hard blade.</p><br/><p>The old monk's body shook violently as he covered his chest in pain, but he did not die instantly.</p><br/><p>Ning Que frowned, as he prepared to pull out the podao to chop off his opponent's head.</p><br/><p>The old monk stared at Ning Que's waist and suddenly, began to laugh crazily. His laughter was mad but weak, and in the end, he started sobbing as he said breathlessly, \"I understand now. Could this be fated?\"</p><br/><p>This old and strong cultivator had finally understood something from Ning Que before his death, as he mumbled, \"Born as a Devil...Die as a Devil...I thought I could...escaped from the three reigns this life. Yet I got to wait till the moment before my death to realize that my whole life...\"</p><br/><p>\"...was bounded within this mountain.\"</p><br/><p>...</p><br/><p>...</p><br/><p>Ning Que was not bothered by the old monk's words. He was not a believer in art, and had no interest in listening to his enemies' death wishes. All he wanted to do was to kill the other party completely and terminate this horrendous experience.</p><br/><p>Yet when he wished to pull out his podao, he realized that the old monk's body started to turn into mud, causing his sharp and shiny blade to be tightly stuck between the chest.</p><br/><p>Luckily, no powerful force was emitting from the blade, neither did his sense of perception experience another wave of attack.</p><br/><p>Since he couldn't pull out the blade, then why not push it in further?</p><br/><p>Ning Que hissed as he exerted force with his hands. The podao in his hands had directly penetrated through the old monk's body as he generously emitted the aura of Haoran Sword from his body into the blade and towards the old monk.</p><br/><p>Upon receiving the wave of attack from the sword, the old monk gasped and puked a mouthful of blood.</p><br/><p>After being jailed in this place for decades, he could only quench his thirst using the water droplets formed in the cracks of the rock, and fed himself with human bones and dried bodies. Though the old monk was a great cultivator who had broken the rules set by the world, he was eventually being cruelly tortured. Perhaps due to dehydration, the blood which he had vomited was sticky and black in color, like the overused oil from the bottom of the stove pot.</p><br/><p>The old monk slowly sat himself up and ignored the fact that the aura from the Haoran Sword was gradually destroying every bit of life in his internal organs. As he gazed at Ning Que's face, his hands on his knees began to spread open and once again, he created his world's famous sign, the lotus print.</p><br/><p>As he was previously injured by the blade, he was only left with a total of four fingers on both his hands. White bones could be seen from his broken fingers as blood seeped out from the wounds. The scene was horrifying. Yet when the incompleted lotus print appeared, a pure and holy aura suddenly filled his body. The warm and compassionate feeling had gradually spread out across the ground covered in broken bones.</p><br/><p>In the west, a lotus had fallen onto the earth. It was born with 32 Petals. Each petal was different, representing the different worlds.</p><br/><p>Now that only four petals remained, they had combined to form a world. Yet this made the world peaceful.</p><br/><p>Since he was unable to escape from the three realms, since he could only stay within the mountain, then what was the point of creating numerous worlds in order to overtake the three realms? Then what for insisting to let the petals fly with the wind when blooming in this mountain quietly could emphasize more on its beauty?</p><br/><p>...</p><br/><p>...</p><br/><p>Master Lotus watched Ning Que's eyes quietly.</p><br/><p>Then Ning Que heard his voice.</p><br/><p>He wasn't controlled by Master Lotus' mental power to be absorbed nor was he being sucked into his enemy's world. Instead, both of their souls met each other in the mental world. From there, they could sense each other's presence, or intention.</p><br/><p>The moment they met, Ning Que could clearly sense that his opponent's intention was peaceful. There was no joy, but more of a serene feeling from realization. This piece of intention seemed to be familiar for him.</p><br/><p>...</p><br/><p>...</p><br/><p>Master Lotus' eyes seemed as warm as the lake in spring, as he quietly looked at Ning Que.</p><br/><p>\"What was I seeking for actually? What exactly were we seeking for? Could it be that there is another new world that is different from the past under Heaven's Way? I don't know, and I don't know if Ke Haoran knew it as well eventually.\"</p><br/><p>He then gazed at the motty sword marks on the rock wall. His pale-looking face revealed a smile.</p><br/><p>\"In the end, you won. Your successor won. Is he the final winner? The Devil's Doctrine was destroyed because of you and I, but will it be revived again due to him? My revenge to you, perhaps, begins from now. Yet I'll never know how it will end. Perhaps this is the beginning of my revenge on Haotian?\"</p><br/><p>Master Lotus drew his attention back to Ning Que's eyes.</p><br/><p>A buzzing sound was heard within Ning Que's mind. He felt that many things had been passed to him from the old monk's stare. Those things were not exactly cultivation knowledge, but just some intangible feelings.</p><br/><p>\"You have already joined the Devil. If you want to practice the Devil's skills, you got to practice Buddhism first before you start walking into the darkness. Though you have little chance of success, and perhaps you'll die shortly after you start on this journey, but I still wish you luck. And I will curse you.\"</p><br/><p>Master Lotus quietly observed how he said his last piece of words in this world before he slowly closed his eyes. Both his hands on his knees were spread open and relaxed, like a wilting lotus.</p><br/><p>Ning Que's hands gripped tightly onto the hilt of the blade, as he stared blankly forward.</p><br/><p>A light breeze with a soft hissing sound blew towards them and the old monk's body, which was still hanging by the blade, suddenly cracked and dispersed with the breeze, like a soil statue. What remained were his broken bones that shattered onto the ground.</p><br/><p>The dust returned to the dust, the soil returned to the soil, and the bones returned to the bones.</p><br/><p>...</p><br/><p>...</p><br/><p>The son of an aristocratic family in the Kingdom of Song, Lotus, came to this world with a lotus. When he was still an innocent baby, he had already joined the Devil. It was not something he could choose because his family had already belonged to the Devil's Doctrine since his ancestors' time.</p><br/><p>After his marriage, his wife, whom he dearly loved discovered this secret, and was killed by his father.</p><br/><p>He stood beside her grave and swore that even if they couldn't be born at the same time, they could die at the same time. Hence, that night, he prepared to be buried together with her. That night, it was raining heavily and the wind was blowing strongly. He was in deep thought in front of the grave before he returned with his drenched clothes. That was when he started to travel around the world.</p><br/><p>He left his family and started to practice cultivation. He revealed his power at Lanke Temple, and got famous after that.</p><br/><p>He wanted to destroy the Devil's Doctrine, yet the hierarch of the West-Hill Divine Palace invited him to join the Devil's Doctrine. When he arrived at the Front Gate of the Devil's Doctrine located deep within the Wilderness, he thought that he had returned home as he realized a sense of familiarity. That was when he understood that he was indeed born to be one of them. It was not the temple, nor the Buddhism, nor the Divine Hall, nor Mountain Wa, but a mountain that was abandoned by Haotian.</p><br/><p>He still wished to destroy the rotten and polluted, stinky-looking Devil's Doctrine. Then he discovered that he should help to rebirth it after destroying it. Thus, he decided to create a brand new Devil's Doctrine, then create a brand new world.</p><br/><p>He had great intelligence and he had cultivated all three religions. He planned to use the Devil to go against Heaven, and Tao to follow Heaven and finally made use of Buddhism to reach the other side, a side beyond the three realms, a side beyond average commoners' knowledge. It was only then he could create a brand new world and wipe off the old world that belonged to the heartless Heaven. It was only then he could go back time and search for the things in the past.</p><br/><p>For that, he was willing to do evil things, yet he had no idea that while doing evil things, he did many shocking things and made a name for himself in the world. He killed tens of thousands of people, then finally, he met this person named Ke Haoran.</p><br/><p>At that time, he already had everything planned. All he needed to do was to hide behind that Moyu God picture at the Divine Hall in the Peach Mountain and waited patiently. He would wait for Ke Haoran to pass away, and for Headmaster of Academy to pass away and then begin his plan of changing this world.</p><br/><p>Yet one day, he saw a woman beside Ke Haoran. The smile on that woman's face was innocently beautiful, just like his wife, who had passed away. He smiled at her warmly like a close friend, and that was when he decided to start his plan early.</p><br/><p>He did not succeed.</p><br/><p>He was jailed alone in this scary silent area for decades.</p><br/><p>He was waiting for hope in despair.</p><br/><p>When he finally saw hope, he died.</p><br/><p>Till the moment he saw death was approaching, he understood that he didn't really care about anything.</p><br/><p>He then understood that actually, he himself was just waiting for death.</p><br/><p>That year on that rainy night, he had no courage to dig open that grave.</p><br/><p>From then on, the world was just a lonely grave to him.</p><br/><p>He was a gravedigger that was possessed by the Devil.</p><br/><p>He was already a dead person in that grave.</p><br/><p>...</p><br/><p>...</p><br/><p>Ning Que's expression remained blank as he stood still. His hands, which was holding onto the podao, were gradually lowered.</p><br/><p>Master Lotus was finally dead, yet the pieces of the consciousness that Master Lotus had previously passed to his mind remained.</p><br/><p>Those feelings were complex and messy, just like Master Lotus himself.</p><br/><p>The energy left by the last sword style that was among the sword marks on the motty rock wall was still gushing into his body as it blended together with the Qi of Heaven and Earth to change his body. The greyish cotton was blooming on the tattered cotton-padded jacket as they shivered slightly in the wind.</p><br/><p>Ning Que rubbed off the blood at the corner of his mouth as he supported himself with his blade and faltered his way to the corner of the wall. After he was certain that Mo Shanshan and Ye Hongyu were just knocked out and they were not dead, he felt relieved.</p><br/><p>If based on how he used to settle problems, he would have taken this opportunity to stab Tao Addict to death. Yet when he saw the horrible biting wounds on her body, he could not do it.</p><br/><p>Ning Que leaned onto the wall before he sat himself down. He then lowered his head and looked at his chest. He started to cough vigorously.</p><br/><p>He could feel the changes within his body, together with that consciousness which the old monk had passed to him. Fear and insecurity started to occupy his heart. If anyone knew of this matter, how would the Headmaster of Academy and Academy react? Once he lost his most reliable dependent, how could he survive on in this world that was covered with the Haotian Divine light?</p><br/><p>After being injured by a series of consecutive attacks, his body was almost breaking down. He could finally be at ease now, yet the fear and pain from his injuries started to attack his mind, making him felt awful and anxious. He did not even have the time to think about how he could leave the Front Gate of the Devil's Doctrine as he frowned in pain. He had no idea how he could face the rest of his life.</p><br/><p>With his mind filled with confusion and terror, Ning Que leaned his body on the way and fainted.</p><br/><p>The Haoran Sword style on the motty rock wall gradually fell off as the wind blew as it quietly surrounded his senseless body. The Qi of Heaven and Earth flowed into his body at a very slow pace but it did not stop. It seemed like as long as he was alive, this would continue on and on forever.</p><br/><p>He joined the Devil in the midst of the mountain range that was abandoned by Haotian.</p><br/><p>At the same time, at a faraway place in the south of the Wilderness, the Hot Sea started to freeze and the sky began to darken.</p><br/><p>This dark sky never seemed to be able to light up again.</p><br/>\n</div>"}