{"title": "Chapter 285: Join the Devil (XIV)", "id": 285, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-285-join-the-devil-xiv", "volume_title": "Volume 3", "body": "<h1>Chapter 285: Join the Devil (XIV)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 285: Join the Devil (XIV)</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The old monk let out a piercing shrill scream as his lotus-like hands that were used to nip the blade began to tremble vigorously.</p><br/><p>A wave of energy flowed down the blade and met with the Haoran Sword that was affused into the blade by Ning Que.</p><br/><p>Bam!</p><br/><p>A cloud of dust flew up in the dim Devil's Palace. The Bone Mountain started to collapse, making the broken bones and bone shavings looked like rubbish as they flew around in the sudden gush of wind, hitting and creating slamming noises on the rock wall.</p><br/><p>Both Mo Shanshan and Ye Hongyu, who were still in a coma, flew along with the strong wind and were slammed to the corner of the wall.</p><br/><p>...</p><br/><p>...</p><br/><p>The Qi from Heaven and Earth, which Master Lotus was deprived of for decades, began to repair his weak and fragile body at a continuous and horrendously rapid rate. The first thing that grew to become powerful and strong was none other than his mental power.</p><br/><p>At the same time, Ning Que was also absorbing the Qi of Heaven and Earth, before transforming them into his own primordial Qi within his body. This would finally turn into a powerful energy which he had never experienced before.</p><br/><p>In the end, both of them were still competing with each other against time. It all depended on whether Ning Que could recover faster than the old monk in terms of strength. Once he got stronger, he would be able to kill the opposite party completely.</p><br/><p>Thus, Ning Que used neither the talismans in the pouch nor the Primordial Thirteen Arrows. These methods would need to make use of the Qi of Heaven and Earth to strength the attack, as well as the user's Psyche Power being free from any disruption.</p><br/><p>Under this situation, he strongly believed, and could only believe the three blades behind him. After all, these blades were used to kill from Min Mountain to City of Wei and from City of Wei to Spring Breeze Pavilion. They were podaos that had once killed numerous enemies.</p><br/><p>Then again, absorbing the Qi of Heaven and Earth was a method belonging to the Dark and Master Lotus was a senior of the prior generation from the Devil's Doctrine. It was a pity that regardless of the use of the method or the user's state, Master Lotus was way more experienced than Ning Que.</p><br/><p>Both parties' states were far apart from each other, thus the competing of speed would no longer be fair. Since Ning Que did not manage to stab the other party's to death, the situation was getting worse for him as the time gradually passed by.</p><br/><p>He could vividly feel that his body was much stronger than before, yet his hand, which was grabbing the hilt of the podao, began to tremble weakly. Soon, he would not be able to hold the hilt tightly because the power that came from external to his blade was starting to overtake his own strength!</p><br/><p>He lifted his head and saw the cold stare from the old monk.</p><br/><p>Their exchange of stares was no longer the same as before when they were fighting with their auras on the blade. No destruction was created, but it was as gentle and quiet as the ripple created on the lake surface when a dew rolled down from the lotus petal.</p><br/><p>The ripple spread out and a new world was created.</p><br/><p>...</p><br/><p>...</p><br/><p>Master Lotus' sorrowful cries spread across the night sky.</p><br/><p>\"This is my world.\"</p><br/><p>Ning Que looked at the starry sky and kept silent. He knew that his sense of perception was finally once again being conquered by the horrifying stare from the old monk. He had also finally understood that a foot in front of any true strong cultivator was their world, thus the opponent's strength or perception within that area was still under their control.</p><br/><p>Suddenly, the sky began to shake. There was no crack, but the shock caused hundreds of millions of stars to fall. Those stars fell across the endless sky, hitting the Wilderness in front of him. The earth moaned in pain upon the impact as it started to tremble. Winter trees and frozen grasses were uprooted and were either covered by the mud or burnt by the falling stars into ashes.</p><br/><p>He knew the meaning behind this scene.</p><br/><p>Hundreds of millions of stars falling from the night sky represented the mental strength of Master Lotus. The moaning Wilderness and plants that were impacted by the falling stars was his sense of perception. When the Wilderness and plants were burnt into ashes from the impact of the falling stars, his sense of perception would be damaged. This would either kill him or make him into a useless man who had no sense nor perception.</p><br/><p>Ning Que stood on the Wilderness as he gazed at the wildfire in the distance which was caused by the impact from the stars falling onto the earth. He then looked at the scary-looking huge pit near him on the Wilderness. He did not brush off the mud that splattered onto his body, nor did he dodge them, because he had no idea how he could dodge them.</p><br/><p>Bearing the risk that he would be cursed by the Heaven, he had just inherited his Youngest Uncle's mantle. He thought that he could finally survive through this scary ordeal, yet in the end, he fell into such a hopeless situation where he could die anytime. Could this really be fate? Was this really Haotian's curse on him?</p><br/><p>He felt cold and truly hopeless. Yet behind such hopeless feeling was a strong sense of unhappiness and an urge for him to destroy all these stars.</p><br/><p>It was as if something had detected his strong unhappiness and urge, an extreme light-toned shadow gradually cast over his head and his whole body.</p><br/><p>He stared at the shadow, as well as his own darker shadow within the shadow before he turned around abruptly.</p><br/><p>There was nothing behind him in the Wilderness.</p><br/><p>Only a statue.</p><br/><p>A black statue.</p><br/><p>The statue was like a human, yet it looked like a god as well. Because it was back facing the sun, its expression and body were immersed within the darkness of its shadow, thus one would not be able to see the features clearly.</p><br/><p>The stars in the night sky were still falling.</p><br/><p>Hundreds of millions of stars were continuously hitting the Wilderness at a more rapid speed, as they gradually destroyed Ning Que's body.</p><br/><p>Yet after this statue appeared, those falling stars, similar to how moths were mesmerized by the fire, were attracted to it by an invisible force as they started to fall slantly towards it.</p><br/><p>Unlike the loud noises created by the demanding falling stars when they hit the earth, these stars appeared to be weak like fireflies as they hit the huge black statue.</p><br/><p>Hundreds of millions of stars, like a bunch of delicate fireflies, were continuously attacking, igniting waves and waves of weak sparks.</p><br/><p>Those weak sparks were also absorbed by the black statue.</p><br/><p>The temperature of the black statue began to rise and turned red, looking as though it had been painted blood red.</p><br/><p>It should be very hot now, I suppose?</p><br/><p>Ning Que thought as he stared at the huge statue blankly.</p><br/><p>All of a sudden, he felt a sharp pain in his waist. As he lowered his head to look, he saw green gases coming out from his belt. It looked as if his belt was catching fire, yet he had no idea exactly what was burning inside his belt!</p><br/><p>...</p><br/><p>...</p><br/><p>Ning Que was back to the real world.</p><br/><p>He then realized that the old monk had already pulled out the blade from his chest by a few inches. The hard hilt had reached his waist and it was pressing on something in his belt. And that thing which was being pressed seemed to be burning right now! And it was making him crazy!</p><br/><p>Ning Que stared at the old monk's bright and moisture, yet cold and heartless eyes. His hands grabbed tightly onto the hilt as he pushed it forward fiercely.</p><br/><p>Fresh blood gushed out from the corner of his mouth, like a waterfall.</p><br/><p>He roared in pain. His feet looked as though they were nailed deeply into the rocky ground and his body leaned forward. He made use of the hard item in his belt to block the hilt of the blade as he placed his weight onto the hilt, pushing the blade an inch deeper into the opponent's chest.</p><br/><p>The old monk witnessed the blade gradually going deeper into his chest as his eyes revealed a look of disbelief.</p><br/><p>His mental strength came into contact with Ning Que's body and disappeared into thin air in an instance. It was similar to how a cow disappearing into the sea, and the speed of loss was disquieting. Only within a short period of time, his sense of perception was gone by half!</p><br/><p>Using Devil's skill to absorb the Qi of Heaven and Earth was all dependable on the precision in controlling one's Psyche Power. At this moment, the Psyche Power within the sense of perception was wilting. Naturally, the Qi of Heaven and Earth that was moving freely within the Devil's Palace could no longer enter his body. In fact, it was now flowing towards Ning Que's body!</p><br/><p>The old monk could vividly sense the strength coming from the blade in his hands was gradually increasing.</p><br/><p>He stared at Ning Que again, then lowered his head and took a glance at Ning Que's waist.</p><br/><p>A very light friction sound.</p><br/><p>Like the sound of the breeze that brushed across the lotus leaves.</p><br/><p>The sharp blade sliced off several fingers as the broken fingers slowly fell onto the ground.</p><br/><p>Like how the pure-looking lotus flower fell off petals by petals.</p><br/><p>Ning Que hissed as he violently pushed the podao in his hand together with his ongoing willpower from the Haoran Sword. The bright blade stabbed deeper into the old monk's chest and penetrated through his heart.</p><br/>\n</div>"}