{"title": "Chapter 291: Making Smoke with Pine Twigs and Washing A New Urn", "id": 291, "volume": 3, "url": "http://boxnovel.org/nightfall-chapter-291-making-smoke-with-pine-twigs-and-washing-a-new-urn", "volume_title": "Volume 3", "body": "<h1>Chapter 291: Making Smoke with Pine Twigs and Washing A New Urn</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 291: Making Smoke with Pine Twigs and Washing A New Urn</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>When the old man returned to the Old Brush Pen Shop in Lin 47th Street, Sangsang was still squatting beside the stove, frowning at the burning firewood. She was attentively thinking about those Divine Skills she had learnt.</p><br/><p>\"Let's eat.\" The old man said.</p><br/><p>Previously Sangsang was absent-minded and didn't notice that the old man left for some time in the middle. So she stood up surprised at his words, and looking at the edge of his clothes wet from snow water, she faintly understood something. Then her lip slightly lit up to show a smile.</p><br/><p>The old man responded with a smile too and sat beside the table.</p><br/><p>Sangsang didn't ask what he had gone to do, but served him a bowl of rice. And then she warmed the yellow croaker, pinched with chopsticks the fattest one onto the pile of rice in his bowl, and added a spoon of delicious steaming soup on it.</p><br/><p>\"What did Aunt Wu make at noon?\"</p><br/><p>\"Lettuce with mashed garlic.\"</p><br/><p>Sangsang asked, \"Did it taste good?\"</p><br/><p>The old man answered, \"Good enough... but I don't understand, why she didn't put salted fish in the dish.\"</p><br/><p>Sangsang raised her head and asked with confusion, \"Why salted fish?\"</p><br/><p>The old man felt confused too. He looked at Sangsang's little face and said, \"But last time, you put it in the lettuce.\"</p><br/><p>Sangsang lowered her head and said, \"When young master cooked lettuce in our childhood, he had no mashed garlic to put in the dish.\"</p><br/><p>The old man stiffened and sighed, \"Eh, I remember, when I was young in Taoist temple, we rarely ate fried green vegetables. I don't know why I seek such enjoyment at this old age.\"</p><br/><p>\"Young master said, 'it is easy to go from being thrifty to being luxurious, but not as easy the other way round'. It is the same for everyone, so master, don't be so self-reproachful.\"</p><br/><p>Sangsang comforted him.</p><br/><p>...</p><br/><p>...</p><br/><p>At daybreak the next day, the old man got up, carefully put the quilt in order and returned it to the corner behind the shelf. And then he pushed open the door of Old Brush Pen Shopand and looked at the morning light faraway, narrowing his eyes.</p><br/><p>The sentence \"it is easy to go from being thrifty to being luxurious, but not so easy the other way round.\" Sangsang quoted from Ning Que and it somewhat touched him. He found himself too indulged in the comfort of Old Brush Pen Shop and actually forgot to seek for the shadow of Nightfall.</p><br/><p>The breakfast was also hot and sour noodle slice soup. After eating, the old man prepared to wash the dishes, when Sangsang gave him the tip to put them down and take a rest. The old man smiled, saying he would go out for a stroll and might not be back for lunch.</p><br/><p>\"That's good. It's not proper to be indoor all day.\"</p><br/><p>Thinking it over, Sangsang fished out taels of silver from her belt and handed it to him, saying, \"If you get tired, find a tea shop and have a rest. Don't make a fuss about spending money. Don't go too far either. If you lose your way, don't feel embarrassed to ask for directions from others. People in Chang'an City are all warm-hearted. You can also look for any casino and tell them you know Mr. Qi, and then you will bring you back.\"</p><br/><p>Fearing that she would not stop her chattering, the old man took the taels of silver, carefully put it in his arms and repeatedly answered \"yes\" before he left.</p><br/><p>After leaving Lin 47th Street, he went straight to the north. He passed by the royal palace through the Eastern City and went out of Chang'an City through the Xuanwu Gate. Finally, he reached a small hill covered with snow in the north of the city. Climbing high and gazing afar, he could naturally see things in the far distance. He looked into the north silently, where stars were dim, as if they were about to integrate into the brilliance of Haotian.</p><br/><p>...</p><br/><p>...</p><br/><p>The peach branches at the back garden of the Southern Gate Temple were covered in thin snow.</p><br/><p>Li Qingshan, the Nation Master, leisurely leant against the window sill and looked at the snow on the prune tree and the small bud that might never bloom. All of a sudden he coughed fiercely, and his coughing echoed in the tranquil palaces of the Taoist temple. It sounded excruciatingly painful.</p><br/><p>Removing the handkerchief that had covered his mouth, he found there were spots of blood on it, which was like plum blossoms in full bloom. He glared at the prune tree outside and scolded, \"You ought to bloom in winter yet you don't, but you let your Taoist master bloom first.\"</p><br/><p>Taoist nuns and boys of the Southern Gate Temple were silently waiting outside the palace, their faces filled with anxiety, yet nobody dared to go inside.</p><br/><p>He Mingchi went over with a bowl of medicine and sighed to a Senior Sister to take away the yellow paper umbrella under his arm. He stepped upon the dark and smooth Paulownia wood floor and walked to Li Qingshan, saying with grief, \"Master, don't work with hexagrams any more.\"</p><br/><p>Li Qingshan took the medicine and slowly drank it up, and then he folded the handkerchief over and wiped off the remaining medicine soup on his beard. Looking at his favorite disciple, he said emotionlessly, \"Last night Wei Guangming appeared. Sure enough he was still in Chang'an City. He was among the three workshops, but I faintly feel he intended to leave. So there is something urgent to tackle.\"</p><br/><p>He Mingchi took the bowl and said, \"The Military Ministry and the Imperial Center Administration have both gotten prepared. For fear of startling that man, they haven't sought him out in the streets at the north of the Scent Workshop. Now only Uncle is headed in that direction.\"</p><br/><p>Realizing that the Senior Brother was seeking for that terrifyingly strong guy in the Eastern City all on his own, Li Qingshan nodded after quite a long time of silence. He didn't say anything more but signed to those outside the palace to scatter and the disciples to leave.</p><br/><p>...</p><br/><p>...</p><br/><p>A black horse carriage was headed for the streets of Eastern City in Chang'an. If it was not examined closely and touched by hand, it would be difficult to tell that the carriage was forged with steel, which was carved with complicated and subtle lines. The special wheels ground on the tough stone path, making muffled rolling sounds.</p><br/><p>Master Yan Se in the horse carriage was leaning on the delicate soft seat. His triangle eyes were greedily seeking out the Great Divine Priest of Light through the curtain. Where was one to find such a serious, old, obscene face?</p><br/><p>If we did meet, then we could fight. If I really could not beat him to death, then I would die peacefully. It is not a big deal to kick the bucket now, anyway, we will all die one day. Moreover, I already have a successor.</p><br/><p>The cornice of Spring Breeze Pavilion newly-built a year ago breezed over, which suddenly reminded Master Yan Se of Chao Xiaoshu, and then the disciple who had never been heard of. That disciple was a student of Second floor of the Academy, naturally the master didn't bother to worry about his safety. He only thought that it was a pity that he might not have a chance to see him again.</p><br/><p>Just at the moment, he remembered that day when Ning Que left Chang'an, he earnestly asked him to look after that little handmaiden named Sangsang. Yet these days he was too occupied to visit her— The old Taoist waved his head, thinking to himself, \"Now I have to seek that guy in Eastern City, then after that I will go and see her.\"</p><br/><p>...</p><br/><p>...</p><br/><p>Today, the first visitor at the Old Brush Pen Shop was not Master Yan Se, nor was it that old man gazing at the north outside Chang'an City, but a young fatty. That fatty jumped off the horse carriage, and although he didn't shake the slate ground of the Lin 47th Street as fiercely as an earthquake would, his plump cheeks rippled for quite a while.</p><br/><p>The young fatty pushed open the tightly-closed door of Old Brush Pen Shop and directly sat in the round-backed armchair of Ning Que. Then he felt that his thigh was nipped and ached, so he muttered something in anger and then shouted, \"Serve tea.\"</p><br/><p>Actually he didn't think himself an outsider at all.</p><br/><p>Sangsang was preparing to make smoked bacon with pine twigs, a dish she had just learnt from Aunt Wu. She intended to give Ning Que a surprise by making a large amount of Jin (1 jin =0.5kg) of it. Suddenly she heard that shout and was surprised, because she didn't open the door these days. While cleaning her hands with a towel, she went to the front of the shop, closing the door immediately.</p><br/><p>Seeing that the little darkish handmaiden coming over first went to close the door, instead of serving him, the young fatty slightly froze and said with frowning eyebrows, \"You close the door at daytime, how will you earn money?\"</p><br/><p>Sangsang explained, \"If I leave the door open, the threshold will be broken by those who scramble for sections.\"</p><br/><p>The young fatty stiffened and then agreed secretly in his heart. How could he forget that Ning Que was now quite famous in Chang'an City! He looked at the little handmaiden and asked, \"I'm Chen Pipi, has Ning Que ever mentioned me?\"</p><br/><p>Sangsang didn't show any surprise at the name, and she just slightly bowed and said, \"Sangsang greets you, master Chen.\"</p><br/><p>Chen Pipi rubbed his lovely chubby jaw and looked up and down at the thin short girl. Suddenly he shook his head, saying, \"It is right for Ning Que to ask me to look after you. Although a genius like me is born distinguished and totally different from those vulgar ones in the secular world, you will encounter problems sooner or later if you always take things for granted.\"</p><br/><p>Sangsang said, \"I know you are Chen Pipi.\"</p><br/><p>She had been to the Academy several times, but never met Chen Pipi. Chen Pipi believed that there was definitely no problem with his uncomparable memory, so he asked in confusion, \"Why are you so sure that I'm that genius?\"</p><br/><p>Sangsang looked at him and earnestly explained, \"Young master often mentioned you. He said, you were fat but not ugly, nor obscene, we could even say, you were good-looking, which was quite rare. So I know it's you.\"</p><br/><p>Chen Pipi's right hand which was rubbing against his jaw slightly froze, and he thought to himself, \"It is unknown how Ning Que slandered me in daily life.\" But at the same time, he felt somewhat pleased at the comment although it mentioned \"fat\", so for a moment he actually didn't know what to say.</p><br/><p>\"Let's change the topic.\"</p><br/><p>Chen Pipi coughed and pretended to be serious and mature. He looked at Sangsang and said, \"On the request of Ning Que, I come to see you today. After all, as his Senior Brother, I have the responsibility to do so.\"</p><br/><p>He was expecting that Sangsang would be moved, but obviously she wasn't. She just thanked him emotionlessly and then went to pour him a cup of jasmine tea.</p><br/><p>Chen Pipi looked at her figure and said, \"Little Younger Brother said he would invite me to have a meal here. He said you are a skilled cook.\"</p><br/><p>Looking at his chubby face, Sangsang frowned and secretly thought, \"No wonder you are so fat.\" But she had no intention to ask him to stay. She just put the tea beside him and softly said, \"After young master comes back, I will cook for you.\"</p><br/><p>The meaning of that sentence was quite clear. \"Now that Ning Que invited you, we have to wait for him to tell me personally. It is quite out of the question for you to barge in and beg for food this way. How should I treat you? I have to serve one more pair of chopsticks and more dishes. In view of your plump figure, I would have to add at least two dishes, which should contain meat. It will cost me a lot of money!\"</p><br/><p>Chen Pipi was hurt by her words. Looking at the jasmine scum in the bowl, he couldn't help cramping in the face. He could do nothing but tell her the truth, \"Ning Que said somebody smarter than me was hiding in this shop. After pondering it over I thought it is impossible, so I come to verify it.\"</p><br/><p>Sangsang looked around the shop, and found nobody else was in there.</p><br/><p>Covering his forehead, Chen Pipi helplessly said, \"That smart person is you.\"</p><br/><p>Sangsang stiffened, thinking to herself, \"Ning Que always said I was stupid, and how can he think I'm smart?\"</p><br/><p>Although she felt happy at being praised by young master as the smartest person, she still felt confused. Frowning, she pondered it over for some time and suddenly recalled something, shyly saying, \"I'm not smart. I just have a good memory.\"</p><br/><p>Chen Pipi gave her a scornful smile and said, \"Even in terms of memory, I don't believe there is someone stronger than me.\"</p><br/><p>Sangsang lowered her head to see the small and exquisite toe cap stretching out of her cotton skirt, having no intention to argue with him.</p><br/><p>\"Ning Que is inferior in cultivation, and also has poor insight. My talent has been confirmed by the Haotian Taoism and is generally acknowledged by the back of the mountain of the Academy. Yet he dares to say that you are smarter than me! What's wrong with him!\"</p><br/><p>Chen Pipi grew angrier at her reaction, and furiously said, \"Why do you look at your toe cap? Am I the sort of man who would make things hard for you?(letting somebody wear a toe cap means making things hard for somebody)\"</p><br/><p>Sangsang knew that this master Chen had a close relationship with young master, but although she was quiet and somewhat dull, she still couldn't help feeling angry on hearing her young master being scorned at. Instead of looking at the embroidered shoes, she looked up at Chen Pipi's eyes and said very earnestly, \"My strong memory is also generally acknowledged in the City of Wei.\"</p><br/><p>It was the truth. Back then in the City of Wei, she was always the most popular notary, because she had the best memory and never told lies. But as for the City of Wei and the Zhishou Abbey... there was really a huge distance between the levels. Yet Sangsang was still as earnest as before, showing no embarrassment, she outrightly told Chen Pipi that her memory was generally acknowledged by people in the City of Wei, it was really excellent.</p><br/><p>If two people said they were generally acknowledged respectively, then generally speaking, they would never acknowledge each other. Perhaps that was why people said, those learning martial art would always pursue No.1. Especially when facing a girl with such a temperament. If Chen Pipi wanted to prove he had better memory than Sangsang, he had to show his true ability instead of just relying on his words.</p><br/><p>\"Let's have a competition.\" Chen Pipi said.</p><br/><p>Sangsang was not interested in competing with others on intelligence or memory. What she cared about was the preserved meat still smoking by the pine twigs, so how could she agree with him? She walked to the backyard and picked up a stick to stir the pine twigs to make the fire bigger. She then took a new urn from the kitchen and carefully cleaned it well.</p><br/><p>The other day she made a chicken soup stew which had greatly pleased the old man, that even his beard got soaked with soup as he drank it. She thought that young master also like the stewed chicken soup, and was afraid the old urn would not be big enough to make the soup, so she went to a small shop in Anping Workshop to buy a new one. She prepared to make two urns of chicken soup stew in the future, perhaps it might be enough.</p><br/><p>Looking at the busy and thin figure of the little handmaiden, Chen Pipi shamelessly persisted, \"Anyway, you should defeat me in some aspect, or else I won't go. Do you have books here? Let's compete reciting books, and the loser should treat the other one. If you think it not interesting... Let's use taels of silver to gamble!\"</p><br/><p>Hearing the word \"taels of silver\", Sangsang suddenly stopped washing the urn and looked back at Chen Pipi.</p><br/><p>Then she stood up and randomly wiped her reddish hands against her apron and turned back toward the bedroom. After a moment she went out with her face flushed, shilly and regretfully said, \"I don't understand those talisman books of young master, but I don't have a chance to read other books.\"</p><br/><p>...</p><br/><p>...</p><br/><p>-</p><br/>\n</div>"}