{"title": "Chapter 307: A Slight", "id": 307, "volume": 4, "url": "http://boxnovel.org/nightfall-chapter-307-a-slight", "volume_title": "Volume 4", "body": "<h1>Chapter 307: A Slight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 307: A Slight \"eh\" to a Beautiful Debut</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>It was the coldest time of winter. The cold winds blew fiercely against huge Tianqi Mountain. The temperature on the Snow-capped Peak was extremely low, but fortunately, the high peaks were not covered by the sea of fog that had spread over the lower parts of the valleys in the mountain range. The sun shined directly on the peaks. Although it did not increase the temperature there, the sunlight could still bring warmth to some people's hearts.</p><br/><p>As what the middle-aged man on the shore of the Hulan Sea had guessed, there was indeed someone on the top of the cold and quiet Snow-capped Peak which hadn't shown traces of human activities for years. It was a Taoist priest who wore a thin cloth and had an ebony fork inserted into his hair bun.</p><br/><p>The Taoist priest looked calm with a thin body. He carried a wooden sword on his back as he quietly stared at the scenery below him. White clouds fluttered below the Snow-capped Peak, and below that was the deserted wilderness and the Hulan Sea that spread out like a crystal-white mirror.</p><br/><p>Ye Su, a World Wayfarer from the Zhishou Abbey, and Tang, a World Wayfarer from the Devil's Doctrine, made a bet at the summit of the Front Gate of the Devil's Doctrine several days ago on Ning Que's and Prince Long Qing's speed of breaking the realm.</p><br/><p>Finally, Ning Que had won while Prince Long Qing was crippled and... lost the bet.</p><br/><p>According to the unspoken bet that they made, Ye Su could no longer join the snatching of the \"Ming\" Handscroll of Tomes of Arcane. However, it did not mean that he was forbidden to stand on the Snow-capped Peak to watch the scene from afar.</p><br/><p>He \"saw\" the middle-aged man at the Hulan Sea, yet he did not look at the man, because the man could see Ye Su as well if Ye Su could see him.</p><br/><p>He came from the Unknown Place of the supermundane, but he knew clearly that there were many stronger beings hiding in the world, such as the middle-aged man at the Hulan Sea. Even for those stronger beings of the Peak state of Martial Arts, who had nearly passed through the five states may be even as powerful as him, they would still act with respect and forbearance in front of him.</p><br/><p>Of course, if he were still the prideful wooden young master decades ago, he would have never cared about these things. However, he was not the boy he once was. His understanding of the world and himself was now on a whole different level.</p><br/><p>Yet he would occasionally miss his hotblooded years of youth that was now a thing of the past.</p><br/><p>One of the reasons why he came here was that he wanted to see who would get the Tomes of Arcane in the end. Nevertheless, as he grew up in the Zhishou Abbey, he had begun to read the six volumes of the Tomes of Arcane as soon as he became literate, so the Tomes of Arcane was not mysterious or awe-inspiring to him compared to the mortals and cultivators of the world. Hence, he did not come for the Tomes of Arcane, but for another more important reason.</p><br/><p>He was here to cherish, or perhaps to commemorate, or perhaps to in a way, recover some of his youth that had long since been lost to him. This youth was his pride.</p><br/><p>...</p><br/><p>...</p><br/><p>Ye Su silently turned around and looked towards a pond in the mountains.</p><br/><p>The pond was very small. There might be hot water gushing out from its bottom so the pond was not completely frozen. However, it could not endure the howling cold wind, so its surface was still covered with a thin layer of ice.</p><br/><p>Perhaps it was a few days ago or a moment earlier when a small hole appeared on the thin ice on the pond. Even he could not confirm when the thin ice was broken.</p><br/><p>However, he was sure that the shape of the hole was unique, like the mark left by a wooden dipper.</p><br/><p>Fourteen years ago, he had seen the exact same mark, and he never forgot about it.</p><br/><p>...</p><br/><p>...</p><br/><p>Fourteen years ago, the most mysterious \"Tian\" Handscroll of the seven volumes of the Tomes of Arcane showed a very important sign. However, the Taoist who was in charge of keeping the Tomes of Arcane chose to remain silent about this.</p><br/><p>The Great Divine Priest of the West-Hill Divine Palace entered the Zhishou Abbey and read the Tomes of Arcane, and he did not say anything about it either.</p><br/><p>However, no one had expected that Wei Guangming, the Great Divine Priest of Light, would take a step towards the sacred field of Tianqi at that time. His dark and clear eyes saw the shadow of Nightfall befalling the world.</p><br/><p>The World Wayfarers of the three sects of Taoism, Buddism, and Devil in this generation gathered in the Wilderness.</p><br/><p>The three World Wayfarers were still young. They gathered under a small tree and silently stared at ants for a long time. They kept looking at the black line for a long while before continuing on their own paths.</p><br/><p>At that time, Ye Su, the successor of the Zhishou Abbey, was very proud and confident.</p><br/><p>He denounced Tang as a devil and the talisman Qi Nian as an outsider. After that, he cut the tree into 53,333 pieces with one swing of his sword, and then he read out a talisman with which he had been the most satisfied with so far.</p><br/><p>At that moment, he did not know that as the night falls, there was a scholar on the other side of the black line that they did not dare to step over. The scholar had been sitting calmly by a small pond, and he had been joyfully reading a handscroll in his hand, with a wooden dipper on his waist. He would occasionally scoop up water from the pond with his dipper to drink when he was thirsty.</p><br/><p>Afterward, he toured around different countries, broke the realm of death, traveled to the South Sea and excitedly reported to his master.</p><br/><p>The Taoist dressed in black clothes on the reef watched him with a pitiful smile.</p><br/><p>Only then did he know that there was a man sitting on the other side of the black line that day.</p><br/><p>Thus, he could not be so prideful and confident as before.</p><br/><p>Many years later, after going through the prosperity of the secular world and the good and evils of the supermundane, he succeeded in thoroughly understanding a lot of things. Hence, his confidence was naturally built up again. However, the spirit of youth and his pride had long since left him.</p><br/><p>He had always regretted that he did not have any chance to talk to the person on the other side of the black line.</p><br/><p>But that was until today, as it seemed that he finally got the chance.</p><br/><p>Therefore, there was actually no one at the side of the small pond.</p><br/><p>He who stood on top of the Snow-capped Peak stared seriously at the pond on the mountainside. Both the ebony fork in his hair bun and the thin blouse on his body were absolutely still in the cold wind, just as his quiet and clean Taoist Heart at this moment.</p><br/><p>...</p><br/><p>...</p><br/><p>There was someone at the Hulan Sea outside the Snow Mountain.</p><br/><p>The middle-aged man looked at the lakeside in front of him and suddenly stopped in his tracks. He then took removed the hat that he had worn for many days, revealing his face. He gazed at the distant mountains. His thick eyebrows like black worms furrowed and his red lips like dense blood slightly lifted, revealing a complicated smile.</p><br/><p>He once again continued walking against the chilly wind and reached the land beyond the frozen pond. His burly and solid body completely ignored the existence of the rough winds of the Wilderness and marched north, surrounded by a chilling aura.</p><br/><p>He did not go fast, but rather quite slowly. Every time he took a step, his foot fell into the frozen and hardened ground of the Wilderness, leaving a deep footprint.</p><br/><p>He headed north towards the Tianqi Mountain after leaving the Hulan Sea. With the time passing, the chilling aura on the middle-aged man gradually diminished, and each footprint left by him became shallower than the last before they slowly disappeared.</p><br/><p>He did not blend himself with the heaven and earth as the Grand Cultivators who knew the destiny did, because what he practiced was not the Taoists Law. He used the terrifying Psyche to completely separate his physical consciousness from the heaven and earth, as if he had turned himself into a stone. If one were to close their eyes, they wouldn't be able to feel his presence at all.</p><br/><p>However, there was a sudden movement from the small pond which had remained quiet for a long time.</p><br/><p>A burst of slight buzzing sounds was heard at the side of the pond.</p><br/><p>These buzzing sounds were like the sound of a wooden dipper bailing the water, it was also like the sound leaves being rustled by the wind.</p><br/><p>But it was also like the sound of a hand slowly folding the pages of a book.</p><br/><p>...</p><br/><p>...</p><br/><p>\"I heard you were enlightened at 13, entered the No Doubts State at 30, broke the Seethrough after three months later and entered the Knowing Destiny State within a day.\"</p><br/><p>\"I heard you climbed the back mountain every day during that 17th year without meeting any obstacles.\"</p><br/><p>\"I heard that when you first climbed the back of the mountain of the Academy, you saw four words outside on Wooden Door.\"</p><br/><p>\"The four words were The benevolent likes water. \"</p><br/><p>\"So you love to be close to clean streams and quiet ponds in your life.\"</p><br/><p>\"That seems to be the case, even now.\"</p><br/><p>Ye Su listened to the sound coming from the lakeside of the small pond on the distant mountainside, and silently considered these words in his heart. After making an extremely restful and satisfied sigh, he smilingly took a step forward towards the edge of the Snow-capped Peak.</p><br/><p>As he took this step, the thin wooden sword behind him floated into the air with a buzz.</p><br/><p>The sun in the sky seemed to turn brighter all of a sudden.</p><br/><p>Thousands of beams of light shone on the wooden sword, which made the thin sword give out a dazzling golden light.</p><br/><p>A very pure sword style, like a condensed light, came from the top of the Snow-capped Peak. It was calm and powerful, ignoring any space and distance, and it instantly fell to the small pond that was thousands of feet away!</p><br/><p>Someone who could wield such formidable Taoists Law certainly stood at the highest point of the human world, at the top of the Knowing Destiny State. Although they had not yet broken through the realm, they wouldn't be too far away from the Tianqi state.</p><br/><p>How many times would people get to witness such powerful Taoist Sword technique in the world?</p><br/><p>...</p><br/><p>...</p><br/><p>When the pure sword style fell upon the small pond, the thin ice that encased the water within instantly thickened. Even the tiny hole was frozen at a speed beyond what the naked eye could catch.</p><br/><p>The sound of water was long gone, and a slight \"eh\" was heard somewhere at the side of the pond, seemingly to had been uttered abruptly.</p><br/><p>However, the person who made the sound reacted slowly. It took a while for his lips to move, and the \"eh\" sound seemed to be deliberately prolonged. The drawn-out squeak was more like the calling for the protagonist in an opera show's opening sequence.</p><br/><p>...</p><br/><p>...</p><br/><p>The middle-aged man at the foot of the mountain slightly frowned. At this moment, he had certainly perceived the sword style. Although he did not know where the sword style meant to stab to, he could vaguely figure out who the person he wanted to stab from all his lifelong cultivation.</p><br/><p>He had already arranged countless informants on the Wilderness and even called up the helpers in the Military Ministry. He was sure that the man undoubtedly appeared in Shubi Lake outside the City of Wei some days ago, and now how could he suddenly appear here?</p><br/><p>But he did not hesitate. As the strongest man in the human world, he could faintly feel his own fortune. He knew that it was an excellent opportunity for him. Besides, he had his pride. Thus, he ignored the meeting on the Snow-capped Peaks. Though the meeting was known by nobody, it was destined to shock the world. He then walked in awe towards the exit of the valley.</p><br/><p>A thin mist still enveloped the valley, covering the smooth and steep walls, so perfectly smooth that it seemed like to be a work of men. It also covered the sound of approaching footsteps, but it could never cover the figures of that young man inside.</p><br/><p>On the Snow-capped Peak, Ye Su, the successor of the Zhishou Abbey finally met the scholar on the other side of the line. Standing under the Snow-capped Peak, the middle-aged man thought that he would finally get to see the Tomes of Arcane. Thus, he didn't think all the time spent waiting was a waste at all.</p><br/><p>Whether it be fourteen years.</p><br/><p>Or a whole lifetime.</p><br/>\n</div>"}