{"title": "Chapter 323: Bloody Bread", "id": 323, "volume": 4, "url": "http://boxnovel.org/nightfall-chapter-323-bloody-bread", "volume_title": "Volume 4", "body": "<h1>Chapter 323: Bloody Bread</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 323: Bloody Bread</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>In the morning, Lu Chenjia woke up from a nightmare and saw Long Qing's face.</p><br/><p>That face was so strange and dirty and so close to her that she felt very sad and scared. His eyes, which were no longer clean and bright but covered with dust, especially looked so cold and made her feel very uncomfortable.</p><br/><p>\"I'm leaving now,\" she said slowly.</p><br/><p>\"You don't have to go. I'll go.\" Prince Long Qing kneeled by her side and cried, \"Please, stop coming. I'm a useless man now. My begging in the street is not a kind of cultivation and I don't expect any magical blessing from Haotian. I'm just scared to death and not brave enough to face the people or any matters either. I'm just a rat in dark and I miss the days of being a tiger. I'm living on rotten meat and I just want to be alive.\"</p><br/><p>Lu Chenjia looked at him and thought of that man before who was perfect and young. She touched his head and could not help crying out, \"You don't have to live in the dark. You can live in a better way. At least you should live with me.\"</p><br/><p>Prince Long Qing lowered his head. It seemed that he did not want her to touch his hair. He begged her and said, \"But I don't want anyone to know that I'm alive, and if I were to stay with you, they would know it. So, let me be in the dark because no one there knows who I used to be.\"</p><br/><p>Lu Chenjia stared at him and gently touched his face, which used to be so familiar and so attractive to her.</p><br/><p>\"You are the only one in the world who knows that I am alive. If you forget about me, I would be a dead man. I dreamed that I stabbed you with my sword, and if I could, I would do it without a second thought because I don't want to be that Prince Long Qing again. I just want to live a simple life.\"</p><br/><p>After saying this, he stood up and walked out of the woods without looking back once. The sun rose and shined on the dilapidated temple. He stooped and went in. He stared at the wall that was covered with snow for a long time until he felt hungry, then he went to his bed to look for something to eat.</p><br/><p>But nothing was left there. The half bread and half pot of cabbage soup were gone. They even took the precious pot away.</p><br/><p>Long Qing turned around to look at the beggars in the temple and shouted, \"Who the hell took my bread. Give it back to me! Where is my urn? Where is it?\"</p><br/><p>Then he saw two complacent beggars whose mouths were greasy and he rushed toward them immediately. He tried to get his bread back but he was too badly injured to fight back and was easily beaten down. The last thing he could do was rolling on the ground painfully.</p><br/><p>He coughed violently with blood coming out his mouth. The beggars in the temple looked at him without any mercy or pity in their eyes but took pleasure in his misfortune.</p><br/><p>He wiped the blood off of his lip and climbed toward his bed in difficulty. He put his head between his legs and murmured painfully, \"I could have anything I wanted in the palace and be respected on Peach Mountain. Who would care about that damn half bread? You can grab my bread but you will never get any food from the palace. You son of a bitch.\"</p><br/><p>Lu Chenjia covered her mouth tightly and could not help crying. The tears fell from her pale face like dewdrops. Up until now, she had never cried, even when she was tortured by Long Qing both mentally and physically from the Wilderness to Capital Cheng.</p><br/><p>However, after seeing this, she could not let Long Qing hear her crying. After a moment, she turned around and left the temple like a ghost with her Snow Horse. She was so sad that she was not even thinking about where she should go.</p><br/><p>Soon after she left the temple, a new battle took place inside of it. Maybe the beggars did not like Long Qing, who was more dirty and putrid than them, or he did not get along well with them, or maybe his murmurings enraged them. Regardless, they again beat him badly.</p><br/><p>A deep cut was made in his face and the blood washed away the dust that was on his face. Although he still had perfect skin, his face was eventually ruined.</p><br/><p>Long Qing touched his face and then discovered the blood on his hands. He laughed crazily. He tripped one of the beggars with his right leg and took out the broken pot to maliciously smash his face.</p><br/><p>A sharp piece of porcelain deeply cut into the beggar's face and stuck in his eyeball. His blood spilled everywhere and looked very horrible, making the other beggars scream.</p><br/><p>Then, Long Qing quickly cut his throat with that broken piece from the pot.</p><br/><p>\"He killed that man!\"</p><br/><p>\"Someone got killed!\"</p><br/><p>The beggars surrounded Long Qing with weapons in their hands and shouted, but no one dared to stop him because he was so calm and had no expression on his face. His madness scared them off.</p><br/><p>Long Qing did not stop even though the beggar had died after being kicked several times. He kept punching his face so many times that the face was smashed even though his fists were weak. The blood coming out from that face washed that damaged eyeball out of its eye socket.</p><br/><p>The expression on Long Qing's face turned strange and his eyes were so lax without any light or shadow in them.</p><br/><p>He rode on the dead beggar's body and cried out, \"The bread was so hard that it had to be swallowed with cabbage soup. Don't you know that? Why did you eat it without the soup? Why did you have to follow me? You ate my bread and I had nothing to eat. No one could give me bread anymore.\"</p><br/><p>His crying resounded all over the temple and he sounded crazy.</p><br/><p>The beggars who were not brave enough to watch this had all gone by now, while the others unwilling to leave their shelters were hiding in the corners. They stared at the madman and someone pleaded with him, \"Listen, listen, we drank the soup, but the bread was kept because it was too hard.\"</p><br/><p>Long Qing heard this and looked at him, asking, \"Where is it now?\"</p><br/><p>The beggar pointed at the dead man under Long Qing and said, \"On his body.\"</p><br/><p>Long Qing started to search the body and, finally, found that half bread. He stared at it and suddenly immersed the bread into the blood on the ground and asked, \"Is it softer if it's soaked in blood?\"</p><br/><p>No one dared to answer him. They watched him put that bloody bread into his mouth. They were terrified but they also felt a little strange. They could not help thinking that could they live better lives if they followed this crazy man.</p><br/><p>But what they did not know was that it was not important for Long Qing even if he would be a beggar-prince in the future because, in the past, he had been a real prince.</p><br/><p>...</p><br/><p>...</p><br/><p>Recently, people in Tuyang City, which was located on the northeast frontier of the Tang, were a little tense. It had become worse after the thousands of armored cavalry came back from the Wilderness. Even the wolf packs on Min Mountain were scared and did not howl at night.</p><br/><p>It was all because of the army in the city. People had heard that the Military Ministry in Chang'an had interrogated the general about his military orders. They wanted to know why he did not report for this important military operation and they wanted an answer now. But they received nothing from the General's Mansion since General Xiahou had been sick and the grand red doors had not opened for a long time as well.</p><br/><p>One day, when the doors were open, the people knew that something important was about to happen next. They were wondering who would be coming out soon.</p><br/><p>A decrepit horse carriage slowly ran into the city under the gaze of the people.</p><br/><p>While the carriage was about to fall apart at any time, the horse in front of the carriage was so gallant, huge, and cute when it was shaking its body. People in the frontier had seen so many horses but not one like this. They were all curious about what kind of person would drive a carriage with such a fine horse.</p><br/><p>In the carriage, Ning Que pulled up a corner of the curtain and saw a beggar under the city wall. He thought for a moment and said, \"We never intended to be beggars no matter how difficult our lives were.\"</p><br/><p>The Eldest Brother looked at him and asked curiously, \"Why not?\"</p><br/><p>Ning Que looked at the broken bowl in front of that beggar and said, \"Because food obtained through begging is easy to be stolen and always tastes bad. I would rather steal.\"</p><br/><p>Mo Shanshan did not get his point and thought seriously, \"Are thieves and robbers more understandable and sympathetic than beggars?\"</p><br/><p>\"That's the point.\"</p><br/><p>Ning Que let the curtain down, looked at her, and said, \"Understanding and empathy are so useless. You have to turn these emotions down if you want to stay alive in this dangerous world. I always consider those people as the biggest losers who, once in trouble, would feel lonely and desperate. They only could cry and hurt their own people.\"</p><br/>\n</div>"}