{"title": "Chapter 326: Everyone Has a Chain on His Neck", "id": 326, "volume": 4, "url": "http://boxnovel.org/nightfall-chapter-326-everyone-has-a-chain-on-his-neck", "volume_title": "Volume 4", "body": "<h1>Chapter 326: Everyone Has a Chain on His Neck</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 326: Everyone Has a Chain on His Neck</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>There were many issues that seemed heavy before a decision was made. However, once the decision was made, the weight bearing down would disappear within seconds. The lead-like clouds that hung over the courtyard dispersed.</p><br/><p>That was how Xia Hou felt at the moment. The moment he mentioned that he was retiring, he felt much more relaxed than before. His sense of perception and his eyes brightened, and he realized that this was the right choice after all.</p><br/><p>He had struggled between the Taoist and the Devil empires. Even someone who was as strong as him would grow weary in both body and spirit. He had been thinking long and hard about how to get out of the situation at hand and had only understood now. He understood that abandoning all wealth and glory and living like how the Headmaster of the Academy had mentioned, about not fighting and not doing anything, and retiring before he got old, was an ending that everyone could accept.</p><br/><p>No matter the West-Hill Divine Palace or His Majesty in the palace of Chang'an, they would both allow him to leave the squabbles of the court and the cultivation Jianghu world. Furthermore, Mr. First had come personally to Tuyang City, and he indirectly represented the ideas of the Academy.</p><br/><p>\"Mr. First is indeed generous.\" Xia Hou looked at Eldest Brother and said, \"I will resign from all my official positions when I return to the capital at the end of autumn.\"</p><br/><p>Eldest Brother shook his head and said gently, \"It's too late.\"</p><br/><p>Xia Hou squinted. He looked at Eldest Brother's grave expression for a while before saying in a low tone, \"Mr. First, I am still the general of the empire. There are many people who count on me, and I have to arrange their affairs. Furthermore, the war between the Central Plains and the Desolate Man would begin after the spring. I need to watch over the war from Tuyang City.\"</p><br/><p>Eldest Brother fixed his gaze on him, as if he wanted to know the reason behind why Xia Hou had to watch over the battle.</p><br/><p>Xia Hou lowered his eyes and he fiddled with the teacup. He said, \"After all, I was once a Desolate Man.\"</p><br/><p>Eldest Brother stood up and walked towards the door. He stopped before he stepped out and said, \"You're not allowed to go to West-Hill.\"</p><br/><p>...</p><br/><p>...</p><br/><p>The study of the General's Mansion was deep within the Winter Courtyard. There were many different types of weapons on the wall and not many books or calligraphy tools. A deathly and chilling aura reverberated in the room. A bleak ray of light shone through the window and it was instantly repressed.</p><br/><p>Gu Xi, a military adviser, stood by the study desk silently. He clenched and released his hands that were hidden in his sleeves. After a certain amount of struggling, he said hoarsely, \"As your subordinate, I'm unwilling.\"</p><br/><p>Xia Hou looked at the letter on his desk. The ink on it had yet to dry. He said with an indifferent expression, \"I am but just a mortal without the Tomes of Arcane. As mortals, we have to resign to fate. Retiring is one of the best fates that I can see. I am writing a letter to Chang'an stating that I am willing to resign from my positions and retire. I believe that His Majesty will give me face. I trust that Xu Shi or the Military Ministry will settle the remaining affairs in the army. As for you, if you're worried that the West-Hill Divine Palace will seek for you, you may retire with me.\"</p><br/><p>A touch of affection appeared in Gu Xi's eyes that changed into sentimentalism. He said self-mockingly, \"I was sent by the Divine Hall to keep watch on you. But who would think that after so many years, we have truly become master and servant. General, you may retire, but I have to return to West-Hill and do my duties. I don't know if we will ever meet again.\"</p><br/><p>Xia Hou looked at him. \"Do not worry too much. His Majesty and the other officials in Chang'an would not do anything to me as long as I am willing to part with my military power peacefully. As for the Divine Hall, this is, after all, the suggestion of the Academy. They would not fight with the Academy for a retired general.\"</p><br/><p>Gu Xi nodded.</p><br/><p>Xia Hou looked at the faint light that shone through the window silt and fell silent for a long time. Then, he furrowed his brows slightly and murmured, \"Mr. First of the Academy is just as generous and benevolent as I expected. But I wonder why Mr. Thirteen, the one called Ning Que, looked at me with such a strong intent to kill. He wants me dead really badly.\"</p><br/><p>The chilling deathly aura in the study grew with his words.</p><br/><p>As a powerhouse at the Peak state of Martial Arts, Xia Hou's senses were scarily sharp. He could sense the true intent of Eldest Brother. And of course, no matter how Ning Que hid it, he could sense the intention to kill in his gaze. Furthermore, at the feast in the Winter Courtyard, Ning Que had not hidden his true intentions.</p><br/><p>Gu Xi looked out of the window and said in a low voice, \"I have once reported to you, that Lin Ling seemed to have uncovered something on his last trip to Chang'an before his death. It had something to do with the death of censor Zhang Yiqi. The evidence pointed at Mr. Thirteen. Lin Ling's attempt at killing him on the grassland probably had something to do with it.\"</p><br/><p>Gu Xi lowered his eyes and continued, \"14 years ago, the betrayal of Xuanwei General was not completely settled since His Majesty had returned to the capital before he was expected and the West-Hill Divine Palace had dusted their hands off it. I can guarantee that there were survivors. I wonder if this Mr. Thirteen.. has something to do with that.\"</p><br/><p>Xia Hou was well aware of the results of the investigation made by the Psyche Master, Lin Ling, in Chang'an. He was also very clear that other than the betrayal of Xuanwei General, the only event that could link the censor Zhang Qiqi and the people who died bizarrely was the massacre case in the Yan territory.</p><br/><p>After a moment of silence, he said, \"I have killed many in the world over these years. There are even more people who would wish to kill me to seek revenge. Mr. Thirteen's hatred towards me is not very important. His Majesty and the Divine Hall are willing to allow my retirement. And the Academy had made their stand. No one would dare to kill me and no one would allow such a variable to exist.\"</p><br/><p>Gu Xi thought of the gaze that he felt when he had entered the courtyard. He considered it silently before saying, \"Mr. Thirteen is odd. We should at least check him out.\"</p><br/><p>Xia Hou gave him a look of irony and asked, \"What can you do even if you find out that he is that person?\"</p><br/><p>Gu Xi answered, \"Even if the imperial court would not interfere in this matter, they would have a way to settle it.\"</p><br/><p>Xia Hou said indifferently, \"Lin Ling had tried to kill him on the grassland. Even though I did not know about that, I will be held accountable for it. I tried to kill him by the Hulan Sea for the Tomes of Arcane. That's the second time. Do you really think that the Academy would give me a third chance to try to kill a core disciple of the Headmaster of the Academy?\"</p><br/><p>Gu Xi replied after a moment of silence. \"Perhaps there would still be many chances. The imperial court and the Academy cannot keep holding you accountable. That is very unreasonable.\"</p><br/><p>Xia Hou looked at him silently and did not speak.</p><br/><p>...</p><br/><p>...</p><br/><p>Ning Que stood by the windows and looked at the snow covered trees in the courtyard. He wondered how much money from the military allowance that the imperial court gave to the Northeast Border Military Xia Hou had kept in his own coffers to build such a beautiful garden in the far frontier fortress. He wondered if the Minister of Offerings that the West-Hill Divine Palace gave him had been turned into the fake mountains in the garden.</p><br/><p>While his expression remained calm as he thought about it, his heart lingered on the conversation in the Winter Courtyard. And the shock that he received would not dissipate in a short amount of time.</p><br/><p>Xia Hou, a disciple of the Devil's Doctrine, was a general who held important military power in the Tang empire. He had even become a visiting professor at the West-Hill Divine Palace. He was willing to become a dog of the Divine Hall and kill many innocents in Chang'an and the Yan territory. All of what he had done was to cover his sister's identity. He did not want anyone to know that the empress of Tang was also a disciple of the Devil's Doctrine!</p><br/><p>Ning Que placed his hands on the slightly cold windowsill and turned around to look at Eldest Brother who was inside. He thought about how this ordinary looking scholar with an ordinary aura had only used a simple sentence in the Winter Courtyard to persuade the strongest General Xiahou to give up all power and resign. He could not help sighing.</p><br/><p>The sibling relationship between Xiao Hou and the empress had shocked him. However, he was even more surprised at seeing for himself the power of the Academy and Eldest Brother. He could not help asking, \"Eldest Brother, how strong are you exactly?\"</p><br/><p>Eldest Brother was reading. When he heard Ning Que's question, he rolled up his scroll and lifted his head to look at Ning Que. After a moment, he smiled and answered, \"Strength is relative. For example, the goshawk might seem stronger next to an ant. But it would never fight with the ant, so the ant is not weak.\"</p><br/><p>Ning Que spread out his palms and asked, \"Senior Brother, what you have said is too profound. I don't understand.\"</p><br/><p>Eldest Brother smiled. He tucked the scroll into his waist and made his way to the window sill at a leisurely pace. He stood beside Ning Que and looked at the frozen trees and pond in the Winter Courtyard and said, \"This world, no matter whether it had been prettied up or not, is actually made up of many different worlds. For example, the palace and the city, or the Divine Hall and the ruins of the Taoist temple. Or for example, the Unknown Place and reality that is full of smoke. It is said, that when the chief monk of the Xuankong Temple preaches, numerous flying ants were bathed in light and they rose in the air. What kind of state do you think the chief monk has attained? Or for example, the abbey dean of the Zhishou Abbey had managed to produce a disciple like Ye Su, how powerful do you think he is? However, all these people never will... at least, they have yet to appear in the world. They are like the goshawks who overlook the ants. They might be strong, but they will not hurt you.\"</p><br/><p>Ning Que asked curiously, \"What kind of place is the Zhishou Abbey?\"</p><br/><p>Eldest Brother answered him seriously, \"The Zhishou Abbey is a Taoist temple.\"</p><br/><p>Ning Que waited for him to continue seriously, but Eldest Brother did not.</p><br/><p>He smiled helplessly and suddenly asked, \"Is Xia Hou the goshawk or the ant?\"</p><br/><p>Eldest Brother sighed, \"He would have been a goshawk flying in the sky above the Wilderness. It is a pity that he put a chain on himself. From then on, he became a sheepdog that had been trained by hunters. After that, he had no way of freeing himself ever again.\"</p><br/><p>Ning Que asked after a moment of silence, \"Do you have to wear a chain to become a powerhouse who is a visiting professor in the Divine Hall?\"</p><br/><p>Eldest Brother replied solemnly, \"Xia Hou worries about the empress. It is naturally more difficult for him. However, you are right too. Being a visiting professor at the Divine Hall comes with its own problems.\"</p><br/><p>Ning Que thought about Mo Shanshan's teacher and frowned. \"Could it be the same for Liu Bai and Mr. Wang, the Master of Calligraphy?\"</p><br/><p>Eldest Brother lamented, \"The Sage of Sword, Liu Bai, was hailed as the strongest powerhouse in the world. Even the hierarch of the Divine Hall has to be polite to him. However, the Haotian Divine Light shines on all. As long as you live in Haotian's world, you have to abide by certain rules. We are lucky to be in the Academy, and are relatively freer and more fortunate.\"</p><br/><p>It was a simple statement, but it made Ning Que a little surprised.</p><br/><p>He had sensed something from the terms like rules and freedom in the statement. It was especially so for the last statement, that they were relatively freer and more fortunate in the Academy. It gave him a lot of new ideas.</p><br/>\n</div>"}