{"title": "Chapter 331: There Was Snow in the Lane at the Beginning of New Year", "id": 331, "volume": 4, "url": "http://boxnovel.org/nightfall-chapter-331-there-was-snow-in-the-lane-at-the-beginning-of-new-year", "volume_title": "Volume 4", "body": "<h1>Chapter 331: There Was Snow in the Lane at the Beginning of New Year</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 331: There Was Snow in the Lane at the Beginning of New Year</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The military counselor's body was burnt to ashes in the courtyard, while the snow on the flagstone gradually melted away around the human-shaped island, under the effect of the weak fire talismans once mentioned by the deceased with such contempt.</p><br/><p>Ning Que stood aside in silence and felt satisfied with his former performance. He was not aware of his Eldest Brother's happiness for him in the Winter Courtyard of the General's Mansion.</p><br/><p>Ning Que had never expected the military counselor Gu Xi to be such a powerful Talisman Master that he could tear the Qi of Heaven and Earth apart into numerous broken turbulent flows. Gu Xi had used at least thirty Fu characters, yet it was incredible that these Fu characters didn't interfere with each other. Faced with the long-cherished preparations of the enemy, Ning Que withstood it in the most straightforward way. He had faith that he could crush all plots with his strength, and he was satisfied that he made it.</p><br/><p>When he tore through Gu Xi's head, his sorrows and bitterness seemed to fade away. He became clear-minded and recalled the thousands of stones at the Front Gate of the Devil's Doctrine. He suddenly understood a lot of things.</p><br/><p>Under the shade of a tree in winter, he felt depressed. \"How must I eliminate this depression? Call upon the Great Spirit from the chest? Or shed aside all indecisiveness and excessive caution, and simply focus on killing those that deserve death.\"</p><br/><p>\"I come from the mountain, the river, and the grassland, and I come from the General's mansion in the village, and I come to end your life.\"</p><br/><p>Ning Que spoke out the simplified version of Sangsang's poetry of revenge in a gentle voice as he held the podao and erased the footprints left on the ground. He was not worried about leaving traces to be noticed by Xia Hou, instead, he was only trying to hide any hints that he had joined the devil.</p><br/><p>After getting it done, he gently jumped back over the gray-white wall. As he once again smelled the fragrance of shallots from a residential house nearby, he paused for a moment and then walked out the lane. There was only calmness and sedateness on his face, nothing like a Devil of Death come from ghostdom stretching his bony hand out for revenge. He was just another traveler who pined for home and hearth.</p><br/><p>...</p><br/><p>...</p><br/><p>By the time Ning Que returned to the General's Mansion, the Winter Courtyard was in chaos as all the captains and servants were terrified and in shock over the death of military counselor Gu Xi. Ning Que walked silently, with no expression, to the horse carriage waiting outside the stone door of the Winter Courtyard and received his luggage from Shanshan.</p><br/><p>On the stone terrace outside the Winter Courtyard, General Xiahou was bidding farewell to his Eldest Brother. There were no feelings visible on his callous face, as though he was not bothered by the death his most loyal subordinate.</p><br/><p>Suddenly Xia Hou turned back his head to look at Ning Que.</p><br/><p>Ning Que stared back at him with a calm expression.</p><br/><p>Though he had just chopped off one of Xia Hou's arms, Ning Que didn't show any signs of elation or discomfort. Both he and Xia Hou had killed many people and violated several laws of the Tang Empire. They both knew that as long as they had the protection of their uncommon identities, as long as they left no traces behind, there was nothing that could be done against them.</p><br/><p>Seeing the arrogant eyebrow of the middle-aged man on the stone terrace and his undisguisedly murderous look, Ning Que recalled the unstoppable fist at the border of the Hulan Sea, and the striking fist he had just used earlier, and broke into a laugh.</p><br/><p>Ning Que wanted to tell Xia Hou that he would be waiting for him in Chang'an to kill him, but he held back and said nothing. He just took up the knapsacks, followed Eldest Brother onto the horse carriage, and gently lent a hand to Shanshan.</p><br/><p>...</p><br/><p>...</p><br/><p>\"As a man, it is most important to stay happy.\"</p><br/><p>In the simple and crude carriage, Eldest Brother was watching the streets of Tuyang City pass by through the window when he said suddenly, \"Hatred cannot be swept away with blood, thus killing is just meaningless.\"</p><br/><p>Then he looked back at Ning Que and said gently, \"I'm not talking about naively showing mercy to your enemies, but if the situation goes on like this, there will be no end to it. Furthermore, it is troublesome to be hunted by others continuously. Your senior brothers, senior sisters and I can hide in the back of the mountain of the Academy, but you cannot escape in the mortal world. Even if the name of the Academy is just as significant and the law of the Tang Empire is still as strict, the opponent wouldn't care if they has no fear of death.\"</p><br/><p>Listening to the teachings of his Eldest Brother, Ning Que thought for a while, then nodded his head and said nothing.</p><br/><p>The cold wind raised the curtain of the horse carriage, a strong scent of shallots wafted in from outside again. Ning Que looked out the window with wonder. The streets of Tuyang City, which were scarcely populated in the daytime, became boisterous at dusk. Soldiers and common folk were wearing a joyful smile. It seemed that the bloody incident that had happened just a little earlier hadn't made much of a difference to their lives.</p><br/><p>Recalling something, Ning Que jumped out of the horse carriage and walked into a store selling local specialties. He bought some souvenirs for Sangsang and walked out of the store. Suddenly, there boomed a resonant sound from the wall far away. He shot a glance at it in astonishment and saw that several fireworks were firing into the sky and lighting up the gradually darkened night.</p><br/><p>He stood in the middle of the bustling street, a paper bag in hand, and watched the beautiful fireworks.</p><br/><p>Today was New Year's Eve, every single household in Tuyang City was wrapping dumplings, it was no wonder that the whole city was filled with the fragrance of shallots.</p><br/><p>Fireworks were blazing, and the fourteenth year of the Tianqi era came to an end.</p><br/><p>...</p><br/><p>...</p><br/><p>Night had just fallen in the City of Chang'an.</p><br/><p>There was a black horse carriage at the corner of the Lin 40th Street with no horse there. Forged with stainless steel and cast iron, the darkened carriage was carved with complex lines, between which was a lot of accumulated ash, all of which seemed decadent.</p><br/><p>A white dishcloth showed itself from the bottom of the carriage, cleaning the ash wedged inside the complex lines on the carriage plate. Soon the lines were visible again, and the whole carriage began sparkling.</p><br/><p>Sangsang put the dishcloth into the bucket and washed it forcefully, then wiped her frozen red hands on her apron. She caught a glimpse of the door beside the Old Brush Pen Shop, and made an effort to lift the bucket into the shop.</p><br/><p>Back on New Year's Eve last year, Manager Wu and Aunt Wu of the neighboring store had invited Ning Que and her to dinner. Perhaps because of the tumult over the past few days, Aunt Wu wore a dull face when she asked her to dinner this noon, and didn't expect Sangsang to actually come.</p><br/><p>Sangsang understood and didn't go to join them.</p><br/><p>She walked to the courtyard to pour out the dirty water and gazed into the two urns, one old and one new, placed in the corner. Then she went to the kitchen and cooked a bowl of noodles, but instead of making any fried eggs, she just put in some shallots and took it for granted to be her New Year's meal.</p><br/><p>Sangsang didn't care whether or not the neighbor invited her to dinner. She favored eating a simple meal when Ning Que was not home. Finishing the noodles, she closed the shop door, climbed onto the cool kang, and snuggled into the quilt.</p><br/><p>She was born with a physique deficient in cold resistance, so it was very difficult for her to warm the quilt with her body temperature. Luckily for her, she had already become used to falling asleep after a long while. She raised her thin fingers in front of her eyes and watched the burning Haotian Divine Light between her fingers to while away the time. Then she once again counted the notes below the pillow before she finally closed her eyes.</p><br/><p>On the last night of the fourteenth year of the Tianqi era, Haotian seemed to endow a firework-like beauty to the stars up above. They melted away the thick snow clouds above the sky of Chang'an and shimmered their starlight upon the quiet and raucous courtyards of the capital.</p><br/><p>Starlight was falling upon the two lonely urns in the courtyard and back closure of the Old Brush Pen Shop on the Lin 47th Street. A lone cat seated among the residual snow on the wall was licking a scar left over from snatching the food of another feline. Raising its head to look at the stars, it mewed painfully.</p><br/><p>...</p><br/><p>...</p><br/><p>The prosperity of an empire required the unremitting efforts of a lot of people, especially for the bureaucracy that maintained the operation of the empire. On the first day of the new year, while the common folk of Chang'an were still asleep or hungover, even the yamens of the court had already started performing their duties, let alone the office responsible for the safety and security of the capital.</p><br/><p>Dozens of runners from the Chang'an local government came to the Lin 47th Street, where there was a thick cover of snow. Unlike the lively and warm atmosphere of its early years, the street had become depressed and solemn.</p><br/><p>The local government runners knocked open all the stores on the street and asked the people in there to leave in a polite and undisputed manner, allowing no one, no matter whether they were visiting relatives or just wandering through the street, to stay in the lane.</p><br/><p>Mr. Wu, who sold fake antiques, cursed as he got on a horse carriage. Aunt Wu looked back at the closed shop door beside theirs, wondering if anything might happen to Sangsang, as the little girl was still inside the shop.</p><br/><p>Sangsang woke up early as usual. After eating the meal left over from yesterday and washing the desks, chairs, pens, and inkstones, she found nothing to do, so she sat at the desk lost in her thoughts.</p><br/><p>Just then, someone knocked on the door of the Old Brush Pen Shop.</p><br/><p>She opened the door.</p><br/><p>There stood several runners of the Chang'an Local Government. They looked frosty and even ferocious, with the iron chains held in their hand clanking continuously due to the force from the chilling wind.</p><br/><p>The leading middle-aged officer was wearing an official blue suit, his eyebrows were slightly white, and his face showed the vicissitudes of life. He was the best head constable of the Chang'an Local Government, Tie Ying.</p><br/><p>Tie Ying was stunned to see the thin black girl in front of him, and asked, \"You are Sangsang?\"</p><br/><p>Sangsang was lost for a second, then she nodded her head.</p><br/><p>Staring at her, Tie Ying frowned and asked, \"Was there an old man who once stayed here over a few days?\"</p><br/><p>Sangsang looked up at him.</p><br/><p>Tie Ying took out a portrait and showed it to her.</p><br/><p>Sangsang looked at it for a while and knew that they were looking for her master, and told him, \"He is dead.\"</p><br/><p>\"I know,\" Tie Ying replied, \"This man is wanted by the court, and since you kept him for so long but never reported it to the local authorities, you have to leave with us to tell us about the details. You are suspected of harboring a fugitive.\"</p><br/><p>After thinking for a while, Sangsang stared at him and asked seriously, \"For how long will I be leaving?\"</p><br/><p>Tie Ying and the other runners of the Chang'an local government behind him were shocked.</p><br/><p>They came here to catch a criminal under court orders, but never imagined that they were after a young thin and black girl. What was even more confusing for them was that the girl was not the slightest bit frightened.</p><br/><p>Sangsang asked the next question, \"Should I take my quilt?\"</p><br/><p>...</p><br/><p>...</p><br/><p>-</p><br/>\n</div>"}