{"title": "Chapter 346: The Person Entering the Human Realm (II)", "id": 346, "volume": 4, "url": "http://boxnovel.org/nightfall-chapter-346-the-person-entering-the-human-realm-ii", "volume_title": "Volume 4", "body": "<h1>Chapter 346: The Person Entering the Human Realm (II)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 346: The Person Entering the Human Realm (II)</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Ning Que did not know that he had become the male protagonist in a novel and was about to face numerous challenges brought by other minor characters in the book. He might succeed continuously or fail continuously before finding out if he was the male protagonist or if someone like Long Qing was supposed to be the male protagonist and end up running around in dead-ends.</p><br/><p>He had been thinking about an important question since he returned to Chang'an from the Wilderness. He did not dare to cultivate at the back of the mountain of the Academy if he could not solve the problem, much less to engage in battle with others.</p><br/><p>In order to solve this question, he had made his way to Chang'an using his ID token as a visiting professor at the Imperial Center Administration in the morning of the second day, before the sun even rose. He came to the mountain path behind the old library of Academy and waited quietly.</p><br/><p>The fog on the mountain path dissipated the moment sunlight appeared in the east. Eldest Brother, who wore a pair of old straw slippers walked down the path slowly. He looked at Ning Que who was yawning beneath the tree in surprise.</p><br/><p>Ning Que bowed and asked, \"Senior Brother, where are you heading to today?\"</p><br/><p>Eldest Brother smiled and replied, \"I have been traveling with teacher for the past two years and did not know that the imperial court had dredged out a large lake under the Yanming Mountain south of Chang'an. I took a walk there yesterday and the air was fresh, and the water beneath the ice was clear. There were fishermen who broke the ice and fished and I really liked that, so I want to go and look at it again today.\"</p><br/><p>Ning Que had already gotten used to Eldest Brother's talking speed and his nagging. He could filter useless information about the scenery and how he felt and capture the essence of the conversation. However, there wasn't a main point in Eldest Brother's statement. So he asked in annoyance, \"Senior Brother, I have something to ask you.\"</p><br/><p>Eldest Brother asked in surprise, \"Is it bothersome? I want to go look at the lake, how about you ask me another day?\"</p><br/><p>Ning Que said with great conviction, \"We can't do it another day. We have to do it today.\"</p><br/><p>\"Is it long?\"</p><br/><p>\"It could be long or short.\"</p><br/><p>\"Youngest Brother, it would not be fun if it is just a riddle.\"</p><br/><p>\"Eldest Brother, do I look like someone has nothing better to do?\"</p><br/><p>After the short conversation, Eldest Brother and Youngest Brother of the Academy began to climb the mountain path.</p><br/><p>\"The important question is... the question I wanted to ask you while we were roasting sweet potatoes by the fire in the Wilderness. You told me to ask the Headmaster of the Academy when we returned, but he is still not back yet.\"</p><br/><p>\"Why do I feel like this question is a riddle by itself?\"</p><br/><p>Ning Que stopped before the row of trees that had once scratched him badly and looked at Eldest Brother. He fell silent for a moment and breathed in deeply for several times. Then, he said as calmly as he could, \"I have inherited Youngest Uncle's mantle at the Front Gate of the Devil's Doctrine. In Lotus' words, it means that I have joined the Devil. And it is true that there are some issues with my body.\"</p><br/><p>There was a slight breeze. Eldest Brother looked at a single gingko leaf that floated in the breeze on the mountain path. After a long silence, he turned to look at Ning Que. He nodded his head and said smilingly, \"Alright.\"</p><br/><p>Ning Que looked at his eyes nervously and waited for what was about to happen. However, Eldest Brother did not do anything or say anything, but shook his head with a smile and continued up the mountain path.</p><br/><p>\"So, you know that I have joined the devil... then?\" Ning Que shouted at Eldest Brother's back puzzledly.</p><br/><p>Eldest Brother's voice could be heard from ahead. \"I know, so I know, what else can I do?\"</p><br/><p>Ning Que chased up to him and asked irritatedly, \"Senior Brother, have you heard me clearly? I have joined the devil. Will the Academy burn me to death or will they close me up in the Back Cliff and not allow anyone to see me? What do the Academy rules say?\"</p><br/><p>\"They can't.\" Eldest Brother sighed softly, \"The Back Cliff was used by teacher to imprison Youngest Uncle. You did not get into as much trouble as he did and have not sinned enough. You are not qualified to be imprisoned there.\"</p><br/><p>Ning Que was startled, and he asked, \"So what will happen?\"</p><br/><p>Eldest Brother looked at him and said solemnly, \"Wait for teacher to return.\"</p><br/><p>Ning Que asked, \"What if teacher doesn't?\"</p><br/><p>Eldest Brother patted his shoulders and said, \"Then let us pretend that we don't know, alright?\"</p><br/><p>At this time, the two had arrived at the wooden door. After the long path through the mountain, Ning Que had considered the situation at hand seriously. However, he still could not understand Eldest Brother's attitude. Why did Eldest Brother not react in the way he had anticipated?</p><br/><p>The wooden door that could stop cultivators under the Seethrough state opened before the two.</p><br/><p>Eldest Brother took out a silk handkerchief and slowly wiped a bronze mirror clean before keeping it in his sleeves again.</p><br/><p>\"I heard that you visited Mistress Jian at the House of Red Sleeves yesterday.\"</p><br/><p>\"Yes.\"</p><br/><p>\"She has had a hard life.\"</p><br/><p>Ning Que looked at the bronze mirror but did not know what Eldest Brother had used it for earlier.</p><br/><p>...</p><br/><p>...</p><br/><p>The two had finally reached the peak of the back of the mountain of the Academy. Ning Que stood at the edge of the cliff and looked at the clouds beneath his feet. His thoughts wavered as he felt the cold wind blowing him and thought of the scenery of that night when he ascended the mountain.</p><br/><p>Eldest Brother stood beside him and looked at the clouds. He slowly said, \"The trip to the Wilderness was just a training session. You have done well and can officially represent the Academy and enter the human realm. You should be prepared for it.\"</p><br/><p>This was the third time Ning Que had heard about entering the human realm in two days. He looked at Eldest Brother uneasily. Even though he did not know what it meant by entering the human realm, he could vaguely guess that it was something troublesome.</p><br/><p>\"Senior Brother, what's entering the human realm?\"</p><br/><p>\"Entering the human realm means returning to the human realm.\"</p><br/><p>Ning Que asked puzzledly, \"Cultivators have experienced all sorts of challenges before becoming supermundane. Why do they have to enter the human realm again?\"</p><br/><p>Eldest Brother smiled, saying, \"That's because cultivators have got to eat too.\"</p><br/><p>It was a compelling reason since there was nothing more important in the world than eating. However, Ning Que could not comprehend the logic behind it. Wouldn't any cultivator have the ability to earn money to feed themselves? Furthermore, what has a cultivator's needing to eat anything to do with the Academy? What has it to do with the Academy entering the human realm?</p><br/><p>Eldest Brother looked at the wisps of clouds that curled and unfurled beneath his feet. He said, \"Cultivating is a luxury. The crafting of a natal item and other things all required a great amount of resources. Take your Primordial Thirteen Arrows for example. The bow and the arrow body required stainless-steel, a rare metal, and it required precious minerals. Why did no one in the cultivation world create something similar? Firstly, it is because they did not have ideas like yours, and they did not have the abilities that Fourth and Sixth Younger Brothers do. Also, the most important reason is that they are not like us at the Academy. We can use mines of the entire Tang Empire. It was not easy to make that bow and arrows of yours.\"</p><br/><p>Ning Que knew that the materials used for the Primordial Thirteen Arrows were special and rare. However, Fourth and Sixth Senior Brothers had been in charge of the planning when they had first crafted the bow and arrow. He did not know that the bow and arrows were crafted using materials of the entire Tang Empire and could not help but be stunned.</p><br/><p>He suddenly asked, \"Do the other Unknown Places have to enter the human realm? I saw that Tang and Ye Su seemed to be traveling in the world and did not have any encounters with the secular world.\"</p><br/><p>\"There are a lot of Buddhist temples supporting the Xuankong Temple. The Zhishou Abbey has got the West-Hill Divine Palace in the human realm and the West-Hill Divine Palace is supported by believers all over the world. They have most of the resources in the world.\"</p><br/><p>\"There is only one Academy in the world. It is located in the south of Chang'an. The land beneath our feet is supported by the Tang Empire, which is how we can continue to exist.\"</p><br/><p>\"It is said that the Academy is the only place that links both worlds. Other than the fact that teacher likes to get close to the human realm, the another important reason is that we can only continue to survive if we appear in the human realm.\"</p><br/><p>A strong gust of wind blew through the mountain, forging a path in the clouds before the cliff. It revealed land that was covered with snow. One could vaguely see the outlines of several villages. It was the beautiful human realm.</p><br/><p>Senior Brother pointed at the spot and lamented, \"Look at that river and mountains. We cultivators do not produce anything, but we use up resources that regular folks cannot imagine. In actuality, we are supported by the most ordinary farmers and miners in all these villages. That is why we have to do something for them.\"</p><br/><p>Ning Que looked at the human realm beneath the cliff and asked dazedly, \"What should we do for them?\"</p><br/><p>\"Younger Brother, do not worry. Entering the human realm just means maintaining the relationship between the Academy and the human realm. It is not something troublesome. You just have to remember, we have to protect the law and order of the Tang Empire and maintain peace. So we have to remember the laws of the Tang Empire and represent the Tang Empire and the Academy and participate in what happens in the world. Your trip to the Wilderness was the first step. When someone comes forth to challenge us, you have to protect the dignity of the Tang Empire and the Academy.\"</p><br/><p>\"How can I do that?\"</p><br/><p>\"To put it simply, you have to defeat all those who dare to challenge you.\"</p><br/><p>Ning Que was shell-shocked. He said, \"It's this simple and violent?\"</p><br/><p>Senior Brother said, \"The Tao Addict has returned to the West-Hill. She has told others that your thoughts about cultivation are similar to hers. According to what I know, the girl believes that the goal of cultivation is to battle. Younger Brother, is this what you think too?\"</p><br/><p>After thinking about it, Ning Que could confirm that Ye Hongyu was a good judge of character. They were similar indeed.</p><br/><p>Eldest Brother said, \"Then isn't battle the simplest and most violent thing in the world?\"</p><br/><p>Ning Que looked at the clouds that were closing up again. His brows furrowed into a line as he said, \"I always thought that something was wrong with that. Does it mean that I have to fight anyone who challenges me?\"</p><br/><p>Eldest Brother lamented, \"It is true that it is not right. It is a pity that the Academy differs greatly from Zhishou Abbey and Xuankong Temple. Nobody knows where they are located, but all the cultivators in the world know where the Academy is. That is why we cannot roam the world like Ye Su and Tang but wait here passively.\"</p><br/><p>\"Hold on, why do I think that something is not right the more we talk.\" Ning Que said, \"Eldest Brother, you are always having fun with teacher out there. And I have never seen anyone who could enter the back of the mountain. Where did all the people who wanted to challenge the Academy go?\"</p><br/><p>Senior Brother explained seriously, \"They were all killed by Youngest Uncle.\"</p><br/><p>Ning Que was stunned. He asked, \"What about the years after his death?\"</p><br/><p>\"His name lives on. What's more, every generation has their own battles.\"</p><br/><p>\"So you mean that I am the Youngest Uncle of this generation?\"</p><br/><p>\"That's because you have inherited his mantle.\"</p><br/><p>Ning Que shook his head and asked cautiously, \"So you mean that those who enter the human realm are thugs that the Academy use to maintain peace. I have to get rid of those who come to create trouble in Chang'an, right?\"</p><br/><p>\"Youngest Brother, you can understand it that way. But your use of the word 'thug' isn't very nice. It is something like what Lotus had done to protect the Front Gate of the Buddhism Sect. You have to know, that inheriting the ways of Youngest Uncle is something that is enviable.\"</p><br/><p>After a brief silence, Ning Que replied solemnly, \"You're fudging the issue, Eldest Brother, go on.\"</p><br/>\n</div>"}