{"title": "Chapter 345: The Person Entering the Human Realm (I)", "id": 345, "volume": 4, "url": "http://boxnovel.org/nightfall-chapter-345-the-person-entering-the-human-realm-i", "volume_title": "Volume 4", "body": "<h1>Chapter 345: The Person Entering the Human Realm (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 345: The Person Entering the Human Realm (I)</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>There were only two friends little handmaiden Sangsang could get along with in Chang'an. The first was the Princess of Tang, Lee Yu, and the other was Mistress Jian's maidservant, Xiaocao.</p><br/><p>The difference in status between the Princess of Tang and the maidservant of a brothel was like night and day. But Sangsang treated the both of them the same. She spoke with them blandly and was silent most of the time, preferring to listen instead.</p><br/><p>Xiaocao hit the railings twice and looked at Sangsang, who was beside her. She asked curiously, \"I heard that the Calligraphy Addict is one of the three Addicts in the world. I suppose she must be very famous. Is she beautiful?\"</p><br/><p>Sangsang nodded.</p><br/><p>Xiaocao said furiously, \"Men are indeed fickle.\"</p><br/><p>Sangsang looked at her puzzledly.</p><br/><p>Xiaocao said even more angrily, \"I'm talking about that young master of yours.\"</p><br/><p>Sangsang grew even more confused.</p><br/><p>Xiaocao looked at her worriedly and said, \"Everyone in Chang'an knows, that Ning Que brought home a beautiful woman from his travels. Are you not worried?\"</p><br/><p>Sangsang looked at her and asked seriously, \"What should I be worried about?\"</p><br/><p>Xiaocao held her hands and said worriedly, \"According to what you have said, you often sleep with your young master, so you can't marry someone else anymore. You will definitely be his concubine in the future. He did not tell you anything and brought a woman home, so it must be that he does not have much feelings for you. If that woman marries your young master in the future, she will be in charge of household matters. What will you do then?\"</p><br/><p>Sangsang lowered her head and looked at her hands that clutched the railings tightly. After a pregnant pause, she said softly, \"Young master has to marry someone when he grows up. When young master and I first came here, we returned home and immediately discussed who would make a better wife for him. Even if he wants to marry Ms. Calligraphy Addict, I won't be upset about it.\"</p><br/><p>...</p><br/><p>...</p><br/><p>\"You've missed them to death? Which parts of them did you miss? Or do you wish for them to die? You've been tortured for half a year in the Wilderness. And yet, you did not study in the Academy upon your return to Chang'an but came to have fun in the brothel. I wonder how the Headmaster of the Academy and Yan Se had taught you. Are you prepared to spend your life with women upon entering the human realm? \"</p><br/><p>Mistress Jian glared at Ning Que, dissatisfaction written plainly on her face as she berated him.</p><br/><p>Ning Que stood still and did not dare to retort. The ordinary looking woman before him was not ordinary at all. She not only ruled the brothel in Chang'an, she had a close relationship with Youngest Uncle and the Academy. He did not dare to act rashly.</p><br/><p>After his travels on the Front Gate of the Devil's Doctrine, and having heard Lotus' memories, he could be certain that the girl, Xiaoxiao, who had died before the Lanke Temple had something to do with the House of Red Sleeves. Youngest Uncle had torn apart the Devil's Doctrine because of her death. Second Brother had once said, that Youngest Uncle was close with Mistress Jian. What had happened between them? He could have asked Mistress Jian about the girl named Xiaoxiao, but he figured it was a sad past and there was no need to bring it up again, which was why he did not say anything.</p><br/><p>He suddenly thought that Mistress Jian would like to know about Youngest Uncle. He said, \"I have inherited Youngest Uncle's mantle.\"</p><br/><p>Mistress Jian was slightly surprised. She asked in a trembling voice, \"The Haoran Sword?\"</p><br/><p>Ning Que nodded, \"Yes.\"</p><br/><p>Mistress Jian looked at him incredulously with deeply furrowed brows. She leaned forward and stared into his eyes sternly. \"Only the Haoran Sword?\"</p><br/><p>Ning Que was startled and nodded once more.</p><br/><p>Mistress Jian relaxed upon his confirmation. She leaned back tiredly and said, \"That's good.\"</p><br/><p>Ning Que looked at her expression and wondered if Mistress Jian had known the truth about Youngest Uncle joining the Devil.</p><br/><p>\"I do not wish for you to walk down the same path as he did.\"</p><br/><p>Mistress Jian looked at him earnestly. \"You have to go through many challenges in order to have the world acknowledge that you are qualified to represent the Academy to enter the human realm. He was just a little turquoise robed scholar when he rode that black donkey into Chang'an. He couldn't control his mental state, and created chaos in the world and ended up in a miserable state where he couldn't even die in peace. You have to remember, to act discreetly and cautiously. You musn't offend too many people.\"</p><br/><p>This was the second time Ning Que had heard Mistress Jian seriously mentioning about entering the human realm in today's conversation. He could not help but grow curious about what that actually was. He heard her use Youngest Uncle's example as a warning to himself and could not help but laugh. He answered, \"Do not worry, I am not as strong as Youngest Uncle. If anything really happens, I will just hide in the Academy.\"</p><br/><p>\"Do not think that the Academy is really the best in the world. If the Academy could really solve all things in the world, would your Youngest Uncle end up like that? So what if he managed to cut down all those peach blossoms on that mountain after the incident had happened?\"</p><br/><p>Mistress Jian said coldly, resentment filling the crow's feet by her eyes.</p><br/><p>That was a resentment towards the Academy and the Headmaster of the Academy.</p><br/><p>...</p><br/><p>...</p><br/><p>According to the law of the Tang Empire, students of the Academy were not allowed to join the army after graduation. That was why the imperial court, where most of the civilian officials had come from the Academy, had maintained a close relationship with the Academy, while the army was more distant.</p><br/><p>This was especially so in recent times. Xu Shi, the Defender-general of the State was the figurehead of the army who remained vigilant against the Academy. And he remained especially so against the supermundane beings of the back of the mountain.</p><br/><p>The vigilance had become reality with the arrival of a memo from Tuyang City.</p><br/><p>In the memo, the famous general Xia Hou had made an earnest request to retire. The words used in the memo were filled with weariness and dismay. After the dispatch of the memo, there were many generals in the Military Ministry who felt compassion for him. A few bigwigs in the upper levels were especially angry as they knew that Mr. First and Mr. Thirteen of the Academy had visited Tuyang City and spoke with Xia Hou in the Winter Courtyard before Xia Hou decided to retire.</p><br/><p>Arranging for soldiers to enter the Wilderness without permission and the old case that had happened more than ten years ago had led many in the army to dislike Xia Hou. However, they believed that this was an internal issue and that if anyone were to punish Xia Hou, only His Majesty or the imperial court should be the ones to do so, and not the Academy. As for Xia Hou being a visiting professor of the West-Hill Divine Palace, it was not a major issue in the eyes of the citizens of Tang who were also believers of Haotian.</p><br/><p>Of course, no one dared to suspect the Headmaster of the Academy. It was just that the Headmaster had not appeared in the human realm for years. Not even His Majesty had seen the old man in years, which was why the army felt that the back of the mountain of the Academy was at fault.</p><br/><p>\"I believe that if the Headmaster of the Academy knew about it, he wouldn't allow those from the back of the mountain to do as they wish.\"</p><br/><p>Xu Shi said coldly, \"Cultivators should cultivate and not interfere with court matters. Just like the two Unknown Places hidden in the Wilderness. Those of the supermundane should care about what happens in their own world, and vice vera. Why must we be connected? Why do they have to enter the human realm?\"</p><br/><p>\"How goes the research on the case?\" He asked.</p><br/><p>\"The censor, Zhang Yiqi, did indeed have a nail in his head. The Chang'an Local Government had preserved the evidence well, but did not continue their investigation then. On the day the assistant of Xuanwei General, Chen Zixian, had died at the blacksmith, the Old Brush Pen Shop did not open for business.\"</p><br/><p>\"On the morning after Military Clergy Appraiser, Yan Suqing's death, the Yulin Royal Guards discovered that the murderer had deliberately left behind a piece of cloth. They found an outer robe in another spot in the courtyard. The clothes were made at the Lanxiu workshop, so we do not know who they belong to. However, according to the damage on the clothes found at the scene, we can be sure that the murderer was heavily injured.\"</p><br/><p>An official from the Military Ministry said, \"Two days after the death of Yan Suqing, was the semester exam of the Academy. According to students' recounts, Ning Que had made a bet with Xie Chengyun on the results of the exam. However, he took sick leave for the next two days. This had created a furore in the Academy and cannot be fake.\"</p><br/><p>Xu Shi said coldly, \"Of course, he had to take leave since he was heavily injured.\"</p><br/><p>The army of the Tang empire was very capable. Once they started an investigation, they were able to move speedily and efficiently. It was scary how they didn't take long to discover all these clues.</p><br/><p>These seemingly insignificant clues were like a net. It pointed at a vague figure, as if saying that the student of the Second floor of the Academy called Ning Que had an inextricable connection to the murders.</p><br/><p>\"There is nothing that can withstand suspicion. That is because you will have a goal to pursue once you begin to have suspicions. It is only when you search for proof when you can find evidence. Who would believe that one of the core disciples of the Headmaster of the Academy is a cold-blooded murderer?\"</p><br/><p>Xu Shi said expressionlessly, \"I do not wish to know what had happened behind these murders, and I do not wish to know what kind of person Ning Que is and what he had against his victims. I just want to know if he had violated any laws of the Tang Empire.\"</p><br/><p>The official thought for a moment before shaking his head. He said, \"There is insufficient evidence for now.\"</p><br/><p>Xu Shi frowned worriedly.</p><br/><p>The official looked at him puzzledly and asked in a low voice. \"Actually... even if we find evidence stating that Ning Que was involved in these cases, could we really apprehend him at the back of the mountain and question him? General, we should just let the matter go.\"</p><br/><p>Xu Shi looked at the sun outside the window and slowly said, \"The Headmaster of the Academy had once said, that the law of the Tang Empire came first.\" The Great Tang Empire of mine had run on this creed and strengthened its people the same way. Those from the Academy who have violated the law are punished the same way as commoners who have done the same. Even if we don't have evidence that Ning Que had violated the laws of the Tang Empire, we have to let the Headmaster of the Academy know about it. We cannot allow Ning Que to become the Wayfarer of the Academy!\"</p><br/><p>After a moment of silence, he said coldly, \"It seems that I was right to be vigilant against Ning Que. If our future Nation Master is someone evil like this, how can the Tang empire be peaceful? The cultivators from other lands have already entered Chang'an. Arrange for things to go well for them. Order the Yulin Royal Guards to not stop the battle between the two.\"</p><br/><p>The official of Military Ministry shuddered before disagreeing. He said, \"I disagree. Even if Ning Que is evil, he is a Tang citizen. How can we allow foreigners to deal with him?\"</p><br/><p>Xu Shi turned around and said sarcastically, \"Do you think that I am dumb?\"</p><br/><p>The official replied fearfully, \"Your subordinate does not dare. I just do not understand what you mean.\"</p><br/><p>\"He has to face challenges since he's entering the human realm. It was like this for Ke Haoran, and it would be so for Ning Que. I just want to make the playing field fair. I believe that the Academy would not object to my plans.\"</p><br/><p>Xu Shi said coldly, \"If Ning Que had indeed committed those crimes, he would be punished by the laws of the Tang Empire. But since we do not have evidence, I want him to lose and lose over and over again. I want him to lose his boldness and sharp edges!\"</p><br/>\n</div>"}