{"title": "Chapter 352: Red Walls and White Snow, What A Lovely Scene", "id": 352, "volume": 4, "url": "http://boxnovel.org/nightfall-chapter-352-red-walls-and-white-snow-what-a-lovely-scene", "volume_title": "Volume 4", "body": "<h1>Chapter 352: Red Walls and White Snow, What A Lovely Scene</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 352: Red Walls and White Snow, What A Lovely Scene</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Night completely enveloped Chang'an. In the darkness, white snow was dancing slowly in the dim light suffused by the lamps in the turrets of the imperial city. It was a very beautiful scene under the backdrop of the red wall of the palace.</p><br/><p>Being the most remote part of the moat, this area was enveloped in a quiet atmosphere. Even when the snow fell into the river, it would just disappear peacefully without making any sound. The two were walking at this moment and the sound of them treading on the fluffy snow was very clear against the silent environment.</p><br/><p>Mo Shanshan brushed a lock of her flying hair away. Looking at the flying snow and the red wall, she said quietly, \"Snow is very rare in the Great River Kingdom, as it is located in the south.\"</p><br/><p>Imagining the far away land, which was supposed to be as warm as spring all year round, Ning Que said with expectancy, \"I would like to visit it one day.\"</p><br/><p>\"The Great River Kingdom has a small territory and population, it is a weak country. What makes it worse is that its northern neighbor, the South Jin Kingdom, is strong, and the relationship between the two countries is hostile. But despite all these disadvantages, it remains a peaceful place and its people have been living a happy life for hundreds of years. Do you know the reason?\"</p><br/><p>Ning Que shook his head.</p><br/><p>Looking at the imperial palace of Tang, Mo Shanshan said peacefully, \"It is because of Tang and this imperial palace. Although the two countries are very far away from each other, and they are not even adjacent, Tang and the Great River Kingdom have always been friends. It is Tang that has been protecting my country.\"</p><br/><p>Although Ning Que didn't understand why she brought up this topic, he knew perfectly well that what she said was the truth.</p><br/><p>\"It was clear to both the South Jin Kingdom and the Great River Kingdom that if the South Jin Kingdom did invade the Great River Kingdom, the soldiers and the King of Tang would not stand by. Every other country thinks Tang is too ambitious and warlike, only people of my country don't think so, because for us only when Tang exists, can the dangerous world be safe for us.\"</p><br/><p>Mo Shanshan said with a smile, \"The world of cultivators is never separate from the secular world, because only when we are strong can we ensure that Tang and the Great River Kingdom are safe and peaceful. What you should do is to improve your own ability, so that Tang can be much stronger.\"</p><br/><p>Ning Que didn't get her until this moment. He knew that this afternoon when they were on the street outside of the Ministry of Rites, she felt his hesitation and therefore was trying to comfort him by telling him the story of snow and the current affairs of the world.</p><br/><p>He said while shaking his head, \"Thanks for your comforting, but actually, I am not completely lost. I understand that it is not enough to keep the world peaceful only by avoiding wars. But I don't understand why such a sublime being like the Monk Guan Hai is still haunted by the feeling of wanting to win. Why does he have to fight with me?\"</p><br/><p>\"When seeing a very tall wall, people always want to go to the other side to see what is there. And when seeing a mountain, they want to conquer it and climb to the top to see the views.\"</p><br/><p>She pointed to the wall of the palace shrouded in darkness across the river, and said, \"Cultivators are normal people. They are also very curious. But the difference is that they are also very proud and their pride can even intensify that curious feeling.\"</p><br/><p>Her words reminded Ning Que of the feelings he had when he was listening to Chen Pipi talking about the truly powerful people, the night when he successfully climbed to the top of the back of the mountain and the excitement when he saw the mountains behind the sea of clouds.</p><br/><p>\"For cultivators, the long trek of cultivation leads to the Unknown Place. But their respect for this destination fills them with the eagerness to catch up with others or even to surpass them. The problems are that they don't know where to find Zhishou Abbey or Xuankong Temple, but they do see the Academy and it naturally becomes the mountain they must climb.\"</p><br/><p>In the dancing snow, Ning Que and Mo Shanshan were walking under the big black umbrella. When the conversations about topics of the Academy, the secular world and the challengers ended, they sank into silence for a long time looking at the thin ice layer and the melting snow on the river. Only calligraphy and Talisman Taoism sparked some occasional talks between them.</p><br/><p>The life-threatening adventure on the Wilderness gave rise to a tacit understanding between them, and this feeling became even stronger as they had been traveling together in Chang'an recently. When their shoulders touched slightly, when he smelled the scent of her hair, that feeling went deeper and deeper. When they realized that they knew exactly what the other's every gesture and expression meant based on their common love of calligraphy and Fu characters, a happy and peaceful feeling started growing in their heart.</p><br/><p>The snow finally ceased when they walked to a bridge on the moat.</p><br/><p>Ning Que stopped to close the big black umbrella.</p><br/><p>Mo Shanshan kept walking a few steps and then turned around to look at him. As she moved, her rich black hair fell from her shoulders. Her dress was as white as the falling snow, stunning against the red wall.</p><br/><p>Ning Que looked at her beautiful face carefully. Her red lips were pressed tightly and her eyes were peaceful and concentrated, which made him a little nervous.</p><br/><p>Mo Shanshan was also looking at him, she said, \"I said I liked you at the Front Gate of the Devil's Doctrine.\"</p><br/><p>Ning Que was taken back, then he said with difficulty, \"I remember.\"</p><br/><p>Mo Shanshan rose her head, her round face full of pride and certainty, \"I want you to like me.\"</p><br/><p>Ning Que looked at the red wall behind her. After realizing that there was nothing to look, he turned his eyes to the moat flowing under the bridge. To his disappointment, the river was not worth looking at either, as it was as dark as ink, so he had to move his eyes back to her face again. Finally he said seriously, \"That seems fair.\"</p><br/><p>Mo Shanshan lowered her head to look at the tips of her shoes and said softly, \"And do you like me?\"</p><br/><p>...</p><br/><p>...</p><br/><p>Ning Que looked back to the wall again. This time, he found the wall a very beautiful backdrop, as it was higher than his eyesight and therefore took up a large proportion of the area he could see.</p><br/><p>Life was full of questions and addictions. Mo Shanshan was the Calligraphy Addict and Ning Que found that she was also a question, the hardest question he had met in his life. Therefore, before he made sure of the answer, he needed to think carefully and to roll over the past memories many times.</p><br/><p>It was at the blue seaside where he met her. That morning, he first saw her blue belt and then saw her sitting on the tree. Then they started the journey together, he remembered the coldness and freedom in her sparkling eyes and her cute little face. He also remembered how she demonstrated the Half Divine Talisman and how she fell from the sky. Then, they took a carriage on the way back, discussing about calligraphy and Talisman Taoism. After that, they went to the palace and then the Wilderness. On the way there, they trekked in snow and hunted fish together. Once walking through the valley carpeted with stone, she was on his back and guided him. He remembered she told him how much she liked his black horse and his calligraphy. And she said she liked him at the mountain of bones when she was dying.</p><br/><p>The feelings and the thoughts he had before reemerged as these pictures passed through his mind quickly. He was still unsure of many things, but he was very certain of one thing. He felt so embarrassed that she started the talk first and didn't want to procrastinate one more second to tell her the answer.</p><br/><p>He looked at her and the her fluttering eyelashes and said certainly, \"I do like you.\"</p><br/><p>Mo Shanshan felt her body stiffen. She avoided his eyesight and walked to the bridge. A shy smile flashed across her face when she looked down at the dark river.</p><br/><p>...</p><br/><p>...</p><br/><p>The fight between Ning Que and the Monk Guan Hai in the hall of the South Taoist temple didn't attract any attention of the secular world. In normal people's eyes, cultivators were like gods, who just flew in the sky and didn't care about anything. Ning Que thought this way too when he was not a cultivator. And when there was a fight between the so-called gods, unless it hurt their own interest, normal people could not care less and actually, they didn't even have access to the information.</p><br/><p>But for different parties in the cultivation world, this fight's impact was huge. The failure of Guan Hai, the last student of the Elder of the Lanke Temple proved again that the Academy was the highest mountain in the world and it was indefectible. It also listed Ning Que as one of the most powerful cultivators.</p><br/><p>\"Monk Guan Hai is not famous because he has been living on the mountain behind Lanke Temple in the past years. But he is powerful, and even I cannot defeat him easily. It is surprising that Ning Que should win the fight with him. It seems that he has been making huge progress recently, and I guess that now no one in the Peach Mountain still thinks he defeated Long Qing twice only by chance.\"</p><br/><p>In a dark room of the West-Hill Divine Palace, Ye Hongyu finished reading the document she just received and a smile flashed across her beautiful face. She didn't wear her red dress today, but a very humble taoist robe.</p><br/><p>One of her subordinates frowned when he heard what she said and argued in a deep voice, \"Surely no one could deny Mr. Thirteen's fast improvement. But he definitely defeated the Prince only by luck. After all, if the Prince wasn't facing the important moment of breaking the realm, how could he lose to that backstabber?\"</p><br/><p>Ye Hongyu stared at him and said, \"Backstabbing is also a part of the fighting as you can't expect your enemy to be fair and square. A fight is always fair, so is Haotian. Despite that Ning Que is infamous, he became a student at the Second floor of the Academy and was chosen to be the successor of uncle Yan Se. So you must remember, there is always something for you to learn from him.\"</p><br/><p>That subordinate didn't dare to argue further, he lowered his head and murmured yes. But as soon as he went outside the room to a tree at the edge of the cliff, he sneered, looked at the direction of the stone hut and whispered to his mates.</p><br/><p>\"During the journey to the Wilderness, the Divine Hall was weakened heavily; Prince Long Qing might be dead now, and this Grand Master Ye fought with someone so powerful that she dropped in the realm. I don't think it possible for her to enter the Knowing Destiny State again, but she was still bluffing and pretending to be confident in front of us. Does she not know she is funny and pathetic?\"</p><br/><p>It was true that during the journey, Yu Hongyu was hurt badly and she had to drop in the realm, so that she may escape from death when Lotus attacked her with the Practice of Taotie. It was an irreversible injury.</p><br/><p>But she was still the Tao Addict. Being in the upper part of the Seethrough state, the whispers could not escape her ears. But she didn't become angry, she smoothed out her robe and closed her eyes.</p><br/>\n</div>"}