{"title": "Chapter 379: Trick Heaven and Earth", "id": 379, "volume": 4, "url": "http://boxnovel.org/nightfall-chapter-379-trick-heaven-and-earth", "volume_title": "Volume 4", "body": "<h1>Chapter 379: Trick Heaven and Earth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 379: Trick Heaven and Earth</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>\"I can't get out of here\" appeared twice in that sentence. The former one meant ability, and the latter meant reality. If they were combined together, that would be what Ning Que was thinking.</p><br/><p>The Headmaster of the Academy punished him to retreat into Back Cliff, and that made him feel despondent or even desperate. But he believed that, in the end, the Academy would release him and would not let him remain imprisoned in this cave until death.</p><br/><p>However, he was pondering in that cliff cave and started to doubt his judgment in less than one day's time. He thought that perhaps his punishment would be endless.</p><br/><p>Hearing his questions, the two people beside the bonfire were silent. Not knowing how much time had passed, the Second Brother shook his head and the Eldest Brother sighed slightly.</p><br/><p>The strong mountain wind whistled, and the flames of the bonfire on the cliff platform gradually became smaller.</p><br/><p>Holding a cup of hot tea and watching the flames, Ning Que suddenly felt a little bit cold and started to regret not fleeing with Sangsang, but instead, following the Headmaster of the Academy.</p><br/><p>The coldness and the fear of life-long imprisonment finally made him burst into a fury after a half day's tolerance. He shouted, \"The first day seeing his student, the master puts him in a cave and prepares to imprison him forever. What is the reason for this? I didn't make any mistake nor violate any rules of the Academy. Who authorized the master to do that? Who does he think he is? The emperor or the prefectural magistrate of Chang'an City? Don't we all know that the law of the Tang Empire is the number one rule? Confining me like this is illegal. I will sue him! I will get out and sue him!\"</p><br/><p>The two Senior Brothers next to the bonfire knew that he was only venting and ignored him.</p><br/><p>Gradually, Ning Que calmed down and had a self-deprecating smile. He realized that though the Headmaster of the Academy is not the emperor, he is more noble than His Majesty, and his word is more effective than the law of the Tang Empire.</p><br/><p>The campfire shone around the cliff entrance. The Eldest Brother looked at the speckled blood stains on Ning Que's shirt, and he knew as he entered that, as expected, Ning Que had already begun to try to get out of the cave. So, he told Ning Que, \"The cliff cave retreat is not easy. It took three years for Youngest Uncle to understand. You have to be patient.\"</p><br/><p>During the day, in the hut on the other side of the mountain, Ning Que had already learned that the Youngest Uncle had been imprisoned in this cliff cave. But not until now did he just learn that even the Youngest Uncle, the greatest legend in the world, took three years to get out, which made him feel much colder.</p><br/><p>No matter how confident he was, he did not dare to expect to be compared with the Youngest Uncle. If it took the Youngest Uncle three years, then how long would it be for him? Ten years? Or a lifetime?</p><br/><p>He lowered his head and said, \"What if I can't get out? Holding me in this cave forever is meaningless to anyone. If I believe that staying here is beneficial, and when I get old, I realize that this is just a waste of my time, then I will have spent my life in vain.\"</p><br/><p>\"Youngest Uncle once said, 'Fate itself is a very cruel guy. Before you can confirm that you are able to take on a mission, it will try every method to break every one of your bones, strip every bit of your flesh, and let you suffer the most extreme pain in the world so that you will be tough enough to be chosen by fate'.\"</p><br/><p>The Second Brother said as he looked at him. \"Only the worst adversity can inspire true courage. Thus, this cliff cave must be deadly to you. Only in this way can you understand that thing and manage to trick heaven and earth. When you climbed the mountain with Long Qing, I saw your determination. It is possible for you to get out. I know that you have potential. Even though this matter is meaningless to the world, it is meaningful to you.\"</p><br/><p>Raising his head, looking at the Senior Brother beside the campfire, and thinking about the four-character word \"trick heaven and earth\" and the case that the Youngest Uncle was also imprisoned for three years in this cliff cave, he finally confirmed his suspicion that the reason that he was imprisoned was definitely related to him having joined the Devil.</p><br/><p>He wondered about why the Youngest Uncle joined the Devil during his practice of Haoran Sword, and why the Headmaster of the Academy forced him into the cave. Ning Que suddenly wanted to know what exactly happened at that time because he seemed to be on the same road as the Youngest Uncle was. If so, he needed to learn from the Youngest Uncle.</p><br/><p>The Eldest Brother looked at Sangsang, who lay asleep all huddled up beside the bonfire. After a moment of hesitation, he smiled and said slowly, \"I speak too slowly. Let Jun Mo tell you.\"</p><br/><p>The Second Brother said, \"We have all come to this cliff, but have never been to this cave. In so many years in the Academy, only the Youngest Uncle was locked up here for three whole years.\"</p><br/><p>He looked at Ning Que and said, \"You once spotted the Haoran Sword in the old library. Later, I also imparted the knowledge of the Great Spirit to you at Jing Lake. Now, you inherited the last breath of Youngest Uncle at the Front Gate of the Devil's Doctrine and possessed the Great Spirit. You should have understood that Haoran Sword and the Great Spirit are two things.\"</p><br/><p>Now, Ning Que realized that hiding the truth about joining the Devil was useless, especially in the presence of two Senior Brothers. After a brief silence, he said, \"The Great Spirit will help the user breathe in the aura of heaven and earth into his body. According to the creed of Haotian Taoism, possessing the Great Spirit means joining the Devil.\"</p><br/><p>It was obvious that the two people beside the fire had known this for a long time, and they did not show any expression of surprise.</p><br/><p>The Second Brother recalled the past and said, \"Haoran Sword is the swordsmanship created by great predecessors of the Academy. If one practices it to an extremely high state, the flying sword can fly into the highest sky, which can match Liu Bai's Dahe Sword. At that time, although Youngest Uncle had great talents, and mastered Haoran Sword easily, he was not self-satisfied at all and he gained the Great Spirit through Haoran Sword. Youngest Uncle was only 16 when he did all of that.\"</p><br/><p>Ning Que had long been accustomed to the fact that there were so many geniuses in the back of the mountain of the Academy, not to mention that the Youngest Uncle was the idol of the Second Brother. Ning Que himself also felt the incomparable power of the Youngest Uncle's sword style in the Wilderness. So, he was not too shocked when hearing that the Youngest Uncle reached the same state as the greatest warrior of today, Liu Bai, at the age of 16. However, thinking that the Great Spirit was created by the Youngest Uncle, he still felt impulsion in his heart.</p><br/><p>\"Now we all know that the Great Spirit of Youngest Uncle is essentially in conflict with the creed of Haotian Taoism. In other words, it is the magic of the Devil's Doctrine. When the master found this, he directly locked Youngest Uncle into this cave. It is said that the master also told those words to Youngest Uncle.\"</p><br/><p>Ning Que asked, \"What words?\"</p><br/><p>\"When you understand, you can come out.\"</p><br/><p>Ning Que became silent.</p><br/><p>The Second Brother continued, \"Youngest Uncle spent three years to figure out some truth. He stepped out of the cliff cave and rode a black donkey out of the Academy into Chang'an City, where he entered the human realm. After that, he used a cyan-steel sword to beat every top warrior in this world and went far into the Wilderness to destroy the Devil's Doctrine. In countless battles, Youngest Uncle's Haoran Sword was unparalleled, but it didn't raise any suspicions from Haotian Taoism or the Buddhism Sect.\"</p><br/><p>He looked at Ning Que and said, \"Because Youngest Uncle understood something inside this cliff cave.\"</p><br/><p>Ning Que also understood something.</p><br/><p>The Second Brother continued after a moment of silence, \"After Youngest Uncle destroyed the Devil's Doctrine by himself, because of something disheartening, he rode back to the Academy on the black donkey, spent a night to ponder in the Sword Woods at the front of the mountain, and talked with the master for three days. Then, he came to the edge of the cliff to build this hut, which is in front of you right now.</p><br/><p>\"After destroying the Devil's Doctrine, Youngest Uncle was recognized as the world's most powerful person. Countless Unworldly Sublime Beings came to challenge him. At that time, there was only the master, the uncle, the Senior Brother, me, and the scholar to defend the Academy. A big tactical array did not exist. Anyone could come to challenge, and it was more troublesome than what you encountered within the city of Chang'an the other day.\"</p><br/><p>Recalling the scene of those splendid fights on Back Cliff, the Eldest Brother smiled.</p><br/><p>\"Youngest Uncle never felt bored. When he felt anguish about pondering in the hut, there would always be some great fighters coming to him as the test subject for his sword. Then he beat them, one by one. I'm afraid the reason why the Zhishou Abbey and the Xuankong Temple were so silent in these years is that too many of their people died at the hand of Youngest Uncle.\"</p><br/><p>The Second Brother looked back to the cliffs not far away, recalling the battles from those days, and thought the strongest warriors who were in the peak of five cultivation states of the Unknown Place and had all been beaten by the Youngest Uncle. They were either killed or badly injured and had fallen from the cliff. Yet, no one remembered their names. Thinking about all of that, the Second Brother felt both proud and sorry.</p><br/><p>Those supermundane people, who clearly knew that the Youngest Uncle was invincible in the world, had still come to this cliff. They were truly respectable people. That kind of pride is that cultivators should have, but it could never be found from those cowards today who claim to be cultivator.</p><br/><p>The Second Brother was also very proud. He always wanted to follow in the footsteps of the Youngest Uncle. He also wanted to recreate the world of the past where people were willing to sacrifice their lives for the sake of dignity and pride. It was very regrettable that those honorable people had died. How many people in this present world were worthy of a respectful fight?</p><br/><p>\"Those supermundane warriors either died or escaped with wounds. No one dared to challenge the Academy again. This cliff was left in peace again. Then one day, Youngest Uncle suddenly left the hut and never returned.\"</p><br/><p>The Second Brother finished the story of the past.</p><br/><p>Ning Que was silent for a while. He once heard from Ye Hongyu in the Wilderness that the Youngest Uncle was eventually killed by God's punishment. Probably because of this, the Headmaster of the Academy destroyed every peach flower of West-Hill, and Haotian Taoism never mentioned the Youngest Uncle again. The greatest legend was gradually forgotten by the world.</p><br/><p>Ning Que wondered why the Youngest Uncle was punished by God. Was it because the Great Spirit was no longer tolerable to God, and he was already the most powerful man, which led to the anger of God? The Youngest Uncle spent so many years to think about a solution, but eventually still stepped on the road to doom. In that case, how could he, a nobody, figure this out?</p><br/><p>\"As the master confines you in this cliff cave, it means that he treats you the like the Youngest Uncle. He has great expectations of you. If you can't even pass this first test, how can you meet more challenges in the future?\"</p><br/><p>The Eldest Brother looked at him and said with a smile, \"Your state is so much lower than Youngest Uncle's was at that time. You won't meet problems immediately. Though it is not raining, you should still bring an umbrella. As you are still in a low state, it is easier for you to solve that problem than Youngest Uncle could at the time, so don't think about Youngest Uncle all the time. You have hope.\"</p><br/><p>Ning Que turned to the night sky outside the cliff cave.</p><br/><p>Returning from the Wilderness to Chang'an City, he had been thinking about the problem of how he could hide the truth that he possessed the Great Spirit and joined the Devil. In the battle with Monk Guan Hai, he had made an attempt, but it was only able to hide the appearance, and it could not really solve the problem.</p><br/><p>If he wanted to deal with this, he must learn to tell a big lie and trick everyone— even heaven and earth.</p><br/><p>...</p><br/><p>...</p><br/><p>...</p><br/>\n</div>"}