{"title": "Chapter 402: A Simple Hack", "id": 402, "volume": 5, "url": "http://boxnovel.org/nightfall-chapter-402-a-simple-hack", "volume_title": "Volume 5", "body": "<h1>Chapter 402: A Simple Hack</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 402: A Simple Hack</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Everyone watching the fight was stunned by the thunder and wind Liu Yiqing's sword had made.</p><br/><p>Silence lingered in the air; the audience was left speechless.</p><br/><p>How could such a simple stroke of the sword have such power?</p><br/><p>Amongst all the cultivators gathered, only one truly understood this move of the sword: Cheng Lixue, the Priest of the Revelation Department in the West-Hill Divine Palace.</p><br/><p>He realized how powerful and scary the move would be as soon as Liu Yiqing stuck his sword out. He was silent, his right hand holding on to the window ledge.</p><br/><p>A seemingly simple move, yet it embodied his willpower, his persistence of waiting for a hundred days, and it even resembled the sword style of Liu Bai!</p><br/><p>Simple, yet so formidable.</p><br/><p>Everything was the same, including Haotian Divine Light.</p><br/><p>Cheng Lixue was still holding the ledge. The terrifying sword style made him wonder what he would do before it. He would not be able to parry and his only option would be to run from it until he had nowhere to go. Only in this way would he have the slightest chance of making an escape.</p><br/><p>Even Prince Long Qing, when he was alive, would choose to escape and risk being hurt when facing such a powerful sword style, considering the thunder and wind it summoned. Certainly, he would suffer great injury if he attempted to kill his opponent.</p><br/><p>If it was the Tao Addict, would she be able to block Liu Yiqing's sword?</p><br/><p>He remembered what happened at the West-Hill and added silently; he was referring to the powerful Tao Addict before her journey to the Wilderness.</p><br/><p>Immediately afterward, he changed his mind.</p><br/><p>Even the Tao Addict before the Wilderness would not block the sword. Instead, she would attack him expressionlessly. She would see her enemy die before she would die.</p><br/><p>And so she would not die.</p><br/><p>She could handle Liu Yiqing's attack.</p><br/><p>...</p><br/><p>...</p><br/><p>The thunder and wind surged together with the overwhelming sword style.</p><br/><p>Facing this powerful move and dangerous situation, Ning Que closed his eyes.</p><br/><p>Someone who would close their eyes at this moment must want to commit suicide.</p><br/><p>But he didn't want to kill himself. Rather, he hacked forward whilst closing his eyes.</p><br/><p>He knew very well that with his current realm in cultivation, he could not parry this attack. He also would not try to kill his enemy first in the way Ye Hongyu would choose.</p><br/><p>Hacking was simple, simpler and requiring less skill than stabbing with a sword.</p><br/><p>His podao was also simpler than the sword.</p><br/><p>Swords were manmade. They were used for killing or making a salute.</p><br/><p>Swords could only be used to kill people, and nothing else.</p><br/><p>But podao were sharp things people found in nature, and they were first used for hunting.</p><br/><p>They can be used to kill people, but can also cut many other things, like wood.</p><br/><p>Holding the hilt of his podao, Ning Que felt the movement in the air when the blade cut forward. He found a feeling of excitement that had been lost for a long time, returning to his body.</p><br/><p>He had not used his podao for a long time. He missed it a lot.</p><br/><p>Yet still, he was very familiar with the moves, even with his eyes closed.</p><br/><p>His moves were so refined they seemed graceful.</p><br/><p>His movements were so fluid that they made you feel relaxed.</p><br/><p>Only Liu Yiqing felt threatened by the blade, because it was pointing at him.</p><br/><p>As Ning Que cut forward, the Great Spirit in his body moved along the hilt and poured into the blade. Holding such powerful Great Spirit, even the most sturdy podao in the Palace would shatter.</p><br/><p>But this one didn't. After being thoroughly tempered by Sixth Brother, it had the combined power of three podaos. So when the Great Spirit poured into the blade, it started shaking at a speed so fast that it couldn't be seen by the naked eye. It looked like it would break at any moment, and yet it did not.</p><br/><p>The sound of metal clanging against metal reverberated in the air!</p><br/><p>When Liu Yiqing demonstrated his move, the ground paved with dark bricks remained very clean. But Ning Que's podao brought the dust hidden between the seams of the bricks out into the open.</p><br/><p>...</p><br/><p>...</p><br/><p>The audience was made up of average people, so they didn't know what had happened. All they saw was that Liu Yiqing's sword was about to go into Ning Que's forehead, and Ning Que hacked down with his ordinary looking weapon.</p><br/><p>Only the advanced cultivators could sense the strong Qi of Heaven and Earth circling around the podao in Ning Que's hand. The quantity and purity of it was more refined and scary than that of Liu Yiqing's Sword of Wind and Thunder.</p><br/><p>Cheng Lixue held the window ledge with both hands. He was very shocked, his body was frozen in place.</p><br/><p>He Mingchi was standing next to his carriage. Seeing this image, he raised his head and held a wheel with his right hand.</p><br/><p>...</p><br/><p>...</p><br/><p>Leaves were crushed by the powerful move of Liu Yiqing's sword. But Ning Que's podao turned the powder into nothing.</p><br/><p>A flower poking out from a seam of stones in the distance vanished.</p><br/><p>Ning Que's podao met Liu Yiqing's sword.</p><br/><p>The tremendous power of the podao suppressed the thunder and wind on the tip of the sword, making it tremble as if it were a candlelight attacked by a gust of heavy wind.</p><br/><p>Liu Yiqing was shocked.</p><br/><p>He didn't expect him to be so brilliant at cultivation. After all, he was the weakest among all students of the second floor in the Academy, and even the Tao Addict called him the shame of the Academy.</p><br/><p>But he didn't want to avoid his attack. Instead, he kept moving his sword and rushed forward.</p><br/><p>After meditating for three months at the side gate of the Academy, he was fully prepared. He had thought about all the situations that could happen during this fight, including the current; that Ning Que had rocketed to a new level of cultivation after his penance.</p><br/><p>He believed that Ning Que would hesitate when their weapons were about to touch.</p><br/><p>Because anyone would, if they were in his position.</p><br/><p>His sword would remind Ning Que of Chao Xiaoshu as long as he saw it.</p><br/><p>Ning Que would think, why was Chao Xiaoshu's sword in his hands?</p><br/><p>Did Chao Xiaoshu really lose to him?</p><br/><p>Is Chao Xiaoshu alive?</p><br/><p>\"If Chao Xiaoshu is still alive, how can Ning Que hack his podao at me?''</p><br/><p>\"Isn't he worried that if he kills me, Chao Xiaoshu will die with me?\"</p><br/><p>\"Does he think he could escape from thinking of Chao Xiaoshu with his eyes closed?\"</p><br/><p>All these thoughts circled through Liu Yiqing's head.</p><br/><p>He believed that Ning Que would think about all of those questions. Even if he had an unhumanly determined mind, he would still lose some focus, and then his move of the podao would become less fluent.</p><br/><p>The fight between two powerful men was to seek victory, but this often only depended on what was on their mind in the most vital moment.</p><br/><p>Liu Yiqing had been preparing for a long time to startle Ning Que.</p><br/><p>...</p><br/><p>...</p><br/><p>But Ning Que didn't hesitate at all.</p><br/><p>He closed his eyes and hacked his podao forward in a decisive and brutal way.</p><br/><p>He was not distracted.</p><br/><p>The reason why he closed his eyes was not to stop himself thinking about Chao Xiaoshu.</p><br/><p>He wasn't thinking about Chao Xiaoshu's sword, nor did he realize that Chao Xiaoshu might have been killed or was being tortured in the Sword Garret. It never even occurred to him that if he dared to kill his enemy, Chao Xiaoshu would die.</p><br/><p>He didn't think, he only hacked his podao forward.</p><br/><p>And so, he could only focus on that.</p><br/><p>It was far simpler than Liu Yiqing's mind.</p><br/><p>And the attack of Ning Que was also far more powerful than that of Liu Yiqing.</p><br/><p>The podao in Ning Que's hand lit up suddenly.</p><br/><p>Countless golden lights spurred out from the dark blade. Its light, as bright as the sun rising from the sea, and its colour, as rich as the burning clouds at dusk.</p><br/><p>Under the control of Ning Que's Psyche Power, the golden rays were bundled so that they didn't spread in all directions. Instead, they turned into a flame, rushing towards Liu Yiqing's face.</p><br/><p>...</p><br/><p>...</p><br/><p>Chen Lixue's hands clenched on the window ledge. He stood up in the carriage.</p><br/><p>There was a snapping sound, the window ledge he held on to was crushed and a big hole was left in the carriage wall.</p><br/><p>Although standing next to the carriage, He Mingchi was too nervous to notice the loud noise. His fist tightened and his knuckles were deep in the wheel, spreading wood chippings everywhere.</p><br/><p>Looking at the side gate of the Academy, they exclaimed in disbelief, \"Divine Skill!\"</p><br/><p>...</p><br/><p>...</p><br/><p>A horrible scream was heard from the person lying on the ground in front of the side gate of the Academy.</p><br/><p>Thousands of rays beat Liu Yiqing's face like burning fire. The pure light burned brightly into his eyes, causing him to scream in agony.</p><br/><p>The sharp pain in his eyes distracted him from focusing on attacking his enemy. All the light had disappeared and his world became completely dark.</p><br/><p>The podao in Ning Que's hand hacked against Liu Yiqing's sword.</p><br/><p>It sparked great power.</p><br/><p>The wind and thunder on Liu Yiqing's sword died out quickly.</p><br/><p>The podao was still going forward as if it was burning.</p><br/><p>Then, the sword in Liu Yiqing's hand shattered into pieces.</p><br/><p>But the podao didn't stop.</p><br/><p>Ning Que only knew where Liu Yiqing was before he closed his eyes.</p><br/><p>So his podao hacked on the ground, rather than on Liu Yiqing who stumbled back, screaming.</p><br/><p>But that was enough.</p><br/><p>The burning podao hacked against the ground , spewing out flames. The Haotian Divine Light surged out from the blade, turning into a bundle of thrilling Qi of Heaven and Earth which shot towards Liu Yiqing.</p><br/><p>There was a gust of heavy wind.</p><br/><p>Liu Yiqing's body was like a sandbag in the wind. It floated slowly in the sky and then dropped heavily on the solid ground. He rolled over on the ground more than ten times and only stopped when he hit a peach tree at the foot of the slope.</p><br/><p>As he hit the tree, a snap sounded, indicating that either the tree or his bones had broken.</p><br/><p>Liu Yiqing stood up, his right hand struggling to hold on to the peach tree.</p><br/><p>He looked very miserable, his clothes frayed and stained with blood and dust. A shower of peach blossoms fell on him, the color of which was even redder than blood.</p><br/><p>The scariest thing was that his eyes seemed to be perfectly fine at first, hostility remaining in them. But this was simply because he was blind, as revealed by his confused and worried expression.</p><br/><p>In the next few moments, he awoke from the daze and started feeling terrified. When his terror accumulated, he was left in a state of frenzy.</p><br/><p>He looked at the sky in a daze, his hands grabbing the handle of his sword tightly as if it were his last straw, \"How can you use Divine skills? Who taught you that!\" He cried out, waving the sword handle crazily.</p><br/><p>...</p><br/><p>...</p><br/><p>-</p><br/>\n</div>"}