{"title": "Chapter 415: Let's Go!", "id": 415, "volume": 5, "url": "http://boxnovel.org/nightfall-chapter-415-lets-go", "volume_title": "Volume 5", "body": "<h1>Chapter 415: Let's Go!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 415: Let's Go!</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Telling from their reaction, the woman knew what she was most afraid of finally came to pass. Fear and grievance intertwined in her heart at the sight of the stinky mud on her clothes and at the thought of things that might happen. She couldn't refrain her tears and tremblingly asked the clan leader, \"What's wrong?\"</p><br/><p>The brawny man furiously looked at her and yelled, \"You allowed a man to live in your house! How dare you ask us why? How dissolute! You have brought shame to the whole clan.\"</p><br/><p>The woman lowered her head in silence. She was panic-stricken and didn't know what to say. There was nothing between the man and her, but she knew they wouldn't trust her. And what's worse, she was clear that she was indeed dissolute, and she indeed had expected that something could happen between the man and her.</p><br/><p>The clan leader coughed and prevented their rude behavior from continuning. He walked to the woman, looking at her lowered head, and meanwhile taking a glance at her plump breast, and then he sighed, \"Linzi, although you are from the Yuelun Kingdom, did we treat you bad after you married to our village?\"</p><br/><p>With her head lowered, she said in a trembling and begging tone, \"I'm thankful to Fourth master and the other clansmen.\"</p><br/><p>Suddenly the clan leader looked cold, and he said, \"Chengge has died, and I have asked you to marry another one but you refused. You said you would preserve your chastity for him. So we didn't force you to remarry. But why do you have such an affair with that man?\"</p><br/><p>The woman raised her head at his words. She glanced at the brawny man and thought to herself sorrowfully, \"You asked me to marry your son, how could I do that? Chengge had died after falling down the cliff when picking herbs, and he was just beside Chengge. Who knows what happened at that time?\"</p><br/><p>At the moment, Chao Xiaoshu walked out.</p><br/><p>The villagers were enraged in an instant, seeing that he would dare to stay in her house and appear before them. They waved their hoes, preparing to hit him to death.</p><br/><p>But strangely the clan leader prevented them.</p><br/><p>Chao Xiaoshu had been listening in the house for some time, and he knew what was happening. He had learned in Chang'an that people in the Great River Kingdom were conservative. In some remote villages the status of women was extremely low. However, he never expected they would cause such a disturbance.</p><br/><p>He walked to the clan leader and sincerely explained.</p><br/><p>The clan leader shook his head emotionlessly, saying, \"It concerns the reputation of our clan, so how can we randomly forgive this dissolute woman?\"</p><br/><p>Chao Xiaoshu calmly said, \"If there is really something between us, will you also punish me?\"</p><br/><p>After a moment of silence, the clan leader looked at him and said, \"I know you are from the Tang Empire, so you can just leave after apologizing to us and leaving us an amount of silver as compensation.\"</p><br/><p>Chao Xiaoshu glanced at the trembling woman and asked, \"How about her?\"</p><br/><p>Hardly had the clan leader opened his mouth when the brawny man severely said, \"Drown her!\"</p><br/><p>It seemed the villagers were extremely excited at the two words. Their thunderous cheers filled the small yard. They all shouted to drown her, strip her naked and beat her.</p><br/><p>Chao Xiaoshu looked around, to see the greedy and obscene expressions of those villagers and their twisted faces caused by excitement. He gently said, \"It seems this kind of men can be killed.\"</p><br/><p>The small yard under the big banyan tree suddenly calmed down.</p><br/><p>It seemed that those clansmen had heard something, yet didn't believe what they had heard. The clan leader suddenly became gloomy and looked at Chao Xiaoshu, preparing to say something.</p><br/><p>But hardly had he opened his mouth when Chao Xiaoshu turn to the woman and said softly, \"Can I kill them?\"</p><br/><p>The woman had just recovered from her astonishment.</p><br/><p>Already in despair, she was now seeing hope again from Chao Xiaoshu's gentle expression.</p><br/><p>Looking at those hateful clansmen, she suddenly trembled and cried, \"I'm not a native of the village. I'm from a forest of Yuelun Kingdom. I was sold to the village by a human trader. My husband died, so they wanted me to marry the son of the clan leader. But I don't want to marry him, I don't... \"</p><br/><p>She never told an outsider about these things, because there was no outsider in this remote and secluded village. Nobody trusted her. Even if they trusted her, they dared not show sympathy for her.</p><br/><p>So she wanted to know stories from the outer world, and expected to experience the outer world.</p><br/><p>She finally shouted out her inner thought, because she wanted to live.</p><br/><p>\"That's good.\"</p><br/><p>Chao Xiaoshu looked at those people in the yard and asked, \"Which of them should be killed?\"</p><br/><p>Pointing at the gray-haired clan leader and the brawny man, the woman quavered, \"These two deserve to die the most.\"</p><br/><p>Chao Xiaoshu walked a few steps ahead.</p><br/><p>Those clansmen in the yard raised their steel forks and hoes, aiming to hit him.</p><br/><p>The fence was stamped on and scattered all over.</p><br/><p>Chao Xiaoshu picked up a bamboo blade.</p><br/><p>And then he waved it twice.</p><br/><p>The heads of the clan leader and the brawny man, flew away.</p><br/><p>Those clansmen were frozen at the scene, turning pale in an instant. Somebody shouted and then all of them crazily ran away, with no one caring about the two corpses leaning against the fence.</p><br/><p>\"He killed them!\"</p><br/><p>\"Go and report it to the government!\"</p><br/><p>The terrified and despaired shout sounded in the village. It startled the fish in the pond, disturbed the birds resting on the banyan tree, breaking the peace and rule which had lasted for a thousand years in the village.</p><br/><p>...</p><br/><p>...</p><br/><p>The headless corpses of the clan leader and his son were still lying in the simple and crude yard.</p><br/><p>The woman looked pale, and was trembling. But her eyes were brighter than any other time in the past ten years.</p><br/><p>Chao Xiaoshu looked at her and asked, \"Do you still want to live in this village, on this yard?\"</p><br/><p>The woman shook her head and murmured, \"Never.\"</p><br/><p>Chao Xiaoshu said, \"Then come with me.\"</p><br/><p>The woman surprisedly looked into his eyes, her eyes filled with joy. She nervously said, \"Ok.\"</p><br/><p>She was too nervous to ask him where he would go. She would go with him anywhere he went, so long as she could leave this place.</p><br/><p>But just at this moment, Chao Xiaoshu suddenly sank in silence, seeming to be hesitating about what he should say.</p><br/><p>The woman somewhat stiffened, and after a moment of silence she bitterly said, \"Yes, I'm dissolute and shameless, and how can you bring such a woman home? Please give me some taels of silver, and I will make a living by myself. See, I still have to borrow money from you, even though you may mock me.\"</p><br/><p>Chao Xiaoshu looked at her and said, \"I give taels of silver only to that kind of woman.\"</p><br/><p>The woman turned pale and said bitterly, \"I see. Although I'm dissolute and wanted to throw myself at you, I'm really unwilling to have your money by doing that.\"</p><br/><p>Chao Xiaoshu quietly looked at her eyes and said gently, \"You've misunderstood me. I meant I would only give money to my wife, so I wonder if you are willing to accept it.\"</p><br/><p>The woman took a long time to recover her from her astonishment.</p><br/><p>She rubbed her eyes, wanting to cry. But then she thought it would be disgraceful.</p><br/><p>Chao Xiaoshu smiled at her, then entered the house and packed their things up. Later he returned to the yard and said to the woman who was still in a daze, \"Let's go.\"</p><br/><p>She took the package from his hands.</p><br/><p>Then they left.</p><br/><p>...</p><br/><p>...</p><br/><p>Ning Que was thinking about three things.</p><br/><p>The first thing was, why Dao Shi, the sadhu, could so accurately find him in Chang'an City. Were there any tricks behind it? The second thing was, if after the Sword Garret challenged the Academy and Chao Xiaoshu's sword was taken, with the Judicial Department of the Divine Hall appearing afterwards, then why Chao Xiaoshu was not in the Sword Garret? Where did he go? The third thing was, how to deal with the request from West-Hill Divine Palace to take Sangsang away.</p><br/><p>Both of the last two things had something to do with West-Hill Divine Palace. Recalling Cheng Lixue's attitude towards the Judicial Department, he thought he'd better go to Southern Gate Temple, where he could at least ask about these matters.</p><br/><p>Now the Great Divine Priest of Revelation was in the Southern Gate Temple. Before negotiating with such a bigwig, they should first unify their ideas, thus making their arguments more persuasive.</p><br/><p>\"A girl should have dreams. Look at Tao Addict. Her dream is quite simple, which is, persisting to the end on the road of cultivation. And look at Situ Yilan. She just wants to be the greatest female general. And even Tang Xiaotang, that wimpy kid, aimed to be the most powerful woman in the world.\"</p><br/><p>Ning Que murmured behind Sangsang, yet Sangsang was squatting beside the well, attentively salting little yellow croaker fish. She didn't respond to him at all, and was also unwilling to discuss the issue with him.</p><br/><p>\"A dream can make you aspire, which will further enrich your life. A woman without dreams is like a listless eyeball, which will reduce you to a lifeless salted fish.\"</p><br/><p>Ning Que looked at her thin figure and sighed, \"Of course I'm unwilling to let you go. But now that you are capable, it will be a pity for you to be occupied with chores and trifles every day. I'm afraid that when you grow old, you may be regretful for your current choice.\"</p><br/><p>Sangsang laid the salted fish in the bamboo basket and washed her hands with the chill well water. Then she turned back and said, \"I've seriously thought about that, yet I still can't persuade myself to go to West-Hill.\"</p><br/><p>Ning Que asked, \"Why?\"</p><br/><p>Sangsang earnestly answered, \"As I've said before, who will look after you after I leave?\"</p><br/><p>Ning Que said, \"That's indeed a troublesome issue. It'll be simple to find some handmaidens, yet the problem is, I will feel uncomfortable when sleeping without you.\"</p><br/><p>After a moment he shook his head and sighed, \"But, if the reason why the Great Divine Priest of Light disappeared from West-Hill Divine Palace is for keeping you doing housework for me, or because I couldn't sleep well without you, it will be recorded in history books. And I will definitely be dug out from my grave after I die.\"</p><br/><p>That night, they had a deep discussion on that issue, and didn't come to a conclusion until midnight, when they became tired and fell asleep.</p><br/><p>...</p><br/><p>...</p><br/><p>The next morning, Ning Que and Sangsang were preparing to pay a formal visit to Great Divine Priest of Revelation in the Southern Gate Temple after tidying themselves up and having breakfast. Suddenly they vaguely heard the Music of Etiquette from outside the shop.</p><br/><p>The peaceful and moderate music gradually approached Lin 47th Street. There would be cheers and talks wherever the music came, following which there would be absolute silence.</p><br/><p>Ning Que was somewhat surprised. He pushed the door open and looked towards the entrance of the street. What he saw were petals all over the sky, which drifted down along with elegant music. A god chariot slowly went toward his direction under the protection of a solemn guard of honor.</p><br/><p>The Great Divine Priest of Revelation was coming.</p><br/><p>...</p><br/><p>...</p><br/><p>...</p><br/>\n</div>"}