{"title": "Chapter 413: The Black Peach Flower Beside the Boat", "id": 413, "volume": 5, "url": "http://boxnovel.org/nightfall-chapter-413-the-black-peach-flower-beside-the-boat", "volume_title": "Volume 5", "body": "<h1>Chapter 413: The Black Peach Flower Beside the Boat</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 413: The Black Peach Flower Beside the Boat</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>It was common to have emotions when facing the sea, but only a few people would have emotions when facing the salted fish. However, thinking about what had happened to him in the past year, even Long Qing couldn't help but sigh before the basket of salted fish.</p><br/><p>Yet, he was very clear that any emotion that was similar to his feeling now was too superfluous to him. He would again feel the unbearable pain and desperation which he tried very hard to overcome, so he decided to leave the fishing port silently.</p><br/><p>Suddenly, he stopped and slowly turned back. His delicate leather shoes slipped on the wet sticky ground slowly.</p><br/><p>On the sea, shone upon brightly by morning sunlight, there was a small boat which rose and fell with the waves. Long Qing still had much better eyesight than ordinary people. He saw a Taoist in indigo on the boat.</p><br/><p>The Taoist in indigo on the boat looked ordinary, with no special features. But Long Qing could not move his eyes away, as his body became extremely stiff because of great shock.</p><br/><p>The fishermen and stevedores, carrying heavy catches, walked through the slippery decks. The merchants were insufferably arrogant and bossy. They gave orders and urged their employees while smoking. The seabirds flew back and forth over the water and around the ship's bow. The fishing port of Yue Kingdom was still busy and noisy. It seemed that no one noticed the small boat.</p><br/><p>Long Qing looked silently at the boat and the Taoist on it, thousands of feet away. His eyes were disturbed by the fluctuations of the distant waves. He was no longer a cultivator, but his vision was still there. He was sure that the Taoist in indigo was a cultivator, but he could not identify the state of that cultivator at all. That Taoist was so powerful that even Long Qing who was once very powerful still could not identify the state he had attained.</p><br/><p>The Taoist in indigo on the distant boat stood at the bow with his hands clasped behind his back. He looked up at the rising sun in the east. The entire person seemed to be melting in the reddish morning light.</p><br/><p>Long Qing looked at the back of the Taoist in indigo, and suddenly, he wanted to flee.</p><br/><p>At that moment, a calm and coercive voice sounded in his head.</p><br/><p>\"Does ultimate satisfaction exist in the world?\"</p><br/><p>…</p><br/><p>…</p><br/><p>The Taoist in indigo did not turn around. Naturally, Long Qing could not see whether he spoke or not, but Long Qing understood that the voice in his mind was a question sent by that Taoist.</p><br/><p>Listening to this question, his handsome eyebrows twisted slightly and he looked in pain. Looking down at a small shrimp that was struggling in mucus, he muttered and said,\"What can I do if I can't be satisfied?\"</p><br/><p>Then he raised his head and looked at the Taoist on the boat in the distance. He said with resentment and sadness, \"The light has already abandoned me, and even the darkness does not bother to kill me. A good-for-nothing man like me can't complain. What kind of life can I expect?\"</p><br/><p>The voice of the Taoist in indigo sounded clearly again in Long Qing's head, even though he was thousands of feet away from him.</p><br/><p>\"If you are bright, you can see bright things. If you are dark, you can see dark things. You have experienced so much in the past year. Have you not understood the real relationship between light and darkness?\"</p><br/><p>Long Qing remembered the dream when he climbed up the mountain at the Academy. It had made him extremely proud, brilliant but also feel pain and confusion. When he remembered the infinite golden light in his dream, he suddenly understood something, but his body also became chilly and started to tremble in the spring sun.</p><br/><p>\"But that is not my initial belief.\"</p><br/><p>He stared at the Taoist in indigo. His trembling voice was like the wind blowing against the boat's stern. It spread coldly out of his lips and teeth, with endless despair.</p><br/><p>The Taoist in indigo did not turn around but still looked at the red rising sun with his hands clasped behind his back.</p><br/><p>\"Does belief make you satisfied?\"</p><br/><p>Long Qing replied and said, \"It used to.\"</p><br/><p>The Taoist in indigo was silent.</p><br/><p>Long Qing lowered his head and again looked at the struggling shrimp beside his feet. He asked in pain, \"Is it really possible?\"</p><br/><p>The Taoist in indigo said, \"Yes.\"</p><br/><p>Long Qing asked in confusion, \"Is it worth it?\"</p><br/><p>The Taoist in indigo said,\"It is up to you. If you are satisfied with your current situation, it's not worth it, but as long as you have a slight dissatisfaction, it's worth it. I've always thought that there is no real satisfaction in the human world, so I think it's worth it in any situation.\"</p><br/><p>In the end, he returned to the initial problem.</p><br/><p>Long Qing forcibly suppressed his shock and confusion. He pondered desperately and twisted his eyebrows, recalling the past in a long silence, and guessing about his future.</p><br/><p>Was he really satisfied?</p><br/><p>In Capital Cheng, he led a group of baggers to loot food and conquer places. He gained some money through stealing and cheating so that he could go to the Kingdom of Song to open a shop and start selling salted fish. If he continued like this, his life would be peaceful, and he would become an ordinary successful businessman, marrying a beautiful and gentle wife, raising many children. After many years, when he became old and confirmed that no one from Yan Kingdom was after him, he would return to Capital Cheng secretly with his whole family and kneel beside the Imperial Road outside the Imperial Palace, to point at the emperor who was equally old, telling his grandsons that their grandfather had a good relationship with the emperor, but he should have been the one sitting there.</p><br/><p>Then he would near his death and let his family carry him to the West-Hill Divine Kingdom to the divine mountain full of peach blossoms. He would join the crowd made of countless patients that came for help, and then he would lie weakly on a stretcher, watching the cold and arrogant cavalrymen of the Divine Hall black deacons walking by, looking at the grand Taoist Temples on the mountain. Two lines of tears flowed on old wrinkled cheeks, and he would cry weakly and say,\"I should have been the one sitting there.\"</p><br/><p>That kind of life was right. To have that kind of life, to do anything for it was worthwhile, even giving up his original belief and accept the most painful spiritual baptism.</p><br/><p>Long Qing stood in the morning lights beside the sea, and smelled salted fishes and the sea breeze. At that point, he lost his senses. He looked like a walking corpse without a soul. Suddenly, he kneeled down.</p><br/><p>With a crushing sound, his knees crushed the struggling shrimp in the mucus.</p><br/><p>He looked at the Taoist in indigo on the boat thousands of feet away. He kneeled and prostrated. His tears silently flowed on his face and he said with a trembling voice, \"Please guide me.\"</p><br/><p>The voice of the Taoist in indigo sounded in his mind, \"Follow me.\"</p><br/><p>Long Qing kneeled on the ground and felt confused. He did not know how to approach the boat, nor did he know how to follow the Taoist in indigo.</p><br/><p>When he looked up, he found that he was no longer at the fishing port but a vast blue sea. Seabirds dived into the water from time to time, splashing about.</p><br/><p>The Taoist in indigo was only two steps away from him.</p><br/><p>Not knowing when, he had boarded the boat.</p><br/><p>Long Qing looked at the Taoist in indigo standing at the bow. He was shocked and could not say a single word.</p><br/><p>When he caught a glimpse of what happened on the side of the ship, he couldn't help his pupils from shrinking.</p><br/><p>The South China Sea was much calmer than the East China Sea, but the wind and waves were still very strong. The ships that could sail in the South China Sea were very particular about their size and crafting. Before they were used in the construction, the shipbuilding wood must be piled on the shipyard for a long time to allow the wind, rain and sunlight to dissolve the stress in it.</p><br/><p>In other words, any shipbuilding wood was dead wood.</p><br/><p>However, at this time, the wood of the boat gave birth to a peach flower.</p><br/><p>Deadwood produced a new peach flower.</p><br/><p>It was a black flower, trembling slightly in the sea breeze, and brightly shone upon by morning sunlight.</p><br/><p>…</p><br/><p>…</p><br/><p>...</p><br/>\n</div>"}