{"title": "Chapter 427: A Package Wrapped in Blue Cloth", "id": 427, "volume": 5, "url": "http://boxnovel.org/nightfall-chapter-427-a-package-wrapped-in-blue-cloth", "volume_title": "Volume 5", "body": "<h1>Chapter 427: A Package Wrapped in Blue Cloth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 427: A Package Wrapped in Blue Cloth</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Ning Que asked, \"Why do you think he was bragging?\"</p><br/><p>Chen Pipi answered, \"Because even if the armored cavalry is invincible, Second Brother can just run away from them.\"</p><br/><p>Ning Que said, \"But you just said that it is impossible for you to run away from it.\"</p><br/><p>\"Second Brother is different from me.\"</p><br/><p>Chen Pipi said, \"He runs faster than me, and even your Big Black Horse can't catch up with him.\"</p><br/><p>A question suddenly occurred to Ning Que. He asked, \"The problem is, if Second Brother was really trapped by the army, do you think he would choose to run away?\"</p><br/><p>Chen Pipi thought for a moment and said, \"No, he won't.\"</p><br/><p>Ning Que said with pity, \"In this way, it is right to say that no one can defeat the army.\"</p><br/><p>Chen Pipi shook his head and said, \"But I think if Second Brother was surrounded by the army and didn't run away, he could kill two thousand people using all his power, and then the others left would be too scared to fight against him.\"</p><br/><p>Ning Que muttered, \"That makes sense.\"</p><br/><p>Then he said, \"Only imagining this scene makes me excited. It is a shame that we can't actually see it.\"</p><br/><p>They chatted while walking through the forest. Now that they had come to the Vermilion Bird Avenue, it was time for them to part.</p><br/><p>Ning Que held his two fists together and bowed to Chen Pipi. He said sincerely, \"Thanks, Senior Brother.\"</p><br/><p>Chen Pipi sighed.</p><br/><p>Ning Que did not say anything.</p><br/><p>Chen Pipi asked, \"Why do you want to do that?\"</p><br/><p>Ning Que knew what he was asking about.</p><br/><p>He was asking why he wanted to kill people, why he wanted to fight against the Military Ministry of Tang, and why he held a grudge towards the general who was about to come back.</p><br/><p>Ning Que looked down at the grass at his feet, silent.</p><br/><p>He didn't admit anything when Xu Shi asked him the same question. And no matter who asked him this question, he would just say that he was innocent. But he didn't want to hide from Chen Pipi.</p><br/><p>Raising his head and looking at Chen Pipi's eyes, Ning Que said, \"Xia Hou killed my whole family.\"</p><br/><p>Chen Pipi was taken back by this answer, and his expression changed suddenly. After a long time of silence, he reached out his hand and patted Ning Que on his shoulder to comfort him.</p><br/><p>\"Then you really should be angry.\"</p><br/><p>\"But Xia Hou is not an ordinary person. You can't kill him whatever you do, because he is too powerful for you.\"</p><br/><p>Chen Pipi looked at Ning Que and said in concern, \"And he is both an important general of Tang and a visiting professor at the West-Hill, with these two identities, he is really influential. Even if the Headmaster won't stop you from trying to kill him, do you think Eldest Brother and Second Brother will agree to help you? I can't defeat Xia Hou for you.\"</p><br/><p>Ning Que understood his words and he was touched.</p><br/><p>Chen Pipi asked at last, \"What do you plan to do when he comes back to Chang'an in the late autumn?\"</p><br/><p>Ning Que shook his head and said, \"I don't know.\"</p><br/><p>...</p><br/><p>It was in the Palace of Tang.</p><br/><p>The Palace, being washed by the rain for a whole day, looked brilliant against the blue sky.</p><br/><p>Xu Shi had been looking at this Palace for more than ten years, and although he was so familiar with it, he was never bored looking at it. He was old and haunted by some old illness in his lung, but deep in his heart, he was just as active and passionate as when he just joined the Military camp in his youth.</p><br/><p>The Emperor put the bowl of medicine down and furrowed his brows. It seemed that the medicine was too bitter for him. He signed to the eunuch to leave and looked at the old general beside him. \"Although we both cough a lot, our illness is different, so I can't share my medicine with you. Speaking of that, I said you should stay in the south and recover from your illness, why did you come back?\"</p><br/><p>Xu Shi appreciated His Majesty's trust and care, but it didn't mean that he would agree with all of his decisions. He replied, \"The Nanzhaoshan tribe have surrendered last spring, and the south had returned to peace. I only need to leave some army there as a deterrent to the Yuelun Kingdom. There is no need for me to stay there. And although the humid temperature there is good for my lungs, I am not used to the humid air.\"</p><br/><p>The Emperor said, \"Fine. With you back to Chang'an and watch over the Military Ministry for me, I can relax a little.\"</p><br/><p>Xu Shi said, \"But there is one thing His Majesty should pay more attention to.\"</p><br/><p>The Emperor was silent.</p><br/><p>Xu Shi said, \"Please write to the Academy and ask the Headmaster to punish Ning Que.\"</p><br/><p>The Emperor turned around to look at him and asked, \"Do you have solid proof?\"</p><br/><p>Xu Shi said, \"No, I don't.\"</p><br/><p>The Emperor asked again, \"What did you say when I wanted to punish Xia Hou?\"</p><br/><p>Xu Shi said, \"I didn't say anything.\"</p><br/><p>The Emperor said, \"But my brother, my prime minister, the minister of Dali Temple and the Empress said something. They all said that the law of Tang Empire wrote that when there was no proof, no one was allowed to be punished.\"</p><br/><p>He looked at the most loyal general in Tang and said mockingly, \"At that time, I didn't oppose them after thinking for a long time, and you didn't either. Do you want to oppose them now?\"</p><br/><p>Xu Shi was silent for a long time and said, \"Even if we can't punish Ning Que because of the lack of proof, I still think it was wrong to give the God-stunning Array to him.\"</p><br/><p>\"You are an old friend of Yan Se.\"</p><br/><p>The Emperor said, frowning, \"Why don't you trust his successor?\"</p><br/><p>Xu Shi didn't explain. He repeated stubbornly, \"I don't trust him to take charge of Chang'an.\"</p><br/><p>The Emperor thought for a while and said, \"I trust him.\"</p><br/><p>...</p><br/><p>It was the Old Brush Pen Shop in the early morning.</p><br/><p>Sangsang got up early as usual, but she wasn't busy chopping the wood, boiling the water and buying breakfast. Instead, she glanced at Ning Que who was still asleep and walked out of the room silently. She went to the shop and searched a drawer below the display case for a while before she found a neat package.</p><br/><p>It was covered in blue cloth, which had flower patterns on. She bought the cloth yesterday. No one knew what was inside, but judging from her careful manner when holding it, it should be something really precious.</p><br/><p>She walked out of the Old Brush Pen Shop, got in the arranged carriage and went to the House of Red Sleeves.</p><br/><p>As the best place in the entertainment industry, the House of Red Sleeves was frequented by the noble. It closed at late night every day and didn't open until midday. So when Sangsang got off the carriage in front of the House of Red Sleeves, both the front gate and the side gate were closed tightly. The street was silent, and only the sound of someone sweeping the ground could be heard vaguely.</p><br/><p>Sangsang looked around to make sure no one noticed her, then she ran to the side gate. Before she knocked on the gate, it was pushed open by Xiaocao.</p><br/><p>The two girls looked very nervous as if they were stealing something. Xiaocao let her in without saying anything.</p><br/><p>...</p><br/><p>Dewdrop was once the most famous girl in the brothels in Chang'an, but she had not been working here for a long time. Because as a millionaire now, she didn't need to work in the brothel anymore. And even if she wanted to work here, someone in the Lin 47th Street had discussed with Mistress Jian and forbidden her to do that for his master's dignity.</p><br/><p>But Dewdrop still lived in the House of Red Sleeves. Her daily routine was to read, play instruments or hang out in Chang'an. Sometimes she also taught other girls singing and dancing. She was having a relaxing life, but her habit was still the same as in the past; she went to bed really late and got up at midday.</p><br/><p>But today was different. She got up before the sun rose up and had been waiting for someone next to the table after her maidservant washed her face and combed her hair.</p><br/><p>Seeing that her miss was so sleepy and yawning all the time, the maidservant wondered who the important person that she was waiting could be. She worried that Mistress Jian or the person living in the Lin 47th Street would be unhappy if they knew about this.</p><br/><p>The door of the room was pushed open and Sangsang walked in, but Xiaocao stayed outside.</p><br/><p>Dewdrop looked at the package, her eyes lighting up suddenly. She asked, \"You are so bold. I didn't expect you to come alone.\"</p><br/><p>Sangsang put the package on the table and said, \"If he asks about where you got it, you can tell him that I stole it.\"</p><br/><p>...</p><br/><p>It was dawn.</p><br/><p>A small carriage with black curtains left the House of Red Sleeves and went to a lake in the south of the city.</p><br/><p>The lake was really quiet and there was a restaurant standing next to it, whose name, the Victory House, was written by the Libationer. It was the best restaurant in Chang'an.</p><br/><p>Across the street, there was a quiet estate with black roof and dark bricks on the roof, which was said to belong to the owner of the Victory House. It was called the Stone House and dealt with antiques.</p><br/><p>Compared with the Victory House, it was a lot less famous and only a few ordinary people knew about it. But the really rich and noble ones knew that this place was where the antiques from the whole world were stored.</p><br/><p>The small carriage didn't stop in front of the Stone House, instead, it was led into the yard by a steward.</p><br/><p>Dewdrop walked out of the small carriage with the package in her arms.</p><br/><p>The boss of the Stone House was welcoming her in the yard. He was very polite and kind to her.</p><br/><p>As the founder of both the Victory House and the Stone House, this person was definitely not an ordinary person and he must have very strong backings. Dewdrop knew that she was no way as noble as him, despite that she was the onetime most famous girl in Chang'an. He was polite to her just because of the package.</p><br/><p>She put the package on the table without saying anything.</p><br/><p>The owner was surprised to see the cheap blue cloth, wondering who would wrap such a precious thing with this kind of cheap cloth. He suspected whether the thing inside was real, but when thinking about those valuable calligraphy pieces he got from this girl in the past one year and the rumors people in the calligraphy and painting circle were talking about, he decided to take the risk.</p><br/><p>Looking at the owner of the Stone House, Dewdrop restained her nervous feeling and said softly, \"You have ten days to sell it, and I will be waiting for your good news at the House of Red Sleeves.\"</p><br/><p>The owner frowned and said, \"Dewdrop, you know very well how much responsibility we need to take when selling this kind of things. I need to pay lots of money...\"</p><br/><p>\"Don't talk about money with me.\"</p><br/><p>Dewdrop smiled, \"I am only a representative. This is not really my business, so you don't need to talk about money with me. And we both know what it means to the Stone House if these things are sold through your hands. You shouldn't get any money from the person who asked me to do it, instead, I really think I should ask some money from you for her.\"</p><br/><p>The owner knew that Dewdrop was very clever. He smiled, \"It was wrong of me to say that. When it is done, I will pay you well to show my gratitude.\"</p><br/><p>Dewdrop went into the small carriage and left the shop.</p><br/><p>The owner asked all of his workers to leave, except for his most trustworthy manager.</p><br/><p>The manager looked at the blue package and asked in a shivering voice, \"Is it really his calligraphy?\"</p><br/><p>The owner said, \"Would I care so much if they weren't real?\"</p><br/><p>The manager remembered the comments from those famous appraisers in the calligraphy and painting circle and believed that it was real.</p><br/><p>He stroked his bread and sighed, \"I feel so bad for Sir Ning. He is such a famous and admirable person, but who would have thought that his handmaiden would be so greedy?\"</p><br/><p>...</p><br/><p>...</p><br/><p>-</p><br/>\n</div>"}