{"title": "Chapter 459: Yellow Leaves and the White Chess Piece", "id": 459, "volume": 5, "url": "http://boxnovel.org/nightfall-chapter-459-yellow-leaves-and-the-white-chess-piece", "volume_title": "Volume 5", "body": "<h1>Chapter 459: Yellow Leaves and the White Chess Piece</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 459: Yellow Leaves and the White Chess Piece</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The General's Mansion did not prepare delicacies for the banquet tonight. The long table set in the courtyard between the autumn trees was dark. And on it, were several normal dishes that held an awe-inspiring aura. There were not many servants by the table either. Instead, Xia Hou's two sons were the one arranging the dishes on the table. This was very different from the rumored extravagance that General Xia Hou enjoyed.</p><br/><p>The entire Chang'an was watching the banquet. However, the atmosphere at the banquet was not as hostile as what some imagined. Xia Hou and Ning Que sat at opposite ends of the table and ate quietly. They would occasionally talk about the Wilderness and what had happened in the Front Gate.</p><br/><p>The simple banquet ended simply. The maidservants streamed in one after another and removed the dishes silently. Then, they brought two azure teapots.</p><br/><p>Xia Hou's sons served Ning Que tea and then bade farewell politely. They walked out of the gardens and asked the maidservants and stewards to vacate the area before guarding outside themselves.</p><br/><p>The teapots and teacups were azure. They looked bold but mild. The tea within it was black tea, a gentle tea. Even the temperature of the tea was just right.</p><br/><p>Ning Que looked at the teapot carefully. He reached out to touch the cup and then looked up at Xia Hou. He looked at him intensely just like how he looked at the teapot or how he had looked at Prince Li Peiyan when they met for the first time in the halls of the Academy. He looked at Xia Hou as if he wanted to imprint his image in his mind.</p><br/><p>Xia Hou looked at the tea leaves floating in the water. He knew that Ning Que was staring at him, and the corners of his lips twitched upward. He said, \"Do you want to see clearly how your enemy looks like? You did not stare so openly in Tuyang City.\"</p><br/><p>Ning Que did not deny nor acknowledge what Xia Hou said. He turned the azure teacup in his hands and said, \"The person I respected most in Tuyang City was my Eldest Brother, not you.\"</p><br/><p>Xia Hou slowly raised his head when he heard this.</p><br/><p>The floating tea leaves sank to the bottom of the cup as if they had been heavily impacted.</p><br/><p>Ning Que lowered his head.</p><br/><p>Xia Hou looked at him expressionlessly.</p><br/><p>The autumn breeze picked up in the courtyard, causing the trees to rustle. Numerous thin yellow leaves were blown off the branches and landed on the long table and ground before the two. The chill in the atmosphere grew.</p><br/><p>If it was anyone else, they would be frightened or even nervous in the face of General Xia Hou's power and the chill in the autumn breeze and yellow leaves. They would grow frightened and nervous thinking about the deep-seated hatred between the two. However, Ning Que did not. His face was devoid of any expression.</p><br/><p>Xia Hou looked at his eyes and suddenly said without any warning, \"Are you Lin Guangyuan's son?\"</p><br/><p>Ning Que looked at the darkening tea in his cup and shook his head.</p><br/><p>The autumn breeze with a chilling aura swirled in the courtyard, causing more leaves to fall. The breeze swept the leaves on the table to the ground and scattered the leaves on the ground in all directions.</p><br/><p>Xia Hou said, \"I have killed many. I do not care.\"</p><br/><p>Ning Que finally raised his head. He looked at Xia Hou and said, \"General, you are powerful.\"</p><br/><p>The yellow leaves on the ground were scattered in all directions by the wind and stopped at the wall. They looked like layers of waves lapping on the bank.</p><br/><p>Xia Hou said, \"Somtimes, you have to get over with your hatred, if even you cannot.\"</p><br/><p>The fallen leaves piled higher and higher against the walls. The leaves on the top fell only to be swirled up by the wind once more. The chilling aura and the autumn breeze did not let any leaf escape.</p><br/><p>Just like their conversation. Xia Hou's three separate statements did not seem to have any links to each other, but they forced their way forward without giving Ning Que an opportunity to retreat.</p><br/><p>Ning Que looked at the struggling leaves at the corner of the walls and asked, \"Please, teach me.\"</p><br/><p>Xia Hou looked at him, deadpanned, \"You can't touch me.\"</p><br/><p>Ning Que turned and said, \"But you dare not touch me.\"</p><br/><p>One cannot be touched and one dared not touch. The two did not sound any different, but the difference was huge. The first statement implied that Ning Que did not have the ability to touch and the second implied that Xia Hou was not brave enough to touch.</p><br/><p>Xia Hou said, \"That is why we have to solve this hatred even if it cannot be solved. Or perhaps you can wait another 20 years for me to be truly old and weak.\"</p><br/><p>\"Then you'd definitely be dying, and you'd have enjoyed 20 years of good life.\"</p><br/><p>Ning Que looked at him and smiled, \"Of course, I'm just pointing out the facts. Please do not misunderstand, general. Actually, I feel that since you are ready to retire, you shouldn't say such ominous things.\"</p><br/><p>Xia Hou's eyes narrowed slightly when he heard that and a faint emotion appeared on his tanned face. He said, \"No matter the imperial court or West-Hill, they all think that I can retire safely. And I should be satisfied with that. However, I am not. The cavalry under my control can make a clean sweep of this country. Furthermore, I am a general with numerous accolades, but the imperial court and His Majesty treat me coldly just because of that little incident that happened then. Why else, if not for this, would I go to the Wilderness and steal the Tomes of Arcane? Would the situation have become what it is right now?\"</p><br/><p>Ning Que asked \"General, are you trying to explain yourself to me?\"</p><br/><p>Xia Hou did not hide his contempt for him, and said mockingly, \"If you were not lucky enough to have the Headmaster as your teacher, what right would you have to sit before me? Even so, what right do you have for me to explain to you? I just want you to know that I'm not in a good mood right now.\"</p><br/><p>Ning Que said, \"General, what you have said had turned the massacre in Chang'an and Yan territory into a small incident. This doesn't put me in a good mood either.\"</p><br/><p>Someone had finally talked about what had happened back then at this point in the conversation.</p><br/><p>\"I do not need to care how you're feeling.\"</p><br/><p>Xia Hou looked at him and coldly said, \"I have already said, you can't touch me. And since I am not in a good mood, you have to care about that. That's because if you make me angry, I can crush you like an ant. I advise you to keep me in a good mood in the days before I leave Chang'an.\"</p><br/><p>Ning Que shook his head, \"I can't think how you're going to crush me.\"</p><br/><p>\"I can do it anytime in this garden.\"</p><br/><p>Xia Hou said expressionlessly, \"Mr. Thirteen of the Academy wanted to assassinate the general, but failed miserably and was crushed into bits by the general.\"</p><br/><p>Ning Que drank the tepid tea and smiled, \"Crush me... General, if you do that, your mansion and your family whom you're sending back home would be crushed by teacher.\"</p><br/><p>There was only one person in the Tang Empire who could silence Xia Hou. It was never the Emperor, but the Headmaster of the Academy.</p><br/><p>Xia Hou looked at him and said, \"Just as you have said previously, I do not dare to touch you. You cannot touch me, so I hold the upper hand. If you try anything before I leave Chang'an and do something that I cannot bear, I will try to touch you.\"</p><br/><p>Ning Que asked seriously, \"Is this a threat?\"</p><br/><p>Xia Hou said, \"I am teaching you, that having an influential background is useless before life and death. You can only trust your abilities.\"</p><br/><p>Ning Que looked at him and smiled. He said, \"Back then, Youngest Uncle had destroyed the Devil's Doctrine with a sword. General, you discovered then, that your influential background had disappeared with that. Is that why you turned your back on your sect and joined the West-Hill? It is different for me. The Headmaster is not Lotus, and the Academy isn't the Devil's Doctrine either. General, you may rest assured.\"</p><br/><p>Ning Que's words had shed light on Xia Hou's deepest and darkest secrets. It was like slapping him in the face. General Xia Hou's face flushed.</p><br/><p>It wasn't because he was drunk.</p><br/><p>He had drunk tea tonight.</p><br/><p>General Xia Hou's face was flushed with anger.</p><br/><p>Ning Que had dared to mock him because he knew that no matter how violent and blood-thirsty the general was, he would not dare to do anything to him because he came from the Academy.</p><br/><p>Indeed, Xia Hou looked at him silently like he was a fallen leaf on the table. The red flush on his face subsided and he calmed himself down. He said, \"Please leave.\"</p><br/><p>Ning Que lightly shook off the leaves that had fallen onto his black Academy uniform. He did not bow or bade his farewells to Xia Hou. Instead, he straightened and left the garden.</p><br/><p>The autumn breeze quietened and the leaves that had been pushed against the corner in a pile spread apart.</p><br/><p>Xia Hou's sons walked into the garden and looked at their father silently. They wanted to speak, but changed their minds.</p><br/><p>\"It's nothing.\"</p><br/><p>Xia Hou said with an unreadable expression, \"A person who dares not acknowledge his family before the man who killed his father might be intelligent, calm and rational. But all of these qualities are meaningless.\"</p><br/><p>\"I sat across him, but he dared not take revenge for his family. It is the greatest shame of all, and he knew that. That is why he felt so ashamed and used his words to shame me.\"</p><br/><p>\"He came today to make himself feel better. But he only knew how to use his mouth and not his hands. How can a boy who lacks courage that is necessary to become a powerhouse be fit to be my enemy?\"</p><br/><p>...</p><br/><p>...</p><br/><p>General Xia Hou's inviting Ning Que to a banquet was an important event in Chang'an. Several bigwigs began to worry when Ning Que entered the General's Mansion. There were many spying on the event who then reported back to the palace and some other places.</p><br/><p>No one knew what exactly happened at the banquet, but since Ning Que had left alive, nothing much must have happened. General Xia Hou did not attack, and nobody thought that it was possible for Ning Que to kill Xia Hou and walk out of the mansion without any trace of blood on him.</p><br/><p>In the imperial study, the Emperor thought hard. In a hall not far away, the empress and Grand Secretary Zeng Jing looked at each other. General Xu Shi who had been waiting at the Military Ministry listened to the report and nodded. The old Minister of Offerings of Qinghe County at the censor's mansion felt a little regretful.</p><br/><p>On the top floor of Wanyan Tower, Nation Master Li Qingshan stood by the stone windows and looked at the direction of the General's Mansion. He said, pleased, \"I have always been worried about Ning Que's character. It seems that he is indeed more concerned about the bigger picture now after studying under the Headmaster for so long. Senior Brother Yan Se was right to pass his mantle and the array eye onto him.\"</p><br/><p>Master Huang Yang smiled at him and did not say anything.</p><br/><p>Li Qingshan walked away from the windows and to the desk. He pushed some Buddhist scriptures away and pulled out some black and white chess pieces and tossed them down casually.</p><br/><p>He had not recovered from his injuries, but wanted to do something because of his good mood. His divination this time was casual, and he had no wish to peek into the secrets of heaven. He just wanted to see if he was lucky enough to sense something.</p><br/><p>A clean white chess piece began to spin. It spun faster and faster until it left the table and fell onto the hard ground.</p><br/><p>There was a loud clatter, and the white chess piece broke into two.</p><br/><p>The break was clean as if it had been cleaved apart by a sharp sword.</p><br/><p>Li Qingshan stared at the white chess piece in a daze. His expression grew grave.</p><br/><p>Huang Yang frowned and said in surprise, \"That is a scary sword... could it be that Liu Bai has come to Chang'an?\"</p><br/>\n</div>"}