{"title": "Chapter 479: It Had Never Been a War of Only One Man", "id": 479, "volume": 5, "url": "http://boxnovel.org/nightfall-chapter-479-it-had-never-been-a-war-of-only-one-man", "volume_title": "Volume 5", "body": "<h1>Chapter 479: It Had Never Been a War of Only One Man</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 479: It Had Never Been a War of Only One Man</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>When the talisman rose from the lakeside, Ye Su stood in the wind and snow and said, \"Uncle Yan Se indeed knows people well, but who could imagine that Ning Que could master these not long after entering the Talisman Taoism?\"</p><br/><p>In his opinion, the talismans that Ning Que wrote were not that powerful, some were obviously the products of a newbie in Talisman Taoism and they would generally be looked down upon and laughed at by people. However, it really shocked him that Ning Que could write so many talismans in less than two years.</p><br/><p>Ye Su's utmost surprise was the way Ning Que used those talismans - the storm caused by talismans at the lakeside looked chaotic but actually followed a secret order. Every talisman was matched perfectly, otherwise it would be impossible to create such a momentum and have such a large impact.</p><br/><p>Eldest Brother smiled and explained, \"Youngest brother is a great calligrapher. He has learned a lot and he is good with using pens and ink so he has great skill in disassembling, explaining and writing characters.\"</p><br/><p>Ye Su slightly frowned and said, \"I still don't understand how he can write so many talismans.\"</p><br/><p>The talisman master needed to be talented. No matter whether it was him, the successor of Zhishou Abbey, or the Sage of Sword, Liu Bai, none of them could get in touch with Talisman Taoism. However, this didn't mean he knew nothing about Talisman Taoism.</p><br/><p>Talisman masters could only use the talismans they wrote. Even though a Divine Talisman Master like Master Yan Se could leave Divine Talismans for his disciples to use, the number of them he could leave could not be too much.</p><br/><p>Writing a talisman needed to consume a large amount of psyche power and efforts, as well as a lot of materials. Ning Que had only written talismans for less than two years. How could he write so many talismans?</p><br/><p>\"There are not many things in the Academy, but lots of materials for cultivation. If there is any gap or omission, the imperial court will also help to prepare. As for the necessary psyche power to write talismans...\"</p><br/><p>Eldest Brother smiled and said, \"Mr. Ye Su probably doesn't know that Youngest Brother's psyche power was so great that he can rank in the forefront even if you included the back of the mountain of the Academy.\"</p><br/><p>The disciples in the back of the mountain of the Academy were not known well in the world but Ye Su knew clearly that those people must be talented in different fields. Hearing that Ning Que had great psyche power which could squeeze into the forefront of the rank among those people, he was rather surprised.</p><br/><p>At this time, Jing Fu appeared over the house at the lakeside.</p><br/><p>Ye Su felt the straight and awe-inspiring talisman from there, and slowly raised his brow. Looking at the direction of the Yanming Lake for a long time, he got more relaxed and said, \"The half divine talisman is not a divine talisman after all.\"</p><br/><p>Looking at the lake in the darkness, Eldest Brother said with slight regret, \"Although Youngest Brother has made great progress, he isn't able to become a talisman master since he just entered Talisman Taoism not long ago.\"</p><br/><p>Ye Su shook his head and said, \"So what if he is a Divine Talisman Master? Unless he reaches the level of Uncle Yan Se, he can only dream of beating Xia Hou with just a fluttering Fu paper.\"</p><br/><p>\"I never thought that I could kill Xia Hou with only Talisman Taoism, which my master might have managed to do in his prime. I don't have that ability, but I have my own ideas.\"</p><br/><p>Ning Que looked at the other side swallowed by the night once again and said, \"People say that I can't challenge someone in other states. There is no one, including my Senior Brothers in the Academy, who believes that I can beat Xia Hou. But I insist on doing it because they have forgotten that I have never considered defeating him. I just want to kill him.\"</p><br/><p>How could one kill the enemy without defeating him?</p><br/><p>\"Battle is only one instant but killing a person can be a long process in which there can be many battles. I may not be able to defeat him in countless battles, but I can make him bleed. Even if I still can't beat him down in the end, he would still bleed to death.\"</p><br/><p>\"When he runs out of blood, he will die naturally.\"</p><br/><p>\"Tonight, the loser of this battle will not depend on strength, not psyche power, or state, but on who will bleed to death first. He's a strong member of the Devil's Doctrine, with super terrifying defense that makes him like a turtle. The thing I will do is continously bloodletting this turtle and keeping myself from being bitten by him.\"</p><br/><p>Ning Que said seriously, \"Thanks to Tang, the shell on the outermost layer of Xia Hou's body is gone. So my job is relatively simple.\"</p><br/><p>Sangsang looked at him and said, \"We will succeed.\"</p><br/><p>Ning Que talked a lot today and gave many explanations.</p><br/><p>If the one next to him was not Sangsang but some other audience, such as Ye Hongyu, she would have been bored to death and wanted to kick him into the ice lake under the cliff.</p><br/><p>In the beginning, Sangsang was a little surprised but soon she understood why.</p><br/><p>Facing Xia Hou, Ning Que had no confidence.</p><br/><p>Even if his face was peaceful and his tone was calm. Even if he looked as if he was full of confidence, and everything was under control. Even if he had prepared for this duel for 15 years.</p><br/><p>He still had no confidence.</p><br/><p>So he kept talking about his preparations, talking about his own reasons for victory, trying to convince himself that he could really overcome the challenge across the border and defeat this seemingly invincible enemy.</p><br/><p>Sangsang was very worried about Ning Que's current state of mind.</p><br/><p>So she kept using a tone more certain than Ning Que, saying, \"We will win. We are going to be the winners.\"</p><br/><p>When the entire world did not believe in Ning Que, even when he lost confidence in himself, she was the only one left who could give him confidence.</p><br/><p>Because Ning Que was not fighting alone. These two people were always fighting together.</p><br/><p>Sangsang put the big black umbrella on her lean shoulder, stretched her right hand and clutched at Ning Que's shirt. She clutched it so hard that her thin fingers were digging into his body.</p><br/><p>Then she slowly closed her eyes and her eyelashes did not tremble.</p><br/><p>Xia Hou walked out of the lakeside courtyard and came to the lake embankment, with many willows in front of him.</p><br/><p>The furious sea of Fu paper carried out tens of thousands of attacks on his powerful body. Although it was not able to leave any injuries on his body, it managed to cut his hair down and make it messy.</p><br/><p>Interspersed with several silver hairs and scattered on his stout back, his black hair made him look like a devil on the scroll of the Buddhist scriptures. However, the tattered clothes and the broken armor tied on his waist made him a devil in an awkward predicament.</p><br/><p>Xia Hou emotionlessly reached out and tore off the pieces of armor around his waist, throwing it under the willows as if it were garbage, and then watched the darkness that fell on Yanming Lake and started coughing.</p><br/><p>On nights like these, the temperature was so low that the ice on the lake was as solid as steel.</p><br/><p>However, it should not be felt by a man at the peak state of martial arts who was physically and mentally strong.</p><br/><p>To Xia Hou's surprise, there were so many talismans in the lakeside courtyard that the snow was somewhat unbearable. It was surprising that the ability of Ning Que in using talismans was much stronger than what the rumors set. What surprised him most was that Ning Que could activate those talismans from such a long distance.</p><br/><p>This incident had made him vigilant and he knew he had made a mistake. Since he realized his mistake, he could fix it. So he didn't mind it and still looked around at the lake.</p><br/><p>Yanming Lake was covered by white snow, and the night was too dark, without starlight or lamplight. The world that should have been clear was so dark, and even the snow seemed to have turned black.</p><br/><p>Everything was dark, whether it was the cold willows near him, the reeds in the distance, the iced lake or the hills around the lake. No matter how sensitive the perception state was, one could not see anything with naked eyes here.</p><br/><p>Xia Hou did not know where Ning Que exactly was right now and he only knew that Ning Que must be on the shore of Yanming Lake. But he did not know whether he was on the wooden bridge on the West Bank, or in the snow forest on the East bank or on the cliff of the South bank.</p><br/><p>However, he was sure that once Ning Que moved, Ning Que would die.</p><br/><p>Ning Que stood on the cliff and held an iron bow in hand.</p><br/><p>He lifted the iron bow and slowly pulled the bowstring.</p><br/><p>The bowstrings vibrated and buzzed, and the sound was instantly concealed by the blizzard.</p><br/><p>The dark iron bow, covered by snow, appeared to be even colder.</p><br/><p>The iron arrow on the string was engraved with complex lines of a talisman, aiming at the darkness in the north shore of the Yanming Lake.</p><br/><p>The clouds covered the stars and the surroundings were dark.</p><br/><p>No stars, no shadows.</p><br/><p>Xia Hou could not see Ning Que, nor could Ning Que see Xia Hou.</p><br/><p>It was different from shooting Prince Long Qing at the wilderness on the snow cliff last year.</p><br/><p>At that time, Prince Long Qing was at the crucial moment of breaking out of his realm so his practice and state were so shiny that they were like a blossom golden flower in the sense of perception of Ning Que, which allowed Ning Que to see him clearly from a distance of several miles, and to shoot him without specifically aiming.</p><br/><p>However, Xia Hou was at the peak state of martial arts with a stable state. Whenever he moved his mental state, he could mix himself with the cold willows at the lakeside. Even though Ning Que got into the Knowing Destiny State, he could not locate Xia Hou.</p><br/><p>If so, where was he going to shoot with the primordial thriteen arrow in his hands?</p><br/><p>Right at this moment.</p><br/><p>Sangsang under the big black umbrella, with her eyes closed tightly, frowned with her eyebrows like a little black flower, and muttered some numbers.</p><br/><p>\"Six three three three.\"</p><br/><p>\"Two one seven seven two.\"</p><br/><p>More than two years ago in the spring, an arrow was shot from the depth of Min Mountain and toward the Northern Mountain Road.</p><br/><p>The handmaiden, nervously huddling and closing her eyes as the third assassin chopped towards Ning Que, exclaimed the two words with all her strength.</p><br/><p>More than two years later, on the edge of the cliff, down on the north shore of the lake, under the willows, strong enemies were fighting in silence.</p><br/><p>When the blizzard was dancing on the cliff, Sangsang shouted out the two numbers again.</p><br/><p>The numbers were the coordinate system that only Ning Que and Sangsang understood. In the past fifteen years, it had been their instinct to hunt in Min Mountain and fight for their life so they could not go wrong with it.</p><br/><p>The scene was almost identical with that of two years ago, but the number Sangsang shouted tonight was much more complex and the complexity of the number often means it is more accurate.</p><br/><p>The cold and dark arrow moved slowly in the falling snow at night to find its goal.</p><br/><p>Then it stopped.</p><br/><p>He relaxed his tight bowstring.</p><br/><p>The iron arrow disappeared from the string and shot into the turbulent hollow in front of the bow, and flew straight into the blizzard.</p><br/><p>...</p><br/><p>...</p><br/><p>Xia Hou firmly believed that Ning Que would definitely die once he took his next move.</p><br/><p>Ning Que took his most powerful arrow, the Primordial Thirteen Arrow.</p><br/><p>In one moment, the dark iron arrow disappeared in front of the cliff.</p><br/><p>And in the next moment, it appeared in front of Xia Hou.</p><br/><p>The lines of talisman shined slightly on the arrow and the remaining snowflakes had not been blown away by the wind yet.</p><br/><p>Right at this moment, the Primordial Thirteen Arrow seemed to have broken the limits of distance and time.</p><br/><p>Beyond that, it was not even affected by the surroundings.</p><br/><p>The cold arrowhead pierced the underclothes of Xia Hou.</p><br/><p>The layer of Qi of Heaven and Earth in his body suddenly collapsed.</p><br/><p>Xia Hou felt something.</p><br/><p>He reached his hand out and clenched his fist in the air.</p><br/><p>He only managed to hold the middle of the arrow.</p><br/><p>There were only a few people in the world who could seize Ning Que's Primordial Thirteen Arrows.</p><br/><p>The iron arrow made harsh noises in his iron palm.</p><br/><p>Sparks splashed and illuminated the lakeside willows.</p><br/><p>...</p><br/><p>...</p><br/><p>...</p><br/>\n</div>"}