{"title": "Chapter 474: Hoisting the Flag", "id": 474, "volume": 5, "url": "http://boxnovel.org/nightfall-chapter-474-hoisting-the-flag", "volume_title": "Volume 5", "body": "<h1>Chapter 474: Hoisting the Flag</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 474: Hoisting the Flag</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>On the cliff in the back of the Academy's mountain.</p><br/><p>The Headmaster of the Academy in black overclothes sat by the edge of the cliff and looked in the direction of Chang'an from a distance. The snow looked like salt flowers spread by Haotian.</p><br/><p>\"Fifteen years ago, I was sitting here and watching the woodshed in the Official of Counsel's Mansion.\"</p><br/><p>\"I watched him as he walked out of the woodshed, palefaced and holding a chopper. I watched him hiding in the well grasping a rope. I watched him climbing over the wall and walking into the crowd. I watched him leaving Chang'an. He reminded me of your Youngest Uncle from a long time ago.\"</p><br/><p>The Eldest Brother stood beside him and asked, \"What did my Younger Brother and Youngest Uncle have in common?\"</p><br/><p>The Headmaster shook his head and said, \"I could not tell. Maybe they were both eager for freedom.\"</p><br/><p>\"I agree with you on my Youngest Uncle's part, but were freedom and what had happened to Younger Brother relevant?\"</p><br/><p>The Headmaster said, \"The so-called freedom, is your right to choose. Choose to live, choose to die, or not to choose. Your Younger Brother chose to take the chopper to kill the housekeeper and his best friend. At that moment, he had taken his first step toward freedom.\"</p><br/><p>The Eldest Brother said honestly, \"Teacher, I don't understand?\"</p><br/><p>The Headmaster said, \"You are like the clearest stream in the world and flowing among the hills freely. Maybe you have run into some shoals and reefs, but you never came across a real danger or faced the option your Younger Brother faced once.\"</p><br/><p>\"No one was qualified to judge the choice Ning Que made at that time, but it was unusual for him to do that. Your Youngest Uncle made a similar decision in that year. No matter what happened to them, they both did what they wanted.\"</p><br/><p>The Eldest Brother said, \"That's why teacher took him as a disciple.\"</p><br/><p>The Headmaster sighed and said, \"In the spring, I met your Younger Brother in the Building of Pines and Cranes and had a talk with him in the hut. I was a little disappointed when I found he was different from your Youngest Uncle.\"</p><br/><p>\"But that's how life is. How can two leaves be exactly the same?\"</p><br/><p>He watched the snow and the city with relief. \"However, today, his choice surprised me. I never expected he was brave enough to challenge Xia Hou face to face. I like the clumsy choice he made.\"</p><br/><p>He turned around looked at his eldest disciple and said with a smile, \"You are the clumsiest one among your brothers, but I like you the most. However, you need to study from Jun Mo and your Younger Brother about some of their ways.\"</p><br/><p>The Eldest Brother agreed with his teacher. He watched the snow and could not help worrying about his Younger Brother. He hesitated a while and said, \"If Younger Brother indeed loses to Xia Hou, what should I do?\"</p><br/><p>This was an interesting question. It suggested that in the Eldest Brother's opinion, Ning Que was not qualified to have a fight against Xia Hou.</p><br/><p>\"I don't believe in Heaven or fate. I only believe in myself.\"</p><br/><p>The Headmaster had a look at the grey sky and said, \"Everyone believes in himself. This is your Younger Brother' s choice, and this is also his ridicule and contempt toward fate. Except for a fair chance, he asked for nothing.\"</p><br/><p>The dead silence in front of the palace lasted for a long time. The snowstorm crumbled the bloody flag, swayed the big black umbrella and froze people's faces as well.</p><br/><p>The Nation Master, Li Qingshan looked at Ning Que complicatedly and said, \"Is that all?\"</p><br/><p>Ning Que kept quiet.</p><br/><p>Li Qingshan sighed and shook his head. He said, \"His Majesty said that if you insisted on fighting against him, you had to hand over the thing first.</p><br/><p>\"He said you know what he means.\"</p><br/><p>The tip of Ning Que's eyebrows slightly tilted up and he asked, \"Why?\"</p><br/><p>Li Qingshan said, \"It's your personal grudge.\"</p><br/><p>Ning Que said, \"Yes.\"</p><br/><p>Li Qingshan said, \"Since it is your personal grudge, you are not allowed to use it.\"</p><br/><p>Then he seriously said, \"If you are able to survive after the battle, you can get it back.\"</p><br/><p>Ning Que looked at the snow under his feet and did not say anything. After a while, he took out a thing enveloped by a piece of cloth, but he refused to hand it over to Li Qingshan.</p><br/><p>Li Qingshan frowned and said, \"Can't you even trust me?\"</p><br/><p>\"Except for myself, I trust nobody. Sorry.\"</p><br/><p>Ning Que gave it to Chen Pipi beside him and explained.</p><br/><p>Li Qingshan smiled with a bitter expression and walked toward the palace.</p><br/><p>People in front of the palace were curious about what it was. Xia Hou could clearly feel the fluctuation from it, so he frowned and said to Ning Que, \"You have the array eye. That's why you believe you are qualified to challenge me?\"</p><br/><p>Ning Que said, \"I said once, I still have many more powerful tools.\"</p><br/><p>Xia Hou slowly and gently stroked the arms of the chair, as if he did not notice that there was nothing there. He said, \"Now that you don't have the array eye, do you still insist on killing me?\"</p><br/><p>Ning Que answered, \"You have killed many people, so have I. People like us should know that there are many ways to kill a man.\"</p><br/><p>Xia Hou said wryly, \"Even though you will die because of this, you are still bent on killing me. For what? Only for revenge? How much could you remember at four years of age? Do you remember your parents' faces? I don't think so. I believe you are doing this just because you need to get rid of the psychological shadow.\"</p><br/><p>Upon hearing this, Ning Que said, \"I must admit that it was not comfortable to have my master's blood in my hands. I could not wash it away. Maybe it was my psychological shadow. Since I used a chopper to kill for the first time, it became my usual weapon.\"</p><br/><p>He looked at Xia Hou and said, \"But then what? What are you going to say?\"</p><br/><p>Xia Hou slightly lifted his eyebrows and said with a mocking and contemptuous tone, \"At least, it proves that your revenge is not as great and just as you think.\"</p><br/><p>\"Great and just?\"</p><br/><p>Ning Que shook his head and said, \"After I escaped from Chang'an, I dreamed of this many times. If I could find some masters in the mountains and learn from them, what should I say to you after managing to break into your military camp?\"</p><br/><p>\"I would ask you why you were so cold and easy to kill. I would say that killing you today was for the people in the General's Mansion and the villages in the Yan territory. I would fight for justice and all the innocent people. The list was long and the last name on it was my best friend's.\"</p><br/><p>He paused for a while and looked at Xia Hou. \"These words sounded just and powerful, but what did these words have to do with me?\"</p><br/><p>A cold wind blew over him and he coughed with his hands covering his mouth. Then he spat on the snow. The dark yellow phlegm looked obvious on the white snow.</p><br/><p>\"I have killed not fewer men than you have, and I have done a lot of evil things that you cannot imagine. My hands are never clean and I am not a so-called angel of justice.\"</p><br/><p>\"I don't care how many innocent people you have killed, and as long as they had no relationship with me, I can applaud you, but since you have killed my entire family, I will naturally aim to kill you. It's an ethical intent and I don't need other reasons.\"</p><br/><p>Xia Hou kept silent for a long time and suddenly said, \"Sounds interesting.\"</p><br/><p>Then he got up from the chair.</p><br/><p>He looked like an indestructible mountain which suddenly appeared in the snow.</p><br/><p>\"Come and kill me.\"</p><br/><p>He finally said, \"Or be killed by me and let me finish your miserable life.\"</p><br/><p>It was late in Chang'an, as if this night was endless. The thick snow clouds covered the last glimmer of the sun and the stars in the sky. Yanming Lake was totally dark. There were only a few torches lighting the snow from a distance and turned them into starlight.</p><br/><p>Xia Hou looked at the closed door of the courtyard and reached out to get the army flag from his soldiers. Then he walked to the door and held the flag with his right hand.</p><br/><p>He did this randomly. The ground in front of the courtyard was made of hard rocks, so when the flagpole fell, the rocks were fragmented. The flagpole stuck deeply into the ground, splashing gravel profusely.</p><br/><p>Xia Hou slowly relaxed his grip and the flagpole seemed to be planted on the ground. The bloody flag was fluttering on the snow and devoured the darkness.</p><br/><p>This bloody king flag had accompanied Xia Hou for many years.</p><br/><p>The flag had been waved over the Northeast Border Military of Tang all the time, no matter if he fought against the Yan Kingdom or the cavalry of the Left King's palace.</p><br/><p>For decades, the bloody flag had never fallen.</p><br/><p>Just like the powerful man under the flag.</p><br/><p>The guards around Yanming Lake, the vigilant officers, and the soldiers who were maintaining order, all looked at the flag and they had a strong feeling.</p><br/><p>Tonight, the bloody flag would not fall, either.</p><br/><p>Xia Hou walked up the stone steps.</p><br/><p>Then he pushed the door open.</p><br/><p>He entered the night.</p><br/><p>Ning Que was not in the house beside Yanming Lake.</p><br/><p>He and Sangsang were standing on Yanming mountain to the south of the lake and overlooked the opposite bank.</p><br/><p>Sangsang was holding the big black umbrella to shelter them from the snow.</p><br/><p>In people's eyes, Ning Que's most powerful weapons were the talisman and the arrows. It was reasonable for him to keep a distance if he wanted to fight against Xia Hou, a Peak state of Martial Arts master.</p><br/><p>Although Xia Hou did not know where Ning Que was, he could figure it out. However, he was too arrogant to care about this.</p><br/><p>The snow and wind were so strong that the sky and stars were covered. Yanming Lake in winter was like a frozen inkstone. Even if Ning Que had an acute sense, he was not able to see the other side.</p><br/><p>How could he use the Primordial Thirteen Arrows to kill Xia Hou if he did not have a clear vision?</p><br/>\n</div>"}