{"title": "Chapter 496: The Story of Spring(III)", "id": 496, "volume": 5, "url": "http://boxnovel.org/nightfall-chapter-496-the-story-of-springiii", "volume_title": "Volume 5", "body": "<h1>Chapter 496: The Story of Spring(III)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 496: The Story of Spring(III)</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The forests under the cliffs were full of luxuriant foliage that blocked off the sunlight, making it exceptionally quiet and a little creepy. Fortunately, it did not take long for Long Qing to walk out of the forest.</p><br/><p>He shifted the load on his shoulders and prevented it from pressing against the wound that he had gotten a while back. Looking at the green cliff in front and the vines that covered the entire rock walls, he heaved a deep breath, dispelling the fear in his heart before lowering his head and following the narrow mountain path up.</p><br/><p>The cliff was steep and it was hard to climb while carrying such a heavy object. When he walked to the front of the cave entrance, he felt as if his waist was about to break. Luckily, there were three or four stone steps near the entrance for him to rest his feet. He clumsily placed the bucket down and remembered that there was a spring in the cave. Hence, he did not take any water and took out a box from his bag. Using his hands to push apart the vines, he entered the cave.</p><br/><p>The cave was incredibly low and a normal person would not be able to stand and walk. Long Qing bent forward and walked silently, almost like a true servant. Even though the cave was low and there were vines at the entrance, it wasn't dark at all but as bright as day.</p><br/><p>This was because every few steps, along the stone walls, there were luminous pearls inlaid within. These luminous peals were round and flawless, and their brightness was attention-grabbing. They were as big as an egg and were probably one of the most precious treasures in the world. However, there were countless caves in this mountain behind the Zhishou Abbey and there were countless of these precious luminous pearls in this cave itself. Moreover, the creator actually used such a treasure as a lamp.</p><br/><p>Long Qing had come to this cave before, hence he could remain calm. When he entered this cave for the first time, he was awe-struck by what he saw before him. Even though he had lived in the Yan Kingdom Capital Cheng palace, there were only a few luminous pearls of such high quality.</p><br/><p>The cave looked simple and even miserable between the green cliffs but it was another world inside. There was jade inlaid on the walls, flowers and birds, and gold covered the floor while silver lined the walls. In the deeper ends of the cave, there were countless rare and unusual flowers with old calligraphy. This was rich to the extreme, even surpassing what the emperors of the world enjoyed and what humans could imagine. It was vulgar but no one would dare to say that about it.</p><br/><p>Because besides ruling the entire world, the Haotian Taoism that owned limitless wealth and resources no longer have the power to do something this vulgar in the deep forest where no one knew.</p><br/><p>There was an incredibly large soft couch in the hall and it was covered with dozens of Snowfield Direwolf skin, almost like a real snow plain. At the center of the silver-white fur sat an old man, his face was incredibly wrinkled and the clothes on him seemed incredibly old, almost as if he had not changed for many years.</p><br/><p>The Snowfield Direwolf was incredibly powerful and it was hard to even hunt for one. There were so much of their fur here, one could only guess how powerful this man must be back then.</p><br/><p>Long Qing walked to the front of the couch and knelt as he brought up the box with both hands, not daring to look at the man. He looked very respectful and humble, silently waiting for his instructions.</p><br/><p>Lying among the wolf's skin and enjoying the most expensive thing in the world, it must be a dream for many. However, there was no expression on the man's wrinkled face. He seemed lifeless, almost like a dried corpse. The only thing that proved that he was alive was his eyelids that moved occasionally. His eyes were filled with cruelty and endless blood and madness.</p><br/><p>Having been cut off from the world for decades, even a true palace would become a sinister cell, much less a cave. The horrifying emotions from the old man's eyes must have come from this.</p><br/><p>This old man had sat in this cave for decades not because someone else had imprisoned him. There were not many people in this world who can do so and the Taoist sect wouldn't treat a former important figure like that. Besides some concealed reason, most importantly, he could no longer walk due to his disability, or rather, even if he could walk, he wasn't willing to walk into the world in this state.</p><br/><p>His disability was serious; he did not have any feet or legs, not even a butt. It was almost as if the sharpest sword had cut him from the waist down, hence, he was left with half his body. Sitting on the snow-white wolf fur, he seemed as if he had sunken into it.</p><br/><p>Execution by cutting at the waist was one of the most brutal death sentences in the world and since it was an execution, one would lose many organs and all the blood in the body. Death was inevitable.</p><br/><p>This old man had survived instead and lived for many years.</p><br/><p>Of course he was living in pain. He was just living.</p><br/><p>The first time Long Qing entered the cave and saw the old man, he was incredibly shocked. He couldn't understand how this guy had survived. After that, he understood that the man had only drunk the spring water in the cave and had not eaten anything for the past few decades. Such ways had led him to leaving behind his entire lower half of his body. Of course, a human body would produce some waste and he was sure that this old man must have been able to forcefully discard these waste by evaporating it off the surface of his skin through some horrifying cultivation.</p><br/><p>This speculation left him even more shocked. Humans needed food to survive and this was the rule that Haotian dictated for the world and couldn't be violated. Even if the Grand Cultivator from the Knowing Destiny State could avoid grains, he wouldn't be able to last for decades. According to the records of the West-Hill religious code, only the legendary sage that has transcended the five states had been cleansed by the Tianqi and left behind their dirty bodies for an immortal one. They could then live for the Qi of Heaven and Earth and survive just by drinking!</p><br/><p>If that was the case, could this old man chopped at the waist be this horrifying because he had already crossed the threshold of the five states decades ago?</p><br/><p>Long Qing couldn't verify his guess but if it was right, this old man on this snow-like soft couch would be the first sage that he had ever met in this world. Although, he wasn't aware what state the abbey dean of the South Sea boat had cultivated to.</p><br/><p>Hence, he had knelt before the couch when he entered, looking extremely humble and was unable to hide his respect and fear. These emotions had turned into a desire; a desire to know the end of the spiritual path and fuelled his desire for power.</p><br/><p>He thought he had finally understood the reason as to why the abbey dean had let him come to Zhishou Abbey to be a servant. Only a servant could come to this cave in the green mountains and to meet an elder like this that was the strongest person in the road to cultivation.</p><br/><p>However, how things had developed wasn't as perfect as what Long Qing expected. The elder that looked like a corpse stared expressionlessly at him kneeling in front, his lips moved slowly and his dry voice seemed to be like two hot stones that were in the desert under the hot afternoon sun, rubbing against each other. It was incredibly hard to hear.</p><br/><p>\"You are too weak.\"</p><br/><p>Long Qing didn't quite understand this sentence as he subconsciously raised his head to look at the eyes of the elder that was filled with intense tyranny. Looking at that gaze, he could only feel his conscious being sucked into a horrifying sea of blood as he groaned in pain.</p><br/><p>\"You are too weak! You are trash!\"</p><br/><p>The old man spread out his trembling hands and grabbed his skinny throat, almost as if he wanted to strangle himself to death. The voice that was forced out from between his fingers were full of disappointment and even despair.</p><br/><p>\"You trash! What do you have to enter the Zhishou Abbey! How dare you speak to me! You are trash, and so am I! Everything hidden in this mountain is trash!\"</p><br/><p>The elder moved around angrily on the snow-white fur. He looked incredibly comical and tragic moving around half his body like this, almost like a worm squirming.</p><br/><p>His shrill voice resonated within the cave and an undescribable horrifying aura spread across the room, pushing down on everything it passed.</p><br/><p>The vines were in chaos as Long Qing flew out of the cave spewing blood, landing heavily at the stone edge. He looked at the dark cave entrance, thinking back to the horrifying aura that he had just experienced, his eyes filled with shock and terror.</p><br/><p>He knew the old man wasn't trying to kill him, however his aura naturally leaked out with his anger and even then, it possessed immense powers. If that old man really released his cultivation in full, no one in this world would be able to resist it.</p><br/><p>Long Qing breathed heavily for a while before calming down. He wiped away the fresh blood by the side of his lips, placing the shoulder pole on his shoulders, and then carried his luggage and continued walking up the cliff.</p><br/><p>There were many caves in this mountain and many seniors from the Haotian Taoism lived here. They were all of different realms but were all incredibly powerful figures. However, just like that old man, they were all severely injured and disabled and hence, had a bad temper.</p><br/><p>Who was it back then who could have injured so many seniors? One must understand that these seniors had already crossed the Five States decades ago and wouldn't that mean that that person was of a higher cultivation state, and not just by one or two grades?</p><br/><p>This answer vaguely appeared within Long Qing's heart, but he didn't want to continue pondering over it as both the heavenly Tomes of Arcane and the green mountain were the only hope he had right now.</p><br/><p>He walked silently between the mountain walls, entering and exiting the mysterious caves, almost like a busy ant walking in an ant nest, not having the time to care what spring looks like.</p><br/><p>Chang'an City.</p><br/><p>Ning Que and Sangsang had their dinner at the scholar's house. After the meal, Mrs. Zeng and Sangsang started talking while Grand Secretary Zeng Jing and Ning Que started talking in the study. Hence when it was time to leave the residence, it was a little late and there weren't many people left on the street. Ning Que decided to stay at the Old Brush Pen Shop with Sangsang for the night.</p><br/><p>The Old Brush Pen Shop was just like before, with the utensils in the bedroom in the courtyard well-prepared. Sangsang heated up some hot water and after the two of them washed up, they prepared to sleep.</p><br/><p>It was in the midst of spring and the night breeze was no longer cooling and instead had a hint of dryness to it. A wild cat laid on the courtyard wall and as it looked at the stars in the night skies, it yowled.</p><br/><p>The voice was very unpleasant and Ning Que couldn't fall asleep. He looked at the ceiling above him as he suddenly said, \"Did you know, Ye Hongyu killed the Great Divine Priest of Judgment.\"</p><br/><p>Sangsang said softly, \"I didn't know.\"</p><br/><p>Ning Que realized she wasn't as shocked when he had first found out this news. He could not help but laugh at himself, thinking that Sangsang was indeed not a mortal like him and said, \"I heard after killing the Priest of Judgement, she then severely injured Luo Kedi. If the hierarch hadn't said anything, she would have killed everyone.\"</p><br/><p>Sangsang murmured in agreement.</p><br/><p>Ning Que said, \"I thought I had already caught up with her, who would have thought that she would leave me behind so far... She is already a Great Divine Priest of West-Hill. If we were to fight in the future, I wouldn't be a match with her, and we can't use your identity as the Great Divine Priest of Light to suppress her. What should we do?\"</p><br/><p>Sangsang said: \"Then let's not fight.\"</p><br/><p>Ning Que kept silent for a while before saying, \"If your dad made you follow me to Lanke Temple, the journey would be long. It also wouldn't be right for you to be my handmaiden so he wants us to get engaged first, what should we do?\"</p><br/><p>Sangsang whispered: \"...what do you want to do?\"</p><br/><p>Ning Que said, \"Then let's get engaged.\"</p><br/><p>Sangsang's voice emerged from underneath the thin blanket, a little muffled, almost as if she had a cold, \"Alright.\"</p><br/><p>Ning Que said, \"Come here, I'm a little hot.\"</p><br/><p>Sangsang moved over from the other end of the bed into his embrace.</p><br/><p>Every year as spring ended and it became hot, Ning Que liked to hug her to bed as her body was naturally cold and hugging her was like hugging a soft cold jade.</p><br/><p>It was the same tonight, Sangsang's body was still as cool as before.</p><br/><p>However, she felt hot.</p><br/><p>Ning Que was still a little hot and as he listened to the shrill noises of the cat as it was in heat, he got annoyed and scolded in a low voice, \"Spring is ending, what are you calling for!\"</p><br/>\n</div>"}