{"title": "Chapter 497: Another Dream", "id": 497, "volume": 5, "url": "http://boxnovel.org/nightfall-chapter-497-another-dream", "volume_title": "Volume 5", "body": "<h1>Chapter 497: Another Dream</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 497: Another Dream</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Not long ago in the scholar's mansion study, Ning Que and Grand Secretary Zeng Jing had a conversation. Back then, Zeng Jing had drunk half a pot of tea and was silent for another half a pot before abruptly saying, \"I heard Sangsang saying that you will be ready to leave in a few days time.\"</p><br/><p>Ning Que nodded and said, \"Yue Laan Hungry Ghost Festival is in autumn and Lanke Temple is a little far. We need to make a move now if we want to get there in time.\"</p><br/><p>In the spring of last year, Lanke Temple had sent invitations for the Yue Laan Hungry Ghost Festival to Chang'an City and Monk Guan Hai had personally handed them to Ning Que. However due to certain circumstances after that, Ning Que decided not to go, but his intentions weren't approved by the Academy.</p><br/><p>Grand Secretary Zeng Jing said, \"The road is far and it would be right to go. However, Sangsang is my daughter after all and is the successor of the West-Hill's Great Divine Priest of Light. She cannot follow you around like a handmaiden... have you considered this?\"</p><br/><p>Ning Que hadn't really considered this and said, \"What do you mean?\"</p><br/><p>Zeng Jing stared at his eyes and asked, \"How old is Sangsang this year?\"</p><br/><p>Ning Que thought for a while and said, \"16.\"</p><br/><p>Zeng Jing couldn't help but say, \"Since she is already 16, what are you waiting for? Get the wedding in order and go on the journey as husband and wife, the scholar mansion wouldn't be a laughing stock then.\"</p><br/><p>Ning Que said helplessly, \"Isn't that a bit rushed? There aren't many days to prepare.\"</p><br/><p>Zeng Jing looked at his eyes and said, \"You two have lived together for 16 years, how is that hurried? However, marriage is indeed something that cannot leave any oversight. How about you both get engaged first?\"</p><br/><p>With such simple words, in front of a loving father, Ning Que couldn't retort back as he agreed in a daze.</p><br/><p>Thanks to the starlight from outside the window, he could see Sangsang in his embrace, her eyebrows that gradually unknitted, the smile on her face. Ning Que couldn't help but laugh. It was but an engagement, there will come a day when they will get married, so why fear an engagement? Who would have thought that the dying infant that he dug out from among the corpses 16 years ago would become a big girl and his wife one day?</p><br/><p>Thinking about all these things, Ning Que gradually fell asleep.</p><br/><p>For a normal person, falling asleep meant falling asleep but this wasn't suitable for Ning Que. Since he was young, he had been living life on the edge and his focus and time were incredibly precious, hence, he usually slept incredibly quickly and deeply. He didn't need much time to feel rejuvenated again.</p><br/><p>Such a situation persisted until he started cultivation. Back then, he brought Sangsang to the market and bought a Taishang Requiem. He then started following the method on the calligraphy to do his cultivation, trying to meditate. That night, he dreamt a warm dream, a dream of the sea.</p><br/><p>Since then, he started to dream, and it was usually a warm dream after his meditation. However, these dreams didn't have much content nor did they have any vivid images. Until the spring of 3 years ago, he followed Princess Li Yu's team towards Chang'an City from the City of Wei. On the journey, he had a conversation with the elder Lyu Qingchen and he had an unusual dream that night while embracing Sangsang's feet.</p><br/><p>In that dream, he was standing in the cold dark wasteland, he saw the cavalries from the Tang Empire, the warriors from Yuelun Kingdom, the archers from the grassland. He saw the entire Wilderness dyed red with countless bodies and three black clouds of dust at the front of the Wilderness. He saw darkness enveloping the sky and people stared at it fearfully. A tall man beside him said the sky was turning black...</p><br/><p>After killing the tea master Yan Suqing, Ning Que escaped on the Vermilion Bird Avenue and the blood and the big black umbrella on him had alarmed the Divine Talisman. That morning, the Snow mountain that had been blocked was finally reconstructed and he stepped onto the formal path of cultivation. At that point, he had another dream.</p><br/><p>In that dream, he returned to the cold and dark Wilderness. The black sky was still eating up the sky, so he lifted his head. Besides him, people weren't looking at the sky, only staring at him sadly. At this moment, there was a sudden thunder in the sky and a light gate slowly opened. As the light returned to the world, a giant golden dragon stuck its head out and stared at the crowd on the ground.</p><br/><p>During the entrance examination for the Second floor of the Academy, while climbing the cliff to the summit, Ning Que entered another dream that made reality and imagination indistinguishable from each other.</p><br/><p>The black sky was still invading this side of the Wilderness and after the light hid behind the layers of clouds, it became brighter. The barbarians were still looking at him, including the chamberlain and young master that he had killed many years ago. The tall man asked what he would choose. He said he didn't want to choose. The tall man asked what if he needed to make a choice? At the end of the dream, Ning Que killed the chamberlain and young master again before walking towards the black sky with his knife.</p><br/><p>Ning Que looked at the three clouds of dust. Feeling the cold emanating from it, his body turned stiff. He knew he was dreaming but he had no idea how to wake up from it.</p><br/><p>The black sky became colder and the light got brighter, splitting the sky into two halves. The giant dragon head looked at the life on earth mercilessly and slowly opened its mouth. The soldiers in the Wilderness were still fighting but you couldn't tell who was fighting who, because fresh blood spilled and soaked the numerous corpses.</p><br/><p>He looked at the tall man beside him and at the white hair that draped over his shoulders and his heart beat faster. Almost as if the war drums that had been broken apart on the battlefield could explode at any moment. This time, he finally confirmed that the tall man in his dreams... was the Headmaster.</p><br/><p>The Headmaster didn't turn around, looking at the sky silently, at the battle between light and darkness. However, Ning Que knew clearly that the Headmaster was waiting for him to make a choice. He didn't want to make a choice, or rather, he could only make a choice last time because he unaware of the consequences. Now, he vaguely understood certain things and he wasn't that afraid. What left him most frustrated was why the Headmaster was making him choose?</p><br/><p>Ning Que wanted to escape from this dream, the Wilderness that was soaked with blood. Hence he turned around and started running towards the edge of the Wilderness. The faster he ran, the faster his heart beat, his breath becoming shorter and his face paler. Eventually, he ran into a patch of pale sea, a sea full of white lotus flowers.</p><br/><p>The sea water was no longer warm but incredibly cold. The white lotus flowers had frozen into ice sculptures and shattered into pieces of jade, sinking into the sea. His body sunk to the depths of the sea too, into the seawater that was as thick as blood. The bloody water made it hard for him to breath. No, he was unable to breathe. He started struggling and wanting to swim away but realized he couldn't move his arms and legs, and that struggling only made him sink deeper.</p><br/><p>Ning Que opened his eyes as he woke up, his breath was hurried and he was covered with cold sweat. Horror filled his eyes, almost like a dead man. He looked at the paper on the roof and after a long time, finally confirmed that he had left his dream and returned to the Old Brush Pen Shop.</p><br/><p>These dreams were his biggest secrets. He didn't tell Chen Pipi before nor did he bring it up to the Headmaster or to his Senior Brothers and Sisters. Even though his dreams were filled with truths that he wanted to discover, he didn't dare speak of it to anyone else because he felt they were hiding something terrifying.</p><br/><p>The West-Hill Divine Palace from 16 years ago and the Buddhism Sect now were all speculating if he was the Son of Yama.</p><br/><p>Ning Que used to think they were completely nonsensical. However, whenever he thought back to when he returned to Chang'an from the Wilderness, hearing the words that Sangsang had retold from Wei Guangming and thinking about his dreams, he would feel an unusual horror. The legendary Son of Yama was referring to a person that had crossed over from another world. Wasn't that him?</p><br/><p>The black sky was approaching and the Underworld Invasion, even though they were only legends, they were legends that had left cultivators unsettled for tens of thousands of years. He didn't know the specific details but he understood that this must involve a big event like the destruction of the world. If he really was the Son of Yama, what would he face?</p><br/><p>No matter how tolerant the Headmaster was, even if he didn't care about Youngest Uncle joining the Devil, he would care about this. If not, why would he have such a tall figure in the dream?</p><br/><p>No matter how quiet the back of the mountain of the Academy was, he wouldn't be merciful in the face of such big problems. If he really was the Son of Yama, he had no idea what Eldest Brother would do. But he knew Second Brother would definitely smash him till he died and then jump off a cliff on account that they were fellow disciples.</p><br/><p>If he fell into the hands of the West-Hill Divine Palace, he would be strapped onto the executioner board and burnt to crisps. If he landed into the hands of the Buddhism Sect, would they shave his head and let him recite chants for the rest of his life in the Xuankong Temple?</p><br/><p>If that was the case, the best outcome was to become a monk?</p><br/><p>Ning Que rested against the sideboard of his bed as he thought about all these, his shirt was drenched in his cold sweat and his face was getting increasingly pale. He couldn't imagine what the world would face, if he was really the Son of Yama. At that time, the entire world would abandon him and leave him to wander alone, living his life in hiding, like rats hiding from the Divine Light of Haotian.</p><br/><p>At this moment, Sangsang moved in his embrace, slightly knitting her brows, almost as if she was dreaming about something bad or she was feeling Ning Que's emotions now.</p><br/><p>Ning Que looked at her slightly tanned face as he calmed down. This was because whether he was a traitor or the Son of Yama, he had a handmaiden that would never leave him behind. Even if he was left to roam again, he wouldn't be alone, it would be the two of them. This was better.</p><br/><p>He lightly kissed her on her brows, wanting to ease them.</p><br/><p>However, she seemed to become even more uncomfortable as her brows became tighter.</p><br/><p>Ning Que felt that something was wrong.</p><br/><p>Sangsang's face got paler and peeking out from the darkness, her snow-white face left one worried. Her knitted eyebrows made her seem incredible in pain and her body got cooler.</p><br/><p>Ning Que was shocked as he hurriedly tried to wake her.</p><br/><p>Sangsang pried open her eyes with difficulty, looking especially weak. A bone-chilling chill escaped from her clothes and it left Ning Que shuddering.</p><br/><p>She shivered in pain as she grabbed onto his clothes, wanting to say something, but nothing came out.</p><br/><p>Ning Que didn't dare delay as he got up and whistled loudly. He grabbed the thick blanket on the bed and wrapped it around her body, then he wrapped her up in his arms and rushed out.</p><br/><p>He kicked open the wooden door of the Old Brush Pen Shop and ran to Lin 47th Street.</p><br/><p>It was just before dawn.</p><br/><p>Ning Que shouted angrily while looking at the alley, \"You pig! Why are you so slow?\"</p><br/><p>The Big Black Horse was awakened abruptly by the whistle and was just about to show its disapproval when it saw Ning Que's green face and knew something big had happened. Ning Que felt horrible now and it knew he could kill it at any moment. It quickly kicked its four hooves and dragged the horse carriage in front of the Old Brush Pen Shop.</p><br/><p>Ning Que hopped onto the carriage and panted while saying, \"To the Academy.\"</p><br/>\n</div>"}