{"title": "Chapter 514: The Family Cui's Interesting Reaction", "id": 514, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-514-the-family-cuis-interesting-reaction", "volume_title": "Volume 6", "body": "<h1>Chapter 514: The Family Cui's Interesting Reaction</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 514: The Family Cui's Interesting Reaction</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The word \"idea\" was widely used, sometimes on the little thoughts between men and women. When Ning Que left the City of Wei for Chang'an, he traveled with Li Yu, who pretended to be a maidservant. They went through difficult times together at the entrance of the Northern Mountain Road. They also told stories by the bonfire. If one delved deeply into their hearts, one could not say whether they had any budding interest in each other. But even if there was any, the interest had dispelled in the patch of sunlight when Li Yu left his shoulder slowly and stood up.</p><br/><p>There were no romantic feelings between the two, but they had friendship and they maintained it even over the years in Chang'an. Since Ning Que knew that Li Yu had vested interest in Qinghe County, he did not make things difficult for them. He wrote a letter to the Family Cui by the Fuchun River and brought Sangsang to an inn. They sat down and admired the scenery while drinking wine as if they did not know what was going on in Yangguan City.</p><br/><p>The simple letter was to sound out their intent, with Ning Que's somewhat impure ideas mixed in. He wondered why the millennia-old family from Qinghe county was making things difficult for the House of Red Sleeves. Were they trying to butter up to Li Yu and the Academy or to prove their loyalty by disrespecting the Empress? Many thoughts ran through his mind...</p><br/><p>Just like what the manager had said, it was alright if it was the former. But if the Qinghe clans were planning something complex that Ning Que could not understand, he might start thinking towards the bad side. He represented the Academy by entering the human realm and his ideas were very important to the Tang Empire.</p><br/><p>Autumn had begun in the Song Mansion's courtyard by the slender lake. The gardens were verdant and it was the most beautiful season. However, the atmosphere in the courtyard was depressive. The ladies of the House of Red Sleeves leaned against the railings or sat quietly behind the table. Their beautiful faces were marred by worry and they were in no mood to admire the beautiful scenery at all.</p><br/><p>The ladies of the House of Red Sleeves were not all prostitutes. However, no matter whether they sang, danced or did other things, they all socialized aplenty; all were good judges of character and had good instincts. They knew that they had been well treated by the officials and nobles in Chang'an because of Mistress Jian's close relationship with those in the palace. Even court officials had to lower themselves in Qinghe County, so would they. Now that they had met these Dominant Families who were not afraid of Her Majesty, they ran into serious trouble.</p><br/><p>They were all aware of what the problem was, but could not find a solution to it. Even though the House of Red Sleeves were visiting the Lanke Temple on the imperial court's orders, they were not a diplomatic delegation. They would not expect the Dominant Families to help them. As for the Defender General of the West, Xian Zhilang, he was currently in the Cui's gardens. Could they even depend on him?</p><br/><p>The girls grew more frightened as they thought of the Cui's steward's ice cold face when he left. Two or three of them looked at the girl sitting at the head of the table hatefully. They thought that the girl had offended the families of Qinghe County because she had treated the Cui's steward badly. Even though she was doted upon by Mistress Jian, they were not in Chang'an now. What right did she have to be so arrogant?</p><br/><p>The girl was Mistress Jian's personal handmaiden, Xiaocao. She led the girls on their visit to the Lanke Temple and it was evident that Mistress Jian had begun training her successor.</p><br/><p>As compared to three years ago, Xiaocao had grown up, but still looked as beautiful as before. However, beneath the looming dark clouds of the situation, the girl's clear eyes were devoid of any traces of uneasiness. She seemed especially cold as she looked at the girls with slightly furrowed brows. She said, \"Nothing has happened yet. What's wrong with you all?\"</p><br/><p>In the brothel, Mistress Jian's status was akin to that of the Emperor's and Xiaocao was her successor. Even though the girls could not help scolding her in their hearts and showing their dissatisfaction, they did not dare to speak of it directly. A gentle lady looked at the expressions on her companion's face and smiled. She walked toward Xiaocao and said gently in a coaxing manner, \"The Cuis might have deliberately made things difficult for us, but your attitude was a little harsh this morning.\"</p><br/><p>Xiaocao sneered and said, \"The House of Red Sleeves performs only for the Emperor and Empress. How could the old man Cui compare to His and Her Majesty? We have already shown our respects for the old man by coming. How dare they try to make things difficult for us? The steward even tried to threaten us. Did they really think we come from an ordinary brothel?\"</p><br/><p>The girls looked at each other when they heard that. They felt that Xiaocao did somewhat have the imposing manner that Mistress Jian had. However, in the face of the Dominant Families of Qinghe County, the House of Red Sleeves was no different from an ordinary brothel. Xiaocao's attitude would only cause her more shame when the Cui's exerted more pressure on them.</p><br/><p>Xiaocao knew what they were thinking and could not be bothered to explain. She took out a bag of sunflower seeds from her sleeves and began nibbling on them. She knew that even if the Defender General of the West didn't say anything in their defense, someone else would. Of course, the girl did not feel as calm as she looked because she was not sure whether the person was in Yangguan.</p><br/><p>The warm breeze came blowing from the slender lake and into the courtyard. All were silent and only the sound of eating seeds could be heard. Someone suddenly reported that the Cuis had sent someone forth again. When they heard that, the girls who had only just managed to sit down calmly stood up in shock again. They wondered why the Cuis had come so quickly and felt that they had really irritated them. What should they do?</p><br/><p>Xiaocao was surprised and she slowly put the sunflower seeds in her hand back into the bag.</p><br/><p>The fourth steward of the Cui clan had come to the lake once again. If they counted, this would be the third time he paid a visit here in an entire day. There were not many things that would make the fourth steward of the Cui Clan visit three times. Those who could \"enjoy\" such treatment were either elites, or trouble recipients.</p><br/><p>However, the House of Red Sleeves was destined not to encounter any trouble today.</p><br/><p>Because the fourth steward of the Family Cui was carried into the Song Garden on a stretcher.</p><br/><p>The girls from the House of Red Sleeves looked at the middle-aged man on the stretcher. He looked like he was on the brink of death. His clothes were spotted with blood. The girls covered their mouths in shock and they could not reconcile this man with the calm, gentle, yet forceful steward who had visited last night and this morning.</p><br/><p>Xiaocao was also shocked. She stood up and looked at the white-haired old man beside the stretcher.</p><br/><p>The old man bowed to Xiaocao. He said, \"I am the chief steward of the Family Cui. I heard that my subordinate had been impolite to you ladies and have brought him here to apologize. This servant pointed at you ladies, so my master broke all five of his fingers and gave him 12 strokes of the cane. I wonder if you are satisfied?\"</p><br/><p>Xiaocao realized then, that person was indeed in Yangguan City. The anxiety that she had tried hard to tamper down earlier disappeared. She looked at the fourth steward who was covered in blood and forced herself not to fist up her hands but rested them naturally beside her skirt.</p><br/><p>The chief steward of the Family Cui apologized respectfully once more after he received a satisfactory reply from the House of Red Sleeves. Then, he left the Song Garden with his people.</p><br/><p>Other than the drops of blood left on the green-tiled ground, it seemed as if nothing had happened, and the shadow cast by the gate in the early morning and yesterday was just an illusion.</p><br/><p>The girls were finally released from all their fears after a long while. They looked at Xiaocao again, this time, with a completely different emotion. Xiaocao's calmness and coldness grew in depth to them, and they felt that she was truly an imposing figure.</p><br/><p>Xiaocao suddenly smiled, and then, she continued eating sunflower seeds.</p><br/><p>The girls waved away their servants and poured Xiaocao a cup of tea on their own. They stood by her side with large smiles on their faces.</p><br/><p>After some time, Xiaocao cleaned the crumbs on her hands and took a sip of tea. She looked at them and said, \"No one dared to make trouble for us in Chang'an. Now that we have left Chang'an, you don't need to fear anything. The House of Red Sleeves isn't an ordinary dance troupe.\"</p><br/><p>The fourth steward of the Family Cui had almost been beaten to death. He was carried out of the Song Garden and was showed around Yangguan City on the stretcher, which shocked many and roused the discussion and speculations of many. The families of Yangguan City could all tell that this was deliberate, and they were stunned speechless. They wondered what kind of background the House of Red Sleeves who were staying at the Song Garden had, for the Family Cui to behave like this. The Family Cui was not an ordinary noble family. They were the Family Cui of Qinghe County who did not fear the Empress!</p><br/><p>Following that, something even more shocking happened in Yangguan City. A wood colored horse carriage entered the city, with its wheels stained with red river mud from the banks of the Fuchun River. This horse carriage looked cheap, but the bustle of Chang'an ceased when it passed. There were many local government runners and stewards who stood on the streets to maintain order and several shopkeepers knelt before the horse carriage.</p><br/><p>Everyone in Yangguan City knew that only two people had the right to sit in this horse carriage in Yangguan City. They were the Family Cui's leader and the Cui's patriarch.</p><br/><p>The street in front of the best inn of the Thin Lake has been closed in advance. There were no pedestrians on the streets and it was very quiet. The horse carriage drove slowly to the inn. The inn's manager had been waiting by the streets for a long while. He knelt by the carriage and kowtowed respectfully several times. Then, he carefully helped the rich man from the carriage.</p><br/><p>The man was the manager of the inn, but he did not have the right to enter his own inn today.</p><br/><p>There was an ordinary hunchbacked steward who followed the clan leader of the Family Cui into the inn.</p><br/><p>The Cui clan was the most powerful clan in Qinghe County. The Family Cui's leader was the most powerful man in the county. To many civilians of the Tang empire, the most powerful man of Qinghe County was the second most powerful man of the Tang Empire. Other than His Majesty who resided in Chang'an, no one could surpass this man in status.</p><br/><p>Anyone would leave their room to greet such an important man. However, Ning Que did not do so. In fact, he did not even have a smile on his face.</p><br/><p>Because he felt that someone who was deemed the most powerful man of Qinghe County would not be any less intelligent than himself. Since they were both intelligent people, what was the point of doing fake and pointless things?</p><br/><p>The leader of the Family Cui looked like a common wealthy man. In fact, he looked even more ordinary than the old steward behind him. He wore a silk shirt that did not look extremely good, but was not at a bad make either.</p><br/><p>However, his words were extraordinary.</p><br/><p>\"I was wrong.\"</p><br/><p>The Cui's clan leader sighed, \"Back then, in the imperial court, I wanted to make His Majesty happy, but I caused him unhappiness and was booted back to Qinghe as a result. I found that you were passing by Yangguan and I wanted to prove that I not only was able to manage schools, states and the country, I could also be a good host. So I tried to make you happy to regain my reputation. However, I have failed and it seems that I was really wrong. I am not talented in this area.\"</p><br/>\n</div>"}