{"title": "Chapter 518: Is This An Illness?", "id": 518, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-518-is-this-an-illness", "volume_title": "Volume 6", "body": "<h1>Chapter 518: Is This An Illness?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 518: Is This An Illness?</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The first time they met, Family Cui sent 500,000 taels of silver. The Family Cui was really generous. The number was so large that it was hard to imagine. Such a large amount of taels of silver was enough to do too many things in the world.</p><br/><p>Sangsang did not know why the Family Cui had sent so much money, but it was clear that if Ning Que took the money, it would cause great trouble. However, she did not even think about it and decided to accept the money.</p><br/><p>This note was worth 500,000 taels of silver. She had never seen so much money in her life.</p><br/><p>Refuse it? We would be punished by God to death like Mr. Ke.</p><br/><p>Ning Que read the letter and knew what Family Cui meant. He explained and said, \"Your father's original wife was the cousin of Cui Shi. Now she is in Qinghe County. This is the woman who sent you out of the Zeng Family Mansion to get you killed when you were an infant. Family Cui gave these taels of silver to you. The aim is to make you forgive that woman, or at least not hate the Family Cui. So these taels of silver are not ours, but yours.\"</p><br/><p>Sangsang stiffened slightly, and said, \"This is worth 500,000 taels of silver?\"</p><br/><p>Ning Que said, \"If you were just the daughter of the Grand Secretary, Zeng Jing, 500,000 taels of silver would naturally be a little too much, but now you are the inheritor of the Divine Priest of Light. If you remember these old things someday, even the Dominant families in Qinghe County will not want to risk incurring the anger of Great Divine Priest of West-Hill.\"</p><br/><p>Understanding the reason behind this thin silver tael note, Sangsang became a little hesitant. She looked at Ning Que, and asked seriously, \"What is your opinion? Should I accept it?\"</p><br/><p>Ning Que said, \"It depends on whether you want to forgive them.\"</p><br/><p>Sangsang said, \"Certainly, I won't forgive her, but I don't want to take revenge either.\"</p><br/><p>Ning Que was surprised and asked, \"Why?\"</p><br/><p>Sangsang said, \"Because if it was not that woman, I would not have been found by you.\"</p><br/><p>Ning Que laughed and said, \"Since that is the reason, then take the banknote and let the Family Cui feel at ease.\"</p><br/><p>Sangsang felt worried and said, \"Will it cause any trouble?\"</p><br/><p>Ning Que said, \"What trouble can there be?\"</p><br/><p>Sangsang said, \"Isn't it said that taking money from others means giving your weakness to others and being obedient to others?\"</p><br/><p>Ning Que raised his right hand, and said, \"I won't follow their order... These taels of silver are just to appease you. If these Dominant Families in Qinghe County really want to use this to buy me off and force me to do something, will I have to do it?\"</p><br/><p>Sangsang said with concern, \"It is not appropriate to take their money but not do things?\"</p><br/><p>Ning Que looked at her and asked, \"Which is more important? The taels of silver or credit?\"</p><br/><p>After thinking about it, Sangsang said, \"It depends on the amount of money.\"</p><br/><p>Ning Que gently waved the thin banknote in his hand.</p><br/><p>Sangsang looked at the banknote between his fingers and said without any hesitation, \"This is more important.\"</p><br/><p>Then she sobered up, and asked awkwardly, \"Is loving money this much an illness?\"</p><br/><p>Ning Que said, \"Loving money is not an illness, because a lack of money is deadly.\"</p><br/><p>In fact, there was no need for any reason at all. It was impossible for him or Sangsang to send back the 500,000 note that had already been given to them. Even if he would be involved in something more troublesome than Qinghe County, or even if he would need to give up his credit or reputation. That was because they really suffered so much due to the lack of money since they were children. The desire or greed for money had already become an inseparable instinct.</p><br/><p>If this was an illness, then they certainly did not want to cure it.</p><br/><p>The difficult childhood gave Ning Que and Sangsang some instinctive habits. Other than loving money, being sensitive to danger, foreseeing trouble in advance and fleeing like rabbits, and staying away from any trouble were also several very distinct ones.</p><br/><p>Therefore, in the following days, the warship slowly moved southward on the surface of Great Lake. Ning Que had never left the cabin. Xian Zhilang invited him to his warship several times, and Ning Que gently but firmly rejected.</p><br/><p>Xian Zhilang was a sophisticated person. Therefore, in the conversation that day, he told Ning Que his stance and idea so simply, which showed that he was even more sophisticated. Ning Que did not want to talk more with this person, because he did not want to participate in the major event of the succession of Tang Empire.</p><br/><p>He was qualified to express his opinion on the succession of the Tang Empire since he had entered the human realm on behalf of the Academy. However, he did not have any opinion. His only opinion was that now that His Majesty was wise, whoever His Majesty chose should be the one who would succeed.</p><br/><p>As for whether the Academy should play a role in it, or whether it needed to obtain some benefits from it— the Academy did not need it at all— and whoever became the Emperor of Tang Empire in the future, he must maintain a respectful attitude towards the Academy.</p><br/><p>Besides, Ning Que really didn't care which Prince would sit on that dragon throne in the future.</p><br/><p>Headmaster's core disciples, who were on the Second floor, naturally had a higher position and better view than the people on the ground. They could completely ignore the matters of the world.</p><br/><p>The things that Ning Que was concerned now, were gradually exceeding the scope of the mortal world and inching into the field of supermundane. It was something that was not known to the world but would affect the entire world.</p><br/><p>Such as the Underworld Invasion.</p><br/><p>Such as the rumors that he was the Son of Yama.</p><br/><p>Such as Sangsang's illness.</p><br/><p>It was already autumn. The autumn wind, which should be clear and slightly dry, was wet due to the water of the Great Lake. When it came in through the window, it made people feel fresh.</p><br/><p>Ning Que looked at the line-like cursive writing on the Fu paper which came into shape. He used his accurate eyesight to confirm that the black gold powder mixed in talisman ink was distributed evenly throughout these lines. He put the pen on ink-slab and turned around to look at the lake outside the window. He was silent and thinking about something.</p><br/><p>The more he thought about unknown things, the more vigilant he was. He always felt that something was happening and those things seemed to be related to himself and the Academy.</p><br/><p>As the words \"in the unseen world\" were so ambiguous, he thought about Underworld Invasion once again.</p><br/><p>Headmaster did not find the passage of Light of Buddha suppressing the Underworld in Lanke Temple. Ning Que thought he was less likely to find it, but what if he really was the Son of Yama?</p><br/><p>Rumors about Ning Que's identity had spread around the world. He did not know what the Bhadantas of Buddhist who once wanted to kill him would do now. He did not know what was waiting for him in Lanke Temple. The ship was swaying on the lake's surface and he was getting closer and closer to the Lanke Temple, and he became more and more silent.</p><br/><p>If he followed his instinct, because of the alerts and omens in his mind, Ning Que would not hesitate to take Sangsang with him and return to Chang'an as quickly as possible and interrupt their journey.</p><br/><p>But he did not do so. Instead, he asked the fleet to speed up.</p><br/><p>Because of the sudden spike in Sangsang's illness.</p><br/><p>...</p><br/><p>...</p><br/><p>When they left Chang'an City, the Sangsang's coldness seemed to have healed. They walked south with the sunlight, and she seemed to be entirely cured. When she got on the ship, Ning Que was surprised to feel that the little feet, which he held in his arms every night, became colder and colder.</p><br/><p>What disturbed him even more was that the sun-bathing and cultivation of Divine Skill seemed to be unable to suppress the chilly Qi in Sangsang's body.</p><br/><p>Sangsang did not feel the physical change of her body, or perhaps she felt it but was worried that Ning Que would worry, so she did not say anything and did the same things as usual.</p><br/><p>Ning Que worried that she would worry, so he did not say anything to her either. He began to pay attention to whether the alcohol bag was full or not. He quietly untied his clothes every night and put Sangsang's cold feet in the warmest place on his body. Then he began to think about what Headmaster said before he left.</p><br/><p>He now understood why Headmaster wanted him to take Sangsang to Lanke Temple. It seemed that only the elders of the Buddhism Sect, who lived in seclusion, could cure Sangsang.</p><br/><p>Just as he understood, he also didn't understand... He couldn't understand why the West-Hill Divine Palace and even the Academy could not cure Sangsang's illness.</p><br/><p>Was an illness, that could not be cured by Headmaster, still an illness?</p><br/><p>Since he could not understand, Ning Que did not think about it any further. Anyway, no matter what the process of this matter was, the final result was already predestined— he must cure Sangsang's illness. Then he must go to Lanke Temple to face the anger, or mercy, of Buddhism Sect, and to even face the moment when his identity of Son of Yama was confirmed.</p><br/><p>They traveled through the Great Lake, and faced the lake wind. There were the white stars on the water, and gulls flew over occasionally.</p><br/><p>Under the dual pressure of the vigilance against unknown things and the worry of Sangsang's worsening health. Ning Que cultivated quietly. He kept writing talismans every day, meditating, and constantly cultivating the Great Spirit.</p><br/><p>On the lake, the vague threshold of Haotian Taoism seemed to be getting closer and clearer.</p><br/><p>What people had to do in the world often meant gaining an opportunity for a breakthrough.</p><br/><p>For Ning Que, there were only a few things in the world that had to be done, such as the safety of Sangsang.</p><br/><p>At Daming Lake in the Wilderness, Long Qing used Sangsang to threaten him. He broke the realm into the Seethrough state, and then shot Long Qing, who was about to enter the Knowing Destiny State, and crippled him. Now, on the Great Lake in autumn, he once again encountered an opportunity to break the realm into the Knowing Destiny State, but this time, even Ning Que himself did not notice.</p><br/><p>As the saying goes that chaos of the country builds the loyal defender and sorrow builds the poet.</p><br/><p>Sangsang could make Ning Que improve his state.</p><br/><p>...</p><br/><p>In the West-Hill Mountains, which were far away from Great Lake, the Prince Long Qing was also waiting for his own opportunity. He did not know whether the opportunity would arise or when the opportunity would arise, but he believed that the abbey dean saved him from being a living corpse at a town near the South Sea, and sent him to Zhishou Abbey, which was the holy land for all the cultivators in the world, to cultivate. This was already a great opportunity for him.</p><br/><p>Coming to Zhishou Abbey had let him see the possibility of becoming a powerful man again, and let him vaguely find a chance for success. It let him regain his desire like a fire. He thought this was an opportunity, because these were his ideas, and all of his thoughts were the will of Haotian.</p><br/><p>However, there was always a gap between reality and dreams, just as what he saw when he was collecting fish at the fishing port of the South Sea. There were wooden boards between the boats and the dock. It looked like he could get on the ship just by crossing the boards. However, the boards were covered with slippery fish scales and sticky organs. It was easy to slip, and fall into the sea.</p><br/><p>Long Qing wiped away the blood at the corners of his mouth, and knew that one more of his ribs had been broken. He looked at the screaming old Taoist who only had half his body left lying on the snow couch. It seemed as if he would be able to kill the terrifying old Taoist any second, and he felt bitter and confused.</p><br/><p>How long would his servant life continue, and where was the opportunity?</p><br/>\n</div>"}