{"title": "Chapter 521: Heaven's Orders and Darkness", "id": 521, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-521-heavens-orders-and-darkness", "volume_title": "Volume 6", "body": "<h1>Chapter 521: Heaven's Orders and Darkness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 521: Heaven's Orders and Darkness</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The Halfman Taoist appeared shocked and incredulous when he did not receive any response. He bellowed angrily, \"How dare you!\"</p><br/><p>Long Qing still did not reply.</p><br/><p>A newborn beast might be weak, but its yearning for milk and the vitality it had were at their peak.</p><br/><p>Long Qing was such a beast. He shut his eyes, intoxicated and serene. He greedily sucked in everything that he could, thirstily and innocently.</p><br/><p>The peach blossom on his shirt grew darker and darker as his chest seemed to grow so deep; one could not see its bottom. It was a dark abyss, absorbing the aura from the old taoist priest's palm.</p><br/><p>The old taoist priest withered. His body shrunk until it began to hunch over. He had pinned all his hopes and dreams on Long Qing, who stood before him, that he was even willing to give Long Qing half of his cultivation power. However, he then realized that something was wrong, and began to feel an immense fear.</p><br/><p>He was the Halfman Taoist. He could survive even if he lost half his cultivation. However, would the greedy Long Qing stop? If this situation continued, he would not last long even if he had once been a powerhouse in the Tianqi State who had crossed the Five States. He would die.</p><br/><p>Continuing with life after having one's waist cut was like living in a dark hole as a rat. It was a terrifying form of mental torture. However, standing before the doors of death, no one would truly believe that dying was better than being alive. The Halfman Taoist thought the same. He had managed to survive, through many difficulties, after Ke Haoran had cut his waist. Decades later, he would certainly be unwilling to die just like that.</p><br/><p>\"You're too greedy!\"</p><br/><p>The Halfman Taoist could feel his Psyche Power flowing out of his body in waves. His eyes were filled with an uncontrollable fury as a large wave of aura left his body. His withered hand, which was spread across Long Qing's left chest became a large mountain and pressed down forcefully.</p><br/><p>There were several loud cracks as five of Long Qing's ribs broke. Blood spilled from his mouth in a spray, soaking the black peach blossom on his chest. Then, he regained consciousness.</p><br/><p>Long Qing slowly raised his head and looked at the old Taoist in front of him. He said, \"Since we've gotten to this point, why did you stop it? I have already absorbed so much, why can't you give me more?\"</p><br/><p>The Halfman Taoist knew that Long Qing had already emerged from his instinctual madness. However, he had not expected that he would say that and could not help but grow furious.</p><br/><p>However, his anger had no chance to erupt since it was quickly shadowed by fear and loss.</p><br/><p>He had cracked Long Qing's ribs with his hand. However, he found that he was not able to move his hand away from Long Qing's chest. It was slick with blood and was deeply entrenched in Long Qing's chest hole.</p><br/><p>There was a hole in Long Qing's chest.</p><br/><p>The Halfman Taoist's palm had entered the hole through Long Qing's taoist robes, sinking in until it reached his forearm.</p><br/><p>There was a black peach blossom above it that was soaked in blood.</p><br/><p>The Halfman Taoist wanted to wrench his arm out but could not do so.</p><br/><p>He could clearly feel his palm and forearm touching slick, sticky soft organs. The writhing flesh seemed as if it were about to come alive and was terrifying.</p><br/><p>The hole in Long Qing's body was like a quagmire with boundless depths of peat. The peat was extremely thick, and at the very bottom of the quagmire, was a dark, endless abyss.</p><br/><p>The Halfman Taoist felt as if he were struggling in the quagmire. Miasma poured into his pores as icy cold, smelly, black silt began to bury him under.</p><br/><p>After a moment, his body would be completely swallowed by the dark quagmire. Although his weightless spirit could penetrate through the peat, it would enter the endless abyss, enduring millennia of solitude.</p><br/><p>That was death.</p><br/><p>...</p><br/><p>...</p><br/><p>The Halfman Taoist became so hunched that the naked eye could perceive that his body had shrunk significantly. His body began to tremble uncontrollably. He looked at Long Qing with eyes filled with panic, anger and sadness. He did not know what was happening and why he could not stop that useless person from taking everything he had from him.</p><br/><p>Then, he saw Long Qing's eyes.</p><br/><p>They were a pair of serene eyes that were devoid of greed or thirst. In fact, they were devoid of any emotion. They were like trees waving in the gentle wind or lake water rolling in the wind. They were calm because it was natural and right for them to be so. And it was this calmness that easily evoked fear in others.</p><br/><p>These eyes were no longer clearly separated into black and white. They were also no longer completely grey. His black pupils were dark and they grew darker and smaller, encompassing the calmness in him. It looked as if a monster from the Underworld was climbing up from the abyss, quietly peering out at this world.</p><br/><p>The Halfman Taoist suddenly thought of how he had described his seeing the face of Haotian to Long Qing. Then, he understood something and grew more fearful.</p><br/><p>The old taoist priest had shrunk more as Long Qing absorbed more of his aura through his Gray Eye Method. As the Taoist's face shrunk, the distance between his eyes grew. He looked like an idiot spacing out beneath a tree.</p><br/><p>He looked at Long Qing's emotionless, unseeing eyes that were serene and terrifying. He mumbled in a trembling voice, \"How did this happen? Why would Haotian allow you to cross the line?\"</p><br/><p>Long Qing looked at him and said placidly, \"You have said, that to erase the will of Haotian, we would need to be faithless and disregard rules. If so, why are there still lines? But you were wrong. There is no one in the world who could truly disregard rules. That is because the rules are governed by Haotian. That is why Ke Haoran was punished with death back then. To truly disregard rules, we should not erase the will of Haotian, but instill our will upon Haotian's will. We should become Haotian's will.\"</p><br/><p>The Halfman Taoist could not stop trembling as blood continued to flow out from his waist. He shrilly bellowed in fear, \"Even so, why would Haotian choose someone as useless as you?!\"</p><br/><p>\"Can we mortals really speculate about Haotian's will?\"</p><br/><p>Long Qing looked at him, devoid of emotions, and said, \"All we have to do is accept it and even give praise. A moment ago, I wanted more of you. In fact, I wanted all of you, and Haotian felt my desire. That is why you have to offer all of yourself to me.\"</p><br/><p>The Halfman Taoist said shrilly, \"I don't want to.\"</p><br/><p>Long Qing said, \"You cannot stop me, because I am acting on Haotian's orders.\"</p><br/><p>\"But I will die.\"</p><br/><p>The Halfman Taoist yelled hysterically as he cried and pleaded.</p><br/><p>Long Qing said, \"For decades, you have lived a life that was worse than death. Dying at my hands would mean freedom. You would die a worthy death, offering yourself to me.\"</p><br/><p>The Halfman Taoist had already shrunk significantly. He looked like a child. However, he did not become younger. The wrinkles on his face were even deeper than before.</p><br/><p>He knew that he was about to die.</p><br/><p>He knew that he could not escape this bog.</p><br/><p>He had even guessed that these were really Haotian's orders.</p><br/><p>However, he was still unresigned.</p><br/><p>He yelled painfully and clawed at Long Qing with his free hand. He wanted to tear at Long Qing's mouth and dig into his eyes. However, the arm that had sunk in Long Qing's chest had remained normal, while his free hand had shortened. It was not long enough to reach Long Qing as it hung in the air, trembling uselessly. He looked like a child whose candy had been taken away, looking exceptionally pathetic and hopeless.</p><br/><p>\"These are really Haotian's orders.\"</p><br/><p>Long Qing comforted him, \"You knew that I was a cruel, vicious person. You knew that I would trick you and steal all your power. Why else would you be so stupid to be willing to give me half of your power? So die in peace.\"</p><br/><p>Halfman Taoist's hand that was waving in the air stiffened. After a moment he dropped his hand, panting painfully and heavily with his head lowered. He said, \"That's right... I knew... you were a bad person... why did I allow you to trick me... Perhaps... I have long wanted to die... I was just looking for a successor to help me finish my desires.\"</p><br/><p>He lifted his head. His skull had shrunk a lot and his eyes were significantly bigger in comparison. His eyes looked as if they were about to shift to the two sides of his face and looked exceptionally terrifying. However, the bitterness, anger and fear in his eyes had disappeared, leaving only brightness behind. This light was the freedom he had attained from gaining enlightenment.</p><br/><p>He looked at Long Qing and panted excitedly, \"Help me to kill everyone in the Academy. And then, have the millions of believers in Haotian remember my name. I am He...\"</p><br/><p>\"I will kill everyone in the Academy, and I will destroy the Tang Empire.\"</p><br/><p>Long Qing said serenely, without waiting for the Taoist to complete his sentence. He said, \"But who you are has nothing to do with me. You have piled too much shame and pain on me. This is your punishment.\"</p><br/><p>The Halfman Taoist became suddenly still and then laughed out loud. However, his cultivation power was mostly lost now, and his laughter was exceptionally hoarse. He said, \"You are indeed a viciously cruel person. Alright. No matter where you will go in the future, it is my cultivation power that has given you a new life. It doesn't matter whether the world knows my name. When you traverse the world, you are radiating my light.\"</p><br/><p>Long Qing smiled and said, \"Indeed.\"</p><br/><p>The Halfman Taoist did not say anything else and calmly waited for death. However, he suddenly widened his already half-closed eyes and looked at Long Qing. He said, \"Death is approaching. I do not know if I will fall into the Underworld or return to Haotian's Divine Light. But I want to tell you that I am still afraid of death because one's end will always be sad.\"</p><br/><p>Long Qing listened quietly because he knew that the old taoist priest's parting words would definitely be meaningful.</p><br/><p>\"I fear death. They will fear it too.\" The Halfman Taoist said.</p><br/><p>Long Qing knew that he was referring to the other old taoist priests in the cave.</p><br/><p>The Halfman Taoist raised his head with difficulty and looked around the dark cave. He looked at the rays of powerful aura and said sarcastically, \"They are watching you suck me dry. They can feel my fear of death. So they will not give you their cultivation power like I did. However, just like I couldn't withstand your seduction, they can't either. If they want to live, they will not allow you to. They will definitely kill you unless you leave.\"</p><br/><p>After a moment of silence, Long Qing said, \"Even though it's a pity, I understand.\"</p><br/><p>The Halfman Taoist looked at him quietly and benevolently said, \"Then flee.\"</p><br/><p>With that, he shut his eyes and fell dead onto the snow white couch.</p><br/><p>The dozens of powerful aura rays suddenly rose. It was terrifying. In a moment, they shattered all the luminous pearls on the walls and rushed toward Long Qing's body.</p><br/><p>Long Qing yelled out loud and his face paled. He fell to his knees and trembled like a leaf. He rushed through the only exit through the aura rays and drifted out of the cave.</p><br/><p>He fled from the cave. He leapt off the cliff walls and ran toward the Zhishou Abbey in the distance without a second thought.</p><br/><p>The rays were filled with unknown fear, violence and angry flames. They brought with them unthinkable power and burst out from the numerous holes in the cave.</p><br/><p>The vines on the mountain's surface tore and shot toward the sky like arrows.</p><br/><p>The earth shook threateningly and the world seemed as if it was nearing destruction.</p><br/><p>...</p><br/><p>...</p><br/>\n</div>"}