{"title": "Chapter 524: Can't Leave the Green Hill", "id": 524, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-524-cant-leave-the-green-hill", "volume_title": "Volume 6", "body": "<h1>Chapter 524: Can't Leave the Green Hill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 524: Can't Leave the Green Hill</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>Long Qing felt that there hadn't been any problems with his decision or response. He had completely grasped the... unique traits in human nature. He had forgotten an important point, however, and it was that the trait was common throughout all of mankind. As such, this trait had been recorded in history books many times. In other words, his response might have seemed wise, but was just wisdom that he had picked up from earlier generations. He was just walking down the path of others.</p><br/><p>Long Qing still did not know the middle-aged Taoist's name up till now. After the Taoist in indigo had been sent to the Southern sea by the Headmaster with a wooden rod, he had vowed to watch over Long Qing who was in the Zhishou Abbey. This naturally meant that the Taoist was both wise and knowledgeable. To him, Long Qing's response was filled with the aura of stale wisdom that he hated and could not accept.</p><br/><p>It was unacceptable, so he would try his best to repress it. He did not hesitate to slap Long Qing's head, ignoring the precious Heavenly Power Pill that Long Qing had just consumed. He ignored what Long Qing meant to Haotian Taoism, but was determined to maintain the laws of their sect.</p><br/><p>It was regrettable to the people, to the world, and especially to Ning Que in the future that the middle-aged man's slap did not kill Long Qing. Instead, it was deflected by a faint aura surrounding Long Qing's body.</p><br/><p>Long Qing, who was close to insanity, was no longer bound by any moral rules. As such, he could commit many things that were thought to be immoral. However, Haotian's world was still ruled by laws. His ability to survive was thanks to the law of force and reaction.</p><br/><p>The middle-aged Taoist's understated slap landed on Long Qing's head and shook the Taoist so much that his teeth rattled loose and his features paled. However, it did not break the thin layer of aura surrounding Long Qing. The immense force was deflected by the aura, causing the Taoist's hand to bounce up high in the air.</p><br/><p>There was a loud boom and a large hole appeared in the hard meadow grounds beneath Long Qing's feet. His trousers flew apart like butterflies. There was a sharp pain in his bones, it seemed his legs were broken.</p><br/><p>Dust filled the air. Long Qing, who had been hit, was like a rubber ball that had been bounced viciously on the ground. He hung in the air for a moment before springing into the air at a terrifying speed!</p><br/><p>The winds started to howl.</p><br/><p>Long Qing shot high up in the air. He was at a loss and did not know what to do. He felt the autumn wind grazing his face as he watched the clouds appeared closer and closer. He thought of the floating feeling he had after consuming the Heavenly Power Pill and could not help but think if he was really ascending to heaven and becoming immortal at this moment. Was he about to leave the terrible mortal world?</p><br/><p>A single Heavenly Power Pill could not allow a mortal become immortal.</p><br/><p>As long as he was not an immortal, he would have to fall no matter how high he flew.</p><br/><p>Long Qing bounced off the ground and began flying. He did not know if he was tens or hundreds of feet above the ground. Just as he felt as if he could touch the passing clouds in the cerulean sky, he began to make his descent.</p><br/><p>Other than those who could return to Haotian's divine land, most people would end up returning to the ground. The ground held an immense power over humans.</p><br/><p>It was that power that made Long Qing fall, and it made his descent faster and faster.</p><br/><p>He left the clouds and fell through the autumn wind. He looked at the middle-aged Taoist and flew over the meadows. He landed on the cliff behind the meadow, plunging through the thick clouds and into the deep valley.</p><br/><p>Even a powerhouse in the Knowing destiny State would be crushed after falling from such a high place. Furthermore, there were unknown dangers in the deep valley.</p><br/><p>Long Qing brought the Tomes of Arcane with him as he fell into the deep abyss.</p><br/><p>The middle-aged Taoist walked to the edge of the cliff and looked at the clouds that looked like a disturbed lake after a rock was tossed into it. He stayed silent, no one could not guess what he was thinking of.</p><br/><p>No one knew whether Long Qing was dead or alive.</p><br/><p>He might still be alive, but he was most probably dead.</p><br/><p>Who would know?</p><br/><p>The middle-aged Taoist looked at the human-shaped hole in the clouds that was closing up. He thought to himself, that if Long Qing did not die even from this, then he was probably the legendary figure in the prophecy.</p><br/><p>Both dull and shrill voices would occasionally be heard in the green hill behind the Zhishou Abbey. The vines that were scattered about on both the mountain path and in the dense forest would shake with these sounds as if they were especially terrified.</p><br/><p>The source of these voices were the terrifying Taoist priests who had hidden away in the cave for decades. These Taoist priests did not try to show off their powers intentionally. However, their emotions meant that even the simplest speech would cause the vines and red sand to tremble. Several caves seemed to be on the brink of collapse from the shaking.</p><br/><p>\"Why?\"</p><br/><p>\"Why did you let me see hope? Why did the hope turn out to be a cruel one?\"</p><br/><p>\"I will kill that young one\"</p><br/><p>\"How dare that useless thing! How dare he try to hurt us!\"</p><br/><p>\"Why did Taoist He not do anything before his death?\"</p><br/><p>\"What did he see?\"</p><br/><p>\"Was that Haotian's will or the shadow of Yama?\"</p><br/><p>\"Is this really Heaven's orders?\"</p><br/><p>The cliffs that were tightly wrapped by the ruined vines suddenly became quiet. No one spoke for a long time. The old Taoist priests in the cave remembered the scene they had seen before, and they thought about what they saw. They understood the truth is what they had seen and they kept silent.</p><br/><p>A long time later, an extremely loud sound rang between the cliffs. The birds who were trying to find nesting material in the foothills of the forest heard the sound and flew in all directions in horror.</p><br/><p>\"It doesn't matter whether it is the will of Haotian or the shadow of Yama. It doesn't matter whether this is a sign from the Heavens or a sin of mankind. This young Taoist disciple had appeared before us and that itself is troublesome. Senior Brother, he was robbed of his cultivation powers by the young man but did not kill him before his death. It meant that he did not wish to resist this temptation.\"</p><br/><p>A voice of vicissitudes and old age was heard in a cave.</p><br/><p>\"If it were me, as long as Long Qing could inherit my powers and then destroy the Academy and the Tang Empire, I might be willing to do so too. I have had enough of the quiet life in this cave over the decades. If I had not been injured by Ke Haoran then, I would be sitting on the black jade throne now. Would Lotus be able to steal my position? Or would I still be here, where I cannot see the green hills and my people?\"</p><br/><p>A cold voice could be heard from another spot in the cave.</p><br/><p>\"If you are really willing to pass on your powers to that young man, why did you kill him before? At the end of the day, you can't bear to lose the opportunity to get out of here. Don't talk about the past and your regrets. We have all been trapped in this cave. Who doesn't have any regrets? When the Headmaster had gone to the Peach Mountain and chopped all those peach blossoms down, had I not tried to stop him and was injured just by his glance, would Wei Guangming dare to chase me out on false charges?\"</p><br/><p>The old voice pregnant with vicissitudes of life said mockingly, \"You are an Elder in the West-Hill and Great Divine Priest of Revelation's Senior Brother, yet you spend your days with the wife of an ordinary believer from the Song Kingdom. If not for Headmaster injuring you, do you think Wei Guangming would simply throw you out of the Peach Mountain without doing anything else?\"</p><br/><p>\"What are you implying?\"</p><br/><p>\"I am saying that you can just give your cultivation powers to that useless Long Qing.\"</p><br/><p>\"Why don't you do it?\"</p><br/><p>\"Because I will get out of here one day.\"</p><br/><p>\"You wouldn't be able to get out of here even if the world ended.\"</p><br/><p>\"Stop arguing.\"</p><br/><p>The voice was deep and filled with infinite power. It rang in the cliff, causing the broken vines to rattle and the birds that were about to take off to fall to the ground, chirping mournfully.</p><br/><p>It was evident that the old Taoists were all afraid of this voice.</p><br/><p>\"Senior Brother He had his waist chopped by Ke Haoran. He had lived a life worse than death for decades. Unlike us, he would never have the chance to get out of here again. It is not a bad thing to have a vicious successor like Long Qing.\"</p><br/><p>\"However, it is different for us. While we are heavily injured, we can still control our cultivation state. As long as we have the chance, we can leave this cave and the Zhishou Abbey. It doesn't matter whether the cruel and vicious young man who makes even my heart palpitate lives or dies as long as he is far away from us. What we have to do now is to practice cultivation with a still heart and wait. Memories of our glory days are all poisonous to our hearts. Even without that young disciple, you will all end up being possessed by the Devil anyway.\"</p><br/><p>All was silent in the cave and nobody dared to raise their objections. The old Taoist priests in the cave all knew that no one else was more qualified to talk about their past than that man. If they had not been injured by Ke Haoran, this old man would have been sitting at the top of the West-Hill Divine Palace and ruled the entire Haotian Taoism sect as the hierarch.</p><br/><p>Some time had passed.</p><br/><p>Once again, a sound rang in the cliffs. The vines did not move. The red soil on the ground that looked as if it was stained with blood began to roll due to the desperation and the viciousness in the sound.</p><br/><p>\"Would the day when we leave the cave alive really come?\"</p><br/><p>\"Can we really see the skies outside once more?\"</p><br/><p>\"How long do we have to wait?\"</p><br/><p>\"We have already waited for decades. Some people have already died. Can we really continue waiting?\"</p><br/><p>These questions were filled with viciousness and bitterness. They were like the cold rain in autumn that washed the cliffs outside the cave, bringing pain to those inside it.</p><br/><p>After a long while, the deep voice rang out again. It was both upset and determined and filled with resentment and expectation towards someone. He said quietly, \"Just wait. Wait forever and prepare. Be prepared at all times and wait. Be prepared for the moment when that old man finally dies. That is the only thing we can do.\"</p><br/><p>Decades ago, the Devil's Doctrine was at its peak. The Haotian Taoism sect had many powerhouses. If the West-Hill Divine Palace had fought, they would have been able to sweep the world.</p><br/><p>Then, the Youngest Uncle of the Academy appeared.</p><br/><p>That Youngest Uncle was called Ke Haoran. He rode a little black donkey and carried an inconspicuous sword at his waist. He destroyed the Devil's Doctrine. And then perhaps because of this, or perhaps he didn't need a reason at all, he began a massacre of all the powerhouses in the Haotian Taoism sect because of differing opinions.</p><br/><p>Many cultivation talents in Haotian Taoism were either grievously injured or handicapped by Ke Haoran's sword. Some were forced to break the realm and were punished by the heavens and did not dare to appear in the world again.</p><br/><p>One day, the powerhouses of Haotian Taoism sect gathered and surrounded Ke Haoran.</p><br/><p>Ke Haoran won that battle.</p><br/><p>He was then punished by the heavens and died.</p><br/><p>After that, the Headmaster went to West-Hill and climbed the Peach Mountain. He chopped down all the peach blossoms and killed everyone who tried to stop him and injured the rest.</p><br/><p>The abbey dean of Zhishou Abbey and the Taoist in Indigo came forth.</p><br/><p>The Headmaster lashed out with his rod.</p><br/><p>The Taoist in Indigo lost and went away to the Southern sea. He would not step on the mainland for the rest of his life.</p><br/><p>Decades later.</p><br/><p>There was a green hill behind the Zhishou Abbey. There was a sprawling tunnel of caves in the cliff. Staying in them, were several heavily injured powerhouses who had terrifyingly powerful cultivation states. Half of them were injured by Ke Haoran, the other half were injured by the Headmaster.</p><br/><p>If these powerhouses were to appear in the world again, they would possibly cause waves. However, they could not leave the cave because the world had long forgotten about their existence.</p><br/><p>Because the Headmaster would not allow them to remember.</p><br/><p>...</p><br/><p>-</p><br/>\n</div>"}