{"title": "Chapter 535: Borrowing One Second from Brightness", "id": 535, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-535-borrowing-one-second-from-brightness", "volume_title": "Volume 6", "body": "<h1>Chapter 535: Borrowing One Second from Brightness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 535: Borrowing One Second from Brightness</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The buzzing sound caused by high-speed tremors kept ringing around the black horse carriage. Each buzzing sound represented a fierce flying sword. When Ning Que used his blade to hew away a flying sword, the fallen knights confirmed that Mr. Thirteen's Perception State of Qi of Heaven and Earth changes was very accurate. No matter how they hid the traces of their flying swords, they could not escape Ning Que's eyes. In a second, they extremely changed their tactics. They no longer tried to disguise their sword traces, but instead desperately poured out their Psyche Power so that each flying sword could unleash the greatest power.</p><br/><p>However, for Ning Que, this tactic was meaningless. After he cultivated the Great Spirit, no matter the hardness or strength of his body, he was far beyond an ordinary cultivator. He moved fast around the black horse carriage and occasionally waved his knife, and the light of knife would shine in the autumn rain; then, a flying sword would bounce away.</p><br/><p>No one, nor any sword, could reach the zone in front of him which was around 30cm long. This was Liu Bai, the Sage of Sword's powerful tactic, which was mentioned by Master Yan Se.</p><br/><p>Ning Que did not just understand the knowledge of the 30cm long zone in front of him, but he also understood Liu Bai's Great River Sword Intent through Ye Hongyu's thin paper. Now his knife skill was more than simple and quick. It had a very strong and irresistible power. It also had the seemingly reasonable sword style which was actually very unusual.</p><br/><p>No one was able to approach him, but he could approach others. The Great Spirit in his body spun at a high speed, constantly releasing its power. His right foot stepped on the muddy grass, splashing plenty of muddy water. He left a lingering image in the air, and instantly came to the front of a fallen knight.</p><br/><p>With the sound of cutting flesh, his knife pierced deep into the fallen knight's thigh, and then he pulled it out like lightning. Then the Great Spirit turned again and he swept away 100 feet. Ning Que returned to the black horse carriage again.</p><br/><p>At this time, a fallen knight commander glanced at Ning Que.</p><br/><p>Ning Que looked pale and felt that his sense of perception was shaking, as if a storm would happen within it. Then, he realized that this fallen knight commander was actually a rare Psyche Master.</p><br/><p>There were few people in the world who a had stronger Psyche Power than Ning Que, especially when he had received the pieces of consciousness from Master Lotus before his death at the Front Gate of the Devil's Doctrine. After that, he became the Psyche Master's invincible opponent. Even Master Dao Shi of Xuankong Temple could not defeat him in the spiritual world, let alone this person.</p><br/><p>Ning Que glanced at that fallen knight commander.</p><br/><p>The stronger Psyche Power in his sense of perception directly counteracted that person's psychic attack.</p><br/><p>The fallen knight commander suddenly became pale, and started to vomit. His vomit was a mixture of food in his stomach and blood. It spouted from his mouth and his nose. He looked extremely miserable.</p><br/><p>In the battle, Ning Que's unusual and indescribable bodily movement greatly shocked the people present. It was acknowledged by all cultivators that Psyche Masters had the absolute advantage when battling with cultivators of the same state. However, Ning Que's simple glance left that fallen knight commander badly injured, which was more shocking to the people present, as it was beyond their imagination.</p><br/><p>It was true that Ning Que was only at the peak of Seethrough Realm.</p><br/><p>But he had too many unbelievable skills; the Youngest Uncle's Great Spirit, Liu Bai's sword style, the powerful fighter's body of the Devil's Doctrine, Lotus's sense and the skills of Master Yan Se's Talisman Taoism. Now, he was even beyond Invincible prior to Knowing Destiny; he almost had the Knowing destiny State's ability.</p><br/><p>In other words, even when Ning Que faced an ordinary grand cultivator of the Knowing Destiny State, he would not fear, and he had a 40% chance to kill that cultivator with his knife.</p><br/><p>However, these fallen knights did have considerable power, especially their great cooperation in battle. No matter their bodily movement or footwork, even their breath, all seemed to follow the same frequency.</p><br/><p>Fighting with these fallen knights was like fighting with one man.</p><br/><p>Whenever Ning Que was about to kill a person with his superhuman bodily movement, there were always flying swords coming from extremely dangerous and steep angles. Some people even directly blocked his attack with their arms to cover their companions. These fallen knights who were convicted by the West-Hill Divine Palace did not hesitate to die, as if they had a very noble character.</p><br/><p>It was for this reason that since the start of the battle, Ning Que had injured several people in brief moments. However, except for that commander who was badly injured by Ning Que's Psyche Power, he could not make anyone else lose his fighting force.</p><br/><p>Even so, Ning Que believed that he could kill all these people, or exhaust them, including that fallen knight who was at the peak of the Seethrough Realm, as long as he had enough time. However, he was clear that he was actually confronting that person at this time, and that peak Seethrough person had never struck out so far.</p><br/><p>Long Qing struck out.</p><br/><p>In his hand, a black peach flower grew.</p><br/><p>From the black peach flower, a pure black invisible Taoist Sword was born.</p><br/><p>The black Taoist Sword floated like a ghost in front of the Red Lotus Temple.</p><br/><p>A sense of death gradually spread from the sword.</p><br/><p>Feeling the sense of death, those fallen knights' spirits seemed to be filled with vitality. The flying swords were as dense as a light belt, and immediately locked Ning Que into the tiny area in front of the black horse carriage.</p><br/><p>Ning Que also perceived the sense of death. Somehow, he felt a chill in the depths of his heart. He kept sensing that something terrible was about to happen and his body was tired because of this feeling.</p><br/><p>In fact, long ago, Long Qing had already struck.</p><br/><p>When Ning Que shot the seventh iron arrow, he waved his taoist robe and turned numerous autumn raindrops into a stone waterfall. He threw it toward the black horse carriage. Those black raindrops evaded the big black umbrella and fell into the carriage.</p><br/><p>They fell onto Sangsang's body.</p><br/><p>At this time, Sangsang's pale cheeks became strangely red, and her body temperature seemed to be extremely high. She coughed more severely, and she seemed to cough some spotted blood stains on her clothes.</p><br/><p>Sangsang knew she was poisoned.</p><br/><p>But she did not know how.</p><br/><p>She knew that if she forcibly cast her Divine Skill at this time, then no one would know what would happen.</p><br/><p>However, being aware of the terrifying sense of death that entered the carriage through the walls, and looking through the window at Ning Que who was struggling under the siege of the crazy fallen knights, she knew she had no choice.</p><br/><p>Sangsang leaned on the side of the horse carriage and stood up with difficulty to open the skylight. Then she held the big black umbrella with both hands and opened it against the autumn rain that continued to fall from the sky.</p><br/><p>She opened up a brightness.</p><br/><p>The sacred Haotian Divine Light lightened the dark sky in the dark rain, and the grass in front of the Red Lotus Temple. It seemed that the rain stopped at this moment, and the sun appeared again.</p><br/><p>Sangsang was on the top of the carriage, holding the big black umbrella with both hands. Countless rays of milky Divine Light jumped out of her body and then rushed from the big black umbrella to everywhere around the mountain.</p><br/><p>Because of the closeness in their innermost heart, the fallen knights awakened from the aura of death. Looking at the familiar and fearful Divine Light, some of them recalled the identity of the girl dressed in a handmaiden costume and could not help but show fear and despair in their eyes.</p><br/><p>They served Haotian in the West-Hill Divine Palace for several decades. The fear and devotion to Haotian had already been deeply implanted in their bones. Facing the Great Divine Priest of Light of the Divine Hall, facing the purest and most solemn Haotian Divine Light, how could they not fear?</p><br/><p>When they began to fall and willingly dedicate their souls to Yama to seek survival and strength, they did not gain too much power to resist Haotian Divine Light. Instead, they were even more terrified!</p><br/><p>Their faces were illuminated by the holy light and the look on their faces was extremely complicated. Some were confused, some were regretful, some were terrified, and some even cried in despair.</p><br/><p>Long Qing's situation was relatively better.</p><br/><p>He had deep faith in Haotian, but it was also easier for it to be temporarily erased on the spiritual level. However, the black sword extracted from the peach flower of his own life had become the primary target of Sangsang's Haotian Divine Light, because it had a dark aura.</p><br/><p>That invisible pure black Taoist Sword groaned in pain. A green smoky cloud appeared on the sword and made sounds. It seemed that it would melt in the next moment, under the bright world.</p><br/><p>Long Qing grunted. His burning face was pale, and his charred body began to emit smoke. The wounds that had been made by the iron arrow began to drip with blood again.</p><br/><p>He withdrew his black sword, ignoring his flowing blood. He headed to the black horse carriage, because he discovered that if he wanted to kill Ning Que, he must first kill that little handmaiden.</p><br/><p>Fortunately, for Long Qing and the fallen knights, the Haotian Divine Light before the ruined temple today was not as abundant as the one shed at the Yanming Lake.</p><br/><p>It seemed to last a long time, but actually, it was only a brief moment before Sangsang's Haotian Divine Light disappeared, and the cold autumn rain ruled the world again.</p><br/><p>She looked at the faint shadow on the grass under the carriage and lowered her head.</p><br/><p>She was seriously ill and had been poisoned; she could no longer do anything today. She transported Haotian Divine Light from her body into Ning Que's, and that was all she could do.</p><br/><p>She was pale and fainted, then fell into the horse carriage.</p><br/><p>The big black umbrella left her hand and floated into the small pool near the carriage, swaying gently.</p><br/><p>The sacred Haotian Divine Light was still bright, even though it only illuminated the world for a moment.</p><br/><p>In the absolute light at that moment, Ning Que became a very shallow shadow, gliding on the grass at a high speed. His blade silently cut through those fallen knights who stood still like wooden idols.</p><br/><p>Immediately afterwards, he did not hesitate to squeeze out his last bit of Psyche Power, and triggered all the Fu papers in his arms. They turned into countless walls of fire, wind and snow, and kept Long Qing out of the black horse carriage.</p><br/><p>Sangsang had been together with the big black umbrella since childhood. Even in her sleep, she was not very willing to leave it, but now the big black umbrella had left her hand. This could only prove that Sangsang's situation was very critical.</p><br/><p>Autumn rain fell again, and those fallen knights also fell to the ground.</p><br/><p>Terrible wounds appeared either on their necks or chests and abdomens.</p><br/><p>At the moment before the brightness left, the two commanders and five fallen knights were killed by Ning Que. The rest of them also suffered serious injuries and could not stand up for a moment.</p><br/><p>The situation of the battle suddenly changed.</p><br/><p>The only two people that could still stand now were Ning Que and Long Qing.</p><br/><p>In successive bloody battles, Ning Que ran out of Psyche Power, and his Great Spirit was exhausted. The talismans were consumed and the arrows were spent. He truly had nothing. He managed to move to the black horse carriage and leaned against the wall. He lowered his head silently, and breathed wearily and heavily. Every time he breathed, it seemed to be very painful.</p><br/><p>Zi Mo was sitting in the grass. His body was covered with blood and water. He looked at Ning Que who was leaning on the horse carriage. His eyes could not help but show a look of reverence. He could not understand why a person who was only at the peak of Seethrough Realm could resist the Priest and himself as well as so many powerful fighters till now. How did he manage to do that?</p><br/><p>\"Give it up.\"</p><br/><p>Zi Mo looked at him and said in trembling voice, \"Let your strong soul follow His highness, and create a new word. This will also make you a legend and be remembered for thousands of years, Mr. Thirteen.\"</p><br/><p>Ning Que leaned tiredly against the horse carriage, and did not answer him.</p><br/><p>Long Qing looked up at the sky. Cold autumn rain fell into his eyes, and made them slightly wet.</p><br/><p>His hands trembled slightly, as he knew that he had finally won the most important victory in his life.</p><br/><p>\"Now you can admit defeat.\"</p><br/><p>Long Qing calmly said when he stopped gazing at the sky and looked at Ning Que.</p><br/><p>Ning Que was still holding the hilt of his podao, staring at the rain splashing in the small pool in front of him. He said tiredly, \"Teacher said that this is my story, and it can only be written by myself. Since it is me writing the story, you naturally cannot become the hero in it, so I don't understand why I would lose.\"</p><br/><p>Long Qing said, \"This world is very big. Everyone has his own story. You have it. I also have it. But unfortunately, today, this story is mine and I am the hero.\"</p><br/><p>Ning Que was silent, and he knew that Long Qing was right... He had exhausted his means, but he still couldn't change the situation. The most important thing was that Sangsang was unconscious.</p><br/><p>Long Qing asked, \"Do you have any last words?\"</p><br/><p>Ning Que looked up at the chilly autumn rain, and suddenly shouted, \"Teacher! Eldest Brother! Sangsang and I are going to die! Come and save me!\"</p><br/><p>The expression on Long Qing's face was very funny. He suddenly felt that Ning Que was a very interesting person.</p><br/><p>No one responded to Ning Que's cries, and the mountains were silent. Just as the Headmaster had repeated countless times, people in this world might be born with knowledge, but no one knew everything.</p><br/><p>\"I was just giving it a try. Do you mind?\"</p><br/><p>Ning Que looked at Long Qing and said with a smile.</p><br/><p>Long Qing said, \"No.\"</p><br/><p>Ning Que threw away the podao in his hand, and looked at Long Qing. Suddenly, he said very seriously, \"I have some last words.\"</p><br/><p>Long Qing said, \"Speak.\"</p><br/><p>Ning Que looked at his eyes, and said, \"Let my little handmaiden survive.\"</p><br/><p>After a long silence, Long Qing said, \"I'm sorry, but I can't do that.\"</p><br/><p>\"Why?\"</p><br/><p>\"Because she will seek revenge for you.\"</p><br/><p>\"Are you afraid of her?\"</p><br/><p>\"No one dares to despise a future Great Divine Priest of Light.\"</p><br/><p>Long Qing looked at him with a smile and said, \"Besides, a future Great Divine Priest of Light will surely taste good and bring me unimaginable benefits, and may not be inferior to you.\"</p><br/><p>Ning Que slightly narrowed his eyes and said after a long while, \"I don't understand what you said.\"</p><br/><p>Long Qing patiently explained, \"From the Tomes of the Arcane, I learned a kind of magic that can assimilate the cultivators' Psyche Power, Divine Power, experience, consciousness and all cultivation for my own use. It is said that this magic was derived from the notorious Practice of Taotie from the Devil's Doctrine. But it is less bloody, and it does not need you to eat humans like a wild beast.\"</p><br/><p>The reason why the explanation was so clear was that he wanted to see the emotions of despair, anger, disgust, unwillingness, madness on Ning Que's face. Ning Que had brought him these emotions, so he always thought that if he could give them back to Ning Que, it would be a wonderful thing.</p><br/>\n</div>"}