{"title": "Chapter 558", "id": 558, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-558", "volume_title": "Volume 6", "body": "<h1>Chapter 558</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter558sangsangschessplayandthefirstmatchreminiscentofbearpawsanduncleancuts\">Chapter 558: Sangsang’s Chess Play and the First Match Reminiscent of Bear Paws and Unclean Cuts</h3><h5 id=\"translatortransneditortransn\"><strong>Translator:</strong> Transn <strong>Editor:</strong> Transn</h5><br/><p>The chilly autumn breeze dragged by the stream and across Ning Que’s face. He came around and realized that his mental state was not at its peak. He had worried and feared about Sangsang’s illness for days, so he had become anxious and even violent.</p><br/><p>In the autumn rain at the Red Lotus Temple, when he had bitten off a piece of flesh from Long Qing’s neck, he had perceived that terrifying mental state. He knew that if he was really controlled by his emotions, then he would sink into an abyss and find it hard to recover.</p><br/><p>With that thought, he took a deep breath and allowed the cool and moist aura in the autumn breeze to moisten his dry lungs. The Great Spirit filled his body and supressed the dangerous and rash actions that appeared in his mind. He decided not to cause any more trouble before meeting Master Qishan and getting a cure for Sangsang.</p><br/><p>As for the warning signs he had received in his heart, Ning Que felt that he had just entered the Knowing Destiny State; perhaps he had perceived wrongly due to his anxiousness, or perhaps, he hoped that it was just a mistake.</p><br/><p>He lowered his arm and the sharp arrowhead. Then, he lifted the finger that was controlling the bowstring. This slight action was no longer as scary as an impending avalanche.</p><br/><p>Countless sighs of relief near the stone chessboard beside the stream accompanied this action. Many cultivators had held their breaths earlier and were extremely nervous.</p><br/><p>Ning Que looked at the damp ground in the direction of his iron arrow and said, “As long as you don’t stop me from heading up the hill to see Master Qishan, I can show sufficient respect to the Xuankong Temple or the Buddhism Sect. Even if it might be fake.”</p><br/><p>Monk Guan Hai smiled bitterly when he heard that. He thought to himself that the tense situation had finally been resolved, so why did Ning Que still have to say something like that? He comforted him, “Even though my teacher rarely accepts guests, since he has come out, there is no reason why he would not meet with Senior Brother Thirteen.”</p><br/><p>Then, the yellow-clothed monk sitting by the chessboard said shrilly, “The reason would be the rules. Guan Hai, even though you are Senior Brother Qishan’s successor, you cannot disregard the rules of Wa Mountain.”</p><br/><p>Monk Guan Hai was speechless. Afterall, rules were laid by man. Mr Thirteen of the Academy and the Lady of Light in the horse carriage were not just anyone. Would they need to solve the three games as well?</p><br/><p>The yellow-garbed old monk looked at Ning Que and said coldly, “The Academy might be powerful, but you cannot defeat the Bhadanta of the Buddhism Sect with just an iron arrow. I have said earlier, that Ke Haoran could breach the Wa Mountain with just a sword by his waist. I admit that he is powerful enough to break the rules of Wa Mountain. If you wish to break the rules, you have to show me. I want to see if the person who has entered the human realm on behalf of the Academy is just as cold-blooded as his senior. Would he kill senselessly?!”</p><br/><p>Ning Que could now ascertain that the old monk living in seclusion in the Lanke Temple had a grudge against his Youngest Uncle. Judging by the monk’s cultivation state though, he was unimportant to Youngest Uncle. Ning Que shook his head and smiled painfully. He thought to himself that it wasn’t a good thing that the seniors in his sect were too powerful. Their debts had to be paid by the younger disciples of their sect.</p><br/><p>He plucked the bowstring, which buzzed clearly. He thought silently, did he have to do what Youngest Uncle did?</p><br/><p>Just as Ning Que was pondering over this, Sangsang hesitated. Her uncertain voice rang from the horse carriage, “Young master, why don’t I try it?”</p><br/><p>Ning Que knew that she was worried for him, so he did not wish to enter into another conflict with the Buddhism Sect. He said with a smile, “Do you know how to play chess? Furthermore, this would put a strain on your body.”</p><br/><p>Sangsang’s voice pierced through the windows, “Young master, I know how to play chess. Furthermore, I think that playing chess is very interesting. I don’t think it would tire me out.”</p><br/><p>When Ning Que heard what Sangsang had to say, the image of the gambling den in the City of Wei appeared in his mind. He also recalled what the two Senior Brothers of the Academy had told them repeatedly before they left, and he was somewhat convinced.</p><br/><p>Then, he ridiculed himself for thinking too much.</p><br/><p>The Lanke Temple was well known for their chess play. The legendary three matches would, of course, be very difficult. The South Jin national player had spent a long time thinking, but had not even placed down any chess pieces. While Sangsang might be proficient in playing chess, would she be able to solve the game?</p><br/><p>He shook his head and said, “The autumn wind is cold. Don’t come out.”</p><br/><p>In the past, Sangsang would not rebut him before others. However, she was being rather stubborn today for some reason. She said, “I will watch from the carriage and ask Miss Shanshan to move the chess pieces for me.”</p><br/><p>Ning Que did not know what had happened in the carriage earlier. When he heard Sangsang’s address of Shanshan change from the Hill Master, to the Calligraphy Addict, to Shanshan, he began speculating. However, since Sangsang had already said that, she must have gotten Mo Shanshan’s agreement. As such, he did not know how to reject her. He said, “Then let’s try.”</p><br/><p>Then, he added, “We don’t have to do this if you feel tired. We can just barge through.”</p><br/><p>Monk Guan Hai’s smile grew bitter when he heard that. The Lanke Temple abbot’s face was filled with dissatisfaction, but he did not dare to rebuke Ning Que. The yellow-garbed old monk by the chess board returned to his seat on the stone bench with an indifferent expression.</p><br/><p>There was the soft clopping of horse hooves, and the steel carriage wheels pressed over the stone grounds. The black horse carriage left the stream silently via the stone bridge and stopped a distance away from the stone table beneath the large green tree.</p><br/><p>There were several straight lines carved into the table both horizontally and vertically. It was a natural chess board. The lines were deeply gouged into the stone, but were extremely smooth. It looked as if it had been buffed by chess players often.</p><br/><p>The branches of the large tree blocked the sun above the autumn skies of the Wa Mountain. There were over a hundred chess pieces on the chess board, but they did not move under the shade of the tree. They might look messy, but there was something hidden in the formation.</p><br/><p>The white-haired national player from the South Jin Kingdom had already been frowning in contemplation by the stone table for a long while. He held a white chess piece in his hand, but had not yet placed it on the board. Looking at the formation on the board, he had yet to make his first move.</p><br/><p>In the deepest part of the game of chess, one’s mind would wander between the lines of the board and forget about the world. The South Jin chess master pondered hard on how to crack the game, and was completely unaware of what had happened by the stream. He had not even noticed the arrival of Ning Que and the Xuankong Temple’s high monk.</p><br/><p>Since the black horse carriage had arrived, the South Jin chess master could not seat by the chess board any longer. A South Jin official escorted him from his seat. The chess master was enraged. He had just caught a glimpse of the solution but was suddenly interrupted. He pointed his finger at the official and ranted at him, angry beyond reason.</p><br/><p>The autumn breeze lifted the curtains, and Mo Shanshan, who wore a white dress exited the horse carriage. She walked to the stone table and bowed to the yellow-garbed monk. Then, she sat on the stone bench and asked, “Can I move the chess pieces on behalf of Miss Sangsang?”</p><br/><p>The yellow-garbed old monk stayed silent, indicating his approval.</p><br/><p>A corner of the curtain in the horse carriage was lifted, revealing Sangsang’s little face. She looked at the messily scattered chess pieces on the board, and her eyes gradually brightened.</p><br/><p>The black horse carriage stopped diagonally under the large green tree. The window Sangsang peered out of faced the mountain stream, so the cultivators on the sone platform could not see her, and only the yellow-garbed old monk could.</p><br/><p>The yellow-garbed old monk was very shocked when he saw Sangsang’s tanned but pale and haggard face. He had never imagined that the legendary Lady of Light was such an ordinary looking lady.</p><br/><p>The yellow-garbed old monk had spoken unkindly to Ning Que earlier, so Sangsang didn’t like the man. Her gaze skipped the old monk’s face and landed on the stone chess board.</p><br/><p>For some reason, Sangsang’s eyes grew brighter. Then, she carefully and softly asked, “What is the prize for this game?”</p><br/><p>Ning Que knew there would be a problem when Sangsang’s eyes grew brighter. In the past, her eyes would only get this bright when she saw taels of silver. However, he did not expect Sangsang to ask such a question, and his expression grew interesting to watch.</p><br/><p>The Calligraphy Addict did not expect Sangsang to ask if there was a prize, and was stunned speechless.</p><br/><p>The yellow-garbed old monk was the most shocked. He had been overseeing the three games of chess on Wa Mountain since decades ago. He had also seen many competitors with stunning chess abilities. However, this was the first time someone had asked what the prize was.</p><br/><p>This was a chess game that embodied the wisdom of the high monks and Bhadantas of the Lanke Temple. This was a necessary and dignified test for people who wished to meet Master Qishan. However, the girl had treated it no differently than a gamble in rundown gambling dens!</p><br/><p>The monk in yellow robes was shocked, and then, he grew furious. Even though the girl was the Lady of Light from the West-Hill Divine Palace, how could she shame the Lanke Temple? He ignored Sangsang’s question with a glacial look.</p><br/><p>Sangsang looked at Ning Que’s and Mo Shanshan’s expressions. She saw the yellow-garbed old monk, who looked as if he was grieving the death of his family and knew that her question was out of line. She couldn’t help but feel ashamed.</p><br/><p>…</p><br/><p>…</p><br/><p>The cultivators had all returned to the large tree’s canopy. They prepared to watch the chess match excitedly. While they did not dare to stand too close to the chess board, they were all skilled cultivators and could see what was happening on the chess board clearly.</p><br/><p>While they could not see the Lady of Light’s face from their position, they were still very excited to be able to witness the Lady of Light’s first game of chess in the world.</p><br/><p>Not everyone present was interested in the match. The high monk from the Xuankong Temple who was sitting on the palanquin would not watch Ning Que’s handmaiden play chess after being shamed by him.</p><br/><p>The Buddhist palanquin moved. Quni Madi led the sadhus from the Yuelun Kingdom, under the direction of the Lanke Temple’s abbot, past the stone table and toward the stone bridge on the Jumping Tiger stream.</p><br/><p>Ning Que turned around, and caught the eye of the Flower Addict, Lu Chenjia.</p><br/><p>Lu Chenjia’s gaze was so calm, it was odd. It was like the remnants of snow on the meadows of the Wilderness. It was fading, and yet especially frigid.</p><br/><p>Even Ning Que, who was used to death, felt a chill run down his spine when he caught her eye.</p><br/><p>He looked away and at the Buddhist palanquin. He said, “Stop.”</p><br/><p>The Buddhist palanquin stopped.</p><br/><p>Ning Que asked, “Why can the master on the palanquin cross if I can’t?”</p><br/><p>This question was directed at the yellow-garbed monk.</p><br/><p>The monk frowned and asked, “These are our guests from the Buddhism Sect, so why can’t they cross?”</p><br/><p>“If disciples of the Buddhism Sect can cross, why can’t I? Princess Chen Jia became a Buddhist as a child, but she entered the Revelation Institute to cultivate in Taoism, and prayed to Haotian. Can she still be considered as a Buddhist?”</p><br/><p>Ning Que turned around to look at the monk and said, “Is this what you mean by rules are alive? I have never seen such unscrupulous rules like this in my entire life. The Academy will not accept such rules.”</p><br/><p>Then, he continued, “If rules have to be abided, then it applies to everyone. I don’t care about monks in the Lanke Temple, but people outside of the Lanke Temple, no matter whether they are from the White Tower Temple or the Xuankong Temple, cannot cross the bridge before us.”</p><br/><p>Everything was silent.</p><br/><p>Quni Madi looked at Ning Que viciously. Ning Que seemed as if he did not see that, and only looked at the Buddhist palanquin.</p><br/><p>Even though he had not attempted to risk killing the Xuankong Temple’s high monk, he was still very vigilant. Rather than letting the other party head up the mountain first, he might as well keep them in his sights so that he can deal with them.</p><br/><p>The monk behind the curtains waved his hand, and the Buddhist palanquin was put down.</p><br/><p>Ning Que frowned slightly.</p><br/><p>Then, the South Jin chess master suddenly shouted in surprise by the chessboard.</p><br/><p>The shout was filled with many complicated emotions. There was shock, anger, and then pity.</p><br/><p>Just like how the Headmaster had visited a certain village in the mountains north of the Yan Kingdom and spent just three hours to serve his guests a bear paw. Or like how Ning Que had watched his companions take three strokes to cut off the head of a Horse Gang member by the Shubi Lake. The cut wasn’t clean and could not be used to earn military credits or exchange for taels of silver.</p><br/><p>“How can it be placed there! Do you even know how to play chess?!”</p><br/><p>…</p><br/>\n</div>"}