{"title": "Chapter 551: Whispers before the Hall", "id": 551, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-551-whispers-before-the-hall", "volume_title": "Volume 6", "body": "<h1>Chapter 551: Whispers before the Hall</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 551: Whispers before the Hall</p><br/><p>Translator: Transn Editor: Transn</p><br/><p>The hand appeared from the carriage window for a very short time but it was enough for Ning Que to capture some of its features. He saw slender fingers, a broad palm, and thin calluses.</p><br/><p>It was a hand very suitable for holding a sword and the thin calluses seemed to prove that it was a hand of a swordsman. The ordinary sword masters of the cultivation world usually used flying swords and there was only one exception. Coincidentally, it was the Sword Garret founded by the Sword Sage in the South Jin Kingdom.</p><br/><p>Ning Que somewhat deduced the identity of the man in the carriage. He appeared quite sorry, but deep in mind, he got alert.</p><br/><p>A man's voice rose from the luxurious carriage. It must be the owner of the hand. With a calm and gentle voice, he apologized to Ning Que on the other young man's behalf.</p><br/><p>Hearing the apology and sensing the calmness in the voice, Ning Que did not show his shock. He had guessed that the man might have come from the Sword Garret, but he did not expect a powerhouse at the Knowing Destiny State, or that a Knowing Destiny State cultivator would be so humble.</p><br/><p>Ning Que had felt the kindness and sincerity in the apology. When he confirmed that the man was a Knowing Destiny State cultivator, the kindness and sincerity seemed to be multiplied in a very short time.</p><br/><p>Ning Que never wanted to make a scene since Sangsang needed the treatment from the monks in the Lanke Temple. So after receiving the sincere apology, he waved his hand as a signal of ending the conflict.</p><br/><p>After a quiet moment in the carriage, the sincere and kind voice rose again, \"Our master was rude to you but since you have come here to pay your tribute to Buddha, more sincerity would do you good.\"</p><br/><p>The kind words inadvertently revealed some sort of lecturing. Considering the man's power, Ning Que was not surprised at the arrogance. He shook his head and said, \"For you guys from the South Jin Kingdom, Haotian is your god. But now you are here to worship the Buddha. I don't know how the Buddha would feel about it. Actually, we are the same. I never worshiped the Buddha in the past because I had nothing to ask for. But now I do have something to ask for and no matter how devout I am, the Buddha may not respond. So, why does the attitude matter?\"</p><br/><p>The man in the carriage sighed like he was sorry to hear Ning Que's reply and then he said his farewells. Horse carriages slowly moved toward the side hall in the east.</p><br/><p>The Yue Laan Hungry Ghost Festival was a major event in the world and many bigwigs would come to the Lanke Temple this autumn to the celebration. Several days later, they could be everywhere in the temple. So, Ning Que did not care too much about the encounter, even if he had already known the true identity of the young master.</p><br/><p>The autumn rain became heavier, falling on the surface of the big black umbrella. Although the rain did not touch the people under the umbrella, they felt colder in the temple. Ning Que took Sangsang's hand and prepared to head back to rest on their yard.</p><br/><p>Before leaving, he took a glance at the top of the distant Wa Mountain.</p><br/><p>The stone statue of Buddha was silently watching the world under the mountain. His wet face seemed to be more compassionate, as if he was sympathetic to the mortals trapped in the worldly affairs.</p><br/><p>\"If you are right about the causal circle in the world, then there might not be a good ending for me, since I have done a lot of evils in my life. But Sangsang is different. I have tried my best to keep her away from killing. So if there's really a retribution, it must be on me instead of her.\"</p><br/><p>Looking at the Buddha statue in the rain, Ning Que prayed in his heart.</p><br/><p>\"If you punish her because of my evils, if you take her away from me, I will destroy your largest statue in the world. I will burn the Lanke Temple and the 72 temples of Yuelun, and I will kill all the monks in the world. I will make the Buddhism Sect disappear.\"</p><br/><p>...</p><br/><p>...</p><br/><p>Several luxurious carriages from the South Jin Kingdom stopped quietly in front of a side hall of the Lanke Temple. A dozen middle-aged men with sharp eyes watched around indifferently to protect their master inside the hall. And there were several attendants, who looked like officials seeking shelter from the rain in the porch but did not enter the hall.</p><br/><p>The side hall in the rain seemed darker than usual. A dozen statues were worshipped in the hall, reflecting slight cold light. Some of them were happy while some were sad. Some of them put their hands together and some opened them. Different gestures revealed a strange sense of beauty and solemnity.</p><br/><p>A middle-aged man dressed in cyan clothes stopped in front of the stone statues and watched them. His hands behind him were slender and stable. He was the powerhouse from the Sword Garret and the man who spoke in the carriage.</p><br/><p>Looking at the statues, he lamented, \"Lanke Temple, Yuelun's White Tower Temple and the Wanyan Tower in Chang'an all have stone statues of the venerable. It is said that people born to be smart can get the real meaning of the Buddhist Emblematic Gesture from the statues. Unfortunately, I can only feel the existence of wisdom but cannot realize it.\"</p><br/><p>The side hall was very quiet. The young master from the South Jin Kingdom who scolded Ning Que earlier looked embarrassed. It was not proper for him to blame the powerhouse from the Sword Garret, but he could not control his emotions. He was very unsatisfied with the apology which greatly humiliated him.</p><br/><p>The middle-aged man looked at the young master's gloomy face and sighed in his heart. He slowly consoled, \"There are many hidden powerhouses in the cultivation world. Since this year's Yue Laan Hungry Ghost Festival will be held in the Lanke Temple, people who rarely appear in the world may come here as well. Although the South Jin Kingdom has nothing to fear, we don't want any trouble.\"</p><br/><p>There was a gray-haired old man accompanying the young master to visit the Lanke Temple. From his bent figure, he was just an ordinary person except that he carried a chessboard under his armpit. He looked quite phlegmatic and arrogant.</p><br/><p>The old man was the national champion of the South Jin Kingdom and was called the Chess Master. In his entire life, he had almost never lost any game on the chessboard and had the privilege to enter the palace freely. That was why he was so arrogant. He knew that troubles never bothered his noble master and said unhappily, \"How could Mr. Cheng, the Sword Sage's younger brother, care about small troubles? Besides, the accent of the young man with the black umbrella tells me he is from the Tang Empire. There's no reason to compromise.\"</p><br/><p>The young master thought the same so he looked at the middle-aged man, waiting for his explanation.</p><br/><p>Cheng Ziqing was the name of the middle-aged man and he was one of the few powerhouses who had reached the Knowing Destiny State in the Sword Garret. Of course, he did not care about the old man's attitude and treated the young master lightly. He said calmly, \"Mater Qishan was a benefactor for the South Jin Kingdom. I think my Senior Brother or His Majesty would not want to see any conflicts in the Lanke Temple.\"</p><br/><p>His Majesty was the Emperor of the South Jin Kingdom and his Senior Brother was Liu Bai, the Sword Sage. The two names that Cheng Ziqing mentioned immediately made the hall silent and nobody dared to say a word.</p><br/><p>Cheng Ziqing walked out of the side hall and found a young officer in the porch. With his eyes, he indicated the officer to follow him. When they came to a quiet place, he looked at the pale face of the officer and asked, \"Is it him?\"</p><br/><p>The young officer was Xie Chengyun, the third young master of the Xie Family in the South Jin Kingdom. At the Academy, he was a little-known talent and after the exam of the Academy's Second Floor, he had to leave the Academy because Ning Que was the winner. He came back to the South Jin Kingdom and it didn't take long for him to get his own place in the imperial court. This year, he was appointed by the Emperor as a close official of the Crown Prince.</p><br/><p>Hearing the question, he nodded with a complicated look on his face.</p><br/><p>Cheng Ziqing fell into silence.</p><br/><p>In fact, when he first saw the big black umbrella, the young man and the girl under it, he had guessed their identities. When the young man showed the same indifference to Buddha, he knew his deduction was right and he had made a good choice to apologize for the young master.</p><br/><p>The young master would not give up if he found out the identity of the man under the umbrella. And the Lanke Temple would not have peace today. Even if he had reached the Knowing Destiny State, he did not want to be against the man. He was not afraid, but he did not want to offend the man and his invincible sect.</p><br/><p>After thinking for a while, Cheng Ziqing looked at the officer and said, \"Tomorrow, Master Qishan will show up and Ning Que would definitely be there as well. You must pay close attention to him. Even if His Highness recognizes him, you must keep His Highness calm.\"</p><br/><p>Xie Chengyun understood what Cheng Ziqing was worried about, and after a little hesitation, he accepted the mission.</p><br/><p>After serving the Crown Prince for half a year, he clearly knew the disposition of his lifetime master. And he knew how difficult it could be to keep His Highness calm.</p><br/><p>Something suddenly occurred to him. He looked at Cheng Ziqing's face, and worked up the nerve to gently ask, \"Is it true that the man had blinded the Sword Sage's younger brother?\"</p><br/><p>Cheng Ziqing's eyes gradually became cold. He looked at Xie Chengyun and coldly said, \"I know you once studied at the Academy with him, and I understand how miserable it could be for a proud man since childhood to watch his old classmate climbing to the top of the world and being left far behind. But you have no other choice but to improve your own cultivation or just give up on making comparisons. Other ploys will only make you more miserable.\"</p><br/><p>\"Never try to kill someone with a borrowed knife. Least of all, a knife from the Sword Garret.\"</p><br/><p>Cheng Zhiqing thought about the head in the ancient lake of the Sword Garret and his blind peer who spent all day in the darkroom practicing the sword. He continued with a frigid voice, \"What the Sword Garret hates most is to be used by others.\"</p><br/><p>What he meant by this was the dealings with the former Great Divine Priest of Judgment, who lent Chao Xiaoshu's sword to Liu Yiqing through some important person in Sword Garret, in order to start a war between the Sword Garret and the Academy.</p><br/><p>In the end, Liu Yiqing was blinded by Ning Que's sword and was sent back to the Sword Garret a few months later. Then Liu Bai drew a paper sword and lent it to Ye Hongyu. The former Great Divine Priest of Judgement was killed on the black jade throne.</p><br/><p>Xie Chengyun only knew about the astonishing battle between Liu Bai's younger brother and Ning Que at the side gate of the Academy in Chang'an. He did not know the secret behind it.</p><br/><p>Suddenly, he felt as if Mr. Cheng's eyes had become the sharpest swords. He felt a sharp pain in his eyes and lowered his head with fear and pain. He dared not say anything more.</p><br/>\n</div>"}