{"title": "Chapter 561 - The Inconspicuous Yet Colorful Leaf", "id": 561, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-561-the-inconspicuous-yet-colorful-leaf", "volume_title": "Volume 6", "body": "<h1>Chapter 561 - The Inconspicuous Yet Colorful Leaf</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>561 The Inconspicuous Yet Colorful Leaf</p><br/><p>Translator:Transn<em>IOL | Editor: Transn</em>IOL /Transn</p><br/><p>A black, horse-drawn carriage drove steadily deep within Mountain Wa.</p><br/><p>The mountain path imbedded with green rocks was at first very smooth and gentle, but due to the erosion of the mud between the rocks by the rain and the wind, several gaps that were as wide as a finger gradually formed. Though the carriage was light as a feather, the passengers still experienced a rocky ride as the stainless-steel made carriage wheels rode across these gaps. Naturally, it was difficult for everyone in the carriage to fall asleep.</p><br/><p>Sangsang leaned onto the carriage windows as she sat on the cotton-padded mattress. Her eyelashes gently covering her eyes. Though she was sick and weak, there was still a slight flush on her pale-looking cheeks. The drops of perspiration on the peak of her nose made her seem somewhat excited.</p><br/><p>Mo Shanshan sat on the soft cushion opposite her and stared silently at her. Her sparse but long eyelashes sat atop bright eyes which blinked slightly. She appeared somewhat curious, with a hint of admiration.</p><br/><p>Sangsang got anxious from her staring and said softly, “Could you not stare at me like that?”</p><br/><p>Mo Shanshan snapped back to reality and calmly said, “Now that the match is done, many people are waiting beside the Wu Yue stream just to get a glimpse at you. Their stares will be much more intense than mine. If not for the thick carriage walls their stares could have burnt holes through it. Moreover, you have got to get used to such stares.”</p><br/><p>Sangsang opened her eyes and looked at her as she curiously asked, “Did many people…stare at me just now?”</p><br/><p>Mo Shanshan nodded.</p><br/><p>“Very few people have looked at me with such intensive stares. In fact, no one ever has.”</p><br/><p>Sangsang began with a soft voice but it was not clear what struck her mind at that time as she gazed outside the window. The autumn breeze raised the green curtains, revealing the scenery of Wa Mountain to the passengers in the carriage. This brought with it some feeling of clarity and helplessness.</p><br/><p>“I have never been beautiful. Ning Que said that in the two years after he found me, I could not get any taller no matter what I ate, be it meat soup or rice soup. I was like a small mouse in his embrace.”</p><br/><p>She gazed at the scenery outside the carriage as she continued: “Though later I managed to survive due to his care, I still could not get any prettier. I am skinny, small and stuck with a dark complexion. Even my hair is messy. It’s shapeless, and it’s slightly bronze in color, like an autumn cabbage left to rot in the mud. I don’t even look any better wearing new clothes during the new year season.”</p><br/><p>“Ning Que has made fun of me before. He said no one would ever discover me even if he discards me into the vegetable fields or into the coal mines. And he is right. I am always that unimpressive little handmaiden no one ever notices.”</p><br/><p>Sangsang said, “Once, when I was young, I had to drag 17 catty of mutton thigh home from the butcher store in the City of Wei. No one thought of helping me. It wasn’t because the people in the City of Wei weren’t helpful, but it was because no one even noticed me. It was the same after we arrived in Chang’an. During our stay at the Old Brush Pen Shop for two years, the uncle who was selling the hot and sour sliced noodle soup at the entrance of Lin 47th Street would sometimes forget who I was even though I purchased noodle soup from him almost every single morning.”</p><br/><p>She turned around, looked at Mo Shanshan and smiled. Her smile was very genuine. Her two dazzling white front teeth seemed to have brightened the dark carriage. She said, “Ning Que is born to be better looking than me. His mouth is also sweeter than mine. Thus, it’s easy for him to win over others’ favor. Regardless of whether the person is General Ma from City of Wei, Aunt Jian, or even the Headmaster.”</p><br/><p>She then added, “When I was with him, everyone only looked at him; but that’s fine. I am used to standing behind him, and I don’t really like being stared at anyway.”</p><br/><p>Mo Shanshan looked at the little lady, who was peacefully and naturally recounting her past experiences, and realized that she could not calm herself down. Not knowing what should be said, she remained silent.</p><br/><p>She recalled the time when she left Chang’an as she gazed at the faraway Old Brush Pen Shop when her carriage drove past the entrance of Lin 47th Street. At that time, Ning Que was sitting opposite Sangsang while they had their meal. They did not speak much. Yet every movement or stare had hidden a natural and harmonious agreement between both the master and the handmaiden.</p><br/><p>With mixed feelings, Mo Shanshan thought: even if you are the most inconspicuous little handmaiden in the world, and even if no one will ever notice your presence, Ning Que and you will only have eyes for each other. At least Ning Que will always look at you.</p><br/><p>“At least in Ning Que’s heart, you are the prettiest.”</p><br/><p>She said.</p><br/><p>“I understand what you mean, but I really wanted to be truly beautiful. So when we reached Chang’an, I began to shop at Chenjinji Cosmetics Store for cosmetics even though we were earning very little.”</p><br/><p>Sangsang smiled out of embarrassement and turned to look out of the window.</p><br/><p>At that point in time, Mountain Wa was painted with multiple colors. Due to the humidity of the wind at the bottom of the mountain, the trees were still covered with fresh green leaves although it was already autumn. With the higher altitude and lower temperature, the color of the leaves changed. The trees were covered in mild yellow leaves that were similar to fresh chrysanthemum. Like rouge, there were layers upon layers, giving beauty to the mountain.</p><br/><p>“When I was young and staying at Min Mountain, I loved seeing the autumn trees, just like the ones outside the window now. I find them very pretty, but Ning Que dislikes them. He always said that when the leaves turn yellow, it means autumn is coming. The wild beasts in the mountain are either hibernating or dead, so hunting will become tougher. He also said that no matter how pretty these yellow and red leaves are, their beauty lasts only for a fleeting moment. Then they will fall off from the trees and become as useless as the mud.”</p><br/><p>Finishing the sentence, Sangsang looked at the scenery outside the window and was quiet for a long time. It was only when the mountain breeze started to cause a prickling pain in her face that she slightly narrowed her brows and sat up. She said with determination, “You like the young master, don’t you?”</p><br/><p>She was addressing him as “Ning Que” all these while, yet she had switched to addressing him as “young master” now.</p><br/><p>“Eh?”</p><br/><p>Mo Shanshan was certain that she did not mishear the words. She startled and looked at her. She did not know what to say.</p><br/><p>She knew that Ning Que and Sangsang were engaged. Yet suddenly hearing the question Sangsang asked, she could not help but panic. She subconsciously lowered her head and stared at white cotton skirt and the tip of her shoe that was not covered.</p><br/><p>Alas, the shoe was just a normal shoe. No matter how long she stared at it, it would not change.</p><br/><p>Her hair gently shivered in front of her eyes. Her eyes seemed unengaged. Her thin and red lips seemed to tighten further. She felt unreasonably anxious, then again, she was a cultured, quiet and honest Calligraphy Addict. She did not want to hide anything, especially from Sangsang. She figured that it would be useless for her to hide it anyway, so she replied with a soft “yes”.</p><br/><p>Sangsang heard the reply coming from behind her.</p><br/><p>Yet she did not turn her head. Instead, she merely smiled at the mountain, once again revealing her two dazzling white front teeth.</p><br/><p>For the past few years, Sangsang always believed herself to be ugly. Though she had a straight set of teeth, her front teeth were unusually conspicuous. Thus, she was unwilling to smile casually like the other girls in Tang.</p><br/><p>Even if she wanted to smile, she would normally lower her head and smile shyly, or smile secretly when she cheated Chen Pipi out of his bank notes, or even smile that silly smile of hers when her feet were warmed by Ning Que. However recently, though she does not know why, she began to extend her smile to reveal her two dazzling white front teeth like a cute little rabbit.</p><br/><p>She gazed at the trees by the side of the road. They were covered in red leaves and looked like trees burning in flames. She then said, “But now you can’t.”</p><br/><p>Mo Shanshan quietly looked at her skinny and frail outline. After a few moments, she smiled and said, “Yeah.”</p><br/><p>The carriage continued driving along the path on Mountain Wa. A red leaf fell from a branch onto the roof, which then rolled onto the grass patch along the path. Even though it was not crushed into the ground now, it would eventually decompose into the mud.</p><br/><p>The autumn breeze caressed Sangsang’s face as the smile on her face gradually faded.</p><br/><p>Thinking of that red leaf, she said sternly, “Wait till I am dead then.”</p><br/><p>…</p><br/><p>–</p><br/>\n</div>"}