{"title": "Chapter 578", "id": 578, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-578", "volume_title": "Volume 6", "body": "<h1>Chapter 578</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The stone statue in the hall was initially painted with gold lacquer which had flaked off over several years, revealing the stone inside. Under the dim light, it seemed merciful but horrible at the same time.</p><br/><p>Ning Que looked at one stone statue, then another. He was so into them that he forgot himself and he felt no hunger nor tiredness, with his hands constantly moving in front of him.</p><br/><p>He did not stop moving his hands until he finished observing all the four stone statues. He picked up the futon and sat down in front of the railings on the hall, facing the night of the temple, then closed his eyes and began to meditate.</p><br/><p>Unwittingly, a night passed. Autumn rain fell in the old temple again, clearing the thin fog so that sunlight at dawn could shine on the cornice of the Buddha hall.</p><br/><p>The clear and long bell from the main hall of the front temple spread to the distant rear hall.</p><br/><p>Ning Que opened his eyes, and for a moment they were like crystals, but gradually they were back to normal.</p><br/><p>Watching the autumn rain outside the railings, he raised his right arm and reached out at will.</p><br/><p>In front of the hall, the autumn wind whistled, with rain fluttering. Suddenly, in the heavy rain appeared a large blank space; there was not a single drop of rain within it. It looked quite dry.</p><br/><p>If one looked at the blank space carefully, it was exactly the shape of a palm.</p><br/><p>After a long time, the aura around the temple gradually faded away and those flying autumn rain drops finally fell on the range taken by the invisible palm. Everything went back to normal.</p><br/><p>Ning Que did not know what he had learned throughout the night until now. Looking at the heavy autumn rain out of the temple, he was inevitably excited.</p><br/><p>“Fearlessness, meditation, beating demons and dispelling ideas… I really didn’t expect that you could have a command of the four true Emblematic Gestures in Buddhism.”</p><br/><p>The faint voice of Master Qishan came from outside the temple. He was surprised.</p><br/><p>Ning Que turned around and bowed to Master Qishan.</p><br/><p>He had many things to thank Master Qishan for. Last night, when he was meditating all night, Master Qishan stayed outside the temple to keep him safe. He must thank Master’s protection with kindness.</p><br/><p>Master Qishan looked at Ning Que, feeling complex emotions.</p><br/><p>No matter how magical one’s fate with Buddhism was or how good one’s understanding of Buddhism was, it was impossible for one to master the Four True Emblematic Gestures of Buddhism overnight, because the Buddha’s Emblematic Gestures were not a skill of the Buddhism Sect and people who practiced Buddhism could not get rid of the Knowledge Barrier.</p><br/><p>However, it seemed to have no effect on Ning Que.</p><br/><p>Master Qishan felt the aura of his Younger Brother, Master Lotus, but it was fainter than yesterday. He understood the real reason why Ning Que could overcome the Knowledge Barrier.</p><br/><p>Because Lotus had gone through the Knowledge Barrier a long time ago.</p><br/><p>Master Qishan looked at Ning Que and sank in his sad thoughts, “Younger Brother, you’re leaving this world. Is it your own way to continue your existence in this world?”</p><br/><p>…</p><br/><p>…</p><br/><p>Delegations from many countries had already arrived at the Wa mountain and these days, in the meetings, they had been talking about the invasion of the Desolate to the South. Cultivators were sharing what they had learned in Wa mountain the days ago, with awe and excitement. At the same time, they guessed what kind of bigwigs would show up in the Yue Laan Hungry Ghost Festival in a few days.</p><br/><p>Ning Que and Sangsang were invited to celebrate the Yue Laan Hungry Ghost Festival but they did not care about these things. They read the sutras, observed the Buddha statue, and followed Master Qishan to watch the Buddhist skills on the walls of the temples. Their lives here were peaceful and their mood became quieter as a result.</p><br/><p>Ning Que was curious about the Yue Laan Hungry Ghost Festival so he asked Master Qishan about it. It was the grandest festival in the world and had peculiar origins, with legends about the suppression of the Underworld by the Light of Buddha.</p><br/><p>“The Buddhism Sect did not have the power to suppress the Underworld. In the earliest time, people just prayed that the night would never arrive and then strong cultivators discussed how to deal with it. However, many years have passed and the night has never arrived. The legend of the Underworld Invasion has become a hearsay. Is there any cultivator who cares about it?”</p><br/><p>Master Qishan smiled and said, “The Yue Laan Hungry Ghost Festival is held annually, but the time when cultivators gather together is not fixed. Although the meaning of this festival has changed, Buddhism doesn’t want to give up this opportunity to show itself.”</p><br/><p>“The Yuelun Kingdom claims that there are 72 Temples of Smoke and Rain in its territory and they are all famous temples. If we count those ordinary temples, I’m afraid that there will be more than a thousand temples. In addition, it is located in the Wilderness of the West, closer to the Xuankong Temple. Why didn’t the Buddhism Sect choose to hold the Yue Laan Hungry Ghost Festival in the temples of the Yuelun Kingdom, such as the White Tower Temple?”</p><br/><p>Ning Que was confused and he asked.</p><br/><p>Master Qishan asked him, “Do you know where the first great temple in the world built by the Xuankong Temple is?”</p><br/><p>Ning Que shook his head.</p><br/><p>Qishan Master pointed to the eaves of the temples under the hurdles and said, “It is here.”</p><br/><p>Ning Que was shocked and he thought, “How can it be?”</p><br/><p>Master Qishan knew what he was thinking and explained, “Because it is the nearest temple to the Xuankong Temple.”</p><br/><p>Ning Que thought that the Xuankong Temple was located in the depths of the Western Wilderness while the Lanke Temple was in the Southeast, and the coastline could be seen from the top of the Wa mountain. It was clearly the longest distance in the world between the two places. Why did Master call it the nearest?</p><br/><p>Master Qishan smiled and asked, “It was said that Buddha visited the Southeast and he sensed something when his disciples were playing chess in the mountain, so he deciden for the Lanke Temple to be built on the top of the mountain. It is because of a hidden connection between the Lanke Temple and the Xuankong Temple.”</p><br/><p>“A hidden connection” seemed to have profound meanings behind but Ning Que still did not understand.</p><br/><p>Master Qishan turned around and pointed at the rear hall, saying, “It is said that many years ago, Buddha realized the foremost skill in Buddhism to travel through spaces without obstacles, so he built a simple stone pagoda there which could help monks reach the pure land of the West.”</p><br/><p>Ning Que was shocked and he said, “I only heard that the Tang Empire military and the West-Hill Divine Palace had some special and powerful tactical array made of talismans that could convey simple information. But never did I hear of any tactical array that could transfer people to distant places. Was it the Limitless State from legends?”</p><br/><p>Master Qishan said, “There is no Tianqi in Buddhism, nor is the saying of Limitless State. But it’s imaginable that Buddha with so great power did such a thing.”</p><br/><p>Ning Que recalled the day when Sangsang and he were on Buddha’s chessboard and thought of the notes about Buddha that he had been carrying these days. He was then convinced so he asked, “What about the tactical array now?”</p><br/><p>Master Qishan smiled bitterly and said, “No matter how powerful the Buddha was, his power had already disappeared. After thousands of years, battered by wind and rain, the simple stone pagoda had become ashes. It was said that monks built a hall on the place where the stone pagoda was, which was the rear hall of the temple. There wasn’t a single trace of the Buddha.”</p><br/><p>Ning Que felt regret after listening to his words.</p><br/><p>In the face of time, it was only death that could last forever.</p><br/><p>…</p><br/><p>…</p><br/><p>The Lanke Temple owned the entire Wa mountain. The temple was huge even though it did not include the mountain. Its scale was so large that it took at least the time of burning a stick of incense to walk from the square in front of the temple to the rear hall.</p><br/><p>The ancient temple consisted of three parts: the front, the middle, and the rear. In the front part, there were a majestic and solemn front door and a square as well as two magnificent Buddhist halls. About ten halls were scattered in the middle part which covered an area comparatively small. As for the rear part, it was the smallest and the most secluded, with only one hall.</p><br/><p>The autumn rain continued. The monks in the monastery were busy preparing for the Yue Laan Hungry Ghost Festival. The delegations of various countries were still engaged in heated discussions. Cultivators were practicing with each other. The front part of the temple was full of tension, while the shadow of the sword danced jauntily in the middle part.</p><br/><p>The rear part was still in tranquility. During the spare time after studying Buddhism, Ning Que sometimes went for a walk to the halls in the middle part of the temple. They held a big black umbrella walking in the pattering autumn rain, listening to the sound of each hall, smiling without making any sound. Nobody noticed them as long as he did not want people to notice them.</p><br/><p>They went to the front part of the temple, stood in the Autumn Tree Pavilion, and watched girls from the House of Red Sleeves perform their dances. It was pleasing to see those energetic and beautiful girls dancing even when they were sweating.</p><br/><p>Watching Xiaocao directing girls with her crisp voice on stage, in the similar manner as Mistress Jian, Sangsang could not help laughing.</p><br/><p>The dance of the House of Red Sleeves prepared for the ceremony was not as glamorous as Nichang, but it was a bit more auspicious like the daughter of the Buddhism Sect. It might be very successful.</p><br/><p>Ning Que and Sangsang stood in the pavilion and watched them from afar, not meaning to meet with the House of Red Sleeves. He did not go to meet with the Tang Empire’s delegations—Xian Zhilang, Defender General of the West expressed his desire to meet through a monk in the temple, but he really enjoyed the tranquility here and did not want to be disturbed by the secular affairs.</p><br/><p>When Master Qishan explained the Buddha scriptures, he once said that Buddhism was a way of seeing the world, a method of learning; most importantly, an attitude towards life.</p><br/><p>This kind of life attitude was laughed at by the Headmaster as shutting one’s mouth,ridiculed by Lotus as pretending to be a turtle, and was derided by Second Brother as playing dead. But the unique silence of the Buddha was self-sustaining and had its own charm.</p><br/><p>Now that Sangsang was recovering from her sickness and Ning Que learned quite a lot from Buddhism, he naturally lived a peaceful and calm life here. Years later, he fondly recalled this period of time in the autumn of the 16th year of Tianqi in the Lanke Temple as the most peaceful time in his whole life; he would realize that the calmness and joy were only a soothing comfort.</p><br/><p>…</p><br/><p>…</p><br/><p>The Yue Laan Hungry Ghost Festival was on that very day.</p><br/><p>Tourists from all over the world had come to Wa mountain. The town located in front of Wa mountain was so bustling and the square in front of the Lanke Temple was so crowded that many shoes were stamped off, and it would be hard to hold the ceremony or perform in the square without the help of monks and sergeants maintaining order.</p><br/><p>Countries from the Central Plains all sent delegations to watch and perform in the ceremony, and those carriages in the parade sparked waves of cheers. Among those carriages, the House of Red Sleeves from Chang’an easily won the warmest applause and cheers.</p><br/><p>Following the parade was the ceremony where the abbot of the Lanke Temple led monks to pray for the whole world. Then a priest of the Divine Hall offered a sacrifice to Heaven and numerous believers kneeled on the ground, which was a extremely solemn scene.</p><br/><p>Ning Que and Sangsang did not go to take part in the ceremony. They stood on a high place at the rear part of the temple and looked at the excitement at the bottom of the mountain. He could not help laughing when seeing the ceremony and said, “Can these different things mix and match?”</p><br/><p>After the ceremony was over, the girls of the House of Red Sleeves began to dance.</p><br/><p>Applause and cheers from the audience in front of the temple suddenly broke through the sky.</p><br/><p>A few high-ranking old monks in the Lanke Temple looked at the beautiful girls dancing on the stage and their eyes turned wet, possibly caused by recalling their own stories from long ago.</p><br/><p>Ning Que looked at the temple and said, “After decades of separation, the old temple finally sees the dance of flying flowers. It is lucky that Lotus has died so that the Lanke Temple may pass this period of time in peace.”</p></div>\n</div>"}