{"title": "Chapter 588 - To Save or to Kill, by the Compassion of Buddha", "id": 588, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-588-to-save-or-to-kill-by-the-compassion-of-buddha", "volume_title": "Volume 6", "body": "<h1>Chapter 588 - To Save or to Kill, by the Compassion of Buddha</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter588tosaveortokillbythecompassionofbuddha\">Chapter 588: To Save or to Kill, by the Compassion of Buddha</h3><br/><p><strong>Translator:</strong> Transn <strong>Editor:</strong> Transn</p><br/><p>This is trust.</p><br/><p>Ning Que believed in the Academy, and his Senior Brothers. Faced with such a grim and desperate situation, he had been waiting for his Eldest Brother to discover what was wrong with the Lanke Temple, and to rescue both himself and Sangsang. He knew that once Eldest Brother found out that the situation had changed, he would immediately rush over. Naturally, the earlier conversation was just aimed at stalling for time.</p><br/><p>If Eldest Brother could not make it in time, then to resolve everything he had to get to the root of it all; he had to do whatever it took to kill Master Boshu, who held the Yue Laan Bell. Only after that he could escape from the Lanke Temple.</p><br/><p>He glanced at the big black umbrella overhead, made sure that the umbrella could withstand the Light of Buddha for a while longer and he said, “By the compassion of Buddha, the cure surely isn’t limited to the sole method of killing.”</p><br/><p>Master Qishan spoke, “Indeed, I will impart her with Dharma, not only to diminish her essence of hostility, but instead I hope it will balance out the Yin and Yang within her body so that it can reach a peaceful and stable state. Afterwards, according to the wishes of the Headmaster and the outcome of my discussion with Mr. First, we shall find a way to hide Sangsang once her mastery of the Dharma deepens.”</p><br/><p>Ning Que asked: “Hide her?”</p><br/><p>Master Qishan said, “This is the only way to avoid detection of the mark of the Underworld within her when Yama’s gaze sweeps through our world.”</p><br/><p>Ning Que said, “Isn’t that the same as keeping her prisoner for life? What is the difference between that and taking her life then?”</p><br/><p>“There is no need to imprison her for life.”</p><br/><p>Master Qishan said, “Since Haotian consists in 70,000 worlds, even if Yama’s power could rival the heavens, as long as his avatars in each of those worlds do not actively signal to him, manually searching each and every one of those worlds would take a very long time. When Yama’s gaze lingers in another world, Sangsang would then naturally be able to come out.”</p><br/><p>Cheng Ziqing was not convinced, “The Heaven’s Way is unfathomable. Mere mortals such as ourselves cannot hope to grasp the consciousness of Haotian and Yama. So how are we going to know when Yama averts his gaze?”</p><br/><p>Master Qishan explained, “The Great Priest of Revelation that visited Chang’an last year foresaw that in three years Sangsang would appear in the West-Hill Divine Palace. Sangsang’s forthcoming awakening is proof that within the coming two years, Yama would gaze upon our world.”</p><br/><p>Ning Que remained silent. He originally meant to stall by asking these questions, not expecting Master Qishan to actually come up with a plan to deal with Yama. However, what Master Qishan said made a lot of sense, and now he could not help but feel conflicted about the whole situation.</p><br/><p>“Nevertheless, there is nowhere in the human realm that escapes Yama’s gaze”, said Master Boshu in a serious manner.</p><br/><p>Master Qishan’s hand slowly rested upon the chess board in front of him. He responded calmly, “Such a place exists.”</p><br/><p>Ning Que stared at the peculiar chessboard that was neither chess nor a stone game. Thinking back about the time spent in the world within the chessboard, his mood changed again.</p><br/><p>Master Boshu responded after a moment of silence, “Although this is a mystical artifact left behind by Buddha, I still remain doubtful that it can get past Yama’s gaze. Uncle, you truly underestimate these beings from a higher plane of existence.”</p><br/><p>“To underestimate Yama… how foolish.”</p><br/><p>Master Qishan flipped over the chessboard before him and calmly said, “It is not Yama’s gaze that I want Sangsang to hide from, instead, it is… time.”</p><br/><p>“Time?” Ning Que asked.</p><br/><p>“Correct, it is indeed time.”</p><br/><p>Master Qishan spoke to the crowd before him, “I believe you have all heard of the legend of the Lanke Temple, only that no one took it seriously enough. Even someone like Ning Que would have subconciously forgotten about it.”</p><br/><p>“This chessboard that was left behind by Buddha is able to manipulate the flow of time. The front delays time, the back accelerates it. If you accessed the chessboard from the back, an instant inside would have lapsed years of time outside.”</p><br/><p>Master Qishan continued, “The idea is to turn two years into an instant and within these two years Sangsang would effectively vanish from this world. As such, there would be way for Yama to find her.”</p><br/><p>Upon hearing this, everyone went quietly with shock. Never did they imagine that someone could have come up with such a plan. But what astonished them even further was how he showed no fear to the arrival of Yama’s Daughter, and even dared to engage Yama in a battle of wits! Such confidence was incredible.</p><br/><p>The master added, “While the method seems to make sense, it has never been attempted before hence it comes with many risks. However, as we are dealing with Yama’s Daughter, it is a risk we are bound to take.”</p><br/><p>“The only way is the best way…”</p><br/><p>Ning Que recalled this famous Academy’s motto and understood who was the person who was capable of coming up with such an extraordinary method; a person who was also willing to go against the almighty Yama in order to help Sangsang. At this point he could almost feel tears rolling down.</p><br/><p>Master Qishan turned to Ning Que and said, “The Headmaster came up with this plan, and we decided to give it a try. However, due to the severe consequences, we mentioned it to no one. We even kept it a secret from you and Sangsang before you both entered the chessboard, in order to ensure your safety.</p><br/><p>Ning Que understood, “If people knew that Sangsang was the Daughter of Yama, there was no way they would resolve the situation the way you and the Headmaster came up with. The only thing they would be thinking about would be how to end her.”</p><br/><p>“Indeed.” Looking at Master Boshu, Master Qishan let out a long sigh. “But who could have known that someone would leave the Xuankong Temple with the peace bell, and cause this mess we are in.”</p><br/><p>Master Baoshu knew what he meant and said, “Uncle, I followed the doctrine of the Xuankong Temple.”</p><br/><p>With his reply, Master Qishan’s wrinkles grew even more pronounced. Looking out of the hall and staring at the walls of the temple that seemed to flow with the contours of the mountain, he started to look worried.</p><br/><p>Quni Madi suddenly lashed out, “How can you be sure that this method that no one has ever tried will work out? The Headmaster is playing a dangerous game with Yama. He might have the confidence but the fate of the world is at play! Why should the rest of the world be a part of his gamble?”</p><br/><p>Master Qishan remained silent. Before he set his mind to treat Sangsang’s illness, he already knew of the backlash that would take place if people knew of his plans. It was obvious that the path ahead was not easy and would be full of doubt and reproach from others.</p><br/><p>Master Boshu chanted the name of Buddha, and said harshly, “All living things are equal, the Headmaster is but one of them. What right does he have to force everyone to take this risk with him? The Daughter of Yama must die!”</p><br/><p>Master Qishan replied, “By the words of Buddha, all living things are equal. Sangsang is also a part of it so why must she die if she has neither sinned nor wronged?”</p><br/><p>Master Boshu said, “Being Yama’s Daughter is already an original sin. Even if she were to pay penance, practice Dharma an adopt a life of kindness, once she awakens to her lineage, it would be a crime against the entire world!”</p><br/><p>Ning Que looked up at the big black umbrella once again.</p><br/><p>The grease and dirt on the surface of the umbrella were cleansed and eroded away by the Light of Buddha, revealing the pure black fabric beneath. A tiny ray of light slipped through the seams on the umbrella and fell upon Sangsang’s shoulders.</p><br/><p>Sangsang felt as though a knife was plunged into her body. Despite turning pale from the pain, she clenched her teeth and did not let out a single sound. Ning Que could only imagine the pain as he felt her body stiffen while carrying her.</p><br/><p>The big black umbrella became thinner and thinner, almost reaching its limit.</p><br/><p>Ning Que still needed it to last a while longer, Eldest Brother had yet to arrive.</p><br/><p>He looked at Master Qishan and said, “It would appear that we no longer have the opportunity to learn the ways of Dharma from you. This disease also has no cure in sight. It was as you expected, the world lacks true compassion.”</p><br/><p>He turned to Sangsang and asked, “Are you hanging in there?”</p><br/><p>Are you still able to hold the umbrella, still able to carry on?</p><br/><p>Sangsang weakly murmured an affirmation.</p><br/><p>Master Qishan sighed, “The world is vast, yet you are welcomed nowhere. Where do you plan to go from here?”</p><br/><p>Ning Que said, “Back to the Academy.”</p><br/><p>The master said, “The Academy will surely accept you, but what about her? Before her lineage was revealed, the Academy could protect both of you and treat her illness in secret. But now?”</p><br/><p>Ning Que went quiet, unsure of what to do. There was no way he could bring harm to the Academy.</p><br/><p>Master Boshu spoke, “The issue now though, is that neither of you are leaving.”</p><br/><p>As soon as he finished, a flurry of footsteps could be heard outside of the temple. The back doors to the Lanke Temple were thrust open. The cultivators who realized something was wrong were blocked out of the temple by temple monks while 68 monks clad in yellow robes made their way in. The monks split themselves into teams of four and sat upon the stone pedestals before the temple sanctum.</p><br/><p>The sound of chanting reverberated through the temple and an aura of solemn Buddhist compassion enveloped the entire Lanke Temple. As the great bells of the 17 halls tolled once again, the tactical array of Buddha’s Light grew stronger and stronger.</p><br/><p>Master Qishan looked at the Lanke Temple’s abbot who knelt outside the temple doors and seemed to have grasped what was going on. Despite wanting to reprimand his unfilial disciples, all he did was to let out a long and painful sigh.</p><br/><p>After all, Master Boshu was the president of the Commandment Yard of the Xuankong Temple and all of the Buddhist disciples held him in the highest regard. These few days of seemingly locking himself in his meditation room were actually just a cover for him to easily take over the Lanke Temple.</p><br/><p>Monk Guan Hai knelt behind Master Qishan, to support his teacher who was on the verge of collapse. The grief and anguish on his face was evident, as he looked at the disciples of Buddha sitting on the stone pedestals outside of the temple sanctum.</p><br/><p>Master Boshu spoke with indifference, “Uncle, if you choose not to betray the way of Buddhism, to be laden with the great sin of the destruction of the world, then today you shall not interfere.”</p><br/><p>Upon saying this, this great monk of the Xuankong Temple frowned as though he felt some form of pain. At the same time, his luminous eyes lost some of its luster, as though some Dharma had left them.</p><br/><p>Ning Que was not prepared in their last encounter and allowed Boshu to shake his copper bell. However, this time around, there was no way he would even give his opponent the chance to do so. He also deduced that using such a mystical Buddhist artifact would take a heavy toll on Master Boshu, which meant that Boshu’s actual combat strength would decrease. Hence, Ning Que observed and waited, waiting for the moment when Master Boshu would use the bell’s powers once again, for that would be the time to strike.</p><br/><p>Just as he caught a glimpse of Boshu’s furrowed brow, Ning Que stuck his blade into the ground before him and drew his metal bow instantly. The arrow fired at Boshu flew at an unimaginable speed.</p><br/><p>The silent iron arrow pierced through the air and arrived before Boshu in the blink of an eye.</p><br/><p>Standing in front of the Primordial Arrow, strong enough to disregard space itself, it was impossible for anyone to evade unless it was someone like Long Qing who had plenty of experience with it, or a talented fighter with great instincts such as Ye Hongyu.</p><br/><p>Master Boshu thought himself prepared enough for the legendary Primordial Thirteen Arrows of the Academy. However, never could he have imagined the deadliness and terror that the arrows possessed.</p><br/><p>The Xuankong Temple’s great sage had no time to change his facial expression, constrict his pupils, to be afraid or even react in any possible way.</p><br/><p>The bell in his hand was the only thing that was able to react.</p><br/><p>The copper bell went beyond the concept of time as it sensed the danger from the approaching arrow, disappearing from Master Boshu’s fingers and instantly reappeared before the arrow.</p><br/><p>The Yue laan Bell left behind by Buddha had miraculous properties that truly exceeded the level of cultivation achievable in the current realm.</p><br/><p>The iron arrow struck the copper bell with grim accuracy.</p><br/><p>Alas, it did not even leave a scratch on the bell.</p><br/><p>No matter how powerful the Primordial Arrow may be, it was still just the cumulative wisdom of the disciples from the Academy. At least for now, it couldn’t match the mystical artifact left behind by Buddha.</p><br/><p>Another important reason why the iron arrow couldn’t leave but a scratch on the copper bell was that the arrowhead wasn’t sharp, but instead consisted of a small round metal canister.</p><br/><p>The canister was intensely compressed and exploded because of the massive impact.</p><br/><p>A loud boom!</p><br/><p>Countless sharp fragments shot out with a terrifying whoosh, straight at Master Boshu.</p><br/><p>When the copper bell blocked the iron arrow, Boshu’s inner zen was greatly shaken. Although in pain, in this time of danger, he demonstrated his strength as the great sage of the Xuankong Temple. In such a short span of time, he recited the nine Jingang scriptures in his heart and placed nine layers of protective Buddhist aura in front of him.</p><br/><p>Most of the shrapnel was blocked, but there were still some that managed to reach Boshu before the protective aura was thrown up. His entire body was instantly covered in blood.</p><br/><p>Ning Que’s speed in combat was second to none. Almost simultaneously as his arrow was shot, he realized that it would be difficult for the Primordial Thirteen Arrow to penetrate through the copper bell’s defenses in so little time. Slinging back his bow and grabbing hold of his blade, he shot forward along with the arrow without a second thought.</p><br/><p>The Great Spirit enveloped every inch of his body. Every fiber of his muscles became hard as stone, every step he took sprayed gravel and left a hole in its wake.</p><br/><p>This was the first time Ning Que released his full strength without reservation while in his demonic trance, pushing his body to the absolute limit. With it, he gained a terrifying speed that was unimaginable.</p><br/><p>As he thrust himself toward Master Boshu, he could still feel the residues from the iron arrow’s explosion.</p><br/><p>With a strike as ferocious as a wild beast, his blade went straight for Boshu’s face, the light gleaming off the edge of the blade as bright as the blazing sun.</p><br/><p>Master Boshu shut his eyes tight and with outstretched hands attempted to recall his copper bell.</p><br/><p>The sound of clashing metal reverberated.</p><br/><p>The razor sharp blade cut through the aura surrounding Master Boshu like paper. In an instant 6 layers of the protective aura were cleaved away.</p><br/><p>Boshu spewed blood as he fell to the ground. However, he pushed against the floor with his palm and jolted back up straight as he shook his copper bell.</p><br/><p>As the crisp and clear sound of the bell sounded, the 17 ancient bells of Lanke Temple rang out once more. The statue of Buddha that sat atop of the Tile Mountain radiated light that penetrated through the forest, into the temple sanctum at the foot of the mountain. The Light of Buddha that fell onto the big black umbrella was further intensified!</p><br/><p>Under the umbrella, Sangsang grew paler still and coughed up more blood. All of her strength had left her as she leaned weakly on Ning Que’s back, as though she could faint at any time. However, despite such adverse conditions, she still held onto the umbrella’s handle tightly.</p><br/><p>Master Boshu attained a very advanced state of cultivation, with a deep understanding of the ways of Dharma. Against Ning Que’s attacks driven with recklessness, he could have used his copper bell as a weapon and put up a good brawl. In that case, even if he lost the opportunity to strike first he could still recover from it, rather than being thrown into such a dangerous situation like he was right now.</p><br/><p>However, only one thought dominated him at this moment; he shall not give Ning Que any opportunity to take Sangsang away from here. Sangsang absolutely must die right here, right now.</p><br/><p>For this very purpose, he would not hesitate to sacrifice himself.</p><br/><p>…</p><br/>\n</div>"}