{"title": "Chapter 582 - A Pebble", "id": 582, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-582-a-pebble", "volume_title": "Volume 6", "body": "<h1>Chapter 582 - A Pebble</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Lu Chenjia felt that her face was a little damp and cold.</p><br/><p>She reached out to wipe her face and felt blood on her hand.</p><br/><p>Looking at her bloodied hand, she felt a little lost. A smile touched her pale face as she slowly reached out to cup her face in her hands. Then, she started crying.</p><br/><p>Her tears and blood dripped through the gaps between her fingers.</p><br/><p>She cried in anguish, not because of the wounds on her face and the possibility that she might be disfigured. She cried because she realized that it was difficult for her to seek revenge for Long Qing against Ning Que.</p><br/><p>Those in the Buddhist temple watched the Flower Addict as she covered her face and cried tears of blood. They looked in shock at the sunken ground caused by Master Boshu’s Emblematic Gesture and at Ning Que who held his blade silently.</p><br/><p>The Academy was greatly respected in the cultivation world because of the powerful Headmaster. It was also because of the legendary Mr. First and Mr. Second. However, not many thought that Ning Que was very powerful.</p><br/><p>From the Tao Addict and the Calligraphy Addict, they heard that Ning Que was the weakest World Wayfarer from an Unknown Place in history. Everyone agreed.</p><br/><p>Even though he had battled and killed Xia Hou last winter, the powerhouses in the cultivation world thought that it was mainly due to the fact that General Xia Hou had been previously injured by Tang, the wayfarer of the Devil’s Doctrine. Furthermore, the Lady of Light’s performance in the battle was simply too astonishing.</p><br/><p>This had nothing to do with understanding or talent.</p><br/><p>To others, Ning Que had only been in the Academy for a few short years. Even if he had encountered several Lucky Chances and entered the Knowing Destiny State, it had just happened a short time ago. They thought he was no match for a high monk from the Xuankong Temple, who possessed strong Buddhist powers. Furthermore, before he retreated, he had already injured Quni Madi heavily and slashed the Flower Addict’s face.</p><br/><p>The Flower Addict was most renowned for her beauty amongst the three addicts, but Ning Que had done such a vicious thing. Everyone in the temple was shocked by the power that Ning Que had revealed and also grew afraid because of his cruelty.</p><br/><p>Ning Que did not care what others thought.</p><br/><p>The rules in the Academy were simple. Other than the hardness of one’s fist, what mattered the most was equality. If you wished to kill me, then I have to kill you. If someone wished to kill Sangsang, Ning Que would kill. If not for Master Boshu’s strong Buddhist Emblematic Gesture, his blade would have sliced Lu Chenjia’s head off instead of just scratching her.</p><br/><p>“Why is the Xuankong Temple interfering in the Academy’s matters?”</p><br/><p>Ning Que looked at Master Boshu. He had grown leery from the moment he saw the Buddhist palanquin at the Wa mountain. He knew of the relationship the Buddhism Sect had with the Yuelun Kingdom. However, he just did not know how far the other party would take things.</p><br/><p>Master Boshu looked at him silently, his gaze landing on Ning Que’s left hand which was at his waist.</p><br/><p>When he had used the Emblematic Gesture earlier, Ning Que’s left hand had been shaped like a bird’s beak.</p><br/><p>It was the bird’s beak gesture that had reduced the pressure of the Emblematic Gesture.</p><br/><p>Master Boshu did not know where Ning Que had learned that gesture and guessed that it was a powerful move taught by the Academy. However, he did not understand why Ning Que seemed to have a great understanding of the Emblematic Gestures of the Buddhism Sect.</p><br/><p>Master Boshu’s silence, however, implied something else to the others in the temple.</p><br/><p>Quni Madi cradled Lu Chenjia in her arms and looked at the blood flowing on her face. She thought of her son who had died miserably in Chang’an, and her expression turned vicious.</p><br/><p>She stared hatefully at Ning Que and screamed hoarsely, “You beast! You killed Master Dao Shi from the Xuankong Temple, and hurt Chen Jia. The Yuelun Kingdom will punish you! Buddha will not let you off either!”</p><br/><p>Everyone in the temple remained silent. They all knew that the battle between Master Daoshi of the Xuankong temple and Ning Que, in the morning streets of Chang’an, also represented the battle between the Buddhism Sect and the person representing the Academy in entering the human realm. No matter what, Ning Que was not to blame for it. However, they all knew why Quni Madi was in such pain.</p><br/><p>“I will kill you if you try to kill me.”</p><br/><p>Ning Que said, “Long Qing had turned his back against Haotian and everyone knows that the West-Hill Divine Palace had issued an edict. However, Princess Chenjia had attempted to murder the Lady of Light, so I have punished her on behalf of the Divine Hall. Is there any problem with that?”</p><br/><p>Everyone in the temple turned toward Priest Cheng Lixue who was here on behalf of the West-Hill Divine Palace.</p><br/><p>Cheng Lixue looked calm and was silent. Disregarding the fact that the Flower Addict had committed a taboo, Ning Que was the future husband of the Lady of Light. The Divine Hall would not say anything.</p><br/><p>Ning Que looked at Quni Madi and said, “As for Dao Shi dying in my hands, you just have to act if you want to take revenge for your illegitimate son. Why do you have to drag the Buddhism Sect and Yuelun into it? I would want to find out if Buddha will punish me, or you, an old nun with no religious discipline.”</p><br/><p>Master Boshu’s expression froze when he heard that.</p><br/><p>Ning Que looked at him and repeated his question, “Is the Xuankong Temple really going to interfere with this matter?”</p><br/><p>“Buddha is benevolent, and the Xuankong Temple honors this. For decades, we have not partaken in matters of the secular world. I should not interfere with the grudge between Princess Chenjia and you.”</p><br/><p>Master Boshu’s expression grew solemn and his voice rang like a bell. He said, “However, Mr. Thirteen has dabbled in diabolism, so the Xuankong Temple cannot disregard this. I have seen it with my own eyes, so how can I disregard this?”</p><br/><p>Everyone in the temple looked at Ning Que’s feet with an odd look on their faces when they heard that.</p><br/><p>Ning Que had only noticed then, that there were several broken pebbles at his feet. There were grey spots at the waist area of his black Academy uniform, and judging by their color, were left behind by the rocks on impact.</p><br/><p>He had only recalled then, that Master Boshu’s Buddhist Emblematic Gesture was a little special. His right hand was outstretched flat, with his index finger slightly curled as if he was flicking at pebbles. He was actually flicking pebbles then.</p><br/><p>A cultivator’s physical body was as fragile as any ordinary person. Even powerhouses in the Knowing Destiny State could be sliced open at the stomach easily by a hunter. Of course, that was only if the powerhouse did not retaliate first.</p><br/><p>There were only two kinds of cultivators who could shatter a hard rock with their own bodies. In the earlier battle, no one had sensed that Ning Que had used his Psyche Power to call on the Qi of Heaven and Earth to protect his body. This naturally meant that rumors of him studying Talisman and martial arts together were not true. At the same time, it also proved that he had cultivated in the methods of the Devil’s Doctrine which were unacceptable in this world!</p><br/><p>It was dead silent in the Buddhist temple. No one spoke, and no one knew what to say at this time.</p><br/><p>Cheng Lixue looked at Ning Que in shock. It was said that Taoism and Diabolism could not exist at the same time and space. As the Grand Master of the West-Hill Divine Palace’s Revelation Department, he should stand up in anger and slice down at Ning Que with a Taoist Sword upon discovering that he had joined the Devil…</p><br/><p>However, Ning Que was not an ordinary person. He was Mr. Thirteen of the Academy, and was a core disciple of the Headmaster.</p><br/><p>Not to mention Cheng Lixue, even if the Hierarch Lord were present, he would find this situation difficult to deal with.</p><br/><p>Cheng Lixue’s mind was in a jumble. He wanted to stand up, but did not want to at the same time. He did not know what to do at all. It was then, when he suddenly saw Sangsang and calmed down, feeling extremely lucky.</p><br/><p>The Lady of Light was there, so it wouldn’t be up to him to represent the West-Hill Divine Palace’s interest in the matter. The Lady of Light had an intimate relationship with Ning Que, and would not punish him on behalf of the Divine Hall. So what did it have to do with him?</p><br/><p>After ascertaining that Ning Que had joined the Devil, the Buddhist Temple descended into silence for a long while. However, someone would eventually speak up about how they felt about the situation. And that person’s attitude was determined and strong.</p><br/><p>Aunt Quni Madi laughed out loud while coughing up blood. Her laughter was lively and maniacal. She looked at Ning Que and yelled shrilly, “I would like to see if Buddha can accept you!”</p><br/><p>Ning Que looked at Master Boshu in silence. He thought that the Xuankong Temple was indeed a legendary Unknown Place. The chief monk was indeed powerful, being able to surreptitiously flick that stone onto his uniform.</p><br/><p>Following that, he understood that what had happened today was a plot set by the high monk from the Xuankong Temple. Otherwise, no one would do what he did in such an intense battle.</p><br/><p>Recalling what his teacher had advised repeatedly, he shook his head. The Headmaster had once told him that after Youngest Uncle had cultivated in the Great Spirit, he had not allowed his enemies to touch him again. That was why even if every cultivator in the world had guessed that his Youngest Uncle had joined the Devil, no one dared to point it out.</p><br/><p>Ning Que had hunted and chopped firewood since he was a child and had a habit of using short distance combat techniques. That was why it was easy to forget his teacher’s advise. Furthermore, after entering the Knowing Destiny State, he had gotten a little over-confident and did not expect to be caught by the monk from the Xuankong temple.</p><br/><p>However, so what?</p><br/><p>Youngest Uncle had joined the Devil, and the world knew but dared not mention it. While he was not as powerful as his Youngest Uncle then, he had areas in which he was even stronger than his Youngest Uncle. Would he be afraid of these people?</p><br/><p>“I am not a Buddhist, so I do not need to worry about whether Buddha will accept me.”</p><br/><p>Ning Que looked at Quni Madi and said, “Furthermore, have I joined the Devil just because you said so? Is there such logic in the world?”</p><br/><p>Quni Madi froze slightly as if she had not anticipated that Ning Que would talk about logic in such situation, without even batting an eyelid. She yelled angrily, “Everyone in the temple saw it!”</p><br/><p>“Is it true just because you’ve seen it?”</p><br/><p>“The Great Divine Priest of Light had such great eyesight, but he still saw wrongly.”</p><br/><p>“Furthermore, even if it was true… No, there’s no further. Anyway, I will not admit it.”</p><br/><p>He stared into Quni Madi’s eyes and said mockingly, “How can you prove it?”</p><br/><p>Then, he turned to look at everyone else in the temple and asked, “How can you all prove it?”</p><br/><p>He shook his head and said, “If you want to prove it, come and fight me. Who is to say that my leg might not be pierced by your swords? Who would foot my medical bills then?”</p><br/><p>Master Boshu said after a pause, “Is this a threat?”</p><br/><p>Ning Que said, “You may choose to understand it this way.”</p><br/><p>Quni Madi yelled, “How could the Academy teach a shameless person like you?!”</p><br/><p>Ning Que said, “I am indeed good at being shameless, in fact, I hold first place in shamelessness in all the Academy. Not even Youngest Uncle back in those days can beat me. That is why you should not do such meaningless things.”</p><br/><p>“The Academy is still as arrogant as before.”</p><br/><p>Master Boshu suddenly laughed. He looked at Ning Que and said, “However, I do not know what is considered meaningful to the Headmaster and to the Academy.”</p><br/><p>Master Qishan who had been sitting on the futon silently all this while suddenly grew wary. He looked up at Boshu, his eyes flashing with a warning.</p><br/><p>“Does the Underworld Invasion count?”</p><br/><p>However, Boshu ignored Master Qishan’s gaze, but turned to Ning Que, his smile fading, shouted to him with solemity: “You are the Son of Yama, aren’t you?”</p></div>\n</div>"}