{"title": "Chapter 592 - Tendrils", "id": 592, "volume": 6, "url": "http://boxnovel.org/nightfall-chapter-592-tendrils", "volume_title": "Volume 6", "body": "<h1>Chapter 592 - Tendrils</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>As Buddha’s spirit continued to stream into the Yue laan Bell, Master Boshu’s pupils grew darker and darker. He spat out a mouthful of blood and could no longer shake the bell. He placed the bell in a pool of blood beside his severed arm.</p><br/><p>The crisp ringing of the bell disappeared, but Buddha’s power remained. The 17 bells scattered around the Lanke Temple continued to ring and the Light of Buddha continued to shine on the black horse carriage.</p><br/><p>Sangsang’s face grew paler, and her brows were tightly knit. It was evident that she was in great pain as a stream of black-colored blood flowed from her lips and splattered on her chest.</p><br/><p>Ning Que was certain that even if Sangsang weren’t ill and could fight together with him and Mo Shanshan, they would still be unable to defeat Qi Nian. That was why he could not understand why Qi Nian had attempted to kill them.</p><br/><p>“You can kill us now, allowing us to die quickly.”</p><br/><p>He looked at Qi Nian and said.</p><br/><p>Qi Nian shook his head slowly and looked at the Light of Buddha shining upon the black horse carriage.</p><br/><p>Ning Que understood his intent. It was not him who wanted to kill Sangsang, but Buddha.</p><br/><p>“Doesn’t Buddha think that this is cruel?”</p><br/><p>Ning Que looked toward the distant peak of Tile Mountain where the stone statue of Buddha sat in the clouds.</p><br/><p>Master Boshu who was sitting in a pool of blood chanted a Buddhist chant. He said, pale-facedly, “Cruelty is also benevolence.”</p><br/><p>Ning Que said, “The benevolence of others is an act of cruelty to us?”</p><br/><p>“Hypocrites.”</p><br/><p>On the back temple of Lanke, two voices suddenly rang. They said the exact same word. And when the two voices rose, the bells responded, as if they were shocked.</p><br/><p>Ye Su was wearing a thin shirt and carrying a sword; Tang wore a leather robe and an indifferent expression as he calmly walked out from a pile of stones in front of the temple. Not a single monk dared to stop them.</p><br/><p>Ye Su reached the stone steps before the temple and looked at Master Boshu. He said, “Killing is killing. If Buddha kills someone, it is also killing. Where does the benevolence come from? The Buddhism Sect is indeed not Taoist. It has lost the true heart of it.”</p><br/><p>Qi Nian did not seem to be surprised at the appearance of Tang and Ye Su. He was just as calm as before.</p><br/><p>Cheng Lixue emerged from the corridor and knelt before Ye Su.</p><br/><p>Ye Su did not even look at him; he stared at the black horse carriage instead. He looked at the girl Ning Que carried on his back and his expression turned odd, “It is indeed transparent.”</p><br/><p>Master Boshu knew who he was, so he smiled with difficulty and said, “Since Buddha is a hypocrite, Mr. Ye can do the killing.”</p><br/><p>Ye Su shook his head and said, “You monks do not dare to act and only hope that the Light of Buddha will descend upon earth to kill Yama’s Daughter. You are all concerned that if you killed Ning Que, you cannot account for it when facing the Academy.”</p><br/><p>Master Boshu pressed his left hand to his right shoulder where his arm had been cut. A smile appeared on his pale face as he said, “The Buddhism Sect has always remained silent and tolerant. Indeed, we do not wish to offend the Academy. Could the Haotian Taoism Sect be afraid of the Academy as well?”</p><br/><p>Ye Su answered, “This is Haotian’s world, and the Haotian Taoism rules the world. What is there to be afraid of? It is just… if the Buddhism Sect can use benevolence as a shameless excuse, then I can have my own reasons not to act.”</p><br/><p>Master Boshu asked, “May I ask for the reason, Mr. Ye?”</p><br/><p>Ye Su glanced at Ning Que and said, “My younger sister is close to him.”</p><br/><p>Master Boshu had not expected the proud and cold World Wayfarer of Haotian Taoism would learn such methods from him. He paused and said, “It is indeed a good reason.”</p><br/><p>Then, the master looked at the strong man in leather clothes and said, “Why has the Devil Doctrine’s Wayfarer come?”</p><br/><p>Tang said expressionlessly, “I’ve come to watch.”</p><br/><p>Master Boshu asked, “Watch what?”</p><br/><p>Tang answered, “I’ve come to watch how you people of the Central Plains kill.”</p><br/><p>Master Boshu said with a smile, “Even though the Devil’s Doctrine has been shunned, it is still a part of this world. You were still willing to come before the world is destroyed, so I’m sure you wanted to play a part. So why don’t you do it? If you kill the Daughter of Yama, I’m sure you’ll become a Buddha immediately.”</p><br/><p>Tang glanced at Ning Que and said, “I have to kill Ning Que if I want to kill Yama’s Daughter. But my younger sister is close to him, too. Furthermore, I have heard that my younger sister has an even better relationship with the Daughter of Yama.”</p><br/><p>Master Boshu sighed and said, “Then why have you come?”</p><br/><p>“Because they are all hypocrites. Even though they want to kill Sangsang, they do not wish to kill me and offend the Academy. Even though they are the World Wayfarers of Taoism and Diabolism, they are still afraid of the Academy,”</p><br/><p>Ning Que said from the black horse carriage. He looked at Ye Su and asked, “How does Haotian Taoism view this matter?”</p><br/><p>Ye Su shook his head and said, “I do not know.”</p><br/><p>Ning Que asked, “Do you believe in it?”</p><br/><p>Ye Su looked at the bright Light of Buddha above the black horse carriage and answered, “I have to believe in it.”</p><br/><p>“Don’t you think that this is really weird?”</p><br/><p>Ning Que looked into his eyes and asked, “The Buddhism Sect discovered the daughter of Yama, but Haotian Taoism seemed not to know anything about it. Even if the West-Hill Divine Palace was not powerful enough to know, what about Zhishou Abbey? Furthermore, don’t forget, Sangsang is the Lady of Light of Haotian Taoism. How did she suddenly become the Daughter of Yama?”</p><br/><p>He said these very quickly and clearly, without extreme fluctuations in his emotions. However, those who heard him all understood his intentions and had to consider the intent behind his words.</p><br/><p>Ye Su thought about it and shook his head, saying, “I don’t understand.”</p><br/><p>Ning Que did not give up. He looked at Tang and asked, “How has the Academy treated you guys?”</p><br/><p>Tang replied, “If we discount the fact that Mr. Ke tried to vanquish the Enlightenment Doctrine, the Academy has treated us rather well.”</p><br/><p>Ning Que smiled helplessly and then continued, “The Enlightenment Doctrine worships Yama.”</p><br/><p>Tang looked at Sangsang who was behind him. After a slight pause, he said, “Worshiping does not mean believing. Often times, it’s fear.”</p><br/><p>Ning Que said, “So none of you will help me.”</p><br/><p>Tang said, “I won’t help them either.”</p><br/><p>Ye Su said, “If the mute cannot stop you, I will still act on it.”</p><br/><p>Ning Que relaxed when he heard Ye Su and Tang’s replies. He loosened the hold on his iron bow and untied the string. He cradled Sangsang to his chest and held up the big black umbrella, sitting under the Light of Buddha.</p><br/><p>An abbey, a temple, a sect, the Second floor.</p><br/><p>There were four Unknown Places in this world, and four World Wayfarers. They were gathered in the Lanke Temple today, and Ning Que was, undoubtedly, the weakest amongst them.</p><br/><p>In this situation, even if he gained the battle intent of his Youngest Uncle, he would not be able to escape with Sangsang. That was why he relaxed and hugged Sangsang, holding the big black umbrella… Even though he knew that the big black umbrella might not last for too long, he could only wait silently for a change to occur.</p><br/><p>It was then, when Elder Qishan slowly stood up and walked to the front of the temple with the help of monk Guan Hai.</p><br/><p>The Elder’s position in the cultivation world was very high. He was of equal status as the abbey dean of Zhishou Abbey and they considered each other friends. That was why both Ye Su and Tang had to turn slightly as a show of respect.</p><br/><p>Master Qishan ignored the two powerful World Wayfarers. He stared at Qi Nian with several contrasting feelings, and said, “So this was all planned by you.”</p><br/><p>Qi Nian did not speak, his expression was serene.</p><br/><p>Master Qishan swayed, and he seemed to grow even older. He said sadly, “You made an agreement with Mr. First to heal the Daughter of Yama. That is why things were unfolding favorably. But who would have thought that a disciple of Buddha would break his promise!”</p><br/><p>“No wonder Boshu could take the cleansing bell with him from the Xuankong Temple, and no wonder there were so many people here at Lanke Temple today. No wonder everyone knew the girl was the Daughter of Yama within seconds.”</p><br/><p>“I could have healed her,” Master Qishan sadly said, as he looked at Qi Nian. “And you promised Mr. First to allow me to treat her. But in the end, you could not give up your obsessions and had to kill her. But have you considered that you could trick everyone before you started lying? When you began your lies, how did you manage to lie to Mr. First?”</p><br/><p>Ye Su listened to the bells in the Lanke Temple and he looked at the Buddhist big tactical array above the temple, deep in thought.</p><br/><p>He turned around to look at Qi Nian, saying, “How could this be explained with a mere obsession? All of this started during that conversation you had with Mr. First in Chang’an, last winter in the forest by the lake, right?”</p><br/><p>Qi Nian did not speak.</p><br/><p>“While Mr. First appears to be slow, he is extremely intelligent and can predict what will happen. Therefore, you plotted but did not act since last winter, until Ning Que and the girl came to the Lanke temple. What you wanted was the Light of Buddha and this big tactical array, because you knew that even if Mr. First discovers any changes now, he wouldn’t be able to enter the temple to stop you.”</p><br/><p>Ye Su looked at Qi Nian and slowly shook his head. It was unclear whether he was praising him or pitying him. He said, “I did not expect that another great schemer would appear in the Buddhism Sect after Lotus. It is such a pity, indeed worthy of respect as well.”</p><br/><p>In the south of Chang’an, at the back of the Academy’s mountain.</p><br/><p>Clouds floated before the precipice and the frigid autumn winds soared up the cliff. Before the precipice, the stream of clouds shattered, and the autumn winds moved by the cliffs. The dried wisteria fruit that had not yet fallen shook in the winds, looking like the copper bell suspended from the roof of the Buddhist temple.</p><br/><p>The Headmaster who was dressed in black from head to toe sat at the edge of the cliff. He looked in the southeast direction and said, “Something is happening there.”</p><br/><p>Eldest Brother had accompanied his teacher to the back cliff to brew wine today. He was making preparations when he heard these words and could not help but shiver. Today was the exact day of the Yue Laan Hungry Ghost Festival; his Youngest Brother and Miss Sangsang were at the Lanke Temple.</p><br/><p>The autumn breeze caressed his shirt, and the Headmaster stood up.</p><br/><p>Eldest Brother knelt behind the Headmaster and muttered something anxiously. Then, he said, “All that has happened was due to my ignorance and stupidity. I will bring Youngest Brother back.”</p><br/><p>With that, the winds on the cliff started again.</p><br/><p>The Headmaster looked into the distance and said softly, “I have always been a coward. I wavered between two sides because I did not understand some things. Because of the unrest, I did not wish to be entangled in the fate of that girl. Slowly, it was because of a girl that you violated nature, and now, you are forcing me to not act. I assume you have seen the shadow?”</p><br/><p>Eldest Brother had already disappeared from the cliff platform. The Headmaster felt a little lonely.</p><br/><p>He turned around to look at the purple wisteria hanging in the corridor with the tangled tendrils and suddenly smiled. He said, “However, have they not been tangled together long ago?”</p></div>\n</div>"}