{"title": "Chapter 619 - Spoon, When Will the Spoon Be Seen", "id": 619, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-619-spoon-when-will-the-spoon-be-seen", "volume_title": "Volume 7", "body": "<h1>Chapter 619 - Spoon, When Will the Spoon Be Seen</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Luo Kedi recalled what the middle-aged monk had said: if the Academy sent people here – the Xuankong Temple would have its own way to address it. Suddenly, he thought of a possibility and asked in surprise, “Will the Chief Preaching Monk join in?”</p><br/><p>“My teacher will not get involved,” Qi Mei said calmly.</p><br/><p>Although involvement of Xuankong Temple’s Chief Preaching Monk would be enough to shock the entire cultivation world, Luo Kedi wouldn’t be shocked by it. What he dreaded was its potential aftershock.</p><br/><p>In the Buddhist Sect and the Taoist Sect, Abbey Dean of Zhishou Abbey and Chief Preaching Monk of Xuankong Temple had almost become characters of myth. No one dared to challenge them, even in terms of speech.</p><br/><p>It is said that, over the years, only Headmaster had fought with them. Conclusions of those two fights were obvious. From then on, Abbey Dean no longer stayed at Zhishou Abbey – he went far into the South Sea. Over the past decades, he had never returned to this land. Similarly, no one had heard of any fights involving Chief Preaching Monk.</p><br/><p>According to the man who told Luo Kedi the story, after Headmaster defeated the two bigwigs, they had come to an agreement. No matter what happened in this world, the three of them had to stand by.</p><br/><p>The story was known only by a few. Besides core disciples of the three bigwigs, only the hierarch of West-Hill Divine Palace and Sword Sage Liu Bai had vaguely heard of it.</p><br/><p>Despite being a favored confidant of West-Hill’s hierarch, Luo Kedi had no right to know the story. However, two years ago, he had knelt before Hierarch Lord’s palace for a whole night with the desire to marry Ye Hongyu and the fear of offending Ye Su or infuriating Zhishou Abbey. At the time, Hierarch Lord mentioned the story, whether intentionally or not.</p><br/><p>Hierarch Lord of West-Hill Divine Palace was the leader of a Taoist Sect in the secular world. His behavior, including every word that he spoke, had profound meaning – it was impossible for it to be a simple slip of tongue. According to Luo Kedi’s analysis, Hierarch Lord might have spoken to put himself at ease, to improve the position of West-Hill Divine Palace in the Taoist Sect and even to compete head-to-head with Zhishou Abbey.</p><br/><p>Luo Kedi was worried that, if Hierarch Lord were to make the first move, it would be seen as breaking the agreement and provoke the headmaster. If Headmaster became involved personally, all the preparations made by the two sects would become a joke.</p><br/><p>Now, having heard Qi Mei’s denial, he felt slightly relieved. Worried that the other person would see something wrong with him, Luo Kedi turned away from the temple. He left White Tower Temple with eighteen divine guards following him and headed to the imperial palace of Yuelun Kingdom.</p><br/><p>As Qi Mei looked at Luo Kedi’s burly figure disappearing among the halls, he frowned slightly.</p><br/><p>Despite only having met for a few minutes, he learned that West-Hill Divine Guard commander’s state was probably at the middle of Knowing Destiny State. In addition, it was very stable and powerful – probably above Ning Que’s level. West-Hill Divine Palace sent him here. The Divine Priest of Judgment also went downhill. Generally speaking, sending these people should be enough attention, but he still felt something wrong.</p><br/><p>A few days ago, a message came from the remote eastern wilderness. Tang – Wayfarer of the Devil’s Doctrine – was badly injured and fled after killing many powerhouses in the central Plains. West-Hill Divine Palace’s most tragic loss in the battle was the death of a powerhouse at the Knowing Destiny State, who had lived in seclusion in the Kingdom of Song for many years.</p><br/><p>Powerhouses at the Knowing Destiny State were rare in the cultivation world. However, West-Hill Divine Palace could hide one in Song Kingdom’s Taoist temple. Knowing that, how powerful would Haotian Taoism be if its were to completely surface?</p><br/><p>Furthermore, such an honorable Knowing Destiny State powerhouse risked ambushing Devil’s Doctrine’s Wayfarer in cooperation with allied forces. West-Hill Divine Palace put so much effort into the Wilderness, while, facing the great world-destroying calamity, it appeared comparatively stingy, even though it poured no small effort into Yuelun Kingdom. It made it easy to arouse suspicion.</p><br/><p>“Was it so painful being beaten by Headmaster that you still don’t dare face the Academy? In your eyes, if the Daughter of Yama were a bowl of porridge, we of the Xuankong Temple would be the spoon. You do not want to do it yourself, but let the spoon take the porridge from the bowl… How smart you are, Abbey Dean.”</p><br/><p>As he strolled out of the temple, Qi Mei looked up at the thick black clouds in the sky and thought to himself.</p><br/><p>With the combined power of Xuankong Temple and West-Hill Divine Palace, the masses in every street and other allies, Ning Que – no matter how strong he was – could do nothing other than die. However…</p><br/><p>Only the death of Yama’s daughter could save the world. No matter how outrageous people of the Academy might be, they definitely could not use it as an excuse to take revenge against the two Sects. However, the story in the autumn rain at Lanke Temple had long proved that the death of Ning Que was prerequisite to that of Yama’s daughter.</p><br/><p>If a close disciple of Headmaster were to be killed, whether it made sense or not and regardless of the situation at that time, people from the second floor of the Academy would definitely create an excuse to fly into a rage.</p><br/><p>Qi Mei believed that after this incident, the cultivation world would definitely become turbulent. The person who killed Ning Que would be killed in the end, even if he were to flee to the South Sea like Abbey Dean.</p><br/><p>Listening to the chanting coming from the front of the temple while looking at the dark clouds overhead, he remained silent for a long time. Gradually, his expression turned from worry and anxiety to determination and calmness. He murmured, “If it is not me to enter the netherworld, who will it be?”</p><br/><p>As winter gave way to spring, everything was as usual: the thick clouds still suspended motionlessly in the sky above Chaoyang City, the smell of incense in the streets was still as strong, the businesses of the carriage dealers were still thriving, chanting could still be heard from the back gardens of officials and rich merchants, where news of the sudden death of a daughter would occasionally originate.</p><br/><p>Ning Que looked calm but was actually very anxious. He had been under great pressure. The thick clouds in the sky seemed to be pressing down on him, making his breathing somewhat difficult. Though he did not know what the increasingly thicker and darker clouds symbolized, he had vaguely guessed that it was related to Sangsang.</p><br/><p>The upcoming chase after exposure of their whereabouts worried him a lot. It was fine if they were only chased by powerhouses from the two Sects, but what made him wary was the possibility of ordinary beings joining in.</p><br/><p>It referred not to the arrest warrant or the manhunt of the army, but to the ordinary people – the tens of thousands of individuals in the world.</p><br/><p>There had always been an unwritten rule in the cultivation world: combat among cultivators should avoid affecting life in the secular world as much as possible and even more so – involving the ordinary people. However, Sangsang’s life was related to the danger of world destruction. Ning Que believed that the two Sects would not care about rules.</p><br/><p>What was terrible was not to be the enemy of the world, but to be the enemy of everyone in the world. Wherever you were and whatever you were doing, you would face endless attacks. That was the most terrifying thing.</p><br/><p>You would be hit by a spoon at all times, endlessly. The spoon would not break and wherever you hid, it would find you and strike your head.</p><br/><p>You would be tortured to death even if you did not die from those strikes. The only way you could find solace would be to kill whomever held the spoon. However, if everyone in the world were to have a spoon in hand…</p><br/><p>Could you kill everyone in the world?</p>\n</div>"}