{"title": "Chapter 633 - Don't Kill", "id": 633, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-633-dont-kill", "volume_title": "Volume 7", "body": "<h1>Chapter 633 - Don't Kill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>A wound appeared on Sangsang’s forehead as fresh blood slowly flowed. Perhaps it was because her face was too pale but the blood didn’t seem pure red but rather, black.</p><br/><p>She looked at the little boy with a confused look. She couldn’t understand why he would use a rock to hit her. When she understood, her expression turned dark. She was a little sad but kept silent.</p><br/><p>Lu Chenjia saw this clearly and for some reason, she felt a sense of compassion in her heart. On the other hand, Quni Madi gave a cold laugh and didn’t hide the joy in her laughter.</p><br/><p>Sangsang was in pain and was sad but she didn’t say anything. She only laid silently on Ning Que’s shoulders as she didn’t want him to be affected by this. She knew he wasn’t having an easy time either.</p><br/><p>However, how could Ning Que not know that she was hit by a rock? He turned sideways to look at the little boy. Holding the sheath in his left hand, he started taking the podao out from it.</p><br/><p>Quni Madi gave a cold smile and said gruffly, “Ning Que, you are extremely cold-blooded!”</p><br/><p>Lu Chenjia’s expression changed as she pleaded for the little boy, “He is only a child…”</p><br/><p>Ning Que seemed as though he didn’t hear their words. The podao was already half out of its sheath. He looked at the little boy whose bloodied face didn’t show any expression. This made him looked scarier.</p><br/><p>The little boy gave another wail as he cried again.</p><br/><p>Among the crowd, Master Qimei looked at Ning Que with a little regret as he said in a low voice, “Mr Thirteen, whatever happened around the White Tower Temple today is the Buddhism Sect’s fault. I will take responsibility for everything, please be merciful.”</p><br/><p>At this moment, the little boy was beside Ning Que. So long as he swiped with his knife, the little boy would certainly die. Although Qi Mei was a powerful monk in Xuankong temple, he would not be able to stop it.</p><br/><p>Ning Que was forced into desperation today. after escaping to here and killing countless people, he was filled with blood and his heart was numb to everything. Even Headmaster and Eldest Brother couldn’t stop him from hacking the little boy, much less the common people.</p><br/><p>In this entire world, under such circumstances, there was only one person who could stop him.</p><br/><p>Sangsang rested against his shoulders and shook her head before saying wearily, “Don’t”</p><br/><p>The hand that Ning Que used to hold the hilt of the knife trembled slightly.</p><br/><p>Many years ago when they were deep in Min Mountain, they killed grandpa together. Just as they were about to leave the hunting house, Sangsang who was still a small girl then, released two blue sheep that were precious food to them back then.</p><br/><p>The story then seemed to be happening again today.</p><br/><p>Ning Que kept his knife back into the sheath and use the tip of it to pick the little boy who was still crying to the back of the crowd.</p><br/><p>There were many bodies lying by the lakeside and many more severely injured people who were groaning miserably in the pool of blood.</p><br/><p>Ning Que looked at the temple wall from afar and realized he had killed so many people. He had only walked ten over feet and there was still a long way before he could leave. He needed to kill many more people.</p><br/><p>He suddenly realized he was a little tired as he lowered his head.</p><br/><p>Sangsang used her fingers to grab his cuffs and used his sleeve to gently wipe the blood off his face.</p><br/><p>Ning Que raised his head and released the rope that was tied to his hand before continuing forward.</p><br/><p>Quni Madi and Lu Chenjia allowed him to go for some reason as they stayed where they were.</p><br/><p>Something strange happened at this moment.</p><br/><p>As Ning Que walked forward, the people blocking him started splitting and became quiet. Their quietness spread even faster than fear as the bawling at the back slowly stopped.</p><br/><p>Even the monks from the Buddhism Sect turned quiet and stopped chanting the name of Buddha and reciting scriptures.</p><br/><p>The violent crowd in the White Tower Temple slowly quietened down.</p><br/><p>No one could understand what was causing the quietness. Ning Que couldn’t, Master Qi Mei couldn’t, Quni Madi couldn’t too. If Haotian was looking over the human world, he probably would not understand either.</p><br/><p>Because of fear, there was anger. Ning Que was tired now and the people’s fear seemed to have reduced. Hence they weren’t as angry as before? Or perhaps he had killed enough people to subdue the crowd?</p><br/><p>Or perhaps because he was always killing, hence the people wanted to kill him. Now that he stopped killing, the people weren’t willing to risk their lives to charge at him and kill him?</p><br/><p>Ning Que walked over from the pool of blood and use his peripheral vision to see the faces of the dead and wounded. He then lifted his head and looked at the countless faces in the crowd.</p><br/><p>These faces were very normal and if they were someone in the streets of Chaoyang City, they couldn’t be recognized. However, there were joy and sorrow on those many faces, they all had stories and for many of them, it ended here today.</p><br/><p>The crowd slowly separated in front of him, like the parting of the sea.</p><br/><p>Ning Que carried Sangsang and walked wearily through the crowd. The bloodied water didn’t stop dripping down from his hair. The blood had long clotted and were sticking to part of his hair, making him look incredibly sloppy.</p><br/><p>Looking at him and the daughter of Yama on his back, the people had a complicated expression on their faces. Most of them were of horror, half of them were glad and some still had anger in them. But whatever different emotions they had, they all looked at Ning Que the same way.</p><br/><p>It was a look one had when they saw a different species. In their eyes, Ning Que who was covered in blood, was a devil. He was the protector of the Underworld and a cold beast. In other words, he wasn’t human.</p><br/><p>It was silent throughout the entire White Tower Temple and only Ning Que’s footsteps could be heard. Countless people stared silently at him, their hands were holding onto iron shovels and bricks. Their eyes were filled with hatred and anger and their bodies that slightly bent backward showed their extreme fear. With all of these combined, they formed an absolute indifference.</p><br/><p>The crowd split like the sea and it wasn’t one of most welcoming as it was to send him far away. Just like the herd of sheep in the Wilderness, they were sending off a sheep that would hurt other sheep and eventually turn into an evil wolf away from their herd.</p><br/><p>This was probably how it felt to be abandoned by the entire world. Ning Que wiped his hands that were full of blood on his clothes before stretching it to his shoulder and lightly patted Sangsang’s face.</p><br/><p>That powerful aura was nearing.</p><br/><p>Ning Que fastened his pace. According to Sangsang’s earlier calculations, he could still make it on time so long as the people ahead no longer attacked him. Moreover, Master Qi Mei already showed no intentions of attacking.</p><br/><p>Quni Madi looked at the figure in front going further and further away as her body trembled intensely all of a sudden. The expression of hatred on her face got stronger, even a little crazy.</p><br/><p>She was different from Master Qi Mei and the people here. She had never cared that Sangsang was the daughter of Yama. She only wanted Ning Que to die and to revenge for her man and her son.</p><br/><p>The talisman that Ning Que had slapped onto her body at the monastery had slowly dissipated and her Psyche Power and cultivation had returned to her body. She gave a loud shout as she swept forward all of a sudden, slapping Sangsang who was on Ning Que’s back!</p>\n</div>"}