{"title": "Chapter 638 - Buddha's Words", "id": 638, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-638-buddhas-words", "volume_title": "Volume 7", "body": "<h1>Chapter 638 - Buddha's Words</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>One had to be able to get on a path in order to diverge from it. However, the people at White Tower Temple would not allow Ning Que to take Sangsang away. The crowd that had previously been frightened by his viciousness had parted earlier. However, they received courage and strength when the Chief Preaching Monk arrived. The Chief Preaching Monk was the largest obstacle to Ning Que and Sangsang leaving.</p><br/><p>Eldest Brother helped Ning Que up. He took out several iron arrows and gave them to Ning Que, saying, “These are the iron arrows you lost on Wa Mountain. Sixth Brother fixed them. If you can escape, fix the runes. Sixth Brother made these metal cylinders as well and asked me to bring them to you.”</p><br/><p>Ning Que accepted the heavy iron arrows and placed them in the quiver. He wound one of the small metal cylinders on the arrowhead of an iron arrow and said, “Sangsang and I will leave by ourselves. You don’t have to send us off, Senior Brother.”</p><br/><p>Eldest Brother looked at the crowd in the temple by the lake and the Chief Preaching Monk not far away. He said, “If you guys can go off by yourselves, would you have had to wait for me to come?”</p><br/><p>Ning Que saw the exhaustion in his Senior Brother’s eyes and felt uneasy. In his opinion, even if Eldest Brother had broken through the Five States and reached the Limitless State, he was unlikely to win against the Chief Preaching Monk who was in the Diamond Undefeatable State.</p><br/><p>Eldest Brother knew what he was worried about and said to him gently, “Indeed there are not many people who can beat the Chief Preaching Monk. But I can at least stop him.”</p><br/><p>He continued, “The master steps on the thick ground. In the Diamond Undefeatable State, his only weakness is that he is too slow. According to his promise back then, he cannot attack. I am confident in getting you out.”</p><br/><p>The two did not lower their voices when they spoke. That was because no matter how much they tried to lower their volume, they would not be able to stop the Chief Preaching Monk from listening in.</p><br/><p>The Chief Preaching Monk sat on the ground with his knees crossed. He held the middle of his staff in his right hand, silent and at ease as if he had not heard them, or perhaps, he did not care even if he had.</p><br/><p>Ning Que looked at the expression of the monk who was a powerhouse in the Buddhism Sect. His uneasiness grew. He felt that they would encounter trouble if Eldest Brother acted. He reached out to catch Eldest Brother’s sleeves.</p><br/><p>However, he only managed to grasp a handful of wind.</p><br/><p>A slight breeze started, and Eldest Brother’s cotton shirt fluttered slightly before it shimmered and disappeared into thin air, leaving behind a word that reverberated in his ears.</p><br/><p>“Leave.”</p><br/><p>Ning Que knew that this wasn’t the time to talk about anything else. Since Eldest Brother had already acted, he had to make use of this opportunity to escape and not mess with Eldest Brother’s plans.</p><br/><p>Even if Eldest Brother could only hold the Chief Preaching Monk back for a period of time, the crowd in White Tower Temple, especially Master Qi Mei, the Buddhist powerhouses, and Taoist powerhouses from West-Hill Divine Palace, would try to make him and Sangsang stay. As such, he carried Sangsang on his back and rushed toward the quiet lake below the White Pagoda without hesitation.</p><br/><p>However, his steps grew heavy and landed on the ground with a thud. He found it difficult to raise his legs again.</p><br/><p>They had only just begun to flee but suddenly stopped.</p><br/><p>It wasn’t because the powerhouses from the Buddhism and Taoism sect had stopped him. It also wasn’t because the crowd had rushed at them madly. It was because he sensed an odd change in his surroundings. He saw the terrified expressions of some people and guessed that something shocking had happened behind him.</p><br/><p>Ning Que turned around and looked at the Chief Preaching Monk who sat on the ground with his legs crossed.</p><br/><p>Eldest Brother had disappeared, entering the Limitless State. His target was naturally the Chief Preaching Monk.</p><br/><p>The Limitless State was the most incredible cultivation style in the world. It was above the five states and was like traveling on wind and clouds. One could leap over mountains and pass through countries with it.</p><br/><p>There was no other power faster than the Limitless State. Not even the Sage of Sword, Liu Bai’s Thousand Mile Sword was faster.</p><br/><p>According to Ning Que’s calculation, Eldest Brother should have reappeared in front of the Chief Preaching Monk after he disappeared. He might have even have traveled a thousand miles away to retrieve a powerful weapon before returning to the White Tower Temple, crushing the Chief Preaching Monk.</p><br/><p>Eldest Brother had reappeared.</p><br/><p>But not in front of the Chief Preaching Monk.</p><br/><p>He had reappeared some distance away from the Chief Preaching Monk. It was as if he had only taken one step before he was forced to reappear!</p><br/><p>Looking at the Chief Preaching Monk who was sitting dozen of feet away with his knees crossed, Eldest Brother’s cotton robes fluttered. Dust slowly rose from the ground. Eldest Brother’s expression was unusually grave and his body seemed unusually heavy. He could not take another step.</p><br/><p>If one looked closely, one would see that his straw slippers were not on the actual surface of the ground. He was levitating about half an inch above it. However, he could not move at all!</p><br/><p>Then, the chanting of scripture slowly picked up.</p><br/><p>The Chief Preaching Monk sat with his knees crossed, hand holding his staff. With a solemn and majestic expression, he chanted with a voice of Buddha.</p><br/><p>“I heard: The three worlds are all fleeting. There is nothing and there is joy. There are rules, and everything is meaningless. Without wind, there would be no dew. Without fog, there would be no lightning. We can see from here that evil comes from within.”</p><br/><p>The scripture was from the Great Compassion Scroll.</p><br/><p>It referred to Eldest Brother.</p><br/><p>As the chanting started, their surroundings suddenly changed. The lake waters stilled and the willows on the shore slumped. Even the lights on the White Pagoda froze in the moment. The wind stilled.</p><br/><p>All was silent in the White Tower Temple. Those in the pagoda were silent and all things in the world returned to their original state that they were a thousand years ago. Their hearts stilled as they felt the peace around them.</p><br/><p>In the absolutely peaceful world, how could one travel on the winds when there was no wind? How could one step on dew and fly if there wasn’t any dew? How could they pass through fog if there wasn’t any fog? How could they move like lightning if there was no lightning?”</p><br/><p>Eldest Brother was forced to stop in the peaceful world. His feet slowly landed on the ground and his robe stilled. His face grew paler.</p><br/><p>It was said that of all skills in the world, only speed could not be beaten. And the fastest Limitless State had been defeated today!</p><br/><p>Ning Que only had time to turn around and stepped forward before he sensed the weirdness. He stopped and turned his head around. He heard the soft chanting and saw that Eldest Brother was in danger.</p><br/><p>He was extremely shocked; he had no time to consider why Eldest Brother’s Limitless State could be neutralized. He whipped out his bow and arrow and shot an arrow at the Chief Preaching Monk.</p><br/><p>Before Eldest Brother had appeared, he had already used the Primordial Thirteen Arrows against the Chief Preaching Monk. Against the Chief Preaching Monk whose body and heart was as hard as diamond, the powerful iron arrow was like a withered branch and was ineffective. However, he still used a second iron arrow because there was a small metal cylinder on the arrowhead of this arrow.</p><br/><p>He did not believe that there was an existence in this world that cannot be extinguished. Even if the Chief Preaching Monk was undefeatable, and could not be physically harmed, he believed that the explosion caused by the metal cylinder would at least bother him, even if it did not kill him. This would allow Eldest Brother to extricate himself from the odd situation.</p><br/><p>However, he saw something even weirder next.</p><br/><p>The iron arrow left the bowstring and a white trail blossomed from the tail of the arrow like a dandelion being blown apart by mad winds. Then, the arrow fell. Ning Que was familiar with the process of shooting Primordial Thirteen Arrows and knew that the white trail was due to the talisman intent being integrated into the air. However, this was the first time he had witnessed such a situation!</p><br/><p>The iron arrow was supposed to ignore the distance in space and travel quietly. However, it did not disappear after leaving the bowstring, but retained its physical appearance and slowly flew a dozen feet before falling onto the ground!</p><br/><p>The iron arrow could not get close to the Chief Preaching Monk at all. The cylinder on the arrowhead groaned. However, there wasn’t even a small ember of flame, much less a powerful explosion.</p><br/><p>Ning Que paled significantly, and it looked like his cheeks sunk in mere seconds. He began to tremble violently. Then, he used his right index finger and drew a line in the air, aiming for the Chief Preaching Monk in the distance.</p><br/><p>This was the only temporary Divine Talisman that he knew. The Two-Horizontal Talisman!</p><br/><p>Ning Que had stopped himself from using it previously even as they were on the brink of death at the courtyard as he was worried that he might expend too much of his Psyche Power while on the run with Sangsang. However, he did not hesitate as Eldest Brother was in a very dangerous situation!</p><br/><p>However, he discovered something weird once more.</p><br/><p>No matter how much Psych Power he put into it, and no matter how stable and powerful his fingers drew in the air, he could not place any power in the rune he drew in the air. Furthermore, he also had a nagging feeling that the Divine Talisman he drew would not be able to change the aura of heaven and earth!</p><br/><p>As the Chief Preaching Monk chanted, the Qi of Heaven and Earth in White Tower Temple stilled and could not be moved, just like the lake, pagoda, temple, people, wind, rain, snow and all other things of nature.</p><br/><p>Ning Que listened to the scriptures, and his sense of perception began to still. He did not wish to use his Psyche Power at all, and his body relaxed. He only wished to sit down and listen to the scripture. Even the Great Spirit in his body calmed. Even the crystal-like liquid in his stomach that had been spinning slowed!</p><br/><p>Ning Que looked at the Chief Preaching Monk who sat with his knees crossed in shock. He wondered what kind of skill he was using that could affect Ning Que’s insides. It was so powerful!</p><br/><p>Eldest Brother looked at the Chief Preaching Monk and uttered in shock, “The Power of Words!”</p><br/><p>“I heard: The three worlds are all fleeting. There is nothing and there is joy. There are rules, and everything is meaningless. Without wind, there would be no dew. Without fog, there would be no lightning. We can see from here that evil comes from within.”</p><br/><p>The scripture that the Chief Preaching Monk chanted rang within White Tower Temple. It chimed in the distance like bells, was calm like the wooden fish, subtle like the scent of incense, and it penetrated deeply into one’s heart like the voice of Buddha.”</p><br/><p>Nothing existed. And as such, there was no wind, dew, fog, lightning, rain or snow. And at the very beginning of the world, there wasn’t any Qi of Heaven and Earth, so how would they be able to control it?</p><br/><p>The Chief Preaching Monk was Xuankong Temple’s highest being. His disciples were of higher status than other bigwigs like the chief monk. This was because Xuankong Temple was a place where preaching was done.</p><br/><p>The Chief Preaching Monk was above the Five States and had his own Buddhist world. He was a Buddha on earth, so the scriptures that he preached on earth were Buddhist scriptures, and the words that he spoke were in the voice of Buddha.</p><br/><p>The voice of Buddha, was the rule in his world.</p>\n</div>"}