{"title": "Chapter 640 - Immolation", "id": 640, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-640-immolation", "volume_title": "Volume 7", "body": "<h1>Chapter 640 - Immolation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>It was the aura of Heaven and Earth rather than wind which was invisible for normal people. It rotated around the monk and pushed the air.</p><br/><p>The Limitless State which was higher than the Five States was difficult to understand, but it was real.</p><br/><p>In the paths or countless gates of the Heaven and Earth’s aura, Eldest Brother moved at an unimaginable speed or in some way beyond speed, stirring the aura into the turbulence, and isolated the monk from the real world.</p><br/><p>At this moment, the world the monk could see was only countless monotonous lines without sound. His voice could not spread to the real world either. He was temporarily separated from the real world.</p><br/><p>Ning Que didn’t miss the opportunity and he ran away with Sangsang at once.</p><br/><p>The whole sky of Buddhas was smashed by one Eldest Brother’s word and turned into innumerable ray fragments. When Ning Que ran, the fragments fell on him and were stuck by the blood, making it seem like countless diamonds.</p><br/><p>The Buddhism and Taoism experts had already surrounded them from all directions. Ning Que repeatedly diverted to look for a weak point to break through, when he found that Qi Mei was standing nearby.</p><br/><p>Except for the Chief Preaching Monk who was stalled by Eldest Brother, Master Qi Mei was the most powerful man here. He also was Ning Que’s real source of dread, a person who would not leave him any chances.</p><br/><p>Facing Qi Mei and the huge crowd in the temple, Ning Que was not sure if he could take Sangsang out of Chaoyang City.</p><br/><p>The crowd had already rounded them, blocking off the bridge and the galleries in the temple. The ascetic monks began gathering and two priests in red came forward with a dozen of West-Hill Divine Guards.</p><br/><p>Ning Que felt desperate until he found a strange thing—the two priests had strange looks on their faces.</p><br/><p>Looking at Ning Que who was rushing toward them, the two priests in red didn’t become alert, afraid or angry. They just peacefully stood there, looking respectful and determined.</p><br/><p>Ning Que was sure he had never met them before, but he noticed that they showed their respects to Sangsang when they looked at her.</p><br/><p>The two priests stood by Qi Mei and formed a thick wall to stop Ning Que with a dozen West-Hill Divine Guards and ascetic monks who were gathering around them.</p><br/><p>Two white flames slowly burned on the priests’ palms and illuminated the temple covered by clouds. That was Haotian’s Divine Light.</p><br/><p>The West-Hill Divine Guards’ eyes were brightened by Haotian’s Divine Light. The previous precautions turned into self-confidence and pride, as well as the zeal of martyrs.</p><br/><p>Staring at the Haotian Divine Light on their hands, Ning Que frowned and was quickly set on guard against them—Thanks to Sangsang who used to be the Lady of Light and owned the purest Haotian Divine Light in the world, he was familiar with the West-Hill Divine Skills. Since there were only a few priests who could practice the Divine Skills in West-Hill Divine Palace and they sent two of them, the West-Hill Divine Palace must be serious about this.</p><br/><p>Looking at the approaching Ning Que, the two priests became more and more strong-willed and sacred, exacerbating the light in their hands.</p><br/><p>Four beams of white flames rose up from their hands, illuminating the whole place. Master Qi Mei looked at Ning Que and sighed, slowly moving sideways.</p><br/><p>Ning Que knew his meaning—Facing Master Qi Mei and the two priests, he would never be able to rush out. Considering he didn’t kill the little boy, Qi Mei was giving him a chance to fight against the priests first.</p><br/><p>However, neither Ning Que nor Master Qi Mei would ever think that their Divine Skills weren’t aimed at Ning Que. They aimed at themselves.</p><br/><p>The Haotian Divine Light gushed out from their hands, mouths, noses, eyes, ears, and every hair and pore, penetrating the gaps of their clothes, and turned their bodies into two bright lamps.</p><br/><p>Master Qi Mei felt extreme danger when he saw this, but he failed to avoid it. He hummed and sat down, immediately crossing his legs and covering his eyes, making a lotus posture.</p><br/><p>The two priests in red gently looked at Sangsang, smiling. Their smiles looked very gratified. Their bodies began to shine and burn… then they exploded.</p><br/><p>Boom! Boom!</p><br/><p>The air in the temple was suddenly disturbed, stirring the lake water and breaking down many trees. Blood and broken arms and legs were everywhere. Countless people were killed in an instant.</p><br/><p>The West-Hill Divine Skill was the best way to save people’s lives. However, who would think that, once the light decided to burn itself, it would be so powerful and kill so many people.</p><br/><p>The explosions created a huge blank area in the middle of the crowd where no one survived.</p><br/><p>As for the two priests’ bodies, they had already been burst into ash. Only the pieces of the red robes were flying in the air like condensed blood.</p><br/><p>A piece of the red robe fell on Ning Que’s shoulder. Sangsang stretched out a trembling finger and picked up it, looking a little sad.</p><br/><p>She didn’t know why they blew themselves up, but she knew they did this for her when she remembered their eyes before they died.</p><br/><p>The smoke and dust gradually dissipated. The White Tower Temple was in a mess, echoing the pained screams and groanings. It was disastrous and filled with blood and flesh.</p><br/><p>Master Qi Mei was riddled with wounds and burns on his body. Facing the two priests’ explosions, even though he had become a Buddha, he was badly injured. If he didn’t step away for Ning Que, he would be more seriously injured.</p><br/><p>Putting down his hand and looking at his surroundings, he changed his expression. Ning Que and the Daughter of Yama were no longer here and the black crows had flown away.</p>\n</div>"}