{"title": "Chapter 646 - The Most Exciting Time", "id": 646, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-646-the-most-exciting-time", "volume_title": "Volume 7", "body": "<h1>Chapter 646 - The Most Exciting Time</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Feelings are deep and nothing can be used to repay them. Please shower.</p><br/><p>This sentence would sound especially weird if anyone were to say it to someone else. Moreover, it was to a pretty woman decked in a ruling robe.</p><br/><p>However, what happened next wasn’t something anyone expected, including Ning Que.</p><br/><p>“Being perverted is an abnormal state, this should be a compliment.”</p><br/><p>The cold frost on Ye Hongyu’s face slowly dissipated and turned into a faint smile. She extended her hand to her collar and started unrobing herself, her fingers twisted slightly as the thin red robe went away with the wind, showing off her jade white body.</p><br/><p>Across the pond, Ning Que and Sangsang were shocked.</p><br/><p>Ye Hongyu didn’t take notice of their gaze and she didn’t hide anything. Under the clouds and in the swamp, she walked naked into the clear pondwater and started washing her black hair.</p><br/><p>Ning Que and Sangsang looked at the perfect body in the pond. Looking at the charming curves, they had a stunned expression and didn’t know what to say at all. They didn’t know if they should stop her.</p><br/><p>After a moment, Sangsang looked at the woman in the water and sighed, “She is beautiful.”</p><br/><p>Ning Que didn’t blink as he nodded and said, “She is really beautiful.”</p><br/><p>Ye Hongyu appearing before the black horse carriage wasn’t the chance encounter that Ning Que had mentioned. The dark cloud and dozens of black crows were always following them. However, not many people dared to enter the quagmire to search. Ye Hongyu had waited in the swamp alone for more than 10 days, of course she could find them.</p><br/><p>She didn’t mind Sangsang and especially Ning Que looking at her body, naturally, she had no intentions of seducing them. Ning Que recalled back on the stone steps of the Taoism temple in the Kingdom of Qi. Looking at the divine light in her eyes, he could vaguely understand the meaning within.</p><br/><p>Those who sit on the great divine priest seat are more focused on the mental cultivation, chasing after the state where their Taoist heart is unimpeded. As Ye Hongyu sees it now, no matter how alluring her body is now, it was but an annoying shell. She couldn’t wait to throw it in the trash hence, why would she mind if others see it?</p><br/><p>Ning Que suddenly asked, “How did you know I would walk this way?”</p><br/><p>Ye Hongyu took out a comb from somewhere and started combing her hair lightly in the water. The pond water was up to her waist, her hair was wet and hanging in front of her naked breasts. The sight was one to behold.</p><br/><p>“You said earlier that we are all perverts. I know you very well, with your character, whether you return to Tang or go to the Wilderness like that idiot Long Qing, you will choose to cross the quagmire.”</p><br/><p>Ning Que said, “The quagmire isn’t a real pond. This swamp is so huge, were you not afraid of missing us?”</p><br/><p>Ye Hongyu continued combing her hair as she looked at the black crows on the roof of the horse carriage and said calmly, “Haotian’s will would not let me miss you.”</p><br/><p>Ning Que kept silent for a moment before saying with a serious expression, “Must we?”</p><br/><p>“We must.”</p><br/><p>Ye Hongyu used the comb to comb her wet hair to the top of her head and tied a simple bun. There were water droplets falling from her hair and they landed in the pool, giving off a monotonous sound that was exactly like her voice then.</p><br/><p>“As the judge, my mission is to judge the sins and evil of the world on behalf of Haotian.”</p><br/><p>Ning Que said, “But we aren’t guilty.”</p><br/><p>Ye Hongyu replied, “You had exceeded my expectations by escaping from Chaoyang City. It isn’t hard to imagine that you have killed many people in this process.”</p><br/><p>Ning Que said, “If anybody wants to kill me, I will kill them.”</p><br/><p>Ye Hongyu said, “If you ignore her, who would dare kill you?”</p><br/><p>Ning Que said, “Idiot, she is my wife.”</p><br/><p>Ye Hongyu furrowed her brows and asked, “Even if your wife is the Daughter of Yama?”</p><br/><p>Ning Que said, “Even if she is the Daughter of Yama, she has not done anything evil.”</p><br/><p>Ye Hongyu said, “I heard that Mr. First said the same thing at Lanke Temple. It seems like everyone from the second floor of the Academy is the same, do you not think you all are incredibly hypocritical?”</p><br/><p>Ning Que said, “Alright, I am not Eldest Brother and I’m not very persuasive when saying such things. However, she is still my wife and no matter how evil she is, can I not care about her?”</p><br/><p>“That makes sense, but that is your reason as a man, not the reason of the world.”</p><br/><p>“Sacrificing one person to save the world, is that the reason of this world? I believe no matter it is the Chief Preaching Monk or Master Qi Mei, they are all willing to accompany Sangsang to die. But you are not someone like that.”</p><br/><p>Ye Hongyu said, “Indeed, my existence is the most important thing. Whether your wife dies or not isn’t enough for me to die together with her. If the Underworld really invades in the future, I will battle Yama for one round before dying. This cannot count as me wasting my life but it will not affect my attempt to kill her.”</p><br/><p>“Why?”</p><br/><p>“She is the Daughter of Yama, that is an original sin.”</p><br/><p>“What original sin? This is only about interest, involving the interest of most people, the interest of the whole world. Hence you all think it is an unforgivable sin.”</p><br/><p>“Do you only understand what is kind and evil, what is merit and sin now? This has nothing to do with virtues from the start, only interest. Those that are good for the world will be kind, those that have no use will be evil. The more people it benefits, the greater good it is, the more useless it is, the greater the evil it is. If it is good for no one, it is an unforgivable sin.</p><br/><p>“But you have already become the Great Divine Priest of West-Hill, naturally you do not need to obey this rule.”</p><br/><p>“Not bad, we are the ones who create the rules, we are the shepherds. However, when someone threatens the herd of sheep or even the entire grassland, we will follow the rules.”</p><br/><p>“If that is the case, how does the Haotian Taoism have the right to say the Academy is hypocritical?”</p><br/><p>Ye Hongyu looked at him peacefully and said, “The Haotian Taoism is hypocritical, I have never denied that. However, the Academy always thinks that you are not, this is why I say you all are hypocritical.”</p><br/><p>Ning Que looked at her and said all of a sudden, “After shepherding for 10,000 years and eating mutton in various ways, one will still get sick of it in the end. Have you tried living in another way? Like hunting in the mountains.”</p><br/><p>Ye Hongyu looked at him quietly and kept silent.</p><br/><p>Ning Que said again, “The Underworld Invasion will definitely be a sight to behold. Countless years have passed and only our generation will have the chance to witness it. Everlasting night will befall the world, do you not want to see that?”</p><br/><p>Ye Hongyu said, “I want to see it but I cannot go against Haotian’s will.”</p><br/><p>Ning Que said, “Please, you have never even heard Haotian speak before. For all you know, he might be lonely for tens of thousands of years in heaven and have always waited for Yama to come here and to have a good fight. If you kill me and Sangsang, Yama will never find the world and Haotian will die lonely, suffering bitterly.</p><br/><p>He knew the woman in the pond was very scary.</p><br/><p>The scariest part was that he was the same kind of person as her. However, Ye Hongyu’s cultivation state had always suppressed his. In other words, Ning Que could only struggle with her but had no way of beating her.</p><br/><p>He would rather fight 3 rounds with Master Qi Mei or even another time with the Chief Preaching Monk than to fight against her. Hence, he had been trying to convince her to let him and Sangsang go.”</p><br/><p>The two of them ended their discussion quickly, almost as if they didn’t think it through. In actual fact, he had used a lot of effort and it was one of the most complex and exciting persuasions in his life. Twice, Ye Hongyu’s expression had changed obviously and was nearly persuaded by him.</p><br/><p>However, it didn’t succeed in the end.</p><br/><p>Ye Hongyu walked towards the bank as the water droplets rolled down from her body.</p><br/><p>“Since you are sure to not let Yama find the world, all the more reason you can’t kill Sangsang.”</p><br/><p>Ning Que stared at her naked figure. His eyes were bright and there were no signs of frustrations as he continued saying, “Teacher said if anything happened to Sangsang, the imprint in her body will be released and Yama will know where the world is.”</p><br/><p>Ye Hongyu gently wiped her body, she didn’t turn around and said directly, “Headmaster wouldn’t say that.”</p><br/><p>Ning Que said, “These are the words that Teacher had asked Eldest Brother to pass on to the Chief Preaching Monk.”</p><br/><p>Ye Hongyu started wearing her clothes. Usually, beautiful ladies looked shabby while putting on their clothes but when it came to her, it still seemed incredibly pleasing. “If that is what the Headmaster thinks, he would have taken you and Sangsang back to the Academy or even to the edge of the skies a long time ago. Why would he still need Mr. First to run around tiringly?”</p><br/><p>Ning Que had no idea that after leaving Chaoyang City, Eldest Brother and the Chief Preaching Monk from Xuankong Temple had a similar conversation in White Tower Temple. The Chief Preaching Monk’s view was exactly the same as Ye Hongyu.</p><br/><p>Hearing Ye Hongyu’s deduction now, his body trembled involuntarily. He had always assumed this was teacher’s view and Sangsang’s last hope.</p><br/><p>The blood-red robes that were spotted with mud returned on Ye Hongyu’s body. The heavy divine crown slowly landed and the beautiful teenage girl playing around in the pond immediately became the terrifying Great Divine Priest of Justice.</p><br/><p>The black crows at the top of the horse carriage started cawing, it was sounded bad and unlucky.</p><br/><p>Ning Que’s face turned ugly as he shouted, “Shut up.”</p><br/><p>The black crows quietened immediately but continued again.</p><br/><p>Ning Que laughed to himself and shook his head. He ignored them as he hugged Sangsang tighter. Looking at the thick dark clouds in the skies, a tinge of sadness showed on his face.</p><br/><p>This sadness was faint but very real. It definitely wasn’t faked.</p><br/><p>Ye Hongyu looked silently at the opposite bank, feeling his true fatigue, sadness, and frustration. She could subconsciously sympathize with him as she looks up at the dark clouds.</p><br/><p>However, just as she lifted her head, she suddenly felt something was amiss.</p><br/><p>It wasn’t a warning.</p><br/><p>Her Taoist Heart didn’t give out any warnings, that meant everything was as usual.</p><br/><p>However, there still was something wrong.</p><br/><p>She suddenly remembered that Ning Que was someone who would get sad but not before a battle. This was because any extra emotions weren’t helpful to a battle and he should understand that.</p><br/><p>The most important thing was that self-depreciating smile.</p><br/><p>Even if he had gone through too much the past two years and could feel for and was hard to suppress his feelings, he shouldn’t laugh at himself. This was because a mocking laugh and sadness together meant that he was going to give up.</p><br/><p>Ye Hongyu believed that she wouldn’t be depressed no matter what happened. No matter how strong the enemy was, she wouldn’t give up before the battle ended. That meant that he wouldn’t too.</p><br/><p>This was where things felt wrong.</p><br/><p>Ye Hongyu looked back.</p><br/><p>Her gaze landed on the opposite bank.</p><br/><p>There was an extra metal bow in his hands that were empty previously.</p><br/><p>The bowstring was already tight and was rapidly loosening.</p><br/><p>The darkish iron arrow had just left the bow and the white rapids at the tail end were forming.</p><br/><p>Behind the metal bow, Ning Que’s calm expression seemed exceptionally cold.</p><br/><p>Ye Hongyu knew that death was approaching and perhaps, even destined.</p><br/><p>Now, she truly understood that everything that Ning Que was doing wasn’t his most complex persuasion or the one who put in the most effort in…</p><br/><p>It was the most complicated, mind-consuming and exciting arrow in his life.</p>\n</div>"}