{"title": "Chapter 652 - Nearing Shubi Lake", "id": 652, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-652-nearing-shubi-lake", "volume_title": "Volume 7", "body": "<h1>Chapter 652 - Nearing Shubi Lake</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The part of the Wilderness where Golden Palace was located had a relatively good climate, enough water and fertile lands. There were many cattle and sheep, which had lived and grown in population over thousands of years. The area had become densely populated, forming more than 20 major tribes. The Palace was a strong nation and had elite cavalry composed of nearly 100,000 men.</p><br/><p>Apart from the Tang Empire, there was no other country that was a match for Golden Palace. And because the Tang Empire had forced Golden Palace to stay in the Wilderness for centuries, countries in the Central Plains gradually forgot about it. That was why South Jin Kingdom dared to say that it was the second most powerful country in the world.</p><br/><p>Not even Tang Empire was willing to go to war against the Golden Palace. Tang princess, Li Yu had married off to the Wilderness to avoid the chaos caused by Imperial Astronomer’s oracle and also to prove the importance of Golden Palace to the Tangs.</p><br/><p>Ning Que had encountered Golden Palace’s cavalry many times as well as the Horse Gang members that they masqueraded as. He knew very well of the power the barbarians had in the Wilderness. Other than their viciousness and amazing skills in equitation that the cavalry possessed, the palace was also supported by ten High Priests, who were all close to or had reached Knowing Destiny State.</p><br/><p>Therefore, even though he knew that the Golden Palace did not pray to Haotian and didn’t have the legend of Underworld Invasion, he remained highly vigilant as the black horse carriage traveled through the Wilderness.</p><br/><p>Ning Que had been seriously injured in his battle with Ye Hongyu at the swamp and was still recuperating. Sangsang had used the Divine Skill and had used up a lot of Haotian Divine Light. The cold aura in her body stirred and was almost bursting out from the hold that Buddhism had on it. She coughed terribly and her body turned colder and colder.</p><br/><p>He was worried about Sangsang’s health and those who wanted to kill her. He examined the carriage trails and determined that many cultivators from Buddhism and Taoism sects had come to the Wilderness.</p><br/><p>Fortunately, in the days following their departure from the swamp, the Wilderness was overcast with dark clouds. It was difficult to distinguish them from the ones that had been following Sangsang. Furthermore, in the early spring in the Wilderness, birds would fly from Min Mountain and northern Tang Empire, so the black crows no longer stood out.</p><br/><p>Ning Que made a cover from straw and hung it around the horse carriage as a disguise. He dissolved ash in water and smeared it over Big Black Horse. They continued their journey eastward in disguise through the blessings of heaven.</p><br/><p>One day, Sangsang sensed that there were some cultivators pursuing them more than ten miles away.</p><br/><p>Ning Que looked at the vast desolate plains in front of them and realized that there was nowhere to hide. Instead, he steered the carriage into a pile of rubble in the south and hid. If they were discovered – this would be a good place to set an ambush.</p><br/><p>The first to arrive at the plains were not cultivators who came to kill Sangsang, but over a hundred grassland cavalry. The cavalry were in soft armor and behind the troops – a light chariot. Ning Que’s expression turned cold as he deduced that the troops were made up of elite warriors from the palace. The man on the chariot was likely a Priest.</p><br/><p>A moment later, three cultivators rode up north of the pile of rubble, meeting up with the elite cavalry of Golden Palace. The three cultivators carrying Taoist Swords were likely from Haotian Taoism. However, it was unknown whether they were priests from West-Hill Divine Palace or visiting professors from random Taoist temples.</p><br/><p>Ning Que could not hear what they were talking about, but judging by expressions of the three cultivators and posture of the grassland cavalry, the cultivators had behaved how they would when they met ordinary folks. That was to say – prideful, cold and contemptuous. Ning Que could not help but fall silent, knowing that a battle was imminent.</p><br/><p>There were three palaces formed by barbarians of the Wilderness. Right King’s Palace believed in Buddhism and were not aggressive. Left King’s Palace faced the threat of Desolate Man moving southwards, so they were forced to fight side by side with the allied forces of countries in the Central Plains. Golden Palace was the strongest and had never shied from showing their hostility towards those from the Central Plains.</p><br/><p>Ordinary folks had natural reverence towards cultivators. Cavalry from Golden Palace obviously did not. There was a sharp whistle and several cavalries spurred their horses on, leaving the main camp and rushing towards the three cultivators with lightning speed. Boxwood bows in their hands had long been taut and were waiting to be released.</p><br/><p>The three Haotian Taoism cultivators had been cultivating at Taoist temples in the Central Plains year-round. They were deeply respected and feared by the ordinary and never would have thought that they would dare attack them. They grew furious and, with a quick wave of Sword Formula, the Taoist Swords behind them floated up and flew across the Wilderness with the wind, slicing down a rider within seconds.</p><br/><p>Ning Que looked at the glinting swords and realized that the three cultivators were all masters of Seethrough Realm. One of them was already at the peak of Seethrough Realm. It was no wonder they took such a tough stance on the Wilderness.</p><br/><p>Looking at the light chariot behind the cavalry, Ning Que still did not think that the three Haotian Taoism powerhouses could beat the hundred-men-strong elite team. They were from the Golden Palace and not the Central Plains where cultivators could never be challenged.</p><br/><p>Dozens of cavalrymen, who remained in their original positions, shot arrows at the cultivators like rain. One of the cultivators recalled his Taoist Sword and set up a Taoist Sword screen in front of him, blocking most of the arrows. However, cavalry pulled out short spears from their saddles and, with a grunt of effort, threw them at the cultivators.</p><br/><p>Short spears weighed much more than arrows. Dozens of short spears tore through the sky, creating a startling sight.</p><br/><p>The cultivator quickly used the Sword Formula, and his Taoist Sword continuously waved in mid-air. However, unlike before, when it could bat away the arrows easily, it was difficult for the sword to clash against the short spears. In fact, every strike the Taoist Sword made seemed shaky and uneasy.</p><br/><p>There were several plunks as the stiff short spears punctured and wedged into the ground.</p><br/><p>One of the spears pierced through the belly of a horse one of the cultivators was riding. The horse neighed miserably and jumped around painfully, causing the cultivator to fall off.</p><br/><p>The cavalry commander issued an order, and the dozens of cavalrymen staying in reserve joined the charging troops. The first few soldiers charging forth did so at an extremely fast speed as they reached the cultivators.</p><br/><p>The three Haotian Taoism powerhouses glared at them coldly. With a push of their Psyche Power, glints of swords danced in the air. Sounds of riders falling off horses and painful cries of war horses pierced the air. However, power of the Taoist Sword was still limited. It could only tear a small opening in leather armor. Furthermore, there were many soldiers hidden behind the horses where the flying swords could not hit easily.</p><br/><p>Dozens of feet seemed extremely long, but were very short to the cavalry of Golden Palace. In the matter of breaths, hundreds of soldiers rushed forth like a wave, drowning the three cultivators.</p><br/><p>Several blades swishing could be heard and blood splattered all over the place. The palace cavalry spread out, leaving behind corpses of the three cultivators in the middle.</p><br/><p>The powerhouse at the peak of Seethrough laid on the grass, covered in blood. He was holding an item in each of his hands. In his right hand was his weapon, and in his left – a firework signal. According to the agreement he was to activate the signal if he saw Ning Que and Daughter of Yama so as to inform the main troop.</p><br/><p>However, he had no time to use either item in his hand before he was killed by the palace cavalry. One could imagine how fast it had all happened.</p><br/><p>Palace cavalry cleaned up the field and left quickly. Judging by the number of corpses on horses, only about ten had died from the three cultivators’ flying swords.</p><br/><p>…</p><br/><p>…</p><br/><p>An encounter in the Wilderness had turned into a sudden battle. The three cultivators at Seethrough Realm did not have any way of defending themselves against hundreds of palace soldiers, evidently, and were all killed.</p><br/><p>The black horse carriage left the ruins and headed southwards. Ning Que thought of the bloody battle that had started and ended so suddenly. After a moment of consideration, he was once more convinced of a point.</p><br/><p>He believed that non-martial cultivators would not be able to defeat an army if they had not joined the Devil or entered Knowing Destiny State.</p><br/><p>The conclusion was completely different from the impression most ordinary people in the world had. However, it was a fact, because cultivators all have an inevitable weakness – their bodies.</p><br/><p>The body of a cultivator was as weak as that of an ordinary person. It was the same even if he had entered Knowing Destiny State. Arrows and cutlasses can all kill them, much less the tens and thousands of arrows that would fly when two armies fought, or the catapults and crossbows used when a city was attacked.</p><br/><p>More importantly, cultivators use the Qi of Heaven and Earth to control their flying swords. A flying sword’s range was limited by one’s Psyche Power. Most flying swords were unable to exceed the range of an arrow.</p><br/><p>Furthermore, should the flying sword wish to break open all kinds of armor, it would need to be extremely sharp. However, it shouldn’t be too thin – it might be damaged after striking armor. That was why it was so difficult to cast.</p><br/><p>This was precisely why ordinary cultivators did not dare confront a country, and also why they had to serve the imperial courts of various countries. This was also why, traditionally, cultivators would always be closely accompanied by a martial warrior who served as their escort servant.</p><br/><p>Ning Que had never met any cultivators when he was serving in the army of the City of Wei, much less battled with them. He only remembered General Ma’s expression when he talked about stories on the battlefield after getting drunk.</p><br/><p>General Ma was very contemptuous towards them. He thought that cultivators, alone, were strong but not of much use on the battlefield. That was why Ning Que was not surprised by the outcome of battle between the cultivators and the army today.</p><br/><p>However, the course of the battle surprised him – the palace Priest in the light chariot had not made a move throughout. The cavalry had ended the battle cleanly, killing all three cultivators.</p><br/><p>Indeed, the elite cavalry of Golden Palace was still as powerful, and might have even grown more powerful than before. He looked out of the window, at the scenery which was gradually growing familiar, with a gloomy expression.</p><br/><p>The brave and powerful Chanyu of Golden Palace was Li Yu’s husband and little Wild’s father. His early death was indeed a sad thing. His brother had taken over his position as Chanyu, but it seemed that he did not have the wisdom nor talents of his brother. And it was rumored that he was way more ambitious.</p><br/><p>Ning Que was a Tang, and was also a Tang soldier who had stood guard at the borders for years. Even though he was fleeing for his life with Sangsang, it was still difficult for him to not worry about the situation at the Tang Northern Frontier.</p><br/><p>Sangsang looked out at the scenery of the Wilderness. Her face was rosy because of the wind. She asked, “This place looks familiar, have we been here?”</p><br/><p>Ning Que looked out of the window and said, “I’ve brought you here once. We’ll reach Shubi Lake if we continue south.”</p>\n</div>"}