{"title": "Chapter 654 - The City of Wei Got Drunk", "id": 654, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-654-the-city-of-wei-got-drunk", "volume_title": "Volume 7", "body": "<h1>Chapter 654 - The City of Wei Got Drunk</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>It was still dark on the lakeshore when Ning Que woke up, as he did so before daybreak. He threw the remaining mutton into the ashes of a bonfire in front of him and walked to the carriage with Sangsang in his arms. Then he drove the carriage southwards.</p><br/><p>The black carriage no longer moved as fast as it did in the days past. It started before dawn and arrived at the periphery of the city south of Shubi Lake only at high noon.</p><br/><p>Sangsang had already woken up long ago and was leaning against the window. She looked at the increasingly familiar scenery outside without saying anything. Her facial expression remained unchanged until she caught the sight of the loess city wall in the distance.</p><br/><p>Ning Que looked at the city in the distance and said, “Take a good look at it. We may never see it again in the future.”</p><br/><p>Their childhood in Min Mountain had been filled with blood and betrayal. It was not until they came to the City of Wei to join the army that they finally had a relatively peaceful life. Living in this city, they felt warmth of the human world for the first time. They lived there for many years, owned a home and had a lot of debts.</p><br/><p>City of Wei was their real hometown.</p><br/><p>Though Ma Shixiang served as subordinate general in the City of Wei for many years, he had never been promoted, for he had no noble origin and the lack of big wars between Tang Empire and Golden Palace made it hard for him to accumulate martial exploits.</p><br/><p>In another year, he would retire from the military with honor and return his home in Langya County. He was very satisfied with this, because he had saved up a lot of money over the years. The only pity was the decrease in money from firewood cutting in recent years.</p><br/><p>Since that guy left with his handmaiden, the City of Wei seemed to have run out of luck. The pressure on the border of the Tang Empire from Golden Palace in the Wilderness had been increasing. Although Golden Palace still dreaded to cross the border, cavalries of the big tribes often attacked the logistics caravan heading for Helan City under the guise of horse thieves. That annoyed the Seven Stockaded Villages, including the City of Wei, and even the entire northern border troops.</p><br/><p>What worried Ma Shixiang now was another thing. He looked at the black cloud floating gradually towards the City of Wei, with his gray hair shivering slightly. He was wondering how to deal with those bigwigs in the city.</p><br/><p>Many bigwigs came to the City of Wei recently together with hundreds of experienced cavalrymen. Two generals from the Military Ministry of the Tang Empire with dozens of crossbowmen, a dozen officials from Imperial Center Administration and three Lords from the Imperial Astronomers came to this humble border town for some reason.</p><br/><p>It was said that situation of the other six frontier fortresses was similar. But it was obvious that the City of Wei was the focus of those bigwigs in Chang’an. There were several powerhouses from Southern Gate Temple among those Imperial Center Administration officials.</p><br/><p>It seemed that the yamen of Chang’an transferred all its power over here and took over the right of jurisdiction over the border in a quite direct way. Surprisingly, the Northern Military Camp had no drastic response to this at all.</p><br/><p>There was no absolute secret in the world. The reason why these people came to the City of Wei had pervaded over the days. People in the city were shocked, but they could do nothing but to accept it. Because they had seen the edict issued by West-Hill Divine Palace and realized that it was true.</p><br/><p>As the dark cloud approached the city, Ma Shixiang’s mind was getting proportionately weighed down. He did not know what he should or could do. He was so frustrated that he did not even hear the military order, when a high-ranking official from the Military Ministry announced it.</p><br/><p>“General Ma, did you hear me? Go out of town with the cavalry now, rush to the cloud, stop the black carriage outside at all costs!”</p><br/><p>The official shouted gravelly.</p><br/><p>Ma Shixiang was a little relieved at his words and asked, “We just need to drive it away?”</p><br/><p>A Taoist from the Southern Gate Temple said in a gloomy mood, “If there is a chance to kill the daughter of Yama, we will certainly not miss it. Tell your subordinates to act according to circumstances and cooperate with us.”</p><br/><p>…</p><br/><p>…</p><br/><p>Hundreds of border cavalrymen went out of the City of Wei, among them – some horse carriages. Ma Shixiang, at the forefront, rode a horse silently, so did the cavalrymen of the City of Wei. In such a depressingly silent ambience, the troop came to a relatively higher meadow.</p><br/><p>The black cloud had already crossed the meadow. It was so huge that its front end was about to enter the City of Wei, while the other end was still around Shubi Lake. No one knew how many miles it stretched in the sky.</p><br/><p>The cavalry looked up into the sky silently, with complicated expressions on their faces. When they lowered their heads and caught sight of the black carriage moving slowly under the cloud, they could not help crying out in alarm.</p><br/><p>All the adjutants and hundreds of cavalrymen looked towards their general at the same time. Ma Shixiang held the reins, blue veins clearly visible on his hands, with no expression on his face – issuing no command.</p><br/><p>An official of the Imperial Center Administration got off the carriage, saw the black carriage in the distance and suddenly became serious. Then he shouted angrily when he found that no cavalryman around took any action, “What are you waiting for?”</p><br/><p>Ma Shixiang said, “The order I received was not to allow the black carriage to enter the country. Now it is still outside of town, so we only need to wait.”</p><br/><p>The Taoist from Southern Gate Temple shouted in a harsh voice, “This is such a great opportunity to kill the daughter of Yama. What are you waiting for? Do you want to let that carriage go?”</p><br/><p>There was still no expression on his face. “As a soldier of the Tang Empire, I only execute military orders,” he said.</p><br/><p>The official of the Imperial Center Administration hurried to a carriage at the back and shouted to the high-ranking official of the Military Ministry as he waved his arms angrily, “The military must cooperate with us – you must immediately order the cavalry to attack!”</p><br/><p>The Military Ministry official was silent.</p><br/><p>The Imperial Astronomer, whose position was lowest among those people, persuaded him carefully, “The imperial court had issued a document, requesting us to monitor and drive them away, but not to take initiative to attack.”</p><br/><p>Ning Que and Sangsang reappeared in the world and were fleeing, which caused a stir in Chang’an. However, views differed on this matter among different powers within the empire.</p><br/><p>Zhuge Wuren, Chief of the Imperial Center Administration, was a trusted follower of the Empress. He was bent on gathering all the of the power within the empire to destroy the black carriage and kill Ning Que, thus relieving the Empress’s concern. Although Taoist cultivators of Southern Gate Temple did not worry about Ning Que, they put their whole heart into killing Sangsang.</p><br/><p>Princess Li Yu was on friendly terms with Ning Que and Sangsang. However, faced with the possible calamity of the world, she knew that she should keep her silence. However, no one expected that the most significant and powerful piece – the military – was not very active in this matter either, to the point that the high-ranking official of the Military Ministry keeping silent all this time.</p><br/><p>The military enjoyed high status in the Tang Empire, only obeying orders of His Majesty and their superiors. Therefore, so long as the high-ranking official did not give his order, officials of Imperial Center Administration and Taoists of Southern Gate Temple could not order Ma Shixiang and his cavalry to attack, no matter how anxious and angry they were. Without the cooperation and protection of the military, how would they dare approach the black carriage?</p><br/><p>The cavalry stood at the meadow, looking at the black carriage, while people inside the town stood on the city wall, also looking at the black carriage. People inside and outside town held the same complex emotions.</p><br/><p>People in the City of Wei watched Ning Que and Sangsang grow up. They had never expected that Ning Que would make such a big stir after leaving the city, and that his little handmaiden would become the Lady of Light.</p><br/><p>Today, Ning Que and Sangsang were well-known in the whole world. They were the most famous people in the history of the City of Wei – its pride, and whom people always took delight in talking about.</p><br/><p>The owner of a gambling shop looked at the black carriage in the distance, with his hand holding the mud arrow mound, and sighed, “He still owes me a dozen gambling debts. It looks like I can never get them back.”</p><br/><p>A woman whose face was sunburned looked at him and said sarcastically, “The taels of silver sent by Ning Que and Sangsang from Chang’an every month was shared by all the people in the city. Were yours fed to dogs?”</p><br/><p>The owner smiled awkwardly. He said nervously, “I’m just joking… By the way, when I recall how tired the little girl was when she came to buy wine with a flagon every day, I could never imagine that she would become Lady of Light and finally – Daughter of Yama.”</p><br/><p>People on the cob wall, who originally held mixed feelings, became frightened at the sight of the black carriage in the distance. Their face turned pale when they heard the title – Daughter of Yama.</p><br/><p>The woman looked at the crowd and spat at the wall, “Phew! Everyone in the city knows that Ning Que is always up to no good, but Sangsang is kind and has a good heart. How can she be the daughter of Yama?”</p><br/><p>“Edict of West-Hill Divine Palace reads so.”</p><br/><p>“West-Hill Divine Palace said we – the Tang people – are guilty. Why don’t you commit suicide by jumping down the wall to atone for your crime?”</p><br/><p>The argument or even abuse inside the town had no influence on the hundreds of cavalrymen on the meadow, who were still silent. A military officer, who had just taken office this year, could not stand the oppressive atmosphere as well as the pressure from the official of Imperial Center Administration. So he whispered to Ma Shixiang, “General, killing the daughter of Yama is an outstanding merit. It is worth some risks.”</p><br/><p>Ma Shixiang glanced at him and did not speak. Then he looked towards the black carriage and gradually knitted his brows. All of a sudden, he took up the reins and wielded the whip, retraced his path and prepared to return to the city.</p><br/><p>Hundreds of cavalrymen thus followed him to rush down the meadow.</p><br/><p>A Taoist of Southern Gate Temple hurried to the front of Ma Shixiang. He shouted angrily with a sullen face, “Ma Shixiang, what are you doing? If you want to flee, I will kill you.”</p><br/><p>Ma Shixiang shouted, “I will send out troops according to His Majesty’s order. If there is no order, you can blow it out of your ass.”</p><br/><p>Official of the Imperial Center Administration came to rebuke him, “How can you stop the carriage outside the town if you scatter the lineup?”</p><br/><p>Ma Shixiang said, “It will not go into town.”</p><br/><p>The official shouted angrily, “Ning Que is going to the Academy, how can he make it if not via the town?”</p><br/><p>“What the hell do you know of it?”</p><br/><p>Ma Shixiang looked at the official and said contemptuously. Then he kicked the stomach of his horse and forced the official away, leaving with hundreds of cavalrymen. Soon they went into the City of Wei.</p><br/><p>That night, Ma Shixiang, together with several adjutants and all the cavalrymen who had been involved in wood-cutting at Shubi Lake gathered in the only restaurant in town, making it tightly packed.</p><br/><p>They recounted stories about Shubi Lake, the shabby courtyard, the little handmaiden who fetched water every day. They indulged in memories of past events while drinking, and soon finished all the wine stored by the restaurant owner.</p><br/><p>Since Ma Shixiang was the general of City of Wei, no one dared to battle with him, so he drank the most. As he was getting gradually drunk, he looked at the people in the restaurant and said, “Ning Que told me three sentences when he left town. For the sake of those three sentences, I will never turn against him.”</p><br/><p>An adjutant burped and said, “I asked you at that time what was it he told you, but you refused to tell me. Can you speak now?”</p><br/><p>Ma Shixiang stroked his beard and said, “I cannot say. I cannot say.”</p><br/><p>That night, Ma Shixiang got drunk, and so did the City of Wei.</p>\n</div>"}