{"title": "Chapter 661 - Summer Is Coming", "id": 661, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-661-summer-is-coming", "volume_title": "Volume 7", "body": "<h1>Chapter 661 - Summer Is Coming</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Huang Yang asked, “But I still don’t understand why Your Majesty wanted to personally lead the military operation?”</p><br/><p>“In people’s eyes, in yours and Qingshan’s eyes, I must be purposeful. They are all wondering, but in fact, it is very simple.”</p><br/><p>The Emperor laughed and said, “I have been an emperor and lived in Chang’an for more than ten years. I have missed so many beautiful views of the world. If the Underworld is really coming and the Everlasting Night will start in the north, that will be the most spectacular view in thousands of years that I don’t want to miss it.”</p><br/><p>Hearing this, Huang Yang smiled. Then he sighed and thought, His Majesty really was this kind of person. When he was going to ask about other things, he heard steps behind him.</p><br/><p>Holding a little boy, the Empress was walking down from the back building and gently saying something. Her eyes rested on the little boy, fondly and contentedly.</p><br/><p>The Emperor walked toward them.</p><br/><p>The little boy was in bright yellow clothes. Inheriting his parents’ traits, he looked clean and handsome with a little shyness which was influenced by his parents’ temperaments. Judging from his smiles, he seemed to enjoy being together with his parents.</p><br/><p>Looking at the happy family, Huang Yang smiled and turned to look outside. The setting sun was falling on the Wilderness and the mountains looked so dark. The wind was no longer cold and the summer was coming.</p><br/><p>In a side hall of the imperial palace, Chang’an.</p><br/><p>Looking at the young man who was writing by the table, she looked gentle and satisfied.</p><br/><p>The boy prince, Li Huiyuan had grown into a young man. Compared with the previous years, he became thinner and more handsome with perseverance in his eyes.</p><br/><p>Li Huiyuan had become more silent over the past two years. He seemed to have many different opinions on things which Li Yu thought were good for him. She felt that this fact would comfort her dead mother a lot.</p><br/><p>At this moment, she was a sister instead of the most powerful princess of Tang.</p><br/><p>Since the Emperor had gone to the Wilderness, she had to govern the country. Every day she dealt with the court memorials in the main hall. She should be busy but she wasn’t. The national affairs were handled according to its own rules and most of them could be decided by the prime minister and officers. She was more like a supervisor or a judge.</p><br/><p>Li Yu knew very well that she should be calmer than at any other time. Therefore she peacefully performed her duty and won a lot of praise from many ministers, while she spent all the rest of her time talking with her officers on some other subjects.</p><br/><p>“Elder sister, look at my handwriting. What do you think?”</p><br/><p>Li Huiyuan put a new piece of paper in front of Li Yu and said proudly, “My teacher praised me and our father will like it.”</p><br/><p>Li Yu praised him and then she said, “Even if our father likes calligraphy, you still cannot order the post to deliver your handwritings. We should be careful with the post route as the war is about to start.”</p><br/><p>“It’s just a piece of paper.” Li Huiyuan dismissively said, “If I need to open the transmission array to send a message to our father, no one will agree.”</p><br/><p>“Our father likes calligraphy, but he cares more for the future of Tang. The transmission array is too important and the cost to be opened is very high. It’s not a toy for you.”</p><br/><p>Then she seemed to recall something and became sad. She gently said, “Do you remember Ning Que? Our father liked him very much, but he still became an outcast of our country.”</p><br/><p>Li Huiyuan said, “We are family. How could Ning Que compare with us?”</p><br/><p>Li Yu didn’t answer him. Looking at him, she sternly said, “As Ning Que cannot be counted upon and the Academy will not stand by us, we should be more careful in this situation.”</p><br/><p>Looking at her serious expression, Li Huiyuan had to nod while his disagreement was clearly in his eyes. His smiles showed Li Yu a confidence she didn’t have.</p><br/><p>“I’m going to see the Nation Master in the Southern Gate Temple,” said he.</p><br/><p>Li Yu frowned as she never figured out why the Nation Master, who used to be close with the queen, had turned to support them since Ning Que passed through Qinghe County on his trip to the Lanke Temple a year ago.</p><br/><p>The Nation Master of Tang, Li Qingshan could control half of the Southern Gate Temple and the Imperial Center Administration. In any case, his changed attitude would be a piece of good news for them.</p><br/><p>She said, “Since the Nation Master is seriously ill and I am not available to see him, you should go and have a look.”</p><br/><p>In the 17th year of the Tang’s Tianqi era, many funerals happened in Chang’an. All the streets were covered with white banners. Many ministers who had served three emperors as well as high-ranking officials were unable to resist the invasion of time and passed away one after another. The Defender-general of the State, Xu Shi, and the Nation Master, Li Qingshan were both seriously ill, which bothered a lot of people.</p><br/><p>“I’m nothing special but a hard-working cultivator. Thanks to the Emperor, I am able to be the Nation Master of the Tang Empire. My only unique skill is board foretelling.”</p><br/><p>Lying on the bed in the Southern Gate Temple, Li Qingshan looked at the spring view outside the window and said to He Mingchi by his side.</p><br/><p>“I had always thought the Great Divine Priest of Revelation and Master Qishan were just so-so. Until now, I finally understand that fate is unpredictable. The two are wiser than me and have a better vision on this. I have forcibly deduced the future for so many years and I am getting weaker and weaker. As Haotian’s influence gradually fades from me, I will die sooner or later.”</p><br/><p>He Mingchi showed a sad expression and didn’t know how to respond.</p><br/><p>As the Nation Master, Li Qingshan should have entered the Wilderness with the Emperor. However, he was so seriously ill that he had to stay in bed. Therefore, Huang Yang replaced him.</p><br/><p>“I’m not concerned about my life. Since Huang Yang is accompanying the Emperor and they have many powerhouses in the army, I don’t worry about them, either. I am thinking about something else.”</p><br/><p>His smile gradually disappeared. He said, “His Majesty took Her Majesty and the Sixth Prince to Helan City, but left the Princess to manage the country. Many officers in Chang’an believe that the Emperor was going to abdicate to Li Huiyuan by doing this.”</p><br/><p>He paused and continued, “However, no one understands His Majesty better than me. He is not a scheming emperor. He is a real hero and if he has decided to abdicate, he will announce it to the world. He despises this kind of petty means, so he won’t use them.”</p><br/><p>Hearing this, He Mingchi was stunned and asked, “Teacher, then what are you worrying about?”</p><br/><p>Looking at the thick green leaves and thinking of the coming summer, Li Qingshan slowly said, “I am worried that this is an empty joy. If it is, we will be in trouble.”</p><br/><p>At this moment, someone knocked on the door. He Mingchi stood up to answer it. A few moments later, he came back with Li Huiyuan following and said, “Teacher, the Prince comes to see you.”</p><br/><p>Looking at Li Huiyuan’s face which became more and more like the Emperor’s, he felt warm inside.</p><br/><p>When Li Huiyuan went back to the palace, He Mingchi was told to do something for his master, so they left together. The way from the Southern Gate Temple to the palace was short, so they didn’t have much time.</p><br/><p>The inside of the carriage was so dark that Li Huiyuan looked blurred. Looking at He Mingchi, he said after a moment, “I have looked into the thing you told me the year before last year, but I didn’t find any evidence.”</p><br/><p>He Mingchi didn’t answer him, smiling and looking into his eyes. He was not unwilling to talk about this, he just needed more details.</p><br/><p>Li Huiyuan felt a little angry. He asked, “Is the Empress really the Saintess of Diabolism?”</p><br/><p>This was what He Mingchi was waiting for. He nodded and said, “Although we don’t have the evidence, my master knew it. The Academy should know it as well. We will find the evidence sooner or later. I know what you are thinking about. The Southern Gate Temple has been worshiping Haotian for generations and it won’t accept the Saintess of Diabolism’s son as the Emperor of the Tang Empire.”</p><br/><p>Upon hearing this, Li Huiyuan was a little relieved and became happy. Rubbing his hands together, he helplessly said, “Why hasn’t the Nation Master ever exposed her identity?”</p><br/><p>“Because His Majesty won’t agree.”</p><br/><p>Looking at him, He Mingchi calmly said, “Your Highness, please remember, powerful weapons should be used at the perfect moment. You cannot tell anyone, including the Princess, as if you didn’t know this.”</p><br/><p>Li Huiyuan slightly frowned and tried to say something while they arrived at the palace.</p><br/><p>He Mingchi followed him into the palace and went to visit Li Yu. No one knew what they had talked about. Then he went to someplace in the palace. Since he had usually entered the palace with the Nation Master, the eunuchs and maids would not stop the respected priest.</p><br/><p>A few moments later, he reached a small building in the depths of the imperial garden. Pushing aside the bushy branches and stepping over the grass and flowers, he entered the small building.</p><br/><p>Walking along the dark path beneath the building, He Mingchi entered an empty hall where was illuminated by luminous pearls.</p><br/><p>He knew where he was and what he needed to start it. He guessed Ning Que had given the array eye pestle to the Academy. No matter the Nation Master or him, they could do nothing.</p><br/><p>Standing on the boundless ground and thinking of how to activate the array, he closed his eyes and opened his arms, as if he was standing under the night sky, embracing the whole world.</p>\n</div>"}