{"title": "Chapter 666 - Cries of The Desolate", "id": 666, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-666-cries-of-the-desolate", "volume_title": "Volume 7", "body": "<h1>Chapter 666 - Cries of The Desolate</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>No one knew if Haotian would smile when humans thought. And no one knows it Haotian smiled when humans waged war. However, in the end, both thinking and going to war were matters related to mankind. No matter whether Haotian smiled or not, men would still continue to do both. They would think and ponder or shed blood.</p><br/><p>The goshawk flew away, and the dark cloud approached. The war in the Wilderness continued, and at every moment, someone fell. Swords were broken and blood flowed. The dust gradually settled; perhaps because the cavalry was not able to rush at high speeds or because the lands were dampened by blood and littered with bodies.</p><br/><p>In the middle of the battlefield, the powerful Desolate Man soldiers continued to rush forward, tearing out a huge portion of the cavalry from the South Jin Kingdom. The legendary powerful Papal Cavalrymen of the West-Hill Divine Palace were destabilized by them. Of course, they also paid a heavy price for this. Many Desolate Man warriors were felled on the path they charged on.</p><br/><p>Leather coats and sleeves fluttered in the wind, tinged with a heavy scent of blood… and from there, emerged a shadow. Tang, who was bathed in blood, tore through the battlefield like a burning rock, causing more than ten warhorses to be thrown into the air. He tore apart several priests from the West-Hill Divine Palace with his bare hands before reaching Luo Kedi.</p><br/><p>Blood flowed from Tang’s body like a waterfall. It wasn’t his; it all belonged to his enemies. An organ of a priest hung above his shoulder, looking extremely gory.</p><br/><p>Luo Kedi knew who he was and his face paled suddenly as fear overtook him. He instinctively wanted to hide or run but knew that Tang would pulverize him if he did so. Even if he were to survive by sheer luck, the Hierarch Lord would definitely bestow onto him a more miserable fate.</p><br/><p>There was a sharp bellow as Luo Kedi waved his divine blade and brought it down on Tang’s head. The blade whistled sharply in the air as the gold runes on the blade suddenly lit up. The power of the blade grew instantly.</p><br/><p>Tang looked at the falling blade with a deadpanned expression. He punched out with his mountainous fist, which landed squarely on Luo Kedi’s blade. The blade cracked and its hilt shuddered. The hilt which Luo Kedi was holding split open, and then, a terrifyingly immense power traveled up along his arm and assaulted him.</p><br/><p>There was a loud crack, and his shoulder blade broke. Blood gushed out madly from Luo Kedi’s severed appendage. His left arm had become a blade and slashed down viciously onto his shoulder. He was fortunate to survive the assault by breaking the assaulting force through forced resistance.</p><br/><p>Tang leaped into the air just as Luo Kedi fell to the ground. Tang smashed his foot toward Luo Kedi’s head. As he watched the nearing sole caked in blood and mud, a look of despair crossed Luo Kedi’s eyes.</p><br/><p>What he was feeling right now, was exactly like how Cheng Ziqing had felt earlier when he sensed the terrifying blazing fist. However, like Cheng Ziqing, the lightning strike had saved his life, just mere moments before being at death’s door.</p><br/><p>The thunder and lightning just above the Wilderness had been pursuing Tang for a long time, but had not managed to catch up. However, they managed to catch him, just as he seriously injured Luo Kedi.</p><br/><p>Tang smashed his foot down onto the ground, forcing the lightning strike into it. The ground of the Wilderness, which had been moistened by blood, shook and blood squeezed out from between the torn up grass and branches.</p><br/><p>There was a roar of lightning and a Taoist Sword appeared, stabbing through Tang’s abdomen.</p><br/><p>Tang was a Wayfarer of the Devil’s Doctrine. He might even be the last of its wayfarers. He was very powerful and not even the Sword Garret powerhouse, Cheng Ziqing was his match, much less Luo Kedi.</p><br/><p>There were barely any swords in this world that could pierce through his body. But he had been stabbed by one.</p><br/><p>Even so, with the hardness of Tang’s body, it would be difficult to find a sword that could pierce straight through him. However, this sword had managed to pierce his skin, going deep into his body. Blood oozed from the edge of the sword.</p><br/><p>It was not a sharp and unparalleled precious sword, nor was it the undefeatable sword by the quiet pool of the Sword Garret. It was a thin wooden sword that looked exactly the same as it did ten years ago, except that it now had a hilt.</p><br/><p>The person holding the hilt was naturally Ye Su.</p><br/><p>Tang was the World Wayfarer of the Devil’s Doctrine while Ye Su was Haotian Taoism’s World Wayfarer. The two were like the two surfaces of Earth, that would eventually collide and then meet in a deadly battle.</p><br/><p>They were both standing at the very peak of the world, and each had their own pride. Ye Su had faced the Academy’s jun Mo at the Lanke Temple. Jun Mo had turned away, and so had he. Evaluating the current battle in the Wilderness, he had disdainfully dismissed the thought of killing ordinary Desolate Man warriors. Instead, he focused his energy on Tang alone.</p><br/><p>Of course, there was no such thing as absolute fairness. Other than having to avoid Ye Su’s sword, Tang also had to protect his tribesman and fight the powerhouses of Haotian Taoism. Most importantly, he had led the Desolate Man’s tribe to battle against the Central Plains on the Wilderness for many days. To be more precise, he had already been fighting for several years.</p><br/><p>Ye Su, who had been mentally prepared for this, was at his very peak. Against the weary Tang, the result of the battle was not difficult to imagine. The wooden sword pierced deeply into Tang’s abdomen before roaring thunderously.</p><br/><p>A bright red wound appeared on Tang’s abdomen. Blood flowed from his eyes, mouth and nose. This was no longer the blood of his enemy, but his own.</p><br/><p>Tang was seriously injured just as the two met. However, he did not reveal anything on his face and did not look as if he was fearful.</p><br/><p>His legs suddenly burst into flames. The brilliant red flame was like lava from a volcano; blazingly hot and weighing down. His right leg left the ground at an odd angle, and then, he kicked downwards!</p><br/><p>He was clearly standing on the ground and his right leg was only raised up mid-waist. However, when his right leg fell, his leather boots seemed to be stomping right down from the sky!</p><br/><p>There was a sharp clink. Tang’s right foot stepped on the wooden sword viciously and broke it in two.</p><br/><p>The wooden sword was stuck deep in his belly. Tang’s right foot stepping on the wooden sword meant that he had stomped on his abdomen, stirring up his insides. However, he remained expressionless.</p><br/><p>Ye Su’s face was slightly pale. He released the hilt in his right hand and abandoned the sword without hesitating. His thin taoist robe danced lightly in the Wilderness’ wind. An ethereal Qi of Heaven and Earth struck him, causing him to fly about a hundred feet backwards with the wind.</p><br/><p>Tang’s right fist that was like a mountain was tightly clenched and hung by his waist. He was about to strike out but had not because Ye Su had already disappeared from his side and he would only strike at empty air if he were to do so.</p><br/><p>Blood poured out unceasingly. A look of exhaustion finally appeared on Tang’s face. He reached to pull out the remaining half of the wooden sword that was buried in his abdomen. Then, he slowly knelt on one knee and panted heavily.</p><br/><p>The most powerful of The Desolate, Tang, had been seriously injured by Ye Su, the World Wayfarer of Haotian Taoism. It seemed as if the result of the war was evident at this height of the battle in the Wilderness.</p><br/><p>The sounds of fighting on the battlefield gradually sank. The Desolate swift advance had eventually been blocked by the South Jin Kingdom cavalry and West-Hill Divine Palace Papal Cavalrymen. The presence of the Tang riders in the west, numbered in the ten thousands was also overwhelming.</p><br/><p>Just before the Desolate Man’s tribe faced extinction, a low and neat chanting rose. The injured Desolate warriors who could no longer fight began to sing a passage in the scripture, along several senior statesmen.</p><br/><p>That passage was not long, but its syllables were very complicated. They were obviously not characters commonly used in the Central Plains. The Desolate used Central Plains writing, but it was more similar to the primitive characters used in the western parts of the Yuelun Kingdom in ancient times. Not even the Desolate warriors and senior statesmen who led the singing knew that the passage originated from the legendary “Ming” Handscroll from the Tomes of the Arcane.</p><br/><p>As the sound of the scriptures reverberated in the Wilderness, a breath of aura began to emerge on the battlefield. The aura was extremely benevolent and oddly silent. It was as if it came from the blood and the twisted or mutilated bodies on the battlefield, fully exhibiting the meaning of death and reincarnation.</p><br/><p>With the help of a young man, the First Elder of the Desolate Man’s tribe stood up with great difficulty. He looked at Tang, who went down on one knee in the middle of the battlefield, and a decisive look appeared between the deep wrinkles on his face.</p><br/><p>The First Elder began to recite the scripture as well. It was the same passage. His voice was hoarse but grand and bright. Like the wind, it scraped the Wilderness like a cry.</p><br/><p>The tall figure standing on the huge chariot’s platform, in the middle of the West-Hill Divine Palace coalition army, froze slightly. The Hierarch Lord listened to the sound of scriptures being chanted on the Wilderness. He listened to the cry of the Desolate Man senior statesman. He thought silently, that if not for the monks of the Xuankong Temple who had disobeyed orders and refused to aid in the war in the Wilderness, the man would not even have this opportunity to fight for his life.</p><br/><p>In the absence of the Buddhism Sect’s Bhadanta from the Xuankong Temple, someone had to fight The Desolate First Elder. Otherwise, allowing the old man’s chanting was like a cry to continue on the battlefield; both the allied forces of the countries in the Central Plains and the West-Hill Divine Palace Papal Cavalrymen would have to pay a very bitter price.</p><br/><p>The tall figure on the massive chariot could only protect himself in the face of the chanting of The Desolate First Elder. If so, then who was qualified to fight him? Within the West-Hill Divine Palace coalition army, only an old man was qualified.</p><br/><p>The Great Divine Priest of Revelation’s wrinkles grew deeper as he listened to the chanting that came from the far north. He listened to the old man’s cry and said calmly, “It was prophesized that light is in darkness.”</p><br/><p>And then, he said, “It was prophesized, that kindness is found in sacrifice.”</p><br/><p>Finally, he said, “It was prophesized, that the beginning of man is in the light.”</p><br/><p>With these three statements, the wrinkles on the Great Divine Priest of Revelation’s face seemed to be so deep, they looked as if they were carved into his flesh, blood and even the bones of his cheeks. Two thick trails of blood flowed from the corner of his eye.</p><br/><p>Around the divine chariot on which the Great Divine Priest of Revelation sat, there were seven priests in red. Their faces were withered, and their black hair suddenly turned snow white. They suddenly aged decades, and had long stopped breathing.</p><br/><p>The Desolate First Elder slowly closed his eyes and fell back.</p><br/><p>The young soldier who was helping him stand hugged the body, speechless with sorrow. The wounded Desolate around him struggled to stand and then knelt.</p><br/><p>The First Elder’s spirit was strong. Compared to the Great Divine Priest of Revelation, however, who was the strongest of all the West-Hill Divine Palaces, there was still a minute difference. That was why he had died.</p><br/><p>This was a seemingly simple but actually extremely dangerous war. The Great Divine Priest of Revelation had consumed the lives of the seven priests in red before securing victory. Meanwhile, The Desolate First Elder had not used a single Desolate Man until his death.</p><br/><p>In this sense, it was unknown who was stronger.</p>\n</div>"}