{"title": "Chapter 685 - It Must Be Beautiful", "id": 685, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-685-it-must-be-beautiful", "volume_title": "Volume 7", "body": "<h1>Chapter 685 - It Must Be Beautiful</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The Academy was indeed the first in the world. It was first in every aspect. Even when it came to prattling, Headmaster could still do it calmly and elegantly. He could constantly make the person he was talking to want to vomit blood yet cannot do so.</p><br/><p>Ning Que could feel this deeply and hence, he had wisely stopped trying to wrestle with his teacher with words and to make a comparison with reason. Instead, he pointed to the star that was in the dark night sky and said.</p><br/><p>“If the star is located far enough, it would be small enough that even if we were to use a telescope to enlarge it, it would still be hard to capture with one’s eyes. hence, your deduction isn’t as tenable.”</p><br/><p>“if it is far enough and small enough, then why can we see it from the earth?”</p><br/><p>Headmaster slowly stroked the cold side of the boat as he looked up at the few lonely stars in the sky. he seemed to have thought of something from the past as he smiled slightly and said, “Many years ago, I once flew across the sky.”</p><br/><p>This was the first time Ning Que knew that his teacher had done such a fearless act. He tried to imagine his teacher riding the winds in the skies and was extremely shocked as he asked, “Why did you want to fly?”</p><br/><p>The Headmaster turned to look at him and said, “When you see a mountain, do you not want to know what’s behind it? If you see a tall wall, do you not want to know what is behind the wall?”</p><br/><p>Ning Que thought for a while before saying, “There will always be curiosity.”</p><br/><p>The Headmaster laughed and said, “I am curious too. I want to know how high is the sky exactly. Whether there is a limit to this world. I want to know how far those stars are.”</p><br/><p>Ning Que felt nervous all of a sudden as he asked with a rough voice, “And then?”</p><br/><p>Headmaster said, “I flew for a long time but the sky was still as high and there were no changes to the stars. What I couldn’t understand was the ground below my feet seemed to be at its original place.”</p><br/><p>“How long did you fly? What happened in the end?”</p><br/><p>“There were day and night in the sky too but back then, I had no mood to calculate the years. There were eagles in the azure blue skies first with white clouds appearing. After that, there was nothing, only me.”</p><br/><p>Headmaster said, “It was lonely and my heart was getting more and more tired. I then turned and flew back. When I landed on the ground of the mortal world, I realized that more than 30 years had passed.”</p><br/><p>Besides shock and yearning, there were no other emotions in Ning Que’s heart now.</p><br/><p>In the rules of the world that he was familiar with, the atmosphere covered the ground. Headmaster flew for such a long time then, he should have flown out of the atmosphere and perhaps, even out of the solar system. However, the Headmaster’s experiences wasn’t that. This seemed to show that the Headmaster’s guess was correct.</p><br/><p>This was an enclosed and borderless world. However, what was this world made of?</p><br/><p>“Mobius strip?” He said to himself.</p><br/><p>Headmaster hadn’t heard of this before and asked, “What strip?”</p><br/><p>Sangsang had kept quiet beside them, listening to them speak. At this moment, she recalled this strip that Ning Que had told her when she was young and she said, “There is only one side to a piece of paper and it is impossible to walk out of it.”</p><br/><p>Headmaster furrowed his brows slightly and said, “How can a piece of paper only have one side?”</p><br/><p>Ning Que regained his senses and said, “Her explanation isn’t accurate but the idea is there.”</p><br/><p>Headmaster’s eyes lit up as he said, “Teach me.”</p><br/><p>Ning Que said, “Alright.”</p><br/><p>The big ship left the harbor and entered the dark ocean as it continued north. This snowy peak was said to be the northernmost peak in the mortal world and it slowly disappeared from their field of vision. Or perhaps more accurately, it got shorter in their field of vision.</p><br/><p>Other things appeared within sight. A bright and red sun leaped from the surface of the sea. Just like what Headmaster had once said, the sun appeared suddenly without any warning.</p><br/><p>Ning Que hadn’t expected that the sun would rise even further north of the dark oceans. He was shocked speechless by the scene in front of him and he couldn’t understand it.</p><br/><p>The ship continued north and the number of times they saw the sun only got more frequent. The sun stayed in the sky for a longer time and the dark ocean water slowly turned a beautiful dark blue.</p><br/><p>As time passed, it wasn’t only sea water beside the large ship. Islands that were covered with snows, swimming fishes all appeared. They even saw a coastline one day.</p><br/><p>Headmaster brought him and Sangsang up the coast to take a look at the scenery. They then boarded the ship and continued north. along the way, they went to the cold plateaus and they saw large masses of land that were uninhabited and covered with moss. They saw animals of various shapes and even saw a huge salt lake that was like a mirror.</p><br/><p>This was a strange world that was unrecorded. Headmaster brought them to travel and they visited many beautiful places and ate many things they hadn’t tried before. Of course, these food were delicious.</p><br/><p>One day, Ning Que asked, “Teacher, have you been to all these places before?”</p><br/><p>The Headmaster said, “Over the years, to find the Underworld and the edge of the world, I have been to many places. Sometimes, I would bring your Eldest brother while at other times, I would travel alone.”</p><br/><p>Ning Que asked, “Why must you find the edge of the world?”</p><br/><p>The Headmaster looked at the azure blue sky and said, “To find the edge of the world, I have even been to the skies. Do you think I wouldn’t want to know the real appearance of the world beneath my feet?”</p><br/><p>Only then did Ning Que realized he had asked a very stupid question. He said, “Where is the edge of the world?”</p><br/><p>Headmaster said, “There is no edge of this world.”</p><br/><p>Ning Que said, “The universe is limitless, this is normal.”</p><br/><p>Headmaster looked at him and smiled, “But you know this world isn’t limitless.”</p><br/><p>Ning Que could only keep silent.</p><br/><p>The large ship continued sailing in the sea. They didn’t meet with any storm. They would fish, feed the seagulls, sunbathe and drink the wine that was stored in the cabin. Such days were happy but Ning Que couldn’t help but feel uneasy.</p><br/><p>Headmaster didn’t have much reaction. Besides enjoying life, he would only do two things.</p><br/><p>He taught Sangsang to make the most delicious food in the world and to enjoy the finer things in life. He then ordered Ning Que to teach him things that weren’t found in this world.</p><br/><p>They were knowledge. Knowledge that didn’t belong to this world.</p><br/><p>Ning Que cut the paper tape and talked about the Mobius Strip. Drawing a 3D diagram on the paper with a pen, he described the different variations and talked about many things related to physics. However, when he came to this world, he was still young and no matter how good his results were, the things that he could talk about were very shallow.</p><br/><p>The Headmaster didn’t ask him where he got all his knowledge from. Ning Que didn’t say either. The two of them seemed to have formed a certain chemistry between them, or perhaps, they both already knew well.</p><br/><p>After traveling in the ocean for dozens of days, ships finally appeared on the sea surface.</p><br/><p>The ships quickly got denser. The big black horse that was bored for a long time extended its head out of the side of the ship. Looking at these familiar humans, it hissed merrily, scaring the people on board those ships.</p><br/><p>A thousand sails traveling between the green waves. It was a beautiful image. As Ning Que looked at it, he got increasingly silent. Even though he was mentally prepared, he still found it hard to accept.</p><br/><p>After talking with the people on those boats, he knew that after traveling north for ten over miles, they would reach the southernmost port of the Great River Kingdom. In other words, they had returned to the mortal world.</p><br/><p>Since leaving Far North cold region of the Wilderness, the ship was always traveling north. How could it have reached the south? Headmaster didn’t use his great powers, how did all these happen?</p><br/><p>Ning Que looked at the shadows of the sails in the distance and murmured, “It is not the case of seeing the tip of the sail first then the ship’s body. This means the world is indeed flat. How then did we come back?”</p><br/><p>Headmaster brought over a glass of wine and walked over to him before saying, “Back when we were at the mountain behind the Academy, we have discussed something similar. I said that if it was a ball, it would describe many phenomena. But since the world we are in isn’t a ball and it isn’t flat, it can only mean that it is twisted.”</p><br/><p>“Just like the strip you mentioned.”</p><br/><p>Ning Que said, “I have never seen such a strange world.”</p><br/><p>Headmaster took a sip of the wine and said, “What is the world that you have seen before?”</p><br/><p>Ning Que looked at the meaning in his teacher’s eyes, not knowing what to say.</p><br/><p>The Headmaster said, “The world that you said you have seen in your dreams, can you describe that world?”</p><br/><p>Ning Que was silent for a long time before saying, “The world that I had dreamt… it has a sun too.”</p><br/><p>“What did that sun looked like?”</p><br/><p>“Almost the same as this one… but I am sure that the sun in my dream is real. It is a big fireball that can burn for many years. All the energy and nutrients basically come from it. As to how it can burn for such a long time, they come from the formula that I talked to you about a few days ago.”</p><br/><p>“Oh, that was a simple and beautiful yet infinite formula.”</p><br/><p>“Yes… the humans in the dream also live on a ball.”</p><br/><p>“And they wouldn’t fall because there is an attractive force between everything?”</p><br/><p>“Yes, teacher.”</p><br/><p>Time slowly passed as the teacher and disciple discussed. This was the first time the Headmaster had any interactions with another world. It was the first time that Ning Que had discussed that world to anyone else. The one listening sighed with emotions while the one saying was filled with emotions too.</p><br/><p>As night descended on the surface of the sea, stars filled the night skies.</p><br/><p>Ning Que looked at the night sky and said, “The world that I dreamed of has stars in the night sky too. However, they are moving. They move in our vision because of the ground under the people’s feet. In actual fact, in the seemingly limitless and far space of the universe, they are moving too.”</p><br/><p>Headmaster sighed and said, “A world that is constantly changing, what kind of vitality must it have.”</p><br/><p>Ning Que said, “The largest difference isn’t the stars, it is the moon.”</p><br/><p>He pointed to the night sky and said, “If there are no clouds in the night sky, people would be able to see the moon Sometimes it is as round as a biscuit but at times, it is as thin and curved as a slice of melon.”</p><br/><p>He didn’t explain why the moon would change but he knew that his teacher would definitely understand.</p><br/><p>The Headmaster lifted his head to the skies. It was as if he saw a bright moon appearing as he smiled and said, “The bright moon is born in the long night, that must be a pretty image.”</p>\n</div>"}