{"title": "Chapter 683 - Picking Fish and Remains in the Sea of Snow", "id": 683, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-683-picking-fish-and-remains-in-the-sea-of-snow", "volume_title": "Volume 7", "body": "<h1>Chapter 683 - Picking Fish and Remains in the Sea of Snow</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Ning Que had been extremely tense and anxious since the Light of Buddha shone upon the Lanke Temple. He only managed to relax and feel safe when the Headmaster appeared on the Wilderness. However, he had not expected that his teacher would lead him into a discussion on an enigmatic topic that was suppressive and made him uneasy.</p><br/><p>He grew anxious once more. He had finally thought of a possibility that would turn the dark world bright again, but the answer his teacher gave was cold and seemed to be leading into an even more terrifying territory. He could not bear it anymore and broke down on the spot.</p><br/><p>He jumped up and waved his arms, yelling angrily, “How can it be fake? The sun rises every day from the east and sets in the west. Summers in Chang’an are sweltering hot. How can it be fake!”</p><br/><p>The Headmaster was shocked by his reaction and said, “We are only having a discussion, you don’t have to be so worked up.”</p><br/><p>Ning Que was still riled up and he said, “How can I not be worked up? Forget about Haotian eating people. Now you want me to believe that the sun is fake. Then is this world fake as well? Don’t tell me that even though I’ve lived in this world for so many years, it’s just a dream! I won’t believe your ludicrous claims! How can it be fake? I’ve been taking care of her for so many years, has it all been for nothing?”</p><br/><p>The Headmaster thought of how unfilial Ning Que was, for all he was concerned about was whether he had been wasting his time raising Sangsang when he was so worked up and was on the brink of a mental collapse. He said annoyedly, “The sun is fake, but that doesn’t mean that we are.”</p><br/><p>Ning Que pointed at the faint sun hanging above the Wilderness. He said, “That can’t be fake! What is the sun? It’s Haotian Divine Light! Why can’t Haotian eat that instead of eating the Qi of Heaven and Earth?”</p><br/><p>“Have you ever considered that the Haotian Divine Light the sun gives out is not Haotian’s food but the outward form of Haotian? It is just like how our outer form appears to be flesh. Are we going to eat human flesh?”</p><br/><p>“Is there anything we won’t do if we are starving? Who are we to stop it if Haotian likes to eat itself?”</p><br/><p>“The question is, it has other things to eat. So why does it have to eat itself?”</p><br/><p>“Does it have exquisite tastes?”</p><br/><p>“Even if Haotian could eat Divine Light, the Divine Light still comes from it. Could Haotian eat it forever? This is a simple calculation problem.”</p><br/><p>“I have never said that the sun is Haotian. You said that. To me, the sun can produce heat and is the source of all nutrients. Why won’t Haotian eat it?”</p><br/><p>The argument between the Headmaster and Ning Que grew fiercer and they spoke faster and faster. Their spit flew all over the meadow. Sangsang did not know how to appease them, so she only looked down, cleared the dishes and extinguished the bonfire.</p><br/><p>“Can the sun continue to emit heat and light?”</p><br/><p>“It should not be a problem for a few billion years.”</p><br/><p>“Then how is it able to emit heat and light continuously?”</p><br/><p>“This involves a more profound reasoning that I can’t explain to you within a short time.”</p><br/><p>“Alright, alright. Even if what you said is reasonable, the sun can emit heat and light for billions of years. What happens after that?”</p><br/><p>“You can consume a meal over billions of years. What’s there for Haotian to be dissatisfied with?”</p><br/><p>“Then can you explain clearly why there is no sun during the Everlasting Night?”</p><br/><p>Ning Que did not speak anymore because he recalled then, that this was Haotian’s world. He was not in the world that he had once been familiar with. That world had already slowly faded away in his memory.</p><br/><p>Seeing that Ning Que had no retort, the Headmaster stroke his beard and said in a self-satisfied manner, “There are flaws to your conjecture and it is not as reasonable as mine. When I started thinking about these things, you were still in Third Mistress Li’s tummy. That’s why you should just listen to me. What’s the point of arguing and wasting time?”</p><br/><p>Ning Que said, “Don’t talk about my mother. Even though you’re my teacher, I’d still turn against you if you mention her.”</p><br/><p>The Headmaster asked, “Why?”</p><br/><p>Ning Que answered, “When my parents were killed, you just watched from the Academy and did not save them.”</p><br/><p>The Headmaster said, “There are so many people who die on earth every day. Do I have to save every one of them?”</p><br/><p>“You knew that I would become your student in the future, so why did you not save them? Did you think that if you saved them I might not become your student? Isn’t that too vicious?”</p><br/><p>“Everyone will die. Your parent’s death was Heaven’s will. I couldn’t interfere.”</p><br/><p>“Teacher, what have you been doing your entire life? You have been going against Heaven! Why didn’t you dare to interfere in Heaven’s will?”</p><br/><p>“Because I can’t see clearly what true Heaven’s will is. That’s why I have to be careful. If I interfere in it and heaven’s will lands on me just like it has now, what am I to do?”</p><br/><p>“So you think that your life is more important than the lives of others.”</p><br/><p>“That’s a fact.”</p><br/><p>“Are you so openly selfish?”</p><br/><p>“I’m too important to the world. My selfishness is justified.”</p><br/><p>“I suddenly understood something.”</p><br/><p>“What’s it?”</p><br/><p>“I understand where Youngest Uncle and Second Brother got their arrogance and narcissistic tendencies.”</p><br/><p>“Enough.”</p><br/><p>Sangsang could not stand the pair anymore. She looked at them and said seriously, “I don’t understand what you two are talking about. But I want to know where we are headed to next.”</p><br/><p>The black horse carriage arrived at a very cold place.</p><br/><p>The cold wind blew angrily and the dark night was like a curtain. The stars shone dimly. They were at the Cold Region of the Far North by the Hot Sea.</p><br/><p>However, the surface of the Hot Sea had long frozen over and was covered by a thick layer of snow. It looked more like a sea of snow.</p><br/><p>Even the Big Black Horse, which was no ordinary creature, was affected by the cold. It hid by the carriage, shivering, trying to avoid the storm and snow cutting across the Hot Sea’s surface.</p><br/><p>The Headmaster took Ning Que and Sangsang to the Hot Sea. The snow layer that was as tall as a man fell apart where they stepped. The wind then swept it away to two sides, revealing a passage.</p><br/><p>After walking a long distance and reaching where the sea was the deepest, the Headmaster stopped.</p><br/><p>He stretched out his hand and pointed to the sea’s surface. A hole about the size of a bucket appeared in the hard layer of ice. It was several hundreds feet deep, reaching all the way down to the bottom of the sea that had yet to freeze completely.</p><br/><p>Sangsang wrapped her clothes around her tightly. She ran to the side of the hole, waiting with a wooden basin in her hand. She yawned, and the mist turning into frost.</p><br/><p>Before long, a few fat and tender fish jumped from the ice hole and fell into the wooden basin. It was unknown what the Headmaster did to make the fish jump out of the ice hole which was over ten feet deep.</p><br/><p>The Headmaster froze slightly and yelled, “Move!”</p><br/><p>Ning Que’s heart constricted. Then, his right forefinger flicked and a Fire Fu raised in the storm and snow, landing into the wooden basin accurately. A blazing warmth rose, separating the fish from the cold air.</p><br/><p>The Headmaster nodded contentedly when he saw that. He said, “The variable platyfish can be frozen. It tastes best when it is defrosted medium well. However, the temperature of the sea’s surface today is too low. It might overly freeze them if we’re not careful. Your Talisman Taoism abilities are almost at Yan Se’s calibre, I suppose you’re qualified to eat this fish.”</p><br/><p>Sangsang’s cooking skills were ordinary, but her knife skills were extremely accurate, just like her extraordinary calculation abilities. In a short moment, the cutting board was filled with thin pieces of fish that were like snowflakes. As they piled up on the board, it looked as if several white peonies had grown on the wooden board.</p><br/><p>They were in a tent abandoned by the Desolate. Ning Que supported the Fire Fu with some thick logs he had picked up, and the temperature in the tent became quite pleasant.</p><br/><p>“Sangsang’s knife skills are much better than Manman’s.”</p><br/><p>The Headmaster praised.</p><br/><p>Ning Que laid out the bowls and chopsticks and they prepared to eat.</p><br/><p>He felt that they had eaten too much that day. Even though they ate the best things on earth with his teacher, but should one carry too much money on his person, he would feel the weight of it too.</p><br/><p>The Headmaster mixed the soy sauce, ginger juice and a green seasoning. He took a slice of fish and dipped it lightly into the bowl like a willow branch caressing the lake’s surface. Then, he sent the meat into his mouth and chewed slowly.</p><br/><p>Moments later, he opened his eyes and lamented, “This fish is not as fleshy and tender as that of last year. We can only just make do. Speaking of which, the Hot Sea is about to freeze all the way to the bottom. I wonder how many variable platyfish are left.”</p><br/><p>Ning Que could not bear to pick up his chopsticks upon hearing this. Or perhaps he had just eaten too much. He said, “Teacher, since there’s few platyfish in the Hot Sea, then isn’t it a pity to eat them all?”</p><br/><p>The Headmaster lectured, “You stupid boy, we have to quickly eat them precisely because there aren’t many of them left. When the variable platyfish goes extinct, where are we going to find them?”</p><br/><p>Ning Que smiled and said, “Being frozen to death is still better than being eaten raw by us.”</p><br/><p>The Headmaster said, “Such a delicious fish; being eaten by us is their best fate.”</p><br/><p>Ning Que scolded the Headmaster in his mind. <em>“I don’t see you thinking it’s your best fate to be eaten by Haotian.”</em></p><br/><p>The variable platyfish was very delicious, but there was not a lot of it. It was quickly eaten up by the three. Most of the fish went into the Headmaster’s stomach, and perhaps because he felt bad about that, the Headmaster kindly used his power to make two hot springs in the frozen sea of snow for them to enjoy.</p><br/><p>The water was hot and steaming and there were gravel and remnants of snow by the pool. The scene looked captivating under the starlight. Ning Que felt very comfortable soaking in the hot water.</p><br/><p>Sangsang sat beside him and said softly, “You argue with the Headmaster too often.”</p><br/><p>Ning Que fell silent for a moment before saying, “Argument livens up the atmosphere… I keep thinking that something is wrong.”</p><br/><p>Sangsang looked at him with wide eyes and asked in confusion, “What’s wrong?”</p><br/><p>Ning Que said, “Don’t you think that teacher is acting very weird? He took us to eat such delicacies and said so much. Why did he not say all that back when we were at the Academy?”</p><br/><p>Sangsang asked, “What’s your point?”</p><br/><p>Ning Que looked at her and said, “I think that teacher is trying to tell us his last words, just like how you told me what to do once you’ve passed away at Tile Mountain.”</p><br/><p>Sangsang froze slightly when he heard that. Then, she said softly, “What nonsense are you thinking?”</p><br/><p>Ning Que frowned slightly and said, “I hope that I’m just thinking nonsense… As disciples of the Academy, we believe that our teacher is the strongest. Especially after this time, I believe in that even more firmly. Other than Haotian, there is no other existence that can threaten him. However, for some reason, I feel that something is wrong.”</p>\n</div>"}