{"title": "Chapter 688 - The Headmaster's Story (Part 2)", "id": 688, "volume": 7, "url": "http://boxnovel.org/nightfall-chapter-688-the-headmasters-story-part-2", "volume_title": "Volume 7", "body": "<h1>Chapter 688 - The Headmaster's Story (Part 2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The Headmaster had told his First Disciple and many other people that he was not all knowing and all powerful. To many, this was normal. To the Eldest Brother and other disciples of the Academy who believed in their teacher unconditionally, the Headmaster was too humble, which led to him seeming proud.</p><br/><p>In fact, the Headmaster knew that, for example right then, he could not understand Ning Que’s joke and could not understand the praise in Ning Que’s statement. He thought about it but did not understand, and so, he decided not to waste time to think about it and continued telling his tale.</p><br/><p>“From then on, I became the West-Hill Divine Palace’s library Taoist. I entered the library to read, so I would naturally not miss such a great opportunity. I read voraciously. The more I read, the more I understood, and I broke through the No Doubts and Seethrough States and continued forth. My cultivation state was improved. That was when I found that every time I read, there was a Taoist who also read in the library. You have to understand that the Divine Hall back then was different from how it is today. Taoists liked to go to the mortal realm to enjoy themselves and were unabashed about it. There was no one to control them. That’s why the Taoists back then did not like reading, so the Taoist in the library seemed special.”</p><br/><p>Many years had passed since then, and the Headmaster’s memory was fuzzy. He thought in silence for a moment to make sure that he remembered correctly and continued, “The Taoist and I read in the library for many years. After that, we grew bored after we had read all the classics and books in the library.”</p><br/><p>“The world was in chaos then. Dominant Families in all states might like to keep books, but they were not any good. After some discussion, the Taoist and I thought that there were still the seven Tomes of the Arcane in the Zhishou Abbey that we had not read. So we…”</p><br/><p>“Hang on.” Ning Que said in surprise, “You’re saying that you and the Taoist went to Zhishou Abbey to read the Tomes of the Arcane because you guys were so bored you wanted to find a book to read?”</p><br/><p>The Headmaster said, “I was still not very interested in cultivation back then. If not for the seven Tomes of the Arcane being the only remaining tomes in the world, why would I think of traveling through mountains and forests to look for the Zhishou Abbey?”</p><br/><p>Ning Que was speechless and realized that he could not understand the thought processes of people from a thousand years ago.</p><br/><p>“And then?”</p><br/><p>“The people in West-Hill Divine Palace all knew of the Zhishou Abbey but did not know where it was. The Taoist and I thought that it would be difficult to find, but we found it easily.”</p><br/><p>“That’s because you and that Taoist… were not ordinary people. What happened after that?”</p><br/><p>“After that? We stayed in the Zhishou Abbey to read, of course. The Taoist in the abbey would definitely not let us read them, so we did it in secret. It was fine as long as we were not discovered.”</p><br/><p>“You read all seven scrolls from the Tomes of the Arcane?”</p><br/><p>“If there were more scrolls, I would naturally be able to read more of them.”</p><br/><p>“You’d better continue with your story.”</p><br/><p>“The seven scrolls of the Tomes of the Arcane were very interesting. But the more we read, the more doubts we had. The Taoist and I began to develop certain questions, especially after reading the ‘Ming’ Handscroll.”</p><br/><p>The Headmaster said, “But these were not my main considerations at that point in time. That’s why I waited for the Taoist to finish the seven scrolls, and then, we returned to the West-Hill Divine Palace.”</p><br/><p>“Who was that Taoist?”</p><br/><p>“After some years, the Taoist entered the Divine Hall of Light and became the Great Divine Priest of Light.”</p><br/><p>The Headmaster looked at Sangsang and said, “Just like her teacher, they both were rather awe-worthy but not at the same time. He was a person who could make someone laugh and cry at the same time.”</p><br/><p>Ning Que thought of a certain possibility. He counted on his fingers and asked, “Which Divine Priest of Light was it?”</p><br/><p>“Who else could it be?”</p><br/><p>The Headmaster shook his head and said, “The Divine Hall asked him to preach in the Wilderness, so there he went. If he wanted to betray the sect and set up his own, then so be it. However, he ran to the Zhishou Abbey and stole the ‘Ming’ Handscroll. It was so annoying.”</p><br/><p>Ning Que said, “I remember that it was Haotian Taoism who asked the Divine Priest of Light to bring the ‘Ming’ Handscroll to the Wilderness.”</p><br/><p>The Headmaster said sarcastically, “Haotian Taoism is the best at saying whatever that will save them from embarrassment. Actually, the Zhishou Abbey discovered the theft of the Tomes of the Arcane and made a fuss. They even discovered that that fellow and I went to read them. I had no choice but to leave the Peach Mountain. It was fortunate that the Divine Hall didn’t take notice of a small fry like me.”</p><br/><p>“After leaving the Peach Mountain, I traveled the world. I said earlier, that the world was in chaos back then, and there were endless wars. The world was at a dark time and was worse than it is now. Haotian Taoism united, and the Divine Hall became the largest faction. Yet, they did not bother with worldly affairs. Cultivators bullied and humiliated ordinary folks, the power of the royals in the secular world was weak, and the world was a mess.”</p><br/><p>“The only exception was the kingdom of the Desolate in the Wilderness. The Desolate were physically strong by nature, so cultivators did not dare to act as they wished. That fellow stole the “Ming” Handscroll of the Tomes of the Arcane because he had developed doubts about Haotian. That’s why I was not surprised when he chose the Wilderness.”</p><br/><p>“You should know what happened to that fellow after that. He betrayed the West-Hill Divine Palace and started the Enlightenment Doctrine with a scroll from the Tomes of the Arcane. That later became the Devil’s Doctrine.”</p><br/><p>Ning Que was very shocked when he heard this millennia-old tale. He had finally understood why the Academy had never made any differentiation between the path of the righteous and the devil. No matter whether it was him or his Youngest Uncle who had joined the Devil, the Headmaster did not care. He even had Third Sister accept Tang Xiaotang as her disciple. It was because he knew the person who started the Devil’s Doctrine.</p><br/><p>They were friends.</p><br/><p>“Even though I still think that he was fooling around, making the shady Devil’s Doctrine that is so warped and boring, I have to admit that his actions then caused a great shock to the world. It also indirectly led to some good end results.”</p><br/><p>“What results?”</p><br/><p>“Haotian Taoism was wary of his preaching in the Desolate’s kingdom, so they had to bring peace to the Central Plains. The Divine Hall cleared up, and the people in the secular world led better lives. Of course, this just meant that they lived longer and their bodies became stronger. If there were any wars in the future, they’d be able to fight. In actuality, the lives of the people were just as bad and they lived no better than dogs. People died every day, everywhere.”</p><br/><p>The Headmaster said, after a moment of silence, “Those who had not lived through the chaos then can hardly understand how great the world is now. Sometimes, I don’t understand how people managed to survive through the chaos and pain and still prosper. I guess we can only say that the vitality of humans is scary.”</p><br/><p>“But I feel that men should not live like that. They should not live like beasts or worse than dogs. We should eat dogs, and not be eaten by them.”</p><br/><p>The Headmaster’s expression turned grave and he looked at Ning Que, saying, “I wanted to end the chaos on Earth. I felt that the first thing to do was to set rules and then preach about benevolence. The results would be better If we could ignite intelligence and emphasize faith. So I started teaching in the countryside to tell the world these truths.”</p><br/><p>Ning Que remained silent and listened quietly and intently.</p><br/><p>“What troubled me was that no one was willing to listen to my lessons. Some places were too poor that they were worried only about food. They did not have the mood to listen to me. In other places, the Taoist temple did not like to allow me to hold lessons. At some other places, the people did not like my lessons because I charge for them.”</p><br/><p>“You can choose not to charge them.”</p><br/><p>“What will I eat if I don’t charge them? I’ve got to eat.”</p><br/><p>“Teacher, you are really a realistic idealist.”</p><br/><p>“I like this praise very much. Back then, I kept encountering walls in reality, but I did not give up on this dream. I just sobered up and realized that to influence the world, it didn’t matter how strong I was. I had to have the help of a worldly political power or a religious sect like Haotian Taoism.”</p><br/><p>“At that time, I was lecturing in Xianyang village, west of the Wei River. A young man came to look for me in the middle of the night after hearing my lecture. I thought he wanted to become my disciple, so I asked him to return after getting three pounds of meat from the east of the village. I didn’t expect that he was not here to become my disciple, but was there to recruit men.”</p><br/><p>“To put it simply, that night, the young man talked about his dreams. I found that his dream was also to end the troubled times. I liked it and continued listening to him.”</p><br/><p>“So you became his subordinate just like that?”</p><br/><p>“How can I become someone’s subordinate? I just agreed to help him.”</p><br/><p>“Teacher, that young man… was his surname Li?”</p><br/><p>“That’s right.”</p><br/><p>The black horse carriage left the Peach Mountain and arrived at Chang’an.</p><br/><p>“The Desolate were powerful and the West-Hill Divine Palace could not fight them just with cultivators alone. That’s how the order of the world began. As the armies of various countries flourished and imperial power grew, the Tang Empire used the opportunity to accumulate power and strength. It encountered several smooth sailing years, and the country grew stronger and they built Chang’an city.</p><br/><p>The Headmaster looked out of the window at the millennium-old city, thinking of how it looked like when it was being built. With a nostalgic expression, he said, “When the city was being built, I spent the happiest days of my life.”</p><br/><p>Ning Que looked at the moss on the huge bricks of the city walls. He was speechless as he thought of the feelings he once had for the city and thought of how he had once been awed by the sages who had built it.</p><br/><p>He was frequently at a loss for words since the Headmaster started his tale.</p><br/><p>When you find out that the most legendary part of history, the greatest years and the glory that could not be erased by time was beside you, you could only express your shock through silence.</p><br/><p>Ning Que regained consciousness after a long time, and he muttered, “You built Chang’an, so you must have built the God-stunning Array.”</p><br/><p>The Headmaster said, “Yan Se gave the array eye pestle to you, yet some Taoists in the Southern Gate Temple did not like that…The array is mine, so it is naturally right to pass it to you.”</p><br/><p>Ning Que said, “Of course, it is naturally right.”</p><br/><p>“What happened after that?”</p><br/><p>“After that, the Tang Empire began to attack other countries, trying to unify the lands.”</p><br/><p>“Why did it fail?”</p><br/><p>“It defeated all other lands, but there was still the West-Hill Divine Palace.”</p><br/><p>“Teacher, why did you not attack with them?”</p><br/><p>“How can someone like me attack casually. My inaction was the greatest shock… Alright, I admit that although I was very strong back then, I was not strong enough. At least, I wasn’t certain that I could defeat the West-Hill Divine Palace and suppress all its disciples without alarming Haotian.”</p><br/><p>“Teacher, so that means you’re strong enough for it now.”</p><br/><p>“Back then, the ones who were truly powerful were the Desolate. That fellow preached in the Wilderness for many years and the Devil’s Doctrine was so powerful they were prepared to head south. The Tang Empire is situated in the north and was the first to bear the brunt of their attack. There was no way to avoid the sharp blades of the Desolate and the empire was forced to send troops into the depths of the Wilderness. I fought with that fellow too.”</p><br/><p>“Who won?”</p><br/><p>“I don’t like fighting as much as your Youngest Uncle. I seldom fight, but I have never lost a fight.”</p>\n</div>"}