{"title": "Chapter 712", "id": 712, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-712", "volume_title": "Volume 8", "body": "<h1>Chapter 712</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Wang Jinglue poured the feet-washing water outside the tent, took a towel to wipe Xu Shi’s feet and rubbed the calluses on the general’s soles.</p><br/><p>“According to my predictions, I fear that the imperial edict has reached the Southern Army by now. We snuck away and went against the laws of the Tang Empire. What if an accident happens?”</p><br/><p>“I didn’t leave with the whole army. These more than a hundred guards are private guards that His Majesty gifted to me back then. I only came to the mountains to recuperate from my illness. How is this violating the Tang military laws? Even if I have done so, is there anyone who would dare punish me?”</p><br/><p>“Alright, alright. Just forget what I’ve said. Why is your temper getting worse?”</p><br/><p>Wang Jinglue said slightly testily.</p><br/><p>Xu Shi was really like a child now. Seeing that Wang Jinglue was angry, he smiled happily and consoled him, “Don’t worry, I am the Defender-general of the State. What danger can befall us in the borders of the Tang Empire?”</p><br/><p>It was then when an urgent military report arrived outside the tent.</p><br/><p>The army of the Golden Palace had moved south!</p><br/><p>The West-Hill Divine Palace had announced to the world that they’d punish the Tang Empire!</p><br/><p>There was a dead silence in the tent. Wang Jinglue was very pale and Xu Shi had long lost his smile, returning to the composure and sternness that a Tang Empire military leaders should have.</p><br/><p>“You will return to the Southern Army immediately.”</p><br/><p>Xu Shi looked at the Xiao Mountain which was enshrouded in darkness and said, “If the new Emperor and Her Highness have not turned muddle-headed, the edict to move the Southern Army north should have arrived.”</p><br/><p>Wang Jinglue paused slightly and asked, “What about you?”</p><br/><p>Xu Shi answered, “Since they want to destroy the Tang Empire, I have to return to Chang’an to defend it. Do not worry, His Majesty will definitely send an edict for me to return north as soon as possible.”</p><br/><p>Wang Jinglue nodded, but felt that something was not right. He suddenly thought of something and said with furrowed brows, “Since the West-Hill Divine Palace has issued a rescript, then they definitely would try to harm you.”</p><br/><p>Xu Shi smiled and patted his shoulders, saying, “I have said earlier that we are within the borders of the Tang Empire. Who would dare to kill me, the Defender-general of the Empire?”</p><br/><p>Wang Jinglue said, “Is there anything the West-Hill Divine Palace dares not do?”</p><br/><p>“I have been in the army for decades, would I not know as much as you? We are under the Xiao Mountain right now. If someone wishes to harm me, they’d have to cross the mountains from Qinghe County to reach here. The people at Qinghe County are not blind.”</p><br/><p>Xu Shi smiled and said, “Furthermore, you have to be clear about this. Even though I am old, I’m not that easy to kill. There are few people in the world who are able to kill me.”</p><br/><p>Wang Jinglue thought that this was true and counted on his fingers. There really were not many who was a threat to the old man. While he was very old, he was still very powerful.</p><br/><p>The military matter was urgent. Wang Jinglue had to take General Xu Shi’s latest orders back with him and also coordinate with the Southern Army troops to organize their defence against the Golden Palace. As such, he left the Xiao Mountain in the middle of the night.</p><br/><p>Shortly after he left Xiao Mountain, Xu Shi put on his military boots, and carefully donned his armor. Then, he walked out of the tent and looked at the forests in the night, narrowing his eyes slowly.</p><br/><p>The guards in the camp heard the faint sounds of armor and the scabbard clanging. They came out of the tent alertly and stood beside the general, asking what had happened in a low voice.</p><br/><p>Xu Shi did not answer but only looked at the mountain silently.</p><br/><p>He wanted very much to make the guards go away just like he had with Wang Jinglue.</p><br/><p>But just like what he had told Wang Jinglue, these guards were a private army gifted to him by the late Emperor. They were loyal to him only and would never leave his side no matter what.</p><br/><p>“There are indeed few who are qualified to kill me.”</p><br/><p>Xu Shi looked at the quiet forest in the night and said slowly, “The Hierarch of the West-Hill Divine Palace, Twenty-Three-year Cicada Cultivation of the Devil’s Doctrine, Sword Sage Liu Bai and the few young World Wayfarers…I always thought that these people would not attempt to kill me at the risk of their precious lives, but I never expected that you would act.”</p><br/><p>A thunderously loud voice suddenly rang in the mountains.</p><br/><p>“After the deaths of the Headmaster and the Tang Emperor, general, you are the spiritual stronghold of the Tang Empire. If I did not act personally, wouldn’t that be too disrespectful to you?”</p><br/><p>With that, the Xiao Mountain shook and rocks fell from the top.</p><br/><p>A giant chariot arrived, crushing the forests and rocks.</p><br/><p>While the curtain on the chariot was heavy, the tall figure emanating light could be seen in the dark.</p><br/><p>It was the Hierarch Lord of the West-Hill Divine Palace.</p><br/><p>There were 64 divine guards beside the chariot.</p><br/><p>“The Hierarch Lord had not left the Peach Mountain for many years until the battle in the Wilderness started. You have taken great risk to enter the Tang borders just for me, an old man who is about to die. I am beside myself.”</p><br/><p>Xu Shi’s voice was as cold as steel and traveled through the dark forest word by word and exploding before the giant chariot. “But I would still like to know who would emerge alive from this tonight.”</p><br/><p>With that, he suddenly coughed twice.</p><br/><p>Wang Jinglue scurried through the forest in the night.</p><br/><p>He suddenly stopped and looked up.</p><br/><p>There were clouds tonight and the skies were entirely black.</p><br/><p>It suddenly began to rain, the raindrops landing on his face, with their pitter-patter.</p><br/><p>The rainwater entered his mouth. It was slightly salty and acrid.</p><br/><p>Wang Jinglue turned around suddenly and ran back to where he came from.</p><br/><p>When he rushed out of the forest and came to a cliff, he saw the mountain in the distance collapsing. Sand and stones flew everywhere, and not even the violent rain could hide the terrifying collision of Heaven and Earth’s Qi.</p><br/><p>Wang Jinglue could clearly sense General Xu Shi’s aura.</p><br/><p>He could sense the general’s aura growing fainter.</p><br/><p>He knelt in the rain and screamed hysterically, “No!”</p><br/><p>He only realized then that the general had already sensed his own fate. That was why he had made him return to the Southern Army. It was so that he could avoid the shocking battle.</p><br/><p>After the rainy night at the Spring Breeze Pavilion, Wang Jinglue joined the army and had always been under the command of General Xu Shi. Over the years, he served the general like his son or nephew. He had been used to being alone since he was a child, but he grew to like the bustle in the military camp and even felt that General Xu Shi was like his own father.</p><br/><p>His slightly chubby face had gradually thinned and his heart that had longed to travel gradually calmed. He gradually grew to understand that there were many other beautiful things to be cherished besides freedom.</p><br/><p>However, in the rain tonight.</p><br/><p>All those beautiful things were shattered.</p><br/><p>Wang Jinglue knelt in the storm and cried silently.</p><br/><p>It was unknown how much time had passed. He stood up once more, wiped the rain and tears off his face and his expression grew increasingly determined. He turned and ran to the north.</p><br/><p>He was not returning to the Southern Army.</p><br/><p>He was going to return to Chang’an as quickly as he could.</p><br/><p>He was going to tell the people in Chang’an.</p><br/><p>He was going to tell them that General Xu Shi had died.</p><br/><p>The terrifying powerhouse who had killed the general was heading to Chang’an.</p><br/><p>Qinghe County had betrayed them…</p><br/><p>The scenery of Qinghe county was elegant. The houses, tall or low, had white walls and black eaves. The clear streams and stone bridges were very different from the magnificent sceneries in other parts of the Tang Empire.</p><br/><p>However, the best scenery was at Fuchun River.</p><br/><p>The manors of the Qinghe County warlords were all located on the banks of Fuchun River. The Cui Family manor was, of course, located on the most beautiful winding section of the stone bank and by the best looking part of the forest.</p><br/><p>However, it was located in the wilderness in the south. So while the forests were beautiful, they were far from steep.</p><br/><p>It was still as dark as before in a small building deep inside the Cuiyuan Garden.</p><br/><p>Old master Cui handed the hot towel to his son behind him and looked at the six silver-haired old men sitting in chairs. He sighed and said, “Haotian is merciful. There is finally an unprecedented change in the situation that we can witness before our deaths.”</p><br/><p>One of the old men said calmly, “Intentions have been set since years ago. The ancestral teachings of all clans have never forgotten how our country was defeated. We just have to carefully consider the details.”</p><br/><p>Old master Cui said calmly, “As for the specifics, the descendants of the clan can carry them out. The families of Qinghe have existed for many years, there will not be any problems.”</p><br/><p>“Senior Brother is right. However, there are various descendants of our clans in Chang’an working as officials or studying. The Li family would not allow us the opportunity to extradite them out of the city. What are we to do?”</p><br/><p>“Other than thinking that we cannot bear the sudden change in situation, Princess Li Yu trusts us old men because she believes that we will not harm those of our flesh and blood.”</p><br/><p>Old master Cui said dryly, “However, what she doesn’t know is that the families of Qinghe have planned to restore our nation since hundreds of years ago. This is not a sudden change to us. She has also never imagined that we would be willing to sacrifice even more people, much less a few hundred noble descendants for this cause.”</p><br/><p>Looking at the myriad of expressions on the faces of the old men, old master Cui smiled and said, “You do not have to feel sad right now. As long as the war progresses smoothly and the Li family plans for the future, they might not even dare to kill our descendants. They might even provide for them.”</p><br/><p>“However, can the war really progress smoothly?”</p><br/><p>“Haotian Taoism had planned this for many years. The Tangs have lived in luxury and extravagance. Now that the Northeast Border Military has been felled, the Golden Palace is moving southwards. The Hierarch Lord has personally come out, so Xu Shi would definitely die. As long as Qinghe County opens a convenient door, the West-Hill Divine Palace army and the Jin army will march north. It would be unsure whether the Tang Empire will fall, but it can be sure that Chang’an would never be able to lord over us ever again.”</p><br/><p>“Speaking of which, I would also like to thank that Mr. Thirteen of the Academy. If it weren’t for his protecting the Daughter of Yama, the Headmaster wouldn’t have been punished to death by Heaven. If he hadn’t killed the Yan Crown Prince with an arrow on the Wilderness, the Yan Emperor wouldn’t be be so mad to activate the entire nation.”</p><br/><p>Old master Cui said with a smile, “Qinghe County will succeed in its nation restoration. When we build a stele beside Fuchun river to record this great event, you must not forget to add the name of Ning Que on it.”</p><br/><p>The sound of old men chortling rang in the small building.</p><br/><p>The history of Qinghe county’s families was longer than that of most countries. A thousand years ago, this was originally a relaxed country where warlords took turns to rule.</p><br/><p>According to clan etiquette, The Cui and Song warlords maintained a strong cohesive force while Qinghe County was like an iron plate operated by them. No matter how Chang’an tried to split them up or to alienate them, they could only touch the outermost layer but were unable to reach into the core of Qinghe county.</p><br/><p>Now in Qinghe County and Yangguan City, the city guards, the state army generals, and even the over 1,000 middle-and low-ranking officials, they were either the descendants of the warlords, or people who shared vital interests with he warlords.</p><br/><p>Even the Tang navy, which was heavily guarded by the imperial court had also been infiltrated by the families of Qinghe County. It was not that Chang’an was not vigilant enough. When the navy recruited, there were many from Qinghe County who had applied. But the citizens of Qinghe County were not really Tang citizens, but were more under the control of the warlords.</p><br/><p>As time passed, the previously unassuming officers and soldiers of the navy, toiled and accumulated meritorious military service, eventually gaining relatively important positions. Although the senior generals of the navy were appointed by Chang’an city and transferred from other places, the middle and lower levels of the navy were firmly under the control of Qinghe County.</p><br/><p>One day in the autumn of Tianqi’s 18th year.</p><br/><p>There was a storm at the western foot of Xiao Mountain. However, it was sunny in Qinghe County, which was on the eastern side, and the autumn wind brought cold relief.</p><br/><p>Yangguan City’s government gathered officials to discuss the important matter of gathering troops to cooperate with the navy to resist the enemy invading from the south.</p><br/><p>All the officials arrived as they were ordered.</p><br/><p>After a few cups of tea, Yangguan City government department chief Zhong Da Jun entered with a smile.</p><br/><p>The doors to the government building closed slowly.</p><br/><p>The officials looked at each other and wondered what was happening.</p><br/><p>Zhong Da Jun waved his hand.</p><br/><p>Furious rebukes and painful cries rang in the building.</p><br/><p>Fresh blood stained the green-tiled floors.</p><br/><p>Almost at the same time.</p><br/><p>The families of Qinghe County invited the generals of the Tang navy to an area on the bank of Fuchun river to discuss the war.</p><br/><p>Fresh blood stained the Fuchun River red.</p><br/><p>No matter how powerful the warlords of Qinghe County were, they would not be able to completely defeat officials and generals loyal to the imperial court. Therefore, in the sunny autumn day, several battles broke out in Qinghe County and Yangguan City.</p><br/><p>According to the statistics afterward, more than 300 Tang Empire officials were beheaded, more than 1,000 Tang navy officers ranging from their commanding general to auxiliary soldiers died and more than 1,000 people were transported to the mountains downstream from Fuchun River to do forced labor.</p><br/><p>If one party had planned for a rebellion for millennia while the other party was not aware of it, then the outcome of the rebellion had already been decided. The only thing that could affect the outcome of this was the feelings of the people.</p><br/><p>The feelings of the people in Qinghe County were complex.</p><br/><p>They were accustomed to the fact that the warlords ruled them and they have made no secret regarding their superiority and contempt for the Tangs from other counties. They did not have any affection for Chang’an.</p><br/><p>However, they had lived under the rule of the Tang Empire for so many years after all and had lived as Tangs for many years. They had felt the glory of the Tang Empire countless times and were proud of it.</p><br/><p>But… they were going to betray the Tang Empire now?</p><br/><p>The young people of Qinghe county especially, including warlords’ descendants, were completely unable to accept this matter and could not believe what was happening at the moment.</p><br/><p>However, just as they were preparing to voice their opinions, their elderly grandfathers and stern fathers showed up and dragged them back to their clan temples. They were ordered to kneel before their ancestors’ memorial tablets as they listened to their grandfathers and fathers recounting the sad history of Qinghe county’s defeat, and watched as they reminisced the glory of the old days with tearfull eyes.</p><br/><p>The young people of Qinghe County had not forgotten that period in history, but they loved the Tang Empire more and they loved being proud citizens of the Empire. That was why the words of their forefathers carried little weight on them.</p><br/><p>However… could they raise their swords and slaughter their families?</p><br/><p>In the autumn of Tianqi’s 18th year.</p><br/><p>The Headmaster ascended to Heaven.</p><br/><p>The Emperor passed away.</p><br/><p>The Academy closed its doors.</p><br/><p>The Northeast Border Military was wiped out in Capital Cheng.</p><br/><p>The army of the Golden Palace moved south.</p><br/><p>Qinghe County betrayed the Tang Empire.</p><br/><p>The West-Hill Divine Palace and tens of thousands of troops from the South Jin Kingdom stormed the empire.</p><br/><p>Defender-general of the State Xu Shi died in battle.</p><br/><p>Following that, the Yuelun Kingdom military marched into the Pamir Mountains.</p><br/><p>To vanquish the Tang Empire.</p><br/><p>It seemed inevitable that the Tang Empire would fall.</p><br/><p>Right at this moment.</p><br/><p>A young man in black was traveling through the depths of the Wilderness.</p><br/><p>He had awoken not long ago.</p><br/><p>He talked to the moon every night since his awakening.</p><br/><p>He missed his teacher and wife.</p><br/><p>He did not know what had happened in the human realm.</p><br/><p>But could he change anything if he knew about it?</p>\n</div>"}