{"title": "Chapter 716 - I Have Been to the City of Wei", "id": 716, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-716-i-have-been-to-the-city-of-wei", "volume_title": "Volume 8", "body": "<h1>Chapter 716 - I Have Been to the City of Wei</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The goal was not the only similarity between them. They also cultivated the same Taoism.</p><br/><p>The Queen had read many files on Ning Que multiple times in order to find his weakness because he killed her only elder brother, Xia Hou. The relationship between them was very complicated and subtle.</p><br/><p>Returning to Helan City, they were still stuck in this state of mind until he entered the quiet room of the attic and saw the gray coffin.</p><br/><p>The coffin was very large and was made of dozens of pine trees from the Tianqi Mountain cliff.</p><br/><p>Compared with the high status of the person lying in the coffin, it looked primitive and crude, as the bark of the pine trees had not been peeled off.</p><br/><p>After a long silence, Ning Que walked over to the pine coffin, knelt down, and kowtowed.</p><br/><p>The Queen calmly said, “Ever since you first met each other, you never got used to kowtowing to him. Now he is dead and will never see it.”</p><br/><p>Ning Que stood up, gently stroking the rough bark of the pine trees in silence.</p><br/><p>The Queen thought he would smile and give her a speech about the dead coming first. If he did, she would bring up her brother’s death and discuss more serious topics with him.</p><br/><p>Standing by the pine coffin for a moment, Ning Que turned to Master Huang Yang and the generals and said, “What happened? Why are you staying in Helan City?”</p><br/><p>Master Huang Yang slowly said, “After the Headmaster and His Majesty died, it rained heavily. The Northern Army was stalled in Helan City and lost their connections to the south. We didn’t know what was happening, but we guess…”</p><br/><p>Then he told Ning Que what had happened in recent days.</p><br/><p>“Since the Golden Palace dared to besiege Helan City, Chanyu must have gone south.”</p><br/><p>Ning Que squat to the ground, drawing a very simple map with a branch taken from the pine coffin. He drew a horizontal line at the lower part of the map and said, “The Seven Stockaded Villages…”</p><br/><p>Suddenly, he fell silent and stopped moving his fingers.</p><br/><p>Everyone in this room knew that Ning Que was from the City of Wei, a frontier fortress of the Seven Stockaded Villages.</p><br/><p>Ning Que’s expression remained unchanged as he calmly continued, “The Seven Stockaded Villages must have been occupied and the cavalry of the Golden Palace might have passed through the Pingling Pass in Hebei County.”</p><br/><p>Dropping the branch, he looked up at the crowd and said, “One-third of the Northern Army Cavalry is stationed in Helan City. Is the Northern Military Camp strong enough to stop them? If the court deploys troops from Gushan Commandery or Tuyang City, what will happen in the east? Long Qing will definitely not miss this opportunity.”</p><br/><p>His speculation was basically consistent with the reality, there was no essential difference, and it was completely in line with the view of the Queen.</p><br/><p>“We must leave immediately.”</p><br/><p>The Queen said, “Withdraw southward as soon as possible.”</p><br/><p>Han Qing said, “It’s a long journey. What about the army provisions?”</p><br/><p>“We can grab the Golden tribes,” a Northern Army general said.</p><br/><p>Ning Que shook his head and said, “The Golden Palace definitely already made plans: their elite went south, leaving the empty interior behind. They won’t give us a chance to take advantage, so those tribes must have withdrawn to the north once the rain stopped. If we pursue them, we’ll have to go into the depths of the wilderness without any supplies. It is too risky.”</p><br/><p>The Queen asked, “So what’s your plan?”</p><br/><p>“There isn’t a good plan.”</p><br/><p>Ning Que stood up and continued, “First of all, we must take away all the food in Helan City and make calculations. People will not die if they are starving for a few days, but horses will. Moreover, we can ride horses to move around even if we are exhausted and we can even kill the horses if in the worst situation.”</p><br/><p>The generals all remained silent and then nodded in agreement.</p><br/><p>Han Qing frowned and said, “If we take away all the food in the city, what will the garrison in the city do?”</p><br/><p>Ning Que answered, “They will come with us.”</p><br/><p>Han Qing surprisedly said, “Are you abandoning Helan City?”</p><br/><p>The Queen answered for Ning Que, “As long as the Tang Empire hasn’t been subjugated, we will take it back.”</p><br/><p>The situation was urgent. After the discussion, the generals hurried away to prepare. Master Huang Yang went to get treatment while the Queen went to see the Sixth Prince, who was frightened.</p><br/><p>At that moment, aside from the gray pine coffin in the quiet room, only Ning Que and Han Qing remained.</p><br/><p>“I saw you and the Daughter of Yama crossing the border in a black horse carriage.”</p><br/><p>Han Qing looked at him and said.</p><br/><p>Ning Que said, “There is no time to be sentimental. Just tell me what you want to say directly.”</p><br/><p>Looking at the gray pine coffin, Han Qing said, “His Majesty liked you so much when he was alive, and now you already know about his will. So, what do you think?”</p><br/><p>Ning Que said, “Continue.”</p><br/><p>Han Qing said, “Everyone knows that you are close to the Princess and hold a grudge against the Queen, but His Majesty has passed his throne on to the Sixth Prince… I don’t really care who you support, but I hope you can make your attitude known at this time. The journey to the south is difficult, and if something happens…”</p><br/><p>He paused when he heard some footsteps.</p><br/><p>Han Qing remained silence.</p><br/><p>The Queen walked in, followed by a young man.</p><br/><p>The young man in the bright yellow clothes of the Prince curiously looked at Ning Que. He seemed a little shy as if he was not used to meeting strangers.</p><br/><p>Ning Que kept silent for a long time by the pine coffin.</p><br/><p>Then he looked at the Prince and asked, “Do you want to be the emperor of the Tang Empire?”</p><br/><p>The Prince turned to his mother in confusion.</p><br/><p>The Queen gently touched his head, looking like she loved to spoil him.</p><br/><p>Looking at Ning Que, the Prince thought carefully for a long time, then said, “If my father asked me to be the emperor, then I will be.”</p><br/><p>Ning Que said, “Very good, then it’s yours, and nobody can take it away from you.”</p><br/><p>The Queen looked at him quietly, then asked, “Is that the promise of the Academy?”</p><br/><p>Ning Que replied, “It’s my promise, but it is equally as effective.”</p><br/><p>The Queen said, “I have no doubt about that.”</p><br/><p>Ning Que asked, “Why?”</p><br/><p>The Queen replied, “Because you finally married Sangsang.”</p><br/><p>Looking at her gentle and beautiful face, Ning Que remembered when she had turned to look at him on the grassland and her black hair was brushing against her face. It was so beautiful.</p><br/><p>He realized that the Queen knew him very well.</p><br/><p>Therefore, he suddenly understood why His Majesty had insisted on marrying her.</p><br/><p>All the food that had been stored in Helan City for many years was transported out. The horses that were killed on the battlefield in front of the city were cut into parts and piled in the trailers as food.</p><br/><p>It did not take long before tens of thousands of the Tang Army withdrew out of Helan City. A general asked whether to burn down the defensive crossbows and buildings in the city so they would not fall into the hands of the barbarians, but both the Queen and Ning Que rejected it. They believed that the Tang Empire would return one day, and these Tang treasures should be preserved.</p><br/><p>The Tang Army, who had been besieged by torrential rain and the enemies in the depths of the wilderness, finally began to go back to the south. When they had arrived here, their country was the most powerful one in the world, while by the time of their departure, it had fallen into a precarious state, which was like a broken boat in a vast ocean that was going to be destroyed at any moment.</p><br/><p>Therefore, the return journey was silent, depressing, and tense.</p><br/><p>Ning Que’s face was indifferent but his hands holding the horse’s reins trembled and his knuckles turned white, all of which indicated that he was more nervous and depressed than anyone else.</p><br/><p>The Tang Army finally arrived at the middle foothill of Min Mountain after a difficult journey. They were able to see that the mountain was getting more and more green while the autumn trees on the mountain were more and more red.</p><br/><p>There was still a long way to go to get to the Northern Military Camp. They were already very hungry and tired with little food left. However, as long as they did not encounter a big problem, they would be able to return to the south smoothly.</p><br/><p>Ning Que finally could take a rest. The fear and tension inside his heart suddenly erupted all at once. He could no longer control his emotions and he had to see the City of Wei for once by himself.</p><br/><p>Several generals of the Tang Army expressed their strong opposition. Under the background of the Golden Palace’s invasion, no matter how powerful he was, once he was surrounded alone, he could do nothing but die.</p><br/><p>Everyone knew why Ning Que wanted to go there, but it had been a long time. What could be changed even if he did go there?</p><br/><p>Eventually, the Queen agreed to let him go and left a group of cavalry to escort him.</p><br/><p>“Seven City Fortress could not have held out.”</p><br/><p>Seeing the dozens of riders rushing toward the western wilderness, Han Qing frowned and said, “It’s pointless. Why does he insist on seeing what has happened?”</p><br/><p>The Queen said, “There are many things that people won’t give up unless they see it with their own eyes. Although Ning Que isn’t an ordinary person, there is no difference between him and ordinary people in this regard.”</p><br/><p>The City of Wei was just around the corner.</p><br/><p>The quiet city was located in the deserted wilderness. When the wind blew, the ashes on the wall would fall down onto the chopping boards of meat stalls and into the wine urns that had been left uncovered.</p><br/><p>The City of Wei was still primitive and crude. The gate was broken, as usual, which when locked from the inside, would be very difficult to break through even with siege vehicles.</p><br/><p>The City of Wei was extraordinarily quiet on this day. Black traces could be faintly seen inside of the old ash that had accumulated under the wall. They did not know whether it was from blood coagulation or something else.</p><br/><p>Ning Que waved to the cavalry to stop.</p><br/><p>He jumped off his horse, walked over to the gate, and pushed it open. The slanted gate fell down, raising clouds of dust. He stood at the gate in silence for a long time and then walked inside.</p><br/><p>The cavalrymen on horses watched him enter the City of Wei with complicated emotions.</p><br/><p>Ning Que walked out of the City of Wei after a long time.</p><br/><p>The expression on his face was still calm, his back was still straight, and his right hand resting on the hilt was still stable. No change could be seen, as if he had seen nothing in the City of Wei.</p><br/><p>“How is the situation inside?” asked a cavalry officer.</p><br/><p>Ning Que shook his head and said, “Nothing’s left.”</p><br/><p>The officer frowned slightly and asked several cavalrymen to go inside.</p><br/><p>Ning Que said in a low voice, “Don’t go in.”</p><br/><p>The cavalrymen turned to the officer and received no more orders. They lifted the reins, heading into the City of Wei.</p><br/><p>Ning Que did not turn around as he shouted, “Don’t!”</p><br/><p>His voice was very loud and violent, like thunder, exploding in the wilderness outside the City of Wei. The horses under the cavalrymen were frightened by the sound and everyone stood up.</p><br/><p>A broken wine banner swayed gently in the City of Wei.</p><br/><p>Hearing Ning Que’s angry roar, they finally understood what had happened in the City of Wei.</p><br/><p>Nobody insisted on going to see.</p><br/><p>Ning Que walked toward his horse.</p><br/><p>With each step, his head lowered and his body became heavier.</p><br/><p>“When I left, I told you… don’t get old, don’t die, wait for my filial obedience… What about now? You, old fox, always lied to me,” Ning Que muttered to himself.</p><br/><p>Then he laughed sadly.</p><br/><p>Although the army did not pass through the City of Wei, they finally entered the war zone. Appearing in front of everyone, the horrific destruction caused by the Golden Palace cavalry at the frontier fortress and the towns which the Tang lived in had become ruins.</p><br/><p>This was a tired army, but the blood, fire, ruins, broken walls, and dead people seen along the way stirred up their crazy fighting spirit. Only after a period of time of recuperation and replenishment would it become a formidable military force. Even at this moment, many soldiers were eager to fight with the Golden Cavalry.</p><br/><p>Fortunately, or perhaps unfortunately, the Tang Army that returned to the south along Min Mountain never met the main forces of the Golden Palace. After wiping out dozens of prairie riders along the way, they approached the Northern Military Camp.</p><br/><p>The Tang Army regained contact with the General’s Mansion. Due to their large number of troops, it was not convenient to enter the General’s Mansion at the same time. The General’s Mansion sent out an elite cavalry to give them supplies and receive the Queen, the Prince, and the most important coffin of His Majesty to the Northern Military Camp first.</p><br/><p>After some hasty discussions, the Tang Army did not raise any doubts about the order of the General’s Mansion. They stood by outside the city as the Queen and the Sixth Prince, as well as the coffin, entered the mansion.</p><br/><p>His Majesty’s coffin was simple but very heavy. The weight of dozens of whole pine trees required several horses to pull it. This was the biggest difficulty encountered by the Tang Army during their return to the south.</p><br/><p>Today, the Northern Military Camp, who was defending the Golden Palace, was in chaos. Even though they were anxious, when they saw the pine coffin entering the city, everyone felt sad and knelt down.</p><br/><p>Few people noticed that Ning Que was sitting in the carriage next to the coffin.</p><br/><p>Several horses pulled the heavy coffin, slowly moving along the street. The wheels crushed the hard stone ground, creating monotonous and horrible sounds.</p><br/><p>Suddenly, several cries resounded from the side of the street.</p><br/><p>“Kill the evil Queen!”</p><br/><p>“Wash away shame for His Majesty!”</p><br/><p>Hearing those shouts, a general rushed forward followed by hundreds of cavalrymen from the end of the street, lifting up their podaos.</p><br/><p>The Queen calmly held the Sixth Prince in her arms. Ning Que sat next to the pine coffin with his head lowered peacefully, as if he had heard nothing.</p>\n</div>"}