{"title": "Chapter 726 - Cruelty Starts from Today", "id": 726, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-726-cruelty-starts-from-today", "volume_title": "Volume 8", "body": "<h1>Chapter 726 - Cruelty Starts from Today</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Everyone was silent in the hall and nobody answered Ning Que.</p><br/><p>This does not mean that his words had no power. In fact, his words were like thunder exploding in the minds of the ministers, leaving everyone in a disconsolate state.</p><br/><p>A minister stepped out and pointed his trembling finger at him, wanting to denounce his cold-blooded and shameless behavior.</p><br/><p>Ning Que looked at the man quietly without a trace of emotion on his face. The minister’s fingers dropped down weakly. His lips trembled with anger, but he still did not say a word.</p><br/><p>Since the tampering of the edict came to light, the Tang Empire’s court was divided into two factions. The Empire was about to collapse, so the separation and hostility were then forcibly suppressed.</p><br/><p>Many ministers convinced themselves to ignore the edict for the time being, using the excuse that they should look at the big picture and prevent the Tang Empire from officially entering internal strife. However, who would have thought that Ning Que would…kill the Emperor after talking to him! Everyone thought that the situation was under control.</p><br/><p>They were extremely frightened and angry. Then, these experienced ministers calmed down with unimaginable speed. They were shocked to find that what Ning Que had said would bring the best possible outcome.</p><br/><p>After His Majesty was killed, the only bloodline left of the deceased Emperor was the Six Prince. What other options did the officials have besides helping him reign? These officials, soldiers and people who fought hard at the front line will eventually find out about the edict being tampered. They will no longer have to choose a faction, and the Tang Empire would not be split up.</p><br/><p>Not having any choice was the best choice. In fact, everyone knew that, but not everyone can make this decision for the Tang Empire. Only Ning Que could do it because only he dared to do so.</p><br/><p>Tampering with the edict of the deceased emperor was considered treason and everyone, even the new Emperor and Her Highness, cannot escape the judgment of the Tang laws. However, now that this had happened in reality, who would really dare to carry out the punishment?</p><br/><p>Only Ning Que did not give Li Huiyuan any chance to plead for his life, nor did he give anyone time to think. He had cut off the head with his knife to punish the man.</p><br/><p>This simple gesture of wielding his sword shows his extremely calm and even cold rational thinking. It represented the Academy’s extreme disregard for the Tang’s imperial power and it made people shudder.</p><br/><p>What else could the ministers and generals do now? Ning Que’s behavior might seem immoral, but it was written in the laws of the Tang Empire. Would anyone dare to say that he had assassinated the Emperor? The crux of the matter was that even if anyone thought so, who would dare to annoy the Academy, the back bone of the Tang Empire, in the current situation?</p><br/><p>The officials looked at Ning Que, who stood beside the royal throne, and at the body of His Majesty in the pool of blood. The expressions on their faces were extremely complicated. There were anger, sadness, wariness and fear.</p><br/><p>Still, no one replied to Ning Que and the silence continued. This was due to the wide swing in emotions and also because they found it very difficult to accept that the Tang Empire was suppressed by a cold-blooded bully like this.</p><br/><p>The Academy was not allowed to interfere in the matters of the court. This was an iron-clad rule left by the Headmaster. So what is this now?</p><br/><p>At this moment, the Empress led the Sixth Prince into the hall.</p><br/><p>The officials in the hall were shocked once more. They all knew that the Empress and the Six Prince were stopped outside Chang’ an by the Princess. When did she enter the city and the palace? Why were they not alerted to it?</p><br/><p>The Empress was not dressed up and was still in plain clothes. She looked calm – She was the queen of this palace for almost 20 years, how could the city stop her? Why could she not enter the palace?</p><br/><p>The Sixth Prince was also dressed in plain clothes, but he wore a bright yellow belt around his waist. He followed behind his mother. When he saw the gory image in the hall, his face grew extremely pale.</p><br/><p>His legs grew weak and his hands began to tremble. However, his hand was held tightly in the queen’s, and he didn’t dare to slow his pace or show his intentions of retreating.</p><br/><p>The queen brought the Sixth Prince into the hall toward the throne.</p><br/><p>The officials in the hall only reacted then. Those loyal to the queen quickly knelt, their faces red with agitation.</p><br/><p>Li Yu’s faction gradually knelt with traces of anger on their faces.</p><br/><p>The queen brought the Sixth Prince around the puddle of blood and the corpse in front of the throne.</p><br/><p>Ning Que bowed slightly and moved to the side.</p><br/><p>The queen glanced at Li Yu.</p><br/><p>Li Yu was distracted by extreme grief and anger so she did not respond at all.</p><br/><p>The queen then lifted the Sixth Prince onto the throne where he sat down.</p><br/><p>Then, she looked to the ministers in the hall and said calmly, “What are you waiting for? Or is the Tang Empire now the scene of a drama? Military Ministry, come up here and report the newest information on the war.”</p><br/><p>Dozens of guards looked warily at the movements around them.</p><br/><p>The mansion behind them was quiet and nothing could be heard. It was completely different from the liveliness when Princess Li Yu hosted dignitaries in it in the past years.</p><br/><p>The most loyal grassland bodyguard around Li Yu had joined the Yulin Royal Guards for many years. When they heard of the changes in the palace, they tried to attack but were suppressed by the Yulin Royal Guards. Many people died and Peng Yutao, Deputy Commander of the guards who did not leave Chang’an with the Valiant Cavalry Battalion, did not have time to react before he was subdued and sent into the Military Ministry prison.</p><br/><p>Ning Que knew all these people. Many years ago, on his journey from the City of Wei to Chang’an, he and those grassland warriors and Peng Yutao had fought hand in hand. However, many years have passed, and upon hearing the news, he only fell silent for a moment before discarding the thought.</p><br/><p>All metallic and sharp objects in the bedroom, even the bronze mirror, were moved out. Soft bedding was laid out everywhere. It was difficult even if they wanted to smash their heads against the wall to commit suicide.</p><br/><p>However, less than half a day later, Li Yu’s face was emaciated and extremely pale. She looked very weak and seemed likely to fall over any time.</p><br/><p>Her usual bright eyes seemed to be covered with frost. They were very dull and piercingly cold. She looked at Ning Que and said, “I didn’t expect that you would lie to me.”</p><br/><p>“If you are referring to our last conversation in the imperial study… I didn’t lie to you. I only remained silent then. You said that no matter what kind of mistake Sangsang committed, I wouldn’t have the heart to hurt her. This statement is right. I can understand that you cannot bear to hurt Li Huiyuan, but understanding and agreement are two different concepts.”</p><br/><p>Ning Que looked at her and said, “Your love and grief for him has nothing to do with me. Just like how my love for Sangsang will never be acknowledged and agreed with by the world. What’s more, I don’t like your brother.”</p><br/><p>Li Yu stared at him and said with hatred, “But have you ever thought that you killed my father’s son? Would my father really agree with you?”</p><br/><p>“Then, have you ever wondered why no one has ever been able to kill the royal family members of Li in the imperial palace for thousands of years? Yes, it is because of the God-stunning Array that has been protecting the imperial palace.”</p><br/><p>“Earlier in the hall, when I cut off his head with a stroke, several eaves beasts on the eaves of the hall in the palace responded, but their aura was forced back after recognizing me.”</p><br/><p>Ning Que looked at her and said calmly, “Why? Because His Majesty gave me Chang’ an city, the God-stunning Array. That means that he gave me the lives of the Li’s for me to deal with.”</p><br/><p>Li Yu trembled all over, and her face grew paler.</p><br/><p>“So, my father would rather believe in the Academy than his own children. To him, the Academy is the real protector of the Tang Empire…”</p><br/><p>She looked at Ning Que and said sarcastically, ” The Tang Empire is about to fall, but the Academy remained unmoved, hiding in the mountains like frightened mice. I wonder if my father would regret his choice.”</p><br/><p>Ning Que’s expression did not change at all. He said, “This is why you are not as good as the queen. She will never doubt His Majesty’s decision. Moreover, she had personally gotten to know the Headmaster and the Academy back then. That is why even if my hatred with her is extremely deep, I did not hesitate or hold any reservations when she chose to trust me.”</p><br/><p>“Only those whose eyes are covered by leaves will not be able to see the back of the mountain of the Academy. They will think that the Academy had chosen to avoid the war because we are afraid. Even though I do not know exactly what happened, but I can let you know that my Senior Brothers and Sisters are definitely preparing for war right now. They will fight for the Tang Empire and the Academy.”</p><br/><p>Li Yu bowed her head and remained silent. It was unknown whether she would believe what Ning Que had said.</p><br/><p>Ning Que did not care. He looked at her and continued, “The purpose of my return to Chang’ an is to fight. I want to quell the chaos in Chang’ an as soon as possible and to ensure that there is no problem with the God-stunning Array. Only then can I retrieve the array eye pestle. A long as I can do this, then no matter how powerful the West-Hill Divine Palace is, they will not be able to make their way in.”</p><br/><p>He talked about his plan seriously, as if he were explaining it. However, there was no need to explain to Li Yu, so it seemed rather strange.</p><br/><p>“I am saying all this because I want to tell you that the Tang Empire will not fall.”</p><br/><p>Ning Que looked into her eyes. Looking at the grey frost in her eyes, he continued his attempt at trying to dispel her intent to die. He said coldly,” If you wish to seek revenge against me or the Academy, then you first have to live.”</p><br/><p>Li Yu’s eyes finally gained some luster.</p><br/><p>She had already guessed his intentions, and she asked, “Why do you want me to live?”</p><br/><p>“If you are alive, ministers and armies loyal to you and Li Huiyuan will feel more stable. The military orders and political affairs of the imperial court will also be carried out more efficiently. At this critical juncture, I will not let go of any favorable factors, so I need you to live and continue to contribute your strength to the Tang Empire.”</p><br/><p>Ning Que said.</p><br/><p>Li Yu stared into his eyes and said coldly, “You can also speak about it in an entirely different way.”</p><br/><p>Ning Que said, “The Tang Empire needs you alive now? I don’t think this kind of verbal modification would mean anything at the present. Your Highness is intelligent. I’m sure you understand what I mean.”</p><br/><p>Li Yu trembled slightly and looked at Ning Que as if she was looking at a stranger. She said, “You’re too cold.”</p><br/><p>Ning Que said, “I said it before, to those old men you sent outside of Chang’ an, that you do not know what it would be like if I were truly cold. But as long as you live on, you’ll have a chance to see it.”</p>\n</div>"}