{"title": "Chapter 723 - Education in the Academy", "id": 723, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-723-education-in-the-academy", "volume_title": "Volume 8", "body": "<h1>Chapter 723 - Education in the Academy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The high plains west of the Tang Empire faced the towering green ridge.</p><br/><p>Defender General of the West, Shu Cheng, directed the western army in several battles against the Yuelun Kingdom.</p><br/><p>Even though the western army was the least valued and weakest in the Tang Empire Army, it still seemed powerful against the cavalry from the Yuelun Kingdom. It defeated its enemies successfully over the days.</p><br/><p>Until a group of ascetic monks came down the green ridge.</p><br/><p>The western army of the Tang Empire had surrounded the Chaoyang cavalry brigade of the Yuelun Kingdom, and it seemed as if they were about to wipe out their enemy. However, the group of ascetic monks seemed not to have seen the intense battle as they walked through the battlefield silently.</p><br/><p>They were ascetic monks from the Xuankong Temple.</p><br/><p>The leading ascetic monk only had seven fingers. He was Master Qi Mei, the chief monk of the Xuankong Temple’s Hall of Respect.</p><br/><p>Master Qi Mei walked toward the marshal camp of the Tang Army. His pace was comfortable and stable.</p><br/><p>Countless arrows landed on his body. However, they did not pierce his skin but broke and fell to the ground instead.</p><br/><p>Several podaos landed on his body but they did not manage to make him tremble at all.</p><br/><p>Master Qi Mei did not react but continued walking silently toward the Tang Army’s marshal camp.</p><br/><p>He walked toward the Defender General of the West, Shu Cheng.</p><br/><p>Shu Cheng felt a bitter taste in his mouth and he smiled helplessly.</p><br/><p>As the main general, he knew he could not retreat.</p><br/><p>Then, he would die battling.</p><br/><p>The West-Hill Divine Palace army rode the battleships of the South Jin Kingdom navy and finally arrived at the shores of the Great Lake.</p><br/><p>The Tang navy’s warships were moored near the shore and did not move. Traces of fire could vaguely be seen on several ships. The largest ship had sunk to the bottom of the lake.</p><br/><p>The citizens of Qinghe County welcomed these invaders with varying expressions.</p><br/><p>In the words of the warlords, the West-Hill Divine Palace army was their the sacred liberator.</p><br/><p>The military discipline of the West-Hill Divine Palace was much better than how the citizens of Qinghe County had imagined. Even the South Jin Kingdom soldiers who had long-standing grudges with Qinghe County looked stern while walking on the streets.</p><br/><p>There were two divine chariots and several luxurious carriages behind the Divine Hall army.</p><br/><p>The Great Divine Priest of Revelation had come personally to the Cui garden on the banks of Fuchun River to meet with the head warlord of Qinghe County to give his best wishes.</p><br/><p>The Great Divine Priest of Judgment did not bother with things like this. She hoped to meet with the powerhouses from Tang.</p><br/><p>The luxurious horse carriages were silent.</p><br/><p>Even though nobody had seen it, everyone had already guessed that the most powerful man in the world, Sword Sage Liu Bai was in the horse carriage. Which other bigwig was sitting in the other horse carriage?</p><br/><p>The army of the West-Hill Divine Palace did not stay long at Qinghe County.</p><br/><p>The cavalry’s horses stepped on the quiet bluestone roads, crossing the exquisite stone bridge, and passed the houses with white walls and black roofs. They went toward the north and finally arrived at the famous Verdant Canyon.</p><br/><p>Countless powerhouses from all around the world went to the Tang Empire.</p><br/><p>The Tang Empire seemed like it would fall at any moment.</p><br/><p>Nothing seemed to be able to stop this from happening.</p><br/><p>Ning Que was accompanying the Empress and the Sixth Prince as they left the state of Wu toward Chang’an.</p><br/><p>He did not know of the dangerous situation in the south, but he could guess what the Tang Empire was facing. However, he did not have the ability to change anything before the surging tide.</p><br/><p>What he could do was to return to Chang’an as soon as possible.</p><br/><p>The Headmaster had built Chang’an City and set the God-stunning Array.</p><br/><p>Master Yan Se had passed the array eye pestle of the God-stunning Array to him.</p><br/><p>Since he had received the inheritance from the two masters, he had to guard it well. As long as he could return to Chang’an and retrieve the array eye pestle, he could at least ensure that Chang’an would not fall.</p><br/><p>The Queen and her entourage were stopped on a bridge near Liang Village, two hundred miles from Wu state after they had traveled for a day and a night. They were stopped by a group of Garrison Troops from Liang Mountain State led by a eunuch.</p><br/><p>Mo Han, the Grand Secretary of the Yinghua Hall was from the Liang Mountain State.</p><br/><p>The eunuch was called Chen Jinxian and was the chief eunuch of the judicial department and was ordered to work at Liang Mountain State before the war. Upon hearing the news of the Queen returning south, he led the Garrison Troops from Liang Mountain State to stop them, not having any time to ask for instructions from Chang’an.</p><br/><p>Eunuch Chen stood in the middle of the stone bridge, looked at the carriage, then bowed down and said proudly, “His Majesty has issued a decree. Chang’an is in danger. Please stop here, Your Majesty, and choose a place to seek shelter.”</p><br/><p>Ning Que, who was riding a horse, did not say anything.</p><br/><p>The voice of the Empress emerged from the horse carriage. She said calmly, “Eunuch Chen, where is the decree? Let me see it.”</p><br/><p>Eunuch Chen froze, and his voice hardened, “The decree was spoken.”</p><br/><p>“So it is.”</p><br/><p>Ning Que said, “What I mean is, that the pair of siblings inside the palace are not so dumb.”</p><br/><p>When he heard that, Eunuch Chen’s expression became thunderous and he bellowed, “How dare you! How dare you disrespect the Emperor and Governing Princess!”</p><br/><p>Then, he turned to look at the horse carriage and said coldly, “Does the Empress Dowager wish to go against the edict?”</p><br/><p>The Queen said, “I am still their mother in name. Isn’t this spoken edict too disrespectful? It goes against the laws of the Tang Empire as well, how can you ask me to follow the edict?”</p><br/><p>Eunuch Chen frowned slightly and said, “According to the laws of the Tang Empire, during wartime…”</p><br/><p>Without waiting for him to complete his sentence, Ning Que frowned and looked at the horse carriage. He said, “We have already wasted some time. I don’t wish to waste our time on this useless matter.”</p><br/><p>The Queen said softly, “We have to obey the laws of the Tang Empire.”</p><br/><p>Shaking his head, Ning Que said, “Your Majesty, you can obey them. I don’t have to.”</p><br/><p>The Queen asked, “Then, what do you plan to do?”</p><br/><p>Ning Que said, “If I kill the man who informs us of the edict, Your Majesty can naturally cross the bridge.”</p><br/><p>After a moment of silence, the Queen said, “That makes sense.”</p><br/><p>Eunuch Chen was enraged when he heard that. He took up his whip and slapped it down on the bridge heavily. He yelled, “Who are you?! How dare you insinuate that you are going to kill a messenger of the palace!”</p><br/><p>The eunuch had become famous in the palace for having skills with the whip. The deceased Emperor had taken a fancy to that and had given him the opportunity to climb the ladder. The sound of the eunuch’s whipping was crisp and clear.</p><br/><p>Ning Que glanced to the side.</p><br/><p>A northern army cavalry officer rode forward, reached out and slapped the eunuch forcefully on the face. The slap was unusually clear and loud, far exceeding the sound of the eunuch’s whip.</p><br/><p>Eunuch Chen was stunned.</p><br/><p>The cavalry commander took the whip from his hand and threw it into the river under the stone bridge. Then, he pulled out the knife in his scabbard and pointed it at the Garrison Troops that numbered in the hundreds opposite the stone bridge. He said with a deadpanned expression, “Charge.”</p><br/><p>The sound of hooves clopping burst out, and five hundred Tang riders rode through the smoke and dust toward the other end of the bridge.</p><br/><p>The Liang state garrison troops could not defend against the ferocious cavalry. There were startled shouts as flags fell and horses escaped. The troops were scattered in mere moments.</p><br/><p>The eunuch on the stone bridge was already covered in blood when he was trampled on by disorderly hooves. He had fallen unconscious and it was unknown whether he was dead or alive.</p><br/><p>Ning Que pulled on the reins lightly, and stopped by the carriage windows. He looked at the chaotic scene and said, “At the Academy, I read a couple of history books when I had spare time. I always found it interesting when I read that those Lords and Generals who were humiliated by eunuchs or officials just because of the Emperor’s edict and were cowed.”</p><br/><p>The Queen pulled the curtains back and said, “This is what the Headmaster cared most about. Without rule and order, the world would become a chaotic place, leading us to forever be in dark times where the strong will prey on the weak.”</p><br/><p>Ning Que said, “The first class I had in the Academy was etiquette. Professor Cao Zhifeng told us then, that the rules of the Academy were simple. Whoever was the strongest would have the final say. That, is etiquette.”</p>\n</div>"}