{"title": "Chapter 733 - The Academy Still Triumphed", "id": 733, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-733-the-academy-still-triumphed", "volume_title": "Volume 8", "body": "<h1>Chapter 733 - The Academy Still Triumphed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Staring at Yu Lian intently, the Hierarch said in a chilly voice, “You actually ordered your own Younger Brother and the beasts to start it first. Was this the manner the Headmaster taught you?”</p><br/><p>Yu Lian said with indifference, “Though you are inferior to me, It will take me a while to kill you. In order to kill you, I will do whatever needed.”</p><br/><p>The Hierarch was angry, but he smiled and said, “Your two Younger Brothers are nearly dead because you’ve done nothing but go after me. How sinister, ruthless and cold-blooded you are! If the Headmaster finds out what you’ve done, he will regret having recruiting you as his disciple.”</p><br/><p>Yu Lian said, “As a grandmaster of Enlightenment Doctrine, it is natural for me to be sinister and murderous. The Headmaster was willing to acknowledge me as his disciple, how could he have not known what kind of person I am?”</p><br/><p>The Hierarch screamed and shouted, “Let me clear you away today, you evil remnant of the Devil’s Doctrine!”</p><br/><p>Even though she was contending with a powerful master with supremely high status, Yu Lian looked quite peaceful. The peacefulness she held was an obvious humiliation to her opponent.</p><br/><p>“Xiong Chumo, since you were not able to contend with me several decades ago, there’s no way you will be able to defeat me now.”</p><br/><p>Looking at the Hierarch’s withered arms and the broken wrist, Yu Lian said with an apathetic expression, “As I’ve told you, if you poke your eyes out, I will allow you to leave the Academy.”</p><br/><p>The Hierarch Lord’s left hand had been hacked off by Great General Xu Shi at the foot hill of Xiao Mountain.</p><br/><p>From Xiao Mountain to the mountain behind the Academy, he had had two consecutive difficult fights. And now he was facing the unfathomable Twenty-Three-year Cicada Cultivator who had been cultivating under the guidance of the Headmaster for years…</p><br/><p>But he was still confident!</p><br/><p>With a sudden grave expression, the Hierarch exalted his right fist, lowered his waist and took a breath. He punched with one fist.</p><br/><p>He was short and thin. The fists he threw out were small and looked somewhat ridiculous.</p><br/><p>Yet these same fists had beaten Xu Shi to death and suppressed the West-Hill Divine Palace for years. Even though they looked ridiculous, they were not at all.</p><br/><p>The fist was fearsome enough.</p><br/><p>It was an innocuous fist that seemed to have converged all the Qi of Heaven and Earth in the mountain behind the Academy together. With pure white radiance spilling over the gaps between his fingers, the fist seemed to be holding a sun!</p><br/><p>Yu Lian suddenly lowered her head.</p><br/><p>The chirping of cicadas in the mountain behind the Academy grew louder and louder, filled with mournfulness.</p><br/><p>The two powerful masters, the most mysterious ones in the cultivation field had finally met.</p><br/><p>The fist had an aura of fury.</p><br/><p>It was as heavy as the mountain.</p><br/><p>Its power was as vast as the sea.</p><br/><p>The green slab stones along the mountain path were pulled up like pieces of paper. They had flown far away. The trees fell on their backs one after another. The ancient trees of strong tenacity had twisted trunks, while most of the large trees had their branches broken off. Sounds of cracking and bursting rang out.</p><br/><p>Instead of being struck down, Yu Lian wandered around the forest with the wind and drifted in the air, looking like the wings of cicadas. It seemed that she truly blended into a whole with the aura of heaven and earth. There was no way to find her.</p><br/><p>The chirping of autumn cicadas rang on continuously. Thousands of yellow leaves fell to the ground, rustling.</p><br/><p>All of a sudden, thousands of tears appeared on his robes. A thin layer of fluorescence began to float over the surface of his body. The yellow leaves shattered into silk.</p><br/><p>He calmed himself. He gazed about the valley of broken trees and shattered stone amid the mountain forest, and hollered, “Twenty-Three-year Cicada Cultivator! Do you actually think that you are invincible just because you have transcended beyond the Five States?”</p><br/><p>“You are at the Divine Demon Realm at most. You are not even able to be immortal, how could you fight with the light?”</p><br/><p>He raised both of his hands slowly and turned the palm of his broken right hand towards the sky. He wore a firm and dedicated expression. His voice was like thunder in spring, blooming out and spreading towards a vast expanse of open ground and skies.</p><br/><p>‘May Haotian grant me the power!”</p><br/><p>The loud clear voice wandered amid the heaven and the earth, the sky reacted. The setting sun hanging in the west became bright. What it radiated was no longer meltingly red and warm, it appeared most supreme instead, holding people in awe and veneration.</p><br/><p>With little regard to the cloud-converging tactical array surrounding the mountain behind the Academy, a majestic force was traversing through the night clouds. It landed on the Hierarch along with the torrid sunlight.</p><br/><p>All of a sudden, his short thin body became extremely large.</p><br/><p>His body appeared to possess a horrifying force, similar to that of Heaven’s Way.</p><br/><p>The yellow leaves were blown high into the sky and dared not to fall any longer. Even the chirpings cicadas seemed to quiet in that exact moment.</p><br/><p>The Hierarch had finally put the Haotian Initiation to use.</p><br/><p>Yu Lian appeared outside the mountain forest.</p><br/><p>There was a trace of a dignified expression on her clean innocent face.</p><br/><p>Though she had been confident in the fight beyond the Five States, she had no experience at all.</p><br/><p>As a matter of fact, all the supremely powerful powerhouses who had been through fights beyond the Five States all these years, aside from the ones at the Limitless State, went back to the Haotian Divine Kingdom. It meant death.</p><br/><p>Looking at the gleam of the light falling from the West, she smiled faintly.</p><br/><p>She stretched her right hand out, as if to pick up a pen.</p><br/><p>She wrote a few Hairpin-style Small Regular Scripts in the air with this non-existent pen.</p><br/><p>Calmness and concentration. Disregard the affairs of human life and never worry about Heaven’s Way. Indulge in your own world.</p><br/><p>It was your own world.</p><br/><p>That was what the Headmaster had told her.</p><br/><p>It seemed that there was an additional transparent protective screen hanging in the sky over the mountain behind the Academy. It looked like cicada wings.</p><br/><p>The beam of light falling from the West landed on the protective screen. Most of it refracted away and was scattered across the world.</p><br/><p>This was Yu Lian’s world. And she refused to accept the intrusion of Haotian Divine Light.</p><br/><p>“You stupid presumptuous fool! You think you can create another world on your own to obstruct the Haotian Divine Light? Don’t forget that this world belongs to Haotian. Your world will always be subject to that of Haotian!”</p><br/><p>The Hierarch roared with fury and continued to greet the Divine Light of Haotian.</p><br/><p>Yu Lian glared at him. “You fool. Now the sneaky Divine God is fighting with the Headmaster. It is defending itself, how could it pay attention to whether you are alive or dead? Don’t ever forget that to the Divine Light you are lower than a dog.”</p><br/><p>She spread her right palm which held the pen. Her five fingers stretched out like an autumn chrysanthemum.</p><br/><p>A ray of extreme light and vague aura passed from her fingertips and spread across the whole mountain behind the Academy.</p><br/><p>All the trees began to tremble; the leaves seemed to come back to life.</p><br/><p>Each leaf was a cicada.</p><br/><p>The Hierarch did not believe what she had said at all. However, he noticed that it was true, the setting sun in the west had actually become dim, no longer rosy and gentle. His expression turned stern.</p><br/><p>He let out an unwilling scream. He was ready to leave.</p><br/><p>It was impossible; how could she do this?</p><br/><p>The Hierarch was stuck in the back of the mountain, surrounded by hundreds and thousands of cicadas.</p><br/><p>He could not go faster than a flying cicada.</p><br/><p>He couldn’t leave Yu Lian’s world.</p><br/><p>The buzzing of hundreds and thousands of cicadas was deafening. They completely covered his body; his face was a dense mass of darkness. It was quite terrifying to witness.</p><br/><p>One of the autumn cicadas shook its wings slightly.</p><br/><p>Then Hierarch could no longer see with his right eye.</p><br/><p>Ten autumn Cicadas began to dance.</p><br/><p>Then Hierarch’s right hand was broken.</p><br/><p>A forlorn and bitter growl rang out from the hundreds and thousands of Autumn Cicadas.</p><br/><p>The Hierarch Lord’s left hand had been hacked off by Great General Xu Shi.</p><br/><p>And now his right hand was destroyed on the mountain behind the Academy.</p><br/><p>There were only bare wrists remaining.</p><br/><p>He hugged himself with both arms.</p><br/><p>The brightness he had been holding in his palm and the light Haotian shined upon him were both imbued into this self-embrace. There was a vast expanse of brightness in front of him. It looked like a new sun.</p><br/><p>The sun exploded!</p><br/><p>Hundreds and thousands of cicadas danced and flew away with mournful chirping.</p><br/><p>One of the Cicadas came back and began dancing in the wind.</p><br/><p>The Hierarch had blood all over his body. He took advantage of this opportunity and rolled on the ground to escape, like a stray dog.</p><br/><p>Yu Lian appeared again, with blood dripping from the corner of her lip and a strong smile on her face.</p><br/><p>This was a fight between the powers of Haotian Taoism and Devil’s Doctrine.</p><br/><p>The Hierarch Lord from the West-Hill Divine Palace had broken his arm; he was blind; and his Snow Mountain was completely destroyed. However extraordinary the Divine Skill of Haotian Taoism was, it was impossible that the severe wounds he suffered would heal. He would be a wreck from now on.</p><br/><p>The Twenty-Three-year Cicada Cultivator, the grandmaster of Devil’s Doctrine, claimed the grand victory.</p><br/><p>She was the first female disciple the Headmaster had ever enrolled.</p><br/><p>The Academy was still invincible all over the world as usual.</p>\n</div>"}