{"title": "Chapter 749 - Confidence Making One Not Alone", "id": 749, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-749-confidence-making-one-not-alone", "volume_title": "Volume 8", "body": "<h1>Chapter 749 - Confidence Making One Not Alone</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Etiquette literally meant to figure out the order.</p><br/><p>Second Brother valued Etiquette, so he knew the order. He followed rules strictly, but that wouldn’t influence him on learning new things. Tens of thousands of sword marks fell from the sky and into the earth around him. The sword marks weaved an airtight cage. His eyes were looking out of the Cage and his sight fell on Ye Hongyu and the Divine Robe of Judgement she was in. He had read her hidden intentions.</p><br/><p>All of this was according to the West-Hill Palace’s plans.</p><br/><p>And to be specific, all of this was in the calculation of Ye Hongyu, because no matter whether Jun Mo was prideful or calm, he would always want to pull out his sword and defeat Ye Hongyu, the most powerful one here.</p><br/><p>So she succeeded in delaying the time before Jun Mo pulled out his sword.</p><br/><p>Moments later tens of thousands of sword marks had turned into the Cage Array, and it was too late for Jun Mo to change the way he moved.</p><br/><p>Her first strike was already the tens of thousands of swords marks, and she never had the intention to converge them in one. She deliberately met the mental state of her opponent, and she realized her own plan. Her start of the fight was nearly perfect.</p><br/><p>She dropped her pride and dignity as the Great Divine Priest of West-Hill, and she traded the advantage at a risk of failure. It would cost the powerful Second Brother some time to get out of the Cage Array.</p><br/><p>The ground started to shake, and the clopping sound was thundering from outside the sword shield. It could be vaguely seen that numerous cavalries were rushing out of the Coalition Army camp and they were overwhelming.</p><br/><p>The cavalries of the Coalition Army flowed to the mouth of the Verdant Canyon like a tidal wave.</p><br/><p>That was the fiercest strike from the West-Hill Coalition Army since the war of the Verdant Canyon started. Since Second Brother was now trapped in the Cage, could the sound of the zither and flute be as powerful still?</p><br/><p>Under the shelter at the mouth of the Verdant Canyon, Beigong Weiyang and Ximen Buhuo were playing the Chinese zither and blowing the vertical bamboo flute peacefully. Their hands pressed the strings and held the flute gently even though they could hear the clop of hooves getting closer and closer.</p><br/><p>Beigong Weiyang’s fingertips flickered, and then a faint note left the string and shot away like an arrow.</p><br/><p>Ximen Buhuo inclined his body and a dim note came out of the flute like water.</p><br/><p>At this moment, a hoarse voice rang out on the field.</p><br/><p>The voice came to the field all of a sudden. It crossed the field and reached the mouth of the Verdant Canyon as if it had been ordered.</p><br/><p>In the Military camp in the south of the field, the voile on the divine chariot swayed.</p><br/><p>A hoarse voice came out of the divine chariot. The voice was full of the aura of solemnity and sacredness, making people feel awe-stricken.</p><br/><p>“If you’re going to start a journey in the wilderness, you’ll deal with all things you have to get over with…”</p><br/><p>More than ten powerful priests in red sat cross-legged around the chariot, concentrating on the voice in the divine chariot, and they prayed again and again. Their voices echoed.</p><br/><p>In the chariot, the Great Divine Priest of Revelation looked at the scripture before him expressionlessly. Then he continued, “The seeds on the field are food Haotian gifted us; the echoes in the canyon is the instruction Haotian sent us by wind; now you shall march into the depraved land; and you, the believers of Haotian, shall do as Haotian orders.”</p><br/><p>Ten more priests in red repeated the verse again and again.</p><br/><p>The Great Divine Priest of Revelation then said, “For all those who try to perturb you with the sound and all those who try to instruct you for Haotian, they are all sinners, and they shall be punished by the fury of Haotian along with the other sinners.”</p><br/><p>The chanting of the priests in red outside the chariot grew more and more unified and cold.</p><br/><p>“…shall be punished by Haotian’s fury.”</p><br/><p>A few notes just came out of the zither, and a short piece of melody just flowed out of the flute before they were interrupted by the hoarse voice ringing in the Verdant Canyon magically.</p><br/><p>All the disciples of the Academy were well-read. And it took just a few words for them to figure out that this were the Verses of Punishing the Sinners from the Old Oath of Alliance from the West-Hill Scripture. The expression on Fourth Brother’s face changed dramatically. Then he raised the Sandbox in his hand, and prepared to blow sand to interrupt the chanting.</p><br/><p>However, the revelation of Haotian didn’t come tangibly, nor did the sound of the preaching of the West-Hill Palace. It came as nothing but the hoarse voice which no one was able to interrupt.</p><br/><p>Beigong Weiyang suddenly paled, and fear emerged in his eyes. Both of his arms trembled uncontrollably, and the strings on the Chinese zither broke from the middle.</p><br/><p>Ximen Buhuo was not as powerful as Beigong, so he felt even more pain. He moaned and blood came out of his lips. The blood flowed into the bamboo flute and dripped down from an end. Ximen Buhuo then fell onto the ground.</p><br/><p>The Coalition Army, which was running on the field and charged towards the Verdant Canyon, had also heard the solemn revelation, but they were rarely influenced, and instead, they became even more violent and fearless.</p><br/><p>The cavalry formed a tide that seemed to have encountered a hurricane. The tide accelerated, heading straight for the Verdant Canyon!</p><br/><p>The revelation echoed over the field, and that was when the Second Brother was sure that this was a trick of the Great Divine Priest of Revelation.</p><br/><p>The battle for the Verdant Canyon had been going for long, but the two bigwigs of the West-Hill Palace had not made their move yet. Now all of a sudden, they attacked together!</p><br/><p>Second Brother looked even more serious.</p><br/><p>While he was prideful and powerful enough, he didn’t have the confidence to face the two Great Divine Priests alone. Furthermore, the battle here at the Verdant Canyon today was more than a fight among the bigwigs; it was a battle between armies.</p><br/><p>He raised the iron sword in his hand and waved it at the Cage Array weaved by tens of thousands of sword marks.</p><br/><p>Every time the iron sword cut down, tens or even hundreds of sword lights would break and disappear. Given some time, he could easily break out of the Cage, and defeat Ye Hongyu.</p><br/><p>But now the cavalries had arrived and the sound of the zither and flute had ceased. If he kept concentrating on the Cage, those younger sisters and brothers of his would definitely be crushed by the cavalries.</p><br/><p>He couldn’t allow that to happen.</p><br/><p>He couldn’t afford to waste more time in the Cage, not even a short moment, he had to break out of the array immediately.</p><br/><p>However, as powerful as he was, it was impossible for him to break out of the Cage in an instant. It was impossible for the iron sword in his hand to cut through the sword shield immediately, no matter how tough the sword was.</p><br/><p>So he withdrew the iron sword.</p><br/><p>And he stopped trying to cut through the Cage Array with the iron sword.</p><br/><p>He looked at Ye Hongyu outside the sword shield silently. Then he retracted all his aura back into his body!</p><br/><p>Now he was no longer the Jun Mo whose sword style was second to none.</p><br/><p>He was an ordinary person now.</p><br/><p>Ye Hongyu guessed what he was going to do immediately, and she turned serious, too.</p><br/><p>The Cage Array that had fallen from heaven was weaved by tens of thousands of sword lights. It was a complicated and powerful array; the sword lights themselves carried their own sword style.</p><br/><p>When the Second Brother held back all his aura and drew back the iron sword, he gave up confronting the Cage. Then, the sword shield weaved by tens of thousands of sword lights suddenly collapsed toward the center; tens of thousands of swords stabbing towards his body.</p><br/><p>He was going to resist the tens of thousands of light swords with his body.</p><br/><p>Only in this way could he break out of the Cage Array in the shortest moment.</p><br/><p>However, he would end up miserable if he resisted the tens of thousands of light swords of Ye Hongyu even if he had been as powerful as Tang or Xia Hou in the Devil’s Doctrine. Second Brother’s body was no different from the ordinary person, how could he resist that?</p><br/><p>The reflection of fireworks shone on the bright armor. While the Cage Array was collapsing, the light swords suddenly became dense. They looked so bright that they might burn any time soon.</p><br/><p>In a short period of time, the armor Second Brother wore gave out endless Talisman Intent. It collided with countless light swords in heaven, bringing out numerous turbulences of Qi of Heaven and Earth.</p><br/><p>Whoosh! Whoosh! Whoosh! Whoosh! Whoosh!</p><br/><p>Tens of thousands of light swords fell on the surface of the armor, giving out dense grating and cutting sounds and some buzzing sound like tiny thunders. That sounded quite terrifying.</p><br/><p>The ground on which the Second Brother stood suddenly collapsed. Ten more pieces of crushed stone were shattered. And the grass soaked in blood had already turned into ashes and flown away.</p><br/><p>With the armor on him radiating numerous feverish rays, it looked like the Second Brother was burning in fire, and no one could see what was happening in the fire.</p><br/><p>Later on, the broad and straight iron sword came back into the sight of people.</p><br/><p>That iron sword had cut through the flames caused by the collision of the armor and the countless light swords. It had cut through the cold air on the field, and had cut through the howling wind, heading right at the face of Ye Hongyu.</p><br/><p>As the iron sword swung out, Second Brother’s figure showed up in the flames.</p><br/><p>He did not go forward.</p><br/><p>On the contrary, he took a step back.</p><br/><p>He had not taken one single step backwards since the battle started, no matter how many enemies he had been faced with.</p><br/><p>He had finally taken a step back now.</p><br/><p>He did not take a step back because there was no way behind.</p><br/><p>He had taken the step back now because his Younger Brothers and Sisters at the mouth of the Verdant Canyon needed his protection.</p><br/><p>The cavalry of West-Hill Divine Palace Coalition Army had reached him.</p><br/><p>He looked up, raised his sword and started the killing again.</p><br/><p>There was still no excessive expression on his face.</p><br/><p>He waved his sword carefully, without a single slight mistake.</p><br/><p>But his armor had become charred and looked ragged.</p><br/><p>The Divine Robe of Judgement was fluttering on the field and gathered like a red lotus.</p><br/><p>The sword style coming from the distance carried the unique killing aura of the iron sword. It flew around the red lotus and killed it, and then disappeared.</p><br/><p>Ye Hongyu paled slightly, and blood emerged at the corner of her lips.</p><br/><p>She used tens of thousands of light swords to make the Cage Array, but it had been broken by Jun Mo so easily.</p><br/><p>This was what she had never expected, but there was no shock or disappointment on her face. Instead, she smiled peacefully.</p><br/><p>She stopped watching the fight in the Verdant Canyon and turned around to go back to her own divine chariot.</p><br/><p>She had gotten what she wanted.</p><br/><p>As the main force of the Academy, Jun Mo was, of course, a tough opponent for the cavalries to deal with, but what bugged the cavalries most was the sound of the Chinese zither and the bamboo flute. The Plan of the West-Hill Palace today was to let Ye Hongyu fight Jun Mo, and then to let the cavalries charge to lure the zither and flute, and at last, to break the zither and flute with the revelation chanted by the priest in red led by the Great Divine Priest of Revelation.</p><br/><p>The whole plan had been executed perfectly.</p><br/><p>Although Jun Mo broke out of the Cage Array earlier than she expected, she did not care because the strings had already been broken and the flute was dripping blood. And the two disciples of the Academy had no power to fight anymore.</p><br/><p>Furthermore, she believed that although Jun Mo looked just fine, he must have suffered a heavy injury.</p><br/><p>Because that was her sword.</p><br/><p>And her Cage.</p><br/><p>Jun Mo must’ve paid a great price for this unexpected way to get out of the Cage no matter how powerful he was. Ye Hongyu was quite sure about that.</p><br/><p>Because she was most confident in her fighting abilities.</p>\n</div>"}