{"title": "Chapter 755 - Autumn Breeze and Fallen Leaves", "id": 755, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-755-autumn-breeze-and-fallen-leaves", "volume_title": "Volume 8", "body": "<h1>Chapter 755 - Autumn Breeze and Fallen Leaves</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Chang’an City claimed that it would never fall and has indeed never fallen. To be more exact, it had never experienced a single test since the Tang Empire was founded.</p><br/><p>No one ever doubted this, because Chang’an city was the last and most powerful source of confidence for the Tangs. As long as it stood on the southern plains of the Sishui River, the Tangs would be able to keep a smile on their faces.</p><br/><p>A siege was also not considered a threat. As long as Chang’an was there, the counties of the Tang Empire, especially those close to the capital would strongly resist against it. The resistance of the Tang and their determination to fight to the end would persist to the last moment.</p><br/><p>The Tangs were groomed to think that Chang’an would never fall. They thought that this was a fact that did not require any reasoning. Not many knew that it was because of the God-stunning Array.</p><br/><p>Only those who were the most important figures in the cultivation world knew of this fact.</p><br/><p>Now that the God-stunning Array had problems, Chang’an City was not as impenetrable and infallible as it had been in the past millennium. Should an army come, or a powerful cultivator entered the city, what would they do?</p><br/><p>For the time being, there were few who knew of this issue, including Ning Que.</p><br/><p>He looked at the streets that were densely built, worry and exhaustion written over his face.</p><br/><p>He kept painting over the drawings with a charcoal pencil as he looked at the aura blockages in the city. He thought of methods to fix or unblock them, but the more he thought, the uglier his expression grew.</p><br/><p>Third Sister had given him seven days, and two days had already passed. He had not thought of a solution, but had noticed that the situation with the big tactical array had worsened.</p><br/><p>Starting from the Daming Palace outside the Northern City, the dark waters hidden in the autumn forest came out of the curved mountain, gathering in the lake, passing through the underground of the Imperial Palace, the Southern Gate Temple, the Wanyan Tower, entering the Vermilion Bird Avenue and then exiting from the Southern City Gates…</p><br/><p>All the blockages occurred on this hidden line which played an important role in the God-stunning Array. It was called breath, and was the channel for the circle of life and death.</p><br/><p>Haotian Taoism had done something at the building under the Imperial Palace, and that had long been discovered and cleared by him. However, the interference caused to the God-stunning Array could not be reversed. In fact, as time passed, it grew even worse.</p><br/><p>He pondered about it for a long time but did not manage to find a solution.</p><br/><p>If the blockage was a real natural landscape or a street, then it did not mean much. With the Tang Empire’s powerful administration and mobilization capabilities, even a small hill could be hollowed out within a week.</p><br/><p>The problem was that Haotian Taoism had worked their ways on the array center underground, disturbing the Qi of Heaven and Earth in the tactical array. Many areas were blocked, directly affecting the entire array.</p><br/><p>The Southern City Gates at his feet were the ones most affected this time around.</p><br/><p>Ning Que did not understand, how did He Mingchi enter the building underground if he did not have the array eye pestle? He also did not understand what Haotian Taoism had done to calculate the God-stunning Array so clearly.</p><br/><p>Now that he thought about it, he could only say that Haotian Taoism was very well prepared.</p><br/><p>Haotian Taoism had prepared for a thousand years, gathering several of the wisest and most capable. Even though they were no match for the Headmaster and could not destroy the God-stunning Array, they had successfully managed to interfere with the operation of the God-stunning Array. The interference seemed solid and irreversible.</p><br/><p>Ning Que had already eliminated all sources of interference in Chang’an, but he couldn’t fix the blockage in the tactical array because it required an unimaginable amount of aura of Heaven and Earth.</p><br/><p>Actually, this level of damage or interference could be repaired by the God-stunning Array itself, but it would take a long time; about two or three years to return to normal. This would not be a problem in peacetime. However, the problem was that the enemy would not give the Tangs such a long time during the ongoing war.</p><br/><p>If his teacher had not ascended to heaven, then this would be a simple fix. He would only need to wave his sleeves to gather an insurmountable amount of aura around Chang’an.</p><br/><p>But he had left the world.</p><br/><p>No one else in the world could do that now.</p><br/><p>Then… was there really no way to fix the big tactical array?</p><br/><p>Did that mean that Chang’an was open to attacks now?</p><br/><p>The array eye pestle was cradled in Ning Que’s arms and was as hard as a rock, which confused him.</p><br/><p>The Headmaster had left him in charge of the city, and the array eye pestle was left behind by Master Yan Se and the Emperor for him. This meant that he could not escape the responsibility of protecting Chang’an and the Tang Empire.</p><br/><p>This was the ultimate glory, but also the heaviest burden in the world.</p><br/><p>However, the most ludicrous thing in this entire matter was that… Ning Que was not an Array Tactical Master.</p><br/><p>Master Yan Se once said that the array was a large talisman and a talisman was a small array. The cultivation world had this saying, that Array Tactical Masters cannot become Talisman Masters, but Talisman Masters were all exceptional Array Tactical Masters.</p><br/><p>Ning Que was a gifted Talisman Master, but he was not gifted in tactical arrays. When he had first entered the back of the mountain of the Academy, he had helped Seventh Sister to arrange tactical arrays for days. However, he had not improved at all. He worked hard at learning to control the God-stunning Array over the years, but had not made any progress.</p><br/><p>Now that both Fourth Brother and Seventh Sister were not in the Academy, there was no one he could consult with. That was why he became increasingly worried, feeling almost crushed by his burdens.</p><br/><p>The autumn wind seemed to grow colder. After a moment of silence, he walked down toward the city walls.</p><br/><p>The Southern City Gates of Chang’an were across the Vermilion Bird Avenue. It had been heavily guarded since the beginning of the war.</p><br/><p>The imperial court had heeded his request and transferred all the remaining Yulin Royal Guards to that very place. More than a hundred Yulin Royal Guards in shiny armor were standing solemnly on the streets, waiting for their orders. The atmosphere was very tense.</p><br/><p>Dozens of Fish-dragon Gang members in black clothes stood under the awnings on the street. They looked at everyone entering and leaving the city carefully. The troops around Chang’an had all been deployed to the Northern Frontier and the defense around the city was weak. As such, the imperial court was forced to use common folk as troops.</p><br/><p>The non-commissioned officers of the city defense department carefully checked the teams entering and leaving the city. They also carried out a three-person round inspection system for each document to ensure that there were no spies or contraband crossing the border.</p><br/><p>This kind of inspection was very complicated and troublesome. Fortunately, there were very few people entering and leaving Chang’an City at the time. There was only an endless supply of grain transportation teams that filled up the state highway outside the city.</p><br/><p>These were all grains shipped from various states and counties.</p><br/><p>The Tang Empire was ready for a siege on Chang’an City.</p><br/><p>But no one began preparations for Chang’an City to be breached. They were not even mentally prepared for it.</p><br/><p>Looking at this scene, Ning Que’s mood took a downward turn.</p><br/><p>Just then, a woman entered through the city gate.</p><br/><p>The woman had brows like ink and eyes like dots of paint. She looked like a painting.</p><br/><p>Her lips were slightly thin, and they were pursed calmly. They looked like wax plums on her pale complexion.</p><br/><p>Her long straight black hair cascaded over her shoulders, unlike the waterfall that it had been years ago. It was straight and beautiful.</p><br/><p>Ning Que looked at her quietly and then suddenly looked up at the sky.</p><br/><p>It was late autumn, the skies looked high and far away, calm and placid.</p><br/><p>He suddenly felt that Haotian… No, his teacher in heaven must have sensed his worry and uneasiness. That was why he had sent her to Chang’an, to him.</p><br/><p>Then, he withdrew his gaze from the sky to look at the beautiful girl and smile.</p><br/><p>“Why have you come to Chang’an?”</p><br/><p>“I wanted to, so I did.”</p><br/><p>Mo Shanshan answered with a smile, with her white cotton dress fluttering in the wind.</p><br/><p>Ning Que thought of a problem. He asked, “The Black Ink Garden…”</p><br/><p>Mo Shanshan knew what he wanted to ask. She answered calmly without waiting for him to complete his question, “I have already left them.”</p><br/><p>Ning Que did not expect to hear this, but he knew that this was the only answer.</p><br/><p>Mo Shanshan did not wish to implicate the Black Ink Garden, her teachers or her fellow disciples, and even the Great River Kingdom. That was why she could only leave her sect and come to Chang’an to stand against the West-Hill Divine Palace.</p><br/><p>After a moment of silence, he extended his right hand and invited her into the city.</p><br/><p>Ning Que and Mo Shanshan walked through Chang’an City.</p><br/><p>They walked side by side, just like so many years ago. However, it was unlike before.</p><br/><p>The two arrived at the Imperial Palace and at the bridge from back then. It was the same vermilion red palace walls, but they did not see the spiraling snowflakes falling from the sky. Instead, the ground was thickly covered with yellow ginkgo leaves.</p><br/><p>“I don’t have time. Otherwise, we could travel again together.”</p><br/><p>Ning Que reached his hands above the water and caught a falling leaf. He said, “This is the fourth blockage. Try to sense the aura below the building.”</p><br/><p>Mo Shanshan closed her eyes, her long lashes fluttering against her porcelain skin.</p><br/><p>She opened her eyes moments later, a myriad of emotions swirling in them. She felt shocked and extremely uneasy.</p><br/><p>“What a… powerful tactical array.”</p><br/><p>Ning Que let go of the leaf and allowed it to continue falling into the moat below the bridge. The flow of the river was very slow and it was covered in beautiful yellow leaves. The addition of another leaf did not change its appearance.</p><br/><p>He looked at the yellow leaves on the moat and said, “It is troublesome because it is powerful. After Haotian Taoism tried to block it, we’d need even more Qi of Heaven and Earth to unblock it.”</p><br/><p>Mo Shanshan considered it for a moment and shook her head, saying, “Nobody can call up so much Qi of Heaven and Earth, and there is nobody who can setup a tactical array that could fix this.”</p><br/><p>Ning Que asked, “Can we use a talisman?”</p><br/><p>Mo Shanshan answered, “If an array is a talisman, then this big tactical array is the most powerful talisman I have ever seen in my life. In fact, one can even say that it is the true Divine Talisman.”</p><br/><p>Ning Que understood what she meant.</p><br/><p>Chang’an was very large, and the Headmaster’s wisdom was a peak that was hard to climb.</p><br/><p>Haotian Taoism’s methods might seem simple, but they understood that.</p><br/><p>He said, “I hope that you can solve this problem.”</p><br/><p>Mo Shanshan replied, “I don’t have such abilities.”</p><br/><p>Ning Que said, “But you’re stronger than me.”</p><br/><p>Mo Shanshan answered, “Then you can hand over the array eye pestle to me.”</p><br/><p>Ning Que shook his head.</p><br/><p>Mo Shanshan smiled and said, “I thought that you’d have learned to trust after experiencing so many things.”</p><br/><p>Ning Que thought of the tanned girl with a pair of lotus white feet on the Sishui River.</p><br/><p>He thought of Sangsang, whose body was in the dark while her feet stepped in the light.</p><br/><p>He said, “I apologize. Even if Miss Li San comes back to life, I cannot trust anyone completely other than the Academy.”</p><br/><p>Mo Shanshan asked, “Who is Miss Li San?”</p><br/><p>Ning Que answered, “My mother.”</p><br/><p>After a short moment of silence, Mo Shanshan said, “I’m sorry.”</p>\n</div>"}