{"title": "Chapter 754 - A Sleepless Night (Part II)", "id": 754, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-754-a-sleepless-night-part-ii", "volume_title": "Volume 8", "body": "<h1>Chapter 754 - A Sleepless Night (Part II)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“The mute wouldn’t speak until some salt was sprinkled over his pancakes.”</p><br/><p>A Buddhism chant rang out from the thin mist.</p><br/><p>A figure walked out from the mist slowly.</p><br/><p>It was a man dressed in ordinary simple-colored clothing with a Taoism bun.</p><br/><p>A thin wooden sword hanging above his head pierced through the mist and moved forward without making any noise.</p><br/><p>It was exactly the World Wayfarer of Haotian Taoism, Ye Su, with his accompanying sword.</p><br/><p>Second Brother stood up slowly.</p><br/><p>He had been sitting back-to-back with Fourth Brother for the whole night.</p><br/><p>Without sleeping at all for a whole night, he could not conceal the expression of exhaustion between his eyes and brows.</p><br/><p>While hearing the Buddhism chant ringing out from the mist, everyone in the Academy showed a wary expression on their faces, even with a touch of anxiety.</p><br/><p>“Sprinkle more salt on the pancake.”</p><br/><p>Second Brother was talking to Mu You who was baking pancakes by the stove, “Seems his taste is pretty much heavier.”</p><br/><p>This was a joke which was not funny at all.</p><br/><p>But due to the fact that he had never joked, he looked quite funny when telling the joke, so everybody laughed out.</p><br/><p>Then silence befell.</p><br/><p>All felt somewhat uneasy when Second Brother started to tell jokes.</p><br/><p>Ye Su asked, “What’s so funny?”</p><br/><p>Second Brother replied, “Only you have shown up, of course, you were that funny.”</p><br/><p>Ye Su went on and said, “It seems that you were not surprised by my showing up.”</p><br/><p>Second Brother spoke out, “The Abbey Dean had dropped by yesterday. Since groups of flies have been dancing and flying, it does not matter if one more fly exists.”</p><br/><p>Ye Su said, “I wanted to fight with you back at Chang’an City.”</p><br/><p>Second Brother answered, “If it had not been because of the prohibition from my Senior Brother, I would have searched for you and gotten out of the mountain with a sword in my hand, at the time when you were watching over the small Taoist temple.”</p><br/><p>Ye Su said, “To kill people, you have to use a sword.”</p><br/><p>With iron sword raised up in his hands, Second Brother said then, “I won’t say such crappy things like the sword having already been in my hand.”</p><br/><p>Ye Su asked smilingly, “Then what are you going to say?”</p><br/><p>Second Brother replied, “What I want to say is that you are showing up at a pretty bad time which is bad for you.”</p><br/><p>“How so?” Taking his smile back, Ye Su asked calmly.</p><br/><p>Second Brother said, “I have been killing hundreds of people for these two days. My sword momentum is going strong.”</p><br/><p>“Liu Bai has been waiting for the time when you kill people to a frantic state. But I do not want to wait any longer.”</p><br/><p>Ye Su said, “Because by then, it would perhaps be the worst time.”</p><br/><p>Then with his brows suddenly creased over, he said, “Jun Mo, you are now in a somewhat bad state.”</p><br/><p>Second Brother replied with a peaceful and conscientious way.</p><br/><p>“It is natural of my spirits to be in a somewhat absent state after a sleepless night.”</p><br/><p>Ye Su asked, “Do you need to sleep for a while first?”</p><br/><p>Second Brother replied, “No, it is unnecessary.”</p><br/><p>With his eyebrows tilted up slightly, he asked, “Why?”</p><br/><p>Second Brother said, “Because you are still not Liu Bai after all.”</p><br/><p><em>“You are not Liu Bai. You may become Liu Bai, but at this moment you are still not Liu Bai.”</em></p><br/><p><em>“Then, even after a sleepless night, I am still confident in beating you down.”</em></p><br/><p>That was what Second Brother was trying to say.</p><br/><p>The ordinary soldiers and generals in the West-Hill Divine Palace Coalition Army had no idea as to who that person was.</p><br/><p>While for some priests who held extremely profound qualifications in the Divine Hall, they had figured out the identity of that person. The joyous expression on their faces was too obvious to be concealed.</p><br/><p>However, Ye Hongyu slightly frowned.</p><br/><p>She once regarded the person as her idol and the object of her cultivation.</p><br/><p>However, currently, in her eyes, that person was also a fool.</p><br/><p>The same as the Abbey Dean and Liu Bai.</p><br/><p>Due to the fact that they had been cultivating for a very long time and they were so proud, transcendent and pure, they were consequently cleansing their hearts and limiting their desires.</p><br/><p>They were all sublime beings.</p><br/><p>Even Sages.</p><br/><p>But they were not the people who would claim the final victory.</p><br/><p>In the battlefield where life and death were settled in just an instant, there was no room for pride and a good presence was an unnecessary thing.</p><br/><p>At this very moment, she thought of Ning Que once again.</p><br/><p>If they both were still alive after many years, no one would know who would be victorious, no one knew.</p><br/><p>Ning Que had no idea as to how highly this contemporary Great Divine Priest of Judgment regarded him and expected of him. He was currently focusing all of his attention and energy on the floor in front of him.</p><br/><p>There were numerous stereoscopic shapes made up of haze and line lying across the wide granite floor. While in the city wall whose surrounding was of thick light, there lied Wanyan Tower whose height less than knee-high and square cities which looked like scales.</p><br/><p>This microminiature Chang’an City was the God-stunning Array.</p><br/><p>Crossing his legs and sitting outside this Chang’an City, Ning Que made his inspection with a silent yet attentive manner.</p><br/><p>He had already been looking at the array for the whole day and the whole night.</p><br/><p>He had already noticed where the problems lied in long since.</p><br/><p>Chang’an City was blocked.</p><br/><p>It was neither Vermilion Bird Avenue that had been jammed by the horse carriages nor the streets and valleys of Eastern City that had been jammed by vendors. Not to mention that it was not the groundwater artery that had been jammed by sludge. It was not a physical blockage.</p><br/><p>The obstruction “jammed” referred to the functioning and operation of aura in heaven and earth inside this grand city had become somewhat not smooth.</p><br/><p>With his naked eyes, even Ning Que was able to see that in over ten places of Chang’an right in front of him, the haze flow and functioning were obviously affected by some disturbance, which had made them converge into one turmoil.</p><br/><p>Chang’an City itself was actually a big array.</p><br/><p>A big tactical array that could stun the gods.</p><br/><p>The power of this big tactical array came right from the Qi of Heaven and Earth flowing in Chang’an City.</p><br/><p>Back to thousands of years ago when Chang’an City was initially built, with his own unprecedented wisdom, the Headmaster had taken advantage of the topography inside the city to build up the palaces and the architecture. While directing the aura of Heaven and Earth into this city, he had arranged this big tactical array which could be healed on its own and which was of limitless growing cycle.</p><br/><p>While over the years to come, the Qi of Heaven and Earth which was originally supposed to flow at their own free will blew into Chang’an City like the fresh breeze. It was as free as before, however, it started to have its own rules.</p><br/><p>Those rules were where the original source of God-stunning Array lied.</p><br/><p>Time was a weapon that was both the cruelest and the most powerful. Though God-stunning Array was able to heal on its own, for it to stay in the best state as always, the maintenance from people inside the city was still needed.</p><br/><p>The imperial court of the Tang Empire had a specialized refund of the mantainance. While the most important work of Clean Water Department of the Ministry of Workers was to be in charge of dredging all the natural water channels and lakes inside Chang’an City.</p><br/><p>The cleaning of Yanming Lake was a civil engineering project superficially. In fact, it was a routine maintenance for God-stunning Array.</p><br/><p>However, it was impossible for the big God-Stunning Array to lose its power because of some architectural modification or some typographical change. As a matter of fact, even if the imperial court had never held maintenance towards this array, in no way should this situation happen either.</p><br/><p>Getting himself up and walking into the Chang’an City frozen by haze, Ning Que climbed over the Yanming Mountain and came to the front of the imperial city whose height was no more than that of knees. He bent himself to grab the array eye pestle which had already been half plugged in the ground and pulled it out.</p><br/><p>With this motion going on, Chang’an City lying on the granite floor gradually transformed itself into a dense haze and then it was frozen downwards into the watery liquid light, dripping itself down slowly along those carving scars on the floor.</p><br/><p>The array eye pestle in his hands also became dark bit by bit, with its own complicated pattern blending together with its pestle body.</p><br/><p>After leaving the Imperial Palace, Ning Que came over to the top of the city wall.</p><br/><p>Looking down upon the Chang’an City located at the foot of the city wall, he had been silent for a pretty long time.</p><br/><p>With the turmoil inside Chang’an City being subsided, life went gradually back to normal.</p><br/><p>There were more and more horse carriages running across the street. The passers-by wore calm looks on their faces, most of them being in a hurry.</p><br/><p>At this time, with Tang Empire having all been mobilized, the Tangs were all dedicated to their own things in a conscientious way.</p><br/><p>It was pretty clear to them that only via doing so could they best show out their support towards the soldiers and generals who fought dauntlessly in the front line.</p><br/><p>Without sleeping for a really long time, Ning Que was so wearisome. His eyes felt somewhat itched.</p><br/><p>With his eyes closed, he began to sense this city.</p><br/><p>He appeared to have seen through the inner sides of the Tangs who were peaceful and strong.</p><br/><p>While at the same time, he saw the aura of heaven and earth from over ten places had been blocked.</p><br/><p>At the time when all the Tangs recovered to claim their confidence and courage.</p><br/><p>He saw that Chang’an City was at risk.</p><br/><p>He was anxious and ill at ease.</p><br/><p>He had been sleepless all through the night.</p>\n</div>"}