{"title": "Chapter 766 - Water in the Yellow River from Sky", "id": 766, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-766-water-in-the-yellow-river-from-sky", "volume_title": "Volume 8", "body": "<h1>Chapter 766 - Water in the Yellow River from Sky</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>No matter how slowly one walked, he would eventually reach his destination.</p><br/><p>Liu Bai arrived before the Verdant Canyon and stopped by Jun Mo.</p><br/><p>He was more than a foot away from Jun Mo, but that was enough.</p><br/><p>After all, an one-foot radius around a person was just a vague description.</p><br/><p>In fact, Liu Bai’s Absolute Territory depended on the length of his sword and arms.</p><br/><p>He was the strongest in wherever his sword could reach.</p><br/><p>The distance right now was perfect. It was not far nor near, and was perfect for a sword to cut down.</p><br/><p>Distance was a relative concept. It was fair to the both of them. Jun Mo naturally felt that it was perfect. That was why he raised his iron sword without thinking and swung it at Liu Bai.</p><br/><p>He did not say anything, nor did he make any extraneous moves. He waved his sword, just like that.</p><br/><p>It was a clean and clear cut.</p><br/><p>Just like the lovely jade green hills behind him that were still verdant even in late autumn.</p><br/><p>The iron sword cut down cleanly and fell toward Liu Bai’s head like a green hill.</p><br/><p>Liu Bai did not wave his sword because it was one foot in front of him.</p><br/><p>This was his first strike in the true sense.</p><br/><p>Liu Bai’s sword was indeed the most powerful.</p><br/><p>When the rusty sword in his hand fell, the mottled rusty marks disappeared instantly, and the body of the sword suddenly brightened. It reflected the floating clouds in the sky and the green hills by the wilderness. It was extremely beautiful.</p><br/><p>This sword seemed to have taken away all the splendor between heaven and earth, and countless creations in nature.</p><br/><p>It was beyond brilliant.</p><br/><p>The brilliance could be dazzling, just like how one could not look directly at the sun. However, this sword did not hurt anyone watching the war on the wilderness. Instead, they were intoxicated by it.</p><br/><p>They were intoxicated with this beautiful and moving picture. The celadon-like sky, the silk-like clouds, the warm sunshine, the beautiful wilderness, and a big river.</p><br/><p>The river originated from the Wilderness and was originally a trickle-down stream, stubbornly breaking through the mountains of the Yuelun Kingdom. It negotiated the primeval forest with fertile soil and abundant rainwater to form numerous tributaries, turning into a big river, carrying sediment from the south. The river was dyed a turbid yellow, and it grew more and more majestic.</p><br/><p>The turbid waves were so great that the yellow river kept beating against the black cliff, stirring up thousands of heavy waves that were like mud. It sounded as if there were ten thousand horses neighing there, sounding especially startling.</p><br/><p>Between the black cliff stones, a young man was practicing with his sword. He looked serene as if he could not hear the sound of the waves. The vibration of the cliff did not make him move at all, and he was very absorbed.</p><br/><p>Heaven and Earth shivered and lost their color. But it was unknown if it was because of the rushing river, or because of the person wielding the sword by the river.</p><br/><p>Liu Bai entered the cultivation path and saw a large river at the Initial Awareness State. As such, he was considered a rare genius in the cultivation circle. Later he gained awareness of his own Sword Taoism by the great river, so his sword technique was called the Dahe Sword, or literally the Great River Sword.</p><br/><p>When the Dahe Sword appeared, one would see a great river.</p><br/><p>Liu Bai’s sword was the great river.</p><br/><p>When he used his sword, the great river would appear.</p><br/><p>All those who saw the great river would be swallowed by the rushing stream.</p><br/><p>A large river had large waves.</p><br/><p>Muddy yellow river water fell from the sky, becoming the Sky River.</p><br/><p>It was as if a hole had been pierced in the sky and there were endless water pouring down from heaven like a waterfall.</p><br/><p>The river did not have any other aura but strength.</p><br/><p>The river headed right toward him.</p><br/><p>Jun Mo’s eyes suddenly brightened.</p><br/><p>He looked at the turbid waves in the river, his eyes looking like glittering streams.</p><br/><p>His eyebrows rose.</p><br/><p>All these details meant that he was becoming excited.</p><br/><p>He was usually a placid person. To Ning Que and his other younger brothers, he was a stern, and even antiquated man that they would never relate to the excitement.</p><br/><p>His facial expression had not changed at all when he had gained the victory over Ye Su earlier.</p><br/><p>However, he was truly excited now.</p><br/><p>Because when he saw the large rushing river, he discovered that he was frightened.</p><br/><p>This was a foreign emotion to him, which was why he was excited.</p><br/><p>He had finally seen the most powerful sword in the world.</p><br/><p>He raised his iron sword and cut down toward the river.</p><br/><p>The broad and straight iron sword wielded the strength of the green hills. It slammed down heavily at the muddy rushing river.</p><br/><p>The river suddenly parted and surged toward both sides, revealing the bottom of the river full of sand and rocks.</p><br/><p>The river poured back the next moment, covering the sand and rocks.</p><br/><p>Jun Mo waved his iron sword once more.</p><br/><p>The river parted again.</p><br/><p>He continued waving the sword.</p><br/><p>The river parted and then poured back again.</p><br/><p>This happened many times, and the iron sword cut into the bottom of the river.</p><br/><p>The iron sword gouged many deep sword marks on the mud at the bottom of the river and shattered several rocks.</p><br/><p>The meeting between sword and rocks caused a loud dull crash.</p><br/><p>It was like the sound of hammering.</p><br/><p>Jun Mo continued waving the sword.</p><br/><p>He waved it several hundred times in an instant.</p><br/><p>However, he could not stop the river from flowing southeast.</p><br/><p>The river continued flowing downwards.</p><br/><p>Liu Bai’s sword continued moving forward as well.</p><br/><p>The river that flowed down from the sky was the most magnificent thing that could be seen on earth.</p><br/><p>In the face of such a gushing Yellow River, many would subconsciously look up to it and feel intoxicated by its majesty. Then, they would regain their wits and lose their courage as they started to feel despair.</p><br/><p>This was where the Dahe Sword was most powerful.</p><br/><p>His sword did not borrow the power of heaven and earth.</p><br/><p>His sword was part of it, and that was its most magnificent trait.</p><br/><p>At this moment, his sword was the incarnation of heaven and earth.</p><br/><p>Before the river, Jun Mo could stand unwaveringly like a tree, resisting it with his sword. This was already beyond what many cultivators in the world could do. However, the river flow was too irresistible for him to stop.</p><br/><p>This was Liu Bai’s sword style.</p><br/><p>The river bellowed.</p><br/><p>The wind screamed.</p><br/><p>A crown fell.</p><br/><p>And the hair was dishevelled.</p><br/><p>Jun Mo’s black hair fluttered in the air.</p><br/><p>Several openings had long appeared on his academy uniform and he was covered in blood.</p><br/><p>But he did not look pathetic at all. He seemed solemn and majestic, looking as if he was attending a banquet.</p><br/><p>A banquet that was yet to end.</p><br/><p>He was focused, calm, and even seemed a little wooden.</p><br/><p>He continued waving the sword.</p><br/><p>But the movement was no longer made of large or broad strokes. Instead, it was becoming delicate.</p><br/><p>It was so delicate it looked like the embroidery needle in Mu You’s hands.</p><br/><p>Jun Mo started using the iron sword to embroider.</p><br/><p>In seconds, the iron sword in his hands trembled countless times.</p><br/><p>The great river was Liu Bai’s sword.</p><br/><p>The wind and waves resulted in places where the iron sword and Liu Bai’s sword clashed several times.</p><br/><p>Jun Mo carved words in the wind and flowers in the waves.</p><br/><p>He wanted to use the most delicate instrument to carve the magnificent mountains and rivers. He used the most silent method to decorate the most beautiful and majestic image, just like how time and rain would smoothen green stone tiles.</p><br/><p>Jun Mo knew right from the start that he would have to face Liu Bain at the end of the battle of Verdant Canyon.</p><br/><p>Just like what Liu Bai had said, no matter the prowess of his sword or his swordsmanship, he was no match for Liu Bai.</p><br/><p>He was no match for Liu Bai either way, so he had to take another path.</p><br/><p>Liu Bai had once written a letter to Ye Hongyu. And he had drawn her a sword.</p><br/><p>Ning Que had seen the sword, and he had used Ke Haoran’s formula to exchange for a copy that he placed at the back of the mountain of the Academy.</p><br/><p>Before heading south to the Verdant Canyon, Jun Mo had looked at that piece of paper for a long time before he decided on a sword style.</p><br/><p>The sword style was completely different from his character.</p><br/><p>But this was the only solution he had come up with after much consideration.</p><br/><p>Just like what Ning Que had said, the people in the Academy all believed in one simple truth. If there was only one solution left in the end, then it had to be the best solution.</p><br/><p>Furthermore, he had once told Ye Su that Etiquette set after making careful considerations and deciding that a rule was reasonable, he would not go against it the slightest even when facing down a thousand men.</p><br/><p>That is why even when he wanted to object to the solution, he persisted.</p><br/><p>In order to defeat Liu Bai, Jun Mo had made sufficient preparations, from the most vigorous to the extremely subtle. He had developed his Swordsmanship to the fullest. This was his most powerful moment.</p><br/><p>However, the Yellow River was still the Yellow River.</p><br/><p>And Liu Bai was still Liu Bai.</p><br/><p>He was not a willow branch by the river, nor the little shepherd boy under the willow tree. He was not a wild man on a sheepskin raft, a widow that was pushed into the turbid waves, nor a rock in the river.</p><br/><p>He was the great river.</p><br/><p>Jun Mo’s sword style might wave freely, but it was still slightly inferior before this river.</p><br/><p>There was just the slightest difference between the two.</p><br/><p>The characters in the air were missing strokes and the flowers in the waves were missing a petal.</p><br/><p>The autumn wind swept over the sword marks and the waves covered the flowers.</p><br/><p>Liu Bai’s sword hit the iron sword and arrived before Jun Mo.</p><br/><p>There was a swooshing sound.</p><br/><p>Second Brother’s right arm tore from his shoulder and fell into the green hills. No one knew where it landed.</p><br/><p>The sword in Liu Bai’s hands broke in two at the same time.</p><br/><p>If Jun Mo had been seconds faster, Liu Bai’s sword would have broken first.</p><br/><p>Jun Mo could not be any faster; that was why his right arm, that had been gripping the iron sword, was broken.</p><br/><p>Several tiny cuts appeared on his body.</p><br/><p>These wounds all came from Liu Bai’s sword style.</p><br/><p>His academy uniform was completely drenched in blood, dripping onto the ground.</p><br/><p>Blood flowed like the river from where his arm had been torn off.</p><br/><p>Jun Mo looked at Liu Bai who was in front of him with a pale face.</p><br/><p>His right arm had been broken and his iron sword lost.</p><br/><p>Liu Bai only had half a sword left in his hand.</p><br/><p>Even a broken sword was still a sword and it could kill.</p><br/><p>Liu Bai did not stop because he could not.</p><br/><p>His sword was the Dahe Sword, and the water that fell was river water. It would not stop until it ended.</p><br/><p>Spilled water cannot be taken back.</p><br/><p>Liu Bai wielded the broken sword and cut down toward Jun Mo.</p><br/><p>The great river appeared once more.</p><br/><p>The surge of the Yellow River grew.</p><br/><p>Those who saw the great river had to die.</p><br/><p>No one in the world could stand against the great river.</p><br/><p>Because the river water came from the sky.</p><br/><p>And it flowed into the sea, never to return.</p><br/><p>The broken sword approached.</p><br/><p>He could even see the lines on the metal of the sword.</p><br/><p>Jun Mo knew that he was wrong.</p><br/><p>He had been wrong since the battle of Verdant Canyon started.</p><br/><p>To be more precise, he was wrong since the Academy.</p><br/><p>He should not have looked at that piece of paper, and that sword.</p><br/><p>He should not have thought of how Liu Bai would act to decide what he would do.</p><br/><p>He would lose the thing that made him strongest.</p><br/><p>That thing might be called confidence, or perhaps pride.</p><br/><p>He should have only thought of what he was going to do, just like how he did in the past.</p><br/><p>What’s the difference if his opponent was Liu Bai or anyone else?</p><br/><p>Jun Mo thought as he looked at the river surging towards him.</p><br/><p>If he did not look at the sword, he would not see it.</p><br/><p>This sword intoxicated those who saw the great river and made them despair.</p><br/><p>Then he shall not look at it.</p><br/><p>He had to correct his mistakes, no matter where and when he was.</p><br/><p>He closed his eyes in the face of the most powerful sword in the world.</p><br/><p>The river surged up and fell from the sky, seemingly destroying the whole plains in front of the green hills.</p><br/><p>However, Jun Mo did not see it, so he did not feel the majesty of the river.</p><br/><p>There was turbid yellow river water everywhere. But if he did not see it, it did not exist.</p><br/><p>The broken sword in Liu Bai’s hands cut through the air.</p><br/><p>This was the first time the Dahe Sword cut through the air since it appeared on earth.</p><br/><p>Because Jun Mo did not see the river falling from the sky.</p>\n</div>"}