{"title": "Chapter 781 - Armed with Chang'an to Fight (Part I)", "id": 781, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-781-armed-with-changan-to-fight-part-i", "volume_title": "Volume 8", "body": "<h1>Chapter 781 - Armed with Chang'an to Fight (Part I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The snow had been beating down from last night until now and had turned Chang’an into a piece of black and white cloth. This cloth was embroidered with houses, temples, mountains, and lakes, but one of the streets was foggy and dim.</p><br/><p>Ning Que had heavily sewn that place, trying to mend it or embroider a new flower to cover it up, which relit it.</p><br/><p>Unfortunately, he was too late to know that, and he did not have enough time to do that before the Abbey Dean found him.</p><br/><p>He and the Abbey Dean saw each other across a long street through the wind and snow.</p><br/><p>The Abbey Dean had been injured passing through Chang’an. His robe was stained with blood, but he had not fallen down.</p><br/><p>They had not met, but they had seen each other.</p><br/><p>Once they met, the battle between them would end.</p><br/><p>Ning Que knew he would lose.</p><br/><p>Mo Shanshan took a look at him, threw all the stones to the ground, and then left.</p><br/><p>He took the Array Eye Pestle and tightly held his hilt.</p><br/><p>In the past, if he was sure that he would lose, he would have left. This time, however, he stayed.</p><br/><p>This had nothing to do with bravery—he was just confident.</p><br/><p>He believed that he could achieve the final victory.</p><br/><p>And that was because he was in Chang’an.</p><br/><p>The Abbey Dean looked at him across the miles of wind and snow.</p><br/><p>The Array Eye Pestle in Ning Que’s hand began to burn, and it was smoking and smelling pungent.</p><br/><p>From morning until now, this was the first time that Ning Que and the Abbey Dean really had any contact. Only with the power of the God-stunning Array was he able to remain conscious under the Abbey Dean’s vision.</p><br/><p>The power of the God-stunning Array spread to the street through the Array Eye Pestle, protecting his heart and body. As the passageway of the God-stunning Array, the Array Eye Pestle had borne unimaginable Qi of Heaven and Earth and was heating up rapidly.</p><br/><p>Not only could his palm feel the pain, but his heart was also in pain.</p><br/><p>However, he remained calm and said nothing. Since it was hot, he still could fight.</p><br/><p>“Even in Chang’an, you are still too weak.”</p><br/><p>The voice of the Abbey Dean resounded from a distant place, which even the wind and snow could not cover up.</p><br/><p>Looking through the wind and snow, Ning Que said, “In Chang’an, I know everything, so you can never catch up to me. Now, I just want to see if I can be omnipotent.”</p><br/><p>Then in a downward motion, he drew out his podao.</p><br/><p>The Psyche Power in his sense of perception overflowed through the Array Eye Pestle and spread out in all the directions of Chang’an, covering the houses in Eastern City, the historied black bricks, the five lakes in Western City, as well as the buildings and pavilions.</p><br/><p>A boundless aura came out of the brick joints, rising up from the bottom of the ice-covered lakes and the depths of the buildings.</p><br/><p>The withered beams creaked and the green-stoned slates shook, raising dust. The hot spring gushing out from the bottom of the five lakes got hotter and hotter, creating countless pearl-like bubbles, and fish fled from the boiling water.</p><br/><p>There was one way in and one way out.</p><br/><p>The God-stunning Array sensed the summoning of Psyche Power from the Array Eye Pestle and responded by sending endless Qi of Heaven and Earth to Vermilion Bird Avenue, surrounding him and his podao.</p><br/><p>Ning Que wielded his podao to chop the city down.</p><br/><p>Innumerable marks appeared on the snowy street with a cracking sound and then spread forward.</p><br/><p>Consisting of two strokes, every mark was the character “Yi”, which was also a powerful Divine Talisman.</p><br/><p>The aura condensed in the marks was extremely powerful and each mark was above the Five States, which blocked the entire Vermilion Bird Avenue.</p><br/><p>The marks moved and killed people like grass being cut.</p><br/><p>They broke down everything in their way.</p><br/><p>They arrived with the power of the whole city.</p><br/><p>The Abbey Dean’s green robe slightly moved and then his figure disappeared.</p><br/><p>And the next moment, a mark fell down, hitting the ground and cracking the stone slates.</p><br/><p>The air on the street was being torn apart.</p><br/><p>The Abbey Dean returned to the street and stood on the snow.</p><br/><p>A wound appeared on his left leg.</p><br/><p>He lowered his head to look at the wound and it suddenly healed and stopped bleeding.</p><br/><p>Numerous marks rushed over to him.</p><br/><p>He had to display the Limitless State and then he disappeared.</p><br/><p>The marks that Ning Que had created, carrying Chang’an’s aura, pulled him out of the interlayer of the Qi of Heaven and Earth.</p><br/><p>The Abbey Dean had to continually disappear and reappear.</p><br/><p>He reappeared at the entrances of alleys, in the markets, and in front of buildings.</p><br/><p>And every time he reappeared, he had a new wound.</p><br/><p>He had been the strongest man in Haotian Taoism over the past thousand years, as well as in the present word. However, facing the power of Chang’an, he could only defend passively.</p><br/><p>Ning Que wanted to know if he could be omnipotent in Chang’an. At least for now he could.</p><br/><p>The Abbey Dean was pulled out of the Limitless State once again.</p><br/><p>He had a small wound on the end of his eyebrow, which looked like a river that had been cut off, with blood dripping down from the slit.</p><br/><p>He stared at the end of the street, straightening his face.</p><br/><p>He raised his palm, erasing his face from forehead to chin, as if he could erase his face like the trick of changing faces in the Kingdom of Song.</p><br/><p>Then he put his palm down, leaving the blood on his face. He did not try to heal the wound, but just covered it with a thick frost.</p><br/><p>A chill aura enveloped his body.</p><br/><p>Another mark approached nearby along with the wind and snow.</p><br/><p>As the wind blew, he waved his sleeves. His body bulged out numerous times its normal size in an instant against the wind and was about to break through the sky.</p><br/><p>However, he still stood on the street and looked as normal as anyone else.</p><br/><p>An aura as vast and boundless as the ocean was being emitted from his body.</p><br/><p>Then, Ning Que’s podao marks arrived.</p><br/><p>And so did the city of Chang’an.</p><br/><p>The Qi of Heaven and Earth that was wildly flowing sounded like people crying inside the wind and snow on Vermilion Bird Avenue.</p><br/><p>In the space of a moment, he had been attacked by dozens of marks.</p><br/><p>Every mark was above the Five States, carrying a power that could destroy mountains and rivers.</p><br/><p>However, the Abbey Dean was in the Quietus State and had been removed from his senses, emotions, feelings, and fear.</p><br/><p>Ning Que’s Talisman of “Yi” with the power of the God-stunning Array, which was above the Five States, was like the tsunamis in the Sea of Storm in the Kingdom of Song.</p><br/><p>However, the Abbey Dean at this time was in the Boundless State and was like a vast sea, both physically and psychically.</p><br/><p>Even the strongest weapon could not hurt a man who felt no pain.</p><br/><p>Even the most massive wave could not last for long once it returned to the ocean.</p><br/><p>The Quietus State and the Boundless State.</p><br/><p>The Abbey Dean used two states above the Five States at the same time and unified them perfectly.</p><br/><p>The wind and snow calmed down once again.</p><br/><p>The Abbey Dean continued moving forward.</p><br/><p>The marks only left small wounds on him.</p><br/><p>They cut off his eyelashes and tore up his clothes and shoes.</p><br/><p>But they could not hurt him any more than that.</p><br/><p>Ning Que looked at him approaching and said, “You are only a flying ant.”</p>\n</div>"}