{"title": "Chapter 783 - Frozen (Part I)", "id": 783, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-783-frozen-part-i", "volume_title": "Volume 8", "body": "<h1>Chapter 783 - Frozen (Part I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Thunder boomed above the Vermilion Bird Avenue.</p><br/><p>The fists of the Abbey Dean and Ning Que clashed.</p><br/><p>Endless aura flowed out of their bodies and shot to all directions. Wherever the aura touched, all the bricks, rocks and pillars were destroyed, and all the houses alongside the street fell into ruins.</p><br/><p>Ning Que’s fist, with unbelievably overwhelming power, smashed onto the center of the Abbey Dean’s palm.</p><br/><p>He was like a bridge connecting Chang’an City and the Abbey Dean. The raging Qi of Heaven and Earth in his bones, blood and flesh were flowing out, making him nearly exhausted.</p><br/><p>He was in severe pain and his joints were cracking. His eyelashes had been burnt, and his body couldn’t stop shaking. Blood kept dripping off the corner of his lips and fell on the snow.</p><br/><p>Yet he was smiling.</p><br/><p>Three fingers of the Abbey Dean’s had been snapped. The fracture surface was as smooth as jade, but after the sudden snap blood was oozing out of the surface, and soon blood burst out of the three fingers and fell on the snow.</p><br/><p>But the smile on his face stayed still, and had yet to fade.</p><br/><p>Then a snowflake floated over him and narrowly missed his eyelashes.</p><br/><p>His black pupils started fading slowly.</p><br/><p>In other words, the white snowflake running into his pupil was darkening.</p><br/><p>It turned grey.</p><br/><p>The Abbey Dean’s eyes turned as grey as the mist on the abyss. It was the second time his eyes turned grey this day, and the second time he used the secret skill of Haotian Taoism, the Grey Eyes.</p><br/><p>The Grey Eyes was a scary and evil secret skill because it was created to suck the Psyche Power and spirit of other cultivators.</p><br/><p>Long ago Prince Long Qing learned the unique skill from the “Sha” Handscroll from the Tomes of the Arcane, to later absorb the great power of Halfman Taoist. That was how he grew from a good-for-nothing into a powerhouse on the Wilderness.</p><br/><p>The Grey Eyes of the Abbey Dean was thousands of times more powerful than that of Long Qing’s, and when facing the Grey Eyes of his which were like dark and deep dead wells, a powerful man as Yu Lian would feel anger and anxiety.</p><br/><p>Then what could Ning Que do?</p><br/><p>The scary suction of the Abbey Dean was like the power of a dark vortex. Ning Que felt it, and he was feeling the wind blowing in his face. He was expressionless and remained peaceful as before.</p><br/><p>He didn’t do anything, because the Abbey Dean’s Grey eye carried little weight on him. His Psyche Power and the Great Spirit stayed still peacefully inside.</p><br/><p>The Abbey Dean couldn’t take any aura from him, not even a single breath.</p><br/><p>The Abbey Dean’s eyebrows rose.</p><br/><p>Ning Que took a deep breath and his chest rose like the war flag fluttering in the strong breeze.</p><br/><p>The freezing wind and snow had all been sucked in his lungs.</p><br/><p>The blood spurting out of the Abbey Dean’s snapped fingers turned into blood fog, and was soon sucked into Ning Que’s mouth.</p><br/><p>There were blood stains on the corner of his lips, some of which were his own, and others were of the Abbey Dean’s.</p><br/><p>The whole picture looked extremely strange.</p><br/><p>While he had the whole Chang’an City supporting him, Ning Que clearly knew that he was no match for the Abbey Dean. He didn’t expect himself to win the fight when it started; his only hope was to fix the God-stunning Array.</p><br/><p>So, he walked on the streets and alleys, but finally, the Abbey Dean found him. Being the case, he waved the sword and cut the talisman runes on the distant Snow Street to keep the enemy ten kilometers away.</p><br/><p>Such action was a clear evidence of his fear which was too obvious to be ignored by the Abbey Dean. That was why the Abbey Dean approached Ning Que step by step, with a peaceful smile on his face.</p><br/><p>But actually, that was exactly what Ning Que needed.</p><br/><p>He had no chance to beat the Abbey Dean if they took Heaven and Earth as the battleground. On the contrary, if he could get close enough to the Abbey Dean, he might be able to find the frail hope to win out of desperation.</p><br/><p>Because he was good at melee fighting, since his body was awfully powerful and hard as rocks after he joined the Devil. Moreover, he had the array eye pestle in his hand, and he had seen the whole fight between the Abbey Dean and the Third Sister near Yanming Lake in the morning.</p><br/><p>While the Grey Eyes was a secret skill of the Haotian Taoism, Ning Que knew it well enough because he had fought Long Qing outside Red Lotus Temple, and because the Grey Eyes was born out of the Practice of Taotie of the Devil’s Doctrine.</p><br/><p>The Practice of Taotie had been long lost, and after Lotus’ death, there was just one person in the world who knew the Practice of Taotie. The person was Ning Que, and only Ye Hongyu and Sangsang knew about this.</p><br/><p>So he had given the Abbey Dean the opportunity, waiting for him to approach.</p><br/><p>He was nervous and expectant when he saw the Abbey Dean getting closer.</p><br/><p>Then, upon seeing the Abbey Dean’s eyes turn grey, Ning Que became excited and joyful.</p><br/><p>The Grey Eyes carried little weight on him, and once he started using the Practice of Taotie, he was like the legendary monster, Tao Tie, swallowing everything before him like crazy.</p><br/><p>The cold wind carrying snow, and the blood fog went in his mouth.</p><br/><p>He was like a monster chewing flesh and drinking blood. He was sucking the blood, the Psyche Power and even the spirit of the Abbey Dean like crazy; he had even forgotten to breath.</p><br/><p>A light reddish channel appeared between Ning Que and the Abbey Dean. His vigorous Psyche Power and spirit drained up soon and flowed into his body.</p><br/><p>Ning Que flushed like a drunk man, and his cheeks were like the rosy sky in the morning.</p><br/><p>His eyes were as bright as a golden pond, ready to swallow the figure of the Abbey Dean.</p><br/><p>He clearly felt that an aura pure as water kept pouring into his Snow Mountain and Ocean of Qi, purifying his body.</p><br/><p>He was aware that it was the Abbey Dean’s life essence aura.</p><br/><p>The Practice of Taotie was far more powerful than the Grey Eyes, and as long it had been conducted, there was no way back.</p><br/><p>Ning Que looked at the Abbey Dean who was close to him, and then he smiled.</p><br/><p>It seemed that his minuscule chance to win was coming true.</p><br/><p>But moments later, his smile was frozen.</p><br/><p>Because the Abbey Dean was still smiling.</p><br/><p>His spirit and Psyche Power were draining up at a scary speed, but he was still smiling.</p><br/><p>His eyes were no longer grey; they turned peaceful and were slightly mocking.</p><br/><p>His smile remained peaceful, like he had read all the stories in the world.</p><br/><p>Suddenly Ning Que felt how the aura which felt like water had turned chilly like ice.</p><br/><p>The change was not only mental but also physical.</p><br/><p>The aura which purified his Snow Mountain and Ocean of Qi like water suddenly turned as chilly as ice. And now it had become countless ice shards and snow flakes, filling every inch of his body.</p><br/><p>It was not because the aura he sucked inside from the Abbey Dean had changed.</p><br/><p>It was because another unexpected aura of the Abbey Dean had been sucked inside him.</p><br/><p>An aura of absolute quietus.</p><br/><p>Heat was generated by motion.</p><br/><p>Coldness meant the intensity of motion decreased.</p><br/><p>So, quietus would bring absolute coldness.</p><br/><p>Ning Que knew that he was wrong upon seeing the Abbey Dean.</p><br/><p>Any fighting skills would turn useless if the power of one side surpassed the other one too much. He was using the Practice of Taotie to counter the Grey Eyes, but it wouldn’t work as long as the Abbey Dean sent him a small piece of Quietus beyond the Five States.</p><br/><p>His body turned stiff and cold all of a sudden, unable to move.</p><br/><p>Snow fell on his face, but it seemed as if it would never melt.</p><br/><p>His sense of perception started to freeze.</p><br/><p>And his inside world turned into a world of coldness and quietus.</p><br/><p>His heart was connected to Chang’an City, but still he had no way to escape away from the quietus world.</p><br/><p>Even the whole city of Chang’an was frozen.</p>\n</div>"}