{"title": "Chapter 798 - Killed by the Mortal (Part One)", "id": 798, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-798-killed-by-the-mortal-part-one", "volume_title": "Volume 8", "body": "<h1>Chapter 798 - Killed by the Mortal (Part One)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>While screaming sharply, the Abbey Dean made his way to Ning Que, leaving bloody footprints on the streets behind.</p><br/><p>Yu Lian hacked and broke the rainbow bridge, and Eldest Brother dragged him by his foot so he couldn’t get away from Chang’an City. He had no other choice but to take the strike of the cutlass Ning Que borrowed from thousands of spirits.</p><br/><p>He was as miserable as a criminal executed by a body-dismembering death. Blood coated him but his bones were revealed and looked scary. However, he still believed that he could take that strike.</p><br/><p>He was flying and floating like an immortal, only this was a white boned one.</p><br/><p>One of his fingers pointed at the edge of the cutlass.</p><br/><p>He looked solemn, like a sovereign from the Kingdom of God strutting in the mortal world.</p><br/><p>Then, the aura around him suddenly turned sharp.</p><br/><p>A breath of aura flowed from his fingertip to the edge of the cutlass, colder than the abyss and lonelier than death. Shorter than a breath, the edge of the cutlass had been frosted.</p><br/><p>What a formidable aura of Quietus!</p><br/><p>The Vermilion Bird chirped with fury, and breathed out endless flames to resist the Quietus aura.</p><br/><p>The tip of the cutlass was colder than ice, giving out a bloodcurdling Quietus aura; however, its hilt held in Ning Que’s right hand was sending burning flames.</p><br/><p>The two opposite auras clashed on the unadorned cutlass. The confrontation was so risky that nobody knew if the cutlass would be destroyed by the frost or if it would burn out all the Quietus in the mortal world.</p><br/><p>At the moment, something suddenly clanged in the whirlwind brought out by the cutlass. It sounded like metal clanging, then it grew noisier and noisier.</p><br/><p>The cutlass wind blew over the street and hummed in the streets and alleys, rolling up countless things including pots thrown on the streets, broken gongs, flutes, and some other instruments.</p><br/><p>Rocks hit on the gongs, and iron pots were thrown onto the wall. The wind blew the flute like moaning. In the dim wind, the orchestration was bustling, as if some family on the street were having a wedding ceremony or a funeral.</p><br/><p>As the clanging started, the snow and frost coating the cutlass tip melted fast. The Vermilion Bird on the cutlass breathed out fire, together with the edge of the sword, heading right at the Abbey Dean.</p><br/><p>The Quietus had been conquered by the bustling of the mortal world.</p><br/><p>The iron cutlass brought with it a crazy wind, turning the Vermilion Avenue into the storming sea in the east of the Kingdom of Song.</p><br/><p>The Abbey Dean’s aura of Quietus had been conquered. His dark robe fluttered in the storm.</p><br/><p>The Abbey Dean rose in the air suddenly and looked as if he had grown many times bigger.</p><br/><p>An aura as vast as the ocean appeared on the snowy street.</p><br/><p>Again, the Abbey Dean used the Boundless State of the Buddhism Sect.</p><br/><p>The pain he suffered made it clear to him that the Boundless State was far from enough to resist the cutlass in Ning Que’s hand because it was also thousands of cutlasses strong.</p><br/><p>So he used the Divine Demon Realm which was the top-secret skill from the Devil’s Doctrine. Yu Lian and the Abbey Dean were the only two people in the world who could use it. The skill reinforced the cultivator’s body to be tougher than iron. Moreover, it would create a new world, yet a fake one.</p><br/><p>What would happen when the Boundless of the Buddhism Sect and the Divine Demon Realm of the Devil’s Doctrine were harnessed at the same time?</p><br/><p>Ning Que arrived at the shore of the East Sea, standing at the seawall which stretched endlessly.</p><br/><p>The seawall of the East Sea in the Kingdom of Song was well-known. He looked at the huge variform rocks under his feet, and looked at the boundless ocean outside the seawall, silent.</p><br/><p>Storms came from the remote sea and stirred the nearby seawater like ink, giving out a chilling aura. The far off sea water rolled up giant waves measuring ten stories high.</p><br/><p>Ning Que didn’t wield the cutlass to cut down the enormous waves.</p><br/><p>Beucase the Abbey Dean was not the storm, the storm was brought out by its iron cutlass.</p><br/><p>The Abbey Dean was the ocean which would never be destroyed no matter how intense the storm was.</p><br/><p>The screeching of the Vermilion Bird resounded in the dim sky.</p><br/><p>The little red bird was carrying a small stone with its mouth. It flew against the storm and into the ocean depths, in spite of the violent storm and rain.</p><br/><p>It became a black spot in the sky.</p><br/><p>It threw the small stone in its mouth into the sea.</p><br/><p>The stone was swallowed instantly when falling into the rampaging ocean, without producing any noticeable spray.</p><br/><p>But the Vermilion Bird was not disappointed at all. It chirped and flapped to the shore to pick up another stone, then it flew against the storm and into the depths of the sea.</p><br/><p>It shuttled between the dim sky and the rampaging ocean, again and again.</p><br/><p>There was a mountain behind the sea wall which now had collapsed by more than half.</p><br/><p>People at the foot of the hill were hammering the hard stone into small pieces so that the Vermilion Bird could carry them with its beak.</p><br/><p>There were countless people hammering stone there.</p><br/><p>Many of them came from Tile Mountain. For years they had carved the broken pieces of the collapsed Buddha figure into smaller figures and sold them to the tourists to earn money. That was the thing they were good at.</p><br/><p>That was the thing that human beings were good at.</p><br/><p>Human beings were good at excavating mountains and smashing all the hardness in the world.</p><br/><p>The low hammering sound kept ringing behind the sea wall for days and nights. People were exhausted but they insisted, and the Vermilion Bird kept flying between the land and the sea.</p><br/><p>The Vermilion Bird had thrown countless small stones into the sea.</p><br/><p>They were filling up the sea.</p><br/><p>The sea was boundless, but if they kept throwing stones in it, they believed that someday the sea would be filled up.</p><br/><p>The Boundless would be conquered by the limitless of the morta world.</p><br/><p>The Abbey Dean turned into a deserted wild land.</p><br/><p>Rain had been pouring for half a year and it was said that the rain was Haotian’s punishment. Whoever disrespected Haotian would die in the horrible catastrophe.</p><br/><p>To avoid the flood, one had to escape from the Wilderness covered by knee-high grass and muddy marshes everywhere. The Wilderness might look safe but it was full of hidden risks and even the most brutal beasts wouldn’t dare to go there carelessly.</p><br/><p>Being here alone at the border of the Wilderness, the first person hesitated because there were no roads on the Wilderness and he didn’t know the correct way to walk on the Wilderness.</p><br/><p>More and more people gathered in the Wilderness. They wanted to negotiate the vast land, reaching a new world, but just like the first one who had arrived here, they didn’t know where the road was.</p><br/><p>They discussed for a long time and even quarrelled over it, yet still no one had any ideas about it.</p><br/><p>“Please let me through.”</p><br/><p>A young man squeezed out of the crowd and walked into the Wilderness.</p><br/><p>His luggage was simple, and what really worked for him might be the slightly rusty chopper in his hand. What made others be concerned was the skinny little girl he carried on his back.</p><br/><p>People tried to talk him out of the journey because the Wilderness was dangerous; most importantly, there was no road.</p><br/><p>The young man ignored them and kept walking towards the Wilderness, holding the chopper in his hand tighter.</p><br/><p>The crowd remained silent for a long time as they saw the young man disappearing in the grass on the Wilderness.</p><br/><p>Somebody in the crowd fastened his backpack, following the young man and walking into the Wilderness.</p><br/><p>Someone else took a tree branch as his walking stick and followed.</p><br/><p>More and more people walked into the Wilderness.</p><br/><p>Some of them were killed by the snakes in the swamp; some were drowned in the mire; some became the dried corpses buried in the running sand; but most of the travelers made their way out of the vast land and entered the new world.</p><br/><p>‘The world had no roads to begin with, but when many men pass one way, a road is made.”</p><br/><p>The Divine Demon Realm was conquered by the persistence of the mortal world.</p><br/><p>The Abbey Dean used three states at once.</p><br/><p>The Quietus of Haotian Taoism; the Boundless of the Buddhism Sect; the Divine Demon Realm of the Devil’s Doctrine.</p><br/><p>All three were beyond the Five States.</p><br/><p>Ning Que clearly hacked and cut.</p><br/><p>And he devastated all of the three.</p><br/><p>The Abbey Dean’s finger was still pulling against the edge of the cutlass.</p><br/><p>The frost and snow on the cutlass had been long gone, so had the cutlass’ aura and the blazing flame.</p><br/><p>Many small yet bloody wounds appeared on the Abbey Dean’s fingers.</p><br/><p>Ten more miserable wounds appeared on his body.</p><br/><p>Some of his flesh had been blown away, and other parts were exposed to the dim wind.</p><br/><p>Blood flowed down all over his body like waterfall.</p><br/><p>He looked miserable.</p><br/><p>Too miserable to survive.</p><br/><p>But the Abbey Dean was still alive.</p><br/><p>He was the most powerful man in Haotian Taoism for the past millenium; he wouldn’t die so easily.</p><br/><p>He was one step closer to death, or to the Kingdom of Haotian.</p><br/><p>Everything would come to an end if he couldn’t resist the thousands of cutlasses in Ning Que’s hand.</p><br/><p>He had been such a proud man in his whole life; seldom had he felt the fear of death.</p><br/><p>Except for the time when he was defeated by Ke Haoran’s sword.</p><br/><p>The other time, when he was clubbed by the Headmaster.</p><br/><p>Yet still he had survived both, and he had even made progress in cultivation.</p><br/><p>For a disillusioned powerhouse like the Abbey Dean, the great fear of death was a rare opportunity to receive his Tao Enlightenment.</p><br/><p>He was facing Ning Que’s cutlass today, and once again he saw the abyss between life and death. What else could he read from it this time?</p><br/><p>The Abbey Dean stared at Ning Que with a strange expression on his face.</p><br/><p>Not the expression of light regret; not anger, nor a feeling of reluctance.</p><br/><p>The expression was out of the human range. He looked so peaceful and dispassionate that he seemed empty and emotionless inside.</p><br/><p>An expression without emotion was no expression at all.</p><br/><p>But Ning Que felt it was something he should be wary of.</p><br/><p>His eyes were expressionless; even his pupils were fading out.</p><br/><p>They were not like how they turned when using the Grey Eyes; they were literally colorless.</p><br/><p>His eyeballs were almost transparent. They were no longer jade-like, but more like tasteless water.</p><br/><p>Then he suddenly drew back his fingers.</p><br/><p>And Ning Que’s iron cutlass fell down.</p><br/><p>The wind started howling before the blade arrived.</p><br/><p>Black hair fluttered in the air, and blood dripped in the wind.</p><br/><p>The flesh and blood falling off him were like scarlet flower petals.</p><br/><p>His bones were like white roots of lotuses.</p><br/><p>The bloody scene now looked sad but beautiful.</p><br/><p>He turned into a lotus.</p><br/><p>The blood couldn’t stain him, and the dirt couldn’t cover him.</p><br/><p>He was the purest.</p><br/><p>The purest of all.</p><br/><p>Broken rainbow shards fell down from the sky and finally fell on the street.</p><br/><p>Several pieces fell on the Abbey Dean and shone like gold and jade, then they slid off.</p><br/><p>Those broken rainbow pieces were remnants from the Haotian Initiation’s aura. For some unknown reasons they were now unable to merge with the Abbey Dean’s flesh and blood.</p><br/><p>The Abbey Dean seemed to have lost his connection with Haotian. He seemed to have disappeared in the world, and became floating snowflakes. He was so independent, and untouchable like never before.</p><br/><p>Yu Lian raised her eyebrows when she saw the scene.</p><br/><p>Eldest Brother said with disbelief, “State of Pureness?”</p></div>\n</div>"}