{"title": "Chapter 793 - If Heaven Cannot Accept Me", "id": 793, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-793-if-heaven-cannot-accept-me", "volume_title": "Volume 8", "body": "<h1>Chapter 793 - If Heaven Cannot Accept Me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The impassioned, loud and hot-blooded declaration suddenly turned into loud swearing. Old Master Chao cursed at the Abbey Dean and smashed his cane at the man.</p><br/><p>Ordinary people and extraordinary people were all human beings. They would all turn into ash after death. But there was still a largedifference while they were alive. No way could the old man’s cane knock down the Abbey Dean.</p><br/><p>The people on the snowy street thought that Old Master Chao was dead, but he did not die because the Abbey Dean did not do anything. Instead, he walked past the old man calmly.</p><br/><p>Eldest Brother faintly guessed the intention of the Abbey Dean. Haotian Taoism wanted to break into Chang’an and the hearts of the people in the city. The Abbey Dean had killed many on the streets because he wanted to break the hardest of the Tangs with his strongest means. He wanted to stomp their pride into the mud. However, since killing them could not solve the problem, he then chose to ignore them.</p><br/><p>However, the Abbey Dean did not understand the Tangs. Old Master Chao had just skittered by the fine line separating life and death. He was not confused by the Abbey Dean’s disregard, but instead, started to feel suspicious and even fearful.</p><br/><p>It was fine even if he failed to knock down the man. There would be opportunities to do so in the future. It was fine even if he did not die; not dying was better than dying after all. Was there any reason to start feeling self-doubt? Old Master Chao leaned against his cane and cursed colorfully as he walked to the street side. His cursing was violent, and his words, filthier than the filth on the snowy ground.</p><br/><p>The Abbey Dean frowned slightly and continued forward. He walked towards Ning Que, and closer to the Imperial Palace.</p><br/><p>Eldest Brother said, “This is wrong.”</p><br/><p>The Abbey Dean replied, “The Tang Empire might be strong, but what can you do if the Heavens want it to fall?”</p><br/><p>In front of the Verdant Canyon.</p><br/><p>Ye Hongyu looked at Jun Mo who was standing across her. Blood flowed down her sleeves, dripping onto the ground and mixing with the odors of the blood that had been building up over the past days.</p><br/><p>She was very calm because she knew that Jun Mo was more seriously injured than herself. He was burning up the last of his Psyche Power and life force, inching closer to death.</p><br/><p>She looked at Jun Mo’s expressionless face and at the bloodied disciples of the Academy behind him. She thought of the terrifying fights before the Verdant Canyon over the past week. She thought of how the people before her had blocked the path of the powerful Divine Hall Coalition Army, and stopped them from entering the Southern parts of Tang Empire.</p><br/><p>People like Jun Mo would fight hard to the very end. And even she could not help but feel moved. Traces of pity and admiration could be seen in the Divine Light inside the deepest part of her eyes.</p><br/><p>“The Heavens want your Academy to fall. What can you do about it?”</p><br/><p>She looked at Jun Mo and said.</p><br/><p>Jun Mo looked up at the sky. The rain had stopped but the clouds had not fully parted yet. Only a few spots of the blue sky could be seen. It was like shattered porcelain.</p><br/><p>Furthermore, even if the rain were to stop and the clouds were to dissipate, it was daytime now, so he would not be able to see the moon. He was only looking at his teacher before he died in that fight.</p><br/><p>He did not answer Ye Hongyu’s question directly. Instead, he said, “Chao Xiaoshu is a good man. If there had not been any incidents back then, he would have been my Younger Brother.”</p><br/><p>Ye Hongyu knew who Chao Xiaoshu was. However, she did not understand why Jun Mo would mention him now.</p><br/><p>Jun Mo looked at the sky and sought for the traces left behind by the moon seven nights ago. He continued, “However, he wanted to follow the previous Emperor, which was why he did not enter the Academy.”</p><br/><p>“Back then, the previous Emperor wanted to clear the Royal Court, which was how the night at Spring Breeze Pavilion happened.”</p><br/><p>Ye Hongyu knew of the incident at the Pavilion. Chao Xiaoshu and Ning Que had become known to the West-Hill Divine Palace after that rainy night.</p><br/><p>Jun Mo looked away. He then said, “Before that night, Chao Xiaoshu negotiated with the opposition at the House of Red Sleeves. There, he said two things that later spread throughout Chang’an.”</p><br/><p>“This was what he said.”</p><br/><p>Jun Mo said, “If Heaven allows, I will live. If people won’t allow that, I will kill them.”</p><br/><p>Ye Hongyu suddenly felt cold because she knew what he would say next.</p><br/><p>Even though the world was fighting against the Tang Empire now and Haotian Taoism was at odds with the Empire, she had not expected such a question raised up by someone so calmly and with such determination in Haotian’s world.</p><br/><p>Sure enough, Jun Mo gently shook his right arm, and blood sprinkled off the wide and square iron sword.</p><br/><p>He held the iron sword and looked at Ye Hongyu. It looked as if he was looking at the sky above her head as he said, “I always thought that this statement wasn’t appropriate. Because even if the Heavens would not allow me, I will still live.”</p><br/><p>“And if this bloodied Heaven won’t allow me to live, then… I will now allow it to live either.”</p><br/><p>Finally, he said, “At least, I won’t let it live in peace.”</p><br/><p>On the snowy street in Chang’an.</p><br/><p>Eldest Brother looked at the Abbey Dean and said, “Teacher once said that where the human heart desires to go, Heaven would allow it.”</p><br/><p>“And should Heaven not allow it, what would you do?”</p><br/><p>The Abbey Dean stopped and looked at the snow falling from the sky. After a moment of silence, he said thoughtfully, “You can look up and see, when has Heaven ever spared anyone?”</p><br/><p>There was a moment of silence. Nobody spoke because no one could answer his question.</p><br/><p>In the face of absolute strength, courage was admired, but it was useless. In the indifferent eyes of Heaven, the desires of human beings rarely mattered.</p><br/><p>The skinny Taoist fell silent, so did the Old Lady Chu and the injured. The dead could no longer speak, and even second uncle Chao stayed silent, though his lips had hesitated for a moment.</p><br/><p>Finally, a voice broke the silence.</p><br/><p>The voice was hoarse and dry. The person seemed not to have drunk water in a long while and had lost too much blood. The voice sounded rather grating.</p><br/><p>The voice seemed weary and weak but was determined. It was grating, unlike the sound of something sharp scratching against glass, but like the sound of mirrors being broken.</p><br/><p>The voice said, “Then we shall destroy it.”</p><br/><p>The Abbey Dean looked to the back of the crowd and spotted Ning Que’s face which was covered in blood.</p><br/><p>Then, he saw Ning Que’s eyes.</p><br/><p>Their gazes met for the first time.</p><br/><p>Ning Que looked at him and said, “Where the heart desires, Heaven has to obey. And if Heaven does not, then we will destroy it. I think this is a very simple principle.”</p><br/><p>The Abbey Dean looked at the determination and confidence in his eyes. His eyebrows rose upwards..</p><br/><p>The Natural Stream Magical Finger had injured Ning Que gravely, and his confidence had taken a hit. However, his spirit was determined. But then, he gradually felt lost.</p><br/><p>He watched as the two teens cried and shouted while they tried something unimaginable. As such, he decided to stand up and then, he did.</p><br/><p>But he could only lean against the podao which was supporting his weakened body.</p><br/><p>Then, several ordinary people rushed by him, rushing towards the black sea of death.</p><br/><p>He saw many people die before his eyes.</p><br/><p>He felt that it was wrong.</p><br/><p>The choices that these ordinary people had made went against the knowledge he had of this world. It went against his own rules. Even though he had seen many similar instances, what he saw today assaulted him with a shock that he could not bear.</p><br/><p>Because in the past, he had always placed himself outside the situation.</p><br/><p>Today, on this street, he was in the situation.</p><br/><p>His body and soul followed the spraying of blood and the fall of those bodies. They followed as those souls departed and gently landed in this world.</p><br/><p>In the past, he was willing to die for Chang’an because he felt responsible and emotionally-linked to the city. It was because of the responsibility and kinship he felt for the Headmaster, Master Yan Se and the Emperor. He was sure it was not because of zealousness.</p><br/><p>He thought that his blood was cold. When the blood in his body began to grow heated until it was boiling, he started to feel lost and confused.</p><br/><p>He vaguely felt a power.</p><br/><p>He had seen this power, and it had happened more than once.</p><br/><p>But it had not felt as real as it did right now on the snowy street.</p><br/><p>It was then, when a wizened voice rang in his ears and his heart.</p><br/><p>He did not know that it was second uncle Chao speaking.</p><br/><p>The wizened voice rang across the Tang Empire. His subconscious seemed to follow the voice, traveling across rivers and mountains. And everywhere, he saw different people.</p><br/><p>He saw those at war, marching in troops, fighting for their lives, seeking death. Those holding on, and those who were waiting. Even those waiting were filled with bravery.</p><br/><p>He saw many people who were impressive.</p><br/><p>Then, he saw many images flashing across his eyes.</p><br/><p>He saw the bloodied chopper in the woodshed, the broken fields in Hebei county. He saw refugees that looked like ghosts and the wide Min Mountain. He saw the Old Hunter, the soil of the City of Wei. He saw the lights in the night of Chang’an and the lake in the Wilderness. He saw the grave covered in weeds at the Lanke Temple.</p><br/><p>He saw many people who were not impressive, but they were all humans.</p><br/><p>He seemed to have returned to the Lanke Temple’s stone statue; as if he were still in the final conversation with Lotus in the Bone Mountain at the front gate of the Devil’s Doctrine. He seemed to be looking at the Talisman Master in the tribe he met that summer when he entered Talisman Taoism.</p><br/><p>The earliest humans fought with wild beasts in the wilderness. They began to wear furs, eat meat, live in caves, and then began to farm land, raise livestock, and eat more meat. Humans continued to eat meat, and think a lot of ways to cook meat to ensure that the meat was very fragrant. This was so they could eat more meat because eating meat made one stronger.</p><br/><p>He saw human beings building houses, villages and roads, and finally saw a majestic city standing on the plains, seeming to pierce the sky—it was Chang’an City.</p><br/><p>He walked through Chang’an and saw the bun shop that he had seen a few days ago. He saw the green stones, and recalled the aura he had once sensed. It was the power that belonged only to the mortal realm.</p><br/><p>It was a power that could change everything.</p><br/><p>It was a power that could beat time.</p><br/><p>It was an ordinary power that was extraordinary. It was blinding but inconspicuous. It was the hot steam of the bun shop or a black brick in the city wall. But it was also the passing on of wisdom and stubborn resistance.</p><br/><p>Ning Que suddenly felt very moved.</p><br/><p>This power was so magnificent.</p><br/><p>He was so close to it and could feel such an unvarnished feeling.</p><br/><p>He could feel his smallness, but it was unlike when he was facing Haotian. He did not feel angry because of his own smallness, but only felt a sense of awe.</p><br/><p>Because no matter how small he was, he was a part of this power.</p><br/><p>And no matter how magnificent this power was, it came from several insignificant people like him.</p></div>\n</div>"}