{"title": "Chapter 796 - To Write in the Sky", "id": 796, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-796-to-write-in-the-sky", "volume_title": "Volume 8", "body": "<h1>Chapter 796 - To Write in the Sky</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ning Que said “I may kill you” instead of “I’ll kill you”, which might sound euphemistic. But being cautious and calm actually indicated that he was really eager to do it.</p><br/><p>That was the eagerness of all residents in Chang’an as well as Ning Que. He wanted it, so he said it out sincerely like he was summoning or making requests.</p><br/><p>A clear and loud screeching resounded at the south of the long street as if something had been summoned.</p><br/><p>The storm and wind on the Vermilion Street had stopped, but the snow had yet to melt.</p><br/><p>The painting of the Vermilion Bird which had stunned Ning Que and Sangsang in the rainy spring that year was now buried deep in the snow, frozen, and deprived of its vividness.</p><br/><p>The paint of the Vermilion Bird was the killing Talisman of the God-stunning Array, and was of unbelievable spirit. When running by itself, it could strike as powerfully as a powerhouse at the Peak of the Knowing Destiny State.</p><br/><p>One thousand years ago, the Headmaster carved it by himself in the south of the Vermilion Street to protect the great capital city. Countless haunting evil spirits had been burnt into ashes by the Vermilion Bird in the darkness of the night.</p><br/><p>The Vermilion Bird knew that the Abbey Dean had entered the city, and was about to show itself to fight. But the Abbey Dean stepped on one of its wings with just one foot and it could barely move anymore.</p><br/><p>The Vermilion Bird felt fear because it had sensed the gap between the Abbey Dean and itself, therefore, it bent its proud neck in awe and buried itself in the snow, feeling ashamed to be seen by others.</p><br/><p>At that moment a voice reached into the depths of its soul, saying that he wanted to kill the Abbey Dean, and he might need its help.</p><br/><p>The Vermilion Bird knew who the speaker was. But it couldn’t believe that there was still someone who could kill the powerful Abbey Dean since the Headmaster had left the mortal world. Therefore, it stayed timid.</p><br/><p>However, the voice echoed deepest part of its soul. It rubbed and burned it like surging lava, till its blood started to burn.</p><br/><p>It turned from timid to ashamed, but its courage was coming back. The melting snow was blown away by wind, revealing the eyes of the bird.</p><br/><p>A magnificent aura rose on the street.</p><br/><p>The Vermilion Bird’s wings had broken away from the snow and green stone, showing itself in the sky.</p><br/><p>With a clear and loud screeching, its whole body took off from the ground and soared.</p><br/><p>Nobody knew for how many years the Vermilion Bird had kept silent.</p><br/><p>And they wondered if its screeching today could stun the Gods.</p><br/><p>The Vermilion Bird spread its hundred-foot wings and arrived at the southern gate of Chang’an in an instant.</p><br/><p>The city wall towered up to Heaven and the black bricks were almost antique.</p><br/><p>The Vermilion Bird was flying beside the city wall.</p><br/><p>Its red wings constantly flapped and dragged two flaming tails behind. It narrowly missed the city wall and flew so fast that it reached the north of the city in the shortest time.</p><br/><p>Then it reached the Imperial Palace.</p><br/><p>The Empress held the little Emperor’s hand. She was staring into the sky, her body slightly bowed.</p><br/><p>At the turret in the Imperial City, Yu Lian raised her eyebrows.</p><br/><p>The Vermilion Bird flew across the Imperial City. It lowered down the altitude, flying right towards south along the Vermilion Street.</p><br/><p>Its path ahead was the straightest and broadest one in the world.</p><br/><p>The Vermilion Bird flew swiftly on the street. Its wings spreading a hundred feet and looked as if it was about to light the whole city up on fire. Wherever it touched, the melting snow evaporated immediately.</p><br/><p>It was so fast that no one on the street had the time to react.</p><br/><p>They heard a clear screeching and saw a firing figure arrive instantly.</p><br/><p>They barely had any time to consider, neither did the Abbey Dean.</p><br/><p>He smirked when he saw the Vermilion Bird arriving on the long street.</p><br/><p>It was unusual for him to show emotions like ordinary people. But for some reason that even he himself couldn’t understand, he couldn’t help mocking and feeling contempt for that legendary bird.</p><br/><p>Maybe that was because the Vermilion Bird was the only thing the Headmaster had left in the mortal world.</p><br/><p>When it reached the snowy street with two wings fully spread, the flare was burning the air, bringing out a cracking sound.</p><br/><p>The whole world seemed as if it was gradually becoming red.</p><br/><p>The Tangs were filled with anticipation that the Vermilion Bird could kill the Abbey Dean. And when the Abbey Dean reached out his hand to tear off the bird’s flaring wings, it screeched again.</p><br/><p>A spark flashed.</p><br/><p>Silently, the Vermilion Bird withdrew its sounds and power, then it turned into a breath of fire, falling on the cutlass held in Ning Que’s hand.</p><br/><p>It sounded like searing iron slightly burning.</p><br/><p>Several burn marks emerged on Ning Que’s cutlass, along with a unique pattern.</p><br/><p>A red flaring bird.</p><br/><p>Ning Que’s cutlass was the combination of the three cutlasses that had accompanied him for many years. Like the Primordial Thirteen Arrows, they were the fruit of the wisdom of the Academy, with unimaginable strength and weight.</p><br/><p>Only the cutlass tough like this one could bear the great power inside his body. However, as his cultivation state reached new heights, this cutlass or the other three ones, along with the Primordial Thirteen Arrows and the countless talisman papers, could no longer meet his needs like they used to. And sometimes they even became his disadvantages.</p><br/><p>Ning Que was a fighter. And he clearly knew what trouble the unbalance between his own power and his weapon could bring, but still, he didn’t give the cutlass away. Somehow he knew that the cutlass just belonged to him, and someday in the future, it would show its real edge.</p><br/><p>Even when the cutlass came out of the smelter, he turned down Forth Brother and Sixth Brother’s suggestion to carve talismans on the cutlass to reinforce it like other cultivators or he himself used to do.</p><br/><p>Because at that time, Ning Que was not confident in talismans written by himself; to write them on the cutlass would do no better than ruin it. Not even when he could write Divine Talisman now; he felt it far from enough.</p><br/><p>He had no other reason. He simply felt that the talisman qualified to be written on the cutlass should be extraordinary.</p><br/><p>Thus, the iron cutlass remained dim with no lines or talismans on it. Blood constantly washed it, but the heavy and broad cutlass remained simple and unadorned.</p><br/><p>Till today when the clear screeching came from the south of Chang’an City, the Vermilion Bird flew across the sky and turned into a breath of fire. Finally, it rested on the black cutlass, becoming the red pattern.</p><br/><p>Ning Que finally understood what he had been waiting for.</p><br/><p>He finally understood why the Vermilion Bird came to see him before the Headmaster left the mortal world.</p><br/><p>The cutlass had to be matched with an extraordinary talisman.</p><br/><p>The talisman was the Vermilion Bird.</p><br/><p>It was also the killing talisman in the God-stunning Array.</p><br/><p>The cutlass had been pulled out of the snow.</p><br/><p>The snow fell off when Ning Que raised it up.</p><br/><p>The Vermilion Bird Divine Talisman on the black cutlass suddenly lighted up.</p><br/><p>Red fire erupted out of the blade and into the sky.</p><br/><p>Now that the storm and snow ceased, countless pairs of eyes saw the blue sky revealing itself.</p><br/><p>The fire that erupted out of the cutlass stretched more than ten miles. And as Ning Que moved the cutlass, it moved to all directions in the blue and polished sky.</p><br/><p>The moving fire left burning marks on the blue sky, as if someone had written roughly in the sky with a pen as giant as a mountain.</p><br/><p>One stroke stretched half of the sky, and nobody knew how long it was exactly.</p><br/><p>As Ning Que lowered down the cutlass, the fire erupted followed to move downwards, and that was the beginning of the second stroke.</p><br/><p>At the turret in the Imperial City.</p><br/><p>Yu Lian looked up at the sky, silent. She was watching the fire moving between heaven and earth.</p><br/><p>Then she glanced at the cutlass in her hand.</p><br/><p>It was a large scarlet cutlass, two times longer and broader than herself.</p><br/><p>The scarlet cutlass was the Halidom of the Devil’s Doctrine. It had been kept by Tang Xiaotang since the Desolate moved south.</p><br/><p>It was natural that Yu Lian could wield the cutlass since she was the Grandmaster of the Devil’s Doctrine.</p><br/><p>When the Abbey Dean was stepping forward on the snowy street, she came to the Imperial Palace for nothing but the cutlass.</p><br/><p>Judging by the appearance, the scarlet cutlass in her hand was definitely more frightening and awesome than the one in Ning Que’s hand.</p><br/><p>But she knew that something about this cutlass had been missing when compared with the one in Ning Que’s hand.</p><br/><p>Ning Que could write with the cutlass.</p><br/><p>“You’ve finally written down that character.”</p><br/><p>Yu Lian saw the character in the blue sky coming into shape, and she suddenly took a deep breath.</p><br/><p>As she breathed, the melting snow around the palace floated off the ground.</p><br/><p>The ice in the moat cracked into pieces.</p><br/><p>Endless air went flooding into her petite body as she breathed.</p><br/><p>Her chest was slightly going up and down.</p><br/><p>Her eyes grew brighter and brighter.</p><br/><p>Everyone on the snowy street was looking at the sky.</p><br/><p>Everyone in Chang’an was looking at the sky.</p><br/><p>People watched the giant flaring pen writing in the blue sky.</p><br/><p>Eldest Brother was also looking up at the sky.</p><br/><p>There was no snow falling but his eyes were slightly wet.</p><br/><p>He looked at the sky and thought to himself, “Teacher, Youngest Brother has finally finished writing that character.”</p><br/><p>Then he took a deep breath.</p><br/><p>Nothing changed on the snowy street.</p><br/><p>Even the fallen leaves on the melting snow hadn’t shivered at all as he breathed.</p><br/><p>His eyes grew brighter and brighter.</p><br/><p>Blood kept oozing out of his cotton jacket.</p><br/><p>Before the Pamir Mountains, the wooden dipper cracked.</p><br/><p>The wooden rod was held in his hand.</p><br/><p>He didn’t know where he had put the old book.</p><br/><p>The belt on his cotton jacket was free from things held by it, or worries.</p><br/><p>Therefore, it started to flutter, leaving afterimages behind.</p><br/><p>Ning Que looked at the Abbey Dean and hacked.</p><br/><p>The cutlass in his hand had to fall on the Abbey Dean.</p><br/><p>So he had to hack accurately.</p><br/><p>Ning Que’s and the Abbey Dean’s eyes met in the middle of the street.</p><br/><p>He saw nothing but peace in the Abbey Dean’s eyes.</p><br/><p>Even the snowflakes floating in the air turned peaceful.</p><br/><p>The light squeezing sound made by piled snow became low.</p><br/><p>The fleeting time slowed down.</p><br/><p>The Abbey Dean’s voice echoed in his sense of perception.</p><br/><p>“You wrote in the wrong order.”</p><br/><p>Yet Ning Que didn’t worry at all.</p><br/><p>Because nobody could manipulate time, except Buddha.</p><br/><p>The Abbey Dean couldn’t do it, either. He was slowing down time with great power, but he himself was also inside slowed-down time, which meant that the cutlass would eventually cut him no matter how slowly it had been wielded.</p><br/><p>He said to the Abbey Dean, “The order of the stroke was wrong, but the character is right.”</p><br/><p>The Abbey Dean’s voice went off for a moment and came back again.</p><br/><p>His voice was sentimental, full of complicated emotions.</p><br/><p>“Nice calligraphy.”</p></div>\n</div>"}