{"title": "Chapter 803 - Coming Home (Part II)", "id": 803, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-803-coming-home-part-ii", "volume_title": "Volume 9", "body": "<h1>Chapter 803 - Coming Home (Part II)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Mu You entered the room, holding a basin of hot water in her hands. She was surprised when she found Ning Que was inside the room, but she had no time to catch up before she served the Second Brother to clean up.</p><br/><p>“It is so inconvenient to clean up and get dressed,” said Jun Mo.</p><br/><p>“Seventh Sister will help you.” Ning Que answered.</p><br/><p>“It’s not the same. There are always some inconvenient things.”</p><br/><p>Ning Que smiled and said, “After you get married, everything will be convenient.”</p><br/><p>No one was talking while only the waterfall was beating down. Mu You lowered her head and felt embarrassed. Jun Mo coughed and asked, “What else can I do for you?”</p><br/><p>Feeling the embarrassment, Ning Que stopped smiling and said, “Actually, I have something to tell you.”</p><br/><p>Jun Mo said, “Besides Eldest Brother and Yu Lian, only you can understand me, which means you did well in cultivation. Maybe your state is still unstable, but it will be fine.”</p><br/><p>“That is not what I am going to talk about.”</p><br/><p>Ning Que clapped and shouted, “Hey, you two, come in.”</p><br/><p>Two young men entered the room, walking with sticks. Both of them were nervous—the one in expansive clothes looked around slyly, playing cool and tough; the other one in simple clothes kept his head down, trembling, and may have been unable to walk if he was alone.</p><br/><p>Ning Que said to Second Brother, “They did well during the fight against the Abbey Dean. Judging from their recovery, they have a pretty good physical condition. I just don’t know if they have potential.”</p><br/><p>“You want them to enter the Academy, don’t you?” asked Jun Mo.</p><br/><p>Ning Que answered, “If you are available, you can take one as your disciple and leave me the other one. But you have to teach them for a while because I am out of time.”</p><br/><p>Jun Mo said, “Senior Brother has yet to name a successor.”</p><br/><p>Ning Que said, “If he’s willing, I’ll find him one.”</p><br/><p>The two teenagers were Zhang III and Li IV, who had been taught a lesson by their families after the battle. Thanks to their bad injuries, they hadn’t been beaten and Li IV’s family hadn’t returned to their hometown. They had been living in Zhang III’s house until the Chang’an Local Government took them to the Academy today.</p><br/><p>The two teenagers had no idea about what had happened. They entered the Academy dazedly, then stepped directly onto the real Academy.</p><br/><p>For the Tangs, the Academy was the most honorable place, but it wasn’t mysterious. On the other hand, the back of the Academy’s mountain was a totally different world, and every detail made it seem like a fairyland.</p><br/><p>Entering the small courtyard where the sounds of the waterfall were echoing, and hearing the conversation between Ning Que and Jun Mo, they were aware of the lucky chance they had met and became more nervous. Even Zhang Nianzu didn’t dare to look around, praying silently.</p><br/><p>Ning Que continued, “I know they should be tested, but I really like them and I am concerned about whether they have no potential like me.”</p><br/><p>Jun Mo answered, “If you can cultivate, they certainly can. No one can’t be taught if the Academy wants to. If you want to keep them, then do it.”</p><br/><p>Ning Que said a few words to the young ones before he left. The Seventh Sister sent him out and seemed to come across someone outside the gate.</p><br/><p>The two teenagers were in a state of shock and happiness and were unable to notice Ning Que’s departure. They were both staring at the man standing in front of them and waiting.</p><br/><p>At this moment, the big white goose strode into the yard, familiarly came to the house. After clumsily stepping over the high threshold, it sat beside Jun Mo’s feet and began reposing.</p><br/><p>It was hurt when the Hierarch came to the Academy and hadn’t recovered yet, so it was too listless to notice that there were two strangers in their yard.</p><br/><p>Even so, the two teenagers were still startled by the big white goose who acted like a human.</p><br/><p>“The first thing you should learn is how to be calm.”</p><br/><p>Jun Mo said to them, “Go and stand in the courtyard, no crutches, no bending. Stay awake until the next morning, then you pass.”</p><br/><p>Ning Que was nearly pecked by the big white goose when they ran into each other. He angrily said, “Senior Sister, after you become the hostess of this yard, you should be strict with the big white goose. It is spoiled. I am disabled and it still dared to bite me.”</p><br/><p>Mu You, who had been nervous, didn’t know how to respond when hearing this. She asked in a low voice, “Did you already know this?”</p><br/><p>Ning Que answered with a smile, “We are not blind.”</p><br/><p>Mu You twisted her handkerchief and whispered, “He started it.”</p><br/><p>Ning Que said, “None of us will bother about it since Teacher is gone.”</p><br/><p>Mu You asked cautiously, “He would not disagree, would he?”</p><br/><p>Looking toward the bright moon in the night, Ning Que was somehow pissed off and said, “Who knows what kind of bullshit he would say.”</p><br/><p>“What is bullshit?”</p><br/><p>“That is… the shit of a bull.”</p><br/><p>“Why would he like to say bullshit?”</p><br/><p>“Because… he used to be close to the old yellow bull?”</p><br/><p>“Youngest Brother, you are talking nonsense again.”</p><br/><p>“Anyway, he was unreliable.”</p><br/><p>“Hmm, he indeed had been a little unreliable.”</p><br/><p>Mu You looked at the bright moon and smiled.</p><br/><p>Then she turned to Ning Que and said, “Thank you.”</p><br/><p>She knew that Ning Que took the two teenagers to the Academy as a way to distract his Senior Brother.</p><br/><p>That was what she thanked him for.</p><br/><p>Ning Que smiled back and said nothing.</p><br/><p>The mountain behind the Academy was so huge that everyone could build their own small courtyard, which was either near the lake or near the mountain, including Tang Xiaotang. Since Song Qian and Eighth Brother liked to always play Go games under the pine tree while the scholar had been living in the library cavern, their houses were usually empty.</p><br/><p>Because of Sangsang, Ning Que had been the only one who didn’t live in the mountain. He mostly lived in the Old Brush Pen Shop or in the house near Yanming Lake, and occasionally slept over in the mountain, but his house was always kept.</p><br/><p>He walked slowly along the mountain path with his crutch, heading to his own yard in the dark night.</p><br/><p>Sangsang was gone. The house near Yanming Lake had been ruined and the walls of the Old Brush Pen Shop had been destroyed. He had no reason to go back. The yard in the mountain would probably be his home in the future.</p><br/><p>It was located behind the dense forest where Beigong and Ximen used to play music. It was near the lake, quiet and secluded in the night.</p><br/><p>Someone was waiting for him in the room.</p><br/><p>Leaning against the mud wall, Tang Xiaotang kicked it sometimes, lowering her head and looking at her old small leather boots.</p><br/><p>Ning Que looked at her beautiful but sad face and asked, “What do you want to know?”</p><br/><p>Tang Xiaotang looked up and asked, “Is Sangsang really dead?”</p><br/><p>Sangsang had few good friends, but she was one of them.</p><br/><p>Thinking of this, Ning Que suddenly felt pain somewhere in his body.</p><br/><p>“Few people mentioned Sangsang in front of me since I came back. They probably felt sorry, like my Senior Brothers and Sisters, but most of them have forgotten her.</p><br/><p>“And yes, she is dead.”</p><br/><p>He said peacefully, as if he were describing a common thing.</p><br/><p>Although that made it even more sorrowful.</p><br/><p>Tang Xiaotang said, “She really was Haotian’s daughter.”</p><br/><p>After a moment of silence, Ning Que answered, “Or you could say, she was Haotian.”</p><br/><p>He thought of the traces left by Haotian in the God-stunning Array, the traces of Sangsang passing by in Chang’an, their home and past. He suddenly laughed and said, “I raised Haotian and married her. Am I legendary?”</p><br/><p>Tang Xiaotang suddenly felt sorry for him and she did not know how to comfort him.</p><br/><p>Because she felt sorry for herself as well.</p><br/><p>Ning Que looked at her and said, “I know what you want to ask. Pipi has taken the Abbey Dean back to the Zhishou Abbey. I want to say, I owe him a lot. I owe him my life. If he needs me someday, I will try my best do do it.”</p><br/><p>Tang Xiaotang found her answer and said, “Thank you, Youngest Uncle.”</p><br/><p>They embraced in the chilly moonlight and gave each other warmth and courage.</p><br/><p>Ning Que once believed he owed nothing to the world and was owed by it instead, until he lived in the City of Wei, then as he came to Chang’an and entered the Academy, he found he owed many people.</p><br/><p>He owed Chen Pipi his life and he owed Mo Shanshan for her love.</p><br/><p>Mo Shanshan didn’t live in the Academy. She preferred the hotel in Chang’an.</p><br/><p>She came for the Academy and the Tang Empire from the Great River Kingdom, leaving her sect behind.</p><br/><p>Ning Que didn’t know how to face her.</p><br/><p>They had something, but they didn’t know what they should do.</p><br/><p>Not all men and women were like his Second Brother and Seventh Sister.</p><br/><p>Like him, who had a wife, but still slept alone.</p><br/><p>He hoped everything would pass after a sleep, but he was unable to fall asleep.</p><br/><p>He looked at the bright moon in the night.</p><br/><p>When they left the City of Wei, the stars were as cold and white as today.</p><br/><p>The wounds made by the Abbey Dean suddenly became more painful, as his heart.</p></div>\n</div>"}