{"title": "Chapter 807 - Broken Bows, Broken Knives, and Broken Dreams", "id": 807, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-807-broken-bows-broken-knives-and-broken-dreams", "volume_title": "Volume 9", "body": "<h1>Chapter 807 - Broken Bows, Broken Knives, and Broken Dreams</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ning Que held onto his walking stick and looked at Hua Shanyue. He leaned half of his weight on the walking stick. His posture made him seem earnest in his gaze toward Hua Shanyue, almost as if he would look through him.</p><br/><p>Hua Shanyue felt a little pain between his eyebrows. He felt like Ning Que’s eyes were like two sharp knives. So he leaned over to one side, holding Xiao Man’s hand.</p><br/><p>As he leaned, he opened the view of the night sky for others. But in doing so, he blocked Li Yu’s sight.</p><br/><p>Earlier when he said there were 30 Shenhou crossbows in the night, he wasn’t lying. As Hua Shanyue turned his body, a shrill sound suddenly pierced the quiet courtyard.</p><br/><p>Snowflakes were pulverized as dozens of arrows were shot from the trees next to the wall, pointing at Ning Que on the terrace.</p><br/><p>There wasn’t much snow falling in the courtyard, but now it seemed to accumulate more and more. There was a strange force on the snow, causing sharp lines to appear in it.</p><br/><p>After crossing the snow, the sharp arrowhead from the crossbow was like a head cut in half by a sharp knife. It was broken and fell. Then the crossbow arrow broke piece by piece. It was scattered in the air.</p><br/><p>There were dozens of arrows. They couldn’t cross the snowstorm outside. They shattered into countless broken pieces. The snow scattered the pieces everywhere, like dead branches falling from a tree.</p><br/><p>The fragments of the arrow fell on the snow and made a loud noise. The people inside and outside the terrace were shocked by this scene until they came to after hearing the sound.</p><br/><p>There were two loud sounds. Many of the Tang Army soldiers shouted as they drew the swords. They swung their swords toward Ning Que’s head.</p><br/><p>Ning Que leaned on his walking stick. He didn’t even look at the swords. He just kept looking at Hua Shanyue, quietly.</p><br/><p>The pain between Hua Shanyue’s eyebrows kept getting worse and worse. His body and soul were both cold.</p><br/><p>Before the Tang Army’s swords could reach Ning Que’s side, they fell down. The swords were cut in half by a sharp noise. Then the hands holding the swords were also cut.</p><br/><p>Two distinct cut marks appeared on their chests and abdomens. The blood slowly came out of the cuts. The cuts gradually opened wider and wider. It was a horrible sight.</p><br/><p>Even though Ning Que didn’t have a sword, he still made the two cuts on the Tang soldiers’ bodies. And even though the cuts were on their front sides, they felt the pain on their backs. The capes worn by the Tang soldiers were all torn in two and fell to the ground.</p><br/><p>The cut halves of the capes rolled up as they hit the ground. Blood streaks were visible. It looked like a river of blood. The Tang soldiers couldn’t stand anymore and fell to their knees in the river of blood.</p><br/><p>Hua Shanyue’s pupils were contracted to pinpoints, yet still looked calm. He asked Ning Que, “Is this the word?”</p><br/><p>Ning Que looked at him, still holding onto his walking stick. He didn’t say a word. Then he straightened his posture slowly and loosened the horizontal piece of wood from the bottom of his walking stick. He looked as though he was preparing to draw a sword or write something.</p><br/><p>These two scenes showed the power gap between the two sides. Everyone could see Ning Que’s actions and guess what he would do next.</p><br/><p>Just then, Chao Xiaoshu grabbed Ning Que’s shoulder.</p><br/><p>Ning Que wanted an explanation.</p><br/><p>Chao Xiaoshu looked at the Tang Army on the ground and asked, “Did you just come back from the front lines?”</p><br/><p>It was very quiet on the terrace. Nobody answered his question because nobody knew why he would ask this question.</p><br/><p>Ning Que knew Chao Xiaoshu was talking to himself. He looked at the dew on the fallen Tang soldiers’ faces, remaining silent. His right hand grabbed his walking stick again, putting his weight on it.</p><br/><p>He looked at Hua Shanyue and said, “Whatever you’re thinking, it’s wishful thinking.”</p><br/><p>Hua Shanyue looked at his subordinates lying on the ground in their own blood. He was silent for awhile. Then he took his right hand back from covering Xiao Man’s eyes. Hua Shanyue said to Ning Que, “Thinking sometimes can be a ridiculous thing. You can kill me, but you cannot stop me from thinking.”</p><br/><p>When he said these things, he went through a myriad of facial expressions: regret, self-deprication, unwillingness. He wanted to help Li Yu escape Chang’an, so he made a careful plan. However, who could’ve guessed two guests of this caliber would come in this kind of weather to disrupt the calm where the Princess lived?</p><br/><p>The Princess’ house had been quiet for a long time. But tonight, it came alive again. The Bodyguard office and Chang’an Local Government sent a lot of people to the house. The front of the house was lit by many torches. People gathered on both sides of the street. They looked and judged all movements and sounds. They all said bad things. Only gossip and judgement.</p><br/><p>The fight was tense. The Tang people were still in the front lines, but the nobles within the city of Chang’an were still causing so many problems. Nobody would show sympathy to the losers.</p><br/><p>Hua Shanyue and over fifty Tang soldiers from the Gushan Commandery had their weapons taken away. They were then removed from the Princess’ Palace. The jail cells were waiting for them. As for what their ultimate punishment would be, nobody knew.</p><br/><p>In hindsight, this rescue seemed to be wishful thinking. It seemed fair to say these people were out of their minds going on a mission like this. But in actuality, Hua Shanyue deserved to be called a leader of the Tang Army. He wasn’t as useless as he was shown to be. The plan he had made in advance was actually perfect.</p><br/><p>Just when he had returned to Chang’an, he started fighting thunderously. He planned every part. If he could just take Li Yu out of the Princess’ Palace, no City Patrol Department or Bodyguard office could stop them from leaving Chang’an. And if he really took Li Yu back to the Gushan Commandery, who knew what would come of the Tang Empire?</p><br/><p>Unfortunately, he had terrible luck. Nobody could have thought Chao Xiaoshu would go to see Li Yu. What’s more, Ning Que went to the Princess’ Palace with him.</p><br/><p>The noise and gossip in the street outside the palace did not affect the quiet inside it.</p><br/><p>Ning Que said to Chao Xiaoshu, “Do you still want to talk to her now?”</p><br/><p>After a few moments of silence, he said, “We’ve seen her, so there’s no need to talk.”</p><br/><p>“Then wait for me for a moment.”</p><br/><p>Ning Que said, “I’ve just thought of something I would like to discuss with her.”</p><br/><p>The terrace was quiet. The snow on the lake had gotten colder and thicker. Xiao Man was taken to bed by his servant. Tonight, he saw such a bloody scene. He didn’t know if he could fall asleep.</p><br/><p>Ning Que put down his walking stick. It was a little difficult to sit at his desk. He reached out his hand to take the cold tea in front of Li Yu. He took two sips to soothe his throat and said, “Actually, I really don’t want to call you a fool.”</p><br/><p>Li Yu looked at the tea and asked, “Are you tired of calling me a fool?”</p><br/><p>Ning Que replied, “Stay in this garden quietly. Though the scenery is dull, it’s still better than death. You should understand this. Why can’t you give up fighting?”</p><br/><p>“I’ve said it before: Between dying of old age or being killed, I prefer the latter. And Hua Shanyue showed no regard to his own life in trying to save mine. What else can I do? How could I tell you this?”</p><br/><p>Li Yu looked at him and said sarcastically, “In the imperial study that night, you told me I would see your coldness eventually. Then you killed Hun Yuan in the palace. Will you now continue to show your coldness? If you want to kill me, you better be direct with it. Don’t use excuses like calling me a fool.”</p><br/><p>Ning Que said, “I want to call you a fool not because of what happened tonight, but because you still seemed confident that I wouldn’t kill you.”</p><br/><p>Li Yu said, “If you really wanted to kill me, you wouldn’t stay here and say these things to me.”</p><br/><p>Ning Que shook his head and said, “It would be very simple to kill you. Not killing you is the hard part. But this kind of trouble is not what you’re thinking.”</p><br/><p>Li Yu kept her gaze on Ning Que, but she didn’t say anything.</p><br/><p>Ning Que looked at her beautiful face as if he had seen the maid holding Xiao Man listening to a fairy tale by the bonfire many years ago and said, “It seems that you have figured out many things lately.”</p><br/><p>Li Yu kept her silence.</p><br/><p>Ning Que continued, “There is nothing of value worth holding on to in this world. Whether it be Xiao Man’s birth, or your influence from your time in the grassland, neither will affect the decision the Empress and I have made.”</p><br/><p>Li Yu stared at his eyes, her hands shaking in her sleeves. She knew Ning Que could read her thoughts and reasoning. She didn’t expect for him to remain so calm after finding these things out.</p><br/><p>Now the whole world was fighting the Tang Empire, except for the West-Hill Divine Palace. Only the Golden Palace’s cavalry moving their way southward could threaten the Tang Empire. If they wanted to completely shut down this threat from the north, Xiao Man’s birth and her influence in the golden tent seemed to be of importance.</p><br/><p>Because of these reasons, she knew the Academy and the imperial court would keep her.</p><br/><p>“Actually, you’re not wrong. But the Academy and the imperial court wouldn’t likely do that. Especially when I found out you wanted to keep these as bargaining chips.”</p><br/><p>Ning Que looked at her and said, “I can still eat a pig, if the butcher who slaughtered the pig is dead. If the Headmaster is gone, the Academy is still strong enough on its own. They are without enemies. I already had a plan for the vast Wilderness of the Golden Palace. It would be better if I had your help. But if not, I could still get the final victory.”</p><br/><p>Li Yu looked at him with raised eyebrows and said, “Even if many people die?”</p><br/><p>Ning Que said, “As long as those who die are not Tang people.”</p><br/><p>Li Yu thought of some possibilities. She changed her expression slightly and sadly said, “It seems like the Tang Empire doesn’t need Xiao Man and me. Did you make a plan before the war started?”</p><br/><p>Ning Que never thought she could’ve guessed what he had done to the Golden Palace just from a few sentences. He said, “It looks like you are no fool in this respect.”</p><br/><p>Li Yu said wryly, “That means I’m still a fool in other respects.”</p><br/><p>Ning Que replied, “Yes.”</p><br/><p>The army left. The street in front of the Princess’ Palace eventually quieted down. The snow that had been trampled until it became muddy water could not return to its clean white look in a short time.</p><br/><p>Ning Que and Chao Xiaoshu were walking on the street. They stepped on the muddied snow, making a crunching sound beneath their feet.</p><br/><p>“Killing or not killing, you need to solve this problem eventually.” Chao Xiaoshu said, “After all, she’s the favorite daughter of the king. If we don’t have to kill her, it’s better not to kill her.”</p></div>\n</div>"}