{"title": "Chapter 800 - Laughing out Loud (Part I)", "id": 800, "volume": 8, "url": "http://boxnovel.org/nightfall-chapter-800-laughing-out-loud-part-i", "volume_title": "Volume 8", "body": "<h1>Chapter 800 - Laughing out Loud (Part I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The war against the Tang Empire had lasted for months. As the Abbey Dean had been chopped down by Ning Que, something had begun to change. Such changes could be accidental, but some of them were inevitable.</p><br/><p>On the Xiangwan Plain in the north, thousands from the Tang Army, who were fending off enemies, thought that they were doomed to die when they saw the dust rise from the south. It was the reinforcement they had been waiting for.</p><br/><p>The situation suddenly changed. Thousands of the Northern Army Cavalry rushed toward the Golden Palace Army like an avalanche, decapitating countless enemies with their cold blades.</p><br/><p>The war was over. The bloody meadow had refracted the sunshine red. Situ Yilan’s podao had been broken. She wiped the blood off her face and looked around the battlefield. Even though most of her subordinates had been killed, they finally won the battle.</p><br/><p>The Verdant Canyon in the south had already been in the most perilous moment. Holding the iron sword, Jun Mo looked exhausted like a mountain in the late autumn which was peaceful and beautiful but was covered with yellow leaves.</p><br/><p>The disciples of the Academy were all standing behind him. Looking at the dust rising up in the wilderness and hearing the sound of hooves, they were all in silence, waiting for the final moment.</p><br/><p>Mu You reached out and held Jun Mo’s empty sleeve.</p><br/><p>Fan Yue, who had been resisting the Abbey Dean’s Virtual Sword with the River and Mountain Sandbox, totteringly walked out of the iron tent at this moment.</p><br/><p>They were brothers and sisters and they were supposed to live together and die together.</p><br/><p>The Coalition Army of the West-Hill Palace had reached the front of the Verdant Canyon once again.</p><br/><p>In the past seven days, they had stopped the West-Hill Divine Palace Coalition Army multiple times. Both them and the coalition had been tired of this.</p><br/><p>This time should be different.</p><br/><p>And this charge should be the last one.</p><br/><p>At this moment, the Fourth Brother suddenly felt that the River and Mountain Sandbox in his hand became much lighter. Then he sensed that the Virtual Sword in the Sandbox had disappeared.</p><br/><p>People in front of the Verdant Canyon had no idea what had happened in Chang’an. However, there was only one possibility for the Abbey Dean’s Virtual Sword’s disappearance: the Abbey Dean had been killed or abolished.</p><br/><p>The Fourth Brother clearly knew about the preparation of the Academy in Chang’an and he also knew his brothers and sisters were trying their best to kill the Abbey Dean, but he never thought they could succeed.</p><br/><p>Because he was good at deduction and no matter how he deducted it before, he never figured out how they were able to kill the Abbey Dean.</p><br/><p>However, at this time, the Virtual Sword in the River and Mountain Sandbox had disappeared. Whether he believed or not, something must have happened in Chang’an.</p><br/><p>He hoarsely muttered, “The Abbey Dean has lost.”</p><br/><p>His voice was hoarse because he had suffered the Virtual Sword attack for days and also because he was uncontrollably excited and filled with disbelief.</p><br/><p>Everybody from the Academy heard him.</p><br/><p>Silence reigned.</p><br/><p>Suddenly, Jun Mo raised his iron sword and pointed at the wilderness, laughing loudly.</p><br/><p>Beigong Weiyang burst into laughter, plucking the strings wildly.</p><br/><p>Ximen Buhuo rolled in the aisles, slapping with his vertical bamboo flute.</p><br/><p>Sixth Brother grinned, clenching the hammer in his hand.</p><br/><p>Wang Chi cracked a smile. The faded flowers on his sideburns looked more colorful.</p><br/><p>Mu You was a lady, who didn’t need to be heroic. She didn’t laugh, but her eyes became misty.</p><br/><p>The Coalition Army of the West-Hill Palace had arrived in front of them.</p><br/><p>However, the disciples seemed not to see them at all. They were all in stitches.</p><br/><p>The laughter echoed through the Verdant Canyon and spread along the mountains.</p><br/><p>It didn’t matter if they lived or died after today, and whether they could keep the Verdant Canyon or not; as long as the Abbey Dean was defeated, Chang’an would be safe, and the Academy and the Tang Empire could keep the last hope.</p><br/><p>What they had protected with their lives in front of the Verdant Canyon for seven days was this hope.</p><br/><p>It was no longer a slim chance. It was within their grasp.</p><br/><p>More precisely, it was in Fourth Brother’s hands.</p><br/><p>Under his brothers and sister’s puzzled eyes, the Fourth Brother walked forward. Looking at the cavalry who surged as flowing molten iron and their sword light hiding in the sky, he lifted the River and Mountain Sandbox.</p><br/><p>Fourth Brother became extremely pale and his cheeks instantly became emaciated.</p><br/><p>He injected the River and Mountain Sandbox with all his Psyche Power.</p><br/><p>It was filled with fine grains of sand.</p><br/><p>There were rivers and mountains in the box and each sand represented a mountain peak or a bridge.</p><br/><p>The yellow sand billowed in front of the Verdant Canyon, covering the sky and darkening the wilderness.</p><br/><p>The West-Hill Divine Palace Cavalry entered the yellow sand and their eyes were blocked, losing their way.</p><br/><p>Screams rang out among the yellow sand, as well as the impacting sounds.</p><br/><p>A long time had passed, and the sand slowly rested.</p><br/><p>It calmed down in front of the Verdant Canyon where many bodies of soldiers and horses were revealed.</p><br/><p>The River and Mountain Sandbox could not change the fate of the Academy disciples.</p><br/><p>Since the Divine Hall Coalition Army restarted a charge after a small recuperation.</p><br/><p>At this moment, a Tang soldier walked out of the mountains.</p><br/><p>He looked embarrassed, dirty and was covered with mud, disarmed in torn clothes which had been cut into pieces when he passed through the mountains.</p><br/><p>He ran toward the disciples, totteringly and exhaustedly. Even so, he kept running while shouting.</p><br/><p>His voice sounded hoarse as if he had not drunk water for days, but in the disciples’ ears, it sounded as clear as a spring.</p><br/><p>“I’m Wang Wu, from the second group of the Southern Army Scouting Camp, under orders to support you!”</p><br/><p>After that, he could not stand and heavily fell down to the ground, out of breath and unable to stand up.</p><br/><p>Wang Chi walked by his side and quickly felt his pulse.</p><br/><p>Jun Mo solemnly bowed to the most common soldier and said, “Thank you.”</p><br/><p>An ordinary Tang soldier could not change anything, but for the Academy, his coming meant a lot.</p><br/><p>The Academy was the Tangs’ Academy.</p><br/><p>The Tang Empire was the Academy’s Tang Empire.</p><br/><p>No one was fighting alone.</p><br/><p>Then, another Tang soldier came out of the mountains.</p><br/><p>Then more and more Tang soldiers showed up in the wilderness.</p><br/><p>They supported each other and cheered for their companions.</p><br/><p>They were exhausted. Once they walked out of the Verdant Canyon, they fell down on the ground and could not get up any more. Even if they could lift their weapons, they were unable to fight.</p><br/><p>Some of them fell down and were never able to stand up anymore since they suddenly felt relief when they had gotten out of the mountains.</p><br/><p>For the well-trained Tang soldiers, it was unbelievable.</p><br/><p>More and more Tang soldiers reached the Verdant Canyon.</p><br/><p>They had been walking for days without rest and sleep before they finally reached here.</p><br/><p>The Southern Army had arrived, and that was enough.</p><br/><p>Even though they were a tired troop.</p><br/><p>No one dared to deny they were a mighty troop.</p><br/><p>At this time, a gong sound came from the south of the wilderness.</p><br/><p>The cavalrymen of the West-Hill Divine Palace Coalition Army looked at the Tang soldiers with complex emotions. Even though they were awed and grudging, they had to lift the reins, heading back to their camps.</p></div>\n</div>"}