{"title": "Chapter 818 - The Dilemma about Rage and Courage", "id": 818, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-818-the-dilemma-about-rage-and-courage", "volume_title": "Volume 9", "body": "<h1>Chapter 818 - The Dilemma about Rage and Courage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ning Que didn’t go back to the palace after he left Yanming Lake. He went to the Building of Pines and Cranes for a drink and to the Vermilion Street for a walk. He hadn’t drunk much or walked too far. Spring rain fell upon him gently on his head; his face and his clothes became slightly damp.</p><br/><p>The drink sped up his blood circulation; the walk eased his temper; the rain cleared his heart. Finally, he turned calm again and accepted the dramatic change of the world’s situation which made the Tangs and the Academy outrageous. Later he reached the Sanyuanli area.</p><br/><p>The neighborhood was preparing dinner. The smell of cooking oil in pans was mixed with the smell of damp wood burning. It smelled nice, making him even more calm.</p><br/><p>He was waiting beneath the stone steps in the yard. Soon, there was a creaking sound of the door opening and Second Brother came out, then the creaking sound kept echoing in the darkness of the night.</p><br/><p>Ning Que saluted to the one on the steps in the darkness, then he said, “The Drunkard and the Butcher must’ve had received Haotian’s promise that they could keep their self-existence eternal, so they pledged allegiance to Haotian as the price.”</p><br/><p>Jun Mo continued, “Their biggest fear was that they couldn’t make it through the second Everlasting Night.”</p><br/><p>Someone in the yard lifted a lantern high in the air, lighting up the street and dispelled the darkness, revealing two wheelchairs.</p><br/><p>Yu Lian said, “The Kingdom of Haotian is no place for self-awareness.”</p><br/><p>Jun Mo said, “No matter how wise a coward could be, he would never be a match for a brave man’s stupidity.”</p><br/><p>Eldest Brother didn’t join the discussion among his sisters and brothers. He stared at the night sky silently, and at the bright moon after the rain. It also seemed as if he were staring at the Kingdom of Haotian, from which nobody had come out of alive.</p><br/><p>Jun Mo looked at Ning Que and said, “Sometimes anger may bring courage, but most of the time it is meaningless.”</p><br/><p>Yu Lian looked at Ning Que and said, “We can go on with our conversation since you’ve calmed down.”</p><br/><p>Ning Que figured out what his brother and sister were talking about, so he asked, “How?”</p><br/><p>Yu Lian said, “Talk as you like.”</p><br/><p>Ning Que recalled that he had a similar conversation with the Queen, and his expression turned bitter.</p><br/><p>Eldest Brother turned away from the sky and looked at him with a smile. He said, “Youngest Brother, just try harder.”</p><br/><p>The main hall was so quiet that even the candle looked dim. All eunuchs and palace maids were standing far away, leaving only the Queen and Ning Que before the desk.</p><br/><p>The Queen looked at the yellow-covered envelopes on the desk, silent. Ning Que looked at the summary files sent by the West-Hill Divine Palace diplomatic corps; he was temporarily silent, too, but he knew he couldn’t keep silent forever.</p><br/><p>“Are there really cultivators who have lived through the Everlasting Night?”</p><br/><p>The Queen was asking Ning Que, feeling the notion so unbelievable.</p><br/><p>Ning Que thought it for a while, and said, “Every one thousand years, a sage would be born. The Drunkard and the Butcher, nobody knows how long they had been cultivating in the mortal world. Though the Drunkard didn’t make his power felt outside the city, I am sure that his power was beyond most people’s imagination. In other words, the mortal martial arts mean nothing to him.”</p><br/><p>The Queen frowned slightly and said, “Then who’s the more powerful one, the Drunkard or the Abbey Dean?”</p><br/><p>Ning Que said, “The Drunkard has a higher state, but I doubt he surpasses the Abbey Dean in power.”</p><br/><p>The Queen was puzzled and asked, “How so?”</p><br/><p>“The Drunkard and the Butcher have no choice but walk in the darkness for all these years, and their bodies and souls are all rotting. The Abbey Dean, however, has been walking in the light and reached the peak as the Headmaster left.”</p><br/><p>Ning Que said, “If one of the two enters Chang’an City someday, there’s 70 percent chance that I could kill him; if both of the two enter Chang’an together, there’s still 10 percent chance that I could kill both of them.”</p><br/><p>The Queen then said, “Ten percent chance is no different from no chance at all.”</p><br/><p>Ning Que said, “That works for other cultivators, except for the Drunkard and the Butcher who were so afraid of death. For them, ten percent chance equals 100 percent.”</p><br/><p>The Queen asked, “They are grand cultivators with such high states, why does death still haunt them?”</p><br/><p>“The Headmaster once pointed out that cultivation is all about time. The longer you live, the more powerful you’ll be, and the more fearful you’ll be of death. Immortality is the biggest temptation, and death is the greatest fear.”</p><br/><p>Ning Que continued, “The Drunkard and the Butcher are so typical, so they pledged allegiance to Haotian. Since then, they were banned from entering Chang’an City.”</p><br/><p>The Queen’s eyes started glowing, and she said, “How about outside the city?”</p><br/><p>“We can have a try if my Senior Brother and Sister were at their peak.”</p><br/><p>Ning Que remembered the flagon swinging in the spring breeze, then he nodded and said, “The problem now is that nobody could find the two, not to mention catching up with them.”</p><br/><p>The glow in the Queen’s eyes finally vanished, and she said, “You mean the Drunkard and the Butcher are like two swords hanging above the Tang’s, and they could fall down anytime.”</p><br/><p>Ning Que said, “And that is what the West-Hill Palace is threatening us with.”</p><br/><p>After glancing at the negotiation files on the desk, the Queen fell into a moment’s silence and said, “The Drunkard and the Butcher, the two should be a secret that nobody else should ever know.”</p><br/><p>Ning Que understood what she meant.</p><br/><p>The Tangs were in recovery from desperation, and they were regaining their confidence. The Tang army was in its best days. However hard the Southern Army was fighting, they refused to block the Verdant Canyon because they were saving it for the day to fight back.</p><br/><p>The Tangs would be frustrated being aware of the presence the Drunkard and the Butcher, and if they knew the hope was frail, the war would become an endless torture.</p><br/><p>Ning Que looked at the Queen in the eyes, and said, “How could the imperial court and the Academy explain this agreement with the West-Hill Divine Hall? People would definitely know that the Empire of Tang has ceded territory and paid war indemnity.”</p><br/><p>The Queen smiled and said, “Shame brings courage as well as anger. And if anger could be successfully released, courage would be the only thing left.”</p><br/><p>Ning Que found the Queen’s smile beautiful, but somehow chilling. How could they let the soldiers and people of Tang release all the anger brought by the shame?</p><br/><p>He wasn’t going to think further because he felt that he had already thought too much.</p><br/><p>“Ordinary Tang people would be none the wiser, but the ministers had to be informed because the Academy doesn’t want the imperial court to fall in chaos again. There was no better time than this moment, for them to hold the pressure for people because this is what people supported them for.”</p><br/><p>The Queen considered and agreed with him, then she knocked the golden bell on the desk.</p><br/><p>Soon the ten most important ministers gathered in the hall at night.</p><br/><p>They looked tired because it was already midnight. However, they were called urgently and feared that it was because the war at the Northern Frontier had started again or that there was a problem with the negotiations with the West-Hill Divine Palace. As such, they did not dare to dawdle.</p><br/><p>They had prepared for the worst in their minds, yet they still didn’t expect the news waiting for them in the palace was so bad that they were all muted. The hall was in total silence.</p><br/><p>“We can meet any requests of them other than…”</p><br/><p>The tired voice came from General Shu Cheng who had just come back to Chang’an.</p><br/><p>He looked grave because he knew the agreement would forever be a shame for the Empire, and every clause of it stung his heart like a thorn.</p><br/><p>Some of the requests could be met given the severe situation the Empire was faced with because it had no other choice; however, there was one single clause in the agreement that the Empire would never accept.</p><br/><p>He looked at the Queen and Ning Que. Word by word, he spoke it out, “Xingwan Plain shall never be ceded.”</p><br/><p>The West Expedition Army drew back from Pamir Mountain and merged into the Northern Army which was ruled by General Xu Chi, preparing for the possible war against the Golden Palace Cavalry in the spring. General Shu Cheng was now back in Chang’an and had given away the control of both the two armies to Xu Chi because Chang’an needed the protection of an important general now. General Shu Cheng was against the idea to cede Xiangwan Plain not because the army couldn’t take the shame; it was because Xiangwan Plain was important.</p><br/><p>Xiangwan Plain was in the south of Seven Stockaded Villages in the Northern Frontier. It was a vast grassland stretching several thousand miles, a place of abundant rain and proper landform to feed horses. It was the main birthplace of the Empire’s warhorses.</p><br/><p>Xiangwan Plain had been providing horses for thousands of years, which was an important reason why the Tang could stomp freely in the mortal world.</p><br/><p>In the requests of the agreement, one of the most important clauses was to ask the Empire to cede Xiangyuan Plain on behalf of the Golden Palace, which was also the clause the Empire would never agree on.</p><br/><p>Last autumn, the cavalry of Golden Palace invaded southwards like wolves, and the Tang Imperial Court was in chaos. The expedition cavalry following the Emperor was trapped in Helan City. The Seven Stockaded Villages were captured in succession because of the inadequate preparation of the Northern Army. Under the severe situation, General Xu Chi didn’t draw a single step back. The Northern Army had paid a heavy price and finally kept the Golden Palace Cavalry 100 miles away in the south of the Seven Stockaded Villages.</p><br/><p>Why had they done so? It was because the Empire couldn’t afford to lose Xiangwan Plain. It was a basis of the thousand-year prosperity of the Empire, and the foundation of Tang Army’s invincibility in the world, One could even say that the Plain was the Empire.</p><br/><p>The Golden Palace had been against the Empire for long, and it would grow more perilous if Xiangwan Plain was ceded, thus weakening the Empire day by day.</p><br/><p>A civilian minister in the hall asked in a confused tone, “The grassland is nothing compared to Dongshan County. We can rob horses from the Golden Palace if we want.”</p><br/><p>Even under such circumstances, the officials of Tang were still optimistic and assured.</p><br/><p>Shu Cheng said coldly, “The West-Hill Palace asked us to pay for the war-horses and cede Xiangyuan Plain. Robbing wouldn’t do any help if we had the finest armors but no mount in the future. Their requests are meant to kill us, and they won’t allow any accidents to happen. They are determined to destroy the foundation of our Tang Empire.”</p><br/><p>He was afraid that the Academy and the Queen knew little about the importance of Xiangyuan Plain, so he looked at Ning Que and said sternly, “Cede Xiangwan Plain to the Golden Palace, and the Empire will soon fall!”</p><br/><p>The Queen looked at Ning Que and said, “The restoration from ceding Xiangyuan Plain would cost more than a hundred years, and the West-Hill Palace made the request because they knew it clearly.”</p><br/><p>Ning Que stared at the files on the desk. It took him long to make the final decision.</p></div>\n</div>"}