{"title": "Chapter 825 - Her", "id": 825, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-825-her", "volume_title": "Volume 9", "body": "<h1>Chapter 825 - Her</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The Kingdom of God had been ruined, shaking the firmament. It cracked and a vast amount of white stones fell down through the gaps, crashing down to the ground.</p><br/><p>Countless fiery meteorites fell into the peaceful ocean, heating up the water. The ocean began surging and fogging up. Birds and fish died along with the undulation of the waves.</p><br/><p>There was an unusual meteorite amid the sky, which looked like a crystal. It fell into the snow sea in the north, drawing a bright arc through the sky.</p><br/><p>This place seemed like the Everlasting Night. There was only the high Snow-capped Peak under the dim starlight. It was so high that it seemed as if it would pierce through the Night Dome.</p><br/><p>The transparent stone flew from far away, drawing a bright line in the air and illuminating the gloomy sky for a second, and crashed into the Snow-capped Peak.</p><br/><p>With a booming sound, the thick snow was impacted, scattered in the air, and fell back down softly, revealing rocks. A deep dark hole could be faintly seen. It might have reached the depths of the mountain.</p><br/><p>The falling snow refilled the hole in a short time. The sound of the impact echoed, spread high into the sky and the dark sea on both sides of the snow mountain, and then vanished. The former peace of this world was restored.</p><br/><p>The world around the mountain was in complete silence, aside from the sound of the trees cracking. It took a while before the wind began roaring. A storm was coming.</p><br/><p>This was the northernmost part of the world. It was also the coldest and the darkest place. For tens of thousands of years, it had never rained. However, this rain had lasted for months and it seemed as if it would never stop.</p><br/><p>The heavy rain beat down and hit the snow packs over the Hot Sea, which created countless black holes that looked like entrances of ants nests. The ink-black sea rolled into various shapes that looked a little disgusting or like it had many fish in it.</p><br/><p>Meanwhile, as the snow fell, the mountain revealed its true color. It was dark black. Reflecting the snow and ice, it looked variegated.</p><br/><p>At some point, the heavy rain that had lasted for several months suddenly stopped. It stopped abruptly, looking just like it did the day it began to rain. The world around the mountain fell silent once again.</p><br/><p>A hurricane coming from the Night Dome blew the gloomy clouds away, revealing the stars and the new moon in the sky. The quiet dark sea was blown by the hurricane, causing it to surge. The snow covering the Hot Sea began misting up. All traces of the rainstorm were instantly erased.</p><br/><p>After the wind broke the peace, a great sound was heard.</p><br/><p>It was as if someone had opened a door between heaven and earth that had already rusted and had not been opened for tens of thousands of years. It sounded so heavy.</p><br/><p>The sound became louder and louder, echoing around and disturbing the snowy, icy world. The surface of the Hot Sea cracked. Some variable platyfish jumped out of the sea and were frozen instantly into transparent iced fish. A dozen cawing black crows came from the south and perched on the cold, frost-covered branches.</p><br/><p>They looked at the Snow-capped Peak where the sounds came from.</p><br/><p>The Snow-capped Peak was the farthest, coldest, and highest mountain in the world. After being washed for days, it looked like a rusty iron bar standing between heaven and earth.</p><br/><p>There was a black stone peak appearing amid the mountains that was enlarging at a visible speed, tearing and smashing the rocks of the mountain and making a grating sound.</p><br/><p>This horrible sound was not coming from opening a rusty door, but from breaking a rusty stick.</p><br/><p>It became more and more clear as the cracks enlarged. The speed of the peak falling backward became faster and faster.</p><br/><p>Finally, one day, the Snow-capped Peak broke in the middle. The upper half of the mountain fell into the black sea, creating earsplitting sounds.</p><br/><p>The whole world began shaking and the black sea began surging with high waves. The shells and sediment that had sunk to the bottom of the sea over the past tens of thousands of years were shaken out of the sea and scattered, then were swept away by the waves.</p><br/><p>10 days later, the tide in the Great River Kingdom suddenly rose. All the fishermen were surprised because they had no idea where this tide had come from on such a clear day.</p><br/><p>No one knew the waves had come from the farthest black sea. The sea and the remaining half of the mountain would never be able to know how much surprise and confusion they had brought to the world. At this moment, the Snow-capped Peak fell silent once again and only the moon and stars were illuminating its cross-section.</p><br/><p>The cross-section was not smooth, looking like a willow tree that had been broken by force. Sharp rocks bulged on the broken black cliff like it was a dangerous stone forest.</p><br/><p>But there was a white dot amid the black cliffs.</p><br/><p>It was a naked woman, who had very white skin. She looked so pure that neither the warm moonlight nor the cold starlight could leave any color on her body.</p><br/><p>She was sleeping with her eyes closed and even her eyelashes did not vibrate. She looked very ordinary or bland, but very young.</p><br/><p>Her body, on the other hand, was special—her skin looked like silk without any scars and her body was perfect and plump, which looked like a piece of jade or white steamed bread on a black plate under the moon and stars.</p><br/><p>Then, her eyelashes vibrated and she opened her eyes and looked around.</p><br/><p>She looked taller than average when she stood up and there was no discernable emotion in her eyes. There were just simply the purest black and white.</p><br/><p>She noticed a bright light on the cliffs, so she looked up. She saw a bright moon in the Night Dome—this was the picture that she dreamed about many years ago that she hated the most. She frowned and that made her more alive.</p><br/><p>The Snow-capped Peak was the highest point of the world. Even though it was broken, its top was still close to the Night Dome, which meant that it was close to the moon. And since she did not like the moon, she decided to leave.</p><br/><p>The cliffs were rocky. Even the best cultivator in the world could not get down them easily. However, that did not bother her. She just walked on her bare feet. Every one of her steps created a white lotus that supported her plump body.</p><br/><p>Beautiful white lotuses flowered amid the cliffs in a line, like a straight path, leading to the foot of the mountain. She walked on the flowers, floating down from the cliff.</p><br/><p>The crows flew nearby to welcome her return or her arrival, with unknown flowers and grass in their beaks, flying around her.</p><br/><p>They dropped the flowers and grass on her body then flew up into the sky, cawing. They had made her a blue robe embroidered with flowers.</p><br/><p>She was confused by the clothes. She loosened them but found them to still be a little tight, so she frowned.</p><br/><p>She stepped on the snow that covered the Hot Sea and found some variable platyfish frozen in the sea. She seemed to remember something and then she walked south.</p><br/><p>White lotuses were being born under her feet.</p><br/><p>She traveled thousands of feet in the first instant and 300 miles in the next two hours. It took her a whole day to reach the edge of the wilderness.</p><br/><p>She found that she was becoming slower and slower, and her aura was getting turbid. She tightly frowned, becoming a little angry.</p><br/><p>She was not used to this dirty world nor the slow speed. And what she was most not used to was how plump she had become, and she had not figured out why that was.</p><br/><p>She had been walking slowly, so she did not feel tired. When she finally arrived at the Wilderness, she saw weeds and some stinky tents.</p><br/><p>This was a small tribe of the Golden Palace. The people inside the tents had been dead for days and their bodies had been eaten up by animals.</p><br/><p>She glanced at the tents and knew everything that had happened here. The killer’s weapon had been a heavy iron cutlass and he was good at cutting throats.</p><br/><p>She frowned again because she remembered the iron cutlass. She also remembered the man who liked to cut throats like this because he said it was the best way to kill.</p><br/><p>She kept silent for a little while before she dropped it. As long as she killed that man, this memory in the human world would be erased and she would remember nothing.</p><br/><p>She felt a little hungry, so she searched the tents and found a dozen bags of kumiss. She drank up all of them, standing amid the bones. In her eyes, there was no difference between people and weeds, and there was also no difference between the bones and her clothes, so she did not feel any nausea.</p><br/><p>Moreover, she enjoyed drinking, and she really could drink.</p><br/><p>The kumiss had not changed her expression, but when she looked at her body, she revealed a look of disgust.</p><br/><p>Just then, the sounds of rapid hoofbeats and whistles came from outside. It was a little noisy. She listened quietly for a while before walking out of the tent.</p><br/><p>10 cavalrymen from the Golden Palace were approaching. Judging from their outfits, they had to be scouts.</p><br/><p>When the cavalrymen smelled the tents, they all drew the cutlasses from their waists and straightened their faces, pointed at her, and began shouting. However, she had no idea what they were saying.</p><br/><p>This was the first group of people that she had met in this world, so she decided to forgive them rather than punish them or kill them in anger.</p><br/><p>She went over to them with no expression on her face.</p></div>\n</div>"}