{"title": "Chapter 829 - For I So Loved the World(Part Two)", "id": 829, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-829-for-i-so-loved-the-worldpart-two", "volume_title": "Volume 9", "body": "<h1>Chapter 829 - For I So Loved the World(Part Two)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The ruffian was so excited that he didn’t notice the ice under his feet. He then slipped and fell down, with his knife cutting on the thigh of his companion, then the knife cut the bamboo supporting the stall.</p><br/><p>He fell down hard, and the knife was so sharp, cutting a large wound on the thigh of the companion. Blood flowed out wildly. The broken bamboo was shoved in the chest of another ruffian.</p><br/><p>The place was in a total mess. The three ruffians were all dead before people realized what had happened.</p><br/><p>One ruffian was soaked in his own blood, another one’s chest had been penetrated, and the one with the knife cut himself open in the mess, his intestines spilled all over the ground.</p><br/><p>The bloody image and the shocking change totally stunned the audience. They were all pale, including the father and daughter beside the noodle stall.</p><br/><p>“Cook noddles for me.”</p><br/><p>Sangsang said as she looked at the stall owner. Then she frowned as soon as she saw that there was no coriander or chili oil available. She immediately lost interest in eating noodles, so she left the stall with the horse.</p><br/><p>She was going to the hotcake seller at the opposite side of the street for hotcakes, but somehow she had changed her mind. At the same time, she heard people at the noddle stall discussing.</p><br/><p>They were hailing Heaven for watching, marveling at this miracle Haotian had brought, saying that they were willing to be the father and daughter’s witnesses. They suggested the father and daughter go and thank Haotian in the Taoism Temple outside the town. They said that Taoist Niu who lived in the temple was really a nice person, then a woman sighed and said that bad thing happened to good people, since Taoist Niu would die soon.</p><br/><p>Sangsang walked out of the town with the Big Black Horse. Then she found the temple which looked decent and simple. Her indifferent gaze climbed over the wall and saw the old Taoist who was on the brink of death.</p><br/><p>Abscesses scattered on the old Taoist’s skinny body. His middle-aged successor stood out of the door reluctantly. Those who had been helped by the temple had to bear the disgusting smell and waited aside.</p><br/><p>Sangsang watched it for a while, then she left.</p><br/><p>A while after she left, an exotic fragrance suddenly rose in the temple. Later golden flowers floated down from the old beams, scattering on the old Taoist.</p><br/><p>People could see the abscesses on him getting smaller and disappeared. His white hair turned black. He had been fully healed and turned to be ten more years younger than before.</p><br/><p>The middle-aged Taoist was astounded. All the Haotian believers in the room knelt down, and wouldn’t stop praying to Heaven, crying for Haotian’s grace.</p><br/><p>The old Taoist struggled to sit on the bed with the support of other people. He had been faithful, trying every best to help people throughout his entire life, now finally he had been rewarded. With both palms flipped up to the sky, he cried in streaming tears, “For God so loved the world!”</p><br/><p>With the horse behind, Sangsang was walking in the forest, a few miles southwest of the Temple.</p><br/><p>The Big Black Horse looked at her with confusion because it couldn’t understand why she would do those two things. Ning Que once mentioned that Heaven’s way was intangible and ruthless. The believers in the mortal world were no better than ants in her eyes, then why was she willing to get involved in those trifles?</p><br/><p>Deep down in the forest, Sangsang ran into a house. The family had fourteen people, old and young. They made charcoal for a living. Life was difficult but peaceful and happy for them.</p><br/><p>Nobody knew that the old master of the family was a junior deacon of the Devil’s Doctrine. He fled into the deep mountain after the Doctrine was extinguished. Then he married a local woman and fathered a few children. When the children grew older, he taught them the skills of the Doctrine, though not the advanced ones. Those skills were of no use in the deep mountain, he taught them just because he felt he had to.</p><br/><p>As Sangsang left, the charcoal kiln suddenly collapsed. Piled wood in the yard was set on unbounded fire, burning all the fourteen people into ashes, which was her purification.</p><br/><p>The Big Black Horse was following her, staring at her fair bare feet. It thought to itself that Ning Que was right, innocence could be cruelty.</p><br/><p>God so loved the world, in the way that she wanted.</p><br/><p>Haotian was still ruthless.</p><br/><p>In deep winter Sangsang and the horse arrived at the capital of the Kingdom of Song. They passed by the busy streets, and stopped by a common restaurant. She suddenly felt very hungry.</p><br/><p>The wine she had had was enough for her to walk in the mortal world for a long time, so the hunger she had now was not physical, but mental. She had been aware of that and felt reluctant.</p><br/><p>But she still made her way into the small restaurant, and walked to the third floor which was quieter. Then she ordered eighteen dishes without looking at the menu, with a sweet mashed taro for dessert.</p><br/><p>She had been here before. She remembered those dishes, and the dessert. Everything here was exactly the same as the last time she came.</p><br/><p>Soon the sweet mashed taro was served, then followed by eighteen well-matched dishes. Meat and vegetable, cold and hot dishes fully occupied the table before her.</p><br/><p>Sangsang didn’t pick up the chopsticks. She stared at the dishes on the table for a long time, then she remembered what the man told her last time when she was in the restaurant.</p><br/><p>“You have to try this dish, you poor child. You have never led a good life with Ning Que all these years and you don’t know how many delicacies there are in the world, and how much fun there is out there. Just enjoy yourself with me these days.”</p><br/><p>She closed her eyes slowly, and recalled those words the man spoke to him by the Sishui River.</p><br/><p>“I brought you the best gigot in the world, the most exquisite eighteen dishes in the Kingdom of Song, and the most delicious instant-boiled mutton on the grasslands. I also took you to eat variable platyfish and drink oyster soup. I took you to see the Snow-capped Peak and boated on the sea. I also agreed on your marriage with Ning Que.”</p><br/><p>“I took you to eat all kinds of fine food and to see all the good sceneries in the world. I let you enjoy the greatest happiness as a human being. I even helped you experience a deeper feeling.”</p><br/><p>The Headmaster looked at Sangsang and said, “Human beings are nobodies in your eyes. But now you are married to a nobody and feel his happiness. Have you ever thought of staying in this world since you have fully enjoyed the happiness of this world? You spared no effort to find me over these years and desired to invite me to fight in Heaven. However, have you ever thought that I really wanted to invite you to visit me in this world?”</p><br/><p>She opened her eyes, without any emotion inside.</p><br/><p>A blizzard arrived, covering the whole capital city of the Kingdom of Song. On the streets, people exclaimed in shock, walking to take shelter. The handrails in the restaurant were immediately frozen, since it was so cold.</p><br/><p>The blizzard came because she was furious.</p><br/><p>She woke up in the broken mountain. When she passed by the sea of snow, she took a look at the variable platyfishes.</p><br/><p>Her first step covered ten thousand miles, then she started to slow down.</p><br/><p>The Drunkard couldn’t avoid her, not because she was fast, it was because she was the rule by herself, and whatever rules the Drunkard used, they belonged to her.</p><br/><p>She slowed down, because her aura became turbid and heavy as she walked.</p><br/><p>She walked in the mortal world, and started to fit in.</p><br/><p>She looked to her own plump body, and figured out what was new in her body.</p><br/><p>It was the power of the mortal world left inside her by that man.</p><br/><p>Those are the joys of the mortal world she experienced with that man; it was low but obstinate.</p><br/><p>She looked at the 18 dishes on the table, then she picked up the chopsticks, and started to eat.</p><br/><p>She ate fast, faster than a man would.</p><br/><p>Moments later, all the 18 dishes were in her belly, including the iced mashed taro.</p><br/><p>The snow finally ceased in the capital city of Song.</p><br/><p>She left the restaurant and walked on the street with the Big Black Horse.</p><br/><p>The street grew bustling again. Children were making snowmen, others were fighting with snowballs. Vendors seized the opportunity and peddled, “Sugar-coated Berry!”</p><br/><p>She saw the Chenjinji Cosmetic Store not far away, which reminded her that the man had once bought her a jar of cosmetic powder, and later when they were in the city called Chang’an, he bought her another one.</p><br/><p>She turned serious, and the emotions in her eyes vanished.</p><br/><p>People came and went. She held the rein in her hands, and crossed her hands behind her back, proud but lonely.</p><br/><p>She wouldn’t look up to Heaven because she was Heaven.</p><br/><p>She was looking at the mortal world. She couldn’t draw back, neither could she move forward.</p><br/><p>She wouldn’t allow herself to step any further into the mortal world.</p><br/><p>This was a trap set by the man who had ascended to Heaven, or a question asked by him to her.</p><br/><p>How to break out of the trap? How to answer that question?</p><br/><p>She might be omnipotent, but she still needed time to solve the big problem.</p><br/><p>Her expression grew more and more indifferent, and her pupils faded, as if becoming transparent.</p><br/><p>Sounds of vendors shouting and selling their hotcakes came from nearby.</p><br/><p>Again, she felt hungry.</p><br/><p>She hadn’t eaten any hotcakes in the town.</p><br/><p>She was angry, and decided to kill all men in the capital city.</p><br/><p>Suddenly, she felt something wet and soft on her hand.</p><br/><p>She looked back. Her black hair fluttered and shattered a snowflake into the tiniest particles.</p><br/><p>The Big Black Horse lifted its front hooves, like it was kneeling. Sweat kept leaking out of its mane in this chilly weather, obviously, because it was extremely tense.</p><br/><p>It grew tenser when Sangsang looked at it.</p><br/><p>It hesitated for a moment, then licked her hand gently.</p><br/><p>Sangsang silently looked at it.</p><br/><p>The horse wagged its tail desperately, like it was begging for mercy.</p><br/><p>The short hotcake seller passed by, shouting and selling. He had no idea that he just narrowly missed death.</p><br/><p>Sangsang looked at the horse and asked, “How dare you?”</p><br/><p>The horse regretted it so much that he nearly buried its head in the snow.</p><br/><p>She looked back at the long street, and watched the mortal world once again.</p><br/><p>The coldness between her brows and eyes was reduced.</p><br/><p>The Big Black Horse lifted its head, and felt a little bit more pleasant when seeing her back.</p><br/><p>The short hotcake seller ran to the end of the street, with a carrying pole on his shoulder.</p><br/><p>A beautiful young woman was waiting for him.</p><br/><p>The two chatted and walked home. The short hotcake seller was proud but self-abased at the same time. He wouldn’t make eye contact with other people, but the young woman kept greeting those they walked by.</p><br/><p>Sangsang looked over there and said, “The love and hate of folks, which they falsely take as their faith, are so low and so funny. Why do you think they deserve your sympathy?”</p><br/><p>The Big Black Horse lowered its head. It dared not to go against her, but it wouldn’t agree with her, either.</p></div>\n</div>"}