{"title": "Chapter 821 - May the Spring Rain Wash My Blood", "id": 821, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-821-may-the-spring-rain-wash-my-blood", "volume_title": "Volume 9", "body": "<h1>Chapter 821 - May the Spring Rain Wash My Blood</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The world war against the Tang Empire began with a plot in Chengjing City of the Yan Kingdom. But the real turning point was in Qinghe County, where the rebellion by the warlords led to the demise of the Tang navy, and the Great Lake was dyed red with blood. After that, the West-Hill Divine Palace Coalition Army invaded the north. The Southern Army did not arrive in time to help, and if not for the Academy’s disciples guarding the Verdant Canyon, even though they suffered serious injuries and even lost an arm, the Tang Empire might have really been destroyed.</p><br/><p>This was the first rebellion in the Tang Empire since its founding. And according to the news that spread after the incident, the scene was extremely gory. That was why compared to the powerful West-Hill Divine Palace and the Golden Palace, the Tang Army was more enraged against the warlords of Qinghe County.</p><br/><p>The warlords of Qinghe County planned the rebellion to knock Chang’an out cold, first by winning Li Yu’s trust. To do so, they had left many of their citizens in Chang’an as hostages, and many of them were important figures to the warlords. When the news of the rebellion spread to Chang’an, these people naturally became top priority in the Tang’s surveillance. Those belonging to the Qinghe guild tried to escape and almost succeeded, but were captured by the prefectural magistrate of Chang’an City, Shangguan Yangyu’s vicious ways. And they were not able to leave the guild again after that.</p><br/><p>There were two different opinions on how to deal with these descendants of the Qinghe County warlords. One faction felt that they should quickly kill them using the cruelest methods so as to subdue the rebels in Qinghe county, and at the same time, appease the spirits of the Tang navy and hundreds of martyred officials. The other faction thought that they should use the descendants as bargaining chips in order to shock the traitors and subdue the warlords.</p><br/><p>With the arrival of the West-Hill Divine Palace’s diplomatic corps, and especially with the sudden change in the current situation, the peace treaty was about to be signed. The opinions of both factions were now unimportant. The Tang officials could only watch as the people were taken out of the guild hall and sent to Qinghe County. They could only stay silent no matter how indignant they felt.</p><br/><p>It was then when Ning Que entered the Qinghe County guild hall. A middle-aged officer wearing the Tang official uniform without wearing the hat welcomed him. The man looked honest and trustworthy.</p><br/><p>“Greetings, Mr. Thirteen,” the middle-aged officer greeted him calmly and politely.</p><br/><p>Ning Que replied, “Since you do not admit that you are a Tang citizen, why are you still wearing our court uniform?”</p><br/><p>The middle-aged officer was called Cui Yuan. He was the second son of the Cui Family from Qinghe County and had been an official in Chang’an for many years. He had held an easy position that paid well in the Ministry of Rites before the war.</p><br/><p>The Qinghe guild hall was under the strictest surveillance and supervision at all times. The court did not deliberately humiliate the descendants of the warlords. They lived in there just like before. However, with hundreds of people staying in the guild hall, it wouldn’t make any difference wearing common clothes or uniforms. As such, Cui Yuan continued wearing his old official uniform.</p><br/><p>Cui Yuan smiled bitterly and said, “I am an official of the Tang Empire. The elders in my clan are ignorant and muddled, and their rebellion has nothing to do with me.”</p><br/><p>The average person might consider these words, but Ning Que did not. He did not care whether Cui Yuan’s attitude was sincere or not. He only knew that the man was old Master Cui’s second son and was an important figure amongst the warlords.</p><br/><p>He said, “I heard the old Master has a few grandsons that he dotes on a lot. Are they in the guild hall?”</p><br/><p>Cui Yuan looked at his expression and knew that he did not need to put up any false pretenses before Mr. Thirteen. He bowed deeply and sighed, saying, “Please do not be angry, sir.”</p><br/><p>Ning Que replied, “To calm the anger is to maintain inner peace, which is very difficult. Furthermore, the Tangs have always thought of those from Qinghe County as part of their own. The betrayal of the warlords was like stabbing us in the back. Do you think that the people living in this city can still smile at you under such circumstances?”</p><br/><p>Cui Yuan’s expression grew ugly and he said, “The families here have been scholars and have a history that is longer than Chang’an. Their only wish is to return the county to how it was a thousand years ago; it can’t really be called a betrayal.”</p><br/><p>Ning Que said, “This makes sense. I know what you’re worried about. Otherwise, you’d have offered me tea even though you are trapped here and I am an unwelcomed guest.”</p><br/><p>Cui Yuan smiled bitterly and replied, “Is there anyone unafraid of death? Forgive me for being too concerned.”</p><br/><p>Ning Que said, “Even though I cannot be appeased, I have come to tell you something very unwillingly. The West-Hill Divine Palace wants to save your lives.”</p><br/><p>Ning Que had been paying attention to Cui Yuan’s expression when he said that. When the man heard the news, he remained as serene as before, but a trace of happiness flashed across his eyes.</p><br/><p>This was exactly what he wanted to see.</p><br/><p>Cui Yuan bowed deeply to him once again, and thanked him with a trembling voice. “Even though I know how angry you are, I would still like to thank you. Once we return to Qinghe County, I will restrain my clan and we will live harmoniously with the Tang Empire.”</p><br/><p>Ning Que admired the man’s performance very much and thought that the warlords of Qinghe did have many talents. Even the man who had entered the capital as a hostage was able to perform so perfectly under the circumstances. The man did not say anything and behave in any way that might displease or enrage the Tangs.</p><br/><p>He said, “I do not understand the West-Hill Divine Palace’s intentions.”</p><br/><p>Cui Yuan thought to himself that it was impossible for Ning Que to not have known. Ning Que was asking just because he wanted to hear Cui Yuan to say it. He said bitterly, “If they cannot even protect Qinghe County, no one else in the world will trust the Divine Hall again.”</p><br/><p>“That’s true.”</p><br/><p>Ning Que said thoughtfully, “Power speaks louder than reasoning. The Divine Hall’s power is indeed great now, so they are more well-reasoned.”</p><br/><p>Cui Yuan added on, “The Academy’s recession is temporary, there’s no need for you to be so modest.”</p><br/><p>“I have never enjoyed being modest. Even though Haotian Taoism’s fists are bigger in the world for now, in Chang’an, the Academy’s fists are still bigger. As such, I have decided to be reasonable.”</p><br/><p>Ning Que looked at him and said, “Earlier, you said that no one would trust the Divine Hall if they could not protect Qinghe County. That is very reasonable, so tell me, why shouldn’t we kill you all?”</p><br/><p>Cui Yuan frowned with confusion. He wondered to himself what was the point in saying so much if Ning Que was going to kill them all.</p><br/><p>Ning Que said, “Should the warlords of Qinghe County have the chance to shine as brilliantly as they had a thousand years ago, you and all the others in the guild hall will regretfully have no opportunity to see it.”</p><br/><p>When he heard that, Cui Yuan’s expression changed drastically. He asked softly, “What do you mean by that, Sir? Was everything you said earlier false? Did the West-Hill Divine Palace not make this demand?”</p><br/><p>“The West-Hill Divine Palace does want you all to live to prove the greatness of Haotian.”</p><br/><p>Ning Que looked at him and said, “The problem is that Qinghe County killed more than 300 officials of the Tang Empire. More than a thousand people in the navy died, from the chief commander to auxiliary troops. More than a thousand people are doing hard labor in the Mei Mountains downstream from the Fuchun River. Compared to the greatness of Haotian, I think these are all more important.”</p><br/><p>Cui Yuan understood what he meant and he could not help but tremble. He yelled angrily, “Mr. Thirteen, do you intend to sabotage the negotiations? Do you even want to sign an agreement with the Divine Hall?”</p><br/><p>“The warlords of Qinghe have not behaved like obedient dogs for a thousand years since the Tang Empire ruled. It’s been too long and you all have seemed to have forgotten how to behave like dogs. You have forgotten to think like dogs.”</p><br/><p>Ning Que said, “You do really have to make sure who the owner is before you beat the dog, because the master of the dog would, of course, want to protect his own dog. Butwhat if I do really kill all of you dogs, what then can your master do? At the most, I’ll have to pay the price, but not with my life. Do they really think that I would recompense them with my life? A dog’s life is cheap and is never as worthy as the life of a human being. Qinghe County has been the Divine Hall’s dog since the day they turned against the Tang Empire and your lives are worthless.”</p><br/><p>Cui Yuan glared at him and bellowed angrily, “Come at us if you wish to kill us. I have been waiting in the guild hall for days, and never expected to leave alive. Even the children are prepared. Why would you say all that to shame us? Is this the manner of the Tang Empire?”</p><br/><p>“I know that you are all prepared to die. I told you about the Divine Hall’s demands not to shame you, but I hoped that you would all regain hope again. Hope is beautiful, and the hopelessness that comes after is painful, just like how those officials and soldiers felt when they died in the warlords’ hands.”</p><br/><p>Ning Que said, “This is indeed not the way the Tang Army and people would do things, but I have never been the model Tang citizen. I can do many things to return the pain to my opponent. I will be very patient. You all will be the first to experience this, but not the last.”</p><br/><p>Cui Yuan’s face was extremely pale. A flash of joy had crossed his eyes earlier, when he heard that the West-Hill Divine Palace had requested for the Tang Empire to send him and his clan members back to Qinghe County. The joy had long disappeared now, and his eyes were devoid of hope and calmness, leaving behind only hopelessness.</p><br/><p>“I seemed to have heard some cheering earlier, it seems as if our conversation has already spread through the guild hall. I imagine those cheers would later become sobs, and this makes me really happy.”</p><br/><p>Ning Que said that, and then, pulled out his podao and stabbed forward.</p><br/><p>There was a soft puff and the sharp but heavy blade slowly pierced through Cui Yuan’s abdomen.</p><br/><p>Ning Que started to pull away his blade. His action was slow and very gentle, and as such, Cui Yuan was in extreme pain.</p><br/><p>Cui Yuan clutched at his bleeding abdomen and slowly sat on a chair. His face was pale and his chest heaved. He seemed to be in extreme pain, but he could not die immediately.</p><br/><p>Ning Que held his blade and walked to the entrance of the Qinghe guild hall.</p><br/><p>The Yulin Royal Guards and the Fish-dragon Gang had already surrounded the guild hall completely.</p><br/><p>Ning Que ordered, “Kill those wearing the Tang Empire uniform slowly. Don’t forget to strip them of the uniform when you collect their corpses. Kill those under 14 quickly.”</p><br/><p>“Yes!”</p><br/><p>The Yulin Royal Guards and the Fish-dragon Gang answered as one as they walked past him, charging with intent to kill.</p><br/><p>A young Qinghe County teen ran downstairs from the guild hall. He hugged the dying Cui Yuan who was sitting on the chair. His face was covered in tears as he sobbed, “Father!”</p><br/><p>A man from the Fish-dragon Gang stabbed him and he fell into a puddle of blood.</p><br/><p>The massacre in the Qinghe County guild hall started. There were dead people everywhere and blood flowed everywhere. The sounds of blades cutting bone and crying accompanied the spring rain and could be heard from afar.</p><br/><p>Ning Que held his podao and stood at the door of the guild hall, watching the spring rain.</p><br/><p>The rainwater on his shirt had long dried but he had been dampened anew with lots of blood.</p><br/><p>Both the Yulin Royal Guards and the Fish-dragon Gang found it hard to kill some of the people. Ning Que did not give them time to hesitate. Instead, he chose to dye his own iron cutlass with blood.</p><br/><p>He did not wipe the blood off because it could not be cleaned no matter how he wiped it.</p></div>\n</div>"}