{"title": "Chapter 833 - Time for Reunion", "id": 833, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-833-time-for-reunion", "volume_title": "Volume 9", "body": "<h1>Chapter 833 - Time for Reunion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Having long hair in the army could be inconvenient, because it is hard to wash after being stained by blood, so I cut it. And I’ve gotten a tan. Those scars on me, they looked so ugly.”</p><br/><p>Situ Yilan said, with her hands rubbing her hair. She had changed a lot since she joined the army, but it was natural for people to have the desire to be beautiful, especially for women.</p><br/><p>Ning Que was gentle when seeing her acting like a naughty boy, and he said, “You’re more beautiful than ever in my eyes.”</p><br/><p>Situ Yilan said, “Don’t try to coax me.”</p><br/><p>Ning Que smiled, and he wasn’t going to defend himself on that. Then he said, “What are you going to do next?”</p><br/><p>Situ Yilan said, “The Military Ministry is sending me to Gushan County.”</p><br/><p>Her words silenced the room. The imperial court was sending her to Gushan County, and Ning Que knew it was because the court wanted to subdue the force of the Huas in the army in the name of General Yunhui. Though Li Yu owed the Huas much, she had to do that because Hua Shanyue had died.</p><br/><p>Situ Yilan came back from the Northern Border, and was clearer than everyone else about how Hua Shanyue died. She knew it had something to do with Ning Que, but she didn’t say it, instead she said, “I would like to have an audience with Her Highness.”</p><br/><p>“She refused to see you?” Ning Que was surprised because he thought it would be easy for her to meet Li Yu, considering their relationship, and her connection with General Yunhui.</p><br/><p>Situ Yilan nodded.</p><br/><p>Li Yu’s solidarity was out of Ning Que’s expectation. He paused for a second and said, “I’ll lend you the ID token. You can go into the palace at night and just try to talk to her.”</p><br/><p>There was no dancing girl that night, because it was a schoolmate reunion, and partly because of the current situation. The House was now bustling and joyful. Ning Que went upstairs to meet Mistress Jian.</p><br/><p>Dewdrop made a bowl of dumplings and put it on the desk before Ning Que. She then sat down near him and held his arms. Mistress Jian was frowning, but Dewdrop smiled and wouldn’t let Ning Que go, because she was no longer a registered girl in the House. She was here because she liked living here. Therefore, she was not the fearful girl like she used to be when facing Mistress Jian. She felt sorry for Ning Que because he could only take her softness as a test.</p><br/><p>Xiaocao was standing behind Mistress Jian and grunted reluctantly. The girl had grown up as time went by, and she became even more mature after Mistress Jian let her in charge of the song-and-dance troupe business. She might look like a girl, but she worked in a clear cut fashion. She quit acting like a shy girl except now, partly because of Sangsang, and because she hated it when other girls clung to Ning Que.</p><br/><p>Mistress Jian said, “I asked you to come over here today to discuss about the Light Sacrifice. The West-Hill Divine Palace wants the House to dance for the sacrifice. I’m seeking the Academy for advice.”</p><br/><p>Ning Que said, “It’s all up to you, Aunt Jian. You can go if its convenient, but you don’t have to if you don’t feel so inclined. The West-Hill Palace wouldn’t do anything about it because we’ve already had the agreement signed.”</p><br/><p>Mistress looked at him, and said with profound meaning, “The Light Sacrifice is the biggest festival recorded in the West-Hill Scripture. People won’t celebrate it until Haotian showed the sign, so I was wondering why the Palace is going to celebrate it now. If it’s to celebrate victory in war, that would make them a joke for all people in the world.”</p><br/><p>Ning Que was considering and he asked, “You mean…”</p><br/><p>Mistress Jian said, “It’s no harm if we go there, at least we can watch if for you.”</p><br/><p>“I’m afraid the journey will not be peaceful.” Said Ning Que.</p><br/><p>Mistress Jian looked him in the eyes and asked, “Can you at least guarantee the safety of the girls?”</p><br/><p>Ning Que said after a short moment of silence, “Someone can do it for me even if I can’t.”</p><br/><p>Dewdrop and Xiaocao heard the conversation clearly. They were confused and wondering who that “someone” was.</p><br/><p>Ning Que left the House of Red Sleeves in the black carriage.</p><br/><p>A short distance away from the street entrance, the curtain of the carriage swayed slightly and Chu Youxian climbed in. In the dim light, he took out several big envelopes, then put them in order and whispered, “The Great Priest of Revelation throne is still empty. There’s no trace indicating who’s going to be the successor.”</p><br/><p>The West-Hill Palace had sent spies to the South School of Haotian Taoism, and the Empire of Tang had sent spies to the West-Hill Palace. Those spies had played important roles. The Tang spies worked out together to kill several Divine Talisman Masters at the cost of some of their own lives, and survivors kept spying in the Divine Hall.</p><br/><p>It started at the negotiation in early spring. Those spies in Peach Mountain began to send messages through the Imperial Center Administration and secret guards. Chang’an had known of the Great Divine Priest of Relevation’s death, even before Ye Hongyu did, because she was at Qinghe County at the time.</p><br/><p>Ning Que silently recalled the peach blossoms over the mountain, mentioned in the intelligence.</p><br/><p>“According to the analysis of the Imperial Center Administration, Cheng Lixue was the most hopeful successor of the throne of the Great Priest of Relavation, but there seems to be something special about the inheritance of the Throne. Anyway, he is in an awkward position now, and if anyone else takes over the throne, Cheng Lixue will be a trouble to deal with.”</p><br/><p>Chu Youxian had inherited the businessman’s mind from his father. He might not be a good cultivator, nor did he have any outstanding abilities; however, he could always dig out the most valuable results, from the reports of the Imperial Center Administration, or from the secret guards.</p><br/><p>He looked at the file in his hand and said, “The Eternal Fire in the Divine Hall of light has died out for a reason nobody knows, because those seeking for the reason have all died. And it can be certain that ten more priests mentioned last time have gone mad. That’s all we’ve known so far.”</p><br/><p>Ning Que frowned slightly. He was not satisfied, obviously.</p><br/><p>With guilt Chu Youxian said, “We’ve even checked the trash in the Divine Hall. But all the trash had been disposed of. We couldn’t find any trace to analyze.”</p><br/><p>Ning Que asked, “How about the stables?”</p><br/><p>Chu Youxian shook his head and said, “Nothing there, either.”</p><br/><p>Ning Que thought it for a moment and asked, “How about the use of wine?”</p><br/><p>Other ordinary officials might have just ignored the change on the amount of daily use articles, but Chu Youxian hadn’t, he said, “There’s a considerable increase.”</p><br/><p>Ning Que grew cautious and asked, “Any horse became pregnant?”</p><br/><p>The male war-horses of the Papal Cavalrymen in the West-Hill Palace had all been castrated, which made Ning Que’s question seem odd and confusing to Chu Youxian.</p><br/><p>“There’s no information about that.”</p><br/><p>Chu Youxian clamped the last big envelope with his two fingers and said, “There was one thing that was odd. Our spy once saw a pot of left-over corn porridge in the stables. He remebered you had mentioned it before, so he collected some.”</p><br/><p>Ning Que took over the envelope, and poured out the left-over porridge. A sour and terrible smell filled the carriage. Chu Youxian frowned and covered his nose.</p><br/><p>Ning Que was dignified, as if he hadn’t smelled it at all. He was poking the smelly porridge with a knife, and he finally found a hairs of a black mane.</p><br/><p>“Thank you, little silly.”</p><br/><p>He looked at the black hairs, and thought to himself.</p><br/><p>The black carriage stopped by Yanming lake. Chu Youxian left the carriage and disappeared in the dark streets. Then Ning Que got off the carriage, too. He stood in front of the yard, silent, then he said to Wang Jinglue, “Get things ready, I’m going on a long journey.”</p><br/><p>Wang Jinglue took off his straw hat, then he put the reins away and said, “Are you sure about that? It’s not a ten-mile journey to the suburbs, but a one thousand miles journey full of risks.”</p><br/><p>Ning Que said, “It has to be done anyway, better by ourselves than by others.”</p><br/><p>In the darkness, Yanming lake reflected ten more lights from the houses. It was like the lonely sky on which stars faded because of the strong moonlight.</p><br/><p>Ning Que was drifting on a boat. Fresh green lotus shoots flicked the boat from time to time. The lotus flowers were yet to bloom, but their leaves were meeting each other.</p><br/><p>The lotus leaves were gathering, while people did not. Looking at the lotuses Sangsang planted those years, he recalled the words from the Drunkard, “Death is the reunion after a long separation.”</p><br/><p>He was still trying to figure out how did Haotian find the Drunkard and the Butcher in the mortal world. He had been looking for clues, all of which traced back to the one he couldn’t possibly find.</p><br/><p>He moved his eyes from the boat to Yanming Mountain by the lake. He could almost hear that girl singing in the storm and snow, with the black umbrella in her hands.</p><br/><p><em>“How could I not have known it was you? Are you still my other half? You returned the carriage and the iron arrows to me, and took away the big black horse and umbrella. Are you really divorcing me?”</em></p><br/><p><em>“But I won’t make it easy. Your name is still on my household registration book; your address is still the Old Brush Pen Shop; your note is buried in the tomb. How about I send it to you?”</em></p><br/><p>The early summer night wind blew in Ning Que’s face. He had a meaningful smile on his face as he thought, <em>“If death is the reunion after long separation, then we shall reunite.”</em></p><br/><p>The next morning, the well-known black carriage passed by the steamy meatbun shop. Many citizens and royal guards saw it run into the Imperial Palace, to never come out ever since.</p><br/><p>Days later, people were suspecting. Nobody knew what Ning Que was doing in the palace, not even the ministers in the imperial court. But one thing they were sure was that he had never left the city.</p><br/><p>Those spies from the West-Hill Palace in Chang’an grew restless. They paid a heavy price to kill two maidservants working for the Chu’s, and finally they acquired some information.</p><br/><p>A dull knocking sound came out from the ground near the small building in the Imperial Palace. The imperial study was still lit up till midnight. Rare and precious materials kept being transported into Chang’an from small counties under the arrangement of the Ministry of Revenue. One day at dusk, people saw a tough man enter the Imperial Palace with a hammer on his shoulder.</p><br/><p>When the information was sent back to Peach Mountain. The West-Hill Palace came up with a stunning conclusion: the Academy might be improving the God-stunning Array, but was it true?</p></div>\n</div>"}