{"title": "Chapter 841 - A Sage in Town (Part Two)", "id": 841, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-841-a-sage-in-town-part-two", "volume_title": "Volume 9", "body": "<h1>Chapter 841 - A Sage in Town (Part Two)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Darkness thickened in the shabby house. Ye Su looked at him, smiling and saying, “I’ve learned some from your Senior Brother before, so I should teach you. But you’ll have to pay for it. What do you want to learn?”</p><br/><p>Ning Que looked at the bowl in his hand, in which the water looked like wine. After a moment of silence, he started to tell the stories that had happened since last autumn.</p><br/><p>The snow fell like a light curtain hanging over the city wall. The Abbey Dean met thousands of cutlasses in the city. The snow burnt in the air, burning out a hole, revealing a piece of blue sky. And Ning Que wrote a character in the blue sky.</p><br/><p>Ye Su was now an ordinary person, an outsider of to the cultivation world. He might have missed lots of things, but he had been informed of the Abbey Dean’s breaking into Chang’an by the Sword Garret long ago.</p><br/><p>“You are invincible in the city as long as you can write that character, so even my teacher could be beaten by you. But if you step outside the city, it would take no more than a glance for teacher to kill you.”</p><br/><p>Ning Que admitted it and said, “I want to know how to become equally powerful, even if I am outside of Chang’an.”</p><br/><p>Ye Su said, “I am not qualified to teach you, neither are Yan Se and your many predecessors. In fact, nobody is qualified because you’re the first one who has been able to write that character.”</p><br/><p>Ning Que asked, “How can I gather more of the people’s will?”</p><br/><p>Ye Su said, “In the most common way, it’s presented as faith.”</p><br/><p>Ning Que said, “I’ve got the same idea, but I don’t want to follow the old way of Haotian Taoism.”</p><br/><p>Ye Su said, “But you’ve taken great risks to go out of Chang’an and into the mortal world, traveling land and seas. That is still the old way I went, when I was trying to see through life and death.”</p><br/><p>Ning Que couldn’t quite understand what that meant.</p><br/><p>“Back in the old days, when your Senior Brother was reading by the pool, he didn’t even notice my sword; that was when I realized I still had to seek even if I had seen it through, but I’ve lost it when I insisted it was something to be ‘seen’. Later when I was in secluded cultivation in the small Taoist Temple, I watched the temple breaking and collapsing, then I realized that a wall has to be broken first if it needs to be restored. And finally I knew nature was all about the circle between life and death.”</p><br/><p>Recalling the strike at the mountain in the Wilderness, and the scholar by the pool, Ye Su looked at him, then he smiled and said, “That was why I was able to take Jun Mo’s sword before the Verdant Canyon.”</p><br/><p>Ning Que asked, “What does it have to do with my current question?”</p><br/><p>Ye Su said, “You wrote the character no one had written out before; you’re on a way without any pioneers ahead. I’ve made it clear that nobody is qualified to teach you. I am sharing the process of my enlightenment. I am exhibiting it to you; I’m bringing it out for you to touch. It’s not up to me if you can catch anything from it.”</p><br/><p>After a brief silence, Ning Que replied, “Go on.”</p><br/><p>Ye Su said, “During the trial when I saw through life and death, I had been watching the mortal world as an outsider. Then, I became an insider when I was paralyzed, and came back to the mortal world, in this shabby alley in Linkang City.”</p><br/><p>Ning Que remembered when he stood on the city wall in Chang’an, watching the crossing lines of streets and alleys, on which walkers were like ants. He remembered those dull faces of the travelers in the ship on the Great Lake. Then he realized he had never quit being an outsider.</p><br/><p>Ye Su looked at him and continued, “You hate to follow the old way of Haotian Taoism because you hate the religion in your nature. While religion is indeed a kind of faith, faith is not all about religion; at least not all about religions like Haotian Taoism.”</p><br/><p>After thinking for a while, Ning Que said, “I agree on that.”</p><br/><p>“You know that for those powerhouses in Haotian Taoism, the higher their realms are, the harder it is to keep their hearts pure, which in simpler terms is: ‘it’s hard for powerhouses to have faith’. Faith exists not in Heaven but in the dust and the lower places. It is the unshakable will and desire of the ordinary. If you want to gather their will, you have to figure out what they really want.”</p><br/><p>Ye Su said, “My Snow Moutain and Ocean of Qi are all broken, which made me a true ordinary person. I lost the qualification to consider those complicated questions, but I’ve been given the opportunity to live like the ordinary, and know about their thoughts. For example, the children in my neighborhood, eating was their only faith.”</p><br/><p>Ning Que nodded as he thought of those pictures he had seen.</p><br/><p>Ye Su looked at him and asked, “Have you eaten anything?”</p><br/><p>Ning Que saw the large bowl of green vegetables and rice, saying, “It doesn’t matter.”</p><br/><p>Ye Su said, “See? That is what differentiates you from the ordinary.”</p><br/><p>Ning Que understood him, and asked, “Do you have noddles?”</p><br/><p>There was almost no furniture in the house. Thought there was an old pot and an ancient stove, rice and noddles were nowhere to be found. Lucky that Ye Su was a respected man in the neighborhood, and soon someone sent him a bowl of vegetarian noddles.</p><br/><p>Ning Que finished the noddles and drunk up the soup. He placed the bowl and chopsticks on the window. Then something came to his mind, so he asked, “You said you want to live like the ordinary, then why let those kids send you meals?”</p><br/><p>Ye Su’s answer was simple and convincing, “I don’t know how to cook.”</p><br/><p>That was an explanation Ning Que couldn’t argue against. The he asked, “I saw women doing their laundry in the front alley. They didn’t use any soap powder; I thought it was because they were poor, but why not use rods for beating laundry?”</p><br/><p>Ye Su’s explanation was still convincing: “The beating rod would surely help to wash the clothes, but their clothes were made of inferior cloth, and might be damaged after a few beatings.”</p><br/><p>Ning Que said, “They definitely live a hard life here, but do you have to be the same to understand their feelings? That’s too self-inflicting.”</p><br/><p>“I’ve just started my learning, so I can’t give you the exact answer or show you the way. I’m telling you some of my intuitions, for your reference.”</p><br/><p>Ye Su said, “I told you that faith could gather the people’s will, and the point makes sense in the other way, that all the will gathered will finally become faith. What we need to know is the thing people really want.”</p><br/><p>“Human beings are good at hiding their hearts, because confession is like taking off armor, too often followed up by danger. You can ask them what they want in the common and comfortable days, but you could barely get the true answer. The true answered will come out by itself clearly, only when they are in the most desperate and extreme situations. They will be honest under the circumstances, no matter how dull or tricky they are.”</p><br/><p>Ning Que paused and thought of those brave Chang’an people in the storm and snow day.</p><br/><p>Ye Su continued, “Your previous sentence is wrong. I don’t have to live a hard life to understand the feelings of the ordinary. I am living a hard life because hardness is common in this world. I chose Linkang instead of Chang’an, because the Tangs’ life was too free and too comfortable, unlike the lives of most people in the world.”</p><br/><p>“In Linkang City, I have seen the most extravagant nobles and the poorest citizens, as well as the arrogant priests and the miserable servants. They seemed to be born to be rich or poor without a choice. I started to think about one question: why is it so difficult to change?”</p><br/><p>Dusk sneaked into the shabby house through the broken roof. Ye Su’s body was glowing in warm red. He didn’t look dignified anymore, but very amiable instead.</p><br/><p>He looked at Ning Que in silence, saying, “According to the doctrine of Haotian Taoism, men are born with original sins. And they shall confess so that they can be saved, and so that they can ascend the Kindom of Light. But why do they have to suffer decades of torture before they enter the Kingdom of God?”</p><br/><p>“I’ve never been to the kingdom of God, so I have no idea if it is as beautiful as it is described in the scripture. What I do know is that the world under the Kingdom of God, is far from perfect. What should Haotian’s believers do when Haotian’s merciful eyes aren’t watching, or when he was deliberately testing mortals? Shall we wait for the salvation bitterly and dully, kneeling to the West-Hill like we’ve been doing for countless years? Original sins exist with the fall of men, but where do they stem from? Is it greed? Is it yearning for freedom? Or is it the restless heart?”</p><br/><p>“These are all desires that human beings can’t possibly get rid of. If they are sins, then never can they be wiped out completely. For the sins, the Buddhism demands meditation, which is to block the way of desire; Taoism takes advantage of these desires and converts them into devotion, faith as the medium. Only the Academy left no restraints for it.”</p><br/><p>Ye Su said, “They are all reasonable, but not perfect. Buddhism ignored this life and pinned hope on the afterlife. Haotian Taoism ignored the real world, pinning hope on the Kingdom of God. The Academy set the Law of the Tang Empire, and is in the leading position, but it requires too high of a man’s personal accomplishment. I’ve been thinking these days about another way to turn this world full of sinners into something better.”</p><br/><p>Ning Que looked at him and said, “What way?”</p><br/><p>Ye Su said, “Haotian will save us at the end of our lives, then who can save us during the process? We must save ourselves.”</p><br/><p>After a moment of silence, Ning Que said, “So you’ve taught those kids.”</p><br/><p>Ye Su said, “This is just the beginning.”</p><br/><p>Ning Que looked at him in the eyes and said, “According to the doctrine, Haotian is the only qualified one to save people. Your ideas and behaviors now will be considered blasphemous by Haotian.”</p><br/><p>Ye Su said, “We’ll be allowed to save ourselves if Haotian really loves people.”</p><br/><p>Ning Que watched him in the twilight, speechless.</p><br/><p>As time went by, if he could really make it in the end, this street covered by waste water might be turned into a sanctuary of Haotian Taoism, and he would be the Sage.</p><br/><p>Of course, there was a high chance that, this former Taoism Wayfarer would be tied on a stake, and burnt to coal by those priests in red from the West-Hill Palace.</p></div>\n</div>"}