{"title": "Chapter 853 - Sweet Potatoes Cool Easily", "id": 853, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-853-sweet-potatoes-cool-easily", "volume_title": "Volume 9", "body": "<h1>Chapter 853 - Sweet Potatoes Cool Easily</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ning Que, who was on the Peach Mountain, was able to find out what the oblation for the Light Sacrifice was. The Tang Empire, which possessed numerous intelligence systems would naturally find out about it, and might have even known about it before Ning Que did. However, Ning Que could only think about how to handle the matter now.</p><br/><p>He was basically certain that the news was released intentionally by the West-Hill Divine Palace. The Divine Hall wanted to force the people in the Academy, especially him, out of Chang’an. The Divine Hall thought that he was still in the city and this was a problem they could not resolve. He was so mad at the peak of the Divine Hall of Light because he was certain that the woman inside the hall had chosen Chen Pipi. The Divine Hall of Light sacrifices to Haotian, and since Haotian was in the mortal world now, then only Haotian could decide on its own oblation.</p><br/><p>Ning Que had mixed emotions. Many years ago, he had met with an attempt on his life by the Vermilion Bird’s Divine Talisman on the Vermilion Bird Avenue after killing Yan Suqing. He had not died on the spot thanks to the Big Black Umbrella. He would not have been able to survive, if he had not gained Chen Pipi’s help after escaping into the old library in the Academy and eaten the extremely precious Heavenly Power Pill. And then, he had been extremely fortuitous and rebuilt his Snow Mountain and Ocean of Qi; the pile of firewood that could not cultivate finally stepped on the path to cultivation. In other words, Chen Pipi had truly changed his fate, and in their later encounters, while he had not mentioned anything, Ning Que had never forgotten it either.</p><br/><p>He had told Sangsang once, that she had to help him remember that he owed Chen Pipi his life. He had done so because this was an important matter to him and he was afraid that he might forget. That was why he asked Sangsang, who never forgot anything, to help him remember it. It seemed that he had long forgotten those things.</p><br/><p>That night, Ning Que entered the precipice once more and scolded the woman in the Divine Hall of Light by the stone window, to make his stance and choice clear between his friend and his old lover. Then, he took out the plan he had amended earlier and explained it in front of the stone window. However, he could not help but stop shortly after he began.</p><br/><p>He did so, because Chen Pipi had refused to listen and did not turn around. He turned his back against Ning Que who was outside the stone window, whose face was illuminated by moonlight. Since he did not see Ning Que’s mouth nor the words on the letter, he could not hear them.</p><br/><p>Chen Pipi expressed his determined objection through silence. His Snow Mountain and Ocean of Qi had been sealed. In Long Qing’s words, he was now useless. So what right did he have to ask his Senior Brothers and Sisters at the Academy to risk themselves for him? What right did he have to ask Ning Que, his Younger Brother to risk his life for him?</p><br/><p>Ning Que looked at his broad back and fell silent for a moment. Then, he pointed his middle finger at him and said in a hoarse voice, “Do you think you’ll look good if they burn you into a puddle of fat?”</p><br/><p>Ning Que could use the powers of the Buddhism Sect he had learned from Master Qishan, and the moonlight shone upon the world thanks to his teacher, to counter the tactical array on the precipice. However, his current cultivation state could not open the precipice and rescue Chen Pipi from the You Prison. When Chen Pipi turned around, he could not even make him hear what he wanted to say. If he did not want to watch Chen Pipi die, he had to choose a different method.</p><br/><p>No matter the edge of the skies or the seas, when the Academy encountered a problem they could not solve, they would request help from their sect. Because to them, their relationship with the Academy was like that of Haotian and his believers. The Academy was omnipotent. Even though Ning Que and the others had become the source of confidence of the Academy after the Headmaster ascended to Heaven, he still wanted to ask his Senior Brothers for their opinions at a time like this.</p><br/><p>Ning Que left the Revelation Institute and walked on the stone bridge across the stream. He arrived at the little town once more, and handed a letter he had written to the Academy to the old man selling sweet potatoes. He hoped that he would receive a reply as soon as possible.</p><br/><p>“I don’t know what you guys are going to do, but be careful.” Said the old man selling sweet potatoes.</p><br/><p>Ning Que answered, “I have not thought of being able to leave the Peach Mountain alive since I am already here. Or perhaps, I have never thought of returning alone. Still, I don’t think anything will happen to me.”</p><br/><p>After settling his business, Ning Que took two sweet potatoes with him and left the town. The sweet potatoes were fresh from the oven and were very hot. Even though he was not worried that he would be burnt, he still switched them from hand to hand in order not to draw attention to himself. He looked rather funny.</p><br/><p>A horse carriage sped towards him. He looked at the white dressed girl in front of the carriage and thought of the day with a thunderstorm. He had encountered this horse carriage once. It had brushed by him and he had turned around to look at it subconsciously to see that the girl in the horse carriage was still as tall and plump. He could not help but have some sinister conjectures and felt happy for no reason.</p><br/><p>He dived down to the bottom of the precipice once more in the middle of the night, The Big Black Horse was still working hard on the cliff platform while Ning Que hung in front of the stone platform and tried to persuade Chen Pipi who was in the prison cell. However, no matter how much he tried, Chen Pipi did not turn around. Since he could not hear Ning Que’s voice, Chen Pipi could pretend he did not exist.</p><br/><p>“What is most important to us is that we need to have confidence. I know what you are worried about, but what’s there to be worried about? Teacher is watching us in the skies, don’t you even dare to try?”</p><br/><p>“Are you not worried that he’ll be angry? What if he is was fighting with Haotian while getting angry, and is distracted and then hit by Haotian?”</p><br/><p>“Teacher said you please the Heavens, which is why you could attain the Knowing Destiny State so easily. But how are you pleasing the Heavens now? Are you feeling inferior because you’re fat and don’t want to meet people?”</p><br/><p>“You’re so useless. I saw a rich girl these past few days. She’s unmarried, and is even fatter than you! And taller than Second Brother! She looks as if she got pregnant before she got married! But does she feel inferior?” “She travels around the world with her maidservant every day and buys a pile of high-calorie food like sweet potatoes! A pile! Do youknow how many sweet potatoes there are in a pile?”</p><br/><p>“It’s enough to feed the refugees in Hebei County back then! But she doesn’t care! Look at what she’s doing! That’s confidence!”</p><br/><p>There were dangerous clouds floating around the quiet precipice. Ning Que climbed to the stone window like a herbalist and talked earnestly to the window. Even though Chen Pipi refused to turn around and could not hear what he was saying, he grew more and more excited. He could not help but laugh rudely when he thought of the fat lady.</p><br/><p>There had not been any trace left behind by humans on the precipice for tens and thousands of years, and the West-Hill Divine Palace did not have any surveillance on the area. That was why Ning Que could speak as he wished. And even if his voice traveled upwards with the wind, it would become softer than the rustling of leaves once it reached the peak where the Divine Halls were. Not even powerhouses who were above the Five States would be able to hear him. As such, Ning Que was very assured. However, he had long forgotten that the woman in the Divine Hall of Light was not human.</p><br/><p>Sangsang stood on the balcony behind the Divine Hall of Light and looked at the ludicrous scene happening in the abyss below. She listened to the funny man saying ridiculous things, and she frowned slightly.</p><br/><p>The floor behind her was as smooth as jade, and on them, was a neatly piled stack of sweet potatoes. Not far away, were the skins of already devoured potatoes. She held an icy cold sweet potato in her hand.</p><br/><p>The holy and solemn Divine Hall of Light was crammed with urns of food and sweet potatoes. Even though those objects, including the trash, were all kept neatly and were filled with icy cold lines, they were still food. No matter how cold and orderly they were, they still had the unique taste of the mortal world.</p><br/><p>This was also the reason why she had become so angry after hearing what Ning Que said on the precipice.</p><br/><p>Countless stars ignited and burnt into oblivion in her eyes, and countless seas were set on fire and boiled. Her powerful will swept through the world with an angry fire, as if it was about to burn everything.</p><br/><p>Unlike the previous two times, the skies did not change due to her anger tonight, and lightning and thunder did not strike. She had already learned how to control things like her emotions.</p><br/><p>To cultivators or human beings, learning how to control their emotions was definitely a good thing. However, it was not for her. Because if one looked at it from a different point of view, it meant that she had started to grow used to the emotions in her subconscious, but she was not supposed to.</p><br/><p>Only humans needed something as useless as emotions. She was the order of the world and was objective and cold. She would not feel joy from the things around her, and did not feel sadness. When she started to feel hatred and anger or other emotions, and even learned to be used to them, what changes would occur?</p><br/><p>The sweet potato she held in her hand had already turned cold, just like the world and life that she had once been used to. She raised the potato to her lips and took a bite and realized the discomfort coming from her tongue and lips. She knew that this was because the potato did not taste good. Sweet potatoes were good only when they were eaten hot.</p><br/><p>She looked at the moon in the night sky and did not speak as usual. Her slender long eyes scrunched up lightly, just like how the willow leaves were folded up by the wind at Yanming Lake.</p><br/><p>She was Haotian who had been left behind on the mortal world. As the aura of the world grew cloudy, she wanted to return to the world and life she was familiar with. However, the door to the Kingdom of God had been destroyed and blocked by the moon. She could not clear the path blocked by the moon with her own strength.</p><br/><p>The Light Sacrifice held by the West-Hill Divine Palace was their attempt at trying to help her to clear the path to the Divine Land of Haotian. They had chosen Chen Pipi because of his pure bloodline, and the most pious belief of many generations of his ancestors. Also, he was the student the moon doted on the most.</p><br/><p>She looked at the moon and imagined what she would do once she returned to the Kingdom of God and felt slightly better. Then, she suddenly recalled that there were neither hot nor cold sweet potatoes in the Kingdom of God.</p><br/><p>Her mind suddenly cleared, and the alertness in her heart grew. She glanced at the sweet potato in her hand that had been heated up with Divine Light and frowned in displeasure. Then, she threw the potato off the balcony.</p><br/><p>The Divine Hall of Light was at the peak and below it, were three cliff platforms. Below them, were the precipice and the You Prison. The sweet potato did not fall into the abyss, but instead, fell on the third cliff platform.</p><br/><p>Ning Que, who was on the precipice, had, fortunately, escaped the fate of being the first person in history to have been struck to death by a sweet potato. The Big Black Horse was startled by the sweet potato that landed beside it. It looked at the sweet potato that splattered onto the ground and at the steam emitting from it. It smelled the fragrance coming from the potato flesh and thought of how he had worked hard for Ning Que over the past few nights, along with it his sad fate of not even having supper. He could not help but be thankful, and thanked Haotian incessantly for his gift.</p></div>\n</div>"}