{"title": "Chapter 866 - Chaos at the Peach Mountain", "id": 866, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-866-chaos-at-the-peach-mountain", "volume_title": "Volume 9", "body": "<h1>Chapter 866 - Chaos at the Peach Mountain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The middle-aged disciple asked, “How can human beings predict Haotian’s will?”</p><br/><p>“Haotian can predict anything, but she might not be able to predict her own future.”</p><br/><p>The Abbey Dean held onto his cup of tea, looking towards the Peach Mountain, as he said emotionlessly. In order not to let the figure in the Divine Hall of Light know about his arrangements, he chose not to think about what he wanted.</p><br/><p>If that person could return to Haotian’s Divine Kingdom and let the people from the South Sea return to Peach mountain, it can be said that the true descendants would be presiding over the Rite to Light. However, if she was unable to find her way back, the Rite to Light would be held in vain. West-Hill would have to consider their situation in the future. In that case, the people from the South Sea would become his supporters, and Chen Pipi would not need to be sacrificed.</p><br/><p>The middle-aged wondered, “How could she lose?”</p><br/><p>The Abbey Dean explained, “The Headmaster made her stay in the human world. If she is unable to cut away her bonds to the human world, she would naturally lose.”</p><br/><p>The middle-aged questioned, “Even if she failed to cut away her bond to the human world, she could still take our lives.”</p><br/><p>Answered the Abbey Dean, “Although she is in now the human world and is no longer the Haotian I used to believe in, she would still be objective and fair. After all I’ve done for Haotian Taoism, why would she kill me? I will survive because of my belief. No one can change that.”</p><br/><p>The middle-aged was still worried, “What about those people from the South Sea?”</p><br/><p>The Abbey Dean said, “If they survive, they will be the future of Taoism. Otherwise, may they rest in peace.”</p><br/><p>…</p><br/><p>Back at West-Hill, in the front yard of the Peach Mountain.</p><br/><p>The head of Revelation Institute asked Zhao Nanhai, “What are you trying to do?”</p><br/><p>After six hundred years, the descendants of the Great Divine Priest of South See could not be coming all the way back just to participate in the Rite to Light. Zhao Nanhai looked towards the Divine Hall of Light at the top of the Peach Mountain and answered with complex feelings, “We shall return to the Divine Hall of Light, and re-light the eternal lamp.”</p><br/><p>As their school was descended from the former Great Divine Priest, the School of South Sea was a legitimate branch of West-Hill. Since there was not yet a new Great Divine Priest of Light, they were justified to make a claim for the position.</p><br/><p>Most importantly, after hearing their chanting previously, people felt that these divine priests from the South Sea were indeed powerful enough to take over the Divine Hall of Light.</p><br/><p>Upon hearing their request, the Hierarch in the sacred sedan sat back upright again indifferently.</p><br/><p>If it was in the past, he would have frowned at their return, since they had the right to reclaim the Divine Hall of Light no matter in terms of rules or legacy. Yet he could not care less about such matters at this point. Although the eternal lamp had died out previously, as long as that figure stayed in the Divine Hall of Light, anyone else would have no chance to take it over. For them to even think about that would be the most ridiculous.</p><br/><p>The head of Revelation Institute turned to those from the South Sea and replied, “The inheritance of the Divine Hall of Light is a serious matter. Let us finish the rite first. We will look into it afterwards. Please stand aside for the time being.”</p><br/><p>Except for the Hierarch, no one was aware of the true purpose of this rite, not even the head of Revelation Institute. But being the grandest rite for the Haotian Taoism, it should never be interrupted by people like those from the South Sea.</p><br/><p>There was a young girl in the group form the South Sea, the one who swore to smash the Black Ink Garden when they passed by the Mogan Mountain. She mocked at the head of Revelation Institute, “You people from the Revelation Institute could not even recite the Anthem to Heaven properly. What makes you think you are qualified to host the Rite to Light? It is you who should stand aside.”</p><br/><p>Although he head of Revelation Institute was embarrassed by her claim, the fact that he was indeed not as good as those from the South Sea based on their earlier chanting showed that this was indeed the truth.</p><br/><p>Zhao Nanhai looked at the Hierarch in the sacred sedan and stated emotionlessly, “The Divine Hall of Light has been without a leader for almost twenty years. When West-Hill went to war with the Great Tang, they ended up in failure. The Great Divine Priest of Revelation had returned to the Divine Kingdom for months, yet no one has yet succeeded the position. The Hierarch is nothing but incompetent.”</p><br/><p>The audience went to an uproar. No one would expect them to attack the Hierarch on top of trying to reclaim the Divine Hall of Light.</p><br/><p>There were only a dozen of them from the South Sea. How dare they challenge the entire West-Hill? There were so many powerful cultivators gathered in the front yard of Peach Mountain. The West-Hill was far from being weak enough to be put down by such a group of people.</p><br/><p>The divine priests and deacons were infuriated by their criticism of the Hierarch. Some of them started challenging back. But the Hierarch remained silent. People wondered why he had not rebuked them – they did not know that he just did not care.</p><br/><p>Seeing that the Hierarch was still sitting calmly in the sacred sedan, Zhao Nanhai frowned to the fact that he was not as arrogant and easy to be irritated as people had said. He looked around among the guests standing by the altar, and seemed angry upon seeing the national master of the Golden Tribe and General Lebu. “Even barbarians from the Wilderness were allowed to participate. The West-Hill has gone too far.”</p><br/><p>Although he was mocking the Golden Tribe, but he was actually still mocking the West-Hill and the Hierarch. But before they could have challenged back, General Lebu was already on edge.</p><br/><p>Yet the national master simply replied with a smile, holding his wooden tripod.</p><br/><p>Zhao Nanhai apparently ranked the highest among all from the South Sea and had achieved the Knowing Destiny State. If the branch from South Sea were to take over the Divine Hall of Light, he would definitely be selected as the Great Divine Priest of Light.</p><br/><p>Seeing the intangible smile on the national master’s face, this leader from the South Sea frowned. His wrinkled face scrunched up even more.</p><br/><p>There was no wind in the front yard of Peach Mountain. Nor did the Qi of Heaven and Earth stir in response to any of these. Staring at each other, Zhao Nanhai and the National Master were waging a mental battle.</p><br/><p>That was a battle of their pure psyche, not using any weapons or even disturbing a single leaf. Others could not feel anything, but it was extremely dangerous for the two of them.</p><br/><p>The national master of the Golden Tribe had been practicing the use of psyche throughout his life and had acquired profound power via years of making offerings to the Heavens and his own meditation. Powerful in psyche as Ning Que was, he had almost failed when confronting this national master in the Wilderness. Although Zhao Nanhai had a high cultivation base, fighting a fierce battle with a powerful psyche as the national master naturally placed him at a disadvantage.</p><br/><p>Zhao Nanhai moaned slightly when some dim flash of light came out from his eyes and disappeared inches from his face. He had managed to withdraw from this battle using his divine skills.</p><br/><p>The national master looked away, still smiling silently and holding onto his wooden tripod.</p><br/><p>The battle between the two powerful experts, the national master of the Golden Tribe and the highest ranking descendant of the South Sea, started and concluded in complete silence. Zhao Nanhai had understood his disadvantage compared to the national master’s powerful psyche, but was still able to retreat without being hurt. That was also a proof of his high level of cultivation in Haotian Taoism.</p><br/><p>Most of the audience were not aware of the battle just happened in a blink of time. But General Lebu was more than aware. He could not forget the humiliation, and took one step forward to strike out.</p><br/><p>Being the number one martial artist in the Golden Tribe, Lebu was as strong as an iron man. One simple hit from him would have shaken the earth. At that moment, his strike carried along with it the Qi of Heaven and Earth and pointed directly at the group from the South Sea.</p><br/><p>While Zhao Nanhai was busy staring at the national master, he could not react to this invasive hit. But a very thin figure from their group stepped out and hit an equally simple strike.</p><br/><p>Different from the previous silent battle, the strikes from Lebu and the thin man had caused roaring winds and thundering sounds to arise around the altar.</p><br/><p>A huge bang was heard when the two strikes met in the air. The peach petals which previously landed on the altar were blown up and ground into dust.</p><br/><p>The ground in front of the altar looked as if it had gone through years of drought. Numerous deep cracks were formed as if the ground was about to collapse into an abyss.</p><br/><p>The thin man stepped back with a silent moan. His bamboo hat broke apart and scattered on his head and face.</p><br/><p>General Lebu did not step back. He just shook for one second, before pulling back his fist. He taunted the group, “Is that all the Great Divine Priest of South Sea had taught you?”</p><br/><p>Zhao Nanhai looked at the national master of Golden Tribe and stated, “No wonder you could have stood up to the Tang Empire for years. Impressive indeed.”</p><br/><p>Still, it was not the national master who seemed most impressive to the audience. They already knew how powerful the Golden Tribe was throughout their years of resisting the Great Tang. What they were surprised by was how powerful those from the South Sea actually were.</p><br/><p>Although they did not win from the previous rounds, the audience could tell that if Zhao Nanhai tried his best, there was a chance that he would have won.</p><br/><p>As for that thin man who stood up against General Lebu, he was only the sixth in the group. If they were lined up according to their cultivation levels, did that mean they were almost all powerful as or even superior to Lebu? Lebu was supposed to be the most powerful man in the Golden Tribe!</p><br/><p>If the group from the South Sea was indeed that powerful, the West-Hill might have just found themselves in some serious trouble. How would the Hierarch handle this?</p><br/><p>The Hierarch still remained silent. After all, there was someone else who was responsible for resolving such disputes from the Divine Hall of Judgement.</p><br/><p>Right at that moment, the young girl from the group looked up to the Sacred Sedan of Judgment and stared at the beautiful woman sitting inside the blood-colored gauze. She questioned, “Are you Ye Hongyu?”</p><br/><p>Ye Hongyu did not respond. Instead, a deacon from the Judicial Department replied coldly, “Her highness is the Great Divine Priest of Judgment. Be quick if you have anything to say.”</p><br/><p>“So you are the current Great Divine Priest of Judgment.” The girl looked up and down upon the sacred sedan and seemed to find the color distasteful. She then said, “Get down from there. I’m taking over.”</p><br/><p>The audience burst into an uproar again. After Zhao Nanhai challenged the Hierarch’s authority, no one would have expected such a young girl to have the guts to also challenge Ye Hongyu’s position.</p><br/><p>…</p></div>\n</div>"}