{"title": "Chapter 864 - A Unique Oration of Rite", "id": 864, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-864-a-unique-oration-of-rite", "volume_title": "Volume 9", "body": "<h1>Chapter 864 - A Unique Oration of Rite</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>She stood inside the Divine Hall of Light with her hands clasped behind her back. She watched Chen Pipi making a scene in the front yard of Peach Mountain as he was about to take off his trousers. She did not find that interesting, only ridiculous.</p><br/><p>She remembered Chen Pipi. She met him several times in the City of Chang’an, and even cooked noodles for him before. He had the purest blood from Taoism. Although he had been with the Academy for many years, he still had respect for Haotian deep down his heart. Still, he had doubts.</p><br/><p>Teachers and students of the Revelation Institute stood in the front yard of Peach Mountain, together with dozens of servants. Ning Que, who was standing in the crowd, saw what had just happened there and could not help but feel worried.</p><br/><p>That night, Ye Hongyu had let him leave the Divine Hall of Justice. That implied something. Furthermore, for the sake of her brother, Ye Su, she should remain neutral. However, she was the Great Divine Priest of Judgment after all. How could she tolerate that damn fatty humiliating her in front of the tens of thousands of people here?</p><br/><p>Other than Ning Que, there were others who were also worried, such as the head of Revelation Institute. People in the Divine Halls knew how horrifying the Great Divine Priest of Judgment could be. If she was seriously offended, she could easily have him killed even before the ritual starts.</p><br/><p>The head of the Revelation Institute did not dare to look at her Sacred Sedan. He ordered the divine guards to drag Chen Pipi onto the altar. Upon receiving permission from the hierarch, they started the rite as quickly as possible.</p><br/><p>They did not announce Chen Pipi’s crimes and started the sacrificial ceremony immediately. The head of Revelation Institute held the golden book and read out the Anthem to Heaven. The Anthem was mainly about Haotian’s profound blessing towards the human world. It was recognized as the most important one out of the Three Sacred Anthems.</p><br/><p>The Anthem to Heaven was the official oration for the Rite to Light held today.</p><br/><p>The head read through the oration with devoutness, calm and sincerity. The teachers and students at the Revelation Institute chanted after him harmoniously, sentence by sentence.</p><br/><p>Tens of thousands of followers started following the head’s chanting like the teachers and students. It was unclear whether this was a spontaneous action or if they were directed to do so by the priests on the grounds.</p><br/><p>Their chanting became louder and louder. Like the waves on the sea becoming stronger with each successive wave, it kept a perfect rhythm, resounding throughout Peach Mountain, as if it was meant for the Heavens high above to hear.</p><br/><p>Chen Pipi sat on the white stone altar, holding up the bowl of water given to him. He felt regretful for being unable to infuriate Ye Hongyu to kill him. Just as he was about to drink some water, he heard the waves of chanting resounding from Peach Mountain and stiffened.</p><br/><p>He was born into a Taoist family and had been able to recite all those scriptures since young. He knew that it was going to be a long one, and that they had just finished the first two paragraphs filled with respect and affection for Haotian. The following paragraph would be about the blessings that Haotian had given to the human world.</p><br/><p>He stiffened not because he subconsciously wanted to recite the scripture as well, but because he sensed some indescribable pressure, an extremely powerful pressure that did not belong to this realm.</p><br/><p>The pressure did not come from the chanting of the followers, instead it seemed to have been summoned from above. coming from Heaven.</p><br/><p>Chen Pipi looked up at the sky. The cold and dim autumn sun became dazzling and bright lights poured down to the white stone altar and onto his body. Within the lights there was the purest and mightiest power. That was where the pressure came from.</p><br/><p>It seemed to have pressed him down into the white stone altar. Initially, he was just sitting on the altar, but now he felt his bottom already melted into the hot white stone.</p><br/><p>His face paled and he frowned. The bowl in his hand broke into pieces under the radiating lights, and water splashed all over his body.</p><br/><p>When facing great pressures from the Heaven, people tended to either surrender or escape. Chen Pipi did not want to surrender and tried to get away, only to find himself unable to move any further. It was already difficult enough for him to keep looking up. He felt sore in the neck.</p><br/><p>He was able to sense his Ocean of Qi and Mountain of Snow again. But that was nothing to be happy about. It was not a recovery, but the beginning of his ultimate demise.</p><br/><p>Although his Ocean of Qi and Mountain of Snow was already destroyed, he was still optimistic because he had witnessed how Ning Que found his path to cultivation. If Ning Que could make it, a genius like him would definitely be able to recover. He had believed that he would be able to re-establish his Ocean of Qi and Mountain of Snow. But he realized at that point that was only an illusion when facing the almighty Haotian.</p><br/><p>Chen Pipi kept looking up and saw the increasingly bright lights falling onto his body. Although he did not know what the last step for the rite was, he intuitively depicted that he would melt away and then disappear from this world.</p><br/><p>Ning Que had been staring at him from the crowd. He looked over the shoulders of the servants and stared right at the white stone altar. The sacred lights were reflected in his eyes, dancing around constantly. He knew Haotian well enough to knowthat when the oration was finished, those bright lights on the white stone altar would become the purest sacred flame of Haotian, the so called divine flame. And Chen Pipi would be burnt into ashes in a blink.</p><br/><p>Since he saw Chen Pipi from behind the stone windows down in the cliffs, he had been thinking of how to get him out. He could not stand by and watch Chen Pipi burn to death. But he could not work our any better plan than waiting for the change his Senior Sister had mentioned. However, that change was not happening and Chen Pipi was dying. He could wait no more. Then, he inhaled deeply and got ready to go.</p><br/><p>Breathing created noise, and as a high-ranking cultivator from the Devil’s Doctrine, Ning Que’s breath was extremely powerful. As he put all his effort into that earlier breath, it sounded like a strong gust of autumn wind blowing by.</p><br/><p>Those servants and the head of Revelation Institute vaguely heard Ning Que inhale. But another sound grabbed their attention before they could react to it.</p><br/><p>Ning Que also heard that other sound. Therefore, he exhaled immediately and adjusted his aura, staying low and continuing to pretend to be an ordinary servant boy.</p><br/><p>That sound had come from outside the front yard. Some people were also chanting the Anthem to Heaven, with the same content, and almost the same rhythm. There were only tiny differences in some sentences in a few paragraphs.</p><br/><p>Yet because of those tiny differences, their chanting became distinctly discordant. It was like a perfect and harmonious movement being interrupted by the sound of knocking bamboos.</p><br/><p>The other chanting continued calmly and reached all the way to the Peach Mountain. The chanting of the many followers was interrupted, and those on their knees turned to looked back towards the sound.</p><br/><p>The sound of solemn chanting instantly diminished. Only the teachers and students from the Revelation Institute persisted in their chanting as a way of resisting the sound from below the Peach Mountain.</p><br/><p>There came a group of people, young and old, male and female. They had dark skin and wore bamboo hats as though they were fishermen. Yet, they were all wearing the very distinct sacred red gowns.</p><br/><p>These dozens of fishermen-looking priests in red lined up and walked with a slow but consistent pace. If someone looked at them from in front, they would have only seen the elder male who was first in line.</p><br/><p>The distinctive chanting came from these people. They sounded like one single entity even though there were over ten of them. Compared with the chanting from the Divine Halls, this was a true perfection of harmony.</p><br/><p>Upon the arrival of these people, a clear light appeared from the first array shielding the Peach Mountain. But the elder did not stop, nor did he have any expression on his face. Their chanting was not disturbed at all. Lines from the Anthem to Heaven continued to be read.</p><br/><p>The clear light of the first array dimmed without showing any resistance. Those fisherman-looking priests in red had stepped onto the front yard of the Peach Mountain. Chasing after them were dozens of Papal Cavalrymen. Divine guards also rushed in after. However, looking at the scene, none of them knew what to do next.</p><br/><p>Those red gowns were indeed authentic pieces from the Divine Halls. More importantly, even the array of clear lights had granted them entrance. Only those most devout to Haotian and carried the most genuine heritage would have been able to walk through the array so easily.</p><br/><p>The people in the front yard rose up and cleared a way for the group. The group continued making their way directly toward the Peach Mountain, with sacred devoutness and firmness. They worshipped Haotian no less than those people from the Divine Halls, but in a different way.</p><br/><p>The head of the Revelation Institute looked at this group of people and turned pale. They had suppressed the chanting of tons of followers and numerous priests with their single voice. It was not because of their high level of cultivation, but rather, their better understanding of the anthem. That meant they had a more thorough understanding of the teaching of West-Hill than the head himself, and perhaps even better than the Hierarch. But he could not understand why. Who were they? And why were they doing it so well?</p><br/><p>The other guests were equally surprised. They looked at this strange group in the sacred red gowns, trying to figure out where they came from and their purpose here.</p><br/><p>Qi Nian was the World Wayfarer of Buddhism. He had read many secret stories of cultivation when he was at the Xuankong Temple. Looking at these fisherman-looking priests in red, he frowned as he considered one particular possibility.</p><br/><p>“Could it be possible that the Great Divine Priest of South Sea has descendants?”</p><br/><p>This group of people proceeded slowly to the white stone altar and stood in a straight line, facing Chen Pipi and continuing with their calm and devout chanting of the Anthem of Heaven.</p><br/><p>The voices of people from the Divine Halls became softer and softer until they could almost not be heard. The bright lights on the white stone altar were converted from pressure to sympathy, and eventually benevolence.</p><br/><p>…</p></div>\n</div>"}