{"title": "Chapter 879 - Impossible as Ants to Shake a Mighty Tree, I Have become Invincible! (I)", "id": 879, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-879-impossible-as-ants-to-shake-a-mighty-tree-i-have-become-invincible-i", "volume_title": "Volume 9", "body": "<h1>Chapter 879 - Impossible as Ants to Shake a Mighty Tree, I Have become Invincible! (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the front yard of Peach Mount there was an uproar. No one was willing to believe this. They had all been waiting for someone from the Academy to show up. But none of them knew that he had been there in the crowd all along.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>When Ning Que pulled his bow and shot an arrow toward the huge figure in the giant sedan, people exclaimed with more dread. They all knew how terrifying his arrow could be.</p><br/><p>Years ago in the Wilderness, Ning Que used an iron arrow to paralyze Prince Long Qing, who was already stepping into the state of Knowing Destiny. Ning Que was merely at the state of See-through at that time. In the present however, not only had he become a Knowing Destiny, but he had also just stolen the most powerful Tianqi in history and surpassed the Five States. How devastating would his iron arrow be now?</p><br/><p>In fact, before the crowd went into an uproar, the Hierarch in the giant Sedan had sensed the danger. After all, he was the most powerful cultivator present at the front yard of Peach Mountain.</p><br/><p>Pulling himself back from being stunned previously, he shouted out, waved his newly grown palms swiftly above, and generated ten bouts of distinctive Qi in front of the sedan.</p><br/><p>These bouts of Qi were of irresistible prestige as divine rules under the heaven. It could be used as guidance to anything in the human world, namely the Heaven’s Rules.</p><br/><p>After severely wounded in the lower abdomen by Yu Lian years ago in the Wilderness, the Hierarch had become a eunuch and relinquished his carnal desires ever since. He cultivated with the Heaven’s Rules along the years until it had become his natal skill.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>He was truly the master of the Divine Halls of West-Hill. Although the Tianqi of Haotian’s Divine Power was stolen by Ning Que, the Hierarch still held unfathomable power and a high state, and was never an easy prey.</p><br/><p>Even he had adopted the Heaven’s Rules, the Hierarch did not dare to try to control Ning Que’s iron bow and arrows. It was because Ning Que had acquired the magnificent Haotian’s Divine Power and made the leap beyond the threshold of the Five States. His power was beyond this world. The Heaven’s Rules had control over any in this world, but not beyond.</p><br/><p>Therefore the Hierarch chose to control the divine priests and deacons of West-Hill under his giant sedan. Ten bouts of Heaven’s Rules descended to the crowd. People there suddenly turned pale when they lost control of their own bodies. The dean and deputy-dean of Revelation Institute and over a dozen of red-robed divine priests were placed in front of the giant sedan.</p><br/><p>It was then that Ning Que’s iron arrow just left the bowstring.</p><br/><p>No sound was heard when the iron arrow left the bowstring until it came in front of the giant sedan. It made a horrifying bang when shooting into the first red-robed divine priest who was immediately blown up into a bloody mist. It proceeded to the second red-robed divine priest who was again blew up into a mist of blood.</p><br/><p>Over a dozen of red-robed divine priests and the dean and deputy dean of Revelation Institute were floating in the air between Ning Que and the giant sedan. Upon a black bolt they were all blew up into mist of blood.</p><br/><p>Everyone in front of the giant sedan was killed, including Mo Li, the deputy dean of Revelation Institute and their dean who was already a Knowing Destiny. They were blown up before they could even react.</p><br/><p>Then the arrow pierced into the giant sedan.</p><br/><p>Layers of gauze was scattered into the sky. Radiating lights were dimmed like an oil lamp in storm. The giant sedan was smashed into pieces and the Hierarch’s wretched and skinny body was revealed.</p><br/><p>After employing the Heaven’s Rules, the Hierarch could only fall to the ground. He would have done anything to escape from that horrifying iron arrow. How could he possibly care about the dignity of Taoism?</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The iron arrow was too fast. Though it slowed down a bit after blowing up a dozen of divine priests and smashing the giant sedan, it was still too fast for anyone to predict.</p><br/><p>When the iron arrow came to the Hierarch, he was only able to slightly bend his knees and lean his body. His palms were barely reaching out so he failed to avoid the attack.</p><br/><p>He was terrified and his pupils shrank.</p><br/><p>Upon two bangs, his right palm was blown up and right shoulder followed next. Every part bursted into a bloody mist upon being hit by the iron arrow.</p><br/><p>One of his original palms was chopped by Xu Shi in Xiao Mountain, and the other was taken by Yu Lian at the Academy’s Back Hill. It was only because of Haotian’s bestow that his palms could grow back. But now they were gone again.</p><br/><p>He also lost his right shoulder, which was replaced by a scary bloody breach.</p><br/><p>The Hierarch yelled a miserably and looked like a bloody maniac.</p><br/><p>Yet the iron arrow did not stop after destroying the giant sedan. It flew away from the front yard and arrived atop the Peach Mountain in a split second, pointing into the Divine Hall of Light.</p><br/><p>…</p><br/><p>…</p><br/><p>Though the black iron arrow looked simple and ordinary, no one was able to stand in its way despite being cultivators of the See-through or the Knowing Destiny. They could do nothing except being blown up into blood mists. Even the Hierarch was severely wounded. How could a single arrow shot be so powerful?!</p><br/><p>It was shocking but not unexpected. No one was surprised because the Thirteen Primordial Arrows were the joint creation by all the wise cultivators from the Academy’s Back Hill. It was a production of Tang Empire’s national power. It had proved itself in previous battles to be a horrifying killing weapon that surpassed any states.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ning Que was already bestowed with Tianqi and possessed unlimited Divine Power. Even if the Hierarch was in his glorious days he would have not been able to take this arrow shot, let alone anyone else in front of Peach Mountain.</p><br/><p>People at the front yard thought that if Ning Que’s arrow was pointed at the Peach Mountain instead of the Hierarch in the giant sedan, the whole Peach Mountain would have collapsed.</p><br/><p>The Thirteen Primordial Arrows were unique throughout heaven and earth.</p><br/><p>As powerful as Ning Que and his iron arrow were, it was unexpected for the Hierarch to be able to survive the shot.</p><br/><p>Although the Hierarch was seriously wounded, he was still alive. A powerful cultivator at his state could never be underestimated as long as he was still breathing.</p><br/><p>Ning Que did not find it unexpected because he had a different perception. The Thirteen Primordial Arrows were nothing like ordinary arrows which were more powerful when being shot from closeness. They could be much more unpredictable and horrifying when shot from a far distance.</p><br/><p>As long as the arrow had a specific target, it could destroy the target from mountains and oceans afar because no one could avoid his arrow without being prepared. But when the opponent could see his arrow coming, they could react in advance by observing and predicting his movements. That was why he failed to kill Ye Hongyu previously. Although he was at his strongest state, this principle could not be changed.</p><br/><p>He was standing too close to the giant sedan and the Hierarch was able to see his movement clearly. Being a powerful cultivator, the Hierarch was definitely able to react precisely.</p><br/><p>In fact he would have missed him if he did not point lower at the Hierarch. This was the lesson he learned from the previous shot made to the Hierarch that was missed when they were in the Wilderness.</p><br/><p>It was not a pity to him that the Hierarch survived his shot. In the Academy’s plan, it did not matter whether the Hierarch was alive or not. Liu Bai’s sword was also just a lead. It led to the most important part of the show, the magnificent Tianqi, and his seizure of Haotian’s Divine Power and their union.</p><br/><p>He knew that he had succeeded and was very satisfied.</p><br/><p>Up until then, no one was able to figure out when Ning Que had come to Peach Mountain or why Ning Que was bestowed with Haotin’s majestic Divine Powers even though it was the Hierarch who called for Tianqi. How was he able to become the youngest cultivator in the world to surpass the Five States?</p><br/><p>But the other powerful cultivators were all aware of one thing for sure, that they could not allow Ning Que to shoot another Thirteen Primordial Arrow. If he could make it again, no one in front of Peach Mountain would survive.</p><br/><p>The first to react was the national master of Golden Tribe, the Great Divine Priest of Tripod. Because he was the highest in state, he was a priest and he cultivated on psyche.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Priests were those with the steadiest state of mind. And the fastest weapon in the world was psyche. It could be faster than any action, whether it be Ning Que pulling his bow or Liu Bai swinging his sword.</p><br/><p>When the national master of Golden Tribe stared at Ning Que, the wrinkles on his face deepened. His psyche then entered Ning Que’s ocean of consciousness, arose terrifying waves and thundering surfs and attacked continuously.</p><br/><p>Colors drained from Ning Que’s face like when they met in the Wilderness last year. He felt disturbance in his ocean of consciousness, and his right arm got rigid when he tried to obtain an arrow from the case.</p><br/><p>Ning Que had acquired the strongest Psyche Power among cultivators. But he was after all not a psyche master nor had cultivate with any Psyche Skills. He was disadvantaged in front of the national master who had cultivated Psyche Skills for decades.</p><br/><p>Yet with his body and soul that have been bestowed with Haotian’s majestic Divine Power, how could he be easily defeated as he was back then? With a blink of an eye, he cleared the disturbance in his ocean of consciousness and left his psyche with pure tranquility.</p><br/><p>Right then a bout of vast power descended and attacked towards the top Ning Que’s head.</p><br/><p>Ning Que knew this bout of power. When he looked up, he saw the figure of a Buddha statue, with his robe floating and Buddha’s glory shining, compassionate yet chilling.</p><br/><p>Deep in the glory of Buddha, Qinian from Xuankong Temple sat in padmasana with his lips slightly opened.</p><br/><p>The statue was Qi Nian’s Dharmakaya of Acalanatha. What he chanted was the genuine Buddhist Mantra.</p><br/><p>The two together formed the most powerful Buddhist Mantra and Mudra.</p><br/><p>Years ago in Lanke Temple, Ning Que suffered a lot from Qi Nian’s Buddhism Mantra and Mudra. He had practiced Mantra and Mudra but not Dharmakaya so he was no match to Qi Nian at that time.</p><br/><p>However, he was different now.</p><br/><p>Ning Que’s right hand was in the middle of obtaining an arrow. He could not pull it back in time, so he turned it towards above instead!</p><br/><p>The Dharmakaya of Acalanatha looked furious with slanting blade eyebrows and thunderbolt in his eyes. His giant palm was pressing swiftly toward the ground.</p><br/><p>Autumn trees around the front yard trembled in the bout of awe-inspiring Buddhist power. Red and yellow leaves drifted off from the trees.</p><br/><p>Ning Que’s palm seemed tiny and powerless in front of the giant palm of the Dharmakaya of Acalanatha.</p><br/><p>When the two palms clashed, the Qi of Heaven and Earth in the front yard of Peach Mountain scattered in all directions.</p><br/><p>With a big crash the Dharmakaya of Acalanatha was smashed into innumerable pieces.</p><br/><p>Ning Que destroyed this seemingly indestructible Dharmakaya of Acalanatha with Haotian’s Divine Power!</p><br/><p>A bout of Haotian’s Divine Flame came from the side.</p><br/><p>Without turning around Ning Que figured out it was Zhao Nanhai’s sneak attack.</p><br/><p>Without paying any attention, he clenched his right fist which had just smashed the Dharmakaya in the autumn breeze. The fist was clenched loosely so that it could get hold of the hilt of the iron blade.</p><br/><p>He brandished his iron blade toward Qi Nian from some distance.</p><br/><p>Upon a chilling whistle the iron blade became burning red and generated a terrifying flame.</p><br/><p>Though Qi Nian had not managed to achieve Buddhahood, his body was already as firm as a rock. Yet he was still not able to take a single strike from Ning Que’s blade.</p><br/><p>His robe was smashed. A wretched gash was made on his body.</p><br/><p>But neither Ning Que’s iron blade nor the chilling whistle was stopping.</p><br/><p>From within the flaming blaze, a Vermilion Bird appeared.</p><br/><p>The iron blade hewed toward the national master of Golden Tribe.</p><br/><p>With his eyes slightly closed, the national master lifted his ordinary-looking wooden tripod.</p><br/><p>The Vermilion Bird whistled again.</p><br/><p>The wooden tripod was burned black and cracked.</p><br/><p>In a flash, the national master seemed to have aged several decades and blood gushed from his mouth.</p><br/><p>At that moment the Haotian’s Divine Flame from Zhao Nanhai fell upon Ning Que.</p><br/><p>Ning Que seemed unaware and turned to look at this descendant of the Great Divine Priest of South Sea who was already at the peak of Knowing Destiny State. The iron blade attacked with overwhelming power and Zhao Nanhai was hurled miles away.</p><br/><p>“Stupid,” he commented.</p><br/><p>With his body purified by Haotian’s Divine Power, how could he be wounded by Haotian’s Divine Flame?</p><br/><p>It was deadly quiet in the front yard of Peach Mountain.</p><br/><p>Ning Que felt his body as well as the iron blade in his hand, burning.</p><br/><p>As they stopped him from shooting the Thirteen Primordial Arrows, he had to use his iron blade.</p><br/><p>He drew his blade three times, and three people were badly wounded.</p><br/><p>One was Qi Nian, the World Wayfarer of Buddhism.</p><br/><p>Another was the national master of Golden Tribe, the Great Divine Priest of Tripod.</p><br/><p>The last one was the stupid Zhao Nanhai.</p><br/><p>No one could believe what they had just witnessed.</p><br/><p>But it was real.</p><br/><p>…</p></div>\n</div>"}