{"title": "Chapter 876 - Cutting the Bond", "id": 876, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-876-cutting-the-bond", "volume_title": "Volume 9", "body": "<h1>Chapter 876 - Cutting the Bond</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>No one else had arrived at the front yard of Peach Mountain so far.</p><br/><p>The three disciples of the Academy did not come.</p><br/><p>Chen Pipi stood on the altar, looking towards the direction where Tang Xiaotang came from and smiled to her, “It seems our Brothers and Sisters were stuck by some matters. I think you should leave first.”</p><br/><p>“I can’t leave now.”</p><br/><p>Tang Xiaotang smiled back, and then turned to the blood-colored Sacred Sedan of Judgment. She switched to a serious look and asked, “What are you waiting for?”</p><br/><p>No one could understand why she had chosen to challenge the Great Divine Priest of Judgment. Only herself, Ye Hongyu, and Ning Que who was still hidden in the crowd knew that that was from a promise years ago in the Wilderness.</p><br/><p>At that time Ning Que, Mo Shanshan and Ye Hongyu had just come out of the Front Gate of Devil’s Doctrine. On the ropeway, they found a snow white puppy in a basket as well as Tang Xiaotang, who had gone there in search of her dog.</p><br/><p>The four of them traveled through the rocky valley carved out by predecessors from the Devil’s Doctrine. They cursed badly on each other, but none of them could beat Ning Que, the disgrace of the Academy.</p><br/><p>Ning Que looked at the blood-stained Tang Xiaotang who was still holding her iron stick. All of a sudden he remembered the first time they met her. At that time, they had heard her voice before seeing her in the foggy valley. She had yelled, “Who dares to touch my dog!”</p><br/><p>Today at the Rite to Light in the Peach Mountain, she had once again yelled, “Who dares to kill my man?” It seemed Chen Pipi was no less important to her than the white wolf dog at that time.</p><br/><p>He could not help but laugh while remembering the incident. The other footboys found him very weird, as they wondered, How could you still be so cheerful in such a situation?</p><br/><p>Ning Que mood was actually not cheerful at all, as he thought about Shanshan, away in the Great River Kingdom, and Ye Hongyu in the sacred sedan. Back then, they were in their prime. Now, after a few years had passed, they were still young, but no longer the youngsters they used to be.</p><br/><p>Ye Hongyu looked at Tang Xiaotang outside her sedan and smiled.</p><br/><p>She did not waste any time talking.</p><br/><p>Her natal sword buzzed, eager to get out of its sheath.</p><br/><p>Almost at the same time, as though hearing that signal, the swords of the deacons of Divine Hall of Judgment were drawn.</p><br/><p>Dozens of swords flew out and encircled Tang Xiaotang immediately.</p><br/><p>Tang Xiaotang wielded her roaring iron stick and hit the dozens of swords onto the ground at a speed that no one could follow.</p><br/><p>Continuous clicking sounds were heard in front of the altar, like some cheerful music.</p><br/><p>Ye Hongyu’s natal sword was the last to arrive in front of the altar, and it stabbed directly towards Tang Xiaotang’s face.</p><br/><p>Tang Xiaotang shouted out with a clear yell and pulled back her iron stick swiftly, barely managing to ward off the sword.</p><br/><p>Rather than a stick hitting a sword, it was more like a sword cutting an iron stick. The sword was not damaged in the least, but the iron stick trembled uncontrollably.</p><br/><p>Tang Xiaotang turned pale, as blood leaked out of the corner of her mouth. She had been seriously wounded previously. Taking the hit from Ye Hongyu’s natal sword, her former injuries seemed to all open up again.</p><br/><p>But she was still fearless. Looking at the sword flying above, she held tighter to her iron stick.</p><br/><p>But that sword did not stab towards her again.</p><br/><p>Inside the sacred sedan, Ye Hongyu said coldly, “You can try hit me again after you figure out how to break out of my Confinement.”</p><br/><p>Only then did Tang Xiaotang realize that the swords she had previously warded off had all been inserted into the stone ground, forming some straggly fence.</p><br/><p>Some very strong energy arose from the fence of swords.</p><br/><p>That was the highest-level array of West-Hill’s Divine Hall of Judgment: the Confinement.</p><br/><p>How could she break out of the Confinement? Tang Xiaotang did not expect that Ye Hongyu had reached such a high level. But she knew that by confining her, Ye Hongyu was actually showing her mercy.</p><br/><p>But she was not pleased.</p><br/><p>Stuck in the confinement of swords, she shouted at Ye Hongyu in the sacred sedan, “I wanted a real fight!”</p><br/><p>Ye Hongyu did not bother answering her.</p><br/><p>Many others were not pleased either. The elder divine priests from the West-Hill Divine Halls thought that the head of Divine Hall of Judgment was too soft hearted toward Tang Xiaotang. There was one person who was even more irritated. Ye Hongyu had just killed one of her martial uncles and wounded the other. Yet now she was showing mercy to this evil girl from the Devil’s Doctrine!</p><br/><p>Little Yu from the South Sea accused, “Who would have expected the head of Divine Hall of Judgment to be friends with this evil girl from the Devil’s Doctrine. If you won’t kill her, I’ll do it for you!”</p><br/><p>Upon these words, a very thin sword came up from behind her, toured a half circle round the front yard of Peach Mountain, got through the fence of swords and stabbed to Tang Xiaotang directly.</p><br/><p>She deserved her fame of a genius in Taoism who had reached Knowing Destiny State at the age of seventeen. A simple sword strike like that possessed exceptional power. What was more scary was that it had actually flown through the fence of swords!</p><br/><p>Ye Hongyu was a little surprised as this girl was able to pierce through her Confinement. It seemed that when the former Great Divine Priest of South Sea left the Peach Mountain, he did not only take away teachings from the Divine Hall of Light, but also from the Divine Hall of Judgment.</p><br/><p>Tang Xiaotang was concentrating on challenging Ye Hongyu in the sacred sedan, and she never expected someone beside her like this girl from the South Sea to launch such a sudden and powerful attack. She hurried to deflect the sword and avoid the danger.</p><br/><p>As her iron stick was kicked away, there was a clear ringing sound, and Tang Xiaotang vomited a mouthful of blood.</p><br/><p>Little Yu from the South Sea immediately controlled her sword to spin another half circle, before again aiming at Tang Xiaotang.</p><br/><p>It seemed no one could ever save her from this.</p><br/><p>Chen Pipi looked pale. His chubby figure was trembling and about to fall.</p><br/><p>Then, there was a sudden flash of a sword.</p><br/><p>Little Yu from the South Sea grunted, and blood began to leak out from the corner of her mouth. She struggled to pull back her natal sword.</p><br/><p>Before anyone could react to it, the bright sword flashed downwards and swept by Little Yu’s cheek. She struggled to block it, but was unsuccessful.</p><br/><p>There, on the cheek of this South Sea girl, a bloody sword wound was made.</p><br/><p>The radiant sword flew back to the sacred sedan.</p><br/><p>Inside the sacred sedan, Ye Hongyu’s cold voice sounded out again.</p><br/><p>“This is a fight between me and her. How dare you to step in?”</p><br/><p>Seeing that Tang Xiaogang was bleeding but not fatal wounded, Chen Pipi finally felt relieved and collapsed onto the white stone altar.</p><br/><p>He looked at the Sacred Sedan of Judgment, rubbing on his chest as he complained, “Why couldn’t you stop her earlier? You had to scare me to death like this?”</p><br/><p>Inside the sacred sedan, Ye Hongyu frowned as she thought, Still that annoying fat boy.</p><br/><p>Chen Pipi was obviously grateful, yet he was still complaining. Ye Hongyu had wanted to kill him all these years. Yet, at that moment, she could not hold herself back from saving the woman he loved. It seemed that all the hatred and resentment from childhood memories would always evolve into something beautiful and fascinating when people grew up.</p><br/><p>…</p><br/><p>Ning Que was not expecting their three senior Brothers and Sister to show up, as people from the West-Hill Divine Halls were. They had never been part of the Academy’s plan to begin with. What he was waiting for was the change.</p><br/><p>When Eldest Brother reviewed the plan Ning Que and Fourth Brother had made, he questioned about the most crucial part. Ning Que was not able to provide any answer, as he did not know how that change would happen. But Yu Lian had told them that the opportunity could not be created, but would follow according to the everchanging flow of things.</p><br/><p>When Liu Bai’s sword broke through the clear light arrays and hung there, pointing humbly at the Divine Hall of Light, he thought that was the change Senior Sister mentioned about. When the descendants of the former Great Divine Priest of South Sea barged into the front yard of Peach Mountain and started challenging the West-Hill Divine Halls, he thought that might be the change. When Tang Xiaotang had broken through the three arrays and fought her way to the altar, he thought again that that might be the change. Yet nothing had really changed, and the chance he had been waiting for had not arrived.</p><br/><p>He could barely wait any longer. When Chen Pipi was being burnt by Haotian’s divine flame, he had almost stepped out. When the girl from South Sea suddenly attacked Tang Xiaotang, he was already on his edge. He knew that Chen Pipi was actually complaining about him instead of Ye Hongyu.</p><br/><p>However she was still up there on top of the Peach Mountain, inside the Divine Hall of Light. He would never have a chance to defeat her if that change Yu Lian mentioned did not happen. Yet what would the change be?</p><br/><p>…</p><br/><p>Sangsang was standing in front of the Divine Hall of Light emotionlessly. She was no longer reminiscing the years in Chang’an. She was now focused on her own realm, as well as the present.</p><br/><p>People were fighting for life and death in the front yard of Peach Mountain. Every bit of human ugliness or beautifulness was hidden in the fighting. But all of it seemed absurd to her, nothing but some entertainment.</p><br/><p>Throughout tens of thousands of years, only very few like the Headmaster of the Academy had done something worthy in Haotian’s eyes. What mattered to human beings had always seemed trivial to Haotian, from wars to disasters, from birth to death. It was the same as how the emotions of ants seemed trivial to human beings.</p><br/><p>When the South Sea branch came to the Peach Mountain, she did not care. They were also her most devout followers. From her Divine Kingdom above she had seen them fighting for power for countless times. There was nothing unexpected. She did not care about Liu Bai’ sword because she was Haotian who knew everything in the human world. What was more important to her was the Academy’s plan. She wondered if they could surprise her.</p><br/><p>Even after such a long wait, nothing unexpected had happened. She felt bored and impatient as she looked at Chen Pipi standing on the altar.</p><br/><p>Even if the Rite to Light would not open a path to the Divine Kingdom, she would still need to cut her bonds to the human world. Or, if she could not sever the strongest bond, she would at least have to cut off some branches. The death of Chen Pipi would mean to cut off a branch of that bond. However, him still being alive, as well as another branch, Tang Xiaotang, being saved by yet another branch further irritated her.</p><br/><p>She did not want to admit that her irritation came from the bonds between the branches themselves, nor that the other end of the bond was still clinging onto her. That was why she wanted to quickly kill Chen Pipi.</p><br/><p>She thought she would never get angry. Yet, deep down inside, a storm was forming. She went back to the terrace of the Divine Hall and looked at the steep cliffs and floating clouds, declining to pay further attention to the trivialities happening down in the front yard.</p><br/><p>When Haotian felt something, the human world echoed.</p><br/><p>Those most devout followers, divine priests and deacons of the West-Hill Divine Halls and people from the South Sea could sense the anger of Heaven.</p><br/><p>When Haotian pondered, Heaven and Earth echoed.</p><br/><p>The autumn wind roared through the valley in Peach Mountain. Those fallen peach petals were lifted again as they danced in the wind. Dancing toward the sky, they looked charming and somewhat bloody because of their color.</p><br/><p>…</p></div>\n</div>"}