{"title": "Chapter 874 - The Academy’s Prediction (I)", "id": 874, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-874-the-academy%E2%80%99s-prediction-i", "volume_title": "Volume 9", "body": "<h1>Chapter 874 - The Academy’s Prediction (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The strongest cultivators at the front yard of Peach Mountain had yet to join in the fight.</p><br/><p>The national master of the Golden Tribe and Zhao Nanhai were both unfathomably powerful. Ye Hongyu had shown that she could be horrifying. Qi Nian from Buddhism had been so quiet that people almost forgot he was there. But he was after all the world wayfarer and as mighty as Ye Hongyu and her brother Ye Su. There was no need to mention the Hierarch. Since General Lebu had wounded her seriously, Tang Xiaotang figured it seemed impossible for her to get her man out of this no matter how desperately she fought.</p><br/><p>It seemed Chen Pipi should have been more depressed than her because he was the one waiting to be rescued. Yet he did not think that way and still carried a smile on his chubby face.</p><br/><p>“Why?” He asked Tang Xiaotang.</p><br/><p>Tang Xiaotang replied seriously, “Because I can’t make it.”</p><br/><p>Chen Pipi said, “If it was only you, of course you could not make it.”</p><br/><p>Tang Xiaotang said fearlessly, “I don’t care if we die together.”</p><br/><p>Chen Pipi disagreed with grievance, “I don’t want to die.”</p><br/><p>Tang Xiaotang reassured him, “There’s nothing to be afraid of in death.”</p><br/><p>But Chen Pipi insisted, “I just don’t want to die together.”</p><br/><p>Tang Xiaotang felt a bit upset and did not reply to that.</p><br/><p>Chen Pipi patted on her head and comforted with a smile, “Since you are here, you are my girl. You need to listen to me. We are not dying here today.”</p><br/><p>Tang Xiaotang said without raising her head, “I’m not leaving.”</p><br/><p>Chen Pipi continued, “No worries, I’m not going to die either. None of us will die here. Although we will face death eventually, I’m pretty sure we are not dying here today.”</p><br/><p>Tang Xiaotang looked up at him with hope, “You think you can do it?”</p><br/><p>“No, I don’t. But since Eldest Brother approved of your trip to the Peach Mountain, he is definitely not planning to let us die.”</p><br/><p>Chen Pipi shook his head but smiled.</p><br/><p>He knew that Ning Que was already at the Peach Mountain and right there at the Rite to Light. His fellows from the Academy must have planned for something. Tang Xiaotang should have known. She just had not realized it.</p><br/><p>People around the altar had thought so too. Since the Academy had sent someone from their second generation, they had made it clear. Someone else must be coming too.</p><br/><p>But who could that be? The Eldest Brother, Second Brother or Senior Sister?</p><br/><p>Qi Nian was thinking silently about Jun Mo who cleaved the stone statue of Buddha with his sword on that rainy autumn day at Lanke Temple. Other people were also silent and somewhat scared.</p><br/><p>Li Manman, the Eldest Brother, had killed numerous people in front of Cong Ridge. No one in the Yuelun Kingdom had survived, from the emperor all the way to the foot soldiers. Even master Qi Mei from the Xuankong Temple was not able to stand up to him and was seriously wounded. Then he clashed with the powerful Abbey Dean throughout the world, before finally fighting him in the decisive battle in the City of Chang’an.</p><br/><p>When Second Brother Jun Mo was defending the Verdant Canyon, tens of thousands of cavalrymen could not get through. Even Ye Su was defeated. Although Jun Mo lost an arm to Liu Bai eventually, he had also seriously wounded the most powerful man in the world. Senior Sister Yu Lian was the legendary Twenty-Three-Year Cicada. She defeated the Hierarch and wounded him seriously in the back mountain of the Academy. Even though the West-Hill Divine Halls tried to keep this a secret, the Great Tang had spared no efforts in spreading the news throughout the world. There was no need to mention that later on in their battle in Chang’an she had leapt into the sky, cut off the rainbow and left the Abbey Dean no choice but to stay in Chang’an.</p><br/><p>The three of them from the Academy had shown extraordinary power and cultivation base in the battles defending the Great Tang. Although they were more or less wounded and still recovering, the West-Hill Divine Halls were also not ready for another decisive fight. If they came to the Peach Mountain today, were the West-Hill Divine Halls ready to fight them? Was Taoism really going to win?</p><br/><p>…</p><br/><p>Eldest Brother was not in the Peach Mountain. He was about to enter a small town by border of Yan and Song Kingdom.</p><br/><p>It was a cool autumn day and he was already wearing a cotton padded gown. The skeet he had been carrying by his waist for years was broken that day in front of Cong Ridge. Now it was an ordinary wood stick he carried around.</p><br/><p>Maybe he was named Li Manman (Note: the character “man” means slow in Chinese) because he did things very slowly and talked very slowly. He was walking slower that day, even slower than he normally did.</p><br/><p>During his seven-day fight with the Abbey Dean in the battle in Chang’an, the Eldest Brother had also been badly wounded with many of his bones broken. Although he had recovered a bit and no longer needed a wheelchair, he was still unable to walk faster. Apart from that, he was walking so slowly also because he felt very nervous, even as nervous as when he faced the Abbey Dean.</p><br/><p>It took him a long while to get further down in the small town. He stopped in front of a painting and calligraphy store, lifted the front part of his gown, crossed the threshold and bowed slowly toward a man inside.</p><br/><p>That man was sitting in a chair behind the counter and holding a bottle of liquor. He had wrinkled skin and grey hair and seemed to be in his forties. At the same time, it also seemed that he had lived for more than a thousand years.</p><br/><p>“It is an honor to meet you, sir,” The eldest Brother greeted the man in the chair.</p><br/><p>The owner of the store stepped out from the counter and looked at Li Manman. Upon finding him unfamiliar, he asked, “Sir, would you like to enjoy some tea or liquor? We have very good collections of both.”</p><br/><p>Eldest Brother answered, “I’ll just have some water please.”</p><br/><p>The man in the chair turned to the owner and said, “Please go inside and don’t come out if there’s nothing important.”</p><br/><p>The man with the liquor was the Drunkard, while the owner was Chao Xiaoshu from Chang’an. They just got to know each not long ago, but already became good friends. The Drunkard did not want him to be killed in vain.</p><br/><p>Only the Drunkard and Eldest Brother was left by the counter.</p><br/><p>The Drunkard said, “You were walking so slowly. It seems you have not fully recovered.”</p><br/><p>Eldest Brother answered, “I will one day.”</p><br/><p>The Drunkard questioned, “You won’t be faster than me even if you were fully recovered, not to mention like this.”</p><br/><p>Eldest Brother replied, “I walk slowly, but firmly.”</p><br/><p>After a short silence the Drunkard replied, “Indeed, you walk more firmly than I do. I didn’t expect that anyone in this world could walk more firmly than I do. Yet you are still no match for me.”</p><br/><p>Eldest Brother said, “I have only been practicing cultivation for a few decades. Of course, I am no match for a master like you.”</p><br/><p>The Drunkard asked, “Then how dare you leave Chang’an and come here to meet me?”</p><br/><p>Eldest Brother said, “Because the Academy is planning something and we hope that you will not interfere with it.”</p><br/><p>The Drunkard squinted and his voice became lower and husky. His breath let off a scent that smelled like bronze and iron being rubbed together. “Are you not afraid of being killed?”</p><br/><p>Eldest Brother answered slowly, “You won’t kill me.”</p><br/><p>The Drunkard’s voice sounded more chilling as he asked, “Why makes you think I won’t kill you?”</p><br/><p>Eldest Brother answered calmly, “Because you are not sure if you can kill me.”</p><br/><p>The Drunkard laughed at him and taunted, “You only have a slightest chance of surviving.”</p><br/><p>Eldest Brother smiled in response, saying, “Even if I had less than that, you still wouldn’t dare to try killing me, not to mention that I still have a slightest chance.”</p><br/><p>The Drunkard stiffened and asked, “Why are you so sure?”</p><br/><p>Eldest Brother answered, “I know nothing about fighting. But no matter whether within the Academy or throughout the world, Jun Mo, Senior Sister and Youngest Brother are the three most powerful ones in fighting. Since they all said you won’t try killing me, I chose to believe their judgement that you won’t kill me.”</p><br/><p>The Drunkard questioned, “Even if their judgment will lead to your death?”</p><br/><p>Eldest Brother answered, “I think they are right. So, I’m willing to try.”</p><br/><p>The Drunkard asked, “What did they say to make you believe so?”</p><br/><p>Eldest Brother replied, “They said you had lived such a long life, so long that you were already very afraid of dying.”</p><br/><p>Upon hearing these words, the Drunkard became silent for a long while.</p><br/><p>Then he asked again, “Why did they send you to me instead of the Butcher?”</p><br/><p>Eldest Brother answered, “Senior Sister said that the Butcher walked too slowly, barely any faster than me or the chief monk. Therefore, we do not need to worry about him, at least for today.”</p><br/><p>“What about her?” The Drunkard asked all of a sudden, “Are you really not afraid of her?”</p><br/><p>Eldest Brother knew who he was talking about and smiled at that, “She has lived for a while at the back mountain of the Academy. We are not afraid of her. Instead, we are all fond of her.”</p><br/><p>…</p><br/><p>In the valleys between the indigo mountain range, a road had been constructed that was almost wide enough for simple carriages. But people chose to cross it by walking for the sake of convenience.</p><br/><p>Two people had just walked out of the Verdant Canyon. The man was wearing a bamboo hat and a cloth gown and he was holding a rod. He looked like a sadhu sometimes seen in the rural areas. While the woman beside him was holding some embroidered pieces and garbed in red. She was sweet and charming as a new bride. This awkward looking pair were Jun Mo, who had shaved his head to pursue Buddhism, and Mu You, his Seventh Sister and new wife.</p><br/><p>Jun Mo looked at the dark and rich land in front of the Verdant Canyon, recalling what had happened here half a year ago as well as his arm that was broken here. He kept silent. Mu You also did not say a thing.</p><br/><p>They kept walking south. However, they were not like their Eldest Brother, who was able to reach the Distanceless State. It seemed likely that they wouldn’t be able to arrive at the Peach Mountain in time. Where were they headed and what were they planning to do then?</p><br/><p>Coming to Fuchun River, they climbed up to the pavilion on top of Hu Mountain. Jun Mo frowned as he looked toward the southeast. He sensed that Liu Bai’s sword had left the Sword Garret for the Peach Mountain.</p><br/><p>He kept quiet for a while, feeling the wind blow against himself.</p><br/><p>He used to stand in front of the Verdant Canyon, full of lofty ambition. Now, Liu Bai had fully recovered and made another breakthrough to the legendary level. On the other hand, he was still recovering from his injuries, with one arm still missing. He did not know when or how he could ever reach the same level of Liu Bai. It was hard to swallow for him.</p><br/><p>He looked toward the direction of West-Hill Divine Kingdom, as if he could see Liu Bai’ sword flying to the Peach Mountain and the girl standing in front of the Divine Hall of Light in the Peach Mountain. Then he recalled the girl who was kneeling on top of a nameless mountain to the north of Chang’an years ago, trying to collect the ashes of her master into a pot. He did not know which was the real her. But he knew that she had always been strong.</p><br/><p>“What if she steps in?” Mu You was worried about their juniors in the Peach Mountain.</p><br/><p>Jun Mo answered, “That is what we planned.”</p><br/><p>Mu You was surprised and asked, “Then what if she didn’t?”</p><br/><p>Jun Mo answered, “With our Headmaster gone to the Heaven and the Abbey Dean crippled, Liu Bai is already the most powerful in the world even if he does not breakthrough to the Five States, not to mention that he already has. He easily outranks the Drunkard and the Butcher. Now, his sword is already there in the Peach Mountain, so there is no reason for her to not get involved. The change Yu Lian mentioned was in that sword.”</p><br/><p>Mu You said, “She should have expected that.”</p><br/><p>Jun Mo said, “Our Youngest Brother being there will probably be very annoying for her. When people are annoyed, they are not good at reasoning. When Haotian is annoyed, she wouldn’t bother to think.”</p><br/><p>…</p></div>\n</div>"}