{"title": "Chapter 887 - Climbing Up the Peach Mountain", "id": 887, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-887-climbing-up-the-peach-mountain", "volume_title": "Volume 9", "body": "<h1>Chapter 887 - Climbing Up the Peach Mountain</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was hard to cut the bond and reopen the gate to the Divine Kingdom. And the Rite to Light was doomed to be a failure. Those were all in her plan. Yet when it happened, she still felt enraged.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Staring at the figure in front of the altar who had destroyed everything and killed her followers by using her own Divine Power, she could not stop her hands from trembling on her back.</p><br/><p>Everything in the human world happened according to her plan, except for him. Therefore, she was not able to tell that he would have destroyed the Rite to Light and made her look ridiculous.</p><br/><p>She became increasingly angry and the breeze turned increasingly fierce. It raised dust from the ground and covered the clear autumn sky. Numerous dark clouds came from the East Sea afar and dimmed the Peach Mountain. Then a storm followed.</p><br/><p>The storm caused havoc. Trees and trails were soaked. Peach petals were smashed and blood was washed away. Water accumulated in the front yard immediately. Dead branches as well as broken limbs were floating in the water.</p><br/><p>The storm blocked people’s visions. It seemed like nothing except the chilling rain was left in the world. The roaring storm sounded like thunder.</p><br/><p>The power of Heaven and Earth took the form of a storm and washed Peach Mountain, as well as people’s bodies and souls. Tens of thousands of followers in the front yard fell on their knees, pale and horrified.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The storm continued to roar. The bout of light above the altar was washed away. The dozens of Divine Talismans were also dimmed and eventually disappeared.</p><br/><p>The Hierarch, Qi Nian, and other powerful cultivators also fell to their knees. They were more powerful and thus more sensitive than ordinary cultivators. They could clearly sense Haotian’s anger though the storm, which had made them more horrified and pale. They kneeled on the ground and dared not to look up.</p><br/><p>Tens of thousands of wounded followers were freezing in the storm. Their lips turned blue and their blood was washed away upon gushing out of their wounds. Yet no one dared to seek for shelter. Even the storm was Haotian’s gift to them.</p><br/><p>If there was an eye in this storm, Ning Que was the one standing right on it. He experienced Haotian’s Divine Power most distinctively, and therefore became the most wretched. His dozens of talismans were dismissed, and Haotian’s Divine Power that was bestowed to him was being drained even faster.</p><br/><p>Rain fell on his pale cheeks. He fell the draining of the Divine Power from his body and trembled. He seemed so weak and could fall at any time.</p><br/><p>Yet no matter how severe the storm became, he was still standing and staring at the top of Peach Mountain in silence. He squinted and tried to see her through the storm.</p><br/><p>Thousands of miles away above the ocean in the Song Kingdom, roaring winds rolled on with dark clouds. Between the dark clouds and the ocean, sea swallows were flying proudly like black bolts.</p><br/><p>Let the storm be fiercer.</p><br/><p>In the front yard of Peach Mountain, tens of thousands of people kneeled down and covered the ground like a black carpet. They looked so insignificant. Ning Que was the only one standing there, lonely but heroic.</p><br/><p>He was not a brave and proud sea swallow. He never cared about dignity whenever he faced life or death situations. Even though he had kneeled previously, he did not want to do that again at this point.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Now that he had rebuilt their bond, You are my natal item, so you are my Sangsang and my wife. We are equal. How can I kneel to you?</p><br/><p>—— Fuck you. Try to kill me, if you dare.</p><br/><p>…</p><br/><p>…</p><br/><p>The storm today was different from that on the day when the Headmaster left the human world. It carried Haotian’s anger, so it was much more furious. Although it did not last as long as the rain that fell after the Headmaster’s ascension, it did continue longer than ordinary summer storms.</p><br/><p>It continued for half a day before it became ticking rain. Winds turned into mellow breeze and brought comforting moisture to the people in the front yard..</p><br/><p>Tens of thousands of followers awoke and found that the roaring storm had stopped. It finally became tranquil again at Peach Mountain. Many of them were knocked out by the storm and some even died. Their soaked clothes passed the biting coldness to their bodies. No one dared to say anything.</p><br/><p>The powerful cultivators were even more wretched. The storm was so horrible that the Qi of Heaven and Earth in the mountains and fields were washed away. The stronger their senses were, the worse their psyche was hurt.</p><br/><p>Without a doubt, Ning Que was the most wretched. Haotian’s Divine Power was drained from his body. His psyche in the Ocean of Consciousness was seriously destroyed. His hair was scattered on his shoulders and was dripping with rain water. He looked pale and exhausted. His eyes no longer shone, as if all the lights were dying out.</p><br/><p>When the storm stopped and the sky cleared, a rainbow appeared from the Divine Hall of Light and reached to some place afar. It seemed like the other end of the rainbow fell somewhere in the South Jin Kingdom.</p><br/><p>Looking at this charming scene, the people in the front yard almost forgot the biting coldness on their bodies and the chilling rain water around their feet. Recalling the power of Heaven and Earth, they found it awe-inspiring again.</p><br/><p>The sun gave way to darkness. Some people turned away from the rainbow and looked at Ning Que in front of the altar.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The storm that lasted for half of the day had washed away the resentment and dust in the human world, drained Haotian’s Divine Power from Ning Que’s body, and washed off the Divine Talismans as well as the Array of Clear Light. Yet, it could never erase their past.</p><br/><p>The Hierarch looked at Ning Que and raised his right hand gradually to give the command of attack to the people from the Divine Halls.</p><br/><p>No one could understand why Ning Que did not run away when the storm turned into shower. Without Haotian’s Divine Power, what else could he do?</p><br/><p>Ning Que looked at people around him including Qi Nian, the national master of the Golden Tribe, and Zhaonanhai, and saw their expressions. He carried the iron bow on his shoulder and held his iron blade tighter.</p><br/><p>He was previously invincible because of Haotian’s Divine Power that was bestowed to him in the magnificent Tianqi. They were no match to him at that time. However, the situation was completely different now. He would not be able to withstand a few rounds under their fierce attack.</p><br/><p>If he were to shoot another arrow at this time, he might be able to frighten them and clear out a way for himself. There were only a few arrows left but he never considered running away. He never wanted to leave the Peach Mountain.</p><br/><p>Looking around at the powerful enemies, Ning Que was not afraid at all. He stared at Prince Chong Ming and some other governors of smaller kingdoms and said, “I won’t kill you today. It’s not because of the rule that cultivators should not kill ordinary people, but I’d rather have you killed by our Tang army.”</p><br/><p>People wondered why he could still be so calm in such a hopeless situation. What is he thinking about? The Hierarch shouted angrily, “Do you still believe you can run away from Peach Mountain?”</p><br/><p>Ning Que looked at the terrible wound on his shoulder and replied, “You won’t be able to stop me.”</p><br/><p>The Hierarch looked even more chilling. “The path in front of you leads to nowhere but death.”</p><br/><p>Ning Que disagreed. “It’s only a path to death when there is no way to retreat.”</p><br/><p>The Hierarch asked, “Where is your way to retreat?”</p><br/><p>By then, people like the national master of the Golden Tribe had blocked every single way out of the front yard. Ning Que could not defeat any of them without Haotian’s Divine Power.</p><br/><p>Generally speaking, there was no physical way out. However, people including the Hierarch had all forgotten that he could go on a different path by simply stepping backward — the path to the top of Peach Mountain.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>With Haotian at the top of Peach Mountain, the Hierarch and everyone else would have never thought that Ning Que would choose to climb up. That was because it was definitely a path to death. However, he again chose the unexpected.</p><br/><p>He turned back and rushed up Peach Mountain.</p><br/><p>It was so unexpected that it took the Divine Halls a while to react. The Hierarch made a long whistle and countless swords were set off to Ning Que.</p><br/><p>The national master of the Golden Tribe lifted his cracked wooden tripod. Zhao Nanhai released dazzling lights from his hands. Qi Nian sat down in the water and crossed his legs, chanted some Buddhist mantra and formed a mudra in the sky and threw it onto Ning Que.</p><br/><p>Ning Que knew that he could never withstand their attack. Even if his Senior Sister was here, she would have sought for shelter rather than confronting a joint attack of the most powerful cultivators in the world and the array of sword that was formed by the rage of the people from the Divine Halls.</p><br/><p>Therefore, he did not choose to turn around and fought back or to dodge. He accelerated with horrifying speed, smashed the rock stairs under his feet and made a spurt toward the peak.</p><br/><p>Several low bangs were heard repeatedly. The national master of the Golden Tribe continued to bomb his Ocean of Consciousness. Zhao Nanhai hit his back with Haotian’s Divine Flame. Qi Nian pounded the mudra of Acalanatha on his body. Dozens of flying swords shredded his clothes.</p><br/><p>Ning Que vomited some blood and turned more pale. He almost fell off the rock stairs.</p><br/><p>If it were not for his practice of Haoran Qi, his body would not have been strong enough to withstand the first round of attack. It could have smashed him. Though he survived, he was already seriously wounded.</p><br/><p>Ning Que applied vigorous psyche to gather his Ocean of Consciousness, which was almost destroyed in anguish. He made another pounding step and smashed a few rock steps, then rushed up like a scattered shadow.</p><br/><p>Instead of falling down, he became even faster.</p><br/><p>Within a few breaths, he smashed hundreds of rock steps and was out of the reach from the powerful attackers. They could only see a dimmed figure on its way up to the mountaintop.</p><br/><p>While the divine priests, deacons, and people like Zhao Nanhai were preparing for another round of attack, the Hierarch raised his hand again to order a cease. The expression on his face was complex.</p><br/><p>…</p><br/><p>…</p><br/><p>During the Rite to Light, almost everyone from the Divine Halls was standing around the altar. No one was up on Peach Mountain. Only the sound of the stream running by the rock stairs was heard. It was silent and frightening.</p><br/><p>Yet the silence was broken by a series of steps. Ning Que became a dim figure when he spurted towards the peak and left a line of blood and smashed rocks behind.</p><br/><p>He was seriously wounded at that moment. His Ocean of Consciousness was roaring in restlessness. The pain intensified with every step he took. His ribs were cracked by Qi Nian’s mudra and they cracked even further with every step. He did not know when they were going to break.</p><br/><p>If the big black umbrella was here, who could ever hurt me? Ning Que missed it so much at that point. Then he was cheered up because he would see his big black umbrella again soon.</p><br/><p>He could neither see anyone on Peach Mountain nor see anyone chasing him up the rock steps. He continued to run alone without feeling lonely or nervous.</p><br/><p>He was running up to meet her. How could he feel lonely or nervous? He ran faster and felt happier with cheerful smiles on his face. Even the chilling autumn wind after the storm could not take away his smiles.</p><br/><p>The two Arrays of Clear Light were torn by his iron blade and Divine Talismans.</p><br/><p>He reached to the front of the Divine Hall and stood on the plateau.</p><br/><p>The autumn sky was cloudless after the rain. The view was unobstructed on top of the mountain. He could even see the sun setting in the far west and the Yellow River flowing into the sea further to the south.</p><br/><p>He looked to the Divine Hall atop and the rock steps in front of him and thought, I am about to climb up. Are you going to flee again?</p><br/><p>…</p><br/><p>…</p></div>\n</div>"}