{"title": "Chapter 896 - Second of the Three Petty Things", "id": 896, "volume": 9, "url": "http://boxnovel.org/nightfall-chapter-896-second-of-the-three-petty-things", "volume_title": "Volume 9", "body": "<h1>Chapter 896 - Second of the Three Petty Things</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ever since spring, no one had entered the Divine Hall of Light, not even the Hierarch. Therefore, when the pious deacons on the plateau saw Xiaocao being escorted into the Divine Hall, they were shocked and could not believe what they just saw.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Xiaocao did not understand what had happened to her either. She knew that the Divine Hall of Light had been lacking a master for years, so who was asking for her?</p><br/><p>A girl in a white dress led her into the Divine Hall and then disappeared. She looked around the spacious and imposing Divine Hall and found herself small in comparison. She instinctively kneeled on the cushion.</p><br/><p>Curtains hung in the far end of the Divine Hall. She saw no one behind the curtains or heard any sound. The silence was frightening. She lowered her head and waited anxiously for her destiny.</p><br/><p>Time passed by slowly. She kneeled for so long that her knees became sore and painful. However, she neither dared to stand up nor refrained from being more anxious.</p><br/><p>Suddenly she saw a big black horse.</p><br/><p>Xiaocao’s eyes shone with some joy because she knew that the big black horse belonged to Ning Que. However, before she greeted the big black horse, she remembered something else.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>She used to have a good friend in Chang’an. They were of the same age. She was dark and skinny. They used to exchange many inexpensive gifts. She taught that friend how to do makeup and how to tempt her lustful master.</p><br/><p>Later on, that friend went through a lot. She became the daughter of the Grand Secretary and even was said to the descendent of the Divine Priest of Light. However, when they met occasionally she was still the friend Xiaocao used to know.</p><br/><p>Xiaocao was shocked. She felt lost and fell onto the cushion with her hand covering her chest. She could not believe her own reasoning. Yet she knew there could be no other explanation for this.</p><br/><p>A wind blew from within the Divine Hall of Light and the curtain was lifted from a corner. Instead of her acquaintance, she could only see a lofty girl standing on the terrace.</p><br/><p>Is that Sangsang?</p><br/><p>Xiaocao stood up and stared at that figure. She wanted to call her but did not dare to. It did not matter if she was the master of the Divine Hall of Light or some other high-ranking figure in the Divine Halls of West Hill because she was no long her former friend who was of no significance.</p><br/><p>“I grant you immortality.”</p><br/><p>An awe-inspiring voice resounded in the Divine Hall of Light.</p><br/><p>Xiaocao could not figure out whether or not this voice belonged to the figure standing by the terrace. She gazed blankly at the curtain that divided the world into two realms and slightly clenched her fists.</p><br/><p>The formerly disappeared girl with the white dress showed up again and led her out of the Divine Hall of Light.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Xiaocao did nothing inside the Divine Hall of Light. She was not tortured. She neither met an acquaintance nor prostrated to Haotian. Then she just left.</p><br/><p>It seemed she was only taken there for these words: “I grant you immortality.”</p><br/><p>Xiaocao left the Divine Hall of Light and returned to the small town. The girls from the House of Red Sleeves kept asking her about what had happened, but before she could tell them anything, the Divine Halls sent a group of cavalrymen and escorted them out of the West Hall Divine Kingdom courteously. They escorted them to the south of the Verdant Canyon.</p><br/><p>Until they came back to Chang’an, Xiaocao still felt that their trip to the West Hill was like a dream, especially her experience inside the Divine Hall of Light. It was so unreal. She did not realize what she had been granted until many years later.</p><br/><p>…</p><br/><p>…</p><br/><p>The Haotian’s Divine Hall where the Hierarch dwelt used to be the most respected place in Peach Mountain. However, now people viewed the secluded Divine Hall of Light as the supreme place.</p><br/><p>No one dared to disobey the orders from the Divine Hall of Light, not even the Hierarch. But the figure inside the Divine Hall of Light had kept quiet since spring. It was only until recently that several orders were issued.</p><br/><p>The first one was to escort the girls from the House of Red Sleeves back to Chang’an. Many people from the Divine Halls did not understand why. For those who knew the stories like the Hierarch, the reason was very simple. When Haotian was taking a rest in the human world, some people were nice to her. She was just paying them back now.</p><br/><p>However, the second order from the Divine Hall of Light was a shock to all of them including the Hierarch. The girl in the white dress announced expressionlessly that they must stop going after Chen Pipi and Tang Xiaotang.</p><br/><p>Tang Xiaotang had intruded Peach Mountain and took Chen Pipi away from the Rite to Light. It was extremely humiliating to the Divine Halls of West Hill and they wanted them to pay for it.</p><br/><p>The strongest men were sent out from the Divine Halls and series of traps were set up along the way from Qinghe Prefecture to Chang’an. The Hierarch was so sure that those senior cultivators from the Back Hill of the Academy would not dare to interfere under the pressure of the Drunkard and the Butcher. Chen Pipi and Tang Xiaotang would eventually be taken back to the Divine Halls and sentenced with slow slicing.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Right then, the girl in the white dress conveyed the order to stop tracking them down. Why should Haotian make such a decision? The Hierarch was confused but did not dare to question.</p><br/><p>…</p><br/><p>…</p><br/><p>For the Divine Halls of West Hill, it was very annoying that the girls from the House of Red Sleeves had returned to Chang’an safe and sound but it was a trivial matter. However, to stop hunting for Chen Pipi and Tang Xiaotang was significant.</p><br/><p>Yet for Sangsang, those were all petty things because whatever happened in the human world was of no significance to Haotian. She made those decisions only because she had a plan, rather than some attachment to any human beings.</p><br/><p>The Rite to Light was organized to reopen the gate to Haotian’s Divine Kingdom, as well as cutting her connections to the human world. That was why she wanted Chen Pipi to be the sacrifice and asked the Tang Empire to send the girls from the House of Red Sleeves. In her original plan, Chen Pipi, Tang Xiaotang, and Xiaocao would have been burnt in the holy flame. Then most of her connections to the human world would have been severed.</p><br/><p>However, Ning Que showed up and he proved to her through the Tianqi that it would be impossible to cut her connections to the human world. Then she decided to use a different approach.</p><br/><p>Her connections to the human world was affection, so she wanted pay them back with life. She granted Xiaocao with immortality and spared Chen Pipi and Tang Xiaotang’s life. She thought she could have severed her bond to the human world this way.</p><br/><p>…</p><br/><p>…</p><br/><p>Ning Que had no idea of what had happened. As He Mingchi said the other day, he could only see the falling leaves and rain from inside the rock window but could not feel the rain.</p><br/><p>He was the most important prisoner inside the Secluded Pavilion but he did not care. If he had not come to Peach Mountain, he would have been a prisoner in Chang’an. It did not matter where he was imprisoned.</p><br/><p>What he cared more about was his battle with Sangsang. He kept dreaming on the rock bed. The dreams were romantic as well as horrifying. The woman in his dream was sometimes plump and sometimes skinny. They fought against each other and went through extreme happiness and anguish. He kissed her, bit her, felt her plumpness and was tortured by slow slicing.</p><br/><p>She stayed in the Divine Hall of Light, whereas he was confined in the cold stone cell down the cliff. They tortured and loved each other despite of the distance of thousand of miles. He gave her the most wonderful happiness in the human world and she paid him back with the most horrifying torture in the human world. She kept killing him while he kept loving her. Both were torture.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>It was a battle between Heaven and Earth as well as one between man and woman. There had been numerous battles of both kinds throughout history but they never happened at the same time.</p><br/><p>It was rather a simple battle, like a family drama. The result would be either one party surpassing the other, or simply one party maintaining their position on top. Eventually, one of the two parties would win and be the boss of the house.</p><br/><p>On the other hand, It was not so simple because it was not a matter of who would take charge in the Old Brush Pen Shop. It would decide the destiny of the human world whether it was Haotian or the human who won.</p><br/><p>The destiny of the human world was in their hands. Ning Que felt that it was absurd but could not refrain from being proud and satisfied.</p><br/><p>Their battle in his dreams continued. He could not tell how long he had stayed in the cell. Outside the rock window, there were fewer autumn leaves falling. When he saw several snowflakes, he knew that winter had come.</p><br/><p>Neither of them surrendered or won.</p><br/><p>Ning Que watched the falling snowflakes outside the rock window and realized that he was tortured less frequently these days. He frowned and wondered why.</p><br/><p>He had no idea of what had happened outside. He knew that Elder Cui was shot dead by him and someone was meeting with the Drunkard and the Butcher in that small town. However, he did not know that the someone was one of his acquaintances, or that the Tang Empire and the Academy were ready for a revenge in the Qinghe Prefecture soon.</p><br/><p>These could only happen on the condition of him conquering Sangsang.</p><br/><p>If Heaven were to have feelings, then Heaven would grow old and become vulnerable. If Sangsang were to have feelings, then he would have a chance to win. Unfortunately, he had not been able to make any breakthroughs.</p><br/><p>What troubled him most or made him vigilant was that Sangsang could not find a way to cut her bond to the human world yet she still seemed so calm and confident in his dreams. Why was that?</p><br/><p>Then another petty thing happened inside the Divine Hall of Light.</p><br/><p>Two girls in white dresses kneeled behind Sangsang. They seemed extremely nervous and sad, especially the older girl on the left. She was weeping in fear.</p><br/><p>Not far from them on a wooden tray there were two pairs of white pants stained with blood.</p><br/><p>The girls had their first menstruation.</p><br/><p>The girls were chosen from hundreds of thousands of young girls throughout the West Hill Divine Kingdom. They were supposed to be fair, pure, and free of any worldly filthiness. They knew it very clearly.</p><br/><p>They had spent half a year in the Divine Hall of Light and realized how magnificent their master was. It made them proud and even more pious.</p><br/><p>However their first menstruation had finally come. They knew what they were going to face but did not dare to cheat. Therefore they kneeled behind Haotian and waited in tears for their punishment.</p><br/><p>However, Sangsang did not punish them.</p><br/><p>Instead, she looked at the hidden moon and asked, “People call it a lunar period. Do you find it interesting or annoying?”</p><br/><p>Light snowflakes fell on the terrace.</p><br/><p>She frowned to somewhere down the cliff, and put her hand slowly on her under abdomen.</p><br/><p>A dam of thousand miles long was built with baskets of soil. A city with a thousand years of history was started from pieces of black bricks. Anything significant was consisted of trivial matters.</p><br/><p>Three petty things happened in her world.</p><br/><p>These three things led to a conclusion: she decided to let him out.</p><br/><p>…</p></div>\n</div>"}