{"title": "Chapter 918 - God Gets Sick(Part Ⅰ)", "id": 918, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-918-god-gets-sickpart-%E2%85%A0", "volume_title": "Volume 10", "body": "<h1>Chapter 918 - God Gets Sick(Part Ⅰ)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was also raining in the capital of Qi Kingdom.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The chilly rain dampened the ginkgo trees that lined the street and the clothes of the pedestrians. There were a few tourists in the city, for it was not yet the best time to view and admire the ginkgo trees. The street was quite empty, except for the coolies who were passing by occasionally with their carts. With wrinkles on their faces, they seemed numb and resigned, showing no signs of positive spirits which could be seen from the Tang people.</p><br/><p>The Dragon and Tiger Mountain was empty after the murder case several years ago. The investigation was terminated with Prince Long Qing’s return to Taoism. The status of the Divine Hall of West Hill in the Qi Kingdom became more and more esteemed, and the Taoist temples were worshipped everywhere. People’s faith in Haotian was more and more devout, but life was clearly becoming increasingly difficult for them.</p><br/><p>The Taoist Halls of the Divine Hall were all located in the north of the capital, which were extremely luxurious and solemn. The surfaces were covered with white powder and decorated with countless precious gemstones and their eaves and drainage ditches were coated with gold powder. The heavy spring rain dazzled the gemstones but dimmed the Taoist Halls.</p><br/><p>The deacons of the Taoist Halls were reluctant to be on guard outside the hall in the rain. They had already hidden behind the gate and indulged themselves in the fine wine and food since they couldn’t be seen by the followers.</p><br/><p>At this point, clear hoofbeats came from the rain. A deacon opened the spy hole on the door and looked out, seeing a gallant black horse running through the rain with an ordinary carriage behind.</p><br/><p>The carriage stopped outside the hall.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Inside the carriage, Ning Que looked at Sangsang and worried. “It’s easy to catch a cold when it’s raining. Let’s take a break here. We left some medicine here last time, but I wonder if it would work.”</p><br/><p>How could cold weather ever bother Haotian? What he said seemed a bit ridiculous, but Sansang was indeed pale and tired.</p><br/><p>Sangsang caught the cold after strolling in the rain.</p><br/><p>This was difficult to understand. Ning Que could sense that nothing went wrong with her body and her Divine Power remained the same, but she caught the cold anyway.</p><br/><p>Only human beings would catch a chill and die of illness or old age.</p><br/><p>Sangsang didn’t feel particularly uncomfortable. Unlike the disease she had many years ago, she didn’t cough blood, but rather felt a little drowsy and lost her interest in doing anything.</p><br/><p>Ning Que didn’t take it seriously at first, but he got nervous after finding out that her interest in fine food had lowered.</p><br/><p>He approached Monk Guan Hai for help.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Monk Guan Hai was also very nervous. He immediately informed the two eminent monks of the previous generation with whom Ning Que had met in the Third Bureau of Wa Mountain. The whole temple was focused on curing Sangsang.</p><br/><p>Master Qishan was famous for his medical skills, and the Lanke Temple inherited his means, which was naturally many times better than the quacks in the outside world. It was undoubtedly the greatest glory of the Lanke Temple to treat Haotian.</p><br/><p>The Lanke Temple was very nervous about this matter, mobilized all medical knowledge and abilities, and looked through the medical books kept in the temple. However, all of the monks in the temple was not able to make an effective prescription in the end.</p><br/><p>They couldn’t find out what disease Sangsang had.</p><br/><p>Ning Que was a little irritated. He grabbed Monk Guan Hai’s robe and expressed that he just wanted to know what went wrong with Sangsang and wouldn’t cause him any trouble even if Sangsang was diagnosed with an incurable disease.</p><br/><p>Monk Guan Hai was very helpless. Being forced by Ning Que too hard, he had to diagnose that Sangsang caught a cold because she got wet in the rain based on how Sangsang felt.</p><br/><p>Ning Que couldn’t believe that Haotian had a cold, which was just too incredible. However, he had no choice but to boil the medicinal herbs that were prepared by the monks and hope that Sangsang would be cured overnight.</p><br/><p>After leaving Lanke Temple, Sangsang didn’t get any better and still felt languid. She nodded off all day long in the carriage that Ning Que bought.</p><br/><p>In fact, in addition to her low spirits, Sangsang didn’t have many other symptoms or any pain. It even seemed that she experienced a vernal fatigue.</p><br/><p>However, Ning Que was extremely nervous, for he knew that she would never get vernal fatigue or catch a cold. The way she behaved lately looked a lot like the situation when he took her to Lanke Temple for treatment in the autumn of that year, which disturbed him badly.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Passing through the capital city of Qi Kingdom, Sangsang became more and more exhausted. He remembered that he had left some rare and valuable medicinal herbs in the Taoist Hall here, so he decided to rest here for a night. He planned to relive the past and visit old acquaintances with Sangsang, in hopes of convincing her to care more about the human world.</p><br/><p>The Taoist Hall in the rain was closed, and some followers who came to seek medical help were kneeling on the stone steps in front of the hall and bowed devoutly. They were all wet and looked very miserable.</p><br/><p>Looking at the scene, Ning Que didn’t feel well.</p><br/><p>He did not sympathize with the followers, but was somewhat unhappy with the people inside the Taoist Hall.</p><br/><p>Normally, the decay and absurd of Taoism had nothing to do with him.</p><br/><p>Interestingly enough, he felt that since Haotian was his wife, then he was supposed to be concerned with Taoism. How could he allow those guys to undermine it?</p><br/><p>Walking to the front of the hall, he knocked on the door. His knuckles were slightly pale. He counted silently in his mind. If no one answers the door after the count of three, I will kick it open.</p><br/><p>The door was slowly creaking open. A bent middle-aged man came out and did not even look up, “What’s your business here?”</p><br/><p>Looking at this middle-aged man, Ning Que felt a little strange. This man clearly wore a divine priest’s robe which represented his distinguished status, but he gave an impression of being an inconspicuous handyman.</p><br/><p>Ning Que asked, “Why did no one answer these followers who came here to seek medical help?”</p><br/><p>The middle-aged divine priest sighed and was about to say something. Suddenly, there came several extremely arrogant voices behind him, along with strong aromas of wine and meat.</p><br/><p>“You dead cripple! I told you to ignore the door! Are you deaf?”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Shut the door!”</p><br/><p>“You think it’s still like before? Chen Cun is already dead! Who will protect you now?”</p><br/><p>Ning Que looked down and found that there was something wrong with the middle-aged divine priest’s legs.</p><br/><p>He knew who Chen Cun was.</p><br/><p>Chen Cun was a very senior red-robed divine priest of the Divine Hall of Light. He was squeezed out of Peach Mountain and then went to manage the Taoist Hall in Qi Kingdom. In the autumn of the year they went to Lanke Temple for medical help, Ning Que and Sangsang had met him in this hall.</p><br/><p>The next autumn, Ning Que and Sangsang were trapped in Yuelun Kingdom’s Chaoyang City and hunted by the whole world. Three red-robed divine priests helped them escape by using the Divine Skill of Light to explode themselves.</p><br/><p>At that time, a burning carriage appeared on the wilderness outside Chaoyang City, which was the scene of the last red-robed divine priest who used the Divine Skill of Light to explode himself. That divine priest was Chen Cun.</p><br/><p>Ning Que also remembered who this middle-aged divine priest was.</p><br/><p>He ordered, “Look up.”</p><br/><p>The middle-aged divine priest looked up and looked at Ning Que. He was puzzled at first, but soon his eyes were brimmed with bright, for he recognized Ning Que.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>He bursted into tears.</p><br/><p>…</p></div>\n</div>"}