{"title": "Chapter 923 - The Mean House", "id": 923, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-923-the-mean-house", "volume_title": "Volume 10", "body": "<h1>Chapter 923 - The Mean House</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The drainage in this area was completely renovated. Although it was not as good as that of the palace of South Jin Kingdom, which could keep the stairs dry during rainstorms, the continuous spring rains these days did not leave too many traces here. It proved that the followers, under the leadership of Ye Su, had been rewarded for their efforts.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Sangsang walked through the streets with her hands behind her back, and Tang Xiaotang followed her, with her black braid swaying in the spring breeze, which resembled her disturbed mood at this time.</p><br/><p>Sangsang was indeed her best friend. However, with Sangsang now being Haotian and she belonging to the Devil’s Doctrine, it seemed impossible for them to continue their friendship. She wondered why had Sangsang taken her out?</p><br/><p>Tang Xiaotang felt strange that Sangsang who used to be black and thin became so white and chubby, and she was also not used to the silence along the way. So she gently kicked the stone on the street to ease her tension.</p><br/><p>Walking up to the front of a vegetable store, Sangsang suddenly stopped and said, “He is now a basket case.”</p><br/><p>Tang Xiaotang froze for a while, then realized she was talking about Chen Pipi. “You locked up his Ocean of Qi and Mountain of Snow. He is weak and likes to stay in bed. Of course you can call him a basket case.”</p><br/><p>Walking into the store, Sangsang looked at the normal vegetables on the shelf and said, “I left Peach Mountain. The Divine Hall must have begun to chase you.”</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Tang Xiaotang said, “Yes. We can’t get through Qinghe without the Divine Hall knowing, otherwise we have already returned to Chang’an.”</p><br/><p>Sangsang stopped and turned to her. “Why?”</p><br/><p>Tang Xiaotang was puzzled and asked, “Why what?”</p><br/><p>Sangsang said, “Everything is determined by destiny. Why do you have to go to Peach Mountain to save him? Why do you accompany him to wander around? If you are willing to surrender to me, I will grant you eternity.”</p><br/><p>In a very inconspicuous vegetable store in Linkang City suffusing with the smell of vegetables and mud, she calmly said that she would grant Tang Xiaotang eternity.</p><br/><p>Tang Xiaotang was stunned for quite a while, and then said unnaturally, “This is a surprise for me…Why don’t we buy the ingredients for dinner first?”</p><br/><p>At this time, the woman who owned the vegetable store recognized Tang Xiaotang and greeted her warmly and humbly. The woman put everything that Tang Xiaotang was looking at into her basket.</p><br/><p>Sangsang was confused, pointed to the basket, and asked, “Don’t we need to pay for that?”</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Tang Xiaotang, Chen Pipi and Ye Su had lived together these days. Ye Su normally would teach the children in the street some courses. Thus, for the people living on this street, Ye Su was no different from a sage even though he lived in a decrepit house. They respected and adored Ye Su, and naturally gave Tang Xiaotang and Chen Pipi the same treatment.</p><br/><p>The woman thought that Sangsang was an ordinary friend of Tang Xiaotang. She patted her shoulder intimately and said with a smile, “Why are you regarding me as an outsider? How could I let you pay for these worthless vegetables?”</p><br/><p>Sangsang frowned, for she noticed that the woman had just touched the vegetables and had some muddy water on her hand.</p><br/><p>Tang Xiaotang quickly pulled the woman to the side and asked her to take care of her store with a smile. Then she looked at Sangsang and said nervously, “Please don’t be angry.”</p><br/><p>Sangsang said, “I just don’t understand. I thought that the poorer the people are, the more they value money.”</p><br/><p>Remembering that Sangsang was very mean when she was still a human being, Tang Xiaotang couldn’t help but laugh. “Sometimes people just like something so much that they use things that they value the most to express their kindness.”</p><br/><p>Sangsang thought about it and asked, “Like how the followers of Taoism devote their wealth and life to me?”</p><br/><p>Tang Xiaotang answered, “More or less. But…there is still a difference.”</p><br/><p>Sangsang asked, “What’s the difference?”</p><br/><p>Tang Xiaotang thought for a while and said, “Adore and respect?”</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Sangsang suddenly felt a little displeased, and then she found that she actually began to care about whether or not she was liked by others. Then she became even more displeased.</p><br/><p>The basket was stuffed with green vegetables. Tang Xiaotang offered to pay, but the woman rejected her firmly.</p><br/><p>Walking out of the store, Sangsang said, “You haven’t answered my question.”</p><br/><p>“Why?”</p><br/><p>Tang Xiaotang reached out to hold Sangsang’s hand, looked at her with sympathy and said, “After visiting so many places with Ning Que, you haven’t figured it out yet?”</p><br/><p>Sangsang answered, “That’s different. If he were to die, then I will die too. I have to follow him around.”</p><br/><p>Tang Xiaotang smiled and responded, “In fact, that’s not different at all. If Chen Pipi were to die, then I wouldn’t want to live by myself.”</p><br/><p>Sangsang thought for a while and said, “Humans are indeed stupid.”</p><br/><p>Tang Xiaotang said, “But sometimes we’re happy being stupid.”</p><br/><p>Sangsang looked at her hand and said, “I am not happy that you sympathize with me, and I am also not happy that you touch my body. I don’t understand why you are happy for being stupid.”</p><br/><p>Tang Xiaotang answered with a smile, “It is not a good thing for the Academy and Light’s Doctrine that you are still alive, but I am still very happy seeing you alive. Maybe this is the pleasure of being stupid?”</p><br/><p>…</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>…</p><br/><p>The two girls went out to buy food and talked heart to heart, leaving the three men in the decrepit house, who sat facing each other in silence. It didn’t matter how they survived as long as they were still alive.</p><br/><p>Chen Pipi looked at Ning Que and asked worriedly, “Is she willing to return to Chang’an with you?”</p><br/><p>Ning Que shook his head and answered, “She didn’t say so, but we are getting closer to Chang’an.”</p><br/><p>Chen Pipi asked, “Does she know about the Academy’s intention?”</p><br/><p>Ning Que said, “The Headmaster once said that Haotian knows everything.”</p><br/><p>Chen Pipi went silent for a moment and said, “If that is the case, then you have no chance of winning.”</p><br/><p>Looking at the blue sky and white clouds outside the window, Ning Que said, “The Headmaster also said that there are some people in the world who would do things which they know clearly can’t be achieved.”</p><br/><p>Chen Pipi said, “The Youngest Uncle and the Headmaster are exactly this kind of people. You and I may be more like them in the future, but this cannot influence her, for she is not a human.”</p><br/><p>Ning Que signed. “I hope she can make her own choice.”</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Chen Pipi said, “But no one will make a choice that may destroy themselves.”</p><br/><p>Ning Que laughed and said, “As you said, she is not human being.”</p><br/><p>Chen Pipi asked, “If so, what’s your plan?”</p><br/><p>Ning Que was hit by mixed feelings and answered, “I hope to find a solution when the time comes. The original plan I thought of now seems impractical.”</p><br/><p>Chen Pipi asked, “Is it possible to fix the God-Stunning Array without her?”</p><br/><p>Ning Que answered, “Whoever started the trouble should end it. She had lived in Chang’an for many years, and her footsteps and breath had broken the God-Stunning Array. To fix the array, she must be back to Chang’an.”</p><br/><p>Chen Pipi looked at him quietly, and then suggested, “I only hope that you have no regrets when the time comes. If you have any doubts, then it is better to change your mind now, for there will be no turning back when the time comes.”</p><br/><p>Ning Que said, “When I left Chang’an and went to Peach Mountain to pick her up, I had already made my mind. Even though I have to choose one day, it won’t be that hard.”</p><br/><p>Chen Pipi sighed, for he understood the hidden determination in his words.</p><br/><p>Ye Su kept quiet all the time and looked at the streets and the sky outside the window with a smile on his face. His pale face was covered by the sunlight and it seemed very gentle.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>All of a sudden, he said, “Play with god, you can only end up hurting yourself.”</p><br/><p>Ning Que turned to him and asked sincerely, “Do you mean that we will do nothing?”</p><br/><p>Ye Su turned around and smiled to him. “Doing well in your own business is more important than anything else. Haotian to Haotian, and Earth to Earth. Why bother meddling with things beyond our reach?”</p><br/><p>Haotian to Haotian, and Earth to Earth. This was the Tao that Ye Su believed.</p><br/><p>Ning Que was somehow woken up, and then asked, “The Divine Hall of West Hill won’t allow you to continue to preach, and even the Sword Garret can’t protect you. What are you going to do next?”</p><br/><p>Ye Su said, “Linkang City is getting better. I am ready to leave.”</p><br/><p>Chen Pipi was surprised, for he had learned that the Elder Brother intended to leave Linkang for the first time.</p><br/><p>“You are going to Chang’an, aren’t you?”</p><br/><p>Ning Que was also surprised. Since the Divine Hall won’t allow him to continue to preach, Ye Su can only go to the Tang where he can be tolerated after leaving the South Jin Kingdom. “Like I once said, the Tang is too good, and the world is too bad.”</p><br/><p>Ye Su continued to say calmly, “Since I plan to experience human sufferings and save humans, I have to step foot on the soil where sufferings happen and really understand the people who are suffering.”</p><br/><p>The sunlight penetrated the window and landed on him. His old shirt seemed to shine, and the chopsticks used in his Taoist bun seemed to be more beautiful than the most expensive ebony.</p><br/><p>Ning Que suddenly asked, “Do you remember the first time we met?”</p><div class=\"code-block code-block-8\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ye Su shook his head. When they first met at the foot of Tianqi Mountain in the Wilderness, Ye Su was still a proud traveling disciple of Taoism and had his eye on the position of Eldest Brother, and he had no impression of who Ning Que was.</p><br/><p>“But I am very impressed with you.” Ning Que looked at him and said, “I have never met a person so lonely, as if your feet were not standing on the ground but on another world. Although you are clearly alive, I still felt that you were dead for many years. To be more accurate, you seemed to be alive and dead at the same time in my eyes back then, and I pitied you.”</p><br/><p>Ye Su laughed and said, “You should pity me now.”</p><br/><p>Ning Que shook his head and said, “No. Although you are far less powerful than you were in the past, you are not pitiful at all. I think you will become a sage.”</p><br/><p>Ye Su said, “The world can only see a sage once in a millennium. You just give me too much credit.”</p><br/><p>Ning Que disagreed. “If you can make everybody become sage, then you are indeed a sage.”</p><br/><p>At this moment, the door was pushed open. Tang Xiaotang held the basket and shouted merrily, “Look, we brought so many vegetables back. Throw away the leftovers!”</p><br/><p>Dinner was very simple, mainly vegetables.</p><br/><p>In order to please Haotian, Chen Pipi went to the butcher shop to buy streaky pork and braised it with Chinese cabbage. Then he went next door and brought back two buckets of light wine.</p><br/><p>Meat and wine can always liven things up. After a little while, the atmosphere in the house was lively. Ning Que was a wimpy drinker and was no longer his normal self after a few drinks. He asked for paper and ink, and then wrote the famous article, “An Epigraph for My Humble Room”.</p><br/><p>“A mountain needn’t be high; it is famous so long as there is a deity on it. A lake needn’t be deep; it has supernatural power so long as there is a dragon in it. My home is humble, but it enjoys the fame of virtue so long as I am living in it. ”</p><br/><p>With her hands behind her back, Sangsang stared at the and then asked, “Who is “I”?”</p><br/><p>Ning Que answered angrily, “Why are you asking me such a philosophical issue?”</p><br/><p>Sangsang pointed to the word “I” on the paper.</p><br/><p>Ning Que then understood what she meant and pointed to Ye Su. All of a sudden, it occurred to him that Sangsang must had some expectations since she brought this up. So he pulled back his finger and answered, “I didn’t mean me.”</p><br/><p>“Then who is that?”</p><br/><p>“I am you, and you are me. Who do you think I am talking about? ”</p><br/><p>Sangsang knew he was lying, but she seemed satisfied.</p><br/><p>Chen Pipi was very dissatisfied and said sarcastically, “When you wrote the article, I just thought you are still shameless. After listening to your explanation, I realize that you can be worse.”</p><br/><p>Ning Que was angry and shouted, “I am always like this. Suck it up!”</p><br/><p>It was time to say goodbye.</p><br/><p>Sangsang couldn’t stand this kind of human custom so she stood afar with her hands behind her back.</p><br/><p>Chen Pipi looked at Ning Que and said, “Take care.”</p><br/><p>“I will.”</p><br/><p>Ning Que answered with smile and walked to Sangsang.</p><br/><p>Sangsang suddenly turned around and said to Ye Su, “You will be burned to death.”</p><br/><p>At this moment, the sky was covered with the sunset glow which was like blood and fire.</p><br/><p>Ye Su stood in the twilight and it looked like he was standing in fire.</p><br/><p>…</p><br/><p>…</p></div>\n</div>"}