{"title": "Chapter 924 - Long Time No See", "id": 924, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-924-long-time-no-see", "volume_title": "Volume 10", "body": "<h1>Chapter 924 - Long Time No See</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Chen Pipi and Tang Xiaotang stood anxiously at dusk in front of the shabby cottage. They looked at Ye Su but could not say anything. Haotian’s words meant a prophecy. She was never wrong. Then how could Ye Su survive?</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ye Su prostrated toward Sangsang’s receding figure. He did not feel anxious at all. Their meeting with Haotian today meant a lot to him, especially for his teaching. He could only feel calm.</p><br/><p>Ning Que and Sangsang left Linkang and walked slowly at dusk. He could no longer refrain from talking and asked, “Couldn’t you just say something nice?”</p><br/><p>Sangsang replied, “I told the truth.”</p><br/><p>Ning Que got angry. “That’s exactly why it’s inauspicious!”</p><br/><p>Sangsang did not talk further and walked north, holding her hands behind her back.</p><br/><p>No one knew if Ye Su was really going to be burned to death. Sangsang should know everything. However, she had been wrong many times when it came to things or people related to Ning Que.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ning Que turned to take a look at the City of Linkang at dusk and did not say anything further.</p><br/><p>The big black horse ran out of the hills and neighed with joy.</p><br/><p>…</p><br/><p>…</p><br/><p>Someone had been preaching in Linkang without the permission of the Divine Halls. It was not a surprised to the Divine Hall until they figured out who the priest was. It became a more serious matter when they found that his disciples were increasing and his teachings were profane.</p><br/><p>Behind the radiating curtains in Haotian’s Divine Hall, the Hierarch still looked strong and tall. He seemed outraged and kept waving his arms and shouting.</p><br/><p>Long Qing stood downstairs by the curtains and seemed extremely calm when hundreds of divine priests and deacons kneeled beside him. He knew that the Hierarch was not just angry about Ye Su’s preaching in Linkang. He became more irritated because of the the turbulence under the table, his awkward position, and an increasingly dangerous situation.</p><br/><p>The Divine Hall of Judgment had executed a bloody purge throughout the Taoism branches in the name of Haotian. In less than twenty days, many people from countless abbeys were arrested. The Secluded Pavilion was now packed with prisoners, most of whom were the Hierarch’s cronies.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The woman on the Seat of Heavenly Black Jade had made her strike. No one knew why she started attacking the Hierarch all of a sudden. Yet no one would choose a wrong side.</p><br/><p>The Hierarch had been the leader of the Divine Halls and Taoism for decades. He certainly had profound connections and should have attacked back or even suppressed the Divine Hall of Judgment. However, he seemed helpless this time. It was not only because the Abbey Dean had left Zhishou Abbey and returned to Peach Mountain, but also because the purge was ordered by Haotian.</p><br/><p>Hundreds of divine priests and deacons took his orders and left. Haotian’s Divine Hall became quiet again. As for how they could break through the blockade of South Jin and get into Linkang, that was their own concern. If they were to dare to doubt now, then they would definitely enrage the Hierarch.</p><br/><p>Long Qing bowed to the Hierarch behind the radiating curtains and left Haotian’s Divine Hall. He walked silently through the plateau, entered the solemn and frightening Divine Hall of Judgment, and went directly to the Secluded Pavilion via the tunnel that he knew well of.</p><br/><p>The Divine Hall of Judgment and the Secluded Pavilion was intensely guarded especially during such an upheaval. Everyone knew that the Divine Priest of Judgment was challenging the Hierarch, so no one from Haotian’s Divine Hall was allowed into the Divine Hall of Judgment.</p><br/><p>Yet Long Qing was an exception. Not only because he was already the descendent of Zhishou Abbey, but also because he used to live in this Divine Hall. He was the previous Divine Priest of Judgment and still had many loyal underlings here. While Ye Hongyu was away for the execution of the purge, who else dared to stay in his way?</p><br/><p>The Secluded Pavilion was as secluded as usual. No sounds could be heard in the cells along the dry corridor. The arrested divine priests were already half dead after the cruel tortures carried out by the Judicial Department. They were even unable to moan and could only lie on the dry straws and wait for their last moments to come.</p><br/><p>Although very quiet, the Secluded Pavilion had never been so crowded fin years. Hundreds of divine priests and deacons were held in prison after arrested by the Judicial Department throughout the world. A bloody odor penetrated the dim light and added to the suffocating atmosphere.</p><br/><p>Long Qing walked through the quiet corridor calmly without feeling suffocated. Looking through the waggling light and sensing the smell of blood, he could only feel his heart beating faster in excitement.</p><br/><p>He wore an ordinary priest robe. There was a hole in his chest under the robe. The robe moved up and down with his heart beating in the hole. It looked like tender waves in the South Sea under the waggling light.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>He opened the fence of one cell and walked to the bed. He looked at the blood stained old man lying on the straws and greeted calmly, “Long time no see, Priest Qu.”</p><br/><p>Qu Fengchi was the Chief Red-Robed Divine Priest stationed in Song Kingdom by the Divine Halls of West-Hill, and also the most loyal underling to the Hierarch. He ranked very highly in Taoism. During the previous purge against remaining underling of the Divine Hall of Light, he was the one who applied most unbridled ferocity. Therefore this time he had become a main target in this purge executed by the Divine Hall of Judgment.</p><br/><p>Ye Hongyu, the Divine Priest of Judgment went to the Song Kingdom in person, cut Qu Fengchi’s arms right in their Taoism Hall and had him dragged back to Peach Mountain by the cavalrymen of the Divine Halls. He was half dead now and the Hierarch could do nothing to it.</p><br/><p>Qu Fengchi had gone through ruthless tortures these days and the Hierarch never came for him. He knew that he was doomed and could only wait exhaustedly for that day to come.</p><br/><p>However, someone came for him today.</p><br/><p>Qu Fengchi opened his eyes with great difficulty and looked to the person beside his bed. This was a young priest with frightening scars on his face.</p><br/><p>Being the Chief Red-Robed Divine Priest stationed in Song Kingdom, how could he not know Long Qing?</p><br/><p>“Prince Long Qing?”</p><br/><p>Qu Fengchi was a bit shocked and confused, then became excited as he realized Long Qing’s relation with Ye Hongyu and his ranking in Taoism currently.</p><br/><p>Even the Hierarch had abandoned him. If there could still be someone to save him, that must be Long Qing and the Abbey Dean.</p><br/><p>The desperate Qu Fengchi suddenly found his last chance. He was restored immediately and his eyes were filled with hope and begging. He rushed to say, “I, Qu Fengchi would offer my life and soul to you, the Prince and the Abbey Dean. If only I could return to the Song Kingdom, I would offer my abbeys and all my fortune to you, Prince.”</p><br/><p>According to him, Long Qing definitely came for his rescue. The only prize he could pay now would be the several abbeys and his private fortune in the Song Kingdom. What else could he please him with?</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Long Qing said to him calmly, “Look at me.”</p><br/><p>Qu Fengchi felt confused but still looked into his eyes. Long Qing’s eyes were in ordinary black and white colors. However, the moment he looked into those eyes they changed peculiarly.</p><br/><p>The edge of his pupils disappeared and the black and white of his eyes merged.</p><br/><p>The black became lighter and the white darkened. They merged into grey, like the color of the earth when it first separated from heaven. In a split second, Long Qing’s eyes turned completely grey.</p><br/><p>Looking into these grey eyes, Qu Fengchi felt frightened and extremely cold. Instinctively he tried to turn away but only to find that he had lost control over his own body.</p><br/><p>Qu Fengchi’s cheeks suddenly sank. The blood stains on his body faded. He tried to scream but could not make a sound. He wanted to push Long Qing away but his arms were already broken by Ye Hongyu. Therefore he could only despairingly feel the draining of everything inside his body</p><br/><p>That was literally everything, with no exceptions. Qu Fengchi’s life and spirit, as well as his cultivation and psyche power were dispossessed by Long Qing with his immortal evil eyes in grey.</p><br/><p>In a wink of an eye, Qu Fengchi had died. Long Qing closed his eyes. When reopened, his grey eyes turned back to the normal black and white. There was nothing suspicious at all.</p><br/><p>No one would knew that he had taken another life. A whole bunch of perceptions and fresh knowledge was added into his Ocean of Consciousness and he became even stronger.</p><br/><p>Qu Fengchi’s dead body crouched wretchedly on the straws. Until his last moment he had not figured out why Long Qing wanted him instead of his treasures hidden in the Song Kingdom.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Long Qing walked out of the cell calmly and entered the next. He looked at the person on the bed and greeted calmly, “Long time no see, Priest Mu.”</p><br/><p>After a short while he stepped out again and entered the next.</p><br/><p>He repeated this silent and horrifying practice until dawn. He dispossessed many strong cultivators from the Left Royal Court of the Wilderness and his Grey Eyes practice had reached the highest level.</p><br/><p>Morning glory came in from the rock window and scattered on Long Qing’s face.</p><br/><p>He looked extremely calm and his eyes were in black and white. He seemed to be the most undistracted and limpid young man. With his cultivation level elevated, the scars on his face deepened instead of lightened. They looked even more horrifying, just like those demons on the murals inside the Divine Halls.</p><br/><p>Long Qing sighed to the morning glory outside and turned to leave the Secluded Pavilion.</p><br/><p>When a powerful cultivator breathed, his inhaling and exhaling was profound. When Long Qing breathed, his pink and moist heart and lungs squeezed against each other in the hole on his chest. It looked disgusting.</p><br/><p>However, among the disgusting flesh there was a blooming peach blossom hidden inside. It appeared black or golden now and then. In either color it looked pure and holy.</p><br/><p>…</p><br/><p>…</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Coming out of the Divine Hall of Judgment, Long Qing walked through the plateau again toward several humble stone cottages by the edge of the plateau.</p><br/><p>Years ago when Ye Hongyu came back almost as a wastrel after her fight with Lian Sheng in the Wilderness, she suffered from cold ridicule and bully because of her self-degradation. She stayed in one of those stone cottages during the difficult days.</p><br/><p>Long Qing did not come here to recall the past or to prove his power to that woman who was not present. He came to visit the Abbey Dean who lived here now.</p><br/><p>The Abbey Dean was the actual leader of Taoism now. He should have moved to the highest Divine Hall on Peach Mountain, Haotian’s Divine Hall, because the Hierarch had chosen to kneel in front of him.</p><br/><p>For some unknown reason the Abbey Dean chose to stay in a humble stone cottage on the plateau instead. He did not interfere with anything the Divine Halls of West-Hill was handling.</p><br/><p>Long Qing could not understand what the Abbey Dean was thinking about. Although the Hierarch had cultivated to a very high state, his weakened Taoist Heart was already exposed to the world. Why haven’t the Abbey Dean dismissed him?</p><br/><p>The Hierarch still had a strong influence on other kingdoms in the world. However, in Peach Mountain the Abbey Dean was absolutely supported by Zhao Nanhai and his group from the South Sea, as well as the elder divine priests, the Uncle and Long Qing himself. If the Abbey Dean were to thunder against the Hierarch, they could easily expel the Hierarch from Haotian’s Divine Hall.</p><br/><p>He stood in front of the stone cottage and wondered for a while. When he realized he could never figure out the reason, he shook his head and opened the ill-maintained wooden door. Upon an irritating squeak, he entered the darkness.</p><br/><p>It was very dark inside the stone cottage. He had to take a good look to see the Abbey Dean’s face clearly. The middle-aged priest behind the Abbey Dean’s wheelchair was almost invisible in the darkness.</p><br/><p>The Abbey Dean coughed a little bit and reached out for some water.</p><br/><p>The middle-aged priest had been holding the back of the wheelchair. Long Qing stepped forward, got the kettle and poured some water in to the bowl, then handed it to the Abbey Dean reverently.</p><br/><p>The Abbey Dean seemed feeling better after having some water, and said to Long Qing, “You seem perplexed.”</p><div class=\"code-block code-block-8\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Long Qing did not dare to hide and stated his doubts.</p><br/><p>The Abbey Dean did not elaborate much but just said calmly, “What you wanted to do, the Divine Priest of Judgment is doing you favor. Why are you still so anxious?”</p><br/><p>Long Qing understood this part, but he still could not understand why Ye Hongyu chose to make such a fierce attack against the Hierarch. It seemed like the Abbey Dean had been aware of the reason for long.</p><br/><p>Suddenly the Abbey Dean asked him, “What do you think of Ye Su?”</p><br/><p>Long Qing thought for a while and replied, “The Elder Brother is very talented.”</p><br/><p>The Abbey Dean nodded slowly and said, “He is indeed a rare genius in Taoism. I used to think he was less talented than Chan Pipi. It appears that I was wrong.”</p><br/><p>Long Qing wondered, now that the Elder Brother is already a wastrel, the Abbey Dean must be referring to his preaching in Linkang rather than his state of cultivation. “The Hierarch was furious and had sent out people to carry out thorough investigation in Linkang. However, in my opinion the Elder Brother just started preaching lately and his followers are mostly illiterate. There’s nothing to be worried about.”</p><br/><p>The Abbey Dean looked at a thin pamphlet in his hand and said, “I tried to train your elder brother to become the sharpest sword in Taoism. It was a pity this sword was destroyed by Jun Mo in Verdant Canyon, but surprisingly he opened another world for himself. He might even exceed what I had expected for him.”</p><br/><p>The thin pamphlet was a copy of Ye Su’s teaching recorded by someone sent to Linkang by the Divine Halls of West-Hill. His words were simple and his reasoning shallow. However, even the Abbey Dean was wavered.</p></div>\n</div>"}