{"title": "Chapter 928 - In the Human World (II)", "id": 928, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-928-in-the-human-world-ii", "volume_title": "Volume 10", "body": "<h1>Chapter 928 - In the Human World (II)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was already late spring in the Central Plains. In the north, it was no longer chilly and even became sweltering hot. The weather had become unpredictable these years, the same as Haotian’s mood.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Together with the heat came the drought. On the borders of the Wilderness there had always been little rain. Now it became even more dusty. The grass grew perversely on the grassland but it didn’t look good in the dust.</p><br/><p>It was even more dusty in the City of Wei. The northwest winds had left obvious traces on the clay walls. Dusts were carried everywhere. If it was in the past, the dust-covered old soldiers would have been cursing on top of their shabby barracks. General Ma would have been sighing over his dusty liquor in the bowl he was holding.</p><br/><p>It was still dusty, but these people were nowhere to be seen. Damages of the war from two years ago could still be seen around the corners of the walls. Winds could cut the walls but they could never erase the black blood stains. The leaning well with bitter well water had been filled with sand. The shabby barracks had already collapsed. The small city was abandoned. They could see no one in the city.</p><br/><p>On the contrary, outside the City of Wei there were plenty of people. Dozens of yurts stood steadily in the sandstorm. The savages enjoyed living in the wild. Praying and chanting could be heard from time to time.</p><br/><p>Standing under the blazing sun and in the piercing winds, Ning Que became even paler. He stared at the dead city where it used to be his home in profound silence. No one could tell what he was thinking about.</p><br/><p>Sangsang seemed more cheerful than before. She sat by the window in the carriage and looked at the yurts. She listened to the hearty and pure chantings and felt extremely calm.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Taoism had striven for the years and finally converted the most powerful clan in the Wilderness, the Golden Tribe. They were Haotian’s followers now.</p><br/><p>They worshiped Tengri, namely Haotian, and therefore Sangsang.</p><br/><p>The winds gradually disappeared outside the City of Wei. A piece of cloud covered the blazing sun and brought refreshing breezes from deep in the Wilderness. The savages came out of their yurts and indulged themselves in the rarely pleasant weather. They smiled with joy. An elderly even kneeled to kiss the ground in gratitude of Haotian’s bestowal.</p><br/><p>Ning Que turned to Sangsang and asked, “Did you send the cloud?”</p><br/><p>Sangsang did not answer. She lifted the blue curtain and stepped out of the carriage. She walked across the yurts and enjoyed the worship from the savages. Her eyebrows unfolded and the flowers on her blue dress bloomed.</p><br/><p>After leaving the Divine Halls, they had been to the Great River, Lanke Temple, South Jin Kingdom and the Tang Empire. She never felt like being in her own kingdom until now.</p><br/><p>The sun gradually set but it did not take away the heat. More savages came out of their yurts. The women started preparing their dinners while the men piled up firewoods and set up for a party in the night. It was a very lively scene.</p><br/><p>No one could see him and Sangsang.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The savages around the yurts suddenly went into a hail. Ning Que turned and found a group of black horses coming from the south of the City of Wei, driven by dozens of cavalrymen of the Golden Tribe.</p><br/><p>Upon seeing this he felt even more complicated.</p><br/><p>Those were no wild horses. They were the best warhorses the Tang Empire had raised in the Xiangwan Plain.</p><br/><p>The Tang Empire went short of warhorses and could no long find enough supply. According to the West Hill’s plan, the Tang Empire would ran out of warhorses in three years. Even if they could launch another war, the Tang Empire was doomed to be defeated.</p><br/><p>In another word, since the moment the Tang Empire ceded Xiangwan Plain, there was no chance for the empire to reclaim its former glory.</p><br/><p>There were about a thousand horses coming. It was the last bunch of trophies they acquired. The savages were definitely excited. The circle of firewood was instantly enlarged. They killed more lambs. Some high-ranked people sent their slaves to get numerous bottles of fine wine and collected another round of hail.</p><br/><p>The night fell. The campfire was set and everyone came out from their yurts. They circled by the campfire and started feasting and drinking. After getting a bit drunk, they started wrestling. Young boys and girls passionately danced in pairs.</p><br/><p>Ning Que stood outside the crowd and calmly looked at them. In fact, he had tried really hard not to look at the destroyed and abandoned City of Wei.</p><br/><p>The more cheerfully the savages celebrated, the more miserable the dusty city looked. The happier the savages were, the sadder the dusty city seemed. The more vigorous their campfire turned, the more outrageous the dusty city became.</p><br/><p>The big black horse sensed his fury and lowered his head gently. Sangsang finished her cruise and came back by the carriage. She asked, “Are you enraged?”</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ning Que answered calmly, “Yes. I am enraged.”</p><br/><p>Sangsang kept asking, “Why?”</p><br/><p>Ning Que did not look at her and said, “This is a human emotion. It has nothing to do with you.”</p><br/><p>Sangsang continued, “I am not a human being but I can analyze.”</p><br/><p>Ning Que said, “You will never understand.”</p><br/><p>Sangsang said, “You can explain it to me.”</p><br/><p>Ning Que said, “I am definitely enraged because of these savages, but I am even more enraged due to your indifference. It makes me sad and even start to doubt myself.”</p><br/><p>Sangsang asked, “Why should I be enraged as well?”</p><br/><p>Ning Que turned to her and said with a cold voice after a long pause, “You used to live here.”</p><br/><p>Sangsang remained unchanged and said, “I used to live in many places.”</p><br/><p>Ning Que looked into her eyes and continued, “The people in the City of Wei.. they used to treasure you so much.”</p><br/><p>Sangsang looked at the abandoned dusty city and remained silent for a while. Then she pointed at the celebrating savages by the campfire and said, “They love me too.”</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ning Que tried to control his anger and asked, “How could that be the same?”</p><br/><p>Sangsang answered calmly, “They are all my people. I treat them equally.”</p><br/><p>Ning Que could no longer hold his anger and thundered, “If you have not become an idiot, you should know clearly why they died… They died for you!”</p><br/><p>Sangsang still showed no sentiments at all. Her voice was still as cold as her expression, or rather, she had no expressions at all. She seemed extremely cold-hearted. “How about every war they fought other than this one? Throughout the years, humans have been slaughtering each other under my name. Do I need to be responsible for every war they have launched?”</p><br/><p>Ning Que looked again into her eyes and said, “You said so yourself, other than this one.”</p><br/><p>He did not say anything further and got onto the carriage. He whipped harshly in the wind and scared away the cooling winds and lights from the campfire.</p><br/><p>The carriage passed by the yurts and stopped again.</p><br/><p>The moon was not bright and hung above like a hook tonight. Stars studded on the night sky and shedded scattering lights on the Wilderness. The lights slightly brightened up the dark fields and a huge block of rocks.</p><br/><p>Dozens of wooden stands were erected among the rocks. Decayed and dried bodies were placed on the stands. According to their ripped clothes, they were definitely Tang soldiers.</p><br/><p>Ning Que could not figure out whether it was a flaunt by the Golden Tribe after the war or they were the spy-cavalrymen that the Tang army sent out last year but were arrested and tortured to death.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>He looked extremely calm, almost frosting.</p><br/><p>Upon a piercing sound, he pulled his blade out of the sheath and hacked to the block from a dozen of miles away. The blade chopped the air silently but an indistinct chilling whistle of the Vermilion Bird was heard.</p><br/><p>The block of rocks was divided into two piles upon a thump.</p><br/><p>A blazing flame was set off from his blade and landed on the rocks. In an instant, the wooden stands and the corpses of Tang soldiers were burnt into the purest ashes.</p><br/><p>Ning Que put his blade back to the sheath. The carriage carried on. He did not get into the carriage but sat on the shafts instead. He listened to the sounds of wheels rolling over the grass and looked into the darkness silently.</p><br/><p>After a long while, Sangsang’s voice was heard from inside the carriage. “I thought you were going to kill all those people outside the City of Wei or burn them slowly to death.”</p><br/><p>Ning Que did not turn to her and asked indifferently, “Would you stop me?”</p><br/><p>Sangsang said, “I don’t know.”</p><br/><p>Ning Que scorned, “Is there anything you Haotian don’t know?”</p><br/><p>Sangsang said, “Because there are things I don’t want to predict now.”</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ning Que visualized the handsome boys and charming girls by the campfire and calmed down gradually. He even spared a smile. “I have told you when we were in the imperial palace of Chang’an, in Qinghe Prefecture and in many other places. Everyone of them will die, with no exceptions. Therefore, I’m not in a hurry.”</p><br/><p>The carnival by the campfire, the dancing pairs of young boys and girls, the pious elderly and muddled teenage who just learned to ride — if all these beautiful existences were destroyed completely, what kind of charm it would bring?</p><br/><p>Sangsang’s voice became a bit chilling, “Do you think I will allow you to do that?”</p><br/><p>Ning Que said, “That is why I will defeat you first and then kill them all.”</p><br/><p>…</p><br/><p>…</p><br/><p>This was a journey of tracking back. From Lanke Temple to the City of Chang’an was one chapter of their past. From the City of Wei to the west was another. It was the same group of two people with a black horse and a black carriage. However, it used to be a cheerful journey with clouds following them from above and birds singing along their way. Whereas today there was nothing but silence.</p><br/><p>After they left the City of Wei, for some unknown reasons Ning Que became very quiet. He seldom talked to Sangsang and stared blankly at the fields for most of the time.</p><br/><p>When they passed by Shubi Lake, he had originally planned to stay overnight and let Sangsang relive their past. Then, he suddenly changed his mind and carried on that night.</p><br/><p>Sangsang knew that he was in a mood, but she did not care. At least it seemed to Ning Que that she did not care. Indeed she did have more important matters to care about.</p><br/><p>Haotian could predict anything in this world. She knew that their journey would lead to a satisfying end. Due to some thoughts she came across when she was pondering in the vast fields between Heaven and Earth, she confirmed again that there was one thing she could not predict.</p><br/><p>It was because she could not predict it that she had to go and see for herself. When she finished touring the human world, she would like to see the people and things that are beyond the human world. Then she should finally leave.</p><div class=\"code-block code-block-8\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>…</p></div>\n</div>"}