{"title": "Chapter 945 - A Prairie Fire", "id": 945, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-945-a-prairie-fire", "volume_title": "Volume 10", "body": "<h1>Chapter 945 - A Prairie Fire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>A monk walked out of the hall. He was young, swarthy and chubby. His eyes were set apart, which made him look honest and dull, while innocent and clumsy. Yet his eyes were crystal clear and glittering.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>He was holding a well steamed hot bun. The steamed bun tasted so good that he was engaging himself in the taste and forgot to look ahead. Thus he knocked into Ning Que.</p><br/><p>“Ouch! Ouch!”</p><br/><p>The monk rubbed his head and his fingers wiped the dots that were etched on his forehead. He was still tightly holding the steamed bun in his left hand and his fingers stuck to the bun. His eyes were filled with tears. It seemed like he was really in pain.</p><br/><p>He knocked into Ning Que because he was not watching his way. But upon seeing his clumsiness and innocence, Ning Que took pity on him and apologized to him tenderly.</p><br/><p>The monk looked into Ning Que and got stunned for a second. Then he seemed have forgotten his pain and suddenly cheered up. He gave the steamed bun to Ning Que and beamed a hearty smile, “Take it.”</p><br/><p>Ning Que found it abrupt and asked, “Why are you giving it to me?”</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The monk answered, “Because you look like me. My master said I am a good man. Then you must be a good man too.”</p><br/><p>Ning Que looked at this clumsy monk and wondered, How could I look like you? He asked, “Who are you?”</p><br/><p>The clumsy monk answered, “I’m Qingban Zi.”</p><br/><p>Ning Que figured from his expressions and words that this monk was probably mentally dysfunctional. He asked casually, “Where is Qingban Zi from?”</p><br/><p>Monk Qingban refused to answer and placed the steamed bun at Ning Que’s mouth.</p><br/><p>Ning Que took the bun to take a bite.</p><br/><p>Monk Qingban then clapped his hands cheerfully and led Ning Que towards the wall of the temple. He pointed to the moss-covered rock stairs outside the side entrance and said, “I come from here.”</p><br/><p>Ning Que looked at the rock stars and understood what he meant. He was probably abandoned by his parents and left on those rock stairs outside the White Tower Temple. The monks here took him in and raised him.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>“Why did you say we looked alike?” he asked curiously.</p><br/><p>Monk Qingban chuckled and looked shy. “My Master said I am dull but I brought wisdom from my previous lives. Fellow monks here all said I’m dull. You looked dull previously. Then you must have brought wisdom from your previous live as well.”</p><br/><p>Ning Que reasoned, I have the eminent monk Lian Sheng in my Ocean of Consciousness, of course I have wisdom. But the monks said Qingban is dull. How does dullness have anything to do with carrying on wisdom?</p><br/><p>Monk Qingban was innocent and lovable. Ning Que would never hurt him with such nonsense or cause trouble for him. He let Qingban hold his hand and stroll around the temple.</p><br/><p>The distant bell sounds in the temple pacified Ning Que’s mind. The strange feeling he experienced by the lake when he was watching the reflection of the White Tower on the lake water had completely disappeared, which made him feel comfortable.</p><br/><p>In a meditation room in the side hall, Monk Qingban showed Ning Que over three hundred volumes of Buddhist scriptures his Master had left to him, as if a child was showing off his collection of treasures.</p><br/><p>Ning Que did not want to upset him, so he picked up a volume randomly and started reading. He wowed from time to time. Monk Qingban sat restlessly beside him and looked very cheerful.</p><br/><p>The scriptures talked about the ultimate truth. Ning Que was perfunctory at the beginning. But gradually he found himself deeply captivated by the teaching and forgot about time.</p><br/><p>When recollected himself, it was already very dark. He was worried and stood up immediately. He woke up Monk Qingban who had been sleeping on his futon, left the White Tower Temple, and rushed home.</p><br/><p>He was worried because while he was indulging in reading scriptures, he had missed the time to cook dinner for Sangsang. Eating and sleeping were her most important businesses nowadays. What would she say?</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Sangsang was not in the courtyard. She was standing under the tree by the brook. She heard Ning Que’s footsteps but did not turn to him. Instead, she was still engaged in watching the sky.</p><br/><p>A small white flower in her hair shuddered in the wind.</p><br/><p>Ning Que came to her and expressed his sincerest apology for forgetting about cooking dinner tonight.</p><br/><p>Sangsang was in a very good mood because she had been watching the sky the whole day. It was so beautiful that she completely forgot about eating. So she forgave Ning Que generously.</p><br/><p>That night when they were having dinner in the courtyard, Ning Que mentioned what he saw in the White Tower Temple during the day. He told her about the dull Monk Qingban and asked, “Would you like to come with me and meet him tomorrow?”</p><br/><p>“It’s good you’ve made some new friends.”</p><br/><p>She answered like any ordinary housewife would, but did not promise to go with him the following day. Because she would rather stay home and watch the sky. It was so charming that she could never get enough of it.</p><br/><p>On the following days, when they were not strolling in the city, Ning Que spent most of his time in the White Tower Temple and chatted with Monk Qingban. He found peacefulness in listening to the bell sounds and reading the scriptures. Sometimes he brought some vegetarian dishes form the temple for Sangsang. But she was not interested.</p><br/><p>Sangsang kept being drowsy these days. When awake, she sat under the tree by the brook and watched the sky from dawn to dark. She found the sky very charming, yet somehow weird.</p><br/><p>One day, Ning Que suggested that she could watch the sky by the White Tower Temple as well. Sangsang found that reasonable and followed him to the White Tower Temple. Although she did not like the vegetarian food or the monks in the temple, she found the lake very beautiful. And the reflection of the sky in the lake was also beautiful in a different way. From then on she sat by the lake and watched the sky.</p><br/><p>Days passed by. With the sounds of morning bell and evening drum, Ning Que and Sangsang watched the lake, the sky and read scriptures. They found peace and joy. Time passed by so slowly that they did not realize how long they had spent there.</p><br/><p>…</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>…</p><br/><p>Distinctive bell sounds rang throughout the majestic peaks and hundreds of temples and woke up many monks. Different from the melodious sounds from Xuankong Temple in the past, the bell today sounded harsh and even anxious. It was a warning.</p><br/><p>The bell sounds conveyed a lot of messages and indicated the direction. Hundreds of soldier monks came out of the yellow temple on the West Peak and rushed down the hill. They mounted their steeds at the foot of the hill and darted off along the mountain pass towards somewhere in the wilderness in the underground. Their robes fluttered along the way, making an impressive scene.</p><br/><p>The Wilderness in the underground was vast. The previous years had been lonely and quiet. But today it was occupied with the deafening noise of battle somewhere deep in the Wilderness. Dust was everywhere. There was an odd mix of soldiers’ roaring, clashing of weapons and compassionate chanting.</p><br/><p>The former Buddha land had become a bloody battlefield. The previously pious believers became bloodsucking Shuras. However if killing was evil, then the Wilderness had been the Shuraba throughout the years.</p><br/><p>Hundreds of soldier monks holding iron cudgels arrived at the edge of the battlefield. They slowed down and lined up. Four monks with bamboo hats walked out of the line.</p><br/><p>The leading monk looked humble and firm. Even the shade of the bamboo hat could not cover the tranquility and zen in his eyes. He was Qi Nian, the World Wayfarer of Buddhism.</p><br/><p>The other three monks with bamboo hats were very old. They were the Elders from the Commandment Hall of Xuankong Temple.</p><br/><p>Qi Nian stared at the deafening battlefield. But his sight went beyond the dust created by horses and fell on the top of the cliff far away. Someone was standing atop the cliff and he should be responsible for the world below the cliff.</p><br/><p>The nobles from tens of tribes had assembled their troops and fought for dozens of days, and finally stopped the slaves at the meadow by the abandoned gold mine. The Xuankong Temple had sent their powerful soldier monks and strongest figures. It should be a definite win at this stage. But Qi Nian could not help but feel anxious. Because he did not think that that person would surrender so easily.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The uprising of slaves in the Wilderness in the underground had continued for a year.</p><br/><p>At the beginning it was only the uprising of a few shepherds from the poorest tribe. Dozens of men were killed. The tribe used harsh forces against the rebels and even caused a monk to be expelled by the Commandment Hall. To everyone’s surprise, the armed force assembled by the nobles as well as the expelled monk had all died in the attempt to put down the rebellion.</p><br/><p>The Xuankong Temple still did not pay much attention. During their rule over the underground world throughout generations, the monks had gotten used to the uprisings every several years. The descendants of previous rebels tended to forget the mercy they were granted from time to time and attempted to obtain privileges they were not qualified for. But no matter how fiercely they tried at the beginning, they were eventually easily suppressed by a few monks. The Xuankong Temple was very satisfied for being able to showcase the power of the divine hill to the believers with trivial effort.</p><br/><p>But this time it was different from the numerous uprisings in the past, distinctively different. The noble had assembled two thousand cavalrymen to put down the rebel force of barely over a hundred of weak, old and young shepherds, yet they could not succeed. Then they called more troops but still failed. Later on they sent thousands of cavalrymen and even involved professional slave-hunters but could still not succeed.</p><br/><p>They never stopped suppressing the rebels. Yet instead of being put down, the number of rebels kept growing. Even several traveling sadhus were killed in the fight.</p><br/><p>People started to talk about this rebel force throughout the underground world. It was also said that the rebel force had found the path to true Nirvana. Out of their instinctive desire for freedom and hatred toward pain and inequality, more and more people took sympathy for the rebels and joined them.</p><br/><p>Similar to the uprisings of the tribes by the cliff, the uprisings in the underground world were normally initiated by shepherds. Those people had been herders for generations, spending their lives with flocks of cows and sheep between heaven and earth, and thus possessed the strongest desire for freedom and held the firmest revolt for exploitation.</p><br/><p>With more people joining the rebel force, the underground world became even more chaotic. The rules of the Buddha land for thousands of years were putting under threat. The Xuankong Temple could no longer sit back and watch calmly, especially when more and more traveling sadhus were getting killed by the rebels.</p><br/><p>The monks from the Xuankong Temple were practitioners as well as the living Buddha the slaves used to worship. Their joining the battle was without a doubt a fatal attack to the slaves both mentally and physically.</p><br/><p>Within a short period of time, most of the rebel forces in the underground were suppressed.</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>However, there were always things that could not be easily ended once started, thoughts that could not be easily vanished once formed, and campfires that could not be crushed out once lighted. The uprising in the meadow seemed to have been suppressed. Yet who would know how many sparks of fire were hidden under the wild grass?</p><br/><p>A few months later, dozens of uprisings took place again in the underground world. The monks were busy putting down one after another here and there. They became exhausted and helpless in the series of endless uprisings.</p><br/><p>This was when the sparks became a prairie fire.</p><br/><p>…</p>\n</div>"}