{"title": "Chapter 942 - Attachment", "id": 942, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-942-attachment", "volume_title": "Volume 10", "body": "<h1>Chapter 942 - Attachment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>A bell was tolled in a temple not far from the street.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ning Que was folding his umbrella. The bell that rang in Xuankong Temple had tortured him well. Therefore he was staled upon the sounds of bell at this point and instinctively grabbed Sangsang’s hand.</p><br/><p>Sangsang looked at him emotionlessly. Ning Que then realized that they were no longer at Xuankong Temple. He felt embarrassed and put his hands behind his back as Sangsang always did.</p><br/><p>The bells rang even more loudly throughout every temple in Chaoyang City. Ning Que figured that the loudest sounds came from the ancient bell in White Tower Temple in the north.</p><br/><p>People on the streets were happily enjoying their bean jelly or pilaf on banana leaves or watching monkey shows. Upon hearing the bell, they stopped whatever they were doing and rushed towards the nearest temples.</p><br/><p>Some were not able to leave their business. So they kneeled down on the street, prostrated and prayed constantly. The monkey-show man also kneeled down in awe and tried to make his monkey bow as well.</p><br/><p>Ning Que and Sangsang were the only two left standing there. Although the pious Buddhists did not become hostile towards them, they did find them weird.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The bell had changed the scene in a cute way. It seemed like the flash mobs that Ning Que saw in the other world. The little monkey was cute. It was forced to kneel down by his master but kept rolling its eyes. However since they had witnessed the miserable world under Xuankong Temple, Ning Que found the scene disgusting now.</p><br/><p>Sangsang of course hated it more. She whisked her sleeves slightly.</p><br/><p>Upon her whisking, flowers bloomed on her green sleeves and wind roared through the street. It blew away the bean jelly stall and the pilaf on banana leaves, and grits got into people’s eyes. The monkey-show man tried to rub his eyes and the monkey was let loose. It did not ran away, but just followed the banana leaves and enjoyed the scattered pilaf.</p><br/><p>The bell sounds were disturbed by the wind and lost their rhythm. Yet the wind did not stop and continued blowing up towards the sky. It blowed the clouds into chaos above Chaoyang City.</p><br/><p>Sangsang felt satisfied and went forward with her hands on the back.</p><br/><p>Ning Que stared at her and kept silent.</p><br/><p>When she was in the Divine Halls of West-Hill, she did not need to do anything or even come up with any thought. Whenever she felt disturbed, stars appeared and disappeared from her eyes, numerous clouds gathered from ten of thousands of miles away and created storms and thunders above Peach Mountain. After they had left the West-Hill, particularly since they reached to the heart of the Wilderness, she started whisking her sleeves whenever she felt angry or joined a fight…</p><br/><p>Although Sangsang was still far more powerful than any human being could have ever imagined, she was indeed much weaker than she used to be. She was no longer almighty.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ning Que was upset but he could not say anything. The reason for her weakened state was the worldly bond the Headmaster had left inside her body. It was also because of the long and happy yet extremely dangerous journey they went through two years ago. It was more because he had taken her to tour around the human world and would not let her go.</p><br/><p>The street was enveloped with dust and choking smell of spices. But people were not coughing. Perhaps they had been used to it since a very young age.</p><br/><p>They walked in the dust and on the same route they used to travel.</p><br/><p>Ning Que and Sangsang once lived here for a long time. He carried her on his back during their exile and ran through many streets in this city. He killed many people here. But the blood stains were already gone within three years.</p><br/><p>…</p><br/><p>…</p><br/><p>They entered the chessboard on the plateau of Xuankong Temple and exited to Chaoyang City. It seemed unbelievable. But the only possibility was that Buddha had created a space tunnel between Xuankong Temple and Chaoyang City, the same as the one in Lanke Temple. And the chessboard was the key to those tunnels.</p><br/><p>Years ago, Ning Que and Sangsang left Lanke Temple in the southeast and ended in Xuankong Temple in the heart of the Wilderness. Today they traveled from Xuankong Temple directly to Chaoyang City.</p><br/><p>The two of them walked around Chaoyang City. It seemed they were trying to find some trace of Buddha. But actually they both knew that Buddha was not here.</p><br/><p>No one could hide from Haotian in the human world.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ning Que did not point it out. Neither did Sangsang. It seemed they were really searching for Buddha, and it was a time consuming task.</p><br/><p>“We need to find some accommodation first. Then we can take our time.” He said.</p><br/><p>Sangsang said nothing. Her silence meant consent. If she disagreed, then she would have told him or cut him into pieces to declare herself.</p><br/><p>In the crowded area to the north of the city, there was a secluded or even deadly quiet place. It was the courtyard house they used to live in. It had been a few years since they left but the place was still unoccupied.</p><br/><p>Ning Que opened the gate. It was as quiet as it used to be. The black cloth Ning Que used to cover the window was still hanging there. The only difference was the dust all over and the putty peeled off from the windows of the store room.</p><br/><p>Sangsang stared at the dusty and shabby courtyard. A moist wind came from the back of the yard and took away all the dust from the house. The place became extremely clean in a wink.</p><br/><p>Sangsang opened the door of the store room. She thought for a while but did not step in. Instead she walked into the bedroom and lied down. She was no longer the Daughter of Invariant Yama hence she did not need to hide from anyone.</p><br/><p>“Cook more vegetables for dinner,” she said.</p><br/><p>Ning Que agreed and came into the courtyard to collect some firewood. He looked at the only tree in the courtyard and felt reluctant to cut on it. Where is the crow that used to perch on this tree back then?</p><br/><p>The brook was still there behind the courtyard, and some trees too. He chopped some branches with his hands and turned to head back. Then he saw a distinctive fist print on one of the trees.</p><br/><p>Years ago when they were escaping from the hunting of Taoism and Buddhism, he had to take care of the very sick Sangsang and was extremely anxious and almost collapsed. He tried to let off his anxiety by punching on the tree. He was not aware of the power of his punch and almost broke the tree.</p><br/><p>Upon seeing that fist print, Ning Que bursted into laughter. He was pleased that the tree was not broken, and also that the print of his punch was still there because they were his most cherished memories.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>They were as cherished as the tree in the courtyard and the crow that used to perch on the tree.</p><br/><p>He piled up the firewood in a corner of the courtyard, opened the door and came to the side of the bed. He looked at Sangsang who seemed to be asleep and asked, “What vegetables do you want? I’m not familiar with the produce in Yuelun Kingdom.”</p><br/><p>Sangsang opened her eyes. They were bright and clear as if she was never sleeping or tired. Ning Que could never figure out why she needed sleep anyway.</p><br/><p>She thought for a while and said, “I’ll come with you.”</p><br/><p>They went to the market and bought a variety of vegetables. They also shopped at the grocery store for rice, cooking oil, seasonings, pots and pans and other necessities, as well as one pound of streaky pork. Then they went home and enjoyed a hearty dinner.</p><br/><p>To carry those goods, to cook and wash the dishes were all Ning Que’s duties. While he was doing all the work, Sangsang was standing by his side with her hands behind her the back, and looked at him or the sky from time to time.</p><br/><p>Ning Que squatted beside the washing basin and felt it even more exhausting than his former occupation of killing the gangsters years ago. After a short while he felt the pain on his back and could not help becoming irritated when seeing Sangsang standing idly by the door.</p><br/><p>“I know I’m no match to you now. I will take care of all the housework and you don’t need to help. You are the Haotian, the very honorable Haotian. There’s no way you would do such things. I have no objection with you standing there watching me laboring. But can you do me just one favor of not putting your hands behind your back?” He kept complaining. “You looked like a supervisor. It’s hurting my feelings.”</p><br/><p>Sangsang did not reply and walked into the room. With her hand still on her back, she ordered, “I want tea.”</p><br/><p>The Biblical God said, “Let there be light,” and there was light.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Sangsang was the god of this world. She wanted tea, so there had to be tea. She could have conjured various fine tea by herself, but she insisted that Ning Que should go buy tea for her.</p><br/><p>Ning Que was indeed exhausted yet he felt happy because he knew that Sangsang’s behavior was a proof of her deepened bond to the human world. And she was acting more and more like a real human.</p><br/><p>That night, he knocked open the door of the biggest tea shop in Chaoyang City, spent two ounces of silver and bought 74 types of most renowned tea produced in different kingdoms and packed several expensive tea sets.</p><br/><p>After three days of indulging in fine tea, Sangsang made another decision, “I want to play chess.”</p><br/><p>Then Ning Que spared no effort in searching for the best chess sets in town. But there was one problem he could not solve — she needed an opponent.</p><br/><p>“Your level is too low,” Sangsang looked at the white chessmen and said to him.</p><br/><p>The most annoying thing for a man was to lose to his woman when playing cards or chess. Ning Que was already on his edge and could not help becoming more irritated upon her words.</p><br/><p>“How could we, menial human beings, be a match against the almighty Haotian?”</p><br/><p>That was Sangsang’s most frequently used comment for human beings, but he said it with distinctive bitterness.</p><br/><p>Sangsang remained emotionless and said, “Human beings are indeed menial. But some are better than others. In terms of chess, Chen Pipi plays much better than you.”</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>It was even more hateful for a man when his woman said he was less competent than another man, even if that was his best buddy through thick and thin.</p><br/><p>Ning Que got enraged and exclaimed, “I can’t get him all the way here from Linkang.”</p><br/><p>Sangsang said, “Then you should think of something else.”</p><br/><p>On the following day, Ning Que escorted the top three chess players of Chaoyang City to their house.</p><br/><p>Or rather, he kidnapped them.</p><br/><p>Apart from enjoying tea, playing chess and watching operas, Ning Que and Sangsang sometimes also went strolling through Chaoyang City. They walked to the White Tower as well as around the lake. She was still used to putting her hands behind her back.</p><br/><p>Dozens of days went by quietly.</p><br/><p>They seemed to be searching for something in Chaoyang City, but actually they were looking for nothing. They did not ask where, why or how but only cared about their next meals. They were playing this very tacitly.</p><br/><p>One night, Ning Que unpeeled a mangosteen and placed the white fruit next to Sangsang’s face and asked, “Don’t you think it looks like an ass?”</p><br/><p>Sangsang seldom had any emotions. But he was not reconciled to it.</p><br/><p>It was no exception this time.</p><br/><p>Sangsang looked at him quietly for a long while then asked, “We are so too attached to this. Aren’t we?”</p><div class=\"code-block code-block-8\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Ning Que kept silent for a while. Then he gave the mangosteen to Sangsang and walked to the courtyard. He practiced his sword skills and fetched some water from the brook. After taking a shower he said, “I’m going to bed.”</p><br/><p>Sangsang sat by the table, stared at the tree outside the window and said nothing.</p><br/><p>She used to be so eager to return to Haotian’s Divine Kingdom. It was her mission. As long as she could kill Buddha and Ning Que, she would be able to head back.</p><br/><p>But sne and Ning Que were each other’s natal item. If Ning Que were to die, then she would die too. The one returning to the Divine Kingdom would be Haotian instead of Sangsang. She would no longer be her.</p><br/><p>Yet she wanted to carry on as herself and to bear the name of Sangsang. What made her more irritated and anxious was that she even wanted to stay with him and continue their peaceful life here in this courtyard.</p><br/><p>It was after all not a bad life here as they enjoyed the tasty vegetables, juicy meat and rice, drank tea, played chess and looked idly at the sky from time to time.</p><br/><p>Therefore she did not want to worry about Buddha, the Academy, Taoism, the Divine Kingdom or the human world. As long as they could carry on with their life here, she would continue to be Sangsang and he would always be there for her.</p><br/><p>Indeed, she was very attached to this.</p><br/><p>Ning Que once asked this question when they were outside Chang’an City: How could I find the perfect way in which I would never let down the people in Chang’an or betray you? But he knew there would never be such a perfect way.</p><br/><p>He was not afraid of death. He could have threatened Sangsang with suicide and forced her to enter Chang’an. Then the Academy would have gotten a hold of her with the help of the God Stunning Array. In that case, neither Buddhism nor Taoism could ever defeat them.</p><br/><p>However, he could not do that to her.</p><br/><p>Therefore he took her to their little courtyard in Chaoyang City and tried to stay away from the human world. He tried to walk away from the Academy, from searching for Buddha and from everything else.</p><br/><p>Indeed, he was also very attached to it.</p><br/><p>…</p><br/><p>…</p><br/><p>They were so attached to the temporary happiness, even though it might only last for a day, or even an hour. Ning Que and Sangsang never touched that topic ever since.</p><br/><p>They carried on with their ordinary life for another half a year in Chaoyang City. Nothing happened in the outside caught their attention.</p><br/><p>When spring came, Chaoyang City became very lively. Stage operas were performed everywhere. One day after a performance, Ning Que and Sangsang bought half pound of pig head meat on their way home and made a very simple dinner.</p><br/><p>When she was about to finish the few pieces of meat left in the bowl, Sangsang complained, “The dishes were too simple today.”</p><br/><p>Ning Que wondered, Who would make a feast every single day? He tried to drew away her attention and said, “We’ll make something good tomorrow. Did you enjoy the performance today?”</p><br/><p>Sangsang showed no emotions. She stood up and walked toward the courtyard.</p><br/><p>Ning Que was stunned. Then he put the chopsticks and bowls into the washing basin, cleaned his hands and rushed out to follow her.</p><br/><p>She walked to the woods by the brook, and stared at the sky in silence with her hands behind her back.</p><br/><p>Ning Que looked at the fist print on the tree. It had only been half a year. The print was already fading due to the newly grown bark. So did his mood. You have to leave after all, don’t you?</p><br/><p>Sangsang asked, “Are we really together just because we’re staying together?”</p><br/><p>Ning Que knew what she meant. He said after a while of silence, “We are together because we are meant to be together. It was not me trying to keep you in the human world.”</p><br/><p>Sangsang kept quiet for a long while.</p><br/><p>Ning Que said, “You know what I am thinking about.”</p><br/><p>Sangsang said, “Yes. I know your thoughts. But it is still attachment.”</p><br/><p>Ning Que looked at her side and said, “Attachment is not a sin.”</p><br/><p>Sangsang stared at the sky and said, “It is.”</p><br/><p>What was attachment? To love someone was attachment.</p><br/><p>To love was to be attached.</p><br/><p>A moment of romance in the human world was worthy of years in the Divine Kingdom.</p><br/><p>But it was after all too short.</p></div>\n</div>"}