{"title": "Chapter 946 - Breaking the Bones", "id": 946, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-946-breaking-the-bones", "volume_title": "Volume 10", "body": "<h1>Chapter 946 - Breaking the Bones</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The uprising spread like a prairie fire into two thirds of the tribes. The earliest rebel force had now become the strongest with over four thousand soldiers. They were so valiant that in one year they had crossed the Wilderness from the remotest cliff to within two hundred miles to the giant peak.</p><div class=\"code-block code-block-1\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Although they were still not able to weaken the foundation of the Buddha land, the Xuankong Temple had sensed the tremendous threat. The monks would never allow those rebels to mount the divine hill.</p><br/><p>Qi Nian was the World Wayfarer of Buddhism. Being the most powerful in the Xuankong Temple, he had been guarding the only path to the peak ever since the uprising turned vigorous. He seemed as invincible as that person who guarded the front of the Verdant Canyon years ago. However, with the rebellion army approaching, he could no longer sit still.</p><br/><p>Qi Nian already figured out the fundamental difference between this uprising and those in the previous years. In the past these slaves in the underground world were merely venting their anger, whereas this time they knew clearly what they were fighting for. Therefore they were exceptionally firm and courageous.</p><br/><p>Someone had brought hope to the slaves and indicated a clear direction. Moreover, he fought together with the slaves and led them in the battlefields.</p><br/><p>Recalling his name, Qi Nian became more anxious. And his expression became firmer under the shade of the bamboo hat. Knowing that he was right there in the rebellion army, he had to leave the peak and came to the field. He knew that the three Elders of the Commandment Hall could not withstand him.</p><br/><p>To face this person, the Xuankong Temple could never be overly prepared. Qi Nian was even certain if it wasn’t for the Chief Monk not being able to leave the plateau, he would have came to the battlefield himself.</p><div class=\"code-block code-block-2\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Deafening noises were heard in the dusty battlefield afar. Qi Nian came back from his pondering and looked toward the battlefield silently. He knew that the battle was about to come to an end today.</p><br/><p>Darkness prevailed. Thousands of people from the major tribes were killed in the battle only to barely stop the rebelling slaves by the edge of the meadow. People were howling and moaning everywhere in the field.</p><br/><p>The battle came to a pause. Qi Nian and the monks looked at the meadow from a distance and felt a complex of emotions. The rebels had set up a dozen of very shabby tents in the fields. The elders were treating the injured young soldiers. Others were cooking dinner by the tents. A huge pot was hung above the fire. It seemed they were cooking lamb. In front of the center tent, many people sat down in a circle and were listening to someone talk.</p><br/><p>The night was longer in the underground world then it was atop the peak in the temples. Compared with the real world above the ground, it was too long and tiresome. But Qi Nian was not tired of it. He stood in the field quietly until the stars faded and morning glory came back. Then he lead the monks slowly to the battlefield.</p><br/><p>A dozen of nobles dressed in finery kneeled in excitement and awe. They did not dare even to take a look. Because anyone coming down from the divine hill was like a living Buddha to them.</p><br/><p>The cavalrymen already got up. They were washing and enjoying their breakfast with slaves serving by their side. The rebels also got up in the meadow afar. There were no slaves in their camps. But there were the elderly, women, and children.</p><br/><p>This rebel force had brought along the families of their weak, sick, elder and young soldiers as well as orphans from their tribes. It was a stupid decision of military operation. Yet it was admirable.</p><br/><p>Qi Nian walked to the front. The nobles were pious and even turned fanatical. They kept kissing his footprints. He paid no attention to them but quietly stared at the meadow afar.</p><div class=\"code-block code-block-3\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>The Elder of the Commandment Hall standing to his right was also staring at the meadow in the morning glory and the slaves who were dressed in ragged clothes but seemed very cheerful. He was suddenly enraged for unknown reasons.</p><br/><p>“All those rebels are going to hell.”</p><br/><p>Upon this ruthless order, the fierce battle was started again. Several major tribes assembled their thousands of cavalrymen and darted toward the rebels. They rode on their steeds and swayed the machetes, talking dirty and wearing brutal expressions with bloodshot eyes.</p><br/><p>The cavalrymen were far better equipped than those rebelling slaves, especially two hundred cavalrymen darting in the front. They were armed to the teeth and starkly contrasted their enemies.</p><br/><p>Their intensive clops sounded like pouring rain, and their blades were shining like sunlight. The cavalrymen had come to the field several hundreds of miles away from the slaves. Their howling was sky-cracking.</p><br/><p>Then, numerous arrows were shot towards them.</p><br/><p>The monks from the Xuankong Temple saw clearly that there were only dozens of archers in the rebellion army. Their bows and arrows were so crude that some of the arrows were even featherless. How could they shoot their targets with such arrows? Even if they were to reach the targets, how could they break the armors?</p><br/><p>The Elders exuded some sympathy, but rather mockingly. However Qi Nian still looked worried. Because he had better vision and found out that they arrows were made with prismatic stones instead of metal arrowheads.</p><br/><p>A wind rose from the meadow all of a sudden. The wind was weird. It was not blowing randomly like some natural wind but rather pointed clearly towards the cavalrymen.</p><br/><p>Those featherless arrows flew proudly in the roaring wind. They did not need precise targets and sped up into bouts of shadows.</p><div class=\"code-block code-block-4\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Bang! Bang! Bang! Following dozens of low bumping sounds, the pioneer cavalrymen were hit to the ground like reaped wild grass.</p><br/><p>The falling cavalrymen rolled over on the ground in pain and vomited blood. They did not want to give up. Yet they could struggle no more.</p><br/><p>There were clear pits on the armors of the dead cavalrymen. The rebelling slaves had very little clothes and food, not to mention materials to make sharp arrowheads. Even with the help of the roaring wind, their arrows broke through the armors. But their arrows came with stone heads. Dashing down in the wind, they created powerful punches on the armors and crashed the cavalrymen’s vital organs.</p><br/><p>The stone arrows had created heavy casualties. But there were many cavalrymen from the tribes. With their pioneers down, the rest of them poured toward the meadow and made deafening killing sounds.</p><br/><p>This was a very unbalanced battle. The cavalrymen were dressed in either iron or leather armors and were holding sharp blades. While the slaves were swarthy and skinny, either too old or too young and wore ragged clothes. Most of them were holding bamboo spears. Some were even holding pieces of bones that probably came from their lamb dinner last night.</p><br/><p>In battles, equipments were important. But the most important factor was always the people. Although the slaves did not have armors or blades, they did possess courage, desire, and integrity.</p><br/><p>Facing the iron flood of cavalrymen, the slaves were pale but firm. They held up their bamboo spears with trembling hands but none of them would surrender or flee.</p><br/><p>A seemingly weak bamboo spear broke through some seemingly strong armor.</p><br/><p>Another bamboo spear was broken by a thrusting cavalryman and blood stained the hands of the slaves. Then they howled wildly and flooded onto that cavalryman.</p><br/><p>Similar things happened throughout the meadows. The arrogant cavalrymen were pushed down and crushed dead by the weak slave army.</p><br/><p>The cavalry had lost their speed and was outnumbered by the slaves. The slaves held up their rocks and bones and encircled the nearby cavalryman, then hit against him.</p><br/><p>They hit the cavalrymen’s armors with rocks and smashed their heads. They used the bones to knock off the cavalrymen and broke their leg bones. The cavalrymen tried to sway their blades aimlessly but were eventually pounded to death.</p><div class=\"code-block code-block-5\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>Blood flooded the meadow. Sounds of breaking bones were heard everywhere. The slaves howled like beasts and pounded non-stop.</p><br/><p>They had lived in the dark fields and enslaved by the nobles and masters for generations. Their ancestors used to be stoned by those people. They were exploited to their bones by those people. Today was finally their turn to stone them and smash their bones.</p><br/><p>The Buddha had been teaching his disciples and followers about samsara, the cycle of cause and effect, and retribution. This was exactly the retribution, the result of cause and effect, and samsara.</p><br/><p>Witnessing the brutal and bloody battle and the tribes almost being defeated, the Elders from the Commandment Hall could no longer feel sympathetic but enraged and ruthless.</p><br/><p>Qi Nian paused and said, “The Buddha is compassionate.”</p><br/><p>“The Buddha is compassionate!”</p><br/><p>Over a hundred of soldier monks from the West Peak of the Xuankong Temple pressed their palms together and called the Buddha. There was no compassion in their voices but only ruthlessness and determination.</p><br/><p>Upon the calling, the soldiers monks inserted their iron cudgels deep into the fields.</p><br/><p>It sounded like thunder above the Wilderness.</p><br/><p>A massive bout of power spread out toward the meadow from beneath the intensively placed iron cudgels. The Wilderness started quaking as if some vajra was rushing under the ground.</p><div class=\"code-block code-block-6\" style=\"margin: 8px 0; clear: both;\"></div><br/><p>A dozen of slaves were knocked up and threw onto the ground. They were crushed dead.</p><br/><p>“The Buddha is compassionate!”</p><br/><p>The soldier monks called the Buddha again and pulled out their iron cudgels. They rushed into the battlefield. Their robes fluttered awe-inspiringly.</p><br/><p>The slave had almost defeated the cavalrymen. But all of a sudden they heard the calling for Buddha and saw the soldier monks. Colors were drained immediately from their faces and they looked startled.</p><br/><p>For them, these soldier monks from the divine hill were living Buddhas.</p><br/><p>They were ordinary human beings. How could they stand against the living Buddhas? Right then, someone started chanting inside the tent in the center of the meadow.</p><br/><p>Upon hearing his voice, the slaves were refreshed and reassured. They held their iron blades and bamboo spears tighter and dashed toward the soldier monks.</p><br/><p>The soldier monks kept calling the Buddha. Their callings were like thunder.</p><br/><p>The slaves were also chanting by repeating what the person inside the tent said. It was a very short sutra. They recited it word by word. Each word in the sutra was pounding and firm and sounded like real thunder.</p><br/><p>…</p><div class=\"code-block code-block-7\" style=\"margin: 8px 0; clear: both;\"></div>\n</div>"}