{"title": "Chapter 959 - The Sky Wants to Strike You", "id": 959, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-959-the-sky-wants-to-strike-you", "volume_title": "Volume 10", "body": "<h1>Chapter 959 - The Sky Wants to Strike You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>If there was a hole in the corner, Ning Que would definitely go in, no matter whether it was the endless abyss or the legendary gloom. But there was no hole. He could only hold his head and shake in pain and sweat. His lips didn’t stop bleeding. His clothes were wet from his tears.</p><br/><p>He had never experienced such terrible pain, and he even felt that it was more painful than the torture he suffered when he was caught by mounted gangsters in the Wilderness. The axe in his head and the invisible large axe in the sky kept striking, as if they would never stop.</p><br/><p>Later on, his body even began to twitch, his eyes began to drift, and even his lips turned gray. He was not far off from being dead.</p><br/><p>After a long time, the large axe in the sky finally stopped, but the axe in his head was still striking. Feeling a little better, he stood up with unimaginable perseverance and then rushed out of the meditation room. He dared not to even turn around and glance at the shadow.</p><br/><p>Ning Que escaped from the White Tower Temple, and under the astonished looks of people in Chaoyang City, he kept coughing blood and staggered back to the small courtyard. After seeing Sangsang under the tree, he was finally relieved. Then he could no longer resist the weakness brought by the severe pain and finally passed out.</p><br/><p>When he woke up, the sky was bright outside, and Sangsang was asleep by the bedside. There was a bowl of ginseng porridge on the table, and the porridge still had a touch of heat. It seemed that she had been repeatedly warming it last night.</p><br/><p>Remembering all the nights they spent together back in City of Wei and Chang’an many years ago, Ning Que felt warm and got up and lifted her to the bed, tucking her in the quilt. Then he heard a sound from his belly and realized he was very hungry. He picked up the bowl and drank up the porridge. After wiping his mouth clean, he was prepared to go to the White Tower Temple as usual, but suddenly he turned extremely pale.</p><br/><p>He remembered what happened in the meditation room last night. Then he felt a sharp pain in his head. Obviously there was no one trying to hurt him with an axe at this moment, but he could still feel the pain.</p><br/><p>Sangsang opened her eyes and stared at him quietly for a long time. All of a sudden, she pointed at his head and said, “There is someone in your head, and he wants to come out.”</p><br/><p>Nothing could get past Haotian’s eyes, but she couldn’t explain what happened to Ning Que. Why was there someone in his head who was chopping him with an axe? Even if she could explain this problem, how could she explain the invisible large axe falling down from the sky?</p><br/><p>Walking to the window, Ning Que looked at the gray sky and asked in a trembling voice, “Why were you trying to strike me that day?”</p><br/><p>Sangsang thought for a while and said, “Probably because you rarely accompany me and often forget to cook for me these days, so you were struck by lightning?”</p><br/><p>“There was no lightning. The sky just kept striking,” Ning Que answered.</p><br/><p>Sangsang asked, “What’s the difference?”</p><br/><p>Turning pale, Ning Que looked back and said to her, “Why does the sky want to strike me?”</p><br/><p>Sangsang pointed to herself and said, “I am the sky. Maybe it is me who wants to strike you.”</p><br/><p>Ning Que asked, “So it was you?”</p><br/><p>Looking at the sky outside the window, Sangsang answered, “Maybe it was the other me who can’t stand the way you treat me.”</p><br/><p>Remembering the pain he suffered last night, Ning Que yelled out, “I married you. Why does your twin brother or sister treat me like this? Is there any justice?”</p><br/><p>Sangsang answered calmly, “What we do is justice.”</p><br/><p>Ning Que thought that the statement was quite unreasonable, but he didn’t know whether or not what she said was correct. Anyway, he decided not to go to the White Tower Temple today. Although he wanted to figure out what the shadow on the wall was and why the axes in his head and in the sky wanted to chop him, he didn’t want to relive the pain he suffered last night. Human curiosity could indeed overcome the fear of the unknown, but it did not necessarily overcome the pain.</p><br/><p>He stayed in the small courtyard and accompanied Sangsang in looking at the sky. Whenever a bell came from a temple in the distance, he would turn pale for he was still scared.</p><br/><p>Looking at his expression, Sangsang was confused and said, “You are not afraid of pain in the past.”</p><br/><p>Ning Que said, “Actually I have always been terrified of pain. I just pretend that I am not since I have to take care of you.”</p><br/><p>Sangsang replied, “You still have to take care of me now.”</p><br/><p>Ning Que thought for a while and said, “You do have a point. I have to figure out the whole matter, otherwise something bad might happen. But I need some time to recover from the fear.”</p><br/><p>Maybe because he underestimated the curiosity of human beings, or because he had to take care of Sangsang that he defeated his fears. He did not wait any longer and returned to the White Tower Temple the next day.</p><br/><p>Monk Qingban tried to gossip with him as usual, but he didn’t have the mood, so he just went straight to the meditation room. The wall that was smashed by him last night had been fixed.</p><br/><p>Facing the wall, he went silent for a long time, and there was no shadow on the wall.</p><br/><p>He sat back at the table and began to read the Buddhist scriptures. When twilight came, he lit the candles on the table. His hands were trembling while he was igniting the candle, so the flames were slightly shaking.</p><br/><p>The shadow reappeared on the wall. At the beginning, it was faint due to the shaking flames, but it took only a short time for the shadow to become clear.</p><br/><p>Ning Que stood up, and this simple gesture seemed to have consumed all his strength. And he was staggering while walking toward the wall.</p><br/><p>The shadow sat with its legs crossed, as if it was cultivating Buddha Dharma.</p><br/><p>Breathing deeply several times, Ning Que faced the wall and sat with his legs crossed.</p><br/><p>“Who are you?” he looked at the shadow and asked.</p><br/><p>The shadow naturally did not answer him and was as silent as a dead monk.</p><br/><p>Ning Que stared at the shadow, as if he was trying to see through it.</p><br/><p>The shadow had no eyes, so naturally it couldn’t look back at him.</p><br/><p>Just when Ning Que thought that he would spend the night peacefully, a bell suddenly came from the White Tower Temple.</p><br/><p>Just like the night before, the evening course had already ended, but the bell began to echo. He couldn’t figure out where the bell came from, the Buddha hall or his heart.</p><br/><p>Ning Que looked nervous, for he remembered that something strange happened last night after hearing the bell.</p><br/><p>It was also true tonight. The bell seemed to be the signal of the beginning of the disaster. The bell which was supposed to make people calm made the shadow on the wall become crazy.</p><br/><p>The shadow was no longer crossing its legs, but standing up and waving its arms toward the sky. From its fierce movements, it seemed like the shadow was not calling someone, but cursing loudly toward a certain spot in the sky.</p><br/><p>The shadow turned into a black flame and kept dancing, as if it wanted to burn everything. And it also looked like a prisoner in pain who was burning at the stake. The body was scorched by the flame, which was particularly scary.</p><br/><p>Ning Que felt sad and began to cry, for he once again felt the unwillingness, desperation, and anger of the shadow and sensed the endless desolation and sadness.</p><br/><p>It seemed that he was seeing an old monk who was standing in front of a grave, facing the torrential rain falling in the night sky and angrily curssing at Taoism and Buddhism, as of it wished to tear the world apart.</p><br/><p>Ning Que bursted into tears, not only because he sensed these emotions, but also because he knew that he was about to suffer the pain like the night before.</p><br/><p>A loud noise!</p><br/><p>Ning Que felt that someone was standing in his Ocean of Consciousness, holding a sharp axe and swinging it into his skull. It seemed like that person was trying to break his head and jump out.</p><br/><p>The intense pain spread from his head to his limbs, and he even felt that his skin was being pinched by numerous fine needles. The feeling was like being peeled and then sprinkled with sea salt!</p><br/><p>Ning Que suddenly turned pale, and his body kept shaking, like a mountain which might collapse at any time. But he had been prepared for tonight and forced himself to maintain the leg-crossed posture.</p><br/><p>“Lian Sheng! What are you going to do?!” He looked at the shadow on the wall and shouted angrily.</p><br/><p>The shadow on the wall did not answer him, but kept struggling desperately, screaming at the sky and striking. So the axe kept chopping Ning Que’s head.</p><br/><p>Enduring the pain, Ning Que bit his lips and shouted with trembling and hoarse voice, “You stop now, or I will kill you!”</p><br/><p>Lian Sheng’s conscious fragments had been lying quietly in the depths of his Ocean of Consciousness for many years, and it would only shine and give some instruction when Ning Que encountered danger.</p><br/><p>Although the consciousness of Lian Sheng was very powerful, it was after all only the remnants left after his death. Ning Que believed that he could suppress it with the strength of his Psyche Power.</p><br/><p>The shadow still ignored him and seemed very contemptuous.</p><br/><p>Because of the pain, Ning Que’s eyebrows kept beating and his clothes had been soaked by sweat. He knew that he could no longer endure it, so he used his Psyche Power to dive into the depths of his Ocean of Consciousness.</p><br/><p>Although he felt pity and unwilling to do so, he still had to destroy the fragments of consciousness left by Lian Sheng, otherwise he might actually go crazy in this kind of pain or even die directly.</p><br/><p>But he forgot there were two axes.</p><br/><p>Just as he mobilized his Psyche Power, a thunder-like bell came from the sky above the White Tower Temple.</p><br/><p>The invisible large axe fell from the high sky and fell directly on him.</p><br/><p>At this moment, he felt that his body was split into halves and his heart was also split into halves.</p><br/><p>Although he bit his lip, he couldn’t stop his painful shouting.</p><br/><p>He fell to the ground and vomited blood painfully, and his body kept twisting, like a loach in a hot pot. Soon the ground was besmeared with blood.</p><br/><p>The axe from the sky continued to chop, and the axe from his Ocean of Consciousness continued to chop too. He could no longer bear the pain and finally passed out. But even in a coma, his body still twitched from time to time. Obviously, the two axes were still chopping nonstop.</p><br/><p>After a long time, he woke up in the meditation room, and the sky was already bright. He was in a coma for the whole night, but fortunately, the bell and the axes stopped.</p><br/><p>Wiping off the blood stains on his lips, he walked out of the meditation room and went to the lake.</p><br/><p>Monk Qingban was on the lakeside. Seeing his pale face and the blood on his body, Qingban was surprised and asked, “Elder brother, are you chanting or killing in the meditation room?”</p><br/><p>Ning Que looked at the blue sky and asked, “Have you heard the bell?”</p><br/><p>Monk Qingban was stunned and said, “What bell?”</p><br/><p>Ning Que was also stunned and murmured, “Why am I the only one who can hear it?”</p><br/><p>…</p><br/><p>…</p></div>\n</div>"}