{"title": "Chapter 969 - Devils and Ghosts at the River Bottom", "id": 969, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-969-devils-and-ghosts-at-the-river-bottom", "volume_title": "Volume 10", "body": "<h1>Chapter 969 - Devils and Ghosts at the River Bottom</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Tens of thousands of hopeless skeletons were in the dim and dark water, laughing softly. Anyone would feel horrific at this scene, but Ning Que’s expression was unchanged.</p><br/><p>The water around the sunken boat was getting clearer. Haotian Divine Flame was in his eyes, which lit up the surroundings. For some reason, the thousands of skeletons floating in the water looked blank once they saw the light.</p><br/><p>These skeletons hadn’t seen light in tens of thousands of years. The light was so strange but attractive to them. Then they felt infinite terror in their deep consciousness.</p><br/><p>The bony hands around the sunken boat suddenly fell off like weathered stones suddenly peeled off and were flushed away by the current. The bony fingers remaining instantly dissipated into smoke too.</p><br/><p>The skeletons finally woke up. They screamed and fled toward the dark water. Some covered their ears, not wanting to hear the others’ crying. Others clutched their heads, as if that would make themselves feel safer. However, neither Haotian or the Buddha’s world could run faster than the light.</p><br/><p>Ning Que stood on the sunken boat and looked around. Haotian’s Divine Flame lit up the dirty and dark river bottom. Countless skeletons were purified while still screaming, and turned into black smoke.</p><br/><p>Instead of dissipating, the black smoke lingered and flowed toward the sunken boat. All of a sudden, the water darkened. As if tangible, it surrounded him tightly.</p><br/><p>Ning Que’s cutlass smashed forward, but the black smoke wasn’t broken. What the blade hit felt strange. It was glossy and thick, like some kind of leather or internal organ.</p><br/><p>Along with the strange feeling, an extremely crazy and intense desire was returning from the cutlass to his body as well. It was so pure that it contained nothing but greed.</p><br/><p>Ning Que’s chest was tight. Thinking of the greedy expressions in the eye sockets of the tens of thousands of skeletons, he remained vigilant. Using his Psyche Power, he expulsed the greedy desire out of his body.</p><br/><p>An intention was a kind of desire. That desire was ignited by his abundant Psyche Power, like it was oil poured on fire. It was abruptly amplified countless times and invaded his consciousness like flaring fire.</p><br/><p>Ning Que’s heart turned numb and his face was pale. He didn’t know what happened. Even if he couldn’t drive this desire out, how could something like this happen?</p><br/><p>“The black smoke is the devil,” Sangsang told him in his heart.</p><br/><p>Ning Que was still puzzled at why these devils had neither form nor substance.</p><br/><p>“The devil in the Buddhism is inside one’s heart…the poisons of greed, anger and foolishness are part of it, but this is purer. It targets the heart, instead of the body. I’m in your heart now, and that’s why you are affected.”</p><br/><p>Sangsang continued, “The Devil and desires invaded your body, activating the poisons.”</p><br/><p>As the desires brought by the dark smoke gradually entered deep, Ning Que’s heartbeat became unsteady. The three poisons of greed, anger and foolishness brought by Sangsang finally broke out.</p><br/><p>Ning Que was anguished. He spat out a mouthful of blood at the dark smoke in front of him.</p><br/><p>It sizzled. The dark smoke seemed to burn from intangible flames. Fluttering like a dark cloud blown by the wind, it seemed to be in extreme pain. The feeling of pain loomed from the depths.</p><br/><p>Sangsang was helping him. His body was full of Haotian’s Divine Flame, so his blood was also filled with the power of holy and pure splendor. Once the blood entered into dark smoke, purification started naturally.</p><br/><p>Ning Que understood what he had to do. He held up the cutlass and sliced his palm. He had completed his Haoran Qi, so his body was as tough as stone, but he did this on purpose, so his ruthless blade still wounded his palm. Fresh blood spilled out and covered the black cutlass.</p><br/><p>He looked up, gripped the handle in his left hand, and stabbed fiercely towards the dense black smoke in front him. The same sticky feeling of tenacity passed on from the blade, but the feeling weakened as the blood on the blade seeped into the smoke. The blade sunk in more, reaching half a meter in depth.</p><br/><p>Ning Que collected his Haoran Qi and he pounded the cutlass’ handle with his right hand like an iron hammer. The two powerful forces overlapped, fluctuating like waves on the river. The iron knife buried completely into the black smoke.</p><br/><p>Countless Haotian Divine Flames spilled out of the iron knife. The black smoke struggled like a wriggling spleen. It looked disgusting and horrific.</p><br/><p>A scorched smell came out from the black smoke. Lights arose from the cutlass and spread all around at a megascopic speed, lighting up the river bottom and revealing the true appearance of the Devil inside.</p><br/><p>The Devil inside was virtual object, intangible like the black smoke. But there were countless wraiths and desires hidden in the black smoke drooping to the bottom of the river like a curtain. Ning Que even saw his own face in it.</p><br/><p>He knew that if the confrontation against the Devil continued, a fight at the consciousness level would be inevitable. He wouldn’t fear it if it was in the past. But at the moment, Sangsang was in his heart, and he was affected by the three poisons of greed, anger and foolishness as well. In this sense, he absolutely couldn’t let the Devil get inside his body. It was too dangerous.</p><br/><p>Haotian Divine Flames continued to burn. The fire seemed to be endless. The cutlass stabbed into the smoke fell loose. Ning Que stood at the front of the boat, injected Haoran Qi into his arms and pulled powerfully!</p><br/><p>There was a loud whoosh. It was not the sound of water and it didn’t come from the bottom or surface of the river. Even the biggest wave couldn’t make a crash like that. It was the sound of the black smoke shattering. Thousands of wraiths, goblins and a dozen sticky beams of desire surged from the rupture.</p><br/><p>Ning Que pretended he didn’t see the disgusting and weird scene in front of him. Instead, he continued to move his wrist with his head lowered. The iron knife passed through the black smoke, instantly cutting it into countless shreds.</p><br/><p>The black screen was fragmented and the Devil’s body was destroyed. As if a fish tank was broken, the sticky stuff transformed from countless wraiths and goblins flowed out, surging towards the sunken boat.</p><br/><p>The sticky stuff transformed from the desires couldn’t travel long after separating from the devil’s body, so they gradually sunk into the river bottom. However, the wraiths and goblins had no weights, so they floated toward the boat with the current.</p><br/><p>Countless wraiths avoided the iron knife and climbed up to Ning Que’s clothes. They began to desperately descend into his body, emitting joyful calls non-stop. Their sounds were tiny, like mosquitoes and flies.</p><br/><p>A lot of wraiths and goblins climbed towards Sangsang’s divine body after they fell on the sunken boat. They sensed that this body was more delicious and powerful, so they made much joyful calls. However, when they had physical contact with Sangsang’s divine body, their cheering turned into dreadful screaming and they were purified into nothing.</p><br/><p>Ning Que’s eyes were like stars. He saw everything clearly, while clearer feelings came from his skin. He could feel the extreme chilling, pernicious rage and reluctance brought by the countless wraiths and goblins. It was much like the array intent of the Secluded Pavilion he felt by the cliff on Peach Mountain.</p><br/><p>With the help of Sangsang, his body contained endless Haotian Divine Flame But unlike Sangsang’s divine body, he couldn’t purify the wraiths and goblins with his innate power.</p><br/><p>Reasonably speaking, he should force out the Haotian Divine Flame to directly burn the wraiths and goblins. But thinking of how Sangsang was deeply poisoned, he needed to save her power for the fight against the Buddha, which was more important. That was why he didn’t do anything and just let the countless wraiths and goblins climb up on his body.</p><br/><p>Within a short period of time, the sunken boat was overtaken by countless wraiths and goblins. It was quite empty in the middle of the boat where Sangsang’s body was lying, while it was more crowded and scarier in the front of the boat. Thousands of wraiths and goblins had accumulated into a huge black ball,like the school of fish in the sea. Ning Que was right there in the middle.</p><br/><p>He saw through these ghosts before him. A goblin was trying to drill into his shoe. He lifted up his knee and dropped it, stamping the goblin into several threads.</p><br/><p>As he moved, the wraiths and goblins lying on the surface of his body fluttered like seaweed, but none fell down. These ghosts greedily tore at his clothes, gnawed his skin, sent countless hatred and resentment into his mind, and tried to dig in to eat his blood, flesh and soul.</p><br/><p>It was very dangerous for cultivators, but Ning Que was quite calm. He’d experienced this feeling and pain before. He knew it was important to have a steady mind to keep safe.</p><br/><p>He’d gone through life-or-death moments, suffering and tortures in human world since he was a little child. Later, he was recruited by the Academy to learn incomparable cultivating methods and meditated in the Xuankong Temple. Finally, he went into the world of the Chessboard and studied Buddhism for countless years. There were few in the world who surpassed him in terms of keeping one’s mind steady.</p><br/><p>Ning Que didn’t move, while the wraiths and goblins continued to jump into the sunken boat. The clump of souls grew and was about to touch the water. Inside the clump, Ning Que closed his eyes, waiting for the moment to come.</p><br/><p>Moments later, most of the wraiths and goblins in the river came onto the sunken boat and surrounded him. They buzzed and called in a low tone with complacence. Once in a while, several goblins flew out, looking anxious.</p><br/><p>Goblins, don’t be too naughty, Ning Que thought.</p><br/><p>As his thoughts turned, a streak of extremely fresh red appeared on the dark river bottom. With a cruel and fierce shout, the dark red Vermillion Bird flew out of the iron knife and fluttered fast around his body.</p><br/><p>The water in the river evaporated into bubbles wherever the the Vermillion Bird swept past. It spilled out hot fire, which wrapped up those wraiths and goblins around Ning Que. They didn’t have time to escape and turned to smoke amidst plaintive whines.</p><br/><p>The river cleared instantly. Only the clean water remained around Ning Que. Since the wraiths and goblins had vanished, so did the thoughts of coldness and hatred.</p><br/><p>A dozen of wraiths and goblins hadn’t squeezed onto the boat. They’d been unhappy, but the fast-changed situation shook them. They fled into the dark depths of the water, crying out in fear.</p><br/><p>The Vermillion Bird obviously wouldn’t let these dirty beings run off. It called sharply and then flapped its wings, flying towards these wraiths and goblins. Its fiery wings swept out the wraiths and goblins, turning them into dark smoke.</p><br/><p>However, just as the Vermillion Bird was satisfied with the result and about to go back to the sunken boat, a white shadow appeared suddenly. It streaked out of the dark river water like lightning, tangling around the Vermillion Bird.</p><br/><p>The Vermillion Bird cawed in anger. It flapped its wings, struggling, but it couldn’t budge!</p><br/><p>Ning Que’s expression hardened, while looking at this scene.</p><br/><p>He knew clearly that the Vermillion Bird was a lethal talisman of the God-stunning Array and could be compared to a cultivator at the State of Knowing Destiny Zenith. That white shadow could suppress it so easily. Its strength must be above the five states.</p><br/><p>What was the white shadow? It felt familiar to Ning Que. At closer inspection, he realized it indeed was a white bone whip, but countless times thicker than those he saw earlier.</p><br/><p>Right then, the white bone whip gradually came out of the dark water.</p><br/><p>The Vermillion Bird, tied up by the white bone, couldn’t get away and looked quite miserable.</p><br/><p>While looking at the white bone whip gradually coming out the dark water, Ning Que’s expression grew harder. When he saw the giant figure behind the white bone whip, he fell speechless in shock.</p></div>\n</div>"}