{"title": "Chapter 978 - Cultivating Buddhism (Part III)", "id": 978, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-978-cultivating-buddhism-part-iii", "volume_title": "Volume 10", "body": "<h1>Chapter 978 - Cultivating Buddhism (Part III)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Are you not curious to why I can repair the statue of the Buddha so fast?”</p><br/><p>“You said that practice makes perfect.”</p><br/><p>“Can’t you tell that I am just being modest?”</p><br/><p>“I have not heard you talk much for many years.”</p><br/><p>Ning Que went silent for a while and said, “I have not heard you talk for many years either.”</p><br/><p>Sangsang also went silent for a while and asked, “Then why?”</p><br/><p>“Because I am right. You were getting better and the poisons inside you were gradually fading away while I was repairing the statue of the Buddha in the past sixteen years. Although you didn’t wake up, I became more and more powerful, thus I did the carving work faster and faster.” Ning Que said happily, “Of course, the most important reason is that my current carving technique are really good. I can carve something nice on a piece of rotten wood and you can sell it for at least a few hundred liang of silver in the market of the human world. I am not only a Grand Master of Fu Tao now, but also a Grand Master of Sculpture.”</p><br/><p>Sangsang snorted and looked calm.</p><br/><p>Ning Que a little surprised and said, “I’m talking about a lot of money. why are you so calm?”</p><br/><p>Sangsang snorted again and said after a while, “I am a little tired and want to sleep again.”</p><br/><p>Every time she woke up, she would fall asleep again after she said a few words to him. Ning Que was no longer as lost as before. Although the poisons inside her are gradually falling away, she is still weak and needs more rest.</p><br/><p>Sleep was the best way to restore the spirit. Sangsang had been sleeping for sixteen years, but he had not slept at all for the whole time, so he was unbelievably exhausted.</p><br/><p>He took out the dried frog meat, teared off some and stuffed it into his mouth.</p><br/><p>The frog meat was tender, so it would taste good if being cooked properly, such as being cooked with spice, stewed with green peppers or grilled. But one would get sick of eating the same food year after year even though it was very delicious. And even the most gluttonous man would feel sick after eating frogs for sixteen years.</p><br/><p>Ning Que didn’t feel sick, and he didn’t even reveal any expression on his face. He just kept chewing automatically and then swallowed it, looking very numb.</p><br/><p>His miserable childhood made him aware that the most formidable enemy for human beings was definitely not disgusting food, but no food at all, for hunger was more terrible than death.</p><br/><p>He had rarely put much thought on food ever since the end of the last decade. The time was too long, and he was too lonely. Thus, he spent all his time and energy on repairing the statue of Buddha, wishing to leave this place early. He caught many frogs in the golden ponds and air-dried them into frog jerky which later became his main source of food. He would eat some when he felt hungry.</p><br/><p>The dried frog meat was tasteless and hard to swallow. He sat by the cliff and looked at the Buddhas and Bodhisattvas in the field, using their pain as spice.</p><br/><p>The Buddhas and Bodhisattvas in the field became angrier and angrier, and their outrage rose to the maximum level as he changed the statue and carved a handmaiden costume for the Buddha. The chanting sound echoing across the field became more and more majestic and the Light of the Buddha falling on him also became more and more horrible.</p><br/><p>But the most horrible thing was the indigo lion, which was hundreds of zhang tall.</p><br/><p>Its front hooves were full of blood and mud. The beast lowered its head and slowly licked its wounds. It was no longer howling like before, but the silence implied extreme danger.</p><br/><p>The indigo lion finally stepped into the golden pond several days ago. Although it was unable to rush to the foot of the mountain and only tramped down several ponds due to the ban set by Buddha, it was indeed a step forward for the beast.</p><br/><p>The indigo lion did not become stronger, but the ban set by Buddha was not as strict as before since the statue of the Buddha gradually changed under Ning Que’s iron cutlass and the power left by Buddha became weaker every day.</p><br/><p>The indigo lion stopped licking its wounds and looked up. Its head broke through the clouds, which was shocking. Looking at Ning Que on the statue of Buddha, the beast looked solemn and determined.</p><br/><p>Ning Que was very tired and and sleepy. He felt sad that Sangsang fell asleep again and the frog meat tasted really bad, which put him in a bad mood.</p><br/><p>He wanted to take a break and turned to something else to enliven his lonely life of repairing the statue of Buddha. At this moment, he instantly got angry while seeing the indigo lion acted provocatively in the field.</p><br/><p>He untied his iron bow, pulled the bowstring hardly, and then released his fingers abruptly. A circular turbulence appeared around the string, and the dark iron arrow disappeared.</p><br/><p>Within the next moment, a blood flower appeared on the chest of the handsome monk sitting on the back of the indigo lion with his legs crossed. He fell to the ground with a heavy noise.</p><br/><p>The handsome monk died, but the Buddha did not. During the previous sixteen years, the handsome monk was the Buddha. But he was no longer Buddha when the iron arrow approached him.</p><br/><p>He and Sangsang were right. The position of the Buddha kept changing in the human world. Even the light couldn’t catch him, let alone the Thirteen Primordial Arrows.</p><br/><p>The handsome monk just died. The indigo lion was very shocked and then became extremely angry, roaring at Ning Que who was on the cliff. The cloud layers in front of his head were instantly shattered into countless tiny clouds, and numerous golden lotuses in the golden ponds all astonishingly dropped down.</p><br/><p>Ning Que shouted back at the indigo lion. The roaring sound spread over the field, like a thunder, which revealed a very overbearing and wild atmosphere.</p><br/><p>Since Ning Que had repaired the statue for so long and the ban set by Buddha had been weakened, the Buddhas and Bodhisattvas in the field could break through the golden ponds at any time, and the indigo lion was confident and cold at this point.</p><br/><p>But meanwhile, the three poisons inside Sangsang was gradually disappearing, and Haotian slowly gained her power back during sleep. Thus Ning Que became more powerful too.</p><br/><p>Everything must be traced back to time or cause and effect. Cause and effect was the order of things, so was time, which could determine the shape of the universe and also the outcome of the war.</p><br/><p>Ning Que was full of confidence, for he knew that he and Sangsang would take the final victory.</p><br/><p>Ning Que felt good that his arrow killed a Grand Bodhisattva and that he shouted to the indigo lion like a real beast, which made his boring carving interesting and instantly dispersed the loneliness and rejection that had accumulated in his heart. He climbed back on the cliff and continued to repair the statue.</p><br/><p>Two years later, Ning Que finally finished the hands of the Buddha which didn’t hold the white vase like normal statue but an umbrella. The umbrella was carved on the black cliff, so naturally it was a black umbrella.</p><br/><p>In the beginning, it took him three years to repair one foot of the Buddha and then another ten years to repair the other foot and the hemline of the statue’s clothes. As for the handmaiden costume, it took him another three years to finish. Compared to the past, he was much faster at this point.</p><br/><p>But then Ning Que slowed down, for he had reached the summit of the mountain to repair the face of Buddha, which was undoubtedly the most crucial stage of his work.</p><br/><p>The iron cutlass slowly fell on the chubby face and the rounded earlobes of Buddha, as if it was the weight of the whole mountain. Ning Que looked solemn for he was cautious.</p><br/><p>Another ten years passed.</p><br/><p>The ears of the Buddha no longer hung down to his shoulders because they were hidden behind the hair that Ning Que newly carved. The face of the Buddha was no longer chubby and became thinner and smaller, looking like a normal person.</p><br/><p>The iron cutlass eventually fell on the lips of Buddha.</p><br/><p>The statue of the Buddha opened his mouth silently, but countless words suddenly rang out. It was the voice of Buddha. The Light of the Buddha appeared in the field, and Buddhas and Bodhisattvas began to chant. A powerful Will of the Buddha went straight into the chest of Ning Que.</p><br/><p>Blood gushed from Ning Que’s mouth. His eyes suddenly dimmed and he felt that Sangsang frowned and was about to wake up.</p><br/><p>He knew that he did it wrong. Without any hesitation, he slashed the iron cutlass and cut off the mouth of the Buddha directly, only leaving very thin lips. Then the voice of the Buddha and the Will of the Buddha disappeared.</p><br/><p>He finished repairing the statue of the Buddha.</p><br/><p>At this point, the statue of the Buddha was black, thin, small, and wearing a handmaiden costume.</p><br/><p>Sangsang woke up and said while looking at the statue, “You still prefer her.”</p><br/><p>She was not talking about Mo Shanshan although she did have very thin lips too. Sangsang meant Ning Que liked the old Sangsang.</p><br/><p>Ning Que replied with a smile, “You looked like this for twenty years in the human world. Of course I cherish your old look. But I will like your new look more after we spend more time in the human world.”</p><br/><p>He looked at the face of Sangsang carved in the black cliff stone and laughed happily.</p><br/><p>Sangsang said, “She has no mouth.”</p><br/><p>Ning Que said, “You don’t like talking anyway.”</p><br/><p>Sangsang asked, “But how could I reveal the world without my mouth and how could I earn the worship of all living creatures and become the Buddha?”</p><br/><p>Ning Que answered, “I will do all these things for you. You know that I can be very talkative if needed.”</p><br/><p>He had finished repairing the statue of the Buddha, but he was not the Buddha himself.</p><br/><p>The ban set by Buddha was weakened over the past years. The Buddhas and Bodhisattvas in the field had entered the outer periphery of the golden ponds and the indigo lion was already not far from the foot of the mountain.</p><br/><p>The indigo lion’s body was full of wounds, and its four hooves stirred up the mud at the bottom of the ponds. It slowly and firmly moved toward the Buddha mountain, and its every step was as heavy as a thousand pounds.</p><br/><p>During the past ten years, Ning Que was busy repairing the statue, and there were also many things that happened in the world. The footprints left by countless Buddhas and Bodhisattvas walking from the field turned into a river channel leading to the far west. The clear river water came from the west and contained countless rancorous souls and skulls, giving off ghastly atmosphere.</p><br/><p>The river from the west was the Styx River, and it was summoned by countless Buddhas and Bodhisattvas with great willpower and Supreme Dharma, constantly diluting the Light of the Buddha in the golden ponds.</p><br/><p>Ning Que slashed his iron cutlass, and the Vermilion Bird became angry and howled. Haotian’s Divine Flame spouted out from the blade, walked around the mountain, and then chopped a bottomless crack.</p><br/><p>Snow accumulated under the cliff for decades after the avalanche. At this point, the accumulated snow instantly melted and flew into the crack, forming a new river which was truly clear and quiet.</p><br/><p>While trying to merge at the foot of the mountain, the waters from the Styx River and from the new river met didn’t integrate. They looked at each other indifferently and maintained their own pace. It seemed that neither of the two could move forward.</p><br/><p>Ning Que sat on the top of the statue of the Buddha with his legs crossed and began to meditate with his eyes closed. After repairing the statue of the Buddha in the mountain, he began to cultivate Buddhism in his heart. He wanted to become the Buddha, the only true Buddha in heaven and on earth.</p></div>\n</div>"}