{"title": "Chapter 970 - The Bodhisattva", "id": 970, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-970-the-bodhisattva", "volume_title": "Volume 10", "body": "<h1>Chapter 970 - The Bodhisattva</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>A white bone projected from the dark water. It looked quite queer and horrible. Behind the white bone, a huge dark shadow sent forth infinite power and might.</p><br/><p>The water was separated as the white bone moved ahead, and then two bones appeared below it. These two bones had no joints. They were very smooth and sharp, looking like two spears.</p><br/><p>The thick and long white bone that had appeared first wasn’t a whip at all, but an extremely long nose. Flesh, blood and thick skin on it were melted and only a ghastful bone left.</p><br/><p>Only an elephant’s nose could be that long, and the two sharp white bones were the tusks. Ning Que looked at the huge figure in the dark river and slowly grasped the cutlass’ handle.</p><br/><p>A huge elephant was at the bottom of the river. It was hundreds of meters tall, as huge as a mountain. In comparison, the sunken boat was quite tiny. The elephant’s flesh had eroded, leaving only scary and white bone behind.</p><br/><p>The skeletal elephant slowly moved toward the sunken boat. The front end of the trunk was made up of countless small and thin white bones. It curled around the Vermillion Bird, which had stopped struggling. It was close to dying.</p><br/><p>As the huge skeletal elephant walked, a Buddhist breath full of stateliness and eeriness pressed against the front of the boat. Ning Que stiffened, thinking that an elephant’s trunk shouldn’t have bones.</p><br/><p>This was a hellish river bottom in the Buddha’s world of Nirvana. The elephant’s trunk had bones, while wraiths lingered everywhere. There was no logic to be spoken of.</p><br/><p>If it was unfair, so they could only fight. However, after seeing the monk sitting on the back of the skeletal elephant and sensing the powerful Buddhist strength of his opponent, he didn’t dare to act brashly.</p><br/><p>The monk wore a Buddhist crown with ten precious diamond on it and a kasaya with ten-thousand miles of golden thread. He held up a nine-looped golden scepter. It rang as river water passed through it.</p><br/><p>The monk sat on the back of the skeletal elephant. He seemed insignificant but also huge. His expression was merciful and resolute. River water passed in front of his eyes, but he still looked calm, presenting an unfathomable atmosphere.</p><br/><p>In this world, Ning Que had met many Buddhas, such as the Face-hidden Buddha transformed by the Monk of Green Plates and the Dipamakara on the street. Some were powerful, while some were weak. But no matter how strong a Buddha was, one couldn’t stand on for a long while before he and Sangsang started working together.</p><br/><p>Now, he saw the skeletal elephant and the monk, and he knew that he and Sangsang were facing a truly powerful enemy. He even felt terrified.</p><br/><p>The skeletal elephant walked slowly to the sunken boat. The water was much clearer.</p><br/><p>Looking at the monk, Ning Que shouted, “Which Buddha are you?”</p><br/><p>The monk said, “I’m not a Buddha, but a Bodhisattva.”</p><br/><p>Surprised, Ning Que said, “I’ve met countless Buddhas in Nirvana, but no one was stronger than you. Why don’t you become a Buddha?”</p><br/><p>“I will not transform until Hell is empty,” the monk answered calmly.</p><br/><p>The eight simple words made Ning Que silent for a long while. Troubled, he asked, “Ksitigarbha?”</p><br/><p>The monk looked resolute with mercy in his eyes. The diamonds in his Buddhist crown shone, and the gold threads on the kasaya released radiated, illuminating the river bottom. Even the whole ten-thousand-mile river was getting clearer and brighter.</p><br/><p>Those skeletons hidden between the dark river water and the mud, as well as those wandering ghosts, were all revealed. They didn’t fear the Light of the Buddha. On the contrary, they were soothed. They kneeled down and bowed to the monk. Countless skeletons and wandering ghosts all worshipped him. Scrapes could be heard from the bottom of the river. It was the sound of bone rubbing against bone. The bone shrapnel that Ning Que had smashed apart floated up.</p><br/><p>The huge river, as dark as Hell, was purified by infinite mercy, which was the state of the Ksitigarbha. Although he was at the position of Bodhisattva, the Buddha’s Light he emitted was even stronger than all those other Buddhas combined.</p><br/><p>A Buddhist believer would be touched and cry out at the scene. He would probably bow continuously towards the monk on the back of the skeletal elephant. At that moment, even Ning Que was a bit shaken. He’d just composed himself faster than the others.</p><br/><p>Only pious Buddhist believer’s consciousness would come to the Chessboard and entered Nirvana after the death. Where did the wraiths, goblins and skeletons under the river come from?</p><br/><p>The Ksitigarbha seemed to know what he was thinking and said slowly, “As long as they believed in the Buddha, all would come to this Pure Land after death, even the sinners.”</p><br/><p>“Heaven is Hell as well.” Ning Que understood quickly. Looking at Ksitigarbha, he asked, “All those sinners were guided to the Chessboard after death and then suppressed to suffer under the river. How can they be emptied out?”</p><br/><p>Ksitigarbha gazed at the ghosts under the river and said with mercy, “As long as they piously converted to Buddhism and cultivated via beneficence to achieve the good results, all will be forgiven in the end.”</p><br/><p>After he said that, the countless ghosts bowed and cried out. Confessions filled the river.</p><br/><p>Looking at Ksitigarbha, Ning Que said “You spout nonsense, just like the Buddhas.”</p><br/><p>After he said that, the countless ghosts rose up. Anger filled the river.</p><br/><p>Ksitigarbha didn’t get angry. He put his palms together in prayer and said, “Please enlighten me.”</p><br/><p>Ning Que pointed at those wandering skeletons in the water and said, “Good will and thoughts are easily spoken of, but there are Buddhas everywhere in this world. Where do they do the good things? And if they were sinful before their death, they should be restricted in Hell forever, instead of being freed solely by sutra chanting. How would their victims feel?”</p><br/><p>Ksitigarbha said, “You were wrong…”</p><br/><p>Reasoning and debating on the Buddhism was the last thing Ning Que wanted to do at the moment, so he held up the cutlass and stopped the Bodhisattva’s words. He looked at the opponent with his extremely bright eyes. Golden flames seemed to spill from them.</p><br/><p>“I may be wrong, but I will never identify someone incorrectly,” Ning Que said. You’re absolutely not the Ksitigarbha. You can’t deceive my sharp eyes! Show yourself, or take on my hit!”</p><br/><p>He felt proud about how witty he was, but only Sangsang in his heart could understand him. How could the Ksitigarbha get it, who looked confused while countless ghosts started to roar with rages?</p><br/><p>How irreverent to accuse the Bodhisattva that he was a false one!</p><br/><p>The Ksitigarbha didn’t get angry. He said with smile, “You may think whatever you believe. It doesn’t matter whether I’m a Bodhisattva or not. What I do is what really matters.”</p><br/><p>The tens of thousands of ghosts at the river bottom understood the essence. Ecstatic, they bowed again.</p><br/><p>Ning Que was unmoved. “How can one stay put and watch others suffer like the earth, while calmly contemplating and hiding well?” he shouted. “I don’t know which Chief Monk you were in the Xuankong Temple in your lifetime, allowing you to cultivate the Vajra Body Defending Divine Skill. After your death, you came here to guard the ghosts’ river. The Buddha gave you a nice position, but I would be shameless to say that you are benevolent!”</p><br/><p>The Ksitigarbha grew serious. Looking at Ning Que quietly, he said after a long while, “You were born with insight and now have the God’s Eyes. You’re right. I was the second Chief Monk of Xuankong Temple.”</p><br/><p>The first Chief Monk of Xuankong Temple was the Budhda. He was the second Chief Monk. In this sense, he was the eldest disciple of the Buddha. From the perspectives of the human world or the succession of cultivating world, he was the first Buddha of Xuankong Temple.</p><br/><p>Hearing his confirmation, Ning Que realized this was why he was so powerful. “Indeed a false Bodhisattva,” he mocked.</p><br/><p>Ksitigarbha said, “The Buddha was a prince of an earthly kingdom and became the Buddha after reaching nirvana. I was the Chief Monk of Xuankong Temple and became the Bodhisattva after my Parinirvana. What’s wrong with that?”</p><br/><p>Ning Que couldn’t reply. It really did make sense. Both Bodhisattvas and Buddhas were all positions of Buddhism assigned by the Buddha. Since the Buddha let the monk be Ksitigarbha, Ksitigarbha he was. What effect would it have even if he could see through his previous life?</p><br/><p>Ning Que had reacted so strongly because he’d felt deceived. Although he wasn’t a Buddhist, he still had great respect towards the Ksitigarbha. He didn’t think that…</p><br/><p>“You were the Chief Monk in Xuankong Temple, so you’re clear about the miserable world below the mountain. You won’t become a Buddha until Hell is empty? That world is the true Hell. You can’t even empty the hell in the human world. What’s more, that hell was created by the Buddha and yourself. How shameless are you to say those words?”</p><br/><p>Ning Que looked at Ksitigarbha on the elephant and said, “One of my elder brothers is leading millions of starving ghosts to break out the hell you left. What if he met all the starving ghosts repressed by you for countless generations who returned to the human world? You said you won’t become a Buddha until Hell is empty? If that logic is true, then my brother should be the one to become a Buddha. What does it have to do with you?”</p><br/><p>Moments later, the skeletal elephant sent the Vermillion Bird tied by the front end of its trunk back to its back. Ksitigarbha took over the Vermillion Bird and looked at Ning Que standing on the front of the boat. “Your bird was captured by me. It’s something to do with me.”</p><br/><p>Bodhisattvas spoke with Buddhist words and overtook the debate with their eloquence, just like those in human world. They preferred to resort to challenging questions or arguing to solve differences. Unfortunately his debate opponent was Ning Que at the moment.</p><br/><p>Ning Que didn’t follow his words at all. Instead, he was extremely angry. After the night in the Divine Hall of Light, speaking about birds was taboo to him. Even worse, his enemy was talking about capturing his bird!</p><br/><p>He was furious. With one thought, the Vermillion Bird held by Ksitigarbha suddenly became a fireball and scattered all around on the water, vanishing. The next moment, the Vermillion Bird returned to the cutlass and closed its eyes to recuperate after painfully chirping twice.</p><br/><p>The Vermillion Bird was a lethal talisman of the God-stunning Array and totally controlled by Ning Que. Even the Ksitigarbha couldn’t do it. He’d thought to let the skeleton bone hold up the Vermillion Bird deliberately and wait for the right chance to take advantage in the middle of the fight.</p><br/><p>Now, he took the Vermillion Bird back because Ksitigarbha was too strong. It was meaningless for the Vermillion Bird to try a sneak attack. Another important reason was that he couldn’t stand having the bird captured by his enemy, even for one second.</p><br/><p>“Then, Bodhisattva, take this!”</p><br/><p>He was totally into the act. Ning Que swept fast from the front of the boat and came to the skeletal elephant. He gripped the cutlass with both hands as if wielding an iron bat. Then he smashed towards the head and face of Ksitigarbha.</p><br/><p>The skeletal elephant roared with anger. The river tossed angrily.</p><br/><p>Ksitigarbha calmly looked at Ning Que in the air. His left hand, placed on his knee, had formed a Wishful Gesture at some point. The nine-looped golden scepter in his right hand faded and became a monk’s staff.</p><br/><p>Ksitigarbha once made a grand wish that he would enlighten all living creatures in the six great divisions in the wheel of karma. Thus, he appeared in the six great divisions with different dharma-laksanas holding different dharma-vessels. This was called the Six Ksitigarbha.</p><br/><p>At the moment, the one sitting on the skeletal elephant was the Ksitigarbha of Wishful Mudra.</p><br/><p>This one aimed to enlighten all animals.</p><br/><p>Ning Que had been cultivating Buddhism for countless years and knew all the principles. Once he saw the Ksitigarbha of Wishful Mudra, his anger couldn’t be suppressed. He struck violently and fiercely after injecting Haoran Qi and Haotian Divine Flames into his cutlass!</p><br/><p>…</p></div>\n</div>"}