{"title": "Chapter 976 - Cultivating Buddhism (Part II)", "id": 976, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-976-cultivating-buddhism-part-ii", "volume_title": "Volume 10", "body": "<h1>Chapter 976 - Cultivating Buddhism (Part II)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The Buddhist scriptures stated that molding Buddha statues or painting Buddha was disrespectful. But in fact, there were numerous ancient temples in the human world with Buddha statues on the walls. The stone Buddha statues on the top of the Wa Mountain behind Lanke Temple soared into the sky, and the Prajna Peak which was transformed by Buddha after his death was also a Buddha statue. And the chessboard world had numerous status of Buddha too. But Taoism actually controlled the human world never molded any status for Haotian, which revealed some problems vaguely.</p><br/><p>Buddhism molded countless Buddha status. Ning Que wanted to break the connection between Buddha and all living creatures through the status. This was his cultivation on Buddhism.</p><br/><p>One could think certain things through and talk about them proudly but find them hard to be performed. If the majestic snow mountain was indeed Buddha’s original coordinates in this world or the collections of his Buddha nature, then the wild cliff yard where he stood on was only one of Buddha’s toes. What’s worse was that the black rocks were extremely hard, and he struggled to break them down even with his Haoran Qi.</p><br/><p>The dark iron cutlass kept falling on the black cliff rocks, making thunderous noises. The shattering stones kept flying around, but the cliff rocks remained almost the same, only losing a thin layer of stone skin. If the current speed were to be applied, then it would take quite a long time for Ning Que to cut the toenail of Buddha round.</p><br/><p>“Other people would embrace Buddha’s feet and pray for help in time of emergency if needed, but you want to give Buddha a pedicure.”Sangsang felt that his approach was incomprehensible. She thought that it wouldn’t change the current situation even if Ning Que had renovated the whole mountain.</p><br/><p>Ning Que kept cutting the cliff rocks with his iron cutlass and said, “I can’t explain it to you. You will understand when I finish it. To cultivate Buddhism is to repair Buddhism.”</p><br/><p>To cultivate Buddhism was to repair Buddhism. Sangsang taunted, “Even so, what do you know about repairing? The Academy only knows how to destroy. When do you know how to build?”</p><br/><p>The Buddha statue on the top of the Wa Mountain was cut down directly by Jun Mo with his iron sword, and he was also currently cutting the Prajna Peak. From this point of view, the Academy was indeed better at destroying Buddha statues and had no experience in repairing them.</p><br/><p>Ning Que inserted the iron cutlass into a crack of the cliff rock and wrenched it hard, removing a watermelon-sized stone. He wiped sweat off his forehead and answered, “You have a prejudice against the Academy. Who said we can’t build? We built Chang’an. How hard could it be to repair the Buddha statues?”</p><br/><p>Sangsang said, “Quit bragging! You can’t even weave the willow branches.”</p><br/><p>Ning Que replied, “I’ve told you before, I have already thought the whole matter through. Do you still remember that I made a boat with the redwood? It is my practice.”</p><br/><p>“It sounds unreliable to compare the wood boat with Buddha statues.”</p><br/><p>“How could you say this? The Buddha statues I have repaired may be ugly, but appearances should not matter.”</p><br/><p>Sangsang was a little tired and was silent for she had nothing to say or she just didn’t want to talk with him.</p><br/><p>But talking could be unilateral sometimes. Ning Que didn’t care for Sangsang’s silence at all, and he just kept nagging while slashing the cliff rocks with his iron cutlass. The black rocks flew around, and the roaring lingered for a long time.</p><br/><p>Although countless Buddhas and Bodhisattvas in the field outside the golden ponds couldn’t hear what Ning Que was saying, they could see clearly what he was doing and became more and more serious.</p><br/><p>The indigo lion at the forefront was particularly angry and unsettled, violently swinging its head and screaming to the dark sky. The mane on its neck, which was as thick as a forest, shined with the Light of Buddha, and was erected as the beast swung its head. Its mane looked like it was made of numerous swords.</p><br/><p>Ning Que was taking a rest at this point. Seeing the change of the indigo lion, he was stunned slightly at first, then laughed and pointed to it, “Look! The big cat is angry!”</p><br/><p>Sangsang ignored him.</p><br/><p>Hearing the laugh, the indigo lion was even angrier and its actions became wilder and wilder. The violent airflow it stirred up even teared the clouds on the high sky into pieces!</p><br/><p>In the horrible turbulence and whistling, the mane on the lion’s neck, which shined with the Light of Buddha, was discharged, broke through the clouds and rushed to the mountain, like hundreds of black shadows!</p><br/><p>The indigo lion couldn’t break the ban set by the Buddha to enter thousands of golden ponds outside the mountain. But its mane was lifeless, so it could launch a long-range attack.</p><br/><p>The mane instantly came to the cliff and fell down as rain. The heavy crash rang out and countless gravels splashed everywhere. Every fur was like an invincible spear!</p><br/><p>There were three strands of fur that pierced into Sangsang. Ning Que suddenly turned pale and rolled over to her. He opened the big black umbrella and forced its handle into the cliff.</p><br/><p>Sangsang was not seriously injured, and there was only a thin cut on her cheek. Her body was divine, so obviously the fur of the indigo lion contained horrible power!</p><br/><p>“Look, they are really scared. My method works,” whispered Ning Que, holding the umbrella handle tightly.</p><br/><p>The long-range attack of the indigo lion continued, and there were dull crashing sounds everywhere on the cliff. Two large strands of fur fell on the big black umbrella, making Ning Que’s palm sore.</p><br/><p>Then, countless Buddhas and Bodhisattvas in the field also took out their ritual implements and threw to the mountain peak at a great distance, but these Buddhas and Bodhisattvas were clearly not as powerful as the indigo lion. Only a few ritual implements which belonged to several Grand Bodhisattvas fell on the edge of the cliff, bringing a burst of vibration. Additional ritual implements couldn’t reach the cliff and fell from the sky above the golden ponds.</p><br/><p>It seemed that an invisible cover was shielding the golden ponds, and these ritual implements shattered the moment they fell on it, becoming countless golden rays of light and flying everywhere. These ritual implements all contained the Light of Buddha, so the ponds became brighter and even the dark sky seemed to be illuminated.</p><br/><p>Ning Que squinted his eyes looked at the field silently. He sensed that Sangsang was in pain.</p><br/><p>After a long time, the horrible attack from the field finally stopped. Numerous Buddhas and Bodhisattvas went silent. But the indigo lion swayed its head and cried into the air.</p><br/><p>Ning Que closed the big black umbrella and looked at the field in the distance. He was angry and also helpless, for he couldn’t fight against the Power of Buddha of these Grand Bodhisattvas and the indigo lion.</p><br/><p>Then he opened the black umbrella toward the direction of the field, which was an insulting posture. Ning Que didn’t care whether those Buddhas and Bodhisattvas could understand it or not.</p><br/><p>Then he turned to the indigo lion and cursed, “Don’t stop! Keep shaking your damn head! It would be perfect if you become bald! The Academy is specialized in killing bald things!”</p><br/><p>The indigo lion returned with an angry roar, but couldn’t harm Ning Que.</p><br/><p>Ning Que was even angrier, because Sangsang was almost injured and the Light of Buddha from the fur and ritual implements made Sangsang weaker and in pain. He couldn’t stand to see Sangsang suffer.</p><br/><p>The Light of Buddha among the mountain and the ponds were extremely bright. He carried Sangsang on his back and tied the handle of the umbrella in front of him, making sure that her whole body was covered by the black umbrella. Then he walked to the original position with the iron cutlass in his hand.</p><br/><p>The mountain was really solid. Even the lion’s mane and the Bodhisattvas’ ritual implements only shattered a thin layer of the surface of the cliff, which did not help him.</p><br/><p>Carrying Sangsang on his back and holding the big black umbrella, Ning Que bent down and slashed the hard cliff rocks nonstop, just like a old farmer working. He was holding a large black umbrella, squatting, and waving his iron cutlass against the hard cliffs, just like an old farmer farming under the hot sun.</p><br/><p>Farming was the hardest activity of mankind. Drops of sweat kept appearing on his forehead, dropping on his hand and the ground, and then mixing into the crushed cliff stones.</p><br/><p>“I am really tired.” He wiped his sweat and gasped. “How could it be so tiring?”</p><br/><p>Sangsang said, “I have planted peppers in the courtyard of City of Wei. It was not that tiring.”</p><br/><p>Ning Que felt that his self-esteem was hurt and argued, “That’s because your body was too weak to sweat. If you were like me and kept sweating, you will feel tired too. The drops of sweat are very annoying and my hands are slipping.”</p><br/><p>Sangsang’s voice sounded a little weak, “You just can’t do it.”</p><br/><p>The one thing Ning Que hated the most was that people, especially women, thought he couldn’t do something. Of course he couldn’t stand Sangsang, his own wife, said that he couldn’t do it.</p><br/><p>“That’s because you are fat! Of course I will be tired carrying such a fat woman on my back! Why didn’t you carry me in your back when you took care of your plants? You have to bear the main responsibility!” He shouted angrily, “Why didn’t you pick a slim body when you became Haotian?”</p><br/><p>Sangsang asked, “You prefer slim girls?”</p><br/><p>Ning Que replied, “It has nothing to do with my preference. I am just talking about weight.”</p><br/><p>Sangsang said, “So you prefer slim girls.”</p><br/><p>Ning Que threw the iron cutlass on the ground and said, “It has nothing to do with my preference!”</p><br/><p>Sangsang said, “The body I chose is perfect. I became fat because your teacher poured into the body that I picked from the world of mortals in front of the gate of the Divine Kingdom. You should blame him.”</p><br/><p>Ning Que silently picked up the iron cutlass and continued to slash the mountain.</p><br/><p>Sangsang said, “Say something.”</p><br/><p>Ning Que went silent for quite a while and then said, “The student can’t speak bad of his teacher.”</p><br/><p>Sangsang asked, “How can repairing Buddha statues remove the poisons that are inside me?”</p><br/><p>Ning Que answered, “Man and wife are one flesh. If I were to become the Buddha, you become the Buddha too. By then removing the poisons inside of you would be a piece of cake. And what’s funnier is that these Buddhas and Bodhisattvas would become our valets.”</p><br/><p>Sangsang asked, “How did you think of this method?”</p><br/><p>Ning Que answered, “Don’t ask so many question. Just trust your husband. Who are we? I am the hero of our story, and you are the heroine. When danger strikes, the hero must stand in front of the heroine and help her out. Then, they can live happily ever after.”</p><br/><p>“Happy life? I am a little tired. I want to sleep first,” said Sangsang.</p><br/><p>Ning Que felt that her voice was very sweet, as if she was just drinking some sugar water. Then his dry throat became moist and sweet too and he was very happy.</p><br/><p>Sangsang began to sleep, and she slept for three years.</p><br/><p>When she woke up, the right foot of Buddha had been repaired and turned into a very delicate little foot, which looked a little familiar. If the foot was whiter, it would be looked more familiar.</p><br/><p>Ning Que finally gained something after three years of hard work.</p><br/><p>He turned the foot of Buddha into the foot of Sangsang.</p><br/><p>…</p></div>\n</div>"}