{"title": "Chapter 985 - My Love, How Could You Not Understand?", "id": 985, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-985-my-love-how-could-you-not-understand", "volume_title": "Volume 10", "body": "<h1>Chapter 985 - My Love, How Could You Not Understand?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>…</p><br/><p>…</p><br/><p>No one knew where that sound came from and why it resounded in the sky. But the next moment, they all realized it was Haotian.</p><br/><p>Only Haotian’s voice could be so awe-inspiring. And it was only Haotian’s voice that could form such vivid scenes in the consciousness of the pious followers and quaked the depths of their souls.</p><br/><p>Everyone on the plateaus and the front yard of Peach Mountain fell on their knees and placed their foreheads on the ground. They tried to lower themselves as much as possible to showcase their awe and esteem to Haotian.</p><br/><p>Xiong Chumo, the Hierarch, was standing behind layers of gauze and led the chanting. His figure seemed huge in the radiating light. But upon hearing that voice, he threw himself to the ground and lowered down like a dog.</p><br/><p>It was said that he had a thundering voice. However, when compared with this voice that resounded in the sky, his was nothing but blasphemy.</p><br/><p>In front of the stone cottage on the remotest plateau, the Abbey Dean got out of the wheelchair, used his skinny and trembling arms to support his body, but looked calm and proud.</p><br/><p>The middle-aged priest finally let go of the wheelchair and kneeled behind the Abbey Dean. Long Qing kneeled further behind and looked extremely pale and scared.</p><br/><p>He knew exactly that the Abbey Dean had done something extremely disrespectful to Haotian. Now that Haotian had left the Buddha’s chessboard and returned to the human world, how could he not be scared?</p><br/><p>Sangsang’s voice went beyond the clouds and reached Peach Mountain. It resounded between Heaven and Earth and was reflected by the sky and the ground so that it traveled so far away that it even reached every corner of the continent.</p><br/><p>Numerous people were awaken up by this stunning voice coming from above the sky.</p><br/><p>Some elderly leaned against the wall and stared at the gray sky. He looked confused and wondered, What’s wrong this year? Was that another spring thunder? But why did it sound like someone talking?</p><br/><p>Some kids at school rushed to the window, pointed to the sky and chatted excitedly. They were like a group of twittering birds and woke up the sleepy teacher. He picked up the ruler to punish them. They said in one voice that the sky just spoke, but only to receive several more punishments.</p><br/><p>In the small town at the border of Song and Yan Kingdom, people also heard the voice from the sky. They poured onto the only long street in town and looked confusedly above at the sky, wondering what had just happened.</p><br/><p>Inside the butchery, the Butcher covered his head with a thick and greasy cleaver and hid under the cutting board. The pieces of a pork leg were falling from the board, and he shivered each time a piece fell down.</p><br/><p>The Drunkard was even more scared.</p><br/><p>The Drunkard sat in the teahouse and could not stop drinking. He went beyond his limit and his eyesight became blurry. But instead of blushing he became terribly pale.</p><br/><p>The Butcher did not participate in the Abbey Dean’s trap for Haotian. But the Drunkard did. He saw that Haotian and Ning Que entered Xuankong Temple and even tried to prevent the Academy from opening the chessboard.</p><br/><p>Now Haotian had returned and sent a punitive expedition to the human world. He had committed a sin. How could he not be scared? He could do nothing but get drunk. Otherwise he would already be scared to death.</p><br/><p>Chao Xiaoshu stood by the door of the teahouse and looked into the dark sky. He felt confused and asked, “What happened?”</p><br/><p>The Drunkard managed to put down his flagon and spoke with a trembling voice, “It is not something you could comprehend. You’d better stay away from me. Otherwise you would die from Haotian’s Divine Power any minute now.”</p><br/><p>Chao Xiaoshu turned to him with a complex of expression.</p><br/><p>The Drunkard continued drinking and tried to put himself to a coma. He said obscurely, “We did this for her. But what if she does not appreciate it?”</p><br/><p>…</p><br/><p>…</p><br/><p>It seemed like Taoism did nothing when Sangsang was trapped in the Buddha’s chessboard. But having done nothing was exactly their sin. They knew that Haotian was in great danger but did not try to rescue her. That was their fatal sin.</p><br/><p>There was no need to mention that Sangsang had figured out what they were planning to do.</p><br/><p>She asked whether or not they were aware of their sin. It was a question for the sinful ones.</p><br/><p>The most sinful one was definitely Chen, the Abbey Dean.</p><br/><p>Long Qing kneeled behind him and sweated profusely. The middle-aged priest kept shivering as if he could fall over at any time. Although the Abbey Dean had become a wastrel and was far weaker than Long Qing and the middle-aged priest in terms of cultivation, he seemed the most calm and even wore an indistinct smile.</p><br/><p>He smiled and said to the Heaven, “I am not guilty.”</p><br/><p>Sangsang’s voice was heard again above the plateau, “You colluded with the Buddhists and tried to put me to sleep. That is impiety. How could you defend yourself?” This time she did not say it to the entire world. Only the people on the plateau heard her and thus became even more scared. Many divine priests and deacons passed out in shock.</p><br/><p>The Abbey Dean confronted her. “That’s not true.”</p><br/><p>Sangsang questioned, “You won’t admit that you tried to kill me?”</p><br/><p>The Abbey Dean said, “I tried to kill Sangsang, not Haotian.”</p><br/><p>Sangsang said, “I am Haotian.”</p><br/><p>The Abbey Dean said, “I believe in Haotian, not the girl named Sangsang.”</p><br/><p>Sangsang asked, “What if I weren’t able to get out of the chessboard?”</p><br/><p>The Abbey Dean said, “Haotian is almighty. Furthermore, it was Haotian’s will. I just executed what Your Highness wished for. I’m sure Your Highness will understand my piety.”</p><br/><p>Sangsang said nothing for a long while.</p><br/><p>Spring breeze whistled through the peach blossoms. It was all quiet and no one dared to make a sound.</p><br/><p>After a long pause, she spoke again. “As a mortal, it is already sinful to presume Heaven’s will.”</p><br/><p>The Abbey Dean answered calmly, “If that’s my sin, then I am willing to take my punishment.”</p><br/><p>“As my follower, you should follow my order.”</p><br/><p>“Haotian’s will has never changed. And that is to guard the rules of this world no matter what.”</p><br/><p>“Even if I were to change my mind?”</p><br/><p>“Yes, because outside of this world is the realm of death. If Your Highness were to change your mind, then it will be the end of the human world.”</p><br/><p>“Sounds reasonable.” Sangsang said nothing further after that.</p><br/><p>After a long while, Long Qing tried to looked away from the sweat-stained ground, and looked at the Abbey Dean. He admired him but still felt confused.</p><br/><p>Haotian was awe-inspiring. But being able to converse calmly with Haotian under such circumstances, the Abbey Dean was even more awe-inspiring. He could not understand what made the Abbey Dean so courageous.</p><br/><p>The Abbey Dean managed to overcome great difficulties. He looked to the north and to Chang’an City, and said after long pause, “Continue with the ceremony. Haotian is ready to head back to the Divine Kingdom.” Different from Long Qing, the Abbey Dean did not find his conversation with Haotian horrifying. Instead, he thought he knew Haotian better than anyone else in the world.</p><br/><p>Of course Haotian would reason with human beings. Because she was reason itself.</p><br/><p>…</p><br/><p>…</p><br/><p>On top of the city walls of Chang’an, Sangsang recalled the world described by Ning Que and confirmed that the Abbey Dean was right. As he had said, it was her will after all.</p><br/><p>“Reasonable? What the fuck?!” Ning Que complained. “‘If that’s my sin, then I am willing to take my punishment.’ How could you have believed what he said? It was nothing but bullshit!”</p><br/><p>Sangsang said, “If it is not reasonable, he would have been dead.”</p><br/><p>Ning Que said, “Although Taoism did nothing, it is obvious that they knew from the beginning the Buddha’s chessboard would put you in danger. Yet they chose to do nothing. How could that be reasonable?”</p><br/><p>Sangsang suddenly asked, “Have you ever thought it might be myself who wished to enter the Buddha’s chessboard? He was merely conducting my order. How is he guilty?”</p><br/><p>The spring breeze became chilly wind on the city walls. Ning Que turned away from the wind and the question because he felt profound chillness.</p><br/><p>Sangsang looked at him and said, “Now you understand.”</p><br/><p>Ning Que put his hand on her forehead and said, “You are sick.”</p><br/><p>Sangsang smiled back and asked, “Do you have medicine?”</p><br/><p>Ning Que pretended to be serious and replied, “The Eleventh Brother was best at medication. Shall I ask for some from him?”</p><br/><p>He was just teasing because he did not dare to say anything else now. After hearing Sangsang’s conversation with the Abbey Dean, he felt his heart freezing. Even her smile did not bring any warmth.</p><br/><p>Her smile was as calm as her indifference.</p><br/><p>“I’ve told you. You wanted to take me to Chang’an because you wanted to restore the God-Stunning Array and defeat Heaven. You wanted to help the Headmaster defeat me. I know everything that you think about. You can never deceive me.” Sangsang stared at him and said calmly, “In terms of that, how guilty are you?”</p><br/><p>Ning Que managed to calm down. He looked at her and said, “Don’t forget that I know whatever you think as well. You wanted to use the God-Stunning Array to reopen the gate to Haotian’s Divine Kingdom. You can never deceive me either.”</p><br/><p>Sangsang said, “We are deceiving each other after all.”</p><br/><p>Ning Que said, “It seems you have lied to me much more than I have ever done to you. Like I said yesterday at the Academy, you’ve already taken my youth, so do not deceive my love.”</p><br/><p>Sangsang said, “Love? I vaguely know what that is. But I did not lie to you.”</p><br/><p>Ning Que said emotionlessly, “You could not get rid of the world of mortals the Master had embodied in you, or cut the bond with the human world or my stupid love for you. So you could not get back. You’ve traveled throughout the human world with me but could not find a way out. It wasn’t until our arrival at Lanke Temple and saw the ruined Buddha statue on Wa Mountain that you realized it was a trap that Buddha had set for you. Then you deliberately went into his trap and experienced attachment, aversion and obsession, the three poisons…”</p><br/><p>He continued. “You searched for the Buddha and threatened to kill him. Those were all lies. We went to Xuankong Temple and were trapped in the Buddha’s chessboard. It was all because of your own choice. Because by shaking off the three poisons of attachment, aversion and obsession, you would be able get rid of the world of the mortals.”</p><br/><p>His voice became hoarse. “Buddha thought he had comprehended the ultimate truth of cause and effect. But he never knew that he was just a sharp graver in your hand. You graved your own flesh to cut off the dust, so that you can return to the Divine Kingdom. Have you ever thought about me? What would that mean to me?”</p><br/><p>Sangsang said, “It was a battle. How can you not understand?”</p><br/><p>“It seems like it’s none of my business. But the person who spent endless time in the chessboard and gave you attachment, aversion, and obsession was me. The one who picked up the graver and graved you into a Buddha was me. I helped you shake off the three poisons and get rid of the world of mortals. It was me, me, all me.” Ning Que smiled to her and said, “I showed you my real feelings when we went through the thousand years inside the chessboard. You used me and deceived my love. My love, how could you not understand?”</p><br/><p>His smile was as light as water, and his emotion was as dense as blood.</p><br/><p>It wasn’t until then that the whole story about the chessboard and the result of their cause and effect was eventually unveiled.</p></div>\n</div>"}