{"title": "Chapter 989 - Haotian’s Gift To The Human World (I)", "id": 989, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-989-haotian%E2%80%99s-gift-to-the-human-world-i", "volume_title": "Volume 10", "body": "<h1>Chapter 989 - Haotian’s Gift To The Human World (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was late spring in Linkang. Houses were surrounded by the new green. A sedan came in from outside the city and was moving slowly on the street. Liu Yiqing was sitting inside the sedan with his eyes closed and looked calm.</p><br/><p>The Spring Offering was being held today. Countless lanterns were floating in the night sky. Countless Taoism followers prostrated piously to the lanterns and prayed to Haotian. It seemed solemn and divine.</p><br/><p>Liu Yiqing was blind. He could not see the charms of spring or the tens of thousands of lanterns. Yet he could hear their prayers and feel their enthusiasm.</p><br/><p>It reminded him of the spring breeze and rain from a few days ago: the spring rain that sprinkled throughout the human world, the magical moments it brought and the giant Ark that floated to the Divine Kingdom.</p><br/><p>Haotian had left the human world. But her blessing stayed. The changes it brought would reform the world and the era profoundly.</p><br/><p>Liu Yiqing raised his hand wearily and the sedan turned to the side of the streets. It carried on in a widened street and came to an old cottage.</p><br/><p>The old cottage was no longer shabby as it used to be. It was painted new by the followers of the New Stream. Liu Yiqing got out of the carried and entered the cottage. He stood by the window and kept quiet for a long while.</p><br/><p>Chen Pipi walked to his side and looked into the starry night out of the window.</p><br/><p>Liu Yiqing said, “It seems like a big era is coming.”</p><br/><p>His eyes were covered with a piece of white cloth and he could see nothing. Yet he could predict a magnificent and prominent future for the human world, as well as the blood and slaughter in it.</p><br/><p>The New Stream had prospered for a few years but was devastated in the recent days. On one hand, the Divine Halls of West-Hill had ordered to ban the New Stream. Followers of the New Stream were burned to death and thrown into the abyss. They would never be able to ascend to Haotian’s Divine Kingdom. On the other hand, Haotian had revealed her compassion and power to the human world. Haotian’s blessing had stayed in the world, the pious followers who had recovered from severe illnesses, the cultivators who broke through their previous states, the regrown fingers and limbs were all vital blows to the teaching of the New Stream.</p><br/><p>Chen Pipi looked at the dimming moon in the starry sky and said after a long while, “Maybe we should do something instead of waiting. Maybe we can stand against them.”</p><br/><p>Liu Yiqing looked towards the starry sky that he could never see, and said, “Human beings could never stand against Heaven.”</p><br/><p>Chen Pipi said, “It doesn’t sound like you.”</p><br/><p>A few years ago during the Rite to Light at Peach Mountain, Liu Bai broke into the Divine Hall of Light with his sword and stood against Heaven. Then, his disciples from the Sword Garret fought a way out of Peach Mountain for Chen Pipi and Tang Xiaotang and escorted them to Linkang.</p><br/><p>From then on, the Sword Garret had been standing against Taoism. Liu Yiqing had shown tremendous determination and power during their battles and had been respected by the cultivation world ever since.</p><br/><p>Starlight fell on the white cloth that covered Liu Yiqing’s eyes as if it had formed a layer of frost on the cloth. It looked like the accumulated frozen snow over thousands of years, chill and firm. So was his voice. “Not being able to stand against Heaven is different from choosing not to stand against it.”</p><br/><p>Chen Pipi did not reply to that. What Liu Yiqing said was exactly what the Sword Garret had been practicing. They had always been firm and cold as their blades. However, they never spoke about their despair and sorrow. Such resolutions could never turn the tides. Therefore it was heroically tragic.</p><br/><p>“The mandate from the West-Hill will arrive in no time,” Liu Yiqing said. Although he had not received the mandate, he knew it was an order to the South Jin to ban the New Stream and hand over Chen Pipi and the rest.</p><br/><p>He turned away from the starry night and looked at Chen Pipi through the thin white cloth, and said calmly, “The Sword Garret will no longer provide you with protection. You should get ready to leave.”</p><br/><p>Chen Pipi sighed. “We are so settled in Linkang. It’s a bit sad to leave.”</p><br/><p>Liu Yiqing said nothing further and left.</p><br/><p>The South Jin was a powerful kingdom, only second to Tang and the Golden Tribe. Being an ally of the Tang Empire, it played an important role in balancing the powers. However, the Sword Garret could not completely cut off Taoism’s impact on the South Jin. With Haotian’s blessing spread throughout the world, people in South Jin had regained their faith in Haotian. The imperial palace and their army had been preparing for some actions. Powerful as the Sword Garret was, they could no longer turn the situation.</p><br/><p>The only chance for them would be for the Academy to take some actions or for the Tang army to break through the Verdant Canyon and take control of the South Jin before the Divine Halls of West-Hill does.</p><br/><p>Unfortunately, although the Tang Empire had been restoring their power throughout these years, their cavalry was seriously weakened after the cession of the Xiangwan Plain. Most importantly, the Tang Empire lacked top tier soldiers right now. They could not defeat the Taoism even with the help of the Sword Garret.</p><br/><p>Though Taoism had lost several powerful cultivators in the battle years ago, they were still the governor of the world and had potential cultivators. With the returning of the South Sea branch as well as the blessing spring rain previously, many new powerful figures came forth from countless Taoist temples. The Drunkard and the Butcher were still out there, so the Academy could not risk their top leaders. How could they spare someone else to deal with those new powers?</p><br/><p>After all, it was because of the spring breeze and rain. That spring rain changed the world of cultivation tremendously. Countless cultivators had surpassed their highest levels. Many reached the State of Seethrough and quite a few even reached Knowing Destiny. Powerful figures appeared one after another, which indeed symbolized a new era.</p><br/><p>The Revelation Institute was preparing for the Grand Competition in early summer. Lu Chenjia, the Flower Fanatic and the current Deputy Principal looked at the nervous students and recalled what had happened previously. She could not help but feel somewhat sad. During the Grand Competition in that summer many years ago, Long Qing stood out from the talented ones. Will there be someone like him this year?</p><br/><p>In a remote yard, a little priest was looking at a tidy pile of firewoods. He pondered for a long while, then hung the slasher on his belt and headed toward the crowd. He spoke to the instructor nervously, “I want to sign up.”</p><br/><p>The Instructor looked at the dust stained little priest and asked harshly, “Do you know what you are doing?”</p><br/><p>Lu Chenjia stared at the little priest quietly and asked all of a sudden, “What’s your name?”</p><br/><p>The little priest felt nervous upon seeing such a beautiful woman, and answered, “Hengmu Liren.”</p><br/><p>Lu Chenjia continued, “What are you signing up for?”</p><br/><p>The little priest felt even more nervous, “I want to join the Grand Competition.”</p><br/><p>Lu Chenjia asked after a pause, “What state are you right now?”</p><br/><p>The little priest shook his head and said, “I have no idea.”</p><br/><p>They were by the lake inside the Revelation Institute. The little priest looked toward the lake and some fish became still upon his sight. Seeing that Lu Chenjia was slightly startled, the instructor passed out.</p><br/><p>“I don’t know what happened to you previously, but that must be a marvel.” Lu Chenjia looked at the little priest and said with trembling voice, “Because you are Haotian’s gift to the human world.”</p></div>\n</div>"}