{"title": "Chapter 994 - The First Strike", "id": 994, "volume": 10, "url": "http://boxnovel.org/nightfall-chapter-994-the-first-strike", "volume_title": "Volume 10", "body": "<h1>Chapter 994 - The First Strike</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Both Hengmu Liren and his slasher were burning. The endless Divine Flame of Haotian incinerated every bit of the Qi of Heaven and Earth into the finest ash. But he could not stop Liu Yiqing’s sword.</p><br/><p>Because Liu Yiqing’s sword had pierced the air in a whistle and torn the darkness with its chilling sword intent. It flew over the wall of purely white flame like willow floating in the wind and sweeping across a lake without making any ripples.</p><br/><p>Liu Yiqing gazed emotionlessly at the young emperor on top of the city wall. And his sword struck at the end of his sight line.</p><br/><p>The young emperor could not see the sword but he could see Liu Yiqing’s gaze. His face turned paler and paler and almost stopped breathing. He panted heavily as if his lungs were about to blow up. His heart kept beating faster as if it was going to explode at any time. He covered his chest with his hands and started vomiting blood in anguish.</p><br/><p>Hengmu Liren’s slasher was flaming and the air was sizzling. Nothing could stand in its way. Liu Yiqing’s right hand was cut off together with the sword it held. Blood spurted from his wrist while the hand and sword fell on the sedan. It must be extremely painful. Yet he remained emotionless like a silent willow.</p><br/><p>He could not see anything. But he still looked silently toward the top of the city wall with the white cloth covering his eyes. His hand that was holding the sword was cut off, and his sword fell onto the ground. But the sword intent was already launched to the city wall.</p><br/><p>The city wall was made of bluestone bricks and looked jet black in the darkness. It was not mottling and shined like a black diamond in Haotian’s Divine Flame.</p><br/><p>All of a sudden, countless cracks appeared on the surface of the black diamond. Spalls fell off the city wall and the cracks deepened instantly. The imperial city was collapsing.</p><br/><p>People standing on top of the city wall had no idea of what was happening under their feet. The young emperor of South Jin panted more heavily while his heart beat faster and faster and his cheeks turned paler and paler.</p><br/><p>Finally, someone heard the cracking sound coming from the city wall and saw those horrifying cracks, and screamed in fear. The generals and cultivators were about to escort the young emperor down.</p><br/><p>But it was too late. While the city wall cracked, so did the young emperor’s heart. Countless tiny cracks had destroyed the veteran city wall and taken the life of the young emperor.</p><br/><p>It went into an uproar on top of the city wall. People became extremely frightened and crowded around the young emperor who fell to the ground in his own blood.</p><br/><p>Liu Yiqing sat in the sedan and looked silently at the top of the city wall and the generals and cultivators he used to be very familiar with. He smiled slightly in comfort.</p><br/><p>The previous thundering clatters and the arrival of Hengmu Liren and other important figures from West-Hill was crucial but not surprising to Liu Yiqing. But it was still disappointing.</p><br/><p>An emperor should guard his kingdom. Instead, the young emperor of South Jin opened the gate of his kingdom tonight and welcomed the cavalry from West-Hill. You are the emperor chosen by the Sword Garret. Even if you could not fight against the enemies, how could you open your gate to them?</p><br/><p>Since that moment, the South Jin lost its territory and the city walls became meaningless. Therefore they should collapse, both the walls of the imperial city and those around the Tong’an Gate.</p><br/><p>Despite the fact that you are only thirteen years old, that you are the last survivor of the imperial family’s direct line of descent, that you called me teacher for years, and that you are somewhat kind-hearted, you are better off dead.</p><br/><p>Liu Yiqing thought so and did so. Therefore the first strike of his sword was aimed at the young emperor instead of Hengmu Liren. He wanted the last one of the imperial family’s direct line of descent to be the sacrifice for the city walls of South Jin.</p><br/><p>In order to accomplish that, his right hand holding the sword was cut off. Hengmu Liren came right in front of him and shined with Haotian’s Divine Flame. The white cloth covering his face seemed like some paper money prepared for the dead.</p><br/><p>But he couldn’t care less. For anyone from the Sword Garret, death or pain could never bother them. What mattered the most to them was how they could hit their enemies in the worst way.</p><br/><p>Hengmu Liren’s slasher was very slim and sharp. It was even more horrifying with Haotian’s Divine Flame on it. Liu Yiqing stabbed his sword into the city wall so that he was left unprotected under the slasher.</p><br/><p>The south wall of the imperial city finally collapsed in a rumble. Countless bricks fell onto the ground and quaked the earth. Dust rose toward the dark sky.</p><br/><p>The fallen wall and broken bricks were engraved with the history of the South Jin. The dust was the debris of its history.</p><br/><p>The dust dimmed the world. But Haotian’s Divine Flame was as firm and bright as always. It would never fade. Its glory was reflected by the dust into a bright silver colour and seemed even more divine and solemn, like silver clouds under star light.</p><br/><p>Deep inside the silver glory, Hengmu Liren and Liu Yiqing stood face to face silently.</p><br/><p>There were seventeen bloody gashes on Liu Yiqing’s body. His right hand and two legs were cut off. His lips were also pierced by the blade and looked like awkwardly applied rouge.</p><br/><p>The blade was pointing right in front of his eyebrows and the slasher intent was piercing directly into his soul.</p><br/><p>The slasher was very slim and not heavy at all. Hengmu Liren held it firmly and could kill Liu Yiqing with a simple push forward. No one could stop him.</p><br/><p>Liu Yiqing lifted his left hand and slowly wiped off the blood by the corner of his lips. He still looked very calm as if there was no blade pointing in front of him.</p><br/><p>On the contrary, Hengmu Liren looked pale and upset. His clear and firm eyes were filled with anger, confusion, and humiliation. “Why?” he stared at Liu Yiqing and asked.</p><br/><p>Liu Yiqing looked at him through the white cloth and said nothing.</p><br/><p>Hengmu Liren knew that Liu Yiqing was blind. But somehow he felt those eyes under the white cloth were staring at him with mock and pity.</p><br/><p>“Why?” he exclaimed.</p><br/><p>Ever since the spring breeze and rain, Hengmu Liren never doubted himself and his level of cultivation. He thought that no one in the human world could be his match. But when Liu Yiqing destroyed the imperial city in a single strike, he had to admit that if that strike was aimed at himself, then he would have been in trouble.</p><br/><p>But why?</p><br/><p>Why didn’t Liu Yiqing launch his first strike at me? Does it mean that I am less important than the young emperor of South Jin?Or does it mean he is bold enough to think that he could kill me with his second strike?</p><br/><p>It seemed like the blade that was pointing at his eyebrows posed no threat to Liu Yiqing.</p><br/><p>He answered, “Because you are not worthy of it.”</p><br/><p>Hengmu Liren found that was the funnest and most absurd joke he had ever heard.</p><br/><p>Liu Yiqing continued, “It was my first strike, so you are not worthy of it even if you are somebody from the West-Hill and the most valued genius of Taoism.”</p><br/><p>Hengmu Liren asked again, “Why?”</p><br/><p>Liu Yiqing said, “The entire cultivation world refer to you as the gift from Haotoian.”</p><br/><p>Hengmu Liren asked, “And I’m still not worthy of your first strike?”</p><br/><p>Liu Yiqing said, “My sword is for killing, not to unfold some present. Therefore you are not worthy of it.”</p></div>\n</div>"}