{"title": "Chapter 1002 - Looking After (I)", "id": 1002, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1002-looking-after-i", "volume_title": "Volume 11", "body": "<h1>Chapter 1002 - Looking After (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>After the Abbey Dean was punished and became a wastrel in Chang’an, the Drunkard and the Butcher submitted themselves to Haotian and became the top two figures of Taoism in the human world. Since these two were not settled, especially the Drunkard who had been travelling around the world riding on the wind, the Academy could do nothing but watch the Divine Halls extinguish the New Stream, kill their followers, destroy the Sword Garret, and watch Liu Yiqing come to Linkang by himself and eventually get killed.</p><br/><p>Jun Mo had been leading the tens of thousands of slaves fighting against Buddhism for years in the West Wilderness. Yu Lian disappeared in the East Wilderness for something very important. The only two left in the Academy to solve this were Li Manman, the Eldest Brother, and Ning Que, the Ning Que who stayed in Chang’an.</p><br/><p>The Eldest Brother wanted to save Liu Yiqing, but he also wanted to save more people. To save more, he had to kill first. He was able to kill but could not do that. He was already at the Distanceless State and could kill as many powerful Taoist cultivators as necessary. Yet while he was capable of killing, so was the Drunkard. Because he was also Distanceless.</p><br/><p>If the Academy did not want to see the Tang army, officials, or even ordinary people die, they had to stay aside and watch Taoism come closer and closer.</p><br/><p>The Academy had tried to communicate and persuade the Drunkard and the Butcher but had failed. They continued to try to communicate. But if they were to fail eventually, the Academy had prepared another option: to kill the Drunkard and the Butcher.</p><br/><p>However, it was exceptionally difficult to kill such figures. If the Abbey Dean had not come to Chang’an years ago, then the Academy would have never been able to hurt him. This was also the case for the Drunkard and the Butcher. For people in their state, they were almost demigods. They knew their fate and could sense any changes. It was very hard to set them up.</p><br/><p>What happened in Linking tonight had nothing to do with the Academy. It was all planned by the Divine Halls. The only thing the Academy did was to follow their trap and try to achieve what they wanted. It was called riding on the momentum. Because of this, the Divine Halls did not predict it, but neither did the Drunkard.</p><br/><p>The Divine Halls tried to force the Academy to come by destroying the Sword Garret and killing Liu Yiqing. Powerful figures gathered in Linkang and the Drunkard hid deep in the darkness. Taoism had painted a giant dragon. But the Academy was the one to finish the pupils of the dragon’s eyes.</p><br/><p>Unfortunately, it was just close. They almost made it.</p><br/><p>Ning Que stood on top of the city wall and stared at somewhere afar in the south. He pondered for a long while and finally gave up. He let go of the string and put the iron bow back into its case.</p><br/><p>From now on the Drunkard would be even more vigilant and it would be harder to find another chance. It was their best shot tonight. But they could neither kill nor wound the Drunkard. This made him very disappointed.</p><br/><p>But he still seemed very calm. Nothing changed. The several Tang soldiers on the city wall had no idea what had happened and why he pulled his bow previously.</p><br/><p>Earlier on, he saw a blazing flame in the direction of Linkang. Of course he did not see it with his eyes but with his consciousness and the help of the God-Stunning Array, he sensed the light, the pure and clear light. Since Sangsang had left the human world, that must be the young man from Taoism called Hengmu Liren.</p><br/><p>Ning Que had no problem with killing Hengmu, even if it would bring forward the battle between the Divine Halls and the Tang Empire right away. He somehow hated that young Taoist talent so badly even though they had never met. Perhaps it was because of the rumor that this young man was the gift from Haotian to the human world.</p><br/><p>He did not kill Hengmu because Long Qing stood in the way and blocked Hengmu’s location from his consciousness. He could have killed Hengmu previously when he was fighting with Liu Yiqing, but he did not. It was because the Drunkard had not exposed himself at that time. His first shot had to be aimed at the most powerful enemy. And there was another very important reason.</p><br/><p>Liu Yiqing’s sedan was facing the imperial city and blocked the way.</p><br/><p>Perhaps it was because Liu Yiqing did not want him to waste such a great chance on Hengmu. Or perhaps Liu Yiqing wanted a fair fight with Hengmu. Or perhaps it was simply because Liu Yiqing wanted it this way.</p><br/><p>“Sought for virtue and acquired it? You were simply seeking death!” Ning Que looked to the south in the darkness and mocked. “You were just seeking death so that the Academy would look after the South Jin and the Sword Garret. You thought I couldn’t see through your trick?”</p><br/><p>It had been so many years since they had left the City of Wei. He had experienced a lot, and spent countless years inside the Buddha’s chessboard. Even though he did not change much in terms of appearance, he should have gained some poise after all. But it was quite the contrary. His young freckles had faded and the cute dimples disappeared, and a few slight scars made him seem more mature. However, when he mocked and scorned Liu Yiqing, he almost returned to the frivolous and carefree young boy in the City of Wei.</p><br/><p>Upon saying those words, he suddenly fell into silence again. His emotions faded and he became indifferent. He looked like an old man who had lost all interest in life.</p><br/><p>What could he do even if he had seen through it? He could only take it because Liu Yiqing was dead. And many others had already left or were dying. He could do nothing but accept it.</p><br/><p>The Eldest Brother left Chang’an for the Drunkard and asked him to look after the young emperor. The Second Brother was leading the fight in the West Wilderness and asked him to look after the Seventh Sister. The Eldest Sister left for the East Wilderness and asked him to look after her brush pens and ink. Chao Xiaoshu left for that little town and asked him to look after his father, wife, and kids. His Master and the previous emperor died and left him with the Core Vajra of the Array. They asked him to look after Chang’an and Tang Empire. Tonight, Liu Yiqing died and left the South Jin and Sword Garret for him to look after.</p><br/><p>He stood on top of the city wall and had to look after the entire human world. Therefore he could not leave.</p><br/><p>Before the journey with Sangsang many years ago, he was imprisoned in Chang’an for a while. But that was different. At that time he only needed to look after Chang’an, whereas now he had to look after the entire human world. It meant more responsibilities.</p><br/><p>The city wall was too high for any tree to reach. There were no fallen leaves or ripe fruits on top of the city wall. Several Tang soldiers were on patrol, but they were not his companions. He was all by himself.</p><br/><p>Ning Que stood by the wall and looked at the human world in the darkness. He kept quiet for a long while. If only he knew that Liu Yiqing had called himself a wandering ghost in the City of Linkang, he might have had some empathy for him.</p><br/><p>He was looking after the human world. But who was going to look after the Old Brush Pen Shop and their house by the Yanming Lake now? The willows by the lake, the lotus in it, the broken walls of the backyard and the cat on the wall, who would be looking after them?</p><br/><p>Sangsang had left. Who would look after him?</p></div>\n</div>"}