{"title": "Chapter 1008 - Killing In The Autumn Wind And Rain (III)", "id": 1008, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1008-killing-in-the-autumn-wind-and-rain-iii", "volume_title": "Volume 11", "body": "<h1>Chapter 1008 - Killing In The Autumn Wind And Rain (III)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The yard was crowded with prisoners, men and women, old and young, all in shabby clothes. They looked pale, as if they hadn’t seen the sun for many years. Death might be a kind of relief for them since they had already lost the courage to live on. They kneeled on the ground numbly and revealed no intentions of atonement, so the rain falling from the sky didn’t add much of a solemn atmosphere to the scene.</p><br/><p>Seeing this, the officials from the Ministry of Revenue were nervous and their hands that were holding the pens were shaking slightly. But the executioners seemed calm and their hands holding the hilts were stable.</p><br/><p>“How do you plan on killing them?” Shangguan Yangyu stood behind Ning Que with his body bowed and whispered, “The cultivators who participated in the rebellion, except for those died of illness and torture, are all here. You want to kill them all or pick out some unlucky fellows?”</p><br/><p>Ning Que looked at the prisoners in the autumn rain and said, “Don’t kill them all tonight. We may need to do this several times.”</p><br/><p>Shangguan Yangyu said, “What’s the standard? How much the Divine Halls values them or the degree of seriousness of their crimes? Everyone here have blood on their hands.”</p><br/><p>Ning Que replied, “Since we are doing this for the Divine Halls, just pick some people randomly.”</p><br/><p>Shangguan Yangyu didn’t understand what he meant and asked, “Randomly?”</p><br/><p>Ning Que waved his hand and answered, “Just take your pick.”</p><br/><p>The officials from the Ministry of Revenue stood gazing at one another, and the executioners were also shocked. But Shangguan Yangyu didn’t hesitate and waved his hand, indicating to kill half of the people kneeling.</p><br/><p>The blade cut through the rain and fell on the prisoners’ necks, easily lacerating their muddy skin and dry muscles and cutting off their bones with blood squirting out.</p><br/><p>With a slight sound, a human head fell on the ground like a mellow fruit and bounced twice in the water accumulated on the blue flagstone. Then it settled down on the ground and the blood was quickly diluted by the rain.</p><br/><p>Seeing the human head, the prisoners were finally awakened from the fear of death and regained some vitality to their numb nerves. Some tried to escape from the ropes, some desperately toppled down and cried, and some looked at Ning Que with hatred in their eyes.</p><br/><p>Killing was always bloody. Ning Que didn’t want to see the bloody scene and was not interested in having eye contact with these dying prisoners, so he turned back to the hall.</p><br/><p>After sipping some warm tea, he looked up to the yard again and saw that more than a dozen corpses had fallen in the autumn rain and the blood on the ground was getting thicker.</p><br/><p>The rain kept falling and the killing went on. The bodies kept falling to the ground heavily and made a splash when they touched the accumulated water.</p><br/><p>Ning Que looked at the clear tea in the cup and was thinking something. Shangguang Yangyu stared at his profile and was stunned. The officials from the Ministry of Revenue kept scratching names of the prisoners off the list and turned pale while there were fewer and fewer names on the list.</p><br/><p>The rain went on. The frequency of the sound of human heads falling on the ground in the yard gradually slowed down and the breathing of the executioners was getting thicker and thicker. After all, chopping off so many heads was an exhausting effort.</p><br/><p>The coroners from the Ministry of Penalty and the relevant staffs from the Ministry of Revenue rushed to the yard to examine and then disposed the bodies. The executioners were taking their short break while drinking hard liquor.</p><br/><p>But the killing was not finished. Ning Que said that he was going to kill a lot of people today. After the bodies were removed and the executioners restored their energy, the killing continued.</p><br/><p>Then, more prisoners were brought in by the Ministry of Penalty. And Ning Que specifically ordered the Military Ministry to send in dozens of prisoners. There were so many prisoners that they couldn’t all kneel down in the yard together and were divided into several batches.</p><br/><p>“Most of them are just the traitors’ family members,” one official from the Ministry of Revenue said to Shangguan Yangyu in shock while flipping through the list of prisoners. “Do we need to kill them all?”</p><br/><p>Shangguan Yangyu did not answer the question but said to Ning Que, “Should I just pick some to kill randomly?”</p><br/><p>The officials on the scene all looked dreadful. There are hundreds of people here. They are just family members involved in the war. Even though they did conceal their intelligence, they should not be condemned to death according to the laws of the Great Tang. Besides, the decision of death penalty should be made by the Ministry of Penalty. How could we just kill them in this way?</p><br/><p>These hundreds of family members had been in jail for several years. Because they were not cultivators, they had not been forbidden to talk. Hearing what the official said to Shangguan Yangyu, they were frightened and cried out about their grievances.</p><br/><p>Their charges were colluding with the enemy. According to the laws of the Great Tang, the biggest difference between colluding with the enemy and treason was that the ones who colluded with the enemy didn’t betray their country voluntarily. Therefore, the family members of people who committed treason were often considered to be colluding with the enemy.</p><br/><p>After the war broke out a few years ago, many Tang people came back to the Great Tang from all over the world, and two-thirds of the Taoists from the South School of Haotian Taoism cut off their ties with the Divine Halls. However, there were still many devout followers of Haotian who swore loyalty to the Divine Halls and even joined the Papal Cavalryman. Those people were traitors, and their family members were considered have colluded with the enemy even though they had broken off relations with their relatives, for the blood relations couldn’t be completely cut off. This was the coldest and cruelest article in the laws of the Great Tang.</p><br/><p>In the past few years, the imperial court of the Great Tang searched the whole country and guarded the border strictly. They captured thousands of people who were suspected to be colluding with the enemy and detained them in the prisons of Chang’an and other prefectures. The imperial court did so to frighten and pin down the traitors who were far away from home.</p><br/><p>But Ning Que was going to kill all these people at this point, which puzzled the people who were present, including the family members and the officials.</p><br/><p>The smell of blood filled the street on the side of the yard, and the human heads being chopped off earlier were temporarily piled up on the cart to be disposed. All of a sudden, a human head rolled down the cart and kept rolling forward to the yard. The family members kneeling down in the yard were frightened and bursted into shouts and tears.</p><br/><p>Ning Que looked up to the people kneeling down in the autumn rain, as if he was seeing the gray wall that got wet from the spring rain opposite the Old Brush Pen Shop and seeing Xiaohei who had already departed.</p><br/><p>Seeing the human head in the rain, he remembered the familicide that took place in the General’s Mansion many years ago, the blood overflowing the crack of the door and the heads of his acquaintances rolling like watermelons.</p><br/><p>“In a spring many years ago, a rain fell on Chang’an. While the imperial court and the the Divine Halls were conducting peace negotiations, I rushed into the club house of the Qinghe Prefecture with Fish-Dragon Gang and Yulin Royal Guards and killed all of people from the Qinghe Prefecture there.” Ning Que said, “Now that I think of it, I have some regrets.”</p><br/><p>The officials relaxed a little and thought that the Academy was benevolent after all. But Ning Que continued to say, “Maybe I can benefit more if I had killed those people slowly back then.”</p><br/><p>The yard was silent, and the rain and the children’s crying were heard.</p><br/><p>“I know that you innocent. Those people from the Qinghe Prefecture I killed back then probably thought so too. And according to the laws of the Great Tang or based on morality, some of you are indeed innocent.” Ning Que looked at the people kneeling down in the rain and said, “But I don’t care.”</p><br/><p>The officials and Yulin Royal Guards present were all Tang people. They did care about this matter, so their faces darkened. However, Shangguan Yangyu didn’t care and raised his right hand slowly in the autumn rain. He and Ning Que were both atypical Tang people. For them, the laws of the Great Tang was just a tool, and the moralities were just something that a man should admire but not necessarily have.</p><br/><p>The executioners raised their knives. The human heads fell on the ground.</p><br/><p>Old faces, young faces, and childish faces turned pale instantly and lost the breath of life after losing so much blood and being washed by the rain. With the frightened shouting, the mournful begging, the resentful cursing and the sad crying, all kinds of human heads kept falling on the ground.</p><br/><p>Hundreds of family members of the traitors died in the rain. The knives cut through the flesh and brought death. The sound of chopping off human heads became muffled, for the blades of the knives were turned. At last, the sound was like a broken drum being beaten nonstop, which was muffled and terrifying.</p><br/><p>The hands of the executioners began to tremble, and the officials from the Ministry of Revenue had trouble holding their pens steadily and left more and more marks on the list. But they never received the instruction to stop.</p><br/><p>Shangguan Yangyu thought that he really didn’t care about these people. However, while seeing all these people, men and women, old and young, falling to a pool of blood and the human heads piling up in the yard, he realized that his heart was not as strong and hard as he had thought. He reached out to wipe the sweat or rain off his face and said to Ning Que in a trembling voice, “Is this enough?”</p><br/><p>Ning Que answered, “The Ministry of Revenue is best at counting money and heads. I let you take charge of this matter, for I want to know how many people I should kill. So the question is yours to answer.”</p><br/><p>Shangguan Yangyu sighed and replied, “I am just an ordinary person, and I can’t understand the state of mind of the Grand Cultivators. The most critical thing was that I don’t know whether that person would be affected by the Divine Halls. So, I don’t know how many people we should kill, and I even suspect that how many people we kill won’t even matter for that person.”</p><br/><p>Ning Que knew that Shangguan Yangyu did have a point. He was not sure whether the joys and sorrows in the human world could affect people like the Drunkard.</p><br/><p>The cold rain kept pouring, but it couldn’t stop the pungent bloody smell from filling the air. Ning Que looked at the blood and said, “The autumn wind and rain make the world melancholic.”</p><br/><p>Even at this moment, Shangguan Yangyu didn’t forget to praise him, “Good poem.”</p><br/><p>Ning Que replied, “Maybe you can write one?”</p><br/><p>Shangguan Yangyu said with a bitter smile, “I don’t have the mood.”</p><br/><p>Ning Que reached out to catch the raindrops and said, “It’s not like we have better things to do.”</p><br/><p>Shangguan Yangyu replied, “Mr. Thirteen really knows the little pleasures of life.”</p><br/><p>“Actually I don’t know how many I should kill. But like I’ve said, it’s not like we have better things to do. These people deserve to die anyway. Besides, the imperial court has to waste money on feeding them. Since we have nothing better to do, it’s not such a bad idea to kill some insignificant people in the autumn wind and rain. It does make sense that you call this the little pleasures of life.”</p><br/><p>Ning Que walked into the rain and turned around and said to the officials, “Maybe we can try to kill more. The Ministry of Revenue handles the grain rations of prisoners of war, so you should know the number. Any suggestions for how many to kill?”</p></div>\n</div>"}