{"title": "Chapter 1016 - Let’s Gamble, On Human Lives (II)", "id": 1016, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1016-let%E2%80%99s-gamble-on-human-lives-ii", "volume_title": "Volume 11", "body": "<h1>Chapter 1016 - Let’s Gamble, On Human Lives (II)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The carriage trembled slightly in the autumn wind, and the whistling sound of wind came from the cracks in the window. The rain drifted in and wetted the cyan curtain in a short time. The oil lamp inside the carriage was flickering, as if it would die out at any moment. Under the light of the lamp, Chu Youxian looked pale not because of fear but because of his father who sat opposite of him looked paler than him and was crying.</p><br/><p>The Old Mr. Chu wept bitterly and grabbed his son tightly. Maybe the carriage trembled too heavily, so the old man’s voice trembled. “In these years, I have spent tens of thousands of silvers on you, and the only thing I want is for you to have a bright future. I never thought that you would walk into the blind alley. If I had known it, I would not send you to the Academy in the beginning.”</p><br/><p>Hearing this, Chu Youxian went silent for quite a while. Then he suddenly picked up the curtain and said while pointing to the dark sky in the wind and rain, “Father, life is just like the sky, you can never predict what the weather will be tomorrow. If trouble is inevitable, then I want to do something great. The matter between the imperial court and the Divine Halls is the most profound thing in one thousand years.” He took back his hand to point at his nose and said, “I am going to handle this matter as an envoy, which is an honor you can’t buy with even ten million liang of silvers.”</p><br/><p>“But what’s the point of sending you there?” The Old Mr. Chu said while crying, “Even if the imperial court and the Academy want to negotiate with the Divine Halls, it has to be those big shots making the final decisions. Then why sending you there to take the risk?”</p><br/><p>Chu Youxian did not explain too clearly and just answered, “Just don’t overthink this. I heard that you plan to rewrite our genealogy next spring. You should focus on that. If I never come back, you have to choose a good place for my memorial tablet.”</p><br/><p>The Old Mr. Chu was angry and shouted, “Do not say those unlucky words! You are my only son. I can’t lose you.”</p><br/><p>Chu Youxian did not take it seriously and replied, “I am just saying.”</p><br/><p>The Old Mr. Chu smacked his son’s head, knowing that he couldn’t change his mind. Then he taunted his son, “Even if you are dead, you can’t expect a good position in the ancestral hall. You are not expecting to get a position better than your grandfather’s, are you?”</p><br/><p>Chu Youxian replied angrily, “If I were to die, then I’ll be dying for our country. Why can’t I expect a good position in our ancestral hall?”</p><br/><p>The cyan curtain was lifted and the wind and rain sank in. Chenqi walked in without any expressions. Knowing that it was time for them to depart, the Old Mr. Chu sighed and walked out of the carriage.</p><br/><p>Looking at his father’s bent back, Chu Youxian went silent. Although his father taunted him in the end, he knew clearly how his father felt at this moment. Old Mr. Chu and everyone in Chang’an knew that they were seeking their own dooms.</p><br/><p>Chenqi ignored the mood swing Chu Youxian went through, looked at the file in his hand, and said, “If you don’t want to die, just stop thinking about it.”</p><br/><p>Chu Youxian looked at Chenqi, the brain of the Fish-Dragon Gang, and sighed. “Everyone said that you are resourceful. But I doubt that you can find any chance of survival in this dead end.”</p><br/><p>Chenqi still kept his head down, looked through the information on the file under the dim light and replied, “That is not important.”</p><br/><p>Chu Youxian went silent for a moment and then said with a smile, “You are right. Whether we can come back to Chang’an alive or not is not important.”</p><br/><p>Everyone knew that their trip to the Divine Halls was representing the will of the Great Tang and the Academy. But they didn’t have official capacities. They were only the private representatives of Ning Que, for they carried thousands of bloody human heads with them which might tarnish the reputation of the Great Tang and the Academy.</p><br/><p>If the negotiations were to fail, then they would have to leave those bloody heads on Peach Mountain and would never be able to return to Chang’an.</p><br/><p>Just like the puzzled Old Mr. Chu, many people didn’t understand why the imperial court and the Academy sent them to the Divine Halls. The negotiations could only be made with force, so sending envoys seemed unnecessary.</p><br/><p>The wheels ran over the blue flagstone and made a squeaking sound. The carriage slowly headed to outside the city. Chenqi and Chu Youxian stopped talking and went silent.</p><br/><p>Whether they could come back to Chang’an alive or not was not important, for that was not their mission. Except for promoting how cold Ning Que was and telling people about those thousands of human heads along the way, their real mission was to deliver a message to someone on Peach Mountain for Ning Que.</p><br/><p>The message was very important, which couldn’t be written on paper. The person who was supposed to get the message lived in the depths of Peach Mountain and even Mr. First of the Academy couldn’t see her. Therefore, even though there was a strong possibility that they might tragically die, Chu Youxian and Chenqi still started their journey without any hesitation.</p><br/><p>…</p><br/><p>…</p><br/><p>When the carriage pulled out of the city gate in the autumn rain, the person who ordered them to pass the message stood in the Imperial Study, looking at the rain, which was like a curtain, and the delicate chrysanthemums in the Imperial Garden.</p><br/><p>In the Imperial Garden, the young emperor walked to the back hall with a group of eunuchs and odalisques by his side. Seeing the figure by the window from afar, the emperor stopped stiffly and saluted to the figure in a way which did not conform to the protocol.</p><br/><p>Ning Que nodded and then reached out to close the window after the figure of the emperor disappeared in the palace, blocking the cold wind and rain outside. Then he looked back at the lady sitting behind the desk who was thinner and thinner and suggested, “You should take a walk outside the palace sometimes. You know clearly how beautiful Chang’an is in autumn when it is not raining.”</p><br/><p>Li Yu was a little pale, but she was not sick, just that she had not seen the sun for many years. After the rebellion, she never left the palace.</p><br/><p>Hearing what Ning Que said, she smiled but remained silent. She did not even explain why she never left the palace, for she believed that he knew everything.</p><br/><p>“No one in the imperial court dares to doubt you now, so you don’t have to lock yourself in the palace to avoid arousing suspicion.” Looking at her calm face, Ning Que knew he couldn’t convince her and frowned. Then he suggested again, “Even if you don’t want to leave the palace, you can walk around the imperial garden and sail on the lake. I am not saying that these kinds of pleasures are important, but you have to stay healthy before His Majesty is old enough to wield power.”</p><br/><p>Li Yu put away the book and said calmly, “I will still be alive for several decades. But how come you left the city wall? Don’t you need to keep an eye on those terrifying big names? What if something bad happens when you are away?”</p><br/><p>Ning Que had lived on the city wall for quite a long time. He frightened the powerful enemies in the surrounding country with his iron bow and arrows, just like how the Drunkard frightened the monarch, ministers, generals, and soldiers of the Great Tang with his speed and killing.</p><br/><p>“I have to take a rest.” He answered, “And I can not be at ease until I make some matters clear.”</p><br/><p>The conflict among the human world remained unsettled, and the war between the Great Tang and the Divine Halls was about to begin. The Academy was part of the world, so of course it should care about these matters. Ning Que had no doubts about Li Yu’s ability in ruling the country, so he had to figure out what she was thinking. “I have deduced countless times in the past. If the Academy can’t handle the Drunkard, then the war would not be able to start, let alone our victory.”</p><br/><p>Li Yu looked at him quietly and then asked, “So have you come up with a solution?”</p><br/><p>Ning Que went silent for a while and then said, “I need more time.”</p><br/><p>Li Yu said, “That’s the problem.”</p><br/><p>The Drunkard wandered in the world and was willing to kill people, which was the biggest threat that the Great Tang was facing. If the Academy couldn’t kill him, then waging a war was meaningless.</p><br/><p>But for the Divine Halls, this was not a problem, so they could choose any time to wage a war. And the importance of timing to the outcome of a war was self-evident.</p><br/><p>Ning Que said, “So we need to wait a little while.”</p><br/><p>Li Yu replied, “That’s why you sent Chu Youxian and Chenqi to the Divine Halls.”</p><br/><p>Ning Que said, “The joys and sorrows of the human world can not affect the Drunkard, but can affect Taoism. We can only hope that Taoism can convince the Drunkard.”</p><br/><p>Li Yu asked, “But if we can’t?”</p><br/><p>“Fortunately, people like the Drunkard and the Butcher never do meaningless things, including meaningless killings. They are just the dogs of Haotian, executing the will of Haotian. The person who actually is responsible for explaining the will of Haitian lives on Peach Mountain.”</p><br/><p>“You mean the Abbey Dean.”</p><br/><p>“Yes.”</p><br/><p>Li Yu then changed the subject, “Chu Yuxian and Chenqi went to Qinghe, but will those powerful clans be willing to talk to them, especially if they know how many people you have killed?”</p><br/><p>Ning Que answered, “The more I kill, the more willing the Qinghe clans will be to talk to me. Even though the clans don’t want to talk, they would at least invite them to dinner.”</p><br/><p>Li Yu had some worries and whispered while looking at him, “But what about your reputation? Even the Tang people can hardly accept killings like this.”</p><br/><p>Thinking about the scene he saw in front of the window and the fear and aversion revealed on the face of the young emperor in bright yellow, Ning Que couldn’t help but laugh and said, “I am not like my Eldest Brother after all.”</p><br/><p>Li Yu said, “But you can become that kind of person.”</p><br/><p>Ning Que replied firmly, “I don’t want to because it only means being a good person, but not a person who can talk to the whole world.”</p><br/><p>“Talk to the whole world?”</p><br/><p>“Yes.”</p><br/><p>“What do you mean?”</p><br/><p>“When I talk, the whole world must listen.”</p><br/><p>“Has the world seen such a person before?”</p><br/><p>“The Headmaster and the Eldest Brother could do it, but they chose not to, for they are good people, as I mentioned before.”</p><br/><p>“Then who has done it?”</p><br/><p>“Lian Sheng could definitely do it if not for my Youngest Uncle.”</p><br/><p>“Even though it means destroying the world?”</p><br/><p>“That’s his goal, not mine.” Ning Que paused and then continued, “I just want a negotiation with the world.”</p><br/><p>Just want a negotiation with the world! His attitude was very gentle, even a little humble, but Li You somehow felt that the air in the Imperial Study became colder than the autumn rain outside. She walked toward him and pushed the window open, letting the wind and rain flow in, for she felt warmer this way.</p><br/><p>The autumn rain kept falling in the royal garden, and the golden chrysanthemums were still eye-catching, as if they were burning. But in the inconspicuous corner, there were many broken branches and fallen leaves, and the wet soil half covered the decaying fruits which looked like human skulls.</p><br/><p>The entire Great Tang was shrouded in the cold autumn rain, and the decayed trees on the roadsides were wet, and so were the pedestrians under the trees. In the execution fields around the country, blood were everywhere with various kinds of skulls soaking in them.</p><br/><p>This autumn, Ning Que said he wanted a negotiation with the world. As he said to Cheng Lixue, he shoved in all of his chips since the world refused to listen to his voice quietly.</p><br/><p>The fruits that fell in the autumn rain and the heads soaked in the blood were proof of his determination and will.</p><br/><p>In such a situation, the carriage of Chu YouXiang and Chenqi drove out of the Verdant Canyon, went through the beautiful bridges in the misty rain, and came to Qinghe Prefecture.</p><br/><p>Hundreds of crossbow aimed at the carriage, and dozens of See-through State cultivators were silently waiting in the alley on the side of the street.</p><br/><p>The big names of the powerful clans of the Qinghe Prefecture were not in their manors by the Fuchun River, but in the largest restaurant in Yangzhou City.</p><br/><p>As soon as they gave the signal, the arrows would rain down on the carriage, and the dozens of strong cultivators would launch an attack all together. The two in the carriage would not stand a chance of surviving.</p><br/><p>The restaurant was quiet, and the masters of the clans all kept silent.</p><br/><p>…</p></div>\n</div>"}