{"title": "Chapter 1014 - Put Up A Building To Watch The Autumn Wind", "id": 1014, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1014-put-up-a-building-to-watch-the-autumn-wind", "volume_title": "Volume 11", "body": "<h1>Chapter 1014 - Put Up A Building To Watch The Autumn Wind</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The autumn rain kept falling down quietly. Suddenly, the hasty sound of hooves came from the foot of the mountain, and a horseman appeared and shouted something loudly. The Eldest Brother, who was preparing to leave, glanced at the Drunkard.</p><br/><p>The horseman was all wet and the warhorse was covered in wet mud. The horseman wore a black and gold armor which had lost its original majestic and gorgeous appearance.</p><br/><p>The soldier was from the Divine Halls, and it seemed that he came here for an urgent matter. The Drunkard frowned slightly, which was rare, for there were not so many things in the human world that he cared for. Besides, finding him and Li Manman in the autumn rain was not easy. It was very likely that the Divine Halls sent tens of thousands of soldiers searching for them. So what happened on Earth?</p><br/><p>With a clear sound, the soldier kneeled down, touched the ground with his forehead and passed the message to the Drunkard in a trembling voice.</p><br/><p>Ning Que had started killing people in Chang’an.</p><br/><p>Hearing this, the Drunkard looked more serious, but the Eldest Brother looked relaxed.</p><br/><p>The Divine Halls didn’t know who Ning Que killed or how many he killed, just that he started killing people. And according to the intelligence from the Great Tang, all prefectures were beginning to kill people.</p><br/><p>“You know, I planned to leave here and start killing people before.Now I see,” said the Eldest Brother as he turned to look at the Drunkard, revealing deep guilt and self-blame. “My Youngest Brother is much braver than me.”</p><br/><p>“This kind of determination has nothing to do with bravery. It is just a habit. He is used to killing people and risking other people’s lives to win. As I’ve said before, he is a person who is good at risking his life.” The Drunkard replied without any expression, “But I’ve also said that I love no one and nothing in the human world. What Ning Que did won’t affect me.”</p><br/><p>The Eldest Brother pointed to the soldier who was kneeling in the rain and said, “But it will affect Taoism. Otherwise they won’t be so anxious to find you. Maybe you should hear what he has to say.”</p><br/><p>Hearing this, the soldier lowered his head and his voice trembled heavily, sounding very pitiful. “Please wait patiently.”</p><br/><p>The Drunkard replied with sarcasm, “No matter how many people Ning Que killed in Chang’an yesterday and no matter how many people he will kill in the future, I couldn’t care less about those ordinary people. What’s the point of waiting?”</p><br/><p>The Eldest Brother said, “Killing all of the Tang people is not the ending you want, and you are also waiting to be persuaded. My Youngest Brother just gives you an excuse.”</p><br/><p>The Drunkard said, “The excuse is too naive. Does he really think that he can stop the dispute in this way? Is he not afraid that the human world would fall into chaos?”</p><br/><p>The Eldest Brother answered, “Haotian would not want to rule not a cold and uninhabited world, for she would perish too. She would hate to see the world be destroyed.”</p><br/><p>The Drunkard went angry and shouted, “How dare he destroy the world? The Headmaster would kill him directly, not to mention Haotian! It’s ridiculous!”</p><br/><p>The Eldest Brother said, “No one can change the decision my Youngest Brother made. Jun Mo and I couldn’t talk him out of it, and Haotian couldn’t affect him either. The Headmaster might be able to persuade him, but he can’t come back yet. So who can stop my Youngest Brother if he really wants to destroy the world?”</p><br/><p>At this point, the loud sound of hooves came from far away, even drowning the sound of the falling rain. Hundreds of cavalrymen from the Divine Halls were rushing to the Autumn Mountain from Linkang City and other directions.</p><br/><p>The Eldest Brother looked at these anxious cavalrymen and said, “The Abbey Dean knows what Ning Que plans to do, so he will definitely find a way to convince you.”</p><br/><p>…</p><br/><p>…</p><br/><p>One day in the late autumn, the governor of Chuzhou of the Great Tang passed away. On the same day, five hundred and thirty one people were killed in Chang’an. In the following days, more than two thousand prisoners, old and young, men and women, were secretly executed in all prefectures of the Great Tang. These prisoners were not sentenced to death, but they were executed for one reason.</p><br/><p>The Drunkard killed the governor, which angered and frightened the Great Tang. Ning Que executed these prisoners to anger and frighten Taoism. Thus, it was</p><br/><p>revenge.</p><br/><p>As Ning Que had expected, the Divine Halls was caught in rage and fear while receiving the news. And after learning that the Great Tang was planning to secretly execute tens of thousands of prisoners of war, the Divine Hall could not remain silence any longer.</p><br/><p>Fortunately, it only took only one day for the Divine Halls to find the Drunkard on the Autumn Mountain outside the Linkang city and persuade him to wait with the help of Mr. First of the Academy.</p><br/><p>Ning Que did Taoism a favor to wait for another day before executing those prisoners of war. In the cold rain, the Divine Halls ordered thousands of</p><br/><p>people of the South Jin Kingdom to put up a building on the mountain outside the Linkang City within half a day.</p><br/><p>The autumn wind blew across the building, sometimes to the east, and sometimes to the west. Nobody knew whether the east wind would prevail over the west wind or the other way around, and nobody knew what would happen in the future.</p><br/><p>Standing inside the building, the Drunkard watched the autumn wind and waited for the information on how many people Ning Que killed and how Taoism planned on convincing him. But actually, he was trying to figure out his own mind.</p><br/><p>The Eldest Brother waited outside the building and held a wooden stick in his hand. Looking at the red, yellow, and green leaves all over the mountain, he made up his mind. If the Drunkard is not willing to wait, the wooden stick can be put to use.</p><br/><p>…</p><br/><p>…</p><br/><p>Ning Que closed the pale brown-oiled paper umbrella and flicked the raindrops off his clothes. He looked to the south and said, “I heard that it rains a lot in the autumn in the South Jin Kingdom. If I am in charge of the Divine Halls, then I will build a pavilion for the Drunkard. After all, we make such a powerful man sit around waiting.”</p><br/><p>Cheng Lixue untied his headscarf, and the snow-like silver hair hung down. He walked to the edge of the city wall and looked at Chang’an in the rain. After a moment of silence, he finally opened his mouth, “I said the day before yesterday, you can’t affect the Drunkard even though you can frighten Taoism. Whether Taoism could convince the Drunkard still remains a mystery. Why don’t you just stop the killing if you really want to make the Drunkard stop killing? You should know that you have killed so many people.”</p><br/><p>“I only need to be sure that what I did can frighten Taoism. As for how Taoism plans on convincing the Drunkard, that is Taoism’s own problem. I have faith in the Abbey Dean’s wisdom and ability.” Ning Que said, “I can spare most of the prisoners for now, but the dozens of prisoners from the Military Ministry must die. Otherwise, the Divine Halls would not take me seriously.”</p><br/><p>The eyes of Cheng Lixue dimmed, “The Great Tang paid a huge price for catching seven relatives of the Hierarch. Are you really going to kill them?”</p><br/><p>Ning Que answered, “Xiong Chumo doesn’t have any children, so he values his nephew very much. Of course I will keep his nephew alive to pin down him.”</p><br/><p>Cheng Lixue frowned and asked, “Why do you want to kill the He family?”</p><br/><p>Ning Que answered calmly, “For the Great Tang, there are some people who must die sooner or later, including He Mingchi and his family. In that case, why don’t I just take the opportunity to kill them now?”</p><br/><p>…</p></div>\n</div>"}