{"title": "Chapter 1034.1", "id": 1034, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-10341", "volume_title": "Volume 11", "body": "<h1>Chapter 1034.1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was dusk in the Divine Hall of Judgment. Ye Hongyu stared at Xiong Chumo, the Hierarch, while her right hand raised from the Seat of Heavenly Black Jade, as if it was a small boat setting sail from a port in the south. There came Ye Hongyu’s words. “Bring it on.”</p><br/><p>Her pretty face showed nothing but fearlessness. She had always been confident, resolute, and calm even if she was confronted with a desperate fight.</p><br/><p>The Hierarch, Zhao Nanhai, and the middle-aged priest stood in three different positions inside the hall. They stared at her silently. Being the most powerful team in Taoism, they should never have doubts in themselves. Even if confronting Yu Lian, they should have been confident enough to win. However, they were still on alert in front of Ye Hongyu.</p><br/><p>Because the person they were about to take fight against was the youngest Great Divine Priest of Judgment throughout the history of the Divine Halls of West-Hill. She was probably also the best at fighting on Peach Mountain throughout the last thousand years. Although she would not be able to defeat the three of them, she would not give up easily.</p><br/><p>When Ye Hongyu’s hand moved away from the seat, the hall was suddenly brightened up. It seemed she had picked up thousands of wisps of light and formed a bright net. It reflected the moon and starlight outside and created an ocean of starry light inside the Divine Hall, to the height of half a person.</p><br/><p>She stood silently amongst the starry light, as pure and charming as a virgin from the Divine Kingdom.</p><br/><p>Together with her movement the ocean of starry light flowed up and down. The reflection of the moon and starlight became brighter and brighter, and eventually formed into a dazzling shape. The dazzling shape had sharp edges. It was a sword.</p><br/><p>She got hold of a sword of light. The surface of the sword was smooth like a tranquil lake. When reflecting the blood-colored Gown of Judgment, it seemed as if there was a red fish swimming inside.</p><br/><p>It was not a real sword, but seemed more than real. It was her Taoist sword.</p><br/><p>From the cliffs outside the hall, a wind came all of a sudden. It swirled the snowflakes, disturbed the moon and starlight and poured them into the hall via the terrace. They came onto her sword and awoke the red fish inside.</p><br/><p>Then Ye Hongyu was awaken. But it was her clothes that were awakened first. The blood-colored Gown of Judgment shivered like a red morning flower soaked in dewdrops. While the red flower shivered, she darted to dozens of miles away and came to Zhao Nanhai. Her first strike was for Zhao Nanhai.</p><br/><p>It was probably because this great divine priest from the South Sea was comparatively the least powerful among the three. Zhao Nanhai was at the zenith of Knowing Destiny, yet he was the least powerful. It was despairing but true.</p><br/><p>Tonight in the Divine Hall of Judgment, it was a fight between the truly powerful ones.</p><br/><p>It was probably a losing battle for her, but she still wanted to try. Because she would never give up until the last minute. Like she told Ning Que years ago, if she had to fight, she would win.</p><br/><p>The blood flower floated in the ocean of starry light. Ye Hongyu wanted nothing else but to win. Her concentration was scary. Her charming face claimed her territory. The sacred crown on top of her black hair also claimed her world. She was the Great Divine Priest of Judgment. It was her territory. She was nothing but awe-inspiring.</p><br/><p>A mountain and a river crushed onto Zhao Nanhai from the dark sky. Powerful as Zhao Nanhai was, he could not help from feeling shocked. He wanted to step aside, but his feet were planted into the smooth floor in the Divine Hall as if he was an iron statue. It was because he was calm enough to know that he could not take a single step aside, not even thinking about it.</p><br/><p>The reason Ye Hongyu chose him was that she wanted to force him to step aside. The reason Zhao Nanhai could not step aside was that once he moved, he would provide Ye Hongyu with an escape.</p><br/><p>The most powerful ones from Taoism had come to kill Ye Hongyu tonight. They would never miss and let her escape. There was neither retreat nor escape for Ye Hongyu, or for themselves.</p><br/><p>Seeing the charming woman in the red gown pounding onto him together with her entire world, Zhao Nanhai became even more resolute. His Taoist robe was inflamed in the chilling wind.</p><br/><p>He was the current Great Divine Priest of the South Sea, who inherited the cultivation from the former Great Divine Priest of Light six hundred years ago. He cultivated on the most advanced Divine Skills of the West-Hill. He was inflamed with the purest Haotian’s Divine Flame right now.</p><br/><p>He set himself on fire, like a candle lightening the dark hall.</p><br/><p>Ye Hongyu came to him and into the world of light.</p><br/><p>She held the unreal sword formed of light, kept calm but did not stab.</p><br/><p>Her Gown of Judgment swayed and turned bright while she entered the world of light, as if she was a red bird throwing itself into the forest. But in the world of light, the forest of flame, danger was everywhere.</p><br/><p>The red bird might get burned, and the blood flower, would it bloom? Ye Hongyu seemed indifferent, because she was also burning.</p><br/><p>Endless Haotian’s Divine Flame spurted from her body, penetrated the blood-colored Gown of Judgment, broke through Zhao Nanhai’s Divine Flame and roared toward him.</p><br/><p>The forest was on fire, the red bird was also on fire. It stretched its wings in the dark night, spread miles of flame, and created sparks on the rock walls.</p><br/><p>The bloody petals turned into transparent flames, chilling and horrifying!</p><br/><p>Divine Skills of the West-Hill against Divine Skills of the West-Hill!</p><br/><p>Haotian’s Divine Flame against Haotian’s Divine Flame!</p><br/><p>She was the Great Divine Priest of Judgment, and the Tao Fanatic who mastered every Taoist skill!</p><br/><p>She had been practicing the Divine Skills of West-Hill ever since her childhood. How could she not be familiar with Haotian’s Divine Flame?</p><br/><p>But who was better in Divine Skills, she or Zhao Nanhai?</p><br/><p>They were both at the zenith of Knowing Destiny, both masters of Divine Skills. The former was young and aggressive, while the latter was senior and shrewd. If it was in a different occasion, none of them would be able to defeat the other in a short while.</p><br/><p>But it was different tonight. Zhao Nanhai came to kill instead of risking his own life, no matter how resolute he seemed to be. But Ye Hongyu was depleting her own soul and vitality, no matter how indifferent she looked.</p><br/><p>It was radiating and heated inside the Divine Hall of Judgment. The engraved tables and chairs were burnt into ashes instantly. Smoke even rose from the Seat of Heavenly Black Jade.</p><br/><p>The Hierarch got slightly stiff and took one step forward. The middle-aged priest kept his head low and no one knew what he was thinking about.</p><br/><p>In the heated ocean of Divine Flame, a shrill was heard. It was a clear and sharp shrill of a bird, the legendary bird.</p><br/><p>Xiong Chumo turned further solemn. The middle-aged priest still kept his head low, and seemed imposing in Haotoian’s Divine Flame.</p><br/><p>Sparks splashed and the flames separated. A path was formed in the ocean of flame and a flaming blood phoenix flew out of the ocean. It stretched the wings and set the entire hall on fire.</p><br/><p>There was actually no real flaming phoenix in the Divine Hall of Judgment. Instead there was only the purest Haotian’s Divine Flame. She flew above the Divine Flame like a superior and ruthless phoenix, and seemed extremely indifferent.</p><br/><p>The flame was slightly restrained and Zhao Nanhai appeared lying on the floor. He was pale. Blood was dripping from his lips and he was seriously wounded. He stared at the flaming phoenix with admiration and sympathy.</p><br/><p>No wonder she was the youngest Great Divine Priest of Judgment throughout the history of Taoism. She was indeed incredibly powerful. However, because she was powerful, she must die. The more powerful she was, the more Taoism wanted her dead.</p><br/><p>In their contest of Divine Skills, Zhao Nanhai was defeated and wounded. But Ye Hongyu did not get what she wanted either because Zhao Nanhai did not give out the way. She was still in the center.</p><br/><p>She did not defeat the weak Zhao Nanhai with her first strike. Therefore she had lost the battle. It was a pity. But she did not seem disappointed at all. Or perhaps Zhao Nanhai was never her real target.</p><br/><p>Haotian’s Divine Flames almost incinerated the rock walls, and also warmed her curvy figure. Perhaps it was merely a warm-up.</p><br/><p>With the help of the blazing flame, a phoenix shrilled in the hall. In the radiating light she came incredibly fast to Xiong Chumo. Perhaps that was her purpose.</p><br/><p>Deep down in her eyes there were stars formed and vanished. No one could see them clearly or figure out what she was thinking about.</p><br/><p>She held the sword in her right hand that was hidden in her blood-colored Gown of Judgment. No one could tell if she was feeling stiff.</p><br/><p>She was holding an unreal sword, which was her natal Taoist Sword. She never used the sword against Zhao Nanhai. But would she use the sword in the following strike?</p><br/><p>In the next moment, her sword was still in the sheath. Both the sword and sheath were unreal, yet real. After that the sheath disappeared and the sword was unveiled. She finally drew her sword!</p><br/><p>A bout of sharp sword intent was formed in the bright hall and pierced the air immediately. The sword intent that stood above the top of the Five States was about to tear up the air!</p><br/><p>She made a resolute and sudden turn in the air, unimaginably fast. The sword intent was extremely swift that even Liu Bai or Jun Mo could barely catch it in their full glory.</p><br/><p>If it was someone else, he would have easily been chopped into two pieces by the sword intent. But she was confronting the master of the Divine Halls of West-Hill. It could not be that easy.</p><br/><p>Xiong Chumo seemed solemn and his pupils constricted. He was already prepared when she flew out of the ocean of flame. When the sword intent come to him, his hands had already reached out to the dark sky.</p><br/><p>There was nothing but darkness, and there was no light at all. But the Divine Kingdom was right in there.</p><br/><p>When confronting someone extremely dangerous like Ye Hongyu, Xiong Chumo could never slack off. He had to give a full strike. It was a decisive strike.</p><br/><p>A bout of inhumanly pounding power came from the Divine Kingdom far away in the dark sky, traveled countless miles via clouds and mountains, and charged into his body.</p><br/><p>It was Tianqi. Ye Hongyu’s sword was already above the Five States, and it almost reached the sky. Whereas Xiong Chumo was not only above the Five States, but beyond the sky. Even if there was merely a small difference between their levels of cultivation, it was still insuperable.</p><br/><p>Xiong Chumo’s thin figure became incredibly powerful all of a sudden, like a god. Inside his body, countless bouts of energy were burning and roaring.</p><br/><p>He reached out his right palm and pounded onto Ye Hongyu. A small and ridiculous palm turned into a giant fan while it pierced through the air. The giant fan-like palm clutched the throat of the flaming phoenix. In the dazzling Divine Flame, the flaming phoenix shrilled.</p><br/><p>…</p></div>\n</div>"}