{"title": "Chapter 1031 - There Is Hope (I)", "id": 1031, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1031-there-is-hope-i", "volume_title": "Volume 11", "body": "<h1>Chapter 1031 - There Is Hope (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ning Que was an ordinary person, so why would he believe that his messages would work? It had nothing to do with psychology. His message to the Abbey Dean was coming from the knowledge he had learned from his past life, while his message to Ye Hongyu was related to his experience of this life. He thought his plan was flawless and would definitely work. His confidence was rooted in his understanding of the Abbey Dean and Ye Hongyu.</p><br/><p>He thought people like the Abbey Dean and Ye Hongyu would be convinced by his words and that at least one of them would be convinced.</p><br/><p>If the Abbey Dean was convinced, then the Academy could control the human world, which would be the best. If Ye Hongyu was convinced, then Taoism would be divined and the Academy naturally would win, which would also be great. But as for Ye Su…</p><br/><p>Ye Su would die, and Ye Hongyu probably would think Ning Que was a cold bastard after she found out. Or was it possible that she had already thought of this? But she had no choice but to pin her hope on the Academy.</p><br/><p>Standing on the edge of the city wall, Ning Que looked at the Yanming Lake in the distance and found that snow began to fall from the sky again. He felt that his hands were even colder and the Core Vajra of the Array in his arms was as cold as a piece of ice.</p><br/><p>On the day that Sangsang left the human world on that big ship and returned to the Divine Kingdom, he was sure that she would never come back and they would never see each other again. Then he began to change.</p><br/><p>During the massacre of the City of Wei, the general was killed, and she was gone too. Ever since then, he couldn’t maintain enough enthusiasm for the human world, the Divine Kingdom and even the whole world. He became colder and more realistic.</p><br/><p>He was not numb or deliberately cold due to pain and disappointment. He was just gradually changing back to the old Ning Que, since the one who made him into a better person was gone.</p><br/><p>The child who held a rust knife in the firewood house and fought the young master and the housekeeper, survived while living among the dead bodies and cannibals, survived the dangerous beasts and more dangerous hunters, and slew the mounted gangsters by the Shubi Lake.</p><br/><p>That child was the real Ning Que. He knew nothing about good, evil, or morality, and didn’t care about others. In his eyes, people were just tools to get what he wanted.</p><br/><p>Senior Sister told him the secret before leaving. He sympathized with her painful past, but did not hesitate to take advantage of this matter.</p><br/><p>But Ye Hongyu was still special to him, so he told Chenqi to reveal the secret only if there were no other options. Besides, he was very careful with his words, guaranteeing that others would not find out the secret. He felt no shame since Ye Hongyu’s reputation was undamaged.</p><br/><p>He did not care whether Ye Su, the founder of the New Stream, could survive or not, for it was Taoism’s own business. If Ye Su were to survive and help spread the New Stream, the Academy had nothing to lose. And if Ye Su were to die, he would definitely become a legendary saint, which would benefit the Academy more.</p><br/><p>In a sense, Ning Que was a disciple of the Headmaster, learning from the Academy and Ke Haoran. But in essence, he was the descendant of Lian Sheng.</p><br/><p>Since Jun Mo was in the distant Wilderness and the Eldest Brother was keeping watch on the Drunkard, Ning Que and Yu Lian, the two who had already gone mad, were actually leading the Academy.</p><br/><p>And Lian Sheng pinned his hopes on Yu Lian even before she became the master of Devil’s Doctrine.</p><br/><p>It seemed that the Academy was doing what Lian Sheng would want rather than the Headmaster at this point. Would Lian Sheng be gratified or even ravished with joy if he could know what happened after death?</p><br/><p>But there were still some differences. The biggest difference was that Ning Que didn’t completely lose his mind. He was calculating everything calmly and ruthlessly. He was forcing Taoism to respond by sending Chu Youxian and Chen Qi to Peach Mountain to reveal that secret.</p><br/><p>He was well aware that, as long as the Abbey Dean was not out of his mind, Ye Su would not die, Ye Hongyu would never betray Taoism and Taoism had no choice but to maintain the status quo.</p><br/><p>The ending might seem to be a ruthless mockery of his calculations, but no one knew that it was what the Academy wanted all along, for he desperately needed more time.</p><br/><p>Ning Que put his hand on the snow wall and looked at the dark sky, wishing to see the bright moon. It is hard for the Headmaster to win the battle, but I have to buy more time for the Academy.</p><br/><p>At this point, only powerful people like the Abbey Dean and the Drunkard could notice the subtle change in the Divine Kingdom. Ning Que was clearly not capable of doing so. However, with the aid of the Grand Array in Chang’an, he knew that the moon was slowly darkening, which made him sad.</p><br/><p>The Headmaster gradually fell into a weak position in the war against Haotian. It seemed that time was on the side of Taoism. All he did was trying to buy more time.</p><br/><p>Only when he had enough time could he overcome the difficulty that happened in Xiangwan Plain, hear the good news from the depths of the West Wilderness, and see the unbridgeable crack in Taoism becoming wider and wider. What mattered the most was that Haotian would be weaker and weaker as more and more people believed in the New Stream.</p><br/><p>Benefiting from the Headmaster, Youngest Uncle, Lian Sheng and Master Qishan, Ning Que had been cultivating Buddhism in Nirvana for thousands of years and then was on the run with Sangsang for thousands of miles. He had cultivated Taoism, Buddhism, and the Devil’s Doctrine, so he had already seen through faith. Haotian was no longer unreachable in his eyes.</p><br/><p>Countless years ago, Taoism chose Haotian as the mighty god for human beings. But Haotian weakened as the New Stream appeared and Taoism was on the wane. The inference was simple but correct.</p><br/><p>Therefore, for the Academy and the Great Tang, the New Stream was important, and so was Ye Su.</p><br/><p>The New Stream needed more time to spread to farther places and win more followers. Ye Su must become the saint worshiped by all followers as God, whether he was alive or dead.</p><br/><p>To this end, Ning Que killed thousands of people and endorsed Ye Su and the New Stream. But he deliberately made no comments on Taoism’s way of dealing with Ye Su.</p><br/><p>He went silent for a long time while looking at the dark sky and the falling snow in the distance. He felt confident that he could grasp what the Abbey Dean was thinking, for the moon was darkening.</p><br/><p>Both Taoism and the Academy believed that time was on their side.</p><br/><p>It remained unknown whether the Academy working with the New Stream in the human world could weaken Haotian first or Haotian could defeat the Headmaster first. Ning Que anchored his hope on the former. If the Abbey Dean were to refuse his proposal, then he was betting on the latter.</p><br/><p>Ning Que was confident about his choice, because Taoism chose Haotian for human beings many years ago and completely pinned their hopes on Haotian. But the Academy and he pinned their hopes on the Great Tang which unified the mainland and on Ye Su and the New Stream, which meant they pinned all hope on the human world.</p><br/><p>There is hope.</p><br/><p>There should be hope in the human world.</p><br/><p>He thought so while looking at the sky.</p><br/><p>…</p><br/><p>…</p><br/><p>In the autumn, a small building appeared on the mountain outside the Linkang City.</p><br/><p>After entering into the wintertime, snow began to fall and many people came to the mountain. Thousands of devout followers of Haotian kneeled in front of the hillside and were kowtowing towards the direction of the small building. But no one dared to cross the defense line set by the cavalrymen of the Divine Halls.</p><br/><p>With the new emperor gone and the Sword Garret relocated, the people of South Jin Kingdom had been through too much. Since the war with the powerful neighboring country in the north might be triggered at any moment, the people were all nervous and anxious. That was why they came to the small building which was said to be the home of immortals to pray for blessings.</p><br/><p>The two in the building were not aware of this, and they would not care even if they did know. It was not an exaggeration to call them immortals given their status in the human world.</p><br/><p>The Drunkard was drinking while leaning against the railing. With his sleeves sweeping through the railing, the snow accumulated on the railing was dyed on the sleeves and mixed with the wine stain left on the sleeves these days, giving off a singular cold smell.</p><br/><p>Standing on the cliff yard outside the building, the Eldest Brother kept silent while looking at the east.</p><br/><p>A few days ago, the secret guards of the Great Tang sent some bad news. The situation in Song Kingdom was boiling up, and Taoism had already sent their people there.</p><br/><p>Eldest Brother wanted to go there for he worried about Ye Su, but he couldn’t go because the Drunkard was still here. The Drunkard was supposed to be there but stayed at the small building because of the Eldest Brother.</p><br/><p>Never traveling alone was the most important agreement between Eldest Brother and the Drunkard, and also the one rule that the Academy and Taoism must obey. No one dared to break the agreement, or the war would break out.</p><br/><p>If he and the Drunkard had never went back to the human world, then there might still have been hope.</p></div>\n</div>"}