{"title": "Chapter 1047 - Down The abyss, By The Lagoon", "id": 1047, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1047-down-the-abyss-by-the-lagoon", "volume_title": "Volume 11", "body": "<h1>Chapter 1047 - Down The abyss, By The Lagoon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“That explains why. But what does that mean?” Although he had not found an exact answer, Ning Que did get one step closer to the truth, to what the Abbey Dean was thinking about. It might be a very small step, but indeed helpful.</p><br/><p>If they had tried to contemplate with a normal mindset, neither he nor Yu Lian could have reached such a conclusion. Or more precisely, no one would have dared to conclude like that.</p><br/><p>If Taoism wanted to weaken, or even ruin Haotian, then it was not just a betrayal. It would be a fundamental overturn of faith, which was neither logical nor reasonable.</p><br/><p>Mistress Jian did not know what the Abbey Dean was thinking about. But she understood Ning Que’s suffering and bewilderment. Therefore she tried to guide him with these unreasonable words. She was trying to apply Ke Haoran’s sword, the most direct way of solving problems.</p><br/><p>People always said that the scenery along the way were more important than the destination. But in most cases those words were merely self-consolation for those who did not have the guts to carry on.</p><br/><p>When one looked back from the destination, one would find the scenery along the way more charming and clear. That rule applied to life as well as contemplation.</p><br/><p>Ning Que looked back at woman’s figure fading away on the mountain trail between the cliffs. He was certain that if she ever practiced cultivation she would definitely have reached the zenith. But she was never interested.</p><br/><p>He was very grateful for her guidance, just as he was to what she did for him many years ago.</p><br/><p>Ever since he came to Chang’an from Wei, she had been taking good care of him. She taught him a good lesson upon his first visit to the House of Red Sleeves because he reminded her of the young man on a small black donkey years ago.</p><br/><p>Recalling their first encounter and the foolish things he did in the House of Red Sleeves, Ning Que was filled with emotions. It was because of her that no brothels throughout the country ever welcomed him. He used to have a lot of unspoken complaints, but now he felt nothing but gratefulness. He sighed over his former absurdity and laughed in self-mockery.</p><br/><p>…</p><br/><p>…</p><br/><p>The Abbey Dean wanted to weaken Haotian.</p><br/><p>Ning Que was certain about that. As for why, he could only make a wild guess. There might be a flash of an answer, but he was not able to grasp or believe it.</p><br/><p>Even if the were to sun die out, life would continue.</p><br/><p>If he could not figure out what the Abbey Dean was planning, then he would never be able to change the situation. The war between Tang and the entire world was launched again. Chang’an was enveloped in chillness and solemnity. Counties and prefectures constantly delivered supplies to the boarders. The Military Ministry ran twenty-four hours a day and dispatched orders to the troops throughout the country.</p><br/><p>The world outside Tang was also in chaos. The death of Ye Su was a downthrow for the New Stream. But according to the report of secret guards, there was not a dramatic downsize of followers. It was believed that in a short while when they recovered from the grief the New Stream would gain an even quicker burst.</p><br/><p>Whenever a war was launched, they had to win. It had always been Ning Que and the Tang’s philosophy. However it was more difficult than ever to succeed this time.</p><br/><p>The best selected Yulin Royal Guards were sent to the Verdant Canyon and ready to go further south to the Qinghe Prefecture. It seemed Chang’an was not worrying about the defense because Ning Que was there. But actually it suggested that Tang was under so much pressure that even the Yulin Royal Guards had to be sent to the battlefields.</p><br/><p>Ning Que stood on top of the city wall. He watched the falling of snow and the marching troops of Tang. It came to him that it was also someone else’s philosophy that she must win in every war.</p><br/><p>Is Ye Hongyu really dead?</p><br/><p>As for the Abbey Dean’s style and capability, if he wanted to kill Ye Su he was definitely to take Ye Hongyu’s life too. He would never spare her any chance of survival. And according to what he had sensed that night, she indeed had no chance.</p><br/><p>There was the middle-aged priest, the Hierarch Xiong Chumo, and Zhao Nanhai from the South Sea.</p><br/><p>When confronted with such enemies, even Ning Que might not be able to survive, not to mention her. But somehow he felt that Ye Hongyu was still alive. Because a woman like her should never have died a quiet death. He simply had some unreasonable confidence in her.</p><br/><p>…</p><br/><p>…</p><br/><p>In the Divine Halls of West-Hill, there was nothing but silence. Countless divine priests and deacons were on their knees by the stairs. They looked extremely pale and sacred. Because thunders were roaring on top of the stairs.</p><br/><p>The radiating light screen was shivering in the thunder, as if it would collapse any time. The lofty figure behind the screen was also shivering, probably because of anger or even fear.</p><br/><p>Ye Hongyu jumped into the abyss. The Hierarch and Zhao Nanhai were certain that she would be dead. But they still sent many people down the abyss to locate her body. It was extremely dangerous to go down the abyss among the cliffs. The person in charge was a powerful Knowing Destiny figure from the South Sea. He led many other powerful men from Taosim and searched for over ten days down there. Even powerful as they were, only one fifth of them were able to come back to Peach Mountain. But most importantly, they were not able to bring back the body the Hierarch had asked for. Instead, they could only bring back very bad news.</p><br/><p>The Hierarch was furious. And his voice thundered throughout the Divine Hall. People by the stairs were scared and restless. They did not dare to say anything or know what punishment they were facing.</p><br/><p>After a long while, the Hierarch calmed down and his voice became normal. Only his closest subordinates could tell that he was still anxious.</p><br/><p>“Find her, and kill her, whatever it takes.”</p><br/><p>…</p><br/><p>…</p><br/><p>The Divine Halls of West-Hill could not locate Ye Hongyu’s body down the abyss. But they did see a few wheel tracks and human footsteps. It was shocking.</p><br/><p>It could only mean that Ye Hongyu was still alive. She jumped down the abyss and fell into the clouds. Everyone thought she was definitely dead. Yet she survived. She did something that only Haotian was able to do.</p><br/><p>But how?</p><br/><p>It had to be explained from the beginning since half a year ago. When a letter was sent out via a secret channel from the Divine Hall of Judgment and delivered to a person elsewhere. It was an invitation.</p><br/><p>To make a long story short, it actually started the night when the Hierarch Xiong Chumo, the middle-aged priest and Zhao Nanhai sieged Ye Hongyu.</p><br/><p>The day before, Chu Yoxian and Chen Qi made an impassioned speech in the Divine Hall. They sent an invitation to Ye Hongyu on behalf of Ning Que and conveyed the contempt to the Divine Halls of West-Hill from the Academy and Tang.</p><br/><p>Because of Ye Su, also because of her assumption of the Abbey Dean’s plan, Ye Hongyu did not accept Ning Que’s abrupt invitation. But instead of killing them, she sent them to the Secluded Pavilion.</p><br/><p>The Secluded Pavilion was the place where the Divine Halls of West-Hill kept all the traitors and captives from the Devil’s Doctrine. It was intensively guarded and enveloped in countless killing arrays. Throughout the years, no one except for the former Wei Guangming had ever left this prison alive. Even Ning Que was not able to get Chen Pipi out when he was imprisoned here.</p><br/><p>Chu Youxian and Chen Qi was sent to the darkest and narrowest cell behind the iron fence in the Secluded Pavilion by black-robed deacons from the Divine Hall of Judgment. They were not hoping that they could ever get out of Peach Mountain again. They knew they were either facing death sentence or lifetime imprisonment. Either way it was desperate.</p><br/><p>Fortunately no one came for an inquest from dawn to dark. They were exempted from the renowned brutal tortures in the Divine Hall of Judgment.</p><br/><p>They figure it out pretty quickly. They were exempted from the tortures that would have made them commit suicide only because of Ye Hongyu.</p><br/><p>Either today or tomorrow, she would probably execute Chu Youxian and Chenqi ruthlessly. But she would not torture them. That was the best generosity she could spare them.</p><br/><p>She did not accept Ning Que’s invitation. But it seemed she did not want to irritate him either.</p><br/><p>Chu Youxian and Chen Qi sat in the cell and looked at the rock walls silently. There was nothing else except for a bucket of fresh water. No one ever delivered any food.</p><br/><p>There was no torture, horrible punishment, or any attention. A long wait was also a kind of cruelty. Not knowing when they would be killed was making Chu Youxian even more anxious and restless. Colors were drained further from his face.</p><br/><p>Compared to him, Chen Qi thought more. Since no one ever came to them, he wondered if Ye Hongyu was waiting form them to commit suicide by knocking their heads against the wall. Extreme quietness always made people think wildly, especially for someone like him who was good at plotting. The more he thought about it the more certain he became.</p><br/><p>Ye Hongyu’s generosity and mercy was simply to give them a chance to commit suicide.</p><br/><p>He told this to Chu Youxian and made him even paler. Immediately upon hearing this, Chu Youxian asked what they should do: to kill themselves right away or wait for another day?</p><br/><p>But Chen Qi did not hear his question because when Chu Youxian said so, they heard a horrifying bang outside their cell and completely covered Chu Youxian’s most courageous question of his life.</p><br/><p>Together with that horrible bang came a quake. Even the cell deep inside the mountain was severely shaking. Water splashed out of the bucket.</p><br/><p>Chu Youxian hold against the wall and could barely stood steadily. He felt dizzy.</p><br/><p>Is this an earthquake? Chen Qi got worried and walked immediately to the rock window. Looking outside toward the cliffs, he could see nothing but a bright moon hanging in the sky.</p><br/><p>He was pretty sure that the horrible bang came from outside the cliff, while the quake came from somewhere high up on Peach Mountain. Something must have happened up there.</p><br/><p>Immediately after that, a series of huge bangs were heard on top of Peach Mountain. The quake spread to the cell and splashed more water. The floor was wet and water came to Chu Youxian.</p><br/><p>Chu Youxian took two steps backward. He turned pale and asked Chen Qi, “What’s going on?”</p><br/><p>Chen Qi shook his head, “No idea.”</p><br/><p>Since they were being imprisoned, no one would tell them that several most powerful cultivators of Taoism were conducting a vital fight inside the black Divine Hall of Judgment on top of Peach Mountain.</p><br/><p>The horrible bangs and quakes were generated by the fight. Then they heard some footsteps. Chu Youxian and Chen Qi turned and saw a black-robed deacon coming to the fence. He took out the key, opened the fence and beckoned them to follow.</p><br/><p>The black-robed deacon was around forty years old. He was extremely pale, not because of sickness or fear, but lack of exposure to sunlight throughout the years. While he took out the key, opened the fence and beckoned them to come out, the black-robed deacon showed no expression at all. He was very calm.</p><br/><p>Chu Youxian and Chen Qi looked into each others’ eyes and found doubts and concerns. It happened suddenly. They had no idea whether it was good or bad to be taken out of the cell. Were they going to be sentenced or not?</p><br/><p>Coming out of the cell, they walked through a very long tunnel. The tunnel was built with rocks. It was slightly higher than a regular person at the width of two persons. The tunnel turned from a storeroom behind the Secluded Pavilion and headed down Peach Mountain. Dim light cast clear shadows of the two of them and the black-robed deacon on the dry floor. Their footsteps were heard distinctly.</p><br/><p>No one blocked their way. The black-robed deacon walked ahead emotionlessly. He seemed to be certain that because everyone else in the Secluded Pavilion was in deep sleep now. No one would hear their footsteps no matter how distinctive they were.</p><br/><p>The tunnel was fairly long. Chu Youxian and Chen Qi spent four hours walking through it until they were almost exhausted. Yet the exit was still nowhere to be seen. Chen Qi found that the walls along the tunnel were lightly dusted with some trace of wind wiped by. The oil in the lamp was newly added.</p><br/><p>Based on the trace of wind, the inclination of the tunnel and the distance they had walked, Chen Qi concluded that they were about to reach the foot of the mountain, which made him a bit relieved. Yet knowing that the tunnel was coming to an end, he could not help from becoming nervous again. It was because all the things he noticed were suggesting that no one had ever walked through this tunnel for at least decades.</p><br/><p>Inside the Secluded Pavilion of the Divine Halls of West-Hill, there was such a secret escape. Who built it? And where was the black-robed deacon taking the two of them to?</p><br/><p>Chen Qi seemed to have figured the reason but found even more confused. Being the Great Divine Priest of Judgment, Ye Hongyu should definitely be aware this biggest secret in the Secluded Pavilion which even the Hierarch did not know. And it was only her who could have silenced the entire Secluded Pavilion. But why did she secretly free him and Chu Youxian from the prison?</p><br/><p>They finally reached the end of the tunnel. The black-robed deacon pushed on a black brick and deactivated the array. He pulled out his Taoist sword and carefully pushed aside the poisonous bush in front of them, then led Chu Youxian and Chen Qi out.</p><br/><p>Freedom awaited outside the tunnel. Countless stars shone in the sky. The star light was filtered by the clouds among the cliffs, integrated with the foul fog down the abyss, and eventually turned into some weird purple light.</p><br/><p>Chen Qi and Chu Youxian stared at the weirdly purple star light and enjoyed the same amount of excitement and confusion. They were stunned.</p><br/><p>The black-robed deacon did not spare them a chance to ask questions. He turned his palm and placed two pills into their mouth. Before Chu Youxian could react, he had already swallowed the pill and it melted in his stomach. He was scared and enraged. He assumed it was some poison as he felt burning pain and disgust in the belly.</p><br/><p>You should have killed me in the cell. What’s the point taking me all the way here and poison me outside the Secluded Pavilion? Don’t you know it’s torture to give people hope that ends in despair? Are people from the Divine Hall of Judgment all insane? Don’t you know my feet were bleeding after such a long walk?</p><br/><p>Chu Youxian fell onto the ground out of fear. He felt like losing his mind when thinking of these nonsense and could only wait helplessly for his last moment. But after a while he realized that instead of falling into a coma, he was becoming more sober…</p><br/><p>What happened? He stood up in frustration, shook his head and took quite a while to get completely sober. When he saw the foul fog under the starlight and recalled what they had heard in Chang’an, he realized the pill was an antidote rather than poison, which made him feel embarrassed.</p><br/><p>He wiped off the sweat on his forehead, shook off some rotted leaves and trotted toward the black-robed Deacon and Chen Qi. When he was about to proceed he realized that the other two had stopped.</p><br/><p>There were mostly vines at the bottom of the abyss instead broad-leaf trees. They should have a more open view here than in a real forest. But actually the view was very limited. The starlight was mostly covered by the clouds among the cliffs hence became purple. While they stood there for a while the foul fog thickened, and the entire place became even darker.</p><br/><p>Chu Youxian noticed that they were standing on a thick layer of rotten leaves. He looked at the vague shadows of the surrounding vines and felt chilled when thinking of the horrible abyss behind the Secluded Pavilion people used to talk about.</p><br/><p>The foul fog in the abyss carried naturally gathered poisonous elements. They mingled with the vicious psyches left by the countless dead prisoners in the Secluded Pavilion and added to the horror. They were standing right in the middle of the fog.</p><br/><p>Now Chu Youxian knew that if it was not because of the antidote he was given previously, he would have been poisoned to death. Even though he was still alive, he could not help from being scared. He sweated further upon the miserable whistling of some animals behind the climbing vines.</p><br/><p>There were the foul fog and vicious animals that had lived in the poisonous environment for countless years. It was said that no one could make it out of the abyss. Would they be exceptions? If no, were they doomed? Chu Youxian could not help being worried. He looked at Chen Qi and the black-robed deacon, and wondered why they were not going further.</p><br/><p>Wind roared down from the cliffs and thinned the foul fog. Starlight shed again and Chu Youxian saw a lagoon nearby. There were some indistinct shadows on the other side of the lagoon, which seemed to be a few carriages.</p><br/><p>How could there be some carriages in such a secluded and dangerous place? Whose carriages are those? Who are there? Are they waiting for us? Then why are we not going there?</p><br/><p>Chu Youxian barely escaped death tonight and ended up in a deadly abyss. He was a bit mentally disturbed and could not think straight right now.</p><br/><p>Chen Qi, as the think tank of the Fish-Dragon Gang, was renowned for his ruthlessness and definitely had a clearer mind. He took a few glances at the carriages then looked above to the dark sky as the black-robed deacon did.</p><br/><p>They were expecting something to fall from the sky above.</p><br/><p>Chen Qi seemed to have figured out why. The Academy’s plan might have worked. Ye Hongyu was indeed defecting Taoism. But why did she choose to leave at midnight via such a dangerous route?</p><br/><p>He was confused. Was Ye Hongyu really going to jump down from atop the Peach Mountain, pierce through the clouds, and fall onto the bottom of the abyss, as the black-robed deacon hinted?</p><br/><p>The distance from the top of Peach Mountain to the bottom of the abyss was almost like from Heaven to Earth. There were numerous dangers among the cliffs and equally dangerous foul fog down at the bottom. Whoever jumped down could never survive.</p><br/><p>Sangsang did not die because she was Haotian. Ning Que survived because he jumped down together with Sangsang who held him in the arms when they reached the bottom.</p><br/><p>There was no one to catch Ye Hongyu. Sangsang had returned to the Divine Kingdom. Then how could she survive?</p><br/><p>She was doomed. Chen Qi thought desperately. That was also what the Hierarch Xiong Chumo, the middle-aged priest, Zhao Nanhai, and even the Abbey Dean assumed.</p><br/><p>There were two massive arrays among the cliffs behind Peach Mountain, as well as many forbidden areas since ancient times. They were the collective wisdom of Taoism throughout the ages. They did not belong to the Divine Hall of Judgment but ran autonomously as living beings, and was empowered by the nature.</p><br/><p>Apart from the fall from top to bottom, the most dangerous thing in this so-called escape route was the foul fog, which represented the collective wisdom of Taoism. Even if Master Yan Se were revived, he would never be able to deactivate the arrays within a short period of time. Who could ever make it within the few seconds of falling?</p><br/><p>However, something did punctuate the air among the cliffs. And someone did jump down from the peak!</p><br/><p>Chen Qi became extremely nervous. He was not like Ning Que who had blind confidence in Ye Hongyu. He was worried that he would witness Ye Hongyu’s death in a few seconds.</p><br/><p>Indeed, as he reasoned, no matter how powerful Ye Hongyu was, or even if she had mastered Yan Se’s talisman skills instantly, she would never survive it.</p><br/><p>But she did jump down.</p><br/><p>She was severely wounded by the three most powerful figures in Taoism. Then she came to the balcony. Instead of looking afar, she walked calmly to the edge under the starlight and jumped into the abyss together with the falling snow flakes.</p><br/><p>No matter what, she was doomed.</p><br/><p>But right then a very complicated array intent was formed from the foul fog down the abyss. Two more array intents were formed on the cliffs and joined together in the purple starlight.</p><br/><p>Chu Youxian and Chen Qi could not understand why they felt like smelling something immediately as they sensed the array intent. Perhaps they arrays did have some scent?</p><br/><p>It was a smell of iron, rust, sweet, bitter and somewhat pungent. Then it turned into a smell of rocks, or more precisely the smell of the moss on rocks, moist and greenish, but not creamy. It seemed like dried moss.</p><br/><p>What did the smell of iron stand for? Firmness? What about the rocks and moss? Chu Youxian and Chen Qi were shocked and anxious, and found it hard to breathe normally. The reason for their difficulty in breathing was because they felt as if their chests were being filled up with rocks. Those rocks were sharp and digging into their flesh.</p><br/><p>Which array was that? They were shocked. Turning back and looking to the origin of the array intents, the carriage on the other side of the lagoon, they wondered who was sitting inside and how could that person be so powerful.</p></div>\n</div>"}