{"title": "Chapter 1055 - Tricks Of The Headmaster And His Disciple, Backed By Chang’an", "id": 1055, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1055-tricks-of-the-headmaster-and-his-disciple-backed-by-chang%E2%80%99an", "volume_title": "Volume 11", "body": "<h1>Chapter 1055 - Tricks Of The Headmaster And His Disciple, Backed By Chang’an</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>One day, a year ago, a spring rain showered the human world. Numerous people saw the giant ark sailed in Divine Flame toward the golden line. She stood at the bow and her green dress swayed in the spring breeze. Flowers bloomed on her dress.</p><br/><p>Everyone assumed that she had already left the human world and returned to the Divine Kingdom. But actually she did not. Instead she hid in the north, in the extreme coldness. She did not make it to the Divine Kingdom. Upon opening her eyes and seeing the lush mountains, she realized that she did not make it. Because there should be nothing but light in the Divine Kingdom. This was Min Mountain.</p><br/><p>She did not understand why. She made use of the Buddha’s chessboard and stayed in it with Ning Que for a thousand years. They experienced the vicissitudes of life and practiced Buddhism for so long. She was eventually able to get rid of the three poisons of attachment, aversion, and obsession, as well as the human energy inside her. But why did she fail to return to the Divine Kingdom?</p><br/><p>She stood on Min Mountain and pondered for many days and nights. In the end she realized why — she was the choice of human beings. Therefore her destination was the human world. It might not be the ultimate answer, but it was her only conclusion for the time being.</p><br/><p>Having realized this, instead of returning to the Divine Halls of West-Hill, she chose to walk toward the north along the familiar hunting trails on Min Mountain.</p><br/><p>She kept walking and passed through countless hunting villages, the Helan Mountain, the Tianqi Mountain, the Icefields and eventually came to the peak in the extremely cold North Wilderness.</p><br/><p>Her green dress got thinner through the journey, and the blossoms on the dress withered. She knew exactly what was happening. It was the power of time and she was becoming weak.</p><br/><p>She chose to go to the extremely cold north instead of returning to the Divine Halls of West-Hill because she sensed danger and wanted to go somewhere safe. More importantly, she did not want anyone to see her right now.</p><br/><p>She was becoming bigger and bloated. She was not plump. She seemed more like a pregnant woman. Yes, she was pregnant. Therefore she did not want to be seen by any human beings.</p><br/><p>She was pregnant, with Ning Que’s child.</p><br/><p>Perhaps she was weakening because of the pregnancy. She was becoming a weak and insignificant human being that she used to look down upon.</p><br/><p>A divine figure came to the human world, and was gradually humanized… She had such experiences previously. The Headmaster once charged human energy into her body and took her on a tour to see the charms of the human world. Later on, she was led by Ning Que throughout the human world to taste human emotions. She was humanized throughout those days.</p><br/><p>Inside the chessboard, she made use of the Buddha’s plan and Ning Que’s affections to practice and purify her divine figure, and eventually discharged the human energy. She thought that she would win in the battle against the Headmaster, that she would eventually became indifferent again and return to the Divine Kingdom. However, she was again forced to stay here unexpectedly. She could no longer return to the Divine Kingdom. It was Ning Que’s trick — the infant in her matrix!</p><br/><p>She stroked her lower abdomen. There was no motherly love or any other emotions on her face. She felt calm, but somewhat uneasy.</p><br/><p>She looked at the snow capped mountain far away outside the window and pulled herself out of the memories. When she looked toward the snow covered Thermal Sea not far away, she recalled something else.</p><br/><p>It was right here in the snow covered chilling world many years ago, where the Headmaster treated her with peony fish, indulged her in a hot spring and hosted a wedding for her and Ning Que. They celebrated their wedding night while the Headmaster went for a ride on the big black horse, wore nothing and bolted for hundreds of miles in the snow.</p><br/><p>The Headmaster was extremely delightful. Perhaps it was because he already predicted her future, and knew that she would probably be pregnant with Ning Que’s child and would never return to the Divine Kingdom.</p><br/><p>The Headmaster used to say that it was a historical moment for her and Ning Que to celebrate a wedding night. Indeed, now she knew why.</p><br/><p>Sangsang turned away from the Thermal Sea and lowered her head. Being forced to stay in the human world twice by the Headmaster and his disciple stunned her.</p><br/><p>The Headmaster and his disciple always had their unexpected tricks, shameless, life-giving, silent, yet … earthshaking.</p><br/><p>The roaring snow storm suddenly ceased. And the clouds were wiped away by the wind that came from the black sea on the other side of the snow-capped mountains. The stars shone, and the bright moon came out.</p><br/><p>Sangsang looked above to the bright moon. Her right hand moved away from her lower abdomen and reached out to the dark sky. She pressed her thumb and index finger against each other.</p><br/><p>She tried to crush the bright moon, out of unwillingness to reconcile.</p><br/><p>But she could only use her imagination now. That was something only her counterpart in the Divine Kingdom could fulfill. As for her now, she was even afraid to be found by her counterpart in the Divine Kingdom.</p><br/><p>Sensing the vague restlessness deep down her psyche, Sangsang became pale and felt cold.</p><br/><p>She picked up a piece of fur from the bed and covered herself tightly, especially around her lower abdomen. And she flipped to light the firewood in the fireplace.</p><br/><p>She tried to warm herself up, which had nothing to do with the child inside her.</p><br/><p>In fact, although she was weakening she still did not need the warmth. Coldness had no influence on her. But she lit the fireplace anyway. She was no longer acting indifferently on the rules like she used to be. It had nothing to do with the fundamental rules of the world. Instead she acted on her instinct, which was exactly a human thing.</p><br/><p>There was an oil lamp by the window. She did not need the lamp or the light. It was not helpful at all to light a lamp in the darkness, except for exposing herself to dangers. But she did so despite the dangers. Because the light was indeed very warm.</p><br/><p>Perhaps because she used fish oil in the lamp, it generated no smoke or irritation for her eyes. Instead, it smelled nice with the burned fat.</p><br/><p>Sangsang suddenly felt hungry. She looked toward outside the window and asked indifferently, “What took you so long?”</p><br/><p>The Wild People had migrated to the south. No one was left throughout tens of thousands of miles in the snow kingdom. Who was she talking to?</p><br/><p>Heavy pants were heard from outside the cottage. An indigo dog held a frozen peony fish in his mouth and delivered it to her in a flattering manner.</p><br/><p>Perhaps due to the frozen of the Thermal Sea, there were very few peony fish left. The only few alive had been hiding at the bottom of the sea. How could an indigo dog catch a fish down there? It was indeed incredible.</p><br/><p>However, it would be much less incredible if one knew that the indigo dog was the awesome indigo lion inside the Buddha’s chessboard.</p><br/><p>Sangsang took the peony fish, came to the chopping board, and chopped it with bare hands. Despite the dog’s flattering, she made her own sauce and started eating by herself. She seemed indifferent at all until she finished the whole fish. She frowned slightly as she found the fish less tasty than it used to be.</p><br/><p>It had nothing to do with the fish or the sauce. She chopped it with her hand but did it much better than the Eldest Brother and Ning Que. Then why was it less tasty? Was it because it was not well-cooked?</p><br/><p>Upon finishing the fish, she felt even more hungry. She turned to the indigo dog and asked, “I want meat.”</p><br/><p>The indigo dog kept his eyes wide open and seemed extremely innocent while Sangsang squinted her eyes and seemed extremely indifferent. The indigo dog lowered his head and returned to the snow world with its tail between the legs.</p><br/><p>Sangsang did want some meat. Although she did not need food, she no longer felt disgusting upon human food. Most importantly, the one inside her was hungry.</p><br/><p>When she first realized there was a child in her matrix, she was startled and even felt angry and resentful. It was only until recently that she started to get used to the little existence inside her.</p><br/><p>She did not think that she had affection for the child because it was Ning Que’s trick. She was merely hungry and wanted some meat to warm herself up.</p><br/><p>Indeed, that must be the reason, she told herself.</p><br/><p>After a long while the indigo dog came back with a freshly killed snow fox. Sangsang was very satisfied. She cooked it and spared a rear leg for the dog.</p><br/><p>She started eating the roast meat. It was nothing compared with the lamb feast the Headmaster treated her to on the grassland many years ago. But she found it tasteful.</p><br/><p>She could no longer travel a thousand miles in a single step to enjoy a feast in the Song and come back right after to her place to have a peony fish as a night snack. She was more and more like an ordinary human being.</p><br/><p>However she found it not too bad.</p><br/><p>…</p><br/><p>…</p><br/><p>Apart from the hidden her by the snow sea, the other most important matter for the human world was the battle between the Tang and the Golden Tribe Royal Court.</p><br/><p>The Golden Tribe had migrated to the south and threw the entire tribe into battle. As for the Tang, they could only send the Northern Battlefront Army because of the pressure from Taoism, and seemed to be outnumbered ever since the beginning.</p><br/><p>The Golden Tribe Royal Court had the strongest cavalrymen on the grassland and proceeded like wildfire. The Tang army was good at both attack and defense. Xu Chi, the General of Northern Battlefront was particularly well known for defense. He had been defending the north of Tang extremely tightly for decades. If it was in the past he would never worry at all.</p><br/><p>But that was long ago. Ever since the Golden Tribe Royal Court raided the south a few years ago and took over seven cities including Wei and Kaiping, the Tang’s north battlefront was no longer unbeatable. The Tang used to spend heavily in building dozens of barracks along the west and north of Xiangwan Plain. However they had all been taken by the Golden Tribe Royal Court one after another, which further weakened Tang’s north line of defense.</p><br/><p>For the Tang army, the worst thing was the lack of war horses. The formerly well-known cavalry of the Northern Battlefront Army was barely a unit now and had to be merged with the infantry. They fought arduously against the cavalrymen from the grassland. They even lost the Chengu Pass ten days ago. The best cavalrymen from the Golden Tribe Royal Court could almost reach their North Battalion.</p><br/><p>At the beginning of this war, the Tang army seemed unexpectedly weak. It was a strategic choice as well as a matter of fact.</p><br/><p>In early spring, both sides were facing a shortage of supplies. The Tang army retreated so that the Golden Tribe Royal Court had to travel a longer way to deliver their supplies. It seemed to be a smart move. But they did not expect the Golden Tribe to be so ferocious and desperate to proceed to the south. They seemed to have never cared about running out of supplies. The supplies they brought should have only been sufficient for them to come to the defense line of the Northern Battlefront Army. If they could not break through the defense line they would not be able to return to the grassland. It seemed to be an unreasonable move for them to make such a desperate strike. However it turned out to be extremely effective. The grassland cavalry was crushing the Tang army like desperate wolves.</p><br/><p>Although they had been forced to inferiority, the morale in the North Battalion was still quite normal. The North Battlefront Army had been fighting against the cavalry of Golden Tribe Royal Court for so long that they were used to the brutality of the grassland barbarians. It could no longer scare them.</p><br/><p>Xu Chi stood on the Xiangliang Mountain next to their barrack and stared quietly at the grassland in snow storm. Some snowflakes fell on his lips and whitened his newly shaved beard. It seemed funny.</p><br/><p>Several chiefs stood around him. But they did not find it funny because they knew how much pressure their general was undertaking. He even seemed stooping.</p><br/><p>“No more retreating,” Xu Chi said after a long while. The few words came out of his frozen lips and sounded emotionless. It seemed that even he was not expecting himself to say so.</p><br/><p>The chiefs were shocked. They did not understand why he suddenly changed their original plan. Although the vanguard had been struggling and the morale was sinking, they still believed that the well-trained Northern Battlefront Army could hold on for a further while.</p><br/><p>Xu Chi turned back and wiped the snowflakes on his beard. He straightened up his slightly stooping figure and became the awe-inspiring martial art master of Tang again.</p><br/><p>Seeing the disagreement on the chiefs’ faces, he did not explain further. He looked at Hua Ying who was waiting for an order and said, “I want you to guard Guhe.”</p><br/><p>Hu Ying risked his life to come back from the frontline last night. His clothes were torn and he seemed miserable. But his eyes were still showing calmness and vigor.</p><br/><p>It was a very simple military order, providing no conditions or escape. The general gave him only one choice, to guard Guhe.</p><br/><p>Hua Ying did not keep quiet as the other chiefs did. Because he was the one to guard Guhe. And his hundreds of soldiers would be the ones fighting the bloody battle until the end.</p><br/><p>“For the safety of the North Battalion?” Hua Ying asked.</p><br/><p>He was not challenging Xu Chi, or had any doubt about this order. He was hoping that the general could provide a reasonable answer so that he could convince his subordinates, more importantly, convince himself.</p><br/><p>Xu Chi said indifferently, “When you are all gone, I will move our headquarters out of the North Battalion and come to join you. If you fail to guard Guhe, I will back you up.”</p><br/><p>“Why?” Even those chiefs who had been trying to control themselves could no longer refrain from objecting.</p><br/><p>“Why? If we lose Guhe, Chanyu’s army would proceed through Chuanling, bypass us, and enter the Hebei Prefecture via the southwest of Min Mountain, after that…” Xu Chi looked at Hua Ying and the other chiefs and said calmly, “The eight hundred miles of plain is the favorite battlefield for the grassland cavalrymen. Who could take the responsibility if they drive straight into the Central Plain? The Tang has a vast territory. But we, the Northern Battlefront Army cannot retreat further because Chang’an is right behind us.”</p></div>\n</div>"}