{"title": "Chapter 1053 - Countless Pairs Of Hands", "id": 1053, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1053-countless-pairs-of-hands", "volume_title": "Volume 11", "body": "<h1>Chapter 1053 - Countless Pairs Of Hands</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was deep down the Prajna Peak, ten miles away from the peak, the plateau, the pit as well as the ground.</p><br/><p>The sounds from the peak would never reach here. The murmur of the underground rivers would never reach here. It was deadly silent like in a tomb.</p><br/><p>The Chief Monk stared at the two iron arrows in his chest and felt a sharp pain. He realized that he had not experienced any pain for so many years. It was fresh and vivid, and even brought a sense of mocking onto his aging face.</p><br/><p>He had practiced Buddhism for many years and acquired the indestructible Vajra body. He used to think that no one would ever endanger him again since the Headmaster was gone. However, a few years ago as well as today, he was defeated twice by the two disciples of the Academy.</p><br/><p>“Do you think you can trap me like this?”</p><br/><p>“You will have no water, no food, hear no voices, and see no lights. You will become weak and old, starving or even driven mad by despair. You might could survive, or get rid of these two iron arrows and step out of the secluded cave by using your tremendous will power… But by then, the Buddha land you’ve been striving to guard would already be destroyed by my iron sword.” Jun Mo was not trying to threaten or intimidate him. It was never his style. He was merely stating the fact.</p><br/><p>Since it was nothing but the fact, he spoke with extreme calmness, hence it was horrifying. No water, no food, no sound, no light, being lonely and isolated. What kind of torture would that be? No one except Lian Sheng had ever gone through such tortures. And even Lian Sheng was almost driven mad. What would happen to the Chief Monk of Scripture after this?</p><br/><p>The Chief Monk pressed his palms together with difficulties, and spoke to Jun Mo with compassion, “My Buddha is compassionate.”</p><br/><p>He should have been compassionate for himself, for his life in hell in the coming decades. Yet he was being compassionate for his enemy, for the Academy’s choice.</p><br/><p>If it was someone else, he might have reexamined his plan or even felt guilty when facing the calm and compassionate Chief Monk. But Jun Mo would never do so.</p><br/><p>“Your Buddha is compassionate? Is the Academy not compassionate? Your hubris is nasty.” Jun Mo continued emotionlessly, “Throughout the years, the Buddha land had turned countless living human beings into bones and exploited numerous souls. The peaks were piled up with human bones, while the golden tops were painted with human blood. How is your Nirvana charming? It is nothing but hell. To destroy this land and kill you and all the other bald donkeys should be called compassion.”</p><br/><p>He said nothing further, turned away and walked toward outside the cave. He flicked his sleeve and his iron sword pierced through the air. In the meanwhile, pieces of rocks were chopped from the cliff and completely blocked the entrance. Nothing could get inside, not the wind, the rain, the light or even the air.</p><br/><p>…</p><br/><p>…</p><br/><p>Ning Que waited on top of the city wall for three days and nights. And so did the entire human world. From the Butcher in the little town to Hengmu in Qinghe Prefecture, everyone waited in silence for three days and nights, wondering where he would target his iron arrows.</p><br/><p>If it was in the past, he might have refrained from making the shot. The ultimate killing weapon was the most overwhelming before it was shot. Once it was set off, the balance between the two sides would be broken. Ning Que would never act rashly.</p><br/><p>But now it was different. The Abbey Dean had left Peach Mountain and disappeared in the human world. The Drunkard was no longer watching the Academy. The balance in the cultivation world was already broken. Moreover, the entire human world had sensed Ning Que’s anxiety. He would definitely make a shot today.</p><br/><p>Two holes appeared in the sky outside Chang’an. They were not tunnels in the torn space, or actual holes made by arrows, but two threads of condensation clouds along the tracks of the iron arrows.</p><br/><p>The two threads of condensation clouds extended to the west for dozens of miles then disappeared. But it was already clear enough for people to see its direction.</p><br/><p>Two straight threads of clouds in the clear blue sky were a rarely seen marvel, as the rainbow connected Heaven and Earth years ago.</p><br/><p>Many people in Chang’an poured onto the streets and chatted in elation. They were talking about which powerful cultivator Mr. Thirteen killed this time. The discussion was heated in the tea house. Some said it was Chanyu from the Golden Tribe Royal Court. Others said it was Haotian’s gift to the human world, the young slave called A Da…</p><br/><p>The war was launched and the Tang stood against the entire world. There were people dying constantly on the borders and everyone had been feeling depressed and gloomy until today. The two threads of clouds created by the arrows finally cheered them up, and almost brought them a carnival.</p><br/><p>Ning Que was also looking at the two threads of clouds in the sky. Light fell onto his face and made him look even paler. But his eyes were filled with joy. The two shots were exhausting, but also very rewarding.</p><br/><p>There were a few legendary weapons in the cultivation world, such as the Buddha’s chessboard, the Ullam Bell, those holy items recorded in the Taoist canons, the recently unveiled powerful Tomes of Arcane, and of course the Chang’an City built by the Headmaster. But most of those were bestowals from Heaven, or heritages of important figures like the Buddha.</p><br/><p>Very few of the legendary weapons were made by cultivators themselves. Currently it was only the River and Mountain Sandbox made by the previous wise men from the Academy and the masters from the Black Ink Garden, and the Thirteen Primordial Arrows.</p><br/><p>Nowadays, Ning Que’s iron arrows were already well renowned throughout the world. Every cultivator knew it was a horrible killing weapon. But only few from the back hill of the Academy knew the reason why the iron arrows could have become unimaginably powerful.</p><br/><p>The power of the Thirteen Primordial Arrows lied in Ning Que’s whimsical initiation, as well as the unparalleled skills of the Academy. It was a set of talisman arrows.</p><br/><p>Everyone thought that the Thirteen Primordial Arrows were a set of arrows. But actually they were not. A talisman arrow was a talisman rather than an arrow. More specifically, the Thirteen Primordial Arrows were talismans carried by the arrows. Whenever Ning Que made a shot, he wrote a talisman in the human world.</p><br/><p>The moment the arrow left the bowstring, the shaft was covered by talismans. But that was not the end of writing a talisman. Instead, it was just the first stroke of it. Only when the iron arrow reached its target would the last stroke of the talisman would be finished. Ning Que’s talisman could only be finished by then.</p><br/><p>A talisman was a seamless combination of strokes. It would not be a complete talisman without a single strike. The procedure of Ning Que’s shot was also a seamless combination. It began at the moment the iron arrow left the bowstring and ended when it hit the target. It was inseparable and therefore unbeatable once shot.</p><br/><p>The talisman drawn by the iron arrow was seamless and neither limited by time nor space. Therefore it was even more unpredictable than the Distanceless. Because of its seamlessness, Ning Que did not need to look for the path. As long as he knew where the target was, his iron arrow would be able to reach it.</p><br/><p>Despite the distance between Chang’an and the West Wilderness, the two places were connected in his ocean of psyche when he drew the talisman. When the arrow hit the Chief Monk of Scripture on the plateau, the talisman was finished. No space could break the talisman or stop the iron arrow. Plus now that he had the entire Chang’an as his power supply now, how could the indestructible Vajra Buddha body still be indestructible?</p><br/><p>When the Academy invented the Thirteen Primordial Arrows no one really understood its theory, not even Jun Mo or Ning Que. It was not until years later during the Rite to Light that he vaguely grasped the essence when he killed the Elder Cui from a thousand miles away.</p><br/><p>Today on top of the city wall of Chang’an, he shot two arrows toward the West Wilderness. And he further understood how to write such gigantic talismans. He knew it was very important to him, even more important than being able to kill the Chief Monk. Because it was his master Yan Se’s last will before he passed away, and also something he was destined to fulfill in his life.</p><br/><p>But of course, as Long Qing reasoned, his Thirteen Primordial Arrows needed someone to cooperate. Jun Mo was tens of thousands away from him, and the iron arrow and the talisman could not send out any message before it was seen by Jun Mo. He could only wait for his Second Brother to figure out his plan and make the Chief Monk visible in his ocean of psyche.</p><br/><p>Jun Mo had been fighting in the underground world for years. But he had only been to the peak and confronted the Chief Monk of Scripture for once. Ning Que seemed to have indulged himself in vain hopes. However he still chose to wait, for three days and nights.</p><br/><p>And he was proven right. Although they never communicated, they just knew what the other was thinking about.</p><br/><p>Their consonance was unbreakable like the the talisman drew by the arrow.</p><br/><p>Ning Que had no idea about what was happening in the Xuankong Temple, or about whether the Chief Monk of Scripture was already severely wounded by his iron arrows. But he was certain that he had drawn two perfect talismans with the arrows. Therefore his Second Brother would definitely take good care of the rest.</p><br/><p>The only disadvantage was that the two arrow shots were exhausting. It was very consuming even for someone like him to transfer the strength all the way from Chang’an to the West Wilderness. Although the God-Stunning Array was constantly charging his psyche, he could not make another powerful shot like these two within a short period of time.</p><br/><p>Otherwise he would have shot all the arrows in his case until he could make sure the Chief Monk of Scripture was dead. No one knew better than him how important it was to help the Second Brother to destroy the Buddha land as soon as possible.</p><br/><p>It seemed that Jun Mo had shared lots of burdens for the Academy and the Tang by dealing with Buddhism, the Right Royal Court and the Yuelun Kingdom in the West Wilderness. But actually Ning Que would rather have him back in Chang’an. His iron sword should be playing a much more important role on this stage. It should have taken down more powerful figures, like the one who was walking toward Peach Mountain.</p><br/><p>Ning Que turned away from the two threads of clouds and looked to the east. When everyone was expecting him to put down his bow, he pulled it again and made another shot to the east out of nowhere!</p><br/><p>Many people from Chang’an was standing down the city wall and watching. The walls were so high that they could only see Ning Que’s actions very vaguely.</p><br/><p>Upon seeing him pulling his bow again all of a sudden, they went into an uproar and poured in further in order to see more clearly.</p><br/><p>The iron arrow left the bowstring and disappeared upon a whistle in the chilling winter wind. The crowd was silenced.</p><br/><p>Then they yelled together like thunder because they were shocked by what they had just witnessed. And they were also expressing their support for the Academy and Mr. Thirteen.</p><br/><p>The clear blue sky was again pierced by a straight thread of condensation clouds, as if the iron arrow had torn the Qi of Heaven and Earth, or even Heaven and Earth itself. But actually the iron arrow created its own path between Heaven and Earth, neither in Heaven nor on Earth. It was a path of a seamless talisman!</p><br/><p>The arrow of talisman was the talisman of arrow. Ning Que targeted this talisman at the far away Chengjing.</p><br/><p>…</p><br/><p>…</p><br/><p>In the Chengjing City of Yan Kingdom, snow kept falling. The dark clouds kept producing the purest snowflakes and blue bolts shone from deep inside the layers of clouds. Some bolts pierced the clouds and hit the bare fields together with the snow flakes.</p><br/><p>It was a combination of thunder in the winter and snowstorms in the summer.</p><br/><p>It was nothing unusual for snowstorms to happen in this season. But bolts were rarely seen. They seemed spooky and horrifying, or carried some massive power.</p><br/><p>Long Qing whisked off the snow on his shoulders and looked toward the layers of dark clouds outside the city. He looks through the snow flakes to somewhere high above, and seemed solemn.</p><br/><p>He vaguely saw a piece of indigo cloth flying by. But the snowstorm and bolts were too heavy for him to tell whether it was real or his illusion.</p><br/><p>There was a vague figure flying high through the snow storm and almost hit by several bolts. It seemed extremely dangerous and shocking.</p><br/><p>This time Long Qing was certain that it was real because the figure had come to the city wall of Chengjing, and he could even smell the burned odor.</p><br/><p>The Eldest Brother’s cotton-padded gown was burned by the bolts in the clouds. If he was not able to react instantly he would have been killed by the bolts. Though he was able to escape, he looked miserable with his cotton-padded gown torn and blood gushing out. It was not handsome at all.</p><br/><p>Long Qing got slightly stiff. The snowflakes around were suddenly swept. He made a grasp in the snow and the darkest peach blossom bloomed in his right hand, guarding in front of him.</p><br/><p>In the capital of Song, Mr. First did not attack him because of the Drunkard as well as the Arcane Tome. Although he still had the Arcane Tome he knew that Li Manman would attack. It was so obvious. Mr. First had risked his life to get out of the Distanceless and landed on the city wall of Chengjing. He was definitely up to something.</p><br/><p>As Long Qing had expected, the Eldest Brother flew to the city wall and pounded his head with a very ordinary cudgel.</p><br/><p>Long Qing did not dare to slack. He reached out to the cudgel with the black natal peach blossom in his right hand, and was prepared with the remaining for the Arcane Tome of the Sand in his left hand.</p><br/><p>This seemingly ordinary cudgel was actually very renowned. It was a discipline cudgel the Headmaster made when he established the Academy. It was made to discipline the naughty students. When the Headmaster left for the Divine Kingdom, the cudgel was passed to the Eldest Brother.</p><br/><p>The cudgel was used to keep the Abbey Dean away in the South Sea for decades. It killed the former emperor of the Yuelun Kingdom in the fields at Cong Ridge. Since it was designed for disciplining the students, how could any student escape? No one could get away from it.</p><br/><p>Long Qing knew he could never escape from the cudgel, therefore he had to take it with his natal peach blossom. He had the psyches and souls of thousands of Taoist cultivators in him at the moment. In terms of quantity, he was undoubtedly invincible in the world. But when facing Mr. First’s cudgel, he could not afford to slack. He applied all his strength without hesitation.</p><br/><p>The cudgel fell onto the peach blossom. The peach blossom withered. The master and the disciples from the Academy had never been nice to the peach blossoms of Taoism. The Headmaster used to chop all the peach blossoms on Peach Mountain. And his follower came today.</p><br/><p>Long Qing turned extremely pale. The inconspicuous scar became extremely distinct and ferocious. His arms were trembling, and his feet sank into the city wall.</p><br/><p>The black peach blossom was smashed. Relics of the blossom splashed around as if they were the embodiment of the Qi of Heaven and Earth. Even the loose bricks on the city walls were smashed into the finest powders!</p><br/><p>The Eldest Brother did not pause but disappeared in the stormy sky instead. He crossed the scary thunder and went after the indigo gown passed by earlier on.</p><br/><p>Long Qing managed to keep calm, but could not hide the trace of fear in his eyes. He knew that the indigo gown he saw just now was not an illusion. Mr. First was chasing the Abbey Dean. He just randomly decided to give Long Qing an attack when he saw him on the city wall of Chengjing.</p><br/><p>A random strike had forced him to apply all his strength. What if Mr. First had made a full strike? Would he still be able to take it?</p><br/><p>While Long Qing was thinking, he did not realize that something more serious was approaching. The storm outside the city walls seemed to have stopped for a second.</p><br/><p>An arrow came from Chang’an. An iron arrow came to Long Qing.</p><br/><p>Long Qing’s pale face suddenly flushed, as if the blood flow suddenly accelerated tremendously in his veins.</p><br/><p>His blood started burning at that moment. Countless psyches of the former Taoist cultivators helped him to react as soon as possible.</p><br/><p>Another black peach blossom bloomed in front of his chest. It was much smaller compared to the previous one, and crystal clear like a valuable gem. The petals shivered in the wind, fragile and adorable.</p><br/><p>The seemingly fragile small black peach blossom was actually horrifying. It carried the immense power of extinction, as well as numerous alien psyches.</p><br/><p>The iron arrow hit the shivering peach blossom.</p><br/><p>There was a hole in Long Qing’s chest created by Ning Que’s Thirteen Primordial Arrows many years ago. The small and tender black peach blossom appeared right in the hole.</p><br/><p>The black peach blossom was not his natal peach blossom, but his second life.</p><br/><p>Long Qing was determined not to let Ning Que make another hole in his chest with this iron arrow.</p><br/><p>The moment the black peach blossom blocked the iron arrow, his hands were already placed on the arrow in front of his chest.</p><br/><p>The jet black iron arrow brought an unimaginable power. Long Qing’s fingers got hold of the massive Qi of Heaven and Earth in the stormy Wilderness, but they could not control the arrow.</p><br/><p>On the contrary, his hands were immediately torn and blood was about to drip.</p><br/><p>When the first drop of blood was about to drip from the arrow, another pair of hands were placed onto the shaft. That was a pair of pale and inhuman hands.</p><br/><p>They were also Long Qing’s hands.</p><br/><p>A vague human figure seemed to have appeared behind Long Qing. It was dim in the storm and could almost be wiped away by the wind instantly.</p><br/><p>The second pair of hands could not stop the iron arrow. Long Qing howled. In the meanwhile, countless shadows appeared behind him in the storm. The shadows were very dim. No one could see them clearly under the sunlight. But they were for sure humans, and they all followed Long Qing’s will.</p><br/><p>Upon the chilling howls those shadows reached out their hands together toward the sword, like hungry ghosts hunting for food, or the sinful seeking for liberation.</p></div>\n</div>"}