{"title": "Chapter 1066 - The Person By The Stream", "id": 1066, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1066-the-person-by-the-stream", "volume_title": "Volume 11", "body": "<h1>Chapter 1066 - The Person By The Stream</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ning Que’s footstep was very firm, but it was a shame that he did not get a chance to approach the national master. But he was not disappointed as trying was always just an attempt. He believed that he would find his way to encounter him in the laager and then killed him off.</p><br/><p>The national master did not speak a word. The prayer beads between the thumb and the index finger started to rotate by itself gradually. The scent of the blood wafted through the atmosphere, and suddenly, the blood from the laager became extremely rich in the smell.</p><br/><p>The scent of blood was originated from those deceased in this grassland, and those Tang troops that died without a burial place.</p><br/><p>Ning Que lifted his head to look at him and sad, “You believe in Tengri, but you did such an evil thing. Don’t you worry to be punished when we go to the divine kingdom.</p><br/><p>The national master said, “Correct means correct, the tactic used isn’t important.”</p><br/><p>Ning Que replied, “You know my relationship with Tengri, a belief of yours.”</p><br/><p>The national master glanced seriously at Ning Que and uttered, “That’s the so-called relationship an ordinary person like you thought of.”</p><br/><p>Ning Que assured, “I will prove to you that the relationship existed objectively.”</p><br/><p>During their conversation, he had already moved three steps forward that carriage. The frost on the body would fall off with every step taken. At first, the frost was combined to its body, unable to fall off. But they fell because of the flame which was spitting fire from his body.</p><br/><p>His footsteps landed on the grassland, leaving footprints and a number of blazing flames.</p><br/><p>The flame was clear, sacred, dignified and was as white as the snow lotus blossoming on the snow peak in Tianqi mountain.</p><br/><p>Even though he could not get one step closer to the position of the national master. But several snow lotuses solidified by the Haotian’s divine flames were burning furiously within the large array which was full of the scent of blood.</p><br/><p>Those souls with resentment that travelled from each wagon were in contact with the Haotian’s divine flame. The wailing sound in agony was not heard, but only a smirk could be heard before they were purified into nothingness.</p><br/><p>Ning Que’s body was starting to be surrounded by the Haotian’s divine flame. The countless of souls with resentment from the national master’s blood sacrificing array was not able to approach his body. His body was burning but his eyebrows covered with snow did not melt.</p><br/><p>Before the souls with resentment being purified, they could display their appearance prior to death for a split second.</p><br/><p>Ning Que did not cover his eyes to avoid seeing it because many things could not be considered to not have happened with the eyes closed. He focused his eyes on those faces that appeared and later vanished in sight; some were faces that he was once familiar with.</p><br/><p>“Go ahead! If you all want to leave for the Divine Kingdom of Haotian, I will ask her to watch you all. If one day the Divine Kingdom completely collapses, teacher will watch you there. If you all want to head the Abyss in the Nether World to continue your battle, then please wait till we meet again. During that period, we can go for wood cutting together.” He looked at those familiar and strange faces in the divine flame, whispering to himself within his heart.</p><br/><p>…</p><br/><p>…</p><br/><p>The national master’s expression showed no concern, and his eyes reflected the light rays of the divine flame which was flickering.</p><br/><p>He never thought that Ning Que had such a large number of Haotian’s divine flame… normally only the believers who were most committed to Haotian could learn the West-Hill divine skill and call out the Haotian’s divine flame.</p><br/><p>The national master was not interrupted by this question for a long time because his state knowledge was not as ordinary since he knew about the complication between Ning Que and Tengri. However, many things were better left unanswered.</p><br/><p>The first thing he should do now was to suppress Ning Que’s counterattack.</p><br/><p>Yes, the act of Ning Que burning himself now was his counterattack against the blood sacrificing array, flaring alongside the Haotian’s divine flame. As he was moving around the laager freely, the whole piece of grassland was illuminated. The laager that was surrounded by the cold wind that was continuously rotating had been broken and dispersed. The temperature increased tremendously, would it still be cold at all?</p><br/><p>Ning Que extended his hand to remove the clear water that was dripping from his eyebrows, finally made his way to the front of a carriage.</p><br/><p>The national master was no longer in this carriage. The damaged box in the car revealed a gap; and inside the box, the blazing Haotian’s divine flame was burning the white bones vigorously. The bones were turning yellowish and burnt slowly, but surprisingly, it was still sustaining its strength.</p><br/><p>Ning Que drew out his pudao without a word, and immediately slashing it hard on the carriage. It collapsed in an instant, and the box dropped onto the ground. The outer part of the box fell into ten pieces of wood, exposing the objects inside.</p><br/><p>A steel box was inside the wooden box. It was made from iron bars, and the inner part consisted of human bones and skulls… a full box of skulls, hard to determine the number of dead bones needed to have a full collection.</p><br/><p>Ning Que had his usual expression. Just then, he made another slash on the steel box.</p><br/><p>A sudden loud bang was heard. The bottom part of the steel box, which was a little hard broke open, the sand and dust scattered around and leaving toward direction of the grassland. It only stopped when the height of the accumulation was a few feet deep.</p><br/><p>The steel box was not broken into pieces yet. Innumerable skulls were still constrained in it to provide unstoppable energy to this blood sacrificing array.</p><br/><p>Ning Que stared at the box on the ground in complete silence.</p><br/><p>“This is the array base which was done by all the priests in the Royal Court with witchcraft through gathering the souls from thousands of years and smelted them in the fire. Even if you have immensely strong power in the human world, it will still be impossible for you to break it because human energy can be limited, but the souls are infinite.”</p><br/><p>The national master unexpectedly appeared on a carriage in the south direction with a robe whirling and slightly moving the prayer beads. He gazed at Ning Que with compassion and said, “Since your effort is futile, why do you still want to force it?”</p><br/><p>Ning Que replied, “True… I need to admit that you have trapped me, but then, what’s next? If you can’t kill me, then what’s the difference between this blood sacrificing array and a child’s play?” He turned over to face the national master who was in the carriage and uttered, “You must be very clear that the act of you trapping me is similar to be trapped by me. As long as you stay here, then you will surely die.”</p><br/><p>What being told was not wrong. For the Academy, the main concern of the Golden Tribe Royal Court was to focus on dealing with the national master. If he could not excuse himself due to trapping Ning Que, then upon the arrival of the main force of Tang troops, the emergence of Xu Chi, and possibly even the appearance of that individual who came in person, then the national master would surely lose.</p><br/><p>The strange thing was that the national master remained calm without being influenced by the words said by Ning Que. He seemed to be totally confident that he would not be harmed by the Academy. Maybe because he thought that he could kill Ning Que.</p><br/><p>About ten high priests appeared on the grassland in all directions and walked their way toward the laager.</p><br/><p>Ning Que’s vision passed through the burning Haotian’s divine flame, fixing his gaze on these people and the bone necklaces on their chests. He said, “Finally here.”</p><br/><p>The Golden Tribe Royal Court was used to fight with the Central Plains cultivators, those high priests who were skillful in witchcraft. Every high priest was on par with the standard of the famous underworld cultivation in the Central Plains.</p><br/><p>What would happen when approximately ten high priests join in the blood sacrificing array?</p><br/><p>These old high priests moved their lips slowly and started to chant those weird scriptures which were chanted by the national master earlier. Then they began to dance around and shake their bodies, performing a dance that no one could understand.</p><br/><p>The grassland priests were experts in witchcraft, the scripture was a spell while the dance was a curse.</p><br/><p>There were about ten wagons that toppled all of a sudden, the wooden boxes in those wagons broken into pieces, revealing the iron bars. Those steel boxes gradually floated in the air. The last to float in the air was the one that was deeply slashed into the ground by Ning Que with sand falling off as though an unearthed dark object.</p><br/><p>All the steel boxes contained human bones and skulls, scattering around the fine remnants of those who had deceased with the effort of the national master and the high priests with the secret process of grassland witchcraft.</p><br/><p>It was an unimaginable enormous pressure from the souls, and went above the souls, appeared invisible and inferior but seemed real and existed like a huge mountain which bombarded Ning Que’s mental world.</p><br/><p>Ning Que hummed. The blood leaked out from the tip of his mouth but his eyes still looked pure and bright. After he had combined his body with Sangsang in the Buddha’s chessboard, the strength of his body is equivalent to his soul strength, followed by his strong psyche power made him the best of the best in the human world. This pressure from innumerable souls might be able to crush the ocean of consciousness of a zenith strong man who knew the destiny state but could only hurt him, so he could still hold on to this.</p><br/><p>But being trapped by the blood sacrificing array, it did not make sense to keep holding on with all his effort because he did not know how long he could last. What he needed to do was to break the array and then kill his enemies.</p><br/><p>Breaking the array and killing enemies were similar but two different things.</p><br/><p>To break this terrifying blood sacrificing array, the main point was to kill the national master. To kill the national master required to first locate his position and confirm his position but the problem now was that he did not know where the national master was.</p><br/><p>The national master was here, just in front of him, standing on the only carriage that was left behind, but he was as though standing very far away. He was combined into one with the blood sacrificing array, but felt as though he was looking from afar. Why was it so? At first, he flew down from the sky but did not manage to step right straight on the head of the national master, and then the national master was moving around freely. Maybe something was hidden behind this problem.</p><br/><p>Ning Que staring at the national master who was standing on the carriage, looking at the robe which swayed along with the wind and the wooden prayer beads on his body. He squinted his eyes, and a strange feeling became more obvious.</p><br/><p>Out of the blue, he sensed something, hence he lifted his head to view the sky. He saw the gloomy clouds that approached as a consequence of being interrupted, influenced, and sucked by the blood sacrificing array had a light and thin line emerging on its surface.</p><br/><p>The dark clouds seemed to have countless souls with resentment. Those were the people who died on the grassland and those were the sins done by the Golden Tribe Royal Courts for many years as a result of their desire of killing the enemies, also known as the killing souls.</p><br/><p>Gazing at the gloomy clouds, Ning Que’s reaction toward the desire of killing from the Golden Tribe Royal Court was extraordinarily obvious and he had a better understanding of the blood sacrificing array. He confirmed that this was not something that he could break himself now. However, the expression in his eyes looked rather calm as he slightly raised the eyebrows which was covered with snow again.</p><br/><p>He seemed to be smiling. “You are such an incredible person.”</p><br/><p>He withdrew his gaze from the sky to face the national master who was not far from him, and said, “I have to admit that you have enough ability to trap me to death, but… it is not enough because you know the academy does not only comprise me alone.”</p><br/><p>The national master put both his hands together, looking like an old monk. Both his angry eyes made him appear like a barbaric wizard, but a sneak peek made him looked like a monk who had meditated for years in a deep mountain. He asked, “When will they arrive?”</p><br/><p>This type of changes in terms of the temperament of one’s facial expression was an extraordinary state. However, Ning Que had seen Master Lian Sheng’s 32 changes in facial expressions at the front gate of the Devil’s Doctrine, so this did not catch him by surprise.</p><br/><p>He appeared like he was engaging in small talk with the national master, “Tang is not free today.”</p><br/><p>“Then the Grand Master will be here today.” The national master said calmly with a straight face, “To be honest, I have been waiting for her presence all these years. I really hope she won’t be absent for this today.”</p><br/><p>It was still a casual conversation. During the conversation, both revealed their strong confidence levels. The confidence of Ning Que was built from the academy and his elder sister while the national master’s confidence was from the tribe.</p><br/><p>This blood sacrificing array was the array of the national master alone, but was the array of the whole Golden Tribe Royal Court.</p><br/><p>This was a whole tribe that consisted of millions of people. This was a tribe with thousands of years of inheritance and its unique cultural background but this tribe turned into an array today.</p><br/><p>Even if Yu Lian was here, would it be able to be broken?</p><br/><p>The national master was telling the truth. He had been waiting for Yu Lian for several years. He waited for Yu Lian all this while just to kill her.</p><br/><p>At this moment, Ning Que said, “Do you think that confining me within the array can prevent me to stand before you? But how about her?”</p><br/><p>Listening to these words, the national master could not be as calm as he was earlier. He suddenly felt that perhaps he was not the one waiting for her, but instead… she was the one waiting for him these past few years.</p><br/><p>…</p><br/><p>…</p><br/><p>Toward the northern west direction of the City of Wei would be a barren desert, and there was an extremely small district called Lu district in the middle of the desert. This district followed a certain timing that caused it to vanish and appear at times but most of the time it would disappear more than it appeared. Even the Golden Tribe Royal Court and the Tang troops did not know the existence of this small Lu district.</p><br/><p>From the Lu district to the south direction would be Kaiping assembly area, at this moment the Northern Battlefront army being led by Situ Yilan was having a merciless and fierce battle with the remnant armies from the Golden Tribe Royal Court. Hence, no one would be there.</p><br/><p>Chanyu and thousands of cavalry who escaped from the city of Wei rushed toward the direction of the grassland in the north direction so it was impossible for them to pass by this small Lu district. Therefore, it was reasonable to say that no one would be present at this place.</p><br/><p>But today someone made a sudden appearance in this small Lu district.</p><br/><p>This grassland cavalry held his war-horse and rested by the only stream in the Lu district. It was a normal war-horse, and this particular cavalry seemed to be an ordinary person. He was wearing clothes full of bloodstain.</p><br/><p>He looked toward a dozen miles away in the east direction, feeling the changes in the Qi of Heaven and Earth and showing a trace of a smile.</p><br/><p>A dozen miles away in the east direction which was exactly the northern part of the City of Wei was the location of the blood sacrificing array.</p><br/><p>This cavalry lowered his head to wash his face, then he held up some clear water, preparing to soothe his throat.</p><br/><p>The calm water in the stream reflected his face, that young and handsome face with moustache near to his cheeks which was not cleaned for many days, looking like wild grass simply growing on his face, but made him appear like a tough guy.</p><br/><p>All of a sudden, his gesture turned stiff.</p><br/><p>On the surface of the water, it reflected a calm and composed expression on his face, but his eyes were glowing like wildfire was burning in his eyes.</p><br/><p>The clean water left the gaps of his fingers gradually, which was similar to the time that had gone in his life.</p><br/><p>As the clear water was flowing out from his hand, he raised his head and faced toward the opposite side of the stream.</p><br/><p>A girl who was wearing a yellow dress unknowingly appeared on the other side of the stream.</p><br/><p>This girl looked as though she was approximately 12 or 13 years old with a gentle and beautiful countenance. Two black ponytails at the back of her head were swinging a little and made her look super adorable. However, the expression on her face was as cold as ice.</p><br/><p>“I heard that you are waiting for me,” the girl in yellow skirt said to the grassland cavalry.</p></div>\n</div>"}