{"title": "Chapter 1084", "id": 1084, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1084", "volume_title": "Volume 11", "body": "<h1>Chapter 1084</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>There was only one butcher shop in town. There was only one butcher in the world.</p><br/><p>The middle-aged priest stood outside the door sill, looking at the Butcher who was covered in grease, and yet not one sweat could be found on him, and said, “Since you are here, senior, please do something.”</p><br/><p>The Butcher was cutting pork. After listening to this, he looked at him for a long time and asked him hoarsely, “Is your Elder Brother really ready to do that outrageous thing?”</p><br/><p>The middle-aged priest replied calmly, “What is outrageous? First, we need to define the concept of Tao… you and Senior Drunkard have hidden under Haotian’s eyes for countless years, isn’t that against her way?”</p><br/><p>The Butcher raised his shaggy eyebrows and said, “How dare you?!”</p><br/><p>The middle-aged priest said, “It benefits you guys too if you help Elder Brother.”</p><br/><p>“To help your Elder Brother,” said the Butcher. “All I have to do is stay in the small town and don’t come anywhere near here…. because you and I both know that helping your Elder Brother and helping Taoism are two different things.”</p><br/><p>The middle-aged priest was silent for a moment and continued, “The agreement between Haotian and you is still valid.”</p><br/><p>The Butcher remained silent for a longer time, at first it was because he needed time to think about what he wanted to do, but later on it was because someone had come.</p><br/><p>Hearing footsteps, he started asking, “What do you need me to do?”</p><br/><p>The middle-aged priest quietly stood outside the door sill and did not turn back to see the approaching figure, and said, “No one can stop the Black Armor Heavy Cavalry of the Tang’s troop. I will not pray for eternal peace in the temple, but I just hope to save some of the pavilion halls.”</p><br/><p>The Butcher put down the knife in his hands and said indifferently, “That’s it?”</p><br/><p>The middle-aged priest said, “If the people from the Academy can be killed by you, that would be the best.”</p><br/><p>The Butcher and the Drunkard were the world’s two longest-living Grand Cultivators, even longer than the Buddhist temple and the Headmaster of Academy. They had always been reclusive until the Headmaster of Academy ascended to heaven and Haotian came into the world, they were then forced to reveal their whereabouts. In these years, the Drunkard had made a move several times, putting more pressure on the Academy so that they could not take anything lightly, while the Butcher did not make a move at all.</p><br/><p>He was extremely strong, perhaps the strongest in the world, and unlike the first that was buried in Prajna Peak, he was strong physically and even stronger with knives, because he was good at killing people.</p><br/><p>For many years, he killed pigs, sheep, cattle, and also men, and this became his strength. While living in seclusion these few years, he lessened his murders, not because of mood alteration, but because of the request by the Headmaster of Academy…</p><br/><p>The Butcher looked impassive and said, “They’re just pigs and sheep. It doesn’t hurt to kill them.”</p><br/><p>His voice was cut off by the cicadas chirping in the small town. At this time, the autumn rain was pretty cold, and the natural sound that the cicadas made in the rain was even sadder. Drowned in the sound of chirping, a little girl in a yellow dress slowly walking from the direction of the town.</p><br/><p>She stopped in front of the Butcher’s shop and looked in. The raindrops at the end of her ponytail were like fine pearls, and as she moved, they fell onto the ground inside the shop. Then she scrunched her nose in a cute way.</p><br/><p>She thought the smell of blood in the Butcher’s shop was too strong, very unpleasant, as unpleasant as the words spoken by the Butcher.</p><br/><p>“Others are pigs and sheep, but you are a dog. I have never figured out why people like you and Drunkard are willing to be dogs. Is it really that interesting?” Yu Lian’s puerile face was full of inquiries, and she looked cute because she was serious. She was not in a mess though her yellow dress was drenched in the rain, and still looked adorable with her black hair pulled back into a ponytail.</p><br/><p>She was such a lovely but intimidating little girl.</p><br/><p>The injury caused during the war between the Wilderness and the national master of Golden Tribe had fully recovered, yet she did not stop for a rest and travelled thousands of miles toward south, heading to the West-Hill Divine Kingdom, so how would the thousands of cavalryman from the Divine Halls of West-Hill at the outskirts of Peach Mountain stop her?</p><br/><p>Until she came to the butcher shop in the small town, then only did the Divine Hall of West-Hill noticed her arrival. A shrill warning sound went off under the pouring rain and the whole town was in chaos. Countless people came to the town but did not dare to set foot on the street.</p><br/><p>The Butcher looked at the little girl outside his shop, he was able to roughly guess who she was and said impassively, “It’s better to be a quiet dog than to mess around with people causing chaos… that’s what your teacher told me personally when we were in town that year.”</p><br/><p>Yu Lian’s gaze fell on the knife in his hand and replied casually, “What he said is not necessarily right.”</p><br/><p>The Butcher said, “I heard you are the suzerain of Devil’s Doctrine of this generation? Devil’s Doctrine stresses on the vitality of heaven and earth in the body, similar to my self-enlightenment. To be honest, I should be your ancestor in this doctrine… but seeing that you don’t even care what the Headmaster of Academy said, I don’t think you would give a second thought about what I’ve just said.”</p><br/><p>Yu Lian clasped her hands behind her back and tiptoed to look into the butcher’s shop, just like those little girls who were learning to be adults, absolutely endearing. She said casually, “The Light’s Doctrine of mine has always been good at deceiving and destroying ancestors.”</p><br/><p>The Butcher replied indifferently, “You are a very interesting little kid. No one has spoken to me in this way for many years now, you might want to take pride in that.”</p><br/><p>He had lived in this world for many years, and by his age alone, he could practically call everyone a child. Yu Lian wasn’t the slightest bit annoyed, but looked at him and responded, “I find you interesting too.”</p><br/><p>“Which part?” asked the Butcher.</p><br/><p>“No one has ever dared to speak to me with this attitude except my teacher,” Yu Lian answered. “Come to think of it, he was the one who spoke to you with this attitude of mine many years ago. If that’s so, he must have been better at it.”</p><br/><p>The Butcher was silent for a moment, then suddenly threw the knife in his hand. The Butcher’s knife, full of blood and oil, fell heavily to the ground outside the door sill with a loud clang, as smoke and dust rose in the air, sending gravel flying into the autumn rain as if a mountain had fallen from the sky to the earth.</p><br/><p>“If you can handle this knife, we’ll talk,” he said.</p><br/><p>Yu Lian crouched down with her hands still behind her back and looked at the legendary knife for a moment. Then she carefully rolled up her sleeves and took out a handkerchief, holding onto the back of the knife with just two fingers.</p><br/><p>With the two fingers, she slowly lifted the heaviest knife in the world off the ground.</p><br/><p>As she moved, the weight of the iron knife spread to her feet. With only two clatters, two clusters of cobweb-like cracks appeared on the bluish marble floor outside the butcher shop’s door sill.</p><br/><p>In the whole process, she frowned and looked dignified. Then she put the knife down.</p><br/><p>“Very well, you are entitled to talk to me.” The Butcher looked at her coldly and said, “Although it was with difficulty, but you managed to lift it up.”</p><br/><p>Yu Lian shook her head and carefully wiped her fingers with her handkerchief, saying, “Old people like you always like to boast about yourselves. I just think it’s too dirty. Do you really think that it’s extremely heavy?” She frowned attentively, not wanting her fingers to stain of blood or grease.</p><br/><p>The Butcher was silent for a quite a while and said, “You are very strong indeed.”</p><br/><p>“Thanks for the recognition.” She replied casually without a sense of seriousness, her strength didn’t need anyone’s approval, even if the person was the legendary Butcher.</p><br/><p>“If you were given my age, no, half, or even a tenth of it, you would probably outdo me, and perhaps even achieve real immortality.” The Butcher looked at her and said, “Sadly, you’ll never have that time again, so you’re not enough, and whoever comes from your Academy will be no match for me, because all of you are not strong enough.”</p><br/><p>“You haven’t been out in the world for years, so you won’t know that the strength of the Academy is defined as the word ‘strong’,” Yu Lian said.</p><br/><p>Butcher replied, “Do you want to bring up Ning Que who inherited the legacy of Ke Haoran? Indeed, he is not bad, but many things had happened in Yangzhou City, and now… he’s still lacking.” He said while raising his eyebrows again.</p><br/><p>Sounds of steady footsteps echoed in the autumn rain. With the powerful rank of the Butcher, he could naturally hear out that something was wrong with the person’s center of gravity, but the footsteps were still extremely steady, which meant this person was dreadful.</p><br/><p>The person was dressed in a shabby frock, his hair was short and loose, but his expression was calm. As he walked in the rain, the distance of every step he took was as if he measured it with a ruler beforehand, there was no deviation.</p><br/><p>Jun Mo was not someone that would make mistakes.</p><br/><p>The Butcher looked at him gravely and said, “Perhaps, you are also here to see if you can pick up my knife?”</p><br/><p>Jun Mo took the handkerchief from Yu Lian and carefully wiped off the rain on his face, then glanced at the knife on the ground. He did not understand what the Butcher was saying and looking at him was like looking at an idiot.</p><br/><p>Yu Lian looked at the Butcher as if she looking at an ignorant child and said, “I’ve said you would never ask about the world and it proves that I’m right, you don’t know the strongest person in the Academy, and it was never Ning Que.</p><br/><p>Indeed, the two strongest people of the Academy were Jun Mo and Yu Lian.</p><br/><p>The Butcher, the strongest man in the world of cultivation, or even the strongest one in the whole history of cultivation. The “strong” used here was not referring to the state of cultivation, but the intensity and strength in particular, thus the two strongest person from the Academy came to meet him.</p><br/><p>Being stared at and ignored by two Academy juniors, the Butcher’s mood turned sour. His face became a little gloomy and he turned quiet.</p><br/><p>“Is it enough now?” Yu Lian asked.</p><br/><p>“Enough,” said the Butcher. “Both of you can join forces and try to battle me.”</p><br/><p>Yu Lian said, “Teacher had said that when giving a regular speech, the words you choose are very important. Jun Mo likes using peaceful measures before using force, since it is enough, then we may first talk about some things.”</p><br/><p>The Butcher took a deep breath, he had done real war preparations these countless years but was stopped by the words of Yu Lian. His turned his pent-up emotions into a word, “Speak!”</p><br/><p>“It seems a little inconvenient today,” Yu Lian said.</p><br/><p>The Butcher looked at her with his eyes narrowed and eyebrows raised, not saying a word.</p><br/><p>Yu Lian said, “I am not afraid of you, it’s useless to stare at me.”</p><br/><p>Then she turned around to look at the middle-aged man and said, “Do you know why it’s inconvenient?”</p><br/><p>The middle-aged priest sighed. “I think it’s because of my presence? But you are of great powers, so why pay attention to me?”</p><br/><p>“It is because you are quite strong,” Yu Lian answered.</p><br/><p>The middle-aged priest smiled, “From the beginning till now, I have done nothing.”</p><br/><p>“And because of that you are amazing… until now, I don’t even know your name, which I have to say it’s quite impressive,” Yulian said to him calmly.</p><br/><p>She was a fog to the world.</p><br/><p>However, this seemingly calm and harmless middle-aged priest, who had been watching and observing for decades, even she could not see his depth, as if his real face was still hidden under the fog, hence, of course, he was worthy of vigilance.</p></div>\n</div>"}