{"title": "Chapter 1094 - By The Lake (I)", "id": 1094, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1094-by-the-lake-i", "volume_title": "Volume 11", "body": "<h1>Chapter 1094 - By The Lake (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ning Que did not know how to continue the conversation. He glanced at the bubble floating in front of her, which prompted him to recall what he and his teacher had speculated about on the ship. Uncertainly, he asked, “This is what the world looks like?”</p><br/><p>Sangsang did not answer.</p><br/><p>Despite the unyielding blizzard, the speed of the big black horse was still extremely fast. Without taking much time, they had crossed the Snow Sea. Ning Que turned and looked back at the clear hoof prints on the snow-covered plains, seemingly deep in thought.</p><br/><p>Every step would leave a trace. This sentence was somewhat sarcastic as it was something meant to be painfully obvious, but such a simple truth was much needed in what he was going to do. Were those traces not the most significant impact of mankind to this world? Like city walls, palaces, fields, paths, and river banks?</p><br/><p>The same could be said for this trail on the Snow Sea, which was also a part of a certain stroke in a certain character, or a beginning, or an end, but it was uncertain for the time being, even Ning Que was uncertain himself, unless he actually wrote the word and made it visible to the whole world.</p><br/><p>Nevertheless, how could it be easy to write that word? Looking back on the history of mankind in this world, countless disasters striking countless years, there was no one but the Headmaster of Academy who could surmount those obstacles and restrictions and arrive at a state where no rules would apply to him at all.</p><br/><p>But preparations were still needed, even if it would take thousands of years. It was probably the least he could do now until he could determine the Abbey Dean’s true intentions.</p><br/><p>Judging from the current situation, the Abbey Dean had allowed Long Qing to burn Ye Su to death in order to help him become a sage, which led to the split of Taoism. In a roundabout way, this had fueled the popularity of the New Stream, and all of these stank of an intention to weaken Sangsang. It was clear that he was hostile against her.</p><br/><p>According to the Academy’s hypothesis, the means used to work against Sangsang were the few Arcane Tomes, but… why? If it were not about religious beliefs and things like that, it was difficult to understand the logic of this whole incident. Sangsang was Haotian, so why would Taoism want to eliminate her? How would they dare to kill her? What was the point?</p><br/><p>Sangsang did not volunteer any answers but Ning Que did not ask. As long as they could return home to Chang’an City, he would still have a lot of time to solve this puzzle, followed by drafting up the corresponding countermeasures.</p><br/><p>The speed of the big black horse was miraculously fast, as if it turned into a bolt of black lightning in the blizzard. The indigo lion was also bounding alongside them in deep snow, charging forward in bursts of snow, like green lotuses blooming along the way. Surprisingly, it could match the black horse’s lighting-fast pace.</p><br/><p>A few days later, Ning Que and his entourage left the cold region and came to a coniferous forest nearby. There were frozen remnants of deer carcasses and blood strewn over the area, most likely from a successful hunt by predators. Judging from the frenzy of animal tracks and broken trees, he deducted that this might be a place where arctic wolves had passed through.</p><br/><p>Sangsang stretched out her right index finger and tapped the big black horse’s neck. The big black horse understood her meaning and slowed down to stop. She dismounted clumsily while cradling her stomach and beckoned by waving her hand.</p><br/><p>The indigo lion raced over gleefully and leapt into her arms.</p><br/><p>She held the beast in her arms and looked southwards blankly.</p><br/><p>Ning Que glanced at the lion in her arms and started to say something, but he cut himself off abruptly.</p><br/><p>The blizzard was still raging in the south, but after one hour of staring in that direction, Sangsang spoke up. “Head east, 12, 8.”</p><br/><p>Ning Que assisted her as she mounted the horse. He tugged on the reins gently, guiding the big black horse to change direction. They then set off towards the east. He did not ask any questions throughout the whole process, as if he knew what she meant.</p><br/><p>After a few days, they arrived at a frozen river bank. Yet again, Sangsang instructed the big black horse to stop.</p><br/><p>She looked at the sky with her usual indifferent expression, but her eyes gradually showed impatience. She withdrew a small abacus from her clothes and began to use it.</p><br/><p>Except for that time when she was renovating a house in Chang’an City where an abacus was needed to boost her confidence due to the large amounts of money involved, Ning Que rarely saw her using the abacus, thus he was surprised.</p><br/><p>There were barely any trace of people or animals on the snowfield. It was very quiet except for the sound of roaring wind, and a persistent clacking sound that came from the bank of the frozen river. Sangsang’s fingers flew on the abacus, leaving a trail of shadows, as if she was playing a Guzheng.</p><br/><p>After some time, she concluded her calculations. Ning Que looked at her and saw that the beads on the abacus were arranged in a very orderly but absolutely meaningless pattern. He did not understand it, thus he asked bluntly, “Where should we go?”</p><br/><p>“Northwest, 33, 23,” Sangsang answered.</p><br/><p>Heading northwest meant to retreat, but Ning Que did not doubt her. He gently lifted the reins and again guided the big black horse in the specified direction. They cantered off immediately, kicking up the snow behind them and splashing the ice everywhere.</p><br/><p>At dusk, the big black horse came to a stop for the third time. Sangsang pulled out her abacus, and began to use it like stroking the strings of a harp. After finishing her calculations, she gave a new direction and Ning Que followed accordingly.</p><br/><p>All this while he did not question anything, did not voice any doubts, he just cooperated quietly, just as he had done many years before and trusted her completely to navigate for them.</p><br/><p>Several days after that, the situation repeated until Sangsang did not return the abacus into her clothes anymore. Instead, she balanced it on the saddle and fiddled with it from time to time. The frequency of them changing directions increased.</p><br/><p>She was much weaker than she had been in the past. Her divine abilities could not calculate everything in the world, but when it came down to it, she was still much better than any ordinary human being. There was no pattern to the changing of directions and the retracing of their steps, so even Ning Que had lost his bearings in the end.</p><br/><p>Nevertheless, he knew that they were heading southwards, getting closer and closer to Chang’an City.</p><br/><p>So far, they had not come across the person whom they did not want to meet.</p><br/><p>Ning Que became increasingly serious as they progressed, because he knew that everything would be more dangerous in the end. He also realised that Sangsang was becoming more and more exhausted. He was not sure how long she could continue to calculate on the journey.</p><br/><p>Sangsang became very tired and drowsy. She often dozed off soundlessly on his chest while using the abacus. Fortunately, it seemed that she was not as frail as she was years ago when she fell sick. She did not spit blood this time, was also a good sign.</p><br/><p>Every time Ning Que looked at her bulging belly, he could not help but think if she was close to giving birth?</p><br/><p>…</p><br/><p>In the two days to come, they headed south by travelling along Tianqi Mountain. The snow mountain drew a clear, beautiful and undulating line in the blue sky, guiding the direction of the big black horse.</p><br/><p>As Helan City started to be seen vaguely in between the mountains, Sangsang stopped the big black horse.</p><br/><p>This time the calculations took a much longer time, the beads on the abacus flicking about in a blur. She pushed them back in their places with her fingers, and then fiddled with them again. Her movements seemed erratic as if she were playing the piano without a proper melody.</p><br/><p>The indifference on her face finally gave away to irritation and finally to frustration.</p><br/><p>With a smack, she dropped her hand on the abacus, messing up the barely formed pattern. Her messy hair fluttered around her cheeks. “We will meet,” she said.</p><br/><p>After a brief silence, Ning Que asked, “Is there a chance?”</p><br/><p>“No,” Sangsang replied shortly.</p><br/><p>He had asked what was the probability of defeating the Abbey Dean if both of them joined forces.</p><br/><p>Sangsang’s answer was very clear and concise. There was no chance at all.</p><br/><p>This time Ning Que was silent for a long time. “Is there an alternative route?”</p><br/><p>“No,” answered Sangsang.</p><br/><p>After hearing the word “no” twice in a row, Ning Que did not doubt her judgment. He dismounted from the horse without hesitation, tugged on the reins and led them into the mountains. “Let’s try to hide first.”</p><br/><p>Hearing his solution, Sangsang raised her eyebrows, displeased.</p><br/><p>I am Haotian! How could I hide because of a mere human? Not to mention that the human used to be her pet dog. In fact, she had been hiding in the Snow Sea for a long time, but at that time she was able to remain steadfast. Now, it was difficult to do so, but she did not want to appear weak in front of Ning Que or show that she needed his protection.</p><br/><p>Her hand rested on her stomach by instinct and she remained silent.</p><br/><p>Ning Que did not know that at such a moment, she was still thinking of those nonsense. He quickly led the horse into the mountains until they came across a freezing lake surrounded by pine trees.</p><br/><p>“Here.”</p><br/><p>From here, they could see Helan City, which was actually quite a distance from here. In contrast, this place could hardly be seen from the outside world.</p><br/><p>Sangsang waved her leather sewn sleeve. A light flashed by in a blink of an eye followed by a breath of nature that appeared and then disappeared.</p><br/><p>Ning Que did not sense anything unusual, but he knew that she had opened up her own world. This cold lake, himself, the big black horse and the indigo lion, they were all in this world.</p><br/><p>It wasn’t long before he saw the evidence.</p><br/><p>The snow by the lake started to melt, the temperature rose gradually, and grass began to sprout in the mud.</p><br/><p>Heavy snow and frost suddenly fell on Tianqi mountain.</p><br/><p>Ning Que looked at the outside world and was amazed. The blizzard outside was raging, but it was as warm as spring here.</p><br/><p>He thought for a moment and drew out his iron knife. He chopped down some trees cleanly with his inhuman strength and built a shack by the lake without taking much time.</p><br/><p>The hut was simple and crude, but it smelled faintly of wood which could calm the mind.</p><br/><p>Sangsang rested a hand on her stomach, quietly watching him work from the side.</p><br/><p>“Let’s become one by hiding in this place?”</p><br/><p>Looking at the hut, she deadpanned, “We can’t hide forever, it’s no solace.”</p><br/><p>“Merely stealing moments in a busy life.” Ning Que continued, “A moment hidden is another moment alive…Well, let’s stop with the poems. I taught you them when you were a child. Besides, you need to rest now.”</p><br/><p>He helped her into the hut and placed her on the soft bedding. He leaned down against her bulging belly, trying to hear what was going on inside. Just as he bent down, something could be heard moving outside the hut instead.</p><br/><p>A green-clothed Taoist had appeared opposite the cold lake. His face was covered with frost, his clothes frozen with snow, and he did not know how long and how many places he had searched in the world. He peered over at the opposite end of the cold lake and did not leave even when he could not see anything.</p><br/><p>Ning Que lifted his head and looked at him for a moment. Then he lowered his head and continued to lean on Sangsang’s belly. He paid no attention to the things that happened outside. Instead he was exceptionally focused on detecting any movement within Sangsang.</p><br/><p>Sangsang did not pay attention to him. She looked across the lake and suddenly said, “I really want to kill him.”</p><br/><p>Ning Que heard the barest sign of fetal movement and was ecstatic about it. “You can’t kill him now, don’t think about it,” he replied.</p><br/><p>Sangsang said coldly, “It’s because I can’t kill him, that’s why I want to kill him.”</p><br/><p>Ning Que stopped in his tracks, thinking that it was indeed the truth. Back then, she could have killed pretty much anyone without effort, without even thinking about it.</p><br/><p>He sat up and held her in his arms, looking at the Abbey Dean across the cold lake. He remained silent as if he was watching a false world in the mirror, or a play, or a painting.</p><br/><p>It seemed absurd, interesting yet peaceful. In fact, the world he and Sangsang were currently in was the fake one, and this fake world could not be maintained all the time. There would come a time when it would be broken.</p><br/><p>When Sangsang could not sustain the world. It was probably the moment he and she left this world.</p></div>\n</div>"}