{"title": "Chapter 1092 - Peace Of Mind", "id": 1092, "volume": 11, "url": "http://boxnovel.org/nightfall-chapter-1092-peace-of-mind", "volume_title": "Volume 11", "body": "<h1>Chapter 1092 - Peace Of Mind</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>There were some leftover chicken bones scattered under the tree. Looking at the pile of chicken bones, Ning Que remained silent for a long time.</p><br/><p>The big black horse seemed anxious. It snorted uneasily and looked back at the wooden hut.</p><br/><p>Ning Que suddenly turned around and led it back to the hut. He pushed the door open and entered. The room was still pitch black, without a trace of light. It was also empty, not a single occupant to be seen. Ning Que let go of the reins and walked to the window, looking out at the sea of snow.</p><br/><p>The oil lamp on the table glowed. Sangsang gazed at him silently.</p><br/><p>He still couldn’t see her, but he knew that she was there, so he started talking.</p><br/><p>“Long Qing is dead.” He paused and continued, “I killed him… it was in North Yan. I didn’t expect it to end so easily. Originally, I had planned to oust him from his position and imprison him within the Front Gate of Devil’s Doctrine, so that he would never again taste freedom. Just like what Youngest Uncle did to Lian Sheng.”</p><br/><p>“But then I thought, that wasn’t reasonable. He didn’t actually offend me that much, except for that time when he was rude towards you and tried to threaten me with you, which ended up an empty threat. The one Lian Sheng killed was Xiaoxiao. He didn’t hurt you. I had overreacted.”</p><br/><p>Ning Que turned around and looked into the dark room. “Ever since that day by the barkless mulberry tree where I first met you, the most intense emotions that I have ever felt in my life had arose because of you. From killing grandpa at the start, and then Long Qing, not to mention that time when I first came to the City of Wei, I had fought for you quite a number of times.”</p><br/><p>Sangsang was very close to him. If the barrier wasn’t there, they might even hear each other’s breathing. Listening to his words, her expression was still stoic, but her eyelashes were slowly descending, as if she was exhausted.</p><br/><p>“I went to the Lanke Temple and sculpted many stone statues with your image.”</p><br/><p>Ning Que retrieved a stone statue from his clothes and set it on the table by the window. “I don’t know if you still remember what you said in the temple that year, while you were ill. I remember.”</p><br/><p>Sangsang looked at the table, where a likeness of herself was sleeping peacefully on her side. Curiosity glinted in her eyes.</p><br/><p>“Of course, I went to the City of Wei first. I had assumed that it carried the most significance for you and me. You might have been there, but unfortunately I couldn’t find you. Well, I killed a lot of people there.”</p><br/><p>Ning Que suddenly stopped talking. After a long silence, he said, ” I don’t wish to talk anymore. It is meaningless to cry bitterly or even to stab myself with a knife to force you out. Anyway, since I am here now…”</p><br/><p>He looked into the void of darkness in front of him. “Come out,” he begged.</p><br/><p>There was no taunting provocation, or a sentimental reliving of memories, but a calm request, just like all those years ago: for her to serve him tea, for her to pour him some water, for her to settle her feet in his lap for a good massage.</p><br/><p>In the still wooden hut, a soft, barely noticeable sound could be heard, as if the thinnest paper was sliced apart by the sharpest knife, or like the most brittle of glass falling from the sky onto the ground, shattering. Then it opened.</p><br/><p>The dim light from the lamp gradually pervaded the entire space, from the faintest speck of brightness to illuminating the entire hut, casting light on the stone statue upon the table, on Ning Que’s face and on herself.</p><br/><p>Ning Que looked at her, whom he hadn’t seen since their separation ages ago. Looking at her swollen belly, her crude animal leather clothes, Ning Que felt his heart clench. He stepped forward and wrapped his arms around her, embracing her tightly.</p><br/><p>Sangsang’s indifferent expression didn’t change even as she allowed him to hold her. Her head was held high, seemingly in arrogance, or merely in numbness.</p><br/><p>“Let go,” she whispered.</p><br/><p>The indigo lion prowled towards them from the corner of the hut. It lowered its forelimbs and crouched, as if it was about to pounce, growling warningly.</p><br/><p>The big black horse stared at it from its imposing position above, its eyes blazing with ferocity. Its meaning was clear.</p><br/><p>The indigo lion quickly stopped growling, instead turning docile and well-behaved.</p><br/><p>Ning Que held Sangsang tightly with his head buried in her neck. His voice was muffled and incoherent, yet clear. Incoherency was the tone, but clear was the meaning, there was no trace of doubt.</p><br/><p>“No.” Sangsang repeated coldly, “Release me.”</p><br/><p>“No,” Ning Que stubbornly refused.</p><br/><p>“Let go.”</p><br/><p>“No.”</p><br/><p>“Let go.”</p><br/><p>“Never. No means no.”</p><br/><p>The big black horse and the indigo lion exchanged a look. They moved to a corner unobtrusively and pretended to not see or hear anything.</p><br/><p>Ning Que wrapped Sangsang tighter in his arms, as if he could hold on to her forever, till the end of the world.</p><br/><p>No one knew how much time had passed, but fortunately it was not yet the end of the world when Sangsang finally lowered her head. Their cheeks touched each other, warmth spreading from that point of contact.</p><br/><p>After another period of silence, again luckily before both of them age into skeletons, Ning Que was finally sure that she would not disappear out of reach again. At last, he loosened his vice grip on her, grabbed her right hand, and led her to the bed.</p><br/><p>They held hands and sat side by side on the bed. If Sangsang put on her wedding dress right now, it would be like their first wedding night, and the room was where they were about to consummate their marriage.</p><br/><p>“Come home with me,” Ning Que said to her.</p><br/><p>Sangsang did not answer him, but neither did she extricate her hand out of his. Instead, she seemed to be spacing out while staring at the wind and snow outside.</p><br/><p>Ning Que knew that she was not actually distracted, because she was a god, and she was still here.</p><br/><p>“Come home with me,” he repeated.</p><br/><p>Sangsang looked at him and asked expressionlessly, ” Which home? Your earliest home?”</p><br/><p>This time, Ning Que was the one who couldn’t answer.</p><br/><p>“The Headmaster of Academy wanted to break into my world as he was motivated by his irresponsible desire for freedom. You were so persistently trying to break into my world, just because you wanted to return to that home? In fact, I have been wondering, when did you believe that breaking into my world would let you return to your hometown?” Sangsang asked.</p><br/><p>Ning Que gripped her hand tighter and thought for a moment. “In fact, I had figured it out a long time ago, because there are stars all over this place, and Teacher became the moon in the end,” he explained.</p><br/><p>Sangsang raised her eyebrows slightly and asked, “What can this explain? He became a moon because you told him about it that year, on the sea. He thought the moon was beautiful. That’s all.”</p><br/><p>“Also, it’s snowing.” Ning Que pointed out of the window and said, “There are also stars in the sky. These are all unnecessary things… If you lived in an isolated and self-contained world, you wouldn’t have the need for four seasons. But you have all of them here.”</p><br/><p>“Your world is very much like the one I came from.”</p><br/><p>He turned his gaze from the window to her. “There’s only one way to explain it. This world is still the same one I used to know, and it can be interlinked with, or can at least be observed from yours. Imitation can only be done through observation, that’s why both of them are similar.”</p><br/><p>Sangsang still looked unimpressed. “It can be observed, so I know what your world is like.”</p><br/><p>“It’s a boundless, unrestrained world,” said Ning Que.</p><br/><p>“It is a cold, dead world,” Sangsang rebutted.</p><br/><p>The warm sun spreads life, and boundless space is waiting to be explored, so this is a vast and free world. However, most of the space is filled with extreme cold and death and silence, so it is also a cold and dead world. There is nothing wrong with their statements, because they looked at the world from different perspectives.</p><br/><p>Ning Que was silent for a long time. “The fate of human beings is ultimately determined by human beings. You need not continue shouldering this responsibility. It’s too tiring.”</p><br/><p>“I told you once, I love the people, the ones that reciprocate my love. The ancestors of these people had chosen me, thus I will continue to shoulder this responsibility.”</p><br/><p>“There is no point in this discussion.” Ning Que broke off the conversation abruptly and settled his hands gently on her shoulders. “You are my wife, and you are also pregnant with our child. Please, you have to come home with me.”</p><br/><p>After watching him wordlessly for a while, she said, “You wish so fervently for me to die?”</p><br/><p>“The day you boarded that colossal vessel and sailed to the Divine Kingdom on the other shore, I wanted to do something, but I failed. You should know my attitude.”</p><br/><p>“Nonetheless, I had warned you that I am a collection of laws in this world. If you want to destroy this world, I cannot continue to exist.” Sangsang refused to make eye contact as she said this.</p><br/><p>“Back then, I was really worried, but now I’m not. There is still a Haotian in the Divine Kingdom, and now that you have become a human, you will be fine.”</p><br/><p>Sangsang looked at his face, her expression as blank as ever. “How would you prove it?”</p><br/><p>Ning Que glanced at her bulging belly. “Isn’t this proof?”</p><br/><p>Sangsang got up and walked over to the window. She looked out into the distance, words rolling off her tongue. “The New Stream has been spreading their faith worldwide for so long, while Taoism is gradually fading away. I am becoming weaker and weaker. What does this mean?”</p><br/><p>This meant that she was still Haotian.</p><br/><p>“Or maybe it’s because of… the pregnancy?”</p><br/><p>Ning Que followed and stood behind her. “Pregnant women are usually weaker, as they have two lives to sustain. Do you still remember the fat aunty in the City of Wei? When she was pregnant, she couldn’t even muster the strength to shout at people.”</p><br/><p>“But you still can’t prove it.” Sangsang turned to face him. “Therefore, I might still die.”</p><br/><p>There was no emotion on her face as she said this. It was calm, even indifferent, yet Ning Que could perceive the paralyzing fear and grief in the depth of her eyes.</p><br/><p>His heart ached for her.</p><br/><p>“I am really… afraid of death,” Sangsang said with a blank expression. “From the moment I woke up in the Divine Kingdom, I was afraid I was going to die. I don’t want to die.” She said it calmly, but her face was wet with tears.</p><br/><p>Sangsang rarely shed tears. Haotian never shed tears.</p><br/><p>Ning Que forgot how long it was since the last time he saw her cry, be it years, or decades, or even millennia.</p><br/><p>He again enveloped her in his arms and whispered, “Don’t be afraid. It’s ok, I won’t let you die.”</p><br/><p>As before, Sangsang let him hold her, her own arms limp by her side.</p><br/><p>But this time, she leaned her head on his shoulder.</p><br/><p>“Everyone wants to kill me… not only them, even you want to kill me too. Now, I am vulnerable and mortal, so I am afraid, I’m afraid that even you are going to kill me.”</p><br/><p>Her face was calm, but she was still in tears, an inexplicable sadness constricting her throat. It was hard to talk.</p><br/><p>“I won’t.” Ning Que held her tightly and said, “If you are really afraid, then we won’t do it. We will return to another home, not the City of Wei, but Chang’an. The courtyard of the Old Brush Pen Shop is still there.”</p><br/><p>“What about your home?”</p><br/><p>Ning Que shook his head. “I have forgotten about it long ago.”</p><br/><p>Home was where the heart was, where the mind was calm. Where there was peace of mind, there was home. Sangsang was his home.</p><br/><p>It was like that time, when she wanted to go to the other shore, but she couldn’t return to the Divine Kingdom. Because the other shore, to her, was where he stood.</p></div>\n</div>"}