{"title": "Chapter 1102 - Born To Be A Pair (I)", "id": 1102, "volume": 12, "url": "http://boxnovel.org/nightfall-chapter-1102-born-to-be-a-pair-i", "volume_title": "Volume 12", "body": "<h1>Chapter 1102 - Born To Be A Pair (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“It was all because of you.”</p><br/><p>“It was all your fault, the moon did nothing wrong.”</p><br/><p>“You did this, you did that, you behaved like this, you behaved like that.”</p><br/><p>These are the common conversations between teenage boys and girls, but it rarely occurred between Ning Que and Sangsang. Regardless of when they were a young man and a girl, nominally master and servant, or after they became husband and wife.</p><br/><p>When Sangsang was saying this, there was not much expression on her face, not blaming, not throwing a tantrum, more like conveying an objective fact. However, it felt like a grudge, a tantrum to Ning Que. His heart was trembling and hurting as a result of him taking pity on her.</p><br/><p>He did not know how to answer Sangsang. There was blood flowing out between the blade of the sword and his palm, pattering like a clock in that world, urging him to do something to console her.</p><br/><p>He looked at the Drunkard with calmness, like he could not feel any pain. His gaze was filled with his determined murderous aura.</p><br/><p>At first, the Drunkard launched a sneak attack, stabbing the Eldest Brother and then Sangsang, both whom he respected and loved the most, causing severe injuries to them due to his attack. It was still unknown if Sang sang could hold on.</p><br/><p>Ever since Xia Hou’s death, there was not once that Ning Que wanted to kill someone so badly.</p><br/><p>But the Drunkard did not seem to sense his gaze as he laughed crazily with his eyebrows twisted. “Could you see? She… she’s not gonna make it.”</p><br/><p>The sword in his hand was twisted simultaneously as his eyebrows were distorted. Ning Que’s palm was slashed, causing a more violent and deluging blood flow.</p><br/><p>There was an unknown number of swords in the flagon, each of them was the Drunkard’s natal. They were smelted with hard liquor for many years, therefore, extremely sharp, that his body could not even take it.</p><br/><p>Ning Que took out the iron cutlass from the back of the shoulder and slashed toward the Drunkard.</p><br/><p>The flaming and pure Haotian’s Divine Flame appeared at the tip of the iron cutlass.</p><br/><p>An oddly rich liquor squirted out from the flagon at the Drunkard’s waist, forming an immeasurably dense waterfall. The liquor flowed out perpetually, putting off the divine flame on the knife immediately.</p><br/><p>The Drunkard looked at him and said bitterly, ” So do you still think that you could do me any harm?”</p><br/><p>Ning Que stayed silent as he supported the falling Sangsang with his left shoulder.</p><br/><p>The Drunkard rubbed his palm on the sword, and slowly pierced into Sangsang’s body.</p><br/><p>Her blood flow increased, dripping on the fancy talisman thread. The thread became brighter with a faster speed, and the next moment, the talisman array would be activated.</p><br/><p>“It is too late, you shall all die.”</p><br/><p>The Drunkard stopped laughing. His cold gaze was filled with boundless murderous aura and contempt.</p><br/><p>Ning Que’s palm reached out as fast as lightning along the sharp blade of the knife.</p><br/><p>The tip of the blade cut through his palm. The sound of muscles and bone tearing apart were awful and horrific. His hands were as hard as steel like his body, hence, it sounded more unpleasant and terrifying.</p><br/><p>His eyes that were covered with blood were still blood-red, as he stared at the Drunkard like a beast. He held the Drunkard’s hand with his palm. Suddenly, there was a small metal can in his palm.</p><br/><p>Pow! Air waves fluctuated in the secret room. There was an explosion in between Ning Que’s and the Drunkard’s palm. Countless of sharp blades fluttered in the air and slit through every flesh they encountered. A sad, shrill and resentful shout was heard. Walls around the room were shattered by the shock.</p><br/><p>Ning Que’s palm was covered in blood, losing its form as a hand of a human being. The Drunkard had it worse, his hand was blown off completely. Certainly, without his hand, he could not grab a sword and pierce it through Sang sang’s body. The Drunkard’s face turned pale as his body shivered, and blood squirting out from his broken right arm. He had never been so heavily injured. He valued his life, taking every strand of his hair more seriously than the whole world. But now, he lost an arm. A whole arm!</p><br/><p>“You are a dead man,” he looked apathetically at Ning Que and said, with a deranged gaze. He took out a sword from the flagon with his left hand once again.</p><br/><p>Ning Que’s psyche power was almost drained, unable to fight anymore. However, he must fight. He looked at the sword on Sangsang’s belly.</p><br/><p>The Drunkard’s blood and flesh remained on the handle of the sword. A flow of liquor fell from above, washing away all stains on it, and it looked brand new again.</p><br/><p>“Thinking about using the Light’s Doctrine’s disgusting method?” The Drunkard looked at him emotionlessly and said, “Don’t you even think about it!”</p><br/><p>A soft sneer sound was emitted. The sharp potted sword thrust into Ning Que’s chest on his left. It did not get to pierce through him thoroughly, but his lung was badly wounded.</p><br/><p>Ning Que coughed painfully as blood spurted from his mouth. But he was pleased because he felt the powerful change of the breath of Heaven and Earth under his feet and he could even feel its warmth clearly, a proof of the talisman array being turned on.</p><br/><p>A majestic ray of light emerged from the talisman thread on the solid rock surface, enveloping Ning Que, Sangsang, the big black horse and the indigo lion dog in it.</p><br/><p>The Drunkard’s facial expression changed as he held the sword with his left hand, and drew a trace that was almost against the rule of physics, bypassing Ning Que’s body, aiming between Sangsang’s eyebrows.</p><br/><p>At this instant, Ning Que had no energy to fight anymore and Sangsang could barely stand with the support of his left shoulder. Who could stop the Drunkard’s all-in attack?</p><br/><p>No one. But it could be paused.</p><br/><p>A firm yet solemn lion roar that was suppressed for a long time echoed in the whole city of Helan!</p><br/><p>The indigo lion transformed into a ray of light and crashed onto the side of the potted sword!</p><br/><p>Two shades of dark shadow kicked out from the ray of light like lightning, hitting the Drunkard on his chest heavily!</p><br/><p>The Drunkard missed his target and dealt with a heavy blow again. He hummed, and retreated backwards due to the attack!</p><br/><p>The ray of light became brighter, and the silhouettes in it quickly weaken!</p><br/><p>The Drunkard’s face became more pale; he was clear what it meant to let Haotian escaped alive. He would never allow himself to let go of this opportunity.</p><br/><p>A loud roar broke through the broken walls of the secret room, spread through the sky.</p><br/><p>The Drunkard was standing at the same spot but he became much bigger, doubling his size by hundreds, thousands and even more!</p><br/><p>Loud sounds of banging never stopped!</p><br/><p>The secret room was shaken by the vibration, collapsing the tower. The whole city of Helan was collapsing!</p><br/><p>Smoke and dust drifted in the air as a result of the quake, slowly covering the sky above the alley.</p><br/><p>The Tang troops who had retreated from the city of Helan a while ago, turned their gaze toward the place they battled and lived, witnessing the scene which appeared like divine manifestation of God’s punishment. They were out of words for being shocked.</p><br/><p>The smoke and dust started to fade away after half a day had passed.</p><br/><p>The city of Helan that was once magnificent was left with only half of its broken pieces, looking extremely desolate.</p><br/><p>The hidden transmission array in the secret room was destroyed along with the collapsed town.</p><br/><p>Other than ruins, stones and pillars, there was no trace of living human.</p><br/><p>…</p><br/><p>…</p><br/><p>Sangsang looked at the wall paintings around her, and found them rather familiar. She remembered it after a while that the Divine General Golden Dragon on the paintings were the divine manifestation of her will revealed in the mortal world.</p><br/><p>This was a Taoist palace.</p><br/><p>The big black horse and indigo lion were by her side, but Ning Que was not.</p><br/><p>She looked at the bubble in front of her. She was able to locate herself by observing the glittering dots on the bubble. She was in a Taoist palace in a city of Song Kingdom. The Song Kingdom, as the starting point of Taoism, did actually have a transmission array.</p><br/><p>She got the whole picture of the incident solely by bending her fingers. The reason of her not being able to return to Chang’an from Helan was because the transmission array was affected by the Drunkard’s countless attack the moment it was turned on. The Qi of Heaven and Earth were changing too vigorously, hence she was sent to the Song Kingdom by the array.</p><br/><p>Similarly, this was why Ning Que could not be here together with her. She checked on Ning Que’s location beforehand, knowing that he was doing fine before she could stop herself from worrying, and felt relieved.</p><br/><p>Suddenly, she started to frown.</p><br/><p>She looked at the sword on her belly, and made sure that the intermittent pain was not coming from that, but somewhere deeper within her stomach, probably from the d*mn fetus.</p><br/><p>She was tired, so she slowly sat on the floor. There was still not much expression on her pale face, but her galaxy-like eyes seemed to be filled with helplessness and anxiety.</p><br/><p>The indigo lion dog wandered and looked around, not knowing what had happened to its master.</p><br/><p>The big black horse was very anxious as its eyes widened. It lived for a longer period of time in the human society, so it could tell that the master would be giving birth soon. It neighed softly as he ran out of the Taoist palace.</p><br/><p>Then, the noise of someone talking and walking outside the palace were heard.</p><br/><p>Sangsang leaned against the pillar and sat down exhaustingly. Sweat was dripping from her temples, as she was tortured by the blood and pain due to the sword. She felt worse when that feeling was combined with the deep and intermittent pain from within her abdominal.</p><br/><p>“Who is it?”</p><br/><p>More than ten divine priests and deacons walked into the palace. They were extremely shocked to find a pregnant woman covered in blood, settling in the solemn and sacred main palace.</p><br/><p>Relating it to the emerging New Stream in the town and sayings of how dirty fetus blood from a pregnant woman was, the officials and deacons thought they guessed the truth right.</p><br/><p>The New Stream is trying to profane Haotian whom the Taoist worshipped!</p><br/><p>“Evil!”</p><br/><p>A holy, elderly divine official ran and stood before Sangsang angrily. He pointed at her face and shouted, “I am going to burn you to death! You shameless bitch!”</p><br/><p>Sangsang was resting with her eyes closed. When she heard the voice, she tried very hard to open her eyes and watched the humans who were surrounding her with horrible facial expressions. She startled for a moment until she realised that those people were scolding her.</p><br/><p>She stayed quiet, silent. She was familiar with the palace. She came across a lot of Taoist palace when she was at the divine kingdom, even the unfrequented palace in the kingdom was designed and built sampling the palace in the mortal world, it was just fancier and more pure.</p><br/><p>She was also very familiar with the Taoist priest. She was worshipped by countless generations of divine officials and Taoists. She once thought that humans were the most devoted believer of hers, which was why she designed the Divine General according to the image of a human.</p><br/><p>Now, she was lying in the temple, covered in blood, and humiliated by the Taoists with mean and rude words. Yes, she was no longer Haotian.</p><br/><p>A lion roar echoed in the palace. The indigo lion suddenly became bigger, and turned into a mighty indigo-coloured, huge lion. It fixed its gaze at the Taoists and waited for its master’s order.</p><br/><p>There was no way that the divine officials and Taoists could have ever seen scenes as such. They collapsed, and could not even get back up due to immense shock.</p><br/><p>Sangsang closed her eyes again without saying a word.</p><br/><p>The indigo lion understood and ignored the Taoists who were crawling out of the palace.</p></div>\n</div>"}