{"title": "Chapter 1106 - A Sword (I)", "id": 1106, "volume": 12, "url": "http://boxnovel.org/nightfall-chapter-1106-a-sword-i", "volume_title": "Volume 12", "body": "<h1>Chapter 1106 - A Sword (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The Drunkard’s slightly pale face was painted with faint remorse.</p><br/><p>He had spent a major amount of Psyche Power back when he fled a thousand miles. Little did he know that the opponent was merely using an ordinary arrow. To be able to shoot an arrow so accurately from a conservative estimate of a hundred miles away, his skill was inconceivable and extremely terrifying. However, despite his proficiency in archery, it was but an ordinary arrow.</p><br/><p>The Thirteen Primordial Arrows were what he feared and had been avoiding. Had he known in advance that it was only an ordinary arrow, he would not have to act so prudent. He could dismiss it with a simple hand wave.</p><br/><p>Sangsang looked at him silently with no hint of mockery on her face as she uttered two other digits.</p><br/><p>It was a new set of digits.</p><br/><p>A buzzing squeal echoed before an arrow penetrated through the night sky, aiming directly to the Drunkard’s throat.</p><br/><p>This arrow acted faster than the previous one as the archer was getting nearer to the small town. The interval between the two shots was barely a fraction of a second. Yet, the person managed to dash off and created a great distance between himself and the small town.</p><br/><p>He was now 50 miles away from the small town.</p><br/><p>…</p><br/><p>The rumbling of the thunder from miles away resonated across the small town. If one had not heard of the bang of the air collision resulted from a dash, one would have thought that the rainstorm, that had ceased a while ago, had moved miles away and progressed into a thunderstorm.</p><br/><p>A faint light glimmered in the painting and calligraphy shop in the small town. Chao Xiaoshu looked calm, as if he had nothing on his mind. Meanwhile, Zhang San and Li Si exchanged looks. They could sense the uneasiness in each other’s eyes, but they were clueless about what to do.</p><br/><p>The big black horse, that was hiding in the dark, became restless as it heard the thunder. It lifted its hoofs several times, wanting to sprint out of the town to give aid. But, it stopped as it realized that the person was coming at a faster speed than it was able to achieve.</p><br/><p>The arrow had arrived before the person.</p><br/><p>The roaring of the thunder deadened the noise that came from the shooting arrows as they pierced through the sky.</p><br/><p>An arrow precisely punctured the Drunkard’s throat, making a rather indistinct sound.</p><br/><p>This time, the Drunkard was watching attentively. He gently waved his arm and hit the arrow with his sleeve. A soft unfocused ripping of the cloth was heard as the arrow made a slit on the big sleeve of the green scholar robe. However, the arrow was nowhere to be found.</p><br/><p>Judging from the power of the arrow, he could deduce that Ning Que was merely miles away, very close to the town. However, the third arrow came before he managed to respond.</p><br/><p>This arrow moved slower than the two previous ones. Therefore, he was able to take a better look at it. However, the sharp image seemed to be rather realistic. The spinning arrow appeared as if it was going to rip off everything that was in its way as it travelled along its versatile track!</p><br/><p>The Drunkard revealed his left hand that was hiding underneath the sleeve before. With a fillip, a clear light curtain was formed before him.</p><br/><p>A muffled puff resonated.</p><br/><p>The arrow fell in front of him before it eventually dropped into the puddle of fouled water on the ground. It resembled a dead swan as it was no longer agile as before. Instead, it was only a stiff and lifeless object now.</p><br/><p>The Drunkard gently lifted his brows as he finally realized the greatness of this arrow.</p><br/><p>Eventually, Ning Que appeared. He stood at the end of the long street of the small town.</p><br/><p>His body was covered in blood that had already clotted. However, his wounds dehisced as he ran and caused fresh blood to gush out of his wounds. The fresh blood blended with the grume, together with the sand and dust that he accumulated during his 8000 miles of journey, made him look filthy. He now resembled a poor beggar who was beaten up repeatedly by his peers, just like what Long Qing used to be.</p><br/><p>He came running from thousands of miles away. He had not taken any rest and had messed up his biological clock for the past two days one night in spite of his injuries. He was on the verge of breaking down. Yet, like the unbudgeable Min Mountain, he stared at the Drunkard silently with the steel bow in his hand.</p><br/><p>The Drunkard looked at Ning Que, then the nocked Steel Arrow on the steel bow. Gradually, his frightened expression began to take shape as his face turned slightly pale. Following a howl, he vanished abruptly and went to a hundred miles away.</p><br/><p>The next moment, he had returned from a hundred miles away and presented himself in front of Sangsang. He extended his finger and pointed at Sangsang’s glabella.</p><br/><p>The mane of the indigo lion, that had always stayed by Sangsang’s side to protect her, shot out like arrows. The ferocious roar of the lion reverberated through Heaven and Earth, causing the tiles to fly heedlessly across this dead and quiet town.</p><br/><p>The Drunkard began to glow as a clear light was emitted around his body. Carrying infinite Qi of Heaven and Earth, his finger poked through the clear light. With a single finger, he destroyed uncountable numbers of sharp arrow-like manes and tiles as he aimed accurately at the top of the indigo lion’s head.</p><br/><p>The indigo lion roared hysterically as the vajra bloodthirstiness, that was congealed from the Buddhist breath, spouted between its lips. However, just like the mane and tiles, it was incapable of stopping the Drunkard’s finger.</p><br/><p>Following a furious roar, blood was splashed everywhere as the indigo lion retreated.</p><br/><p>Sangsang turned her wrist and the abacus scattered in an instant. Tens of beads broke and shot across the sky. The beads went through the beam of clear light and fell on the Drunkard’s chest, making a series of intensive thuds.</p><br/><p>A trickle of blood dripped down from the corner of the Drunkard’s lips, yet his lightspeed pace was undisturbed. He continued to aim at her gabella and was determined to kill her. He paid no heed even when the talisman, that was written with beads, started to spread Talisman Intent.</p><br/><p>The touch had arrived before his finger. The inconceivable amount of the Qi of Heaven and Earth flowed through the Drunkard’s finger as it poked… no, struck Sangsang’s glabella.</p><br/><p>He actually discarded the potted sword this time.</p><br/><p>Sangsang’s face turned deathly pale. Back when she encountered such merciless attack, she could deal with it with just one glance. But now, she needed a helping hand from the others.</p><br/><p>Fresh blood trickled down the corner of her eyes and made her appear extremely terrifying.</p><br/><p>The Drunkard proceeded to move forward. In actual fact, he was able to kill Sangsang in just a moment.</p><br/><p>Unfortunately, he was late by a mere second. Ning Que’s arrow arrived before him. However, it was no longer an ordinary arrow. Instead, it was a Steel Arrow this time.</p><br/><p>The Drunkard retreated instantly to hundreds of miles away. A moment later, he returned.</p><br/><p>He looked at the wound on his left shoulder, that was left by the Steel Arrow, as his blood dripped on the floor and blended into the puddle of dirty water. He stayed silent for a brief moment before he lifted his head to stare at Ning Que who was already beside Sangsang.</p><br/><p>He stood at the end of the street, approximately tens of feet away from the destructed teahouse, yet not far away from the painting and calligraphy shop.</p><br/><p>He was determined to kill Sangsang in the earlier moment as Ning Que’s Steel Arrow created a great trouble for him. His face revealed no anxiety despite his failure as he must stay calm.</p><br/><p>The only way for him to dodge Ning Que’s Steel Arrow was complete peacefulness.</p><br/><p>He reached out to pat at his right shoulder to toss the blood onto the floor, as if he was dusting his shoulder off.</p><br/><p>Ning Que’s Steel Arrow came again.</p><br/><p>As the Drunkard had perceived the next moment of Ning Que’s finger before the Steel Arrow left the bow, he made an advanced move.</p><br/><p>A muffled bang resonated.</p><br/><p>A clear track of arrow appeared on the long street. The rain had stopped only a short while ago. The newly condensed water vapour misted the dark long street, in the meantime, reflected the dim light from the painting and calligraphy shop and gave out an eerie feeling.</p><br/><p>The Drunkard returned to the street. He removed the wine bottle that was hung around his waist, brought it to his lips and took a couple of big gulps. He was oblivious to the wine that was dripping all over his body. Then, he stared silently at Ning Que and slowly took out a sharp sword from the bottle.</p><br/><p>The Steel Arrow came again. He dodged it again. Then, he returned again.</p><br/><p>He looked at the quiver on Ning Que’s back and asked a crucial question: “How many more Steel Arrows do you have?”</p><br/><p>Ning Que didn’t answer his question. The calmness on his face, which was covered in dust and blood, was staggering.</p><br/><p>He was not at Chang’an. Therefore, he could not borrow the great power from the God-stunning Array. Meanwhile, Sangsang could no longer support him with endless Haotian’s Divine Flame like how she used to do it before.</p><br/><p>There was no legacy from the elders and no enlightenment from Haotian. He was left on his own.</p><br/><p>The Drunkard didn’t expect any answer from Ning Que as he knew that Ning Que had one steel arrow left. He was a step away from the victory.</p><br/><p>Most importantly, he had confirmed that Ning Que’s arrows were unable to shoot him at all.</p><br/><p>Ning Que continued to shoot with normal arrows.</p><br/><p>The arrows made a shrill sound as it flew passed the sky above the small town. The whistling of the arrows was intense and appeared to have absolutely no pause.</p><br/><p>Swoosh!</p><br/><p>Sizz!</p><br/><p>Puff!</p><br/><p>The arrow left the bow and was propelled at a terrifying speed, targeting accurately at the Drunkard. The arrows perforated the atmosphere and tore the night sky into half, while the dusky town was almost lit up by the glint of the many arrows.</p><br/><p>Like a spirit, the Drunkard moved freely between the rain of arrows as he waved his sleeves gracefully.</p><br/><p>Regardless of how fast and accurate Ning Que’s arrows were, he was not able to shoot him.</p><br/><p>It was all because of his rapid reaction.</p><br/><p>…</p><br/><p>The street was silent. There were arrows everywhere. There were arrows that stuck obliquely on the broken eave of the pawnshop. There arrows that stuck deep into the stone steps of the rice shop. Cracks with the shape of spiderweb appeared when the arrows hit on the green flagstone.</p><br/><p>To be able to hit the flagstone by the arrow, one could conclude the power of Ning Que’s shooting skill. Yet, his skill failed to help him to take the Drunkard down.</p><br/><p>Ning Que held his pose as he drew the bow and aimed at the Drunkard in silence. He did not release the bowstring. His arms were exhausted after the excessive shootings from before and were trembling indistinctly.</p><br/><p>There were only some ordinary arrows and a Steel Arrow left in the quiver on his back.</p><br/><p>The Drunkard looked at him expressionlessly and said, “Shoot me if you can.”</p><br/><p>Ning Que did not reply. It was a fact that he was unable to shoot him.</p><br/><p>The Drunkard laughed at Ning Que’s wordlessness. His laugh was filled with mockery and total disdain as he said, “Go ahead.”</p><br/><p>Ning Que did not shoot. Nor did he put down the steel bow.</p><br/><p>He was waiting. He was waiting for the moment when the Drunkard was no longer able to travel back and forth within seconds.</p><br/><p>The Drunkard stood in front of the painting and calligraphy shop. Filtered by the paper on the window, the dim and slightly mottled light from the shop was cast on his face. It appeared like the leaves that stubbornly hung on the branches in the autumn and were later soaked in rainwater for a few days.</p><br/><p>All of a sudden, a powerful array intent was released from the mottled beam on his face.</p></div>\n</div>"}