{"title": "Chapter 1116 - Building A New World (I)", "id": 1116, "volume": 12, "url": "http://boxnovel.org/nightfall-chapter-1116-building-a-new-world-i", "volume_title": "Volume 12", "body": "<h1>Chapter 1116 - Building A New World (I)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Breaking this fallen old world and building a magnificent new world was easier by saying. In fact, it was the most significant task for “world.” On the other hand, it had always been the most important thing for the people in this world. Hence, regardless of destroying the old or building the new, it had become the most remarkable event.</p><br/><p>The most important thing was always the most difficult one to be done. What the Abbey Dean did, no one had done before. The same thing happened to Ning Que. Few years ago, Lian Sheng only had this simple yet gruesome thought, but he had never taken any practical action. Despite being well prepared, he had no idea how to commence the task.</p><br/><p>Indeed, he had been preparing for many years. The years he spent was a big part of his lifespan. But, it was ironically lacking for him to carry out the grand mission of destroying the world. And eventually, he did not make a firm decision. It was because god represented the old world was now in his embrace.</p><br/><p>The perishing of the old world meant definite death for Sangsang. Since many years ago, they had been discussing about this question. However, they could not find an alternative way to solve it. Therefore, they had been loving and fighting each other till now.</p><br/><p>Save the world with Sangsang’s death? Ning Que would not do that. If he was moral madman or someone who killed for righteousness, he would not have escaped while he carried the severely ill Sangsang with his hands drenched in the blood of the innocents.</p><br/><p>He remembered a famous poem from that world.</p><br/><p>“Life is dear, love is dearer. Yet, both can be given up for freedom.”</p><br/><p>If it was Jun Mo, he would surely give up his life for freedom, while Ke Haoran had already given it up. If for Ye Hongyu, she would definitely give up her love for freedom and Lian Sheng had already done that.</p><br/><p>However, Ning Que did not want to sacrifice any of them. He had always been a greedy and shameless man. To be more precise, he was stingy. Stuck in his mind was another famous poem from the world.</p><br/><p>“Is it possible that I can do both, to not disappoint the Buddha and my love.”</p><br/><p>Except the real compassionate monks from Lanke Temple, he was similar with Second Brother, not having any interest in Buddhism at all. And hence, the word “Buddha” in this poem had to be changed to “human world.”</p><br/><p>How can I not disappoint both the human world and Sangsang? Ning Que had no idea.</p><br/><p>Sangsang was lying in his arms. Suddenly, she extended her arms to hug him. She hugged him tightly. The golden dust exuded from the body and the faint silhouette intertwined with the two bodies. For this moment, it was impossible to separate them.</p><br/><p>A ray of warm energy entered Ning Que’s body. His Psyche Power was initiated. Via the Core Vajra of the Array in his hand, it was spread to the entire human world from Chang’an.</p><br/><p>“Let’s try. It may be successful,” Sangsang leaned against his chest and said with her eyes shut.</p><br/><p>Just like many other times, no matter if they were at Min Mountain, City of Wei, Chang’an, and West-Hill, no matter if she was a servant or Haotian, she was always the final decision maker.</p><br/><p>She had made up her mind. But today, Ning Que was no longer obedient as before.</p><br/><p>“You will die.” Sangsang shut her eyes and replied calmly, “You have been staying by my side for many years. That is more than sufficient.”</p><br/><p>After a brief silence, Ning Que said, “Do you not fear?”</p><br/><p>Sangsang answered with a slight tremor in her voice, “I am frightened.”</p><br/><p>Ning Que gave a faint smile and said, “Then I will stay with you.”</p><br/><p>Sangsang opened her eyes and looked at him, wanting to speak.</p><br/><p>Ning Que looked at her and said calmly, ” As I told you at the hall of Lanke Temple, I don’t want to live anymore if you die. So, let me die along.”</p><br/><p>Sangsang pondered for a while and said, “Can we meet again in the next life?”</p><br/><p>Ning Que asked with a grin, “When was the first time we met?”</p><br/><p>Sangsang was puzzled as she asked, ” Wasn’t it the day that you picked me?”</p><br/><p>“No, it was on that day you were born…” Ning Que continued, “It was inside the woodshed of Official of Counsel’s residence where I hid inside a well after I killed the steward and young master.After a very long time, I gathered my courage and climbed out of it. I was hungry and looking everywhere for food. Then… I saw you.”</p><br/><p>“Oh, I see.” She looked perplexed.</p><br/><p>“In Red Lotus Temple, I was hiding beside the wagon when I was almost killed by Long Qing. Meanwhile, you were sitting inside the wagon. We were separated by a wall and were only half a step away from each other. I always think that when we are born in our next lives, we will only be separated by half a step too. Then, it will be convenient for me to search for you. I always have the confidence to meet you again in my next life.” Ning Que said, “Because we are destined to stay together forever.”</p><br/><p>Sangsang said, “This is the most old school yet the most touching words of love.”</p><br/><p>Ning Que planted a kiss on her forehead and said, “As long as you’re willing to stay with me.”</p><br/><p>She believed in destiny and was willing to stay with Ning Que. “I will stay with you.” Sangsang answered him with a smile as tears pooled up in her eyes. She had forgotten how many times she wanted to shed tears after her arrival at the human world. And, it seemed to be relevant to this man almost every time.</p><br/><p>Ning Que asked, “Are you still afraid?”</p><br/><p>Sangsang answered, “I am still afraid. But, I’ll be fine as long as I’m with you.”</p><br/><p>…</p><br/><p>She was weak, but she was still Haotian. When she decided to do this, the whole human world could feel her willpower. More accurately, Ning Que was the one who delivered her willpower to human world.</p><br/><p>They cuddled each just like that night from many years ago. Back then, they had only returned from Kaiping Market. It was Ning Que’s first time to see a book about cultivation, namely Article on the Response of the Tao. Then, he fell into a deep sleep with Sangsang in his arms as usual. Later, he had a dream about an ocean. That was Ningque’s Initial Awareness State. As long as Sangsang was in his embrace, he would be able to perceive the whole world. At the same time, the whole word could perceive him as well.</p><br/><p>…</p><br/><p>The cliff in front of the Divine Halls of West-Hill had become a sea of blood. Xiong Chumo and He Mingchi had died. The people Ning Que requested to be killed had already died. The middle-aged priest stood in front of the stone cottage on the cliff, appearing rather lonely. Ye Hongyu and Cheng Lixue stood in front of the Divine Halls of West-Hill while the enormous crowd knelt down on the cliff.</p><br/><p>The fight between the Academy and Taoism had at least had a result in the common world. But right before that, the sky and ground demonstrated weird phenomena and drew the attention of the crowd.</p><br/><p>The people saw the descending clouds of East Sea, the burning sun, the horrifying light beam on Chang’an City gate and the lava-like light that was flowing continuously like a waterfall.</p><br/><p>Then, a blinding light shone. The light was glaring. Other than a powerful person like Ye Hongyu, no one could see the human world clearly anymore.</p><br/><p>Even Ye Hongyu and the middle-aged priest were squinting their eyes. The wind had swiped Sangsang’s willpower to the field. The middle-aged priest understood that she had been reincarnated. He was overwhelmed with sentiment.</p><br/><p>Thank you for protecting the human world for thousands of years.</p><br/><p>Ye Hongyu, too, understood what was happening. He furrowed his thin brows and said, “A pair of idiots.”</p><br/><p>Mo Shanshan stood behind her. With a pale face, she remained silent.</p><br/><p>The Butcher in the small town had put down the knife but Jun Mo was still holding the iron sword.</p><br/><p>This was the biggest difference between the two of them. The Butcher knew that this war had developed to a point where he was not able to interfere anymore. Therefore, he decided to quit.</p><br/><p>On the other hand, Jun Mo thought that if Youngest Brother and that girl died without defeating the Abbey Dean, then this was his turn to fight.</p><br/><p>At the Wilderness of Tianqi Mountain, a yellow skirt was waving along the wind. Yu Lian was heading to North without sparing a glimpse for Chang’an.</p><br/><p>…</p><br/><p>No one could command the entire human world. The Headmaster of Academy was no exception. He was merely representing the human world to fight silently against Haotian for a thousand years.</p><br/><p>What Ning Que had to do was to perceive, then attempt to guide the entire human world’s willpower.</p><br/><p>What kind of willpower is it?</p><br/><p>The sun was burning as the Divine Kingdom that was situated in deep side of sky began to turn clearer. Heaven and Earth beamed, creating a glaring daylight had never happened before, to the extent that the blue sky had almost turned pure white.</p><br/><p>The light was blinding. Only a minimal amount of people could keep their eyes opened.</p><br/><p>The light was scorching. The whole human world was covered by extreme heat. The water of the Great Swamp evaporated, the South Sea was rippled and the remnant of snow melted. In the aflame forest, song of cicadas cried out suddenly. The Snow Sea at Cold Arctic started to thaw!</p><br/><p>It was too hot. The heat stopped one from sweating and breathing.</p><br/><p>Chang’an was constantly attacked by the light beam from Divine Kingdom. But luckily it was protected by the God-Stunning Array, it was relatively safer than the world outside the city. At the very least, the people were able to open their eyes even though the heat was scorching.</p><br/><p>Li Yu and the Prince of Great Tang Prince were at the Imperial Study. Her clothes were soaked in sweat and her breathing was getting heavier. She held her brother’s hand, walked to the window and opened it.</p><br/><p>Elder Chao and Shangguan Yangyu were sitting face to face in Spring Breeze Pavilion of Chao Residence. Both of them were half naked, exposing slender and not so attractive body as the heat was extremely unbearable.</p><br/><p>“I can’t take it anymore.” With the help of the clutch, Elder Chao stood up. He opened all the windows in the room and watched lava-like light falling like a waterfall. He cursed angrily, “F*ck. Are they trying to kill us with this heat?”</p><br/><p>The human world was experiencing both winter and summer simultaneously.</p><br/><p>Regardless of the location, at the riverbank or the seashore, and the presence of the wind, no one could escape from this heatwave. The entire world had turned into an iron house. Meanwhile, fire was burning outside the house, causing the interior of the house to be extremely warm and stuffy.</p><br/><p>Willpower was a thought. It was what a person intended to do.</p><br/><p>Now, everyone in this world craved for a cooling breeze and wanted to open all the doors and windows in the house. If it was iron house that had no windows, the people would have no choice but to break it open.</p><br/><p>Ning Que could perceive the thoughts of hundreds of millions people and knew that this was the human world’s willpower.</p><br/><p>An avalanche of Psyche Power from everywhere headed to Chang’an and entered the God-Stunning Array. Ning Que could not sustain such a high level of Psyche Power. Sangsang received the Core Vajra of the Array from his hands. That tremendous momentum of Psyche Power from human world entered her body through the Core Vajra of the Array.</p><br/><p>She was Ning Que’s natal item. Ning Que had what she had.</p><br/><p>In front of a cliff’s cave, the clothes of Bookman was drenched in sweat. But he sensed nothing, as he continued to daydream and ponder the Abbey Dean’s words from before.</p><br/><p>Scholars are useless? The useless ones are the scholars? The Bookman got angrier and more disappointed as he dwelled in his thoughts. He extended his hands angrily and swept all the books on the table to the floor. However, those books fell off the table but did not hit the floor. Instead, they floated in the air. Inside cliff’s cave, the books had also left the bookshelves and were floating in the air.</p><br/><p>“Oh, I see.” The Bookman understood what was happening and flashed an innocent grin on his old and weary face. He finally felt relieved. “Let him go. Let him know that the words come with power.”</p><br/><p>The uncountable number of books left the Academy and flew to the wall of Chang’an like a flock of birds.</p><br/><p>The Academy was filled with vast accumulation of books, from ancient literature to secular popular books like The Miscellaneous Notes of Two Jing. The number was too high to be counted. The books were now making a complete round outside Chang’an.</p><br/><p>“The useless ones are the scholars. Is that what you said?” Ning Que looked at the Abbey Dean and said, ” I write a word and show you.” Before he finished his words, he lifted his arm to grab an invisible pen.</p><br/><p>Where is the ink? If he intends to write a grand word, how much ink is required?</p><br/><p>The books, that were floating around the Chang’an, abruptly fused together.</p><br/><p>Those were books, not papers. Books were the work of words and papers. There were words on the books. The words were written with ink. Uncountable books contained uncountable ink-written words. Ning Que wanted to use the remaining ink inherited from many predecessors.</p></div>\n</div>"}