{"title": "Chapter 1112 - The Fall Of West-Hill (II)", "id": 1112, "volume": 12, "url": "http://boxnovel.org/nightfall-chapter-1112-the-fall-of-west-hill-ii", "volume_title": "Volume 12", "body": "<h1>Chapter 1112 - The Fall Of West-Hill (II)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was unbelievable that the Divine Halls of West-Hill had decided to surrender. The entire Peach Mountain was up upon hearing the news. The sound of crying and cursing was everywhere on Peach Mountain, however, Yu Lian had placed an order on behalf of the Academy, stopping them from surrendering.</p><br/><p>This had made it even harder to believe. The next moment, the entire Peach Mountain turned into a total silence. The middle-aged priest frowned at Yu Lian for a long while. He then asked in a raucous voice, “Why?”</p><br/><p>From the perspective of the Divine Halls of West-Hill, there was no reason for the Academy not to accept their surrender because Taoism was still as strong as it used to be.</p><br/><p>Well, more precisely, ever since Xiong Chumo’s trace was revealed by Yu Lian few years back at the back hill of the Academy, he was severely injured after getting beaten up by Yu Lian. Thereafter, the boundless radiance could no longer cover up his littleness under the divine gown. With Abbey Dean leaving Peach Mountain and Ye Hongyu dropping into the Abyss, she could no longer suppress his inner fear. She could not understand what was happening to her surroundings. “Why would Haotian give up on Taoism or why would Taoism leave him?”</p><br/><p>After going through a long while of inner struggle, Xiong Chumo had finally decided to surrender in order to keep himself alive because with his capabilities, he was expecting that the Academy or the Great Tang would grant him a specific position, which was their culture ever since. There were several Divine Halls moguls including Zhao Nanhai who got either convinced or suppressed by him. The same response was expected from the middle-aged priest.</p><br/><p>Yu Lian was assuming that the Divine Halls of West-Hill had gone through complicated process and even a bloody war, but if he was to think carefully, she could have realized the source of the issue. Upon listening to the words coming out from the middle-aged priest’s mouth, she directly declined his offer without any consideration. Why?</p><br/><p>Yu Lian did not answered the middle-aged priest’s question because she did not have to.</p><br/><p>The Divine Halls would definitely come up with several conditions along with their surrender. For example, they wanted Xiong Chumo alive, or the middle-priest, or Zhao Nanhai, or He Mingchi, or others to be alive. However, Yu Lian herself and Ning Que, who was not on the scene would never accept any above conditions and therefore, she would not allow them to surrender.</p><br/><p>Her yellow skirt and her black ponytail were swinging slightly along with the morning wind. However, she was keeping her hands behind her back. The middle-aged priest felt a little cold looking at the Grandmaster with a little girl look.</p><br/><p>When there was no surrender, then a war was meant to arise. Eventually, someone was about to put an end in this thousand years continuation war between the Academy and Taoism. On top of the hill, there were countless of people staring at the giant sedan.</p><br/><p>The figure of the master inside the carriage was as tall as he was ten years ago.</p><br/><p>At the critical moment, he was the spiritual support or tens of thousands in the Divine Halls of West-Hill. There were still plenty of powerful fighters on top of the hill. If the master could fight against Yu Lian, then there was still hope for the Divine Hall.</p><br/><p>No matter which of them won this thousand years continuation war, it would definitely be a magnificent one. It would be completely normal if the war would last for a long time, even though they were to fight from sunrise until sunset.</p><br/><p>Fourth Brother placed the hourglass on top of a rock because it had become his habit to arrange his strategy using math. Hao Tian lighten up an incense in the Divine Hall to calm themselves.</p><br/><p>The flowers on Peach Mountain had started to bloom. Under the attention of the people, Ye Hongyu walked towards the cliff and stared at the giant divine chariot in front of the Divine Hall. As the wind blew, his crimson red color judgment divine gown swung in the air.</p><br/><p>She did not have to say a word because everyone knew the meaning reflected. Everyone on Peach Mountain was stunned.</p><br/><p>She was going to raise a fight with Xiong Chumo.</p><br/><p>The giant figure inside the giant sedan was sitting still.</p><br/><p>Zhao Nanhai was standing right in front of the sedan with a dim look on his face.</p><br/><p>This Great Divine Priest of South Sea was still a well-known top fighter. He was definitely capable to fight against Ye Hongyu.</p><br/><p>There were over ten powerful fighters from the South Sea standing right behind Zhao Nanhai, including two fighters with Knowing Destiny State.</p><br/><p>The fighters from the Academy were Yu Lian, Ye Hongyu, Chen Pipi, and Tang Xiaotang.</p><br/><p>The middle-aged priest took a glance at Yu Lian and walked back to the giant sedan.</p><br/><p>In terms of the numbers and the qualities of powerful fighters, the Divine Halls of West-Hill was not as weak as they had thought. However, their fighting will was weaker as compared to the enemy.</p><br/><p>Yu Lian understood the meaning indicated by the middle-aged priest during the eye-to-eye contact just now. However, she did not care about it. There was none expression on her face as she did not want to explain what would be the “true power.”</p><br/><p>According to her extend of recognition, Jun Mo, Youngest Brother, and Ye Hongyu were equally powerful. Since she was dying to fight, then the results shall be within expected.</p><br/><p>She even felt that the war would be boring. Therefore, she glanced towards the north once again just like before, as if there was something worth paying attention to.</p><br/><p>A cold wind arose, blowing into her eyes, causing her to frown.</p><br/><p>The Divine Kingdom was still a distance away from the East Sea, but the wind was blowing from the sea direction and it would usually be the East Wind, just like the wind blowing in the morning previously.</p><br/><p>However, the wind that was blowing towards their face was coming from far north.</p><br/><p>Yu Lian’s expression slightly changed. Her delicate face turned a bit pale. She turned around and stared at the giant sedan in front of the Divine Halls. She swung her black ponytails, marking two shadows in the dark sky.</p><br/><p>Her Youngest Brother and Sister were shocked when they realized her emotion issue.</p><br/><p>“Madam. What happened?” asked Tang Xiaotang.</p><br/><p>“I am leaving,” said Yu Lian. She was calm when she came out with the words. She was not shivering at all, but all of them could realize her anxiety and anger.</p><br/><p>The great battle was about to start. However, as the most powerful senior in the Academy, she was leaving. But why? What about the fight that was going to start later? The Academy and the Great Tang was about to withdraw from achieving their absolute victory?</p><br/><p>Yu Lian’s sudden decision was beyond everyone’s expectation. However, none of them disagreed with her because they had predicted an issue that was going to happen. All of them had their expression changed.</p><br/><p>At the moment, Yu Lian’s face turned into a fierce look. She then took a breath. The wind was getting stronger and stronger on the hill. She lifted up her chest, as if she was about to suck in the air of the entire Peach Mountain.</p><br/><p>Her face became completely pale without any trace of blood, as if she had suffered from severe injury. Her eyes suddenly brightened up and blood started flowing out from her canthus, turning her face into a terrible look.</p><br/><p>It was not the wind but the breath of nature! The air got sucked into her body along with her breath!</p><br/><p>There was something strange in Heaven and on Earth. The trees of Peach Mountain were shaking non-stop, throwing off the snow on top of them.</p><br/><p>Ye Hongyu turned and stared at the Yu Lian on the cliff with a tough look. “Even though your body is as hard as a rock and you are as experienced as a ’23-year-old cicada’, how are you able to suck in such tremendous amount of breath of nature in such a short duration?”</p><br/><p>The breath of nature was still entering Yu Lian’s body. The clashing of the terrifying amount of air had injured her canthus, it even shook her ponytail loose, causing her black hair to fall down like a waterfall. Her hair then went dancing along with the wind blowing from the north.</p><br/><p>The wind turned silenced.</p><br/><p>Up until this moment, the people finally realized that her black hair was growing longer!</p><br/><p>However, no matter how long it would grow, her hair would still hung between her knees. It was because Yu Lian herself was growing taller! The childishness on Yu Lian’s face gradually faded. At the same time, her aura started to rise gradually with great momentum. A few moments later, she had turned from a little girl into a teenager.</p><br/><p>The middle-aged priest turned into a serious look upon looking at the scene. He had read about the Arcane Tome of the Sand, therefore, he clearly knew that every cultivation clan had their own secret. Taoism also had its own secret skill, which could allow an individual to acquire a tremendous amount of power through burning one’s life. However, he had no idea whether there was any secret skill that could allow an individual to skip through time!</p><br/><p>If Ning Que was standing on the cliff, he could easily identify the skill performed by Yu Lian because Lian Sheng’s memory fragments were inside his mind. In addition to this, he had saw Xiao Hou turned over ten years older with his bare eyes in the frozen lake a few years back.</p><br/><p>This could be the forbidden secret of the Devil’s Doctrine. Yu Lian had lost ten years of precious time in a blink of an eye. She had turned her lost years, or partial life into power. Fortunately, she did not turn into an old lady. She used to be a childish young little girl. With ten years added to her age, she had become a sweet tempered and elegant lady.</p><br/><p>Yu Lian straightened her hand into the air. Tang Xiaotang handed over the iron rod to Yu Lian. She held the two ends of the iron rod while slowly giving it a look.</p><br/><p>Wind started blowing from the north once again, as if it was hurrying them to do something.</p><br/><p>She would no longer have to depend on the East Wind and North Wind, and therefore, the wind faded away.</p><br/><p>There was a road built with bluestone connected the cliff and the Divine Halls. Countless shatters had caused numerous cracks along the bluestone road.</p><br/><p>Yu Lian had arrived at the gate of the Divine Halls. She walked towards the giant sedan. In front of the sedan was Zhao Nanhai.</p><br/><p>This Descendant of Light who came from South Sea casted a sacred fire in his hands. He looked at Yu Lian with a solemn look.</p><br/><p>Yu Lian did not even look at him. She did not stop but instead, she directly crashed into the fire wall. She was charging over with an extraordinary speed that even the space twisted. The Haotian’s Divine Flame released two separate string of flames.</p><br/><p>It was like the wings of a flaming bird. Actually, those were the wings of a cicada, that was her world.</p><br/><p>There was a total darkness in front of the Divine Halls and even the light of the Master’s sacred sedan was unreachable. However, she managed to brighten up the area with her flame.</p><br/><p>A loud noise arose. It was like a meteor, crashing onto the ground from the sky. Even the land was about to crack, not to mention about the people standing there.</p><br/><p>Zhao Nanhai was crushed into blood and flesh. He was then purified into green smoke by the Haotian’s divine flame.</p><br/><p>After his death, there was still Haotian’s Divine Flame coming out of his palm. The Divine Flame even started to burn Zhao Nanhai himself. This had indicated that Yu Lian’s speed was beyond imagination.</p><br/><p>Terrifying emotions had covered up the cliff in front of the Divine Hall. The Great Divine Priest of South Sea was trying to scream while Xiaoyu went pale and could not even stand. However, none of their acts was able to happen in time.</p><br/><p>As Yu Lian entered the giant sacred sedan, boundless radiance suddenly started to shake, as if it would be extinguished anytime.</p><br/><p>Xiong Chumo’s mad roar started to echo from the divine chariot. He was well-prepared to fight against Yu Lian, his old enemy. He could not lose his focus during the fight, or else he would be killed instantly. In a blink of an eye, he advanced into Tianqi Realm!</p><br/><p>The prevailing new stream had directly shredded the power of the Haotian in the human world. Even though the Haotian in the Divine Kingdom was affected, but he was still extremely powerful through obtaining his power from Tianqi!</p><br/><p>There was a continuous roaring coming from the sacred sedan! After that, the sacred sedan was destroyed in a blink of an eye! All 76 curtains hanging on the sedan were dancing to the wind. As the curtains fell, dust and ashes were everywhere in the battlefield, forming a realistic fighting scene.</p><br/><p>Yu Lian was standing still, with blood flowing from her lips.</p><br/><p>Xiong Chumo was standing right in front of her but there was no wound on his body.</p><br/><p>This was the first time all of the high priests from the Divine Halls saw the Master’s true appearance. That skinny and short old priest had shocked them a big time, but what they wanted to know the most was the results of the fight.</p><br/><p>Yu Lian turned around.</p><br/><p>Several blade-cut wounds started to appear on Xiong Chumo body. One after another…</p><br/><p>The aura of dead silence was everywhere. His gown was torn apart and numerous blade-cut wounds gradually appeared on his back and eventually appeared densely all over his body. The wounds were countless and there could be tens of thousands of them!</p><br/><p>Xiong Chumo went down on his knees with his body full of blood. He was still alive. He was looking at the shadow of that lady who was leaving. He held his chest in pain, slowly feeling the helplessness and puzzlement.</p><br/><p>“Why?” How could you be so quick? Why are you able to perform 13,062 slashes in such short duration? Why won’t you accept my surrender? Why would you choose to destroy the rock along with the valuable jade to accomplish your goal, even though you would suffer from severe injuries? Why are you always rushing? Why did I back out in the final moment? Why they choose you to become a 23 years old cicada, not me? Why would the world still need me when they already have you?</p><br/><p>Yu Lian had no idea what Xiong Chumo was thinking there. She did not care what he was thinking either. Yu Lian’s opinion was different from Xiong Chumo’s. Although Taoism and Devil’s Doctrine was unable to coexist with one another, she had never treat him like a life enemy because she had been looking down on him all these while.</p><br/><p>She walked to the edge of the cliff and gave the middle-aged priest an eye contact before she made the jump. Only a few grains of sand had dropped in the hourglass.</p><br/><p>The incense in Haotian’s Divine Hall had just finished burning the first layer.</p><br/><p>Peach Mountain turned completely silenced. It was dead silent. None of them raised a single word because they did not know what to say. There was no screaming because the people were stunned.</p><br/><p>All of them were expecting a long while regarding the war between the Academy and Taoism. However, the story ended in a completely different way. People thought they were out of their mind because the war ended too quick. How was it possible for such strange war to happen?</p><br/><p>The middle-aged priest stared at the ciff in silence. He understood the meaning reflected in the eye contact with Yu Lian. She had killed Xiong Chumo and Zhao Nanhai. And now, the West-Hill was allowed to surrender. Of course, there were still several individuals who should be killed. Xiong Chumo was not dead yet.</p><br/><p>“Perhaps, I should thank her for keeping you alive for me.” Ye Hongyu looked at Xiong Chumo who was full of blood and she went silence without continuing her words. She turned and walked towards the cliff while staring at the rising sun coming out from the East.</p><br/><p>It took countless years to build the West-Hill. However, it only took a morning to destroy it.</p><br/><p>Peach Mountain was covered in red under the morning light. Even the snow there were dyed in red. The morning light was like blood after all.</p></div>\n</div>"}