{"title": "Chapter 5: The Magical Gene Production Techniques", "id": 5, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-5-the-magical-gene-production-techniques", "volume_title": "Volume 1", "body": "<h1>Chapter 5: The Magical Gene Production Techniques</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 5: The Magical Gene Production Techniques</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Gold City, Grand Magnificent Restaurant.</p><br/><p>Students of the third year, second class were mutually congratulating their success on entering university. Suddenly, someone thought of something, \"Oh yeah, why hasn’t Chen Feng come?\"</p><br/><p>\"Probably too embarrassed to come.\"</p><br/><p>Some of them laughed and said, \"For the usual top student to actually fail the university entrance examinations. If it was me, I would be too embarrassed to come as well.\"</p><br/><p>\"Haha.\"</p><br/><p>\"So true.\"</p><br/><p>\"You have no idea how badly my mom nagged me every day. Telling me to look at Chen Feng, how even with those family conditions he was still able to become the top student. I was almost vexed to death! Guess what happened this time when I went home. She had nothing to say at all. Haha.\"</p><br/><p>Another student laughed heartily.</p><br/><p>Evidently, Chen Feng’s long-term monopoly of the top student position had attracted hatred due to jealously.</p><br/><p>\"How can you all speak like this?\"</p><br/><p>Class monitor Wang Yue snapped at them, \"No matter what, he is still our classmate.\"</p><br/><p>\"Keh, can’t even speak the truth?\"</p><br/><p>Everyone smiled happily.</p><br/><p>\"It’s also a good thing that he didn’t come.\"</p><br/><p>Wang Yue said lightly, \"With this kind of result, he would feel bad if he came. We probably won’t have any chance to meet in the future anymore. To simply part ways in this manner might be a good thing after all.\"</p><br/><p>\"This is how things should have been.\"</p><br/><p>Some people sneered. \"If it wasn’t for the high school insisting on forging our foundations and forbidding us from advancing our ranks, based on the resources behind us alone, would that poor guy be able to become the top student? Pei! Even if he managed to enter a university, he would be far behind us. And now, he didn’t even manage to enter a university.\"</p><br/><p>Most of them agreed with what was said.</p><br/><p>Wang Yue smiled, no longer saying anything.</p><br/><p>Right at that moment, Wang Yue’s wristband vibrated. A piece of information appeared silently. As Wang Yue looked at it, astonishment flashed through his eyes.</p><br/><p>Chen Feng was still alive?</p><br/><p>That kid had clearly been...</p><br/><p>\"Come. Congratulate our class monitor Wang for his entry into the North Qing University’s Gene Production Faculty.\"</p><br/><p>The crowd toasted.</p><br/><p>\"Haha. Many thanks.\"</p><br/><p>Wang Yue switched off the screen as he stood up and returned the greetings.</p><br/><p>It was all cheers and laughter inside the room.</p><br/><p>At the same time, in a shabby rented room, Chen Feng was finishing his gene-production preparations.</p><br/><p>There were three steps in the gene-production process.</p><br/><p>First step: gene search. To enter the digitized mode and search within the blood essence for the required gene materials in accordance with the gene formula.</p><br/><p>Second step: gene reaction. To let these genes react with each other under the effect of spiritual energy, turning into the final required gene.</p><br/><p>Third step: gene fusion. To grow and duplicate the lone gene, letting it react with the incubator reagent before ultimately being processed into a gene-fusion reagent.</p><br/><p>\"Digitized mode?\"</p><br/><p>Chen Feng recalled.</p><br/><p>The so-called digitized mode was a pure world of genes simulated by the spiritual energy! In this world, only genes could be seen! This would served as a convenience for those performing the gene transformation process!</p><br/><p>\"Let’s try.\"</p><br/><p>Chen Feng looked at the lumberbear blood essence in front of him.</p><br/><p>\"Buzz—\"</p><br/><p>Carefully, he wrapped his spiritual energy around the lumberbear blood essence. The moment the blood essence was completely wrapped, he unleashed the spiritual energy within his body.</p><br/><p>Digitized world!</p><br/><p>Shua!</p><br/><p>Before his eyes, bright light streamed about.</p><br/><p>A semi-illusionary world blossomed in front of his eyes.</p><br/><p>A countless amount of bizarre lights flickered and swirled around without stopping. This was the gene fragment of the lumberbear blood essence!</p><br/><p>\"So this is the digitized mode.\"</p><br/><p>\"To enter a world of genes that can’t be seen with naked eyes.\"</p><br/><p>Chen Feng gained understanding.</p><br/><p>The first step of lumberbear gene production was not hard, it was gene search.</p><br/><p>According to the formula’s introduction, lumberbear gene production required three strains of Ao gene, six strains of Bx gene, and four strains of Nw gene. Detailed introduction was available in the formula with pictures included. This was not hard. These few genes were available in large quantities among several tens of thousands of genes.</p><br/><p>Chen Feng easily found all these genes.</p><br/><p>First step, completed.</p><br/><p>First step of gene production was simple beyond imagination.</p><br/><p>As for the second step?</p><br/><p>Chen Feng read the description carefully; it seemed even simpler.</p><br/><p>Truly.</p><br/><p>Gene reaction process—to let all 13 strains of genes found by Chen Feng react with each other. Under catalysis of spiritual energy, one only needed to let the genes react one by one. This seemed hard. However, within the lumberbear gene formula, the sequence of reaction and spiritual energy catalysis usage was introduced in detail.</p><br/><p>Which genes to react first, which genes to fuse, etc…</p><br/><p>In a short time, the reaction for all 13 genes was completed, leaving behind only one single strain of reacted gene.</p><br/><p>And this was the required final lumberbear gene!</p><br/><p>It was so simple and straightforward!</p><br/><p>Second step: gene reaction, completed.</p><br/><p>\"First two steps were not too hard.\"</p><br/><p>Chen Feng inhaled deeply.</p><br/><p>As long as one had the formula, it was sufficient to simply follow the prescribed order for the first two steps. The body’s original owner had performed both steps countless times before. Hence, Chen Feng was able to easily complete both steps by looking back at his memory.</p><br/><p>However—</p><br/><p>The actual difficulty was the third step!</p><br/><p>This very step was the barrier the original owner had never passed!</p><br/><p>Third step: gene fusion!</p><br/><p>The required lumberbear gene had been produced during the first two steps. However, that was only in digitized mode. A lone lumberbear gene could not be stored and preserved at all! Hence, this crucial third step was the step where the lone gene fragment was truly grown and duplicated, changing it into a gene reagent.</p><br/><p>This step was very difficult.</p><br/><p>\"How do I complete this step?\"</p><br/><p>Chen Feng carefully researched.</p><br/><p>In the gene fusion process, the gene producer had to envelop the gene with their spiritual energy and move it into the gene incubator reagent for it to grow and duplicate. Next, the gene producer had to evenly distribute the duplicated gene through every corner of the liquid, guaranteeing absolute balance, before retrieving the spiritual energy. The real lumberbear gene would thus be completed.</p><br/><p>\"Doesn’t seem too troublesome.\"</p><br/><p>Chen Feng thought for a while and decided to try it out after all.</p><br/><p>\"Rise!\"</p><br/><p>He carefully extracted the lumberbear gene and moved it into the prepared gene incubator reagent. It was a certain liquid that was completely transparent. With the entry of the lumberbear gene, it rapidly changed into a blue color. Chen Feng watched with his own eyes as the blue color spread continuously and fused with the reagent.</p><br/><p>Shortly after, all the liquid within the Petri dish changed into a blue color!</p><br/><p>It was done?</p><br/><p>Chen Feng was somewhat excited.</p><br/><p>Next, Chen Feng slowly retracted his spiritual energy.</p><br/><p>\"Hu—\"</p><br/><p>The liquid within the Petri dish started boiling suddenly, giving him an ominous feeling.</p><br/><p>\"Bang!\"</p><br/><p>All the liquid exploded together!</p><br/><p>It splashed all over.</p><br/><p>\"...\"</p><br/><p>Third step: Gene fusion, fail!</p><br/><p>Chen Feng researched carefully.</p><br/><p>The body’s original owner had reached this crucial point before. Despite many attempts, he had never succeeded. The reason for all his failures was the same—the duplicated gene was unable to fuse evenly!</p><br/><p>The \"evenness\" required in this step was something one could only figure out by oneself!</p><br/><p>During gene duplication, the gene would become exceptionally active. At this moment, spiritual energy was required to rapidly blend the gene into the reagent. This was the only way to guarantee the reagent’s evenness!</p><br/><p>\"Evenness...\"</p><br/><p>\"Balance...\"</p><br/><p>Chen Feng frowned.</p><br/><p>This kind of feeling could only be figured out through constant attempts.</p><br/><p>No wonder the success rate was only 0.1%!</p><br/><p>The first and second step of gene production only required sufficient practice to guarantee perfection. However, this last step was really very hard!</p><br/><p>Well, it was very hard for a normal person.</p><br/><p>However, after activating the Luck Aura, would the gene be evenly distributed in the gene breeding reagent under the Luck Aura’s effect?</p><br/><p>Chen Feng was looking forward to it.</p><br/><p>He put his thought into action immediately.</p><br/><p>Chen Feng once again started gene production.</p><br/><p>The first and second steps were completely easily and he once again reached the gene fusion stage.</p><br/><p>\"Luck Aura, activate!\"</p><br/><p>Chen Feng activated the Luck Aura without hesitation.</p><br/><p>Whoosh!</p><br/><p>A subtle change seemed to appear in Chen Feng’s eyes.</p><br/><p>\"Fuse!\"</p><br/><p>Chen Feng carefully moved the gene into the gene breeding reagent. He looked on as that tiny dot of blue spread rapidly, akin to blue ink dripping into water. In a short period of time, the blue fused with the whole gene reagent, and slowly, the liquid changed into a clear blue color. It was such a bright color.</p><br/><p>Return!</p><br/><p>Chen Feng slowly retracted his spiritual energy. There were no changes in the blue liquid.</p><br/><p>Success?</p><br/><p>Chen Feng was excited.</p><br/>\n</div>"}