{"title": "Chapter 4: To Hell with It!", "id": 4, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-4-to-hell-with-it", "volume_title": "Volume 1", "body": "<h1>Chapter 4: To Hell with It!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 4: To Hell with It!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Gold City.</p><br/><p>Within an ordinary rented house in the urban district.</p><br/><p>Just as Chen Feng reached home, the communication tool on his wristband received all sorts of information.</p><br/><p>Due to not attending the final day's examinations, student Chen Feng’s originally top grades dropped gorgeously to the bottom. He immediately failed the university entrance examinations, losing any opportunity to enter university from now on.</p><br/><p>\"The speed they release the report card here is quite fast, huh.\"</p><br/><p>Chen Feng shook his head.</p><br/><p>University...</p><br/><p>Would the impact of not entering a university be big?</p><br/><p>As Chen Feng went through the original owner’s memories to understand the situation, he frowned. In this world, there was a big difference between those who attended high school and university and those who did not. The high school forged one’s foundations, while the university spurted their high-speed growth based on the accumulated foundations. This was the most common cultivation trend in this world!</p><br/><p>Unable to enter high school?</p><br/><p>Can’t pass the university entrance examinations?</p><br/><p>Then one should just fuse a gene suitable for labor and obediently started laboring.</p><br/><p>This was a world where everyone could fuse with mutated genes. However, genetic abilities could be divided into two main types. Genetic abilities suitable for labor and genetic abilities purely for combat! Without a doubt, the latter’s status was much higher than the former's. This was also what the body’s original owner was pursuing.</p><br/><p>\"Combat genes, eh?\"</p><br/><p>Chen Feng fell into contemplation.</p><br/><p>This was a world where the strong preyed on the weak. Him getting quietly dumped into the sea without anyone realizing was exact proof of this world’s dangers.</p><br/><p>Those without strength would only be slaughtered at will by others. As such, Chen Feng had to become a real expert if he wanted to live a wonderful life.</p><br/><p>However, it seemed like things were going to get inconvenient, since he had failed the university entrance examinations...</p><br/><p>\"Are there any other ways?\"</p><br/><p>Chen Feng suddenly remembered the goal of the body’s original owner—Gene Producer.</p><br/><p>Genetic warriors could fuse a new gene at every stage. For example, when one met the F-class gene fusion requirements, one could fuse an F-class mutated gene to become an F-class genetic warrior. When he reached the E-class gene fusion requirements, he could once again fuse a mutated gene to become an E-class genetic warrior! Subsequent fusions followed a similar trend.</p><br/><p>At every stage, one could fuse a brand new gene.</p><br/><p>The so-called genes that one fused here were formed by mixing the blood essence extracted from mutated beasts with all kinds of gene reagents, producing something called a gene-fusion reagent!</p><br/><p>Those who produced these things were called gene producers.</p><br/><p>The original owner had always been aiming to be a gene producer. The reason for that was simple. He was clear that his weakness was being someone poor and without background. Hence, a suitable concurrent occupation apart from his identity as a student was necessary. If he could luckily become a gene producer, he might be able to solve this issue of his.</p><br/><p>Sadly, he failed.</p><br/><p>It was very hard to become a gene producer.</p><br/><p>Based on Chen Feng’s understandings, the first step for one to become a gene producer was to successfully produce his first gene reagent. Only those who succeed at least once would be recognized as a gene producer! The success rate for a newbie was 0.1%!</p><br/><p>What did this mean?</p><br/><p>It meant that one required at least 1,000 sets of materials. Even the worst of materials would require a total investment of 1,000,000 yuan to get 1,000 sets of materials. Furthermore, it was very important for one to maintain complete attention during the production of these 1,000 sets of reagents without the slightest bit of slack!</p><br/><p>Naturally, some people were talented and might be able to succeed after a few tries. As for those with a black face[1]...</p><br/><p>Might fail even after trying their entire life!</p><br/><p>He used to play a card game on earth. In half a year, he did not draw a single Special Rare card, directly earning the black month title[2]. From this, one could see the degree of his black face at the time.</p><br/><p>Furthermore, even if one was successful via fluke, it was merely the beginning.</p><br/><p>The success rate was very low for the initial stage of gene production. Breaking through required constant production and study!</p><br/><p>A scary amount of wealth was required to support all this.</p><br/><p>Naturally, once a person passed through this difficult stage and perfectly grasped a gene reagent formula, one would be able to taste the sweetness after the bitter[3] and start threading the broad and open road[4]!</p><br/><p>And this was what the body’s original owner looked forward to.</p><br/><p>\"In other words...\"</p><br/><p>\"If I become a gene producer, it might fix my current problem?\"</p><br/><p>Chen Feng eyes lit up.</p><br/><p>Not qualifying to enter a university, Chen Feng’s starting line was much lower than others. However, if being a gene producer could make up for all of that, there was no need to enter a university at all.</p><br/><p>Lacking in resources?</p><br/><p>Just purchase them all!</p><br/><p>Chen Feng was enticed.</p><br/><p>Why had the body’s original owner been stuck at the starting line all the while?</p><br/><p>Apart from spending a vast majority of his time on studying and practicing, the biggest reason was his black face! As for Chen Feng, this was one thing he was not scared of!</p><br/><p>0.1% success rate?</p><br/><p>\"Hehe.\"</p><br/><p>Cheng Feng laughed.</p><br/><p>\"Let’s buy some materials and figure out what this gene production is all about.\"</p><br/><p>Chen Feng started tidying up his room. He intended to buy some basic materials from the shop at the entrance. Seeing things through the original owner’s memory was not comparable to experiencing it himself.</p><br/><p>He had to figure out how much of an effect the Luck Aura had on gene production!</p><br/><p>One had to act based on one’s ability. Arriving in this world, he would die horribly if he did not have a good grasp of his own strength.</p><br/><p>\"Let’s start with the lumberbear gene,\" Chen Feng decided.</p><br/><p>There was really no other reason for his decision. This was the only publicly available gene formula and the only route a normal person could take to start their career as a gene producer.</p><br/><p>----</p><br/><p>Lumberbear Gene.</p><br/><p>Fusion requirements: Strength: 10 points, Physique: 5 points.</p><br/><p>Basic attributes: Strength: 2–3 points, Physique: 2–3 points.</p><br/><p>Genetic ability: Lumberbear’s Wrath. Increased strength by 10 points for 10 seconds, 60 second cooldown.</p><br/><p>Suitable job: Small construction work, etc.</p><br/><p>----</p><br/><p>The fusion requirements were what the Gene Production Association assessed to be the lowest requirement for one to safely fuse it. The bodies of those who did not meet the requirements might not be able to support the fusion, and they might get hurt in the process.</p><br/><p>Basic attributes referred to the attributes that would be increased immediately upon successful gene fusion. As for the range of the attributes increase of 2–3 points, it was based on the gene producer’s ability. The more formidable a gene producer was, the more outstanding the produced gene reagent would be.</p><br/><p>As for the genetic ability, it was the most important part of a gene fusion process as it allowed one to possess an ability unique to a mutated life form. An example would be this Lumberbear’s Wrath. Only after fusing with a lumberbear gene could one activate Lumberbear’s Wrath to hugely increase their strength for a short period of time.</p><br/><p>A strong boost plus a rapid cooldown period made it one of the most welcomed genetic abilities at construction sites.</p><br/><p>Regardless of this, the starting price of a lumberbear gene was 5,000 yuan. The materials alone cost 4,000 yuan. After deducting the miscellaneous expenses, one could not make any profit at all. Hence, the amount of people producing this gene was very low. To meet the public demand for the lumberbear gene, the Gene Production Association had to make the gene formula public, making it the practice formula for gene-producer aspirants.</p><br/><p>Leaving the neighborhood, Chen Feng reached the materials store in the vicinity.</p><br/><p>\"Little Feng is here.\"</p><br/><p>Uncle Zhang from the materials shop said while smiling, \"You've come to buy genetic materials again?\"</p><br/><p>\"Mm, give me five sets of materials for the lumberbear gene.\"</p><br/><p>Chen Feng nodded his head.</p><br/><p>\"All right.\"</p><br/><p>As Uncle Zhang collected the materials and passed them to him, he paused. \"Little Feng, do you have any interest to come work at my place here?\"</p><br/><p>\"Aa?\"</p><br/><p>Chen Feng was stunned.</p><br/><p>\"Sigh.\"</p><br/><p>Uncle Zhang sighed and regretfully said, \"I know you failed your entrance examinations. But child, a man needs to move forward. If you don’t mind, you can start working at Uncle Zhang’s place for now until you found a better job. After that, you can leave any time you want.\"</p><br/><p>\"Eh.\"</p><br/><p>Chen Feng started sweating profusely.</p><br/><p>The speed in which the news was spread… wasn’t it too astonishing!</p><br/><p>How many hours had it been?</p><br/><p>Evidently, Chen Feng did not realize that the examination results had always been released at 6 PM the same day. Everyone could check the results online, so they had already found out the results a few hours ago. They did not expect the normally outstanding Chen Feng to fail his examinations.</p><br/><p>\"Yo, Little Feng is here as well.\"</p><br/><p>The nearby elderly lady came over. \"Not joining the student’s gathering?\"</p><br/><p>\"What?\"</p><br/><p>Chen Feng was stunned yet again. What student gathering?</p><br/><p>\"The graduation...\"</p><br/><p>Elder Lady Liu was halfway through her sentence before she noticed Uncle Zhang glaring at her. She immediate smartened up. \"Sigh, this mouth of mine!\"</p><br/><p>\"The graduation gathering of your class.\"</p><br/><p>Uncle Zhang sighed. \"Supposedly, the class monitor will invite everyone to join the graduation gathering on the day the results were released. This is to let everyone gather one last time. But those schoolmates of yours...\"</p><br/><p>Uncle Zhang shook his head, obviously unhappy with the fact that Chen Feng was not invited. \"So conceited even before entering society. Those students...\"</p><br/><p>\"Hmph!\"</p><br/><p>\"Little Feng, don’t mix around with those conceited people. In the future, you will definitely have better achievements than them,\" Elder Lady Liu comforted him.</p><br/><p>However, they were both clear that without entering a university, Chen Feng’s life would no longer intersect with those schoolmates. Better achievements than them? That was something one could only mention in their dreams.</p><br/><p>It was at this very moment that Chen Feng gained a deeper impression of the universities of this world.</p><br/><p>The truth was, in everyone’s heart, those who failed to enter university lost their qualifications to become a true genetic warrior? The clear line drawn by the university was even scarier than on Earth!</p><br/><p>However...</p><br/><p>Would Chen Feng care about that?</p><br/><p>Joining the schoolmates gathering? To hell with it!</p><br/><p>Those schoolmates without good relationships with him were unworthy of his time at all. What was most important for him right now was to test the power of Luck Aura!</p><br/><p>He had already tried the power of the Luck Aura and Wind Blade combination. That astonishing limitless combo left him yearning even till now. Then, what about the combination of Luck Aura and gene production?</p><br/><p>He looked forward to it.</p><br/><p>Footnotes:</p><br/><p>[1] Black face – A person with bad luck.</p><br/><p>[2] Black month – The name of a black frame that will appear on a player’s icon when failing to draw SR (special rare) cards after a certain number of attempts.</p><br/><p>[3] To taste the sweetness after the bitter – A Chinese idiom, meaning to taste success after bitter struggle.</p><br/><p>[4] Threading the broad and open road – A Chinese idiom, meaning a bright future.</p><br/>\n</div>"}