{"title": "Chapter 15: Professor Tao’s Second Spring", "id": 15, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-15-professor-tao%E2%80%99s-second-spring", "volume_title": "Volume 1", "body": "<h1>Chapter 15: Professor Tao’s Second Spring</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 15: Professor Tao’s Second Spring</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"It sold?\"</p><br/><p>Chen Feng was surprised.</p><br/><p>Truly surprised. He had only posted it to face slap Professor Tao!</p><br/><p>To let him see that, in this world, the third mutation for the lumberbear gene really existed. To let him start facing reality. However, for it to really sell? It was something he had never expected, as the price he had set was really expensive!</p><br/><p>Very expensive!</p><br/><p>\"In this world, there are really so many big spenders?\"</p><br/><p>Chen Feng muttered.</p><br/><p>With 50,000 yuan, one could buy a much better combat gene. There was only one reason for the buyer to be so generous: it was to study this gene’s composition! Through this, one could figure out where this so called third mutation came from.</p><br/><p>Mhm, that was very possible.</p><br/><p>Chen Feng guessed in his heart.</p><br/><p>However, even if he had his guesses, what happened next totally stunned him. He had never thought that, in this world, a person’s face could be thick to such an extent.</p><br/><p>Firstly, his thread on the learning forum was deleted.</p><br/><p>This was a very rare thing. One needed to know that the learning forum had a very deep background. Unless someone violated the rules or infringed on any rights, threads were rarely deleted. Chen Feng’s thread was not related to either violation, yet it was deleted. It would be weird if no trickery was involved in it.</p><br/><p>Secondly, a lot of people started discussing the topic of ‘Is there a possibility for the lumberbear gene to have a third mutation?’ and started to tag Professor Tao to provide explanations on this topic. Professor Tao seriously replied: If a small probability can be considered, then it is still possible.</p><br/><p>Chen Feng roughly swept through and noted that there were at least ten similar threads.</p><br/><p>What was the situation?</p><br/><p>Chen Feng was unable to understand it.</p><br/><p>After that, at night...</p><br/><p>A news that truly alarmed Chen Feng appeared.</p><br/><p>Well-known gene producer grandmaster Professor Tao announced: Lumberbear third gene mutation might exist. Furthermore, initial success had been obtained and a deeper level of research was currently being performed.</p><br/><p>The moment the news was released, the media was sensationalized.</p><br/><p>What was the lumberbear gene?</p><br/><p>It was something almost everyone knew, and also the most highly used labor-type gene. Hence, even though Professor Tao had no other achievements, he had still been able to profit off providing lessons on the lumberbear gene for his whole life.</p><br/><p>And now, Professor Tao declared that a third mutation was found?</p><br/><p>Everyone was excited.</p><br/><p>In the forums, participants of the previous discussion started threads to question Professor Tao. However, they were all deleted. Every single time, it was deleted. These discussions could not be seen from the front page at all. Furthermore, how many participants were there in yesterday’s discussion? How many fans did Professor Tao have?</p><br/><p>They were totally not on the same level.</p><br/><p>Therefore, the questionings of Professor Tao were quickly flooded amongst all the praises.</p><br/><p>\"He actually dared.\"</p><br/><p>Chen Feng was stupefied.</p><br/><p>Really. He had never thought a person’s face could be thick to such an extent. This was no longer angling for fame[1]. It was instead swallowing up Chen Feng’s achievement under broad daylight!</p><br/><p>But then, had he never thought that this would be exposed?</p><br/><p>That thing was, after all, not something that he had produced! Regardless of how one thought of it, doing this was simply too risky. A magnificent grandmaster producer’s IQ was so low?</p><br/><p>And at this moment.</p><br/><p>Within the school’s laboratory.</p><br/><p>A faint blue radiance flickered. Under the experiment equipment, Professor Tao’s tranquil appearance appeared. Beside him, the assistant was cautiously and solemnly analyzing the data together with him.</p><br/><p>\"Di—\"</p><br/><p>\"Di—\"</p><br/><p>The gene-accessing tool was flickering without stop. Within, two lumberbear gene reagents were placed.</p><br/><p>\"Analysis successful.\"</p><br/><p>\"Gene assessment successful.\"</p><br/><p>\"After cross-comparing the data, exceptions were found and analyzed.\"</p><br/><p>\"Analysis completed.\"</p><br/><p>Whoosh!</p><br/><p>The screen flickered.</p><br/><p>Brand new data appeared.</p><br/><p>\"Sure enough...\"</p><br/><p>Professor Tao was exulted.</p><br/><p>Was he stupid?</p><br/><p>Of course he was not stupid!</p><br/><p>So many people had produced lumberbear genes back then, but he was the only one to become well-known. It couldn’t be that the others did not produce any research guides, right? Yet they were all defeated by him. And now that the third mutation had appeared, after the initial panic, Professor Tao knew that his second spring had arrived!</p><br/><p>To steal?</p><br/><p>Getting found out?</p><br/><p>How was that possible!</p><br/><p>If this special mutation could appear so easily, it would have appeared long ago. The only reason it hadn't appeared had to be due to the probability being very low.</p><br/><p>Indeed, he found out after researching it.</p><br/><p>\"A gene returning to its roots!\"</p><br/><p>\"This was a gene returning to its roots. Haha.\"</p><br/><p>Professor Tao was in ecstasy.</p><br/><p>A special recessive gene was hidden within the lumberbear’s blood essence. This originated from its ancestor, the grand thunderbear’s bloodline gene! After years of dilution, this bloodline was already pitifully few in number. Even the gene fragment would only appear after catalyzing the gene reactions.</p><br/><p>And the probability—</p><br/><p>1 in 100 million!</p><br/><p>A probability so low it made one’s hair stand up in despair.</p><br/><p>Mhm...</p><br/><p>What a wonderful probability!</p><br/><p>No matter how one looked at it, this was a type of probability that would only appear due to coincidence.</p><br/><p>To be honest, the lumberbear gene had been in production for so many years, with mutated genes appearing daily. It was about time for this mutation to be discovered. And this wonderful single appearance had been grasped by him! Haha. If that fellow were to take it out and directly question him, then that fellow might still have had some weight in his voice.</p><br/><p>He had actually sold it!</p><br/><p>Now that this thing was in his hands and he had even gotten a result out of his research, who would dare to doubt him?</p><br/><p>On that night itself.</p><br/><p>Professor Tao released a thesis—Detailed analysis on the lumberbear gene’s third mutation. It caused a small-scale sensation and Professor Tao’s popularity increased greatly.</p><br/><p>In this age, news travelled fast.</p><br/><p>This piece of thesis by Professor Tao was still very skillfully prepared.</p><br/><p>Regardless of proving that the gene returned to its roots or swaying public opinion, it was very well done. At least when Chen Feng read it, he could finally be considered to have understood the reason for the mutation to appear.</p><br/><p>\"Mhm...\"</p><br/><p>\"A gene returning to its roots, eh?\"</p><br/><p>Chen Feng understood. So this was the reason.</p><br/><p>However, even though this was what the thesis said, the probability of one actually digging the recessive gene out was really too low. Hence, not many people could produce it. And the moment Chen Feng activated his Luck Aura, regardless of what the probability was, as long as it really existed, the Luck Aura would be able to dig it out!</p><br/><p>\"Hum—\"</p><br/><p>His wristband suddenly vibrated.</p><br/><p>A light screen popped up and a familiar smiling face appeared. \"Hey, Chen Feng.\"</p><br/><p>\"Hello, Mu Yuan.\"</p><br/><p>Chen Feng smiled.</p><br/><p>\"You are still able to smile?\"</p><br/><p>Mu Yuan rolled his eyes. \"Professor Tao, that fellow, has already swallowed your research result by force. Ai, you still underestimated the level of his shamelessness.\"</p><br/><p>\"Just a small matter,\" Chen Feng said lightly.</p><br/><p>He did not feel like he had made a loss, due to the 100,000 yuan he earned.</p><br/><p>\"You are so calm?\"</p><br/><p>Mu Yuan looked at how Chen Feng’s expression was still so tranquil, then smiled bitterly and said, \"Even if you don’t care, to let someone forcefully steal the result of your research, aren't you unhappy to not be able to vent despite being wronged?\"</p><br/><p>\"What do I need to be afraid of?\"</p><br/><p>Chen Feng laughed involuntarily. \"Some things can’t be stolen.\"</p><br/><p>\"Oh?\"</p><br/><p>Mu Yuan was surprised. \"What idea do you have? If you need help, in any way, just let me know. I am extremely interested in dragging this kind of society’s trash through the mud.\"</p><br/><p>\"It’s fine.\"</p><br/><p>Chen Feng smiled. \"Since he bought it, wouldn’t things be fine if I simply produce another?\"</p><br/><p>\"F*ck, you can still produce more?\"</p><br/><p>Mu Yuan howled. He had never thought that Chen Feng’s solution would be so simple! Wasn’t it an uncommon occurrence for these rare mutations to happen?</p><br/><p>\"I originally couldn't.\"</p><br/><p>Chen Feng felt regretful. \"After looking at Professor Tao’s thesis, I was enlightened and am able to produce it now.\"</p><br/><p>\"...\"</p><br/><p>Mu Yuan observed three seconds of silence on behalf of Professor Tao.</p><br/><p>Footnotes:</p><br/><p>1. Angling for fame – A Chinese idiom, it means to obtain fame or reputation through dishonest methods.</p><br/>\n</div>"}