{"title": "Chapter 21: Gene Warehouse", "id": 21, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-21-gene-warehouse", "volume_title": "Volume 1", "body": "<h1>Chapter 21: Gene Warehouse</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 21: Gene Warehouse</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"Please let me off.\"</p><br/><p>The owner started tearing up. \"Boss, this is a small business we have here. From the moment you came in, I could see that you were a person with extraordinary talent. However, if you continue doing this, all the machines will be broken! How about this, I will immediately go and prepare the gene reagents that you won. Can your honored self please stop?\"</p><br/><p>\"...\"</p><br/><p>The guy was behaving as if he had done some terrible deeds.</p><br/><p>\"Really.\"</p><br/><p>\"If you continue playing, we can only go bankrupt,\" the shop owner begged.</p><br/><p>Chen Feng rolled his eyes. He was only here to test out Luck Aura.</p><br/><p>\"Don’t worry. I won’t be reckless.\"</p><br/><p>Chen Feng did not know whether to laugh or cry. Only after making a bunch of promises did the owner let go of him.</p><br/><p>This time, Chen Feng did not use the Luck Aura and casually played a few times. Indeed, only normal signs appeared. The shop owner, on the other hand, was anxiously looking at Chen Feng with a bottle of lumberbear gene in his hands.</p><br/><p>Chen Feng felt helpless and could only choose to leave.</p><br/><p>This was a theme park where entertainment was the main selling point. A lot of people were only here to have some fun. There was no need for Chen Feng to destroy their small businesses.</p><br/><p>Furthermore, he had already obtained what he wanted most.</p><br/><p>Returning to reality in his rented house, Chen Feng finished his final calculations.</p><br/><p>The Luck Aura could easily affect normal probability rates, regardless of how small the probability was. However, as soon as ‘accidents’ were involved, the exhaustion rate for the luck value would be extremely huge!</p><br/><p>In regards to the Luck Aura, these were extremely rare occurrences.</p><br/><p>For example—causing the slot machine to be broken by ‘accident.’</p><br/><p>\"What if it’s the lottery...\"</p><br/><p>Chen Feng looked at the remaining 12 points of luck value he had. He opened a lottery website that was about to draw the lot and purchased a ticket after activating Luck Aura.</p><br/><p>After that, the lots were drawn.</p><br/><p>Shua!</p><br/><p>The remaining luck value dropped to the bottom immediately.</p><br/><p>12 points of luck value were used up.</p><br/><p>\"Congratulations for winning the first prize.\"</p><br/><p>In his screen, a dialog box popped up.</p><br/><p>After comparing the prizes with his lottery ticket, Chen Feng shook his head helplessly.</p><br/><p>First prize: 50,000 yuan.</p><br/><p>Special prize: 500,000 yuan!</p><br/><p>Chen Feng had been aiming for the special prize, yet the final result he got was first prize. This could only prove one thing: this lottery system did not set the special prize as an option at all! And if he wanted to cause an ‘accident’ so he could win the special prize, 12 points of luck value were far from enough!</p><br/><p>Hence—</p><br/><p>He only won the first prize.</p><br/><p>\"It’s a loss after all.\"</p><br/><p>Chen Feng spread his hands. This kind of thing was unreliable, after all.</p><br/><p>If he were to use the 12 points of luck value to produce mutated lumberbear genes, he could produce six of them! Even if he were to sell them at the lowest price, he could still get 120,000 yuan!</p><br/><p>After deducting the costs, he would still be making a profit of 90,000 yuan. After the calculation, he had actually made a loss this time.</p><br/><p>\"This prize...\"</p><br/><p>Chen Feng could only forcefully smile.</p><br/><p>Seemed like it wasn’t possible for meat to fall from the skies. There had to be some legitimate ones among all these lotteries. However, after Chen Feng roughly swept through the list, there were around 4,000 to 5,000 of them available currently! He couldn’t try them one by one, right? This was a pit that he absolutely couldn't enter.</p><br/><p>\"Small gambles will cost one’s money, while big gambles will cost one’s life.\"</p><br/><p>Chen Feng sighed endlessly.</p><br/><p>He continued looking for information on formulas online, but he couldn’t find any useful information.</p><br/><p>\"I can only buy?\"</p><br/><p>Chen Feng was somewhat disappointed. He decided to ask Mu Yuan about it. This fellow had become a gene producer much earlier than him. He ought to know some other ways to obtain formulas.</p><br/><p>Chen Feng contacted Mu Yuan and roughly explained his requirements.</p><br/><p>Mu Yuan was silent for a long time.</p><br/><p>\"What’s up?\"</p><br/><p>Chen Feng was curious.</p><br/><p>\"You are saying that, at present, you only know the lumberbear gene?\"</p><br/><p>Mu Yuan looked like he was about to collapse as he stared at Chen Feng unbelievably. \"That means... you haven’t even collected the free formula during the beginner producer’s certification?\"</p><br/><p>Chen Feng paused. \"What is beginner producer’s certification?\"</p><br/><p>\"...\"</p><br/><p>Mu Yuan paused for precisely five seconds.</p><br/><p>As he looked at Chen Feng, who was waiting for his explanation, he could only accept this truth—this fellow that had produced a powerful mutated reagent, that had stepped on Professor Tao, actually hadn’t obtained the producer’s certificate! What age was he living in? This fellow actually imitated those from ancient times and cultivated deep in the mountains like a hermit?</p><br/><p>\"Then why did you tell me you were a beginner producer when we met previously?\" Mu Yuan said angrily.</p><br/><p>\"It was shown on the data screen.\"</p><br/><p>Chen Feng looked at the beginner gene production shown on his data screen, acting very composed.</p><br/><p>\"That was only an evaluation.\" Mu Yuan smiled forcefully. \"Alright. I will seriously explain it to you.\"</p><br/><p>\"The data on the date screen was only for you to evaluate yourself. It can only be used as a reference, like a personal record. Personal record, understand? Some people can even cheat by modifying their data screen! Naturally, they can only amuse themselves with this. It has no real use!\"</p><br/><p>\"To be a true gene producer, one needs to go to the Gene Production Association and take their examination to be certified. In order to encourage everyone to get certified, the Gene Production Association provides a lot of benefits. There will be ample rewards whenever someone gets certified successfully. For a beginner gene producer, the reward is a chance to choose a formula from their formula warehouse.\"</p><br/><p>\"After all, the Gene Production Association still wants to see the gene production scene develop faster.\" Mu Yuan finished in one breath.</p><br/><p>\"Freely choose a formula?\"</p><br/><p>Chen Feng’s eyes flashed.</p><br/><p>\"...\" Mu Yuan sighed. Boss, you concentrated on the wrong point, ah.</p><br/><p>He knew what Chen Feng was thinking about. He advised, \"Although you can choose freely, I don’t suggest you to choose a formula with a high star rating. As you are getting certified as a beginner producer, you can only choose F-class gene formulas. Apart from being hard to produce, those F-class formulas with high star ratings have no other uses. Therefore, others would usually choose a formula that is easy to learn so that they can quickly increase their ability.\"</p><br/><p>\"I see.\"</p><br/><p>Chen Feng was enlightened. \"Since that’s the case, I can choose a 5-star formula?\"</p><br/><p>Mu Yuan’s cheeks were streaming with tears.</p><br/><p>After talking with him for half a day, Chen Feng was not listening at all!</p><br/><p>\"Boss, I know you are a genius.\"</p><br/><p>\"However, wouldn’t it be better to choose a formula with higher difficulty when you become an intermediate-level producer or an advanced-level producer? Advancement would be easier if you were to choose a simpler formula at beginner level. Things like formula, they can only increase your production level when you have actually mastered them!\"</p><br/><p>Mu Yuan gave his earnest and well-meaning advice.</p><br/><p>\"Mhm, mhm. Yeah, I know.\"</p><br/><p>Chen Feng expressed his thanks. \"I will go get certified first. Contact me anytime if there’s anything.\"</p><br/><p>\"...\"</p><br/><p>This fellow wouldn’t really plan to choose some formula with high star ratings, right?</p><br/><p>It should…</p><br/><p>Not be possible, right?</p><br/><p>Mu Yuan was not sure as well.</p><br/><p>Chen Feng was a genius that he looked highly upon. Fate seemed to bring them together, as they had worked together against Professor Tao previously. He did not want to watch on as Chen Feng chose a high-difficulty formula and wasted his time. A lot of those F-class formulas with 4 or 5 stars of difficulty rating were something even those intermediate producers did not dare to lightly tread upon!</p><br/><p>\"I hope you don’t act recklessly,\" Mu Yuan muttered to himself.</p><br/><p>At this moment, Chen Feng was already headed toward the Gene Production Association in exhilaration.</p><br/><p>He understood Mu Yuan’s suggestions. However, he knew his own circumstances. He could only make it to the Rookie Competition’s signup by choosing a high difficulty formula.</p><br/><p>At this time, he had no choice but to try his best!</p><br/><p>Gene Production Association.</p><br/><p>It was a huge building with 100 floors, located at the center of Gold City. All the community and entertainment facilities around it were set up to serve the people in this building. Furthermore, this was only a branch at Gold City. From this, one could see how extraordinary the position of the Gene Production Association was.</p><br/><p>\"Hello. I am here to get certified as a beginner producer.\"</p><br/><p>Chen Feng reached the lounge.</p><br/><p>\"Alright. Please wait a moment.\"</p><br/><p>A pretty staff member helped Chen Feng with identity authentication, signing up, and going through the basic preparations for the examination before taking Chen Feng to a room.</p><br/><p>\"Please complete the written examination here first. After that, you only need to continuously produce three F-class gene reagents.\"</p><br/><p>The staff member smiled sweetly. \"You can call us anytime if you require anything.\"</p><br/><p>\"Thanks.\"</p><br/><p>Chen Feng nodded.</p><br/><p>Worthy indeed of being the Gene Production Association. The customer service here was much better than he had imagined. Looking down on you due to your young age? Looking down on you due to your cheap clothing?</p><br/><p>Impossible.</p><br/><p>The more high-end a place was, the higher their requirements would be on their customer service.</p><br/><p>Chen Feng walked into the room.</p><br/><p>There was no examiner. There was only a floating light screen on the table with a couple of webcams. It seemed like everything here would be automated.</p><br/><p>Chen Feng started to answer the questions.</p><br/><p>The questions on theoretical foundation were not hard. He only needed to recognize some materials. As for the subsequent practical examinations, Chen Feng chose three sets of lumberbear gene materials and let the staff members bring them in. He easily finished producing them and passed the beginner producer’s examination just like that. Smoothly, without anything unexpected happening.</p><br/><p>\"Congratulations, Mr. Chen Feng.\"</p><br/><p>The staff member smiled sweetly. \"You are now a beginner producer. Your personal information has been updated. You can now choose a gene formula for free.\"</p><br/><p>\"Alright.\"</p><br/><p>Chen Feng was getting slightly emotional. Finally, he had reached this step.</p><br/><p>Whoosh!</p><br/><p>The screen flickered.</p><br/><p>Countless gene formulas flashed through before him.</p><br/><p>Chen Feng was so emotional he couldn’t control himself. Even F-class gene formulas alone had a few hundred thousands of choices here. There were too many to count.</p><br/><p>Chen Feng thought for a while before choosing 5-star difficulty level.</p><br/><p>Whoosh!</p><br/><p>There were only 12 formulas remaining. A vast majority of them had a scarlet red warning on them—lack of materials. These formulas were too old. Part of the materials had disappeared. In this age, it was extremely hard to collect all the materials. As for the other formulas for which the materials were still available...</p><br/><p>Chen Feng looked at them and noticed that these materials were something he totally had no access to.</p><br/><p>These formulas should be something specially prepared for some specific uses. Due to their power being on the low side, their classes were reduced to F-class. However, the limitations were extremely big. Chen Feng carefully looked through and found that almost all of these 5-star formulas were not usable for him!</p><br/><p>Seemed like he could only choose among the 4-star formulas.</p><br/><p>Chen Feng shook his head and filtered the list again.</p><br/><p>Compared to the 5-star formulas, the quantity of 4-star formulas were much higher. Chen Feng was able to easily find some of them with materials that were easier to gather.</p><br/><p>\"This one.\"</p><br/><p>Chen Feng confirmed.</p><br/><p>\"Alright.\"</p><br/><p>The staff member smiled sweetly. As the staff member looked at Chen Feng’s choice, her mouth opened slightly and a look of shock surfaced on her face. It was actually this formula!</p><br/>\n</div>"}