{"title": "Chapter 20: Luck Value Test", "id": 20, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-20-luck-value-test", "volume_title": "Volume 1", "body": "<h1>Chapter 20: Luck Value Test</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 20: Luck Value Test</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Gold City.</p><br/><p>Within the rented house, Chen Feng was very calm.</p><br/><p>With everything exposed, this matter could be considered to have come to an end. The transaction record leak was the result of his communication with Wind Pavilion, and the price for it was the service charge for the second mutated gene reagent, worth 50,000. The spam army at the forum was hired by Mu Yuan. Doing both of these together, they were able to force Professor Tao to show his true colors.</p><br/><p>\"I have earned a huge amount. I can be considered to have profited from this.\"</p><br/><p>Chen Feng looked at the balance in his bank account.</p><br/><p>Even after deducting the service charge worth 100,000, the sales he had made these days, and the few extremely expensive mutated genes, had earned him precisely 500,000 yuan!</p><br/><p>However...</p><br/><p>For him, this was far from enough.</p><br/><p>\"This little money is totally not enough.\"</p><br/><p>Chen Feng's head ached.</p><br/><p>Three months time seemed to be a long time. In truth, it was very short. Under normal circumstances, it was already an amazing feat for a gene producer to increase their production level by 2 stars in such a small amount of time! Chen Feng’s current speed of increase far exceeded them, but he was stuck due to a lack of formulas.</p><br/><p>\"I need to think of other methods.\"</p><br/><p>Chen Feng blanked out as he looked at the screen in front of him.</p><br/><p>The Genetic Union’s mission?</p><br/><p>Chen Feng had seen their missions before. The difficulty level of the missions there were not something a rookie like him could complete. Furthermore, the return was lower than gene production!</p><br/><p>Chen Feng started to inquire online on ways to quickly earn gene formulas. The internet had also given him a lot of methods such as robbing, prostitution, gambling, etc. Chen Feng smiled bitterly. Apparently, due to his visit to these websites, all sorts of advertisements were now popping up on his screen.</p><br/><p>As Chen Feng was preparing to close them off, he was momentarily stunned as he stared at one of the advertisement for a long time. He was not attracted by the scantily clad big sister on it. He was paying attention to the main point, which was the content of the advertisement. Within, it contained information on a gambling system similar to a slot machine.</p><br/><p>\"Slot machine...\"</p><br/><p>Chen Feng contemplated.</p><br/><p>He would definitely not go to those places advertised. However, if it was only a slot machine, the entertainment district of the virtual community seemed to have this thing?</p><br/><p>Slot machine!</p><br/><p>Lottery!</p><br/><p>With a cheat ability such as Luck Aura, if he were to play these, he might be able to make a huge profit with small capital?</p><br/><p>Chen Feng was enticed.</p><br/><p>Turning on the virtual equipment, Chen Feng entered the virtual community and directly walked toward the entertainment district.</p><br/><p>At the corner of the virtual theme park.</p><br/><p>There—</p><br/><p>A machine he was extremely familiar with was placed. A slot machine. Despite it being somewhat different from the slot machines of earth, they still generally resembled each other.</p><br/><p>Three bananas, a reward of one gene-fusion reagent.</p><br/><p>Three apples, a reward of one gene-enhancement reagent.</p><br/><p>Three pineapples, a reward of one gene-reagent formula.</p><br/><p>...</p><br/><p>A total of 10 tiers of rewards. Apart from the gene formulas, the other rewards couldn’t be considered as expensive things. This was, after all, a small business. Everyone would be happy with some small gifts. Furthermore, these virtual entertainment districts banned the usage of abilities. Hence, the shop owners were not worried at all that people would cheat.</p><br/><p>\"Let me try.\"</p><br/><p>Chen Feng started operating a slot machine.</p><br/><p>Luck Aura—activate!</p><br/><p>Hua!</p><br/><p>\"Three pineapples! Three pineapples! Three pineapples!\" Chen Feng chanted inwardly.</p><br/><p>If the Luck Aura really worked as he guessed, then what was going to appear would definitely be three pineapples! Shortly after, the slots stopped one by one.</p><br/><p>First one, pineapple!</p><br/><p>Second one, pineapple!</p><br/><p>The people around him abruptly stopped their steps. \"Shit, two pineapples?\"</p><br/><p>\"The third pineapple won’t really appear, right?\"</p><br/><p>\"I have never seen it.\"</p><br/><p>The nearby people started gathering around him to watch.</p><br/><p>Chen Feng was not bothered with them. Instead, he was looking at the third slot slowly moving before ultimately reaching the pineapple sign and stopping.</p><br/><p>Three pineapples!</p><br/><p>It appeared!</p><br/><p>\"Whoosh—\"</p><br/><p>The whole entertainment district exploded.</p><br/><p>\"Shit. Pineapple. Really three of them appearing!\"</p><br/><p>\"God. Is it real? Even the lowest level formula would be worth 100,000, right? Only 100 yuan to run this slot machine once, this kid made a huge profit!\"</p><br/><p>\"Too unbelievable.\"</p><br/><p>Everyone exclaimed in admiration.</p><br/><p>Even the owner of the theme park was shocked. He rushed over and stared at the slot machine in shock with his eyes opened wide. He evidently didn't dare to believe this was happening.</p><br/><p>\"Pa!\"</p><br/><p>He slapped the slot machine, getting no reaction from it.</p><br/><p>He slapped it again.</p><br/><p>Still no reaction.</p><br/><p>Finally, he looked at Chen Feng with a stupefied face. \"Big bro, this machine was broken...\"</p><br/><p>\"Xu—\"</p><br/><p>A hissing sound reverberated around them.</p><br/><p>\"You are being shameless!\"</p><br/><p>\"Yeah, where goes the most basic of trust?\"</p><br/><p>Everyone started jeering.</p><br/><p>\"Broken?\"</p><br/><p>Chen Feng was suspicious as well.</p><br/><p>\"It’s really broken.\"</p><br/><p>The owner did not know whether to laugh or cry. \"Otherwise, it is impossible for three pineapples to appear.\"</p><br/><p>\"Why?\"</p><br/><p>Chen Feng was flabbergasted.</p><br/><p>\"Because we did not set three pineapples as one of the available options at all,\" the owner stated without any feeling of shame.</p><br/><p>\"Xu—\"</p><br/><p>The hissing sounds around them became even louder. In order to prove that his machine was really broken, the owner did not even care about his face anymore. He had the nerve to admit that he did not set three pineapples as one of the options?</p><br/><p>\"No?\"</p><br/><p>Chen Feng was somewhat astonished.</p><br/><p>If it wasn’t set...</p><br/><p>The Luck Aura had unexpectedly displayed it’s usage in this aspect.</p><br/><p>And it was at this moment that Chen Feng noticed the luck values on his screen had actually decreased greatly. Only three pineapples, yet five points of luck value were exhausted!</p><br/><p>It was equivalent to him producing two-and-a-half mutated genes!</p><br/><p>All these were not the main point. The main point was that the Luck Aura, which was only able to affect the probability, was actually able to produce these kind of ‘accidents’!</p><br/><p>Coincidence?</p><br/><p>Or...</p><br/><p>\"We really don’t have pineapples.\"</p><br/><p>The owner did not feel any shame at all. \"However, we have everything else apart from pineapples. Why don't you try other machines? This machine was really out of service.\"</p><br/><p>\"Where’s your face?\"</p><br/><p>The surroundings jeered.</p><br/><p>\"Alright.\"</p><br/><p>Chen Feng was not bothered with the crowd and walked to another slot machine. Although the exhaustion of luck values caused his heart to somewhat ache, he really wanted to figure out what had really happened.</p><br/><p>Whoosh!</p><br/><p>He started pressing the button.</p><br/><p>Right before the slots stopped, he activated the Luck Aura!</p><br/><p>First one—pineapple!</p><br/><p>Second one—pineapple!</p><br/><p>Everyone opened their eyes wide. Shit. Another two pineapples? The third one wouldn't be another pineapple, right? Even the shop owner was badly frightened.</p><br/><p>Yet they could only look on as the third slot slowly floated in front of the pineapple sign and, with a ka cha sound, stopped.</p><br/><p>\"Hiss—\"</p><br/><p>Everyone inhaled a mouthful of cold air. It really was three pineapples again!</p><br/><p>\"F*ck!\"</p><br/><p>The owner’s vision darkened, and he almost fainted on the spot.</p><br/><p>How was this possible?</p><br/><p>\"Indeed...\"</p><br/><p>Chen Feng contemplated.</p><br/><p>Three pineapples again while his luck value decreased by five points.</p><br/><p>\"What toy is this?\"</p><br/><p>The owner walked over and patted the machine with a sullen face. \"Broken again. It’s broken again!\"</p><br/><p>Chen Feng ignored him.</p><br/><p>As he reached another slot machine, he casually started operating it.</p><br/><p>Shua!</p><br/><p>Three bananas appeared, and the crowd exclaimed in admiration.</p><br/><p>As Chen Feng looked at the luck value that was only exhausted by one point, he finally understood.</p><br/><p>Firstly, Luck Aura was very powerful.</p><br/><p>Even the three pineapples that were not set as an option could be forced out through the machine malfunctioning. This was no longer something as simple as probability.</p><br/><p>Secondly, this kind of ‘accident’ had a very high exhaustion rate of luck value.</p><br/><p>Under normal circumstances, increasing the probability was totally not a problem for the Luck Aura. One point of luck value was sufficient. However, to cause an ‘accident’ forcefully, the luck value would be exhausted rapidly! Furthermore, if he had not guessed wrongly, the magnitude of these ‘accidents’ were in direct proportion with the exhaustion of the luck value.</p><br/><p>Apart from this, it was very easy for Chen Feng to purely affect the probabilities.</p><br/><p>For example—</p><br/><p>The third mutated gene!</p><br/><p>For example—</p><br/><p>Unlimited combo of Wind Blade!</p><br/><p>\"If it’s like this... If I were to participate in something like the lottery, there would be a possibility of me not being able to win the prize?\" Chen Feng contemplated.</p><br/><p>Firstly, you did not know which round of the lottery draw the luck value would affect. Secondly, a vast majority of these lottery draws had trickery involved. It was very probable for it to be the same as the three pineapples today. It would probably be even harder! The amount of luck value he needed to exhaust would be very high! Furthermore, he might even lose his capital! The water truly ran deep here.</p><br/><p>\"No matter what, I need to give it a try.\"</p><br/><p>Suddenly, the owner grabbed Chen Feng’s legs, \"Boss, please let me off, ah.\"</p><br/><p>\"...\"</p><br/>\n</div>"}