{"title": "Chapter 22: Why Be So Petty and Low after Rebirth", "id": 22, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-22-why-be-so-petty-and-low-after-rebirth", "volume_title": "Volume 1", "body": "<h1>Chapter 22: Why Be So Petty and Low after Rebirth</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 22: Why Be So Petty and Low after Rebirth</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>----</p><br/><p>Thundersnake Gene formula</p><br/><p>Dificulty level: 4 stars</p><br/><p>Type: Special</p><br/><p>Usage: Produced from the Thundersnake’s blood essence, requires a lot of different materials to bring out the mysterious power within the Thundersnake Gene, turning it into a type of special gene reagent.</p><br/><p>----</p><br/><p>Within the light screen, the thundersnake gene reagent was reappearing non-stop in midair in the form of light images. Within the reagent, a light-green-colored small snake that was formed by lightning could be seen swimming around constantly. A power that caused one's heart to palpitate was being released. This was not a gene fusion reagent. Instead, it was a special-type one-off consumable item.</p><br/><p>Its might was astonishing! The production difficulty was even more astonishing!</p><br/><p>No wonder the staff member was astonished. Every day she saw a lot of people going through gene certification here. However, those that had chosen this gene formulas that was considered to be hard even among the 4-star ones were extremely uncommon. One needed to know that choosing a suitable combat formula would save one up to millions in funds.</p><br/><p>As for this formula?</p><br/><p>It was very probable that one could not even learn it!</p><br/><p>Furthermore, regardless of whether one looked at it from the perspective of increasing beginner production level or money making, these special-type 4-star formulas were not a good choice. This was because, from the moment of its conception, these high-difficulty formulas only existed to fulfill some specific requirements. It was not suited for normal learning at all.</p><br/><p>\"Thundersnake gene has a very high difficulty.\"</p><br/><p>The staff member confirmed once again. \"The data of the formula cannot be traded. As such, you can only learn it yourself. Are you sure you want to choose this formula?\"</p><br/><p>\"I’m sure.\"</p><br/><p>Chen Feng did not hesitate.</p><br/><p>\"Alright.\"</p><br/><p>The staff member nodded slightly.</p><br/><p>Despite not agreeing with it, it was not her place to question a producer’s rights.</p><br/><p>\"Whoosh!\"</p><br/><p>Countless light silhouettes swirled about.</p><br/><p>Countless data flickered in Chen Feng’s screen. The huge amount of data regarding the thundersnake gene was being transferred without stop into his wristband. This was the formula data of this era. Containing information from the pictures of materials to the sequence of reactions, a normal item was not able to contain this large amount of information at all.</p><br/><p>Shortly after, the data transmission ended.</p><br/><p>4-star Thundersnake Gene formula, acquired!</p><br/><p>\"Done.\"</p><br/><p>Chen Feng couldn’t help getting emotional.</p><br/><p>This was a 4-star formula, ah. Although he was somewhat regretful to have not obtained a 5-star formula, but if all his formulas were at this level, he only needed five formulas to reach 20-star rating. A mere rookie competition signup qualification wouldn’t be considered as anything.</p><br/><p>Naturally, this was something he could only think about.</p><br/><p>Based on his understanding, 4-star or 5-star formulas were all extremely valuable. Even if it was an F-class formula, it was still not something an ordinary people could obtain.</p><br/><p>\"Oh, right. Is there a formula being rewarded for those who become intermediate-level producers?\" Chen Feng suddenly asked.</p><br/><p>\"No.\"</p><br/><p>The staff member stated softly, \"Some precious materials will be rewarded to those who become an intermediate-level producer.\"</p><br/><p>\"Oh.\"</p><br/><p>Chen Feng felt regretful.</p><br/><p>Indeed.</p><br/><p>Had he been thinking too much?</p><br/><p>E-class formulas were even more valuable. And if it was a high-star-rating formula, the price would be extremely expensive. Even the Gene Production Association would not release it to normal producers.</p><br/><p>However, even if he only got a free formula this one time, it was enough.</p><br/><p>Chen Feng was getting emotional.</p><br/><p>4-star special-type gene reagent, what kind of might did it possess?</p><br/><p>He was somewhat impatient to know.</p><br/><p>As Chen Feng went out the door and was preparing to leave, a middle-aged person in the Gene Production Association’s uniform walked over and extended his hand while smiling. \"Excuse me, may I ask if this is gene producer Chen Feng?\"</p><br/><p>\"Mhm.\"</p><br/><p>Chen Feng answered.</p><br/><p>\"I have been waiting for you for a long time.\"</p><br/><p>The middle-aged person laughed. \"Hello. I am Zhang Wei, the staff responsible for the Gene Production Association’s patent application. This time, I come uninvited due to the lumberbear gene’s third mutation.\"</p><br/><p>Chen Feng became solemn suddenly—had his identity been exposed?</p><br/><p>\"Please don’t worry. Presently, I am the only one who knows about it.\"</p><br/><p>Zhang Wei smiled. \"As for how I found your identity? It is very simple. A normal person depends on their eyes to differentiate different identities, while for us, the gene producers, we depend on spiritual energy! In the eyes of a gene producer, everyone’s spiritual energy differs to some extent. Hence, we can easily distinguish a person’s identity.\"</p><br/><p>\"In order to reduce the penalty, Professor Tao delivered the third-mutation lumberbear genes he purchased to the Gene Production Association. The three bottles of lumberbear gene you produced earlier had an extremely similar spiritual energy on it compared to the spiritual energy on the third-mutation lumberbear genes. Hence...\" Zhang Wei explained.</p><br/><p>So that was why.</p><br/><p>Chen Feng was enlightened.</p><br/><p>\"The reason I came uninvited this time was also due to the matter pertaining to Professor Tao.\"</p><br/><p>Zhang Wei smiled as he said, \"The repercussions of this incident were very huge. Hence, we wish to record the lumberbear gene’s third mutation as soon as possible. As a reward, we will give you a bonus of 100,000 yuan. Of course, the ownership rights are still in your hands. We will only record it down.\"</p><br/><p>Bonus?</p><br/><p>Chen Feng exclaimed in admiration. If the only thing they did was to record it down, then all this money could be considered as given for free. The Gene Production Association was indeed rich and imposing! However, as soon as the formula was certified, his identity...</p><br/><p>Chen Feng was hesitating.</p><br/><p>\"If you are worried about your identity, you don’t need to be.\"</p><br/><p>Zhang Wei seemed to know what he was thinking about. \"Honestly, the more popular a producer gets, the harder it gets to hide his identity. To become a true producer, there is totally no need for one to conceal their identity! At times, the advantages brought about by fame are much greater than the trouble it brings.\"</p><br/><p>\"You are saying...\"</p><br/><p>Chen Feng suddenly understood.</p><br/><p>For him to be reborn, why did he need to be so petty and low?</p><br/><p>Was him concealing his identity useful?</p><br/><p>It was useless!</p><br/><p>He was so low profile, yet didn’t those people from Professor Tao still find him? Didn’t Wang Yue still come looking for him? In this special age, there were some abilities that couldn’t be guarded against. It was pointless to constantly hide and cover up.</p><br/><p>Want to be safe?</p><br/><p>Sometimes the biggest guarantee would actually be fame!</p><br/><p>Didn’t the body’s original owner get killed easily? However, if he was someone with a certain level of fame, with a certain level of status, who would dare to act recklessly?</p><br/><p>They would at least take his identity into consideration before taking any actions!</p><br/><p>Covering up?</p><br/><p>Hiding?</p><br/><p>Completely useless!</p><br/><p>Letting the opponents not have the guts to act on him was the true way!</p><br/><p>Chen Feng made up his mind.</p><br/><p>\"Then, should we start discussing the name of the formula?\" Zhang Wei smiled.</p><br/><p>\"Alright.\"</p><br/><p>Chen Feng agreed.</p><br/><p>Finally, the lumberbear gene’s third mutation was named by Chen Feng as: lumberbear gene – battle. This was representative of it being a special combat-type gene among the labor-type genes. Of course, that fraudulent probability rate of its appearance and whether others could produce it or not was not something Chen Feng cared about.</p><br/><p>At this time, within his personal information, Chen Feng’s data was updated—Chen Feng, beginner gene producer, possessing ‘lumberbear gene – battle.’ That piece of additional information that only he had let him distinguish himself amongst all the normal beginner producers. In the future, if he wanted to report his research results, it would be much easier.</p><br/><p>\"Fame?\"</p><br/><p>Chen Feng contemplated.</p><br/><p>This was a double-edged sword. How he used it depended on himself. As long as he operated it appropriately, the benefits obviously outweighed the risks.</p><br/><p>Zhang Wei suddenly smiled as he said, \"Did you choose the 4-star formula for the rookie competition?\"</p><br/><p>\"Is it so obvious?\"</p><br/><p>Chen Feng was dumbfounded.</p><br/><p>\"Of course not.\"</p><br/><p>Zhang Wei shook his head. \"If it was a normal person, I would not think like this at all. However, you are a genius that created a new gene the moment you entered the profession. I trust in your potential.\"</p><br/><p>\"It might be luck?\"</p><br/><p>Chen Feng smiled faintly.</p><br/><p>\"Luck is also a part of one’s ability.\"</p><br/><p>Zhang Wei stated righteously, \"Nowadays, even a person’s background can be considered as part of one’s ability. Why not luck?\"</p><br/><p>Chen Feng was dumbfounded. Wasn’t that correct?</p><br/><p>\"If you are really lacking formulas...\"</p><br/><p>Zhang Wei pondered for a short while. \"You can try looking at the Gene Production Association’s missions. Those missions with comparatively higher requirements will all be sent here.\"</p><br/><p>\"Oh?\"</p><br/><p>Chen Feng eyes flashed.</p><br/><p>As he bid Zhang Wei goodbye, Chen Feng started flipping the Gene Production Associations’s request panel at the lounge.</p><br/><p>Whoosh!</p><br/><p>Lists of requests were refreshed.</p><br/><p>A large majority of them were requests for custom-made genes; the materials were prepared requesting for a gene producer to produce some genes, how much money per production, etc. There were also requests for guaranteed success, etc. All sorts of requests could be seen. Chen Feng directly filtered the rewards to 5-star formulas. The currently available requests dropped to only one.</p><br/><p>\"This is...\"</p><br/><p>Chen Feng’s eyes flashed.</p><br/>\n</div>"}