{"title": "Chapter 23: Restriction", "id": 23, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-23-restriction", "volume_title": "Volume 1", "body": "<h1>Chapter 23: Restriction</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 23: Restriction</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>This was a restriction-type request.</p><br/><p>Requesting a high-level beginner producer to accompany them to explore some historical ruins and help them remove any restrictions they met on the exploration. Upon completion, a 5-star formula would be rewarded.</p><br/><p>\"Restriction...\"</p><br/><p>Chen Feng understood after checking it out online.</p><br/><p>The so-called restriction, based on his understanding, was something like a blood-essence-formed lock.</p><br/><p>In some historical ruins, after the death of mutated beasts, their blood would blend into the ground. With the passage of time, it would evolve and become a special spiritual seal, forming a peculiar restriction. Any place covered by the restriction couldn’t be entered. Those who tried to enter by force would receive backlash from the power of the blood essence. It was extremely dreadful.</p><br/><p>Only a gene producer, in digitized mode, could lift the restriction!</p><br/><p>\"So it was like this.\"</p><br/><p>Chen Feng contemplated.</p><br/><p>As he looked at the time, he noticed that the interview would be held today. Chen Feng prepared to go.</p><br/><p>He was aware that there was still too much lacking in his ability. It was very probable that he would not be able to handle a restriction of this level. However, as long as a slither of hope existed, he would not give up.</p><br/><p>This was a 5-star formula!</p><br/><p>If he could obtain it...</p><br/><p>Chen Feng clenched his fist.</p><br/><p>Chen Feng reached the 23rd lounge of the 7th floor as per the address given. Within, the interview had begun. A lot of beginner producers were standing below while on the stage stood a few youngsters with imposing manners. From the auras that were faintly radiating from their bodies, these people were actually E-class genetic warriors!</p><br/><p>\"E-class...\"</p><br/><p>Chen Feng frowned.</p><br/><p>It seemed like their requirements would not be low.</p><br/><p>\"Quiet!\"</p><br/><p>The leader of the youngsters on stage gestured with his hand.</p><br/><p>The lounge quieted down immediately.</p><br/><p>\"I am Xu Fei.\"</p><br/><p>Feeling satisfied, the youngster nodded. \"I hereby thank everyone for their punctuality. This time, we will be entering a historical ruin. We need a gene producer to provide assistance, so we entrusted the Gene Production Association to hold this interview session. Due to the limitations of our terms, we can only choose a beginner producer.\"</p><br/><p>Here, he paused slightly. \"The strongest one.\"</p><br/><p>Whoosh!</p><br/><p>The atmosphere in the lounge became nervous as all the gene producers looked at each other with hostility.</p><br/><p>This was a 5-star formula!</p><br/><p>This was different from how the Gene Production Association transferred the data of their formula. The data of a normal formula would always be sealed within a chip. Before it was opened, it could be sold! Even if they didn’t want to learn it, they could also sell it for a huge amount of money! The money was enough for a lot of people to increase their production level by a few stars.</p><br/><p>Chen Feng narrowed his eyes as he watched on silently.</p><br/><p>\"Today, your interview is very simple.\"</p><br/><p>Xu Fei took out an ancient-looking disk. A lot of blood-colored cracks could be seen on it. Scarlet-colored red light could be seen flickering like an eye out of the blood essence in the middle of the disk.</p><br/><p>\"This is a restriction plate. Contained within is a drop of an ancient blood essence. This is a restriction that exceeds your current level; hence, there’s no need for you all to complete it. Everyone will be given two minutes time. Within the time limit, the one that can gather the highest amount of valid genes will be the final winner.\"</p><br/><p>Xu Fei said lightly, \"So, who wants to start first?\"</p><br/><p>\"Me.\"</p><br/><p>A person walked out and stated proudly, \"I, Huo Shi, am someone who has been on explorations before. In regards to lifting restrictions, I am definitely much more practiced than others.\"</p><br/><p>As he finished, he walked to the restriction plate, closed his eyes as a glimmer of light flickered, and entered the digitized mode.</p><br/><p>\"Hum—\"</p><br/><p>Chen Feng could see with his naked eyes how patterns started to surface on the disk, covering the hundreds of imprints on the disk. One after another, lines on the disk started to glow.</p><br/><p>10 lines, 20 lines, 30 lines...</p><br/><p>Finally, it stopped at 90 lines. Huo Shi exited the digitized mode while the glow on the disk quietly disappeared, as if it had never appeared.</p><br/><p>\"90 lines. Not bad.\"</p><br/><p>Xu Fei sighed while that person retired proudly.</p><br/><p>Subsequently, others started going up on stage. 30 lines, 50 lines, 20 lines, 80 lines... There were all sort of results. However, none were able to surpass Huo Shi.</p><br/><p>\"A bunch of weaklings.\"</p><br/><p>Huo Shi was immensely pleased with himself.</p><br/><p>\"90 lines is the strongest?\"</p><br/><p>Xu Fei frowned as he exchanged glances with his friends. Based on the reward they had promised, how could it only attract producers of this level? Things would be somewhat difficult if someone at this level were to follow them to the ruins.</p><br/><p>\"It’s due to the time limitation.\"</p><br/><p>\"If we can spend two more days, we can definitely find a better one.\"</p><br/><p>The only female in the group, Zhou Ling, reminded.</p><br/><p>\"That’s true.\"</p><br/><p>Xu Fei nodded. \"It shall be him, then.\"</p><br/><p>\"Your name is Huo Shi, right?\"</p><br/><p>Xu Fei looked at him. \"Since you are the strongest...\"</p><br/><p>However, right at this moment, Chen Feng walked over. \"Excuse me, could I try?\"</p><br/><p>The lounge suddenly became silent.</p><br/><p>\"You are?\"</p><br/><p>Xu Fei looked at him.</p><br/><p>\"Beginner producer, Chen Feng.\"</p><br/><p>Chen Feng introduced himself.</p><br/><p>\"Let me look at your certification details.\"</p><br/><p>Xu Fei nodded. These were the basics of an interview. Chen Feng needed to show Xu Fei part of the data contained within his digitized panel.</p><br/><p>\"All right.\"</p><br/><p>Chen Feng sent his certification details over.</p><br/><p>Xu Fei swept though it and was immediately stunned. \"1 star?\"</p><br/><p>The whole lounge was silent, and immediately, the whole room roared with laughter.</p><br/><p>One star?</p><br/><p>Was this child here to amuse them?</p><br/><p>Although only \"beginner producer\" was written within the mission and there were no requirements on star rating, wasn’t it somewhat excessive for a rookie to actually think of accepting this mission?</p><br/><p>Someone rated 1 star, how strong could he be?</p><br/><p>‘You are competing against me with just this?’</p><br/><p>Huo Shi, who was still worried earlier, rolled his eyes. Producers nowadays were really...</p><br/><p>\"Sorry.\"</p><br/><p>Xu Fei smiled forcefully. \"This level, I’m afraid...\"</p><br/><p>\"Continue reading.\"</p><br/><p>Chen Feng smiled.</p><br/><p>\"Oh?\"</p><br/><p>As Xu Fei saw how collected Chen Feng was, he continued reading. When he reached the part where 'possessing lumberbear gene – battle’ was shown, his expression became serious. Able to possess his own formula at the beginner producer level? This level...</p><br/><p>Only now did Xu Fei looked at Chen Feng seriously.</p><br/><p>He knew that there were some extremely stubborn gene producers. As long as they didn’t master one formula, they would not change to another formula. And the one before him seemed to be this type of gene producer?</p><br/><p>Even if he only had 1 star!</p><br/><p>The earlier incident involving Chen Feng and Professor Tao was something that he had heard about as well. It was unexpected for the main character of that incident to actually be standing in front of him. Chen Feng...</p><br/><p>Xu Fei pondered for a short while. \"Alright. You can try.\"</p><br/><p>\"Thanks.\"</p><br/><p>Chen Feng nodded slightly.</p><br/><p>This time, fame displayed its usefulness.</p><br/><p>The people around them had strange looks on their faces. What was actually written in this youngster’s qualifications to be able to obtain respect from an E-class genetic warrior?</p><br/><p>\"This fellow...\"</p><br/><p>Huo Shi had a bewildered look in his eyes. Had he came across some exceptional genius?</p><br/><p>Shua!</p><br/><p>Chen Feng silently walked forward. With both hands floating above the disk, he entered the digitized mode.</p><br/><p>\"Bang!\"</p><br/><p>A radiant light exploded before his eyes.</p><br/><p>Countless genes emerged around him, moving like swirling lights.</p><br/><p>In the background that was dark and void-like, the ancient disk became immensely large. The patterns on the disk became exceptionally distinct. Chen Feng could easily sense that every single pattern, every single imprint, required a specific gene for it to be activated. Only when all the genes were activated could this restriction be lifted.</p><br/><p>This... was a restriction?</p><br/><p>Chen Feng contemplated.</p><br/><p>One second...</p><br/><p>Two seconds...</p><br/><p>Ten seconds...</p><br/><p>Chen Feng attentively researched this so-called restriction.</p><br/><p>At this moment, as the producers around him saw that there was no activity from Chen Feng after a long time, they started laughing.</p><br/><p>\"Indeed, a 1-star is still a 1-star after all.\"</p><br/><p>\"The beginner producers nowadays are getting conceited.\"</p><br/><p>Everyone sneered.</p><br/><p>It was not scary for someone to not have ability. However, coming here to compete against others when you did not have the ability, you were in the wrong.</p><br/><p>\"I really did think too much.\"</p><br/><p>Huo Shi did not hide his contempt at all. He had thought that this guy had some trump card. After wasting so much time, this was actually a rookie.</p><br/><p>\"Even this type of trash wants to compete against me?\"</p><br/><p>Huo Shi laughed.</p><br/><p>Xu Fei looked on in silence.</p><br/><p>Twenty seconds.</p><br/><p>Thirty seconds.</p><br/><p>One minute.</p><br/><p>There were no reactions from the markings on the disk.</p><br/><p>This meant that within one whole minute, Chen Feng did not activate a single one! Not even one gene was found! This level...</p><br/><p>\"Pure rookie?\"</p><br/><p>Xu Fei sighed with regret. It seemed like he had made a mistake.</p><br/><p>It seemed like this person called Chen Feng was only able to produce a new mutated lumberbear gene by fluke.</p><br/><p>He gave up.</p><br/><p>The remaining team members were also waiting to mock him.</p><br/><p>However, nobody expected that, right at that moment, the patterns on the disk would start glowing with an unprecedented speed.</p><br/><p>Ten lines!</p><br/><p>Twenty lines!</p><br/><p>Thirty lines!</p><br/><p>...</p><br/><p>Within eight seconds, the amount of glowing patterns reached 80 lines.</p><br/><p>\"How is this possible?\" Huo Shi stated alarmingly.</p><br/><p>80 lines activated in eight seconds? How was it possible for a beginner producer to accomplish this?! What kind of luck and speed were required to be so fast?</p><br/><p>\"Luck. Must be luck!\"</p><br/><p>Huo Shi comforted himself.</p><br/><p>However, the next moment, his heart grew cold.</p><br/><p>On the disk, the radiant glow continued.</p><br/><p>90 lines!</p><br/><p>100 lines!</p><br/><p>Chen Feng had undoubtedly surpassed him.</p><br/><p>\"How is this possible?\"</p><br/><p>Huo Shi was stupefied. \"He only knew one gene formula... He was a pure rookie with only a 1-star gene-production level, how could he be so powerful!\"</p><br/><p>Not only him, everyone else was also shocked as the red light continued to shine.</p><br/><p>200 lines!</p><br/><p>300 lines!</p><br/><p>On the ancient disk, all the patterns were being lightened up in an unimaginable speed. Finally, as the time reached 1 minute and 55 seconds, the whole disk was completely activated.</p><br/><p>\"Hum—\"</p><br/><p>Red light radiated; a bright radiance blossomed from the disk.</p><br/><p>\"Ka cha!\"</p><br/><p>The sealed disk was suddenly opened.</p><br/><p>Opened!</p><br/><p>It was actually opened!</p><br/><p>Everyone was shocked. The restrictions on this disk were actually opened by Chen Feng!</p><br/><p>\"Shit!\"</p><br/><p>Huo Shi was stupefied. His mouth was opened so wide a chicken egg could be shoved into it. F*ck, what freak was this. Only 1-star rating yet possessing such terrifying ability?</p><br/><p>Did he still want others to live?</p><br/><p>\"Good, good, good!\"</p><br/><p>\"I am indeed right!\"</p><br/><p>Xu Fei was in ecstasy. Even he did not expect that, among the beginner producers, there would exist one capable of lifting this restriction! As for that 1-star rating of Chen Feng's...</p><br/><p>Who cared?</p><br/><p>They did not need Chen Feng to battle anyway.</p><br/>\n</div>"}