{"title": "Chapter 36: Dancing on the Tip of a Sword", "id": 36, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-36-dancing-on-the-tip-of-a-sword", "volume_title": "Volume 1", "body": "<h1>Chapter 36: Dancing on the Tip of a Sword</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 36: Dancing on the Tip of a Sword</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"It’s you!\"</p><br/><p>The expression of Long Yue, who was still showing off his prowess a moment ago, changed greatly when he saw the little girl. He immediately grabbed toward the seadragon blood essence and accelerated backward. He actually fled without the slightest hesitation.</p><br/><p>\"Thinking of leaving?\"</p><br/><p>A cold and crisp sound echoed.</p><br/><p>\"Bang!\"</p><br/><p>The bright and resplendent sword ray descended once again.</p><br/><p>A flash of red light.</p><br/><p>\"Plop!\"</p><br/><p>Blood splattered and a severed arm soared. The hand that was grabbing onto the seadragon blood essence released its grip, and the seadragon blood essence fell into the sea together with the severed arm.</p><br/><p>\"Hiss—\"</p><br/><p>Everyone inhaled a breath of cold air.</p><br/><p>\"Wang Yao!\" a mournful scream resounded.</p><br/><p>Long Yue stared at the little girl in front of him in resentment. \"You are courting death! When I return, I will get someone to destroy your Wang family! I am going to let your whole family…\"</p><br/><p>\"Noisy!\"</p><br/><p>Wang Yao sneered. \"If that’s the case, you can leave more parts behind.\"</p><br/><p>\"Bang!\"</p><br/><p>A flash of red light.</p><br/><p>Another arm soared into the sky.</p><br/><p>\"You…\"</p><br/><p>That person stared at Wang Yao in resentment and spat out a mouthful of blood before disappearing in a flash of red, losing his courage to leave any fierce words before leaving.</p><br/><p>Everyone watched this scene in a daze.</p><br/><p>This little girl was too spirited!</p><br/><p>Destroying heaven and earth the moment she appeared. The Long Yue that was so unbridled earlier had both his arms slashed off and ran off without even daring to leave a fart behind.</p><br/><p>But… who on earth was she?</p><br/><p>Was she here to save them or to kill them?</p><br/><p>After so many bouts of desperation, everyone no longer dared to have any wishful thinking. Luckily, the little girl was currently ignoring them.</p><br/><p>\"Seadragon blood essence?\"</p><br/><p>\"Hum!\"</p><br/><p>Red light glimmered in Wang Yao’s hands. Just as she was prepared to start looking for the seadragon blood essence in the seawater, an old and imposing voice resounded, \"Little girl. This thing, it’s not something you can take, right?\"</p><br/><p>Chen Feng’s heart leaped.</p><br/><p>This voice…</p><br/><p>Their headmaster!</p><br/><p>\"Bang!\"</p><br/><p>An old man and a few teachers appeared. As soon as the barrier here had been removed, they had rushed here immediately. They had not expected that, apart from saving these students, there would also be an unexpected harvest.</p><br/><p>Seadragon blood essence, what a precious thing.</p><br/><p>\"It’s teacher, headmaster, and the others.\"</p><br/><p>All the students were crying tears of joy.</p><br/><p>They were saved.</p><br/><p>This time, they were really saved!</p><br/><p>Everyone started cheering. Chen Feng and Xu Fei, on the other hand, felt their heart leaping as they felt something amiss. The school had actually appeared at this time? Regardless of Wang Yao or the school, each party was capable of saving them. However, with both appearing at the same time, especially when there was such a thing like the seadragon blood essence here…</p><br/><p>\"Scram!\"</p><br/><p>Wang Yao’s tiny face chilled as she opened her mouth and said without a trace of politeness, \"A bunch of old men who refuse to die. You are all appearing at this time to fight over this thing with me?\"</p><br/><p>\"Little girl. This thing was originally something refined by the students of my school.\"</p><br/><p>Headmaster Zhou Wenwu stated kindly, \"It should be you who is fighting over the results of these children, right?\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>Those words, even he felt ashamed on behalf of the headmaster. How thick did one’s face need to be in order to say those words? Did he not see how all the students were keeping their silence?</p><br/><p>Su Jin stood out at this moment. \"Headmaster, actually, she saved—\"</p><br/><p>\"You are called Su Jin, right?\" The headmaster nodded his head, appearing to be gratified, and interrupted her words. \"You did very well this time. You only need to bring all the other students as you stand aside and spectate. This matter is not something you all can get involved in.\"</p><br/><p>\"Ah?\"</p><br/><p>Su Jin was bewildered.</p><br/><p>\"Hmph.\"</p><br/><p>Wang Yao sneered. \"Even if you want to fight over this thing, it still depends on whether you all are capable of it.\"</p><br/><p>\"Bang!\"</p><br/><p>A large amount of red light emerged and an immense flaming sword condensed in her hand.</p><br/><p>The two-meter-long huge sword was inversely proportioned compared to her petite body. However, the blazing flame on the huge sword caused even Zhou Wenwu to feel pressured.</p><br/><p>This power…</p><br/><p>\"Bang!\"</p><br/><p>Wang Yao soared to the air as she unleashed a terrifying power.</p><br/><p>\"Hmph!\"</p><br/><p>Zhou Wenwu sneered and confronted Wang Yao in midair.</p><br/><p>\"Bang!\"</p><br/><p>In a split second, the whole sky above the sea turned red.</p><br/><p>\"Burning cloud?\"</p><br/><p>Countless people at Gold City looked in that direction in amazement.</p><br/><p>At this moment, the teachers that came with the headmaster charged into the seawater and started looking for the seadragon blood essence. However, that seadragon blood essence was not an ordinary object. It streaked around without stop in the seawater. Even tens of teachers could not catch it.</p><br/><p>\"Damn it!\"</p><br/><p>One of the teachers became ruthless and glanced at the students on the shore, \"You all come down and look for it as well.\"</p><br/><p>All the students started hesitating.</p><br/><p>No matter what, that Wang Yao was someone who had saved them. To fight over this thing with her…</p><br/><p>The faces of these students were not that thick.</p><br/><p>\"The one who finds that thing will be the most outstanding student of the current batch! The school will mark down your contributions in the resumes you send to the universities!\" that teacher stated lightly.</p><br/><p>Bang!</p><br/><p>The heart of all the students jolted.</p><br/><p>The top student?</p><br/><p>As far as a student was concerned, this title represented honor and glory. It was something that would follow them forever. During their few years in university, it would bring upon them an extraordinary meaning.</p><br/><p>They were tempted.</p><br/><p>\"Teacher, let me help you.\"</p><br/><p>A student jumped into the seawater.</p><br/><p>The other students exchanged glances and entered the seawater in succession.</p><br/><p>Chen Feng smiled playfully.</p><br/><p>Students…</p><br/><p>This was Gold City High School’s education method?</p><br/><p>\"All these thankless wretches.\"</p><br/><p>Xu Fei looked down on these students.</p><br/><p>\"They are still young, after all,\" Chen Feng stated softly.</p><br/><p>Xu Fei and the rest rolled their eyes. ‘As if you are very old.’</p><br/><p>\"Seadragon blood essence …\"</p><br/><p>As Chen Feng looked at those people flopping around in the seawater, he suddenly looked at Monkey. \"Monkey, is your ability able to see the seadragon blood essence?\"</p><br/><p>\"No.\" Monkey shook his head. \"This item itself is the king of the seas. Falling into the seawater, coupled with the faint intelligence it possesses, it is very hard to find. That’s why those teachers are allowing the students to help. Whether one can find it or not is totally dependent on luck. However, with this many people, they will find it sooner or later.\"</p><br/><p>Dependent on luck?</p><br/><p>Chen Feng shook his hand and looked at the 50 points of luck value he had. Suddenly, his heart was burning.</p><br/><p>\"So be it, then.\"</p><br/><p>Chen Feng shook his head and stretched lazily. \"I still thought that you could sell them a favor with this.\"</p><br/><p>\"How could a favor be so easy to sell?\" Xu Fei laughed.</p><br/><p>Since there was no danger, the few of them could only wait there. Those teachers would probably not let them go before the result was out anyway.</p><br/><p>\"This water doesn’t seem to be active anymore.\"</p><br/><p>Chen Feng reached the edge of the water without a change of expression and silently submerged a reagent bottle into the water. At the same time, his Luck Aura was activated!</p><br/><p>Whoosh!</p><br/><p>The luck value was frantically being exhausted!</p><br/><p>Ten points!</p><br/><p>Twenty points!</p><br/><p>Thirty points!</p><br/><p>Forty points!</p><br/><p>Suddenly, Chen Feng’s hand trembled. He could keenly feel something knocking against his reagent bottle.</p><br/><p>Could it be…</p><br/><p>Chen Feng’s mouth was dry. Outwardly, he did not dare to leak any of his emotions. Silently, he sealed the reagent bottle, hid the bottle in his cuff, and calmly stood up.</p><br/><p>\"Yeah.\"</p><br/><p>Xu Fei looked at the seawater. \"From today onward, I’m afraid there won’t be any Dragon’s Passing Mountain anymore. As the source has disappeared, the water here will gradually dry up.\"</p><br/><p>Everyone else felt the same.</p><br/><p>Who would have thought that they would encounter such an incident in this single exploration of theirs?</p><br/><p>\"Let’s go to the shore.\" Chen Feng shook his head. \"It still feels dangerous here.\"</p><br/><p>\"Mhm.\"</p><br/><p>Zhou Ling nodded her head.</p><br/><p>Ice appeared. Everyone reached the shore and stopped there to wait.</p><br/><p>All this while, Chen Feng had had Luck Aura activated!</p><br/><p>He was afraid that even the tiniest bit of abnormality around him would be noticed. To play a trick in front of so many powerful genetic warriors was akin to dancing on the tip of a knife.</p><br/><p>One point!</p><br/><p>Two points!</p><br/><p>The luck value was still being exhausted.</p><br/><p>Chen Feng leaned against a big tree and sat down to rest. Soundlessly, he hid the reagent bottle earlier into the shrub behind him and buried it with the sand.</p><br/><p>Up until now, a total of 48 points of luck value were exhausted!</p><br/><p>\"Done!\"</p><br/><p>Chen Feng was inwardly excited as he finally felt relieved.</p><br/>\n</div>"}