{"title": "Chapter 40: The Strongest Gene!", "id": 40, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-40-the-strongest-gene", "volume_title": "Volume 1", "body": "<h1>Chapter 40: The Strongest Gene!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 40: The Strongest Gene!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Currently, within a rented house at Gold City, Chen Feng was feeling very satisfied as he looked at the materials he had gathered. 30 sets of savage desert ant’s blood essence that contained the best genes, which he had personally picked. This was how he had collected the savage desert ant’s blood essence. Bringing along a huge pile of cash to purchase would always appear more attractive compared to purchasing with fund transfers!</p><br/><p>\"And I still need to thank those three idiots.\"</p><br/><p>Chen Feng smiled calmly.</p><br/><p>Since he had received news about it beforehand, how could he miss the three of them? They had put so much effort into it. Unfortunately, they had chosen the wrong opponent.</p><br/><p>\"A single gold ant gene reagent requires 10 sets of savage desert ant’s blood essence.\"</p><br/><p>Chen Feng calculated and noted that all the money he had saved recently was only sufficient for him to produce three sets of the reagent.</p><br/><p>\"The cost is somewhat high.\"</p><br/><p>Chen Feng head was aching somewhat.</p><br/><p>However, he had no other options. This was something he had to do.</p><br/><p>A gene producer was originally a profession where one invested greatly during the early stages before reaping huge profits in the late stages! As such, an outstanding gene producer was incomparably valuable.</p><br/><p>\"Let’s produce one first.\"</p><br/><p>Chen Feng made up his mind.</p><br/><p>Putting his thought into action immediately, he started researching all the information related to the gold ant gene and spent two whole days before he manage to grasp all the information and collect all the required materials. This was especially true for the incubator liquid required during the third step, the gene fusion step. A countless number of valuable materials needed to be allocated for this, and there was no space for mishaps.</p><br/><p>It was very hard to produce a gold ant gene.</p><br/><p>Although Chen Feng’s gene production level had increased greatly, if he were to forcefully produce this kind of 5-star formula, the success rate would be a pathetic 1%!</p><br/><p>Luckily, he possessed the Luck Aura.</p><br/><p>\"I can start now.\"</p><br/><p>Chen Feng inhaled deeply.</p><br/><p>Start!</p><br/><p>Whoosh!</p><br/><p>Lights swirled as Chen Feng entered the digitized mode.</p><br/><p>Similar to the thundersnake gene, the gold ant gene’s production was very hard as well. No less than 300 strains of genes needed to be collected during the gene search step. Even with the Luck Aura activated, Chen Feng almost failed!</p><br/><p>The gene search process of an F-class formula alone had already in itself matched the difficulty of the restriction Xu Fei brought during the interview?</p><br/><p>Worthy of being a 5-star formula indeed!</p><br/><p>Luckily, after the exploration trip with Xu Fei, Chen Feng’s gene search ability had improved greatly. He managed to forcefully complete the gene search process in the end.</p><br/><p>When producing a normal gene, Chen Feng was not worried at all during the first and second steps. He only needed to consume one point of luck value for the gene fusion step and the reagent would be easily completed. However, when producing these high-difficulty genes, even during the initial two steps, Chen Feng did not dare to relax the slightest bit.</p><br/><p>First step, gene search, completion!</p><br/><p>Luck value exhausted by one point.</p><br/><p>Second step, gene reaction, completion!</p><br/><p>Luck value exhausted by one point.</p><br/><p>The catalyzed reaction for the 300 strains of genes gave Chen Feng a headache. Luckily, Chen Feng had improved rapidly nowadays. As such, he managed to complete all the reactions without any mishaps.</p><br/><p>Third step, gene fusion, completion!</p><br/><p>Luck value exhausted by one point.</p><br/><p>The crux for producing special genes was the preparation of the incubator liquid. The moment the lone gene started to duplicate itself in the incubator liquid was the moment the gold ant gene’s production completed!</p><br/><p>----</p><br/><p>Gene name: Gold Ant Gene</p><br/><p>Gene type: Special</p><br/><p>Gene function: Triggering the potential in one’s body, permanently increase one’s spiritual energy by 20 points</p><br/><p>Gene introduction: With savage desert ant’s blood essence as the core, forming a special gene reagent by refining the blood essence with all sorts of valuable materials.</p><br/><p>----</p><br/><p>Success!</p><br/><p>Chen Feng was excited. This was the first 5-star difficulty reagent he had produced. A peak attribute gold ant gene reagent! As long as he could sell more of them, reaching a 20-star rating wouldn’t be a problem. However, Chen Feng quickly calmed down from his excitement.</p><br/><p>This was a peak attribute gene reagent, yet there was still no mutation.</p><br/><p>\"Still no mutation?\"</p><br/><p>Chen Feng was made aware of an issue.</p><br/><p>Thundersnake gene had no mutation! Gold ant gene had no mutation either! Was it due to the mutation being too hard to achieve, or was it due to these formulas with high star ratings not having a mutation at all?</p><br/><p>Chen Feng was somewhat anxious.</p><br/><p>His advantage that enabled him to far exceed others was his ability to uncover the unknown potential of genes, regardless of the probability.</p><br/><p>Hence—</p><br/><p>He was always looking forward to the arrival of his second mutated gene.</p><br/><p>However, it had not appeared!</p><br/><p>The thundersnake gene and gold ant gene did not even have a normal mutation. Hence, there was no need to mention the concealed genes with an unknown probability. It did not exist at all!</p><br/><p>Mutated genes were, after all, the minority among so many genes.</p><br/><p>\"Is there really no mutation?\"</p><br/><p>Chen Feng searched about it online and was immensely disappointed.</p><br/><p>Perhaps it was really a coincidence for him to be the first person to discover the mutated lumberbear gene. From now on, he would be the same as ordinary producers?</p><br/><p>For some reason, Chen Feng could not be satisfied with this.</p><br/><p>After enjoying the benefits fame brought, however small that fame it was…</p><br/><p>Chen Feng was somewhat dissatisfied.</p><br/><p>\"Am I like Professor Tao now?\"</p><br/><p>Chen Feng laughed involuntarily. Soon, he recalled something.</p><br/><p>How was a gene formula found?</p><br/><p>It was something found through countless attempts of the previous generations, a result of non-stop experiments, something that was successfully created after the research and improvement of countless people! Since a formula was a research result in itself, did it mean that there might be some fault in the research itself?</p><br/><p>For example, mutated lumberbear gene!</p><br/><p>Perhaps…</p><br/><p>There was a problem in the formula itself?</p><br/><p>Chen Feng’s lips and tongue felt dry.</p><br/><p>As a newbie producer, he was questioning the predecessors!</p><br/><p>It was not due to the predecessors being incapable. Rather, it was because, if there were certain aspects with an extremely low appearance probability, their formula might not be able to discover that thing as well?</p><br/><p>‘If that’s the case, does that mean I can improve the formulas?’</p><br/><p>Chen Feng’s eyes were burning.</p><br/><p>This was the first time he felt the madness within him.</p><br/><p>\"Let’s try.\"</p><br/><p>Chen Feng followed the wishes of his burning heart.</p><br/><p>Since the thought surfaced, he had to try. However, how should he get started?</p><br/><p>\"Formula…\"</p><br/><p>\"Improvement…\"</p><br/><p>Chen Feng sank into contemplation.</p><br/><p>He was already familiar with the three steps of gene production. If modifications were required, then naturally, all three steps needed to be modified as well! Chen Feng busied himself for two days before he was done with his preparations.</p><br/><p>First step, gene search.</p><br/><p>\"Bang!\"</p><br/><p>The light before his eyes cracked as Chen Feng entered the digitized mode.</p><br/><p>In the past, every time Chen Feng performed gene search, he merely activated the Luck Aura and grabbed whatever genes he laid his eyes on, stopping as soon as the amount was sufficient. This was because he knew that the genes he caught were the most suitable genes!</p><br/><p>However, was the quantity required correct?</p><br/><p>What if the required amount of the improved formula was not 300 genes? Or the type of requirements for the formula itself was different altogether?</p><br/><p>Then…</p><br/><p>Chen Feng slowly closed his eyes.</p><br/><p>Using his spiritual energy, he blocked all his senses, blocked everything, entering a peculiar digitized world. This world was enveloped in darkness!</p><br/><p>He couldn’t see anything, yet he could feel it.</p><br/><p>\"Whoosh!\"</p><br/><p>Chen Feng started casually grabbing genes.</p><br/><p>Not caring about the type and quantity, grabbing everything in front of him just like that. However many he caught would be totally dependent on luck! This was Chen Feng’s strongest production mode!</p><br/><p>Chen Feng named this—Hyper-dimensional mode.</p><br/><p>His plan was simple. To complete the formula transformation under this peculiar mode!</p><br/><p>‘The strongest gene! I must create the strongest gene!’ Chen Feng started chanting in his heart.</p><br/><p>With Chen Feng’s willpower as the foundation, Luck Aura began operating. A certain mysterious power started to operate furiously while Chen Feng's luck value started to slowly decline.</p><br/><p>It began!</p><br/><p>One point…</p><br/><p>Two points…</p><br/><p>Three points…</p><br/><p>It only stopped upon reaching five points. As luck values were not being exhausted anymore, Chen Feng was clear that the gene search step must have been completed at that point!</p><br/><p>Opening his eyes, Chen Feng’s heart leaped.</p><br/><p>Indeed…</p><br/><p>560 strains of genes!</p><br/><p>Compared to the previous 300 strains, even the gene types were totally different!</p><br/><p>This was something selected automatically by the Luck Aura!</p><br/><p>First step, completed.</p><br/><p>\"Very good.\"</p><br/><p>Chen Feng inhaled deeply.</p><br/><p>‘As long as it’s working, it’s good. Then, let’s get started with the second step—gene reaction.’</p><br/><p>\"Whoosh!\"</p><br/><p>Chen Feng closed his eyes.</p><br/><p>He had to maintain this mode, since if his eyes were opened, he would definitely be distracted by these genes, getting himself influenced by the familiar genes!</p><br/><p>Whoosh!</p><br/><p>The sequence of gene reactions was in disorder.</p><br/><p>Chen Feng conveniently grabbed one gene after another and started the gene reaction process.</p><br/><p>Reaction!</p><br/><p>One after another, they started reacting!</p><br/><p>Chen Feng did not care about the sequence anymore. This step was obviously the hardest. Chen Feng’s luck value was declining crazily at a frightening speed. When Chen Feng finally completed all the gene reactions, he had consumed 10 points of luck value, an extremely terrifying number!</p><br/><p>Done!</p><br/><p>Second step, completed!</p><br/><p>Chen Feng did not dare to open his eyes.</p><br/><p>He knew that the second step of gene reaction was complete. That special mutated gene might have really been produced by him. What was left was the third step, gene fusion!</p><br/><p>As long as the fusion was successful, it might give birth to this strongest gene!</p><br/><p>However, this was the most troublesome step.</p><br/><p>Not only the duplication of the gene, the crux was that the incubator liquid required for the duplication was something he did not have at all! He needed to use the available materials and prepare an incubator liquid capable of supporting the duplication of the mutated gene.</p><br/><p>This was an unknown gene and an unknown incubator liquid.</p><br/><p>If he wanted to complete it, he could only depend on Luck Aura.</p><br/><p>\"Luck Aura…\"</p><br/><p>As Chen Feng prepared to continue, he suddenly felt a pang of dizziness.</p><br/>\n</div>"}