{"title": "Chapter 43: Hunting Wind Foxes", "id": 43, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-43-hunting-wind-foxes", "volume_title": "Volume 1", "body": "<h1>Chapter 43: Hunting Wind Foxes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 43: Hunting Wind Foxes</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Greenhill Forest.</p><br/><p>Quietly, Chen Feng entered the forest.</p><br/><p>The sun was scorching.</p><br/><p>The sun shone through the dense tree leaves, bringing a flurry of heat with it. Chen Feng was cautiously observing his surroundings, not daring to lower his guard.</p><br/><p>\"F-class mutated beast, earthdrill bird.\"</p><br/><p>Chen Feng glanced at it and carefully avoided the beast.</p><br/><p>Although these mutated beasts were not a threat to him, Chen Feng was obviously not interested in these mutated beasts that would not bring him any apparent gains.</p><br/><p>F-class mutated beast, skyleap ape.</p><br/><p>F-class mutated beast, skysoar boar.</p><br/><p>…</p><br/><p>Chen Feng penetrated deep into the forest and finally reached the territory of the wind foxes.</p><br/><p>Looking into the distance, Chen Feng could clearly see one after another green- and white-colored foxes wandering on the hill, seemingly hunting something. After a long time, a mournful scream resounded.</p><br/><p>Chen Feng’s heart leaped.</p><br/><p>Several Wind Blades were instantly unleashed.</p><br/><p>A skysoar boar that was passing by was slashed into pieces. A group of illusionary-looking wind foxes exposed a savage expression on their faces and leaped at it viciously with their claws extended and directly tore the skysoar boar into pieces. Streams of blood were streaming down their claws, giving them an extremely terrifying appearance!</p><br/><p>\"Hiss—\"</p><br/><p>Chen Feng inhaled a breath of cold air.</p><br/><p>This was a mutated wind fox!</p><br/><p>Along with the increase in their strength, the killing instinct of these mutated beasts would also increase. With bloodlust as their second nature, no matter how meek they appeared, they were actually extremely terrifying.</p><br/><p>\"Whoosh!\"</p><br/><p>Chen Feng carefully aimed at a lone wind fox that was separated from the rest.</p><br/><p>His wristband vibrated as the mutated beast detector he had prepared started scanning.</p><br/><p>----</p><br/><p>Gene attributes:</p><br/><p>Strength: 15</p><br/><p>Agility: 22</p><br/><p>Physique: 18</p><br/><p>Spirit: 48</p><br/><p>----</p><br/><p>\"Ding—\"</p><br/><p>\"After comparing with your attributes, the result is as follows: five point increase in strength, 12 point increase in agility, eight point increase in physique, four point decrease in spirit. Not recommended to fuse.\"</p><br/><p>Chen Feng shook his head.</p><br/><p>He could still ignore the other three attributes, but for spirit to decrease? This was his main attribute. It seemed like this wind fox was not suited to be his gene-strengthening material. Chen Feng sprawled within the thicket and observed his surroundings without stop using his wristband.</p><br/><p>Suddenly, Chen Feng saw a wind fox that was distinctly larger than the rest and instinctively scanned it.</p><br/><p>---</p><br/><p>Gene attributes:</p><br/><p>Strength: 55</p><br/><p>Agility: 52</p><br/><p>Physique: 88</p><br/><p>Spirit: 100</p><br/><p>----</p><br/><p>\"Damn!\"</p><br/><p>Chen Feng was shaken.</p><br/><p>100 spirit? Was that the leader? If he killed that beast…</p><br/><p>Chen Feng’s eyes were red from temptation.</p><br/><p>However, as he recalled the unknown danger Mu Yuan mentioned, Chen Feng calmed himself down quickly. The attributes of a wind fox at this level far exceeded Chen Feng's!</p><br/><p>It was very probable that something bad would happen!</p><br/><p>Wind fox leader…</p><br/><p>Chen Feng took his thundersnake gene reagent out and looked longingly at the attributes of this wind fox leader on his wristband screen for a long time before finally deciding to give up on it.</p><br/><p>Mu Yuan’s words were still somewhat effective on Chen Feng.</p><br/><p>Currently, if he were too greedy, something bad might happen!</p><br/><p>\"Let’s change the target.\"</p><br/><p>Chen Feng sighed and continued searching the outer layer of the area.</p><br/><p>A suitable wind fox was not easy to find. Chen Feng was clear on his advantages and disadvantages. Only after one whole hour did Chen Feng lock onto another target.</p><br/><p>\"All the attributes are higher than mine by five points. After gene strengthening, I should get two points.\"</p><br/><p>Chen Feng was tempted.</p><br/><p>This was a feasible target.</p><br/><p>Chen Feng approached silently. However, when he was roughly ten meters from the wind fox, the wind fox moved slightly and abruptly looked toward Chen Feng’s direction.</p><br/><p>‘Not good, I’ve been discovered.’</p><br/><p>Chen Feng’s heart leaped.</p><br/><p>He was paying too much attention to the attributes and combat power of this wind fox and forgot that wind foxes also possessed a high level of awareness.</p><br/><p>\"Whoosh!\"</p><br/><p>As the wind fox sensed an unfamiliar aura, it abruptly scuttled toward that aura with a speed that was multiple times faster than Chen Feng's. A chain of three Wind Blades instantly condensed in front of the beast.</p><br/><p>Xiu! Xiu!</p><br/><p>One after another, Wind Blades pierced the air, heading toward Chen Feng.</p><br/><p>Chen Feng was shocked. ‘The heck. Is this 5%?’</p><br/><p>Whoosh!</p><br/><p>Chen Feng instinctively released a single Wind Blade.</p><br/><p>Only one appeared.</p><br/><p>The azure colored radiance collided with the wind fox’s light blade. However, in only a short moment, Chen Feng’s Wind Blade shattered. At the same time, together with three Wind Blades, the wind fox was already leaping toward Chen Feng. In these few short seconds, the wind fox had displayed its formidable killing ability.</p><br/><p>\"Can’t drag on.\"</p><br/><p>Chen Feng inhaled.</p><br/><p>This wind fox surpassed him in every aspect. If he did not use Luck Aura, he stood no chance at all.</p><br/><p>\"Ao—\"</p><br/><p>As the Wind Blades neared him, Chen Feng inhaled while he unleashed his Wind Blade. After the consumption of one point of luck value, a terrifying might was displayed by his Wind Blade.</p><br/><p>Ten-combo attack!</p><br/><p>Plop! Plop! Plop!</p><br/><p>Blue light flickered followed by a howl, and the wind fox was no longer conscious.</p><br/><p>Chen Feng quickly took out the prepared gene-absorbing tool and absorbed the wind fox’s gene before injecting it into himself.</p><br/><p>Hum!</p><br/><p>Chen Feng could feel a warm current entering his body.</p><br/><p>The freshly injected gene started to fuse with the gene within his body as the temperature of his body slightly increased. A few beads of sweat appeared on his body. However, it did not affect him much. He could feel his body increasing in quality. After the gene strengthening ended, his attributes had increased.</p><br/><p>----</p><br/><p>Gene attributes:</p><br/><p>Strength: 12</p><br/><p>Agility: 12</p><br/><p>Physique: 12</p><br/><p>Spirit: 54</p><br/><p>----</p><br/><p>Two point increase for each of his attribute. It was not an easy feat to find a suitable wind fox!</p><br/><p>Rustle!</p><br/><p>Before Chen Feng could even bask in the enjoyment that feeling brought, he could sense that peculiar sounds were starting to appear around him as the faint stench of blood spread around him.</p><br/><p>\"I need to leave.\"</p><br/><p>Chen Feng was cautious and left immediately.</p><br/><p>Less than one minute after he left, more than 10 mutated beasts appeared, fighting with each other as the wind fox’s corpse was torn apart.</p><br/><p>This was the world of mutated beasts!</p><br/><p>Without the assistance of Luck Aura, the one being ripped apart might be Chen Feng instead.</p><br/><p>\"Next.\"</p><br/><p>Chen Feng’s gaze wandered toward the distant wind foxes, looking for his next target.</p><br/><p>One…</p><br/><p>Two…</p><br/><p>Three…</p><br/><p>Chen Feng hunted quietly.</p><br/><p>After all, these wind foxes were only normal F-class mutated beasts. Under Chen Feng’s unlimited Wind Blades, they could pose no resistance. The only thing Chen Feng needed to take note of was to leave promptly after each kill. He definitely could not be discovered by other beasts, or else he would definitely die without even a burial site.</p><br/><p>After more than half day, Chen Feng’s spirit finally reached 62 points.</p><br/><p>Four instances of one point increases and three instances of two point increases!</p><br/><p>It was too hard.</p><br/><p>In seven hours, he had only performed seven gene strengthenings. On average, only one suitable beast was found per hour.</p><br/><p>After calculating, Chen Feng found that he had used a total 10 points of luck value. Among these, 3 points were used when he was fleeing from a few mutated beasts that he had accidentally encountered.</p><br/><p>Chen Feng calculated silently. \"Only a 10 point increase in spirit after consuming 10 points of luck value?\"</p><br/><p>Even the him that possessed Luck Aura encountered such hardship. How about the others?</p><br/><p>Gene strengthening was dangerous indeed.</p><br/><p>\"It’s getting late. I’ll go back after killing a few more,\" Chen Feng told himself.</p><br/><p>However, all the wind foxes had disappeared for some unknown reason.</p><br/><p>Chen Feng searched for a short while yet failed to find any wind foxes. Even when he penetrated deeper into the wind foxes’ birth place, he still couldn’t find a single wind fox.</p><br/><p>\"Something is wrong.\"</p><br/><p>Chen Feng felt something amiss.</p><br/><p>Retreat!</p><br/><p>Chen Feng retreated without hesitation. However, at this moment...</p><br/><p>\"Whoosh!\"</p><br/><p>A streak of light radiating with a cold glint flew over Chen Feng’s scalp as Chen Feng barely dodged this attack. If his agility hasn’t been increased earlier, he would have been killed by the attack.</p><br/><p>\"What was that?\"</p><br/><p>Chen Feng glanced around instinctively and felt his soul leaving his body.</p><br/><p>A dense group of wind foxes had appeared and surrounded him. They were looking at him with ice-cold gazes, arranged neatly without a single wind fox running around in a disorderly manner.</p><br/><p>\"What’s happening?\"</p><br/><p>Chen Feng felt something amiss. Had he been surrounded by wind foxes?</p><br/><p>How could these low-level mutated beasts possess intelligence?!</p><br/><p>While Chen Feng blanked, that wind fox leader appeared from the hill top. The scariest part of that wind fox leader’s appearance was the fact that there was a youngster seated on the wind fox leader.</p><br/><p>Using the wind fox as a mount?</p><br/><p>Chen Feng’s heart leaped. ‘Who is that!’</p><br/>\n</div>"}