{"title": "Chapter 55: Who Are You?", "id": 55, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-55-who-are-you", "volume_title": "Volume 1", "body": "<h1>Chapter 55: Who Are You?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 55: Who Are You?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"What did you say?\"</p><br/><p>Chen Feng’s heart leaped. However, no trace of nervousness was exposed on his face. Instead, he looked at Wang Yao with a surprised expression and said, \"How is that possible? Back then, I didn’t even enter the sea.\"</p><br/><p>\"I knew you wouldn't admit it.\" Wang Yao was not surprised. \"If that thing is really on you, then you need to be careful. That thing’s worth is far surpassing your imagination. Those people will not let anyone off during their investigations! My guess is that everyone that was on Dragon’s Passing Mountain back then has been investigated in the dark.\"</p><br/><p>\"Furthermore, even if you have it, can you really use it?\"</p><br/><p>Wang Yao raised her head and looked at Chen Feng as she said solemnly, \"How many years do you need before you can actually use a blood essence at that level? Five years? Ten years? Twenty years? With your current strength, if you were to sell it, no matter who you sell it to, there will be a possibility of you getting killed to keep this a secret! Hence, if you hand the blood essence to me, I can promise to do you three unconditional favors.\"</p><br/><p>Three favors!</p><br/><p>Chen Feng was tempted.</p><br/><p>He had only started his training for a short period of time. However, how many dangers had he met?! Regardless of the Long family at Dragon’s Passing Mountain or the mutant at the Greenhill Forest, these dangers were all unexpected incidents!</p><br/><p>Even if he wanted to avoid those dangers, he wouldn’t be able to!</p><br/><p>He was able to deal with most incidents he encountered. However, for certain unforeseen dangers, a strong backer was required to face them! Wang Yao would be a good candidate as his backer!</p><br/><p>Three favors from her was equivalent to three lives!</p><br/><p>This was a viable exchange.</p><br/><p>Furthermore, what Wang Yao said was true. Would he be able to put the seadragon blood essence to use? It was simply something that might drag him into danger if he were to keep it. Trouble could come knocking at any time!</p><br/><p>However…</p><br/><p>Chen Feng sank into deep contemplation.</p><br/><p>Currently, what worried him the most was not Wang Yao. Instead, it was Wang Yue. His relationship with Wang Yue was bad. He did not expect it to improve in the future either. In the end, Wang Yue was still Wang Yao’s brother!</p><br/><p>This was his main worry.</p><br/><p>However, he was not worried that Wang Yao was one of those that would act recklessly. Otherwise, in order to get revenge for her brother, she could have destroyed Chen Feng anytime she wanted.</p><br/><p>And now, Wang Yao suspected that he had the seadragon blood essence in his hands.</p><br/><p>If she was a person who would reach her goal by any means, she would have already captured Chen Feng and started force-reading his memory.</p><br/><p>Such occurrences were very common in this era!</p><br/><p>With Chen Feng’s strength, would he be able to resist?</p><br/><p>No.</p><br/><p>However, Wang Yao did not do so.</p><br/><p>Her suggestion of exchanging the blood essence with three favors from her was a gesture out of respect. Chen Feng did not know why was he getting this favorable treatment from her. He also wasn’t sure if she was actually plotting something or not.</p><br/><p>\"You are worried about Wang Yue and the Wang family?\" Wang Yao suddenly said.</p><br/><p>Chen Feng narrowed his eyes and kept silent.</p><br/><p>\"If that’s the case, you don’t have to worry,\" Wang Yao said indifferently. \"The Wang family and I are two different entities. If it wasn’t for my relationship with Wang Yue, those people from the Wang family would not even be qualified to carry my shoes.\"</p><br/><p>Chen Feng’s heart leaped.</p><br/><p>\"You and Wang Yue can settle your grudges among yourselves.\"</p><br/><p>Wang Yao glanced at Chen Feng with an indifferent expression. \"As for the Wang family… since I say that I will do you three favors, regardless of saving or taking lives, this naturally…\" Wang Yao paused, smiling sweetly as she emitted an astonishing killing intent, \"includes those from Wang family.\"</p><br/><p>\"Hiss—\"</p><br/><p>Chen Feng inhaled a mouthful of cold air.</p><br/><p>Wang family included!</p><br/><p>He was aware that this little girl would not lie to him. There was also no need for her to do so. When talking about the Wang family, the killing intent flickering in the little girl’s eyes was truly astonishing!</p><br/><p>This proved that—</p><br/><p>If he really wanted Wang Yao to kill someone from the Wang family, she would really do it!</p><br/><p>If so, this was scary indeed.</p><br/><p>Was this little girl really someone from the Wang family? Wait, if she was really someone from the Wang family, she should be the one they put their main efforts into nurturing, right? Why was Wang Yue the one chosen instead?</p><br/><p>Furthermore, she was clearly Wang Yue’s elder sister. This made things even weirder.</p><br/><p>Wang Yao, who are you exactly?</p><br/><p>\"Originally, I wouldn't have done all this.\" Suddenly, Wang Yao said softly, \"These things I do for Wang Yue will be the last help I give him as his sister. If he remains stubborn and refuses to change and insists on staying in the Wang family, his future…\"</p><br/><p>Wang Yao stopped here. However, what Chen Feng heard was enough to shake him to his core.</p><br/><p>Wang family…</p><br/><p>Wang Yao…</p><br/><p>The relationship between the two of them was indeed not simple.</p><br/><p>\"Why are you telling me this?\" Chen Feng suddenly asked.</p><br/><p>\"After keeping this a secret for all this time, I feel tired.\"</p><br/><p>A trace of bewilderment flickered in her pair of quick-witted eyes before they quickly became pure again. She said indifferently, \"Besides that, would you give me the seadragon blood essence without my assurance?\"</p><br/><p>Chen Feng looked at her calmly.</p><br/><p>Wang Yao raised her head and looked into Chen Feng’s eyes as well.</p><br/><p>At this moment, time seemed to freeze.</p><br/><p>Suddenly, Chen Feng felt that this cold and arrogant little girl with terrifying strength had a different side to her. From her eyes, myriad worlds could be seen.</p><br/><p>After a long time.</p><br/><p>Chen Feng sighed. \"You are sure that it is in my hands?\"</p><br/><p>\"Intuition.\" Wang Yao winked naughtily.</p><br/><p>Chen Feng surrendered. \"You win.\"</p><br/><p>\"May we cooperate happily.\"</p><br/><p>Wang Yao extended her hand indifferently.</p><br/><p>Chen Feng shook her hands, feeling the jade-like warmth in his hands.</p><br/><p>At the camp, Wang Yue was bored as he had been waiting for quite a while.</p><br/><p>\"Sister.\"</p><br/><p>As Wang Yao and Chen Feng returned, Wang Yue hastily stepped forth. \"We…\"</p><br/><p>\"You return first.\" Wang Yao waved her hands. \"I still have something to do with Chen Feng.\"</p><br/><p>\"???\"</p><br/><p>Wang Yue was stupefied.</p><br/><p>What was this? Was he dumped again?</p><br/><p>Looking at his sister and Chen Feng, who were leaving, he started to have a bad feeling. Damn it, looking at how things were developing, Chen Feng wouldn’t become his brother-in-law, right?</p><br/><p>Shit!</p><br/><p>Just imagining the scene shocked him to no end.</p><br/><p>\"No, it won’t be.\"</p><br/><p>Wang Yue mumbled. His sister was his idol. How would she fall for trash like Chen Feng! They must have some proper business! Yes, they must!</p><br/><p>In fact, Chen Feng and Wang Yao really had proper business to do.</p><br/><p>At the vicinity of the destroyed Dragon’s Passing Mountain, on the shore, when Chen Feng walked out of a shrub after getting the seadragon blood essence he had buried under the sand, Wang Yao was speechless.</p><br/><p>\"So…\"</p><br/><p>\"You took this seadragon’s blood essence right under our eyes?\"</p><br/><p>Wang Yao rubbed her tiny face.</p><br/><p>\"Cough cough.\"</p><br/><p>Chen Feng coughed.</p><br/><p>\"…\"</p><br/><p>What could Wang Yao say?</p><br/><p>How brave of him?</p><br/><p>But he succeeded!</p><br/><p>To be honest, if not for her getting him to help with removing restrictions this time, she most probably wouldn’t have discovered the problem. Even toward the end, she merely suspected him.</p><br/><p>This Chen Feng was not simple indeed.</p><br/><p>Both of them did not stop there for long. After a short while, Wang Yao brought Chen Feng and left the place.</p><br/><p>Not long after they left, a powerful spiritual energy swept through this area. It stopped here for a long time and disappeared quietly after not finding anything.</p><br/><p>\"Weird…\"</p><br/><p>\"I seem to have felt something there…\"</p><br/><p>\"Have I sensed wrongly?\"</p><br/><p>**</p><br/><p>Late at night, Chen Feng returned to the rented house at Gold City.</p><br/><p>Wang Yao left after dropping him off at the urban district.</p><br/><p>Chen Feng returned alone yet he was unprecedentedly relieved. With the seadragon blood essence gone, the pressure on his heart was also lifted.</p><br/><p>After getting his hands on this item, he had constantly been worried!</p><br/><p>He did not have any concealing methods. Hence, he was scared of getting found out by some bizarre ability and was constantly worried that something would happen!</p><br/><p>Luckily, those people did not seem to possess these bizarre methods.</p><br/><p>Furthermore, regardless of the incident where he was picked up by Wang Yao or the frigid pond’s trip, during both incidents, Chen Feng kept feeling like he owed her something and he was feeling very uncomfortable due to this. Now, since he had exchanged a blood essence he was not able to use in the first place for Wang Yao’s favor, getting three extra lives, he felt like this choice of his was extremely profitable.</p><br/><p>At the very least—</p><br/><p>With this, he earned the right to talk to her on equal grounds.</p><br/><p>\"Am I too much of a male chauvinist?\"</p><br/><p>Chen Feng smiled mockingly.</p><br/><p>For unknown reasons, even if his strength was still too weak, he did not want his status to appear too lowly in front of this young lady.</p><br/><p>\"I can’t think too much.\"</p><br/><p>Chen Feng inhaled deeply.</p><br/><p>Currently, the most important thing for him was to increase his level!</p><br/><p>This encounter with the mutant and the frigid pond trip brought Chen Feng’s attributes to a whole new level. His overall strength had even reached a new pinnacle!</p><br/><p>----</p><br/><p>Gene attributes:</p><br/><p>Strength: 50</p><br/><p>Agility: 50</p><br/><p>Physique: 50</p><br/><p>Spirit: 100</p><br/><p>Current condition:</p><br/><p>Endurance: 50/50 (every 1 point of physique increases the maximum endurance by 1 point)</p><br/><p>Spiritual Energy: 100/100 (every 1 point of spirit increases the maximum spiritual energy by 1 point)</p><br/><p>…</p><br/><p>----</p><br/><p>\"Finally 100 points!\"</p><br/><p>Chen Feng was shaking from excitement. His attribute was finally sufficient for his usage!</p><br/><p>Based on his previous calculations, in order to modify the gold ant gene into the strongest gene, he required around 90 points of spiritual energy and a large amount of luck value!</p><br/><p>\"I can probably start trying to surpass the limit!\"</p><br/><p>\"However, I need time in order to break through the limit. Even if I reach E-class, there won’t be that much of an improvement. I don’t need to be in a rush. What’s important is for me to produce this strongest gene first!\"</p><br/><p>Chen Feng analyzed in silence.</p><br/><p>His current target was to produce the strongest gene!</p><br/><p>Opening the experiment kit, he took out the remaining gold ant blood essence from the sealed preservative safebox. He immediately felt somewhat helpless. Some green fur had started growing on the blood essence.</p><br/><p>\"It degenerated…\"</p><br/><p>Chen Feng smiled bitterly.</p><br/><p>Gold ant blood essence only had a shelf-life of three days.</p><br/><p>Out of the three sets of blood essence and materials he had prepared for gold ant gene production, he produced one successfully, failed to produce the second, and kept the last set of materials away since he did not have the time to produce it. He wanted to try out the effects on the blood essence when it was sealed away. Out of his expectations, only after two days, this set of blood essence had been spoiled.</p><br/><p>However, a formula with a high star rating was different from those low-level formulas. For these high star rating formulas, the blood essence was only a small part of the materials. The largest portion of the materials was the incubator liquid used during the gene incubation step.</p><br/><p>\"Seems like I can only put this on hold.\"</p><br/><p>Chen Feng pondered.</p><br/><p>Not only had his gold ant blood essence spoiled, even his luck values had a low amount of 3 points remaining!</p><br/><p>During his previous attempt, the first two steps had used up 15 points of luck values. The amount of luck value required for the final step where he prepared the incubator liquid for gene fusion was still unknown!</p><br/><p>\"I need to prepare at least 40 points of luck value!\"</p><br/><p>Chen Feng made up his mind.</p><br/><p>Even though he might not need so much luck, it was still for the best if he prepared amply.</p><br/><p>Since that was the case, he could make use of the two days time he had during his luck value recovery to prepare the materials required for his production. Since he didn’t have many funds remaining, he could only prepare the materials.</p><br/><p>\"Seems like I have to stake it all on this one last chance.\"</p><br/><p>Chen Feng was full of fighting spirit.</p><br/>\n</div>"}