{"title": "Chapter 53: Gene Virus", "id": 53, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-53-gene-virus", "volume_title": "Volume 1", "body": "<h1>Chapter 53: Gene Virus</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 53: Gene Virus</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"End this quickly.\"</p><br/><p>Chang Hu ordered.</p><br/><p>Three E-class genetic warriors charged against Chen Feng.</p><br/><p>Three E class against one F class?</p><br/><p>This was an unfair battle!</p><br/><p>\"Whoosh!\"</p><br/><p>The three of them charged against Chen Feng.</p><br/><p>\"Ah.\"</p><br/><p>Chen Feng merely sneered.</p><br/><p>He recalled that when he was with Xu Fei’s group previously, he assumed the identity of a beginner gene producer. This pitiful child had probably never seen the methods he had at his disposal, right?</p><br/><p>\"This time, let me educate you a little,\" Chen Feng muttered.</p><br/><p>\"Come accept your death!\"</p><br/><p>Zhang Ling’s main attribute was agility. With her fast speed, she was the first to reach Chen Feng. Her speed was the fastest, while her attack was also the most violent. When fighting against low-level producers like Chen Feng, she would normally insta-kill them!</p><br/><p>Whoosh!</p><br/><p>A cold glint flickered.</p><br/><p>Against everyone’s expectations, at this instant, Chen Feng started unleashing his power.</p><br/><p>\"Go!\"</p><br/><p>Chen Feng pointed.</p><br/><p>\"Whoosh!\"</p><br/><p>A succession of Wind Blades was released from his hand.</p><br/><p>10-combo release!</p><br/><p>\"Be careful!\"</p><br/><p>Chang Hu cried out in alarm.</p><br/><p>Zhang Ling, who was already in front of Chen Feng, did not even have enough time to mount her defense. She could only watch with her eyes wide open as one Wind Blade after another landed on her body, carving one deep scar after another on her body!</p><br/><p>One of those scars was carved on her neck as blood splattered out of it.</p><br/><p>Dead!</p><br/><p>Zhang Ling was killed just like that.</p><br/><p>The fragrance diminished and the jade perished. [1]</p><br/><p>Everyone else was shocked. An E-class warrior was killed just like that?</p><br/><p>It was outside of everyone’s expectations!</p><br/><p>Wu Fan was dumbstruck. He did not dare to believe that the Chen Feng that had only relied on his gene reagents could actually be so terrifying now!</p><br/><p>\"Next.\"</p><br/><p>A cold smile curled on Chen Feng’s mouth.</p><br/><p>100 points of spiritual energy! This feels awesome!</p><br/><p>With his spiritual energy rising rapidly from 32 points to 100 points, his combat power had also increased exponentially. The might of his unlimited Wind Blades had also reached a shocking level! If it was an intermediate-level E-class warrior, he might be scared to provoke them. However, a few E-class warriors that were obviously on the weaker end of the class…</p><br/><p>What the heck were they to Chen Feng?</p><br/><p>\"Ling Er[2]!\"</p><br/><p>With an indignant roar, another person from Chang Hu’s team charged toward Chen Feng.</p><br/><p>\"Go.\"</p><br/><p>Chen Feng waved his hand indifferently.</p><br/><p>\"Hum—\"</p><br/><p>His chain attacks were instantly unleashed!</p><br/><p>\"Do you think that I, your father, am scared of you?\" that person bellowed.</p><br/><p>\"Bang!\"</p><br/><p>Lumps of azure-colored ice crystals condensed on his right hand as he viciously smashed against the Wind Blades in midair. At this moment, a terrifying power was released from the momentum of his attack.</p><br/><p>2-star secret art, Ice Fist.</p><br/><p>\"Bang!\"</p><br/><p>\"Bang!\"</p><br/><p>Ten Wind Blades were instantly destroyed as that person’s malevolent expression appeared. \"If it wasn’t for your sneak attack, do you think you would have been capable of killing Ling Er? A mere F class, let I, your father, help you repay this debt with your blood…\"</p><br/><p>\"Be careful!\"</p><br/><p>Chang Hu cried out in alarm.</p><br/><p>\"What?\"</p><br/><p>That person abruptly turned around before he horrifyingly found that, at an unknown time, the few Wind Blades that killed Zhang Ling earlier had not dispersed. Instead, they curved and were turning back! Every single one of those Wind Blades was moving at a horrifying speed, rushing toward him from behind.</p><br/><p>\"Damn it!\"</p><br/><p>He hastily turned around to block the attacks.</p><br/><p>\"Bang!\"</p><br/><p>Another punch was launched. Ice crystals splattered around.</p><br/><p>He had finally shattered the Wind Blades. However, the same moment when he turned around to face the Wind Blades behind him, another ten Wind Blades were released from Chen Feng’s hand, piercing through him alive!</p><br/><p>\"You…\"</p><br/><p>He stared at Chen Feng with an inconceivable expression on his face.</p><br/><p>Ten Wind Blades?</p><br/><p>Followed by another 10 of them?</p><br/><p>And followed by another 10 of them?</p><br/><p>What cursed ability was this?</p><br/><p>\"Hehe.\"</p><br/><p>Chen Feng merely smiled faintly before looking toward Chang Hu. \"So it seems that you’re the only one left?\"</p><br/><p>Chang Hu’s expression was unsightly.</p><br/><p>Producer?</p><br/><p>What f*cking producer was this!</p><br/><p>Did your family’s producer possess such powerful combat power?</p><br/><p>Killing one person per second!</p><br/><p>In a short two seconds, his two companions, one with agility reaching 300 points and the other with strength reaching 260 points, both E-class warriors, were gone just like that!</p><br/><p>Dying at the hands of an F class?</p><br/><p>How was that possible?</p><br/><p>\"Who the heck are you?\" Chang Hu bellowed in fear.</p><br/><p>Chen Feng smiled calmly. \"Chen Feng. A beginner producer.\"</p><br/><p>\"F*ck producer!\" Chang Hu bellowed. \"I refuse to believe that I can’t kill you today. As long as I kill you, everything here belongs to me. Even if there’s Wang family and Wu family, I, your father, only needs to leave Gold City. I do not fear you lot!\"</p><br/><p>\"Ka!\"</p><br/><p>\"Ka!\"</p><br/><p>Chang Hu’s body started swelling while his skin started turning into gold color, resembling a Vajrapani[3].</p><br/><p>\"Wanting to kill me?\"</p><br/><p>\"Come!\" Chang Hu bellowed.</p><br/><p>\"Bang!\"</p><br/><p>Chen Feng’s Wind Blades descended upon him. However, no injuries whatsoever were inflicted. Instead, only shallow white-colored scars were left on him.</p><br/><p>\"Haha. Only this much power?\" Chang Hu laughed wildly. \"My physique is at 450 points. With my genetic ability, I am unkillable. Even if you are peak F class, your spirit is only at 100 points. No matter how powerful your genetic ability is, you won’t be able to break through my defense!\"</p><br/><p>\"Is that so?\"</p><br/><p>Chen Feng merely sneered.</p><br/><p>Whoosh!</p><br/><p>Whoosh!</p><br/><p>A succession of Wind Blades were condensed without stop in Chen Feng’s hands as the Wind Blades floated around him, forming a dance of Wind Blades, akin to leaves falling from a tree, spinning unceasingly.</p><br/><p>\"Dang! Dang!\"</p><br/><p>Several Wind Blades descended yet no injuries were left on Chang Hu’s body. It was not only due to Chang Hu’s valiant physique. It was also largely due to Chang Hu’s genetic ability!</p><br/><p>\"What can you do to me?\" Chang Hu said in disdain.</p><br/><p>\"Is that so?\" Chen Feng smiled faintly. \"That’s quite a powerful ability you have there. How long can you maintain its activation?\"</p><br/><p>Chang Hu’s expression changed slightly.</p><br/><p>\"Trying to provoke me into anger so that I will put my life on the line against you now? Hehe. There’s no rush. I’m not in a rush to leave anyway. Mhm, let me think…\"</p><br/><p>\"Imagine the scene when the duration of your genetic ability ends or when Wang Yue finally wakes up?\" Chen Feng smiled. \"What a beautiful scene.\"</p><br/><p>\"Damn it!\"</p><br/><p>Chang Hu’s expression was unsightly.</p><br/><p>His provocations failed to work. How were the students nowadays so sly? It was as Chen Feng said. Chen Feng could afford to drag it out. He, on the other hand, could not afford it!</p><br/><p>\"You are the one who forced me to do this.\"</p><br/><p>Chang Hu inhaled deeply. \"Originally, I wasn’t willing to use this move.\"</p><br/><p>\"Ah ah ah ah ah ah ah ah…\"</p><br/><p>Chang Hu suddenly consumed some kind of liquid, raised his head upward, and started hissing. At this moment, an astonishing scene unfolded.</p><br/><p>The sky turned dark.</p><br/><p>The sunny and cloudless sky turned a blood-red color.</p><br/><p>A blood-red moon appeared in the sky as a terrifying aura was emitted from Chang Hu’s body. This was definitely not an aura a normal E-class warrior possessed!</p><br/><p>\"Blood moon?!\"</p><br/><p>Wang Yao’s expression became solemn.</p><br/><p>\"Blood moon?\"</p><br/><p>Chen Feng was somewhat surprised.</p><br/><p>\"It’s a type of genetic virus.\" Wang Yao’s tiny face was grave. \"In a human’s body, there is boundless potential. This virus works by crushing one’s genes forcefully and increases one’s power by a wide margin for a short period of time. Ultimately, it might bring forth side effects such as one’s attributes decreasing permanently, losing one’s genetic ability, etc. Of course, there’s also a possibility that one would only lose some unimportant genes.\"</p><br/><p>Chen Feng was shocked. \"Such a reagent actually exists?\"</p><br/><p>\"Yes. However, gene viruses like these are all prohibited items.\" Wang Yao reminded Chen Feng, \"This thing is very powerful and extremely terrifying. It is something that the use of is banned! I don’t know how this guy got his hands on one. You have to be careful.\"</p><br/><p>\"Virus…\"</p><br/><p>Chen Feng narrowed his eyes.</p><br/><p>During the virus’s activation, he had tried attacking Chang Hu. However, there was no effect on him. Every Wind Blades could only leave behind shallow white scars on his body. If he wanted to put an end to him, he needed to wait until the duration of Chang Hu’s genetic ability ended. At this time, Chang Hu had recovered from the bizarre state he was in a moment ago.</p><br/><p>\"Are you surprised?\"</p><br/><p>Chang Hu laughed nastily with sunken eyes.</p><br/><p>\"Bang!\"</p><br/><p>A gush of power rumbled in his body.</p><br/><p>\"What a perfect power,\" Chang Hu mumbled.</p><br/><p>\"After using this item, even if you win the fight, you will be crippled,\" Chen Feng said indifferently.</p><br/><p>\"So what?\" Chang Hu grinned. \"After killing you, I will escape with all the things here. Who can control me? With these things, in the future, even if I stop cultivating I will still be able to rule a small area.\"</p><br/><p>\"You think I can’t do anything to you?\"</p><br/><p>\"Hehe, naive.\"</p><br/><p>\"From this moment, this is my domain!\"</p><br/><p>Chang Hu laughed wildly.</p><br/><p>\"Is that so?\" Chen Feng sneered. \"Let’s give it a try then.\"</p><br/><p>The gold light on Chang Hu’s body faded. As he completed his transformation, his Vajaprani genetic ability had quietly disappeared.</p><br/><p>\"Now!\"</p><br/><p>A cold glint flickered in Chen Feng’s eyes.</p><br/><p>\"Hum—\"</p><br/><p>All the Wind Blades congregated beside Chen Feng.</p><br/><p>A dance of gales!</p><br/><p>\"Bang!\"</p><br/><p>All the Wind Blades swarmed Chang Hu.</p><br/><p>The near 100 Wind Blades that Chen Feng was controlling were unleashed at this instant. Azure colored blades filled the skies as they swarmed Chang Hu, appearing extremely terrifying. He believed that regardless of how powerful Chang Hu’s defense was, after receiving the concentrated attacks of so many Wind Blades on the same spot, he would be injured!</p><br/><p>However, Chang Hu merely smiled malevolently.</p><br/><p>\"Break for me!\"</p><br/><p>\"Bang!\"</p><br/><p>Chang Hu made his move.</p><br/><p>\"Hum—\"</p><br/><p>An astonishing power blossomed from Chang Hu’s hands.</p><br/><p>\"Bang!\"</p><br/><p>He punched out slowly, yet the effect was earth shattering.</p><br/><p>\"Bang!\"</p><br/><p>Loud sound.</p><br/><p>All the Wind Blades were instantly crushed. The near 100 azure-colored blades that appeared so imposing with its quantity so high they engulfed the heavens and earth were gone just like that!</p><br/><p>Chang Hu sneered. \"Too weak.\"</p><br/><p>In the sky, the blood moon shone brightly.</p><br/><p>Chen Feng could distinctly feel that the space around Chang Hu was warping. Was it due to the power of the blood moon being too powerful, hence the power overflowed from his body?</p><br/><p>Chen Feng stared at the sky. He was looking for a weak point.</p><br/><p>Regardless of how powerful the power of the blood moon was, it was impossible for it to affect this world! It could only affect the few of them here and this small area!</p><br/><p>This blood-red world might even be a false appearance brought forth by the formidable power of the blood moon!</p><br/><p>That blood moon in the sky was certainly fake as well!</p><br/><p>How should he solve this?</p><br/><p>Chen Feng gazed at the blood moon.</p><br/><p>However, Chang Hu did not give Chen Feng an opportunity to think. After smashing Chen Feng’s Wind Blades with his punch, he looked at Chen Feng with a malevolent expression on his face as his killing intent leaked.</p><br/><p>\"I told you. This is my domain!\"</p><br/><p>\"Now.\"</p><br/><p>\"Go and die for me!\"</p><br/><p>\"Whoosh!\"</p><br/><p>Chang Hu showed his savageness immediately.</p><br/><p>Footnotes:</p><br/><p>1. The fragrance diminished and the jade perished – an expression commonly used to describe the death of a beauty.</p><br/><p>2. Er is a term of endearment commonly used by the Chinese. In this case, for Zhang Ling, she was also known as Ling Er by those close to her.</p><br/><p>3. Vajaprani – Please refer for clearer picture: https://www.google.com/search?q=Vajrapani&amp;source=lnms&amp;tbm=isch</p><br/>\n</div>"}