{"title": "Chapter 65: The Calm Before the Storm", "id": 65, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-65-the-calm-before-the-storm", "volume_title": "Volume 1", "body": "<h1>Chapter 65: The Calm Before the Storm</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 65: The Calm Before the Storm</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At a certain ruin, Ge Jun had finally escaped with great difficulty. Although he had sustained dire injuries, he had survived! He had survived despite his opponent being a heavily injured D-class genetic warrior! Although that D-class genetic warrior was heavily injured, that guy insisted on oppressing him. At his final moments, he tossed out the newly purchased mutated thundersnake gene!</p><br/><p>\"Bang!\"</p><br/><p>Even now he could not forget that dazzling radiance.</p><br/><p>His life was saved.</p><br/><p>As a genetic warrior that always walked the thin line between life and death, he was very clear on the importance of a strong trump card. It was something equivalent to an extra life!</p><br/><p>Furthermore, his gains this time…</p><br/><p>After getting some simple treatment for his injuries at the hospital, Ge Jun went to The Strongest Gene once again. However, outside of his expectations, the shop was closed.</p><br/><p>Have the things inside been sold out?</p><br/><p>Ge Jun was feeling somewhat disappointed. He knew that something good like this would definitely be discovered by others sooner or later. However, when he looked at the shop in detail, he was stunned.</p><br/><p>It was banned?</p><br/><p>Bureau of Virtual Commodity Prices?</p><br/><p>Ge Jun was stupefied. It was banned due to marking up the prices?</p><br/><p>\"Old Yun, what happened?\"</p><br/><p>Ge Jun contacted a friend he had made recently, Yun Zhongtian.</p><br/><p>The circumstances in which he knew Yun Zhongtian was somewhat interesting. At that time, they had come across each other at the countryside and started fighting each other. Finally, due to them being evenly matched, they both took out their trump cards. However, when they saw the thundersnake gene that had an obviously different radiance in their opponent’s hand, they stopped.</p><br/><p>\"The Strongest Gene?\" they asked probingly, immediately understanding.</p><br/><p>The both of them had spent one million yuan to buy this mutated thundersnake gene with astonishing might. With this, neither of them dared to act. They were both clear on the might of this item. If they really tossed it out, they would die together. Hence, they both raised the mutated thundersnake gene in their hands as a sign of respect.</p><br/><p>As they understood what each other meant, with tacit understanding, they put away the gene in their hands. Just like that, they started exploring the ruins together. Since they met by fate and knew each other’s trump card, they were comfortable working together.</p><br/><p>\"I saw it.\" Yun Zhongtian sighed. \"Damn it. After buying the mutated thundersnake gene, I was only happy for two days before this shop was banned by the Bureau of Virtual Commodity Prices. Those bastards had the nerve to do it.\"</p><br/><p>\"Those idiots at the bureau don’t know the value of the genes. However, don’t the both of us know about it? That mutated thundersnake gene…\" Ge Jun said softly.</p><br/><p>\"Not only the mutated thundersnake gene.\" Yun Zhongtian sneered. \"A few of my friends told me that the mutated gold ant gene was quite good as well. Unfortunately, we are already at E-class and can’t use it. Let me tell you. This producer is definitely not an ordinary producer. Now is the perfect opportunity for us to extend our friendship to him. Even if he doesn’t need it, it would do us good to let him become familiar with our faces.\"</p><br/><p>Ge Jun’s eyes shined. \"You mean…\"</p><br/><p>\"Didn't you record your previous usage of that gene?\" Yun Zhongtian grinned. \"Get someone to edit it and upload the video online.\"</p><br/><p>\"Alright.\"</p><br/><p>Ge Jun was excited.</p><br/><p>**</p><br/><p>At the same time, in the Wang family, Wang Chun’s face was brimming with a smile. Just a short while ago, those seniors of his family had started using him as a bad example for their lessons once again. He immediately rebuked them and made known the fact that he had broken through. As he looked at the dumbstruck expression on those seniors that were always exceedingly proud, he felt immensely comfortable.</p><br/><p>This feels too good!</p><br/><p>As far as he was concerned, his only obstacle was breaking through the limit. As long as he broke through his limit, his combat power would be exponentially increased! Within the same class, he was undefeated! To be honest, if not for him choosing a peculiar gene and treading a peculiar path, could those bastards have been so unbridled before him?</p><br/><p>\"Hum—\"</p><br/><p>His wristband vibrated.</p><br/><p>Wang Chun turned his screen on.</p><br/><p>\"Brother.\"</p><br/><p>A youngster with a bitter expression on his face appeared.</p><br/><p>\"What’s the matter? There’s still no mutated gold ant gene at The Strongest Gene?\" Wang Chun asked curiously.</p><br/><p>The youngster sobbed. \"The Strongest Gene has been banned!\"</p><br/><p>\"What?\" Wang Chun’s heart was shaken.</p><br/><p>After his breakthrough, he had recommended the gene to his close friends. One of them had managed to break through and enter E-class. With that, everyone in their circle of friends was excited. Unfortunately, Chen Feng only put out some mutated thundersnake gene for sale after that, leaving them waiting.</p><br/><p>None of them expected the shop to be banned!</p><br/><p>Wang Chun was feeling doubtful. \"Who did it?\"</p><br/><p>\"Bureau of Virtual Commodity Prices.\"</p><br/><p>The youth was gloomy.</p><br/><p>\"Bureau of Virtual Commodity Prices…\"</p><br/><p>Wang Chun pondered for a bit, \"I got it. If you really need the mutated gold ant gene, you can entrust him to produce it for you. It doesn’t matter if it’s more expensive. It’s not like you lack money anyway.\"</p><br/><p>\"Oh, true.\"</p><br/><p>The youth was excited. \"I will go and entrust it immediately.\"</p><br/><p>Gene entrustment! It was something only a high-level gene producer would receive! With that, they were able to charge a high price to custom-make a requested gene. Due to the high price, it was something commonly neglected.</p><br/><p>However—</p><br/><p>That mutated gold ant gene was definitely something qualified to be entrusted.</p><br/><p>After ending the call, Wang Chun sank into contemplation.</p><br/><p>\"Master.\"</p><br/><p>A gentle sound drifted to him from behind.</p><br/><p>A loving expression appeared on Wang Chun’s face. As he turned around, he saw an exceptionally beautiful young lady looking at him with a smile on her face. That young lady’s appearance was akin to a person out of a comic book, possessing unprecedented beauty and allure.</p><br/><p>\"What are you thinking about?\" the young lady asked gently.</p><br/><p>Wang Chun smiled. \"Thinking about Chen Feng.\"</p><br/><p>\"Chen Feng? The young lady’s eyes shined. \"My benefactor?\"</p><br/><p>Wang Chun laughed. \"Now that you are putting it that way, indeed he is.\"</p><br/><p>Chen Feng…</p><br/><p>No matter what, at his darkest moment, Chen Feng had helped him in taking this difficult step forward. As such, this little help that was within his capabilities, he would definitely give to Chen Feng.</p><br/><p>**</p><br/><p>The internet was currently filled with discussion. Now, Chen Feng was truly someone hated by everyone, detested by everyone, like a rat running across the street. At this moment, a video was being quietly uploaded onto the learning forum. The title of the video was: Strongest F-class Gene.</p><br/><p>\"It’s that Chen Feng again?\"</p><br/><p>A lot of people started watching the video curiously. However, when they started the video, they found something totally different. In the video was a warrior that had activated a certain gene reagent during his moment of crises. What followed was a terrifying white radiance descending from the sky. Although nobody could get a clear look at it, they could still feel the terrifying might of that reagent. A heavily injured D-class warrior was killed by that attack. The wreckage left by the reagent confirmed its might.</p><br/><p>\"Damn, too fierce!\"</p><br/><p>\"This power…\"</p><br/><p>\"What reagent is this? I don’t know. I can’t get a clear look.\"</p><br/><p>\"Too scary!\"</p><br/><p>Everyone exclaimed in admiration. \"This is what a strongest gene truly is!\"</p><br/><p>No words could be as convincing as an actual video.</p><br/><p>The demonstration of a strongest gene reagent had caused a sensation among the public. Different from what happened to Chen Feng, this video had gained a large amount of praise.</p><br/><p>\"Take a clear look. This is a true strongest gene.\"</p><br/><p>\"Yeah.\"</p><br/><p>\"That Strongest Gene shop should really learn from this guy.\"</p><br/><p>\"Look at this, he has the guts to put an extremely expensive price with only a trashy thundersnake gene and a trashy gold ant gene on his hands. Totally contrary to this guy, who actually possessed a genuine strongest gene yet remains obscure and unknown.\"</p><br/><p>Everyone started berating Chen Feng again.</p><br/><p>Everyone was too busy berating Chen Feng to the point that none noticed that the lightning that appeared when the unknown gene in the video was activated had actually assumed an appearance that was either a snake or a dragon.</p><br/><p>At the same time, another thread rose in popularity: The appearance of a legendary gene! This is a true F-class strongest gene. What could that gene of yours be considered as?!</p><br/><p>The aggressive title had quickly attracted a lot of attention.</p><br/><p>What was interesting was that, since Chen Feng became the founder of clickbait titles, the titles of the threads in the learning forum started increasing in length, dazzling the eyes of the visitors.</p><br/><p>\"What legendary gene?\"</p><br/><p>\"So boastful?\"</p><br/><p>Everyone entered the thread curiously.</p><br/><p>Within the thread was another video. Although the video was partly censored, one could still clearly see that it was an F-class warrior with only 100 attribute points. That guy proceeded to consume a bottle of gene reagent.</p><br/><p>\"Bang!\"</p><br/><p>His aura changed.</p><br/><p>He had directly broken through his limit!</p><br/><p>After scanning his attributes, his new attributes were released: His attribute had astonishingly reached 101 points!</p><br/>\n</div>"}