{"title": "Chapter 64: Throwing Stones on Someone Who Fell into a Well", "id": 64, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-64-throwing-stones-on-someone-who-fell-into-a-well", "volume_title": "Volume 1", "body": "<h1>Chapter 64: Throwing Stones on Someone Who Fell into a Well</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 64: Throwing Stones on Someone Who Fell into a Well</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Chen Feng received his answer after two attempts at contacting them. As he had imagined, it was not something done by the group of inspectors. However, the participation of the Bureau of Virtual Commodity Prices was indeed something exceeding his expectations.</p><br/><p>\"Is there any way to lift the ban?\" Chen Feng asked.</p><br/><p>\"….\"</p><br/><p>Li Dakang felt somewhat guilty, since they did not have any evidence on hand, and said, \"The Bureau of Virtual Commodity Prices has banned a lot of shops before. Some only needed to apologize for the ban to be lifted. However, I doubt it will work this time. If you really want to lift the ban, you need to look for some authoritative figures and prove that the Bureau of Virtual Commodity Prices is wrong in their evaluations.\"</p><br/><p>Chen Feng nodded as he ended the call. \"Thanks.\"</p><br/><p>\"Hum!\"</p><br/><p>His wristband vibrated.</p><br/><p>Chen Feng glanced at it. The group of inspectors had sent him something.</p><br/><p>----</p><br/><p>Commodity price evaluation table:</p><br/><p>1. Lumberbear Gene – Battle: Evaluated price: 10,000 yuan. A 100% increase is indeed strong. However, it still pales in comparison to other combat genes. Furthermore, compared with other labor genes, it is not as practical as the common mutated lumberbear gene. As such, its practical value is not high.</p><br/><p>2. Mutated Gold Ant Gene: Evaluated price: 10,000 yuan. Common gold ant genes are able to increase up to 10 to 20 points of spiritual energy and are sold at 200,000 yuan and above. This mutated ant gene only increases one’s spiritual energy by one point. Hence, its real worth should be one tenth of a normal gold ant gene’s price or even lower. As such, its practical value is not high.</p><br/><p>3. Mutated Thundersnake Gene: Evaluated price: 50,000 yuan. It has double the spiritual energy consumption compared to normal thundersnake genes. Apart from this, there are no other differences. As something generally used by F-class warriors as their trump card, the extra 10 points of consumption is fatal. As such, its practical value is not high.</p><br/><p>----</p><br/><p>Chen Feng was lost in thought long after he finished reading it.</p><br/><p>Ten thousand? Ten thousand? Fifty thousand?</p><br/><p>How vicious!</p><br/><p>Since the mutated gold ant gene was something that had never appeared before, it was understandable for them to be unable to see through its true value. However, as for the mutated thundersnake gene, no matter what, it should not be worth a measly 50,000 yuan!</p><br/><p>The Bureau of Virtual Commodity Prices was blatantly trying to kill him off!</p><br/><p>There was also the possibility that the Bureau of Virtual Commodity Prices had seen through the true value of his strongest genes yet still chosen to deliberately act against him.</p><br/><p>Why?</p><br/><p>Had he offended these people?</p><br/><p>Returning to his room, Chen Feng sat on his table as he contemplated. Subconsciously, he started tapping the table with his fingers. Along with the increasing tempo of his tapping, his thoughts started expanding.</p><br/><p>The authority…</p><br/><p>Bureau of Virtual Commodity Prices…</p><br/><p>Information…</p><br/><p>Right at this moment, Mu Yuan’s picture appeared on screen. Chen Feng accepted the call. \"What’s the matter?\"</p><br/><p>Shocked, Mu Yuan said, \"The group of inspectors dared to ban you groundlessly?\"</p><br/><p>Chen Feng shook his head. \"It wasn't them. It was the Bureau of Virtual Commodity Prices.\"</p><br/><p>\"Bureau of Virtual Commodity Prices…\"</p><br/><p>Mu Yuan frowned before relaxing his brows again. \"Then that’s understandable.\"</p><br/><p>\"Oh?\"</p><br/><p>Chen Feng raised his head.</p><br/><p>\"As you know, that shameless Professor Tao stole my grandfather’s research results before. However, after all these years, even after my grandfather became somewhat reputable, he did not expose the truth. Do you know the reason for that?\" Mu Yuan inhaled deeply. \"It was due to the son of that old bastard.\"</p><br/><p>Chen Feng listened quietly.</p><br/><p>\"Tao Lijun. The chief of the Bureau of Virtual Commodity Prices. After my grandfather gained some popularity, he tried reporting it once. However, something similar happened to him.\"</p><br/><p>Mu Yuan was seething with anger as well. What had happened to his grandfather in the past seemed to be happening to Chen Feng now. Although it was a different incident, the tricks pulled were similar. These were all masterpieces of Tao Lijun.</p><br/><p>His position as a bureau chief was somewhat special. Since he was in charge at the virtual network, his influence was very small in real life. However, he possessed immense authority online.</p><br/><p>There was nothing one could do about that. This was an era where the virtual community was the most popular thing among the public.</p><br/><p>So that was the truth.</p><br/><p>Chen Feng felt enlightened. So it was Tao Lijun?</p><br/><p>Suddenly, Chen Feng smiled. Since he knew who his opponent was, this would be much easier to deal with.</p><br/><p>\"What do you plan to do? Do you need any help?\"</p><br/><p>Mu Yuan asked.</p><br/><p>\"No.\" A toying smile appeared on Chen Feng’s face. \"Let our Bureau Chief Tao continue his ban on my shop. I’m afraid that when I’m done with him, he will end up coming to me and begging me to reopen my shop…\"</p><br/><p>Mu Yuan shivered as he heard that.</p><br/><p>Begging you to reopen your shop? What on earth is this guy planning to do?</p><br/><p>**</p><br/><p>The closure of Chen Feng’s shop attracted countless attention. The most curious thing was that not long after the shop closed, Chen Feng hung a sign on it.</p><br/><p>\"This shop has been banned by the Bureau of Virtual Commodity Prices. As such, this shop will cease operation for an indefinite period of time.\"</p><br/><p>Bureau of Virtual Commodity Prices?</p><br/><p>Banned?</p><br/><p>The public was happy to see this.</p><br/><p>\"Haha. Finally banned.\"</p><br/><p>\"Yeah. The inspectors sure are useless. Only the Bureau of Virtual Commodity Prices is still quite capable.\"</p><br/><p>\"It should have been banned long ago. A proper monthly sales event like this was almost spoiled by this guy. It was an insult for this fraud-like guy to be placed in the top 10 rankings.\"</p><br/><p>\"I know, right?\"</p><br/><p>The public was stirred.</p><br/><p>This was especially true for those shops ranked below Chen Feng. They felt like setting off fireworks to celebrate this. With Chen Feng out of the way, everyone had their ranking increased by one place.</p><br/><p>Soon, the whole learning forum was bustling with noise and excitement again.</p><br/><p>\"I heard The Strongest Gene was banned?\"</p><br/><p>\"They should have banned him long ago. Only reversed genes were sold in that shop. What’s the point?\"</p><br/><p>\"Sigh. If you think of it, those genes were still newly discovered genes after all. Even if they are reversed genes, they still have some research value to them. Unfortunately, this Chen Feng…\"</p><br/><p>\"True. Since the shop owner is unreliable, what can you do? If I was in his shoes, I would release a research result for those new genes. With that, I can at least claim a considerable amount of rewards.\"</p><br/><p>\"He is still a rookie, after all.\"</p><br/><p>The public were discussing without stop.</p><br/><p>This decision to ban Chen Feng’s shop had received unanimous support from these people.</p><br/><p>The incident surrounding Chen Feng had originally calmed down. However, with this, Chen Feng became a trending topic once again. Naturally, a topic would only be trending for a limited amount of time online. The public would probably forget about Chen Feng in a few days time.</p><br/><p>However, outside of everyone’s expectations, a news outlet officially voiced their opinion about this incident! This was something entirely different from the free discussions online. The participation of the media would greatly affect the public opinion and could even influence the actions taken and the results.</p><br/><p>This incident was originally a joke. Nobody expected that the media would actually participate in this as well.</p><br/><p>Suffering from own actions! The consequences of breaking the rules! – Cool Breeze Daily.</p><br/><p>The news from Cool Breeze Daily was delivered on schedule to the news bucket of their subscribers. These subscribers would be able see the news as soon as they opened their screen.</p><br/><p>This was how news was delivered in this new era.</p><br/><p>In the news, it was described in detail how Chen Feng had, in order to become famous and promote his shop to gain more traffic, started pricing genes at one million to gain publicity and make use of the price he set, that far exceeded the true value of his genes, to unhealthily compete, breaking the rules and shattering the balance. In the end, he ended up suffering from his own actions!</p><br/><p>This was a typical article used to smear one’s reputation. Within the article was a long description on how vile Chen Feng was, how angry other shop owners were, how other producers were unwilling to be associated with him, and how he was someone who attracted the anger of the masses. Finally, the fate that he finally suffered caused everyone to clap their hands to cheer the fate that had befallen him.</p><br/><p>Even Chen Feng silently praised this article after reading it.</p><br/><p>Chen Feng sighed endlessly. \"They are very well versed in the act of smearing others, eh.\"</p><br/><p>The media’s participation did not surprise him. With Tao Lijun’s position, it was normal for him to know someone from the media. From this, one could see how shady Tao Lijin was.</p><br/><p>Originally, The Strongest Gene was only something related to those in the virtual community.</p><br/><p>Even if the shop was banned, its effect on Chen Feng was minimal. However, with the release of Cool Breeze Daily’s article, the attention was totally shifted to Chen Feng from his shop. This time, what he wanted to destroy was Chen Feng as a person.</p><br/><p>He was planning to destroy Chen Feng without leaving him a way out.</p><br/><p>Banning your shop and ruining you as a person!</p><br/><p>This was Tao Lijun’s method of dealing with someone, far exceeding what Professor Tao was capable of.</p><br/><p>\"The young have surpassed the old?\"</p><br/><p>Chen Feng smiled faintly.</p><br/><p>Regardless of the ban on Chen Feng’s shop or influencing the public opinion, the timing of Tao Lijun’s actions was perfect. However, he neglected one thing, which was also the crux of the whole matter. Chen Feng’s genes were totally not trash genes as he had evaluated. This was the unshakable truth!</p><br/><p>What if everything one used to smear other’s reputation were false?</p><br/><p>How would it progress?</p><br/><p>Chen Feng smiled. Would this be a repeat performance of what had happened to Professor Tao before?</p><br/>\n</div>"}