{"title": "Chapter 76: You're on Your Own Now", "id": 76, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-76-youre-on-your-own-now", "volume_title": "Volume 1", "body": "<h1>Chapter 76: You're on Your Own Now</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 76: You're on Your Own Now</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"Hum—\"</p><br/><p>At this instant, everything in the training room trembled.</p><br/><p>Cups, stools, all sorts of instruments, every single thing in the training room was trembling. Chen Feng could faintly see his lively spiritual energy enveloping these things.</p><br/><p>\"Condense!\"</p><br/><p>Chen Feng pointed midair.</p><br/><p>Whoosh!</p><br/><p>Everything stilled instantly.</p><br/><p>\"Wind Blade!\"</p><br/><p>Chen Feng activated his Wind Blade.</p><br/><p>Before his eyes, an azure colored light blade appeared.</p><br/><p>\"There doesn’t seem to be anything different with it?\"</p><br/><p>Chen Feng contemplated.</p><br/><p>Stop.</p><br/><p>Instinctively, Chen Feng pointed.</p><br/><p>\"Whoosh!\"</p><br/><p>The Wind Blade stilled in midair.</p><br/><p>That’s right. The crescent shaped Wind Blade stopped just like that, hovering in midair.</p><br/><p>\"This…\"</p><br/><p>Chen Feng’s eyes widened.</p><br/><p>This was the effect of reaching the limit of affinity?</p><br/><p>Then…</p><br/><p>\"Whoosh!\"</p><br/><p>Another Wind Blade appeared.</p><br/><p>When both Wind Blades collided, an astonishing scene unfolded. Both Wind Blades did not shatter. Instead, under the terrifying effect of the affinity, they merged into a bizarre cross-shaped object!</p><br/><p>\"This works?\"</p><br/><p>Chen Feng was stupefied.</p><br/><p>\"Whoosh!\"</p><br/><p>Another Wind Blade appeared.</p><br/><p>Three curved Wind Blades intertwined and turned into a fan-shaped wind wheel!</p><br/><p>\"Turn!\"</p><br/><p>Chen Feng instinctively commanded inwardly.</p><br/><p>\"Hu—\"</p><br/><p>The merged Wind Blades started rotating.</p><br/><p>A frightening gale started shaking the room. This effect was not only due to the Wind Blade’s power alone, it was also the terrifying power exhibited by the Wind Blades after merging!</p><br/><p>\"Go!\"</p><br/><p>Chen Feng unleashed them.</p><br/><p>\"Whoosh!\"</p><br/><p>The wind wheel struck forth with a whistling sound.</p><br/><p>\"Bang!\"</p><br/><p>The instant it touched the ground, a terrifying power erupted.</p><br/><p>The superposition resulting from the fusion of three Wind Blades unleashed a power far exceeding even ten Wind Blades released by Chen Feng in the past.</p><br/><p>Extremely terrifying!</p><br/><p>\"Then…\"</p><br/><p>\"What if the amount of Wind Blade is increased?\" Chen Feng muttered.</p><br/><p>\"Whoosh!\"</p><br/><p>\"Whoosh!\"</p><br/><p>A succession of Wind Blades was released.</p><br/><p>Ten Wind Blades appeared instantly. Under Chen Feng’s control, they collided, and Chen Feng’s lively spiritual energy started working automatically, turning the Wind Blades into a huge Wind Blade.</p><br/><p>A terrifying Wind Blade with a length of nearly 3 meters.</p><br/><p>Its azure glow was clear as mirror, hovering in midair just like that.</p><br/><p>\"A giant Wind Blade?\"</p><br/><p>Chen Feng’s eyes flickered as he aimed at the evaluation tool in the distance.</p><br/><p>\"Whoosh!\"</p><br/><p>The Wind Blade shot forth, leaving behind a piercing sound.</p><br/><p>\"Bang!\"</p><br/><p>The Wind Blade exploded.</p><br/><p>\"Di—\"</p><br/><p>\"Attack power: 800 units.\"</p><br/><p>\"Ability level: High-level E-class\"</p><br/><p>This power…</p><br/><p>Chen Feng inhaled a mouthful of cold breath.</p><br/><p>The him that had just entered E-class, who had not even fused with an E-class gene, had actually unleashed an attack as powerful as a high-level E-class attack. The gene virus was indeed terrifying!</p><br/><p>This was what true strength was like!</p><br/><p>\"Hua—\"</p><br/><p>Chen Feng’s eyes blanked and darkness descended.</p><br/><p>His complexion paled.</p><br/><p>That exceptionally dazzling world disappeared at that instant.</p><br/><p>\"It ended?\"</p><br/><p>Chen Feng was still longing for that sensation.</p><br/><p>Too comfortable!</p><br/><p>Pity it's only 10 seconds.</p><br/><p>Chen Feng checked his body and once again scanned himself with the gene scanner.</p><br/><p>All the trash genes in his body had disappeared. Apart from the 1 point of strength attribute he lost permanently, Chen Feng was even healthier than the average person.</p><br/><p>With all the harmful genes in his body gone, how could he not be healthy?</p><br/><p>However…</p><br/><p>A human body was a huge factory in itself!</p><br/><p>Every single day, new cells would be created. Contained within those cells were a large amount of genes, including both helpful and useless genes!</p><br/><p>This was especially true during this age where genetic mutation was the norm. Due to how frequently genetic abilities were used, in order to achieve balance within the human body, it was inevitable for trash genes to emerge.</p><br/><p>This was Chen Feng’s trump card.</p><br/><p>Based on his initial assessment, his body would once again be filled with trash genes in three days time. This meant that he would be able to use the aurora gene once every three days!</p><br/><p>\"It’s still somewhat hurtful.\"</p><br/><p>Chen Feng frowned.</p><br/><p>It was not a problem to exhaust those trash genes. However, the drop of his strength attribute…</p><br/><p>\"There’s only this many trash genes?\"</p><br/><p>Chen Feng felt somewhat regretful.</p><br/><p>He was even wishing that if he were to develop cancer, mhmm… getting himself some cancer cells or something else in his body, would the amount of trash genes in his body increase?</p><br/><p>Would he be able to use aurora gene without limit that way?</p><br/><p>The more he thought of it, the more tempted he became.</p><br/><p>However, he ultimately gave up this line of thought.</p><br/><p>Cancerous genes… it was a domain he was unfamiliar with. Nowadays, genetic mutation was something very normal. If his cancer cells were to mutate into something bizarre, he would have toyed himself to death.</p><br/><p>Shortly after, Chen Feng finished arranging the relevant information regarding his test on the aurora gene.</p><br/><p>The aurora gene enabled him to enter a special mode. Chen Feng named this mode Virus Mode!</p><br/><p>When in Virus Mode, he possessed a godly control power. However, the price he paid for it was extremely huge as well—10 points of luck value, the destruction of all trash genes in his body, and a random gene attribute of his would lose one point permanently!</p><br/><p>Cooldown period: three days</p><br/><p>\"This set of data…\"</p><br/><p>Chen Feng’s gaze was sparkling.</p><br/><p>Losing one point of strength attribute was totally worth it!</p><br/><p>Since he was planning to use aurora gene as his trump card, evaluating it was something that had to be done.</p><br/><p>Just imagine the scenario where he were to consume the aurora gene at a crucial moment. However, what happened next was that he couldn’t move, like what had happened when he was performing gene strengthening previously, what would the consequences for that be?</p><br/><p>Even the thought of that was terrifying.</p><br/><p>If it wasn’t for Wang Yao rescuing him previously, he would have been dead.</p><br/><p>Now that he could afford it, he would definitely evaluate the gene first. Fortunately, the aurora gene did not disappoint him. There was not much difference from his initial predictions.</p><br/><p>Chen Feng inhaled deeply. \"I just hope that the day where I would need to use this never comes.\"</p><br/><p>Since he was done with evaluation of the aurora gene, he started studying the information regarding the illusionary snake’s scale. After the complicated aurora gene, this 2-star E-class formula did not bring him much trouble. He was able to familiarize himself with it in a short while. Afterward, he contacted Wang Chun and confirmed that they would depart three days later before he started making his preparations.</p><br/><p>One set of aurora reagent.</p><br/><p>Three sets of thundersnake reagents.</p><br/><p>…</p><br/><p>Only after he was done with his preparations did he go rest.</p><br/><p>Later that night, the Wang family was holding a banquet. As a result, it was bustling with noise and excitement over there.</p><br/><p>Suddenly, a little girl walked into the room. The bustling banquet paused momentarily. However, soon, everyone pretended they hadn't seen anything and continued chatting.</p><br/><p>However, everywhere she passed, countless people avoided her, none daring to approach her.</p><br/><p>\"Sister.\"</p><br/><p>Wang Yue was happy.</p><br/><p>The one who came was precisely Wang Yao.</p><br/><p>Wang Yao nodded slightly. \"Mhm.\"</p><br/><p>\"Yao Er, you are here.\" A middle-aged man walked over with a youth. \"Come, let father introduce to you. This is…\"</p><br/><p>Wang Yao glanced over coldly. \"Scram!\" A terrifying killing intent descended.</p><br/><p>Wang Tianhao could not continue his sentence, while the youth he brought over was trembling with fear and almost peed himself. Cutting a sorry figure, he fled.</p><br/><p>\"Wang Yao!\"</p><br/><p>Wang Tianhao was somewhat angry.</p><br/><p>He clenched his fists and veins appeared on his forehead.</p><br/><p>He was aware that this daughter of his looked down on him. However, they were in a public place.</p><br/><p>Wang Yao merely looked at him coldly. Her gaze was akin to knife, terrifyingly cold. Wang Tianhao stared at her for a few seconds before sighing. \"Fine, fine, fine. I will go.\"</p><br/><p>Wang Yue smiled bitterly. \"Sister, can’t you give father some face?\"</p><br/><p>Wang Yao shook her head, not saying anything.</p><br/><p>After thinking, she suddenly said, \"Maintain some distance from those old farts of the Wang family.\"</p><br/><p>\"Ah?\" Wang Yue was somewhat stupefied.</p><br/><p>Those elders of the Wang family?</p><br/><p>But they represented the whole Wang family and controlled all the resources of the family. If he were to maintain a distance from them, who would allocate him resources?!</p><br/><p>In front of Wang Yao, he pretended to be stupid in order to gain her concern. However, this did not mean that he was really stupid. The resources of the Wang family were something he had to have!</p><br/><p>\"You’re on your own now.\"</p><br/><p>Wang Yao looked at Wang Yue deeply before leaving.</p><br/><p>\"Sister?\"</p><br/><p>Wang Yue’s heart palpitated.</p><br/><p>Wang Yao came all the way here just to say this? Telling him to maintain a distance from Wang family?</p><br/><p>Why?</p><br/><p>Wang Yue’s thoughts were in turmoil.</p><br/><p>The others might not realize this. However, he was clear that the reason he was able to improve quickly was due to his sister. If his sister stopped helping him in the future…</p><br/><p>\"Don’t think too much.\" Wang Tianhao patted his son’s shoulder. \"She is, after all, only a single person. Behind you, on the other hand, is the entirety of the Wang family!\"</p><br/><p>\"Right.\"</p><br/><p>As he heard that, Wang Yue’s mood lightened.</p><br/><p>However, why was his sister so prejudiced against the Wang family? Even against their father… to be honest, he truly couldn’t understand the reason. Since something happened to his sister’s body, she seemed to have changed! Her strength became inconceivably terrifying and, at the same time, she also became increasingly cold as a person.</p><br/><p>Sister… what happened to you?</p><br/><p>Wang Yue was perplexed.</p><br/><p>Currently, after Wang Yao left, the excitement of the banquet increased. At a certain unremarkable corner of the room, Wang Chun was silently seated, engrossed with a comic in his hands.</p><br/><p>\"You are Wang Chun right? I…\" A beautiful lady walked over. \"I am…\"</p><br/><p>\"Shh!\" Wang Chun raised his finger to his lips. \"Don’t disturb me when I’m reading.\"</p><br/><p>\"You…\"</p><br/><p>Speechless, the lady turned around and left. One could faintly hear her grumbling something like \"damnable nerd.\"</p><br/><p>At this, Wang Chun merely smiled.</p><br/><p>He was very clear on the reason these ladies came. However, what did that have to do with him? He was merely here to make up the numbers due to his status.</p><br/><p>\"Wang family…\"</p><br/><p>A mocking smile appeared on Wang Chun’s face.</p><br/><p>He stretched and was soon engrossed with his comic once again, oblivious to the world around him.</p><br/><p>\"Soon I will be going to Desolate Rocky Grounds with Chen Feng…\"</p><br/><p>\"I shouldn’t slack off.\"</p><br/>\n</div>"}