{"title": "Chapter 92: Let’s Create Midgets Together", "id": 92, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-92-let%E2%80%99s-create-midgets-together", "volume_title": "Volume 1", "body": "<h1>Chapter 92: Let’s Create Midgets Together</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 92: Let’s Create Midgets Together</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"???\"</p><br/><p>Xie Kangzhong had a stupefied expression on his face. His huge body with a height of three meters stood there, totally stupefied. He blankly stared at this one-inch-high mini lava giant and thought, This thing here, how did it appear?</p><br/><p>\"What on earth is this?\"</p><br/><p>Wang Chun was startled awake as well.</p><br/><p>His first thought upon seeing that mini lava giant was to think that Xie Kangzhong had even brought a mini lava giant here as well before subsequently seeing that, when Chen Feng casually waved his hand, two Wind Blades shot out and transformed into a midget.</p><br/><p>???</p><br/><p>Wang Chun was stupefied as well. What on earth was going on here?</p><br/><p>At this moment, Chen Feng was still creating midgets in a serious manner.</p><br/><p>\"Whoosh!\"</p><br/><p>\"Whoosh!\"</p><br/><p>A succession of Wind Blades shot out.</p><br/><p>With his Luck Aura fully activated, Chen Feng focused on choosing the ability to be affected by Luck Aura.</p><br/><p>One after another, lava midgets appeared. Shortly after, in front of Chen Feng, there were already 40 to 50 lava midgets that looked exactly the same.</p><br/><p>\"Go!\"</p><br/><p>Chen Feng pointed.</p><br/><p>Fwaaash!</p><br/><p>The group of lava midgets swarmed Xie Kangzhong.</p><br/><p>\"Whoosh!\"</p><br/><p>\"Whoosh!\"</p><br/><p>The group of midgets climbed up Xie Kangzhong’s body. Some of them were hugging his arms, some hugging his thighs, and some were seated on his head, while the rest were sprawled all over his body.</p><br/><p>\"Scram!\"</p><br/><p>Xie Kangzhong raged.</p><br/><p>He lashed his arms around furiously. Unfortunately, it had no effect. Those midgets that looked the same had wound around him unwaveringly. Regardless of how much he lashed around, he was not able to throw them off.</p><br/><p>\"Bang!\"</p><br/><p>Terrifying flames flared up on his body.</p><br/><p>These midgets did not have any flame absorption abilities. Hence, they were badly damaged when hit by the flame. However, since they were not formed of a human body with flesh and blood, they did not fear the damage dealt by the flame.</p><br/><p>Instead, after getting burned, these midgets appeared even more terrifying.</p><br/><p>\"Damn it!\"</p><br/><p>Xie Kangzhong was getting jittery.</p><br/><p>\"You are the one controlling them.\"</p><br/><p>He reacted quickly and sneered as he said, \"It doesn’t matter. I can’t hurt them. However, I can hurt you. As long as I kill you, they will naturally dissipate by themselves.\"</p><br/><p>\"Bang!\"</p><br/><p>Xie Kangzhong condensed the power of flame in his hands.</p><br/><p>However.</p><br/><p>At this moment, a group of midgets climbed onto his clenched fist and sucked in the power of flame on his hand. Xie Kangzhong’s right fist that was originally filled with flame energy became an empty shelf.</p><br/><p>\"Bang!\"</p><br/><p>He punched the ground.</p><br/><p>The ground crumbled.</p><br/><p>The ground below Xie Kangzhong’s foot shook, and then…</p><br/><p>\"Ka cha!\"</p><br/><p>His right arm snapped.</p><br/><p>Without the protection of flame energy, this skill of his was not able to display any power at all.</p><br/><p>Wang Chun and Chen Feng in the distance were not affected at all. A Xie Kangzhong without his flame energy was akin to a tiger without fangs.</p><br/><p>\"You…\"</p><br/><p>Xie Kangzhong’s killing intent rose.</p><br/><p>On his body, those midgets had sucked off too much flame energy from him and now appeared somewhat drunk as they swayed around, appearing extremely intoxicated. However, even now, they were still unwaveringly hanging onto his body, not willing to let go.</p><br/><p>\"Scram!\"</p><br/><p>Xie Kangzhong started grabbing toward the midgets on his body.</p><br/><p>At that, the drunk midgets started crawling to different parts of his body while swaying around. They moved around Xie Kangzhong’s body nimbly, some having even climbed to his inner thigh.</p><br/><p>\"Damn it!\"</p><br/><p>Xie Kangzhong was furious. However, he couldn’t do anything to them.</p><br/><p>He couldn’t understand this. He was very strong, far stronger than Chen Feng and Wang Chun. However, why did a normal battle developed into the current situation?</p><br/><p>Whoosh!</p><br/><p>Whoosh!</p><br/><p>After continuously shaking his body a few times, he gave up.</p><br/><p>If I can’t shake them off, I will stop shaking! Even without the flame energy, I can still kill Chen Feng!</p><br/><p>By now, he had realized that the one who posed the most threat to him, the one capable of hurting him, was only Chen Feng! This ex-student of his!</p><br/><p>Bang!</p><br/><p>With large strides, he walked toward Chen Feng.</p><br/><p>\"These midgets of yours are truly somewhat powerful. However, they are totally unable to hurt me,\" Xie Kangzhong said coldly. \"A huge amount of spiritual energy is required to control a lava giant. I’m curious, a beginner E-class warrior like you, how long can you sustain the activation of this skill?\"</p><br/><p>Chen Feng sneered. \"Definitely longer than you.\"</p><br/><p>\"Bang!\"</p><br/><p>Xie Kangzhong punched toward Chen Feng.</p><br/><p>Losing his flame energy, what he could do now was only pure physical attacks.</p><br/><p>Although his main attribute was not the strength attribute, his strength, physique and agility attributes were still comparatively high, and Chen Feng was totally not his match.</p><br/><p>\"Bang!\"</p><br/><p>Another punch.</p><br/><p>Chen Feng was almost sent flying by that punch.</p><br/><p>This won’t do!</p><br/><p>Chen Feng clenched his teeth.</p><br/><p>The current Xie Kangzhong had lost his flame energy due to the midgets and was using his pure physical strength to force him and Wang Chun to death. What was depressing was that, even now, in his weakened state, Chen Feng still couldn’t defeat him.</p><br/><p>The gap between them was too large!</p><br/><p>Exhaustion?</p><br/><p>They totally had no idea how long Xie Kangzhong could maintain this ability!</p><br/><p>What to do, then?</p><br/><p>Chen Feng’s brain started working rapidly.</p><br/><p>Lava midgets …</p><br/><p>This fusion process was, in actuality, totally different than the formation of the lava giant. After all, it was a combination of pure energy alone. If that was the case, were there other combinations for this?</p><br/><p>For example, icy mist and petrification?</p><br/><p>Or—</p><br/><p>Other abilities?</p><br/><p>I don’t care anymore!</p><br/><p>Chen Feng clenched his teeth.</p><br/><p>He would found out if there really existed other combinations once he tried. Since he had the idea in his mind, he activated his Luck Aura and started trying out different combinations unceasingly.</p><br/><p>\"Whoosh! Whoosh!\"</p><br/><p>Wind Blades shot out once again.</p><br/><p>Luck value dropped rapidly.</p><br/><p>Icy mist, petrification?</p><br/><p>No effect!</p><br/><p>Thunder, earth?</p><br/><p>No effect!</p><br/><p>Icy mist, water crystal?</p><br/><p>\"Hum—\"</p><br/><p>In front of Chen Feng, an azure colored midget with ice crystals all over its body appeared. Apart from having a different color and ability, it appeared the same as a lava midget.</p><br/><p>\"Feasible.\"</p><br/><p>Chen Feng was immediately excited.</p><br/><p>\"Whoosh! Whoosh!\"</p><br/><p>A huge volume of Wind Blades were once again spammed out.</p><br/><p>A succession of different energy combinations started appearing in a disorderly manner.</p><br/><p>Soon, one after another, midgets with bizarre colors climbed up Xie Kangzhong’s body.</p><br/><p>Icefrost midget, formed from ice and frost mist, possessing extremely powerful temperature reduction and freezing abilities. Thunder midget, formed from seawater and thunder, possessing paralyzing abilities and an extremely powerful ability to conduct electricity. Armored midget, formed from stone and earth, possessing extremely powerful blocking and defensive abilities.</p><br/><p>Blue colored…</p><br/><p>White colored…</p><br/><p>Yellow colored…</p><br/><p>An alarmed expression appeared on Xie Kangzhong’s face.</p><br/><p>Fwaash.</p><br/><p>All the midgets swarmed him.</p><br/><p>\"What damnable things are these?\"</p><br/><p>Xie Kangzhong was panicking.</p><br/><p>\"Scram!\"</p><br/><p>\"Scram!\"</p><br/><p>Xie Kangzhong started shaking his body frantically.</p><br/><p>However, the lava giant was too big!</p><br/><p>Naturally, being big had its benefits. At least, when he faced Chen Feng and Wang Chun, he held the absolute superiority, able to easily catch up to them to deliver a world of hurt upon them. However, it has it disadvantages as well. All those holes on his body had became incomparably big as well, just nice enough for those midgets to crawl into.</p><br/><p>The thunder midgets crawled into his ears.</p><br/><p>The icefrost midgets crawled into his nostrils.</p><br/><p>The exploding midgets crawled into that specific hole at his lower body.</p><br/><p>…</p><br/><p>\"Scram!\"</p><br/><p>Xie Kangzhong was horrified and started screaming.</p><br/><p>\"Bang!\"</p><br/><p>\"Bang!\"</p><br/><p>\"Bang!\"</p><br/><p>He started raining punches on his own body.</p><br/><p>\"Ah—\"</p><br/><p>He howled crazily.</p><br/><p>\"Fiery Dragon!\"</p><br/><p>\"Raging flames!\"</p><br/><p>An endless amount of flame started rising up on his body.</p><br/><p>He wanted to destroy all the midgets.</p><br/><p>However—</p><br/><p>\"Explode,\" Chen Feng spat out coldly.</p><br/><p>\"Bang!\"</p><br/><p>All the midgets exploded at the same instant.</p><br/><p>A terrifying force instantly erupted. At this instant, the secret arts formed by two different abilities displayed their terrifying power. A terrifying power engulfed the area.</p><br/><p>Xie Kangzhong’s body became bright like fireworks being set off.</p><br/><p>All sorts of colors blossomed from his body, his body hidden within the radiance of the lights.</p><br/><p>\"Bang!\"</p><br/><p>\"Bang!\"</p><br/><p>\"Bang!\"</p><br/><p>A terrifying force engulfed the area.</p><br/><p>Chen Feng and Wang Chun were directly flung away from the explosion.</p><br/><p>The ground shook.</p><br/><p>Countless mutated beasts in the vicinity were shocked by the explosion and started fleeing frantically.</p><br/><p>The extremely powerful energy contained within Xie Kangzhong’s body, combined with the power from the explosion of the countless midgets, had give birth to a shocking power.</p><br/><p>After a long time.</p><br/><p>When the radiance gradually faded, Chen Feng raised his head and looked at the spot where Xie Kangzhong was at.</p><br/><p>He was still standing there!</p><br/><p>He was no longer a lava giant. Instead, he had now returned to his original appearance. However, his body was already heavily damaged. All sorts of bizarre marks were left on his body.</p><br/><p>Icefrost, flame, poison…</p><br/><p>His eyes were wide opened as he stared at Chen Feng.</p><br/><p>\"Why…\" he asked with his somewhat hoarse voice.</p><br/><p>Bang!</p><br/><p>With a resounding bang, he fell on the ground.</p><br/>\n</div>"}