{"title": "Chapter 97: Blood Lesson", "id": 97, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-97-blood-lesson", "volume_title": "Volume 1", "body": "<h1>Chapter 97: Blood Lesson</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 97: Blood Lesson</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>What damnable ability was that?</p><br/><p>Chen Feng was shocked.</p><br/><p>The illusionary snake was originally a life-form filled with mysteriousness. This gluttonous snake whose gene returned to its roots and had even gone through an evolution was simply an extremely inconceivable existence.</p><br/><p>This guy was a newborn!</p><br/><p>If it were to further develop like this…</p><br/><p>Furthermore, this guy seemed to be able to change the color of its light as it wished?</p><br/><p>If it was to become well-practiced with switching light colors and hiding itself in the surroundings, nobody could notice it! They might even treat it as a normal ray of light!</p><br/><p>Who could notice it?</p><br/><p>The more he thought of it, the more Chen Feng found this astonishing.</p><br/><p>This fellow here was simply an extremely dreadful product.</p><br/><p>How should he deal with it?</p><br/><p>Chen Feng was somewhat unable to make up his mind.</p><br/><p>Kill it?</p><br/><p>He couldn’t bear to kill it.</p><br/><p>This was a mystical mutated beast that had never appeared in history. Furthermore, with its current form, whether it could be killed or not was a question in itself.</p><br/><p>Release it?</p><br/><p>Too troublesome.</p><br/><p>Releasing something that could at any time mature into something no one could detect that was also an extremely threatening existence in and of itself to society? That was simply a disaster in the making!</p><br/><p>Keeping it at his side?</p><br/><p>Chen Feng looked at it and sighed.</p><br/><p>He indeed wished to keep it with him. However, this guy…</p><br/><p>\"Hum—\"</p><br/><p>Seemingly sensing Chen Feng’s thought, that tiny lighting snake submissively sprawled out on Chen Feng’s hand. An intense feeling of attachment was instantly transmitted into Chen Feng’s brain.</p><br/><p>\"This guy…\"</p><br/><p>Chen Feng was amazed.</p><br/><p>Despite the fact that the tiny snake couldn’t speak, he was still able to clearly sense the mood of that tiny snake. This snake considered Chen Feng as its closet kin.</p><br/><p>\"Is it due to me bringing you back here?\" Chen Feng muttered.</p><br/><p>Oh well, since that’s the case, I might as well keep it by my side. Even if it does not have any combat power, it is still good as a mascot.</p><br/><p>However, shortly after, Chen Feng was faced with an extremely headache-inducing problem.</p><br/><p>Gene production!</p><br/><p>Now, as soon as he started gene production, this tiny snake would go into his digitized world and start furiously devouring genes. If he did not let it eat, it would stay beside him, staring at him pitifully.</p><br/><p>This greatly affected Chen Feng’s state of mind!</p><br/><p>\"This won’t do.\"</p><br/><p>Chen Feng did not know whether he should laugh or cry.</p><br/><p>When that intense feeling of being wronged was transmitted to him, Chen Feng almost failed his production then and there.</p><br/><p>It was so even when Chen Feng was producing a formula that he had mastered. What about other formulas? This little guy was now effecting Chen Feng’s normal production!</p><br/><p>As far as it was concerned, genes equaled food!</p><br/><p>Especially the genes extracted by Chen Feng within his digitized world.</p><br/><p>\"Are they really so delicious?\"</p><br/><p>Chen Feng looked at the tiny snake before him as it transmitted a joyous feeling to him.</p><br/><p>How about… feeding this guy until it was full first?</p><br/><p>Chen Feng gave it a try, only to find that this guy would not be full regardless of how much it was fed! It could eat crazily all day long without stop. The concept of \"fullness\" was simply nonexistent for it.</p><br/><p>Only later did Chen Feng recall that this guy’s ancestors were those gluttonous snakes!</p><br/><p>\"Fine.\"</p><br/><p>Chen Feng felt his head aching.</p><br/><p>Gene food…</p><br/><p>Couldn’t be full…</p><br/><p>Mhm…</p><br/><p>Suddenly, Chen Feng’s eyes shone. If…</p><br/><p>\"Come, come over here.\"</p><br/><p>Chen Feng suppressed his excitement.</p><br/><p>Whoosh!</p><br/><p>Light flickered as the tiny snake hovered before Chen Feng.</p><br/><p>\"Come.\"</p><br/><p>Chen Feng entered the digitized world. \"Don’t move first.\"</p><br/><p>Tiny snake nodded obediently.</p><br/><p>\"Look.\"</p><br/><p>Chen Feng pointed at the genes he needed. \"This, you can’t eat. This also, you can’t eat. That can’t be eaten, that also can’t be eaten, mhm… no, this can’t be eaten either.\"</p><br/><p>Chen Feng consecutively pointed at tens of genes before saying \"Get it?\"</p><br/><p>The tiny snake tilted its head.</p><br/><p>Only after a long explanation from Chen Feng did it somewhat understood.</p><br/><p>\"Very good.\"</p><br/><p>Chen Feng was extremely satisfied. \"Apart from those I pointed out, the rest are all yours! Everything else is all yours. Understand?\"</p><br/><p>Chen Feng was filled with expectation.</p><br/><p>This was a sudden idea he had.</p><br/><p>How many genes were contained in a single blood essence?</p><br/><p>Too many to be counted!</p><br/><p>How many did Chen Feng need?</p><br/><p>Just a very few of them!</p><br/><p>Rather than prohibiting this guy to eat genes, might as well taught it which to eat and which to not eat. The leftovers were all what he required.</p><br/><p>\"Let’s try.\"</p><br/><p>Chen Feng inhaled deeply.</p><br/><p>Whoosh!</p><br/><p>He entered digitized mode.</p><br/><p>He used lumberbear gene for his first attempt. He did not restrict the tiny snake, allowing this string of light that couldn’t be seen to travel around the digitized world as it pleased. In a mere few seconds, the tiny snake was done.</p><br/><p>The only things left in the whole digitized world were the genes Chen Feng required.</p><br/><p>He did not even need to select the genes. Instead, he only had to directly collect all the remaining genes.</p><br/><p>\"Success!\"</p><br/><p>Chen Feng was in ecstasy.</p><br/><p>When he looked at the tiny snake once again, he felt like he was looking at an invaluable treasure.</p><br/><p>This fellow…</p><br/><p>Had actually helped Chen Feng skip the first production stage, gene search!</p><br/><p>\"With this, I can save a lot of luck value.\"</p><br/><p>Chen Feng was excited.</p><br/><p>As he get stronger, the consumption rate of luck value was getting extremely high as well. Chen Feng felt like his luck values were getting insufficient. The appearance of the tiny snake could be considered as some sort of relief to this problem he was facing.</p><br/><p>Whoosh!</p><br/><p>Light flickered.</p><br/><p>After enjoying itself with the meal, the tiny snake streaked around in excitement.</p><br/><p>Chen Feng sighed emotionally.</p><br/><p>This guy was indeed a luck bringer!</p><br/><p>It was able to travel between the spiritual world and real world as it wished. After thinking about it, Chen Feng tried to build a small room in his spiritual world. Next, the tiny snake actually entered the room.</p><br/><p>It could indeed travel between the illusionary and real world as it wished.</p><br/><p>A terrifying ability!</p><br/><p>Chen Feng exclaimed in admiration.</p><br/><p>However, this was fine too. Chen Feng did not need to prepare a spot for it to stay. As long as he used one point of spirit to maintain a small spiritual world, it could stay and sleep inside.</p><br/><p>Naturally, every single time Chen Feng started gene production, it seemed to be able to wake up immediately to rush into the digitized world and feast on the genes.</p><br/><p>\"Simply the same as a cat that smelled food.\"</p><br/><p>Chen Feng found this funny.</p><br/><p>\"It’s about time I give you a name.\"</p><br/><p>Chen Feng looked at the tiny snake in front of him. Currently, it looked like a thick ray of light. Mhm, a red ray of light, flickering with a red glow.</p><br/><p>\"How about... I call you Little Red.\"</p><br/><p>Whoosh.</p><br/><p>The red light instantly turned green.</p><br/><p>\"Little Green?\"</p><br/><p>Whoosh!</p><br/><p>The green light turned black.</p><br/><p>Chen Feng: \"…\"</p><br/><p>I can’t call you Little Black, right?</p><br/><p>\"Since you are a silhouette of light… I will just call you Xiao Ying[1] normally, this should be acceptable right?\" Chen Feng said seriously.</p><br/><p>The tiny snake finally agreed and excitedly streaked around the house.</p><br/><p>Chen Feng laughed involuntarily.</p><br/><p>Xiao Ying?</p><br/><p>As he looked at the red light streaking around the house, it seemed like a nice name. Its speed was too fast. Under normal circumstances, it couldn’t be seen. Only a flash could be seen.</p><br/><p>After dealing with Xiao Ying, Chen Feng once again started gene production.</p><br/><p>This time, he was producing an aurora reagent.</p><br/><p>With Xiao Ying’s assistance, he easily produced two sets.</p><br/><p>\"This time, there shouldn’t be any mistakes, right?\" Chen Feng mumbled.</p><br/><p>Even after the aurora reagent was prepared, Chen Feng was still not satisfied.</p><br/><p>Would this be sufficient to contend against 47 E-class warriors?</p><br/><p>He was unsure.</p><br/><p>\"It’s best if I get someone to help.\"</p><br/><p>Chen Feng contemplated and suddenly looked at a certain name in his contact list and smiled instantly.</p><br/><p>\"You are investigating Wang Yue?\" Chen Feng asked suddenly.</p><br/><p>Wang Chun’s expression changed slightly. \"Damn, how did you find out that I’m trying to set him up.\"</p><br/><p>\"Hehe.\" Chen Feng smiled, not saying anything.</p><br/><p>What kind of person was Wang Chun? Now that this guy had suffered such losses, how could he not plot revenge? Even without guessing, Chen Feng could know that this Wang Chun guy was definitely secretly conducting his investigations.</p><br/><p>Chen Feng beamed as he looked at Wang Chun. \"Are you interested in doing something big?\"</p><br/><p>Wang Chun narrowed his eyes. \"You are not scared of Wang family?</p><br/><p>Chen Feng sneered. \"As long as I remain in Gold City, he will not dare to lay his hands on me.\"</p><br/><p>In the wilderness, you can do as you wish. However, in Gold City?</p><br/><p>The current Chen Feng had a flourishing reputation in Gold City. If the Wang family dared to make a move on Chen Feng, the Gene Production Association would definitely deliver them death!</p><br/><p>\"Alright.\"</p><br/><p>A cold glint flickered in Wang Chun’s eyes.</p><br/><p>Initially, he had only planned to lay a vicious trap for Wang Yue. However, he did not expect that Chen Feng was actually planning something even more vicious. Although it was risky, if it was planned properly…</p><br/><p>He would join in! Since even Chen Feng was not afraid, what should he be afraid of?</p><br/><p>Outside Gold City was a vast world. There were too many places he could go. What could the Wang family be counted as? No matter what, for this incident, Wang Yue had to be taught a lesson!</p><br/><p>A bloody lesson!</p><br/><p>Footnotes:</p><br/><p>1. Xiao here means \"little\" while ying here means \"silhouette\" or \"figure.\" Both Little Silhouette and Little Figure sound incredibly awkward, so I decided to keep the pinyin (Xiao Ying) as the name.</p><br/>\n</div>"}