{"title": "Chapter 100: Murderous Intent Soaring the Skies", "id": 100, "volume": 1, "url": "http://boxnovel.org/the-strongest-gene-chapter-100-murderous-intent-soaring-the-skies", "volume_title": "Volume 1", "body": "<h1>Chapter 100: Murderous Intent Soaring the Skies</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 100: Murderous Intent Soaring the Skies</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"What damnable thing is this?\"</p><br/><p>Everyone was alarmed.</p><br/><p>Someone being alive with a severed hand or leg was understandable. Even a melodramatic scene where one whose chest was pierced used one’s final breath to shout \"the murderer is…\" would be somewhat understandable. However, when one had freaking turned into a skeleton and was still able to move, this was now somewhat horrifying.</p><br/><p>Ka!</p><br/><p>Ka!</p><br/><p>Crisp sounds traveled forth from the skeleton.</p><br/><p>Whoosh!</p><br/><p>The green skeleton looked at Chen Feng. In the empty eye sockets were two clumps of burning green flames.</p><br/><p>\"Jadebone Sun Jia…\"</p><br/><p>Xu Fei inhaled a breath of cold air. \"So this is what Jadebone means!\"</p><br/><p>The three genes Sun Jia had were jade, iron, and copper. With jade as the core, copper skin and iron bones were formed, giving him an extremely powerful combat strength! The weak spirit recovery skill he had used on Wang Yue should simply be some small function of the jade gene he had. The true usage of his genes was to give him an extremely powerful combat strength!</p><br/><p>\"Bang!\"</p><br/><p>The green skeleton stomped on the burned ground.</p><br/><p>\"Bang!\"</p><br/><p>The ground started crumbling.</p><br/><p>Chen Feng and the rest staggered, nearly losing their footing from the shook.</p><br/><p>\"This thing…\"</p><br/><p>Chen Feng’s heart was overwhelmed with emotion.</p><br/><p>\"Chen Feng—\"</p><br/><p>An ice-cold voice could be heard. Chen Feng abruptly raised his head to see that the green skeleton was actually vibrating the air to simulate a voice for himself. The tone of this simulated voice was very ice-cold and bizarre, though.</p><br/><p>\"You—need—to—die!\"</p><br/><p>Word by word, the green skeleton said this.</p><br/><p>Evidently, the current him still required a considerable effort to use this skill.</p><br/><p>\"Mere tricks.\"</p><br/><p>A cold glint flashed in Chen Feng’s eyes.</p><br/><p>Myriad Illusionary Wind Blade!</p><br/><p>Whoosh!</p><br/><p>Multicolored Wind Blades erupted forth instantly.</p><br/><p>However, the scene of all the Wind Blades smashing into the skeleton body was akin to an egg getting smashed onto rocks. They were totally ineffective, including the poisonous blades!</p><br/><p>\"I told you.\"</p><br/><p>\"Your attacks are ineffective against me,\" the green skeleton said with a deep tone.</p><br/><p>His strongest core was his jade bone, using jade as the core to create copper and iron and to give him an extremely formidable combat power. He believed that, as he continued breaking through and fusing with different genes, he would be able to ultimately alter every single one of his body parts, including his flesh, and become a true expert!</p><br/><p>However, he had yet to reach that point.</p><br/><p>Now, his flesh was instead the weakest part of him.</p><br/><p>When his flesh was corroded by Chen Feng, the intense pain roared in his mind. He felt worse being alive than dead! Hence, he had to let Chen Feng experience something similar as well!</p><br/><p>\"I will devour you.\"</p><br/><p>\"Eating you a single bite at a time, to make you feel worse alive than dead.\"</p><br/><p>With the faint green light and the two bizarre flaming eye sockets that were staring at Chen Feng, the ice-cold tone of the green skeleton caused everyone on the spot to feel horrified. What kind of hatred did he feel toward Chen Feng?</p><br/><p>\"Damn it.\"</p><br/><p>Xu Fei wanted to help Chen Feng; however, he was stopped by the subordinates of Wang Yue. The Shen Wei siblings couldn’t spare any help to him either. Currently, Chen Feng could only depend on himself!</p><br/><p>\"Chen Feng, retreat!\" Xu Fei bellowed.</p><br/><p>The green skeleton sneered. \"Hmph.\"</p><br/><p>Whoosh!</p><br/><p>Despite the extreme pain brought forth by the corrosion of his flesh, after losing his flesh, his body had became incomparably solid, while his speed had became incomparably fast and nimble. He had now surpassed Chen Feng in every aspect!</p><br/><p>A flash of a green silhouette.</p><br/><p>Nobody here could contend against him.</p><br/><p>\"Pu!\"</p><br/><p>A green silhouette flashed past. Next, blood splattered out of Chen Feng’s arm.</p><br/><p>Chen Feng’s eyes flickered.</p><br/><p>\"Pu!\"</p><br/><p>Another flash of a green silhouette and Chen Feng spat out a mouthful of blood and was flung away.</p><br/><p>\"Whoosh!\"</p><br/><p>\"Whoosh!\"</p><br/><p>The green silhouette flashed around without stop while bloody wounds were continuously left on Chen Feng's body.</p><br/><p>Wang Chun and the rest bellowed, \"Chen Feng!\"</p><br/><p>Damn it!</p><br/><p>This was simply an act of torturing one to death!</p><br/><p>This green skeleton actually wanted to torture Chen Feng to death!</p><br/><p>\"Haha.\"</p><br/><p>A bizarre laughter resounded.</p><br/><p>The green skeleton was excited.</p><br/><p>\"Are you suffering?\"</p><br/><p>\"Can you feel the excitement?\"</p><br/><p>He behaved like a deranged person as he looked at Chen Feng with excitement. However, he blanked suddenly. That was because when he looked at Chen Feng, what he saw was a pair of calm eyes.</p><br/><p>There were no trace of fear in Chen Feng.</p><br/><p>\"You really think that I have no way to strike back against you?\" With a sharp gaze, Chen Feng suddenly said, \"No, I’m merely wondering something. Without flesh, how are you actually controlling yourself? Even if it’s a genetic ability…I was wondering what is the medium of connection between this genetic ability and your main body.\"</p><br/><p>\"Now, I finally understand.\"</p><br/><p>Chen Feng smiled.</p><br/><p>\"Cheap trickeries.\"</p><br/><p>The green skeleton sneered.</p><br/><p>\"Ah.\"</p><br/><p>Chen Feng did not mind the sneer.</p><br/><p>\"Let’s end this.\"</p><br/><p>Chen Feng lightly raised his hand and aimed at the green skeleton.</p><br/><p>Regardless of how strong the skeleton body was, regardless of how strong he would become in the future, at his current stage, what Sun Jia used to control the skeleton body could only be spiritual energy!</p><br/><p>If so—</p><br/><p>It would be easy to deal with.</p><br/><p>\"Bang!\"</p><br/><p>A burst of undulation started appearing in the air in front of Chen Feng.</p><br/><p>Endless transparent Wind Blades appeared instantly before him.</p><br/><p>A succession of transparent Wind Blades erupted forth. Due to their speed being too fast, they instantly fused together, becoming a formidable gush of airflow.</p><br/><p>Transparent Wind Blade, attribute: Spiritual energy.</p><br/><p>Every single blade was a spiritual attack.</p><br/><p>\"Bang!\"</p><br/><p>The green skeleton was instantly engulfed by a spiritual storm.</p><br/><p>\"Scram!\" the green skeleton bellowed.</p><br/><p>\"Chen Feng, you think you can kill me with this?\" He roared at Chen Feng, \"This is indeed the weakness of my skeleton body. However, regardless of how weak my spiritual energy is, I am not one a mere E class like you can act against!\"</p><br/><p>\"My spiritual energy is much higher than yours!\" the green skeleton roared.</p><br/><p>Chen Feng’s mouth curled up in a smile. \"Is that so?\"</p><br/><p>\"Bang!\"</p><br/><p>Once again, the green skeleton was engulfed by a spiritual storm.</p><br/><p>To compete in terms of spirit exhaustion rate? Regardless of how strong your spiritual energy is, under the endless Wind Blades, you still need to get on your knees!</p><br/><p>If his opponent was a true D-class spirit-type warrior, Chen Feng would have turned around and fled immediately. However, he was simply someone using spiritual energy to maintain his consciousness's connection with the green skeleton!</p><br/><p>\"Whoosh!\"</p><br/><p>The green skeleton raged immediately. He wanted to control his body to go and kill Chen Feng.</p><br/><p>Only by killing him would this spiritual storm stop.</p><br/><p>However…</p><br/><p>\"Whoosh!\"</p><br/><p>However, he merely stepped forth once before stopping. Under the never-ending spiritual storm attack by Chen Feng, he could not spare any spiritual energy to control the skeleton to step forth. Instead, he could only use all his spiritual energy to resist against Chen Feng.</p><br/><p>One wave of the storm…</p><br/><p>Two waves of the storm…</p><br/><p>\"No.\"</p><br/><p>A miserable scream.</p><br/><p>Finally, when that endless storm stopped, the green skeleton was already lying on the ground, to never stand up again.</p><br/><p>Sun Jia, dead.</p><br/><p>\"You actually won?\"</p><br/><p>Wang Yue looked at Chen Feng with a blank expression on his face, forgetting that he should be scared.</p><br/><p>He actually won? Defeating this terrifying green skeleton? How is that possible?</p><br/><p>Wang Yue couldn’t understand this. Chen Feng was one who did not have any resources or background. This guy who was a weakling destined to be stepped on by him after graduation, how had him become so strong?</p><br/><p>\"Then…\"</p><br/><p>\"Next, it’s you?\"</p><br/><p>Chen Feng turned around and looked at Wang Yue, bubbling with killing intent.</p><br/><p>Whoosh!</p><br/><p>Wang Yue quivered in fear before he was startled awake and recalled that Chen Feng wanted to kill him!</p><br/><p>\"Chen Feng!\" Wang Yue was thinking quickly as he recalled all the actions of Chen Feng so far. \"I will give you ten million. In the future, I will definitely not create any trouble for you. Our grudges shall end here. How about that?\"</p><br/><p>Ah.</p><br/><p>Chen Feng raised his hand.</p><br/><p>It wasn't enough?</p><br/><p>Wang Yue became vicious and said with clenched teeth, \"Chen Feng! We are both gene producers. I don’t know why your combat power is so strong. However, I am definitely better than you in regards of gene production! I will become an intermediate gene producer soon. You don’t want to compete against me during the gene rookie competition?\"</p><br/><p>Wang Yue remembered that this was something Chen Feng cared deeply about.</p><br/><p>However, what he did not know was that the current Chen Feng was no longer the Chen Feng he knew in the past! Every single thing Wang Yue understood about Chen Feng was wrong!</p><br/><p>\"Hum—\"</p><br/><p>A Wind Blade formed.</p><br/><p>The Wind Blade on Chen Feng’s hand was ready to be fired.</p><br/><p>\"What do you actually want?\"</p><br/><p>Wang Yue collapsed. Threats and bribe were not working. A challenge to compete was not working either. This Chen Feng was simply unmoved by force or persuasion. What would Chen Feng require in order to let him off?</p><br/><p>\"I want you to die.\" Chen Feng sneered. This guy had brought trouble to him over and over again. Had he really believed that Chen Feng was someone easy to bully? The moment Chen Feng got ambushed at the Desolate Rocky Grounds, he knew that Wang Yue had to die!</p><br/><p>\"Bang!\"</p><br/><p>Bright Wind Blades erupted instantly.</p><br/><p>Chen Feng’s killing intent was bubbling.</p><br/><p>\"No…\"</p><br/><p>Wang Yue trembled and almost peed his pants.</p><br/><p>I’m finished.</p><br/><p>This was the only thought he currently had in his mind.</p><br/><p>However, at this very moment, on his forehead, a plum blossom appeared and started rotating furiously. It flickered with a bizarre light and smashed the Wind Blades away.</p><br/><p>\"Young one, can you give me face and let him off?\"</p><br/><p>An old voice traveled out of the plum blossom, akin to a voice from across the horizon.</p><br/><p>This ability…</p><br/><p>The heart of Xu Fei and the rest jolted. This must be an extremely terrifying expert!</p><br/><p>They had never expected Wang Yue to have this kind of person looking after him!</p><br/><p>Instinctively, everyone looked at Chen Feng only to see him sneering. He was evidently not bothered with that voice as once again, Myriad Illusionary Wind Blades started shooting out of his hand.</p><br/><p>\"Bang!\"</p><br/><p>Wind Blades erupted.</p><br/><p>Protecting Wang Yue? Screw you! I insist on killing him!</p><br/><p>A cold glint flickered in Chen Feng’s eyes.</p><br/><p>He wanted to see, since the owner of the voice that came out of the flower had acted like such an important person, was he truly able to protect Wang Yue?</p><br/>\n</div>"}