{"title": "Chapter 128: Icefox Formula", "id": 128, "volume": 2, "url": "http://boxnovel.org/the-strongest-gene-chapter-128-icefox-formula", "volume_title": "Volume 2", "body": "<h1>Chapter 128: Icefox Formula</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 128: Icefox Formula</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>In the virtual livestream room, countless people were waiting for Chen Feng’s choice. However, when Chen Feng finally made his choice, almost everyone was dumbfounded. This formula…</p><br/><p>What the heck was he trying to do?!</p><br/><p>----</p><br/><p>Icefox Gene Formula</p><br/><p>Difficulty: 5 stars</p><br/><p>Function: Activation through spiritual energy, utilizing Iceheart for healing</p><br/><p>Introduction: Produced from the blood essence of an icefox. Various materials are required to trigger the mysterious power contained within the icefox gene, producing a special gene reagent as a result.</p><br/><p>----</p><br/><p>\"The heck?\"</p><br/><p>\"Why is it this formula?\"</p><br/><p>\"Let me check the function of this Iceheart. Mhm… I found it. Iceheart: Using the icefox gene to activate a formidable power possessing the ability to heal injuries and purify curses. Mhm, let me take a look. The ‘healing injuries’ here seems to mean that all sort of injuries can be healed? Even curses seem to be healable as well.\"</p><br/><p>Shua!</p><br/><p>The whole livestream room became silent immediately.</p><br/><p>Able to heal external and internal injuries? Even capable of purifying curses? Why not fly to the heavens while you were at it?!</p><br/><p>That’s right!</p><br/><p>This was a formidable gene capable of healing all three types of conditions! Regardless of external injuries, internal injuries, or curse purification, this gene had a certain effect on them. This was simply a Tiger Balm[1] of the medical field. However, the disadvantage of this Tiger Balm was quite obvious as well: having ordinary effectiveness!</p><br/><p>Competing with this gene?</p><br/><p>Simply courting death!</p><br/><p>\"Has Chen Feng gone crazy?\"</p><br/><p>\"Triple focus?\"</p><br/><p>\"Damn, this formula is so impressive. It’s like the indigo woad root[2] of the medical field.\"</p><br/><p>\"A godly indigo woad root.\"</p><br/><p>Everyone started berating Chen Feng.</p><br/><p>Some berated the formula, while some berated Chen Feng.</p><br/><p>They really couldn’t understand the reason Chen Feng had chosen such a formula. Could it be that he was so naive as to actually wish to heal everyone?!</p><br/><p>How was that possible!</p><br/><p>Only one day was available!</p><br/><p>\"It’s not too bad, right?\" Some people meekly said, \"What if it’s mainly used for purification while internal and external injuries were healed as a side effect to earn some extra points?\"</p><br/><p>\"Extra points my ass!\"</p><br/><p>The others couldn’t help but to voice out what was in their minds.</p><br/><p>\"This formula’s purification capability can’t be compared with a pure purification-type formula of the same level. The spiritual energy and spiritual strength required to obtain a similar effect are much higher. Do you understand? Even Qin Hai, with his 1,000 points of spirit attribute, only dares to choose a pure purification-type formula. Chen Feng, with his measly 250 spiritual energy, is thinking of soaring to the heavens?\"</p><br/><p>\"On what basis can he compete with Qin Hai?\"</p><br/><p>\"As for internal and external injuries…\"</p><br/><p>\"Think, after painstakingly producing a 5-star formula, it’s only used to heal some external injuries worth 1 or 2 points—is it worth it? How many can you produce per day?!\"</p><br/><p>So that was the case!</p><br/><p>The other guy opened his mouth yet couldn’t find any words to retort.</p><br/><p>In actuality, as the second round ended, a lot of people started looking forward to Chen Feng’s performance.</p><br/><p>They had even tacitly acknowledged the fact that Chen Feng was able to complete a brand new 5-star E-class formula. This was their highest acknowledgement of Chen Feng up till now!</p><br/><p>Who would have expected that, just as they started having high hopes for Chen Feng, they would witness him courting disaster instead!</p><br/><p>They really couldn’t understand this. Could it be that after winning the second round, Chen Feng’s arrogance had swelled to such an extent?</p><br/><p>In truth, they were not the only confused ones. Chen Feng himself couldn’t understand this choice either!</p><br/><p>\"What damnable formula is this?\"</p><br/><p>Chen Feng felt too powerless to even berate this choice.</p><br/><p>Icefox?</p><br/><p>The moment he saw this formula, he was dumbfounded.</p><br/><p>Triple focus!</p><br/><p>How much confidence did the Luck Aura have in him?</p><br/><p>Despite him believing that the 5-star icefox formula possessed a healing capability that would not be lacking even when compared with the all-healing Tiger Balm, with that terrifying spiritual energy consumption and the time required, how many could he produce in a day?!</p><br/><p>Iceheart…</p><br/><p>Healing all conditions…</p><br/><p>Chen Feng started looking for any hidden information.</p><br/><p>He believed that there was a reason Luck Aura had chosen icefox. At the very least, from his initial hopeless situation, it gave Chen Feng a chance of victory, an opportunity to counterattack!</p><br/><p>However, he had yet to discover the reason.</p><br/><p>\"Did the Luck Aura lose its effectiveness?\"</p><br/><p>Chen Feng checked his data.</p><br/><p>Approximately 10 points of luck value had been exhausted. This meant that this icefox gene was truly a choice made by the fully activated Luck Aura.</p><br/><p>He checked the data once again, yet couldn’t discover anything.</p><br/><p>Unless…</p><br/><p>A glimmer flashed in Chen Feng’s eyes.</p><br/><p>\"Produce one first!\"</p><br/><p>Chen Feng became spirited.</p><br/><p>For some things, the effects would only be apparent once it was actually produced.</p><br/><p>\"Shua!\"</p><br/><p>He opened the formula and quickly grasped the basic information of the formula.</p><br/><p>Then… let’s begin!</p><br/><p>This was a unique round.</p><br/><p>If one had to point out the good point of it, it was the fact that, as the royal teacher, the participants had complete access to all the materials in the royal warehouse. Theoretically, there were no limits to what the participants could do!</p><br/><p>\"Come, then!\"</p><br/><p>Chen Feng’s eyes were sharp as lighting.</p><br/><p>\"Shua!\"</p><br/><p>Light swirled before his eyes, and Chen Feng appeared in the imperial palace.</p><br/><p>The competition officially began!</p><br/><p>At the same time, almost all of the producers started their production.</p><br/><p>Here, no material gathering was required. Everything one required would be delivered by the soldiers. Every single person in the whole kingdom could be used as one saw fit.</p><br/><p>That included the king himself!</p><br/><p>As long as the participant wished for it, the king’s mental state could be checked at any time.</p><br/><p>For now, a majority of the producers who had chosen to purify the curses were starting to produce the curse gene. Even if they failed to heal the king, they had to heal the royal family.</p><br/><p>The scores were increasing without stop.</p><br/><p>On the other hand, the producers that had chosen external injuries had started to produce low-level genes in bulk. Using sheer quantity of points to increase their score!</p><br/><p>Every one of them had their own methods of facing the competition.</p><br/><p>In a certain kingdom.</p><br/><p>A donkey was painstakingly producing a gene reagent. Beside it was a shaggy yellow-colored ball radiating with a bizarre glimmer as the light particles around it flickered without stop.</p><br/><p>This was spirit enhancement!</p><br/><p>\"Ya!\"</p><br/><p>Rays of light flashed out of Yun Xiaoduo’s hand. With this, the donkey appeared even more spirited.</p><br/><p>This was spirit recovery!</p><br/><p>She was assisting the donkey in its gene production!</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>One bottle after another of gene reagents were completed unceasingly.</p><br/><p>Among all the producers that had chosen external injuries, Yun Xiaoduo’s score was the highest, leading far above the others, with the second highest scorer having only half her score!</p><br/><p>\"666666\"</p><br/><p>\"This is so excessive. Bullying the other lone producers with their numerical advantage.\"</p><br/><p>\"The donkey should be the actual master!\"</p><br/><p>\"Actually, I’m a fan of the donkey…\"</p><br/><p>The chat was spammed furiously.</p><br/><p>Viewing Yun Xiaoduo’s match was always an enjoyable activity. Able to roll over everyone in a relaxed and happy manner, the pleasure brought by this was something others were incapable of reproducing.</p><br/><p>Without a doubt, among the producers that had chosen external injuries, Yun Xiaoduo was the current first-place holder.</p><br/><p>None were capable of rivaling her!</p><br/><p>**</p><br/><p>In a certain kingdom.</p><br/><p>Qin Hai was there with a solemn expression.</p><br/><p>The purification formula he had chosen was extremely powerful. However, its difficulty was extremely high as well.</p><br/><p>However, with the never-ending supply of materials from the royal warehouse, he had finally produced a set of the gene reagent successfully. After using it on one of the royal family members, he found that its effect was extraordinary.</p><br/><p>\"This healing strength…\" Qin Hai muttered.</p><br/><p>There wouldn’t be any problems in healing the royal family with this.</p><br/><p>Only, for the king…</p><br/><p>It was still insufficient!</p><br/><p>\"I will continue production, then.\"</p><br/><p>Qin Hai’s eyes were sharp as lighting.</p><br/><p>Using these members of the royal family as practice, he continued spamming the production of this formula to attempt to create the most outstanding gene in order to heal the king and obtain the highest score!</p><br/><p>This was the confidence of Qin Hai.</p><br/><p>He aimed to, within a single day, heal every single person that was cursed!</p><br/><p>Next—</p><br/><p>If there was any remaining time, he could perhaps heal some of the others?</p><br/><p>Despite the fact that this formula he had chosen was unable to heal internal and external injuries, with his powerful background, he had already learnt a healing formula previously. Despite the formula he knew being only a 1-star F-class formula, it would be sufficient to heal some common citizens.</p><br/><p>His goal was first place!</p><br/><p>This time, he would not give any chances to Chen Feng.</p><br/><p>Footnotes:</p><br/><p>1. Tiger Balm is an actual existing ointment with wide ranging usages, similar to this gene chosen by Chen Feng which is a multipurpose healing gene.</p><br/><p>2.Indigo woad root – another Chinese herb traditionally used to heals a myriad of diseases. Refer to this link: http://www.chineseherbshealing.com/ban-lan-gen-isatis-root/. An excerpt from the link: Main functions are to clear heat-toxicity, cool blood, and relieve sore throat. Main usage and indications are macula due to pestilential toxicity invasion, high fever, headache, infection with swollen head, dark reddish purple tongue, scarlet fever, erysipelas, mumps, pharyngitis, sore boils and bunacles, chicken pox, measles, hepatitis, cold and flu, epidemic cerebrospinal meningitis, epidemic encephalitis B, pneumonia, unconsciousness, hematemesis, bleeding from five sense organs or subcutaneous tissue, swollen throat, pinkeye causing by inflammation, shingles, and osteomyelitis, etc. There, enjoy the science.</p><br/>\n</div>"}