{"title": "Chapter 137: Insta-Killing Everyone!", "id": 137, "volume": 2, "url": "http://boxnovel.org/the-strongest-gene-chapter-137-insta-killing-everyone", "volume_title": "Volume 2", "body": "<h1>Chapter 137: Insta-Killing Everyone!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 137: Insta-Killing Everyone!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"???\"</p><br/><p>\"Damn, what happened?\"</p><br/><p>In Chen Feng’s livestream room, everyone had a stupefied expression.</p><br/><p>The same thing repeated!</p><br/><p>One of them smiled forcefully as he said, \"I tried my best to look at it earlier. I could only see a flash of energy. Next, his opponent was directly defeated and the battle ended…\"</p><br/><p>\"Same here,\" the rest agreed.</p><br/><p>What damnable situation was this?!</p><br/><p>Look at the other livestream rooms. In each room, two androids with light swirling all over their bodies could be seen engaged in savage battle. Every single punch was hit right on the flesh, giving the viewers an unprecedentedly carefree feeling.</p><br/><p>As for Chen Feng’s room?</p><br/><p>Insta-kill!</p><br/><p>One could not even see the process of things. The only thing one could see was the moment of victory, that instant that was locked onto by the camera.</p><br/><p>\"Ah ah ah, I can’t take this anymore.\"</p><br/><p>\"I refuse to believe that I won’t be able to get a single clear look.\"</p><br/><p>\"Every android had different support genes used on them. Some received speed enhancements, some received defense enhancements, and apart from attribute increases, there’s also ability strengthening. I refuse to believe that Chen Feng will be able to insta-kill his opponents every time.\"</p><br/><p>\"Agree.\"</p><br/><p>A lot of people firmed their heart against Chen Feng.</p><br/><p>The third battle began.</p><br/><p>This time, Chen Feng’s opponent was a participant who was fully focused on defense.</p><br/><p>Both the physique and spirit attributes of the android had been greatly strengthened. Coupled with the enhancements provided by the support gene reagents, it possessed an extremely astonishing defense.</p><br/><p>\"This time, it definitely won’t end just like that.\"</p><br/><p>\"Yeah, even if Chen Feng can obtain victory, we will be able to see what methods he used.\"</p><br/><p>Everyone was looking forward to it.</p><br/><p>\"That’s for sure.\"</p><br/><p>\"Against such a powerful defense, insta-kill is definitely impossible—F*ck! It ended?\"</p><br/><p>The viewer who was mid-sentence had a dumbstruck expression.</p><br/><p>At this time, in the virtual ring, the android possessing extremely powerful defense had collapsed and turned into scraps before disappearing. The victory screen was locked onto Chen Feng as the battle ended.</p><br/><p>Chen Feng gained another point.</p><br/><p>Insta-kill!</p><br/><p>Another insta-kill!</p><br/><p>\"…\"</p><br/><p>The whole livestream room was silent.</p><br/><p>After a long time, someone said in a low voice, \"How is this possible?!\"</p><br/><p>True.</p><br/><p>How was that possible?!</p><br/><p>That was a defensive-type participant.</p><br/><p>Everyone had received the same template of android, so how the heck was he insta-killing the other androids?</p><br/><p>Strength?</p><br/><p>Spirit?</p><br/><p>Agility?</p><br/><p>They could not see any hope of victory from Chen Feng. Yet it was in such a hopeless situation that Chen Feng only needed to slightly raise his hand to easily insta-kill his opponents, shocking everyone present.</p><br/><p>\"This is only the third match…\"</p><br/><p>\"His opponents so far might be the comparatively weak ones?\" everyone guessed.</p><br/><p>Next, Chen Feng continued his matches.</p><br/><p>Fourth match, insta-kill!</p><br/><p>Fifth match, insta-kill!</p><br/><p>…</p><br/><p>Twentieth match, insta-kill!</p><br/><p>…</p><br/><p>Everyone was dumbstruck as they watched Chen Feng's smooth sailing.</p><br/><p>Insta-killing all the way!</p><br/><p>Without pause!</p><br/><p>Regardless of the strength of his opponent, as long as Chen Feng moved, the opponents would be insta-killed! In the time span required for one match by others, Chen Feng had completed ten matches!</p><br/><p>Too fast!</p><br/><p>This…</p><br/><p>The whole virtual livestream room was in an uproar.</p><br/><p>Chen Feng was not the only one progressing impressively. There were several other producers who obtained continuous victories as well.</p><br/><p>Yun Xiaoduo’s android bathed in flame with an incomparably terrifying appearance. Very few participants could survive more than three of her android’s punches. Lin Ke’s android had a huge mechanical armor on its body. With the azure-colored light swirling around it, when its fist descended, regardless of how powerful its opponents were, they would be beaten to death!</p><br/><p>Apart from this, there was a particular android radiating with gold light, sturdy as a rock.</p><br/><p>Its gene attributes were not particularly high. However, with the assistance of all sorts of formidable defense-type support genes, it was nearly undefeated. All sorts of attacks were ineffective against it. Next, its opponent would be exhausted to death.</p><br/><p>This was a path of a pure defense-type battling method.</p><br/><p>There was also a particular android that possessed an extremely fast speed, leaving afterimages all over the place. Different from Zhao Liu’s agility attribute increase, this android’s agility attribute was rather ordinary. The reason for its fast speed was due to the effect of the support gene reagents used on it. With tens of afterimages flashing around the ring, one would never know which was the real body. And the moment one was hit, only death awaited!</p><br/><p>This was a path of a pure agility-type battling method.</p><br/><p>Incredibly terrifying.</p><br/><p>Countless people felt their blood burning from excitement as they watched the matches.</p><br/><p>\"So powerful.\"</p><br/><p>\"I wonder when will they encounter each other.\"</p><br/><p>\"Yeah, between the strongest attack and the strongest defense, who will be the one surviving till the end?\"</p><br/><p>Everyone was looking forward to this.</p><br/><p>Yun Xiaoduo…</p><br/><p>Lin Ke…</p><br/><p>Everyone fully displayed a style unique to themselves.</p><br/><p>This was the battle of the top hundred. Almost everyone here had their own fans and popularity. The viewers of the competition were able recognize the names of almost all these participants.</p><br/><p>Who would be the final survivor?</p><br/><p>None knew.</p><br/><p>That was because these highlighted participants were undefeated.</p><br/><p>Twenty matches.</p><br/><p>Thirty matches.</p><br/><p>Forty matches.</p><br/><p>They had yet to encounter any defeats!</p><br/><p>However, this was an all-out battle. Regardless of one’s strength, one would still need to face every single one of the other 99 participants. Hence, Chen Feng had finally matched against an opponent who had yet to taste defeat as well.</p><br/><p>Sixty-second match.</p><br/><p>Chen Feng vs Tong Linger.</p><br/><p>\"It’s her.\"</p><br/><p>\"The one whose android was extremely fast, capable of leaving countless afterimages around!\"</p><br/><p>Everyone gasped.</p><br/><p>Tong Linger, possessing 19 support gene reagents.</p><br/><p>Under the constant combination of her support genes, she was able to grant her android a temporary explosion in speed, capable of leaving countless afterimages behind!</p><br/><p>She was undefeated.</p><br/><p>This was because the androids did not have any way to counter these afterimages of hers.</p><br/><p>If one couldn’t even find the real body, how was one supposed to contend with her?</p><br/><p>\"The confrontation of strong ones!\"</p><br/><p>Everyone was excited.</p><br/><p>\"I wonder who will be victorious,\" someone said emotionally.</p><br/><p>\"Victory my ass. I couldn’t care less about this. What I care about is, Chen Feng’s insta-kill ability, what on earth is that?\" someone said.</p><br/><p>Everyone agreed with the sentiment.</p><br/><p>What method was Chen Feng using to insta-kill his opponents?</p><br/><p>No one knew.</p><br/><p>Despite the fact that Chen Feng had insta-killed 61 times, they had still failed to find a clue about that. This was the most terrifying aspect of it.</p><br/><p>This time, against an android with countless afterimages and possessing extremely high combat power, with a certain degree of defensive methods on top of it, would Chen Feng be victorious?</p><br/><p>Shua!</p><br/><p>The battle begun.</p><br/><p>\"Hum—\"</p><br/><p>Countless afterimages scattered around.</p><br/><p>Xiu!</p><br/><p>Layers upon layers of afterimages streaked toward Chen Feng’s android from different angles and different directions, and even the speed of their charges was also different, giving no chance for the opponent to discover the real body.</p><br/><p>Which was the real body?</p><br/><p>\"Bang!\"</p><br/><p>Chen Feng raised his hand slightly, activating his gene reagent.</p><br/><p>\"Hum—\"</p><br/><p>A faint light flickered on his android’s body.</p><br/><p>Shua!</p><br/><p>All afterimages disappeared instantly.</p><br/><p>The android collapsed immediately, flung away.</p><br/><p>End of battle.</p><br/><p>Chen Feng, victorious.</p><br/><p>\"F*cccckkkk!\"</p><br/><p>Everyone widened their mouths for a long time. Again?</p><br/><p>Insta-kill!</p><br/><p>Another insta-kill!</p><br/><p>This was Tong Linger!</p><br/><p>The Tong Linger who was undefeated up till now!</p><br/><p>She had actually… ended up getting insta-killed?</p><br/><p>Only now did everyone realize something. This time, Chen Feng might have once again created an extremely terrifying powerful gene, and he might even grab first place once again.</p><br/><p>\"That won’t happen, right?\" Someone meekly said, \"After all, there are still several of those undefeated participants out there…\"</p><br/><p>However, shortly after, Chen Feng was matched against those people.</p><br/><p>Chen Feng’s 71st match.</p><br/><p>Chen Feng vs Lin Ke.</p><br/><p>The android with mechanical armor and an extremely powerful energy armor assembled using gene reagents, capable of amplifying the combat power by a wide margin, the android of Lin Ke!</p><br/><p>There were still quite a number of people who were looking forward to this confrontation.</p><br/><p>Next…</p><br/><p>The battle began.</p><br/><p>One second later, the battle ended.</p><br/><p>Insta-kill!</p><br/><p>Another insta-kill!</p><br/><p>Ah?</p><br/><p>Lin Ke had a bewildered expression.</p><br/><p>From the start till the end, he did not even have a chance to do anything!</p><br/><p>Extremely powerful energy and mechanical armor?</p><br/><p>Tenfold amplification in power?</p><br/><p>Before Chen Feng’s insta-killing ability, they were all pointless.</p><br/>\n</div>"}