{"title": "Chapter 140: Too Shameless", "id": 140, "volume": 2, "url": "http://boxnovel.org/the-strongest-gene-chapter-140-too-shameless", "volume_title": "Volume 2", "body": "<h1>Chapter 140: Too Shameless</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 140: Too Shameless</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At this time, as everyone was protesting, the Gene Production Association released their statement. All data related to Chen Feng was normal and no violations of the rules were found.</p><br/><p>At the same time, the data was made public.</p><br/><p>\"True indeed.\"</p><br/><p>Nobody was surprised.</p><br/><p>Reported?</p><br/><p>What a joke. This wasn’t the first time this had happened anyway.</p><br/><p>\"It’s better to take a look at the released data.\"</p><br/><p>Everyone started watching the replay, and they were immediately stunned.</p><br/><p>They had imagined countless possibilities. However, it had never crossed their mind that the way Chen Feng obtained his victory was this! The gene reagent he used…</p><br/><p>Was actually such a gene!</p><br/><p>\"This…\"</p><br/><p>\"The f*ck? This works?\"</p><br/><p>\"Wait, this, how is this possible?\"</p><br/><p>Everyone had dumbfounded expressions.</p><br/><p>This was because, at this moment, they had finally found out the secret behind Chen Feng’s victory.</p><br/><p>----</p><br/><p>Mutated Bluebat Gene</p><br/><p>Class: E</p><br/><p>Function: Instantly increases spirit by 500 points for a duration of 3 seconds.</p><br/><p>----</p><br/><p>On the screen.</p><br/><p>At that instant, Chen Feng had directly activated approximately 20 mutated bluebat genes, bringing about a terrifying spirit enhancement effect! As per the released data, after using these specially mixed reagents, its spirit attribute had increased from 200 points to 10,000 points.</p><br/><p>\"This…\"</p><br/><p>Nobody had expected this to be so close to what they had initially guessed.</p><br/><p>The bluebat had been mutated indeed!</p><br/><p>Chen Feng indeed possessed such unique talent!</p><br/><p>However…</p><br/><p>Even if they were mutated, it was not possible for them to be activated at the same time, right?</p><br/><p>\"Chen Feng must have used his genetic ability.\"</p><br/><p>As Sun Han saw the data, he was even more sure of this.</p><br/><p>\"This data is incorrect,\" someone stated unbelievably. \"It is simply impossible for one to be able to bear such an amount of enhancements! Increasing the spirit attribute in such a high quantity would break the person down!\"</p><br/><p>That was right. From 200 to 10,000?</p><br/><p>Nobody could bear such a big increase, even if it was an android!</p><br/><p>This was common sense.</p><br/><p>Even if the producer is Chen Feng, it should still apply.</p><br/><p>However…</p><br/><p>So what if nobody could bear with such a big increase?</p><br/><p>At this moment, the replay continued.</p><br/><p>This time, after the replay was slowed down countless times, they were finally able to see clearly: the moment the android insta-killed its opponent, its own body was slowly dissolving as well.</p><br/><p>In three seconds, its whole body broke down and died.</p><br/><p>Due to the terrifying increase in attributes, the android was simply incapable of bearing with it.</p><br/><p>Hence, it died.</p><br/><p>However, this did not seem to have any effect on the competition, right?</p><br/><p>Dead?</p><br/><p>No problem!</p><br/><p>It would recover during the next match anyway. This was only a virtual competition. As long as the android was not damaged before the match ended, it would be fine.</p><br/><p>The brain would be damaged?</p><br/><p>No problem!</p><br/><p>The android was controlled by Chen Feng anyway. It did not need a brain at all!</p><br/><p>Hence, Chen Feng had used such suicidal methods, using such a method that was unusable in real life, to accomplish his terrifying acts of insta-killing!</p><br/><p>No one was able to contend with him.</p><br/><p>\"…\"</p><br/><p>Everyone sunk into silence.</p><br/><p>They had imagined countless possibilities. However, this had never crossed their minds!</p><br/><p>Superposition, followed by death!</p><br/><p>If Chen Feng were to do this in real life, before he could even do anything, he would burn himself to death. However, in the virtual world, he succeeded.</p><br/><p>Mutation!</p><br/><p>Enhancement!</p><br/><p>Simple as that.</p><br/><p>The f*ck?</p><br/><p>Everyone was in stupor for a long time. Were they the one who was wrong, or was Chen Feng’s line of thought too erratic?</p><br/><p>\"Even with this, it shouldn’t be right.\" Sun Han opened his mouth once again. \"The android possessed the most basic of attacks, Spirit Shock. Even if Chen Feng’s android reach 10,000 points, it is still impossible to destroy my defense in an instant!\"</p><br/><p>\"You need to know that my defense was instantly destroyed!\"</p><br/><p>At this time, everyone came to themselves.</p><br/><p>True.</p><br/><p>Sun Han’s android was insta-killed. This meant Chen Feng’s attack far surpassed its defense!</p><br/><p>What was the reason for this, then?</p><br/><p>\"Look at this fast.\"</p><br/><p>The replay was slowed down once again.</p><br/><p>This time, everyone could clearly see that, between the activations of his 20 bluebat gene reagents, Chen Feng had also used a specific item—aurora gene reagent!</p><br/><p>Virus blossomed.</p><br/><p>Genes ignited.</p><br/><p>Another suicidal gene reagent!</p><br/><p>When the android entered Virus Mode, its initially ordinary Spirit Shock displayed an unimaginably terrifying power, instantly killing Sun Han's android!</p><br/><p>Indeed.</p><br/><p>One would be very miserable after using the aurora reagent.</p><br/><p>Furthermore, if one were somewhat unlucky, one’s main genes might be the ones ignited right off the bat after using the aurora reagent, causing one’s own death. However…</p><br/><p>Chen Feng had won.</p><br/><p>\"Gene… virus?\"</p><br/><p>Everyone stared at the gene introduction in a daze.</p><br/><p>Another suicidal gene reagent?</p><br/><p>A reagent whose nature was similar to a gamble on top of that?</p><br/><p>Hence…</p><br/><p>This was how Chen Feng had insta-killed everyone here, obtaining the final victory?!</p><br/><p>If it was in real life, regardless of whether it was that terrifying spirit enhancement or gene virus, Chen Feng would have played himself to death before he even made his move. It was simply impossible to defeat a real life opponent using such a method.</p><br/><p>However—</p><br/><p>This was only a competition!</p><br/><p>This was only virtual combat!</p><br/><p>\"Why did it have to be this way?\"</p><br/><p>Sun Han had a bewildered expression.</p><br/><p>The data had been released; Chen Feng had not cheated.</p><br/><p>However, the truth was even harder for him to accept. He had actually been defeated by such a method that was unusable in real life. Furthermore, luck played a big factor in the final eruption of that gene virus! If he was somewhat luckier at that time, Chen Feng would have been the one playing himself to death, and he would be the one entering the top 10?</p><br/><p>This…</p><br/><p>\"I am not satisfied!\" Sun Han howled.</p><br/><p>Top 10.</p><br/><p>His dream of entering the top 10 had ended just like that.</p><br/><p>Naturally, the pitiful Sun Han did not know that the reason for Chen Feng to dare to use the aurora reagent was due to his absolute confidence in it!</p><br/><p>Luck?</p><br/><p>This was simply a nonexistent concern for him!</p><br/><p>At this time, after the data was fully released, the fourth round officially ended. Chen Feng’s name once again engulfed the whole world at a terrifying speed.</p><br/><p>\"The birth of the top 10! Chen Feng standing in first place again!\"</p><br/><p>\"Inconceivable victory, do you approve of such methods?\"</p><br/><p>\"The ghost talent[1] Chen Feng, will he be able to walk to the end with his wits?\"</p><br/><p>\"Victory obtained through a crazy gamble, is a gene virus a usable gene?!\"</p><br/><p>Various media outlets released their news.</p><br/><p>Chen Feng was once again at the forefront of this big wave.</p><br/><p>Such suicidal attacking methods attracted countless criticisms. The virtual scenario was originally generated as a simulation of the real world. However, it was actually defeated using such a method.</p><br/><p>Too many people were unsatisfied with this!</p><br/><p>This did not only apply to those producers in the top 100 that were eliminated. Even the survivors in the top 10 felt the same.</p><br/><p>\"I was defeated by such a method?\"</p><br/><p>Qin Hai smiled bitterly after he looked at the data.</p><br/><p>This was truly…</p><br/><p>Too absurb!</p><br/><p>\"I was insta-killed by this kind of person?\"</p><br/><p>A cold glint flickered in Lin Ke’s eyes.</p><br/><p>He suffered several defeats in that round. However, only his defeat against Chen Feng had happened in such a ridiculous manner. However, he had never expected that it was actually such a method that was simply akin to cheating!</p><br/><p>Too hateful!</p><br/><p>They could not accept their defeats!</p><br/><p>\"If…\"</p><br/><p>\"If it was the real world…\"</p><br/><p>Everyone had a fire of fury burning in their hearts.</p><br/><p>They could not accept this!</p><br/><p>The top 10 was in itself a supreme glory to those in it!</p><br/><p>But now…</p><br/><p>Due to Chen Feng’s existence, the nature of the top 10 was somewhat altered. This group of people that should have been comprised of the strongest producers had someone bizarre like Chen Feng in it!</p><br/><p>How was he qualified to enter the top 10? This was what a lot of people wanted to ask.</p><br/><p>Production level?</p><br/><p>Only beginner.</p><br/><p>Accumulation?</p><br/><p>His was simply nonexistent.</p><br/><p>Every single time he obtained victory, he relied on newly acquired formulas before proceeding to look for a loophole in the rules to use some tricks to obtain victory. How could they accept this?</p><br/><p>In all honestly, Chen Feng’s accomplishments were unacceptable to at least half of them. It was fine if it were to happen in the beginning of the competition. However, now that it was the top 10?</p><br/><p>A lot of people couldn’t put up with this anymore.</p><br/><p>Footnotes:</p><br/><p>1. Ghost talent is a Chinese term used to describe a person who is capable of solving problems using peculiar methods with the peculiar methods being even more efficient than normal methods.</p><br/>\n</div>"}