{"title": "Chapter 163: Qin Hai’s Secret", "id": 163, "volume": 2, "url": "http://boxnovel.org/the-strongest-gene-chapter-163-qin-hai%E2%80%99s-secret", "volume_title": "Volume 2", "body": "<h1>Chapter 163: Qin Hai’s Secret</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 163: Qin Hai’s Secret</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Two digitized worlds started overlapping.</p><br/><p>The void under their feet became a firm earth. That was Chen Feng’s portion of the digitized world. What alarmed others about the overlapped digitized world was the fact that a huge palace descended from the sky.</p><br/><p>Bang!</p><br/><p>A dazzling golden palace.</p><br/><p>It appeared incredibly conspicuous in this multicolored digitized world.</p><br/><p>Hum—</p><br/><p>Spiritual energy flickered.</p><br/><p>Qin Hai’s silhouette appeared in front of the palace.</p><br/><p>This… was his portion of the overlapped digitized world!</p><br/><p>\"You are actually able to force me to this point.\"</p><br/><p>Qin Hai left his palace and started stepping forth step by step.</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>One ceramic tile after another formed beneath Qin Hai’s feet, forming a path for him to step on.</p><br/><p>\"This is…\"</p><br/><p>Chen Feng inhaled a mouthful of cold air.</p><br/><p>Building a path as he walked?</p><br/><p>What damnable ability was this?</p><br/><p>Qin Hai had a serene expression. \"Initially, I hadn't wanted to use this.\"</p><br/><p>In his eyes, a bizarre black aura flickered.</p><br/><p>\"This guy…\"</p><br/><p>Chen Feng’s heart jolted.</p><br/><p>He was sure that something was definitely wrong with this Qin Hai guy.</p><br/><p>Not wanting to use this?</p><br/><p>Why?!</p><br/><p>If Qin Hai’s digital battle capability was really so powerful, he could do what Chen Feng had done in his earlier matches, using digital battles to defeat his opponent!</p><br/><p>It would be too easy!</p><br/><p>Gene armament?</p><br/><p>Demonic fern?</p><br/><p>He would be able to easily obtain victory without using either of those.</p><br/><p>However…</p><br/><p>He only chose to use it at the last moment?</p><br/><p>There had to be a problem with this!</p><br/><p>Chen Feng focused his gaze.</p><br/><p>He knew that as long as he found the problem, he would definitely win!</p><br/><p>Or perhaps…</p><br/><p>\"Chen Feng, goodbye.\"</p><br/><p>A sneer formed on Qin Hai’s mouth.</p><br/><p>Hua!</p><br/><p>Behind him, from that huge palace, heavy yet orderly footsteps could be heard. Chen Feng raised his head and looked over at the palace. There, an army of armored soldier appeared. These were actually soldiers formed purely from gene fragments!</p><br/><p>\"Kill!\"</p><br/><p>Qin Hai raised his hand.</p><br/><p>Hua!</p><br/><p>All the soldiers shot forth toward Chen Feng!</p><br/><p>\"Bang!\"</p><br/><p>The livestream rooms were shocked.</p><br/><p>\"Qin Hai’s digitized world is so powerful?\"</p><br/><p>\"Having a palace is powerful enough. To think that he had even established an army there?\"</p><br/><p>\"This…\"</p><br/><p>Everyone found this inconceivable.</p><br/><p>Digital battles had appeared in the previous Gene Rookie Competitions as well. However, these were mostly digital battles where simple attacking and defending moves were used. Such a complete structure had never appeared in a Gene Rookie Competition before.</p><br/><p>\"Perhaps…\"</p><br/><p>\"This is the strength of an advanced gene producer?\" someone muttered in a low voice.</p><br/><p>Only at this did everyone recall that Qin Hai was already an advanced gene producer!</p><br/><p>\"Something is going to happen!\"</p><br/><p>Everyone was alarmed. \"In this match, Qin Hai was beaten back twice by Chen Feng and was almost killed. Now, with how powerful he is in digital battles, I’m afraid he will not let Chen Feng off!\"</p><br/><p>Hopefully…</p><br/><p>Nothing bad would happen!</p><br/><p>Everyone was unable to take their eyes off.</p><br/><p>At this time, in the virtual company building, Gao Yunfeng and Hou Liang were unprecedentedly attentive to this match as well.</p><br/><p>They wished that the strongest producer would result from this match. However, they did not wish for anything to happen to either of them as well. Regardless of it being Chen Feng or Qin Hai, both were the strongest geniuses.</p><br/><p>For the very first time, Hou Liang issued a command: \"If we really can’t help it, we can just stop the match with force!\"</p><br/><p>\"Understood,\" Gao Yunfeng replied.</p><br/><p>In this confrontation between the two strongest geniuses, who would be victorious?</p><br/><p>Everyone was looking forward to it.</p><br/><p>However, they were also clear that, against this true digitized world, against this advanced producer Qin Hai, against this huge palace, against these soldiers, was there truly any hope of victory for Chen Feng?</p><br/><p>\"Bang!\"</p><br/><p>The army of soldiers charged toward Chen Feng.</p><br/><p>A smile formed on Chen Feng’s lips. \"I’ll be counting on you.\"</p><br/><p>Xiu!</p><br/><p>A red flash.</p><br/><p>A perfectly straight red line flashed through the air, piercing through the first soldier it encountered. Next, it curved in a perfect arc and pierced through the soldier beside it.</p><br/><p>Pu!</p><br/><p>Pu!</p><br/><p>Pu!</p><br/><p>The red flash streaked back and forth.</p><br/><p>One soldier after another collapsed.</p><br/><p>That red flash appeared incredibly dazzling in that multicolored world. Its speed was so fast that afterimages were left behind. Every single time it flashed, countless soldiers would collapse.</p><br/><p>Xiu!</p><br/><p>Xiu!</p><br/><p>The red was dazzling.</p><br/><p>The several hundred solders under Qin Hai's control collapsed on their path of assault.</p><br/><p>Beng!</p><br/><p>Beng!</p><br/><p>All the solders dispersed, changing back into gene fragments.</p><br/><p>This seemed more like a one-man show of that red light, shocking everyone watching!</p><br/><p>\"You…\"</p><br/><p>Qin Hai looked at Chen Feng with an unbelievable expression.</p><br/><p>He was very clear on how powerful those soldiers were. Any random one of them was capable of crushing a newbie's entire newly formed digitized world.</p><br/><p>For someone at the level of Zhao Tian?</p><br/><p>A single soldier was sufficient.</p><br/><p>Now, though, all these soldiers were pierced by that red light?</p><br/><p>What ability was that?!</p><br/><p>This was the very first time Qin Hai felt shocked. This was also the first time he felt the peculiar aura surrounding Chen Feng, a freak more freakish than him!</p><br/><p>Qin Hai inhaled deeply. \"Time to clean this up.\"</p><br/><p>He had to end this quickly to avoid anything unexpected happening. There were truly too many variables when facing this Chen Feng.</p><br/><p>Trump card?</p><br/><p>There was no point.</p><br/><p>Since he was already here, he might as well use the strongest method at his disposal to erase Chen Feng. Despite that being something he wanted to never use, despite… that being somewhat dangerous to use!</p><br/><p>\"Hum—\"</p><br/><p>A flash of black light.</p><br/><p>Qin Hai’s body was enveloped by a layer of black armor.</p><br/><p>\"Go!\"</p><br/><p>A flash of red light.</p><br/><p>The red light that was coiled around Chen Feng streaked forth toward Qin Hai.</p><br/><p>However…</p><br/><p>Ding!</p><br/><p>A crisp sound.</p><br/><p>That perfectly straight red light failed to pierce through the armor!</p><br/><p>What’s going on?</p><br/><p>Chen Feng was astonished. He could clearly feel Xiao Ying’s pain. It was a feeling akin to what one felt when one’s nose smashed into a steel plate when running at full speed…</p><br/><p>Hum—</p><br/><p>Xiao Ying transmitted a pitiful emotion over to him.</p><br/><p>\"Try one more time?\" Chen Feng proposed.</p><br/><p>Ding!</p><br/><p>Another crisp sound. Once again, Xiao Ying returned without accomplishing anything.</p><br/><p>What’s going on?!</p><br/><p>Chen Feng was shocked.</p><br/><p>Others might think that this was a pure attack. However, Chen Feng was clear that Xiao Ying was a special existence capable of devouring genes. It had actually failed to devour this armor?</p><br/><p>Was it because the armor was too firm?</p><br/><p>Chen Feng asked Xiao Ying. The answer he received was…</p><br/><p>It couldn’t be eaten!</p><br/><p>In other words, this thing here, was not formed of genes!</p><br/><p>If it was not formed of gene fragments, how had it appeared in this world?</p><br/><p>Chen Feng abruptly realized something.</p><br/><p>This might be related to the reason Qin Hai did not plan to use his digitized world, the secret he was concealing might very well be here. As long as Chen Feng found out what the issue was, Qin Hai’s defense would naturally be foiled!</p><br/><p>This world…</p><br/><p>Chen Feng looked toward the world behind Qin Hai. That huge palace!</p><br/><p>Xiao Ying!</p><br/><p>Xiu!</p><br/><p>A flash of red light.</p><br/><p>\"Ah.\"</p><br/><p>Qin Hai merely sneered.</p><br/><p>Wanting to break through the defense of his palace?</p><br/><p>How naive!</p><br/><p>One had to know…</p><br/><p>That was…</p><br/><p>Bang!</p><br/><p>Xiao Ying pierced through the palace.</p><br/><p>A glimmer of light appeared on the palace. It had been pierced through!</p><br/><p>\"Howl—\" Qin Hai raged immediately.</p><br/><p>\"Bang!\"</p><br/><p>The digitized world trembled.</p><br/><p>Chen Feng wanted to see what was contained within the palace, but he failed. This was because the raging Qin Hai had suddenly increased tenfold in size and attacked Chen Feng.</p><br/><p>\"Pu!\"</p><br/><p>A sword pierced through Chen Feng.</p><br/><p>Chen Feng, defeated.</p><br/><p>\"Bang!\"</p><br/><p>The digitized world crumbled.</p><br/><p>The Qin Hai that was on the brink of victory had instead shut down the digitized world with force.</p><br/><p>\"Pu!\"</p><br/><p>Blood spilled out of the chest of Chen Feng’s physical body in the simulated environment.</p><br/><p>Injured!</p><br/><p>Despite this being only a single attack, despite the fact that his spiritual body was not completely destroyed, he was still gravely injured. What he couldn’t understand was why Qin Hai had taken the initiative to shut down the digitized world?</p><br/><p>One had to know that Qin Hai was holding the advantage in the digitized world!</p><br/><p>The power he erupted with was completely capable of crushing Chen Feng!</p><br/><p>If he had used one more second to land another attack on Chen Feng, Chen Feng’s spiritual body would have been directly erased, and he would have died not only in the digitized world. Instead, he would suffer a true death!</p><br/><p>However…</p><br/><p>In such a situation, Qin Hai had taken the initiative to shut down the digitized world?</p><br/><p>Something was indeed wrong with him!</p><br/><p>Chen Feng had a solemn mood.</p><br/><p>He was clear that the entire secret, the answer for everything, was within that palace, the interior of the palace that had been about to be exposed ealier!</p><br/>\n</div>"}