{"title": "Chapter 181: Peril Rebirth!", "id": 181, "volume": 2, "url": "http://boxnovel.org/the-strongest-gene-chapter-181-peril-rebirth", "volume_title": "Volume 2", "body": "<h1>Chapter 181: Peril Rebirth!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 181: Peril Rebirth!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Star City. Everyone was still immersed in their shock.</p><br/><p>Chen Feng’s act of reaching 1,500 points of spiritual energy had indeed alarmed everyone!</p><br/><p>This was no longer a problem concerning growth rate. Rather, the concern was someone exceeding the theorized limit by 500 points. This was what everyone was paying attention to.</p><br/><p>\"Chen Feng…\"</p><br/><p>Countless people silently remembered this name despite the fact that they had never met him in person.</p><br/><p>Currently, in his room, Chen Feng was getting used to his new power obtained from the rapid growth in his spiritual energy. His spiritual energy had increased greatly, so he had to adapt to it as soon as possible.</p><br/><p>Suddenly, someone knocked on his door. Chen Feng opened the door. It was Hou Liang.</p><br/><p>Hou Liang glared at him ferociously. \"Kid, the only thing you know is to court trouble!\"</p><br/><p>\"Cough cough.\" Chen Feng coughed and said seriously without a change in expression, \"I did exactly what you requested of me, to increase my strength as much as I can.\"</p><br/><p>\"Yes, but I never told you to surpass 1,000 points of attribute!\" Hou Liang said grudgingly. \"Do you still want to take on this mission?!\"</p><br/><p>\"That’s completely an accident!\" Chen Feng laughed awkwardly. He had never expected that this single session of improvement of his had pushed him above the limit required for one to accept the mission. This was getting awkward.</p><br/><p>Hou Liang handed over a bottle of gene reagent to him. \"Take this.\"</p><br/><p>\"This is…\"</p><br/><p>Chen Feng accepted it. After taking a look, his eyes lit up.</p><br/><p>----</p><br/><p>Lingerbright Beast Gene Reagent</p><br/><p>Function: Lowering the spiritual energy by 500 points and increasing the agility, strength and physique by 200 points each.</p><br/><p>Duration: 10 hours</p><br/><p>----</p><br/><p>\"A good thing!\"</p><br/><p>Chen Feng’s eyes shone.</p><br/><p>This was a peculiar gene reagent. Despite the low increase in attributes and the somewhat weak effect it had, the advantage of this gene reagent was its long duration!</p><br/><p>Approximately 10 hours!</p><br/><p>If he were to use it during the mission…</p><br/><p>\"Such a thing exists?\"</p><br/><p>Chen Feng gasped in admiration.</p><br/><p>He had initially thought that he would miss this mission. Now, though, there was still a way to fix this.</p><br/><p>Wait.</p><br/><p>Suddenly, Chen Feng felt that something was amiss.</p><br/><p>If such a thing existed, any random advanced producer with attribute in the 1,000s would be able to take on the mission, right? Moreover, an advanced producer should have a richer experience compared to Chen Feng.</p><br/><p>Chen Feng voiced his concern.</p><br/><p>\"Simple. First, we have very few advanced producers with 1,000–1,500 spiritual energy. Second, even if they were to reduce their attribute and drop back into E class with a 1,000 or lower attribute, their combat power would be too weak. Hence, they won’t be able to achieve much. Third, the producer that produced this gene reagent is somewhat stingy. Fourth, using such a method to reduce one’s attribute, one might not be able to reverse its effect.\"</p><br/><p>Hou Liang had a solemn expression.</p><br/><p>Unable to reverse?</p><br/><p>Chen Feng had a solemn mood.</p><br/><p>In other words, if a newly advanced D class were to use it, they might be stuck in E class forever. This was indeed quite a scary prospect.</p><br/><p>\"So I’m still the candidate for this mission?\" Chen Feng asked cautiously.</p><br/><p>\"Naturally.\" Hou Liang glared at him ferociously. \"When I told you to increase your strength, I wasn't telling you to go and cause me trouble. Instead, you needed to increase your strength as much as you could within the limit required for you to still be qualified for the mission. Do you understand?\"</p><br/><p>\"Yes,\" Chen Feng answered.</p><br/><p>After walking several steps forward, Hou Liang turned around again, as he was still worried, and said earnestly, \"Chen Feng, this is your home now. Home, do you understand? This is not a competition. This is not an exam. Hence, there’s no need for you to go around breaking records for fame. Do you understand?\"</p><br/><p>Chen Feng nodded. \"Understood.\"</p><br/><p>\"Then… stop causing trouble. All right?\" Hou Liang was deeply worried.</p><br/><p>\"I won’t,\" Chen Feng pledged. \"What happened this time was an accident anyway.\"</p><br/><p>It truly was an accident!</p><br/><p>God knows why he had suddenly increased his attribute to 1,500 without breaking through the limit?</p><br/><p>\"That’s good, then.\" After obtaining Chen Feng’s promise, Hou Liang staredly stare at him before leaving.</p><br/><p>Chen Feng: \"…\"</p><br/><p>Do I look like a troublemaker?</p><br/><p>However, unaware to him, currently, everyone in the city already knew about him!</p><br/><p>This was the Gene Production Association’s headquarters. Naturally, all the producers here could at all times detect changes in the aura of the area. With the uproar Chen Feng had caused, how could they not have noticed it?</p><br/><p>Only having arrived a day ago, yet Chen Feng was already known to all.</p><br/><p>Chen Feng sighed. \"I really was merely trying to increase my strength.\"</p><br/><p>He shook his head and stopped thinking about all this as he shifted his attention to the other item—ardent tiger spring.</p><br/><p>A mystical gene reagent, capable of increasing the quality of one’s body.</p><br/><p>Gulp.</p><br/><p>Chen Feng gulped it down.</p><br/><p>All his attributes except spirit increased by 100 points.</p><br/><p>Bang!</p><br/><p>Chen Feng punched at the air.</p><br/><p>A vigorous punch.</p><br/><p>Such items capable of increasing the quality of one’s body could only be found here. According to the introduction, it was a special version for producers that was produced after reducing the pain one might suffer during the process of attribute increase.</p><br/><p>Worthy of being the headquarters indeed.</p><br/><p>Hu—</p><br/><p>Chen Feng inhaled deeply as he once again familiarized himself with his new strength.</p><br/><p>His combat power had increased greatly.</p><br/><p>Strength, agility, physique, spirit, all his attributes were increased.</p><br/><p>\"This is still not enough.\"</p><br/><p>Chen Feng’s eyes were sharp as lighting.</p><br/><p>All along, he had always been clear on his goal.</p><br/><p>To increase his strength!</p><br/><p>Completing the purifying mission. Next, trade for a bunch of D-class fusion gene reagent formulas!</p><br/><p>This was his true goal!</p><br/><p>Things like genes…</p><br/><p>Chen Feng had his own research on them.</p><br/><p>If a score was to be assigned to each fusion gene reagent used after each class advancement, it was very probable for the final combat power to be equivalent to the superposition of the power of all fusion gene reagents one used at each class!</p><br/><p>As long as a single one of the fusion gene reagents was somewhat weak, the person’s overall strength would be greatly reduced.</p><br/><p>Since he wanted to break through, the strongest fusion gene reagent had to be used!</p><br/><p>And out of the whole world, this was the only place where all those strongest fusion gene reagents could be found.</p><br/><p>Only here could one find the strongest formula!</p><br/><p>Only here could one find the most complete gene bank!</p><br/><p>He wanted to, from the huge amount of available formulas here, choose a formula with the highest difficulty, the strongest, rarest, and most suitable formula for him, to create a strongest gene for himself!</p><br/><p>\"Increase my strength as quickly as possible. Complete the purifying mission before breaking through to D class!\"</p><br/><p>Chen Feng was aware of his goal.</p><br/><p>Despite the fact that his strength had now increased, for him, it was still far from enough.</p><br/><p>He had only accepted the mission to obtain more resources instead of accepting the mission to throw his life away. Even if the association would dispatch some geniuses to help him, Chen Feng would definitely not trust others with his life.</p><br/><p>\"In this month’s period, I must become stronger!\"</p><br/><p>Chen Feng’s eyes were sharp as lighting.</p><br/><p>Now that he was done with increasing his attribute, he shifted his attention to the final reward he had received. It was not the D-class formula rewarded to him. Instead, his attention was on the reward for his producer certification. The reward received after his producer certification.</p><br/><p>As a producer of the headquarters, the reward he received would be much more generous.</p><br/><p>Beginner producer certification: Any F-class formula x1 as a reward (thundersnake gene formula was chosen).</p><br/><p>Intermediate producer certification: One copy of \"Spiritual Energy Usage Skills, from Well Practiced to Proficient\" (uncollected).</p><br/><p>Advanced producer certification: One copy of \"Five Years of Digitized Construction and Three Years of Digital Battle\" (uncollected).</p><br/><p>Master producer certification: One set of gene armament known as \"Peril Rebirth\" (uncollected).</p><br/><p>…</p><br/><p>\"That is…\"</p><br/><p>As Chen Feng looked at the reward for the master certification, his heart started burning.</p><br/><p>He was aware that the headquarters would provide a much better reward to their producers compared to a normal branch. However, he had never expected the reward to be so generous!</p><br/><p>Peril Rebirth!</p><br/><p>This was an extremely powerful gene armament also known as \"Phoenix’s Nirvana!\"</p><br/><p>On the market… this gene armament was simply priceless!</p><br/>\n</div>"}