{"title": "Chapter 184: Master Producer!", "id": 184, "volume": 2, "url": "http://boxnovel.org/the-strongest-gene-chapter-184-master-producer", "volume_title": "Volume 2", "body": "<h1>Chapter 184: Master Producer!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 184: Master Producer!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Master producer’s certification!</p><br/><p>Lowest requirement being 10,000 points of spiritual energy!</p><br/><p>An amount of spiritual energy that was only traditionally reachable by those in peak D or C class. Under normal circumstances, even those in peak D-class would only meet the minimum requirements. If one wanted to produce successfully by only meeting the minimum requirements? It would be difficult!</p><br/><p>Hence, it slowly became common sense that if one wanted to advance into master producer, one must first be at C class.</p><br/><p>As for Chen Feng?</p><br/><p>Merely peak E class!</p><br/><p>Even if his spiritual energy surpassed an ordinary person, it was only 1,500 points! Attempting the master producer certification with only 1,500 points of spiritual energy?</p><br/><p>Had he gone insane?</p><br/><p>A well-known producer frowned. \"He is acting somewhat reckless this time.\"</p><br/><p>All this while, although they thought that Chen Feng was a bit of a show-off when he handled things, they still approved of him. Now, though, they were wondering if this child was now too excessive in his attempt to show off.</p><br/><p>Presently, he only had 1,500 points of spiritual energy!</p><br/><p>Master producer’s certification?</p><br/><p>Apart from seeking sensationalism, what was the point in attempting this certification?</p><br/><p>A large majority of producers still essentially prefer a low-profile and steady manner of handling things. Chen Feng’s impetuous methods had attracted some resentment from some producers.</p><br/><p>\"With this little ability of his, he’s showing off too much, right?\" a well-endowed female producer said as she pouted.</p><br/><p>Her companion smiled. \"Ha Li, don’t be too harsh on a newbie. Since he dares to attempt it, he should have his methods for it. When you first joined two years ago, I don’t recall you having the courage to do this.\"</p><br/><p>\"This kind of courage, what do I need it for? Isn’t it merely spiritual energy requirement reduction? Who doesn’t know about that? If there’s only a small difference to make up, it should work. But with the current 1,500 points of spiritual energy he has? Who is he trying to delude?\" Ha Li snorted and said in an annoyed manner, \"Every time one attempts a production certification, a huge amount of testing materials will be wasted. If one attempts the certification without confidence in passing, it’s merely an act of wasting resources!\"</p><br/><p>At this moment, Chen Feng had already started his master producer’s certification.</p><br/><p>He was very clear on what everyone was currently thinking about. He was also very clear on what light his current actions had put him in.</p><br/><p>Even in his previous life, when someone applied for college entrance examinations before even graduating from junior high school, it would be reported by some media outlets and end up online where countless parties would start berating the person in question. In this world, things would be similar. He had long accustomed himself to this.</p><br/><p>Just because someone had 1,500 points of spiritual energy, one wouldn’t make it? Just because one was in E class, one would fail?</p><br/><p>How ridiculous!</p><br/><p>Chen Feng’s eyes gleamed.</p><br/><p>Shua!</p><br/><p>Formula data read!</p><br/><p>Gene production began!</p><br/><p>Firstly, Chen Feng familiarized himself with the certification formula. Next, he prepared all the required materials accordingly and placed them all around him before starting his production.</p><br/><p>First step.</p><br/><p>Consuming the mutated turtlefungi gene reagent.</p><br/><p>Hum—</p><br/><p>A faint light started glowing before forming a bizarre glowing haze formed of spiritual energy around Chen Feng. This was the effect of the turtlefungi gene reagent.</p><br/><p>Reducing spiritual energy requirement of formulas by 50% for 120 seconds.</p><br/><p>The initial requirement of 10,000 points for this formula had now been reduced to 5,000 points.</p><br/><p>Second step.</p><br/><p>Consuming temporary spiritual energy increase reagent.</p><br/><p>After consuming all the of gene reagents that he had linked together with the F-class earthworm’s body gene reagent, his spiritual energy had temporarily increased by onefold, reaching 3,000 points for a duration of 200 seconds.</p><br/><p>Third step.</p><br/><p>Consuming the mutated cuttlefish gene reagent.</p><br/><p>The effectiveness of his spiritual energy had temporarily increased by 80% for a duration of 150 seconds.</p><br/><p>\"Hum—\"</p><br/><p>Before Chen Feng’s eyes, the blood essence that originally appeared ordinary suddenly started glinting.</p><br/><p>Shua!</p><br/><p>Light swirled and Chen Feng entered the digitized mode.</p><br/><p>\"It entered!\"</p><br/><p>Chen Feng was in cloud nine.</p><br/><p>His spiritual energy had met the requirement!</p><br/><p>After using all sorts of support gene reagents, he had finally reached the standard required for the production of C-class formulas!</p><br/><p>However, despite his spiritual energy reaching the standard, he did not dare to slack.</p><br/><p>He knew that he only had 120 seconds.</p><br/><p>If he were to take one extra second…</p><br/><p>He would immediately fail his production!</p><br/><p>\"Let’s begin, then.\"</p><br/><p>Chen Feng shut his eyes.</p><br/><p>Bang!</p><br/><p>Luck Aura fully activated.</p><br/><p>At this moment, all the producers in Star City were looking at this in shock.</p><br/><p>A moment ago, they had still been criticizing Chen Feng for seeking sensationalism. The next moment, Chen Feng had forcefully activated his digitized world and started his gene production.</p><br/><p>\"How is this possible?\" The female producer called Ha Li opened her eyes wide. \"He clearly only had 1,500 points…\"</p><br/><p>\"See.\" Her companion smiled. \"There are ways to do it after all.\"</p><br/><p>\"Turtlefungi, unknown assembly of spiritual energy increasing reagents, cuttlefish…\"</p><br/><p>Some noticed the gene reagents used by Chen Feng. Even so, they still failed to understand how Chen Feng had met the requirement for the formula!</p><br/><p>This was too farfetched!</p><br/><p>To pass the producer certifications, they had long researched all sorts of available methods to make passing easier. Even gene formulas at the higher levels had been researched to look for something that could help someone pass certification.</p><br/><p>However… they had never found a gene reagent that was sufficient to help one overcome the requirement!</p><br/><p>\"Perhaps this is his genetic ability?\" someone said.</p><br/><p>\"Maybe.\"</p><br/><p>The rest nodded.</p><br/><p>If gene reagents were used together with a genetic ability, it would be possible. However, this was merely hitting the lowest requirement for C-class formulas. As for successfully producing it?</p><br/><p>It was nearly impossible, even if the formula used for the test was very weak!</p><br/><p>\"I only succeeded after my master production level reached 3 stars.\"</p><br/><p>\"Same here.\"</p><br/><p>\"Different from you both, I succeeded when my master production level was at 1 star. However, I still used a huge amount of support gene reagents to increase the success rate. For Chen Feng to attempt it in such a manner…\"</p><br/><p>Everyone shook their heads.</p><br/><p>Support gene reagent?</p><br/><p>Everyone was capable of using these.</p><br/><p>However, the higher the amount of such gene reagents used, the bigger the conflicts between different gene reagents would be. As such, the amount of support gene reagents one could use in this situation was essentially limited.</p><br/><p>Hence… they tried as best as they could to fill the limited slots of support gene reagents they could use with gene reagents that could increase production success rates in order to guarantee at least one time of successful production during their master producer’s certification.</p><br/><p>And now, Chen Feng had filled his slots of usable support gene reagents reagents with spiritual energy requirement-reduction gene reagents. Even If he managed to meet the requirement forcefully this way, he would not be able to successfully complete his production.</p><br/><p>Everyone agreed to this fact.</p><br/><p>\"Well, it’s still a good thing for him to have a taste of what it’s like.\" Ha Li patted the peaks on her chest that were worthy of pride as she coldly said, \"The moment he reached Star City, he was so high profile. It’s about time for him to learn the real gap between him and a true master producer. Even if he meets the spiritual energy requirement, a C-class formula is not something that can be produced so easily.\"</p><br/><p>Genius?</p><br/><p>Who in this city wasn’t a genius?</p><br/><p>\"You, girl...\" Her companion merely shook her head as she laughed.</p><br/><p>This companion of hers was similarly someone who had entered headquarters due to her outstanding talent. However, she had failed two master producer certifications in a row recently, so she was somewhat filled with a grudge at the moment.</p><br/><p>However…</p><br/><p>One had to know that, in this world, some people who were naturally capable of creating miracles existed.</p><br/><p>\"Chen Feng…\" she muttered this name. She wanted to see, this newbie here, what height could his miracles reach?</p><br/><p>Shua!</p><br/><p>Data swirled around rapidly.</p><br/><p>Chen Feng started producing quickly with his fully activated Luck Aura.</p><br/><p>The formula data that was unimaginably hard were assembled with a rapid speed. A lot of the data he received was something that Chen Feng couldn’t even understand. However, he merely pointed with his finger randomly…</p><br/><p>And subsequently, he would be successful!</p><br/><p>This was the power of his Luck Aura. As long as the problem was something caused by probability, it was no longer a problem.</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Light swirled without stop around Chen Feng.</p><br/><p>Thirty seconds: First step, gene search completed.</p><br/><p>Eighty seconds: Second step, gene reaction completed.</p><br/><p>One hundred eighten seconds: Third step, gene fusion completed.</p><br/><p>Final step…</p><br/><p>Sealing the produced gene!</p><br/><p>Two seconds left!</p><br/><p>Without hesitation, Chen Feng used his spiritual energy to move the liquid into the prepared bottle.</p><br/><p>Production complete!</p><br/><p>Time consumed: 119 seconds!</p><br/><p>Chen Feng exhaled in relief. \"I did it.\"</p><br/><p>Despite that sealing the produced reagent into the bottle wasn’t classified as a gene production step, Chen Feng was sure that the moment his 120-second duration was over, with his spiritual energy, he would not be able to even seal the bottle up!</p><br/><p>Fortunately, he had managed to complete it in time.</p><br/><p>\"Was I successful?\"</p><br/><p>Chen Feng was overwhelmed by emotions.</p><br/><p>This was the first C-class gene reagent he had produced!</p><br/><p>\"Applying for authentication!\"</p><br/><p>Chen Feng was filled with anticipation.</p><br/><p>Hum—</p><br/><p>The system started scanning.</p><br/><p>\"Ding! Data scan over. Based on the scan results, you have passed the certification.\"</p><br/><p>Hua!</p><br/><p>The whole of Star City was in an uproar.</p><br/><p>Master producer?</p><br/><p>Chen Feng?</p><br/><p>He had successfully passed the certification?</p><br/><p>What joke was this?</p><br/><p>That glorious title had been successfully obtained by this Chen Feng that was still in E class with only 1,500 points of spiritual energy?</p><br/><p>God knows how many producers at 10,000 points and above of spiritual energy were out there still working hard to pass the certification.</p><br/><p>That was the master producer certification!</p><br/><p>That also signified…</p><br/><p>The Peril Rebirth gene armament!</p><br/><p>Bang!</p><br/><p>All the gene producers in Star City were alarmed.</p><br/><p>Even the producers who initially weren’t bothered about this incident were greatly shocked after Chen Feng’s success. That was because Chen Feng had, once again, broken a record—minimum requirement to pass the master producer’s certification!</p><br/><p>\"How is that possible?!\" Ha Li was collapsing. He had passed?</p><br/><p>This guy with merely 1,500 points of spiritual energy had passed?!</p><br/><p>One had to know that she had 11,000 points of spiritual energy! In order to break through to become a master producer, she had prepared for it many times yet still failed!</p><br/><p>How had this happened?</p><br/><p>How was this possible?</p><br/><p>Her companion merely smiled thoughtfully. \"Perhaps it’s time you reduce your gaming hours at night.\"</p><br/><p>At the center of Star City.</p><br/><p>\"This kid…\"</p><br/><p>Hou Liang did not know whether he should laugh or cry. He had originally believed that, since this guy had remained low profile for 10 days, he would stop causing trouble. Unexpectedly, the moment this kid left his room, he once again caused an incident!</p><br/><p>Such a major incident at that!</p><br/><p>Master producer Chen Feng?</p><br/><p>When he thought of this new title, he found it amusing.</p><br/><p>\"That...\" his assistant said suddenly, \"the certification center said that a lot of people are protesting there. They believe that Chen Feng is not qualified to hold the title of a master producer… His rewards…\"</p><br/><p>\"Release the rewards to him.\" Hou Liang sneered. \"Whoever has the guts to reduce the reward, I dare him to try!\"</p><br/><p>\"But…\"</p><br/><p>The assistant was perspiring all over.</p><br/><p>\"Chen Feng has successfully passed the certification based on the set rules. Who dares to deny that? Not only do we need to release his rewards to him. We should even give him the highest of honors!\" Hou Liang smiled as he said, \"It has been way too long since these fellows made their names. They are feeling too complacent nowadays. Only when a stronger genius appears will their will to fight be stimulated. Now… a genius has finally arrived.\"</p><br/><p>On that day itself, amidst the protests, Star City awarded Chen Feng his master producer’s badge. This caused an uproar as the news of this award was intentionally sent to all producers.</p><br/><p>A record had once again been broken!</p><br/><p>Chen Feng became Star City’s…</p><br/><p>No.</p><br/><p>He became the whole world’s youngest master producer... at the young age of 18!</p><br/><p>Translator's Thoughts</p><br/><p>Limostn Limostn</p><br/><p>Patreon link: https://www.patreon.com/limostn</p><br/>\n</div>"}