{"title": "Chapter 199: Perilous Land", "id": 199, "volume": 2, "url": "http://boxnovel.org/the-strongest-gene-chapter-199-perilous-land", "volume_title": "Volume 2", "body": "<h1>Chapter 199: Perilous Land</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 199: Perilous Land</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At the ice cave ruins, the air remained stifling.</p><br/><p>Wang Yao was in the same spot, staring calmly at Lei Hao. The Verbal Compliance Law’s symbol had almost reached her.</p><br/><p>At this instant.</p><br/><p>Pu!</p><br/><p>Blood splattered. The first A-class experts that Wang Yao’s silhouette flashed past, the guy who had used Mount Tai’s Suppression earlier, was currently grasping at his own neck with an unbelieving expression before collapsing loudly.</p><br/><p>Pu!</p><br/><p>The second collapse!</p><br/><p>The third collapse!</p><br/><p>\"This…\"</p><br/><p>The rest widened their eyes in terror. This was a skill they recognized. This was a skill they had seen before!</p><br/><p>Phantom Slash!</p><br/><p>A 6-star secret art!</p><br/><p>It was not an all-rounded ability like Verbal Compliance Law. Rather, it had a more terrifying characteristic. It was a skill capable of ignoring distance and ignoring the number of opponents to lock onto the opponents before killing them.</p><br/><p>It could kill all opponents instantly!</p><br/><p>This was an extremely powerful ability. However, it was a secret art that required the fusion of six space-type genetic abilities for its activation. Wang Yao was obviously someone possessing at least three or four fire-type genetic abilities. How was it possible for her to use this ability?</p><br/><p>How was it possible?</p><br/><p>They widened their eyes, unbelieving.</p><br/><p>Pu!</p><br/><p>Blood splattered.</p><br/><p>Next…</p><br/><p>The fourth collapse!</p><br/><p>Pu!</p><br/><p>Another flash.</p><br/><p>Oddly, with a flash of blue on that person’s body, he merely suffered light injuries instead of collapsing like the others. This was the A-class expert that had yet to make a move. It was very probable for his ability to be defense related.</p><br/><p>Currently, the silhouette appeared by Lei Hao instantly. At this instant, the Phantom Slash’s power was pushed to its limit.</p><br/><p>Bang!</p><br/><p>The silhouette erupted.</p><br/><p>However, at this instant, a huge celestial body appeared around Lei Hao’s body. It assumed the appearance of the Scorpio constellation formed of countless stars, blocking the incoming attack.</p><br/><p>Bang!</p><br/><p>The celestial body crumbled.</p><br/><p>The huge Scorpio turned into countless stars.</p><br/><p>Pu!</p><br/><p>Blood splattered.</p><br/><p>A bloody scar appeared on Lei Hao’s face.</p><br/><p>This…</p><br/><p>Everyone’s hearts throbbed as they looked at the fourth expert.</p><br/><p>Celestial Body’s Shield!</p><br/><p>A 6-star secret art that required at least six types of genetic abilities. Through these abilities, the power of the stars could be directed to construct an absolute shield with astonishingly powerful defense.</p><br/><p>He had blocked it!</p><br/><p>And now, the Verbal Compliance Law reached Wang Yao.</p><br/><p>The blooming flame on Wang Yao’s red skirt vanished instantly.</p><br/><p>From a cursory glance, nothing seemed to have happened to her.</p><br/><p>Now, when everyone looked at the battle, their hearts trembled. This was simply a battle like no other. With five A-class experts against Wang Yao and all sorts of secret arts used, it had ultimately ended with three dead and two injured on the A-class experts’ side.</p><br/><p>And all this only took a single instant to happen, only a single move by Wang Yao.</p><br/><p>Bang!</p><br/><p>Three corpses landed loudly, never to get up again.</p><br/><p>Lei Hao rubbed the wound on his face. The hand he used was painted with blood as it came into contact with his injured face. His expression appeared incredibly solemn. \"You are so much stronger than we had anticipated. What a pity…\"</p><br/><p>The A-class expert that had used the Celestial Body’s Shield earlier was standing beside him.</p><br/><p>In front of them, Wang Yao was still standing there maintaining her calm expression. No hints could be seen from her face as to her current condition. However, a drop of blood dripped down along her right hand before finally landing on the ground.</p><br/><p>She had sustained injuries.</p><br/><p>\"Indeed,\" Wang Yao muttered. \"Did I push it too hard?\"</p><br/><p>She was confronting five A-class genetic warriors, after all. Moreover, as A-class warriors of this mysterious organization, which of them was without formidable strength? Taking on five of them alone was still too forceful after all.</p><br/><p>Although she'd seen this coming, she still felt this way.</p><br/><p>Pity.</p><br/><p>She sighed inwardly. There were still a lot of things she needed to do.</p><br/><p>Currently, Hou Liang’s wristband buzzed. As he took a look, a joyful expression appeared immediately. Those dispatched experts would be arriving soon.</p><br/><p>Soon!</p><br/><p>Five more minutes and they would be here!</p><br/><p>Hou Liang clenched his teeth. Wang Yao… you must keep it up!</p><br/><p>The rest were staring unwavering ahead as well.</p><br/><p>If it was probable, if there was even a tiniest of possibility for them to be of help, they would have proceeded to help. Unfortunately, they were incapable of it. With their strength, even if they were to move forth, they would simply be baggage. This was the saddest part of their current circumstance, for both genetic warriors and gene producers alike.</p><br/><p>Without sufficient strength, they would only end up delivering their life away.</p><br/><p>\"Wang Yao…\"</p><br/><p>Everyone inwardly chanted, You must survive!</p><br/><p>However, would Lei Hao’s group not realize the importance of time?</p><br/><p>\"Those fellows will be here soon right?\" Lei Hao sneered. \"If so, then goodbye, little girl.\"</p><br/><p>Bang!</p><br/><p>Light swirled as he once again made his move.</p><br/><p>This time, though, he was no longer using Verbal Compliance Law. Instead, he was using lone genetic abilities mixed with the occasional 2-star and 3-star secret arts between his attacks. However, these attacks were sufficient for…</p><br/><p>Bang!</p><br/><p>The flaming sword in Wang Yao’s hand shattered.</p><br/><p>Bang!</p><br/><p>Another round of attack.</p><br/><p>Wang Yao started bleeding.</p><br/><p>Blood…</p><br/><p>Dripped without stop.</p><br/><p>\"Hmph.\" Lei Hao sneered. \"The target of the Verbal Compliance Law is not your body. Instead, it’s your spirit and consciousness. I am truly astonished that you can survive that attack—seems like you are much more powerful than we imagined. However… even if you survived by a fluke, so what? Even if the Verbal Compliance Law failed to kill you, it was still able to inflict heavy injuries on you. Now, with your heavily injured spirit and consciousness, how much of your power can you still wield?\"</p><br/><p>\"Bang!\"</p><br/><p>Wang Yao was flung away.</p><br/><p>Pu!</p><br/><p>Her petite body smashed into the ground, leaving a long bloodstain on it. Her whole body was already blood red, seemingly blending with that red skirt of hers.</p><br/><p>She… couldn’t hold on anymore.</p><br/><p>\"Wang Yao!\"</p><br/><p>Everyone clenched their fists, desperation in their eyes.</p><br/><p>Never in their life had they hated their powerlessness more. To actually require a little girl to battle for them, to bear the weight of the world from crumbling down upon them.</p><br/><p>Soon…</p><br/><p>Soon!</p><br/><p>Hou Liang was anxious. He had been paying close attention to the ticking clock and the coordinates of the approaching reinforcements.</p><br/><p>One minute!</p><br/><p>Only one more minute and they would be here!</p><br/><p>You must hang in there!</p><br/><p>\"Wang Yao…\"</p><br/><p>Wang Chun was shaken as well. He had never known how terrifying this quiet cousin of his was. He was also not aware that this eccentric cousin that was constantly denounced by a lot of their elders was in actuality such a person.</p><br/><p>Cousin… you must hang on!</p><br/><p>However, due to the battle being too intense, due to the high amount of experts, in this huge battle, everyone had neglected a single person. A person who they were supposed to be paying attention to, and also a person that had always remained at the center of the battlefield.</p><br/><p>Xia Yan!</p><br/><p>She was still alive!</p><br/><p>\"Hehehehe, ah…\" Xia Yan screamed pitifully.</p><br/><p>She had never imagined that this would be how she ended up. She had finally understood everything. The organization's so-called final chance for her was simply a lie. She was merely bait. A bait sent by the organization to lure Wang Yao out.</p><br/><p>Despite the fact that this final mission had already been confirmed three years ago. Despite the fact that this was the final stage of her dark freak project…</p><br/><p>Xia Yan laughed crazily. \"Hahahaha!\"</p><br/><p>It was fake!</p><br/><p>All fake!</p><br/><p>She had dedicated her whole life to this organization. For research, to become a legend, to obtain the reverence of the masses, she had done everything she could to obtain more resources, regardless of the cost.</p><br/><p>However…</p><br/><p>This was how she was repaid?</p><br/><p>Vaguely, she saw a flashback from back then, when there had been a refined middle-aged man who once looked amiably at her as he asked her if she was willing to be his student.</p><br/><p>\"Teacher, I’m coming…\"</p><br/><p>Xia Yan’s sight blurred.</p><br/><p>Her badly damaged body crawled with difficulty toward Lei Hao.</p><br/><p>Currently, as Lei Hao’s group saw Xia Yan, they merely gave her a cold glance. This woman really believes that we will save her even now? Forget it. I can’t be bothered about her. I can just bring her along after completing this mission if she is lucky enough to crawl to a safe area by herself.</p><br/><p>Lei Hao’s group did not think much of her. This was because all their attention was currently on Wang Yao. Against this young girl with terrifying strength, they did not dare to slack. One’s final attack before death would be the scariest attack of all.</p><br/><p>\"Be careful.\"</p><br/><p>They approached her carefully.</p><br/><p>However, at the same time, as Xia Yan reached their side, she suddenly moved and hugged their feet.</p><br/><p>\"?!!\"</p><br/><p>Lei Hao’s expression changed abruptly. \"What are you doing?!\"</p><br/><p>\"What am I doing? Hahahahaha! Naturally, I am dragging you all down to die together with me! Hahahahaha!\"</p><br/><p>Xia Yan laughed crazily.</p><br/><p>Damnable organization! Damnable A-class warriors! Die!</p><br/><p>Bang!</p><br/><p>A terrifying dark energy bloomed instantly.</p><br/><p>Xia Yan had exploded her own body.</p><br/><p>That heavily damaged body of hers, that body containing a unique energy within it, at even her final moment, was still displaying a stunning might.</p><br/><p>Despite the fact that it was only a power at peak C class.</p><br/><p>Bang!</p><br/><p>Hum—</p><br/><p>The familiar celestial body appeared once again.</p><br/><p>A single defense of this celestial body easily blocked this attack from Xia Yan. A power at such a level, despite its terrifying power, was still not sufficient to damage them.</p><br/><p>\"Crazy woman,\" Lei Hao cursed.</p><br/><p>However, as they once again prepared to resume their attack, they were alarmed to find that Wang Yao had disappeared.</p><br/><p>\"Be careful!\" Lei Hao warned instinctively.</p><br/><p>Hum</p><br/><p>The shining Celestial Body’s Shield appeared once again. They had to defend against the dying Wang Yao’s counter kill of desperation. However, when their spiritual energy covered the whole area, they found with astonishment that Wang Yao was actually only roughly 100 meters from them…</p><br/><p>A youngster that looked like a student was carrying Wang Yao as he ran desperately.</p><br/><p>He was actually planning to flee with Wang Yao?</p><br/><p>\"Run??\"</p><br/><p>Lei Hao laughed at this sight.</p><br/><p>So the students nowadays are ignorant to such an extend? Running? Running from two A-class warriors?! Naive!</p><br/><p>A distance of 100 meters was a distance they could cover instantly.</p><br/><p>Translator's Thoughts</p><br/><p>Limostn Limostn</p><br/><p>Patreon link: https://www.patreon.com/limostn</p><br/>\n</div>"}