{"title": "Chapter 209: You Forced Me", "id": 209, "volume": 3, "url": "http://boxnovel.org/the-strongest-gene-chapter-209-you-forced-me", "volume_title": "Volume 3", "body": "<h1>Chapter 209: You Forced Me</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 209: You Forced Me</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Shadows flickered around while an ice-cold killing intent pervaded the air.</p><br/><p>Xu Fei and the rest were completely suppressed before they could even react. On their body, scars started appearing. Under the fury of attacks, they could only bear with it with great difficulty.</p><br/><p>The battle ended right after it started.</p><br/><p>Xu Fei’s heart trembled. \"It’s you guys.\"</p><br/><p>The Shadowkill Squad.</p><br/><p>Similar to them, this was a squad filled with D-class genetic warriors. However, the members of this squad were very unique. All the members of this squad possessed shadow-related abilities and made a living through robbing. Able to appear and vanish at will, they were incredibly terrifying. Despite the fact that this was a newly established squad, their fame was already far reaching. No one had expected that this squad would actually appear here.</p><br/><p>Things were going to get troublesome.</p><br/><p>Chen Feng muttered inwardly that something bad was going to happen.</p><br/><p>Currently, the captain’s gaze swept through them before finally stopping on Chen Feng’s body. \"Deal with him.\"</p><br/><p>\"Roger.\" Shadow moved.</p><br/><p>There were only four members in the Shadowkill Squad. Hence, every time they made their move, they would first contain the most dangerous ones among their targets in order to better control the flow of the battle.</p><br/><p>Obviously, they had not considered Chen Feng to be a dangerous individual since their concentrated attacks earlier had been focused on Xu Fei and the rest.</p><br/><p>Shua!</p><br/><p>Noiselessly, Shadow arrived. However, when he neared his target and saw that familiar face, his expression changed greatly. \"It’s you?!\"</p><br/><p>Chen Feng was all smiles as he waved his hand. \"Hi.\"</p><br/><p>Retreat!</p><br/><p>Without the slightest hesitation, Shadow retreated furiously.</p><br/><p>One of his companions known as Afterimage looked at him doubtfully. \"What are you afraid of?!\"</p><br/><p>That’s an acquaintance of his?</p><br/><p>Hum—</p><br/><p>Red light started radiating from his eyes.</p><br/><p>That bald guy’s combat power is around 3,000–5,000. That girl there has a combat power of 2,800–4,900…</p><br/><p>For him, the combat power of their opponents did not appear to be anything special.</p><br/><p>This was one of his genetic abilities: Combat Evaluator. With this, he could clearly analyze his enemy’s combat power to obtain an estimation of the upper and lower bounds of his opponent’s combat power.</p><br/><p>As the saying goes, know yourself and know your enemy, and you emerge unscathed from a hundred battles.</p><br/><p>After he fused with this ability, the success rate of their squad had increased by around 50%.</p><br/><p>Failure?</p><br/><p>It was nonexistent.</p><br/><p>Any time they saw someone hard to deal with, they would take a detour.</p><br/><p>As for Chen Feng, his indicated combat power was 1,000.</p><br/><p>It was just as he had initially calculated; this guy was the least threatening guy here. What was up with Shadow?</p><br/><p>Before he could even sort his thoughts, a terror-filled scream from his companions could be heard. As he raised his head, only a torrent of Wind Blades could be seen.</p><br/><p>\"Bang!\"</p><br/><p>Instantly, he was flung away.</p><br/><p>Insta-kill!</p><br/><p>\"Afterimage!\"</p><br/><p>The expression of everyone in the Shadowkill Squad changed greatly.</p><br/><p>\"Good chance.\"</p><br/><p>The eyes of Xu Fei and the rest shone as they instantly threw off the suppression on them.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>They proceeded to counterattack.</p><br/><p>The Shadowkill Squad specialized in ambush and assassinations. Their strongest genetic abilities were also catered toward this aspect. However, as soon as they lost their superiority and were forced to have a head-on confrontation, they were simply not a match for Xu Fei’s squad.</p><br/><p>Umbra, the squad leader clenched his teeth. \"Retreat!\"</p><br/><p>\"Go after them,\" Xu Fei coldly ordered.</p><br/><p>Wanting to escape after ambushing? How could things be so easy?</p><br/><p>Bang!</p><br/><p>They started furiously chasing after the Shadowkill Squad.</p><br/><p>\"You are courting death.\" Shadow’s eyes gleamed coldly as he coldly said, \"The reason we choose to not confront you all head on was to avoid heavy casualties. Do you really believe we can’t defeat you all?!\"</p><br/><p>Xiu!</p><br/><p>Shadow tossed out a gene reagent flickering with a bizarre radiance.</p><br/><p>His eyes were filled with viciousness.</p><br/><p>This was what you forced me to do! Especially you, Chen Feng!</p><br/><p>\"Be careful!\"</p><br/><p>The expression of Xu Fei’s group changed greatly. They could sense that an unusual power was contained within this gene reagent. At such a crucial moment, an item tossed out by Shadow would most definitely not be something ordinary.</p><br/><p>They braced themselves for the attack.</p><br/><p>Light flickered in Umbra’s eyes. \"Shadow Attack!\"</p><br/><p>Shua!</p><br/><p>At this, the tossed gene reagent vanished within the shadows. When it appeared once again, it was already in front of Chen Feng’s group.</p><br/><p>\"Not good.\"</p><br/><p>The hearts of Xu Fei’s group throbbed violently.</p><br/><p>They’re finished!</p><br/><p>If such a terrifying gene reagent were to explode at this distance…</p><br/><p>\"Explode!\"</p><br/><p>Shadow tried activating it with his spiritual energy.</p><br/><p>Hum—</p><br/><p>Accurately, his spiritual energy landed on the gene reagent.</p><br/><p>However, at this very instant, noiselessly, a hand stretched out and grabbed that gene reagent. That flickering radiance in the gene reagent instantly stopped at that moment.</p><br/><p>What was happening?</p><br/><p>Everyone was dumbstruck.</p><br/><p>One could even forcefully stop the explosion of a gene reagent?</p><br/><p>\"How is that possible?\"</p><br/><p>Shadow’s eyes widened as he stared at Chen Feng with an unbelievable expression, \"That is an earthdragon gene reagent with the power of peak D-class expert! How is it possible for you to deactivate it?\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>He looked at the gene reagent in his hand with an odd expression.</p><br/><p>Mhm…</p><br/><p>Earthdragon gene reagent? Why does this sound so familiar? Oh, yeah. This is what I used to trick An Te’s squad back then, right?</p><br/><p>Surprisingly… Shadow actually believed what he'd said back then. Moreover, he had been keeping this item in his collection like some precious item, keeping it all this while until now!</p><br/><p>As he thought of this, Chen Feng looked at Shadow, pity in his eyes. How sad.</p><br/><p>Shadow: \"???\"</p><br/><p>\"Kill!\" Xu Fei ordered decisively. He was already used to the miracles created by Chen Feng. At this moment, he was instead the fastest person to calm down here.</p><br/><p>Shua!</p><br/><p>Once again, they charged forth.</p><br/><p>\"Trash!\" Umbra cursed.</p><br/><p>The so-called trump card that Shadow had bragged about to them for a long time had actually ended up this way?</p><br/><p>What a scam!</p><br/><p>Fortunately… he had his own trump card as well.</p><br/><p>Hu—</p><br/><p>He inhaled as he glanced at Xu Fei with his ice-cold eyes before shutting his eyes.</p><br/><p>\"Myriad Mist Confounding Imprint!\"</p><br/><p>Shua!</p><br/><p>Abruptly, a blanket of mist emerged.</p><br/><p>Umbra and his squad vanished instantly, concealed amid the mist.</p><br/><p>After a short while, when the mist disappeared, not a trace of them remained.</p><br/><p>Xu Fei frowned. \"They escaped?\"</p><br/><p>\"Monkey.\"</p><br/><p>\"Understood.\" Light flickered in Monkey’s eyes. However, he failed to locate them.</p><br/><p>Since the Shadowkill Squad specialized in concealment and assassination, the moment they hid themselves, they were simply impossible to find.</p><br/><p>\"Forget it.\" Xu Fei shook his head. \"No point wasting our time here.\"</p><br/><p>\"All right.\" Monkey stopped searching.</p><br/><p>\"Since we are now aware of their existence, we won’t fall to the same ambush again.\" Xu Fei’s eyes gleamed coldly as he said, \"If they dare try to ambush us again, I will definitely ensure their death!\"</p><br/><p>The Shadowkill Squad specialized in ambushing and assassinations. The moment they were discovered and plotted against, it was very probable they would die without even realizing how they'd died. This was especially true with Chen Feng around.</p><br/><p>\"Thanks.\" Xu Fei expressed his gratitude. He knew that it wouldn’t be wrong to have Chen Feng join them. This guy that had always been good at creating miracles had now become even more terrifying after obtaining first place at the Gene Rookie Competition and joining the Gene Production Association’s headquarters.</p><br/><p>\"No worries.\" A toying smile appeared on Chen Feng’s face. He had never expected that the aurora gene reagent he'd lost back then would actually be recovered.</p><br/><p>\"Let’s go.\"</p><br/><p>Xu Fei decided to choose a different location to lure the timber raccoon leader.</p><br/><p>\"All right.\"</p><br/><p>Chen Feng nodded. In actuality, he would be able to easily determine the position of the Shadowkill Squad and timber raccoon leader. However, since his present luck value was at a measly 20 points, unless it was absolutely necessary, he would definitely not waste his luck values.</p><br/><p>However, surprisingly, when they found a new spot they presumed to be safe and prepared to lure the timber raccoon leader, an odd scream resounded from a distance.</p><br/><p>That aura and voice…</p><br/><p>Xu Fei’s expression changed slightly. \"It’s a timber raccoon leader and the Shadowkill Squad!\"</p><br/><p>\"Damn it!\"</p><br/><p>Their expressions turned unsightly. That damnable Shadowkill Squad decided to spoil their mission now that the Shadowkill Squad had failed their ambush.</p><br/><p>\"Quick!\"</p><br/><p>They rushed over filled with killing intent. However, when they arrived, they were all stupefied.</p><br/><p>There, the Shadowkill Squad could be seen battling the timber raccoon leader.</p><br/><p>However, different from what they had expected, the Shadowkill Squad had lost another one of their members. A timber raccoon that was obviously larger than ordinary timber raccoons could be seen chasing after Umbra and Shadow.</p><br/><p>Their nostrils were assailed by the aroma of cumin paste lingering in the air.</p><br/>\n</div>"}