{"title": "Chapter 235: New Ability", "id": 235, "volume": 3, "url": "http://boxnovel.org/the-strongest-gene-chapter-235-new-ability", "volume_title": "Volume 3", "body": "<h1>Chapter 235: New Ability</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 235: New Ability</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Bang!</p><br/><p>Light swirled around as Long Yue finished absorbing the new genes.</p><br/><p>The power within the \"dragon’s skull\" was absorbed and fused with the blood-red giant dragon. Ultimately, a brand new type of energy was created as the giant dragon’s body started changing without stop.</p><br/><p>Noiselessly, the wings disappeared.</p><br/><p>The enormous body of the giant dragon reduced in size, and its limbs shortened as its body neared the ground. Ultimately, the transformation finished and it became a huge blood-red lizard.</p><br/><p>Evolution?</p><br/><p>Nope.</p><br/><p>This was degeneration.</p><br/><p>Chen Feng: \"…\"</p><br/><p>So he had indeed turned into a lizard?</p><br/><p>Long Yue was horrified. \"No! This is impossible!\"</p><br/><p>They were descendents possessing the bloodline of a dragon. How was it possible for him to transform into something like this? Even if he were to fuse with genes of other species, the power of the genes should not be able to surpass the power of the dragon’s bloodline!</p><br/><p>Chen Feng sighed. \"Erase…\"</p><br/><p>The lizard's Erase ability had erased the power of the so-called dragon’s bloodline. From the moment Long Yue had started absorbing the power within the skull, he had been destined to reach a dead end.</p><br/><p>Chen Feng shook his head. Let’s end it.</p><br/><p>Bang!</p><br/><p>With a terrifying and dazzling silver, Chen Feng smashed Long Yue away with a punch. However, Long Yue’s huge body merely rolled on the ground before standing up without any injuries.</p><br/><p>\"Hahahaha. Even without the genes of a dragon, the genes of this lizard are powerful enough!\"</p><br/><p>Long Yue had a vicious expression on his face. He could clearly feel the formidable power within his body.</p><br/><p>What he felt was the formidable power belonging to the enlarged dissolving lizard. Even without the dragon’s bloodline, it was still powerful. As long as he killed Chen Feng and return to the Long family…</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Long Yue started raging.</p><br/><p>That terrifying body of his charged at Chen Feng.</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Its long tail whipped forth.</p><br/><p>Chen Feng’s silver Energy Equipment actually failed to resist this attack.</p><br/><p>\"Haha. When this power is so formidable, so what if it’s the power of a lizard?\" Long Yue had a vicious expression.</p><br/><p>Bang!</p><br/><p>It moved its body and charged at Chen Feng.</p><br/><p>However, surprisingly, even when he was in an absolute disadvantage, Chen Feng did not appear anxious. He merely stared at Long Yue with sympathy in his eyes.</p><br/><p>Long Yue’s heart throbbed. What’s going on?</p><br/><p>\"Have you forgotten one thing?\" A smile appeared on Chen Feng’s face. \"You have indeed obtained a huge improvement in your strength after absorbing the power of lizard. However, the skull whose power was fully absorbed by you…\"</p><br/><p>Hum—</p><br/><p>That huge skull turned into dust as it dispersed.</p><br/><p>After having all its power absorbed, this skull was no longer able to maintain its form. As it was gone, the most formidable power of this skull, the Erase ability, had disappeared as well.</p><br/><p>Now, everyone here could once again use their energy!</p><br/><p>Not good. Long Yue’s heart throbbed. If they recover their ability to use energy…</p><br/><p>Bang!</p><br/><p>Suddenly, a terrifying pressure started descending.</p><br/><p>The cold voice of Zuo Xiao Rou resounded, \"Unregulated Gravity – Grinder!\" She had been holding her frustrations for so long and could no longer hold it in. Finally, after the restriction on energy usage was removed, she erupted with her strongest ability!</p><br/><p>Bang!</p><br/><p>The huge lizard loudly slammed into the ground, never to stand up again.</p><br/><p>\"We… Long… family…\" Long Yue’s indignant shout stopped mid sentence.</p><br/><p>Bang!</p><br/><p>Zuo Xiao Rou waved her tiny hand.</p><br/><p>Long Yue could not even finish his sentence before his death. His huge pair of eyes were fixed on Chen Feng’s group, unable to believe that he would actually die here.</p><br/><p>It’s over…</p><br/><p>Chen Feng exhaled in relief.</p><br/><p>It had been too difficult!</p><br/><p>Lei Ming!</p><br/><p>Long Yue!</p><br/><p>This Frozen Sea Tundra trip had been much more dangerous than he'd imagined.</p><br/><p>However, amidst the extreme dangers, he'd reaped great profits as well. Qin Hai had been saved and Chen Feng’s Luck Aura was once again upgraded!</p><br/><p>If a level was assigned to it, the Luck Aura should be Level 3 now, right?</p><br/><p>A smile appeared on Chen Feng’s face.</p><br/><p>Shua!</p><br/><p>He checked himself.</p><br/><p>Luck value: 1,000 points.</p><br/><p>As the Spirit Sea wood he'd obtained this time was bigger than the previous Spirit Sea wood, after upgrading his Luck Aura, 1,000 points of luck value were left for him.</p><br/><p>Naturally, this was not the most crucial reward he obtained.</p><br/><p>The most crucial reward was the new functions Luck Aura had gained from the upgrade.</p><br/><p>Shua!</p><br/><p>Chen Feng activated his Luck Aura.</p><br/><p>Hum--</p><br/><p>A layer of an illusory world appeared. This was an illusory world only Chen Feng could see. Similar to the digitized world, it could be classified as a unique and independent spiritual world.</p><br/><p>Yi? Chen Feng was somewhat astonished. Luck Aura has created its own spiritual world as well?</p><br/><p>Shua!</p><br/><p>Chen Feng scanned the newly created world, and immediately, his body shivered.</p><br/><p>In this illusory world, countless bizarre light particles were drifting around, with rays of light swirling around as well. Within this world, the powerful and mysterious power of luck seemed to flow!</p><br/><p>This was a world formed with luck!</p><br/><p>An illusory world!</p><br/><p>The luck number generator that Chen Feng had created using the gene fragments in his digitized world was a function this new world possessed!</p><br/><p>He no longer needed to fret his mind over the usage of his luck number generator!</p><br/><p>Everything would be automated within this illusory world!</p><br/><p>For example: Hou Liang’s coordinates.</p><br/><p>Shua!</p><br/><p>A bizarre power started coursing through this world of luck as the mysterious power contained within this world swirled around before transmitting the accurate coordinate to Chen Feng. That was not the end of it. In the illusory world, the lights that were swirling around actually formed a scene depicting what Hou Liang was currently doing.</p><br/><p>This is…</p><br/><p>Chen Feng’s heart jolted.</p><br/><p>A scene!</p><br/><p>Using light particles, it was indeed possible to depict all sorts of scenes. Theoretically, as long as the light particles were arranged in a specific manner, any scene could be depicted. However, the probability for the light particles to arrange themselves in just the correct manner to display the scene he needed was too low. If he were to force it to happen, the exhaustion of luck value would be too huge.</p><br/><p>At least, this was something he couldn’t accomplish in his digitized world.</p><br/><p>That was simply a joke. How many gene fragments would be required to form a proper scene?</p><br/><p>It was unknown.</p><br/><p>And now, due to the existence of this illusory world, all the light particles and everything else capable of affecting probability had appeared.</p><br/><p>These bizarre light particles had formed this illusory world!</p><br/><p>Here, a scene that was exactly the same as what was happening in reality would be depicted!</p><br/><p>In short, due to the existence of this illusory world, the previous feedback from his Luck Aura, which he could only receive in numeric form, had now been modernized, entering a brand new era!</p><br/><p>This was akin to an upgrade from a Blackberry to an iPhone!</p><br/><p>So… in the future, images will accompany the coordinates when I look for someone?</p><br/><p>Chen Feng was filled with anticipation.</p><br/><p>Within the shown scene, Hou Liang started taking his clothes off…</p><br/><p>Chen Feng’s face darkened.</p><br/><p>Luckily, the scene vanished after only one second. As such, Chen Feng was saved from witnessing that particular scene. Instinctively, he exhaled in relief.</p><br/><p>Luck value exhaustion: 1 point.</p><br/><p>Luck Aura – Lockdown had been upgraded!</p><br/><p>\"If Lockdown has been upgraded, how about Luck Aura – Alarm?\" Chen Feng urged inwardly. All along, the manner in which his Luck Aura – Alarm worked had always been quite violent. It had always been using the destruction of gene fragments as a means of notifying Chen Feng of the impending crisis. This was not the most desirable manner for this ability to work.</p><br/><p>Now, when using this ability with his new illusory world, would more information be shown with these light particles?</p><br/><p>If the enemies were to appear, would their exact position be shown?</p><br/><p>Using red dots to show the number of enemies that had appeared, etc…</p><br/><p>Chen Feng had way too many ideas on ways to use this new illusory world of his.</p><br/><p>\"Let’s try it out.\"</p><br/><p>Shua!</p><br/><p>Light swirled around.</p><br/><p>Once again, Luck Aura was activated.</p><br/><p>Shua!</p><br/><p>The illusory world condensed and an astonishing scene appeared.</p><br/><p>This was a huge circular screen with three dots in the middle of it. The three dots represented Chen Feng, Qin Hai, and Zuo Xiao Rou. Five kilometers away from them, countless red dots were approaching them rapidly.</p><br/><p>It worked! The birth of a new ability! An evolved Luck Aura – Alarm!</p><br/><p>This was similar to the minimaps in the games Chen Feng had played during his previous life. Using such a bizarre manner, a minimap was recreated in this world.</p><br/><p>However, before Chen Feng could even bask in the joyful feeling, he was alarmed by those red dots.</p><br/><p>Enemy attack!</p><br/><p>Those numerous red dots were all enemies!</p><br/>\n</div>"}