{"title": "Chapter 255: Charge!", "id": 255, "volume": 3, "url": "http://boxnovel.org/the-strongest-gene-chapter-255-charge", "volume_title": "Volume 3", "body": "<h1>Chapter 255: Charge!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 255: Charge!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Within the training room, Chen Feng was summarizing his recent improvements. Based on current available data, 100 mission points could be used to get an hour of the D-class training room's usage. During this hour, 50 points of spiritual energy could be increased. Evidently, this was quite a powerful room. Moreover, there was zero danger when using this room. More importantly, it could also help stabilize and improve the control of one's newly gained power. As such, training here would help one control their spiritual energy better as well.</p><br/><p>Under normal circumstances, a genetic warrior that had just passed the D-class certification would receive 1,000 mission points. If all of them were used to increase one's spiritual energy, one would be able to increase 500 points of spiritual energy in a single day.</p><br/><p>\"Fifty points per hour.\"</p><br/><p>Chen Feng calculated silently. With 50 points per hour and 24 hours per day, he would be able to obtain 1,200 points per day. This terrifying method of improvement was simply much faster than gene strengthening through hunting timber raccoons.</p><br/><p>Naturally, the price one paid for this was extremely high as well. Due to the high amount of contribution points required, every time one wished to improve oneself, a huge amount of mission points would be required. If Chen Feng hadn't passed the B-class certification, he would not dare to do this.</p><br/><p>As for now?</p><br/><p>Hehe.</p><br/><p>Chen Feng walked into the training room. Under the dumbfounded gaze of the employee there, he casually spent 8,000 mission points to book the room for 80 hours.</p><br/><p>\"Let's begin, then.\"</p><br/><p>Thus Chen Feng entered a temporary seclusion.</p><br/><p>The spirit training room was a specially produced sealed space. When Chen Feng walked into the room, he had a feeling that this was an independent world constructed by a super expert. Different from the Crescent Moon Spring produced by the Gene Production Association, the method of improvement here was more similar to the Life and Death Domain he'd encountered back then, which was more violent in nature.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Clumps of illusions formed of spiritual energy appeared.</p><br/><p>These illusions needed to be killed to render the spiritual energy that formed their bodies masterless and available for absorption.</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Chen Feng started his killing spree.</p><br/><p>Steadily, his spiritual energy started increasing.</p><br/><p>Five days later, Chen Feng ended his seclusion without any hiccups. As of now, his spiritual energy had reached 10,000 points. He was now a peak D-class genetic warrior.</p><br/><p>The only regret he had was his failure to obtain the final point required to push him into C-class no matter how much he'd tried. Even C-class spirit training room wouldn't work.</p><br/><p>These rooms were only suitable for a stable increase in spiritual energy, rather than breaking through.</p><br/><p>Chen Feng felt regretful. \"Indeed, it doesn't work.\"</p><br/><p>He had spent 2,000 mission points to try the C-class spirit training room. Added up with the previous mission points he'd used, he had now used 10,000 mission points and had around 100,000 mission points remaining.</p><br/><p>Secret arts were something he did not require for now. A secret art in the traditional sense was simply something not suited for him. Therefore, his next target would be to break through his limit mode.</p><br/><p>If there were training rooms suited for stable increase of attributes here at the Genetic Union, naturally, there were also unique methods dedicated for breakthrough available here.</p><br/><p>\"You want to exchange your points for a breakthrough plan? Kindly wait a moment.\"</p><br/><p>Soon, the employee passed Chen Feng a series of breakthrough plans.</p><br/><p>----</p><br/><p>1. Name: Extreme land's breakthrough. At a faraway extreme land, a mystical plant exists. It is capable of helping one break through the D-class limit. Breakthrough probability: 0.01%. Difficulty: 1 star. Mission points required: 0 points. Number of participants: unlimited</p><br/><p>2. Name: … Breakthrough probability: 1%. Difficulty: 1 star. Mission points required: 100 points.</p><br/><p>3. Name: … Breakthrough probability: 1.1%. Difficulty: 1 star. Mission points required: 100 points.</p><br/><p>…</p><br/><p>208. Name: … Breakthrough probability: 30%. Difficulty: 4 stars. Mission points required: 10,000 points.</p><br/><p>216. Name: … Breakthrough probability: 35%. Difficulty: 3 stars. Mission points required: 20,000 points.</p><br/><p>…</p><br/><p>----</p><br/><p>This was an extremely long list. Apart from the first mission, which had an extremely low probability of breakthrough and was something that would be on the list permanently and was free, the other missions required mission points for one to qualify for them.</p><br/><p>Chen Feng started studying the list. Based on the change in the difficulty and probability, the amount of mission points required changed as well.</p><br/><p>As the Gene Production Association was focused on production, one could only exchange for formulas or methods of increasing production level using contribution points. As for the Genetic Union, everything one could exchange for was only related to an increase in combat power.</p><br/><p>There were so many D-class limit breakthrough missions alone that they were uncountable.</p><br/><p>On the list, it could be seen that a lot of missions was darkening without stop. At the same time, a lot of new missions appeared without stop as well. The amount of limit breakthrough missions here were indeed high; however, the amount of genetic warriors looking for breakthrough was even higher! On top of that, if they failed to breakthrough after completing a mission, they would take on a new mission. As such, the amount of available missions would never be sufficient to satisfy their needs.</p><br/><p>Naturally, the breakthrough probability in this list was an additional probability of breakthrough for those who had chosen these missions. For some people, even without these missions, they were still able to break through by participating in extreme training or extreme battles. In fact, the amount of people who had broken through with such methods were quite high in amount.</p><br/><p>\"Which should I choose?\"</p><br/><p>Chen Feng's eyes swirled around before halting at a particular set of data.</p><br/><p>----</p><br/><p>233. Name: ...father died accidentally …unique gene reagent …able to help one breakthrough the limit of D class… I need to take my father's remains back to our hometown. The gene reagent will be given to you… Breakthrough probability: 100%. Difficulty: 5 stars. Mission points required: 50,000 points!</p><br/><p>----</p><br/><p>Shua!</p><br/><p>Chen Feng's eyes shone.</p><br/><p>100%! Gene reagent! These were what attracted him.</p><br/><p>He did not care about the 50,000 mission points he needed to pay for this. If he were able to obtain this gene reagent, perhaps he might even get the formula to produce this gene reagent! Even if he couldn't get the formula, after getting the gene reagent itself, he would be able to deduce the formula or look for replacement materials required to produce this gene reagent using his Luck Aura.</p><br/><p>If so, he might be able to produce D-class breakthrough gene reagent in the future?</p><br/><p>\"It has been quite a while since I restocked the shelves of The Strongest Gene…\"</p><br/><p>Chen Feng's emotions surged.</p><br/><p>After he studied the list, he found that this was the most suitable mission for him. The required contribution points were extremely huge and scam-like, though.</p><br/><p>Chen Feng still had his doubts. \"For such missions… do I need to participate myself?\"</p><br/><p>\"No.\" The employee shook his head. \"The only thing you need to do is pay the mission points. As for the mission goal or progress, someone else will do it for you. The only reason some of these missions require the payer to go along on the mission is due to the harsh requirements for limit breakthrough. so as to avoid anything unexpected from happening.\"</p><br/><p>\"In other words… if there's no other unique conditions specified, I can even wait here for the gene reagent to be send to me?\" Chen Feng asked.</p><br/><p>\"Naturally.\" The employee nodded. \"If it was a breakthrough gene reagent, it is naturally possible for you to pay 50,000 as a payment to buy this gene reagent. Let me check the details for this mission. Mhm… gene reagent…\" Soon, he shook his head. \"I'm afraid it's not possible for this particular gene reagent. Based on the descriptions, this set of gene reagents is something that can only be produced successfully at that place, due to the unique environment there. Moreover, it can't even be moved into a bottle. The gene reagent might be produced successfully, but it is immovable. One can only use the reagent on the spot.\"</p><br/><p>So that was the case. Now Chen Feng understood.</p><br/><p>Had that producer gone to that place just to produce this gene reagent? Toward such a person who had researched his very own gene reagent and even sacrificed himself for it, Chen Feng could not help but have a sense of respect.</p><br/><p>\"I will exchange my points for this mission, then,\" Chen Feng stated.</p><br/><p>\"Are you sure?\" The employee paused before continuing, \"This mission has been issued for half a year. Due to the high amount of mission points required and the high difficulty of 5 stars, nobody has ever bothered to exchange their points for this.\"</p><br/><p>Chen Feng nodded. \"I'm sure.\"</p><br/><p>For others, this might not have been worth their contribution points. Using the same amount of mission points, they could exchange it for several missions with 30% breakthrough probability. That would be sufficient for their breakthrough. As such, this mission was simply not worth it for them.</p><br/><p>However, for Chen Feng, this mission was worth the mission points. This was akin to a brand new formula for him…</p><br/><p>If he tried to create a new formula out of thin air, his luck value wouldn't even budge, as it was simply impossible to accomplish. However, if he obtained that gene reagent as a source of reference, it would be much simpler.</p><br/><p>Shua!</p><br/><p>Chen Feng confirmed his acceptance of the mission. Time set: half a month later.</p><br/><p>\"When the time comes, someone will be contacting you,\" the employee told Chen Feng.</p><br/><p>Chen Feng nodded. \"Understood.\"</p><br/><p>So, this time, he will be going on this mission as a boss?</p><br/><p>Mhm…</p><br/><p>In other words, if everything were to proceed smoothly, he only needed to watch on as the others completed the mission for him. He only needed to tag along and wait for the gene reagent.</p><br/><p>Chen Feng laughed. \"It's truly unexpected that I will one day receive such treatment as well.\"</p><br/><p>Being the boss of a mission, this was a treatment he had never enjoyed before.</p><br/><p>\"I'm truly looking forward to it.\"</p><br/><p>Chen Feng was engrossed in his thoughts.</p><br/><p>Naturally, even if he was about to become a boss, he would still focus on improving himself. Based on his experience, during such an outdoor mission, some unexpected incidents would definitely happen. Granted, the mission points would be refunded if the mission failed, but what was the point of having all the points if he were to perish during the mission?</p><br/><p>\"If you need it, we have a huge amount of temporary strength-increasing gene reagents here,\" the employee proposed.</p><br/><p>Chen Feng's eyes shone. \"Oh?\"</p><br/><p>However, as he studied the list, he was left disappointed. These were all items sent over here from the Gene Production Association. The price was indeed cheap, but the strength of these reagents were quite ordinary as well, as far as Chen Feng was concerned.</p><br/><p>\"I can take this chance to make a trip back there, then.\"</p><br/><p>Chen Feng thought about it as he recalled that Hou Liang had previously told him that the Gene Production Association had a separate reward for him for the mission completion.</p><br/><p>He put his thoughts into action immediately. The next day, he returned to the Gene Production Association. Surprising him, though, the moment he returned and reached the entrance, a huge amount of producers could be seen protesting against him.</p><br/><p>What's going on?</p><br/><p>Chen Feng was somewhat stupefied.</p><br/>\n</div>"}