{"title": "Chapter 259: The Historic Pit!", "id": 259, "volume": 3, "url": "http://boxnovel.org/the-strongest-gene-chapter-259-the-historic-pit", "volume_title": "Volume 3", "body": "<h1>Chapter 259: The Historic Pit!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 259: The Historic Pit!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Research paper: The Annual Trickiest Problems' Optimal Solution Guidebook: First Edition .</p><br/><p>Original price: 588 contribution points</p><br/><p>Method of sale: Per problem.</p><br/><p>As a huge amount of calculation formulas and data were required for each of the problems, Chen Feng had ultimately decided that the solution for each problem would be sold separately.</p><br/><p>Each problem would be rated based on difficulty.</p><br/><p>Among these, the lowest difficulty was rated R, with a total of 60 problems at this difficulty. The somewhat harder difficulty was rated SR, with a total of 30 problems at this difficulty. The hardest difficulty was rated SSR, with a total of 10 problems at this difficulty.</p><br/><p>Method of sale for the solutions was quite simple. One point of contribution point to purchase a single \"loot box.\" From this loot box, one could obtain the solution for a single random problem. It was possible for one to obtain the solution of an R-tier, SR-tier, or even SSR-tier problem!</p><br/><p>Hence, was this price cheap? Of course it was cheap!</p><br/><p>See, the original price was 588 contribution points!</p><br/><p>Every single one of these problems was extremely difficult. Chen Feng had definitely exhausted a huge amount of resources to solve them. Even if it was sold for 588 contribution points, it would be worth it! Moreover, these 588 contribution points was merely the original price. Presently, only one contribution point was required, and one could obtain a single solution! Wasn't that totally worth it?</p><br/><p>A lot of people prepared up to 100 contribution points just to try their luck at this loot box.</p><br/><p>Someone tried buying one of the loot boxes. \"Let me try.\"</p><br/><p>Shua!</p><br/><p>\"Congratulations, you have obtained the solution for a SR-class problem. The description as follows…\"</p><br/><p>\"Hahaha, I got a high-difficulty solution with a single try.\"</p><br/><p>That person was extremely excited.</p><br/><p>As a result, the curiosity of others was piqued, and they started purchasing as well.</p><br/><p>Everyone started discussing this without stop.</p><br/><p>From their first purchase onward, the buyers' emotions were already stirred. Only a single contribution point was required for them to obtain such a rare solution to a difficult problem.</p><br/><p>It simply gave one an unending feeling of happiness. One had to know that the lowest price for a single solution listed in the research institute would be around 10 contribution points. Even the most idiotic of problems would be sold at such a price.</p><br/><p>One loot box!</p><br/><p>Two loot boxes!</p><br/><p>Three loot boxes!</p><br/><p>…</p><br/><p>Some purchased ten loot boxes in a row, feeling extremely refreshed in the process. Moreover, some of them even started berating Lan Jingling.</p><br/><p>\"Sigh, the previous solution of Senior Lan's was sold at 30 contribution points! True, it solved the problem, but…\"</p><br/><p>When there was nothing for the masses to compare with, nothing seemed wrong. But now, after Chen Feng's one contribution point per solution appeared, Lan Jingling appeared extremely dishonest to the masses!</p><br/><p>\"Perhaps this is Chen Feng's strategy?\"</p><br/><p>\"Although he won't be able to get the excellence award, he will obtain the public support?\"</p><br/><p>\"Mhm…\"</p><br/><p>\"Look at the cheap price he's selling at? How can he hope to compete with Lan Jingling? Forget it, I will buy a few more of his loot boxes as a show of support to Chen Feng. It's quite cheap anyway.\"</p><br/><p>\"I'm going to buy more as well. The problem I need a solution for seems to be SSR-tier anyway.\"</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Countless people started spending their contribution points.</p><br/><p>At Star City, at the Gene Production Association's branches worldwide, all the producers were buying loot boxes crazily. Evidently, they had yet to discover the problem with this method of sale…</p><br/><p>Currently, at Star City, an excited Ha Li was staring at Chen Feng.</p><br/><p>\"Chen Feng?\"</p><br/><p>\"Haha, Lady Ha Li.\" Chen Feng stared helplessly at that swaying pair of huge peaks on her chest. He wondered if this young lady ever felt any pressure when she ran.</p><br/><p>\"I bought your loot box.\" Ha Li was excited. \"Hehe, a lot of people are praising you, saying you are a kind and adorable person. Although you failed to obtain the excellence award, you have obtained everyone's recognition!\"</p><br/><p>\"Yi? You are going somewhere?\" Ha Li asked as she noticed that Chen Feng was leaving.</p><br/><p>Chen Feng coughed. \"Mhm, I'm afraid that I will be beaten up… oh, no, no, I have some matters to attend to.\"</p><br/><p>\"Oh oh, then I won't waste any of your time. Work hard!\" Ha Li encouraged Chen Feng.</p><br/><p>\"Mhm.\" Chen Feng fled hastily.</p><br/><p>However, just as he reached the entrance, he saw another person: Lan Xing!</p><br/><p>\"It's this guy!\" Chen Feng's heart leaped. However, he recalled that this was Star City the next moment. At that, all the fear in his heart vanished. He frowned and asked, \"Why are you here?\"</p><br/><p>Surprising him, Lan Xing took the initiative to walk over and express goodwill to him.</p><br/><p>Lan Xing scratched his head in an honest manner. \"Erm… previously, I wronged you.\"</p><br/><p>Chen Feng was surprised. \"Oh?\"</p><br/><p>\"Everyone is saying that you are a kind person.\" Lan Xing continued after thinking for a bit, \"I believe that I had truly misunderstood you previously. My sister told me that the excellence award is extremely important, as the recipient would also receive some substantial power along with the award. The recipient will be able to join the management of the Gene Production Association. As such, you would definitely not give up on this award. However, I think that my sister was wrong about you!\" Lan Xing righteously said, \"After your research paper was released, I overheard a lot of people praising you, saying how my sister was too selfish for selling her papers at such high prices. I think my sister might have been enticed by the temptation of riches…\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>\"I hope you can give my sister some advice,\" Lan Xing said solemnly. \"The excellence award is not truly important. What's important is being a kind person.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>He stared at Lan Xing like he was looking at an idiot.</p><br/><p>After a long time, he patted Lan Xing's shoulder as he sighed, \"Brother, I truly misunderstood you previously.\"</p><br/><p>Did such a kind person still exist in this world? No! How could he think that this Lan Xing guy was an idiot? This guy was simply a person with a justice-filled heart, an emissary of justice that could not bear the existence of anything immoral!</p><br/><p>Chen Feng looked at the two slap marks on his face. \"You quarreled with your sister?\"</p><br/><p>\"Mhm.\" Lan Xing sighed. \"She said that I'm helping an outsider instead of her.\"</p><br/><p>\"…All right, I have something to do, so I have to leave for now. I will definitely advise your sister when I return,\" Chen Feng promised solemnly.</p><br/><p>\"All right.\" Lan Xing nodded. \"I believe you.\"</p><br/><p>\"Work hard.\" Chen Feng patted his shoulder. \"Your sister is only fighting for the excellence award for your family's future anyway, despite her somewhat extreme methods…\"</p><br/><p>\"The word extreme is not even sufficient to describe her methods.\" Lan Xing was agitated. \"I have always failed to understand what the big deal about the research papers of your Gene Production Association is. Only after today did I witness with my own eyes how you only sell yours for one contribution point while my sister is selling hers at 30 contribution points! No wonder so many people are calling my sister a scammer! If father and mother were still alive, they would definitely reprimand her for this!\"</p><br/><p>\"That's why she needs you at her side.\" Chen Feng gave a gratified expression and continued, \"Your sister might be powerful, but she still needs you to guide her morality!\"</p><br/><p>\"I know,\" Lan Xing said solemnly.</p><br/><p>Soon, they bid each other farewell. Chen Feng left the city while Lan Xing returned home with his newfound mission.</p><br/><p>One hour later.</p><br/><p>Clang!</p><br/><p>The door of Chen Feng's house was kicked open.</p><br/><p>The furious Hou Liang stared at the empty room. That Chen Feng kid had actually fled!</p><br/><p>\"That bastard!\"</p><br/><p>Hou Liang was raging. The people that praised Chen Feng today might be high in amount. However, this was merely the first day where repeated drops from the loot boxes were still quite low in amount.</p><br/><p>Hou Liang had seen himself the data for this method of sale Chen Feng had devised.</p><br/><p>The probability rate for one to obtain the solution for an SSR-class problem was only 1%! Moreover, there were a total of 10 SSR-tier problems! If one wanted the solution for a specific SSR-tier problem… with that probability, one might need at least 1,000 contribution points to obtain it. Based on the buyer's luck, the amount of contribution points required could very well be much higher or lower as well. If one wanted to collect the solutions for all the SSR-class problems… the mere thought of that caused Hou Liang to shiver.</p><br/><p>He was sure that if Chen Feng had not escaped, he would most probably end up beaten to death by the angry masses right here. As of now, along with the sales of the loot boxes, the producers that had been praising Chen Feng all this while were finally feeling that something was wrong. Why were their contribution points dropping so fast?</p><br/>\n</div>"}