{"title": "Chapter 267: Alarming Change: Wu Hui’s Ability!", "id": 267, "volume": 3, "url": "http://boxnovel.org/the-strongest-gene-chapter-267-alarming-change-wu-hui%E2%80%99s-ability", "volume_title": "Volume 3", "body": "<h1>Chapter 267: Alarming Change: Wu Hui’s Ability!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 267: Alarming Change: Wu Hui’s Ability!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Winner takes all. The death of Wu Yaotian sealed the Wu family's fate of decline. Hence, Wu Neng had long ago prepared a backup plan for himself, which consisted of the 50,000 mission points from this mission and the extra benefit he would obtain from the extra deal he'd made.</p><br/><p>With an amazed expression, that person stared at that drop of blue liquid that was hovering in midair. \"This is the gene reagent you proclaimed to possess a 100% success rate when breaking through?\"</p><br/><p>\"Yes! The boulder formation had already been destroyed. The effect of this thing here will definitely be satisfactory to you,\" Wu Neng replied with a smile.</p><br/><p>\"You…\" Finally, Wu Hui understood what was going on. This bastard Wu Neng had actually sold this gene reagent two times. Once to Chen Feng for 50,000 mission points and once to another person in the dark.</p><br/><p>Wu Hui glared at him. \"Doing this, you will be arrested by the Genetic Union.\"</p><br/><p>\"I'm aware of that.\" Wu Neng appeared calm. \"However, the only update they will receive is everyone in this mission perishing, me included. Next, I will change my identity to start a new life.\"</p><br/><p>Wu Hui was furious.\"You are shameless!\"</p><br/><p>How did this happen…</p><br/><p>He had previously believed that Wu Neng was already quite excessive for refusing to help collect his father's remains before receiving the payment of 50,000 mission points. Unexpectedly, he was brave enough to do this.</p><br/><p>Wu Neng laughed. \"Child, this is how the real world works. Your father put great efforts toward you, giving you your current achievement of being at D class, soon to be C class, at this young age, surpassing countless people. However, what was the point of all his effort?</p><br/><p>\"Despite your class, you possess zero genetic abilities and zero combat power. To be honest, if you were a person of astonishing talent, not only would I not act against you, I would assist you in becoming the strongest expert of the Wu family after your father perished. However, it is truly unfortunate that you are not even qualified to receive my service. You are simply too weak. Hence, sorry, child. I have to teach you how society works before you have even grown up.\"</p><br/><p>Wu Neng continued his cruel words, \"Honestly, the moment he decided to nurture you, I already knew that there would be a day where the Wu family was finished. Hence, I prepared a backup plan for myself long ago. Nurturing trash is simply the fastest way for a family to decline.\"</p><br/><p>Every single word of Wu Neng's pierced straight to Wu Hui's heart. His heart was bleeding. His hands were bleeding as well from his clenched fists.</p><br/><p>Wu Neng's cold voice resounded, \"Remember, the killer of your father is none other than you! Now you can enter the land of the death to apologize to your father!\"</p><br/><p>Bang!</p><br/><p>A terrifying radiance bloomed.</p><br/><p>However, at this instant, a loud noise could be heard.</p><br/><p>Bang!</p><br/><p>A huge clump of energy armor appeared and blocked Wu Neng's attack.</p><br/><p>\"Chen Feng!!\" With a single glance, Wu Neng realized who it was. \"You are courting death!\"</p><br/><p>Shua!</p><br/><p>Light swirled.</p><br/><p>A terrifying B-class secret art attack was sent forth to Chen Feng.</p><br/><p>\"Hmph.\" As a response, Chen Feng merely snorted and ignored the incoming attack. His energy armor that was soaring upward instantly disassembled before reassembling into something resembling a high-speed missile warhead before smashing toward Wu Neng.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>The area of impact exploded with a bright radiance. At that instant, a terrifying amount of energy erupted, knocking everyone out of the immediate vicinity of the area of impact, B-class warriors included!</p><br/><p>Chen Feng's sudden eruption was truly too astonishing. None of them had imagined that a mere D class, a producer that was here as a \"boss,\" would be so terrifyingly powerful.</p><br/><p>Soon, everyone crawled up with soot all over their faces. The initial intact formation of the squad members was now completely messed up.</p><br/><p>As for the weaker members of the squad, those at peak C class and below had all been killed in the explosion. Chen Feng's energy equipment possessed a strength surpassing their imaginations when it separated from his body.</p><br/><p>Wu Neng's eyes gleamed coldly. \"Chen Feng!!!\"</p><br/><p>As he turned around, he noticed that the drop of blue liquid had now disappeared.</p><br/><p>\"He is that rookie tournament champion?\" That genetic warrior sneered. \"Initially, I had zero interest in him. However, since he dared to take this thing from me, he is truly seeking death.\"</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Rows of silhouettes appeared. From the darkness, a higher amount of B-class warriors appeared. These were all his subordinates.</p><br/><p>\"Prepare,\" Wu Neng ordered as his gaze swirled around before landing on spot beneath the destroyed boulder formation. Underneath the ruins, a tunnel seemed to exist. It was probably something Wu Yaotian had dug back then.</p><br/><p>\"They are hiding in there! Go! Block all the exits. No one is allowed to leave. Anyone you find in there, kill without question.\"</p><br/><p>\"Understood.\"</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Multiple silhouettes flashed forth and entered the tunnel. All of them were B-class genetic warriors. These newly appeared enemies were much more terrifying than Chen Feng had imagined.</p><br/><p>\"This underground area doesn't seem to be too big,\" Wu Neng said coldly. \"They won't be able to flee too far away from us.\"</p><br/><p>\"Hopefully so.\" That genetic warrior sneered, \"If he escapes successfully, it will be considered your mistake. After all, you have yet to deliver the item to me. Hehehe, at that time, you will…\"</p><br/><p>Wu Neng's lips twitched.</p><br/><p>He was too clear on the type of people he was working with. This was a mission he had to complete!</p><br/><p>\"Don't worry.\"</p><br/><p>He inhaled deeply before joining the group of people chasing after Chen Feng and Wu Hui. He wanted to see with his own eyes how great a mere D-class gene producer would be!</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Silhouettes streaked forth without stop.</p><br/><p>Currently, within the underground tunnel, Chen Feng was escaping with a skinny kid by his side. His back chilled, signifying how terrifying those people chasing after him were. All of them were B class!</p><br/><p>It might be possible for him to deal with one of them, but several dozen of them? That was impossible. Hence, he could only escape.</p><br/><p>The moment that genetic warrior appeared, Chen Feng had been having an ominous feeling. If Wu Neng was truly going to betray them, he would definitely eliminate any potential witness. Hence, the only thing he could do was escape. As for Wu Hui, he had merely made a random decision to just bring the kid along while he escaped.</p><br/><p>This kid was already quite pitiful. If possible, he would not mind taking him along together while he escaped. Naturally, this was on the premise that his own safety would not be compromised while bringing this kid along.</p><br/><p>Whoosh!</p><br/><p>Whoosh!</p><br/><p>Whoosh!</p><br/><p>Chen Feng streaked forth with Wu Hui through the tunnel. He was looking for an opportunity to charge out of here. However, almost all possible exits were blockaded. As of now, he could only hide himself with Wu Hui in these tunnels.</p><br/><p>However, it wouldn't be long before they no longer had anywhere to go.</p><br/><p>\"This can't continue.\" Chen Feng inhaled deeply. Seems like I need to counter attack. He looked at Wu Hui. He was, after all, still someone at the peak of D class. Theoretically, Wu Hui was at the same level as Chen Feng. Regardless of how weak his combat power was, he should still possess some sort of combat power right? \"Wu Hui. What genetic abilities do you have?\"</p><br/><p>Wu Hui lowered his head in shame. \"I don't have any.\"</p><br/><p>\"None???\" Chen Feng was dumbstruck. \"Not a single one?\"</p><br/><p>Wu Hui lowered his head timidly. \"Mhm.\"</p><br/><p>That thin body of his appeared even more frail now.</p><br/><p>How is this possible…</p><br/><p>Chen Feng's head ached. If it wasn't for the fact that Wu Hui might possess some clues regarding the formula for that gene reagent, he would probably be considering leaving him behind and escaping by himself.</p><br/><p>\"I… have zero combat power,\" Wu Hui said sadly. \"They… all say that I am trash… I do possess a genetic ability, but I do not know what ability I have. No amount of research could find out my genetic ability. Even after the tests performed by the research institute on my body, they still failed to determine my ability…\" Wu Hui's expression dimmed.</p><br/><p>His father was a master producer and had explored all possibilities. However, it had not worked.</p><br/><p>He seemed to have been suppressed by his mother's bloodline coursing in his veins, causing him to not possess any genetic abilities. To be accurate, the bloodline inherited by his mother was too powerful. As such, all other genes were suppressed, causing all sorts of gene fusions to fail. This was the reason why he had not fused with any fusion gene reagents until now. All the fusions would simply fail.</p><br/><p>Chen Feng frowned. He refused to believe that an ability that could not be determined existed. \"Try demonstrating it to me.\"</p><br/><p>\"Mhm,\" Wu Hui replied.</p><br/><p>Hum—</p><br/><p>A faint glimmer appeared in his hands as a translucent undulation appeared. Next, it disappeared.</p><br/><p>???</p><br/><p>Chen Feng was somewhat stupefied. \"That's it?\"</p><br/><p>Wu Hui head was even lower now. \"That's it.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>What damnable ability is this?</p><br/><p>He was certain that the people from the research institute had definitely tried having Wu Hui using his ability on various objects. Only after countless attempts with no results would it be determined that he was trash.</p><br/><p>Chen Feng couldn't help but to ask, \"It has zero usage?\"</p><br/><p>With a low voice, Wu Hui replied, \"Mhm. The research institute tried it on over 3,000 objects and mutated beasts. No effects.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>Fine, since Wu Hui had zero combat power, Chen Feng decided that he could only depend on himself. He checked his luck value. At that, his heart ached. For the formula, he would have to give it his all.</p><br/><p>Currently, in Wu Hui's hands, a faint undulation that seemingly existed yet did not exist seemed to flicker without stop. He was aware of his zero combat power. As such, he was using his spiritual energy to keep trying in the hope of discovering some usage for his ability.</p><br/><p>Even if he had never succeeded so far, he had never given up.</p><br/><p>\"Do you think a club will jump out from those attempts?\" Chen Feng petulantly said before continuing, \"Come, let's go.\"</p><br/><p>He held onto Wu Hui and prepared to leave. However, right at this instant, the faint undulation in Wu Hui's hands actually condensed before taking the form of a club!</p><br/><p>???</p><br/><p>Wu Hui's mouth was left hanging.</p><br/><p>This…</p><br/><p>Chen Feng's pupils shrunk.</p><br/><p>Cl-club? How is this possible? How did Wu Hui create a club? Wait, could it be…</p><br/><p>Chen Feng seemed to have thought of something as his emotions stirred. He stared at Wu Hui with an inconceivable expression. If his guess was correct, it was very probable that this kid possessed an extremely powerful ability.</p><br/>\n</div>"}