{"title": "Chapter 274: What Does Color Signify?", "id": 274, "volume": 3, "url": "http://boxnovel.org/the-strongest-gene-chapter-274-what-does-color-signify", "volume_title": "Volume 3", "body": "<h1>Chapter 274: What Does Color Signify?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 274: What Does Color Signify?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>A huge palace was currently at the place where the boulder formation had originally been. Chen Feng and a group of people were currently in the vicinity, discussing their tactics for entering the palace.</p><br/><p>Based on their guesses, the clue to how they could leave this place might very well lie in this palace.</p><br/><p>\"We can quietly get rid of the patrols out there,\" the middle-aged man proposed.</p><br/><p>He was an A-class genetic warrior. As for these patrols, they were mere B-class warriors. Regardless of their amount, they were not his opponent. As long as the others could exercise control and prevent the shockwave from the battle from leaking beyond their immediate vicinity, he would be able to do it.</p><br/><p>\"It will be too much of a waste of your energy if you move alone. Perhaps we can all do it together,\" someone said.</p><br/><p>\"I think we should simply ignore the patrols and sneak into the palace,\" someone suggested.</p><br/><p>They were all discussing the various possibilities.</p><br/><p>Chen Feng's gaze landed on the patrols. What joke was that? If he only needed to sneak in or assassinate those patrols, what was the point of him seeking their help?</p><br/><p>Shua!</p><br/><p>Chen Feng's eyes gleamed coldly.</p><br/><p>Hum—</p><br/><p>Instantly, his Energy Equipment was assembled.</p><br/><p>The middle-aged man's expression changed greatly. \"What are you doing?\"</p><br/><p>Is this guy going crazy?</p><br/><p>Chen Feng sneered. \"What else can I do?\"</p><br/><p>Bang!</p><br/><p>With a single punch, a terrifying power erupted.</p><br/><p>Pu!</p><br/><p>A group of B-class patrols were instantly killed.</p><br/><p>This was Chen Feng's current strength. In this bizarre yet unique space, Chen Feng's combat power had reached peak A class.</p><br/><p>\"You are going crazy!\" The middle-aged man howled, \"This way, you will alarm the others.\"</p><br/><p>\"I'm aware of that.\" Chen Feng smiled calmly before continuing, \"This palace is only this big. How many people do we have? What's the point of sneaking or assassinating? Would you believe me if I told you that, regardless of how many people you sneak past, as long as a battle erupts inside the palace, these people will still all reach us quickly? Next, we will be surrounded. What's the point then? Hence, the easiest method of dealing with this is to simply break in through force, killing everyone we see!\"</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Suddenly, the door of the palace opened. Numerous patrols rushed out of the palace, all of them B class. On top of that, two warriors who were wearing obviously better clothing walked out of the group of patrols, filled with killing intent.</p><br/><p>His cold voice traveled forth. \"Kill all intruders!\"</p><br/><p>Chen Feng smiled calmly. \"See… they are here!\"</p><br/><p>\"F*ck!\"</p><br/><p>The middle-aged man cursed. If he'd known that Chen Feng was so stupid, he wouldn't have chosen to work together. As for now…</p><br/><p>\"Kill!\" he said with clenched teeth.</p><br/><p>Bang!</p><br/><p>Instantly, the battle erupted.</p><br/><p>The intruders led by Chen Feng faced off against the patrols. Chen Feng and the middle-aged man were in charge of the A-class patrols while the rest of them were in charge of cleaning up the other B-class patrols.</p><br/><p>Shortly after, the battle ended. The area in front of the palace was now a bloody mess.</p><br/><p>The two strongest A-class patrols had been killed by Chen Feng and the middle-aged man. As for those B-class patrols, a huge amount of them had been killed. Even half the group brought over by the middle-aged man had perished.</p><br/><p>Chen Feng led everyone as they entered the hall. \"Let's go.\"</p><br/><p>\"Ah… enemy attack!\"</p><br/><p>\"They are already in here!\"</p><br/><p>\"God, this is so scary…\"</p><br/><p>Countless horrified voices resounded. The servants of the palace were all horrified and were fleeing around in disarray.</p><br/><p>This place…</p><br/><p>This so-called palace might appear glorious. However, at a size of around several hundred square meters, its interior wasn't really huge. It was around the same size as the exhibition hall at Gold City.</p><br/><p>Alarming them was the fact that a girl was imprisoned in here. At the middle of the palace hall, countless shackles with black-and-white radiance swirling around them had a girl locked tightly to the point where she couldn't even budge.</p><br/><p>This was a young lady of around 16 or 17 years of age. She had an extremely beautiful appearance. Chen Feng had never seen his young lady before. However, this young lady was giving him an incomparably familiar feeling, seemingly someone he had seen somewhere. Her eyes were deep blue, the blue of the deep ocean.</p><br/><p>Wait, blue?!</p><br/><p>Chen Feng was alarmed. There was actually color in this girl's eyes?</p><br/><p>\"Be careful,\" Chen Feng reminded.</p><br/><p>Unfortunately…</p><br/><p>Clang!</p><br/><p>Clang!</p><br/><p>The young lady started rocking the shackles in her hands and blue radiance starting to envelope her. Instantly, everything around her stopped moving while the blue radiance blossomed without stop.</p><br/><p>The genetic warriors that were walking toward that young lady all stopped moving as well.</p><br/><p>One second, two seconds, three seconds!</p><br/><p>Bang!</p><br/><p>All the shackles crumbled apart.</p><br/><p>Instantly, the blue radiance started spreading out.</p><br/><p>Pu!</p><br/><p>All the genetic warriors within ten meters around her were dead. Out of the initially huge group of genetic warriors the middle-aged man had led here, only five were left now.</p><br/><p>A smile appeared on the young lady's face. \"I have been waiting for you guys for a very long time.\"</p><br/><p>Chen Feng: ???</p><br/><p>The young lady started humming playfully. \"You people from the Genetic Union are still as tyrannical as ever.\"</p><br/><p>Genetic Union??? What the heck is she talking about?</p><br/><p>Chen Feng: ???</p><br/><p>However, as he turned around and exchanged glances with the middle-aged man, he instantly realized something.</p><br/><p>This was a trap!</p><br/><p>Someone had used the entirety of the Qinghe Grassland as a blueprint to construct an independent space for this trap. As such, this was most definitely not a trap for them. Rather, this had been used to trap this young lady?!</p><br/><p>Based on this young lady's words, she was waiting for those from the Genetic Union? Hence… this was a confrontation between the Genetic Union and some mysterious faction! Chen Feng's group had merely accidentally gotten themselves mixed up in this disaster. And now this young lady was under the impression that they were the people from the Genetic Union.</p><br/><p>Abruptly, Chen Feng had an ominous feeling. \"Damn it!\"</p><br/><p>How powerful would those daring to contend against the Genetic Union be?</p><br/><p>Chen Feng was horrified. \"Retreat!\"</p><br/><p>The middle-aged man had decided to retreat speedily with his remaining subordinates as well.</p><br/><p>However, it was too late.</p><br/><p>Hum—</p><br/><p>A blue radiance started spreading. Instantly, everything around them seemed to slow down.</p><br/><p>This feeling… the binding of space?</p><br/><p>Even the middle-aged man with A-class combat power failed to escape this. The blue radiance spread and enveloped Chen Feng. Right at this instant, a small flickering light appeared on his body before blocking off all the blue radiance on him.</p><br/><p>Chen Feng rubbed the figurine he had. \"You again…\"</p><br/><p>This figurine had saved him too many times.</p><br/><p>\"Go!\" Chen Feng started escaping with Wu Hui. This place was too dangerous. It was better for them to first retreat from here.</p><br/><p>Unfortunately…</p><br/><p>Bang!</p><br/><p>At that instant, the space up in the sky was ripped apart.</p><br/><p>Numerous genetic warriors with terrifying strength started descending from the sky. On each of them was a uniform Chen Feng was extremely familiar with. Those were the uniform of the Genetic Union. The people from the union had arrived.</p><br/><p>Regardless of what place this was, regardless of what faction it was, as long as the experts of the Union were here, the conclusion for this was already set in stone.</p><br/><p>For them to actually gather here…</p><br/><p>Chen Feng was overjoyed. He was saved! The newcomers were a countless amount of peak B-class warriors and A-class warriors. This was the power of the union.</p><br/><p>A group of powerful warriors appeared and locked onto the young lady with their cold gazes. Toward the end, their gaze landed on Chen Feng's group as well.</p><br/><p>Chen Feng hastily made his identity known. \"We are on the same side!\"</p><br/><p>Hum—</p><br/><p>The leading genetic warrior scanned Chen Feng's body.</p><br/><p>Di. Di.</p><br/><p>\"Scan error. Unknown identity,\" the ice-cold voice of the system prompted.</p><br/><p>That person sneered. \"You dare pretend to be a member of the union?\"</p><br/><p>??</p><br/><p>Chen Feng's heart leaped.</p><br/><p>Pretend? How is that possible, this identity token…</p><br/><p>Instinctively, Chen Feng aimed his wristband at them. His wristband was actually able to easily hack into their wristband and perform scanning on them. Next, with horror, Chen Feng discovered that the time indicated by the system in their wristband was 100 years in the past.</p><br/><p>This was simply a different era!</p><br/><p>How could this…</p><br/><p>Chen Feng's heart leaped furiously.</p><br/><p>Boulder formation… time… palace… blue…</p><br/><p>At this instant, everything seemed to come together.</p><br/><p>Chen Feng finally realized that this was actually the Qinghe Grassland from 100 years in the past!!! There simply was no independent space or any of that. The location was still the same Qinghe Grassland. The only thing that had changed was time!</p><br/><p>These colors represented time! Anything black and white was from the era 100 years ago, while the other colors represented time itself. Due to some unique reason, Chen Feng had not been transformed into a person of that era. As such, even when his body was dragged into that era, he still possessed the power of color, since here, color represented the power of time.</p><br/><p>As for the power released by the young lady's blue radiance that stopped everyone's movement, it was not the power of space. Rather, that was a power capable of slowing or stopping time. She possessed the power of time! That was her ability!</p><br/><p>As for the Genetic Union, their target was this young lady. Finally, Chen Feng understood what had happened. So this was an incident where a young lady with the power of time was being hunted by the Genetic Union? If this was truly what had happened back then…</p><br/><p>Who was the one who was replaying this scene from 100 years ago? Who had turned the present Qinghe Grassland into this? What was the reason?</p><br/><p>Just as Chen Feng was in the midst of astonishment, suddenly, a familiar shout could be heard far away.</p><br/><p>\"Aooooouuu—\"</p><br/>\n</div>"}