{"title": "Chapter 271: Mysterious Radiance", "id": 271, "volume": 3, "url": "http://boxnovel.org/the-strongest-gene-chapter-271-mysterious-radiance", "volume_title": "Volume 3", "body": "<h1>Chapter 271: Mysterious Radiance</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 271: Mysterious Radiance</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Victory. Chen Feng exhaled in relief as he looked at the departing figure of that middle-aged man.</p><br/><p>\"Are they gone?\"Wu Hui's feet weakened, and he almost slumped down onto the ground. Chen Feng rushed forth to hold him up. He had only unleashed several attacks earlier, but the cost he'd paid to battle those of higher classes than him was quite huge.</p><br/><p>All the energy Wu Hui had on him was already overdrafted. If he'd truly had to battle that A-class warrior, he could only put his life on the line.</p><br/><p>\"Let's go,\" Chen Feng said.</p><br/><p>\"Mhm,\" Wu Hui answered meekly.</p><br/><p>Without their enemies around, he seemed to have reverted to his previous attitude.</p><br/><p>\"Remember, your ability is something you can't tell anyone about. The fewer people that are aware of how your ability works, the stronger you will be. If everyone knows about your ability, you will most probably become true trash. Do you understand?\" Chen Feng had a solemn expression as he said this.</p><br/><p>Wu Hui nodded resolutely. \"Mhm.\"</p><br/><p>He was too clear on how precious what Chen Feng had given him was.</p><br/><p>Shua!</p><br/><p>They left speedily.</p><br/><p>This was not a place they should stay long. Since those genetic warriors had already left, they should leave as soon as possible as well. However, just as they stood up… distantly, a bizarre radiance bloomed suddenly from the direction facing the entrance of the Qinghe Grassland.</p><br/><p>Hum—</p><br/><p>Instantly, the whole world started turning gray.</p><br/><p>Wu Hui was alarmed. \"What's that?\"</p><br/><p>Distantly, the areas enveloped by the radiance were all turning a gray color. Furthermore, it was spreading at an extremely high speed, rushing toward this direction.</p><br/><p>Shua!</p><br/><p>The green grassland was turning gray speedily. Not only the grassland, the air, other vegetations, and everything one could see were turning a gray color.</p><br/><p>Chen Feng's heart thumped. \"Something is happening.\"</p><br/><p>In front of them, several silhouettes appeared. They were the genetic squad that had just left not long ago. Evidently, they were all shocked by what happened and were escaping toward this direction as well.</p><br/><p>\"Go!\" Chen Feng did not hesitate. He dragged Wu Hui and started escaping. What joke was that? Even that A-class genetic warrior was running from the gray radiance; what could they achieve by staying here?</p><br/><p>Shua!</p><br/><p>The radiance kept spreading.</p><br/><p>Everyone was escaping frantically. However, could they outrun it?</p><br/><p>Hum—</p><br/><p>Hum—</p><br/><p>Accompanied by a flash of light, countless people vanished instantly.</p><br/><p>\"Damn it!\" Chen Feng's heart chilled. The speed was too fast! If this continued, they stood no chance of escaping! Luck value?</p><br/><p>Chen Feng tried activating his Luck Aura. However, it didn't work. Regardless of how Chen Feng urged it to work, Luck Aura did not give him any feedback.</p><br/><p>As of now, the radiance was nearing him. That A-class warrior was running hastily with his nephew. However, could they escape it?</p><br/><p>Chen Feng clenched his teeth. \"This can't continue!\"</p><br/><p>In the midst of running, he saw a pit not far away.</p><br/><p>Perhaps…</p><br/><p>Whoosh!</p><br/><p>He leaped into the pit with Wu Hui.</p><br/><p>Seal!</p><br/><p>A succession of Wind Blade was unleashed, sealing the entrance to the pit.</p><br/><p>Purple submarine!</p><br/><p>To be safe, Chen Feng even summoned the purple submarine he'd used at the frozen sea, as this submarine possessed an extremely powerful energy-blocking ability.</p><br/><p>Clang!</p><br/><p>Done. Chen Feng and Wu Hui even stopped breathing just to be safe.</p><br/><p>Facing this crisis, he had done all he could. As for the rest, he could only submit to the will of the heavens. That bizarre radiance reached them noiselessly.</p><br/><p>Hum—</p><br/><p>A bizarre radiance emerged.</p><br/><p>Here it comes!</p><br/><p>Chen Feng's heart thumped.</p><br/><p>He could clearly see how that radiance seemed to ignore the terrain there, ignored the purple submarine, ignored everything and gushed toward him and Wu Hui directly.</p><br/><p>It's over!</p><br/><p>Chen Feng's heart chilled.</p><br/><p>Hands… arms… everything was turning gray at an inconceivable speed.</p><br/><p>However, right at this instant, on that figurine he'd obtained from the frozen sea, on the body of that mysterious young lady, a gust of radiance abruptly bloomed. Noiselessly, it started spreading. Next, the invading bizarre radiance paused before stopping completely.</p><br/><p>After a short while, the radiance took a detour around Chen Feng and Wu Hui before continuing to spread elsewhere.</p><br/><p>Saved?</p><br/><p>Chen Feng's heart jolted wildly.</p><br/><p>This thing…</p><br/><p>Chen Feng took out the figurine. For unknown reason, this figurine of a young lady with a miniskirt appeared even more lifelike at this moment. It was giving Chen Feng an extremely lifelike feeling!</p><br/><p>Is this really an ordinary figurine? Ten years ago… Gou Li's squad that was hunted… those people that were killed because of this figurine…</p><br/><p>Chen Feng was inwardly amazed. \"What are you, exactly?\"</p><br/><p>Unfortunately, no one could answer his questions.</p><br/><p>The radiance continued spreading while he and Wu Hui continued hiding underground.</p><br/><p>After an unknown period of time, when the figurine finally reverted to its usual appearance and the radiance around them disappeared, Chen Feng and Wu Hui exhaled in relief.</p><br/><p>They had survived this by fluke!</p><br/><p>\"Let's go.\"</p><br/><p>Carefully, Chen Feng left the pit.</p><br/><p>If that radiance truly possessed the power to destroy everything, everything outside should have been destroyed by now. However, when Chen Feng left the pit, he was stunned.</p><br/><p>Out there, everything was now gray in color. The whole Qinghe Grassland had turned gray. Apart from gray, there was also white, black, and weird mixtures of gray, black, and white.</p><br/><p>It was like a scene out of some old black-and-white film.</p><br/><p>At this instant, Chen Feng felt like he had gone back in time and entered one of those black-and-white film.</p><br/><p>Chen Feng was stunned. \"What exactly is going on?\"</p><br/><p>Black and white… Everything was black and white…</p><br/><p>The grass on the ground, the fruit on the tree, the soil…</p><br/><p>What had happened here?</p><br/><p>Is this the effect of that radiance? Radiation? Or some unknown powerful ability?</p><br/><p>Chen Feng sunk into a solemn mood. This was truly a world where everything was possible. Even if one were to hide in one's home, a meteor might fall on your house from the sky. Hence…</p><br/><p>\"Go!\"</p><br/><p>He left speedily with Wu Hui.</p><br/><p>Regardless of what had happened here, since this had happened to the whole Qinghe Grassland, they had to leave as soon as possible. Soon, they reached the entrance of the Qinghe Grassland. It could be seen that outside the grassland was still a multicolored world like before.</p><br/><p>Chen Feng exhaled in relief. \"Seems like this only happened to the grassland.\"</p><br/><p>Go!</p><br/><p>Shua!</p><br/><p>Taking Wu Hui with him, he walked out.</p><br/><p>Hum—</p><br/><p>A bizarre undulation appeared.</p><br/><p>Bang!</p><br/><p>Chen Feng and Wu Hui were bounced back into the grassland.</p><br/><p>What's going on?</p><br/><p>Chen Feng was shocked. They couldn't leave!</p><br/><p>Currently, someone from the outside world was stepping into the Qinghe Grassland. Chen Feng stared blankly as the newcomer was right in front of him yet ignored him and stepped over the entrance into the grassland directly.</p><br/><p>Next… just as the newcomer stepped through the entrance, the newcomer disappeared.</p><br/><p>There were also several groups that had entered the entrance before disappearing. Chen Feng had initially believed that those who'd entered were all dead. However, some of the newcomers had decided to return to the camp to buy something after entering. Hence, those people stepped out of the grassland and once again appeared in front of Chen Feng once they passed through the entrance and arrived outside.</p><br/><p>They were all talking and laughing to each other casually, seemingly not affected by what had happened here at all.</p><br/><p>In other words, these people had not realized what had happened here.</p><br/><p>How is that possible?</p><br/><p>Chen Feng inhaled deeply. Apart from that, it was evident that the newcomers could not see him or anything here either. This almost felt like they were both located in two different dimensions.</p><br/><p>Wait.</p><br/><p>Chen Feng abruptly realized something.</p><br/><p>Could it be that the radiance earlier transformed space and time itself? What place is this?</p><br/>\n</div>"}