{"title": "Chapter 297: Celestial Shift!", "id": 297, "volume": 3, "url": "http://boxnovel.org/the-strongest-gene-chapter-297-celestial-shift", "volume_title": "Volume 3", "body": "<h1>Chapter 297: Celestial Shift!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 297: Celestial Shift!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"Secret art, eh…\" Chen Feng narrowed his eyes. Immediately, he looked at the squad from the Mysterious Organization. \"There should be someone among you with a space-related ability, right?\"</p><br/><p>Nowadays, a regular squad would normally have some space-related capabilities. Regardless of whether it was used to break out of traps or kill their enemies, space-related abilities were beneficial to have. Moreover, the most complete of all squads would normally have all sorts of different abilities to help them deal with a large amount of different scenarios.</p><br/><p>The captain nodded. \"Yes.\" </p><br/><p>\"How about Space-Diminishing Slash?\" Chen Feng asked indifferently.</p><br/><p>Space-Diminishing Slash was an extremely powerful 5-star secret art and the strongest space-related ability a B-class space warrior could master. It was also a defining ability for genetic warriors that were focused on space-related abilities.</p><br/><p>Function: Moves all sorts of attacks through space.</p><br/><p>That's right. This is what this ability was capable of. This secret art required the user to have five different abilities fused. As such, the minimum requirement for one to master this secret art was being a B-class warrior.</p><br/><p>This was an extremely powerful secret art, regardless of whether it was used against physical attacks, penetrating attacks, energy-based attacks, or spiritual attacks.</p><br/><p>Almost all types of attacks could be moved by Space-Diminishing Slash by instantly changing the position of the launched attack to a different position.</p><br/><p>Theoretically, as long as sufficient energy was provided, this secret art would be able to relocate every single attack in existence.</p><br/><p>Despite the fact that Chen Feng did not have this secret art mastered, he had heard of it long ago.</p><br/><p>\"No.\" The deputy captain walked out. \"But I know Celestial Shift.\"</p><br/><p>Chen Feng's eyes shone. \"Celestial Shift?\"</p><br/><p>Celestial Shift! A 6-star secret art that was the sequel to Space-Diminishing Slash, an extremely powerful A-class secret art capable of both attack and defense.</p><br/><p>If Space-Diminishing Slash was something only capable of relocating attacks, Celestial Shift was able to use the power of space to bounce the launched attack back to the attacker. This was the most terrifying use of this ability.</p><br/><p>Chen Feng had guessed that they might have had Space-Diminishing Slash in their possession. Unexpectedly, they had surprised him more. The member in charge of space-related abilities in this squad happened to also be the deputy captain himself, an A-class warrior that possessed a powerful A-class secret art.</p><br/><p>\"Very good.\" Chen Feng inhaled. \"Things will be easier, then.\"</p><br/><p>The captain thought of something. \"Don't tell me you are planning to…\"</p><br/><p>Chen Feng's gaze was sharp. \"That's right! Intercepting his attack forcefully.\"</p><br/><p>The captain rejected his proposal without hesitation. \"Impossible.\"</p><br/><p>What a joke. Celestial Shift might be powerful, but it was not omnipotent.</p><br/><p>Against a weaker enemy, Celestial Shift would have a 100% success rate in shifting attacks. However, the flaw of this secret art was quite obvious as well. Against a stronger enemy, the success rate would drop.</p><br/><p>Against an enemy 10% more powerful, the success rate would drop by 10%.</p><br/><p>Against an enemy 20% more powerful, the success rate would drop by 20%!</p><br/><p>…</p><br/><p>As for this enemy they were facing, he was more than 100% stronger than them. This was an old freak in the truest sense. After the deputy captain calculated his success rate…</p><br/><p>Mhm…</p><br/><p>The success rate might be as low as 0.00008%!</p><br/><p>He had reached this figure even after taking into consideration the complicity and unpredictability of the mysterious power of space. Otherwise, his success rate would have been even lower. However, with such a success rate, it was basically the same as 0%.</p><br/><p>This was simply a scam-like rate.</p><br/><p>He was sure that the moment he tried using this secret art he would be killed by the backlash from the power of space. There was no need to doubt this. This was simply a battle between two people in completely different leagues.</p><br/><p>Chen Feng smiled calmly. \"How will you know without trying?\"</p><br/><p>\"Impossible.\" The deputy captain would not do it even if they were to beat him to death.</p><br/><p>\"So you guys are going to watch on as he destroys the Sealed City?\" Chen Feng sneered. \"It doesn't matter to us. We are direct subordinates of Senior Soul anyway. As for you all, hehehe… After losing even your base or operations, do you think the organization will let you off? Oh yeah, after this guy is done absorbing the life force of one whole city, do you have any idea how powerful he will be? Do you believe that you can even survive this encounter?\" Chen Feng said indifferently.</p><br/><p>\"But…\" The deputy captain shook his head. \"This will never work.\"</p><br/><p>\"It will definitely work.\" Chen Feng's indifferent gaze swept past him. \"Do you truly believe that Senior Soul only sent us here to make up the numbers? The only thing you need to do is activate your secret art. As for the rest, leave it to me.\"</p><br/><p>The deputy captain looked at Chen Feng doubtfully. \"You?\"</p><br/><p>He had no faith in Chen Feng, whose strength was merely C class. That was simply too weak. If it wasn't for the fact that there was a particular lady in their group that was emitting a somewhat terrifying aura from her body, they would have believed that these so-called reinforcements were here to joke around.</p><br/><p>\"Ah.\" Chen Feng smiled calmly. \"Have you heard of Spirit Sea wood?\"</p><br/><p>Shua!</p><br/><p>The expressions of the captain and the deputy captain changed greatly.</p><br/><p>Spirit Sea wood! Could it be…</p><br/><p>Their gazes became spirited.</p><br/><p>\"Do it,\" Chen Feng said as he looked at that illusory dragon in the sky, which was going to erupt at any moment. \"We don't have much time remaining.\"</p><br/><p>The deputy captain hesitated momentarily before clenching his teeth resolutely.</p><br/><p>\"Let's do it! It would be too hard to ensure Celestial Shift's success. It would simply be impossible, even with the assistance of Spirit Sea wood. However, if I give up on bouncing the attack back to him and use the powered up version of Space-Diminishing Slash instead, it might work.\"</p><br/><p>\"Set the nearby mountain range as your target, then,\" Chen Feng said.</p><br/><p>The deputy captain inhaled deeply. \"All right.\"</p><br/><p>He proceeded to revise the Celestial Shift into a powered up version of Space-Diminishing Slash and set it to alter the course of this superpowerful peak A-class attack from the Sealed City into a nearby mountain range.</p><br/><p>…</p><br/><p>If it wasn't for the Spirit Sea wood mentioned by Chen Feng, he wouldn't have even dared to attempt this. However, even with the assistance of Spirit Sea wood…</p><br/><p>The deputy captain's eyes gleamed ferociously. \"I can only give it my all!\"</p><br/><p>\"Come!\"</p><br/><p>Bang!</p><br/><p>A terrifying power erupted from his body. Currently, in the air, the middle-aged man merely glanced at them coldly. He wasn't the least bothered with them. Even if they were similarly in A class, the disparity between their strengths was too wide.</p><br/><p>\"It's nearly done…\" The middle-aged man could feel the increase in strength of the power he was condensing in front of him.</p><br/><p>Done!</p><br/><p>Shua!</p><br/><p>Instantly, the radiance filling the whole sky gathered back into the dragon.</p><br/><p>The middle-aged man chanted, \"Roaring through the Nine Prefectures!\"</p><br/><p>With every single word of his, the momentum of his dragon intensified. When he finished chanting, the huge shining dragon solidified, transforming into a gigantic, seemingly alive golden dragon. This was the power of a superpowerful secret art.</p><br/><p>Howl!</p><br/><p>As the dragon howled, heaven and Earth trembled. Next, the dragon charged into the void, aiming toward the Sealed City.</p><br/><p>Currently, the huge pressure unleashed by the dragon could be felt even by Chen Feng's group, which was deep within the Nether Capital. How powerful exactly was the secret art unleashed by a peak A class?</p><br/><p>\"Do it!\" Chen Feng bellowed.</p><br/><p>The deputy captain roared. \"Ahh!\"</p><br/><p>The Space-Diminishing Slash that he had prepared in advance erupted.</p><br/><p>Shua!</p><br/><p>The space cracked and a mirror-like slit appeared in front of the crack in the air that the middle-aged man had created earlier, blocking the path of the dragon.</p><br/><p>This was the so-called Space-Diminishing Slash. Essentially, it was a tiny slit created in midair.</p><br/><p>As the middle-aged man saw this, he sneered. \"You are seeking your own death.\"</p><br/><p>That was indeed true. For a mere new A class like that to dare move against him? Had this guy not seen the disparity in their strength? How idiotic…</p><br/><p>Currently, the middle-aged man was not the only person thinking that way. Even the deputy captain felt that he was doing an incredibly idiotic thing. However, he had no other choices. At times like this, trusting Chen Feng was the only option available to him.</p><br/><p>The deputy captain roared at Chen Feng, \"Quick, release the Spirit Sea wood.\"</p><br/><p>\"Please wait a moment.\" Chen Feng had a sharp gaze. He ignored the anxious gazes of the squad and focused on the dragon. When it neared the Space-Diminishing Slash and was about to touch it, he made his move.</p><br/><p>Shua!</p><br/><p>He pointed at the air.</p><br/><p>Luck Aura, unleash!</p><br/><p>Hum—</p><br/><p>One point of luck value was exhausted.</p><br/><p>Low success rate? Less than one in a million chance of success?</p><br/><p>Unfortunately, before Chen Feng, as long as it was something concerning probability, it was no longer a concern. Only one point of luck value was required for him to intercept this super powerful attack of the peak A-class.</p><br/><p>However… right at this moment.</p><br/><p>The middle-aged man calmly pointed at the air. \"Clear.\"</p><br/><p>Shua!</p><br/><p>The golden dragon roared as the radiance around its body intensified. Next, the Luck Aura that Chen Feng had just activated failed the task it had been assigned.</p><br/><p>How is this possible?</p><br/><p>Chen Feng's pupils shrunk.</p><br/><p>Failing? This was something he had never encountered.</p><br/><p>This middle-aged man possessed a power capable of contending against Luck Aura?</p><br/><p>No, that could not be true! Even that green guy had been incapable of such a thing; how was it possible for this guy here to have such a capability? If so, what was happening?</p><br/><p>Chen Feng sunk into a solemn mood.</p><br/><p>Perhaps… this middle-aged man had merely felt something bad and had chosen to simply increase the power of his golden dragon.</p><br/><p>However, with the transformation of the golden dragon and the increase in its strength, the originally pitiful success rate of Space-Diminishing Slash had become even lower than before. One could say that the dragon had become so powerful that their success rate had been reduced to 0%. Only in such situation would his Luck Aura fail to work.</p><br/><p>Right at this moment.</p><br/><p>Ka!</p><br/><p>The golden dragon collided with the Space-Diminishing Slash in the air.</p><br/><p>Pu!</p><br/><p>Only their aura had collided, yet it was enough to cause the deputy captain to start spurting blood. Their disparity in strength was too great. As such, it was simply impossible for him alone to resist this.</p><br/><p>The deputy captain's heart chilled. \"It's over.\"</p><br/><p>He knew that he shouldn't have trusted that damnable guy that had come to reinforce them! The bodies of everyone else in his squad chilled as well. If the dragon was successfully launched, would they be able to survive this?</p><br/><p>Right at this moment, Chen Feng once again pointed midair.</p><br/>\n</div>"}