{"title": "Chapter 306: Destroy!", "id": 306, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-306-destroy", "volume_title": "Volume 4", "body": "<h1>Chapter 306: Destroy!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 306: Destroy!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>In the Nether Capital, among the ruins, two terrifying radiances were radiating midair. These two were Lu Hun and Ming Yue. Among the radiance, their bodies were almost indiscernible to the people below them.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>The air trembled as rays of light flashed around.</p><br/><p>Green flashes…</p><br/><p>Green flashes…</p><br/><p>Both kept appearing midair.</p><br/><p>Ming Yue had already been an extremely powerful person previously. She had only been restricted due to Wang Chun's strength. Now that she had absorbed all that life force, she had recovered a large portion of her strength. However, it was still rather difficult for her to insta-kill Lu Hun. In their battle, a difficult balance was maintained, neither of them capable of hurting the other.</p><br/><p>Lockdown…</p><br/><p>Shua!</p><br/><p>A ray of green radiance flashed past and interrupted Chen Feng's Nethergaze.</p><br/><p>With that, Chen Feng could only give up helplessly.</p><br/><p>He had initially planned to use his Nethergaze while both of them were busy fighting each other. However, he was truly helpless, since a random ray of light from Lu Hun was already sufficient to stop his move.</p><br/><p>The gap between their strength was truly too big.</p><br/><p>Since sneak attacks wouldn't work…</p><br/><p>Chen Feng stared at the two that were midbattle and decided that the only thing he could do was charge forth.</p><br/><p>With his present strength, he was obviously unqualified to participate in this battle. However, Xiao Ying, who had also absorbed a huge amount of life force, was qualified to participate.</p><br/><p>Chen Feng pointed midair. \"Go!\"</p><br/><p>Shua!</p><br/><p>Transforming into a red flash, Xiao Ying streaked forth, its target being Lu Hun.</p><br/><p>Granted, the only improvement Xiao Ying had had was in its strength. Experience-wise, it was still not too used to using such power. However, if it only needed to streak back and forth to attack, it was still sufficient to plant fear in Lu Hun's heart. However, alarming everyone there, even when Ming Yue and Xiao Ying joined hands, they were still incapable of doing anything to Lu Hun.</p><br/><p>Lu Hun's eyes gleamed coldly. \"Is this your trump card?\"</p><br/><p>Bang!</p><br/><p>With a terrifying eruption of power, both Xiao Ying and Ming Yue were shaken away by Lu Hun.</p><br/><p>\"The amount of power absorbed by both of you is indeed above the power of my clone. However, regardless of how formidable that power is, the actual person wielding the power is still crucial! This young lady here is still fine. As for that red string…hehe.\" Lu Hun merely smiled coldly.</p><br/><p>A superformidable power would certainly be able to unleash an earth-shattering effect when wielded by a sufficiently powerful expert. However, when it was used by a simple-minded brute, the only effect would be pure strength, nothing else.</p><br/><p>Now, the same thing applied.</p><br/><p>Despite Xiao Ying's prowess, it had still not reached such a level. The only thing it could do was streak back and forth with the increased power it had obtained. It was simply incapable of truly unleashing the type of effect a person holding such power should be able to unleash.</p><br/><p>As such, Lu Hun was totally unafraid of it. \"Trash.\"</p><br/><p>Ming Yue was so angry, she was gnashing her teeth. If all the power had been handed solely to her…</p><br/><p>\"Chen Feng!\" She looked toward Chen Feng. \"Remove the contract and hand over all the power to me. Only with that is there hope for victory.\"</p><br/><p>Chen Feng rejected her without a second thought. \"That's not possible.\"</p><br/><p>What joke was that?</p><br/><p>If all the power was handed over to Ming Yue, without the contract restricting her, after Lu Hun was dealt with, they would most probably have to face her next.</p><br/><p>A boss villain from a comic? This was too unreliable.</p><br/><p>Chen Feng would absolutely not place his life in the hands of such a person.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Lu Hun started attacking crazily.</p><br/><p>Ming Yue was anxious. \"If you insist, we will all die.\"</p><br/><p>Chen Feng maintained his silence. He shifted his gaze to Wang Chun. \"Can you control her? If you can control her or at least guarantee that she won't hurt us, I don't mind handing over all the power to her.\"</p><br/><p>\"Er.\" Wang Chun looked at the Shen Wei siblings before looking at himself and replying with a bitter smile, \"Not possible.\"</p><br/><p>If they were to make the wrong decision here, everyone would be in grave danger, especially the Shen Wei siblings.</p><br/><p>Chen Feng inhaled deeply. \"Hence, I can't hand the power over to her.\"</p><br/><p>However, Ming Yue and Xiao Ying were currently being pushed back without stop by Lu Hun's attacks. If he couldn't think of anything, they might truly perish here. Since he couldn't hand over all the power to Ming Yue, only one option was left.</p><br/><p>Chen Feng's urged with his heart, Combine!</p><br/><p>When Xiao Ying resided within his body, he had access to Xiao Ying's power.</p><br/><p>In that case, what if Xiao Ying were to reside within Ming Yue's body?</p><br/><p>Xiao Ying was capable of moving freely between the illusory and real worlds. The reason it could reside within his body was because Xiao Ying's power had already blended with Chen Feng's body. As for Ming Yue, due to the marriage link and the same life force they had both absorbed, they currently possessed aura from the same source. Perhaps…</p><br/><p>Shua!</p><br/><p>In the air, the Xiao Ying that had previously been charging toward Lu Hun changed its direction and streaked toward Ming Yue.</p><br/><p>Ming Yue's expression changed slightly. \"What are you doing?\"</p><br/><p>\"Fuse!\" Chen Feng calmly said, \"Don't resist—allow it to enter your body. Since both of you have aura from the same source, only by doing this can you utilize the portion of power Xiao Ying absorbed.\"</p><br/><p>Xiu!</p><br/><p>With a flash of red, Xiao Ying turned into a perfectly straight red flash and inserted straight into Ming Yue's body.</p><br/><p>Wang Chun: \"…\"</p><br/><p>An expression of pain appeared on Ming Yue's face. \"Ah.\"</p><br/><p>Chen Feng was alarmed. \"What's up?\" Had the fusion failed?</p><br/><p>\"Nothing…\" Ming Yue stabilized her emotions before saying with gnashed teeth, \"Would you not feel uncomfortable if your body was suddenly stuffed full?\"</p><br/><p>When she had absorbed the life force previously, the power had been gradually led into her body. This time, though, all the power had been forcefully stuffed into her body, almost bursting her from the oversupply of power.</p><br/><p>Fortunately, she was powerful enough to fuse the newly inserted power with her own power. She was quite clear that this was actually the power of that damnable snake, though.</p><br/><p>Bang!</p><br/><p>Instantly, all the power was fused together.</p><br/><p>This was the life force that had been collected by the Nether Capital's master after he had exhausted a great amount of energy, a volume of life force even higher than the life force he would have obtained if he had actually slaughtered the whole Sealed City.</p><br/><p>This was the pure life force remaining after all the impurities had been cleared thanks to Chen Feng. This was a truly formidable power. Initially, with only half the portion, Ming Yue had found it hard to deal with Lu Hun. Now, with all the power, she was able to unleash an astonishing amount of power.</p><br/><p>Rays of light swirled around Ming Yue's hand. \"This power…\" She raised her hand and pointed at Lu Hun. \"You…\"</p><br/><p>Bang!</p><br/><p>With a bright explosion, Lu Hun was blasted away.</p><br/><p>Ming Yue's mouth curled up, forming a smile. \"A part of my power has been restored…\" This was how powerful she had been. She, Ming Yue, the dominator of The Crystal Palace, when had she ever been suppressed and humiliated in such a manner?</p><br/><p>The radiance surrounding Ming Yue intensified. \"Come!\"</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Explosions erupted midair without stop.</p><br/><p>Everyone witnessing this was so astonished that their mouths were left hanging.</p><br/><p>After combining, the Ming Yue and Xiao Ying that had initially been at a disadvantage were now beating Lu Hun up. Even if this was merely a clone, this was still a clone with peak A-class strength they were beating up!</p><br/><p>This strength…</p><br/><p>Pu!</p><br/><p>In a short while, Lu Hun was already seriously injured.</p><br/><p>\"Chen Feng!\" Lu Hun howled.</p><br/><p>The few times he had tried to kill Chen Feng had all been stopped by Ming Yue.</p><br/><p>A smile appeared on Chen Feng's face. \"Depart in peace.\"</p><br/><p>Lu Hun's eyes gleamed coldly. \"Just you wait! When my true body is finally able to leave…\"</p><br/><p>Pu!</p><br/><p>Ming Yue's kick landed on his mouth.</p><br/><p>Lu Hun stared at Ming Yue. \"You too… I will let you know how powerful the real me is! You bugs will one day pay for this…\"</p><br/><p>Pu!</p><br/><p>The final attack launched by Ming Yue pierced through Lu Hun.</p><br/><p>\"Idiot. Do you think that you are the only person whose strength is restricted?\" Ming Yue waved her hand in a carefree manner and sneered. \"Even now, only 10% of my strength has been restored.\"</p><br/><p>Pu!</p><br/><p>With a flash of green, Lu Hun's clone transformed into countless sparkling and translucent green particles that floated around in the air.</p><br/><p>Ming Yue's eyes shone. \"Where are you running?\"</p><br/><p>Shua!</p><br/><p>With a wave of her hand, all the energy floating in the air was absorbed by her.</p><br/><p>Lu Hun's clone was thus killed.</p><br/><p>\"Done.\" After absorbing those energy particles, Ming Yue felt satisfied. However, she was also quite clear that, moving on, half of every single bit of power she obtained would be shared with Chen Feng. To be more accurate, half of the power needed to be shared with that damnable tiny snake!</p><br/><p>Bastard!</p><br/><p>The mere thought of this infuriated her to no end.</p><br/><p>\"Chen Feng—\" Just as she was prepared to haggle with Chen Feng, an odd feeling rose within her. Instantly, she discovered that her power was disappearing at a rapid pace…</p><br/><p>As she studied herself attentively, she noted that the tiny snake hidden within her had awoken and was currently absorbing her power.</p><br/><p>The initially limp red line was once again perfectly straight, moving back and forth inside her…</p><br/>\n</div>"}