{"title": "Chapter 311: Astonishing Methods", "id": 311, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-311-astonishing-methods", "volume_title": "Volume 4", "body": "<h1>Chapter 311: Astonishing Methods</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 311: Astonishing Methods</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>For a large amount of people, the Mysterious Killing Command was quite an idiotic thing. Wasting a huge amount of resources and manpower to achieve a goal that did not really make up for the losses. Regardless of how one looked at it, this was akin to digging one's own grave, an act that would not gain the Mysterious Organization any benefits.</p><br/><p>For a person called Ji Feng, this was quite the beneficial thing for him.</p><br/><p>A smile appeared on Ji Feng's face. \"What a beautiful sectorial strife.\"</p><br/><p>Due to the different conflicts between factions in the Union, despite the fact that a lot of people had mentioned the importance of Chen Feng as a person, there were still a number of people that weren't bothered about him. They believed that Chen Feng wasn't too important a person and was not worth the exhaustion of too many resources to protect. One had to know that every single allocation of funds would go through stringent audits before approval. As for protecting Chen Feng… especially against those curses, a huge amount of funding would be required.</p><br/><p>This was the reason Chen Feng had never received any sort of protection from the Genetic Union all this while.</p><br/><p>To use such an amount of funds, a huge amount of discussions were required. All sorts of elders would be required to vote on it as well. A lot of people were unable to find any excuses to vote against this, but they had chosen a simpler method of dealing with this: to drag it on.</p><br/><p>Therefore, up till now, the usage of this funding had still not been approved.</p><br/><p>The only measure taken was quite the simple one. Genetic Union members in missions nearby had all been recalled back to the Union to protect the Genetic Union and try their best to kill as many of the enemies as possible. As for other measures, Chen Feng would have to rely on himself.</p><br/><p>As such, from the beginning, a lot of people had already known the end result of this Mysterious Killing Command: The Mysterious Organization would lose a huge amount of A-class experts. The Genetic Union would be pleased with this result. As for Chen Feng, he would be dead. The Mysterious Organization would be similarly pleased and stop their move after this. Both sides would be satisfied with the end result. This would be similar to the previous issuance of the Mysterious Killing Command.</p><br/><p>This was quite clear from the indifferent attitude of these people from the Genetic Union toward the Mysterious Killing Command.</p><br/><p>None of them were actually afraid of it. Rather, they were quite looking forward to it.</p><br/><p>For a lot of them, this was the best opportunity to strike their enemy and the other factions in the Genetic Union.</p><br/><p>Ji Feng laughed. \"Genetic Union…\"</p><br/><p>The Genetic Union was an extremely large organization, larger than the Mysterious Organization. However, due to the different factions in it and the so-called freedom granted to their members, their efficiency in tackling different issues was fated to be lacking compared to the Mysterious Organization.</p><br/><p>\"Boss, since they do not intend to protect Chen Feng, why don't we use killing curses instead…\" someone proposed.</p><br/><p>Pa!</p><br/><p>Ji Feng's slap landed on his face. \"Although those people were involved in internal struggles, do you think they are all idiots? Around Chen Feng, there are at least 20 A-class experts lingering. If we do not send sufficient assassins over for direct attacks, do you think that the curses will even reach Chen Feng before being intercepted by those A-class experts?\"</p><br/><p>\"They won't be able to intercept all of them, right?\" that person said in a wronged manner. \"Moreover, there are still a huge amount of distance-ignoring and space-ignoring abilities. Only a small portion of them need to land on Chen Feng. The defenseless Chen Feng will…\"</p><br/><p>Pa!</p><br/><p>Another slap landed. \"Even if the Genetic Union wasn't bothered with protecting Chen Feng, that would not mean that Chen Feng will not have any defensive measures. Do you understand? Chang Luguo, read the tips we got to this idiot.\"</p><br/><p>\"All right.\" The young man called Chang Luguo walked out and adjusted his spectacles in a scholarly manner.</p><br/><p>\"Based on the tip-off we received, despite the fact that the Genetic Union has not provided additional funding to Chen Feng, he has still used a huge amount of funding to set up an inescapable net at his location. To avoid any mishaps, he has even stayed in there for several days, waiting for our attack.\"</p><br/><p>\"Did you hear that?\" Ji Feng snorted and continued, \"You should keep in mind that a person qualified to have the Mysterious Killing Command issued on them is definitely not an ordinary person. This is especially true for this person, the creator of the heaven-dazzling gene reagent. He won't be lacking at all when it comes to money. Hence, this will be an extremely difficult battle. Do you understand?\"</p><br/><p>As of now, the screen on his wristband shone. Finally, the countdown on it reached zero.</p><br/><p>Mysterious Killing Command, activated!</p><br/><p>Shua!</p><br/><p>The ice-cold walls all over him instantly turned into multiple screens. From the moment the countdown reached zero, all the screens would be displaying what was going on at the Genetic Union. This was a war.</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>On the left and right screens were the comparisons between the strength of the Genetic Union and Mysterious Organization.</p><br/><p>Mysterious Organization: XX A-class genetic warriors, XX B-class genetic warriors…</p><br/><p>Genetic Union: XX A-class genetic warriors, XX B-class genetic warriors…</p><br/><p>On the center screen was a huge panoramic map.</p><br/><p>All the information displayed here was information obtained by the elite specialists of the Mysterious Organization. As a proper organization, their focus had not only been on nurturing combatants. The entire Mysterious Organization was essentially run in a way similar to the feudal kingdoms of the past.</p><br/><p>No parliaments were required, no votes were required, no consideration of gains or losses, no consideration of funds. Only a single order from their leader and their scouting mechanisms would be activated immediately.</p><br/><p>This was the genetic era, an era where, apart from combat power, the strongest point of humanity was the amount of information available to them.</p><br/><p>Ji Feng's cold gaze landed on the center screen. \"As such… What makes you think you are capable of contending against me?\"</p><br/><p>Shua!</p><br/><p>The Mysterious Organization made their move.</p><br/><p>Yes, the location of the battle would be the Genetic Union's base, where the Genetic Union would possess natural advantages. But then, so what? Every single ability, strength, or commonly used strategy of theirs had been cleanly analyzed. The 10 days of preparation time had been used by the Mysterious Organization to study these opponents.</p><br/><p>Hua!</p><br/><p>The battle of A-class warriors started.</p><br/><p>This seemed like a chaotic battle. However, unknown to anyone, each of the experts of the Mysterious Organization had their own respective opponents chosen in advance in order to ensure that their respective opponents were all those with abilities weak against them.</p><br/><p>After all, they did not need to kill these people. Merely dragging it out would be sufficient.</p><br/><p>Ten…</p><br/><p>Five…</p><br/><p>Three…</p><br/><p>One…</p><br/><p>Soon, the number of unoccupied Genetic Union members dropped to zero.</p><br/><p>Ji Feng's mouth curled up, forming a smile. \"This is much easier than the previous time was.\"</p><br/><p>Shua!</p><br/><p>To be safe, he had also dispatched an additional A-class expert over to help against other experts who each had their own pre-assigned opponents. When things got dangerous to any of them, this A-class expert with high movement speed would be able to provide some assistance.</p><br/><p>Compared to the previous issuance of the Mysterious Killing Command, they were aiming to have zero casualties this time around. The plan was progressing smoothly.</p><br/><p>Then… next, it's your turn.</p><br/><p>Ji Feng shifted his focus to a location several hundred meters away from the main battlefield, the innermost region of the Genetic Union's base. There, within a small building, Chen Feng was seated cross-legged in silence.</p><br/><p>Around him, the whole building was filled with odd seals.</p><br/><p>Restriction?</p><br/><p>Ji Feng merely smiled at the sight of those. \"It's time.\"</p><br/><p>Bang!</p><br/><p>Lightning descended from the sky. This was a lightning strike. Among all the existing distance-ignoring attacks, this was the fastest.</p><br/><p>That huge lightning bolt pierced through space itself and arrived above Chen Feng immediately. However, just as it touched the building Chen Feng was in, it was blocked by a layer of light. This was the defensive energy barrier of the Genetic Union.</p><br/><p>This was a barrier with an extremely strong defense and an energy supply capable of self recovery. This was a defensive barrier nearly impossible to break. Unless…</p><br/><p>\"First round, pure energy attacks,\" Ji Feng said indifferently.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Energy attacks started raining down upon Chen Feng.</p><br/><p>All sorts of distance-ignoring attacks, wind attacks, fire attacks, and lightning attacks… numerous types of long-range attacks descended at nearly the same moment and landed on the that building. All of them landed at the exact same instant.</p><br/><p>Ka!</p><br/><p>Ka!</p><br/><p>On that previously unwavering energy barrier, a crack appeared.</p><br/><p>\"How is that possible?\"</p><br/><p>The people of the Genetic Union were shaken.</p><br/><p>This was too fast. During the previous Mysterious Killing Command, breaking the defensive barrier alone had taken the enemy two whole minutes. These two minutes were exactly what they had made use of to kill several A-class experts of the Mysterious Organization. The Genetic Union was not to be underestimated, after all.</p><br/><p>Two minutes would be sufficient to cause great losses to the Mysterious Organization. Outside of everyone's expectations, though, this time, only 10 seconds had been taken to break the defensive barrier.</p><br/><p>Ji Feng sneered. \"Idiots.\"</p><br/><p>Do you think that you guys are the only party that is improving in strength? Then… time to start the second step!</p><br/><p>\"Killing curses!\" Ji Feng ordered with a cold expression.</p><br/><p>Since the defensive barrier had been broken, the actual killing could begin.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>One after another, bizarre, never-before-seen abilities descended noiselessly. The sky above the Genetic Union changed as bizarre abilities coming from all corners of the world condensed there and formed a clump of bizarre radiance with seven colors. This clump of radiance that had gathered a countless amount of terrifying and astonishing abilities started descending noiselessly.</p><br/><p>What was going on?</p><br/><p>Everyone's expression turned unsightly. The barrage of energy attacks earlier had arrived in such a manner. Even the current killing curses were such as well. When had the Mysterious Organization become so powerful?</p><br/><p>Wait… could it be…</p><br/><p>\"Not good.\"</p><br/><p>Everyone's expression changed abruptly.</p><br/><p>That clump was not made up purely of killing curses. Among the several tens of thousands of abilities within that clump, 10% of them were purely fusion-related abilities. These abilities had zero killing power yet were capable of fusing all the abilities around them. When all these abilities fused together, an incomparably terrifying mutation would occur.</p><br/><p>The same thing had also happened earlier during the barrage of energy attacks. That was the reason their defensive barrier had broken so fast. Now, the same thing was repeating!</p><br/><p>Things were about to get dangerous for Chen Feng!</p><br/>\n</div>"}