{"title": "Chapter 316: Data Storage Methods", "id": 316, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-316-data-storage-methods", "volume_title": "Volume 4", "body": "<h1>Chapter 316: Data Storage Methods</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 316: Data Storage Methods</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>One point of luck value exhausted.</p><br/><p>One point of luck value exhausted.</p><br/><p>…</p><br/><p>Chen Feng looked at his constantly reducing luck value. Before his eyes, the lines in his Luck Aura-generated illusory world became distinct as the coordinates merged with his illusory world.</p><br/><p>The point of origin for these lines was the initial location of the squad that was in charge of this Mysterious Killing Command. The lines represented the current location of the squad. At every passing moment, their movements were clearly indicated to Chen Feng. Surprising him, the squad had actually not returned to the Mysterious Organization. The line representing them could be seen taking a big turn before reaching a place Chen Feng was extremely familiar with: Clear City.</p><br/><p>\"Why are you…\"</p><br/><p>Just as Chen Feng was about to get confused, he came to himself. That was the route that one had to take when returning to the Gene Production Association from the Genetic Union.</p><br/><p>Those guys were planning to personally make a move on Chen Feng!</p><br/><p>Everyone believed that these people would return gloomily after failing this mission. Outside of everyone’s expectations, they'd still had this choice of action hidden away! They were indeed worthy of being members of the Mysterious Organization.</p><br/><p>\"Why…\"</p><br/><p>Chen Feng thought about it and abruptly inhaled a mouthful of cold breath. Rather than implementing the next step of their plans, it was probable that these guys no longer had any other options. By slightly altering his line of though, Chen Feng was able to have an accurate guess as to their current situation.</p><br/><p>Since they had no other options, they had no choice but to kill Chen Feng themselves.</p><br/><p>That was the scariest part of all this.</p><br/><p>If it was a normal assassin, even if he was an A class, Chen Feng only needed to hide for a certain amount of time and the enemy would be at his end. This was also the reason the Mysterious Organization had failed to kill him time and again. Apart from certain unique circumstances where he had to leave, he would normally spend all his time being a nerd at Star City. Even if they wanted to kill him, they would have no way to do so.</p><br/><p>Following Chen Feng all the time? It wasn’t worth it.</p><br/><p>But now, if there were individuals that also happened to be A-class experts and who had nothing else to do besides their sole mission of killing Chen Feng, this was an enemy that could remain hidden, waiting for Chen Feng for one month, two months, or even longer.</p><br/><p>How should he guard against such a terrifying enemy? Would he be able to guard against this enemy? Just the thought of this chilled Chen Feng’s heart.</p><br/><p>The sharp Wang Chun was able to notice the somewhat off expression on Chen Feng’s face. \"What’s the matter?\"</p><br/><p>\"Nothing major.\" Chen Feng gave him a rough explanation of what was happening.</p><br/><p>Wang Chun rolled his eyes. \"Nothing major?\" Was this truly nothing major? He shook his head. \"Just get the Genetic Union to escort you back. Granted, by moving independently, they will be able to move faster. However, you only need to have two or three A-class warriors protecting you. They will not be able to do anything against you then.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>Bro, do you think it is so easy to find an A class? And getting one to be a bodyguard on top of that?</p><br/><p>The reason these A-class experts had came out previously was due to them wanting to make use of this Mysterious Killing Command to kill some enemies. Under normal circumstances, for an ordinary Genetic Union member to get an A-class expert as a bodyguard, a corresponding benefit needed to be offered.</p><br/><p>Wang Chun curled his lips. \"You are rich anyway. What are you afraid of?\"</p><br/><p>He was clear that it might appear like Chen Feng had spent a lot to protect himself this time, but in truth, Chen Feng had actually profited.</p><br/><p>Chen Feng felt helpless. \"How could things be that simple?\"</p><br/><p>A-class experts were not so easy to invite. They were also not people who could be enticed with money alone. Moreover, having their protection one time would be sufficient. Two times? Three times? He couldn’t invite some A-class experts to protect him every time he needed to leave town, right? That would be too luxurious a treatment!</p><br/><p>If so…</p><br/><p>\"Seems like I can only do that.\" Chen Feng sighed and continued, \"I truly didn’t want to do this.\"</p><br/><p>Wang Chun was amazed. \"What are you doing?\" Even in such an impasse, Chen Feng had a method to deal with it?</p><br/><p>Chen Feng smiled profoundly. \"You will know soon enough.\"</p><br/><p>Noiselessly, they reached the initial location of the squad in charge of this Mysterious Killing Command. Unsurprisingly, to avoid giving intelligence to the Genetic Union, all the items here had already been moved away. The only thing left here was an abandoned factory.</p><br/><p>Within were a huge amount of discarded or destroyed items. A huge amount of destroyed data storage items were piled up together. Repairing these data storage items alone was already something that would require more than 10 years, and that was with the premise that data restoration wasn’t taken into consideration. Chen Feng attempted to turn them on, but the only response he received was a succession of \"Invalid\" notifications.</p><br/><p>\"All the data was mixed up?\"</p><br/><p>Chen Feng’s head ached.</p><br/><p>This was the standard method of damaging data.</p><br/><p>For data storage items, simple methods such as breaking them or even burning them had a risk of these items being restored using some restoration-related ability to fully repair them.</p><br/><p>These abilities were impossible to guard against.</p><br/><p>As such, to protect against data leakage, the data would be mixed up. The so-called \"mixed up\" method was a method one would not be able to do anything against. That was because when using this method, the actual data storage items were not damaged. As such, there was nothing for the restoration-related abilities to restore.</p><br/><p>Even if they were scanned using recovery tools, the result would indicate no damage to these data storage items.</p><br/><p>All abilities were ineffective against this method.</p><br/><p>The only method capable of rendering this method ineffective was a time-related ability. Only using time-related abilities to restore the data storage item to an earlier point would work.</p><br/><p>However, as far as the public was concerned, this was something nobody could accomplish. As such, this method of mixing up the data was a flawless plan on paper.</p><br/><p>Suddenly, Chen Feng recalled the young lady he had met when he'd travel back in time. If he recalled correctly, the ability of that young lady was time-related as well.</p><br/><p>Chen Feng shook his head. What are you thinking about?</p><br/><p>Shua!</p><br/><p>He turned another data storage item on.</p><br/><p>Countless nonsensical code started popping out. Chen Feng inhaled deeply. He did not possess a time-related ability, but he had Luck Aura at his disposal. Could this seemingly boundless amount of data be restored by his Luck Aura?</p><br/><p>He was looking forward to trying it out.</p><br/><p>\"Luck Aura, activate!\"</p><br/><p>Chen Feng’s gaze was sharp.</p><br/><p>Hum—</p><br/><p>Luck Aura started operating at full power.</p><br/><p>One point of luck value.</p><br/><p>Two points of luck value.</p><br/><p>Three points of luck value.</p><br/><p>…</p><br/><p>His luck value dropped without stop.</p><br/><p>He had already had quite a low amount of luck value remaining. Now, it dropped even further. Within the data storage item, the chaotic data was now looking somewhat neat compared to its previous condition.</p><br/><p>Shua!</p><br/><p>The screen that was filled with nonsensical code flickered, and several words appeared on it. These words only remained for a short while before the screen flickered and, once again, it was filled with endless nonsensical code. Chen Feng’s luck value had now been fully exhausted.</p><br/><p>With 100 points of luck value, only a fraction of the data had been recovered. Only those few words had been recovered. From this, one could see how effective such a method of data protection was.</p><br/><p>However, despite the fact that Chen Feng’s ability wasn’t particularly effective at solving this nonsensical code, his ability was effective in giving him just the information he required.</p><br/><p>From the few words that flickered past earlier…</p><br/><p>Mission executioner: Ji Feng.</p><br/><p>These few words were sufficient for Chen Feng.</p><br/><p>\"Ji Feng…\"</p><br/><p>A smile appeared on Chen Feng’s face. What a good name.</p><br/><p>Currently, somewhere in Clear City, Ji Feng had just contacted several friends there. They were trying to predict the time and route Chen Feng would take in his trip back to Star City. This would be his only chance. As such, he had to ensure Chen Feng’s death.</p><br/><p>\"Are you sure?\"</p><br/><p>\"Yes.\"</p><br/><p>\"Good, if this is the time…</p><br/><p>Midsentence, the person on the call with him abruptly ended the call.</p><br/><p>Is someone else calling him?</p><br/><p>Ji Feng frowned. After waiting a short while, he tried calling his friend again. Surprisingly, though, his friend’s communication tool was no longer turned on.</p><br/><p>H turned off the communication tool?</p><br/><p>Ji Feng had a bewildered expression.</p><br/><p>Are you kidding me?</p><br/><p>In this era, where the wristband was used as the communication tool, nobody would actually bother turning their communication tool off.</p><br/><p>As such, the only reason he would fail to call his friend was him being blacklisted by his friend.</p><br/><p>Blacklisted?</p><br/><p>That person was a friend that had gone on several missions with him in the past. Granted, they had not been particularly close friends, but they could have been considered as being in the same boat. Why had his friend blacklisted suddenly him?</p><br/><p>After thinking about it, Ji Feng tried calling a different friend of his. However, this friend’s communication tool was turned off as well.</p><br/><p>Blacklisted again?</p><br/><p>\"Something seems off.\"</p><br/><p>Ji Feng tried contacting all his friends, yet…</p><br/><p>Turned off!</p><br/><p>Turned off!</p><br/><p>Turned off!</p><br/><p>Only a single call went through. However, the response he received was \"look out for yourself\" before the call ended. When Ji Feng tried re-calling the same person, the call went unanswered.</p><br/><p>\"What happened?\"</p><br/><p>Ji Feng frowned.</p><br/><p>Right at this moment, Chang Luguo charged into the room hurriedly. \"Boss, something happened!\"</p><br/><p> Ji Feng’s heart throbbed.</p><br/><p>\"What?\" Chang Luguo showed his screen to Ji Feng. After looking at it, Ji Feng was so furious he almost spat blood on the spot as he shouted, \"Chen Feng, screw you!!!\"</p><br/>\n</div>"}