{"title": "Chapter 324: Too Much of a Bully!", "id": 324, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-324-too-much-of-a-bully", "volume_title": "Volume 4", "body": "<h1>Chapter 324: Too Much of a Bully!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 324: Too Much of a Bully!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At a certain location, within the same dark smog, several dark silhouettes appeared.</p><br/><p>\"Concerning Ji Feng…\"</p><br/><p>\"Don’t worry.\"</p><br/><p>\"But he knows a lot of the organization’s secrets.\"</p><br/><p>\"Not a problem. The young and elderly of the Ji family are all still with us. As such, he is aware of what to say and what not to say. It doesn’t matter much if he only leaks some insignificant information.\"</p><br/><p>\"It’s still risky.\"</p><br/><p>\"I will handle it as soon as possible.\"</p><br/><p>\"But then, the priority level we placed on Ji Feng could be somewhat lowered, as it's already time for us to activate that project.\"</p><br/><p>\"Noted.\"</p><br/><p>…</p><br/><p>The silhouettes conversed quietly.</p><br/><p>Currently, Ji Feng was still facing Chen Feng.</p><br/><p>Danger! This was the first time he had felt such a dangerous feeling from a C class. He was sure that if Chen Feng made his move, he would either be seriously injured or dead. That, coupled with Wu Hui and Xu Fei waiting by the side…</p><br/><p>Without hesitation, he raised his hands and apologized. \"I’m sorry.\"</p><br/><p>He was truly terrified. By the side, Chang Luguo had already lifted a huge stone and prepared to toss it over after seeing Ji Feng about to make a move. However, the sight of Ji Feng raising his hand to apologize stunned him. He remained blank until the gazes of Xu Fei and the rest landed on him.</p><br/><p>\"Ha! I am merely exercising my arm due to being bored.\" With an awkward smile that he believed would not lose him his face, he proceeded to lower and lift the stone several times before putting it back down on ground. \"You guys can continue.\"</p><br/><p>After making up an excuse for himself, he stared at his boss with a grudging gaze, hoping that, once again, everyone here would forget about him.</p><br/><p>Everyone: \"…\"</p><br/><p>Ji Feng: \"…\"</p><br/><p>Had this guy turned into an idiot due to being lied to too much by Ji Feng?</p><br/><p>Chen Feng looked at Ji Feng indifferently. \"Good. I hope that this will be the last time something like this happens.\"</p><br/><p>\"All right.\"</p><br/><p>This time, Ji Feng was truly terrified. As far as he was concerned, in Chen Feng’s group of three, where Xu Fei was like a main tank and Wu Hui was like a violent DPS, Chen Feng should have been the strategist. As such, his strength should have been rather ordinary. This was also why Ji Feng had started having second thoughts earlier.</p><br/><p>He had never imagined that this guy’s combat power was so off the charts as well. From what he'd felt earlier, this guy had a combat power of at least A class as well. If so, what was the point of him making a move? Chen Feng wasn’t even 20 years old, right? What the heck had these kids eaten when growing up? Hormone injections? Their strength levels were truly too savage!</p><br/><p>He was aware that these few guys here were the type of geniuses that would normally only appear in the legends. However, he couldn’t help but feel like he was no longer able to keep up with the times. As of now, he no longer dared to resist against them.</p><br/><p>Chen Feng merely snorted at his response. \"Hmph.\"</p><br/><p>From the moment he'd met Ji Feng, his Nethergaze had already been activated. He had given this Nethergaze of his a nickname: Bane of Blabbermouths. This was also the only ability Chen Feng had at this time that was capable of contending against an A class. Since they had spent so much time talking, Chen Feng’s lock had already been completed long ago.</p><br/><p>Resist? That would be akin to courting death. Naturally, it was for the best if Ji Feng knew to be afraid of him.</p><br/><p>Although he was already done locking onto Ji Feng, this guy still possessed a formidable combat power, after all. If Chen Feng had to unleash a Nethergaze against someone at Ji Feng’s level, he would probably need to exhaust every ounce of energy he had to do so.</p><br/><p>\"Now, let me know the location of your Mysterious Organization,\" said Chen Feng.</p><br/><p>Ji Feng stared at Chen Feng in astonishment. \"You are truly planning to go?\"</p><br/><p>The Mysterious Organization’s headquarters was truly a place filled with experts. There were more than ten A-class warriors at his level. Not to mention that there would also be some peak A classes around that were returning to report on their missions. There were also the occasional visits of their leader and the management of their organization. For Chen Feng to go there, it was akin to committing suicide.</p><br/><p>Chen Feng glanced at him. \"You don’t have to worry about that.\"</p><br/><p>\"Hehe.\" Ji Feng laughed awkwardly and said, \"Chen Feng, it’s not that I don’t want to tell you. The problem is, after telling you, you will go there and get yourself captured. At that time, our Ji family will be finished…\"</p><br/><p>\"Ji family?\" Chen Feng was astonished. There was such clan as the Ji family?</p><br/><p>Ji Feng smiled bitterly. \"Naturally. Why have the members of the Mysterious Organization been so loyal? That is because the members were all chosen from subsidiary families of the Mysterious Organization. An example is the Qin family. If it wasn’t because of you, people like Qin Hai and the others of his generation would already be new members of the Mysterious Organization by now.\"</p><br/><p>So that’s the case.</p><br/><p>Finally, Chen Feng understood how they worked.</p><br/><p>Ji Feng laughed bitterly. \"Hence, if anyone is found to be leaking information, their whole family will be affected. If you are asking for some other information, I have no problem telling you, but since you are planning to go to the Mysterious Organization yourself, you will definitely get yourself captured. Those people there are capable of everything. Regardless of the amount of secrets or trump cards you have, there are still countless abilities capable of discovering you. The end result will be all of us dying together,\" Ji Feng said helplessly.</p><br/><p>\"You have such low confidence in me?\" said Chen Feng with a faint smile. \"Let me prove my ability to you first, then.\"</p><br/><p>Ji Feng blanked. \"What?\"</p><br/><p>Hum—</p><br/><p>From Chen Feng’s body, an astonishing aura erupted.</p><br/><p>This power…</p><br/><p>Ji Feng’s pupils shrunk.</p><br/><p>\"Shh, don’t move.\" Chen Feng placed both his hands on Ji Feng’s body. Next, a perfectly straight red string appeared from Chen Feng’s hand and streaked into Ji Feng’s body.</p><br/><p>For the first time, an alarmed expression appeared on Ji Feng’s face. \"What is this?\" From this red string, he felt an extremely formidable power. He could clearly feel that the power of this thing here had even reached peak A class.</p><br/><p>Ji Feng was shocked. The h*ll! This was something released by a C class!</p><br/><p>The red glow in Chen Feng’s eyes had only been sufficient to put him on alert. On the other hand, this newly appeared thing here gave him a feeling that he would be insta-killed at any time. This was a power that truly belonged to a top expert.</p><br/><p>Chen Feng, who are you, exactly?</p><br/><p>Feeling the red string moving back and forth in his body, Ji Feng did not dare to move even the slightest bit. He was afraid that any carelessness would result in his death.</p><br/><p>After a long time, Chen Feng retrieved that red string in a satisfied manner. Only then did Ji Feng dare to move and start wiping away his cold sweat.</p><br/><p>That was too terrifying! Regardless of who it was, if there was something that was uncontrollable yet far stronger than one wandering within one's body, that person would be in fear as well.</p><br/><p>Ji Feng gulped as he asked, \"What is that?\"</p><br/><p>Chen Feng indifferently replied, \"Divine Draconic Curse. This is a power I inherited from a red dragon I once met accidentally. Mhm… I can only use it once every three days. Using this, I am able to plant a Divine Draconic Curse in one’s body. Now, the red dragon’s power has already been planted within your body. I am now able to explode your body any time I want.\"</p><br/><p>Instantly, Ji Feng’s face paled.</p><br/><p>Curse? F*ck!</p><br/><p>As the person in charge of the Mysterious Killing Command’s implementation, he was definitely knowledgeable about all sorts of curses. Granted, he had never heard of this Divine Draconic Curse, probably due to its level being too high, but he had clearly been able to feel the horror of this curse earlier.</p><br/><p>A curse at such a level would be more than sufficient to insta-kill him.</p><br/><p>Chen Feng calmly asked, \"Now… I believe you can finally put all your heart into thinking up a solution for me?\"</p><br/><p>\"Bro!\" Ji Feng did not even have the tears to cry. \"Anything you ask, I will tell you! But for this matter, it will implicate my whole family…\"</p><br/><p>\"If so, think of a method that will not implicate them,\" said Chen Feng with a faint smile. \"I am aware that going there directly is equivalent to suicide. That is the reason why I require an old senior like you to think of something for me. After all, you have a much deeper understanding of the Mysterious Organization compared to me. Since that is so dangerous a place, wouldn’t it be fine if you provide us protection?\"</p><br/><p>Ji Feng: \"…\"</p><br/><p>So, he needed to even provide them protection?</p><br/><p>Instantly, his head ached immensely. But then, now that his fate was in this person’s hands, he had no choice but to start racking his brain for ideas.</p><br/><p>Method… A method that can allow them to go to the Mysterious Organization without dying. Ji Feng started pulling his hair furiously. What the heck is this? What a freaking bully!</p><br/>\n</div>"}