{"title": "Chapter 345: Isn’t This Too Excessive?", "id": 345, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-345-isn%E2%80%99t-this-too-excessive", "volume_title": "Volume 4", "body": "<h1>Chapter 345: Isn’t This Too Excessive?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 345: Isn’t This Too Excessive?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>A gentle voice drifted into his ears. \"Are they soft?\" Despite the gentleness, Jin Dian was so shocked his soul almost left his body.</p><br/><p>Shua!</p><br/><p>He retracted his hand in horror.</p><br/><p>He retreated several steps backward while talking incoherently. \"A liv-living person?!\" This shock was not feigned. Rather, he was truly shocked. Living person? He had initially believed that this was merely a figurine defense system summoned by Chen Feng. Never in his wildest dreams had he expected that this was an actual living person. A terrifying living person capable of blocking his attack with a random part of her body.</p><br/><p>How could he not be terrified of such a person? Even if he was already peak A class, even if he was already among the elites of this world, it was precisely the height he was at that made him more aware of the horrors this world had compared to those who were weaker.</p><br/><p>This person…</p><br/><p>\"Who are you, exactly?\" Jin Dian asked grimly.</p><br/><p>It was too astonishing that there actually existed someone capable of training their body to such an extent.</p><br/><p>\"Who am I?\" The woman sounded somewhat furious as she rubbed her sore chest. \"I am your mother!\" After saying that, before Jin Dian could even reply, she turned around and glared at Chen Feng. Gnashing her teeth, she said, \"Chen Feng!!! Aren't you being too excessive this time?\"</p><br/><p>\"Cough, cough.\" Chen Feng laughed awkwardly. \"An accident, a pure accident.\"</p><br/><p>This was truly an accident! How was he supposed to have known that this lady here had been in the shower? If he had known this, he would have summoned her long ago. Eh, no, wait, what was this line of thought…</p><br/><p>She raged. \"Shouldn't you notify me first if you want to do this? You won't let me off even when I'm showering?\"</p><br/><p>\"If I had notified you in advance, would you have agreed to this?\" Chen Feng meekly asked.</p><br/><p>\"Naturally, no,\" she replied without a trace of politeness.</p><br/><p>Chen Feng had an innocent expression plastered all over his face. \"Therefore…\" It wasn't like he had any other options at this time.</p><br/><p>\"Hmph!\" Gnashing her teeth, she pointed at Xiao Ying. \"Did you not say that this fellow here is your bro? You are willing to send it to its death?\"</p><br/><p>\"Hehe.\" When Feng laughed awkwardly. \"When did I send Xiao Ying to its death? Us bros will share life and death. As such, we will face all dangers together. If Xiao Ying were going to die earlier, I guess the both of us would have died together, in the end…\"</p><br/><p>Xiu!</p><br/><p>Xiu!</p><br/><p>The obedient Xiao Ying nodded its body twice to express agreement with Chen Feng's words.</p><br/><p>\"You shut up!\" That woman dragged Xiao Ying over and started beating it up. \"You traitorous bastard. All the power coursing within you was given by me! Now you are helping that scammer Chen Feng harm me?\"</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>The pitiful Xiao Ying was ravaged up badly as its body was repeatedly straightened up before being crumpled together again.</p><br/><p>By the side, Chen Feng could only observe a moment of silence for Xiao Ying.</p><br/><p>My pitiful bro, for our final victory, you will have to suffer for now.</p><br/><p>Indeed, this woman here was Ming Yue. With the marriage link established, both Ming Yue and Xiao Ying shared their fate of life and death. Based on Chen Feng's guesses, this ability had teleportation as one of its functions. Moreover, he had also felt a bizarre power in Xiao Ying's body. As such, he had used his Luck Aura to confirm that this was indeed the case. Next… everyone saw what happened.</p><br/><p>Of course, as a consequence, both of them would be beaten up by Ming Yue. She couldn't kill them, but if she wanted to beat them up badly or even cripple them, that was possible. Therefore, this was quite a risky move. If there were any other options, Chen Feng would not have dared to do this. Unexpectedly, they had happened to drag Ming Yue over just as she had been in the shower. This was truly…</p><br/><p>As for Jin Dian, he was already dumbstruck as he witnessed all this. What on earth was going on? This beautiful woman that had just appeared was so terrifying. As for that so-called Redmoon… it was actually capable of f*cking moving?!</p><br/><p>At the same time, he had finally gotten a clear look at how terrifying this woman was as well. Different from Chen Feng, this woman here seemed to be radiating from her very marrow the splendor of a person so high above others. He had only felt a similar feeling from the leader of the Mysterious Organization before. That was the aura of a superexpert. That was… an aura above A class.</p><br/><p>Moreover, from her earlier words saying how the power of that red thing had been granted by her very self—in other words, that Redmoon's peak A-class power was… This also explained the reason Redmoon possessed peak A-class power yet was incapable of utilizing it; that was simply not its original power.</p><br/><p>As his thoughts reached here, Jin Dian's hands started shuddering. A mere portion of her power was already peak A class? How terrifying was this woman, exactly? He checked his wristband. Time was still passing slowly. There were still five minutes left. Never before had he ever wished that time would pass faster. Now he was the one wanting to drag this out.</p><br/><p>Senior Soul… please arrive faster. I can't last any longer.</p><br/><p>With a bitter expression on his face, he pressed the SOS button. As for everyone else? They had already hidden somewhere long ago, their bodies trembling in fear. Even an A class was sufficient to plant fear in them. Now that an existence surpassing A class was here, which of these ordinary genetic warriors had the gall to get involved?</p><br/><p>In fact, they were not the only ones afraid. As Jin Dian stole a glance at Chen Feng, he noted that Chen Feng was standing by Ming Yue's side rather cautiously as well. Everyone sunk into silence, not daring to say anything. The only noise that could be heard was the sound of Xiao Ying getting beaten up by Ming Yue. Occasionally, her gaze would land on Chen Feng, shocking Chen Feng to the point his body shivered.</p><br/><p>After a long time, finally, Ming Yue calmed down. As for Xiao Ying? Weakly, it gave Chen Feng a single glance before returning to its spiritual room.</p><br/><p>Chen Feng coughed awkwardly.</p><br/><p>It has been hard on you, my bro!</p><br/><p>Now that Ming Yue was done unleashing her wrath, she returned to normal. She started rearranging the simple bathrobe she had draped over her, exposing only her shoulders. Next, she assumed a seductive pose before looking at Chen Feng. \"In truth, if you are still interested in me, I don't mind.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>He mourned Wang Chun inwardly.</p><br/><p>Jin Dian opened his mouth meekly. \"Erm…\"</p><br/><p>\"Oh, yes. There is still you!\" Killing intent started surging out of Ming Yue's eyes as she rubbed her sore chest.</p><br/><p>Jin Dian apologized without hesitation. \"I was wrong! I was trying to beat Chen Feng up. I had zero intention of hurting your esteemed self.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>He had a feeling like this battle had transformed into a playhouse. The present Jin Dian was like a kid that was complaining to the teacher: \"Teacher, Chen Feng bullied me.\"</p><br/><p>Ming Yue merely snorted coldly as a response. \"Hmph!\" Suddenly, she stared grudgingly into the distance. \"It's about time that idiotic Soul arrived, right?\"</p><br/><p>Instantly, Jin Dian trembled. Idiotic… Soul… F*ck, this woman is indeed a senior at that level!</p><br/><p>His heart felt bitter. Finally, he understood the reason all the assassinations attempts on Chen Feng had failed. It wasn't due to Chen Feng being formidable; rather, the person behind him was simply excessively frightening. It was indeed true that every formidable person had an even more formidable backer. Now Jin Dian was thoroughly horrified.</p><br/><p>However, it was rather normal for someone to have a formidable backer. Among the several peak A classes of the Mysterious Organization, which of them was without a formidable backer? Now, the only thing he could look forward to was Senior Soul's speedy return.</p><br/><p>Ming Yue glanced at him and said, \"Don't worry. I won't make any moves on the junior generation,\" seemingly seeing through what he was thinking. With a sneer, she sat down cross-legged and started waiting. \"I will be right here, waiting for Soul to come and do battle with me.\"</p><br/><p>Only at this did Jin Dian breathed out in relief.</p><br/><p>However, he felt that this scene seemed somewhat familiar. What did this scene resemble? Just as he was contemplating, suddenly, Ming Yue's ice-cold gaze landed on him. Instantly, Jin Dian was so terrified to the point he did not even dare to think of anything anymore. He sat upright and still, not daring to move.</p><br/><p>As long as this drags on until Senior Soul's return…</p><br/>\n</div>"}