{"title": "Chapter 351: Heh, You Guys Are Surrounded", "id": 351, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-351-heh-you-guys-are-surrounded", "volume_title": "Volume 4", "body": "<h1>Chapter 351: Heh, You Guys Are Surrounded</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 351: Heh, You Guys Are Surrounded</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>The sound of an explosion stunned countless people. The members of the Mysterious Organization that had remained at their headquarters were all staring at the sky with unbelieving expressions. Somewhere up there, in the sky that had still appeared normal previously, a huge hole had been blasted.</p><br/><p>Xiu!</p><br/><p>Xiu!</p><br/><p>A huge amount of bizarre energy started bursting out of that hole and flooding the Mysterious Organization. At this instant, countless equipment was destroyed.</p><br/><p>Du—</p><br/><p>Du—</p><br/><p>The sound of alarms started reverberating everywhere as the red light of the alarms blazed. A part of the Mysterious Organization started burning as well. The entire Mysterious Organization, at this moment, sank into chaos.</p><br/><p>\"What happened?\"</p><br/><p>\"No idea.\"</p><br/><p>\"I suppose they caught up?\"</p><br/><p>\"Look, they are coming!\" someone shouted with a high-pitched voice after seeing the numerous figures blasted out of the hole in the air. Accompanied by the energy blasting out, these figures started raining down and landing all over the Mysterious Organization.</p><br/><p>\"Quick, start saving them.\"</p><br/><p>\"Yes.\"</p><br/><p>The members of the Mysterious Organization rushed over.</p><br/><p>At the same time, accompanied by a cold snort, Lu Hun and Jin Dian both landed on the ground safely. They merely watched on at the chaos unfolding before them with cold and detached smiles on their faces.</p><br/><p>\"Seems like they are out here now as well.\"</p><br/><p>\"Isn't that just nice?\" Lu Hun had a cold expression. \"If they had traveled along the space turbulence to escape, we wouldn't have been able to do anything. Now that they have instead dropped back into our headquarters, they won't be able to do as they wish anymore.\" He raised his head and stared at the sky enveloped by the green barrier he had erected. As long as his energy barrier stood, Chen Feng's group would have no hope of escaping. Now, they were akin to a turtle in a jar, and capturing them was only a matter of time. Lu Hun commanded, \"Capture them as soon as possible.\"</p><br/><p>\"Understood.\" Jin Dian smiled slightly. \"Senior, don't worry. The tricks that Chen Feng had always been proud of had been continuously foiled. Now, I suppose he has exhausted all his tricks. Furthermore, after dragging this out for so long, the experts of our organization are going to be returning soon. The longer this drags out, the more this will disadvantage him.\"</p><br/><p>\"Good.\" Lu Hun did not comment much. Distantly, a peak A-class expert of the Mysterious Organization could be seen returning. An inescapable net was already prepared, waiting for Chen Feng. Logically, with the current arrangement they had here, Chen Feng's group would certainly die here. However, when one recalled what had previously happened, hadn't every single one of their plans appeared flawless before Chen Feng had proceeded to foil them?</p><br/><p>Lu Hun narrowed his eyes. Chen Feng… This person was too much of a freak. Even if one were to ignore that bizarre good luck he seemed to always possess, he had an astonishing rate of improvement as well. Such a person could not be left alive. Lu Hun would never be able to sit still with this person alive.</p><br/><p>\"Increase our manpower guarding the outer layer by onefold,\" Lu Hun said suddenly.</p><br/><p>Jin Dian blanked. \"Ah? But Senior, if we send more people there, all ongoing missions will need to be stopped. What should we do with the losses the organization will suffer as a result?\"</p><br/><p>Lu Hun had a gloomy expression. \"I will take on all the repercussions. Presently, they are most certainly lurking somewhere near our outer layer. Send more A-class warriors there. We must not allow them to escape.\"</p><br/><p>\"All right,\" Jin Dian answered.</p><br/><p>Lu Hun nodded. \"Go fast, then.\" He was clear that despite the strength of Wang Yao and Ming Yue, their team of three had a fatal weakness: Chen Feng. Regardless of the tricks he had once used to kill A classes, he was essentially still a C class. The strongest combat power he could erupt with was merely B class.</p><br/><p>Chen Feng… this time, I wonder where can you escape?</p><br/><p>With all the members of the Mysterious Organization working together, order was soon restored to the chaotic headquarters.</p><br/><p>With the continuous return of their members, the combat power of the Mysterious Organization was now much higher than it had previously been. To add salt to the wound, another peak A-class expert had returned. Now, with the successive return of their experts, the Mysterious Organization had finally reverted back to its original form as an extremely scary organization.</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Radiance swirled around without stop, scanning the area in search of Chen Feng's group. Almost all members of the Mysterious Organization were looking for Chen Feng. Some of their scouts were already searching the entire headquarters. Chen Feng simply had no hope of escaping.</p><br/><p>\"Was that area searched?\"</p><br/><p>\"I suppose.\"</p><br/><p>\"What do you mean by suppose? Go search it again.\"</p><br/><p>\"All right.\" The scout helplessly complained, \"Every nook and cranny of the headquarters must be searched. On top of that, the scanners must be brought along and our search process must be recorded. Is all this even necessary?\"</p><br/><p>\"What do you know? Do you know who Chen Feng is? He is our organization's most wanted person,\" someone said.</p><br/><p>The scout blanked. \"Wasn't that Wang Yao?\"</p><br/><p>\"Didn't Wang Yao end up captured by us? She might be strong, but as long as one is stronger than her, one will be able to defeat her. As for this Chen Feng, he is so weak you don't even know what you should do with him. However, it was this very weak him that killed peak A-class warriors. This time, by his lonesome self, he was even able to rescue Wang Yao from our captivity. This person is truly dangerous. Moreover, you know what? Up until now, we have yet to figure out how he entered the headquarters.</p><br/><p>\"Oh, you asked for the reason for recording the search process? Hehe, it's quite simple. That is because the instant we encounter Chen Feng, we might die directly before we can even transmit any messages. In order to ensure accurate updates on our search results, each of us must be connected to the internet at all time. Each of us must be recording our search process as well. The moment something seems off with one of our recordings, the others will be able to conclude that something must have happened.\"</p><br/><p>As that person finished his words, everyone around him sunk into silence. Several scouts gulped. As they looked around, their bodies chilled. This Chen Feng was actually this terrifying! When they once again resumed their searches, they were much more serious and careful at their jobs than before. However, no matter how they searched, Chen Feng's group was nowhere to be found. Three living people had seemingly vanished just like that.</p><br/><p>Lu Hun sneered. \"Don't worry. They will be found soon…\" The members of the organization were not the only ones searching; Lu Hun was searching personally as well. His spiritual sensor was much more powerful than these members'. Within a short period of time, four-fifths of the huge Mysterious Organization had already been searched by him. Only one-fifth of the Mysterious Organization was left.</p><br/><p>Lu Hun pointed at the map. \"Here. Send more people over.\"</p><br/><p>\"Yes.\"</p><br/><p>The members of the organization rushed over. However, they had barely arrived there before losing all contact with everyone else. When they were found, only corpses remained.</p><br/><p>\"They have finally appeared!\"</p><br/><p>Rather of being alarmed, everyone was overjoyed.</p><br/><p>\"Chen Feng's group is indeed here!\"</p><br/><p>Jin Dian was stirred. \"Very good. Let us catch this turtle trapped in the jar. Hahaha.\"</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Groups of Mysterious Organization's members started approaching that place. Lu Hun and the rest followed along noiselessly. However, just as the remaining unsearched area was shrinking, suddenly, a huge explosion reverberated.</p><br/><p>Bang!</p><br/><p>At the center of the Mysterious Organization, at the command center containing all sorts of information, a huge explosion had unexpectedly erupted.</p><br/><p>Everyone turned around abruptly.</p><br/><p>\"What's going on?\"</p><br/><p>Hum—</p><br/><p>There, a firm energy barrier had already been erected. That huge building that was the command center was totally enveloped by that barrier, and a familiar voice was broadcasting from that building.</p><br/><p>\"Hello, hello, hello. Can anyone hear me? Mhm… my dear friends of the Mysterious Organization, I have a very unfortunate announcement for you all. This place has been conquered by me. What I mean is… this building... Hey, hey, Ming Yue, what are you doing…\"</p><br/><p>Suddenly, Chen Feng's speech stopped. Next, a female's voice could be heard.</p><br/><p>\"Let me play around with this. Haha, dear brothers of the Mysterious Organization. You guys have been surrounded by us, yo.\"</p><br/><p>At this, the expressions of the Mysterious Organization's members darkened.</p><br/><p>Surrounded? How the f*ck are the three of you surrounding over ten thousand of us?</p><br/><p>At the same time, they realized that they had been tricked by Chen Feng. Chen Feng had first created an impression that they were at the outer layer of the headquarters before silently heading toward the Mysterious Organization's center and snatching control of their command center.</p><br/><p>However, what could Chen Feng's group accomplish even with the command center? That was a mere building. Even if it had a strong defense system, so what? Regardless of the strength of the defense system there, it would still require an energy supply. There were thousands and thousands of the Mysterious Organization's members out here. As long as they attacked without stop, that building's energy supply wouldn't last.</p><br/><p>Chen Feng… what exactly are you planning?</p><br/>\n</div>"}