{"title": "Chapter 353: Death Without the Corpse Intact!", "id": 353, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-353-death-without-the-corpse-intact", "volume_title": "Volume 4", "body": "<h1>Chapter 353: Death Without the Corpse Intact!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 353: Death Without the Corpse Intact!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Shua!</p><br/><p>The expressions of the people from the Mysterious Organization changed. Those two corpses were precisely the members previously assigned to the command center. So Chen Feng had killed them and pretended that Wang Yao and Ming Yue had still been in there? That was truly…</p><br/><p>Finally, they understood what had happened.</p><br/><p>Lu Hun shut his eyes. \"This was my mistake.\" When his green world was used to envelop the entire Mysterious Organization, the scope was too large. Hence, only one function remained: the function to prevent escape. Despite this, this single function was definitely sufficient to stop Wang Yao and Ming Yue's escape. But then, he had chosen to shrink his own green world. Wang Yao and Ming Yue would not be able to escape the green world. However, when he started pulling his green world in, they were instead left outside of his green world. He had been neglectful. It was truly out of his expectations that all these things Chen Feng had done had only been to allow those two to escape.</p><br/><p>Lu Hun looked at Chen Feng. \"Is there a need for this? You can save them, but you won't be able to save yourself.\"</p><br/><p>The distant Chen Feng smiled as he stared at Lu Hun. \"I know that. I never intended to leave in the first place.\"</p><br/><p>Hum—</p><br/><p>Suddenly, Chen Feng's entire body started shining. \"From the moment I decided to come here, I never expected to return alive. Even so… I, Chen Feng, have never suffered any losses all this while! Even the Mysterious Organization must pay a price for my death!\" Chen Feng's killing intent surged as he stared coldly at the people of the Mysterious Organization. \"Perhaps it's time for me to let you all witness what true power looks like. Let the entire Mysterious Organization accompany me in my death.\"</p><br/><p>Shua!</p><br/><p>Chen Feng's whole body started shining dazzlingly with a red radiance that was emitting a peak A-class power. Once again, that alarming power appeared here.</p><br/><p>Not good.</p><br/><p>Everyone's expression changed greatly. All this while, Chen Feng had been giving them an incredibly freakish impression. An example would be this current incident, where he, a mere C class alone, was capable of turning the entire Mysterious Organization upside down. They were too clear on how dreadful an existence Chen Feng was. If a guy like this was performing a suicide attack, how terrifying was it going to be?</p><br/><p>It was a common knowledge that attacks such as self-destruction, blood explosion, and the like were able to unleash a might of tenfold or over a hundredfold the user's original power. Now…</p><br/><p>\"Leave!\"</p><br/><p>Everyone's expression changed greatly, Lu Hun included. He might have had absolute confidence in himself, but he would never choose to face this suicide attack of Chen Feng's rashly. He was sure he had to prevent his body from suffering any sort of injuries here.</p><br/><p>A cruel smile appeared on Chen Feng's face. \"It's too late.\"</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Everyone from the Mysterious Organization retreated in horror. The red radiance intensified. Where Chen Feng stood, nothing could be seen except boundless red. That bizarre red radiance appeared even more freakish as it mixed with Lu Hun's green radiance. The mash of red and green caused fear to rise from the depths of all their hearts.</p><br/><p>Flee, flee, flee!</p><br/><p>All of them retreated frantically. Right at this moment, a silhouette charged out noiselessly. In a low-profile manner, he moved noiselessly. Nobody noticed him. Even Lu Hun and Jin Dian were only able to see a vague silhouette and nothing else.</p><br/><p>Yi?</p><br/><p>An amazed expression appeared on Lu Hun's face.</p><br/><p>At this moment of utmost danger, beyond all expectations, he stopped retreating. Similarly, Jin Dian, who had also noticed this, stopped retreating as well before looking toward the command center. There, in front of that red radiance so bright one couldn't even stare straight at it, a dark shadow could be seen.</p><br/><p>Shua!</p><br/><p>Lu Hun and Jin Dian instantly narrowed their eyes. That red radiance was too dazzling and bizarre, and it was full of a chaotic power. All this combined caused them to be unable to look straight at it. However, when they concentrated their gazes, they were still able to notice something. There seemed to be someone there? A person seemed to be approaching Chen Feng cautiously. Seemingly afraid of being noticed by Chen Feng, he was moving noiselessly, his steps light.</p><br/><p>Ten steps! Nine steps! Eight steps! Seven steps!</p><br/><p>…</p><br/><p>Every single step he took, the red around Chen Feng intensified. Three steps! Two steps! One step! At this point, that red radiance was already akin to a sun as the peak A-class power it was emitting surged to the limits. Just as the red radiance was on the verge of exploding, an abrupt change occurred.</p><br/><p>Pop!</p><br/><p>A light sound could be heard.</p><br/><p>Shua!</p><br/><p>Instantly, all the red seemed to vanish. The brightness of the area reverted to how it had been. Due to the abrupt shift in brightness and that astonishing energy undulation, the eyes of almost everyone there pained and sunk into a short duration of darkness. After a short moment, they recovered their vision. By the time they looked at the command center once again, they were all dumbstruck.</p><br/><p>There, an ice-cold dagger had been stabbed into Chen Feng's chest, right where his heart was.</p><br/><p>Unbelieving, Chen Feng turned around and looked at the figure that had suddenly appeared. From his uniform, he seemed to be someone assigned to the command center as well.</p><br/><p>Chen Feng pointed at him in an unbelieving manner. \"You…\"</p><br/><p>Xiu!</p><br/><p>Chen Feng was knocked onto the ground by that person. Next, he started stabbing Chen Feng's chest without stop as blood continued to spurt out. Outside, everyone was stupefied. Granted, they were unable to get a clear look at Chen Feng, since he was currently sprawled on the ground. However, that stuffy sound of flesh getting stabbed could be clearly heard.</p><br/><p>Chen Feng was seemingly trying to drag this out. \"Who are you…\"</p><br/><p>Pop!</p><br/><p>Another stab.</p><br/><p>\"I, Chen Feng…\"</p><br/><p>Pop!</p><br/><p>Another stab. That person did not reply to any of Chen Feng's words. Coldly, he stabbed Chen Feng without stop, blood splattering around him. After a long while, finally, Chen Feng's voice and the sound of flesh getting stabbed could no longer be heard. At this moment, the entire world seemed to have sunk into silence. Through the window of the command center, a bloodied figure could be seen standing up. That figure walked toward the window before staring at everyone out there, giving off an extremely cold feeling.</p><br/><p>Who is this person?</p><br/><p>They were all incomparably alarmed. Since when had such a person, a firm and decisive person who had not even given Chen Feng a chance to say anything , been a part of the Mysterious Organization? But then, that was understandable. When facing a person like Chen Feng, giving him a chance to talk was akin to courting death.</p><br/><p>All this while, they had wanted to capture Chen Feng. They had planned to find out more about Chen Feng's secrets before torturing him to death, but then again, they couldn't deny that killing Chen Feng in such a clean way was instead the most fitting method of dealing with him.</p><br/><p>Shua!</p><br/><p>That person walked toward the control desk and pressed a button.</p><br/><p>Hum—</p><br/><p>Next, all the defense systems of the command system were deactivated. The energy barrier vanished as well.</p><br/><p>Xiu!</p><br/><p>Xiu!</p><br/><p>Countless figures started streaking forth. Almost instantly, everyone reached the floor that person was in. There, lying on the floor below him, was an ice-cold corpse.</p><br/><p>Chen Feng! He's dead?</p><br/><p>Everyone gulped. This person who had turned their organization upside down and had been planning to drag everyone here to death together with him had died just like that? Jin Dian walked over to take a look. Indeed, Chen Feng was no longer breathing.</p><br/><p>Is this death real or fake?</p><br/><p>Pu!</p><br/><p>He pierced his hand into the corpse's heart. There was no reaction whatsoever.</p><br/><p>Mhm… seems like he's dead for real.</p><br/><p>Lu Hun walked over noiselessly and glanced at the corpse.</p><br/><p>Pu!</p><br/><p>Once again, Chen Feng's body was stabbed. That stiff corpse had no reaction whatsoever.</p><br/><p>Lu Hun raised his brows. \"Dead for real?\" He had witnessed way too many fake deaths by this Chen Feng guy. As far as he was concerned, even the dead could be resurrected using certain unique methods. For example, that figurine Chen Feng had on him.</p><br/><p>Lu Hun snorted coldly. \"Hmph.\"</p><br/><p>Bang!</p><br/><p>A boundless radiance bloomed in his hand.</p><br/><p>Bang!</p><br/><p>A terrifying green energy ball landed on Chen Feng's corpse before exploding. The entirety of Chen Feng's corpse was blasted into countless miniscule pieces.</p><br/><p>\"Only with this can I feel relieved,\" Lu Hun muttered. Jin Dian and the rest exchanged glances and nodded slightly, expressing their agreement.</p><br/><p>Seems like Chen Feng is truly dead now.</p><br/>\n</div>"}