{"title": "Chapter 352: No Escape!", "id": 352, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-352-no-escape", "volume_title": "Volume 4", "body": "<h1>Chapter 352: No Escape!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 352: No Escape!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Shua!</p><br/><p>The command center's energy barrier activated. Looking at the faint barrier enveloping the command center, the members of the Mysterious Organization were all ashen faced. None of them had expected that, while they were hunting for Chen Feng, he would turn around and occupy their command center instead.</p><br/><p>Jin Dian's eyes gleamed coldly. \"He's courting death. Senior, I will deal with the energy.\"</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>Multiple cannons were taken out of storage and aimed straight at the command center. Surprisingly, though, when the cannons were about to be fired, Chen Feng merely smiled calmly.</p><br/><p>Hum—</p><br/><p>An electromagnetic wave flashed past. Instantly, all of the Mysterious Organization's equipment malfunctioned.</p><br/><p>Jin Dian's expression became unsightly. \"Damn it.\"</p><br/><p>Chen Feng actually figured out the controls of the command center in such a short time?</p><br/><p>As the name implied, the command center was the place that regulated the entire Mysterious Organization and thus the most important place in their headquarters. There, countless defense systems were installed. The strongest energy system was installed there as well. It was a place impossible to conquer within a short period of time. Something like the electromagnetic wave used earlier was merely common defense equipment.</p><br/><p>What made Jin Dian doubtful was the fact that even with the top-notch security system with a real-time verification system, Chen Feng had somehow infiltrated their command center. Nobody apart from their own people could even enter it. Disguise? That wouldn't even work.</p><br/><p>Then again, they hadn't even figured out how Chen Feng had infiltrated their headquarters. As they recalled all the seemingly unexplainable feats of Chen Feng all these while, they were sure that this Chen Feng definitely possessed some uncommon ability. If they were able to capture him to study him…</p><br/><p>Jin Dian looked at Lu Hun. \"Senior.\"</p><br/><p>Lu Hun stared at the energy barrier. \"Do it. As long as the barrier is destroyed, they won't be able to escape anywhere.\"</p><br/><p>Jin Dian nodded. \"Yes.\"</p><br/><p>Lu Hun watched on coldly.</p><br/><p>All their equipment and high-energy weapons were now out of order. As such, they could only use their excessive manpower to exhaust the defense barrier's energy supply.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>The people of the Mysterious Organization started surrounding the command center. Countless attacks started landing on it. Instantly, the whole area was flooded by a multi-colored radiance that enveloped the entire command center. The sound of explosions reverberated without stop.</p><br/><p>If everything progressed according to their plan, Chen Feng wouldn't be able to last more than several minutes. However, right at this moment, a cold radiance flashed past.</p><br/><p>Whoosh!</p><br/><p>Whoosh!</p><br/><p>Two people collapsed onto the ground, dead.</p><br/><p>\"Be careful!\" Jin Dian had an ominous feeling and instantly unleashed his peak A-class power to forcefully stop the attack coming toward him. It was actually an attack launched from the command center, an energy arrow.</p><br/><p>Jin Dian had an ominous feeling. \"Weapon?\"</p><br/><p>There's a weaponry system in the command center as well?</p><br/><p>\"I thought only defenses were allowed to be installed in the command center?\" Lu Hun asked.</p><br/><p>Jin Dian smiled bitterly. \"I have no idea either. In our records, only defense equipment has been allowed to be installed in the command center. If so, this energy arrow…\"</p><br/><p>Whoosh!</p><br/><p>Whoosh!</p><br/><p>Two additional cold radiances shot out, and another two warriors collapsed onto the ground. What was scary was the fact that, when the energy arrows landed, they would explode, damaging their surroundings as well.</p><br/><p>Weapon! There actually existed a weaponry system in their command center!</p><br/><p>\"Are you sure this is a weaponry system?\"</p><br/><p>\"Yes.\"</p><br/><p>After receiving the confirmation from the weaponry department, Jin Dian was alarmed.</p><br/><p>No wonder Chen Feng had aimed to occupy and lock down their command center. If a weaponry system was installed there and Chen Feng chose to unleash the weapons toward the entire headquarters…</p><br/><p>At this thought, Jin Dian's expression changed. He looked at Lu Hun. \"Senior.\"</p><br/><p>Lu Hun's gaze darted around. \"All right.\" Initially, they believed that Chen Feng would be trapped here until his death. Unexpectedly, these idiots had actually broken the rules of their organization and installed a weaponry system in their command center. Lu Hun snorted coldly. \"Trash.\"</p><br/><p>However, Chen Feng, do you think that this is sufficient? How naive!</p><br/><p>Shua!</p><br/><p>Lu Hun's hand reached out.</p><br/><p>Hum—</p><br/><p>The green radiance enveloping the entire headquarters started shrinking. From a diameter of 10 kilometers, it shrunk until only several hundred meters were left. With this, the green radiance intensified.</p><br/><p>Lu Hun waved his hand calmly. \"Condense.\"</p><br/><p>Shua!</p><br/><p>Next, the green radiance enveloped the entire command center and the few buildings around it. The initially dim green radiance became brighter. The power of this green barrier of his was indeed astonishingly dreadful when all of it was concentrated to this small area.</p><br/><p>Jin Dian glanced at the green barrier and knew that with this Chen Feng was finished. Senior Soul was simply too powerful. This energy barrier was something he wouldn't be able to penetrate even after attacking with his full power. This was how powerful the legendary existence Soul was.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Countless energy arrows shot out of the command center. This time, though, all the energy arrows were blocked by the green barrier. Instantly, all the arrows started exploding. Unfortunately, no damage was done. The power of the arrows and the barrier were simply in two different leagues. Weaponry system? Before Soul, it was reduced to nothing but a joke.</p><br/><p>Lu Hun's gaze concentrated on Chen Feng standing behind a certain window of the building. \"Now, how are you planning to escape?\" Both their gazes met, seemingly creating sparks midair, and Lu Hun sneered. \"You won't be able to escape.\"</p><br/><p>Chen Feng smiled. \"Are you certain?\"</p><br/><p>Presently, Lu Hun had recovered the former air of arrogance he had always had around him. \"Naturally.\" Casually, he said, \"Within the zone covered by my green radiance, you have no escape routes. Everything is under my control. For example, the underground tunnel you are trying to dig.\"</p><br/><p>Lu Hun waved his hand lightly.</p><br/><p>Bang!</p><br/><p>Instantly, a certain underground tunnel below the command center collapsed. At this, Chen Feng's expression changed.</p><br/><p>Lu Hun smiled toyingly. \"Do you believe that my green radiance will only work aboveground? This green world is a spherical zone, with me as the center. Within this zone, I am unequaled.\"</p><br/><p>Bang!</p><br/><p>With a single point by Lu Hun, the entire command center trembled. Only when the radius of the green world shrunk from covering the entire headquarters to only covering this small area here would Lu Hun's control over his green world reach its peak. The initial barrier that had only been able to prevent Chen Feng's escape transformed into some sort of domain. This was the true strength of Lu Hun.</p><br/><p>Shua!</p><br/><p>Lu Hun waved his hand, and the air in front of him started twisting. The moment the green world was completed, Lu Hun could already conclude how this would end. Regardless of who it was, even a superexpert at his level, that person would not be able to escape his green world. Surprising him, Chen Feng instead smiled at this instant.</p><br/><p>Lu Hun frowned. \"Mhm?\"</p><br/><p>Chen Feng smiled. \"Who told you that I'm planning to escape?\"</p><br/><p>Not escaping?</p><br/><p>Before Lu Hun could even react to Chen Feng's words, distantly, an astonishing aura appeared.</p><br/><p>Bang!</p><br/><p>Bang!</p><br/><p>Two familiar powers could be felt erupting.</p><br/><p>The two powers had erupted at the remaining one-fifth of the area they hadn't searched earlier. That was the only place they hadn't searched after the collapse of the space tunnel. There…</p><br/><p>Xiu!</p><br/><p>Xiu!</p><br/><p>The two streaked away and vanished instantly.</p><br/><p>\"It's them!\"</p><br/><p>The expressions of Lu Hun and the rest changed greatly. Those two were Wang Yao and Ming Yue!</p><br/><p>\"How is that possible?\" Jin Dian cried out in alarm. When had those two escaped? When Chen Feng had broadcast his voice earlier, he had clearly heard Ming Yue's voice. How could they…</p><br/><p>Shua!</p><br/><p>Everyone's gaze landed on the command center. There, on two chairs behind Chen Feng, two figures were seated. Due to the distance and the barrier around that building, they hadn't been able to get a clear look at the two figures. However… weren't those two Wang Yao and Ming Yue?</p><br/><p>\"Are you talking about them?\" The beaming Chen Feng turned the chairs around. Next, two corpses fell out of the chairs.</p><br/>\n</div>"}