{"title": "Chapter 365: Cooperation", "id": 365, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-365-cooperation", "volume_title": "Volume 4", "body": "<h1>Chapter 365: Cooperation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 365: Cooperation</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Jin Dian looked at Chen Feng. \"How about you? Since that place is now unsafe, there is no need for you to take this risk and go there.\"</p><br/><p>Chen Feng shook his head. \"Don't worry. If there are no problems with our initial investigations, an expert will never appear at a place like that.\"</p><br/><p>Jin Dian nodded. \"True.\"</p><br/><p>The undulation that had appeared there a while ago was the only reason that place's popularity had suddenly increased. Based on their guesses, those undulations might have been caused by some unique B-class mutated beasts. As these mutated beasts likely possessed an extremely pure energy within them, almost anyone could directly devour them to increase their strength. An energy this pure was coincidentally the most fitting for the breakthrough of peak a C-class warrior as well.</p><br/><p>When they had first discovered this, the Mysterious Organization had sent someone there to capture some of these beasts. Unfortunately, they hadn't even gotten a clear look at the beasts before they had fled without leaving a trace behind. Ultimately, their investigation had concluded that due to these beasts being too pure, they were extremely sensitive to foreign auras. As long as they sensed anyone stronger, these beasts would hide themselves and never appear. Hence, it was quite possible that they would not encounter even a single B-class genetic warrior there. Those deployed by the Genetic Union would most probably be comprised of C-class genetic warriors.</p><br/><p>Hence, this was quite a profitable mission to join. Could those discovered life forms truly help C-class genetic warriors in their breakthroughs? How many of these life forms were there? Were these beasts or a whole different race? All this had to be ascertained. With Wang Feng's present strength, even if he encountered those from the Genetic Union, there was nothing for him to fear.</p><br/><p>Jin Dian pondered and said, \"Be vigilant. If possible, try to spare those three.\"</p><br/><p>Chen Feng raised his eyebrow. \"Mhm?\"</p><br/><p>Jin Dian continued, \"Indeed, the organization will not do anything if you kill them. However, for these three to have been the ones chosen from the factions supporting them, it is apparent that their backers are not ordinary people. You must take this into consideration before taking any action.\"</p><br/><p>What Jin Dian said was quite easy to understand. He was essentially telling Chen Feng that if these three were killed, it was likely that the experts backing them would be provoked. Chen Feng would have to consider if he was willing to take on the consequences of killing them.</p><br/><p>\"I thought all signals are blocked in those unknown regions?\" Chen Feng asked.</p><br/><p>Jin Dian nodded. \"Yes. However, there still exist certain abilities capable of finding out the true killer of those three if they end up dead.\"</p><br/><p>Chen Feng nodded. \"Mhm… understood.\" He was aware that this was a reminder from Jin Dian. \"Many thanks.\"</p><br/><p>Next, Chen Feng stepped into the connecting tunnel. Based on the set route, he selected the connecting node to the newly discovered training camp. After arriving, he walked out of the cave connected to the node. The sight of a region enveloped by a primal and chaotic aura welcomed him.</p><br/><p>This is what an untamed region looks like?</p><br/><p>Chen Feng was amazed. This was the very first time he had entered an untamed region on this planet. He had yet to even start doing anything when he noticed that there were three people waiting for him with unsightly expressions. He glanced at them and noted that these were the same three idiots that were on this mission with him.</p><br/><p>\"Something to say?\" Chen Feng asked coldly.</p><br/><p>\"Cooperate,\" the leader stated calmly. \"After arriving, I sensed an unordinary aura. There might be some dangers lurking around. This place is probably even more dangerous than we imagined. Hence, after discussing, we decided that we can give you a 30% share of the resources we find here.\"</p><br/><p>Chen Feng narrowed his eyes. \"Giving me 30%?\" There were four of them. As such, a share of 25% per person would be the most logical option. If he were given 30% of the share, how were the three of them supposed to split the remaining amount?</p><br/><p>The leader pointed at the other two. \"The two of them are comparatively weaker. I am the strongest. Hence, I will be getting 30% of the share. I have heard of your strength as well. Since your combat power is not any lower than mine, both of us can each receive 30% of the share and they will each receive 20% of the share. The share is decided based on what we bring to the table. Are you satisfied with this arrangement?\" He stared into the distance and added, \"My ability is capable of giving me an early warning of any potential dangers. Earlier, with my ability, I sensed that something seems off here.\"</p><br/><p>Oh? Chen Feng started pondering. He was somewhat surprised that these three had changed their attitude so fast. He had initially believed that, with their tempers, they would rather die than acknowledge their deficiencies.</p><br/><p>It seems like they are not as simple as they appeared to be after all.</p><br/><p>At this thought, Chen Feng's sense of vigilance heightened. However, after pondering, he found that he could only agree with their proposal. The amount of resources available here were not unlimited. If he insisted on working alone, he would truly be their competitors. As such, he would need to battle them for real to obtain the resources he wanted. To get rid of the competition, he would have to kill all of them.</p><br/><p>Naturally, Chen Feng wouldn't have been bothered if these three had been the only ones he needed to worry about. However, if there were outsiders exploring this place as well… Slowly, a plan formed in Chen Feng's mind.</p><br/><p>\"Let me introduce us. I am Ri Guang, and they are Yue Hua and Xing Hui. Although the three of us are only C-class warriors, we are all capable of transcending classes to battle those of a higher class. Although we are not as powerful as you, we are still capable of dealing with ordinary B-class warriors.\"</p><br/><p>The leader finished the introduction. Chen Feng narrowed his eyes as he recognized this name. He had once heard from Xie Zhongtong that this was a person with an extremely powerful backer. It was said that his backer was a top-notch expert that was at level similar to Jin Dian.</p><br/><p>Instantly, Chen Feng understood the reason for Jin Dian's warning. No wonder Jin Dian warned me beforehand. If he killed this person, the backer would look for Chen Feng for revenge. That would be troublesome to deal with. It was quite likely that he would not be able to directly kill them now that this fact had been revealed to him. On the other hand, it would be a good choice to temporarily work with them.</p><br/><p>Chen Feng accepted their terms. \"I agree. However, I hope that none of you are playing any tricks. Otherwise…\"</p><br/><p>The three of them exchanged glances and reached an agreement. \"No problem.\"</p><br/><p>Since they had decided to cooperate, Ri Guang forthrightly stated, \"Sorry about earlier. Suddenly having so many resources taken away from us to be shared with someone else, we failed to control our anger. That resulted in us threatening you when you first arrived.\"</p><br/><p>Chen Feng waved his hand magnanimously. \"Forget about that.\" As for the sincerity of this apology, none of them truly cared.</p><br/><p>\"I will get straight into the main topic then.\" Ri Guang lowered his voice and continued, \"Earlier, just as we prepared to enter, we felt something off. After Xing Hui did some investigating, he found that, within this untamed region, a trace of the aura of outsiders could be felt.\"</p><br/><p>Oh?</p><br/><p>Chen Feng sunk into a solemn mood.</p><br/><p>The Genetic Union has arrived so fast as well?</p><br/><p>Ri Guang split apart the chaotic aura pervading the air. \"Look at this.\" There, among a certain bush, the faint trace of an attempt at concealment could be seen. When light was shone on it, a concealed footprint could be seen. Evidently, someone else had been here.</p><br/><p>Chen Feng narrowed his eyes. The people of the Genetic Union indeed arrived first! Was this the reason Ri Guang's group had taken the initiative to reduce their share, to gain Chen Feng's cooperation?</p><br/><p>\"There are ample resources available here. Even if we ignore the energy pervading the air, even here, a trace of that so-called lively and pure energy can already be sensed. However, before we start harvesting the resources, we must first get rid of those outsiders.\" Ri Guang's expression was cold as he said this. Regardless of who it was, the Genetic Union or some other third party, anyone wishing to compete against them for these resources was seeking death.</p><br/><p>\"Good,\" Chen Feng agreed. Cautiously, they trailed the footprints. Xing Hui seemed to be rather good at this. Noiselessly, he led them as they approached the outsiders. After advancing for a while, the faint sound of activity could be heard.</p><br/><p>There are indeed outsiders here! They sunk into a solemn mood. Distantly, among the bushes, several faintly discernible silhouettes could be seen.</p><br/>\n</div>"}