{"title": "Chapter 368: Harmony", "id": 368, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-368-harmony", "volume_title": "Volume 4", "body": "<h1>Chapter 368: Harmony</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 368: Harmony</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Flee! Flee! All of them were frantically fleeing. None of the people capable of reaching this level were idiots. As such, when both the Mysterious Organization and the Genetic Union had been facing off earlier, each of them had still held back some of their strength in case a third party were to appear.</p><br/><p>However, it had truly been beyond all their expectations that such a third party would be the one to appear. Barbarians? Barbarians doing the deed out here? F*ck this shit! They nearly collapsed emotionally as they were chased after by the two barbarians. All their attacks on the barbarians were ineffective. The energy-based attacks were incapable of doing any damage upon landing on the barbarian's body.</p><br/><p>It was apparent that the barbarian was immune to all sorts of energy-based attacks. Even more alarming was the fact that this barbarian possessed such astonishing speed as well. Any single one of them who was a step slower when fleeing would absolutely die. None of them dared to stop. Even when they were running without stop, the barbarians were still closing the distance. While running, some of the members of the Mysterious Organization and Genetic Union stumbled upon each other. Earlier, they had still been fighting each other in a heated battle. Now, though, only despair could be seen in their respective opponent's eyes. At times like this, they were no longer bothered with allegiance or rivalry.</p><br/><p>They despaired.</p><br/><p>\"What should we do?\"</p><br/><p>Ri Guang bellowed, \"Let's separate. There are only two of them. If we run separately, some will definitely be able to escape. The ones who manage to escape successfully must return and ask for reinforcements as soon as possible. As for the two that the barbarians decide to continue chasing…you can only pray for your life.\"</p><br/><p>Shua!</p><br/><p>After finishing his words, Ri Guang was the first to separate from the group and run in a different direction.</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>The rest hastily changed their directions as well.</p><br/><p>Unfortunately for Ri Guang, the barbarians followed after him with no hesitation. Instantly, Ri Guang's expression greened. Just as he was running, suddenly, he felt himself step on something hard. He did not pay much attention to it, but immediately after that, an indignant howl resounded.</p><br/><p>He turned around to take a look. Immediately, his expression changed greatly. From the bush he had just stepped on, another pair of buff and sturdy-looking barbarians appeared.</p><br/><p>???!</p><br/><p>Ri Guang was dumbfounded.</p><br/><p>The heck? What's going on? In other words, all the bushes here contain…</p><br/><p>He looked around and noted that there were countless trembling bushes amid this region enveloped by a chaotic aura.</p><br/><p>Could it be…</p><br/><p>Howl!</p><br/><p>The barbarians were nearing Ri Guang. Seeing how he couldn't escape the four barbarians chasing after him as everyone else took this opportunity to escape, he became furious. They had actually acted on his words and left him to die here?</p><br/><p>Ri Guang clenched his teeth and said, \"If so, none of you need to leave!\"</p><br/><p>Bang!</p><br/><p>His foot trembled and, instantly, a terrifying shockwave started spreading under his foot. The shockwave did not deal much damage to the surroundings, but it was sufficient to cut down all the bushes. Instantly, the area filled with bushes was cleared and transformed into a grassland instead. And on the newly formed grassland, numerous naked buttocks appeared…</p><br/><p>\"Howl—\"</p><br/><p>Numerous indignant roars thundered. As for the rest of them that had been preparing to escape, they were all stupefied.</p><br/><p>\"Scr*w you, Ri Guang!\" Xing Hui and Yue Hua cursed before they started running crazily. Previously, they had merely been fleeing. Now, though, they were truly running for their lives.</p><br/><p>\"What on earth are those things?\"</p><br/><p>\"No idea.\"</p><br/><p>\"I have never heard of the existence of such a race.\"</p><br/><p>\"Ah, ah, ah, ah.\"</p><br/><p>\"I don't want to be captured by them, ah, ah, ah, ah.\"</p><br/><p>They ran frantically. They recalled what the barbarians had been doing earlier. Looking at how huge and sturdy the bodies of these barbarians were, they were unwilling to even imagine what their fate would be if captured. That was a scene they did not even dare to imagine. Suddenly, a chaotic noise could be heard distantly.</p><br/><p>\"Someone else is here.\"</p><br/><p>They cried tears of joy after realizing that someone else was here. Normally, what explorers feared the most when exploring an untamed region was the appearance of a third party. Now, though, they no longer cared about the so-called exploration mission or the training camp. In their current circumstances, the prospect of seeing someone else made them so happy it felt like they were meeting their family.</p><br/><p>Hahahaha, someone else is here!</p><br/><p>They did not even care if the newcomers were on their side or not. As long as these newcomers could delay the barbarians…</p><br/><p>However, when they finally saw those newcomers clearly, their faces greened from shock. The identities of these newcomers were no longer of any importance. What was important was the fact that behind these newcomers were another group of barbarians.</p><br/><p>\"F*ck, f*ck, f*ck!\"</p><br/><p>\"Another group!\"</p><br/><p>\"Run!\"</p><br/><p>\"Separately?\"</p><br/><p>\"What's the freaking point? There are more barbarians than us. Just run straight to the exit.\"</p><br/><p>\"True, true, true.\"</p><br/><p>They started running frantically in the direction they had come from. The Genetic Union, Mysterious Organization, and the passersby were all working together now.</p><br/><p>This guy…</p><br/><p>Suddenly, Chen Feng recalled the deductions the Luck Aura had given him previously.</p><br/><p>\"Are you the one who caused the conflict between the Genetic Union and Mysterious Organization here?\" Chen Feng asked.</p><br/><p>Shua!</p><br/><p>The rest turned their head uniformly and looked his way.</p><br/><p>\"I think so,\" thew newcomer answered meekly.</p><br/><p>\"F*ck!\"</p><br/><p>Instantly, the rest felt like kicking him out of the group.</p><br/><p>That person was tearing up in an extremely pitiful manner. \"Dear big brothers, is there a point in saying this at a time like this?\" The only thing lacking to complete this pitiful appearance would be him slapping himself. He said, \"Yes, yes, I'm an ass for setting you guys up. However, who would have guessed that there were so many barbarians here?\"</p><br/><p>Everyone else: \"…\"</p><br/><p>They turned around to look at the howling barbarians behind them. At times like this, none of them could be bothered with actually giving this guy a kick. It was far more important to focus on running.</p><br/><p>**</p><br/><p>At the same time, a group of big shots in the Genetic Union were discussing the jurisdiction of the newly discovered training camp after it would be tamed.</p><br/><p>\"With them there, there won't be any problems.\"</p><br/><p>\"The Mysterious Organization might…\"</p><br/><p>\"Hehe, they just lost their headquarters. I doubt they can put any effort into exploring a new training camp at a time like this.\"</p><br/><p>\"True.\"</p><br/><p>\"If so, we shall let those youngsters compete properly, then.\"</p><br/><p>\"True.\"</p><br/><p>\"They should be finished with the training camp by now, right?\"</p><br/><p>At a different part of the world, similarly, those from the Mysterious Organization were also rather confident in the strength of Wang Feng's group. Despite the low amount of people they had sent, each of them was one of the absolute elites among the Mysterious Organization's C-class warriors. Furthermore, with fewer participants, it would be easier for them to move around. As such, this might even be superior to bringing more people there. For instance, assassinating an enemy in confusion was much more accomplishable by a smaller number of people. This time, they absolutely had to be successful.</p><br/><p>\"This time, we must grab control of this training camp.\"</p><br/><p>\"Training camps are places where only the initial batch will reap the greatest rewards. Even the subsequent batches will be able to obtain quite a number of good rewards. However, the more batches we send, the more the resources there will deplete. As this continues, the training camp will no longer be as valuable. Do you understand?\"</p><br/><p>\"Yes.\"</p><br/><p>\"Hence, even the next batch we send there must obtain victory as well.\"</p><br/><p>\"How about the Genetic Union mentioned by Senior Tang?\"</p><br/><p>\"Don't worry. This is a place the Genetic Union can't discover. Moreover, even if the union has truly appeared there, they might not be the match of the people we sent anyway. We have Wang Feng there, hehe… and there's also Ri Guang's group. All of them are competent combatants. Perhaps they are already done with it by now.\"</p><br/><p>Somewhere else, a peaceful-looking old man emitting a sagely aura was standing loftily, facing the blue dome.</p><br/><p>\"Hehe.\"</p><br/><p>\"The Mysterious Organization and Genetic Union are busy competing with each other. Unknown to either of them, they are all idiots. This time, with Little Fang making his move, he will most definitely be the one profiting from their competition. Truly excellent.\"</p><br/><p>This old man appeared rather gratified. With a flick of his wrist, he raised his hand and started calculating with his fingers. \"Looking at the time, they should be done by now, right? If everything has progressed according to plan, the Mysterious Organization and Genetic Union should have killed each other off. He should be reaping the rewards and concluding the mission by now. If they are able to obtain all the resources there this time, Little Lu's future will be completely transformed. The future belongs to you youngsters, after all…\"</p><br/><p>The old man lamented.</p><br/><p>Unfortunately, unknown to any of the three parties, far away from all of them, in the unknown region, the three initially opposing factions were now working together amicably, running together in the direction of hope…</p><br/>\n</div>"}