{"title": "Chapter 369: Breakthrough! Surpassing A Class!", "id": 369, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-369-breakthrough-surpassing-a-class", "volume_title": "Volume 4", "body": "<h1>Chapter 369: Breakthrough! Surpassing A Class!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 369: Breakthrough! Surpassing A Class!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At a certain location, Wang Yao was seated cross-legged. A terrifying power was swirling around her body. Akin to two dragons, the power of flame and space coiled around her, condensing without stop to form an awe-inspiring power. Soon, when both powers reached a certain level of might and were more and more interwoven together, they started fusing.</p><br/><p>Bang!</p><br/><p>Instantly, a terrifying power surged, causing even the sky itself to tremble. A loud sound reverberated through the vicinity, causing anyone who heard it to tremble in fear.</p><br/><p>\"Ao—\"</p><br/><p>\"Howl—\"</p><br/><p>One howl after another could be heard. All the mutated beasts in the area became agitated, seemingly sensing something that had caused them all to be incomparably agitated and horrified. All of them started charging in Wang Yao's direction. Before these beasts could even approach her, with a flash of red, the whole world seemingly sunk into silence. The serene Wang Yao stood up. Her initially peak A-class power vanished as she seemingly transformed back into an ordinary girl.</p><br/><p>\"Finally… I broke through.\"</p><br/><p>A smile appeared on her face. She had now surpassed A class and reached a level far surpassing the current level of humanity.</p><br/><p>\"It's time I go look for Chen Feng.\"</p><br/><p>After the incident back then, she'd had someone investigate the events of the Mysterious Organization. After she had found out that Wang Feng was the one who had killed Chen Feng, she had stopped worrying. However, it was still rather dangerous for Chen Feng to stay in the Mysterious Organization with his strength.</p><br/><p>\"Since I have already broken through, I will not allow you to suffer any harm,\" Wang Yao muttered.</p><br/><p>Shua!</p><br/><p>The space around her started collapsing. Easily, Wang Yao ripped space apart and stepped into that region enveloped by a primal and chaotic aura. The very moment she arrived, all the mutated beasts in the vicinity became agitated. They were able to sense an extremely horrifying power descending upon this place.</p><br/><p>Wang Yao shut both her eyes. Chen Feng…</p><br/><p>Shua!</p><br/><p>Shua!</p><br/><p>She started scanning the area with her energy, and soon after, she was able to locate Chen Feng.</p><br/><p>She smiled. \"So you are here.\"</p><br/><p>This feeling of strength, how wonderful.</p><br/><p>However, right as she was about to go to Chen Feng, a translucent undulation appeared noiselessly around her and stopped her advance. From the void, an old-looking figure walked out slowly.</p><br/><p>The old man appeared gratified. \"You have finally broken through… Wang Yao.\"</p><br/><p>\"Who are you?\" Wang Yao asked coldly. \"The existence surpassing A class of the Mysterious Organization?\"</p><br/><p>The old man burst out in laughter. \"Mysterious Organization? Young lady, you are indeed adorable.\"</p><br/><p>\"Hmph!\"</p><br/><p>Wang Yao's eyes gleamed coldly. When facing such people who enjoyed playing tricks, she would never stay her hand. Moreover, she was incredibly powerful now and was filled with the confidence of a person who had recently broken through.</p><br/><p>Shua!</p><br/><p>Casually, she slashed down. Midair, the power of space and flame fused perfectly.</p><br/><p>Xiu!</p><br/><p>The perfectly fused power of space and flame bloomed. However, when the attack neared the old man, just like that, it halted and hovered there, unmoving.</p><br/><p>What?</p><br/><p>Wang Yao frowned.</p><br/><p>Space lock? No… this is definitely not the power of space!</p><br/><p>A power capable of freezing her combined power of space and flame, which now surpassed A class, was definitely not something as simple as a brutish power. The law of the energy used to freeze her attack…</p><br/><p>Wang Yao's heart jolted. Midair, her launched attack hovered there, neither exploding nor falling. \"Time?\"Wang Yao grimly asked, \"Who are you?\"</p><br/><p>The old man smiled. \"I'm but a simple old man. From the moment you returned, I have been waiting for your breakthrough. I have been waiting for 11 whole years. Finally, you have broken through smoothly.\"</p><br/><p>Shua!</p><br/><p>Wang Yao's expression changed.</p><br/><p>Return…11 years… this old man…</p><br/><p>Bang! Bang! Bang!</p><br/><p>Wang Yao started erupting in power. She was not planning to give the old man even the chance to talk. All the power available to her was instantly unleashed. However, everything she launched stopped upon reaching the old man, incapable of dealing any sort of damage.</p><br/><p>\"Condense!\"</p><br/><p>With a simple wave of his hand, he rendered all of Wang Yao's attacks ineffective.</p><br/><p>Wang Yao's face tensed. \"Who on Earth are you?\" Even if she had just broken through, she was still an existence surpassing A class. Only after fusing the power of flame and space, fusing her previous and present life, perfectly fusing of her soul and body, perfect fusion of two different powers, only with all this had she become the present her. She possessed a unique and unmatched power. This was her confidence. However… that confidence she had obtained after her breakthrough was completely shattered by this old man. He was actually able to easily stop all her attacks. Who on Earth was this old man?</p><br/><p>\"Child, you still don't know how to properly utilize your power.\" The old man appeared disappointed. \"Well, that's understandable. How could it be possible for you to know how to utilize such a precious power, mhm? Only using the souls of your past and present life as the foundation and using the formidable power of space as the medium of separation will allow this pure power of flame to transform into true power,\" the old man lamented.</p><br/><p>Shua!</p><br/><p>He pointed midair. Next, the two attacks released by Wang Yao that had been frozen in midair started fusing.</p><br/><p>Hum—</p><br/><p>The power of flame and space started fusing, transforming into a translucent flame.</p><br/><p>The old man smiled calmly. \"This is what the true paramount of power looks like.\"</p><br/><p>Shua!</p><br/><p>With a casual wave of his hand, that clump of translucent flame started drifting around the air.</p><br/><p>Ka! Ka!</p><br/><p>All the power Wang Yao was emitting started collapsing. All the power of space she was emitting was shattered. The power contained in that clump of flame was actually so powerful even Wang Yao couldn't resist it.</p><br/><p>The old man appeared pleased. \"I named this flame… Rebirth Flame.\" This was his masterpiece, a masterpiece that had taken 11 years to cultivate. Now it was time for him to harvest the results.</p><br/><p>\"Rebirth Flame…\"</p><br/><p>At his words, a vague understanding surfaced in Wang Yao's brain.</p><br/><p>She had initially believed the so-called rebirth experiment to merely have been one of the many experiments of the Mysterious Organization. It was beyond her expectations that there had been someone else pulling the strings. So all the rebirth and transmigration experiments of the Mysterious Organization had been organized by this person? She looked at the old man's forehead. No diamond was found there.</p><br/><p>\"Even with an existence surpassing A class assisting, out of 3,000 candidates who underwent rebirth, only 10 succeeded. Among them, you are the only one who managed to surpass A class.\"</p><br/><p>The old man appeared gratified. He seemed to be in an extremely good mood, as he had chosen to answer all Wang Yao's questions.</p><br/><p>\"How about transmigration?\" Wang Yao asked suddenly. \"Out of 3,000 candidates who undergo rebirth, only 10 will succeed. If so, among 3,000 candidates who undergo transmigration, how many of them will succeed?\"</p><br/><p>\"Transmigration?\" The old man nodded slightly. \"Up until now, only a single person had succeeded.\"</p><br/><p>\"Who?\" Wang Yao asked, but she already had her answer. She recalled that guy who was similarly as unique a person as she was. A person who had been thrown out to feed sharks after his high school examination yet had been able to make a comeback for no apparent reason before transforming into a genius, a superexpert. Was that a superiority he had gained from transmigration?</p><br/><p>\"Kong Bai.\" The old man paused and continued, \"That child is called Kong Bai.\"</p><br/><p>Wang Yao blanked. \"Ah?\"</p><br/><p>\"Compared to rebirth, I have much higher expectations of transmigration. As such, the investment in it is also much higher. A total of 300,000 candidates were chosen for this. Over a period of 50 years, 300,000 geniuses were transmigrated. However, only 100 of them returned alive. Ultimately, that child is the only one who not only survived but transformed into a superexpert as well.\" The old man appeared to be immersed in his recollection. \"That child is the only one.\"</p><br/><p>Out of the seven chess pieces, only Wang Yao and that child remained. The moment he surpassed A class, the seven chess pieces could once again be gathered. With this, his years of planning would reach completion.</p><br/><p>\"It won't be too far in the future…\" the old man muttered.</p><br/><p>Suddenly, Wang Yao asked, \"Have you never imagined that there might be some oversights in your plan? After all… this is a world heavily damaged by your rebirth and transmigration projects.\"</p><br/><p>The old man's gaze was burning. Oversight? Such a thing was nonexistent for a person of his strength. \"All the chess pieces are constantly under my monitoring. None of them are able to escape their destiny as set by me. That includes you.\"</p><br/><p>Wang Yao merely laughed as a response. \"Ah.\" Suddenly, she recalled the only difference, the only variable in the two lives she had experienced. This old man had always expected that the differences had actually been caused by her; as such, it was natural for him to not expect any sort of oversight. However, she was clear that even the events she had never interfered with were still different from her past timeline.</p><br/><p>For example…</p><br/><p>Shua!</p><br/><p>Suddenly, Wang Yao retreated rapidly and ripped space apart before escaping. The old man was momentarily astonished. Shortly after, he shook his head and chuckled.</p><br/><p>Wang Yao, you are still holding on to hope? Child, do you know that since the moment you underwent rebirth, everything has been progressing according to my plan?</p><br/><p>Shua!</p><br/><p>The old man swaggered after her. Unbeknownst to him, Wang Yao was escaping in Chen Feng's direction.</p><br/>\n</div>"}