{"title": "Chapter 382: Is There a Need?", "id": 382, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-382-is-there-a-need", "volume_title": "Volume 4", "body": "<h1>Chapter 382: Is There a Need?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 382: Is There a Need?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"???\" Shattered? All three of them were dumbfounded. What was going on?</p><br/><p>\"Shattering is one of the effects?\" Chen Feng asked in an inconceiving manner.</p><br/><p>Kong Bai dazedly muttered, \"...If the answer is no, naturally, there is no need to attack. As such, the demonic mirror will shatter by itself.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>Qin Hai: \"…\"</p><br/><p>They glanced at the dazed Kong Bai before looking at the huge roaring beast in the distance. Instantly, they were speechless. In short, as far as the demonic mirror was concerned, Kong Bai was uglier than that huge beast?</p><br/><p>Mhm… this was a feeling one couldn't describe with words. What should they do now, then? Chen Feng and Qin Hai exchanged glances. They could do nothing but smile bitterly. Who could have guessed that the plan to use this super-explosive ability would fail before the ability had even been used? This demonic mirror was truly too excessive! In conclusion, if you were an ugly person, this ability was as good as nonexistent?</p><br/><p>Qin Hai started comforting Kong Bai. \"It is possible that this huge beast is considered handsome among its species.\"</p><br/><p>After all, life-forms of different species couldn't objectively compare their level of handsomeness with another species. If the comparison was made among the same species, it was a much easier feat. As such, Qin Hai guessed that this might be the reason.</p><br/><p>\"Yes, that's possible,\" Chen Feng agreed.</p><br/><p>Only at this did Kong Bai's complexion improve. It was still filled with a grudge, though.</p><br/><p>This damnable demonic mirror. One day, I will teach it a lesson!</p><br/><p>Chen Feng stared ahead. \"Let's think of some other methods. If we have the map of the land of legacy, we might be able to—\"</p><br/><p>Kong Bai interrupted Chen Feng and gnashed his teeth as he said, \"No. Just use the demonic mirror!\"</p><br/><p>\"Ah?\"</p><br/><p>Qin Hai was doubtful. \"But hasn't the demonic mirror…\"</p><br/><p>Kong Fai was feeling indignant. \"I will summon it again. The demonic mirror is not something only the owner can use anyway. I can let others use it as well. I have never handed it to anyone else all this while just to keep this a secret.\"</p><br/><p>Hum—</p><br/><p>Once again, Kong Bai summoned the demonic mirror.</p><br/><p>He controlled the demonic mirror and placed it in front of Qin Hai. \"Qin Hai, you try.\"</p><br/><p>Qin Hai shrugged. \"I don't have any energy in my body.\"</p><br/><p>Kong Bai explained, \"No energy usage is required. The demonic mirror will only use my energy.\"</p><br/><p>Qin Hai: \"…\"</p><br/><p>He raised his head and looked at the serious expression of Kong Bai before sighing and saying, \"Dear demonic mirror, am I better looking than that huge ugly beast?\"</p><br/><p>Shua!</p><br/><p>After he asked, nothing happened. Kong Bai was filled with anticipation. But then, even he himself had no idea what exactly it was that he was anticipating. Anticipating Qin Hai's failure? If so, they might very well die here. Without killing that beast, all of them might die here. However, if Qin Hai succeeded, did it not signify that Qin Hai was better looking than him?</p><br/><p>What should he be anticipating, then? He had no idea as well.</p><br/><p>Hum—</p><br/><p>Suddenly, the demonic mirror started shining.</p><br/><p>Xiu!</p><br/><p>A terrifying beam of light shot out, piercing through the huge beast instantly.</p><br/><p>Bang!</p><br/><p>The huge beast collapsed loudly. Dead!</p><br/><p>Qin Hai was overjoyed. \"Success!\" It had indeed worked! Treble unique damage! This ability of Kong Bai's was truly terrifyingly powerful!</p><br/><p>\"I…\"</p><br/><p>Kong Bai appeared to be at a loss. He looked at Qin Hai's face. He felt that this guy wasn't particularly better looking than him. If even Qin Hai could use the demonic mirror, how had he failed? Oh, right, perhaps, he was right below the standard? For example, Qin Hai's attractiveness rating was 91 and the huge beast's attractiveness rating was 90. Kong Bai would have an attractiveness rating of 89.</p><br/><p>Mhm… that must be it!</p><br/><p>\"Be careful. That distant huge beast is coming over as well,\" Chen Feng stated with a solemn expression. \"Qin Hai, prepare yourself.\"</p><br/><p>\"All right.\"</p><br/><p>Qin Hai was about to ask the question, but suddenly Kong Bai interrupted, \"Wait. Chen Feng, you try this time.\"</p><br/><p>Chen Feng was bewildered. \"Me?\" He was still a person who knew himself. What kind of a person was Qin Hai? He was the favored son of the heavens. Back then, he had been a celebrity producer. Regardless of their body shape, looks, or charm, Qin Hai was far superior to him. How could he hope to compete with such a person?</p><br/><p>It was still fine for him to compete when he had a huge amount of luck value. He would be able to push it with his luck value to the point that Kong Bai started doubting life itself. However, it had been truly difficult for his luck value to finally recover bit by bit. Hence, he was definitely not willing to waste it on something like this.</p><br/><p>Chen Feng laughed bitterly. \"There's no need right?\"</p><br/><p>Kong Bai insisted. \"Come, try it.\"</p><br/><p>Chen Feng rolled his eyes helplessly. \"Fine.\" This Kong Bai guy was obviously unhappy that he had been scorned by the demonic mirror. Now he could only calm himself if Chen Feng were to receive the same amount of scorn from the demonic mirror. Since Kong Bai was the controller of the demonic mirror, Chen Feng could only do as he wished.</p><br/><p>Hum—</p><br/><p>The shiny demonic mirror hovered before Chen Feng. He glanced at it and, in a casual manner, asked, \"Dear demonic mirror, am I better looking than that huge beast?\"</p><br/><p>Hum—</p><br/><p>A radiance flashed out of the demonic mirror.</p><br/><p>Bang!</p><br/><p>A beam of light pierced through the newcomer beast.</p><br/><p>Bang!</p><br/><p>The huge beast collapsed loudly, dead!</p><br/><p>Chen Feng: \"…\"</p><br/><p>Qin Hai: \"…\"</p><br/><p>Qin Hai was dumbstruck with his mouth struck agape.</p><br/><p>This, this, this… In short, as far as the demonic mirror is concerned, I am even uglier than Chen Feng?</p><br/><p>He looked at that ordinary and mediocre face of Chen Feng's, that face that was only slightly above average. How was that face better looking than his handsome and carefree bearing? This was too excessive!</p><br/><p>Kong Bai was bursting with rage. The hell? This was obviously his own ability. Why did it work better when used by others? Oh right, perhaps, this was because these two beasts had different attractiveness ratings? The first beast was obviously an extremely handsome beast! As for this one… it perhaps rated extremely low attractivenesswise. This was why Chen Feng's usage of the demonic mirror was successful. Mhm, that had to be the case.</p><br/><p>Kong Bai comforted himself without stop.</p><br/><p>Hum—</p><br/><p>He summoned the demonic mirror directly and asked, \"Dear demonic mirror, am I better looking than Chen Feng?\"</p><br/><p>Hum—</p><br/><p>The demonic mirror started shining.</p><br/><p>\"Haha, it appeared!\"</p><br/><p>Kong Bai was overjoyed. Indeed, despite him being somewhat lacking in terms of handsomeness compared to Qin Hai, he was still much better looking than Chen Feng. However, surprising him, a row of words was what appeared on the demonic mirror this time.</p><br/><p>Shua!</p><br/><p>Gradually, the words became distinct.</p><br/><p>\"Do you not have an idea yourself how you look?\"</p><br/><p>Next.</p><br/><p>Ka!</p><br/><p>The demonic mirror shattered directly.</p><br/><p>Qin Hai: \"…\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>\"???\"</p><br/><p>Kong Bai was stupefied.</p><br/><p>This is too excessive! You can't be like this! You are too much of a bully! It's fine to be worse off compared to Qin Hai, but I'm even worse than Chen Feng? I am the main character here!</p><br/><p>Kong Bai was filled with a grudge.</p><br/><p>Chen Feng coughed and continued driving the armored buggy ahead. Qin Hai continued helping him observe the surroundings. As for Kong Bai, he was sitting silently in the corner of the car, muttering about something. When Qin Hai accidentally overheard him, he seemed to hear something like \"I am ugly, I am ugly, I am ugly...\"</p><br/><p>He exchanged glances with Chen Feng and could only mourn Kong Bai inwardly. Was there a need for this? How pitiful.</p><br/><p>Bang!</p><br/><p>The armored car streaked forth amidst the darkness. Occasionally, huge beasts would appear. Whenever this happened, Qin Hai would persuade Kong Bai to summon the demonic mirror. As time passed, they seemed to have entered the depths of the land of legacy. Far away, among the dusky region, finally, something else could be faintly discerned.</p><br/>\n</div>"}