{"title": "Chapter 386: A Chance Encounter", "id": 386, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-386-a-chance-encounter", "volume_title": "Volume 4", "body": "<h1>Chapter 386: A Chance Encounter</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 386: A Chance Encounter</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>The huge dragon was no longer there. The city was nowhere to be seen. Chen Feng's group started wandering around the ruins.</p><br/><p>So… this is actually the ruins of the barbarians!</p><br/><p>As they wandered, numerous barbarians could be seen digging around the ruins. When they found some slabs with characters on them or some other never-before-seen items, they would return to their village happily. Based on their understanding, they might be able to trade these things for some good things from the guards of the ruins.</p><br/><p>Hu!</p><br/><p>A chilly breeze drifted past. Despite their strength, Chen Feng's group still felt cold from this breeze. This was an extremely cold place.</p><br/><p>Ka! Ka!</p><br/><p>Nearby, a barbarian was carefully taking out the remains of a huge skeleton from the ground. Next, he swung the skeleton onto his shoulder before walking out of the ruins. From his expression, he had seemingly found something great. In the ground, numerous deep gorges could be seen. A huge battle had apparently happened here in the past. Chen Feng's group exchanged glances with each other as they felt a chill creeping into their bodies.</p><br/><p>This civilization of the barbarians had already been destroyed. Everything they had deduced previously was different from what they saw here. These barbarians here were merely the descendants of the barbarians back then, and they were all looking for traces of their ancient ancestors. As they figured this out, they noted that the threat these barbarians posed to humanity was neglectable. However, a new problem had cropped up. Who was the one who had destroyed the barbarian civilization?</p><br/><p>The scene they had seen outside the barrier was still clear in their minds. That huge dragon in the sky and the countless mysterious seals on the ground—even with a single glance, they could feel how scary those things had been. Now, though…</p><br/><p>Clang!</p><br/><p>Nearby, a barbarian happily pulled out a seal from the ground. As he raised his head and saw Chen Feng's group gazing at him, he was immediately put on alert. He hugged the seal tightly to his chest and, taking quick steps, he left, fearing the prospect of getting robbed by Chen Feng's group.</p><br/><p>Suddenly, Kong Bai pointed somewhere. \"Look.\"</p><br/><p>On a slab so old it was decaying, a vague diagram could be seen. It appeared to be the diagram depicting the battle between some tall and sturdy barbarians and their enemies. However, all the spots of the diagram that were supposed to depict the enemies had been completely shattered. Those people were seemingly capable of erasing any traces of their existence, causing others to not even know where to start looking for them. On the ground, only the remains of the barbarians could be found. No trace of the enemies could be seen.</p><br/><p>\"All their traces have been cleaned up. It is apparent that the attacker was not some monster. Rather, it was a life-form with intelligence.\"</p><br/><p>Chen Feng looked toward a certain destroyed diagram. \"This height…\" The diagram was already extremely indistinct, but from the movement and attacking angle of the barbarian depicted on it, it was quite likely that the enemy was shorter than the barbarian. From this, it could be concluded that the enemy was shorter from the barbarian. From this angle…</p><br/><p>Suddenly, Chen Feng asked, \"Is it possible that the enemies are humans?\"</p><br/><p>Qin Hai shook his head. \"I doubt it. Back then, any human stepping in here would most probably have ended up with their entire army eliminated.\"</p><br/><p>As they were humans themselves, they naturally had a deep understanding of humanity. The history of humanity, the strength of humanity throughout the eras, all these had been clearly recorded. The era in which this barbarian city had existed was most certainly not an era where humanity had reigned supreme. As for this location, this was a location still untouched by even the current humanity, let alone ancient humans. Moreover, as humanity had never been truly destroyed, no such unique ruins of humanity similar to this barbarian ruin existed out there. As such, it was unlikely that the enemies of these barbarians had been humans. As such, this signified that among the unknown regions, there still existed some terrifying existences capable of destroying the barbarian civilization.</p><br/><p>Humanity was developing this planet without stop and were the self-proclaimed supreme rulers of this planet. They had always been complaining that their rate of development was too slow, as they wanted to control all the resources this planet had to offer. However, they had never imagined that these barriers in the form of unknown regions that had limited humanity's development were also the very thing that had been protecting humanity. If humanity were to clash with the civilization that had destroyed the barbarians…</p><br/><p>At this thought, the three of them each inhaled a mouthful of cold air. Suddenly, Chen Feng recalled the fate of the Native Americans in his previous world.</p><br/><p>That group of people that had been living on that continent had never imagined that there would be a day where other humans would cross the ocean to reach them and destroy them to build a new country on that continent. Their expressions became solemn as they thought of the possibility of there existing a mysterious civilization that had destroyed the barbarians.</p><br/><p>Chen Feng's mouth curled up, forming a smile. \"It would seem like we have to do a detailed investigation here.\"</p><br/><p>Kong Bai sneered. \"Naturally.\"</p><br/><p>All three of them were naturally people who prioritized their personal benefits. However, when the scope of what they discovered expanded to the point where the fate of humanity was affected, they would have to find out the truth, even if it was for the sake of themselves.</p><br/><p>\"Regardless of whether that mysterious race exists or not, we must find out the truth,\" Qin Hai stated with a resolute expression. At this time, several barbarians had already taken notice of their group. They were presently near the entrance of the ruins, a place where the comparatively weaker barbarians wandered about, looking for valuable items to be exchanged with the guards. As Chen Feng's group had been standing here for quite a while, they were starting to attract the attention of others.</p><br/><p>\"Go.\"</p><br/><p>They left the entrance, stepping into the inner region of this land of legacy.</p><br/><p>Sha! Sha!</p><br/><p>The sandy breeze became bitingly cold. Within this wind whose origin was unknown, an astonishing power lingered. Chen Feng glanced around and noted that even some of the barbarians couldn't bear staying in this wind for long. The deeper they entered, the more astonishing this chilly wind became.</p><br/><p>\"Be careful.\"</p><br/><p>Qin Hai was walking in front, obstructing the chilly wind for them.</p><br/><p>As for Chen Feng and Kong Bai, they were following behind silently. Since there were still some barbarians around them, they did not dare to use their energy. As such, they could only let Qin Hai take the burden of defending them against the wind.</p><br/><p>Ten meters. A Hundred meters.</p><br/><p>…</p><br/><p>Finally, when Qin Hai nearly couldn't hold on anymore, their surroundings were already devoid of barbarians. The flesh of Qin Hai was as powerful as a middle-tier B class, and even among the barbarians, his flesh could be considered top-notch. Since even he was having difficulty here, it was natural that barbarians were rarely seen this deep into the ruins.</p><br/><p>Kong Bai flipped his wrist. \"Rise!\"</p><br/><p>Hum—</p><br/><p>His unlimited energy supply appeared once more.</p><br/><p>\"Condense!\"</p><br/><p>With a wave, a protective barrier appeared, blocking in front of them. At that, the chilly wind that seemed to be everywhere instantly disappeared around them. Along with the wind, that biting chill vanished as well.</p><br/><p>\"I can still persevere for a while,\" Qin Hai said helplessly. \"There might still be some barbarians here.\"</p><br/><p>Kong Bai snorted. \"What are we afraid of? I don't have the courage to do anything at the entrance, since there are too many barbarians there, but here at this place, regardless of the amount of barbarians that appear, I will be able to eliminate them.\"</p><br/><p>Instantly, Qin Hai was speechless. It would seem like this guy here had truly been beaten up too badly earlier. Right at this moment, suddenly, a returning figure appeared among the chilly wind in the distance. He was a person with thick furs all over his body, a tall and sturdy figure, and a steady bearing. A barbarian had appeared!</p><br/><p>Chen Feng became alert. \"Be careful.\"</p><br/><p>Kong Bai curled his lips and he walked out confidently. \"What are you afraid of?\" After two short seconds, he halted, gulped, and turned around and walked back to them silently. This was because, behind that sturdy barbarian, several tens of barbarians had emerged from the chilly wind as well.</p><br/><p>Kong Bai's mouth twitched. \"The h*ll…\" It couldn't be a coincidence, right? For them to stumble across a returning squad of barbarians? Those returning barbarians were carrying all sorts of different items obtained from the ruins. As they saw Kong Bai, whose body was enveloped by a barrier of energy, they stopped walking and their eyes became vicious.</p><br/><p>This guy is truly a walking disaster…</p><br/><p>Chen Feng was speechless at how inauspicious the mouth of this Kong Bai was. Looking at how things were developing, they would probably get entangled in a bitter battle now.</p><br/><p>Shua!</p><br/><p>The two of them walked forth silently. Several tens of barbarians placed their items on the ground before taking out their weapons with bloodshot eyes.</p><br/><p>Right at this moment, suddenly, the sky brightened up.</p><br/>\n</div>"}