{"title": "Chapter 389: The Riddle of Transmigration", "id": 389, "volume": 4, "url": "http://boxnovel.org/the-strongest-gene-chapter-389-the-riddle-of-transmigration", "volume_title": "Volume 4", "body": "<h1>Chapter 389: The Riddle of Transmigration</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 389: The Riddle of Transmigration</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"I'm only shaving some hair,\" Xiong Da grumbled before walking far away.</p><br/><p>\"You stinky Xiong Da!\" the young lady shouted indignantly. \"Hmph. That guy is called Xiong Da, the commander of Xiong Fort. However, he is normally free and has nothing to do all day long, so he always sticks nearby being an eyesore, \" she explained.</p><br/><p>Xiong Da… Chen Feng frowned. This Xiong Da guy looked somewhat familiar to him.</p><br/><p>\"What are you thinking about?\" the young lady asked as she noticed Chen Feng's expression.</p><br/><p>Chen Feng shook his head. \"Nothing, nothing much.\"</p><br/><p>The young lady smiled and said, \"If there's nothing, you can go check on your friends. They were lying unconscious at the entrance like you as well. I don't know if they have awoken yet or not.\"</p><br/><p>Chen Feng's eyes shone. Friends? He followed the young lady into the room next door and noticed that it was indeed Kong Bai and Qin Hai. Finally, his nerves that had been stretched taut loosened up somewhat. He had indeed not transmigrated to some different world. That had truly given him a huge shock. If he had truly left this world in such an absurd manner, he truly would have collapsed emotionally. As he reached the room, he noted that both Kong Bai and Qin Hai were already awake. Both of them were silently… shaving their leg hairs.</p><br/><p>Chen Feng was somewhat stupefied. \"???\"</p><br/><p>Kong Bai rejoiced. \"Yo, you're awake?\"</p><br/><p>Chen Feng pointed at their legs. \"You guys…\"</p><br/><p>Kong Bai felt helpless as well. \"You're talking about this? D*mn it, after we woke up, our legs became this way for reasons unknown. Moreover, this will repeat every day. No matter how cleanly we shave them, all the hairs grow back the next day.\"</p><br/><p>As he heard this, Chen Feng pulled up his pants up and noted that both his legs were already covered in hair as well. Chen Feng smiled bitterly.</p><br/><p>What is going on here?</p><br/><p>The young lady seemed to notice that they had something they wanted to talk about and smiled before saying, \"You guys talk. If there's anything you need, don't hesitate to call us.\"</p><br/><p>Finishing her words, she left, leaving the three behind.</p><br/><p>Kong Bai shrugged. \"All right. Now, we can start rearranging our thoughts.\"</p><br/><p>All three of them were extremely intelligent people. Despite their unfamiliarity with this place, from the information they had received and some questions they had asked, after comparing the information each of them obtained, they were able to deduce some things. For example, what kind of place was this? This was a place where barbarians and humans existed. The disguise they'd been wearing had vanished long ago. However, that young lady had still rescued them. Moreover, she seemed like a human, yet she was coexisting peacefully with a barbarian. What was going on?</p><br/><p>Human… barbarian… why had this young lady rescued them? Was this a different undiscovered tribe? This was what they guessed.</p><br/><p>Qin Hai shrugged. \"The instant we saw that red flash, we lost consciousness.\"</p><br/><p>Kong Bai sighed. \"Me too. That seems to have been a power far exceeding our current level.\"</p><br/><p>However, as they obtained more information and proved their hypotheses, especially after the discussion with Chen Feng, they reached an extremely terrifying verdict. They had indeed transmigrated!</p><br/><p>That's right. Despite the fact that barbarians existed here, these barbarians were completely unrelated to the barbarians from their world. Despite the fact that humans existed here, these humans were also completely unrelated to the humans of their Genetic Era. Genes? For the humans here, that was something they had no knowledge of. The humans here seemed to be worshipping the power of the Sage. As for the barbarians, they honored the Divine Ancestor. Apart from that, there was also the Devil King. In short, this was a world divided in three. The so-called Genetic Era did not exist here.</p><br/><p>Therefore, their ultimate conclusion was that the dragon's surprise attack had, in an absurd manner, caused them to stumble upon a time crack or space crack that only had an extremely small probability of appearing, at which point they transmigrated to this place. That was all there was to it. As for what place this was? They had no idea. This might be an entirely different dimension altogether.</p><br/><p>Qin Hai was doubtful. \"Is transmigration something possible?\" He found it hard to believe that something like this that only happened in novels would actually happen in real life. It was rumored that the Mysterious Organization had also been researching this subject and had never succeeded after all these years.</p><br/><p>\"Oh.\" Chen Feng paused. How should he explain?</p><br/><p>Kong Bai sighed. \"It's possible.\"</p><br/><p>Immediately, the other two looked at him. \"Oh?\"</p><br/><p>Kong Bai coughed and feigned a calm expression as he explained, \"You both should be clear about our circumstances before we lost consciousness, right? That was truly an extremely dangerous situation, extremely dangerous… if we had truly been hit, we might have truly died. Hence… I used my space-related ability to defend myself. Perhaps I accidentally caused a spatial collision, causing our transmigration.\"</p><br/><p>Qin Hai contemplated. \"So that's the case.\"</p><br/><p>Chen Feng raised his eyebrow. He felt that the words of this Kong Bai guy weren't particularly trustworthy. If this had truly been caused by this guy's space-related ability…</p><br/><p>Suddenly, Chen Feng commanded, \"Xiao Ying!\"</p><br/><p>Shua!</p><br/><p>A red light flashed in his mind.</p><br/><p>\"Did you record everything?\" Chen Feng asked.</p><br/><p>Shua!</p><br/><p>In a proud manner, Xiao Ying flung its tail around. Normally, whenever Chen Feng lost consciousness, Xiao Ying would come out to protect him. Chen Feng had once taught it how to record everything it saw.</p><br/><p>Hum—</p><br/><p>Red light flickered in his mind. The scenes of everything that had happened since he had lost consciousness started replaying. That terrifying light in the air and that mysterious red dragon, both were incredibly scary. At that time, the three of them had sunk into absolute danger. Right at that instant, Kong Bai seemed to have done something. Chen Feng had only been able to activate Luck Aura before losing consciousness. As for that guy, he had thrown himself at Chen Feng and Qin Hai.</p><br/><p>\"Transmigrate for me!\"</p><br/><p>Bang!</p><br/><p>A beam of light had erupted and instantly enveloped the three of them.</p><br/><p>Hum—</p><br/><p>The scenes around them started disintegrating.</p><br/><p>Chen Feng's heart jolted furiously as he saw this. This Kong Bai guy was capable of transmigrating as he wished?</p><br/><p>In short, during the final moment, Kong Bai had actually brought the both of them along before transmigrating into this new world to hide from the dragon's attack? This ability… Chen Feng was truly shocked. Transmigration, a subject the Mysterious Organization had been studying painstakingly, was actually something this guy could do as he wished? He was too much of a freak! However, since this guy was capable of transmigrating, he should be able to take them back after recovering, right? This was what Chen Feng guessed.</p><br/><p>Just as he was about to ask Kong Bai about transmigration, suddenly, the door of their room opened. The young lady had returned with that sturdy-looking barbarian.</p><br/><p>\"The boss heard that you guys awoke and wants to see you guys,\" Xiong Da stated in a simple and honest manner.</p><br/><p>The three of them nodded. \"All right.\" However, now that this sturdy guy had shaved all the hairs on his body, an appearance that Chen Feng was extremely familiar with was revealed. After looking at him attentively, Chen Feng's mind jolted furiously due to the appearance of this guy. Back then, Chen Feng had only caught a glimpse of that guy. However, Chen Feng was able to recognize his face. This guy here looked exactly like that mysterious expert they had seen right before entering the land of legacy, the guardian of the tribe of barbarians. This guy was precisely that mysterious stone statue! Why was the stone statue here?</p><br/><p>Chen Feng was alarmed. Xiong Da… mysterious stone statue…</p><br/><p>So, they hadn't actually transmigrated and were instead still at the core region of the ruins of the barbarians? If so, what were all this things he had seen? Was this an illusion or something else? Chen Feng had no answer. However, he could vaguely feel that he had stumbled upon something incredibly unordinary.</p><br/>\n</div>"}