{"title": "Chapter 408: Aware since Long Ago", "id": 408, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-408-aware-since-long-ago", "volume_title": "Volume 5", "body": "<h1>Chapter 408: Aware since Long Ago</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 408: Aware since Long Ago</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At a certain location high above the sky, lightning was everywhere. Two illusory figures condensed and appeared there, seated cross-legged. The both of them were talking to each other casually; the vile environment around them did not seem to have any effect on them.</p><br/><p>Suddenly.</p><br/><p>Hum—</p><br/><p>A dim green flashed past. At this, the forehead of one of the two figures started shining with green. The radiance started spreading from his forehead and enveloped his head before spreading to his entire body. Toward the end, the entire body solidified as the true appearance of that person became clear. This was precisely Lu Hun.</p><br/><p>Lu Hun smiled. \"The fish has taken the bait.\"</p><br/><p>The figure opposite him smiled lightly. \"True.\"</p><br/><p>Hum—</p><br/><p>Black radiance started spreading as the other figure's forehead started shining black. As the radiance faded, his body solidified, revealing a black-clothed person whose face couldn't be seen clearly. However, even if his face couldn't be seen clearly, the diamond on his head was shining dazzlingly.</p><br/><p>Lu Hun sighed. \"Junior apprentice brother, you still lack trust in me, as usual.\"</p><br/><p>He had known this junior apprentice brother of his for many years, yet he had never seen this guy's true appearance. This guy was the leader of the Mysterious Organization, yet this very person had also abided by the spirit of keeping things a mystery to such an extent as well.</p><br/><p>\"You know the reason for that,\" the Mysterious Organization leader replied calmly.</p><br/><p>Lu Hun sighed. \"Fine.\"</p><br/><p>It was rumored that once, this junior apprentice brother of his had encountered a formidable opponent that had caused his face to be ruined. From then on, he had wrapped himself with his ability at all times, never revealing his true appearance. However, no one was aware of the authenticity of this story.</p><br/><p>\"That Chen Feng…\" The Mysterious Organization leader paused before continuing, \"should be here already, right?\"</p><br/><p>\"Naturally,\" Lu Hun stated calmly.</p><br/><p>\"We have no way of getting involved in this.\" The Mysterious Organization leader stared at the sky that was still dark. \"Presently, we still can't leave this place.\"</p><br/><p>\"This time, we can only let them handle it.\" Lu Hun smiled calmly. \"Since Chen Feng is courting death, then just let him die. It's about time he pays back what he owes me anyway.\"</p><br/><p>Bang!</p><br/><p>The sky started thundering. Accompanied by Lu Hun's malicious laughter, the lightning appeared even more sinister. The face of the Mysterious Organization leader was indistinct; however, his eyes appeared even deeper now. One whole month was sufficient for the Mysterious Organization to get to the truth of a lot of matters, such as the true identity of Wang Feng.</p><br/><p>If that Wang Feng guy had been around all the while, things might not have seemed so suspicious. However, he had been missing for more than a month. Such a long period of time was sufficient for the Mysterious Organization to get into the truth of things. During their investigation into Wang Feng's disappearance, they had accidentally uncovered that Wang Feng was essentially Chen Feng! This was the scariest thing they had uncovered.</p><br/><p>When this had first been uncovered, everyone had been horrified. Who would have guessed that their biggest enemy was hidden in their midst? Chen Feng was so brave? The entire Mysterious Organization was furious. Surprising them all, that wasn't the extent of Chen Feng's bravery. This Chen Feng guy had actually been courageous enough to return one month later, even after his identity had been exposed! Exactly how much did he look down upon the Mysterious Organization? They were all furious!</p><br/><p>From the lowest of their members to those in leadership positions, and even senior members like Lu Hun, all of them were furious. The Mysterious Organization was an extremely powerful organization with a huge amount of B classes and A classes, and even warriors surpassing A class with a myriad of abilities at their disposal. It would have been fine if they had been unsure of whether Chen Feng was alive or dead. Now that they were aware that Chen Feng was alive, it was nearly impossible for Chen Feng to hide his actions from them.</p><br/><p>Thereupon, the subsequent actions of Chen Feng had been deduced: on a certain date, Chen Feng would lead a group of people and return to the Mysterious Organization. For the Chen Feng whose identity was no longer trusted and who could no longer use their underground transportation system, how was he supposed to take someone to the Mysterious Organization? He could only hide himself and assassinate his way in!</p><br/><p>\"He will operate in the dark. He will assassinate the patrols. He will try his best to avoid triggering the alarm. If we are without preparations, Chen Feng might be able to escape easily.\"</p><br/><p>This was what the powerful peak A-class seer of the Mysterious Organization had deduced. It appeared much simpler than they had imagined.</p><br/><p>\"Don't act rashly. Figure out Chen Feng's target first. After finding out his goal, we can make our move. Get some people we have already decided to kick out to be on patrol duty. Let them give their lives away.\"</p><br/><p>This was the plan of the Mysterious Organization. Hence, the members that were supposed to be kicked out were transformed into numerous patrols walking the corridors. Ultimately, they were all killed by Chen Feng. The others were not able to see clearly what had happened, but they could perceive it with their senses. This continued until they figured out Chen Feng's goal.</p><br/><p>\"That is where the Spirit Sea wood is stored. Chen Feng's goal is the Spirit Sea wood! How has he found out about the Spirit Sea wood?\"</p><br/><p>\"Someone must have leaked the information.\"</p><br/><p>The Mysterious Organization members started discussing among themselves. The Spirit Sea wood was the one of the deepest secrets of their organization, yet Chen Feng was aware of it. How much of their secrets as this Chen Feng guy aware of?</p><br/><p>Some of them sneered. \"I'm afraid that this time, we truly need to capture him.\"</p><br/><p>\"That's only natural,\" the rest responded.</p><br/><p>From the moment Chen Feng had stepped foot into the Mysterious Organization, he had already fallen into their trap. This was a trap specifically prepared for Chen Feng. They did not dare to get too near Chen Feng, nor did they dare to actively monitor his movements, as they feared that Chen Feng would notice them. However, they only needed to observe in an indirect manner to gather certain details.</p><br/><p>As an example, the strength of Chen Feng's group. This Chen Feng guy thought that nobody was aware of his assassinations. Unknown to him, every place he walked past and those he killed were fully investigated after he left. Those killed by him were essentially cannon fodder.</p><br/><p>\"His target has already been ascertained.\"</p><br/><p>The strategy department of the Mysterious Organization had already fully analyzed everything about Chen Feng. \"From the traces left behind, we can conclude that this is an assassination squad of 10 people. All 10 of them are veterans at assassinations. Peak B-class warriors will have no way of fighting back against them. Based on the information we have so far, our opponents possess the strength of peak B class at the very least. It is actually quite possible that they are actually A-class warriors.\"</p><br/><p>At this, everyone's expression became solemn. A class… a 10-man assassination squad comprised fully of A-class warriors! No wonder this Chen Feng was so egotistical and had the courage to sneak back here.</p><br/><p>\"Based on our analysis of the route they are taking, their final destination is the place where our Spirit Sea wood is stored. We can prepare our ambushes around there.\"</p><br/><p>\"That's right. When it comes to assassins, even if they are powerful when it comes to sneak attacks, their strength is nothing to write home about when it comes to direct confrontations. We can prepare 10 A-class experts to face them. They are out there in the open, while we are operating in secret. As such, there is no way we can lose this battle. This time, I want Chen Feng to die without a burial site!\" the head of the strategy department said.</p><br/><p>The rest accepted his commands. \"Understood.\"</p><br/><p>Currently, along with the passage of time, they managed to verify their initial deductions. Regardless of Chen Feng's assassination squad or their strength, all of this was verified.</p><br/><p>Identity verification completed.</p><br/><p>Strength verification completed.</p><br/><p>…</p><br/><p>The Mysterious Organization members had been prepared in the dark long ago, waiting for Chen Feng's group to arrive.</p><br/><p>Some of them started hearing the sound of footsteps. \"Here they come.\"</p><br/><p>\"Three, two, one…\" The eyes of the strategy department head shone as he shouted, \"Go!\"</p><br/><p>Shua!</p><br/><p>Taking the lead, he streaked out. However, after only moving a short distance, the clear appearance of the assassination squad behind Chen Feng was revealed. At that moment, the strategy department head's expression greened instantly.</p><br/>\n</div>"}