{"title": "Chapter 409: Plan?", "id": 409, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-409-plan", "volume_title": "Volume 5", "body": "<h1>Chapter 409: Plan?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 409: Plan?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>??? Assassins? These are the assassins?</p><br/><p>As he felt the oppressive pressure emanating from those opposite him and saw their enormous bodies, the strategy department head, who had been heading out, stopped and returned forcefully.</p><br/><p>\"Stop!\" he shouted. His subordinates couldn't even process what had happened yet.</p><br/><p>They looked at the head with bewildered expressions. \"What's up?\"</p><br/><p>The head gulped. \"Look.\"</p><br/><p>They raised their heads and stared ahead. Instantly, they blanked as they saw, from behind Chen Feng, a group of lofty giants with tall and sturdy bodies and astonishing power appearing one after another.</p><br/><p>A... Assassins?</p><br/><p>The mere sight of these assassins caused their legs to feel somewhat weak. If it had merely been someone whose body was huge, they would naturally not have been bothered. However, these giants they were facing emanated an incomparably terrifying and oppressive pressure and might! These fellows were comprised fully of A classes!</p><br/><p>Assassins? Assassins my *ss! These are obviously meat shields!</p><br/><p>Ka! Ka!</p><br/><p>One of the three-and-a-half-meter-tall giants started stretching his body. As he did so, the air filled with cracking sounds. When they glanced over, they found that these were actually the sounds of the air being compressed. If such power landed on their bodies… The mere thought of this caused their bodies to chill. As for the head of the strategy department, he was wishing he could slap to death the fellow who had previously deduced Chen Feng's strength.</p><br/><p>\"What to do?\"</p><br/><p>They became extremely anxious. At this time, they saw that Chen Feng had stopped moving as well and was seemingly pondering something.</p><br/><p>\"We might not necessarily have zero chances,\" one of his subordinates said. \"Although they are rather strong, we have two advantages. First, Chen Feng is still not aware that we already figured out his identity. Second, Chen Feng simply does not have the courage to expose his identity. They should still be thinking of ways to eliminate the guards secretly.\"</p><br/><p>The strategy department head pondered knowingly. \"You're saying…\"</p><br/><p>That person continued, \"That's right. We can ambush them! When Chen Feng's group is ambushing the guards, we can ambush them and teach them a lesson about what it means to be the oriole stalking behind the cicada! Moreover, look at their size… hehehe.\"</p><br/><p>Shua!</p><br/><p>The eyes of the strategy department shone. True! These guys might appear terrifying with their huge size, but they were, after all, still assassins. The main characteristic of an assassin was high attack and weak defense! As for someone with such a huge body, it signified that they would be an easier target to hit! In short, they could be damaged much more easily. When attacking these huge assassins, if the attackers were hidden in the dark, they wouldn't even face any risk. As long as sufficient attacks were launched, these fellows could very well be insta-killed!</p><br/><p>The strategy department head's eyes shone. \"Tell the other squads to finish their preparations.\" He seemed to recall that the last time they had attacked someone in such a manner was during the Mysterious Killing Command incident.</p><br/><p>Hehe. Chen Feng… how are you going to escape the calamity this time?</p><br/><p>Shua!</p><br/><p>Once again, they concealed themselves.</p><br/><p>Hidden amid the darkness, they could see Chen Feng's group approaching and were preparing to make their move. The strategy department was already done with their preparations, and killing intent appeared from their eyes.</p><br/><p>One step…</p><br/><p>Two steps…</p><br/><p>Chen Feng's group was pressing forth without stop.</p><br/><p>Hum—</p><br/><p>Suddenly, a faint layer of energy flashed on Chen Feng's body. In this operation, he was aware that he wouldn't play too big a role. As such, all the abilities he used were those abilities used to aid the barbarian assassination squad, granting them an enhancement in their speed. With the naturally astonishing body quality of these barbarians, how fast would they be after having their speed enhanced by Chen Feng?</p><br/><p>\"Well, we'll find out after trying.\"</p><br/><p>Both Chen Feng's eyes were sharp.</p><br/><p>Shua!</p><br/><p>The energy concentrated in his hands bubbled. Next, under the support of his Luck Aura, the Myriad Illusions ability displayed its maximum power. Unleash, speed!</p><br/><p>Hum—</p><br/><p>The 10 barbarians jolted as their bodies trembled violently. Next, an expression of comfort appeared on their faces as they stopped resisting and allowed the power to enter their body. Chen Feng was aware that energy support would only have a small effect on these barbarians. However, what if the energy inserted into their bodies was merely a seed? What if the wind was what it was supposed to work on?</p><br/><p>Hu—</p><br/><p>Suddenly, the wind grew chaotic. As for the barbarians, when they stepped forth, a burst of pushing power could be felt. This was… the power of wind! A pure power of nature transformed from energy.</p><br/><p>The gale whistled.</p><br/><p>Hu! Hu!</p><br/><p>\"Now!\" Chen Feng shouted.</p><br/><p>Shua!</p><br/><p>Almost instantaneously, the barbarians felt the terrifying burst of power. With that, their speed that had been already fast was enhanced by more than ten times, and they reached their targets instantly! At this time, the expression of the faraway strategy department head changed greatly. \"We can't continue waiting.\"</p><br/><p>Too fast! They were aware of the strength of Chen Feng's group. However, they had never expected that Chen Feng still possessed such an enhancement ability. If they did not make their move as soon as possible, the head and those guards could very well all die here!</p><br/><p>\"Move!\" the strategy department head commanded without the slightest hesitation.</p><br/><p>Bang!</p><br/><p>At that instant, time itself seemed to stop. Flame, ice, venom, storm… numerous powers started gushing out from a multitude of angles, streaming toward the barbarians.</p><br/><p>Speed Reduction!</p><br/><p>Void Transformation!</p><br/><p>…</p><br/><p>All sorts of terrifying debuff abilities erupted. Regardless of how powerful Chen Feng's group was, under such a bombardment, the amount of power left to them would most probably be even less than one-tenth, and it would most probably fail to kill anyone in such a condition.</p><br/><p>\"Do it!\" the strategy department head ordered.</p><br/><p>Hua—</p><br/><p>The Mysterious Organization members charged out. As far as they were concerned, there was simply no suspense to this battle. However, by the time the first person arrived, by the time he soared up before slamming the energy dagger down toward one of the sturdy barbarians…</p><br/><p>Clang!</p><br/><p>A crisp ringing sound echoed.</p><br/><p>The weapon of slaughter he was so proud of was unable to leave even a scar on that sturdy body. To be precise, only a small white line was left on that sturdy body.</p><br/><p>\"You… you…\"</p><br/><p>Finally, his expression changed greatly. Who the h*ll had said that these were assassins? How was it possible for these guys to be assassins?</p><br/><p>Crack!</p><br/><p>That sturdy body had been ignoring his attack all along. Only after this person nonchalantly snapped the head of one of the guards did he turn around to look at the user of the dagger, a simple and honest smile on his face.</p><br/><p>Bang!</p><br/><p>Suddenly, an intense eruption of force could be felt, and next, the dagger user's vision darkened, never to wake up again. Before his death, the only thoughts in his head were: Who the hell said that these guys are assassins? Who said that they have strong attacks and weak defenses? If I had known this in advance, I definitely would not have approached them…</p><br/><p>Currently, the same scene was repeating everywhere. The strategy department had indeed unleashed their attacks on Chen Feng's group. Unfortunately, none of the barbarians were injured. Moreover, those barbarians were nonchalantly slaughtering all the guards right in front of the strategy department head's eyes. Those powerful guards couldn't contend against the barbarians at all!</p><br/><p>The head was alarmed. \"How is this possible?\" This was totally different from what they had planned! Since the combatants of both sides were both A classes, the difference in strength shouldn't be so huge! Evidently, he was unaware that the life-forms he was seeing were called \"barbarians.\" If he'd had sufficient understanding of barbarians, he would have known to never get into melee with the barbarians. Only by putting some distance between them could he stand a chance of victory.</p><br/><p>Bang!</p><br/><p>The earth trembled, and all the Mysterious Organization members were flung away. Only one second had passed since their first appearance here. Only now did Chen Feng notice these newly appeared fellows.</p><br/><p>Chen Feng narrowed his eyes. \"We have been discovered?\" He was not aware that his identity had been exposed long ago. Everything he had been doing so far had been to avoid detection. He was clear on the strength of these barbarians. They could be used to great effect when ambushing and slaughtering enemies that lacked understanding of the barbarians. However, the instant someone surpassing A class got involved in this…</p><br/><p>\"Go!\"</p><br/><p>Without the slightest hesitation, Chen Feng led the barbarians and slaughtered their way forward. Since the Mysterious Organization had already been alarmed, it was no longer possible for them to escape. If so, only one option remained for them to survive this: Spirit Sea wood!</p><br/>\n</div>"}