{"title": "Chapter 405: The Incredibly Incredible Xiong Er", "id": 405, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-405-the-incredibly-incredible-xiong-er", "volume_title": "Volume 5", "body": "<h1>Chapter 405: The Incredibly Incredible Xiong Er</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 405: The Incredibly Incredible Xiong Er</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At the unknown region, as Chen Feng stared at the village in front of him, his head ached. Mhm…Why had a training camp exploration mission transformed into a kingdom-building game? As they had spent quite a long time on this mission, he had almost forgotten that their primary goal here was to tame this unknown region and transform it into a training camp.</p><br/><p>Chen Feng pondered. \"It's already impossible to turn this into a training camp.\" After all, he couldn't really kill off all these powerful barbarians, right? This was an extremely fortuitous encounter for him, as Xiong Er had handed over all these barbarians to him. The strength of the barbarians' combat power was not to be doubted. Every single one of them was comparable to a B class. Moreover, the degree of their energy immunity was even higher than his. Most of them had an immunity above 90%. As long as sufficient training was provided, each of the barbarians would be able to transform into a terrifying combatant that was much stronger than a genetic warrior.</p><br/><p>However… were these barbarians reliable? Chen Feng pondered deeply. After all, he was not a barbarian. It was reasonable to suspect the loyalty of those from a different race. Chen Feng was not intending to raise a group of fellows that would not listen to him. Right at this moment...</p><br/><p>Hum—</p><br/><p>A dot of light started radiating on his forehead. That was the thing Xiong Er had placed on him. Normally, it would be hidden within his body. Now that he had activated it, Chen Feng could keenly feel that this mysterious imprint was actually capable of controlling the barbarians.</p><br/><p>Chen Feng exclaimed in admiration, \"This is… bloodline control?\" He had once heard of something like this.</p><br/><p>It was rumored that certain powerful families used such a method to control their clansmen. As long as they were related by blood, everyone's lifeline would be under control. What this thing controlled was one's origin blood. Against some people, this control method was extremely effective. Those capable of being controlled were normally those possessing one's bloodline, such as one's children or offspring. Whoever it was, as long as that person's bloodline density exceeded 10%, this thing would work. Nobody would dare to rebel against this control either.</p><br/><p>Using familial affection and threat together, such a control method was extremely hegemonic. Chen Feng had never expected that the barbarians were also employing such a method to control their offspring. In other words, with this imprint, Chen Feng would be able to control the elites of the barbarians? This was Chen Feng's guess. Through his perception, he found out that this imprint was essentially the origin imprint of Xiong Er.</p><br/><p>Mhm… anyone who was related by blood to Xiong Er, Chen Feng would be able to control. Presently, Chen Feng was only praying that among the blood descendants of Xiong Er, a complete army was included. Only with that could he maintain order among the barbarians. That would be the best scenario. If the blood descendants of Xiong Er only consisted of some ordinary barbarians or some barbarian thugs, what was the point of Chen Feng having control over them?</p><br/><p>Chen Feng inhaled deeply. \"Hopefully, everything will work smoothly.\"</p><br/><p>Activate!</p><br/><p>Ding—</p><br/><p>He pointed midair. Xiong Er's imprint started blooming with a dazzling radiance.</p><br/><p>Numerous shining red dots could be seen on the imprint. These red dots were all joined by numerous red threads, akin to a horoscope. From this, Chen Feng was able to see the information and location of all the blood descendants.</p><br/><p>Shua! Shua!</p><br/><p>Soon, Chen Feng was able to see all the red dots. However, when all the red dots appeared, after Chen Feng studied them attentively, he felt like something wasn't right. As such, he studied those dots again, yet he still felt like something wasn't right.</p><br/><p>Chen Feng frowned. \"This amount…\"</p><br/><p>Shua!</p><br/><p>All the red dots were now joined, and the activation of the imprint was thus complete. Each of the red dots was flickering without stop. Chen Feng only needed to urge inwardly and he would be able to kill any of these barbarians anytime he wanted to. This was the present given to him by Xiong Er. However… this amount… Chen Feng was dumbstruck when he saw it.</p><br/><p>Shua!</p><br/><p>The red dots were so numerous that their radiance nearly blinded Chen Feng. He had initially believed that there wouldn't be many blood descendants of Xiong Er, with most of his actual blood descendants being the elites of this tribe. Unexpectedly, the entirety of the tribe were blood descendants of Xiong Er. That's right! All of them! What the h*ll? Chen Feng tried calculating the total amount of the barbarians. Mhm… the total amount of barbarians here was exactly the same as the barbarians contained in the imprint. In other words… everyone here was a blood descendant of Xiong Er.</p><br/><p>Suddenly, Chen Feng recalled what Xiong Er had said earlier. When he came back, the war had already ended. He had only been able to rescue several dying barbarians with great difficulty, in order to leave some descendants behind. Only with this had the barbarians continued existing until this day.</p><br/><p>As such, the barbarians he had rescued had all been female? Therefore, by himself, that guy had continued the bloodline of the barbarians? It was still fine for his generation. As for the next generation…</p><br/><p>For the bloodline density of Xiong Er to still remain 10% even among the barbarians of this generation, this signified that Xiong Er had been \"working hard\" even among the subsequent generations. This, this, this…</p><br/><p>Chen Feng and Kong Bai looked at each other in dismay.</p><br/><p>\"This is truly the act of a single person creating an entire race,\" Kong Bai lamented.</p><br/><p>Chen Feng felt too powerless to even berate this. \"No wonder the intelligence of the barbarians decreased without stop…\" With their incestuous breeding method, it would truly be an oddity if their descendants were of quality. In all honesty, if it wasn't for their body quality being already on the extremely high side, granting them numerous immunities, the current generation of barbarians would most probably all be retarded…</p><br/><p>Kong Bai was curious. \"The bloodline density should be decreasing, right?\"</p><br/><p>Chen Feng coughed. \"Male barbarians, who were in charge of fighting, had a rather high casualty rate. As such, most barbarians left alive in the village were female barbarians. Therefore… I suppose our dear friend Xiong Er still needed to 'work hard' to continue extending his bloodline,\" Chen Feng lamented.</p><br/><p>Kong Bai: \"…\"</p><br/><p>Could this be considered an act of keeping good things for oneself? The scariest question was: \"Even if Chen Feng is in control of the barbarians now, how should the barbarians continue breeding in the future?\" All the barbarians here had bloodline density above 10%! This indicated that all of the barbarians were actually close relatives of each other. How would the child conceived through such pairings be intelligent?</p><br/><p>Suddenly, Kong Bai asked, \"Mysterious Organization… are you planning to return?\"</p><br/><p>\"Yes,\" Chen Feng replied without the slightest hesitation.</p><br/><p>\"Why?\" Kong Bai couldn't understand the reason. Back then, hadn't Chen Feng stayed there by pure accident? Now that he was out here with great difficulty, why did he have to go back there and throw his life away?</p><br/><p>Chen Feng stared at the bustling barbarians around him. \"I did not say that I am returning alone.\"</p><br/><p>Suddenly, Kong Bai's eyes widened. \"Don't tell me…\" The h*ll, this lunatic! He was trying to attack the Mysterious Organization using the barbarian army?</p><br/><p>\"There's something I need there,\" Chen Feng stated calmly. \"However, I'm afraid these barbarians won't be sufficient.\"</p><br/><p>Kong Bai shook his head. Although these barbarians were powerful, they were totally lacking when it came to high-level combatants. All of the barbarians were B class! It would still be fine if they encountered an A class, but if they encountered genetic warriors surpassing A class, all those barbarians would probably fall there. How was this war supposed to progress, then?</p><br/><p>Chen Feng was aware of the crux of the issue. \"Ultimately, it is still the bloodline that will affect the future of the barbarians.\" Through the methods Xiong Er had employed, he had indeed prevented the extinction of the barbarians. Unfortunately, the intelligence of the present barbarians…</p><br/><p>Kong Bai shook his head. \"Several generations will be required to reduce the amount of bloodline density.\" The barbarians' growth was rather rapid and was more than ten times faster than an ordinary human's. As such, what a human needed 10 years to accomplish, the barbarians could accomplish in several months. However, even if a new generation was birthed every three months, did they truly have to stay here for around a year or so waiting for the combat power of the barbarians to increase? This solution was rather unreliable. Moreover, there was one more point, an extremely crucial point: Chen Feng could only control the barbarians with bloodline density above 10%. Those with lower bloodline density would be out of his control. That was the largest problem he currently faced.</p><br/>\n</div>"}