{"title": "Chapter 415: Attacking the Weakness!", "id": 415, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-415-attacking-the-weakness", "volume_title": "Volume 5", "body": "<h1>Chapter 415: Attacking the Weakness!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 415: Attacking the Weakness!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At the Mysterious Organization, along with the True Steel Prison's descent, Tang Lan and the rest were watching on nervously. He gasped at this display of power, and at the same time, he wondered anxiously if Chen Feng would really be trapped by this. After all, this True Steel Prison was a secret art created after modifying the True Steel Armor ability.</p><br/><p>\"There won't be any problems, right?\"</p><br/><p>\"I doubt it. I once battled him. True Steel Armor has an astonishing degree of toughness. The moment this modified True Steel Prison touches one's body, that person will start experiencing a choking feeling. Even I can't guarantee that I would be able to escape it. As for Chen Feng, he is a mere B class. It is simply impossible…\" Before he could even finish this sentence, he halted abruptly.</p><br/><p>What's up?</p><br/><p>The rest blanked slightly before suddenly feeling an odd aura. Instinctively, they looked toward where Chen Feng was. Instantly, their expressions changed greatly. There, on the \"sack\" wrapped around Chen Feng, a sharp sheen had actually appeared.</p><br/><p>Pu!</p><br/><p>Accompanied by a crisp sound, on the topmost spot of the \"sack,\" a hole was forcefully pierced. Immediately after, a huge sharp radiance appeared and started flickering, leaving numerous holes in the True Steel Prison.</p><br/><p>Bang!</p><br/><p>The entire sky was enveloped by the bright radiance, and the True Steel Prison burst apart immediately. On Chen Feng's hand, a tiny dot of a sharp radiance could be seen flickering about. When everyone put their attention on it, they noted that it was actually a needle, a needle formed through unique energy, an incomparably sharp, shiny needle.</p><br/><p>That peak A-class expert was shocked. \"How is this possible? The True Steel Prison is formed through the True Steel Armor…\"</p><br/><p>Chen Feng merely sneered. \"Hehe. Although the toughness of the True Steel Armor is unequaled, its original form is still a mere armor used to protect the user's body and provide defense for the user. Have you ever wondered why the True Steel Armor was never altered into a sack and used to knock someone out instead? It's because the moment its structural makeup is altered, making it softer to assume another shape… it will then possess a fatal weakness. Indeed, it has become softer and has a higher degree of durability. However, in this form, it is also no longer capable of resisting a purely sharp attack. A single sharp needle is required…\" Chen Feng waved the needle he had in his hand. \"A single stab is sufficient.\"</p><br/><p>Shua!</p><br/><p>That person's expression changed greatly. He appeared dazed. \"How is this possible…\"</p><br/><p>With True Steel Armor as the core, he had been improving and altering it without stop to create a series of abilities. Moreover, he had also created countless code names representing these abilities, such as True Steel 001, True Steel 002, True Steel 003, and so on. Every single one of these abilities was supposed to be incomparably powerful! These were all abilities he was proud of! However, for Chen Feng, these abilities were merely something a single needle could defeat? He could not tolerate this!</p><br/><p>His eyes gleamed coldly. \"I refuse to believe this! Let me show you my real True Steel Series!\"</p><br/><p>Shua!</p><br/><p>A powerful elemental power started converging around his body.</p><br/><p>\"True Steel Sword!\" he yelled.</p><br/><p>He had actually formed a formidable and sharp sword using his power of True Steel, and the sword was currently being swung toward Chen Feng. This was a different variation of his modified True Steel Armor that used the powerful durability of True Steel Armor to create an improved sword. With this rendition of his ability, the solidity of the True Steel that had originally been durable and had had a good defense had been improved, turning it into something that could break through all defenses, something more firm and upright than the True Steel Armor.</p><br/><p>\"Die!\"</p><br/><p>Xiu!</p><br/><p>His sword slashed down, ripping apart space with a whizzing sound as the sword descended.</p><br/><p>Chen Feng could only shake his head at this. \"Is there a need for this?\" He had once heard of this True Steel Armor ability. This was indeed a legend-like ability, an ability that created something with the most optimal combination of flexibility and hardness. It had become a powerful and legendary ability that had been continuously passed down for countless years. Was something like this an ability a person could easily modify?</p><br/><p>The previous True Steel Prison had removed its hardness, leaving only flexibility behind and thus giving Chen Feng an opportunity to puncture it with a single needle. And now, this rendition where flexibility had been removed and only hardness was left… Perhaps for a lot of people, and even peak A-class warriors at a similar level as him, a huge price would have to be paid to face this attack head-on. For Chen Feng, though…</p><br/><p>\"Ah.\" Chen Feng pointed midair. Luck Aura activated at full power. Bloom, Myriad Illusions!</p><br/><p>Shua!</p><br/><p>A bone-piercing chill started blooming from his hand. The moment that True Steel Sword with only hardness remaining came in contact with this bone-piercingly-cold power, the terrifying chill started rapidly spreading to the sword…</p><br/><p>Ka! Ka!</p><br/><p>At this moment, that so-called True Steel Sword that was capable of breaking all defenses actually started shattering. It was actually too hard, resulting in it failing to resist such low a temperature!</p><br/><p>\"When something becomes too hard, that thing will become too easy to break instead.\"</p><br/><p>This saying surfaced in the brains of a lot of people when they saw what was happening.</p><br/><p>His alteration of the power of True Steel had indeed granted him more powerful methods of dealing with enemies. However, along with this benefit was also a more distinct weakness for his created abilities. If these weaknesses were not exploited by the enemies, he would naturally be more powerful when using these created abilities. The moment the weaknesses were exploited, though…</p><br/><p>Tang Lan sighed. \"You should retire for now.\"</p><br/><p>That peak A-class expert was feeling indignant. \"I am not reconciled to this!\" How could this power of True Steel that he had spent his entire life researching be broken by a little B-class kid? It was impossible!</p><br/><p>\"True Steel Hammer!\"</p><br/><p>Shua! Shua!</p><br/><p>The furious peak A class moved once again. Numerous different abilities modified from True Steel Armor appeared. Unfortunately, every single time, Chen Feng was able to find the weakness of these abilities and exploit them. Some of them were weak against fire, some were weak against water, some were weak against softness… nearly all his creations were defeated by Chen Feng, failing to do anything to Chen Feng.</p><br/><p>He was dazed. \"How is this possible…\" His lifetime of research was incapable of defeating a mere B class? Among all these abilities, the strongest and only ability Chen Feng couldn't exploit was the original True Steel Armor, that legendary ability that had been passed down for so many years. That was because this was an ability with no weaknesses. Unfortunately, this was an ability only capable of defending. If he wanted to use it to kill Chen Feng? It was impossible.</p><br/><p>His eyes gleamed coldly. \"Seems like I can only use that, then.\"</p><br/><p>Tang Lan glared at him. \"What are you waiting for? Retire. Your ability is indeed powerful. Your different renditions of them each have their own advantages and disadvantages. Unfortunately, he is capable of countering your abilities. What are you worried about?\"</p><br/><p>\"But…\"</p><br/><p>\"If you continue your standoff with Chen Feng, everyone else will discover all your weaknesses as well,\" Tang Lan warned him.</p><br/><p>Shua!</p><br/><p>Instantly, that person came to himself. Wasn't that true?</p><br/><p>The numerous abilities he had created from his research had originally appeared unequaled and powerful, things nobody could defeat. Due to his confrontation with Chen Feng, he had displayed nearly all his abilities, all of them being countered by Chen Feng. And now, almost every one of the Mysterious Organization's members was aware of his trump cards and, also, his weaknesses!</p><br/><p>\"The more attacks you launch, the more thorough the exposure of your information will be,\" Tang Lan stated indifferently. Instantly, that person's expression changed greatly. Only now did he retract the new ability he had been about to unleash before retreating hastily, eliminating all his thoughts of continuing to battle Chen Feng. Silence once again enveloped the area.</p><br/><p>\"So it's Myriad Illusions,\" Tang Lan stated with a sonorous voice. They had still gained something from the earlier battle, after all. He had finally seen through what Chen Feng had been using. The seemingly endless abilities in Chen Feng's possession were actually something resulting from the combination of Myriad Illusions and arcane studies! It was no wonder that the earlier expert had been defeated! Regardless of how powerful a person was, as long that person had a weakness, then the weakness would most definitely be countered. Who would have guessed that these two abilities that were seemingly weak could become so powerful when combined?</p><br/><p>\"A pity. Since I am already aware of your methods, I will not give you any chances.\" Tang Lan inhaled deeply. \"Du Lei, go.\"</p><br/><p>\"Yes.\"</p><br/><p>A simple and honest looking guy stepped out. He wasn't the strongest among these peak A-class warriors here, nor was his defense or attack the strongest. His defense was merely average among those of a similar level. The only merit of this person was him being someone with no weaknesses.</p><br/><p>He grinned malevolently. \"Chen Feng, let me face you for a bit.\"</p><br/>\n</div>"}