{"title": "Chapter 426: Descend", "id": 426, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-426-descend", "volume_title": "Volume 5", "body": "<h1>Chapter 426: Descend</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 426: Descend</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Chen Feng gasped. \"What a feat.\" Let alone eliminating his clansman, he had even killed himself? What a true man! Had he overdosed on drugs or something? At this moment, Chen Feng felt like these superexperts were truly hard to understand. Perhaps… this was the so-called generation gap.</p><br/><p>Suddenly, Qin Hai continued, \"But then, when searching the ruins of the devil race, we discovered some magical substance that was subsequently named black dust.\"</p><br/><p>Black dust?</p><br/><p>Chen Feng seemed to recall hearing about this somewhere before.</p><br/><p>Shua!</p><br/><p>He turned his screen on. As the Mysterious Organization had been trying to lure him into their headquarters earlier, they had yet to shut down his access to their database. Instead, he had been granted an even higher scope of authority there. Chen Feng started searching for \"black dust.\" Next, some data popped out.</p><br/><p>----</p><br/><p>Devil Spirit Project</p><br/><p>Project code: ABP-505</p><br/><p>Project tier: Top Secret</p><br/><p>Project classification: Forbidden</p><br/><p>Summary: It is rumored that after the devil race was killed by a certain unique power, they transformed into black dust and their souls sunk into the earth, transforming into a unique existence known as devil spirit. These devil spirits did not possess physical bodies and were capable of traversing freely between the illusory and physical world. Moving in groups, they were unbeatable. The moment black dust blended with the earth, the devil spirit would awaken from the black soil.</p><br/><p>----</p><br/><p>Devil spirit project! Chen Feng's expression changed greatly. These things were actually the work of the Mysterious Organization?</p><br/><p>\"The likes of Tang Lan do not have to authorization to know about this. This project is something only us fellow apprentices are aware of.\" Qin Hai sighed and said, \"Based on our guesses, back then, the devil race might have realized that they were not a match of the ancient race. As such, they planned to hibernate for 10,000 years to avoid the era where the ancient race reigned supreme, waiting for a chance to be reborn. However, this plan was seen through by the ancient race. They planned to awaken the devil spirits in advance and gain control over the devil spirits to conquer the entire world.\"</p><br/><p>So that's the case. Chen Feng shut his eyes. So this is the ultimate goal of the Mysterious Organization!</p><br/><p>Qin Hai continued, \"Initially, the Mysterious Organization had been established merely to gather black dust. The black dust is indestructible, and the black dust from back then still exists. When the gathering of the black dust is complete, the Mysterious Organization will lose its purpose of existence. As for that black dust…\" Qin Hai stared at the sky. \"It will descend in the form of black rain.\"</p><br/><p>Shua! Shua!</p><br/><p>The sky was scarily dark as the black raindrops rained down unceasingly. Chen Feng stretched his hand out. A fireball ignited in his hand. When the raindrops evaporated, black dust could be seen. So… this was the so-called black dust.</p><br/><p>\"When I found out about this project, I applied to join and participate in the research of this project. In the dark, I tried messing with their project, causing this project that was supposed to end countless years ago to be delayed by a huge amount of years. However…\" Qin Hai shook his head. The ancient race was, after all, not stupid. Despite Qin Hai messing with them with his numerous proposals and steering their project in wrong directions, they had still managed to complete this project. Ultimately, the project had activated successfully.</p><br/><p>So that's the case. Chen Feng was in a heavy mood after hearing all this.</p><br/><p>He was aware that the land beneath this sky had a lot of hidden secrets. He was also aware that within this huge and boundless unknown region, a lot of scary things were hidden. However, he had still underestimated those experts.</p><br/><p>\"Where have the ancient race members gone to?\" Chen Feng asked. All these years, the ancient race had never appeared.</p><br/><p>\"Them?\" Qin Hai sneered. \"Back then, the territory of humanity was also considered an unknown region for the ancient race members. By the time they discovered the human race, humanity had already developed themselves to a certain degree. This was especially true for the quantity of the human race. Despite the ancient race's strength, the astonishing speed at which humans breed still planted fear in their hearts. As the ancient race members all thought of themselves as a noble race, they considered exchanging the life of one ancient race member for even 1,000 humans to be a loss. To avoid heavy casualties to their own people, the ancient race plans to use the devil spirits as their main army. Therefore, the awakening of the devil spirits also signifies the beginning of the war between humanity and devil spirits. And when both humans and devil spirits are equally damaged… the ancient race will reveal themselves!\"</p><br/><p>A slight chill could be felt from Qin Hai's voice. A chill went down Chen Feng's spine as he listened. Who would have guessed that there was such a story behind the awakening of the devil spirits? The ancient race was indeed malicious in their methods.</p><br/><p>Chen Feng looked at Qin Hai. \"Will you return to us?\" The devil spirits were going to appear soon, and the ancient race was going to reappear as well. The world was going to sink into chaos. If Qin Hai stayed with the ancient race, it would probably be dangerous for him.</p><br/><p>\"This is only my clone.\" Qin Hai shrugged and paused before continuing, \"At present, the darkness has already descended. The devil spirits are going to awaken soon. Therefore, I can't afford to leave.\"</p><br/><p>The present him was no longer the youngster he had been back then.</p><br/><p>Since he was one of the top existences in this world, he had to do something, for the sake of humanity and himself.</p><br/><p>Qin Hai's expression was solemn. \"Me staying with the ancient race will allow me to transmit updates to you as well. Although the devil spirits are scary, during the initial moments of their awakening, they will be in a state of emptiness. If one is able to defeat the devil spirit at this time, one might be able to control and make use of the devil spirits for themselves. As per the plans of the ancient race, at this stage of the devil spirit project, it's my senior apprentice sister's turn to make a move.\"</p><br/><p>Chen Feng was astonished. \"Your senior apprentice sister?\" They were most certainly all members of QQ.</p><br/><p>Qin Hai nodded. \"Mhm. She is extremely powerful. After the Sage granted her the diamond, she smelted it into a unique ability of her own. This is also the most crucial ability of the devil spirit project: Control! That diamond on her forehead is capable of controlling all life-forms in a state of emptiness. Therefore, as long as a nervous breakdown is induced in the devil spirits, she will be able to easily gain control over them. There are no limitations to the amount she can control either.\"</p><br/><p>Qin Hai had an extremely solemn expression as he said all this. This was an extremely terrifying ability, especially the fact that there were no limitations!</p><br/><p>One could say that this entire devil spirit project had been designed for her. This was the scariest person among all of them. She alone would be equivalent to an entire army.</p><br/><p>Chen Feng rubbed his head. \"Your senior apprentice sister… So her diamond is pink?\"</p><br/><p>Qin Hai was amazed. \"Yi, how do you know that?\"</p><br/><p>What, do you think I have never played the QQ Pets game?[1] 1 \"...N-nothing,\" Chen Feng said.</p><br/><p>Chen Feng did not even feel like berating this anymore. He started rearranging his thoughts. The amount of information he had received today was truly too huge in amount, and he sunk into a slight confusion. Black dust… devil spirits… Qin Hai's senior apprentice sister…</p><br/><p>He needed to calm himself first.</p><br/><p>Qin Hai shook his head. \"The blockade I set up will be gone soon. It's time for me to leave. You must be careful.\"</p><br/><p>\"Mhm.\"</p><br/><p>Chen Feng nodded his head. Suddenly, he paused and gazed at Qin Hai. \"Erm, might I ask, the devil spirits you speak of, are they a life-form that is completely translucent and white and have the body shape of the devil race? Also, they climb out from the ground?\"</p><br/><p>Yet again, Qin Hai was amazed. \"Yi, how do you know that?\"</p><br/><p>\"Oh.\"</p><br/><p>Chen Feng pointed to a spot behind Qin Hai. Qin Hai turned around. There, at that piece of soil that was soaked in black rain, numerous deathly pale translucent figures were crawling up from the ground. This scene appearing under the dark sky was sufficient to send a chill down all onlookers' spines. The devil spirits were coming.</p><br/>\n</div>"}