{"title": "Chapter 422: This Is too Excessive!", "id": 422, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-422-this-is-too-excessive", "volume_title": "Volume 5", "body": "<h1>Chapter 422: This Is too Excessive!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 422: This Is too Excessive!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"What exactly is this?\"</p><br/><p>\"Black Domain? Why have I never heard of it?\"</p><br/><p>\"Is this something Chen Feng created himself? He has way too many trump cards, and a huge amount of self-created abilities to top it off.\"</p><br/><p>\"What should we do about the black water?\"</p><br/><p>Everyone watched on with a powerless feeling. Currently, their entire headquarters had already been flooded by this black water, and they did not dare to step down at all. Those capable of flight were all hovering in the sky and silently staring at the flowing black water. As for those incapable of flight, their circumstances were truly rather hilarious. Some were up on street lamps, but some were huddled together above some high-rise buildings to the point that all four of their limbs were pasted to the wall, them not daring to move in the slightest. None of them had the intention of getting insta-killed by the black liquid.</p><br/><p>\"Since Chen Feng is no longer here, this thing should vanish soon, right?\"</p><br/><p>\"I guess so?\"</p><br/><p>As they saw the unending water gushing out of the holes, they couldn't be sure.</p><br/><p>Tang Lan shut his eyes. \"Let's report this to the leader.\" This thing had developed in a direction that surpassed their imaginations. The initial operation to surround Chen Feng had transformed into an operation where they were slaughtered by Chen Feng instead. This was no longer something he could handle by himself. Only their leader could do something about this. Or, perhaps, the fellow apprentice brothers of the leader. Right at this instant, the sky started drizzling with a light rain.</p><br/><p>Splat!</p><br/><p>The black-colored raindrops landed on the ground. One of the Mysterious Organization members was alarmed to see that a black-colored raindrop had landed on his hand. He cried out in alarm and nearly fell off the top of the street lamp he was holding onto.</p><br/><p>\"What happened?\"</p><br/><p>\"It's raining!\" he stated, horrified. \"It's black raindrops, the same as the black water on the ground…Be careful!\"</p><br/><p>\"What?\" As the rest heard this, their expressions changed greatly.</p><br/><p>Shua! Shua!</p><br/><p>Numerous defensive barriers were instantly erected.</p><br/><p>Splat! Splat! Splat!</p><br/><p>The crisp sound of the pattering rain could be heard as the Mysterious Organization members frantically erected their defenses, all afraid of having these scary black raindrops land on them. Fortunately, those here were all experts with formidable strength. As such, the instant the rain started drizzling down, their defenses were fully erected.</p><br/><p>They looked at the person who had been hit by a drop of rain earlier. \"How are you?\"</p><br/><p>That person still had a lingering fear in his heart. \"I'm fine. Only a single drop, and nothing is happening. However, my hand feels somewhat itchy, but perhaps it's just my misconception. I already consumed some healing liquid.\"</p><br/><p>\"Mhm.\"</p><br/><p>Everyone nodded.</p><br/><p>\"Make sure you check your condition properly. If there's truly no other choice, just cut your arm off. We can help you construct a new arm later,\" Tang Lan stated with a solemn expression.</p><br/><p>That person nodded. \"Understood. I won't cause you all any trouble.\"</p><br/><p>They had seen far too many terrifying viruses and infections. Sometimes, due to them being too softhearted to act decisively, things had developed to the point where a biochemical calamity had arisen from those viruses and infections. This was the scariest prospect. Since these people here were capable of being the core members of the organization, their mental states were sufficiently powerful as well.</p><br/><p>Thereupon, they started defending against the rain without stop.</p><br/><p>Splat! Splat!</p><br/><p>…</p><br/><p>Splash!</p><br/><p>…</p><br/><p>Slowly, the rain became heavier. From the initial pattering, it unfolded into a majestic heavy rain. Tang Lan and the rest watched silently at the holes that were spurting black water out without stop. Since the rain and the gushing black water had never stopped, they could only wait here.</p><br/><p>\"What do we do about those who just returned from outside?\"</p><br/><p>\"They ought to not be foolish enough to come over here.\"</p><br/><p>\"Mhm…\"</p><br/><p>\"Be careful.\"</p><br/><p>They were all on high alert, waiting here, staring at the holes. Suddenly, within a certain building, someone walked out. \"Hey, how come it's raining?\"</p><br/><p>\"???\"</p><br/><p>Tang Lan and the rest were alarmed as they saw this.</p><br/><p>As they concentrated, they discovered that this was the very person Chen Feng had used to get rid of all their B-class warriors and who had ultimately been tossed away by Tang Lan: Xie Zhongtong! Tang Lan recalled that earlier, she had been knocked unconscious before being left in the hall of one of the buildings nearby. She had actually woke up at a time like this? D*mn it!</p><br/><p>\"Careful!\" Tang Lan shouted, and he was about to charge out to rescue her.</p><br/><p>\"What?\" Xie Zhongtong stared at her surroundings in a daze. She truly hadn't felt any sense of crisis. The last thing she remembered was resting in her house. Suddenly, she had reappeared somewhere, and suddenly, she had lost her consciousness. Even now, her brain felt somewhat giddy and she had no idea what was going on.</p><br/><p>Splat!</p><br/><p>She stepped into the black water.</p><br/><p>\"What am I supposed to be careful about?\" She looked at the people around her with a bewildered expression. Why were all these people behaving so weirdly?</p><br/><p>Ka!</p><br/><p>Tang Lan's charging figure halted abruptly. This young lady… had stepped in the black water just like that? Their expressions changed greatly before assuming a solemn expression. They were aware that this young lady that had once brought them happiness was going to perish here.</p><br/><p>\"Yi, there's water here?\" Only now did Xie Zhongtong notice that not only was there water dropping from the sky, the ground was already flooded with about 20 or 30 centimeters of water.</p><br/><p>Everyone sighed. Everything was over for this young lady. Next…</p><br/><p>\"How annoying, my shoes are now wet.\" With a kick, Xie Zhongtong flung her shoes out as she decided to walk barefoot instead. Next, she stared at all the \"seniors\" hiding on top of the walls and buildings, feeling extremely curious.</p><br/><p>\"What are you guys doing?\" Xie Zhongtong asked.</p><br/><p>Everyone else: \"…\"</p><br/><p>Nothing was happening? They were all astonished at the fact that Xie Zhongtong was still fine. One had to know that even those two peak A-class warriors earlier had been insta-killed. Thus, some of them started summoning some life-forms before sending them into the water. Surprisingly, those life-forms started playing happily in the water.</p><br/><p>They widened their eyes. Nothing is happening?</p><br/><p>Finally, one of them decided to step into the water. \"Let me try it out.\" He was fine. He was truly fine. That person inspected the composition of the raindrops and noted that there was truly nothing unusual about these raindrops.</p><br/><p>\"This, this, this…\"</p><br/><p>Everyone was dumbfounded. How was this possible?</p><br/><p>Hua! Hua!</p><br/><p>More and more people started stepping into the water. Some started inspecting the water with their abilities and noted that nothing was wrong with it. Instantly, Tang Lan's expression became unsightly.</p><br/><p>Suddenly, someone said, \"Erm. I just received a message. Seems like this black rain is falling at a lot of other places as well.\"</p><br/><p>Tang Lan: \"…\"</p><br/><p>His face was now scarily ashen.</p><br/><p>\"In short...\" Tang Lan inhaled deeply before continuing, \"This whole f*cking incident is unrelated to Chen Feng in any way?\"</p><br/><p>\"I guess… so?\" that person answered carefully as he stared at Tang Lan's expression.</p><br/><p>Tang Lan: \"…\" Scammer! He's a freaking scammer! What f*cking Black Domain? Your whole family is the Black Domain!</p><br/><p>Fury raged in Tang Lan's heart. He had never expected that Chen Feng's so-called Black Domain was simply a lie. A lie Chen Feng had made up to flee from them! As he recalled the disappointed expression feigned by Chen Feng due to him failing to kill them all before leaving… Tang Lan felt like killing someone.</p><br/><p>\"Then how were those two peak A classes killed?\"</p><br/><p>\"Erm, it should be those two beams of light that appeared during the initial eruption of the black water. The water itself is not harmful at all. My guess is the two black beams were simply too terrifying, and with the two seniors coincidentally standing in the way of those black beams, they perished as a result.\"</p><br/><p>Tang Lan: \"…\"</p><br/><p>What more could he say?</p><br/><p>\"Get the research department to study this black water and figure out what exactly it is,\" Tang Lan commanded coldly.</p><br/><p>\"Yes.\"</p><br/><p>The others obeyed his command. Once again, the Mysterious Organization members started busying themselves. None of them had noticed that the gushing black water had not spread elsewhere due to it soaking into the ground unendingly. Bit by bit, as the black liquid permeated the underground, the color of the soil became darker. Slowly, it became pure black in color.</p><br/>\n</div>"}