{"title": "Chapter 429: Wear Your Clothes Properly; We Can Talk It Out!", "id": 429, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-429-wear-your-clothes-properly-we-can-talk-it-out", "volume_title": "Volume 5", "body": "<h1>Chapter 429: Wear Your Clothes Properly; We Can Talk It Out!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 429: Wear Your Clothes Properly; We Can Talk It Out!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Chen Feng: \"…\"</p><br/><p>He was truly at a loss as to how was he supposed to explain this. Right now, he was feeling somewhat regretful. If he had known that this would be the result of the upgrade, he would have been better off cutting the Spirit Sea wood into pieces and taking them away as a supply of luck value. The result that he had gotten was simply a fraud. This thing here was more like a low-level AI, right? What in the world was this Spirit recommending? To hell with the so-called divine tool. What was the point of having this thing?</p><br/><p>Chen Feng rubbed his head. So the Luck Aura he had painstakingly upgraded had given birth to such a thing? How disappointing.</p><br/><p>Spirit felt somewhat embarrassed. \"Sorry. I am a newborn. Therefore, the amount of data and understanding I have is too little. If you require me to learn rapidly, I will require your authorization to activate my learning function.\"</p><br/><p>Chen Feng was astonished. \"You have a learning function?\"</p><br/><p>\"Yes.\" Spirit nodded and started introducing the learning function. Theoretically, as long as luck value was supplied, Spirit would be able to self-study up to the point where its intelligence reached an extremely terrifying level. Anything it wanted to know, luck value would enable it to learn. Moreover, different from others who would encounter mistakes during the learning process, Spirit would be able to distinguish the right information from the wrong information for everything it learned. This was an extremely efficient learning method. The only caveat was that Chen Feng's authorization was required since luck value would be consumed.</p><br/><p>\"Fine.\" Chen Feng authorized Spirit's self-study. He wanted to see what level this fellow that was akin to a low-level AI could reach after its self-study. Hopefully it wouldn't disappoint him.</p><br/><p>Chen Feng looked at Spirit. \"I will allocate you 100 luck value for now. Show me the result.\"</p><br/><p>He had already decided that he would totally give up on this fellow here if the luck value required was too high and there weren't any results to show for it. He would most certainly not waste more energy and luck value on something so unprofitable.</p><br/><p>\"All right.\" Instantly, Spirit activated its learning mode. To help its learning, Chen Feng allowed Spirit access to an even larger pool of data.</p><br/><p>Shua! Shua!</p><br/><p>The screens flickered unendingly. When Chen Feng saw the flickering screens, he had an odd feeling. He felt like he was talking to an AI, which gave him a rather odd feeling.</p><br/><p>\"Spirit, are you capable of forming a body here?\"</p><br/><p>\"Yes.\"</p><br/><p>\"Form one, then. Your current form is too weird.\"</p><br/><p>\"All right.\"</p><br/><p>Shua!</p><br/><p>With a flicker of light, in the illusory world, a body appeared. As Chen Feng glanced at it, he was so angry he almost spat blood then and there. Spirit had actually assumed the appearance of Qin Hai for its, and a naked Qin Hai to boot.</p><br/><p>Chen Feng felt helpless. \"This is too excessive. What are you thinking in your brain?\"</p><br/><p>\"?\" Spirit felt odd. \"I merely assumed the form of the person with the highest recent frequency of appearance in your brain.\"</p><br/><p>Chen Feng's expression darkened. \"Shut up. Change your form!\"</p><br/><p>What nonsense!</p><br/><p>As Qin Hai had only recently sacrificed himself to rescue Chen Feng and Kong Bai, they had been thinking of ways to rescue Qin Hai. Naturally, Qin Hai had appeared frequently in Chen Feng's mind.</p><br/><p>Spirit pondered before assuming another form. \"All right.\"</p><br/><p>Shua!</p><br/><p>Light swirled around and a brand new body appeared. When Chen Feng got a clear look at the new body, he had a feeling that life was now without hope.</p><br/><p>Chen Feng's head ached. \"Why did you take this form?\"</p><br/><p>Spirit answered honestly, \"This is the person with the second highest frequency of appearance…\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>In short, in his mind, it was either Qin Hai or Kong Bai??? As a genius and a person with a good life, why was his brain filled with those two fellows?</p><br/><p>\"Perhaps it's due to us working together recently.\" Chen Feng inhaled as he comforted himself. \"Change your appearance again… wait. Forget it.\"</p><br/><p>Chen Feng pondered. If the third appearance this Spirit assumed was still a male, he would be wondering if the problem laid in him. That shouldn't be the case. Supposedly, Wang Yao should be the one, right? Perhaps he had zero sexual attraction toward Wang Yao due to her too-young appearance? Mhm… this might be a problem.</p><br/><p>Yi, where have my thoughts wandered to?</p><br/><p>Shaking his head, Chen Feng kicked all those thoughts out of his brain and looked straight at the \"Kong Bai\" standing in front of him. Despite Kong Bai's somewhat handsome appearance, for an unknown reason, the more Chen Feng looked at him, the more he found this guy ugly. This was especially true when he saw that tiny little thing swaying around on his crotch, as the form assumed by Spirit was essentially naked.</p><br/><p>Chen Feng waved his hand. \"Change your form quickly. Assume the appearance of Wang Yao.\"</p><br/><p>\"All right.\" Spirit transformed itself as commanded.</p><br/><p>Shua!</p><br/><p>A delicate and adorable figure appeared. Instantly, Chen Feng blanked.</p><br/><p>Suddenly, Chen Feng assumed a stern expression and stated, \"Hold on. I have a question. How are you forming their bodies? I have never seen any of them naked!\"</p><br/><p>Spirit answered, \"With a small amount of luck power, the perfect data required to reconstruct their body will be obtained. Any problems posed by data can be easily resolved with the power of luck.\"</p><br/><p>\"…\" Chen Feng asked the main question he had: \"In conclusion, Wang Yao is actually not flat chested?\"</p><br/><p>\"Yes,\" Spirit answered.</p><br/><p>\"Why?\"</p><br/><p>\"To know the answer for this, 0.85 luck value is required,\" Spirit prompted.</p><br/><p>\"Take it,\" Chen Feng answered grudgingly.</p><br/><p>Spirit promptly answered, \"Her breasts are too huge and affect her movements when fighting. As such, she wraps them up tightly.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>So this is the reason she appears so flat chested normally? So this little girl is actually a fake loli? I have been scammed! Hold on, why am I thinking about all this?</p><br/><p>Suddenly, he realized that something seemed different with Luck Aura now. Previously, it had been simply impossible for him to know specific answers to specific questions. After the first upgrade, he had gained the ability to exhaust a huge amount of luck value to obtain a limited amount of information, such as the keywords for the answer to a question. On average, every single dialog had wasted 10 luck value. Naturally, all of this had corresponded to the target's strength, how secretive the answer he demanded was, and so on.</p><br/><p>And now…</p><br/><p>This Spirit here was able to give him precise answers. This was the first time Chen Feng had seen the usage of luck value be optimized to the point it reached the decimal points. Suddenly, Chen Feng found Spirit less useless now. Naturally, Spirit showing him Wang Yao's chest wasn't the reason for his change of mind… Rather, it was Spirit's ability to optimize the usage of his luck value! Chen Feng was certain that if he had asked this question in the past, at least 10 luck value would have been required. And now, it was sufficient with just 0.85 luck value.</p><br/><p>\"The luck value can be calculated so accurately, even to the decimal point?\" Chen Feng asked.</p><br/><p>Spirit nodded. \"That's right. With my current strength, I am able to optimize it to two decimal points.\"</p><br/><p>Chen Feng nodded. \"All right. Put on some clothes, then.\"</p><br/><p>Spirit nodded. \"Mhm.\"</p><br/><p>Shua!</p><br/><p>An adorable sailor outfit materialized.</p><br/><p>Chen Feng: \"…\"</p><br/><p>The unbounded chest and the astonishingly weeb-like style of this dress… This look of Wang Yao's proved extremely fatal toward Chen Feng. This was truly…</p><br/><p>Spirit was seemingly able to note Chen Feng's odd expression and hastily explained, \"This is based on what's in your mind…\"</p><br/><p>\"Shut up!\" Chen Feng shouted.</p><br/><p>Spirit stopped meekly. \"Oh.\"</p><br/><p>Chen Feng kneaded his head before saying, \"Erm, I think it's still better if you assume a different appearance. Mhm… take the appearance of a person I have never seen before, all right? Assume a cuter appearance, an appearance that gives off a comfortable feeling. Most importantly, that must not be a naked person.\" Chen Feng sighed. \"Do you understand?\"</p><br/><p>Spirit nodded. \"All right.\"</p><br/>\n</div>"}