{"title": "Chapter 423: Confrontation!", "id": 423, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-423-confrontation", "volume_title": "Volume 5", "body": "<h1>Chapter 423: Confrontation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 423: Confrontation!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Headquarters of the Genetic Union.</p><br/><p>\"Defense test complete.\"</p><br/><p>\"First round of tests complete. Degree of resistance: …, Scope of resistance: …, Test duration: …\"</p><br/><p>A faint layer of gold was swirling around the entire Genetic Union. This was the latest defensive system installed by the Genetic Union, and it was more efficient and more powerful. It was a defensive system that, theoretically, as long as its energy supply remained, would be able to defend against any and all attacks, attacks with power surpassing A class included.</p><br/><p>\"Why are we building this thing?\"</p><br/><p>\"I suppose it's due to the previous Mysterious Killing Command?\"</p><br/><p>\"Didn't we defend the headquarters successfully?\"</p><br/><p>\"But still, that was thanks to Chen Feng, right?\"</p><br/><p>\"True.\"</p><br/><p>Everyone was discussing without stop. This new energy defensive system required a huge amount of manpower and resources, and it had exhausted a huge amount of resources. If it wasn't for their president agreeing to this, just accumulating enough resources for this would have been difficult, let alone completing the setup.</p><br/><p>\"The president is getting somewhat stubborn.\"</p><br/><p>\"True, considering the huge amount of resources spent on this, wouldn't they have been better used elsewhere?\"</p><br/><p>\"True, true,\" someone stated.</p><br/><p>Suddenly, at this moment, the sky darkened.</p><br/><p>\"Yi?\"</p><br/><p>\"It's going to rain?\"</p><br/><p>\"Hell, the weather forecast is indeed inaccurate.\"</p><br/><p>Everyone looked up at the sky as they complained. Suddenly, their expressions changed.</p><br/><p>\"That is…\"</p><br/><p>Bang!</p><br/><p>Space cracked apart, and akin to something shrouded in black ink, the entire sky turned black.</p><br/><p>Next, a choking aura that gave rise to a feeling of despair started emanating from the sky. Black raindrops started falling down from the sky. Gradually, the rain became heavier, seemingly attempting to alter the very land beneath the sky.</p><br/><p>Hum—</p><br/><p>The defensive system of the Genetic Union activated noiselessly.</p><br/><p>Splat! Splat! Splat!</p><br/><p>The black raindrops landed on the barrier, resulting in a pattering sound.</p><br/><p>\"Something must have happened!\"</p><br/><p>Everyone's heart sunk. This new defensive barrier of theirs would most definitely not have any reaction toward normal weather phenomena. Only when facing an attack or modified weather would this defensive barrier react. These black raindrops…</p><br/><p>Splat! Splat!</p><br/><p>But then, the Genetic Union was still the Genetic Union, after all. Almost instantly, someone could be seen making a move. One person with sharp eyes stared straight toward several ordinary villagers several hundred kilometers away and noted that when the rain dropped onto their bodies, nothing unusual happened. Just like an ordinary raindrop, when it landed on their bodies, they would either wipe it away or shake it off or it would ricochet off their bodies and land on the ground.</p><br/><p>His gaze flickered around. Only after observing several tens of thousands of people did he make his conclusion. \"The rain is not harmful toward a human's body.\"</p><br/><p>\"Mhm…\" Another person wrinkled his nose for a long time before saying, \"No unusual aura detected. This rain is harmless.\"</p><br/><p>\"The rain is not corrosive in nature,\" another person concluded.</p><br/><p>In a short few seconds, the experts of the Genetic Union were done with their analysis. Regardless of the angle they looked at it from, this seemed like rain that had nearly zero differences from normal rain. If one insisted on highlighting the difference, then the only difference would be the black color of the rain.</p><br/><p>However, if this was regular rain, why had their defensive barrier activated?</p><br/><p>Shua! Shua!</p><br/><p>The rain pattered down from the sky without stop.</p><br/><p>Due to the black raindrops, the sky appeared even scarier, and the black mass gave them a choking feeling.</p><br/><p>They were all alarmed. \"What exactly is going on?\"</p><br/><p>Was this an omen of something to come?</p><br/><p>\"Could this be another plot of the Mysterious Organization's?\" someone asked.</p><br/><p>\"Nope. The same black rain has appeared at all our branches as well.\"</p><br/><p>\"All?\"</p><br/><p>They were all shocked. One had to know that the Genetic Union had branches all over the planet. At nearly every single place humanity could reach, there was a Genetic Union branch. Did this not mean that this black rain was falling everywhere?</p><br/><p>\"Wait. Do we have anyone at any untamed or unknown regions? Those we can contact?\"</p><br/><p>\"Yes.\"</p><br/><p>\"Get them to check out the situation over there.\"</p><br/><p>\"Mhm.\"</p><br/><p>Someone started contacting their friend to check it out. Soon, the reply was received. Similarly, black rain was drizzling down over there as well. At this, everyone exchanged gazes as their hearts chilled.</p><br/><p>\"What happened, exactly?\"</p><br/><p>They became increasingly anxious. At this moment, the entire world had seemingly sunk into darkness. The enigmatic rain and their defensive barrier that had activated for no apparent reason were seemingly hinting that something was happening right now.</p><br/><p>In the central area of the Genetic Union, one person was muttering while looking up at the starry sky, \"Hopefully this is not the exact thing I was worried about… After all… we should still have some time left.\"</p><br/><p>**</p><br/><p>At a certain location in the unknown region, Chen Feng and his barbarian squad appeared.</p><br/><p>Chen Feng rejoiced. \"Haha, we're out!\" His previous operation had been too hard.</p><br/><p>He had already been aware that his Luck Aura was powerful. However, he was still pleasantly surprised at what his Luck Aura had done for him. Only now did he realize that he only needed to utilize his luck value properly and he would be omnipotent!</p><br/><p>But then…</p><br/><p>Chen Feng checked his Luck Aura. Presently, his Luck Aura was about to be done with the upgrade. As such, such an amazing feat would be something he had no chance of repeating in the future. However, now that the luck value of the Spirit Sea wood had all been absorbed and his Luck Aura upgraded, his future life might pass easier.</p><br/><p>Shua! Shua!</p><br/><p>The raindrops landed on Chen Feng's body.</p><br/><p>Chen Feng was somewhat amazed. \"What exactly is this?\" The entire sky was shrouded in darkness. Something terrifying was seemingly preparing to happen. However, this rain was truly harmless. As such, nobody had any idea what was happening. They could only wait silently. As for Chen Feng, he had finally completed his mission of infiltrating the Mysterious Organization!</p><br/><p>Chen Feng inhaled deeply. \"Time to return, then.\" Regardless of what these black raindrops were, regardless of the event to come, he had to first rush back.</p><br/><p>Shua!</p><br/><p>He set off with the barbarians. However, after they traveled 10 kilometers, from the dusky sky, amidst the pattering rain, a figure flashed past, akin to the shadow of a ghost.</p><br/><p>Chen Feng was immediately startled. \"Who is it?\"</p><br/><p>Shua! Shua!</p><br/><p>That figure flickered before slowly solidifying. A familiar person could be seen.</p><br/><p>Chen Feng narrowed his eyes. \"It's you.\"</p><br/><p>That figure split apart the raindrops around him and started flickering with a familiar green light. \"I told you. You will die here.\"</p><br/><p>It was actually Lu Hun! He had actually appeared here!</p><br/><p>\"I initially believed that they would be capable of killing you.\" Lu Hun sneered before continuing, \"It seems like I still have to do the job myself.\"</p><br/><p>Chen Feng inhaled deeply. \"So it's you.\"</p><br/><p>He had been curious as to why he had been discovered despite his secretive actions when he had been sneaking into the Mysterious Organization. Now that he looked at this, if there was someone like Lu Hun keeping watch, it would be reasonable for him to be discovered. After all, this guy was a green diamond member…</p><br/><p>Mhm. This was an expert so strong the present Chen Feng couldn't even begin to imagine his strength. Was this his real body? Chen Feng paid close attention and breathed out in relief. Since the green radiance did not seem so dense, it seemed like this was yet another clone.</p><br/><p>Chen Feng laughed. \"Do you think that you can kill me with just a clone?\" This wasn't the first time Lu Hun had tried to kill him with a clone.</p><br/><p>\"It's sufficient,\" Lu Hun stated calmly. \"However, in view of how you are capable of using unique methods to escape every single time, this time, I won't give you any chances. Mhm, no chances at all,\" Lu Hun repeated himself seriously.</p><br/><p>\"Mhm?\"</p><br/><p>Chen Feng had an ominous feeling. Right at this instant.</p><br/><p>Shua!</p><br/><p>A black shadow flashed past. From the pitch-black night sky, a figure flashed past and descended like an apparition. Before he could even realize it, that figure had already appeared behind him. Chen Feng glanced back, and instantly, his expression changed greatly. That was because, on the forehead of the newcomer, a black diamond could be seen shining.</p><br/>\n</div>"}