{"title": "Chapter 436: Family Secret and Such", "id": 436, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-436-family-secret-and-such", "volume_title": "Volume 5", "body": "<h1>Chapter 436: Family Secret and Such</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 436: Family Secret and Such</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>The underling smiled bitterly. \"Yes. We have already captured the culprit. It was our ex-butler. It is said that after he heard about this, he tattooed his entire body with the blueprints of our estate and planned to dig a tunnel in here to steal the God Punisher formula.\"</p><br/><p>\"…\" The patriarch was so angry his entire body started trembling. \"Have you managed to interrogate anything out of him?\"</p><br/><p>The patriarch felt powerless.</p><br/><p>\"Oh. Based on the clues we investigated, when he was looking for people to dig the tunnel, he once said that an ordinary person would never be able to enter the Wild Saint family, apart from him, since the blueprints were all designed by him.\" The underling felt helpless as he said this.</p><br/><p>\"This is so infuriating!\" The patriarch almost fainted from the anger. Back then, this butler had indeed been involved in the design of the blueprints for their estate. Even this old butler had been tempted by Chen Feng's offer, let alone others. The reward offered by Chen Feng was truly too astonishing. That was the only reason for all this. As for God Punisher, it was instead too worthless in comparison. If it wasn't for Chen Feng wanting this formula, this formula would most probably be incomparable even with those 3-star formulas.</p><br/><p>\"How did you guys discover him?\" the patriarch asked. If this old butler was truly the one who had looked for someone to dig the tunnel and had reached the point where he even had the entire blueprint tattooed to his body, he should have been able to avoid the locations that would be discovered. If so, how had these ordinary guards discovered him?</p><br/><p>\"Oh.\" At this question, the underling sunk into silence.</p><br/><p>The sharp patriarch was able to sense that there was some trick at work here. \"Say it.\"</p><br/><p>\"This is what happened.\" The underling paused before carefully continuing, \"It is indeed true that this was planned by the old butler. However, when he had almost reached his destination, an entirely different tunnel somewhere caused a huge collapse in the ground. That is how we found out about this, and we captured him as a result.\"</p><br/><p>The patriarch was horrified. \"There's already an entirely different tunnel down there? Whose work was it? Where does the tunnel lead?\"</p><br/><p>When had their family been penetrated to such an extent? Was this the work of other local powers in this city that were planning to make a move against them?</p><br/><p>\"Erm.\" The underling appeared somewhat distracted. \"It… it leads to the inner layer of your wife's wardrobe.\"</p><br/><p>\"???\" The patriarch was stupefied. The inner layer of his wife's wardrobe? Why was he not aware of this? Hold on, why was there even an inner layer in his wife's wardrobe? Hold on… Suddenly, the patriarch felt like this was something entirely different.</p><br/><p>As for the underling, he had already shut his mouth, no longer daring to say anything. Instantly, the mood there became somewhat awkward. The patriarch remained silent for a very long time.</p><br/><p>He sighed deeply. \"Have I been wrong?\" He had never expected his \"confrontation\" with Chen Feng to bear this kind of fruit. This guy was merely a young genius, a fellow who had only become popular due to his gene productions. Unexpectedly, this guy was capable of such ploys as well.</p><br/><p>\"Perhaps… it's truly time for me to move on from the position of patriarch.\" The patriarch sighed. Perhaps he was truly too old now and was no longer capable of keeping up with this new era.</p><br/><p>\"Contact Chen Feng,\" suddenly, the patriarch said. \"I will sell the God Punisher formula to him.\"</p><br/><p>As his sight landed outside the window, he saw the budding sprouts that had just broken out of the soil. Along with the birth of the green newborn vegetation, a vigorous vitality was brought upon this world, seemingly signifying the glory of a new generation.</p><br/><p>The underling nodded. \"All right.\"</p><br/><p>As the patriarch continued observing the soil outside the court. The sight of the vegetation dying and becoming colorless due to the unending black rain could be seen. That night, Chen Feng appeared there once again. Different from last time, when he appeared this time, without a trace of politeness, he occupied their main seat immediately. Despite this, those of the Wild Saint family could only stand by the side, smiling.</p><br/><p>In a short few hours, they seemed to have experienced the greatest rise and fall a human could experience. This was merely restricted to the pressure they felt from the locals here at Seawood City. Without a doubt, all they had encountered was merely the doings of those who had already been here in the city. By the time those true experts from outside the city arrived… it was probable that the entire Wild Saint family would end up flattened. This was a risk they could not afford to take.</p><br/><p>\"I'm sorry,\" the patriarch apologized politely. He had been rather decisive when he had plotted against Chen Feng. Now that he had been defeated, he admitted his mistake in a decisive manner as well, conducting his affairs in an open and direct manner, not dragging the affair on and on.</p><br/><p>The patriarch demonstrated the highest degree of sincerity he could. \"This is the God Punisher formula. Please take it.\"</p><br/><p>Chen Feng merely smiled toyingly. \"Oh? However, I am no longer interested in this.\"</p><br/><p>\"Ah?\"</p><br/><p>All the Wind Saint family members were stupefied. No… no longer interested? The patriarch nearly cried out then and there. Bro, please don't toy with us like this.</p><br/><p>\"We can reduce the price,\" the patriarch stated with an aching heart.</p><br/><p>Chen Feng looked at him. \"Oh?\"</p><br/><p>\"Half price,\" the patriarch stated as he clenched his teeth.</p><br/><p>Chen Feng merely stared at him calmly.</p><br/><p>The patriarch's heart ached. \"One-fifth of the price?\"</p><br/><p>As for Chen Feng, he still maintained his calm expression.</p><br/><p>\"One-tenth of the price?\" The patriarch was on the verge of crying.</p><br/><p>Chen Feng wasn't even bothered.</p><br/><p>\"…\" The patriarch was on the verge of collapse. Finally, he clenched his teeth and said, \"We have always maintained a good relationship with the Gene Production Association. In view of that, we will gift you this formula!\"</p><br/><p>The expressions of the rest of the Wild Saint family changed greatly. \"Patriarch.\" Gift? If they were to sell it at even one-tenth of Chen Feng's original offer, it would still be an extremely high price.</p><br/><p>Chen Feng looked at him in amazement. \"Gift? You won't regret it?\"</p><br/><p>The patriarch had a rather unsightly complexion as he said, \"No regrets.\"</p><br/><p>This…</p><br/><p>The Wild Saint family members exchanged glances. Their patriarch was so incredibly decisive. From his initial plot against Chen Feng until his surrender, he truly had been incredibly decisive. It had reached a point where he nearly surrendered his underpants himself. Since Chen Feng required this thing to the point of doing such a thing, wasn't Chen Feng afraid that the God Punisher formula would be ruined in the process? Chen Feng shouldn't be too extreme, right? If so, why not try to obtain some benefits from Chen Feng then? These were the thoughts of all the Wild Saint family members.</p><br/><p>Unknown to them, their patriarch had known long ago that if they tried threatening Chen Feng one more time with the destruction of the God Punisher formula, the entire Wild Saint family would be over. He no longer dared to threaten Chen Feng. Moreover, even if their threat was successful, to sell the formula for a good price, if Chen Feng insisted on not canceling his offered reward… hehe.</p><br/><p>He was aware that those from the Gene Production Association were rich. However, those as rich as Chen Feng were extremely rare. Presently, he was completely at Chen Feng's mercy. This was also the first time he had witnessed a person as merciless as Chen Feng.</p><br/><p>Chen Feng beamed as he looked at the patriarch. \"You are very smart.\"</p><br/><p>As for the patriarch, he was wiping the cold sweat that had formed on his forehead.</p><br/><p>Suddenly, Chen Feng started radiating justice. \"However, this trade is too unfair for you guys.\"</p><br/><p>\"No, this is absolutely fair!\" the patriarch swore earnestly. \"The mere fact that you have taken a liking to this formula of ours, for this formula to be able to contribute toward humanity, this in itself is already a fair trade for us.\"</p><br/><p>Chen Feng was all smiles as he looked at the patriarch. \"Is that so?\"</p><br/><p>The patriarch nearly vowed then and there that he truly thought that this was fair. \"Absolutely.\"</p><br/><p>\"Fine then.\" Chen Feng smiled. \"Don't worry. I will trade with the original price I offered you. I do not lack money. What I should give you, I will give. However, I still have something I need your help with.\"</p><br/><p>\"Please state it,\" the patriarch replied.</p><br/>\n</div>"}