{"title": "Chapter 432: I Heard That this Ability Matches Extremely Well with Luck Aura, Yo", "id": 432, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-432-i-heard-that-this-ability-matches-extremely-well-with-luck-aura-yo", "volume_title": "Volume 5", "body": "<h1>Chapter 432: I Heard That this Ability Matches Extremely Well with Luck Aura, Yo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 432: I Heard That this Ability Matches Extremely Well with Luck Aura, Yo</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"Therefore, for people like this, God Punisher isn't too powerful an ability. For ordinary genetic warriors, there won't be too many different abilities even when they are grouped together. At most, there will be several trump cards being unleashed at the same time. For this reason, they will most certainly not agree to fuse with a genetic ability that will cause them to be forever weaker than their peers. Even you would most probably not agree to such fate.\" Spirit continued her explanation. \"Besides that, which major family would be willing to pay a huge price to obtain hillsea beast blood essence just to cause the geniuses of their family to be forever weaker than their peers? To become genetic warriors only capable of a single strike?\"</p><br/><p>So that's the reason. Finally, Chen Feng understood. God Punisher, this ability that seemed so tyrannical, actually had so many limitations.</p><br/><p>Suddenly, Spirit started talking again. \"Fifth point—\"</p><br/><p>\"Hold on.\" Chen Feng was astonished. \"There's even more?\"</p><br/><p>Spirit smiled. \"Naturally. After some families found out about these flaws, they once tried raising some geniuses good at using the God Punisher ability. However, a new problem cropped up then, which is precisely this fifth point I was about to say.\"</p><br/><p>Chen Feng wiped his sweat. \"Go on, then.\" This ability that seemed so powerful actually possessed so many problems? No wonder this ability remained unwanted. There was a reason for that after all.</p><br/><p>\"The fifth point is the way in which the God Punisher releases all those previously used abilities. You are aware that God Punisher will unleash all abilities you have used before. However, a single ability—for example, Wind Blade—will also be released only one time. Therefore, out of the many types of Wind Blades you have previously released, which one would be chosen by God Punisher?</p><br/><p>\"From among all the different types of Wind Blades you have released before, a single one will be randomly chosen. Furthermore, the might of that Wind Blade will be exactly the same as when it had been previously released,\" Spirit explained seriously.</p><br/><p>This…</p><br/><p>At this point, Chen Feng was already speechless. So this so-called \"releasing all past used abilities once\" was truly releasing what he had released in the past. Chen Feng had initially believed that the might of this ability would be adjusted in accordance with his present strength.</p><br/><p>Spirit shrugged. \"That is not possible. If it is released in accordance with your present strength, the amount of energy you have will not be sufficient. The basis of the usage of God Punisher is essentially duplicating the abilities you have used before.\"</p><br/><p>Chen Feng felt enlightened. So that's the case.</p><br/><p>No wonder… He had always wondered about the source of energy for the activation of God Punisher. If it was only a pure duplication of what he had used before, it might be justifiable. However, with this, wouldn't this God Punisher be a huge trap for the user? Ever since Chen Feng had learned Wind Blade, how many different Wind Blades had he released? So many it was countless! What if the duplicated Wind Blade was the one when he had first learned Wind Blade? When he had been F class?</p><br/><p>This single flaw was sufficient to cause this amazing-sounding ability to drop greatly in desirability. Such a useless ability caused Chen Feng's heart to ache at the mere sight of it. Therefore, it could be concluded that God Punisher's limitations were too great, and the range of attacks was too huge as well. However, if it was used together with luck value…</p><br/><p>Chen Feng was intrigued. With the assistance of luck value, he would be able to maximize the output of God Punisher. He would truly reach a point where the activation of God Punisher would be equivalent to a destruction so great not even a blade of grass was left alive. Randomness? Whatever was used by Chen Feng would most definitely be the strongest. However, there was still a different issue to address. Among the numerous abilities of Myriad Illusions, Chen Feng had once used healing abilities as well.</p><br/><p>\"You don't have to worry about that,\" Spirit stated. \"You have not used them that much anyway. Moreover, you are the only one capable of maximizing the effectiveness of this ability. The release of God Punisher's abilities is instantaneous anyway. When you use God Punisher, it would be rather suitable to use luck value with it. With only one luck value, you can choose to first use the healing abilities on your enemy, or you can use debuff abilities such as enhancing damage received, enhancing curses received, and so on before erupting with all the damage-dealing abilities instantly. Naturally, you can also choose to use healing abilities toward the end. By that time, your enemy would be dead already anyway, so it won't matter. With luck value, you can regulate the release of the abilities.\"</p><br/><p>By the time Spirit finished the explanation, Chen Feng was already tempted. So… God Punisher could be used in such a manner! Based on Chen Feng's past gaming experiences, this would be equivalent to first spamming debuff abilities toward a boss before insta-killing the boss with burst abilities. With this, the damage dealt would most definitely be off the charts—an extremely powerful combo!</p><br/><p>\"I am also capable of giving you some suggestions.\" The hands of Spirit flickered with light. \"The amount of abilities contained in your version of Myriad Illusions is much higher than in others' Myriad Illusions. With luck value, you can first unleash all the abilities that counter your opponents, including those minor abilities that normally wouldn't be used. With this, you will have an extremely huge amount of basic damage-dealing abilities.</p><br/><p>\"Moreover, the combination of Myriad Illusions and Wind Blades is equivalent to creating countless never-before-seen 2-star secret arts, their combination with Energy Equipment is equivalent to all sorts of 3-star secret arts, and so on. With this, by the time you are done activating the various combinations at least once to build up your history of used abilities, when God Punisher is activated, it will most definitely be incredibly astonishing.\"</p><br/><p>Slowly, Spirit finished the explanation. Chen Feng was already filled with eagerness.</p><br/><p>Wow! Even thinking about this is sufficient to cause my heart to jump!</p><br/><p>A huge amount of 1-star abilities, 2-star secret arts, and 3-star secret arts, if all these were blasted toward an opponent, anyone could be insta-killed easily, A classes included! Chen Feng was already extremely eager to give it a try. His only regret was the fact that his Nethergaze couldn't be used together. Otherwise…</p><br/><p>Spirit chuckled. \"Otherwise, you would be finished. God Punisher is, after all, a mere trump card. If all the abilities you have in your repertoire are used to construct this trump card, you will truly transform into trash capable of only a single strike. Don't forget that Nethergaze is already one of the strongest abilities your God Punisher will be able to release.\"</p><br/><p>Instantly, Chen Feng became speechless. Isn't that right? A trump card is still a trump card, after all.</p><br/><p>With this explanation by Spirit, Chen Feng's goal became clear. God Punisher! He had to obtain this ability!</p><br/><p>Suddenly, Chen Feng thought of something. \"What if the enemies are high in amount?\" It was rather impossible for him to have only a single enemy. If the enemies were great in amount, the effect of God Punisher might be weakened.</p><br/><p>Spirit winked. \"Among your abilities, you have quite a number of area-of-effect abilities, right?\"</p><br/><p>Instantly, Chen Feng was relieved. True, despite the great limitation of God Punisher where the user would exhaust all his energy after using it, who said that God Punisher had to be a single-target attack? With the methods available to Chen Feng, he would be able to create a huge amount of area-of-effect abilities. At that time… with an activation of God Punisher, bang! Everything would perish!</p><br/><p>\"Give me the coordinates, location, and strength of hillsea beasts!\" Chen Feng had a resolute gaze. \"Don't forget to give me the formula for this gene reagent as well.\"</p><br/><p>\"All right.\"</p><br/><p>Shortly afterward, the coordinates were obtained. Not much luck value had been consumed for this. However, what caused Chen Feng's heart to ache was the formula for the gene reagent. To obtain it, 3,888 luck value was required.</p><br/><p>Chen Feng: \"…\"</p><br/><p>Based on the recovery rate of 24 luck value per day, he would require 162 days to replenish this? Instantly, his expression darkened. Presently, he only had around 900 luck value on hand. If he truly wanted to wait for his luck value to be sufficient, it would be too late. He only had a single week for this. After one week, the Star City battle would begin and calamity would descend. Chen Feng could remember clearly how a countless amount of people he knew would perish during that event. He would not permit something like that to happen. He had to become stronger. If so, only one method was left for him.</p><br/><p>\"Spirit, list out the powers that have this formula.\"</p><br/><p>\"All right.\"</p><br/>\n</div>"}