{"title": "Chapter 446: The Power of the Hillsea Gene Reagent", "id": 446, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-446-the-power-of-the-hillsea-gene-reagent", "volume_title": "Volume 5", "body": "<h1>Chapter 446: The Power of the Hillsea Gene Reagent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 446: The Power of the Hillsea Gene Reagent</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>That's right, this person was precisely Chen Feng. He had thought of countless methods for foiling this perfectly laid plan of Old Mei's. Assassinations, ambushes, reaping profit among chaos, and many others had been considered. Ultimately, he had decided to stick to what he was good at: gene production.</p><br/><p>Hillsea gene reagent? Previously, such a thing had not existed. If this thing had truly existed, the hillsea beasts here would have probably gone extinct long ago. Therefore, to look for a suitable formula for this scam of his, he had utilized 100 luck value to find for this formula before swapping one of the main materials of this formula with a material from hillsea beasts, giving birth to this so-called unique formula: hillsea gene reagent.</p><br/><p>Shua! Shua!</p><br/><p>His gene production was speedily completed. In Chen Feng's hands were two rather unassuming spheres. The glimmering spheres appeared rather gorgeous, yet they had no powerful aura within them.</p><br/><p>\"Is that thing the hillsea gene reagent?\"</p><br/><p>\"It should be fake, right?\"</p><br/><p>\"I think so as well.\"</p><br/><p>With faces filled with doubt, they looked at this guy with a small patch of beard.</p><br/><p>\"Here.\"</p><br/><p>Ignoring them, Chen Feng handed one of the reagents to the one who had hired him to produce them.</p><br/><p>That guy did not seem to doubt Chen Feng. \"How do I use this?\"</p><br/><p>\"It's simple,\" Chen Feng said, gesturing. \"Toss it out and activate it with your spiritual energy. I have already engraved your spiritual imprint on it. Therefore, only you can trigger it.\"</p><br/><p>\"Oh,\" that person answered knowingly.</p><br/><p>\"Are you two acting a play for us all?\"</p><br/><p>Some people sneered.</p><br/><p>\"My family has a master producer, yet we have never heard of this so-called hillsea gene reagent. Hehe… who are you trying to scam?\"</p><br/><p>\"For you two to act out this play trying to scam everyone here, do you two take us all for fools?\"</p><br/><p>\"By tricking us into hunting down the hillsea beasts like this, you guys will exchange it with this red sphere before fleeing. After that, who will we be able to look for?\"</p><br/><p>\"Nobody knows what the function of that red sphere is anyway.\"</p><br/><p>\"Moreover, when it reaches a point where we actually need to use it yet it ends up useless, whoever using it will most probably end up dead anyway. At that time, who can look for you two for revenge? Is this your plan?\"</p><br/><p>The person questioning them appeared furious.</p><br/><p>Instantly, the rest were startled awake. \"Yeah!\"</p><br/><p>Wasn't that right? What was the function of this gene reagent? Trump card! If it failed in a crucial moment, the mere thought of the ensuing fate of the user was sufficient to plant fear in their hearts. If this was a trick… It would be extremely easy for them to get rid of a huge amount of competitors. Thinking about this alone caused them to feel fear. Regardless of whether this was actually true, as long as such a possibility existed, they would not be willing to take this risk.</p><br/><p>Chen Feng was also astonished. \"The hell, they sure are reacting speedily.\" In fact, he had indeed thought of something similar. However, after considering the possibility of getting exposed and beaten to death, he ultimately had not dared to do it. Unexpectedly, if this plan had been used, it would have truly been exposed.</p><br/><p>Mhm…</p><br/><p>The intelligence of these people had obviously increased, and they were no longer so easy to scam. Fortunately, Chen Feng had not tried that. As his thoughts reached here, he glanced at the person who had purchased the hillsea gene reagent from him. That was a person with countless scars of differing sizes on his face. Evidently, this was a rather ferocious person.</p><br/><p>Chen Feng coughed. \"Heh, brother. Are you not intend to try the might of this thing?\"</p><br/><p>\"Nope,\" Scarface stated with a sonorous voice.</p><br/><p>Chen Feng narrowed his eyes. \"What if I waive the fee and give you both the gene reagents?\"</p><br/><p>Scarface's eyes lit up. \"Oh?\" Looking at Chen Feng with a faint smile, he thought that this producer here was truly a scheming person. Since this producer was not willing to personally get rid of the enemy, this producer was trying to make use of him to get rid of the enemy. Unfortunately, this was an offer he couldn't reject anyway. After all, this hillsea gene reagent was a new product that he had never used before. As such, he wouldn't dare to use it as a true trump card. Since now there was an opportunity to try it out…</p><br/><p>Scarface's gaze became cold. \"Deal.\"</p><br/><p>Shua!</p><br/><p>The red sphere in his hand was immediately tossed toward that person questioning them.</p><br/><p>Xiu!</p><br/><p>The red sphere transformed into a red streak as it pierced through the air as it advanced.</p><br/><p>The expression of that person changed greatly. \"What are you doing?\"</p><br/><p>Scarface merely calmly stated, \"Since you are saying that this is fake, you can have some fun with it.\"</p><br/><p>\"Sh*t!\" That person retreated rapidly.</p><br/><p>Regardless of whether this red sphere was the real deal or a fake, he would not dare to take the risk of taking it on. He fully activated his defense as he retreated without stop. However, the red sphere had already reached him.</p><br/><p>Bang!</p><br/><p>Accompanied by a resounding bang, the area of the explosion was instantly enveloped by a blinding red and white radiance.</p><br/><p>Bang! Bang! Bang!</p><br/><p>The earth trembled without stop. The violent explosion shocked everyone there.</p><br/><p>\"This might…\"</p><br/><p>\"It's actually real?\"</p><br/><p>\"Damn, so powerful.\"</p><br/><p>\"An illustrious early-tier A class was killed just like that?\"</p><br/><p>\"Too scary!\"</p><br/><p>\"If this thing is used to hunt the hillsea beast…\"</p><br/><p>Instantly, they were all tempted. Why had nobody been successful in completing the mission so far? Due to the sheer amount of the hillsea beasts here. In the vicinity of every single young hillsea beast, there were countless adult hillsea beasts wondering around. The only thing they could do was kill those hillsea beasts off one by one in a painstaking manner. Moreover, they had to ensure that they remained undiscovered by the other hillsea beasts. Every step they took was with great difficulty.</p><br/><p>If they obtained this thing here… Every single hillsea beast they killed, they would be able to transform it into a superpowerful trump card. As long as they hunted a sufficient amount of hillsea beasts, they could even fight the entire group of hillsea beasts here. At that time, what difficulty would hunting a mere young hillsea beast pose them?</p><br/><p>Countless people were tempted. \"This thing…\"</p><br/><p>\"Kid, you're mine.\" A burly guy stepped out and pointed at Chen Feng before saying with a malevolent expression, \"Since you have such production capabilities, you might as well serve our power.\"</p><br/><p>Before Chen Feng could even say anything, someone else interrupted. \"Get lost. With what little power you guys have, what makes you think you can compete against us?\"</p><br/><p>\"He should belong to us instead.\"</p><br/><p>They started fighting over Chen Feng. Moreover, some of them were even making a move against Chen Feng directly only to end up getting stopped by the others.</p><br/><p>Suddenly, Chen Feng, who was all smiles, stated, \"Everyone, I will be staying here and will not be going anywhere. As long as you all provide me the materials, I can produce for you guys at any time, regardless of the power you belong to. Therefore, there is no need to fight over me. After all, I am merely a gene producer here to earn some service fees. Moreover…\" Chen Feng pointed at some vanishing figures far away. \"A lot of people are already starting the hunt. If you guys continue fighting here, I'm afraid someone else will get a head start.\"</p><br/><p>Only at this and after snorting coldly did they stop. \"Hmph!\"</p><br/><p>The burly guy evidently did not intend to let Chen Feng go. \"Kid. After I'm done with this, I will come looking for you.\"</p><br/><p>Chen Feng smiled as he looked at them. \"You're always welcomed.\"</p><br/><p>\"Let's go!\"</p><br/><p>Only now did they leave speedily.</p><br/><p>Soon enough, the surroundings sunk into silence once again. However, not far away, there were several people seemingly resting there. Chen Feng merely glanced at them, not really bothered about them. These people had evidently been left behind to monitor him.</p><br/><p>Mhm…</p><br/><p>They were monitoring him to prevent his escape. Naturally, if other powers were thinking of making any moves against Chen Feng, these people would most probably protect him as well. They should be the people left behind by the several major powers earlier. Toward all this, Chen Feng maintained a calm facade. This time, he was truly not scamming them. As such, he had nothing to be afraid of. Since he was an excellent producer, when he was out producing gene reagents, he would most certainly win honor for his Gene Production Association. More importantly, he was offering a quality product at a cheap price.</p><br/><p>After all, I am a good and honest person.</p><br/><p>Chen Feng was all smiles as he observed the busy crowd. Despite the power of this hillsea gene reagent, with Chen Feng's strength, the beasts were still not something he could touch. After all, adult hillsea beasts were required for materials, and even the weakest of the hillsea beasts would still be an A-class beast. Therefore, this noble mission would have to be left on the shoulders of these cute explorers here at the Othershore Mountain.</p><br/>\n</div>"}