{"title": "Chapter 453: Genetic Ability, Mutate!", "id": 453, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-453-genetic-ability-mutate", "volume_title": "Volume 5", "body": "<h1>Chapter 453: Genetic Ability, Mutate!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 453: Genetic Ability, Mutate!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>After careful consideration, Old Mei decided to directly carry this young hillsea beast over to that excellent producer. What made him even happier was the fact that more and more people had seemingly completed the mission, perhaps thanks to the red spheres. Some were returning with dead young hillsea beasts, while some were back with young hillsea beasts that were still alive. There were now more and more young hillsea beasts.</p><br/><p>Unfortunately, none of them would be able to leave this place alive. Almost all of them would be welcomed by Old Mei at a certain unavoidable route before being bombarded to death, nourishing Old Mei's strength. Naturally, the smart Old Mei would deliver all the young hillsea beasts to the producer, trading them for the red spheres.</p><br/><p>Curiously, though, that producer's gaze when looking at him became stranger and stranger. From the initial astonishment, it had become a gaze of longing and then a burning gaze when looking at him. That gaze… Perhaps this guy was one of those who preferred the same sex… and preferred older individuals on top of that? At this thought, Old Mei shuddered. No, no! Old Mei comforted himself that this producer was probably admiring his strength. Mhm… that had to be the case! Old Mei was able to trade all the young hillsea beasts he had obtained for red spheres without any hiccups.</p><br/><p>Thanks to this continuous trade, despite his numerous operations, his supply of red spheres was still abundant. Together with his hillsea beast pet that would get killed occasionally, Old Mei did not lack red spheres at all.</p><br/><p>Shua! Shua!</p><br/><p>Once again, Old Mei returned with another young hillsea beast. By now, the crowd there was already looking at Old Mei with an amazed yet numbed gaze.</p><br/><p>\"He's back again.\"</p><br/><p>\"Yeah, back with yet another young hillsea beast.\"</p><br/><p>\"Previously, when he returned with young hillsea beasts without stop, I thought that he was merely lucky. Unexpectedly, this guy is actually able to keep bringing young hillsea beasts here without stop.\"</p><br/><p>\"Maybe he has some tunneling-related ability or something.\"</p><br/><p>\"That's possible.\"</p><br/><p>\"How many young hillsea beasts has he brought here thus far?\"</p><br/><p>They sighed. They had been watching on as this Old Mei had returned with young hillsea beasts an uncountable number of times. Moreover, this guy hadn't carried the beasts out of this mountain at all. On the contrary, he carried all of them to the producer.</p><br/><p>\"Here, another one,\" Old Mei stated calmly.</p><br/><p>Chen Feng looked at him with an amazed expression. \"…Why are you sending yet another one here?\"</p><br/><p>Old Mei assumed a regretful expression. \"It's already dead. Each and every time, if I attack too lightly, the enemies survive my attack, yet when I attack too strongly, I accidentally kill the young hillsea beasts instead. Sigh.\"</p><br/><p>So that's the case. As the others heard this, they took joy in this seeming calamity. No wonder this guy had carried so many young hillsea beasts here instead of leaving. So he hadn't completed the mission either? At this point, nobody was bothered with the 5-star secret arts anymore. Among those who had survived this long, which of them were bothered about some mere 5-star secret arts?</p><br/><p>\"All right.\" Chen Feng completed the trade in a well-practiced manner.</p><br/><p>\"Mhm.\"</p><br/><p>After receiving the red sphere, Old Mei left. As for Chen Feng, he appeared rather gratified as he gazed at Old Mei's leaving figure. Another young hillsea beast obtained!</p><br/><p>\"Spirit, does this young hillsea beast fulfill the requirement?\"</p><br/><p>\"Yes.\"</p><br/><p>Chen Feng was overjoyed. \"Good. Let's continue, then.\" How many young hillsea beasts had he obtained now?</p><br/><p>He had never expected that just as he had been about to give up on this, Old Mei would be the one who carried one young hillsea beast after another to him. Moreover, each of the young hillsea beasts seemed to be stronger than the previous. Even though all the beasts were dead, Chen Feng was able to see that these beasts had all been freshly killed. This old chrysanthemum freak that had schemed against Chen Feng back then had actually transformed into Chen Feng's lucky star here at this Othershore Mountain. Of course, the premise for all this was him not knowing Chen Feng's real identity.</p><br/><p>\"Mhm…\"</p><br/><p>Chen Feng stared at the 10 gene reagents he had. All these were newly produced gene fusion reagents—all of them were mutated gene reagents. Since the process of improving had been recorded by Spirit previously, not much luck value was required for him to produce these new mutated gene reagents. For each production, less than 10 luck value was required. Despite this, Chen Feng was still unable to control the mutation. This was because the type of mutation was not a matter of probability. Rather, it was determined by the type of genes contained within the young hillsea beasts he used.</p><br/><p>Therefore, this depended on fate. Naturally, Chen Feng could also choose to first use luck value to discern the type of genes within the young hillsea beasts. However, based on Spirit's calculation, doing this would consume more of his luck value. Since the number of genes within a single hillsea beast was too high, 10 luck value would be required for each study.</p><br/><p>For a single production, only around three luck value would be required. Therefore, he had decided to directly produce all of them instead.</p><br/><p>----</p><br/><p>Mutated God Punisher 1: Among the abilities the user has used before, choose the type with the highest damage and then release them all once.</p><br/><p>Consumption: All energy.</p><br/><p>Cooldown period: One day.</p><br/><p>----</p><br/><p>This was a totally different version of this ability. The original God Punisher released one of each ability, yet for this version, a single ability would be chosen for the release. For example, a huge amount of Nethergazes would be released if this version of God Punisher was used instead. This was indeed a rather powerful mutation.</p><br/><p>In short, if the user had only used Nethergaze 10 times in his entire lifetime, this God Punisher would release 10 Nethergazes instantaneously, which would be equivalent to an amplification of 10 times the power. If the user had used it 100 times before? Or 1,000 times? This would be an extremely powerful ability equivalent to the eruption of one's strongest attack after being amplified.</p><br/><p>Naturally, the limitations were rather huge as well. For example, the user could only select a single ability that was the strongest of all. In Chen Feng's case, that would be Nethergaze. If he wanted to use God Punisher to release other abilities instead, it wouldn't happen. However, this would still serve as a formidable trump card. In a way, this version of God Punisher was even stronger than the regular version.</p><br/><p>----</p><br/><p>God Punisher 2: Select all the healing abilities used previously and release them once.</p><br/><p>Consumption: All energy.</p><br/><p>Cooldown period: One day.</p><br/><p>----</p><br/><p>???</p><br/><p>All healing abilities? If so, repeated abilities were allowed? If so, this was totally a god-like healing ability. In the hands of an expert healer, this ability would simply become a bug-like existence. Unfortunately… it wasn't useful for Chen Feng. Despite that, Chen Feng had still kept this version. He believed that with this, his \"The Strongest Gene\" shop would once again have a legendary B-class gene reagent for sale in the future. This version of God Punisher was so powerful it could even match those A-class abilities.</p><br/><p>----</p><br/><p>God Punisher 3: Select all the support abilities used previously and release them once.</p><br/><p>Consumption: All energy.</p><br/><p>Cooldown period: One day.</p><br/><p>----</p><br/><p>All support abilities? Repeated abilities allowed again? Abilities such as Golden Steel Reincarnation or something like that? With this version of God Punisher, if it was used to unleash some stackable buff abilities, the target could even be buffed to the point he became undefeatable. This was much more useful than even viagra! Unfortunately, once again, this ability wasn't particularly useful for Chen Feng.</p><br/><p>As for the rest of the mutated God Punisher gene reagents, they were in similar situations as well. Despite being powerful, they were not suited for Chen Feng. These were indeed very powerful. However, after careful consideration, Chen Feng noted that if he decided to use them, he was better off using the regular God Punisher instead. This was because the regular God Punisher would suit Chen Feng more than these mutated versions.</p><br/><p>Chen Feng inhaled deeply. \"Let's keep trying.\"</p><br/><p>Once again, Chen Feng and Spirit started gene production. After a long time, the production was completed. At this point, Chen Feng was already numb toward successful production. As such, he wasn't as overjoyed as earlier when he had first produced this God Punisher gene reagent. At the very least, with Spirit's help, Chen Feng was able to determine that the mutation direction of this young hillsea beast was not the same as the previous ones, that it would have an entirely different mutation.</p><br/><p>\"Hopefully, this mutation will be usable.\"</p><br/><p>Chen Feng wasn't placing much hope in it. Based on his guesses, the mutations of the God Punisher gene reagent were only comprised of some simple changes or minor improvements. Unfortunately, these changes weren't anything much, merely reaching a point where it would be wasteful to discard the reagents despite not being useful to him.</p><br/><p>Shua!</p><br/><p>Nonchalantly, Chen Feng scanned the newly produced gene reagent. Instantly, he blanked.</p><br/><p>Abruptly, his eyes widened. \"This…\"</p><br/>\n</div>"}