{"title": "Chapter 455: Kill Everyone!", "id": 455, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-455-kill-everyone", "volume_title": "Volume 5", "body": "<h1>Chapter 455: Kill Everyone!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 455: Kill Everyone!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Othershore Mountain.</p><br/><p>A red shimmer appeared in the dusky sky.</p><br/><p>\"What's that?\"</p><br/><p>\"Some unique ability?\"</p><br/><p>\"Wow, it can even cause a natural phenomenon.\"</p><br/><p>\"Or maybe, instead of being a natural phenomenon, it's simply a red light shining upon the sky.\"</p><br/><p>\"Who would be so free they could shine some red light on the sky? What a waste of energy.\"</p><br/><p>Everyone was curious. Right at this instant, a figure could be seen escaping in a sorry manner from the direction of the red light. Fear was plastered all over his face, his entire body was stained with blood, and one of his arms was missing.</p><br/><p>\"Be careful.\"</p><br/><p>Instantly, the rest increased their vigilance. There had been way too many incidents where someone pretended to be seriously injured before ambushing the onlookers. However, this seriously injured person here was an exception to those incidents.</p><br/><p>\"Run! Fast!\" that person screeched in horror. \"That red light… He has broken through… He's slaughtering...\"</p><br/><p>Finishing his words, he continued escaping in the direction of the foot of the mountain, leaving the squad there looking at each other. Red light? Breakthrough? Slaughter? Who was it? Staring at the distant red light, they were confused.</p><br/><p>\"Perhaps something has truly happened?\"</p><br/><p>\"It might be a trick. Hehe. First, he will flee behind us. By the time someone appears from the other direction, he will appear behind us, attacking us from two directions. When that happens, perhaps we won't even know how it happened before dying.\"</p><br/><p>\"…\"</p><br/><p>\"We can't retreat. We must continue advancing.\"</p><br/><p>\"The young hillsea beast is already nearby. We can't let the others get it.\"</p><br/><p>\"True.\"</p><br/><p>They decided to continue their advance. However, not even three minutes later, their steps halted, because at this moment, they saw a familiar figure. The guy called Old Mei could be seen taking a stroll in a relaxed manner. Here at this danger-filled Othershore Mountain, he was strolling without any defenses in an absolutely unrestrained manner. Slowly, he walked forth, until he noticed them.</p><br/><p>Hu—</p><br/><p>A little clump of flame drifted forth, heading toward them.</p><br/><p>\"He's actually attacking us with something like this?\"</p><br/><p>One of them laughed before taking a wide stride forward. At this time, his team member suddenly recalled the earlier scene where a person had been escaping in horror. Instantly, his expression changed slightly. Without hesitation, he took out a red sphere.</p><br/><p>Xiu!</p><br/><p>The red sphere was tossed toward Old Mei. Alarming them, when the red sphere was midair, it clashed with that weak-looking flame before being forcefully eliminated then and there. This red sphere containing a huge amount of energy was actually ineffective against this flame!</p><br/><p>\"How is that possible?\"</p><br/><p>At this sight, all of their expressions changed. What joke was that? That red sphere was equivalent to the full-powered attack of an A-class warrior. Just like that, it was gone? As for the flame, it was still slowly drifting through the air.</p><br/><p>\"Run!\" the captain ordered without any hesitation. As for the person who had stepped forth rashly earlier, it was already too late for him to escape. First, the flame touched his arm. Instantly, the terrifying flame started burning. He was not able to defend against it or destroy the flame. The flame continued spreading without stop…</p><br/><p>Pu!</p><br/><p>Seeing this, the captain chopped his arm off without hesitation.</p><br/><p>\"Go!\" he yelled.</p><br/><p>Shua!</p><br/><p>Accompanied by a terrifying energy shockwave, the speed of the entire squad increased abruptly as they started leaving speedily. Only now did they understand how the earlier person had lost his arm. This flame… All of them were ashen faced.</p><br/><p>Flee! Flee! Flee!</p><br/><p>After an unknown period of time, they finally escaped the range of that clump of flame.</p><br/><p>Old Mei was rather surprised. \"They actually possess a speed-enhancing ability?\" Shortly after, though, he shook his head. It didn't matter. Ultimately, all these people were mere cannon fodder, and it was only a matter of time before they died by his hands. However, this encounter with them had reminded Old Mei of something. \"I can't allow you guys to leave,\" Old Mei muttered.</p><br/><p>Hum—</p><br/><p>A plum blossom bloomed in his hand.</p><br/><p>Xiu!</p><br/><p>This plum blossom formed by a unique flame drifted through the air, heading toward the foot of the mountain. That was precisely the exit of Othershore Mountain. This would serve as the prelude to Old Mei's legend, right here at this Othershore Mountain.</p><br/><p>\"I heard that a murdering maniac appeared over there.\"</p><br/><p>\"Who is it?\"</p><br/><p>\"That Old Mei guy that was returning with hillsea beasts nonstop earlier.\"</p><br/><p>\"What in the world? Has he gone crazy?\"</p><br/><p>\"I have no idea.\"</p><br/><p>\"I heard that his strength is incredibly terrifying. Even several late-stage A-class warriors weren't his match. With a single clash, three of them were killed immediately, and one was seriously injured. Only one was able to escape, and with great difficulty at that.\"</p><br/><p>\"Is this for real?\"</p><br/><p>Everyone that heard this was shocked. Initially, they did not believe in this rumor. However, when mishaps started befalling the people there without stop, finally, they trusted this rumor. After all, they were still A-class experts. Therefore, a lot of them had numerous escape trump cards that resulted in even Old Mei failing to kill them. As such, during his slaughter, there were numerous escaped victims.</p><br/><p>Thereupon, after one escapee after another, everyone there found out about Old Mei's existence. Now, they all knew that at the depths of this Othershore Mountain, there was a terrifying murdering devil. Some of them were not reconciled to this and were thinking of ambushing Old Mei.</p><br/><p>\"What's his strength?\"</p><br/><p>\"My guess is he's a peak A-class warrior,\" one of the escapees stated.</p><br/><p>As he said this, the rest glanced at him. Mhm, he was a late-stage A-class warrior. Indeed, he could be considered an expert here at this Othershore Mountain. However, with him alone, he probably wouldn't even survive a single clash against Old Mei.</p><br/><p>\"Maybe, we can go together?\" someone suggested.</p><br/><p>The other person smiled bitterly. \"The attacking range of that flame of his is extremely huge. For him, a single opponent or a group of opponents—they're the same thing.\"</p><br/><p>At this, the rest sunk into silence. Even grouping together wouldn't work? Suddenly, someone stated, \"There must be some limitations for such a terrifying ability, right? Perhaps it can only be used once per day or it possesses a long cooldown? Something like that?\"</p><br/><p>However, toward this, the rest still maintained their silence. What limitations? Up until now, that guy had never stopped slaughtering. The flame that guy used was seemingly without end. As for his energy, it seemed boundless as well. That seemingly eternal flame had never stopped from the start until now. One of them looked at the sky. \"That red light seems to be the result of that flame?\"</p><br/><p>As the rest looked in the same direction, their hearts chilled. Why was this happening? Why was that Old Mei so terrifying? Some of them decided to give up on this mission. \"Let's leave. His goal is probably the young hillsea beasts. We can just leave this place.\"</p><br/><p>\"Are you guys resigned to this?\"</p><br/><p>\"Even if we are not resigned, what can we do?\"</p><br/><p>\"Hmph. I will go back and call my senior apprentice brother over. He's a peak A-class warrior as well. I want to see, what's the point of him killing us with his identity as a peak A-class warrior?\"</p><br/><p>Another guy agreed. \"My master is a peak A-class warrior as well.\"</p><br/><p>Apart from a few lone rangers, a lot of people here were in fact people with rather formidable backers.</p><br/><p>Hence, a lot of them decided to call on some peak A-class warriors to reinforce them. At this thought, they started heading toward the foot of the mountain. Regardless of whether there were any reinforcements, it was still better for them to leave first. To do that, they would have to leave through the foot of the mountain. However, when they reached the foot of the mountain, they were all alarmed to find that at the exit of Othershore Mountain, a clump of familiar flame was hovering, sealing the exit.</p><br/><p>\"That is…\"</p><br/><p>\"Damn it, it's that flame again!\"</p><br/><p>\"Ah ah ah ah ah ah, is that bastard thinking of killing all of us?\"</p><br/><p>They were all terrified. Only now did they start feeling true terror. Their exit had been sealed, and thus, they no longer had any way to retreat.</p><br/><p>They started gnashing their teeth. \"What are you guys afraid of? Which of us is without a trump card? At most, we will just die together with that guy.\" At this time, a lot of people that had been staying at the foot of the mountain all along were still unaware of what was going on. After finally figuring out what was happening, they were all alarmed. Only now did they notice what had happened here. Suddenly, someone remembered the producer from earlier. \"Where's that excellent producer?\"</p><br/>\n</div>"}