{"title": "Chapter 479: The Terrifying Devil Race", "id": 479, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-479-the-terrifying-devil-race", "volume_title": "Volume 5", "body": "<h1>Chapter 479: The Terrifying Devil Race</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 479: The Terrifying Devil Race</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>The world was still shrouded in darkness. Amid the endless clouds, a pair of eyes was flickering with a silver radiance. Silently, he regarded Star City, which was enveloped by darkness. He watched on as numerous devil race members reawakened before being killed by the Genetic Union. Nothing seemed to be developing according to the plan.</p><br/><p>Humans…</p><br/><p>He looked at this new race. Initially, he had believed that during the reawakening, they would have to confront the ancient race. Beyond his expectations, after that war back then, the ancient race had vanished as well. Now, humans were the one who ruled this world.</p><br/><p>Shua! Shua!</p><br/><p>His eyes flashed. The destruction of each batch of devil race members that appeared was seen clearly by him. He had also borne witness to the strength and methods available to that organization called \"Genetic Union.\" Just like that, in the darkness, he silently observed and analyzed.</p><br/><p>Batches of reawakened devil race members kept dying off, yet he wasn't the least bothered. For him, they were ultimately all cannon fodder.</p><br/><p>Hum—</p><br/><p>His silvery eyes flashed as he hid himself amid the darkness.</p><br/><p>Interesting.</p><br/><p>Everything that happened here, he witnessed with his very own eyes. He had been watching on all along, watching as the blood of the devil race dyed the earth red, watching as the black soil turned purple and as that huge monster finally broke free from the ground.</p><br/><p>Howl!</p><br/><p>An awe-inspiring roar was let loose from the monster's mouth. The formidable power the monster was emanating caused one's heart to fluster as they realized that this monster was a peak A class—a peak A class in the truest sense. Comparatively, this was equivalent to a human that had mastered a 6-star secret art, a powerful genetic warrior that no ordinary person could hope to match. This monster here, with its tough skin and huge size... It was likely that its pure physical strength alone was already as strong as a peak A class.</p><br/><p>Xu Fei charged forth fiercely. \"What is there to fear?\"</p><br/><p>Pa!</p><br/><p>With a single slap, Xu Fei was smashed away and flung out like a shot artillery shell.</p><br/><p>Bang!</p><br/><p>He smashed into the ground, leaving a huge crater.</p><br/><p>\"The strength of this fellow… Damn it, his physical strength alone is already equivalent to an A-class.\" Xu Fei grimaced in pain. \"Charge together!\" Han Yula bellowed coldly. At that, all the Genetic Union warriors made their move.</p><br/><p>Bang! Bang!</p><br/><p>The battle began. Several tens of Genetic Union members surrounded the single devil beast, yet they still seemed disadvantaged.</p><br/><p>\"This beast is too huge!\"</p><br/><p>\"We are at a loss facing it.\"</p><br/><p>Their expressions were unsightly.</p><br/><p>\"?\"</p><br/><p>\"Its skin is strong enough to resist your attacks?\"</p><br/><p>Han Yula couldn't understand the reason they were disadvantaged. He was aware that this beast had powerful physical strength. However, despite how strong the beast was, could it be immune to the attacks of A-class warriors? After all, they had so many A-class warriors here…</p><br/><p>One of them smiled bitterly. \"It's not because of that. The problem is that its skin is too thick.\"</p><br/><p>\"Mhm?\" With a confused expression, Han Yula tried launching an attack.</p><br/><p>Bang!</p><br/><p>As his attack landed, an intense vibration sprang up through his hands.</p><br/><p>\"This feeling…\" Han Yula's expression changed slightly. He had indeed hit the target. His weapon had indeed been stabbed in. However, the moment his weapon had stabbed into the skin, with sorrow, he had found that the thickness of the skin exceeded the length of his entire weapon.</p><br/><p>It was too thick! It was no wonder that all the genetic warriors here appeared stupefied.</p><br/><p>\"We can't do anything at all.\"</p><br/><p>\"I reckon his skin is at least a meter thick…\"</p><br/><p>\"Too scary.\"</p><br/><p>\"Who's capable of inserting through it?\"</p><br/><p>\"My attack tore out half a meter worth of skin from this beast, yet this beast did not even feel anything from my attack.\"</p><br/><p>\"What if our attacks are focused?\"</p><br/><p>\"That won't work; it's healing too fast. Before all the attacks can land, it will have already healed up from the previous attacks. This fellow is simply like a huge meatball.\"</p><br/><p>They all felt helpless. Nearly all their attacks failed to pierce through the skin of this beast. This final devil race member was truly too formidable, so formidable that it gave one a stifling feeling.</p><br/><p>\"Why not try stabbing its chrysanthemum?\"</p><br/><p>\"I tried. It failed.\"</p><br/><p>\"How about attacking its vital parts?\"</p><br/><p>\"Only some skin comes off from those attacks…\"</p><br/><p>\"Sigh.\"</p><br/><p>\"How good would it be if we had some piercing abilities…\"</p><br/><p>They all sighed. Piercing abilities had never felt so precious to them. With the appearance of the devil race, with their skin and physical characteristics, piercing abilities would most certainly become extremely popular among humans from now on. Alas, for now, they would still have to rely on what they had.</p><br/><p>Everyone looked at Han Yula. \"What do we do?\"</p><br/><p>Bang! Bang!</p><br/><p>That devil beast was wrecking destruction in Star City in an absolutely unrestrained manner. None of them were capable of stopping it.</p><br/><p>Han Yula had also tried unleashing his strongest attack, yet it had been blocked by that devil beast's huge flaming sword. That taught them that this beast here wasn't exactly a fool that would stand there and take on all attacks. After all, the devil race was unlike those ordinary beasts. Despite their appearance that resembled mutated beasts, the devil race was a race with wisdom. A thick and sonorous voice traveled to their ears. They could seemingly hear that beast jeering at them.</p><br/><p>Howl! Howl!</p><br/><p>With two loud howls, the ground started trembling as numerous gigantic beasts that looked the same as that huge beast started appearing from the ground. Two, three, four, and more.</p><br/><p>Soon, nine extra such beasts had appeared.</p><br/><p>\"Nine more.\"</p><br/><p>They paled as they saw this. Each of these beasts was as powerful as a peak A-class warrior. Nearly surpassing A class, to be precise. If there was only one here, they could still have tried working together, but now there were 10 of them…</p><br/><p>\"Howl!\"</p><br/><p>As the 10 beasts howled together, the killing intent they emanated was sufficient to paralyze someone.</p><br/><p>Surprisingly, Han Yula became calm after seeing them. \"Finally, you guys have shown yourself… Is this your final trump card? Ten devil beasts? If so, it's our turn, the Genetic Union's turn, to make a move. Senior, please,\" Han Yula said while facing empty air.</p><br/><p>Shua!</p><br/><p>Light swirled around. Abruptly, several silhouettes of light appeared midair.</p><br/><p>Hum—</p><br/><p>An old man appeared out of thin air. Staring attentively at the devil beast, he slowly stretched out his finger. Next, an indescribable pressure converged at the tip of his finger. Slowly, the old man pointed downward.</p><br/><p>Pu!</p><br/><p>A hole appeared on the forehead of one of the devil beasts. Dead! The rest widened their eyes as they saw this. Dead? Holy shit! This terrifying devil beast was dead just like that? They were aware that the Genetic Union would most certainly have deployed some scary seniors here. Unexpectedly, the expert that had appeared was actually this powerful!</p><br/><p>Bang!</p><br/><p>The devil beast collapsed onto the ground, akin to a skyscraper collapsing, bringing about a loud bang as it landed. At this time.</p><br/><p>Pu! Pu!</p><br/><p>The old man pointed down several times, and with that, several bloody holes appeared. Accompanied by loud bangs, the 10 terrifying devil beasts collapsed loudly onto the ground just like that. The devil race had been eliminated.</p><br/><p>Shua!</p><br/><p>Instantly, the entire area lapsed into silence.</p><br/><p>\"Many thanks, senior,\" Han Yula said. At this moment, two other silhouettes that had appeared at the same time as the old man gazed toward the empty air up in the sky.</p><br/><p>Xiu!</p><br/><p>One of them pointed at the air. Instantly, numerous mournful screams resounded from the sky before several devil race corpses rained down, landing on the ground beneath the sky. As for the other silhouette, he merely gazed up at the sky.</p><br/><p>He uttered a single calm word. \"Please?\" Next, light started swirling as a terrifying gust of power surged out.</p><br/><p>Shua!</p><br/><p>Instantly, the darkness shrouding the sky cleared. The darkness receded rapidly and the black rain within Star City evaporated cleanly. Next, that terrifying gust of power pierced through the cloud, puncturing the thick layer of clouds. Finally, the sky was once again bright.</p><br/>\n</div>"}