{"title": "Chapter 473: We… Are Back!", "id": 473, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-473-we%E2%80%A6-are-back", "volume_title": "Volume 5", "body": "<h1>Chapter 473: We… Are Back!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 473: We… Are Back!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>The devil race was coming. After failing to awaken a boss-grade devil race member, the devil race had decided to stick with their regular awakening method. Now, they had chosen to simply wake their members using the soil that was already tinted black. Since they weren't using the Radiance of Demonic Spirit anymore, the solidifying agent prepared by Chen Feng would no longer work.</p><br/><p>Bang! Bang!</p><br/><p>The earth collapsed as numerous ferocious-looking devil race members awakened.</p><br/><p>Howl!</p><br/><p>Numerous howls resounded, and in the dark sky, a bizarre green and blue radiance appeared.</p><br/><p>Everyone inhaled deeply. \"Finally, they are coming.\" From the start, they had been aware that a huge battle was unavoidable. The devil race members that had appeared earlier had merely been a prelude to this huge battle that was about to erupt. Their true enemies were those underneath them, those awakening from the soil beneath Star City. The devil race members that had been hibernating in the soil were all able to awaken through this method. It was something nobody could stop.</p><br/><p>\"Kill!\" Han Yula ordered. As long as there were enemies around, he was not a person to show any hesitation.</p><br/><p>Bang!</p><br/><p>The energy weapons started firing.</p><br/><p>\"Kill!\"</p><br/><p>The genetic warriors charged forth. Amid the heavy downpour, the Genetic Union warriors clashed with the devil race members. As they clashed, raindrops mixed with blood, dying this piece of land violet. These devil race members were very powerful.</p><br/><p>The crucial part of the devil race's plan back then was the long years of hibernation and condensation underground enabling them to be much more powerful after their reawakening. This was what they had planned and this was also the reason they had decided to hibernate in the first place. Only by doing so would they be confident that the moment of their reawakening would also be the moment where the entire world would be conquered by them.</p><br/><p>\"We… are back…\" An ancient language was once again heard in this world as hoarse voices uttered these words without stop. The devil race was, after all, not mutated beasts. They possessed intelligence and had a proper civilization and language of their own. Ultimately, they had been powerhouses back in the ancient era.</p><br/><p>The devil race members that had appeared were all A class. Even an ordinary recently reawakened foot soldier of theirs was as strong as an A-class warrior. Their commoners had long vanished with time, leaving behind only those capable of awakening from their hibernation. All these were elites among the devil race. These were the strongest warriors of their race, who had been forged through countless years of hibernation, nurtured by the vitality of a huge amount of their own that had been used as a sacrifice back then, the strongest warriors that had exhausted an entire civilization to forge.</p><br/><p>Howl! Howl!</p><br/><p>All the devil race soldiers were powerful and ferocious.</p><br/><p>\"Kill!\"</p><br/><p>The Genetic Union warriors did not waste a single second as they were trying to get rid of the devil race members at this moment where these devil race members were still in their weakest state. Otherwise…</p><br/><p>Pu! Pu!</p><br/><p>One figure collapsed after another. Finally, the intensity of this battle reached its peak.</p><br/><p>\"This moment has finally arrived…\" Chen Feng muttered. This was war. Nobody could hope to survive by mere fluke. He was able to produce unique gene reagents to stop the experts of the devil race from reawakening. He was also able to provide support to others. Alas, he was still not qualified to fight on the front lines as he was still too weak. He was, after all, still not an A-class warrior.</p><br/><p>This was a battle only A-class warriors could participate in. Under certain unique conditions, Chen Feng might be able to unleash an extremely powerful combat power. However, that power he could muster was only a short burst of power capable of killing perhaps only one or two enemies. In a battle of this scale with so many enemies, he wouldn't be able to do much at all.</p><br/><p>Therefore, he had to keep his trump card until the crucial moment in the hopes that it would be of some help. Those truly in charge of participating in this battle were ultimately the Genetic Union members.</p><br/><p>Pu!</p><br/><p>Blood splattered about unceasingly. This piece of land in front of the Star City entrance was now a battlefield. The newly reawakened devil race members were obviously still in a daze and were not fully clear headed yet. As such, the Genetic Union warriors, who were veteran combatants, all worked together to kill a huge amount of devil race experts. However, as time passed, devil race members that were even stronger seemed to be reawakening. Things appeared rather bad for the Genetic Union at the moment.</p><br/><p>Bang! Bang!</p><br/><p>Some of the Genetic Union members had even been forced back from the front line by the devil race members. At a certain location, the initially firm soil suddenly turned soft.</p><br/><p>\"Careful.\"</p><br/><p>The genetic warrior there stepped back rapidly.</p><br/><p>A split second after he stepped back, a terrifying devil race member burst out of the ground before immediately swallowing a random devil race member nearby.</p><br/><p>Howl!</p><br/><p>After swallowing that devil race member, it burped.</p><br/><p>Hu—</p><br/><p>A scary flame ignited around its body.</p><br/><p>\"What is that?\"</p><br/><p>Those who saw what happened were all alarmed.</p><br/><p>Bang! Bang!</p><br/><p>This terrifying devil race member started its attack. With its huge body at a height of six meters and the flame around its entire body, it was akin to a fireball with extraordinary strength. On the battlefield, nobody seemed to be its match.</p><br/><p>Han Yula decided to personally face that newly appeared devil race member. \"Let me deal with it.\"</p><br/><p>Alas…</p><br/><p>Bang!</p><br/><p>All his attacks were ineffective. Energy attacks, physical attacks, all of them were ineffective. Even when weapons landed on the thick and round abdomen of this devil race member, the weapons bounced away. Even sharp blades and arrows did not work. Nothing seemed capable of damaging this devil race member.</p><br/><p>Everyone was horrified. \"What damnable thing is this?\" Despite the fact that this devil race member did not possess too powerful an attack, its defense was truly astonishing. Coupled with its huge size, it was akin to a berserk beast. By itself, it was able to keep seven powerful genetic warriors busy.</p><br/><p>Everyone was anxious.</p><br/><p>\"This won't do…\"</p><br/><p>Regardless of how weak that devil race member's attacks were, it was still A class. If they ignored it, the consequences would definitely be fatal. However, if they continued getting tied down by this thing, the overall combat power of the Genetic Union would suffer a significant drop.</p><br/><p>And when that happened, they would not be able to kill those newly awakened devil race members in time. And by the time the newly awakened devil race members all regained their full consciousness, the devil race would become even stronger. And next, a vicious circle would be formed. Therefore, they had to deal with this fellow here.</p><br/><p>Unfortunately for them, regardless of what they did, everything seemed ineffective. In actuality, it wasn't particularly hard to deal with this fellow. Using piercing attacks or something similar would be sufficient. As long as a genetic warrior with such an ability was here, this devil race member would be dealt with easily enough. Alas, there was no such genetic warrior here.</p><br/><p>As abilities with piercing attacks were generally not part of any well-known or proper ability set, these abilities weren't popular. As such, it was quite normal for the genetic warriors deployed here to not have such abilities.</p><br/><p>\"Ah ah ah ah ah ah ah, when I return from this, I will most certainly train a Genetic Union member with piercing-related abilities.\"</p><br/><p>\"Yeah, sure. What should we do now, though?\"</p><br/><p>\"Well, we can only keep at it.\"</p><br/><p>They clenched their teeth. Thereupon, an entire group of them continued keeping this huge devil race member occupied while trying to kill other devil race members at the same time. During such a crucial moment, they had no intention of wasting any power available to them. However, just as they thought that they had things under control, that fellow started raging.</p><br/><p>A terrifying power erupted as that huge devil race member rolled like a fireball before knocking into a genetic warrior that was in the midst of battle.</p><br/><p>\"Careful!\"</p><br/><p>The expressions of the rest changed greatly as they saw this. The targeted genetic warrior had noticed this as well. Unfortunately, his discovery came a tad bit too late.</p><br/><p>Xiu!</p><br/><p>Turning into a dazzling red streak, the fireball slammed into that genetic warrior.</p><br/><p>Bang!</p><br/><p>A huge explosion erupted at the point of impact.</p><br/><p>Everyone's heart thumped. \"This is bad.\"</p><br/>\n</div>"}