{"title": "Chapter 484: Dear Slimy Senior Apprentice Sister, Where Are You?", "id": 484, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-484-dear-slimy-senior-apprentice-sister-where-are-you", "volume_title": "Volume 5", "body": "<h1>Chapter 484: Dear Slimy Senior Apprentice Sister, Where Are You?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 484: Dear Slimy Senior Apprentice Sister, Where Are You?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>The ancient race had finally made their move. This was something unexpected, yet at the same time, it was expected. According to their plan, the humans and the devil race were supposed to kill each other off. What they had not expected to happen was the one-sided defeat of the devil race.</p><br/><p>Granted, this was merely the strongest of humanity crushing only a small portion of the devil race. However, this was still not something that was supposed to have happened. The strength of humanity that had been shown here was not all humanity had to offer. The same was true for the devil race. The war between these two races should have been on a much larger scale. The result of their war should not have been so uneventful either. Because of this, the ancient race couldn't help but make a move themselves.</p><br/><p>Alas, unknown to them, Chen Feng had been waiting for them to make their move. The moment the ancient race made a move, the devil race would not move as hastily anymore.</p><br/><p>\"God! Punisher!\"</p><br/><p>A terrifying radiance surged. A frightening power erupted from Chen Feng's hand, blocking the incoming attack. The two attacks clashed midair, their shockwave piercing the clouds around them.</p><br/><p>Bang!</p><br/><p>The radiance bubbled up, and subsequently, a silhouette smashed down into the ground. That was a female of the ancient race.</p><br/><p>A smile appeared on Chen Feng's face. \"You have finally appeared…\"</p><br/><p>The ancient race female glared at Chen Feng fiercely. \"How did you discover me?\"</p><br/><p>To avoid detection, she hadn't even sent her main body over. Rather, she had merely formed a unique clone and sent it to hide nearby. Even the deputy president hadn't noticed her. How had this guy… Alas, before she could even finish her words, she was flooded by God Punisher.</p><br/><p>Bang!</p><br/><p>A boundless radiance surged out. The numerous abilities rumbled out like a flowing river, submerging her.</p><br/><p>The female ancient race member: \"…\"</p><br/><p>What damnable ability was this?</p><br/><p>Pa! Pa!</p><br/><p>The abilities slapped her face unendingly, yet even without defending herself, these abilities failed to even hurt her face. The level of these attacks was incredibly low.</p><br/><p>\"B… B class?\"</p><br/><p>She widened her eyes at this realization. She did not dare to believe this. She was an illustrious super expert. Measured with humanity's power level, she was equivalent to an existence surpassing A class, yet now someone was attacking her with some B-class abilities? This opponent actually despised her this much?</p><br/><p>She glared at Chen Feng indignantly. \"You dare…\"</p><br/><p>Pu!</p><br/><p>Just she opened her mouth to talk, several different objects—such as petrified objects, icicles, and cylindrical objects, all the result of Chen Feng's ability spam—were stuffed into her mouth.</p><br/><p>Ka cha.</p><br/><p>She bit down, crushing those objects before continuing to glare at Chen Feng furiously. This was humiliating! This was pure humiliation! These abilities were obviously incapable of doing anything to her, yet this guy was actually attacking her with them…</p><br/><p>She was furious. \"You are courting death!\"</p><br/><p>Xiu!</p><br/><p>She charged forth trying to kill Chen Feng. Alas, she was only midway there before she was intercepted by the three old men. \"We shall be your opponent.\"</p><br/><p>Bang!</p><br/><p>A battle erupted. This ancient race member that had appeared suddenly was indeed very powerful. She was so powerful that even by herself, she was able to face the three old men without being disadvantaged in the slightest. However, she was extremely furious. The damnable energy being spammed by Chen Feng was still raining upon her…</p><br/><p>Bang! Bang!</p><br/><p>Chen Feng's God Punisher continued on. The huge amount of energy was still unendingly spamming toward the ancient race female.</p><br/><p>These attacks were all ineffective against her. In fact, these attacks couldn't even leave a scratch on her skin. However, the chaotic mess of attacks was no different than rubbish as far as the ancient race member was concerned. This guy was actually humiliating her with rubbish? This was too excessive!</p><br/><p>She was filled with hatred. \"After I kill these three, I will most certainly kill you.\" As a person of respectable status among the ancient race, never before had anyone dared to humiliate her in this manner.</p><br/><p>Kill! Kill! Kill!</p><br/><p>The angry ancient race member started raging. The three old men tried suppressing her with all their might, yet they were only capable of stopping her temporarily. From the look of things, this stalemate would not continue for long.</p><br/><p>The others were all shocked.</p><br/><p>\"So this is the strength of the ancient race?\"</p><br/><p>\"How powerful!\"</p><br/><p>\"They are even stronger than the devil race!\"</p><br/><p>Chen Feng curled his lips. \"Who's afraid of who?\"</p><br/><p>Bang!</p><br/><p>Once again, a new bunch of abilities were thrown at that ancient race member's body. Even the Genetic Union members were speechless as they saw this. They could also see that despite the huge amount of abilities being spammed by Chen Feng, they were essentially useless against the ancient race member. Was this the ability called… Myriad Illusions? Most probably so. They had once studied this ability as well. After all, this was a unique gene that theoretically contained countless abilities within it. As such, it was able to attract the fascination of countless people.</p><br/><p>However, their fascination ended as far as studying this ability. The moment they figured out how unreliable this ability was, nobody bothered with using it.</p><br/><p>Now, though, they bore first-hand witness to a unique characteristic of this ability—its capability to annoy the enemy. Just look at the furious expression of the ancient race member. That was testimony enough.</p><br/><p>Venom…</p><br/><p>Clay…</p><br/><p>Swamp…</p><br/><p>….</p><br/><p>All sorts of bizarre abilities were spammed at the enemy. With Chen Feng's present strength, these abilities were indeed incapable of damaging the enemy. However, these abilities proved to be extremely disgusting, especially the sticky feeling brought about by his abilities.</p><br/><p>Under normal circumstances, this ancient race member wouldn't really have been bothered with someone like Chen Feng. She could kill him any time she wanted. Now, though, she was facing the three old men. Despite her confidence in her formidable strength, she still could not afford to be careless. As such, she had to put all her attention toward her battle with them, and it was precisely during such a moment, when she was trying to concentrate, that those attacks of Chen Feng's became excessively annoying.</p><br/><p>Bang! Bang! Bang!</p><br/><p>Another pile of attacks were spammed at her once again. Even the three old men did not know if they should laugh or cry. The battling method of this child called Chen Feng was truly somewhat…</p><br/><p>But then, it was still proving somewhat effective, as the ancient race member had been angered so much that she had missed several opportunities to counterattack against them.</p><br/><p>She raged unendingly. \"Damn it!\" This battle that was supposed to have been a sure win was now turning into a somewhat difficult battle due to that annoying bug called Chen Feng. Moreover, those bizarre abilities spammed by Chen Feng seemed to be gaining strength as time passed. This caused her to have an acute feeling that things were becoming bad, resulting in her becoming even twitchier.</p><br/><p>This can't go on.</p><br/><p>Hum—</p><br/><p>Suddenly, a bright radiance shone out of her forehead. A pink diamond appeared there, gleaming brightly.</p><br/><p>This is…</p><br/><p>Chen Feng's expression became solemn as he saw this. Pink diamond! This fellow was indeed Qin Hai's senior apprentice sister! Qin Hai once mentioned that his senior apprentice sister might make a move. As for her ability, it was control, enabling her to control the devil race members that were amid the primal chaos. This operation, those awakened devil race members…</p><br/><p>It was quite probable that she had been influencing it all along. Such a method of control went unnoticed even to the devil race members. This was her most terrifying aspect. Now, she had finally been forced out of her hiding. This person here was precisely the final \"hidden boss\" in this episode of the devil race war.</p><br/><p>With a cold bellow, a pink radiance surged out of her. \"Awake, souls among the primal chaos!\"</p><br/><p>Hum—</p><br/><p>Hum—</p><br/><p>On the ground, numerous light particles appeared and started shining dazzlingly. The earth started shaking. The devil race members that had been killed earlier and the tiger that had been killed by her earlier started to slowly stand up, a blank expression in all their eyes, akin to something dead.</p><br/><p>She pointed at Chen Feng angrily. \"Kill him!\" Even as she uttered those words, Chen Feng was still unleashing a huge amount of rubbish abilities toward her, giving her an excessively uncomfortable feeling.</p><br/><p>\"Kill him! He must die!\" she screeched in anger. The newly revived devil race members raised their heads slowly and locked their gazes on Chen Feng. Dragging their incomplete bodies, the charged at Chen Feng. These were the entirety of the devil race members that had appeared in this entire war. Even the 10 huge devil beasts and the tiger were included in this attack against Chen Feng.</p><br/><p>The rest chilled as they saw this. \"This is getting troublesome.\"</p><br/><p>The scope of this Star City battle had exceeded their expectations greatly.</p><br/>\n</div>"}