{"title": "Chapter 481: By Myself, I Am Equivalent to an Entire Army", "id": 481, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-481-by-myself-i-am-equivalent-to-an-entire-army", "volume_title": "Volume 5", "body": "<h1>Chapter 481: By Myself, I Am Equivalent to an Entire Army</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 481: By Myself, I Am Equivalent to an Entire Army</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Shua!</p><br/><p>The expressions of everyone in Star City sank.</p><br/><p>\"How is this possible…\"</p><br/><p>Their bodies chilled. So this was the actual trump card of the devil race? They had initially believed that they had already killed off a huge amount of devil race members. Even if there were some remnants left somewhere, it wouldn't mean much. Unexpectedly, they had actually missed such powerful devil race members.</p><br/><p>The deputy president focused his gaze on them. \"You two are not part of those who awakened this batch.\" It was obvious that those who had reawakened this time had all been killed. Moreover, when these two talked, their train of thoughts appeared rather clear. They did not resemble newly reawakened devil race members at all. Therefore, these two were most certainly devil race experts that had already reawakened earlier at some other location where the concentration of black rain was the highest. If so… \"Since the both of you possess such strength, why didn't you move earlier with those devil race members?\" the deputy president asked faintly.</p><br/><p>These two were extremely powerful. However, it was precisely because they appeared excessively powerful that the deputy president started doubting them. If they had attacked together with those recently reawakened devil race members, the Genetic Union would have been helpless.</p><br/><p>Why had they allowed those powerful devil race members to die like cannon fodder? What trick were these two hiding?</p><br/><p>The white cat laughed. \"Hehe. What other reason could there be? Obviously, we were waiting for you three old geezers. Although we weren't able to detect the three of you earlier, from the aura of experts lingering in the air, we were able to sense that the three of you were indeed somewhere nearby… Therefore, to be safe, we decided to let those fellows charge in as cannon fodder,\" the white cat stated indifferently. \"In any case, to kill all of you here, the two of us are already sufficient. Am I right, Qi Liu?\"</p><br/><p>Beside the white cat, the numerous Qi Lius replied together. \"Yes.\" The hearts of the genetic warriors shuddered at this sight. When so many A-class experts replied at the same time, the oppression posed by their voices was truly…</p><br/><p>The deputy president sneered. \"Do you believe that this will do?\" He felt that the reason given by this white cat was somewhat ill-founded. Next, with a cold gaze, he stated, \"Oh well. I suppose we only need to kill you two and things will end for now.\"</p><br/><p>Bang!</p><br/><p>Without hesitation, he made his move. A brilliant radiance erupted. The deputy president and the other two people beside him moved at the same time. A boundless power started descending toward the white cat. Alas, once again, that imprint appeared.</p><br/><p>A crafty smile appeared on the white cat's face. \"It's useless, yo.\"</p><br/><p>Bang! Bang! Bang!</p><br/><p>The imprint flickered as it defended, rendering all attacks ineffective.</p><br/><p>Finally, the expression of the deputy president changed slightly. \"How is that possible?\" He was clear on the strength of the three of them. Let alone a peak A class, they could even destroy those surpassing A class with their earlier attack, but this fellow here…</p><br/><p>\"Qi Liu, I will be relying on you, then.\" White cat sneered before continuing, \"Destroy them all.\"</p><br/><p>\"Don't worry,\" QI Liu replied coldly. \"By myself, I am equivalent to an entire army.\"</p><br/><p>Kill!</p><br/><p>Numerous figures streaked out.</p><br/><p>The numerous clones, each with A-class power level, charged toward the genetic warriors. The deputy president tried to intercept their charge yet was stopped by the white cat. \"The opponent of the three of you shall be me.\"</p><br/><p>The deputy president's eyes gleamed coldly. \"Damn it!\" He and the other two with him, who were actually here as clones, solidified their clones once again and started attacking as numerous gold radiances bloomed. Alas, the attacks were ineffective.</p><br/><p>\"I told you,\" the white cat stated, disappointed. \"Your attacks are too weak.\"</p><br/><p>Bang!</p><br/><p>Once again, a battle erupted. Different from the previous battle, this battle was a one-sided oppression, total oppression of the entirety of Star City by a single white cat and a single Qi Liu. Even with the clones of the deputy president and the other two here, they failed to do anything to help. The oddest of all was the fact that the white cat and Qi Liu truly had the power level of only peak A class.</p><br/><p>After all, the black rain hadn't been falling for long. As such, those devil race members that had surpassed A class had yet to appear. Even with the never-ending black rain at the unknown regions thus far, it was still insufficient to sustain the reawakening of those surpassing A class. Alas, would they truly be eliminated by only two peak A-class devil race members?</p><br/><p>Their hearts chilled as they thought of this. The peak A-class devil race members were actually this powerful?</p><br/><p>\"Careful!\"</p><br/><p>\"The main body must be among these clones. After killing the main body, he will die for real.\"</p><br/><p>\"How are we supposed to locate the main body, though?\"</p><br/><p>Everyone started concentrating their gazes.</p><br/><p>There were so many clones of Qi Liu here, and each of them looked the same. Even their auras and strength were the same. As such, forget actually killing the main body, they were unable to even locate the main body. Moreover, different from humans, Qi Liu was a devil race member. This was a sphere-sized life-form with yellow skin in the truest sense, unlike the pseudo-yellow of human skin.</p><br/><p>Some tried chopping down at the yellow skin, yet their attacks instantly bounced off. This was truly an odd life-form with excessively powerful defensive power. Killing it? It was near impossible. On top of that, the genetic warriors were presently outnumbered. Those huge yellow spheres were all bouncing around and attacking all the genetic warriors there. With their high vitality, the genetic warriors all despaired. What else could they do? Let alone killing the main body, they couldn't even kill a single one of the clones.</p><br/><p>\"Hehe.\"</p><br/><p>On top of all that, these clones were not mere duplications. Each of them seemed to have their own consciousness, appearing extremely lifelike and making it difficult to ascertain which of them was the actual main body.</p><br/><p>\"Things are getting really troublesome now…\"</p><br/><p>They despaired. Presently, the Genetic Union members were at a true impasse. Surrounded by Qi Lius, they could only defend themselves passively. The more the battle raged on, the worse off they were. If this continued on, they would die from exhaustion before long.</p><br/><p>How about the deputy president? Instinctively, they gazed at the deputy president with a begging gaze. Next, the sight of three flustered and exasperated old men entered their field of vision. Those three were attacking the white cat without stop, yet they were failing to accomplish anything.</p><br/><p>\"We have indeed been countered.\"</p><br/><p>Right at this moment...</p><br/><p>Bang!</p><br/><p>Han Yula erupted suddenly, changing the direction of his attack that had initially been heading at Qi Liu toward the white cat instead.</p><br/><p>Hum—</p><br/><p>Another imprint appeared, blocking the attack. Ineffective! Yet another attack had proven ineffective!</p><br/><p>Han Yula's eyes gleamed coldly. \"How is that possible?\"</p><br/><p>It was clear that the three seniors had been countered, but now it seemed like his attack had been countered as well? They were similarly peak A-class existences, yet he had actually been defeated by two devil race members at the same power level?</p><br/><p>The white cat merely looked at him toyingly. \"How naive.\"</p><br/><p>Pu! Pu!</p><br/><p>On Han Yula's body, two additional bloody scars appeared. These two wounds would not hamper him much. Alas, that uncomfortable feeling of having failed in his attack could not be erased. They were being oppressed to such an extent by only two devil race members?</p><br/><p>Xu Fei frowned. \"Things look somewhat bad…\" Was Chen Feng still unwilling to make his move? Granted, he was aware that Chen Feng was merely a B-class warrior, but every time that fellow moved, miracles ensued. This applied even to battles at a level he wasn't supposed to be capable of participating in.</p><br/><p>Make your move, Chen Feng… Otherwise I will have no choice but to escape by transmigrating, Kong Bai thought as he inhaled deeply.</p><br/><p>Presently, the Chen Feng that the both of them were thinking about was watching the battlefield from somewhere far away.</p><br/><p>White cat…</p><br/><p>The moment that bizarre life-form had appeared, Chen Feng's attention had been piqued. Naturally, with the three old men there, nothing too bad would happen for now. Despite the fact that their attacks were ineffective against the white cat, the white cat would not be able to defeat them any time soon.</p><br/><p>The main problem presently was the other fellow, Qi Liu! If this guy wasn't dealt with, everyone in Star City would probably die.</p><br/>\n</div>"}