{"title": "Chapter 487: I Have Been Waiting a Long Time for You", "id": 487, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-487-i-have-been-waiting-a-long-time-for-you", "volume_title": "Volume 5", "body": "<h1>Chapter 487: I Have Been Waiting a Long Time for You</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 487: I Have Been Waiting a Long Time for You</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Had it ended? Everyone gazed at the dazzling red radiance. None of them had expected that this battle would conclude in such a manner. A conclusion where the female ancient race member erupted suddenly and killed the clone of their powerful deputy president only to end up killed by Chen Feng in an extremely alarming manner. Without a doubt, those trash-like abilities of Chen Feng's that had seemed like they were only useful for annoying someone had ultimately erupted with a power that caused one to feel flustered.</p><br/><p>\"So powerful.\"</p><br/><p>\"I'm afraid this attack has already surpassed peak A class, right?\"</p><br/><p>All their hearts shuddered as they bathed in this bright radiance. After a long time, the radiance faded. On the ground, only a large crater remained. Midair, countless pink particles hovered. These were the remains of that female ancient race member. She had actually been blasted so hard her entire body had been forcefully shattered into numerous pieces. Once again, a powerful clone of an expert had been killed by Chen Feng.</p><br/><p>As time passed, those pink particles slowly dissipated.</p><br/><p>It's finally over.</p><br/><p>Everyone clenched their firsts as they thought this. It was over! Finally, this confrontation with the devil race and ancient race was over. They had successfully defended the Star City. Alas, at this moment, they noted that even now, the feeble pink particles were still flickering with a faint glimmer, attracting the attention of countless people.</p><br/><p>They widened their eyes.</p><br/><p>\"What is that?\"</p><br/><p>\"Why is it still moving?\"</p><br/><p>\"Has the female ancient race member not given up yet?\"</p><br/><p>Chen Feng narrowed his eyes. \"This…\"</p><br/><p>And so, under numerous unbelieving gazes, those pink particles started converging together again. After a while, a flawless body appeared there. This was still the same female ancient race member, as beautiful as ever. This time, the number of clothes on her body was significantly lower. The sight of her was so very enchanting, yet not a single person in Star City dared to have any distracting thoughts when it came to her. This female was still alive? She was still perfectly fine?</p><br/><p>All their hearts chilled as they saw this. Chen Feng studied her body indifferently before sighing deeply. \"Is there a need for this? Previously, to defeat the deputy president trio, you forcefully poured your energy into this clone of yours. And now, even after your clone has been destroyed, you are forcing the clone back together again. If you do this, how much of your energy will you have left in your main body? Doing this… the gains do not make up for the losses,\" Chen Feng stated regretfully.</p><br/><p>The female ancient race member's gaze was filled with hatred. \"You have no idea the number of sacrifices I have made. This devil race resurrection plan is supposed to be the start of my legend, yet everything has been ruined by you, you annoying bug! I will not allow my previous investments to go to a waste. I will destroy you all and recover everything I have lost!\"</p><br/><p>She was filled with hatred. Yes, she was aware that it would be better to have retreated the moment her clone was destroyed. After all, the price she had paid was much higher than she had imagined due to the long-distance clone formation. The only fortunate thing was the fact that her main body was still hidden somewhere safe.</p><br/><p>Chen Feng shrugged. \"Is that so? I suppose you have no idea what 'sunk cost fallacy' means, then.\"</p><br/><p>The female ancient race member became somewhat confused as she heard Chen Feng.</p><br/><p>Chen Feng shook his head and did not bother explaining. He merely gazed at her calmly. \"Even if you had condensed your clone here forcefully, even after paying such a high price, do you believe that you will most definitely complete this plan of yours?\"</p><br/><p>She sneered. \"Yes, I can. I have already seen through your true strength.\"</p><br/><p>Chen Feng raised his eyebrow. \"Oh?\"</p><br/><p>\"You are very weak. You are truly only a B-class warrior. Thanks to that weird ability, your attacks start weak before increasing in strength without stop. Perhaps that ability is weak initially, but ultimately, it is amplified without stop, increasing the strength of your attacks. This is an ability I have never seen before, an ability capable of defying the heavens at its strongest point. However, the flaw of this ability is too obvious. As long as I deal with you when you first activate the ability, it's simply a trash ability,\" the female ancient race member said, a sharp gaze in her eyes.</p><br/><p>Chen Feng's heart shuddered as he heard her. What a terrifying power of observation! He had only used this ability once in front of her! He had even tried disguising his ability using numerous methods, yet this female ancient race member had been able to see through Chen Feng with a single look. Indeed, the biggest flaw of God Punisher presently was the long duration it required to reach its potential.</p><br/><p>\"Normally, such abilities have huge limitations. I don't know if you can still activate it again. However, it does not matter. I will not give you any opportunities this time.\" The female ancient race member focused her gaze on Chen Feng. This time, she was truly treating Chen Feng as an opponent at her level. \"If you have other trump cards, please do use them. If not… go regret your actions in the eternal hell then.\" After finishing her words, the female ancient race member moved.</p><br/><p>Bang!</p><br/><p>A terrifying radiance erupted. A pink radiance shone dazzlingly from both her hands as she charged straight at Chen Feng. She was able to see that now, the only person capable of threatening her was this person here. Alas, all this time, Chen Feng had merely regarded her calmly.</p><br/><p>Chen Feng smiled faintly as he asked, \"Do you truly believe that there won't be any issues even after forcefully exhausting the energy of your main body without any restraint? You must be clear on the type of damage one's body will suffer after excessive overexertion, right?\"</p><br/><p>\"I don't need you to worry about that.\" Her killing intent remained despite Chen Feng's words. After forceful overexertion, the worst that would happen was losing the ability to use any energy for several days. For her, this wasn't much. With her intelligence, she was not the type of person to let Chen Feng waver her confidence with mere words. \"You will most certainly die today.\"</p><br/><p>Shua!</p><br/><p>The terrifying radiance pierced at Chen Feng. Right as her attack was several centimeters away from Chen Feng's heart, when she was about to pierce through him, her body suddenly froze. This terrifying clone of hers was actually frozen in space.</p><br/><p>\"You…\"</p><br/><p>Her eyes widened abruptly. Full of disbelief, she lowered her head.</p><br/><p>There, on her chest, a huge flaming sword was protruding. The sword had been inserted from her back and was piercing out of her chest. Her heart chilled as she realized this. Most terrifyingly, she still couldn't see anyone or anything behind her. This was a sword that had appeared out of nowhere.</p><br/><p>Chen Feng shook his head. \"What a pity. Why have I baited you here to this battlefield?\"</p><br/><p>\"…\"</p><br/><p>The female ancient race member gazed at this youth before her. From his somewhat mocking gaze, she guessed an extremely terrifying truth: from the start, he had been aware of her existence. Devil race resurrection, darknight devil tiger, despite all those, this young man's true target had actually always been her!</p><br/><p>\"I have been waiting quite a while for you.\" Chen Feng stepped forth and approached her frozen body before lightly whispering in her ear, \"Now, it's time for you to return. I have a rather nice surprise waiting for you back at your main body…\"</p><br/><p>Clang!</p><br/><p>Chen Feng's right hand pointed at her forehead softly.</p><br/><p>Hum—</p><br/><p>A bright radiance erupted. Just like that, the clone of that terrifying female ancient race member started dissipating.</p><br/><p>\"I won't let you off!\" she screeched.</p><br/><p>Shua!</p><br/><p>Light swirled around. As her clone dissipated, her consciousness returned to her main body. Here, at this place she had previously deemed the safest, the place where her main body rested, a young lady of around 13 or 14 years old was seated before her. On that young lady's hand was a huge flaming sword, and presently, the sword was stabbed right through the female ancient race member. This was the very sword that had brought her back to her main body.</p><br/><p>The young lady was smiling sweetly, yet the female ancient race member chilled as she saw the sweet smile. \"I have been waiting for you for a while.\"</p><br/>\n</div>"}