{"title": "Chapter 498: This Is Simple", "id": 498, "volume": 5, "url": "http://boxnovel.org/the-strongest-gene-chapter-498-this-is-simple", "volume_title": "Volume 5", "body": "<h1>Chapter 498: This Is Simple</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 498: This Is Simple</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>If he couldn't find a solution, he would go running to his backer. Chen Feng was very straightforward. That Hou Liang fellow had basked in the light quite frequently recently thanks to Chen Feng's numerous contributions. As such, Hou Liang had long been elevated to a position of power in the Gene Production Association. Furthermore, he had rather high authority in this research project as well. Therefore, Chen Feng had decided to look for him directly. Alas, as it concerned beyond-A-class warriors, Chen Feng was directly rejected.</p><br/><p>\"I don't have the rights to decide on that.\" Hou Liang was very helpless as well. The reason he had no rights over that was very simple. Almost all beyond-A-class warriors were under the Genetic Union. Moreover, this was not Star City. Therefore, he had no authority over them.</p><br/><p>\"One more thing.\" Hou Liang paused. \"Recently, someone complained that you have been spoiling their tests.\"</p><br/><p>Chen Feng curled his lip. \"Oh? That person that screamed mournfully after being nearly kicked to death by me earlier today? That person who's even uglier than Kong Bai?\"</p><br/><p>\"…\" Hou Liang rolled his eyes. How was that person this ugly?</p><br/><p>Chen Feng wasn't the least bothered about that person. \"I'm spoiling the tests just because he said so?\"</p><br/><p>Hou Liang spread his hands. \"The most important thing is that his elder brother is an expert of the Genetic Union. As such, things might be somewhat troublesome.\"</p><br/><p>Chen Feng sneered. \"Hmph. Who's without a backer? If you can't deal with this, I will leave right this moment. I have no interest in participating in this stupid research anyway.\"</p><br/><p>Hou Liang pulled at him hastily and smiled bitterly. \"No, haven't I dealt with that for you already? Don't worry. So long as you don't kill anyone, nobody here can touch you,\" Hou Liang stated imposingly.</p><br/><p>A smile appeared on Chen Feng's face. \"That's more like it.\"</p><br/><p>\"If you require more beyond-A-class warriors… perhaps you might consider trading,\" Hou Liang stated after contemplating the matter.</p><br/><p>Shua!</p><br/><p>Chen Feng's killing-intent-filled gaze drifted toward Hou Liang.</p><br/><p>Hou Liang shook his head. \"No, not the kind of trade you're thinking of. Rather, it is the trade of research results. After all, all these teams were essentially established to hasten the research. Therefore, almost all verified research results can be released to be converted into points and can be sold to others interested in the research result.\"</p><br/><p>After gaining a rough understanding of this whole system, Chen Feng noted that it was rather similar to the research paper system at Star City back then. As long as a sufficient amount of research results could be released, so long as one could gather sufficient points, one would be able to check nearly all other research results to increase the speed of one's own research.</p><br/><p>Chen Feng contemplated. \"Releasing the results, eh?\"</p><br/><p>\"You are not allowed to cause any trouble!\" Hou Liang reminded Chen Feng hastily. The memories of what had happened back then, when this similar expression had last appeared on Chen Feng's face, were still vivid in Hou Liang's brain. That was precisely when Chen Feng had created that loot-box system.</p><br/><p>Chen Feng coughed before saying, \"How is that possible?\" As he looked at Hou Liang's solemn expression, he could only push back his thoughts. Releasing results… After arranging his energy research results, he transmitted them to the common channel. Alas, nobody believed him.</p><br/><p>\"Energy? Hahahaha.\"</p><br/><p>\"It's a given that the energy of an A class and a beyond A class are different. Do we need you to tell us this?\"</p><br/><p>\"The existence of this state called beyond is definitely due to the mutation of one's energy. This is the only probable explanation for it. What in the world is this mobile thing he's talking about?\"</p><br/><p>Everyone berated endlessly. The preliminary result of Chen Feng's research was berated without stop the moment it was released. Evidently, without the assistance of Luck Aura, nobody but Chen Feng would choose to research in this direction.</p><br/><p>And when Chen Feng used the little number of points he had to check the research results of others, most of them were focused on the body. Surprisingly, they'd actually made some headway in those directions of research. Bloodlines and gene, these were the present two directions that most people were focused on.</p><br/><p>Some believed that the origin of the new energy originated from bloodline mutations, allowing a person to possess the power of beyond from then on. Some believed that the new energy originated from genetic mutations, allowing a person to possess the power of beyond. Under these premises, the researchers had been progressing without stop until now, where they had reached a point where they had already gained a certain degree of progress in their research.</p><br/><p>Moreover, through bloodline improvement, a certain A class had indeed successfully entered beyond A class. This caused everyone to be unendingly ecstatic. As Chen Feng studied all this, he frowned. From the start, all the others had chosen the completely wrong direction in their research. Even an idiot's body could be improved by genetic mutation or bloodline improvement. But then, would that truly increase that person's strength? Would a person who pursued such a path truly be as powerful as a proper beyond A class?</p><br/><p>How idiotic. A person at the peak of A class was already a person nearing the gateway of beyond A class. Even without outside assistance, that person might still be able to go beyond A class in any case. How in the world would this relate to the strengthening of one's genes or bloodline? Since that particular genetic warrior had already been nearing beyond A class, those tests they conducted on him might be the very last straw that pushed that person toward beyond A class.</p><br/><p>And next, what was the conclusion of their research, then? The last straw could indeed break the camel's back? Chen Feng shook his head.</p><br/><p>A cold voice resounded beside him. \"Zhy zare zou shaging zur head?\" </p><br/><p>Chen Feng took a look at the origin of the sound and immediately felt like laughing. This fellow beside him who was talking in such an unclear manner was precisely the person who had been flung away by his kick previously. Mhm, what was his name again?</p><br/><p>\"Your name is Xu…\" Chen Feng thought about it, but he couldn't recall this person's name.</p><br/><p>That person raged. \"Xu Huihuang!\"</p><br/><p>Now Chen Feng remembered. \"Oh, Xu Huihuang.\"</p><br/><p>\"Not Xu Huihang, it's Xu Huihuang!\" that person stated angrily.</p><br/><p>Chen Feng felt doubtful. \"Xu Huihuang? I'm not wrong, then?\"</p><br/><p>That person widened his eyes. \"Zot Xu Huihuang, zish Xu Huihuang!\" </p><br/><p>Chen Feng: \"…\"</p><br/><p>The hell, what was the difference? Right at this moment, someone passed by and coughed before saying, \"His name is Xu Feifang.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>What stupid name was this?</p><br/><p>\"Little Ze, I tell zou, zhis ish my zesult.\"</p><br/><p>Xu Feifang started pointing at the beyond A class research result proudly. This was the only successful case of someone entering beyond A class since the start of this entire project. This was also why his group had been allocated two beyond-A-class experts to help in their research.</p><br/><p>Chen Feng appeared rather indifferent. \"Oh.\" That person who had broken through was someone that had already been at the bottleneck anyway. How did this relate to this researcher, then?\"</p><br/><p>\"Can I have a look?\" Chen Feng asked.</p><br/><p>\"Zo,\" Xu Feifang stated proudly with his unclear speech. \"Zou zmashed my teeth. I am zot zilling to forgive zou. Now zou are zhinting of taging away my A class, zow fanny.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>What in the world was this fellow trying to say?</p><br/><p>\"Forget it.\" Chen Feng gazed at him pitifully before turning around to leave. As he was leaving, that person was still muttering without stop. Alas, Chen Feng couldn't understand a single word that person was trying to say. Since he had still failed to get more information, he had to look for some beyond-A-class warriors directly. This would be the best choice.</p><br/><p>Unfortunately, after Chen Feng tried approaching some beyond-A-class warriors, he noted most of them looked down on this research. If they weren't being forced by the Genetic Union, coupled with the appearance of the ancient race and devil race, they would have left this project hanging long ago. As such, it was impossible for them to agree to Chen Feng's request for additional tests beyond what was assigned to them.</p><br/><p>\"No results?\" Wang Yao asked the returning disappointed Chen Feng.</p><br/><p>\"Mhm.\" Chen Feng felt helpless. \"Everyone ignored me.\"</p><br/><p>\"You only need to gather energy?\" Wang Yao asked.</p><br/><p>Chen Feng nodded. \"Mhm.\"</p><br/><p>\"That's easy. Bring your gathering device and come with me,\" Wang Yao stated abruptly.</p><br/><p>Huh?</p><br/><p>Chen Feng blanked. Wang Yao had a solution for this? But then, since he couldn't think of anything, he did as Wang Yao asked. He was guessing that perhaps things would be easier if a beyond A class was the one talking to the other beyond-A-class warriors on his behalf.</p><br/><p>And so, he followed behind and watched on as Wang Yao met another beyond-A-class warrior. This warrior that previously couldn't have been bothered with Chen Feng seemed very willing to talk to Wang Yao. Indeed, Chen Feng rationalized that those of the same level could truly communicate with each other better. But then, just because they were of the same level, would that be sufficient to get that person to agree to additional tests? While Chen Feng was pondering, he saw Wang Yao take out her huge flaming sword and stab straight at that person.</p><br/><p>Bang!</p><br/><p>Fire erupted.</p><br/><p>Bang! Bang!</p><br/><p>The energy of beyond A class erupted and splashed everywhere.</p><br/><p>Huh?</p><br/><p>Chen Feng was instantly dumbfounded. What in the world? Why had they started fighting?</p><br/><p>\"Gather it.\" Wang Yao glared at Chen Feng. \"Look, isn't beyond-A-class energy everywhere now?\"</p><br/>\n</div>"}