{"title": "Chapter 507: What’s the Issue?", "id": 507, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-507-what%E2%80%99s-the-issue", "volume_title": "Volume 6", "body": "<h1>Chapter 507: What’s the Issue?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 507: What’s the Issue?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>The old man gazed at Man Junxi coldly. \"What other questions do you still have?\"</p><br/><p>Man Junxi remained in a daze for a long time. \"I…\" There was nothing wrong? How was that possible? He was all too clear on how terrifying and difficult the power of beyond was. Even their team was…</p><br/><p>But now, there were no problems whatsoever with this old man's demonstration? No problems whatsoever could be found with that genetic warrior? Now, before activating the power of beyond in him or even before the tests had started, there were no problems. The second demonstration was obviously better than the first.</p><br/><p>The doubts raised by Man Junxi had instead entrenched the result of this second team in the hearts of the observers here. Moreover, after comparing both their demonstrations, that clumsy demonstration of Man Junxi's team was clearly on an entirely different level when compared with this old man's team. It was obvious that this old man's team was further in their research. Comparatively, Man Junxi's team was too unripe.</p><br/><p>This caused others to doubt if the power of beyond that this first team had grasped was somewhat problematic, resulting in their clumsy demonstration, as their version of the power of beyond was too hard to properly control. Or perhaps their version of beyond was too lively? All these were questions worth pondering.</p><br/><p>On the stage, the head of the department exchanged glances with several others before nodding slightly. Regardless of everything, they were all more inclined toward a power that was better improved, more matured, and steadier. It was clear that Man Junxi's team was somewhat lacking in all these factors.</p><br/><p>Man Junxi's heart thumped. \"This is bad.\" Previously, he had received news that Chen Feng's group had obtained an initial result and were submitting their results. That was why he had decided to submit his result hastily as well. Unexpectedly, this second team was their actual opponent. \"This does not look good.\"</p><br/><p>Man Junxi was alarmed. He was sure that the moment the main team was decided here, all the other teams would have to serve the selected main team. Moreover, all the fruits of their research would be unconditionally appropriated to the selected main team. When that happened, the other teams wouldn't be granted the option to even resist this. At that time…</p><br/><p>\"Head,\" Man Junxi stated hastily.</p><br/><p>\"We still have an even more detailed plan on the direction of our research to be presented.\"</p><br/><p>\"Yes. Similarly, our team's gene reagent does not work for everyone. However, our gene reagent has a success rate of 100%. So long as our formula is perfected, there will be no failures. We don't even need more researchers to help. The only thing we need to do is to solve this problem and make our gene reagent work for everyone. The new improved formula will thus be ready for mass production, and the gene reagent will be available to be distributed worldwide,\" Man Junxi stated emotionally.</p><br/><p>Oh?</p><br/><p>The others were tempted as they heard this. If so…</p><br/><p>On the stage, the head exchanged glances with several others. Evidently, they were tempted. They regarded the stage and looked at the teams of Man Junxi and the old man that were facing each other, seemingly creating sparks between them. However, for the head and the other observers, this was a good sign.</p><br/><p>They were not particularly bothered by the fact that both these teams had yet to solve the problem of making their gene reagents work for everyone. Presently, each research team only had a single beyond A class assigned to them anyway. As such, it was understandable for their gene reagents to not work for everyone. When all the teams were combined and all the beyond-A-class warriors were gathered together… this single problem would naturally be solved.</p><br/><p>This was also the reason they had decided that the moment the main direction was decided upon, all the research teams had to be combined together. After all, beyond-A-class warriors were still too rare. To ensure that the new gene reagent would work for everyone, this was necessary. In any case, they had initially planned to only have one team toward the end. Now, it seemed like…</p><br/><p>They started discussing softly.</p><br/><p>\"Perhaps, both these directions are worth pursuing.\"</p><br/><p>\"Mhm, it wouldn't be too much of a problem if the beyond A class warriors were divided into two groups and worked in shifts.\"</p><br/><p>\"That's feasible.\"</p><br/><p>Happiness was clearly plastered on their faces. On their trip here today, it could be said that their harvest had been ample thus far. If there were no mishaps, both these teams would probably be kept as main teams. As for the third team here today…</p><br/><p>They glanced at the submission form. The form seemed to mention that their active duration was only one second?</p><br/><p>Initially, they had still been rather excited at the prospect of this, but now that there were two other teams that had even more stunning results here as a comparison, the third team's duration of a single second truly appeared to be nothing special. This team had obviously come here immediately after hitting the minimum requirements of the project. Compared with the first and second team, which had active durations of three seconds and five seconds, this third team was too lacking.</p><br/><p>The head waved his hand calmly. \"Third team, kindly demonstrate your result.\"</p><br/><p>At this moment, Man Junxi had finally calmed himself down. Earlier, he had managed to overhear some of the conversations of those big shots. He knew that his team was sure to be momentarily saved for now. At least, in the short term, the competition would only be limited to him and the old man from the second team.</p><br/><p>All this while, Chen Feng had been calmly observing everything. Regardless of whether it was the reaction of the head of the department or the expressions of Man Junxi and the others, he observed them all. Finally, it was his team's turn to demonstrate.</p><br/><p>The person in charge of the BC team beside Chen Feng reminded him, \"It's our turn,\"</p><br/><p>Suddenly, Chen Feng stated, \"You go.\"</p><br/><p>The person in charge blanked. \"Ah?\" He had never expected that Chen Feng would yield such a moment of glory to him. Was it because Chen Feng had been overly shocked by the previous two demonstrations?</p><br/><p>Chen Feng smiled calmly. \"Put up a good show. Your explanation will be extremely important.\"</p><br/><p>\"Mhm.\"</p><br/><p>The person in charge nodded resolutely. He knew that the only advantage their team had over the others was the fact that their gene reagent worked for everyone. However, whether this was a fact that the higher-ups would look highly upon remained to be seen. After all, what they had achieved might truly appear too simple in the eyes of others. The moment the main team was decided upon, all their efforts before this could very well go to waste. All their efforts and results would be nothing but a gift wrapped nicely for the main team.</p><br/><p>The final result would now depend on the explanation of this person. The only way they could attract the attention of the higher-ups was by stressing the importance of having the gene reagent work for everyone and by showing clearly the difficulty of achieving this result. Soon, the person in charge and Xu Fei arrived on the stage.</p><br/><p>As for the BC team members, they all walked up, started making their preparations, and started up their devices. Once again, the initial result and their expected result were transmitted to everyone there. The active duration of one second was in fact something most people there weren't bothered with. After all, the previous two teams had been too stunning. Comparatively, this duration of one second was way too bland, Disappointing, even.</p><br/><p>Right at this instant, Chen Feng's wristband buzzed. Qin Hai's investigation results had finally arrived.</p><br/><p>Chen Feng's eyes shone. \"It's here?\"</p><br/><p>Shua!</p><br/><p>A screen appeared. The data regarding Man Junxi appeared without stop. Man Junxi was the heir of a certain huge family. This was a rather influential family as well, a family who'd once had a beyond-A-class warrior in their ranks. The said beyond-A-class warrior had ultimately died during a past war, but then, thanks to the glory of this ancestor of theirs, this family had always received great care from the Genetic Union. Thanks to this, they had numerous A-class warriors in the family and were also one of the important targets the ancient race had been paying attention to. This was the basic information pertaining to this family.</p><br/><p>Naturally, all this was not sufficient to attract the attention of the ancient race. The only reason the ancient race had taken note of them was the ancestral blood essence that this family's beyond-A-class ancestor had left behind. Every single drop of this blood essence was filled with the power of beyond. That was what the ancient race cared about.</p><br/><p>The existence of this blood essence was something even the Genetic Union was unaware of. However, the ancient race was extremely clear on this. The several comparatively powerful families of humanity had indeed struck fear in the hearts of the ancient race members.</p><br/><p>Chen Feng was amazed. \"How did you guys find out about this?\"</p><br/><p>\"Do you think that the ancient race has been wasting time all these years?\" Qin Hai lamented. The other main mission of the Mysterious Organization was gathering information.</p><br/>\n</div>"}