{"title": "Chapter 530: The Returning Expert", "id": 530, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-530-the-returning-expert", "volume_title": "Volume 6", "body": "<h1>Chapter 530: The Returning Expert</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 530: The Returning Expert</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Bang!</p><br/><p>As that dazzling radiance erupted, everyone was startled. A dense devil aura enveloped the entire world instantly as an aura even more terrifying than the aura from the first appearance of the devil race surged, alarming everyone.</p><br/><p>\"This…\"</p><br/><p>\"What happened?\"</p><br/><p>Everyone was alarmed. This aura was too scary, thus planting fear in all their hearts.</p><br/><p>Xiu! Xiu!</p><br/><p>Countless experts started making their move. During the past half year, several hundreds of beyond A classes had appeared among the human race. At this time, all of them made their appearance. However, before they could even locate the source of that devil aura, the sky recovered to how it had been before, sunny and cloudless. The devil aura had vanished.</p><br/><p>\"Gone?\"</p><br/><p>Everyone gazed at the sky. Nobody had any idea why this devil aura had appeared. At the Genetic Union, the beyond A classes that had just revealed themselves were exchanging glances in dismay.</p><br/><p>\"Has the position been located?\"</p><br/><p>\"Nope. No specific position can be found. Ground, sky, everywhere possible has been searched. The devil aura earlier seemed like it had been in the air all along, and the source is unable to be found.\"</p><br/><p>\"Damn it.\"</p><br/><p>Everyone's expression became unsightly. This devil aura that had suddenly appeared had smashed all the confidence humanity had built throughout this half year. Since the devil aura could appear here, how about the devil race? Those reawakened devil race members were indeed extremely terrifying. This was a race that had been in hibernation for countless years. Nobody was aware of how strong they truly were.</p><br/><p>\"Continue monitoring.\"</p><br/><p>\"All right.\"</p><br/><p>The people from the Scouting Department had unsightly expressions.</p><br/><p>Only last month, they had been jeering at the Earthquake Department telling them how they were only capable of giving warnings after the earthquake had occurred. Unexpectedly, the same thing was now happening to them; they had been completely helpless during the appearance of this devil aura. Just as they were about to return...</p><br/><p>Bang!</p><br/><p>A radiance erupted.</p><br/><p>They were instantly on guard. \"Again?\"</p><br/><p>\"No, that's not devil aura.\" Some of them with sharp eyes were able to see a faint shadow in the distance. \"It's someone from our side.\"</p><br/><p>Shua!</p><br/><p>Light swirled around. Everyone rushed toward this person. Different from what they had expected, this was a bloodstained person, a genetic warrior so injured that his appearance was nearly unrecognizable. What was even more terrifying was the fact that this warrior was actually a beyond A class as well.</p><br/><p>Someone recognized him. \"It's Lord Li Lei.\"</p><br/><p>Li Lei, one of the top experts of the Genetic Union. He was not even an ordinary beyond-A-class warrior; rather, he was truly a peak warrior in the truest sense, a beyond A class categorized as A9. Someone like this was an expert who had been at the top even before the appearance of the beyond X gene reagent. These were the truly formidable humans, those who had been at the apex of humanity all this while. But now, it was truly unexpected that…</p><br/><p>\"Devil…\" Before Li Lei could even finish his sentence, he fainted.</p><br/><p>Everyone was alarmed. \"Fast, rescue him.\" Several employees rushed over to start treating his injuries. Nobody wished to see a top expert like this die. They had no idea what exactly it was that had happened. Everyone started working hastily.</p><br/><p>Presently, Chen Feng, who was not far away, was looking in this direction as well. That was because the instant Li Lei had appeared, his Luck Aura's alarm function had blazed and his luck value had started dropping. In his virtual world, the red light of his alarm system was blinking without stop. This signified that a grave danger had been detected.</p><br/><p>Without hesitation, Chen Feng warned them, shouting, \"Enemy attack! A concealed person is observing us!\"</p><br/><p>Shua!</p><br/><p>Instantly, everyone around him was on alert.</p><br/><p>Right at this moment, from the empty air not far away, a clump of devil aura appeared out of nowhere. Space was ripped apart as three shadows streaked out of the torn hole. Their target was Li Lei.</p><br/><p>\"Protect him!\" two beyond A classes stated as their eyes gleamed coldly. Trying to kill one of them in front of so many of them here? How audacious! Even if these people were newly advanced beyond A classes, they were still true beyond A classes!</p><br/><p>\"Scram!\"</p><br/><p>The furious genetic warriors moved.</p><br/><p>Bang! Bang! Bang!</p><br/><p>The shadows were disintegrated, but a devil aura started pervading the air. From the three shadows, three malevolent-looking bodies appeared. These three were precisely devil race members. When their attack had failed, they'd been blasted out of their shadows.</p><br/><p>\"Hiss—\"</p><br/><p>A sinister voice echoed in the air. The three devil race members rotated their bodies and took a detour around the several beyond A classes before once again streaking toward Li Lei.</p><br/><p>Everyone's expression became solemn. \"Careful!\"</p><br/><p>\"Understood.\" Two beyond A classes that specialized in defense guarded Li Lei. They were aware that since the devil race was so desperately trying to kill Li Lei, it had to be because Li Lei had discovered something important. This was extremely important for humanity.</p><br/><p>Bang! Bang!</p><br/><p>Several bright explosions erupted midair as everyone defended Li Lei. The three devil race members exchanged glances, evidently realizing that they were incapable of killing Li Lei. At this realization, their eyes gleamed coldly.</p><br/><p>\"These fellows…\" Suddenly, a feeling of intense fear rose in Chen Feng's heart. Danger! \"Careful.\"</p><br/><p>Before Chen Feng could even finish his sentence...</p><br/><p>Bang!</p><br/><p>A huge explosion erupted. Among the darkness, one of the devil race members started shining with a dazzling radiance. The radiance surged out from its body without stop, forcing its body to explode.</p><br/><p>Hum—</p><br/><p>The terrifying radiance flew into the body of the other two devil race members beside it.</p><br/><p>Instantly, the strength of those two devil race members, which had been equivalent to a beyond A5, increased, reaching the terrifying level of beyond A8 as their strength surged rapidly.</p><br/><p>Everyone's eyes widened. \"Have they gone crazy?\" Everything had happened too fast. Initially, they had believed that this devil race member was merely blowing itself up as a suicide attack, and the genetic warriors had all erected their defenses to defend against the explosion. Unexpectedly, that devil race member had actually been committing suicide, or to be accurate, that devil race member had been sacrificing itself. The devil race was most well versed in the art of sacrificing to increase their strength. Now, this devil race member had sacrificed itself to increase the strength of its comrades.</p><br/><p>\"Howl—\"</p><br/><p>The strength of the remaining devil race members increased greatly.</p><br/><p>Bang!</p><br/><p>One of them started raging.</p><br/><p>Everyone's expression became unsightly. \"Careful.\" They were somewhat at a loss as to how to deal with the devil race experts. They were clear that these two would not be able to maintain this state of increased strength for long. They had expected that they would only need to defend against these two until the duration was over. Alas…</p><br/><p>Xiu!</p><br/><p>Suddenly, one of the devil race members soared up into the sky.</p><br/><p>Everyone was doubtful at this sudden act.</p><br/><p>Right at this instant, an ancient yet mysterious imprint flashed into view on that devil race member's forehead. A faint radiance started flickering out of it. High above the air, this devil race member pointed at all the beyond A classes there.</p><br/><p>Ding! Ding!</p><br/><p>Suddenly, an imprint appeared on all the beyond A classes there.</p><br/><p>Their expressions changed slightly. \"What is this?\"</p><br/><p>That devil race member spat a word out. \"Sacrifice!\"</p><br/><p>Shortly after.</p><br/><p>Bang!</p><br/><p>Its body exploded before transforming into a clump formed of seals. At this sight, everyone's eyes widened. What was this? Another suicide?</p><br/><p>????</p><br/><p>Was this devil race member sick? Committing suicide so easily?</p><br/><p>Just as they were all confused, the seals that the devil race member had transformed into started shining with a dazzling radiance. At the same time, the imprints on all their bodies started shining brightly as well.</p><br/><p>Ka!</p><br/><p>All their body stopped moving. All the experts, the beyond A classes, were at this moment paused in space.</p><br/><p>\"This…\"</p><br/><p>Everyone's eyes widened. Body-pausing technique! The deaths of two devil race members had actually been for the sake of pausing the bodies of all the beyond A classes here. It wasn't that the devil race members had gone crazy. Rather, the humans had all along underestimated the devil race's persistence when it came to killing Li Lei. Right at this moment…</p><br/><p>Xiu!</p><br/><p>Finally, the final surviving devil race member moved.</p><br/><p>Several A classes and beyond B classes tried to stop it. \"Scram!\"</p><br/><p>Bang!</p><br/><p>The group of them was instantly flung away. With their strength, they had actually failed to even stop this devil race member for a split second. As for those beyond A classes? They were all currently incapable of moving. Even after pushing their strength to the limit, even though they could feel that the restriction on their bodies was presently wavering…</p><br/><p>Bang!</p><br/><p>The devil race member punched at Li Lei. At this moment, all the beyond A classes were trapped, the A classes and beyond B classes were powerless to stop this devil race member, and Li Lei himself was unconscious. It seemed like nobody was capable of stopping this attack.</p><br/>\n</div>"}