{"title": "Chapter 540: We Named It...", "id": 540, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-540-we-named-it", "volume_title": "Volume 6", "body": "<h1>Chapter 540: We Named It...</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 540: We Named It... \"Shroud Art\"</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Lu Hun's pupils shrunk. \"It's you guys?\" These three familiar people caused his heart to chill. Apart from these three, it could be vaguely seen that in the distance, there were more blocking his escape routes. These guys… It was them, that squad he had tried to eliminate back then! Lu Hun's killing intent surged. \"You guys are actually still alive!\" So it turned out that these guys that had been forced to the brink of death by him back then were actually still alive. It was no wonder that the figurine was in Chen Feng's hands, then. Were they the ones who had passed it on to Chen Feng? Lu Hun's killing intent intensified.</p><br/><p>Shua!</p><br/><p>At the same time that Lu Hun was still in shock due to their appearance, a cold glance swept past as the three of them joined hands and displayed the combination skill they had created during their days in the Barrier Village.</p><br/><p>Bang!</p><br/><p>A terrifying radiance swept down as a cube-shaped black cage appeared out of thin air, seemingly trying to destroy Lu Hun.</p><br/><p>Lu Hun sneered. \"Do you people truly believe that you can kill me?\" Did they believe that he would be truly helpless since he had exhausted his energy? How naive!</p><br/><p>Hum—</p><br/><p>A faint glow flickered. Lu Hun grabbed at the empty air.</p><br/><p>Bang! Bang!</p><br/><p>All around the world, the numerous clones of Lu Hun burst apart at the same time before transforming into a sea of green particles that ultimately vanished into space.</p><br/><p>Hum—</p><br/><p>All the green particles surged out around Lu Hun's body. The green shone dazzlingly.</p><br/><p>In a split second, Lu Hun's exhausted energy was fully recovered and reaching its peak condition.</p><br/><p>Bang!</p><br/><p>Finally, Gou Li's trio's attack swept past Lu Hun. Alas, this powerful attack failed to deal any damage to Lu Hun.</p><br/><p>Lu Hun's mouth curled up as he sneered. \"Just this much power?\" How weak… Hehe.</p><br/><p>Gou Li ignored Lu Hun and kept his gaze on the space behind Lu Hun. Lu Hun glanced back and noted with astonishment that the attack launched by the three of them had yet to disappear. Rather, after curving in the air, the attack proceeded to instead kill off all the other ancients Lu Hun had called over as reinforcements. It seemed like the true target of Gou Li's trio's attack was actually Lu Hun's companions.</p><br/><p>Hu—</p><br/><p>A cold wind blew past. Lu Hun blanked. He had discovered that, suddenly, in this desolate place, all that was left besides himself were his enemies: the Genetic Union, Chen Feng, Gou Li, and others.</p><br/><p>Finally, Gou Li spoke, his voice seething with boundless hatred.\"And now, you can no longer escape.\" He had been waiting a very long time for this day to come. Once upon a time, he had also been a proud son of the heavens. His squad had been comprised of elite genetic warriors, and each of them had had unlimited potential and future accomplishments. Alas, because of Lu Hun, everything had been destroyed. Beneath the sea, they had waited all these years just for this very day.</p><br/><p>Gou Li's expression was cold, and an astonishing killing intent erupted from him. \"Today, I will kill you!\"</p><br/><p>Lu Hun laughed heartily. \"Haha.\"</p><br/><p>Even without any allies, he did not exhibit any sort of fear.</p><br/><p>\"It's also good for it to be this way,\" Lu Hun muttered. \"I only recovered to this strength level after destroying all my clones. If after this I were to allow you guys to die easily, wouldn't that be too much of a waste?\"</p><br/><p>Hehe.</p><br/><p>The smile on Lu Hun's face became sinister and bizarre.</p><br/><p>Hum—</p><br/><p>A terrifying green radiance shone. With the green radiance shining upon Lu Hun's face, his expression appeared even scarier.</p><br/><p>\"All of you need to die,\" Lu Hun stated coldly. He pointed midair. \"Soul!\"</p><br/><p>Shua!</p><br/><p>An undulation appeared in midair.</p><br/><p>Chen Feng raised his vigilance abruptly. \"Careful.\" He remembered clearly that this Lu Hun still possessed an ability capable of controlling others. This was an extremely terrifying ability. If he was able to control those from the Genetic Union…</p><br/><p>Right at this instant, Gou Li moved. A faint barrier appeared, hovering in midair. When that transparent undulation of Lu Hun's spread out through the air, it collided with the barrier and instantly stopped moving.</p><br/><p>Lu Hun's pupils shrunk. \"This…\"</p><br/><p>\"Do you truly believe that we have been slacking about all these years?\" Gou Li stated coldly. \"As powerful genetic warriors, we all have high resistance toward such mind-control abilities, even if they are launched from a legendary superexpert. With our firm resolution, even if our hearts are charmed, we will still be able to break free. As such, even if we can't defeat the enemy, we will not be controlled. However, your ability… was actually something we were completely helpless against. My defensive measures against mental- and heart-controlling abilities were completely ineffective against you. As such, ever since that happened, I have been thinking about what exactly your ability is. As we grow in strength without stop, we also studied you. This continued until Chen Feng brought us information about you and all the abilities you had used. Only then did we gain a clear understanding of all your abilities.\"</p><br/><p>Gou Li gazed at the diamond on Lu Hun's forehead before continuing, \"Green radiance. Is that the power of space? What you control is the power of space. All your clones are an extension of your power of space. You have created several layers of space and overlapped them to create numerous clones of yourself. As for this soul-possession technique you used, it is nothing like a mental- or heart-controlling ability. Rather, this is you using your spatial abilities to temporarily banish the consciousness of your enemies and replace them with one of your numerous clones—to replace and control the enemy. I do not know how exactly all this is done, but I can conclude that, essentially, all your abilities are related to space. Since its space, we only need to defend against space.\"</p><br/><p>Shua!</p><br/><p>Finally, Lu Hun's expression changed. Up in the sky, that thin barrier remained. Gou Li gazed at the barrier and a longing expression appeared on his face. \"This barrier was created by my brother, Bi Quzhi. This barrier has no other abilities. Its sole function is to restrict spatial abilities. Any spatial abilities will be frozen within this barrier,\" Gou Li stated coldly.</p><br/><p>Only now did Lu Hun realized that he was no longer able to sense the existence of any spatial powers.</p><br/><p>Shua!</p><br/><p>He tried unleashing a spatial slash.</p><br/><p>Oh.</p><br/><p>He was still able to do it. However, he could no longer sense the power of space, nor could he receive any sort of feedback from space. Moreover, even this spatial slash, the most basic of all spatial abilities, had consumed a terrifying amount of his energy to unleash.</p><br/><p>This damnable barrier had actually severed his connection with space, with heaven and Earth.</p><br/><p>\"Brothers, can you see this?\" Gou Li muttered to himself.</p><br/><p>Bang!</p><br/><p>Once again, the three of them moved. Lu Hun was their target.</p><br/><p>Bang!</p><br/><p>A terrifying radiance shone brightly. Chen Feng and the rest watched on distantly. An evenly matched fight did not happen; no resistance could be seen. This was a purely one-sided beatdown of Lu Hun by Gou Li's trio.</p><br/><p>Ten years worth of waiting.</p><br/><p>Ten years worth of hatred.</p><br/><p>Ten years worth of study.</p><br/><p>Ten years worth of attempts at countering Lu Hun.</p><br/><p>Gou Li's group had indeed been waiting for this moment for way too long. Initially, they had truly had no way of accomplishing this, since the gap between their strength and Lu Hun's strength was too huge. However, thanks to the beyond X gene reagent, they had become beyond A classes as well.</p><br/><p>Pu!</p><br/><p>With a cold flash, Gou Li's weapon slashed Lu Hun's body, resulting in blood splattering everywhere.</p><br/><p>Lu Hun was alarmed. \"How is this possible?\" His strength level was obviously at beyond A9 and was clearly much stronger than these three. However, every single time they attacked, their attack seemed much stronger than his. Could it be…</p><br/><p>He gazed at the faint barrier coated around Gou Li's weapon. He could sense clearly a powerful strength exuding from the barrier.</p><br/><p>Gou Li sneered. \"Have you discovered it? This is Bi Quzhi's ability. Although he died because of you, although he can no longer witness this with his own eyes, the ability he created has been preserved.\"</p><br/><p>Shua!</p><br/><p>Gou Li's weapon slashed forth. On that ordinary weapon, a layer of silvery light could be seen. With a silver flash, Lu Hun's powerful spatial defense was sliced apart like paper. Gou Li caressed the barrier gently before saying, \"We named this ability… the Shroud Art.\"</p><br/>\n</div>"}