{"title": "Chapter 552: Good News for Middle-Aged Males", "id": 552, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-552-good-news-for-middle-aged-males", "volume_title": "Volume 6", "body": "<h1>Chapter 552: Good News for Middle-Aged Males</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 552: Good News for Middle-Aged Males</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Genetic Union.</p><br/><p>The sale of Time Quicksand was just nice for Chen Feng. Such abilities could only be traded internally within the Genetic Union for points. If it was able to help gather enough points for him to exchange for resources that would help him reach beyond A class, that would be even better. After all, here in the Genetic Union, the points were able to be used for anything one wished.</p><br/><p>Hire beyond A classes? Purchase materials? So long as one had sufficient points, one could obtain whatever one wished. Back then, thanks to the amount of points he'd had, after joining the Genetic Union, he had been classified as an official member. As such, he was eligible to enjoy all the Genetic Union had to offer. However…</p><br/><p>Shua!</p><br/><p>Chen Feng took a look at the rows upon rows of abilities in front of him. At present, he was already a peak beyond B9. If he wanted to enter beyond A class, he had to first break through his present realm before fusing with a brand-new ability. Producing the gene reagents was something he could complete himself, but for the process of breakthrough…</p><br/><p>----</p><br/><p>Rapid-Growth Training Camp</p><br/><p>Right Holder: Genetic Union.</p><br/><p>Grade: Peak beyond B class.</p><br/><p>Difficulty: 5 stars.</p><br/><p>Success Rate: 20%.</p><br/><p>Number of Participants: One per month.</p><br/><p>----</p><br/><p>This was a training camp, something Chen Feng had once encountered at the Mysterious Organization. The unique environments of these training camps increased the odds of one's breakthrough. However, the quota for participating in these training camps was extremely valuable. This was something a regular person had no hope of participating in.</p><br/><p>\"Mhm…\"</p><br/><p>Chen Feng looked at the list of applicants for this training camp. So far, there were over 100 people waiting, with some having waited for an entire year already. The only thing these people could do was increase their contribution points unendingly in hope of obtaining a spot.</p><br/><p>If so, how long would he need to wait? Chen Feng tried to check out other training camps. There were a huge number of similar training camps that could help beyond B classes enter beyond A class. Since Chen Feng wasn't someone who was afraid of success rates, he believed that it wouldn't be too difficult for him to find one for him to join. Unfortunately, his search returned nothing. He could not find even a single one to join. Even for the camp with the shortest waiting list, there were still 126 names on the list.</p><br/><p>Even so, the reason for this waiting list being the shortest was due to the high difficulty of this camp, and only those with excessively high contribution points were on the list here. Others gave up on trying to enter the waiting list after failing. Even the order of the waiting list was determined by one's contribution points. Only those with the most contribution points could be listed at the top of the list.</p><br/><p>It was possible that one might be slated to enter next month but suddenly someone with more contribution points would appear and the first person would have to once again wait, whereas the one with more contribution points would get to enter first. As such, to maintain one's position on the waiting list, one had no choice but to accept missions without stop, to earn contribution points without stop. Only by doing this could one obtain a chance to enter the camp.</p><br/><p>This was especially true after the sale of the beyond X gene reagent. A huge amount of peak beyond B classes had appeared, causing the limited quota for the training camps to be unable to meet the demand.</p><br/><p>Chen Feng smiled bitterly. \"Have I inevitably screwed myself by releasing the beyond X gene reagent?\" All the training camps at the Gene Production Association were only helpful for the increase of one's production level. As such, he had no choice but to look for strength-increasing training camps here at the Genetic Union. Alas, his special identity within the Gene Production Association did not seem helpful here at the Genetic Union.</p><br/><p>With several dozen training camps, it shouldn't be too hard for him to find one suitable for him, right? Chen Feng tried asking around. Unfortunately, there were no results. At present, even the one with the highest contribution points in the list had waited for at least half a year. Every person on the waiting list was either part of a major family, the heir of some peak beyond-A-class warrior, or of similar status.</p><br/><p>Now, with the threat of the ancient race and devil race looming, nobody would be willing to concede their position in the waiting list. It was impossible for Chen Feng to cut in line. Furthermore, even if one person was willing to concede the spot to Chen Feng, would the others be willing? The only way Chen Feng could enter first was if the several hundred people on the waiting list all conceded their spots to him. After all, his contribution points at the Genetic Union were too low. As such, the only way he could enter first was to get special treatment from the Genetic Union. In fact, with Chen Feng's present identity, he was indeed qualified to obtain this special treatment from the Genetic Union.</p><br/><p>However, at present, both the ancient race and devil race were paying close attention to him and waiting for a chance to kill him a hundred times. As for the Genetic Union, they were all hoping that Chen Feng could obediently serve as a mascot for them among humanity. If possible, they hoped that Chen Feng would forever stay within the Genetic Union under their protection and never leave. As such, it was rather unlikely for them to grant him an exception to enter the training camp, resulting in him leaving the protection of the headquarters.</p><br/><p>\"What bullshit is this?\"</p><br/><p>Chen Feng did not know whether to laugh or cry.</p><br/><p>Even if the present Genetic Union seemed rather reliable in terms of providing protection, he had no intention of forever staying under their protection and leeching off them. In this era, it was better for one to grasp strength in one's own hands.</p><br/><p>\"Seems like I can only think of something myself.\" Chen Feng sighed. \"Contribution points…\"</p><br/><p>Chen Feng narrowed his eyes as he studied the description of the contribution points. This system of contribution points was rather simple. This was a system where the importance of one's mission was the determining factor, an entirely different system from the regular points and the regular rewards for missions.</p><br/><p>This system of contribution points was like a flight of steps. The higher it was, the harder it would be. One mission might have ample rewards, yet only a tiny amount of contribution points would be given. As such, even when selecting missions, one had to be prudent. Naturally, Chen Feng would not be so bored that he started wasting time accepting missions to earn contribution points. If he were to do this, how long would it take to obtain sufficient contribution points? At the same time he was obtaining contribution points, others would be doing the same as well. As such, accepting missions to obtain contribution points was rather unreliable.</p><br/><p>\"If so…\" Chen Feng narrowed his eyes. Suddenly, his gaze landed on Time Quicksand. This was something capable of earning him a huge amount of points. Naturally, they were regular points rather than contribution points. However, according to a certain provision in the laws of the Genetic Union…</p><br/><p>Suddenly, Chen Feng laughed. \"Hehehe.\"</p><br/><p>You guys are the ones who forced me to do this.</p><br/><p>At present, Time Quicksand had only created a small uproar. Even if this was the first new unique ability added to the list after so many years, this ability seemed too ordinary and had failed to garner a huge amount of attention. To buy or not to buy? This was a question a lot of people were asking. A huge majority of the beyond A classes were assuming a \"wait and see\" attitude.</p><br/><p>Suddenly, a rating appeared on the trade interface of Time Quicksand. The Genetic Union's regular points were extremely valuable; each point was something the genetic warriors fought with their blood and life to earn. As such, in order to prevent wasting points on unsuitable abilities, there would be a short description, introduction, and rating for each listed ability.</p><br/><p>The total points were 10. Those rated 1 point were classified as trash abilities, while those rated 10 points were classified as abilities of great value. Different ratings would signify different worths for the listed abilities. After all, this was not some competition among merchants. As such, fake ratings were something that had never appeared here. This resulted in these ratings being something of utmost importance here on this list.</p><br/><p>\"What's the rating?\"</p><br/><p>\"Let me see… Holy shit, 10 points?\"</p><br/><p>Nobody could believe it.</p><br/><p>Nobody had expected that the first beyond A class that had purchased Time Quicksand would actually leave a rating of 10 points there. What did this signify? One ought to know that in this rating system of theirs, a score of 10 was the equivalent of a perfect score. Even the 6-star secret art that was publicly acknowledged as the strongest ability was only rated at eight points. The reason for that rating was the excessive price.</p><br/><p>This Time Quicksand was obviously priced similarly as those beyond A class abilities, yet it was still rated at 10 points? Could this ability be even stronger than that 6-star secret art? Everyone's expression became solemn as they pondered this. If that was indeed the case…</p><br/><p>Instinctively, their gaze landed on the content of the rating, and instantly, their expression blanked.</p><br/><p>\"Rated by anonymous warrior *****: This is the savior of all middle-aged men. With my strength as a beyond A9, I am able to easily use this ability nine times in a row, perfectly avoiding that awkward premature [censored]. The act of [censored] that I long gave up on is once again possible. My [censored] power has actually increased by five times! Like! \"</p><br/><p>Shua!</p><br/><p>The people of the Genetic Union lapsed into silence when they saw this. This was a review filled with mosaics. However, even with that, they were able to clearly guess exactly what this person was trying to say. This was especially true for the sentence \"savior of all middle-aged man,\" which clearly hinted at what this was about.</p><br/><p>Mhm…</p><br/><p>Time Quicksand could be used like this? Hold on, nine times, after an increase of five times…could it be that this old man had only been able to last two seconds when doing the deed previously? They wiped their sweat. This review was truly…</p><br/><p>But then, if Time Quicksand could truly be used in such a manner…</p><br/><p>Some of them were full of doubt. \"That's not possible, right?\"</p><br/><p>\"After all, that old man is still a beyond A class. How is it possible that…\" one stated in a low voice.</p><br/><p>Someone else sighed. \"Maybe the wife is also a beyond A class?\"</p><br/><p>\"That might be true.\"</p><br/><p>At this, the others gained understanding. With how interesting this was, it soon spread throughout the entire Genetic Union, to the point that a lot of them had odd expressions whenever they look at a beyond A class. And because of this, the Time Quicksand became a trending topic. Immediately after, people started discussing the actual function of this ability in battles, in injury reduction, in increased ability duration, and so on. All of these were things that still required further testing. With this, Time Quicksand became truly, incredibly popular.</p><br/>\n</div>"}