{"title": "Chapter 556: Heaven-Defying Transactions", "id": 556, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-556-heaven-defying-transactions", "volume_title": "Volume 6", "body": "<h1>Chapter 556: Heaven-Defying Transactions</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 556: Heaven-Defying Transactions</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>After every promotion, additional functions would be unlocked. After every promotion, apart from additional spiritual energy gain, one could obtain additional mystery functions as well. An example was ranking. This particular function ranked the levels of the users. Users across the world were included in this rank.</p><br/><p>First place: XXXX</p><br/><p>Second place: XXXX</p><br/><p>Third place: XXXX</p><br/><p>Apart from this, there were also regional rankings, city rankings, and many other types of rankings. With all these additional functions, even if this Master Spirit Trainer created by Chen Feng was a rather simple ability, with the top three in the rankings being featured in articles, the users were able to gain a sufficient level of respect.</p><br/><p>One ought to know that the present users of Master Spirit Trainer were humans across the world. As such, these featured people topping the rankings would soon become famous.</p><br/><p>\"Holy shit. That Gou Dan fellow is already first ranked in our city?\"</p><br/><p>\"Ah ah ah, the first rankers are even featured in an article? They can even write down a single sentence to be used as a saying like an important person. How enviable. At the 11th rank, the only thing I get is my name being included in the ranking, nothing else.\"</p><br/><p>\"How am I supposed to increase my ranking?\"</p><br/><p>\"There are no other methods. You have to grind without stop.\"</p><br/><p>They sighed. Each and every single one of the rankings received much attention. This was even more true for the world ranking. It seemed like as long as one entered the world of Master Spirit Trainer, one would be able to see all the rankings. In this new era where everyone was using Master Spirit Trainer, the reputation of the top rankers in this world couldn't be underestimated.</p><br/><p>And to increase one's rank, the only method was to challenge without stop, to remove their weakened state without stop whenever a defeat occurred.</p><br/><p>\"How nice would it be if there was a method for climbing the ranks faster.\"</p><br/><p>\"Sigh. Nobody has any shortcuts.\"</p><br/><p>They felt regretful. Right at this instant, after grinding painstakingly, a certain user finally reached the limit of E class and achieved D-class access level. Next, he noticed that another astonishing function had been unlocked again.</p><br/><p>The new function: 100 points to remove the weakened state.</p><br/><p>!!!</p><br/><p>As this news spread, everyone's eyes widened. Remove the weakened state? With 100 points? Hold on…</p><br/><p>In other words, after unlocking this function, one could remove the weakened state at any time? One could initiate a challenge at any time, disregarding the weakened state by only paying? Granted, this was a rather steep price. However…</p><br/><p>Bang!</p><br/><p>With this, everyone went crazy. This was especially true for those racing up the ranks. With this function, one could continue the challenges, increasing their spiritual energy without stop, and their access level would increase without stop as well. Furthermore, the speed their strength was increasing at would be raised as well. All this seemed to be good news, something akin to a snowball effect.</p><br/><p>\"Buy, buy, buy!\"</p><br/><p>\"Grind, grind, grind!\"</p><br/><p>\"I will most certainly obtain the first rank in this city today.\"</p><br/><p>\"Hmph, I, on the other hand, am aiming to enter top 10 of the world ranking.\"</p><br/><p>Everyone started their crazy grind.</p><br/><p>Shua! Shua!</p><br/><p>Challenges were initiated crazily, and the precious points of the Genetic Union became something as common as some vegetable. Everyone, regardless of whether they were from the Genetic Union headquarters or branches, whether they were weaklings or experts, was exhausting their points without stop. Even those F-class genetic warriors couldn't resist using their points to remove their weakened state, renewing their number of attempts without going through the stabilization process.</p><br/><p>The only reason for such craziness was to save time, to enter the access level of E class as soon as possible and to gain more spiritual energy as soon as possible. After all, at their present low access level, the amount of overflowing spiritual energy after each victory was so great that it caused their hearts to ache endlessly.</p><br/><p>As for their opponents, it seemed like the opponents would forever be at a level similar to the challenger's. As such, there was no need to worried about the opponents they would encounter. The only thing they needed to concern themselves with was their access level. The only thing they needed to do was increase their access level until their access level was at least equal to their actual level in the real world.</p><br/><p>Rush, rush, rush!</p><br/><p>Buy, buy, buy!</p><br/><p>Everyone became crazy. Only now did the Genetic Union realize that something did not seem right.</p><br/><p>Hold on…</p><br/><p>With how things were progressing, something somewhere seemed off?</p><br/><p>\"D-deputy president.\" The employee was sweating madly. \"There's a mistake in our data somewhere.\"</p><br/><p>The deputy president, who was busy rushing toward the C-class access level, raised his head as he asked, \"What data?\" Presently, he was only two victories away from reaching C class. As such, he was unhappy with this interruption.</p><br/><p>\"Chen Feng's data,\" the employee answered with a sullen expression.</p><br/><p>\"Chen Feng?\" The deputy president was startled awake. \"Show me.\"</p><br/><p>Next, he saw an extremely horrifying set of data. Based on the latest data, during the past two days, the amount of points used to purchase the function to remove the weakened state…</p><br/><p>Shua!</p><br/><p>The deputy president started sweating madly as he saw it. He stared blankly at the number that had surpassed 100 million.</p><br/><p>\"Sur... surpassed 100 million already?\" the deputy president mumbled.</p><br/><p>\"That's right.\" The employee forced a smile. \"This is merely the beginning. As the number of people who have unlocked this function increases, this number will continue to rise, until…\"</p><br/><p>The deputy president was furious. \"How did this happen?\"</p><br/><p>\"This…\" The employee pointed meekly.</p><br/><p>The deputy president glanced over at what the employee was pointing at. Instantly, he smiled bitterly. There, it was listed that the deputy president himself had already made 32 purchases. As a deputy president, he naturally had a huge amount of points. Furthermore, he was unwilling to waste his time fighting those mutated beasts to remove his weakened state. As such, it was only natural that he would purchase the function without stop.</p><br/><p>And thus… this had happened. Apart from all this, those damnable rankings were also what had caused everyone to purchase the remove-weakness function so crazily. It was rumored that there was a certain E-class warrior that had been accepted as the disciple of a beyond A class after distinguishing himself in the rankings. Apart from this, various such rumors were being spread without stop.</p><br/><p>This was a brand new era, the era of Master Spirit Trainer. Just look at how Chen Feng had earned more than 100 million points in only a few days. If this was allowed to continue…</p><br/><p>The deputy president's heart chilled as he thought about this.</p><br/><p>The employee was extremely anxious as well. \"What should we do?\"</p><br/><p>\"Get the research team to make a move immediately,\" the deputy president commanded. \"Stop all their projects and get all of them to focus on researching this spirit art of Chen Feng's. I want to know what exactly is the core of this spirit art. I want to see clearly… what it is that constitutes the essence and ability of this spirit art.\" He could not allow this to continue. He was certain that if this continued, Chen Feng's points would surge rapidly until the moment where the Genetic Union no longer had anything to exchange for this Chen Feng's points. At that time, based on a certain provision in their laws, Chen Feng would be able to use his points to exchange for the authority within the Genetic Union. At that time…</p><br/><p>Hehe.</p><br/><p>The entire Research Department was alarmed. After receiving the command from the deputy president, they started researching madly. They were well aware of how popular this spirit art was. They were also curious about what exactly this damnable ability was. What was the origin of this ability?</p><br/><p>\"There is no such thing as gaining spiritual energy from nothing. Even when using gene reagents, the energy used to increase one's spiritual energy is obtained from the materials used to produce the gene reagent. If so, what exactly is the source of the energy used for the spiritual energy increase in this spirit art of Chen Feng's? We must figure that out.\"</p><br/><p>This was the main goal of the Research Department. Why was everyone using this spirit art capable of increasing their spiritual energy? Was it based on the concept of the conservation of energy? What was the source of the energy? From the air? How was that possible? The lingering energy in the air could only be used for slow growth. Such rapid growth for users of the spirit art was simply impossible to achieve. Up until now, nobody had ever achieved such a feat using energy in the air as their source.</p><br/><p>If so, what was up with this spirit art? Nobody had an answer. The Research Department started researching day and night, and after one week, they finally obtained a result.</p><br/><p>This result they had obtained caused their hearts to chill.</p><br/><p>\"Is the research completed?\" the deputy president asked the person with deep dark circles.</p><br/><p>The head of the Research Department nodded. \"Yes.\"</p><br/><p>\"Tell me the results, then.\" The deputy president forced himself to focus. After all, it had been a week since he'd last slept.</p><br/><p>\"From our investigation, we found that the energy source for the increase of spiritual energy in the users of the spirit art is not something that appeared out of nowhere. Rather, the energy originates from the opponents,\" the head stated solemnly.</p><br/><p>\"Opponents?\" The deputy president became confused. \"Isn't the opponent something formed and supplied by the spirit art itself?\"</p><br/><p>The head shook his head. \"That's not the case. Although a user can only see a silhouette of light when battling their opponent, our research has revealed that the so-called opponents are actually real humans.\"</p><br/><p>\"Who are those people? Where are they?\" the deputy president asked anxiously.</p><br/><p>\"We, the users of spirit art, are precisely the opponents.\" The research department head forced a smile. \"Chen Feng's spirit art first simplifies the appearance of all opponents by covering them up with a special effect. In truth, the challenges and battles are in fact between fellow users. The so-called opponents are us, the users.\"</p><br/><p>Shua!</p><br/><p>The deputy president lapsed into silence. He was truly shaken. Those figures of light they had been battling were actually fellow humans.</p><br/><p>\"Each user is first given with a grade, and then users of the same grade are arranged as opponents against each other.\" The head smiled bitterly. \"Even this is something we only discovered accidentally after we stumbled upon each other during challenges. Even with the special effect shrouding the opponent, we were able to recognize each other. That was how we discovered it.\"</p><br/><p>Suddenly, the deputy president thought of something. \"How about the gained spiritual energy, then?\" If the spiritual energy was gained from their opponent, what of their opponent?</p><br/><p>\"The defeated user will enter the weakened state,\" the department head stated. \"Through our research, we found that all those in the weakened state will retain 99% of their combat power, but 1% of their energy goes missing. Since the amount is too minute, nobody has paid much attention to it.\"</p><br/><p>\"Through hunting spirit-based mutated beasts at a level similar to the user's, the lost energy will slowly recover and stabilize, and ultimately, the weakened state will be removed as the user recovers to normal,\" the head slowly concluded.</p><br/><p>Holy sh*t! The deputy president blanked. This was possible? \"How about the weakened state remover he's selling?\" the deputy president asked.</p><br/><p>\"That must be a certain gene reagent provided by Chen Feng himself. Regardless of who it is that makes the purchase, Chen Feng will provide this gene reagent to reimburse the lost energy in a short period of time. Since a reduction of 1% isn't too grave, apart from specific circumstances, the cost for such a gene reagent shouldn't be too high. Based on our calculations, at most, this gene reagent might cost 3 points to produce.\" The head sighed.</p><br/><p>Deputy president: \"…\"</p><br/><p>He stared at the spirit art that he had still been so fascinated with earlier. A bitter feeling arose within him. In short, the spiritual energy gain provided by this spirit art was actually provided by fellow users like them? Suddenly, the deputy president recalled an ancient saying: wool comes from the sheep's back.</p><br/><p>That's right, the energy was sourced from fellow challengers. The only thing Chen Feng provided was a rather expensive customer service.</p><br/>\n</div>"}