{"title": "Chapter 570: The Real Mastermind", "id": 570, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-570-the-real-mastermind", "volume_title": "Volume 6", "body": "<h1>Chapter 570: The Real Mastermind</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 570: The Real Mastermind</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>He laughed lightly. \"Interesting.\"</p><br/><p>Here in this place where there should be no sound, this light laugh sounded so very loud and clear.</p><br/><p>\"Worthy of being Chen Feng indeed. I knew you wouldn't die easily like that.\" He gazed at the gene reagent on his hand toyingly. \"You have even something like this as your trump card? What a pity. Regardless of how many miracles you can create, I have prepared well in advance.\"</p><br/><p>Chen Feng smiled bitterly: \"…\"</p><br/><p>What else could he say? The more miracles he created, the more preparations his enemies would make before making a move against him. Evidently, energy exhaustion was merely the primary plan. This enemy had originally planned to let Chen Feng die from exhaustion. When Chen Feng had taken out this \"spatial teleporting gene reagent,\" the enemy had been compelled to reveal himself. The alternative to the first plan was to personally kill Chen Feng.</p><br/><p>Chen Feng looked at that person. \"Who are you?\" This person felt familiar, yet he was certain he had never met this person before.</p><br/><p>\"Ah,\" that person merely replied with a smile. \"Die!\" Lightly, he waved his hand. Evidently, he was not planning to give Chen Feng any chance to delay this.</p><br/><p>Qian Chen blocked before Chen Feng. \"Scram!\"</p><br/><p>Bang!</p><br/><p>Light swirled around, and instantly, Qian Chen was blasted away. That's right. It only took this person an instant to defeat Qian Chen.</p><br/><p>Si Fan looked at him in panic. \"You… You…\"</p><br/><p>Bang!</p><br/><p>With another flash, Si Fan was blasted away as well. The two new beyond A1s were completely helpless before this person.</p><br/><p>Chen Feng's eyes gleamed coldly. \"Who exactly are you?\" Such strength, he should be a beyond A7 at the very least.</p><br/><p>Even if there were a lot of beyond A classes everywhere, most of them were still around beyond A1 or beyond A2. They were still rather far from those true experts in beyond A class. This person was most definitely one of those experts who had entered beyond A class long ago.</p><br/><p>That person answered with another smile. \"Hehe.\"</p><br/><p>Bang!</p><br/><p>The terrifying radiance descended, with Chen Feng as the target this time.</p><br/><p>Qian Chen and Si Fan were alarmed. \"Chen Feng!\" They had both been blasted quite far away and were not able to assist Chen Feng in time. Moreover, with their strength, they would be no different than cannon fodder even if they arrived in time. They would not make a difference.</p><br/><p>Bang!</p><br/><p>The radiance erupted brightly. Instantly, the dazzling radiance spread all over.</p><br/><p>Chen Feng inhaled deeply. \"It's coming?\" He could feel the terrifying pressure amid the boundless white. This was the might of an apex expert, and also his final chance… at breaking through!</p><br/><p>\"Spirit,\" Chen Feng urged with a cold gaze.</p><br/><p>\"Understood.\"</p><br/><p>Luck Aura was fully activated.</p><br/><p>Hum—</p><br/><p>A faint aura swirled around. All the remaining energy in Chen Feng's body bloomed. From the moment he had noticed the existence of an enemy here, all his energy had been hidden away. Only a small portion of his energy had been used to maintain the fake cultivation state he had been in earlier. He still had his original strength. He was sure that this was his one and only chance.</p><br/><p>Even though the enemy had stopped his breakthrough earlier, in order to avoid suspicion, the enemy had still allowed Chen Feng to remain on the verge of breaking through, only stopping him from crossing over that single line. Only a thin line remained between Chen Feng and his breakthrough. He only needed to cross over this thin line and he would most definitely enter beyond A class.</p><br/><p>As he had been sealed by this enemy, he had been unable to break through this thin line. Now, though, in this final moment where the enemy had the impression that Chen Feng could no longer survive, Chen Feng intended to make use of the enemy's power to break through this thin line, to break through using that extremely strong pressure and that terrifying might.</p><br/><p>\"Come!\" Chen Feng howled.</p><br/><p>Bang!</p><br/><p>A terrifying radiance erupted. All of Chen Feng's energy erupted. At this instant, the entirety of his power bloomed. The shaking radiance at the point of contact caused this clash to appear even more terrifying.</p><br/><p>The hearts of Qian Chen and Si Fan chilled as they saw this. It's over. They had never expected that an enemy so terrifying would appear here while they were training. This time, Chen Feng's death was already assured. At present, the both of them were perhaps worrying about their fates instead.</p><br/><p>Hum—</p><br/><p>The faint radiance landed. Yet when they looked over, they blanked. At this time, they noticed that Chen Feng, who was supposed to be dead, was still standing there. All around his body, a faint radiance swirled. The feeble power surrounding him had become furious and fierce.</p><br/><p>Beyond A class!</p><br/><p>That was the power of beyond A class. Chen Feng had actually broken through during the crucial moment.</p><br/><p>\"How powerful.\"</p><br/><p>Qian Chen gazed at Si Fan blankly. They exchanged glances, indescribable alarm in their eyes. Chen Feng had actually entered beyond A class. Moreover, Chen Feng's beyond A class seemed even more terrifying than they had imagined. He was actually capable of blocking the power that had been capable of instantly blasting them away.</p><br/><p>The enemy looked at Chen Feng with shock in his eyes as well. \"You…\" He was still shocked even though he had already been aware that Chen Feng was good at creating miracles. When that person had drawn up numerous strategies to deal with Chen Feng, he had viewed them all with disdain, believing that he could easily kill someone like Chen Feng with a single slap.</p><br/><p>Now, he became speechless. Both his plans had been stopped by Chen Feng. This Chen Feng fellow was much more terrifying than they had estimated. Moreover, his luck was too astonishingly good. However, this should be the most he could do.</p><br/><p>He looked at Chen Feng coldly. \"Even if you have broken through, so what?\" The breakthrough had indeed exceeded his expectations. However, a beyond A class that had only recently broken through was simply not a match for him.</p><br/><p>Bang!</p><br/><p>He took a step forward as a terrifying radiance swirled around him. \"Today, I will most definitely kill you.\" His killing intent locked onto Chen Feng.</p><br/><p>\"Is that so?\" Chen Feng looked at him toyingly. \"Are you sure that you can kill me for real?\"</p><br/><p>Shua!</p><br/><p>Chen Feng took out something from his bosom. Mhm… it was another spatial teleportation gene reagent.</p><br/><p>Chen Feng sneered. \"Are you stupid enough to believe that I only had one of this on me?\" Silently, he took a step back. The anxious Qian Chen and Si Fan came over. The three of them fixed their gazes on this enemy, despite the fact that they seemed so powerless before such an opponent.</p><br/><p>\"Sorry. I have no intention of fighting you at all,\" Chen Feng stated proudly. \"Since I have already broken through successfully, hehe, goodbye.\"</p><br/><p>Chen Feng was about to leave.</p><br/><p>Suddenly, that person asked, \"Don't you want to know who I am?\"</p><br/><p>\"…\" Chen Feng stopped the activation of his gene reagent and narrowed his eyes. \"Who are you?\"</p><br/><p>\"Hehe.\" That person smiled calmly. \"We met once. However, at that time, I was as dazzling as a deity and you failed to get a clear look at my appearance,\" that person said flatly. Slowly, the radiance around him intensified, even more so the radiance on his forehead. There, a single dot of light was shining dazzlingly, and slowly, the radiance coalesced into a diamond-shaped object. Finally, all the swirling radiance faded. Standing there, he seemed to be bathed in a white light. On his head was a white crown, and on his forehead was a flickering white diamond.</p><br/><p>\"It's you!\" Chen Feng cried out in alarm. Master Mu, the master of that fanatical religion. He was a self-proclaimed god, the founder of a certain religion, and that white hat was his crown. Indeed. The ancient race was the one trying to kill him?</p><br/><p>Chen Feng tightened his grip on the teleporting gene reagent. \"You won't be able to stop me.\"</p><br/><p>\"Of course I can't stop you.\"</p><br/><p>Master Mu looked at him with a wide smile, \"However, do you know how many believers I have?\"</p><br/><p>What?</p><br/><p>Chen Feng had a vague feeling of unease.</p><br/><p>Whoosh!</p><br/><p>A killing intent streaked at him from behind him. Chen Feng leaped, trying to dodge the attack.</p><br/><p>Pu!</p><br/><p>Blood splattered around. Qian Chen, who should have been protecting Chen Feng, could be seen pulling his hand back. As for Si Fan, her hand was holding the teleporting gene reagent she had just grabbed from Chen Feng.</p><br/><p>\"You two…\"</p><br/><p>Chen Feng's heart trembled. He was aware that the ancient race had made numerous preparations. That was the reason he had used the so-called \"spatial teleporting gene reagent\" to force Master Mu to reveal all his trump cards. Unexpectedly, this was a truly huge trap.</p><br/>\n</div>"}