{"title": "Chapter 572: Bring It On!", "id": 572, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-572-bring-it-on", "volume_title": "Volume 6", "body": "<h1>Chapter 572: Bring It On!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 572: Bring It On!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Qian Chen supported him hastily. \"Lord.\"</p><br/><p>Damn it! Master Mu's expression sank. That was an alarm sent to him from his White Church.</p><br/><p>Shua!</p><br/><p>He waved his hand. A huge screen appeared in midair. Within were the scenes playing out at the White Church. There, a mysterious person had appeared midair and was presently killing everything around him.</p><br/><p>Bang! Bang!</p><br/><p>The entire church cracked as those formidable believers were killed without any chance to even fight back.</p><br/><p>A smile appeared on Chen Feng's face. \"You finally arrived.\" Even though the energy, aura, and appearance of that person had been disguised, Chen Feng was still able to recognize him. This was precisely Qin Hai. He had indeed received Chen Feng's signal. Since this Master Mu had prepared numerous plans just to kill Chen Feng and someone was scheming for him behind the scenes, this Ownerless Land should have already fallen into enemy hands.</p><br/><p>As such, even if Qin Hai were to come here, he would most probably fail to rescue Chen Feng. In that case, they might as well force this Master Mu to return instead. With that, Chen Feng would be able to obtain additional time, and with the gained time, perhaps he would be able to discover a lifeline. His expression calm, Chen Feng analyzed everything that was happening.</p><br/><p>Master Mu looked at Chen Feng. \"It's you!\" He had obviously interfered with Chen Feng's communicator!</p><br/><p>Chen Feng sneered. \"Interference.\" Blocking? Interference? What a joke. Whatever Master Mu had used, it was only capable of interfering with Chen Feng's communicator. However, how could it hope to interfere with Chen Feng? As long as he wished, with a little luck value, he could even use the wind to shape the clouds above the sky to send a message for him. How naive! Do you think that my method of calling for help is as unreliable as your ancient race's drop drop beatdown?</p><br/><p>\"Hehe.\" Chen Feng smiled calmly. \"Tsk tsk. O great Master Mu, have you ever thought that while you are hunting, you are also prey at the same time?\"</p><br/><p>Pu! Pu!</p><br/><p>The mysterious man moved once again. Once again, countless members of the White Church died.</p><br/><p>That mysterious man was too powerful. Even those beyond-A-class experts of the White Church were not his match. They were of two completely different leagues.</p><br/><p>\"Lord…\"</p><br/><p>Countless believers knelt on the ground, calling out for Master Mu to return. He was the only person capable of stopping this slaughter.</p><br/><p>Master Mu's eyes gleamed coldly. \"I am going to kill you!\"</p><br/><p>Shua!</p><br/><p>His killing intent surged as he charged at Chen Feng. Alas, right at this instant, on the screen, the mysterious man had already reached the inner areas of the White Church. There, Master Mu's children were presently hidden in the room in fear.</p><br/><p>Master Mu's eyes widened. \"No!\"</p><br/><p>Chen Feng sneered. \"Return fast. Since your White Church specializes in faith summoning, I'm sure you have a method of instant teleportation back there, right?\"</p><br/><p>Master Mu was furious. \"You are courting death!\" He could naturally return instantly. However, that was because the White Church was his main base. After returning, if he wanted to come here again, it wouldn't be so easy. If he left, Chen Feng would certainly be able to escape. This was something he could not accept. Moreover, he had been alive for so many years, yet nobody had ever dared to threaten him.</p><br/><p>Suddenly, Master Mu shut his eyes. \"You have no idea what you are doing.\"</p><br/><p>Shua!</p><br/><p>Suddenly, the screen vanished.</p><br/><p>Chen Feng's heart jolted. Huh?</p><br/><p>Hum—</p><br/><p>Once again, the diamond on Master Mu's forehead gleamed. This time, the scenes of the White Church were not shown. Rather, a mysterious yet resplendent white radiance appeared. This white radiance was obviously somewhat different than normal the white radiance.</p><br/><p>Hum—</p><br/><p>The white radiance spread out. Stepping across millions of kilometer, the white ray returned to the White Church instantly.</p><br/><p>Shua!</p><br/><p>Next, everything in the White Church started to slow down. Master Mu had actually slowed the flow of time in the White Church with his own power. After doing this, Master Mu's face dimmed. He had been able to obtain an additional one second for himself, which would be sufficient to do what he wanted.</p><br/><p>\"Kill!\" Master Mu spat. At this instant, the entire world seemed to start transforming. With an ice-cold expression, Master Mu continued, \"I will most certainly return. However, I will still be able to kill you before leaving. I only need a split second to kill you.\"</p><br/><p>Bang!</p><br/><p>Swirling radiance flashed around Master Mu's hands.</p><br/><p>This threat of Chen Feng using his children had truly angered him. It was time to let this idiotic human experience how terrifying the supreme power of the ancient race could be. Master Mu erupted.</p><br/><p>\"Kill!\"</p><br/><p>His attack descended. This time, alongside him, Qian Chen and Si Fan attacked together as well. The three of them surrounded Chen Feng, forcing Chen Feng to his death.</p><br/><p>Bang!</p><br/><p>Terrifying attacks poured down upon Chen Feng.</p><br/><p>\"Just end this…\" A trace of regret was apparent in Qian Chen's eyes. At the same time, his eyes were also filled with resoluteness. They were a part of the great White Church. Even if it was somewhat of a pity for Chen Feng to die, they trusted the White Church to bring them all into a new era.</p><br/><p>Holy shit! Not willing to return even with this? Chen Feng was stupefied. Do you think you are HKE?[1] 1 Are you not afraid of Divine Protector Ox?[2] 2</p><br/><p>Hu—</p><br/><p>Chen Feng inhaled deeply. Since he couldn't force this fellow to return, he could only fight with his all.</p><br/><p>Shua!</p><br/><p>Chen Feng stretched his hand out. \"God! Punisher!\"</p><br/><p>Bang!</p><br/><p>A terrifying attack erupted.</p><br/><p>A sneer appeared on Si Fan's face. \"Ridiculous.\" This ability again? Indeed, this Chen Feng fellow had exhausted everything he had. This God Punisher of Chen Feng's had already gone through numerous studies. Even though it was powerful, its might would only increase after the number of abilities released increased. From what she remembered, the might would only increase by 1% after each released ability? This signified that even if the sequence was changed and the strongest ability was released first, it wouldn't be too powerful.</p><br/><p>When Chen Feng had done this previously, it had been against a weak opponent. That was the only reason the ability had been able to defeat the opponent even without going through the amplification. Now that he was facing the attack of a beyond A9, what was the point? She was sure that this attack of Chen Feng's would most certainly be crushed after colliding with their attacks.</p><br/><p>Shua!</p><br/><p>White radiance bloomed from Chen Feng's hand. The radiance of God Punisher erupted and collided with their attacks.</p><br/><p>Bang!</p><br/><p>The radiance around the point of collision intensified.</p><br/><p>\"Come!\"</p><br/><p>Chen Feng's gaze was resolute. Did these people believe that this God Punisher was still the same as the God Punisher from back then? As his strength had increased, as he'd entered beyond A1, the release speed of God Punisher had increased by more than tenfold. The speed of ability condensation had increased by at least tenfold as well. The previous God Punisher had required one minute to reach the final ability and erupt with the strongest attack, but now, only five seconds were needed. Naturally, Master Mu's attack would arrive instantly, not giving Chen Feng even five seconds of time.</p><br/><p>Shua!</p><br/><p>Chen Feng waved his right hand downward slowly.</p><br/><p>First second: Time Quicksand!</p><br/><p>Shua!</p><br/><p>Instantly, one second vanished. The God Punisher that had just started releasing was abruptly amplified by an uncountable number of times. This was God Punisher where the first second of amplifications had been entirely skipped by Chen Feng with his Time Quicksand. However, this was still far from enough to deal with Master Mu. After manually releasing Time Quicksand, without hesitation, he altered the sequence of God Punisher's ability release and released the Time Quicksand contained within God Punisher immediately after the manual release.[3] 3</p><br/>\n</div>"}