{"title": "Chapter 589: For the Bigger Picture", "id": 589, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-589-for-the-bigger-picture", "volume_title": "Volume 6", "body": "<h1>Chapter 589: For the Bigger Picture</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 589: For the Bigger Picture</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At the Genetic Union.</p><br/><p>All the staffers there were keeping silent in fear, their gazes landing occasionally on the meeting room upstairs. Occasionally, sounds of dispute and intense energy undulations would spread out of that room, causing their hearts to feel petrified. How many times had this happened already? They couldn't even answer that. The moment the news of Chen Feng's death had been received, those people had begun arguing without stop, and they'd been extremely agitated each time. As for nobodies like these staffers, they did not even dare to breathe too loudly in fear of the anger spreading toward them.</p><br/><p>\"Xiao Li.\"</p><br/><p>\"Ah?\"</p><br/><p>\"Send some refreshments inside.\"</p><br/><p>\"Ah?\"</p><br/><p>The lady called Xiao Li was so scared that her legs weakened. Everyone within that room was a beyond A class, and at present, those experts were all furious.</p><br/><p>\"Forget it.\"</p><br/><p>The Logistics Department head shook his head. After giving it a thought, he decided to send the refreshments personally instead. However, just as he reached the door, he heard the intense argument and energy undulation from the room. He hesitated there before ultimately deciding against going in, putting the refreshments back where he had taken them.</p><br/><p>\"Since they are all beyond A classes, I suppose they won't feel any thirst, right?\"</p><br/><p>He was petrified because, just by being near the door, an intense killing intent could be felt from within the room. That's right. Rather than some energy undulation, what he felt was true killing intent. Good gracious. What were those people doing in that room exactly? If they were merely quarreling or discussing, it was fine. Why would killing intent appear? He had no idea, and he did not wish to know the answer either.</p><br/><p>\"Remember. Do not approach that place,\" he reminded everyone. Everyone in the Logistics Department nodded their head frantically. At present, a fight had almost broken out within the meeting room.</p><br/><p>\"Let me repeat myself. Chen Feng's authority ought to be passed on to us,\" a person stated coldly.</p><br/><p>The deputy president rejected this notion firmly. \"That is not possible.\"</p><br/><p>That person sneered. \"We of the Qian family have offered our entire life to the Genetic Union. This time, our Qian Chen was the one who accompanied Chen Feng on this trip and was his secret guardian. Who could have guessed that Qian Chen would end up killed by Chen Feng instead?\"</p><br/><p>\"How are you guys sure that he was killed by Chen Feng?\" the deputy president retorted.</p><br/><p>That person's eyes gleamed coldly. \"Within Qian Chen's body were traces of Chen Feng's energy. That energy… Don't tell me you can't recognize it yourself?\"</p><br/><p>Qian Chen's death had angered all the members of the Qian family. Naturally, what was more important was the huge inheritance left behind now that Chen Feng was dead. Did he have any children or heirs? Nope. Who should be the rightful owner of this inheritance, then? The authority of the Gene Production Association and Genetic Union… This was a shocking amount of authority.</p><br/><p>Therefore, after finding out about this, the Qian family had pushed the blame onto Chen Feng without any hesitation. In any case, everyone there was already dead. They were free to make up any stories they wished. More importantly, on the bodies of Qian Chen and Si Fan, traces of Chen Feng's energy had been found. This was perfect. Chen Feng had betrayed humanity and killed Qian Chen and Si Fan…</p><br/><p>With this, it was within reason that Chen Feng's inheritance should be passed on to them as a form of compensation. This was the reason their entire family had arrived here to force the Genetic Union to make a decision. If this was handled properly, their family might even become the strongest family.</p><br/><p>The deputy president rubbed his head. \"Damn it.\" The traces left at the training camp were too obvious. Even if he knew that those two hadn't been killed by Chen Feng, he couldn't prove it. Scene simulation? That would be useless. Thanks to Chen Feng having been there in person, no detection abilities worked. Chen Feng's aura was too unique. They had studied him and tried divining information about him countless times before, yet every single time, they had not been able to find anything. Abilities capable of truly monitoring or scouting Chen Feng seemed to not exist.</p><br/><p>Unfortunately, in their present circumstance, this disadvantaged them. Why had Chen Feng fought Qian Chen and Si Fan? What exactly had happened? With Chen Feng's death, this had become an unsolved mystery. Should they once again seek help from their president? The deputy president smiled bitterly at this thought. What had happened recently made him feel like he was in fact a puppet. No matter what, he wouldn't be able to make a decision and would have to keep asking the president for help.</p><br/><p>\"This time, we want an answer.\"</p><br/><p>A huge number of Qian Chen's and Si Fan's family members had arrived this time. All of them were beyond A classes. As top families capable of grasping two of the spots in this training camp, it signified their prowess as a family. As such, the two were able to join hands and pressure the Genetic Union this time. Naturally, the Genetic Union would normally not be bothered with these two families. What the Genetic Union truly feared were the huge network of alliance behind these two families.</p><br/><p>Although the Qian family was the one making a move this time, surprisingly, behind them was a huge alliance of families. If they couldn't handle this properly, a civil war would most certainly break out between humans. Had they forgotten what had happened to the ancient race when a civil war broke out? The only reason humans had even survived this long was due to the civil war within the ancient race, the strongest race of all.</p><br/><p>And now, would humans follow in the footsteps of the ancients? If this wasn't handled properly… The deputy president inhaled deeply as he thought about the consequences. What should he do? The Genetic Union was still capable of suppressing this forcefully. However, with the ancient race and devil race looming about, he did not wish for humans to suffer more casualties. Moreover, recently, the ancient race had seemingly been itching to make a move against them.</p><br/><p>The person from the Qian family righteously stated, \"For humanity, we do not wish to cause any trouble among fellow humans. However, regarding Chen Feng's betrayal and the death of our Qian family's heir, if there's no answer for this, how can we concentrate on battling the alien races? How would we dare to face those on our side with our backs? Hence, we respectfully request that Chen Feng is convicted of this crime to give justice to Qian Chen and Si Fan.\"</p><br/><p>This was the request of the Qian family. Truthfully, convicting Chen Feng of this crime and everything else was all blabbering nonsense. If Chen Feng was truly convicted, wouldn't the authority he'd once held be declared illegitimate? Who would assume ownership over the authority?</p><br/><p>\"My pitiful child…\"</p><br/><p>Even black-and-white pictures of Qian Chen and Si Fan had been brought to the Genetic Union.</p><br/><p>The deputy president: \"…\"</p><br/><p>He had truly underestimated how shameless these people could be. What should he do now? He blanked. Qian Chen's and Si Fan's families were extremely powerful. If the Genetic Union truly wanted to suppress them, the human race would most probably suffer as a result. Evidently, the two families were also aware of this. As such, they had taken this opportunity to threaten the Genetic Union. Distantly, countless people were attentively listening in. The scouts from numerous families were all awaiting news here.</p><br/><p>The deputy president forced a smile. \"The world will be plunged into chaos…\" If this was peacetime, who would dare threaten the Genetic Union this way?</p><br/><p>\"Please wait a moment.\" He tried to contact the president. Unfortunately, no connection was established.</p><br/><p>Due to the constant appearances of experts, including even an S class among the devils, the president was presently working hard to break through into S class and had severed all connections with the outside world. As for matters pertaining to the Genetic Union, the president had only left one word behind prior to his seclusion: \"stability.\"</p><br/><p>No matter what, maintaining stability was the priority. Before the devils and ancients invaded, nothing could be allowed to go wrong among humans.</p><br/><p>The deputy president sighed. \"Seems like I have no other option.\" He gazed at the spokesperson of the two families. Behind them, the shadows of numerous families could be vaguely seen. The deputy president took in a deep breath. \"Since this is the case, I hereby declare that…\" The deputy president seemed somewhat lonesome as he uttered these words. The two spokesmen in front already had their heads raised high. They had finally won this argument that had lasted for ten-odd days. This was something nobody would have even dared think of doing previously. Indeed, fortune favored the brave.</p><br/><p>Alas, right as the deputy president was about to make his declaration, a terrifying ray of light descended from the sky, smashing open a huge hole right in the Genetic Union.</p><br/><p>Their expressions changed greatly. \"Who is it?\"</p><br/>\n</div>"}