{"title": "Chapter 580: Appear!", "id": 580, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-580-appear", "volume_title": "Volume 6", "body": "<h1>Chapter 580: Appear!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 580: Appear!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Bang!</p><br/><p>Along with the death of the S-class beast, the entire world started trembling. The S-class blood essence extracted by Chen Feng had seemingly exhausted all the energy supporting the existence of this world.</p><br/><p>Ka! Ka!</p><br/><p>Countless cracks appeared below their feet. The initially intact space started cracking, akin to a shattered mirror. Numerous bizarre seals appeared before shattering with a loud crack.</p><br/><p>Bang!</p><br/><p>The entire world collapsed. The world before them vanished instantly, plunging them into boundless darkness.</p><br/><p>\"Spirit,\" Chen Feng urged inwardly.</p><br/><p>\"All right.\" Spirit prepared to activate Luck Aura.</p><br/><p>Chen Feng looked at Kong Bai. \"Kong Bai, prepare yourself.\"</p><br/><p>Kong Bai nodded. \"Understood.\"</p><br/><p>The moment an irreversible crisis befell them, Chen Feng and Kong Bai would have no choice but to forcibly transmigrate. As for their ultimate destination or whether they could even survive, those were unknown. However, as they both were preparing for the worst-case scenario, a sliver of light appeared amid the dark world. Shortly afterward, the entire world became brightly lit once again.</p><br/><p>Hum—</p><br/><p>Light shone brightly. The entire world was once again firm, and before them was still the lush and green forest. Around them was still the familiar air, yet Chen Feng could keenly feel that this was no longer the same world as before. The unfamiliarity of the space here… This signified that the world earlier had already been destroyed and that this world was brand new.</p><br/><p>However, as they looked around, before Chen Feng could even awaken from his stupor, he heard numerous high-pitched yells, mixed sounds, and tremendous cheers.</p><br/><p>\"Chen Feng! Chen Feng!\"</p><br/><p>\"Kong Bai! Kong Bai!\"</p><br/><p>\"They are out! Hahahaha, this is too awesome. It has been a long time since I saw someone pass this level.\"</p><br/><p>\"Chen Feng, I love you!\"</p><br/><p>…</p><br/><p>Numerous thundering yells resounded.</p><br/><p>Finally, the uncomfortable feeling brought about by teleportation vanished. Chen Feng focused his gaze and finally saw that beyond the forest, there were countless people. These people resembled humans yet at the same time did not seem human. They had two horns on each side of their forehead. Apart from this, they were completely the same as regular humans. There were males and females, and there were young ones and old ones, all of them cheering frantically.</p><br/><p>The passion with which they were yelling was not unlike a hardcore fan of a superstar.</p><br/><p>Hold on… they seem to be shouting my name?</p><br/><p>Chen Feng's brain operated rapidly.</p><br/><p>Shua!</p><br/><p>He swept his gaze around. Instantly, the real surroundings were revealed to him. With shock, Chen Feng found that the world they had been in was actually a world that had been reduced in size by ten times. A radius of 10 kilometers? Not quite right. That was because this arena they were in had a circumference of one kilometer. After magnifying this one kilometer ten times, the radius of 10 kilometers had been created for Chen Feng and Kong Bai. For those incapable of viewing things beyond these 10 kilometers, this would be akin to a boundless world. The world they had been in was in fact this arena, an arena with a circumference of one kilometer.</p><br/><p>\"Chen Feng! Chen Feng!\" Around him, countless people yelled his name. He felt as if he was performing in some sort of concert.</p><br/><p>Shua! Shua!</p><br/><p>A huge screen appeared midair. The remarkable battles of Chen Feng and Kong Bai were enlarged. The numerous times they had turned defeat into victory brought endless excitement to the spectators. Numerous people cheered. Chen Feng and Kong Bai exchanged glances, both feeling their hearts chilling. These scenes…</p><br/><p>In other words, everything they had experienced, those experiences of life and death, all of that had merely been entertainment for the people of this world?</p><br/><p>\"Hello, o great warrior.\" A middle-aged man walked toward them. The horn on his head glowed with red. \"I am truly too excited.\" He regarded Chen Feng as he said, \"It has been a very long time since someone survived the Arena of Life and Death.\"</p><br/><p>Chen Feng narrowed his eyes. \"Arena of Life and Death?\"</p><br/><p>\"That's right. This great place is named the Arena of Life and Death,\" the middle-aged man explained in excitement. \"I am the host of this place. My name is Ruo Shui. I know that both of you are presently filled with doubt. However, it does not matter. I will provide an explanation. I believe that all the spectators here are also looking forward to what you two have to say,\" Ruo Shui stated.</p><br/><p>Chen Feng looked around. Indeed, expectant expressions could be seen on the faces of everyone present.</p><br/><p>Chen Feng asked the question he was most curious about. \"What is this place?\"</p><br/><p>\"Haha.\" Smiling, Ruo Shui answered, \"I knew that you, great warrior, would ask this question. You must be curious about the reason you that appeared here in this world. In fact, this is the blessing granted by the great God. The Arena of Life and Death is the program with the highest ratings and viewers here in our world. Every single season, we select several life-forms from alien worlds to participate. They enter the Arena of Life and Death, and they have to survive the numerous dangers of the forest and the attacks of the ferocious beasts. Ultimately, they will also have to defeat the strongest beast. You both were selected for this season.\" With a smile, Ruo Shui continued, \"You do not need to be anxious or angry. I was once interrupted when my explanation reached this point. As such, please allow me to finish my explanation. We have no malice toward you great warriors. When selecting warriors from alien worlds, we select from the terrifying spatial current, the current with a mortality rate of 99.99%.\"</p><br/><p>\"Under normal circumstances, entering the spatial current is akin to a sure death. Our great God used His divine power to rescue those people from the spatial current, giving them a chance at a new life. However, there is a limit to the number of beings we can sustain here. As such, we can't take in everyone, and thus, this Arena of Life and Death came into being. Only the most powerful and outstanding of warriors that have survived the Arena of Life and Death are qualified to stay here. Welcome to our world,\" Ruo Shui said proudly.</p><br/><p>As an original inhabitant of this world, he indeed deserved the pride he felt. Spatial current… Chen Feng and Kong Bai exchanged glances. They had never expected that this had actually happened to their transmigration? In short, when Kong Bai had been randomly transmigrating them, he had accidentally stumbled upon the summoning of this world? Chen Feng did not believe this.</p><br/><p>\"This must be due to luck value,\" Spirit stated after giving it some thought. There was no helping it, as at that time, the circumstances had truly been too dangerous, and Chen Feng's luck value had been pitifully low. Perhaps this had been the only method of survival his luck value had been able to find for him.</p><br/><p>Therefore…</p><br/><p>Chen Feng rubbed his head. He finally understood what had happened. Who could have guessed that he would star in an alien world's reality show? Mhm, seemed like he was also now a superstar due to him surviving the show?</p><br/><p>Chen Feng smiled forcefully. \"So, we are considered superstars now?\"</p><br/><p>Kong Bai shrugged indifferently. \"I guess so.\"</p><br/><p>\"It seems like our selected warriors this time are indeed intelligent, to be able to absorb everything in such a short time,\" Ruo Shui exclaimed in admiration. He was rather amazed at the receptivity of both Chen Feng and Kong Bai. One ought to know that during his time as the host of this show, he had witnessed way too many weird people. Some had collapsed because they couldn't accept the truth, and others had decided to attack him after figuring everything out. There had even been some who had started crying for their parents after the collapse of the arena.</p><br/><p>The weirdest contestant he had seen was a person who, upon arriving in the arena, started shouting, \"I have actually transmigrated! There must be a system somewhere!\" Next, that person had shouted, \"System, show yourself! Grandpa, descend! This is not an unlimited space. Main deity, get your ass out here!\" That person had continued spouting all sorts of nonsense from his mouth. He had attracted quite a bit of attention back then, causing people to discuss what, exactly, the system that person had spoken of was. Naturally, that person had ultimately been killed by the beasts in the area. The system, the grandpa, the main deity, everything he had spoken of had ultimately ended up as a puzzle of the arena. The people guessed that those might have been the powerful trump cards of that person. Alas, after descending upon an alien world, that person's abilities had been ineffective. People like this were numerous. As for Chen Feng and Kong Bai, these two were in fact the calmest of the contestants he had ever seen.</p><br/>\n</div>"}