{"title": "Chapter 583: Charge, Charge, Charge!", "id": 583, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-583-charge-charge-charge", "volume_title": "Volume 6", "body": "<h1>Chapter 583: Charge, Charge, Charge!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 583: Charge, Charge, Charge!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Ten million! By himself, Chen Feng had taken out a loan of ten million credits!</p><br/><p>\"Has this guy gone crazy?\" Ruo Shui did not dare to believe this. How much was ten million credits? It was sufficient to buy even a small town. How many treasured herbs had this fellow bought to be in so much debt? One ought to know that surviving each event would grant one only several thousand credits. The amount Chen Feng owed, plus the interest... Was this guy planning to spend his entire life paying this debt?</p><br/><p>Ruo Shui was alarmed. The entire company was shocked. Even if Chen Feng would be more powerful in the next event the more he improved himself and the ultimate profit he brought would belong to their company, thus putting them in a position where they would not suffer any losses, this was still too risky an investment. This sum…</p><br/><p>\"What to do?\"</p><br/><p>Just as they were all discussing this...</p><br/><p>Shua!</p><br/><p>Suddenly, the seven figures indicated on their screen started flickering rapidly before settling on eight figures.</p><br/><p>???</p><br/><p>Ruo Shui was dumbfounded. Everyone in the company was dumbfounded. Eight… eight figures? They were all stupefied. Was the difference between seven figures and eight figures only a single zero? No, that was an investment of ten times the amount, an amount one shouldn't even hope to finish spending.</p><br/><p>Ruo Shui almost lost his voice. \"Fast, lock his account.\" What exactly was that fellow planning? They all gnashed their teeth. They suspected that this guy was planning to plunder their riches before escaping or something like that. However, through their observation, they noted that Chen Feng was indeed immersed in painstaking training. The resources hadn't been sent elsewhere. They had all been sent to Chen Feng and used by him. No traces of any item transfers could be found.</p><br/><p>\"What now?\"</p><br/><p>\"There's really someone capable of swallowing this many materials?\"</p><br/><p>\"No idea. Theoretically, the amount of energy each person can absorb within a certain time frame is limited. After all, if one's energy is increased excessively, it might become unstable, leading to an accident. Yet this Chen Feng…\"</p><br/><p>They exchanged glances.</p><br/><p>\"Do you all still remember Chen Feng's strength back then?\" someone asked suddenly.</p><br/><p>\"You are saying…\"</p><br/><p>\"That's right. When he first arrived, he was even weaker. However, he progressed rapidly during the event, and finally, when he exited the event world, his strength was more than ten times stronger than when he had first arrived.\"</p><br/><p>Their hearts thumped. Wasn't this the truth? If so, after Chen Feng absorbed so many resources…</p><br/><p>\"Seems like our company is going to create yet another legend.\"</p><br/><p>All their hearts thumped.</p><br/><p>An investment of ten million credits was the largest investment their company had ever made. Although this had happened accidentally, if they were able to make use of this properly… this would also be their chance to earn their biggest profit yet.</p><br/><p>\"How about Chen Feng's credits?\"</p><br/><p>\"Freeze his account.\" </p><br/><p>The rest of them glared at the one who had asked the question. What in the world, was eight figures not high enough? Although they sounded rather confident, in fact, the only reason they had allowed this to happen was because Chen Feng had acted too fast; they hadn't been able to stop him. Now, they would not allow Chen Feng to continue squandering their resources like that. Resources worth ten million should be sufficient for Chen Feng to enter a new realm.</p><br/><p>This was how all of them thought. Alas, they never could have guessed that all the resources had not been used by Chen Feng to increase his strength. Instead, he had wasted all the resources. One experiment, two experiments, three experiments, never-ending experiments.</p><br/><p>The difficulty of researching S class and breaking through into S class had far surpassed Chen Feng's imagination. The fact that his research was focused on pushing one who had yet to enter S class into S class caused his research to become even harder.</p><br/><p>Ten experiments, a hundred experiments, a thousand experiments…</p><br/><p>Chen Feng became crazy. It reached a point where he was already numb to failure. This continued until one moment when a crisp sound echoed. This familiar yet moving sound reached him, yet he did not even notice it. Just as he was about to subconsciously discard this experiment and start a new one, he blanked. That sound…</p><br/><p>Slowly, his gaze swept past the gene reagent before him, and his expression froze. This… Suddenly, an overjoyed expression appeared on his face. Succeeded! He had finally succeeded!</p><br/><p>Hum—</p><br/><p>A faint radiance swirled around. The gene reagent before him seemed to contain endless power.</p><br/><p>\"I have truly succeeded…\" Chen Feng muttered. It had been a very long time since he had last experienced such a feeling. Prior to this, with his cheat-like Luck Aura, he had been able to easily crush all other producers in terms of gene production until he had finally been able to gain ownership over the entire Gene Production Association.</p><br/><p>And now, without Luck Aura assisting him, he had been able to once again experience what \"excitement\" truly meant. Six days! Over ten million credits! Finally, in the final moments before his next event, he had succeeded!</p><br/><p>----</p><br/><p>XX Fusion Gene Reagent</p><br/><p>Class: S</p><br/><p>Function: Unknown.</p><br/><p>Effect: Unknown.</p><br/><p>----</p><br/><p>This was his latest research result. Without luck value doing the estimations for him, without the database of the genetic world to be referred, even Chen Feng himself was not aware of what he had just created. However, at the very least, he could confirm that this was indeed a fusion gene reagent.</p><br/><p>Tick! Tock!</p><br/><p>Time passed without stop. Chen Feng inhaled deeply and braced himself. Did he have any other option?</p><br/><p>Gulp!</p><br/><p>Without hesitation, he swallowed the gene reagent.</p><br/><p>Bang!</p><br/><p>Instantly, terrifying energy erupted within his body.</p><br/><p>Bang! Bang!</p><br/><p>That tiny bottle of liquid transformed into frightening energy. It was boundless, akin to a tsunami raging thorough Chen Feng's body, shining with a wanton splendor.</p><br/><p>Pu!</p><br/><p>Chen Feng coughed up a mouthful of blood.</p><br/><p>Bang! Bang!</p><br/><p>Booming explosions reverberated all throughout his body, as if a blacksmith was using a hammer to temper his body unceasingly, pounding upon his heart without stop.</p><br/><p>Pu! Pu!</p><br/><p>His blood veins all ruptured, his blood splattering everywhere.</p><br/><p>\"Ah, ah, ah—\"</p><br/><p>Chen Feng used the energy to forcefully bind his splattering blood.</p><br/><p>Right now, his entire body was translucent, like a body sculpted from diamond. Every single one of his blood veins had ruptured, but they were being forcefully kept together with energy. He was in a rather dreadful condition.</p><br/><p>Damn it.</p><br/><p>His heart chilled. He had still underestimated how terrifying the process of breaking through into S class was. After all, A class was the limit of humanity, a bottleneck nobody had surpassed before. He had initially believed that no human had ever reached that realm due to a lack of S-class genes. Alas, it seemed like the human body itself was incapable of supporting such power.</p><br/><p>S class was simply too terrifyingly powerful. Even a tiny drop of S-class energy would be sufficient to blow up Chen Feng's body. He felt like his present body was like a huge inflated balloon that was on the verge of exploding. The S-class energy within his body expanded without stop, almost unable to be suppressed.</p><br/><p>Bang! Bang!</p><br/><p>He could feel some of the veins within his body popping apart.</p><br/><p>\"Damn it.\"</p><br/><p>He smiled bitterly. At this moment, he was incomparably thankful that he had fused with the giant elephant gene. Although this gene had not granted him a rather huge improvement in combat power, at the very least, his body quality had been improved to A class. Otherwise, the instant he had swallowed the S-class fusion gene reagent, his body would have exploded.</p><br/><p>Even so… how long could he last?</p><br/><p>Shua! Shua!</p><br/><p>His body was processing the energy without stop. Unfortunately, the S-class energy was too terrifying, far surpassing the level Chen Feng could absorb. As such, Chen Feng's body seemed to be heading in a rather bleak direction…</p><br/>\n</div>"}