{"title": "Chapter 601: Inside Information on the President", "id": 601, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-601-inside-information-on-the-president", "volume_title": "Volume 7", "body": "<h1>Chapter 601: Inside Information on the President</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 601: Inside Information on the President</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"???\" Ba Gu was dumbstruck.</p><br/><p>Friction between humans and ancients…</p><br/><p>Lube…</p><br/><p>It sounded normal, but as he thought about it, he kept feeling that this did not sound right. What damnable analogy was this?</p><br/><p>Ba Gu was furious. \"I am the Foreign…\"</p><br/><p>Chen Feng patted his shoulder and gave him a profound look. \"I know.\"</p><br/><p>Ba Gu raged. What the hell is this profound look for? When he finally tried to say something, he noticed that Chen Feng had already left. He could only hold his anger in. Looking at the glances the young lady of the ancient race was sending him, he had no choice but to personally go and placate them. Afterward, he recalled that look on Chen Feng's face…</p><br/><p>Screw you! I am only going over to placate them! Placate! Ba Gu cried a tearless cry. Why had the fine Foreign Affairs Department changed flavors after arriving here?</p><br/><p>\"Is this the place?\" the president asked as he stared ahead. There, a forest could be seen. Based on the information they had obtained, the S-class devil and a majority of the devils were hiding here.</p><br/><p>An ancient general stood out. \"Yes.\" Her name was Tianyu Liming, and she was the strongest expert of the ancients here. Although this person with a unique identity, this war god of the ancients, had once been male, since he had been gay, he had unperturbed been his transformation into a woman. As her attraction to males was now as it should be, the change in gender was a good thing for her.</p><br/><p>This time, the reason she had offered to join this mission was because a short while ago, during one of their battles, she had fallen in love with the strongest expert of the humans: Liu Dongjiang, the current president of the Genetic Union. As the strongest expert among the military officers of the ancients, she would only like the strongest expert among the humans.</p><br/><p>\"The devils will not let us do as we wish. It's better if we are extra prudent,\" Tianyu Liming said. Next, she paused, seemingly trying to say something. \"They have already been warned by me. They will no longer confess their love toward you.\"</p><br/><p>President: \"…\" So for you folks, this is a method of confessing love?</p><br/><p>The people around them all moved further away to give them some space—largely because of the excessively powerful aura these two exuded. It was so powerful that an ordinary person could not endure this pressure around them. Even if they were all similarly peak beyond A classes, there was still a difference in their combat power. It was obvious that the president and this general were the outstanding ones among everyone here.</p><br/><p>\"The rest take a rest. Tian Dao, San Jian, the two of you go and scout this forest,\" the president commanded.</p><br/><p>\"Yes.\"</p><br/><p>The rest stayed behind. The president did not realize that the general beside him was gazing at him tenderly.</p><br/><p>\"Interesting.\"</p><br/><p>Chen Feng observed this from a distance in an engrossed manner. It was said that this general was the strongest among the ancients. If she unleashed her full power, even Qin Hai would not dare to face her directly. If she and the president…</p><br/><p>Mhm, it will most certainly be interesting.</p><br/><p>Chen Feng felt gratified. The Land of Legacy of the ancients had always been a place the humans were worried about. The warriors with odd diamonds on their heads there were the strongest among the ancients. Moreover, due to various reasons, they were probably not willing to coexist peacefully with the humans. This was the only thing Chen Feng was worried about. Fortunately, according to Qin Hai, they had not gotten themselves involved in this matter of the union between humans and ancients. All along, they had never appeared.</p><br/><p>What did those people think of this? Chen Feng was clueless. However, if they could completely conquer the ancient race before those people in the Land of Legacy got involved, assimilating the ancients completely, it would be too late even if the Land of Legacy decided to get involved.</p><br/><p>\"Wu.\"</p><br/><p>Chen Feng's mind worked rapidly as his gaze swept over the president and the general without stop. By the side, Ba Gu gave Chen Feng a glance. At that look, all his hairs stood on end. Holy shit, Chen Feng wasn't thinking of scheming against even the president, right?</p><br/><p>Ba Gu laughed dryly and denied that thought. No, that's impossible! How could that be possible? This was the president, the strongest expert of humanity, the apex human who was halfway into S class. Alas, before this thought even settled, Chen Feng could be seen walking silently toward the president. With a gloomy tone, he stated to the ancients in a low voice, \"Are you interested in buying it?\"</p><br/><p>\"???\"</p><br/><p>Ba Gu widened his eyes. Holy shit, this guy…</p><br/><p>\"Are you interested in purchasing all information on our president?\" whispered Chen Feng. \"Due to the status of our president, all sorts of information regarding him has been recorded within the Genetic Union. His various poses and postures, and the video recordings of what he did back then when he joined the selection for the president…\"</p><br/><p>Tianyu Liming's interest was piqued. \"You have all of them?\"</p><br/><p>\"Of course.\" Chen Feng gazed at the long-legged beauty before him and said in a low voice, \"All the information has been saved on this virtual CD. Inside, I have also included a romance guide, which contains many of our president's preferences.\"</p><br/><p>\"How much are you selling it for?\" Tianyu Liming asked in a low voice. The manner in which these two talked was akin to two members of some underground society.</p><br/><p>\"I'm giving it to you for free. But please take care of me during this trip,\" Chen Feng said in a low voice. \"Even though I am also a peak beyond A class, I am essentially a producer with lower combat power. I do not wish to die here.\"</p><br/><p>\"Understood.\" Tianyu Liming understood what Chen Feng wanted.</p><br/><p>Shua!</p><br/><p>Chen Feng transmitted the data to her, and the trade was complete.</p><br/><p>Ba Gu: \"…\"</p><br/><p>With his very own eyes, he watched as Chen Feng pimped their president out.</p><br/><p>Ba Gu gulped. \"This… is somewhat excessive?\"</p><br/><p>\"How is this excessive?\" Chen Feng glanced at him and solemnly said, \"You think our mission this time is an easy one? That is an S class we are targeting. Any carelessness will result in all of us perishing here. It is a good thing that the strongest expert of the ancients is in love with our president. With this, they will surely protect our president with all they have,\" Chen Feng said gravely.</p><br/><p>\"Is that so?\" Ba Gu felt ashamed as he heard Chen Feng's explanation. Chen Feng had actually thought that far ahead. So he was making use of the feelings of the ancient race to protect the president? Chen Feng was too thoughtful! Ba Gu felt that he was truly too young to have not thought of all this.</p><br/><p>\"No matter what you do, you must think more.\" Chen Feng patted Ba Gu's shoulder and pointed toward the distant ancient race. \"For example, it is time for you to attend to them now.\"</p><br/><p>Ba Gu's face darkened. \"I am placating them, not attending!\" Could Chen Feng not use such a choice of words that could easily cause misunderstandings?</p><br/><p>At this time, the distant Tianyu Liming finished reading the \"Autobiography of the President,\" \"Encyclopedia of the President's Favorite Food and Drinks,\" \"The Lost First Love of the President,\" and so on. Next, she started her grand undertaking of pursuing the president. She did as the books told her, maintaining a certain distance between her and the president in order to leave a good impression on him.</p><br/><p>Indeed, the president appeared rather satisfied with the distance that the general maintained with him.</p><br/><p>Just look, this particular ancient was completely different than those other flirtatious sluts. Those people would even plaster their bodies upon his own if they could. This fellow was the only one maintaining a certain distance from him. Splendid. The president was satisfied.</p><br/><p>Tianyu Liming was inwardly overjoyed. \"It indeed works.\" That person called Chen Feng had indeed not been scamming her. The president truly preferred those graceful, reserved, and cold ladies. Right at this moment, Tian Dao and San Jian returned from their scouting mission.</p><br/><p>\"Everything seems normal,\" San Jian stated after pondering for a moment. \"We didn't note anything abnormal, but then again, the yin aura is rather dense in the forest. Perhaps, some devils with the yin property are residing within.\"</p><br/><p>\"They are indeed within the forest,\" Tian Dao stated in a deep voice. He specialized in detecting life force. \"The eyes of the devils could be sensed at all times, both from underground and from the sky. They could be anywhere in the forest.\"</p><br/><p>The president nodded. \"Well done. Let's set off, then. This time, we shall leave them no way out.\"</p><br/>\n</div>"}