{"title": "Chapter 604: No Choice but to Battle", "id": 604, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-604-no-choice-but-to-battle", "volume_title": "Volume 7", "body": "<h1>Chapter 604: No Choice but to Battle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 604: No Choice but to Battle</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"You guys were actually capable of solving the maze,\" came the hoarse voice of the old devil, seemingly rather surprised. Beside him, several dozen powerful devils were prostrated on the ground, expressing their loyalty to this old devil. The old devil snorted, ignoring the devils around him. \"Hpmh.\"</p><br/><p>\"Kill!\" Tianyu Liming commanded coldly.</p><br/><p>Swoosh!</p><br/><p>Instantly, the joint squad of humans and ancients made their move. The tricks and maze of the devils had indeed done some damage to them and had even killed two of them. However, that was it. The comprehensive strength of this declined devil race was much weaker than the humans and ancients.</p><br/><p>Bang!</p><br/><p>The several dozen devils moved. Alas, they were all cannon fodder. Their apparently powerful bodies were akin to paper. The president, who was still furious over the two deaths, vented his anger on these devils.</p><br/><p>Pu!</p><br/><p>Blood splattered around. The president alone slaughtered no less than 10 devils. These devils would have difficulty facing even one of the ancients or humans. Now that both the humans and ancients had joined hands, the devils had no way of even fighting back.</p><br/><p>Instantly, all the devils were killed, leaving only the old devil behind. He was still seated there gloomily, watching on as his underlings died for him. Despite the deaths, he remained unmoved, watching on coldly.</p><br/><p>The president sneered. \"Still not willing to let that person act?\" Naturally, the president was referring to that S-class devil.</p><br/><p>\"Something like an ambush will only work once,\" Tianyu Liming stated coldly. The deaths they had suffered earlier on had been due to a lack of preparations, as they had not expected the S class to ambush them. As long as they were prepared for it, an ambush was a joke.</p><br/><p>The old devil smiled sinisterly. \"Hehe. I have been waiting a long time for you guys.\"</p><br/><p>The president made his move without hesitation. \"Kill him!\"</p><br/><p>Bang!</p><br/><p>A surge of energy erupted. Alas, surprising them all, when his attack neared the old devil, it stopped. Around the old devil, circles of light-blue energy shone in a mechanical fashion, blocking the president's attack. At present, the numerous steles were flickering with a petrifying might.</p><br/><p>Tianyu Liming's eyes gleamed coldly. \"Is it due to those things?\"</p><br/><p>Bang! Bang!</p><br/><p>She started blasting those steles.</p><br/><p>Hum—</p><br/><p>Blue light flashed, but the steles remained fine.</p><br/><p>Tianyu Liming shook her head. \"Can't damage them. The attacks feel like they landed on cotton.\"</p><br/><p>\"Hehehehe.\" The old devil laughed wildly. \"Using the terms of you humans, that is an S-class barrier. It is impossible for attacks at your level to penetrate the barrier.\"</p><br/><p>S class…</p><br/><p>The president and Tianyu Liming exchanged a glance. In a regular battle, S-class power would indeed be of a higher level than them. However, S-class power used by an incomplete S-class devil wasn't particularly powerful. But these barriers…</p><br/><p>The president thought of something, and his expression changed. \"This power had been improved by you.\"</p><br/><p>The old devil laughed sinisterly. \"Indeed. Do you really think that I am not aware of what you guys were prepared to do? Since you guys have appeared here, I suppose you guys have already thought of a method to deal with S classes, right? Let me give it a guess: the urine of that ex-prince? You guys have solved the mystery of the urine, right? Hahahaha.\"</p><br/><p>Their expressions changed as they heard these words. This guy… was even aware of this?</p><br/><p>\"This can be found out with simple deduction, no?\" The old devil had a faint smile on his face. \"You guys must have believed that since I want to control the S-class devil, I will have to keep him in an incomplete state, right? After all, the moment the consciousness of the S class returns, he will most certainly not remain under my control, right? Hehe. That is indeed the case. But do you guys think that I will give him a chance to return? Do you guys think that if his consciousness is incapable of returning, I will not be able to utilize the true S-class power? No, how wrong that is… How idiotic are you guys?\"</p><br/><p>\"Howl—\"</p><br/><p>A loud howl resounded. Up in the air, a huge figure appeared. The S-class devil had returned. He appeared up in the sky with terrifying energy enveloping his body. Along with his appearance was the appearance of that S-class power they were all so very familiar with. Mhm, this should be an incomplete S-class power.</p><br/><p>\"Not too strong, no?\" The old devil smiled faintly. \"How about…\" The old devil waved his hand.</p><br/><p>Bang!</p><br/><p>All the steles around them started to shine. A gush of power bloomed from his body before surging up into the sky to fuse with the energy of that S-class devil. Ultimately, a brand-new power was formed. This new power was as strong as a complete S class.</p><br/><p>\"Not good.\"</p><br/><p>Their expressions sank. None of them had expected this old devil to be capable of recreating a true S-class power. It was no wonder that this old devil had not gotten this S-class devil to make any moves previously. This guy was no longer something like a puppet. Rather, this guy was now a fountain supplying power to this old devil.</p><br/><p>\"Haha.\" The old devil laughed wildly. \"This is my ability, improvement! I am able to improve all powers! Hahaha, thank you all for appearing here… Now, be my undying servants!\"</p><br/><p>Bang!</p><br/><p>The old devil waved his hand. A dreadful and deep darkness descended.</p><br/><p>\"First, I'll kill you all. Next, I'll refine you all into puppets. I shall become the master of this world. Hahahahaha!\"</p><br/><p>The old devil laughed wildly. Devils? Ancients? Humans? To hell with all of them!</p><br/><p>Hu—</p><br/><p>Hu—</p><br/><p>A devilish wind started blazing.</p><br/><p>\"Defend,\" Tianyu Liming howled. When that dreadful black wind swept past her face, her face ached terribly. The ancients erected their defenses immediately but were still having difficulties hanging on. Even with their strength, they couldn't endure this devilish wind.</p><br/><p>The president clenched his teeth tightly. \"S class…\"</p><br/><p>\"Are we not able to beat him?\" howled Tianyu Liming amid the devilish wind.</p><br/><p>\"We had originally expected to face an incomplete S class. Only around 10 peak beyond A classes would have been required for that feat. Coupled with the help of the sealing reagent produced with the young prince, perhaps even six of us would already have been sufficient.\" The president sighed. \"But now…\"</p><br/><p>He stared ahead. That S-class devil was staying away from them, and they had no way of approaching him. Thus, they had no way of sealing that S-class devil. And with that old devil's improvement ability, what they faced was a complete S-class power.</p><br/><p>The president made a swift judgment. \"Based on my calculations, we would require 20 peak beyond A classes to deal with this power.\"</p><br/><p>Twenty? The hearts of others chilled as they heard this. Originally, they had been a squad of twelve, even after including Ba Gu and Chen Feng. After the death of Tian Dao and San Jian, they only had 10 peak beyond A classes here.</p><br/><p>How were they supposed to fight this with only half the required strength?</p><br/><p>Hu—</p><br/><p>Hu—</p><br/><p>The ancients' defenses started tottering. This devilish wind was too powerful. They had no way of resisting. Was this the real power of an S class? The president had a bitter feeling. He had been cultivating hard his entire life yet ultimately failed to reach that level.</p><br/><p>Right at this instant, Tianyu Liming howled before standing before everyone.</p><br/><p>\"Twenty peak beyond A classes, huh?\" She laughed crazily.</p><br/><p>Bang!</p><br/><p>She stabbed her weapon into the ground. \"By myself, I am equivalent to twenty!\"</p><br/><p>Hum—</p><br/><p>A gold radiance bloomed. Tianyu Liming had entered her top combat form. Everyone's mind jolted.</p><br/><p>The president looked at her, and realization dawned upon him. \"Let me join in.\" True, he had been concentrating on cultivation for so long that he had become so rotten now. Once upon of time, he had also been a hot-blooded warrior!</p><br/><p>Bang!</p><br/><p>Energy bloomed all around the president's body as he stood beside Tianyu Liming.</p><br/><p>\"I… am equivalent to ten!\"</p><br/><p>Tianyu Liming exchanged a glance with him. The two laughed heartily. Since it had come to this, their only option was to fight it out!</p><br/>\n</div>"}