{"title": "Chapter 600: A Magnificent Existence", "id": 600, "volume": 6, "url": "http://boxnovel.org/the-strongest-gene-chapter-600-a-magnificent-existence", "volume_title": "Volume 6", "body": "<h1>Chapter 600: A Magnificent Existence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 600: A Magnificent Existence</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>In a certain area within the unknown regions that the humans, ancients, and devils had yet to start developing was a bright and clear lake. The surface of the lake looked like a flawless white jade. A light-yellow stone floated above the lake, flickering with a faint yellow light like rhythmic breathing.</p><br/><p>Howl—</p><br/><p>A mutated beast appeared. With greed, the beast gazed at that stone. It was about to dash over. Suddenly, a blue leopard appeared from behind it and pushed this beast to the ground before killing it. When the gaze of the leopard landed on the stone above the lake, vigilance flashed through its gaze. With utmost caution, it approached that stone. A glint flashed through its eyes as it appeared eager to give it a try. Just as it was about to rush out…</p><br/><p>Xiu!</p><br/><p>A meteor descended abruptly, smashing down to the ground nearby.</p><br/><p>Whoosh!</p><br/><p>The blue leopard had already been prepared for this and vanished in a flash. The ground it had stepped on previously had already been struck. The leopard only reappeared after a long time. All around, there were several tens of craters, all created by meteors. Every time it acted in a way that would threaten that stone, a calamity would befall it.</p><br/><p>It would either be attacked by some other beasts, or even plants, or a calamity would descend from the sky. As for that stone, it remained safe and sound even now. Around the stone was a huge pile of bones.</p><br/><p>Howl—</p><br/><p>The blue leopard howled threateningly before retreating slowly. Above the lake, that stone flickered as usual, as if nothing had happened at all.</p><br/><p>…</p><br/><p>Countless howls could be heard. Countless beasts wanted to enter, yet all died in mysterious ways. Right at this instant, a faint figure formed in the distance. An aged figure appeared. Step by step, he walked forth until he arrived.</p><br/><p>\"Indeed… Is it related to you?\"</p><br/><p>The old man raised his foot, trying to step into the lake.</p><br/><p>Bang!</p><br/><p>A meteor descended abruptly.</p><br/><p>The old man shook his head, raised his hand, and waved. That meteor descending with boundless might was exterminated the moment it neared the old man, unable to cause any sort of harm to that old man.</p><br/><p>The old man narrowed his eyes. \"Interesting.\"</p><br/><p>Shua!</p><br/><p>He stepped on the lake's surface. Light started swirling about. The space around him cracked, and next, a spatial tunnel appeared out of thin air for no apparent reason. A boundless pulling force appeared, trying to pull the old man in. The old man raised his hand and destroyed the spatial tunnel with brute force and took yet another step forward.</p><br/><p>Bang!</p><br/><p>From the planet's core, suddenly, lava erupted upward. Combined with the power of energy, every single burst of lava carried astonishing might. All of it charged in the direction of that old man. At this, the smile on that old man's face shrunk somewhat.</p><br/><p>Hum—</p><br/><p>After stopping the lava, he took another step forward.</p><br/><p>Bang! Bang!</p><br/><p>From below the lake, boundless power erupted.</p><br/><p>Lava…</p><br/><p>Water…</p><br/><p>Radiance…</p><br/><p>…</p><br/><p>All sorts of wondrous and mystical powers charged out one after another, all trying to stop the old man's progress. The energy barrier around the old man, which had been capable of blocking everything, was fading. Ultimately, the old man stopped his steps.</p><br/><p>He contemplated. \"It's intelligent?\"</p><br/><p>Shua!</p><br/><p>His figure flashed. Instantly, he appeared beside the stone and grabbed at it. Alas, right at this instant, he felt a stifling sense of crisis. His entire body felt like he had been thrown into an icy cave. This was a feeling he had never experienced in his whole life… the sense of death.</p><br/><p>He stopped his hand that was reaching toward the stone. There was no gushing energy around him and no fatal danger could be seen, yet his entire body still stopped, and he retreated one step at a time. By the time he had left the lake surface, his back was already drenched with sweat.</p><br/><p>\"This thing…\"</p><br/><p>An alarmed expression appeared on his face. This thing was much scarier than he had imagined, yet it just had to be in such a place. Gazing at that ordinary-looking stone that was still flickering with a faint yellow light as it floated above the lake, the old man gave it a deep gaze before ultimately deciding to leave. The lake recovered its previous tranquility.</p><br/><p>**</p><br/><p>In the devil race's territory.</p><br/><p>The devils under the command of the old devil were increasing in number without stop. With the help of that S-class devil, he defeated all opposition among the devils. Nearly every newly reawakened devil had fallen under his control, becoming his devoted underling.</p><br/><p>A flying devil in the sky passed on some information. \"The humans have arrived…\"</p><br/><p>\"I am aware of that.\" The old devil stood up. The humans had indeed not given up yet.</p><br/><p>Ever since the humans had received news regarding the S class, they had been akin to a cat that had smelled a fish. They had had their gaze fixed on the devils all this while, unwilling to look away. This was inevitable. The humans and the ancients might have the potential to coexist in peace, but how about the devils? It was impossible.</p><br/><p>First, a huge amount of devils were still in hibernation in the soil beneath the human lands. Second, the humans were a race that increased their strength through gene fusion, and the devils were included among the materials for the humans' fusion gene reagents. The genes of the devils could be used like all the other mutated beasts. As such, their relationship was more akin to predator and prey.</p><br/><p>The humans and devils were completely incompatible with each other. The old devil knew that a day would come when the humans came for them, yet he had never imagined that during the war between the humans and the devils, the ancients would actually join in as allies of the humans.</p><br/><p>The old devil's eyes gleamed coldly. \"Have they become much more idiotic after becoming female?\" </p><br/><p>Since the humans and the ancients had joined hands, he would just eliminate both races together. Normally, he would not have a chance to accomplish such feat. However, since he had already been expecting the arrival of the humans, he naturally had made his own preparations. This was the final chance for the declining devil race.</p><br/><p>He stood up.</p><br/><p>Hum—</p><br/><p>A faint radiance started condensing. In the distant village, numerous steles filled with seals stood tall. Around the steles lingered an odd mist. The devils took in a deep breath and an expression of utmost pleasure appeared on their faces. Vaguely, their strength was increasing. This was the precious land of the devils and also the land of death for the humans and ancients.</p><br/><p>\"The wind is blowing,\" the old devil muttered. Suddenly, a bizarre wind started howling. On the ground that had previously appeared desolate, numerous trees appeared. Instantly, this desolate plain transformed into a forest, a forest filled with a cold aura. The numerous steles had actually all transformed into trees. And with that, this bizarre place had transformed into an extremely ordinary-looking forest. Faintly, some terrifying things could be seen wandering about the ground and the sky, causing the scalps of any onlookers to feel numb.</p><br/><p>This was the domain of the devils.</p><br/><p>Howl—</p><br/><p>Numerous howls resounded. Countless crow-shaped devils flew out. The eyes of the old devil gleamed coldly, seemingly capable of seeing the myriad world, seeing every nook and corner within a thousand miles. Suddenly, a certain spot within the mist rolled. The old devil focused his gaze. The humans had arrived.</p><br/><p>\"I have been waiting a long time for you guys.\" The old devil grinned, revealing a row of yellow teeth with faint traces of blood on them. Presently, far away from the devils, the joint squad of the humans and ancients had appeared in the outer forest.</p><br/><p>\"This should be the place,\" a lady of the ancient race stated sweetly. She walked back and forth as her attractive, tiny waist swerved right and left. When she walked past the Genetic Union president, she even threw him a wink before slapping the president's butt. \"Quite perky.\"</p><br/><p>\"???\"</p><br/><p>The president was dumbstruck. His eyes widened—he had evidently yet to recover from his shock. He, the illustrious president of the Genetic Union, still commanded a healthy amount of respect even though he usually stayed in seclusion all year round, yet now… Was he too behind the times, or was it that these ancients were too brave?</p><br/><p>He abruptly extended his hand. \"You…\"</p><br/><p>\"Calm down, calm down.\" Ba Gu pulled at the president and whispered, \"These ancients are not used to human culture yet. In their understanding, this act of slapping one's butt is merely a simple act of flirting.\"</p><br/><p>Ka! Ka!</p><br/><p>The president clenched his fists tightly.</p><br/><p>\"Investigate this fellow for me.\" The president took in a deep breath. \"If she was originally female, I will forget about it, but if his original name is something like Gou Dan, Tie Zhu, Tuo Ni, or something similar, I will most certainly beat him to death.\"</p><br/><p>Ba Gu smiled bitterly. He looked at the fellow that had dared to mess with their president and found that the person was still busy throwing flirtatious glances over. Evidently, she had yet to discover the bizarre mood around her…</p><br/><p>What was this? Should he advise them? He dared not. Everyone here was a peak beyond A class—he was the only exception. That was because the ancients that had come were all the leaders of the ancient race rather than common citizens. As such, to avoid friction, Ba Gu was required to be here. And thus, this Foreign Affairs Department head had been brought along this mission.</p><br/><p>Chen Feng patted his shoulder. \"It has been hard on you.\"</p><br/><p>\"…\" Ba Gu felt extremely helpless. \"We are truly not the Diplomacy Department!\"</p><br/><p>\"I know,\" Chen Feng stated with a respectful expression. \"How can you guys be the Diplomacy Department? In this honeymoon period between the humans and ancients, it is of utmost importance to prevent any frictions. Your tasks are not as simple as diplomacy. Rather, you guys are as magnificent as lube.\"</p><br/>\n</div>"}