{"title": "Chapter 621: Wish-Granting Old Man and Demon King", "id": 621, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-621-wish-granting-old-man-and-demon-king", "volume_title": "Volume 7", "body": "<h1>Chapter 621: Wish-Granting Old Man and Demon King</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 621: Wish-Granting Old Man and Demon King</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"Missing?\" Chen Feng was alarmed. Those were two peak beyond A classes. How had they gone missing? \"Those two fellows…\" Chen Feng paused. \"Could it be that they eloped?\"</p><br/><p>The deputy president: \"…\"</p><br/><p>He smiled bitterly and looked at the news in his hand again before saying, \"Based on the report received from the ancients, they have indeed gone missing, and not only them—the ancients that went with them have all gone missing as well. The entire Land of Legacy is shrouded by a peculiar aura.\" With a solemn expression, the deputy president finished, \"Not a single person who has entered has returned. Something happened there.\"</p><br/><p>Land of Legacy…</p><br/><p>Chen Feng's eyes flashed. Indeed, something had happened there. He had no idea what had happened there, but he guessed that it was definitely related to Duma. Apart from Duma, nobody had the strength to make this happen.</p><br/><p>\"Looks like I have to pay the ancient race a visit,\" Chen Feng stated with a resolute gaze.</p><br/><p>…</p><br/><p>Outer space.</p><br/><p>Those battleships remained floating outside the atmosphere. Suddenly, one of the battleships exploded. A terrifying shockwave spread out as the ship turned into numerous light particles before dissipating. No sound, no undulation. Just like that, a battleship vanished, leaving no trace behind. On the other battleships' radars, nothing was detected. Those people were still busy having the time of their lives in their respective ships. The stars appeared even brighter now.</p><br/><p>\"Huh?\"</p><br/><p>On the planet, a boy who was making a wish gazed at the stars in the sky. He seemed to have seen a flash earlier. He rubbed his eyes to confirm it, yet it seemed like nothing had happened at all.</p><br/><p>\"Have I seen wrongly?\" the boy muttered. Next, he continued making his wish in an excited manner, \"I want a female sailor outfit, I want a sailor outfit…\"</p><br/><p>Hum—</p><br/><p>Suddenly, the space around him trembled. Next, a blue-and-white female sailor outfit appeared out of thin air and landed in the hands of the little boy.</p><br/><p>\"Hey?\"</p><br/><p>The boy who was making his wish was shocked. With an expression of disbelief, he rubbed the sailor outfit in his hands. Joy surfaced in his eyes. He caressed the outfit, feeling the smoothness of the material… This was actually a real sailor outfit!</p><br/><p>\"I succeeded?\"</p><br/><p>The little boy was agitated. So it turned out that making a wish really worked!</p><br/><p>\"I knew it! The stories mommy told me are not lies!\"</p><br/><p>The little boy returned with his outfit in excitement, cheering along the way.</p><br/><p>Where he had stood previously, where the outfit had appeared, a light particle flickered faintly before vanishing cleanly, as if it had never appeared. Half an hour later, a middle-aged woman arrived there with a little boy. In her hand was a chicken feather duster that was being waved around the air. With a gloomy expression, she looked at the boy. \"You are saying you got that outfit from here?\"</p><br/><p>\"Yes,\" the boy said meekly.</p><br/><p>\"Try again.\" The middle-aged woman sneered. \"Let me see if you can get other things just by wishing.\"</p><br/><p>\"I…\" The boy had a wronged expression. Carefully, he walked to where he stood earlier and shut his eyes. In a devout tone, he said, \"I… I want a copy of ' Winter Break Homework'…\"[1] 1</p><br/><p>Nothing happened.</p><br/><p>The little boy panicked, thinking that his motive for wishing for this had been seen through.</p><br/><p>The boy decided to compromise. \"How about a 'Summer Break Homework'?\"</p><br/><p>Yet… nothing happened. This time, the boy panicked for real.</p><br/><p>\"What about ' Three Years Simulation, Five Years Quiz'?\"[2 2 ] the little boy said in despair. And yet nothing appeared.</p><br/><p>\"Hehe.\"</p><br/><p>The middle-aged woman walked over coldly and grabbed the boy before beating him up.</p><br/><p>\"Why are you being naughty? To even resort to stealing! Every single day, you steal the clothes of the young lady next door to wear yourself! There are so many things you still have to learn, yet you had to learn from your dad to dress up as a woman!\"</p><br/><p>Pa! Pa! Pa!</p><br/><p>The butt of the little boy was flushed red from the beatings. However, the boy, who had rich experience of having his butt beaten, did not weep or lose his reason. Rather, he shouted loudly, \"I must have wished wrongly earlier. A wish will only be a wish when it's something I truly want.\"</p><br/><p>\"Oh?\" His mom sneered. \"Well, continue wishing then. Let me see what exactly is it that you want.\"</p><br/><p>…</p><br/><p>The boy had a feeling that he was going to be even more miserable later. The beating he had taken earlier had been for nothing, as he might get beaten one more time after this. What a loss! However, as he thought of his innocence… After all, he was still a real man despite his age. At most, he only dressed up in women's clothes. How could he resort to thieving?</p><br/><p>And thus, the young boy gathered his courage, walked to where he had stood earlier, and yelled, \"I want a miniskirt!\"</p><br/><p>Shua!</p><br/><p>A sky-blue loli miniskirt smashed down at him from the empty air above.</p><br/><p>\"It appeared! It appeared!\" the little boy said, agitated.</p><br/><p>\"!!!\" The middle-aged woman was alarmed. She had initially thought that this boy had merely been looking for an excuse after stealing the sailor outfit. Unexpectedly, he had been telling the truth!</p><br/><p>Shua!</p><br/><p>Faint light particles gathered around.</p><br/><p>\"Go!\" Suddenly, the middle-aged woman realized something. She might not be an educated person, but she knew one thing clearly: in this world, one would not receive something for free for no apparent reason. For a gift to drop down from the sky… one would ultimately need to pay a price for what one had received.</p><br/><p>\"Leave this place.\"</p><br/><p>She dragged the little boy and left hastily. As for the little boy who had managed to avoid another round of beatings, despite his longing for that miniskirt, he still followed meekly behind his mother and left. This area returned to its previous tranquility. On the roof of a building nearby, a youth was watching all this with an interested expression while his hand flickered with light constantly.</p><br/><p>He smiled. \"Looks like… I am rather powerful now?\"</p><br/><p>If anyone else was here, they would definitely realize that this youth was precisely the representative of carnage, the legendary young demon king Wu Hui!</p><br/><p>\"Looks like I have the potential to be a wish-granting old man.\"</p><br/><p>He laughed self mockingly. His unique ability was something that relied on the imagination of others. Granting wishes would be perfect.</p><br/><p>Shua!</p><br/><p>He waved his hand. The miniskirt transformed into a flash of light before vanishing.</p><br/><p>\"I have reached this level now?\"</p><br/><p>He was somewhat absent minded. True… Everyone was improving without stop. His master had also reached S class. He had once vowed to be both the right and left arms of his master. As such, he absolutely couldn't fall behind their progress.</p><br/><p>\"Work harder,\" the youth cheered to himself in the darkness. Light swirled around. Wu Hui walked to where the young boy had made his wish earlier. He cast his senses out and felt the unique power lingering here. The miniskirt was something he had created for that little boy. However… the female sailor outfit had indeed appeared out of thin air!</p><br/><p>Nobody and nothing had produced that outfit. Merely because of that little boy's wish, it had appeared out of thin air. Something had to be wrong here! Wu Hui had arrived chasing after that unique power. That was because this was not the first time something like this had happened. Previously, a certain person had wished for a certain video game. Indeed, the video game vendor had appeared. Ultimately, that person had smashed the video game vendor apart, as he'd had no money to buy any of the video games sold. Similar occurrences had happened several times already.</p><br/><p>\"These things…\"</p><br/><p>Wu Hui shut his eyes. Although that power had already vanished, when he had first arrived, there had still been some traces of it left in the air. He could clearly feel that a certain formidable power had appeared.</p><br/>\n</div>"}