{"title": "Chapter 627: Before the Remnant", "id": 627, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-627-before-the-remnant", "volume_title": "Volume 7", "body": "<h1>Chapter 627: Before the Remnant</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 627: Before the Remnant</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Shua!</p><br/><p>Light swirled around. The pink and white radiance bloomed, instantly attracting the attention of both Chen Feng and Qin Hai. Distantly, that pink and white hat gradually appeared, revealing the main body of Senior Mu.</p><br/><p>\"You were actually able to escape my ability?\" Senior Mu was astonished. He seemed to have heard some magnetic melody earlier. That thing… \"Curing ills with poison?\" Senior Mu understood clearly. \"However, if you guys believe that this is sufficient to withstand me, you guys are truly naive. Let me show you guys my supreme special ability…\"</p><br/><p>Shua!</p><br/><p>An intoxicating power appeared. Under normal circumstances, this level of power would be sufficient to cause Chen Feng and Qin Hai or anyone else at their level to fall asleep. But now…</p><br/><p>\"Special my ass.\" Qin Hai, who had yet to recover from his anger, erupted, slashing at Senior Mu. By the side, Chen Feng erupted as well. Earlier, he had still been thinking of a way to explain the matter pertaining to Xiao Rou. Now that this Senior Mu had interrupted them, he was overjoyed and directly followed after Qin Hai and erupted with a formidable power.</p><br/><p>Drowsiness? It no longer existed.</p><br/><p>Senior Mu, who was unleashing his ability, was dumbstruck. How was this possible? The both of them had obviously been affected by his ability earlier, so why were they completely fine now? Moreover, he had obviously activated an even stronger ability this time…</p><br/><p>Bang! Bang!</p><br/><p>A terrifying power erupted.</p><br/><p>Pu!</p><br/><p>A cold radiance flashed. Countless bloody scars appeared on Senior Mu's body.</p><br/><p>Bang! Bang!</p><br/><p>Pushing Senior Mu down to the ground, Qin Hai started beating him up. This Senior Mu was nearly unequaled when it came to mind control. Even Chen Feng had nearly fallen under his control. Correspondingly, Senior Mu's melee combat capability was… nonexistent.</p><br/><p>Thump! Thump!</p><br/><p>Qin Hai vented his anger, beating Senior Mu up in a certain corner.</p><br/><p>\"I am the grand White…\"</p><br/><p>\"White my ass.\" Qin Hai punched Senior Mu's nose, blood splashed around.</p><br/><p>\"I am the noble Mu…\"</p><br/><p>Thump!</p><br/><p>Qin Hai's punch landed on Senior Mu's face.</p><br/><p>\"You lowly…\"</p><br/><p>Thump!</p><br/><p>Finally, Qin Hai landed a kick on Senior Mu's belly, kicking the noble Master Mu into the shape of a bow. The pink energy on his body faded and ultimately disappeared.</p><br/><p>Plop!</p><br/><p>His body collapsed to the ground powerlessly.</p><br/><p>Shua!</p><br/><p>The pink and white energy around them instantly vanished.</p><br/><p>It's over!</p><br/><p>\"The pink energy has retreated…\"</p><br/><p>Chen Feng's eyes shone. At present, he was already able to see through some things. The pink energy here indeed had a consciousness and was seemingly capable of affecting the people here and controlling their minds.</p><br/><p>In short, this pink things is what's creating trouble here? guessed Chen Feng. However, he had a faint feeling that things were not that simple either.</p><br/><p>Chen Feng told Qin Hai what he had deduced. \"This should be the case.\"</p><br/><p>\"So…\" Qin Hai was silent for a short moment before he continued, \"What's up with Xiao Rou?\"</p><br/><p>\"??!\" Chen Feng's expression darkened. \"She's fine! I haven't eloped with her either. The Gene Production Association hasn't gone bankrupt either,\" Chen Feng stated grudgingly. This fellow was still immersed in the tannery song?</p><br/><p>\"But the lyrics…\" Qin Hai muttered as he subconsciously recalled the lyrics.</p><br/><p>\"Gene Production Association!\"</p><br/><p>\"Gene Production Association!\"</p><br/><p>\"Went bankrupt!\"</p><br/><p>\"Bastard boss Chen Feng incurred a debt of 350 million and eloped with Xu Fei! Out of choices, we had to use Xiao Rou to repay the debt…\"</p><br/><p>…</p><br/><p>\"???\" Chen Feng wiped his sweat. \"How many interpretations have you drawn from this song?\"</p><br/><p>Qin Hai: \"…\"</p><br/><p>This melody was truly too demonic.</p><br/><p>Qin Hai gave Chen Feng a deep glance. \"This song must never be spread.\"</p><br/><p>Chen Feng pondered and agreed. The hell, if this song was spread out, it would most probably go viral instantly. And next, everyone would be finished. Chen Feng and Xiao Rou would be finished…Xu Fei… oh, no, this guy would probably be the one to profit.</p><br/><p>\"I know.\"</p><br/><p>Chen Feng was all too clear how easy it would be for this song to go viral. This thing could absolutely not be spread to the outside world.</p><br/><p>\"Let's go.\"</p><br/><p>As the two rearranged their thoughts and finished their preparations, they continued forward.</p><br/><p>After passing through Senior Mu's residence, they passed through several other residences, but surprisingly, these places were devoid of people.</p><br/><p>\"None of my senior apprentice brothers are around…\" Qin Hai said with a solemn expression.</p><br/><p>Chen Feng was surprised. \"They have not fallen to the enemy's control?\"</p><br/><p>\"Either they left right before something happened here, or…\" Qin Hai shook his head as a terrifying idea sparked on his mind. \"They sensed that they are not our opponent and stopped coming out one after another to deliver themselves on a platter to us. Rather… they have now formed a group to deal with us.\"</p><br/><p>Chen Feng's heart chilled. True. If this pink energy had a consciousness of its own, something like forming a group… was quite possible.</p><br/><p>Indeed. In their remaining journey, not a single person was seen. Even when they neared the center, nobody else appeared. Only a boundless pink could be seen. Qin Hai and Chen Feng increased their vigilance. This situation…</p><br/><p>\"Still nobody?\" Qin Hai had a bad feeling.</p><br/><p>Chen Feng frowned. \"Wait.\" He gave it some thought and decided to send Xiao Ying out to scout ahead of them.</p><br/><p>Shua!</p><br/><p>The red flashed out. Xiao Ying transformed into nothingness and vanished. With the speed of light, Xiao Ying traversed the entire world of pink. Apart from the center, which he couldn't enter, all the other areas were explored. Not a single enemy was located.</p><br/><p>Chen Feng raised an eyebrow. \"Nobody?\"</p><br/><p>Swish!</p><br/><p>Xiao Ying replayed the scenes he had seen. The only thing he had found was those they had defeated earlier.</p><br/><p>Chen Feng was now sure. \"It seems like they are all hiding at the center.\"</p><br/><p>Qin Hai nodded with a solemn expression. \"That's possible.\"</p><br/><p>It would still have been fine if they had appeared one after another, but when they were all grouped together, things could be truly terrifying. The both of them continued forth. They braced themselves for a decisive battle, yet just as they reached their final destination, a silhouette of light flashed by suddenly.</p><br/><p>\"Careful!\"</p><br/><p>They were instantly on alert.</p><br/><p>Shua! Shua!</p><br/><p>Numerous pink silhouettes appeared.</p><br/><p>\"My fellow apprentice brothers, and also…\": Qin Hai looked at them and was instantly alarmed. \"President and Tianyu Liming.\"</p><br/><p>Chen Feng followed his gaze and looked over. Every person in the Land of Legacy had appeared together here, right before the center of the Land of Legacy.</p><br/><p>\"All appeared…\" Qin Hai muttered in a low voice. He was clear on the actual amount of people residing here.</p><br/><p>\"Is that so?\" Chen Feng looked around with a sharp gaze. Xiao Ying had actually failed to notice their existence. Where had these fellows appeared from? Were they here to stop Chen Feng and Qin Hai from stepping into the center? What was happening within the center?</p><br/><p>Bang!</p><br/><p>The president's sturdy figure blocked Chen Feng's line of sight. If the pink clothes, pink miniskirt, and pink body hair on him were ignored…</p><br/><p>Chen Feng was truly curious. With his eyebrow and body hair all dyed pink, what about the hairs at that specific part of his body?</p><br/><p>Mhm…</p><br/><p>The sight he pictured caused him to be speechless.</p><br/><p>Swish! Swish!</p><br/><p>Several silhouettes flickered, and next, Qin Hai's fellow apprentice brothers appeared around them, trying to block their advance.</p><br/><p>Chen Feng laughed. \"Interesting.\" With Tianyu Liming and the president as the main vanguard and four of Qin Hai's apprentice brothers as support, they were sealing all of Chen Feng and Qin Hai's escape routes from this place?</p><br/><p>Qin Hai sneered. \"Looks like we have been surrounded.\" He was clear on the strength of these apprentice brothers of his. Although they were very powerful compared to ordinary people, they were still the weaker ones among all the apprentices. Perhaps the pink energy was able to sense this as well and had thus grouped them together?</p><br/><p>\"Show us, then, how strong these apprentice brothers of yours are after fusing with the pink.\" Chen Feng's eyes became sharp.</p><br/><p>Bang!</p><br/><p>A bright radiance erupted. Chen Feng had actually taken the initiative to attack!</p><br/>\n</div>"}