{"title": "Chapter 625: Mysterious Existence", "id": 625, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-625-mysterious-existence", "volume_title": "Volume 7", "body": "<h1>Chapter 625: Mysterious Existence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 625: Mysterious Existence</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"Are these poses not awkward without the accompanying special effects?\" Chen Feng asked with a faint smile. When he was shrouded by the pink aura as he activated his ability, he would appear so very mystical and incomparably tyrannical, but now, with his energy being destroyed, he appeared rather awkward.</p><br/><p>Senior Zhang's eyes gleamed coldly. \"Hmph! Trash,\" he muttered to himself, though it wasn't clear whether he was talking about Chen Feng or himself.</p><br/><p>Bang!</p><br/><p>Suddenly, he ignited himself with a dense pink flame.</p><br/><p>\"This…\" Qin Hai's expression changed greatly. \"This is bad. He is burning his life force.\"</p><br/><p>\"Mhm?\" Chen Feng's expression became solemn. Burning his life force? This fellow…</p><br/><p>\"Senior, it's me. Do you not recognize me anymore?\" Qin Hai tried awakening his senior. And yet…</p><br/><p>Senior Zhang merely shouted coldly with hatred in his eyes. \"Scram!\"</p><br/><p>\"He is not your senior.\" Chen Feng shook his head. \"To be precise, his state of mind is currently being controlled by a certain power, similar to the president. It is pointless to try communicating with them when they are like this.\"</p><br/><p>He had long seen through this. As such, they had to avoid touching anything pink here. Here, pink signified danger.</p><br/><p>Qin Hai had an unsightly expression. \"What do we do, then?\" Senior Zhang had cared for him greatly in the past. He did not wish to see Senior Zhang die this way, dying with an unclear mind by burning his own life force away.</p><br/><p>Chen Feng took a deep breath. \"Let me give it a try.\"</p><br/><p>Perhaps…</p><br/><p>Bang!</p><br/><p>A berserk power erupted from Senior Zhang's body. The pink flame increased in intensity. Senior Zhang's life force was being burned away.</p><br/><p>\"Hehe.\" He gave off a bizarre laugh as his gaze was fixed on Chen Feng. The berserk pink energy converged without stop, forming a powerful and dreadful pink beam.</p><br/><p>\"I shall…\"</p><br/><p>Bang!</p><br/><p>He pointed midair. Suddenly, the pink surged toward Chen Feng. Yet before he could even finish his sentence, he was interrupted by Chen Feng, who completed the sentence for him.\"</p><br/><p>\"End you!\" Chen Feng shouted heroically.</p><br/><p>Swish!</p><br/><p>A silhouette flashed out of his body. Spirit appeared and, with a shiny red sword, slashed downward with a powerful force. Instantly, the boundless pink was torn apart.</p><br/><p>Swoosh!</p><br/><p>All the pink vanished.</p><br/><p>\"You…\" Senior Zhang trembled as his eyes rolled up and his body collapsed weekly to the ground.</p><br/><p>\"Senior.\" Qin Hai rushed over. \"He has lost consciousness from energy exhaustion.\"</p><br/><p>Qin Hai shook his head. This senior's situation resembled the few people they had encountered earlier. All of the energy within them, including the pink energy, had been fully exhausted, resulting in them losing consciousness.</p><br/><p>\"Mhm.\" Chen Feng was somewhat absent minded. The \"end you\" he had shouted earlier had merely been something he had shouted randomly. After all, in fights, shouting these things could only serve to disturb the opponents as far as he was concerned. After all, shouting that was much better than shouting \"those who dress up in my female outfits shall be eliminated\".[1] 1</p><br/><p>Naturally, all this was not important. What Chen Feng cared about was the final expression on Senior Zhang's face before he had lost his consciousness. This was not as obvious as the expression of that devil expert Chen Feng had defeated previously. At that time, numerous expressions such as shock, disbelief, and adoration had appeared. Chen Feng was still confused about all those. Yet this time, from this Senior Zhang's expression, dread had been seen. That's right, dread!</p><br/><p>The dread was not something Senior Zhang had felt. Rather, it was the pink energy, not a feeling let off by any specific consciousness. Instead, it was the pure fear exhibited by the pink energy toward Chen Feng's energy. This was rather astonishing.</p><br/><p>\"Misconception?\"</p><br/><p>Chen Feng rubbed his head. He did not believe that the present him would still see things wrongly. As such, this pink energy was truly capable of emotions? This Senior Zhang's energy was spatial energy, and it was this energy that the pink energy had combined with. Since Chen Feng's energy had countered them, it was natural for them to feel fear. But then, this was something inconceivable.</p><br/><p>\"If that's true…\"</p><br/><p>Chen Feng was able to form an initial conjecture as to what had happened here. An unforeseen event had happened here, not initiated by any person but rather by some power instead? Or perhaps a certain formidable power had formed its own consciousness? This was what Chen Feng guessed.</p><br/><p>After discussing with Qin Hai, Qin Hai agreed with this conjecture as well. He put Senior Zhang down and walked forth to open the door. Yet regretfully, the inside was empty apart from boundless pink.</p><br/><p>\"Seems like the transportation system has been destroyed as well.\" Qin Hai appeared regretful.</p><br/><p>Chen Feng rolled his eyes. \"Even if it hadn't been destroyed, I wouldn't dare to use it anyway.\"</p><br/><p>Qin Hai gave it some thought and agreed. Even if the transportation system was fine, would they dare use it?</p><br/><p>\"Let's continue walking, then.\"</p><br/><p>Qin Hai laughed bitterly and they both continued walking forth. After the appearance of this Senior Zhang, they were even more careful now, especially when passing through the residences of Qin Hai's other apprentice brothers.</p><br/><p>Surprisingly, no new enemies appeared. Those apprentice brothers of Qin Hai had seemingly vanished—not a single one of them appeared. Chen Feng pondered. The world of pink was terrifyingly quiet. Had that thing been scared off?</p><br/><p>The memory of the dread exhibited by the pink energy was still fresh in his mind. And with the subsequent absence of Qin Hai's other apprentice brothers, his conjecture was seemingly proven.</p><br/><p>\"Although I don't know what that thing is, it must have been scared off,\" Chen Feng guessed.</p><br/><p>\"Or perhaps…\" Qin Hai added, \"it feels like it isn't a match for you even after combining with my apprentice brothers. As such, it has given up on that to avoid additional losses.\"</p><br/><p>Chen Feng nodded. \"That's possible.\" In a few words, the two of them were able to get the general gist of the situation. As such, that energy was keeping a low profile after seemingly noticing how difficult Chen Feng was to deal with. It decided to stop wasting any energy and to save it until it counted. It was presently preparing something even more terrifying…</p><br/><p>\"Look.\"</p><br/><p>Qin Hai pointed at a room nearby. There, another apprentice brother of Qin Hai's could be seen. He was similarly shrouded in pink. However, the present him was already fully exhausted of energy and was unconscious.</p><br/><p>\"He lost his strength.\"</p><br/><p>Chen Feng was able to see it clearly with a single glance. It seemed like Qin Hai's guess was correct. The pink energy was indeed holding back and saving up its power for something else.</p><br/><p>\"Ignore him.\"</p><br/><p>They only gave the apprentice brother a glance and did not approach him. After all, things might be even safer for this apprentice brother now that the pink energy within him was fully exhausted. However…</p><br/><p>\"We need to be extra careful,\" Chen Feng reminded Qin Hai.</p><br/><p>\"Understood.\" Qin Hai was similarly prudent as well. The presence of intelligence had made this pink energy even scarier. For it to deliberately give up on several fellows who it felt to not be Chen Feng's match, it definitely had to be preparing something even more terrifying.</p><br/><p>One, two, three…</p><br/><p>They looked at the buildings all around them, their scalps feeling numb.</p><br/><p>\"What exactly is this pink energy trying to do?\"</p><br/><p>They were getting nearer to the center. Just as they concluded that this pink energy was probably planning to have a single decisive battle with them at the center, suddenly, the entire world started flickering, darkening before brightening up without stop. The pink radiance flickered, akin to a breathing lamp. Far away, a pink figure appeared. On the head of that figure was a white hat that appeared so very dazzling.</p><br/><p>\"White hat…\" Qin Hai's pupils shrunk. \"Even Senior Mu has fallen!\"</p><br/>\n</div>"}