{"title": "Chapter 626: Magnetic Melody", "id": 626, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-626-magnetic-melody", "volume_title": "Volume 7", "body": "<h1>Chapter 626: Magnetic Melody</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 626: Magnetic Melody</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Senior Mu. This a person had a unique identity and ability. If there were anyone in the Land of Legacy that was immune to the pink energy, it would most certainly be him. Qin Hai had never expected that even Senior Mu would fall to it.</p><br/><p>\"Be careful,\" Qin Hai reminded Chen Feng.</p><br/><p>\"I know.\" Chen Feng gazed ahead. He was aware of how terrifying this senior's ability was—or rather, how peculiar it was.</p><br/><p>Hum—</p><br/><p>A faint pink aura flashed past. The hat on Senior Mu's head slowly changed color, becoming pink. Next, an aura that caused one's will to shake gushed out, silently entering their brains.</p><br/><p>\"Submit... my child…\"</p><br/><p>The hoarse voice resounded by their ears and echoed within their mind. A momentary blankness appeared in the eyes of Chen Feng and Qin Hai. As the voice echoed without stop, they started feeling sleepy.</p><br/><p>This won't do!</p><br/><p>Chen Feng gritted his teeth and tried holding on, to the point that his gums started bleeding. He could not allow himself to fall asleep. The moment he fell asleep… he would become a puppet of this fellow.</p><br/><p>I must stay awake! Chen Feng roared inwardly. Yet the sleepy feeling became stronger and stronger, seemingly unstoppable even with his S-class strength.</p><br/><p>Beng! Beng! Beng!</p><br/><p>Chen Feng pointed at the empty air three times. He tried to destroy this power in the same fashion he had destroyed the spatial ability earlier. Alas, this force was coming to him from all directions like a wave. Chen Feng was able to only destroy the small portion of it that was in front of him. He was incapable of blocking the entirety of this force.</p><br/><p>\"Damn it.\"</p><br/><p>Chen Feng had an ominous feeling. This Master Mu had already been a peak beyond A class in the past. Now that he had fused with the pink energy, he was already at the doorstep of the awakened realm. Chen Feng had no way of stopping his attack. Moreover, the awakened ability he knew of was ineffective against these soft attacks.</p><br/><p>This is getting troublesome…</p><br/><p>Chen Feng felt his eyelids getting heavier.</p><br/><p>His gaze blurry, he looked at Qin Hai. Qin Hai had a fierce expression on his face, evidently struggling against the brainwashing as well. They would need something, something capable of waking them up from this state of mind.</p><br/><p>I need some provocation!</p><br/><p>Chen Feng pondered with the final speck of consciousness he had. The present him required something exciting, something thrilling, to wake him up from this.</p><br/><p>Fast! Fast! Fast!</p><br/><p>His drowsiness was getting heavier, to the point that it was almost unbearable. He needed an intense provocation to wake himself up.</p><br/><p>Thrill…</p><br/><p>Excitement…</p><br/><p>Wang Yao?</p><br/><p>The first person he thought of was Wang Yao, yet he found that his drowsiness increased further. This won't do. What about horror movies?</p><br/><p>Shua!</p><br/><p>Chen Feng got Xiao Ying to replay the horror movies he had watched within his brain. With Xiao Ying's present strength, it was not a problem to replay a horror movie with the exact special effects and sounds. Yet with Chen Feng's present strength, this horror movie wasn't even able to bring any changes to Chen Feng's emotions when watching it.</p><br/><p>What stupid movie! Why was there nothing thrilling in it? Chen Feng tried getting Xiao Ying to replay a porno, yet it still failed to work. Chen Feng glanced at Qin Hai. That fellow was no longer able to keep his eyes open. If this continued, Qin Hai would soon fall under Master Mu's control. And next, it would be Chen Feng's turn.</p><br/><p>\"Damn it!\"</p><br/><p>Chen Feng wanted to clench his fists tightly, yet he noticed that he couldn't exert any strength, as his fists were no longer taking his commands. At present, the amount of his strength he could control was decreasing without stop.</p><br/><p>The drowsiness increased without stop.</p><br/><p>Movies?</p><br/><p>Comedies?</p><br/><p>Music?</p><br/><p>Chen Feng got Xiao Ying to replay anything that should be able to bring him some excitement or thrill yet nothing worked. Rather, his drowsiness increased.</p><br/><p>Am I out of ways out of this?</p><br/><p>Chen Feng's train of thought was on the verge of a complete stop. At this moment, he handed everything in his brain to Xiao Ying and Spirit so they could think of something for him, as he was already incapable of thinking and was only able to watch on helplessly as the sense of drowsiness overcame him. Right at this instant, an immensely loud voice resounded: </p><br/><p>\"Wake up!\"</p><br/><p>\"All who do not wish to be a slave! Use your flesh and build us a new Great Wall!\"[1]</p><br/><p>…</p><br/><p>Hiss.</p><br/><p>Instantly, Chen Feng regained a degree of consciousness. What a familiar melody! Back when he had still been a student, this had been his alarm in the morning! Because of that, he had almost been beaten to death by his roommate! This familiar melody had seemingly returned Chen Feng to his previous life, his life as a student… Mhm… Those cute female classmates…</p><br/><p>Suddenly, a wave of drowsiness attacked him.</p><br/><p>The newly gained consciousness started fading as his drowsiness intensified.</p><br/><p>\"…\"</p><br/><p>Spirit and Xiao Ying exchanged glances, appearing to be at a loss. What should they do now?</p><br/><p>\"Hold on.\" Spirit started analyzing everything she had seen. Based on the degree of provocation these things had brought Chen Feng, she selected the one with the most intense provocation.</p><br/><p>\"Hopefully, I will be correct this time.\" She took in a deep breath. \"Xiao Ying, play it. We don't have much time left. This time, play it directly to the outside world at maximum volume so even Qin Hai can hear it as well.\"</p><br/><p>Swish!</p><br/><p>Xiao Ying streaked out hastily.</p><br/><p>At this time, both Qin Hai and Chen Feng were on the verge of falling under the enemy's control. Suddenly, a magnetic melody resounded.</p><br/><p>\"Zhejiang Wenzhou!\"</p><br/><p>\"Zhejiang Wenzhou!\"</p><br/><p>\"The largest tannery, Jiangnan Tannery, has gone bankrupt!\"</p><br/><p>\"The bastard boss Huang He, dining, whining, whoring, and gambling. Incurred a debt of 350 million and fled with his mistress! Out of choices, we used the produced wallets to substitute for our pay. The original prices were 100-odd yuan, 200-odd yuan, 300-odd yuan, all sold at 20 yuan! All 20 yuan! Huang He, you bastard, you are not human! We have worked hard for you for half a year yet have received no salary! Pay us our hard-earned money, pay us our hard-earned money!\"[2]</p><br/><p>…</p><br/><p>Qin Hai was alarmed. This magnetic melody, these wondrous lyrics, was seemingly describing a story where love and hate interwove. The song was so moving one could cry, the story told so very heart-rending…</p><br/><p>At this moment, Qin Hai seemingly saw a scene where an earnest youth worked hard for a great tannery. He entered Wenzhou just to approach his beloved woman yet was unfortunate enough to only be able to take her older sister as his wife instead…</p><br/><p>Chen Feng was alarmed as well. However, he was way too familiar with this song. So familiar was he that it only provoked him slightly and was insufficient to wake him. As for Qin Hai, under the effect of the pink and white energy, he had seemingly immersed himself fully into the world of the song…</p><br/><p>Wanting to regain consciousness with a single song? How was that possible?</p><br/><p>The white hat shone radiantly, bringing them into an illusory dream. Chen Feng and Qin Hai were both engrossed in some sort of dream-like state, yet at this moment, the magnetic song continued, yet the lyrics were changed.</p><br/><p>\"Gene Production Association!</p><br/><p>\"Gene Production Association!</p><br/><p>\"Went bankrupt!</p><br/><p>\"Bastard boss, Chen Feng, incurred a debt of 350 million, eloped with Xu Fei! Out of choices, we have to use Xiao Rou to repay the debt…\"</p><br/><p>…</p><br/><p>??!</p><br/><p>\"Hiss—\"</p><br/><p>After taking a deep breath, Chen Feng woke up instantly.</p><br/><p>\"???\"</p><br/><p>Qin Hai shivered and woke up as well.</p><br/><p>Shua!</p><br/><p>The both of them regained consciousness immediately, as if cold water had exploded right inside their brains.</p><br/><p>What the f*ck?</p><br/><p>This was the first reaction of both of them.</p><br/><p>The magnetic song continued, \"Chen Feng, the bastard, you are not human. We have worked hard…\"</p><br/><p>\"Spirit!\" Chen Feng howled and interrupted her.</p><br/><p>\"Huh? You're awake?\" Spirit was overjoyed.</p><br/><p>\"I want to know why did I have to elope with Xu Fei? Even if it was so the lyrics could rhyme, you should have made me elope with Xiao Rou instead, right?\" Chen Feng couldn't understand the logic of this. Why in the world would he elope with Xu Fei, a male? Qin Hai was similarly dumbstruck. He was aware that this music was the work of Chen Feng. As such, could he conclude that these were Chen Feng's inner thoughts? Holy shit, what in the world was Chen Feng thinking on a daily basis?</p><br/><p>\"Contrast.\" Spirit smiled. \"Only extreme contrast could wake the both of you up.\"</p><br/><p>\"Oh.\" With this explanation, Chen Feng was satisfied. That's right. If he was going to elope, it should be a woman instead. How could it be possible for his innermost thought to be such gay thoughts?</p><br/><p>Seems like I am still straight. Chen Feng was pleased. Hold on…</p><br/><p>By the side, Qin Hai recalled something. What the hell, how could forget the fact that the lyrics had used Xiao Rou as a means of repaying the debt, yet now, Chen Feng was even thinking of eloping with her? How could he?</p><br/><p>Qin Hai glared at Chen Feng grudgingly. \"Chen Feng, don't you think that you need to explain something to me?\"</p><br/><p>Chen Feng: \"…\"</p><br/>\n</div>"}