{"title": "Chapter 623: Miracle Nikki", "id": 623, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-623-miracle-nikki", "volume_title": "Volume 7", "body": "<h1>Chapter 623: Miracle Nikki</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 623: Miracle Nikki</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>This sight…</p><br/><p>Chen Feng was dumbstruck. He had always seen himself as a calm person, a person able to stand calm facing various crises, yet now he was truly dumbstruck.</p><br/><p>\"Pr-president?\" he asked cautiously.</p><br/><p>\"Mhm?\" The president raised his head, finally noticing Chen Feng. \"Chen Feng?\" he said gently.</p><br/><p>Chen Feng: \"???\" This tone of voice... \"Yes, it's me.\" Chen Feng was somewhat terrified. Instinctively, he took a step back, as he felt that something was wrong.</p><br/><p>\"It's good that you have arrived. Let me tell you something…\" The president spoke in excitement, and mid-sentence, a pink radiance flashed in his eyes and his gaze landed on Chen Feng. Killing intent erupted. \"It's you!!!\"</p><br/><p>Bang!</p><br/><p>An endless killing intent erupted.</p><br/><p>\"Not good.\" Chen Feng sank into a solemn mood. It was lucky that he had been prepared for this and was able to dodge the attack.</p><br/><p>Bang!</p><br/><p>A pink building collapsed from the attack.</p><br/><p>\"Hmph!\" The president snorted, leaped up, and slammed his foot down. Chen Feng looked upward at the president and his expression darkened at the \"view\" presented to him.</p><br/><p>Screw this pink miniskirt!</p><br/><p>Bang!</p><br/><p>Qin Hai charged over and blocked the attack for him.</p><br/><p>\"Who is it?\" he asked with a deep tone.</p><br/><p>A snort was his only reply. \"Hmph!\" The president glanced at the both of them before fleeing, vanishing amid the pink energy pervading the air.</p><br/><p>\"He left?\" Chen Feng did not chase after him and instead sunk into contemplation. \"He was able to call my name out. He should have recognized me.\" Chen Feng frowned. \"The president's strength is still similar to before. This should be the real president. However, his form and mental state seem rather unstable.\"</p><br/><p>This was the scariest thing. How had the previously fine president turned into that? This place…</p><br/><p>Chen Feng and Qin Hai exchanged glances, and both felt their hairs standing on end.</p><br/><p>\"I have a question,\" Qin Hai stated after pondering the matter.</p><br/><p>\"Say it,\" Chen Feng replied with a solemn expression.</p><br/><p>Qin Hai feigned a calm expression and asked, \"Erm… is this the style you people of the Genetic Union prefer?\"</p><br/><p>Chen Feng gave him a glare.</p><br/><p>Qin Hai laughed madly. \"Hahaha.\" This was indeed instant karma. Chen Feng had sneered at him earlier, and now, his chance of revenge had arrived.</p><br/><p>Suddenly, Chen Feng said, \"Qin Hai, you have changed. The past you was not like this.\"</p><br/><p>\"Scram!\" Qin Hai replied without hesitation. The both sneered at each other for a while before once again sinking into silence.</p><br/><p>One, two, three!</p><br/><p>Swish!</p><br/><p>An intense killing intent bloomed from a certain corner as a pink figure appeared there. Chen Feng and Qin Hai exchanged glances as their eyes gleamed coldly. They had been waiting for this person to come out.</p><br/><p>Bang!</p><br/><p>A terrifying radiance erupted.</p><br/><p>Two pink figures descended from the sky. Both were similarly dressed and styled as the president earlier, tall and buff guys in flashy pink miniskirts. Moreover, both of them were male. Chen Feng could remember clearly that there were not many males left in the ancient race, yet all of the remaining ones had seemingly gathered here.</p><br/><p>Qin Hai frowned. \"It's you guys.\"</p><br/><p>Chen Feng gave him a glance. \"You know them?\"</p><br/><p>\"The only two gatekeepers remaining in the Land of Legacy.\" Qin Hai shook his head. \"These two were among the earlier ones to reach peak beyond A class. As such, they hadn't relied on the beyond X gene reagent and were able to remain male.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>He looked at the pink gatekeepers. They presently seemed even worse off than if they had directly transformed into females instead.</p><br/><p>The two spoke in feminine tones. \"Those who enter the Land of Legacy without permission shall be killed!\"</p><br/><p>Bang!</p><br/><p>A pink radiance erupted from them.</p><br/><p>Qin Hai's eyes gleamed coldly. \"Let me deal with them. I know them better. Let me be the one to face them.\"</p><br/><p>Bang!</p><br/><p>He took the initiative to move.</p><br/><p>\"Fine.\" Chen Feng watched on by the side. Qin Hai's strength did not need to be doubted. He was a peak beyond A class and the owner of the black diamond. His strength was only second to the awakened Chen Feng. These two gatekeepers were supposed to be much weaker than Qin Hai, yet…</p><br/><p>Bang! Bang!</p><br/><p>After several clashes, they seemed to be evenly matched. The two of them were actually able to match Qin Hai. Something had to be wrong with this.</p><br/><p>\"It's the energy,\" Qin Hai said solemnly. \"Their energy remained the same as in the past, and their auras are still the same as well. However, under the effect of this pink aura here, their strength has increased by tenfold.\"</p><br/><p>Tenfold!</p><br/><p>This was equivalent to going up an entire realm. These regular beyond-A-class gatekeepers had become peak beyond A classes now thanks to this increase.</p><br/><p>Chen Feng pondered. \"It is no wonder that the president was able to block my attack earlier.\" These people soaked in pink had seemingly become stronger.</p><br/><p>\"Spirit, make a record of this aura,\" Chen Feng said inwardly.</p><br/><p>\"Understood.\" Spirit started analyzing the aura.</p><br/><p>Qin Hai did not end the battle quickly. Rather, he dragged it out, as this was their best chance to observe this place. These two gatekeepers weren't important, but this pink aura, on the other hand…</p><br/><p>Shua! Shua!</p><br/><p>As they clashed, they were able to notice more things. Soon after, the two noticed that something wasn't right and unleashed their trump cards without any hesitation. Their trump cards erupted together with the pink energy.</p><br/><p>Bang!</p><br/><p>A punk radiance erupted.</p><br/><p>\"I can't continue dragging this out.\"</p><br/><p>Before the two could detonate themselves, he defeated them cleanly.</p><br/><p>Hu!</p><br/><p>The two collapsed instantly.</p><br/><p>\"Still alive.\" Qin Hai sensed their auras. \"Half the pink energy is gone from their bodies. At present, they are semi-unconscious. If we want them to recover their consciousness…\"</p><br/><p>He stared ahead. They would have to first deal with the source of the mystical pink energy before they could solve this.</p><br/><p>\"Following the trace of the pink aura in accordance to the intensity of the color…the source of the pink energy might be at the very center of the Land of Legacy, the place where Master resides. It seems like this incident might be related to Master after all.\" Qin Hai had a solemn expression.</p><br/><p>Duma… Chen Feng raised an eyebrow. Pink…</p><br/><p>Could all this have happened merely because this old man had had a sudden interest in dressing up as a woman?</p><br/><p>\"Even if you don't say anything, I know what you are thinking.\" Qin Hai glared at him. \"The truth is definitely not as you think.\"</p><br/><p>\"…\" Chen Feng chuckled, \"Let's go the center and take a look, then. I am very curious myself. What exactly is it that is capable of transforming the Land of Legacy into Miracle Nikki…\"</p><br/><p>Qin Hai blanked. \"What Miracle Nikki?\"</p><br/><p>\"A female dress-up game. I feel like this game is suitable for you guys from the Land of Legacy,\" Chen Feng explained with a smile.</p><br/><p>\"Scram!\" Qin Hai spat.</p><br/><p>\"I'm telling the truth. Do you want to give it a try?\" Chen Feng proposed earnestly.</p><br/><p>\"Hehe.\" Qin Hai sneered. The two berated each other as they headed to the center. Soon, their figures vanished amid the pink. Not long after they had left...</p><br/><p>Shua!</p><br/><p>A pink figure appeared in midair. The figure glared at the departing backs of Chen Feng and Qin Hai, hatred filling her eyes.</p><br/><p>\"Hehe… You guys… will most definitely die here.\"</p><br/>\n</div>"}