{"title": "Chapter 636: Ultimate Trump Card of the Scarab Race", "id": 636, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-636-ultimate-trump-card-of-the-scarab-race", "volume_title": "Volume 7", "body": "<h1>Chapter 636: Ultimate Trump Card of the Scarab Race</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 636: Ultimate Trump Card of the Scarab Race</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>This… is this a semi-upgraded Luck Aura? Chen Feng was overjoyed. He did not know how long would he be in this state. Perhaps this state would be gone the moment Duma's time reversal stopped. As such, he had to make use of this state to its fullest extent. With Luck Aura, he could assist in deducing his very own awakened power. With Luck Aura, he could search for the source of the pink energy.</p><br/><p>Shua! Shua!</p><br/><p>Spirit deduced at a rapid speed. Time abilities, studying awakened power, coordinating of the source… Everything advanced in an orderly fashion. The moment this Luck Aura was activated, the moment Chen Feng entered this state where he had bottomless luck value to use, he was unequaled. The entire world revolved around him! This was the prowess of Luck Aura!</p><br/><p>A smile appeared on Chen Feng's face. \"In my world of luck, nobody can defeat me.\"</p><br/><p>Shua!</p><br/><p>He lifted his hand calmly.</p><br/><p>Pu!</p><br/><p>Suddenly, Duma started coughing blood. \"Damn it.\" He looked at Chen Feng in alarm. What in the world had happened to this fellow? He could feel that Chen Feng was presently in a mysterious and unique state. Chen Feng's present momentum was so mighty that he seemed unequaled. Too powerful, so powerful it was petrifying. What was going on with this human? Duma had no answer to that. The only thing he could do was increase the speed of the time reversal. Regardless of what power Chen Feng was using, so long as he dropped from his awakened realm, all his power would be gone.</p><br/><p>This was what Duma believed. Well, in any case, this was his line of thought after a certain wondrous power \"guided\" his line of thought. And next…</p><br/><p>Bang! Bang!</p><br/><p>As this continued on, he finally found out that this damnable Chen Feng was still an awakened. Moreover, it seemed impossible for his realm to drop.</p><br/><p>Could it be…</p><br/><p>Suddenly, Duma understood something.</p><br/><p>Shua!</p><br/><p>He stopped the time reversal. At that instant, everything returned to normal. Even Chen Feng's younger appearance returned to his present age, like everything that had appeared earlier had just been an illusion.</p><br/><p>And along with that, the unequaled and mysterious aura around Chen Feng vanished.</p><br/><p>\"I see…\" Finally, Duma understood. After dropping from the awakened realm, Chen Feng would actually enter such a state. As time reversed, Chen Feng would actually become stronger! Duma had finally understood everything. All his previous assumptions had been wrong. So long as he stopped using his time reversal, this Chen Feng would remain a weakling. Perhaps Chen Feng had once possessed some formidable power in the past that he could no longer use for some reason.</p><br/><p>So that was the case!</p><br/><p>Finally, Duma understood clearly. Despite his heavy injuries, he smiled. Opposite him, a somewhat regretful expression appeared on Chen Feng's face. What a pity. He had already used Luck Aura the best he could to search for that source, yet his luck value had, after all, still been limited. The absolutely unrestrained manner in which he had used his Luck Aura earlier had been something that couldn't have lasted long. His opponent, Duma, wasn't an idiot, after all. The moment his luck value was fully exhausted, Duma had understood the truth. Duma was still Duma, even if he only had access to a small portion of his strength. He was still an illustrious awakened.</p><br/><p>Is it over? Chen Feng took a deep breath and looked inwardly. Indeed, not only was his luck value exhausted, but his Luck Aura had once again been deactivated. But then, so what? Suddenly, Chen Feng smiled.</p><br/><p>\"You can still smile?\" Duma sneered. Even without his time reversal, he still had countless means at his disposal to eliminate this weakling.</p><br/><p>\"Naturally.\" Chen Feng shrugged and smiled. \"Because I have seen through your power.\"</p><br/><p>\"Mhm?\" Duma blanked before sneering. \"Naive.\"</p><br/><p>Shua!</p><br/><p>Once again, he searched his memory for a powerful time ability and unleashed it. Next…</p><br/><p>Chen Feng pointed. \"Disintegrate!\"</p><br/><p>His Star Disintegration Finger was activated, and Duma's activity was forcefully crushed.</p><br/><p>\"How is this possible?\" Duma cried out in alarm.</p><br/><p>\"Hehe.\" Chen Feng smiled calmly. With Luck Aura, nothing was impossible. Even though Luck Aura was no longer active, earlier, his Luck Aura had been like a cheat for Spirit. She had been able to complete all the deductions. Now, Chen Feng's Star Disintegration Finger was nearly perfect. All advanced spatial and chronal abilities were now ineffective against Chen Feng. Apart from some super trump cards, they wouldn't work against him at all.</p><br/><p>Chen Feng pointed.</p><br/><p>Disintegrate!</p><br/><p>Yet another one of Duma's time abilities was disintegrated.</p><br/><p>\"I told you. Your abilities are now ineffective,\" Chen Feng stated faintly. \"If you can't unleash the powerful technical abilities unique to Duma himself, you will not be able to harm me.\"</p><br/><p>The Duma before him was essentially a \"semicompleted product\".</p><br/><p>\"So that's the case.\" Duma sneered. Finally, he understood his current predicament. If so…</p><br/><p>Bang!</p><br/><p>Once again, he moved. This time, his attack target wasn't Chen Feng. Instead, it was the ground.</p><br/><p>Shua! Shua!</p><br/><p>A huge time cage exuding a faint undulation appeared. Everyone near the time cage would be warped by time itself, feeling like death itself would be an escape to this suffering. This power locked the entirety of the Land of Legacy down. However, from this attack that did not seem like an attack, Chen Feng could not feel any killing intent.</p><br/><p>Oh?</p><br/><p>Chen Feng raised his eyebrow, not understanding what this fellow was trying to do.</p><br/><p>Duma spoke calmly. \"This is not a killing move. This is, in fact, a defensive ability, an ability that will defend the both of us.\"</p><br/><p>Chen Feng did not understand.</p><br/><p>Duma appeared calm. \"From now on, I reckon we both will have to coexist peacefully.\"</p><br/><p>Chen Feng was still confused. What was this? Peaceful coexistence? What? Had this guy recovered his consciousness? Chen Feng looked at Qin Hai. Qin Hai merely shook his head. Evidently, this pink turtle was still under the control of the pink. If so, what did he mean, then?</p><br/><p>\"You don't understand?\" Duma shook his head. \"This is the ultimate trump card of us scarabs. Although I can't use much of the real power of this body, this particular ability does not have any limitations.\"</p><br/><p>Finally, Chen Feng's expression became solemn. \"Oh?\"</p><br/><p>Trump card, huh? This ability…</p><br/><p>He had never expected that a day would come when he would need his opponent to explain a trump card to him. But then, it seemed like Duma was very happy to provide this explanation? After all, he was seeking peaceful coexistence, right? Chen Feng wanted to know what this so-called peaceful coexistence trump card was all about.</p><br/><p>\"Do you still not understand?\" Duma's expression was calm as he said, \"The flow of time in here is somewhat different than the outside world. Naturally, the speed is in fact still normal. Since we are all together in here, maintaining this does not exhaust much energy on my part. The reason for the low exhaustion is because this is an ability with only a single function: trapping us all in here, trapping us here eternally. Here, time is boundless. Let us see who can live longer!\"</p><br/><p>Finally, Chen Feng understood. What the hell? No wonder this turtle wasn't anxious at all. His so-called trump card was actually outliving his opponents? What in the world? The scarab race was shameless! Competing in longevity after failing to defeat an opponent? This was too excessive! This method of operation…</p><br/>\n</div>"}