{"title": "Chapter 635: Thank You, Bro!", "id": 635, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-635-thank-you-bro", "volume_title": "Volume 7", "body": "<h1>Chapter 635: Thank You, Bro!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 635: Thank You, Bro!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Time reverse! This ability that was regarded by Duma as trash was presently displaying an astonishing effect. Even Chen Feng, who was similarly an awakened, was helpless before it.</p><br/><p>\"Humans…\" Duma smiled. Humans were truly too weak. During the Ancient Era, any random one of those old fellows would have had a life span of several thousand years. If he had tried using his time reversal on them, he would probably have exhausted all his energy before being able to do anything of substance to the enemy. But here… Humans had a short several-decade life span, and this Chen Feng was even younger.</p><br/><p>Duma waved his hand indifferently. \"Die.\" The time he needed to reverse to reduce Chen Feng from the awakened realm was not even several decades. Only a short period of time needed to be reversed on Chen Feng and he would be able to easily kill Chen Feng.</p><br/><p>Mhm… it's about time. He could see that Chen Feng's aura was becoming unstable. That's right. Chen Feng was going to drop back to A class soon. His awakened aura became unstable. Right at this moment, he noted that Chen Feng's expression became weird. A smile appeared on Chen Feng's face.</p><br/><p>?!</p><br/><p>This guy…</p><br/><p>Duma raised his brows. Had Chen Feng's brain been reversed so much that he had become retarded? He had no idea what was happening to Chen Feng. However, this smile of Chen Feng's, for reasons unknown, gave him an uncomfortable feeling. As such, he sent a probing attack at Chen Feng.</p><br/><p>Swish!</p><br/><p>A simple ray of light shot at Chen Feng. This was a simple awakened attack. However, with Chen Feng's present state where he was on the verge of dropping out of the awakened realm, it was impossible for him to block this attack.</p><br/><p>Therefore…</p><br/><p>Duma widened his eyes, his gaze fixed on Chen Feng. Indeed, Chen Feng did not even bother blocking the attack. Just like that, he allowed the light to sweep past him.</p><br/><p>Shua!</p><br/><p>Just like that, the ray of light vanished.</p><br/><p>\"???\" Duma was dumbstruck. Gone? Chen Feng had obviously not moved… What did this guy… Duma had an ominous feeling.</p><br/><p>At present, at a certain location within the unknown region, within a dense forest that humanity had yet to reach, a leopard was lazing about by a lake. It had been eating so much that it was as plump as a ball.</p><br/><p>Ahh, too comfortable. Since this leopard had given up covetting that damnable stone, life had been beautiful. At present, this leopard had even become the guardian of that stone.</p><br/><p>Mhm…</p><br/><p>Anyone thinking of touching that stone would have to first pass through this leopard. It could remember clearly the first time it had protected the stone. It had merely been trying to hunt those injured animals to fill its stomach. Yet as time had passed, it noticed that its strength had been increasing rapidly. This was seemingly related to that stone.</p><br/><p>Mhm…</p><br/><p>The leopard reasoned that this had to be the blessing of the gods. From that day onward, the leopard had been the guardian of the stone. Life had been too comfortable since then. The leopard flipped its plump body around.</p><br/><p>Suddenly, a faint aura swept past. The leopard shivered as all its fur stood up. The leopard stood up abruptly and looked at the center of the lake. There, the stone, which had remained silent for so long, was shaking.</p><br/><p>Hum—</p><br/><p>Hum—</p><br/><p>The stone shook and flickered at the same time. A terrifying power shimmered around the stone, causing the hearts of all onlookers to be petrified.</p><br/><p>The leopard was confused. What was up with the stone?</p><br/><p>Howl!</p><br/><p>Howl!</p><br/><p>The forest became noisy. Numerous powerful beasts came. Evidently, they had also sensed this bizarre aura. Their greedy gazes were fixed on the stone.</p><br/><p>The leopard howled as it stood by the lake. It knew that this would be a bitter battle. \"Howl—\"</p><br/><p>\"Howl—\"</p><br/><p>Accompanied by a loud howl, the battle began. At this time, in the Land of Legacy, Duma was looking at Chen Feng in panic as well. Evidently, he had no idea what had happened to this kid to give him such peculiar feeling.</p><br/><p>Chen Feng looked at him and said with a laugh, \"Thanks.\"</p><br/><p>\"What?\" Duma was somewhat dumbstruck. What was there to thank him for? Chen Feng was actually saying thanks to him?</p><br/><p>\"Thank you for allowing me to sense this familiar power… I don't know how long this will last. However…\" Chen Feng smiled. Since he had entered the awakened realm, his improvement had mainly been on understanding and comprehension. Even his attacks and deductions had all been related to Xiao Ying and Spirit. Not a single one of his improvements had been related to his body. Therefore, although the time had been reversed, so long as he was still in the awakened realm, the effect on him wasn't much, almost nonexistent. However, there was one single point Chen Feng could not let go.</p><br/><p>\"Did you not feel anything?\" Chen Feng asked with a toying smile.</p><br/><p>\"?!\" Duma's hair stood on end.</p><br/><p>Pu!</p><br/><p>Suddenly, he spurted out a mouthful of blood. What happened? Duma looked at Chen Feng in horror. He had no idea what was happening. This power…</p><br/><p>He cast his senses through his body and noticed with horror that the origin of this power was in fact himself. This was the backlash from the time reversal he had used. He had actually suffered from the backlash of reversing time!</p><br/><p>Duma was alarmed. How was this possible? One ought to know that this would only happen when he was trying to use his time reversal on someone much stronger than him. Yet he had only used it on a mere human, the weak Chen Feng, who was a brand new awakened.</p><br/><p>\"This is impossible!\" Duma howled. And next…</p><br/><p>Pu!</p><br/><p>He spurted out another mouthful of blood. His energy was still being exhausted without stop as he suffered backlash from his time reversal.</p><br/><p>\"You…\" His eyes widened, and he looked at Chen Feng with an incredulous expression.</p><br/><p>\"Are you feeling comfortable?\" Chen Feng smiled faintly. \"You had touched upon something you shouldn't have…\"</p><br/><p>Shua!</p><br/><p>Chen Feng stepped out. Everything around him started operating according to his will. Chen Feng could even maintain this time reversal, not allowing it to disappear. He did not know why this was happening; however, so long as he could continue this, it would be fine.</p><br/><p>\"Spirit, maintain the time reversal at this exact moment. Don't continue reversing, and don't cancel the reverse.\"</p><br/><p>\"All right.\"</p><br/><p>\"Spirit, render all of Duma's attacks ineffective.\"</p><br/><p>\"All right.\"</p><br/><p>\"Spirit, start going all out researching and analyzing Duma's power.\"</p><br/><p>\"All right.\"</p><br/><p>\"Spirit, assist Xiao Ying in looking for the source of the pink energy. I need the coordinates as soon as possible.\"</p><br/><p>\"All right.\"</p><br/><p>…</p><br/><p>Chen Feng gave commands without stop, and Spirit acted accordingly.</p><br/><p>Shua! Shua!</p><br/><p>Chen Feng was slowly gaining the advantage, while opposite him, Duma was still in a daze. Why had this happened suddenly?</p><br/><p>Patter! Patter!</p><br/><p>Time passed.</p><br/><p>\"This…\"</p><br/><p>The little turtle's head popped out, and he took a glance with horror before withdrawing his head back into his shell noiselessly. This power… he could sense an ominous aura.</p><br/><p>\"I refuse to believe this.\" Duma wiped his blood and unleashed an attack once again. Unfortunately, all his attacks had become ineffective now. For numerous absurd reasons, all his attacks failed to kill Chen Feng. This weakling Chen Feng had suddenly become so mysterious.</p><br/><p>\"What power…\" Duma said, gazing at Chen Feng with an incredulous expression, \"…are you using, exactly?\"</p><br/><p>\"No power.\" Chen Feng smiled. \"You are the one who activated this for me. To speak the truth, it has been a long time since I last felt this power. What a familiar feeling.\"</p><br/><p>Shua!</p><br/><p>Chen Feng opened both his arms wide. The breeze brushed past him, feeling incredibly comfortable.</p><br/><p>Luck Aura: Full activation!</p><br/><p>That's right. Luck Aura. This Luck Aura, which had been temporarily deactivated due to the upgrade, had been forcefully reversed by Duma, returned to its state prior to the deactivation. At present, Luck Aura was fully activated.</p><br/><p>At this instant, Chen Feng had entered a brand new realm. Luck Aura was an extremely odd thing. This Luck Aura, which was supposed to be updating had been forced to stop its update. Even so, it still gave Chen Feng a mysterious feeling. Luck Aura seemed to be different now?</p><br/><p>This instant, Chen Feng felt like he was incomparably powerful. This instant, he felt like he was omnipotent. This instant, Chen Feng could feel that far away, beyond the horizon, something seemed to be resonating with him. As his thoughts willed, that thing would respond to him. It was an incredibly wondrous feeling.</p><br/>\n</div>"}