{"title": "Chapter 631: Where’s the Promised Scarab Race?", "id": 631, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-631-where%E2%80%99s-the-promised-scarab-race", "volume_title": "Volume 7", "body": "<h1>Chapter 631: Where’s the Promised Scarab Race?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 631: Where’s the Promised Scarab Race?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Chen Feng's expression became solemn. Here it comes! He knew that the moment Duma's real body appeared was also the moment the true battle would start. Both he and Qin Hai had been waiting for this. Alas, even though Chen Feng had prepared himself for this, when his gaze landed on Duma's body, he blanked. This… where was the promised scarab? Where was the promised beetle? What appeared wasn't a bug at all. Rather, it was a huge and imposing turtle that was exuding a dreadful amount of vitality.</p><br/><p>Chen Feng was stupefied. \"Tur... turtle?\"</p><br/><p>\"Yeah,\" Qin Hai answered, as if this was what it should be. \"Due to their omnipotent shells, they were called the scarab race. Even during the Primordial era, they were the strongest race.\"</p><br/><p>Chen Feng was astonished. \"Oh, so the so-called divine shell actually refers to turtle shell.\"[1] 1</p><br/><p>\"What else?\" Qin Hai felt like this buddy of his was rather absent minded today.</p><br/><p>Chen Feng spoke instinctively. \"I thought it was a beetle.\"</p><br/><p>Shua!</p><br/><p>The world lapsed into silence. Qin Hai's lip twitched. Even Duma, who had just completed his transformation, became furious as he heard this. Evidently, he had finally understood what Chen Feng's gaze from earlier had meant.</p><br/><p>Duma was furious. What the f*ck, you are the one that's a freaking beetle! Your entire family is a beetle! Intense killing intent leaked from his body as he prepared to move against them.</p><br/><p>Chen Feng finally understood. In short, Duma wasn't some beetle. Rather, he was the legendary turtle chief! Chen Feng gasped in admiration.</p><br/><p>Bang!</p><br/><p>Duma's killing intent intensified. A terrifying power gathered as he decided to no longer hold back. Even though his consciousness was presently being controlled, he still possessed the sanctity of the scarab race. This feeble human deserved death!</p><br/><p>\"Careful,\" Qin Hai warned Chen Feng. Both of them increased their vigilance to the extreme. Yet at this precise moment, a sudden and bizarre sound traveled over.</p><br/><p>The door of a nearby building was suddenly opened. A little turtle wobbled out of it, swaying while humming a song at the same time.</p><br/><p>\"The shell is too heavy, if I don't sway, I will be pushed to the ground.\"</p><br/><p>\"The shell is too heavy, if I don't sway, I will be pushed to the ground.\"</p><br/><p>\"The shell is too heavy, if I don't sway, I will be pushed to the ground.\"</p><br/><p>…</p><br/><p>Shua!</p><br/><p>The entire world seemed to lapse into silence. Only the intoxicating song of the turtle lingered in the air. Chen Feng and Qin Hai looked at the little turtle that was walking over with astonishment. Even the furious Duma calmed down and looked at that swaying little turtle with a bizarre gaze. Yet that turtle did not seem to notice anything. While wobbling, the turtle sang. As a turtle, it was evident that despite being so drowsy, this turtle was still able to stand steadily without collapsing to the ground.</p><br/><p>Chen Feng looked at the turtle in astonishment. \"It's him!\" Even though the size of this fellow had been greatly reduced, Chen Feng was still able to recognize him with a single look. This was precisely that giant turtle they had encountered in the frigid cave back then.</p><br/><p>Mhm, had he still been an F class back then, or had he been E class? In any case, it was this turtle. Back then, this turtle had been driven away by Wang Yao. Ultimately, he had been killed by Chen Feng's group below the sea. Yet unexpectedly, they once again saw this turtle here! This was rather inconceivable!</p><br/><p>Qin Hai was similarly shocked as well. \"This turtle…\" He remembered clearly that rather than being his master's pet, this turtle was actually his master's favorite food. Every day, this turtle would experience numerous methods of dying before being cooked, whether he was lightly fried, deep fried, or cooked via one of numerous other methods. As part of the scarab race, a race that also had shells, it was truly excessively cruel for his master to do this to a turtle…</p><br/><p>And thus, Chen Feng, Qin Hai, and Duma looked at the little turtle with odd gazes. The turtle wobbled three times each step he took. Just like that, the little turtle walked past the battlefield. Something did not feel right…</p><br/><p>Chen Feng and Qin Hai exchanged glances. Qin Hai nodded slightly, evidently feeling that something was wrong as well, yet at the same time, he had a feeling that everything was right. This little turtle…</p><br/><p>When they glanced over once again, their pupils suddenly widened. At this moment, they had finally discovered the abnormality they had been feeling earlier. This damnable turtle seemed fine and was even residing here… yet it's color was normal instead of pink!</p><br/><p>At a place like this, this appearance was incredibly out of place. Even a final-boss-type character like Duma, the scarab, had fallen. How had this turtle remained fine? Could it be that the actual final boss was actually…</p><br/><p>\"Swaying along with the shell, swaying along with the shell. Ao ao ao~\" The turtle was still singing that enchanting melody. When he passed the battlefield, suddenly, his eyes opened wide. All four limbs paddled at a rapid speed as he ran at an insane speed.</p><br/><p>\"Mom, the old turtle has gone crazy! So scary! I don't want to cross-dress!\"</p><br/><p>…</p><br/><p>Swish!</p><br/><p>With a flash, the turtle vanished. Chen Feng swore this was the first time he had seen a turtle run so fast. Even with the super vision he had as an awakened, he had failed to follow the movements of this turtle. This speed was too shocking.</p><br/><p>Before Chen Feng and Qin Hai could move, Duma, who as by their side, suddenly shouted, \"Where are you running?\"</p><br/><p>Bang!</p><br/><p>He took a single step forward.</p><br/><p>Bang!</p><br/><p>The earth trembled.</p><br/><p>Duma raised his head high as a sinister appearance appeared on his pink turtle head. \"As a turtle spirit, instead of allowing me to eat you obediently, you are thinking of rebelling?\"</p><br/><p>Bang!</p><br/><p>With a roar, Duma gave up on Chen Feng and Qin Hai and started chasing after the little turtle.</p><br/><p>This…</p><br/><p>Chen Feng was stupefied. What plot was this? This plot did not seem right? He rubbed his head. They had both dragged the time on nonstop to allow Xiao Ying to discover the origin of the pink energy. What about Duma, then? Chen Feng could clearly feel that this guy was trying to drag this out as well. Why was that?</p><br/><p>\"Perhaps, some traces of master's consciousness remain?\" Qin Hai guessed.</p><br/><p>\"Perhaps.\" Chen Feng did not comment much on it. He looked at Duma, who was chasing after the little turtle. \"Turtle spirit… What exactly is the identity of that little turtle?\"</p><br/><p>\"I don't know.\" Qin Hai shook his head. \"Master has eaten that fellow countless times and has resurrected him countless times as well for some unknown reason. I don't know what it is that he is seeking.\"</p><br/><p>Chen Feng: \"…\" Eating and resurrecting… Suddenly, he had a rather alarming guess. \"In short, at present, your master's innate instinct as a foodie has prevailed over the control of the pink energy?\"</p><br/><p>\"How is that possible?\" Qin Hai rejected that instinctively, yet when he looked at his master, who was chasing after the little turtle, he couldn't say anything.</p><br/><p>Holy shit… this can't be true, right?</p><br/><p>This… was even more unacceptable than his master being controlled by someone else! Even though his master had fallen under the control of the pink energy, from the steps and preparations of his master from a long time ago, he could sense how unfathomable and powerful his master was. It turned out that his master had long prepared for this situation where he was controlled by the pink energy. So it turned out that everything his master had taught him and the things he had given him were useful after all…</p><br/><p>Yet…</p><br/><p>What in the world was this? The awakening of his instinct as a foodie?</p><br/><p>\"Ahahahahahahahah—I am unwilling to be eaten by you! I am the spirit turtle, not turtle jelly! Duma, screw you!\"</p><br/>\n</div>"}