{"title": "Chapter 638: The True Culprit", "id": 638, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-638-the-true-culprit", "volume_title": "Volume 7", "body": "<h1>Chapter 638: The True Culprit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 638: The True Culprit</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Amid the starry sky.</p><br/><p>Hum—</p><br/><p>A shockwave flashed past.</p><br/><p>Bang!</p><br/><p>A battleship exploded loudly. Along with the intense tremors, it transformed into numerous particles before vanishing. At this time, in outer space, the countless battleships of the rich that had once orbited the planet had all vanished. Amid the starry sky, only a single battleship remained. One could also say that only an eternal throne remained here. On the throne, a person was seated. A pair of indifferent eyes were gazing upon the planet where humans lived.</p><br/><p>Shua!</p><br/><p>With a casual wave of his hand, numerous phantoms surged out. From the throne, numerous wondrous and mysterious rays of light shot out. In the starry sky, these rays of light converged before slowly assuming the shapes of numerous battleships, like they had never been destroyed in the first place, as if nothing had ever happened in this part of the space, as flourishing as ever.</p><br/><p>The night seemed deeper.</p><br/><p>…</p><br/><p>On a certain faraway world, a group of people was working busily. The one leading had a pair of horns on his head. Evidently, this was the Twin Horns World, a world Chen Feng was familiar with.</p><br/><p>\"How's the progress on the trail?\" an elderly voice asked.</p><br/><p>\"We can't follow it.\"</p><br/><p>\"After Chen Feng left, all traces vanished,\" that person reported in shame.</p><br/><p>An angry rebuke resounded. \"Trash! Didn't we let him go on purpose just to discover the planet he originated from? You guys actually failed to tail after him? What's the point of keeping you guys around, then?\"</p><br/><p>From the furious rebuttal, an alarming piece of information was revealed. Chen Feng had actually been released deliberately by them. This was understandable, though. Compared to this mysterious and powerful Twin Horns World, Chen Feng was too weak. If they hadn't intended his escape in the first place, it would have been impossible for Chen Feng to escape.</p><br/><p>\"Chen Feng used an irregular method to leave.\" The person was prostrated on the ground and shuddered as he spoke. \"We tailed after the traces when he left. However, we noticed that the trail led us to a chaotic space where logic did not apply. There are no spatial tunnels there. All the people we sent have died there.\"</p><br/><p>Shua!</p><br/><p>The old man sunk into silence.</p><br/><p>After a long time, his voice, filled with killing intent, resounded, \"In short, you are telling me that Chen Feng entered a sure-death location and hasn't returned to his planet at all?\"</p><br/><p>\"I…\"</p><br/><p>The questioned person did not know how to answer this question. They had originally believed that Chen Feng had returned to his own world. After all, Chen Feng was the only person they had ever seen who was capable of transmigrating independently. As such, they had deliberately allowed his escape. Alas… they had never expected that this would be the result.</p><br/><p>Chen Feng's transmigration wasn't a return to his home world as they had expected. Rather, he had crashed into the spatial currents, a location of sure death. And next… there was no next. Chen Feng was gone. They had no idea if he was still alive. The trail had been severed, rendering them incapable of tailing him.</p><br/><p>Was this some unique method of operation by Chen Feng? The old man muttered to himself for a short period of time before ultimately saying, \"Since this is in past, forget about it. Now, I want you guys to focus on the trails left by Chen Feng and tell me how long will be required before we can enter that world.\"</p><br/><p>The person that was prostrating on the ground said, \"…That is impossible.\"</p><br/><p>The old man's voice became sharp as he asked, \"Why?\"</p><br/><p>The person spoke in a daze. \"The departure of Chen Feng and Kong Bai severed all sources of information. We will forever be unable to reach Chen Feng's world.\"</p><br/><p>Bang!</p><br/><p>The aura of the old man engulfed the entire world in his anger, causing countless people to tremble in fear. As for the person that was prostrated before the old man, he was sweating profusely, yet he truly had no other choice. Sometimes, no meant no.</p><br/><p>\"Ah ah ah ah ah ah—\" The old man was furious. \"Will we be trapped here forever? Do we truly have no hope?\"</p><br/><p>His overcast cry resounded. There were no replies. This unique world, this Twin Horns World, still operated by the mode set by him.</p><br/><p>…</p><br/><p>At the center of the Land of Legacy, Chen Feng's group had just finished dealing with Duma. When Xiao Ying had attacked the pink energy, they had finally been able to see the person behind the scenes, their true enemy.</p><br/><p>Alas… beyond their wildest imaginations, this enemy was actually…</p><br/><p>Qin Hai's expression changed greatly. \"Why is it you?\"</p><br/><p>Shua!</p><br/><p>A powerful shockwave spread out. In the sky, a boundless radiance started converging together.</p><br/><p>Shua!</p><br/><p>Light swirled around. A scene in the Land of Legacy appeared. Here, the Land of Legacy had seemingly returned to its initial state where everything was still normal. At that time, Duma had just ended his seclusion. In the scene, Duma's expression did not seem too calm. He seemed to have found out about something. After picking up some stuff, he entered seclusion once again.</p><br/><p>\"Those things…\" The little turtle was shocked. He was the only one who knew the functions of these things. Each time he had been revived by the old man after being eaten, it had been using these things.</p><br/><p>This is… time restoration!</p><br/><p>Bang!</p><br/><p>Duma destroyed the timeline forcefully. From amid the myriad timelines, he restored time and ultimately rescued a certain person from the river of time. The person rescued was the woman that had been killed by Chen Feng previously, Qin Hai's senior apprentice sister, the pink diamond who had been rumored to be capable of controlling all life-forms. This was Duma's strongest ability: resurrection!</p><br/><p>Qin Hai took in a deep breath. \"Master actually resurrected senior sister.\"</p><br/><p>\"This fellow…\" The little turtle was similarly horrified. He was, in fact, a spirit body; hence, resurrecting him wasn't too big of a deal, as it was not in violation of any laws. Yet resurrecting that woman… Duma would have to exhaust a huge amount of his power. Indeed, after the resurrection, Duma's strength declined greatly. As for the one resurrected by him, the senior apprentice sister that had returned, she had changed somewhat.</p><br/><p>And next, something scary happened. The pink energy engulfed the world. This pink-diamond senior sister with the ability to charm the world had evolved. From controlling beasts, she had evolved and become the controller of everything. Ultimately, the entirety of the Land of Legacy had fallen under her control.</p><br/><p>Shua!</p><br/><p>Light swirled around. The pink and light that filled the sky vanished without a trace.</p><br/><p>They raised their heads and gazed over. From the depths of the pink Land of Legacy, a figure they were all familiar with was slowly walking out. On her forehead, the pink diamond shone dazzlingly. Her seductive figure swayed about and her rich chest bounced about. The one that had been pulling the strings behind the scene was precisely Qin Hai's senior apprentice sister.</p><br/><p>Qin Hai sighed. \"Senior sister…\" Prior to this, who would have guessed that the one hidden behind the scenes was his senior apprentice sister? But then, it was understandable. Only his senior apprentice sister's charming ability would be able to affect everyone here.</p><br/><p>The senior apprentice sister spoke with a smile. \"Long time no see, my junior brother.\"</p><br/><p>\"Why?\" Qin Hai could not understand her reason for doing this.</p><br/><p>\"Because you all deserve death.\" The senior apprentice sister's expression became cold. \"I sent my distress signal, and someone obviously received it, yet nobody came. I waited until the final moment before I was killed by that little girl. Nobody came… You all deserve death!\"</p><br/><p>Qin Hai sank into silence. The one to receive the distress signal back then had been him. At that time, his senior apprentice sister had been controlling the devils to attack Star City. Chen Feng had been defending there, and Wang Yao had been in charge of assassinating this senior apprentice sister. The only thing he had been able to do to help was to sever all of his senior apprentice sister's reinforcements, as he was ultimately still a human.</p><br/><p>\"How about Master?\" Qin Hai focused his gaze on her. \"Master treated you like his own daughter. He even resurrected you! Is this how you repay his kindness?\"</p><br/><p>\"Kindness?\" The senior apprentice sister started laughing wildly. \"Whatever kindness it was, it is still no match for you, right? That old bastard obviously saw through your real identity long ago. He obviously saw through the fact that you are human long ago… Hehehehe.\" Senior apprentice sister's voice became sharp. \"Yet he decided to conceal everything, causing my death!\"</p><br/><p>Qin Hai's heart thumped wildly.</p><br/><p>Saw through…</p><br/><p>Identity…</p><br/><p>It seemed like he had been seen through by his master long ago? That was understandable. He was one who had traveled through time several millenniums into the past. There were some things his fellow apprentice brothers and sisters couldn't remember, but it was impossible for his master to not remember it. He had ultimately underestimated Duma. But then, his master had actually chosen not to expose him! Why?</p><br/><p>\"Because he has grown old. He has already lost the burning spirit he once had when he was younger. He wished to stay out of everything, including his disciples. He claimed that if he employed his power of time excessively, he would suffer retribution. Therefore, I became curious if he can still use the power of time. Indeed, he once again employed his power of time to resurrect me. And next, he indeed suffered retribution. He had believed that that would be sufficient to pay me for the betrayal I suffered…</p><br/><p>\"How is that possible? I hate you, I hate Chen Feng, I hate all of you! None of you will ever know how scary that little girl Wang Yao is. None of you will ever understand what it feels like when your heart is stabbed by her. That feeling… is no different than being in hell!</p><br/><p>\"That little girl has a scary power capable of delivering one the utmost suffering. I dithered between life and death. I sought survival amid the primal chaos and couldn't die for real even when I wanted to… You all will never be able to imagine what I experienced after my death!\"</p><br/><p>The senior apprentice sister's furious voice had a trace of fear mixed in when she talked about her experience. Chen Feng and Qin Hai exchanged glances and were both shocked. Utmost suffering…seeking survival, couldn't die for real even when she wanted to… Was this the fate of all killed by Wang Yao?</p><br/><p>Moreover, Chen Feng could keenly feel that despite the intense hatred this senior apprentice sister was feeling, not an ounce of the hatred was directed against Wang Yao. Why was that? She was afraid… even Chen Feng could hear her fear toward Wang Yao. Was this a shadow left in her heart after being killed by Wang Yao?</p><br/><p>Or was it because…</p><br/><p>Bang!</p><br/><p>The terrifying pink energy surged sharply. Finally, the senior apprentice sister erupted with her powerful might.</p><br/><p>\"I will kill all of you!\"</p><br/><p>Her killing intent surged.</p><br/>\n</div>"}