{"title": "Chapter 657: How Did They Die?", "id": 657, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-657-how-did-they-die", "volume_title": "Volume 7", "body": "<h1>Chapter 657: How Did They Die?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 657: How Did They Die?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Bang!</p><br/><p>The out-of-control truck charged over.</p><br/><p>Damn it!</p><br/><p>Chen Feng clenched his fists tightly, yet he was unable to participate in what was happening. The only thing he could do was watch on as the family of three retreated to the corner of the street until there was no longer any way to retreat. He could only watch on as that truck charged over, violently destroying everything in its path and reaching the family of three.</p><br/><p>Hum—</p><br/><p>At this instant, the world before his eyes seemed to be cracking. This was the traces of his memory being erased. The moment this family of three was killed, Chen Feng would also cease to exist. Right at this instant, he felt a faint green radiance flash around him, and a powerful primordial aura appeared once again.</p><br/><p>This aura only appeared for a split second before it was completely erased. However, Chen Feng still smiled, as at this moment, the world around him seemed even more alive. He could even feel the rain pattering on his face. He had finally fully descended to this world. He raised his head, looking at the despairing expression on the couple's faces. He looked at the truck that was about to crash into the child. Lightly, he stepped forth.</p><br/><p>Shua!</p><br/><p>Just like that, he appeared before the truck.</p><br/><p>A loud boom resounded. </p><br/><p>Bang!</p><br/><p>The truck crashed onto his body as Chen Feng seemed to sink into the truck, causing the truck to be incapable of moving forth any farther. All around Chen Feng, the world lapsed into silence.</p><br/><p>\"Go,\" Chen Feng said. Before others could even react to this, he left with the family of three, leaving behind only the destroyed truck. After a long time, several black-clothed men appeared there.</p><br/><p>\"The target escaped. Seems like some outsiders have appeared. We felt some unusual power earlier. Hehe... Lock on to that person's coordinates. Regardless of who the outsider is, I want them to die.\"</p><br/><p>\"Yes.\"</p><br/><p>…</p><br/><p>Not far away, within a hidden room, Chen Feng was looking at the dumbstruck family of three before him. Evidently, the supernatural strength Chen Feng had demonstrated earlier had shocked them.</p><br/><p>\"Supernatural powers… exist for real?\" The middle-aged man was so agitated that he couldn't speak coherently.</p><br/><p>Chen Feng: \"…\"</p><br/><p>If his guess was correct, this was his father, Chen Jianguo. From the name itself, one could see how amazing he was. As for the woman hugging the child, that should be his mother. As for her name…Chen Feng did not seem to remember it. Back then, the actual incident had been quite simple. In some archaeology assignment, Chen Jianguo and his wife had both died. Next, Chen Feng had been sent to an orphanage. That was all that had happened.</p><br/><p>Was it the accident earlier? Chen Feng frowned and denied this thought. The accident earlier had obviously been trying to kill even him. History was being disturbed…</p><br/><p>Hum—</p><br/><p>A faint green radiance flashed past. Some information was hidden within. After transmitting this intermittent message, the green vanished again.</p><br/><p>\"Kindness… Thank… Revise… History… By no means… To disturb…\"</p><br/><p>Chen Feng heard the message and could only smile bitterly. Was this fellow feeling thankful for Chen Feng's appearance, which had shifted the attention of that complete primordial item to himself and away from the fragments, thus it appearing here to repay Chen Feng? This truly caused him to be speechless.</p><br/><p>But then, if that was truly the case, the only reason he had appeared here was to repair history, to put everything back on the right track. He could absolutely not allow his parents to suffer from some mishaps at an earlier date. He also had to ensure that they both did not survive the accident that was supposed to kill them, leaving him an orphan. That was because the moment they survived, Chen Feng's timeline would be thoroughly altered. Nobody knew what would be the result of that. If that caused Chen Feng to not transmigrate, to not become strong…</p><br/><p>Perhaps every incident related to Chen Feng might change as well. The Genetic Union might face danger, and everyone he knew would probably die. The descent of this unique primordial item was also something nobody could stop.</p><br/><p>Qin Hai…</p><br/><p>Wang Yao…</p><br/><p>Duma…</p><br/><p>Everyone might suffer. If either the pink power from before or the present mysterious primordial power gained control of this world, great chaos might arise. Even Chen Feng's present world might fall into danger.</p><br/><p>Since the opponent could discover this world through his aura alone, the opponent had to have already discovered the existence of this world. If he died… even if, theoretically, his death would result in his disappearance from history, causing the opponent to lose track of him, as the culprit, this opponent might be able to preserve part of the memory that was supposed to be erased.</p><br/><p>If so… this world might not be able to escape the grasp of this opponent. Chen Feng pondered and understood soon enough.</p><br/><p>\"Erm…\" Chen Jianguo rubbed his hand and cautiously asked, \"Excuse me, may I ask, who are you?\"</p><br/><p>Chen Feng looked at them with a complicated expression. \"Your savior.\" In truth, he did not have strong feelings about his parents. After all, he had grown up in an orphanage. Moreover, his dad had also caused his childhood to be one filled with immensely bad luck. It was truly miraculous that Chen Fang had been able to survive long enough to activate the fate stone. As such, he did not have any intention of allowing the genetic world to be destroyed just so his parents could survive.</p><br/><p>As he thought about it, in the original timeline, it wouldn't be long before his parents died. He recalled the conversation his father had had on the phone earlier. It seemed like he had received another assignment and would settle Chen Feng down before heading out for the assignment. From the looks of it, this was the assignment that his parents would never return from. As such, Chen Feng only needed to escort them to the assignment and ensure that the child was protected.</p><br/><p>Chen Jianguo smiled bitterly. \"Thanks. However, you have yet to answer my question.\"</p><br/><p>Chen Feng shook his head. \"You don't need to know that. Due to some unique reasons, someone is trying to kill you all. My mission is to protect you all. That's all.\"</p><br/><p>Chen Jianguo seemed to understand. \"So that's the case.\"</p><br/><p>He exchanged glances with his wife. It seemed like their assignment had attracted some attention after all. Was this youth the one dispatched to protect them?</p><br/><p>Chen Feng looked at them and said, \"Where is the location of your assignment? I will send you two there before leaving.\"</p><br/><p>\"Qinghe Mountain,\" Chen Jianguo said. \"There, a group of ancient tombs has been discovered. We must arrive there tomorrow.\"</p><br/><p>\"Qinghe Mountain… Tomorrow…\" Chen Feng nodded. \"Got it.\"</p><br/><p>He had some impression of this Qinghe Mountain. It seemed to be a mountain range near his ancestral home with rather dangerous topography. With the rain from the past two days, the ground was filled with mud, further increasing the danger there.</p><br/><p>If it was the group of ancient tombs there…</p><br/><p>Qinghe Mountain…</p><br/><p>Suddenly, Chen Feng was startled. He had once seen a relevant piece of news. He had once tried investigating the trails of his parents and had also studied a bit about this place. For example, this Qinghe Mountain had encountered an extremely rare torrential rain, causing a flash flood and a large landslide. From the looks of it, his parents had encountered some large-scale natural disaster while on their assignment there.</p><br/><p>So that was the case. So this was how his parents had died. The things that he had been confused about had finally been cleared up He recalled that the landslide would happen tomorrow night. In other words, after sending his parents over tomorrow, they would die on that very night.</p><br/>\n</div>"}