{"title": "Chapter 662: Holy Shit, Why Are You Here?", "id": 662, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-662-holy-shit-why-are-you-here", "volume_title": "Volume 7", "body": "<h1>Chapter 662: Holy Shit, Why Are You Here?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 662: Holy Shit, Why Are You Here?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Somewhere, Chen Feng watched on silently as the Qinghe Mountain disaster unfolded. He saw everything, yet he was unable to change anything, since this was the correct event for this timeline. Or, to be more precise, he could not change anything. He watched on until he sensed a familiar aura. This was the aura of the gene reagent he'd produced the other day. It had been used!</p><br/><p>Used?</p><br/><p>Chen Feng gazed ahead.</p><br/><p>This should not be considered as changing history, right? After all… everything is still the same as the correct history.</p><br/><p>Shua!</p><br/><p>A slight ripple appeared in his memories, yet his memories remained nearly unchanged. He checked his memories. Regarding the fate of his parents, there had been numerous reports and numerous conclusions, with 99% of them believing that his parents had died and 1% of them believing that his parents had gone missing.</p><br/><p>These were the original reports he had received. However, now that he checked his memories, it was still a mixed conclusion of dead and missing, yet the number of reports believing that they had gone missing had increased by a bit.</p><br/><p>Naturally, these reports had all been issued during the initial few days after the incident. After several years, since the Chen couple had not shown themselves, the ultimate conclusion drawn had been their death.</p><br/><p>Chen Feng heaved a sigh of relief. \"There are no major changes to my memory. Everything is as usual.\"</p><br/><p>As for his parents… Chen Feng recalled the function of that gene reagent and felt at ease. He inhaled deeply. This was the most he could do. This should not be considered cheating, right?</p><br/><p>\"Let's go.\"</p><br/><p>Chen Feng moved once again. Hugging a child, he vanished amid the darkness. Since he was already done dealing with his parents, this was the end of this part of the mission. He believed that the consciousness that was also the culprit of this was incapable of doing too much here, since that consciousness had to comply with the laws of this world and could only make use of forces available in this world.</p><br/><p>Thus, the next thing Chen Feng needed to do was safely deliver this child to where the child was supposed to be.</p><br/><p>Late at night, Chen Feng was streaking forth amid the darkness. Based on his speed, in around 10 minutes, he would reach his destination. At that point, his time in this world would probably end automatically. That hidden culprit could only try changing history through derailing the path of his parents. Now that Chen Feng was done dealing with his parents, the culprit shouldn't have any other methods of changing history.</p><br/><p>Perhaps even the culprit had never imagined that the world Chen Feng had been born in was a world where no special abilities existed, a world fully populated by ordinary people.</p><br/><p>As such, in the Primordial Era, that culprit had been able to get countless people to chase after Chen Feng, yet here, everyone that culprit threw at Chen Feng, Chen Feng could easily deal with. But then, it was still better to be safe. Chen Feng didn't know what the culprit would try to pull this time. For example, a guided missile or something similar.</p><br/><p>As such, Chen Feng traveled with the child in his embrace while his vigilance was at its peak. However, even after reaching the urban district, still no enemies were found.</p><br/><p>Chen Feng narrowed his eyes as he wondered, Has the culprit given up? He entered the urban district, returning to the place he was so very familiar with before passing the baby on to the old granny.</p><br/><p>Hu—</p><br/><p>It's over.</p><br/><p>He could feel space start trembling lightly around him. Based on his previous experience, this was a sign that his time here in this world was ending. Soon, both he and that consciousness would disappear from this world.</p><br/><p>Alas, right at this instant, an ear-piercing alarm buzzed. This was a type of alarm Chen Feng had never heard even after living in this world for over 20 years, a sound he had only ever heard from the TV. This was the city alarm!</p><br/><p>What?</p><br/><p>Chen Feng raised his head. Instantly, his pupils shrunk. There, in the distant sky, a dreadful thing was approaching at a terrifying speed. That was a nuclear warhead!</p><br/><p>Chen Feng's expression changed. \"Shit!\" Nuclear warhead! How had this thing appeared here? They were inland—it shouldn't have appeared here. However, this thought merely flashed through his mind before he stopped thinking about it. With that culprit guiding the events of this world, was there anything that was truly impossible? Perhaps he had guided a group of people to attack, and also guided a group of people to give up on their defenses…</p><br/><p>In any case, it was pointless to think of all that. His biggest concern at present was getting rid of that incoming warhead.</p><br/><p>Chen Feng was sure that the target was this city. Right before their departure, a nuclear warhead had been deployed to the city Chen Feng was at. Next… There would be no next. Chen Feng was sure that the instant this thing landed, the entire city would be destroyed.</p><br/><p>Chen Feng inhaled deeply. \"How vicious.\" That consciousness was capable of familiarizing with the systems of this world in such a short period of time and was even capable of guiding a certain elite of this world to launch this nuclear warhead by force. All this was for the sake of erasing Chen Feng from existence, even at the cost of millions of lives. Chen Feng's decision to come to Mysterious Town to put an end to this thing had indeed been the correct choice.</p><br/><p>Chen Feng's eyes gleamed coldly. \"Something like you should never be allowed to fully come into being.\"</p><br/><p>Shua!</p><br/><p>His body soared. The spatial undulations around him were getting more and more intense. During these final moments, it was evident that even that consciousness was afraid of receiving the backlash of the laws of this world. After all, that consciousness would most probably receive a rather grave backlash from the act of changing the course of history.</p><br/><p>As such, the consciousness had selected the final moment before their departure before launching the nuclear warhead. After launching the warhead, the consciousness would depart directly. With this, the backlash could be evaded. And next, whatever destruction happened after the warhead landed would be unrelated to that consciousness.</p><br/><p>\"Is this what you intend to do?\" Chen Feng inhaled deeply. \"Come, then.\"</p><br/><p>Bang!</p><br/><p>Instantly, Chen Feng's body streaked forth. For the first time, his awakened power was fully unleashed. With his incredible prowess, he streaked forth, instantly covering a great distance and reaching the nuclear warhead at the exact moment when the warhead was flying over the sea.</p><br/><p>Chen Feng punched at it ferociously.</p><br/><p>Bang!</p><br/><p>Hum—</p><br/><p>A terrifying might bloomed and a dreadful heatwave swept out, blasting Chen Feng away instantly. The entire world was seemingly enveloped by a scorching white.</p><br/><p>Hum—</p><br/><p>A familiar radiance flashed before his eyes. Before he could experience the might of a nuclear weapon, he returned to the Genetic Era, to Mysterious Town. All around him, the town was still as brightly lit as ever.</p><br/><p>Returned?</p><br/><p>Chen Feng shut his eyes. Indeed, he had returned. As for that nuclear warhead…</p><br/><p>Chen Feng dug deep into his memories and found nothing related to the nuclear warhead at all. The only thing he found was the news reporting that a huge flame had blazed at the sea, creating quite a wondrous landscape there.</p><br/><p>The news was covered up… Chen Feng contemplated. In any case, that was also a good thing.</p><br/><p>\"I wonder if my body is actually capable of resisting a nuclear blast.\"</p><br/><p>Chen Feng smiled self-mockingly. Instinctively, he cast his senses all over his body. Instantly, he blanked. The purple dot had vanished.</p><br/><p>Chen Feng was stunned. \"Gone?\"</p><br/><p>Hold on…</p><br/><p>Why was it gone? Wasn't that thing something that had been imprinted on his very soul? Nothing had changed when he'd returned. If so, why was the purple dot gone?</p><br/><p>Chen Feng frowned. \"Was it a counterfeit?\" Just as he was about to say something, his blanked as he stared at a familiar item floating before him—the pen that should have stayed on Earth. This thing had actually followed him back to the Genetic Era!</p><br/><p>Chen Feng's eyes widened. \"Could it be…\" This thing was actually able of concealing itself in the purple dot and following Chen Feng back to this world?</p><br/><p>Holy shit!</p><br/><p>Instinctively, his hand reached out toward the pen. Next, a familiar power gushed out.</p><br/><p>This was…</p><br/><p>The power of luck!</p><br/>\n</div>"}