{"title": "Chapter 679: Finally Reaching the Treasured Land", "id": 679, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-679-finally-reaching-the-treasured-land", "volume_title": "Volume 7", "body": "<h1>Chapter 679: Finally Reaching the Treasured Land</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 679: Finally Reaching the Treasured Land</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At this time, on a certain world, Chen Feng and Kong Bai were both dumbstruck as they regarded this wondrous world, feeling like they had both transformed into a certain dot that was moving on a piece of paper. Up and down? This was a world without such a concept.</p><br/><p>\"How mystical,\" Kong Bai exclaimed in admiration. He had never seen such a mystical world before. Curiously, although the height of the topography around him wasn't the same, no constructions could be seen here.</p><br/><p>Chen Feng cast his senses around. \"Some weak energy can be felt here.\"</p><br/><p>Kong Bai was overjoyed. \"Yeah, it's just nice. I can recover some of my energy.\" The continuous transmigrations had rapidly drained his energy. If possible, it would be better to recover his used energy as soon as possible. Otherwise, if he was out of energy when they encountered danger, they would be in deep trouble.</p><br/><p>\"Mhm.\"</p><br/><p>The two prepared to take a short break on this special world. Right at this instant, a certain strip rushed at them at high speed. This was literally a long folded strip with some trestle-looking things supporting it. It stopped somewhere before flipping open horizontally. Next, several black dots gushed out of it, standing by its right side. Next, a hole appeared on the ground before a group of people rushed up the strip. Those that had arrived on the strip entered the hole after.</p><br/><p>Hu—</p><br/><p>When all was done, the strip continued forth.</p><br/><p>Kong Bai was somewhat dumbstruck. \"What is that?\"</p><br/><p>On the other hand, Chen Feng gained some understanding.</p><br/><p>\"In short, if this a place where gravity exists, all the buildings of this world are constructed underground. That is the only way that the buildings will not block the sole path one can pass.\"</p><br/><p>Kong Bai blanked. \"What?\"</p><br/><p>Chen Feng rolled his eyes. \"If this is truly a two-dimensional world, this world will resemble the 2D games you have played before. Imagine this: if a building appears suddenly in front of your character, how are you supposed to pass? If everyone constructed their buildings above ground, how are others supposed to live here? What if this world were larger, resulting in vehicles being necessary? Things would be even more troublesome. They can't smash through any building in their way, right?\"</p><br/><p>\"…\" Kong Bai thought about it, and his eyes widened. \"In short, earlier, they were getting on and off a car?\"</p><br/><p>\"Mhm.\" Chen Feng said, \"From the looks of it, all their buildings are underground, and above ground is the perfect transportation system, creating their own unique world.\"</p><br/><p>\"How magical,\" Kong Bai exclaimed in admiration. The cars here moved at an extremely high speed. Since this was a two-dimensional world, nobody was staying above ground.</p><br/><p>However, when that strip-looking car reached them, they encountered an extremely profound problem: they could not avoid it!</p><br/><p>\"Looks like…\"</p><br/><p>\"You are right.\"</p><br/><p>Chen Feng did not know whether to laugh or cry. \"This car moves in a straight line, and this world is shaped like a straight line. Therefore, if we don't avoid it, we will be hit by the car.\"</p><br/><p>\"No matter what, you are still an awakened one, right?\" Kong Bai grumbled.</p><br/><p>Chen Feng sneered. \"Hehe.\" Here in this world, he was but a dot.</p><br/><p>Hua—</p><br/><p>The strip charged at them at a high speed.</p><br/><p>Shua!</p><br/><p>Seeing the incoming strip, Kong Bai had no choice but to transmigrate away.</p><br/><p>Shua—</p><br/><p>The world before their eyes changed rapidly.</p><br/><p>\"My energy is going to be exhausted soon,\" Kong Bai said gloomily. \"Even if we can't recover your Luck Aura, I should be allowed to recover my energy, right? Otherwise, we will die from energy exhaustion.\"</p><br/><p>The burden of transmigrating the both of them was much higher than he had imagined. If this continued, they would not be able to keep transmigrating much longer.</p><br/><p>\"Hopefully… the next destination.\"</p><br/><p>Shua!</p><br/><p>Light swirled around. The instant they appeared, they could feel a surging energy.</p><br/><p>Bang!</p><br/><p>The energy was like a raging tide, instantly submerging the both of them. This was an incredibly dense energy, so dense that merely inhaling it could seemingly bring in countless energy.</p><br/><p>\"How powerful,\" Kong Bai exclaimed in admiration.</p><br/><p>Chen Feng checked instinctively and was instantly overjoyed. \"Luck Aura has recovered.\" His Luck Aura, which had been silent for so long, was once again active.</p><br/><p>Kong Bai was overjoyed. \"Great!\"</p><br/><p>In that case, their mission could be considered complete. This was quite a wondrous world. It contained surging energy and boundless luck.</p><br/><p>Kong Bai became excited. The density of the energy here was too scary. \"Perhaps I can even break through into the awakened realm here as well.\" They had only been here for a short two seconds, yet they could already feel an obvious improvement in their strength. If they could cultivate here…</p><br/><p>For one day…</p><br/><p>No, even for one hour, they would be able to advance a big step forward. This was a speed one could describe with the word scary.</p><br/><p>Kong Bai's eyes widened. \"What place is this, exactly?\" There was actually such a wondrous place for real?</p><br/><p>Chen Feng shook his head. \"No idea.\"</p><br/><p>They looked around and found that they were seemingly within a certain cave.</p><br/><p>\"Let us first confirm that there are no dangers here before beginning our research and cultivation,\" Chen Feng said.</p><br/><p>Kong Bai nodded. \"All right.\"</p><br/><p>Carefully, the two walked to the entrance of the cave, and they were instantly dumbfounded. This cave was actually on a steep cliff. When they looked down, Chen Feng felt like something wasn't right. This place…</p><br/><p>Hu—</p><br/><p>Suddenly, the interior of the cave started trembling.</p><br/><p>Kong Bai's expression changed greatly. \"Not good. This is actually a moving cave.\"</p><br/><p>Shua!</p><br/><p>The caved wiggled and an intense killing intent wrapped around them. Even with Kong Bai's strength, he felt an intense sense of crisis from this. If they stayed, they would most certainly die! What was this cave, exactly?</p><br/><p>\"Leave quickly!\"</p><br/><p>Chen Feng had a rough guess and immediately dragged Kong Bai and leaped out of the cave.</p><br/><p>\"You have gone crazy…\"</p><br/><p>Kong Bai's instinctive reaction was to transmigrate. Based on his past experience, a lot of their genetic abilities were unusable in many worlds. In the majority of alien worlds, they were only slightly stronger than commoners. If they landed on the ground from this height, they would certainly die.</p><br/><p>Chen Feng stopped him. \"Hold on. Trust me.\"</p><br/><p>Swish!</p><br/><p>The two dropped down at a high speed.</p><br/><p>Bang!</p><br/><p>Suddenly, they landed on something soft and very flexible, bouncing them back up only to fall down yet again. This continued on until the force of the fall diminished enough for them to stop bouncing.</p><br/><p>\"Huh?\" Kong Bai did not even have the chance to feel amazed at what had happened.</p><br/><p>Bang!</p><br/><p>From the direction of the cave earlier, a loud booming resounded, as if tens of thousand peals of thunder were rumbling.</p><br/><p>Kong Bai was shaken. \"What place is this?\" A mysterious and dreadful cave, and a flexible landing ground below the cliff. This world seemed like the human world, yet at the same time, it seemed like a different world.</p><br/><p>Chen Feng ignored him. \"Hehe.\"</p><br/><p>Chen Feng's brain operated ceaselessly while they continued escaping without stop. His Luck Aura was fully activated, looking for the coordinates of an acceptable alien world. If possible, when they transmigrated later…</p><br/><p>Chen Feng's brain spun rapidly as he set the criteria for his Luck Aura to work on Kong Bai's transmigration. Since their next destination could very well be one where his Luck Aura was once again inactive, he had to ensure that their next destination would be a world with energy and a world where his Luck Aura would stay active. It also had to be a safe world, a world they would be given sufficient time to do what they wanted. This was what they required, regardless of whether it was in the past or the future.</p><br/><p>Chen Feng looked at Kong Bai as he said, \"Done. Time to transmigrate.\"</p><br/><p>Kong Bai blanked. \"Why are you in a rush?\" Earlier, when things had seemed dangerous, Chen Feng had prevented his transmigration. Now that there was no longer any danger around them, Chen Feng started worrying about transmigration.</p><br/><p>For Kong Bai, this world was like heaven. The energy supply was off the charts. If they could gain a clearer understanding of the behavior of that cave and settle down to cultivate here…</p><br/><p>Chen Feng looked at Kong Bai like he was an absolute idiot. \"You do not want to return to that cave.\"</p><br/><p>\"Pft. A mere cave…\" Kong Bai curled his lips. He raised his head and was instantly alarmed at what he saw.</p><br/>\n</div>"}