{"title": "Chapter 674: Amazingly Amazing!", "id": 674, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-674-amazingly-amazing", "volume_title": "Volume 7", "body": "<h1>Chapter 674: Amazingly Amazing!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 674: Amazingly Amazing!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"Why are you still so calm, then?\" Qin Hai asked with a bitter smile. He could still remember how his master had also put great effort into the affairs of these primordial fragments. Now that this had happened, his master should be the one who was most angered. But it seemed like even if the entire world descended into chaos, his master would remain calm, as if all this was nothing.</p><br/><p>Duma spoke unhurriedly. \"What's the point of being all anxious? Furthermore, compared to that, this is truly nothing.\"</p><br/><p>Everyone raised their head. \"Ah?\"</p><br/><p>\"The Primordial Era… has descended.\" Duma sighed. \"The power of resonance has been unsealed. Above awakened is resonance. But do you guys know what exactly resonance is?\"</p><br/><p>They shook their heads. \"No.\"</p><br/><p>\"Resonance… is exactly what the word implies. Resonance can only arise from at least two powers. The so-called 'awakened ones' refers to those who awaken the innate talent to resonate with certain existences. When these people reach the peak of the awakened realm, when they reach the realm of resonance, they will be able to sense the powers of those formidable existences and become even stronger. Sensing, comprehending, and the final resonance,\" Duma softly said. \"The moment the power of resonance is utilized, those formidable resonances will be able to sense it and will gradually wake up from the boundless darkness.\"</p><br/><p>\"Those existences?\"</p><br/><p>They all blanked. This term was something that they had heard a lot of times before.</p><br/><p>The so-called lord…</p><br/><p>The so-called existences…</p><br/><p>It seemed like each time one referred to the Primordial Era, one would also refer to these terms as well. However, they were still unaware of what exactly these existences were.</p><br/><p>Duma inhaled deeply. \"That's right. Those existences. They were the very sky of the Primordial Era, towering above everyone else, the origin of all formidable powers. Every single powerful primordial remnant originated from them. Every single formidable power of resonance originated from their bodies. Using the terms of the current Genetic Era, they are precisely gods.\"</p><br/><p>Bang!</p><br/><p>Their hearts shuddered.</p><br/><p>Gods? They existed for real?</p><br/><p>Suddenly, Chen Feng recalled Dream Recall Bell's reaction earlier. \"What the Dream Recall Bell was afraid of…\"</p><br/><p>\"That's right. The bell feared these existences as well.\" Duma shook his head. \"The bell was the creation of a god, yet it tried to erase the traces of the existence that had created it. As such, it feared the gods greatly, as it was very clear on how terrifying those existences could be.\"</p><br/><p>So that's the case. Chen Feng understood now.</p><br/><p>Gods…</p><br/><p>Above awakened would be resonance. And above resonance would be godhood.</p><br/><p>As for gods, they were the strongest existences of the Primordial Era.</p><br/><p>\"Since even gods exist, things won't be that bad, right?\" asked.</p><br/><p>\"…\"</p><br/><p>Duma looked at Xu Fei like he was an absolute idiot and slowly said, \"Child, you must know that even among the countless primordial fragments, there are good and evil ones… The same applies to humans as well. If so, the gods…\"</p><br/><p>Duma shook his head.</p><br/><p>Xu Fei's eyes widened. Holy shit! There were evil gods as well?</p><br/><p>Xu Fei was speechless. \"Those fellows want to conquer the entire world as well?\"</p><br/><p>\"Not only that.\" Duma smiled bitterly. \"I have not personally experienced that era. However, from the memories in my bloodline inheritance, the descriptions for certain existences are indeed rather horrifying. For example, a certain existence is of the opinion that all living beings are disgusting and deserve to be purified.\"</p><br/><p>Kong Bai blanked. \"Purify?\"</p><br/><p>Duma spoke unhurriedly. \"Mhm, purified. Reconstruct the physical body, wash the very soul, and return the living beings to their origin.\"</p><br/><p>Kong Bai was thoroughly dumbstruck. \"??? Isn't that the same as being dead?\"</p><br/><p>\"Yes. As such, purifying is deemed an act of cleaning the world. That lord, from the beginning of his existence, has been busy purifying the world. He even has a ground of fanatical believers.\" Duma smiled bitterly. \"Oh, right, there's also a certain lord who believes that there is an inherent problem with this world.\"</p><br/><p>They all blanked. \"What?\"</p><br/><p>There's a problem with this world?</p><br/><p>Duma sighed. \"Yes. That lord believes that this world is too small and weak. As such, he intends to combine this world and all other worlds together, creating another big bang, creating a whole and powerful world, a flawless utopia capable of containing all life-forms.\"</p><br/><p>As they heard this, they were all stupefied. Combine all worlds together?</p><br/><p>Chen Feng rolled his eyes. \"What about the present life-forms on these worlds? They should just die?\"</p><br/><p>Duma calmly continued, \"Yes. After all, for the good of the big world, the sacrifice of some insignificant life-forms is inevitable and negligible. This is this lord's belief. He has been faithful to this belief, never changing. If we have to describe him with a modern term… Mhm… Perhaps he would be quite similar to the God of Destruction in human literature.\"</p><br/><p>Chen Feng: \"…\"</p><br/><p>These gods, these so-called lords, were truly…</p><br/><p>\"Oh, right, there are some others.\" Duma pondered deeply before saying, \"There is a certain powerful goddess that believes that all males are filthy life-forms and should either all be purged or have their genders changed.\"</p><br/><p>Shua!</p><br/><p>Everyone looked at Chen Feng.</p><br/><p>Chen Feng rolled his eyes. \"Why are you all looking at me?\"</p><br/><p>They laughed dryly. \"Hehe.\" Chen Feng was way too skilled in terms of changing genders. Perhaps in the future, he would be that goddess's number one underling. Naturally, he would have to first \"purify\" himself for that to happen.</p><br/><p>\"There is another lord that believes that love between two of the same gender is a sin… There's also another powerful existence that believes that love between two of different genders is filthy. These two lords have been waging war against each other since time immemorial, never stopping.\"</p><br/><p>Everyone: \"…\"</p><br/><p>Were these fellows truly gods?</p><br/><p>\"These gods are all extremely powerful. They possess the most original of powers. All the powers, the abilities we use, originated from these origin powers.\" Duma sighed. \"As for resonance… it is an act of sensing the origin powers of these existences to improve oneself.\"</p><br/><p>Qin Hai was doubtful. \"I have a question. Since they are so powerful, why did they disappear in the first place?\"</p><br/><p>In the long river of history, after the Primordial Era, all the gods had cleanly vanished. That was also why the gods had started to become nothing but legends.</p><br/><p>Respect surfaced in Duma's eyes. \"They were all sealed. Just as I said earlier, there were also good and evil ones among the gods. The good and evil here is by our definition. Since there are gods that want to destroy all life-forms, there are also gods that want to protect all life-forms. It seems like there will always be an opposing god for each god of a certain belief. As such… the War of Primordial Gods erupted.</p><br/><p>\"Toward the end of that war, all the gods were weary and exhausted. As such, the countless gods on the side of life and goodness joined hands to seal all forces, including themselves. The sealed gods did not die. However, due to the loss of their powers, they slowly grew old. Ultimately, they dissipated amid heaven and earth. This has remained throughout the ages. And now… as the seal on resonance has been lifted, the power of resonance will start being used, and the consciousnesses that have dissipated amid heaven and earth will converge slowly and once again come into being.\" Duma finished his explanation slowly, his tone respectful: \"With that, the Primordial Era will descend completely. Those gods will once again return.\"</p><br/><p>Although the stories of these primordial gods seemed like some sort of propaganda, with these gods depicted in an overly kind manner, it was precisely these gods that had ensured the continuation of life. These gods that had fought for their continuation were deserving of respect.</p><br/><p>So that's the case.</p><br/><p>Everyone fully understood now. So this was why they had been avoiding resonance? Resonance would actually awaken the gods? Everyone was shocked. While everyone was in the midst of shock, Chen Feng quietly pulled out the pen.</p><br/><p>Holy shit, this pen is so amazing?</p><br/><p>Just like that, he had pierced through the seal that had been created jointly by so many gods with this pen? He gazed at this pen, feeling like this pen was indeed incredibly amazing.</p><br/>\n</div>"}