{"title": "Chapter 682: Of Sins and Grudges", "id": 682, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-682-of-sins-and-grudges", "volume_title": "Volume 7", "body": "<h1>Chapter 682: Of Sins and Grudges</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 682: Of Sins and Grudges</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>In the Gene Production Association, the group of gene producers headed by Hu Feng were extremely anxious.</p><br/><p>\"Is Chen Feng not back yet?\"</p><br/><p>\"No.\"</p><br/><p>\"Aren't we supposed to be conducting the research together?\"</p><br/><p>\"Oh… he mentioned that he can do it alone,\" the assistant said in a low voice while scratching his head.</p><br/><p>\"He is behaving too willfully!\" Hu Feng was so angry that his white beard trembled. Going at the research alone? Was that even possible? Their group comprised of ten-odd master producers had researched it for so long without success. Any problem that could be solved with the help of technology or individual skills, they had already solved. At present, the only thing they lacked was enough experimentation to reach the final result.</p><br/><p>They would have to keep on experimenting until the latest workable version of the gene reagent was produced. They had initially hoped that Chen Feng could perhaps inject some fresh ideas into their research, somewhat accelerating the process. Unexpectedly, that fellow had never intended to even come here.</p><br/><p>\"That kid is getting more and more egotistical.\"</p><br/><p>Hu Feng was furious. He was part of the eldest generation still alive in the Gene Production Association and had always maintained a rather low profile, never involving himself in any competitions. He had only been silently giving all he could. He was a person of astonishing skill in gene production, and the person in charge of this research. For this gene reagent, their group had worked hard for a long time.</p><br/><p>\"Even if he is the one who created the beyond X gene reagent, there is no need for him to be so arrogant, right?\"</p><br/><p>Hu Feng was furious. He was aware that Chen Feng had was highly skilled in gene production. However, this matter pertained to the future of humanity. Would it be that hard for him to work with others for the sake of humanity? If everyone worked together, perhaps the research could be conducted even faster.</p><br/><p>\"…\"</p><br/><p>Everyone else could only smile bitterly as they heard this. So what if Chen Feng was egotistical? After all, that Chen Feng was the nominal number one gene producer in the world. This coupled with his unique identity and status made him a person nobody dared offend.</p><br/><p>\"Let me go look for him,\" Hu Feng said after inhaling deeply.</p><br/><p>Their heads ached greatly. \"But he has already entered seclusion…\"</p><br/><p>\"Even if he's in seclusion, we must get him out! Even if we have to beg, we have to beg him out of the seclusion!\" howled Hu Feng. \"These two days, more and more awakened ones have appeared. The Genetic Union will soon be unable to endure this pressure. If this drags on… something bad might truly happen. Do you all truly want to see a world where awakened ones walk everywhere, completely out of control?\"</p><br/><p>As they heard this, they all sank into silence. They were all too clear on how strong awakened ones were. Each of them was fatally dangerous, far surpassing nuclear weapons, possessing the strength to easily destroy an entire city if they so wished.</p><br/><p>If people like these were everywhere and were not subjected to any sort of control… The mere thought of this scene caused them all to be soaked with cold sweat.</p><br/><p>Hu Feng sighed as he said, \"Chen Feng's talent is above ours. Even in terms of technical skill alone, he is able to provide ideas that we have never thought of before. That will likely be helpful for our research. \"Therefore, we must find him.\"</p><br/><p>Everyone exchanged glances and nodded in agreement. Perhaps… Chen Feng could truly accelerate the research. And thus, the group arrived at Chen Feng's place of seclusion.</p><br/><p>Hu Feng took in a deep breath. \"Let me.\" Forcing someone out of seclusion was considered extremely rude, especially for someone with such a terrifying status as Chen Feng. From the moment Hu Feng had decided to step out, he had been prepared to suffer the consequences of his actions.</p><br/><p>However, before he could even call upon the door, the door opened. Chen Feng and an ugly male walked out of the room. On the face of that astonishingly ugly person was a trace of an indescribable and complicated emotion, akin to the indignation one felt after being raped.</p><br/><p>???</p><br/><p>They were all dumbstruck as they saw this.</p><br/><p>Weren't such seclusion rooms places people normally only entered alone? After all, the act of secluding oneself was so one could focus on the task at hand and avoid the interference of others. Yet now, with this scene they were seeing…</p><br/><p>They all thought of one single possibility for this and inhaled deeply in shock.</p><br/><p>Hiss—</p><br/><p>Could it be…</p><br/><p>\"This…\"</p><br/><p>The Hu Feng, who had still been so furious earlier, was dumbstruck as he saw this. He wanted to say something but decided against it, since this was, after all, too private an affair for him to comment on. He was truly too embarrassed to say anything about it. This was especially true since, in recent times, the movements protecting the rights of the LGBT community had been gaining quite a bit of momentum. Hence, Hu Feng did not dare comment on this \"preference\" of Chen Feng's.</p><br/><p>Hu Feng felt somewhat awkward. \"Sorry. I am not aware that you two are…\"</p><br/><p>\"What in the world are you trying to say?\" Chen Feng gave them a curious glance before saying, \"Forget it. It's just nice that you guys are here. This is the gene reagent I have just produced. You guys can try it out.\"</p><br/><p>???!</p><br/><p>Their eyes widened.</p><br/><p>\"Gene reagent?\"</p><br/><p>\"You are already done with the research?\"</p><br/><p>\"How is that possible?\"</p><br/><p>They all stared at Chen Feng, disbelieving.</p><br/><p>Shua!</p><br/><p>Hu Feng grabbed the data given by Chen Feng in a rush and started looking at it. Within were a lot of problems they had encountered in their research. Chen Feng had seemingly solved all their problems.</p><br/><p>Bang!</p><br/><p>Shaken, they all surrounded the formula, wishing they could test it immediately. As they checked the data, they found that everything recorded within was correct! Chen Feng had truly succeeded!</p><br/><p>\"All of it is correct!\"</p><br/><p>\"So this is how it should have been done? Hahaha.\"</p><br/><p>Hu Feng was overjoyed. After confirming that the solutions given for three particularly tricky problems were indeed the correct solutions, he knew that this data given by Chen Feng was indeed correct. This was indeed the proper formula!</p><br/><p>An undertaking that ten-odd master producers hadn't even been able to estimate a completion time for had been completed just like that by Chen Feng in three mere days. Truly astonishing.</p><br/><p>They looked at Kong Bai. \"This person…\"</p><br/><p>\"Oh, he's also an awakened one as well. He came here to assist me in the research,\" Chen Feng said calmly.</p><br/><p>Hu Feng was ashamed. \"Sorry. I previously thought that…\"</p><br/><p>He was truly ashamed. Chen Feng had been working hard for the sake of humanity, yet he was here thinking dirty thoughts about the man. This was truly an insult to Chen Feng. As such, he believed that he owed Chen Feng an apology. However, before he could even finish his apology, the others around him all blocked his mouth, stopping him from continuing on.</p><br/><p>\"Wu…\" He couldn't say anything anymore.</p><br/><p>Chen Feng looked at them curiously. \"What are you talking about? What did you believe?\"</p><br/><p>They answered on behalf of Hu Feng and laughed awkwardly. \"Hahaha, nothing much. He initially thought that you were still not done with the research.\" Dragging Hu Feng with them, they left. \"We will go test the formula first. The result will be reported to you later.\"</p><br/><p>Chen Feng rolled his eyes. \"Mhm. Go then.\"</p><br/><p>Kong Bai was still moody. \"Chen Feng, I will not forgive you.\"</p><br/><p>Earlier, when he had used the first-edition gene reagent, he had suffered extreme pain worse than death. As one who had worked hard transmigrating here and there with Chen Feng, he should have gotten to enjoy treatment worthy of heroes, right? Who would trick the people on their side like this?</p><br/><p>\"Well, one has to occasionally make some small sacrifice for the sake of humanity, right?\" Chen Feng comforted him.</p><br/><p>Kong Bai raged. \"I quit! Why don't you try it yourself?\"</p><br/><p>\"Pft, you are merely afraid of pain…\" Chen Feng muttered. Noticing that Kong Bai's expression was becoming even more furious, he coughed immediately and said, \"I am already an awakened one, right? How am I supposed to try it? Mhm, how about I give you some compensation for your work?\"</p><br/><p>Kong Bai sneered at that offer.</p><br/><p>Chen Feng raised his brow. \"What if I introduce you to a girl?\"</p><br/><p>\"Not a male?\"</p><br/><p>\"No.\"</p><br/><p>\"Not a member of the ancient race?\"</p><br/><p>\"No.\"</p><br/><p>Kong Bai's eyes shone. \"You really have a girl to introduce me to?\"</p><br/><p>\"Of course.\" Chen Feng grinned and said, \"Don't worry. She is amazing and extremely beautiful. Here, this is her picture. Take a look. If you find her agreeable, I can bring you to her immediately.\"</p><br/><p>\"This… Wow, so pretty! Go go go!\"</p><br/><p>Kong Bai was excited.</p><br/><p>Chen Feng brought him to Xiao Yue's home. Surprisingly, the door, which had always remained open, was presently locked. On the door were several words:</p><br/><p>----</p><br/><p>How have I sinned? – Xiao Yue</p><br/><p>----</p><br/><p>Chen Feng: \"…\"</p><br/><p>Tsk. She had to have seen this scene when she had been using her drawing ability. Well then, it seemed like his plan to introduce Kong Bai to Xiao Yue had utterly failed. Seeing such a reaction from Xiao Yue, Chen Feng did not feel it proper to introduce Kong Bai to Xiao Yue. But then, this Kong Bai was truly so ugly that Xiao Yue was not even willing to meet him. Oh well, she herself was probably already aware of Kong Bai's looks from her drawings.</p><br/><p>Sigh.</p><br/><p>Chen Feng was feeling melancholic.</p><br/><p>Kong Bai appeared at a loss. \"What is the meaning of these words?\"</p><br/><p>Chen Feng made up a story. \"I reckon she must have gone into hiding from her enemies. Even you yourself are aware that there has been an increase in the number of awakened ones recently. Perhaps, as a girl living by herself, she had encountered some problems and had decided to leave. Fear not, I have another girl I can introduce to you.\"</p><br/><p>Suddenly, Kong Bai raged. \"Bastard! Even if the primordial is indeed descending, these fellows should not be acting so wantonly! For them to even think of bringing harm to such an adorable girl—truly too excessive! I need to find her! Since she is in danger, I cannot watch on without helping! I believe that my appearance here at this moment is an act of fate so that I can rescue her from danger! Those damnable awakened ones… Hehe… Let me take care of them!\"</p><br/><p>Kong Bai patted Chen Feng's shoulder and said, \"Thank you! When I succeed in my courtship of her, I will most definitely get you to bear witness to our marriage.\"</p><br/><p>Shua!</p><br/><p>Finishing his words, he left, looking for Xiao Yue.</p><br/><p>Chen Feng was dumbfounded. \"What the hell…\"</p><br/><p>Hum—</p><br/><p>His wristband buzzed and a message popped up.</p><br/><p>----</p><br/><p>What grudge do we have? – Xiao Yue</p><br/><p>----</p><br/><p>As Chen Feng saw this, he did not know whether to laugh or cry.</p><br/><p>Miss, I truly did not intend for this to happen!</p><br/>\n</div>"}