{"title": "Chapter 688: Mysterious Swamp", "id": 688, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-688-mysterious-swamp", "volume_title": "Volume 7", "body": "<h1>Chapter 688: Mysterious Swamp</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 688: Mysterious Swamp</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>At this time, those awakened ones that had just entered the forest had just prepared for an all-out battle to obtain the item when the sudden appearance of the tsunami shocked them all.</p><br/><p>\"What the hell is this?\"</p><br/><p>\"Damn it.\"</p><br/><p>\"Why has the water suddenly left the lake?\"</p><br/><p>They were all startled, looking at the incoming hundred-meter-tall wave that left nowhere to hide.</p><br/><p>\"But this water… seems like regular water… right?\" one person said cautiously.</p><br/><p>\"Regular water?\"</p><br/><p>Everyone raised their heads and looked over. Indeed, although the wave seemed rather violent, it seemed like nothing but mere lake water.</p><br/><p>Swish!</p><br/><p>A person tossed a pile of stones, tree leaves, and other random stuff at the water, and all these things remained fine, not suffering any damage, merely becoming soaked. At this, they all heaved a sigh of relief.</p><br/><p>Regular water, huh? The word \"god\" had rendered them scared of every random thing here.</p><br/><p>Shua!</p><br/><p>Someone tried walking through the hundred-meter-tall wave and found that after walking through, he was indeed still fine. Upon seeing this, everyone else started pushing in as well.</p><br/><p>Shua! Shua!</p><br/><p>Numerous silhouettes passed through the wave. Alas, after passing through the wave, they found that the entirety of this forest had seemingly changed, and the water had all vanished as well.</p><br/><p>\"Huh?\"</p><br/><p>\"Where's the lake?\"</p><br/><p>\"This…\"</p><br/><p>They all had odd expressions on their faces. Holy shit, had all of the water in the lake been in the huge tsunami earlier? At this time, within the huge forest, not a drop of lake water could be found, only leaving a huge amount of mud behind as well as numerous trees growing in the mud, giving off a rather sinister feeling.</p><br/><p>Splat.</p><br/><p>Someone had seemingly stepped in something while walking. When he tried walking away, he found with astonishment that an attractive force had appeared, sucking him in.</p><br/><p>\"This…\" His expression changed. \"Quagmire?\"</p><br/><p>He instinctively looked at the person beside him for help. \"Save me.\"</p><br/><p>Shua!</p><br/><p>Everyone around him avoided him.</p><br/><p>What joke was this? Everyone was here to obtain the item left by a god. As such, their relationship could be described with the word \"hostile.\" It was already a good thing for them to not attack him, yet he expected them to save him?</p><br/><p>Hehe.</p><br/><p>Everyone studied the mud beneath their feet cautiously.</p><br/><p>Seeing this, that person snorted coldly. \"Hmph.\"</p><br/><p>Bang!</p><br/><p>Instantly, he chopped his trapped feet off before exhausting a huge amount of energy to reconstruct a brand-new leg. Everyone raised a brow at this sight. So it turned out that this quagmire wasn't fatal? This place where the aura of a god leaked seemed completely different than what they had imagined. The moment they had arrived, a dangerous-looking tsunami comprised of completely ordinary water had surged at them. Next, they had encountered this nonfatal quagmire seemingly only here to jest at them.</p><br/><p>As a place with a trace of a god, shouldn't it be laden with danger?</p><br/><p>Naturally, the quagmire was indeed scary, as the moment one stepped into it, one would not be able to escape without outside help. However, for awakened ones, they could reconstruct their energy body anyway. As such, they did not fear such a quagmire.</p><br/><p>This place…</p><br/><p>Could this be something left behind by a mere awakened one instead?</p><br/><p>Everyone's heart jolted. Perhaps this was a place for nonawakened ones to obtain their inheritance prior to the Primordial Era? Although this quagmire wasn't fatal for an awakened one, it was absolutely fatal for a regular person.</p><br/><p>If that was truly the case…</p><br/><p>Suddenly, the air was filled with killing intent. Everyone looked at each other, killing intent in their eyes. At first, everyone had been of the opinion that this was a dangerous place and so had not dared to act recklessly. Now that they had determined that this place wasn't a threat for awakened ones, the only threat was the other people around them.</p><br/><p>The mood seemed to freeze. Right at this instant, someone took another step forth.</p><br/><p>Splat.</p><br/><p>He stepped into the quagmire as well.</p><br/><p>Bang!</p><br/><p>Without asking for help, he smashed his leg to smithereens immediately to free himself from the mud before reconstructing it. Next, he took another step forth. Yet this time, with astonishment, he noted that he had once again stepped into a quagmire.</p><br/><p>???</p><br/><p>He was somewhat dumbstruck. Something seemed wrong with this?</p><br/><p>Bang!</p><br/><p>Once again, he smashed his own feet to smithereens.</p><br/><p>This time, before taking another step, he looked around carefully and confirmed that it was not possible for this entire piece of land to be an endless quagmire. From the density of this swamp…there was only a 20% probability of one stepping upon a sinking quagmire when walking.</p><br/><p>\"Am I so unlucky?\" he muttered.</p><br/><p>Splat.</p><br/><p>He took another step forth, and his face darkened. He had stepped on a sinking quagmire yet again! This time, the others, who had still been laughing at him earlier, could no longer laugh. What did it mean for this person to hit the jackpot with a mere 20% probability three times in a row? Was he truly so unlucky? Moreover, the other person from earlier had also stepped into a sinking quagmire on his first step.</p><br/><p>At present, a total of four steps had been taken, yet all had been into a sinking spot.</p><br/><p>There ought to be some problem somewhere. Someone else tried taking a step forth.</p><br/><p>Splat.</p><br/><p>Once again, sinking quagmire. The rest tried stepping forth, and with horror, they found that with their very first step, they stepped into the sinking quagmire.</p><br/><p>???</p><br/><p>Everyone was confused. What was going on?</p><br/><p>They all proceeded to destroy and reconstruct their legs. The center of this forest, where that stone was located, was extremely far from this place. If they truly walked forth step by step in this manner, they would exhaust all their energy merely reconstructing their legs. This damnable place!</p><br/><p>Someone felt doubtful. \"With this density, we shouldn't be stepping into the quagmire with every step we take, right?\" If the entirety of this place was in fact a quagmire, this would be a terrifying abyss. Even the mere act of approaching this place would cause one to be sucked into an endless abyss. Yet obviously, this place was just a regular swamp, a swamp formed when the lake tsunami had swept past. How could it…</p><br/><p>They tried walking forth. With horror, they found that the same thing kept happening. With every step, they would sink.</p><br/><p>Finally, their expressions became solemn. \"Something is wrong here!\"</p><br/><p>\"…\"</p><br/><p>Chen Feng watched on silently.</p><br/><p>Earlier, he had also destroyed his own leg and reconstructed it. The same solemn expression was on his face now. However, what caused his face to be solemn wasn't him stepping on the quagmire. Rather, every single step he took had been on solid ground. The only reason he had even destroyed his leg to reconstruct it was to maintain a low profile. Since the several dozen people here had suffered the same fate yet he was fine, something odd had to be happening here.</p><br/><p>\"Is it because of you?\" Chen Feng asked inwardly.</p><br/><p>Spirit appeared to be at a loss as well. \"I don't know. Luck Aura has been trembling all along, yet it is obviously still not working.\"</p><br/><p>\"Then this should be the work of that stone then.\" Chen Feng was somewhat agitated. Could that be yet another fate stone?</p><br/><p>Spirit's eyes widened. \"Then we can walk over directly, right?\" If this was truly the Fate Stone making it difficult for others while opening a path for Chen Feng, why were they still wasting time here? Chen Feng only needed to charge forth directly and he would definitely be able to obtain that stone. As for the others here? They would most certainly encounter various difficulties. The moment Luck Aura was done upgrading, they would no longer have any fear of the others here.</p><br/><p>Chen Feng shook his head. \"There's no rush.\" Without a hundred percent certainty of success, he would most definitely not take any risks. The enemies here were not mere awakened ones. There were also resonators here as well…</p><br/><p>If one dared take these people lightly, one would suffer a miserable death!</p><br/><p>Chen Feng continued mixing with the bunch of awakened ones, maintaining a low profile. At this time, some people who had been walking forth amid the swamp were finally getting impatient.</p><br/><p>\"What damnable place is this?\" a rather rash awakened one said furiously as he reconstructed his leg yet again. Next, he leaped up without hesitation, thinking of passing through this swamp up in the air. The eyes of everyone else flashed. Finally, someone had gathered enough courage to try this.</p><br/><p>Swish!</p><br/><p>That person soared and charged forth. However, before he was airborne for long, his body started swaying before smashing into the ground, directly into the quagmire.</p><br/><p>\"There are indeed some problems up there as well.\"</p><br/><p>Everyone's mood became even more solemn.</p><br/>\n</div>"}