{"title": "Chapter 681: Chen Feng, Screw You!", "id": 681, "volume": 7, "url": "http://boxnovel.org/the-strongest-gene-chapter-681-chen-feng-screw-you", "volume_title": "Volume 7", "body": "<h1>Chapter 681: Chen Feng, Screw You!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 681: Chen Feng, Screw You!</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Amid the boundless starry sky, a huge throne could be vaguely seen. The man was still seated on it, coldly gazing at the planet while he silently spun the ring on his right hand.</p><br/><p>Shua!</p><br/><p>The huge throne flickered several times before vanishing. The starry sky regained its previous tranquility. After a long time, amid the starry sky, in this place where no flame should exist, a bizarre flame flashed past. That flame burned vigorously before slowly assuming the shape of a human. She wore a set of red clothes, and her vivid and huge eyes gazed in toward where the throne had disappeared.</p><br/><p>\"You have appeared once again. Appearing at a place like this, with such a method, are you a god? If you are a god, why haven't you noticed my existence here? Still not fully recovered? Or perhaps…\"</p><br/><p>Her eyes gleamed coldly before she transformed back into a fireball and slowly vanished.</p><br/><p>…</p><br/><p>On a certain unknown world, under the full operation of Luck Aura, Chen Feng and Kong Bai transmigrated once again and reached a safe world, a world with energy and where Luck Aura worked. This was a near-perfect world for them.</p><br/><p>\"Worthy of being Luck Aura,\" Kong Bai exclaimed in admiration. He knew that his transmigration ability was a perfect match for Luck Aura. Chen Feng merely rolled his eyes, ignoring Kong Bai, and started rearranging all the data he had gathered previously. He started his deductions, vowing to solve all the problems that had previously remained unsolved.</p><br/><p>Shua! Shua!</p><br/><p>Row upon row of data started being deduced. In his illusory world, Chen Feng's consciousness worked at full power.</p><br/><p>\"Spirit, help me with the analysis.\"</p><br/><p>\"All right.\"</p><br/><p>Luck Aura started working.</p><br/><p>Next, numerous riddles that would otherwise require around a hundred years or more to solve were solved one after another in a short few seconds. With both Chen Feng and Spirit working on it, the progress of the awakening-gene-reagent research advanced at an astonishing speed.</p><br/><p>One hour…</p><br/><p>Two hours…</p><br/><p>…</p><br/><p>Finally, Chen Feng completed the research. But then, was this truly the end? Would there truly be no problems using this gene reagent on the people of the Genetic Era? Chen Feng wasn't quite certain.</p><br/><p>After all, his Luck Aura would be deactivated once again the moment he returned to the Genetic Era. To transmigrate to such a world so he could once again use his Luck Aura would require an unknown amount of time, and that might fail as well.</p><br/><p>As such…</p><br/><p>Chen Feng frowned, hesitating. Right at this time, he suddenly saw Kong Bai, who was here doing nothing.</p><br/><p>Hmm…</p><br/><p>\"Ah?\"</p><br/><p>Kong Bai looked at Chen Feng blankly, bewildered. Chen Feng smiled. That's right. Here was a ready-made test subject for him, right?</p><br/><p>\"Hehe… do you want to enter the awakened realm?\"</p><br/><p>Chen Feng started leading Kong Bai on.</p><br/><p>Kong Bai nodded his head furiously. \"Mhm.\"</p><br/><p>Chen Feng took out the recently produced gene reagent. \"Swallow this, then. Breakthrough is confirmed with this gene reagent.\"</p><br/><p>\"Such an amazing gene reagent?\"</p><br/><p>Kong Bai gulped the gene reagent down with some doubt. Suddenly, the energy within his body increased sharply. His expression changed from shock before he started cultivating immediately. Chen Feng watched on silently.</p><br/><p>Mhm…</p><br/><p>This was the first stage, where the gene reagent would transform into rich energy in the user's body. Due to the intensity of this surging energy, Kong Bai's expression appeared rather twisted. It seemed like the intensity was somewhat too high, placing quite a heavy load on Kong Bai.</p><br/><p>\"Youngsters nowadays sure are soft,\" Chen Feng commented.</p><br/><p>Mhm…</p><br/><p>The second stage…</p><br/><p>Oh, right, although the energy within this gene reagent seemed to work, the provocation it triggered was too intense. It wasn't something an ordinary person could endure. Despite the 100% success rate, it had a high requirement on the user's willpower. As such, this was quite the dangerous gene reagent to use. Some improvement would be required.</p><br/><p>Chen Feng pondered and made a note of this.</p><br/><p>Mhm…</p><br/><p>Third stage…</p><br/><p>After swallowing this gene reagent, the user's physical body would suffer from a side effect, where the appearance of the user would become even uglier. Fortunately, his present test subject was Kong Bai, who had already been ugly in the first place. If it was someone else, things might have become troublesome.</p><br/><p>This was also something he needed to improve.</p><br/><p>Chen Feng pondered and noted this down as well.</p><br/><p>Fourth stage…</p><br/><p>Fifth stage…</p><br/><p>…</p><br/><p>Chen Feng watched on silently, recording down all the problems he noticed. Indeed, such \"beta-version\" gene reagents were rather unreliable. Despite the 100% success rate in breaking through, there were countless problems with this gene reagent.</p><br/><p>Chen Feng contemplated. \"Looks like I have to take more things into consideration.\"</p><br/><p>After a long time, Kong Bai succeeded in his breakthrough.</p><br/><p>Kong Bai was overjoyed. \"Hahahahaha, I am also an awakened one now!\"</p><br/><p>Despite the intense pain he was in, despite being so tired that he nearly collapsed then and there, despite the sweat raining down his body, he was still filled with vigor at this moment after his breakthrough.</p><br/><p>Bang!</p><br/><p>A powerful aura surged forth, indicating his successful breakthrough. Instantly, his entire physical body was destroyed before being reconstructed. This was the characteristic shared by all awakened ones: an energy body.</p><br/><p>Finally, Kong Bai was done with the hardship and could now taste the fruit of his labor. All the pain and suffering he had endured earlier transformed into comfort at this moment of his body's reconstruction, causing him to nearly moan out loud.</p><br/><p>It had been truly too hard for him.</p><br/><p>Bang!</p><br/><p>Energy emanated out of his hand as he sensed the strength contained in his body.</p><br/><p>\"Let's go, Chen Feng. We can return now.\" The excited Kong Bai was impatient to show off his new power back home.</p><br/><p>Chen Feng waved his hand. \"Hold on. Let me further improve this gene reagent.\"</p><br/><p>Kong Bai had an ominous feeling. \"Improve?\"</p><br/><p>\"Mhm. After all, not everyone has as much willpower as you. I need to improve this gene reagent to create a basic edition that even an ordinary person can use,\" Chen Feng explained honestly.</p><br/><p>\"Oh.\" Kong Bai nodded his head cheerfully at Chen Feng's explanation, agreeing that not everyone was as gifted as he was. However, when he pondered upon it, he felt like something was wrong. As such, he cautiously asked, \"Erm… what do you mean by basic edition?\"</p><br/><p>\"Oh, well, it will reduce the pain, reduce the intensity, reduce the degree to which one's body is twisted, as well as reduce…\"</p><br/><p>Chen Feng spurted out a huge amount of improvements he planned to make for this gene reagent. The more Kong Bai listened on, the darker his expression became. As Chen Feng noticed that, he added, \"Naturally, the success rate will also be reduced as well.\"</p><br/><p>\"Oh.\" Only at this did Kong Bai regain his good mood. That's right. Since this basic edition would greatly reduce the amount of pain the user would suffer, it was understandable that the success rate would also drop as a result.</p><br/><p>\"What will the success rate for the basic edition be like, then?\" he asked.</p><br/><p>Chen Feng sighed. \"Very low. Ten percent lower than the original success rate.\"</p><br/><p>Kong Bai nodded. \"Oh.\"</p><br/><p>A 10% drop in success rate. That was truly quite a dramatic drop. After all, for a regular gene reagent, a success rate of 10% was… hold on, 10%? Kong Bai recalled that earlier, Chen Feng had told him that the success rate was 100%. In short, this so-called basic edition would have a success rate of 90%?</p><br/><p>\"Don't you dare tell me that the user can use this gene reagent multiple times even after failing to break through,\" Kong Bai said while gnashing his teeth.</p><br/><p>Chen Feng coughed and patted Kong Bai's shoulder. \"Great tasks will always fall upon the shoulders of great people…\"</p><br/><p>Kong Bai raged. \"Great my ass!\"</p><br/><p>Chen Feng glanced at him and said, \"Calm down, there are benefits to being an early adopter as well. In any case, you are an awakened one now, right? The development of the basic edition will definitely take a much longer time to complete. At that time, you might not be able to even get one.\"</p><br/><p>Kong Bai looked at Chen Feng with doubt. \"Is that so?\"</p><br/><p>Chen Feng waved his hand. \"Of course. For now, go get used to the power of an awakened. I need to continue researching the basic edition. Sigh, the development of the basic edition is truly very hard. I have absolutely no confidence…\"</p><br/><p>\"Fine.\"</p><br/><p>At this, Kong Bai felt somewhat comforted, since at the very least, he would not need to wait for the basic edition as he was already an awakened now. He walked away and started getting used to his new power. Alas, one hour later, before Kong Bai had even gained understanding of his awakened power, Chen Feng finished his research on the basic-edition awakening gene reagent.</p><br/><p>\"Chen Feng, screw you!!!\"</p><br/>\n</div>"}