{"title": "Chapter 708: Worth It?", "id": 708, "volume": 8, "url": "http://boxnovel.org/the-strongest-gene-chapter-708-worth-it", "volume_title": "Volume 8", "body": "<h1>Chapter 708: Worth It?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 708: Worth It?</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>In a certain location, Thomas and the others that had been pursued to the end of the world had finally gotten a break due to the awakening of the Luck Goddess.</p><br/><p>\"This aura…\"</p><br/><p>\"The Luck Goddess has awakened?\"</p><br/><p>\"How is that possible?\"</p><br/><p>\"If so, then the one who tried to destroy the world previously was…\"</p><br/><p>\"Damn it!\"</p><br/><p>Their expressions became extremely unsightly. They were way too clear how frightening the Luck Goddess was. Behind the noble legends that had been spread about her, only the survivors of the Primordial Era knew what this Luck Goddess was truly like.</p><br/><p>\"She is actually the first god to awaken…\"</p><br/><p>\"It's all over.\"</p><br/><p>\"I have heard she will promise mutual annihilation at the slightest displeasure…\"</p><br/><p>\"Things will become troublesome now.\"</p><br/><p>Everyone sighed.</p><br/><p>\"Looks like we have to hasten our recovery.\"</p><br/><p>\"Mhm…\"</p><br/><p>\"Although the Luck Goddess has appeared, she seems very weak now. We must recover our strength as soon as possible so as to awaken our gods as well.\"</p><br/><p>\"Mhm.\"</p><br/><p>They all nodded in agreement. At times like this, they no longer had the mood to fight among themselves. The most proper course of action was to awaken their respective gods before the Luck Goddess fully recovered. As such, all the resonators pursuing Thomas's group left one after another, leaving the bewildered group behind.</p><br/><p>\"Left?\"</p><br/><p>Thomas was incredibly infuriated.</p><br/><p>God damn it, pursuing us for so long and nearly murdering us, yet leaving just like that? Without even an apology?</p><br/><p>\"These bastards.\"</p><br/><p>The rest of them were so furious that their entire bodies trembled as well.</p><br/><p>\"We will not this matter rest just like this,\" Wealthy Zhao said, his eyes coldly gleaming.</p><br/><p>Sakata Chuunibyou sneered. \"It is pointless to look for these idiots. We still need to look for the culprit. Don't we have a pushover ripe for bullying? It is time for us to show those fellows how strong we resonators are.\"</p><br/><p>Pushover…</p><br/><p>They were all tempted by this suggestion. True, that damnable culprit, Chen Feng!</p><br/><p>The only reason they had suffered so much, being chased all over and nearly being killed, was because of the schemes of that damnable Chen Feng! When they had been fighting over that stone, Chen Feng had laid traps upon traps for them, tricking them all into oblivion. They had no idea why the Luck Goddess had appeared suddenly. They were also unaware of the reason Chen Feng had suddenly lost his strength. However, this, for them, was the perfect opportunity.</p><br/><p>\"Let's go!\"</p><br/><p>After recovering their energy, they directly headed toward the Genetic Union.</p><br/><p>At the same time, within a certain silent training room in the Genetic Union, Chen Feng was extremely agitated, to the point that he even jumped. Fate Stone… This was something he had obtained on his previous planet. If the Luck Goddess and Misfortune Goddess had perished together, where was the power unique to the Misfortune Goddess? The one item that had been excavated together with the Fate Stone by his parents…</p><br/><p>A boom resounded within Chen Feng's mind.</p><br/><p>Bang!</p><br/><p>\"Misfortune Goddess… it is about time for you to wake up,\" Chen Feng muttered.</p><br/><p>Bang!</p><br/><p>A gloomy aura flashed out. Beside him, the pen that had been following him silently all this while, the pen judged as a portable energy storage device, was currently glowing. An ice-cold and dark power was emanating from the pen.</p><br/><p>This is…</p><br/><p>Shua!</p><br/><p>Chen Feng grabbed at it and sensed the formidable undulations. This power was completely different from the Luck Goddess's power, yet it was comparably powerful. This was a power unique to the gods—godly power, the power of misfortune!</p><br/><p>\"So it turns out that you have always been by my side.\"</p><br/><p>It was no wonder that regardless of how he had operated it, Spirit had not been able to sense any abnormalities in it. It was also no wonder that when his soul had returned to the past, Spirit had failed to come along with him. That was in fact due to this pen blocking Spirit. Or one could say that this pen had blocked out the Luck Goddess's consciousness.</p><br/><p>However, having suffered the trickeries of the Luck Goddess, Chen Feng would not easily step into the traps of these gods. Would this so-called Misfortune Goddess be reliable? Chen Feng caressed the pen in his hand and whispered, \"Can I trust you?\"</p><br/><p>Hum—</p><br/><p>The pen glowed lightly with a gloomy aura.</p><br/><p>The power of misfortune slowly flowed along the pen into Chen Feng's body, fusing with him.</p><br/><p>\"Sorry.\"</p><br/><p>Chen Feng's eyes gleamed coldly as he released his hold on the pen, halting this sudden flow of power.</p><br/><p>\"…\"</p><br/><p>Chen Feng watched on silently. He indeed wished to recover his strength. However, that did not mean he would be willing to subject himself to the control of the Misfortune Goddess. As far as he was concerned, the Luck Goddess and the Misfortune Goddess were probably the same type of person.</p><br/><p>The Luck Goddess had been lucky and had encountered Chen Feng way earlier, thus being able to recover her strength. As for the Misfortune Goddess, she had truly been unlucky, for Chen Feng to have only now realized her existence despite the fact that both she and the Luck Goddess had been excavated together.</p><br/><p>The Luck Goddess had used Chen Feng as a stepping board and had left. She had been able to smoothly obtain all the power of luck from him and had been able to destroy Chen Feng's illusory world, the foundation of all his abilities, in the process, rendering him a cripple. As such, Chen Feng would absolutely not allow the same thing to happen with the Misfortune Goddess. If that would be his fate, he would rather not have the power.</p><br/><p>Chen Feng gazed at the pen coldly. \"I think you understand what I want, right?\" Chen Feng spoke coldly. \"I need… a power that truly belongs to me. If you are in agreement with that, hand over all your power to me. With that, I will naturally think of a way to restore your godhood. Otherwise, I will ensure that this pen will forever be unable to display its worth.\"</p><br/><p>Hum—</p><br/><p>Hum—</p><br/><p>The pen shone brightly, seemingly very furious. Evidently, she was extremely furious with the difference in treatment between her and the Luck Goddess. Why did everyone fight over that bitch whenever she appeared, yet when this Misfortune Goddess appeared, she shouldered all the blame? It was obviously the fault of that Luck Goddess, yet she, the Misfortune Goddess, was the one suffering the consequences! This was too excessive!</p><br/><p>Hum—</p><br/><p>Hum—</p><br/><p>The pen glowed unceasingly.</p><br/><p>Chen Feng merely regarded the pen coldly. \"I will give you some time to think about it.\" He required strength. However, he had no interest in the type of strength that one could take away anytime one wished. As such, within this room filled with a gloomy radiance, Chen Feng and the pen regarded each other. The atmosphere there was filled with a bizarre sense of oppression.</p><br/><p>At the same time, at the entrance of the Genetic Union...</p><br/><p>Bang!</p><br/><p>The gate that had been repaired not long ago was once again broken apart.</p><br/><p>Instantly, the higher-ups of the Genetic Union were alerted.</p><br/><p>\"Who is it?\"</p><br/><p>After the various destructions the main gate of the Genetic Union had suffered, this latest version had been made sturdy enough to withstand the attack of an awakened. But now it had been directly destroyed… This proved that the strength of the enemy this time…</p><br/><p>Shua! Shua!</p><br/><p>The experts of the Genetic Union all appeared, including the deputy president, who had instantly arrived here as well. At this time, four powerful-looking people appeared at the entrance. They were precisely Thomas's group of four. They were only here for one reason.</p><br/><p>\"Who are you guys?\" the deputy president asked coldly.</p><br/><p>\"Resonator: Thomas.\"</p><br/><p>\"Resonator: Wealthy Zhao.\"</p><br/><p>…</p><br/><p>They each introduced themselves, causing great waves in the hearts of the genetic warriors present. These four were actually all resonators! Why had they appeared here?</p><br/><p>\"We are here looking for one person. Deliver him to us and we will leave,\" Thomas said with a nasty laugh.</p><br/><p>\"Who?\"</p><br/><p>\"Chen Feng!\" Sakata Chuunibyou replied.</p><br/><p>Shua!</p><br/><p>Instantly, the alertness of the genetic warriors increased, and ten-odd awakened ones immediately entering their highest combat-ready state. As for the deputy president, he signaled to someone, resulting in some modern weapons silently appearing all around. Instantly, the mood became tense.</p><br/><p>Wu Liang laughed. \"Interesting. Looks like Chen Feng's status here is not so simple after all.\"</p><br/><p>The deputy president merely sneered as a reply. \"Hehe.\" Since they had made their entrance by destroying the door and then demanding Chen Feng, there was nothing to talk about. So what if these four were resonators?</p><br/><p>The deputy president didn't hesitate. \"Go!\"</p><br/><p>Bang!</p><br/><p>All the awakened ones charged forth instantly.</p><br/><p>Suddenly, Wealthy Zhao shook his head. He unhurriedly analyzed the situation. \"How funny. The Genetic Union is indeed powerful, being able to stabilize the descending madness that resulted from the arrival of the primordial. However…do you guys truly believe that resonators are all simple people? Do you guys still remember the huge gap between A class and awakened?</p><br/><p>\"The gap between awakened and resonators is even larger, since it is the gap between man and god. What we use is precisely the power of the gods! It hasn't been easy for the Genetic Union to reach its current height. You guys still need to stabilize the world. If something happens here, the entire world will most definitely descend into great chaos. Those awakened ones will all be out of control. Can you all truly accept this? For Chen Feng, can you give up on the world? For Chen Feng, can you let chaos descend upon the world? Hehe. We only want Chen Feng. Hand him over and we will leave immediately. We can even pay for the damage we caused to this gate…</p><br/><p>\"Hehe, you guys might be able to face a single resonator. But against four of us… even without being fully recovered, we can still easily dominate this place. Therefore, before the battle starts, carefully consider everything.\"</p><br/><p>For a single Chen Feng, would this be worth it?</p><br/><p>Yet again, the deputy president responded with a sneer. \"Hehe.\"</p><br/>\n</div>"}