{"title": "Chapter 702: The Power of a God", "id": 702, "volume": 8, "url": "http://boxnovel.org/the-strongest-gene-chapter-702-the-power-of-a-god", "volume_title": "Volume 8", "body": "<h1>Chapter 702: The Power of a God</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 702: The Power of a God</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Chen Feng's eyes widened. \"You can talk?\" This was extremely shocking to him. He had never expected that this consciousness, which had been hiding within the stone all this while and had required Spirit to sense its thought process, was actually capable of communicating directly with a human.</p><br/><p>The mysterious consciousness laughed and said, \"That is only natural. With the descent of the primordial, it is natural that my consciousness was born.\"</p><br/><p>Chen Feng was speechless. It could talk… Although this \"talking\" was, to be precise, thought transmission. However…</p><br/><p>Chen Feng sighed deeply. \"Why did you not talk previously when they attacked you?\"</p><br/><p>The mysterious consciousness explained, \"I told you; you are the chosen seed of heaven. How can I help others? All along, you are the only one I will help, regardless of it being now or the future.\"</p><br/><p>Shua!</p><br/><p>A boundless power surged out of the stone. Instantly, the power of luck within Chen Feng's body surged, reaching an even higher level in the billions, and it was still growing, completely unstoppable.</p><br/><p>Bang! Bang!</p><br/><p>His luck value jumped up without stop.</p><br/><p>Two billion!</p><br/><p>Three billion!</p><br/><p>Four billion!</p><br/><p>…</p><br/><p>Ten billion!</p><br/><p>Twenty billion!</p><br/><p>Thirty billion!</p><br/><p>…</p><br/><p>A hundred billion!</p><br/><p>Two hundred billion!</p><br/><p>Three hundred billion!</p><br/><p>…</p><br/><p>Chen Feng had an ominous feeling. Compared to this surging power, his own strength was so very minute. Rather than the power of a resonator, this was in actuality the power of gods.</p><br/><p>Bang! Bang!</p><br/><p>The godly power surged. Chen Feng felt the horror of this power and suddenly had an odd feeling, a feeling telling him that with this, he could do whatever he wished to, no matter what.</p><br/><p>For example, destroying the world?</p><br/><p>Chen Feng glanced around and was certain that he was capable of that. With thirty thousand luck value, he had been able to create the omens of an apocalypse. Now, with several hundred million luck value, he should truly be able to destroy this world. After all, compared to the wide universe, this planet was still so very tiny.</p><br/><p>Oh, right, where had the comet he had summoned earlier gone to? After all, that had been no false illusion. Rather, that had been a true comet, but it hadn't reached this planet because he hadn't had sufficient power to make that happen. Where the comet had gone subsequently remained unknown. However, Chen Feng did not continue dwelling on this, as he found that the luck value in his body was still increasing.</p><br/><p>Still growing…</p><br/><p>Chen Feng no longer bothered keeping up with how much luck value he had, as he was sure that it had already reached a terrifying number. The only word he could use to describe the amount of luck value he had presently was \"endless.\"</p><br/><p>What he was somewhat worried about was Spirit, this girl.</p><br/><p>\"Spirit?\" he tried asking for her.</p><br/><p>\"Here,\" Spirit answered blankly.</p><br/><p>\"Are you fine?\" Chen Feng asked. He was worried about Spirit, as based on what they had guessed, after the invasion of this stone, Spirit might be destroyed, leaving behind purely its own power.</p><br/><p>Spirit had an odd feeling as well. \"I'm fine. I am perfectly fine. Moreover, this luck…\" Spirit waved her tiny hand. \"I can control it as well.\"</p><br/><p>She was puzzled. The two exchanged glances, and they had an odd feeling. They could actually control this power?</p><br/><p>Chen Feng was shocked. This… \"In other words, this newly gained luck value is all ours?\"</p><br/><p>Spirit was utterly confused. \"Have we misunderstood the stone?\"</p><br/><p>In short, this adorable stone was truly earnestly treating Chen Feng as the chosen seed of heaven and was sincerely trying to help increase his strength? Had he been misunderstanding the stone all along?</p><br/><p>No, that did not seem likely. But then, why were they able to control the newly gained power?</p><br/><p>Bang! Bang!</p><br/><p>Once again, his luck value increased. Chen Feng tried sensing this new level of power and found that this time, he was no longer able to control it. The reason for this wasn't because he did not have the authority to control it. Rather, it was because this power was too huge for him to be able to control, giving him a feeling like he was less capable than desirable.</p><br/><p>He looked at Spirit. \"How about you?\"</p><br/><p>Spirit shook her head. \"I am still able to control it. Regardless of how much it increases, I seem able to always control it.\"</p><br/><p>Chen Feng was filled with doubt. \"That means that the control is still under our hands.\"</p><br/><p>Spirit nodded her head firmly. \"Mhm.\"</p><br/><p>At this time, finally, the increase in his luck value slowed down, slowly decreasing from an increase of tens of billions to an increase of billions to an increase hundreds of millions…</p><br/><p>Slowly, the luck value within Chen Feng calmed down.</p><br/><p>Chen Feng was sure. \"The stone seems to finally be out of energy.\"</p><br/><p>Spirit knew what Chen Feng wanted to ask. \"I can still control the power.\" She waved her hand to demonstrate it. Godly power instantly swirled around her hand. The two were utterly confused. This was an incredibly odd feeling. Luck value was without a doubt one of the most terrifying powers in existence. If the stone had activated this with its full power, Chen Feng would definitely have been helpless. After all, that was truly quite an astonishing amount.</p><br/><p>However, the stone had not done so. Rather, it had handed over all its power to Chen Feng. Why?</p><br/><p>Hum—</p><br/><p>Slowly, the surging godly power faded. Along with the final wisp of godly power, the mysterious consciousness traveled into Chen Feng's body as well. It did not have any power, nor did it have any authority over his power. This was nothing but a consciousness. What exactly was this fellow planning?</p><br/><p>Chen Feng's heart chilled. This was way too weird.</p><br/><p>\"Spirit, try getting him under control,\" Chen Feng said.</p><br/><p>Spirit nodded. \"Understood.\"</p><br/><p>Shua! Shua!</p><br/><p>The stone dissipated away as the mysterious consciousness traveled into Chen Feng's body. The instant it arrived in Chen Feng's illusory world, numerous rays of light shot at it, and it was instantly contained by Spirit. This was a clump of consciousness, hovering midair. It had yet to assume any sort of form.</p><br/><p>A clear thought was transmitted out of the stone. \"We… finally meet again.\"</p><br/><p>Chen Feng's gaze became cold. \"Who are you?\"</p><br/><p>The mysterious consciousness had a faint smile. \"Is handing over all my luck value still not sufficient to display my sincerity, dear chosen seed of heaven?\"</p><br/><p>\"…\" Chen Feng suppressed the uneasiness he was feeling. \"Do you know that what I hate most are those tricksters? Regardless of whether you are sincere in helping me or not, tell me your true goal. Otherwise… I will kill you right this moment!\" Chen Feng spoke solemnly, his killing intent raging, proving that he wasn't joking around.</p><br/><p>The mysterious consciousness laughed. \"Tsk tsk… truly completely ungrateful.\"</p><br/><p>Hum—</p><br/><p>Hum—</p><br/><p>That clump of consciousness hovering there lazily and slowly started assuming a form.</p><br/><p>Chen Feng and Spirit weren't surprised at this. Since this stone was so powerful, it was most certainly capable of something as basic as assuming a form. However, when the form it was assuming became clear to them…</p><br/><p>Chen Feng and Spirit were completely startled. That was because this was exactly the same appearance as Spirit.</p><br/><p>Chen Feng's eyes gleamed coldly. \"You are courting death!\" This fellow was deliberately imitating the appearance of Spirit…</p><br/><p>The mysterious consciousness smiled toyingly. \"This is what my main body looks like.\"</p><br/><p>Chen Feng shook his head. \"How is that possible?\" Spirit's appearance and name had both come into existence after his discussion with Spirit when she had first appeared back then. Thus, how could it be completely the same as this stone's original appearance?</p><br/><p>\"Indeed, the final look only came into existence after you two discussed it back then. However…\" The mysterious consciousness smiled. \"Are you sure that it wasn't completely affected by the subconsciousness of Spirit?\"</p><br/><p>Spirit was bewildered. \"What do you mean?\"</p><br/><p>The mysterious consciousness chuckled. \"Do you still not understand?\" Slowly, she walked toward Spirit.</p><br/><p>Chen Feng's powerful consciousness descended. \"Scram!\" As the master of this illusory world, he tried forcefully stopping the advance of the mysterious consciousness. Alarmingly, that mysterious consciousness was actually capable of ignoring Chen Feng, even in this world where Chen Feng was the master. Around the mysterious consciousness, the godly power of luck started swirling.</p><br/><p>Spirit's eyes widened. \"How is this possible?\" All the godly power of luck here should be fully under her and Chen Feng's control, as they had completely transferred ownership. Why was this fellow able to utilize it?</p><br/><p>The mysterious consciousness looked at Spirit in pity. \"Do you still not understand? Because…you are me!\" Finishing her words, her finger pointed at Spirit's forehead.</p><br/><p>Bang!</p><br/><p>Instantly, a terrifying power engulfed them both. At this moment, all the power of luck within Chen Feng was activated. That boundless radiance and power surrounded both the mysterious consciousness and Spirit. There, two completely identical people stood, surrounded by a completely identical power. That power surrounding them… was the power unique to the gods!</p><br/>\n</div>"}