{"title": "Chapter 736: Hard Selling", "id": 736, "volume": 8, "url": "http://boxnovel.org/the-strongest-gene-chapter-736-hard-selling", "volume_title": "Volume 8", "body": "<h1>Chapter 736: Hard Selling</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 736: Hard Selling</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>Duma was somewhat dumbstruck. Godly power could be used in this manner as well? He should have a deeper understanding of godly power than most people. Luck and misfortune were supposed to be two opposing powers that couldn't possibly be used together. Yet now… he had witnessed himself how both were used together, resulting in an amplification effect. In fact, this amplification effect had increased the power by about five times, or maybe even more. This was quite a terrifying effect.</p><br/><p>With this, the lizard, which had been the disadvantaged side to begin with, was even worse off. Initially, there had been a chance for him to truly recover the inheritance of the lizard bloodline he had within him. Unfortunately, with Chen Feng here, the lizard bloodline was rendered a nonfactor, effectively crippled.</p><br/><p>What joke was this? Since the lizard had offended Chen Feng, it still wished to breakthrough? How naive. Soon after, the battle of the East Coast ended. The gigantic primordial dragon stepped on Long Yue's body until Long Yue was dead. Next, he gazed in the direction of Genetic Union, his gaze profound. Instantly, the people of the Genetic Union became nervous. Right at this instant, a young man stepped onto the battlefield, attracting much attention.</p><br/><p>\"Honorable lord dragon,\" he said earnestly, \"your might is incredibly awe-inspiring. Is it possible for me to be your honor's disciple?\"</p><br/><p>\"…\" The primordial dragon's gaze landed on that young man's body. After a long time, the dragon shook his head and said, \"You do not have the bloodline of a dragon within you and are thus incapable of enduring the power of my inheritance.\"</p><br/><p>Everyone gasped in shock. Holy shit, this dragon was capable of speech?</p><br/><p>\"Hehe.\" Duma sneered in response to their shock, causing them to sink into silence as they recalled that even this turtle here could talk, let alone a primordial dragon…</p><br/><p>Chen Feng coughed, as he himself had forgotten that all primordial life-forms possessed intelligence. However, since this dragon was capable of speech, he would be much better to deal with than a random wild beast.</p><br/><p>The young man continued gazing at the dragon earnestly. \"May we have the honor of having you as a guardian god of humanity? The primordial has descended, and as normal life-forms, humanity does not have the formidable strength that your like has. Therefore, we wish to obtain your protection.\"</p><br/><p>The dragon shook his head. He stood up, his terrifying prowess clearly displayed, and gazed at the young man with a pensive look. \"I am not a god, nor do you guys need me. You humans… already have your own guardian god.\"</p><br/><p>The young man blanked. \"We…do?\"</p><br/><p>\"Stay smart.\" The dragon nodded his head and stood up with a deafening sound before leaving with a flash.</p><br/><p>\"Le... left?\"</p><br/><p>The people of the Genetic Union were all overjoyed.</p><br/><p>That incredibly strong primordial dragon that had been the source of their anxiety had left just like that? This seemed completely different than they had imagined.</p><br/><p>\"Success.\"</p><br/><p>Chen Feng exchanged glances with the deputy president and heaved a sigh of relief. As for that earnest-looking young man, he returned with a disappointed look on his face. The moment he entered the Genetic Union, though, he limped immediately, nearly collapsing to the ground. \"Holy shit, that scared me to death.\"</p><br/><p>Chen Feng rolled his eyes.</p><br/><p>\"Chen Feng, for you to send me out to try to be his disciple, were you not worried that he would kill me instead?\" Xu Fei grumbled. That's right, the reason he had even dared go out was because Chen Feng had requested it.</p><br/><p>Chen Feng was all smiles. \"He wouldn't have. Since the dragon is capable of speech and is intelligent, he is a being capable of social exchanges. With you raining praise upon him, he would definitely not attack you… Especially after he felt the existence of two different godly powers here.</p><br/><p>Xu Fei scratched his head. \"Godly powers?\"</p><br/><p>Chen Feng spoke calmly. \"Of course. Otherwise, do you think I would have dared let you go out there? The primordial dragon awoke ahead of schedule thanks to the Luck Goddess. In a way, he owes her one. Therefore, upon sensing the godly power of luck, he definitely would not have killed you.\"</p><br/><p>After all, Spirit was now the official Luck Goddess. Since Chen Feng had dared send Xu Fei over, he had obviously been confident, at least to a certain degree.</p><br/><p>\"What if the dragon had agreed to the request?\" Xu Fei asked blankly.</p><br/><p>Chen Feng curled his lips. \"That would have been even better. Do you really think that one can meet a primordial dragon so easily? If the Luck Goddess hadn't used her full power to awaken one of them, you would never have had a chance to see one. The primordial dragons are as powerful as gods. If he had been willing to accept you as a disciple, in this new era, I reckon you could do whatever you wish.\"</p><br/><p>\"That's true,\" Xu Fei stated regretfully. \"It is unfortunate that the dragon didn't agree to the request.\"</p><br/><p>\"That is only natural.\" Chen Feng understood that. After all, these primordial races all cared deeply about bloodlines.</p><br/><p>\"Why don't… you go get some dragon bloodline?\" Chen Feng said after some thought.</p><br/><p>Xu Fei was alarmed. \"One can get a bloodline so easily? Mhm…\"</p><br/><p>Xu Fei pondered for a short while and continued, \"I don't really mind, but I don't think my mom would agree to it.\"</p><br/><p>Chen Feng was stupefied. \"What are you thinking about? I actually meant having Kong Bai bring you back in time…\"</p><br/><p>Xu Fei finally understood. \"Oh. So that is what you were talking about.\" Subsequently, he shook his head. \"Forget it. Nowadays, a lot of resonators have awakened, and they're all paying close attention to everything related to the primordial as well as their memories pertaining to the Primordial Era. In fact, I looked for Kong Bai some time ago. He said that now, the moment any of us enter the Primordial Era and appear in the memories of those people, we will most probably get hunted down. Those people are not idiots. As such, they will not give Kong Bai a chance to gain power from the Primordial Era.\"</p><br/><p>Xu Fei felt extremely regretful.</p><br/><p>\"True.\" Chen Feng shrugged. If so, he had no other ideas.</p><br/><p>In the past, the resonators had all been asleep. As such, visiting the Primordial Era had still been possible. So long as they were careful to not stumble upon any taboos, there were no problems. Now that the gods had started to awaken and resonators were everywhere, the moment they dared return in time, they would probably get instantly killed. Xu Fei majored in fleshly body cultivation. In fact, the dragon bloodline suited him greatly. Unfortunately, he had not encountered a fortuitous encounter that enabled him to advance any deeper on this path. After understanding this, Duma walked over noiselessly.</p><br/><p>\"Hey, bro.\" Duma dragged Xu Fei to a corner quietly. \"I have a lizard bloodline inheritance here. Are you interested in learning more?\"</p><br/><p>Xu Fei rejected him without hesitation. \"Scram!\" Holy shit. Look at that corpse lying on the East Coast. Was that not an inheritor of the lizard bloodline as well? Who was this Duma trying to scam here? He had no intention of being the next enemy of the dragons.</p><br/><p>Duma tried to explain. \"In truth, the lizard bloodline is extremely powerful… Long Yue only died because he had not fully activated the bloodline inheritance. I can personally make some minute adjustments for your version of the inheritance to make it suit you perfectly.\"</p><br/><p>Xu Fei sneered. \"Scram!\"</p><br/><p>Duma patiently explained, \"I am telling the truth. Look, don't you feel like we both are connected by destiny?\"</p><br/><p>Xu Fei curled his lip. \"Scram!\" What a scammer. He was clear on Duma's true identity. Duma was an ascended turtle and a resonator. In the past, his identity as a resonator had indeed been awe-inspiring enough. But now, with resonators everywhere, Xu Fei truly couldn't bring himself to revere a single resonator, especially this fellow here who had given up on his dignity as an expert and had taken the initiative to stick to him just to hard sell the lizard bloodline…</p><br/><p>This guy…</p><br/><p>By the side, Chen Feng did not know whether to laugh or cry. Even earlier, when the dragon had fought the lizard, Duma had not dared to come over. Yet now he had arrived so promptly.</p><br/><p>Suddenly, Chen Feng thought of something. Hold on… Would Duma truly be so bored as to take a trip here just for the sake of Xu Fei? Evidently, that was quite unlikely. If so, why had he come?</p><br/><p>Duma sighed. \"I am here to take back the lizard bloodline from Long Yue's corpse and to look for a new inheritor.\"</p><br/><p>\"Are you sure?\" Chen Feng found that doubtful.</p><br/><p>\"Yes,\" Duma said calmly.</p><br/><p>\"Is that so…\" Chen Feng narrowed his eyes. He looked at Duma's calm expression, then glanced over at Xu Fei. Suddenly, he recalled something. The first time Xu Fei's physical body had transformed, it had been on the seafloor… due to a turtle?</p><br/><p>Chen Feng finally remembered. The only reason Xu Fei had even entered the path of fleshly body cultivation was because he had encountered that damnable turtle at the bottom of the sea in the past and had subsequently absorbed all its blood essence. From that moment onward, Xu Fei's body had become special. As for that turtle… it was precisely the little turtle spirit, or to be more precise, the holy spirit!</p><br/><p>Chen Feng was all smiles as he regarded Duma. \"I have a question. Where is the holy spirit?\"</p><br/><p>Shua!</p><br/><p>Duma's expression changed.</p><br/>\n</div>"}