{"title": "Chapter 750: Godhood", "id": 750, "volume": 8, "url": "http://boxnovel.org/the-strongest-gene-chapter-750-godhood", "volume_title": "Volume 8", "body": "<h1>Chapter 750: Godhood</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 750: Godhood</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>\"This is an unrecovered god,\" one monkey said.</p><br/><p>The huge monkey sneered. \"God?\" He was only at the peak of the awakened realm. However, he could still see that this weakling before him had absolutely no godly power about him. As for his close resemblance to the gods…</p><br/><p>\"This must be an impersonator. Where is your godly power?\" the huge monkey said with a sonorous voice.</p><br/><p>\"Huh? A few days ago, he still had godly power.\"</p><br/><p>A few monkeys scratched their heads in confusion.</p><br/><p>The huge monkey snorted. \"Hmph!\"</p><br/><p>Bang!</p><br/><p>A formidable power started converging in his hands. This was a tribe known as the herculean apes. Each of them had formidable strength. They had awakened their intelligence along with the rise of the Sin God. Unfortunately, they had yet to obtain their very own guardian god. Without their own god, they could not resonate. And so long as they could not resonate, their tribe would forever unable to enter the resonance realm.</p><br/><p>As such, even though this huge monkey here was much stronger than other regular awakened ones, he was still stuck in the awakened realm. They of the herculean-apes bloodline had been searching for a god for a long time. Alas, in this era where too many gods were dead, they had failed to find a god willing to accept them. Even so, that did not signify that they were a tribe anyone could make a fool out of.</p><br/><p>\"This is already the third scammer we have encountered this month, right?\" The huge monkey was furious.</p><br/><p>Bang!</p><br/><p>His powerful attack started to descend.</p><br/><p>\"Level 10 awakened!\"</p><br/><p>Chen Feng sank into a solemn mood as he saw this attack. No, this was not merely a level 10 awakened. This fellow's strength had far surpassed a regular peak awakened one. He was several times more powerful than one, and with his terrifying strength, he was capable of delivering a crushing defeat to everyone in the awakened realm.</p><br/><p>Chen Feng's instinctive reaction was to unleash his ability. However, he kept that on hold.</p><br/><p>Peak… awakened realm?</p><br/><p>Suddenly, Chen Feng's eyes started to dart around.</p><br/><p>Bang!</p><br/><p>The peak-awakened attack slammed toward him. Lightly, Chen Feng held his hand out and pointed at the huge fist.</p><br/><p>Bang!</p><br/><p>A dreadful power surged out. Instantly, that huge monkey was blasted somewhere 100 meters away, leaving behind a long mark on the ground from the drag. The sight was truly rather alarming.</p><br/><p>\"You…\"</p><br/><p>The huge monkey dared not believe this. This weak monkey-like life-form before him had actually blocked his attack with a single finger? In truth, even Chen Feng himself was alarmed. This feeling… Something seemed wrong. Chen Feng's eyes gleamed at a certain realization.</p><br/><p>When the huge monkey's attack had reached him, Chen Feng had been able to sense how powerful the attack was. That was why he had counterattacked without hesitation. Never had he expected… Chen Feng's heart thumped rapidly. In the awakened realm, the maximum level was 10. So long as one reached level 10, one would be able to resonate with a godly power and enter the resonance realm.</p><br/><p>As for those without a god, like these monkeys here, they would be stuck in this realm forever. Even if this tribe of herculean apes had inborn godly power, they were still incapable of ascending into the resonance realm. Yet Chen Feng's attack earlier had been equivalent to the attack of a level 25 awakened, if such a level existed.</p><br/><p>\"How is this possible?\"</p><br/><p>Chen Feng felt doubtful. He was clear on his own strength. In fact, he was only at level 5 awakened. This was his current level. Even after the multiple huge battles he had participated in, he had only reached level 5 awakened. He had been relying too much on his godly power, resulting in the negligence of his awakened level.</p><br/><p>Even now, he had only unleashed his very own strength due to a lack of godly power. However, why had he unleashed an attack with the might of a level 25 awakened while he was still a level 5 awakened?</p><br/><p>Chen Feng was confused. Apart from certain tribes with innate abilities, the strength of awakened ones was rather consistent in general. Level 10 awakened would generally be around 10 times stronger than level 1 awakened. Furthermore, this was the limit of the realm. The only reason this huge monkey was stronger than other level 10 awakened ones was because of the innate strength his tribe was born with. Thanks to that, he was able to unleash the might equivalent to a level 20 awakened. And yet, he had been instantly defeated by Chen Feng with a single finger.</p><br/><p>\"Are… you… a real god?\"</p><br/><p>The huge monkey was shaken. He had not sensed any godly power from the attack earlier. This showed that this life-form before him had merely used his own strength to casually point his finger and, with that finger, the huge monkey had nearly been killed. Such a feat was something even a resonator could not accomplish, since the only superiority a resonator had over an awakened one was the godly power they had at their disposal. This fellow before them… was a god!</p><br/><p>\"Nope.\" Chen Feng turned around and started to leave. Since his strength had recovered, he had no intention of being the leader of a bunch of monkeys. What he wanted to do now was ascertain the reason he was so powerful, then think of a way to rescue humanity from the eyeball of the Sin God.</p><br/><p>Left?</p><br/><p>The herculean apes watched his departure with disappointment.</p><br/><p>Suddenly, the huge monkey asked, \"In that case... are you interested in ascending to godhood?\"</p><br/><p>Bang!</p><br/><p>At this question, Chen Feng's heart shuddered. Godhood? He stopped his steps. From the huge monkey's solemn expression, he did not seem to be kidding around.</p><br/><p>Chen Feng concentrated his gaze as he asked, \"You have a way to achieve that?\"</p><br/><p>The huge monkey nodded resolutely. \"Mhm.\" Shortly after, he paused and spoke solemnly. \"To be precise, all life-forms are capable of ascension. However, the difficulty level is too high. I once attempted to do so. However, I failed. But if you were the one to attempt it...\" The huge monkey's gaze burned.</p><br/><p>Oh?</p><br/><p>Chen Feng's curiosity was piqued. Thanks to the huge monkey's explanation, he finally gained true understanding of this new era. This was the era of the Sin God alone. After imprisoning the humans as a supply of godly power for himself, he had no longer had any misgivings and had directly transformed the entire world.</p><br/><p>The entire planet had been reverted back to the Primordial Era. Even the starry sky was no longer the same. This planet's sky was forever shrouded by the godly power of sin. The entire sky was blotted with dots of light. These dots of light were not as dazzling as the stars that once spread across this sky. However, each of these dots of light was akin to a seed waiting to be unearthed.</p><br/><p>These were the seeds of godhood! This was the handiwork of the Sin God. All the dead gods were hung in the sky, allowing all life-forms to comprehend the power contained within. Anyone who gained godly power from the comprehension would be able to reach godhood immediately.</p><br/><p>This was an era where anyone could become a god. During the Primordial Era, there had been numerous gods. The ones that had awakened during the Genetic Era were less than even 10 percent of the total gods that had once existed. This small amount of gods had subsequently been tricked by Chen Feng into entering the alien world.</p><br/><p>Even with the Sin God waking gods up without stop, he had ultimately only managed to awaken a pitiful 3,000 gods. Moreover, these gods were the incredibly weak ones, those so weak that they had failed to awaken during the Genetic Era. As such, the comprehensive strength of this world was way too weak.</p><br/><p>That was what had led to the Sin God changing the laws of the world, opening up the path of ascension. So long as one was strong enough, anyone could enter godhood, becoming a god.</p><br/><p>\"Godhood…\"</p><br/><p>Chen Feng narrowed his eyes. He had a wondrous feeling. Even without the Luck Goddess helping him, everything had still progressed so smoothly. It was precisely due to him causing so many gods to fall with his scam that the Sin God had done this, as the gods had been weakened too greatly.</p><br/><p>This guy…</p><br/><p>Chen Feng had a pensive look.</p><br/><p>In the past, the Sin God had wanted to conquer the entire world. After his defeat at the hands of the Creation God, he had opted to create his own twin-horns world instead. However, that world had been too weak. As such, he had ultimately set his sights on this world. Ultimately, the entire world had been annexed. The world that the Creation God had used his own life to improve had been nothing but a gift to the Sin God.</p><br/><p>Was the present Sin God imitating the Creation God in his quest to make this world stronger? Nope. The only reason he was even trying to awaken these gods or to create more gods was because he could not fully operate this world by himself.</p><br/><p>In fact, this was quite simple. If the twin-horns world was a small company and the Sin God was the chairman, then the current Sin God was like someone who had suddenly been hired to be the chairman of a major international company. Was he truly qualified for this new task? Could he truly perform satisfactorily?</p><br/><p>This was the problem the Sin God had encountered. His understanding of this world was far below the Creation God's. That coupled with the fall of so many gods had caused the Sin God to only barely be able to keep this world operational. Three thousand gods was far too low an amount to assist him in operating this world.</p><br/><p>As such, he required more gods. It would be even better if he could gather a hundred thousand gods, like the Creation God had done in the past. This would guarantee the perfect operation of his world. Only at that time would the Sin God be truly considered to have fully conquered this world.</p><br/><p>\"Godhood, eh?\"</p><br/><p>Chen Feng lifted his head. Suddenly, he had a feeling that the sky up there was infinitely close to him.</p><br/>\n</div>"}