{"title": "Chapter 758: Charge", "id": 758, "volume": 8, "url": "http://boxnovel.org/the-strongest-gene-chapter-758-charge", "volume_title": "Volume 8", "body": "<h1>Chapter 758: Charge</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 758: Charge</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>More and more herculean apes charged over. The green monkey trembled all over. He was sure that he would be able to kill a lot of them. However, he was even more sure that he did not have sufficient godly power to kill all 5,000 of them, what with all of them being peak awakened ones.</p><br/><p>\"Come at me, bro, come!\" the huge monkey said as he flipped his middle finger at the green monkey. The green monkey's eyes greened from anger and his blood started to surge. He knew that the huge monkey was trying to provoke him into attacking. However, he was truly helpless against this provocation. He knew that if he continued fighting, he would surely die.</p><br/><p>He was smart enough to realize that. The steelback king was evenly matched against the furless monkey, whereas he would still have a slight superiority even when fighting the huge monkey and this group of herculean apes. However, the other herculean apes were wiping the floor with the other steelback and grasshorde tribesmen. The moment they were done… The mere thought of what would happen caused him to shudder in fear. In a fight like this, the moment one party was put at a disadvantage, it could very well snowball into an eventual crushing defeat.</p><br/><p>Suddenly, the green monkey realized the reason for all this. \"That thing they consumed…\" He knew that they would only have a hope of victory if they had a way of dealing with that thing.</p><br/><p>Suddenly, he told the steelback king, \"Retreat!\"</p><br/><p>Shua!</p><br/><p>He started retreating rapidly with his fellow tribesmen.</p><br/><p>\"Trash!\" the steelback king cursed. However, since the green monkeys could even abandon their own territory, what could he do? And thus, the Steelback Tribe also retreated rapidly. Just like that, this war ended with their retreat. Chen Feng and the huge monkey exchanged glances. This battle... seemed much easier than they had imagined? After all, prior to their arrival, they had been prepared for a fight to the death.</p><br/><p>\"Should we give chase?\" the huge monkey asked.</p><br/><p>\"What do you think?\" grumbled Chen Feng.</p><br/><p>\"Fine.\" The huge monkey understood what he meant. As he looked at the Grasshorde Orchard before him, his eyes went red from excitement. Finally... finally, they had obtained this place! At the same time, in the Steelback Tribe's territory, the defeated army of the Steelback and Grasshorde Tribes appeared.</p><br/><p>\"Why did you retreat?\" the steelback king asked coldly. They had obviously had a chance at victory.</p><br/><p>\"Don't you feel that the liquid they consumed before the battle is rather suspicious?\" the green monkey said after a moment's thought.</p><br/><p>The steelback king's curiosity was piqued. \"Oh?\"</p><br/><p>\"Based on my observation, the liquid they consumed was capable of increasing their strength by several levels. Otherwise, it would have been impossible for them to reach peak awakened realm. Don't forget that before this, those trash merely averaged around level 3, near the bottom of the realm. Yet now they are all so powerful. There's also that furless bastard…\" The green monkey gnashed his teeth. \"Even in the prior encounter, he was only slightly stronger than me.\"</p><br/><p>The steelback king had a pensive look. \"An increase of several levels?\"</p><br/><p>\"I am sure of that,\" the green monkey said. \"There surely is a limitation to such a powerful item. Do you remember the blue-leafed grass they used to use? Is that not something with a similar effect? It merely has a lower duration, just three seconds, and is not so powerful. This new liquid they obtained is most definitely much more powerful. Therefore, I believe that…\" The green monkey licked his lip in greed and continued, \"…So long as we figure out exactly what that thing is… Hehe…\"</p><br/><p>The steelback king was extremely satisfied with this news he had received. His heart ached at the deaths of his tribesmen. However, if he could easily defeat them…</p><br/><p>…</p><br/><p>At this time, Chen Feng was still at the orchard and was unaware that the defeated enemies were conspiring against him. He and the huge monkey were gazing at the fruits here in greed.</p><br/><p>----</p><br/><p>Grasshorde Fruit</p><br/><p>Function: Weak increase in strength.</p><br/><p>----</p><br/><p>This was what the Grasshorde Tribe had relied on for their survival. Different from the fruit of the herculean apes, this grasshorde fruit could only be used once. Moreover, the amount of improvement was based on the strength of whoever consumed it rather than a fixed amount. On average, though, a level 1 awakened would be able to reach level 3 by consuming this fruit.</p><br/><p>\"Very good.\"</p><br/><p>Chen Feng started his tests immediately. He was sure that the green monkeys and the steelbacks would not take this lying down. Therefore, he had to increase his strength as soon as possible. Since they had so many grasshorde fruits here, he would be able to freely conduct his tests.</p><br/><p>The herculean apes started gathering materials frantically for him. And next, the production began. Chen Feng was already extremely practiced in everything pertaining to gene production. Material gathering, production, failure, material gathering, production, failure, and so on. The herculean apes were split into several groups, all responsible for gathering materials for Chen Feng. As for Chen Feng, he focused on continuous production. After numerous failures, he finally succeeded.</p><br/><p>----</p><br/><p>Grasshorde Green Reagent</p><br/><p>Function: Increase the strength of an awakened one.</p><br/><p>Limitation: Only usable once.</p><br/><p>----</p><br/><p>\"Try it out?\"</p><br/><p>Chen Feng gave the eager huge monkey the privilege of being the first one to consume this reagent.</p><br/><p>Gulp.</p><br/><p>He consumed it without the slightest hesitation.</p><br/><p>Bang!</p><br/><p>He started shining with an intense radiance.</p><br/><p>The body of the huge monkey, which had been stunted, for so long suddenly ignited with an intense aura. Both his eyes became bright red as a unique aura pulsed within his body. His strength, at level 20 awakened, started increasing, reaching level 21, then 22, and finally 23.</p><br/><p>Success!</p><br/><p>The huge monkey was overjoyed. Three levels of improvement! He had actually gained an increase of three levels! A regular grasshorde fruit would probably grant a level or two of increase. Only the extremely talented ones of the Grasshorde Tribe would be able to obtain an increase of three levels. Even within the inner circle of the Grasshorde Tribe, those capable of a three-level increase would be lauded as absolute geniuses. Yet he, an outsider, had reached this level!</p><br/><p>This was truly inconceivable. In fact, he had not had much hope at the start and had merely been hoping for an increase of a single level. Yet now… Naturally, this huge improvement definitely had something to do with the reagent produced by Chen Feng. This fellow, even if he was not a god, he was surely an absolute genius. The huge monkey was sure of this.</p><br/><p>As the other monkeys saw this, they all started to consume their gene reagents as well. Initially, they were similar to the huge monkey—they had merely hoped for an increase of a level or two. Moreover, it wasn't so long ago that they had all obtained an increase in strength. As such, they did not expect to have another major increase so soon.</p><br/><p>Gulp! Gulp!</p><br/><p>Surprising all of them, most of them were able to obtain an increase of two levels!</p><br/><p>\"Howl!\"</p><br/><p>\"Howl!\"</p><br/><p>They started jumping around, howling in excitement. How long had it been since they had last had a major improvement in strength? So soon after, they had obtained yet another major improvement? The average strength of their tribe had, from the initial level 3, increased to level 5, and now they averaged level 7. That was an increase of four levels, surpassing even the Steelback Tribe.</p><br/><p>Even scarier was the fact that each of them could clearly feel that this source of strength within them was extremely stable and powerful, leaving no backlash whatsoever, unlike some other strength-boosting items.</p><br/><p>One ought to know that what people feared most when their strength increased drastically was the very foundations of their cultivation becoming unstable. Yet here, using the reagent produced by Chen Feng, this was nonexistent.</p><br/><p>Chen Feng did not look surprised at all about this. What kind of joke was that? After all, the act of gene production was in fact an act of boosting the medicinal effect of herbs, as well as the stability of the newfound strength. The difference between gene production and the consumption of raw materials was as wide as the heavens and earth. Without a doubt, gene production was not unlike a super-advanced technology in this new era.</p><br/><p>\"My turn.\"</p><br/><p>Chen Feng prepared to consume the gene reagent as well. Based on the effect on these monkeys, he already had a rough estimate of the amount of improvement he would obtain.</p><br/><p>This reagent was indeed one whose effect depended on the one consuming it. Among the several thousand herculean apes, a vast majority of them had gained an increase of two levels, with only a few of them obtaining an increase of one level. These were mostly those who were either too weak or young.</p><br/><p>As for the group of monkeys that had already been strong, they had all obtained an increase of three levels, not much different than the huge monkey. As such, this reagent had preserved the effects of the fruit itself, granting improvement in accordance to the one consuming it.</p><br/><p>Mhm…</p><br/><p>Perhaps he would only be able to obtain an increase of two levels. This was a conclusion he had reached after observing these monkeys. However, for Chen Feng, two levels would make an extremely huge difference. At present, he was at level 10 and was able to unleash the strength of a level 100. If he reached level 12, he would be able to unleash the strength of a level 144! The actual increase he would obtain was 44 levels.</p><br/><p>However, he was still somewhat dissatisfied with this. After all, even that huge monkey had obtained an increase of three levels. Must he resign himself to only two levels? Hold on… the strength of the one consuming…</p><br/><p>Chen Feng called a random monkey over. \"You, come. Consume the allida reagent first before consuming the grasshorde reagent.\"</p><br/><p>Shua!</p><br/><p>Everyone's eyes shone as they heard this. Yes, since the effect depended on one's strength, what if…</p><br/><p>Gulp.</p><br/><p>That monkey consumed the reagent without hesitation. His strength rocketed and his aura surged. The two reagents were seemingly working together, but ultimately, the monkey obtained an increase of two levels. The effect of the allida reagent was rather obvious. However, it ultimately failed to change the boost the grasshorde fruit provided. From this, it was obvious that temporary strength would not be taken into consideration.</p><br/><p>\"Seems like it won't work,\" Chen Feng muttered. Well, since the allida reagent wouldn't help, it was time to…</p><br/><p>Bang!</p><br/><p>The aura within him shook slightly. Next, he took out the reagent and gulped it down. Around him, the monkeys stared on, waiting to see the amount of improvement Chen Feng would obtain.</p><br/>\n</div>"}