{"title": "Chapter 774 - Nothing Special", "id": 774, "volume": 8, "url": "http://boxnovel.org/the-strongest-gene-chapter-774-nothing-special", "volume_title": "Volume 8", "body": "<h1>Chapter 774 - Nothing Special</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 774: Nothing Special</p><br/><p>Translator: Limostn Editor: Tennesh</p><br/><p>“Who are you? And who is your god?” that apostle asked in a cold tone. “With this method, you are trying to make a fool out of all the gods in existence? Hehe…” Only the apostles could analyze this with a clear mind. The minds of all the gods here had already been muddled by the “number 1 resonator,” “future strongest apostle,” and “strongest god” that Chen Feng had been harping about. Only the apostles were still able to see clearly and analyze this matter. All along, this farce had been nothing but a joke.</p><br/><p>Bang!</p><br/><p>Killing intent surged out and pervaded the air. The killing intent emanated by the more than 100 gods here caused even the gods of Mountcarve City to be afraid that this city would accidentally get destroyed by these furious gods.</p><br/><p>At this moment, all attention was focused on Chen Feng. Regardless of the apostles or gods, they all required an explanation. Due to Chen Feng, more than 100 gods and around 300 to 400 apostles had gathered here. As for the number of resonators, it was countless. They all needed an explanation.</p><br/><p>Bang!</p><br/><p>Terrifying pressure descended. Such an oppressive mood was sufficient to cause even a minor god to collapse. And yet Chen Feng remained calm. He had already entered an extremely unique state with his completed fake nascent soul. The gods’ so-called oppressive auras were nothing more special to him than regular auras.</p><br/><p>Chen Feng looked at that apostle. “Who are you?”</p><br/><p>“Shi Yong, apostle of the Chill Wind God,” he proudly said, evidently pleased with his accomplishment of identifying this farce before all the gods and apostles here. He hoped that with the reputation he had brought his god, perhaps his god would obtain even more believers in the future.</p><br/><p>“What is your strength?” Chen Feng asked with a smile.</p><br/><p>“Level 9 apostle,” Shi Ying said confidently. After all, his god wasn’t one of those newly ascended minor gods. Rather, his god was a true major god. As for him, he was a formidable existence that had existed since the Primordial Era back then. He had only reached this realm after several millennia of cultivation.</p><br/><p>Chen Feng smiled calmly. “In short, you are an existence incomparably close to a god?”</p><br/><p>“Hmph.” Shi Ying started radiating arrogance. Even though there was still a large gap between one at the peak of the apostle realm and a god, it would still be correct to consider such an apostle as an existence closest to a god. And in the future, after reaching level 10 apostle, he might even be able to try ascending into godhood to become a subsidiary god of the Chill Wind God. This was the greatest accomplishment for an apostle.</p><br/><p>“Very good.” Chen Feng was extremely satisfied with his answer. “Well then…” He stood up and fixed his gaze on Shi Yong. “Do battle with me!”</p><br/><p>“What?” Shi Yong thought he had heard wrong. As for the observers around them, their eyes went wide as well. Challenge? What joke was this? Shi Yong was a level 9 apostle!</p><br/><p>As the apostle of a major god, as a formidable existence that had cultivated for so many years, even among apostles, this Shi Yong was comparably powerful. As for Chen Feng, he was nevertheless still a mere resonator.</p><br/><p>“Don’t you doubt me?” Chen Feng chuckled. “All your doubts are based on the assumption that I am stuck at this realm due to my poor talent, that I am exploiting these gods to help me break through. However… I am sorry. I do not require such help. The only reason I want to enter the apostle realm is so that I can become stronger. Nevertheless, even without breaking through, I, Chen Feng, am still the strongest of believers, still a legend, even though I am a mere resonator. I am still the strongest existence below gods. Poor talent?” A look of disdain appeared on Chen Feng’s face. “Come have a taste of my strength.”</p><br/><p>Shua!</p><br/><p>Chen Feng took a single step forward.</p><br/><p>Bang!</p><br/><p>Formidable godly power surged out as his aura intensified.</p><br/><p>“He is serious in the challenge!”</p><br/><p>All of the observers around then were shocked. One ought to know that even though Chen Feng was a legend, his achievement of defeating apostles as a resonator had merely come about from him defeating the weakest of apostles, those novice apostles. He had been able to make his name with that feat due to the huge gap between a resonator and an apostle. Yet now he was challenging the powerful Shi Yong.</p><br/><p>Shi Yong’s eyes flashed with killing intent. “You are courting death.” He was truly furious at being challenged by a weak resonator.</p><br/><p>Chen Feng merely sneered. “Hehe. Do you dare or not?”</p><br/><p>“Why not?” Shi Yong was furious. If he were to shrink from such a challenge, he would be too embarrassed to continue living.</p><br/><p>“Come at me then,” Chen Feng said without a trace of politeness.</p><br/><p>Swish!</p><br/><p>Abruptly, his body soared.</p><br/><p>Shi Yong sneered. “Hmph.” Next, terrifying godly power surged out of him. At their level, there was no need to exchange numerous moves to decide on the victor. Generally, a single full-power exchange would be sufficient. With a single exchange, the weak and the strong would be clear.</p><br/><p>“They are truly doing it!”</p><br/><p>“Has this Chen Feng gone crazy?”</p><br/><p>“How am I supposed to know?”</p><br/><p>Everyone was filled with doubt.</p><br/><p>What kind of courage did a resonator need to have to dare challenge a level 9 apostle? The gap between them wasn’t merely a gap of realms. Between them, an absolute suppression in terms of godly power existed. The godly powers used by them were at completely different levels due to their difference in realm. With such a difference, how was the fight supposed to proceed?</p><br/><p>“Apostles generally use a higher-tiered godly power…”</p><br/><p>“True. Furthermore, this is the godly power of a major god. I seem to recall Chen Feng’s god being an unknown minor god that is pitifully weak…”</p><br/><p>“That seems to be the case.”</p><br/><p>“How is he supposed to win then?”</p><br/><p>“Perhaps he is indeed incapable of victory. However, putting forth a stunning fight to his death is, after all, better than being killed by the gods due to his trickeries.”</p><br/><p>“I guess so.”</p><br/><p>Everyone sighed. If Chen Feng were to die in combat in such manner, his fame would surely spread far and wide. As their thoughts reached this point, everyone focused their attention on the sky. There, Chen Feng’s attack was descending. Even though his attack looked rather extraordinary, it was nevertheless still the power of a level 10 resonator.</p><br/><p>As for Shi Yong’s attack, it truly looked overwhelming. Instantly, the power of a major god bloomed. With an astonishing aura, he collided with Chen Feng.</p><br/><p>Bang!</p><br/><p>The collision resulted in a terrifying explosion, and a bright red radiance engulfed the entire world.</p><br/><p>An alarmed cry sounded. “Huh?”</p><br/><p>Everyone found with astonishment that the expected scene of Shi Ying instantly killing Chen Feng did not appear. Rather, the opposite happened. Chen Feng’s terrifying aura had instantly crushed the entirety of Shi Yong’s attack.</p><br/><p>Pu!</p><br/><p>A mouthful of blood was coughed up. Immediately, the godly power surrounding Shi Yong collapsed. That terrifying attack of Chen Feng’s seemed capable of piercing through the heavens and earth, and it destroyed everything Shi Yong had unleashed before heading toward his forehead. Just like that, the faint red radiance that was Chen Feng’s attack halted and hovered right before Shi Yong’s forehead. As of this moment, the entire world seemed to have lapsed into silence.</p><br/><p>Chen Feng’s cold voice echoed about. “Level 9 apostle? Nothing special.”</p><br/><p>“You…” Shi Yong stared at Chen Feng, his face unbelieving. Cold sweat poured out of his body without stop. He had never expected that this fellow before him was actually this strong. All the apostles were overwhelmed with shock. Even the gods that had initially been furious were stunned.</p><br/><p>A resonator… could be so powerful? Plan? Poor talent? Making use of the gods? What a joke. When one was this strong, what was the point of talking about so-called talent? He had not needed to explain himself. He had not needed to argue the accusation. He had only needed to challenge Shi Yong, and all accusations collapsed with the result of his fight. Just like Chen Feng had said, he was a legend.</p><br/>\n</div>"}