{"title": "Chapter 787 - Ye, Are You Sick?", "id": 787, "volume": 8, "url": "http://boxnovel.org/the-strongest-gene-chapter-787-ye-are-you-sick", "volume_title": "Volume 8", "body": "<h1>Chapter 787 - Ye, Are You Sick?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3 id=\"chapter787yeareyousick\">Chapter 787: Ye, Are You Sick?</h3><br/><p><strong>Translator:</strong> Limostn <strong>Editor:</strong> Tennesh</p><hr/><br/><p>Missed? The silhouette’s expression became stern.</p><br/><p><em>Yet another miss? How is that possible? Oh, right, Chen Feng must have dodged the attack. How interesting.</em></p><br/><p>The silhouette’s expression became solemn as he surprisingly found that this Chen Feng kid actually had a trump card hidden away. It seemed like this silhouette would have to challenge Chen Feng for the godhood soon. However, the silhouette immediately relaxed afterward, as Chen Feng was not a problem as far as he was concerned. This divine seat would still ultimately be his. This was the silhouette’s honest opinion.</p><br/><p>Yet in the next moment, the silhouette’s face fell. That was because the Sin God’s final attack, which possessed incomparable might, suddenly sped up and, with shocking speed, went past Chen Feng and directly headed toward him.</p><br/><p>The silhouette was stupefied. What in the world? Were you guys not engaged in a challenge? Why would Ye not attack Chen Feng and instead attack the silhouette with all his might? The silhouette was thoroughly stupefied. However, he was nevertheless a powerful existence. Despite the sudden attack, he was able to react in time. Instantly, he erected a defense. Alas, Ye’s attack was truly too fast. After all, this was a trump card that Ye’s mirror image had unleashed with all his might.</p><br/><p>Therefore, how would the silhouette be able to defend himself in time when he had only realized that the attack was aimed at him at the last moment?</p><br/><p>Bang!</p><br/><p>The terrifying attack exploded with a boundless divine luster that submerged the silhouette.</p><br/><p>“Damn it!” The silhouette was furious. He had not expected this to happen. Nor had he expected that he would be defeated by Ye’s final attack before Ye’s mirror image perished. This… What the hell? Before the silhouette’s destruction, he instinctively looked over at the Sin God. What he saw was a profound smile. That damnable Sin God! Damnable Ye! How would the silhouette still not understand? That bastard Ye was aware that he would not survive. As such, he had decided to grant Chen Feng the divine seat instead.</p><br/><p>Bang!</p><br/><p>The silhouette exploded. It was completely destroyed. In outer space, that man’s always-shut eyes suddenly opened. His killing intent surged.</p><br/><p>“Damnable Ye!” he howled in rage. The death of his clone had caused his strength to be somewhat weakened as well. Beside him, a young lady poured him a cup of tea, a smile on her face.</p><br/><p>“Hmph.” He looked over at the young lady and snorted, as he knew that she was mocking him.</p><br/><p>“I have underestimated Ye.” He took in a deep breath and spoke. “The Sin God is still the Sin God. However, even though there has been a slight mishap in the plan, the general direction is still correct. The only change is the survival of Chen Feng. What a lucky guy,” he declared, his voice sonorous.</p><br/><p>He was truly surprised that Chen Feng was still so lucky even without the godly power of luck. Surprisingly, Chen Feng had benefited from the struggle between him and Ye. However, it did not matter. Chen Feng was ultimately a chess piece, an extremely weak chess piece.</p><br/><p>At present, his actual opponent was still Ye, and a Ye without his divine seat at that. Even though he had not successfully obtained the divine seat and the faith of all of humanity, and his strength was declining due to his clone’s destruction, it did not put much of a dent in his plan. After all, Ye had been weakened even more than him.</p><br/><p>He stood up and sneered. “Do you think you can avoid this disaster with this? Do you think that I can’t deal with you without ascending into godhood? Hehe. I will no longer look down on you.”</p><br/><p>Evidently, he was prepared to make another move on Ye. By his side, the young lady merely smiled a rather enigmatic smile. Luck… Was it truly luck?</p><br/><p>At this time, within the alien world, after the death of the silhouette, Ye’s mirror image finally crumbled.</p><br/><p>“Ah?”</p><br/><p>Chen Feng put on a blank expression. Clearly, he was completely at a loss.</p><br/><p>“Heh.”</p><br/><p>Ye smiled lightly before his mirror image dissipated completely. Somewhere else, as Ye’s mirror image dissipated, his consciousness returned to his main body. Instantly, his shrine started to collapse, and at the same time, the human world within his eye came out and regained its freedom.</p><br/><p>However, Ye did not pay any attention to this. He knew that without his divine seat, that fellow would be here soon. As for the human world? Well, he would let Chen Feng take care of it in his stead for now. After all, Chen Feng would most certainly take care of the humans properly so as to obtain more believers. When the time came that Ye returned, an even better version of the human world would be there waiting for him, a world with even more believers.</p><br/><p>Naturally, all of this required that he defeat that damnable person. That silhouette… Ye’s expression became solemn as he thought about his opponent. He was aware that a bitter battle was about to come. That mysterious silhouette, that person he had never seen in any era…</p><br/><p>“Who exactly are you? A seed left behind by the Creation God? I doubt it. You do not have his aura. Who can you be, then?”</p><br/><p>Slowly, Ye’s gaze became cold.</p><br/><p>In fact, he only needed to select a random god to challenge and he would ascend to godhood once again. However, he did not, as he was aware that he would not be given such a chance. The moment he issued a challenge, his opponent would most certainly appear. Therefore, before he went about regaining his godhood, he had to first deal with that fellow.</p><br/><p>“I will be waiting for you,” Ye said with a cold gaze. He was already prepared to have a decisive battle with that silhouette. He was sure that the silhouette had to be on its way here. Unknown to both Ye and that silhouette, when their consciousnesses left the alien world, Chen Feng’s expression changed from its previous blank state to a state of utmost calm. It seemed like his gamble had paid off.</p><br/><p>“Ye indeed won’t allow his opponent to benefit from this,” Qin Hai said.</p><br/><p>“True. If it’s me, I would do the same.” Chen Feng smiled. “After all, compared to Chen Feng the foolish chess piece, that scheming silhouette is the actual enemy, right?”</p><br/><p>As the sandpiper and the clam fought, the fisherman caught them both. This was quite a simple plan. In the eyes of that silhouette, the idiotic chess pieces would fight each other. That is, Chen Feng and Ye would tear each other apart. The silhouette had expected to be the fisherman reaping the profit. After all, he was the third party here, the one who had always remained an observer.</p><br/><p>Unfortunately, he seemed to have forgotten that from the moment he had entered this world, he had become a chess piece as well. And thus, without realizing it, he had been manipulated. In the first wave, the apostles had exhausted Ye’s godly power. In the second wave, the apostles had continued to exhaust Ye’s godly power. All seemed to have been developing in a direction advantageous to the silhouette. The pride he had been feeling had caused him to forget himself.</p><br/><p>Indeed, everything had progressed smoothly, to the point that the situation had seemed irreversible. Regardless of whether it was Chen Feng, Qin Hai, or any other person, none should have been able to reverse the situation. That was because the silhouette was way too powerful.</p><br/><p>However, thanks to how smoothly the plan had progressed, thanks to how idiotic Chen Feng and the other chess pieces had been, Ye had been greatly triggered, resulting in that resolute counterattack. Ultimately, both Ye and the silhouette had perished together.</p><br/><p>Chen Feng’s initial plan had been to think of something to ensure they both maintained similar levels of strength. With that, there would be a chance for Ye and the mirror image to die together. This was also what a lot of people had been wishing would happen. After all, only when the enemies were equally matched would they be able to fish in the murky water. However, after seeing Qin Hai, Chen Feng had immediately altered his plan and followed Qin Hai’s plan. Ultimately the plan was a success.</p><br/><p>As they thought about this, Chen Feng and Qin Hai exchanged glances and laughed. At times, a look into someone’s eyes was sufficient to convey the required message. And now… Chen Feng stood up as a faint radiance started swirling around him.</p><br/><p>This was the prelude to his ascension to godhood. He had initially thought that he would only ascend after many years. Unexpectedly, he had succeeded today. This unexpected incident with the Sin God had allowed Chen Feng to directly ascend. Moreover, he was ascending to the divine seat of the Sin God.</p><br/><p>Bang!</p><br/><p>The swirling radiance became clearer and clearer as boundless godly power started to seep into him.</p><br/>\n</div>"}