{"title": "Chapter 801 - The Era of Chen Feng", "id": 801, "volume": 9, "url": "http://boxnovel.org/the-strongest-gene-chapter-801-the-era-of-chen-feng", "volume_title": "Volume 9", "body": "<h1>Chapter 801 - The Era of Chen Feng</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 801: The Era of Chen Feng Translator: Limostn Editor: Tennesh</p><br/><p>Beneath the night sky, Chen Feng took a step forward. At this instant, endless power of faith surged out. It was also at this instant that the various gods finally realized that all of the missing human believers were under Chen Feng’s control. On their faces, a sense of helplessness could be seen. It was no wonder they had failed to find the culprit. After all, the main culprit was the first person they had kicked out. Worthy of being Lord Chen Feng indeed.</p><br/><p>Bang! Bang!</p><br/><p>Chen Feng continued stepping forth one step at a time. The endless power of faith surged out. This faith was from his very own believers, the believers of the dead major gods, and the believers of those gods that had tried to follow the Forest Goddess earlier. At this point, Chen Feng alone monopolized 80% of humanity’s belief.</p><br/><p>This was quite a terrifying amount. It was a great shock to the various gods watching on. This many believers…</p><br/><p>Swish!</p><br/><p>A black flash streaked past. A certain god had suddenly erupted with power.</p><br/><p>“Careful,” everyone cried out in alarm. However, it became clear that the god’s target was Chen Feng, as he had already reached Chen Feng.</p><br/><p>“It’s him.”</p><br/><p>The various gods were alarmed. The Night God, a peak journeyman god only a step away from the major god stage. He had tried breaking through numerous times in the past, yet he failed every time. However, due to his numerous attempts, his strength was rather frightening. He was the closest to being a major god here and the strongest person below the major god stage.</p><br/><p>“Hmph.”</p><br/><p>With this sneak attack at night, he declared his provocation. Major god? As far as he was concerned, it was but a joke. Even though he wasn’t a major god, with his present strength, he could even kill major gods with a sneak attack. As such, he did not fear any god. Ye had been the only exception.</p><br/><p>He would still have had to restrain if Ye was around. Now that Ye was dead, Chen Feng actually dreamed of assuming control over everyone? How ridiculous. And the Night God had been waiting, waiting for a single opportunity. Chen Feng’s huge quantity of believers was a source of envy for him. So many believers… If he had even half that amount, he would have broken through long ago, right?</p><br/><p>What if…</p><br/><p>He was tempted. And thus, he moved against Chen Feng without hesitation.</p><br/><p>Swish!</p><br/><p>The dark streak directly pierced through space to reach Chen Feng.</p><br/><p>“Not good.”</p><br/><p>“Something is about to happen.”</p><br/><p>“Damn it. Lord Chen Feng is a newly broken-through major god.”</p><br/><p>“How hateful.”</p><br/><p>Quite a few of the gods there felt anxious. These were mostly the gods that had selected Chen Feng’s camp since the beginning, those believing in the potential of Chen Feng and his nature as a person. Unexpectedly, not long had passed before something like this happened. In addition to these gods, there was an even larger number of gods merely watching on coldly and indifferently.</p><br/><p>“If it is the Night God, he might succeed.”</p><br/><p>“True, he is already infinitely close to being a major god. If he erupts with a sneak attack, his attack strength will be amplified by several times. With Chen Feng having only recently broken through to the major god stage… Hehe.”</p><br/><p>A lot of gods merely watched on. Some wanted to help but couldn’t make it in time. Some could help Chen Feng but did not want to. And thus, before many pairs of eyes, the Night God streaked straight toward Chen Feng with a horrifying and overwhelming momentum.</p><br/><p>And yet, beyond all their expectations, Chen Feng was still expressionless. He looked at the dark streak coldly. At this instant, his eyes began to radiate with a suffocating radiance. Next, from one of his eyes, a bright and powerful major god’s godly power surged out, profound and enigmatic. From his other eye, a black and surging major god’s godly power surged out, dark and sinister.</p><br/><p>Chen Feng’s eyes shone, one bright and the other dark. The streak that was the Night God neared Chen Feng, yet it was precisely under this high-speed movement that an expression of utter terror appeared on his face as his entire body transformed into ash and scattered in the air. The ashes waffled about around Chen Feng. The Night God was nowhere to be seen.</p><br/><p>All the gods’ hearts jolted. Some had already guessed that the Night God might not be Chen Feng’s opponent. However, none of them had expected this to be the result of their collision. Chen Feng’s eyes, and the power he had unleashed… The various gods gulped. So this was Chen Feng’s actual strength?</p><br/><p>“Any other challengers?” Chen Feng asked indifferently. The hearts of the various gods chilled. Not a single one dared to answer him.</p><br/><p>“Very good. Let us stop here then.” He stood up, surrounded by a boundless power of faith. All the gods waited deferentially upon Chen Feng as he departed. They were all clear that with this, no more gods would dare challenge Chen Feng. There were no longer any gods capable of stopping Chen Feng. With such a massive number of believers, Chen Feng would grow at an incredibly horrifying speed. As of this moment, Chen Feng’s position was unshakable. He, Chen Feng, was now the new god-king.</p><br/><p>This wondrous land had experienced the era of the Creation God, a chaotic era, and the era of Ye. Now, the era of Chen Feng had arrived. The next day, the details of the incident spread all over the world. All of humanity celebrated, and Chen Feng’s believer count grew sharply once again. With the fusion of the human world and this unique era, this new era had the largest population.</p><br/><p>Chen Feng was the controller of this world, and the gods under him controlled their respective domains. Naturally, the bountiful humans were a slice of cake that no god dared mess with. And thus, the world returned to order in a short while and entered a prosperous era. In addition to Chen Feng, the various gods’ believers increased sharply as well. All the gods were growing.</p><br/><p>It was rumored that even though only a few days had passed, some journeyman gods had already broken through to the major god stage. Even so, none of them dared to challenge Chen Feng. In all honesty, they were clear that even with their new strength, they could not have survived the Night God’s sneak attack.</p><br/><p>As for Chen Feng, that attack was completely worthless before him. Even now, the two completely different powers that had erupted from his eyes caused the gods to suffocate whenever they thought about them. Moreover, they also faced a certain truth: if even they, with only their small number of believers, were able to grow so rapidly, what about Chen Feng, who had a huge number of believers?</p><br/><p>They did not even dare to think about that. As such, not a single god was idiotic enough to try to challenge Chen Feng. This was the era of Chen Feng. His position was unshakable. Interestingly, due to Chen Feng’s existence, the humans became something of a unique existence. Everyone now knew that the humans had a noble identity, and numerous life-forms opted to assimilate into human society.</p><br/><p>This included even some of the gods. And thus, human society became an enriched and colorful society. Because of this, even Stormtech Company joined in, creating numerous wristband devices that could accommodate the various life-forms and even the gods. These creations brought those country bumpkins quite the shock.</p><br/><p>Evidently, they had never expected that even without using godly power, information and data could be transmitted and their strength could be managed. As of this moment, the entire world had entered a phase of rapid growth. Everyone’s strength was increasing rapidly. If this continued on, Chen Feng would be able to become as strong as Ye one day.</p><br/><p>However, would he have sufficient time to grow? In the Genetic Union, Chen Feng was reading the latest report with a calm expression.</p><br/><p>Even though he was already a god and the Sin God’s incredibly awesome-looking palace was available to him, Chen Feng preferred staying in the human world.</p><br/><p>Chen Feng sighed. “Is there still no news about that silhouette?”</p><br/><p>“Mhm.” Qin Hai shrugged. “He went missing after his battle with Ye. You can’t find him even with your godly power of luck?”</p><br/><p>“Nope.” Chen Feng’s head ached. That fellow was too strong, to the point that even the godly power of luck didn’t work. However, he wasn’t exactly immune to the godly power of luck. Rather, he had used some method to put up a barrier to block it out. Chen Feng was completely incapable of locating him. Who exactly was that fellow?</p><br/><p>Chen Feng was doubtful. “Was there such god during the Primordial Era?”</p><br/><p>Qin Hai shrugged. “What we know is that the Forest Goddess does not know him.”</p><br/><p>“The Misfortune Goddess has never heard of him either.” Chen Feng had a solemn expression. A mysterious existence known by no one even during the Primordial Era. Who exactly was this person? He had no idea. Could that person truly be a seed left behind by the Creation God? Chen Feng hoped that this wouldn’t be the case. He had no desire to see another one of his lies turn into reality.</p><br/><p>Suddenly, Qin Hai asked, “Oh, right. Did you not say that you seemed to have forgotten about something? Might that be related to that fellow?”</p><br/><p>Chen Feng nodded. “Most definitely. Previously, I was too weak and failed to notice. Now that I have my own godly power, I can sense the existence of that power. Now, if he tries to once again erase some of my memories, I will most definitely notice it.”</p><br/><p>Chen Feng was confident.</p><br/><p>“Mhm.” Qin Hai was in agreement. With Chen Feng’s present identity and his incredible number of believers, the growth of his strength was shocking. At present, Chen Feng himself was already a major god. If that person tried to do something to him now, he would definitely be noticed.</p><br/><p>“Get them to hasten the speed,” Chen Feng said after some thought. “We must locate him as soon as possible.”</p><br/><p>“Is there a need to find him this fast?” Qin Hai was curious. One ought to remember that the silhouette was truly quite strong. Back then, even the seriously injured Ye had been able to erupt with such terrifying strength. How about that person? In fact, finding him would not necessarily be a good thing. So what if they couldn’t find him?</p><br/><p>He had merely hidden to lick his wounds. With the speed of Chen Feng’s growth, by the time the silhouette was done recovering, perhaps Chen Feng would already be as strong as Ye? At that time, the victor of their clash would no longer be a sure thing.</p><br/><p>“Time is advantageous for us.” Qin Hai was sure of this. After all, that silhouette was not one they could afford to look down on.</p><br/><p>“I know. However, I also know how terrifying he is.” Chen Feng had a solemn expression. “If we find him now, if I can assure mutual destruction… even my death is a price I am willing to pay. But he has completely vanished… He is not stupid. If he truly didn’t have any backup plans, he would have appeared after I defeated Ye, since I was at my weakest then. Yet he did not appear then. Even if he didn’t receive the news on the day of Ye’s death, he must have received the news the day after. However, he has not appeared. Day after day, I keep growing, yet he has completely vanished. What exactly is that fellow doing? What exactly is he planning? I don’t know. Nobody knows.”</p><br/><p>As Qin Hai heard all this, his expression became solemn. True… What exactly was that fellow doing?</p><br/>\n</div>"}