{"title": "Chapter 822 - Mental Collapse", "id": 822, "volume": 9, "url": "http://boxnovel.org/the-strongest-gene-chapter-822-mental-collapse", "volume_title": "Volume 9", "body": "<h1>Chapter 822 - Mental Collapse</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In outer space, Wang Yao, who was focused on cultivation, suddenly felt her heart throb.</p><br/><p>Pu!</p><br/><p>Suddenly, she looked toward that planet. At this moment, she felt an intense pain in her heart as an indescribable sadness surged within her. This feeling… She knew that something had happened to Chen Feng! She shut her eyes in pain. Luo Yuan… Had he finally succeeded?</p><br/><p>Chen Feng…</p><br/><p>Suddenly, Wang Yao recalled the words Luo Yuan had said before he left. He had said that Chen Feng would definitely die. Regardless of whether his plan succeeded, he would give her a choice. She was aware of what he wanted. As such, she should be able to make the correct choice.</p><br/><p>If they returned to that era, she would be the Time Goddess of that era and Luo Yuan’s successor. She would be the one true god. At that time, how hard would it be for her to resurrect Chen Feng? So long as he could return to that era, Luo Yuan would not mind.</p><br/><p>Wang Yao sighed. “So it turns out this is also part of your plan.”</p><br/><p>She knew that each step had progressed as Luo Yuan planned. Despite the small mishap, everything had ultimately progressed as he wished. Wang Yao shook her head, no longer thinking about this. This was out of her control anyway. The only thing she could do was cultivate the power of time. She only had two options: passively comprehending time or manually cultivating time, the latter of which would hasten the comprehension process. No matter what, she would revive Chen Feng, even if the price was the destruction of this world.</p><br/><p>Different from Chen Feng, Wang Yao was not someone who would consider her friends, family, or anything like that, since she did not have any of those. The only person she cared about was Chen Feng alone.</p><br/><p><em>I will definitely revive you!</em></p><br/><p>Wang Yao’s gaze became resolute.</p><br/><p>Hum—</p><br/><p>Faintly, the power of time flowed around her.</p><br/><p>…</p><br/><p>At this time, when Luo Yuan arrived within the deep mountain range, he was welcomed by an absolutely empty mountain range. Chen Feng was no longer here. Luo Yuan used Luck Aura to search for Chen Feng, but he was unable to find anything. This shouldn’t be the case, as even though he couldn’t use Luck Aura directly on Chen Feng, he could still find Chen Feng through others who were not immune to luck. Therefore, he was looking for Chen Feng using the process of elimination. If he located everyone, then the sole location he couldn’t see would be Chen Feng’s. After all, Luo Yuan was strong enough to scan the entire world.</p><br/><p>Now, the entire world was laid bare to him. Every corner of the world was in his view, yet no trace of Chen Feng could be found. How was this possible? Luo Yuan dared not believe it. Transmigration? Past? Future? Not possible. All channels had been sealed by him. Even he himself could not travel through time now. So where was this fellow hiding?</p><br/><p>Or perhaps he had committed suicide? As Luo Yuan thought of this, his heart leaped violently. That should not be the case, right? Suicide would return the godly power to the origin of all things. This also signified that after being given up by Chen Feng, the power of misfortune would return to the world and lay dormant until the day came when a new god gained comprehension over the power of misfortune. This would be an extremely rare occurrence.</p><br/><p>That shouldn’t be the case, right? Luo Yuan’s heart was all twitchy now. He had been waiting far too long for this day. He had finally been able to ascertain with Luck Aura that all of the 3,000 core powers were active in this world. This was why he had decided to return now. In his plan, the time of his return had been fixed, as this was precisely the time where all the core powers appeared.</p><br/><p>Initially, he had indeed planned to kill Chen Feng. However, after finding out that Chen Feng had control over the power of misfortune, his only thought had been to first capture that fellow before forcing him to put on a wristband. In fact, his initial plan hadn’t been wrong. At that time, Luo Yuan had still been without a divine seat. If he killed Chen Feng, he might even have inherited Chen Feng’s misfortune godhood.</p><br/><p>That might be why his Luck Aura had proposed killing Chen Feng when the plan was still being drawn. However, he had failed to emerge victorious in that divine-seat trial. That idiotic Ye had gifted the divine seat to Chen Feng just so he could destroy Luo Yuan’s clone.</p><br/><p>From that moment on, everything had changed. His only choice had been to wait until he captured Chen Feng alive. Unfortunately, the day had not come. And now… that fellow had committed suicide. Damn it! Luo Yuan was furious. This single action of Chen Feng’s had halted his entire plan. After all, with the death of Chen Feng, he would have no choice but to patiently and carefully search for and capture all the fleeing believers. Next, he would have to start slowly cultivating gods, waiting for the various apostles to finally qualify to take on divine-seat trials. Updated b.y . com</p><br/><p>And lastly, he had to wait until a person with talent in the domain of misfortune appeared, ascended to godhood, and became the Misfortune God. Only then would Luo Yuan be able to copy and obtain this power, obtaining full control over this world. Even so, the appearances of divine seats were completely random. It might be a misfortune divine seat or a divine seat belonging to another godhood.</p><br/><p>If it was any other godhood, he would be able to use his Luck Aura to alter the chance of its appearance. Unfortunately, misfortune was a domain that totally ignored his power of luck. If he dared to use Luck Aura on it, perhaps the divine seat of misfortune would hide forever and ever.</p><br/><p>What if he let the divine seats appear naturally, then? Well, there were more than a hundred thousand of them. The mere thought of this made Luo Yuan furious. The probability of getting his desired divine seat to appear was likely lower than the chance of getting his desired card in one of the loot boxes of the card games he played when he was young, right? He had been scheming for so many years and had finally reached this step with great difficulty, yet now he had to start gathering believers and cultivating gods, then wait for RNG to smile upon him?</p><br/><p>“Chen Feng! Screw you!” Luo Yuan’s furious voice resounded through the sky. He had truly never imagined that a day would come when a single suicide would cause him such a big trouble. Perhaps Chen Feng hadn’t committed suicide? No one would do something like that, right? However, when Luo Yuan recalled Chen Feng’s history and sacrifices for humanity, he had no choice but to accept the fact that this was indeed a possibility.</p><br/><p><em>Chen Feng… are you truly dead?</em></p><br/><p>Never in the past had Luo Yuan so wished for Chen Feng to be alive. Alas, no traces of Chen Feng were found. One day, then two days, then seven days… Time passed. Chen Feng never appeared. He had truly vanished. One might say that he had truly died. After one month, Luo Yuan finally gave up in despair.</p><br/><p>He finally confirmed that Chen Feng had indeed committed suicide for a so-called righteous reason. Moreover, he even thought of a way to confirm Chen Feng’s death. It was quite simple. Why was Chen Feng immune to the power of luck? Because he had been alive. If he was dead, he should no longer be immune to luck. Therefore…</p><br/><p>Shua!</p><br/><p>Luo Yuan activated his Luck Aura.</p><br/><p>“Is Chen Feng dead or alive?” he asked.</p><br/><p>Shua!</p><br/><p>For the very first time, Luck Aura answered a question about Chen Feng: Dead.</p><br/><p>An ice-cold thought surfaced as Luo Yuan’s eyes went wide. He was finally sure that Chen Feng was truly dead.</p><br/><p>Luo Yuan was still unwilling to accept this. “How did he die?”</p><br/><p>Luck Aura started deducing. It only answered after a long time: Suicide.</p><br/><p>Luo Yuan: “…”</p><br/><p>He stayed silent for a long while before smiling bitterly. So Chen Feng had truly committed suicide. He would not be able to obtain more details, since Chen Feng had possessed the power of luck while alive. As such, Luo Yuan would not be able to obtain more information. The nearest he could get was confirmation of Chen Feng’s death.</p><br/><p>What could Luo Yuan say? How brave of him?</p><br/><p>“You won.”</p><br/><p>Luo Yuan was furious. He was obviously the one laughing at the end, so why was he feeling so uncomfortable now? What the hell was this sort of victory?</p></div>\n</div>"}