{"title": "Chapter 836 - World Creation!", "id": 836, "volume": 9, "url": "http://boxnovel.org/the-strongest-gene-chapter-836-world-creation", "volume_title": "Volume 9", "body": "<h1>Chapter 836 - World Creation!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>At present, within a different world, Luo Yuan was following behind the footsteps of a certain someone. One step. Two steps. Before him was a boundless radiance, seemingly unfolding the story of a legend. Luo Yuan’s eyes widened, and he watched on as everything unfolded before him. His heart was filled with shock. So this was what it meant to create a world?</p><br/><p>…</p><br/><p>Before his eyes, that youth was standing in the void, hovering above a destroyed planet.</p><br/><p>“Origin, the God that created Heaven and Earth.”</p><br/><p>Hum—</p><br/><p>An incorporeal power began to bubble. The fragments, the planet, and the comets around began to revolve according to the law of that power. Everything was seemingly under that youth’s control.</p><br/><p>The youth spoke his second sentence indifferently. “Earth, the hollow primordial chaos.”</p><br/><p>Stars began to converge. The planet exploded into various fragments, yet with the utterance of this sentence, the fragments all converged together again to assume the form of a sphere. The fragmented stars converged together as well, coming together to form a brand new planet, a planet that was so very bright and resplendent.</p><br/><p>The youth spoke his third sentence. “The darkness of the depths.”</p><br/><p>The sphere began to transform, and indentations started to appear on it, giving birth to abysses, canyons, edges, corners, and marks. Slowly but surely, it became a planet with life.</p><br/><p>The youth spoke his fourth sentence. “God’s spirituality traverses the water’s surface.”</p><br/><p>Splash—</p><br/><p>Water appeared on the planet, filling the valleys and gorges, giving birth to oceans and rivers. The entire planet became complete, and the youth stepped on the sea surface casually.</p><br/><p>“God says, let there be light.”</p><br/><p>Hum—</p><br/><p>Light appeared, as if the everlasting sun had been there since time immemorial. And yet the light that had appeared wasn’t the light of the sun. The youth pointed at the void. There, the moon, which had long since been destroyed, appeared yet again. Just like that, it appeared slowly, hovering where it used to hover. And thus this planet came to possess a moon.</p><br/><p>“By my name, revolve!”</p><br/><p>Hum—</p><br/><p>The final power burst out of his hand. The entire planet became flawless as the atmosphere appeared. Everything that had been lost returned, returning this planet to the perfect state it had been in during its creation.</p><br/><p>…</p><br/><p>Luo Yuan watched on silently, extremely shaken. This was his very first time witnessing the creation of a world at such a close distance. He had never experienced the era of the Creation God. As such, he was aware of what his flaw was. This was also why he had selected this book as his alien world.</p><br/><p>This book had a complete world-creation process. This book had settings that were somewhat similar to the Genetic Era. That was why he had selected this book. Different from the lustful Wang Chun, Luo Yuan had had a clear purpose in selecting this book. The only difference was that he had very little time to stay in this world, as this world required utmost care from its creator for it to develop.</p><br/><p>As for Luo Yuan, he had millions upon millions of abilities, each of them needing a certain amount of growth. Some of them could be developed through the wristband alone, but there were some that were unique, such as this book’s ability, which he had to care for personally. As such, Luo Yuan had decided to let this book develop naturally.</p><br/><p>After all, this Godly Model Creator’s main character had a copying ability as well. It detailed the story of someone who ultimately changed the world through great effort in cultivation. Mhm… The early parts of this book contained the growth of this youth. Those had not helped Luo Yuan much. What he had truly wanted from this book was this final scene, the creation of the world.</p><br/><p>Now he had seen what he had wanted to see. With his very own eyes, he had witnessed all the steps of the creation of a world. Hidden in the void, he had witnessed everything. So this was true world creation? Luo Yuan had gained great understanding from this scene. He had a feeling that perhaps he did not even need the godhood of misfortune anymore to become a world-controlling god. Or perhaps, if he could copy the ability of this main character…</p><br/><p>Luo Yuan was tempted. Based on the plot of this book, next would be the arrival of the Kingdom of Heaven. That was the moment where the illusory world and reality combined. Just as Luo Yuan was preparing to make a move, the youth suddenly stopped.</p><br/><p>“So it turns out that you are trying to witness the process of a true ascension?” the youth said, a faint smile on his face.</p><br/><p>Luo Yuan blanked. Who was this youth talking to? When he raised his head, he saw the youth’s gaze piercing through the void, looking at him. Instantly, his body chilled. He had been discovered? Hold on, how had this youth figured out his line of thought? Instantly, Luo Yuan realized something. This youth had read his mind earlier. It was also at this moment that Luo Yuan suddenly realized a terrifying truth. With this book ability, the world became a true existence. Since Ming Yue could make a move for real, the same naturally applied to this youth.</p><br/><p>Furthermore, different from Ming Yue, the person before possessed truly terrifying strength. Luo Yuan had always been looking down on the strength of this world. However, he had forgotten one important point. The youth before him had reached the realm of world creation, a realm far above his own.</p><br/><p>The youth spoke calmly. “Sorry. In my world, I am the actual main character.’</p><br/><p>“Not good!” Luo Yuan had an ominous feeling. Flee! This was his instinctive reaction. Alas, it was too late. The youth lifted his hand.</p><br/><p>“Destroy!”</p><br/><p>A terrifying radiance swept past the void and landed on Luo Yuan. Even though he had immediately tried to leave, he could still sense that terrifying strength.</p><br/><p>Pu!</p><br/><p>He coughed up a mouthful of blood before his consciousness returned to the real world. The clone he had created had actually been instantly destroyed by that youth.</p><br/><p>“How scary.”</p><br/><p>A trace of fear surfaced in Luo Yuan’s eyes. So this was what strength comparable to the Creation God’s looked like? Damn it. He had initially planned to make use of this book to gain comprehension of world creation, becoming a true god of creation. Unexpectedly, he had ended up nearly being killed by the book’s main character instead.</p><br/><p>How hateful. Luo Yuan’s eyes gleamed coldly as he vowed that, one day, he would destroy that person as well. However, it was precisely at this moment that he watched with horror as the azure book floating above his palm transformed into countless light particles and dissipated.</p><br/><p>That world had vanished. In a daze, Luo Yuan looked in the direction those particles were headed, totally dumbfounded. How… was that possible? That youth was so strong that he could use his own alien world to affect this world? So had the main character overthrown him and obtained full control over that world?</p><br/><p>No, that wasn’t right. The moment that youth had created a world, he had already been an existence on the level of the Creation God. As for Luo Yuan, because he had tried to take a peek at a power that surpassed his realm, he was suffering the backlash.</p><br/><p>This…</p><br/><p>Luo Yuan sank into a long silence. He had once tried doing what Wang Chun had, summoning the characters of the book. It was rather unfortunate that he had only managed to summon that Sun Something guy, who was just a mere villain in the book. Moreover, he was an extremely weak villain.</p><br/><p>This was why Luo Yuan had always regarded the world within the book as weak. He had never expected that the moment that youth reached the realm of world creation, he would become so powerful.</p><br/><p>“I have been careless.”</p><br/><p>Luo Yuan knew the reason behind this. If he had done as Wang Chun had and accompanied the main character in his growth, fighting together with him, he might perhaps have become good friends with that main character. However, he had not done that. He had allowed the book to progress naturally until the finale before going there to harvest his fruits. He had forgotten that the main character had grown to such a terrifying level. As such, his plan had backfired.</p><br/><p>“I still underestimated him. So this is the strength of a god of creation? After becoming the controller of the world… will I be stronger?”</p><br/><p>Luo Yuan was filled with expectation. He knew that the shortcut he had tried to take had been completely sealed. Moreover, he had even lost the entire book. As for where had the book gone, only that youth knew. Luo Yuan no longer had anything to do with that world.</p><br/><p>Regardless, this did not mean that Luo Yuan could not advance his plan. After all, he was Luo Yuan. Perhaps… Luo Yuan’s eyes shone as he thought of something.</p><br/><p>Shua!</p><br/><p>Luck Aura activated. His body flitted and instantly appeared in a different corner of the world. There, amid a bunch of trash, a pile of discarded books could be found. One look at the pile and one would know that these books had been printed during the era of peace. Luo Yuan flipped the trash over easily. Next, he walked to the pile of books, then found a familiar book.</p><br/><p>“You then!”</p></div>\n</div>"}