{"title": "Chapter 831 - Look At the Size", "id": 831, "volume": 9, "url": "http://boxnovel.org/the-strongest-gene-chapter-831-look-at-the-size", "volume_title": "Volume 9", "body": "<h1>Chapter 831 - Look At the Size</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“Is there truly no other ways?” Chen Feng rubbed his head. Everything had been progressing too smoothly for him recently. It had reached a point where he believed he would be able to easily eliminate Luo Yuan. Unexpectedly, the greatest trap of all was waiting for him. If he dared to become a true god, there would only be a slight window of opportunity before Luo Yuan obtained total control over the world.</p><br/><p>In his original plan, Chen Feng had hoped that, after becoming a true god, even if he was immediately discovered, he would still be able to survive and grow some more, eventually becoming strong enough to prevail over Luo Yuan. But now? Forget about surviving, he would definitely be discovered by Luo Yuan. And Chen Feng himself would have to be the one to start the fight. Otherwise, the moment Luo Yuan discovered the godhood of misfortune, he would gain total control over the world.</p><br/><p>Even with Chen Feng being the one to start the fight, things would only work out if the godhood of misfortune chose to reappear at a later date. Otherwise, if the godhood of misfortune reappeared somewhere immediately after he became a true god, it would all be over.</p><br/><p>“Luck?”</p><br/><p>Chen Feng smiled bitterly. He believed that he his luck would not be too bad. After all, the power of luck was fused within his godly power. Sadly, the same was true for Luo Yuan. How lamentable. Luck would not work when dealing with Luo Yuan.</p><br/><p>“Is this purely a matter of luck?”</p><br/><p>Chen Feng was unwilling to accept this. This involved the fate of the entire world, yet it had to depend on luck? Chen Feng could not accept that. Furthermore, even if Chen Feng broke through into the true-god stage, would he truly be able to defeat Luo Yuan? Unlikely. As such, he needed more time. Otherwise, even if the first issue, that of the godhood of misfortune, was resolved, he could still be killed by Luo Yuan at any time. Facing an enemy at such a level, Chen Feng couldn’t rely on luck alone, despite him having some confidence in his luck.</p><br/><p>“Let me give it some thought.”</p><br/><p>He sank into contemplation. Time… True god… The world… Chen Feng’s thoughts spun rapidly. Suddenly, he looked at the innocent Xiao Ying in his sea of consciousness. Perhaps there was a solution to this!</p><br/><p>…</p><br/><p>At present, in the territories ruled by Luo Yuan, the furious Luo Yuan received a report that the mysterious person had vanished. That’s right, he had vanished.</p><br/><p>After challenging all the gods, that fellow had decisively vanished. This caused Luo Yuan to be incomparably furious. He had even begun to doubt the long-dead Chen Feng. Unfortunately, even after using Luck Aura, he received the same answer as always: Chen Feng was dead. As such, he could only give up on the thought that this was Chen Feng’s conspiracy.</p><br/><p>Luo Yuan raged. “Don’t you guys know to stop him?”</p><br/><p>The underling spoke cautiously. “Respected god-king, you told us to accommodate him in everything he does.”</p><br/><p>Shua!</p><br/><p>Luo Yuan’s expression darkened. It seemed like this was indeed what he had said. He rubbed his aching head. That mysterious person had gone missing. Perhaps that fellow had gone to challenge a godhood after challenging all the gods? That was quite possible. As Luo Yuan thought of this possibility, he became somewhat excited.</p><br/><p>“Immediately watch all locations attentively. The moment someone succeeds in a godhood trial, report it immediately. I have to know the locations of the challengers and the godhoods they obtain,” Luo Yuan said solemnly.</p><br/><p>“Yes,” the various gods answered. With their godly powers, especially those that were good at deducing, it would be quite easy to locate a challenger whenever one appeared.</p><br/><p>“Good.” Luo Yuan heaved a breath of relief. He had to obtain that mysterious person. However, he felt like he was getting somewhat easily irritated. This did not fit his character. A vague sense of crisis kept enveloping him. Was he thinking too much? Luo Yuan frowned as he wondered.</p><br/><p>He had planned in secret for so many years and had never been so worried. And now, after dominating the world for 30 years, there no longer existed an opponent for him. And yet he was still busy constantly scheming, trying to gain total control over this world. Why did he feel all jittery? Was it because success was now so near?</p><br/><p>Luo Yuan shut his eyes. He felt like he had to adjust his mindset to calm himself. Chen Feng was already dead. He could not allow himself to keep being influenced by Chen Feng like this. That damnable one percent chance of failure had already been dealt with. One percent… Right. Soon, Luo Yuan realized something. Shortly after, he began to deduce once again.</p><br/><p>This time, he arranged his entire plan once again and used Luck Aura to deduce his success rate. On top of that, several hundred analyzation and deduction abilities were used as support. Ultimately, he obtained a result: 100% success rate.</p><br/><p>Now, nobody in this world could stop him. He was the core of half the world. As for the other half, they could only struggle while standing at death’s door. Even the strongest of them was merely a major god. Among them, a true god could never appear, let alone one that could withstand him.</p><br/><p>With Chen Feng’s death, nobody remained that could threaten him. As for the future? Unfortunately, the moment he obtained full control over the world and rewound time, there would no longer be a future.</p><br/><p>Luo Yuan spoke steadily. “Let’s just proceed according to the plan.”</p><br/><p>Finally, he regained his calm. However, he never could have imagined that his deduction had a small issue. Indeed, in this world, nobody could stop him. But what about a different world?</p><br/><p>***</p><br/><p>A clear sky, blue seawater, and a golden sandy shore. It had been a very long time since Chen Feng had seen such a view. Naturally, one could not forget about the refreshing girls on the beach. They were all filled with vitality, especially the jiggling clumps of meat whenever they moved. Looking at them having fun, smacking volleyballs around, an incomparably comfortable feeling emerged within Chen Feng.</p><br/><p><em>So big, so fair. Tsk tsk… This is life… </em>Chen Feng lamented.</p><br/><p>“Hehe.” A gloomy voice resounded beside him. “Don’t you think that you owe me an explanation?”</p><br/><p>“Calm down, calm down,” said Chen Feng. “What is there to explain? Look… Luo Yuan is going to control the world. As such, I can only hide here. In any case, your Crystal Palace is located on an alien world. Isn’t it perfect how you and Xiao Ying can summon each other to your own worlds? I am only here to hide; I will leave not long after,” Chen Feng said with a smile. The one that had appeared and was talking to him was precisely Ming Yue.</p><br/><p>That’s right, this was The Crystal Palace of the great male lead, the stallion, the owner of a harem, Wang Chun. When everyone had ascended to godhood, Wang Chun had naturally done the same. After experiencing countless arduous hardships and numerous tribulations, he had finally ascended. As for the godly power he had gained, it was one that ultimately transformed the world of The Crystal Palace into a true alien world. Naturally, he alone could enter this world—as well as the Xiao Ying, who had a contract with Ming Yue.</p><br/><p>As for Chen Feng, he could only enter thanks to the synonymous spiritual energy he had with Xiao Ying. Back then, this was precisely how Ming Yue had gotten the wrong target to sign the contract.</p><br/><p>“Is that even what I am talking about?” Ming Yue was furious, so furious that her majestic breasts jiggled. “What! I! Am! Saying!” She pointed at Xiao Ying to the side and continued, “Why! Is! He! A! She!”</p><br/><p>Bastard! What she had signed was a marriage contract. Had Chen Feng not mentioned that Xiao Ying was his bro? Why was his bro a female?</p><br/><p>“Oh…” Chen Feng sank into silence. True. Even though Xiao Ying had not been able to assume a humanoid form back then, she had still been “usable.” She could have been long or short, soft or hard. Yet now, with her new humanoid appearance, it was indeed somewhat unfavorable for Ming Yue. Mhm…</p><br/><p>Suddenly, Chen Feng waved his hand. “Come. Xiao Ying, turn into a dragon. Let your wife take a good look at the size of a dragon.”</p><br/><p>Ming Yue: “???”</p></div>\n</div>"}