{"title": "Chapter 839 - Impossible to Unravel", "id": 839, "volume": 9, "url": "http://boxnovel.org/the-strongest-gene-chapter-839-impossible-to-unravel", "volume_title": "Volume 9", "body": "<h1>Chapter 839 - Impossible to Unravel</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“What if we restrict his power?” Chen Feng looked at Ming Yue and Shen Wang. “After becoming world controllers, the two of you should be able to regulate the laws of this world, right?”</p><br/><p>Ming Yue shook her head. “That won’t work. His power does not originate from this world.”</p><br/><p>Chen Feng: “…”</p><br/><p>He had almost forgotten that. This was like how, when Ming Yue had arrived in the outside world. She had not been subject to the laws of the world outside. For the same reason, Luo Yuan’s power wasn’t restricted by the laws of this world. In short, the power they gained as world controllers was completely useless against Luo Yuan? So world controllers were this weak? Chen Feng did not dare believe that.</p><br/><p>“Since he is incompatible with this world, his power won’t be restricted by this world’s limitations. Similarly, he will be rejected by the world. His body will suffer immense damage from each attack. He would have been reduced to ashes long ago if not for his restorative power…”</p><br/><p>Ming Yue was feeling very helpless. What could they do against a person with an undying body? At present, as they stopped attacking, Luo Yuan was given a chance to catch a break.</p><br/><p>He howled with laughter. “Hahahaha!” He was aware of the reason they had stopped attacking him.</p><br/><p>“Isn’t this surprising? Isn’t this exciting?” Luo Yuan laughed like a madman. “You bunch of idiots. You guys actually believed that you could destroy me with such a method? How naive. Now, have you guys realized how strong I truly am? Haha.”</p><br/><p>Bang! Bang!</p><br/><p>Chen Feng started raining punches down on Luo Yuan again. Alas, it was pointless.</p><br/><p>“Just this much? With this speed?” Luo Yuan kept sneering. “You can’t even defeat my clone, yet you dream of defeating my main body?”</p><br/><p>Bang! Bang!</p><br/><p>Chen Feng’s eyes gleamed coldly as he punched down furiously. His punches, which were suffused with his new godly power, were incomparably terrifying. This power… Luo Yuan’s heart throbbed, as he seemed to sense something. This new godly power of Chen Feng’s seemed to contain misfortune? After numerous punches, he seemingly understood something. What if this power was copied? Perhaps he would be able to obtain partial control over the world? After all, this power contained misfortune!</p><br/><p>If this godly power could be copied, he would obtain a partial power of misfortune. This would definitely work! Luo Yuan was tempted. Moreover, it seemed like Chen Feng had yet to realize this? Luo Yuan smiled at this realization.</p><br/><p>Luo Yuan continued to provoke Chen Feng. “Come at me, Chen Feng! Are you this weak?”</p><br/><p>“Hmph!” Chen Feng did not answer.</p><br/><p>Bang! Bang!</p><br/><p>He continued transforming his new godly power.</p><br/><p>Chen Feng seemed to be testing out the usage methods of his new godly power with Luo Yuan as the punching bag. He was trying to see which combination would be the effective one to defeat Luo Yuan. This was quite a sensible choice for their present situation. As for Luo Yuan, he did not mind at all. After all, this was a brand new godly power he was experiencing firsthand.</p><br/><p>Hum—</p><br/><p>Each time the new godly power hit his body, a shockwave was unleashed within his body and he absorbing a tiny amount. Each punch of Chen Feng’s supplied a small portion of the new godly power to him. With this, he also gained a small amount of the power of misfortune with each punch.</p><br/><p>Luo Yuan focused on extracting the traces of the power of misfortune before slowly converging them together. He was sure that the moment he compiled enough to form the complete power of misfortune, he would become a world controller as well. Haha, what a blockhead. Chen Feng was delivering to him precisely what he wanted.</p><br/><p>Luo Yuan had a crazy look on his face as he said, “Come at me!”</p><br/><p>Bang! Bang! Bang!</p><br/><p>Luo Yuan was attempting to anger Chen Feng. “Come! Kill me and Wang Yao will return to you! Kill me!”</p><br/><p>Indeed. With his provocations, Chen Feng began to fight him in close quarters. They were drenched in blood from their bitter battle. The strength of each punch was capable of shaking one to the core.</p><br/><p>“Chen Feng…” Ming Yue felt like Chen Feng was in a bad condition and wanted to advise him. However, she ultimately shook her head.</p><br/><p>Shen Wang sighed. “We only need to focus on guarding this world.” She could feel that the world was getting unstable. If the three of them continued working together against Luo Yuan, this world might collapse for real. With Wang Chun and the rest’s strength, they had no way of stabilizing this world. As such, the two of them could only focus on protecting this world.</p><br/><p>This was the only way to stabilize this world’s existence. As for Chen Feng, he was fighting Luo Yuan one on one. The two were completely drenched in blood, the ground trembling nonstop as shocking fluctuations spreading everywhere without stop.</p><br/><p>“Faster! Hit harder! Come! Don’t stop! Ah!”</p><br/><p>…</p><br/><p>Ming Yue: “…”</p><br/><p>Shen Wang: “…”</p><br/><p>Shen Wang was still anxious. “Is this really fine?”</p><br/><p>Ming Yue shook her head. “Don’t worry. It is enough for us to focus on stabilizing the world. This clone of Luo Yuan’s is already completely cut off from the outside world. Without knowing the real situation here, Luo Yuan’s real body will not dare to come hastily. Moreover, he doesn’t know that Chen Feng is here. Therefore, our best chance is to exhaust this clone to death. So long as he can’t contact the real body, it will be fine. We can focus on godhood separation after that,” Ming Yue said coldly.</p><br/><p>Shen Wang frowned. “How long will this take?”</p><br/><p>“In any case, we don’t lack time at all,” Ming Yue said unhurriedly. At present, with Chen Feng faking his death, the real Luo Yuan had no real competition. Whether it took one year or ten years, everything was worth it. As for Luo Yuan? Heh. After a powerful clone, one that was nigh undefeated, vanished in this world, would he dare to enter personally?</p><br/><p>No, he wouldn’t. In fact, the real Luo Yuan was indeed conflicted about this. Unknown to them, Luo Yuan had experienced something very terrifying before this. He had already faced a certain terrifying youth. That youth had easily destroyed Luo Yuan’s clone. He hadn’t even taken Luo Yuan seriously, yet the destruction of Luo Yuan’s clone had been instantaneous.</p><br/><p>Moreover, that youth hadn’t bothered severing the clone’s connection with the real world because he wanted to take the opportunity to come out into the real world to destroy that book, key to that youth’s world.</p><br/><p>That youth called Su Hao was too terrifying, as was the strength of the world within Godly Model Creator. What about the world of The Crystal Palace? Luo Yuan’s initial assumption had been that this world was extremely weak. After all, Ming Yue had once appeared in this world and Luo Yuan had seen her through the wristband. However… Mhm…</p><br/><p>Luo Yuan suddenly realized the flaw in his thoughts. Back when he had summoned Sun Yaotian from the world of Godly Model Creator, that fellow had been incredibly weak as well. However, the main character had still ended up being so terrifyingly powerful at the end of the book.</p><br/><p>Therefore, the way in which he had judged their strength was definitely incorrect. In the world of The Crystal Palace, Ming Yue or Shen Wang could very well be much more terrifying than he had imagined. Perhaps his clone sent there had been instantaneously killed as well? The mere thought caused Luo Yuan to tremble in fear. Go there with his real body? No way. That was way too risky.</p><br/><p>“What exactly is happening there?”</p><br/><p>Luo Yuan narrowed his gaze as he stared into the distance, waiting for the result. Provided he could even receive a result.</p></div>\n</div>"}