{"title": "Chapter 850 - Long Time No See", "id": 850, "volume": 9, "url": "http://boxnovel.org/the-strongest-gene-chapter-850-long-time-no-see", "volume_title": "Volume 9", "body": "<h1>Chapter 850 - Long Time No See</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Yes, Qin Hai must be the one scheming in the dark.” From what Luo Yuan had observed of Chen Feng’s life, he knew that the one closest to Chen Feng was Qin Hai. It reached a point where Qin Hai might even understand Chen Feng more than Wang Yao. If Qin Hai was the one pretending to be Chen Feng…</p><br/><p>Suddenly, Luo Yuan said, “Luck Aura. Lock on to Qin Hai’s coordinate.”</p><br/><p>Shua!</p><br/><p>Light swirled around. Soon, coordinates appeared. Surprisingly, this was the same place Chen Feng had died back then. Qin Hai was actually there!</p><br/><p>Luo Yuan’s eyes gleamed with a cold radiance.”It is him indeed!”</p><br/><p>Luo Yuan sneered. “So… are you trying to avenge Chen Feng?”</p><br/><p>The twitchy feeling vanished. As the strongest existence, only the unknown could cause him to feel twitchy. Now that he had confirmed that Qin Hai was the schemer, things were suddenly not as scary anymore.</p><br/><p>Shua!</p><br/><p>The first thing he did was rush over to the coordinates. Unfortunately, that place was now empty.</p><br/><p>“Did he leave because he sensed my arrival?”</p><br/><p>Luo Yuan wasn’t surprised. At present, the half of the world not under his control was the best at hiding from him. Since Qin Hai was planning to avenge Chen Feng, it was natural for him to be well versed in this.</p><br/><p>Luo Yuan sneered. “Nothing but a clown.” He was sure that regardless of how Qin Hai schemed, Qin Hai would not dare to face Luo Yuan openly, since he was way too weak.</p><br/><p>“I will just ignore him.”</p><br/><p>He sent his newest clone to continue to search for Qin Hai’s trail while he resumed his focus on his own affairs. After all, controlling the world was the most important matter for him. Godhoods were still appearing without stop. Luo Yuan didn’t even bother to look at these godhoods closely anymore. After all, the misfortune godhood would not be among them. His attention was focused on something else.</p><br/><p>“The Crystal Palace… Since this is where the clone vanished, it is pointless to continue sending people there. I might as well destroy the world directly,” Luo Yuan muttered to himself. Although the alien world was scary, Wang Chun was not qualified to summon any truly terrifying existences into this world. This was something Luo Yuan was sure of. Even back when Wang Chun summoned Ming Yue, her strength had been pathetically weak.</p><br/><p>Therefore, even if Wang Chun truly did summon that world’s true god out here, that true god’s strength would be greatly limited by Wang Chun. Luo Yuan did not fear this.</p><br/><p>Bang!</p><br/><p>With his very own hands, he destroyed the only entrance leading to the world of The Crystal Palace, which he currently held in his hands. This was the entrance he had obtained after his own world of The Crystal Palace was destroyed. Now, he had personally destroyed this entrance.</p><br/><p>Hum—</p><br/><p>Once again, Luo Yuan’s alien world became vacant. That’s right, Luo Yuan’s book ability was once again reset. For Luo Yuan, who possessed countless abilities, resetting a single ability was a simple feat. If this were anyone else, abandoning their main ability and starting from scratch would be an extremely idiotic choice no matter how one looked at it.</p><br/><p>“Let me select a new alien world.” Luo Yuan had a sharp gaze. “That shall be the world I break through in. This time, I will learn from my past mistakes. I will…”</p><br/><p>A deafening boom resounded, and Luo Yuan’s body trembled. This sound…</p><br/><p>Shua!</p><br/><p>His gaze abruptly shifted in a certain direction. There, in a distant desolate land, a familiar beam of light was descending. Even from so far away, Luo Yuan could see that world-piercing beam clearly. This was… the radiance of someone ascending! Moreover, this was an ascension into the true-god stage, not some normal stage!</p><br/><p>Bang!</p><br/><p>Luo Yuan shot upward. High above the air, he was able to get a clearer look. Indeed, this was the radiance of a true-god ascension!</p><br/><p>…</p><br/><p>Within a certain cave, Qin Hai crawled out, looking extremely sorry. Crawling out together with him was Miss Xiao Yue.</p><br/><p>“Must we do this?” Qin Hai asked with a bitter smile. Since Chen Feng’s departure, Xiao Yue was the most important person here. In her paintings, which depicted Chen Feng’s deaths, she herself had appeared as well. Throughout the years, Luo Yuan had used his Luck Aura to confirm Chen Feng’s death several hundred times. As for Qin Hai, Kong Bai, Xu Fei, Wu Hui, and some others, they were the closest to Chen Feng and had also been targeted by Luo Yuan.</p><br/><p>Therefore, any time they received a warning from Miss Xiao Yue, they had no choice but to flee. Fortunately, after so many years, the half of the world that was hostile to Luo Yuan had also researched some concealment and escaping methods with respectable effectiveness. When used against Luo Yuan, they had proven effective. This was why they had been able to flee from Luo Yuan.</p><br/><p>“This won’t do.” Qin Hai spread his hands. “Sooner or later, Luo Yuan will discover the truth. The only reason he hasn’t realized the truth is because we are too weak to be worth his attention.” In Luo Yuan’s heart, Chen Feng’s friends were but jokes. After all, Chen Feng was already dead.</p><br/><p>Xiao Yue ignored Qin Hai. Instead, she lowered her head and continued painting in silence. Shortly after, a brand new painting appeared. In it was only one person. Boundless radiance was on the back of this person.</p><br/><p>Qin Hai blanked. “Huh?” What was this?</p><br/><p>Right at this instant, he saw a smile on Xiao Yue’s face. Next, at a certain distant location, a resplendent radiance suddenly bloomed. This radiance greatly resembled the one in Xiao Yue’s painting.</p><br/><p>“That is…”</p><br/><p>Qin Hai was pleasantly surprised. Chen Feng had finally ascended! Qin Hai was not the only one shocked. When that beam of light appeared, the entire world was shocked.</p><br/><p>“A divine aura has descended!”</p><br/><p>“This is the sign of the appearance of a true god!”</p><br/><p>“Haha, finally, another true god is going to appear?”</p><br/><p>“But if I remember right, even the strongest among us is still a journeyman god… Who could this person be?”</p><br/><p>“I don’t know.”</p><br/><p>The various gods were discussing this. This true-god beam had appeared too suddenly, so suddenly they were completely clueless. As for those that were nearer to that beam of light, they noticed that, apart from that beam, a completely alien aura had descended as well. This alien aura was comparable to that of a true god!</p><br/><p>Bang! Bang!</p><br/><p>Terrifying booms resounded without stop. The boundless radiance shone brightly, as if two worlds were about to combine. Amid the boundless true-god radiance, a lone silhouette floated as he welcomed the radiance. Half of his body was out here in this world while the other half of his body was submerged in the boundless radiance, giving off an extremely odd appearance.</p><br/><p>Everyone exclaimed in admiration.</p><br/><p>“How strong!”</p><br/><p>“So this is the aura of a true god?”</p><br/><p>“This strength… He is definitely no weaker than Ye…”</p><br/><p>Regardless of how near they were, they could only see a silhouette amid the radiance. That radiance was too terrifying, so terrifying that nobody could approach.</p><br/><p>Suddenly, a certain god asked, “After this lord becomes a true god, will he fight Luo Yuan?”</p><br/><p>Instantly, all the excited gods sank into silence. True. Even if a true god appeared, would this true god fight Luo Yuan? After all, this was Luo Yuan, someone who had been a true god since long ago. Would this new true god have the courage to fight him?</p><br/><p>“Perhaps?”</p><br/><p>…</p><br/><p>The various gods were anxious. Unknown to them, in the faraway Kingdom of Luo Yuan, Luo Yuan found this more unbelievable than all of them.</p><br/><p>“How is this possible!” Luo Yuan howled. True god… Someone had actually broken through? Who? The Forest Goddess? In Luo Yuan’s mind, she was the closest to the true-god stage. However, when his gaze swept around toward that familiar forest, he found that the Forest Goddess was still lazing around. It was not her. The only reason Luo Yuan had established his kingdom near the Forest Goddess’s forest was to make monitoring her easier.</p><br/><p>Who could it be then? Qin Hai? No, not him. When he had been chasing after Qin Hai earlier, he had been able to sense a familiar power of clairvoyance. Although he had failed to catch Qin Hai, he could easily confirm that Qin Hai was still as weak as ever. Qin Hai had merely been relying on that clairvoyance to hide from Luo Yuan.</p><br/><p>If so, then who could it be? Luo Yuan was completely clueless.</p><br/><p>Luo Yuan had a solemn gaze as he came to a decision. “Looks like I have to pay that place a visit.” He would not permit a brand new true god to appear. Although he was much stronger than a newfound true god, Luo Yuan would not permit someone else to grow to such an extent.</p><br/><p>Shua!</p><br/><p>With a flash, Luo Yuan headed toward the location of that beam. Luo Yuan was able to cross an entire country in a flash. However, when he arrived, the boundless radiance had already silently vanished. The only thing he could see was a dim silhouette. Moreover, any traces of the true-god ascension had vanished cleanly as well.</p><br/><p>Luo Yuan did not bother chasing after that retreating radiance. He merely watched on silently. Suddenly, he laughed. He laughed wildly.</p><br/><p>“Too perfect. So perfect… I can’t find any loopholes. Breaking through and ascending, yet gone right before I arrived. Everything was calculated to perfection. And because of this, I have finally figured out who you are. In all these years of observing this world, I know that there is only one person capable of all this… Long time no see, Chen Feng!”</p></div>\n</div>"}