{"title": "Chapter 858 - Reset the World", "id": 858, "volume": 9, "url": "http://boxnovel.org/the-strongest-gene-chapter-858-reset-the-world", "volume_title": "Volume 9", "body": "<h1>Chapter 858 - Reset the World</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>In the world of The Crystal Palace, the tidal wave of time had stopped. The entire world was filled with bizarre swirling lights as the entire world seemed to be radiating the power of time. Luo Yuan was resetting the entire world.</p><br/><p>In a flash, before Chen Feng could do anything, the transformation began. Before his eyes was nothing but a boundless radiance. Every single inch of this world now had a luster like the surface of a mirror.</p><br/><p>“Luo Yuan…” Chen Feng inhaled deeply. Luo Yuan deciding to do this had indeed surpassed everyone’s expectations, even Chen Feng’s. However, the rest of the world wasn’t necessarily advantageous to Luo Yuan. It might be possible for this to be an advantage for Chen Feng instead. Naturally, Luck Aura should be able to put an end to this. After all, a location of chaotic time was akin to Luck Aura’s home ground. Unfortunately, since both of them possessed Luck Aura, the two auras counteracted each other. As such, the development of this world happened freely, without any outside interference.</p><br/><p>“Everyone that was assembled here has been split up, moved to random locations.” Chen Feng pondered. Although everything was in chaos now, he was still trying to arrange his thoughts as soon as possible. Luo Yuan and the numerous gods he had brought had also been affected by the power of time. As for Chen Feng and those on his side, they had also been transformed by the power of time. Not a single person could escape time. These people might appear in any random part of this world now.</p><br/><p>“My strength…” Chen Feng tried calling upon his strength. Fortunately, although Luck Aura’s effect had been nullified, it had still worked within his body. As such, he hadn’t received much effect from the power of time. At the same time, this also meant that Luo Yuan had likely been able to maintain his strength.</p><br/><p>Chen Feng’s eyes narrowed. “Luo Yuan. Was this your goal?” First, push this world to destruction, then reset it. Now, this world was no longer under Chen Feng’s control. With its transformation, this world had become even stronger and was now capable of enduring impacts from powerful gods. As for Luo Yuan, he was intending to kill each and every person on Chen Feng’s side.</p><br/><p>At a certain location within this world, a bolt of lightning flashed past. Illuminated by the radiance of this lightning was the nearby Luo Yuan.</p><br/><p>“It has begun.” Luo Yuan had a calm expression. Under his control, both Luck Auras had canceled each other out. Nevertheless, neither he nor Chen Feng had been affected much by the power of time. With this, he would have an easier time reaping his harvest. As for the 1,000-plus gods he had brought with him, regardless of their strength, they were fully under his control.</p><br/><p>A certain huge person appeared. “Lord.” This was a minor god that had just broken through under Luo Yuan. He was so weak that it was pitiful. However, his unique ability set was a rather remarkable one. Now, affected by the power of time, he had successfully become a major god. Boundless godly power filled his body.</p><br/><p>Luo Yuan was very satisfied with this development. “Excellent. Well then, time to start the hunt,” Luo Yuan said sinisterly. He and his 1,000 gods would be the hunters.</p><br/><p>The subordinate was somewhat anxious. “Those of The Crystal Palace…”</p><br/><p>“Don’t worry.” Luo Yuan smiled. “With the power of time’s transformation, this world has been reset. At present, Ming Yue and Shen Wang… Everyone originally of this world is in the void. Due to the power of time, they might be reduced into nothingness at any time. Therefore, before this transformation completes, they will remain in the void to await their fate, unable to appear in this world. Just make sure to end the battle before that,” Luo Yuan said emotionlessly.</p><br/><p>“Yes.” The gods obeyed. Before them, each inch of this world was shining. Even more astonishingly, silhouettes of familiar-looking people occasionally flit past.</p><br/><p>“That silhouette… seems to be that person called Kong Bai?” a god guessed.</p><br/><p>“Yeah.”</p><br/><p>“Let’s go.”</p><br/><p>They exchanged glances before trailing after Kong Bai. The so-called destruction of the world was in fact targeted at Chen Feng’s side. Before coming into this world, those on Luo Yuan’s side had naturally made some preparations so as to not be weakened by the time chaos. After all, this power of time had merely rippled out randomly instead of being manually controlled by Wang Yao.</p><br/><p>Therefore, they had been able to somewhat resist the effects of the time chaos. However, there was one caveat to this. If they encountered a time effect that was flowing forward, their resistance would be disabled. Only when time flowed backward would what they had prepared resisted the power of time, lessening the effects on them.</p><br/><p>Naturally, there was a limit to this. A good example was a rather unlucky god that encountered a terrifying time flow that directly reversed 1,000 years worth of time. Despite his prepared resistance, that god had still been directly reduced to nothingness. After all, he had been directly reversed to a time prior even to his conception in his mother’s womb. In such a condition, how could he have been saved?</p><br/><p>However, that was an exception. The large majority of these gods still maintained their peak combat power. Their targets were Chen Feng and his friends. After killing them, Luo Yuan would gain control over the world, becoming a supreme existence.</p><br/><p>“Huh, look over there.”</p><br/><p>“There seems to be someone there.”</p><br/><p>“He doesn’t look like one of us. In fact, he resembles that Xu Fei.”</p><br/><p>“Let’s go.”</p><br/><p>Yet another bunch of gods set forth. In numerous parts of this world, the instant they caught a glimpse of Chen Feng or his friends, they began cautiously trailing whomever they had seen. Their goal was the elimination of these people.</p><br/><p>“There’s someone there as well.”</p><br/><p>“Could that be Chen Feng?”</p><br/><p>“If it is Chen Feng, remember to report it. We are definitely not his match. Let our lord deal with him.”</p><br/><p>“Understood.”</p><br/><p>“No, not Chen Feng. He looks like Qin Hai?”</p><br/><p>“Follow him!”</p><br/><p>One by one, Chen Feng’s friends were found.</p><br/><p>“Look for a chance to make a move. Don’t leave anyone alive,” said an emotionless voice.</p><br/><p>“Understood.”</p><br/><p>…</p><br/><p>In the corner of a certain time barrier, a certain person was crouching and staring ahead blankly. He was evidently still shocked by this transformation. From what he was wearing, it was evident that this person was precisely Kong Bai.</p><br/><p>“Is it him?”</p><br/><p>“Yes,” a god confirmed.</p><br/><p>This alien world wasn’t particularly big. Even though everyone had been scattered everywhere, more than 10 gods had ended up being washed into this region alone. After confirming their coordinates with their wristbands, they had begun their hunt. This time, their target was Kong Bai, whom they had discovered.</p><br/><p>“So what how strong are you guys now?” a god asked.</p><br/><p>“I am at a journeyman god.”</p><br/><p>“Same.”</p><br/><p>“I’ve grown somewhat and am now a journeyman god as well.”</p><br/><p>“I’ve become a major god,” a certain god announced proudly.</p><br/><p>He was one of the lucky gods that had encountered a power of time that was flowing forward.</p><br/><p>“Well, you will be the captain for this mission then.”</p><br/><p>“All right.”</p><br/><p>Cautiously, they began to approach Kong Bai. Kong Bai had seemingly not noticed them. No, rather, he seemed to be ignoring everything. Since the moment he had appeared here, he had been in this blanked state. His back was against them as he blankly stared at something. They had no idea what was going on in his brain at the moment.</p><br/><p>The major god sneered. “It doesn’t matter what he’s thinking about.” They knew of Kong Bai. He seemed to have been quite weak originally. Even if he had luckily encountered a power of time that was flowing forward, he still wouldn’t be that strong. After all, if the power of time he had encountered had been too powerful, the shockwave itself would have been sufficient to kill him. After all, 50 years and 500 years were two entirely different concepts.</p><br/><p>The major god told the other gods to charge forth. “Go!”</p><br/><p>Bang!</p><br/><p>Countless powerful attacks erupted. Although they didn’t think that Kong Bai could do anything against them, they still attacked with all their might, aiming to end this mission as soon as possible. Right at this instant, Kong Bai seemed to finally notice the godly power fluctuations behind him as he slowly turned his head around. The gods were immediately alarmed, as that face… wasn’t Kong Bai’s!</p><br/><p>This face horrified all the gods present. Kong Bai, who had already been ugly, seemed to have experienced something unknown in the endless river of time. At present, his face was filled with wrinkles and creases. Moreover, on his skin were numerous dark spots that only the elderly had. Kong Bai’s current appearance successfully shocked even the gods, who had seen numerous life-forms.</p><br/><p>So this was an aged Kong Bai! Even more terrifying were his eyes. His originally lively and bright eyes seemed to have been affected as well. Numerous brown spots could be seen in his eyes, giving off quite a horrifying look.</p><br/><p>The major god was somewhat shocked. “This…”</p><br/><p>A hoarse voice waffled out of Kong Bai’s mouth. “Can I ask you a question? Who’s the most handsome man?”</p></div>\n</div>"}