{"title": "Chapter 862 - Hunting Ground", "id": 862, "volume": 9, "url": "http://boxnovel.org/the-strongest-gene-chapter-862-hunting-ground", "volume_title": "Volume 9", "body": "<h1>Chapter 862 - Hunting Ground</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>The Crystal Palace.</p><br/><p>In this bizarre world of time, there were two core areas that hadn’t experienced any changes. Qin Hai was not the only one who was making use of time to cultivate. There were two people who were even better at exploiting time than Qin Hai. These two were Luo Yuan and Chen Feng. With the passing of time in this world, these two were the only ones here capable of utilizing time to perfection.</p><br/><p>Why was that? That was due to the power of luck they both possessed. Although their respective powers of luck counteracted each other, they could still use those powers on themselves. Therefore, they were able to avoid stepping into the time zones capable of killing them. As for Chen Feng, even though he had lost Luck Aura when Spirit separated from him, his new godly power had fused with the power of luck and misfortune. Therefore, he was still able to compete against Luo Yuan’s Luck Aura.</p><br/><p>These two were the only ones who were cultivating madly. Luo Yuan’s goal was extremely simple. One of his reasons for destroying and resetting this world was so he could make use of the laws of time to cultivate, to become even stronger. Naturally, his other reason was to sever Chen Feng’s escape route.</p><br/><p>That’s right, the moment this world had been transformed, it had become a path of no return. The world of The Crystal Palace could no longer be destroyed using regular methods. Therefore, Luo Yuan no longer needed to worry that he would be eternally banished from his original world through the destruction of this world.</p><br/><p>He had had enough of the days of Chen Feng plotting against him in the dark, of the days where Chen Feng kept hiding from him. This time, he had forced Chen Feng to the foreground. Now, the two of them were on a fair battlefield. Chen Feng no longer had the advantage of having the world of The Crystal Palace as his backup plan.</p><br/><p>This was a battle that would end with either complete victory or complete defeat. This was Luo Yuan’s death sentence for Chen Feng. This was their decisive final battle.</p><br/><p>What about Chen Feng? He was also cultivating. The destruction of this world had indeed surpassed his expectations. However, since it was already done, he might as well make use of it to cultivate, to grow stronger. As for the others? He had no time to be bothered with them. This was the only chance he had at destroying Luo Yuan.</p><br/><p>If he succeeded, everything would return to normal. If he was defeated, everything would end.</p><br/><p>“The final victory shall be mine.” Luo Yuan had a resolute gaze. Although this seemed like a stupid action on his part, after studying the method Luck Aura had come up with, he had further perfected it. The 1,000 gods he had brought were precisely his trump card.</p><br/><p>The gods he had brought would also become extremely powerful. Even without being directly hit by the power of time, those gods would surely take this opportunity to cultivate. After all, they all had life spans in the thousands of years. Naturally, they would be better suited than normal humans in this world of time.</p><br/><p>Those gods would end up extremely powerful and would serve as his trump card. What about Chen Feng? Hehe. In this situation, with the original inhabitants of this world sealed in the void, with the small number of people Chen Feng had on his side, they wouldn’t be able to do much. They were nothing but cannon fodder. This was Luo Yuan’s belief.</p><br/><p>…</p><br/><p>At a certain location, after the initial chaos, the gods reacted quickly to the changes of this world. They all discovered one advantage they held over others: their life spans. As gods, they possess longer life spans. They could absolutely make use of the power of time to grow to their utmost limit.</p><br/><p>And thus, the gods began to enter a region of flowing time one after another. Some of them were able to reach the major-god stage, and some even reached the peak of the major-god stage. Each of the initially weak gods was now extremely powerful. Just as Luo Yuan had guessed, they all thirsted for strength as well.</p><br/><p>“Haha. Turns out even I am capable of becoming a major god. Unfortunately, this is my limit. Entering the true-god stage depends on one’s comprehension and numerous factors. The passage of time alone will not help in this.”</p><br/><p>“Same here.”</p><br/><p>Some of them that had reached the peak major-god stage began to leave the region of flowing time. Naturally, there were also some whose progress stopped after reaching the journeyman-god stage. Even after exhausting 1,000 years of their life span, they were still the weaklings they had been before. Time passed. When the gods left the region of flowing time, it was as brand new versions of themselves.</p><br/><p>“Haha. Where are the damnable humans?”</p><br/><p>“Come, let us do battle!”</p><br/><p>The gods were brimming with confidence. And thus, at a certain place with a body of water, they found Xu Fei.</p><br/><p>“Look, a human.”</p><br/><p>“Haha, finally, we found this damnable prey.”</p><br/><p>They charged forth in excitement.</p><br/><p>Bang!</p><br/><p>Xu Fei hurled a simple fist out. Instantly, a major god was pierced through by that punch. As the other gods excitedly charging forth saw this, they immediately stopped. With horror on their faces, they stole a glance at Xu Fei before they trembling all over. Immediately, they turned around and began to flee.</p><br/><p>“Damn it. What damnable strength is that?”</p><br/><p>“Why is this Xu Fei fellow so scary?”</p><br/><p>They were filled with fear. Alas, none of them knew the answer. When Xu Fei came charging at them, only a small number of them were able to flee alive. In a different location, a group of gods had encountered Kong Bai.</p><br/><p>The group of major gods provoked Kong Bai arrogantly. “Hey, ugly.”</p><br/><p>“Oh?” Kong Bai’s head turned around, revealing his aged face to them. Within his eyes was boundless red. After a short while, the aged figure that was Kong Bai left, leaving behind an area drenched in blood. On the ground were numerous corpses with countless holes in them.</p><br/><p>…</p><br/><p>“How is this possible…”</p><br/><p>The few gods who had been able to escape were filled with fear. Kong Bai! That elderly Kong Bai had been so powerful as well! And thus, the various gods gathered together. The joy from their breakthroughs was now gone. Xu Fei had become a true god. Kong Bai had seemingly reached the true-god stage as well. This was the only explanation for their ability to crush two entire groups of major gods. Right at this time, yet another group returned. Different from them, this group was still intact.</p><br/><p>“You guys…”</p><br/><p>“We encountered Qin Hai, the elderly Qin Hai.” That group of gods was ashamed. “He held a sword in his hand. He never even attacked. Merely his act of picking up the sword was sufficient to give us a feeling of death. He is too terrifying. Therefore, we left and returned here.”</p><br/><p>They were all ashamed of themselves, as they hadn’t had the courage to even fight. In short, they had been scared off.</p><br/><p>“Oh. It’s not that we were scared of him. However, we are of the opinion that Qin Hai is quite strong now. We decided that it is better to return with more reinforcements,” they said awkwardly. After that, they looked at the other gods and asked, “Hey, why are there so few of you guys here?”</p><br/><p>The other gods all sank into silence. In short, running away was actually the correct choice?</p><br/><p>The other gods sighed when they saw this still-intact group. “You did the right thing. It looks like even Qin Hai has reached the level of a true god. These people are no longer existences we can deal with.”</p><br/><p>They had unsightly expressions. Those feeble humans were actually better than them at exploiting this world? They could not accept this.</p><br/><p>“What should we do, then?” they asked with a blank look.</p><br/><p>“Try to hide from the humans to the best of our ability. If anyone is unlucky enough to meet one, just run with everything you have,” the leader said with a bitter smile.</p><br/><p>“…”</p><br/><p>The other gods trembled. This was the only thing they could do. It turned out that they had transformed from hunters to prey. The almighty gods were now the prey of some humans! How sad!</p><br/><p>A certain god was unwilling to accept this. “I won’t run!” This was too shameful.</p><br/><p>Suddenly, a voice drifted over. “Are you sure?”</p><br/><p>“Of course,” that god answered confidently. “I am a major god! I—” Suddenly, he noticed that all the gods around him had horrified expressions on their faces. Only now did he realize that the voice that had asked him that question earlier… did not seem… right? He raised his head abruptly. With horror, he found that Xu Fei was there!</p><br/><p>“You… How is it possible for you to be here?” Fear was plastered all over his face.</p><br/><p>Xu Fei had a wide smile on his face. “Why else did I allow you all to escape? Naturally, it was for the sake of dealing with you all in one swoop after you all gathered.”</p><br/><p>“Damn it!”</p><br/><p>The faces of the gods fell. Flee! With a roar, the gods scattered everywhere.</p><br/><p>Swish! Swish! Swish!</p><br/><p>Streaks of light flashed about, followed by miserable screams from the various gods. As of this moment, the gods were but prey.</p></div>\n</div>"}