{"title": "Chapter 874 - The Ambition of the Backup Plan", "id": 874, "volume": 9, "url": "http://boxnovel.org/the-strongest-gene-chapter-874-the-ambition-of-the-backup-plan", "volume_title": "Volume 9", "body": "<h1>Chapter 874 - The Ambition of the Backup Plan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Somewhere within the Kingdom of Luo Yuan, a streak of light tore through the sky. A crack was ripped in space, and from that tiny crack, a huge figure appeared.</p><br/><p>Ka! Ka!</p><br/><p>The huge figure squeezed out of the crack and finally made it outside, and the crack collapsed. What had appeared from the crack was actually a huge palace. Below the palace was Chen Feng, who had been carrying it along all the while with his teeth clenched.</p><br/><p>Clang!</p><br/><p>The palace landed on the ground loudly. Chen Feng’s figure floated down. Behind him, that huge crack began to slowly close up. Chen Feng had returned!</p><br/><p>“Haha, come, I saw something.”</p><br/><p>“This might be some treasure from some alien realms.”</p><br/><p>“I saw a huge palace.”</p><br/><p>Some excited voices could be heard as a bunch of bizarre life-forms appeared. The first thing they did was surround this place. “Eh? Someone is already here.”</p><br/><p>“Heh, kid. Go away,” said one of the life-forms. “This is not something you can touch.”</p><br/><p>Chen Feng merely gave him an indifferent glance.</p><br/><p>Hum—</p><br/><p>A faint radiance pulsed out. Instantly, that life-form, who was as powerful as a major god, turned to ash and scattered in the air.</p><br/><p>The remaining life-forms were instantly alarmed. Instantly killing a major god with such ease? Who was this fellow? This strength… A true god? Their expressions shifted as they immediately planned to retreat. Alas, a faint ripple swept past them instantly, reducing them all to dust.</p><br/><p>“Why did you opt to appear when I am in a bad mood?” Chen Feng said with an indifferent expression as the dust scattered around.</p><br/><p>“Have I… finally won?”</p><br/><p>Chen Feng was feeling somewhat melancholy. Indeed, he had won. This battle had been too hard, and the casualties too high. Qin Hai, Kong Bai, Xu Fei… everyone was dead! For this victory, they had given everything. However, it was still not the end. They had helped him with the first half of the plan. The second half of the plan was all in the hands of Chen Feng. Chen Feng had a resolute gaze.</p><br/><p>That’s right, this was not the end. Although Luo Yuan was dead…</p><br/><p>“Will you die just like that?”</p><br/><p>Chen Feng’s gaze was cold. Everything had progressed too smoothly. Luo Yuan had died too easily. Although he had already used many of his trump cards, this had still progressed too smoothly. Chen Feng hadn’t felt any struggle coming from Luo Yuan. Nor had he felt Luo Yuan’s despair. Years of his hard work had gone down the drain just like that. Was he truly willing to accept this fate?</p><br/><p>Why had Luo Yuan not felt despair in the face of defeat? The answer was quite simple: he had still had hope. Even if the hope was small, Chen Feng was able to figure out what Luo Yuan’s hope was, from what he had learned from Chen Yuan.</p><br/><p>A clone! Luo Yuan’s clone was still out here in the outside world. Since Chen Yuan had been able to survive independently after severing his ties with Luo Yuan in the alien world, the same would have been true of the clone here when the real body arrived on the alien world.</p><br/><p>Therefore, though the real Luo Yuan was already dead, in the outside world, there was still a clone. This clone wasn’t as strong as the real body. Based on what Chen Yuan had said, regardless of how strong a clone was, even with the help of the real body, the clone could only reach high-tier true god. This level was still too far from what the real body was capable of.</p><br/><p>Therefore, the clone here would at most be a high-tier true god. Moreover, he would be forever stuck at that level. After all, a clone was still a clone. As such, based on their guesses, the clone Luo Yuan had left behind would never be used to face Chen Feng. After all, if Chen Feng could even defeat the real body, what could a mere clone do?</p><br/><p>That was why the clone would not be used for battle. He would only appear at a certain moment, a certain crucial moment. What would that crucial moment be? Chen Feng sank into contemplation.</p><br/><p>…</p><br/><p>Somewhere amid the wilderness was an immense pitch-black coffin. The coffin was covered in seals and nailed securely to the ground by numerous nails as it lay dormant within this place of boundless darkness. It appeared so very sinister. Suddenly, the coffin began to tremble violently. The nails began to vibrate until, ultimately, it all burst apart.</p><br/><p>Bang!</p><br/><p>With a loud boom, the coffin burst apart.</p><br/><p>A figure slowly crawled out of the collapsed coffin. His body was extremely stiff, and he had an overcast expression on his face. Evidently, he had been slumbering here for an extended period of time.</p><br/><p>“The real body has died.” This was his first sentence. Slowly, he walked out. His appearance was precisely that of Luo Yuan!</p><br/><p>“Before leaving, the real body formed me, the clone. Next, he placed me in eternal slumber, isolating me from him. However, I was linked directly to the alien world he controlled. The moment that alien world was destroyed, I woke up. The moment I woke up, some things that originally belonged to only the real body were transferred over to me. At that moment, I became the true Luo Yuan.”</p><br/><p>He arranged his thoughts.</p><br/><p>“Now… the destruction of the alien world signifies that the battle has ended. However… since the real body is nowhere to be seen, that proves that the battle ended with Chen Feng’s victory.”</p><br/><p>He sighed. His memories began recovering as he fused with the memories that used to belong only to the real body. As of this moment, he was the real body. Everything Luo Yuan had left behind before leaving was for the awakening of this clone here at this place. In fact, this was a trick he had learned from Chen Feng.</p><br/><p>Since Chen Feng could trick his clone into cutting ties with him, could he not apply the same concept in creating a new clone? This was what he had considered. This was what he had done. Slowly, this new Luo Yuan’s strength grew. As the memories washed over him, he recovered completely. This Luo Yuan was nearly equivalent to the real Luo Yuan prior to his departure to the alien world.</p><br/><p>Naturally, he did not have any memory of the events that had transpired on the alien world. After all, this clone had been formed before Luo Yuan left for the alien world.</p><br/><p>“Let me think about it. Based on the memories, I managed to figure out about the existence of Chen Feng. To prevent my plans from being seen through, I used an extremely idiotic method to deal with him. I decided to attack the alien world. I would collapse the flow of time there before killing Chen Feng. It seems like that plan failed.”</p><br/><p>Luo Yuan sighed. He had no idea how the defeat had happened, though.</p><br/><p>However, based on the memories left behind, during his moment of defeat, he should have destroyed the entire alien world. That was how this clone would wake up. The real body had indeed done that. The alien world had been destroyed. What about Chen Feng? Was he still alive? Or had he perished together with the real body?</p><br/><p>For some reason, Luo Yuan wished that both Chen Feng and the real body had perished together. That would be the perfect conclusion. After all, he knew all too well how terrifying Chen Feng was. No matter how one looked at it, in the battle between the real body and Chen Feng, the real body was absolutely superior. Yet Luo Yuan had still suffered defeat. This was quite horrifying. How strong was Chen Feng?</p><br/><p>He was a clone of Luo Yuan. To be precise, he was a duplicate of Luo Yuan. Despite that, there were still minute differences between them. As an example, their strength. The real body had possessed heaven-defying strength at the level of peak true god. As for this clone here, he was merely a high-tier true god. Therefore, despite sharing the same memories and thought process as the real body, the way they dealt with things would be different.</p><br/><p>“If Chen Feng can defeat even the real body, I am not his opponent.” Luo Yuan knew himself well. If Chen Feng, that fellow who had defeated the real body, was still alive, he was definitely not an opponent this clone could contend against. Luo Yuan racked his brain and was shortly able to think of something. Perhaps this was also a gift left behind by the real body. After all, the two were one and thus shared similar thought processes.</p><br/><p>Luo Yuan calmly analyzed the situation. “Now, Chen Feng is out there in the open while I am here in hiding. My advantage is Chen Feng not knowing that I am still alive.”</p><br/><p>Back then, Chen Feng had tricked him for over 30 years by faking his death. Now, it was his turn to return the favor. He would hide, waiting for the perfect moment to make a fatal strike toward Chen Feng. He was Luo Yuan! Even though he was a mere clone, he still desired to control the world. The little flame Luo Yuan had left in this clone was presently burning brightly.</p></div>\n</div>"}