{"title": "Volume 2 - Chapter 7: Comrade", "id": 7, "volume": 2, "url": "http://boxnovel.org/sevens-volume-2-chapter-7-comrade", "volume_title": "Volume 2", "body": "<h1>Volume 2 - Chapter 7: Comrade</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Comrade</p><br/><p>Morning as usual.</p><br/><p>The only difference was that from the time I fought Aria, this was the first we would be leaving the city to fight monsters.</p><br/><p>I replaced my sabres again, and the weapons storekeeper was quite amazed when I showed up ordering the same thing again.</p><br/><p>He even recommended me to go to Centralle, and purchase a better one, or to change my weapon preferences.</p><br/><p>Rather than being fixated on the sabre, it was the weapon I had become used to handling, so I think I’ll go with them for a while.</p><br/><p>We met up with Zelphy-san and headed to the guild to find it in quite an uproar.</p><br/><p>A large bulletin board with the words ‘Emergency Request’ was posted near the desks on the second floor.</p><br/><p>A majority of the adventurers had their eyes turned towards it, but after making bitter faces, they headed towards the same boards they always checked for normal requests.</p><br/><p>“I wonder what happened.”</p><br/><p>As Novem said that, we also ended up checking it out of curiosity.</p><br/><p>Aria also seemed interested, but Zelphy-san’s expression wasn’t soft.</p><br/><p>The request we found when we went up to the bulletin was for the search for a party that hadn’t returned over their stated duration, and an investigation of the land.</p><br/><p>“Ah, if you don’t return by your set date, a search party goes out, right”</p><br/><p>I recalled what Zelphy-san had told me, and she nodded. But looking at the names written over the paperwork, she began to shake her head.</p><br/><p>“You’re half right. I taught you our official stance, but in truth, it’s more of an investigation into why the party in question vanished. ”Criminals and monsters, or perhaps a labyrinth. There are as many reasons out there as you can think of. It’s to make sure the next ones who take their path don’t fall prey to it.”</p><br/><p>Half right.</p><br/><p>The intention wasn’t to save them, but to investigate why they had exceeded their duration.</p><br/><p>If you wanted to rephrase it, sending aid to the lost party was the second priority.</p><br/><p>Novem looked at the request formed, confirmed the party members’ ages, and seemed to have noticed something.</p><br/><p>“Did these people perhaps hire a guild advisor?”</p><br/><p>Zelphy-san silently nodded, before letting out some toxic words.</p><br/><p>“That’s why I told him. That he should just go retire already… after coming this far, there’s no point if you die, is there.”</p><br/><p>One of the names on the form had a red line running through it.</p><br/><p>That was a sign that the one whose name had been carved on the guild card had received injuries leading to the ceasing of prolonged life activity.</p><br/><p>… So summarize, death.</p><br/><p>Perhaps out of luck, or because they were covered for… the five young adventurers seemed to be alive.</p><br/><p>“H-hey… someone’s going to go save them, right?”</p><br/><p>Aria said that and looked around, but while the adventurers passed their eyes over the emergency request, they didn’t seem to have the intentions of accepting it.</p><br/><p>“… The veteran adventurer that died was a strong one among those in Dalien. While it may be a town of newbies, he would’ve been considered relatively strong even within the main force. A man like that has died.”</p><br/><p>… To put it shortly, it would be difficult.</p><br/><p>Dalien had an abundance of odd jobs to be found, but the feudal lord himself took the initiative to subjugate dangerous monsters and clear labyrinths.</p><br/><p>While it may be convenient for those that had just joined the trade, there was some dissatisfaction to be had once they graduated from newbie status.</p><br/><p>Should I put it as their focus on local interest? Of course, there are some that continue to work in Dalien as adventurers, but a large majority of them leave, and head for a town or city more suited for them.</p><br/><p>“This is bad. The guild was just requiting skilled adventurers for the labyrinth that manifested not too long ago. The feudal lords troops have yet to return either.”</p><br/><p>A labyrinth emerged, and the guild solicited help in subjugating it.</p><br/><p>For that sake, a majority of battle-oriented parties had ventured off from the city.</p><br/><p>(Come to think of it, I did hear something like that.)</p><br/><p>Remembering the rumors I heard circulating around the guild, I looked around</p><br/><p>It’s probably not that there wasn’t a single skilled adventurer here. But since they’re trying to recruit people for the request in this fashion, I guess there wasn’t any that could take on the job.</p><br/><p>“… I heard that if you take on an emergency dispatch, the guild puts out quite a reward as well.”</p><br/><p>Novem seemed surprised that none of the other adventurers wanted to participate.</p><br/><p>There, Zelphy-san spoke.</p><br/><p>“Survival over loot. There may be some out there who’ll take the challenge to raise their names, but… this is troublesome. The place they headed was a dangerous one. If played poorly, whole parties can get annihilated.”</p><br/><p>It’s not like the entire landmass of Dalien was safe.</p><br/><p>For places outside of human inhabitation, there isn’t much of an opportunity for soldiers to head forth and suppress dangerous elements.</p><br/><p>As we were looking at the request form close the counter, Hawkins-san called out to use.</p><br/><p>“Zelphy-san, can I have a little of your time?”</p><br/><p>“… Boss.”</p><br/><p>Hawkins-san was letting off a sterner atmosphere than usual, as he called Zelphy-san over.</p><br/><p>“Did you see the request?”</p><br/><p>“Yep, saw it. But from the contents, I get the feelin’ it should have been posted up quite a while ago. Did somethin’ happen?”</p><br/><p>It was much too far past the point where it would be strange if they hadn’t returned.</p><br/><p>Even so, today was the first time the urgent request hade made an appearance.</p><br/><p>“… It was a blunder on our side. I deeply apologize.”</p><br/><p>“An apology doesn’t clear up the matter, though. It probably wasn’t your slip up, boss, but we’re all putting our lives on the line here. Has anyone set out the request’s location yet?”</p><br/><p>Permission to head off to the designated point hadn’t been granted yet.</p><br/><p>But since the news came late, there may have been adventurers who had set out for the dangerous area unaware.</p><br/><p>“Perhaps our luck was good this time. The parties that usually used the area as their hunting ground have headed off to the labyrinth. It’s just that, that being the case, we can’t find any adventurers willing to head over.”</p><br/><p>“Wouldn’t it be fine if you went, boss?”</p><br/><p>On Zelphy-san’s joke, Hawkins-san didn’t really return an answer.</p><br/><p>(Both of them are a little angry.)</p><br/><p>From what I can hear from their conversation, it might have been an acquaintance.</p><br/><p>“Um, Hawkins-san. So what was the reason you called Zelphy-san over then?”</p><br/><p>Novem sought confirmation, and Hawkins-san started apologizing to us.</p><br/><p>“It’s an urgent dispatch from the guild. We might be temporarily borrowing Zelphy-san. For that time period, the guild will personally cover the expenses.”</p><br/><p>It doesn’t look like he’s counting us in as a plausible fighting force.</p><br/><p>(But that may be natural.)</p><br/><p>As I thought that, I heard the Second’s voice.</p><br/><p>『Do the measures taken by the guild in times like these change by the city? From what I remember, I get the feeling I heard of them forcefully sending out people against their wills.』</p><br/><p>The one who answered was the Sixth.</p><br/><p>『The times change, and the guilds structure changes with it, but… Dalien’s adventurers aren’t of the best quality, so perhaps this sort of thing happens often.』</p><br/><p>The ancestors sounded quite calm.</p><br/><p>It’s not like there’s a need to panic, but I feel their reactions are a little too dry.</p><br/><p>Zelphy-san was making a reluctant face, but she sighed and nodded.</p><br/><p>“If it’s a request from boss, I can’t really decline. It’s just that I also want to know what sort of actions the guild is taking on it.”</p><br/><p>Hawkins-san closed his eyes, and after a while of silence, he opened them and answered.</p><br/><p>“The opinion of the higher-ups is… it was the mistake of a staff member, but they concluded that it was something that could happen to the best of us. In this instance, I doubt any punishment sil be handed down.”</p><br/><p>“… Boss, in that case, none of us’ll be satisfied. I hated that man for his mouth, but there are plenty of adventurers who’ve been saved by him. While I loathed him, he’s helped me out twice or thrice. Are you tellin’ me to accept this?”</p><br/><p>The talks seem to have started down a different direction.</p><br/><p>The three of us were being left behind.</p><br/><p>“Zelphy-san is dropping out of our party to fulfill an urgent request, it seems. In that case, what should we do today?”</p><br/><p>I began to ponder today’s plans.</p><br/><p>Odd jobs were fine, but since we had a party of three, I wanted to go out to fight monsters if possible.</p><br/><p>I wanted to experience Growth soon, and more importantly, I’ll becoming needlessly specialized at physical labor at this rate.</p><br/><p>(I mean, they’ve even started trying to lure me over.)</p><br/><p>The site foreman offered that I quite being an adventurer, and come work for him. I had to give a bitter smile, and refuse.</p><br/><p>It’s not that I hated it, but the earnings from it wouldn’t support two, so it wasn’t plausible.</p><br/><p>Aria looked at Zelphy as she spoke.</p><br/><p>“I wonder if Zelphy will be fine. I mean, a skilled adventurer of Dalien perished, right?”</p><br/><p>Novem tried to calm her down.</p><br/><p>“It may not have been a monster or foe. It’s not unthinkable that it was an accident. I also doubt that they’ll be sending Zelphy-san out alone.”</p><br/><p>There was a party of six, one died, and the rest were missing in action.</p><br/><p>The possibility it was an accident was actually quite high.</p><br/><p>As I thought that, the First called out to me.</p><br/><p>『Lyle, you participate as well.』</p><br/><p>What’s this, all of a sudden? I thought, but the First probably had his reasons.</p><br/><p>The Third was of the same opinion.</p><br/><p>『Perhaps that’s for the best. And wait, in a request like this, the efficiency will generally rise if Lyle joins in.』</p><br/><p>The Sixth also agreed.</p><br/><p>『If it’s mine and the old man’s (Fifth Generation) Skills, then finding them will be simple, and you’ll be able to avoid danger.』</p><br/><p>(I see. So if I use the ancestors’ Skills, the efficiency will be on another level.)</p><br/><p>Especially the Fifth and Sixth. When used together, they were quite an amazing one.</p><br/><p>I can put up a map of my surroundings in my head, and enemy and ally… monster locations and traps can be known to me for a certain extent of distance.</p><br/><p>But if I said I wanted to participate, would Hawkins-san accept that?</p><br/><p>The Second was the same as me.</p><br/><p>『If Lyle said he wanted to join, would they permit it?』</p><br/><p>The Fifth…</p><br/><p>『What are the merits of him going out for that? They’re a group completely irrelevant to Lyle. Also, if he starts making himself stand out, then the reputation we worked so hard to lower in Dalien would be pointless.』</p><br/><p>After hearing all their opinions, the First spoke.</p><br/><p>『Merits? Like hell I know. It’s just that if he sees them off, and the adventurer called Zelphy dies, he’ll have trouble sleeping at night.』</p><br/><p>The Seventh let out a fed up response.</p><br/><p>『Could it be this is for that Aria’s sake again? I doubt there’s a need to go that far. If she died here, that means that was the extent of her ability.』</p><br/><p>The Fourth put a close on the disjointed opinions, and posed a question to me.</p><br/><p>『Well then, like that, the opinions on the matter are divided… Lyle, what do you want to do?』</p><br/><p>Having been asked for my opinion, I promptly put my hand on the Jewel-turned-necklace.</p><br/><p>There really isn’t much merit in it, but if the First is saying this much about it, the perhaps it really is that dangerous.</p><br/><p>His sharpness of instinct is something I recognize.</p><br/><p>(Am I really able to resolve this problem?)</p><br/><p>If I used my Skills, the chances of success would certainly improve.</p><br/><p>That’s just how useful the Skills I held were.</p><br/><p>But in order to participate, I have a need to persuade them. Hawkins-san and Zelphy-san. I’ll have to let Novem and Aria stay behind as well.</p><br/><p>After thinking for a while, I came to my conclusion.</p><br/><p>“Novem, can you wait with Aria in Dalien for a while? I think I’ll take up the urgent request with Zelphy-san.”</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>『Oy, get a grip on yourself…』</p><br/><p>『Not happening. After you did so much posing, for you to be thrown in this situation…』</p><br/><p>『You even left the convincing to Novem-chan… Lyle…』</p><br/><p>『There must have been a slightly better way out there. I mean, how could you draw back there?』</p><br/><p>『It looks like there’s a need for you to steadily build up your negotiation skills.』</p><br/><p>『Well, with all things taken into account, I guess that’s just how it goes.』</p><br/><p>『You guys… that’s all you have to say to my grandson!? Lyle was trying his hardest! He opposed Novem’s participation up until the end of it, and in the end, he’s still right here participating in the urgent request, isn’t he!?』</p><br/><p>(Stop it! Please don’t stick up for me any more than that, Grandfather(Seventh Generation)!!)</p><br/><p>On top of the horse-drawn cart, I used both hands to cover my face. It had turned red all the way up to my ears, as I listened in on the Jewel’s remarks, First Generation up.</p><br/><p>I’ve gradually become aware of it, but even if I cover my ears, I can still hear their voices quite clearly.</p><br/><p>From how the surroundings couldn’t hear them, I had a hunch they weren’t operating by sond, but… it’s really a bother.</p><br/><p>The ancestors’ voices I could hear even if I blocked up my ears…</p><br/><p>The reason they were somplaining so much was because of the current situation.</p><br/><p>The guild sent out two carts, and they provided money for the necessary equipment. We were put in a temporary party, and sent off to investigate.</p><br/><p>Starting with Zelphy-san it was my same old party. Novem and Aria included.</p><br/><p>On top of that, Rondo-san’s three were included in today’s members.</p><br/><p>The guild also hired a single coachman.</p><br/><p>“O-oy, are you alright, Lyle-kun?”</p><br/><p>Rondo-san called out to me in worry, and Novem, who was sitting next to me, also sounded worried.</p><br/><p>“Lyle-sama, could it be a cold? You were fine until just now.”</p><br/><p>In comparison to Novem’s flustered state, Aria seemed extremely nervous. She tightly gripped the red gem over her chest.</p><br/><p>To her, Rachel-san started up a conversation.</p><br/><p>“That’s one of those gems with Skills in it, right? A rare find in these times. How many do you have in it?”</p><br/><p>“U-um, mine included, there are five.”</p><br/><p>As Aria nervously gave an answer, Rachel-san’s eyes began to sparkle.</p><br/><p>“Amazing! If you made is a Magic Item, it’d fetch a price of one to two hundred gold coins. Since it’s red, it’s Vanguard Class, right? Is the compatibility alright?”</p><br/><p>Skill compatibility is an important factor.</p><br/><p>If you look at the Skills in my possession, the Fifth’s and Sixth’s become something quite amazing when used simultaneously.</p><br/><p>But it’s not like the gem was set to make these sorts of combinations.</p><br/><p>For those that it was passed down through, it recorded their Skills without discrimination.</p><br/><p>“I’m sorry. I don’t really know…”</p><br/><p>As Aria seemed apologetic, Rachel-san hurriedly tried to console her.</p><br/><p>“D-don’t mind it! I’ve heard that people with gems can’t choose the Skills in them. Even so, if you have five on you, then you have quite a bit of fighting potential there.”</p><br/><p>Having been told that, Aria hung her head down even further.</p><br/><p>“… I can’t use them all yet.”</p><br/><p>Hearing that, the spear weilder, Rahu-san let out a sigh.</p><br/><p>“Read the mood, Rachel. That aside, your party’s the inverse of ours. It’s quite a pain if you have more men on you. For me, Rondo and Rachel let off a pink aura, so I’m left feeling lonely on the side… So, which one’s your girlfriend, Lyle? I’m pretty sure it’s Novem-chan, though.”</p><br/><p>It was a time-consuming trip, so Rahu-san tried changing to a topic to ease our mental tension.</p><br/><p>(I-I’m thankful. Rather than hearing the ancestors’ persistant rants, a conversation like this is…)</p><br/><p>As I thought that, Novem spoke up.</p><br/><p>“No, both of us are Lyle-sama’s…”</p><br/><p>“Novem!!”</p><br/><p>I hurried to cut her off, but I didn’t make it in time. Aria’s downcast face also turned red.</p><br/><p>Rachel…</p><br/><p>“Eh? That’s a joke, right, Aria-chan?”</p><br/><p>There, Aria…</p><br/><p>“He returned my heirloom for me, and when I was about to be disposed of, he went as far as to help me… and…”</p><br/><p>“Say is clearly! You’re inviting in plenty a misunderstanding, so you have to be clear at times like these!”</p><br/><p>I hurriedly turned to Aria, but that liberated Novem’s mouth.</p><br/><p>“It is no misunderstanding. Aria-san received salvation from Lyle-sama, and right now, the three of us are living under the same roof.”</p><br/><p>Novem said that with a smile, and Rondo-san had a cramped smile as he confirmed it.</p><br/><p>“Eh, so this a so-called harem-like occurrence?”</p><br/><p>Novem, quite clearly…</p><br/><p>“It’s no so-called harem, it’s a true harem. For now, we only have two, but from here on, I expect the numbers will expand considerably.”</p><br/><p>Seeing Novem let all that out with a bright smile, I opened and closed my mouth in silence.</p><br/><p>I doubt she was unable to read the mood, but there’s no doubt she’s being completely serious here.</p><br/><p>Rahu-san placed his hand on my shoulder.</p><br/><p>While his mouth was definitely curved into a smile, his eyes were smiling by no means.</p><br/><p>Similarily, the shoulder on my other side received Rondo-san’s hand.</p><br/><p>“How about you go a little into the details, Lyle.”</p><br/><p>Rondo-san was the same.</p><br/><p>“How enviable that sounds, Lyle-kun. I definitely want to hear just how you brought that to fruition, but before that, I think I need to have a little talk with you on how a man must treasure the woman he loves most.”</p><br/><p>Rahu-san coincided.</p><br/><p>“That’s right. It wasn’t a good idea for me to have started thinking of how to kill time until we arrived. I’m definitely giving you an earful, so prepare yourself, Lyle.”</p><br/><p>Novem continued to go on about her future harem expansion plans with a smile, and Aria and Rachel-san listened on with reddened faces…</p><br/><p>It looks like there isn’t a single savior on this cart.</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>… Zelphy-san, who was driving the cart, heard the voices of young adventurers from behind her.</p><br/><p>She did try shouting at Lyle’s group after they had suddenly stated their desires to take up the urgent request, but having been persuaded by Novem, she finally voiced her consent.</p><br/><p>What’s more, she couldn’t offer Aria any special treatment, so the girl was going to be participating as well.</p><br/><p>If it was about competence, her personal strength was high.</p><br/><p>And in this time, three other strong adventurers were also participating.</p><br/><p>They probably wouldn’t fail through some reckless actions, but still, she was anxious.</p><br/><p>“Good grief, what fun they’re having… this isn’t a picnic, you know.”</p><br/><p>She heard the voices of kids enjoying themselves from behind, and remembered how the lines she voiced were directed at herself, some long time ago.</p><br/><p>They were the words of the departed adventurer.</p><br/><p>『Zelphy-chan, this isn’t a picnic, so how about we calm down a little?』</p><br/><p>He taunted her when she was nervous, it was only later that she realized he was trying to ease her.</p><br/><p>He was wild, and his mouth wasn’t the finest, but he was an adventurer good at looking after others.</p><br/><p>Whenever they met at the guild, they would throw around insults, and they had held drinking contests against one another at the bar as well.</p><br/><p>“Come to think of it, he lost his bet, so he owes me a drink.”</p><br/><p>Zelphy looked up at the sky, as she mourned the loss of her colleague, who had served many years alongside her as an adventurer of Dalien.</p><br/><p>She really did mean it when she said he should have retired already.</p><br/><p>It was a dangerous job. If you could get out of it, it’s best to do so as soon as you can.</p><br/><p>“Dammit, there’s no point if you die. Weren’t you the one that said that…”</p><br/><p>Even if they were quick to fight whenever they met, Zelphy still recognized him as a comrade.</p><br/><p>It was precisely because she recognized him, that…</p><br/><p>“I’ll definitely settle this.”</p><br/><p>Zelphy’s eyes were giving off a sharp light…</p><br/>\n</div>"}