{"title": "Volume 2 - Chapter 9: The First Generation’s Weapon", "id": 9, "volume": 2, "url": "http://boxnovel.org/sevens-volume-2-chapter-9-the-first-generation%E2%80%99s-weapon", "volume_title": "Volume 2", "body": "<h1>Volume 2 - Chapter 9: The First Generation’s Weapon</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The First Generation’s Weapon</p><br/><p>The Second’s Skill was, to put it simply, the ability to give others the rights to use your own Skills.</p><br/><p>The specifics get a little more complicated, but a simple explanation would be that allies within a certain range of me could use the Skills in my possession.</p><br/><p>The First’s Full Over.</p><br/><p>The Fourth’s Speed.</p><br/><p>One that created a condition where others could use their Skills whenever they wanted… That was the Second’s 【All】.</p><br/><p>It’s just that, the mana I needed to expend to use it was considerably low.</p><br/><p>I mean, it just let others use your own, and long as they weren’t using anything, it was a very slight expenditure on my part.</p><br/><p>But the Skills strongest characteristic was its ability to differentiate enemy and ally within a set range.</p><br/><p>The space where the trees had lined themselves up, and made a room-like area.</p><br/><p>The entranceway large enough for a person to pass had been blown away, an in the scattered chips of wood, stood the Boss that should have been in the 【Deepest Chamber】.</p><br/><p>Even as an orc, it had red skin, and its hair was thick. Its hair grew to mask its back.</p><br/><p>The ogre-like orc swung around the large sword that had once belonged to the adventurer it killed.</p><br/><p>When wielded by the beast, it simply seemed to be a normal sized sword.</p><br/><p>Perhaps trying to threaten me as I raised my sabre towards it, the monster let out a roar.</p><br/><p>Around me were the comrades I challenged this labyrinth with. Novem, Aria, Zelphy-san, Rondo-san, Rachel-san… the five of them flinched for a moment upon hearing the war cry.</p><br/><p>I mean, it was just that loud.</p><br/><p>Now that the orc was in it, the room that had a bit ow width to it started to feel exceedingly narrow.</p><br/><p>But I was able to comprehend the orc’s current condition to some extent.</p><br/><p>(I can see why the Seond hesitated to let my use it. In a sense, this is truly too powerful.)</p><br/><p>To put it bluntly, its original effect of being a Skill to allow others the use of Skills… was a lesser power than its indirect effect.</p><br/><p>As if they were summoned forth by the red orc’s scream, the monsters loitering around the dungeon began to gather around the room we were in.</p><br/><p>Zelphy-san stood up in front of me.</p><br/><p>No, she was holding up her shield, so she was probably taking on the role of a Shield for the entire party.</p><br/><p>It’s just that in order to oppose this red orc, I don’t think Zelphy-san’s power is sufficient.</p><br/><p>“I’ll take on this red one. You guys take care of the other ones pouring into the room.”</p><br/><p>As I said that to all, Rondo-san raised his voice.</p><br/><p>“Do you know what you’re saying!? That enemy’s not normal. It would be best if we all went at it at once!”</p><br/><p>While that definitely was a plausible opinion, this wasn’t the time to be delaying action against the monster in front of us.</p><br/><p>“Yeah, I’d love that too, but we don’t really have the time… look, they’re coming!”</p><br/><p>As I said that, Goblins started to enter the room.</p><br/><p>As they sprung up from behind the orc, Novem used her magic.</p><br/><p>“Wind Bullet.”</p><br/><p>The Goblins were sent sprawling in the air, and they collided with a wall.</p><br/><p>At the same time, I pulled out my spare sabre, and started running off towards the red orc.</p><br/><p>It lifted up the blade in its hands, and lowered it at me.</p><br/><p>“It really is quite a Skill.”</p><br/><p>Using my momentum, I leaned down and leapt. The falling blade pierced into the ground behind me.</p><br/><p>I ended up in the space between the orc and its weapons.</p><br/><p>Using the sabres in both of my hands, I cut at the red orc’s knees.</p><br/><p>“Too shallow? More so that I thought… no.”</p><br/><p>As I was considering whether the orc’s skin was harder than I had expected, I saw his knees healing before me.</p><br/><p>I immediately jumped to his left, as his left fist hit the ground where I was, and gouged it out. A small crater was formed.</p><br/><p>As I rolled to stand from my lunge, a voice called out to me.</p><br/><p>“Lyle-kun!”</p><br/><p>It was Rondo-san’s voice.</p><br/><p>Seeing the goblin coming at me from my back, he quickly raised his voice.</p><br/><p>Without turning around, I stuck my sabre behind, and stood.</p><br/><p>Goblin blood starts raining down on my head.</p><br/><p>“Ah, I can’t see.”</p><br/><p>As I muttered that, a few reacted by rushing over to me.</p><br/><p>It was Novem, Aria and Zelphy-san.</p><br/><p>Also, seeing a good opportunity, the monsters around started to aim at me.</p><br/><p>I swung my two swords, and turned as I moved around the room.</p><br/><p>Every time I swung my swords, blood spattered onto the ground.</p><br/><p>As I finally used my sleeve to wipe my eyes, I was able to confirm the situation.</p><br/><p>“So even when blinded, I can do this much?”</p><br/><p>Using my blades, I had dodged and cut down the monsters that came at me.</p><br/><p>Where everyone was, and what sort of condition they were in… that was the Second’s Skill that could let me perceive all my surroundings. It differed from the Fifth and Sixth’s Skill in an essential point.</p><br/><p>The Fifth spoke with some nostalgia.</p><br/><p>『I was under this Skill’s care quite a bit, but as I thought, the side effect is the more amazing part of it. My Skill gives you a much larger view, and it’s not suited for these sorts of melee battles, though.』</p><br/><p>The Sixth agreed.</p><br/><p>『Right. It’s plain, but quite proficient. There were quite a few campaigns I lived through simply because I had the First and Second Generations’ skills.』</p><br/><p>I’m sorry if you wanted to reminisce a little, but I’d really like some advice on how to defeat the enemy in front of me right now.</p><br/><p>“I heard that attacks don’t work, but it looks like it’s healing. If you continued attacking it, it’d eventually run out of Mana and collapse, but… it feels like my stamina will run out first.”</p><br/><p>If it were only me, I think I would manage one way or another, but right now, I have comrades.</p><br/><p>The first ones to collapse will probably be Rachel-san, who was keeping the room light, or Novem, who was using offensive magic to support me after having healed all the adventurers herself.</p><br/><p>After that, Aria will probably fall, and then perhaps Zelphy-san.</p><br/><p>Finally, maybe even Rondo-san won’t be able to defeat this orc.</p><br/><p>(Because it defeated a veteran adventurer to experience a growth, it’s gotten even more troublesome. So monsters can grow, and get Skills as well… was the fact that it was a grace from god to man a lie?)</p><br/><p>I lowered my eyes to the sabres in both of my hands, and retreated back. In front of me, the orc’s sword was lowered.</p><br/><p>It looks like it doesn’t know how to handle a sword.</p><br/><p>With this, it may have actually been better if it kept the cudgel.</p><br/><p>“The chipping on the sabres is quite bad. My weapons will be ruined first. If I were to take it out in one blow, would magic strengthened by Skills be best?”</p><br/><p>I tried to reach a conclusion in my mind, but I felt it wasn’t quite sufficient.</p><br/><p>Since the others were taking on the monsters flooding into the room, it’ll take some time before I’ll be able to seek help from them.</p><br/><p>Since it was taking me on, the red orc wasn’t attacking the others. If someone did come to my assistance, perhaps it would change its target.</p><br/><p>“I really hate gambling, though… well then, how should I take it out…”</p><br/><p>With my strongest attack, I have to somehow take down this monster in one strike.</p><br/><p>I need to determine what Skill it has, and I can perceive a majority of my surroundings with the Second’s Skill. Stamina and Mana… Since I can sense those sort of things intuitively now, my fighting style has to change to match that.</p><br/><p>The First…</p><br/><p>『Hey, isn’t your (The Second Generation) skill a bit too cowardly?』</p><br/><p>The Second shouted out.</p><br/><p>『The hell you mean by cowardly!? It’s a convenient Skill! It was so convenient that he might start relying on it, so I didn’t let Lyle use it yet is all!』</p><br/><p>It felt like I had ganed some new senses, but it feels like using them all will take too much time.</p><br/><p>I felt that not my Mana, but my mental fatigue would catch up to me.</p><br/><p>I continued to dodge the red’s attacks, as I thought.</p><br/><p>There, the red orc ominously retreated a step. It raised its voice, and from the room’s walls… the gaps between the trees, a normal emerald-skinned orc appeared.</p><br/><p>“This one summoned allies!?”</p><br/><p>Aria raised a surprised voice, and Rondo-san approached Rachel-san in order to protect her.</p><br/><p>Zelphy-san also stood in front of Novem and Aria.</p><br/><p>“Lyle, how long do we have to hold out!?”</p><br/><p>Hearing Zelphy-san’s voice, I looked up, and thought for a moment.</p><br/><p>“It will be over soon, so please withstand it for a little while.”</p><br/><p>I said that.</p><br/><p>Hearing my words, the First raised a loud laugh.</p><br/><p>『nice going there, Lyle! Right. At times like these, men have got to look cool! Good! I’ll teach you something special…』</p><br/><p>On the First’s remark, the Fifth seemed a little agitated.</p><br/><p>『Oy, what are you thinking? It’s much to soon, isn’t it?』</p><br/><p>For the two orcs that had appeared at the red ones sides, I temporarily activated Limit Vurst, and threw the sabres in my hands at them.</p><br/><p>They spun in the air before landing in their skulls.</p><br/><p>The two orcs opened their jaws at the impact, before collapsing on the ground.</p><br/><p>Seeing me lose my weapons, the red orc roared.</p><br/><p>“I wonder if I can take it out with magic… just barely, perhaps.”</p><br/><p>I think it was possible, but just barely. There was also the possibility it wasn’t enough, so I’d have to bet it all on one hit.</p><br/><p>(If I can’t beat it then, I can try striking it barehanded, I guess.)</p><br/><p>For a moment, I found it terribly strange for a First-like thought to be running across my mind.</p><br/><p>(What is this feeling… it isn’t bad.)</p><br/><p>While I was thinking something like that, the First spoke.</p><br/><p>『Oy, clench the Jewel.』</p><br/><p>“What are you saying?”</p><br/><p>Those around were busy fighting monsters, so they probably won’t hear my conversation with the First.</p><br/><p>『I’ll teach you something fun. It’ll be some good news for the current you… I mean, you’ll be able to use the trick the Seventh personally went and set up.』</p><br/><p>“The Seventh… my grandfather?”</p><br/><p>I put using magic on hold, and gripped the Jewel as told.</p><br/><p>The Seventh began yelling at the First.</p><br/><p>『Why did you tell him!? It’s too soon! With Lyle’s Mana, he really will only be able to maintain it for a few seconds!』</p><br/><p>The First shot back.</p><br/><p>『Seconds? That’s more than enough, ain’t it!? You guys, to this one… who’s the one that said Lyle was amazing!? I approved of him! No one’s going to be getting in my way! Now let’s go, Lyle!』</p><br/><p>The Jewel gave off a blue light, and the chain wrapped around my neck was arbitrarily undone.</p><br/><p>The silver ornaments enveloping the stone started to cange shape in my hand.</p><br/><p>“This is…”</p><br/><p>It looks like the others were curious about my situation as well. With a blast of magic from Novem, the area was covered in smoke.</p><br/><p>Feeling a weight like never before from the Jewel, the item that it once was… no, I gripped the silver ornaments I thought to be nothing bur accents to grace the Jwewl.</p><br/><p>I gripped the handle in both hands, and the silver blade let off a pale light. A guard with the blue stone embedded in it… the Jewel shined.</p><br/><p>『My sword skills are none too splendid. So these sorts of striking weapons are best for me.』</p><br/><p>What my hands had grasped was a thick silver sword.</p><br/><p>The First cried out.</p><br/><p>『There’s no time, right!? On with it already!!』</p><br/><p>As if the voice was pushing me forward, I dashed forward, and took a large jump. I turned my body to avoid the red orc’s lowering sword, and used the weight of the large sword in my own hand to rotate from the momentum.</p><br/><p>With the centrifugal force as my ally, I used my Skills to momentarily raise my power output to its limit.</p><br/><p>『This is my final Skill… it’s 【Full Burst】!』</p><br/><p>Perhaps through the First’s support, as I activated the Skills, a power greater than usual surged up from within my body.</p><br/><p>I took control of the spin, and lowered the maximized power onto the red orc’s head.</p><br/><p>“With this…”</p><br/><p>My voice overlapped with his.</p><br/><p>“It’s the end!!”</p><br/><p>『It’s the end!!』</p><br/><p>The orc tried to sacrifice its left arm to survive, but the arm it used as a Shield was cut clean through.</p><br/><p>My blade pierced deep into the ground, and the caved in earth around the impact spoke to the blow’s power.</p><br/><p>“Hah… hah… how brutal.”</p><br/><p>After I confirmed the two parts of the orc’s body slowly fall to the ground, the silver sword changed itself back to a simple ornament.</p><br/><p>(He said the Seventh had it specialy made, but… come to think of it, Zell did say it had a rare metal put into it.)</p><br/><p>Recalling the words Zell imparted onto me when I was driven out, I started to wish that they had just told me about it sooner.</p><br/><p>But through a sudden depletion of Mana, I couldn’t put any power into my body.</p><br/><p>My knees hit the ground, and the one propping up my body… Novem was there.</p><br/><p>“Lyle-sama!”</p><br/><p>Novem clung to me, and perhaps out of her genuine worrt, she was squeezing quite strongly.</p><br/><p>“Ahahaha, sorry… I pushed myself a little.”</p><br/><p>Zelphy-san also ran over, and sought confirmation from me.</p><br/><p>“Just what was it you did? And that glowing weapon… oy, wait! Don’t collapse in a place like this!”</p><br/><p>Zelphy-san was quite rowdy, but that was the same as always, so I felt a little relieved. Nearby, I saw Rondo-san had been injured, but Rachel-san was busy treating him.</p><br/><p>Aria looked to be out of breath, but she had used her Skills to defeat the monsters.</p><br/><p>“Please quiet down! Lyle-sama, let’s get out of here quickly. Do you think your consciousness can hold on for that long?”</p><br/><p>So we either took a short break here, or get out immediately.</p><br/><p>But if I feel the same as always, it doesn’t look like I underwent a Growth.</p><br/><p>I hated that.</p><br/><p>I wanted to show some obstinacy.</p><br/><p>“I’m fine. If I rest for a little, I’ll soon be able to stand… Novem, thank you.”</p><br/><p>“Don’t worry about it.”</p><br/><p>Novem seemed relieved, but she continued to support up my body. To Aria, who drew closer, I spoke.</p><br/><p>“So you were able to win against monsters. Are you a little more confident, now?”</p><br/><p>I tried teasing her a little, but she gave a surprised response.</p><br/><p>“You… were watching?”</p><br/><p>Perhaps she took it as praise, but she was unexpectedly happy.</p><br/><p>(Aria, perhaps you’re the type that gets fooled too easily. You should be careful… more importantly…)</p><br/><p>I looked at Rondo’s group.</p><br/><p>“I’m sorry for arbitrarily taking action on my own.”</p><br/><p>Rachel-san let out a sigh. Rondo-san had his injuries wrapped with bandages, but he was smiling.</p><br/><p>“That was amazing. I never thought you would be able to do that much. Idiotic Noble Son doesn’t suit you, Lyle.”</p><br/><p>Looking at his unrelenting smile, I thought that perhaps he was quite a broadminded person. He directs a smile to the younger adventurer that went off on his own.</p><br/><p>But Rachel-san was different.</p><br/><p>“You’re way too free-willed. It turned out fine this time, but just look at yourself. Be more conscious of the fact that you have people who’ll weep for you if you died, and wait, I wanted to say this, but I didn’t get the chance, so let me give you an honest apology here. Thank you.”</p><br/><p>I honestly didn’t get the feeling that I was actually receiving thanks, but I guess she was showing consideration in her own way.</p><br/><p>I smiled sarcastically.</p><br/><p>Zelphy-san told me not to put up a front, and to worry about myself.</p><br/><p>“We were saved because of you, Lyle, but please trust the others a little more. What they are and aren’t capable of, if you had taken that into account, perhaps you could have moved more efficiently. I can understand your feelings of wanting to conceal your Skill, but please give out at least a little information on it.”</p><br/><p>Thinking about if that was really the case, I started considering whether or not to bring up the ancestors.</p><br/><p>(First, I have to tell Novem. I have plenty of things I have to let her know. Like about the First Generation…)</p><br/><p>A Barbaric man who didn’t worry about the details. Who moved on instinct, and stirred up his surroundings.</p><br/><p>But he was the reliable founder of the Walt House.</p><br/><p>(I wonder if he’s recognized me.)</p><br/><p>I gripped the Jewel as I thought that. Novem opened her eyes wide.</p><br/><p>“The gem is shining… this is…”</p><br/><p>As Novem said that, the others also gave a surprised reaction.</p><br/><p>What floated up in my head was the name of a Skill.</p><br/><p>“…【Experience】.”</p><br/><p>It wasn’t just the name that came up.</p><br/><p>Just what sort of things it could do, and how it could be used.</p><br/><p>They all came to me at once.</p><br/><p>Since it first manifested, it took quite a while for my Skill to take definite shape.</p><br/><p>“Wait, that means… you, just how many Skills can you use?”</p><br/><p>Aria was astonished, but more than that, it was the contents of the Skill that shocked me.</p><br/><p>I mean, my Skill was Support Class, and it seems it was perpetually active.</p><br/><p>I thought the reason I was getting fatigued so easily was because of the ancestors, but it seems that one of the contributing factors was my own incomplete Skill.</p><br/><p>(A Skill that lets you obtain a lot of experience? … What’s more, it’s perpetually active, so that means it’s constantly expending my Mana.)</p><br/><p>When it was still incomplete, it looks like it didn’t display its intended effect, but it still drained up my Mana regardless.</p><br/><p>And here, I finally was able to learn its effect, but…</p><br/><p>(Isn’t my Skill just a little to vague!!?)</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>After the break.</p><br/><p>We took three cycles to take the five injured adventurers out of the labyrinth.</p><br/><p>The support person who was acting as our coachman filled our stomachs with the soup he prepared, and after that, we wandered over to the deepest chamber.</p><br/><p>As long as the core… treasure remained in the deepest chamber, the labyrinth would continue to grow, and monsters would continue to emerge.</p><br/><p>To avoid any further danger, collecting the treasure was a necessity.</p><br/><p>As we entered the room, Rahu-san noticed a glowing metal stick in the space between trees.</p><br/><p>“Isn’t that is!?”</p><br/><p>He ran ahead, and cut away the branches entwined around it, before taking it out.</p><br/><p>As he did that, the harsh breathing conditions were suddenly resolved.</p><br/><p>“With this, the labyrinth has been cleared. There was only one floor, so it was easy, but if it had grown to three or four, it would have been impossible with these numbers.”</p><br/><p>The metal in his hands looked like iron.</p><br/><p>But it was a special iron that had been soaked in the magic of the dungeon.</p><br/><p>“Ooooh! If you make this into a weapon, it becomes a Magic Tool you can grant Skills unto, right!”</p><br/><p>Rahu-san sought confirmation of that fact from Zelphy-san in high spirits, and she nodded with a bitter smile on her face.</p><br/><p>“If you bring it to a craftsman in Dalien, you could make a few with half of that, I think. But make sure you choose a guild certified dealer.”</p><br/><p>It’s none too pleasant if these sorts of metals start flowing along the underground routes.</p><br/><p>“Rahu, we’ll have to evenly divide the reward. Since there are seven of us, should we make seven parts?”</p><br/><p>Rahu-san drew closer to Rondo-san.</p><br/><p>“Can I buy off the other portions!? As long as we have this, then we’ll be able to carry Magic Tools as well. In that case, we can even start challenging other labyrinths as adventurers!”</p><br/><p>Rahu looked to be in high spirits as he expressed his desire to turn the treasure in his hands into a Magic Tool. But looking at the amount of metal, the amount that could be made was around three to four items.</p><br/><p>“We don’t have that sort of money. Let’s build it up steadily.”</p><br/><p>Rondo-san let out a sigh.</p><br/><p>With this amount, just how many gold coins would that take?</p><br/><p>As I thought that, I noticed Zelphy-san’s eyes were pointed at a corner of the room.</p><br/><p>I looked there as well.</p><br/><p>“… He was an acquaintance, right?”</p><br/><p>As Zelpht0san called out to her, she mumbled some affirming words.</p><br/><p>“He was quite the willful bastard. After saying that death was the end of it so many times, in the end, he threw out his own life to save some newcomers.”</p><br/><p>Making acomplicated expression, she approached the veteran adventurer’s corpse, and began looking through his belongings.</p><br/><p>She piled up everything that seemed to have value, and finally recovered his guild card.</p><br/><p>From my point of view, it looked like roadside robbery.</p><br/><p>“Hey, you guys come closer too.”</p><br/><p>Hearing that, we… me, Novem and Aria, approached the corpse.</p><br/><p>Perhaps because he was beaten to death with a blunt weapon, the body was in quite a bad state.</p><br/><p>Novem held her hand to her mouth, and Aria’s face turned pale as she assumed a crouching position.</p><br/><p>I covered my mouth.</p><br/><p>“Remember this. The death of an adventurer is something like this. In the end, everything of value is picked off, and the corpse is cast away. Make sure you don’t forget to collect the guild card, and deliver it to the guild.”</p><br/><p>An end stripped of all worth.</p><br/><p>Saying that, Zelphy-san took out a leather bag she didn’t usually use, and she started carefully putting the veteran adventurer’s belongings in it.</p><br/><p>“Zelphy, it’s not like you have to go that …”</p><br/><p>Aria had a pale face and a shortness of breath, but Zelphy-san didn’t heed her words.</p><br/><p>“This is my right. I ventured to a dangerous region, and confirmed the corpse. I even conducted an investigation into what exactly happened here. Where is the problem in that?”</p><br/><p>As she glared at Aria, Zelphy-san seemed quite different from usual.</p><br/><p>Rondo-san’s group didn’t say anything.</p><br/><p>“Well then, the recovery has ended. Let’s return, and get some well-deserved rest. Also big guy over there.”</p><br/><p>“Me?”</p><br/><p>On Zelphy-san’s words, Rahu-san pointed to himself. He was holding the precious metal under his arm.</p><br/><p>“My portion’s settled with this man’s stuff. Go negotiate the rest with Lyle’s group on your own. They’re still newbies, so you may be able to cheat them out of it quite easily.”</p><br/><p>With those words, Zelphy-san turned to leave. Aria had a sad expression as she watched her back.</p><br/><p>“Because of the things that happened in my House, Zelphy-san turned out like…”</p><br/><p>Seeing the adventurer’s form, Aria was sorrowful.</p><br/><p>I looked after Novem, and handed Aria the water flask for her parched mouth.</p><br/><p>If you die, you’re thrown away. Those alive will take everything of value.</p><br/><p>She showed us such a precedent.</p><br/><p>“You two, it’s about time we left.”</p><br/><p>As I said that, Aria looked over the corpse.</p><br/><p>“At the very least, a burial…”</p><br/><p>There, Rondo-san explained.</p><br/><p>“In a short while, this labyrinth will wither away. Everything here will rot away, so whether you bury him or not, it will all be the same. Or could it be you plan on shouldering that corpse all the way out of here?”</p><br/><p>Aria mournfully looked at the ground.</p><br/><p>And Rondo-san continued.</p><br/><p>“It’s better you treasure those feelings. They may be naïve, but before being adventurers, we are all human.”</p><br/><p>Rondo-san left the area, and Rahu-san tailed behind him. His parting words…</p><br/><p>“Let’s negotiate it out later. Oh, I don’t intend on cheating you guys, mind you. It’s just that we simply don’t have too much on is… sorry, that wasn’t something for me to say at a time like this. At this rate, I can’t scold Rachel for her loose tongue.”</p><br/><p>It seemd he was going to use the opportunity to say something, but sensing it was impossible, he left the chamber.</p><br/><p>I offered my hands to Novem and Aria, and supported them as we walked.</p><br/><p>There, the Fourth…</p><br/><p>『Flanked by two beauties…』</p><br/><p>Spouted out some words filled with hatred. Hearing that, the Third laughed.</p><br/><p>『You’ve got good luck, Lyle. That’s quite an important thing, you know.』</p><br/><p>And the Sixth spoke.</p><br/><p>『Hey, let’s be off now. That Zelphy just went through great pains to show you guys a taste of reality. Think about her feelings too.』</p><br/><p>Hearing those words, I felt the urge to tilt my head.</p><br/><p>(Zelphy-san’s feelings?)</p><br/><p>The Second let out a sigh.</p><br/><p>『Good grief… it seems she really intends to leave this Noble Lady to Lyle. She even put up those theatrics.』</p><br/><p>The ancestors said that that display from before was an act, but I wasn’t able to understand their meaning.</p><br/><p>(Really intends to leave? What do you mean by that?)</p><br/><p>Supporting the two of them, I headed towards the exit to the labyrinth.</p><br/>\n</div>"}