{"title": "Volume 1 - Chapter 3: The Seven Ancestors", "id": 3, "volume": 1, "url": "http://boxnovel.org/sevens-volume-1-chapter-3-the-seven-ancestors", "volume_title": "Volume 1", "body": "<h1>Volume 1 - Chapter 3: The Seven Ancestors</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Seven Ancesters</p><br/><p>After falling asleep in a chair in the hall, I found myself in an unfamiliar room with my ancestors.</p><br/><p>Why am I in a situation like this? Even I was unable to understand it.</p><br/><p>“And wait…”</p><br/><p>In the center of the room was a wide, circular table, and our seats encircled it. The chairs were large, and the backrest’s height exceeded my head.</p><br/><p>They were seats appropriate of the high-class atmosphere of the room, but for some reason, some part of them lacked a sense of reality. Around the room, circular blue orbs were embedded in various places.</p><br/><p>In the center of the table, a pale, glowing one existed.</p><br/><p>『It was a mistake in your upbringing of him!?』</p><br/><p>『It’s not me! In the first place, the Walt House is a male lineage, and what’s more, Lyle was officially set to be successor already! It’s definitely not my fault! If I was there when it happened, I would have smacked my son upside the head a few times!』</p><br/><p>The Savage man and my grandfather gripped each other’s clothing as if to fight.</p><br/><p>At a glance, it seems the savage man was superior, but the reactions from the rest of them were cold. They abandoned the two, and returned to their conversation with me.</p><br/><p>From the hunter-garbed man from before, I sought an explanation.</p><br/><p>『Let’s leave the two loud ones, and continue. Anyways, Lyle was set to be the ninth generation, but having lost to his sister, and having had the right to succeed taken from him, he was driven out of the house. There’s quite a few problems with the story already, but let’s leave that aside for now.』</p><br/><p>He tried to move on, but there, the savage-styled man… Provincial Noble, and the founder of the Walt House, who spearheaded a group to cultivate the land, 【First Generation, Basil Walt】 opened his mouth.</p><br/><p>『There’s no way I can let that one slide! The one who lost to a girl younger than himself was the next heir? Don’t screw with me!』</p><br/><p>『You barbarian! What are you saying to my grandson!?』</p><br/><p>My grandfather punched him into the air, but still, the reception was cold.</p><br/><p>But in the cold air, the hunter… 【Second Generation, Crassel Walt】 casually ignored them.</p><br/><p>『The problem lies elsewhere. Both of you, take a seat… Now then, normally, we would be against a woman succeeding the house. At the very least, I wouldn’t have accepted one as head, regardless of how proficient she may be, and I doubt my opinion will change.』</p><br/><p>The Second’s opinion was agreed with by the third… 【Third Generation, Sleigh Walt】.</p><br/><p>He wore the clothing of a low-ranking nobleman, and he gave off a somewhat frivolous feeling.</p><br/><p>『Right, I mean, I was able to become head myself, and my son 【Max】 was head, even though I had a daughter too.』</p><br/><p>Third Generation Sleigh was the first of the Walt House to be killed in battle. But the image of him that was passed down was that of a righteous commander, who headed up the rear guard as the King issued a retreat.</p><br/><p>He’s said to be a man who, alone, defended an army of tens of thousands.</p><br/><p>The man in front of my eyes didn’t give off an impression like that at all.</p><br/><p>『Oy, you died before you became the head of anything, didn’t you!? Just how much troubles did you think I had to go through because of that!?』</p><br/><p>This one was also wearing a noble’s vestments. But just like the Second Generation, he had the aura of a wise man.</p><br/><p>【Fourth Generation, Max Walt】 was the leader when the Walt House reached baron-hood.</p><br/><p>And the fifth generation gave a sigh.</p><br/><p>【Fifth Generation, Fredricks Walt】 was supposedly the most lustful of the Walt Family. Even with a wife, he apparently had four mistresses.</p><br/><p>But unlike my mental image of him, he didn’t give of such a laid back air.</p><br/><p>『Hah, quit it. Everyone has their troubles. Of course, I did as well.』</p><br/><p>There, the red haired, wild-looking, Sixth Generation nodded. 【Sixth Generation, Fiennes Walt】 was the individual who used underhanded means to elevate the house to Count Status.</p><br/><p>My father kept an image of him around, and whenever something bad happened to the Walt Family, he would take it out, and complain at it.</p><br/><p>『Right. But for the reason the daughter became the heir to be a fencing match… Brod, are you really sure you didn’t fail in teaching that one?』</p><br/><p>【Seventh Generation, Brod Walt】was my grandfather.</p><br/><p>『My son was quite excellent, even from my eyes. Also, from last I remember it, Lyle was supposed to be the next in line, and Celes should have just been receiving training as a noble lady…』</p><br/><p>Before my eyes, I saw my ancestors, and they were arguing amongst themselves. Even this far, it wasn’t something I fully understood.</p><br/><p>Having heard my story, the Second Generation came to a conclusion.</p><br/><p>『Frankly, man… it’s totally ain’t happening, right?』</p><br/><p>His easy-going tone earned approval from the surroundings.</p><br/><p>『Right.』</p><br/><p>『That’s right』</p><br/><p>『That stupid son of mine… He’s got a beating coming to him.』</p><br/><p>And finally, the talk turned back to me. This time, , the one who gave off the same aura as the second generation, the Fourth Generation asked me.</p><br/><p>『That’s what I’ve been wondering. I mean, even if Lyle lost to her, I don’t really have an idea about her competence. Is that Celes Girl really that overflowing with grace?』</p><br/><p>Having been asked about Celes, I looked at the ground. I didn’t want to bring her up in my mind, but I’ll bet I’ll have to explain it.</p><br/><p>(If I’ll have to do it eventually, I should get it over with now.)</p><br/><p>Thinking that, I started explaining about Celes.</p><br/><p>My sister two years my junior, and a girl who could accomplish anything. Whatever I spent hundreds and hundreds of hours to attain, she learned in only a few…</p><br/><p>And the most important thing was…</p><br/><p>“My sister is perfect. Studies are one thing, but on top of that, should I call the atmosphere around her immaculate…”</p><br/><p>『Atmosphere? And what the hell is perfect? Making a woman the successor will put us at quite a disadvantage politically, right? She must have something great enough to compensate for that.』</p><br/><p>The Barbaric First Generation, who was sitting cross-legged on the table, bit onto my discussion.</p><br/><p>“… She can charm anyone. My parents did look over me at the start. But around the time I turned ten, the atmosphere began to turn strange… and gradually, the atmosphere of the whole mansion began to center around Celes.”</p><br/><p>After I said that much, the First Generation seemed lost in thought.</p><br/><p>The Fourth Generation regained the lead, and started the conversation up again.</p><br/><p>『Meaning she had talent exceeding Lyle, and those around her recognized that? Does that sound plausible, Seventh Generation-kun?』</p><br/><p>My grandfather tilted his head.</p><br/><p>『No, while I did find her cute as my granddaughter, her being that great is… as I thought, impossible.』</p><br/><p>My grandfather denied it. I was of the same opinion. At the time when my grandfather was still alive, the atmosphere in the mansion was normal.</p><br/><p>I wasn’t on particularly bad terms with my sister, either.</p><br/><p>『So around the time she was seven, or eight, the atmosphere changed. Then it could be that a skill manifest in her. That’s about when those things start popping up, at earliest.』</p><br/><p>That opinion was denied by the Third.</p><br/><p>『I wonder. Even if it manifested, there are plenty of cases where it goes unnoticed. Even if it’s there, people only become able to put it to practical use around ten. Meaning the timing is a bit of a stretch? I mean, Lyle himself’s got a skill on him, but it seems he still hasn’t noticed it.』</p><br/><p>【Skill】… To the humans that lived in this world, they were a divine grace separate from the magic afforded by the gods.</p><br/><p>There’s a general rule that it’s one Skill per person, and it is the human way to battle to polish that skill.</p><br/><p>Of course, in the past, it was possible to recreate them with technology. Of all else, the gem I received was given a Skill by a Head of the past…</p><br/><p>(Wait a second. I started hearing the voices around when I started being taken care of in Zell’s hut, right? Then I started to hear them more clearly… from when I received the gem.)</p><br/><p>Noticing it, I raised my head. As if to imply that it had taken me long enough, the Third Generation spoke. He also informed me of the Skill I received.</p><br/><p>『It didn’t take definite form, but the gem reacted to it to try and store it. That’s why since we’ve all been recorded within this gem, we can sense it.』</p><br/><p>I tried confirming with the surprisingly knowledgeable Third Generation on what Skill I had.</p><br/><p>“Um, so in the end, just what is my Skill?”</p><br/><p>『I don’t know that far. But blue gems hold 【Support】 skills, so it’s probably one of those.』</p><br/><p>Skills are generally sorted into three categories.</p><br/><p>Ones with close combat as its base, 【Vanguard】. These ones were said to manifest in red gems.</p><br/><p>Yellow gems held 【Rearguard】 Skills.</p><br/><p>Blue was Support.</p><br/><p>Those are the three classifications of skills, but in the past, it was said one could control the direction of their own Skill, to some extent, with Gems.</p><br/><p>The reason support skills were common in the Walt House was because they carried blue gems on them.</p><br/><p>“… So that makes me Support?”</p><br/><p>『You sound unsatisfied. But back in my time, Support was all the rage.』</p><br/><p>The Third Generation started at my displeased face as he spoke.</p><br/><p>In the current era, it’s the high-firepower Rearguard’s skills that are preferred.</p><br/><p>But…</p><br/><p>『In my time, it was Vanguard, and Support. Getting a Rearguard was unfortunate.』</p><br/><p>As my grandfather said that, the Second Generation gave a questioning look.</p><br/><p>『In my time, support was misfortune. Does it just change by the times?』</p><br/><p>The Fourth returned the derailed conversation to the track.</p><br/><p>『Anyways, you say the possibility of some sort of Skill manifesting in that Celes girl, and making them change their decision is low. That would mean that Lyle really didn’t have the caliber necessary to be the heir.』</p><br/><p>Even when told something like that, I couldn’t say anything. I did exert myself desperately, but never once had my hard work made anyone tell me I was fitting as the next head.</p><br/><p>In the Walt House, that had become the home of a Count, if you’re told you lack the necessary wisdom to succeed the title, then that’s the end of it.</p><br/><p>But…</p><br/><p>『But it’s just too strange. Looking at their reception to the boy, he wasn’t that bad. I mean, even now, he has a reliable retainer with him, and even if Lyle’s not that reliable, it’s just normal for a boy to be chosen as an heir. Even if that girl called Celes is simply overflowing with talent, the demerits of naming her the successor are too high.』</p><br/><p>The Fifth Generation disinterestedly spoke of the demerits of having a female head. But in truth, there were already a few Houses with such leaders.</p><br/><p>However, the main reason was representation, and the customs of the House. In houses with Female Lineage, it’s not rare for there to be talks of a male becoming an heir, but the reverse isn’t often heard of.</p><br/><p>I mean, if the time calls for it, the family head must march out into battle.</p><br/><p>The number of houses that would dispatch a girl in such a situation was scarce. I won’t say there are none, but still, they’re the great minority.</p><br/><p>『Brod, what about the vassals? Was there any faction gathering around her in a plot to take control of the House?』</p><br/><p>On the Sixth’s proposal, my Grandfather started thinking.</p><br/><p>『I won’t say there were none with such intentions, but the social status of the vassals is too low. It’s impossible for them to plan to take control by marrying in. The closest house of status to us is the patriarchal Forxuz House, but they’ve never done anything like that since times long ago…』</p><br/><p>There, the Second Generation reacted.</p><br/><p>『Eh? Your retainers are those Forxuz? Eh! Eeeeeeh!?』</p><br/><p>The First, who had been lost in thought, also stood up in confusion.</p><br/><p>『By Forxuz, you mean those ones!? The ones from the neighboring territory!? That’s the old man’s house, ain’t it!?』</p><br/><p>Old Man? I didn’t know what was going on at all.</p><br/><p>From long ago, the Forxuz House wes subservient to the Walt House. They were something like our retainer house. Their status was that of Barons, but Their land was afforded to them by my parents’ Walt House.</p><br/><p>The Fourth Generation was also flustered.</p><br/><p>But the Fifth…</p><br/><p>『What of it? I mean, we climbed up in rank, and obtained control of the neighboring territories. For the Forxuzes that were hesitant to move, we graciously gave them land, so it’s natural for them to be our retainers, right?』</p><br/><p>But there, the Second Generation shouted out.</p><br/><p>『Don’t joke around! Just how far in debt do you think we are to those guys!? You all, if the Forxuz House wasn’t next door to us, none of us would be here!』</p><br/><p>The Second emphasized just how much they had taken care of us, as the fourth asked the fifth with a surprised face.</p><br/><p>『What’s the meaning of this? I told you, right? They had assisted us greatly, so you were to make sure to keep good relations with them, right!?』</p><br/><p>There, the Fifth gave a disinterested reply.</p><br/><p>『Yeah, yeah, and that’s why I filled out all the paperwork so the Forxuz House could rise in status as well. I definitely did it, right?』</p><br/><p>As the Fifth sought confirmation from the Sixth, the Sixth Generation nodded.</p><br/><p>『Well, yeah. You did.』</p><br/><p>While listening to this exchange, I thought.</p><br/><p>(This is getting a bit complicated. And wait, their voices seem to be getting a little distant…)</p><br/><p>And here, I heard the voice of someone that wasn’t there.</p><br/><p>“Lyle-sama?”</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>“Lyle-sama, I’ve already finished.”</p><br/><p>“Eh… yeah.”</p><br/><p>When I opened my eyes, I was still sitting in the creaky and wobbling chair. Perhaps because I was tired, I had slept quite soundly.</p><br/><p>Having wiped down her body, and washed her hairs, Novem stood in front of me.</p><br/><p>“I see you were tired. I’ve washed your undergarments in the hot water, and hung them to dry. They should be done by tomorrow.”</p><br/><p>“Ah, sorry about that.”</p><br/><p>As I stood up, my footing was unsteady. Novem supported my body, as we proceeded towards the room.</p><br/><p>(Was all of that a dream?)</p><br/><p>As I thought that, the First Generation’s voice rang out.</p><br/><p>『Wait a second… what’s that child’s surname? I’m starting to get curious. The air around her is a little familiar…』</p><br/><p>And I heard my grandfather as well.</p><br/><p>『She’s grown quite big, but that’s the second daughter of the Forxuz family. I never thought she would become Lyle’s fiancée, I mean, their statuses were just too separated.』</p><br/><p>『Whaaaaaaaa!!』</p><br/><p>The First raised a scream. It was really loud, but it still looks like Novem doesn’t hear anything.</p><br/><p>“… So it wasn’t a dream.”</p><br/><p>As I mumbled, Novem tilted her head.</p><br/><p>“What’s the matter, Lyle-sama?”</p><br/><p>But more importantly, this tired feeling is unbearable. I’m even more fatigued than before, and walking is a pain. I’ve never experienced being this tired before. After Novem led me to the bed, I laid down on the spot, and immediately fell asleep. The last I heard was Novem’s kind voice.</p><br/><p>When I laid down, she pulled the covers over me.</p><br/><p>“Good night, Lyle-sama.”</p><br/>\n</div>"}