{"title": "Volume 1 - Chapter 17: Lyle’s Ambition", "id": 17, "volume": 1, "url": "http://boxnovel.org/sevens-volume-1-chapter-17-lyle%E2%80%99s-ambition", "volume_title": "Volume 1", "body": "<h1>Volume 1 - Chapter 17: Lyle’s Ambition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lyle’s Ambition</p><br/><p>Dalien’s feudal lord’s mansion.</p><br/><p>It was our second visit, but the atmosphere around it was a little different this time around.</p><br/><p>Last time I was playing the fool, but as we were coming directly from the guild, I was dressed in rough attire.</p><br/><p>Usually, I would’ve changed, but Zelphy-san told me to hurry.</p><br/><p>And as we entered the gates and crossed inside the estate alongside her, Ventra-san was waiting for us.</p><br/><p>(I see, so they want to hasten the process.)</p><br/><p>Making her client wait probably put a little stress on Zelphy-san’s mind.</p><br/><p>To Ventra-san, who was drinking tea and greeting us with a smile, I offered my salutations.</p><br/><p>“I am deeply grateful for you holding this audience with…”</p><br/><p>“Let’s do without such formalities. Right now, I’m meeting Lyle-dono, the adventurer.”</p><br/><p>I wonder if that means he decided not to accept my return as the heir.</p><br/><p>(Has he heard from Zelphy-san?)</p><br/><p>The moment she learned I was from the Walt House, Zelphy-san likely made a report.</p><br/><p>(She probably got curious and investigated when she saw me use magic or something.)</p><br/><p>Today’s charge, the Seventh Generation, gave an evaluation of him.</p><br/><p>『I see. Looks like he’s not as he seems. How splendid.』</p><br/><p>As we sat on the sofa, Ventra asked what he wanted to know.</p><br/><p>That was the true goal of this visit.</p><br/><p>“I’ve heard from Zelphy. That you two weren’t particularly aiming to return to nobility, and that you were truly trying to live as adventurers. But you seemed to be moving along quite a different pretense during this case. If you wanted to sell your names, you should have moved in with an elite group during that mission. Right now, you’re being called an 『Idiotic Former Noble Brat』, you know?”</p><br/><p>From my actions, I already understood that the surroundings would see me as such.</p><br/><p>I matched their numbers several time fold to subjugate a single bandit troupe, and I even paid all the wages for it. There were many, many more efficient ways to go about doing it.</p><br/><p>Normally, I would be in a huge deficit. As an adventurer, and as the son of a noble, there was no helping it if they called me a fool.</p><br/><p>However, I fulfilled my own objectives, and on top of that, rather than going into the reds, I even earned sixty gold coins on top of that.</p><br/><p>It’s enough of a plus.</p><br/><p>“Ah, that was for my own benefit.”</p><br/><p>“So you say there was personal gain for you in this time’s subjugation?”</p><br/><p>Hearing that, the Seventh gave a subdued whisper.</p><br/><p>『It was to release the conditions for a Skill. Even if you say it, I doubt he’d understand, though.』</p><br/><p>That was exactly the case.</p><br/><p>I agreed with the Seventh’s opinion.</p><br/><p>And of all things, Zelphy-san brought up Lockwarde-san’s name.</p><br/><p>“Could it be that Lady Aria’s request moved your hearts? No, perhaps ulterior motives?”</p><br/><p>“Eh? No, something like that is…”</p><br/><p>It was only for a moment, but Zelphy-san directed an immense glare at me. Perhaps she was telling me to go along with it.</p><br/><p>The Seventh Generation gave a grunt of affirmation, before offering some advice.</p><br/><p>『Lyle, just go with that. It would be a pain if the First Generation started acting up about Aria again.』</p><br/><p>Without knowing what was going on, I affirmed it.</p><br/><p>“W-well… it’s that, you know… right?”</p><br/><p>As I gave a vague response, I took a fleeting glance at Novem.</p><br/><p>She wasn’t angry or anything. She was just drinking tea.</p><br/><p>(Okay, Novem understands the flow of this! No, wait, if someone looked on from the outside, they would definitely think I worked for Lockwarde-san’s sake.)</p><br/><p>Having thought that, I matched Zelphy-san’s accusation, and offered a vague response to Ventra-sama</p><br/><p>“I see, so I guess it just means Lyle-dono is a man as well. No, it sure is wonderful to be young. Be faithful to your desires.”</p><br/><p>He was smiling, but I didn’t feel like I was being praised at all.</p><br/><p>Without me being able to alter the flow, the matter ended as me performing the bandit subjugation mission for the sake of Lockwarde-san, who I took a liking to at a glance.</p><br/><p>(That’s kinda unpleasant in itself. I wonder what Novem is thinking.)</p><br/><p>I took another glance at her, but she didn’t seem angry in the slightest.</p><br/><p>I was afraid of whether she was seriously fed up in her deeper thoughts, but there were no signs of that either.</p><br/><p>“Fumu. If that be the case, then would you be fine if your reward is settled as Lady Aria?”</p><br/><p>“… Reward?”</p><br/><p>Ventra-san nodded.</p><br/><p>“In this matter, because of Lyle-dono, I was able to benefit. If you desire Lady Aria, then I’ll leave her disposal to you. I mean, the current head of the Lockwarde House was found to have ties to the bandit troupe, of all things.”</p><br/><p>From their actions up until now, Ventra-san assumed they had conspirators and investigated based on that it seemed.</p><br/><p>As a result, they had found some connections leading towards the Lockwarde House.</p><br/><p>Having learned that, Lockwarde-san was in quite a bit of shock.</p><br/><p>“A gem holding multiple skills truly isn’t an item for today’s era. However, if they sold such a thing to a bandit troupe, they should have been able to understand what sort of matter would result. If they aided them as well… we have no choice but to punish them.”</p><br/><p>He probably had to make an example of just what would happen if you aided enemies of the state.</p><br/><p>And wait…</p><br/><p>『S-sold, you say… Lyle! Right now, go beat the hell out of that Lockwarde House’s head! Doing something like selling Alice-san’s gem is going down the wrong path as a human being!</p><br/><p>And as always, the Second restrained the First.</p><br/><p>『And you went down the wrong path as a human parent. And wait, listen to what they’re saying. It’s about what’ll happen to your all-important Lady Aria, isn’t is?』</p><br/><p>『Ah, right!』</p><br/><p>The ancestors shut up, and I looked at Ventra-san.</p><br/><p>“Naturally, as part of the family, Lady Aria will have to take some responsibility as well in the matter. Even more so now that only the father and daughter remain. Good grief… even when Zelphy said she would lend me her aid only if I let them continue to live here.”</p><br/><p>“If I may be so rude, just what is it that the Lockwarde House did?”</p><br/><p>As Novem asked that, Zelphy-san covered her face with her left hand and explained.</p><br/><p>“Used their status as officers, had connections with criminals, and overlooked their sins. Because of that, the Lockwarde House’s reputation fell to the earth. Of course, the current head’s use of money was always rough. My father was driven out, and so we had to leave the capital and come to Dalien.”</p><br/><p>Ventra-san took over her explanation.</p><br/><p>“A knight driven out draws quite a few chastising eyes, so it was probably hard to live in Centralle. It looks like Zelphy-san’s house probably went through quite a bit of trouble. I mean, a knight became an adventurer to support her family.”</p><br/><p>From there, Zelphy-san had an expression no words could describe on her face.</p><br/><p>“Lady Aria watched the fall of the Lockwarde House with her own eyes. On top of that, she learned they were connected to the bandit brigade.”</p><br/><p>“That is…”</p><br/><p>Novem cut off her voice.</p><br/><p>If a house can be raised in a generation, it can be crushed in a generation as well.</p><br/><p>(Though I’m not really one to speak of that.)</p><br/><p>The Seventh Generation spoke.</p><br/><p>『Was the House’s achievements up until now the reason the clan or people concerned weren’t executed ? In my generation, they would all be sent to the gallows, you know? No, was the Lockwarde House in the Royal Faction? Perhaps it was the king’s benevolence.』</p><br/><p>It seems there were some circumstances surrounding the matter.</p><br/><p>Even I was banished, and if Zell and Novem weren’t there, I may have bled to death on the streets somewhere.</p><br/><p>I couldn’t think of this as someone else’s problem.</p><br/><p>It was because Zell picked me up that I obtained the Jewel.</p><br/><p>“… So what is going to happen to the Lockwarde House?”</p><br/><p>As I asked, Ventra-san’s face turned serious.</p><br/><p>Their troublemaking was tolerated until now. But they sold off an orb that contained multiple skills to enemies for paltry change.</p><br/><p>On top of that, they assisted them and even helped them slip into Dalien.</p><br/><p>I doubt he had any intention to let them off.</p><br/><p>“Because of Zelphy-san’s request, I let them stay in Dalien, but that has its limits. Having lost their rank and position, there was already enough demerits to keeping those troublesome presences in itself.”</p><br/><p>As they were driven out of Centralle, the Lockwarde House moved into Dalien.</p><br/><p>It was easy to live in and a territory close to the capital.</p><br/><p>But for an officer that had connections to criminals, Dalien likely wouldn’t accept them either.</p><br/><p>Zelphy-san was quite the loyal one, I see.</p><br/><p>“It’s true that they had connections and drew the bandits into Dalien. If we investigated, I wonder just what other deeds would surface as well…”</p><br/><p>The gem that was thought of as stolen was simply sold off.</p><br/><p>And along with conspiring… the Lockwarde Head’s sins were heavy.</p><br/><p>“The head will be sent to work in the mine. Originally, Lady Aria would be left alone with nothing but her figure and her age, so perhaps she would have to become a harlot in another land.”</p><br/><p>Being put to hard work in the mines as a slave.</p><br/><p>And the path of a harlot was what awaited Lockwarde-san.</p><br/><p>“But I didn’t want to dispose of the brave daughter in a way like that. No, if you pursue her, Lyle-dono, I’ll leave her to you.”</p><br/><p>Looking at Ventra-san’s smile, I tilted my head.</p><br/><p>“… Eh?”</p><br/><p>Zelphy-san energetically hit my shoulder.</p><br/><p>“Isn’t that great, Lyle! I mean, you’ve got a beauty like Lady Aria. Truly great. Ahahahahah!”</p><br/><p>“Eh, wait a second… eh?”</p><br/><p>She forcefully closed the conversation, and it doesn’t look like anyone here was going to listen to what I have to say.</p><br/><p>I looked towards Novem for help.</p><br/><p>And she…</p><br/><p>“You’ve done it, Lyle-sama. With this, you’re one step closer to fulfilling your dream.”</p><br/><p>“Eh? Dream? Eh? Eh!? What?”</p><br/><p>Within my confusion, the talks proceeded forward.</p><br/><p>『O-oy… what is the meaning of this?』</p><br/><p>The First was bewildered.</p><br/><p>The Second was in a similar state.</p><br/><p>『Eh? No… that’s where you should be helping him, right!? Hey, match the pace, and help Lyle make sure that Aria girl doesn’t end up as a prostitute!』</p><br/><p>But the Third differed.</p><br/><p>『Really? Is seems that everyone has their own motives here…』</p><br/><p>The fourth was troubled by Novem’s reaction.</p><br/><p>『Novem-chan, open your eyes! This end is no good!』</p><br/><p>The Fifth offered a complaint to Ventra-san.</p><br/><p>『This Lord, as payback for having been fooled by Lyle, he intends to push Aria onto him. This sly one’s probably roaring with laughter in his head after seeing Lyle so troubled.』</p><br/><p>It looks like the Sixth had taken a liking to Zelphy-san.</p><br/><p>『Even for that Zelphy adventurer girl, she sure was desperate. But still, Novem’s reaction was unexpected.』</p><br/><p>The Seventh Generation didn’t seem to mind it all too much.</p><br/><p>『It’s because Novem’s a daughter of the Forxuz House, so perhaps she doesn’t really mind if he has a side mistress or two? And wait, From my point of view, shouldn’t we be more worried about Lyle?』</p><br/><p>I understood I had no allies here.</p><br/><p>Of all things, when my eyes met those of the guard standing beside the lord, he broke into a grin.</p><br/><p>(… I-I was set up? B-but why?)</p><br/><p>I don’t think there was a problem in my train of thought that Zelphy-san could have just taken Lockwarde-san under her in an instant.</p><br/><p>Even so, it ended up that I was taking her.</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>Having returned to the rented house for the first time in a while, I confronted Novem.</p><br/><p>Preparing food would be a pain, so we got that over with outside.</p><br/><p>I already entered the bath and brushed my teeth.</p><br/><p>(I-I have to put my spirit into it!)</p><br/><p>I got my breathing in order and tried to convey my feelings.</p><br/><p>This wasn’t because the ancestors told me to.</p><br/><p>To the girl that always supported me, I wanted to give an answer to her feelings.</p><br/><p>More than anything… I liked Novem.</p><br/><p>I was starting to sweat from nervousness. The words weren’t coming out as well as I wanted.</p><br/><p>“Novem… I love you. As hopeless as I am, I’d like it if you married me.”</p><br/><p>“Lyle-sama… I’m happy.”</p><br/><p>Novem covered her mouth with both of her hands. Her cheeks were flushed, and her eyes were teary.</p><br/><p>“Y-yeah! So you see… um… I like Novem, and I don’t have any romantic feelings towards Lockwarde-san or anything. That previous matter was more of one to somehow save her, I think.”</p><br/><p>I felt like a hopeless man making an excuse for cheating, but getting my feelings to Novem across was my first priority.</p><br/><p>But the ancestors were noisy.</p><br/><p>I’d like it if they could read the mood and shut their mouths.</p><br/><p>The First and Second said…</p><br/><p>『What a hopeless remark… You’ve got to settle it clearly.』</p><br/><p>『From you, who wasn’t even able to talk to your first love, you’ve not a fragment of persuasive power there.』</p><br/><p>Novem, it was enough if you alone were by my side… I wanted to say that.</p><br/><p>“So I’d like it if you always stayed by my side. Together, I think it would be nice if we lived like that, you know…”</p><br/><p>『Well, your confession hasn’t really locked itself in place. And wait, I think it would be best if you made more of an atmosphere there. You’ve got to give a present, or select the location carefully, or else…』</p><br/><p>The Third judged me.</p><br/><p>I knew. But if I didn’t say it here and now, I get the feeling the situation will become irreversible.</p><br/><p>Wiping her tears with a finger, Novem spoke.</p><br/><p>“Thank you, Lyle-sama… but…”</p><br/><p>(B-but? Wait, does that mean I’m being rejected? S-she said she was happy, didn’t she?)</p><br/><p>“For those that call themselves men; it isn’t right for you to give up on your dreams so easily. You wanted to become an adventurer, and live a willful life being waited on by women… To realize that dream, you have to steadily increase your influence. In order to actualize Lyle-sama’s dream, as I thought, you will have to become a first class adventurer.”</p><br/><p>As Novem said that, I was unable to comprehend her meaning.</p><br/><p>A first class adventurer?</p><br/><p>I just became an adventurer to secure the necessary provisions to live, and I hadn’t really decided my future that far down the line.</p><br/><p>“… What?”</p><br/><p>『Lyle! So you had an ambition like that!?』</p><br/><p>I heard the Fourth Generation’s angry voice.</p><br/><p>But I had no memory of saying something like that. In the first place, it wasn’t like I was fixated on being an adventurer or anything.</p><br/><p>Novem continued on.</p><br/><p>“I am aware of the Walt Family Precepts. Surely, Aria-san is one worthy of being a woman of the Walt House. So please include her in your harem without any further delay.”</p><br/><p>Novem’s statement shocked the First.</p><br/><p>『W-what was that…』</p><br/><p>“Stop. Novem, please stop.”</p><br/><p>And wait, it wasn’t like I wanted a Harem or…</p><br/><p>While I was thinking that, the Third spoke up.</p><br/><p>『Ah! Lyle, you did say it! Come to think of it, you did say something like that!』</p><br/><p>(Like hell I did! And running after other women in front of Novem, who works herself so hard for my sake, I’m not that much of an idiot!)</p><br/><p>“I didn’t say that. I never said anything like that.”</p><br/><p>“Lyle-sama?”</p><br/><p>While Novem tilted her head, the Third Generation continued on.</p><br/><p>『See, that time at the start! Before you knew about our existence, you said those exact words to Novem atop the cart!』</p><br/><p>Hearing that, the Fourth Generation remembered.</p><br/><p>『So it was then!』</p><br/><p>In confusion, the Second generation confirmed it.</p><br/><p>『B-but that was just to get Novem-chan to return to her House, right? What? Isn’t it strange for Novem-chan to have not caught onto that?』</p><br/><p>After they said that much, I started to remember.</p><br/><p>I tried to disillusion her and send her back to her House.</p><br/><p>【I have no such will. I’ll become an adventurer and live a willful life being waited on by women. Being driven away by my family actually makes me feel relieved.】</p><br/><p>“Hot damn, I did!!”</p><br/><p>Having remembered it, I let out a confused scream, and Novem put her hand on my shoulder in worry.</p><br/><p>“Lyle-sama!? What could be the matter, Lyle-sama!”</p><br/><p>The First spoke in a low voice.</p><br/><p>『Y-you… despite being a wimp, you had ambitions like that.』</p><br/><p>To the First, the Second…</p><br/><p>『Follow the flow of the conversation! She got herself to believe the lie that Lyle spouted!』</p><br/><p>The Third Generation was a little lost in thought.</p><br/><p>『But still, I can’t think that Novem-chan didn’t notice something like that, though?』</p><br/><p>The Fourth judged me further.</p><br/><p>『Lyle! What are you going to do from here on out!? Even when you have Novem-chan, are you going to welcome that Aria girl? It’s obvious that you’re going to choose one!』</p><br/><p>To the Fourth, the First shouted.</p><br/><p>『Are you making fun of the living likeness of Alice-san!? You damn glasses, let’s take this outside!』</p><br/><p>The Fifth seemed to be of the same opinion as the Third.</p><br/><p>The Sixth gave Novem the following appraisal.</p><br/><p>『So Novem is that… the type of woman where if you take one step off the path, she raises a first class loser.』</p><br/><p>The Seventh remained unconcerned.</p><br/><p>『Lyle is the former heir of a Count House. What’s more, he’s a chosen existence that carries royal blood on him, isn’t he? This may be due to the Forxuz House’s teachings, but don’t make such a fuss over a mistress or two.』</p><br/><p>On the Seventh’s opinion, the Sixth gave a soft reply.</p><br/><p>『… You, you say something like that when you only had one wife alone.』</p><br/><p>The Seventh fired back.</p><br/><p>『Looking at Father(the Sixth) and Grandfather(The Fifth), there’s no way in hell I want a Harem. Well, if it’s Novem, she’ll properly manage such domestic matters, so there’s no problem.』</p><br/><p>(More importantly, why don’t you guys put out some good ideas to help me resolve this situation!?)</p><br/><p>To correct her misunderstanding, I stood and grabbed both of her shoulders.</p><br/><p>I ignore those unreliable guys and resolved myself.</p><br/><p>“Novem!”</p><br/><p>“Y-yes!”</p><br/><p>I get my breathing in order.</p><br/><p>And I stared into her violet eyes.</p><br/><p>“I don’t want a harem. As long as I have you, that’s enough!”</p><br/><p>“Lyle-sama… I deeply apologize.”</p><br/><p>In order to avoid any misconceptions, I made sure to say it clearly.</p><br/><p>I knew that a vague response wouldn’t get me anywhere.</p><br/><p>Even so…</p><br/><p>“Eh?”</p><br/><p>Novem offered her apologies, and the bell fastened on the door rung out.</p><br/><p>“I already called Aria-san over. She was without a place to stay, and Zelphy-san was living with her fiancé, so she said she couldn’t take her in.”</p><br/><p>“What about my opinion!?”</p><br/><p>This was the first I’d ever heard of Zelphy-san’s fiancé, but more importantly, I need to deal with Lockwarde-san.</p><br/><p>“And so, I am deeply sorry. Ah, I’ll go out to meet her.”</p><br/><p>As she separated from me, Novem looked like she was smiling a little.</p><br/><p>Like a mischievous child, that sort of happiness.</p><br/><p>(W-what does this mean?)</p><br/><p>I sat down on the spot and squatted, as I put both hands to my head.</p><br/><p>I have a woman who had been by my side for so long, and I’m bringing a new woman to the house.</p><br/><p>Looking from the sidelines, I’m definitely a hopeless man. There’s nothing I could say about it.</p><br/><p>“I really have no hope, do I!!?”</p><br/><p>And there, the Fourth’s words stabbed into me.</p><br/><p>『Ha? No matter how you look at it, you were hopeless from the start.』</p><br/>\n</div>"}