{"title": "Volume 3 - Prologue", "id": 36, "volume": 3, "url": "http://boxnovel.org/sevens-volume-3-prologue", "volume_title": "Volume 3", "body": "<h1>Volume 3 - Prologue</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>TL: start of a new volume, so recap to an extent.</p><br/><p>Prologue</p><br/><p>The Bahnseim Kingdom’s capital city, Centralle.</p><br/><p>Befitting of the capital city of the empire, it was a metropolis brimming with people.</p><br/><p>It’s said that all the people and products of the country gather there, but looking at its difference in scale from the other cities, one would have no choice but to accept that fact.</p><br/><p>Centralle was a city filled with a mix of pretty main roads, and old and gloomy back alleyways.</p><br/><p>In a place like that, I, the『Idiotic Noble Brat』 of Dalien, 【Lyle Walt】, my former fiancée【Novem Forxuz】, and the one who became comrades with us in Dalien, a city nice to newbie adventurers, 【Aria Lockwarde】made a stop on our travels.</p><br/><p>From my position as a Noble’s son, I made a complete change, became an adventurer, and went to the capital to prepare to head to whatever town we would set as our next home.</p><br/><p>While Centralle was in the center of the country, it wasn’t a city friendly to adventurers.</p><br/><p>It’s because they couldn’t have their scarce job market be put to feeding said adventurers.</p><br/><p>The public safety was maintained by the soldiers and knights, so there was barely anywhere left for adventurers to get a turn.</p><br/><p>Even if work did come up, it would be for a well-known adventurer taking on the work of some noble or merchant.</p><br/><p>The rest of the lot could only barely scrape by.</p><br/><p>In a city like that, masses of people came and went, and the streets were well cared for.</p><br/><p>In order to migrate to another part of the land, it was quite a convenient place to stop by.</p><br/><p>With bright brown hair tied in a side ponytail, Novem was sitting drinking after-meal tea in the store we stopped by for lunch.</p><br/><p>Her pale skin and violet eyes seemed to suck one in.</p><br/><p>If there was anything I had to brag about, it would be this well-put-together former fiancée Novem.</p><br/><p>But perhaps she was a little too devoted, as she was truly trying to actualize the harem plan I voiced as a lie.</p><br/><p>As perfect as she was, could it be there was something out of place somewhere?</p><br/><p>Novem, and the other…</p><br/><p>With red hair grown out to her back that curled up out of habit, there was Aria.</p><br/><p>We met when I was to subjugate a bandit brigade, and from then, she started taking action alongside us. The comrade we gained in Dalien.</p><br/><p>The two girls and I, the three of us were seated around a round table at a snack food shop.</p><br/><p>After finishing our meal, we started to talk about the information we had gathered.</p><br/><p>I went up first.</p><br/><p>“I’ve gone around, and looked at the weapons and armor, but I still think it may be a bit too early for us to head to the free city of Beim. The shopkeepers all informed me that before going there, I better pile up some more skill.”</p><br/><p>Beim was a city ruled by merchants, and its abundance of jobs made it an easy place for an adventurer to live.</p><br/><p>But at the same time, the areas out of the scope of merchants had a tendency to have a lack of public order.</p><br/><p>Without enough experience, if we were to head to Beim, then young adventurers like us would soon be looked upon as prey. The possibility was high.</p><br/><p>I have the confidence to get back at whoever would do such a thing, but raising a ruckus wouldn’t be to my advantage.</p><br/><p>Novem agreed.</p><br/><p>“I am the same. I was shopping with Aria-san, but it sound like Beim will be rough. Our lack of numbers is another problem they spoke of.”</p><br/><p>For adventurers, a group of three was on the lesser side.</p><br/><p>Numbers are power, and that alone would make an opponent hesitate to play their hand.</p><br/><p>However, teenage adventurers with scarce numbers like us had a tendency to be targeted.</p><br/><p>Aria was the same.</p><br/><p>“They told me that a young girly like me shouldn’t set foot in there as an adventurer. A large number of mercenary brigades set up residence there, and there are plenty of people there who shouldn’t be approached.”</p><br/><p>It was definitely true it was an easy place for adventurers, but the sack of public safety was just as true.</p><br/><p>But for adventurers, heading to Beim was an unavoidable trial. A majority of famous adventurers received their calls to fame while working there.</p><br/><p>Of course, it’s not like my end goal was to succeed as an adventurer.</p><br/><p>… More so, I didn’t have a goal in general.</p><br/><p>I simply worked as one in order to live, and the earnings weren’t all too bad.</p><br/><p>But I don’t plan on going on like this.</p><br/><p>“Since it’s come to this, we’ll put Beim on hold. Even if we’re to go, it would be better if we gathered up numbers first. Anyways, we just need to join in a party with adequate numbers.”</p><br/><p>As I said that, Novem showed some disapproval.</p><br/><p>It’s not rare for parties of two or three to act together. Many adventurers cooperate on jobs, and don’t get involved with each other in other matters.</p><br/><p>But it looks like Novem was opposed.</p><br/><p>“I’m against it. The leader of this party is Lyle-sama. But speaking to our age, both you and I are but of fifteen years. It we are to link with another group, we will definitely be treated as inferiors.”</p><br/><p>And Aria whispered something unrelated.</p><br/><p>“… I’m sixteen, you know…”</p><br/><p>“Is that so? I’m counting on you from here on as well, Aria-san.”</p><br/><p>It looks like Novem wouldn’t allow anyone but me to be the leader.</p><br/><p>In the city of Dalien, our experienced advisor taught us quite a few things.</p><br/><p>In a period of three months, we hammered the experience that would build our foundations into our bodies.</p><br/><p>But in the end, it was but the foundations.</p><br/><p>“If merging with another party is impossible, then… the only option left is to invite people into our own. Do you think there are that many adventurers who want to enter our party?”</p><br/><p>We were all generally young.</p><br/><p>Rather than the prime of our lives, we were in the prime of our growth.</p><br/><p>If they buy into our future prospects, perhaps our comrades will increase, but the usual pattern is that it’s the party with greater numbers that takes in the younger members in order to increase the power of the next generation.</p><br/><p>Parties made up of only young people don’t have it that easy.</p><br/><p>“Considering that, should we just head to the city of scholars? 【Arumsaas】 has a large library, and I’ve heard it has numerous private schools and training halls. There are campuses for study, and they take in a wide variety of youths.”</p><br/><p>Hearing that, it sounded as if going there would be like commuting to school.</p><br/><p>I’m the same, but Novem was born into a Noble House.</p><br/><p>Starting with reading and writing, she’s received a proper education.</p><br/><p>Aria didn’t have problems with the three Rs either. For argument’s sake, she even committed etiquette to heart.</p><br/><p>“So we’ll be applying to learn specialized fields? It will be hard to find the time and money for that. I’ve no intention to commute to a school for years.”</p><br/><p>As I said that, Novem shook her head.</p><br/><p>“There is no need for us to enroll. They call out to those who’ve graduated formal education, and those aiming to find adventurer work in the city of scholars as well.”</p><br/><p>Satisfied with that, Aria nodded a few times.</p><br/><p>“Come to think of it, the leftover kids of imperial nobles also enroll there. Like second and third sons not succeeding their houses, or second and third daughters and the like. You often hear of them going to get some skills to carry out governmental work. Of course, there’re also some stories of them failing, and changing to adventurers or mercenaries.”</p><br/><p>Novem took over Aria’s explanation.</p><br/><p>“If there are youths there with an extent of knowledge, experience and technique, then how about we try recruiting at Arumsaas? We aren’t in any sort of hurry, so we can even study while doing guild work.”</p><br/><p>Hearing that, Aria started talking as if she had remembered something.</p><br/><p>“Arumsaas is the city of scholars, so I heard in the past that they were full of really strange requests. Also, there are plenty of adventurers there like us. Searching for comrades, or staying in order to search for a party. Those sorts of people are numerous.”</p><br/><p>Having heard both of their opinions, I began considering whether it was best to set out there.</p><br/><p>There, a voice came from the blue Jewel hanging on my neck.</p><br/><p>Jewel… they recorded the single Skills that manifested in individuals, and transmit them. As a gem, this one recorded a total of eight Skills.</p><br/><p>The Jewel was a tool that held the function to teach the stages of a Skill a gem could not, and also whatever other useful applications the Skill held.</p><br/><p>The blue one in my possession had a characteristic of causing Support Class Skills to emerge.</p><br/><p>The red rem around Aria’s neck was for Vanguard Class.</p><br/><p>And Yellow Gems recorded Readguard Class Skills.</p><br/><p>Hers was a gem, but once they turn to Jewels, a large change comes about.</p><br/><p>『Library, is it… in my time, the city of scholars wasn’t a thing. I think it was 【Town of Sages】? It was called a gathering of bigoted old men back then.』</p><br/><p>The one I heard was the Third Generation.</p><br/><p>The Third Generation Head of the provincial noble Walt House, 【Sleigh Walt】’s voice.</p><br/><p>Right.</p><br/><p>The memories stored in the memories of the Skills, their hearts… those were what transmitted the ways to use the Skills.</p><br/><p>OF course, that wasn’t just a good thing.</p><br/><p>Silky blond hair that hung down to his shoulders.</p><br/><p>While the Walt House currently held Count Status, back in the Third Generation’s time, it was at Baron level…</p><br/><p>From the lowest knight class, it was just one rank higher.</p><br/><p>He was a man who left his name in history as one who safeguarded the retreat of a king, but… I can’t think of this person as anything so righteous.</p><br/><p>He looked stylish, and he was always smiling. With blond hair and blue eyes, he looked like a good tempered older brother.</p><br/><p>That was the impression he gave off.</p><br/><p>Following on from the Third Generation, I heard the Fourth’s voice.</p><br/><p>『You really do love books. If only you ran your internal affairs with so much zeal when you were alive.』</p><br/><p>On the Fourth’s remark kneaded with sarcasm, the Third laughed.</p><br/><p>『It’s best to take everything in moderation. Also, even if I didn’t do it, I had subordinates for that, and all we had to do was work based on the Second Generation’s plan.』</p><br/><p>Despite the Third Generation being the first one to carve the Walt Family’s name into the history of the Bahnseim Kingdom, he truly seemed to have a carefree personality, and he didn’t seem to hold interest in anything.</p><br/><p>His interest in domestic affairs and war was particularly light.</p><br/><p>(Really, why was this man called such a righteous general…)</p><br/><p>As I thought that, Novem seemed worried about me. Her expression looked dark.</p><br/><p>“What’s wrong, Lyle-sama? Are you feeling alright?”</p><br/><p>In comparison to Novem’s worried words, Aria was cold.</p><br/><p>“I-it’s because you stay up so late at night! I-it’s because you say things like that…”</p><br/><p>Her face was tinted red, but I shot back.</p><br/><p>“Things like that? More so, I slept quite early yesterday. The only time I stayed up so late was the night we arrived here. What’s more, the one who looked sleepy the next day was you, Aria.”</p><br/><p>I returned those words, but Aria’s reaction was strangely sharp.</p><br/><p>“W-whose fault do you think that is!? Whose!?”</p><br/><p>By the way…</p><br/><p>The people around me cannot hear the voices from the Jewel.</p><br/><p>I’ll also put this out, but there are as many voices in the Jewel, as there are people who had their Skills recorded into it.</p><br/><p>There are Seven… no, there were.</p><br/><p>Now, the Six ancestors talk with me like this. But the others can’t hear them, so it’s quite troubling a lot of the time.</p><br/><p>The hunter-styled Second Generation spoke.</p><br/><p>Let me add on that generations two through four showed heavy favoritism towards Novem.</p><br/><p>But Aria was different.</p><br/><p>『What a noisy woman.』</p><br/><p>The Sixth voiced his agreement.</p><br/><p>『Quite right.』</p><br/><p>And in the end… my grandfather, the Seventh Generation closed the matter.</p><br/><p>『Whatever the case, if Beim sounds impossible, then isn’t Arumsaas good enough? I’ll bet the Third Generation wasn’t to read his books, but wouldn’t it just be fine to head to Beim after gathering your party there? I mean, the knowledge and technology of the city of scholars is known not only throughout Bahnseim, but the surrounding countries as well.』</p><br/><p>Sometimes noisy.</p><br/><p>Sometimes acting up to deplete my Mana and make me collapse.</p><br/><p>Sometimes giving me advice. My ancestors.</p><br/><p>I took their opinions into account, and let out my conclusion.</p><br/><p>“That sounds nice. It will be safer than travelling to Beim, and it seems it would be for our sake.”</p><br/><p>To put it more specifically, it’s like past personalities just reside in the recorded Skills.</p><br/><p>That’s all it is, but… the Jewel even recorded their hearts.</p><br/><p>It’s truly troublesome, yet I can only be thankful to them…</p><br/><p>“Anyways, once we’ve finished our preparations, let’s set off for Arumsaas. Lyle-sama, we’ll have to book a coupled carriage ticket.”</p><br/><p>Novem holds down Aria, and recommends the purchase of a ticket.</p><br/><p>A coupled carriage is, well, a series of carriages coupled together. That’s all it is, but by that, goods and people can be carried en masse.</p><br/><p>Using Magic Tools, it became possible to decrease the fatigue, and increase the strength of the horses.</p><br/><p>It was one of the common transportation methods linking large cities and towns.</p><br/><p>“Got it. If we’re preparing now… would a departure tomorrow be fine?”</p><br/><p>I sought confirmation from the two of them, and Novem and Aria both nodded.</p><br/><p>Novem was smiling.</p><br/><p>Aria was averting her gaze with a flushed face.</p><br/><p>(Did I really do something to her?)</p><br/><p>I thought whether I had done something bad to Aria, but the Fourth, who repeatedly told me to handle women with the utmost caution let out a sigh.</p><br/><p>『For you to truly not notice… Lyle, maybe it really is best if you go off and learn a few things.』</p><br/><p>I thought.</p><br/><p>(And that’s why we’re going to the city of scholars, isn’t it…)</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>Aboard a coupled carriage from Centralle, we headed for Arumsaas.</p><br/><p>The roads for the trip were well maintained, and with stops at the towns we passed through, we were able to arrive in five days.</p><br/><p>If we were on a normal carriage, or on foot, it would take much more time.</p><br/><p>We crossed the walls encircling the city, and were surprised from the make unlike the towns and cities we had visited before.</p><br/><p>“Amazing.”</p><br/><p>As I muttered that, Novem dismounted the carriage, and voiced her agreement.</p><br/><p>“I’ve heard they have various research facilities, so I really is different from other cities.”</p><br/><p>Aria also consented.</p><br/><p>While she had heard tales of it, coming here the first time was likely surprising.</p><br/><p>“That building in the center, isn’t it taller than Centralle’s royal palace? Even so, how should I put this…”</p><br/><p>Before Aria could say it, I opened my mouth.</p><br/><p>“It’s a complete mess.”</p><br/><p>Ignoring the very concept of scenery, the city was flooded with tall buildings. At the same time, there were constructs with quite strange structures littered around.</p><br/><p>There were some with smoke rising from their lined-up chimneys, and even some that were shaped as if large pieces of vegetation were bore through.</p><br/><p>It felt much more mixed than Centralle’s cityscape.</p><br/><p>“How should I put this, it’s as if everything they could think of was forcefully shoved and shaken up inside a box.”</p><br/><p>As Novem said that, Aria agreed.</p><br/><p>“Come to think of it, it really does give off the feeling of a boy’s toy chest. Not tidied up cleanly, with everything just shoved inside.”</p><br/><p>Hearing of a toy box, some of my past memories revived in me.</p><br/><p>It was the happenings of before I was deserted by my parents.</p><br/><p>My father bought me toys.</p><br/><p>My mother got angry at me for not putting them away.</p><br/><p>It felt really nostalgic.</p><br/><p>Of course, those warm memories would come to an end at ten.</p><br/><p>The cause was my sister, Celes.</p><br/><p>Stronger than me. Smarter than me. Loved by everyone.</p><br/><p>According to the one who taught me all he had, and recognized me…</p><br/><p>A【Monster】.</p><br/><p>Having acknowledged me, and having fulfilled his role in the Jewel, I was unable to meet the First Generation Head anymore.</p><br/><p>The one that man told me to be most vigilant of was my own sister, Celes.</p><br/><p>(If I were to study here, would I be able to surpass her?)</p><br/><p>Beaten black and blue by that sister, I lost and was driven out of the house. To me, she was nothing but a symbol of fear now.</p><br/><p>(… Let’s not think about it for now. But someday…)</p><br/><p>Resolving my heart, I took up Novem and Aria’s baggage, and started to move.</p><br/><p>“Well then, let’s find an inn, and take it easy. It will be tiring if we just keep on moving.”</p><br/><p>As I said that, Aria returned a quip.</p><br/><p>“The tired one is you, isn’t it? Make sure you don’t collapse as usual again.”</p><br/><p>… My Mana drained by the Jewel, I had already collapsed a number of times, so there was nothing I could say in return.</p><br/><p>Novem came to my side on the matter. She did, but…</p><br/><p>“Lyle-sama has already been graced with a Growth, so he should be fine. Isn’t that right, Lyle-sama?”</p><br/><p>Growth… in this world, it was like overcoming a wall, and like that, feeling a sense of rebirth.</p><br/><p>It was without a doubt, the sensation of surpassing the me I once was.</p><br/><p>But at the same time, it makes one feel larger than life.</p><br/><p>Looking at me, Aria covered her mouth, and stifled some laughter.</p><br/><p>Novem put on a smile enveloped in warmth, as she looked at me.</p><br/><p>“… Stop it. Please stop.”</p><br/><p>Even just remembering it made my face red.</p><br/><p>Even when I should have experienced one at a much younger age, I experienced my first Growth at Fifteen.</p><br/><p>I experienced it, and frolicked around in the sensation of being reborn anew.</p><br/><p>It was a memory I didn’t want brought up again.</p><br/><p>Aria spoke.</p><br/><p>“Lyle, don’t worry… you were really interesting back then.”</p><br/><p>I responded.</p><br/><p>“I told you to stop, didn’t I!? Also, at that time, you said, ‘Mine was nothing like this!’ Right? That means something happened right! It did, didn’t it!?”</p><br/><p>“T-that isn’t the case!”</p><br/><p>There, I heard a voice from the Jewel.</p><br/><p>It was the Fourth</p><br/><p>『That attitude he keeps taking against this girl… yep, it’s a lecture later.』</p><br/><p>There are times when nothing but my consciousness is sucked into the Jewel.</p><br/><p>And like that, I’m able to meet with the ancestors.</p><br/><p>Him saying I’ll be lectured means I’ll probably be summoned sometime later.</p><br/><p>The driest one, the Fifth spoke.</p><br/><p>『You can ignore that female ass-licker, and just go search for an inn already. If you just stay rowdy in the middle of the street like that, you’ll attract attention.』</p><br/><p>Among the heads of history, the Fifth was said to have had the largest amount of mistresses, and he is recorded as the greatest womanizer of the Walt House.</p><br/><p>But the reality was different.</p><br/><p>He didn’t seem to be all too interested in sensual love as a whole.</p><br/><p>In exchange, he doted on soft animals to a strange extent.</p><br/><p>“… Ku, shouting here won’t get us anywhere. Let’s be off.”</p><br/><p>“… I know.”</p><br/><p>I turn my eyes away from Aria’s glare, and looked around for an inn.</p><br/><p>If there was a signboard, I planned to enter and check for vacancies.</p><br/><p>Novem started laughing to herself, looking at me and Aria.</p><br/><p>“What’s happened?”</p><br/><p>When I asked, Novem answered with a smile.</p><br/><p>“No, the two of you are just getting along better than before, so I was simply happy. Now shall we go?”</p><br/><p>On her response, I really didn’t know what to say.</p><br/><p>The one I truly loved was Novem, and I even confessed already.</p><br/><p>But her answer was, ‘until you succeed in making a harem, you can’t just give up!’</p><br/><p>Wondering just where I went wrong, I dropped my shoulders, and walked down the streets of Arumsaas, the city of scholars.</p><br/>\n</div>"}