{"title": "Volume 5 - Epilogue", "id": 83, "volume": 5, "url": "http://boxnovel.org/sevens-volume-5-epilogue", "volume_title": "Volume 5", "body": "<h1>Volume 5 - Epilogue</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Epilogue</p><br/><p>… The expeditionary force was seen off by the waving hands of the villagers.</p><br/><p>Having protected the village from a Gryphon attack, they even went as far as to assist in mending the damages, and the civilian’s impression of them was drastically better than when they first got there.</p><br/><p>Casualties did surface, but it was much more decent than annihilation.</p><br/><p>No, asking for any more would be simply greedy.</p><br/><p>Within that, Aria sat in Porter with a blanket around her.</p><br/><p>“… It’s… really heavy.”</p><br/><p>Within Porter alongside her, were Shannon, Miranda, and Monica.</p><br/><p>Shannon was playing with Monica, and Miranda was slumped, dead-tired.</p><br/><p>It was all fine up to the banquet.</p><br/><p>The knights and soldiers celebrated their victory, and the villagers joined in, drinking, and making merry…</p><br/><p>The problem surfaced the next day.</p><br/><p>A large change came about in Aria and Miranda.</p><br/><p>At first, they thought it was simple fatigue, but their bodies felt heavy.</p><br/><p>Their moods had also fallen, and they didn’t want to move.</p><br/><p>Because Lyle and the rest had been doing various things in the village, they were allowed to lie down, and rest.</p><br/><p>But after it had continued on for a couple of days, they figured there was surely something strange about it.</p><br/><p>As Aria began feeling worse, Monica spoke to her.</p><br/><p>“If you’re going to hurl, I ask you do it outside. I’ve no mind to clean up a mess besides one of my chicken dickwad’s.”</p><br/><p>As Monica said that with all earnesty, Aria stuck her glare on her.</p><br/><p>“Oh, you really like Lyle, now don’t you.”</p><br/><p>Aria stood up within Porter, and looked outside.</p><br/><p>Behind, the Gryphon was being preserved in a block of ice.</p><br/><p>It had few wounds, and was taken out in a single blow, so it was carefully preserved for its high profit prospects.</p><br/><p>But it’s quite likely that would never reach up to the five hundred gold they had lost.</p><br/><p>In front, Norma was mounted on a horse, leading the troops with an enervated expression on her face.</p><br/><p>Those who had yet to undergo a complete recovery.</p><br/><p>Those killed in action were loaded on a horse cart, and taken along. Lyle and the rest of the party were walking close to Porter.</p><br/><p>Novem was talking as she walked, while Clara was sitting on Porter’s roof, operating the golem.</p><br/><p>But Marcus’s group wasn’t alongside them.</p><br/><p>(But there’s no helping it.)</p><br/><p>After the banquet, various things had happened, and they began taking distance.</p><br/><p>Aria looked at Novem conversing with Lyle, and thought back to what happened when they left the village.</p><br/><p>At the time of parting, Lyle had been talking to the boy from the village.</p><br/><p>He was the boy Lyle had looked after all throughout their stay, and Lyle even went as far as to bestow his weapon unto him.</p><br/><p>Seeing his kind face to a child, Aria found it unexpected.</p><br/><p>(So he isn’t just kind to women.)</p><br/><p>Finished gazing outside, she sat down on a wooden crate inside Porter, and saw Miranda wriggling around.</p><br/><p>She let out her face, and was making a terribly dark expression.</p><br/><p>To put it bluntly…</p><br/><p>(Uwah, how scary!)</p><br/><p>Even Aria made a repulsed expression.</p><br/><p>She was always all smiles, but since the end of the battle, it didn’t seem she had such leisure.</p><br/><p>She only directed a forced smile whenever Lyle was around.</p><br/><p>And having even lost her usual courtesy…</p><br/><p>“… Shannon, water.”</p><br/><p>“Y-yes!”</p><br/><p>Shannon hurriedly prepared water, and Miranda rose to drink it.</p><br/><p>Her light dress was soaked in sweat, and perhaps she wasn’t feeling the best. Her expression held no elegance.</p><br/><p>After the banquet.</p><br/><p>Miranda had severely rebuked Marcus and his group.</p><br/><p>It’s likely because she didn’t like how Lyle hadn’t pressed them any further for their slip up, and even submitted a report that could lead to a promotion as promised.</p><br/><p>The Hippogryph hadn’t brought about any casualties, and in the end, Lyle was the one to deal the final blow.</p><br/><p>The way he didn’t seem to mind it too much must have irritated her.</p><br/><p>And besides business-like conversations, Lyle no longer involved himself with Marcus’s group.</p><br/><p>Having finished the water, Miranda wiped her face, looked at Aria, and spoke.</p><br/><p>“What?”</p><br/><p>She would usually say that with a smile, but now she glared with sharp eyes.</p><br/><p>It may have scared her in the past, but the current Aria had grown up a bit.</p><br/><p>“Nothing really. You looked like you were in pain, so I was looking at you. In that state, I’m surprised you can still make a smile in front of Lyle.”</p><br/><p>Aria had meant that in jest, but as she herself was also feeling under the weather, she wasn’t able to make it show in her tone.</p><br/><p>And unable to smile, Miranda reacted by twitching her eyebrows. Shannon began shaking in fear.</p><br/><p>Looking at that, Monica…</p><br/><p>“Oh, is this a scene of carnage? How nice. I was just getting bored, so I wanted to see one in person, you know. Now the two of you, fair and square, the muddy soap-opera fight of two women in love…Fight!”</p><br/><p>When she began working herself up, Shannon tried stopping a smiling Monica.</p><br/><p>“You, don’t be starting a fight in a place like this! And what the hell’s a ‘soap-opera‘!?”</p><br/><p>“It’s something like a play. Now on with the live carnage!”</p><br/><p>“This one’s strange in the head!”</p><br/><p>… She was broken from the start, so it was only natural…</p><br/><p>When Miranda tried to stand, they heard a knock on Porter.</p><br/><p>After a while of silence, Lyle opened the door.</p><br/><p>The golem had halted movement, so it was likely break time.</p><br/><p>Aria spoke.</p><br/><p>“Is it already time for rest? On the way here, we only stopped at lunch, right?”</p><br/><p>When Lyle poked his head in, Miranda continued making her pained face as she formed a smile.</p><br/><p>“I proposed that we take breaks more frequently. Also, there are some that want to defeat monsters along the way to rack up some numbers.”</p><br/><p>Defeating monsters along the way, those that were barely able to perform on the battlefield could earn some merits.</p><br/><p>And Lyle decided to buy up the materials and magic stones from that.</p><br/><p>Lyle spoke.</p><br/><p>“Are the both of you alright? I’ll take up watch today too, so just rest at ease.”</p><br/><p>Miranda replied.</p><br/><p>“Sorry for that.”</p><br/><p>(… Miranda, she’s quite dark herself.)</p><br/><p>While looking at Miranda, Aria thought that. Suddenly, Shannon fixated her eyes on Lyle’s chest.</p><br/><p>“… The light moved…”</p><br/><p>What was this girl saying?</p><br/><p>The question surfaced in her mind, but without her usual composure, Aria ended up letting herself rely on Lyle.</p><br/><p>“I’ll leave it to you. And wait this time’s really heavy. I’m scared for what’s to come…”</p><br/><p>The high tension resulting as a reaction from Growth.</p><br/><p>The results varied by the individual, but perhaps Aria and Miranda had surpassed the maximum permissible level of experience, as it was taking their bodies quite a while to get over it.</p><br/><p>Aria didn’t let by the doubtful reaction Lyle made for an instant.</p><br/><p>(He’s surely remembering his own Growth.)</p><br/><p>With a smile on his face, Lyle spoke to the four inside Porter.</p><br/><p>“If you want to go outside for a change of pace, then I highly recommend it. Monica, Shannon, you two are to help with work outside.”</p><br/><p>Normally, Shannon would hate it, but because of the mood inside, she almost burst into the great outdoors.</p><br/><p>While Lyle made a surprised face, she begged for him to give her some work.</p><br/><p>Monica walked outside, and while she was closing the door…</p><br/><p>“We’ll make sure not to get in your way, so take your time.”</p><br/><p>…. Said that.</p><br/><p>Perhaps she was waiting expectantly for the two to fight. Her smile was quite irritating.</p><br/><p>Neither Aria nor Miranda wanted to fight of their own wills.</p><br/><p>Both of them wrapped blankets around themselves, and rested their bodies…</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>Separating from Porter, I looked up at Clara.</p><br/><p>“You sure that was alright?”</p><br/><p>“Yes. It would be troublesome if they went on a rampage inside Porter.”</p><br/><p>Shannon and Monica took up their work, and I talked to Clara.</p><br/><p>It was something I already knew, but this party was lacking in numbers.</p><br/><p>In all seriousness, I wanted to recruit a few in.</p><br/><p>Around us, there were many a soldier with the same pained expressions of Aria and Miranda-san.</p><br/><p>We stepped off the path, and lay down by the roadside to rest.</p><br/><p>I heard the Fifth’s voice.</p><br/><p>『You’re using the Fourth’s Skill to compensate for movement speed. It’s quite a large force, but Lyle’s mana should be able to deal with it.』</p><br/><p>Perhaps they had gained confidence in their abilities, as a large number of soldiers and volunteers took the initiative to go out and engage monsters.</p><br/><p>Our movements as a group were much better than at the start, and we had achieved a victory, so the mood wasn’t bad.</p><br/><p>The Third heedlessly…</p><br/><p>『I wanted to promptly stick it to Norma at the start, but looking at the result, it turned out perfectly fine.』</p><br/><p>From my point of view, as we had casualties, I couldn’t really call it perfect.</p><br/><p>I do think we reduced the damages to the least we could, but even so, deaths arose.</p><br/><p>(If only I had done a little better…)</p><br/><p>When I made a complex face, the Fourth spoke to me.</p><br/><p>『Lyle, I hope you’re not thinking you could’ve gone about it better, right? Even if you do what’s needed, there will be deaths and damages. Thinking that your efforts could’ve prevented it all is nothing but arrogance.』</p><br/><p>And the Sixth agreed.</p><br/><p>『Right. Regretting after it’s all over won’t get you anywhere. If you did it the best you could, then stick out your chest.』</p><br/><p>I’m not in that sort of mood.</p><br/><p>(Those standing at the top sure have it rough.)</p><br/><p>When I got a taste of that feeling, I experienced just how heavy having responsibility was.</p><br/><p>The Seventh…</p><br/><p>『This is another good experience. I thought it would be a boring job, but it looks like Lyle’s learned an essential lesson.』</p><br/><p>… At the start, it was a request from the Circry House Head.</p><br/><p>A frail unit was to take on a Hippogryph, and it was expected that many casualties would surface.</p><br/><p>But in truth, the opponent was a Gryphon, and annihilation was more than possible.</p><br/><p>I recognized once more my own naivety.</p><br/><p>(The voices I can hear have decreased…)</p><br/><p>The First, and now the Second’s voices were no longer there.</p><br/><p>When I took the Jewel in my hand, Clara called over to me.</p><br/><p>“Lyle-san, did something happen?”</p><br/><p>I couldn’t go about giving the whole truth, so I offered her an excuse.</p><br/><p>“I was just a little curious about Luka. I wonder if he’ll properly study.”</p><br/><p>As I said that, Clara smiled.</p><br/><p>“He was quite enthusiastic, and after he learned a little, he was quite delighted. Ah, another thing…”</p><br/><p>“What?”</p><br/><p>While Clara was making her usual expressionless face, I noticed her complexion was a little pale.</p><br/><p>“Are you feeling ill? Then take a rest at once…”</p><br/><p>“I’m sorry. I’m, well… looks like it’s come for me.”</p><br/><p>Come?</p><br/><p>When I started pondering her words, Novem raced over.</p><br/><p>“Lyle-sama! Over sixty percent of the troops have been hit with degradations to their physical states. We did obtain a large amount of experience, so perhaps it will go on to spread to the entire corp.”</p><br/><p>For an amount of experience too great, or an experience one had never gone through before, there were several common patterns of how the body dealt with it.</p><br/><p>The Second said it, but there’s the case where my physical condition collapses completely, and after that, I revive.</p><br/><p>And there’s also the case where the body instead takes its sweet time processing that experience.</p><br/><p>“This is bad. Let’s hurry to the next town. There, we’ll stay a night or two, and observe the…”</p><br/><p>After I said that much, I get the feeling some expectant glances were directed at me from within the Jewel.</p><br/><p>In a small voice, the Third…</p><br/><p>『… mr. lyle…』</p><br/><p>Whispered.</p><br/><p>(I-it’s alright. I don’t feel any different this time. I’m the type that needs an enormous amount of experience to go through Growth.)</p><br/><p>I took a deep breath to calm myself.</p><br/><p>There’s no such change going throughout my body.</p><br/><p>I don’t feel heavy either.</p><br/><p>“A-anyways, let’s pick up the pace. Dispatching one knight to explain the situation, and building up preparations would be best.”</p><br/><p>I did have some leisure with my previous payment so I’m still fine with gold.</p><br/><p>When I started thinking of whether or not to fork over money…</p><br/><p>The Fourth gave a proposal.</p><br/><p>『Ah, right… while we’re at it, why not spread a little rumor?』</p><br/><p>The Sixth spoke with intrigue.</p><br/><p>『Oh? Perhaps that would be nice. It’s not bad for our return to be a little late.』</p><br/><p>Following the flow, the Third…</p><br/><p>『Then it’s decided. It’s at times like these that the troubadours… those singers make it so much easier.』</p><br/><p>The Seventh…</p><br/><p>『Yes, before those imperial rats can make a move, let’s cement it in legend. It will spread to the Capital soon enough. Even if we’re unable to move for a time, we can at least spread some hearsay. By the time they set out to control the situation, it’ll be too late… wonderful!』</p><br/><p>Troubadours were those that spoke of affairs of the world and stories. At times they would sing, and at times, show off their technique.</p><br/><p>A majority of them were elves.</p><br/><p>Their race mainly lived in the forest, but as a nation of hunters, they didn’t really form settlements. No, perhaps it’s more correct to say they couldn’t.</p><br/><p>Because of that, they would sing songs as they travelled, and earn some money by polishing their skills, and showing them off.</p><br/><p>Their way of life was one easy to make fun of, and there were quite a few foreign spies who infiltrated among them, so they were refused the right to settlement.</p><br/><p>“Lyle-sama.”</p><br/><p>Novem looked at me with worry.</p><br/><p>“I-it’s nothing. Let’s send someone ahead first. After that, if there happens to be a troubadour in the village, let’s try spreading the details of the incident to them.”</p><br/><p>Novem put her hand to her chin in thought.</p><br/><p>“Perhaps that would be nice. But there’s no guarantee you’ll find one there.”</p><br/><p>“We’re just on the level of, ‘it’s nice if one’s there.’ No need to worry too deep into it. If the village seems starved of good entertainment, we can spread it ourselves if we really want.”</p><br/><p>Deciding to move as such, we sent out Clark-san alone to find the nearest village ahead.</p><br/><p>(Even so, it will become troublesome if even Clara becomes incapable of movement.)</p><br/><p>Before we returned to the Imperial Capital, I wanted everyone to be back to normal.</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>After spending two nights at the village and departing, as expected, a strange air began to envelop the camp.</p><br/><p>Aria…</p><br/><p>“I… want to become a bird. I want to fly on and on in the open skies.”</p><br/><p>Miranda-san was in agreement.</p><br/><p>“Ah, I totally get you there. Lyle, won’t you be my bird cage?”</p><br/><p>I gave an immediate response.</p><br/><p>“I have no idea what you’re talking about.”</p><br/><p>Clara held her hand to her mouth as she…</p><br/><p>“Ah, I see, so you want to hold that spear as your wings, and hop around the battlefield some more? I get it. Miranda-san, how about you go get yourself jailed already then?”</p><br/><p>Clara isn’t a girl to say such things!</p><br/><p>That’s what I thought, but the surrounding soldiers…</p><br/><p>“When I return, I’m going to propose to the girl back home!”</p><br/><p>“If it’s now, I think I can thank mum for all she’s done for me! Thanks for givin’ birth to me!”</p><br/><p>“… You guys, I’ll pretend I didn’t head that.”</p><br/><p>The final soldier looked upon the bright men with a dark expression.</p><br/><p>Looking at the scene, Monica spoke.</p><br/><p>“I wonder what it is. It’s interesting, but it’s nowhere near the level of the chicken dickwad when I first met him. Each and every one of them’s got a foot on the brakes.”</p><br/><p>She did seem a little tired, but more so than anything, she was sending some expectant glances in my direction.</p><br/><p>On Shannon’s side…</p><br/><p>“Help me! Aria’s started reciting a strange poem, and onee-sama’s started prattling on about the meaning of love and life and all that jazz! It’s unbearable!”</p><br/><p>She clung to me in tears, but I averted my eyes.</p><br/><p>“Surely you jest! Just what are you expecting me to do!?”</p><br/><p>Suddenly, Aria…</p><br/><p>“From the noble lady of a baron fallen down to adventure. Oh, woe is me… Powerless I am, I swing my spear, yet that gallant soldier a guise it be. If you will take my penny, I’m more delicate than any, and starving for love as all.”</p><br/><p>As she directed fluttering glances at me, I averted my eyes.</p><br/><p>Clara was…</p><br/><p>“Even for a former lady, one who gets excited at the sight of blood, and would have likely been a general by now had she been a man can’t be called powerless. Rather than starved for love, are you not thirsty for blood?”</p><br/><p>Miranda-san…</p><br/><p>“Ah, why is it these burning feelings in my chest can never get across to Lyle!?”</p><br/><p>She looked at me, and her expression was quite serious, so I averted my eyes once more.</p><br/><p>Clara…</p><br/><p>“It’s not that they don’t get across, but that you’ve been flat out rejected, right? Reality sure is a cruel mistress.”</p><br/><p>Crushed by Clara’s harsh objections, the two of them seemed to sink into past events they wanted to forget.</p><br/><p>Novem spoke.</p><br/><p>“This time’s Aria-san is quite severe. Lyle-sama was quite a trial last time, but for her to be this… at most, she would sing some of her self-composed songs, and that would be the end of it.”</p><br/><p>I looked to Novem, and spoke.</p><br/><p>“Eh? I never heard of any of this.”</p><br/><p>“No, you were out cold.”</p><br/><p>If I knew, I would have been able to grasp at her weakness… while thinking that, we reached the exact halfway point to Centralle.</p><br/><p>And…</p><br/><p>(An enemy? Two orcs.)</p><br/><p>Thinking that, I looked to the direction the enemy was at.</p><br/><p>We did have lookouts stationed, so the reaction of the troops was fast.</p><br/><p>“Two orcs! They’re coming towards the center body!”</p><br/><p>It looked like the two were headed to the center of the group.</p><br/><p>We all stopped and entered preparations for battle, but everyone was in a dangerous post-Growth state.</p><br/><p>The knights as well.</p><br/><p>“If it’s now, I can beat an orc with a single knife!”</p><br/><p>There was even an idiot who voiced something like that.</p><br/><p>(I guess I’ll take care of them here.)</p><br/><p>“Novem, I’ll handle them. Force everyone to wait on standby here.”</p><br/><p>“Eh? … Y-yes!”</p><br/><p>Rather than surprised, it seems she wanted to say something, but she put that on hold and abided my orders.</p><br/><p>If it’s just two orcs, it won’t take any time at all.</p><br/><p>That’s what I thought when I headed off to defeat them.</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>After the aftermath of the Orc battle.</p><br/><p>I was lying down flat on Porter’s loading tray.</p><br/><p>“W-whyyyyy!!!?”</p><br/><p>I suddenly couldn’t muster any power in my body, and that was accompanied by a pain I had never felt before.</p><br/><p>On top of sore muscles all through my build, my Mana was too used up, and I felt my consciousness would drift somewhere far away.</p><br/><p>Even letting out a loud voice brought pain to my body, and looking after me, Monica looked quite delighted.</p><br/><p>“Nursing the damn chicken to health… I won’t concede such an important role to any other.”</p><br/><p>Shannon spoke.</p><br/><p>“And no one else wants it.”</p><br/><p>Inside Porter, me, Monica and Shannon rode.</p><br/><p>Outside a merry expeditionary force was marching on, and the symptoms of Growth came to visit me right after the orc battle.</p><br/><p>The Third raised an expectant voice.</p><br/><p>『Finally! It’s finally here! mr. lyle is!』</p><br/><p>The Fourth carried out some calculations.</p><br/><p>『At this rate, it’ll be before we reach Centralle? No, perhaps once we’ve barely arrived…』</p><br/><p>The Fifth…</p><br/><p>『This boy’s timing is…』</p><br/><p>The Sixth.</p><br/><p>『Lyle’s sure got it. Besides luck, this sort of… pff…!』</p><br/><p>Continuing on from the laughing Sixth, the Seventh as well.</p><br/><p>『The first Best Lyle in a while… I get the feeling I can get my hopes up.』</p><br/><p>I muttered.</p><br/><p>”D-don’t screw with me… this time, I won’t be meeting anyone. Definitely. I’ll definitely lock myself in!”</p><br/><p>My voice rose in the latter half, and Shannon looked at me, fed up.</p><br/><p>“Are you sure your head’s alright?”</p><br/><p>Monica was…</p><br/><p>“Even if you try to do that, I’ll be by your side to the end. I mean, that’s the duty of Monica, the finest automaton masterpiece!”</p><br/><p>Resolving myself to lock myself away once we reached the capital, I endured the pre-Growth pains, and waited for the time to go by.</p><br/><p>I had seen Aria and the others’ pitiful displays not too long ago, so I’ll absolutely make sure nothing happens this time.</p><br/><p>(I ain’t going outside at all! There’ll definitely be nothing to make the ancestors burst into laughter! Right, I’ll never make the same mistakes again!)</p><br/>\n</div>"}