{"title": "Volume 8 - Epilogue", "id": 143, "volume": 8, "url": "http://boxnovel.org/sevens-volume-8-epilogue", "volume_title": "Volume 8", "body": "<h1>Volume 8 - Epilogue</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Epilogue</p><br/><p>With the Labyrinth having been overthrown, we ate and drank in the town that had entered a festive mood.</p><br/><p>Alette-san’s party returned from the innermost chamber- and if you asked if I was curious of the dubious expression on their faces, then surely I was- but anyways, it was accurate to say this time’s Labyrinth subjugation was a success.</p><br/><p>The sum put to preparations as well as the daily expenses here taken into consideration, the income of this expedition was exceedingly good.</p><br/><p>The gemstone that definitely had some meaning to it… we were even able to get our hands on peridot.</p><br/><p>Other than that, the eleven Bosses of the eighth floor were also a large contributing factor.</p><br/><p>Even if we could only collect their stones, they were sold off for an ample monetary sum.</p><br/><p>It was around noon that news of the mission’s completion began to spread. Now it was night, and things had yet to die down.</p><br/><p>I listened to the hustle and bustle around as I proceeded preparations towards our withdrawal tomorrow.</p><br/><p>Eva was singing songs alongside her elven brethren.</p><br/><p>May seemed more busy than usual with the festival food stands.</p><br/><p>Perhaps Clara was exhausted from the enthusiasm, as she was lying flat in Porter.</p><br/><p>Aria was conversing with the new adventurers she’d gotten to know over the trip.</p><br/><p>Miranda was bothered by something, and I saw her take Shannon along in the direction of Alette-san’s place.</p><br/><p>Monica was maintaining her tools, and cleaning the area.</p><br/><p>On the wooden crate I was using in place of a desk, she placed a tray with light food on it. She left a drink, and some paper alongside it.</p><br/><p>I had to calculate our net gains, and of how we were going to use the peridot.</p><br/><p>Within the Labyrinth, we were able to find eight pieces of it in total.</p><br/><p>It was exceedingly noisy around, but I didn’t find it particularly annoying.</p><br/><p>“So this is how a festival is supposed to be.”</p><br/><p>Up to now, I’d only ever really seen them from afar. It was my first time joining in on one.</p><br/><p>From the Jewel, I heard the Third’s curious voice.</p><br/><p>『Huh? But wasn’t there the harvest festival and all the other ones back at our place? They had them running in my generation, at least.』</p><br/><p>The Fourth explained in regards to that.</p><br/><p>『Well, after climbing all the way to counthood, I doubt they’d be participating. At the big festivals, I’d return to the mansion after I went out to give my greetings, after all.』</p><br/><p>I never thought I’d have a chance to go ‘round a festival with friends. When I was small, my father would bring me along to give the opening address, and after seeing that nothing was wrong, we’d return at once.</p><br/><p>The Fifth.</p><br/><p>『… If we were there, the folks that wanted to make noise would be too mindful.』</p><br/><p>The Sixth alone seemed to be having fun.</p><br/><p>『If you were a bit more of an adult, I’d teach you more the joys of drink and slot, but… while we’re at it, should I teach you of women for the times to come?』</p><br/><p>Gahahaha, he laughed, as the Seventh drove the nail in.</p><br/><p>『When someone who failed with female relations as much as yourself says it, you’ve not the slightest fragment of persuasive power. Lyle, there are plenty who destroy themselves for a spot of fun. You should be careful yourself.』</p><br/><p>Smiling a little, I reached out a hand to the food on the table.</p><br/><p>Potato cut slim, and fried in oil, alongside sausage fried in much the same way. The grease made my hands all sticky, but it tasted delicious.</p><br/><p>When I rose to wipe off my hands, Novem presented a wet towel to me.</p><br/><p>“You’re not going to go out and make merry?”</p><br/><p>I took the towel, wiped off my hands, and placed it on the desk.</p><br/><p>As Novem looked at the memo paper in front of me, I explained.</p><br/><p>“I just want to finish this up first. Best to save the fun for the end. I’ve given everyone enough of the reward to play around. You should go out and enjoy yourself too, Novem.”</p><br/><p>While the town was in festive spirits, there was no point if you didn’t have any money.</p><br/><p>If it was just to play around, I had given out enough money. Of course, I informed them it was a deduction from the total reward they’d receive.</p><br/><p>“So are you calculating the earnings? What will you do with the gemstones?”</p><br/><p>Asked by Novem, I spoke in regards to the precious stones.</p><br/><p>“I’ll have them investigated once we return. Perhaps it would be best to keep them around as liquidable assets. We were able to bring in a lot this time regardless, so maybe I should leave them if they ever prove necessary.”</p><br/><p>If examination of the price proved it best we sold them, then that’s what I’d do.</p><br/><p>And it wasn’t a bad idea to keep them close at hand, either.</p><br/><p>On the memo was how many times each member had challenged the Labyrinth, and on what evaluations I would use to distribute the reward.</p><br/><p>I had thought of splitting it up evenly, but in that case, Shannon- who barely did a thing- would profit more than anyone else.</p><br/><p>I would be handing Shannon’s share to Miranda, but I doubt she would be satisfied with it either.</p><br/><p>So I was currently working towards a base reward evenly split, and a pay on top of that based on efforts.</p><br/><p>(It really is a pain.)</p><br/><p>While I thought that, the Fourth picked up on what was going through my mind.</p><br/><p>『Lyle, you have to be firm when it comes to money, or it will trouble you when it counts. Rewarding too much is no good, but too less is just as bad. There’s your future goal to consider, but repaying work with money is an important thing among comrades.』</p><br/><p>The Fourth told me not to be too light about it. Perhaps the other ancestors held the same opinion, as there were no objections.</p><br/><p>Before I handed over the money, I’d have to explain what the party’s shared funds would be going towards.</p><br/><p>And tell them our total earnings, on top of how pay was decided.</p><br/><p>It was busy even after it was over.</p><br/><p>(No, this is just because I hadn’t thought up the finer details yet. This time has been quite a good learning experience.)</p><br/><p>If you looked at us as a party, we were too few in numbers.</p><br/><p>But even mobilizing that amount was troublesome for the current me.</p><br/><p>Novem looked at me with an expression as if she wanted to say something.</p><br/><p>“Something to say?”</p><br/><p>“… You really won’t ask? About me and Octō? And Septem… about Celes-sama.”</p><br/><p>I extended a hand to my drink, opened my mouth to speak. I get the feeling the wind rose to rock the light of the lantern on the table.</p><br/><p>That didn’t happen. But I couldn’t help but feel it.</p><br/><p>(… To say my sincere feelings, I’m absurdly curious. I really want to ask, but…)</p><br/><p>I wanted to ask, but the party’s dissatisfaction had just been resolved to an extent. I got the feeling that I didn’t want to reheat it for the time being.</p><br/><p>“… Do you want to talk about it?”</p><br/><p>When I said that, she made a troubled expression, and hung her head.</p><br/><p>“Then it can come after you’ve gotten the mind to speak. Right, I have only one thing to confirm.”</p><br/><p>“What could it be?”</p><br/><p>I looked at Novem.</p><br/><p>“Novem, for whose sake do you move?”</p><br/><p>When I said that, she pinched her skirt with the tips of her fingers, and lightly raised it to give a tidy curtsy.</p><br/><p>“… For Lyle-sama’s sake. Those words hold no lies or fabrication.”</p><br/><p>“I see. Then so be it. Quite a bit happened this time around, and I have secrets of my own. Right… I’ll have to properly talk about that one as well. But for now, shall we enjoy the festive air a bit more?”</p><br/><p>Drink and make merry… could I do the same? And of the matter…. Of the problems that stemmed from my Growth highs, could I drink them away?</p><br/><p>I’m certain I’ll never forget them, though.</p><br/><p>(And wait, with all that’s going on, I’m exhausted. I don’t have any free time anymore.)</p><br/><p>I thought of the nearer future, as I turned my eyes to the paper.</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>… Beim’s Eastern Guild Branch.</p><br/><p>After a horse came with the notification, an emergency meeting was opened up in the guild.</p><br/><p>All the staff members they could gather were gathered, and with such a hole being made in their normal duties, the personnel looked quite worried.</p><br/><p>They had heard it was going favorably, but could a problem have surfaced?</p><br/><p>After everyone challenged the meeting with such an expression on their faces, the person in charge came in.</p><br/><p>Perhaps in a panic, the senior officer’s usual seven-to-three parted hair was in a mess, as he announced the success of this time’s Labyrinth Subjugation.</p><br/><p>“First of all, I must apologize for taking time from your busy schedules. And I’m sure you’re all anxious, so I’ll put this out there. This time’s Labyrinth Subjugation was a huge success. A low amount of casualties, alongside a comparatively large amount of treasures and stones for the Labyrinth’s scale. The Guild should be nothing but happy for it.”</p><br/><p>The receptionists calmed down.</p><br/><p>Tanya, who recommended Lyle’s party was the same.</p><br/><p>But the senior officer didn’t look all too happy about it.</p><br/><p>“At the same time, there was a report in regards to the treasure found in the innermost chamber. The one to acquire it was the party led by Alette Baillet. That in itself isn’t an issue. However, the treasure discovered was a considerable amount of mithril.”</p><br/><p>Mithril.</p><br/><p>Even among Rare Metals, it was a rare one. Normally, it would be discovered in Labyrinths twenty to thirty floors deep in scale.</p><br/><p>But such a thing had come out in one of only ten.</p><br/><p>Tanya corrected her glasses with her fingertips as she waited for the officer’s explanation. The surroundings personnel began conversing with the others around, but the noise eventually died down.</p><br/><p>If it were a twenty floor Labyrinth, there was a chance of finding mithril. But just because there was a chance, it’s not like you could suddenly find a mountain of it.</p><br/><p>“I’m sure many of you know of Alette Baillet’s situation. Once she returns to her country, she goes back to being a knight. Naturally, she cannot go against the will of her country. If they say they have not the mind to sell it to us, then that’s the end of the matter, but…”</p><br/><p>The fact that what Alette’s party had found was mithril was a large problem.</p><br/><p>Normally, it was something the guild and its affiliated merchants would give everything to buy, but if the other party didn’t feel like selling, they’d have to back off.</p><br/><p>The rights to it lay with the adventurers who beat the final boss of the Labyrinth. Going out of your way to obtain it would mean raising problems with capable adventurers.</p><br/><p>“… The knight brigade she is a member of. Meaning her country has its own circumstances. It’s going to become a bit of a problem. With that in mind…”</p><br/><p>The country her knight brigade was in service to was classified as a small one by those around it.</p><br/><p>But a small country as it was, its knights trained and built up experience as adventurers, making for a proficient fighting force that centered on actual combat.</p><br/><p>With all the surrounding countries being bigger than their own, they compensated for their small numbers with quality.</p><br/><p>Now about that country…</p><br/><p>“Good grief, it would all be well and good if any adventurer besides Alette Baillet had found it.”</p><br/><p>With those words from the senior officers, the guild staff dispersed.</p><br/><p>Tanya recalled the circumstances of Alette’s country.</p><br/><p>(Of all things, for it to be the country seeking out mithril for the Saint Succession.)</p><br/><p>Alette’s country 【Lorphys】, was stationed in the neighborhood of the theocracy of dubious diplomatic relations, 【Zayin】.</p><br/><p>And at present, the symbol of Zayin- the Holy Maiden- was changing generations, and they were scraping up mithril from wherever they could find it.</p><br/><p>While its diplomatic relations were quite sensitive, Zayim was also a country that had gone through repeated wars with the country of Lorphys.</p><br/><p>Things had calmed down at present, but it was the sort of place where the slightest problem couldn’t help but ignite the gunpowder storehouse.</p><br/><p>And the mithril that Alette had found. What’s more, in considerable quantities…</p><br/><p>(I do hope it ends diplomatically.)</p><br/><p>While she followed the dispersing receptionists to her own station, Tanya had such a thing on her mind.</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>… Within the Jewel.</p><br/><p>The center room had turned back from an arena to a conference room, and the ancestors sat around the round table.</p><br/><p>This time’s Labyrinth Subjugation had held good prospects for those ancestors as well.</p><br/><p>The Fourth stood, took out a blackboard, and began scribbling the main points over it.</p><br/><p>『Now then, I’m sure everyone has their own take on the matter, but let’s get it all together for now. Lyle is still quite depressed, so I doubt he’ll be moving much for a while, after all.』</p><br/><p>Unfortunately enough, a Lyle that wasn’t mr. lyle suffered a large chip to his assertiveness.</p><br/><p>And this time’s matter made it more than clear there was something up with Novem.</p><br/><p>The Third.</p><br/><p>『… Novem-chan is a good kid. At least that part is no mistake.』</p><br/><p>He obstinately refused to condemn Novem.</p><br/><p>The fourth didn’t want to chastise her either. The daughter of the house who’d practically raised him, and Lyle’s former fiancée.</p><br/><p>And all she had done for Lyle up to now.</p><br/><p>『But we can’t just go about closing our eyes to all the issues. I’ll have you all say your frank opinions on the matter here.』</p><br/><p>Within that dubious air, the Fifth with his elbow stuck into the table opened his mouth.</p><br/><p>『Octō, was it? Denoting number eight, and a something that dwells in the depths of the Labyrinths. No matter how you think about it, we won’t go off to meet here, but there’s one existence I know of that overlaps with hers.』</p><br/><p>The one to endorse his opinion was the Seventh.</p><br/><p>『Exactly my thoughts. Rather than the eight part, her residence in the Labyrinth’s depths. Meaning if you’ll remember who creates the Labyrinth, there’s one individual that comes to mind. The birther of Labyrinths, the evil god who became the enemy of mankind.』</p><br/><p>The Sixth looked up at the ceiling.</p><br/><p>『Seven goddesses, and two evil gods. Nine if you count them up. If it’s as the automatons say, then it’s starting in zero, and ending in nine. Ten gods, is it?』</p><br/><p>At the start, there was nothing in the world.</p><br/><p>There, the goddesses descended. They created the sky, the earth, the forests, living beings, humans, and finally, they granted wisdom, or so was left in myth.</p><br/><p>The reason any god worshipped henceforth were women must be because this world was created by goddesses.</p><br/><p>The Third put his hand on his forehead.</p><br/><p>『Once again, that’s quite a large-scale story we’re bringing up here. Well, of course… none of that is relevant to us.』</p><br/><p>The Fourth nodded.</p><br/><p>『Right. Enlarging the problem won’t bring about a resolution. And it’s not like we’re part of a tale to alter the direction of the world.』</p><br/><p>The Fifth agreed.</p><br/><p>『Right. Our goal is to take down Celes, who’s hijacked the country of Bahnseim. What’s more, in a way that will bring about a good result to Lyle.』</p><br/><p>The Sixth.</p><br/><p>『It will be troublesome if goddesses start coming out here. They’re gods because they lay their hands off, stand back, and watch after all. I’d appreciate they continued along that trend.』</p><br/><p>The Seventh.</p><br/><p>『But making entreaties to them is quite important. It changes how well you can command soldiers. Ah, we were talking about the Novem problem, weren’t we?』</p><br/><p>The Fourth removed his glasses, and began rubbing them against a cloth.</p><br/><p>『Honestly, when an evil god is telling us to trust Novem, that puts her on the dark side regardless of how you slice it. Yep, quite a cute evil god we’ve got there. Personally, Celes seems more cut out to the job.』</p><br/><p>The Fifth proceeded conversations, a little fed-up.</p><br/><p>『It really gets troublesome when you start calling them gods. When he gets the time, let’s just get Lyle to look into it. Though I doubt anyone will be left here when the time comes.』</p><br/><p>Everyone’s face looked unusually lonely.</p><br/><p>The Sixth spoke.</p><br/><p>『… We’ve gotten a little too involved, have we?』</p><br/><p>The usually-aloof Third put his hand to his chin.</p><br/><p>『Right. Originally, it would have been the end once we taught him how to use the Skills. But personally, I’d like to think that there was some meaning to our meeting.』</p><br/><p>The Seventh.</p><br/><p>『Don’t be so faint-hearted. If there’s no meaning to it, you need only make one yourself. Say that we’re here to make Lyle win.』</p><br/><p>Seeing the Seventh say that brimming with confidence, the Third gave a, ‘right you are,’ and smiled.</p><br/><p>And he stretched his arms.</p><br/><p>『Now then, we’ve gathered some considerable funds. If we’re putting that towards collecting information, he’ll have to get an army strong enough to fight on a national level. Otherwise, it won’t even be a battle.』</p><br/><p>The Sixth spoke.</p><br/><p>『The Walt House knights and soldiers are on the other side. How hard it shall be. We’ve turned our own tempered elites against us, after all.』</p><br/><p>Hearing that, the Fourth.</p><br/><p>『That’s… you know… you can say you know their weaknesses, or something.』</p><br/><p>The Fifth.</p><br/><p>『Simply having high quality troops doesn’t win wars. The side that carries out the preparations to win, and carries them out to the end are the victors. He’ll have to do at least that much.』</p><br/><p>The Seventh.</p><br/><p>『At the very least, it’d be a different story if he could use the soldiers of some country out there. If he’s going to be building everything up from scratch, then Lyle lacks the time.』</p><br/><p>The Third as well.</p><br/><p>『I’ll throw this on top, but you can’t just solve everything with money, either. It’s best you don’t borrow soldiers from an idiot who’d lend them out for money in the first place. I really don’t want to borrow anything from a guy like that. No~ how troublesome. After saying we’d make him win so boldly, we don’t have the slightest of ideas.』</p><br/><p>Seeing the Third raise his hands in submission, the Sixth spoke tiredly.</p><br/><p>『Yes, don’t just go giving up all of a sudden. It will take some time, but there’s still the option of building up a mercenary brigade, and taking over a country.』</p><br/><p>The Fifth.</p><br/><p>『Nah, not happening.』</p><br/><p>The Seventh as well.</p><br/><p>『Mercenaries have no credibility.』</p><br/><p>At that moment, the Fourth corrected his glasses, and spoke in jest.</p><br/><p>『At this point, how about we just get Lyle to seduce some princess out there already? If we can only prove his lineage, his face is on the better side, so take a girl or two, and the country while he’s at it? Or something like that~.』</p><br/><p>The Fourth had said that as a joke, only to find himself taken aback.</p><br/><p>All the faces surrounding the round table had serious expressions as they thought to themselves.</p><br/><p>The Sixth spoke.</p><br/><p>『… Huh? Isn’t that just what we need? And wait, I get the feeling if he was up to it, then using Skills and stuff will make it more than possible.』</p><br/><p>The Fifth.</p><br/><p>『No, no, what does that say of him as a person? I get the feeling he could do it, but that’s just as if Celes had become a guy. No different. He’d be doing the same thing.』</p><br/><p>The Seventh.</p><br/><p>『It’s an emergency, so if it comes down to it, just wife them all… no, I do think it’s quite impossible.』</p><br/><p>The Third.</p><br/><p>『… Dammit, if it were mr. lyle, then perhaps that Faunbeax princess would’ve been seduced already. We’ve let a huge chance slip by.』</p><br/><p>After saying that much, everyone exchanged some glances.</p><br/><p>They had done the thought, but they didn’t think such a thing possible.</p><br/><p>The Seventh spoke.</p><br/><p>『I-its not happening. Though I’m sure he could do it.』</p><br/><p>The Sixth as well.</p><br/><p>『Right. If he did such a thing, his head would be on the cutting block of all the countries he nabbed up.』</p><br/><p>The Fifth wiped off his cold sweat.</p><br/><p>『I-I know, right? It’s impossible, right?』</p><br/><p>The Fourth corrected the positioning of his glasses, wiped off his own sweat, and smiled.</p><br/><p>『Of course. Lyle fundamentally can’t do anything like that. And he’s usually a late bloomer. Well, let’s start by collecting information, and see what we can do about it from there.』</p><br/><p>In that strange atmosphere, everyone forced themselves to laugh, while the Third spoke in an earnest expression.</p><br/><p>『… If he were mr. lyle, it would definitely be happening.』</p><br/><p>He spoke with conviction…</p><br/>\n</div>"}