{"title": "Volume 12 - Prologue", "id": 206, "volume": 12, "url": "http://boxnovel.org/sevens-volume-12-prologue", "volume_title": "Volume 12", "body": "<h1>Volume 12 - Prologue</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Prologue</p><br/><p>There came a stream of restless nights.</p><br/><p>It was the season where the humidity from the port city became detestable.</p><br/><p>And despite the season, we were currently moving through a dim passageway. Diagonally to my side was Novem, and she used her magic to make a light from her staff.</p><br/><p>Both the ceiling and floor were of rugged rock. The walls grew moss, and were perpetually damp. Among Labyrinth passageways, it was of the wider sort, and there was at least eight meters to the ceiling. Its width around twenty. In the midst of battle, I doubt there would be a need to worry about a lack of space.</p><br/><p>Around, in blue, or perhaps navy suits of armor, the three Valkyrie units guarded the two of them. But there wasn’t really a need for that.</p><br/><p>Two weeks distance from Beim.</p><br/><p>At present, I… Lyle Walt had been dispatched to subjugate a Labyrinth that had manifested.</p><br/><p>That giant monster legion already felt like a thing of the distant past.</p><br/><p>“… Clara, stay on standby. I’ll have Miranda return to the surface. Aria, proceed onwards, and remove the monsters ahead.”</p><br/><p>I gave orders as I walked, but me and the girls… my party members had quite some distance between us.</p><br/><p>Conversing through Skill… Connection… I issued orders to Aria, Miranda and Clara, who led Valkyrie Series units of their own.</p><br/><p>I turned an eye to the Valkyrie walking opposite to Novem.</p><br/><p>(The mass produced unit Damien and old Letarta completed… not bad.)</p><br/><p>The ones they had successfully completed had been simplified, and while there were differences in their appearances and body types, there wasn’t any difference in their specs. They were wearing visor-like face masks, and I couldn’t tell what expressions they were making, but the Valkyrie Series were generally expressionless.</p><br/><p>The wing-like binders on their backs could process magic stones into a liquid, which they could then use as fuel. It considerably reduced my Mana cost, so it was a huge help.</p><br/><p>Black hair was the standard. However, each had devoted its time to differentiating itself with hair style. Bob cut, long waves. Braids. It seems the mass produced models had personality and a sense of individuality as well.</p><br/><p>While walking through the uneven corridor, I was organizing the information flowing into my head.</p><br/><p>This Labyrinth that had manifested out of a cave had only three floors to speak of. But the annoying part was the expanse it covered.</p><br/><p>It seems there was only a single boss at the bottom, and there was little deviation in its monsters. We weren’t particularly having a hard time. Three separate Labyrinth Subjugation requests had descended on Beim, and there were few adventurer parties they could send around.</p><br/><p>Alette-san’s party had challenged another Labyrinth, and it was decided they would dispatch mercenaries of the South Branch to the last one.</p><br/><p>The East Branch normally wouldn’t let Labyrinth Subjugations fall to other branches. Because if they did, the East Branch’s sole valuable appeal point would disappear. They wouldn’t be able to gather adventurers.</p><br/><p>While I absentmindedly wandered the cave, I ran into Miranda on her way out.</p><br/><p>“I could hear your voice the whole way, but meeting is yet another sensation.”</p><br/><p>There were four mass-produced Valkyries around her, and a sister carrying the luggage, her knees shaking as she shed her sweat.</p><br/><p>One of the Valkyries held a lantern in her hand to light up the surroundings.</p><br/><p>Miranda was wearing a hat, with a large rucksack over her back. She wasn’t in her usual skirt, instead donning thick work clothes, and gloves.</p><br/><p>“Looks like things went well on your side as well. Shannon, there won’t be any monsters on the way back, so rest easy.”</p><br/><p>There, Shannon raised her face, but perhaps from fatigue, she didn’t rain me with jeers as she usually did.</p><br/><p>“… I want to take a bath.”</p><br/><p>When she complained, Miranda lowered a fist.</p><br/><p>“Shannon, could you quit it already? See, just a little more to the first floor. Once we’re there, a short break, and we’ll be outside.”</p><br/><p>While Miranda tried to knock the life back into her, Shannon simply tottered as she walked off. And Miranda’s party started down the road we had came from. I let out a sigh.</p><br/><p>“Looks like Shannon’s doing alright.</p><br/><p>The one to respond was Novem. She was laughing, and with the long gazes she took at the girl, I’m sure she was happy at her growth.</p><br/><p>“She didn’t have any stamina before. If we keep at it little by little, she’ll build up some strength. Even so, this time’s Labyrinth sure is vast.”</p><br/><p>The second floor.</p><br/><p>At the head, Aria and Miranda were eliminating monsters. Clara was keeping the roads clear on the first floor.</p><br/><p>And Eva or May would likely substitute out with Miranda when she got back.</p><br/><p>“It’s our second Labyrinth subjugation, and everyone’s already a commander. Of course, we were the only ones dispatched in the first place. Good grief, just what part about this is small scale?”</p><br/><p>As a Labyrinth, it was only three floors. Needlessly wide, with only one boss.</p><br/><p>With the scarce variety of monsters, there weren’t any particularly strong ones. Certainly, in the guild’s classification system, it wouldn’t be strange for it to be written off as small scale.</p><br/><p>But I felt a little of a grudge.</p><br/><p>(It’s also a problem how the amount of stones we have to earn has been defined. I want to take the shortest route, beat the boss, and end it already.)</p><br/><p>That was from the Guild’s side. Not the East Branch, headquarters had ordered us to acquire a set amount of Magic Stones.</p><br/><p>I asked Alette-san, and it seems there had rarely even been such orders given out. If you find some rare material, then get as much of it as you can, was the most they ever asked for, she said.</p><br/><p>The Third spoke to me amused.</p><br/><p>『You’ve gotten their hate quite nicely, Lyle. Just a little more.』</p><br/><p>… I knew that, but getting this persistent harassment was harsh.</p><br/><p>This venture through the vast passages was also to test out the mass produced Valkyries’ specs.</p><br/><p>Old Letarta and Damien were on standby up top, and Adele-san and Maksim-san were participating as well.</p><br/><p>However, Monica was keeping house at the mansion.</p><br/><p>Novem smiled at me as she spoke.</p><br/><p>“It’s because they believe we can do that much. I’m sure the Guild isn’t stupid enough to offer an impossible task, and have another Labyrinth Rampage on their hands.”</p><br/><p>“… I’d really hope that’s so.”</p><br/><p>Last time, Fidel-san swung them around to his will, and got twelve cannons’ worth of compensation, I heard. And it seems the Guild executives took it up to get the man’s backing.</p><br/><p>In exchange for advocating in regards to their failed defensive war, they drank down his demands.</p><br/><p>(Well, the two extra cannons flowed from Vera to me, but…)</p><br/><p>We were talking, but cutting it off on the way, I pulled a weapon from my hip. Novem had to illuminate the surroundings, so she couldn’t take action. She stepped back, and strengthened the light.</p><br/><p>The Valkyrie Series took their weapons from their back wing binders. They were guns.</p><br/><p>They were items prepared by old Letarta, who modified them, apparently.</p><br/><p>The Valkyries…</p><br/><p>“Enemy confirmed. Proceeding to eliminate.”</p><br/><p>“Likewise.”</p><br/><p>“Bang.”</p><br/><p>After the guns blew their flames, three monster responses in the passageway ahead went out. Even so, the survivors came out way.</p><br/><p>The Valkyries swiftly prepared for the next attack, while the third unit alone lowered her gun.</p><br/><p>The monsters on the other side of the dark passage collapsed without showing their forms.</p><br/><p>I put away a Katana, and scratched my head.</p><br/><p>“… Their performance is definitely high, but…”</p><br/><p>Novem gave a bitter smile as well. Coming to my side, she agreed with my assertion.</p><br/><p>“Compared to a single monster of this Labyrinth, a bullet is more costly… we’re going into the red.”</p><br/><p>They had high specs, but I couldn’t help but have problems on the financial front. This time was just an experiment, so Letarta had them carry just the guns, but money-wise, they were a weapon I didn’t want to use so often.</p><br/><p>The Valkyries took out tools to strip off the Magic Stones and materials.</p><br/><p>“It is time for robbery.”</p><br/><p>“I will cleanly pick them off.”</p><br/><p>“Dissection is my specialty. Someday, those money eating worms manufactured before us, and that piece of junk Monica shall be dissected by my hands as well.”</p><br/><p>The third unit gave an ominous statement, but I ignored it. I could understand it was just standard communication from these ones.</p><br/><p>“I don’t want to take too much time. Once we get to the third floor, I’ll have Eva or May deliver supplies down. Have we achieved the quota?”</p><br/><p>When I checked in with Connection, a Valkyrie on the surface replied. She was carrying out Adele-san’s support.</p><br/><p>『… According to Adele, we have currently fulfilled sixty percent of the required quota. But hearing of the bullet consumption, she started crying.』</p><br/><p>On top of that, I heard the voice coming into the Valkyrie’s ears.</p><br/><p>『AAAaaAAH! Our expenses! Why!? Why make them use such a thing!? We’re down! Our profits from this Labyrinth Subjugation are going poooof!!』</p><br/><p>Looks like she has it rough.</p><br/><p>“Okay, let’s put a usage restriction on the guns. Any more, and I’ll feel bad for Adele-san.”</p><br/><p>There, the Fourth let a tired voice from the Jewel.</p><br/><p>『Lyle, you understand this is also your problem, right? Properly make a profit, man. Experiments are important, but money problems are just as important.』</p><br/><p>Advice quite suited of the Fourth Generation.</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>… Information dealer Rauno’s office.</p><br/><p>In it, the windows were shut and curtained, darkening the room. The only faint light emanated from the use of Rauno’s assistant Innis’ Skill… Information.</p><br/><p>From the information Innis had on hand, it was a Skill to predict the future.</p><br/><p>Rauno put both hands in his pockets, and looked over Innis.</p><br/><p>“So how is it, Innis?”</p><br/><p>Her eyes were closed, and after a while, she opened her mouth. Rauno had her read through as much of the information he’d gathered as possible.</p><br/><p>To hit the mark on her predictions, she couldn’t help but need a large amount of info. But it wasn’t like her accuracy was directly proportional to her information level. Because fake information would always slip around.</p><br/><p>But with more information, there were more things she could determine, and a bigger picture she could see based on that.</p><br/><p>“… Beim is still recovering from the damage that monster army caused.”</p><br/><p>When the army of monsters was closing in, they had scattered money, and produced large numbers of weapons. But Lyle had defeated the majority at Fort Redant, so looking at actual damage from enemy numbers, it was something quite insignificant.</p><br/><p>Rather than physical damage, it was severe monetary, and resource loss.</p><br/><p>“Good work for them to recover so much in only a few months. But I guess that’s Beim for you.”</p><br/><p>On Rauno’s light words, Innis didn’t show a response. She continued on with her predictions.</p><br/><p>“There are strange movements in Cartaffs. It may escalate to a large-scale riot. Also…”</p><br/><p>“Also?”</p><br/><p>“In the Guild headquarters, and among the merchants, dissatisfaction towards Lyle-san is rising. I conclude that pressure is being put down mainly by those not involved in backing him.”</p><br/><p>Rauno gave a bitter smile.</p><br/><p>“Why of course. Rile up the Trēs House’ head, and even the South Branch, and of course you’ll be hated. Though I doubt he doesn’t know that.”</p><br/><p>“… The Trēs House is watching, and waiting. Even when the other merchants and Guild make their moves, they don’t show any interest. The current Trēs House head is sure to have backed him. The probability of him being riled up on purpose is high.”</p><br/><p>Rauno couldn’t understand that part. The face that Lyle had seduced one of the Trēs House daughters was something he had confirmed from rumor, and the individual himself.</p><br/><p>So he didn’t know the reason behind angering the head.</p><br/><p>“Does that mean he got the amount of money he needed already?”</p><br/><p>“… The probability is low. There is a possibility he has made a large change in objectives along the way.”</p><br/><p>Rauno watched over Lyle’s actions with caution. It wasn’t because he was a client.</p><br/><p>It was because Lyle could slip up Innis’ predictions altogether.</p><br/><p>With the monster army as well, Innis had determined victory would be held down after heavy damage came out.</p><br/><p>But the result could be called an overwhelming triumph.</p><br/><p>“Young as he is, he’s leading the Guild and merchants by the nose… he won’t live long, that one. After Beim kicks him out, where will he go? Become the groom of Zayin’s Holy Maiden, or Lorphys’ princess?”</p><br/><p>Innis replied to his joke.</p><br/><p>“The individual has shown actions pointing to the desire to be exiled from Beim. And the probability of him becoming a groom alive is low.”</p><br/><p>While knowing full well that Innis rarely hit straight when things came to Lyle, he couldn’t help but look into him.</p><br/><p>“Now then, how will he move next, my client?”</p><br/><p>Innis opened her eyes. Perhaps she had overused her Skill, as she looked as if she’d collapse to the floor. Rushing over, and supporting up her body, Rauno put her to sleep on the sofa…</p><br/><p>–</p><br/><p>–</p><br/><p>–</p><br/><p>… Adventurer Guild Headquarters.</p><br/><p>In it, talks were being conducted, from the defense of Fortress Redant, to the changing situation of neighboring lands.</p><br/><p>It was fine and all that a country had fallen, but in its place, the superpower of Bahnseim was now in contact with them.</p><br/><p>The royalty that had fled from the land had taken flight to Bahnseim, but it didn’t seem they wished to retake power. No, they weren’t in a situation where they could make such demands.</p><br/><p>They had overlooked a Labyrinth running out of control, and brought great damage to other countries. If Bahnseim supported them to reestablish their country, Beim wouldn’t keep quiet. But as they wanted some land between them and Bahnseim, Beim’s opinion was to wring them out to an extent where they wouldn’t collapse.</p><br/><p>The reality was already beyond what those involved desired.</p><br/><p>“What did the messenger of Bahnseim say?”</p><br/><p>That meeting of executives gathered from the branches discussed how to deal with Bahnseim.</p><br/><p>“No particular demands. As we have now become neighbors, they wish to keep the national border what it was before, and they want to open a space for various discussions in regards to tariffs.”</p><br/><p>Those negotiations would fall into the merchants’ territory. Not the Guild.</p><br/><p>Watching over the meetingroom, Tanya was participating as the guard of her superior, the East Branch’s head.</p><br/><p>“So shall the Guild treat them as we have before?”</p><br/><p>When someone offered that statement, the moderator leading the meeting nodded.</p><br/><p>“It’s possible they may put out a request to borrow our strength in monster subjugation. But Bahnseim is a large nation. They have their backbone, so perhaps they won’t send such requests our way.”</p><br/><p>The executives smiled.</p><br/><p>They were making light of the stubbornness of nobles, and thinking they would come crying to Beim eventually.</p><br/><p>The South Branch’s executive spoke up.</p><br/><p>“When you think of Bahnsim, they’ve had quite a few rebellion these years. I would like to be more assertive in dispatching mercenaries.”</p><br/><p>Hearing that, the moderator nodded.</p><br/><p>“It’s been quiet in Zayin and Beim these days, after all. It’s a fact that the mercenaries have lost a place to earn. We’ll put in a proposal to the merchants.”</p><br/><p>The South Branch’s executive smiled on those words. No, he looked a little relieved.</p><br/><p>Tanya spoke to her superior.</p><br/><p>“They haven’t been making much lately. Just the other day, they forced their way into taking over a Labyrinth Subjugation request, but they’re getting quite impatient.”</p><br/><p>Tanya’s superior, levelly…</p><br/><p>“Is that not dangerous? Thinking of the importance of mercenary brigades, what will happen if we send them to a land with so much internal discord…”</p><br/><p>They were both adventurers’ Guilds of Beim, but their objectives were different. And the East Branch didn’t think highly of the South Branch’s rough way of doing things.</p><br/><p>When adventurers of the East Branch were dispatched, a large portion of their reasons for worry started from the South Branch… the mercenaries.</p><br/><p>At present, it seems they were thinking of sending their mercs, who’d built up their frustration, to rampage across Bahnseim.</p><br/><p>“But that is their job. Well, not all of them are good people, and it’s not like we’re any different.”</p><br/><p>And the conference turned to a certain topic.</p><br/><p>Once more, it was due to an utterance from the South Branch’s executive.</p><br/><p>“Come to think of it, that adventurer of the East Branch… Lyle Walt was a noble who flowed in from Bahnseim, was he?”</p><br/><p>On his forced phrasing, Tanya’s superior nodded with a smile.</p><br/><p>“And what of it?”</p><br/><p>“What, it’s quite famous how the Walt House’s daughter married into Bahnseim royalty. She’s been rampaging around quite flashily, but she is still the queen of a major country. Isn’t it time for us to show some good will?”</p><br/><p>To the South Branch executive, who was trying to take actions disadvantageous to Lyle, Tanya’s superior…</p><br/><p>“Even if you call it good will… It’s true he was driven out, but from then on, there hasn’t been any intervention from Bahnseim. I doubt it would be profitable to poke around the thorn bush.”</p><br/><p>The South Branch hung on obstinately.</p><br/><p>“And that’s precisely why. If they come to learn of it later, it may raise doubt towards us.”</p><br/><p>The moderator listened to the words of the two. And he gave down a verdict.</p><br/><p>“… Negotiations haven’t even begun. Let us take action after watching how things go. And he is being useful to the Guild. It is our policy to treasure those that bring a profit to us.”</p><br/><p>Meaning weighing Lyle and Celes on the scales, if the profit Lyle produced fell short of her, they would cut him off at any moment.</p><br/><p>(… Lyle-kun, just what the hell did you say to the South Branch’s executive?)</p><br/><p>Tanya sighed internally as she worried for Lyle…</p><br/>\n</div>"}