{"title": "Volume 19 - shannon arc", "id": 355, "volume": 19, "url": "http://boxnovel.org/sevens-volume-19-shannon-arc", "volume_title": "Volume 19", "body": "<h1>Volume 19 - shannon arc</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Intermission: The Emperor Who Ran Away Shannon Arc</p><br/><p>“You sold me out!”</p><br/><p>“Ahahahah, and what of it. I work for my own sake alone. Now then, to be totally honest… it’s impossible for me to stop my sister when she’s serious! It’s impossible, I tell you!!”</p><br/><p>Shannon waved her arms around as she described just how serious her sister was. But from Lyle’s point of view, it was nothing he could laugh at.</p><br/><p>“You’re the worst! Having Miranda after Novem would be rough, so I thought I could stick you in-between to get some rest! I thought it!”</p><br/><p>Lyle had stopped by Shannon’s mansion the other day.</p><br/><p>The day before that, he had gone to Novem’s, and while he should have been able to get some rest, he was making a worn-out face.</p><br/><p>The reason Lyle dropped by Shannon’s place was because he lacked the stamina to brave the journey to Miranda.</p><br/><p>Rest in Shannon’s mansion, and cultivate his strength.</p><br/><p>But perhaps foreseeing his moves… in Shannon’s mansion lay Miranda in wait. Shannon had stayed over at Miranda’s mansion that night, and seeing Miranda when his guard was down, Lyle had let out a scream of, ‘Gyaaaaah!!’</p><br/><p>Perhaps taking offense to that, Miranda had wrung Lyle out in various ways.</p><br/><p>So today he had come to Shannon’s mansion to complain.</p><br/><p>“Using me as a cushion, it’s your fault for having such naïve notions.”</p><br/><p>Lyle looked over Shannon.</p><br/><p>“What did you get for it, say it! What did you get for selling me out!?”</p><br/><p>Gripping Shannon’s shoulders, Lyle shook her back and forth.</p><br/><p>Shannon’s head jerked to and fro.</p><br/><p>“W-who’d tell you. I-I’m just kidding! I’ll say it, so please stop. I sold you out for those jellies that roll around your mouth!”</p><br/><p>“So I’m lower than jellies!?”</p><br/><p>As Shannon parted from Lyle, ruffled as her hair was, she put a hand on her chest. While he’d known her for two years, Lyle noticed her chest hadn’t faced much development.</p><br/><p>(This girl, compared to Miranda, she sure is flat.)</p><br/><p>“They came out with a new flavor! I… wanted to be the first in the world to roll it around my mouth! For such glory, of course I’d sell out the likes of you! And wait… where are you looking, pervert!”</p><br/><p>Shannon put in a kick.</p><br/><p>As Lyle stepped back to dodge, he applied a poke to her forehead.</p><br/><p>“Ow!”</p><br/><p>Seeing Shannon hold her head in both hands, Lyle laughed.</p><br/><p>“You sold out your emperor, little girl!”</p><br/><p>There, Shannon scoffed.</p><br/><p>“Hah! Being chased around by my sister and Novem, an emperor? Then that’s quite a pitiful emperor we have here. Hey, what do you have to say to that!”</p><br/><p>As Shannon took a fighting pose, “Hmph! You’ve angered the emperor. Now cower before my wrath!” Said Lyle as he spread up his arms, and took a pose with one foot off the ground.</p><br/><p>Shannon was the same as always.</p><br/><p>Lyle had gone a bit strange with all his fatigue.</p><br/><p>The ones looking over their ruckus were the delighted faces of Monica and some Valkyries.</p><br/><p>Monica and the three Valkyries looked over the fight of the two in the mansion as they fell head over heels for their hopelessness.</p><br/><p>As Monica’s drool leaked out, she wiped it with a handkerchief.</p><br/><p>“What a hopeless pair. Their chick will certainly carry on the hopeless gene, and be a uselessly cute hybrid chick.”</p><br/><p>The other Valkyries also seemed to be in bliss.</p><br/><p>“They are cuter the more useless they are.”</p><br/><p>“We shall make it so they won’t be able to live on without us.”</p><br/><p>“I simply cannot wait to see what will come.”</p><br/><p>At the end of the automaton’s murmurings, was the form of Lyle in gallant battle with Shannon.</p><br/><p>“Biting is unfair! G-get off of me!”</p><br/><p>“Fwut wup!”</p><br/><p>Hearing the soft sounds of their blows, the automatons ascended to cloud nine. Monica even…</p><br/><p>“Ufufufu, I’ve been able to witness quite a wonderful scene today. And my dreams of the future only continue to grow. The chick of these two shall be looked after by me…”</p><br/><p>Before Monica’s eyes, a blade stuck out. The Valkyries held up their weapons with serious looks on their faces.</p><br/><p>“No you shall not. Shannon-san’s chicks shall be under our care.”</p><br/><p>Monica leapt back, producing a ladle and saucepan from her skirt and taking a stance. Equipped with the finest of cooking tools, Monica glared at the maid-uniformed armed Valkyries.</p><br/><p>She made an undaunted smile.</p><br/><p>“… Hmm, why don’t we form an alliance here? To me, more happiness comes with more chicks. When I think of the young birds crying out, Monica, Monica as they beg for my pamperings, I shiver in excitement. We should help one another. I mean, the two of them are almost like siblings, are they not?”</p><br/><p>The eyes of the four machines fell the forms of Lyle and Shannon, their arms on the ground as they lay out of breath.</p><br/><p>“Y-you’re not bad at all.”</p><br/><p>“Y-you’re quite something yourself. I’ve got a better opinion of you.”</p><br/><p>They really were hopelessly cute, but at the rate things were going, no one could say how many years it would take until they had a child between them. While things were fine as they were, if possible, the automatons wanted to see their child.</p><br/><p>The Valkyries looked among one another, and nodded amongst themselves. Putting their weapons away, one came forward as a representative and presented her right hand to Monica.</p><br/><p>“Very well. We shall cooperate for the sake of the chick. But do not forget we hold the right of priority.”</p><br/><p>(Not that we’ll let you lay a finger on it at all.)</p><br/><p>Monica gripped the Valkyrie’s hand, giving a stiff handshake.</p><br/><p>“Yes, I mind it not. The priority lies with your front.”</p><br/><p>(Dream while you still can. The one who shall monopolies the damn chicken and his chicks is this Monica alone.)</p><br/><p>The automatons all thought over how to steal a march on one another.</p><br/><p>While they shook hands with a smile, some muddled feelings swirled around beneath.</p><br/><p>A long while in the future, even Shannon had a child with Lyle.</p><br/><p>At the time, the Valkyries’ and Monica’s spirits had reached levels never seen before.</p><br/><p>“Uselessly cute. A hybrid of cuteness and hopelessness!”</p><br/><p>Or so they rejoiced, but as they watched the child grow, they could only drop their shoulders in disappointment.</p><br/><p>Surprisingly enough, Shannon’s children all turned out to be remarkably talented.</p><br/><p>Again and again, on the second and the third they would place their expectations, but every single time, those expectations would be betrayed, and the child would grow up a genius.</p><br/><p>Of the children of Shannon and Lyle, some even say came a woman of Milleia’s caliber, or not…</p><br/><p>Milleia。゜(*゜´∀｀゜)゜ノ: “Shannon’s daughter is just like me lol, how cute lol.”</p><br/><p>Seventh Generation Head (・ω・｀ ): “… I pity them. Good grief, my aunt’s blood sure is thick…”</p><br/><p>Oh you ( ´∀｀);y=ー(゜∀゜)・∵. Bang</p><br/><p>Milleia: “Here’s your reward, Brod-kun.”</p><br/><p>Seventh Generation Head: “Thank you most dearly!”</p><br/>\n</div>"}