{"title": "Chapter 6 - Irritation", "id": 6, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-6-irritation", "volume_title": "Volume 1", "body": "<h1>Chapter 6 - Irritation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 6: Irritation</strong></p><br/><p>Xie Zhe returned to the classroom with a bottle of milk tea and leisurely walked back to his desk. Once he sat down, he noticed Qin Xu sitting next to him spinning a pen in his hands while in daze. It was a very unusual sight.</p><br/><p>Xie Zhe took a sip of his milk tea and licked his lips: “Xu brother what’s wrong? You’re looking as if you are looking at your lover. Don’t tell me this pen just transformed into a peerless beauty and snatched your soul away?”</p><br/><p>Qin Xu ignored the jesting words of his and tilted his head while fiddling around with the pen. He suddenly said: “Jiang Yang just lent me this pen. Jiang Yang.”</p><br/><p>He even specially repeated and emphasised that person’s name. His dark eyes were filled with incomprehension.</p><br/><p>Hearing those words, Xie Zhe couldn’t help but reveal a very surprised expression. He looked up at that person sitting in the distance, “Him? Really?”</p><br/><p>Taking a sip of his milk tea, Xie Zhe thought about it and reported his analysis: “This definitely isn’t because he went crazy. Although the act of lending a pen may seem insignificant, it actually hides a deep meaning. Based on my speculations, I think he probably wanted to apologise to you but is too proud to say it so he did it through the lending you the pen instead.”</p><br/><p>Finishing his speculations, he even nodded his head in approval at his own words. As for Qin Xu, only he knew whether or not he was listening and whether or not he agreed with his analysis.</p><br/><p>Qin Xu rolled the pen around in his hand and once again fell into deep thought. Soon afterwards, he looked down and continued to work on his homework acting as if nothing had happened.</p><br/><p>On the other hand, Jiang Yang did not expect that such a small matter would be interpreted in so many different ways by the other students. He simply thought that it was shameful of him to express goodwill to his enemy and, every time he managed to complete a task, he would breathe a sigh of relief. Returning back to his seat, he internally cursed at the system. As the system had not been installed the swearing function, it could only respond seriously: “Swearing is wrong.”</p><br/><p>This made Jiang Yang feel powerless as if he had just punched cotton with all his energy.</p><br/><p>Between classes, Jiang Yang got up preparing to head to the bathroom. Reaching the doorway, two female students appeared in front of him with their hands filled with a stack of books. The door blocked their view and by the time they saw him, it was too late to dodge. The girl standing closest to Jiang Yang turned around trying to avoid hitting him but Jiang Yang reacted agilely and stretched his long arms out to support the books for her.</p><br/><p>The girl breathed a sigh of relief and looked up at Jiang Yang. She couldn’t help but blush and immediately bow down her heard.</p><br/><p>Jiang Yang didn’t notice this and continued to walk out but at this moment a mechanical sound once again sounded in his mind: “Random task: Please help Qin Xu get his language book. Time limit is ten minutes. If you fail, there will be a punishment.”</p><br/><p>Jiang Yang stopped his footsteps, took a deep breath and told himself to calm down. Only after that did he turn around with a calm expression and tried to act natural: “Xu Ting Ting, leave the books on the podium. Later I will help you hand it out.”</p><br/><p>The girl who had already held up the first book preparing to hand it out to the owner froze. It wasn’t just her, the other students nearby who heard this was also stupefied. Why is Jiang Yang suddenly wanting to help out the language class assistants? Did he change his romantic target? Does he no longer like the school idol?</p><br/><p>A group of onlookers chewed on sunflower seeds as their brain filled with various ridiculous theories.</p><br/><p>As for the person who said those words, he had already turned around and left the classroom. The other party, Xu Ting Ting, remained standing there with a look of confusion on her innocent face while her friend nearby teased her. Sidling up next to her ears she whispered: “Jiang Yang rarely takes the initiative to help girls. This is unusual~”</p><div><div></div></div><br/><p>Xu Ting Ting looked down ignoring her. She jogged over to the podium where the books sat, grabbed her own workbook from the pile and returned to her seat.</p><br/><p>At the bathroom, Jiang Yang twisted open the faucet and washed his hands in a bad mood.</p><br/><p>The system reminded him: “Suddenly telling a girl that you’re helping her distribute out the workbooks, what if she misunderstands? Also, if she didn’t want your help and distributed the books herself then you would fail the task. The task is for you to help Qin Xu get his book. You can just take yours and his from the pile.”</p><br/><p>Jiang Yang begrudgingly replied: “I don’t want to.” It would make it seem as if their relationship was good.</p><br/><p>But with the system mentioning the fact that he may fail the task, he hastened his steps back to the classroom. Seeing that the workbooks were still there when he entered the room, he was able to breathe a sigh of relief. He then casually picked up the stack of workbooks and began distributing them out in order. At the same time he absentmindedly thought —— Where’s Qin Xu’s?</p><br/><p>He hoped that the next one would be his so that he could quickly finish the task.</p><br/><p>After distributing more than half of it, he finally saw Qin Xu’s name. Written in the blank space on the cover, his words looked powerful and elegant. Seeing those words he couldn’t help but feel irritated but he also had to admit that his handwriting is very nice to look at. Every time the class needed to write announcements on the blackboard they would always ask him to write but Qin Xu wouldn’t always agree. His willingness to help depended on his mood.</p><br/><p>Jiang Yang moved his lips slightly and softly snorted before striding over to Qin Xu’s desk. He placed down his workbook without a hint of hesitation the same way he had done so for the other classmates. He then turned around preparing to distribute out the next workbook.</p><br/><p>However Qin Xu suddenly spoke up rudely and blocked his path, “Jiang Yang, since when did you become so helpful?”</p><br/><p>Jiang Yang looked down and glanced at the long legs that obstructed his path. Qin Xu had lazily stretched it out and arrogantly placed it onto Zeng Yu’s seat across the aisle, blocking his way.</p><br/><p>Because of the system, Jiang Yang was forced to do things that he normally wouldn’t do. Even though he understood that Qin Xu played no part in this, along with the fact that he irritated him, he couldn’t help but feel anger towards him. Jiang Yang looked down at him for a moment before ignoring him and prepared to step over him.</p><br/><p>For some reason Qin Xu continued to act up. This time he reached his arm out and stretched it out before his waist blocking him both at the top and bottom. The only way Jiang Yang could get through was if he had a little running start allowing him to gain enough momentum to jump over or if he squeezed through the gap between his arm and leg. Naturally, he wouldn’t do such things.</p><br/><p>Qin Xu’s eyes were ice cold. Ever since he saw Jiang Yang stopping Xu Ting Ting at the door, his mood had instantly gone sour. Jiang Yang with that temper, he actually took the initiate to help a female classmate? There was definitely something suspicious about it. Qin Xu also suspected that maybe Jiang Yang was interested in that girl but the moment he thought of this he couldn’t help but feel grouchy. After getting in his way all those times, he’s now having a change of heart?</p><br/><p>Xie Zhe saw the two once again about to start a fight and instantly felt his heart accelerate with excitement while at the same time wondering —- Why is Xu brother so irritated? Isn’t it good if Jiang Yang likes Xu Ting Ting? It’s one less competitor.</p><br/><p>Just at this moment, the crisp sound of the school bell rang indicating the end of the break and the teacher in charge of the next class walked in. At the students he shouted: “Okay it’s time for class. Everyone hurry and return back to your seats.”</p><br/><p>Jiang Yang pursed his lips and threw the remaining workbooks onto Qin Xu’s desk. “Since you care so much about it I’ll give you the opportunity to be helpful. You can go distribute the rest of these.”</p><div><div></div></div><br/><p>After that, he smacked away the hand blocking his path and stepped over his legs before smoothly heading back to his seat. Anyway, his task was to get Qin Xu’s book for him and he had already completed the task so it was fine for him to dump the rest onto that guy. It’s no longer any of his business.</p><br/><p>Qin Xu whose hand was suddenly smacked away was not angry. Instead he looked at pile of books on his table a little dazed. That guy, he actually did half the job and just dumped the rest onto him?! He offered to do it himself but he only did half of it? What sincerity is that!</p><br/><p>Seeing the dazed Qin Xu looking slightly pissed, Xie Zhe suppressed his laughter and said: “I think Jiang Yang probably doesn’t like Xu Ting Ting and only thought that the books were heavy and wanted to lend a hand.”</p><br/><p>Qin Xu returned to his senses and scoffed coldly: “None of my business!”</p><br/><p>He then rudely pushed the remaining books over to Xie Zhe’z side and laid back down onto his table preparing to go back to sleep.</p><br/><p>Xie Zhe shrugged while silently cursing at him. I was just kindly telling you my observations since you’re so concerned about it. What a bad temper.</p><br/><p>Jiang Yang rarely took the initiative to help girls out but it wasn’t because he was cold and indifferent. It was because in the past his good intentions had caused endless gossip about how he is interested in a certain girl, or about how he stole someone else’s love interest before the other party even had the chance to take action…..Gradually he learnt to ignore it and preferred getting a boy nearby to go and help. Sometimes he would accidentally point out the right person and end up helping a couple get together.</p><br/><p>Of course, Jiang Yang also had moments where he’s not afraid of generating misunderstandings and would instead take the initiative. Naturally, it would be when he is with Wu Tong.</p><br/><p>Walking down the corridor, he saw Wu Tong carrying a heavy stack of workbooks. Without a word he walked over and grabbed onto the workbooks while forcefully speaking as if he would not accept a refusal: “I’ll help.”</p><br/><p>Despite saying it forcefully, it was also another form of gentleness.</p><br/><p>Wu Tong, whose hand suddenly became free, was surprised. She looked up at Jiang Yang and smiled, “Thank you but I can do it myself.”</p><br/><p>Jiang Yang shook his head. “I want to help you. Are you taking it to the classroom?”</p><br/><p>Wu Tong nodded. The corner of her lips curved up faintly forming a gorgeous smile.</p><br/><p>The pair walked side by side and just as they were about to go up the stairs Wu Tong suddenly exclaimed: “Is that Qin Xu?”</p><br/><p>Halfway up the stairs at the point where the handrail turned a tall figure heard his name called out and stopped to look back down only to see Jiang Yang and Wu Tong standing together. Seeing this, Qin Xu changed his original plan to return back to the classroom and didn’t hesitate to head back down the stairs towards the two before stopping two steps above them.</p><br/><p>Among the three, Qin Xu was originally the tallest and, with him standing two steps above them, he had even more of a presence. Looking down at them from above, he could see the whorls at the top of their heads.</p><br/><p>Seeing him come down the stairs, Jiang Yang instantly became more vigilant. Now that he is being looked down on, he felt even more irritated inside and felt that his presence was halved as a result of their positioning. He stepped up three steps and instantly became taller than Qin Xu before asking coldly: “Why did you come down?”</p><br/><p><strong>The author has something to say:</strong></p><br/><p>Wu Tong: Aiya, I’m so happy. Once again I can see these two cuties~</p><br/><p>The black-bellied crossdressing man is the true master in this story. He knows all, sees all and is the main wingman for this couple.</p><br/>\n</div>"}