{"title": "Chapter 9 - Desk Partner", "id": 9, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-9-desk-partner", "volume_title": "Volume 1", "body": "<h1>Chapter 9 - Desk Partner</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 9: Desk Partner</strong></p><br/><p>Unfortunately, the worst student at English in this group happened to be Huang Shao who was fifth in line. At this moment he is very busy calculating which question would be his and quickly turning around to other classmates asking them what they wrote and why they chose it.</p><br/><p>After finally obtaining the answer, the third student wasn’t able to provide an adequate answer and the teacher said: “Next student, answer the same question.”</p><br/><p>Huang Shao: “………..”</p><br/><p>Once again he searched around frantically for the answer to the fourth question.</p><br/><p>Once it was his turn, the teacher looked over and smiled: “Dear, after working so hard did you manage to get the correct answer?”</p><br/><p>Huang Shao stood up bitterly. He couldn’t straighten his back and with eyes filled with sadness he looked up at the podium while internally cursing out the teacher – A devil. Such a devil.</p><br/><p>“Teacher, I don’t know….”</p><br/><p>The English teacher: “Please speak English.” <em>(KKnotes: Spoken in English.)</em></p><br/><p>Huang Shao: “….. Sorry, I don’t know.” <em>(KKnotes: As above.)</em></p><br/><p>His face was bitter and his face had wrinkled up into a big meat bun. The other students couldn’t help but snicker at his misfortune. Even his desk partner Jiang Yang sprawled across the table secretly laughing at him. Huang Shao glared at him but this only made him laugh harder.</p><br/><p>Unfortunately, less than two seconds later he couldn’t laugh anymore.</p><br/><p>System: “Random task: Please become Qin Xu’s desk partner. Time limit is one day. If you fail there will be a punishment. Punishment: While the national flag is raised on Monday, before all the teachers and students of the school, shout out —- Qin Xu, I want to be your friend.”</p><br/><p>Jiang Yang: “…..Fuck!”</p><br/><p>He couldn’t help but swear out loud. He wanted to beat up the system; beat it up until even the original manufacturer would not be willing to accept it back.</p><br/><p>This punishment is too extreme.</p><br/><p>Jiang Yang was too agitated by the news and didn’t control the volume of his voice well. The teacher at the podium heard his words and slowly looked over to him: “Jiang Yang, stand up.”</p><br/><p>With a dark expression, Jiang Yang slowly stood up.</p><br/><p>“As I have said before, I want you to use English as much as you can when you’re in my class. So Jiang Yang, can you express what you have just said in English?”</p><br/><p>Jiang Yang: “……….” His expression had gradually become one similar to those of Huang Shao’s.</p><br/><p>Under the ardent encouragement from the English teacher, Jiang Yang very reluctantly responded: “…..Shit.” <em>(KKnotes: Spoken in English.)</em></p><br/><p>“Almost, but to be more accurate it could be <em>holy shit </em>or <em>bloody hell</em>. I’m sure you all have watched plenty of British and American shows so you can pay attention to how they say it. I know most of the boys here are in the science stream and many don’t like to learn English so I won’t talk about how it will be benefit you in the future when you start working but it is very fulfilling when you become able to watch the shows without the need for subtitles and travel overseas without needing a translator. I hope you all study hard. I can assure you that this won’t do you any harm.”</p><div><div></div></div><br/><p>The English teacher said this slowly and only allowed Huang Shao and Jiang Yang sit back down when she was done. She then proceeded on to the next classmate.</p><br/><p>After a stimulating English lesson, Huang Shao finally couldn’t help but grab onto Jiang Yang’s thigh: “Good brothers always go together. Wwuwuwu, I’m so moved—–”</p><br/><p>Jiang Yang slapped his face away, “Get lost. I want to go out.”</p><br/><p>Huang Shao eyes widened in curiosity: “Go where?”</p><br/><p>Jiang Yang was still annoyed with the systems words and said irately, “Going to the school’s office to report to them that you’ve been playing with your phone during class.”</p><br/><p>Huang Shao responded even more enthusiastically. While fake crying and clinging onto him like a koala he wailed miserably: “Don’t. We are brothers that have gone through nine nine eighty one adversaries together. Together, we rise or die. You can’t do this to me, it’s too cruel. My phone is a part of me. Without it, I can’t live anymore wuwuwuwu!”</p><br/><p>Jiang Yang only coldly push his forehead away with his palm, “Nine nine eighty one adversaries? Are you my second brother?”</p><br/><p>Huang Shao suddenly became serious: “What second brother? Of course I am the mighty Tian Peng marshal! So——please don’t report me!”</p><br/><p>Jiang Yang: “………”</p><br/><p>He surrendered to this idiot here.</p><br/><p>He waved his hand weakly and casually said: “Get lost, the head teacher was looking for me. If he asks me why I’m late then I really will report you.”</p><br/><p>Huang Shao quickly released his hold and made a help yourself gesture while smiling: “Elder please go safely~”</p><br/><p>Jiang Yang who finally made it out of the classroom went straight to the office to find the head teacher and ask him about the issue regarding desk partners. He had already thought of a good excuse. He and Qin Xu both had subjects that they excelled more at while they also had subjects that they didn’t perform too well in. Coincidentally, they were exact opposites in this matter and this was especially the case for physics and chemistry. Jiang Yang planned to use this excuse to ask the teacher to put them together so that they could help each other with their studies.</p><br/><p>The head teacher listened to his words and thought over it for a while. In his eyes, these two students were pretty smart. It was just that they were too partial to selected subjects. If this wasn’t the case then they would be swimming in smooth waters. The subjects that they were good at, they would be at the top of the grade while they would be on the other end of the scale for the subjects that they weren’t good at.</p><br/><p>He nodded and said, “I have no problems with that. You can go ahead with that if you have both agreed to it.”</p><br/><p>With Jiang Yang coming to the office to discuss the matter, the head teacher naturally took for granted that they had already talked it over beforehand. But in reality, why would Jiang Yang go and do something as embarrassing as going up to Qin Xu asking him to be his desk partner? Rather than this, he would much prefer howling out loud in the middle of the night while standing on the sports field.</p><div><div></div></div><br/><p>Doing something so secretively, Jiang Yang was very nervous and afraid of being found out by Qin Xu.</p><br/><p>He estimated the approximate time Xiao Yuxin would submit the seating plan and pretended to walk up to him naturally. He patted Xiao Yuxin on his shoulder and said: “That seating plan, I want to change it.”</p><br/><p>Xiao Yuxin naturally didn’t suspect anything and gave it to him. He even handed over a mechanical pencil. Jiang Yang received it and calmly erased his name before writing it next to Qin Xu. With this adjustment, Huang Shao would sit next to Xie Zhe and the only problem was whether the teacher would let them sit together.</p><br/><p>After quickly writing the changes down, Jiang Yang carefully returned the seating plan back to its original position and even covered it with a textbook afraid that it would be seen by the others. He then straightened his back and walked away while trying his best to look calm. This was maintained even when he encountered Qin Xu on his way to the bathroom and for once he didn’t scowl at him</p><br/><p>Qin Xu felt that something was off but just passed him by.</p><br/><p>However, Jiang Yang didn’t realise that the seating plan was seen by another person. On his way to the office, Xiao Yuxin just happened to meet the biology class representative Tang Ling Ling who was also heading there to hand in her homework. She inadvertently saw the seating plan and saw Jiang Yang’s name next to Qin Xu’s name. For a moment, she thought she saw wrong.</p><br/><p>Tang Ling Ling and Huang Shao are childhood friends and naturally her relationship with Jiang Yang is pretty good. She obviously knew about the fire and water like relationship between the two but after seeing the seating plan… Did the fire and water make up? Is the world going to come to an end?</p><br/><p>She was shocked and conflicted but in the end, seeing Xiao Wuxin’s calmer than calm expression, she didn’t probe any further. She couldn’t help but feel like she was the one over-reacting to something insignificant so she chose to act as if she didn’t see anything.</p><br/><p>However, with her relationship with Huang Shao and with Huang Shao’s blabbermouth personality, this matter will be exposed one day. Sooner or later, Qin Xu would come to learn about this incident.</p><br/><p><strong>The author has something to say:</strong>Jiang Yang is very angry: You are such a bad bastard!Huang Shao blinked innocently: I am the world’s number one wingman~</p><br/>\n</div>"}