{"title": "Chapter 7 - Giving a Hug", "id": 7, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-7-giving-a-hug", "volume_title": "Volume 1", "body": "<h1>Chapter 7 - Giving a Hug</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 7: Giving a Hug</strong></p><br/><p>Qin Xu looked at him and plastered on his professional smile: “It’s because Wu Tong greeted me. Those workbooks in your arms aren’t our class’s right? What’s with you today going around everywhere helping people carry things? Earlier you even helped Xu Ting Ting distribute books out. Our Jiang Yang really loves to help others~”</p><br/><p>Wu Tong blinked as she watched the two of them confront each other with their eyes blazing with fire. She naturally didn’t miss Jiang Yang’s act of going up a few steps to be taller than the other person and couldn’t help but think that these two are immature and cute. She followed suit and also walked up three steps while cheerily adding, “Jiang Yang classmate really is too kind. Those books in his arms are for my class. He saw me carrying them and came to help out.”</p><br/><p>Qin Xu glanced at the class number written on the books and saw that it really was Wu Tong’s class. He immediately grabbed half of them and pretentiously said: “Then I will help Jiang Yang classmate out too, lest you get too tired.”</p><br/><p>His actions were too fast and Jiang Yang missed the opportunity to dodge and refuse his offer. He could only watch him snatch half of it over while pursing his lips unhappily.</p><br/><p>Then, Qin Xu very naturally walked to Jiang Yang’s side and turned his head and body in Wu Tong’s direction to talk. Every time Jiang Yang wanted to say something, he would cleverly redirect the topic and leave Jiang Yang with nothing to say. Although he was clearly between the two he couldn’t help but feel like he was excess baggage.</p><br/><p>Seeing Qin Xu chatting with Wu Tong very naturally, he internally grumbled —— What are you faking for? If you love talking that much, I’ll switch positions with you.</p><br/><p>Internally he was saying this but of course Jiang Yang would not actually give up his position and let them become even more intimate. Instead he would ‘accidentally’ bump into Qin Xu while walking and even opportunistically grab his arm and pull him back when he stumbles while smiling and saying: “Qin Xu, pay attention when you’re walking. Be careful not to fall.”</p><br/><p>Qin Xu obviously noticed this little scheme of his but from Wu Tong’s perspective it was evidently a blind spot and he couldn’t turn around and complain that it was because Jiang Yang pushed him. He could only fake a bright smile and forcefully pat Jiang Yang’s shoulder, “Thank you my D-E-A-R classmate.”</p><br/><p>The word Dear was deliberately emphasised and the meaning behind it was evident. The eyes that looked in Jiang Yang’s direction was filled with deep…..murderous intentions.</p><br/><p>It was nothing, he was just itching for a fight.</p><br/><p>Jiang Yang also smiled back and used his eyes to communicate back silently — Sounds good. I am happy to join you.</p><br/><p>Wu Tong watched the two sending laser like glares at each other and, as if she didn’t notice anything unusual going on between them, commented brightly, “You do get along really well~”</p><br/><p>Qin Xu held onto the workbooks with one hand and hooked his free arm over Jiang Yang’s shoulders before smiling and saying: “Yes, our relationship is very good.”</p><br/><p>Jiang Yang was in disgust and wanted brush of his arms but he suddenly heard the system speak in his mind: “Random task: Please help Qin Xu carry the workbooks. Time limit is three minutes. If you fail, there will be a punishment.”</p><br/><p>Hearing that the time limit is very short, Jiang Yang didn’t stop to think before suddenly reaching out to snatch away the workbooks in Qin Xu’s arms. Qin Xu had one arm over his shoulders and could easily feel his movements. He very agilely moved away and dodged, unwilling to let him succeed.</p><br/><p>“What are you doing so suddenly?”</p><br/><p>Jiang Yang was not in the mood to confront him. He only wanted the workbooks in his hands. He couldn’t help but have a bad feeling. The punishments mentioned by the system would definitely not be something that he would be happy to accept.</p><br/><p>“Give me the workbooks. You can go back to the classroom.”</p><br/><p>Qin Xu shook his head and said sincerely: “How can I do that? If I help someone, I want to help them until the end. I must deliver these things straight to Wu Tong’s class.”</p><br/><p>“It’s just a few books there’s no need for two people. Give it to me.” Jiang Yang held the books in his arms with one hand and held out the other hand showing his palm.</p><div><div></div></div><br/><p>Qin Xu stuck out his tongue and placed his hand onto it. “Here you go.”</p><br/><p>Jiang Yang: “………” Annoyed, he threw off his hand.</p><br/><p>After saying all those things, Qin Xu still would not cooperate and Jiang Yang couldn’t be bothered continuing talking nonsense with him and just proceeded to make a grab for it. Qin Xu was confused. While happily dodging his attacks, he laughed while provoking: “Why are you so anxious so suddenly? Are there unmentionable secrets in these books?”</p><br/><p>Regarding their fighting abilities, Jiang Yang and Qin Xu could be said to be quite comparable. However Qin Xu is good at harassing others and messing with the others’ emotions while Jiang Yang had a bad temper and can be easily angered. Every time they fought in the past he would always lose because of this and curse at the other party for being underhanded.</p><br/><p>Three minutes passed by very quickly. Qin Xu dodged while walking speedily towards the classroom and in an instant they had reached class 3. He casually walked in, placed the books onto the podium and patted the surface of the books while looking back at Jiang Yang with a smile: “Now that we’ve reached the destination, do you still want to continue?”</p><br/><p>Jiang Yang’s face went dark and begrudgingly dropped off the other half of the books onto the pile of books with the intent to crush his hands under it. Unfortunately Qin Xu’s reflexes were fast and he did not succeed.</p><br/><p>Wu Tong followed them from behind and walked into the classroom slowly. Internally she laughed: These two, are they really pursing me? They even forgot about me and left me behind while playing around happily together.”</p><br/><p>Although she was thinking this, her thoughts were not exposed on the surface. She only smiled softly and thanked them</p><br/><p>Jiang Yang was in a bad mood and Qin Xu who saw this felt elated. He walked beside him and talked non-stop. It was very unlike his usual cold demeanour and he was practically acting like a unruly child that was asking for a beating.</p><br/><p>Jiang Yang obviously wanted to kill him but he was more concerned about the so-called punishment.</p><br/><p>System: “Task failed. Considering that it is your first time, the punishment will not be too severe, don’t worry. Now announcing the punishment: Stare out the window at the end of the corridor with Qin Xu for five minutes. Eyes must be relaxed and gaze must be held. No movement is allowed during this period. If this fails, it will be extended into one hour.”</p><br/><p>At the next second, Jiang Yang noticed that he could no longer control his body. His body suddenly started to act on its own and it felt very strange. He could only watch himself grab Qin Xu’s hand, drag him to the end of the corridor and turn to look out the window before stopping and hearing another mechanical sound appear in his mind: “The punishment starts now. Counting down from five minutes.”</p><br/><p>Not only was Jiang Yang confused, Qin Xu was also dumbfounded. A second ago he was playfully joking around with him and a second later Jiang Yang suddenly changed his attitude before grabbing him by his wrist and pulling him over to one side. On the way he couldn’t help but have a ridiculous thought —– Fuck, did I anger him to the point that he wants to kill me off now?!</p><br/><p>Clearly, Xin Qu had watched too many TV dramas and for a moment his imagination went wild.</p><br/><p>Only when he found himself standing at the window looking out at the blue sky, white clouds and greenery outside did Qin Xu return to his senses and realise that he didn’t intend to fight him.</p><br/><p>He looked down and glanced at his wrist that was still being held onto. He raised it up and shook it, “Jiang Yang, what on earth are you doing?”</p><br/><p>In an instant, as if he was shocked by electricity, Jiang Yang retracted his hand way with a strange expression on his face.</p><br/><p>Qin Xu who saw his ugly, constipated-like expression asked again: “What are you doing?”</p><br/><p>Jiang Yang moved his lips wordlessly. To be honest, he had imagined a lot of possibilities as to what the punishment could be. Things like extreme pain, temporary blindness, deafness etc he had considered. However once he received the actual punishment, he had this inexplicable feeling. It couldn’t be said that the punishment wasn’t good or bad but, rather, it managed to just step on the edge of Jiang Yang’s bottom line.</p><br/><p>For a moment, Jiang Yang couldn’t think of a good excuse. He could only drily say: “Look into the distance. It’s good for the eyes.”</p><div><div></div></div><br/><p>“….Ha?” Qin Xu was even more dumbfounded and temporarily suspected he had heard wrong. Incredulously he asked, “What did you say? Say it again?”</p><br/><p>Those dark round eyes that had widened with amazement stared at him making Jiang Yang feel uncomfortable. He also realised that this situation was hard to explain but that was what the punishment asked for. What could he do about it?! He also feels very wronged to the point that he wants to punch something okay?!</p><br/><p>Earlier he looked as if he wanted to destroy me but now he is telling me to look into the distance to protect my vision?</p><br/><p>Qin Xu’s mouth twitched. Written on his face were the words ——– Brother, are you okay? Do you need me to get you your medicine?</p><br/><p>He decided that Jiang Yang had probably momentarily become stupid and couldn’t be bothered accompanying him in acting crazy. He lazily waved his hand and said: “You can stay here looking out. I’ll head back first.”</p><br/><p>Seeing Qin Xu about to leave, Jiang Yang became anxious and subconsciously wanted to turn and grab onto him. However at this moment he noticed that both his feet were stuck in place and could not be moved no matter how much force he applied to them. He reached out and grabbed onto Qin Xu’s shirt but because he had leaned forward too much he instantly lost his balance. If it was him on a usual day then he could’ve easily regained balance by taking a step forward but his two feet were locked in place and he could only watch himself fall forwards.</p><br/><p>Qin Xu who was grabbed onto turned around only to see a figure falling onto him. He subconsciously reached out and held onto the person in his arms.</p><br/><p>This strange posture instantly made Jiang Yang’s face darken. From around him he could feel the other person’s body temperature. Even since their relationship took a bad turn this was the first time the two had gotten so close and even in such an intimate position. Jiang Yang couldn’t help but feel strange emotions arise within him. Mixing with his anger he couldn’t help but feel irritated and curse out: “Fuck you!”</p><br/><p>Qin Xu who was forced into half hugging him could only laugh: “I kind-heartedly supported you but you’re cursing me out?”</p><br/><p>Jiang Yang wasn’t actually cursing at him but he also couldn’t explain himself. He could only clumsily press onto Qin Xu’s chest and shoulders to forcefully regain his own balance.</p><br/><p>As the saying goes, when one is unlucky, even while drinking water they would get stuff stuck in their teeth.</p><br/><p>Finally able to stand up straight, Jiang Yang was suddenly pounced onto from behind forcing him to fall back into Qin Xu’s arms. His head slammed into his chest and his nose went red from the collision. He was angered to the point that he was about to explode.</p><br/><p>But Huang Shao didn’t realise this. He cheerily clung unto Jiang Yang’s back and enthusiastically asked: “What are you guys playing? I also want to join! Jiang Yang pressing down onto Qin Xu and I’ll press down onto Jiang Yang. Let’s have a fun threesome~”</p><br/><p>Qin Xu’s corners of his lips twitched. He laughed insincerely, “What a coincidence. Jiang Yang just said that he wanted to fuck me. I think he probably doesn’t want to be pressed down by you. You should ask him?”</p><br/><p>Huang Shao heartlessly laughed while spreading out his arms welcoming him, “I’m fine with both top and bottom, come on baby!”</p><br/><p>This kind of dirty piling game is something boys loved to play. Often, you would find a bunch of them in the corridor with one pushing another down onto the floor and even purposely making moaning noises. Afterwards they would laugh it off and proceed onto other dirty games.</p><br/><p><strong>The author has something to say:</strong></p><br/><p>Wu Tong: You say that you’re pursuing me but why am I getting forced fed dog food everyday? 🙂</p><br/>\n</div>"}