{"title": "Chapter 15 - Shower", "id": 15, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-15-shower", "volume_title": "Volume 1", "body": "<h1>Chapter 15 - Shower</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 15: Shower</strong></p><br/><p>No one knew that there have be some earth-shattering changes occurring in Qin Xu’s mind.</p><br/><p>For the past few days, he had been trying to understand what Jiang Yang’s strange behaviours meant and whether it had a hidden meaning. He obviously wouldn’t accept the idea of Jiang Yang doing those things on a whim and he was certain that he had a reason for it. At the very beginning when he helped cover him with a blanket, he was initially surprised and couldn’t help but think that he wanted to hurt him. Afterwards, he sensed that there was gentle concern in his actions which only confused him even more.</p><br/><p>However, Qin Xu is a very stubborn person. If he couldn’t figure something out, he wouldn’t be able to let it go. The more he thought about it, the more he wanted to understand. In the meantime, he had been acting uninterested while secretly observing Jiang Yang.</p><br/><p>Occasionally, Jiang Yang would feel his gaze and couldn’t help but feel a numb sensation on his scalp. He turned his head around to check and when their eyes met, Qin Xu wouldn’t evade his gaze out of guilt and, instead, continue maintaining his gaze for a few more seconds before looking back down to his textbook or turning to talk to someone else.</p><br/><p>Acting so naturally like that, Jiang Yang also couldn’t say anything about it.</p><br/><p>One day, they returned back to their dormitory after dinner and prepared to take a shower.</p><br/><p>Jiang Yang bent down to change his shoes and when he stood back up, his butt bumped into something hard and slightly warm. Looking back, he realised that it was Qin Xu who had been standing there without his knowledge. Qin Xu looked down at him with dark eyes.</p><br/><p>He suddenly felt annoyed: “What are you doing?”</p><br/><p>Qin Xu quickly recovered his usual mocking smile and rolled his eyes, “What else can I do? Of course I’m waiting for you to change your shoes. With you here, you’re completely blocking the way.”</p><br/><p>Jiang Yang heard the familiar rude tone in his voice and internally felt a little relieved. Earlier he had inadvertently moved backwards and slammed into him, closing their distance drastically. Although it was only for a very short period of time, he could clearly feel the body heat. His butt also happened to collide with the root of Qin Xu’s thigh earlier and an inexplicable sense of danger led him to subconsciously move away in an instant.</p><br/><p>After readjusting his mood, his expression returned to his usual cold look. He proceeded to ignore Qin Xu, grab his clothes from his wardrobe and go to take a shower.</p><br/><p>Coming back out about ten minutes later, Jiang Yang hung a towel around his neck while casually drying his hair with one hand. He sat down onto Xiao Yuxin’s bed and pulled his phone out to check the time.</p><br/><p>When he looked up, he naturally saw Qin Xu who sat opposite him with his two legs raised while playing a game looking very handsome. After just glancing at him, the other party keenly sensed his gaze and looked back at him. The moment their gazes met, he froze for a second before continuing playing on his phone as if nothing had happened.</p><br/><p>Jiang Yang also retracted his gaze. He pondered over whether or not he should remind Qin Xu to go take a shower. It was just a casual sentence and was usually said when one finishes showered to urge the next one to hurry. There wasn’t much time between classes; only one hour, and if they don’t hurry it is easy to be late.</p><br/><p>But whenever it was Jiang Yang or Qin Xu’s turn to remind the other, they act very awkwardly. They preferred not saying a word and just leaving it up to the other to go whenever then wanted to.</p><br/><p>Usually when this happens, the other roommates would remind the other person or they would notice themselves and take the initiative to go shower.</p><br/><p>Jiang Yang hesitated for a second but eventually decided to keep quiet. He just focussed on drying his own hair.</p><br/><p>Qin Xu continued playing his game and didn’t seem like someone who was preparing to leave.</p><br/><p>Finally, Huang Shao who was surfing through funny videos laughed while looking in the direction of the bathroom. Seeing that it was vacant, he said: “Xu brother, aren’t you going to wash up? You’ll be late if you don’t.”</p><div><div></div></div><br/><p>Qin Xu hummed in response, played for a little longer before throwing his phone down and entering the bathroom with his clothes.</p><br/><p>The moment he entered, there was still mist in the air and he could smell the faint scent of grapefruit in the air. His lips curled while he said in a small voice: “It’s still this smell. You really don’t change.”</p><br/><p>After ridiculing Jiang Yang’s taste, he took off his clothes and stood under the shower. Small streams of water fell onto his body and washed away the stickiness and dirt that he had accumulated during the day. With the heat enveloping him, he gradually became more refreshed and comfortable.</p><br/><p>Only when he was completely refreshed and covered in water droplets did he wipe away the water from his face and turned off the faucet. He stretched out to grab his towel only to find himself empty handed.</p><br/><p>He had actually forgotten his towel!</p><br/><p>Qin Xu frowned. He looked at the dirty clothes in the basket covered in sweat and then at the clean school uniform that sat on the shelf. He then turned to the door and shouted: “Is someone there? Help me get a towel!”</p><br/><p>In the dormitory room, Jiang Yang who was playing on his phone heard his voice. Looking up, he wanted to get someone else to go but he suddenly remembered that he was the only one in the room. Xiao Yuxin had already left earlier to study and Huang Shao had gone to the canteen. Now, apart from him, there was no one else.</p><br/><p>Should he pretend that he didn’t hear anything and just slip out?</p><br/><p>Jiang Yang frowned.</p><br/><p>Qin Xu in the bathroom continued to shout, “Anyone there? It’s the one with the blue stripes.”</p><br/><p>Probably because he had shouted twice and had received no response, Qin Xu thought that there was no one outside. He said to himself: “Forget it. I’ll just go and get it.”</p><br/><p>At this moment, alarm bells went off in Jiang Yang’s mind. What does he mean that he would just go and get it? Does he not plan on wearing even his underwear?</p><br/><p>Just imagining this made Jiang Yang feel like he was about to go blind. He immediately stood up and headed to the balcony while shouting, “Wait!”</p><br/><p>He grabbed the blue towel and knocked hard on the door but he didn’t expect that Qin Xu had already opened the door. With his hard knock, it pushed the door wide open.</p><br/><p>The two people standing inside and outside the door froze.</p><br/><p>Jiang Yang: Fuck!</p><br/><p>Qin Xu: Fuck!</p><br/><p>Both their reactions were unsurprisingly in sync.</p><br/><p>Jiang Yang handed the towel over while quickly looking away. His expression was stiff and he didn’t dare look straight ahead.</p><br/><p>On the other hand, Qin Xu who was initially surprised saw his reaction and quickly calmed back down. Returning to his senses, his mouth curved up into a smirk. He didn’t directly receive the towel and, instead, he grabbed Jiang Yang’s arm and pulled him inside. He wanted to see more of his surprised, confused or angry expression.</p><br/><p>Unfortunately, things didn’t go as planned and an accident occurred.</p><br/><p>Jiang Yang didn’t expect that Qin Xu would be so bold and old-fashioned. Without a warning, he was pulled into the bathroom where there were still water and soap remnants on the floor. The moment Jiang Yang stepped in, his feet slipped causing him to lose balance and fall backwards onto the floor.</p><br/><p>If it was just that then it was bad enough but that guy, Qin Xu, was also pulled down by him and had fallen onto of him. The vision before Jiang Yang suddenly became dark and his teeth painfully collided with something. His back also felt a burst of pain from the fall. In an instant, he exploded: “What the hell are you doing?!”</p><br/><p>Qin Xu obviously didn’t expect this to happen. With a look of confusion he found himself pressed onto Jiang Yang’s body with his chin cut open from the earlier impact. In pain, he couldn’t help but complain: “Fuck, what is this! Hurts like hell!”</p><br/><p>Jiang Yang saw his bleeding chin but didn’t feel an ounce of sympathy. He sneered, “Serves you right.”</p><br/><p>They didn’t realise that Xiao Yuxin who had left earlier to study had returned at this moment to get a textbook that he had forgotten. Hearing noises coming from the bathroom, he hesitantly came over to check only to see the two people lying on top of each other. Qin Xu was completely naked and he had pressed down both of Jiang Yang’s hands above his head.</p><div><div></div></div><br/><p>This kind of ambiguous scene – No matter how you looked at it it was very easy to cause a misunderstanding.</p><br/><p>Xiao Yuxin, after quickly recovering his senses, bent down in a panic: “Sorry for interrupting, I didn’t see anything!”</p><br/><p>He then looked at them again while blushing before turning around and fleeing.</p><br/><p>Jiang Yang and Qin Xu looked up and only saw his final look of understanding. They were both confused, what do you understand?</p><br/><p>Without needing to think too hard, it was clearly not something good.</p><br/><p>Jiang Yang’s face darkened even more. He wanted to push Qin Xu away but because he was still naked, he didn’t know where to place his hands. He gritted his teeth and instead used his knee to knee him in his lower abdomen while angrily complaining: “Aren’t you going to move?”</p><br/><p>Qin Xu looked down at his angry expression and suddenly felt his mood improve. He even felt the need to make fun of the other party: “You better be careful. If you end up hitting that place then I’ll have to leave the job of creating offspring to you.”</p><br/><p>Jiang Yang smirked: “Okay. Then I will beat you up until you can no longer move and I’ll pay for your medical expenses.”</p><br/><p>Qin Xu could see the sincerity in his eyes and understood that he shouldn’t provoke him anymore. He tilted his head down laughing while pressing down on Jiang Yang’s shoulder saying: “Calm down, calm down. I’ll get up now.”</p><br/><p>“Move your hand.” Jiang Yang frowned.</p><br/><p>Qin Xu shrugged while saying innocently: “I also can’t help it. I’ll need to borrow you as support otherwise I would slip and fall again.”</p><br/><p>As he said this, as if he was demonstrating it to Jiang Yang, his hand slipped and he once again fell onto Jiang Yang and their chest came into close contact.</p><br/><p>Qin Xu looked at him with a ‘See?” look and this only made the veins on Jiang Yang’s forehead throb even more. He had almost reached the limit of his endurance. After Qin Xu managed to get up, he rubbed his hand over his chin while sucking in air with his mouth and complained of the pain.</p><br/><p>Jiang Yang also got up and ignored him. He looked at the shelf on the side and asked impatiently: “Which clothes are clean?”</p><br/><p>Qin Xu was confused. He didn’t understand why he asked this and only pointed with his chin.</p><br/><p>The next second, he watched Jiang Yang take off his school uniform and change into the clean ones on the shelf. From the beginning until the end, Jiang Yang didn’t even spare him a glance.</p><br/><p>Qin Xu complained: “If you wear mine, then what will I wear?”</p><br/><p>Jiang Yang ruthlessly pursed his lips and responded coldy, “None of my business.”</p><br/><p>He then threw his clothes into Qin Xu’s basket and commented faintly: “I kind-heartedly helped you bring your towel but you made my clothes wet. Shouldn’t you be responsible for washing it?”</p><br/><p>“……..”</p><br/><p>Qin Xu remembered what had just happened and only rubbed his nose with a slightly guilty conscience. It was true that he was in the wrong.</p><br/><p>Jiang Yang saw that he didn’t say anything and took it as silent affirmation. He turned and walked away and paid no attention to the person standing there pitifully while naked.</p><br/><p>Finally, Qin Xu walked out wearing a pair of underpants. He reached his wardrobe and pulled out a casual set of clothes. Outside, the faint sound of the bell signalling the start of class rang. He slowly grabbed his phone and set off. On the way to class he thought — Jiang Yang’s body is actually pretty nice. He even has a four pack.</p><br/><p><strong>The author has something to say:</strong></p><br/><p>Jiang Yang (Disgruntled): Blind as a bat!</p><br/><p>Qin Xu (Holding his towel): Are you sure? Should I take another look? 🙂</p><br/><p>Jiang Yang: ……Stop!</p><br/>\n</div>"}