{"title": "Chapter 35 - Dumbfounded", "id": 35, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-35-dumbfounded", "volume_title": "Volume 1", "body": "<h1>Chapter 35 - Dumbfounded</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 35: Dumbfounded</strong></p><br/><p>As the atmosphere continued to remain stagnant around them, someone’s phone started ringing and a low, sexy foreign mans’ voice sang out.</p><br/><p>Wu Tong calmly pulled out his phone and, after checking the caller ID, his eyebrows smoothened out. Clearly, his mood had improved significantly. He spoke on the phone in a gentle and patient tone, completely different from the tone he used earlier to threaten Jiang Yang and Qin Xu.</p><br/><p>It was only a short conversation, but the onlookers could clearly sense how special the person on the other end must be for Wu Tong. A hint of a smile was evident in his eyes and it was as if there were pink heart bubbles floating around him as he spoke on the phone. It was clearly a scene of someone who is deeply in love.</p><br/><p>Oh, it’s so cheesy.</p><br/><p>The three people including Xu Jun looked on with disgust. At the same time they could help but feel a little jealous.</p><br/><p>When the other person hung up, Qin Xu asked, “Is it He Shuo?”</p><br/><p>Wu Tong’s expression immediately sank, and he asked coldly, “How did you know?”</p><br/><p>At this moment, Xu Jun was also surprised. He had known Wu Tong since junior high school and had always been annoyed that this brother of his loved to cross-dress and had been doing his best to try and correct his habit almost every day. He had only recently found out that he liked a junior brother called He Shuo so how did these two, who only knew him in high school and are not even in the same class, know?</p><br/><p>Qin Xu could tell that Wu Tong’s expression wasn’t too good and knew that he didn’t want others to know about their relationship. He quickly threw the blame onto someone else, “There was a time when Huang Shao saw you and He Shuo getting along well so we assumed that that was the case.</p><br/><p>Actually, he and Jiang Yang had accidently seen them together and even followed after them for a while. He Shuo was that tall and strong looking man that was with Wu Tong that other day. After asking around, he found out that he was in the sports strand and is in his first year of high school.</p><br/><p>The innocent Huang Shao ended up getting the blame and Jiang Yang once again witnessed how shameless Qin Xu can get. He looked at him with a conflicted expression while Qin Xu looked back at him and indicated with his eyes to cooperate with his lie.</p><br/><p>Jiang Yang maintained a straight face and kept quiet. He decided that he would join in with this shameless scheme and didn’t feel bad for it either. In fact, he and Huang Shao have often pushed the blame onto each other and they had long become accustomed to it.</p><br/><p>In the end, Wu Tong believed in their lies and patted their shoulders before leaving: “Remember what I said. Don’t say a word to the others. I’ll have to trouble you guys, thanks.”</p><br/><p>Despite saying this very politely, the two couldn’t help but feel threatened. The long, meaningful stare at the end made the hairs on their back stand.</p><br/><p>Jiang Yang and Qin Xu looked at each other and suddenly felt anxious. However, there wasn’t anything that they could do, so they could only let it go.</p><br/><p>After splitting up, Jiang Yang and Qin Xu continued heading to their original destination but this time with a hint of embarrassment. After all, their three views were just shattered, and they still needed some time to recover and slowly reassemble the broken pieces. To put it simply, they just needed some time to reassure themselves that it was no big deal and very normal. Wu Tong is still Wu Tong. Isn’t it just an extra body part and a goddess turning into a fellow brother?</p><br/><p>That’s right, it’s nothing much.</p><br/><p>Like this, they rearranged their three views and their expressions gradually restored back to their usual calmness. But very quickly, perhaps because they had just witnessed something like that, they had become more sensitive to these things.</p><br/><p>As they crossed the road, there was a young couple walking ahead of them. They looked like students and they were holding hands very intimately. The girl is delicate and cute while the boy has a handsome short cut and is dressed in a hip-hop style. Just based on their appearance they looked well-matched…. Until, they heard the “boy” speak.</p><br/><p>That soft and sweet sound, a girl?!</p><br/><p>They were so shocked that they couldn’t help but stare. Before their hearts could recover from this shock, their hearts were once again delivered a strong blow.</p><br/><p>Not long later, they saw another person leaning against the railing on the side of the road holding an ice cream.</p><br/><p>Chestnut coloured short hair with curls at the end, a pale and delicate side profile, a long pink oversized t-shirt that made the body look even more petite and a pair of shorts underneath revealing a pair of slim and pale legs.</p><br/><p>No matter how you look at it, it should be a lovely and cute little sister right?</p><br/><p>But as they got closer and looked more carefully; your mum that’s actually a boy!</p><br/><p>What is wrong with this world!</p><br/><p>Jiang Yang and Qin Xu’s maintained a calm and stiff expression while they continued yelling out inside. It was as if there was a squealing groundhog inside them.</p><br/><p>After being stimulated again and again, Jiang Yang and Qin Xu had unknowingly returned back to their original bodies. They had lunch at a restaurant downstairs and then headed back home side by side.</p><br/><p>Qin Xu suddenly reached out to Jiang Yang and made a gesture to attack Jiang Yang’s chest. He placed it on top and for some reason he even groped it a few times. Jiang Yang who reacted a second later instantly responded with his fist.</p><br/><p>Qin Xu however was relieved: “Fortunately you aren’t a girl. Otherwise you would have gotten the short end of the stick and I would have to take responsibility.”</p><br/><p>It wasn’t like Qin Xu had not watched TV dramas with the soul exchange theme but, unsurprisingly, they were all romance dramas. The male and female protagonist would end up in funny situations as a result of the soul exchange and in the process slowly fall in love with each other. But this damned friendship system actually used this trick for two men like them. If not for his knowledge of Jiang Yang’s temperament, let alone becoming friends, they would have probably just cut off all relations. This damned system really isn’t reliable.</p><br/><p>The three-day body exchange punishment was over, and Qin Xu had returned back to the body he is familiar with. Although he was rejoicing inside, he also inexplicably felt a little pity. But no more than a few seconds later, this emotion was quickly discarded. It was because Jiang Yang had turned to look at him with a meaningful smile. While cracking his knuckles, he said in a crisp voice: “Good. We should now settle some things between us.”</p><br/><p>Qin Xu took a step back: “…….Calm down.”</p><br/><p>He then turned and ran.</p><br/><p>Jiang Yang quickly followed him from behind.</p><br/><p>An aunty passing by saw this and exclaimed; young people these days have so much energy.</p><br/><p>………..</p><br/><p>Monday came, and the students once again resumed with their usual classes.</p><br/><p>This time, Jiang Yang and Qin Xu returned to class at the same time. Compared to their usual times it was earlier, and this surprised Xie Zhe and the others. Xu brother arriving earlier was one thing but why did these two come in together? Was it just a coincidence? Or is their relationship already so good?</p><br/><p>Ten minutes after morning class started, Huang Shao ran into the back of the classroom while panting for air. Like a monkey, he quickly planted himself into his seat and stuffed his bag under his desk. He then turned around to boast to the others. The director stood at the school gates to catch late students and he had managed to slip in while is he busy reprimanding another student. He ran madly to class and ignored the yells of the director from behind him.</p><br/><p>Hehe how can the director recognise me. I am such a clever boy.</p><br/><p>He sat in his seat smiling proudly and felt more excitement than when he succeeded in eating consecutive pieces of chicken. Who is Director Wang? He is the big evil devil and many students have already fallen in his hands.</p><br/><p>At this moment, Huang Shao’s desk partner spoke up: “Did you forget that we have a monitoring system?”</p><br/><p>In today’s society surveillance cameras are almost everywhere and everything you do would be captured. Getting captured after successfully escaping, Huang Shao didn’t even need to think to know what kind of aftermath he would be faced with. However, Huang Shao had already known about this, so he blended in with the students and even ran madly though the school gates so that the surveillance image would just be a blur. Like this, the director and the teachers would not be able to tell who it is, and they wouldn’t be able to do anything about it.</p><br/><p>But…Huang Shao had completely overlooked something very crucial.</p><br/><p>“Director Wang confiscated your phone last week, so he probably still remembers you. I have also heard that he has a good memory and probably knows the names of almost half the students in the school.</p><br/><p>Huang Shao: “………….” There is no love in this world.jpg.</p><br/><p>As expected, after the morning reading session ended, the class teacher called him out and directed him to the school office. Huang Shao went very reluctantly and was afraid that he would be punished to do something as embarrassing as cleaning the toilets.</p><br/><p>However, what he didn’t expect was that when he entered the school office Director Wang didn’t have the time to deal with him. All his attention was concentration on several other boys as he reprimanded them in a loud voice. Huang Shao only had to write a reflection essay and get a few points deducted before he was allowed to go back to class. Inexplicably, Huang Shao felt a little disappointed? It was not the same as what he had imagined!</p><br/><p>Moreover, curious about what crimes the boys had committed, Huang Shao even tried to listen in but could only tell that one of the boys was a boy he had played basketball against in the past called Xu Jun.</p><br/><p>Unfortunately, despite deliberately doing things slowly to drag the time out, he could only hear a few sentences before he was kicked out by his class teacher.</p><br/><p>When he returned to the classroom, he immediately shared the gossip with his classmates: “Hey hey, I just saw the director scolding some students in the office. Seems like Xu Jun and the others got into a fight outside of school and it’s even over a girl. The director suspects that he is in dating at a young age and is trying to get him to spit out the girls’ name but he wouldn’t speak a word. The director is super pissed and wants to punish him harshly!”</p><br/><p>The other boys joined in excitedly: “What happened? Did the hero rescue the beauty or did he steal a girl? Xu Jun is so amazing. Protecting his girlfriend~”</p><br/><p>Of course, everyone was more concerned about who the female party is.</p><br/><p>Some started speculating: “I heard that Xu Jun and the school idol Wu Tong are pretty close. Could it be her?”</p><br/><p>Damn, if that’s the case then things are even more exciting. The gossip travelled far and wide and eventually it evolved into a cold gang leader protecting his runaway wife. It then became more and more exaggerated. Xu Jun himself didn’t even know that he had the ability to stop knifes with his bare hands? He even carried his woman away in his arms while bleeding from his hands? Is he a Super Saiyan? Shouldn’t he die from the pain?</p><br/><p>Jiang Yang and Qin Xu watched the commotion as a bystander and couldn’t help but have a constipated expression on their faces —- It’s really hard to keep secrets!</p><br/><p><strong>The author has something to say:</strong>Two groundhog’s with Jiang Yang and Qin Xu labelled above them squealed crazily: “It’s all Wu Tong’s fault! Now I have trouble discerning between gendersss!!!!!</p><br/>\n</div>"}