{"title": "Chapter 43 - Date", "id": 43, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-43-date", "volume_title": "Volume 1", "body": "<h1>Chapter 43 - Date</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 43: Date</strong></p><br/><p>For their studies and for their results, Jiang classmate and Qin classmate worked very hard.</p><br/><p>Even on weekends, the two had arranged to go out and have a study session. The location naturally was at the local McDonald’s. If they were hungry they could eat hamburgers or drink coke if they’re thirsty. They even had the cool air conditioning.</p><br/><p>When Jiang Yang explained the question, Qin Xu chewed onto the straw and slowly slipped at it while spinning the pen around in his hand. With a very bored look, he didn’t look like he was paying any attention. Jiang Yang saw this and felt unhappy. He smacked him on his head and said a word of warning: “Pay attention.”</p><br/><p>Qin Xu sprawled over the table and felt like he was going to get sick from studying so much. Exhausted he said: “I don’t want to study anymore. I want to go out and play.”</p><br/><p>Jiang Yang scoffed coldly: “Play your head. Can you do that with your shitty results?”</p><br/><p>Qin Xu rolled his eyes: “Do you think you are qualified to say that? Even if I answer it randomly, I’ll get more of them correct than you.”</p><br/><p>The two seemingly pointed out their middle finger at each other at the same time. They pursed their lips and cursed at each other with a cold and indifferent face: “Fuck you.”</p><br/><p>After they swore at each other, their mood improved significantly and the two tacitly returned to work on the problems. When they were done, they would throw it over to the other person to correct and then they would take turns explaining the question. While they explained they would scold the other party and call them stupid.</p><br/><p>The afternoon passed quickly, and the intense study session was finally over. Under Qin Xu’s strong request to take a break to relax, they left McDonald’s and entered a nearby virtual reality experience hall. They didn’t leave immediately and ended up hanging around for a while.</p><br/><p>Virtual reality technology has been very popular for the past two years. Not only is it used in various fields for greater convenience, it also plays a big role in the entertainment and gaming field. Almost all shopping malls had opened up a place for virtual reality gaming and, to experience it, it only costed a dozen of dollars so it was very popular amongst young people.</p><br/><p>The experience hall in this mall wasn’t big and consisted of just a small area of the mall sectioned off and a few egg-shell shaped seats. The experiencer only needed to sit in those seats and wear a helmet to be able to see the simulated scene and immerse themselves in the environment with all their senses.</p><br/><p>To achieve a good stimulating effect and to maximise enjoyment, the gaming interface is naturally not something calm and boring. Instead, it was games such as a role-playing shooting game against zombies, escaping from a ghost house etc.</p><br/><p>When Jiang Yang and Qin Xu went to play, a young couple happened to be just before them. Not long after the game started, the girl started screaming and waved her hands around as if she was shooing something away. She even accidentally hit her boyfriend in the chest who could only groan out in pain. The girl continued to remain immersed in the game and when she made contact with her boyfriend she thought she could actually touch the ghost and was very surprised: “Fuck, is this for real?!”</p><br/><p>Those who were watching on found this very amusing while her boyfriend had a look that looked like it was saying, “I wasn’t scared of the zombies but was scared to death by you.”</p><br/><p>Jiang Yang and Qin Xu had not played this before and they couldn’t help but laugh: “Is it that scary? Such a scaredy-cat.”</p><br/><p>The two who were clearly scared out of their wits when they had the ghost story telling session laughed at the misfortunes of other people and didn’t feel embarrassed at all. They even acted as if they weren’t terrified of anything as they entered the contraption confidently and wore the helmet.</p><br/><p>From the beginning, there was only darkness and faint glow from the flickering candle. By their ears, eerie background music played and slowly bore into their brains. They couldn’t see much through in their field of view apart from mottled walls and faint blood stains. They could only walk on slowly down the narrow tunnel.</p><br/><p>Without a warning, a pale face with a dark, empty eye sockets and red tears flowing out of it appeared before Qin Xu. It revealed a ghastly smile and it’s bony fingers reached out to grab your legs causing you to have the urge to climb up to escape.</p><br/><p>Qin Xu was surprised, and he subconsciously reached out to grab onto Jiang Yang’s hand. At the same time, he shrank back but, seeing that he could not escape from the ghost, he started kicking at it desperately. It could be said that he has a very strong desire to live.</p><br/><p>Jiang Yang had the helmet on, so he couldn’t see what Qin Xu was doing but, with his hands suddenly grabbed and feeling the movements from next to him, he could make a rough guess. He couldn’t help but laugh and just when he wanted to say a few words to mock him, as if the game had everything timed well, a dark head with black, with glowing red eyes and messy long hair also appeared behind him.</p><br/><p>Jiang Yang: “!!!” Fuck!</p><br/><p>He didn’t know whether or not it was just is imagination, but his shoulders also felt a little itchy, as if there really was hair moving on it!</p><br/><p>Jiang Yang who was scared to the point of almost wetting himself unconsciously grabbed onto Qin Xu’s hand. He gripped onto it tightly, as if it was his only life-saving straw!</p><br/><p>Qin Xu returned to his senses and his lips curved up as he bent his finger and used it to draw a few circles in Jiang Yang’s palm. He huffed: “And you dare laugh at me?”</p><br/><p>Until the end of the game, the two didn’t release their hands. The moment their helmets were removed, Qin Xu noticed that his hands suddenly became empty. He looked up and saw Jiang Yang jumping off the seat. He looked back and his eyes subconsciously swept over to the hand that hung by his side.</p><br/><p>It was about time for them to go back. They walked down the road side by side until they needed to split up.</p><br/><p>Qin Xu: “Can I ask you a question?”</p><br/><p>Jiang Yang looked at his smiling face and felt that it probably wasn’t anything good. Also, remembering that he had just made fun of him earlier, he directly refused: “No.”</p><br/><p>Qin Xu naturally isn’t so obedient. He continued: “Jiang Yang.”</p><br/><p>The set of dark and deep eyes looked firmly at him. Inside, it was as if there were stars sparkling. The corners of his lips lifted, and a gentle smile appeared on his face. He suddenly called out his name seriously, unlike the usual way he called him when he was asking for a fight.</p><br/><p>Jiang Yang looked over at him with some doubts.</p><br/><p>Qin Xu smiled and asked: “How many people know about those things?”</p><br/><p>“What things?”</p><br/><p>“Apart from me, does anyone know that you are afraid of the dark?”</p><br/><p>Jiang Yang frowned and immediately denied: “I am not afraid of the dark!”</p><br/><p>“Ok ok. Night-blindness. Does anyone else know?” Qin Xu quickly changed his words like he was trying to placate a young child.</p><br/><p>Jiang Yang was annoyed: “No.”</p><br/><p>“What about you thinking that you’re too pale and secretly trying to tan yourself?”</p><br/><p>Jiang Yang seriously suspected that he was trying to do something. Those smiling eyes of his made him feel very uncomfortable. He snorted: “You’re annoying!”</p><br/><p>“What about the fact that you like to sing while showering but you can’t seem to sing the right notes?”</p><br/><p>Jiang Yang exploded: “Qin Xu, do you want to die? If you want to fight, just say it!”</p><br/><p>Qin Xu wasn’t afraid at all. Instead, he laughed very happily, “How can that be? I was just asking out of curiosity. Those must all be your secrets.”</p><br/><p>Jiang Yang squinted and said threateningly: “What do you want? Tell others? If you dare, I’ll beat you up to the point that you can no longer walk.”</p><br/><p>Qin Xu however shook his head. He obediently replied: “I won’t say it.”</p><br/><p>Jiang Yang raised his eyebrows in surprise. He loosened his fist and sneered: “That’s good then. I still have those photos of yours in my phone. If you do, I’ll bring you down together.”</p><br/><p>Qin Xu once again became playful. With a meaningful gaze, “Xiao Yang Yang, to think that you love me so much that you want to die together.”</p><br/><p>Jiang Yang was stunned. He then wanted to beat him up: “Fuck you.”</p><br/><p>Qin Xu already expected this and quickly avoided his blow. He had fought a lot with Jiang Yang, so he is already familiar with his routine. He basically could tell where he would throw his next punch or kick at. He dodged very skilfully and even joked: “See, you can’t even bear to hit me.”</p><br/><p>Jiang Yang became agitated and his mind went red. He immediately jumped onto Qin Xu’s back and wrapped his arms around his neck.</p><br/><p>“……What are you doing? Why are you not doing the same as your usual routine……..” Qin Xu was stunned. Feeling the sudden sense of warmth on his back, he temporarily couldn’t speak properly from the surprise.</p><br/><p>To avoid having Qin Xu throw him off, Jiang Yang even hooked his legs around his waist and forcefully strangled his neck. What he didn’t expect was that Qin Xu only paid attention to the heat that travelled over to his waist and had completely ignored the pain at his neck.</p><br/><p>“Try saying it again. Let’s see if I’ll beat you up.” Jiang Yang continued strangling his neck as he threatened with a sneer.”</p><br/><p>Because Jiang Yang had both his arms wrapped around him, their faces were naturally very close. When he spoke, warm breath could be felt on Qin Xu’s ear and he couldn’t help but shiver and feel uncomfortable. He eventually compromised: “Okay, okay. Master, you are the best. I’m about to be strangled to death by you.”</p><br/><p>Jiang Yang was pretty satisfied with this and planned to release his hold and jump off his back. But before he could do this, two hands suddenly appeared on his butt and pushed him up. Like this, Qin Xu walked on with Jiang Yang on his back.</p><br/><p>Jiang Yang was completely stunned. He even forgot to apply strength to his grip, “……What are you doing?”</p><br/><p>Qin Xu smiled: “Did you think that if you could get onto my back so easily, you could get off easily as well? I won’t let you get off.”</p><br/><p>This crazy bastard!</p><br/><p>Jiang Yang cursed at him internally and the two hands holding his butt also rendered his scalp to go numb. He didn’t even consider the idea of strangling back to retaliate and just struggled with all his might to get off.</p><br/><p>Unfortunately, Qin Xu’s hand strength is no weaker than his. When he is determined to hold onto someone, it is not an easy feat to break free. Moreover, this person is also very shameless. Seeing that Jiang Yang is struggling too hard, he even deliberately patted his ass a few times and said: “Stop mucking around.”</p><br/><p>Mucking around? Muck your mum——–</p><br/><p>Jiang Yang had thoroughly exploded. Inside, numerous curses rained down. His back went numb and he could feel his hair stand as his whole body stiffened. With a dark expression, he had the urge to tear Qin Xu into pieces.</p><br/><p>The other person was on his back, but Qin Xu remained unafraid of death. He continued to tease: “Hey I have to say though, it feels quite nice.”</p><br/><p>As he said this, he even squeezed it a few times.</p><br/><p>Jiang Yang: “……….Looking for death!”</p><br/><p>That angry outburst of his sounded like countless bombs going off eventually burning the surroundings down into smithereens.</p><br/><p>After this outburst, Jiang Yang also no longer cared about being civil. Lying on Qin Xu’s back, he started delivering a bunch of blows. Even if Qin Xu released his hold to block his attacks he wouldn’t stop. Jiang Yang’s legs were firmly bond around his waist and wouldn’t release its hold. He decided to first vent out his anger.</p><br/><p>Qin Xu: “……….”</p><br/><p>Since I’m already getting beaten for it, I might as well squeeze it a few more times.</p><br/><p>……..Okay, that only made things worse.</p><br/><p><strong>The author has something to say:</strong>Qin Xu: A true example of pain and happiness coming hand in hand ╮(╯▽╰)╭</p><br/>\n</div>"}