{"title": "Chapter 58 - Milk", "id": 58, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-58-milk", "volume_title": "Volume 1", "body": "<h1>Chapter 58 - Milk</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 58: Milk</strong></p><br/><p>The crisp sound of the school bell rang, and the students made their way out of the classroom to the gymnasium downstairs.</p><br/><p>The stairs were crowded with people as they moved through it and it could be said that they were surrounding from all directions.</p><br/><p>Qin Xu stood behind Jiang Yang and very naturally had his hand placed onto his shoulder. His finger would from time to time touch Jiang Yang’s earlobe and cause him to feel itchy. Later, no longer able to stand the itch, he grabbed onto Qin Xu’s hand to prevent it from moving around.</p><br/><p>Qin Xu was like a child. He lazily swayed his hand around and seemingly found it fun.</p><br/><p>Jiang Yang felt helpless. He pulled at him and looked back at him with a stern gaze, “How old are you?”</p><br/><p>Qin Xu chuckled and didn’t think that his actions were too childish. He even deliberately followed the direction of Jiang Yang’s pulls and leaned forward dramatically so that he stuck himself to Jiang Yang’s back. Both his hands reached out and looped around Jiang Yang’s waist and, acting spoiled, he buried his head in the crook of Jiang Yang’s neck and nuzzled around a few times.</p><br/><p>In the past Jiang Yang would have already thrown him onto the ground with a punch but after interacting with him for the past half year, he had slowly grown accustomed to his clingy gestures. Perhaps it was because the change was so subtle, even Jiang Yang himself didn’t realise how big the change in their interactions was compared to half a year ago.</p><br/><p>When the person in front of him moved, Jiang Yang would follow them and step forward. Qin Xu stood at the top of the stairs, so it would be inconvenient for him to walk if he continued to hold onto Jiang Yang. He could only reluctantly retract his hand. Jiang Yang continued to walk ahead and, no longer feeling movements from the person behind him, he subconsciously looked back only to see the other person being pushed to the back of the crowd. Seeing this, he turned back around and continued to walk along but he subconsciously also slowed down his speed.</p><br/><p>Qin Xu met his gaze and smiled for a moment before agilely bypassing one of the classmates in front of him. He took two steps forward and, in an instant, reached Jiang Yang’s side.</p><br/><p>After their exercise, the students again flooded back into their respective classrooms, to the bathroom, or to fill up water as they got prepared for their next class.</p><br/><p>Qin Xu was in a very good mood. He sprawled over the table while facing Jiang Yang’s direction.</p><br/><p>He had already realised that his feelings towards Jiang Yang was very different. To be more precise, he had noticed it for a while now. He knew that he shouldn’t rush things and confess to Jiang Yang immediately as it is likely to fail, so, after much thought and consideration, he decided to take a somewhat roundabout strategy. He would first let Jiang Yang slowly adapt, like how it is when they slowly level up in game, and when he reaches a certain level and has obtained the necessary skills, the chances of being able to successfully bring down the boss would also be greater.</p><br/><p>Step by step.</p><br/><p>Qin Xu tried to suppress the impulsive and explosive emotions inside him and reminded himself that he needed to take things slowly. However, with the person he likes at his fingertips, it was very difficult for him to resist and remain rational. What should he do when he pretty much always wants to pounce him?</p><br/><p>With something so appetising so close at hand, if you didn’t drool, you’re not human.</p><br/><p>Qin Xu didn’t have the patience and could only lick his lips while reminding himself not to do anything stupid.</p><br/><p>Jiang Yang turned around and saw Qin Xu’s strange yet burning gaze. Seeing this, he felt his back go cold and he had a bad feeling.</p><br/><p>“What the fuck are you looking at?” Jiang Yang glared at him with annoyance while trying to cover up the inexplicable panic inside him.</p><br/><p>“Look at you, handsome.” Qin Xu grinned.</p><br/><p>“………..”</p><br/><p>Jiang Yang rolled his eyes, “Are you crazy?”</p><br/><p>Qin Xu was cursed at, but he wasn’t angry. Instead, he raised his eyebrow and smiled while saying: “Remember the story of Sun Dong Po? You will see what you have in your heart.”</p><br/><p>A Buddha is born by the heart, and there is Buddha in your heart so everything you see is Buddha. If your have cow dung in your heart, everything you see will be cow dung.</p><br/><p>He cursed at someone without swearing and even did it in a way that only those who are a little cultured can understand.</p><br/><p>Jiang Yang would be at a loss no matter what he said so he could only swallow his words back down and just send him a glare.</p><br/><p>Qin Xu’s lips curled up and he continued to stare at the other person.</p><br/><p>It would have been fine if Jiang Yang didn’t know about it but now that he knew that he was staring at him, he felt extremely uncomfortable. It was as if the stare could scan through his whole body and Jiang Yang felt his scalp go numb. Jiang Yang scowled. He decisively pulled out a book and made it stand on the table between them to block Qin Xu’s gaze.</p><br/><p>The vision before Qin Xu’s eyes darkened and he could only see the large words of his most hated subject before him, ‘Chemistry’.</p><br/><p>Sigh.</p><br/><p>Qin Xu again let out a sigh and complained internally. Why is Xiao Yang Yang so easily embarrassed?</p><br/><p>If Jiang Yang could hear those words he would definitely curse out —— Shy your mum!</p><br/><p>He couldn’t control it. He was often provoked into swearing by Qin Xu. If he didn’t swear, he felt like he wasn’t able to fully express his anger. Jiang Yang couldn’t understand how there can be someone who is so annoying in this world. Even his looks had turned into something that he hated.</p><br/><p>What Jiang Yang himself didn’t realise was that those words of his were similar to a certain love phrase. What’s more, since Qin Xu and he himself are so alike if he finds Qin Xu annoying from head to toe, in a sense, wasn’t he also speaking about himself?</p><br/><p>After class, Jiang Yang came back from the school office and saw Qin Xu standing in the corridor while leaning against the railing and casually looking outside. He held onto a carton of milk in one hand while having an expression that looked like was contemplating about life.</p><br/><p>Jiang Yang originally planned to ignore him, but his foot moved on its own and he somehow went over to him. He asked casually: “What are you doing?”</p><br/><p>Qin Xu turned to look at his and his eyebrows curved as a dazzling smile formed on his face, “You’re back.”</p><br/><p>Jiang Yang: “……..” He had almost thought that his heart had skipped a beat.</p><br/><p>Qin Xu went on to say: “I didn’t realise that we have been desk partners for half a year now. Time passed too quickly.” He squinted his eyes and his lips hooked up, “I have to say, it’s all thanks to the system. Otherwise, I wouldn’t have such a great friend like you.”</p><br/><p>Suddenly hearing him say something so serious and even praising him, Jiang Yang felt a little uncomfortable. He touched his neck and as usual replied obstinately, “Yeah. So great that every minute I want to smash that dog head of yours.”</p><br/><p>Qin Xu laughed and didn’t take it to heart, “Dog? To think that you actually see me as such an adoring pet.”</p><br/><p>“You shouldn’t be happy about being treated as a dog.” Jiang Yang rolled his eyes.</p><br/><p>“A lot of foreigners treat cats and dogs as family. They would sleep together and even hug it and kiss it.” As he said this, Qin Xu suddenly stuck to him and held Jiang Yang in his arms. He even shamelessly buried his head in the crook of Jiang Yang’s neck and nuzzled in. His hair tickled Jiang Yang.</p><br/><p>Jiang Yang couldn’t help but laugh from the tickle. He raised his hand and pushed him away, “Are you crazy?”</p><br/><p>Qin Xu however responded seriously: “Pets need to be pampered.”</p><br/><p>Jiang Yang laughed at the ridiculous comment. He then patted his shoulder and turned around: “Crazy. I’m going back to the classroom first.”</p><br/><p>Qin Xu however stepped over and stopped in front of him. He grabbed his wrist and handed over the half-full carton of milk with a smile, “Have a drink.”</p><br/><p>Jiang Yang: “………”</p><br/><p>Qin Xu brought the straw over to his mouth, “Drink.”</p><br/><p>Jiang Yang was confused. With some suspicion he tilted his head, “……..Task?”</p><br/><p>Qin Xu answered very perfunctorily: “Yes yes.”</p><br/><p>Jiang Yang however felt that something wasn’t right. He hesitantly leaned down and gentle took a sip from the straw. The rich taste of milk invaded his mouth.</p><br/><p>He had a drink and Qin Xu then proceeded to very naturally bring it back to his mouth. He took a sip from the straw and was in an extremely good mood. His eyes and eyebrows curved with glee and he even uttered a muffled, “Tastes good.”</p><br/><p>Jiang Yang could feel his scalp go numb and he felt that something wasn’t right. He didn’t realise it earlier when he drank from it but, after thinking about it for a moment, he realised that there was Qin Xu’s saliva on the straw that he drank from and just then Qin Xu drank from it again. Now matter how he thought about it, it was weird, and goose-bumps couldn’t help but form.</p><br/><p>Being able to be so happy after eating someone else’s saliva, did this guy become crazy from the systems torment?</p><br/><p>As the saying goes, when there is one, there will be two. Once you have taken the first step, the steps after that would be much easier to do.</p><br/><p>After class, several boys headed downstairs to the school store to buy food while others were too lazy to move and remained sprawled over their table like salted fish. One waved their hands and said, “Xu brother, get me some oden.”</p><br/><p>Qin Xu didn’t hesitate to refuse. He kicked the table leg, “Get it yourself.”</p><br/><p>Towards others he was extremely cold and ruthless but when he turned to Jiang Yang he was completely different. He even took the initiative to ask: “Do you want me to bring something for you?”</p><br/><p>“Anything is fine.” Jiang Yang’s tastes were similar to his so it was fine if he got the same things.</p><br/><p>Qin Xu nodded immediately.</p><br/><p>The other boys started complaining: “Xu brother, you’re too much. How can you be so biased!”</p><br/><p>Qin Xu didn’t care. He only snorted, “This is my dear desk partner. If I’m not biased towards him, who should I be biased towards? Can you guys even compare?”</p><br/><p>The boys all cried out while exclaiming that they were burned by those words of his.</p><br/><p>Jiang Yang understood that they were just joking around but he couldn’t help but feel a little awkward hearing the teasing. He bent his head down unnaturally and pinched at his earlobe to try and coverup his embarrassment when he suddenly remembered something. He quickly yelled out to Qin Xu who had reached the classroom door: “Also, I need 520 glue.”</p><br/><p>Qin Xu looked back and suddenly revealed a dazzling smile. It was dazzling to the point that it could blind people’s eyes. He smiled happily and responded: 520, I have it.”</p><br/><p>The others who heard this realised something wasn’t right. They snicked while correcting it, “It’s 502 Jiang brother.”</p><br/><p>Only now Jiang Yang realised his mistake. A hint of embarrassment passed through his face as he used a finger to scratch his face and say drily: “……….Anyway, I just need glue. It’s okay if you understand it.”</p><br/><p>Qin Xu smiled meaningfully: “I understand very well. 520. Understood, understood.”</p><br/><p>Jiang Yang: “……….” This guy, is he looking for a fight?</p><br/><p><em>(KKnotes: 520 in Chinese sounds similar to “I love you.” )</em></p><br/><p>The other boys also tacitly smiled. Jeez, we understand, we understand. We weren’t able to respond in time to this wave of dog food and ended up having it shoved into our mouths.</p><br/><p>With so many pairs of eyes looking at him and smirking, Jiang Yang couldn’t help but roll his eyes. In a small voice he cursed: crazy bastard.</p><br/><p>When he returned from the school store, Jiang Yang was still playing on his phone and didn’t notice. Qin Xu walked over and very naturally rubbed the top of his head allowing the soft, dark hair to pass through his fingers. Jiang Yang was too busy to care and only glanced over at him quickly.</p><br/><p>Qin Xu smiled and placed down a bag of meat balls onto his desk.</p><br/><p>After Jiang Yang finished his fame, he placed his phone down and picked up the meatballs. It was still nice and hot, and it was very refreshing to eat. The four meatballs instantly became two. He could feel an intense gaze coming from the side and, no longer able to ignore it, he turned over and asked in his usual annoyed tone: “What do you want?”</p><br/><p>“Nothing.” Qin Xu acted innocent and blinked his eyes purely several times. In fact, he really wasn’t wanting to do anything. He just wanted to stare at Jiang Yang until the other party felt uncomfortable.</p><br/><p>Jiang Yang signed. He stuffed the meatballs over, “Don’t bother me.”</p><br/><p>Is this a bribe?</p><br/><p>Qin Xu happily handed over his half-eaten sausage. It was mildly spicy and savoury and, with it still hot, it tasted very nice.</p><br/><p>What is this? Exchanging foods? It’s too cheesy.</p><br/><p>Jiang Yang shook his head, “Don’t want.”</p><br/><p>Qin Xu, with meatballs in one hand and a sausage in the other, deliberately pouted and acted pitiful. Those dark round eyes of his looked at Jiang Yang with a particularly aggrieved expression, “Do you dislike me?”</p><br/><p>Jiang Yang had a look of cold indifference. After looked at him for a few seconds, he eventually sighed and could only compromise by accepting the half-eaten sausage.</p><br/><p>Forget it, I should just eat it. He even helped me buy the food.</p><br/><p>Jiang Yang had almost forgotten that he actually didn’t like eating food that others had eaten from already.</p><br/>\n</div>"}