{"title": "Chapter 56 - Push Down", "id": 56, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-56-push-down", "volume_title": "Volume 1", "body": "<h1>Chapter 56 - Push Down</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 56: Push Down</strong></p><br/><p>When it comes to Thailand, the first thing most people would think of would be transvestites. It had become such a famous icon that it’s pretty much tied with its name. As they were there, they naturally saw quite a lot of them as well as their majestic performances. At the same time, they couldn’t help but be in awe. Some didn’t really look like men at all and even looked very beautiful.</p><br/><p>But they only appreciated with their eyes. They didn’t have an interest in taking photos together with them</p><br/><p>They didn’t have any interest, but they couldn’t withstand the enthusiasm from the other parties. After all, it was how they earn a living and one photo costed twenty baht.</p><br/><p>Every time they passed places with transvestites, Qin Xu would be more nervous than Jiang Yang. He would do his best to help block him from them and prevent them from touching him. When he saw the other person reaching their hand out, he would immediately pull Jiang Yang away. Like this, it gradually became a reflexive reaction. When they entered a restaurant and saw two gorgeous and seductively dressed transvestites standing in the centre, without even thinking, Qin Xu immediately stepped in front of Jiang Yang.</p><br/><p>The two beautiful sisters were just standing there to greet the guests so when they suddenly see a customer react like that they was stunned for a moment. They then smiled and said in a soft voice: “Sawadika.”</p><br/><p>Qin Xu paused for a moment before also responding.</p><br/><p>What they didn’t know was that they were now misunderstood as a couple. The sisters responsible for greeting the customers naturally wouldn’t try to get tourists to take photos with them but they also would not refuse if tourists request for a photo. For people like Jiang Yang and Qin Xu who appeared wary of them, the sisters naturally understood to maintain their distance and just give them a friendly smile.</p><br/><p>Because of this, Qin Xu felt somewhat embarrassed. However, if this were to happen again he would still do the same thing. The reason was simple; he just didn’t want to see Jiang Yang get too close with all those pretty women. Jiang Yang on the other hand didn’t think this way. Seeing Qin Xu block him from them, he was initially a little suspicious, but it helped him out significantly so he automatically thought that he was just helping as a comrade. It would be just like when someone helps pull another person to the side to avoid an oncoming car.</p><br/><p>After eating, they took a ride to the Grand Palace which is a famous tourist attraction in Bangkok that is made up of large-scale architectural complexes. Before they actually arrived, they could already see a corner of the palace through the car window. After getting off the car, they were able to witness with their own eyes the grandeur of the palace. The green grass across the courtyard, the twisted ancient trees, the tip of the buildings looking as if it could pierce the sky and the golden lustre on the building that glistened in the sun made it look all the more dazzling.</p><br/><p>Visitors could walk between the 28 temples to explore and, because of the required dress code, there were many women around selling colourful skirts. With the extremely local designs, when you tied them around your waist it looked particularly exotic.</p><br/><p>They stopped and moved, and from time to time they took their cameras out to take photos.</p><br/><p>Jiang Yang was completely preoccupied with appreciating the spectacular palace that he was almost always looking up. Qin Xu walked beside him and, in addition to admiring the palace, he would also sometimes sneak glances over to Jiang Yang to look at his expression. Seeing him completely immersed, a smile couldn’t help but form at his lips. Jiang Yang however was too immersed to notice it.</p><br/><p>When they were halfway through, a young girl ran over to them and asked politely in English if they could help her take a photo.</p><br/><p>Seeing the other party’s oriental looking face, Jiang Yang for a moment couldn’t tell which country she was from and just subconsciously used English to respond. He took her phone and helped take a few photos before returning it back. The young girl smiled and gave her thanks, and, after a moment of hesitation, she asked shyly if she could take a photo with him.</p><br/><p>Jiang Yang was surprised and for a moment didn’t know how to respond. Qin Xu who stood to one side heard this and was no longer calm. He deliberately looped his arm around Jiang Yang’s waist and refused her request with a stern ‘No’. He then looked down and said to Jiang Yang in a somewhat resentful voice: “You already have me so why are you taking photos with other girls?”</p><br/><p>Qin Xu looked at Jiang Yang with an aggrieved look and then pretentiously made a generous gesture while sighing: “Forget it. I love you even if you’re like this. Go ahead.”</p><br/><p>All of this was said in Chinese. The girl heard it and was a little surprised. She blurted out: “You guys are also Chinese……My apologies.” As she apologised, her face blushed with embarrassment. Of course, it wasn’t because she was embarrassed that she used English to talk to someone from the same background as her but rather it was because she felt that she had disturbed the pair of lovers.</p><br/><p>Jiang Yang returned to his senses and ruthlessly threw off the mischevious hand that was wrapped around his waist. He pressed onto the temples of his head and waved his hand as he tried to explain to the girl: “It’s not what you think…..Forget it. It’s nothing.”</p><br/><p>He thought about it and felt that it was strange going out of his way to try and explain. Anyway, they were probably not going to see each other again after this so he just pulled Qin Xu along to escape this embarrassing situation.</p><br/><p>The culprit on the other hand didn’t feel an ounce of guilt and didn’t feel that he had done anything wrong. He even smirked and said proudly: “My acting is pretty good isn’t it? I helped you out just then. I know you don’t like taking pictures with strangers.”</p><br/><p>Jiang Yang scoffed and replied with a look of indifference: “What a waste of talent not becoming an actor.”</p><br/><p>“That’s right, I’m an unpolished gem. But even unpolished gemstones will shine. Did you see me ‘bling bling’?”</p><br/><p>“No. The truth had my eyes covered.”</p><br/><p>“Hahaha.”</p><br/><p>Jiang Yang’s expression was cold, but Qin Xu acted as if he had just said an extremely funny joke and laughed brightly with his eyes curved into a crescent moon. He looked like he was in a very good mood. Seeing this, Jiang Yang suspected that he had probably gone stupid from excessive exposure to the sun but when he looked up at the sky, it wasn’t very hot.</p><br/><p>In the end, Jiang Yang just shook his head and was too lazy to pay attention to the idiot next to him. He continued to concentrate on exploring the palace and even did not react when Qin Xu placed his arm around his shoulder.</p><br/><p>After travelling around for seven or eight days, it was almost time for their trip to end. Their return tickets had already been booked since it was cheaper if they booked it early. They proceeded to buy all the souvenirs that they needed and packed their bags. Because mother Jiang prefers to be more practical and didn’t like having useless things lying around at home, Jiang Yang didn’t waste his money on buying things like exotic ornaments. Instead, he bought about a dozen or so bags of dried durian which he himself also liked to eat. As for Qin Xu, he bought things very casually. If he saw something that he had not tried before, he would buy it but luckily, he didn’t buy too much of them and both their suitcases were able to fit it all in.</p><br/><p>On the day that they were due to catch the flight back Qin Xu said: “Since we have to go back, why don’t we record a video as commemoration?”</p><br/><p>Jiang Yang turned his head over and asked subconsciously: “Task?”</p><br/><p>“No.” This time, Qin Xu honestly shook his head. His pair of black and bright eyes fully expressed the expectation inside him.</p><br/><p>Jiang Yang fell silent. Thinking that this meant ‘no’, the light in Qin Xu’s eyes slowly dimmed and he looked very obviously disappointed. He then faintly heard Jiang Yang’s voice: “Okay.”</p><br/><p>Qin Xu couldn’t believe his ears and was extremely happy to hear him agree. He instantly rushed over to hug him and even shamelessly nuzzled up against him like a little kid. His face was then pushed away by Jiang Yang’s hand as Jiang Yang looked on at him in disdain.</p><br/><p>Qin Xu’s handsome face was in his palm and was pressed until his expression was slightly deformed. Even the words that he spoke sounded ambiguous, but he still chuckled with excitement.</p><br/><p>“What to record?”</p><br/><p>Jiang Yang rejected his immature and spoiled clinginess and asked seriously.</p><br/><p>Qin Xu picked up his phone and moved next to him. He showed him a video in one of his apps. Although the characters in the video were always different, they all did the same thing.</p><br/><p>One person would not move and hold their palm up while another person in the distance, no matter whether they’re eating, drinking, watching tv, reading or playing on their phone, they would immediately run over and place their chin into the person’s hand, tilt their head and then smile brightly.</p><br/><p>Some of the videos were of cute, round-eyed babies and some were of tall and handsome boyfriends. Despite doing something so cheesy, it looked quite lovable and adoring.</p><br/><p>Jiang Yang watched the video and thought that it was a little childish. He pursed his lips in disdain, but he didn’t voice out any complaints.</p><br/><p>They agreed and went to a corridor where no one usually passed. Jiang Yang raised the phone and faced it towards himself before slowly lifting up his hand to reveal his palm and looked behind him. From not far behind him, Qin Xu nonchalantly turned around the corner and looked up at Jiang Yang before immediately lifting his lips into a smile and rushing over to him like a rocket. The speed was definitely one that could cause things around him to be blown away.</p><br/><p>Jiang Yang was a little surprised. He didn’t expect him to rush over to him at such a fast speed. It almost looked like he could only see his afterimage. Wasn’t he supposed to just do a little run? Why is he acting like some prehistoric beast? Damn, it’s actually pretty scary. Worried about the impending collision, Jiang Yang quickly started escaping.</p><br/><p>Qin Xu didn’t stop. Seeing him running away, he appeared to be even more excited and he even sped up.</p><br/><p>In the end, the distance between them shorted very rapidly. Jiang Yang had only run a few steps before the crazy Qin Xu had managed to catch up. When his face made contact with Jiang Yang’s palm, he couldn’t control his strength well and ended up pushing Jiang Yang down. The phone that was still recording also tumbled in the air a few times before crashing onto the ground.</p><br/><p>Jiang Yang was in pain. He angrily pushed the other person away and cursed at him. Qin Xu chuckled and continued to shamelessly throw himself up against him. With his other hand, he reached over to grab his phone and pointed it over at them. Qin Xu squeezed Jiang Yang’s shoulder and signalled at him with a wink.</p><br/><p>Jiang Yang secretly rolled his eyes but still reluctantly cooperated.</p><br/><p>The two same-aged, handsome and energetic boys sat cross-legged on the floor leaning onto each other and revealed a bright smile at the phone. They then said loudly with a voice filled with their youthfulness: “2018, we are in Thailand!”</p><br/><p>Before they started taking the video, when Qin Xu suggested saying this sentence Jiang Yang felt very embarrassed and wanted to refuse. But when the two of them said it together, an inexplicable feeling formed inside his chest. What Jiang Yang could say with confidence was that he surprisingly didn’t hate it.</p><br/><p>He turned his head slightly and looked over at Qin Xu’s handsome side profile and couldn’t help but feel as if something had changed.</p><br/><p>A soft sound.</p><br/><p>At the bottom of his heart, little by little, something slowly began to bloom.</p><br/>\n</div>"}