{"title": "Chapter 52", "id": 52, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-52", "volume_title": "Volume 1", "body": "<h1>Chapter 52</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 52</strong></p><br/><p>Qin Xu who was chatting with Xie Zhe on the side looked back and saw Jiang Yang eating snacks with his head lowered. His thick eyelashes were slightly lowered and, for once, he looked very well-behaved. Qin Xu smiled suddenly and started to lean forward until his whole body was almost plastered up against Jiang Yang’s back. His arm reached over Jiang Yang’s shoulder and this made it look like he was holding him in his embrace.</p><br/><p>Jiang Yang felt the warm body heat coming from his back and quickly stiffened up in response. He subconsciously tried to shake him off his back. At the same time, he stood up with a hint of panic in his eyes like he was trying to hide from something.</p><br/><p>Qin Xu no longer had something to lean against and fell forwards over the chair. The other boys saw this and laughed out loud. They ridiculed: “Xu brother was thrown away.”</p><br/><p>The person involved however wasn’t unhappy. Instead, he supported himself back up and watched Jiang Yang with interest while supporting his chin in his hand. It was as if he had just discovered something interesting and Jiang Yang who noticed his blatant gaze felt his scalp go numb. Just as he wanted to curse him out in return, Qin Xu suddenly moved his line of sight away and started to joke around with the boys as if nothing had happened.</p><br/><p>Late night self-study.</p><br/><p>The classroom was very quiet and there were only the scratching sounds of pencils moving and the occasional rustle when pages were turned. At night, the temperature outside had already dropped to ten degrees and the harsh winter wind whistled past outside the windows. In this weather where it was cold to the point that you could almost freeze, it takes courage to do things like going to the bathroom and washing their hands. As for the classroom, it was very warm. With so many people gathered together, it may be a little stuffy, but it was still many times better than outside.</p><br/><p>And so, most of the students stuck to their chairs and didn’t move. With the silence in the classroom and the warm environment, it wasn’t surprising that one would soon start feeling drowsy.</p><br/><p>After finishing his homework, Jiang Yang only reviewed his lessons for a while before his eyelids started to droop. His head nodded several times and his eyes were soon half closed. Not long afterwards, Jiang Yang decided to make himself comfortable. He pushed everything in front of him back and laid on the table to sleep.</p><br/><p>Qin Xu who was originally writing in his workbook slowed down his pace and slightly tilted his head to look over at Jiang Yang. Jiang Yang had both his hands on the table and his head rested on his forearm while his face is buried inside. From this angle, Qin Xu could only see the back of his head and the half-exposed pale neck.</p><br/><p>Qin Xu saw this and inexplicably felt the corners of his lips lift upwards to form a smile.</p><br/><p>Without any hesitation Qin Xu also threw down his pen and pushed his books aside. He gently laid down near the edge of his desk that was closest to Jiang Yang, and rested his head on his arm while facing Jiang Yang’s direction.</p><br/><p>Like this, they were at a very close distance from each other.</p><br/><p>Qin Xu could smell the faint scent of grapefruit coming from Jiang Yang. It was the smell of the bodywash that he often used. Qin Xu stared over at him unblinkingly and, because he was at such a close distance, he could see the fine hairs on the back of Jiang Yang’s neck. With the ends of his hair curling slightly upwards, it contrasted greatly against his pale neck.</p><br/><p>Qin Xu felt his fingers itch and he suddenly had the urge to reach out and pinch it.</p><br/><p>At this moment.</p><br/><p>Jiang Yang who had been sleeping peacefully started to move without any warning. It seemed like his fingers were cold as he pulled at his sleeves and shrank his hands inside. With his eyes still closed, he moved his head to one side to make himself comfortable and it just happened that he had turned to face Qin Xu’s direction.</p><br/><p>Qin Xu: “…….” For a moment he was so nervous he had forgotten to breathe.</p><br/><p>As for Jiang Yang, despite having his eyes closed he could seemingly feel someone’s burning gaze directed at him. He furrowed his brows and opened his eyes with some doubts only to see a face right in front of his nose. If he tilted his head forward, he would easily be able to kiss it.</p><br/><p>Jiang Yang was still in a half-asleep state and, suddenly finding himself in this situation, he was unable to figure out what was going on and could only blink dumbfoundedly.</p><br/><p>When Qin Xu saw Jiang Yang slowly recover his senses, he thought he would get beaten and for a moment he considered whether he should dodge. However, the next second Jiang Yang was the one who moved first. Like he was scared he quickly shrank back to the other end of his desk. Because he had moved so quickly, he almost fell.</p><br/><p>Jiang Yang turned his face to the other side and laid down on his table as if nothing had happened and Qin Xu now could only see the back of his head.</p><br/><p>Qin Xu was a little surprised by this reaction of his and for a moment he couldn’t react. He then saw Jiang Yang’s gradually reddening ears and unexpectedly found it very cute.</p><br/><p>Qin Xu snickered silently and was no longer able to suppress his impulses. He raised his hand and reached for the strand of hair on the back of Jiang Yang’s neck. He rubbed it in between his fingers and even tugged at it a few times.</p><br/><p>With such an obvious action, Jiang Yang couldn’t ignore it. He reached out and ruthlessly swatted away his hand before using his hand to press onto the back of his neck to prevent him from touching it any further.</p><br/><p>Seeing that the hair he had been playing with was blocked, Qin Xu was tempted to continue reaching for it. He used his fingers to gently tickle the back of Jiang Yang’s hand and, because he did it very lightly, it felt like the touch of a feature and Jiang Yang couldn’t help but feel ticklish. With irritation, he shrank forward to try and avoid his harassment. However, Qin Xu was very patient. He very quickly followed him and continued to touch him again and again.</p><br/><p>This time, Jiang Yang could no longer contain himself. With a bright red face, he turned his head back and glared fiercely at him. Because class was running, Jiang Yang couldn’t speak too loudly so he could only threaten him in a low voice: “Touch me again and believe it or not I’ll cut off that dog hand of yours!”</p><br/><p>Qin Xu chuckled: “Don’t believe it.”</p><br/><p>Jiang Yang: “………” He was about to die from anger!</p><br/><p>He took several deep breaths and, with his fists clenched tightly and veins protruding at his temples, he moved his mouth wanting to say something. In the end he could only curse out through gritted teeth: “…….Get lost!”</p><br/><p>With a frigid expression, he pulled out a textbook and used his hand to support his forehead and, at the same time, block Qin Xu’s line of sight.</p><br/><p>Although he acted like this, he didn’t appear particularly threatening, so Qin Xu certainly wouldn’t retreat so easily. But Qin Xu also knew that he had completely irritated the other person and he shouldn’t continue pissing him off. Afterall, even a rabbit will start attacking when it’s pushed to its limits and Jiang Yang certainly isn’t a rabbit.</p><br/><p>Qin Xu pursed his lips and thought for a moment. From under his desk, he pulled out a toffee and placed it on Jiang Yang’s desk. He even poked him a few times with his finger to get his attention.</p><br/><p>Jiang Yang did notice his actions, but he was still in a bad mood so even Qin Xu’s action of trying to apologise with a candy irked him.</p><br/><p>And so, suppressing the anger inside him Jiang Yang only sent him a glare and waved his hand to swat the toffee away.</p><br/><p>Qin Xu’s reactions were fast, and he instantly reached out to catch the toffee. He then turned to Jiang Yang and revealed a smile to try and curry his favour. With his head slightly tilted, he carefully reached out to touch his hand, “Don’t be angry.”</p><br/><p>Jiang Yang ruthlessly threw his hand off. With reddening ears, he cursed out in a low voice: “Get lost!”</p><br/><p>Qin Xu once again pushed the toffee over. This time there were two. The two round balls rolled around on the table a few times looking very stupid.</p><br/><p>Jiang Yang once again pushed the candy away and, because he used slightly more strength this time, they accidentally fell to the ground. The collision between the ground and the plastic wrapping made a soft rustling sound.</p><br/><p>Jiang Yang seemingly didn’t expect it to fall to the ground and was temporarily at loss. His body stiffened up and he hesitantly retracted his hand back. He rigidly said: “Don’t want it.”</p><br/><p>“I know but I want you to have it.” Qin Xu smiled and looked at him. This time he placed three on them on his desk.</p><br/><p>“………Get lost.”</p><br/><p>After falling silent for a few seconds, Jiang Yang finally managed to spit out those two words. The oppressiveness in those words had weakened significantly and it wasn’t very fierce. Instead, because he said it so weakly, there was even a hint of softness hidden within.</p><br/><p>The three toffee balls just laid quietly on the edge of the table. Jiang Yang didn’t move to push them away and just left them there.</p><br/><p>Qin Xu saw this and secretly snickered. After interacting with him for so long he had long understood Jiang Yang’s awkward and proud personality. If you want him to be honest it would be a difficult request. And so, if he didn’t reject it, it could be considered as his way of accepting.</p><br/><p>“I won’t get lost.”</p><br/><p>Jiang Yang saw Qin Xu’s smile that looked overly radiant. Despite no longer feeling angry, he still habitually sent him a glare.</p><br/><p>That look was very fleeting and there wasn’t any harshness to it. Qin Xu just laughed and even surprisingly enjoyed it.</p><br/><p>He thought to himself, when will Jiang Yang’s attitude slowly soften to the point that he couldn’t help but smile when he sees him?</p><br/><p>Although Jiang Yang’s proud look is very cute, if he would candidly smile at him, he would probably be so elated he would no longer tell between up, down, left and right.</p><br/><p>Yesterday Jiang Yang punched him and told him to get lost, today he told him to get lost softly so tomorrow, would he come over and ask for kisses and hugs?</p><br/><p>It had to be said, a particular someone who imagined it was very pleased at the thought of it.</p><br/><p>****</p><br/><p>The final exams had just finished and the teachers for each of the subjects distributed the homework that they would need to complete over the school vacation. Standing at the podium they said: “Remember to do your homework during your winter break. Don’t play too crazily and pay attention to safety. Anyway, I wish you all in advance a Happy New Year.”</p><br/><p>“Happy New Year teacher~”</p><br/><p>The students proceeded to pack up their test papers and homework and stuff the large bundle into their bags. Inside they couldn’t help but sigh. Several male students even grumbled: “With all that homework, how can we have a happy holiday.”</p><br/><p>The teacher stood at the podium and could obviously hear it, but he was already used to it. If you want to complain then go ahead and complain. You still need to complete the homework in the end. The teacher smiled kindly and watched the classmates leave.</p><br/><p>Going home this time, they would also need to take home some of the luggage in their dormitory. Father Jiang thought that it would be too difficult for them, so he drove a car over to pick up his son and daughter. Because of this, Jiang Yang didn’t go home with the other classmates.</p><br/><p>Qin Xu was disappointed. He turned around and asked him if he wanted to hang out during the winter break.</p><br/><p>Jiang Yang looked at him and for once he didn’t reject him immediately. He hesitated for a second before replying, “We’ll see.”</p><br/><p>Qin Xu waved with a smile on his face before riding off on his flaming red mountain bike.</p><br/><p>Jiang Yuan walked over and stood next to Jiang Yang. Tilting her head over she spoke up hesitantly: “Brother……”</p><br/><p>Jiang Yang waited for a while and didn’t hear her continuing. With a look of confusion, he asked: “What?”</p><br/><p>Jiang Yuan couldn’t say it. How could she something like —–” Ah brother, are you about to come out of the closet and get me a brother in law?”</p><br/><p>How could she say something like that?!</p><br/><p>And so Jiang Yuan moved her mouth a few times and could only ask awkwardly, “You and….Qin Xu are good friends?”</p><br/><p>Hearing those words, Jiang Yang thought of the system. Good friends. He subconsciously wanted to refute those words, but he quickly swallowed it back down. If he denied it, he was worried that the system would react and pull out another ridiculous task for him.</p><br/><p>Jiang Yang calmly replied with a face void of expressions: “I guess so.”</p><br/><p>Jiang Yuan heard this and felt very complicated. Sure enough! If he would hesitate to admit something like friendship, then surely their relationship isn’t that simple and is something more profound! Naturally it was something they couldn’t let others know about and they would through pain and suffering try to hide the sweetness of their hidden love! Brother you must be exhausted!</p><br/><p>Jiang Yuan thought this, and the rims of her eyes gradually reddened while her eyes grew teary. She pressed firmly down onto Jiang Yang’s shoulder and said solemnly: “Brother, although the future path may be difficult please remember that I will always be behind you silently supporting you!”</p><br/><p>Jiang Yang: “……….” What on earth did this silly sister of his imagine?</p><br/><p>At the beginning of the winter break, Jiang Yang and Jiang Yuan returned home and were taken care of by their mother like babies. She would make whatever they wanted to eat and everyday they would be fed nutritious soup while she complained that they had lost too much weight in school. However, no later than a week later, her attitude switched 180 degrees. She found them not pleasing to the eye and every day she would nag at them saying things like they’re not cleaning up after themselves, leaving hair everywhere and only know to play, play, play.</p><br/><p>Weed number 1 and 2 felt very wronged but this had happened every time they were on break, so they had grown accustomed to it. They could only quietly keep their mouths shut and let mother boss do as she pleased and just say yes to everything she said.</p><br/><p>When Jiang Yang was playing games at home, he suddenly received a call from Qin Xu requesting for his help. Before he could get to the details, Jiang Yang had already resolutely refused.</p><br/><p>Qin Xu asked: “Aren’t I your good brother and desk partner?”</p><br/><p>Jiang Yang without any hesitation: “No.”</p><br/><p>Qin Xu: “………”</p><br/><p>Jiang Yang heard the other end fall silent and, after hanging up, an uncontrollable smile formed on his face. He stared at his phone for a while and when he finally returned to his senses he felt a little annoyed. He then went back to playing his game as it nothing had happened.</p><br/><p>But what he didn’t expect was that half an hour later Qin Xu arrived at his place.</p><br/><p>Mother Jiang opened the door and, seeing that it was the classmate who had visited last time, she warmly welcomed him inside. Qin Xu originally had the handsome and sunny look that elders liked. Adding on top of that, his polite mannerisms done with the intent to please her rendered mother Jiang very smitten.</p><br/><p>Without waiting for Jiang Yang to come out he reported his intentions, “My nephew has an open day at school and he is participating in a performance. Unfortunately, my brother and sister-in-law are busy and asked me to go and help record a video. I’m a little embarrassed to go alone so I wanted to find Jiang Yang to accompany me. Aunty is he free?”</p><br/><p>Mother Jiang nodded and immediately agreed in Jiang Yang’s stead: “How can he be not free? All he knows is to play games at home. I wish he would go out more.”</p><br/><p>Jiang Yang who had just walked out of his room heard this. “………..” Are you really my mother? You didn’t even ask me! Also, Qin Xu this bastard is too cheap. He already said that he’s not going!</p><br/><p>Mother Jiang saw her son come out and didn’t feel guilty at all for agreeing in his stead. Instead she smiled and urged him, “Hurry and change your clothes. Don’t be late.”</p><br/><p>Jiang Yang was helpless: “It’s an event for families. What am I going there for?”</p><br/><p>Qin Xu began to act sentimental and even deliberately made his nephew pitiful. “That’s right. The other children have their mum and dads there to support them and only my nephew doesn’t have anyone. I don’t even want to imagine how disappointed he will be.”</p><br/><p>Mother Jiang immediately furrowed her eyebrows in sorrow and then sent a glare to her own son. She said decisively: “If I say you’re going then you’re going. Children are very sensitive so watch your words and make him happy. Anyway, you’re not doing anything at home so go at cheer for Xiao Hao.”</p><br/><p>Jiang Yang: “………” You’re calling by his nickname already?</p><br/><p>In the end, Jiang Yang was helpless and was forcefully kicked out of his own home by his mother to accompany Qin Xu to the kindergarten.</p><br/><p>Yes, Qin Xu’s nephew is only five years old and in kindergarten. It was the little boy he ran into the other day at the park.</p><br/><p>Hearing this, Jiang Yang was stunned. He immediately pulled out his phone from his pocket and selected the group chat. Directing his message at Huang Shao he said: “I was wrong saying that you play worse than primary school kids.”</p><br/><p>Huang Shao was confused. He didn’t understand why he would suddenly dig out something from the past. He shrugged and sent over a casual emoticon —– This master forgives you.</p><br/><p>However, the next minute Jiang Yang issued the second half of his sentence, “That guy is only five years old. You’re worse than a kindergartener.”</p><br/><p>Huang Shao: “…………” Explode into a pufferfish!</p><br/><p>The other members of the group chat sent out chains of ‘hahahahaha’ and almost died from laughing. Together they joked that Huang Shao could no longer be saved.</p><br/><p>After he was done with dissing Huang Shao, Jiang Yang’s mood improved but when he reached the entrance to the kindergarten, he felt a little awkward. Generally, the people that came here were young mother and fathers and, for someone their age to come, they obviously looked out of place. Several family members looked over at them a few times out of curiosity. At their age, they clearly aren’t the children’s parents. Perhaps they’re older brothers who came as family representatives?</p><br/><p>Jiang Yang and Qin Xu sat among the group of excited parents and had some difficulty integrating. The parents all had their phones or cameras out and discussed brightly about things like; which performance their child is in, how they’re like at home, that they can tie their own shoelaces now and when mum returns from work all tired, their baby would even bring over a glass of water! How sensible, how cute!</p><br/><p>Jiang Yang &amp; Qin Xu: “……”</p><br/><p>Couldn’t find things to talk about.</p><br/><p>The parents sitting next to them turned around with the intent to find someone to chat to but, seeing two boys sitting there, they hesitated for a moment and then turned to the other direction to talk to the others.</p><br/><p>Because it is a kindergarten, the chairs for the parents are also small chairs normally used for children. It was only big enough for their butt and adults who are of a bigger frame would need to be careful they don’t fall over or break the chair. For those like Jiang Yang and Qin Xu, they had nowhere to put their legs but fortunately they had more legroom in the back rows.</p><br/><p>Lively children’s music started playing and the teachers used a cheery high voice to introduce and guide the children over. The children then began to present their performances on the stage under their teacher’s guidance.</p><br/><p>Jiang Yang sat below the stage and watched the children flail their short arms and legs around to the music. His originally uncomfortable mood gradually dissipated and, before he knew it, he became quite immersed in the show. At times he would even uncontrollably smile at the cute performances. Very few people would be able to deny that children are cute and innocent, and you couldn’t help but feel your heart soften when you watch them try their best.</p><br/><p>After watching several performances, Jiang Yang expectantly looked over to Qin Xu and asked: “When is it your nephew’s turn?”</p><br/><p>With a concealed smile Qin Xu checked the pamphlet, “Chicken dance. It’s the next one.”</p><br/><p>No longer than a few minutes later, the music gradually stopped and the children on stage stopped moving. Under the teacher’s beckoning, they stepped down the stage one by one with their little faces flushed red and their eyes filled with excitement. Several saw their parents in the audience and their parents responded by enthusiastically waving their hands and smiling brightly.</p><br/><p>“The next performance is the chicken dance. Please welcome them with an applaud~”</p><br/><p>Under the warm applause from the guardians, a group of little chicks waddled up onto the stage. Each child was dressed in a chubby and fluffy animal suit that made them look especially cute. The eyes of the parents in the audience brightened up and they started crazily taking pictures will calling out their baby’s name to look over in their direction.</p><br/><p>The teachers skilfully controlled the situation and directed the children to their respective positions. The accompaniment started playing and a teacher stood in the corner performing actions to guide the children in case they forgot what to do.</p><br/><p>Jiang Yang initially thought that with all the children wearing the same costumes, it would be difficult for him to find the little nephew, but he didn’t expect that it was in fact the opposite. Because he was too conspicuous, he easily spotted him in the crowd.</p><br/><p>The fifth one on the second row; while the other children wielded their short arms around, sang along to the song and wiggled their bottoms in the same directions, he was always half a beat too slow. However, there was no hint of panic on his face and he continued doing the actions very seriously. If someone who didn’t know what was happening saw this, they would even think that he was doing it correctly.</p><br/><p>The other guardians also noticed Qin Hao. With his white and lovely appearance, round, innocent eyes, and chubby cheeks that gave people the urge to pinch, he looked very adorable.</p><br/><p>“Whose child is that one there? Isn’t he too cute? He’s so cute it’s almost illegal.”</p><br/><p>“That’s right. I originally wanted to take photos of my baby but it’s like there’s an invisible force controlling my hands.”</p><br/><p>“I really want to hold him and run.”</p><br/><p>“Be careful. If his parents heard you say this, you might get a bag over your head.”</p><br/><p>The parents sitting there were still young and only in their twenties. They couldn’t help but joke around playfully. Jiang Yang heard this and also couldn’t help but laugh, “Your nephew is very popular.”</p><br/><p>Qin Xu who was busy recording heard this, looked over and also laughed.</p><br/><p>However, what they didn’t expect was that halfway through the chicken dance, Qin Hao suddenly left the group and waddled off the stage. He even left his pair of chicken feet in the middle of the stage. With a look of seriousness, he walked off.</p><br/><p>Jiang Yang was surprised: “What’s happened?”</p><br/><p>Qin Xu looked up and took his eyes off the camera screen. He laughed and shook his head, “He probably smelt something nice and wanted to eat.”</p><br/><p>Jiang Yang heard this and also moved his nose a little. There really does seem to be a fragrant smell. “…….Fried chicken? Speaking of which, is it okay for a chick to eat fried chicken?”</p><br/><p>Qin Xu: “…………” Is that what you’re supposed to be worried about?</p><br/><p>***</p><br/><p>On one particular night during their winter break, Huang Shao suddenly called everyone out to have hotpot.</p><br/><p>Jiang Yang and Qin Xu arrived only to find the other parties that were invited to be a little unusual. About half of them were not from their class.</p><br/><p>Huang Shao, Jiang Yang, Qin Xu, Tang Ling Ling.</p><br/><p>Wu Tong, He Shuo.</p><br/><p>…..Xu Jun?</p><br/><p>Jiang Yang looked at these people sitting at the table and found it very strange. He leaned towards Huang Shao: “Why did you call them?”</p><br/><p>Huang Shao answered as a matter of factly: “I just invited whoever’s free. Xiao Xin that guy is too much. It’s winter break but he still doesn’t forget to study. Xie Zhe that bastard too. I don’t know what he’s doing but he’s also not turning up.”</p><br/><p>When you have hotpot, it is naturally very lively. If you don’t grab for the food, you would be left with nothing.</p><br/><p>At first the mood at the table was a little strange but when the spicy soup base started boiling and sending out its fragrant smell, the people at the table started picking up their chopsticks and prepared themselves for war.</p><br/><p>The most important thing during hotpot is to be fast, be shameless.</p><br/><p>Although you may have managed to get the meat platter and pour it into the pot, it was a communal area so it’s not considered to be yours. If you’re not careful enough, it would be gone in a blink of an eye. Even if you swirl the ladle around, you wouldn’t be able to find a single piece. If your own combat ability isn’t strong enough, you would need to make sure you have a strong partner.</p><br/><p>As they ate and ate, Huang Shao realised that something was wrong. He himself had become the weakest on the table.</p><br/><p>Wu Tong and He Shuo were a pair and they worked very cooperatively. He Shuo even worried about Wu Tong not having enough to eat and constantly piled food up in his bowl.</p><br/><p>Jiang Yang and Qin Xu, despite bickering while eating, for some reason they piled meat into each other’s bowls as if they were competing over something</p><br/><p>Xu Jun’s arms were long and his hands here fast. His skin was so thick, even Huang Shao’s whip couldn’t catch up.</p><br/><p>As for Huang Shao himself, after finally able to grab some meat for himself, there was a thief sitting next to him who would from time to time reach into his bowl and steal it! That Tang Ling Ling! He glared over at her while she just looked up and smiled at him. Oh man, so angry!</p><br/><p>When he finally called Xiao Yuxin and Xie Zhe over and the two walked in side by side, they once again added more meat, shrimp, fish fillets, beef balls, duck tongue, lamb rolls etc to their order.</p><br/><p>Huang Shao thought that this time he would be able to win back some food, but he didn’t expect that Xie Zhe would be so shameless. Once he stood up, he never sat back down. With chopsticks in one hand and a spoon in the other, with a few scoops he managed to take out two peoples servings; one for himself and the other for Xiao Xin.</p><br/><p>Huang Shao: “…………” Angry to the point that he was at loss for words!</p><br/><p>How can these people be like this?! Why can’t they just eat what they throw in themselves?! They’ve completely broken the rules for hotpot. I’m not going to call these guys out for hot pot anymore! I’m so angry even my intestines hurt!</p><br/><p>Huang Shao was not only unhappy, what he didn’t expect was that he was also forcefully fed dog food throughout this whole meal. Of the nine people here, there were actually three couples. Even if they weren’t official, the sour taste of love was already strong enough.</p><br/><p>Xu Jun saw Qin Xu’s smiling expression and found it particularly annoying and stupid. With a cold voice he said: “What are you smiling about? So disgusting.”</p><br/><p>Qin Xu picked up the meat inside his bowl that was placed there by Jiang Yang, stuffed it into his mouth and ate it very happily. He replied in a cold manner very unlike the way he treats Jiang Yang: “I’m not smiling for you. If you find it disgusting, you can get lost.”</p><br/><p>Xu Jun: “Do you think I wanted to sit here?”</p><br/><p>His seat just happened to face Jiang Yang and Qin Xu. Watching them, he wanted to roll his eyes almost every minute. He picked up his chair and wanted to move but He Shuo sat to his left and Xie Zhe to his right. Neither of them allowed him to get in their way and he could only sit back down with a dark expression.</p><br/><p>Meeting Qin Xu’s irritating smile opposite him, Xu Jun was provoked to the point that he wanted to hit him. He picked up a bottle of alcohol and yelled: “Drink!”</p><br/><p>Qin Xu didn’t cooperate.</p><br/><p>Xu Jun sneered: “Are you afraid that you can’t drink more than me?”</p><br/><p>The hotpot restaurant was filled with liveliness. Around them, the constant sound of glass cups clinking, and the rich smell of alcohol easily made others influenced. Qin Xu received his challenge and subconsciously glanced over at Jiang Yang. He then grabbed onto the bottle and said with confidence: “Of course I’ll drink. Who’s afraid of who!”</p><br/><p>Like this, they very immaturely started competing over alcohol. Jiang Yang was a little surprised, but he obviously would not go over to try and stop him. He only watched on for a while before stopping them when he felt that they have had too much.</p><br/><p>Tang Ling Ling had eaten her fill and, seeing that Huang Shao was still cooking lamb rolls, she suddenly thought of something mischievous. She ran over to the freezer and pulled out a few ice blocks. Using the opportunity when Huang Shao is busy looking down and eating, she ripped off the wrapping from one of them and dipped in into the red hotpot soup. Like this, the snow-white ice block was immediately dyed red. Tang Ling Ling smiled and handed the ice block to Huang Shao and said, “Here, have a bite to counter the spice.”</p><br/><p>Without even lifting his head, Huang Shao moved his mouth over and took a bite. As soon as he did this he realised that something wasn’t right and quickly spat it out. He glared over at Tang Ling Ling, “You really are………..” He couldn’t find the right words to swear at her!</p><br/><p>His whole mouth was filled with a complex sensation. It was both hot and cold, spicy and numb.</p><br/><p>Tang Ling Ling saw that he had eaten the spicy hotpot until his mouth was red and swollen and he was sweating buckets and couldn’t help but laugh. She quickly restrained it back when she noticed his glare and with her hands together she bowed her head down to acknowledge her wrongdoings, “I was wrong. I’ll go and get you cold plum juice as apology.”</p><br/><p>“It better be real plum juice.” Huang Shao was suspicious.</p><br/><p>Tang Ling Ling patted her chest in affirmation, “Don’t worry, I won’t trick you this time!”</p><br/><p>Huang Shao used two fingers to point to his eyes and then pointed it at Tang Ling Ling. He then used his hand to pat himself on the chest a few times. The meaning to those actions was evident —- I’m watching you. Think with your heart before you do anything!</p><br/><p>Tang Ling Ling made an OK gesture and then happily went over to the fridge. On the way there, the phone in her pocket vibrated and she habitually took it out to check only to see that it was a video sent to her from a close friend. At first glance she didn’t react but when she looked closely, she instantly felt distressed. The content of it was something that was very difficult to describe!</p><br/><p>She was frightened. There were many people around her and she reflexively wanted to turn off the screen and store her phone back into her pocket. What she didn’t expect was that she would run into someone accidentally and accidentally touch the screen just before it fell to the ground.</p><br/><p>Before her was a tall and muscular figure. The other party politely bent down to help her pick up the phone while apologising even though he wasn’t the one who ran into her.</p><br/><p>He Shuo picked up the phone and his gaze inadvertently moved over to the screen. On the screen was a R18 clip playing along with ambiguous moans. In an instant his expression froze and his entire being stiffened. The phone in his hand immediately felt like hot potato.</p><br/><p>Tang Ling Ling really wanted to find a hole to hide in! She wanted to disappear! In general, people would think that only men enjoyed watching these little yellow films <em>(KKnotes: AKA porno LOL)</em> and that women were too embarrassed to watch but, in fact, there are some who are curious but couldn’t figure out where they get them from! As for Tang Ling Ling, she had a close friend who is very good at finding these videos. This film that she had sent over this time depicted two young and handsome fresh actors and it starts off very excitingly! Bathroom play! With their firm muscles and seductive bodies, they fired passionately!</p><br/><p>Tang Ling Ling had already become a stone statue. She reached out and tried to act indifferent while grabbing for her phone but at this moment the beautiful and gorgeous school idol Wu Tong walked over and smiled warmly: “What’s wrong?”</p><br/><p>Tang Ling Ling could swear to the gods that there was a look of warning and jealousy in the school idol’s eyes! But she swears that she has not even a little bit of feeling towards that junior brother of hers. Really! She’s pure and innocent!</p><br/><p>With so many things happening one after another, Tang Ling Ling’s brain couldn’t keep up. She watched Wu Tong look down and see the R18 content on her phone and look up to ask: “Ah Shuo, do you watch these?”</p><br/><p>He Shuo panicked and his face flushed bright red. He had the urge to throw the phone away and his two hands could only fumble around awkwardly: “No. This. Not mine. I didn’t mean to look…….”</p><br/><p>“Oh?” Wu Tong blinked a few times and his eyes moved again to the screen.</p><br/><p>He Shuo panicked and tried to turn the screen if he realised that the more he tried to hide it the more suspicious he would look. He didn’t know what to do and could only look towards Tang Ling Ling seeking for her assistance.</p><br/><p>Tang Ling Ling met with Wu Tong’s gaze and felt her back go cold. She immediately waved her hand: “Not me!”</p><br/><p>He Shuo: “……”</p><br/><p>Wu Tong gently patted He Shuo’s arm and then held onto it intimately before smiling: “You say it’s not you but my He Shuo is someone who’s very simple and has never even held a girl’s hand. It’s certainly not his.”</p><br/><p>He Shuo’s ears grew red and he looked over at the tall and gentle Wu Tong next to him before looking away. She- she said that I’m hers…..So happy.</p><br/><p>The beautiful school idol smiled but Tang Ling Ling felt an inexplicable coldness run through her spine. Without even thinking, she quickly threw the blame to someone else, “This is Huang Shao’s phone!”</p><br/><p>Huang Shao who was sitting at the table watching the drama unfold with interest nearly fell off his chair, “……………….” This heartless girl!</p><br/><p>Although Huang Shao didn’t know the details, he could tell that Tang Ling Ling once again did something and pushed the blame over to him. He couldn’t help but send a glare over to her and then his eyes met with Wu Tong’s strong gaze. Huang Shao naturally isn’t someone who would just accept the blame. He turned his head over and threw the blame by pointing to Xu Jun, “It’s him!”</p><br/><p>Xu Jun and Qin Xu had drunk until they could no longer think clearly. Hearing Huang Shao mention him, he could only shake his head in confusion and, with unclear eyes, he lifted up a bottle of alcohol, “Me! Continue drinking!”</p><br/><p>Wu Tong squinted, “Is that so? Then we should teach him a lesson next time.”</p><br/><p>When Tang Ling Ling heard this, she secretly let out a sigh of relief. She then took the phone from He Shuo and sneaked back to her seat.</p><br/><p>They finally finished eating and started going back to their own homes.</p><br/><p>Jiang Yang and Qin Xu’s place was in the same direction. Because Qin Xu is drunk, he called a taxi and they went back together.</p><br/><p>Jiang Yang supported Qin Xu onto the car, but the latter was all soft as if he had no bones and he was completely stuck onto Jiang Yang. When Jiang Yang wanted to throw him into the car, he reluctantly clung onto Jiang Yang unwilling to let go. He even took the opportunity to reach over and kiss him on the face with a loud smack.</p><br/><p>Jiang Yang was completely stunned. He looked down only to find that drunk bastard smiling proudly. His eyes were unfocussed, so he probably didn’t even know what he had just done. Jiang Yang was both angry and helpless, and he was also worried about the driver’s reaction. Fortunately, the driver remained calm after witnessing that scene. Clearly, he was someone who had encountered things like this often and was only concerned about whether his passengers would throw up in his car.</p><br/><p>Jiang Yang breathed a sigh of relief and promised that he would watch over Qin Xu. With his foot, he kicked the other person into the car and then moved to sit inside away before giving Qin Xu’s address to the driver.</p><br/><p>Qin Xu grievously rubbed his head and whined: “I don’t want to go home”</p><br/><p>Jiang Yang was frustrated. With his arms crossed in front of his chest he looked down at him: “If you don’t go home then where are you going?” Do you want to go to hell?</p><br/><p>Qin Xu placed two hands on his knees and obediently sat up. After a couple of blinks, he said shyly: “I want to go inside your heart.”</p><br/><p>Jiang Yang: “………..”</p><br/><p>Driver: “………..”</p><br/><p>There was no one at home and with his current drunk state Jiang Yang didn’t feel comfortable making him make his own way home. He used his shoulder to support Qin Xu and helped him into the building. After entering the elevator Qin Xu suddenly attacked him with a bear hug. His arms wrapped firmly around his waist rendering him unable to move.</p><br/><p>With much difficulty, Jiang Yang managed to support him and tried to free up one of his hands to press the button. It just happened that at this moment an aunty also entered the elevator. With a friendly smile she asked. “Which floor?”</p><br/><p>Jiang Yang replied and politely gave his thanks.</p><br/><p>The aunty was pleased to see someone so polite and naturally didn’t mind helping him out. As the elevator went up she asked: “I haven’t seen you around before. Are you a new tenant?”</p><br/><p>“No, I’m just dropping a friend off.” Jiang Yang shook his head and replied.</p><br/><p>The aunty looked down at Qin Xu in his arms and indeed felt that his face looked familiar. But because they were only neighbours, the aunty no longer asked any questions after this. The inside of the elevator was quiet and there was only the soft mechanical sound the elevator made as it carried the people inside to the upper floors.</p><br/><p>At this moment, Qin Xu placed his chin onto Jiang Yang’s shoulder and whined in a spoiled voice. He tilted his head and dragged out his low and magnetic voice, “I want a kiss~”</p><br/><p>Jiang Yang: “………”</p><br/><p>Aunty: “…………..”</p><br/><p>The air in the elevator instantly became stagnant.</p><br/><p>Jiang Yang looked towards the aunty with embarrassment. He hesitated for two seconds before pulling away the person sticking to him like gum and awkwardly tried to explain, “He’s drunk……….”</p><br/><p>But a particular drunk person immediately ruined his attempt. With a forceful hug around his waist he announced his sovereignty by shouting out: “I’m not drunk! I just want to hold you to sleep!”</p><br/><p>Jiang Yang wants to hit him!</p><br/><p>The aunty who watched this on the side suddenly nodded her head and waved her hand very graciously, “It’s okay. I understand. I understand everything.”</p><br/><p>Jiang Yang: “………..” He had a complicated expression. Aunty do you really understand? I don’t feel any relief seeing that look of yours. What on earth do you understand?!</p><br/>\n</div>"}