{"title": "Chapter 54 - Travel", "id": 54, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-54-travel", "volume_title": "Volume 1", "body": "<h1>Chapter 54 - Travel</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 54: Travel</strong></p><br/><p>Feeling that scalp-numbing sensation, Jiang Yang instantly exploded and threw out a violent kick. All the anger that he had accumulated over the last night was suddenly stimulated by that final poke.</p><br/><p>Qin Xu was kicked backwards and almost rolled off the bed. Fortunately, he reacted fast and managed to stabilise himself by grabbing onto the edge of the bed.</p><br/><p>Jiang Yang sent him a glare and then angrily pulled the covers over his head as he laid back down to catch up on his sleep. Only a part of his dark black hair could be seen sticking out over the sheets.</p><br/><p>Sitting on the edge of the bed, several thoughts crossed through Qin Xu’s mind. He then inexplicably chuckled a few times. In fact, he had already guessed that probably nothing had happened last night but just the thought of Jiang Yang staying behind to take care of him all night made him feel extremely pleased.</p><br/><p>He lightly jumped off the bed and waddled over to the bathroom. After washing up, his head no longer hurt so he excitedly went out to buy breakfast. On his way he even swayed to the rhythm as he hummed the tune of a small love song.</p><br/><p>Qin Xu was lazy. Since there are many shops downstairs including breakfast shops, he would usually just go out to buy it. The owner of shop that he frequently visited long became able to recognise him. It wasn’t just because he visited often, he was also handsome and had a pleasant smile.</p><br/><p>The boss saw him ordering a lot and could tell that it wasn’t just for one person. She joked and said: “Buying breakfast for your girlfriend?”</p><br/><p>If he bought more food, it could be just for a friend, but she deliberately said girlfriend to tease him but what she didn’t expect was that the next second, after Qin Xu received the bag, he replied with a bright smile: “That’s right. Boss you’re really clever.”</p><br/><p>The boss was also surprised. She had just said it jokingly and didn’t expect to hit the mark. Hearing this, she laughed even more joyfully, “That’s good. Then to congratulate you, I’ll give you two more fried dumplings. It’s just fried so it’s still hot.” As she said this, she immediately started to bag it up.</p><br/><p>Qin Xu happily accepted it and said: “Thank you.”</p><br/><p>“No need. You come here almost every day, so I feel bad if I don’t give you something. Help me say hi to your girlfriend. To be able to be with you, I’m sure she’s particularly good looking?” With the steam rising up over the boss’s face, her smile appeared even more serene.</p><br/><p>“Of course. Very good looking.” Qin Xu lowered his head and smiled as he thought of something. He then waved at the boss and turned to leave.</p><br/><p>On his way back, Qin Xu was in an even better mood. There was even a small spring in his steps. It was like he was about to start flying.</p><br/><p>He reached his front door, entered the house and threw the keys into the small bowl on top of the shoe cabinet. He then placed the breakfast on the dining table and checked to see if the other person has woken up yet. When he looked in, he saw that the bed was empty, and the blankets were a tangled mess. He heard the sound of water running from the bathroom and saw that Jiang Yang was currently washing his face. As he lifted his head, the water droplets slid down his face to his chin eventually falling onto his collar and wetting a small patch of it. His eyes were indifferent, and his expression was cold, but it looked inexplicably sexy.</p><br/><p>Qin Xu saw this and subconsciously swallowed and he felt his mouth go dry. He quickly looked down and retracted his gaze before trying to act natural and call out: “I bought breakfast. It won’t taste good if it gets cold.”</p><br/><p>Jiang Yang responded and soon went and sat down at the dining table.</p><br/><p>The breakfast was very rich and looked very appetizing. Jiang Yang’s bad morning mood even improved slightly as he saw it. He picked up his chopsticks and started off with some milk fritters which was best eaten whilst it’s hot. With its crispy golden skin on the outside and the tender texture inside, the thick taste of milk exploded in his mouth each time he chewed. Its’ flavour was extremely sweet and delicious.</p><br/><p>Jiang Yang’s mood softened down.</p><br/><p>Qin Xu saw this and his eyes curved happily. He took a few mouthfuls of soy milk to try to cover the smile forming at his mouth.</p><br/><p>After they were almost done, Qin Xu suddenly suggested something that he had thought of on his way back.</p><br/><p>“Jiang Yang let’s go travelling.”</p><br/><p>Jiang Yang took a sip of soy milk and in the process stained the corners of his mouth. He then looked over confused and subconsciously tilted his head, “Why……”</p><br/><p>Then he paused. As if he had a suddenly realisation, he asked: “Task?”</p><br/><p>Qin Xu was stunned for a moment but he quickly reacted and nodded hard, “Oh…..right. It’s a task.”</p><br/><p>Being able to find such a perfect excuse, he smiled with satisfaction.</p><br/><p>Jiang Yang didn’t notice this and just concentrated on sucking up the remaining soy milk until it started gurgling. He had already gotten used to the system releasing tasks randomly and, although the other party is a little annoying, something like traveling wasn’t something that he was averse against.</p><br/><p>“Did it say where we need to go?”</p><br/><p>Qin Xu stalled for a moment before shaking his head. Smiling happily, he responded: “No. Where do you want to go? I’m okay with any.”</p><br/><p>Jiang Yang was very interested in the idea of going travelling. He supported his chin and started to think seriously, “Speaking of winter, things like ice skating or snowboarding sounds pretty good but it’s already cold enough here so it’ll be like hell over there. My down jacket also isn’t thick enough. I wonder if it’s too late to buy it now……”</p><br/><p>Qin Xu watched him knit his brows in serious consideration and felt very pleased. He immediately joined in with the planning and every word he spoke was filled with excitement, “If you’re afraid of the cold then why don’t we go somewhere south like Thailand? If you go now, you could just wear short sleeve and we can do things like swimming at the beach and eating tropical fruits.”</p><br/><p>This sounded pretty good. Jiang Yang imagined the refreshing scene of a sunny beach with blue sky and emerald green water and proceeded to pull up his phone to search Bangkok’s weather. Seeing that the average temperature was thirty degrees and wasn’t too hot, he happily decided.</p><br/><p>Let’s travel to Thailand.</p><br/><p>Qin Xu watched him nod and secretly fist-pumped. He then thought of something and wanted to confirm, “Will it just be the two of us? You won’t call up the others?”</p><br/><p>Jiang Yang answered as a matter of factly: “Why should I call the others. It won’t be convenient if we suddenly get a task. It’s also a pain trying to hide it.”</p><br/><p>Qin Xu was a little stunned. The corner of his mouth then curved up and he revealed a very satisfied smile: “You’re right!”</p><br/><p>For the next few days the two naturally contacted each other often to plan out their trip.</p><br/><p>On the day of their departure, father Jiang dropped them off at the airport and nagged at them a few times before leaving. Jiang Yang responded to all of them and felt that his father was overreacting. He had travelled before with his family and knew what to do if anything happened. Furthermore, the place they’re going to is a famous tourist location so there’s no need to worry about the language barrier.</p><br/><p>They took their boarding pass, checked in their baggage, went through security check and customs, and headed to the boarding gate where they sat down and…….played on their phones.</p><br/><p>Because there was still half an hour until boarding time, the two sat next to each other and formed a team in the game. Before they could finish the first game, Huang Shao suddenly called. It just happened to be right at a key moment, so Jiang Yang just resolutely hung up on him.</p><br/><p>Huang Shao no longer tried to call him from his end after that. He probably could guess why he was hung up on and gave up. Jiang Yang called him back after he finished the game. Just as he was about to ask him what he wanted, a mournful cry travelled over.</p><br/><p>“Xiao Yang Yang how can you go behind my back to go on a honeymoon with Qin Xu? Speak! Do you still have me in your heart?!”</p><br/><p>Jiang Yang: “…….” He massaged his temples. Despite doing his best to try to hide it, how on earth did this guy find out?</p><br/><p>“Look at you. You don’t even have anything to say. You are so heartless doing this to me. While you’re acting lovey-dovey with each other, I’m left all alone here, lonely and desolate…….” Huang Shao started wailing while accusing Jiang Yang of his lack of conscience.</p><br/><p>No matter how long he has been with Huang Shao, Jiang Yang would never be able to get used to his habit of dramatizing everything. Hearing those words, goose-bumps couldn’t help but form on his arms. Jiang Yang could sense that the other party had no intention to shut up and felt frustrated. He immediately spoke up: “Stop. If you still want to get souvenirs, then shut up.”</p><br/><p>As expected, Huang Shao immediately fell silent. He then cheekily added: “Really? Then I want ten bags of dried durian!”</p><br/><p>Jiang Yang: “Three bags.”</p><br/><p>Huang Shao: “That’s too little! At least five bags!”</p><br/><p>Jiang Yang: “Two bags.”</p><br/><p>Huang Shao: “Xiao Yang Yang!”</p><br/><p>Jiang Yang: “One bag.”</p><br/><p>Huang Shao was like a balloon that was punctured. In an instant he became discouraged and just said in a disappointed voice: “Fine, three bags it is then. Stop reducing it.”</p><br/><p>Jiang Yang: “You should have said so from the start.”</p><br/><p>Huang Shao: “……….” Explode into a pufferfish!</p><br/><p>After hanging up, Jiang Yang subconsciously shook his head. Although he had known Huang Shao for many years, he still found that guy a little scary in some certain respects.</p><br/><p>Jiang Yang looked over at Qin Xu sitting next to him and couldn’t help but nod his head in thought. In comparison, he realised that it wasn’t too bad going on a trip with Qin Xu.</p><br/><p>Qin Xu was confused. Although he didn’t understand, he was happy to see the look of affirmation in Jiang Yang’s eyes.</p><br/><p>Travelling. In addition to being a form of enjoyment, it can also be quite tiring. This time Jiang Yang and Qin Xu went abroad alone and, to avoid being making the itinerary too packed and rushed, they opted for a more relaxed style. They even gave themselves a day to stay leisurely at the hotel and maybe swim at the beach.</p><br/><p>Since they’re going to the beach, they naturally would be exposed to the sun for a long time and Jiang Yang was happy to do so. After all, after a winter passes, the tan that he had achieved with much difficulty would quickly whiten back several shades. Using Jiang Yuan’s words, it would become white and dazzling to the point that other girls would look on in envy.</p><br/><p>However, what was strange was that before they went to the beach, Qin Xu insisted that he should put on sunscreen.</p><br/><p>Jiang Yang still had the typical straight man’s train of thought: “Put what on? A man doesn’t need sunscreen.”</p><br/><p>Qin Xu: “Sunscreen is for preventing sunburns. You’re too biased. Look at the skin that you deliberately tried to tan and ask yourself whether or not it hurt when it peeled.”</p><br/><p>Jiang Yang waved his hand very nonchalantly, “That little pain is nothing.”</p><br/>\n</div>"}