{"title": "Chapter 67 - Couple Outfit", "id": 67, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-67-couple-outfit", "volume_title": "Volume 1", "body": "<h1>Chapter 67 - Couple Outfit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 67: Couple Outfit</strong></p><br/><p>From when they left the haunted house, there was still another two hours until it was time for the students to gather up, so someone pointed to a conspicuous building in the distance while proposing: “How about going ice skating?”</p><br/><p>Everyone thought for a moment and nodded with interest.</p><br/><p>Some girls were worried: “But I haven’t skated before…..”</p><br/><p>“Don’t worry. I’ll help you.”</p><br/><p>This naturally was a good opportunity for the boys to show them their good side.</p><br/><p>As for Wu Tong and He Shuo, it was a different scenario. With his tall and strong build, He Shuo had a troubled look on his face while he scratched his head. He said in a small voice: “I also can’t……..”</p><br/><p>Wu Tong smiled very gently and held onto his hand, “I can. I’ll teach you.”</p><br/><p>He Shuo’s face blushed red as he cutely nodded his head in agreement.</p><br/><p>Qin Xu watched the two standing close together and snorted internally. What a strong stench of love in the air.</p><br/><p>He then decisively turned around and hooked his arm around Jiang Yang’s shoulder. He acted pitiful and said: “I also can’t. You have to help me later.”</p><br/><p>Jiang Yang gave him a look, “What help do you need? You’ll learn how to do it very quickly on your own.”</p><br/><p>Qin Xu thickened his skin and continued to look over at him, “But I really can’t. Not possible.”</p><br/><p>Jiang Yang had a look of disdain, but he still took Qin Xu’s hand and helped guide him around while they skated.</p><br/><p>There was a moment in the middle of it when Jiang Yang heard a cry of surprise from next to him and this was followed by the feeling of someone grabbing tightly onto his waist. Jiang Yang almost lost his balance and nearly fell backwards from this impact but was held tightly in that person’s embrace.</p><br/><p>“Scared me to death. I almost fell.” The words ‘scared’ came out of Qin Xu’s mouth, but there was an obvious smile in his eyes.</p><br/><p>Jiang Yang looked down at Qin Xu’s skates and could tell that he had just skilfully stopped right in front of him. He could tell that this bastard could not only skate, he was even better than he is himself. Thinking this, Jiang Yang felt like he was just being teased and was instantly angry. He angrily threw off his hands and, no longer wanting to care for him, he proceeded to skate away.</p><br/><p>But Qin Xu refused to let go. Jiang Yang managed to escape from his arms several times, but Qin Xu’s movements were fluid and he easily moved back to Jiang Yang’s side and even reached out to hold his hand.</p><br/><p>With his hand grabbed onto so suddenly and the obvious body temperature transmitted to his palms, it was impossible to ignore.</p><br/><p>For a moment, Jiang Yang inexplicably felt his heart beat increase. Before he had the chance to think about this, he reflexively reacted by throwing off Qin Xu’s hand.</p><br/><p>He didn’t manage to control his strength well and Qin Xu was pushed backwards by the force. Seeing him almost fall backwards onto the ground, Jiang Yang reached out without a thought to once again grab onto his hand and pull the other person back. With one person pulling and supporting the other, it looked like they were in the middle of a waltz.</p><br/><p>Jiang Yang had reacted with subconscious panic but when he looked back up, his eyes were met with Qin Xu’s eyes that had a hint of a smile. There wasn’t any indication of fear from the fall earlier so Jiang Yang instantly realised the he was once again played with.</p><br/><p>This time, in addition to feeling angry, there was also some inexplicable panic and irritation inside. Because of this, his tone was quite rude as he glared at Qin Xu and said seriously, “You think this is funny?! Will you still be able to laugh after you fall and get cut by the blades?”</p><br/><p>Qin Xu seemingly didn’t expect him to get so angry. After being stunned for a moment, he proceeded to laugh amicably and once again stuck onto Jiang Yang while holding onto his hand, “I’m sorry, I was wrong.”</p><br/><p>Hearing it spoken with a spoiled child’s tone, Jiang Yang would normally just let him off like before but for some reason, this time his expression remained cold. He didn’t want to waste any more energy on Qin Xu.</p><br/><p>Jiang Yang said faintly: “I don’t want to skate. Going to take a break.”</p><br/><p>Then with a couple of smooth steps, he skated over to the rinks exit and walked over to the rest area before sitting down.</p><br/><p>Qin Xu naturally followed and stuck firmly behind him. He wasn’t upset about being suddenly yelled at. On the contrary, he was actually quite happy. He didn’t immediately realise it earlier but after a moment of consideration he realised why Jiang Yang reacted so strongly. To put it bluntly, Jiang Yang was worried about him but as someone who is extremely proud, he couldn’t express his concern properly.</p><br/><p>Wu Tong took He Shuo around the ice rink and, while teasing his cute junior brother, he also noticed the situation on their side. Seeing them leaving for the rest area and Qin Xu following behind Jiang Yang while saying something that managed to bring a smile to his face, he couldn’t help but express: “These to really…”</p><br/><p>He Shuo leaned against the railing next to him and looked over in the direction that he is looking at and couldn’t help but pout: “Who are you looking at?”</p><br/><p>Wu Tong heard the tone of dissatisfaction in his voice and turned over to meet his tensed expression. He laughed and said: “I’m looking at you.”</p><br/><p>He Shuo was instantly embarrassed. His eyes were stained with sparkling colours appearing very dazzling and beautiful, and his ears were red.</p><br/><p>Suddenly, he was in a good mood to skate and even reached out to hold Wu Tong’s hand.</p><br/><p>Seeing that the time was almost up, the group slowly started to leave the rink and change their shoes before heading over to the amusement park entrance.</p><br/><p>When Wu Tong walked out, he saw Jiang Yang standing under a tree outside the entrance to the ice-skating rink waiting for the others. He couldn’t help but laugh meaningfully. Jiang Yang who saw this felt uncomfortable and frowned, “What are you laughing at?”</p><br/><p>Jiang Yang knew his secret, so Wu Tong naturally didn’t need to continue acting. He just said straightforwardly, “Nothing. I just thought that you two are so silly and cute. Before, you both mistakenly thought that you liked me but it’s not too late to correct it back now.”</p><br/><p>Liking Wu Tong was a black history of his that Jiang Yang didn’t want to admit to but what did he mean but correcting it back? Jiang Yang furrowed his brows in confusion.</p><br/><p>Wu Tong continued with a smile: “Before, you were love rivals but how does it feel now that you two are together?”</p><br/><p>Jiang Yang noticed something wasn’t right, “Together? What are you talking about?”</p><br/><p>Wu Tong as a matter of factly said: “You and Qin Xu of course….Wait. Don’t tell me you two aren’t official yet? Not official yet already so clingy?”</p><br/><p>As he said this, a familiar expression formed on his face. Ah, so greasy.</p><br/><p>But right now, that wasn’t important.</p><br/><p>Jiang Yang’s expression suddenly became complex. There were many things that had happened recently that he couldn’t explain but, after hearing Wu Tong’s words, he started to think over it carefully. In fact, he had not been unaware of it the whole time. It was just that he had subconsciously avoided it. The obviously burning gazes from Qin Xu’s eyes that often flashed brightly were not the type of look one would give their ordinary friends. Furthermore, he is also very clingy.</p><br/><p>Jiang Yang was a little shocked. He said in a soft voice, “You think that, Qin Xu and I…..are a couple?”</p><br/><p>Wu Tong returned with a question: “Otherwise?”</p><br/><p>Jiang Yang was stunned.</p><br/><p>At this moment, the classmates who had fallen behind finally came out while chattering and laughing. The moment Qin Xu came out, he looked left and right, and his eyes naturally brightened the moment it found Jiang Yang. Without any hesitation, he strode over to where he is.</p><br/><p>His figure was tall and straight, and on his face was a radiant smile.</p><br/><p>This type of person, no matter where he is, is very eye-catching but he didn’t pay attention to the gazes from the on-lookers and only cared about going over to Jiang Yang. It was as if he only had Jiang Yang in his eyes. He smiled very happily as he grabbed onto Jiang Yang’s and walked next to him</p><br/><p>As for Jiang Yang, all he could see was Qin Xu’s extremely intimate gestures. Acting spoiled, he moved closer and rested his chin onto Jiang Yang’s shoulder and said a few things in a lazy manner. Despite the words spoken being rather mundane, his mood seemed especially good.</p><br/><p>Jiang Yang felt his ear itch from his breath and it unconsciously started to turn red but wasn’t because he was embarrassed. It was just a natural physical reaction.</p><br/><p>He suddenly had a strong realisation that something wasn’t right with the way they interacted with each other. It was too intimate, and they would very often hug and cling. What was surprising was that he had even grown accustomed to it and felt that it was normal.</p><br/><p>Jiang Yang looked at the classmates around them. Not one of them found it strange for the two to be in such an intimate position. It was as if it was completely normal.</p><br/><p>Qin Xu softly whinged: “There’s still some time left and it’s boring standing around like this. Let’s take a few photos.”</p><br/><p>Then, he didn’t wait for Jiang Yang to agree and had already handed his phone over to one of their classmates asking them to help them take a photo.</p><br/><p>Qin Xu ran back and pushed Jiang Yang over to stand under the iconic symbol for the amusement park. With one hand around his shoulder and the other hand displaying a victory sign, his smile was brighter than the sun itself.</p><br/><p>The classmate pressed the button a few times and then signalled an okay with his fingers. Then, like a diligent photographer he directed the two: “Change your pose and we’ll take a few more. Make a heart.”</p><br/><p>Now this posture is something that has been very popular amongst social media. Without even needing to think, Qin Xu reached out and squeezed his two fingers together for form a small heart.</p><br/><p>Jiang Yang didn’t like taking photos and for a moment didn’t respond until Qin Xu patted him on the shoulder. He subconsciously squeezed his two fingers together and accidently made the giving money hand gesture.</p><br/><p>Both Qin Xu and the classmate taking the photo laughed out loud.</p><br/><p>Qin Xu smiled in a very pleased manner as he grabbed onto Jiang Yang clumsy little hand and corrected his gesture before saying: “It’s like this baby.”</p><br/><p>It was spoken like he was coaxing a little child.</p><br/><p>Jiang Yang: “……”</p><br/><p>He was a little annoyed.</p><br/><p>Jiang Yang pursed his lips and, throwing his hands off, he turned around wanting to leave.</p><br/><p>Qin Xu saw this and immediately cursed internally. He could tell that he had once again said something wrong and triggered the other person, but he didn’t regret calling Jiang Yang that. Instead, he felt particularly sweet and pleased inside. Moreover, Jiang Yang’s angry look is very cute.</p><br/><p>Qin (with the eyes of a lover) Xu seemingly had a powerful filter in his eyes. No matter what he did, Jiang Yang always looked very good to him and he wouldn’t hesitate to fight back if someone said otherwise.</p><br/><p>He hobbled over to Jiang Yang and tried to placate him with a smile. He said a bunch of nice things and even from time to time threw out a few cheesy lines that made Jiang Yang feel his scalp go numb. A little helpless, he reluctantly walked back to take the rest of the photos so that he could finally make Qin Xu shut up.</p><br/><p>When the classmate returned his phone back, Qin Xu happily held onto his phone and swiped through the photos one by one. Jiang Yang also looked at it briefly when he noticed————</p><br/><p>The two were both wearing their school uniforms and, when it was taken with several classmates, it looked like a group uniform but when it was just the two together smiling at the camera it looked like a couple outfit.</p><br/><p>Couple outfit.</p><br/><p>Thinking this, Jiang Yang felt inexplicably guilty and a little complex inside. His heart also seemingly skipped a beat.</p><br/>\n</div>"}