{"title": "Chapter 77 - Qin Xu X Jiang Yang (University)", "id": 77, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-77-qin-xu-x-jiang-yang-university", "volume_title": "Volume 1", "body": "<h1>Chapter 77 - Qin Xu X Jiang Yang (University)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 77: Qin Xu X Jiang Yang (University)</strong></p><br/><p>“Have you ordered?”</p><br/><p>“Of course!”</p><br/><p>Before the end of class, several boys sat together and sneakily placed their orders on their phones. It is currently their last class of the day and they would normally be placing food orders at this moment but, on a hot summer day like today, it wasn’t just for food. They sent a request into the umbrella group chat asking for a partner to accompany them.</p><br/><p>Why is there something as strange as the umbrella group? It actually isn’t anything major, it just happened to be in hot demand. On a hot day like today, not many would be able to stand directly under the sun and be exposed to its burning heat. But men are proud creatures. Despite wanting to hold an umbrella to shade them from the sun, they were worried about others calling them a sissy _(:з」∠)_.</p><br/><p>At the beginning, a boy sent a message into the group chat —– Looking for an umbrella partner. Female. Should have an umbrella but I’ll buy one if you don’t. Every day before and after school I will help you hold the umbrella. Recently the sun has been too hot and I’m too embarrassed to hold an umbrella as a man. I’m doing this because I have no other options.</p><br/><p>Those pitiful words made the other boys reading it nod their heads in understanding. And so, this led to the creation of the umbrella group. The boys would submit requests and their locations, and the girls would accept their requests and come over to pick them up and get paid for it.</p><br/><p>However, Jiang Yang has not made a single order for that. He wanted to bask in the sun. With the change in weather, the sun is warm and comfortable, and he could even tan his skin into a masculine bronze colour. Why wouldn’t he like that? But this year, summer was very strange. They were already wearing short sleeves in April, May was already hot, and June was extremely hot. As they walked outside, their sweat would pour down like it was raining. Clearly the next few months would be like hell!</p><br/><p>Even the manly Jiang Yang couldn’t stand it anymore and wanted to hold an umbrella. But……he didn’t want others calling him a sissy.</p><br/><p>But he didn’t need to find an umbrella partner. He already has one. A particularly annoying and cute one at that.</p><br/><p>When the class bell rang, the teacher on the podium announced the end of class. The students all tacitly got up and walked out the door.</p><br/><p>During peak hours, it is very easy for crowding to happen. After he had experienced it a few times, Jiang Yang gained some experience. Instead of going to the nearest staircase, he went against the flow of the crowd and went to the staircase on the other end. After just going down one floor, he saw a slender and tall figure coming over with a handsome and bright smile.</p><br/><p>Of course, it’s Qin Xu,</p><br/><p>Their personalities were similar, and they also had similar hobbies. During the period when they studied frantically for the college entrance examination in third year, they were almost always stuck together so even their results were only seven marks apart. They applied to go to the same university and, despite studying different majors, they were in the same faculty. When they had the same subjects, they were even able to attend it together.</p><br/><p>Like now, they could go to the cafeteria together. Of course, Qin Xu insisted on holding the umbrella. It not only blocks the sun, it also allows him to deliberately walk closer to Jiang Yang. Jiang Yang initially didn’t like it, but he eventually accepted the slightly sissy behaviour of holding up an umbrella.</p><br/><p>On their way to the cafeteria, they chatted and discussed what they should eat. Very soon, they arrived at the first cafeteria.</p><br/><p>Jiang Yang said that he wanted to eat chicken clay pot.</p><br/><p>Qin Xu heard this and immediately acted pitiful, “You want to throw me away and eat something nice by yourself?”</p><br/><p>“That’s right.” Jiang Yang didn’t hesitate.</p><br/><p>Recently, Qin Xu had gotten sick and he didn’t dare eat hot things. The chicken clay pot was naturally something that he couldn’t eat but it was extremely delicious. He felt distressed for himself.</p><br/><p>Jiang Yang looked at his expression and couldn’t help but feel the corners of his lips rise.</p><br/><p>And so, when they entered the cafeteria, the two lined up at separate windows. Of course, they weren’t too far apart, and they could easily see the other person if they turned their heads.</p><br/><p>Jiang Yang ordered a chicken clay pot, swiped his card and waited on one side for the chef to make it.</p><br/><p>The chef skilfully threw in the ingredients; chicken, onions, enoki mushrooms, bell peppers etc. He then poured pre-prepared sauce and, not long afterwards, the pot started sizzling and boiling sending the fragrant smell over. After attending a whole morning filled with classes, Jiang Yang was especially hungry.</p><br/><p>Jiang Yang’s expression appeared calm, but he was already swallowing his saliva in anticipation.</p><br/><p>He watched the chef use a long ladle to mix the ingredients inside the pot from time to time before seeing that it was about time and throwing in some shallots and parsley. The chef replaced the lid and poured some cooking wine on the side. It instantly caught on fire and the chef then proceeded to take it out and place it onto Jiang Yang’s tray. Jiang Yang held his tray and looked around finding an empty seat when he saw Qin Xu standing not far a way pointing at some seats with his chopsticks telling him to grab the seats first.</p><br/><p>As he sat down and waited, Jiang Yang looked over at Qin Xu and saw him talking to an unfamiliar boy. Jiang Yang thought for a moment and felt that Qin Xu’s personality is different to his. Qin Xu may look cold, but he is actually quite extroverted. He participated in clubs and community events and could easily get along with strangers. Whenever he walked with Qin Xu, he would often find Qin Xu sending out greetings the other college students.</p><br/><p>As he thought this, he somehow felt a little upset.</p><br/><p>“Classmate.”</p><br/><p>Jiang Yang suddenly noticed someone calling out to him. He followed the source of the sound and looked over. Standing there was an unfamiliar girl who was smiling with slight embarrassment. She tentatively asked: “What is that you have there? Where did you order it?”</p><br/><p>She pointed at the steaming chicken clay pot sitting in front of him.</p><br/><p>It was just a simple question, so Jiang Yang naturally answered. He didn’t find anything wrong with it, but for the sake of food the girl responded very excitedly. After knowing the answer, her eyes brightened up. It was as if Jiang Yang’s answer helped her out a lot. The girl smiled and revealed cute dimples next to her lips. She gave Jiang Yang her thanks and even gifted him a piece of chocolate.</p><br/><p>Jiang Yang didn’t think that he did much and was preparing to decline when he felt a weight fall onto his shoulder. Someone stood behind him with his arms around his shoulder and said: “Chocolates huh? This kind of thing can have different meanings, so you can’t just casually accept them. If you don’t like, you should refuse directly.”</p><br/><p>Qin Xu’s obviously dissatisfied low voice could be heard above his head.</p><br/><p>The girl was a little stunned. She stood there in daze for a moment as her eyes flitted between the two boys. When she finally realised that it wasn’t good gifting chocolates to boys she wasn’t familiar with, she blushed in embarrassment and quickly walked away.</p><br/><p>Only then did Qin Xu reveal a satisfied expression like he had just won a battle. He sat down next to Jiang Yang and handed him chopsticks while deliberately saying sadly: “Xiao Yang Yang, with you being so popular, I feel very insecure. Why don’t you show me your love more?”</p><br/><p>Jiang Yang received the chopsticks and started eating. He looked over at him and said faintly: “Actually it’s you.”</p><br/><p>Qin Xu didn’t understand: “…….Huh?”</p><br/><p>But Jiang Yang didn’t intend to explain. He looked down and started to concentrate on eating. The chicken clay pot tasted best when it’s hot. Qin Xu asked a few times but didn’t receive a response, so he proceeded to grab a chicken leg from Jiang Yang.</p><br/><p>Jiang Yang poked his sore spot, “You’re not afraid of getting acne?”</p><br/><p>Qin Xu stubbornly said: “I don’t care.”</p><br/><p>“Then I won’t kiss you.”</p><br/><p>“………!!!” Such a big blow. Qin Xu was both shocked and wronged, “Why?!”</p><br/><p>“Unsightly.”</p><br/><p>Qin Xu could only gently put the fragrant chicken back into Jiang Yang’s pot and slowly retract his hands. That appearance of his looked particularly pitiful and those seeing it couldn’t help but feel bad.</p><br/><p>Jiang Yang shrugged and ignored him. He continued to eat his chicken clay pot.</p><br/><p>They didn’t have classes in the afternoon so after finishing their meal, they went back to their apartment to play games.</p><br/><p>After the military training, the two of them had rented a place near the school and lived there together. They initially thought that like this it would make things more convenient for them if they wanted to act lovey-dovey and touchy-feely. They also wouldn’t have to sneak around at school hiding from the others.</p><br/><p>But they obviously overestimated their own endurance. With the person that they like so close to them, with such a convenient environment and also because they’re still hot-blooded youths, after only living together for two days the two had already rolled around in the sheets.</p><br/><p>When it was over, Qin Xu grinned very stupidly, like he had just achieved something major. No matter what you did, the corners of his lips couldn’t be pressed down. Jiang Yang who was still in pain saw this and wasn’t happy about it. He threw a kick over, but Qin Xu agilely caught onto his ankle. Jiang Yang was not only unsuccessful, he was also tickled. He was tickled until he couldn’t fight back, and Qin Xu used this opportunity to lift Jiang Yang onto his lap so that the two faced each other.</p><br/><p>The next moment, Qin Xu started showering soft kisses onto Jiang Yang. At the beginning, Jiang Yang struggled with dissatisfaction, but he soon fell into trance. He unconsciously reached out to cling tightly onto Qin Xu and the two held onto each other tightly like they were about to become one.</p><br/><p>Weekend.</p><br/><p>Qin Xu suggested that they should go out for a date. Jiang Yang didn’t want to move so when he was putting on shoes to leave, his eyes were filled with resentment that said ——– Why the hell are we going out on such a hot day? Du you want to die?</p><br/><p>Qin Xu saw this and couldn’t help but laugh. He kissed him and said: “If you don’t want to go out we can stay at home and play games?”</p><br/><p>Jiang Yang stood up and licked his lips. He opened the door and stepped out, “Already put on shoes.”</p><br/><p>Qin Xu’s lips curved upwards. He grabbed the keys and followed him out.</p><br/><p>Because it was hot, they naturally went to places with air-conditioning.</p><br/><p>They went to the cinemas together to watch the new action movie. Skydiving, helicopter battles, climbing cliffs – the film was packed with action and excitement.</p><br/><p>When then left the cinemas, they decided to go shopping and see if there are anything that they wanted to buy.</p><br/><p>At that time, they saw quite a few people selling balloons on the roadside. It was rich in colour and there were also a lot of character designed balloons. The children that passed by would beg their parents to buy it for them.</p><br/><p>Jiang Yang only remembered now. That’s right, today is Children’s Day.”</p><br/><p>“Want?”</p><br/><p>Next to him he heard Qin Xu’s deep and sexy voice that had a hint of a smile. Jiang Yang was stunned for a moment. His ears were a little red and he subconsciously retorted: “How can that be?!”</p><br/><p>“If you want it, then you want it. Don’t be shy. I’ll buy it for you.” Qin Xu winked at him and really did move towards a stand selling balloons. Jiang Yang couldn’t respond in time to stop him and could only stand helplessly on the side waiting for him.</p><br/><p>After a while, the big child Qin Xu walked out of the crowd of little children with a pink Peppa Pig balloon in his hand and walked leisurely over to Jiang Yang.</p><br/><p>Jiang Yang had a cold expression. He didn’t want it.</p><br/><p>Qin Xu however chuckled while grabbing onto his hand. He tied it to his wrist and said: “If the other children have it, you should also have one.”</p><br/><p>“Bastard, who is a child.” Jiang Yang impatiently waved his hand asking him to untie the balloon.</p><br/><p>Qin Xu just grinned: “You of course. You are my child.”</p><br/><p>Jiang Yang heard this and felt his scalp go numb, but he also couldn’t help but smile. The smile flashed through his face for a brief moment before it returned to his usual scowl. In the end, Jiang Yang didn’t throw away the balloon. He just pulled it down and reluctantly held it in his arms.</p><br/><p>How can he be so cute?</p><br/><p>Qin Xu smiled and took his hand.</p><br/><p>With interlocked fingers, their body temperature melted together until you could no longer distinguish between the two.</p><br/>\n</div>"}