{"title": "Chapter 79 (END) - Wu Tong X He Shuo", "id": 79, "volume": 1, "url": "http://boxnovel.org/love-rival-romance-system-chapter-79-end-wu-tong-x-he-shuo", "volume_title": "Volume 1", "body": "<h1>Chapter 79 (END) - Wu Tong X He Shuo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong>Chapter 79: Wu Tong X He Shuo</strong></p><br/><p>After his university roommate inadvertently saw Hue Shuo’s girlfriend, he envied him a lot. He even asked him to teach him how he managed to snag such a beautiful goddess. If they’re friends, he should teach him some tricks. As a single dog, he was almost going to die from jealousy.</p><br/><p>Wu Tong is a beauty. There is no doubt about it. Anyone who see’s him couldn’t help but be amazed by his pale skin, beautiful features, stunning figure and gentle personality.</p><br/><p>He Shuo likes his girlfriend a lot. Even after being together for two years, he would still feel helpless from time to time. He even felt that he was not worthy of her and that she is too good for him.</p><br/><p>His roommate asked him how he managed to get together with Wu Tong and he started to get lost in his thoughts.</p><br/><p>It wasn’t he who had pursed Wu Tong. It was Wu Tong who confessed to him first. After saying this, not only his roommate, even he couldn’t understand it. There were obviously others who were more handsome, and better than him so why did Wu Tong choose him?</p><br/><p>He Shuo is about one metre ninety tall and has a muscular body. On top of that, he had a very manly appearance and a buzz cut. In anyone’s eyes, he looks like a manly man that even gangsters would deliberatly move away from when he walks down the street. But, in reality, he isn’t so strong. It was in fact the opposite. Perhaps it was because he grew up in a single-parent family, he had a delicate and sensitive heart and he is particularly concerned about people’s impression of him.</p><br/><p>Since he was a child, he watched his mother raise him up while putting in all kinds of blood, sweat and tears. He felt particularly distressed for his mother and wished that would grow up soon and start earning money so that he could take care of his mother instead. It was also because he felt bad for his mother that he decided that if he had a girlfriend in the future, he would definitely treat her well and not make her sad.</p><br/><p>He didn’t know what his future girlfriend would be like, but he didn’t expect it to be someone as beautiful and great as Wu Tong. Wu Tong was beautiful to the point that he was a little overwhelmed. It was his first relationship and he was still immature, so he relied heavily on Wu Tong to guide him though. Despite being a man, his girlfriend would be the one deciding on where they should go for their date and how they should progress their relationship. Thinking about how useless he is, he hung his head in disappointment. He clearly wanted to protect his girlfriend and allow her to be carefree and happy.</p><br/><p>Once, he couldn’t help but ask Wu Tong what he felt about being with him. Wu Tong didn’t hesitate to smile radiantly and say: “I’m very happy.”</p><br/><p>He Shuo was a little confused but after that it was as if Wu Tong noticed something and he had given He Shuo the authority to decide where they should go next and plan out their dates.</p><br/><p>Therefore, He Shuo felt deeply responsible. He carefully researched about dating sites, activities and food to create an intricate plan. He even asked for his friends’ opinion. After seeing it, the friend immediately wacked his head, “Are you dumb? With you writing so much, do you think your girlfriend is someone as tough and manly as you? Do you want to make her walk until her leg breaks?”</p><br/><p>His friend angrily deleted and altered his date plan and did his best to make the itinerary more reasonable. The places that they were going were also not too far, at most it would be just a few stops away by subway.</p><br/><p>After it was done, He Shuo looked at his plans that had the majority deleted with a look of pity: “Those are places that I wanted to go with her.”</p><br/><p>His friend couldn’t help but scold, “You can go next time. Do you think you’re only going out on a date once?”</p><br/><p>He Shuo scratched his head and a silly smile formed on his face. He looked up with enthusiasm. “That’s true.”</p><br/><p>Friend: “………” Sure enough, love makes people stupid. But he also wants a chance to become stupid!</p><br/><p>Under his friends’ guidance, the date that He Shuo had prepared for was completed successfully. Before they parted, He Shuo even asked nervously if Wu Tong was happy.</p><br/><p>Wu Tong turned to look at him with a gentle smile, “Happy.”</p><br/><p>Then, He shuo was even more happy. He smiled very happily and waved his hand before preparing to turn and leave. But at this moment, something flashed before He Shuo’s eyes and he felt a soft and warm, cotton-like sensation on his lips. His mind went blank and he only realised that it was Wu Tong’s lips after they separated. His face instantly flushed red and he stood dazed on the spot.</p><br/><p>Wu Tong seemingly found his reaction funny. The curve of his smile became bigger and he even licked his lips while saying: “With this, I’m even happier today.”</p><br/><p>He Shuo: “…………..” He was shocked to the point that he was at loss for words. He finally returned to his senses when Wu Tong figure had already disappeared into the distance. Even his first kiss was something done because his girlfriend took the initiative!</p><br/><p>Thinking this, he wanted to bang his head on the wall and then beat himself up.</p><br/><p>Their emotional progression was very smooth and stable. Compared to other couples, it could be said that it is particularly good. They rarely had arguments and every day was simply dripping with honey.</p><br/><p>But this didn’t mean that they have no troubles.</p><br/><p>He Shuo’s biggest concern was that his girlfriend is just too good. When he said this, it made others feel hatred for him for showing off his love but He Shuo really meant it. Sometimes, he could sense that Wu Tong was hiding something from him and just doing his best to act like the image he had established of himself.</p><br/><p>He understood that people will change in front of the person that they like and that they would deliberately show their best sides. It was a good attitude but, after getting along over time, he didn’t want his girlfriend to act all the time. He felt that they should reveal some bad habits and he could just tolerate it. Afterall, he felt that his girlfriend is tolerating a lot more things about him. It wasn’t fair like this.</p><br/><p>Although he thought this inside, he never said it to Wu Tong.</p><br/><p>Perhaps somewhere deep inside, the more he worried, the timider he had become.</p><br/><p>He couldn’t help but be worried. If Wu Tong isn’t willing to tell him, is it because it was something that he couldn’t accept? Thinking this, he didn’t dare to ask and even tried to escape from it.</p><br/><p>Later, He Shuo went to find Wu Tong without telling him in advance. He inadvertently ran into him chatting with his friend. Looking at that scene, he was definitely acting very differently compared to when he was with He Shuo.</p><br/><p>Relaxed and lazy,</p><br/><p>Wu Tong rested his elbow on the railing and leaned back with a cigarette held between his fingers. He took a drag and slowly spat it out. The smoke lingered around, blurring his face. He wasn’t gentle like how he was when he was around He Shuo. He had a rather cold expression. With one look, you could tell that this was his true unmasked self.</p><br/><p>Xu Jun stood next to him also smoking a cigarette. His actions were a little rougher than Wu Tong’s. He tapped off some ash into an empty box next to him and then asked nonchalantly: “You’ve been together for so long and you still opened it up to him?”</p><br/><p>Wu Tong raised his eyes and just continued to concentrate on smoking. He ignored him and didn’t answer.</p><br/><p>Xu Jun didn’t care about him trying to hide from the truth. He reminded as a friend, “You can’t always hide it from him. It’s unfair for He Shuo.”</p><br/><p>“I know.” Wu Tong answered impatiently. He appeared quite reluctant to talk about this matter.</p><br/><p>He Shuo was a little surprised. His mind was a mess. Xu Jun just mentioned me? What did he mean that it’s unfair to hide it from me? Don’t tell me Wu Tong is cheating and hasn’t thought of a way to break up with him?</p><br/><p>Before he had the chance to think about it anymore, he had already subconsciously stepped out and walked into Wu Tong’s line of sight.</p><br/><p>When Wu Tong heard his movement, he looked over and a hint of panic, confusion and surprise flashed through his eyes. He didn’t expect him to be here. He quickly hid the cigarette behind him.</p><br/><p>Xu Jun was also surprised but seeing that spineless reaction of Wu Tong’s he shrugged his shoulder and said with interest: “I’ll leave first.” He then turned around and left.</p><br/><p>Wu Tong was frustrated to death. He madly tried to figure out when He Shuo had arrived and what he had overheard. They didn’t say what he was hiding from him earlier did they?</p><br/><p>He Shuo saw his face constantly changing. The usually soft and gently expression had become filled with panic. He Shuo pursed his lips and only spoke up after a long time: “You’re hiding something from me.”</p><br/><p>His straightforwardness stunned Wu Tong. But it was also a fact that could not be denied so he could only nod his head in affirmation.</p><br/><p>He Shuo: “Can you tell me?”</p><br/><p>Wu Tong paused and shook his head.</p><br/><p>He Shuo laughed at himself and then turned to leave.</p><br/><p>Wu Tong chased after him, “Are you angry?”</p><br/><p>He Shuo’s expression didn’t change. He slowly pried off Wu Tong’s hand that was holding onto his and said faintly: “We should both calm down a little.”</p><br/><p>This time, he really left. The moment he turned away, he saw Wu Tong’s sad expression. He found it a little funny. Clearly he’s the one hiding things from him so what is he upset about?”</p><br/><p>After saying that they should calm down, He Shuo didn’t meet with Wu Tong again. When others asked, he would say that they’re busy and didn’t have time to date.</p><br/><p>But in the end, they didn’t break up. It was just a cold war. At least, it was a unilateral cold war on He Shuo’s end. On WeChat, messages from Wu Tong quickly built up. All the messages were filled with placating words and the tone was filled with a hint of humbleness. He Shuo didn’t reply but he read each of them seriously. The more Wu Tong tried to placate him, the more his heart sank. What on earth is he hiding from him? Acting like this, if it is because she has another man, she should just clearly cut him off. What kind of man would happily accept being cheated on?!</p><br/><p>Others didn’t know their situation and only know that their relationship is good and very lovey-dovey. But when this happened, they already had an outing organised. The organiser saw that they’re a couple, so he arranged them a room together. Because he didn’t have the time to pay attention to anything else, He Shuo only found out about this on the day and it was too late to change. They came in order to participate in the light festival. There were people everywhere and hotels have long been booked out.</p><br/><p>When the organiser saw that his expression didn’t look right and asked nervously, afraid that it would trouble the other person, He Shuo said that it was nothing. He thought, it’s a twin room anyway and it wasn’t just one bed. He could just bear with it and get through one night of awkwardness.</p><br/><p>Sure enough, it was just as he had thought. In the evening, there were crowds everywhere and the light festival was extraordinarily lively. When Wu Tong stood next to him, he still subconsciously wanted to protect her from getting hit by the crowd. He Shuo was a little surprised by those natural actions of his but he continued to maintain a calm expression while he protected her. There’s no need to let Wu Tong get hurt just because of a small conflict between them.</p><br/><p>He clearly didn’t know what kind of unspeakable secret his girlfriend is hiding from him, but he still stubbornly protected her. He Shuo felt that he really is stupid.</p><br/><p>When they returned to the hotel, Wu Tong opened his mouth several times wanting to talk to him but after they left the group, He Shuo naturally increased the distance between them and didn’t give her any attention. After several failed attempts, he seemingly accepted defeat and remained quiet.</p><br/><p>For an entire night, they didn’t speak a word.</p><br/><p>The next morning, when He Shuo opened his eyes, his mind was still not completely awake. He looked blankly around the room as he slowly remembered where he was. Suddenly, a large patch of snow-white skin, a beautiful arc of the back and a slender waist came into view………</p><br/><p>Wu Tong was changing clothes!</p><br/><p>When He Shuo realised this, his heart leapt. In an instant, he wanted to look away but the second before he could do that, Wu Tong had slowly turned around and he saw a flat front.</p><br/><p>He Shuo had forgotten to look away and was shocked by the unbelievable scene.</p><br/><p>Short hair, flat chest, smooth and prominent muscles and below his waist…..</p><br/><p>This was a man who looked exactly like Wu Tong.</p><br/><p>He Shuo laid in bed and was caught off-guard when their gazes met.</p><br/><p>Without even needing to think, he knew that it would be impossible for a man and woman to look exactly the same with not a hint of difference. Even if they were twins, they would look different. There was only one explanation for this man standing before him.</p><br/><p>The air went stagnant for a few seconds.</p><br/><p>He Shuo: “You’re a man?”</p><br/><p>The man nodded.</p><br/><p>He Shuo: “This was what you were hiding from me?”</p><br/><p>The man again nodded.</p><br/><p>He Shuo released the tight grip of his blankets and got out of bed with a cold expression. He washed up, changed and then left the room. Throughout the whole process, he didn’t give a single glance in Wu Tong’s direction. Wu Tong also didn’t chase after him or ask him to stay.</p><br/><p>After a long period of time, the two didn’t meet. He Shuo’s dense roommate also noticed that something was wrong. He asked: “What happened between you and your girlfriend? A fight?”</p><br/><p>The roommate wanted to ease his mood and joked: “Don’t tell me the other person discovered your bad skills and you ended up hurting her?”</p><br/><p>Another person smacked him: “How can that be? Our He Shuo is a good child. How can he do that to his girlfriend?”</p><br/><p>“You guy’s should stop talking about those things. It’s his business so he will deal with it himself. But He Shuo, seeing you acting like this, it’s obvious you still have feelings for her. Why don’t you talk to her to clear things up? You’ll be the one regretting it in the future. I’m giving you this advice as a brother. You can see as you fit.”</p><br/><p>In fact, He Shuo really didn’t know what to do.</p><br/><p>In the past he really loved her, but now he is troubled.</p><br/><p>To be honest, when he found out that Wu Tong’s secret wasn’t the fact that she had another guy, a part of him was elated. Even he was surprised by this reaction of his and he later scolded himself for being stupid. Your girlfriend just turned into a boyfriend. This is a huge problem okay?! What are you feeling elated for?!</p><br/><p>After they left the hotel, He Shuo only received three messages from Wu Tong. Compared to the previous messages from before, these messages were more concise, upset and desperate.</p><br/><p>“Ah Shuo, are you angry?”</p><br/><p>“Do you want to break up with me?”</p><br/><p>“Don’t break up okay? Please.”</p><br/><p>Even if it wasn’t a voice message, He Shuo could tell how desperate he was through those words.</p><br/><p>As for the thing about Wu Tong being a man, in fact, He Shuo didn’t really care about that. What he was more concerned about was why Wu Tong would deceive him. He hated being lied to. But really, if Wu Tong and he were both men, if you asked him whether he would be willing to continue being together, he wouldn’t be able to answer immediately. His decision would depend on what he cared more about. Wu Tong was special to him. He had already surpassed everything and all he cared about was the person called Wu Tong. But he was deceived from the very beginning and he was shocked by this discovery, so he didn’t know how to face Wu Tong. Like this, he kept dragging things out and he never sent back a reply.</p><br/><p>This kind of negative emotion enveloped him and, seeing this, his roommates complained about him acting like life no longer had any meaning. They even started discussing about the difference between a man and a woman after breaking up. With He Shuo acting like an empty shell, Wu Tong’s side would probably start off with a storm of crying, but she would soon recover from the sadness and continue on with life. They said this trying to convince He Shuo to cheer up.</p><br/><p>But He Shuo maintained this state until one day he received a call. Through the phone, he heard Xu Jun’s voice.</p><br/><p>“Hey, he’s drunk. Keeps calling your name. So annoying. I’m leaving him here so you should hurry and come over.”</p><br/><p>After leaving the address, he didn’t give the other party a chance to refuse and immediately hung up.</p><br/><p>After hesitating for a while, He Shuo still went.</p><br/><p>When he arrived, he saw Wu Tong wearing men’s attiure and looking stunning, but he laid sprawled pathetically across the table. His consciousness wasn’t clear, and his face was flushed red from the alcohol. He looked like a poor and innocent puppy that was abandoned by its master.</p><br/><p>He Shuo picked the man up and carried him out. Because he didn’t know where Wu Tong’s place was and he couldn’t find Xu Jun, he could only bring him over to a nearby hotel. Xu Jun who sat in the corner quietly observing them saw him take the other person away and scoffed. After a few more drinks, he felt bored drinking by himself and also left.</p><br/><p>What was fortunate was that despite being drunk, Wu Tong could still be considered rather well-behaved. He didn’t act crazy and only mumbled incoherently. He Shuo leaned in to try and decipher his words and realised that he was constantly repeating and apologising.</p><br/><p>“Ah Shuo, I’m sorry….”</p><br/><p>He Shuo pursed his lips. He opened the room to the hotel room, dragged the other person inside and threw him onto the bed with much difficulty. Although Wu Tong was a little shorter than him but, as someone who is one metre eighty, he was not light. In addition, he was drunk and didn’t know to cooperate, so it made the task very difficult.</p><br/><p>Wu Tong clung onto him like a koala, unwilling to let go. He continued to protest vaguely when the other person tried to pry him off. The warm alcohol filled breath could be felt on his neck and this made He Shuo stiffen up. His neck felt itchy and the places where Wu Tong touched felt hot. His heart pounded helplessly fast.</p><br/><p>After a moment of distraction, He Shuo didn’t know what happened but the next second, he found himself being pressed down onto the soft bed. On top of him was a warm body that was covered in the smell of alcohol.</p><br/><p>Wu Tong’s face was very close to his. It was also at this moment that He Shuo realised that the other person had already sobered up significantly and had taken this opportunity push him down.</p><br/><p>“I want to kiss you.” Wu Tong’s voice was low and hoarse. Within those words were strong desire and emotions. He took the risk and very straightforwardly expressed his thoughts. The next second, his tone softened down and became humbler. Without a lack of confidence, “I beg you. Okay?”</p><br/><p>He Shuo looked at him and didn’t speak. And then, he didn’t know what came over him – perhaps it was because of the sadness in his eyes making him feel bad, he lifted his head up and kissed Wu Tong’s lips.</p><br/><p>Wu Tong stiffened up at this before responding vigorously by sucking his lips. It was so fierce that it was as if he wanted to absorb He Shuo into him.</p><br/><p>An unknown amount of time passed, and their lips finally parted. Wu Tong lightly pressed onto his lips and asked carefully: “………Have you forgiven me?”</p><br/><p>There seemed to be a hint of trembling in his voice that made He Shuo feel uncomfortable.</p><br/><p>He Shuo looked at him seriously and said, “Yes, I like you.”</p><br/><p>Because I like you, I don’t care if you’re a man or a woman.</p><br/><p>He Shuo had decided. Before, he didn’t think over things properly. Even if he is not a girlfriend, he likes him so they can still be together. He could still pamper him the same and he didn’t need to think too much about it.</p><br/><p>He wants to spoil Wu Tong. Later he would realise that he would end up being spoiled more instead.</p><br/><p>The two insecure boys cuddled closely together and unexpectedly found it quite fitting.</p><br/>\n</div>"}