{"title": "Chapter 7", "id": 7, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-7", "volume_title": "Volume 1", "body": "<h1>Chapter 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>In Duke Ling’s mansion, there was a new son, a new fat grandson.</p><br/><p>General Ling finally had his first son! Both mother and son were safe, with the weight of the newborn child reaching a whole nine catties and two taels!</p><br/><p>This matter spread like a tsunami, alerting all of the upper echelons within the Sky-Bearing Empire! Apart from the high status of Duke Ling and General Ling, the Ling family was one of the six biggest aristocratic families which held the most authority in the world! Duke Ling, Ling Zhan, was the family head of this large family! Be it in terms of wealth or manpower, the Ling family was positioned well at a frightening level!</p><br/><p>The next instant, the gates of the Ling family were filled with a long queue of people, an endless crowd bustling to give their blessings to the Ling family. Not to mention the Yang family who was in the same empire, even the other four families from the other two continents had sent people over to congratulate the Ling family. Even the emperor of the Sky-Bearing Empire paid a personal visit to the Ling family before the first full month of young master Ling…</p><br/><p>In the Sky-Bearing Empire, almost everyone knew that Duke Ling and the late emperor were sworn brothers who were life and death comrades! Of the large territorial lands of the Sky-Bearing Empire, at least half of them were captured by Duke Ling! No one in the empire was able to match his large contributions to the empire!</p><br/><p>As for General Ling Xiao, he was one of the pillars within the empire’s army today! At least a third of all the troops were within the control of General Ling. The amount of authority he held was comparable to even the prime minister, Yang KongQun of the Yang family!</p><br/><p>Apart from these, General Ling and the present emperor were like brothers and grew up together since young. Furthermore, the only sister of General Ling was Consort Ling, who had a status only lower than the empress in the imperial palace.</p><br/><p>Who would dare to look down on such a family?</p><br/><p>Before Ling Tian was even a month old, two warehouses which the Ling family built beforehand to store the various congratulatory gifts were completely full. Furthermore, the guest rooms in the Ling family were completely full during this period! The bright laughter of Duke Ling would sound ever so often and General Ling who was gloomy over having no descendant had completely brightened up! As for the charitable old madam Ling, she donated 10,000 taels of silver to aid the victims of disasters. All of a sudden, all of the poor families had erected a longevity tablet for old madam Ling.</p><br/><p>After Ling Tian understood all of these matters, he was not only unhappy but also extremely worried! Just as the saying goes, anything which is at its limit would easily falter. Presently, the authority which the Ling family possessed was already at a dangerous level! It was able to threaten the authority of the imperial family already! This was definitely not a good thing!</p><br/><p>It was impossible for a family this strong to not draw the attention of the imperial family! Perhaps now the Ling family was deeply rooted within the empire and couldn’t be easily provoked. Another reason was that the empire was still young, with troubles brewing internally and externally. Thus, the Ling family was still needed to subdue any chaos. As such, the authority of the Ling family would still be on the uprise for a short period of time. However, when the imperial power was firm with both internal and external troubles gone, it would also be end of the line for the Ling family!</p><br/><p>Any large empires would not be able to accept the existence of such a large power like the Ling family! Getting rid of anything once their purpose had been served had been the way history had always taken place. In comparison to authority, all friendship and brotherhood seemed dull and useless. This was politics.</p><br/><p>Ling Tian felt that he definitely had to take some precautionary measures and do something about it. His grandfather, Ling Zhan, had already passed his prime and his father, Ling Xiao, was deadly loyal to the empire and was trapped by his friendship with the emperor. If things were to go on like this, the destruction of the Ling family would be inevitable!</p><br/><p>Now, the Ling family had its own rightful successor who was a male. This would definitely make the empire even more suspicious and wary! After all, it was far too easy for the Ling family to stage a rebellion with its authority and power.</p><br/><p>After he was certain of his family’s situation, Ling Tian realized that he was born in the middle of a tsunami! It was as though he was born atop a volcano! He inevitably became the focus of all the big families! With regard to such a situation, Ling Tian could only laugh bitterly in his heart.</p><br/><p>Ling Tian understood that if he were to just be a little outstanding when he grows up, the Ling family would be in an even greater danger! Thinking about this, Ling Tian just wanted to cry out, After putting up an act for the whole of my previous life, don’t tell me I would still</p><br/><p>The only thing that Ling Tian felt happy about was that his name had finally been decided after a night of discussion among his parents and grandfather. What made Ling Tian the most surprised was that his name was the same as the one in his previous life, Ling Tian!</p><br/><p>Dammit, not only did I come here with my memories, but also with my name, Ling Tian thought to himself.</p><br/><p>Just when he was happy, he could not help but curse as well! Curse his stupid grandfather and foolish-looking father!</p><br/><p>They are just two political idiots! They do not have any sense of politics in them! If they were to be described with the words from my previous life, they are simply complete idiots!</p><br/><p>In his previous life, the name “Ling Tian” wasn’t considered much. In fact, it was considered an extremely ordinary name with some grandeur. But in this world where there were still kingdoms and empires, this was a rebellious name! Ling Tian estimated that if this world was like the Qing dynasty of his previous world, just his name alone would guarantee that his whole family would be beheaded. [1]</p><br/><p>Regarding how clueless his father and grandfather were towards politics, Ling Tian was completely speechless.</p><br/><p>Ling Tian also gave the Ling family a big surprise! He refused to have any of the milk from the healthy nanny whom old madam Ling specially found! Every time the nanny placed her ** at his mouth, this brat would shift his head to the side and reject it! He would rather wail from hunger and refuse to eat it! This made old madam Ling completely worried.</p><br/><p>What a joke! The breast milk from my own mother is the best choice for me to grow up healthily! What’s so nice about the milk from those ladies without any blood relations to me? They are nothing more than just cows in human form! If you want me to drink their milk, why not just let me drink the milk from cows? Of course, Ling Tian had plans in his heart when he rejected them.</p><br/><p>Out of her love for Ling Tian, Chu Ting’er insisted to hug her child in her embrace. What she did not expect was that the moment Ling Tian was in the embrace of his own mother, he became extremely cooperative, drinking the milk with large gulps with a face full of happiness.</p><br/><p>Old madam Ling was worried because her daughter-in-law’s body was already slightly weak to begin with. Furthermore, Ting’er had just given birth and old madam Ling was worried that her body could not take it. She was even more afraid that Ting’er could not produce enough milk, starving her grandson. Thus, she always came and took a look every now and then. However, she never expected that after a whole month, Chu Ting’er was not only unaffected by taking care of the child, but also even healthier than before she was pregnant and filled with more energy.</p><br/><p>Ling Tian was secretly delighted. When he was first born, he had already realized that his mother’s body was extremely weak. After going through child delivery, her body was on the verge of breaking down.</p><br/><p>Ling Tian did not want to experience the sadness of losing his mother at such a young age. Thus, he secretly used his pure XianTian Qi to take care of his mother’s meridians and repair the damages in her body while he was drinking milk. The effect was indeed extremely good! As long as Chu Ting’er did not run into any accidents in future, Ling Tian was certain that she would definitely be able to live to a ripe old age.</p><br/><p>Ling Tian surprised the Ling family in another aspect: ever since he was born, he had never once urinated on the bed! Even if he had to bear with it until his face turned red, he did not urinate on the bed. Instead, he created a commotion with his arms and legs in order to remind the adults behind him that he needed to urinate. This… was simply a genius!</p><br/><p>Every time there were guests in the family, his mother and grandmother announced this fact with pride. Without fail, it drew gazes of envy and looks of shock from everyone, followed by a wave of praises.</p><br/><p>With regard to his mother and grandmother boasting about the fact that he would not urinate on the bed, Ling Tian felt extremely depressed! No matter what, I have a mental age of over 25 years old. How is it possible that I would still do something like that? If you want a 25-year-old teen to urinate on the bed, why don’t you ask a carnivore to eat only vegetables?</p><br/><p>As the days passed, the Ling family found another strange thing about young master Ling. This young master never cried or threw a tantrum. His actions were regulated to the point it was scary! When it was time to sleep, he would close his eyes obediently and fall asleep. When it was time to drink milk, he would open his mouth without a need for anyone to coax him. When he wasn’t eating or sleeping, he was also extremely obedient. He would either listen to the adults talk with interest or lie by the side quietly and play on his own. Almost everyone who saw the young master said that they had never seen a child so obedient!</p><br/><p>As such, the legends of the young master of the Ling family spread widely till everyone in the Sky-Bearing Empire knew that he was a super genius.</p><br/><p>[1] Ling Tian in Chinese means to rule the heavens.</p>\n</div>"}