{"title": "Chapter 2", "id": 2, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-2", "volume_title": "Volume 1", "body": "<h1>Chapter 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>It was the ninth day of the ninth lunar month. The cool autumn winds blew and the sky was a beautiful blue.</p><br/><p>Today was not only a meaningful day of celebration for the Chinese [1], but also a day where two of the largest families of the country, or even world, were having a marriage!</p><br/><p>The young lady of the Ling family, Ling Xue’er, and the young master of the Huang Family, Huang JiaYun, were going to broadcast their marriage to the world today. The location of the wedding was the Huang family mansion by the Eastern Ocean!</p><br/><p>A month ago, the Huang family renovated this mansion to make it look like a palace: luxurious and magnificent as though it came out from a painting.</p><br/><p>Half a month ago, guests from all over the world had begun to arrive. They were afraid that they would miss this wedding and the chance to cling onto some global big shots. As time grew near, the main characters from both families had yet to arrive, but the Huang family mansion was already filled with people. The skies were filled with colorful banners flying with the winds, and the mansion was like a sea of rose petals.</p><br/><p>Following which, the deafening sound of the rotating helicopter blades filled the skies as two helicopter squadrons slowly flew over with a majestic grandeur. A completely red helicopter took the lead in the center and to its left and right were nine helicopters! Colorful strips of streamers were let out as they flew past, making it seem like the 19 helicopters were riding on a rainbow from afar! Such a formation could only be described as “mind-blowing”!</p><br/><p>This was the escort fleet of the Ling family!</p><br/><p>In the age when the tradition of marriages was to fetch one with a wedding car, the Ling family made history with a helicopter escort!</p><br/><p>As the luxurious escort fleet was revealed, the crowd immediately broke out into a thunderous applause.</p><br/><p>At ground level, an earsplitting gun salute sounded as pairs of gorgeous couples gradually disembarked from the helicopters. Just at this moment, everyone’s view was blocked by the rose petals which filled the skies and everyone was only capable of seeing a sea of rose petals. Only after the helicopter landed on the ground did the fragrant roses scatter all over, filling the mansion with a lovely fragrance and painting the whole mansion a bright red. It was as though the rosy clouds from the morning sky were forcefully dragged down, transforming the mansion into a blood red color.</p><br/><p>A young lady was dressed in a pristine white wedding gown with a face full of smiles. She looked as though she had gracefully descended from the skies like a fairy as she stepped on the rose petals. She was the bride of today: the Ling family’s Ling Xue’er.</p><br/><p>Such a beautiful scene made everyone dumbfounded, especially the leisurely arriving beauty who could not help but make everyone feel a sense of inferiority. Seeing her slowly approaching, everyone instinctively let out a path for her.</p><br/><p>In the sea of rose petals, a young suave man stood there dressed in a black suit. He was Huang JiaYun, the groom and the young master of the Huang family. Upon seeing the both of them, everyone could not help but exclaim in their hearts: What a perfect pair!</p><br/><p>Huang JiaYun was extremely excited, because no one understood what this marriage meant better than him! After this marriage, he would become the spokesperson within the younger generation of the Huang family! Even in the world, he would be someone with sufficient authority! Furthermore, Ling Xue’er was the dream girl in his heart. Today, he could finally fulfil his ambitions and bring the beauty home!</p><br/><p>He ignored the envious gazes and complicated expressions of his brothers beside him; after today, they would all be at his beck and call. Now, he no longer had to care about them at all! His status was already set in stone and nothing could change it anymore. Meanwhile, Huang JiaYun walked towards the beauty with a carefree smile!</p><br/><p>As though they were the center of the universe, everyone escorted the groom and bride towards the center of the hall—everything was completely following Ling Tian’s plans!</p><br/><p>The marriage was both grand and festive, in accordance to the traditional customs of China.</p><br/><p>Just when everyone was gathered in the main hall giving their blessings, a clear voice suddenly resonated throughout the place, “Younger sister Xue’er, today is your big day and this brother here came from a few thousand kilometers away just to give you a gift!” This voice was extremely clear, slow and steady, void of any tinge of emotion as though it was just a casual conversation.</p><br/><p>Ling Xue’er, who was undergoing the traditional rituals of marriage, began to tremble all of a sudden! Her facial expression then revealed anxiousness and guilt filled her eyes.</p><br/><p>Everyone from the Ling family’s expressions immediately changed! They had already recognized who the voice belonged to! They hadn’t heard this voice for eight years and they never expected to hear it again during such an important occasion!</p><br/><p>Everyone from the Ling family was not an idiot. They all knew that the event back then was a preplanned trap. Furthermore, that single trap executed by just one woman destroyed the rare genius of the Ling family side branch! After that incident, when the elders in the family thought about that event and that person, they were filled with a myriad of emotions. Some felt pity, while some were angry. Others were thankful and relieved as if a burden was lifted off their shoulders.</p><br/><p>Everyone then turned and looked towards the entrance of the hall.</p><br/><p>Under everyone’s gaze, a young man clad in white calmly walked in with both hands in his pockets. He was tall and slim with a composed face and slight smile. He had a unique charisma, and looked extremely carefree and at ease, as though he was a cloud in the sky drifting with the winds.</p><br/><p>Huang JiaYun instinctively felt a sense of danger as he stared at the man in white and questioned, “Who are you?” As he said that, he looked towards Ling Xue’er who was standing beside him.</p><br/><p>Ling Tian naturally knew what Huang JiaYun was thinking about and said laughingly, “Don’t be worried, young master Huang. I am not your love rival. I am Xue’er’s brother, Ling Tian.”</p><br/><p>Only then did Huang JiaYun heave a sigh of relief as he replied energetically, “So it is brother-in-law! Why didn’t brother-in-law come with your uncles and instead came alone?” At the same time, he silently thought to himself: Since when did Ling Xue’er suddenly have an extra brother? How come I didn’t know that? Nonetheless, he was extremely relieved, thinking: As long as he isn’t a man who is here to snatch Xue’er, all is well.</p><br/><p>The first elder of the Ling family, LingJing, then stepped forward and shouted with a solemn expression, “Ling Tian, we can settle our affairs in private! This is not a place for you to create trouble!” Ling Jing was indeed a crafty old fox, as she immediately realized that something was amiss for Ling Tian to be present.</p><br/><p>Ling Tian laughed and said with a sharp gaze, “Ah ah ah, eldest grandpa, then when is the time for me to create trouble? Is it when I rape her again, hmm?” Despite Ling Tian’s wholehearted smile and calm voice, the words he uttered were extremely vicious.</p><br/><p>As Ling Tian spoke, the whole atmosphere in the hall changed instantly! Everyone present began to break out into a commotion. Just who is this man? How dare he single-handedly come here to disrupt the marriage of two gigantic families? Don’t tell me he has a strong backing? Almost everyone present had the same guess.</p><br/><p>Ling Jing’s face became extremely serious because he knew that this grandchild of his was extremely smart and would never do anything which he had no confidence of. Now that he had appeared, today’s matters would definitely not be settled peacefully. However, Ling Jing did not know what Ling Tian’s trump card was. Ling Jing could only make some arrangements in secret to reduce the losses today to a minimum. Ling Jing then placed both his hands behind his back, giving a light wave. In response, all the Ling family disciples began to retreat.</p><br/><p>A teen dressed in a black suit then walked forward and said with a grin, “I was wondering who it was. So, it is the fine young gentleman of our Ling family. I say, little Ling Tian, are you sure you did not take the wrong medicine?”</p><br/><p>Ling Tian replied with a chuckle, “Oh, it is brother Ling Chao. I have not seen you for such a long time. Brother Ling Chao really treated me so dearly back then. This brother here has been so worried for you ever since we separated five years ago. I have been having troubles sleeping thinking of you ever since!” Ling Chao was the one who humiliated Ling Tian the most after his martial arts was crippled.</p><br/><p>Ling Chao then said with a forced smile, “Really? Haha, I really missed this brother of mine dearly. I have always wondered which rubbish chute my brother has been finding moldy bread from. I hope you don’t starve.” He pretended to be extremely concerned, revealing a frown.</p><br/><p>“Hahaha, rest assured, brother. Even if brother Ling Tian can’t find any moldy bread, he would not go hungry. Plenty of vegetables is thrown away at the market every day; I’m sure brother Tian enjoys it a lot!” A sissy voice sounded from a skinny teen behind Ling Chao.</p><br/><p>“A pair of idiots!” Ling Jing cursed in his heart. For Ling Tian to appear out in the open as such, he must have made appropriate plans for his revenge. With Ling Tian’s intelligence, everyone here was already in a perilous situation. But these two idiots were still adding oil to the fuel and angering him further!</p><br/><p>Ling Xue’er took a step forward and with a dreamy look, she said, “Brother Tian, this little sister has let you down regarding the matters back then. But many years have passed ever since. Today is this little sister’s big day, can’t you just take a seat and enjoy a cup of wedding wine peacefully?”</p><br/><p>Ling Tian burst out into laughter and replied gently, “Little sister Xue’er is too serious. I have long forgotten about the past. Today, Ling Tian is here because I have another deep regret in my heart which I must say.”</p><br/><p>Ling Xue’er frowned and asked with an indescribable passion in her eyes, “I wonder what brother Tian can’t put down? If this little sister is able to help, I will definitely do my best to do so.”</p><br/><p>Ling Tian’s eyes then turned cold as he said with a ruthless smirk, “There is a yellow springs road which I should have taken long ago. But I’ve always couldn’t bear to do so—”</p><br/><p>Ling Chao then interrupted with a cold laughter, “That is because you have not eaten enough rubbish, so of course you can’t bear to.”</p><br/><p>Ling Tian ignored him and continued, “—today, I want to walk down that road. But I am just not satisfied.”</p><br/><p>Ling Jing instinctively had a bad premonition and asked, “What are you not satisfied with?”</p><br/><p>Ling Tian then burst into laughter, “I am not satisfied that a bunch of trash like you all will be the ones accompanying me down that road! HAHAHAHA!”</p><br/><p>The Huang family head was immediately startled as he instantly guessed Ling Tian’s trump card, “Explosives?”</p><br/><p>Ling Tian turned to him and praised, “Indeed, you’re worthy of being the head of the Huang family. Your reaction is fast indeed.”</p><br/><p>Ling Jing then roared, “Hurry and capture him, do not allow him to ignite the explosives!” As he shouted, he had already dashed out. He was extremely aware that even if he were to catch Ling Tian now, it was already far too late. Thus, he thought that he should take the chance to leave first, possibly saving his life.</p><br/><p>Ling Tian looked to the skies and burst out with a maniacal laughter, “It’s too late, HAHAHA, it’s too late! If you had escaped from the moment I came in, you may have been able to save your life. But now, HAHAHAHA…” Following the maniacal laughter, an explosion suddenly sounded along with other explosions throughout the mansion. Both inside and outside, all the people could not keep their balance as the ground trembled. The buildings within the mansion were all blown apart and cries of agony were heard all over. The place where the helicopters landed was all blown apart as well, making it seem like the world was ending.</p><br/><p>Ling Tian was unable to stand up straight due to the tremors from the explosion. Sitting on the floor, he said with a hearty laughter as he saw all of the people frantically trying to hide, “Don’t bother hiding. Although the effect of this bomb can’t be compared with the atomic bomb the United States used on Japan, it wouldn’t be too far from it. HAHAHA…”</p><br/><p>A cruel expression filled Ling Chao’s face as he held a short blade. He then roared mournfully, “Ling Tian, even if we are going to die, you will die first!” Then, he charged towards Ling Tian with his blade.</p><br/><p>Ling Tian did not avoid him, letting the blade plunge into his chest as the blood spewed all over. He only continued to laugh out loud maniacally.</p><br/><p>The strongest explosion finally happened as a few mushroom-shaped clouds appeared in the skies. Below, the Huang family mansion could no longer be seen, replaced with a deep crater! The dam from afar was also blown apart, causing the waves to rush in. From then on, there was a new ring-shaped bay in the Eastern Ocean.</p><br/><p>A couple of kilometers away, there was a young lady dressed in black on top of a mountain, with tears all over her beautiful face. The lady in black lit up three sticks of incense and poked it into the ground. Taking a bow, she mumbled, “Brother Tian, have a good trip!”</p><br/><p>[1] On the ninth day of the ninth lunar month, there is a festival called the Double Ninth Festival or Chong Yang Festival.</p>\n</div>"}