{"title": "Chapter 19", "id": 19, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-19", "volume_title": "Volume 1", "body": "<h1>Chapter 19</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>The cold winds blew mercilessly in one’s face. With the abrupt stop of the snowfall, the sky and earth was left in a blanket of silvery white color.</p><br/><p>Ling Tian felt like giving himself a nice tight slap! At that moment, he could not have been more depressed.</p><br/><p>Looking at the pure white snow all around him, all other colors except white were reflected under the effects of the snow and appeared to be extremely provoking to the eye. And out of all colors possible, Ling Tian was dressed in full black!</p><br/><p>Ling Tian felt as though his mind had short-circuited; he let out a mocking laugh directed at himself. It seemed like his thoughts still followed a certain methodology, and certian choices were subconscious. Following which, Ling Tian, who was running along the eaves of the building, silently stopped as his mocking laugh from before made him recall something.</p><br/><p>Even though he had close to 30 years of experience, compared to those crafty old foxes in this world, his experiences were moot! After all, most of his experiences came from another world and he was the only one in this current world with those experiences. If he were to retain such innate habits and take things for granted, only disaster awaits him at the end!</p><br/><p>HIs style of thinking and methodology needs to be changed!</p><br/><p>His past self only faced the influence of a family’s direct descent and yet was already pushed into a disadvantageous situation, having to endure excessive sufferings. However, what he faced currently was not just the internal strife within the family, but also the problem of his family’s existence and other families with equal power. In fact, what he had to face in these clearly troubled times were not just a few families or countries, but the entire world!</p><br/><p>In this life, although his current situation looked rather peaceful, in reality, it had already long exceeded his previous life in terms of viciousness! At the slightest wrong move, he would die and have his soul dispersed, with his family clan becoming history! As such, he had no choice but to exercise prudence.</p><br/><p>One must know that by bringing memories of two lifetimes to this world, what one grasped would ensure that he would not end up being mediocre. His abrupt rise would not be a coincidence, but rather, an inevitable truth! However, once he rises up, he would have to face those forces which he had thought of!</p><br/><p>Shaking his head, Ling Tian dissipated the distressing thoughts that were accumulating in his head. An indifferent smile spread across his face. Since that is the case, then I, Ling Tian, will start to muster my energy to play a good game with this world!</p><br/><p>This made Ling Tian recall a famous novel he had read in his previous life. The protagonist had once said, “Whoever is the most vicious gets to live the longest!”</p><br/><p>The first time Ling Tian read that novel, he was merely thirteen years old. At that time, he could not fully comprehend the underlying meaning behind that phrase. He only realized the true meaning of that phrase when his martial arts were crippled and when all hopes he had turned into dust. The reason why he had been forced into that circumstance was because of his soft heartedness; if he had used all his strength to fight in order to obtain what was rightfully his but ultimately failed, his ending would not be as wretched as his current one.</p><br/><p>However, this was not the only case. Ling Tian’s opponents had also committed the same mistake of being soft-hearted and died because of it. They should have wiped him off the face of the earth after crippling his cultivation. However, by being merciful, they ultimately allowed a crippled Ling Tian to end in mutual destruction with them; this was akin to digging their own graves!</p><br/><p>This is a weakness! I will eradicate this weakness! To be limited to thinking of my past life is a form of rigidity, which also means it is a weakness! Both must be changed!</p><br/><p>Hehehe, be kind-hearted? This shall not happen again! Whoever is my enemy, I will not give him the chance to strike back!</p><br/><p>Having thought through his point, Ling Tian suddenly felt his body relax, as though he had broken through some form of fetters in his heart. Letting out a breath of elation which appeared in this chilly weather as a cloud of white fog, Ling Tian’s body soared through the air, revolving once before disappearing.</p><br/><p>East Striding Court. Deep into the night.</p><br/><p>Inside the inner chambers sat a huge brazier and a badly battered, panda-eyed Ling Zhen lay wrapped up in a thin quilt on the bed. His upper torso was bare, revealing patches of bruises.</p><br/><p>At Ling Zhen’s side, Ling Kong held an ointment on one hand, with the other a bundle of gauze, helping his son to change his medicinal wrappings. Tonight was already the second time changing the wrappings.</p><br/><p>While groaning on the bed, Ling Zhen looked at his father, his little eyes filled with resentment, and said, “Father, this matter cannot be forgotten so easily.”</p><br/><p>Ling Kong arranged the gauze on his hands while saying, “Of course we can’t just forget this matter! Today’s matters are covered in a veil of strangeness. Zhen’er, yesterday, when I had sent you to meet with that kid, didn’t you mention that he was very warm towards you? Why is it that such a matter happened in just half a day?”</p><br/><p>Touching on this matter, Ling Zhen could not help but feel depressed and said, “I, too, don’t know what exactly happened. Everything was so sudden. That little bastard suddenly acted as though he was crazy and started hitting me, and there was nothing to pre-empt me!”</p><br/><p>Hearing this, Ling Kong’s face was suffused with a sinister smile. “This little bastard ought to die! This kind of abnormal behavior can only be a devil’s play! It was just as I thought.”</p><br/><p>Ling Zhen questioned in puzzlement, “Does father also think that this little bastard was behaving abnormally today?”</p><br/><p>Ling Kong replied as he revealed an eerie smile, “Father is not saying that this little bastard was acting out of the ordinary today, but that this little bastard has not been ordinary ever since he was born! Hmph hmph, ever since that Chu Ting’er entered the Ling house, I have secretly ordered people to put Heir Severing Grass into her food! Any woman who has eaten this herb will not be able to conceive for the rest of their lives! But who knows what kind of problem occurred that she managed to give birth to this little bastard!” As he spoke, his face grew more and more miserable.</p><br/><p>Ling Zhen suddenly sat upright, his expressions showing excitement to the point that it turned ruddy, and replied, “If that’s the case, then how is it possible that this kid is their birth child? Could it be that they had secretly adopted him? If that’s the case, as long as we focus on this advantage, the Ling family will still belong to us!”</p><br/><p>Ling Kong then replied with a disappointed sigh, “This kid is definitely Ling Xiao and Chu Ting’er’s child. That year, when I heard that Chu Ting’er had gotten pregnant, I thought that it was impossible too; so I went to all lengths to kidnap the family of a famous doctor in the capital named Ye MengHuai, and got him to diagnose her condition in the Ling family. If the matter was proven false, I would have already made you the successor of the Ling family! However, after Ye MengHuai’s examination, he really confirmed that such a matter existed.”</p><br/><p>Ling Zhen’s face was ruthlessly vicious at this point. “This could be because Ye MengHuai had colluded with the Ling family and we can’t rule out this possibility!”</p><br/><p>Ling Kong could only smile bitterly in return, “I had also considered this problem, and thus I got another six doctors to come to the Ling family to diagnose. All of them said that same thing, that she was indeed pregnant! However, when I had decided to stake it all and get someone to poison her to death, settling the matter once and for all, the chance was already gone! When I was still unprepared, the child had already been born.” Ling Kong could only let out a long sigh and he viciously punched the bedside. His eyes were full of insanity as he continued, “But we still have a chance! As long as I can find an opportune time and get rid of that little bastard without leaving any tracks, then the Ling family will still be mine!”</p><br/><p>Ling Zhen’s childish features flashed a wicked look. In the depths of his eyes lurked an insanity no lesser than that of his father.</p><br/><p>After a moment of silence in the room, Ling Kong suddenly laughed sinisterly, saying, “After that little bastard was born, the Northwest horse ranch had also reached a critical point, and that old fogey sent me over to supervise. All these years, I haven’t had the chance to deal with that little bastard. However, after five years of hard work, the entire Northwest ranch now belongs to both of us father and son! Hahaha, this Northwest ranch is one of the main sources of income for the Ling family. With such a strong pillar behind me, as long as I start to stir things up here, then, hehehehe…”</p><br/><p>The room was filled with sinister and treacherous laughter from the father-son pair, as though the entire Ling family had already fallen into both of their hands…</p><br/><p>Following which, they continued with some idle conversation, such as how to completely take control of the Ling family, as well as how to settle the remaining family members, so on and so forth…</p>\n</div>"}