{"title": "Chapter 35", "id": 35, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-35", "volume_title": "Volume 1", "body": "<h1>Chapter 35</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Early in the morning, someone arrived at the gate of the Ling family mansion and gave a notice of visit.</p><br/><p>Duke Ling’s sworn brother, also the family head of the wealthiest family, Xiao FengHan, was going to visit Ling Zhan of the Ling family in the afternoon today.</p><br/><p>Everyone in the Ling family all became busy. The family head of the wealthiest family’s visit was no small matter at all. The Ling family’s chefs all personally picked the best ingredients to show what they got in the afternoon.</p><br/><p>The godson of Duke Ling, Ling Kong, was running around all over, monitoring the progress everywhere while preparing for the visit. At the same time, he instructed his son, Ling Zhen, to make sure he leaves a favorable impression on the Xiao family head later when he sees him! For a figure like the Xiao family head, a single compliment from him would change your future!</p><br/><p>As Duke Ling looked at the notice of visit, he was cursing out vehemently! At the same time, he felt that something was wrong. Since when did that old fox Xiao ever give me a notice of visit when he comes? Doesn’t he just barge his way in every time? Why is he so serious this time?</p><br/><p>This sudden notice of visit just had too much meaning hidden within it. Ling Zhan could not help but think about it deeply. Don’t tell me that old man went crazy? Duke Ling thought to himself.</p><br/><p>No matter what, he definitely isn’t happy about something. It doesn’t seem like something small either. Ling Zhan could not help but be puzzled about just when he had offended that fellow.</p><br/><p>After thinking for half a day, he was till completely puzzled. Ling Zhan then did not bother thinking about it any further as he thought to himself: When that old fox Xiao comes later, I must definitely give him a good scolding! So what if you’re rich?</p><br/><p>The sun slowly rose into the sky and the sky was free from clouds, signaling good weather. The warm sunlight had begun to purge out the bone-piercing chill of winter.</p><br/><p>Noon was about to arrive.</p><br/><p>A horse carriage was clad in a black cloth with a golden chrysanthemum weaved onto it! Under the warm sunlight, it slowly made its way through the streets with the distinct sound of the horses’ hooves hammering the ground.</p><br/><p>In front of the horse carriage, there were four men dressed in black with a sword by their waists. Their eyes were cold as they led the front of the carriage. To the sides of the carriage, there were also two such men following closely. Behind the carriage were eight men dressed in black following silently in two neat rows.</p><br/><p>Although it was but a single carriage approaching the Ling family mansion, the guards of the mansion could feel a great pressure coming upon them! In that instant, the atmosphere of the place became heavy as the guards felt their breathing becoming uneven. A wave of majestic aura emanated from the black carriage just like that.</p><br/><p>As the carriage came to a halt, a black-dressed man walked up to the door of the carriage and took a high kneel with one of his fists planted to the ground. Another man dressed in black then walked forward to lift up the veil of the carriage.</p><br/><p>A black pair of boots then appeared from the carriage, stepping on the first men’s back. Following which, an old man with white hair walked out from the carriage. His face was lean and his body skinny, but his eyes were gleaming as he was still hale and hearty. Following a chuckle, a little girl dressed in a green jacket jumped down from the carriage and was caught by the old man in mid-air.</p><br/><p>A guard had already long gone to alert Ling Zhan as he led a large crowd of people to welcome their guests with a face full of smiles.</p><br/><p>That old man was naturally the Xiao family head, Xiao FengHan. Seeing his sword brother receive him with a face full of joy from reuniting with his brother he had not seen for a long time, Xiao FengHan could only suppress that unhappiness in his heart. Seeing the unrestrained smile on his sworn brother’s face, Xiao FengHan could not help but feel warm in his heart. At the same time, he began to reminisce about the times when they were fighting together as blood filled the battlefield. He then could not help but feel that his actions today were a little too much. Haiz, forget it. I will find a time to talk about that matter. Since we have not seen each other after so long, I should not ruin the atmosphere.</p><br/><p>After Xiao FengHan came to the capital, he had ordered people to gather information about the young master of the Ling family. The results of the information he had gathered angered Xiao FengHan to the point he almost died! The more he looked at the information, the angrier he got. Although this child was still young, he was extremely horrible. If Ling Tian were to continue growing up as such, the Ling family would definitely be ruined in his hands! How would Xiao FengHan dare to bet on his granddaughter’s happiness like that?</p><br/><p>In a moment of anger, he decided to give the Ling family a notice of visit! The meaning of giving a notice of visit was equivalent to an official visit between nations, meaning that everything was official. For Xiao FengHan to give a notice of visit with his status, it obviously meant that he wanted Ling Zhan to receive him personally at the door. Xiao FengHan knew that he would definitely make Ling Zhan displeased, or even angered, by doing so. But for the plans of his own family and the happiness of his granddaughter, he felt that he did not have a choice.</p><br/><p>Ling Zhan broke out into a laugh and received Xiao FengHan with a big hug. At this moment, Xiao FengHan also revealed a sincere expression in his eyes as he stretched his arms wide as well. These two brothers who had been through life-and-death battles together finally met again after five years.</p><br/><p>Ling Zhan hugged Xiao FengHan and slapped his back as though he was extremely excited. But when no one else was able to see him, Ling Zhan whispered into Xiao FengHan’s ears, “Xiao FengHan, you bitch! If you do not give me a proper explanation about the notice of visit today, your sister-in-law and I will definitely skin you alive today!”</p><br/><p>Xiao FengHan laughed bitterly in his heart! I knew that this old man wouldn’t be able to take it; trouble is indeed here! He then replied softly, “Let’s talk about this later.”</p><br/><p>Under the warm reception of the Ling family, the Xiao family entered the Ling mansion together. Old madam Ling took the women in the family to welcome the Xiao family head in the mansion but had a chilly look on her face.</p><br/><p>Xiao FengHan took a step forward and cupped his fists, “How could this little brother dare to trouble sister-in-law to welcome me personally? I’m extremely terrified by this hospitality.”</p><br/><p>Old madam Ling did not even flinch as she replied seriously, “The family head of the wealthiest family is paying a visit and I am extremely honored by this visit. This old lady must definitely lead the women in the family to welcome the Xiao family head.”</p><br/><p>Ehh…</p><br/><p>Xiao FengHan felt extremely awkward; he knew this old lady and the three of them had ventured through the continent when they were younger. Xiao FengHan was not afraid of anything in the world but was only extremely respectful towards this old lady. There was once when Xiao FengHan was heavily injured and this sister-in-law of his had saved him from thousands of enemy troops. Only after taking care of him for a full seven days was he finally saved from the brink of death. In Xiao FengHan’s heart, Ling Zhan and his wife were extremely important to him! Now that he saw his sister-in-law go through such proper ceremonies with him, he could not help but be flustered and his face turned red.</p><br/><p>He then looked towards Ling Zhan with a pleading expression only to receive a cunning smile from Ling Zhan in reply, who slowly lifted his head towards the sky as though there was something fun in the skies.</p><br/><p>What a joke! You are the one who sent an official notice of visit. Now that you are in trouble, you want this old man to clean up after you? How can there be something so good in the world!</p><br/><p>Xiao FengHan grit his teeth as his face turned red. Helpless, he could only act as though he did not know what was going on, “Err, why is sister-in-law doing this? Did this little brother offend sister-in-law? Sister-in-law, please let me know if I am in the wrong and I will definitely correct myself.”</p><br/><p>Old madam Ling then replied coldly, “I wouldn’t dare! The Xiao family is extremely wealthy and had sent an official notice of visit to this small Ling family of mine. How would I dare to not come out to personally welcome you? What wrong does the Xiao family head have? It should be the Ling family who is in the wrong!”</p><br/><p>Xiao FengHan then roared towards the guards dressed in black, “Which bastard was the one who gave an official notice of visit? Come forward!” As he roared, his eyes began to blink quickly.</p><br/><p>The guards dressed in black all stared at each other, dumbfounded. If you did not give the order, who would dare to use your name to send a notice of visit? Isn’t that just seeking death?</p><br/><p>After being stunned for a moment, a guard dressed in black finally snapped into his senses and took a step forward. With a knee to the ground, he said, “This subordinate did not do my job properly, I hope that family head will punish me!”</p><br/><p>Xiao FengHan then kicked him, sending him flying as he scolded, “Bastard! Is there a need for me to send a notice of visit to the Xiao family when I come to visit? Failing at everything you do! Go back and receive a hundred whips from the enforcement hall, you trash which embarrassed me!” That guard then responded quickly and took his leave.</p><br/><p>After scolding the guard, Xiao FengHan turned around and said with an apologetic smile, “Sister-in-law, this little brother does not know about this matter at all.”</p><br/><p>Old madam Ling’s lips then twitched as she rolled her eyes. If old madam Ling was not able to see that this was merely an act, that would be impossible.</p><br/><p>Ling Xiao, who was by the side, saw that the time was about right and stepped forward, “Mother, it seems that uncle Xiao really does not know about this. It is just that his subordinates did not know about the relationship between the two family of ours, making his own decision. It is all just a misunderstanding.”</p><br/><p>Xiao FengHan immediately added on, “Yes yes yes, it is a misunderstanding, a misunderstanding. Hahaha…” He then looked towards Ling Xiao with gratitude and glared at Ling Zhan.</p><br/><p>Old madam Ling then responded, “Oh, so it was just a misunderstanding…”</p><br/><p>Xiao FengHan wiped off the cold sweat on his face, “Yes yes, it was just a misunderstanding. Hehehe…” His voice became dry as though he was an old hen with his neck choked up.</p><br/><p>Old madam Ling immediately became warm as she replied, “Since it was just a misunderstanding, let us forget about it. Eh, this beautiful young lady must be Xue’er right? Look at her, just how beautiful she is. Come come, come to grandmother, grandmother has something good for you. Mmm, so obedient!” Kissing the little girl on the cheeks, old madam Ling hugged her up and walked in together with all the females in the family.</p><br/><p>Xiao FengHan then heaved a sigh of relief. I have finally passed this round! But right at that moment, old madam Ling’s voice sounded, “Ling Xiao, give a piece of cloth to your uncle Xiao to wipe his eyes. He seems pretty tired, blinking his eyes so vigorously…”</p><br/><p>Xiao FengHan broke out in cold sweat!</p>\n</div>"}