{"title": "Chapter 33", "id": 33, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-33", "volume_title": "Volume 1", "body": "<h1>Chapter 33</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>“Don’t tell me you’re sent from heaven?” This sentence sounded out like a groan, and Mister Qin himself did not even know how he managed to ask. He felt as though he was in a dream, as though his spirit was floating halfway in the air…</p><br/><p>Eh!</p><br/><p>Seeing how Mister Qin’s face lost its color, Ling Tian could not help but let out a bitter smile. This was just following through with whatever that he said; he merely felt as though his previous performance was much too eye-catching, and with no options left, he could only speak whatever came to mind without first processing it. He had just wanted to label himself as a genius, since geniuses existed in this world. By operating under the cover of a genius, this would allow people to feel less inferior.</p><br/><p>How would he have known that his ordinary words would be taken by the old man as though he was someone sent from the heaven? To think that this was preordained by heavens, my God! What was that old man’s brains made of? This kind of imagination, wasn’t it just… too rich?</p><br/><p>Mister Qin took a long time before his spirit finally returned to reality, hurriedly taking a step forward. This expression looked crazed as he grabbed onto Ling Tian’s collar, saying, “Say, were you expressly sent by the heavens? Were you?!”</p><br/><p>Ling Tian was grabbed so tightly he was literally suffocating. With difficulty, he took a breath of air, not knowing whether to laugh or cry, “Ehh… this… I guess I can be considered.”</p><br/><p>Damn it, there should not be any problem saying that he was sent by the heavens, right? After all, he had secretly snuck out from the Yellow Springs of the Underworld! If he did not possess a measure of blessings from the heavens, he would probably have been reincarnated back in his previous world. Just using this point for reference, one could say that it seemed as though the heavens willed it, so… there you go!</p><br/><p>Mister Qin finally loosened his hands, his eyes vacant, yet wearing an ecstatic expression! The poor old man finally went mental after all the mental shocks given by Ling Tian…</p><br/><p>“Mister, wake up… Mister!” After Ling Tian called out a few times, did Mister Qin come to his senses as though waking up from a dream; the moment the latter saw Ling Tian’s face, he hurriedly stood up and tidied his robes, before giving a stately expression as he kowtowed on the ground…</p><br/><p>Ling Tian started to sweat profusely! This old fellow was obviously trying to shorten his longevity! He hurriedly stretched out his hand to help him back up.</p><br/><p>The old man panicked on the spot, “Manners can’t be abandoned! You are an envoy sent from heaven. Are you telling this old man that he doesn’t even have the qualifications to pay respect to you?”</p><br/><p>Ling Tian was absolutely horrified! You old man, after studying for your entire lifetime, your brain probably got muddled from all the studying… I have not even tried to dupe you and you’re already like that… if I ever con you, then won’t you probably have a heart attack and just die right there?</p><br/><p>Seeing how the old man was extremely moved, prostrating himself on the floor without any intentions of moving, Ling Tian was rendered speechless. Looks like he could only con him into getting up.</p><br/><p>“Cough, cough,” two harsh coughing sounds rang out, as Ling Tian spoke with a stern face, “Mister, what you’re doing is wrong; right now, only you know of my identity, so if you insist on doing so, then do you know the consequences if the news were to leak out? All the major powers as well as everyone in this world will treat me as their enemy, and would definitely want to silence me early. As for the Ling family, they would obviously be dragged into the muddied waters! All that I said, could be caused by you merely wanting to pay your respects to me! Have you thought about it?”</p><br/><p>Mister Qin got terrified out of his wits! He stood up in a fluster of arms and legs, saying: “This old man has gone silly. Will… young noble please forgive me!” After thinking, he still did not know how to address Ling Tian, and thus reluctantly settled with the term young noble.</p><br/><p>Ling Tian felt a headache coming: “Sir, please resume your original address of me, are you trying to kill this kid here?”</p><br/><p>However, Mister Qin shook his head with a firm expression, remarking, “In private, respect must be shown. Only then can this old man’s heart be at ease.”</p><br/><p>Feeling depressed, Ling Tian could only attempt to salvage the situation, “If Mister behaves this way, I will not be at ease too. Furthermore, within the Ling family, the major power’s spies are pervasive; if someone were to spy on us, then all that we have hidden would be a wasted effort. Thus, at any time, we cannot be like this. As long as Mister is aware of, that is sufficient. Why must you show it externally?”</p><br/><p>Mister Qin acted as though he had just woken from a dream, saying, “Yes yes yes, this old man was befuddled. Hahaha, as long as I have God in my heart, then God will naturally exist.”</p><br/><p>Ling Tian truly felt like cradling his head and walking out! With no options, he could only change the subject, “A moment ago, we had already spoken about this: the arranged marriage must be withdrawn. But how do we do it? This needs to be discussed seriously.”</p><br/><p>Mister Qin seemed to be gradually returning to his normal state, “Then how you do plan on going about this matter?”</p><br/><p>Ling Tian let out a smile, finally he had pulled the old guy’s attention back. Being already prepared, he said, “The best policy for this matter would be for the bride’s party to voluntarily carry out the withdrawal!”</p><br/><p>This made Mister Qin ask in bewilderment, “This marriage has already been arranged. How could the matrimony between the Xiao and Ling families be a small matter? This benefits both families quite a bit, so why would the Xiao family take the risk of souring relations to voluntarily withdraw?”</p><br/><p>With a sly smile, Ling Tian replied, “If I guess correctly, given the great ambitions of the Xiao family, what will happen when they find out that the young master of the Ling family, their future son-in-law, is merely a domineering and unreasonable child, without a hint of a future? Everybody can see that the Ling family is at the heart of the struggle, tossing and turning based on the storm. Furthermore, both the previous two generations of the Lings are loyal to a fault to the empire, without any possibility of them rebelling! With such an ally of no use and instead creates more trouble, would the master of the family still insist on using his granddaughter’s happiness to trade? In this scenario, what do you think they will do?”</p><br/><p>Mister Qin sharply breathed in, saying, “If that’s the case, then if I’m the Xiao family’s head, I would definitely choose to withdraw. However, how do we let the Xiao family know about all these?”</p><br/><p>With a secretive smile, Ling Tian continued, “Doesn’t Sir have your old friend Xiao FengHan? Before making such a big decision, will he not come over to ask his old friend how the Ling family’s young master is like? At that time, you just need to say as such… and as such… and all would be sealed! Heh heh heh!” A line of sinister laughter could be heard.</p><br/><p>Mister Qin felt his back suddenly full of cold sweat! This little devil! He, old Man Qin, started to pray for the future opponents that would be going against Ling Tian. Against this little devil, one was really seeking his own death!</p><br/><p>All of a sudden, Mister Qin had another question, “Since young noble wishes to withdraw, then, no matter which side speaks first, it doesn’t matter, does it? Why must it be them to suggest?”</p><br/><p>Snorting, Ling Tian answered, “To withdraw, especially when the family’s prestige is on the line, how can one just simply speak about withdrawing? If the Xiao family wishes to annul it without a price, how could that be possible?!”</p><br/><p>This caused Mister Qin to break out in sweat! How despicable! How shameless! This little thing was definitely sent from the heavens! He obviously wanted to withdraw from the marriage, yet planned to make the other party speak of doing so first! All these just to profit from this matter! Mister Qin had seen many shameless people in his life, yet this was his first time witnessing shamelessness brought to the utmost degree!</p><br/><p>He could still hear Ling Tian muttering to himself, “Although withdrawing is good, I should at least be able to extort an armory of weapons. However, what would happen if I fall for the lass from the Xiao family? Aii! If that’s the case, I can only kidnap her when the time comes…”</p><br/><p>Mister Qin felt like covering his face and running for his life….</p>\n</div>"}