{"title": "Chapter 49", "id": 49, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-49", "volume_title": "Volume 1", "body": "<h1>Chapter 49</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Everyone felt baffled at the scene — the two children were arguing a while ago with everyone watching them in enjoyment, how did the winds change and suddenly bring in the topic of the Emperor? To insult the Emperor, and harbor plans of rebelling was a crime which would cause the extermination of all nine generations of one’s family! How did Young Master Yang not know this and proceed to insult the other party’s uncle-in-law?</p><br/><p>Because Ling Tian’s voice was too soft, so everyone did not hear Ling Tian saying “tell that to my aunt’s husband”. They only heard Young Noble Yang suddenly burst out scolding the other party’s uncle-in-law, and even venomously so, and furthermore fluently cursing!</p><br/><p>Shit has hit the fan!</p><br/><p>Everyone present only saw the Young Master Yang standing there stock still in shock. Then, the audience hurriedly moved their legs to escape. Are you kidding me? In just a blink of an eye, an old hen transformed into a duck! Since the topic went to rebelling, why would the people of their caliber stay when the only option there was death?</p><br/><p>Ling Tian shifted his vision, and glanced towards Ling Yi — Ling Yi was a bodyguard of the Ling family, and also one which had constantly opposed the Yang Family for many years. While he worked as a coachman on the surface, he had virtually seen all the struggles of the two families over the years. Of course, Ling Tian had to consult him to understand how he should proceed in order to reap the full benefits.</p><br/><p>Under their tacit agreement, Ling Tian suddenly jumped onto the chariot, shouting: “All are not to move! Those present here are all witnesses! If anyone dares to move, he or she will be dealt with in the same crime of rebellion! The punishment will be the extermination of your nine generations!” Once he spoke, those on the street froze like blocks of wood! Everyone had an expression of dread, with their limbs shaking as they screamed in their hearts: “Why am I so unlucky!”</p><br/><p>“I came here to watch a good show but got turned into a witness for a crime of rebellion! What is the reasoning behind this suffering!” Many of them secretly swore; even if there was a beautiful lady doing a striptease on the streets in future, they would not even stay there to observe! This sort of matter was death-inducing!</p><br/><p>Behind the Yang Family’s chariot, a servant suddenly pushed apart the crowd and sped off. In a blink of an eye not even his shadow could be seen. Obviously, he had gone back to the Yang Residence to report the matter.</p><br/><p>However, Ling Tian did not even bat an eyelid, as though he had not noticed the blatant escape. He did not think that the Yang Family will be destroyed by this, and only thought he could use this chance to bring the Yang’s Young Master down a notch. Secretly throwing Ling Yi a glance, he gave a tacit signal, and Ling Yi immediately sliced off the bridle of one of the horses pulling the chariot. He then got on the horse and speed along towards the Ling Residence.</p><br/><p>“Little thing, how dare you try to climb up my head! Watch how this little grandpa play you to death!” Ling Tian thought to himself happily. However, his facial expression remained chilly as he scolded, “Men, what are you still waiting for! Tie them all up! No one shall be exempted!”</p><br/><p>Yang Wei’s pitch went up by an octave as he shouted: “You dare!”</p><br/><p>A wave of disdain surfaced in Ling Tian’s heart. Waving his hands, he continued: “Anyone who resists would be considered a rebel! Kill them without mercy! Men, hurry up!”</p><br/><p>“Yes!” The various guards of the Ling Residence shouted out their acknowledgement, pouncing towards the people like wolves and tigers. The moment they grabbed onto someone, they would first give them a good beating before tying them up; finally the ropes ran out, and they started to take out the belts of the unfortunate victims to use as a rope… in that moment, all the Ling bodyguards were high-spirited, delightedly carrying themselves without restraint. After fighting with the Yang Family for 3 decades, this was the first time they could let loose all their frustrations.</p><br/><p>How would the Yang Family’s bodyguard and butler know that just a single sentence from their Young Master would land them in such trouble! Right now, everyone was behaving similarly, not daring to move, allowing themselves to be tied up. Thinking of moving? You must be joking, it would be counted as treason! Ling Tian was completely willing to kill on the streets! Furthermore, even if they were killed, it would be just and proper and no one would say a word against him.</p><br/><p>Glancing at the audiences lying wrapped like dumplings on the floor in satisfaction, Ling Tian nodded his head. He then slowly walked in front of Yang Wei, saying: “Young Master Yang, I just thought of it, I have not asked for your name yet.”</p><br/><p>Yang Wei had on a face of viciousness, coldly snorting: “Kid, don’t be too happy! I won’t let you go, definitely not!”</p><br/><p>Ling Tian now smiled, his grin remaining on his face as he stood back up. Suddenly, he stretched out a leg, kicking him to the ground. Walking up to him, he stretched out his right leg, slowly and firmly pressing it on Yang Wei’s face, viciously grinding it such that the latter’s mouth was buried in the snow piled up on the street. Contemptuously laughing, he continued: “Young Master Yang, you aren’t willing to let me go?” As he spoke he slowly lifted up his leg, before placing it down, lift up, push down… “You must know that for today’s matters, even if I were to kill you right now, your grandfather would still have to personally come over to the Ling Residence to thank me! Do you really think that you are some big shot? Hehehaha…” Ling Tian felt as though he was basking in too much of the limelight today. In his laughter, he purposely added a touch of bossiness to it, making it look like an evildoer who had gotten what he wanted!</p><br/><p>Yang Wei’s mouth was filled with soil, with muffled sounds coming from within his mouth. Upon hearing Ling Tian’s cold ridicule, he finally could not resist the fear growing in his heart, and two streams of tears flowed out from his eyes. As he thought of the seriousness of the matter just now, he got more and more afraid. The humiliation added on was the breaking point for him, making him burst into tears.</p><br/><p>“My God! You’re crying from this? How pathetic!” Ling Tian slowly brought his leg down, then turned to face another bodyguard of the Yang Family, smiling as he spoke: “What is the name of your Young Master?”</p><br/><p>Despite the cute smile on Ling Tian’s face, the bodyguard felt the chills deep in his heart. He could not help but hiccup as he stuttered: “Young Master’s name is… is called Yang Wei…”</p><br/><p>EH?!</p><br/><p>Ling Tian’s mouth dropped wide open, his expression fantastic to behold! After a while, he finally could not take it any longer, bursting out into laughter!</p><br/><p>Impotent? [1] How could someone actually be given such a dogshit name? Ling Tian laughed till the tears flowed down from his face, his body wracked with shivers. He was really full of respect for Yang KongQun! This man, his standard at giving names was in a league of its own!</p><br/><p>From afar, the sound of frenzied horse clops sounded, and a group of people on horseback came from opposite directions, from the North and South!</p><br/><p>“Both houses really live up their name of being decade-old enemies, even having such synchronization in appearing at the scene.” Ling Tian mused to himself. Seeing both parties close to arriving as he glanced sideways, he immediately dived into the chariot. For the following matter, Ling Tian was not willing to stand out any further. However, the Yang Family would not, even in their dreams, think that inside his chariot was still hidden another witness that could be considered a heavyweight character! That was Mister Qin.</p><br/><p>Both families had sent out their heavyweight characters as well! On the Ling Family’s side, there was the Duke Ling Zhan and Ling Tian’s Father Ling Xiao. Furthermore there was another who came to watch the fun, the Xiao Family’s Xiao FengHan! Standing beside Duke Ling was a beardless middle-aged man, who was the Ling Family’s Chief Advisor, Li ZhengChong — otherwise known as Mister Li.</p><br/><p>When Duke Ling heard the news that Ling Tian had caught a few of the Yang Family members who had showed signs of rebellion, Li ZhengChong who had happened to be beside him immediately thought of this as a golden opportunity to undermine the Yang Family’s strength. How could the latter let it go? Xiao FengHan, who just happened to be playing chess with Ling Zhan naturally would not miss the chance for such a good show. In fact, when Xiao FengHan heard the news, the first thought that ran through his mind was: “Yet another opportunity presented itself to that little devil’s mouth!”</p><br/><p>Similar to the Ling Family, the lineup of the Yang Family’s members was in no way inferior. Other than the Family Head — Yang KongQun, there was also Yang Wei’s father — Yang Lei, his uncle — Yang Chen, as well as several experts and officials. It was as though they came out in full force, with all of them having flustered expressions. Looking at the bedraggled appearance of Yang Wei, all of them were brimming with fury.</p><br/><p>The audience gathered around in a huge ring. In the ring was seven to eight Yang family members with depressed looks, trussed up like turkeys. Everyone of them even had a bright steel sword on their necks. Although Yang Wei did not have any steel sword placed on him, his face was full of mud and soil, with his hair in disarray and his body covered in filth. Because it just snowed, and the weather today was considered relatively warm, the piled up snow started to melt. Since Yang Wei had been pushed down and stepped on by Ling Tian, he naturally took the ‘grand prize’! In Ling Tian’s eyes, this Young Noble Yang now looked like a refugee from Africa….</p><br/><p>[1] The author is playing with homonyms here. Yang Wei () has the same pronunciation as Yang Wei () which means that one is impotent.</p>\n</div>"}