{"title": "Chapter 40", "id": 40, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-40", "volume_title": "Volume 1", "body": "<h1>Chapter 40</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Ling Tian sat down obediently on the chair as he fidgeted with his eyes looking around nervously.</p><br/><p>Old madam Ling sat opposite him with a smile which did not seem like one, with the look of a police interrogating a criminal. You horrible brat, I must definitely dig out all of your secrets today!</p><br/><p>Ling Tian laughed bitterly to himself as he quickly thought of a plan. Looking at the domineering look on his grandmother’s face, he definitely will not have a good time today. The first thing old madam Ling said after entering the room was, “Bring Xue’er to the side room and take good care of her. Xue’er, go and play with elder sister first. Grandmother will teach this naughty brother of yours a good lesson. I will take you to have something nice to eat later! Mmm, such a good girl!” The first half was spoken to a maid while the second half was spoken to Xue’er.</p><br/><p>As Xiao YanXue looked towards Ling Tian with a little bit of fear and disgust, she responded to old madam Ling softly and walked out with the maid.</p><br/><p>“How is your master?” Old madam Ling looked at her grandson and asked.</p><br/><p>My master? Ling Tian was lost. What is going on here? Since when do I have a master? As he looked at the confident look on his grandmother’s face, he understood what was going on as he praised her methods in his heart.</p><br/><p>If Ling Tian was just a five-year-old child and had a secret master, he would definitely let up with just a single question by old madam Ling!</p><br/><p>This question obviously means: I already know all about you. It is best to say everything out on your own. With mind games as such, there was no chance for Ling Tian to avoid the question at all. It was indeed a good method to use! But after Ling Tian heard that question, he had the urge to burst out into laughter!</p><br/><p>Ling Tian thought to himself: Since grandmother has already gone into the topic and has a guess like that, why not I just play along with her?</p><br/><p>He then pretended to stutter as he said, “Err, good… Eh? Grandmother, how did you know that I have a master?”</p><br/><p>Indeed so! Old madam Ling thought to herself: Hmph, little brat. No matter how much you act, you still revealed yourself after a single question. Old madam Ling could not help but feel full of herself.</p><br/><p>With a cold grunt, she continued to say with confidence, “Hmph! Why would grandmother not know about those little things of yours? It isn’t a big secret anyway. Speak, how did you meet your master?”</p><br/><p>As old madam Ling questioned Ling Tian, she was hinting to him that she was well aware of who his master was. At the same time, it is to make Ling Tian think that she would immediately know if he were to lie about anything.</p><br/><p>She would probably be able to use this method to even deal with a fully grown man! But facing a weirdo like Ling Tian, the result of this method would be to lead her further and further down the path of her misunderstanding.</p><br/><p>After Ling Tian thought for a moment, he acted as though he could no longer hide the matter anymore and revealed everything. Of course, the “everything” he revealed was carefully modified.</p><br/><p>Ling Tian then described how he saw a white-bearded old man when he was three appearing in front of him. The old man said that he was a martial talent the moment he saw Ling Tian and said that he wanted to take Ling Tian in as a disciple. At the same time, he requested Ling Tian to move out from staying with his parents. Then, the old man would sneak into his room every night to teach him martial arts and more. Ling Tian made use of all the wuxia tales he had read before in his past life to weave out a story. However, this was something extremely amazing in this world as well and even old madam Ling had her mouth ajar as she listened to the whole story.</p><br/><p>After Ling Tian had explained the matter, old madam Ling’s doubt about why Ling Tian intended to move out when he was three was finally resolved. At the same time, she looked towards her grandson with a sense of satisfaction and pride.</p><br/><p>She then thought about something as she asked, “Tian’er, your master taught you martial arts in light of your talents and this is something fantastic. But why did you hide the matter from us?”</p><br/><p>After considering for a moment, Ling Tian finally came to a decision and replied, “Master said that our Ling family is too big now and will attract many enemies. If people knew about me, it will be extremely disadvantageous to our family!”</p><br/><p>Old madam Ling then nodded in agreement. It seems that Tian’er’s master is extremely wise and isn’t someone simple. She then asked again, “Don’t tell me your grandparents or parents will reveal the secret if you tell us?” This was what old madam Ling was extremely displeased about. It doesn’t matter if you want to take my grandson as your disciple. But why do you forbid him from telling us? Ling Tian is our direct descendant! Hmph!</p><br/><p>After Ling Tian weighed his options for a moment, he decided to speak the truth, “Master has said that there are many dangers in our own Ling family mansion. He said that my grandparents and parents can definitely be trusted. But there are other figures in the Ling family with authority that must be guarded against. Right, master also talked about second uncle before.”</p><br/><p>Ling Tian came to a conclusion: Since I can’t conceal the matter, let me bring it up openly! With grandmother’s wits, she is definitely someone who will consider the bigger picture! It may be a good thing to let her know the truth earlier. Since I have a fake master as backing, I don’t need to be afraid of revealing anything.</p><br/><p>Old madam Ling’s face became serious as she asked, “Your second uncle? What about your second uncle?” As she said that, her eyebrows furrowed as she had a bad premonition.</p><br/><p>Ling Tian replied, “Master had once heard a secret conversation between second uncle and Ling Zhen before. He said that second uncle had once sent someone to feed mother the Heir Severing Grass…” Ling Tian thought to himself: Since I am going to reveal the truth, I should go all out! Let me send a big bomb to shock her first!</p><br/><p>Bang! Old madam Ling slapped the table and stood up in rage! This had always been a doubt in her heart: Her son and daughter-in-law have always been extremely loving but never had a child, making the two old people so worried. They thought that it might be because of a hidden disability and tried to find a cure for it all over! But they never imagined that this would be the cause of it!</p><br/><p>In that instant, old madam Ling thought about the different things that happened in the past few years. She started thinking about how Ling Kong was extremely passionate about the problem that the Ling family had no descendants, personally arranging for someone to attend to Chu Ting’er. At the same time, this answered all the possible doubts both herself and Ling Zhan had about him being a little too extreme. In fact, when he heard about any doctor who might be able to help Chu Ting’er conceive, he personally sought them out no matter the distance. But old madam Ling never imagined that there was such a vicious intent behind all of those!</p><br/><p>In the past, old madam Ling had always felt gratitude towards Ling Kong and felt that this godson of hers knew how to repay gratitude. At the same time, she had even praised him in front of Ling Zhan many times about his good character before! She said that he was smart and capable, being a rare talent! But she never expected that it was this talent who almost made the Ling family lose its future generation! If not for the fact that there was an accident and Ling Tian came into existence, Ling Kong’s scheme would have succeeded by now! At the same time, he would be victorious with everyone being kept in the dark!</p><br/><p>Old madam Ling was both embarrassed and angered, angered to the point she felt her heart almost bursting. As her breath became ragged, she grit her teeth and cursed, “So this was the case! Hmph! If the Ling family really does not have any descendants, the wealth of the whole family would definitely land into Ling Zhen’s hands! What a good plan! What vicious methods! Ling Kong! I will make sure you die a horrible death!” As she said the final sentence, she said it with all of her strength.</p><br/><p>As long as Ling Xiao does not have any children, Ling Kong, who was the godson of Ling Zhan, was the person closest to the direct bloodline of the Ling family. Ling Zhen would then be the third generation successor to the Ling family for sure! With old madam Ling’s wisdom, she was naturally able to easily understand the reasons behind Ling Kong’s plans in a short few moments. She could not help but feel like catching the both of them in front of her immediately, executing them on the spot to vent her anger!</p>\n</div>"}