{"title": "Chapter 56", "id": 56, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-56", "volume_title": "Volume 1", "body": "<h1>Chapter 56</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 56: Blood Iron Warriors</p><br/><p>Translator: DavidT Editor: celllllFrom what Zhang DeHu confessed, everyone knew that the Violent Wind Gang was a large gang near the capital which was formed around five years ago. It was even larger than the Blood Rose Hall which killed Ling Jian’s parents. The head of the gang, Zhao KuangFeng was a martial arts expert as well. In the Violent Wind Gang, there was a total of four halls with 600 plus people. They were the Dark Night Hall, which specialized in assassinations and information gathering. Gold Jade Hall, in charge of all the various gambling dens and prostitution businesses and the largest source of income for the Violent Wind Gang. Tiger Leopard Hall, the force which the Violent Wind Gang showed on the surface in order to hide their true strength. Law Enforcement Hall, carrying out any punishments within the gang and also the strongest force in the Violent Wind Gang.</p><br/><p>Facing Ling Jian, all of these captured white dressed men became as obedient as kittens and spilled all the beans. If there was someone who did not have adequate information, the others would snatch for the opportunity to add on with what they knew. They all looked to be extremely loyal, afraid that they did not give enough details and enraging this little devil. There was one of them who even said how many concubines the gang leader had and the sequence which he would find each of the concubines every month. It turns out that this white dressed man did not have good looks and had a poor family. Even though he was so old already, he was still unable to find a wife and cultivated the habit of eavesdropping. As Ling Tian listened by the side, he broke out in cold sweat!</p><br/><p>As he realized that there was nothing more which can be interrogated out of them, Ling Jian stopped his interrogation. He then organized whatever he questioned and reported them to Ling Tian.</p><br/><p>Everyone then saw this small figure walked towards Ling Tian, his body so skinny to the point a gust of wind can blow him down. But, even the Blood Iron Warriors who were numb to killing and can laugh on the battlefield had a tinge of fear and wary in their eyes as they looked towards him. There was even a vague trace of respect!</p><br/><p>Ling Tian had already heard everything he needed and naturally did not pay attention to Ling Jian’s report. But in his heart, Ling Tian was still pretty satisfied towards Ling Jian’s performance. The process of the interrogation was extremely swift and effective. After listening to the contents which were interrogated, he already had a good understanding of the Violent Wind Gang. Furthermore, Ling Jian only used half the time which Ling Tian gave him — he can be said to have passed with flying colors.</p><br/><p>Without surprise, no one knew who the client for this mission was. They only knew that 100,000 taels of silver was paid and the gang received a mysterious mission. The only requirement of the mission was to kill everyone present. As such, before these white dressed men took action, they still did not know who they were about to kill. It was only after they saw the appearance of the Blood Iron Warriors did they understand that the person they were supposed to kill was an important person in the Ling mansion!</p><br/><p>At that moment, all of these white dressed men cursed in their hearts, “Killing someone from the Ling mansion in the capital! Isn’t this just committing suicide, are they tired of living?” They all could not help but begin to hate the gang leader, Zhao KuangFeng as well. It doesn’t matter if we did not know, don’t tell me you did not know either? For 100,000 taels of silver, you sold the lives of us brothers out! It can be imagined just what kind of a revenge the Ling family would take if this mission was unsuccessful! The consequences are definitely not something which a small Violent Wind Gang is able to endure!</p><br/><p>To the side, there was a loud puking sound which sounded. The sound was so intense that anyone who heard it would think that the person was puking out all of his internal organs!</p><br/><p>Everyone turned to look and they were startled! That person who was puking while holding the carriage for support was the previously cold blooded Ling Jian! At this moment, he could no longer stand up properly as he squatted down. He already had nothing to puke out as only his clear stomach acids were puked out.</p><br/><p>Ling Jian was a nine years old child after all! With the pressure of needing to leave the Ling mansion if he did not pass, he used the most extreme and cruel interrogation method without hesitation. However, it was after all his first time facing such a bloody scene. Especially since all of these were created by him. His stomach had long been unable to take the discomfort already. Now that the pressure was over and the bloody scenes appeared in his head again, he could not help but vomit.</p><br/><p>A trace of heartache then flashed through a leader of the Blood Iron Warriors. He then could not help but say to Ling Tian, “Young noble’s training method is indeed effective. But to a child, it may be a little too cruel.”</p><br/><p>Ling Tian was stunned for a moment, “This person isn’t simple. He is actually able to tell that I am trying to train Ling Jian.” He then turned around as he looked towards that Blood Iron Warrior with a smile which wasn’t a smile. However, he did not say a thing but only sized him up with a strange laughter. After which, Ling Tian still did not say anything but only gave a profound smile.</p><br/><p>This leader of the Blood Iron Warrior was puzzled as he also sized himself up following Ling Tian’s gaze. Only after a while did he understand, “If not for the life and death battles in the battlefield, will there be the Blood Iron Warriors?” After he understood Ling Tian’s meaning, he became silent.</p><br/><p>After sizing him up for a moment, Ling Tian had an idea in his head as he asked, “What is your name? What is your rank?”</p><br/><p>This Blood Iron Warrior was stunned for a moment before reacting, “Your subordinate is called Feng Mo. I am a personal troop of the marshal tent!”</p><br/><p>“Err…personal troop?” Ling Tian was surprised, “Someone like him was only able to be a small little personal troop? Don’t tell me dad has these many talents?”</p><br/><p>Feng Mo also became embarrassed as he said with a red face, “This subordinate was originally a captain of a hundred man platoon. But because of my bad temper, I had a conflict with one of the deputy general. In a moment of rage, I actually beat the deputy general up. In order to appease the crowd, I was demoted to being a personal troop.”</p><br/><p>“Oh…” Ling Tian nodded his head, “My father really knows how to abuse his authority for his personal means! Keeping such a blockhead with exceptional martial arts by his side.” But the way Ling Tian saw it, this Feng Mo will not be satisfied by being a puny personal troop. At least, he can be a vanguard or division commander in the army. However, he was a mere hundred man captain in the past. It seems that dad really has a few talents who are not well utilized!</p><br/><p>For such a talent to be a personal troop, isn’t this such a waste? Ling Tian’s eyes began to spin as he laughed to himself. Then, he asked, “How many Blood Iron Warriors are there in the army?”</p><br/><p>Feng Mo then replied without thinking, “There are a total of 120 personal troops such as myself who are called Blood Iron Warriors. They are divided into 10 sections with a section commander and 2IC in each section.”</p><br/><p>Ling Tian then nodded his head as he thought about the army’s structure from the past life. In his past life, the smallest unit would be formed by 10 people with a commander and 2IC as well. As he thought about his previous life, he could not help but go into a daze.</p><br/><p>As he saw Feng Mo staring at him with a weird look, Ling Tian broke out of his daze as he smile, “Err, Feng Mo, you have already seen that my circumstances are also extremely dire. There will be people who will kill me anytime. I want to tell my father to transfer a section of Blood Iron Warriors over. I wonder if you’re willing?”</p><br/>\n</div>"}