{"title": "Chapter 50", "id": 50, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-50", "volume_title": "Volume 1", "body": "<h1>Chapter 50</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<br/><p>Yang KongQun’s face turned dark as he bellowed, “What is going on?!” Seeing how pitiful his grandson was, he felt a wave of heartache, “Hurry and release him!” The servant who reported the matter to the family had only said that young master Yang Wei and the young master of the Ling family had a conflict, with Ling Tian catching Yang Wei by slandering him for humiliating the emperor. Yang KongQun felt that something was wrong but the servant just did not dare to explain the whole incident. After all, how would a mere servant dare to talk about humiliating the emperor? Thus, Yang KongQun still did not know what happened exactly and only knew that it was a serious matter rushing over in exasperation. If Yang Wei had offended any other family, Yang KongQun could not be bothered with it. But the moment he heard that the Ling family was the other party, he had no choice but to make a personal appearance.</p><br/><p>“Wait!” Seeing how the people of the Yang family actually ignored everyone around and wanted to free Yang Wei, Ling Zhan roared, “It is best for us to clarify what happened first before doing anything.”</p><br/><p>Yang KongQun retorted, “Old man Ling, the one being tied up is my grandson!” What he meant was: He isn’t your grandson, obviously you don’t feel the heartache!</p><br/><p>Ling Zhan replied coldly, “I know he does not have the surname ‘Ling’. But, he will not die even if he is tied up for a while more.”</p><br/><p>Yang KongQun trembled in anger and managed to barely suppress his anger after taking a few deep breaths.</p><br/><p>All of a sudden, there was the sound of horses accompanied by flurried footsteps approaching from the east as a squadron of guards dressed in armour approached! The Capital Law Enforcement Squadron! The Yang family stared at them until their eyeballs almost fell off!</p><br/><p>The Capital Law Enforcement Squadron was a special force in the capital and can be said to be the most powerful force entity apart from the regular force. Their combat prowess was even stronger than the regular army! Ever since this squadron was founded, it has always been in the control of the imperial family. Towards the various powers and government officials in the capital, it carried a strong sense of intimidation.</p><br/><p>Everyone from the Ling family then revealed a delighted look as Yang KongQun turned his head around, “What exactly happened?” His hand stretched out as he grabbed the fat driver and brought the driver to his side.</p><br/><p>The fat driver explained the whole event with a depressed expression. However, even he did not hear what Ling Tian said which caused Yang Wei to scold Ling Tian’s uncle-in-law. Since Yang KongQun was the one interrogating him, he could only reply honestly about how the young master was the one who began scolding Ling Tian’s uncle-in-law…</p><br/><p>Yang KongQun took a deep breath of cold air! This matter can be big or small depending on the situation. If the Ling family insists that Yang Wei insulted the emperor, this grandson of his is finished for sure.</p><br/><p>Yang KongQun was both angered and frustrated as he stepped on Yang Wei, “Are you an idiot? He dug such an obvious trap for you and you jumped into it without hesitation?” He has his uncle-in-law, don’t you have one too? Both of your uncle-in-laws are the same person! Bastard!” Yang KongQun was angered by his grandson to the point he went silly! Yang Wei scolded Ling Tian’s uncle-in-law? Isn’t that the same as scolding his own uncle-in-law?</p><br/><p>Yang KongQun also felt that there was definitely something that was wrong in this incident! Although Yang Wei was not extremely bright, he wasn’t so stupid either. There must definitely be a hidden explanation behind this.</p><br/><p>An official from the Capital Law Enforcement Squadron then walked over with a cold expression, “What is going on here? Ah? Elder Ling? Elder Yang? What are you two elders doing here?” The second half of his sentence was filled with shock.</p><br/><p>Ling Zhan then laughed as he said, “This old man heard that there was a mad man here who dared to humiliate the emperor in public. In a fit of rage, this old man came to take a look.”</p><br/><p>That official then paid his compliments to the different people present before walking to the center and asking, “What is going on here?” In fact, he was also extremely worried in his heart. While the Capital Law Enforcement Squadron belonged to the imperial family and had a high status, the two people here were not figures that he could offend. Even if they would not want to offend the Capital Law Enforcement Squadron, it was nothing difficult for them to deal with a small officer like him.</p><br/><p>As he saw that both Ling Zhan and Yang KongQun was present, he was completely filled with regret! This was obviously a conflict between both their families and even the emperor would not be able to defuse it so easily, much less him. He then began to search within the crowd as he thought to himself, “F**k! Where did that fellow who gave me the news disappear to? If this daddy here sees him, I will definitely shred him into pieces!”</p><br/><p>From the Ling family carriage which did not moved for a long time, an old man who was holding the hand of a little boy suddenly came out from within. His face was lean as his beard reached his chest, “Hahaha, why not you ask this old man. This old man had been here all this while and had witnessed the whole incident. Besides, there are over hundreds of people here who can be the witness to this event as well. If this old man is unfair with my words, there will naturally be someone from the crowd to step out and disagree with me.”</p><br/><p>The moment Yang KongQun saw that he was the one stepping out from the carriage, Yang KongQun felt his head go into a whirl. Why is it him? Things are now bad! If he is the one who planned it all, this wouldn’t be surprising.</p><br/><p>Mister Qin always had always been indifferent to fame and fortune, and did not have any government posts. However, his reputation in the world was unrivaled. Together with him being a teacher for many years, he has many talented students all over the world. Even in the current ministerial court, there were many officials who were once under Mister Qin’s tutelage. A few days ago, Yang KongQun heard that Ling Zhan personally invited Mister Qin into the Ling family to be the teacher of Ling Tian. Yang KongQun never imagined that this old man would come out right at this crucial period of time!</p><br/><p>In front of both the family heads and the Capital Law Enforcement Squadron, Mister Qin repeated the whole incident truthfully. Even the words which Yang Wei used were recited out by him word for word without concealing it in the slightest!</p><br/><p>Mister Qin always had an extremely good reputation. Together with the fact that what he said was completely truthful, everyone understood what happened after a short explanation.</p><br/><p>Yang KongQun’s face turned paler and paler as he heard the story, to the point his face was completely white when the story ended. He had originally felt the matter to be extremely strange —</p><br/><p>this meeting was obviously coincidental, yet it was made used of so perfectly by someone, forcing his Yang family into a corner! The intricate calculations, sharp foresight and powerful means were all so baffling! Even if someone were to beat Yang KongQun to death, he would never believe that the whole affair today was planned out by the mischievous brat of the Ling family! Only after he saw Mister Qin did Yang KongQun felt like his doubts were answered. So it was this old man who was controlling the scenes from the back! It is no wonder that my Yang family suffered such a great loss this time! With Yang Wei’s pitiful intellect, he completely lacked any form of flexibility. Together with this sly and cunning old man and how sudden this matter was, it was no surprise that Yang Wei fell for Mister Qin’s plans.</p><br/><p>After Yang KongQun saw Mister Qin, he inevitably shoved all of the responsibility for the matters today onto him. In that instant, a vicious glare filled his eyes as he stared at Mister Qin while thinking to himself, “Darn old thing. I did not place you in my sights initially. But I never thought that you would help the Ling family. Taking the initiative to attack? Hahaha, let us wait and see! In this capital, the Ling family is not the only one here!”</p><br/><p>Yang Wei’s father, Yang Lei felt that the matters were becoming more and more disadvantageous for his son and could not help but retort, “The young master of the Ling family had always been arrogant and conceited, who in the capital does not know that? This matter may be started by Ling Tian, forcing my son, Yang Wei, to retaliate. It is all within reason.”</p><br/><p>Everyone then turned to look at Ling Tian whose hand was being held by Mister Qin; his eyes was still filled with tears as his eyes were red, obviously crying before this. Currently, his eyes were still looking around anxiously as his body retreated behind Mister Qin. It was obvious that Ling Tian was extremely frightened. Such a child would start this matter? You’re still slandering him? Everyone present came to an immediate conclusion: The young master of the Yang family was definitely the one who bullied Ling Tian but had accidentally have a slip of his tongue. After all, for a 13 year old teen to fight a five year old child, everyone did not need to think to guess what the result would be.</p><br/><p>Looking at Ling Tian’s pitiful appearance, looking as though he would cry at any moment, all of the senior present could not help but want to hug and console him. They had all came to a conclusion in their hearts that the Yang family went too far this time! They had actually sent a 13 year old teen to bully a five year old child!</p><br/><p>As they all understood what was going on, everyone present were kept behind as witnesses. The victim of the incident also gave his statement of what happened, and there was concrete evidence!</p><br/><p>The faces of those from the Yang family turned ashen!</p>\n</div>"}