{"title": "Chapter 60", "id": 60, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-60", "volume_title": "Volume 1", "body": "<h1>Chapter 60</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 60: Grandmother and Grandson’s Secret Plan</p><br/><p>Translator: chuchutrain Editor: celllllBy the time the carriage arrived back at the Ling mansion, it was already deep into the night. The moment the news of their return traveled to the anxiously waiting Old Madam Ling and Chu Ting’er, they hurriedly made their way over. Seeing his bodyguards in a multitude of injuries, and furthermore missing a few of them, the two women could not help but gasp in shock.</p><br/><p>Ling Tian leaped out from the carriage, provoking Old Madam Ling and his mother Chu Ting’er to reproach him for a period of time. Ling Tian merely laughed, signaling with his eyes before saying, “Let’s go back to the room to talk!”</p><br/><p>Old Madam Ling and Chu Ting’er were both experts in the art of picking up details, so how could they not catch his meaning? Thus they both agreed. Ling Tian also mentioned that he brought back a little girl and Chu Ting’er did not fuss over it, asking some hands to help the girl get cleaned up. Seeing how Ling Tian meticulously took care of her, Chu Ting’er felt her heart warm, and could not help but tease, “Tian’er, why not I ask this little girl to be your maidservant?”</p><br/><p>Ling Tian laughed in embarrassment, scratching his head. Seeing this, Chu Ting’er could not help but laugh out as well, patting him on his head.</p><br/><p>Inside Old Madam Ling’s chambers, Old Madam Ling listened with a heavy face to the ambush and attacks that Feng Mo recounted. On the side, Chu Ting’er covered her mouth in shock. She immediately grabbed Ling Tian, drawing him into her embrace to scrutinize him, making sure he was not injured in any way. After she was convinced Ling Tian was unscathed, she announced that from today onward, Ling Tian was not allowed to move around alone. Unless it was a major issue, he was not allowed to step out of the Ling mansion.</p><br/><p>Hearing this, Ling Tian flew into a panic. He could not be bothered about the fact that Old Madam Ling was in deep thought, hugging her arm and shaking it back and forth. If his mother were to really set this rule, then he would have to imitate a noble family’s only daughter, living a sheltered life as a caged pigeon. Ling Tian felt a rare sense of fear at that thought.</p><br/><p>Old Madam Ling tenderly patted his head before speaking to Chu Ting’er, “Ting’er, it is not a good thing for a little boy to keep cooped at home. After all, you can’t take care of him for his whole life and even an eaglet who grows up only being under the mother eagle will not be any good. Furthermore, I have already assigned experts to be near Ling Tian, he will be safe.”</p><br/><p>While Chu Ting’er still felt a twinge of heartache, she did not dare to rebut her mother-in-law, and thus could only agree in an aggrieved tone.</p><br/><p>Touching on the topic of the expert-level bodyguards, Ling Tian had his own thoughts as well, saying, “Grandma, this time’s incident really gave me a scare. After today, Tian’er has found out that those by my side that can be deployed are truly few and between!”</p><br/><p>This caused the old woman to burst into laughter, “You little rascal, do you even understand what fear means? Don’t lie to me, you just took a liking to your father’s Blood Iron Warriors, right?”</p><br/><p>Ling Tian could only let out an embarrassed smile as he replied: “They’re really not bad. Very good, in fact!”</p><br/><p>How could Madam Ling not be able to guess his intentions? She merely laughingly scolded him, saying: “Good good good, then I will have a word with your father tomorrow, Feng Mo’s section will then stay with you and not return to their squads.”</p><br/><p>Hearing such a thing, Ling Tian practically jumped for joy, exclaiming, “Thank you, grandma!” He was overjoyed in his heart. With this few Blood Iron Warriors filling up his own lack of manpower, things would be able to proceed at a smoother pace. Furthermore, the best part about them was that their loyalty was definitely without question and that they were already used to the discipline of obeying in the army. Just this two points was what Ling Tian valued the most.</p><br/><p>Ling Tian subconsciously stretched out his fingers as he began to plan; first was the matter of the Violent Wind Gang, four Blood Iron Warriors could be sent there to ensure things stayed under control, secondly was the matter of King Fu’s Courtyard. Someone had to be there to survey the scene as well. Thirdly would be the matter of recruiting more helpers, fourth would be the military workshop, the fifth would be… hahahaha, this time he had really struck the jackpot. Of all the problems buried in his heart, at least half were settled in this short while.</p><br/><p>Old Madam Ling looked as though she had been completely exhausted of strength, lightly rubbing her temples.</p><br/><p>Seeing this, Chu Ting’er glanced at Ling Tian and said, “It is already late in the night, you should get some rest, mother. Tian’er, you should also go to bed.”</p><br/><p>This moment, Old Madam Ling’s eyes gleamed as she calmly spoke: “Ting’er, you have also been working for the whole day, you should go get a rest. As for Tian’er, I would like to have a few words with him first.”</p><br/><p>Chu Ting’er expressed her agreement: “Yes mother.” Ruffling Ling Tian’s hair, she continued: “Listen to your grandma’s words and don’t be willful. Be good, Tian’er!” Before she left the room.</p><br/><p>In the room, the older and younger generation both sat there staring at each other, giving out weird smiles.</p><br/><p>Madam Ling suddenly opened her eyes wide, seeming as though her previous fatigue had all but disappeared. Obviously, it was all a farce she pulled off just now. Looking at Ling Tian, she spoke, “Speak. Why are you still hesitating?”</p><br/><p>Ling Tian gave a bitter smile, thought about it, before deciding to reveal his all of his machinations.</p><br/><p>“WHAT?!” Madam Ling was so shocked that she shot straight up from her chair. “Did you really ask for the armory that the Xiao Family is in charge of?”</p><br/><p>“Uh, that’s right. I went to look for him to request for compensation, and he just handed that workshop over to me. What’s wrong with that?” Ling Tian pretended to be naive and asked in doubt. Since there was no possibility of Xiao FengHan revealing what exactly happened, and Mister Qin who was riding on his trousers would all the more keep his lips zipped. Thus, Ling Tian was not afraid of spilling any secrets.</p><br/><p>“What’s wrong with that? There are many things wrong!” Madam Ling was so agitated that she stood up from her chair. Pacing around the room, she continued, “This workshop is an important military base for the Xiao Family inside Sky Bearing Empire! According to the Ling Family’s confidential reports, at least 5000 elite troops are hidden inside the workshop! With so many soldiers inside the heart of a country, what kind of imbalance can that cause? Even bringing down the capital would not be surprising! But now you’re telling me that Xiao FengHan handed it over to you meekly? I’m really beginning to wonder what sort of evil intentions he has by doing so!”</p><br/><p>Ling Tian smiled to himself, thinking, “Well, he did not exactly meekly hand it over, I sort of forced him to do so. Under such conditions, he had no choice but to actually hand it over!” However, even a kid knew what to say and what not to, let alone him. He only replied with, “Maybe the Xiao Family Head saw that I was a genius, and decided to build a good relationship with me!”</p><br/><p>The originally severe expression of Madam Ling softened into one that was between crying and laughing, and stretched out a finger, pointing it at Ling Tian’s head, saying, “You? Genius? If you were that good, then that old fellow would not bother to try to annul the marriage! This matter smells fishy!”</p><br/><p>Ling Tian scratched his head and smirked, “No matter what tactics he has, so long as grandma swaps all the manpower within the workshop, and pass the Xiao Family’s troops over to Grandpa Ling, he will have no eyes and ears there anymore, let alone cause any waves!”</p><br/><p>Old Madam Ling glared at him: “That’s easy for you to say! If Xiao FengHan has any ulterior motives and decides to use this chance to drag our entire Ling Family inside, how would he allow letting his men be moved out? This matter might not be as simple as it seems.”</p><br/><p>At this point, Ling Tian gave a shifty smile as he said: “In this point, grandma need not worry; your grandson here has already gotten Family Head Xiao to agree that when he journeys home a few days later, he would bring whatever he deems important along with him. Thus, grandma just has to ensure that we find the necessary people to replace his people, and that will be fine.”</p><br/><p>This made Old Madam Ling even more at a loss. She could not make head or tails of what Xiao FengHan was scheming about. After 30 years of close relations, Madam Ling had a profound understanding of how her husband’s sworn brother never failed to have deep plans and distant thoughts. Not only was his schemes extremely huge, his thoughts were also meticulous and could be said to be flawless in his calculations! Everything he did had a purpose, and would never allow himself to be at a disadvantage. However, the matter of him giving out his military workshop had no advantage whatsoever to the Xiao Family, and she could not help but think, “Did Xiao FengHan have a change in his nature? Or is the great plan of the Xiao family coming to a halt?” However, based on her observations the last few days, both did not really seem plausible.</p><br/><p>“Forget it, since there is no good reason, then might as well plan it step-by-step. Everything should be done cautiously. Hehe, now that the military workshop is in my hands, Xiao FengHan you can forget about carrying out any nefarious schemes or going back there! Both paths will be closed to you from now on!” thought Old Madam Ling.</p><br/>\n</div>"}