{"title": "Chapter 88", "id": 88, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-88", "volume_title": "Volume 1", "body": "<h1>Chapter 88</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 88: Praising the Silkpants</p><br/><p>Translator: DavidT Editor: celllllAs Shen Rou’er said that, the four four of them had a feeling of fainting! These four people would naturally be the lady who was painting, Wei XuanXuan and the two female guards.</p><br/><p>As Princess JiaoYue stood by the side, her countenance was extremely ugly. She was a cousin of Ling Tian and did not feel that this cousin of hers was that bad. She had only heard of his incorrigible acts from rumors. Now that she heard these ladies calling him a scum and bastard, she was uncomfortable in her heart. No matter what, he is my own cousin. These bunch of lass, don’t you know what it means to show me some face?</p><br/><p>As the ladies saw that the four of them were about to faint, they could not help but be startled. They quickly supported the four of them as doubt filled their faces, “Don’t tell me Ling Tian took advantage of all four of them in such a short while?” They could not help but look at the four of them as they shook their heads silently. Of the four of them, only Wei XuanXuan was a beauty. As for the rest…if Ling Tian were to really do something like that, his taste really has a big problem.</p><br/><p>That white dressed young man was Ling Tian?! The infamous number one silkpants in the Sky Bearing Empire?!</p><br/><p>The moment they knew about this, Wei XuanXuan, the lady who was painting and the two female guards did not know whether to laugh or cry! If such a person is a scum, silkpants and bastard, just what should be those so-called talents be called? Such a talented person with a scholarly poise and outstanding elegance. He was actually the number one silkpants of the Sky Bearing Empire!</p><br/><p>Wei XuanXuan’s mouth was wide open in shock. While the lady who was painting had disguised her appearance, she did not. Not only did she not disguise herself, she had purposefully dressed herself up today. In front of such a beauty, that white dressed man did not even take another look at her. Even if he did, his eyes were completely clear with his actions polite. A person like this was actually being called a scum?! Then what should those so called gentleman, who would drool with their legs going jelly when they meet a beauty, be called?</p><br/><p>In that moment, the four ladies became confused. Especially the lady who was painting and her two guards, they were completely filled with amazement. Don’t tell me the customs of the Sky Bearing Empire was this different? Only a real gentleman would be called a scum? While this was completely absurd, these three ladies thought that this was the only explanation for Ling Tian to be called a scum!</p><br/><p>As the four of them left their original positions, the painting attracted the attention of all the ladies. They all crowded forward and were in amazement as they saw it! Praises sounded endlessly!</p><br/><p>For these ladies to be called talented, they would naturally learn about zither, chess, painting, calligraphy, poetry and singing. Furthermore, they would be proficient with at least one or two of those skills. As the ladies saw this painting, they were all attracted to it.</p><br/><p>The realistic painting, together with the elegant brush strokes and graceful words, were all melded together perfectly. As the ladies saw the painting, they could not help but be drawn into it. The ladies here were all familiar with Wei XuanXuan and knew that while she was good at painting, she would not be able to paint such a perfect picture. If that’s the case, the painter would naturally be this ordinary looking lady by her side. All of a sudden, all of their gazes were directed to her.</p><br/><p>That lady gave a bitter laughter and knew that they had a misunderstanding, “Sisters, all of you have overestimated this younger sister. This painting is… brought from my home. I originally wanted to paint today but suddenly saw that the scenery was extremely similar to this painting. Thus, I took it out to admire it.” As she said halfway, she wanted to say Ling Tian’s name but suddenly stopped. She then thought to herself, “Although Ling Tian is called a silkpants by everyone, he is actually so talented. Don’t tell me he decided to conceal that on purpose? If that’s really the case, will I end up affecting him if I expose him to the attention of all the ladies here?”</p><br/><p>Being a smart lady, she decided to shut her mouth about the matter. It doesn’t matter whether or not he was trying to feign his personality, this matter should not be revealed by her. She then made a decision in her heart. She originally thought that he must have been a prince to freely enter the palace of a princess. She never expected that she was wrong. After she thought about what Ling Tian said, ‘isn’t this what Miss wants?’, she felt her heart ache as she lamented to herself, “With his wisdom, how was it possible for him to not see through my intentions? For him to leave without asking for my name, he may have misunderstood my intentions. I better clear up this misunderstanding. Since you are not a prince, it wouldn’t matter if I learnt painting from you.”</p><br/><p>After finding a legitimate reason to approach Ling Tian, she realized that she was unknowingly more cheerful. The depressed feeling which had accumulated in her heart had also disappeared. Hmph, hmph, not only will I want to learn painting from you, I want to see just how much you are hiding? Why are you doing so? No matter what, I will not believe that you are the person in the rumors!</p><br/><p>She then made a signal to Wei XuanXuan and her two guards, telling them to not reveal the truth of the painting. While the three of them did not understand why she would do so, they nodded in response.</p><br/><p>She then heaved a sigh of relief. In that moment, she began to feel strange about her own actions, “Just what is wrong with me? Why do I keep thinking about him? Why will my mood be affected by him? Don’t tell me…” She did not dare to continue thinking as she felt her cheeks beginning to burn.</p><br/><p>Then, one of the young lady present exclaimed, “This painting is really too beautiful! I have learnt how to paint since I was young and felt that I have made small accomplishments in these few years. But the moment I saw this painting, I felt as though I had always been like a frog in the well. My lousy painting skills is just totally incomparable to this Mister ‘Teary Dreams with Worldly Affairs’. If I am able to see him, I will definitely take him as my master.” her words were filled with longing.</p><br/><p>The other ladies then added on, “The drawing of this Mister ‘Teary Dreams with Worldly Affairs’ can be said to be the best in the world! I have never heard of anyone drawing something like this before!”</p><br/><p>As the young lady listened to their discussions silently, she could not help but smile proudly, “Hmph, I will not let you guys see him! If he does not reveal his secret, I will keep it in my heart forever!” Thinking about this, she could not help but give a sweet smile.</p><br/><p>As this moment, the young lady who was looking at the painting began to recite Ling Tian’s poem, “A tree up high, crowned in jade; myriads of twigs, drooping like silk; by whose design, your leaves so fine? Vernal February winds, like a scissors’ blade. What a good poem, good words, good painting! Can I ask this younger sister, was this poem left behind by this Mister ‘Teary Dreams of Worldly Affairs’?”</p><br/><p>“Indeed!”</p><br/><p>The young lady then sighed, “This Mister ‘Teary Dreams of Worldly Affairs’ is really extremely wise! I wonder where he is from, how old he is now?” As she said that, she gently stroked the painting with a face full of admiration. In her heart, someone who would be able to do such a painting is definitely a master who had spent many years to study painting and must definitely be an old man.</p><br/><p>The young lady who was painting could not help but cover her mouth as she giggled, “I also do not know. I have never seen before this amazing person. This painting was found by coincidence.” She was resolute to not let these ladies find out that this painting is done by Ling Tian, who was silkpants to the extreme in their eyes. “Hmph! Since all of you thinks that he is a silkpants, then let such an image continue in your heart! If I tell you this and all of you visit him every other day, together with the fact that all of you are in the same city, won’t you have a larger advantage…” She thought to herself with a smile on her face. But as she thought up till that point, she snapped out of her daydream, “What…what am I thinking? Why would I think about that? My goodness… don’t tell me…”</p><br/><p>With a sudden shout, the young lady looking at the painting looked at her hands with amazement, “Why would the ink on this painting stick to my hands?” All of the ladies then turned back to take a look at her hands. Indeed, her hands were filled with black ink!</p><br/>\n</div>"}