{"title": "Chapter 85", "id": 85, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-85", "volume_title": "Volume 1", "body": "<h1>Chapter 85</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 85: Teary Dreams of Worldly Affairs</p><br/><p>Translator: chuchutrain Editor: celllllLing Tian laughed heartily and said, “Miss is too polite.”</p><br/><p>The lady in question quietly observed the painting which Ling Tian perfected; the more she looked at it, the more her love for it, as well as her admiration for Ling Tian grew. She could not help but say, “Since young noble has already finished the painting, why not you proceed with the last step, and make this art piece a priceless family heirloom?”</p><br/><p>Ling Tian stared blankly for a while, before saying, “I would require your pointers for this!”</p><br/><p>The girl in question pursed up her lips into a smile. Although she only possessed mediocre looks, it seemed as though the myriad stars were coming out from those intelligent eyes of hers that sparkled. Looking at this pair of dreamy impeccable eyes, real yet ethereal at the same time, Ling Tian could not help but feel shocked in his heart.</p><br/><p>He then heard a gentle and sweet voice meekly saying, “Why not young noble add on a poem, to have both poetry and art reflect each other. Only then would the beauty of this painting fully manifest! This will also allow this little girl to admire your talents once again.”</p><br/><p>Ling Tian laughed heartily before saying, “This one here is of humble talent and shallow learning, I would be embarrassing myself if I tried to produce a poem. As for my talents, that would be even lesser to speak of. If I do this rashly, and end up profaning this miss’s eyes, then that would be a crime! Please do not put me in a spot, miss.”</p><br/><p>The eyes of the female in question flickered as though pondering, and she gave a light laugh, “This little girl’s request was too presumptuous in the first place. Since I would be leaving this place soon, I wouldn’t know if there would be a chance for me to meet you again. If young noble were to be stingy over a few drops of ink, then won’t it be a lifetime of regret for me if we do not meet again in the future?”</p><br/><p>The tone was gentle, yet the content was ruthless and forceful!</p><br/><p>Though this sentence had a hidden meaning, it was not difficult to unravel. ‘leaving this place soon’ as well as ‘wouldn’t know if there would be a chance for me to meet you again’ signified that she would not be staying for an extended period of time; ‘stingy over a few drops of ink’ as well as ‘won’t it be a lifetime of regret’, would mean that she was filled with admiration for this young noble who was outstanding in the arts. Finally, her sentence ‘if we do not meet again in the future’, hinted at a faint taste of a young girl in love, as well as a heavy feeling of helplessness.</p><br/><p>In this entire exchange, there was an indistinct indication of the lady trying to test him, yet filled with contradiction in her request. As such, Ling Tian could be sure that today’s performance allowed the tightly shut heart of the girl to question to crack open a little, enough to leave his image branded onto her heart.</p><br/><p>Right now, the artist girl herself had conflicting views innately. Part of her hoped that Ling Tian would live up to her expectations and perform a poem for her to keep as a memento; however she also secretly hoped that Ling Tian would be just as he said, of shallow learning and only well versed in the arts. If that’s the case, she could naturally erase the shock he had given her today and wipe him off from her heart.</p><br/><p>This also signified the contradiction of a young girl’s blossoming feelings, where she was attempting to find someone whom she could relate to, but was unwilling to be reduced to a prisoner of love. Thus, she intentionally tried to make things difficult for Ling Tian; if he made a fool out of himself, then her impression of him would as a result plummet straight to rock bottom! As such, even if they to meet again in the future, she would only treat him as an outstanding artist, a slightly different brother from another nobility. The lingering sentiment in her heart would also disappear without a trace without any further pining.</p><br/><p>Ling Tian smirked to himself, ‘Since I’ve already seen through your plan, then how could I let you escape from the grasp of my hand? Might as well! I’ll add on more colors to whatever image you already have of me!’</p><br/><p>Giving a smile as though he was unruffled, Ling Tian said unhurriedly, “A person does not know where he will go in his life, akin to the geese leaving footprints in the snow. While the snow contains the prints, it does not count for whatever the geese have flown. Life itself is erratic, we congregate and separate based on fate. Just like how the clouds gather and unfurl, everything is essentially the same! It’s alright, since this lady has spoken as such, then if this one were to reject you, it will not give a good impression of myself. If that’s the case, then even though it will be difficult for me, but this one shall give it a try and make a fool of myself. I hope that this young lady not to laugh at my mediocre calligraphy and crude words.”</p><br/><p>The eyes of the artist seemed to go slight blurry and fuzzy at this moment, her lips trembling slightly as they opened and closed slightly, repeating the poem that Ling Tian recited previously, “A person does not know where he will go in his life, akin to the geese leaving footprints in the snow. While the snow contains the prints, it does not count for whatever the geese have flown. Life itself is erratic, we congregate and separate based on fate. Just like how the clouds gather and unfurl, everything is essentially the same! Everything is essentially the same!” Her lips began trembling, her eyes seeming to have lost all spirit. Staring at Ling Tian who seemed unaffected by any and all mortal affairs, she felt as though there were huge waves generated deep in her heart! She took there blankly in a daze, to the point that she did not even catch the next few words which Ling Tian had spoken.</p><br/><p>The other young lady by her side nudged her gently, breaking the artist out of her reverie and she could not help but blush. Even the cosmetics on her face could not fully hide the blush, as it spread even to her fair neck. She could only gently whisper, “This little girl forgot herself a moment ago, please don’t take any offense for this, young noble.”</p><br/><p>Ling Tian understood clearly what happened in his heart, and lightly smiled, waving off her apology, “No worries.”</p><br/><p>The girl continued in that soft voice, almost like a whisper, “May I know if the great work that young noble has been mulling over is completed yet? This little girl is eagerly waiting to read it.” As she finished speaking, she blushed once again. The tone of her sentence actually carried a bit of coyness, with a few degree of impishness and some bashfulness. Lightly tiptoeing, she felt as though her whole body could simultaneously combust from the heat she released in her embarrassment.</p><br/><p>Behind her, the two middle aged women could not help but stop in shock, this was their first time seeing the little princess act like this from birth til now! They could not help but stare at each other with heavy expressions. They then directed their gazes towards the girl in question, theirs eyes filled with worry and panic.</p><br/><p>Ling Tian purposefully lingered his gaze on the artist’s body a tad longer than usual, before turning around as he spoke, “I’ve troubled this young lady to already wait for so long a time, how could I dare to be neglectful?” Even though his gaze was only a touch longer than normal, but how could that sensitive young girl not feel it? She could not help but tremble a little in response.</p><br/><p>The corners of Ling Tian’s mouth curled up, revealing a faintly discernible smiling expression. He raised up the brush and dipped it slightly in the ink. Steadying his breath, his brush suddenly flew out, the soft tip of the brush as though swimming on the pristine white paper, seeming like a dragon soaring through the vast heavens, then like a crane dancing on an immortal mountain. Using his one hand, a semi cursive calligraphy, like the fleeting clouds and flowing water, as though crafted by the heavens themselves, appeared beside the willows dancing in the wind.</p><br/><p>As though a refreshing breeze had sprung forth, with the bright moon overhead, a poem appeared on the paper without a single trace. The strokes were vigorous yet ephemeral, bold and imposing, elegant and refined! Just these few words lent an air of mystery to the entire picture, as though one was looking at a boundless horizon.</p><br/><p>A tree up high, crowned in jade,</p><br/><p>Myriads of twigs, drooping like silk,</p><br/><p>By whose design, your leaves so fine?</p><br/><p>Vernal February winds, like a scissors’ blade.</p><br/><p>When it came to the inscription of his name, Ling Tian thought for a while, but did not leave his name. Instead, he wrote down the four words “Teary Dreams of Worldly Affairs” on it. He thought to himself, “Since you have misgivings and want to draw the line clearly, then I’ll give you a dose of your own medicine! One must know that in order to truly appreciate what is good in this world, then one has to grasp the opportunity that is presented to them at the first opportunity! In the mortal world, once an opportunity is lost, one undoubtedly cannot turn back their head to request for it again. At that time, even if you are exceptionally talented under heaven, or an illustrious character with unlimited wealth, what would await you would still be the ‘Teary Dreams of Worldly Affairs’!”</p><br/><p>At the same time, Ling Tian innately celebrated the fact that he was a fan of Tang poetry in his previous life, and had something of actual use; else he would have definitely made a fool out of himself today!</p><br/><p>Putting down the brush by the side in a very graceful manner, Ling Tian did not even take a second glance at his poetry, his face retaining his natural and unrestrained flair. It was as though what he just wrote as of no big deal, nothing worth talking about!</p><br/><p>As for his act of plagiarism, Ling Tian did not feel that it was inappropriate, and even more unlikely to feel embarrassed. His line of thinking was, “Since this world does not have such things, then let me fill up that blank! Five thousand years of culture in China, let it also shine here in this world! Even if this world does not have the beautiful mountains and rivers that stretched for over eighty thousand miles!</p><br/>\n</div>"}