{"title": "Chapter 82", "id": 82, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-82", "volume_title": "Volume 1", "body": "<h1>Chapter 82</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 82: Princess Jiao Yue</p><br/><p>Translator: chuchutrain Editor: celllllThe duo in front dressed in pale yellow robes were Princess Jin Feng and Princess Jiao Yue respectively. Princess Jin Feng was the daughter of the Empress Yang Xue, while Princess Jiao Yue was the darling of the Royal Concubine Ling Ran. The Emperor favored this two princesses the most, which coincidentally was the 2 opposing factions. Right now, Princess Jiao Yue was beckoning towards Ling Tian excitedly.</p><br/><p>Ling Tian pulled a long face as he let out a long sigh, but he had no choice except to walk over; after all, Princess Jiao Yue usually took great care of him. Seeing that he approached her, she leaned beside him and whispered in his ears, “Little brother Tian, do you fancy anyone of them? If you feel embarrassed to tell your mother, this sister can help you!” As she spoke, her eyes revealed traces of mischievousness.</p><br/><p>Ling Tian face got even moodier as he stretched out a finger and gestured around the grand hall. He then replied softly, “Sister Jiao Yue, just with this? This bunch of ordinary people full of cosmetics, how could this little brother ever fancy them?”</p><br/><p>Princess Jiao Yue stretched out a slim jade-like finger, harshly rapping it on his head as she said with displease, “None of them even catches your eyes? All the beauties in the capital are already here, if this doesn’t do, then you can only accept the paddle and get beaten!”</p><br/><p>Ling Tian put on a salivating expression, retorting: “If I really cannot find one, then I can only bother Sister Jiao Yue to fulfill this little brother!”</p><br/><p>Her cheeks flushed red, Princess Jiao Yue shot Ling Tian a hateful look, before saying unhappily, “You only know how to talk nonsense! Why haven’t you gone to pick your one true love!” Although Jiao Yue was close to Ling Tian, the thought of bringing up marriage between them had never crossed her mind. Furthermore, with his infamous reputation, even though they were considered related, Princess Jiao Yue definitely would not dare to entrust her lifelong happiness to Ling Tian’s type of licentious young noble.</p><br/><p>Ling Tian opened up his hands, saying, “There really isn’t one that catches my eye, how about I just return home?”</p><br/><p>Princess Jiao Yue never imagined that her maternal cousin’s standards would be so high that even those well-groomed and well-brought up proud daughters of the upperclassmen would not be able to catch his eyes! She could not help but gape while staring at Ling Tian, unable to utter a word for quite a while. Only after a long awkward pause did she finally reply, with dying enthusiasm, “If these people outside cannot catch your eye, then you don’t need to go in as well, those inside will not even spare you a glance. Maybe you should head home.”</p><br/><p>Ling Tian’s eyes gleamed as he lowered his voice, “There are more inside?”</p><br/><p>Princess Jiao Yue only snorted, “Those inside are all females of talent, the reason why they all request to be situated inside the inner halls is because they are unwilling to associate with the licentious silkpants nobles such as you! Those inside are engaged in debates and poetry, calligraphy and painting, if you go in, won’t you end up as a laughingstock? You know nuts about any of those!” When she finished she sighed, having a headache for this maternal cousin of hers who did not even learn an ounce of the arts.</p><br/><p>Ling Tian’s eyes glowed even more, saying, “Turns out that all the arts associations are actually situation in the inner palace instead, I say, with so much noise on the outside, how can it have any atmosphere of learning and culture?”</p><br/><p>Princess Jiao Yue sighed, “I would have gone in after dealing with all of you rabble. As for Jin Feng, she is more interested towards lively scenes such as these and thus it would be better for her to stay here.” By her words, she totally did not place her half sister in her eyes at all.</p><br/><p>Ling Tian chuckled as he tried to placate her, “Sister Jiao Yue, why don’t you reveal to me who is inside? From which prestigious families did they come from?”</p><br/><p>Princess Jiao Yue shot him another glare as she said, “Don’t tell me you really want to go in and make a fool out of yourself? Forget it, once you go in, those rabble will also flock in to see, and disturb those refined young ladies, how is that nice? Furthermore, those people do not even want to see you, thus they requested for such an arrangement. Why force them to the edge? Even Jin Feng is of the same idea not to let any of you silkpants in.”</p><br/><p>Ling Tian let out a sigh that seemed to be full of disappointment as he replied, “Sister Jiao Yue, how about you just tell me the people that are inside then? Can’t I just get some good fortune for my ears?” He thought to himself that if those inside were that bunch of snobby and arrogant girls from the capital, then he would definitely not even take half a step in.</p><br/><p>Princess Jiao Yue did not know whether to laugh or be angry, “What use would it be for me to tell you just the names?” However she caved in after Ling Tian’s relentless pestering, “Alright, alright, anyway you can’t possibly recognize who they are just by their names, there’s Feng Ya, the History Official’s daughter, Jiang Wei from the Assistant Justice Minister, the Grand Physician Mister Su’s daughter Su Qian, and finally Shen Rou’er, the daughter of the Palace Hall General. The last two are the Rites Minister’s daughter as well as his niece. Will that do?”</p><br/><p>Ling Tian’s eyes shone, “The Rites Minister’s niece? Sounds unfamiliar!”</p><br/><p>Princess Jiao Yue laughed, “Not just sounds, but also looks unfamiliar. Her body is fantastic, however her face makes one not dare to compliment her.” She shook her head at that.</p><br/><p>Ling Tian smiled to himself, it seemed like the person with the most suspicion was likely to be the Rites Minister’s niece. His eyes swiveled as he suddenly said: “Sister Jiao Yue, then I’ll be going off!”</p><br/><p>Princess Jiao Yue finally panicked from her heart, grabbing hold of him, saying: “None of them really catches your eyes?”</p><br/><p>Ling Tian frowned as he shook his head, saying, “I’ll just go home and tell mother to look for my uncle, the Emperor, to ask him to marry you to me! There’s no other choice.” As he spoke, he sighed before walking out.</p><br/><p>Princess Jiao Yue was truly in a panic. If that jerk really did as he said, then in order to rope in the Ling Family, her royal father would most likely agree to such a matter! She could not help but feel muddled. Although she had no ill will towards her cousin, but with such a messed up reputation, how good could he actually be? Could it be that her lifetime happiness was going to be sent to the graves just like that?</p><br/><p>She grabbed hold of Ling Tian’s clothing and dragged him back, pleading, “Little Brother Tian, why not you look more closely and see if you can find one that you fancy?”</p><br/><p>Ling Tian merely snorted, “With just these? I see them seven to eight times a day, how can I still not discover anything? Since you don’t allow me to go in and find myself a wife, then you just make the preparations to be married into the Ling Family!” As he spoke, he suddenly leaned in with a smile on his face, lightly whispering, “I’ve actually admired Sister Jiao Yue for a long time already!”</p><br/><p>“Go and die!” Jiao Yue fumed and kicked Ling Tian’s shin viciously. The first time she got confessed to, was actually from her licentious maternal cousin, she could not help but feel angry yet embarrassed.</p><br/><p>Ling Tian screamed out in pain, and prepared to bade his farewell.</p><br/><p>Jiao Yue however blocked him again, and this time with a sweet smile, saying, “Little Brother Tian…” her voice overflowing with honeyed loveliness.</p><br/><p>Ling Tian’s body simultaneously broke out in cold sweat as he laughed dryly, “Is there a problem, Sister Jiao Yue? If you got nothing else for me, then this little brother here will return home to ask my mother to propose this marriage on my behalf.”</p><br/><p>Seeing how Ling Tian continued to haggle on this matter, refusing to let it rest, Jiao Yue could only grit her teeth in anger, almost flipping out. She decided to restrain herself as she snorted, “You only want to have a peek inside the inner palace hall, I can handle that and let you in! This time, after I let you in, you must promise that whether or not you see anyone you fancy, you cannot have any more thoughts about me!”</p><br/><p>Ling Tian let out a satisfied smile, nodding his head like a hen pecking for food, “That goes without saying!”</p><br/><p>After hesitating for a split second, Princess Jiao Yue then continued, “Only you are allowed, not one more can go with you!”</p><br/><p>Ling Tian nodded as he thought to himself, “Even if someone wanted to go in, I would also throw him out. Such an important plan, how could I afford to be negligent?”</p><br/><p>Princess Jiao Yue moved closer to his ears and whispered, “For the time being, you pretend to leave. Wait at the palace doors, I’ll ask a palace maid to escort you from the back door.”</p><br/><p>“Heh heh, the Imperial palace actually has a back door!” Ling Tian was secretly amazed, however he loudly said, “Disappointment! What an absolute disappointment, if I knew I would have met with something like this, this noble might as well have gone to the Heavenly Fragrant Pavilion for a couple of cups! Time to go, this place is too noisy.”</p><br/><p>All the silkpants looked at each other, unsure of what curse this young noble was inflicted with this time.</p><br/><p>Wang Bo made a bitter face, “Brother Ling, there are 3 days and you want to leave on the first day? Can’t you stay here to accompany your brothers? He was amidst a cluster of blooming flowers, feeling the touch of spring, but upon seeing that Ling Tian wanted to leave, he could not help but urge him.”</p><br/><p>Ling Tian huffily spoke, “Seeing that surnamed Yang, I’ve already lost all interest. Goodbye!”</p><br/><p>Yang Wei poked his head out among the mass of powder that was the females, “Don’t worry Ling Tian, I also feel disgusted when seeing you!”</p><br/><p>Ling Tian wolf whistled loudly, the sound echoing across. Upon seeing all attention directed to him, he then heartily laughed, “You were impotent from the start, whether you see me or not doesn’t really help your cause!”</p><br/><p>Amidst the great roar of laughter that followed, Ling Tian ran out like the wind, not bothering to wait for Yang Wei’s reply.</p><br/><p>When he reached the palace doors, a petite figure suddenly blocked his route, it turned out to be NanGong Yu. One only saw her grit her teeth and say: “Surnamed Ling, the shame and humiliation you’ve brought onto this lady today, I’ll return it to you double!”</p><br/><p>Ling Tian merely laughed coldly, without a care at all. He pushed her away and continued walking out. Let alone a NanGong Yu, even the entire NanGong Family would not be placed in his eyes!</p><br/><p>Seeing Ling Tian’s fading silhouette, NanGong Yu bore an ashen face, her eyes looking as though fire could burst out from them.</p><br/>\n</div>"}