{"title": "Chapter 83", "id": 83, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-83", "volume_title": "Volume 1", "body": "<h1>Chapter 83</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 83: Making Friends Through Painting</p><br/><p>Translator: chuchutrain Editor: celllllLing Tian followed the palace maid for a detour, for an estimated three to four miles before he finally saw the copper peacock weather vane of the Eternal Music Palace. A small door was there. Most likely, this was used by the eunuchs and palace maids to enter and exit the palace to attend to their own private matters.</p><br/><p>The maid pointed towards a direction after bringing him in, and hurriedly left.</p><br/><p>Ling Tian did not bother to be polite, and immediately walked proudly towards the inner courtyard there.</p><br/><p>For the first time in his life, Ling Tian turned on his spiritual sense before he even reached his target. He wanted to know if the niece of the Rites Minister was the little princess of the Yu Family. If she was the one, there would be experts secretly guarding her for sure. If he did not spot any arranged experts, then this would mean that the niece was not the princess he was looking for. If that was the case, there was no point in Ling Tian going in.</p><br/><p>He was nearing the inner courtyard, and Ling Tian, focusing all his spiritual sense to his ears, was able to faintly hear voices, as well as smelling the slight fragrance of silk.</p><br/><p>Another 10 steps forward, and he stepped into the inner courtyard. Within the green leaves and red blossoms, one could clearly see the conspicuous figures of lithe bodies moving around.</p><br/><p>Ling Tian wore a faint smile on his face, as he had already spotted his targets. Those two had reserved auras, but were unable to escape his spiritual sense. Being able to withdraw their aura, those two were undoubtedly experts! However, this sort of standard and at this stage, although they had the qualifications to make Ling Tian raise his eyebrows, they could not even enter his eyes.</p><br/><p>Ling Tian weighed his options in his heart, among his followers, even Ling Chen would be able to easily break the combined forces of both the guards. Other than Ling Jian, Ling Chen and Ling Chi, the rest such as the Blood Iron Warriors would only be average, and those in the weaker spectrum would even need to combine forces to deal with one of those experts.</p><br/><p>With the two guards here, Ling Tian could almost confidently say that the niece of the Rites Minister was actually the little princess of the Yu Family. Most likely, the third aura which was a little weaker yet even more reserved would be the little princess.</p><br/><p>Ling Tian smiled to himself, before directly walking towards the direction of the trio. Right now, Ling Tian had already kept all his internal energy. With the capabilities of those three, although Ling Tian was sure that they would not be able to discover his aura he was releasing, prolonged usage of it would exhaust his inner Qi. Best to save whenever he could.</p><br/><p>Surrounded by layers of green leaves was a pristine jade tabletop. In front of it was a small pool with a strange looking bluff on it, surrounded by azure jade. The top of the bluff was scattered with a few stalks of grass and flowers. Amongst the azure jade swam a school of red colored fishes, and beside the pool were a few stalks of willows, gently dancing with the breeze.</p><br/><p>Right now, seated at the jade tabletop, with a pristine piece of paper in front of her, a young lady in white was bent over, with her brush angled as though ready to write or draw something. From Ling Tian’s point of view, he could not see her facial features. However, from that raven colored hair of hers, sharply angled shoulders, and her slim waist which seemed to be able to fit into one hand, one could conclude that even if she did not look good, she would not be too bad as well. The natural refined and elegant charm she was exuding as well was seldom seen by Ling Tian in this life.</p><br/><p>It was a feeling that could be put into words, ephemeral and yet concrete. One could feel it yet not see it, but know that it existed. In that moment, Ling Tian only had two words in his heart: Natural grace. Eyeing the girl in front of him, although he could not see her face, he already felt that this girl could not be brushed off with a simple ‘charm’ word, but rather a ‘natural grace’ would be closer for the description, albeit barely being able to describe her.</p><br/><p>In just one look, Ling Tian suddenly felt a burning interest towards the girl who was stooped over, engrossed in painting! This sort of feeling, from his past life till now, was the first! To think that such a feeling came from merely her back view! Shaking his head, Ling Tian could not believe that he could have this sort of feelings just from a look.</p><br/><p>Behind the young lass stood 3 women. Two of them were already past their prime, one with graying hair and another around forty years of age. The third was similar to the artist, a young and pretty lass. However, Ling Tian could not recognize her and deduced that she would probably be the daughter of the Rites Minister.</p><br/><p>The moment Ling Tian stepped out of the alleyway, the two middle aged women immediately turned to look at him, both eyes seeming to shoot electricity towards him.</p><br/><p>Ling Tian timed it perfectly, letting out a blank stare in shock. Then, he nodded and smiled before walking slowly over.</p><br/><p>Because this was the Imperial Palace, those who could step in here were definitely royalty. This set of special circumstances led the two women to believe that Ling Tian was probably a royal prince. After hesitating, they opened up a path for him.</p><br/><p>The artist in question did not even lift her head, completely unaware of the presence of Ling Tian.</p><br/><p>Ling Tian stilled his breath before slowly walking over the jade tabletop, casting his eyes onto the painting.</p><br/><p>The pristine white paper was almost fully filled, what was drawn was the pavilions and halls in front of her, even the bluff and the pool was vividly portrayed on it. Right now, the lass was in the process of drawing the willows dancing in the breeze. However, the dancing of the willows in the spring breeze, was a faintly discernible realm, the hardest job as the artist was to capture this sort of ethereal feeling. The lass seemed to be struggling, her brows furrowed and unable to fully commit her brush.</p><br/><p>As Ling Tian scrutinized the work, he realized that while the lass’s brush skills were adept, they were lacking a sort of life to them. Though what she was drawing was seemingly realistic, they were not lifelike at all. Although he knew that the paintings of this world were all as such, but Ling Tian could not help but let out a soft sigh. Could it be, that even such a soul stirring girl like her only had such a standard?</p><br/><p>Ling Tian’s unintentional sigh alarmed the two ladies, one the artist and the other the observer. Both of them involuntarily lifted their heads to look.</p><br/><p>What surprised Ling Tian the most was that the lass with the soul stirring charisma actually bore a suntanned face, although it wasn’t ugly, she definitely could not be termed as a beauty. Only that pair of elegant and witty yet apathetic pair of pupils glistened bright and dazzlingly.</p><br/><p>Ling Tian took in her gentle as jade looks, with that clean white yet lofty and tender waist, as well as that snow white half covered neck, and could not help but lift up the corner of his lips in a smile, thinking, “Looks like this lass concealed her appearance.”</p><br/><p>The two females suddenly saw that, in this place which the princess resided and where all males were prohibited, there was an exceedingly handsome young noble all of a sudden. He had brows sharp as swords and eyes bright as stars. Other than being surprised, they immediately realized that, other than a member of royalty, how else would a male be able to enter into this place?</p><br/><p>The artist slightly inclined her head as a form of greeting, saying, “A moment ago, I heard that young noble’s sigh contained traces of regret, may I ask why is that so?” She actually did not even bother with Ling Tian’s identity, and immediately jumped to the main topic. Of course, she was afraid that if his identity was made known, all of those etiquette from meeting royalty would be troublesome. Thus, she might as well take it as a coincidental meeting for strangers, and would part ways after a while, saving her the trouble.</p><br/><p>Ling Tian could not help but praise her wits, since she did not want to bring it up, Ling Tian would naturally happily comply. He witnessed how she spoke, as though talking to a long-time friend, and could not see a girl’s airs about her, her speech being natural and unrestrained.</p><br/><p>Ling Tian lightly smiled and said, “It is of no consequence, it was just that upon seeing this lady’s painting, no matter the wielding of your brush, the usage of the ink as well as the brush strokes, all have the bearing of a grand master. This one could not help but feel admiration.”</p><br/><p>Both of the ladies’ eyes lit up, and the artist asked, “If that’s the case, then why did young noble have so much regret in your sigh?”</p><br/><p>Translator’s Thoughtschuchutrain chuchutrain</p><br/><p>It’s getting interesting now!</p><br/>\n</div>"}