{"title": "Chapter 89", "id": 89, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-89", "volume_title": "Volume 1", "body": "<h1>Chapter 89</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 89: Ling Tian’s Aspiration</p><br/><p>Translator: DavidT Editor: celllllThe next moment, all the ladies present looked over. The young lady who was painting also never imagined such a thing to happen and became anxious.</p><br/><p>Wei XuanXuan who had been watching silently by the side had already understood the thoughts of the young lady who was painting and replied calmly, “I believe it’s because of the humid atmosphere since we are beside a pond. Younger sister, it’s best you keep this painting. This painting is extremely precious, if it were to be ruined by water, I’m afraid…” As she said that, Wei XuanXuan gave a profound smile but did not continue. It was as though she intentionally emphasized on the words ‘precious painting’.</p><br/><p>“Yes, yes! I thank elder sister for your reminder. This little sister was only interested in viewing the painting and forgot about that.” The young lady replied cheerfully and look towards Wei XuanXuan with praise, admiring her quick wits. As for the words which Wei XuanXuan emphasized on, she had completely ignored it, making Wei XuanXuan roll her beautiful eyes.</p><br/><p>Under the envious gazes and sighs of all the ladies, the young lady carefully kept the painting. Looking at the reluctant gazes of the people present, she said with a smile, “If sisters would like to look at it, we can just go to a room.”</p><br/><p>Only then did the ladies become excited, crowding around the four of them and taking a seat. They then broke out into chatters and laughter. Only Princess JiaoYue was not familiar with painting and did not have much interest in it. Princess JiaoYue only studied the young lady’s expressions and noticed the unnatural expressions that she had. At this moment, doubt filled Princess JiaoYue’s heart as she tried to make a guess but to no avail. But if she were to say that this painting was painted by Ling Tian, Princess JiaoYue would be the first to disagree to it.</p><br/><p>Ling Tian then brought his guards and left the imperial palace. As he was on his way back to the Ling mansion, he began to think about everything he saw, heard and experienced today.</p><br/><p>Just like the saying, ‘understanding the leopard with a single spot’, this saying described what Ling Tian felt right now. Based on Ling Tian’s original guess, the little princess of the Yu family would have at least four experts guarding her. Even with such a lineup, they were able to completely hide from his information net, without a single bit of the news leaking out! This was something extremely difficult.</p><br/><p>Furthermore, this little princess of the Yu family actually appeared in the heavily guarded imperial palace with three experts guarding her. Besides that, there was even a super expert amongst the three guards! This had completely overturned what Ling Tian guessed previously. Just from this point alone, she would have at least two super experts by her side. As for ordinary experts there should be at least 10 of them! These lineup of guards were probably the mere tip of the iceberg for the Yu family!</p><br/><p>If he were to follow along this estimation, the might of the Yu family was indeed deep and immeasurable! Ling Tian rejoiced in his heart, “Thankfully I realized that something was wrong from the beginning, being more careful. If I made a rash move and showed off all my abilities, I would have probably been…”</p><br/><p>According to Ling Tian’s estimate, the person hiding in secret is probably comparable to Ling Jian in strength! It was extremely rare to have an expert like that, but the Yu family definitely has more than one or two of them. As for the one running the Yu family, he is definitely much more powerful!</p><br/><p>The way Ling Tian saw it, the Yu family should not have any fear in this continent! Ling Tian was just puzzled about why the Yu family was still in hiding, even though they had such powerful strength. In fact, they tried their best to conceal their strength. If one or two generations did not dare to make a move, that was still understandable. But for a gigantic family like the Yu family to remain in hiding for a thousand years, that was extremely strange!</p><br/><p>A thousand years! The Yu family did not have anyone ambitious at all? Ling Tian would definitely not believe that! But just what was the reason behind it?</p><br/><p>Ling Tian felt a great headache! Before this, he had always wanted to know the strength of the Yu family. Now, he is able to make an estimation from the little princess of the Yu family. But the moment he understood it, he fell into a greater mystery! “For them to remain in hiding even with such strength, they must have apprehensions about something else!” Ling Tian thought to himself, “But just what organization could make the Yu family apprehensive?”</p><br/><p>“If the Yu family, which had a thousand years of accumulation, has apprehensions and remain in hiding, what can the power in my hand be considered?” Ling Tian could not help but laugh bitterly, “It seems that while I made long term plans, I underestimated this world. I underestimated the heros of this world!”</p><br/><p>The guards who followed behind Ling Tian noticed that he had been lowering his head in thought ever since he came out from the imperial palace with his eyebrows furrowed. It was as though he met with something unpleasant in the imperial palace and was feeling sulky. Thus, they did not dare to say anything and only travelled silently along the streets with only the sound of the horses’ hooves being heard.</p><br/><p>After entering the Ling mansion, Ling Tian handed the horses to the servant by the door and went to the courtyard he was staying at. While it was only a guess and he had only seen a small fragment of the Yu family’s might, Ling Tian’s heart still grew heavy. Some of his original arrangements must be changed immediately!</p><br/><p>“Stop there!” A loud cry sounded, full of majesty. His mother, Chu Ting’er, had arrived.</p><br/><p>Ling Tian laughed bitterly as he thought to himself, “The debt collector is here.”</p><br/><p>It was not that Ling Tian had never thought of telling everything he was doing in secret to his mother to ease her worries. But everytime he had the urge to come clean with her, he would suppress the thought. There was no other reason, with Chu Ting’er’s wisdom, she definitely had the rights to know about those matters and would definitely not leak them out.</p><br/><p>But the problem was that she was just too close to Ling Xiao and she would definitely not be able to hide it from him. But Ling Xiao was completely loyal to the Sky Bearing Empire and was filled with gratitude towards the current emperor; they even had a deep brotherhood between them! If his father were to find out about what he was doing, his father would probably realize what his intentions are! At that time, his father would definitely fly into a rage and it would be a miracle if his father does not tie him up and present him to the emperor. The organization which he had spent so much effort to build would definitely be confiscated by his father for sure. Such an outcome is something which he definitely cannot accept!</p><br/><p>Ever since he came to this world, he had never placed the royal family in his sights. He was influenced greatly by the phrase Sun WuKong said in the ‘Journey to the West’, “The emperors would change every now and then. Next year, it will be my turn.” Since he had already arrived in this world, how can he not leave something behind and make a legacy for himself. How can he come here just to kowtow to people all day?</p><br/><p>Since he had already died once, if he were to fail in this world, he would just die again. It wouldn’t be much to him. However, his ambitions much not be changed! I, Ling Tian, did not come here to bow down to people. I also did not come here to be a sperm bank and find a few wifes. I am called Ling Tian and I will rule the world!</p><br/><p>If he does not make a legacy for himself, it would be letting down the heavens for letting him come to this world! It would also be letting down his own name!</p><br/><p>Ruling the heavens! Controlling the heavens! Grasping all authority under the skies and being filled with beauties all around! This is the life that I, Ling Tian, wants! Without strength, even if I were to marry the most beautiful lady in the world, I will not be able to keep her.</p><br/><p>Be it the previous life or this life, no matter what world, strength is the most important! If you are only a pauper, would you dare to fall in love with a princess? But what if you become the owner of the world?!</p><br/><p>I, Ling Tian, will never give up! I will grasp this world in my hands! No matter what the obstructions, I will kill the gods if they stop me, kill buddha if buddha stops me!</p><br/>\n</div>"}