{"title": "Chapter 98", "id": 98, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-98", "volume_title": "Volume 1", "body": "<h1>Chapter 98</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 98: Battle of Wits</p><br/><p>Translator: DavidT Editor: celllllLing Tian smiled and said, “Mother, if you continue staring at them like that, you will scare these two beautiful ladies.”</p><br/><p>Chu Ting’er then grunted as she thought to herself in frustration, “This child, having such a glib tongue in front of the two ladies. What if the both of them end up misunderstanding him?” She could not help but glare at Ling Tian.</p><br/><p>Thinking about how the two ladies were here to find her son, it didn’t seem right for her to still be present. Thus, Chu Ting’er stood up and said, “Tian’er, since the two ladies came here specially to look for you, they must have something to discuss with you. Your mother is a little tired and I will be going back to my room first. XuanXuan, tell your mother that I will definitely pay her a visit at a later date.”</p><br/><p>Both the ladies stood up and sent her off with a bow, “Thank you auntie, let us send you off.” They also heaved a sigh of relief at the same time.</p><br/><p>As Chu Ting’er saw how both the ladies were relieved of a burden as though they could not help but wish she was gone, she laughed in her heart. When she walked to the door, she sent an eye signal to Ling Tian, signalling him to find her. She then whispered to him, “This XuanXuan isn’t too bad, mother likes her a lot. Tian’er you must grasp this opportunity well, if…” As she said that, her face turned red as she nudged Ling Tian to walk out a little further with her.</p><br/><p>Ling Tian was extremely clear that his mother wanted to teach him a trick or two and could not help but laugh bitterly. While Chu Ting’er was ignorant, Ling Tian knew that it was impossible for these two ladies to be alone — the two experts would have definitely followed them here. If his mother gives him some rotten idea in desperation for a daughter-in-law, it would definitely be heard by the both of them. While he would not mind, it would not be good for his mother’s reputation.</p><br/><p>Chu Ting’er, who wanted to teach some last minute tips of how to woo a lady to her son, realized that her son completely did not understood what she meant. His eyes were only fixed on the two ladies as his body did not budge an inch.</p><br/><p>“Fool! Idiot!” Chu Ting’er was both angered and anxious in her heart. But, since she had already said that she was going to take her leave, she could only leave with a stomach full of resentment, cursing Ling Tian along the way.</p><br/><p>Seeing Chu Ting’er leave, the three of them let out a heave of relief in unison. They then could not help but stare at each other as they burst out into laughter. As they laughed, the distance between the three of them narrowed all of a sudden.</p><br/><p>Ling Tian then opened his mouth first, “I wonder what both of you ladies are looking for me for?” Although he was extremely clear why they looked for him, he feigned ignorance on the surface.</p><br/><p>Both the ladies focused their gaze on Ling Tian as Yu BingYan said with a smile, “Mister ‘Teary Dreams of Worldly Affairs’, we meet again. Haha, Young Noble Ling Tian really hid yourself well. Your schemes really makes this little sister admire you.” However, she did not answer Ling Tian’s question but made a joke. Her meaning was obvious, “Since we already saw through your disguise, there is no need for you to act like a silkpants in front of us.”</p><br/><p>Ling Tian gave a wide smile as he said, “I’m guilty, after seeing that both of you ladies were unfamiliar and that you were painting, I could not help but have a go at it, disgracing myself. I thought that we would be strangers in passing and not meet each other again, But, I never expected the both of you to be so resourceful, finding where I stay. Rest assured, if I, Ling Tian, still acts like a silkpants, that would be too disrespectful.”</p><br/><p>Ling Tian’s words explained why he revealed his talents as he subtly indicated that it was a casual gesture of his with no intentions of getting to know the both of them. Thus, it made it seem as though he had no ulterior motives behind his actions and he was a gentleman.</p><br/><p>Both the ladies smiled as each other and Yu BingYan asked again, “I wonder why young noble concealed yourself as such? Why go to such lengths?”</p><br/><p>Ling Tian responded with a laugh, “Both of you ladies are considered smart and understand my Ling Family. Why is there a need to ask such a question?”</p><br/><p>This brat is indeed a good talker! While he answered their question, it can be said that he did not answer them at all, as good as saying nothing. The reason why Ling Tian was concealing himself was a huge taboo for anyone present to mention it. The both ladies felt extremely depressed.</p><br/><p>Yu BingYan then composed herself and did not beat about the bush any further, “Back then, this little sister saw your mystical painting skills and deeply admired you in my heart. Today, I paid a sudden visit to young noble in hope that you can teach me.”</p><br/><p>Just when Ling Tian was laughing to himself as he saw how the both of them were stumped for words, Yu BingYan suddenly cut to the chase. He could not help but praise in his heart, “This little princess of the Yu family is indeed extraordinary, with every single word of hers so gentle but yet so strong.”</p><br/><p>Yu BingYan’s words sounded extremely simple, it first stated her purpose for coming to answer Ling Tian’s previous question. At the same time, it was to prevent herself from being led on by Ling Tian’s words. Furthermore, she purposefully emphasized on how she witnessed his mystical painting skills to remind Ling Tian that if he did not agree, his secret would no longer be kept.</p><br/><p>Ling Tian laughed bitterly, “Forgive my rudeness, but I have not asked this little sister for your name.” At the same time, he joyfully thought to himself, “This is the greatest benefit of acting as a silkpants. If not, how can I call a random lady who I just met a little sister?”</p><br/><p>Yu BingYan was stunned for a moment as she realized that she had only been calling herself ‘little sister’, and had not introduced herself yet. The words of Ling Tian was obviously trying to tease her! She could not help but be embarrassed and angered as she said hatefully, “This little girl has the surname Yu, Yu BingYan.”</p><br/><p>Ling Tian snickered in his heart, after hearing how she called herself ‘little girl’ instead, it was obvious that she was dissatisfied. With a smile, he said, “The autumn waters as god with the frozen jade as colors. This little sister has a good name! It seems that the one who came up with this little sister’s name is also an exceptional person. I wonder who is this talented figure?”</p><br/><p>Yu BingYan was stumped as she thought to herself, “This fellow is obviously trying to find out my origins. He is actually trying to find that out from my name. Furthermore, he is able to maintain such a calm disposition when asking that. It seems that when he heard my surname, he already had an idea of where I came from.” Only then did she realize that she had already fell for his trap. In embarrassment and anger, she had given out her name. In this generation, it was a completely different meaning for a lady to give her name to a guy.</p><br/><p>Thinking about this, her face could not help but burn as she heard him calling her ‘little sister’ again. Looking at the smirk of self satisfaction which Ling Tian seemed to have, Yu BingYan was both abashed and angered as she scolded, “Since you have already guessed it, why bother asking?” As she said that, she was also shocked by her own tone as she thought, “Just what is wrong with me? Why am I so easily influenced by him?” She could not help but take a few deep breaths in order to calm herself down.</p><br/><p>Ling Tian laughed, “That’s right. So, this little sister is indeed born in an aristocratic family. No wonder you carry yourself with such a dignified and graceful bearing.” At the same time, he snickered in his heart, “Lass, it is far too late for you to find out now.”</p><br/><p>However, Ling Tian’s words gave Yu BingYan a misconception, “So, he was only guessing previously but did not dare to be certain. It seems that my words were akin to confirming his guess.”</p><br/><p>As she thought about that, she was no longer willing to be on the defence. Thus, she initiated an attack, “Young Noble Ling says that this little sister has a graceful bearing. But, this little sister’s appearance is not worth mentioning at all. It seems that you are ridiculing this little sister’s ugly appearance?”</p><br/>\n</div>"}