{"title": "Chapter 100", "id": 100, "volume": 1, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-100", "volume_title": "Volume 1", "body": "<h1>Chapter 100</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 100: Apprentice</p><br/><p>Translator: DavidT Editor: celllllIn the study, everything was neatly placed. The bookshelf was neatly arranged with books, and everything on the table was well organized. On the snow-white wall, a few paintings and calligraphy hung on it quietly. The words were all in cursive and the painting was done with paint splashing, with the both of them complementing each other well.</p><br/><p>Outside the window, there was a small bamboo cluster swaying gently in the winds. In front of the window was a jade flute which was completely white in color and clarinet in deep purple.</p><br/><p>The two female guards waited outside as Wei XuanXuan and Yu BingYan followed Ling Tian in. The moment they entered the room, they could feel that the room was extraordinary.</p><br/><p>As they raised their heads, they could see the painting and calligraphy hanging on the wall. The difference between both the ladies showed immediately at this moment. Yu BingYan walked towards the painting as though she saw a treasure, studying it bit by bit with all her focus. As for Wei XuanXuan, she walked towards the words with a gentle smile, admiring the poem word by word.</p><br/><p>“There is no need to listen to the raindrops. Why not hum a tune as you stroll casually through the rain? The bamboo staff and straw shoes are better than a horse, what’s there to be afraid of! A raincoat made from straw is enough to spend a lifetime in the rain. The chilly winds made me sober from the alcohol. In the chilly winds, the warm setting sun was welcoming me just over the mountain peak. Looking back at the rainy place I came from, I wandered back there aimlessly! Since I am not fearful of the wind and rain, I am not fearful of the sunlight!” In the start, Wei XuanXuan was quietly admiring the poem. But after the saw the lines of words, she could not help but recite them as a look of excitement filled her face.</p><br/><p>“Good poem! A really good poem! What a beautiful concept! What a carefree heart! Young Noble Ling, is this one of your works?” Wei XuanXuan turned back, with her eyes burning with passion even exceeding Yu BingYan.</p><br/><p>Ling Tian then nodded his head calmly as though it was only to be expected, “That’s right, this is my humble writing which is nothing more than sentimental nonsense. I really made a fool out of myself!” Ling Tian replied humbly.</p><br/><p>If the late Su Shi were to hear him say this, he would definitely get up from his death just to strangle this brat, fighting him to the death. [1]</p><br/><p>Wei XuanXuan’s smile was filled with admiration as she said, “Young Noble Ling is too humble.”</p><br/><p>At this moment, Ling Chen walked in quietly with a tray of tea. Ling Tian also made use of this opportunity to change the topic away from this slightly uncomfortable one, drawing their attentions to the tea that was served. While there wasn’t a Su Shi in this world, Ling Tian wasn’t too comfortable with making the works of others his own.</p><br/><p>Both the ladies walked out from the shock Ling Tian created at the same time. As they looked towards each other, they could see the bitterness and excitement in the other party’s eyes. No matter who it was, if they were to realize that they could not hold a candle at all to someone else in the area they were most proud of, it was inevitable for them to feel dejected.</p><br/><p>Yu BingYan first walked over. Just when Ling Tian wanted to serve them tea, Yu BingYan’s hands shot out swiftly and snatched the teacup, which Ling Tian was about to grab, into her own hands.</p><br/><p>This action of hers was extremely swift, displaying how she was indeed born in the Yu family and had a set of extraordinary martial arts as well. However, Ling Tian was shocked in his heart as he felt doubtful.</p><br/><p>While Yu BingYan’s actions were really swift, it was nothing in Ling Tian’s eyes. Even Ling Chen was far faster than her in terms of speed. From this point, it can be deduced that Yu BingYan’s level of martial arts was only equivalent to her two female guards. This was the point which Ling Tian was confused about.</p><br/><p>The little princes of the Yu Family, which had a thousand years of martial heritage, would have definitely been trained since young. According to that logic, Yu BingYan’s martial arts should be a head above the rest at her age. Even if she isn’t comparable to Ling Chen, she shouldn’t be too far off. But the truth was, Yu BingYan’s martial arts is extremely poor! While her speed was fast and movements agile, it was unable to conceal the fact that she had shallow Inner Qi!</p><br/><p>Why is this the case? From the two experts he saw, Ling Tian was sure that the Yu family had the ability to groom Yu BingYan into someone who was peerless in her generation! Did the Yu family not do that? Or is there another reason? As Ling Tian thought about those questions, he looked towards Yu BingYan with an investigative gaze.</p><br/><p>As Yu BingYan saw the doubt in Ling Tian’s eyes, she only thought that Ling Tian was puzzled about why she snatched his teacup. She could not help but smile as she stood up straight, lifting up the teacup with both her hands. Then, she served it to Ling Tian annd bowed down respectfully — This was a formal bow for an apprentice to seek a teacher!</p><br/><p>Ling Tian was startled as he jumped up and responded anxiously, “Yu… little sister, what are you doing?” Although Ling Tian already knew that the both of them were here to learn painting, he never expected the little princess of the Yu family to make him her formal teacher! Ling Chen, by the side, also had her eyes widened in shock.</p><br/><p>Yu BingYan then said respectfully, “I hope that Young Noble Ling will accept me as your apprentice to teach me painting.” At the same time, she was depressed in her heart as she thought, “If I do not establish master and apprentice ties between us, I would be doing great harm to you if the both of us develop a relationship in the future.”</p><br/><p>After a few encounters, Yu BingYan knew that she already had an extremely favourable impression towards this suave and knowledgeable youth. If she does not nip it in the bud and continue to interact with him, she will probably fall in completely. If that’s the case, Ling Tian and his family will also be dragged down to eternal damnation! After giving it much thought, she suddenly thought of recognizing him as a master. She thought that as long as they had a proper master-disciple status, she would definitely not think too much about the matter. It would also help her to avoid some awkwardness and she will be able to learn the painting skills which she had dreamt of! This was akin to killing many birds with a single stone.</p><br/><p>Ling Tian quickly waved his hands in rejection, “No no, definitely not. Both of us are similar in age and it is sufficient for us to exchange knowledge as peers. I will definitely not withhold anything from you. Why is there a need to recognize me as your master? Little sister, aren’t you trying to torture me?”</p><br/><p>Yu BingYan continued to remain bowed as she said, “If Master does not agree, I will not get up.” At the same time, she thought, “You fool… I am trying to protect you…”</p><br/><p>Wei XuanXuan, who was by the side, also persuaded, “Young Noble Ling, my cousin sincerely wants to learn how to paint. Why must Young Noble Ling reject her? It is best for you to just agree.” At the same time, she sighed in her heart, “My foolish sister, you really gave the matter so much thought!”</p><br/><p>Ling Tian shook his head hard, “Definitely not. Miss Yu, it is best for you to get up, I can never accept this matter! If this matter were to spread, won’t I become the greatest laughing stock in the world?” In anxiousness, Ling Tian also changed the way he addressed her from ‘little sister’ to ‘Miss Yu’.</p><br/><p>Yu BingYan said with disappointment, “Don’t tell me that Young Noble Ling thinks that I am utterly hopeless to teach?”</p><br/><p>Ling Tian was forced helpless by her, rubbing his head with a frustrated expression. Suddenly, he had a flash of brilliance as he smiled, “Says who? I only said that I will not accept you as an apprentice, since when did I say that I will not teach you painting?”</p><br/><p>Yu BingYan’s body shook as she looked up and asked, “I wonder what Young Noble Ling means by this?”</p><br/><p>Ling Tian made use of that opportunity to help her up as he said with a smile, “You’re still calling me Young Noble Ling? I have called you little sister so many time already. Is there any reason for an elder brother to not teach his little sister? Little sister, if you are not willing to call me brother, you should be willing to call me elder brother, right?” In good mood, he could not help but tease her. [2]</p><br/><p>Yu BingYan stood up straight as her heart turned blank. Her original intent was to force him out, but this foolish pighead decided to just charge in straight! Just what should she do?</p><br/><p>Seeing how she was at loss, Ling Tian joked, “I never imagined that Miss Yu looked down on this silkpants.”</p><br/><p>Yu BingYan sighed deeply in her heart as she said, “This little sister will just listen to what elder brother says.” At the same time, she thought, “Since things are already like that, I can only conceal that matter to the death. I just have to make sure that he doesn’t find out.”</p><br/><p>Ling Tian laughed with satisfaction in his heart. He could not help but receive the teacup as he smiled, “Since I can’t drink tea from an apprentice, let me drink this from a younger sister.”</p><br/><p>Yu BingYan’s face turned red as she retracted the teacup back, “Nope, I won’t allow you to drink any tea now.” Just when Ling Tian wanted to snatch it over with a smile, his eyes suddenly narrowed and his gaze was locked onto Yu BingYan’s hands.</p><br/><p>Sunlight from the rising sun shone through the window and right on the tender hands of Yu BingYan. It made her hands look like transparent white jade and her fingers like exquisite art.</p><br/><p>However, this was not what Ling Tian noticed.</p><br/><p>Ling Tian stared hard at Yu BingYan’s hands with a face of disbelief! At this moment, he suddenly understood why Yu BingYan’s martial arts was so weak despite being the little princess of the Yu Family.</p><br/><p>Under the sunlight, the meridians on her hands were completely shown! Under the sunlight, the meridians which were supposed to be light green were actually a strange purple black on Yu BingYan’s hands!</p><br/><p>[1]: The poem above was written by Su Shi. Su Shi is a famous poet from the Song Dynasty.</p><br/><p>[2]: The first ‘brother’ refers to how a wife would call her spouse. The second ‘elder brother’ refers to a sibling like address.</p><br/>\n</div>"}