{"title": "Chapter 101", "id": 101, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-101", "volume_title": "Volume 2", "body": "<h1>Chapter 101</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 101: Divine Black Negative Meridians</p><br/><p>Translator: chuchutrain Editor: celllllLing Tian’s face grew serious, a seriousness like never before!</p><br/><p>Purple black meridians!</p><br/><p>Being born in the number one martial family in his past life, Ling Tian naturally knew what that meant.</p><br/><p>For this sort of situation to appear, there could only be two reasons. The first was that the person had been affected with an extreme Yin-based frost poison which had invaded the meridians. The quantity must also be minute, else the person would have long turned to a corpse. Only in the right quantities could a person be able to stay alive. But, their body would still slowly freeze up till they became completely rigid.</p><br/><p>The second scenario was even more complex and thorny, which was if the meridians were naturally formed in such a way. In the martial way, there was an awe-inspiring name for it: Divine Black Negative Meridians. But to put it bluntly, it was just dead meridians! The meridians would be completely blocked and the practitioner unable to even exert a bit of internal strength. For a female to possess such meridians, her life was destined to end before 20!</p><br/><p>Looking at Yu BingYan’s meagre internal strength, everyone would know that this little lass had to put in many more times the effort as a normal person, to even have such an effect. But, it also showed that her Divine Black Negative Meridians still had hope. Just that it was difficult, difficult to the point that it could be considered impossible!</p><br/><p>Ling Tian’s expression immediately became ugly to behold! While it could be healed, there were only two by Ling Tian’s side who satisfied the prerequisites! The first would be Ling Tian himself, to have his Divine Shocking Dragon Formula reach grand completion of the twelfth layer, to be able to accumulate enough XianTian True Qi to force open the Divine Black Negative Meridians! Breaking through the Conception and Governing Meridians, link up the bridge of Heaven and Earth! Only by doing so could the owner of the Divine Black Meridian continue to persist! That would be akin to doing a marrow cleansing for Yu BingYan, shedding her mortal body once. She would immediately turn into a peerless expert! However, the process would be fraught with danger. With the slightest inattention, both parties would suffer from cultivation deviation and die without a complete corpse!</p><br/><p>The second person would be Ling Chen, using her Divine Ice Formula which shared the same characteristics as the meridians, to slowly absorb the Divine Black Negative Meridians. Not only would it not harm her, but it would also boost Ling Chen’s cultivation. The problem was that only when Ling Chen had reached the ninth layer in her cultivation could she barely meet the requirements to attempt such a matter! With her current cultivation of the fifth layer, if she were to make a rash move, not only would Yu BingYan not be cured, Ling Chen would be sacrificed as well!</p><br/><p>As for Ling Tian’s XianTian Divine Shocking Dragon Formula, ever since he broke into the seventh layer, he could not progress further any longer! Ling Tian knew that he had already hit a bottleneck. Before this, he had nothing to worry about. However, Ling Tian deeply regretted that he did not make use of the chance to cultivate back then. For him to hit the grand completion of the twelfth layer from his current state, he would need at least ten years! Ling Chen had it worse: the climate of the Sky Bearing Empire was more towards the hot side. To progress pass the seventh layer of the Divine Ice Formula, one would need an place of extreme cold to continue cultivating. If she remained here, it was unlikely for her to reach the pinnacle state of ninth layer in her entire life! With Yu BingYan’s current condition, how could she afford to wait another ten years?</p><br/><p>The three of them simultaneously saw the ugly expression on Ling Tian’s face. Yu BingYan had a great shock, immediately retracting her hand back into her sleeve as though she had received an electric shock. Thinking of her chronic condition, she could not help but turn deathly pale. Had Ling Tian discovered something?</p><br/><p>Ling Chen and Wei XuanXuan stared at Ling Tian expectantly, feeling strange regarding his behavior.</p><br/><p>Ling Tian took into a deep, ragged breath, before finally cautiously opening his mouth, “Ling Chen, please bring Miss Wei into your room. I recall that you had borrowed a book of inscriptions previously, I believe that Miss Wei would be interested in it.</p><br/><p>Wei XuanXuan looked at Yu BingYan hesitantly, to see her lightly nodding her head. Wei XuanXuan knew that Ling Tian could have potentially discovered something, and thus followed Ling Chen out.</p><br/><p>Seeing the duo leave the room, Ling Tian began frowning once more, pacing around the room. He looked at Yu BingYan, and was about to speak, but ended up shaking his head once more.</p><br/><p>“Elder brother, are you also well-versed in medicine?” Given how smart Yu BingYan was, how could not see through Ling Tian’s expression of wanting to speak but being unable to? She knew that he should have found out the problem of her body and could not help but feel amazed. When she first started showing symptoms, it took almost all the famed physicians to look through her before they diagnosed her Divine Black Negative Meridians, how could it be that Ling Tian, young as he was, could be able to figure it out?</p><br/><p>“Little sister, do you have some sort of chronic disease on your body?” After hesitating for quite a while, Ling Tian saw that Yu BingYan had already figured out his intentions, and thus frankly spoke his mind.</p><br/><p>Yu BingYan paled, indeed, he had seen it! “That is correct, elder brother has sharp senses indeed. This little sister has the condition of Heavenly Yin Locked Meridians and will not live past 20. My life, I’m afraid, has no hope.” Even when speaking about her own terminal illness, her eyes were full of apathy. It was as though she was talking about something unrelated to her. Obviously, Yu BingYan had already totally given up on her own condition.</p><br/><p>“Heavenly Yin Locked Meridians! Turns out, the Divine Black Negative Meridians were named as such in this world,” Ling Tian thought to himself. Looking at her calm and indifferent eyes, Ling Tian only felt a sharp pain in his heart, his viscera and intestines seeming to twist together.</p><br/><p>Seeing how Ling Tian’s eyes suddenly revealed sharp pain as well as deep tenderness, Yu BingYan only felt her young heart tremble harshly! “He, he is feeling sad for me! He is feeling sad for me!!”</p><br/><p>In that moment, Yu BingYan’s heartstrings seemed to have been plucked at by Ling Tian, a sort of warm and yet bittersweet feeling of happiness flooded her heart! Looking at him, she suddenly had this great urge to throw herself on his warm embrace, on those strong shoulders of his and cry without abandon. To cry and vent out all those years of misery and suffering. Yu BingYan suddenly had a thought: This man, he understands me!</p><br/><p>Being born in an aristocratic family, she was not lacking of food nor clothes since young, but had actually gotten such an incurable disease! Over these years, in order not to let the family worry over her, Yu BingYan had always pretended to be happy, jovial, and full of fun, keeping the despair and pain for herself to bear. She took all the negativity in, forced herself to chew them, and to swallow it all.</p><br/><p>All these years, no one truly understood how much she had suffered!</p><br/><p>No one knew how much despair she was enduring!</p><br/><p>No one knew that deep in her heart, she wanted to live on! She wanted to live on extremely badly, just like a normal person!</p><br/><p>Yu BingYan shouted that in her heart! As loud and as hard as she possibly could!</p><br/><p>However, these words would never come out from her mouth! Because, there was no one she could say it too!</p><br/><p>Tell her parents? That would only cause her family to bow their heads and cry together! Tell her siblings who had always been jealous of her? That would be even more pointless!</p><br/><p>“The world is huge, yet nary a person understands me! There is actually no one whom can hear me lament! I can only talk to the wind, speak to the clouds and whisper to the flowers when I’m alone… maybe all that I can do is to bite my blanket hard in the dead of the night and let my tears flow unhindered… silently venting without anyone knowing…”</p><br/><p>“Thank goodness! The Heavens have given me someone whom can understand, accept and take pity on me! That is the man in front of me!” Yu BingYan stared dumbly at Ling Tian. But, she could not bring herself to do it. She could not bring herself to be so selfish. He was so outstanding, so how could she use this dying body of hers and plunge him into everlasting pain?</p><br/><p>“But I… really want, really want to lean on him… even if it’s just for a while… I will make that become the eternity in my heart! O Heavens, could you let me enjoy the beauty of life before mine comes to an end? I don’t need a lot, neither do I hope for a lot, and I definitely do not wish to possess all! I just need a fraction of it, to even have a fraction… I would be satisfied… I would have no more regrets!”</p><br/><p>Just like a child being bullied, finding out that her mother’s embrace was the warmest! From the depths of her heart, all the way to her eyes, a stream of bitterness leaked out. How wronged she felt!</p><br/><p>Ling Tian only looked at her gently, warmly, with his eyes full of pity and silent acceptance, as well as a sort of… encouragement! At this moment, he silently and steadily raised his arms, facing the pitiful young girl in front of him…</p><br/><p>Yu BingYan erupted into heartfelt ecstasy at this gesture! At this point, she threw aside everything… in her eyes, there was only that welcoming embrace. “Thank you, O Heavens! Let me be crazy just this once!”</p><br/><p>Yu BingYan seemed to have achieved a speed she could never reach in her lifetime, as she contentedly, ecstatically, even viciously, threw herself into Ling Tian’s embrace!</p><br/><p>How warm, how secure! How happy she felt at this time! Yu BingYan’s tears cascaded down like a downpour as she let herself loose completely!</p><br/>\n</div>"}