{"title": "Chapter 114", "id": 114, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-114", "volume_title": "Volume 2", "body": "<h1>Chapter 114</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 114: Probing Intelligence</p><br/><p>Translator: DavidT Editor: celllllThe night was silent, with gentle winds and a dim moonlight.</p><br/><p>All of a sudden, chaos burst forth in all directions.</p><br/><p>The sound of galloping horses approached nearer and nearer. They were like the waves of an ocean, coming wave after wave never endingly!</p><br/><p>At the same time, the sound of scolding and shrieks sounded from afar.</p><br/><p>Ling Tian held onto his wine glass as he listened with a smile, “The Yang family really went all out this time. It seems that the old fox, Yang KongQun, is really anxious this time! The more he acts as such, the more it seems like he has a guilty conscience! Interesting, interesting!”</p><br/><p>On the opposite of Ling Tian, Ling Jian’s face was flushed red but his eyes were still sharp and calm!</p><br/><p>“Young noble, what should we do next?”</p><br/><p>Ling Jian knew that his young noble would not let him kill that trash for nothing. If there wasn’t any follow up to this plan, it wouldn’t be a plan by his young noble.</p><br/><p>Ling Jian was extremely familiar with Ling Tian’s habits. Ling Tian will never take action just for a single goal. For things which are simple and straightforward, Ling Tian would not think about the idea himself! He would only hand such a matter down to his subordinates. Ling Tian’s plans would always be out of one’s expectations, but still within his own control. Every single meticulous arrangement by Ling Tian would always make Ling Jian shocked with admiration. Ling Jian felt that if he did not guess wrongly, killing NanGong Le was just the start of Ling Tian’s plan!</p><br/><p>In Ling Tian’s courtyard, a gust of wind blew. Ling Tian and Ling Jian both felt that the two experts in the courtyard were growing restless.</p><br/><p>Yu BingYan’s guards finally could not sit still.</p><br/><p>The unintentional sword move by Ling Chen previously had already made the both of them on high alert. Now that it was deep in the night with such a large commotion happening in the Sky Bearing Empire, it was impossible for the both of them to not worry — regardless of who the commotion was targeted at.</p><br/><p>In the shadows outside the house, both the black dressed men were arguing, “XueFei, guard the little princess here. I will go and take a look.” This voice belonged to XueLeng.</p><br/><p>“It is best for you to stay here while I go. My footwork is better than yours and it will be easier for me to move about.” This voice belonged to XueFei.</p><br/><p>“Bastard! You have to listen to me and stand guard here.”</p><br/><p>“Why do I have to listen to you? We are both twins of the same age. On what grounds are you acting like the boss of me? Listen to me this time.”</p><br/><p>“Bastard! I was the one who came out first!”</p><br/><p>“Cheh, we both look the same. In what way are you older than me?! Perhaps, there was a mistake that was made back then. I feel like I am much older than you! Do you have the disposition of an elder child?”</p><br/><p>“Then… we shall use the old way!”</p><br/><p>“Yes! The old way!”</p><br/><p>Who knows how they came to a conclusion, but XueLeng ended up winning and smiled with delight. His body then shot into the air as he disappeared in the night sky after twisting strangely.</p><br/><p>XueFei shook his head in frustration as he concealed himself back into the darkness. Before he concealed himself, he looked towards the room of that young master Ling and made a spitting sound.</p><br/><p>In the room, Ling Tian and Ling Jian looked towards each other and saw the laughter on the other party’s face.</p><br/><p>While they were far away and spoke softly, Ling Tian and Ling Jian both had deep inner strength. Especially Ling Tian, whose inner Qi was even more powerful than both the Xue brothers. As such, they heard every single word clearly.</p><br/><p>“While both of them seem to be as cold as ice, I never imagined that they had such a fun side as well. Interesting. Ah Jian, it seems that we have to provoke them into bickering once in awhile. It is more interesting than watching a play.” Ling Tian giggled.</p><br/><p>“Ha!” Ling Jian almost choked on his wine. He also heard the conversation between the both of them but did not feel much. However, Ling Tian’s words made him have an urge to burst out into laughter.</p><br/><p>As it grew even more chaotic, the both of them waited for awhile more before Ling Tian stood up, “It’s about time. By now, the elites of the Yang family should have all been mobilized. Ling Jian, let us go and see the strength which Yang KongQun had been concealing!”</p><br/><p>Ling Jian laughed and finished his glass of wine before standing up.</p><br/><p>The window then opened silently.</p><br/><p>At the same time, both of their figures disappeared into the darkness, as though they had melted into the darkness.</p><br/><p>A wave of fragrance floated into the room together with a graceful figure. Ling Chen walked calmly to the side of the bed and hugged the clothes which Ling Tian had just changed out of, smiling sweetly. She then flicked her wrists and extinguished the oil lamp.</p><br/><p>The Ling mansion was then filled with dense darkness.</p><br/><p>Sprinting in the night accompanied by the gentle breeze, Ling Jian felt a sense of comfort which he had not felt for a long time!</p><br/><p>He can finally work together with his young noble again!</p><br/><p>Ling Jian felt as though he had returned to the time he first saw his young noble and felt his heart grow calm all of a sudden. He suddenly felt that he was no longer the person who had no one to rely on and had no home to return to. In the past decade, the little things which were experienced by the both of them flashed passed his mind as he felt a sense of warmth. His cold and callous self was actually able to feel such warmth still, and it was extremely comfortable.</p><br/><p>Ling Tian did not know, and maybe Ling Jian himself did not know either. Ever since the Blood Rose Hall had fell under Ling Jian’s sword, Ling Jian’s sole goal in life was to serve Ling Tian! Help Ling Tian to kill! Protect Ling Tian with his own life! This had became Ling Jian’s only wish in the world!</p><br/><p>In Ling Jian’s heart, Ling Tian’s status was something which no one was able to replace. Ling Tian is his own brother or even a god in his heart!</p><br/><p>He looked towards Ling Tian who was sprinting together with him; that neither fast nor slow actions which were completely effortless. Ling Tian would meticulously maintain their distance but yet not speeding up to the maximum to embarrass him. Ling Jian felt, once again, the huge gap between him and his young noble. He could not help but swear in his heart to improve himself. Only then will he be able to do more for the young noble in future!</p><br/><p>XueLeng’s silhouette appeared in front of them.</p><br/><p>The both of them looked at each other with a smile. They had originally followed XueLeng here; now that they had found him, he shall become the bellwether.</p><br/><p>On the dark streets, troops dressed in black weaved around the streets. They would enter into the inns to check or interrogate the residences, filling the whole city with a large commotion.</p><br/><p>From time to time, there would be black figures jumping onto the roofs, looking around the surroundings. This also made Ling Tian, Ling Jian and XueLeng — who was in the front — to be even more careful.</p><br/><p>The large line-up, which the Yang family sent out, was something that even Ling Tian felt extremely surprised at.</p><br/><p>The orderly sounds of galloping horses sounded as a wave of awe struck them. As Ling Tian listened carefully, he realized that while the troops were many (exactly 500), the galloping sounds were extremely orderly. It was as though every single horse was galloping in synchronized steps. To train the cavalry to such an extent could no longer be described by having ‘good training’. It can already be said to be a miracle!</p><br/><p>“Ling Jian, take note of this cavalry which is arriving. They are most probably the strongest force which Yang KongQun had been hiding: Heavenly Blade Troops. This is also the news which we had never been able to scout out. Take note of all of their strengths. They will be the biggest enemy of our Ling Family Courtyard in future.” Ling Tian said softly.</p><br/><p>Ling Jian looked towards the strict and orderly troops on the streets and said calmly, “This troop can be called the elites amongst the elites. If we were to take out 500 men from our Ling Family Courtyard to fight them, both parties would definitely suffer heavy casualties! In fact, we may even suffer heavier casualties!”</p><br/><p>Ling Tian also observed the troops carefully; the men’s expressions, the complexion of the horses, the synchronization between man and horse, not letting out a single detail. After hearing what Ling Jian said, he shook his head, “Your analysis is logical, but is only limited to if they do battle on the ground. If they were to battle on horses, 500 of these men will be able to fight a thousand men from our Ling Family Courtyard! Furthermore, Yang KongQun has 3000 of such troops!”</p><br/><p>“3000?!” Ling Jian’s face changed.</p><br/><p>“If these men were to fight the men from our Ling Family Courtyard one to one, they would lose for sure! But if we are talking about them collectively, our Ling Family Courtyard is still far from being comparable to them. In a battlefield, the most important thing is cooperation. In order to train troops like these, it is impossible to do so without a good eight to ten years! Thus, this is probably Yang KongQun’s trump card!”</p><br/><p>Ling Tian continued to observe the troops as he said, “Look at their cooperation between men and horse, men and men, horse and horse. Ling Jian, that is the scariest part! There is only a single way to deal with such troops: Divide and conquer. If we were to fight them head on, we would definitely pay a huge price!”</p><br/><p>A terrifying killing intent shot out from Ling Jian’s eyes!</p><br/><p>Rate Translation Quality</p><br/>\n</div>"}