{"title": "Chapter 113", "id": 113, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-113", "volume_title": "Volume 2", "body": "<h1>Chapter 113</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 113: The Yang Family Moves Out</p><br/><p>Translator: chuchutrain Editor: celllll“Increase the number of guards and carefully scrutinize the Ling, Wang and the Imperial Family’s every move. I want detailed reports of all of the three families; regardless of how big or small the matter, I want it to be reported! Yang Lei, bring a few elites to the capital and investigate the people who entered the Sky Bearing Empire in the recent half-month — especially those who came in from the south, pay careful attention to them! Yang Yun, quickly inform the NanGong family — report this matter to them clearly without missing a single detail out!”</p><br/><p>Even when faced with such an abrupt disadvantage, in this instant, Yang KongQun showed how he was an outstanding talent of his generation, quickly calming himself down. The matter had already happened and people were already dead; thinking about the consequences of this matter is no longer important already. They could only face it calmly, no matter the result.</p><br/><p>Yang KongQun was calm and unflustered, giving out orders like the river’s water, flowing orderly without any chaos. The originally harried and chaotic Yang Family calmed down upon hearing his authoritative voice and saluted him after receiving their orders, rushing out to complete the tasks.</p><br/><p>Yang KongQun placed his hands behind his back as he gazed at the night sky — he could already foresee how the entire capital would be stirred up like a bowl of porridge because of his orders. This would cause a scenario where people jump at the slightest breeze or the cry of a crane, imagining every grass and tree as a soldier [1]. After so many years, the actual might of the Yang family’s elites was now being brought to bear. While he knew that this move of his would draw more suspicion from the Imperial Family, he was already at his wit’s end.</p><br/><p>The deployment of his elite troops was not to pursue the killer. The probability of actually being able to capture that cold-blooded killer right now was infinitely close to zero. The deployment was a sort of stance, a display to the NanGong family! It was a show put up for everyone under the heavens! Since your son has been murdered in my territory, no doubt you would be sad, but I’ll be angrier! I want to use the greatest strength at my disposal to solve this case in the fastest and fiercest way, without any neglect!</p><br/><p>Furthermore, this also served as a sign to the NanGong family: Your son is already dead and it was not done by us! Since an ally of our Yang Family has met with an accident in our area, our family would definitely bring justice. Regardless of the consequences, our Yang Family would pour all our effort into this case. This is the attitude we have towards this cooperation!</p><br/><p>A pity, one careless move was all that was needed to throw the entire game away!</p><br/><p>The only thing that was out of Yang KongQun’s calculations, and still remained unknown to him, was the fact that Ling Tian had long predicted his response. What sort of strength would Yang KongQun display, this was what Ling Tian was actually looking for, and also one of his main objective this time round.</p><br/><p>An “Enn~” sound was heard, as NanGong Yu was roused awake, her face full of visible tear tracks. Yang KongQun heaved a long sigh, and walked towards her slowly, his white beard swaying in the wind as he spoke, “Niece NanGong, what’s happened cannot be changed, please restrain your grief for now. Should we help your esteemed older brother perform his last rites?” He had thought for a long while but was unable to come out with anything comforting to tell her. Facing this situation, addressing a close relative of the deceased, no amount of words would have any power. Helpless, the only thing he could say and do was to help the headless corpse conduct its last rites. They could not bury him yet, as NanGong Le would undoubtedly be buried only at his ancestral family ground.</p><br/><p>With the assistance of a servant maid, NanGong Yu — with a face drained of all color and blood — stood up slowly and said, “Thank you Family Head Yang for your concern. If I do not take revenge for this, I swear that I am not fit to be a person!” She then turned to address the guards beside her, “Those who accompanied my Second Brother, are there any left alive?” Though her voice sounded weak and frail, it was bone-chillingly cold, carrying hints of killing intent.</p><br/><p>“There are two of them, but they were seriously injured and are still unconscious. Family Head Yang has sent for people to attend to them. But due to the nature of the injuries, things do not look optimistic.” One of the guards bowed as he reported.</p><br/><p>“Hurry and bring me over to take a look!” NanGong Yu then bowed weakly to Yang KongQun, “This niece will take her leave.” Obviously, she was not willing to allow him to follow her, which obviously showed her suspicions.</p><br/><p>Yang KongQun merely inclined his head slightly in response. Watching the vanishing back view of NanGong Yu, his gaze was complex. Though the murder took place under his protection, the Yang Family would definitely not be absolved of blame. With the current state of things, one could only face it with a calm mind. He thought, ‘I’ve already sent the Yangs to investigate and arrest the killer. Though there might not be immediate results, I’ve already done all I could. If you NanGongs are unhappy or suspicious, to the point that you want to sever all ties with me, my Yang Family is actually not afraid of your NanGong family!’</p><br/><p>“How is it? Are they awake yet?” Although she had already heard the gist of what happened from the surviving Yang family’s guards, NanGong Yu still trusted her own subordinates more! How would she know if the Yang family’s guards were just making excuses?</p><br/><p>“Not yet, the two of them have similar injuries to most of the dead. Both of them were pierced through the chest by a sword stab. The killer was unbelievably ruthless and I’ve seldom seen one like that. If it wasn’t for the fact that both of them were lucky, and the stab missed their heart by half an inch, they would have long been sent to the Underworld! Even as it is, the wound inflicted is still too serious. Hence I have no guarantee of saving them!” A physician stood there with his hands still dripping fresh blood as he respectfully replied.</p><br/><p>“Alright, please excuse us for now.” After the crowd retreated, there was only the entourage from the NanGong family left.</p><br/><p>“With the strength of just one man, and using the time needed to make a cup of tea to take care of the hundred-odd guards, he was actually completely uninjured! Hahaha…” NanGong Yu laughed out venomously as she continued, “Four people on the journey and the three Young Nobles from the Yang Family are not even missing a strand of hair. But, my second brother somehow lost his head along the way! This is laughable, really amusing!” Her cold laughter echoed.</p><br/><p>“Miss, what are your orders?” A guard beside her asked.</p><br/><p>“Take out my life-saving Ginseng King and cut out a piece each for both of them!” NanGong Yu’s voice was as cold as an arctic tundra.</p><br/><p>“To show compassion for us guards, we are already grateful beyond belief. But, that sort of rare spiritual medicine like the Ginseng King is priceless beyond compare. The two of them are too severely wounded; even with the medicine, it would only be in vain and this would waste the precious Ginseng King…” Another guard, that was standing by the side, said.</p><br/><p>“The Ginseng King is a rare spiritual medicine that can prolong even the last breath of a dying man. Only then can we find out what happened from the mouths of the two. Follow my orders!” NanGong Yu urged.</p><br/><p>“Yes, this servant will administer it right away!” Her right-hand man immediately withdrew an old jade box, taking out a piece of snow white ginseng. This was the very ginseng which NanGong TianLong had bestowed ti NanGong Yu. This ginseng, in fact, really had the ability to reverse a dying soul.</p><br/><p>That guard took out a knife made of jade and carefully sliced two pieces off, putting one each into the mouth of the dying guards. He then stepped back to await the results.</p><br/><p>All was silent, as they waited for the rain to fall!</p><br/><p>It seemed like an instant, yet an eternity, as a low groan suddenly pierced into the ears of the crowd. On the couch, one of the seriously injured guards seemed to have cracked open a sliver of his eyelids. The moment he saw NanGong Yu beside him, the dying embers in his lights suddenly brightened up fiercely!</p><br/><p>NanGong Yu felt a tremor in her heart as she stooped down, “Li Gang, can you hear me? I have something to ask!”</p><br/><p>The sound of blood gurgling came from the throat of that Li Gang, his breathing coming out in wheezes like broken billows. Every time he breathed in, it took quite a bit of strength. However, his eyes stared at NanGong Yu firmly, the panic, anxiety, grief, and indignation coming out in torrents; it seemed as though he wanted to say something, but he could not speak out. This caused his body to tremble even more violently.</p><br/><p>Light flashed through NanGong Yu’s eyes and she followed her ear to his mouth while saying, “Li Gang, what is it that you want to say? Rest assured, there is only our family in this room, you may speak with ease.”</p><br/><p>Li Gang’s mouth opened and closed, but no sound came out from it. Finally, with a ‘gulu’ sound, a mouth of fresh blood flowed out together with some blood clots from his mouth. His voice, weak and soft beyond belief, sounded, “…Miss…”</p><br/><p>NanGong Yu’s expression tightened, “I’m listening.”</p><br/><p>Li Gang’s voice sounded like a candle in the wind, on the verge of being snuffed out. But that weak voice, when transmitted into NanGong Yu’s ears, was just like a thunderstorm on a sunny day!</p><br/><p>“…the killer… is, …is the Yang Family… people from the Yang Family. This is because of… the plan… that the Master has… for the Ling Family… Miss… you… you….” The voice became softer and softer, and with a final gurgle from his throat, Li Gang took his last breath, his eyes still wide open in anger and frustration as he passed away!</p><br/><p>Though the Ginseng King was a miraculous medicine, allowing the dying guard to have another few seconds in life, it was not a Soul-Reviving Immortal Pellet after all and Li Gang still passed away in the end.</p><br/><p>However, the words he spoke before his death had a content that could turn the sky and earth upside down!</p><br/><p>NanGong Yu stood up slowly with both fists clenched, as though she could not control her rage and hatred any longer!</p><br/><p>It was unknown why, but the originally crazed NanGong Yu suddenly regained her calm all of a sudden! In that instant, the close to erupting her suddenly cooled back down — the chill she emanated comparable to freezing temperatures. The crowd all felt anxious.</p><br/><p>The pretty face of NanGong Yu looked as though it was sculpted from ice, the killing intent in her eyes seeming to congeal into reality.</p><br/><p>Beside her, the other fatally wounded guard seemed to still be trapped in unconsciousness. He started to hyperventilate, his body twitching in response. It seemed like he was inhaling lesser and exhaling more.</p><br/><p>NanGong Yu hesitated for a brief moment; then suddenly, her expression turned cold as she turned her body and stretched out her right hand. With a small exertion of force and a ‘kacha’ sound, the guard’s neck was snapped by her. He died before he could even utter a single word.</p><br/><p>Looking at the bewildered expressions of the others, NanGong Yu drew out a snow white silk scarf from her bosom and wiped her hands leisurely as she spoke, “If the Yang Family knew that we have already discovered their ploy, I’m afraid we will all end up in unmarked tombstones in the Sky Bearing Empire. This person has been fatally injured and does not have much time left. We cannot afford to take this risk.</p><br/><p>Her jade hands flicked and that snow white scarf floated down, gently covering the eyes of the guard who had died unjustly.</p><br/><p>[1] – To panic at the slightest move, and to treat everyone like an enemy.</p><br/>\n</div>"}