{"title": "Chapter 110", "id": 110, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-110", "volume_title": "Volume 2", "body": "<h1>Chapter 110</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 110: Shifting the Blame</p><br/><p>Translator: DavidT Editor: celllllWithout looking, the black robed man landed suddenly. The spot he landed on was behind the three brothers of the Yang family and in front of the guard guarding NanGong Le. He looked at the people in front of him coldly, without a trace of emotion seeping out, as though he was looking at livestock ready to be slaughtered!</p><br/><p>A guard then shouted in desperation, “Young master Yang, please save my young master! The NanGong family will remember your kindness forever!”</p><br/><p>After seeing how the black robed man was like a killing god and how he was able to fly through the air, Yang Wei had already been frightened to the point he wet his pants. How would he still have the heart to bother about NanGong Le? Without his own life, what good would eternal gratitude do? Without turning behind, he let go of both his younger brothers and escaped like a rabbit who saw a predator. The few guards of the Yang family then pretended that they did not hear the pleas of the NanGong Family guards, escorting their three young masters to escape!</p><br/><p>“What a joke, that black robed man is obviously here to kill NanGong le and we already had many of our men die for nothing. Now that we are able to keep our lives, why would we go and seek our death? Even the guards who died previously were all pulled down by your NanGong family! More than a hundred men were still unable to defeat him. Wouldn’t it be useless for us to stay behind? Who knows what kind of enmity you have with this death god? You actually attracted your enemy all the way here!”</p><br/><p>The remaining guards of the NanGong Family then surrounded the unconscious NanGong Le, staring at the black dressed man like a bunch of sheep waiting to be slaughtered!</p><br/><p>The black robed man then stared at those from the Yang family with a playful smile. Then, he turned around and pointed his sword to the ground. Fresh blood began to drip down from the tip of the sword with raindrop like sounds. However, it felt like the drumbeat of the death god beating in each of their heads!</p><br/><p>“Wonderful! Today is such a great day! Hahaha…” That black robed man let out a carefree laughter. Raising his sword, he looked at the bloodstains on the sword and said regretfully, “I heard that a real weapon would not see blood after killing someone. It seems that this sword is far from being comparable to godly weapons! What do you guys think?”</p><br/><p>A guard was pressured by the aura he was emanating and could not help but reply blankly, “What we think?”</p><br/><p>The black robed man then sighed, “If I used this sword to decapitate all of you and the sword is still able to remain shiny, wouldn’t that be a beautiful thing?” It was as though he was mumbling but yet seemed like he was questioning the people in front of him. His words were filled with regret, as though he was regretful that he did not have such a godly weapon.</p><br/><p>“Why? Why do you want to kill us? Who are you?” A guard mustered his courage and asked.</p><br/><p>“This question of yours is really stupid! But since you guys are not going to survive, it wouldn’t matter if I let you know. Haha, a dead man will not be able to leak the secret! I shall let you guys die in peace!” The black robed man was extremely patient. The people in front of him were no different from ants to him, easily destroyed with a wave of his hands. The words he said was akin to a predator toying with his prey!</p><br/><p>In the hearts of the guards, they could feel the endless killing intent from the black robed man and could not help but feel despair. But in such a circumstance where they felt that their deaths was certain, they all became more bold instead.</p><br/><p>A guard then puffed up his chest and said, “Sir, you are stronger than us and we do not feel wronged to die in your hands. I just hope that you will let us die a knowing death. Why do you want to kill us? After you explain that, us brothers can die peacefully. Of course, if you are not willing or don’t dare to say it, that’s also up to you.”</p><br/><p>The black robed man then burst out into laughter, “I’m not willing to say? I don’t dare to say? Haha, what a joke. Do you guys think you will be able to survive? Even if I were to say the truth, would you guys be able to spread it?”</p><br/><p>“Since you are not afraid of us spreading it, why must you reject the final wish of a dying man?”</p><br/><p>“Hahaha…” The black robed man laughed for a long while, “I did not intend to say it initially, but I just cannot hold back the temptation! I can’t believe that there is actually such a stupid family like the NanGong Family in the world! You guys really make me feel extremely surprised! A bunch of idiots, how did you guys become one of the eight great families? It is really puzzling to me how the NanGong family is not destroyed yet!” The black robed man ridiculed.</p><br/><p>The guards all felt their anger boiling, “Sir, it doesn’t matter if you don’t want to say it. Why must you humiliate us? Does Sir feel a sense of accomplishment to humiliate an opponent far beneath your level?”</p><br/><p>The black robed man smiled, “Don’t need to agitate me, I had already planned to say it. Don’t agitate me to the point I don’t feel like saying it. The biggest mistake of your NanGong family was to make a marriage proposal to my Yang family! Hehe, that NanGong TianLong is too naive!”</p><br/><p>“You are from the Yang family?!” The guards exclaimed as they came to a realization about some matters which seemed strange. No wonder he did not kill the young masters from the Yang family. No wonder he allowed the three young masters to escape. No wonder why the Yang family would not save their young master Le! So he was from the Yang family! This matter was just a scheme of the Yang family! But why would the Yang family want to do that?</p><br/><p>“Confused? Haha, your family head, NanGong TianLong, would definitely know the reason. You guys eyed on the Ling family and wanted to eat them up in secret. However, you also thought about having an alliance with my Yang family so the aftermath of the affair would be settled more easily. Haha, a good plan. Hehe, how can things go your way all the time. Our Yang family also has the same idea. If that’s the case, how can we allow you to marry our young miss? You still want to let us to clean up after you? What do you think your NanGong family is? A bunch of fools who want to play others as monkeys? What a joke!”</p><br/><p>The guards then stared at each other as fury filled their hearts! Yang family! What a Yang family! So sinister!</p><br/><p>The black robed man then looked at them leisurely, “Now that everything is explained, you guys can just end your own lives. I only need NanGong Le’s head.”</p><br/><p>Anger was already plastered all over their faces, “While we are not your opponents, we are not willing to wait helplessly for death! We are even more unwilling to end our own lives. It’s best we trouble you! Please!”</p><br/><p>The black robed man laughed, “Good! If that’s the case, have a good trip on the Yellow Springs Road! Go and accompany your foolish young master!”</p><br/><p>The guards then lifted up their weapons and charged over with a battle cry. Like a gust of wind, the sword of the black dressed man penetrated the chest of the first man. After pulling it out and taking another step, his sword brandished again and another guard’s chest was penetrated…</p><br/><p>The black dressed man then flicked his wrists and the sword exited from the chest of the last guard. With a tinge of melancholy, he mumbled, “I will never leave any survivors! The orders from the top cannot be disobeyed and may all of you have a good trip!” The body of the last guard stumbled on the ground without motion.</p><br/><p>With a single slash and jab, NanGong Le’s head was already embedded in the sword of the black dressed man. With a laugh, his body floated in the air and he disappeared into the night skies.</p><br/><p>The black dressed man seemed to be extremely careless, not bothering to check if there were any survivors. Or perhaps, he was just overly confident in himself.</p><br/><p>A long while later, two soft groans sounded together. In the pool of blood, two guards who were filled with blood all over them gradually opened their eyes… While the sword of the black dressed man pierced through their chest, it did not penetrate their hearts! The both of them also managed to survive.</p><br/><p>A commotion could be heard from afar as a bunch of troops held onto fire torches and approached the place quickly — they were the reinforcements of the Yang family.</p><br/><p>The guards, who had regained their consciousness, were filled with hatred as they thought, “What a coincidence, just when everyone had died, you guys arrive. Do you guys really take us for fools?” In hatred, their previously clear mind became muddled…</p><br/><p>Translator’s ThoughtsDavidT DavidT</p><br/><p>First bonus chapter for the week~~</p><br/>\n</div>"}