{"title": "Chapter 122", "id": 122, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-122", "volume_title": "Volume 2", "body": "<h1>Chapter 122</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 122: Master-Disciple Reunion</p><br/><p>Translator: DavidT Editor: celllll“Little brat! You’ve scared me to death!” Old Madam Ling calmed herself down as she scolded Ling Tian laughingly with a knock on his head. While her words sounded to be of regret, they were actually of comfort.</p><br/><p>“Hehe. Grandmother, because I was afraid that you would be worried, your grandson said so much and my mouth is already dry. Does grandmother have any rewards for me?” Ling Tian said with a cheeky smile.</p><br/><p>“Mmm, for making this old lady so worried, I shall have some exercise and reward you with two walking sticks. How about that?” Old Madam Ling teased.</p><br/><p>“Ah? Can’t be right?” Ling Tian said bitterly.</p><br/><p>“Right, is the lady in your courtyard the little princess of the Yu family?” Old Madam Ling asked excitedly, like a grandmother finding a wife for her grandson.</p><br/><p>“Mmm, that’s her.”</p><br/><p>“Oh, didn’t the rumors say that the little princess of the Yu family is a one in a thousand beauty? Why does she look like that?” Old Madam Ling asked with depression.</p><br/><p>“Oh, she smeared a face concealing powder to conceal her true appearance.” Ling Tian explained.</p><br/><p>“Oh, then find some time to get her to wash it off and bring her to me so I can take a look.” Old Madam Ling said excitedly.</p><br/><p>“Err!” Ling Tian’s face changed as he changed the topic quickly, “Grandmother, where is grandfather and father?” If Yu BingYan wanted to remove her concealment, she would have done so already. Since she was not willing to remove it, what would be the purpose of forcing her to do so? Thus, Ling Tian changed the topic quickly.</p><br/><p>“Your grandfather does nothing everyday, drinking and fooling around with those old friends of his; I also don’t know what he does everyday. As for your father, there is no need to mention him.” Old Madam Ling sighed, “Now, I just want to beat your father up when I see him.”</p><br/><p>“Ah? What happened to father?” Ling Tian asked with doubt. His father had always been fillal and always listened to grandmother, how did he anger her?</p><br/><p>“That stupid donkey, because some of his opponent’s generals died a mysterious death, he had won a few huge battles. Especially with him winning back the Valley of Sobbing Spirits, his head has swelled up to the size of a watermelon already. He goes to the military department for tea everyday, proudly thinking that he is the ‘battle-god’ of the Sky Bearing Empire. I am angered the moment I see him! Why doesn’t he think carefully about the few mysterious victories? After not being able to find an answer, he just decided to place all the credit on himself! He is just blur and egotistical to the extreme!” Old Madam Ling scolded hatefully.</p><br/><p>“Hahahaha….” Ling Tian, who was drinking a mouth of tea, spit it out in laughter.</p><br/><p>“What are you laughing about?” Old Madam Ling said angrily, “This old lady is still not done yet.”</p><br/><p>“Father, hahaha, he is just too cute, hahaha…” Imagining his father pacing about with a tea cup in his hands and eyes looking towards the sky, Ling Tian could not help but laugh even harder.</p><br/><p>“Scram back to your courtyard to accompany your little princess. Don’t create trouble at my place.” Now that Old Madam Ling’s worries were all addressed, and seeing how Ling Tian was laughing so arrogantly, she could not help but chase him out laughingly.</p><br/><p>Before Ling Tian left the room, Old Madam Ling did not forget to add, “Remember to bring that lass to see this old lady after she removes her concealment.”</p><br/><p>Ling Tian then agreed reluctantly and escaped.</p><br/><p>“Young noble, Mister Qin is back and is at the north gate. But, his carriage was stopped by the Yang family, saying that they want to find the culprit! The guards accompanying him are now in confrontation with the Yang family!” Just when he left his grandmother’s room, a guard ran towards him hastily.</p><br/><p>“What! Yang family?!” Ling Tian began to think about the matter, “It seems that the Yang family is finally going to start testing me, I knew that they would definitely doubt me.”</p><br/><p>“If I do not go, the Yang family will definitely think that I have a guilty conscience! This time, I do not have a choice but to go. In fact, I must definitely put on a strong front! They actually dare to block my men! If I do not show you my true colors, you will not know why the flowers are red!”</p><br/><p>“Call Wang Tong and Li Qing. Then, call a few more men and follow me to receive Mister Qin!” Ling Tian commanded without hesitation.</p><br/><p>Wang Tong and Li Qing were both from the 36 Blood Iron Warriors, who he kept behind on purpose to be the head of the Ling family guards, and had exceptional strength. A short while later, the both of them arrived with a group of guards. All of them were in full battle gear and had a look of excitement on their faces.</p><br/><p>Following the young noble out is always extremely fun. Furthermore, they would be able to exercise their bodies a little and they were excited indeed. As they heard that the young noble was the one calling for men, all the guards fought for the opportunity and rushed out immediately. As for those who were not chosen, they were all rather depressed.</p><br/><p>“Prepare the horses! Go to the north gate!”</p><br/><p>The gates of the Ling mansion opened up wide and the herd of horses dashed out from within. Young noble Ling was dressed in white while riding a black horse. His horse was the first to dash out of the mansion and fitted in completely with the saying, “Man like jade, horse like dragon!”</p><br/><p>It was just that this young noble seemed to be mumbling something with a look of ruthlessness on his face. With a fling of his whip, a loud smack sounded and the horse gave a loud neigh, sprinting forward like an arrow. Behind him, almost a hundred guards sprinted after Ling Tian. They actually dared to sprint on horses on the busiest street of the capital, causing all the passers-by to raise their eyebrows at such an action. They then continued to sprint all the way to the north gates extremely arrogantly.</p><br/><p>A spy, who was dressed as a beggar outside the Ling family, reported this news to the Yang family immediately.</p><br/><p>The north gate is in sight!</p><br/><p>“Ling Tian went to the north gate? He brought a hundred people? Looking extremely arrogant? As per his usual personality?” Yang KongQun twiddled his beard and asked.</p><br/><p>“Yes! This subordinate saw it personally. That Ling Tian went to the north gate indeed, it can’t be wrong. His arrogance is also as per usual.” A hawker-looking individual replied respectfully.</p><br/><p>“Oh, I understand.” Yang KongQun waved his hands, commanding them to leave.</p><br/><p>“Does grandfather think that Ling Tian is suspicious?” By the side, Yang Wei’s head was wrapped with a white cloth as he sat down on the chair with a fatigued looking face.</p><br/><p>Before Yang KongQun said anything, he first let out a sigh. Looking at his grandson, he felt that his grandson was becoming more and more of an eyesore. Because Ling Tian was a silkpants, Yang KongQun had been mocking Ling Zhan for more than ten years, having the upper hand in words. But at this moment, he realized that his grandson was no much better than Ling Tian. In fact, he was still considerably inferior as compared to Ling Tian. At the very least, while Ling Tian was arrogant, he had never suffered a loss before. His own grandson was extremely arrogant as well, but also a good for nothing. His grandson was indeed the misfortune of the family.</p><br/><p>Yang Lei glared at his son before looking towards Yang KongQun, “Father, you think…”</p><br/><p>Yang KongQun shut his eyes for a while and did not say anything. Only after a short while did he reply, “I cannot confirm anything right now. We should make a conclusion after the news from the north gate comes back.” He then let out a long sigh, “If… our Yang family is going to suffer a great loss.” Yang KongQun’s expression grew serious. Yang Wei and his father then looked towards each other, not daring to say anything.</p><br/><p>North gate.</p><br/><p>Ling Tian led the way and sprinted all the way here. In front of him, eight guards from the Yang family were separated into two rows, checking anyone who enters or exits the city. By the city gates, there was a carriage stopped quietly with a few guards of the Ling family guarding it with their swords drawn, with an atmosphere of hostility in the air. In front of them were a few guards from the Yang family, saying something with spittle flying all around.</p><br/><p>Seeing that Ling Tian led the troops personally, the guards of the Yang family began to curse silently in their hearts. Thinking about the instructions of Yang KongQun, they could only grit their teeth and shout, “Young noble Ling, we are all just following instructions. I hope that young noble will understand!”</p><br/><p>*Pa!* Before he finished his sentence, the whip of the horse had already lashed out as Ling Tian shouted, “Understand?! What can you guys be considered?! This young noble does not have the time to waste with you! Scram!” The speed of his horse was not reduced at all, sprinting at top speed.</p><br/><p>The faces of the Yang family’s guards changed as they hurriedly escaped with a roll. Smoke and dust were then kicked up behind Ling Tian as he charged past the guards.</p><br/><p>On the carriage, a white haired old man looked out for the first time after the carriage had been stopped. With the support of the guards, he walked down the carriage slowly. After he got off, he said to Ling Tian with a smile, “You’re here?”</p><br/><p>“Mister, you’re back.” Ling Tian got off his horse and received Mister Qin with emotional eyes. Three years ago, Mister Qin’s wife fell seriously ill and Ling Tian was only able to extend her life by a few months despite giving it all he had. After she passed away, Mister Qin was heart-broken as his heart turned cold and dead. He returned to his hometown with his wife’s coffin and left for three full years.</p><br/><p>In the three years, apart from visiting every once in a while, Ling Tian would send men to provide daily necessities and had empathized with Mister Qin’s feelings. To a loving pair of couple, things were not as simple as ‘husband and wife when young, companions when old’. The first person to move on to the afterlife is usually the most blessed, because the blow to the other party was just too great! This was something that Ling Tian was able to understand. Thus, he tried his best to give Mister Qin more time and space to recover and adjust himself.</p><br/><p>Ling Tian was certain that Mister Qin would return! Now, Mister Qin is indeed back. Just when the storm was brewing in the Sky Bearing Empire with all the powers gathering, he returned to the disciple he was most pleased with!</p><br/><p>Both old and young looked at each other and could see the joy in each other’s eyes. Mister Qin was glad about his disciple’s growth and Ling Tian was glad about Mister Qin’s return.</p><br/><p>The hundred guards stood behind them quietly in two rows, protecting them silently.</p><br/><p>Ling Tian then turned around and commanded with a wave of his hands, “Mister Qin, please board the carriage. We welcome Mister Qin’s return!”</p><br/><p>“Mister Qin, please board the carriage. We welcome Mister Qin’s return!”</p><br/><p>All the guards shouted, their voices shook the heavens and earth, as the unending echoes sounded!</p><br/><p>With tears in his eyes, he smiled to the guards and cupped his fists, “This Qin thanks all of you. I thank the young noble for receiving me personally!”</p><br/><p>Ling Tian stretched out his hands to personally raise the curtains on the carriage, “Mister, please!”</p><br/><p>Mister Qin looked at him deeply with joy, gratitude and even respect in his eyes. But, he did not say a thing as he got into the carriage.</p><br/><p>Ling Tian then let down the curtains and ignored the hundreds of Yang family guards, “Set off!”</p><br/>\n</div>"}