{"title": "Chapter 128", "id": 128, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-128", "volume_title": "Volume 2", "body": "<h1>Chapter 128</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 128: Unique Skill, Unique Book</p><br/><p>Translator: chuchutrain Editor: celllll</p><br/><p>In actual fact, for the past three years, Ling Ran would organise this sort of meetings with the Madams under the consent of the Emperor, so as to keep in touch, as well as increase her content for pillow talk with her husband.</p><br/><p>However, ever since Ling Tian became infamous, Chu Ting’er only attended the first year and never afterwards; because she was embarrassed! With such a strict household like the Ling Family, they still managed to raise a silkpants! Chu Ting’er really had no place to put her face if she were to brazenly turn up — especially since she would face all the ridicule and taunts of the other madams. The reason she made up her mind to go, was because Wei XuanXuan as well as Yu BingYan coming over to pay a visit to Ling Tian, which gave her some confidence. Whatever the case, she had to take this opportunity to chat with the Madam of the Wei household, since this was probably her last chance to get a wife for Ling Tian.</p><br/><p>Ling Tian could only smile ruefully and shake his head. He guessed that other than this, there had to be another hidden meaning behind. A few days ago, he had just told his grandmother regarding how news conferences were held for product launches in his previous world and, all of a sudden, her aunt in the palace organised a banquet, how much of a coincidence this could be! This was probably his mom coming out with an idea after refining the pointers. Hmm, for all it was, this banquet could have been a pretext for Chu Ting’er to do her business, after egging her sister-in-law to send out the invites! Ling Tian could not help but respect the two women in his family for their quick-wittedness. His mother asking Yu BingYan about Wei XuanXuan was akin to being another Sima Zhao, most likely scheming to find another prospective bride for him.</p><br/><p>Looking at how Yu BingYan was displaying a face of jealousy, Ling Tian could not help but laugh secretly, before pretending to sniff at the air while saying, “Strange… this is strange!”</p><br/><p>This made the two girls stare blankly at him, asking, “What’s so strange?</p><br/><p>Ling Tian then put on a bewildered face as he replied, “I remember not having any vinegar in the room, so why do I detect a whiff of vinegar? Can you smell it?” As he spoke, he sniffed around continuously, slowly walking over to Yu BingYan. Finally, he stopped beside her and his nose twitched as he exclaimed, “My god, turns out it’s my Yan’er! What a pungent scent of vinegar, it’s practically stifling me! What did you eat for dinner? Or did you swap water for vinegar to drink?” [1]</p><br/><p>“Pffft!!” Ling Chen clutched on her stomach as she burst into laughter, unable to control her laughter towards her young noble’s eccentric actions.</p><br/><p>“Hateful!!” Yu BingYan stomped on the ground in frustration, her little face burning red. Her tiny fists pummelled like the rain on Ling Tian’s body, only stopping after Ling Tian curled up with his head tucked in surrender.</p><br/><p>Just now, when Chu Ting’er had requested her to come over with Ling Chen, Yu BingYan still felt embarrassed. Ever since she became more and more intimate with Ling Tian, she found out that she would feel strange whenever she came face to face with Chu Ting’er, much like how a daughter-in-law comes into contact with her mother-in-law! Every time she thought of this, she would feel shyness, bliss as well as discomfort. However, how would she know that when she went over this time, she got enthusiastically questioned about Wei XuanXuan, with Chu Ting’er putting on an expression as though she could not wait for her son to get a wife. This made Yu BingYan incomparably downcast. This felt like having a treasured belonging snatched away from her without rhyme or reason, making her feel very irritated.</p><br/><p>Although she knew that her current condition would not allow her to be with Ling Tian for the rest of his life, hearing how desperate Chu Ting was in finding a wife for her son, Yu BingYan still found it difficult to stomach.</p><br/><p>Ling Tian burst out into laughter, saying mischievously, “Yan’er, rest assured. Your brother here has no intention to settle down yet!”</p><br/><p>“What has you settling down got to do with me? Hmph! I can’t be bothered with you. Where’s that portrait of the maid that you promised me? I’ll go and do some painting!” Yu BingYan was shy, yet secretly happy, and prepared to escape into the study.</p><br/><p>Ling Tian’s heart jumped at that response, but he merely tapped his head as he lazily spoke, “It should be at the right hand corner of the bookshelf, I had long gotten it ready, but forgot about it over this few days.”</p><br/><p>As for the reason why he emphasized on this sentence, it was because he had ingeniously placed a separate diagram on it; the moment one tried to take down the portrait of the female, the other diagram would naturally fall into their hands as well. This was a diagram of internal energy cultivation, which Ling Tian had racked his brains for a long while before recalling. Ling Tian remembered that this internal cultivation manual, named the Mysterious Yin Essence Heart Sutra, was most suitable for females with pure yin bodies. Although it did not result in enhanced strength, it was beneficial for females to improve their physique.</p><br/><p>Due to her affliction with the Divine Black Negative Meridians, Yu BingYan would be able to counteract the frost toxins within her body if she focused on practicing this set of internal cultivation method. Though the effects might be slight, the effect on improving her physique, as well as prolonging her life, were nothing to scoff about. Ling Tian arranged it in this way because he knew that if he were to treat her illness in future, Yu Bingyan’s weak body would cause her immeasurable pain if she were to undergo the treatment. If anything happened to her, it would cause all their efforts to go down the drain. Thus, it was only after a long while did Ling Tian think of this idea, which was to first strengthen Yu BingYan’s body, followed by supplementing it with the Great Cyclic Pellet. Only after he had managed to raise his cultivation and pair with Ling Chen’s pure Yin strength, could he then open up her Divine Black Negative Meridians in one go, removing any further complications.</p><br/><p>Ling Tian had spent painstaking effort to draw out the diagram, followed by applying smoke and fire to that diagram to create the impression of it being dirty and tattered. A cursory glance would allow people to pass it off as a hundred year old ancient artefact. After his meticulous care, Ling Tian’s first reaction was actually to pat his own head in remorse. For if he had discovered his talent in forgery in his previous life, he could still have managed to make a living for himself after being crippled.</p><br/><p>The little lass Ling Chen was the main accomplice in this entire operation. When she heard Ling Tian speak as such, she could not help but wittily wink at Ling Tian, together with a mysterious smile, as though hiding some form of profound meaning.</p><br/><p>The process was made so unnecessarily complicated because Ling Tian wished to add another layer of protection; although he had a good feeling towards Yu BingYan, and she seemed to be harbouring some affection towards him, Yu BingYan was after all someone from the Yu Family! This sort of millennium-long aristocratic family would definitely place their family benefits above all else. Ling Tian was not narcissistic enough to think that Yu BingYan would be willing to throw aside everything for him, and he cannot take this risk. As such, some things are still better off not letting Yu BingYan in the loop!</p><br/><p>Indeed, it did not take long before a commotion sounded inside the study.</p><br/><p>A ‘pa’ sound was heard as something fell onto the floor and, mere moments later, a sound of surprise was heard. If one were to listen closely, they would detect hints of pleased surprise in that sound.</p><br/><p>Ling Tian secretly nodded his head, she was definitely a descendent of the Yu Family; to think she could see the true value of the diagram with just a look!</p><br/><p>Following which, Yu BingYan rushed out like a gust of wind, one hand holding onto the drawing of the maid, and the other clutching onto the forged ‘ancient artefact’. She flourished the diagram in front of her, saying, “Where did you get this treasure from?”</p><br/><p>“What’s this? My dear, isn’t this rubbish?” Ling Tian stood up with a puzzled look, scratching his head with a look of non-understanding.</p><br/><p>“You don’t know what sort of treasure this scroll is?” Yu BingYan asked with a face full of shock.</p><br/><p>“Oh, I remember now, the other day when I asked Ling Chen to clear up my study, she found this thing. At that time, Ling Chen asked me if I had a use for this, but one look and you can see it’s some old thing, so I threw it away. Why did you dig it out again? This sort of dirty thing, quickly throw it away.” Ling Tian stared blankly for a while, before stretching out his hand to take it away, as though he would throw the item away once he got it into his hands.</p><br/><p>“You….” Yu BingYan hurriedly placed the diagram behind her back, not knowing whether to laugh or to cry as she said, “My silly brother, this is a priceless treasure!”</p><br/><p>“Ahhh?! Priceless treasure? This sort of torn and tattered thing? Girl, are you having a fever?” Ling Tian spoke with an expression of disbelief. Then continued enthusiastically, “If you say this is a treasure, then it definitely is, how much is it worth? Hundred thousand taels?”</p><br/><p>“How much…. Is it worth? Hundred thousand taels?” Yu BingYan seemed to have lost the ability to speak.</p><br/><p>“Not even a hundred thousand taels?! What kind of treasure is this if it’s not even worth that much? Be good and throw it away, brother will give you a hundred thousand taels as compensation, much better than that dirty thing!” Ling Tian spoke with an expression of consideration.</p><br/><p>Yu BingYan finally got angry, she almost screamed at him, saying, “You silly fool, how could you use silver to measure the worth of this sort of thing? I… I really… do you know how beneficial this thing is to me? Huh?!” Yu BingYan got more and more emotional as she spoke, “Do you now, with this diagram, a woman can actually be a carp and have the opportunity jump through the dragon’s gate and turn into an actual dragon?”</p><br/><p>“Really? What sort of dragon’s gate… hais, I better not ask, if you think this is good you can take it away, seeing this dirty thing annoys me, isn’t it just a rag? Later, brother will give you a hundred thousand taels as compensation.” Ling Tian continued to give a look of curiosity mixed with a tinge of revulsion, waving his hands as though he had just rid himself of something of no consequence to him, not even putting it in his heart.</p><br/><p>“….” Yu BingYan had no words to describe him.</p><br/><p>“Brother Tian might not be aware of this; but this sort of scroll, while it is not any world shaking unique book, but in my Yu Family’s treasury, there’s only two or three of such scrolls even after centuries of collection. How could this sort of unique books be measured using silver or money, it is simply belittling the actual value of this book!” Yu BingYan held her temper and carefully explained. “This is especially so for this little sister here, it’s like sending me coal on a snowy day! Brother Tian knows that I’ve been afflicted with an incurable disease — the Heavenly Negative Locked Meridians. The negative energy in my body is naturally more as compared to other females, as such I can’t practice any sort of internal cultivation. I have searched through my Yu family’s sacred pavilion and, while I’ve found miraculous and strange canons and sutras, I’ve never been able to find something that I could practice. However, this diagram here explains a type of inner cultivation method which is strangely different, only suitable for those with pure Yin bodies to practice, especially for my type of body constitution. It is as though it was tailor made for me…”</p><br/><p>Yu BingYan suddenly stopped talking, for she found out that as Ling Tian listened, his head started to tilt towards one side, his eyes seemingly blurred, as though he wasn’t focused… if she were to continue talking, he would probably start snoring….</p><br/><p>“Simply playing the lute to a cow!” Yu BingYan stamped her foot angrily, she was actually excited beyond words, happily explaining, but he actually treated her words as a lullaby! In her anger, she viciously aimed a kick towards Ling Tian’s calf.</p><br/><p>[1]: Another homonym from the author. The word ‘’ could either mean vinegar or jealousy.</p><br/>\n</div>"}