{"title": "Chapter 138", "id": 138, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-138", "volume_title": "Volume 2", "body": "<h1>Chapter 138</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 138: Martial Arts of the World</p><br/><p>Translator: chuchutrain Editor: celllll</p><br/><p>“As for the martial arts in today’s world, there aren’t many that are praiseworthy.” Ye QingChen gave a wry smile as he continued, “Let’s use the Heavenly Star Continent as an example. In the aristocratic families, only the Yu Family has a complete heritage! However, authentic martial arts capabilities are usually indistinguishable by mere numbers or grades. Every school, sect or family has their own unique form of cultivation and also different method to develop internal energy. Some focus on cultivating strength, others battle tactics. Some develop their mental states, while others focus on agility and subtlety. How could one assign them a ranking as though they were officials in an Imperial Court? If one were to force it, they will only end up being a joke.”</p><br/><p>“For example, let’s talk about the NanGong Family’s ‘Sword God Manual’. If we were to compare between normal disciples, their exquisite movements would rank first amongst the great families. However, if we were to factor in the disciples with internal strength, then their disciples would be relegated to the back. However, this does not mean that their manual is not up to standard, but rather the fact that they have never focused on internal strength, placing importance on their movements instead. There was once a couple of NanGong disciples who went about comparing notes with the other great families. Though they were always suppressed, the final victor would always be the NanGong disciples, who were firm and unwavering in killing! This is something that cannot be ranked!”</p><br/><p>“In the same breath, if a peerless expert were to let down their guard at the wrong moment, he could still die from the hands of someone far inferior to him. Thus, to the pugilistic community, there was no such thing as rankings that could separate them. The only way was to separate between external and internal martial practitioners, as well as XianTian and HouTian internal energy. All we can conclude is that XianTian practitioners have more endurance as well as better skills as compared to those of the HouTian realm. But this is not an absolute, because if one’s method is outstanding enough, he could make up any deficiencies, and thus in martial arts, there are no definite superior martial artists.”</p><br/><p>“So that’s the case.” Ling Tian felt his face burning in embarrassment. Because he had been influenced by the web novels of his previous life, he assumed that this new world would have some sort of ranking for martial arts. What would be the strongest, which would be the most tyrannical, those sorts of rankings. Now, he felt that his previous thinking was laughable.</p><br/><p>Ye QingChen remained silent for a while, before continuing in a dull tone, “Athough the martial community had never explicitly categorised each and every martial art, every great family as well as the sects have aligned themselves in a sequence for management purposes. They have a separate ranking for every house’s martial skills, but it only focuses on internal energy, and they were ranked based on the realm one can reach with that cultivation method. Though internal energy realms have a huge relation with one’s prowess, this is never definite.”</p><br/><p>Ling Tian’s eyes lit up, as he queried, “This junior is listening intently. Senior, please advise me.”</p><br/><p>Ye QingChen laughed as he replied, “For the evaluation of the various cultivation ranks of the great families, every house has their own standards. But in my humble opinion, the standards given by the Yu Family of Northern Wei is still the most accurate.”</p><br/><p>“The Yu Family’s evaluation is based on a count of five colours of jades: black, blue, purple, white and gold. However, in my eyes, those in the black and blue jade series are deemed useless, only good for people with shallow backgrounds. Above those, from the purple jade level onwards, they are further divided into lower, middle and upper tiers. From purple jade onwards, one can be said to have officially stepped into the ranks of internal strength practitioners. If one is able to achieve a ranking of white jade, most likely, the person should have achieved the peak of HouTian realm. Reaching the white jade middle tier would represent stepping into the XianTian realm! A white jade upper tier would mean small success of XianTian. As for the gold jade stage, it is reserved for the true XianTian experts. They would usually be masters of a generation. Even the Yu Family might not have a person at the gold jade upper tier.” Speaking to this point, Ye QingChen could only let out a wry smile.</p><br/><p>Ling Tian laughed while he spoke in a jesting manner, “If Mister Ye were to base yourself on the Yu Family rankings, which form of jade would you be?” While his tone was casual, as though making a joke, Ling Tian could not help but feel a little apprehensive at the answer. His strength could be said to be similar to Ye QingChen, so if the latter proclaimed himself to only be at the purple or white jade stage, how should he react?</p><br/><p>Ye QingChen shot a smile that was not a smile as he glanced at Ling Tian. In response, Ling Tian remained bland and indifferent, raising his glass to him. Ye QingChen could only laugh and say with a trace of mockery, “Based on young noble’s current strength, I would probably place you at the upper tier of the white jade.” While Ling Tian asked him for his evaluation of himself, the former actually replied with using Ling Tian as a gauge. Obviously, he had seen through the small trick of Ling Tian’s, and also did not want to use himself as a gauge, thus choosing to evaluate Ling Tian instead.</p><br/><p>“Mister is overestimating Ling Tian’s capabilities.” Ling Tian raised his cup to down it, laughing heartily, but his heart was full of shock. So, it seems that the strength of the Yu Family isn’t something to be looked down upon!</p><br/><p>A moment ago, Ye QingChen only mentioned that the Yu Family might not have anybody at the upper gold jade tier. Chances were that there would still be people at the lower gold or even middle gold jade tier! Ye QingChen had put it clearly to Ling Tian that he was only considered at upper white jade. Thus, when compared to the highest echelon, there were two full tiers separating him and them!</p><br/><p>This point made the immeasurably self-satisfied Ling Tian a little uncomfortable, a sense of unwillingness to concede bubbled forth.</p><br/><p>Seeing the unwillingness in Ling Tian’s eyes, Ye QingChen could not help but laugh. Attempting to ease Ling Tian’s anxiety, he said, “Those of the white jade level and above are not activated easily. Besides, for those in the gold jade level, which of them were not heaven-defying geniuses to begin with? In actual fact, with young noble’s current strength, you are qualified to roam unhindered under the heavens. Furthermore, with your age, in another decade at most, you will definitely qualify as a gold jade. After all, someone with your current age having such accomplishments will probably never be replicated, and you can afford to look down on the majority of people where you are now!”</p><br/><p>Ling Tian smiled cheerfully, as though putting the matter behind him. He was then reminded of something else, and blurted out, “If I may ask, for the eight great families currently, how many of them were cultivators in the past?”</p><br/><p>Ye QingChen then sighed lightly as though expecting this question, and answered, “You asked a good question. Other than the Ling and Yang, these two ‘nouveau riche’ families, the other six have roots in martial arts.</p><br/><p>Ling Tian laughed and said with a slight hint of self-mockery, “The Ling and Yang families have not even been around for sixty years yet. Indeed, they are nouveau riche families. However, the agreement of the Outside Heavens as well as Beyond Heavens are only just that much. All those martial families, aren’t they all integrated into the political affairs of every empire currently?”</p><br/><p>Ye QingChen’s expression changed a little, as he refuted, “The millennium long agreement has little to do with this. This is because out of the eight great families, taking out the Yu Ling and Yang families, the other five only have a history of a few centuries and cannot be considered as millennium long martial families.”</p><br/><p>“In our Heavenly Star Continent, other than the Yu family, the original eight great families were the DongFang, XiMen, NanGong, BeiMing, YuChi, ShangGuan, and Lei. Out of them, the DongFang had the roughest road so far. Rumour says that the first-generation head accidentally chanced upon an exceptional top class martial manual — the ‘World Defying Hidden Dragon Manual’. The martial skills explained inside were simply wondrous and the DongFang were overjoyed. However, after the head passed away, his two sons competed ceaselessly for the very manual, and unknowingly, each ended up with only half of it.”</p><br/><p>“As it so turned out, both sons were people blessed with immense talent. After suffering much injuries in the fight, the family was split into two factions, with the elder brother DongFang AoTian bringing the top part of the World Defying Hidden Dragon Manual as well as those loyal to him to travel the world, coincidentally managing to make a name for himself and establishing the Eastern Zhao Empire. The younger brother, DongFang AoYun, brought his men to the Moon Deity Empire to seek asylum and treated the Eastern Zhao Empire as his mortal enemy. Thus, when the two states warred, it was actually the two factions of the great family that were fighting!”</p><br/><p>“I see!” Ling Tian gasped, but deep in his heart, he memorised the five words, World Defying Hidden Dragon Manual!</p><br/><p>“In contrast, the XiMen great family was a relatively peaceful one,” Ye QingChen took a sip or two to moisten his parched throat and wiped his mouth as he continued, “This was mainly because of their cultivation manual, the ‘Divine Compassion Formula’, emphasises on having a pure mind and a lack of desires in order to cultivate their mental states. Although their cultivation progress is slower than most people, they were more effective in repairing internal injuries as compared to most internal cultivation skills, and have a strong resistance against poisons or toxins.”</p><br/><p>“As for the NanGong family, they did not have any profound internal cultivation manual. Instead, they took an alternative route, using the external to make up for the internal, and created their ‘Sword God Manual’ which boasts formidable power. If practiced to the penultimate, it can literally induce the state of ‘sword and man as one’. However, from what I’ve heard, the NanGong family’s talents have withered over the past thirty years, no longer having any peerless experts. Thus, the method to cultivate ‘sword and man as one’ stage might have been lost in the sands of time.”</p><br/><p>“As for the BeiMing great family, they specialize in unarmed combat and movement techniques, especially in the area of movement. Their signatures consist of the ‘Pursuing Sun’, ‘Chasing Moon’ and ‘Seeking Stars’, three unique movement techniques. They are considered top notch, even within the eight great families! Furthermore, they possess a high-quality cultivation formula, named the ‘Mysterious Underworld Heart Sutra’, which focuses on the most extremes of ice and coldness as well as the lunar power of heaven and earth. Those who cultivate it successfully can command the six forms of vital energy [1], reaching a prajna state where you separate yourself from the mortal world. It is a pity that this sutra is highly demanding on the talent of the cultivator, and nobody has been able to cultivate it successfully. If someone were to really succeed in cultivating this sutra, they would definitely enter the list of peerless experts.”</p><br/><p>“Next up is the Lei Family, though they have a long-standing history, even dating back to before the North, South, East and West great families, the long periods of war had resulted in irreparable losses for them. Their prestige might have fallen below the four families I spoke of earlier, but their family heirloom, the ‘Heavenly Penta Lightning Sutra’, is no small fry. The might it produces is immense and it could be said to be the most destructive skill under all of heaven. Sadly, this art is imbalanced, with their defence being negligible!” Ye QingChen’s mouth was already parched from all that talking, and took the chance to drink a few cups of wine in one go. Every time he finished a cup, Ling Tian would be there to refill his cup. To make Ling Tian into a mere ‘cup refiller’, Ye QingChen should feel proud!</p><br/><p>[1] – This may not be the most accurate translation. But what the author is talking about here is about the six types of Qi or vital energy of the Earth, namely Yin, Yang, Wind, Rain, Darkness and Light.</p><br/>\n</div>"}