{"title": "Chapter 148", "id": 148, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-148", "volume_title": "Volume 2", "body": "<h1>Chapter 148</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 148: You Are The Culprit</p><br/><p>Translator: DavidT Editor: celllllOriginally, an expert like Ye QingChen was someone who Yang KongQun would definitely not want to provoke. Not to mention the fact that he may have a powerful backing, his own martial arts was more than enough to make Yang KongQun apprehensive.</p><br/><p>Yang KongQun was now helpless! The troops of the NanGong family would arrive tomorrow and it was obvious that they were extremely suspicious of their Yang family. If they cannot give a proper explanation when the NanGong family arrives, both their families would definitely break out into a conflict and the Ling family would definitely not be a mere bystander. The Ling family would definitely add fuel to the fire and the imperial family would definitely hit them when they are down! At that time, the Yang family would be facing three different enemies and would surely suffer a great loss!</p><br/><p>Now that Ye QingChen appeared, the Yang family had the chance to drag the Ling family into this mess. Even if he knew that this was akin to quenching his thirst with poison, Yang KongQun did not have a choice. No matter what, they would have to survive this tribulation first!</p><br/><p>Duke Ling’s voice then sounded, “That darn old man is crazy! That old fogey actually dares to surround my Ling mansion with troops! This old man will go and reason with him! If he dares to do anything funny, this old man will definitely beat up that old scum for sure!” as Duke Ling scolded, Yang KongQun’s appellation changed three times!</p><br/><p>Just when Ling Tian, Ye QingChen and Ye BingYan walked out from his courtyard, they saw Old Madam Ling rushing over with a few maids. Yang KongQun led his troops here to catch the culprit and Old Madam Ling knew that NanGong Le was killed under Ling Tian’s command. Thus, even the extremely stable Old Madam Ling could not help but feel flustered from a guilty conscience. The first thing she thought of was to ask Ling Tian what exactly was going on.</p><br/><p>After Old Madam Ling met Ling Tian’s group of people, she immediately noticed Ye QingChen. He was dressed in a green robe made from cloth and had a sign made from bamboo poles; he did indeed look like a fortune teller from the pugilistic world. However, Ye QingChen just looked far too calm. Even though he knew that there were thousands of elites at the doorstep of the mansion to capture him, he was not the least bit flustered. His expression did not change, his steps steady, with a confident smile on his face!</p><br/><p>This is definitely an extraordinary person! This was the first judgement made by Old Madam Ling! He is definitely not an ordinary fortune teller for sure and is probably a hermit who had concealed himself from the world! For my own grandson to invite him back personally, how can he be someone ordinary?</p><br/><p>Old Madam Ling ignored Ling Tian and cupped her fists towards Ye QingChen with a smile, “Mister, it is our pleasure to have you here.”</p><br/><p>Ye QingChen smiled and wanted to say something. But when he was about to open his mouth to say something, his expression turned awkward and was suddenly stumped.</p><br/><p>You have to know; the status of the green dressed fortune teller was extremely exalted! Even facing someone like Old Madam Ling, he was still far high than her in terms of status. Now that he had become sworn brothers with her grandson, how should he address her?</p><br/><p>Thinking about that, he could not help but look back and glare at Ling Tian. At the start, Ling Tian did not understand why he was being glared at and was stunned for a moment. A short while later, Ling Tian immediately understood Ye QingChen’s concern and could not help but laugh. Then, Ling Tian whispered, “Just call her whatever you want. With old brother’s old age, I don’t think you will be able to kowtow down, right? Hahaha…”</p><br/><p>Ye QingChen was extremely depressed, almost wanting to beat Ling Tian up on the spot. However, Old Madam Ling was greeting him presently and he could not ignore her. Thus, he could only give a vague reply, “Err… old madam, it is this Ye’s pleasure.”</p><br/><p>Old Madam Ling replied with a smile. Looking at the sly smile on her grandson’s face, Old Madam Ling could not help but scold, “Little brat, how can you not inform grandmother that a noble guest is here.”</p><br/><p>Ling Tian stopped laughing and replied, “Grandmother, this is…” as he said that, he looked towards Ye QingChen. Ye QingChen then glared at Ling Tian as though he was trying to say: If you dare to say that we are sworn brothers, this old man here will definitely take care of you!</p><br/><p>“Err, this is Ye QingChen, Mister Ye. He is my old brother… err… friend!”</p><br/><p>Seeing how Ling Tian was stuttering and even exchanging signals with Ye QingChen, Old Madam Ling began to misunderstand something. Old Madam Ling had always thought that Ling Tian had a mysterious and extremely talented master ever since he was young. If not for that mysterious master, the Ling mansion would have probably been ruled by Ling Kong by now for sure! To the whole Ling mansion, this was definitely a great favor! However, she had been unable to meet this mysterious master of Ling Tian and had made Old Madam Ling feel extremely depressed.</p><br/><p>Now that she saw the strange expressions on the both of their faces, Old Madam Ling would naturally think that Ye QingChen was Ling Tian’s master. As such, she immediately said respectfully with a smile, “So it is Mister Ye. Rest assured Mister Ye, as long as Mister Ye is in our Ling mansion, our Ling mansion would definitely ensure your safety! Mister Ye has a great favor towards our Ling mansion; if you were to meet with an accident in our Ling mansion, how would our Ling mansion have the face to survive in this world?”</p><br/><p>Favor? Where did this favor come from?! Ye QingChen was completely confused. Since when did I have a great favor towards your Ling mansion? He then looked towards Ling Tian and saw that Ling Tian was giggling, signalling to him to not deny the matter. Just what is going on here?</p><br/><p>“Ah ah… old madam is too courteous. It is no effort at all and not worth remembering.” Ye QingChen said, with a head full of confusion. Dammit, I must definitely question this brat later!</p><br/><p>“It may be nothing big to Mister, but it is a gigantic favor to our Ling family, akin to giving our Ling family a chance to be rebirthed. Furthermore, this old lady will also have to thank you for educating this mischievous grandson of mine.” Old Madam Ling said solemnly. Seeing that Ye QingChen did not deny what she said, her respect towards him grew.</p><br/><p>The commotion by the doors of the mansion grew louder and louder, and Ling Zhan’s voice began to grow louder and louder as well. It seemed as though they were really about to fight already. Ye QingChen then smiled awkwardly and said, “Let us settle the matter by your doorstep first.”</p><br/><p>As they walked to the entrance of the Ling mansion, they were all startled. There were two old man glaring at each other like they were in a cock fighting ring with all the blades of the Ling family’s guards out of their sheaths. All of these men were personally picked out by Ling Xiao from the army, how would they be ordinary?</p><br/><p>Outside the mansion, the elites of the Yang family were also fully dressed in armor, with killing intent emanating from them. There were over a thousand of them who were present! Behind Yang KongQun, there were two emotionless looking plain dressed old men. Occasionally, there would be a divine light shining from their eyes, obviously showing signs of profound inner Qi! Behind Duke Ling, there were also two black dressed men with a concealed aura, looking as though they were experts as well.</p><br/><p>Ling Tian whispered with doubt, “Grandmother, who are those two black dressed men behind grandfather? Why haven’t I seen them before?”</p><br/><p>Old Madam Ling patted him on the head and said, “These two are your grandfather’s personal guards. When your father frequented the battlefield in the past few years, your grandfather had sent them to your father’s side. Now that there are no more battles, the both of them would naturally return. This time, the line-up of the Yang family really cannot be underestimated. This cavalry is obviously the elites amongst the elites. Don’t tell me Yang KongQun is really planning to commit a heinous crime and fight our Ling family?”</p><br/><p>Ling Tian studied Yang KongQun carefully and laughed, “That old man is putting nothing up nothing more than a false bravado. If our Ling mansion was his intention, he would have already launched an attack for sure. For him to be only arguing with grandfather, it can be seen that his only motive is Mister Ye.” without a trace of concern in his words.</p><br/><p>“He, Yang KongQun, still do not have the rights to take away someone from our Ling family!” Old Madam Ling snorted, “Look at how this old lady will shatter that old goat’s head with my walking stick!”</p><br/><p>“Please wait, old madam!” Ye QingChen walked forward calmly with a relaxed smile, “Since Yang KongQun is here for this Ye, then let this Ye send him away.”</p><br/><p>Before waiting for Old Madam Ling’s reply, Ye QingChen had already taken a step out.</p><br/><p>Old Madam Ling was stunned and wanted to follow him forward. However, Ling Tian pulled her back and shook his head, “Grandmother, watch this show quietly. I want to see how Yang KongQun will conclude this matter!”</p><br/><p>Old Madam Ling’s face turned serious as she asked softly, “Ye QingChen isn’t the one who took action this time? The way that darn old man is acting, it seems as though he has concrete evidence. Mister Ye has bestowed our Ling family with a great favor. Even if he is an expert, it would be difficult for him to fight against such numbers, he must definitely be careful!”</p><br/><p>Ling Tian then revealed a sly smile, “Rest assured grandmother, Mister Ye isn’t the one who took action. Grandson is certain that this old man Yang will definitely go back depressed this time. He definitely will not be able to touch Mister at all! Ah ah, our Ling family can even use this opportunity to build up our reputation, becoming an existence that even the Emperor of the Sky Bearing Empire would not dare to touch.”</p><br/><p>Old Madam Ling’s face was filled with doubt but Ling Tian did not explain anything.</p><br/><p>On the other side, Ye QingChen had already opened his mouth, “I heard that the Family Head of the Yang family is here to catch this old man? I wonder what crime this old man committed?”</p><br/><p>As he opened his mouth, everyone quietened down immediately and looked at this person who was at the heart of this storm. They all never expected him to walk out so easily!</p><br/><p>Yang KongQun’s eyes narrowed and said with a sneer, “Mister’s martial arts is extremely profound, killing a hundred people alone and murdering the young noble of the NanGong family, NanGong Le. After that incident, you did not escape and still dare to appear out in the open. Your courage is something that this Yang really admires!”</p><br/><p>Looking at Ye QingChen, Yang KongQun seemed to be extremely confident and calm on the surface. However, he was extremely nervous in his heart. From the loud roar last night, there wasn’t a single expert in the Yang family who didn’t feel their hearts tremble! Just how many of such experts could there be in the world? At the very least, the Yang family did not have any of such experts!</p><br/><p>Knowing that they were here to capture him today, everyone was prepared to die here today! Since Ye QingChen was such an expert, how would it be possible for them to capture him without paying the price? Besides that, it is extremely likely that he will escape, even if the Yang family were to pay a heavy price!</p><br/><p>After a long discussion, they finally decided to send the two most powerful experts of the Yang family to guard Yang KongQun. This is to ensure that Yang KongQun would not fall into the hands of the enemy and become a hostage. As for the remaining experts, they would dress up as normal guards and hide themselves amongst the Heavenly Blade Troops. The moment a fight breaks out, they would be able to catch Ye QingChen off guard and capture him in one fell swoop!</p><br/><p>Ye QingChen’s expression was extremely calm and unperturbed. Occasionally, there would be a look of disdain in his eyes, “Family Head Yang, this Ye is just a fortune teller trying to make a living in the pugilistic world. I never expected that entering the capital would make Family Head Yang think that I am a murderer. This is really the biggest joke in the world! In the world, you would find it hard to take a single step forward without a proper reason. Catching a thief or adulterous couple cannot be based on the one-sided statement of someone! You said that this Ye is the murderer, alright! I wonder what evidence or witnesses you have?!”</p><br/>\n</div>"}