{"title": "Chapter 144", "id": 144, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-144", "volume_title": "Volume 2", "body": "<h1>Chapter 144</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 144: Killing Intent After Drinking</p><br/><p>Translator: chuchutrain Editor: celllllLing Tian laughed in response, “The moonlight shines on the filled wineglass, a desire to drink but the mounted pipa player is urging; crouching drunk on the battlefield no one smiles, how many people across the ages actually return from a war! In this present age, to indulge in wine without a wineglass to complement, is actually a loss in honor…”</p><br/><p>Ye QingChen sat silently as he listened, a burning heroic spirit rising within him, making him down his entire cup.</p><br/><p>“I’ve looked down on the skills of this little brother once again. What a good Man’s Blood, pure yet fragrant, and what a good poem! It indeed spells out the innate qualities of a man! So, to appreciate a wine fully, one needs a wineglass to show off its beauty. My brother, you’re indeed a true wine connoisseur!”</p><br/><p>“Elder Brother, slow down on the praises, this little brother has yet to give you a test. You mentioned you’re proficient in wine sampling, but I’ve yet to verify this. What year do you think this wine was made in?” Ling Tian had on an evil expression, as though prepared to make things difficult for him.</p><br/><p>Ye QingChen did not mind it at all and replied, “Brother’s wine is heavenly indeed, far exceeding all ordinary wines on the market. However, when talking about recognising the age, this dim-witted brother might not lose to anyone. I’m guessing a maturity of three years!” His tone was full of confidence!</p><br/><p>Ling Tian retained his evil expression, pressing on immediately, “Really? Does brother really think so…?”</p><br/><p>Ye QingChen paused for a while. Though his contact with Ling Tian was short, he could be said to be more familiar with Ling Tian, even when compared to some of the people closer to Ling Tian. As such, he naturally suspected there was more to that than met the eye. He poured himself another cup and sampled it once again; indeed, the more the tasted it, he more shocked he got.</p><br/><p>Only after a long while, did he mutter to himself, “What a bewildering wine, this obviously only has three years of maturity. But somehow, I taste six years of maturity and another hint of a maturity of nine years. There’s a hint of age amongst the freshness, and this mellowness of age gives way to a deeper grade of age. How is this possible? How puzzling, puzzling…” Raising his head, seeing the evil expression of Ling Tian staring at him, he scolded, “Dammit, you’re teasing this elder brother of yours aren’t you? Hurry and reveal your secret before I beat the daylights out of you!”</p><br/><p>Ling Tian did not try to lengthen the suspense. Instead, he replied, “As what brother has spoken, ‘a hint of age amongst the freshness, and furthermore the age deepening itself as it passes’, this is enough for me to praise you. The secret lies in the words you’ve spoken. Nine years ago, I buried nine jars of grape wine that had just begun to ferment. Then, I took them out in the third year and used a secret method of evaporation, reducing three jars to one. Then, I reburied them and left it to continue fermenting. After three more years, I repeated the same process and reburied it again. Finally, after another three years, this only vat left is the completed product; having the flavours of both a young wine and an aged wine. It seems like it’s only three years, but in actuality, it is nine years of evaporating and refermenting! A heavenly product, the ‘Man’s Blood’!”</p><br/><p>Listening to Ling Tian’s explanation, Ye QingChen was thrown off totally. Tasting his cup of Man’s Blood, he could feel his emotions surging, feeling sweet yet sour. In his life, it was his first time coming across such a rarely seen and heard of immortal wine, and he could not help but drink a few more cups. However, little did he know that the method to evaporate the fermented wine, combining three into one, only served to further increase the alcohol content of the wine, up to ten times the norm! Furthermore, the large amount of wine he sampled previously, only served as a foundation, to the point where even his own internal energy was unable to control his intoxication.</p><br/><p>By the time Ye QingChen discovered something was amiss, he had already begun to feel muddleheaded, bereft of any strength. He could only lean on the table top leisurely, muttering, “In my intoxication, I’m about to visit the Monarch of Dreams, but I await the appearance of new wine the very next day,” before he stopped moving altogether. From the time they started drinking, Ye QingChen had actually not even touched the exquisite accompanying dishes even once!”</p><br/><p>Ling Tian shook his head, his newfound elder brother was indeed considered a wonderful person, he could even collapse into a stupor with such style. At the same time, he was full of praise for himself, that he could actually be considered as an expert in wine itself.</p><br/><p>The first five wines that were taken out by Ling Tian were no doubt the exceptions of exceptional wines. But they were all made by masters of his previous world and Ling Tian did not feel any pride merely imitating their methods. However, the final wine, ‘Man’s Blood’, was based off the novel ‘The smiling, proud wanderer’ [1] that he had read in his previous world. While his self-created wine could not beat those fine wines of hundred years in age, it had a different form of subtlety. Every evaporation process just so happened to be a three-year-old fine wine, three years after three rounds of evaporation, followed by a final three rounds of fermentation; the effort needed was definitely not below those famed wines. This thought flow allowed Ling Tian to break boundaries. The wine process was started when Ling Tian was a mere five or six years old, for this almost decade long processing of wine to be praised so reverently by a wine master of this present world, Ling Tian only felt the highest pride and honor.</p><br/><p>Glancing at the unconscious Ye QingChen, Ling Tian could only pat his head and berate himself. How could the wines he took out be compared to those diluted wines that were served outside? Especially the Man’s Blood, which possessed alcohol content which was ten times stronger. Furthermore, to continuously sample all these intensely strong wines, even if Ye QingChen had a tolerance as huge as the ocean and also incredibly pure internal energy, he was still a mortal after all. Not getting drunk would be the weird part! Ling Tian smiled ruefully as he supported Ye QingChen’s huge frame with ease.</p><br/><p>On the side, Ling Chen laughed, “As what Young Noble has mentioned, this Mister Ye is indeed a wonderful person, simple-minded to a fault, but yet extremely interesting, hehe.”</p><br/><p>Ling Tian laughed as well, pretending to reprimand her, “You lass, how can you talk about such nonsense? Clean up this place, I’ll send Mister Ye over to the guest room first.”</p><br/><p>Ling Chen replied with an unusually soft voice, a hint of disappointment visible in her eyes, coupled with some bashfulness. Her face suddenly reddened, and her eyes grew shifty as she avoided Ling Tian’s gaze. Ling Tian could not help but feel something amiss, what was Ling Chen embarrassed about?</p><br/><p>As it turns out, the lass Ling Chen was actually undergoing the blossoming of love. Seeing Ye QingChen out cold in Ling Tian’s own room, and feeling Ling Tian’s hot gaze on her, her thoughts ran wild and imagined that Ling Tian would choose to sleep in her room since he had nowhere to rest for the night. At this, her heart was three parts overjoyed, three parts shy, three parts nervous and one part expectant. However, upon hearing Ling Tian’s words, she realised that she was over imagining things and thus felt ashamed, even though Ling Tian was unaware.</p><br/><p>While Ling Tian was blessed with exceptional intelligence, in the end he was still a virgin of two lifetimes, how could he understand the thoughts of a female? He tilted his head left and right bewilderedly, before deciding to put it behind him. He then kissed her on the lips gently and praised, “How fragrant! This is actually more fragrant than the most exceptional wine I’ve ever tasted, hahah…”</p><br/><p>Ignoring her reaction of stamping her foot and pouting in annoyance, Ling Tian dragged Ye QingChen and proceeded to walk towards the guest room. However, he was greeted with the sight of XueLeng and his brother upon opening his door. Both of them stood there, with heavy expressions, as though awaiting an enemy.</p><br/><p>Ling Tian’s heart twitched in fright at first, but soon relaxed when he realised it was probably because of the shout let out by Ye QingChen, which was attracting trouble now. Seeing their expressions, Ling Tian could not help but feel moved. That resounding shout from Ye Qingchen, reverberating throughout the skies with a such a magnificent prestige, likely alerted a lot of people. He was indeed too careless, at this stage where Sky Bearing was in a state of xenophobia, treating everyone as their enemy, the appearance of such an expert would inevitably arouse the suspicions of all the various great families. This was especially so for the Yang Family. How would they react? Ling Tian could feel a headache coming on; seems like the Ling Family would be thrown into the deep sea come the morning.</p><br/><p>“Is he the one who let out that resounding yell just now?” XueLeng glanced at the unconscious Ye QingChen draped over Ling Tian’s bosom, his expression full of panic. From the shout previously, they could tell that this person’s strength should have already entered into the Saint Realm and was someone that, even by joining forces with his brother, they could never hope to beat. Even now, seeing him drunk and unconscious, they did not dare to let down their guards.</p><br/><p>A ray of cold killing intent faintly surfaced within Ling Tian’s eyes. If the duo wanted to do something untoward to Ye QingChen, then there was no need for words. Even if he had to offend Yu BingYan openly, he had to silence the two of them! ‘This is my, Ling Tian’s territory. No matter who you are, or where you come from, if you’re a dragon you had better stay coiled up. If you’re a tiger, you had best stay low on the ground! To use such a tone against someone I’ve invited over, you must be tired of living!’</p><br/><p>“That’s the old man here.” Before Ling Tian had the chance to speak, a cold voice sounded. The Ye QingChen, that was draped over him, had opened his eyes a crack. While he remained in a drunken haze, a penetrating ray of light still present in his eyes caused the two guards’ faces to change. “Do you have any advice for me?”</p><br/><p>The moment Ling Tian’s hand had touched Ye QingChen, he had already woken up; this was the acute sense of a peerless expert. Although he was drunk to the point he was woozy, the vigilance of an expert had long been carved deep into his bones, always present. Seeing the duo block the road of Ling Tian, he remembered that Ling Tian was still concealing his own strength, and thus took the initiative to speak.</p><br/><p>Not only that, he knew that if Ling Tian were to move, the two fellows in front of him would die without a doubt! This was because Ling Tian would never allow anyone outside his circle to be privy of his greatest secret! For someone as kind-hearted as Ye QingChen, he could not bear to see the two of them die just because of a random shout from himself. Since he had felt the first signs of killing intent emanating from Ling Tian, he took the chance to speak before Ling Tian could.</p><br/><p>“I wouldn’t dare, may I request for the surname of this respected senior?” A sense of danger started to surface from XueLeng’s heart, as though he was coming face to face with a venomous ferocious beast in the midst of choosing a prey to devour. In an instant, both of the guards’ shirt were filled with sweat. However, to ensure the safety of their princess, they had to unravel this unknown expert’s background, for if anything untoward happened to the princess, then even with a hundred deaths, the two of them would not be able to atone for their crimes.</p><br/><p>The two of them did not realise that this sense of danger was actually originating from Ling Tian and not the Ye QingChen that he was holding!</p><br/><p>Ling Tian spoke indifferently, “This is my sworn brother, please excuse us, gentlemen, for I need to send my brother over to the guest room for a rest.” He understood the intention of Ye QingChen and he was, after all, unwilling to make a move towards the two men. While they made him uncomfortable, they were simply loyal with a fault to Yu BingYan and were simply carrying out their tasks to the best of their abilities. As such, unless forced to the point of no return, Ling Tian was unwilling to eliminate the duo.</p><br/><p>“I understand; however, this concerns the safety of my princess. While I know I’m overstepping my boundaries, I still have to do so. Please forgive me, Young noble. May I request for this esteemed Senior’s name? This junior is XueLeng, from the Yu Family.” XueLeng refused to budge even a step and even took out his Yu Family’s name. This caused Ling Tian to stiffen, a chilling ray flashing through his eyes as an intense wave of killing intent rushed out from him!</p><br/>\n</div>"}