{"title": "Chapter 149", "id": 149, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-149", "volume_title": "Volume 2", "body": "<h1>Chapter 149</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 149: Imminent Peril</p><br/><p>Translator: chuchutrain Editor: celllllAlthough Ye QingChen was resentful, but being a kind-hearted person, he still gave a way out for Yang KongQun to salvage himself. So long as Yang KongQun did not intend to take things too far, Ye QingChen did not intend to drop all pretense of cordiality and reveal his identity today just for today’s matters.</p><br/><p>However, Ye QingChen did not imagine that Yang KongQun, facing the pressure from within the Sky Bearing Empire as well as the external pressure towards his family, had already reached a stage where he could only nock the bow and shoot! In the latter’s eyes, while Ye QingChen was powerful, he was just one person and could be easily contained. If his strength had no limit and could not be contained, Ye QingChen could still be framed as the suspect for the murder. At the same time, it could also serve as an explanation to the NanGong family — That the murderer was too valiant and that they tried their best! Thus, Yang KongQun had no choice but to make a move!</p><br/><p>The way the Ling family conducted themselves was clean, without any vestiges nor seams. However, a blight had happened in the inner circle of the Yang family. Thus, they had no time to care about the Lings. However, if they really let it be and allowed this expert to enter the Ling family, then with such an expert helping them out, by the time the dust settled over the matter of the Yang and NanGong family, the Lings would long have overtaken the Yangs! This could not come to pass! Therefore, with such an opportunity as Ye QingChen appearing, it was akin to killing two birds with one stone, and no matter what, Yang KongQun had to grab on tight to it! Only then could he throw the Ling family into a mess, preventing them from accepting this expert!</p><br/><p>No matter how profound Ye QingChen’s martial arts were, he was, after all, only a member of the pugilistic circle. With the right price, taking him down to divert the attention of the NanGong family, the Yangs would finally obtain a breather. Compared to the threat of the NanGong family hovering over them, Yang KongQun felt that their chances were better if they faced off with this unknown expert! At least, his losses could be controlled.</p><br/><p>Of course, this whole affair was based off the fact that Yang KongQun was not aware of Ye QingChen’s identity. If not, he would not have even dared to look at him!</p><br/><p>Never in his dreams did Yang KongQun think that the trouble riled up by offending Ye QingChen would be ten times more terrifying than provoking the NanGong family! If he knew of the latter’s status, he would probably be so depressed that he would commit suicide!</p><br/><p>“Hahaha… fortune teller?” Yang KongQun scoffed in disdain. Only fools would believe so! With such outstanding movements and strong internal energy, one could already be classified as a top-level expert. How could he be a mere fortune teller?</p><br/><p>Ye QingChen furrowed his brows, leaking out an imposing aura as he spoke, “Does Family Head Yang have a problem? Is it that you have a problem with us fortune tellers?” His patience towards Yang KongQun was rapidly wearing thin. Having just awoke with a hangover, his mood would naturally not be good! To meet with such a matter early in the morning, a perfectly innocent person being maligned, this was a first for Ye QingChen who had roamed the world for the past tens of years! Even a clay man would still possess its original characteristic of mud, let alone someone who was of such a high stature as Ye QingChen!</p><br/><p>“Since you’re a fortune teller, why don’t you help this old man to read his fortune?” Yang KongQun had on a dark expression; because this man was still under the Ling Family’s roof, the moment they made a move, the Ling Family would definitely not sit by idly! With how accomplished this fortune teller was in martial arts, there was a need to separate the relations of the Ling family with this person. The best way to do so would be to rip apart the fortune teller’s facade, so the Ling family would realise that they were being deceived and naturally stand out of this matter. If the Ling family retained its stand of interfering, then Yang KongQun could actually make use of the authority bestowed by the Emperor Long Xiang to ensure that his plans succeed! Furthermore, the Ling family can even be made to shoulder the brunt, allowing him to sit on the side lines, reaping the rewards after everyone got injured.</p><br/><p>Ye QingChen smiled slightly, “If that’s the case, it isn’t anything hard. Family head Ling, may I trouble you to prepare a table with some writing essentials?”</p><br/><p>This went completely out of Yang KongQun and Ling Zhan’s expectation — how did this talk divert towards fortune telling all of a sudden?</p><br/><p>Old Madam Ling was the only one that remained alert. She immediately bade a servant to prepare the items swiftly and everything was brought out with just the time taken to prepare a cup of tea.</p><br/><p>Ye QingChen seated himself on one side of the table, gesturing to Yang KongQun, “Family Head Yang, please confer upon me a word!”</p><br/><p>Yang KongQun did not expect that this peerless expert would actually ask him for a word to predict his fortune. But since he had already spoken so before, there was no way for him to go back from his words. As such, Yang KongQun could only signal to the two guards beside him — In the event somebody makes any unexpected moves, they are to take action immediately.</p><br/><p>Yang KongQun did not dare to tarry; he walked over carefully and wrote down the word ‘every’.</p><br/><p>Ye QingChen smiled before continuing, “Will Family Head Yang please stretch out your hand for an examination, so I can confirm the meaning of your word!” Stretching out his own hand, he caused the entire crowd to go into shock. Yang KongQun was, after all, a politician and of shallow martial arts background. To an expert such as Ye QingChen, it was as good as fighting a toddler. If he were to really give his hand, would that not be sending himself to his death?</p><br/><p>However, this was sufficient to show the extraordinary bearing of Yang KongQun. With only a slightly pale face, he stretched out his right hand towards Ye QingChen, at the same time saying, “Since Sir is an expert amongst experts, I believe you will not do something as despicable as seizing my hand, am I right?”</p><br/><p>Ye QingChen laughed as in response and did not touch his hand, merely scrutinising it. In this solemn atmosphere, he suddenly burst out into more laughter, smiling at Yang KongQun as he cupped his fists, “I must congratulate you, Family Head. It seems like you’re expecting!” Everyone started to sweat at this statement, this was no laughing matter, telling a grandfather, and what more one of the fathers of a nation, that he was expecting. That would probably be the worst insult and ridicule one could ever think of!</p><br/><p>Seeing their Family Head being insulted, the Yang family blustered, almost striking out!</p><br/><p>However, Yang KongQun did not flare up. But instead withdrawing his hand, he said, “Mister must be joking. This Yang might be old, but I’m still a man through and through, how could I be expecting!” This was actually the first time he had spoken in such a level tone to Ye QingChen!</p><br/><p>Ye QingChen beamed, “When observing palmistry, the left is for males, and the right for females. I’m sure Family Head knows that the word ‘every’ is made up of the words ‘people’ and ‘mother’ [1]. Thus, it can be read as mother with people, doesn’t that mean that she’s expecting? Thus, I believe that you must have taken in a new concubine recently, and even at your age, your vitality is still as strong as ever. Hence, she’s already expecting. Many congratulations to you!”</p><br/><p>Old Madam Ling began to muse, “Seems like this old man Yang took in his thirteenth concubine just last month…”</p><br/><p>Standing by the side, Ling Tian remarked in a voice that was not loud, but not soft enough such that the surroundings could not hear, “This old fogey, to think he has so much energy to keep doing it. Not only did he not die while in bed, he even got someone pregnant, how capable! I’m thoroughly impressed!”</p><br/><p>While the Yang family members glared at Ling Tian, Old Madam Ling gave Ling Tian a light smack, nagging, “What kind of nonsense is coming out from your mouth, rascal! Even butting your heads in your elders’ affairs! If he’s capable, that’s his problem, why do you have to care?” In which way did this sound like a lecture??!</p><br/><p>A look of shock flittered past Yang KongQun’s face. If someone had told him that he had taken in a concubine, that was not surprising since this was something most people already knew. However, the news that his concubine was expecting was only passed to him yesterday, with nobody from the Yang residence even knowing of it at the moment. Did this person really have the ability to read palms!</p><br/><p>Yang KongQun’s tone now carried a few more hints of respect as he said, “It seems like this Yang had judged you wrongly! Will this Sir help me to calculate once more!”</p><br/><p>Ye QingChen smiled in response, “What difficulty is there? Family Head Yang, please put down another word!”</p><br/><p>Yang KongQun’s brain clicked and he wrote down the same word, ‘every’.</p><br/><p>Ling Tian opened his mouth at this time. “Don’t tell me… the old man still has another concubine that’s expecting? He has too much energy!”</p><br/><p>However, the face of Ye QingChen did not change, repeating the same sentence, “Will Family Head Yang please stretch out your hand for an examination, so I can confirm the meaning of your word!”</p><br/><p>This time, Yang KongQun extended his left hand slyly and Ye QingChen stared hard for a few seconds before speaking, “Just now, when Family Head Yang had written the word ‘every’, your word was neat but it showed your unsettled heart. Furthermore, you put out your right hand. Thus, it can be deciphered as a mother with people, which meant the good tidings of a newborn. However, this time, when you wrote down the same word, you were self-reflecting. Thus, your word subconsciously looked more like the word ‘’, ‘regret’! This word bears the extraordinary aura of a dragon yearning for the sky. It seems like you have an ambition to become a dragon amongst men! However, based on the Book of Changes, at the extreme end of the eight trigrams, the ‘Nine Nine’ sequence [2], the haughty dragon regrets. Because it wanted to prove its masculinity, it did not know when to curb itself and could only end up bleeding and injured…”</p><br/><p>Ye QingChen’s words stabbed into the root of Yang KongQun’s heart and his expression grew nasty as he hollered, “Bunch of bullshit! You’re definitely the true murderer, men, take him down! Living or dead, it does not matter!”</p><br/><p>At this point, a light reproach was heard, “Halt! To think you dare be so unbridled in front of the Ling residence!” As Old Madam Ling hobbled forth slowly, she exuded a frigid aura.</p><br/><p>The Heavenly Blade Troops, which were poised to rush in, could only halt and stare at each other as Old Madam Ling barred their way forth!</p><br/><p>Ling Tian secretly shook his head at the sight. Be it cavalry, tactics or sword skills, they were all considered perfect! Their battle strength was frightening and not at a disadvantage when facing his own private troops! While they could be monsters on the battlefield, in the capital, their arms and legs were all tied up. If this was Ling Tian’s personal troops, they would crush whoever was in front, be it man or buddha! It was kill or be killed for them! By lacking such determination in their mentalities, Ling Tian only felt utter contempt.</p><br/><p>“Old Madam, please slow down, Yang KongQun will not do anything to me!” Ye Qingchen retained that easy smile on his face as he stepped forward.</p><br/><p>“I don’t dare to do anything to you? This old man has received the Imperial Decree, to apprehend the murderer. With your extraordinary martial arts, coupled with your pretentious tales, why would this old man not dare to take you down? Hahaha…” Yang KongQun’s expression grew ruthless. However, his face leaked a hint of his fear. He suddenly raised his right hand, and dropped it as he ordered, “Kill!”</p><br/><p>The troops that were on the verge of snapping responded with a ‘qiang!’ sound, as all their blades were drawn out at the same moment, rushing forward like the waves of an ocean!</p><br/><p>Ye QingChen’s eyes burned as he stared at Yang KongQun. His eyes filled with pity as he put his hands behind his back, and uttered leisurely, “The High Heavens have no Beyond, the Great Mountains countless kilometres!”</p><br/><p>[1]: The word ‘every’ is written as , where the top part can be tweaked to be ‘’, meaning people; and ‘’ meaning mother.</p><br/><p>[2]: This is based off the Book of Changes and BaGua, the eight trigrams.</p><br/>\n</div>"}