{"title": "Chapter 141", "id": 141, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-141", "volume_title": "Volume 2", "body": "<h1>Chapter 141</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 141: Becoming Sworn Brothers</p><br/><p>Translator: chuchutrain Editor: celllllAt this point, Ling Tian snuck a look at Ye QingChen. Seeing his disappointed expression, Ling Tian could not help but feel guilty. Using such schemes to trick such an expert, was it considered being overboard?</p><br/><p>However, since matters had already reached to such a stage, regret was not enough to halt Ling Tian. Furthermore, it was merely for some news and information, Ling Tian did not harbor any unsavoury thoughts towards him. This managed to calm down Ling Tian’s guilty conscience, and he continued muttering, “Ling Tian hates the fact that I met Mister at such a late timing, and hate the fact that I could not stay through the night to speak with Mister. If Mister does not look down on Ling Tian, would you be willing to come to my residence and discuss about life while indulging in wine?”</p><br/><p>Hearing such an offer, Ye QingChen could not help but get excited. Especially the phrase ‘indulge in wine’, it completely chased away any depressed feelings he might have felt. He laughed heartily as he bellowed, “What sort of words are those, an invitation by Young Noble himself, this Ye couldn’t be happier to accept!”</p><br/><p>Under his elation, he subconsciously changed his term of speaking, from an arrogant ‘this old man’ to become ‘this Ye’. Unconsciously, he was already treating Ling Tian as being on equal grounds as him, rather than as someone of a junior generation.</p><br/><p>Ling Tian smiled in response and gestured with a hand towards the entrance as he smiled, “If that’s the case, then junior will help this senior heft his signboard and see if you can get more business!”</p><br/><p>At this sentence, Ye QingChen laughed so hard that his beard twitched uncontrollably. “I doubt so! With your name as the number one silkpants, holding my signboard would result in no more business for me, I’m afraid! Hahahaha…. Little brother, this is depriving me of my business; if this Ye runs out of money to buy wine in the future, I’ll come knocking at your residence instead!”</p><br/><p>“Hahaha, whenever Senior comes, this Junior will sweep the floor clean to welcome you! It’s just that this junior has a small lodging. I hope senior won’t mind!” Ling Tian spoke with a grin.</p><br/><p>Both of them jested and joked, but hidden inside their words were bits of truth, thrown amidst the false niceties. While their conversation sounded like airy words, they could be treated as serious statements too! Both of them burst into laughter again at the end of their conversation.</p><br/><p>After the moment of laughter, Ye QingChen suddenly spoke out, “Young Noble, us addressing each other so formally seems as though we are drawing a divide on purpose. If you don’t despise this fortune teller here, how about you call me elder brother, and I call you younger brother from now on. How does that sound?”</p><br/><p>Ling Tian beamed, “This little brother originally wanted to bring this up, but was afraid that an expert like elder brother would not agree to having a connection to someone of the mortal dust such as a younger brother. Because I was afraid of offending you, I had kept it in. Since elder brother has already spoken so, this was really warms this younger brother’s heart, haha!”</p><br/><p>Ye QingChen was pleased beyond words, pretending to bluster as he jested, “Nonsense, does elder brother look like that sort of person?”</p><br/><p>Ling Tian hurriedly apologised while laughing it off. But deep in his heart, he was thinking, ‘You don’t need to be humble, if it wasn’t for my heavenly wine, I probably would not even see your shadow right now.’</p><br/><p>Seeing Ling Tian apologise in such an earnest manner, Ye QingChen chuckled, “Little brother need not hold in your criticism. This elder brother here rarely meets anyone in the last ten years, thus am full of foolish conceit. I’m ignorant and narrow minded. If not for me coming over to Sky Bearing this time, I would not have been aware that the heavens had given birth to such a refined and accomplished youth such as yourself!” Although his words were admitting to his faults, it carried a hint of solitude and loneliness.</p><br/><p>Seeing that Ye QingChen was not at all particular about avoiding taboos, Ling Tian could only smile wryly. His actions conveyed how candid and open he was, and this raised a few more points for him in Ling Tian’s heart.</p><br/><p>Exiting from the private room, the duo was greeted by the various guards which stood up and bowed. This sound alerted the ladies, who were seated in another private room. They stood up hurriedly and exited their room.</p><br/><p>Ling Tian felt completely careless and worriless. With a flash of his body, he appeared behind Ye QingChen, pushing him forward as he grinned, “This is Mister Ye, from today onwards, since he’s my sworn elder brother, when you guys see him, you need to pay your respects too.”</p><br/><p>The moment he spoke, everyone except for Ling Chen took on a change in expression. This was especially so for the Ling Family’s guards. They were all wondering what sort of mental illness had stricken the young noble again — to reduce his status to a point where he accepted a dubious swindler as a sworn brother!</p><br/><p>As for the bodyguards of the Yu family, they were thinking about how this poor silkpants kid probably got scammed by this swindler. However, while this was no big matter, no one dared to speak up for fear that Ling Tian would fly into a rage due to humiliation, directing his anger to his underlings. Wouldn’t dying in such a way be an injustice? Thus, all of them stood by the side, looking at the scene as though it was a comedy.</p><br/><p>The Ling family’s guards could only salute once again, calling out, “Paying respects to Mister Ye!” The latter responded with a nod of his head, being neither too servile nor overbearing.</p><br/><p>A smile bloomed on Ling Tian’s face; evidently, he had already mentally prepared himself for such a scenario. On the other hand, Yu BingYan had a face of confusion. What was her Tian’ge up to this time? Was there another meaning behind this, maybe the swindler was actually a talented individual who had experienced the vicissitudes of life?</p><br/><p>At the wave of his hand, and the command, “Let’s return!” from Ling Tian, the various guards streamed out neatly, clearing a path for them.</p><br/><p>However, Ye QingChen loitered behind, grabbing onto Ling Tian’s sleeve and whispering, “You rascal, since when did I become your sworn brother? How come even I am unaware of it?”</p><br/><p>Ling Tian burst out into laughter as he replied, “Elder brother, you were the one who asked me to call you elder brother, and you address me as younger brother. Since we’re not born from the same mother, with no blood relation whatsoever, if we’re not sworn brothers, then what are we?”</p><br/><p>Ye QingChen was rendered speechless by the reply. Although he felt that the reply was pushing it a little too far, he could not put his finger onto what exactly felt wrong. After a moment of pondering, he could only say, “For someone of little brother’s stature as well as talent, I would benefit by having such a strong connection as my younger brother, but…”</p><br/><p>“But what? For someone of elder brother’s level, don’t tell me you still put significance in the customs of incense burning, three kowtows and nine salutes? The words from a man of character, once spoken, cannot be taken back. If you say we’re brothers, then we are. With the sun and moon as audiences, the sky as a witness, why bother with all the wishy-washy conventions! Since we address each other as brothers, then we are thus. What other reasons do we need?” Seeing him attempting to shirk responsibility, Ling Tian immediately cut off his train of thought, using such overbearing words to force Ye QingChen to a point of no return.</p><br/><p>In actuality, Ye QingChen had no intention of shirking responsibility. However, he realised that if he were to continue declining after hearing what Ling Tian said, then that would be too pretentious and unreasonable of him. As such, he merely smiled and said, “Little brother, you have a sharp tongue indeed!”</p><br/><p>What kind of person was Ye QingChen? He immediately caught onto the fact that Ling Tian was trying to drag him into the same boat as himself, using him to achieve his means! However, he suddenly realised that it was actually such a joyous thing to have a person like Ling Tian as his brother, and instead of being repulsed, he felt over the moon.</p><br/><p>Ye QingChen had led a solitary and impoverished life for his first half, drifting around everywhere as a vagrant. Luckily, he had met a peerless expert and managed to cultivate a top level martial skill, which allowed him to use his newfound talents to survive. However, his heart had always been lonely and cold; after all, all humans desire love and warmth. Who would say no to familial love? Though he knew that Ling Tian was using him in a way, having a sort of relative to care for made him feel a comfortable, but foreign, warmth in his heart!</p><br/><p>Ling Tian suddenly stood still, and faced Ye QingChen seriously as his eyes revealed utmost sincerity, “Elder brother, if I say that I have no ulterior motives, you would probably not believe. However, whether you believe or not, this little brother only has one thing to say. If I don’t see eye to eye with someone, even if he’s a top martial exponent in the world capable of opening up unlimited possibilities for me, I would still be unwilling to acknowledge the person! As the saying goes, ‘A horse’s worth is only shown through a long journey, and a person’s heart is only seen through the passage of time’. I hope that elder brother will witness my actions and use it to forge a bond of camaraderie!”</p><br/><p>Ye QingChen was rooted on the spot, overcome with emotions. From the sincerity in Ling Tian’s tone, Ye QingChen was aware that all those words he spoke came from the bottom of his heart and could not help but feel touched at his declaration. He nodded his head solemnly, saying, “Little brother, I trust you completely! In my life, this elder brother has perused through countless lives and I have faith in my own abilities to read people. Trust is based off a person’s speech. If there is no trust, how can one achieve any standing amongst humans!”</p><br/><p>The two of them glanced at each other, clasped their hands, bursting out into laughter.</p><br/><p>As the duo walked out of the bar, the clouds above the Western part of the skies were already dyed a crimson red! Unknowingly, they had actually spent over half a day in that little alley bar!</p><br/><p>Ling Tian spied on Yu BingYan trailing behind him, unusually silent, but occasionally raising her head with a hint of bitterness in her eyes. With a quick twist of his mind, he deliberately slowed down his steps to walk side by side with her. Yu BingYan acknowledged his presence by raising her head, before her tiny mouth turned into a pout and turned her head the other way with a ‘hmph!’ sound.</p><br/><p>Ling Tian laughed out at the scene. “Aiya, what’s this? How did a peony suddenly start growing on the mouth of my little sister Yan’er? Although it looks good, this is not the place for it; come come, let this brother pluck it for you. Else when we arrive back home, the lass Ling Chen will end up placing it inside a vase!” As he spoke, he jokingly stretched out a hand, ready to touch Yu BingYan’s mouth.</p><br/><p>Yu BingYan exerted her utmost to control her facial expressions and swatted Ling Tian’s hands to the side, before she let out a ‘puchi’ sound, and burst into laughter. She originally wanted to hold it in, but realised that it was too late. She could not help but stomp her foot viciously, pouting once again.</p><br/><p>Ling Tian chuckled and leaned closer to her ear as he whispered, “Yan’er, as friends, I really do not want to put you in a spot, so how can you be willing to create trouble for me?” His voice was so low that only she could hear. While this sentence did not explain much, it pierced down deep into Yu BingYan’s heart!</p><br/><p>The words drilled themselves into her ear, one by one, and Yu BingYan suddenly felt as though her head was heating up. Her eyes started to water and her nose wrinkled as a wave of warmth flooded her heart. ‘Turns out that he was really thinking for me!’ Even though she had long come to this conclusion, she still felt a huge sense of bliss, listening to the words coming out from Ling Tian personally. The indignance, grief and heartache she previously felt was suddenly swept away without a trace, making her feel as though she could burst out into song.</p><br/><p>Watching how Yu BingYan had her head lowered, yet secretly sneaking glances towards his direction, with her eyes full of satisfaction and shyness. Coupled with her feminine charms, it led to amorous feelings growing within Ling Tian, to the point where he wanted to pull her close into his embrace.</p><br/><p>However, Yu BingYan only snorted and said, “What sort of person do you think you are? I can’t be bothered with creating trouble for you, hmph!” Her face looked like the crimson clouds above them as she spoke, feeling burning hot and revealing a posture of a little girl. She could not help but stamp her foot again, dashing forward and leaving behind a wave of fragrance.</p><br/><p>“Brother, you’ve literally brought this elder brother’s appetite to the top of the heavens!” Ye QingChen lamented.</p><br/><p>Upon returning to the Ling mansion, Ling Tian sent Ye QingChen over to his own courtyard, assigning Ling Chen to ensure his comfort, before paying his respects to his parents and grandparents. This was a sort of routine work for him, and after exchanging a few pleasantries, he went over to find Mister Qin as well. Ling Tian was especially worried for Mister Qin, as the death of a spouse at his age was not a small blow that could be recovered even with two or three years. Seeing him hale and healthy, full of energy, Ling Tian could finally relax and rush back to his courtyard.</p><br/><p>After the stone in Yu BingYan’s heart had been alleviated by Ling Tian, she knew that she was not suitable to remain and participate in the following conversation. Thus, she retreated back to her room early.</p><br/><p>When Ling Tian returned to his residence, Ye QingChen was already waiting anxiously.</p><br/><p>Ling Tian laughed heartily as he said, “Elder brother, there’s no need to rush. I’ll let you enjoy yourself tonight! To indulge in good wine, one must first be patient. If one is too impatient, then even the most heavenly of wines would be bland and tasteless. Don’t forget, when it comes to matters of wine, even the tiniest of matters will not be able to slip past my eyes!”</p><br/>\n</div>"}