{"title": "Chapter 150", "id": 150, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-150", "volume_title": "Volume 2", "body": "<h1>Chapter 150</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 150: Weak Finish to a Strong Start</p><br/><p>Translator: chuchutrain Editor: celllllYe QingChen’s voice was akin to the city’s morning bell, resounding loud and far, all the way to the heavens! His voice actually managed to suppress the shouting of the thousand odd men! Everybody’s ears were echoing from his voice and it seemed as though the whole world was only left with his shout!</p><br/><p>In that instant, everyone felt as though they were seeing things! The originally mild mannered and amicable Ye QingChen, had suddenly transformed into a severe and solemn person with a majestic aura! He was like a towering mountain which no one dared to encroach upon!</p><br/><p>“The High Heavens have no Beyond, the Great Mountains countless kilometres!” The ordinary citizens were in a daze, not knowing the reason as to why he shouted out this phrase when he was looking death in the eye.</p><br/><p>However, to Yang KongQun, this phrase was akin to a bolt of lightning slashing through his brain! His head was dazed from the impact, his originally tall and straight body beginning to totter.</p><br/><p>“Stop!! All of you stay your hands!!” A frantic and impatient voice suddenly sounded. Turning their heads, the crowd found out with a shock that the voice’s owner was none other than Yang KongQun! With a head full of sweat, he seemed to have met with some terrible accident!</p><br/><p>A few of the faster blades were already touching onto the sleeves of Ye QingChen, who had not bothered to even dodge. But upon hearing the command from Yang KongQun, they could not keep their blades on time and could only forcefully push their blades towards the pavement. Upon contact with the stone pavement, countless sparks were produced before they managed to halt their advance.</p><br/><p>Old Madam Ling stood behind Ye QingChen with her mouth agape, as though she was suffering from a stroke. The shock she got from the phrase Ye QingChen uttered was in no way lesser than Yang KongQun himself!</p><br/><p>“Umm… so it turns out, that honoured Sire actually belongs to… For today’s matter, KongQun has indeed offended your honour, you could not have possibly committed the crime… Umm, hehe…” Yang KongQun could only let out two mirthless chuckles, “For today’s offense, this Yang hopes that Your Honour will be magnanimous and not hold it in your heart. KongQun will definitely come back to pay a visit and atone for my mistakes!”</p><br/><p>Ye QingChen replied coldly, “There’s no need to atone for your mistakes, it’s just that Family Head Yang should hold back on blindly accusing innocents. If your luck is bad, and you offend someone which cannot be offended, then I will not ever have the chance to speak with you again!”</p><br/><p>“Yes, yes!” Yang KongQun’s forehead resembled a waterfall, sweat continuously flowing down as he replied, “Your Honour is right in lecturing me! I was indeed too impetuous in my decision this time. KongQun shall withdraw first!” Yang KongQun dipped into a formal bow at the end of his sentence.</p><br/><p>The crowd was at a complete loss. What exactly was going on with the Family Head of the Yang family? He came with such great fanfare, but after hearing an ambiguous phrase from a dubious person, he surrendered immediately and left!</p><br/><p>Yang KongQun retreated a few steps before waving his head, “Disperse and return!” From afar, he gave another formal bow to Ye QingChen before walking off.</p><br/><p>In a split second, the doorway to the Ling residence was suddenly empty and bereft of people, without even a shadow from the people in the Yang Family!</p><br/><p>The people from the Ling and Yu family now turned to look at Ye QingChen, each with a complicated gaze…</p><br/><p>On his way back to the Yang residence, Yang KongQun did not speak at all, his face black as the bottom of a pot! Hidden deeply in his eyes was a trace of fear and panic.</p><br/><p>When they finally arrived back at the Yang residence, Yang KongQun got off from his horse immediately and rushed into the backyard, leaving a bunch of clueless people staring at him.</p><br/><p>When Yang Lei, Yang Zheng and the rest stepped in, they only saw Yang KongQun sitting slumped on the seat at the front of the table, his brows furrowed tightly and his expression unsightly. Today’s problem was even more thorny to deal with as compared to the news about NanGong Le’s death, almost making him feel like he was going insane. He could not help but shrink his neck in slightly, swallowing any doubts he had about this situation.</p><br/><p>“Yang Lei, immediately send someone over to the palace and ask the Empress what are her plans, now that Consort Ling is pregnant? After you get the answer, rush back immediately and report it to me!” Yang KongQun calmed himself down with difficulty and began to issue orders.</p><br/><p>“Ah? Consort Ling is expecting?” All the Yang family members on scene let out gasps of shock. Who was not aware what sort of repercussions this matter could bring!</p><br/><p>Yang Lei did not dare tarry and rushed out to do his bidding immediately.</p><br/><p>Yang Zheng stood behind Yang KongQun silently, using his hands to gently massage his shoulders. He knew that, at this time, what Yang KongQun needed most was to relax!</p><br/><p>No matter what happened just now at the Ling residence, Yang Zheng believed that Yang KongQun had a definite reason for doing so. Without a catastrophe that could annihilate their family, or some exceptional character, it could not reduce Yang KongQun, who stood as stably as Mount Tai, to this state! The issue lay with the green robed fortune teller and the mysterious phrase that he uttered!</p><br/><p>Yang KongQun remained still with his eyes closed, fatigue written all over his face. He suddenly asked, “Yang Zheng, you’re the trusted aide of this old man, why didn’t you ask me why we retreated so suddenly just now?”</p><br/><p>Yang Zheng replied solemnly, “If the Family Head wishes to retreat, he must have his reasons. This servant just needs to follow orders precisely and not ask too much.”</p><br/><p>Yang KongQun’s eyes flashed with a hint of praise, but it died soon after as he sighed, “This time, we’ve really kicked the hornets’ nest! That fortune teller actually belongs to the ‘Beyond Heavens’ Sect!”</p><br/><p>An expression of confusion surfaced from Yang Zheng as he queried, “Beyond Heaven? What sort of organisation is that?”</p><br/><p>Yang KongQun merely shook his head with a despondent look as he muttered, “I can only say that it is the pinnacle of power that exists in this world! Let’s not talk about this. Prepare a good present for me tomorrow, I’ll need to personally visit the Ling Residence to apologize.”</p><br/><p>At this juncture, the ever stoic face of Yang KongQun broke into a rictus of fear for once! One could see just how much he feared the true identity of Ye QingChen.</p><br/><p>Seeing that Yang KongQun had no intention to continue down that topic, Yang Zheng diverted his attention tactfully, saying, “Family Head, how are we going to deal with the matter of the Royal Consort being pregnant?”</p><br/><p>Yang KongQun stood up to pace, his face transforming into a vicious look as he spat, “Be it a male or female, that child won’t be allowed to see the light of day!”</p><br/><p>Yang Zheng nodded his head solemnly.</p><br/><p>—— On the other side ——</p><br/><p>The inner chambers of the Empress.</p><br/><p>With a kick, a side table was flipped over by Empress Yang Xue. Bearing a malevolent expression, she hissed, “No! I won’t stand for it! No one is allowed to snatch over the position I’ve protected for eighteen years! No matter who she is!” She paused, breathing heavily with bloodshot eyes.</p><br/><p>Her surroundings were in a complete disarray, but there were no palace maids to clear the mess, for she had sent them far away a long time ago. After a few more moments of venting her frustration, the originally opulent and majestic chambers had turned into an ugly spectacle resembling a garbage collection point! Her gaze grew resolute as she cried out, “Men! Hurry and summon Imperial Physician Su to my chambers!”</p><br/><p>The Empress Yang Xue, had finally made her decision!</p><br/><p>At the same time, at the pitch-black skies above the Ling Outer Courtyard, messenger falcons resembled black bolts of lightning, diving back to the courtyard bearing news!</p><br/><p>Ling Liu, Qi, Ba and Jiu looked at the news spread out in front their eyes, all of them bearing the same grave expression. All of them stood up simultaneously and walked out from their own rooms, bumping into each other in the walkway. Only then did they awake from their reveries, and smile, their tension swept away in an instant.</p><br/><p>Ling Qi looked at the other three, and posed a question, “Who is going to be the one to inform Young Noble?”</p><br/><p>The other three went totally mum!</p><br/><p>All of them wanted to go, to present this crucial intelligence report to the young noble. After a moment of silence, the four opened their mouths at the same time to cry out, “I’ll go!”</p><br/><p>All four stared at each other, unwilling to back down!</p><br/><p>“Forget about even going! You just need to pass the news to me, I’ll deliver it to the young noble personally!” A tone that sent chills into one’s very bones sounded out as the shadows warped to form a man completely clothed in black, which had appeared behind the four of them soundlessly.</p><br/><p>“Brother Jian!” The four of them saluted in unison, their faces filled with nothing but respect!</p><br/><p>In their hearts, other than the young noble who was akin to a god, this was the other person who made them both fear and respect him at the same time!</p><br/><p>After hearing the intelligence, Ling Jian eyed the four of them coldly as he remarked, “You guys better stay here properly to guard the place, when I’m back, I’ll give you guys some special training! Seems like all of you have been too relaxed these few days, even your pot bellies are about to show!” Without waiting for an answer, his figure flashed and appeared a few miles away; another flash and his silhouette disappeared.</p><br/><p>Special training! The four of them stood stock still. This was really the case of disaster strikes at the most unexpected of places! The four of them looked their bodies, well built without a hint of excess flabs and they all felt like crying out. It was as though they had all sunk into a nightmare which they could not get out of…</p><br/><p>After countless methods, Ye QingChen finally extricated himself from the barrage of thanks offered by both the elderly Ling couple and escaped into Ling Tian’s little courtyard. The enthusiasm exuded by the old couple seemed to be… overwhelming! This was nothing surprising; Old Madam Ling had mistakenly pinned the credit for Ling Tian’s shrewd mind and talents all to Ye QingChen, literally propelling him to a godhood! This caused countless beads of sweat to form on the latter’s face.</p><br/><p>As to why Grandpa Ling was so warm, it was because of the awe-inspiring fact that Ye QingChen could actually scare away that Old man Yang with merely a sentence! Furthermore, being members of the Great Families, it was no surprise that they possessed news about the pinnacle existences of this world — and that was precisely the existence of the Beyond Heavens Sect!</p><br/>\n</div>"}