{"title": "Chapter 162", "id": 162, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-162", "volume_title": "Volume 2", "body": "<h1>Chapter 162</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 162: Saving YanXue</p><br/><p>Translator: DavidT Editor: celllll , DavidTLing Tian drifted out from the window, his body looking as though it was as light as a feather. At the same time, it seemed as though Xiao YanXue’s weight had no effect on Ling Tian at all. Witnessing the exquisiteness of his movement techniques, everyone was dumbfounded. You have to know; the ShangGuan Family was famous for their movement techniques, on par with the BeiMing Family as the top of the continent. Gu XiYan had always been proud of her movement techniques. But seeing Ling Tian’s movement technique today, she finally understood the meaning of ‘there is always someone higher’.</p><br/><p>However, this did not mean that Ling Tian’s movement technique was better than the inherited technique of the ShangGuan Family. The inherited technique of the ShangGuan Family, the Mythical Fairy Steps, was considered to be the best movement technique in the world today. While Ling Tian’s ‘Nine Heavens Dragon Cruising Steps’ was also the most powerful movement technique in his previous world, it wasn’t necessarily better than the Mythical Fairy Steps. The only reason why the ShangGuan Family would be dumbfounded was because they were unable to bring out the full might of the Mythical Fairy Steps, but Ling Tian had. Together with Ling Tian’s profound and thick Inner Qi, it was only natural for the ShangGuan Family to be shocked!</p><br/><p>After finally successfully shocking an unknown power, Ling Tian’s frustrations had finally been vented. Being in a good mood, even the thunderstorm felt like it was a gentle rain. As compared to finding out about the Smokey Thea Tower and ShangGuan Family, being in the rain for the whole night was something completely insignificant!</p><br/><p>Ling Tian was not worried about the ShangGuan Family disobeying him. In fact, if they even dared to pay lip service to him, catastrophe would definitely befall upon them! First, he knew the secret of the ShangGuan Family hiding in the Sky Bearing City. As long as he spreads this piece of news out, the ShangGuan Family would definitely be wiped out without him taking action at all.</p><br/><p>Second, Ling Tian had already displayed his own strength. To the ShangGuan Family, this was something extremely shocking! It would also make them feel extremely helpless! The present ShangGuan Family was no longer like before and they would definitely not dare to provoke an expert like Ling Tian! This was the main reason why Ling Tian made such a forceful appearance in front of them. Together with the way he killed the three burly man, it was a way for him to demonstrate his prowess! If not for the fact that killing those three old and cowardly elders would cause irreparable damage to Gu XiYan’s organization, Ling Tian would have killed the three of them instead!</p><br/><p>Third, the strength of the ShangGuan Family had already declined to the lowest possible point, and this can be observed from the number of experts they possessed. Although they did a good job of concealing themselves, and even hiding from Ling Tian’s information net, the moment their identities were revealed, all of their efforts over the past few years would go down the drain! Now, the ShangGuan Family was only equivalent to a gang in the pugilistic world. As compared to the Eight Great Families in the continent, they were worlds apart! As for seeking revenge with the Xiao Family and the other great families, that was no more than a dream! However, Ling Tian’s appearance gave them a chance to turn this dream into reality! After all, Ling Tian’s strength was there for them to witness! At the very least, he can be considered a life-saving herb for them!</p><br/><p>As such, regardless of their perspective, their best choice would be to work with Ling Tian! Thus, Ling Tian was certain that they would definitely agree!</p><br/><p>Ling Tian, who was in the sky, revealed a smile. As he turned into a street, he suddenly concealed himself.</p><br/><p>A short while later, a nimble figure landed on the roof without any sound being made, and her movement technique was even better than Gu XiYan’s! In her beautiful eyes, there was a trace of doubt, as though she was surprised as to why Ling Tian disappeared.</p><br/><p>All of a sudden, Ling Tian appeared behind her without a trace. This nimble figure was also a top-notch expert, detecting him immediately. “Pa!” With a crisp ‘pa’ sound, Ling Tian had slapped her butt. With the already tight-fitting clothes being drenched, Ling Tian felt as though this slap of his landed on the lady’s naked skin!</p><br/><p>The young lady let out a lovable gasp and without looking, she dived into Ling Tian’s embrace. At the same time, she stomped her foot in habit, forgetting that she was on the roof of someone’s house. The next instant, the sound of a few tiles breaking could be heard. It was just too embarrassing for an expert of movement techniques to crack the tiles on the roof. The young lady then could not help but be startled as she dived into Ling Tian’s embrace without making another movement.</p><br/><p>Taking off her mask gently, a country toppling beauty appeared before him. Apart from Ling Chen, who else can she be?</p><br/><p>Ling Tian had originally found it to be strange — with Ling Chen standing guard at home, how could those fellows abduct Xiao YanXue so easily. Even if Ling Chen wasn’t willing to kill, they should not have been able to succeed. In the end, it was just this lass going easy on them!</p><br/><p>Perhaps, the three of them were only able to return to the Smokey Thea Tower because of Ling Chen drawing away the guards! However, just what was her motive of doing so?</p><br/><p>Gently patting Ling Chen on the back, Ling Tian did not ask her anything. He only gave a very simple instruction, “Wait for me at home.” While the rain was not as heavy as before, Ling Tian was still afraid that Ling Chen’s body would not be able to take it — especially since it was during that special time of the month. While Ling Tian did not have a girlfriend in his past life, even if he did not eat pork he would know how a pig looks like, he still had common knowledge about the fact that a lady should not catch a cold during that special time of the month. Even if Ling Chen’s martial arts was a head above the rest, she was still a lady; furthermore, she was his own lady.</p><br/><p>After nodding her head twice in Ling Tian’s embrace, Ling Chen lifted her head up and looked at Ling Tian. Then, she stretched her neck and kissed Ling Tian on the cheeks. By the time Ling Tian felt the ecstasy from that warm lips touching his face, Ling Chen had already taken off into the night sky and disappeared in the rain.</p><br/><p>Xiao YanXue only felt as though she had woken up from a long dream, being filled with a sense of incredulity. She only remembered that she was at the guest courtyard of the Ling residence, waiting for Xiao FengYang and her other two elders to return from catching the thief. All of a sudden, she detected a strange fragrance. Then, she saw a few burly men, with masks covering their faces, barge into the room. Before she even had a chance to panic, she had already fainted on the spot and did not know what happened after that.</p><br/><p>When she opened her eyes, she realized that she was in a deserted alley, under a tattered roof. The rain was still dripping down, splashing down onto her body and making her feel a sense of cold. She then thought about how she had been knocked unconscious, and could not help but have a change of expression as fear could be seen in her eyes, “It seems that I have been unconscious for some time already. Furthermore, I was brought to such a place unknowingly. Don’t tell me I…”</p><br/><p>In anxiousness, her face turned white as she instinctively used her hands to check her body. At the same time, she also used her eyes to scan all over her body. Only after a long while did she let out a sigh of relief, “Thank goodness, I am still me. I have not…” Xiao YanXue did not dare to continue down that line of thought. If something like that were to happen to her, she won’t be able to wash of such a humiliation, even if she were to die on the spot!</p><br/><p>“Are you at ease already?” A calm voice sounded from behind her, seeming to carry a tinge of ridicule within it. But in the ears of Xiao YanXue, it had the effect of thunder! Turning her body around swiftly, she used her hands to cover her chest as she realized that she could move her body normally without any restriction on her Inner Qi.</p><br/><p>A slim black dressed man was leaning on the wall, with a pair of calm eyes looking past Xiao YanXue’s body, and looking towards the rain outside instead. Towards such a scene which would move the hearts of many men, he was able to ignore it completely.</p><br/><p>As Xiao YanXue thought about it for a moment, she immediately understood that this person must have saved her. Being a member of the Xiao Family, she immediately regained her cool and said with a respectful bow, “Thank you…” As she said that, she did not know how to continue. Just who should she thank? As she looked at the face covered by the mask, she was only able to determine that the other party was a male. She couldn’t even tell if he was young or old. Just how should she address him?</p><br/><p>As though he was smiling, that black dressed man said indifferently, “There is no need to thank me. I just happened to be there and saved you out of convenience. It is just like a person walking on the streets, if he were to see a puppy or kitten being injured, he would definitely take pity on it and save it. It is only natural for me to do so and there is no need for thanks.”</p><br/><p>While his words were casual, Xiao YanXue was incensed. Dammit! To think that you would compare me, the princess of the Xiao Family, to a little kitten or puppy! Her face could not help but turn green, before turning white, then turning red. In that moment, she was unable to say a thing.</p><br/><p>The black dressed man then turned his head and smiled, “Alright, stop playing those face changing games. I saved you just now, and scolded you now. We no longer owe each other anything, and there is no longer a need for you to place this matter in your heart. We are only strangers passing by each other without a chance to meet again. Take care. The people looking for you are probably about to flip the whole city over already! Haha!”</p><br/><p>From afar, the Ling residence was filled with commotion as voices of people shouting and horses neighing could be heard. The guest of the Ling Family, the little princess of the Xiao Family, was actually abducted on the first night they arrived in the Sky Bearing City, in their very own heavily guarded Ling residence! Duke Ling was enraged as he ordered to find the little princess of the Xiao Family at all costs, even if they had to overturn all the bricks in the Sky Bearing City! The moment the order was given, the whole Sky Bearing City broke out into a huge commotion!</p><br/><p>After the Yang Family searched through the whole Sky Bearing City in the night, the Ling Family, which was also the pillar of the nation, did not want to lose out to them and had their own search of the city! Furthermore, the actions of the Ling and Yang Family were only separated by a few days. In the eyes of many people, this coincidence resulted in many different plausible stories being concocted!</p><br/><p>Is this the omen that something was about to happen?!</p><br/><p>All of a sudden, everyone in the Sky Bearing City felt a sense of danger. Some who thought that they were extremely wise even thought that something was going wrong. They actually packed up all of their belongings, so that they would be able to escape at a moment’s notice.</p><br/><p>However, they cannot be blamed for being so careful either. All along, the Ling and Yang Family were already like a mirror of each other. As long as something happens in the Yang Family, it must have been because of the Ling Family. If something happens in the Ling Family, it must be because of the Yang Family! In the Sky Bearing City, this logic was something which was seen as the truth!</p><br/><p>For these two families to break out into such a huge commotion in just a short few days, everyone could not help but think that both the families were ready to drop all pretense, and break out into war! If that was the case, it would be inevitable for chaos to sweep through the city, and those little businesses and families would definitely be destroyed from the aftermath.</p><br/>\n</div>"}