{"title": "Chapter 178", "id": 178, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-178", "volume_title": "Volume 2", "body": "<h1>Chapter 178</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 178: Ninth Stage Shocking Dragon</p><br/><p>Translator: DavidT Editor: DavidT , RockA wave of pain could be felt from his meridians, as though they were about to be torn apart! Ling Tian suddenly realized that he had forgotten something important! His inner qi trickled into his inner core slowly at the start with the majority of his inner qi flowing into his inner core from the attraction of the whirlpool. The whole process took an extremely long period of time. To suddenly disperse the whirlpool formed by the inner qi, it was like a shocked dragon going into a crazed state, rampaging through all of his meridians! For his originally calm meridians to suffer such a shock, how was it possible for them to not be destroyed? How was it possible for his meridians to not be damaged?</p><br/><p>Ling Tian finally understood why those who attacked the ninth stage in his past life would die from their meridians being ruptured! However, it was already too late!</p><br/><p>At this moment, it was useless to regret! Since he had decided to make such a risky move, he must bear the consequences!</p><br/><p>Since regret was useless, the best thing for him to do was to find a way to survive!</p><br/><p>Ling Tian forcefully bore with the pain in his body; in this instant, Ling Tian felt as though all of his meridians were ruptured as his skin became bloated. His vessels could be seen surfacing on his skin as blood droplets seeped out from his skin! At this moment, only a small amount of his inner qi had been dispersed from his inner core…</p><br/><p>Ling Chen was seated by the door, looking at Ling Tian cultivate with a sweet smile on her face. Looking at the focused look of her beloved man, Ling Chen felt a sense of tranquility and fortune in her heart!</p><br/><p>All of a sudden, Ling Chen’s eyes widened in shock! She saw Ling Tian’s face contort in pain as his skin began to bloat up. Then, blood seeped out from his skin slowly, gradually increasing over time…</p><br/><p>After being nurtured by Ling Tian over the years, Ling Chen was already extremely familiar with Ling Tian’s Divine Shocking Dragon Formula. While she knew that such a situation would happen when Ling Tian tried to break through into the ninth stage, she could not help but be startled in her heart!</p><br/><p>She then suddenly remembered Ling Tian’s instructions, “Cold and heat will stimulate each other and the positive and negative will complement each other. Chen’er, when I attack the ninth stage, I probably can’t do it without you!” Without any hesitation, her body appeared in front of Ling Tian as she placed her palm on Ling Tian’s chest. Exerting some force, a wave of cold inner qi was transmitted!</p><br/><p>Ling Tian cried out bitterly in his heart! The inner qi in my body was already too much to begin with. Of all times to come, you choose to intervene at such a time. I am really suffering from my own deeds! But at that moment, Ling Tian was using all of his energy to suppress the chaotic inner qi rushing at his meridians and could not speak. It was difficult for him to even move his lips!</p><br/><p>The moment Ling Chen’s inner qi entered Ling Tian’s body, it broke up into a few waves and flowed to his meridians along with his own inner qi!</p><br/><p>The pressure his meridians were suffering from was already at its extreme! Cracks could already be seen on his skin as blood oozed out! The meridians on his body were already about to be ruptured!</p><br/><p>Ling Chen’s face was filled with tears as she continued to transmit her inner qi into Ling Tian’s body.</p><br/><p>Suddenly, the chaotic inner qi in Ling Tian’s body seemed to have detected Ling Chen’s ice cold inner qi and began to return to his inner core in a fit of rage!</p><br/><p>It was like ice suddenly being added to a pot of boiling oil. With the addition of something cold, the boiling oil would definitely evaporate this piece of ice before restoring its original boiling state! If Ling Tian’s body was like the boiling oil, the inner qi transmitted by Ling Chen was like the ice cube!</p><br/><p>Upon contact, Ling Chen was exposed to a full force attack of qi from Ling Tian! She let out a groan as her body flew into the air, spitting out a glob of blood in mid-air! Her body then slammed into the wall before she rebounded on to the ground!</p><br/><p>With her last shred of consciousness, she looked at Ling Tian again and realized that while Ling Tian’s face was still red, his skin no longer showed signs of being ruptured. She then felt a sense of ease as she fell unconscious again!</p><br/><p>Ling Tian felt that there was a short gap when all of his inner qi flowed back to his inner core! Although he knew that Ling Chen was seriously injured, Ling Tian couldn’t stop. The moment his inner qi went crazy again, he would no longer have the ability to turn the situation around! Thus, he suppressed the worry he had for Ling Chen.</p><br/><p>He would only be able to save his lover after saving himself. This feeling of love would usually cause an inexplicable strength to burst forth, creating a miracle. The phrase, ‘to survive for love’, was indeed true.</p><br/><p>Ling Tian knew that the only reason why things took a turn for the better was that Ling Chen risked her life for him. This was also his final chance! If he didn’t grasp it, not only would he die, Ling Chen would probably die as well!</p><br/><p>His mind suddenly seemed to have cleared up, as though he had a flash of inspiration. In such a crucial moment, rashness would only cause mistakes. Only by being calm and relying on his wisdom would he be able to grasp the chance of survival.</p><br/><p>At this moment, Ling Tian finally understood why the Ling Family had two martial formulas. Despite having the invincible Divine Shocking Dragon Formula, why did they still have the Divine Ice Formula which only a female could cultivate? Furthermore, why did their ancestor’s teachings specify that the ladies of the Ling Family must cultivate the Divine Ice Formula? So this was the reason!</p><br/><p>Ling Tian then circulated the only trace of inner qi that he could control. Bearing with the pain, he forced the inner qi to flow backward, urging all of his inner qi to gather back in his inner core while repairing his meridians. For his inner qi to regain its smooth flow again and his head to clear up, the joy in his heart was something indescribable by words.</p><br/><p>However, this was only the start. After regaining the control of his inner qi, he forced it to circulate back into his inner core again and finally formed another whirlpool! Ling Tian was surprised to realize that his meridians were actually at least two times wider than before! If his meridians before were streams on a mountain, his meridians were now definitely like a river!</p><br/><p>Controlling the whirlpool of inner qi carefully, his inner core was slowly completely filled up again. Ling Tian then let go of his control suddenly and his inner qi became like a frenzied crazed dragon, breaking through into the eighth stage of the Divine Shocking Dragon Formula! The remaining inner qi then continued to rush into his meridians, making a full circulation in his meridians, stopping at the GuanYuan acupoint before rushing back into his inner core again!</p><br/><p>So it was here! Ling Tian thought to himself as his inner qi began to gather back into his inner core before sending it towards his meridians again!</p><br/><p>Ling Tian finally understood the true purpose of sending his inner qi on a rampage in his meridians! If he did not widen his meridians, his original meridians would definitely not be able to endure the vast amount of spiritual qi when attacking the ninth stage. He would then be in trouble for sure! Thankfully she was there! But, I can’t stop now!</p><br/><p>First time! Second time! … Nineteenth time! Ling tian went all out, attacking the ninth stage time and time again, making his body feel a wave of excruciating pain every time he attacked the ninth stage! At the very end, it seemed as though Ling Tian was already numb to the pain, subconsciously attacking the ninth stage without any other thought…</p><br/><p>Finally! Ling Tian felt a loud bang as his vast inner qi smashed through the ninth stage, like a lost child running back into Ling Tian’s embrace! Not only did Ling Tian not feel any pain, he felt a sense of warmth and excitement!</p><br/><p>After circulating his inner qi, Ling Tian was surprised to realize that he had more than two times the inner qi as before! In just a short while, Ling Tian had circulated his inner qi 36 times and successfully stabilized his foundation!</p><br/><p>Opening his eyes gradually, he felt as though two bolts of electricity were shot out from his eyes. Suddenly, a colorful world was displayed right in front of him! While he was in the dark, Ling Tian could clearly see every corner of the room, even the dust floating in the air. Ling Tian was shocked to realize that even these things had their own colors! The whole world seemed to be filled with life! As he looked out of the window at the swaying bamboos, he could see the different veins of every leaf and hear the earthworm groveling in the earth.</p><br/><p>All of this gave Ling Tian a completely new experience! Even with Ling Tian’s two lifetimes of experience, he couldn’t help but feel his heart palpitate with excitement at this moment!</p><br/><p>So this is the so-called XianTian stage?! The feeling of XianTian?!</p><br/><p>He suddenly thought about Ling Chen and looked over at her quickly, only to see that she was already awake. You have to understand that Ling Chen had received the personal tutelage of Ling Tian and her cultivation was a notch higher than Ling Jian’s. While that impact was something unexpected and caused internal injuries, it wasn’t enough to take her life. However, this lass actually fainted from anxiousness.</p><br/><p>She stood up forcefully, with her back leaning against the wall and tears rolling down her cheek. However, a bright smile could be seen on her face, looking at Ling Tian with a sense of satisfaction and joy! Ling Tian felt a sense of warmth in his heart as he grabbed her into his embrace. After a long while, he said, “My Chen’er, what a foolish lass!”</p><br/><p>Ling Chen was no longer able to hold back from the shock as her tears formed rivers on her face. At this moment, she could finally feel that the most beloved person in her life did not leave her! She could not help but shed tears of joy! Thinking about the desperation she previously felt, she could not help but cry even harder! At this moment, she really felt a sense of fear from before!</p><br/>\n</div>"}