{"title": "Chapter 193", "id": 193, "volume": 2, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-193", "volume_title": "Volume 2", "body": "<h1>Chapter 193</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 193: Heart Knot Untied</p><br/><p>Translator: DavidT Editor: DavidT , RockThe people who Ling Tian mentioned were indeed the number one or two characters in the various great families. However, one’s martial arts prowess obviously can’t be estimated in such a manner. But, how could Yu ManTian expect a weakling scholar like Ling Tian who didn’t understand anything about martial arts to comprehend that?!</p><br/><p>Looking up at Yu ManTian’s darkening expression, the weak scholar decided to add more fuel to the fire. He then approached Yu ManTian and said with concern, “Third Master, although you seem to be extremely skilled in martial arts, all of these people are undisputable experts! Besides, you are alone, and I haven’t really heard about others talking about your martial arts… this… I think it is best for you to be careful! If anything were to happen to you, how would I be able to answer to BingYan?”</p><br/><p>Third Master Yu’s face was already ashen with veins bulging out from his forehead. His teeth were also tightly clenched as his eyes widened like saucers, with the veins in his eyes clearly seen. A malevolent and frightening expression slowly formed on his face.</p><br/><p>As though he did not see that, Ling Tian paused for a moment and seemed to be in thought. Then, he clapped his hands suddenly and said, “How about this, why don’t you stay at my Ling residence? Just as the saying goes, ‘a strong dragon wouldn’t win against the local snake’, they won’t be able to find trouble in my Ling residence no matter how strong they are! If that’s the case, Third Master’s safety will be assured and your Yu Family can avoid conflict with all the other families. This is really a wonderful plan! Hahaha, what does Third Master think? If you are still worried, I can ask my father to send some troops to guard you!”</p><br/><p>As though he had solved a tough problem, Ling Tian let out a long breath and drank a mouthful of his wine. Then, he looked towards Yu ManTian with a smile, as though he had just done the Yu Family a huge favor and was waiting for Yu ManTian to be extremely thankful towards him!</p><br/><p>“Pa!” The white jade wine glass was crushed to smithereens by Yu ManTian! Yu ManTian then let out a roar, “Those from the XiMen, NanGong and DongFang families are no more than dancing clowns! They have gone too far! How can this Third Master endure that!” Yu ManTian never thought about the fact that the three of them had never even seen him before, so just how could they have gone too far?</p><br/><p>“Third Master, you must remain calm, lest others hear you. Endure a moment for peace, take a step back and all will be fine.” Ling Tian then hypocritically tried to persuade Yu ManTian. Slapping his chest, he said with a majestic and reliable aura, “Rest assured Third Master, as long as my Ling Family is present, no one will dare to touch you! Come-come-come, let us drink! I will go and find my father later!”</p><br/><p>The instigator will never be afraid of things blowing up too big!</p><br/><p>Drink wine? Even if the celestial wine of the Queen Mother of the West was in front of him right now, Third Master Yu would probably not be in the mood to even take a sip of it! Standing up abruptly, the tables around him began to fly away with a loud bang. Following which, a ‘putong’ sound could be heard and a large hole could be seen in the rack of grapes as it was sent flying by Third Master Yu! Ling Tian couldn’t help but feel his heart ache! My poor rack of grapes! This young noble’s rack of grapes has fallen!</p><br/><p>Like an angry lion, the hair on Third Master Yu’s body stood up. Swinging his sleeves to the side, he strode out with simmering anger!</p><br/><p>Ling Tian then sprinted after him, hugging his waist and trying to dissuade him. However, Yu ManTian ignored Ling Tian’s words and continued to walk forward, dragging Ling Tian along the way. Ling Tian’s pink soles left a clear mark along his little courtyard.</p><br/><p>Third Master Yu’s loud roar had already startled everyone awake. Yu BingYan, Wei XuanXuan, Ling Chen and the Xue brothers had all ran out, only to see Ling Tian clinging onto Yu ManTian and being dragged around like a koala bear.</p><br/><p>“Third Uncle! What are you doing? Don’t be rash and put brother Ling down!” Yu BingYan anxiously shouted. Xue Leng and Xue Fei also blocked Yu ManTian’s way and said, “Third Master, calm down!”</p><br/><p>“Calm down your head!” Yu ManTian said with agitation, “Scram!”</p><br/><p>Ling Tian then let go of Yu ManTian, because Yu BingYan was already in front of Yu ManTian. However, the angry Yu ManTian unleashed his not-so-good movement technique and disappeared with a ‘swoosh’. Xue Leng and Xue Fei did not dare delay as they chased after him.</p><br/><p>Everyone then looked at Ling Tian with a questioning look, obviously waiting for an explanation.</p><br/><p>“I also didn’t think that things would turn out like that,” Ling Tian said with feigned grievance, “Just now, I told Third Master that the men from all the various great families were here. Then, Third Master Yu said that he wanted to exchange pointers with all of them. This has nothing to do with me!”</p><br/><p>Yu BingYan then rolled her eyes in both anger and laughter, “It’ll be a miracle if it has nothing to do with you! You actually dare to use my Third Uncle as a spear; see how he will take care of you when I explain it to him.”</p><br/><p>Ling Tian was taken aback for a moment and then he said to Yu BingYan, “Lass, I didn’t think that you would see through this. You’re pretty sharp!” He originally thought that his actions would easily be covered up. However, he never imagined that this usually unfocused-looking lass was actually acting like a pig to eat the tiger!</p><br/><p>Yu BingYan responded with a ‘hmph’ and then let out a long sigh. Looking towards Ling Tian, her eyes were filled with bitterness and a hazy curtain of water could be seen in her eyes.</p><br/><p>Looking at Ling Tian, she began to grumble in a low voice, “Tian’ge, actually, you don’t have to hide these things from me. While I am from the Yu Family, I am also a woman! A woman will never let any harm fall on her beloved man!”</p><br/><p>“Ever since I entered the Sky Bearing City, you approached me on purpose and have always been using me and lying to me! Tian’ge, did you really think that I didn’t know? But I… I was more than willing to be used and lied to! Do you know why? Do you know why?! It’s because I love you! I really love you!”</p><br/><p>Yu BingYan’s voice grew louder and louder, with her almost shouting at the end. The deepest thoughts in her heart were said right in front of Ling Chen and Wei XuanXuan! It could be seen just how agitated she was!</p><br/><p>After finishing what she had to say, Yu BingYan suddenly felt a wave of grief and bitterness filling her heart. To think that Ling Tian would still hide things from her, and still put up an act in front of her. Just how high was his guard against her? Thinking about that, Yu BingYan couldn’t help but feel grief from the bottom of her heart, as her tears flowed out uncontrollably, running into her room with her hands covering her face.</p><br/><p>Ling Tian was immediately dumbfounded and knew that this matter had indeed hurt her greatly. Now that she had finally broken down in front of him, a wave of guilt filled his heart. Was I too scheming? Was I really wrong?!</p><br/><p>If Yu BingYan hadn’t let out her thoughts today, would I have realized my mistake? If there wasn’t a single shred of feelings between the both of us, would my actions still be considered a mistake? Ling Tian questioned himself in his heart!</p><br/><p>No! I am not wrong! The mistake is that I was born into the Ling Family and I am not willing to be an ordinary person! But you are from the Yu Family. I have my ambitions and I have my goals. At the same time, your Yu Family has their own plans. The conflict between your Yu Family and me is only a matter of time! My final goal would definitely shake the Yu Family’s status, so the Yu Family would definitely try hard to prevent me from succeeding! The face-off between both our families is only to be expected!</p><br/><p>BingYan, it is because I am called Ling Tian, and you have the surname of Yu! So, it’s been tough on you!</p><br/><p>I am sorry!</p><br/><p>Yu BingYan then lay down on the couch with her shoulders trembling as she bawled sorrowfully. Thinking about her short-lived life and heavy responsibilities, her heart ached even more and more. Why do I have to be from the Yu Family?! Why do I have to suffer from such a terminal illness?! Do the heavens really have to be so stingy towards me?!</p><br/><p>Suddenly, she felt a warm palm on her shoulder. Raising her head up, Yu BingYan saw Ling Tian looking at her with a trace of bitterness and concern in his eyes.</p><br/><p>With anger in her heart, she wanted to give Ling Tian a tight slap. However, she just couldn’t bear to do so. Thus, she let out a grunt and struggled slightly with her body, wanting to be free from his touch.</p><br/><p>With a sigh, Ling Tian ignored her struggles and grabbed her into his embrace, “Yan’er, that’s right. I am lying to you. With your wisdom, can you really not understand why?”</p><br/><p>Ling Tian’s voice became solemn, “Don’t you know? The words you said today opened up a lock in my heart! While it made me feel pain, it also made me feel at ease.”</p><br/><p>Yu BingYan whimpered softly for a moment before finally stopping and looking up. She was not a foolish lady either and was already aware of Ling Tian’s predicament. However, being aware of it was one thing but accepting it was another! What lady would be able to accept being lied to by her beloved one? Her actions today were only because of all of her pent-up emotions.</p><br/><p>Diving into Ling Tian’s embrace, she did not say a single thing as her tears flowed down her face silently. In just a short while, Ling Tian’s shirt was completely drenched but her agitated emotions slowly calmed down.</p><br/><p>Ling Tian let out a chuckle and Yu BingYan, who was still in Ling Tian’s embrace, could feel the movements of Ling Tian’s chest, “Yan’er, it is a good thing that we have opened up towards each other. However, there is something that I have to tell you in advance.”</p><br/><p>Hearing Ling Tian’s solemn tone, Yu BingYan raised her head up and looked towards Ling Tian with her eyes filled with tears and doubt.</p><br/><p>Hugging her tightly, he said, “Yan’er, even though we opened up towards each other today, I will still have to lie to you in future. Do you understand what I mean?”</p><br/><p>A long while later, Yu BingYan’s gentle voice could be heard, “I understand, I shouldn’t know too much about certain things. Be it the matters of the Yu Family or your matters, I will only be placed in more misery if I know about them but am unable to do anything about it. If that’s the case, I’d rather stay in the dark.”</p><br/><p>Ling Tian let out a sigh, “It’s been hard on you. Yan’er, I know that it isn’t easy for you to make such a decision! Haiz, I am also someone from a Great Family!” The more she knew, the greater her burdens would be! With Yu BingYan’s status, it wasn’t an easy matter for her to treat Ling Tian as such!</p><br/><p>Yu BingYan then burst out into tears again… In order to gain something, she would have to lose something! To gain Ling Tian’s love, she would have to give up the benefits of being in her family. Such a choice was far too difficult for someone from a Great Family!</p><br/><p>Ling Tian didn’t explain too much, and Yu BingYan didn’t ask too much. In truth, the both of them were clear about it in their heart. However, this was the first time for them to be so open with each other.</p><br/><p>After this matter, both of them felt much more at ease!</p><br/>\n</div>"}