{"title": "Chapter 209", "id": 209, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-209", "volume_title": "Volume 3", "body": "<h1>Chapter 209</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 209: Killing in Broad Daylight</p><br/><p>Translator: chuchutrain Editor: DavidT , RockLing Tian couldn’t help but admire his grandmother. The moment the situation had turned for the worse, she immediately made the decision to have Princess Jiao Yue summon him! This choice was brilliant! It was clear that once Ling Ran was in danger, it definitely had to be someone from the palace or a paid assassin. Thus, the moment there was a bit of delay, there would definitely be huge repercussions!</p><br/><p>A slight holdup could be all that was needed to reap two lives: Ling Ran and her unborn child.</p><br/><p>Ling Tian, not being a member of the imperial palace and furthermore a man, would have to go through a set of rigorous procedures just to gain entry into the Royal Consort’s chambers. If that was the case, then delays would be impossible to avoid.</p><br/><p>But with the presence of Princess Jiao Yue herself, it solved every single problem! With her status as the blood daughter of the Emperor himself, who would dare to question her? Besides, if anyone dared to stop them, then that person would be in league with Empress Yang Xue!</p><br/><p>Two hale and healthy horses had already been saddled and brought to the entrance of the Ling Residence, with Wang Tong standing there holding onto the reins. In a flash, Ling Tian had leaped onto one of them while carrying the Princess and appearing on the other horse like an apparition was Ling Chen!</p><br/><p>“Jia!” Jerking the reins, and shouting the command, the two horses immediately shot forth like lightning bolts. Their objective: The Imperial Palace!</p><br/><p>Being carried in Ling Tian’s embrace, Princess Jiao Yue felt so embarrassed that she couldn’t sit still. At first, she didn’t understand why Old Madam Ling hadn’t called for the imperial doctor instead of asking her to fetch Ling Tian, but she still obeyed as quickly as she could.</p><br/><p>On the short journey to the Ling residence, she was contemplating whether it was because her imperial mother was going to die so her maternal grandmother had asked her to bring her cousin so that her mother could take one last look at him. After all, Ling Ran doted on Ling Tian the most!</p><br/><p>In this short time, Princess Jiao Yue found that she actually couldn’t recognize her cousin! The powerful shout from him and ghostly movements had already shocked the princess out of her skin! Right now, looking at his resolute face as well as eagle-sharp eyes, full of an unknown temperament, Princess Jiao Yue felt her young maiden heart beat faster! Was this the true identity of her cousin?</p><br/><p>Sensing an indistinct manly aura emanating from her cousin, Princess Jiao Yue only felt her ears turn hot, and burrowed her head into Ling Tian’s chest. Feeling the serenity and quiet around her, she felt all her worries turn to nothing! It was as though while she was within this strong and warm embrace, she wouldn’t be affected no matter what rains or storms came!</p><br/><p>The horses quickly sped through the city!</p><br/><p>A hint of bloodlust shot through Ling Tian’s eyes! Yang KongQun, Yang Xue! If anything untoward happens to my aunt, I’ll slaughter your entire house tonight! Even the animals will not be spared! Even if you are the crown prince, I, Ling Tian, want you to feel the pain of a thousand cuts, to die an ignoble death!</p><br/><p>Victory Street! This was the most bustling street in the whole Sky Bearing Empire. That was because a magnificent structure lay at the end of Victory Street, the seat of the Sky Bearing Empire’s power, the Imperial Palace!</p><br/><p>On this street, a young noble dressed in brocade and finery had brought a few of his guards to leisurely browse the area, every now and then stopping to crudely stare at the figure of any ladies that walked past him.</p><br/><p>From afar, the indistinct sounds of galloping horses sounded. The crowded leisurely turned to look, then immediately dashed to the sides to open a pathway! The masses walking about the streets looked akin to the foam generated by a huge ship plowing through water, immediately separating to the sides! This sort of response was second nature to them, as Ling Tian would speed through this area on his horse three to five times a month.</p><br/><p>There weren’t many in Sky Bearing who didn’t know the young master seated on the horse!</p><br/><p>As the horses neared, the faces of those on horseback could also be seen clearly. The lecherous face of the pampered youth suddenly froze in shock, and his mouth opened wide with a trail of saliva dripping out.</p><br/><p>The otherworldly beauty Ling Chen, dressed completely in white, had caught this lecher’s complete attention! Especially with that ice-cold face of hers, it was the ultimate dream of every silkpants to conquer this sort of woman!</p><br/><p>All the Sky Bearing silkpants were familiar with this heavenly beauty, but no one had dared to have impure thoughts about her for a long time. Those who had such thoughts only had one ending — Death!</p><br/><p>It was obvious that this idiot wasn’t from Sky Bearing as he stood there and salivated. Suddenly, he gulped and commanded, “Men! Take that white-robed female down! Storming through the crowded market on a horse, what if someone gets injured? This is the royal capital of Sky Bearing, why doesn’t she have any sense of propriety?!”</p><br/><p>The guards behind him let out cries of assent. They already knew what the young noble wanted, and immediately barricaded the road that had been cleared for the trio! They were obviously experienced in handling this sort of request from the young noble.</p><br/><p>However, it was a pity that this was probably their last time doing such a thing!</p><br/><p>They didn’t realize that almost the entire street was looking at them as though they were idiots!</p><br/><p>A good show was coming!</p><br/><p>Barricading Young Noble Ling Tian in the Sky Bearing capital? This was something that hadn’t been seen for the past few years, almost half a decade even! What mountain did this country bumpkin crawl out from? To have such nerve! He must have a death wish!</p><br/><p>Ling Tian merely hollered, “Scram!” before further urging his horse forward! His heart was already burning with anxiety, so how would he have the mood to argue with this b*st*rd that came from nowhere?</p><br/><p>“Drag that kid down for me! Damn it! How dare you be rampant in front of this young noble!” the richly dressed youth haughtily commanded. As the horses approached, he realized that in the kid’s embrace was actually another heaven-toppling beauty, and this caused him to be unable to bear it! He had never even had a chance to touch these sorts of beauties in his life, and to think that this kid actually had two with him! Was there still fairness in the heavens?</p><br/><p>As the youth’s heart blazed with anger, his gaze towards Ling Tian became all the more unfriendly!</p><br/><p>The guards snickered in response, folding their arms and laughing as they stood in the center and waited for Ling Tian to rush over. They seemed to completely disregard the momentum of the charging horses, a show of their martial arts background. They had to have some sort of background to be so arrogant and despotic!</p><br/><p>In the blink of an eye, Ling Tian’s horse had already rushed up to them. He pulled the reins and the horse let out a loud neigh. Ling Tian didn’t have the time to bicker with them and instead prepared to jump over their heads, giving them a chance to live.</p><br/><p>However, the ideal scenario didn’t come to pass. As they say, nature’s disasters can be avoided, but one’s own mistakes can only be borne by themselves.</p><br/><p>“Kid, get down!” One of the guards laughed maliciously as he leaped up to grab Ling Tian. Another guard actually took out a copper baton, and swiped it towards the hind legs of the horse!</p><br/><p>On the other side, the rich youth had already blocked the path of Ling Chen, saying, “Hahaha, beauty, you must be tired after all that running, come down to rest a bit!”</p><br/><p>Ling Tian was angry!</p><br/><p>Furious!!</p><br/><p>Incensed!!!</p><br/><p>Since you guys want to die so badly, then don’t blame this young noble for being ruthless!</p><br/><p>Glancing at them, he immediately knew that these people were not from Sky Bearing, because other than the Yang silkpants brothers, no one dared to be so unbridled in front of him! This person had to be of an aristocratic family from another place.</p><br/><p>However, Ling Tian was completely uninterested in their identity. He had no idea of his aunt’s situation, and every second late meant that the danger increased by a notch!</p><br/><p>No matter what family you’re from or what identity you have, since you dared to block Ling Tian’s way today you must have an appointment with King Yama and cannot wait to answer the roll call, right?</p><br/><p>Since that’s the case, this young noble will send you on your way!</p><br/><p>A quick pull of the reins and the horse abruptly stopped, rearing up on its hind legs, causing the baton aimed at it to completely miss! The man leaping up to grab Ling Tian suddenly saw a blur and found out that Ling Tian had disappeared.</p><br/><p>After taking Princess Jiao Yue a safe distance away from the four men and gently placing her on the ground, Ling Tian turned to face them with a cold murderous glare in his eyes! He suddenly vanished again as though he was a specter, reappearing beside the four men! It was as if he had covered the distance of forty feet between them with a single step!</p><br/><p>The four men’s smile froze on their faces as they realized that they had met a dangerous person! Just as they thought to attempt to negotiate, they saw Ling Tian’s right hand lift up and chop down towards their heads!</p><br/><p>In that moment, all four of them had a similar sensation, that the chop was directed towards them! The four of them simultaneously raised up their arms to block.</p><br/><p>With a “Peng!” sound, Ling Tian’s palm crushed through one of the guard’s palms as though it was merely paper, continuing on towards his head! At this moment, it looked like a bodybuilder wielding a heavy hammer and smashing it towards a watermelon! With a light ‘pop’ sound, the guard’s skull burst apart with its contents flying out in all four directions! The headless body then slowly toppled over.</p><br/>\n</div>"}