{"title": "Chapter 207", "id": 207, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-207", "volume_title": "Volume 3", "body": "<h1>Chapter 207</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 207: Revealing his Strength</p><br/><p>Translator: chuchutrain Editor: DavidT , RockNanGong Yu opened her eyes wide in astonishment. Demon! That was the only word that flashed through her mind. She was thoroughly shocked at how Ling Tian had managed to discover so many secrets. At this point, she realized that the rumored number one silkpants Ling Tian might not be as simple as he seemed! NanGong TianLong together with the scions entering Sky Bearing was supposed to be a hidden affair, yet Ling Tian seemed to have obtained this information a long time ago.</p><br/><p>“Young Noble Ling, don’t go too far!” NanGong WuMing remarked coldly, staring at Ling Tian with unmasked killing intent. Ever since Ling Tian entered the hall, he had ignored him, as though he was worthless, and this was something the arrogant NanGong WuMing found unacceptable!</p><br/><p>However, Ling Tian continued to ignore him, instead addressing NanGong Yu with a weird smile on his face, “Actually, just based on your family’s standing in Sky Bearing, this young noble is still rather unwilling to ally with you! Especially with this sort of person here, why would your father even consider sending him over? Does he secretly hope for these negotiations to fail?” Ling Tian stretched out a hand, pointing at NanGong WuMing, prodding the air a few times as he continued, “I really can’t fathom what use he has, maybe to show the family’s prestige? Hahaha.”</p><br/><p>NanGong WuMing let out a howl of rage, as he was already at his limit! His original pale face flushed unnaturally red as he pulled out his sword in a swift motion! “What arrogance! Turn around and let this young master teach you a good lesson! I’ll let you know that there is always someone better than you!”</p><br/><p>NanGong WuMing had always regarded himself as a genius. As a talent of his family, he was used to getting whatever he wanted, so how could he endure this sort of humiliation? Under such circumstances, the blood rushed to his head, and he didn’t think of the consequences.</p><br/><p>NanGong Yu was aware that this was not the time to offend Ling Tian, but before she could open her mouth, Ling Tian had already put on a mocking smile as he jeered, “Look at this! Miss NanGong, he is that sort of worthless fool. Even if I were to curse his eight generations of ancestors, he still wouldn’t dare to do anything to me!”</p><br/><p>NanGong WuMing finally had enough. Throwing his sword to the side and brandishing his fists he rushed forward. Despite his anger, he knew that their family would not be spared the moment he killed Ling Tian, even if by accident. Because of that he finally decided to discard his sword.</p><br/><p>A pity that he was horribly wrong. The self-assurance he had made him pay a huge price in return, almost that of his life!</p><br/><p>“Haha, even a rice grain sized pearl can reveal some brilliance!” Ling Tian chuckled. His body suddenly floated up strangely, and while keeping his gaze on NanGong Yu, he thrust his two hands behind him!</p><br/><p>Both their fists hit head-on without any deviation! Because Ling Tian had deliberately stored energy in his fists, when they connected, NanGong WuMing’s fists instantly shattered! However, before any sound could come out from NanGong WuMing, a foot had already connected with his abdomen, propelling him back and upwards, with a gout of blood rushing up in his throat.</p><br/><p>Ling Tian hadn’t even turned his body, still facing NanGong Yu with that same elegant smile while his body flew backward. His fists then accurately hit the chest of the descending NanGong WuMing.</p><br/><p>The latter’s descending body once again flew up like a rag doll, slamming harshly into the ceiling of the great hall before crashing down! Ling Tian already had a leg lifted up, and the moment NanGong WuMing dropped below him, that foot viciously stepped on his face and ruthlessly pinned it to the ground! The beautiful tiles were totally smashed apart, with half of NanGong WuMing’s face buried in the floor!</p><br/><p>All this happened in the time it took to light up a lamp! Up to now, NanGong WuMing hadn’t even had the chance to scream out. Even the blood that had rushed up in his throat hadn’t been spat out!</p><br/><p>While maintaining his posture of stepping on NanGong WuMing’s face, Ling Tian smoothed his shirt and dusted his hands, giving an amiable smile to NanGong Yu as he spoke, “Miss NanGong, now we finally have some peace and quiet, haha.”</p><br/><p>Showing the family’s prestige? Yes, that is exactly what Ling Tian just did!</p><br/><p>If he hadn’t shown off his strength to completely intimidate the NanGong Family, why would they obediently hand over the list for the spies they had planted in the Ling Family? Now he was letting NanGong TianLong weigh the benefits; what were more important, the lives of the slaves or the lives of the scions of NanGong, including him, who were currently living in Sky Bearing? If he didn’t make a choice, Ling Tian would burn both the jade and common stone!</p><br/><p>When it is time to endure, one should of course hide, but when it was time to reveal himself, Ling Tian didn’t fear anyone!</p><br/><p>Now that Ling Tian had a rough grasp on the abilities of the eight great families, he saw no need to continue hiding. Especially since this concerned the internal affairs of the Ling family, Ling Tian would rather expose himself than let them continue to hide within!</p><br/><p>Ling Tian knew that the NanGong had already plotted against the Lings for a long time, but both his open and hidden searches had only yielded a small number of results. From the last time Ling Jian tortured some spies, he knew that while all the spies knew there were accomplices around, they were not aware of each other’s identity. This went to show how deeply all of them had hidden! To leave this group of people here as well as the Ling Kong father and son pair was akin to letting cancer grow unchecked! He needed to, and had no choice but to exterminate them!</p><br/><p>Now that the situation was getting clearer with every passing day, Ling Tian was already mentally prepared to take drastic actions to remove the cancer! His laying low in the past was mainly because he didn’t want to hit the grass to warn the snake 1 , but now that the snake was already in his grasp, how could he let it go? The moment a servant had reported the arrival of NanGong Yu, he had already sentenced the Ling Kong father and son pair to death! Thus, Ling Tian had purposely angered NanGong WuMing, and then using the most ruthless methods possible left him crippled on the ground! Hahaha, just use the top expert of the younger NanGong generation to exert influence!</p><br/><p>The tides and seasons change, and a new era of chaos was about to come. Ling Tian simply had no more patience to continue playing with them. The moment Ling Tian chose to show himself, he couldn’t afford to have any kind of hidden enemies behind his back! Even if it was a baseless suspicion, he would rather get rid of them than be sorry!</p><br/><p>Furthermore, the NanGong Family needed the Ling Family at this moment to go against the Yang Family. Thus, even if Ling Tian were to showcase his true strength, why would they want to reveal it? They probably couldn’t wait to hide it to use as a trump card, rather than broadcasting it out!</p><br/><p>If they wanted to spread the word, that would also have to wait until the NanGong Family left Sky Bearing. However, that would be a different matter by then! Ling Tian himself hadn’t even decided whether he would allow the NanGong Family the chance to leave Sky Bearing alive!</p><br/><p>Looking at the gently smiling face of Ling Tian, NanGong Yu suddenly felt that she was looking at a devil! Her eyes reflected an expression as though she had seen a ghost, trembling while pointing her finger at Ling Tian, but unable to even say a word.</p><br/><p>As the eldest daughter of the NanGong Family, she was definitely aware of NanGong WuMing’s strength! He could even match twenty blows from the strongest in their family, NanGong TianHu! However, in front of Ling Tian, he seemed to be like paper mache, thrown around without any ability to retaliate!</p><br/><p>We NanGongs pride themselves on our Sword God Manual, but WuMing just now didn’t even use a sword. WuMing had also underestimated his opponent… In that instant, NanGong Yu thought up various reasons to explain his defeat to Ling Tian, but she couldn’t bring herself to say any of them.</p><br/><p>Those who were aware could see one glance that between Ling Tian and NanGong WuMing there existed a divide as wide as heaven and earth! Whether or not WuMing had used the Sword God Manual, or if he had underestimated his opponent, none of that mattered. The result would still have been the same!</p><br/><p>Was this still the good-for-nothing silkpants?</p><br/><p>Was this the number one playboy of Sky Bearing?!</p><br/><p>Was this still the licentious young master?!</p><br/><p>In that instant, NanGong Yu only felt her brain melt into a mess, completely incapable of any coherent thoughts!</p><br/><p>Before Ling Tian had exchanged blows with NanGong WuMing, the four NanGong guards had expressions of fury, their hands pressed on their swords and ready to rush in. However, at some point, they had already returned to their old positions with deathly pale faces. All of them had trembling hands, and their attitudes were incomparably respectful. This was the fear induced by a top-notch expert!</p><br/><p>When Ling Tian’s gaze swept past them, four men and eight legs started shaking uncontrollably.</p><br/>\n</div>"}