{"title": "Chapter 206", "id": 206, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-206", "volume_title": "Volume 3", "body": "<h1>Chapter 206</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 206: Revealing Trump Card</p><br/><p>Translator: DavidT Editor: DavidT , RockNanGong Yu’s face immediately turned blue as she thought, Who said that this darn Ling Tian was an uneducated rogue? With just a simple few sentences, he made me completely speechless. Everyone knows that my NanGong Family and the Yang Family are opposing each other despite us being in-laws on the surface. My deceased brother is the son-in-law of the Yang Family. For me to openly say that the hatred between the Yang and NanGong Family is irreconcilable, wouldn’t that create rumors?!</p><br/><p>Thinking for a long while, NanGong Yu continued to remain silent. She was certain that Ling Tian wasn’t the silkpants in the local legends. Instead, he was a powerful opponent. After a long while, she then decided to go in a different direction and gave a bow, “It is difficult to fool a wise man. I never imagined that the number one silkpants of the Sky Bearing Empire was a wise man! The people of the world are just too foolish! You have really opened this little sister’s eyes today.”</p><br/><p>Ling Tian then looked around, “Wise man? Where’s the wise man? Who’s the wise man?”</p><br/><p>NanGong Yu smiled, “Young Noble Ling’s tail can already be seen. Why do you have to continue acting as such? Now is the time where united we both stand to gain and divided we will suffer losses. With young noble’s exceptional wisdom, how can you be ignorant about that?”</p><br/><p>“Oh? I would like to hear about what Miss NanGong is implying. What will we stand to gain by being united and how will we suffer losses by being divided? By forming an alliance with your NanGong Family, what will we gain? On the other hand, what will we lose by not forming this alliance?” Ling Tian pretended to be slightly convinced, leaving NanGong Yu a chance to continue with what she had to say. At the same time, he sneered in his heart, The Yang Family forming an alliance with the Yu Family? Aren’t you daydreaming? That is no more than Yang KongQun, that old fogey, playing tricks on you. Only your NanGong Family would be fooled by those little tricks.</p><br/><p>“Young noble is a wise man. The Yang Family has the ambitions of wild wolves, resorting to all means necessary to deal with both our families. I believe that our NanGong Family isn’t the only one at odds with them. Your Ling Family will definitely have to face them sooner or later. Why give that old thief the chance to deal with us separately? Why not form an alliance to fight him together? As long as we can wipe out the Yang Family, young noble will have no opponents in Sky Bearing. Wouldn’t that be great? As for my NanGong Family, we would be able to take revenge for my older brother, venting our pent-up anger! Isn’t this profiting by being united and losing by being divided? At the end of it all, we both stand to win from this alliance!” NanGong Yu bent her body forward slightly and said softly.</p><br/><p>After realizing that Ling Tian wasn’t the silkpants she thought he was, NanGong Yu found herself in a poor position from her previous miscalculation. It was common knowledge that the party that requested an alliance would definitely be on the losing end, and the other party would definitely have the advantage, having the right to state their conditions. This was as good as giving the other party whatever they wanted on a silver platter! In the present situation, Ling Tian was able to wait but the NanGong Family couldn’t. Their destruction might well be around the next corner! Thus, even if they had to make concessions to the Ling Family, they didn’t have a choice at all!</p><br/><p>Ling Tian then sat up straight and glanced at the gifts NanGong Yu brought over. With a smile, he seemed to have agreed with what NanGong Yu said as he replied, “While what you say is true, the NanGong Family seems to be lacking in sincerity.”</p><br/><p>As NanGong Yu saw that Ling Tian sit up straight, she thought that her words had moved him and felt elated in her heart. However, she never expected Ling Tian to say something like that immediately, and was completely puzzled. She then realized that Ling Tian was probably trying to exploit their NanGong Family through this alliance. She then thought to herself, While this fellow has some brains, he is still lacking. While I cannot underestimate him, he isn’t one I need to fear. She then let out a bright smile, and said seductively, “I wonder what young noble means by that?”</p><br/><p>Seeing how NanGong Yu was trying to seduce him, Ling Tian was elated. What a pity, just a Ling Chen beside me is already miles above you. Your looks are probably only good enough to deal with people like Yang Wei. They are far from enough to deal with me. With a sneer, he walked forward with his hands behind his back and said, “Two days ago, the Yang Family was facing both internal and external troubles. But two short days later, the situation took a drastic turn and the NanGong Family is now the one in deep trouble! Miss NanGong, don’t try to scare me with your words. The Yang Family dealing with my Ling Family is no more than nonsense! I believe Miss NanGong knows the reasons without me spelling them out. Even if Yang KongQun was a thousand times braver than he is now, he wouldn’t dare to touch my Ling Family! I wonder what Miss NanGong thinks about that?”</p><br/><p>NanGong Yu was stunned as she looked at Ling Tian. At the same time, she was at a loss in her heart, What a powerful Ling Tian! What a sharp tongue! Indeed, NanGong Yu was extremely clear that with a trump card like Beyond Heaven even the publicly acknowledged number one family, the Yu Family, wouldn’t dare to make any rash moves, not to mention the Yang Family!</p><br/><p>“To put it nicely, the NanGong Family is looking to form an alliance today with my Ling Family. To put it bluntly,” Ling Tian chuckled, “your NanGong Family is here to seek help or even protection! Hehe… since you are here to seek help, then… Miss NanGong, this little bit of sincerity, ah ah ah, do you think it is sufficient?” Ling Tian pointed to the gifts NanGong Yu brought with his chin and let out a wild laugh.</p><br/><p>NanGong Yu’s face turned red before turning pale. She never imagined that the idiot in her eyes was actually so wise! She couldn’t help but be frustrated from rage, angered by how she had belittled Ling Tian in her heart! At the same time, she couldn’t help but feel a sense of desolation. To think that the majestic NanGong Family would actually be forced into such dire circumstances! To think that they suffered so much from a single wrong move!</p><br/><p>Before she opened her mouth again, Ling Tian suddenly changed his attitude, “However, this young noble is rather interested in joining hands to deal with the Yang Family. The question is, will your NanGong Family be able to accept my conditions. Hehehe…”</p><br/><p>As NanGong Yu heard that there was hope, despite the fact that Ling Tian obviously wanted to extort their NanGong Family, their NanGong Family had no choice but be extorted willingly! In fact, they had to be extorted while faking a face full of smiles! NanGong Yu could only wish that Ling Tian wouldn’t mention any conditions that their NanGong Family wouldn’t be able to accept. Thinking about that, NanGong Yu could only swallow her anger and ask, “I wonder what young noble Ling wants? As long as our NanGong Family can accomplish it, anything can be discussed.”</p><br/><p>“Can be discussed?” Ling Tian snorted, “Your NanGong Family colluded with Ling Kong and had designs on our northeast horse ranch. You guys even planted many spies in our Ling residence! Your NanGong Family has been eyeing my Ling Family for more than a year or two already. Did you really think that our Ling Family didn’t know anything about that? Such ambitions are completely intolerable! Do you think I should help someone who covets the wealth of my Ling Family?!”</p><br/><p>Ling Tian’s eyes then scanned NanGong Yu’s pale face, “If you want my Ling Family to help your NanGong Family, it is possible! Hand over all of your people without any exception! You can use the lives of these almost one hundred people to display the sincerity of your NanGong Family. If that’s the case, I will consider this alliance seriously. If not, there is no room for negotiations! This condition of mine isn’t too much, right?” Ling Tian said in a heavy tone as his lips curled up into a sinister grin!</p><br/><p>NanGong Yu’s heart turned cold. With regards to the NanGong Family eyeing the Ling Family, she had only found out about it recently. After NanGong TianLong realized his daughter’s wisdom, he had briefly mentioned this matter to her. This matter had always been the greatest secret in their NanGong Family! She never imagined that Ling Tian would describe the matter so easily. How could NanGong Yu not be surprised?</p><br/><p>Furthermore, Ling Tian made things very clear — use the lives of these almost one hundred people to display the sincerity of your NanGong Family. This meant that Ling Tian had already obtained reliable information and just wasn’t willing to take action right now! It was already impossible for them to deny this matter.</p><br/><p>Besides that, Ling Tian’s stern gaze had shot right into the depth of her heart and shook her very soul! In that moment, she just couldn’t say a thing! In her life, this was the first time she was completely flustered, stammering without knowing what to say.</p><br/><p>Ling Tian’s expression then lightened up as he laughed, “However, I don’t think Miss NanGong is able to make the decision about this one small condition. It is best for you to consult your father first. Hehehe, there is no rush at all. Really, I am in no rush at all. It wouldn’t bother me if you get back to me a few days later.”</p><br/><p>Of course he wasn’t in a rush; in the whole Sky Bearing City, the NanGong Family was probably in the most awkward position with the least amount of time. For Ling Tian to mention such a condition in this moment was akin to looting a burning house, and he wasn’t afraid that the NanGong Family would reject him. He wouldn’t allow the NanGong Family to reject him either! Besides, why wouldn’t the NanGong Family want to exchange a bunch of already exposed spies for the two hundred odd people who came to Sky Bearing?</p><br/><p>NanGong Yu’s face turned red when she heard what Ling Tian said! Previously, she was ridiculing Ling Tian for not having authority to make the decision. In a few short sentences, she became the one unable to make the decision!</p><br/><p>“This little sister indeed cannot make such a decision. However, my father isn’t in Sky Bearing and I will have to discuss this matter with my uncle. I will give Young Noble Ling a reply as soon as possible. How about that?” NanGong Yu said carefully and slowly. She was already certain that the person in front of her wasn’t someone easy to deal with.</p><br/><p>Ling Tian shook his head and gave a slight smile. With a tinge of sarcasm in his tone, he said, “Miss NanGong, what is the point of trying to lie in front of a wise man? Your father is obviously in Sky Bearing to take charge of the affairs in the city. Do your NanGong Family really think that this is a heaven-shaking secret? Do you really think that you can fool everyone? Hahaha, what a joke!”</p><br/>\n</div>"}