{"title": "Chapter 218", "id": 218, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-218", "volume_title": "Volume 3", "body": "<h1>Chapter 218</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 218: Two Assassins</p><br/><p>Translator: DavidT Editor: DavidT , RockSneaking a glance to the side, she noticed that despite following closely beside her, Ling Jian had no intentions to offer her support at all. It was as though he was here to take a leisurely stroll down the streets and not to guard her. He looked as though he didn’t even know this beautiful lady beside him! However, not to mention the fact that the blockhead Ling Jian wouldn’t offer her any support, even if he did, a maiden like her would definitely not let a man touch her!</p><br/><p>Looking at Ling Jian’s cold appearance, Wei XuanXuan couldn’t help but grit her teeth as she thought to herself, What a blockhead!</p><br/><p>In anger, she decided to stand still on the spot. Naturally, Ling Jian would also stop beside her. However, he remained silent and looked at her with a questioning gaze, as though waiting for an explanation.</p><br/><p>Wei XuanXuan was fuming! For some odd reason, ever since she met Ling Jian, the usually dignified Wei XuanXuan felt her heart itch from hatred. She hated the fact that she couldn’t smash up Ling Jian’s rock-like face to see what kind of an expression was hiding within it! Would he still be as emotionless as he currently was?</p><br/><p>As Ling Jian saw Wei XuanXuan stopping before they even completed half their journey, he was completely bewildered due to his lack of interaction with women! Thus, he could only wait by the side patiently as he bitterly sighed in his heart, Who would have thought that I, Ling Jian, would have such a day: standing in the streets with a lady and being watched like a monkey!</p><br/><p>In Ling Jian’s eyes, apart from the few females in the Ling residence, all other females, regardless of how young or old they were, were all called ladies. This was because Ling Tian had once said that calling females as such will display his masculinity!</p><br/><p>However, who would have thought that Ling Jian would actually etch this casual joke by Ling Tian deep into his heart! Like the saying, ‘if the top is corrupted, the bottom will follow’, Ling Jian led all of his brothers to call the females ‘ladies’ 1 . Furthermore, whenever they said that word, their faces would always be cold and solemn, putting on their classic assassin appearance! Even Ling Tian felt his hair stand when he first witnessed that!</p><br/><p>How could a guy treat a lady as such?!</p><br/><p>If you were the one witnessing a 16 to 17-year-old man standing in front of you and saying ‘ladies’ with a straight face, you would probably feel like fainting as well.</p><br/><p>Looking at Ling Jian’s questioning gaze, Wei XuanXuan couldn’t help but be angered as she whined, “My legs are sore, I can’t walk any further.”</p><br/><p>Ling Jian then let out a long sigh as he thought to himself, No wonder young noble always says that women are troublesome! He is right indeed! After walking a mere thousand feet, this lass can’t take it any longer!</p><br/><p>Waving his hands, he commanded a beggar to come to his side. Then, Ling Jian took out an ingot of silver, “Go and find a sedan, the rest will be your reward.”</p><br/><p>That beggar was elated; holding onto the ingot of silver in disbelief, he bit on it and his teeth almost cracked! Only then did he hop away joyfully in search of a sedan. Finding a sedan was something that wouldn’t even cost half a tael of silver. However, Ling Jian took out a full ten taels of silver in a single go. How could the beggar not jump for joy? The prices of commodities in the Sky Bearing City were extremely low and he would no longer need to beg in the streets. The leftover silver would be more than enough for him to be a small hawker. Of course the beggar was elated! He was only afraid that Ling Jian would regret it, so he ran away at top speed when he received the silver.</p><br/><p>A short while later, the beggar brought a small green sedan over and Wei XuanXuan let out a sigh of relief. Looking at Ling Jian, she thought to herself, It seems that he is rather capable! I heard that he was Ling Tian’s study attendant? What a pity.</p><br/><p>However, Miss Wei forgot about one fact. How would a study attendant dare to be so rude to a princess? How could a study attendant give ten taels of silver to a beggar so casually?!</p><br/><p>Ling Jian then made a hand signal to invite Wei XuanXuan up into the sedan. His face remained expressionless as his eyes seemed to be stuck with a single emotion. Wei XuanXuan, who had just formed a better opinion of him, let out a grunt and grew angry again, walking towards the sedan with frustration.</p><br/><p>Before even taking two steps, Wei XuanXuan felt her arm tighten as Ling Jian had grabbed onto her inviolable jade-like arms! In that moment, she felt both embarrassed and frustrated in her heart. This fellow really doesn’t know any manners! Just when she was about to reprimand him, she felt a cold energy permeate her surroundings, making her drop any thoughts of reprimanding Ling Tian!</p><br/><p>Ling Jian’s eyes narrowed as he pulled Wei XuanXuan behind him, with an arrow-like gaze being directed at the sedan.</p><br/><p>In front of the sedan, a strange character slowly walked forward. His head was covered with a white scarf, and he was dressed in white robes with white shoes. He had a white sword tassel with a blood red belt around his waist. He was actually walking along the streets casually in such an outstanding outfit! He was the Golden Leaf Assassin, Ye BaiFei! While Ling Jian had never met him before, he was able to recognize Ye BaiFei immediately from his odd outfit!</p><br/><p>Meeting someone from the same trade! Can this be considered to be ‘enemies on a narrow road’?!</p><br/><p>Nobody would have imagined that the two most famous assassins in the world would meet under such circumstances! While Ye BaiFei didn’t know that this black dressed teen in front of him was the head of the First Pavilion, his sixth sense detected an extreme sense of danger as well. His eyes then narrowed as he looked towards Ling Jian.</p><br/><p>The clothes of both the assassins were a complete contrast. As compared to Ye BaiFei’s mourning like clothes, Ling Jian’s dressing was much simpler. Black scarf, black robes, black shoes, black sword tassel and black sword sheath! Apart from his face being fair, all other parts of his body were black!</p><br/><p>Both of their eyes were equally cold! Both of their eyes were equally proud and unbridled! Apart from the differences in their dressing and appearances, the aura they emanated was just far too similar!</p><br/><p>Both of their gazes met in mid-air, with killing intent exploding forth! They were like two sharp swords clashing at an extreme speed! In that moment, it was as though sparks could be seen from the clash of their gazes! At this moment, both of them felt their heart shake!</p><br/><p>How strong! Even Ling Chi and the rest probably won’t have such a killing intent!</p><br/><p>This was the first thought that surfaced in Ling Jian’s mind! He did indeed live up to the name of ‘Golden Leaf BaiFei’!</p><br/><p>He is definitely from the same trade!</p><br/><p>This person is so powerful!</p><br/><p>The First Pavilion?!</p><br/><p>These were the thoughts which surfaced in Ye BaiFei’s heart! The next moment, a burning battle intent was ignited in his eyes! Battling those from the First Pavilion had been Ye BaiFei’s greatest wish, and he had never expected to meet one of them here! While he was unsure about the other party’s status in the First Pavilion, Ye BaiFei was certain that Ling Jian’s martial arts were not any much weaker than his. At the same time, Ling Jian’s status was definitely not low either! Even if he wasn’t the pavilion head, he must definitely be someone important!</p><br/><p>Wasn’t it the greatest joy in the world to have an unrestrained battle with an opponent like that?!</p><br/><p>Both of them were 30 feet apart and facing each other! They were like two ferocious leopards ready to pounce at any moment! At the same time, they were like two divine weapons ready to be unsheathed at any moment!</p><br/><p>Killing intent exploded in the surroundings! Who knows how many lives these two killers had already ended? The density of their killing intent was definitely no less than that of a general who had been through hundreds of battles. In fact, their killing intent could even be superior!</p><br/><p>Wei XuanXuan suddenly felt her whole body turn cold with her hair standing up on edge. A bone-chilling cold invaded her heart and she felt as though she was suddenly thrown into the deepest recess of hell! Wei XuanXuan felt her vision dim from the extreme change in atmosphere as she almost fainted!</p><br/><p>Wei XuanXuan let out a soft groan as her face turned pale and her body began to sway. A short while later, her body gave way and began to fall towards the ground.</p><br/><p>Ling Jian’s chilly eyes were still fixed on Ye BaiFei without shifting away in the slightest! He had already realized that Wei XuanXuan could no longer endure the killing intent given out by both of them, and had begun to fall. However, he just couldn’t move an inch at this moment! If Ye BaiFei were to attack when he made a move to support her, while he wouldn’t die on the spot, he would definitely be at a complete disadvantage!</p><br/><p>Besides, Ye BaiFei was definitely not a gentleman or hero! Ye BaiFei was an assassin! A top-notch assassin! The so-called pugilistic rules and morality were no different from bullsh*t in Ye BaiFei’s eyes! If Ling Jian was in Ye BaiFei’s shoes, Ling Jian was certain that he definitely wouldn’t give up such an opportunity!</p><br/><p>A number of passers-by had already noticed their strange actions with both of them staring at each other. There were plenty who shook their heads with a sigh, cursing those two lunatics under their breath.</p><br/><p>Ling Jian’s gaze narrowed and said, “Sword shattering the wind and clouds, stirring up golden leaves?”</p><br/><p>Ye BaiFei’s facial muscles contorted as he revealed a sneer which was even uglier than him crying, “The lives of all humans are in my hands, the winds and rains heed the First Pavilion? Hehehe, what exaggeration!”</p><br/><p>Ling Jian’s eyes turned chilly, “Whether or not that is an exaggeration, you will know soon. However, this isn’t the right place for us to fight!”</p><br/><p>Ye BaiFei let out a sigh. How could he not understand this? This was the busiest street in the Sky Bearing City! With a cold snort, he said, “What about 3 a.m. after midnight?”</p><br/><p>Ling Jian considered for a moment before saying, “3 a.m. tonight at the willow forest to the south. If you dare appear, I will be there waiting!”</p><br/><p>Ye BaiFei then nodded his head in response.</p><br/>\n</div>"}