{"title": "Chapter 213", "id": 213, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-213", "volume_title": "Volume 3", "body": "<h1>Chapter 213</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 213: Appeasing the Ling Family</p><br/><p>Translator: chuchutrain Editor: DavidT , RockOld Madam Ling’s voice rang out, “No matter what, I hope Your Majesty will ask any questions later. If we delay the purging of the poison, then the consequences will be disastrous! Dare I ask Your Majesty something? If anything untoward happens to Consort Ling, then will the Empress be willing to bear the responsibility?!” A hint of warning revealed itself in her tone, especially focusing on the words ‘then the consequences will be disastrous!’</p><br/><p>“Old Madam Ling, your words are too severe. This Empress doesn’t know anything about the purging of poison, so what’s wrong with going in to take a look? My relationship with Sister Ling has always been good, don’t tell me Old Madam Ling is unwilling to even let me see my sister? What kind of words are you speaking?”</p><br/><p>“With the great blessings from the Empress herself, my aunt narrowly passed the doors of death. She is out of danger now.” Following this voice thick with fatigue, Ling Tian stepped out from inside the room, a frightening smile hung on his handsome face. A portion of his hair, still matted with sweat, hung on his face, and while he looked a little bedraggled, his eyes were bright and clear, full of an awe-inspiring brilliance.</p><br/><p>Empress Yang Xue locked gazes with Ling Tian. As the empress of a nation, she was already used to giving looks of contempt to those under her, but what she saw in Ling Tian’s eyes today gave her palpitations. That penetrating, frosty gaze seemed to be able to see through all her secrets, throwing her into disarray.</p><br/><p>“Tian’er, how’s your aunt? Are she and her child safe?” Long Xiang rushed up, stretching his head to peer into the room.</p><br/><p>“Both mother and child are out of the woods,” Ling Tian spoke, and after sweeping Yang Xue with a look, he indifferently continued, “However, my aunt’s body is still weak, and the most important thing is to nurse back her health using tonics; the tonics can’t be too strong or too Yin in nature. Another matter is that this incident is definitely not an accident, and there’s a very well hidden plot inside this whole scheme. Royal Uncle, to think that there’s actually someone inside the Royal Palace that dares to harm your consort, as well as your Royal Child… hehehe, our Ling Family finds this matter inconceivable!”</p><br/><p>“That’s right! Your majesty, while Ran’er is only a consort, she is still the daughter of the Ling Family. To actually meet with such a matter inside the Imperial Palace, this really fills the old woman with apprehension.” Hearing that her daughter was fine, Old Madam Ling felt the burdens in her heart suddenly lift. “Your Majesty, our Ling Family has always been loyal and devoted towards you, but to think that someone actually plots to assassinate our daughter here! Will your Majesty please be the judge, and help to find the culprit!” As she finished, Old Madam Ling actually kneeled and kowtowed to the Emperor, her face filled with tear streaks.</p><br/><p>Long Xiang emotionally replied, “Old Madam, please rise. This matter is all this Emperor’s fault due to being too lax with the security. Rest assured, We will issue an arrest warrant for that Su HuaiRen as well as the palace maid Little Chrysanthemum, to give an answer to you!”</p><br/><p>Unexpectedly, Old Madam Ling stood up and unhappily said, “Your Majesty must be joking, how could a mere imperial physician as well as a palace maid even dare to plot against the Royal Consort? There must be a mastermind behind all this! And the mastermind should have considerable power in the Imperial Palace! If we can’t unveil the true identity of the mastermind, then these incidents will happen again, putting everyone in danger! If the core of the city is not safe, then how can the country remain unmoved in times of crisis?!” Old Madam Ling’s words were scalding, partly due to the fact that her daughter almost passed through the door of death, and partly because she sensed that the Emperor was trying to soothe down this matter.</p><br/><p>The few sentences of Old Madam Ling was as good as putting a target board on Empress Yang Xue’s head! Yang Xue was never on good terms with Ling Ran, with the two of them constantly warring underground. Yang Xue was a petty person, easily jealous, so how could Long Xiang not be aware of it? If anything untoward happened to the Royal Consort, the biggest benefactor would be the Empress! As such, given the relations between the two families, how could the Ling Family not take the chance to viciously target the Yangs now?</p><br/><p>Long Xiang was also clear that there was at least a ninety percent probability that Yang Xue was behind this, but he was at his wit’s end when facing the two behemoths!</p><br/><p>Now that Sky Bearing was in an unstable situation, with all sort of experts converging here, he wasn’t able to guard against everyone harboring ill intentions! Only by borrowing the power of the Ling and Yang families would he be able to resist the other great families, making the other powers hesitant to take advantage of this situation.</p><br/><p>Of the three major powers in Sky Bearing, the imperial, Yang and Ling families, the Yang Family had always been the most powerful. Thus, Long Xiang made use of the Ling Family in order to restrict and control the Yang Family. Other than showering Ling Ran with more love, he was also very protective of the Ling’s 3rd generation heir, Ling Tian. Ling Tian, with his arrogance and domineering attitude, could survive until today not only because he didn’t go overboard, but because of the Emperor’s shielding! This was the way of ensuring the loyalty of the Ling Family to maintain balance in the Empire.</p><br/><p>However, the current times had changed, and the winds of fortune had begun blowing another way. By thwarting the Western Han’s expansion plans again and again and achieving many military merits, the soldiers started to call Ling Xiao the ‘God of War’. In addition, Chu Ting’er had become a mover and shaker of the commerce world with her sharp intellect, earning her the title of ‘Goddess of Fortune’. Recently, there was even a rumor claiming that they had a relationship with the otherworldly hidden sect ‘Beyond Heavens’, which gave Long Xiang a sense of fear.</p><br/><p>If it had stopped there, it still would have been acceptable since the Ling Family didn’t have any intention of expanding their influence. However, of all times the marriage alliance between the NanGong and the Yang families just had to collapse, turning them into enemies. With the Yang Family’s influence suddenly waning, the balance of the three could no longer be maintained, and this gave Long Xiang many worries.</p><br/><p>Of all the times, this sort of assassination had to then take place! While the Ling Family was definitely the victims this time, he could not immediately deal with Yang Xue as she was his only link to the Yang Family! If the Yang Family were to be unhappy and turn rogue, then in such sensitive times, how could the Sky Bearing Imperial Palace be able to withstand the external pressure?</p><br/><p>But if he didn’t deal with this matter, then how could he give the Ling Family an answer? With their current power and influence, how would they be willing to suffer in silence? All of a sudden, Long Xiang could feel a headache brewing.</p><br/><p>At the side, Empress Yang Xue’s expression changed, commenting in an icy voice, “Does Old Madam Ling believe that this Empress is the perpetrator behind all this?”</p><br/><p>Old Madam Ling merely sniggered, “How would this old woman dare to accuse the Empress? If your majesty doesn’t have anything to do with this, then why would you be in such a hurry to defend yourself?”</p><br/><p>Empress Yang Xue’s retort was stuck in her throat. Old Madam Ling’s words hinted that she had a guilty conscience, which sent her mental state into a panic. She however stubbornly tried to twist the logic, saying, “But by all means, your words are not what a subject of the imperial court should say. How the matter is to be dealt with would be completely up to the Emperor himself, but Old Madam Ling’s words are actually coercing the Emperor. As a subject, to despise the Emperor, that is an unforgivable crime!”</p><br/><p>Ling Tian interjected in at this point with a grim smile, “My grandmother’s words a moment ago were akin to a suggestion made by the commoners. There is a need to uphold righteousness in the world, and whether or not is is reasonable, the suggestion would still be heard by the country. Now the Emperor hasn’t opened his mouth, but as Empress of the country, you have actually retorted first, meddling in the country’s affairs. Then where do you place the Emperor? Doesn’t that mean you don’t respect his authority?! As for the unforgivable crime Your Majesty mentioned, who then is guilty of it?”</p><br/><p>As a person who had seen two lifetimes, how quickwitted was he? In a flash, he had escalated an internal court matter to the affairs of the country, and added in the tag of ‘Empress overriding her husband’s authority’ to Yang Xue! How could Yang Xue be as quickwitted as Ling Tian? She was left gaping like a fish, unable to utter a single word!</p><br/><p>Seeing the two families verbally attacking each other, and actually quarreling in front of him, Long Xiang felt a huge sense of powerlessness. When he suddenly saw how Ling Tian effectively shut Yang Xue up with a single sentence, an idea sprouted up in his heart, giving him a plan to temporarily maintain the balance of the two families, as well as dissipate the Ling Family’s hate.</p><br/><p>He coughed once to interrupt them, before saying, “This matter has not been fully unveiled yet and who is the actual culprit remains to be seen. The accusations can wait until we actually get ahold of our suspects. However, to actually get a concubine without letting your royal uncle know, you make me very sad, Tian’er. I couldn’t even get a cup of wine to drink from your wedding, and for that you need to be punished!”</p><br/><p>Everyone started in shock. The Emperor actually forcefully diverted the conversation to the topic of marriage, why did he do that? This change was too abrupt, but he was the Emperor, so what could they do?</p><br/><p>The Old Madam was a wily old fox and could tell that the Emperor didn’t want to get tangled up in this matter just yet. Luckily, both mother and child were safe so they currently had an advantage. She didn’t continue to speak because the timing was also unsuitable for them to rise up against the Empress. However, she knew that she would not let it rest just like that. The Ling Family never allowed anyone to take advantage of them!</p><br/><p>Seeing that his grandmother had calmed down, Ling Tian naturally understood that his grandmother had her schemes, and thus laughed while replying, “Royal Uncle is always preoccupied with so many national affairs, how would Ling Tian dare to invite you over every small matter?”</p><br/><p>Long Xiang laughed heartily as he responded, “But to take a concubine before you even have an actual wife is rather eccentric. How about this, Old Madam?” He turned to Old Madam Ling with a warm smile on his face, “Using my authority, I’ll betroth Jiao Yue over to Ling Tian, allowing her to be his official wife. I wonder if Old Madam would agree to this arrangement?”</p><br/>\n</div>"}