{"title": "Chapter 212", "id": 212, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-212", "volume_title": "Volume 3", "body": "<h1>Chapter 212</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 212: Expelling Poison</p><br/><p>Translator: DavidT Editor: DavidT , RockOld Madam Ling frowned, “Sir Su? Is there an imperial doctor with the surname of Su…” then, she suddenly remembered that there was indeed an imperial doctor with the surname Su and said, “is it that Su HuaiRen?! Didn’t he return to his hometown?”</p><br/><p>Long Xiang’s face turned purple from anger as he commanded, “Relay my decree; seal the city gates and search the city! Apprehend Su HuaiRen and Little Chrysanthemum! I want to see them if they are alive or see their corpse if they are dead!”</p><br/><p>Ling Tian twitched his lips as he thought to himself, It is already in the afternoon and almost a full day had passed. Who would be foolish enough to stay in the city, waiting to be caught? He then sent a signal to Ling Chen and she walked out.</p><br/><p>Ever since he entered, Long Xiang didn’t pay any attention to Ling Chen and thought that she was only an ordinary palace maid. The moment Ling Chen turned around, her beauty was fully displayed in front of Long Xiang’s eyes! Even as the Emperor, Long Xiang had never seen a beauty like Ling Chen before and his eyes lit up immediately!</p><br/><p>Ling Chen frowned slightly and walked past him.</p><br/><p>After witnessing Ling Chen’s graceful figure exit, Long Xiang couldn’t help but look at Ling Tian, “Tian’er, who is this lady?”</p><br/><p>Ling Tian was enraged in his heart! Your own consort is lying sick and weak on the bed with your child in her womb, and you still have the heart to be tempted by Ling Chen? You are really worse than a beast! With a chilly expression, Ling Tian replied, “She is my wife!”</p><br/><p>“Err,” Long Xiang’s face couldn’t help but turn red as he looked with regret towards the direction at which Ling Chen exited. Realizing that the atmosphere was a little awkward, he said to Chu Ting’er with embarrassment, “When did Tian’er get married? Why didn’t you inform us so we could also join in the wedding feast? Ah ah ah…”</p><br/><p>With her shrewdness, how would she be tricked by Long Xiang? Furthermore, she had also watched Ling Chen grow up, and Ling Chen was someone who she had already acknowledged as Ling Tian’s lady. How could she accept someone else eyeing her? Looking at Ling Tian, she then said calmly, “She was just a concubine which we had found for Ling Tian. With Ling Tian’s first wife still undetermined, it would be a joke for us to make a fanfare because of a concubine.”</p><br/><p>“Err, ah ah ah…” Long Xiang laughed awkwardly and didn’t continue.</p><br/><p>A short while later, Ling Chen walked in swiftly and stood behind Ling Tian. Without anything being said, Ling Tian understood what she meant.</p><br/><p>Ever since Ling Chen came in, Long Xiang’s gaze had never left her face. Ling Chen was both angered and frustrated from that as her face turned chilly. If it was anyone else, Ling Chen would have already circulated her Inner qi to definitely teach him a lesson. However, the person in front of her was the Emperor of Sky Bearing, and she had no choice but to swallow her anger!</p><br/><p>Ling Tian’s expression lightened up as the poison in Ling Ran’s body had already been gathered into a corner. However, almost half of Ling Tian’s inner qi was also exhausted! Due to Ling Ran being pregnant, Ling Tian had no choice but to be extremely cautious, greatly amplifying the exhaustion of his inner qi!</p><br/><p>However, while the poison was gathered in a single area, Ling Tian would not be able to expel it with his current cultivation. This was mainly due to the fact that Ling Ran was pregnant, forbidding him from expelling the poison with all his strength. If Ling Ran’s meridians were to suffer from a sudden shock, the child would definitely be lost! There was only a single option!</p><br/><p>With a frown, Ling Tian said to Old Madam Ling, “Grandmother, Chen’er and I are going to help aunt expel the poison from her body. It is best for those unrelated to this effort to take their leave.”</p><br/><p>Unrelated people? He was obviously referring to Long Xiang, who was a hindrance in the room and even coveting after Ling Chen. How could Old Madam Ling not understand that?</p><br/><p>Standing up, Old Madam Ling said to Long Xiang, “Your Majesty, Tian’er cannot be distracted when expelling the poison. Otherwise, both mother and child would definitely be harmed. It is best for Your Majesty to wait outside. When there is news, we will definitely inform Your Majesty at the first moment!”</p><br/><p>“Okay! Okay!” Long Xiang then looked at Ling Ran with worry and snuck a reluctant glance at Ling Chen. Then he turned around and walked out slowly.</p><br/><p>Off to the side, Princess JiaoYue was already filled with shame at the lecherous actions of her father. She lowered her bright red face as she no longer had the will to keep her head raised.</p><br/><p>Ling Tian then said solemnly, “Grandmother, please guard the door with sister JiaoYue. No one must be allowed entry, regardless of who they are! If not, the consequences would be dire! Not just the child but even aunt’s life may be in danger!”</p><br/><p>Looking at Ling Tian’s serious face, they both acknowledged his orders. Old Madam Ling then shifted an armchair in front of the door, sitting down on it with her dragon-head cane as though she was about to face an enemy!</p><br/><p>Ling Tian then let out a smile and said softly, “Chen’er, circulate your Divine Ice Formula and place your palm on aunt’s DaChui acupoint. I will use my inner qi to slowly shift the poison over. When the poison is forced to the DaChui acupoint, I will retract my inner qi and you must suck the poison out with your full strength! We must definitely expel the poison in a single shot! You must keep that in mind! Furthermore, you must wrap the poison in your own inner qi. If not, the poison will harm your body! You must be extremely careful!”</p><br/><p>After acknowledging Ling Tian’s commands, Ling Chen shut her eyes and circulated her inner qi. All of a sudden, everyone present could feel the temperature drop by almost ten degrees, with the temperature still dropping further! While it was the onset of summer when the weather would gradually become warmer, in an instant the room suddenly seemed to be nearing winter! Everyone present couldn’t help but shiver from the cold!</p><br/><p>Closing his eyes, Ling Tian supported Ling Ran’s body and circulated his own inner qi. Fully concentrating, it was as though Ling Tian could ‘see’ his inner qi surrounding an unknown ball of poison, slowly traveling along Ling Ran’s meridians!</p><br/><p>He then couldn’t help but rejoice about the fact that he had just broken through to the 9th stage of the Divine Shocking Dragon Formula, entering into the XianTian realm. If not, he would definitely be helpless today. With his inner qi at the 7th stage of the Divine Shocking Dragon Formula, he wouldn’t be able to wrap the poison and move it along Ling Ran’s meridians so easily!</p><br/><p>With his inner qi being circulated to the extreme, a steaming white fog could be seen forming above Ling Tian’s head. The fog grew thicker and thicker without any signs of dissipating, as though Ling Tian’s head was like boiling water generating an endless amount of steam.</p><br/><p>If there was someone present who was experienced he would definitely be shocked! Such a scene could only be seen if one’s inner qi achieved the profound ‘Three flowers congregating, five elements reverting to its origins’ stage! To think that such a scene would actually appear on a 15 to 16-year-old teen! How was this not astonishing?</p><br/><p>The final moment had arrived! Ling Tian could clearly feel that as long as he gave it a final push, he would be able to force the poison to the DaChui acupoint which Ling Chen was guarding! He couldn’t help but feel elated.</p><br/><p>Right at this moment, a sharp voice sounded, “The Empress is here!”</p><br/><p>Then, Long Xian’s displeased voice could be heard, “What are you here for?”</p><br/><p>Yang Xue then responded, “What is Your Majesty talking about? Hearing that sister Ling Ran wasn’t feeling good, I hated the fact that I couldn’t attach a pair of wings to fly here quickly. How can Your Majesty say something like that?” Yang Xue’s voice was lovable and whiny, being filled with a strange charisma.</p><br/><p>Following which, Long Xiang’s muffled voice could be heard and Yang Xue responded with a whine, “Your Majesty, why aren’t you moving aside? I want to go in and pay sister Ling Ran a visit. Aiyah, are you afraid that I will steal your little beauty away? Hahaha…”</p><br/><p>Long Xiang then said with difficulty, “Ran’er is suffering from poison and it is the crucial moment for her poison to be expelled. It is best that you wait a while longer.”</p><br/><p>Following that a change in Yang Xue’s voice could be heard, “What? She is suffering from poison? Then I must definitely go in and see sister Ling Ran quickly. Which b*st*rd can actually bear to poison a beauty like sister Ling Ran? Your Majesty, which imperial doctor is inside presently? It is best for you to move aside, I am only going in to take a look.”</p><br/><p>Long Xiang’s mumbling could then be heard followed by the sound of approaching footsteps.</p><br/><p>Ling Tian finally forced the poison to the DaChui acupoint. With perspiration filling his face, he cried out, “Chen’er!”</p><br/><p>Chen’er had long been ready! Her right palm was swiftly placed on the DaChui acupoint as she circulated her inner qi to create a strong suction. With her ice-cold inner qi, she wrapped the poison up and stored it in her body to be expelled at a later time. At the same time, Ling Tian had slowly retracted his inner qi and closed his eyes in meditation! If Ling Chen wasn’t a top-notch expert, such a poison expelling method would have been impossible. If any other person were to attempt something like this, they would definitely suffer from the poison themselves after sucking it all up. However, if they didn’t suck it all up, both Ling Ran and the person sucking the poison would definitely die!</p><br/><p>By the door, Old Madam Ling’s calm voice could be heard, “This old lady pays her respect to the Empress.”</p><br/><p>Yang Xue then said with surprise, “Eh, Old Madam is also here? Ah ah, are you worried about your daughter? Don’t worry, sister Ling Ran is naturally blessed by the heavens and she will definitely be fine. Ah ah, Old Madam, I will have to trouble you to move aside so I can go in to see my sister.”</p><br/><p>Old Madam Ling then said in an even tone, “Ran’er’s poison is being expelled and no one will be allowed inside!”</p><br/><p>Yang Xue then chuckled, “Old Madam, what are you talking about. This is not your Ling Family. Is Old Madam going to bring your Ling Family’s laws here to the palace? This Empress is the head of the Emperor’s harem. Can there be any place in the palace that I cannot enter? Ah ah ah, Old Madam, you must be joking, right?”</p><br/><p>Yang Xue’s words were extremely insidious! She was actually hinting at the fact that the Ling Family wanted to rebel! Even Long Xiang’s face changed slightly upon hearing that!</p><br/>\n</div>"}