{"title": "Chapter 224", "id": 224, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-224", "volume_title": "Volume 3", "body": "<h1>Chapter 224</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 224: Urgent Report</p><br/><p>Translator: chuchutrain Editor: DavidT , RockLing Chen’s beautiful face flushed crimson in an instant, and she started to hyperventilate. Suddenly, she dashed forward like an arrow in flight, grabbing onto Ling Jian ear in one move, and her hands actually tugged onto his ear like a clamp, twisting it a full 180 degrees…</p><br/><p>“AHHHOWWWW…” Ling Jian clapped his hand over hers and tilted to the side, screaming out, “Lass Chen… no, my dear lady… no no, I say great madam, Ah’Jian here didn’t offend you in any way today, you have to make sense, yaaaaaaaa~” Before he could finish, Ling Chen had given his ear another vicious pull. Left without a choice, he could only look towards his young noble for help. “Young noble…”</p><br/><p>Ling Tian pretended that he had not seen anything, instead coldly snorting, “Don’t even mention the fact that you’re wrong today. Even if you had committed no offense, to actually try to reason with a lady, shouldn’t you be punished? Idiot!” Turning his head, he spoke in an encouraging tone to Ling Chen, “Chen’er, your Flying Phoenix Capturing Dragon Hands was well executed. It has reached the state of quiet like a maiden, moving like a startled hare, leaving people completely unawares. However, your strength aspect is still slightly lacking, you should use more internal energy next time, and you could even try to revolve your Divine Ice Formula into the mix…”</p><br/><p>Ling Chen smiled cutely as she turned her head back, “I’ll definitely remember young noble’s lessons!”</p><br/><p>“There’s still a next time? God help me!” Gritting his teeth, Ling Jian couldn’t help but scream out shrilly. Are you two actually out to kill me? He thought to himself. Upon hearing Ling Tian’s words, his heart chilled, He still recommended an increase in internal energy and usage of the Divine Ice Formula… if that’s the case then wouldn’t my ears be ruined?</p><br/><p>Ling Tian smiled at the two of them, saying, “Chen’er, you need to up your game, else this kid will not remember the lesson!”</p><br/><p>“Young Noble, I won’t do this again, no, definitely won’t do this anymore!” Ling Jian started to beg for mercy, “I won’t ever come in the middle of the night and disturb young noble and lass Chen’s ‘happy ending’. Young noble… you are a magnanimous person, how about you just let me off this time… siiiiii, aiya~” If he had stopped his sentence after saying that he would never do this again, Ling Chen would be have been soft-hearted and let him go. But he just had to continue, and incur the wrath of Ling Chen once more, akin to adding oil to the fire!</p><br/><p>“If you dare to speak more nonsense, I’ll make you feel like you’re in a living hell! To think that you would conjure up your own story when you have nothing else to say…” Hearing the bullsh*t come out from his mouth, Ling Chen just got angrier and more frustrated and added some additional twist to his ear. Ling Jian’s ear was on the verge of transforming into a fried dough twist 1 ….</p><br/><p>“My big sister, please ease up, even if I’m going to die, I’ll need an explanation for my crimes… my elder sister Chen, please talk some reason, no, young noble has always said that all women don’t talk reason at all, AHHH~” Upon hearing that Ling Jian was still spouting nonsense, Ling Chen’s hands pulled even lower. “Help me, my definition doesn’t include you, lass Chen… I’m not saying that you aren’t a woman, I… I’m just saying that you’re a good woman that doesn’t talk reason!” Ling Jian finally didn’t know what he was saying anymore! His ear was almost twisted 360 degrees by this time!</p><br/><p>Ling Tian waved his hands at this point, and Ling Chen pouted as she unwillingly released her hand, standing beside Ling Tian and silently seething.</p><br/><p>Ling Jian held onto his poor ear with his hand, massaging it furiously, a depressed expression on his face.</p><br/><p>“You actually dared to arrange a duel with Ye BaiFei in private, hmph. If not for young noble finding out about this, you would’ve become a corpse by now! You still have the guts to scream about anything? Why else would the young noble mercilessly discipline you! And you think that I’m so petty!” Ling Chen spat out in exasperation.</p><br/><p>“Ehh?” Ling Jian had a great shock, and the hands massaging his ear paused in mid-air. “How did young noble know about this?”</p><br/><p>Ling Tian coldly snorted, changing the topic, “Are your internal injuries completely healed?”</p><br/><p>Ling Jian couldn’t help but tremble a bit, before lowering his head.</p><br/><p>“Have you talked to Third Master Yu about the sparring with Ling Chi and the rest?”</p><br/><p>Ling Jian’s pale turned pale, and his head lowered even more.</p><br/><p>“You’re completely just causing trouble!” Ling Tian raged. “Do you know how much weight is on your shoulders? But you didn’t even stop to consider, instead willfully accepting random duels from people! Did you fully check his background? Did you forget all that I’ve taught you?! You think the other person would be as silly as you? Let me tell you, Ye BaiFei had gathered a team of seven other killers before dusk even came. If you had met with them for the duel, you would be a dead man!”</p><br/><p>“What?!” Ling Jian sharply jerked up his head. “How dare Ye BaiFei be so despicable! To share the same reputation as him, I’m truly disappointed!”</p><br/><p>“Disappointed?! The one who should be disappointed should be Ye BaiFei! On what grounds do you have the qualifications to say that you share the same reputation as Ye BaiFei?!” Ling Tian was resentful that Ling Jian didn’t live up to his expectations. He continued ranting, “Both of you share the same reputation, that’s a truth. But both of you are assassins, and your purpose should be to eliminate the other party no matter what methods you use! What Ye BaiFei did was correct and completely justifiable! Why should assassins care about the rules in the martial arts world? Wouldn’t it be a joke then?! Then you might as well be heroes instead, why bother calling you assassins?!”</p><br/><p>“Hmph, because he wanted to save you, young noble ignored the fact that he was lacking in internal energy and fought the eight of them, even being inflicted with internal injuries! Shouldn’t you just die? What’s just suffering a little punishment!” Ling Chen pointed a finger at Ling Jian’s head, wagging it as she spoke. “Why don’t you tell young noble, when will you make the young noble worry less? Why does it always seem like you’re that immature? Is your mind filled only with rubbish?”</p><br/><p>“Young Noble got injured?” Ling Jian jerked his head up once more, an expression of fury appearing in his eyes at this moment, “I’ll go f**king kill them now!”</p><br/><p>“You still dare to say….!” Ling Chen’s berating was stopped by a glance from Ling Tian, who continued, “Whether we kill them all or not, we will decide later. What news do you have to report?”</p><br/><p>“Oh, it’s like this.” Upon hearing that they were going to be discussing actual matters, he immediately straightened himself, with a strong sense to do battle flashing out from his eyes. Ling Tian couldn’t help but obtain some clues from this. It seemed like the report this time was going to be quite bloody since Ling Jian was so deeply interested in it!</p><br/><p>However, what Ling Jian reported was contrary to his expectations, “From intelligence gathered, there is news from the Northern Wei. The Northern Wei Emperor, Wei TianAn, was suddenly afflicted with a serious illness and is bedridden. Right now, the affairs of the state are being managed by the crown prince Wei ChengPing, and he has gradually started to accumulate more troops on the border between Northern Wei and Sky Bearing. As of today, he has already given the order to reinforce the troops by three times, and their total military strength now exceeds twenty thousand! Their influence is vast and strong!”</p><br/><p>Ling Tian’s face fell at this news, “Wei ChengPing’s ambitions are huge. Thinking of swallowing Sky Bearing in one move? He’ll choke to death sooner or later!”</p><br/><p>Ling Jian declined to comment, instead just keeping a smile on his face. He was only responsible for passing on the news to Ling Tian. What Ling Tian could decipher from the news would be up to him, as Ling Jian would never use that part of his brain! So long as Ling Tian was around, Ling Jian was content just receiving orders from him.</p><br/><p>“The second news also originates from Northern Wei! In the Heavenly Star Continent, the only group placed in the same ranking as the First Pavilion, the ‘Blood Slaughter Pavilion’, has commanded a large number of their followers to enter the premises of Sky Bearing. Based on the intelligence transmitted from the Northern Wei imperial palace, it seems like Wei ChengPing has paid a large sum of money for them to assassinate four important characters! Every person killed would earn a compensation of ten thousand gold!” Ling Jian narrowed his eyes as he spoke, the corners of his mouth giving out a mocking smile! However, this smile was directed at the Blood Slaughter Pavilion and Wei ChengPing!</p><br/><p>“Four important characters?” Ling Tian pondered deeply. “One of them should be Yu ManTian?” This was followed by a sigh, “Ten thousand taels of gold! Hehehe, Yu ManTian is really worth a lot! Does Northern Wei have too much gold to spend?”</p><br/><p>“Young noble has godly calculating abilities!” Ling Jian’s revealed a respectful expression. “One of the targets is indeed Yu ManTian!”</p><br/><p>Ling Tian burst into laughter at this, “What godly calculations? If Northern Wei wishes to dominate the entire continent, then their internal affairs must be taken care of first. The first order would be to ensure that the superpower Yu Family is dragged into the muddied waters with them. If the Yu Family were to remain aloof, then even if Northern Wei were to deploy all their soldiers to take over the world, the Yu Family would still remain like a deep internal fishbone, choking them. However, if the Yu Family were to flare up, then the imperial family of Northern Wei could use this chance to form an alliance, mobilizing them to fight for world domination! And what better way to get their support than to completely enrage the Yu family? Thus, Yu ManTian being a target is a given, because he and Yu BingYan don’t have many experts with them in the capital. If they are both assassinated, this would not only destroy the balance of power in the Yu Family, it would also cause them to be unable to send a representative for the upcoming battle against the ‘Water of Heavenly Wind’! They would lose the battle as a result and this would drive the Yu Family mad! So I presume the second target would be Yu BingYan?”</p><br/><p>“The second target isn’t Yu BingYan…” Unexpectedly, Ling Jian declared it untrue and then said, “Miss BingYan is placed third, while the second target is actually the General Ling!”</p><br/><p>Ling Tian frowned at this unexpected news, “If that’s so, then Sky Bearing should have already confirmed that they would be sending my father out to war against the Northern Wei? Or else, how could they be so sure that my father would be going to war when they haven’t even chosen their general?”</p><br/><p>A glimmer of understanding flashed past Ling Chen’s eyes as she exclaimed, “Young Noble, don’t tell me, the imperial court…”</p><br/><p>Ling Tian cast her an appreciative glance, “Not bad! There must definitely be a Northern Wei spy in the Sky Bearing Imperial Court!” Furthermore, his identity wouldn’t be low, or he wouldn’t have access to such confidential reports!” Suddenly, his face froze as he seemed to remember something, muttering to himself, “Northern Wei hired the Blood Slaughter Pavilion, and Ye BaiFei came with his brothers over to Sky Bearing; don’t tell me… Ye BaiFei belongs to the Blood Slaughter Pavilion?!” The more he thought about it, the more he realized how severe this matter was, and immediately waved his hand while shouting, “Command the Violent Wind Gang to spare no effort to monitor Ye BaiFei and his men, and investigate all his movements! Go and pass my order immediately!”</p><br/>\n</div>"}