{"title": "Chapter 232", "id": 232, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-232", "volume_title": "Volume 3", "body": "<h1>Chapter 232</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 232: Mysterious Girl</p><br/><p>Translator: chuchutrain Editor: DavidT , RockLing Tian scrutinized his face and found out that although his facial features were well proportioned, with flawless skin, he appeared somewhat deadpan, with a seemingly forced smile on his face. After a sweep and putting all the clues together, he also received a shock. Could this person also be in disguise? And he even went so far as to use a human skin mask?! Only a human skin mask could produce such realistic effects, right?</p><br/><p>The method of making a human skin mask was also known to Ling Tian, but such methods involved directly slicing the skin off of another person, and Ling Tian had no intention of engaging in such cruel and inhumane behavior. Furthermore, their concealment methods here were quite primitive, usually seen through by himself at first glance, so there was no need to go to that extent. To think that he would meet someone today where he couldn’t differentiate a disguise from the true self!</p><br/><p>“This person is called Ling Tian, how I should address this young noble here?” Ling Tian did not reveal any clues on his face as he spoke. Whatever scheme this person might have, just considering the fact that this person probably possessed a high cultivation level and had come to Sky Bearing, how could Ling Tian not be on guard?</p><br/><p>“Ah, so it’s the famed young noble Ling Tian! This person really has three lifetimes of karmic luck to be able to meet you. This person’s name is a little vulgar, surnamed Qian, Qian ShuiRou.” The young man laughed as he replied.</p><br/><p>Qian ShuiRou? If you continue lurking in the water, I’ll throw a bath bomb at you! 1 Ling Tian secretly cursed, but politely returned the gesture, “So it’s brother Qian.” As they spoke, the cross-dressing female on Qian ShuiRou’s side abruptly glanced at Ling Tian, and an odd expression of wariness and precaution appeared on her face. On the other hand, her expression towards Ling Chen was many times warmer. Ling Tian caught her expressions and couldn’t help but think that it was strange.</p><br/><p>“A planned meeting cannot be as joyful as a coincidental occurrence. To be able to meet under this poetic scenery tonight, this should be considered a joyous occasion! Might we be able to drink a cup in celebration?” This Qian ShuiRou was an easygoing person, immediately gesturing towards the tavern a short distance from them, his tone seemingly not allowing any refusal. At the same time, the way he gestured spoke of his innate arrogance, as though he was looking down on the masses.</p><br/><p>Ling Tian’s mind whirled as he considered the situation, immediately adapting as he smiled in response, “To follow one’s precepts is the sincerest form of respect, and to be able to meet such a hero like brother Qian is exactly what I, Ling Tian, have been looking for!” He thought to himself, It seems like this Qian ShuiRou is the successor of his generation for a martial family! Such flair and natural arrogance wasn’t something that could be bred in a nouveau rich or a small aristocratic family!</p><br/><p>As the saying went, ‘it takes three generations to wear, and five generations to eat’. Such a personality couldn’t be developed and cultivated unless one was born and bred in that environment! Ling Tian started to feel curious regarding his true identity.</p><br/><p>The four of them entered the tavern by the roadside, and under Ling Tian’s observation, he found another quirk of Qian ShuiRou, that he loved to gaze at this sort of misty and rainy weather currently seen outside! The moment he walked into the bar, he sat at a window seat, directly facing the window. Ling Tian mused, These types of people are usually melancholic in nature, with a lot of sadness and sorrow. Could this be considered as his flaw? If we ever cross paths as enemies, this information could be put to good use!</p><br/><p>When it came to ordering dishes, the two men looked through the menu once, but Ling Tian left the final decision to Qian ShuiRou. After ordering a few light dishes, he ordered a jar of ‘Fragrant Osmanthus’ wine. This caused Ling Tian to laugh to himself, Looks like this was a case of a man sick of eating heavy delicacies.</p><br/><p>“The rain floats in sheets from the blue sky, and the worries of the mortal world are weighty; pouring out a cup of plum blossom wine, one’s heart melts with the rain to become none!” Once he had drained his first cup, Qian ShuiRou glanced out of the window, a misty expression on his face as he lightly sighed and recited.</p><br/><p>Ling Tian gave a start, and after a short moment to ponder over the poem, he praised out loud, “Good poetry! Good literary talent! To think that Brother Qian is actually a master of the pen and sword, to come out with such a poem on a whim, Ling Tian admires you!” On the contrary, a look of disdain appeared in Ling Chen’s eyes. Calling that poem good would be a little of a stretch, but compared to Ling Tian’s two phrases just now, be it the antithesis or the deliberate phrasing of words, they were miles apart, almost like heaven and earth, and couldn’t be spoken of in the same breath.</p><br/><p>Sweeping his glance around, Qian ShuiRou immediately noticed Ling Chen’s look of disdain. Being a proud person, he couldn’t help but let out a gentle smile while saying, “I believe this lady here must be extremely talented in the literary arts, thus giving me a look of contempt. Haha, will you please advise me?”</p><br/><p>Ling Chen glanced at Ling Tian, but upon not receiving any response, she continued, “While young noble Qian is able to craft out such poems, when compared to my young noble’s, yours are still lacking. However, I am lowly educated and have no authority to guide you, so I am unable to offer you detailed criticism.”</p><br/><p>Qian ShuiRou’s eyes lit up as he replied, “Then I’m all ears.” However, in his tone was a slight hint of not being convinced. One had to know that he was reminiscing about past memories, and just randomly sprouted out something. While it was not akin to a sculpture done by a master, he was already quite pleased by it. However, it seemed that based on Ling Chen’s tone that Ling Tian was even a notch higher than him! How could he be happy about this?</p><br/><p>Ling Chen glanced at Ling Tian with an adoring look, before slightly opening her mouth to recite in an unrestrained manner, “The free-floating petals are light like a dream, the endless drizzle is thin like worries. This was the work by my house’s young noble. May Young Noble Qian please dissect it.”</p><br/><p>Qian ShuiRou lowered his head and murmured the two phrases of the poem repeatedly. The more he did so, the more he felt that this poem was too wonderful for words, giving him a light and airy feeling as though he had rid himself of the mortal dust. Compared with his own poem, the two couldn’t even be mentioned in the same breath! He couldn’t help but sweat when he thought that he had been trying to impress them with his meager literary talent just now. He couldn’t help but be ashamed and forced out a laugh, “Indeed, there’s always a heaven beyond the heavens, and a person beyond all people. Young Noble Ling’s poem is enigmatic, and this brother here cannot compare!”</p><br/><p>Just when Qian ShuiRou lowered his head, Ling Tian spotted something. Qian ShuiRou’s hands were tanned, yet his face was rather pale. However, when he had lowered his head, the skin around his nape was sparkling like jade, a pure white like snow! Looking at his hair, Ling Tian could observe that every strand was a glossy black, and now that they were nearer to each other, he indistinctly smelled a refreshing fragrance emanating from him, much like orchid musk.</p><br/><p>Ling Tian paused in shock, finally understanding the situation. This person was a female! While Ling Chen was beside him, the fragrance she emitted was that of a lily, a totally different scent! And the cross-dressing female was seated opposite him on the table, thus being too far for Ling Tian to properly interact with her, which meant that the scent did not originate from her.</p><br/><p>Having processed his thoughts, he realized that Qian ShuiRou should also be a noble lady in disguise! Then the two of them should be master and servant. No wonder Qian ShuiRou would pretentiously take out a fan and hold it in front of herself, probably to prevent her bosom from exposing herself. As for the cross-dressing female giving him weird looks, that was because she was wary that he would make a move on her house’s lady!</p><br/><p>The corners of Ling Tian’s mouth quirked up into a smile, as he said, “Brother Qian is too polite, your poetry just now was also quite the masterpiece, it’s just that this little lass doesn’t know how to appreciate it and rebutted you. I should be the one asking you to forgive me!”</p><br/><p>Qian ShuiRou laughed in embarrassment as he replied, “Displaying my slight skill before an expert, making a fool out of myself; this brother here now knows the meaning behind those words. I’m truly ashamed, and this lady here was merely quick with her tongue and wit, so how would I dare to take offense?”</p><br/><p>Ling Tian also laughed in response. “May I inquire as to where Brother Qian is from? I don’t think you’re from Sky Bearing, right? For someone of your stature, even if my ears were not well informed, I think that I would have heard of you!”</p><br/><p>A light flashed past Qian ShuiRou’s eyes, and he merely calmly replied, “This brother here is a nobody, so how would I enter young noble Ling’s eyes?” He immediately diverted the question without leaving any clues!</p><br/><p>Ling Tian was also stunned speechless. He thought that this person was the renowned talent from the XiMen house, but since this person was a lady it ruled out that possibility. If they were not from the XiMen house, then this Qian ShuiRou would definitely not be someone currently residing within Sky Bearing, or else with the chances of them coming into contact she would have definitely revealed her name! Which aristocratic family did this person originate from?</p><br/><p>He suddenly felt as though the chaos hovering over Sky Bearing just got a few inches thicker and unknowingly his brows furrowed.</p><br/><p>The time taken for the meal quickly passed, and as though seeing through Ling Tian’s intentions, Qian ShuiRou became more cautious, even with Ling Tian’s repeated probings, he was not able to get anything important out.</p><br/><p>Close to the end of their ‘joyous meal’, while Ling Tian still appeared unruffled, Qian ShuiRou could feel that her mental state was close to breaking. Every question from Ling Tian had a hidden edge within, and if she were to be blindly led by him she would definitely fall into a trap! As such, every sentence spoken had to be repeated a few times to herself before she dared to speak. Such a meal, in her opinion, was worse than fighting with a few experts at once!</p><br/><p>Seeing that the meal was coming to an end, Ling Tian took the initiative to bid farewell. Qian ShuiRou also sighed in relief and got up to send Ling Tian off. As they parted, Ling Tian suddenly smiled while saying, “The mountains are high and the rivers long, I will definitely meet up with Brother Qian once again! Please take care of yourself!” With a happy laugh, he turned and walked away.</p><br/>\n</div>"}