{"title": "Chapter 274", "id": 274, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-274", "volume_title": "Volume 3", "body": "<h1>Chapter 274</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 274: Sky-Splitting War</p><br/><p>Translator: chuchutrain Editor: DavidT , RockFor a long time after the initial clamor, the hall was plunged into absolute silence! Everyone held their breaths, and even though there were over ten thousand people on the scene, a pin could probably be heard if it was dropped!</p><br/><p>This silence was completely different from previous scenarios; this was out of pure shock and urgency!</p><br/><p>Everyone there was aware that for this final item the starting bid was just a number. For an object of fame such as the Heaven Splitter, how could money be used as a gauge for it? Whoever got their hands on it would become the ruler of all under the heavens! How great of a temptation was that?</p><br/><p>But who could get it in their hands?!</p><br/><p>Under the gaze of everyone, four experts of the Xiao Family accompanied a middle-aged man as they solemnly walked up the stage. The middle-aged man was no ordinary person, but the number two figure of the Xiao Family, the highest decision maker in Sky Bearing, Xiao FengYang! To convey his sincerity to this ‘divine sword’ he had even crafted a case purely out of white jade to house the sword. Xiao YanXue carefully took it over, and opened the box, drawing out a longsword still in its sheath. The design of the sword was ancient and clumsy, but it exuded an overbearing atmosphere, and anyone who looked at it would know that it wasn’t ordinary.</p><br/><p>“I bid 12,000,000 taels!” The silence reigned for a while more before someone gave a bid, a sky-high bid of twelve million! But everyone knew that this was only the beginning.</p><br/><p>Even if they were able to obtain it, they had to consider if they had the power to continue holding on to it. At this time, the most important factor would be one’s capabilities, and only then could wealth be considered. For this auction, the various people thought that the Xiao Family had only brought a few valuable treasures to auction off, and little did they expect them to actually take out the Heaven Splitter sword! While treasures were precious for a reason, if they were too precious, then chaos would ensue as everyone attempted to get their hands on it. Even after this landed in someone’s hands, could they actually manage to bring it back home?</p><br/><p>This was the country of Sky Bearing Empire. The core people of the eight great aristocratic families had converged here in a swarm, and experts were as plentiful as clouds. A slight negligence would probably result in death without a recognizable body left! Just the Imperial Family of Sky Bearing would do all that they could to ensure that the Heaven Splitter wasn’t allowed to leave the capital, let alone the Ling and Yang families who were also looking at it from the sidelines.</p><br/><p>“Being ignorant is not a crime, but hoarding a jade ring is a crime.” This ideology was something that everybody present understood!</p><br/><p>Even the best item, if it wasn’t able to be put to good use, would be useless!</p><br/><p>Ling Tian observed the entire scene with drooping eyelids. He had already discovered the person who had bid first, but he didn’t go over to greet him. It was the internal affairs head of the Imperial Court, Long QianXing! Ling Tian laughed coldly to himself, Is even the Imperial Court contemplating the idea of possessing the Heaven Splitter? Sadly, even if they are able to lay their hands on it, this country would be reduced to ruins in less than two months! How presumptuous of them! This is a treasure capable of reaping lives, and with your current strength, you also want to dip a finger into the pie?</p><br/><p>Other than one person there, Ling Tian completely didn’t consider the rest as worthy of any concern. That person was actually not Qian ShuiRou, and it wasn’t that her strength wasn’t enough, but that her strength wasn’t even enough to make him apprehensive. The real person that Ling Tian was afraid of was actually the green-robed man! He could confirm for certain that this person was a peerless expert hailing from Beyond Heavens, and him coming here at this time would only be for the Heaven Splitter. If that was the case, then not only would Ling Tian not obstruct him, but he would happily welcome him.</p><br/><p>Ye QingChen had once mentioned in passing that in every generation, there would be a peerless expert in Beyond Heavens who could shake the continent! But when Ling Tian asked him about it, Ye QingChen merely smiled and didn’t answer. Seeing that particular green-robed man right now, Ling Tian seemed to have the answer to his questions, and he couldn’t help but laugh bitterly to himself.</p><br/><p>Indeed, the bidding didn’t stop there, and in an instant, it had already risen to close to 60,000,000 taels! Everyone’s emotions were getting more and more worked up by the minute. Even the level-headed DongFag JingLei was starting to get worked up, and the BeiMing Family that hadn’t made a sound until now also joined in.</p><br/><p>Beside Qian ShuiRou there were eight experts standing there with solemn expressions. Among the crowd, people were busy screaming out bids, but everyone knew that the bids were no more real than reflections on a lake. There would definitely be no commitment behind those bids. The presence of the Heaven Splitter had already set in motion the fires of war.</p><br/><p>Maybe this was the actual motive for the Xiao Family to sell the Heaven Splitter in the auction!</p><br/><p>Ling Tian suddenly spotted someone missing and immediately turned anxious!</p><br/><p>Where was the female who was always beside Qian ShuiRou?</p><br/><p>As Ling Tian thought of this point, a disturbance suddenly appeared in the crowd. The moment everyone turned to look, a few dozen shiny black pearls fell like falling petals onto the crowd, and with soft ‘pu pu’ sounds the entirety of Smoky Thea Tower was filled with a thick black smoke.</p><br/><p>At this point, an unforeseen event happened!</p><br/><p>Berating and cursing were continuously heard as the noise generated from moving blades, fists, and legs grew in volume. The sounds of groaning rang out and a thick stench of blood began to rise up.</p><br/><p>Ling Tian’s eyes darted left and right and gently tugging on Ling Chen’s hand the two of them immediately floated up into the air, silently returning to the Heavenly Fragrance Chamber based on their memories. With their expertise in movement techniques, it was a piece of cake to escape with none the wiser.</p><br/><p>Just after the two of them had left, a sudden gust of wind enveloped their seats, and with a series of chopping sounds their respective seats were broken to bits.</p><br/><p>Ling Tian coldly smiled to himself. It was lucky that he had acted upon his instincts, as it seemed like there was someone who had wanted to take advantage of this mess to deal with him. However, other than Qian ShuiRou, there didn’t seem to be anyone else who could be that prepared. But if it was her then that was too unwise!</p><br/><p>Followed by two loud explosions, two large holes simultaneously appeared in Smoky Thea Tower, allowing two bright rays of sunlight to penetrate into the building. Two silhouettes flew in like gods descending from heaven and lept past the fifty feet of distance in a flash, both of their hands stretching towards a certain direction. Ling Tian was certain that both their hands were stretching to where the Heaven Splitter had been placed.</p><br/><p>Everyone else had the same line of thought, and simultaneously a dozen shadowy figures leaped towards the same place like lightning.</p><br/><p>‘Peng peng’ came two loud noises, as those two silhouettes that were in front were thoroughly rebuffed! This was immediately followed by a multitude of noises as all those experts who also rushed forward were immediately sent staggering backward. A loud crash was heard as the rooftop of the tower splintered and a blurred shadow immediately flashed and disappeared. This was followed by many of the audience, who leaped towards the roof in order to pursue the person. Suddenly, the splinters that were created from the smashing of the roof were infused with energy and shot down like rain into the pursuers. Without a way to change directions in midair, they could only allow themselves to get hit, smashing back down and being heavily injured!</p><br/><p>The two mysterious shadows that initially came also jumped up to the roof and disappeared. In the end, no one managed to properly see the face of either man!</p><br/><p>A heart-wrenching cry that sounded precisely like Yang Wei’s voice could suddenly be heard. At this time the smoke in the great hall had already begun to clear, and then everyone could see the reason why. Standing about fifty feet away, the eldest young master of the Yang Family swayed unsteadily before vomiting out a gout of blood and falling down. Yang Lei immediately sprang over to hold his son in his bosom. To think that his son had been killed in just this short amount of time!</p><br/><p>The fog completely faded, revealing a scene of complete disorder in Smoky Thea Tower. DongFang JingLei, Qian ShuiRou, BeiMing Kong, NanGong TianHu and the other experts had horrific expressions. A few of them were even bleeding from the corner of their mouths as evidently they had received injuries of some significance.</p><br/><p>Yet another scream sounded, and everyone turned to see Xiao YanXue trembling with a pale face, pointing towards a direction. The four experts from the Xiao Family lay where she pointed at, with the Heaven Splitter already missing! Nobody doubted the fact that if Xiao FengYang was on the scene he would also be lying there!</p><br/><p>“Good martial skills!” A strange gleam could be seen in Ling Tian’s face as he eagerly nodded and said, “Chen’er, did you see it clearly?”</p><br/><p>With a face full of guilt, Ling Chen shook her head, saying, “I properly observed the two experts that came in and the experts that flocked up. But the most important parts, which were who took the Heaven Splitter as well as how the eldest young master of the Yang family died, those I failed to observe.”</p><br/><p>A smile appeared on Ling Tian’s face as he replied, “You don’t need to feel reproach as I didn’t see it clearly either and only saw a broad outline. But other than me, I believe no one would be clearer about what happened inside. The person who took the Heaven Splitter is likely to be the green-robed man, for nobody else would have the capability to do so!” Ling Tian sighed before continuing, “This person’s martial skills are really out of this world, and I believe that he should be undefeatable under heaven!”</p><br/><p>Ling Chen hesitated a while before asking, “Not even young noble? I believe he’s only on par with young noble!”</p><br/><p>Ling Tian laughed, “Chen’er, you and I are both martial artists, why is there a need to lie? If I can reach the eleventh layer of the Divine Shocking Dragon Formula, I might stand a chance. Right now, definitely not!”</p><br/><p>Ling Chen took in a breath of cold air.</p><br/><p>As it turned out, when the situation changed, and the two men dropped down from above, the dim light allowed Ling Tian to properly see exactly what happened.</p><br/><p>In that instant when the two men rushed for the Heaven Splitter, the green-robed man was a step ahead and had silenced the Xiao Family’s bodyguards, grabbing the Heaven Splitter. He then repelled the two experts easily with two palm strikes, as well as giving a flurry of strikes towards each of the nobility that had lept up! He had then jumped up, and as he was midair, he struck down towards Yang Wei once, before destroying the ceiling and using the wood shards as hidden weapons! This was how he made his getaway!</p><br/><p>Just a simple wave of his hand had caused Yang Wei who was 150 feet away from him to have his heart shattered, killing him instantly!</p><br/>\n</div>"}