{"title": "Chapter 271", "id": 271, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-271", "volume_title": "Volume 3", "body": "<h1>Chapter 271</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 271: Adding a Single TaelTranslator: DavidT Editor: DavidT , Rock</p><br/><p>Xiao YanXue let out a smile and said, “This is the first treasure. It is a ten-foot long Soul Freezing Sandalwood. This Soul Freezing Sandalwood grows on the top of snow-capped artic mountains, and it takes several years for just a small section of it to grow. With just a small piece of it in a room, summer will no longer be scorching but cool and refreshing. If a small piece of Soul Freezing Sandalwood is added to a container, an item placed in the container won’t rot even after a hundred years! Furthermore, as long as a small piece of it is placed on one’s body, the smell emanated by it will chase away any poisonous insects! It wouldn’t be too much to call it a treasure!”</p><br/><p>“May I know what the starting bid of this item will be?” an anxious voice sounded. As everyone turned around to take a look, they saw NanGong TianHu from the NanGong Family.</p><br/><p>“So it is Second Master NanGong,” Xiao YanXue smiled, “the starting bid of the Soul Freezing Sandalwood is 200,000 taels of silver.”</p><br/><p>NanGong TianHu then shouted out, “Our NanGong Family wants this Soul Freezing Sandalwood! We offer 400,000 taels of silver!” Everyone knew that the body of NanGong Le was presently in the hands of their enemy. The reason why they were unable to return him to his hometown was due to the warm weather. Even with the best wood and best preservation methods, it was impossible to prevent the body from rotting. If they could have this section of Soul Freezing Sandalwood, they could place a few pieces of it into the coffin and NanGong Le’s body can be transported back to their hometown without decomposing. After seeing NanGong TianHu offer a price, those who knew the backstory didn’t compete with him. As for the merchants who didn’t know the backstory, they all gave up due to the sudden spike in price and the determination displayed by NanGong TianHu to get it.</p><br/><p>After calling out three times, the hammer handed and the deal went through.</p><br/><p>Just when NanGong TianHu wanted to make payment, Xiao YanXue said, “Second Master NanGong, wait a moment.” NanGong TianHu then lifted his head up with a questioning gaze.</p><br/><p>Xiao YanXue then said, “Young noble NanGong was a young talent and a dragon among his peers. It was a pity that the heavens were jealous of this talent, and he passed away prematurely. The Xiao Family empathizes with your NanGong Family as well. Since the NanGong Family has already successfully bid for this item, this little lady here will make a bold decision and waive the price of the item. You can just take it as a small token from our Xiao Family. Please don’t stand on ceremony, Second Master NanGong.”</p><br/><p>NanGong TianHu couldn’t help but be stunned. He was a straightforward individual and immediately felt a wave of gratitude in his heart. The Xiao Family could have just sent the item straight to them instead of going through an auction. But if they chose to do that, there would definitely be rumors spreading about how the Xiao Family was trying to rope in the NanGong Family or that the NanGong Family didn’t have the money to buy the Soul Freezing Sandalwood. Furthermore, their NanGong Family would not accept such a huge favor for no reason either. Now that NanGong TianHu managed to obtain the Soul Freezing Sandalwood in the auction openly, it would be completely different for Xiao YanXue to give it to him now. The NanGong Family had already displayed their financial capabilities and no one would have anything to say if the item was given to them.</p><br/><p>A thunderous applause sounded from under the stage. Everyone felt that Xiao YanXue’s actions were indeed wise. Not only did she take care of the NanGong Family’s face, she made them owe her a favor as well! Furthermore, she didn’t harm the image of her Xiao Family and instead displayed the generosity of her Xiao Family.</p><br/><p>After giving a respectful bow, NanGong TianHu no longer stood on ceremony and walked off the stage with the Soul Freezing Sandalwood. At the same time, he immediately sent someone to bring it back to the place where their NanGong Family was presently residing.</p><br/><p>After Xiao YanXue witnessed NanGong TianHu walk off the stage, she displayed the proper etiquette before turning back and continuing the auction with a smile, “The second item which we are going to auction off was also found in the artic. It is a Millennium Warm Jade. This jade has a mystical function. As long as one wears it, they would not be afraid of the cold even if they were to only wear a thin shirt in the winter. If a martial arts practitioner were to wear it, it would also calm his mind and benefit the cultivation of his inner strength. The starting bid of the Millennium Warm Jade is 500,000 taels of silver.”</p><br/><p>As Ling Chen who was sitting by Ling Tian’s side heard the words, ‘Millennium Warm Jade’, her body stiffened as she clenched her fists subconsciously. She had heard Ling Tian say that this Millennium Warm Jade was definitely beneficial to her cultivation. While she knew that Ling Tian would definitely ensure that the jade landed in her hands, she was still overly anxious from concern.</p><br/><p>Apart from Ling Tian, the eyes of two other individuals lit up as well. One of them was Qian ShuiRou whom Ling Tian had been observing. The second one was someone out of Ling Tian’s expectations, DongFang JingLei.</p><br/><p>According to what Ling Tian knew, the World Defying Hidden Dragon Manual of the DongFang Family was a mystical cultivation method in the present world. It far surpassed ordinary cultivation methods and the speed of one’s improvement would also be shocking. As such, DongFang JingLei shouldn’t require this Millennium Warm Jade. But why did he reveal such excitement upon hearing about it?</p><br/><p>A voice then sounded, “600,000 taels of silver!” Ling Tian felt that the voice was familiar and turned to look. It turns out the one making the bid was the young master of the Yang Family, Yang Wei. For this rare commodity to come out at such a moment, Ling Tian would be letting himself down if he didn’t toy with Yang Wei.</p><br/><p>Ling Tian lifted up his board lazily and said in a weak voice, “600,001 taels of silver.” Ling Chen almost burst out laughing by the side.</p><br/><p>The crowd immediately broke out in commotion.</p><br/><p>Qian ShuiRou and DongFang JingLei were about to raise their boards up to make a bid. But after hearing Ling Tian’s bid, their faces changed and the hand which was holding onto the board also landed back down.</p><br/><p>Xiao YanXue only mentioned the minimum bid but she never specified the minimum increase between bids. She originally thought that the famous Great Families present here definitely wouldn’t resort to such childish pranks. Who would have thought that Ling Tian would actually give such a bid? However, he didn’t go against any rules of the auction and it was Xiao YanXue’s fault for not giving a minimum increase. As such, Ling Tian could offer a single tael above what the Yang Family offered which made everyone present extremely uncomfortable!</p><br/><p>Both Qian ShuiRou and DongFang JingLei knew that the Ling and Yang families were definitely about to argue. As such, they both fell into a dilemma. This was obviously a fight between both the families and where would they stand if they were to involve themselves in this fight. However, the Millennium Warm Jade was something which they couldn’t let go of. At the same time, they would definitely be embarrassed if Ling Tian were to increase their bids by a single tael of silver again. If they chose to give up after making a bid, not to mention their unwillingness, wouldn’t they end up becoming laughingstocks if they were to lose by a single tael of silver? But if they were to choose to fight to the bitter end, how would they have the confidence of beating this local snake who had the bulk of their wealth present in Sky Bearing? Just the methods which young noble Ling had used made a chill run down their spine. With the wealth of the Ling Family, he could definitely raise the price up to a point where either of them couldn’t bear it and then suddenly choose to give up. If they were then unable to take out the silver after making a bid, wouldn’t they become a joke? If that was the case, they probably wouldn’t be much better than XiMen Qing!</p><br/><p>Considering what he did to a great family like the XiMen Family, it wouldn’t be a surprise for him to do something like that again. While Ling Tian had the wealth to support himself, they may not be able to play so crazily with him.</p><br/><p>For the first time in her life, Qian ShuiRou felt a sense of caution towards someone.</p><br/><p>Yang Wei was furious as he glared at Ling Tian with steam rising out of his head. Gritting his teeth, he shouted out, “1,000,000 taels of silver!” In fact, Yang Wei didn’t know the true use of this jade. He only wanted to buy it to make winter more bearable. Who would have thought that Ling Tian would make a fool out of him? Thus, he no longer had a route of retreat.</p><br/><p>Ling Tian calmly grabbed the teacup which Ling Chen was handing to him and said with a smile, “1,000,001 taels of silver.”</p><br/><p>At that moment, many people present couldn’t help but burst out laughing. Yang Wei’s face turned ashen as he said, “Is young noble Ling so stingy? Are you only able to add a single tael of silver each time? Aren’t you insulting the name of your Ling Family?”</p><br/><p>Ling Tian then replied with a chuckle, “Even if I am insulting the name of my Ling Family, it is still a tael more than your Yang Family. Isn’t a single tael more still more than your bid? This young noble is already being very generous, I originally only intended to increase the bid by a copper coin. If your Yang Family were to be overwhelmed by a single copper coin, I would be really going too far.”</p><br/><p>Yang Wei snorted in anger and shouted out again, “I bid 2,000,000 taels of silver!” Behind him, his father had already covered his mouth but was a step too late. Yang Lei’s head was already filled with perspiration as he thought, My little ancestor, the Yang Family is already facing many troubles. Besides, how is the present Ling Tian someone who our Yang Family can offend? Even the XiMen Family which has hundreds of years of lineage was reduced to such a pathetic state by him. Do you really want to have a knife plunged into your chest? You aren’t even sure about the use of this piece of jade, and you want to spend millions of silver to buy it back just because of anger. If Ling Tian were to find trouble with us because of this matter, wouldn’t we have to hand it over obediently? Now that we are already facing so much trouble, why do you still have to provoke him? Even if he doesn’t seek trouble with us, would your grandfather allow you to spend millions on a piece of jade?</p><br/><p>Ling Tian let out a chuckle and said, “2,000,001 taels of silver.” Yang Wei was already angry to the point that his face was bright red in color. Just when he wanted to shout out another price, a tight slap landed on his face. Yang Wei then stood up with a face full of anger, “What a mischievous lad! Have you played enough yet? What kind of a place is this? Do you even have the rights to speak up here? A few million taels of silver for a piece of jade? To think you can even act so spoiled!”</p><br/><p>After Yang Lei taught his son a good lesson, they had also withdrawn from the competition of the Millennium Warm Jade. However, this had made Ling Tian depressed instead, especially the words spoken by Yang Lei as they also implied that Ling Tian was a spoiled brat!</p><br/><p>After Ling Tian saw that Qian ShuiRou and DongFang JingLei were attracted by the appearance of the Millennium Warm Jade, he had already predicted it to be an intense competition. However, Ling Tian didn’t want to spend too many taels of silver. After all, wouldn’t the silver go to support the Xiao Family’s army? Seeing Yang Wei jump out to make a bid, Ling Tian wanted to make use of Yang Wei’s stupidity to completely enrage him. After bringing the price up sky-high, he would be able to scare both Qian ShuiRou and DongFang JingLei away. Then, he would allow Yang Wei to purchase the jade and he would just snatch it away at a later date.</p><br/>\n</div>"}