{"title": "Chapter 275", "id": 275, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-275", "volume_title": "Volume 3", "body": "<h1>Chapter 275</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 275: I Killed HimTranslator: DavidT Editor: DavidT , Rock</p><br/><p>The depth of his martial arts was just too frightening!</p><br/><p>Ling Tian was certain that this was something that he wouldn’t be able to do now.</p><br/><p>The two people who landed from the roof were definitely experts of the XianTian realm and probably equal to Yu ManTian. At the very least, they would be elders of a Great Family. However, the green-dressed man was able to easily force them back, and Ling Tian personally suspected that the green-dressed man could probably seriously injure both of them with ease! It was just that he wasn’t being too serious back then!</p><br/><p>Furthermore, Qian ShuiRou, DongFang JingLei, and BeiMing Kong could all be said to be super experts with their subordinates being top-notch experts in the world today. However, the almost 20 of them were easily defeated by the green-dressed man alone!</p><br/><p>Furthermore, that was after he forced the two mysterious experts back! Finally, he even had the time to wave his hands and kill Yang Wei who was 150 feet away from him!</p><br/><p>This was almost legendary!</p><br/><p>Ling Tian tried to place himself in the shoes of the green-dressed man. If he were to face so many experts at the same time, he wouldn’t dare to face them head on and would definitely have to retreat. If not, he would have to use some hidden weapon techniques that this world had never seen before. Even if he could handle the experts by ambushing them with his hidden weapons, he definitely couldn’t do it as easily as the green-dressed man. As for forcing the crowd back with his inner strength, that was something impossible for him to do presently. Ling Tian didn’t believe that he could do it!</p><br/><p>As for killing Yang Wei after forcing the experts back, Ling Tian estimated that he would only be able to kill from a distance of 80 feet. But if it was 150 feet…</p><br/><p>Such strength was just too frightening!</p><br/><p>Of course, the green-dressed man was still human after all. After exchanging blows with the many top-notch experts, things weren’t that easy for him either. Especially the moment where he dashed into the sky, his face was obviously a shade of dark red. But to a top-notch expert like himself, he would easily recover from such a small internal injury in a few days!</p><br/><p>Ling Tian thought to himself, Perhaps I can only fight him after I breakthrough into the 12th stage of the Divine Shocking Dragon Formula. Now, I am far from being his match.</p><br/><p>A mournful cry suddenly sounded and Yang Lei hugged his son’s corpse with tears rolling down his cheeks.</p><br/><p>“Where is young noble Ling?” Qian ShuiRou snapped out of her daze and realized that only Ling Tian was not present. Thus, she couldn’t help but cry out as she thought in her heart, Could that mysterious expert be Ling Tian? If it was really him, Ling Tian’s strength is far too frightening! In shock, she forgot to disguise her voice and a gentle voice could be heard from her. However, everyone was still in shock, and they only looked around for Ling Tian without noticing her odd voice.</p><br/><p>“Thank you, brother Qian for your concern. This little brother is over here.” In the Heavenly Fragrance Chamber, Ling Tian’s chuckle could be heard and his relaxed figure nonchalantly walked out from the chamber. Standing outside the door, he said, “Brother Qian must really be concerned about me, asking about this little brother at the very first moment. Ling Tian is extremely grateful in my heart. Why don’t we have a good conversation tonight? We can join our beds and talk through the night!”</p><br/><p>Qian ShuiRou’s face turned red as she said with a chilly tone, “It isn’t much. As long as young noble Ling is alright, I can be at rest. I thought that young noble Ling met with a mishap and I was feeling regret in my heart.”</p><br/><p>Ling Tian laughed and said, “Brother Qian really cares greatly for this little brother. Brother Qian, with your concern towards me, I would definitely marry you if you were a lady.”</p><br/><p>Qian ShuiRou glared at Ling Tian and said with a snort, “I am sorry but I will have to disappoint brother Ling.”</p><br/><p>Ling Tian chuckled and said in a meaningful tone, “Disappointed? Hehehe.” Qian ShuiRou grunted and turned her head around. However, her fair neck was already dyed bright red.</p><br/><p>“Who? Who killed my son?” Yang Lei’s hoarse roar sounded. His gaze of despair swept past everyone present and finally landed on Ling Tian as he said hatefully, “Ling Tian! How sinister!”</p><br/><p>Ling Tian was completely speechless. This young noble is a good 300 feet away from your son. How is his death my doing? If I had that ability, I certainly wouldn’t let that green-dressed man kill your son. He is my plaything after all! While I do want to have such abilities, it is a pity that I really don’t have them!</p><br/><p>Everyone present couldn’t help but look at Yang Lei with disdain. With a single gaze, the experts present could tell that Yang Wei died from the palm strike of an expert and it was impossible for Ling Tian to be the culprit. However, Yang Lei couldn’t find the true culprit and decided to vent his anger on Ling Tian. Thus, everyone couldn’t help but look at Ling Tian, wondering how he would handle this issue.</p><br/><p>Ling Tian then said with a snort, “That’s right, I am the one who killed your son. What are you going to do about it?”</p><br/><p>As Ling Tian said those words, everyone present was dumbfounded. Who would have thought that Ling Tian would take the initiative to dump this pile of sh*t on his head! To think that Ling Tian was arrogant to the point he couldn’t even be bothered to explain himself and admitted the matter directly! At the same time, Qian ShuiRou couldn’t help but glare fiercely at Yang Lei after thinking about the matter.</p><br/><p>The only reason why Ling Tian would admit it was because he had a thought: It is time for the Yang Family to disappear. Why don’t I make use of this opportunity to create havoc!</p><br/><p>Ever since he knew that the Imperial Family had relations to Qian ShuiRou, Ling Tian already had such a thought. While the situation of the Imperial Family seemed grave, the Imperial Family was the legitimate power of Sky Bearing after all and had a powerful influence. Furthermore, the Yang Family couldn’t be too weak after accumulating their strength for so many years. With the appearance of Qian ShuiRou’s mysterious party, Ling Tian could already feel a huge pressure. If the three parties were to drop all pretense and deal with the Ling Family together, it would definitely be troublesome for him. While the Ling Family would emerge victorious, they would definitely have to pay a heavy price. This was something which Ling Tian didn’t want to see.</p><br/><p>Among these three parties, the Yang Family was the most robust party. After all, Yang KongQun had been in Sky Bearing for a few decades and had laid a powerful foundation. While Qian ShuiRou’s personal strength was powerful, she still had to rely on the Yang Family. If Ling Tian could eradicate the Yang Family, it would be akin to removing an important source of information for her! From then on, Sky Bearing would also belong to the Ling Family. No matter how powerful Qian ShuiRou was, she would be deaf and blind if she didn’t have any sources of information. A deaf and blind expert definitely wasn’t such a huge threat!</p><br/><p>Furthermore, the NanGong Family who had deep enmity with the Yang Family was also present. It would be foolish for Ling Tian to not make use of such a force! Let them fight it out first so the strength of the NanGong Family could be reduced as well. This was akin to killing four birds with a single stone.</p><br/><p>Yang Lei was also taken aback. For his son to die in front of him, Yang Lei was agitated to the point he almost went crazy. In that crazed state, he subconsciously pointed the spearhead to his son’s greatest enemy, Ling Tian. He couldn’t help but want to vent his stomach full of anger and hate on Ling Tian. However, who would have thought that Ling Tian would have admitted to Yang Wei’s death without bothering to defend himself. In that instant, Yang Lei was also at a loss.</p><br/><p>A soft cough could then be heard, “General Yang, young noble Ling is definitely not related to the death of your son. There is probably a misunderstanding behind this, and the matter should be handled carefully. If not, you would only be harming yourself and leave your enemies gloating.” As Ling Tian had expected, the one who spoke was Qian ShuiRou.</p><br/><p>A crisp voice could then be heard, “Young noble Qian isn’t right. Just like the saying, ‘one should admit to his doings’. Young noble Ling is an upright individual and would definitely dare to admit that he killed Yang Wei. Furthermore, the father of the victim had already pinpointed young noble Ling as the culprit and young noble Ling had admitted it as well. What kind of a misunderstanding can there be?”</p><br/><p>Ling Tian smiled. The one who spoke was a young lady dressed in yellow, NanGong Yu of the NanGong Family. Thinking that the NanGong Family was the murderer of her older brother, she hated the Yang Family to the bone. So, why would she not take this chance to suppress the Yang Family? Besides, regardless of what the truth was, the NanGong Family treated Ling Tian’s admittance to a signal for them to deal with the Yang Family. What was the purpose for their NanGong Family to come to Sky Bearing? Afraid that NanGong TianHu didn’t know what to say and would cause them to lose this opportunity, NanGong Yu took the initiative to step out and aid Ling Tian.</p><br/><p>Her motive was simple: the Ling and Yang families must fight today. It would be even better if Ling Tian could kill Yang Lei on the spot. At that time, there would be no turning back for both their families and it would be extremely beneficial for their NanGong Family’s revenge!</p><br/><p>“Everyone here knows that young noble Ling was at least 400 feet away from young noble Yang when the murder happened. Furthermore, young noble Yang died from the methods of a top-notch martial arts expert. How could young noble Ling be the culprit? If young noble Ling had this ability, wouldn’t he be the number one expert in the world?! Miss, please don’t be unreasonable and turn right into wrong. Is Miss trying to instigate a war between the Ling and Yang families? Miss NanGong Yu of the NanGong Family!” Qian ShuiRou said coldly.</p><br/><p>“Can young noble Ling be irrational to the point he would admit to killing someone if he wasn’t the culprit? How would you know that young noble Ling does not have such abilities? After all, you are not young noble Ling himself! Sir, you are the one who is trying to turn right into wrong!” NanGong Yu didn’t back off in the slightest and proclaimed loudly, “Can I ask the heroes present here today a question! Would any of you be willing to admit to something you never did?”</p><br/><p>Everyone present looked at each other and shook their heads together. Looking at the both of them quarreling, everyone else was completely bewildered. Before the two parties who were involved in this incident said anything, these two fellows had actually jumped out to argue with each other.</p><br/><p>The present scenario is truly odd. One party was trying to help defend Ling Tian while the other was trying to justify that Ling Tian was the murderer. However, the one trying to defend Ling Tian was Qian ShuiRou who was obviously Ling Tian’s enemy! Furthermore, the one trying to justify that Ling Tian was the murderer was NanGong Yu who was in alliance with Ling Tian!</p><br/><p>Everyone present couldn’t help but find this matter to be truly strange.</p><br/><p>“Cough cough.” DongFang JingLei let out two dry coughs and said, “At this present moment, it is difficult to determine who is in the right and wrong. The most important thing to do now would be to let young noble Yang return to his roots and enter the soil in peace.” As he said that, DongFang JingLei’s face turned red as he felt that his words were almost completely nonsensical.</p><br/><p>Yang Wei was from Sky Bearing and now that he passed on in Sky Bearing, why was there a need for him to return to his roots. As for entering the soil in peace, that was completely nonsensical. How could the burial of the successor to a Great Family be handled so casually?</p><br/>\n</div>"}