{"title": "Chapter 278", "id": 278, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-278", "volume_title": "Volume 3", "body": "<h1>Chapter 278</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 278: Digging a New WellTranslator: chuchutrain Editor: DavidT , Rock</p><br/><p>After the first exchange, Ling Tian suddenly pulled out a weird posture in midair: Waist bent, legs in a hooked shape and his hands outstretched in the same striking position as earlier. His entire body seemed to have turned into a bow, spinning like a pinwheel. He actually didn’t land down, instead rising up once again, even higher than his previous altitude!</p><br/><p>From the side, Yu BingYan astutely saw Ling Tian’s hands and legs facing the same direction, forming a sort of ellipse, and using the force generated by his muscles, he propelled himself up once again. In midair, he took on the same stance of feet up, hands down, and like a shooting star rushed down towards Yu ManTian!</p><br/><p>The exact same move, but with added momentum into the equation!</p><br/><p>A fiery and passionate gaze could be seen from Yu ManTian’s eyes. With a loud shout, he rushed upwards to meet him, both of his hands above him as he leaped upwards to face Ling Tian head-on. The exact same move, Three Palms Supporting The Heavens! This was because Ling Tian’s unique skill locked onto Yu ManTian’s current position, and only the abstruse and profound Three Palms skill could counter his move!</p><br/><p>Of course, if one didn’t care about their identity, they could curl themselves up and roll out of his range. However, Yu ManTian was a reputable XianTian realm expert, with his own pride. How could he do something so shameless?</p><br/><p>“Hong!” Another earth-shattering sound enveloped the area. Ling Tian’s courtyard looked as though it were grass in the midst of a typhoon, with their surroundings being swept away. The dirt on the ground rose up into the air, forming something similar to a dust devil. With the sun high up in the air, the light filtered through, turning the whole scene into a hazy patch of yellow!</p><br/><p>Yu ManTian’s tall and sturdy body shot even quicker down towards the ground this time. He even landed at the exact same spot, on the exact same two legs, without any change in position! With a ‘pu’ sound, half of his body entered the ground, leaving only his waist exposed. What a tyrannical palm strike with frightening strength from Ling Tian!</p><br/><p>Yu ManTian let out a howl of anger, slapping his hands on both sides of the ground, and relying on the counterforce to propel himself out of the ground. He knew that he was already at a disadvantage, and thus immediately reacted to jump out of his current position. However, he had barely done so when he felt a gust of wind above his head. Ling Tian’s third palm strike was already hurtling towards him! Yu ManTian had the impression that the weight of the entire sky was behind Ling Tian this time as he ruthlessly slapped down!</p><br/><p>This time, there was no margin for escape. Even if he was willing to throw away his face to roll out, it wasn’t possible. Yu ManTian gathered whatever pathetic shreds of his energy left, and let out a weird inhuman growl as he lifted up his hands for the third time to meet Ling Tian!</p><br/><p>The strike this time could be said to be the strength of the first two strikes added together! Before they came into contact, Yu ManTian already felt a stinging pain on his palms, as though the winds were cutting into him! Three strikes and Ling Tian’s body actually hadn’t even touched the ground once! He was just like the great eagle, unfurling his wings and soaring freely through the skies, striking again and again!</p><br/><p>This was a self-created skill after Ling Tian had achieved the Ninth layer of his Divine Shocking Dragon Formula: Combat Eagle Nine Revolutions! By congealing a breath of true energy, then jumping up and using the momentum gained from height to attack, every move of this skill included the essence of all his body techniques. When the opponent retaliated, the user would then make use of his force to further increase their strength! With every retaliation, each attack would be significantly stronger than the last strike, and at the ninth strike, the strength would be equivalent to more than five times the strength of the first!</p><br/><p>However, the only disadvantage of this skill was that it could only be used against someone of the same standard as the user. If the opponent was too weak, there wouldn’t even be a need for a second blow, and because of the successive hits, one couldn’t give their all for the first strike. Against a stronger opponent, if one didn’t give their all, then how would they be able to survive unscathed?</p><br/><p>“Hong!” Another explosive sound once again! Ling Tian floated like a kite, slowly landing on the ground. With a sweep of his robes, all the dust was swept aside by him, revealing… a blank area. Third Master Yu was nowhere to be seen!</p><br/><p>Ling Tian let out a smile, stroking his nose in satisfaction before heading off to his own room.</p><br/><p>“Where’s my third uncle? Why is he gone?” Yu BingYan was in a panic. The battle just now, how was it comparing notes? It was just like a matador bullfight! Before she could even see what happened, Ling Tian had beat Yu ManTian till he disappeared! Just what was going on?</p><br/><p>“Oh…” Ling Tian came to a halt, “Third Master Yu really is deserving of respect, he even knows about the 72 Divine Transformations! Right now, he is probably a pangolin, already frolicking deep within the earth!”</p><br/><p>“You’re the pangolin, you B*ST*RD!” From deep within the earth came a furious bellow. It sounded like Third Master Yu, but with a depressed tone.</p><br/><p>Only then did Yu BingYan discover that a mysterious hole had appeared out of nowhere, that resembled a well, but also a cave…</p><br/><p>Could it be that her third uncle was inside? Why did he dig a hole and bury himself in it? Could it be that he had time during the intense battle to do such a thing?</p><br/><p>During the battle of the Tians, with her current abilities, she could only see the first blow, after which her vision was obscured by all the flying dust. She could only see Ling Tian soaring to the sky after every strike, but was unable to see what her uncle was doing. Even Ling Chen was only able to get a rough gauge of the scenario.</p><br/><p>Yu BingYan trotted over to the mouth of the ‘well’ and bent over to look at it. Strangely, she found a tuft of black grass moving about inside and got a huge shock.</p><br/><p>With a ‘pu’ sound, Yu ManTian extricated himself from the dirt, leaping out looking totally bedraggled. He spat out a clump of dirt as his eyes swiveled around, trying to find the location of Ling Tian.</p><br/><p>Yu BingYan sized up Third Master Yu climbing out of the deep pit, and unconsciously took in a deep breath of cold air. Her mouth was open wide in shock.</p><br/><p>The pit that was dug out by ‘man’ was actually more than ten feet deep! The soil at the bottom was surprisingly moist, as though water was seeping out. A rich earthy smell wafted out from the mouth, and if one were to continue digging downwards for a few more meters, there might actually be a new source of well water!</p><br/><p>A fight between two people actually led to the digging of a new well!</p><br/><p>Yu BingYan found it surprisingly shocking yet funny!</p><br/><p>Truth be told, right after the fight, Ling Tian had walked a few times around this hole, and felt that this was actually the perfect place to shape up a new well. As such, he had plans to call up a few artisans and get them to open up a new well here. He was even planning to name it the ‘Third Master Well’, such that Yu ManTian would get fits everytime he saw this blasted thing!</p><br/><p>All family members of the Ling family knew that their land was situated on a dry and hard piece of earth. However, the depth of it was at most little over a meter, and when Yu ManTian and Ling Tian exchanged their first two moves, they had easily broken through this hard earth. The third strike of Ling Tian had actually then sent Yu ManTian deep into the earth, instead of wounding him!</p><br/><p>“Where’s that gigolo?!” Yu ManTian didn’t seem any worse for wear, hollering with a black face, “Little gigolo! Get out here for this Third Master! The winner of this battle hasn’t been decided, and you want to run?!”</p><br/><p>The winner hasn’t been decided? Yu BingYan and Ling Chen couldn’t help but giggle. You’ve already been knocked down into the earth like a nail, and you want to talk about settling who is the victor?</p><br/><p>This couldn’t be blamed on Yu ManTian as well. Ling Tian chose the perfect time to attack the third time when Yu ManTian was halfway from extricating himself from the pit. As such, he could only divert half his strength to block Ling Tian, which resulted in this current state. However, if this was a life-and-death battle, then with his experience, Yu ManTian would then have used some movement technique such as his Eighteen Somersaults of the Swallow to escape from the space lock, and there wouldn’t have even been a third strike from Ling Tian, let alone knocking him into the earth! While Third Master Yu’s cultivation might not be as profound as Ling Tian’s, he definitely wouldn’t lose just after three exchanges!</p><br/><p>Yu ManTian screamed and raged without stopping, making a ruckus until Old Madam Ling rushed over, persuading him to go over for a cup of tea. Before leaving, Third Master Yu cleared his throat and shouted, “Little brat, how dare you take liberties with this Third Master’s niece. I’ll come back to settle the score!”</p><br/><p>Now that he finally got a chance to battle with Ling Tian, how could it let it go? However, he didn’t realize that this one sentence of his threw his niece’s face all out of the window…</p><br/><p>Ling Tian strolled into his study, feeling overjoyed with the process of the battle just now! While it was only three strikes, it was the ultimate way of how a man to man brawl should be fought! Even Yu ManTian himself secretly felt delighted.</p><br/><p>Upon opening the jade box which DongFang JingLei had gifted him, Ling Tian felt a second wave of elation. It was indeed a perfectly formed blood-red ginseng, with even the roots intact, and even the beard whiskers clearly defined. This was actually a millennium old Blood Ginseng that had taken on a human shape!</p><br/><p>The Blood Ginseng was naturally a spiritual treasure of heaven and earth and would only have a chance to form in a place full of ginseng plants. While its effects were ordinary in the first thousand years of its lifespan, when its leaves were still intact and the rhizome not formed, it was a completely different matter after a millennium! After a thousand years, the leaves would wilt and the rhizome would form as the ginseng began to take on a darker red. After tens of years, the blood-red color would then appear and only then could it be considered a Blood Ginseng! At that time, it could already be considered a spiritual treasure. As for the current Blood Ginseng, Ling Tian estimated that it wouldn’t be possible for such a look to appear without a good three to four thousand years!</p><br/><p>In his original plans, Ling Tian only aimed to produce Great Cyclic Pellets with the ability to raise one’s cultivation level by five years at the maximum. Now, with the Ice Fire Lotuses as well as the Blood Ginseng, Ling Tian expected the prowess of his Great Cyclic Pellets to raise one’s cultivation by no less than twenty years!</p><br/><p>He laughed delightedly, lifting up the Blood Ginseng as though he was carrying his newborn child. He then informed Ling Chen that, no matter what, no one would be allowed to disturb him. After passing down some instructions, he then rushed into his secret chamber and isolated himself.</p><br/><p>Now that all the various herbs were gathered, Ling Tian didn’t want to wait for even a second longer. It was time for the Great Cyclic Pellet to make its appearance!</p><br/>\n</div>"}