{"title": "Chapter 295", "id": 295, "volume": 3, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-295", "volume_title": "Volume 3", "body": "<h1>Chapter 295</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 295: UnexpectedTranslator: chuchutrain Editor: DavidT , Rock</p><br/><p>The next day, Ling Family Courtyard.</p><br/><p>Ling Tian coldly stared at Ling Jian, seeing him lower his head in guilt.</p><br/><p>Ling Jian originally thought that he would receive a punishment for acting out of line yesterday, but surprisingly it was delayed until the next day.</p><br/><p>Ling Tian coldly stared at him for a while, before speaking, “Chen’er, go and spar with Ling Jian. I want to see which stage the two of you have reached. Both of you are to give it your all, I expect no leniency.”</p><br/><p>The moment he finished speaking, looks of ecstasy appeared on the faces of the other seven present! Ling Chi’s group of five was actually here to make up the numbers, and Ling Jian could be said to be practically soaring in happiness. As for Ling Chen, after consuming the Great Cyclic Pellet, she was already itching for a battle a long time ago.</p><br/><p>Ling Tian indifferently added, “Ling Jian, I allow you to use your sword!”</p><br/><p>Ling Jian paused in shock. While Ling Chen’s skill and movement techniques were above his, the moment he used the sword, he would be brimming with killing intent, his prowess more than doubled. How could Ling Chen take it? He slowly replied, “Use my sword? Is there really a need for that?”</p><br/><p>Ling Jian also had his own considerations. Previously during the battles between Yu ManTian and the five Ling brothers, Ling Jian had always stayed hidden. However, his contact and experience had still grown by a large margin, and if he were to pit himself against Yu ManTian once again, a victor could probably only be decided after a few hundred moves! When compared to Ling Chen who had always been following their young noble, while her martial skill was strong, she rarely took action. Thus, compared to his killing skills, if he couldn’t draw back on time, he would probably end up hurting Ling Chen!</p><br/><p>Seeing that Ling Jian was looking down on her, Ling Chen indignantly replied, “Jian Jian, you should use your sword. Or else, you will not be satisfied when you lose later!”</p><br/><p>Ling Jian had on an expression full of suspicion, where did Ling Chen’s confidence stem from? The last few years when they had sparred, if not for him holding back, she would be on the ground looking for her teeth!</p><br/><p>Ling Tian lightly patting Ling Chen on the shoulder as he encouraged her, “Chen’er, rest assured and fight. Your mission today is to beat Ling Jian up till he looks like a pig’s head. If you don’t complete your task, then there will be no dinner tonight.”</p><br/><p>Ling Jian laughed out loudly, “Lass Chen, looks like you will go hungry tonight!”</p><br/><p>Ling Chen, however, gave a shallow smile, “Jian Jian, let’s see who will go hungry tonight!”</p><br/><p>Ling Jian was pleased as punch, sniggering, “What’s there to see? These last few years, have you ever once truly won against me? Haha, stop joking. I’ve also had some minor breakthroughs during this time. If you lose, don’t say that I’m bullying you!”</p><br/><p>However, things turned out to be completely different!</p><br/><p>The moment they started, Ling Jian felt something amiss! Ling Chen’s palms carried with her a frigid wintry pressure, which was cold enough to make him feel like he was in an icebox on this hot summer day! As the two of them fought, their surroundings began to be covered with a layer of clear ice! On a hot summer day! Furthermore, it continued to persist there! Ling Jian began to suspect something, since when did the skill of this lass increase by so much?</p><br/><p>When he was disarmed by Ling Chen and fell to the ground in a semi-frozen state, he was inwardly crying. In order to avoid harming Ling Chen, he didn’t use any of his killing moves, but even if he had used them, there might not have been an effect, seeing how frenzied she was today. What sort of steroids did she eat today?!</p><br/><p>He had indeed guessed it correctly, wasn’t this frenzied Ling Chen a result of her consuming drugs?</p><br/><p>As he was being pummelled by Ling Chen, his intestines were going green with regret at not having sent the five Ling brothers to another place beforehand. Now how was he going to maintain his prestige amongst the five of them?!</p><br/><p>In the end, Ling Jian lay down on the ground groaning, lacking even the energy to stand up…</p><br/><p>Ling Chen indeed didn’t let Ling Tian down. Right now, if anyone were to see this scene, they wouldn’t recognize that Ling Jian was the sparring partner of Ling Chen! Ling Jian’s fame had plummeted to rock bottom in just a matter of hours. But Ling Chen was already very considerate, not even harming any of his bones, but in return bruising every single inch of his muscles. If one were to take a cursory glance, they would see that Ling Jian’s head had somehow grown larger by a size, and his pretty boy face could actually replace a pig’s face!</p><br/><p>“Young noble, my mission has been completed.” Ling Chen delightedly walked back to Ling Tian’s side, giving off a sweet smile. However, the five Ling brothers looked as though they had seen a demoness, all of them possessing faces white as milk, and unconsciously taking a few steps back. No one here was unaware of Ling Jian’s true prowess, but Ling Chen actually didn’t need much strength to beat Ling Jian up to this state! Wasn’t this skill on par with Yu ManTian already?</p><br/><p>“Hmm… barely passable.” Ling Tian nodded his head, but with some hesitation. “He has still a ways to go before becoming a pig’s head. The ears are not big enough, and the nose not long enough either… haiz, at least the mouth has some resemblance. Forget it, I can consider it as a pass.”</p><br/><p>Ling Chen pouted in response, hatefully glaring at Ling Jian who was lying on his back, lamenting about the fact that his ears were so small, and his nose was so short. To think that he almost cost her the success of her mission.</p><br/><p>“Young noble…” Ling Jian slowly crawled up, opening his swollen eyelids and speaking in an unclear manner, “Young noble is being biased! Why has lass Chen suddenly improved so quickly?!” Now he had finally realized that Ling Chen’s startling growth could only be because of using medicines and it definitely had to be Ling Tian’s Great Cyclic Pellet that had done the job!</p><br/><p>The matter on the Great Cyclic Pellet, the fewer who knew of it the better. Even Yu BingYan only knew it as a form of medicine to cure her illness, and nothing else. The only people who were aware of its true properties were Ling Tian, Ling Jian, and Ling Chen. After all, such a heaven-defying medicine was bound to set off a lot of waves if word spread about it. It might even lead to people trying to steal the medicine. Thus, after long consideration, Ling Tian decided that the effects of the medicine should never be divulged.</p><br/><p>Ling Tian snorted and meaningfully stared at him, whispering in his ear, “This is the consequence for what you did yesterday. Are you happy with it? Hmph, if there’s a next time, it would mean that Ling Chen is not doing her job well, and I’ll be the one sparring with you.”</p><br/><p>Ling Jian immediately trembled, an expression of fear on his face. Ling Chen had sent blows to practically every part that had flesh on him, and Ling Tian had said that she was not doing her job well?</p><br/><p>Ling Tian drew out a jade bottle from his bosom, pouring out six pellets before putting them in Ling Jian’s hands, instructing, “I want you to go into closed-door cultivation, and after cultivating for thirty-six hours, take one of these. Remember, only one. If you take more than that, you won’t have any body left to speak of! When you have finished absorbing the medicine, give the other five one each and guard them. There’s no margin for failure, am I clear?”</p><br/><p>Ling Jian was overjoyed, taking the Great Cycling Pellet with his hands and holding it tightly in one hand. He thought, If the six of us can improve like how Ling Chen did, then the First Pavilion will turn into the number one assassin organization overnight!</p><br/><p>Ling Tian walked off, he suddenly paused as though he recalled something, saying, “Before you give it to them, you need to do what Ling Chen did to you: loosen all their muscles. This is to ensure that the medicine is more easily absorbed.”</p><br/><p>Ling Jian paused in shock, then a weird smile began to form on his face. Glancing at the five of them standing at the corner looking at him in schadenfreude, he slowly clenched his fists, and the crackling of his knuckles could be heard.</p><br/><p>Finished with his preparations, Ling Tian commanded Ling Chi, “Bring me to Ye BaiFei.”</p><br/><p>In a secret chamber.</p><br/><p>“How was Brother Ye been?” Ling Tian smiled as he sat down, Ling Chen standing behind him.</p><br/><p>“Ling Tian, you place this Ye here, but you don’t take any action. What’s the meaning of this?” Ye BaiFei looked to have recovered quite a bit, the obvious sign of the care he received in the Ling Family Courtyard. Other than the fact that his inner qi had been sealed, he lived just like a normal person, albeit one without freedom.</p><br/><p>“Brother Ye has extraordinary martial skills and bravery that surpasses normal men. Ling Tian admires you.” Ling Tian sincerely spoke. “My purpose this time is to settle everything with you. You can decide whether to be killed or to be let go!”</p><br/><p>A cold smile surfaced on Ye BaiFei’s bloodless face. “Settle scores? Whether you kill or let me go, does it matter?”</p><br/><p>Ling Tian stood up as he replied, “I’m now lacking capable people, and I hope that Brother Ye can consider forming an alliance with me, to aid me in my accomplishments. If Brother Ye can agree, not only will I be endlessly thankful, but you will also regain your freedom.”</p><br/><p>Ye BaiFei smirked, “If this Ye doesn’t agree?”</p><br/><p>Ling Tian inwardly sighed, he had already realized what Ye BaiFei’s inner attitude was, and couldn’t help but find it a pity.</p><br/><p>He could only heavily answer, “There’s no point in me lying to you. Brother Ye, if you don’t agree, I’m no saint either, and will not leave you out alive. May Brother Ye please reconsider.”</p><br/><p>Taking two steps forward, Ling Tian solemnly continued, “Brother Ye, you should know that I’m not trying to use your life to blackmail you. I’m just telling you a fact. At our realm, it would be childish if we were to use life and death to attempt to blackmail someone. As such, this is a choice for you, and the only difference is that it’s one where you have to play with life and death!:</p><br/><p>Ye BaiFei laughed out loud as he replied, “Yes, that is indeed a childish choice for me!”</p><br/><p>However, Ling Tian didn’t get angry, instead a flash of pity appeared in his eyes! Ling Tian highly viewed such people who didn’t blink even when at death’s door, but if such a person was his enemy, then he would definitely end him before anything could happen! Because such people, if given the chance, could deal irreparable damage to him!</p><br/><p>A brief silence followed before Ling Tian spoke once again, “Brother Ye, you still have not answered me. What are your thoughts? Please seriously reconsider, there’s no turning back!”</p><br/><p>Ye BaiFei only looked at Ling Tian calmly. “Young noble Ling, the only reason why I haven’t silenced myself until now is that I have been waiting for this day.” His eyes bore the look of a person who viewed death as nothing but another end and continued with a hint of reminiscence in his eyes, “This Ye could have ended his life anytime. I was waiting for young noble to come so I could ask this: That day when I was captured, did you give out the order?”</p><br/>\n</div>"}