{"title": "Chapter 317", "id": 317, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-317", "volume_title": "Volume 4", "body": "<h1>Chapter 317</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 317: Crazed MassacreTranslator: DavidT Editor: DavidT, Rock</p><br/><p>The saying, ‘The fame of a general is built on 10,000 lives’, only refers to the commander leading his troops in battle. While it wasn’t anything extraordinary for 10,000 men to die in battle, it was impossible for all 10,000 of them to be killed by the general alone! That was the combined efforts of the whole army! It didn’t refer to a single person killing 10,000 people!</p><br/><p>However, Ling Tian was already on a completely different level! He had gone against everything they knew! After charging in and out of the 400,000 man army, thousands of people had already perished under his guandao! But from his calm and chilly gaze, he didn’t seem the least bit affected by the result in front of his eyes. Every step he took was still steady and without hesitation. Every time he brandished his weapon, he did it heartlessly without any mercy!</p><br/><p>This was a bloodthirsty devil! Wei ChengPing and Shui QianHuan were the ones who summoned this bloodthirsty devil, but were unable to send him away!</p><br/><p>“This person… definitely isn’t human! He definitely isn’t human!” Looking at the maniacal Ling Tian, the blue-robed elder wanted to make a comment about Ling Tian. However, he realized that there were no other words to describe this crazed devil in front of him. After pausing for a long while, he finally gave the verdict of Ling Tian not being human!</p><br/><p>The moment he said those words, all the other blue-robed elders nodded their heads in agreement! At this moment, all of them had the same thought in their heads!</p><br/><p>The arrows were like a swarm of locusts, raining down from above! In the Northern Wei army, the soldiers surrounding Ling Tian let out groans of shock and disbelief. There were many who looked back at Wei ChengPing in incredulity, only to see the many archers firing their arrows and waves of arrows coming their way! At that moment, their morale was completely destroyed!</p><br/><p>“Arrows? What b*st*rd ordered to fire the arrows?!”</p><br/><p>“F**K HIM! This daddy is still here facing the enemy! Who is the b*st*rd who ordered to fire the arrows?”</p><br/><p>“Aiyah! I’ve been hit… scumb*g!”</p><br/><p>“Wei ChengPing! You son of a b*tch! This daddy is giving my life for Northern Wei, and you actually fired an arrow into my back! Ah…”</p><br/><p>By Ling Tian’s side, arrows rained down on both ally and enemies! A commotion broke out immediately!</p><br/><p>Ling Tian brandished his weapon and a barely visible layer of silver light covered him, protecting himself within it. Any arrow which came into contact with this ball of silver light would be repelled without exception, landing back into the Northern Wei army! At the same time, Ling Tian did not slow down as he continued his massacre! Such densely fired arrows were actually unable to slow Ling Tian down for even a moment!</p><br/><p>Ling Tian’s lips then curled up in a cruel arc as he roared, “Northern Wei soldiers, your master, Wei ChengPing, has abandoned all of you! He is ordering for all of you to be shot! Hahaha, don’t you guys feel disappointed?”</p><br/><p>Ling Tian did not stop moving as he talked, with his weapon reaping the lives of the Northern Wei soldiers, “Do you guys find it worth to give your lives for such a master? Will the hot blood of soldiers perish under the hands of your own allies? Hahaha, what a joke! What a pitiful and desolate Northern Wei army! I don’t understand why you guys are fighting so hard for! Just so your master can shoot you guys in the back?” As he said the last few words, he purposefully circulated his inner qi and projected his voice across the whole battlefield!</p><br/><p>“You are lying! Ling Tian, stop bullsh*tting! No matter what kind of flowery words you say, you will only be wasting your breath!” The one who was talking was a Northern Wei general. After he had said those words, his face was completely red and his eyes were filled with grief!</p><br/><p>“I am bullsh*tting? Wasting my breath? Then why are you crying?! My Northern Wei brothers, turn around and look at who is shooting at all of you! Our Sky Bearing army is right in front of your eyes, could our arrows possibly make a u-turn in mid-flight? Your army is more than 10 times that of ours, do you really think we would have the time to shoot arrows?” Ling Tian burst out into laughter.</p><br/><p>Many Northern Wei soldiers turned around and looked at the arrows raining down upon them. By their sides, many of their brothers were injured by the arrows with mournful cries sounding constantly! Everyone could not stop their bodies from trembling! There were many soldiers who began to cry as their felt their bodies turn cold!</p><br/><p>This was definitely not fear. Since these men came to the battlefield, they were extremely clear that they may die on the battlefield. However, now that their own forces had the upper hand, why was there a need to sacrifice their own troops?! Were their lives just so worthless in the eyes of the Northern Wei rulers?</p><br/><p>What was the point of them spilling their blood? What was the point of them fighting on the battlefield? What was the point of them sacrificing their lives? What was the point of their undying loyalty?!</p><br/><p>It was for Northern Wei! It was for the emperor! It was for them to lead a comfortable life in the future! It was for them to provide for their families! However, such a master! Such a future emperor! Could they even look forward to receiving anything from him?</p><br/><p>To think that he was able to order the death of his troops fighting valiantly on the front lines for him! Furthermore, he gave the order when they were engaged in a bitter battle with the enemy! Just what could he give them? Promotions? Fame? Wealth? What was the point of these if they did not even have their lives?</p><br/><p>In that instant, the whole battlefield became silent!</p><br/><p>Ling Tian burst out into laughter as he charged forward, “My Northern Wei brothers, let me help all of you to take your revenge! Open up a path, and I will slaughter this heartless and inhumane Crown Prince of yours! I will help all of you vent your anger!”</p><br/><p>“Ling Tian, stop deluding the soldiers! The Crown Prince clenched his teeth and gave such a heart-wrenching order to wipe out a devil like you! If not, should we allow a devil like you to destroy our Marshal’s flag?” Shui QianHuan shouted, “The Northern Wei Crown Prince has ordered: Anyone who blocks Ling Tian will be awarded 2000 taels of silver! The brothers who died under the arrows will be rewarded with the title of ‘Country Protecting Hero’! Their families will be given 2000 taels of silver! We will not be selfish! Fellow warrior, for Northern Wei and for your families! Crown Prince ChengPing gives his thanks to all of you! As the warriors of our Northern Wei army, the time has come for you to fight for the empire! Fellow warriors, the one who can kill Ling Tian will be rewarded with 20,000 taels of gold and be made a marquis! Kill!” Shui QianHuan’s cultivation was not weak either and his voice covered the battlefield!</p><br/><p>Ling Tian was startled in his heart as he looked at Shui QianHuan with a solemn gaze. To think that this brat is able to make such a quick decision to raise the morale of the troops in such a situation. He is definitely a rare talent!</p><br/><p>Wei ChengPing also snapped out of his daze, looking towards Shui QianHuan with gratitude. However, Shui QianHuan did not even spare him a glance. Then, Wei ChengPing also began to shout, “The one who kills Ling Tian will be rewarded with 20,000 taels of gold and be made a marquis! This Crown Prince swears that I will not go against my words! If not, I will die a horrible death!”</p><br/><p>From the encouragement of both Shui QianHuan and Wei ChengPing, the originally desolate Northern Wei soldiers were ignited again. They then began to shout out together, “Kill Ling Tian! Kill this vile beast! Kill Ling Tian! Kill this vile beast!”</p><br/><p>With the short hesitation of the Northern Wei soldiers previously, Ling Tian had already grasped that opportunity to close the gap by another 100 feet! Now, he was already in the center of the Northern Wei army as he roared with a sinister smile, “My life is here! Who dares to take it?!” His guandao then turned into a mini propeller, as he spun it around in the Northern Wei army like a spinning top!</p><br/><p>In just an instant, Ling Tian’s surroundings were turned into a sea of blood! Many heads flew up into the sky! Men were shouting everywhere with horses neighing in panic! Like a ferocious tiger, he continued to make his advance! He was less than 300 feet away from Wei ChengPing and Shui QianHuan!</p><br/><p>Shui QianHuan’s expression was solemn as he said with a mellow tone, “Third Elder, it seems that you will have to take action for us to stop him!”</p><br/><p>A bearded blue-robed elder then took a step forward and said with cupped fists, “Rest assured young noble, we will definitely try our best!” His words were filled with the solemnness of a general who knew he wouldn’t return from battle!</p><br/><p>Shui QianHuan was startled in his heart, Third Elder only said that he would try his best! It seems that they do not have the confidence to fight Ling Tian! Just what kind of strength does Ling Tian have?</p><br/><p>The Northern Wei was still filled with turmoil, and the eight blue-robed elders had already appeared at the front of the army! Without a single sign, a long sword had suddenly shot towards Ling Tian’s guandao like lightning, with powerful inner qi bursting forth from the sword! Ling Tian suddenly felt his propellor movements to be blocked, and he knew that an expert had arrived! Looking up, he saw the body of a blue-robed elder flying away with blood in his mouth!</p><br/><p>This elder was definitely no weaker than the Zheng elders under Shui QianRou’s command and he should not have been sent flying from a single attack. However, this blue-robed elder had already been frightened by Ling Tian’s killing intent and showed signs of retreat before the battle even began. Furthermore, he had launched his attack when Ling Tian’s killing intent was at the peak, and his weapon couldn’t be compared to Ling Tian’s Seven Star Azure Dragon. The combination of these many factors had resulted in him losing to Ling Tian in a single exchange, suffering serious injuries!</p><br/><p>Ling Tian burst out into laughter as he said with a sinister tone, “Water of Heavenly Wind! You guys are the ones who took the initiative to provoke me! You guys are seeking your deaths! If I want someone to die at 3 am, it will be impossible for him to live past 5 am!” The remaining seven blue-robed elders were experts after all. Regaining their composure, they drew their swords and charged at Ling Tian without a single word!</p><br/><p>Behind Ling Tian, a few figures appeared mysteriously and Ling Jian, Ling Chi, Ling Feng, Ling Yun and Ling Thirteen dashed forward as well! Like five tigers leaving the mountain, they took on a blue-robed elder each!</p><br/><p>Their sudden intervention in the battle was completely out of the expectations of the blue-robed elders! After Ling Tian unleashed his massacre on the battlefield previously, he had drawn the attention of the whole army! Thus, the Shui Family experts never expected another five top-notch experts to be hidden in the Sky Bearing army! Furthermore, their concentration was all focused on Ling Tian and thus became flustered when clashing with the five Ling experts!</p><br/>\n</div>"}