{"title": "Chapter 312", "id": 312, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-312", "volume_title": "Volume 4", "body": "<h1>Chapter 312</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 312: Another OrioleTranslator: DavidT Editor: DavidT, Rock</p><br/><p>He indeed had luck, just that it was extremely bad luck! However, he should also feel honored for having the Pavilion Head of the First Pavilion kill him personally!</p><br/><p>The thoughts of the commander ended there! The number one assassin of the First Pavilion, Ling Jian’s spear was like a speeding meteor, with the spear already embedded within the commander’s chest when the other soldiers could only catch a glimpse of it! The strong propulsion of the attack had lifted the commander into the air and pinned the commander to a tree off to the side.</p><br/><p>The commander was no longer breathing as his body hung loosely on the spear, swaying slightly in the wind. Only then did the blood begin to flow out of the wound, dripping on the ground.</p><br/><p>Looking at the direction that the five men had sped away in, the Sky Bearing soldiers were filled with fear as their bodies trembled with their legs buckling from the pressure. There were many of them who fell on their butt and some others who began puking…</p><br/><p>*****</p><br/><p>Ling Xiao felt his whole body turn cold!</p><br/><p>The heavens want my death!</p><br/><p>The harsh reality was right in front of them, and this brutal reality had destroyed every last bit of hope in this Sky Bearing’s God of War!</p><br/><p>After such a long journey of escape, the troops were already about to collapse from their fatigue. Now that they were finally at the One Line Ridgeline, they had thought that hope would be right before their very eyes! However, they were devastated to realize that the so-called hope was actually the gates to hell! There were 100,000 elite troops there to receive them!</p><br/><p>A full 100,000 strong army of elites were waiting there for them!</p><br/><p>As a gust of wind blew past, the neatly arranged army flags fluttered neatly in the wind. Beneath the flags were neatly arranged enemy troops with their blades gleaming in the sunlight! The overbearing killing intent made the Ling army feel breathless!</p><br/><p>There were a full 100,000 soldiers blocking their way! Their armor glistened in the sun with a solemn and imposing manner. They were obviously well-trained troops who had been through countless of battles as well!</p><br/><p>This was an irresistible form of pressure; with the current state of the Ling army, how could any of them endure such pressure? If it was yesterday, they would definitely be able to endure such pressure and would not even treat it as a problem!</p><br/><p>Yesterday, the Ling army was also 100,000 men strong, and they were also the elites of the elites!</p><br/><p>But today, they were already in a state of disarray! Thirty thousand soldiers had left with the traitors and only 20,000 were left after breaking through the encirclement. The ones who were left were all riddled with injuries and had traveled a long journey to get here. Both horse and men were fatigued and without much combat prowess left! Even the bows and arrows were almost all used up with most of their equipment damaged. Now, they were in another desperate situation with mountains by their side and elite troops in front of them. Behind them, the sound of galloping horses was slowly approaching with 300,000 enemy troops coming from their back!</p><br/><p>How would they fight this battle?</p><br/><p>“General Ling, it has been a long time!” A horse’s neigh sounded from the enemy’s troops and a middle-aged general emerged from the neat formation. With a smiling face, he gave a greeting to Ling Xiao.</p><br/><p>“It’s you!” Ling Xiao’s eyes narrowed, “Han TieXuan, to think that your Western Han had taken part in this scheme as well! What a great plan! Great scheme!” Ling Xiao had already seen the fact that their enemy forces in front of them were flying the Western Han flags. They were his old rivals!</p><br/><p>Han TieXuan burst out into laughter with delight all over his face, “Ling Xiao, you never imagined such a day to come right? The most treasured lackey of Long Xiang was betrayed by your master! You must be feeling miserable in your heart right? Hahaha, no need to feel too sad, I really understand your pain! Haha…”</p><br/><p>“Hahaha…” In the Sky Bearing army, Li XiangDong suddenly burst out into laughter as he pointed to Han TieXuan, “All of you look, all of you look… this is the great General Han TieXuan who had to kowtow in front of our Marshal to the point his forehead was bleeding. Hahaha, how majestic! All of you probably didn’t know about that incident right? While General Han looks extremely majestic now, he was even more majestic back then. He was smashing his own head against the rocks of the ground! That kind of courage…heh… in order to ensure his own survival, he pleaded for the Marshal to let him off. He had even wanted to take this daddy as his godfather. However, this daddy had rejected him with a kick to his face! Such a b*st*rd wouldn’t even be worthy to become my grandchild! He was no more than an animal!”</p><br/><p>“Li XiangDong! You darn swine! Stop with your bullsh*t! This daddy will curse all of your ancestors! You better pray to the heavens that this daddy here doesn’t get my hands on you later. Otherwise, this daddy here will serve you well and ensure your eternal bliss! This daddy here will make sure that you will call me daddy!” Han TieXuan almost puked out a mouthful of blood with his face turning ashen as he cursed out loud. Li XiangDong had rubbed salt in his largest wound. When he was captured by Sky Bearing back then, Western Han had to cede their territory in exchange for him and it was his biggest humiliation. This was something that all the Western Han troops present were aware of. However, Han TieXuan kowtowing and pleading to Li XiangDong was all nonsense made up by Li XiangDong. In fact, Han TieXuan could also be considered to be an iron-blooded man, and his military strategies were no weaker than Ling Xiao’s. The only reason why he was captured back then was due to the smaller number of troops he had. For a once captured general to be holding military power in his hand again, his talent was obvious!</p><br/><p>However, everyone only knew that he was captured before but were unaware of what exactly happened. As such, they all turned and looked at him with some of them having looks of disdain. Only a hot-blooded individual unafraid of death would be respected in the army. A cowardly man who feared his death was always the one who would receive the disdain of others! Thus, both the armies began to look at him with a weird glare.</p><br/><p>“Brothers, do you guys see that? The one in front of us is a coward!” Ling Nineteen had already regained his strength and grasped the opportunity in front of him, “We are the elite soldiers of Marshal Ling Xiao! Are we going to lose to the cowardly troops brought out by this cowardly general? Hahaha, coward! Everyone! Shout along with me!” Ling Nineteen began shouting, “Han TieXuan! Coward! Kowtowing scum! Han TieXuan! Coward! Godson!”</p><br/><p>“Han TieXuan! Coward!”</p><br/><p>“Han TieXuan! Godson!”</p><br/><p>Han TieXuen! Kowtowing scum!”</p><br/><p>“Hahaha…”</p><br/><p>The Sky Bearing army broke out into a huge commotion as the originally hopeless troops were brimming with morale again. They cheered and shouted under the lead of Ling Nineteen with the atmosphere in the Sky Bearing army rising up to its peak again. All of a sudden, the injuries on their bodies no longer seemed that painful as a sense of pride filled their hearts! We are an iron army! Soldiers of the God of War! So what if we are surrounded by our enemies?</p><br/><p>The sound of the enemy troops became louder and louder as the pressure grew greater and greater. However, the Sky Bearing army was completely fearless at this moment.</p><br/><p>“Brother Nineteen! Look!” Ling Twenty-two shouted out and pointed to the south. As Ling Nineteen took a look, they saw a dust cloud rising up and Ling Nineteen began shouting out, “They are our men! I wonder how many of our brothers are there?”</p><br/><p>“Regardless of how many men there are, reinforcements signal hope! We just need to charge towards that direction!” Ling Nineteen said with resolution. At the same time, he added on in his heart, Even if there is only a single person, it is plenty to lift up the morale of our army!</p><br/><p>“Marshal, look! Our reinforcements are here!” Ling Nineteen began shouting, “Let us escape in that direction!” He then pointed towards the south.</p><br/><p>Ling Nineteen’s words were filled with his inner qi and many present could hear it! More than half of the Sky Bearing army could hear it and even those who couldn’t hear it could see the large dust cloud from afar. The dust cloud of hope! Everyone felt their bodies tremble with excitement!</p><br/><p>Our silver lining!</p><br/><p>Ling Xiao laughed, “Good! My fellow brothers! Our brothers have sacrificed themselves to help secure our escape! Now, it is time for us to collect their blood debt! Charge towards that direction!”</p><br/><p>At the same time, Han TieXuan raised his weapon and roared, “Charge! Kill them all without mercy! Tear Ling Xiao and Li XiangDong to shreds!”</p><br/><p>Both the armies let out a roar at the same time and launched their attacks almost simultaneously! At the same time, the Northern Wei army had also arrived, and Shui QianHuan did not follow his original plan to spectate the battle. Instead, he gave the order to launch an all-out attack! Wei ChengPing, who wanted to let his troops take a rest, also knew the seriousness of the matter and shut his mouth.</p><br/><p>The three forces clashed with each other immediately!</p><br/><p>On a mountain near the battle, there were two black figures seated under the tree and witnessing the life and death battle happening below them.</p><br/><p>“Second brother, the little brat from the Shui Family is rather proficient in military stratagems!” A purple-robed middle-aged man said with a smile as he nodded his head in praise, “Mmm, that’s right, that’s right! It seems that the God of War Ling Xiao will be in big trouble today. Ling Xiao will probably die today with his 70,000 strong army perishing with him!”</p><br/><p>“Mmm, but it is really such a pity! For an iron-blooded man like him to not die on the battlefield but under the schemes of others!” Another person sighed with regret.</p><br/><p>“Pity?! How would it be a pity? Even the Northern Wei will face huge losses in this battle with Sky Bearing and it will definitely be a great affair for us!” The purple-robed man said, “Ling Xiao’s death is completely to my liking! Hahaha, the heavens are really helping me!”</p><br/><p>“Why does big brother say that?” The other person asked with doubt.</p><br/><p>“On the surface, Ling Xiao and his army perished in the hands of the Northern Wei army. However, they actually perished under the plan of the Shui Family in reality!” The purple robed man said, “Such an enmity is irreconcilable! How would Ling Tian ever let go of Water of Heavenly Wind? Even if Zhan Feng and ZhanYun cannot capture that Shui lass, I believe that she won’t be able to escape from Ling Tian’s palms! Haha, I actually do prefer that Shui lass to land in Ling Tian’s hands!”</p><br/><p>As he said that, he let out a long breath, “As long as Ling Xiao dies today, a blood feud will definitely be formed between their families and a war between them is inevitable. However, Ling Tian will definitely come to realize that no matter how much his strength has grown over the past few years, he wouldn’t be a match for an opponent like Water of Heavenly Wind which has a thousand years of foundation! As long as he suffers some losses, he will realize that he needs a helping hand! At that time, the best choice would be…”</p><br/>\n</div>"}