{"title": "Chapter 324", "id": 324, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-324", "volume_title": "Volume 4", "body": "<h1>Chapter 324</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 324: Obstructed throughout their JourneyTranslator: chuchutrain Editor: DavidT, Rock</p><br/><p>The corners of NanGong TianLong’s mouth raised in a smile. “Hmm??”</p><br/><p>NanGong Yu nervously racked her brain, after which she slowly replied, “Long Xiang set a trap to deal with Ling Xiao, causing Ling Tian to rush to save his father. Thus, he would definitely transfer all his elite personnel to the frontline! Based on what a person would deduce, the Ling Family shouldn’t have anybody left, and would be in their weakest state currently! However, having met with Ling Tian so many times, does Father really think that Ling Tian would be the sort of person to leave loose ends? Do you think that Ling Tian would really leave the rest of his family to be slaughtered like lambs?”</p><br/><p>NanGong TianLong now laughed, “That’s right, with Ling Tian’s meticulousness, he would definitely have left a strong person to guard the place. It’s just that I would like to see how strong this person is, and whether he can stop the combined forces of the Imperial and Yang Families! Don’t forget, the Imperial Family’s guards, as well as the Heavenly Blade Troops from the Yang family, are definitely not forces to be looked down upon! The moment the Ling Family shows a hint of weakness, it will only end in complete annihilation!”</p><br/><p>NanGong Yu’s eyes lit up as she asked, “Then Father’s meaning is for us to sit and watch the tigers fight?”</p><br/><p>“That’s right! Now that Sky Bearing Empire is going through tumultuous times, everywhere looks to be full of dangers, but to outsiders like us, it’s actually a potential gold mine! No matter what influence they belong to, they would fear to provoke us at this moment. However, it is a chance for us to counterattack, and turn Sky Bearing into part of our forces! Such an opportunity is one that you couldn’t buy even if you had all the gold in the world!”</p><br/><p>NanGong TianLong laughed out in delight as he explained, “If the Ling Family takes the advantage, then us going over to aid them would be like sending coal during a snowstorm. Not only would it improve an already excellent matter, it would send a huge blow to our enemies, the Yang Family! We can take this chance to thoroughly vent our resentment, and this is a chance I would die for! However, if the Imperial Family and the Yang Family are winning, then we can lend them a hand and weed out the Ling Family, after which we could ally with the Sky Bearing Imperial Family first and plot against the Yang Family at a later date! Whatever the case, today’s chaos is a good chance for our NanGong Family to take the stage once more, and no matter what, we still stand to gain an advantage. Haha…. our NanGong Family has been suffering ever since we stepped into Sky Bearing, but to think that heaven would take pity on us and reward us so richly!”</p><br/><p>“Father (Big Brother) is wise!” NanGong Yu and NanGong TianHu praised in unison. NanGong TianLong felt even more full of himself, saying, “Inform our spies to keep a close watch on all movements outside. The moment they spot any changes, report back to us at once! We must grasp the opportune time to move, the moment we miss this window, all is lost!”</p><br/><p>“Yes!”</p><br/><p>***</p><br/><p>Shen RuHu stared straight ahead, moving in silence with complicated feelings in his heart. If he were to walk another ten feet and turn the corner, he would be able to see the main entrance of the Ling Residence!</p><br/><p>The footsteps of the Imperial Army seemed to be trampling on Shen RuHu’s heart with every step! Don’t tell me, that I have to take action against the person I admire the most? To fight to the death against him?</p><br/><p>Turning his head to look backward he saw Long Xiang, sitting high up in his palanquin, overseeing the procession. Then looking at the over one hundred executioners glaring forward like tigers watching their prey, a sense of indignance rose up in his heart!</p><br/><p>What sort of sh*tty matter was this? Carrying out a vicious command of wiping the family of someone who had contributed to a majority of the empire today, and they even needed over a hundred executioners as well as the officer in charge of them to step forward! Was Long Xiang’s brain made up of dogsh*t?!</p><br/><p>Just as he was feeling resentful, an unforeseen event took place! On the rooftops of both rows of buildings overlooking the road, group after group of people stood up. All at once, a few hundred tubs of a nasty smelling black stuff was poured onto the troops, causing disorder. Shen RuHu immediately shouted, “Archers, prepare!”</p><br/><p>He was greeted with laughter, “Do you think that only you would have archers?” Then came the shout, “Fire at will!” At the same time, Shen RuHu also shouted the same command!</p><br/><p>“Beng beng beng” came the sounds of drawstrings, and over ten people let out agonized screams as they fell from both sides of the roofs. However, Shen RuHu began to feel suspicious, thinking, Why have no arrows been fired by the opposing party, despite the order being given? Suddenly, a chilling thought came into his mind, and he looked up to see the roofs ablaze with light. They had lit flaming arrows! A crazed laughter came from above, “Hahahaha…. To actually be able to have the Sky Bearing’s dog emperor to accompany me to my grave, I, San GouZi must have had good karma in my previous life!”</p><br/><p>“Oh no, it’s oil!” Shen RuHu’s face turned pale! The black stuff that was poured down earlier had a familiar smell, and now he finally knew what it was!</p><br/><p>But, it was too late!</p><br/><p>A wave of arrows shot down like flaming rain!</p><br/><p>Boom!</p><br/><p>The entire street was immediately engulfed in raging flames that soared over thirty feet high! In that instant, it reduced the 10,000 Imperial Guards by more than half!</p><br/><p>Sky Bearing Empire’s most prosperous street turned into a hellish area in mere seconds! With fire devouring everything, and black smoke filling up the area, screams of pain were heard all around as countless Imperial Guards thrashed about in the sea of flames. They struggled to escape from their misery, but with the crowd squeezed into that small street, how much could they move? Furthermore, with most of the people on fire, attempting to squeeze forward only served to further fan the flames onward, spreading to even more people. Sizzling sounds were heard as the smell of burning flesh assailed the noses of all present, making all on scene nauseous!</p><br/><p>The warhorses were also thrown into chaos, breaking from their masters and galloping everywhere with their might as they also tried to escape the fire! The scene was one of pure disorder!</p><br/><p>Shen RuHu could only throw his head back to the sky and sigh! With tears in his eyes, he shouted, “Archers, first platoon attack those on the rooftops, second platoon, kill all on fire!” As he spoke, he drew his sword, hacking down on one of the Imperial Guards struggling in the fire towards them! The archers at the back immediately snapped into attention, half of them aiming towards the roof, while the other half blinked back tears and let their arrows fly towards their allies. Be it animal or human, all were killed without exception!</p><br/><p>Those on the rooftops actually had the intention to continue with their sneak attacks, so as to cause more damage to the Sky Bearing Troops. But upon hearing the fast response of Shen RuHu, as well as his tactical shrewdness, they couldn’t help but sigh, and their commander shouted, “Retreat!” Within seconds, the rooftops were devoid of shadows!</p><br/><p>Shen RuHu was well aware that, were he more soft-hearted and allowed his comrades to dash out of the fire and towards them, then all the troops under him would be slowly picked off by the assailants on the rooftop! At that time, they would have no more military strength to speak of, and if the Ling Family managed to secure a few advantageous locations to ambush them, then this would only end with the Imperial Family’s complete annihilation! Thus, he made the cruel decision to shoot down those in the fire, simply because he had no other alternatives! Better a few die than all go down with the ship!</p><br/><p>From this point, one could see Shen RuHu’s decisive and ruthless methods. He indeed was someone who had survived for years on a battlefield: Ling Zhan’s best disciple!</p><br/><p>Following Shen RuHu’s orders, the Imperial Army rapidly entered the private houses on both sides of the street, knocking down the walls of the houses into the fire to extinguish it!</p><br/><p>When the fire finally died down, the once prosperous street had turned into ruins that were barely recognizable! The rubble from the private houses piled up to form a small hill, seemingly like a huge tombstone for the dead! Shen RuHu and Long Xiang were separated by the small hill, and both of them had soot-black faces, wanting to cry but no tears could come out!</p><br/><p>The sudden ambush this time had left the elite Imperial Guards with at least 5,000 casualties! As for their morale, it was in absolute tatters! Both soldiers and horses had their heads bowed in resignation and defeat. As it turned out, the Ling Family had long known of what they were going to do! This thought left a chill in all still present.</p><br/><p>The Heavenly Blade Troops which Yang KongQun was commanding had an even more miserable time, with at least 70 ambushes targeted at them on the way to the Ling residence!</p><br/><p>Countless flying daggers and arrows rained from the rooftops, trees, and even from the doorways. Every step they took towards the Lings had to be paid with the lives of several men! The worst part happened just when they were approaching the main entrance of the Ling Residence. Arrows suddenly rained down on both sides like a torrential downpour, and while the troops were quick-witted enough to ward them off, the walls of both sides suddenly came crashing down as well, killing the first few men, and leaving the rest stuck with no way to proceed forward!</p><br/><p>Yang KongQun was livid, giving down the order to search the place, but the result was the same as the first few times, not even a shadow was present! It was as if the entire sector had turned into King Yama’s playground, eerily, silently, reaping the lives of all men!</p><br/><p>After going through a hundred and one ways, the two groups of people finally met up in front of the Ling Residence’s entrance! Seeing the disheveled looks on the other party, they could sense the humiliation as well as the killing intent in the other party!</p><br/><p>Currently, the Ling Residence was barricaded in three different layers! Countless archers held arrows that gleamed in the light, directed towards every part of the residence! However, the surprising thing was that there was no response from the residence, as though the Ling Residence had become an ancient beast that was snoozing away!</p><br/><p>On the way, both parties had received so many ambushes, leaving them with some amount of lingering fear! Seeing the people in the Ling Residence behaving as such at this point didn’t sit easy with them! Ling Residence, what sort of show are you trying to put on?!</p><br/>\n</div>"}