{"title": "Chapter 320", "id": 320, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-320", "volume_title": "Volume 4", "body": "<h1>Chapter 320</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 320: Calmly Escaping from DangerTranslator: chuchutrain Editor: DavidT, Rock</p><br/><p>Ling Tian let out a grunt of assent, as though he did not consider the matter of 30,000 troops barring their way as having much importance. Instead, a warm smile could be seen on his face as he addressed Ling Nineteen and his group, “It’s been hard on you guys these past few years.”</p><br/><p>Ling Nineteen suddenly felt a sourness in his heart. To think that an iron-blooded warrior like him who had survived a hundred battles could actually start crying. He lowered his head and forcibly suppressed the tears, while trying to keep his voice even, “I thank the young noble for still thinking about us. Don’t worry, it was nothing much.” While he was controlling his emotions, his voice still trembled, revealing the intense emotions that he felt. Even those beside him, such as Ling Twenty, Ling Twenty-one, and Ling Twenty-two, all of them had reddened eyes.</p><br/><p>A man does not cry, simply only because there has not been an incident that could make him do so!</p><br/><p>A whole three years! The four of them had stationed themselves beside Ling Xiao; how many battles had they already participated in? To say that they were survivors of a hundred battles would be underrating them! However, these iron-blooded youths had actually left their own band of brothers, choosing to endure endless grass and sand, as well as the hot sun; witnessing blood spray into the air and bodies dismembered in front of them. The hardships they faced could not be explained. However, the moment Ling Tian spoke to them, all these hardships seemed to have disappeared with the wind, leaving their hearts only with fulfillment, knowing that whatever they had gone through was worth it!</p><br/><p>Seeing their flustered looks, Ling Jian smiled as he walked up and patted their shoulders, praising, “Good! You’re indeed my able aides, indeed the brothers of young noble!”</p><br/><p>“Brother Jian!” The four of them could not take it any longer, and tears started to roll down their cheeks.</p><br/><p>Ling Tian let out a satisfied smile as he said, “These few years, the four of you could be said to have gone through the vicissitudes of life, and since my father’s military career has come to an end in Sky Bearing, why don’t you guys return back to the Ling Family Courtyard and go back under Ling Jian? With the experience you guys have obtained on the battlefield, it won’t be a difficult thing for you to be a part of the First Pavilion!</p><br/><p>Ling Tian’s words not only affirmed the efforts that Ling Nineteen and his group had put in, but also approved of their current strength! The First Pavilion had thus gained another four asuras! They were not typical killing gods, but in fact killers that had been forged in the hellish fires of the battlefield! The fame of the First Pavilion was well known in all three continents, but other than Ling Jian who was a true killer, Ling Chi and the rest were still newbies under training. While Ling Chen was familiar with how the First Pavilion operated, she was not under it. With the addition of Ling Nineteen and his group, this was a great boost to their strength!</p><br/><p>Ling Jian and the rest of the First Pavilion were ecstatic and crowded around the four soldiers with congratulations. Hearing the praises, Ling Nineteen and group were so happy that they seemed to have become mutes, unable to express themselves at all.</p><br/><p>Ling Tian laughed at this comical scene, “Why? Are you guys not willing?” He pretended to shake his head in disappointment, “Since you guys aren’t willing, then I can only revoke this order…”</p><br/><p>“No, we’re willing! Young Noble, we’re extremely willing!” Ling Nineteen knelt down to the ground in happiness. “Many thanks to the young noble!” He knew that by asking the group to serve under Ling Jian, it represented that he was asking for them to commit themselves fully to him! And by doing so, not only the trust they obtained from him but also their martial skills would receive an unprecedented rise! To people like them who thirsted for strength, this was akin to a meat pie dropping from the sky in front of them! This sort of feeling could be felt but not described, it was more than just happiness!</p><br/><p>“Young noble…” Ling Jian had on a drooling face as he stretched out his hand towards Ling Tian, “You wouldn’t discriminate against them, right? If that’s so, then the medicine…”</p><br/><p>Ling Tian glared at him unhappily, “Since you know how to think about them, could it be that this young noble doesn’t know how then? Whatever the case, we still have to return before we can discuss anything. Where would we have the time to increase their strength right now? Can’t you see that they do not have a single part of their body in a good condition? If they were to consume the pill now, the increase in internal energy would cause all their vessels to explode from within. Do you think they would still survive after that? Huh??!”</p><br/><p>Ling Jian let out an embarrassed laugh as he scratched his head, “I’m worried about that too…”</p><br/><p>Ling Tian’s glare turned fierce, “And I don’t look worried?! You brainless fool!”</p><br/><p>Ling Nineteen had no idea what they were talking about and cast a confused glance over to them. He could only see Ling Chi, Ling Feng and Ling Yun continuously making side glances towards him with sweat on their faces.</p><br/><p>Ling Nineteen then recalled what situation they were in, and worriedly interjected, “Young noble, I believe we can continue this discussion after we have reached a safe place. For now, I believe we should discuss how to get rid of the three b*st*rds and break through the Soul Extinguishing Pass before anything else! With our current strength, this is no trifling matter. My idea is to allow us brothers to sneak into the compound, killing the three dog generals, before opening it up from the inside to allow everyone else to go in. However, the risk in this is larger and more time-consuming. With the enemy catching up from behind, we do not have much time, so we have to make a decision quickly.”</p><br/><p>Ling Tian and Ling Jian shared a laugh with each other before Ling Jian spoke, “Nineteen, no need to worry about this. The young noble naturally has an arrangement for this.”</p><br/><p>Hearing that Ling Tian already had a plan in mind, Ling Nineteen couldn’t help but turn a questioning gaze to Ling Tian’s face.</p><br/><p>Ling Tian, however, only nodded his head but did not reply, instead turning back to the pass, which was shrouded by the backdrop of the night scenery. He had gone solo with his brothers, rushing into the battle beforehand, but that had already been over six hours ago! While his army required time to prepare the logistics, appropriate measures had already been prepared long beforehand, thus the army should have been at a state of readiness. If Feng Mo and his men were not able to reach here by now, then that would be unacceptable!</p><br/><p>Just as Ling Tian was pondering over this problem, a flare shot up into the sky above the Nine Swallow City, and the sounds of killing immediately sounded out from within!</p><br/><p>Indeed, they had lived up to Ling Tian’s expectations! Ling Tian could guess that his own elite troops had not even bothered to take a moment of rest before immediately beginning the battle to seize the pass!</p><br/><p>Mounting his horse, Ling Tian hollered, “Charge! Coordinate with our forces inside, kill our way into the Soul Extinguishing Pass and occupy the city! We’ll have our showdown with the Northern Wei and Western Han there! My army will definitely win, for I am undefeatable!” Seeing that Nine Swallow City suddenly set ablaze, with screams and shouts filling the air, the Ling Army troops seemed to have perked up once again! Everyone knew that so long as they could reoccupy Nine Swallow City and guard the pass, this would mean a position of absolute safety! Under the intense desire to survive and live on, the remaining 10,000 troops all shouted and charged with all their might!</p><br/><p>The gate to Soul Extinguishing Pass suddenly opened, and a battalion of soldiers came out and neatly arranged themselves. They fanned out, each person on a horse and armed to the teeth as they awaited the arrival of Ling Tian and his troops. Seeing that they were approaching, all uniformly got down their horses and kneeled down in respect, “This subordinate Wang Han gives his respects, and invites the Grand Marshall and young noble to enter the pass!”</p><br/><p>The battalion echoed, “Welcome Grand Marshall and young noble to enter the pass!”</p><br/><p>Ling Tian finally laughed, and flipping off his horse, he held Wang Han by his arms. Patting his shoulder he laughed out, “Well done!” Turning his head back, he commanded, “Enter!”</p><br/><p>The remaining army had high spirits and their heads were held high and chests were out as they strolled in! To have survived in the battle, they walked in as though they were war heroes being welcomed back into their city! However, this still took some time, as there were 10,000 of them after all.</p><br/><p>From behind suddenly came the sounds of horses galloping! The enemy was approaching!</p><br/><p>Wang Han jumped up onto his horse, a bloodthirsty smile on his face as he shouted, “We’ll hold off the offenders for young noble!”</p><br/><p>“Hold back the enemies for the young noble!” The battalion echoed and rushed forward as a whole!</p><br/><p>Han TieXuan had been urging his army for the entire journey, as he was afraid that they might lose the best chance to get rid of his enemy! When he finally saw Ling Xiao standing outside the pass, looking as though they were being barricaded outside, he felt an unprecedented joy in his heart, thinking, Ling Xiao, let’s see where you can run to this time! Today shall be your death day!</p><br/><p>Just as a smile suffused across his lips, he suddenly stood stock still! He was left completely tongue-tied as he stared at the gate of the pass opening, and the army respectfully welcoming Ling Xiao and his army in!</p><br/><p>After being in shock for a few moments, he finally got his breath back! Seeing his enemy turning away from the doors of death all of a sudden, Han TieXuan almost had the urge to vomit blood!</p><br/><p>This meant that in the darkness in front, there was a batch of elite soldiers lying in ambush!</p><br/><p>Since things had already reached this point, Han TieXuan could only sigh and raise his greatsword, passing down the order to pitch camp! While he was reluctant to let his enemy go just like that, he knew that this was already out of his capabilities! At least before the Northern Wei soldiers arrived, he definitely could not act rashly! In front of him was a sturdy city, a city that had never been captured!</p><br/><p>At this point, there was a burning question in Han TieXuan’s heart. Just why would the soldiers on duty allow Ling Xiao to pass into the keep so easily? Could it all have actually been a ploy from Sky Bearing to draw all their enemies out and deal with them in one fell swoop? Recalling how Ling Xiao managed to escape from an encirclement of 500,000 troops, Han TieXuan suddenly broke out into a cold sweat. Could it actually have been a ploy for Northern Wei and Sky Bearing to get rid of his Western Han? If so, that would be a serious matter! However, using over 100,000 lives just to carry out this ploy, the losses were still too large anyway, were they not? So who was plotting against who? What exactly was going on?</p><br/><p>For a moment, many different scenarios flashed pass Han TieXuan’s head, but he only felt his thoughts becoming more and more muddied, unable to make sense of anything!</p><br/><p>Inside the Soul Extinguishing Pass, things were getting busy! The Ling Army was being treated for their injuries, and even the hardened war medics were shocked at their injuries! All their army doctors and medics were gathered, but the need of the troops far outstripped the number of medics present! Of the 10,000 troops that returned, all of them had heavy injuries, and one of the doctors could only sigh at the heavens at how cruel this war had been compared to what he had seen in the past decade!</p><br/>\n</div>"}