{"title": "Chapter 325", "id": 325, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-325", "volume_title": "Volume 4", "body": "<h1>Chapter 325</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 325: Peace TalksTranslator: chuchutrain Editor: DavidT, Rock</p><br/><p>Long Xiang couldn’t take it any longer, and screamed out, “Shen RuHu, what are you still waiting for? Attack! Are you planning to give in to your own personal selfish whims?! Don’t tell me you’re still taking into account your old ties with that old thief Ling Zhan?!” As the Emperor, he was actually so humiliated in his own capital that he had long lost his wits! He couldn’t help but wish that the perpetrator of this incident would be in front of him, dismembered bit by bit! Seeing that Shen RuHu was trembling with fear as though he was facing the greatest enemy of his life, he couldn’t help but rage! Since he too didn’t dare to go forward and speak to his own father-in-law, then Shen RuHu as his subordinate had to suffer for him!</p><br/><p>Shen RuHu’s originally black face turned a deep shade of purple in anger! He forcibly reasoned with himself to lower the blood pressure rising toward his head, and turned back to address the heavily guarded Long Xiang, saying, “Your Majesty, the reaction shown by the Ling Family is a little out of our expectations, and we suspect that there might be a scheme hidden within. If we move hastily, it might result in negative consequences!”</p><br/><p>Long Xiang barked out a cold laugh, “I have a troop strength of over 10,000 here, just a mere Ling Family, what can they do to me? Hurry and give the order to attack! Capture all the traitors and bring them to me. Those who resist are to be killed, with the exception of the womenfolk!”</p><br/><p>Hearing the last few words, Shen RuHu nearly burst out into anger there and then. He was about to contend for what he believed was right against the Emperor, but by the side, Yang KongQun quickly approached and softly whispered to him, “Great General Shen, this old man is not suspecting your abilities, but I feel that you should send in a section to feign an attack, so as to test out the true abilities of the Ling Family. This can also serve as sort of an answer to the Emperor himself. If this drags on, it won’t be good for your face!”</p><br/><p>Shen RuHu paused for a moment to carefully ponder, and realized that Yang KongQun’s idea actually didn’t sound bad, so he sighed and replied, “Fine!”</p><br/><p>Just as he prepared to give the command, the sound of door hinges squealing was heard as the door to the Ling Residence slowly opened. A person walked out, with his shirt unbuttoned, revealing a chest full of hair. Seeing so many horses and troops gathered outside, with swords drawn, he seemed to have gotten a shock. While scratching his head in confusion, he spoke out in a puzzled tone, “Ehh? Why are so many of you gathering here for? Haha, your faces are even painted, are you guys preparing some kind of show for me?”</p><br/><p>***</p><br/><p>Nine Swallow City.</p><br/><p>“What did you say? The Western Han sent an ambassador? What does Han TieXuan have to discuss with me at this juncture?” Seeing the report sent by his men, Ling Tian seemed as though he had met with an outrageous situation. This morning, you were just embroiled in a vicious battle to the death with me, and at night you suddenly send an ambassador over to find me! This… your mindset changes faster than me changing clothes!</p><br/><p>Even for someone like Ling Tian who had the experience of two lifetimes, and one in which he was deeply embroiled in crafty plots and machinations, he couldn’t help but feel that his brain had short-circuited. If Han TieXuan was employing some form of trickery, then his ploy was a terrible one, without an ounce of trust! And if Han TieXuan was really thinking about having a proper discussion with them, then Ling Tian’s first thought would be: This idiot has had his head kicked by his warhorse! This matter was weird, weird to the point of being completely unbelievable!</p><br/><p>“Let him in!” Ling Tian paced for a while before finally coming to his decision.</p><br/><p>“General Ling is a king among men, and this time, even under complete encirclement, managed to bravely fight and break through. The tales of your deeds cover the lands, unheard of since the dawn of time. TieXuan only feels admiration for General Ling! General’s bravery could be said to be unparalleled below the heavens! Now that General Ling has occupied Nine Swallow City, he could be said to have a natural barrier for defense and is undoubtedly already safe. While this is a cause for celebration, you still have internal and external blights to worry about; with wolves in front and tigers eyeing you at the back, this is definitely a worrisome situation! The best solution to your problems now would be to clear both internal and external threats, so you can head home safely!”</p><br/><p>“TieXuan has been a disappointment, bringing my own 100,000 troops and attempting to foil your escape. If General Ling has any intention to rout the Northern Wei army, this Han is willing to aid you in accomplishing your task! When the time comes, all you have to do is light the flare, and we will begin an all-out war by using a pincer attack. With both of our combined efforts, Northern Wei will definitely fall at the snap of our fingers!”</p><br/><p>“General can be relaxed, these words of TieXuan come from the bottom of my heart, and every word is true as can be! Please don’t suspect my intentions, and I expectantly await your command! Signing off with respect, Western Han Han TieXuan!” This was the missive sent to Ling Xiao by Han TieXuan.</p><br/><p>Looking at the letter personally penned down by Han TieXuan, Ling Tian furrowed his brows so much that he felt as though they were becoming dough twists! 1 While the tone of the letter was humble, from within, Ling Tian could feel a sense of unwillingness from Han TieXuan!</p><br/><p>“Is your side’s general suffering from schizophrenia?” Playing with the missive in his hands, Ling Tian’s pale face in the candlelight seemed to exude some sort of unknown charm. He didn’t raise his head as he slowly spoke, “With such a f**ked up attempt, do you expect this young noble to believe him? Does Han TieXuan think that this young noble is a fool?! If the same thing happened to you, would you believe it?!”</p><br/><p>“Young noble has a legitimate point, and this little one here probably wouldn’t believe it either, but this matter is the truth, and my house’s general also believes that you would suspect something. If you bought this tale easily, then it would be more likely that we don’t have any chance at all to succeed. My general has commanded me to ask young noble Ling, what exactly he has to do in order for you to believe that his intentions are genuine? So long as it is within his means, my general will carry it out without a single word of complaint, to dispel your suspicions!” Han TieXuan seemed to have already realized that Ling Tian would have this sort of suspicion, and instead of being surprised, returned his question with another question.</p><br/><p>Ling Tian’s eyes gleamed. Ling Tian’s forte was reading people, and this was also the basis for hypnotism. From the posture and actions of the messenger, he could also guarantee that this ridiculous idea was real! It was either this messenger was the world’s greatest actor, or it was that Western Han’s Han TieXuan was actually willing to work with them!</p><br/><p>“If Han TieXuan doesn’t come down personally, how could I trust this missive?! I believe you get my meaning, honored messenger, and I believe Han TieXuan would too!” Ling Tian leisurely placed the letter back on the table, and spoke with utter indifference, “In a war, messengers are never to be harmed. While this battle has caused our two sides to be irreconcilable, there’s hardly any difference in reducing one life from the enemy’s side. You may return and tell Han TieXuan not to belittle me with such tricks! If he really has this intention, then come down personally! Oh, and he has to know that he might not have the chance to leave the place if he comes down! You may leave now, honored messenger. I shall not see you off!”</p><br/><p>The messenger no longer spoke a single word, but bowed and went off!</p><br/><p>Seeing the messenger leave, Ling Jian picked up the letter and glanced through it before saying, “Young noble, I think that Han TieXuan doesn’t have good intentions! Why would he come over to request a cooperation when he obviously has the upper hand? There must be a plot within this; young noble don’t fall for it!”</p><br/><p>“He has evil intentions? This matter is not so simple!” Ling Tian suddenly started to laugh out loud. “While it seems like there’s a ploy within, to me it seems like there isn’t! It all depends on whether Han TieXuan will show up!” Seeing how everyone was looking at him with puzzled looks, he only smiled mysteriously, “To use one hard style to tackle all the myriad changes, one simply just has to use patience.”</p><br/><p>Ling Chi mumbled, “Why would he dare to come? There are so many troops within our city that hate him, if he really comes here, everyone would eat him alive!”</p><br/><p>Ling Tian only laughed in response, “I don’t see it that way. I believe there’s a chance he might turn up!”</p><br/><p>Not even two hours had passed when a soldier came forward to report, “Western Han’s General Han TieXuan is here with a follower and is requesting an audience with young noble.”</p><br/><p>Everybody immediately froze in shock. Did Han TieXuan really turn up in person? So he really had the intention to make peace!</p><br/><p>Ling Tian, however, remained passive, only replying, “Invite him in.” He then turned to Ling Twenty and instructed, “Invite General Li XiangDong to the meeting hall, and be careful, don’t aggravate his wounds.”</p><br/><p>During the battle that day, all of Ling Xiao’s troops received some form of serious injury, and ever since they occupied Nine Swallow City, Ling Tian had cleared all the various provincial offices and converted them into resting places for the military officials. If there was nothing serious, Ling Tian would be extremely unwilling to cause them to aggravate their injuries, but this was a special circumstance. Other than Ling Xiao and Li XiangDong, nobody else would recognize Han TieXuan! He was left with no other choice but to invite General Li to meet his old nemesis.</p><br/><p>“This must be young noble Ling? Indeed a talent. This one is Han TieXuan, pleased to meet you.” In a short time, Han TieXuan and his follower came to the meeting hall, escorted by two other soldiers on Ling Tian’s side. Two heavy mantles covered the figures of Han TieXuan and his follower completely, not revealing any part of themselves. Ling Tian only heard a rough voice speaking.</p><br/><p>Ling Tian also cupped his hands in greeting, blandly saying, “Forgive me for my poor eyesight, but because of your attire, I didn’t dare to rashly greet you. Please understand.” While he was speaking, Ling Tian’s attention actually wasn’t placed on Han TieXuan, but rather the person beside him. He could feel a pair of sharp eyes sizing him up from within the cloak, and that gaze was accompanied by a few points of admiration, instead of ill intent. The person beside Han TieXuan resembled a deep pool, with a naturally stately bearing. It was obvious that this person had skills that were on par with Yu ManTian!</p><br/><p>Who was this person? Why would he appear now? And what was his intention?!</p><br/><p>Han TieXuan laughed and replied, “In order to prevent ourselves from being seen or heard, we had no other alternatives. Thus we could only dress like this.”</p><br/><p>Ling Tian instead laughed out drily as he commented, “General Han only needs to take off your cloak and need not be too candid. Under this meeting hall, how could it be inconvenient for you….”</p><br/><p>Han TieXuan was already in the process of removing his mantle, but upon hearing Ling Tian’s words, his face turned purple, as though he wanted to burst out in a rage. It took him a while to calm down, and he stuttered, “Oh… that’s, that’s… we’re all men after all, there’s really no need for me to do this… hehe, umm….” He suddenly felt like he was spouting gibberish, as though he was having some funny thoughts, and could only let out an awkward laugh, “Young noble Ling is really good with words, haha…”</p><br/><p>Ling Jian and Ling Chi were dressed in military fatigues, standing by the side without moving like statues. However, with this exchange of words, and upon seeing the alternating colors of Han TieXuan like a light show, Ling Chi couldn’t help but laugh. Feeling that it was inappropriate, he could only cover his mouth and turn it into a weird sounding cough.</p><br/>\n</div>"}