{"title": "Chapter 329", "id": 329, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-329", "volume_title": "Volume 4", "body": "<h1>Chapter 329</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 329: Completely SurroundedTranslator: DavidT Editor: DavidT, Rock</p><br/><p>At almost the same time, another loud explosion could be heard from the palace and a large cloud of smoke rose into the air!</p><br/><p>“Hahaha…how satisfying!” A voice sounded and a snow-white figure landed beside Ling Lei! At the same time, three black balls landed in front of Long Xiang with a thick smell of blood emanating from them. As everyone looked over, they saw three heads with indignant countenances rolling on the floor!</p><br/><p>Yang KongQun saw his vision blacking out as a wave of dizziness overcame him and a mouthful of blood sprayed out! His body began swaying in hopelessness! By his side, Yang Lei let out a roar as his eyes turned red and he began letting out a crazed roar, “Kill! Kill them all!”</p><br/><p>These three heads were the heads of Yang KongQun’s last son and his two grandsons! Not a single one of them managed to escape and they were all killed!</p><br/><p>“Brother Dian is brother Dian indeed. Even with the both of us joining hands, we were a single step slower!” Two teens appeared out of nowhere and a black sphere was thrown towards Long Xiang’s sedan. Afraid that the sphere was lethal, Long Xiang’s guard quickly deflected the sphere with a palm strike and it landed in front of the sedan.</p><br/><p>As Long Xiang looked towards the sphere, his body began to tremble. The decapitated head had long hair drooping down with a pair of fear-filled eyes staring at Long Xiang! She was the empress, Yang Xue! Long Xiang saw his vision darken with sweetness in his throat and fresh blood flowing down the corners of his lips.</p><br/><p>“Ah ah, Your Majesty, do you find her familiar?” that teen asked with a chuckle, “What a peerless beauty. She was still elegant despite her old age! I almost couldn’t bear to kill her just now. Oh, there are another two more over here.” With a swing of his arms, another two heads rolled on the floor! Everyone could recognize that the heads belonged to the current crown prince and his younger brother!</p><br/><p>Just when Long Xiang and Yang KongQun led their men to wipe out the Ling Family, the Ling Family had actually taken the initiative and destroyed the bases of both the Imperial and Yang families! Even the current empress and crown prince were beheaded and presented to the emperor!</p><br/><p>What a cruel method!</p><br/><p>Up until this point, no one from the Ling Family had come out to say a single thing. However, they had used such a cruel method to display their determination!</p><br/><p>It’s either your death or mine! There is no hope for reconciliation!</p><br/><p>This was the bloody method of the Ling Family! Or perhaps, this was the bloody method which Ling Tian had trained his subordinates in!</p><br/><p>The ten thousand people present were immediately frightened! The cruel methods of the Ling Family had shocked everyone present! If the Ling Family was able to easily assassinate the Empress in the tightly guarded palace, weren’t they all nothing in the eyes of their enemies? All of them suddenly thought about how Ling Tian had risen to prominence so swiftly and displayed his cruel and sinister means! Witnessing how the scene in front of them was so similar to Ling Tian’s means, the same thought surfaced in everyone’s mind, The little devil isn’t gone? Saving his father was no more than a farce? He is still in Sky Bearing and taking charge of the family? My goodness!</p><br/><p>The sound of footsteps sounded from afar with a loud clamor and commotion sounding from all around. The walls of the houses to the sides were suddenly dismantled with black bows appearing from the resulting ruins, aiming at all the soldiers present! In just a single instant, the whole place was filled with men! The roofs and windows were all filled with archers with a person by their side holding onto a large shield! The glimmering arrows could be seen all around, aimed at the soldiers of the Imperial Army!</p><br/><p>Men could be seen appearing from all around, wielding their blades with a confident expression as though victory was in their grasp! As Shen RuHu looked around, he realized that there were no less than twenty thousand enemy soldiers! They were dressed in clothes of different colors as they blocked off the whole road! All of a sudden, the light from blades could be seen from all around!</p><br/><p>From afar, two burly men approached slowly on their horses. Even in the face of the elites of the imperial army, not a single trace of fear could be seen! Disdain could be seen in their eyes! Ling Lei and Ling Dian looked at each other with a smile, with the same thought surfacing in their mind, These two idiots, thinking that the young noble was chasing them away, they bawled their eyes out when the young noble sent them to manage the Violent Wind Gang back then, pleading to the young noble to retract his orders. But in just a few years, they already have such a heroic disposition! This disposition of theirs is something which the past them could never hold a candle to!</p><br/><p>From the south, another squadron of burly troops approached and the one leading the front was black from head to toe like a piece of coal! The only white that could be seen on his body was probably the white of his eyes! He was Ling Five who was in charge of Ling Tian’s armament factory. From afar, he began to shout, “Everyone work together and kill this muddle-headed, tyrannical, and dogsh*t emperor who kills the loyal!”</p><br/><p>The troops he brought also began to echo, “Kill this inhumane dogsh*t emperor!” Their voices traveled afar as the troops all around began to roar, “Kill this dogsh*t emperor! Kill this dogsh*t emperor!”</p><br/><p>Long Xiang’s face was pale as he looked towards Yang KongQun and Shen RuHu with fear in his eyes. At this moment, he was truly afraid. Both Yang KongQun and Shen RuHu were also the same. Despite being able to keep their cool, their pale appearances had already betrayed the fear in their hearts.</p><br/><p>None of them imagined that the Ling Family, or perhaps the strength that Ling Tian had in Sky Bearing, was developed to such an extent! While all of them knew that the Ling Family would not surrender so easily and they knew that the strength of the Ling Family was not to be underestimated, none of them had imagined that the strength of the Ling Family was developed to the point they could overthrow the Imperial Family!</p><br/><p>It was too unexpected and out of all of their expectations!</p><br/><p>The soldiers from the Imperial Army looked at each other at a loss as the weapons in the hands drooped downwards. At this moment, none of them dared to make a move, and even their breaths were controlled and light. What would they do if the archers were to open fire from them twitching their asses because of a fart? Merits and rewards may not be theirs but their lives most certainly were!</p><br/><p>“Even though the matters of the Sky Bearing Empire have nothing to do with me, this old man is enraged by the way Emperor Long Xiang kills his loyal subject in cruelty! I cannot watch by the side any longer! This old man is NanGong TianLong from the NanGong Family and will announce to the world that our NanGong Family will be allies of the Ling Family forever! Even if our NanGong Family were to be destroyed from the matters today, this old man will not have any regrets!” The crowd split apart and NanGong TianLong appeared with NanGong TianHu and hundreds of his NanGong Family elites! They stood in front of the Ling residence with their faces stern, looking as though they were ready to give their lives!</p><br/><p>Ling Lei looked towards Ling Dian and shrugged his shoulders as the both of them sneered in their hearts, It’s too late! While NanGong TianLong’s plan to give them aid at their lowest point wasn’t too bad, it was far too late!</p><br/><p>If the NanGong Family members were to appear before the members of the Violent Wind Gang appeared and when there was only Yu ManTian standing in front of the Ling Residence, regardless of whatever their intentions were, Ling Tian would definitely treat the NanGong Family as their close ally from today onwards!</p><br/><p>However, just this moment of delay had a completely different meaning! Instead of sending coal in the winter, it was akin to embroidering flowers on brocade. It could even be said that they were seizing the opportunity to side with the victor. The NanGong Family had lost their biggest opportunity to ally with Ling Tian!</p><br/><p>For the NanGong Family to appear now, not only would there be no positive effects, they would only be revealing their true intentions to the many people present. Even Ling Lei and Ling Dian were able to see that the NanGong Family was just siding the victor, not to mention Ling Tian.</p><br/><p>Currently, under the pressure of the many Ling Family soldiers together with the unceasing number of reinforcements, the Imperial Army had lost all will to battle! Their bodies were all trembling as they lost the courage to even lift up their blades! They were no different from a flock of lambs ready to be slaughtered.</p><br/><p>In the Yang Family, only Yang KongQun was still able to keep his cool and his three thousand Heavenly Blade Troops were still able to put on an emotionless expression. However, their eyes were all filled with complete despair! As for the others, their faces were already ashen with some of them lying on the floor paralyzed, with their muscles spazzing uncontrollably and white foam coming out from their mouths! They were all a pitiful sight to behold.</p><br/><p>All of a sudden, a loud voice could be heard from the Ling residence, “Miss Chen is here!”</p><br/><p>Everyone’s gaze shifted with the soldiers of the Ling Family revealing looks of respect. At the same time, Long Xiang’s was also bewildered, Miss Chen? Since when does the Ling Family have a Miss Chen? Don’t tell me…</p><br/><p>Forty burly men suddenly appeared and formed two straight rows in front of the Ling residence. They stood ramrod straight by the side with a divine light shining out of their eyes and their bodies fit. It was obvious that they all had decent martial art skills!</p><br/><p>Following which, a flurry of footsteps could be heard and a white-dressed lady walked out slowly!</p><br/><p>Following her were Mister Qin, Meng LiGe, the various managers of the Ling Family, and the twenty Blood Iron Warriors that Ling Tian left behind! Despite everyone present in the entourage being of considerable status, the gazes of everyone outside ignored all of them and were focused on this white-dressed beauty!</p><br/><p>It was as though it was only normal for them to be attracted to her! All of them could not help but agree that this beauty was the core of the many members present!</p><br/><p>She was the only lady who Ling Tian had recognized: Ling Chen!</p><br/><p>Ling Chen’s face was calm as she walked out of the Ling residence slowly. It was as though a beautiful flower had bloomed in the noisy Sky Bearing City! Pure, noble and unable to be defiled! It was as though looking at her from afar would make one feel a deep sense of inferiority!</p><br/>\n</div>"}