{"title": "Chapter 327", "id": 327, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-327", "volume_title": "Volume 4", "body": "<h1>Chapter 327</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 327: Who Benefits MostTranslator: DavidT Editor: DavidT, Rock</p><br/><p>Just as he was leaving, a buzzing noise sounded in Ling Tian’s ears, “This old man can only do this much! Make good use of this opportunity! You have to take good care of Yan’er or this old man will not let you off so easily!”</p><br/><p>A look of gratitude could be seen on Ling Tian’s face as he shouted to the two departing figures, “Thank you! Have a safe trip! I won’t be seeing you out!” In the darkness, crisp laughter could be heard as both figures melded into the darkness.</p><br/><p>Ling Jian, who was beside Ling Tian asked softly, “Young noble, are we really going to let Western Han enjoy such benefits?”</p><br/><p>“Let Western Han enjoy such benefits?” Ling Tian responded with a question as he muttered with a mysterious smile, “Are they truly the ones benefiting?”</p><br/><p>“Ling Tian is really generous!” In the dense forest, Yu ManLou’s beard was drifting in his wind with his finger trembling. With his face flushed red, he pointed at Yu ManTang and scolded, “Second brother, I had just said that you were far-sighted and you made such a grave error! Han TieXuan is a boorish man and it isn’t surprising that he couldn’t see through Ling Tian’s plans. However, do you really not understand his plans?”</p><br/><p>Yu ManTang, who was also the middle-aged scholar that followed Han TieXuan said with a smile, “Big brother, this matter is extremely beneficial to our Yu Family! So what if we let Ling Tian enjoy some benefits? Since we are borrowing his strength, it isn’t wrong for us to give him a few soldiers!”</p><br/><p>“A few soldiers?” Yu ManTian snorted as he looked towards Yu ManTang as though he wanted to devour Yu ManTang alive. “That is a few hundred thousand men! Furthermore, each of them has a war horse! This is a force capable of ruling the continent with some slight training and adjustments! Second brother, you have really disappointed me greatly!”</p><br/><p>Yu ManTang responded with a chuckle, “Big brother, this little brother thinks that things aren’t that serious. Big brother, the battle has not started and we still don’t know how many soldiers will surrender in the end. The way this little brother sees it, fifty to sixty thousand soldiers would already be an amazing feat. Why should big brother bother about those measly soldiers?”</p><br/><p>Yu ManLou began to laugh from anger, “Second brother, for Ling Tian to offer such conditions, he must be extremely confident! Fifty to sixty thousand? I am sure that Ling Tian would only make such a decision if he could ensure a hundred thousand soldiers! If I were him, I would also make the same choice!”</p><br/><p>Yu ManTang replied with a smile, “So what if he has a hundred thousand soldiers? Big brother must be feeling indignant about not taking Ling Xiao’s life this time. You are only focused on this single failure but not looking at the big picture! After today’s battle, the strength of Northern Wei is sure to dwindle, and it will be impossible for them to ever make a comeback! It is almost certain that Northern Wei will fall into the hands of our Yu Family! What does brother think about that?”</p><br/><p>Yu ManTian snorted and said, “This goes without saying, but so what if that was the case?”</p><br/><p>Yu ManTang continued, “Relying on this battle, we have already ensured Han TieXuan’s status in the Western Han army! With his military merits, he will definitely be able to gain command of the whole Western Han army with our aid! At that time, Western Han will also be in our hands. Does big brother agree?”</p><br/><p>Yu ManLou brows were furrowed as he considered the actions he should take towards the two empires after this battle. After a short while, he nodded his head in agreement.</p><br/><p>Yu ManTang then twiddled with his thumb as he said, “As such, our Yu Family would have grasped the military strength of two empires! Together with Ling Tian’s strength, it can be said that half the continent is in the hands of our Yu Family.”</p><br/><p>Hearing this, Yu ManLou couldn’t help but sneer, “Do you think that Ling Tian would be easily controlled by us? With his ambitions, how would he not plot an uprising with such strength in his hands? This is akin to rearing a tiger for future troubles!”</p><br/><p>Yu ManTang shook his head with disagreement, “Big brother misunderstood my intentions! If Ling Tian wants to stabilize Sky Bearing, it will definitely require a great amount of effort. Furthermore, he wouldn’t be able to fully assimilate the surrendered troops into his army so easily either! After that, Ling Tian would still have to deal with the Southern Zheng and DongFang Family. On top of that, the Xiao Family is still laying in wait for their opportunity. If Ling Tian doesn’t replenish his army, how will he deal with them?”</p><br/><p>Yu ManTian let out a sigh as he said, “While your words have truth in them, do you really think that we will be able to deal with Northern Wei and Western Han so quickly? Don’t we also need some time? Furthermore, for such a huge territory to belong to Western Han, do you think they will be able to defend their borders with the small number of soldiers they have? While Ling Tian seems to be giving all the spoils of war to Western Han, all of these things can be easily taken back by him after he stabilizes the internal chaos within Sky Bearing! The Western Han army only has 250,000 soldiers and it is already difficult for them to defend their own borders! There is no need to mention newly acquired territory! If that’s the case, then wouldn’t all the benefits go to waste?”</p><br/><p>Yu ManLou continued with agitation, “As for the wealth obtained from this battle, that is no more than a joke!” Yu ManLou said with a snicker, “When Ling Tian leads his army into battle, wouldn’t he be able to easily seize back all of that wealth? While our Yu Family does receive benefits, we would also be forced to expose ourselves! We can no longer hide behind the back of others and work in the shadows. If that’s the case, wouldn’t the losses exceed our gains?”</p><br/><p>Yu ManTang was stunned for a moment as he asked, “Why does big brother say that?”</p><br/><p>Yu ManLou’s tone was chilly, “After this matter, Ling Tian only has to announce that this battle was a result of him joining hands with our Yu Family. At that time, we will definitely be exposed and be placed in the spotlight! He can even borrow our prestige to further develop his own strength! Furthermore, the other powers definitely won’t covet his strength! With Ling Tian’s wisdom, he will definitely make use of such an opportunity!”</p><br/><p>“How can that be possible? With Ling Tian’s newly acquired strength and swift development, how can the others not be wary of him?” Yu ManTang was completely puzzled.</p><br/><p>“Haiz!” Yu ManLou let out a long sigh as he said with disappointment, “If the other powers were to be aware of us joining in the war for hegemony, would they think that Ling Tian or our Yu Family that has a thousand years of foundation would be scarier? Isn’t the answer to that extremely obvious? In comparison, all the other powers would only be wary of us and not Ling Tian!”</p><br/><p>“I see,” Yu ManTang nodded his head before frowning, “Then what should we do? The negotiations have been completed, and the plan will be put into action in just a short two hours. I am afraid that it is too late to change anything! Furthermore, if we were to delay the battle, we would miss this opportunity to defeat both Northern Wei and Water of Heavenly Wind together!”</p><br/><p>Yu ManLou said with an ashen face, “Second brother, everything is already set in stone and you are still asking me what we should do? Both parties have already begun to put the plan into action, and it is far too late for me to change anything.” After pausing for a moment, Yu ManLou let out a long sigh, “Second brother, this brother knows that you had always been a meticulous and careful individual, thus letting you handle such an important matter. However… you have really disappointed me!”</p><br/><p>Yu ManTang lowered his head in guilt, “This little brother is in the wrong. May big brother punish me.”</p><br/><p>Yu ManLou then glared at him with eagle-like eyes as he asked, “Second brother, answer me truthfully. Did you have a personal agenda?!” The last few words resounded in Yu ManTang’s heart like a loud bell!</p><br/><p>“Big brother!” Yu ManTang raised his head and came into contact with Yu ManLou’s fierce glare. After their gazes met for a while, Yu ManTang slowly lowered his gaze.</p><br/><p>A myriad of emotions flashed past Yu ManLou’s face: frustration, disappointment, heartbreak and even a trace of killing intent. After a long while, he let out a sigh, “It was indeed the case! Forget it! Forget it! Take this to be the dowry of our Yu Family!”</p><br/><p>Turning around, Yu ManLou said with an ice-cold tone, “ManTang, even if you are my brother, I don’t wish for something like this to happen again! When you return, give up all of the responsibilities you have on hand! You aren’t young anymore, and you should enjoy a peaceful time with sister-in-law.” Toward the very end, his tone became softer. With another sigh, his body darted into the air and floated away.</p><br/><p>“Big brother, where are you going?” Yu ManTang asked anxiously.</p><br/><p>From afar, Yu ManLou’s furious voice could be heard, “Going home! If I am not going home, should I remain here and watch Ling Tian capture the surrendered soldiers?!”</p><br/><p>In the darkness, a black figure also followed after Yu ManLou.</p><br/><p>Yu ManTang let out a sigh and looked towards Nine Swallow City. “Ling Tian, Yan’er, your father can only do so much for both of you. Today, I have betrayed the family for both of your sakes and will never get another chance to do so! I hope that the both of you can grasp this opportunity! Don’t let this old man down! Our Yu Family has already let down Yan’er for a full 17 years! Ling Tian, you must take good care of my daughter! Even if she can only stay alive for a single day, I hope that you will let her live that day in joy!”</p><br/><p>The shadows of the trees overlapped each other as the vegetation of the forest swayed in the wind. Yu ManTang’s lonely figure also disappeared into the shadows.</p><br/><p>In the darkness, the Nine Swallow City and Soul Extinguishing Pass were covered in darkness!</p><br/><p>All of a sudden, in the still of the night, the sound of galloping horses could be heard. While they were still far away, the horses were approaching fast!</p><br/><p>In the dark night, elite cavalry troops could be seen on the horizon. There were dozens of such squadrons! However, these troops were obviously not from the Ling Family Courtyard but their strength was in no way weaker than the soldiers from the courtyard! Each squadron was about five to six hundred men in size and the largest one was no more than two thousand in size! They seemed to have fallen down from the heavens! Each of the squadrons only had a single target, the huge Northern Wei military camp!</p><br/><p>A small red signal flare then shot up into the sky with a loud whistle, exploding in the sky with a loud bang! The sky was immediately covered with a bright red, lighting up the dark night sky!</p><br/>\n</div>"}