{"title": "Chapter 342", "id": 342, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-342", "volume_title": "Volume 4", "body": "<h1>Chapter 342</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 342: CrazyTranslator: DavidT Editor: DavidT, Rock</p><br/><p>“Siii!…” Shui QianHuan took in a breath of cold air as his eyes turned as wide as saucers! No wonder Ling Tian said that his defeat was already determined the moment he sent out his troops! No wonder Han TieXuan would suddenly change sides without any warning! No wonder his own sister would go missing in Sky Bearing!</p><br/><p>Yu Family, what a good Yu Family! You indeed lived up to the name of being our thousand-year-old nemesis!</p><br/><p>Han TieXuan changing sides suddenly was something that was completely out of Shui QianHuan’s expectations and also the biggest reason for the Northern Wei’s defeat. Shui QianHuan only came to a realization at this moment! However, Shui QianHuan had thought too far and thought that his sister’s disappearance was due to the Yu Family as well. Indeed, apart from Ling Tian, only the Yu Family would have the ability to capture Shui QianRou in the Heavenly Star Continent. If the Yu Family wasn’t the one who captured Shui QianRou, who else could it be? Furthermore, the Yu Family had always been their greatest enemy for the past thousand years! After hearing what Ling Tian said, Shui QianHuan began gnashing his teeth in anger as a ferocious glare shot out from his eyes.</p><br/><p>Ling Tian then shook his head as he stood up. “Water of Heavenly Wind, Jade of Heavenly Star; hahaha, no matter how powerful the Water of Heavenly Wind is, your Shui Family is at the very most equal to the Yu Family. Don’t forget, this is the Heavenly Star Continent! Hehe, if we were to use these two matters as an example, even if you knew that the Yu Family was the culprit, do you have any evidence? Are you going to try and plot against the Yu Family like how you did against the Ling Family without any reason? It doesn’t seem like an easy matter! Even if you have the heart to do so, do you have the courage? Do you have the ability?!”</p><br/><p>Ling Tian’s tone was filled with mockery and ridicule. But it was also because of his tone that Shui QianHuan’s suspicions towards Ling Tian disappeared.</p><br/><p>Shui QianHuan suddenly stood up straight with a solemn expression and clapped his palms, “Thank you young noble for enlightening me! QianHuan will definitely repay the Ling Family for our previous offenses! Goodbye!” Now that Shui QianHuan’s attention was fully directed towards dealing with the Yu Family, he wanted to mend his relationship with the Ling Family. After all, no matter how powerful their Shui Family was, the Heavenly Star Continent was still foreign ground and it was impossible for them to fight two enemies in the land where the Yu Family had their roots! Especially after seeing the unfathomable Ling Tian the other day, Shui QianHuan was already terrified of him and definitely didn’t want to provoke this devil.</p><br/><p>Shui QianHuan had already come to the conclusion that he was no longer able to control the situation and he couldn’t make such a huge decision either. The only option left for him would be to contact his Shui Family for them to send more men over. Of course, it would be the best if they could deal with the Yu Family together with Ling Tian. However…</p><br/><p>Shui QianHuan let out a long sigh as he regretted his choice of making a move towards the Ling Family! From Ling Tian’s performance today, it was obvious that he wasn’t on the same side as the Yu Family yet. Just like the saying goes, an enemy’s enemy is my friend, but he had lost such a huge ally because he tried to act smart!</p><br/><p>Seeing how Shui QianHuan was about to leave, Ling Tian almost burst out into laughter. He naturally understood what Shui QianHuan’s plans were. However, now that both their families had just fought each other, it was impossible for either of them to have the cheek to suggest an alliance. While Ling Tian was thick-skinned enough to ask for an alliance, he wasn’t too concerned about the alliance. The most important thing would be for everything to turn out fine in the end. However, if this matter were to spread out, not to mention anyone else, even his own father would skin him alive!</p><br/><p>I shall make my plans before making a decision… Ling Tian comforted himself in his heart as he walked out of the room. As he remembered that Ling Chen was currently mentoring Yu BingYan in painting, he wanted to go and take a look at her progress.</p><br/><p>Just when he had left the room, he saw a servant sprinting towards him. Seeing the panting servant, Ling Tian couldn’t help but frown as he looked at the servant approaching him.</p><br/><p>“Young noble, cough cough… Long Xiang… His Majesty is… crazy,” the servant said in a breathless fashion. Ever since Ling Tian had returned, Old Madam Ling gave a strict order to report everything in the Ling Residence to Ling Tian at the first moment. This was for her own personal benefit as she and her husband had been arguing incessantly over Long Xiang’s matters for the past few days and she was also afraid that their daughter might make a foolish move. Thus, she gave such an order in light of the fact that her grandson had many ingenious plans. The moment something was to happen, he would definitely be able to solve the problem with his unusual ideas. Thus, the servant keeping watch on Long Xiang immediately reported the matter to Ling Tian when he realized something was wrong.</p><br/><p>“Crazy?” Ling Tian’s brows furrowed. This fellow didn’t go crazy any earlier or later but right when my father and I returned home? D*mmit, isn’t his timing too accurate?!</p><br/><p>“Yes, he is going crazy.” The servant finally caught his breath as he said anxiously, “This servant was afraid that something might go wrong so I check on him a few times every day. When I saw him in the morning, his long hair was soaked in a pile of his own excrement and he was mumbling to himself with his face in a daze. He should probably be crazy already.” As the servant said that, he observed Ling Tian’s expression and couldn’t help but be terrified.</p><br/><p>To think that Long Xiang would go crazy while he was on duty! Just what kind of bad luck did he have? While Long Xiang was only a captive, he was still Ling Ran’s husband and the young noble’s uncle-in-law!</p><br/><p>“Lead the way, I will go and take a look.” Ling Tian replied calmly. The servant quickly acknowledged that order as he gave a sigh of relief.</p><br/><p>When they were still a ways off, Ling Tian could already smell an odor that attacked his nose. He had always liked cleanliness and couldn’t help but frown. Without stopping, he quickly arrived outside the cell door and looked in from the window.</p><br/><p>He then saw Long Xiang’s hair in a mess with some white and yellow substance smeared in it. His hands were also dirty with a dazed expression on his face. He no longer had the prestige of a ruler and his usually serious expression was replaced with a juvenile look as he sang and hopped around in the stone room.</p><br/><p>A cold sneer could then be seen on Ling Tian’s face as he commanded, “Men, bring a few buckets of water and clean him up! He is the ruler of an empire after all!”</p><br/><p>With a command, the trembling servants flew into action immediately and quickly returned with buckets of water.</p><br/><p>Ling Tian then kicked the stone door open and took two steps back. He then pointed and shouted, “Splash!”</p><br/><p>A bucket of water was then splashed all over Long Xiang and he was drenched from head to toe. Long Xiang then shivered for a moment but quickly regained his crazy appearance. As though he didn’t see a thing, Ling Tian continued to order buckets of water to be splashed on Long Xiang. In just a short five minutes, over a dozen buckets were splashed on Long Xiang and the whole stone room was completely soaked in water.</p><br/><p>Raising his hands, Ling Tian stopped his servants from splashing water and commanded them to sweep the excess water out before walking into the room slowly. While the room was still damp, it no longer had a stench. Ling Tian then gave a calm command, “Wait outside and don’t let anyone within 50 feet of this place! Those who defy me will be executed!”</p><br/><p>The servants all trembled slightly and quickly acknowledged the order.</p><br/><p>Ling Tian paced around the room once as he looked at Long Xiang with a smile that didn’t seem like a smile. “What good acting, you really have some talent. You really shouldn’t be an emperor. If you go and work in an opera house, you can definitely make a good living!”</p><br/><p>Long Xiang looked at Ling Tian with a vacant expression as though he had never seen a live person before. Then, he turned around and began to hum a tune as he danced to it. After wiping the bottom of his feet with his finger, he stuck his finger into his nose and sniffed on it. Following that, he began sucking on the finger as though he was enjoying a fabulous delicacy.</p><br/><p>Ling Tian looked at Long Xiang’s actions with interest before saying with a deep tone, “You originally planned to get rid of my Ling Family with the aid of the Water of Heavenly Wind and Northern Wei, restoring the authority of your Long Family in Sky Bearing. Even if you were to sacrifice some immediate benefits, it would be in exchange for the authority of unprecedented authority. With the support of the Yang Family and their enmity with the Ling Family, all the stars would be aligned and the pieces of the puzzle would all be in place. Thinking that everything was under your control, you decided to scheme against the Ling Family. However, you were unaware that everything you saw and knew were no more than lies!”</p><br/><p>Long Xiang acted as though he didn’t understand what Ling Tian said and acted as though he wasn’t even listening to Ling Tian. After rubbing his finger on his body, a black ball of mud could be seen on his finger. With a wide smile, he dumped it into his mouth and sucked on it happily before swallowing it. At the same time, he mumbled to himself, “I want to eat candy, I want to eat candy! Woah! Nice candy!”</p><br/><p>Ling Tian ignored him and continued, “However, you never thought that this flawless plan of yours had failed when you thought that the Ling Family no longer had anything to rely on. Although you are already a prisoner now, you are actually not afraid in the slightest. You know that your parents-in-law, wife, and daughter are in the Ling Family. Furthermore, the Ling Family has always been merciful and would definitely show you some mercy. You are even daydreaming about the fact that with the Yang Family eradicated our Ling Family might even return you to the throne if you gave us good enough benefits. Ah ah… Mmm, you should have such thoughts…”</p><br/><p>“However, when my father returned safely yesterday, you were truly afraid. You have harmed him too deeply; less than 15,000 soldiers returned from his 100,000 strong army. You have betrayed his trust with your unscrupulous means, and my father already hates you to the core, wanting to execute you to appease his anger! If not for the fact that he was injured and stopped by my grandfather, together with the pleading of my aunt, you would have been turned into a corpse by now! However, you also saw that even my grandfather and aunt’s appearance wasn’t enough to appease the anger of my father! Thus, you were really afraid; afraid that you would die in the hands of my father, right?” Ling Tian slowly analyzed the situation, but Long Xiang’s eyes were not looking at Ling Tian.</p><br/><p>Long Xiang was still dancing around as though he was mimicking the moves of a fairy dancing. He then suddenly sat on the floor as he tried to lift up his feet and send his toes into his mouth. However, with his stiff body, how was it possible for him to do that? Then, he began rolling on the floor as he cried out in an incoherent manner.</p><br/>\n</div>"}