{"title": "Chapter 343", "id": 343, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-343", "volume_title": "Volume 4", "body": "<h1>Chapter 343</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 343: Turning Lies into RealityTranslator: DavidT Editor: DavidT, Rock</p><br/><p>Ling Tian couldn’t be bothered with Long Xiang’s reaction and continued speaking, “The moment you felt that your wife and daughter were unable to protect you, you chose another plan: feign craziness! I have to admit that this is a good plan. The moment you go crazy, my father will not be able to kill a crazy man no matter how enraged he is. Furthermore, your wife and child are living in the Ling Residence and you surely won’t starve to death. As long as you can continue living, you will be able to wait for a chance to rise up again! Mmm, you will probably find your chance with my aunt. Haha, a single day of marriage brings a hundred days of favor, not to mention the fact that you guys were married for more than ten years! You know that my aunt is soft-hearted and extremely reliant on you. Thus, she would be the only chance for you to rise up again. Furthermore, your acting is indeed extremely convincing and even I am unable to find fault with it!”</p><br/><p>Ling Tian then let out a sigh of praise, “Good plan! What a good plan! Especially the fact that you would ignore your status and engage in such filthy acts. No one would even think that it is all an act. No one would believe that the monarch of an empire would resort to such means just to survive! Even I am unable to see any flaws in your acting and can only suspect you! This plan of yours is just too g*dd*mn good!” Ling Tian chuckled, “However, regardless of whether or not you are truly crazy, a single trace of suspicion is enough for me! Furthermore, there is something that is not within your plans. Do you know what that is?”</p><br/><p>“What is it?” Long Xiang was no longer his crazy self as he looked towards Ling Tian with a face full of despair. Ling Tian ignored him from the start to the end and only calmly analyzed the situation. However, each and every single word Ling Tian said had struck the deepest corners of his heart, making it impossible for him to continue feigning craziness. Since Ling Tian had already seen through his act, what was the point for him to continue it? It was no more than a joke if he were to continue his act!</p><br/><p>“The Ling Family still has me!” Ling Tian pointed at himself before continuing, “Talking about acting, I am far more experienced than you! Let me tell you something, this young noble has been acting ever since I was in my mother’s womb! How did you think I got the title of the number one silkpants in Sky Bearing? You actually dare to put up an act in front of me?! No matter how realistic your act is or how entertaining it is, it is no different from trying to flaunt the Analects in front of Confucius! You are no more than a Manchurian peasant trying to flaunt your acting skills in front of an Oscar actor! What a joke!” Ling Tian said with a merciless tone.</p><br/><p>Long Xiang naturally didn’t know what a Manchurian peasant referred to and definitely didn’t know the meaning of an Oscar actor. He only remained silent as he gnashed his teeth in dismay.</p><br/><p>“However, this act of yours reminded me of another thing.” Ling Tian paced around the room with a relaxed expression as though one of his huge problems was just solved. “I was originally frustrated about how I should take care of you! Kill you? Very sadly I can’t! Release you? That’s impossible! But if I can’t kill or release you, am I going to imprison you for life? Furthermore, with Aunt present in the Ling Family, you would have the chance to rise up again! However, I am not willing to take such a risk! Hahaha… just when I was feeling frustrated, you chose to feign craziness!”</p><br/><p>Ling Tian then leaned towards Long Xiang and whispered, “You are a genius indeed! You solved my problem so easily!” Ling Tian said with a bright and warm smile, with his white teeth on full display. However, in Long Xiang’s eyes, Ling Tian was no different from a famished wolf looking at him with his mouth wide open! Long Xiang couldn’t help but stammer, “You… what do you want?”</p><br/><p>Ling Tian had a delighted smile as he lowered his head and said patiently, “Since you are so willing to put on a show, I will definitely fulfill your wish! Since you are already crazy, then I shall truly make you turn crazy! How about that?”</p><br/><p>Ling Tian looked at Long Xiang with a sincere gaze as though asking for his opinion, while he placed a hand behind Long Xiang’s head, “I heard that there is a special part of the brain called the cortex located here. If the nerves within it are destroyed, an individual would become an idiot for life! Your idea is truly a brilliant one… hahaha, let me give your brain a reward first! Mmm, you can be assured that if your unborn child is going to be obedient, I will definitely take good care of him! But if he isn’t going to be obedient, things will be very different. You have to know, the best habit I have is that I will uproot my enemies! However, on account of my aunt, I will not let him know that he has the surname of Long from the day he is born. This surname is truly disgusting, am I right? Ah ah, unless he has also traveled here from another world, but the possibility of that seems small! Haha…”</p><br/><p>While Long Xiang didn’t know what the cortex or nerves were, he could feel that he was in trouble. Thus, he couldn’t help but shout out in reflex, “Help me…”</p><br/><p>Before he could even scream out, he felt a shockwave at the back of his head and Ling Tian’s inner qi rushed into his head…</p><br/><p>Ling Tian then walked out of the room at ease with a relaxed expression, as though he was back from a stroll in the garden.</p><br/><p>On the outside, a large crowd surrounded the place with Old Madam Ling, Princess JiaoYue and Ling Ran at the very front. Duke Ling was standing by the side and even his mother, Chu Ting’er, was there. The moment they saw that Ling Tian was out, they all gathered forward quickly and asked, “How is he?”</p><br/><p>Ling Tian’s expression was solemn as he shook his head without saying a single word. However, the expression on his face had already informed everyone of the outcome.</p><br/><p>With a ‘putong’ sound, Ling Ran had knelt down in front of Ling Tian and hugged his leg tight. “Tian’er, I know you can save him! I know you have that ability. Back when I was afflicted with poison, you were also capable of saving me. Your aunt pleads for you to please save him. Although his sins are unforgivable and he is despicable, he is still my husband! He is still your cousin’s biological father! Tian’er! Please save him? Please, please, please save him!!” As she said that, she began to kowtow to Ling Tian.</p><br/><p>Ling Tian quickly helped her up, “Aunt, aren’t you trying to cut my lifespan short? Don’t worry, as long as there is a trace of hope, our Ling Family will not give up on curing him! I will send out a notice to invite all the famous physicians over to treat him. However, his illness is one of the heart and is different from Aunt being poisoned. It is impossible for me to treat him with my inner qi, I hope you won’t blame me.”</p><br/><p>Ling Ran stood up blankly. As the daughter of the Ling Family, she was naturally well-learned and knew that what Ling Tian said was the truth. Thus, she fell into a daze as she felt her heart turning cold and lost the ability to think.</p><br/><p>As the others opened the door of the stone room, they saw a Long Xiang with lifeless eyes and a juvenile expression. He was laughing foolishly in a corner of the room with a string of shiny drool drooping down from the corner of his lips. Without a second look, everyone was certain that this Sky Bearing former emperor was indeed crazy! It was impossible to feign that expression of his!</p><br/><p>Ling Ran and Princess JiaoYue blacked out and they both collapsed on the floor unconscious! Everyone couldn’t help but panic as they jabbed their philtrum to help the both of them regain consciousness. The moment both of them woke up, they burst out into tears…</p><br/><p>Ling Tian then let out a long sigh and said, “Send my orders to search for famous physicians all over the continent! No matter how much silver needs to be spent and where the physician is, he must be brought in front of me! Until they can treat Long Xiang!”</p><br/><p>A servant by the side acknowledged Ling Tian’s orders and quickly passed it down! At the same time, Ling Ran and Princess JiaoYue also looked at Ling Tian with a gaze full of gratitude! Despite Long Xiang’s unscrupulous schemes towards the Ling Family, Ling Tian was still able to give such an order to help invite physicians to treat his illness regardless of the cost. Such an action of his was already considered extremely benevolent!</p><br/><p>However, they were unaware that Ling Tian’s previous blow to Long Xiang’s brain had rendered him incurable! Not to mention the physicians of this generation, even if the most famous doctors from his previous life were to be gathered, they would still be completely helpless! Even if someone were to cross through worlds and possess Long Xiang, he would still be an idiot for all eternity…</p><br/><p>After taking care of the problem of Long Xiang, Ling Tian felt at ease. However, he still felt a tinge of sorrow upon witnessing Ling Ran’s heartbreak.</p><br/><p>While Long Xiang’s sins were unforgivable and it could be said that he deserved the present outcome, Ling Ran’s actions were without fault! No matter what, Long Xiang was still Ling Ran’s man! The father of Ling Ran’s child! This was something that would never change!</p><br/><p>On this point alone, perhaps all the women in the world would be alike. Ling Tian then let out a sigh as he thought about Ling Chen. If he was in Long Xiang’s shoes, what would Ling Chen do? Perhaps she would be even crazier than his own aunt! Even if he was a living devil and the demon in everyone’s eyes, Ling Chen was still his Ling Chen!</p><br/><p>Love was something that had no logic!</p><br/><p>Ling Tian then thought about how many gentle and beautiful women from his previous life had fallen in love with murderers, rapists, or even drug traffickers, making one sigh in pity! Did these women not know that the guy they were in love with was a criminal? Did they not have a trace of justice in their hearts? Definitely not. Under the spell of love, even if they knew that they were wrong, they would still stand against the world. In their hearts, they were not willing to let their beloved suffer from the slightest bit of injury!</p><br/><p>Women! Ling Tian sighed on his way back to his courtyard. Just when he finally sat down, news came from the courtyard. There seemed to be some problem with the surrendered soldiers and Shui QianRou was demanding to see him.</p><br/><p>Ling Tian rubbed his temples and let out yet another sigh. Even though everything was supposed to be concluded and it was supposed to be time for his break, he seemed to be even busier than before!</p><br/><p>Ling Chen could naturally see what he was thinking about and said with a smile, “Young noble has more responsibilities because of your capabilities. If they were all as capable as young noble, young noble’s talents wouldn’t be able to stand out.”</p><br/><p>Ling Tian looked at her beautiful face and couldn’t help but be tempted again. Stroking her face gently, he said with a perverse smile, “Is this young noble really very… capable? I think Chen’er should be the most familiar with that…”</p><br/>\n</div>"}