{"title": "Chapter 348", "id": 348, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-348", "volume_title": "Volume 4", "body": "<h1>Chapter 348</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 348: Mysterious Heavenly Sword, Complete!Translator: chuchutrain Editor: DavidT, Rock</p><br/><p>Ling Chen had an epiphany, chuckling as she replied, “No wonder young noble gave her the time limit of a month to cure the poison, so that was the case. Young noble, you’re really too bad!”</p><br/><p>“I had no other alternatives left to me.” Ling Tian sighed once as he shook his head. “Against someone like Shui QianRou who is dead loyal to her family, I had no other choice. Even this decision of mine may not be the best.”</p><br/><p>“I’m not sure why, but I keep feeling that this Miss Shui is actually quite the pitiful person.” After walking for a while with Ling Tian, Ling Chen felt his heavy emotions and finally couldn’t keep her thoughts to herself.</p><br/><p>“Pitiful?” Ling Tian coldly replied, “A pitiful person is so because there is a point that people hate! She’s not pitiful at all, for she is placing her family’s benefit above all else! Just like a crazed devout believer, ready to sacrifice all they have for what they believe in. She completely does not know what actually she wants, and what she needs to do! Such a person is not pitiful, but rather foolish! Extremely foolish!”</p><br/><p>“Chen’er, as a woman, you can go wild, go crazy for the man you love, and you can also sacrifice yourself for your family, your relatives. However, the point I can’t accept is a woman sacrificing herself in the name of her family! What does a family stand for? It’s merely a rotten and old-fashioned way of showing one’s reputation! In the business area, women sacrifice themselves in order to obtain benefits for their family to survive, and in the imperial court, men use women to exchange for favors to ensure their meteoric rise in their careers. Across countries, emperors use women to exchange for temporary world peace. Hahaha, bullsh*t! All these matters are supposed to be achieved by your own hands, and to think that you do that by exchanging women? They should be ashamed of themselves! Men who treat women as objects don’t deserve to be men! They should just castrate themselves and live their lives as eunuchs!”</p><br/><p>“As for those women who willingly sacrifice themselves for their family and clans, they might never get to understand just what they have traded their life for! What they get in exchange is just the contempt of the clan! Other than her parents, no one will think about the woman’s future or happiness! Thus, is her sacrifice really worth it?”</p><br/><p>“One should always take their life in their own hands. Be it man or woman, there is no difference!” Ling Tian harshly spat out. “One can work their tail off for the family, but they should never have to sacrifice themselves for the family! A family clan is just like a country. Those who sacrifice themselves for it should be men and not have them hide behind a woman! As for the women, they should be cherished and loved, and not sent out to be a shield for the family!”</p><br/><p>“Young noble’s words might make sense,” Ling Chen slowly responded, after pondering about it, “but Chen’er feels that there is nothing wrong in the woman giving up her life for the family. To protect the clan should not just be the responsibility of the men. A woman should have equal responsibility.”</p><br/><p>Ling Tian laughed out cheerfully. “To hear you say this makes me very happy. However, this is my own deep-rooted problem. I know that I might be a little chauvinistic at times, but this is something that I’ve never been able to live with, even since I was young.”</p><br/><p>Lightly leaning against Ling Tian, Ling Chen voiced out softly, “Young noble is a hero of this present age, and of course will not be able to accept this act of trading women or children for benefits. However, Chen’er dares to confirm something.” At this point, her face revealed a mesmerizing smile.</p><br/><p>“What are you sure about?” Ling Tian asked.</p><br/><p>“If a girl could be the woman of someone like young noble, that would be the most blissful thing in her entire life. I don’t doubt it!” Ling Chen giggled.</p><br/><p>Ling Tian stood in shock for a while, before sighing and saying, “That might not be true. There are no absolutes in life! In the end, I’m still a man, and I will have problems, like being unfaithful, or not being able to control my desires. When I see a pretty girl, I can’t help but take a few extra looks. I’m just not good at controlling my desires. Chen’er might be my favorite woman, but this doesn’t mean that I will not love anything except you!”</p><br/><p>A sweet smile blossomed upon Ling Chen’s face, “So long as I’m young noble’s favorite, that’s enough for me. Young noble is also too modest, for someone of your stature, how could there not be many women throwing themselves at you? If it was some other young noble, he would have long ago married and set up a family. Young noble is already being very disciplined! In the eyes of Feng Mo and the rest, they respect you for this point!”</p><br/><p>“Hahaha,” Ling Tian chucked at her speech. “little lass, how would you know. I would rather have a fresh and juicy peach like you, than to eat a mushy and wrinkled dried apricot!”</p><br/><p>Ling Chen’s face reddened, and she pretended to stomp her feet in anger. Suddenly, she turned and blew lightly in his ear, whispering, “Young noble, then…. this fresh peach here… was it sweet?”</p><br/><p>Ling Tian’s eyes lit up, and as his eyes roamed over her svelte body, he subconsciously stretched out his tongue, licking his lips hungrily as he nodded his head. “Sweet! So sugary, that this young noble’s teeth are all dropping out!”</p><br/><p>“You’re so naughty!” Ling Chen’s face turned completely red and she immediately ran forward in a hurry.</p><br/><p>“Young noble Ling, Lady Ling Chen.” From up ahead someone approached them. It was Meng LiGe.</p><br/><p>“Mister Meng,” Ling Tian greeted him with a smile. “May I ask where is Mister Meng headed to today?”</p><br/><p>“I’ve something to discuss with young noble.” Meng LiGe stared at Ling Tian with his bright eyes, bearing a solemn expression.</p><br/><p>“Please tell me, Ling Tian is all ears.”</p><br/><p>“I feel that your remarks and opinions today might not be appropriate.” Meng LiGe spoke with a heavy expression, “If young noble’s aim is to protect your family and place well, then that is naturally not a problem. But if young noble would like to conquer all under heavens, that might not be a good thing.”</p><br/><p>“Oh? Let’s hear the details.” Ling Tian smiled.</p><br/><p>“Even in the ancient times, the saying goes, ‘Having the heart of the citizens equals obtaining all under heaven’! However, young noble’s cruel way of treating the soldiers is poles apart from what the sayings follow, and this is a violation! If you want to achieve something bigger, then you need to be magnanimous and treat everyone well. Only then will you achieve their undying loyalty to you.” Meng LiGe gabbled non-stop, obviously a little unsatisfied at how Ling Tian was not living up to his expectations.</p><br/><p>Ling Tian now looked at Meng LiGe with a weird look. “Mister Meng, Ling Tian actually thought that having read through all the classics, you would have long understood their underlying meanings and not blindly believe in what they have said. However, I found out today that even someone of your caliber is still restricted by conventions!”</p><br/><p>Meng LiGe flared up, “Young noble, are you just refusing to listen to the bitter truth?”</p><br/><p>Ling Tian shook his head in response, “It’s not that I can’t listen. I also understand the meaning of bitter truth. Regarding this matter on governance, in my opinion, the sentence of ‘Having the heart of the citizens equals obtaining all under heaven’ is just a mistake!”</p><br/><p>“Mistake?!” Meng LiGe’s rage shot up, and he boomed out, “This is the great way of governing all under heaven, set by all our ancestors a long time ago. How could there be a mistake?!”</p><br/><p>Ling Tian only smiled mysteriously. “Let’s put it this way. I’ll trouble Mister to return and browse through the ancient records. I’ll gift you with a sentence, and if Mister thinks that Ling Tian is wrong, then Ling Tian will gladly accept punishment. How about that?”</p><br/><p>“Good!” Meng LiGe forcefully spoke.</p><br/><p>“However, if your scrutiny proves that Ling Tian is correct, then what will you do?” Ling Tian looked at Meng LiGe with the kind of expression a fisherman would have when setting a bait to reel in a fish.</p><br/><p>“If that’s the case, then I would be willing to strive to my utmost to contribute to young noble’s cause! I’ll even offer my life to your cause!” Meng LiGe was decisive, and knowing what Ling Tian wanted, he immediately laid down his cards.</p><br/><p>“Good!” Ling Tian praised.</p><br/><p>“Then may I ask young noble, what is the sentence that you wish to give me?” Meng LiGe asked.</p><br/><p>“Simple, it is to reverse whatever that has been said.” Ling Tian enunciated every word slowly, “To, control, all, under, heaven, is, to, obtain, the, citizens’, hearts!”</p><br/><p>Ling Tian then laughed as he walked away, with Ling Chen tagging along behind him. He left behind a ruminating Meng LiGe, his head lowered as he pondered Ling Tian’s words. As Ling Tian walked away, he recited, “Before conquering all under heavens, I only need to utilize, to guide the hearts of the citizens and their grievances. That is enough! If my heart is not stable, what right do I have to talk about the hearts of the citizens? Only after I’ve conquered all can I begin to focus on getting the hearts of my people, only then can my governance last. At that time, it will really be called achieving the hearts of the citizens! Thus, the meaning of knowing the hearts of all under heaven is actually just listening and knowing what the masses want!”</p><br/><p>Meng LiGe raised his head up, looking at the back of Ling Tian walking into the distance. He sank into deep thought at Ling Tian’s speech.</p><br/><p>Just as the various leaders of the Ling Family Courtyard sat down with Ling Tian for a meal, someone came up to report to Ling Tian, saying that Shui QianRou had already left. Ling Tian only nodded and gave an instruction to Ling Feng and Ling Yun. The two of them nodded, immediately setting off.</p><br/><p>Ling Chi was still leading the new law enforcement squad members to clean up the surrendered members in the battlefield. Inside the Courtyard, a strong smell of blood could be noticed from a long ways away! In the distance, one could see cartloads of bleeding corpses being sent out.</p><br/><p>The gentle and soft-hearted Ling Chen furrowed her brows, unable to eat anymore. Seeing this, Ling Tian lightly squeezed her hand, sending an apologetic look to her.</p><br/><p>Ling Chen tucked her head down in embarrassment but still allowed him to continue holding her hand. At the same time, she felt that the reek of blood was not that unbearable any longer.</p><br/><p>Ling Jian spoke at this time, “Young noble, Ling Five has already sent over that completed black iron sword that you asked for. Without your instructions, we didn’t dare to move it, and we left it in the secret chamber. Does young noble wish to have a look at it?”</p><br/><p>Ling Tian immediately felt a rush of excitement, exclaiming, “That’s definitely something I need to see. Alright, let’s head there immediately.” As he spoke, he was already standing up. While the rest knew that this was a plan from Ling Tian and Ling Jian to help Ling Chen, how could they still let go of such a good opportunity to have a meal with Ling Tian? Thus, someone suggested, “How about we bring some wine and dishes there, sampling wine while observing a sword, that’s a great joy in life. Young noble, please agree!”</p><br/><p>Ling Tian smiled in agreement, leading everyone to begin packing up.</p><br/><p>The secret chamber was bereft of furniture, with only ten odd-looking swords hung on the wall. This was how Ling Tian had requested it, without embroidery and pretenses, just a black forest of weapons, emitting waves of killing intent!</p><br/><p>Ling Jian stepped forward, grasping one of the swords in his hands. With a shrill sound, the sword was pulled from its sheath. Those present immediately felt a drop a temperature as a wave of light refracted off the sword body, illuminating the room without restraint.</p><br/><p>“This sword 2 feet, 9 and ¾ inches long, weighing 3.85 kilograms. The sword body has been refined and smelted a hundred times, consisting of steel mixed in with the inkblack steel. This sword can cut through metal like mud!” Ling Jian pulled out the sword on his waist with his other hand and swung it towards the black iron sword!</p><br/>\n</div>"}