{"title": "Chapter 356", "id": 356, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-356", "volume_title": "Volume 4", "body": "<h1>Chapter 356</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 356: Deliver JusticeTranslator: chuchutrain Editor: DavidT, Rock</p><br/><p>Under the boost provided by Ling Chen’s ‘man and sword as one’ realm, her speed far outstripped the green-robed man! A light ‘Eh’ sound came out of the latter’s mouth, followed by him suddenly pausing his advancement, and turning to face Ling Chen in a very natural manner while drawing out a sword. There was no flamboyance in his motions; he simply chopped downwards, meeting head-on with Ling Chen’s mighty charge!</p><br/><p>However, that simple chop, in the eyes of Ye QingChen and Yu ManTian, seemed to have the intention of wanting to rend the skies and split the earth!</p><br/><p>“Clang!” The moment the swords intersected, Ling Chen let out a stuffy groan, but still ruthlessly slapped forward with her left hand! A sneer appeared in the green-robed man’s face, and he too pushed out his left palm to meet hers. Shockingly, he felt as though he was clutching a millennia-old mysterious ice shard, with the cold permeating to his bones immediately the moment their palms met each other! He couldn’t help but feel a jolt of fear in his heart, immediately increasing the intensity of strength in his palm strike!</p><br/><p>Ling Tian had just picked himself off the ground, and chanced upon the scene of Ling Chen disregarding her life to fight it out with the green-robed man! He jumped in shock, immediately shouting out, “Chen’er! Don’t go head-on with him!” Immediately, he threw himself towards their fight!</p><br/><p>Ling Chen only felt an earth-shattering wave of power surge towards her, and immediately submerging and drowning her within. Her palm seemed to have been slapped towards a lofty mountain instead of another flesh and blood palm, causing the bones in her hand to almost be shattered! A stream of blood started to flow out from her dainty lips, but she didn’t retreat, instead infusing the dredges of her internal energy into her black iron sword, thrusting it forward even more!</p><br/><p>If you’re trying to hurt my young noble, then you better kill me first!</p><br/><p>The originally sweet-tempered Ling Chen seemed to have an expression full of killing intent at this point, with the resolve of dying rather than living with regrets!</p><br/><p>Even if it costs me my life, I’ll exchange it to injure you! Then, when my young noble fights against you, it would be a lot easier for him! If I can increase the odds of success for him, my death is worthwhile!</p><br/><p>“Hong!”</p><br/><p>“Hong!”</p><br/><p>Two loud claps were heard! Just as Ling Chen launched her final desperate blow, Ling Tian took the chance to launch his attack! Besieged from both front and back, the green-robed man had no choice but to take both blows head-on!</p><br/><p>A wave of unbelievable internal energy surged out of the green-robed man, causing Ling Tian to stagger back a few steps. A sweet taste surfaced and he quickly swallowed the mouthful of blood that he was about to spit up. If he really spat out that mouthful of blood, leading to a loss in his vital energy, he would never have the chance to survive against the green-robed man!</p><br/><p>A pitiful groan was heard, as Ling Chen’s body floated down like a ball of cotton. She fell into the already prepared arms of Ye QingChen.</p><br/><p>“You g*d-d*mned piece of sh*t! Why don’t you open your eyes and see who’s here? Being so reckless and throwing people down like that, what happens if you injure this old man here?” Ye QingChen already knew that Ling Chen’s injuries were not light, and immediately began to infuse his internal energy to help her treat her injuries while scolding out towards the green-robed man.</p><br/><p>As the smoke dispersed, the green-robed man’s lean face could be seen. However, he was in a bad state, with half of his body looking as though he just ran out of a fire, with his hair curling up from the heat, and with his green robes being burnt in several places! This was caused by Ling Tian’s Divine Shocking Dragon Formula. Upon seeing Ling Chen madly revolving her Divine Ice Formula for her final attack, he complemented her by using his pure Yang internal energy to the utmost.</p><br/><p>The other half of the green-robed man was just the opposite, with frost covering his robes from head to toe! There was even a layer of ice crystals on his face! However, all this disappeared the moment he revolved his internal energy, expelling the invading energies. Looking perfectly normal once again, he stared in amazement at Ling Chen, saying, “What an amazing cultivation technique this lass is practicing! An absolute Yin energy path is indeed terrifying!” Only after this did he seem to notice Ye QingChen, “Old Ye, why are you here? Do you know this lass?!”</p><br/><p>“If not for you, why would I even be here?” Ye QingChen replied gruffly, before handing Ling Chen back to Ling Tian.</p><br/><p>“You’re the Martial Order Medallion owner? Justice?” Ling Tian did a rough scan and found out that Ling Chen didn’t actually have any threatening injuries. She was merely overwhelmed by the internal energy that collided against her, and passed out. While holding onto her right hand to aid her recovery, Ling Tian stared daggers towards the green-robed man in front as he spoke.</p><br/><p>“To be born requires justice, to die also is to encounter justice. Justice governs over the samsara, and I’m here to deliver justice!” The green-robed man recited. “That’s right, my name is Justice, here today specially to deliver justice to you!”</p><br/><p>“Damn your mother, you’re here to deliver justice?” Yu ManTian had long picked himself up, and now started to shout out, spewing spittle everywhere, “What kind of person are you to say that?”</p><br/><p>The green-robed man, Justice’s cultivation far outstripped Yu ManTian. But with the latter’s temper, forget Justice, he would even scold the Heavens if they were in front of him! Of course, that and the fact that he was not aware that Ye ChaoChen, an elder in his father’s generation, had actually fallen to Justice! Then again, even if he knew, he would still not admit defeat even if he was beaten to death!</p><br/><p>In that instant, dense killing intent shot out from the eyes of the green-robed man! To be aware of his strength and still daring to spew his mouth off so, Yu ManTian was probably the only one!</p><br/><p>Justice had actually just reached Sky Bearing today, but had been shocked by the arrogant shout from Ling Tian! For someone of his caliber in the pugilistic world, he naturally could tell that there was a thirst for battle in that cry! He had followed the cry and rushed over, only to receive the attack from three experts. While he was not injured, he was caught in a rough situation! His robes and hair were even destroyed, which was something he had not experienced for a long time!</p><br/><p>As for the battle just now, only Yu ManTian was actually injured. Ling Chen was only shaken unconscious due to her overexertion and didn’t even have the slightest wound on her. However, the surprising thing was that Justice’s original target, Ling Tian, was actually uninjured even though he appeared disheveled! He had completely utilized his retreating force to neutralize the offensive energy that he encountered!</p><br/><p>In their two clashes, the first was a direct fist confrontation. Ling Tian had used the retreating force to smash through two walls, transferring the energy over to the walls! As for the second clash, he had actually neutralized the energy through the revolution of his own internal energy!</p><br/><p>While a part had to do with the fact that the second strike only contained half his original strength as he had to deal with Ling Chen at the same time, but to have Ling Tian be able to forcefully neutralize a good 50% of his strength left Justice in shock!</p><br/><p>Surprisingly, the same was true for Ling Tian. While Ling Tian appeared relaxed, he was in fact in complete shock that he had utilized his full strength, as well as a pincer attack to force him to divide his strength, and yet nearly spat out blood! This fellow’s martial arts were indeed extraordinary! Indeed, he lived up to his name of being the number one under heaven!</p><br/><p>“So what? You still want to play? This daddy isn’t afraid of you!” Seeing the killing intent directed towards him, Yu ManTian thrust out his chest, snorting in anger.</p><br/><p>“Third Uncle…” It was unknown when Yu BingYan had arrived, but she called out worriedly, and glancing to see Ling Tian carrying an unconscious Ling Chen, she unconsciously yelped, immediately walking over, “Sister Chen… what’s wrong with you?”</p><br/><p>“She received a small injury, but nothing serious.” Ling Tian quickly pacified her. As he spoke, he signaled with his eyes towards Ye QingChen.</p><br/><p>“Since you already caused me to develop killing intent, then how about I fulfill your wish for death?” The killing intent in Justice’s eyes got fiercer, as he slowly strolled towards Yu ManTian.</p><br/><p>“Please wait!” Ye QingChen cut in. “Justice, don’t be hot-tempered. This old man has some matters to discuss with you.”</p><br/><p>“What is it? You can say it directly!” Tian Li stopped but continued staring at Yu ManTian. There was no joy nor anger in his voice, but rather it was flat like a wooden board.</p><br/><p>“Justice, you’re here this time to kill me, right?” Ling Tian suddenly asked in a bright tone, however there was an obvious hint of sarcasm within. “I indeed didn’t guess wrong, you’re afraid.”</p><br/><p>“Afraid?” A hint of laughter appeared in Justice’s eyes. “Afraid that you would surpass me in the future?”</p><br/><p>“That’s right!” Ling Tian spoke without any trace of humility on his face. “Give me 10 years, and I’ll be able to trample you underneath my feet! However, you will definitely not risk this.”</p><br/><p>“Your plan of instigation is really good,” Justice replied with narrowed eyes, “And it would work for me. I really wish to give you 10 years of time, but sadly, my identity is now that of the Martial Order Medallion owner! Now that I’ve reclaimed the Martial Order Medallion, forget 10 years, I’ll not allow you to live past 10 days!”</p><br/><p>“Oh, seems like sire will still allow me nine days worth of time, is that right?” Ling Tian nodded his head. “Thank you for that.”</p><br/><p>“Are you trying to play tricks on me? Trying to be a rascal?” Justice suddenly turned to face Ling Tian, the sharpness in his eyes as though it could materialize and actually be a sword. “Any sort of mind games will not work with me! I’ll not give you any chance to delay your death, and neither will I allow you to play any games with me! My objective is only to kill you, and thus, you are dead to me!”</p><br/><p>“Oh. If that’s the case, then I definitely have to leave behind a will before I die. Justice, since you name yourself as Justice, surely you would allow this man here to leave a few words behind, right?” Ling Tian laughed.</p><br/><p>Justice also laughed at that. “Of course I will not be so unreasonable. Besides, you’re also friends with Old Ye here!”</p><br/><p>“Since that’s the case, then many thanks.” Ling Tian politely smiled and gestured for Yu BingYan to take Yu ManTian away. “I believe the martial head of Beyond Heavens wouldn’t lower himself to fight with a rude boor, right? He doesn’t really know who you are and just has the desire to fight you. You must be able to differentiate between battle intent and killing intent, right?”</p><br/><p>“That’s right, if he had killing intent, I would have long targeted him before you!” Justice loftily replied.</p><br/><p>“Your mother should be the one being targeted…” Before Yu ManTian got to finish his cursing, Ling Tian had applied pressure on his acupoint, knocking him unconscious and pushing him onto Yu BingYan. He instructed slowly, “Take your third uncle into the room and stay there. Don’t come out.”</p><br/><p>Yu BingYan looked at Ling Tian with frightened eyes, pleading, “Brother Tian… let me accompany you!”</p><br/><p>Ling Tian’s face grew heavy. “If you take me as your husband, then listen to me!” Since they had already gone through their engagement, saying something like that was not wrong.</p><br/><p>Yu BingYan stared at him in a daze, before the haze in her eyes cleared, replaced with blind devotion and love. She slowly replied, “Yan’er will definitely listen to her husband’s words. If husband… then Yan’er will not live out the rest of her life alone!” She then dragged Yu ManTian’s huge figure away.</p><br/>\n</div>"}