{"title": "Chapter 357", "id": 357, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-357", "volume_title": "Volume 4", "body": "<h1>Chapter 357</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 357: Lonesome like SnowTranslator: chuchutrain Editor: DavidT, Rock</p><br/><p>Ling Tian sighed once, and patting Ling Chen on her back, he injected his internal energy into her, to rouse her. Seeing Ling Tian still standing in front of her, very much alive, a hint of a relieved smile appeared on her face. Ling Tian was just about to speak but noticed a group of people rushing towards his courtyard. They turned out to be his grandparents and parents.</p><br/><p>After hearing that earth-shaking noise and disturbance from Ling Tian’s courtyard, as though the entire heavens and earth had been overturned, how could they still be so relaxed? They immediately threw down all their matters and rushed over.</p><br/><p>Ling Tian groaned inwardly and could only go to greet them.</p><br/><p>“Tian’er, what happened here?” Ling Xiao was still wrapped all over in bandages and spoke in a pained voice.</p><br/><p>“What else could make me like so?” Ling Tian laughed without betraying any of his worries. “Elder brother Ye had brought a few of his friends over, and we decided to exchange some moves. Who knew that in my carelessness, I would cause such an incident. It seems like your son is going to be bankrupt.”</p><br/><p>Seeing the entire courtyard in disorder, Ling Xiao could only guffaw out loudly. After seeing the indomitable sight of his son mowing through the 400,000 strong enemy troops, his son was already considered unparalleled under heaven to him! The moment he heard Ling Tian speak as such, he had already relaxed his stance.</p><br/><p>At this point, Old Grandpa Ling as well as the rest had also spotted Ye QingChen, and realized that this was a group of experts sparring and exchanging moves. Since there was a personage of the Beyond Heavens present, there was no harm in leaving them to it. They merely exchanged some greetings before Ling Tian sent the four seniors out of his courtyard.</p><br/><p>“Did you not think about getting the whole group of your subordinates to surround and attack me together?” The moment the Ling Family members had arrived, Justice had been standing on the far end, as though distancing himself. Right now, he approached Ling Tian, with a smile and yet not a smile on his face as he asked, “The group of youths under you have passable martial skills. If you gathered all of them and asked them to barricade me, you might still stand a chance.”</p><br/><p>“I never thought that Sire would also like to jest!” Ling Tian snorted disdainfully at that, “Do you even believe your own words? Don’t think that this young noble doesn’t know, little tricks like encircling and trapping do not work on you, and instead serves as a stumbling block for me since I need to coordinate with them, allowing you more chances!” In their last exchange, Ling Tian found out that Justice’s repelling force contained a hint of chilling cold. He had actually managed to borrow a portion of Ling Chen’s attack and used it to repel Ling Tian. In this case, surrounding him with manpower would only cause him to have more strength to counter Ling Tian!</p><br/><p>This sort of martial skill that specialized in diverting force seemed like the Undying Seal Law from ‘Twin of Brothers’ in Ling Tian’s memory! Thus, to Justice, encirclement was just a joke that was not the least funny. Recall the scene from when he snatched the Heaven Splitter, wasn’t he also encircled? What happened in the end? If it was not for the fact that Justice didn’t wish to engage in an all-out slaughter, there would be many more innocent lives lost that day!</p><br/><p>“Chen’er, fetch some jars of Hero’s Blood. Since my elder brother has come for a visit, I definitely have to have a good drink with him!” Ling Tian smiled as he gestured to Ling Chen.</p><br/><p>“That’s right, Justice, you definitely must try it. This little kid’s wine is really top in the world! No counterfeit goods involved!” Ye QingChen laughed. Justice smiled slightly as he nodded his head. He understood that this was Ye QingChen trying to help Ling Tian stall for time. Since this matter didn’t have a deadline, what was wrong in giving his old friend some face? Ling Tian would just die at a later date. Be it tonight or tomorrow night, was there a difference?</p><br/><p>Besides, Justice actually held Ling Tian in great admiration. This was especially when he heard Ling Tian’s arrogant shout when he just entered the capital. ‘In this world, who can understand how lonely I, Ling Tian, am?!’ The bold words struck a chord with him, thus making him rush over immediately! If he didn’t care about his status, he would have long ago shouted back, “In this world, who can understand my, Justice’s, loneliness?!”</p><br/><p>This youth was probably the only person who could understand and empathize with himself! While both of them didn’t have any relations with each other, Justice had developed this sort of innate instinct deep in his heart. A pity, he had to die! And all because of the Martial Order Medallion!</p><br/><p>Life is really lonesome like the snow!</p><br/><p>Ling Chen seemed to hesitate a little, looking at Ling Tian. She was afraid that Ling Tian was sending her away so he would face Justice one-on-one.</p><br/><p>Ling Tian laughed as he pinched her tiny nose, “Chen’er hurry up. I still have some matters I need to pass down to you, so I won’t leave just yet!”</p><br/><p>Ling Chen’s eyes lit up. That’s right, if her young noble really wanted to leave, with his temperament, he would first settle all outstanding matters. She immediately nodded and turned to leave.</p><br/><p>“The achievements of this lass in the future cannot even be measured! Within 30 years, she might actually reach the peak of the martial way!” Justice gazed at Ling Chen as he slowly spoke.</p><br/><p>“Eh? Does senior have thoughts of accepting her as a disciple?” Ling Tian immediately looked towards him. “However, while Senior has many accomplishments in martial arts, if you were to have instructed her instead of me, she might not have reached her current level.”</p><br/><p>“Haha, you’re right in that.” Justice didn’t refute Ling Tian’s statement. “I might be good at cultivating, but this doesn’t mean I can teach my disciples well. In this point, I definitely have to take my hat off to you.”</p><br/><p>Ling Tian laughed and flicked his sleeves. A sudden gust of wind came, sweeping up all the various debris of the battle before on the floor, and a table and some chairs flew over.</p><br/><p>He gestured for the two seniors to take a seat, before looking all around him. He suddenly let out a laugh, “Old Justice, everything turned upside down the moment you arrived. If an outsider was to look at this scene, who would believe that this was the residence of the great Ling Family? Everyone would think that this was a beggar’s nest!”</p><br/><p>Justice laughed along, but suddenly fell into silence as he stared at Ling Tian, “I’ve killed many people, but this is the first time that I’m going to have wine with someone I’m about to kill! You’re actually different from all those I’ve killed. No wonder Brother Ye looks up to you.”</p><br/><p>“Oh? Is that so? I thought you had discovered it early on, but it seems like you never noticed.” Ling Tian smiled carelessly towards Justice. He maintained an easy and confident stance, as though nothing could affect him.</p><br/><p>Justice sank into deep thought for a while before suddenly speaking out, “You seem as though you are rather confident of escaping from my hands? From your attitude and words previously, can I assume that?!”</p><br/><p>“No, it’s not that I’m rather confident,” Ling Tian slowly nodded as he smiled, “But that I have absolute confidence! You will not be able to kill me!”</p><br/><p>“HAHAHA…” Justice burst out into crazed laughter, a finger pointing towards the heavens. “Kid, you know what? I’m liking you more and more right now. Your arrogance and pride are really unmatched under the heavens! You thick-skinnedness really makes one gasp in amazement.”</p><br/><p>At this point, Ling Chen was carrying a few jars of wine using a broken piece of a door as a tray. In a soft and charming voice, she spoke out. “Senior Justice, your confidence and pride are also number one under the heavens!”</p><br/><p>Ye QingChen and Ling Tian laughed at that, with Justice pausing in shock. He too couldn’t help revealing a smile in response.</p><br/><p>Ling Tian took a jar and broke the seal with a well-placed palm as he beckoned, “Chen’er sit down with us. You won’t get many chances to drink with these two esteemed figures from Beyond Heaven. Furthermore, one of them is even the self-proclaimed number one under the heavens!”</p><br/><p>Ling Chen chuckled at his words. “In my heart, there is only one person worthy of that title, and that is you, young noble.” She then sat down, but surprisingly, she chose her seat to be in between that of Justice and Ling Tian. Justice glanced once at her, and could only let out a bitter smile in his heart. Silly lass, since I have already promised brother Ye, I definitely will not make a move now! However, he couldn’t help but admire her loyalty and devotion.</p><br/><p>The dark red wine was poured into four beautiful white jade goblets, and the rich fragrance of the wine suffused throughout the entire courtyard. Ling Tian raised his goblet up, and smiled, “It’s rare that we have such a chance to congregate and share a cup together. Justice, do you dare to drink my wine?”</p><br/><p>Justice merely smiled and downed the contents of his cup in one go. Laughing, he replied, “So what if there’s poison? In this world, is there any poison that can still affect me? I’d rather it be poisoned, so I could kill you sooner and clean up the entire matter!”</p><br/><p>The pupils of Ling Tian shrank, but he hid it with a laugh, “Bold indeed! Ling Tian admires you. However, Brother Justice, you’re destined to not get your way.” He too downed the contents, before getting Ling Chen to refill their goblets.</p><br/><p>Ye QingChen looked at the two of them and suddenly sighed. The strong taste of premium wine that he had incessantly thought about for the past half year suddenly turned bland and dull to him.</p><br/><p>After drinking another cup, Ling Tian suddenly stood up. “My two seniors, please continue, I’ll be speaking to my wife in private.”</p><br/><p>Ye QingChen immediately took the chance and cut in, “No worries, it’s ok if you take more time.” Justice didn’t reply but only had a smile hung on his lips. He didn’t pay attention to Ye QingChen trying to outvoice him.</p><br/><p>Ling Tian tugged Ling Chen to a corner, before speaking in a low tone, “Chen’er, remember everything that I will be saying next! You cannot allow any negligence, or the consequences will be unimaginable.”</p><br/><p>Ling Chen only thought that Ling Tian was leaving behind a will, and felt thoroughly broken-hearted, almost crying out loud. With tears welling up in her eyes, she stared dumbly at Ling Tian, as though she could never get enough of him. How could she still bother as to what Ling Tian was about to say?</p><br/><p>Ling Tian helplessly sighed, and could only explain slowly, “As you saw, we cannot overcome him through encirclements. If we make a move here, not only will I be hindered, but we will also injure the people in the Ling Residence. Thus, I’m planning to lure him outside. I’ll think of an idea that will allow him to accept a bet from me and set a time limit for him to kill me. If this doesn’t work out…” Ling Tian caught himself and glossed over it. “I’ll need you to take care of the family, so I will not have any hesitations and can go all out to contend with him.”</p><br/><p>Ling Chen immediately stopped crying. Could it be…</p><br/>\n</div>"}