{"title": "Chapter 380", "id": 380, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-380", "volume_title": "Volume 4", "body": "<h1>Chapter 380</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 380: Do You Dare Fight?</p><br/><p>Translator: DavidT Editor: DavidT, RockShui QianHuan let out a sigh, “I only have a rough idea and had already sent a message back to the family requesting reinforcements. However, the situation is extremely challenging at the present moment. The Yu Family has sent out a few hundred White and Purple Jade experts to Sky Bearing and is covetously eyeing the Ling Family. However, our ally the Northern Wei has already been crippled by Ling Tian and it is impossible for them to recover from their defeat! I originally wanted to make use of the Yu Family’s ambitions to join hands with the Ling Family, but Ling Tian is already being chased by the Martial Order Medallion owner right now… With all our problems coming at the same time, we are in an extremely awkward predicament!”</p><br/><p>“We cannot make any rash moves now and the strength the Yu Family has gathered in Sky Bearing is too frightening. They had shifted almost half of their Yu Family over to Sky Bearing and the battle prowess stationed in Sky Bearing currently has already exceeded what they have in their headquarters! Perhaps, it can be said that Sky Bearing is like a second base for the Yu Family in the Heavenly Star Continent! If we were careless and let them pick up our trace, the consequences would be unimaginable! The things we can do right now are just far too little! As for interfering with the Martial Order Medallion owner chasing Ling Tian, we do not have enough manpower and it is impossible for us to influence a battle of that level. Also, Beyond Heavens is not a power that we can afford to provoke at this time…” Shui QianHuan said with worry, frustration and even a trace of helplessness. The situation in front of him was far too messy, and it was no surprise for him to be at a loss.</p><br/><p>“At the same time, the Xiao Family is too far away. Even if the strength of the Xiao Family isn’t any weaker than the Yu Family, our family reminded us before we came that the Xiao Family isn’t too simple either! It is best that we do not provoke the Xiao Family! According to our informants, the Xiao Family has been acting extremely mysterious in recent years and before we receive any instructions from the family, it is best for us to avoid them. As for the other Great Families, the XiMen Family have already been half crippled by Ling Tian and the elites of the NanGong Family were wiped out by Ling Tian’s scheme! The only two more complete families are the DongFang and BeiMing Families. However, they are too far away and wouldn’t be able to solve our problem!”</p><br/><p>As he made his calculations, Shui QianHuan became shocked, “This Ling Tian is amazing indeed. Have you realized that the few families that have fallen are all due to this brat’s schemes! Causing wind and storms at the flip of his palm, he is truly tyrannical and difficult to deal with.”</p><br/><p>“The Yu Family sent a huge number of troops to Sky Bearing? Why? Does the Yu Family want to throw the world into chaos and unite Heavenly Star?” Shui QianRou asked with doubt. Apart from recuperating in the past few days, she rarely left her room. With only Die’er by her side, it was impossible for her to find out what had happened on the outside recently. However, it seemed as though the Yu Family had actually sent out a huge number of troops under the guise of sending their dowry. Thus, she could not help but be startled as she began to think about the various possibilities.</p><br/><p>We must not let the Yu Family do as they wish! It would be the best if we can drive a wedge between them and cause the marriage to be annulled… as she thought about that, Shui QianRou could not help but turn slightly pinkish as she asked herself, Am I thinking about my family or do I only want to ruin their wedding? No! I am definitely thinking about my family, why would I care about that b*st*rd?!</p><br/><p>After thinking for a long while, Shui QianRou finally said, “However, our strength in Sky Bearing is too weak, and the Ling Family does not have Ling Tian to make decisions within the family. The Yu Family would definitely think that the Ling Family was already at their mercy, and we can make use of this point to turn the situation around! If we are able to turn this situation around and grasp the Ling Family is our hands, we would receive the greatest benefit!”</p><br/><p>As Shui QianHuan heard that, his eyes lit up and just when he was about to say something, a white light flashed in front of his eyes and a dagger was shot through the window, landing on the table between the both of them. Shui QianHuan immediately blew out the oil lamp in front of them and they both immediately ducked into the corner of the room without hesitation. The next moment, the room was filled with darkness with only the moonlight shining into the room.</p><br/><p>Being in the darkness, not knowing who their opponent was and how many people they were facing, it would be a rash move for the both of them to leave the room! The best option would be for them to remain calm and observe the situation first. Both the siblings had the same thought as they held their breath and hid in the shadows. Even Die’er by their side also knew what to do and hid behind a clothes rack.</p><br/><p>A while later, a cold mocking tone sounded, “In the middle of the night with both of you seated beside the window, if I really wanted to kill you, at least one of you would be dead by now! To think that you are not coming out to welcome us now. Water of Heavenly Wind, hehehe, you are indeed the number one family in the Heavenly Wind Continent! Your courage makes me gasp in admiration.”</p><br/><p>Hearing this, the faces of both the siblings were flushed red! Shui QianRou then responded with a cold grunt, “In the middle of the night, hiding on top the roof and acting in such a sneaky manner! You only know how to catch us with our guard down! However, brother’s movement technique does make me gasp in admiration.”</p><br/><p>A chilly laugh sounded from the outside and the sound of fluttering clothes could be heard. Following that, a soft knocking sound could be heard on the door and the voice asked, “I hope that you will forgive this uninvited guest for his sudden visit.” As he said that, he did not wait for a response and the doors were swung open. A white figure could be seen standing outside with his frosty eyes looking like the stars in the night sky, gleaming in the darkness. Since Shui QianRou said that he was acting sneakily, he walked right out into the open!</p><br/><p>A small flame was lit, and then Shui QianRou lit the oil lamp. “A noble guest has come to visit and I hope you will forgive us for not going out to welcome you.”</p><br/><p>The guy chuckled and walked right into the room without a trace of fear on his face. It was as though he was walking into his own house and was extremely carefree.</p><br/><p>The three of them in the room looked over to see a refined young man who looked like he was only eighteen to nineteen years old. While he had an elegant appearance, a chilly aura emanated from his body.</p><br/><p>“It’s you!” Shui QianHuan stood up warily as he recognized the intruder. Taking a step forward, he stood in front of his sister, using his body as a shield. The young man in front of them was someone who he had seen on the battlefield! At that time, he was right behind Ling Tian and when his Shui Family elder tried to block this young man, the elder was killed in just a few moves. How could Shui QianHuan ever forget who this young man was? The martial arts of this young man were something that shouldn’t be underestimated!</p><br/><p>“I am Ling Chi, and everyone calls me the Ling Chi who slices an opponent into a thousand pieces.” Ling Chi said calmly with a trace of pride in his eyes. Back then, his young noble had once said that the cruelest punishment on earth would be to slice up the offender into a thousand pieces!</p><br/><p>From then on, everyone had been teasing him about his name but Ling Chi 1 was not angry at all but enjoyed it instead! It was only because that was the name his young noble had given to him. At the same time, his young noble had also said that if anyone were to provoke him, it would be his job to slice that person into a thousand pieces!</p><br/><p>What a majestic name! Of course, it was also a name that disgusted many others!</p><br/><p>“Ling Chi? You are one of Ling Tian’s underling?” Shui QianRou had also seen Ling Chi before. Back at the Smoky Thea Tower, it was Ling Chi who had barged into their chamber and fell onto their table. Shui QianRou’s memory was extremely good, and she obviously knew that Ling Chi’s appearance was Ling Tian’s doing. At the same time, she had also taken note of this individual who had created trouble back then. However, Ling Chi acted like a clown back then and definitely didn’t have the elegance he displayed today. Although she knew that Ling Chi was related to Ling Tian, she didn’t know what their relationship was. Shui QianRou didn’t suspect Ling Chi’s identity and she pushed aside her brother in front of her.</p><br/><p>“I am naturally my young noble’s servant.” Ling Chi said with respect in his eyes and pride on his face.</p><br/><p>“Hmph hmph, to think that you can be so proud of being a servant! You were really born to be a servant.” Off to the side, Die’er popped out and looked at Ling Chi with anger. Back then, when Ling Chi had slammed onto the table, he had sent all the dishes and soup flying in all directions. While the other martial arts experts were able to avoid the mess, Die’er wasn’t able to do so and was completely soiled. Thus, she naturally hated Ling Chi and had not put down her grudge even up to now!</p><br/><p>However, Ling Chi ignored her completely and asked the two Shui siblings, “My big sister sent me here to ask young noble Shui and miss Shui a question: The Yu Family is in Sky Bearing now; does the Shui Family dare to fight them?”</p><br/><p>“Who is your big sister? How can we believe you?!” Shui QianRou frowned as she thought about the white-dressed lady who was always behind Ling Tian, “Is your big sister Ling Chen?”</p><br/><p>Ling Chi smiled and said calmly, “My big sister said that if the both of you are sincere, we will await your arrival at the Ling Family Courtyard at noon tomorrow! I will be taking my leave!”</p><br/><p>Ling Chi cupped his fists and walked out.</p><br/><p>“Oi! Stop there!” Die’er jumped in exasperation.</p><br/><p>The moment she said that, Ling Chi’s originally slow pace sped up and he disappeared completely.</p><br/><p>Should they go or not?</p><br/><p>This was definitely an important choice! Especially during such a sensitive period!</p><br/><p>However, both the Shui siblings were extremely wise individuals and made their decision after a short discussion. While this was an important choice, there wasn’t much of a point for them to discuss too much about it. Or perhaps, there wasn’t even a need for them to have any discussion as they did not have any other choices. If they could join hands with the Ling Family to ruin the Yu Family’s plans and perhaps injure them along the way, both Shui QianHuan and Shui QianRou would be extremely glad to make that choice. Without a doubt, there wasn’t a more suitable partner for them to form an alliance with.</p><br/><p>Even if Shui QianHuan were to ignore the thousand-year-old grudge between their families, he felt that all of his failures in Heavenly Star was due to the Yu Family controlling the scenes from behind! He already wanted to give the Yu Family a good blow to vent his pent-up anger! As for Shui QianRou’s thoughts, they were even more complicated than her brother’s…</p><br/><p>The only thing the both of them couldn’t be certain about was just which family should take the lead in the alliance.</p><br/>\n</div>"}