{"title": "Chapter 384", "id": 384, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-384", "volume_title": "Volume 4", "body": "<h1>Chapter 384</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 384: Operation Begins</p><br/><p>Translator: chuchutrain Editor: DavidT, RockLing Jian coughed out twice in embarrassment, sounding like a chicken whose neck was being wrung. His plan had been completely seen through by Ling Chen. It did not matter to him if he would be sentenced to death for breaking the rules or be canceled off the name list of the First Pavilion, but if he lost his title as a brother to the young noble, that was unacceptable! This was also the cruelest punishment for him!</p><br/><p>On that night, the doors of the Ling Family Courtyard silently opened, and seven great steeds silently left the compound, each carrying a person clothed in black. The soft clopping of horse hooves broke the serenity of the night, as these seven figures full of killing intent rushed towards the north!</p><br/><p>In the distant skies of the north, the clouds lazily drifted by, and under the light of the moon, they turned into a weird shade of red, almost like blood…</p><br/><p>***</p><br/><p>After sending the specialized secret missive to Ling Thirty, who was also known as XiMen Sa, Ling Tian began to slowly walk into the Western Sky Restaurant! Western Sky Restaurant, the biggest restaurant in Celestial Gathering City and was just beside the grand and magnificent main entrance of the XiMen Family! It was not yet lunchtime, so there were not many people inside the restaurant. Only a sparse scattering of tables were filled which made the place seem even more spacious.</p><br/><p>Right now, Ling Tian’s current image was similar to Ye QingChen’s fortune teller image, and he had even pasted a beard to his face. Clad in a handsome set of robes, he displayed a demeanor that looked as though he had descended from the high heavens!</p><br/><p>After asking for a seat by the window, Ling Tian leisurely took a seat, a heavy look on his face as his mind started to work. While he believed that he had temporarily put down the terror that was Justice, but having accidentally caused such a big event in Celestial Gathering City, it would be bound to attract Justice back here in a short while! By then, how could he resolve this matter? Was he wrong in making a move?</p><br/><p>The sound of footsteps was heard, and following that was a respectful voice saying, “Nice to meet you, Young Noble XiMen.” After the standard greetings had been exchanged, a set of light footsteps were heard as a person walked towards Ling Tian. The footsteps sounded rushed and hurried, apparently the person was quite excited.</p><br/><p>“Mister, young noble here has been facing some problems recently, could I beg Sire to divine for me my road in the near future?” A light-hearted voice sounded from beside Ling Tian.</p><br/><p>Everyone was originally surprised as to why their youthful and pleasant little young noble XiMen Sa immediately walked towards the fortune teller when he came in. However, upon hearing his words, they immediately understood; how could it be just facing some problems these days? They were literally in the dumps! No wonder this young noble XiMen was leaning on spiritual support right now!</p><br/><p>In a flash, Ling Thirty had already taken a seat opposite of Ling Tian, and on his handsome face there was a slight flush and a fiery excitement hidden in his eyes, full of respect and admiration!</p><br/><p>“Haha, I’m not sure, what matter would this Young Noble want to consult me about?” Ling Tian only indifferently laughed in response, but his eyes shot out a warning look.</p><br/><p>“This young noble would request Sire to look into my life in the future! How will my luck be like? Will my house be in any danger, and would this danger be able to be solved?” While Ling Thirty still looked a bit unnatural, but at least he appeared more at ease right now.</p><br/><p>“Haha, all of these are actually secretive matters. As the saying goes, ‘The sayings of Heavens cannot be revealed, and the teaching of the Ways will never pass through six ears’. Under such a large audience, how could I reveal so many things?” Ling Tian purposefully increased his volume as he smiled.</p><br/><p>Indeed, the moment he finished speaking, an attendant quickly ran over, stammering, “Young Noble XiMen, how about I get you a private room to continue your conversation with this esteemed Sire, would you be okay with that?”</p><br/><p>Ling Thirty carelessly waved his hands, completely displaying his bearing as an aristocratic child, “Lead the way!” After that, he turned to Ling Tian and replied, “Sire, please!”</p><br/><p>“I wouldn’t dare, Young Noble please go ahead!” Ling Tian smirked inwardly as it seemed like his gamble in choosing this kid had paid off! There was no hint of any of his thoughts on his expressions. He had originally thought that this kid was just a loyal follower who idolized him, but now it seemed like he was also good at acting!</p><br/><p>“Thirty pays respects to the Young Noble!” The moment they entered the private room, the proud air present on his face dissipated, and with a ‘putong’ sound, he kneeled on the floor, tears of joy already springing up in his eyes. He continued in a trembling voice, “The moment I heard that Young Noble was made a target using the Martial Order Medallion, Thirty felt that every day spent here was like a year, constantly worrying about your well being! To be able to finally see young noble today, it is a matter worth celebrating! With your miraculous ways of killing, how could a mere Martial Order Medallion owner be able to match up against you?!</p><br/><p>“Come on, get up. You’re already so old, why are you bawling so much for!” Ling Tian smiled as he stooped down to pick him up. “If anyone were to see the grand young noble XiMen actually kneeling like a servant, there would be unwanted gossip. How’s your side so far, is everything successful?”</p><br/><p>Ling Thirty happily sat back down, and smiled bashfully, “I just knew it, with young noble’s peerless skills, the Martial Order Medallion owner would not be able to trump over you. However, I was still extremely unsettled at heart, please forgive me.”</p><br/><p>Ling Tian nodded his head, but gravely spoke, “That Martial Order Medallion owner, Justice, is extremely pedantic, and his martial skills are also at the top of the upper echelon. While I typically do not look up to anyone, but for this person, I can’t help but admire and respect him!”</p><br/><p>Ling Thirty replied nonchalantly, “But despite how high his skills are, he still cannot compare to my young noble!”</p><br/><p>Ling Tian bitterly laughed, “If he was just good at martial arts, do you think that I would bother running for such a long distance, and avoid clashing with him for the past thousand miles? If he could be dealt with using pure strength, then why would I leave Sky Bearing and not just try to overwhelm him with numbers? Without a doubt, his capability is the highest I’ve ever seen in my entire life! We exchanged a few moves, and every time I had to use up my treasures, even gambling with my life. The last exchange we had, if I did not resort to betting my life, I definitely would not have been able to escape from his hands!”</p><br/><p>Ling Thirty was tongue-tied, “Before I met you today, I heard rumors that he was in pursuit of you, and it was such exciting gossip that almost every person in the pugilistic world was aware of it. I had merely thought it was someone deliberately spreading falsehoods, but to think that there was really such a person under the heavens! I even wanted to use the strength of Celestial Gathering City to entrap him…”</p><br/><p>“Thank goodness you didn’t try anything. This person’s strength cannot be suppressed through numbers. If you were to forcefully attempt it, you would just be sending people to their deaths! However, you don’t need to worry about this currently, because he has already been lured away by one of my tricks, and I believe that he should currently be quite a distance away from the city! Alright, let’s not talk about him first, explain to me about the situation here. Is everything going well?”</p><br/><p>Hearing Ling Tian’s question, Ling Thirty perked up and bowed as he replied, “Everything is going as in young noble’s plans, still relatively successful. After I brought the whole stack of war spoils into the Celestial Gathering City, my position was elevated, and right now, I’m the only successor in line for the head of the XiMen Family. However, that being said, all matters in the family still have to go through a group of old fogies, so for the time being, we can’t change the situation.”</p><br/><p>Ling Tian frowned, “Stupid! I’ve spent so much effort to eliminate all those potential candidates from the direct line of descent in the XiMen family, don’t tell me you still have to wait for a bunch of old men to die on their beds before you can receive the authority?”</p><br/><p>Ling Thirty lowered his head and spoke with grief in his tone, “Young noble, actually those weaker elders have already been eliminated by me, but there are still four of them that I’m not confident of with my current strength, thus…”</p><br/><p>“There are four of them? Which four?” Ling Tian’s face grew heavy.</p><br/><p>“XiMen WuYi, XiMen Sheng, XiMen Kuang and XiMen ChongTian. These four have stronger martial skills than mine, and they all have their own trusted aides, thus….” Ling Thirty hemmed and hawed, his face turning pale with fright. Thinking about Ling Tian’s anger and dissatisfaction, the stress he felt increased even further, to the point that he was literally sweating.</p><br/><p>Instead of being afraid that Ling Tian was going to punish him, he was more afraid that Ling TIan was disappointed in him!</p><br/><p>“If that’s the case, then I’ll tell you a piece of good news, out of the four, only three are left.” Ling Tian indifferently spoke. “XiMen Sheng died in my hands just earlier today. XiMen Kuang has an arrogant attitude, and I believe getting rid of him will not be a big matter. The main point is that XiMen ChongTian cannot die right now! We still need him in the Western Han army, curbing the strength of Han TieXuan and indirectly the Yu Family. However, as for the Family Head XiMen WuYi, it’s better to leave him with a breath to struggle at death’s door. If you really want to take over official control of the XiMen family, then you will definitely require some support. Thus, before you can take over the family, you must leave him barely alive!”</p><br/><p>Ling Tian coldly laughed, a chilling gleam in his eyes as he said, “Give me all the information about XiMen Kuang and XiMen WuYi. Since I’m already here at Celestial Gathering City, then I might as well leave my mark!”</p><br/><p>Before Ling Thirty left, Ling Tian had indifferently commented, “After those XiMen guys get into trouble, you must, in the shortest time, create as much chaos as you can in the Western Han Empire. The bigger the better, the best would be to attract all the different countries to come and participate! This would help us with our plans in Sky Bearing! However, your safety remains the utmost priority, this is my rule! I do not want to see years down the road, that a Thirty is not by my side!”</p><br/><p>The two of them exchanged words of farewell, each leaving their separate ways!</p><br/><p>In the darkness of the night, Ling Tian borrowed the force of his movement technique to silently soar out from the window of his inn, flying like a shooting star towards the west side of the city. A cool breeze lingered on his face, and there seemed to be a hint of a fishy smell. Was it an indication that tonight going to be one full of blood and slaughter?</p><br/><p>Outside the Celestial Gathering City, the elder of the XiMen Family, XiMen Kuang, had brought over twenty of his personal guards and direct line descendants and was making merry in a tent.</p><br/><p>“Elder, the family head wants us to search for the location of Ling Tian, but instead we’re… Anyways, this place also isn’t too far away from the city, but not exactly near either. Even if we were to search for Ling Tian, because of his need to hide from the Martial Order Medallion owner, he would either be hiding in the deep forests or in the city. How would he be in such a location? If the great elder finds his traces before we do, then the gains will not make up for the losses. There has been no signal from them for the whole afternoon, so maybe they’ve already found Ling Tian!” One of the men was slurring as he daringly spoke, possibly because of the alcohol.</p><br/><p>“Idiot!” While XiMen Kuang seemed like he was scolding, his eyes had already narrowed to slits as he continued, “Let me ask you all, what do you think of the Martial Order Medallion owner’s skills?”</p><br/><p>“I’ve heard that he is the publicly acknowledged number one person, but I’m unsure if that’s the truth!” The same man looked up with squinty eyes and let out a belch. “If the legends are true, then half of his skill would allow one to roam the world unhindered.”</p><br/>\n</div>"}