{"title": "Chapter 385", "id": 385, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-385", "volume_title": "Volume 4", "body": "<h1>Chapter 385</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 385: Unprecendented</p><br/><p>Translator: DavidT Editor: DavidT, Rock“With just you? Stop dreaming. The Martial Order Medallion owner has a nickname: sending justice. While there aren’t many people that he sends justice to, each and every one of them were all top-notch experts! Even if you have only 30% of his abilities, it is enough for you to be one of the top few experts in the world!” XiMen Kuang picked up a roasted chicken and bit off a portion, “Let me ask you, how are Ling Tian’s martial arts?”</p><br/><p>“Ling Tian is, of course, an extraordinary character as well.” That burly man said with a look of admiration, “He was actually able to charge into the 400,000 strong Northern Wei army alone and was not injured at all! Furthermore, that number one expert has been chasing him for so long and news of his death hasn’t spread yet! From this, it can be seen that even if Ling Tian is weaker than the Martial Order Medallion owner, he shouldn’t be too far off.”</p><br/><p>“Hmph! If that’s the case, can any of us be a match for Ling Tian or the Martial Order Medallion owner?” XiMen Kuang said with a gloomy expression.</p><br/><p>“Haha, Elder, are you kidding? If we were to face either of them, our deaths would be certain!” That burly man gave a thumbs-up to XiMen Kuang, “Brilliant! Elder, you are truly brilliant! This plan of yours is brilliant indeed. Letting First Elder run into a wall! Perhaps he will meet his end.”</p><br/><p>XiMen Kuang stroked his beard and smiled delightedly, “If we were to put an effort to search for Ling Tian’s whereabouts, with the size of our XiMen Family’s information network, it would be impossible for us to not have a clue at all. However, have you thought about what will happen if we were to find them?”</p><br/><p>That burly man trembled slightly as he sobered up a little. The moment they were to meet with those two jinxes, they would be dead for sure!</p><br/><p>XiMen Kuang snorted, “Let us not talk about whether or not we can block Ling Tian first. Even if we can block him, by the time that the Martial Order Medallion owner arrives to kill him, how many of us would be left alive at that time? If we don’t meet Ling Tian but the Martial Order Medallion owner instead, what should we do?”</p><br/><p>All of their faces turned pale as beads of sweat rolled down their faces and they let out a heave of relief. They all looked at XiMen Kuang with gratitude and said, “Our lives were all saved by Elder.”</p><br/><p>XiMen Kuang let out a strange laugh and said mockingly, “Only an idiot like XiMen Sheng would put in all his effort to find those two jinxes. For him to not send back any news after so long, he probably met both of them already and has been buried underground! Haha.”</p><br/><p>“Brilliant, brilliant! Elder XiMen Kuang truly has incredible foresight,” a clear voice sounded.</p><br/><p>“That’s right!” XiMen Kuang raised his head up proudly, “When this old man was roaming around the pugilistic world back then, my friends gave me a nickname: Mr. Smart! Hmph hmph, you bunch of…” As he said that, XiMen Kuang suddenly realized that something was wrong!</p><br/><p>That voice did not belong to anyone of his XiMen Family members! Thinking about that, XiMen Kuang could not help but be alarmed as he shouted, “Who? Who dares to make a fool out of your granddaddy XiMen!”</p><br/><p>A white flash could be seen, and a charismatic youth suddenly appeared in their tent and in front of XiMen Kuang! He looked at XiMen Kuang with a carefree and cordial smile as though he was meeting an old friend.</p><br/><p>XiMen Kuang was completely dumbfounded! This is because he realized that the oil lamp in front of him did not even sway when this white-dressed youth entered! To think that this white-dressed youth was able to enter at such a speed without bringing a single gust of air with him! What kind of a movement technique was that?! How many people in the world were able to have such an exquisite movement technique?</p><br/><p>“You… friend, who are you?! This old man is XiMen Kuang from the XiMen Family!” XiMen Kuang’s face began to contort, his beard trembling as he took a few steps back.</p><br/><p>“I do not believe that the world-famous Mr. Smart will not know who I am.” The white-dressed youth squinted his eyes and said with a chuckle, “Since Elder XiMen has the nickname of Mr. Smart, if you can’t guess my identity, then… I will be extremely disappointed.”</p><br/><p>XiMen Kuang looked as though he was about to cry as he said with a hoarse and trembling voice, “How… how would I know who this friend is?”</p><br/><p>“Oh? You don’t know who I am? Really?” The white-dressed youth said with a benevolent expression, “Then you should think carefully. Mmm, think again carefully. Eh, with your body trembling and face turning pale, it looks like you are very afraid. How strange,” the white dressed youth turned around and said with a puzzled expression, “since you don’t know who I am, what are you afraid of?”</p><br/><p>The white-dressed youth said with a look of concern, “XiMen Kuang, do you have epilepsy?”</p><br/><p>XiMen Kuang’s knees buckled as he nodded his head vigorously, “Yes… yes… I have epilepsy… epilepsy…”</p><br/><p>“Oh, no wonder.” The white dressed youth said with enlightenment, “So you have epilepsy!”</p><br/><p>XiMen Kuang’s face turned ashen as he said softly, “Yes yes yes. I have epilepsy… on account that I did not have a good life, will young noble…”</p><br/><p>The white-dressed youth then let out a long sigh of regret, “I originally didn’t have the intention of killing you, but since you have epilepsy, you wouldn’t be able to have a good life anyway. If that’s the case, there isn’t any reason for you to be kept alive. I shall perform a good deed and send you along then!”</p><br/><p>With a strong sense of humiliation, XiMen Kuang almost wanted to let out a roar. However, his fear still took the upper hand and he began to plead instead, “Young… young noble Ling, you are a benevolent senior and I have never provoked senior before. Senior, may you treat me like a fart and let me off easily. This old man is already in my old age, and I don’t have many more years to live. The heavens will reward the kind, wuwuwu…” At the very end, this Third Elder XiMen actually began bawling!</p><br/><p>Ling Tian was dumbfounded!</p><br/><p>“What the f**k! This is an elder of the XiMen Family?!” Ling Tian spit and was filled with disdain, “How frustrating! To think you are called XiMen Kuang! The world famous ‘Mr. Smart’?!”</p><br/><p>Ling Tian could not help but feel depressed! Originally, he intended to come here for a massacre. However, he never imagined such a scenario would occur and that XiMen Kuang was actually such an individual. Ling Tian suddenly felt that killing such a person would be dirtying his hands! However, Ling Tian had no choice but to kill XiMen Kuang because of his mission and could not help but be extremely depressed!</p><br/><p>What is this? If I kill him, I will dirty my hands! If I don’t, I will fail my mission! If I were to let this elder remain alive, it would definitely be a huge wildcard for Thirty! For him to be all the way out here alone, I can’t afford for anything to go wrong!</p><br/><p>As XiMen Kuang saw Ling Tian’s face turning uglier and uglier by the second, his knees gave way from fear and they could no longer hold up his own bodyweight. With a ‘putong’ sound, he knelt down on the ground as he trembled, “May young noble be benevolent and let me off…”</p><br/><p>For the very first time in his life, Ling Tian fell into a dilemma!</p><br/><p>As for the other twenty people, their faces were all pale and not a single one of them dared to place their hand on the hilt of their sword! It was as though they were twenty pillars rooted to the ground with fear in their eyes. Not to mention fighting, they probably didn’t even have the guts to move their legs in the slightest!</p><br/><p>Could they still be called men?!</p><br/><p>Ling Tian finally gave out a sigh and waved his hands with a deflated attitude, “All of you cripple your cultivations. This young noble doesn’t have the mood to touch any of you! Don’t create any trouble for me!”</p><br/><p>XiMen Kuang’s body began to tremble with his face filled with despair. To a martial arts cultivator, losing his cultivation was no different from death! He just could not understand why Ling Tian wouldn’t let him off despite him kneeling on the ground and pleading for his life!</p><br/><p>XiMen Kuang’s lips trembled for a while and he pleaded, “I hope young noble will be benevolent. This old man is willing to cut off my arm to gain the chance to survive. This old man does not want to lose the martial arts that have accompanied me all my life during the final few years of my life. I hope young noble will fulfill my wish.”</p><br/><p>Ling Tian waved his hands impatiently as he shouted, “Since I asked all of you to cripple your cultivation, hurry up and do so! Why are you guys still acting in such a wishy-washy manner? Do you really want me to take action personally?”</p><br/><p>XiMen Kuang continued to struggle, “Ling Tian, you are also a martial arts cultivator and should understand what it means to lose your cultivation! Why do you have to be so overbearing? If you show us some mercy, we will be able to meet each other happily again in the future! Why does young noble Ling have to be so overbearing and force us to our deaths?!”</p><br/><p>Ling Tian could not help but feel disgust in his heart! At this moment, Ling Tian suddenly thought about the traitors in his previous life during the war against Japan! He could not help but be filled with disdain as he thought, Such a b*st*rd! If he were to be born in that generation of my previous life, he would definitely be a traitor! How many people will be harmed because of him! Thinking about that, killing intent rose from his heart!</p><br/><p>As XiMen Kuang witnessed the rising killing intent from Ling Tian, he thought that Ling Tian was about to launch his attack and was overwhelmed with despair. Thus, he could not help but let out a roar, “I will fight you to the death…wuwuwu…” He then pounced forward and let out a palm strike!</p><br/><p>Ling Tian let out a sigh and sent out his own palm strike! A miserable shriek sounded…</p><br/><p>***</p><br/><p>As Ling Tian traveled in the night sky, he felt a strange sense of frustration!</p><br/><p>Since the ancient times, there have been many different kinds of people. Some killed because of fear, some killed to the point they were numb to it, some got more excited as they killed and some puked after killing someone. However, there was no one like Ling Tian who felt gloomy from killing someone!</p><br/><p>From the ancient times until now, Ling Tian would probably be the first and last one!</p><br/>\n</div>"}