{"title": "Chapter 399", "id": 399, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-399", "volume_title": "Volume 4", "body": "<h1>Chapter 399</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 399: Divine Bone Shrinking Art</p><br/><p>Translator: DavidT Editor: DavidT, Rock“If these people are useless, what is the point of keeping them alive? Since all of their roots are in Northern Wei, do you expect them to be useful in Eastern Zhao or Western Han instead?” Ling Chi snorted, “We have only managed to hire the First Pavilion to work with us after spending millions of gold. Presently, the First Pavilion people have hidden in Northern Wei and assassinated the eldest son of the Yu Family Head, Yu LiuYun. As a thousand-year-old family, all of you actually remain insincere and refuse to cooperate at such a moment, giving up on such a precious opportunity. What a joke!”</p><br/><p>Shui QianHuan felt a jolt through his body as he exclaimed, “You mean to say… the First Pavilion isn’t going to retreat after the assassination? They are going to aid us?”</p><br/><p>“Retreat after the assassination? What a joke! If that was the case, why would it require such a hefty price?!” Ling Chi pursed his lips and said, “After the First Pavilion assassinates the targets, we have to control the positions which have been vacated and grasp the authority of Northern Wei in our hands to crumble the authority of the Yu Family. This is our full plan in Northern Wei! When the matters in Northern Wei are settled, your Shui Family experts should have arrived at Sky Bearing and we can launch our attack against the Yu Family’s forces in Sky Bearing. If not, how will we be able to deal with three hundred white jades and five hundred purple jade cultivators?!”</p><br/><p>As Shui QianHuan heard what Ling Chi said, his eyes began to light up and he stood up abruptly, “Miss Chen has great foresight indeed! If that’s the case, let us not waste any time and rush to Northern Wei for the next step of the plan! Haiz, brother, why didn’t you inform us about such a huge matter beforehand?” Shui QianHuan was filled with excitement but grumbled at Ling Chi.</p><br/><p>“Young noble Shui, these are things that you should have understood and taken the initiative on yourself. We thought that the thousand-year-old Shui Family would definitely understand the logic of fishing in troubled times but never expected you to remain motionless. You have really disappointed us greatly.” Ling Chi let out a sigh and lamented. Shui QianHuan immediately began to stutter with his face turning bright red.</p><br/><p>“Also, I believe it is sufficient for young noble Shui to head to Northern Wei alone right?” Ling Chi reminded, “Miss Shui should remain in Sky Bearing to preside over the matters here so that you do not forget about the matters in Sky Bearing. If that’s the case, it is best that only one of you goes to Northern Wei.”</p><br/><p>The siblings looked at each other and felt that Ling Chi’s words made sense. Furthermore, the Ling Family had already displayed their sincerity with their actions, and it wouldn’t be appropriate for them to remain motionless. Thus, they agreed without hesitation.</p><br/><p>However, Shui QianRou felt a sense of unease in her heart and felt that something was wrong with the plan. But even after thinking through the plan multiple times, she was certain that there were only benefits to their Shui Family despite the risks. Thus, despite the doubts in her heart, she did not mention them to her brother and instead reminded him to pay attention to his safety and not take any risks.</p><br/><p>Shui QianHuan naturally knew of the dangers involved in is trip. However, how could he receive any benefits without taking risks? For the past thousand years, when had it been a safe affair when both the Yu and Shui Families gathered? What could the little dangers in his present trip be considered? If he could make use of this opportunity to greatly weaken the Yu Family, even his death would be worth it! Furthermore, his family had great expectations of him, but he had failed his family twice after arriving in Heavenly Star. If this were to continue, his position of successor would definitely be in peril. Be it for his family or himself, he had no choice but to accomplish this task! The trip to Northern Wei had to go smoothly!</p><br/><p>Thus, Shui QianHuan didn’t have a single shred of hesitation!</p><br/><p>***</p><br/><p>A secret chamber in the Ling Family Courtyard.</p><br/><p>Yu BingYan’s eyes were blindfolded by a thick black cloth and in front of her was a brush, ink, and canvases on the walls surrounding her. At this moment, the canvases on two of the walls were already filled with painting.</p><br/><p>By having her eyes shut, her memory, concentration, and stability were put through a rigorous test and the paintings on the walls were all of medium difficulty. For Yu BingYan who had never come into contact with such a task before, her current achievements were already considered outstanding, and it was thanks to her hard work and the bitterness she had to suffer!</p><br/><p>The corners of Yu BingYan’s lips were raised slightly as a gentle yet resolute tone sounded in her ears, “Entering the martial arts realm through painting to aid me, Ling Tian!”</p><br/><p>She would only have the right to help Ling Tian if she could meld her martial arts into her paintings and painting into her martial arts! If not, what was the point of her existence if she couldn’t help her most beloved man? Ever since she arrived at the Ling Family Courtyard, Yu BingYan had hidden herself in the secret chamber and dedicated her time to the studying of painting. All of her daily activities and needs were taken care of in the secret chamber ever since she had arrived!</p><br/><p>Yu BingYan stretched out her hand and grasped the brush on the table. She lifted the brush, stained it with ink, shifted her body, and made her first stroke in a single fluid motion without pausing for a moment or making the slightest error! A short while later, a majestic painting of mountains and rivers appeared on the canvas in front of her with the mountains towering with a lofty aura and the rivers vast and mighty!</p><br/><p>What a beautiful painting!</p><br/><p>If anyone were present currently, they would be shocked to realize that after Yu BingYan had finished her painting, be it the lofty mountains or vast rivers, they all exuded a dense sword qi! It was as though the mountains and rivers were made from thousands of swords and would swallow anything that entered it! Just by taking a single glance at the painting, one would feel his soul shudder!</p><br/><p>Melding martial arts into painting! Forming mountains and rivers with the sword in her heart!</p><br/><p>She had finally taken the first step!</p><br/><p>Yu BingYan who was still blindfolded revealed an excited smile and her blindfold became damp from tears…</p><br/><p>Ever since she was young, she had been inflicted with the Divine Black Negative Meridians and had turned into a true martial arts cripple. Why was she so unlucky to contract such an incurable ailment?! However, the heavens were kind to her and had allowed her to meet Ling Tian! Her beloved man had not only helped her to walk out of the shackles in her heart but had also helped her to raise her head in her martial arts! The incurable Divine Black Negative Meridians also showed signs of recovery!</p><br/><p>Miracle! He is truly my miracle!</p><br/><p>From today onwards, I will not be just a beautiful flower vase but will become Tian’ge’s capable aide! The strong sense of inferiority that she had felt since young and the hurt she had suffered from the decisions of her family seemed insignificant when compared to her current resolution!</p><br/><p>***</p><br/><p>Ling Tian sat beneath a tree panting heavily to catch his breath. At this moment, blood was trailing down his lips and he felt as though his body was about to collapse.</p><br/><p>In the final clash with Justice, while Ling Tian was able to use his momentum to slightly reduce the strength of Justice’s strike, Justice’s dense cultivation still heavily injured him! Despite using fire to block Justice, Ling Tian knew that the blaze wouldn’t hold Justice back for a long time, and the moment Justice saw through his plan he would definitely quickly give chase to him. Thus, Ling Tian ignored the severity of his wounds and unleashed his movement technique to the maximum. He sped away at full speed and had tried his best to mislead Justice along the way. In fact, Ling Tian did not even consider which direction he should escape towards and followed the direction his heart would take him. Escaping up to this point had already sapped him of all his strength and if he were to exert his body any further, even without Justice to kill him, he would probably meet his end right here.</p><br/><p>Ling Tian felt his chest begin to ache again and he pulled himself up to observe the surroundings. Ling Tian then couldn’t help but laugh bitterly to himself as he thought, If I am not wrong, I am by the side of a mountain. I originally wanted to enter the forest to avoid Justice with my different means. Who would have thought that I would have escaped to a mountain instead! While I am already among the mountains, the terrain in front of me isn’t very secure! Facing an enemy like Justice, Ling Tian did not dare to let his guard down in the slightest. However, Ling Tian did not know that the lady whom he had never met had risked her life to help gain some time for him.</p><br/><p>Since there was a road here, there would definitely be people passing by! In fact, there might even be a village somewhere near here. Ling Tian let out a sigh as he tapped onto the tree beside him. It is probably best for me to endure my injuries for a while more and find another hiding place. It’s best for me to not overexert myself so my body will be able to endure the stress.</p><br/><p>‘Weng’. As Ling Tian slapped the tree, he realized that it was not the usual ‘peng’ sound but a hollow ‘weng’ sound. He couldn’t help but be stunned for a moment and turned around to study the tree carefully. Under the cover of the shrubs and near the roots of the tree, there was actually a small opening about the size of a bowl. To think that this huge tree in front of him was actually hollow!</p><br/><p>If he did not witness it himself personally, he would never believe that this several hundred feet tall tree that looked lush on the surface had actually rotted to the point it had a hollow interior.</p><br/><p>Ling Tian’s eyes lit up as he snapped a branch of the tree to test the depths of the tree and couldn’t help but laugh heartily.</p><br/><p>A chance! A chance for me to survive! Even the heavens are helping me!</p><br/><p>An hour later Ling Tian looked at a few squirrels running in all directions while carrying strips of cloth with his blood on it and snickered to himself. He then activated his Divine Bone Shrinking Art, and with a few cracking sounds, his body had shrunk to half its normal size. As he approached the opening to the tree’s interior, an even more incredulous matter happened.</p><br/><p>Ling Tian actually disappeared without any difficulty into the entrance of the hollow tree where even a seven to eight-year-old child wouldn’t be able to get through!</p><br/><p>There wasn’t a single trace left behind!</p><br/>\n</div>"}