{"title": "Chapter 397", "id": 397, "volume": 4, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-397", "volume_title": "Volume 4", "body": "<h1>Chapter 397</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 397: Strategy Planning</p><br/><p>Translator: chuchutrain Editor: DavidT, RockThe moment those words left XiMen Sa’s mouth, the crowd burst into an uproar!</p><br/><p>Without the backing of a certain family with over a thousand years of history, would the newly appointed young Head XiMen Sa act so unbridled? Everyone present had the same thought, and while they were not too sure if the XiMen family was really going to attach itself to the Yu Family, based on the words of their new family head at least they would have some external help. This sentence helped a lot of the anxious XiMen members to regain their fighting spirit!</p><br/><p>And right at this time, the so-called supporter of the XiMen Family, Yu ManLou was still in the process of contemplation!</p><br/><p>Northern Wei’s Bright Jade City had also turned into a focal point for everyone! Countless intelligence agents flowed into the city like droplets of water, and every movement of the Yu Family, including the guards and the chefs, were all taken down and transmitted back into their sources!</p><br/><p>Such a huge ambition caused them to be an enemy of the entire world!</p><br/><p>“Things have gone as planned so far, so what will be our next step?” In the Sky Bearing Empire, the Ling Residence, Old Madam Ling leaned back on a soft couch as she stared at the quiet girl before her, a look of praise on her face. “To think that even though Tian’er isn’t around, you could still hold up the Ling Family and Courtyard with one hand, and even handle the problem with the Yu Family, making them enter into a messy situation here. This really gives me endless joy. Right now, with just one move from you causing the entire continent to get riled up, this old woman has really underestimated you!”</p><br/><p>“All of this was planned ahead by the young noble. Chen’er has just dutifully followed her orders, how would I dare to take credit?” Ling Chen smiled gently, as deep emotions flashed in her eyes.</p><br/><p>“Eh?? Why are you still calling him young noble? This lass, why can’t you change your way of address?” Old Madam Ling narrowed her eyes as she smirked meaningfully, “Could it be that this old woman’s eyes are playing tricks on her? It must be that kid Ling Tian not living up to expectations. If he was just a bit more capable, then this old woman here would already have a grandson to carry…”</p><br/><p>“Old Madam!” Ling Chen lost her composure, blushing totally red.</p><br/><p>“Hahaha…” A gratified laugh came out from Old Madam Ling, “This old woman will not concern herself with the matters of you youngsters. All shall be left up to fate. I believe Tian’er will not let me down, and even more will not let you down.” Her words seemed to carry some deeper meaning.</p><br/><p>With a reddened face, Ling Chen changed the topic. “So, based on Madam’s thoughts, what should be our next step?”</p><br/><p>“That would have to depend on you; whatever you think, will be our plan!” The Old Madam teased her, before turning solemn as she continued, “In front of this old woman, you don’t need to hide anything. Speak your thoughts, this old woman will also help you to plan and accommodate. Planning is always slower as compared to action, thus every plan would have to encompass all possibilities, to adapt to the changes as and when needed.”</p><br/><p>Ling Chen gently nodded as she replied, “What Old Madam is trying to say, is that the situation outside has already reached a state of confusion, to the point that it is on the verge of explosion. While we have used many tricks to bring attention to the Northern Wei’s Yu Family, facing their thousand years of accumulation, no other family is willing to make a hasty move. So long as the Yu Family was to stake it all and aim at any one of the families, then they would definitely be unable to escape from their fate. Hence, while the continent is chaotic, it has not reached the tipping point, and all major influences are currently waiting for the family who cannot endure any longer to spark the chaos.”</p><br/><p>“Wait,” Old Madam Ling seemed to have smelled something fishy as she interrupted, “But your plan this time has been too smooth, even to the point that all of your hidden actions seemed to have been rehearsed. Especially the side on Northern Wei, isn’t it too smooth actually?” Old Madam Ling frowned. “You’ve been planning this for a long time, haven’t you?”</p><br/><p>“I’ll not hide it from Old Madam, that’s right.” Ling Chen light out a small smile, her nonchalant tone letting the experienced old woman feel some shock as she interjected, “How did you people plan so far ahead? How did Tian’er achieve this?”</p><br/><p>Ling Chen smiled as she said, “This plan’s original purpose was not to be used against the Yu Family in the first place.”</p><br/><p>“Young noble had long calculated that the position of Sky Bearing was special, and as long as Sky Bearing had any changes, this would immediately attract all sort of major powers flooding to our gates. However, the young noble was not too concerned with the Yu Family at the start, maintaining a respectful stance at a distance from them. He thought that no matter what, with the shackles of the Shui Family binding the Yu Family, they would not behave rashly.”</p><br/><p>“Not the Yu Family? Then…” Old Madam Ling’s face changed, as though she guessed something, but wasn’t willing to confirm her thoughts.</p><br/><p>“The original target of this plan was the Xiao Family.” Ling Chen confirmed her thoughts with a low voice, but she still shattered the last thread of hope that Old Madam Ling held. “The Xiao Family is the real wolf with ambitions, and their strength is hidden even more deeply than one could imagine. Especially towards our Ling Family, they have always been eyeing us covetously like prey. The auction held by the Xiao Family last time here was actually meant to sentence our Ling Family to death! Thus, their strength was supposed to be the greatest impediment in our Ling Family’s road to hegemony. In the last few years, the young noble put in a lot of effort to cut off all sources of intelligence for the Xiao Family from Sky Bearing! Cutting off all sources of information was mainly for this plan.”</p><br/><p>“So long as there was a change to Sky Bearing, young noble would activate this plan, placing the Xiao Family in the heart of chaos, turning them into the public enemy.” A respectful smile was seen on Ling Chen’s face, before she sighed, “A pity that although young noble was talented, he made an error in his calculations in the end. Because of the Shui Family invading our Heavenly Star Continent, the first to take action became the Yu Family. This was something the young noble never expected. And because of the movement from the Yu Family, the Xiao Family went back to laying low and enduring. This was because they knew that if they were to rise up and clash now, it would result in an all-out war with the rest of the continent. Both the Xiao and the Yu Families were not adequately prepared, and thus they planned to swallow the neighboring smaller countries before going for a full-fledged fight at the end. Their plans were in the end foiled by Wei ChengPing’s surprise move in starting a war, hence breaking the delicate balance in the continent. The Yu Family thus had no choice but to extend their claws towards us in order to gain an advantage!”</p><br/><p>“Since the Yu Family made their move towards us before the Xiao Family, then at that point, we could only employ the original tactic towards the Yu Family. This could be counted as letting the Xiao Family off easy!” Ling Chen loftily spoke. “If it was the Xiao Family which came as planned, then with our plan, even if the Xiao Family were not annihilated from this, their strength would also be greatly diminished. So in actuality, the Yu Family had helped the Xiao Family to take the brunt by being a scapegoat.”</p><br/><p>“Regarding countering the advances of the Yu Family, because this was hurriedly executed, it cannot be said to be perfect, so loopholes still exist. However, the good point is that it was Yu ZhanShui and Yu ZhanKong who came to Sky Bearing. If it was Yu ManLou or Yu ManTang then they would have long seen through and broken our scheme. While Yu ZhanShui and Yu ZhanKong have good martial skills, they are in the end military personnel, living for the moment. They immediately chased after the small benefits, resulting in the current bedraggled situation of the Yu Family. While the whole plan was meticulously designed by young noble, we cannot deny that heaven has looked after us!”</p><br/><p>An intelligent gleam shone in Ling Chen’s eyes as she continued, “But the current condition of the Yu Family is only a coincidence, and will not last too long. At that time, the focus of all power will still come back to Sky Bearing, and at this point, they will borrow the chance created to finish making all preparations to deal with us, making it more difficult for our side. Thus, we have to do something during this time. I’ve been waiting for the young noble to pass his orders back, but until now, there has been no word from him.” Ling Chen furrowed her brows in vexation.</p><br/><p>When she had received the letter from her young noble, Ling Chen had almost cried out in relief and urgently opened it to see his instructions. However, all that she saw were a few mere words, vaguely pointing out the direction that she should go. As for the concrete plans, there were none!</p><br/><p>Since Ling Tian could have gone through Ling Thirty to send a letter, with the power of his intelligence agency, he could send a letter through every day and take control of the battlefield at any point! However, he chose not to do so!</p><br/><p>“I believe Tian’er has trusted that you are more than capable enough to handle this.” Old Madam Ling laughed as she encouraged, “Chen’er, I believe that you will not disappoint Tian’er. In your heart, you must already have a plan, don’t you?”</p><br/><p>Ling Chen’s face reddened as she whispered, “I have some plans, but this will require Madam to personally act on it, and Chen’er is afraid that I might tire you out. This…”</p><br/><p>Old Madam Ling laughed and flicked Ling Chen’s forehead, laughingly scolding her, “This lass, there are so many good points to your young noble, but you choose to follow his scheming nature. From the moment you stepped into my room, this old woman already knew that you had a purpose in mind! To actually put on an act of being embarrassed, I should really smack your bottom for this.”</p><br/>\n</div>"}