{"title": "Chapter 418", "id": 418, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-418", "volume_title": "Volume 5", "body": "<h1>Chapter 418</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 418: Frightening MethodsTranslator: DavidT Editor: DavidT, Rock</p><br/><p>DongFang HuaHu’s body stiffened up completely! Right when their DongFang Family’s troops were being attacked by an unknown assailant, Ling Tian, the massacring monster, had actually appeared in the tent without a single trace or sound!</p><br/><p>Turning around abruptly and facing that familiar and handsome face, DongFang HuaHu’s eyes narrowed, “You are Ling Tian?! That monster?!”</p><br/><p>“Second Master DongFang has such a good memory indeed. How have you been!” Ling Tian chuckled as he walked into the tent and ignored DongFang HuaHu. It was as though Ling Tian did not even place DongFang HuaHu in his sights and that DongFang HuaHu did not even have the right to talk to him. Ling Tian had only given a calm greeting to DongFang JingLei!</p><br/><p>At the same time, Ling Tian’s tyrannical aura exploded forth and filled every corner of the tent! Even if he wanted to have a talk with DongFang JingLei, Ling Tian would first teach DongFang JingLei a lesson for leading his men here. After all, DongFang JingLei had designed a plan that had almost killed him! If Ling Tian did not teach DongFang JingLei a lesson, how would DongFang JingLei listen to what he had to say? Thus, Ling Tian already had an idea in his mind!</p><br/><p>“What an arrogant demon! Are you seeking death?!” The humiliated DongFang HuaHu turned crazy as his originally fiery temper exploded. Unsheathing his weapon, his aura exploded forth and with a loud bang, he charged towards Ling Tian with his blade gleaming.</p><br/><p>At the same time, the number two figure of the DongFang Family had also calmed himself down and made preparations to take action! While Ling Tian’s martial arts were fantastic, it would be impossible for Ling Tian to kill two people at the same time. As long as DongFang JingLei could withstand the first wave of attacks, he would be able to tear the tent apart and send out news to his men stationed outside. At that time, no matter how strong Ling Tian was, it would be impossible for Ling Tian to kill him when he had the aid of over a thousand guards!</p><br/><p>However, DongFang JingLei’s heart sank completely the next instant!</p><br/><p>Impossible!</p><br/><p>Ling Tian’s hands were still placed behind his back as he stood up straight and ignored DongFang HuaHu’s frightening sword strike! Ling Tian’s eyes were fixed on DongFang JingLei with a cold smile on his face as though DongFang JingLei was a treasure of some sorts.</p><br/><p>Even when the sword was about to reach Ling Tian’s neck, Ling Tian did not make a single move! Could it be that he has cultivated a martial art that made him immune to weapons? But even if an external martial art like that could be cultivated to its peak, how could he receive DongFang HuaHu’s full-powered strike with his bare neck? Just why didn’t he move? Why did he dare to remain still?!</p><br/><p>Right at this moment, an unexpected matter occurred. DongFang JingLei’s eyes could catch Ling Tian’s shoulders shrugging slightly as though giving a helpless shrug.</p><br/><p>Right after Ling Tian made that action, DongFang HuaHu’s charging figure froze in mid-air and DongFang HuaHu let out a miserable groan as he retreated pitifully. After taking five steps back, DongFang HuaHu’s figure began to shake unsteadily and his eyes were filled with fear, confusion, and bewilderment. Finally, DongFang HuaHu landed unconscious on the ground with a thud as a black fog gathered over his face with his body contorting in pain.</p><br/><p>As for his sword which was slashing towards Ling Tian, it had already fallen onto the ground. The tip of the sword was still trembling from inner qi being imbued within it and it shone in the tent like a bright sun!</p><br/><p>With DongFang JingLei’s XianTian eyesight, he couldn’t even understand how DongFang HuaHu was defeated!</p><br/><p>He only saw Ling Tian standing there motionlessly and shrugging his shoulders slightly. After that, DongFang HuaHu retreated, trembled and fell unconscious. From the black fog gathering over DongFang HuaHu’s face, it was apparent that he was poisoned!</p><br/><p>Just when was he poisoned?! How did Ling Tian poison him?</p><br/><p>If Ling Tian were to use the same method against me, could I avoid it? Could I come out alive?! DongFang JingLei felt his heart rise up to his throat because he knew that he couldn’t!</p><br/><p>He would never lie to himself! Since he could not avoid that attack, did that mean that he was finished?!</p><br/><p>Such an unexpected and untraceable attack! Just how could I avoid it? Ling Tian actually has such an unpredictable and mystical trick up his sleeve! No wonder he could fight with the number one expert for so long without dying!</p><br/><p>However, how is Ling Tian planning to deal with me?</p><br/><p>Thinking about how he led out the experts of his family to chase Ling Tian and even threatened to burn the mountain down to force Ling Tian out of hiding, a feeling of despair rose from DongFang JingLei’s heart. The way he saw it, Ling Tian would never let him off! Even if he were to place himself in Ling Tian’s shoes, it would be impossible for him to let himself off! He would definitely use the cruelest method to kill himself!</p><br/><p>Ling Tian studied DongFang JingLei with a strange smile as though he saw something interesting. After studying DongFang JingLei’s expression for such a long time, Ling Tian could naturally grasp DongFang JingLei’s thoughts completely!</p><br/><p>Ling Tian knew that he had completely destroyed any thoughts DongFang JingLei had of fighting back and it was the best time for the both of them to have a ‘calm’ conversation!</p><br/><p>“Second Master DongFang, a guest is here to visit and you are still standing there silently? Even if you do not host me with tea and desserts, shouldn’t you give me a greeting?!” Ling Tian chuckled, “Aren’t you being too rude?”</p><br/><p>“HuaHu… Ling Tian… you…” DongFang JingLei began to mutter incomprehensibly. In all of his life, he had never lost his cool as such before. While it was completely reasonable for him to lose himself in such a situation, DongFang JingLei quickly collected himself and regained his cool, revealing the same smile he had in Sky Bearing.</p><br/><p>“Young noble Ling, I trust you have been well since we have last met. Ah ah, look at me, I was overly surprised from reuniting with my friend! I have thrown my face in front of young noble Ling. DongFang JingLei has been worried about young noble Ling’s safety for the past few days and knowing that young noble Ling is safe makes me feel at ease!” DongFang JingLei said with a warm and cordial smile, acting as though he was extremely relieved.</p><br/><p>Ling Tian praised in his heart, The number two figure in the DongFang Family indeed, able to calm himself down so quickly and respond with such casualness. “Second Master DongFang is courageous indeed, being able to keep your cool despite the shock and act in such a natural manner. You are indeed a heroic character and Ling Tian truly admires you!”</p><br/><p>DongFang JingLei let out a bitter laugh, “Let us all be open with each other and there isn’t a need for young noble Ling to make fun of me like that. We both know that since young noble Ling chose to use such a method to meet me, you definitely aren’t here to kill me, right?” In this short period of time, DongFang JingLei had analyzed the situation and made his judgment. If Ling Tian was here to kill him, Ling Tian would have definitely killed him right after dealing with DongFang HuaHu. Even if Ling Tian was in control of the situation, he was still able to move about and with his many subordinates outside the tent, the situation was not fully in control of the situation. For Ling Tian to not kill him in such a situation could only mean that Ling Tian’s motive wasn’t to kill him.</p><br/><p>However, just why didn’t Ling Tian kill him? Ling Tian’s ambition to conquer the world was already revealed, and the various members of the other Great Families were targets to be wiped out! However, Ling Tian’s actions today had puzzled DongFang JingLei!</p><br/><p>“Hehe,” Ling Tian sneered, “you are truly smart and have guessed correctly. I do not have the intention to kill you indeed, but I may change my mind anytime. After all, I do have much to gain from your death.” Ling Tian’s eyes gleamed, “You have witnessed for yourself my ability to effortlessly take care of HuaHu and I would naturally be able to kill you as well! Furthermore, I have the confidence of killing you before you can even send out a signal. Brother JingLei, do you believe me?”</p><br/><p>Ling Tian looked at DongFang JingLei with a slightly teasing look as he said this with confidence.</p><br/><p>“You overheard my conversation with HuaHu?” DongFang JingLei seemed to have understood suddenly and nodded solemnly, “However, can HuaHu still be saved?”</p><br/><p>“What if I tell you that our words shouldn’t be heard by a third person?” Ling Tian said casually.</p><br/><p>DongFang JingLei’s gaze narrowed, “That doesn’t matter. He is only a mere servant!” While DongFang JingLei said that, Ling Tian had already noticed DongFang JingLei’s muscles tensing up and his body trembling slightly! This was the sign that an expert was about to take action!</p><br/><p>Ling Tian smiled indifferently and with a flick of his fingers, a snow-white pill landed in DongFang JingLei’s palms. “Because of brother DongFang’s affection towards your men, I will give you a favor first. Allow him to consume this pill and he will be saved. However, he will probably be unconscious for a period of time. You should be able to guess what I am about to say to you, and I don’t think you will want our conversation to spread, right? Even if he is a brother whom you can trust!”</p><br/>\n</div>"}