{"title": "Chapter 415", "id": 415, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-415", "volume_title": "Volume 5", "body": "<h1>Chapter 415</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 415: Helplessness of a Great Family</p><br/><p>Translator: DavidT Editor: DavidT, Rock“However, the Yu Family doesn’t dare to push the Ling Family into a corner either. If they were to force the Ling Family into dire straits and they break out into a fight, even if the Yu Family emerges victorious with their thousand years of foundation, a huge bulk of their strength would surely be destroyed. If that’s the case, the Yu Family wouldn’t have the strength to fight for hegemony in the world anymore. Thus, even if the Yu Family is acting without restraint in Sky Bearing and expanding their influence, they do not dare to make any rash moves towards the Ling Family Courtyard! As long as Ling Tian doesn’t die, the situation in Sky Bearing will definitely be defused silently without any conflicts!”</p><br/><p>“Currently, the attention of the world is focused here! The success and defeat of the Ling Family will also be determined here! The situation of the entire continent is going to be fully determined by Ling Tian! As long as Ling Tian is still around, he will be stationed in the center of the continent with a powerful force behind him, and no single power on the continent would dare to make any rash moves!”</p><br/><p>“If Ling Tian dies, this powerful force behind him will be split into a few different fragments and will no longer be a cause for concern. HuaHu, if you don’t believe what I have just said, you can just wait for the day Ling Tian dies. Western Han, Southern Zheng, the Wu Empire, and our Eastern Zhao have always been eyeing the Xiao Family. As long as Ling Tian dies, we would no longer have any apprehensions and would definitely make a move together! The whole world would definitely be split into many pieces the day Ling Tian dies, and the banners of war would be hoisted up in the sky!”</p><br/><p>“How powerful!” DongFang HuaHu took in a breath of cold air, “If that’s the case, isn’t the peace of the entire world resting on the shoulders of this little brat? How unimaginable!”</p><br/><p>“While it may be an exaggerated statement, it isn’t without its truths!” DongFang JingLei said with consideration. “I originally intended to build a good relationship with Ling Tian so our DongFang Family would have a path of retreat! Even in the worst-case scenario, we would at least be able to ensure the survival of our descendants. However, our DongFang Family has been split up in the recent years with internal strife being a common occurrence. Even if our strength isn’t weaker than any other family, our lack of unity has crippled our ability to vie for hegemony. I had already built secret ties with the three families that had the biggest chance for uniting the family, the Yu, Xiao, and Ling Family. But, the appearance of the Martial Order Medallion was something that I never expected and a huge miscalculation on my part! During this period of time, I analyzed the three families again and I realized something!”</p><br/><p>DongFang JingLei said with a solemn expression, “From the previous actions of the three families, I realized that the other two may consider old friendships, but Ling Tian was someone who never would. He was an individual who showed no mercy in killing and had never shown mercy to anyone! Such a young little brat was actually the most frightening character to become a future monarch.”</p><br/><p>“If we can make use of this opportunity to get rid of Ling Tian and throw the continent into chaos, our DongFang Family will definitely be in a much safer position. If I can make use of the chaos to unify the strength of our DongFang Family, we will have a chance of emerging as the victors! Thus, I have no choice but to kill Ling Tian! After seeing the heaven defying abilities of Justice today, Ling Tian is dead for sure!”</p><br/><p>On the outside a short 300 feet away from their tent, Ling Tian and Li Xue’s figures were hidden in the shadows as they became one with the tree. Even if someone from the DongFang Family were to pass by this place, they would definitely not suspect two living beings right above their heads.</p><br/><p>At the same time, DongFang JingLei’s secret conversation had also been completely overheard!</p><br/><p>However, the conversation between them had not stopped for a single moment. They were naturally compressing their voices into a line, and it was something that could only be done with an extremely profound inner qi!</p><br/><p>Li Xue asked, “Tian’ge, DongFang JingLei’s words have been heard by us. I wonder what you intend to do now? Are you really going to take action?!” From her words, it was obvious that this wise young lass already had other plans in her heart.</p><br/><p>Ling Tian pondered for a moment before saying, “I originally intended to infiltrate the premises with our superior martial arts and kill DongFang JingLei in a swift stroke! I would then withdraw quickly without leaving a trace. As long as DongFang JingLei dies, the DongFang Family members gathered here would definitely be thrown into chaos and would no longer have the ability to create trouble with me. In fact, I can even find a chance to deal with the two ghostly fellows from the Yu Family as well. However, I am now in a slight dilemma. I never expected that there would be someone apart from the Yu and Xiao Family to have such a good foresight! DongFang JingLei had indeed intended to build good ties with me back then and he is truly a crafty individual!”</p><br/><p>Ling Tian then shook his head before continuing, “Even if DongFang JingLei is frightening, he would not be able to create any trouble if I keep an eye on him. But if I can make use of the DongFang Family’s internal strife, there may be an unexpected benefit. If DongFang JingLei were to die now, we would only be doing the DongFang Family a huge favor.”</p><br/><p>“That’s right,” Li Xue transmitted in agreement, “if DongFang JingLei were to die now, DongFang JingTian would surely be able to unite his family no matter how useless he is. If DongFang JingLei dies, although the strength of the DongFang Family would be weakened on the surface, they would be far more united than before. As long as DongFang JingTian can rope in all of DongFang JingLei’s close aides, the strength of the DongFang Family would surely soar. If we allow DongFang JingLei to return alive, we will be ensuring that the DongFang Family remains chaotic and it would be akin to us sowing discord within the family and allowing them to fight to their deaths! Furthermore, that DongFang JingLei is a wise individual who has great foresight and knows when to advance or retreat. If we can bring him over to our side, he will be a huge aid for sure!”</p><br/><p>“Younger sister Xue’er does indeed understand the conflicts within a family.” Ling Tian chuckled and said meaningfully. At the same time, a cold glare flashed past his eyes and a trace of pain and wariness could be seen.</p><br/><p>Li Xue fell silent and the branch that she was on trembled slightly. If not for Ling Tian observing her closely, it would be impossible for him to pick up that slight movement. Li Xue’s voice then sounded after a while, “Everyone would say that the battlefield is a treacherous place and it is either one kills or is killed. If someone were to die in the hands of the enemy, there would be nothing to grumble about. However, this little sister thinks that there are two most dangerous places in the world. The first would be the political struggle in the palace, and the second would be the internal conflict within an aristocratic family. That is truly the most treacherous and ugly place in the world.”</p><br/><p>Ling Tian let out a sigh, “That’s right, it is only right for one to die in the hands of the enemy but if he was to die in the hands of his own family and be plotted against by his very own siblings, that heart-wrenching pain that seeps into one’s bones is the true feeling of despair and helplessness. I never imagined that something like this would happen to the number one talent of the DongFang Family. What a joke…” Ling Tian said these words with his teeth tightly clenched. The dense hatred in his voice, resentment that rose to the heavens, and pain that pricked his soul were fully displayed in his words!</p><br/><p>Perhaps knowingly, perhaps unknowingly, but Ling Tian’s words had pierced right into the depths of Li Xue’s heart and it was as though the scar that she had hidden within herself for a thousand years had surfaced again. Her body began to tremble as she bit down on her lower lips under her veil with a trace of blood flowing down.</p><br/><p>A long while later, Li Xue’s voice gloomily sounded, “The internal strife of a family has always been the greatest sorrow and a cruel fate that no family has been able to escape! If one was naturally cruel and unscrupulous, be it killing his own brother or sister, it was only the survival of the fittest and the classic action of a ruthless ruler. Without a single shred of humanity, they would be able to enjoy their fruits of labor without a shred of guilt.”</p><br/><p>“Has Tian’ge ever realized that regardless of the world or continent, the number of ambitious characters and heroes would be extremely few?! There would inevitably be some individuals who still have a conscience being forced into such a matter. While they would be guilt-ridden for the rest of their lives, they would still make the same choice no matter how many times they were faced with it! There just wasn’t another way for them!”</p><br/><p>“If a mother were to realize that her inaction would result in the loss of her child’s life, then even if her action would go against her conscience, she would still do it without hesitation! She would rather suffer the pain in her heart than live in regret! Similarly, if a child knows that their inaction would cause their parents to be threatened or even killed in the future, then they would do it even if it meant that their reputation would be ruined for life! Tian’ge, if it were you, would you be willing to harm someone you don’t want to harm for your parents? What would you do?”</p><br/><p>Ling Tian fell into a long silence.</p><br/><p>In Li Xue’s beautiful eyes, tears welled up and flowed down silently.</p><br/>\n</div>"}