{"title": "Chapter 416", "id": 416, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-416", "volume_title": "Volume 5", "body": "<h1>Chapter 416</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 416: Past and Present LivesTranslator: chuchutrain Editor: DavidT, Rock</p><br/><p>After a long time, Ling Tian finally spoke in a heavy tone, “Li Xue, sometimes a person may feel that they are helpless in whatever happens in their lives. However, no matter who is right or wrong, there are matters that can’t be easily determined by so-called morals and righteousness. You might not want to do some things, but are forced to do so because of certain reasons! And for some matters, you might have the urge or drive to perform in, but will never have the possibility of success in your life! We are all helpless sometimes in our lives, and that’s why, being human, being alive is truly hard at times.”</p><br/><p>This was the first time Ling Tian had called out ‘Li Xue’ instead of ‘Xue’er’! A pained smile appeared on Li Xue’s face. While Ling Tian’s answer seemed magnanimous and forgiving, he had ultimately beat around the bush and did not answer the question directly!</p><br/><p>“You…, are you really willing to forgive me?” On her lashes hung a few unshed tears, carrying with them a faint hope as she whispered.</p><br/><p>“It doesn’t matter if I forgive you or not. I didn’t say that you had done anything wrong, so I don’t have the standing nor the reason to fault you.” Ling Tian resisted his surging emotions and replied, “I can empathize with you and can also understand why you had no choice to but make that decision. Even the me before the bombing in our past life would understand, but would still not forgive! I would still choose to kill you! Because, like you, I have my own difficulties and viewpoint!”</p><br/><p>Ling Tian shut his eyes as he slowly spoke, “No matter who it was for, your parents or for others, even if it’s better for mankind, to cause harm to me you can be considered my enemy and also the one who injured me! This consequence and responsibility must be carried by you! Just like in my viewpoint, that if I have to take revenge, I will have to do it in the end! If I have to kill you, then I will definitely not be soft-hearted! Do you understand what I’m saying?”</p><br/><p>Li Xue nodded her head, as though enlightened, “Your meaning is that forgiveness doesn’t exist in this world, right? Which also means that, whatever I’ve done, based on my viewpoint, wasn’t wrong?”</p><br/><p>“That’s right. Based on your viewpoint, you weren’t wrong. However, you also made a mistake,” Ling Tian sternly replied. “In fact, there are two mistakes. The first being the fact that you failed to clean up your mess! Since you had already done it, then it would have been better to end it and kill me. While you might feel guilty and be plagued by nightmares, there wouldn’t be any repercussions. However, you chose to humiliate me instead! As the saying goes, killing is as simple as nodding one’s head, thus to leave me neither alive nor dead is too much! However, because of this mistake or because of their desire to humiliate me, this resulted in my final revenge in the end! Too far is as bad as not enough, and that was your first mistake!”</p><br/><p>As he talked about his past life, Ling Tian’s face remained impassive, as though talking about another person’s story. There was no fluctuation in his tone, remaining flat from start to finish, as though narrating a story. “The second mistake is you yourself. Since you had already done it, then regret is useless. Such matters shouldn’t have room for regret, and even more not for repentance, but merely just to accept and carry it! Then you just need to face my potential revenge, and not care whether you can accept it or not! You will definitely reap what you sow!”</p><br/><p>“Following the bombing in our past lives, all these matters dispersed along with the wind and smoke, and my hatred and grudges have all vanished on the road to the yellow springs. Thus, you don’t require my forgiveness at all, just like how I don’t require your confession and repentance! However, what I didn’t expect was for you to have also entered this world! In this world, the past Ling Tian does not exist, and neither does the past Ling Xue. Naturally, all the hatred and grudges between them are left in the past life, not in the present! Do you understand this point?”</p><br/><p>“I understand.” Li Xue let out a disappointed smile. “The me now is called Li Xue, and I’m merely the daughter of a woodcutter.”</p><br/><p>“That’s right! Actually, when I first met you, I already had a sort of premonition, but I didn’t dare to believe, nor was I willing to believe. Even though your behavior became more and more obvious, I’ve maintained that self-deceiving attitude of not wanting to believe! Because to me, this matter is after all still a little hard to take in. However, at this point, I’ve found out that when I face up to it, that’s all there is to it! It’s just that simple, just so…”</p><br/><p>Ling Tian suddenly cracked a smile and changed the topic, “Anyway, when we have the time, let’s do some research. Having experienced so much, the most memorable thought in my mind isn’t hatred anymore. Do you know what is it?”</p><br/><p>Li Xue couldn’t help but ask in curiosly asked, “What would it be?”</p><br/><p>Ling Tian laughed, and replied in a vague tone, “Don’t you feel that the yellow springs road we walked on was extremely miraculous? After we settle the matter of the DongFang Family, I believe we need to have a good talk about it.”</p><br/><p>“Talk about the yellow springs road? How about we wait until a few decades later? Bringing up this topic seems to be a tad too early for us!” 1 Li Xue was torn between being angry and wanting to laugh. It was at this point that Li Xue suddenly found out that the Ling Tian in front of her was completely different from the Ling Tian she knew in her past life. While they were of the same soul, they behaved like completely different people. To think that in this depressing atmosphere, and using such a depressing tone, he could actually bring up such an amusing topic to talk about!</p><br/><p>“It might be a little early, but didn’t you notice that traveling along that road provided us with many benefits in increasing our cultivation realms?”</p><br/><p>“That goes without saying!” Li Xue chuckled. “After all, we are considered to have seen beyond life and death, and even to some extent considered having transcended it! Of course our cultivation would soar by leaps and bounds!”</p><br/><p>“Haha!” Ling Tian finally couldn’t hold it in and started laughing, “You are able to see past life and death, but you can’t put down the grievances of the past life? Even I this victim have already seen through it, but you the perpetrator are still stuck inside your own little miserable world!”</p><br/><p>“Aiya, so you were actually waiting for me here!” Li Xue couldn’t resist pinching Ling Tian on his waist, hard. “Such a baddie!”</p><br/><p>Ling Tian forced out a laugh, and the atmosphere between the two of them grew oppressive once more, with a stifling feeling in the air.</p><br/><p>After uncovering their hidden identities, the two of them were still adjusting to the newfound fact of how to approach each other through their new identities. Both had their own thoughts and own questions to ask, and they slowly sank into silence as they contemplated this.</p><br/><p>Ling Tian remained silent for quite a while longer, and Li Xue could clearly feel that Ling Tian’s heart was beating extremely fast. Suddenly, he took in a deep breath, before emotionlessly saying, “Li Xue, right now, I need your help to face off against the people from the DongFang Family.” As he said this his tone had recovered a hint of his usual self!</p><br/><p>“Do you still need to be so polite with me, my dear brother?!” Li Xue let out a coquettish laugh, “In this life, the great noble Ling just has to command me!”</p><br/><p>“How dare you talk to me in such a tone! Your buttocks must be itchy, itchy for a beating! Li Xue, I really want to smack you right now!” Ling Tian ruthlessly spoke. “Now, listen to me, I want to utilize the internal problems of the DongFang Family, and I need to talk to DongFang JingLei face to face. I need to you divert the attention of the rest of his men. Do you understand?”</p><br/><p>Ling Tian used an extremely commandeering tone, without any of his previous warmth, as though giving out instructions to his slaves. If this tone were to be used on an outsider with strength similar to Li Xue, most likely, there would actually be a fight happening between both of them!</p><br/><p>However, a gleam of excitement appeared in the eyes of Li Xue, much like the stars in the deepest night, as she looked relieved of a burden. It somehow also looked as though her wish of many years had been fulfilled!</p><br/><p>“En, I’ll go right now, and provide as much time for you as I can!” Li Xue lightly whispered, her rushing emotions flooding her to the point that she forgot to shrink her voice into a line to reply! A slim body then flashed and disappeared from beside Ling Tian, suddenly appearing across the way!</p><br/><p>Slim white hands reached out, and a wave of intense cold surged out. In an instant, the area around her a few meters across had turned into a white wonderland! The thick forest turned into a wintry scene at that moment, as though being plunged into the depths of the deepest winter!</p><br/><p>What a pure internal Yin energy! Ever since he was reborn, he had never seen such an exquisite pure Yin internal energy. Even Ling Chen, who practiced a pure Yin cultivation technique, couldn’t hold a candle to her!</p><br/><p>This was also the first time Li Xue displayed her skill in front of Ling Tian. The exact same Divine Dragon Body Technique was displayed, and also the Divine Ice Formula that Ling Tian was familiar with! Similar to Ling Chen, she purely cultivated in the Divine Ice Formula, but had been hiding it the whole time, afraid of exposing herself to Ling Tian. However, this time, it was as though she was afraid that Ling Tian couldn’t recognize it, unleashing her full power all at once!</p><br/><p>A complex feeling appeared on Ling Tian’s face, in that instant, he seemed to see through the cycle of hundreds, if not thousands, of samsara cycles. He observed the transformation of the world, of the repetition of life and death!</p><br/><p>A short moment after Li Xue left her original spot, a soft patter was heard. The two large tears that Li Xue had held in her eyes for such a long time slowly dropped onto the tree leaves when she flashed away.</p><br/><p>Ling Tian gently stretched out his hands, rubbing the two discreet marks. A wet touch was transmitted through his fingertips, and this same wet and clammy feeling caused a hint of mist to appear on his typically eagle-sharp eyes! Bringing the wet fingertips to his cheek, he suddenly let out a smile!</p><br/><p>This was a smile full of happiness and sunshine, and this same smile was something that even Ling Chen and Ling Jian, the closest two people to Ling Tian, had never seen before in their entire lives!</p><br/><p>This was the smile of someone who had finally unlocked all the burdens in his heart!</p><br/><p>So it turns out, the locks that he thought he had unlocked a long time ago had only been truly unfastened at this point!</p><br/><p>A carefree laugh rang out from him, as his figure flashed, also disappearing from the tree…</p><br/>\n</div>"}