{"title": "Chapter 413", "id": 413, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-413", "volume_title": "Volume 5", "body": "<h1>Chapter 413</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 413: Internal Affairs of DongFang</p><br/><p>Translator: chuchutrain Editor: DavidT, Rock“Only half a year of time?” An expression of joy appeared in Li Xue’s eyes. Others might not be aware of Ling Tian’s patience but how could she be unaware? That year, in order to investigate Ling Tian, she had spent quite a bit of her family’s resources, grasping hold of whatever matters that were related to Ling Tian. Furthermore, with Ling Tian’s skillful escape techniques, let’s not mention half a year, he could even do so for his entire life if he wanted!</p><br/><p>Since the technology of the previous world couldn’t even do anything to him, then what more the strength of one single person? Even if Justice had the ability to commune with heaven and earth, compared to Ling Tian’s cunning, he could only lament at his powerlessness!</p><br/><p>“Then why not you just hide yourself and be done with it?” Li Xue had a slight tone of reprimanding him.</p><br/><p>“Hide myself? Xue’er, based on your current cultivation, you can probably see what realm I’ve reached. Just based on my own efforts, I would probably need a decade to break through this bottleneck.” Ling Tian exclaimed. “To have Justice pursue me like this, while it might be a death summons to others, to me it is the most opportune chance!”</p><br/><p>“Unbelievably crafty!” Li Xue grinned, “People look with fear at such a matter, but you are actually using this sort of life-and-death struggle to hone your skills! What a weirdo.”</p><br/><p>“Wahaha…” Ling Tian let out a huge laugh, before suddenly stalling as he stared in front of him. On the path ahead of them, there were signs of snapped branches, obviously the work of a large troop on horseback.</p><br/><p>“Xue’er, it seems like we’ve caught another big fish this time.” Ling Tian smirked.</p><br/><p>“Big fish? Don’t tell me it’s the DongFang Family?” Li Xue perked up, excitedly asking.</p><br/><p>“Just based on the numbers, only the DongFang and BeiMing families have brought this many people. However, the BeiMing’s group is filled with experts, so their tracks will not be so obvious. This only leaves us with the DongFang Family, whose ordinary guards number quite a few in their group, which will cause such obvious tracks to be formed.”</p><br/><p>“And only the DongFang family would rely on their own strength to appear arrogant, right?” Li Xue lightly laughed in return, “I really find it surprising that some people actually have the guts to offend you. Don’t tell me that you’ve never shown them your strength?”</p><br/><p>“It’s precisely because they saw my strength, that it left them with this deep impression,” Ling Tian grinned in return. “This is fighting for dominance for all under heavens, and this is different from fighting for hegemony in the pugilistic world. The strong can afford to stay in a corner for the pugilistic world, but on the chessboard for world dominance, it’s the tallest trees that will get blown down first! No matter which side wins, the rest will suffer the same consequence of annihilation. Furthermore, this sort of annihilation will be an utter destruction of the country or the family clan! Thus, once someone like me who defies logic appears, won’t I naturally become the public enemy?”</p><br/><p>“Oh? From this, does it mean that you’ve revealed your abilities at too early a date?” Li Xue was astute and immediately guessed the crux of Ling Tian’s troubles.</p><br/><p>“That’s right! At that time, I really underestimated the various experts of this world.” Ling Tian let out a sign full of regret.</p><br/><p>Ling Tian couldn’t be said to have no regrets!</p><br/><p>Since he had already endured for a whole sixteen years, would a few more years actually matter? At that time, they would have Long Xiao as the Sky Bearing Emperor being the figurehead, blocking the winds and rains from the outside while he could use his own strength to a greater potential, infiltrating the various aristocratic families more… once everything had been settled, how easy that would have been!</p><br/><p>However, under his rage, a thunderous commotion was created when all was still! The impact was created, but it went a little too far. This caused the entire world to turn towards his direction, and for him to become a thorn in the eye for the various major powers. This miscalculation ended up having blades in daylight and daggers in the night to rush towards him!</p><br/><p>But Ling Tian felt that his actions were justified!</p><br/><p>Be it to protect Ling Chen, or to rescue his father from the entrapment, or even to wash the Ling Family with blood, even if there were more options available for Ling Tian, he would still make the same moves!</p><br/><p>In this life, I want all of my relatives to live in safety and happiness!</p><br/><p>…</p><br/><p>Just as that heaven shaking sound of battle rang out, DongFang JingLei was seated in a tent not far away from the mountain, about to drink a cup of tea. When the soundwave passed by, the delicately designed teacup of white jade fell onto the ground, shattering into pieces.</p><br/><p>With his eyes tracing the direction of the source of noise, DongFang JingLei quietly drew in a deep breath. Astonishment filled his entire face, as such divine power should not be something that a human could unleash. Indeed, he was peerless for a reason! Even after cultivation for half his life, he originally thought his accomplishments were quite notable, but he probably couldn’t even reach up to 20% of the power of that blow. Upon recalling how the Martial Order Medallion owner talked to them, he shivered. If he had not listen to Justice when Justice nicely asked them to scram, wouldn’t he have turned into a corpse by now?</p><br/><p>DongFang JingLei was the blood brother of the Family Head and normally led the expedition without hesitation, not knowing the meaning of fear. Even during the trip to Sky Bearing, he had no fear when facing the extremely imposing Ling Tian. However, he felt the thread of hesitation and fear about his decision to leave earlier quickly change into joy on his luck to have escaped early on!</p><br/><p>He might have over a thousand in military strength with him right now, with all of them being true elites, but in the eyes of Justice, this bunch was as good as reared livestock to him. Were he to actually want your life, even if one were to hide within a ten thousand strong army, then you would still have only one outcome: Death.</p><br/><p>“That was close! Thankfully, we were not rash previously!” DongFang JingLei felt a lingering fear, feeling a few drops of cold sweat on his forehead and a cool sensation on his back.</p><br/><p>“Second Master, before we left the house, the Family Head secretly entrusted us with something. Do you still recall?” A light voice sounded beside him. This person was DongFang HuaHu, a trusted expert in the DongFang family. If one were to compare the entire DongFang Family, his martial skills would only lose to the family head DongFang JingTian and JingLei. He had few opponents and had already stabilized himself in the XianTian realm for at least ten years, his achievements not below that of the Third Master Yu ManTian.</p><br/><p>“What did elder brother say…? Oh, that. Let’s not talk about it anymore.” DongFang JingLei sigh, “HuaHu, in such a circumstance, what kind of hope can one have? That’s not hoping any more, that’s called an illusion! An illusion which can’t be fulfilled! I don’t even know what brother is thinking of. Us coming here and receiving news of Ling Tian’s death is considered good enough, but to have designs on the Martial Order Medallion owner, now that’s preposterous! Justice’s words already indicate the Beyond Heavens unlimited influence, just like beyond the heavens themselves. Once the words come out, they are akin to laws; laws that can’t be disobeyed. This is a publicly acknowledged thing, and even if the offender is a prestigious person, there can only be death for him!</p><br/><p>DongFang HuaHu gravely sighed as he commented, “This subordinate also had his suspicions initially, but after previously seeing Justice’s methods, I concluded that he is truly the top exponent of this world! I too am not sure what Family Head is thinking, to actually order us to be the fisherman and get rid of both Ling Tian and Justice when they’re injured! It’s alright if it’s just Ling Tian, but what’s so good in offending the Beyond Heavens? Can they even be offended in the first place?!” DongFang HuaHu’s tone contained a bit of dissatisfaction towards the end.</p><br/><p>“How could elder brother be unaware of the reason? He’s just using this excuse to get rid of me!” DongFang JingLei suddenly shook his head sadly. “My existence is already threatening the influence he has in our family and the imperial court, and thus this mission is actually just to send me to my death!”</p><br/><p>“Ah?!” DongFang HuaHu got a shock. “Second Master, are you sure?”</p><br/><p>DongFang JingLei let out a strained smile, “How could I be not sure? Elder brother has decided to get rid of me, and this isn’t even a secret inside the family anymore! Let’s just start with you. In front of my older brother, how much respect do you even give him now? And those two idiots, He ChuLai and He ChuQu, are even more incorrigible, only listening to me, and even daring to disobey my elder brother when he tried to send them on a mission! Nowadays, our brothers only know that the DongFang Family has a JingLei, but not a JingTian! Just this point is enough for my brother to throw me the death sentence! High merits will shake the owner, as high influence will shake the chief. There’s no difference between these two phrases!”</p><br/><p>“He did not even have the qualifications to sit on the family head’s seat!” DongFang HuaHu snorted out of his nose. “Such a foolish person is not entitled to the title of Family Head! Second Master, since he has already moved against you, why not we go all out…”</p><br/><p>“Nonsense!” DongFang JingLei shook his head vigorously. “At such a chaotic time, with various powers eyeing each other, how can the DongFang Family be exposed to a rift? Me bringing all of you out this time can be considered hiding from him. It’s fine if you guys don’t want to help keep the peace and quiet, but you’re even thinking of inciting chaos?”</p><br/><p>HuaHu lowered his head, but his expression was still that of indignance. Suddenly, he lifted his head and asked in curiosity, “Second Master, but aren’t we out this time solely to look for Ling Tian? Why is it…?”</p><br/><p>DongFang JingLei muttered, “This time round, our first objective is actually Ling Tian, and we definitely can’t allow him to go back to Sky Bearing alive. The second objective is naturally to avoid my elder brother. While I don’t place any importance on the seat of Family Head, Elder brother views that with extreme importance!” As he spoke, he sighed again.</p><br/><p>“I still don’t get it, what’s so scary about this Ling Tian? He’s being chased by Justice until he’s about to die, but Second Master continues to brood over this matter. Are you afraid that he can’t be eliminated fast enough?” DongFang HuaHu scratched his head in confusion and asked.</p><br/><p>“That person is, after all, a genius! A once-in-a-century genius!” A grave expression appeared to DongFang JingLei’s face. “If we did not go over to Sky Bearing previously, I wouldn’t have found out that Sky Bearing actually concealed such a frightening character, much like a sleeping dragon. With such talent, he actually wore the hat of the number one silkpants since he was young, why was that?”</p><br/>\n</div>"}