{"title": "Chapter 410", "id": 410, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-410", "volume_title": "Volume 5", "body": "<h1>Chapter 410</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 410: Killing the Talents</p><br/><p>Translator: chuchutrain Editor: DavidT, RockFrom NanGong TianLong’s throat came the sound of bones grinding against each other. The fresh air of this world had already lost touch with the latter’s lungs, causing the fear of death to surface as the throes of suffocation set in. This fear seeped into the mind of the NanGong Family head bit by bit, and just when he reached the final clarity before death, NanGong TianLong seemed to have obtained some sort of release, his face settling into a peaceful expression.</p><br/><p>However, Ling Tian did not notice this point as he suddenly let go of his hand, allowing air to pass in. NanGong TianLong suddenly jumped back from the throes of death, his mouth automatically sucking in air as he stared strangely at this frightening youth opponent of his.</p><br/><p>“I forgot to mention something, but even if I don’t tell you, I believe that NanGong Le at the yellow springs would also do the same thing!” A hint of apology could be heard in Ling Tian’s voice. “Actually, the Yang Family was indeed innocent. The cause of Young Noble NanGong Le’s death was not due to the Yangs!”</p><br/><p>The lifeless eyes of NanGong TianLong suddenly rolled, as a few threads of clarity came back to his mind. He seemed to have somehow understood something, as he suddenly stared viciously at Ling Tian, much like a cornered beast.</p><br/><p>“NanGong Le was killed by me!” A hint of pity could be heard from Ling Tian’s tone as he spoke, “He was the first unfortunate sacrifice in the war between the Yang and my Ling Family. This is perhaps the only point that I am apologetic to your family about. However, even if time were to rewind, I would still do the same thing! A pity that I have no idea on how to compensate you guys. I can only send you off with the knowledge that it was my fault.” Ling Tian closed his eyes and muttered, “Go in peace, NanGong TianLong. If there’s a next life, then you can seek revenge there!”</p><br/><p>The corners of NanGong TianLong’s eyes seem to expand explosively at this moment as his body, which was lying flat on the ground, raised up a foot high before dropping back down. His eyes were open impossibly wide, to the point the corners of his eyes started to tear, letting out two streams of blood trails. Finally, he was still, not moving a single bit as he continued to stare into the sky, full of hatred and unwillingness, as though pondering about life…</p><br/><p>Ling Tian’s previous kick had perfectly connected with his DanTian, causing him irreparable damage. And now, with this piece of disastrous news, all of TianLong’s meridians burst apart, so that even if an immortal came, he would probably be unable to reverse the situation!</p><br/><p>The NanGong Family Head, NanGong TianLong, died!</p><br/><p>Ling Tian let out a light sigh, before standing up weakly. A blue flash passed by his eyes, and Li Xue was already silently standing in front of him, her eyes full of concern. Her hand moved and handed another snow-white handkerchief over.</p><br/><p>Ling Tian laughed, giving her a consoling look as he unceremoniously took the handkerchief, wiping his face with it. Li Xue let out a small smile as she took back the handkerchief, lightly folding it before putting it back into her bosom.</p><br/><p>Just before this, Li Xue had killed the eight experts of the NanGong family without so much as move, and after killing, she had wiped her hands with her napkin before heartlessly throwing it away. However, she had actually kept the cloth this time after Ling Tian had wiped his face with it. If Ling Tian noticed this, he would definitely start to suspect something, but a pity that Ling Tian was busy handling NanGong TianLong’s body, and did not notice this strange incident.</p><br/><p>Upon turning around, Ling Tian immediately noticed the other eight bodies piled into a heap, and his pupils shrank as he lifted his head up to stare at Li Xue. This, how was this action that of a person who had not killed for sixteen years (all her life)? In Ling Tian’s heart, Li Xue became more of an enigma!</p><br/><p>This sort of killing method was impeccably authentic and brilliant! How was this someone who had never killed before? D*mn, one could not get more professional than this!</p><br/><p>Even if it was Ling Jian who took action, he might not be as clean as what Li Xue had done!</p><br/><p>Even for Ling Tian himself, when he had first killed someone in his past life, he had felt disgusted for nearly half a month! It was only after he had undertaken more than ten missions that he put this revulsion behind. Even if it was the current Ling Jian, recognized as a bloodthirsty demon by others, the head of the First Pavilion, he had vomited and almost fainted when he had first killed!</p><br/><p>But the soft and weak looking lass in front of him who claimed that she had never killed in all her life had cleanly finished off eight experts with an indifferent face, as though it was a mundane action she would do every day! Worse still, her eyes did not even change as she killed!</p><br/><p>Ling Tian believed that there were all sorts of geniuses in this world, but there would definitely not be this sort of terrifying talent!</p><br/><p>An extinct killing genius born just to kill?! Only ghosts would believe you!</p><br/><p>With a stomach full of doubt, Ling Tian could only let out a bitter smile. It seemed like this mysterious convenient helper of his really was holding back quite a few secrets. He had to be on his guard.</p><br/><p>However, if one were to tell Ling Tian that Li Xue had some untoward designs on him, Ling Tian would not believe it for even a second. This was because his Divine Shocking Dragon Formula mainly cultivated in the heart and mental state after reaching the XianTian realm, and the feeling which Li Xue sent out to him was of unprecedented safety, even to the point of familiarity. This was the first time Ling Tian ever felt this way from anyone. Thus, Ling Tian had no doubts of Li Xue’s goodwill towards him!</p><br/><p>Casting a cold glance at the other four experts still kneeling on the ground, the experts of the NanGong Family were now trembling in fear. Just as he was about to make a move, he suddenly had a thought as his gaze once again landed on Li Xue. A plan surfaced as he stared at this group of people coldly and spoke, “As for you guys, I don’t want to say much, but neither do I want to let you go. You should just commit suicide!”</p><br/><p>Ling Tian’s words were soft, but they were heard extremely clearly by Li Xue even though she was standing by the side.</p><br/><p>Hearing this, Li Xue could not help but frown as though she wanted to object, before pushing it back down. However, seeing Ling Tian putting his hands behind him and standing by the side nonchalantly, she could endure no longer and opened her mouth, “How could you leave it this way? These people, in order to live, have done all sorts of evil deeds, and you still want them to have the courage to commit suicide?”</p><br/><p>Ling Tian’s gaze sharpened as he deeply stared at her before suddenly laughing. He replied, “That’s indeed the case. However, for such despicable people, killing them would dirty my hands, and releasing them would allow them to reveal the secret. In your opinion, what should I do?”</p><br/><p>Li Xue let out a laugh as she ridiculed, “Oh great noble Ling, the lives that have been ended by your hands, even if the count has not reached ten thousand, has at least reached eight thousand. You want to let them go just because they cannot retaliate? You would give them a path to walk just because they have done too many evil deeds? You asking them to commit suicide is merely to allow them to rebel to justify you killing them! But do you know how much saliva you have to waste just to achieve your goal? Since you’re going to kill them in the end, whatever they do they would still be dead! So why not just cleanly wipe them out? Is it worth it for you to waste your precious time on them? Do you have a lot of time to waste?”</p><br/><p>Li Xue’s words were not only sharp but harsh. She was only left with pointing a finger at his nose and literally lashing out at him, but her tone obviously meant that.</p><br/><p>Ling Tian cracked a smile at this, “Sister Xue’er makes a lot of sense. This disciple has received your teachings.”</p><br/><p>Li Xue snorted as her lips curled up, “This kind of pointless method is just purely to maintain the so-called moral high ground of an expert above all. You’re obviously numb to killing but you still want to justify yourself! This makes people sick! Be a man, if you need to kill then kill, if you want to let them go then do so, it’s merely a thought, why do you need to care so much? Being wishy-washy and all, how can you achieve anything big like this!”</p><br/><p>Ling Tian laughed and agreed, but in his heart, he shivered with fear, Indeed, this lass is not simple! Not only are her methods ruthless, on par with me, but if she was a man then this world would have another person capable of flipping the heavens upside down! If she was a man, then so long as I felt that I was disadvantaged, even if I couldn’t bear to do so I would definitely finish him off! She, just where exactly did she come from? And how can she give me such a comfortable feeling?</p><br/><p>Among all the ladies that Ling Tian had seen in this world, just based on decisiveness, probably no one could compare to Li Xue! Be it the meticulous and outstanding Ling Chen, the resourceful Yu BingYan, or even the future heir of the Shui Family, Shui QianRou, they all did not possess such a ruthless decisiveness!</p><br/><p>This sort of character, be it man and woman, if standing on the enemy’s side, would be an extreme blight to him!</p><br/><p>Just what sort of aristocratic family, what sort of character, could groom such an outstanding lady?</p><br/><p>Even the Beyond Heavens Sect could not guarantee that they could produce such a character!</p><br/><p>Unless… However, once the thought surfaced, Ling Tian immediately banished it. It was so nonsensical that he could not bring himself to believe it!</p><br/><p>Ling Tian’s thoughts quickly flashed through his mind and he nodded as he murmured, “Let’s go.” His body floated up, and his right sleeve flicked out. Four pin-sized dots shot like shooting stars into the center of each man’s forehead. Following stuffy groans, the four of them stopped breathing even before they fell flat on the ground. And Ling Tian as well as Li Xue’s figures were nowhere to be seen.</p><br/><p>Before Ling Tian left, he happened to look back on the scene, and observed a spotlessly white handkerchief still lightly fluttering with the breeze.</p><br/><p>At the same time, it was as though Ling Tian had received a great shock. In that instant, he seemed to have something at the back of his head, but however he tried, he could not remember it. This image subtly gave him the impression of a dream, and by the time his mental state cleared, he could not recall the details any longer. Ling Tian furiously dug through his brain, trying to recall, what exactly was it that he thought of?</p><br/><p>No matter what it was, Ling Tian had the feeling that this flash of insight that came and went, was extremely important to him! Unbelievably important!</p><br/><p>What exactly did I miss?!</p><br/>\n</div>"}