{"title": "Chapter 422", "id": 422, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-422", "volume_title": "Volume 5", "body": "<h1>Chapter 422</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 422: So-Called WarringTranslator: chuchutrain Editor: DavidT, Rock</p><br/><p>Ling Tian only let out a long sigh before stretching his hand out of his sleeve and pulling her directly into his bosom. His sleeve followed soon after, draping like a blanket over her, as he exclaimed in mock anger, “Why are you wriggling so much? Go and sleep properly!”</p><br/><p>There was no vulgar connotation to his words, merely the tone of an elder brother chiding his younger sister, full of love and care. Li Xue seemed to be intoxicated with such a feeling, pursing her lips and obediently letting out an ‘en’ sound before she delved into Ling Tian’s bosom. She found a comfortable spot and quietened down.</p><br/><p>Gently supporting her body, Ling Tian lowly sighed, as he looked out in the vast empty sky as well as the clear and pristine moon, its hazy light shining down and illuminating the vast mountains and rivers, as though purifying them…</p><br/><p>A strange feeling started to form on his chest, a cool yet wet feeling. Li Xue’s arms were tightly wrapped around his waist and her delicate figure was trembling non-stop as she sobbed silently. Her tears flowed without stopping, and before long there was a huge wet patch on Ling Tian’s chest, and it was even showing signs of increasing…</p><br/><p>Ling Tian could only sigh to himself and tighten his embrace…</p><br/><p>The night went by in silence, and Ling Tian knew that Li Xue had to give vent to the guilt she had always kept in her heart, thus he patiently held onto her. Ling Tian sat still for the whole night, just as Li Xue noiselessly sobbed for the whole night!</p><br/><p>As dawn broke and a cold breeze rolled over, Li Xue finally ended her crying spree and had vented all her conflicting feelings. She raised her head as the wind tickled her nose, revealing her veil that was soaked in her tears. The veil dropped off due to the weight, revealing two red and swollen eyes akin to ripe peaches, with traces of tears on her face. At this time, she resembled a kitten with a dirty face.</p><br/><p>Li Xue lowered her head in embarrassment as her face turned red. After that she seemed to realize that she had just displayed her ugly self in front of Ling Tian, and exclaimed, immediately covering her face with her hands.</p><br/><p>“How ugly!” Ling Tian jeered. “Just look at you, your face looks similar to that of an abandoned dirty kitten. If people were to see, they would think that this great noble Ling here had bullied you. Sigh, I really worry how are you going to find someone to marry with that face.”</p><br/><p>Li Xue immediately drummed her feet on the ground in anger, before throwing herself and covering her face in Ling Tian’s chest, snorting, “Who’re you calling ugly? Who did you say can’t marry anyone?!” As she spoke, her hands had already energetically snaked to Ling Tian’s waist, twisting at the flesh there.</p><br/><p>“I’m ugly, I’m the ugly one, I’m the ugliest one… oh my lord, why do all of you women always like to target the same place?” Ling Tian could only plead for mercy.</p><br/><p>“You women..? Hmm??” Li Xue narrowed her eyes dangerously. “I almost forgot, this great noble Ling here has power and influence and also looks so elegant and suave, you definitely have crowds of wives and concubines in your house, with beauties as plentiful as the clouds, right?”</p><br/><p>“Do you still need to mention it?” Ling Tian stuck his head up in pride, “Your brother’s charm can’t be denied! Women will run back to their houses the moment they see me, and will not come out even if they were hit using clubs. Aiya sssss….”</p><br/><p>“You still dare to say! You d*mned stud!” Li Xue immediately attacked Ling Tian’s waist in the most ruthless manner, here a 180-degree twist, then turning into the fabled 360-degree twist as she spat out.</p><br/><p>Ling Tian let out a wail of misery, pleading for forgiveness. This was not faked, as this move made by women could be said to be a male’s ‘greatest pain’! Even an immortal godly body could not protect you from the pain!</p><br/><p>Li Xue angrily snorted and turned her head sideways, fuming and ignoring him.</p><br/><p>Ling Tian could only smile helplessly in response, then suddenly let out a long and heavy sigh, as though all the unfavorable things from the ancient times had suddenly landed upon him. The sigh was unbearably heavy and miserable…</p><br/><p>“Why are you sighing without rhyme or reason?” Li Xue indeed fell for the trick. While she might have an intellect above most people, when it came to matters about Ling Tian, her IQ would take a nosedive. She immediately turned back to face him.</p><br/><p>“Tired! I’m really tired!” Ling Tian sighed, feeling the fatigue from all parts of his body as he continued, “You might not know this, but the me in the past life never did actually have any ambition to aim for something. As such, I ended up with such a miserable ending. At the point where I knew my life was as good as ended, I then realized that in this world it does not matter whether or not you have an ambition, there will still be people who will not let you go! Even if you back yourself to a corner, so long as you are still breathing, there will be people who will go after you! Because only the dead are no threat! As such, the moment I came to this world, I’ve always reminded myself of one thing.”</p><br/><p>Ling Tian’s gaze was deep, “What should be mine, will be mine; if anyone wants to snatch it from me, I’ll kill them! As long as I take a fancy to it, even if it doesn’t belong to me, I’ll still snatch it. As long as it falls into my hands, then it’s mine! I’ve slowly walked to where I am now, but I’ve never thought that what I needed to snatch would actually be the entire world below the heavens! I’m really perplexed now. If I successfully snatch all below the heavens, then what else can I snatch? What else can I fight for? What else is there that will catch my attention?”</p><br/><p>Ling Tian actually wanted to just use a small trick to tease Li Xue and solve the embarrassing situation, but he somehow got affected by his emotions and got carried away.</p><br/><p>Li Xue bowed her head down, deep in thought, and only quietly replied a few seconds later, “Actually, there’s no need to snatch, nor is there a need to decide what belongs to whom. A possession, at the end of the day, is merely an object in the hands of a person. Who the person is who holds it is the important part. This reasoning should have been understood by us a long time ago, even if our hearts refuse to believe in it, at least for me.”</p><br/><p>“Based on this reasoning, whether it is our past world or this new place, it is something too cruel for the people to take in.” Ling Tian disappointedly replied, “The emotions and feelings between people are actually too sinister.”</p><br/><p>“In chaotic times, heroes contend for supremacy. This has always been the case!” Li Xue smiled sweetly. “Unless you can establish a unified empire, only then can the majority of the commoners be spared of their miserable fates! As long as there is chaos, there will definitely be war, and with war, plundering and robbing will be commonplace. These things can never be avoided! However, under a unified empire, there will definitely be people that can avoid such a cruel fate! Although even under a unified empire, there will definitely still be people who are unable to avoid this fate. This is something that you can’t change even if you become a god!”</p><br/><p>“To be able to put an end to this chaotic time could be considered as a meritorious act already,” Li Xue finally concluded. “With your knowledge and the memories of your past life, it could be considered the best outcome one could ask for if you were to be the one to put everything to an end. Maybe, this responsibility could even be the original reason why you came to this world.”</p><br/><p>“Responsibility?! My responsibility?” Ling Tian burst into laughter, snorting disdainfully at this concept!</p><br/><p>Li Xue let out a sweet smile and changed the topic, “Yesterday when you were discussing the terms and conditions with DongFang JingLei, you were quite the generous person.” she said with some veiled intentions.</p><br/><p>Ling Tian let out a knowing smile in response, “You mean the fact of promising him an area of hegemony, like a country within a country?”</p><br/><p>Li Xue nodded and spoke while in deep thought, “As it seems, DongFang JingTian seems to be more ambitious as compared to DongFang JingLei, but the latter is definitely not as simple as he seems. If through your assistance he is allowed to gain strength, then I might not find it surprising even if he turns back to bite you.”</p><br/><p>“I too will not find it strange.” Ling Tian indifferently replied, “But he will forever not possess enough strength to go against me! So long as he agrees to my terms, it will be an impossibility for him! I will never give anyone the chance to betray me, not even a single thread of chance! As for allowing him to be the local tyrant for a country within a country? That will have to wait until the heavens calm down before we can discuss anything.”</p><br/><p>Ling Tian laughed softly, but it was full of icy cold killing intent!</p><br/><p>Li Xue sighed once, “What you say makes sense. If he doesn’t agree, then he only can watch helplessly as his brother gets devoured. If he agrees, then even if he waits until the day that the world is unified, his status ultimately only comes from your mouth in the end. It seems like I’m overthinking it.”</p><br/><p>Ling Tian laughed in response, before standing up. “If I calculate properly, Justice should have long left the scene, and it’s time for us to go and admire the scene of the number one expert’s battleground. At the same time… cough cough cough, I say, Li Xue, you should go and wash your face. I admit that you’re a beauty, and while you might not be inferior to those famed beauties, after crying for a night you still need to wash off those marks, right?”</p><br/><p>“You! Saying that I look like a dirty tabby cat again!” Li Xue flushed red immediately, stamping her feet in anger, “You’re hateful!”</p><br/><p>“Hahaha…” Ling Tian had long flitted away quickly, and his voice sounded from afar, “Anyways, you can help me wash my clothes as well… yesterday you cried so much that it could form a river, and now all my clothes are wet, so they’re pretty uncomfortable to wear… hahaha…” Amidst his laughter, Ling Tian had long fled as far as he could.</p><br/><p>From behind, Li Xue was totally embarrassed, chasing after him with a tomato-red face!</p><br/><p>…</p><br/><p>Upon seeing the disastrous mess in front of them, Ling Tian and Li Xue both suffered from a great shock!</p><br/><p>Was this something that a person could cause?</p><br/><p>On the small hill, the center of it was a huge big hole, at least twenty to thirty feet in depth, radiating out in a bowl-shaped depression. It would still be acceptable if it was just earth, but this was rock-hard granite!</p><br/><p>Within the hole, there was not even a piece of rubble that was bigger than a fist! If one were to use their hands to pick it up, the rock pieces would immediately turn to powder and dissipate with the wind!</p><br/><p>In the surroundings of the hole, the place was neat and clean for a good few feet around it, without even a blade of grass present. The surface was neat and flat, as though a group of workers had dusted the place thoroughly. It was possible that even if they might not even be able to match this standard!</p><br/><p>The trees around the area were strangely devoid of leaves at the side facing the huge hole, forming an interesting sight with one side bare and the other bursting with lush leaves! Lines of white ash were present around the area, forming a scene as though a prehistoric animal had suddenly bared its fangs!</p><br/><p>In the area, dark red splashes could be seen intermittently for over a good hundred feet!</p><br/>\n</div>"}