{"title": "Chapter 432 - Tough Choice", "id": 432, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-432-tough-choice", "volume_title": "Volume 5", "body": "<h1>Chapter 432 - Tough Choice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 432: Tough ChoiceTranslator: DavidT Editor: DavidT, Rock</p><br/><p>Ling Jian’s letter:</p><br/><p>“… I originally planned to follow the plan and make my retreat but Shui QianHuan offered a new business deal to kill the other two sons of Yu ManLou. After thinking about the matter for a long time, I can’t come to a decision! Ever since the Courtyard was built and the First Pavilion established, every member who has tried to infiltrate the Yu Family was discovered and killed! Our First Pavilion and the Yu Family are destined to become enemies! The airtight defenses of the Yu Family have rendered us incapable of digging out the Yu Family’s trump cards!</p><br/><p>The world is about to fall into chaos, and if we are still unable to investigate the hidden strengths of the Yu Family, it will definitely be detrimental to the ambition of our young noble! Young noble is currently in danger and being pursued by the Martial Order Medallion. But the moment he returns, it would be akin to a dragon returning to the ocean or a tiger returning to the forest and the storm clouds will definitely be stirred. If we are still unable to settle this matter by the time young noble returns, are we going to trouble young noble to take action personally? If that’s the case, Jian will not have the face to continue living in this world!</p><br/><p>Jian plans to spend a few days to visit the Yu Family in the night. If I can kill them, I will spare no effort in doing so. If I can’t kill them, I will focus my effort on investigating the Yu Family. Even though there are some risks in doing so, this life of mine belongs to the young noble I don’t dare to let him down. As such, I have sent a note to Sky Bearing to seek permission.</p><br/><p>Jian will be waiting for a response in Northern Wei. The forces of the Yu Family are presently thinly spread and such an opportunity will not come again. I hope for a quick response.”</p><br/><p>“Quick response? My dear Ling Jian, you have really given me a huge dilemma!” Ling Chen let out a sigh as she paced around in frustration.</p><br/><p>While Ling Jian’s suggestion seemed to be extremely rash and without any benefits, Ling Chen knew that the Ling Family had never succeeded in spying on the internal affairs of the Yu Family. In fact, it wasn’t just the First Pavilion. All other powers had definitely tried spying on the Yu Family before, only to have all of their spies eradicated!</p><br/><p>Just as the saying goes, ‘Knowing your enemy as thyself will lead to success every time’. Without a proper grasp of the enemy’s strength, mistakes in judgment would definitely be made. In critical times, the outcome of the whole battle may even be determined as a result of a mistake! From this aspect alone, Ling Jian’s suggestion was definitely an appropriate one.</p><br/><p>Currently, there wasn’t anyone more suitable for the task than Ling Jian. Furthermore, Ling Jian was presently stationed in Northern Wei. As long as Ling Jian could successfully enter and leave the Yu Family, the internal affairs of the Yu Family would be easily deduced even if Ling Jian didn’t investigate anything in particular.</p><br/><p>However, the undercurrents in Northern Wei were surging, and the situation was currently extremely unstable. The Yu Family would definitely be much more careful at this time. Trying to spy on the Yu Family now was definitely far riskier than usual! However, this was also the time where the forces of the Yu Family were the most thinly spread! Everything had an advantage and disadvantage, thus trapping Ling Chen in a dilemma.</p><br/><p>It was a gamble, but the stakes of this game was Ling Jian’s life! However, Ling Chen and the rest were presently stationed in Sky Bearing and couldn’t be of any help!</p><br/><p>Deep within her heart, Ling Chen was definitely unwilling to allow Ling Jian to take such a risk. After all, Ling Jian was the second closest person to her after Ling Tian. It wouldn’t be an exaggeration to say that Ling Jian was like a close brother to her. If Ling Jian were to meet with misfortune, it would definitely be a huge loss to the First Pavilion, the Ling Family, and Ling Tian!</p><br/><p>Such a wager was something that Ling Chen didn’t dare to place! Neither was she qualified to place it! But if she let this chance pass, would that mean that she would need Ling Tian to take action personally in future?</p><br/><p>This was the biggest dilemma Ling Chen had faced ever since she had taken over the courtyard!</p><br/><p>Just what should I do? If young noble was here, what would he do? Ling Chen questioned herself over and over again. After a long while, a sharp glare suddenly flashed past her eyes and startled Ling Chi who was awaiting her decision.</p><br/><p>Ling Chen had finally made her decision!</p><br/><p>She lifted up her head and looked at Ling Chi, “Send this message to Ling Jian: Only you are allowed to go! No one is to follow you. Those who disobey my orders will be executed without mercy. Furthermore, no one will be allowed to be on the lookout for you. I will only give you two hours and you have to make your retreat when the time is up! If you are late for a single second, you will be heavily punished! No matter what, you have to make a safe retreat! If you were to die on this mission, you will be expelled from the Ling Family and your tablet will never enter the ancestral hall of the Ling Family!”</p><br/><p>Ling Chi felt his body tremble and had an incredulous look in his eyes!</p><br/><p>He knew that for them to have the word ‘Ling’ in their names indicated that they belonged to Ling Tian. Regardless of him, Ling Jian or the rest, they were all extremely proud of the ‘Ling’ word in their names! To expel Ling Jian from the Ling Family was an even crueler punishment than dicing him into thousands of pieces!</p><br/><p>Ling Chen looked up at the sky and let out a long sigh, “Don’t change a single word of my order and send it to Ling Jian immediately. Tell him to play it by ear and make an immediate retreat if he doesn’t have confidence! If he has the confidence, he must rush back to the Courtyard immediately after leaving the Yu Family! He does not need to inform Shui QianHuan about anything.”</p><br/><p>“Yes!” Seeing Ling Chen’s resolute gaze, Ling Chi didn’t dare to say another word. He gave a bow and quickly took his leave. At the same time, he prayed in his heart, Boss, it is best that you give up! Otherwise… there would be no turning back!</p><br/><p>…</p><br/><p>In the tranquil street, there were very few pedestrians. The summer afternoon was indeed a bad time for one to be out. The scorching sun was like a huge ball of fire wanting to barbeque everything on the earth. The vegetation on both sides of the street also drooped down listlessly as though the sun had sapped all of its energy.</p><br/><p>But in such weather, there were two figures walking briskly on the road. In the eyes of the common folk, these two individuals were walking at a normal pace without anything out of the ordinary. However, none of them realized that the steps of these two individuals that seemed so ordinary actually allowed them to travel thirty to forty feet with every step!</p><br/><p>This was the extreme realm of movement techniques, achieving the state of shrinking the ground to an inch. If an expert were present, he would definitely not be able to believe his eyes! For an individual to achieve such a realm in his movement techniques, that individual would definitely be a legendary character. However, there were actually two such individuals appearing together, and they were both extremely young and no different from teenagers!</p><br/><p>In such weather and despite being under the scorching sun, not a single droplet of sweat could be seen on their faces! Their gazes were also extremely ordinary and just a little bit clearer than a normal individual. Could it be that these two individuals had achieved the realm of returning to one’s true self? That was a legendary realm that one couldn’t hope of achieving without decades of hard work. Could it be that these two individuals were actually unparalleled experts who had regained their youth?!</p><br/><p>One of them was male, the other female. The male was a suave young gentleman and always had an amiable smile on his face. When one saw him, the description of ‘modest gentleman and gentle like jade’ would definitely surface in their mind. However, who would have imagined that this suave and amiable young man had actually charged into the enemy’s forces and slaughtered thousands with his own hands? Who would have imagined that he was the maniacal god of massacre who shook the entire continent?</p><br/><p>The young girl was slightly more petite than the male and was dressed in a snow-white dress. Her appearance was like a beautiful flower, and she could truly be described as a country-toppling beauty! Despite her taking a casual stroll on the streets, she looked as though she was a fairy who had descended from the heavens and wouldn’t be stained by the ugly filth of the mortal world. If someone looked at her, they would definitely be filled with a sense of inferiority and be afraid to even lift their head up to catch a second glance. A smile full of wisdom could always be seen on the girl’s lips, and it was obvious that she was filled with joy.</p><br/><p>It was truly a match made in heaven!</p><br/><p>These two teens were naturally Ling Tian and Li Xue. Currently, they had already made a detour around Western Han and were less than a hundred miles away from Bright Jade City. The sudden appearance of Above Heavens had temporarily removed the threat of the Martial Order Medallion, and Ling Tian could finally vent his frustrations from being pursued for such a long time. Thus, he decided to use his original appearance to travel openly on the main road. If anyone dared to seek their deaths, he would have a perfect target to vent his frustrations!</p><br/><p>However, after traveling for almost half a day, not a single figure could be seen! This made Ling Tian extremely depressed. Could it be that I am so worthless that I can’t even meet a robber?</p><br/><p>Seeing Ling Tian’s expression, Li Xue began to chuckle, “Is someone feeling frustrated about not having a target to bully?”</p><br/><p>Ling Tian said hatefully, “How strange. More than two thousand of those b*st*rds were gathered back then and not a single one of them can be seen now. Could it be that they have all learned to be obedient? Or are we concealing our tracks too well? How can they not find us?”</p><br/><p>Li Xue replied with a smile, “You don’t have to worry about that. With how high-profile we have acted in the past two days, there would definitely be many who have found us. However, most of them would be lone rangers or small groups. Do you truly think that a few of them would dare to provoke the infamous young noble Lin? Would they dare to pull on the tiger’s whiskers?! Wouldn’t that be no different from seeking death? They would definitely want to gather some manpower before having the guts to make their appearance. There’s no need to worry, the time will definitely come soon.”</p><br/><p>Ling Tian snorted, “Now that we are entering Northern Wei, we will be reaching the Yu Family’s territory. If any other family were to be afraid of me, I would still be able to accept it. But how can it be that even the Yu Family and Above Heavens are completely silent? There is definitely something fishy about this.”</p><br/><p>“What’s so fishy about it?” Li Xue pursed her lips and said with disdain, “You are truly pig-headed! Above Heavens has just battled with Justice and with Justice heavily injured, how many of them could be left uninjured? How would they have the strength to attack you? As for the Yu Family…” As Li Xue said that, she suddenly stopped and began shouting excitedly, “Look look look, they are finally here! Hehehe, finally some robbers! Woohoo!”</p><br/><p>Ling Tian rolled his eyes speechlessly as he thought, This lass is truly something else. Who would be so excited when seeing robbers trying to rob them? Ordinary petty thieves would probably be scared away by her crazy antics! Although, Ling Tian himself was also feeling extremely elated!</p><br/>\n</div>"}