{"title": "Chapter 431 - Ling Jian Sends Word", "id": 431, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-431-ling-jian-sends-word", "volume_title": "Volume 5", "body": "<h1>Chapter 431 - Ling Jian Sends Word</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 431: Ling Jian Sends WordTranslator: chuchutrain Editor: DavidT, Rock</p><br/><p>When that happens, then the two thousand-year-old families would become the dowry for their family heads when they marry! If that happened, combining the influences of the three strongest families currently, then who would be able to withstand the spearhead of Ling Tian’s forces?</p><br/><p>Of course, before that could happen, the amount of planning needed had a long way to go. Right now, these two objectives were still too far-fetched to be considered! But for the sake of Ling Tian and his goal of hegemony, there wasn’t anything that Ling Chen wouldn’t do, thus she had already begun orchestrating this in the dark! Ling Chen’s ideology was that while things might not come to fruition, the two families would still break apart due to her meddling. Furthermore, with their grudges from the past millennium still hounding them, at that time they could leisurely tackle this problem. To that point, Ling Chen’s goal had even stretched as far as the Xiao Family’s little princess, Xiao YanXue…</p><br/><p>Since she was already destined not to be able to monopolize him, and since Ling Tian had already chosen to walk this road, then why not extrapolate and attempt to squeeze out the most benefit?! This was Ling Chen’s thought process. For Ling Tian, Ling Chen had already thought of a way to assist him in quickly becoming the master in every single path!</p><br/><p>To become the master of all under heavens as a mere teenager, only then is there meaning. If one waited until he was graying at the temples before conquering everything, then where was the meaning in it?</p><br/><p>After the ceremony ended, all three ladies had their own thoughts, but none of them felt any happiness or any sense of victory. Yu BingYan pretended to be unhappy, pouting as she groaned, “I was actually the eldest daughter, and now, great, I’ve become the youngest third sister. In one move I fell by two grades, I’ve really been taken advantage of…”</p><br/><p>Both Ling Chen and Shui QianRou immediately burst out into laughter. Shui QianRou patted her on the shoulder as she smiled, “Third Sister, from the intelligence report that I received from the family, it said that you had an incurable problem since you were born, causing you to be unable to cultivate in the first-class sutras of your family. You could only get by through practicing shallow martial skills, with scant effectiveness. However, it seems to me like you’re perfectly normal. Not only do your internals seem healthy, but your skin is also glowing and your breaths are long and deep, which is the trademark of a pugilist with some attainments in cultivation! Your sister here doesn’t understand, could it be that my family’s report was wrong? But even so, there couldn’t have been such a huge slip-up, unless you met with some sort of miracle these last few years?!”</p><br/><p>A sweet and blissful expression appeared on Yu BingYan’s face as she replied, “Actually, before this little sister came over to Sky Bearing, I was exactly as described in your family’s report. I lived in fear that one day I might close my eyes to sleep and never open them again! However, the heavens have eyes and take pity on the unfortunate. After I met Tian’ge, he passed an extremely mystical inner energy cultivation sutra to me that was perfectly suited for women possessing pure yin bodies. From then on my body got better day after day, and while my illness has not been eradicated, compared to before, my current self can’t be mentioned in the same breath as my old self. This is really a case of bidding farewell to karma, saying goodbye to my past as if it was a lifetime ago.”</p><br/><p>Yu BingYan might be naive, and not well versed in people relations, but she was deeply aware how mystical the pills were that Ling Tian had concocted. Just a single pill could give someone a decade’s worth of internal energy that could only be obtained through cultivation! Just this point alone already made this pill into a priceless and unique treasure! If word spread out, no one knew how many covetous eyes would land on him, and how much trouble would come after him. While Shui QianRou had already become sisters with her, this sort of secret was still unsuitable for her to know.</p><br/><p>“So it turns out that it’s like this. Sister really went through many twists and turns before having such a fortuitous encounter. This is really the case of heaven having eyes and blessing the good!” Shui QianRou absentmindedly spoke a sentence of congratulations before falling silent. The moment Yu BingYan mentioned Ling Tian, it immediately brought up the greatest burden on her mind. Thinking about this Ling Tian who was constantly on her mind yet made her clench her teeth in irritation, Shui QianRou’s heart was thrown into disorder. She suddenly remembered, weren’t these two ladies in front of her technically Ling Tian’s women? How did she not take any precautions against them, and even went so far as to become sworn sisters with them?! She began to suspect her own sanity.</p><br/><p>Feelings should remain as feelings, while one’s position should remain under official affairs, never to be lumped together. In the end, I’m still a member of the Shui Family. Shui QianRou attempted to ease her own anxiety, yet her thoughts were getting more messed up.</p><br/><p>Looking at Shui QianRou’s facial expressions, Ling Chen suddenly developed a thought. She slid up to her before whispering, “Second Sister should rest easy. Before he left, the young noble specially indicated to me that if he didn’t make it back, then I should help you to dissolve the poison in your body. He has already told me the methods to do so. Rest assured, from the start, young noble never had any intention whatsoever to actually harm second sister’s life.”</p><br/><p>Shiu QianRou’s body trembled at these words before some sort of complicated look was revealed within her eyes. She bit lightly on her lower lip, and it was unknown what she was thinking as her calming heart was suddenly scrambled up once more.</p><br/><p>He… this time escaping from the pursuit of the Martial Head Justice, he is literally dancing with death! His time was already so precious, yet he didn’t forget about me before leaving and even specifically left the instructions on how to dissolve the poison! Was he afraid of harming me if he happened to unluckily fall under the hands of the Martial Order Medallion owner?</p><br/><p>Ling Tian, why did you do this? Since you had already insulted me, why did you still bother to think about me? Letting me die and ending it, wouldn’t that be better? Why the need to leave the antidote? You… are really evil! I really hate you! Shui QianRou screamed internally in her heart, as tears streamed down her cheeks.</p><br/><p>Ling Chen sighed faintly before standing silent off to one side. She didn’t bother to go up to console her, as Shui QianRou now had her heartstrings tugged into disarray, and it would be better if she settled it down on her own. If Ling Chen were to step forward to console her, she might achieve the opposite effect of increasing her suspicions.</p><br/><p>Below the mountain, a white shadow shot directly up like a high-speed bullet train, his feet almost not touching on the ground below him at all as he approached. The grasses surrounding him all parted to two sides as he ran, giving off the impression much like a boat moving along a calm lake. In an instant, he had already come in front of the three ladies. He had a young and slightly innocent countenance, but his whole body slightly exuded a faint cold killing intent. That was Ling Chi! However, under his deadpan expression, there was a faint tinge of anxiety that couldn’t be seen by normal people.</p><br/><p>Soaring on grass! Shui QianRou’s misty pupils suddenly contracted, as she exclaimed to herself. As a descendant from a millennium-old family, Shui QianRou definitely knew her stuff, and one look was enough to tell the realm that Ling Chi’s movement techniques were at. While Shui QianRou and Ling Chi had met a few times before, and while she knew that his martial arts were extraordinary, she didn’t expect him to be at such an extreme level!</p><br/><p>It wasn’t that Shui QianRou had never seen anybody at such a realm before. In fact, she had seen many people at that realm, but for someone of Ling Chi’s age, not only was he unique among all those she knew, but there couldn’t possibly be more than five people of this level in the entire world. Just this point would require her to reevaluate Ling Tian as well as his subordinates in the Ling Family Courtyard. How could Shui QianRou not be surprised?</p><br/><p>Ling Chen’s heart also sank upon seeing the situation. She immediately knew that there was something wrong the moment she saw Ling Chi’s expression. Because she had been in close contact with Ling Chi over the past few years, thus she was the most familiar with Ling Chi after Ling Jian. Seeing such a heavy and anxious look in his expression, she could immediately tell that this matter wasn’t a small one.</p><br/><p>“What is it? Why are you in such a panic? How unruly!” Ling Chen’s eyes grew cold as she lightly snapped. While things might be urgent or bad, the young noble always emphasized that, since things had already happened, panicking was of no use and would only get in the way! One had to have a calm mind to deal with the matters, and this point had always been etched very clearly in Ling Chen’s heart. Now that she was the overseer for the Ling Family Courtyard, if she allowed herself to panic as well, then everything would just sink into chaos. Thus, she couldn’t allow anything to happen to herself, as she was living right now for the person she loved the most. Thus, she couldn’t panic.</p><br/><p>As such, even though Ling Chen was nervous in her heart, there was not a single expression shown on her face.</p><br/><p>Seeing the calm and steady expression on Ling Chen’s face, Ling Chi had a sort of feeling as though he was once again standing in front of his young noble and nothing seemed impossible to him. There was a certain sense and security emanating from her, and this caused his emotions to quickly settle back down to normal. He replied, “Elder Sister, Nineteen has delivered news and requires Sister to make a decision.”</p><br/><p>“Oh.” Ling Chen’s face remained impassive, but inside her heart she was greatly shocked. Ling Nineteen had followed Ling Jian to Northern Wei this time around, so if he passed down news, it naturally had something to do with Ling Jian. This was no small matter. What sort of problem was it that Ling Jian, with his status, couldn’t settle it and needed her to make a decision?</p><br/><p>Could it be that the young noble…</p><br/><p>Glancing at Yu BingYan and Shui QianRou, Ling Chen quietly spoke, “Is the matter very important? To the point that you needed to interrupt me like this?”</p><br/><p>Ling Chi only respectfully bowed as he replied, “It’s not very important. I merely wanted to give you a heads up.”</p><br/><p>Yu BingYan tugged on Ling Chen’s sleeve as she whispered, “Since Sister Chen has matters to settle, then we can head back first. When you have time, us sisters can meet up again.”</p><br/><p>Shui QianRou also nodded in assent, as she spoke in a low voice, “Big Sister’s matters are more important. Us sisters still have a long time ahead of us, so why rush it?”</p><br/><p>Ling Chen could only sigh in resignation and murmur, “Since that’s the case, then I’ll bid farewell first. Sis Rou, once your people arrive, please inform me. Because your brother is doing a solo mission in Northern Wei, we lack influence there and need more time to prepare in advance.” Shui QianRou nodded before bringing Yu BingYan away.</p><br/><p>Seeing the two walk far, Ling Chi finally brought out a piece of paper from his bosom and passed it over, while speaking in an urgent tone, “Big Sis, Brother Jian’s decision is very dangerous. Even after so many years, we still are unable to truly measure the depths of the Yu Family. If we were to go into the Yu Family’s Residence and perform an assassination, I’m afraid…” Ling Chi didn’t continue, but the palpitations that could be heard from his voice were obvious.</p><br/><p>Ling Chen’s face sank as she speedily read through the contents of the letter. Her hands were clenched tight, knuckles white as she exclaimed, “That Ling Jian! I knew he would definitely create problems, but I didn’t expect that he would actually… ehhh?”</p><br/><p>Ling Chen broke her own sentence with a surprised ‘eh’, before sinking into deep thought once again. She read through Ling Jian’s letter closely, before suddenly taking in a deep breath. As the contents of the letter flowed through her head again and again, she found it harder and harder to decide.</p><br/><p>Ling Jian’s words might actually make sense!</p><br/>\n</div>"}