{"title": "Chapter 449 - Rescue Mission", "id": 449, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-449-rescue-mission", "volume_title": "Volume 5", "body": "<h1>Chapter 449 - Rescue Mission</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 449: Rescue MissionTranslator: DavidT Editor: DavidT, Rock</p><br/><p>Thinking about that, Ling Jian no longer thought about breaking out of the encirclement and his resolution to die shot through the roof. He abandoned all of his defenses, ignoring the incoming weapons as his cold gaze was locked onto Yu ManLou above him!</p><br/><p>His eyes were void of all emotions and were filled with calmness and chill! He was like a vulture locking onto his prey!</p><br/><p>Ling Jian’s sword began to let out ‘si si’ sounds and the body of his sword reflected the fiery glow of the blaze around him. It was as though his sword was a venomous snake that found out that his prey’s action was restricted, anxiously waiting for its chance to pounce forth…</p><br/><p>Seeing Ling Jian’s look of death, Yu ManLou immediately knew what Ling Jian was planning to do and sneered in his heart. While the inner qi and martial arts of this Pavilion Head in front of him were exceptional with less than 20 in his Yu Family being a match, Yu ManLou had full confidence that he could subdue the First Pavilion Head. After all, Yu ManLou was no ordinary expert, and the gap between them was immense! Even if the Pavilion Head in front of him wanted them to perish together, it would be impossible for the Pavilion Head to succeed! The Yu Family’s Divine Bright Jade Formula was unleashed to its maximum. Yu ManLou began to glow with the light of a treasure, with his palm strike descending like divine lightning!</p><br/><p>One hit, one kill!</p><br/><p>However…</p><br/><p>Right at this moment, Yu ManLou felt his back turn cold and felt a strong sense of danger!</p><br/><p>Not good! There is the ambush of another expert! The danger of this expert is above the First Pavilion Head in front of me!</p><br/><p>Who is he?!</p><br/><p>The experts surrounding Ling Jian brandished their weapons and charged at Ling Jian with their full strength. Ling Jian clenched his teeth and his sword shot towards the sky! Ling Jian did not hold anything back at all and his lifetime’s worth of cultivation was imbued in this attack!</p><br/><p>His sword shot right towards Yu ManLou!</p><br/><p>Right after Ling Jian’s figure shot upward, various weapons cleaved down towards Ling Jian and fresh blood shot out in all directions. In just an instant, Ling Jian was filled with countless injuries and was completely bloodied!</p><br/><p>After his many years of cultivation and countless life and death struggles, Ling Jian’s body instinctively avoided the weapons to ensure that there were no fatal wounds or serious injuries!</p><br/><p>While Ling Jian had only suffered superficial wounds, such wounds were enough to render others completely immobile! However, Ling Jian’s sword strike was still extremely robust and did not weaken the slightest. It was as though the wounds on his body belonged to someone else!</p><br/><p>If Ling Jian’s black mask were to fall off now, everyone would definitely realize that Ling Jian’s expression was still chilly and indifferent despite suffering such wounds!</p><br/><p>In midair, a large black robe was fully spread out, but not a single sound could be heard. With a mountainous pressure, the black robe continued to descend! This scene was like someone entering a nightmare and despite seeing someone pointing a sword and attempting to kill you, you weren’t able to say a single thing. The stifling feeling was enough to drive someone insane!</p><br/><p>Right at this moment, Ling Tian descended from the sky!</p><br/><p>Saving his ally from the middle of the encirclement! Ling Tian’s palms struck towards Yu ManLou like the neverending waves of the ocean and the majesty of the rivers!</p><br/><p>At this moment, there were many who had spotted the presence of another mysterious black-robed figure!</p><br/><p>Yu ManLou fell into the danger of suffering a pincer attack!</p><br/><p>He could clearly feel that the threat from above him was far greater than the threat posed by the First Pavilion Head! If Yu ManLou were to continue his attack, while he would be able to kill Ling Jian for sure, the attack from the person above him would definitely heavily injure him or even take his life!</p><br/><p>In just a short instant, Yu ManLou had made his decision. His originally descending figure had actually drifted past Ling Jian’s head and his left palm struck out towards the sky. His legs then sent out a flurry of kicks to receive Ling Jian’s sword strike!</p><br/><p>With a loud bang, Yu ManLou’s body trembled slightly and shot out 30 feet away. Looking at the black shadow in the sky, Yu ManLou’s eyes were filled with a crazed anger and deep hatred! At the same time, both of his palms were also trembling under his sleeves!</p><br/><p>What would cause the Family Head of the number one Yu Family to lose his cool as such?</p><br/><p>The moment he exchanged blows with his opponent, Yu ManLou felt an extremely familiar feeling! Yu ManLou almost wanted to shout out at that moment!</p><br/><p>Facing Yu ManLou’s palm strike, Ling Tian was sent somersaulting in the sky and he felt his innards churning. This was the second time Ling Tian was forced into a retreat by an opponent. The last time was when he faced Justice’s attack, but it wasn’t anything embarrassing for Ling Tian to lose to the world’s number one expert. However, Ling Tian was ambushing Yu ManLou this time and Yu ManLou had to deal with Ling Jian’s suicidal attack at the same time. However, the result was that Ling Tian didn’t gain the upper hand at all. While Ling Tian didn’t lose out in this clash, it was true that Yu ManLou’s cultivation was above his own!</p><br/><p>Only…</p><br/><p>Ling Jian’s destiny to perish had been rewritten!</p><br/><p>Facing Yu ManLou’s flurry of kicks, the originally heavily injured Ling Jian spat out a mouthful of blood. When Yu ManLou had drifted over his head, Ling Jian finally exhausted the last bit of his energy and collapsed weakly.</p><br/><p>Ling Jian finally understood the gap between him and Yu ManLou. Even if he was in his prime state and used the assassination methods that he was so proud of, it would be impossible for him to kill this Yu Family Head. If not for the fact that Yu ManLou changed his attack at the last moment, Ling Jian would already be on his way to the afterlife! However, Ling Jian was already at his wit’s end now and after receiving Yu ManLou’s kicks, he was injured both internally and externally. His life was like a flickering candle that would be extinguished at any moment!</p><br/><p>At this moment, Ling Jian raised his head and was surprised to see another black-robed figure in the sky. Behind the black mask, a pair of familiar eyes could be seen! How familiar! How friendly! This was also the hope for Ling Jian to fight with the last bit of his life!</p><br/><p>Ling Jian was suddenly overwhelmed with happiness! I have finally seen the young noble again! It was the young noble who saved me!</p><br/><p>A familiar voice sounded in Ling Jian’s ears, “Jump up!”</p><br/><p>His originally exhausted body was suddenly filled with boundless energy again, and he managed to forcefully change the stance of his falling body. With a flash of his Black Iron Sword, he clashed with the weapons beneath him, and his body flew up towards the sky by borrowing the force of the rebound!</p><br/><p>After exhausting his last bit of strength, he fell unconscious the moment his body flew up! Before falling unconscious, Ling Jian felt a sense of complete security and safety! He knew that his young noble would not let his body fall back down for sure!</p><br/><p>He no longer had to die!</p><br/><p>Ling Tian’s figure shot down and grabbed Ling Jian’s body. With a wave of his right hand, Ling Jian’s sword was in his hands!</p><br/><p>Yu ManLou then roared, “Surround him! Shoot the arrows! Block him! He must not be allowed to leave!” Yu ManLou knew that the figure who had just arrived was even more powerful than the First Pavilion Head. Even if he was slightly weaker than himself, the difference wasn’t huge. Thus, Yu ManLou personally charged forward as well. The various experts of the Yu Family charged forward as well! If they were to surround Ling Tian completely, they would definitely be able to leave Ling Tian here tonight!</p><br/><p>Ling Tian’s figure remained floating in midair, completely unhindered by the fact that he was carrying someone. A sword then slashed down and with the addition of Ling Tian’s inner qi, a half foot sword light could be seen on the tip of the sword!</p><br/><p>The Pavilion Head of the Unreturnable Pavilion bore the brunt of the attack. He retreated as quickly as he could and his sword shot out towards Ling Tian! He knew that if the sword like were to strike him, he would be a goner regardless of how many experts the Yu Family had!</p><br/><p>His reaction was truly the most appropriate one!</p><br/><p>However, this was provided Ling Tian was attempting to attack him!</p><br/><p>A trace of mockery could then be seen on Ling Tian’s lips and the sword light on his sword disappeared suddenly. His sword then clashed with the incoming sword with a loud ‘clang’!</p><br/><p>Yu ManLou let out a roar, “Stop him! He wants to escape by borrowing the force of that attack!”</p><br/><p>A pity, it was far too late!</p><br/><p>Hugging Ling Jian, Ling Tian borrowed the force from the attack and shot 40 feet into the sky! He was less than 30 feet away from the Yu Residence’s walls!</p><br/><p>Right at this moment, a ball of light shot out from a tree outside the Yu Residence! It was as fast as lightning and covered in a dim green glow. As though it had its own sentience, the ball of light spun around Ling Tian.</p><br/><p>Yu ManLou was utterly enraged and knew that this was his opponent’s escape route. He could not be bothered to issue any commands but gathered his own inner qi and charged towards Ling Tian. At the same time, the arrows of the Yu Family also shot towards Ling Tian like the boundless ocean!</p><br/><p>The force from Ling Tian’s jump was completely spent, but Li Xue had just begun to exert her strength! This was the moment where the old force was spent and the new force yet to take effect!</p><br/><p>Yu ManLou was not only fast, but also chose the right moment. He appeared in front of Ling Tian and sent two vicious palm strikes!</p><br/>\n</div>"}