{"title": "Chapter 440 - Deep Dark Night", "id": 440, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-440-deep-dark-night", "volume_title": "Volume 5", "body": "<h1>Chapter 440 - Deep Dark Night</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 440: Deep Dark NightTranslator: chuchutrain Editor: DavidT, Rock</p><br/><p>“What choice do you have? You didn’t agree when I asked you to be my maid!” The brother wrung his hands with a face of helplessness. Seeing the sister ready to flip out once more, he immediately placated her, “Alright, alright. We only got in with much difficulty, let’s first find an inn to stay. I’ve worked myself out the last few days and finally got back in touch with society. Tonight, I’ll definitely have a good sleep! My poor old bones are already tired stiff.”</p><br/><p>A ‘puchi’ sound of laughter escaped from the sister’s mouth as she replied, “Then just find any random inn that will take us in and allow you, this old man, to have a good rest. The moment someone advances in age, their movements are no longer as nimble. This point, you don’t need to explain, I understand it completely! Let’s go!”</p><br/><p>“No rush, let’s walk in front for a little longer. Not much farther in front will be the Yu Family’s residence. We have to stay closer to the Yu Family, after all, we’re considered relatives of some sorts, aren’t we? Like this, there’ll be more of a sense of security!”</p><br/><p>“Is this sense of security only obtained after you annihilate the entire family?” The sister took a water skin out from her waist in an exaggerated fashion, and guzzled the water in a very unwomanly way as she continued walking down the street.</p><br/><p>“Nonsense, this old man is the kind that would sweep the floor carefully for fear of harming the lives of ants and would cover the lamps for fear of burning up moths. Saving a life beats building a seven floored pagoda! Amitabha.” The brother put on a benign expression as he put his palms to face each other. However, his unibrow and triangular shaped eyes completely spoiled this image, making him look disgusting!</p><br/><p>“Pu!” The brother’s face was immediately splashed with water and could only angrily use his sleeve to wipe it off.</p><br/><p>“Cough cough cough…” The sister choked so hard on her water that she kept coughing, almost unable to breathe.</p><br/><p>“Let’s take this one.” As the two of them raised their heads, they were greeted with the sight of the words ‘Welcome Home Tavern’ on a signboard. The siblings shared a glance and a laugh, before walking in together.</p><br/><p>Just one street away was the vast and expansive number one aristocratic family in Heavenly Star, whose pavilions and lakes looked as though they originated from a painting, the Yu Family!</p><br/><p>At this time, the lanterns were just being lit, and every household had a flickering light coming from their windows, giving the impression of a dreamy and illusory feel to Bright Jade City.</p><br/><p>As the night deepened.</p><br/><p>Ling Jian sat alone in his room, an extremely thorough and detailed map placed in front of him. Though his face remained deadpan, his eyes were burning with a bright light. This was a sort of look a crazed believer would have when he sacrificed himself for a just cause, and his gaze shifted around the map, taking in every single little detail.</p><br/><p>The guest room, living hall, garden, backyard, martial hall followed by the Martial Pointer Pavilion, the Moon Climbing Star Picking Tower, the Elder Courtyard, the Unreturnable Pavilion, Traceless Pavilion, Colliding Heaven Pavilion, Ruler Tower, and Illusory Roaming Soul Pavilion. Even the various Jade Pavilions were not spared, clearly stated on the map. In addition, the various living quarters, along with the courtyards of the three Yu Family brothers, as well as their construction structures, was obvious in a glance.</p><br/><p>The chilling light in Ling Jian’s eyes flashed as he sat in deep thought. He could forego any sort of planning for the living hall and the guest room, but he heard that Yu ManLou typically dealt with his official matters at his private office, the Moon Climbing Star Picking Tower, and the important, secretive matters at the Martial Pointer Pavilion. These two places were definitely on Ling Jian’s list of objectives. As for the rest of the Pavilions, nobody knew what they were for. Even for those inside the Yu Family, their knowledge was limited, and only the three Yu Family brothers could come into contact with the inner core. However, even the slightly dimwitted Yu ManTian wasn’t too clear on the details as well, thus one could see how tightly guarded it was.</p><br/><p>The Elder Pavilion was obvious from its name that it was the place for the elders of the Yu Family. This sort of place was not one that you could come into contact with easily. It was better to leave it alone! But what about the rest? Ling Jian was clear that while he did not understand their usage, every single pavilion definitely contained something that the Yu Family deemed important. Since they were in the same area, it could be inferred that their levels were the same. The moment he understood one of them, he would naturally understand the rough purpose for all of them.</p><br/><p>However, the horizontal distance between these pavilions was a little wider, as well as more spaced apart from each other. Based on the two-hour mark which Ling Chen gave him, Ling Jian could only laugh bitterly. Isn’t she thinking too highly of me? Even if there are no obstacles, to finish exploring all of them within two hours was not something I could pull off! The Yu Family’s residence spans over 100,000 squared meters, and even if one used a carriage to trace the circumference, they would still need a whole afternoon!</p><br/><p>Let me start from the neighboring areas first! Ling Jian made his choice. The Yu Family had made him into an undignified mess six years ago. This time, would it still be they who triumph, or the number one assassin under heavens now?</p><br/><p>In Ling Jian’s eye, an intense fire lit up!</p><br/><p>Outside, on the quiet streets, the banging of a gong sounded, followed by a weak and hoarse voice shouting with all its might, “Winds are strong and humidity low, careful of candles and lamps…” The voice dragged on, followed by another two gongs, repeating itself as it passed into the distance.</p><br/><p>12 a.m.!</p><br/><p>Ling Jian slowly let out a breath, before silently standing up from his spot. He stretched out his hand, feeling the sword at his waist, before letting out a confident and cruel smile as he donned on a black mask, before pushing the door and exiting.</p><br/><p>Standing in front of the door, Ling Jian hesitated for a while, as though he wanted to go and see his brothers for the last time. After all, if he was careless in this mission, he would leave this human realm forever! The Yu Family might not be a tiger’s den or a dragon’s lair, but it was far more dangerous when compared to those!</p><br/><p>In the end, he sighed, choosing not to go. If he went over, wouldn’t that mean that he wasn’t confident of himself? He would definitely come back. His young noble could not do without him, Ling Jian!</p><br/><p>The sky was cloudy tonight, without light from the stars or moon. It was the best time for a night operation! A light breeze was blowing, much like the caress of a lover.</p><br/><p>His black robes billowed out from behind him as Ling Jian glided like a bat towards a roof with nary a sound. His slim body blended into the darkness, and only a pair of icy cold eyes could be seen, shining like stars as it indifferently took in the scene of the little courtyard, as though he had some lingering feelings.</p><br/><p>Ling Jian finally took off, rushing towards the sky. His skinny figure flashed once in the sky, then disappeared.</p><br/><p>After he left, the doors on the other two rooms opened, and six youths walked out in single file. The six of them were cold-blooded, heartless killers, but right now, all of them had tears in their eyes without exception, with complex expressions on their faces! Looking at the original residence where Ling Jian used to stay, all of them had eyes full of emotion, coming from the respect deep within their hearts! It was as though that ramrod straight figure of Ling Jian was still present!</p><br/><p>Brother Jian!</p><br/><p>You must come back alive!</p><br/><p>These brothers are waiting for you!</p><br/><p>…</p><br/><p>Yu ManLou had a face as calm as a deep lake, with nary an expression. His fingers drummed against the tabletop, letting out a clear rapping sound, slowly and with a rhythm. Behind him stood two black-robed men, and under the light cast on them, their shadows seemed to blend into nihility. They seemed like they were right in front of everyone, but at the same time they seemed as though they did not exist. This sort of feeling was shocking and extremely weird!</p><br/><p>In front of him was a burly man kneeling on the floor, his forehead dripping sweat, already forming a puddle below him.</p><br/><p>“The Blood Slaughter Pavilion’s sixteen first-class experts were all annihilated? Without a single one left alive? They could not even deal damage to Ling Tian?!” Yu ManLou’s brows furrowed lightly as he murmured, as though whispering to himself, but also as though he was asking a question. The burly man had already lost himself and did not know whether he should or should not reply, and thus resorted to kowtowing on the floor.</p><br/><p>“Besides Ling Tian, another mysterious young lass appeared? With extreme strength? Killing six of the experts just by herself, and not being injured?! And her age could be even younger than Ling Tian?!!” Yu ManLou mused. “Her attacks are full of ice and frost? As though plunging one into a winter solstice? Such a strange Yin-based martial art, to what family does this set of arts belong to?” As he spoke, he frowned again, sinking deep into thought.</p><br/><p>“Reporting to the Family Head, in this present age, there is no family that possesses such a pure Yin-based martial skill.” Behind Yu ManLou, a black-robed man finally opened his mouth to speak. “Comprehensively speaking, in the past millennium, there have not been any records of such a skill being seen, and even the self-proclaimed number one sect, the Beyond Heavens, does not have such a skill!”</p><br/><p>“Are you sure?” Yu ManLou stood up slowly, turning his head over to ask. A cold gleam appeared in his eyes.</p><br/><p>“Definite!”</p><br/><p>“Is this accurate?!”</p><br/><p>“Definitely!”</p><br/><p>“Then you’re saying that they’re lying, but how do you explain these bodies?! Are those caused by these useless trash sabotaging the situation? Or are you saying, that they actually dared to lie to me?!” Yu ManLou’s face grew grave at this!</p><br/><p>“Those that you mentioned are not possible, and this subordinate also does not suspect their words. It is just that for the past millennium, there has really not even been a sighting of such a skill. Especially for someone at Ling Tian’s age, to have a sixteen or seventeen-year-old lass able to use such a strong martial skill, this means that she could very well be someone whom miraculously surpasses Ling Tian in strength!” The black robed man gravely replied.</p><br/><p>“It could indeed only be a miracle.” Yu ManLou began to pace, and while his face remained impassive, his heart was a huge mess. How did such an extreme character appear beside Ling Tian? It was even similar to Ling Tian’s own martial skill, crafty and strange, poles apart from all the various martial skills that he himself was familiar with.</p><br/><p>Could it be that in this world, there was still a hidden force? Or was it some sort of ancient long-lost formula, one left by the ancestors from millennia ago? Other than these, there could be no other reason that could explain this matter!</p><br/><p>“Since Ling Tian had the capability to annihilate all the first-class experts, and not suffer any injury, then how did you guys come back? Could it be that you’re all stronger than those first-class experts, and could escape from that grim reaper without any injuries?!” Yu ManLou coldly spoke.</p><br/><p>They were most afraid of him asking this question, but the inevitable finally happened.</p><br/><p>With sweat pouring down his face, the person in question replied in a trembling voice, “I dare not hide it from Family Head, but at that point, this subordinate’s skills were too lacking and I could not get into the battle at all. That Ling Tian… after he killed those people, he actually let us go and told… told us to convey a message to you, Family Head…”</p><br/><p>“What message?”</p><br/>\n</div>"}