{"title": "Chapter 444 - No Road to the Heavens", "id": 444, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-444-no-road-to-the-heavens", "volume_title": "Volume 5", "body": "<h1>Chapter 444 - No Road to the Heavens</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 444: No Road to the HeavensTranslator: DavidT Editor: DavidT, Rock</p><br/><p>Or perhaps, it would be more appropriate to call it the nemesis of all nightwalkers.</p><br/><p>If not for Yu ManLou’s commands, Ling Jian would have already activated his movement technique to the fullest. While it wouldn’t be easy to shake off all his pursuers, there was still much hope for him to do so. As long as Ling Jian could escape from the Yu Residence, he would be able to find a random alley to change his appearance. At that time, there was a 90% chance for him to escape alive! However, Yu ManLou’s orders had made the situation very different!</p><br/><p>The so-called ‘Heaven Encompassing Net’ was no more than ordinary guards positioning themselves on top of the walls to block Ling Jian’s escape. Without the few shadows chasing after him from behind, Ling Jian could easily slaughter the guards and take his leave.</p><br/><p>However, there were more than a dozen top-notch experts chasing him right now! While the guards could only hold Ling Jian back for a short instant, this short instant was all that the experts behind him needed!</p><br/><p>With just a short instant, the experts chasing after Ling Jian would arrive! At that time, it would be impossible for Ling Jian to escape even if he had wings!</p><br/><p>There were another 40 feet to the high walls!</p><br/><p>There were only 40 feet to the line separating life and death!</p><br/><p>Forty feet was a distance that Ling Jian could easily cross in a single step. However, it was a huge barrier today!</p><br/><p>Ten gigantic nets that were almost twenty feet wide shot towards Ling Jian from all directions, sealing every possible path that Ling Jian could take!</p><br/><p>The net was covered all over with sharp barbs that were obviously as sharp as the teeth of vicious beasts.</p><br/><p>There was a sharp shrill sound of Ling Jian’s sword being drawn, and a brilliant sword light broke through the darkness like fireworks in the sky! The Black Iron Sword!</p><br/><p>Three nets which were layered together were shredded in an instant and Ling Jian’s skinny figure charged past the net.</p><br/><p>The wall was right in front!</p><br/><p>As long as Ling Jian could flip across the wall, his freedom would be ensured!</p><br/><p>While he only spent a short moment to slice the net apart, the experts chasing behind him were less than 30 feet away! Ling Jian could clearly feel that there were a few experts taking a deep breath to prepare for their attacks!</p><br/><p>Ling Jian did not turn around and his body shot towards the wall. As long as he could charge past the wall, even at the expense of light injuries, Ling Jian had the confidence to enter the forest before being caught by the experts behind him. At that time, he would be like a bird in the air and a fish in the water. No one would be able to stop him!</p><br/><p>Young noble is fine and in Bright Jade City!</p><br/><p>I have to see young noble! I have to stay alive to see young noble!</p><br/><p>A colorful light shone forth from Ling Jian’s eyes as he shot towards the sky like an arrow!</p><br/><p>Right at this moment, seven to eight figures suddenly emerged at the top of the wall. They were the guards who guarded the periphery of the Yu Residence. Right at this crucial moment, they had actually ascended the wall first! They were originally below the wall and everything happened too suddenly. Ling Jian’s appearance was also too sudden. From the moment they heard Yu ManLou’s orders until now, only a mere two breaths had past and the enemy was already at the wall! With their strength, it was extremely difficult for them to ascend the wall before their enemy!</p><br/><p>Seeing Ling Jian shooting towards them like an arrow, all of them were clear that it was impossible to stop him with their feeble strength. The six of them let out a battle cry and formed a human wall before jumping down from the wall and receiving that shining sword light!</p><br/><p>The eyes of the six men shone with a crazed determination to die!</p><br/><p>With the Yu Family’s strict discipline, none of them would dare to go against an order!</p><br/><p>If they were to let Ling Jian go, their Family Head would surely pursue the matter and they wouldn’t be able to survive either. If that’s the case, they might as well risk their lives! Even if they were to die, their wives and children would be taken care of by the Yu Family for the rest of their lives!</p><br/><p>Three swooshing sounds could be heard from behind Ling Jian’s back. The three experts behind him had finally gathered their inner qi and unleashed their attack.</p><br/><p>Lunatics! A bunch of lunatics! While Ling Jian was certain that he could kill the six men in front of him with a single blow and continue his advance, he knew that it was impossible for him to not slow down in the slightest. The mass of the six men together with the force of their descent probably exceeded a thousand catties! If Ling Jian were to charge at them from the front, it was impossible for his speed to remain the same!</p><br/><p>Furthermore, the enemies behind him weren’t too far away and they would surely catch up if he were to be delayed for even an instant. If he were to slow down for just the slightest bit, the dozen of Yu Family experts would surely catch up and surround him! Furthermore, the obstruction of the six men in front of him could not be taken care of in just a blink of an eye!</p><br/><p>Besides that, there were three palm strikes behind him!</p><br/><p>The moment he was surrounded, his death would be certain!</p><br/><p>Ling Jian was charging forward at full speed and with the sudden appearance of the six men in front of him, it was far too late for him to change his direction. Both parties clashed in mid-air like heavenly lightning clashing with earth fire!</p><br/><p>Behind him, three powerful palm strikes arrived!</p><br/><p>Ling Jian retracted his sword and stabbed it out swiftly at one of the men who jumped from the wall. That man then closed his eyes with a trace of hopelessness.</p><br/><p>He felt a sharp pain by his chest and thought to himself that it would be the end of his life, with the two protective talismans that he bought being completely useless. After realizing that he was still able to think, he could not help but open his eyes to find that the enemy had already disappeared from his sight.</p><br/><p>Ling Jian’s sword stabbed right at where this man’s heart was and the very next moment, Ling Jian realized that there was a jade protective talisman hanging by the man’s chest!</p><br/><p>Seeing the protective talisman on the man’s chest, Ling Jian quickly changed his mind and softened his inner qi. His sword then bent slightly and with the springing force of the sword, Ling Jian’s body shot out twenty feet backward. Following which, a low grunt could be heard, and Ling Jian landed in the Yu Residence’s garden.</p><br/><p>None of them realized the crazed killing intent Ling Jian had in his eyes when he landed in the garden! Yu Family, since I cannot leave this place, let us perish together! I want to see how many lives you are willing to exchange for mine! I, Ling Jian, may still have a chance!</p><br/><p>With two loud bangs, two powerful palm strikes smashed onto the six men descending from the wall. With the sudden change in the situation, the experts did not have a chance to retract their attacks. All six figures were then sent flying into the air with a fountain of blood spraying out from their mouths.</p><br/><p>The third palm strike collided with Ling Jian’s retreating sword. The force of the palm strike had been built up while Ling Jian’s sword strike was hastily executed. Furthermore, Ling Jian’s specialty wasn’t the depth of his inner qi either. After their attacks connected, Ling Jian felt half his body turn numb and his inner qi unable to be circulated. Only after taking in a deep breath did Ling Jian manage to circulate a wave of his inner qi one cycle around his body to dispel the numbness of his body. Ling Jian’s skinny figure then landed amongst the bushes and with a flash of his sword light, countless bells were set off and the ringing sounds filled the Yu Residence.</p><br/><p>By the time the first three experts arrived in the garden, the mysterious black shadow had already disappeared! It was as though he had evaporated!</p><br/><p>Everyone knew that the black figure was definitely hiding inside the garden and it was impossible for him to escape. However, not a single one of them was able to find where the figure was hiding!</p><br/><p>The dozen of experts who arrived looked at each other with incredulity! Despite the entrapment of the Heaven Encompassing Net, twelve XianTian experts chasing after Ling Jian, and the fact that this happened in their own Yu Residence, Ling Jian was still able to conceal his own tracks in the garden!</p><br/><p>Especially the elder who exchanged a single blow with Ling Jian in mid-air, his was completely pale. A thin white cut could be seen on his palm with traces of blood on the edge! To think that the palm strike that he trained for a full forty years had been sliced through by Ling Jian’s sharp sword qi! If not for his cultivation being deeper than Ling Jian’s he would have lost his palm today!</p><br/><p>While the opponent’s sword was indeed a special divine treasure, his opponent had only hastily defended against his own attack. What if his opponent were to attack him at full force? Thinking about that, a chill ran down the elder’s spine as the cut on his palm began to burn painfully.</p><br/><p>Who is he? How powerful!</p><br/><p>Could it be that Ling Tian had personally descended?!</p><br/><p>From afar, the lanterns formed a huge dragon and hundreds of men surrounded the garden! Even a fly would find it impossible to leave! The twelve XianTian experts spread themselves out in six different directions with two in each direction, monitoring any possible route Ling Jian could escape from. Just when they were about to enter the garden to search the place, all of them looked towards a direction solemnly.</p><br/><p>Yu ManLou walked over calmly as though a petty thief had just entered his house and stole something insignificant.</p><br/>\n</div>"}