{"title": "Chapter 448", "id": 448, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-448", "volume_title": "Volume 5", "body": "<h1>Chapter 448</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 448: Proof of IdentityTranslator: DavidT Editor: DavidT, Rock</p><br/><p>Comparing martial arts, the two Pavilion Heads were definitely no weaker than Ling Jian. In fact, the cultivation of their inner qi was above Ling Jian’s. However, Ling Jian’s sudden ambush caught them completely off guard!</p><br/><p>Ling Jian had reached the apex in the ability to grasp opportunities! This was a sure-kill attack!</p><br/><p>“Not good!”</p><br/><p>This change was something which no one expected, including Yu ManLou! From the ancient times, not a single martial arts legacy was able to allow someone to turn around immediately without any signs despite charging forward at full speed. This was something that went against common sense! If an ordinary person were to attempt something like that, he would probably enter into cultivation deviation. However, this First Pavilion Head was actually able to perform such an action flawlessly and effortlessly!</p><br/><p>Upon seeing that the situation was dire, the other top-notch experts in the surroundings charged forward without hesitation. Yu ManLou was the fastest of them all and his palm strike was already reaching Ling Jian.</p><br/><p>While Yu ManLou’s speed was truly fast, it was far too late!</p><br/><p>After going through so much effort to lure these two experts out and meticulously planning an ambush, how would he give up the advantageous situation in front of him?</p><br/><p>The person on the left revealed a look of resolution and actually sped up further and pounced towards Ling Jian. He was originally using all of his strength to slow himself down but knowing that it was hopeless, he decided to speed up further to welcome Ling Jian’s sword. Since he didn’t have a chance to avoid death, he hoped that he would be able to use his own life to save the life of his friend!</p><br/><p>The next instant, Ling Jian’s sword strike was fully unleashed on him and his flesh could be seen flying in all directions as his body was completely dismembered!</p><br/><p>At the same time, Ling Jian let out a soft sigh and retreated quickly.</p><br/><p>Ling Jian never imagined that his opponent would be able to resolutely give up his life to save his companion. He was originally charging forward at full speed and upon seeing Ling Jian’s attack, tried his best to slow himself down. That action of his had already caused his inner qi to be thrown into disarray. On top of that, he actually sped up again and under the forceful circulation of his inner qi, his meridians were completely ruptured. Even if he didn’t die under Ling Jian’s sword, he wouldn’t be able to survive past an hour. However, his action had saved the life of his friend! The slight disparity in their speed made Ling Jian lose the opportunity to kill the other top-notch expert of the Yu Family!</p><br/><p>“Second brother!”</p><br/><p>The black-robed individual on the right let out an indignant roar and charged towards Ling Jian’s retreating figure in an almost suicidal manner. His eyes were completely bloodshot as he brandished his weapon wildly without a care for anything in the world. At the same time, three individuals had already blocked Ling Jian’s retreating route with their faces filled with grief and hatred in their eyes!</p><br/><p>Yu ManLou arrived from his sky with his imposing aura, his palm strikes covering the skies and slamming down without any mercy!</p><br/><p>To the left and right, there were also plenty of experts launching their attacks!</p><br/><p>Ling Jian let out a roar and shot towards the sky with his sword. His body was then surrounded by layers of green light forming a pagoda, stacking up layer by layer. When the pagoda reached the topmost layer, it suddenly exploded into smithereens, with the shattered light shooting towards all directions. All of a sudden, a brilliant beam of sword light exploded forth like a dragon shooting towards the heaven and Ling Jian had actually entered into the ‘man and sword as one’ state in such a moment!</p><br/><p>This was Ling Jian’s strongest attack! It was also the final attack that Ling Jian had been saving! It was very possibly the last attack of Ling Jian’s life!</p><br/><p>This attack could shake the heavens!</p><br/><p>“Be careful!”</p><br/><p>Yu ManLou had instantly identified Ling Jian’s attack. As a martial arts expert himself, he would naturally be able to identify Ling Jian’s ‘man and sword as one’ state. After letting out a loud roar, he circulated his inner qi and sent out his palm strike to suppress Ling Jian! The only thing he could do now would be to use his inner qi, which far exceeded Ling Jian’s, to forcefully disperse Ling Jian’s attack. If he allowed Ling Jian to unleash this attack, while he would definitely be safe, his subordinates might not be able to escape unscathed! Presently, he was the only one who had the confidence to suppress this black-masked man, the First Pavilion Head!</p><br/><p>***</p><br/><p>“It’s actually Ling Jian!” Ling Tian gasped and felt his heart tense up.</p><br/><p>Ling Tian arrived when Ling Jian was trying to break out from the encirclement!</p><br/><p>“He’s one of yours?” Li Xue landed behind Ling Tian and upon seeing him about to dash out to save Ling Jian, held him back and said, “It’s not too late to watch for a while more. This is the interior of the Yu Residence! Not only do they have the advantage in numbers, but experts are as plentiful as the clouds! Furthermore, Yu ManLou is also present and his martial art level is probably above both of ours. So what if there is one more you? You can’t sacrifice yourself needlessly! If you want to save him, you can’t lose your cool!”</p><br/><p>Ling Tian came to his senses after hearing what Li Xue said and looked towards Yu ManLou who was standing off to the side! While he had never seen Yu ManLou in person before, Ling Tian was certain that he was Yu ManLou without a doubt!</p><br/><p>Other than Yu ManLou, there wouldn’t be anyone in Bright Jade City with such charisma! After he heard what Li Xue said, Ling Tian’s gaze swept around and his face turned solemn. With just a casual glance, he saw no less than 15 small success XianTian experts! Furthermore, there were hundreds of White Jade experts in the vicinity!</p><br/><p>Facing such a lineup, not to mention Ling Jian alone, even if Ling Tian was added into the picture, he would have no guarantee of escaping! Even if he were to have the help of Justice, he would only have the confidence to leave with his life but it would be impossible for him to save Ling Jian! Just what should he do?</p><br/><p>Ling Tian’s burrows were furrowed. Ling Jian was the one below! Ling Tian would never allow his brother who grew up with him to die in the Yu Residence! No matter what, he had to save Ling Jian! However, how could he save him Ling Jian in the face of such a frightening lineup?! As long as he made a single mistake, it was very likely that he would leave his own life in the Yu Residence as well!</p><br/><p>Li Xue also frowned as she muttered, “We definitely need a surefire plan if we want to save him now. If we had a 100-foot rope, perhaps we would be able to save him… Haiz, how would be able to find a 100-foot rope in such short notice?”</p><br/><p>100-foot rope? Ling Tian’s eyes lit up and he instantly understood Li Xue’s intentions, “100-foot rope? Not to mention 100-foot, even if you wanted a 200-foot rope, I would be able to produce it.” As he said that, Ling Tian untied his belt.</p><br/><p>Li Xue took it over and upon feeling the cold and soft texture of it, lit up, “Heavenly silk?”</p><br/><p>Ling Tian smiled, “That’s right. Is this enough?”</p><br/><p>“It’s enough. More than enough.” Li Xue quickly dismantled Ling Tian’s belt with her actions so fast that after images could be seen, “One more thing. While the heavenly silk is long enough, it can’t be thrown far. If I were to imbue my inner qi within it, a large commotion would definitely be formed and it may be stopped in mid-flight…”</p><br/><p>Ling Tian rubbed his head and after a short moment of consideration, he took out two identical jade pendants. After checking it for a moment, he handed one of them to Li Xue and said with a crafty smile, “Tie the jade pendant to the heavenly silk, and you can use the jade pendant as a weight to throw it. With your inner strength and the aid of this item, it should no longer be a problem right?”</p><br/><p>Li Xue twiddled with the jade and felt a sense of warmth emanating from the jade. She immediately knew that it was definitely a rare item and couldn’t help but complain, “We can just find a random brick, why is there a need to waste such a precious item?”</p><br/><p>Ling Tian chuckled, “This jade is the proof of my identity and will definitely create an unexpected effect! You are smart enough that you should be able to understand it, right?”</p><br/><p>“Your proof of identity?” Li Xue studied it carefully and came to a realization, “I see.” She then rolled her eyes. “You are truly crafty! To think that you are so scheming even at such a moment! You truly live up to the name of the demon in Heavenly Star!”</p><br/><p>Ling Tian let out a delighted chuckle and just when he was about to say something, he heard a heart-wrenching roar, “Second brother!” This was the moment where Ling Jian dismembered the Vice Head of the Firmament Charging Pavilion!</p><br/><p>Seeing the countless experts surrounding Ling Jian from all directions, Ling Tian didn’t have the time to remind Li Xue anything and he pounced forward towards Ling Jian! With just a single jump, he had already shot out 100 feet and entered the Yu Residence! His speed was truly unimaginable! If Ling Jian was like a demon, Ling Tian would definitely be exceeding a demon!</p><br/><p>Ling Jian’s sword had collided with seven to eight weapons in a short instant and the sparks from the collision lit up the night sky! The various experts were then pushed back by the force of the collision.</p><br/><p>Yu ManLou had already arrived above Ling Jian like an eagle soaring into the sky. Like a lion chasing after a rabbit, his figure shot downwards like a mountain! Before Yu ManLou arrived, the palm winds generated from his palm strike had already made it difficult for Ling Jian to breathe.</p><br/><p>Ling Jian couldn’t help but spit out a mouthful of blood. After clashing with seven to eight experts no weaker than himself, he was already approaching his limit. Facing the pressure from Yu ManLou, Ling Jian was not shocked but delighted. Ling Jian already knew that it was almost impossible for him to escape with his life and had decided to take as many people along with him before he died!</p><br/><p>If he could give this Yu Family Head an unforgettable lesson or drag Yu ManLou with him to the afterlife, it would definitely be a great matter! He would definitely be able to gain more time and aid for his young noble!</p><br/>\n</div>"}