{"title": "Chapter 465 - Eavesdropping", "id": 465, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-465-eavesdropping", "volume_title": "Volume 5", "body": "<h1>Chapter 465 - Eavesdropping</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 465: EavesdroppingTranslator: DavidT Editor: DavidT, Rock</p><br/><p>If that’s the case, wouldn’t it mean that Justice was in grave danger? If he was dead, while it was a good thing, it also meant that it would be impossible for me to survive the encirclement of the Above Heavens experts! Ling Tian truly didn’t know if he hoped for Justice to be dead or alive.</p><br/><p>Besides that, why would they be hiding in the courtyard of the Yu Family’s third young noble? Could it be that the Yu and Xiao Families aren’t enemies? That doesn’t seem possible! This matter was far too bizarre. Was it the third young noble creating trouble on his own or was it Yu ManLou’s orders? If it was Yu ManLou’s orders, what did that mean?</p><br/><p>Ling Tian was startled by his own thoughts and almost couldn’t control his breathing rate. If it was the latter, it would truly spell trouble! If both of these families had a secret agreement, it meant that his previous plan was no more than a complete joke! Furthermore, it would also trap him, Li Xue, Ling Jian and the rest in an extremely dangerous situation!</p><br/><p>Just when he was pondering over the matter, another voice sounded, “… how are the injuries of sixth junior brother and the rest?”</p><br/><p>A sigh could be heard followed by a depressed voice, “They are still the same without any signs of getting better. It can already be considered a great blessing for them to not die on the spot. What a frightening Justice, he is indeed the number one expert in the world! He is truly tyrannical! Even with the combined force of us all, we suffered such huge losses!”</p><br/><p>Meng JueChen then sighed and he asked softly, “Losing is one thing, but the most worrying matter now is how Beyond Heavens will choose to deal with us. Is there any news? Did Beyond Heavens react to this incident?”</p><br/><p>“News came twice and it is in the hands of big brother. However, after big brother saw it, he didn’t say anything else and crushed the piece of paper angrily. It probably isn’t a good thing.”</p><br/><p>“Oh,” Meng JueChen then said with a gloomy tone, “it seems that the sect is extremely dissatisfied with our actions this time. Haiz, if we knew beforehand that Elder Meng RuoXu died in the hands of Justice, how would we have dared to take action? We have always thought that our Above Heavens was capable of ruling over the world and regaining our former glory with the presence of Elder RuoXu. Who would have thought that our pride had died many years back! To think that such a hilarious matter would befall unto us! The sect is truly too f**king fantastic at keeping their secrets!”</p><br/><p>At the very end, Meng JueChen had actually let out a curse word, and it was obvious just how dissatisfied he was with the sect. The others let out a sigh as well and the conversation ended there. Even though there were occasional sighs afterward, none of them said a thing.</p><br/><p>Ling Tian felt his heart itch in anxiousness. As long as they continued the conversation, Ling Tian would be able to hear what he was interested in. However, he never imagined that all of them would stop at such a moment. This drove Ling Tian mad! He had the urge to jump down right now and interrogate them all!</p><br/><p>Can’t you complete your sentence? Don’t you know that it is extremely painful for me to hear only half the conversation?! The only thing Ling Tian knew was the general ending of the battle between Above Heavens and Justice. However, he was unaware of how heavily injured both parties were.</p><br/><p>Ling Tian cursed in his heart but didn’t dare to make a move. Everyone below was a top-notch expert and they would definitely discover him if he were to make a slight mistake. While he wasn’t afraid of these few individuals, he would definitely have to exert all of his strength to escape from them all. Once news of him was spread out, his original intent would definitely be foiled. Besides that, he also found out that these men were not the only ones who went out tonight. There was also the ‘big brother’ who wasn’t back yet. If that was the case, there would definitely be another batch returning or perhaps even more!</p><br/><p>If that was the case, Ling Tian would patiently wait for their return. When he waited on top of the Shaolin monastery in the freezing weather for a full three days and nights in his previous life, his patience had long been tempered. Not to mention the fact that the weather tonight was nice and comfortable!</p><br/><p>If I don’t dig out your origins, this young noble will stay here forever! Ling Tian clenched his teeth and thought to himself.</p><br/><p>The moon was high above in the sky and the bell which signaled 1 am rang. The surroundings were silent, and only the crickets could be heard.</p><br/><p>Ling Tian had been hiding for more than four hours already and his expression was still the same as when he first came, calm and unflustered. A small tree snake fell from the branch and landed on the roof, crawling over Ling Tian as though it didn’t realize that Ling Tian was a living being…</p><br/><p>A light breeze could be heard and two figures arrived at the courtyard warily. In fact, they made a full round around the courtyard before jumping in. However, their wary actions caused Ling Tian’s eyes to light up; what were they so wary about? They were obviously afraid of being found by the Yu Family!</p><br/><p>Ling Tian snickered in his heart. It seems like all of you are not comrades! Dammit, you made me so afraid for nothing!</p><br/><p>“How are sixth brother and the rest?” a low and imposing voice sounded.</p><br/><p>“Big brother is back,” someone else replied. “They are still the same, neither dead nor alive. How frustrating!” He then let out a sigh and said hatefully, “This Justice is too f**king vicious! Isn’t he afraid of ruining his own reputation by using such sinister means? Why does he have to use such a method which makes one unable to live or die?! He is too damn sinister!”</p><br/><p>“Sinister? Vicious?” The imposing voice said with a trace of ridicule, “We are all old birds in the pugilistic world and are extremely clear if his means are considered sinister. Furthermore, more than ten of us ganged up on him, and we even arranged an ambush. Is that not considered vicious? Under such circumstances, everything he does is only to be expected. If we aren’t a match for him, don’t blame him for being vicious! If you don’t have the ability to deal with him, don’t blame him for being sinister!”</p><br/><p>After these words were said, everyone in the room began to cough awkwardly and went silent.</p><br/><p>That imposing voice then snorted, “That little brat Yu LiuShui didn’t say anything in the past few days right?”</p><br/><p>“He has not. However, we can tell that while this brat still seems composed on the surface, he is actually getting anxious. He tried to beat about the bush to ask us when we are taking action,” a voice with a tinge of anxiousness sounded.</p><br/><p>“We can temporarily ignore him. Tell him that the day he takes out Yu ManLou’s treasured Snow Jade Sky Reversal Pellet to treat sixth brother and the rest would be the day we settle his problem. If he doesn’t take the pellet out, we will delay the matter with him. We aren’t the ones afraid of a delay, but he is.” The imposing voice then said slowly, “The longer we stay here, the more nervous he will be. Compared to us, he is definitely more afraid of us revealing our whereabouts. If Yu ManLou finds out that he is hiding the biggest enemy of his family, he would be the first one to die for sure. Thus, as long as we continue dragging the matter, he will definitely be the first to give in! At that time, it will be our chance. After all, there aren’t many medicinal items on the level of the Snow Jade Sky Reversal Pellet.”</p><br/><p>“Big brother, should we request for some reinforcement from the sect?” Meng JueChen asked in a dishearted tone. “While we would be able to deal with Ling Tian with our present strength, it would be impossible for us to kill Justice. Furthermore, the Snow Jade Sky Reversal Pellet may not necessarily be able to save sixth brother and the rest. If…”</p><br/><p>Ling Tian had a trace of excitement as they finally talked about what he was interested to find out. Previously, he only knew that Justice came out of the battle victorious but was unaware of Justice’s condition. Based on Ling Tian’s estimates, under the combined attack of more than ten experts, no matter how powerful Justice was, he definitely wouldn’t be too well off. Thinking about this, Ling Tian couldn’t help but gloat at Justice’s misfortune.</p><br/><p>While Justice’s death would be a good thing, the absence of Justice in the world would make the world a much more boring place. At that time, Ling Tian would definitely be even lonelier. Thus, Ling Tian couldn’t help but heave a sigh of relief as well.</p><br/><p>As he was caught up in his thoughts, he suddenly heard the big brother’s furious roar, “Request for more reinforcements?! To think that you actually have the cheek to say that! Have you not thrown enough face yet? Despite the fifteen of us joining forces and arranging three other experts to launch an ambush, six of us were killed by him with four heavily injured. The rest of us were all injured as well. However, Justice only suffered from some internal injuries and he would definitely have less than five wounds on his body. This is the outcome of him being helpless against our ambush and the result of facing us head-on. If he chose to drag the battle on with us instead, not a single one of us would have been able to return. Facing such strength, what is the use of requesting for more reinforcements? According to my estimates, we would need the sect master, two elders, and thirty-five experts to surround him before we would be able to kill Justice! This is just based on Justice’s estimated strength! Furthermore, Justice isn’t a fool either and would he possibly choose to fight us head on? If he wanted to leave, even the combined effort of our whole sect wouldn’t be able to keep him from leaving! If he chooses to defeat us one by one, I believe all of you will be able to predict the outcome! Let us return back to the sect first and let the sect master make a decision.”</p><br/><p>“Yes.” Meng JueChen agreed in a depressed tone, “Big brother said that we can delay this matter but the auras of sixth brother and the rest and growing weaker and weaker by the minute. After using a large amount of ginseng and herbs, the effect isn’t very obvious anymore. If we are unable to get the Snow Jade Sky Reversal Pellet in three days, I’m afraid…” He didn’t finish his sentence but everyone there understood what he wanted to say.</p><br/>\n</div>"}