{"title": "Chapter 471 - Mystifying", "id": 471, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-471-mystifying", "volume_title": "Volume 5", "body": "<h1>Chapter 471 - Mystifying</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 471: MystifyingTranslator: DavidT Editor: Rock, DavidT</p><br/><p>Ling Tian responded with an ‘oh’ and as though he thought about something, he dug into his embrace and took out a small jade bottle. After pouring out a bit of powder from the bottle, he scattered it onto Xiao YanXue’s bright hair and blew a few breaths onto her hair. Xiao YanXue could then feel a slight burning sensation on her scalp.</p><br/><p>The next moment, her hair began to dry up and turn yellow, and lost its former glow…</p><br/><p>Xiao YanXue allowed Ling Tian to do as he please as sweetness filled her heart. She then thought about two lines of poetry: A dolled up lady would ask her husband meekly; is my makeup considered fashionable? Thinking about that, her face could not help but burn up from embarrassment. However, this poor lass didn’t know that Ling Tian had dolled her up to the point where every lady would feel proud of themselves upon seeing her and every man would raise up their defenses upon seeing her…</p><br/><p>Finally, Ling Tian clapped his hands and said with a bright smile, “Mission accomplished!” He then stuffed a pill which he had prepared beforehand into Xiao YanXue’s mouth.</p><br/><p>The moment Ling Tian got up, Xiao YanXue could not help but spring up excitedly as she rushed in front of the mirror to see just how gorgeous she was now after her beloved had dolled her up.</p><br/><p>“AHHHH!~” A miserable shriek broke the silence of the night. Xiao YanXue looked at the lady in the mirror who could not be any uglier. That yellow and dirty hair, triangular eyes, puffy and yet extremely tan face had squeezed her nose to the point it almost disappeared… Her lips were dry to the point they were about to peel… looking down, her originally snow-white skin was already a miserable shade of black!</p><br/><p>As Xiao YanXue shrieked and slapped her palms on the desk, she realized that her hands were also extremely tan and looked as though they were dried up chicken claws…</p><br/><p>Xiao YanXue let out a mellow groan and collapsed onto the ground weakly.</p><br/><p>Behind her, Ling Tian’s voice could be heard, “What do you think? The effects are ideal, right? I have already told you that my face concealment techniques are…”</p><br/><p>Before he could finish his sentence, Xiao YanXue had already pounced onto him like a mad tigress as she growled with an enraged voice, “Ling Tian, I will kill you! I am going to kill you!!! Ahhhhhh!”</p><br/><p>In this instant, the amount of killing intent given out by Xiao YanXue was no less than Ling Jian! No, Ling Jian couldn’t even hold a candle to this! Even Ling Tian at his peak wouldn’t be able to give out such killing intent!</p><br/><p>Ling Tian was still feeling delighted with his piece of work and felt a sense of satisfaction in his heart. Who would be able to turn a heaven-defying beauty into such an ugly duckling that no one would be able to recognize? Who would be able to have such a mystical and perfect face concealment method? Who? Hahaha, only me, Ling Tian! Even Li Xue would be far from being a match!</p><br/><p>Ling Tian was waiting for Xiao YanXue’s astonishment and her look of reverence or even thanks. With Xiao YanXue’s current appearance, even if Ling Tian wasn’t by her side and the city was a thousand times more chaotic, Xiao YanXue would still be extremely safe even if any patrol guard sees her. There would definitely not be anyone interested in her at all. Or perhaps it would be more accurate to say that there wouldn’t be anyone with the courage to take a second glance at her! Just this appearance of hers would grant her a sacred protective shield!</p><br/><p>However, Ling Tian forgot about something and his carelessness caused him to suffer from Xiao YanXue’s flames of rage!</p><br/><p>Ling Tian was too careless as he didn’t consider the importance a lady placed on her appearance. Especially a country toppling beauty like Xiao YanXue. The gigantic shock of turning from a beauty to ugly duckling is something which no woman would be able to accept!</p><br/><p>As such, just when Ling Tian was waiting for Xiao YanXue’s praise and admiration with a face full of delight, Xiao YanXue unleashed her flames of rage on him.</p><br/><p>Punches, kicks, knees, elbows, claws, bites, hammers… countless different attacks that Xiao YanXue had never learned before were spontaneously created and unleashed at this moment. If Justice were by the side, he would definitely exclaim about how this lady, who had never witnessed these attacks before, was able to connect every single attack flawlessly and unleash them like a flowing river. He would definitely exclaim about how creative Xiao YanXue was and be dumbfounded at how there could actually be such a martial arts talent capable of shattering the heavens. At this instant, Xiao YanXue had undeniably exceeded Ling Tian who had trained from is mother’s womb!</p><br/><p>Ling Tian felt as though he was being attacked by a thousand experts at the same time! Xiao YanXue’s speed and frightening attacks could be easily imagined! At the same time, Ling Tian’s look of shock did not have the time to fade away…</p><br/><p>Just when Ling Tian was feeling grieved and puzzled about Xiao YanXue’s unreasonable actions, Xiao YanXue suddenly stopped all her actions and bit down hard on Ling Tian’s shoulder.</p><br/><p>“Ouchhhhhhhhhh!!!” Ling Tian let out a miserable shriek and felt a tinge of fear towards this crazy and unreasonable lady. This was the first time Ling Tian felt fear towards someone in both of his lives…</p><br/><p>The last strategy of the 36 stratagems: make a tactical retreat. Ling Tian fled like a stray dog in complete defeat…</p><br/><p>This was the first time Ling Tian was reduced to such a pathetic state! He wasn’t even reduced to such a state in the face of Justice. Ling Tian felt that his legendary reputation had been completely destroyed at this moment!</p><br/><p>She was still shy and tender a moment ago… the next moment…</p><br/><p>Crazy lady! Ling Tian rubbed his shoulder and wanted to cry!</p><br/><p>In the room, Xiao YanXue rubbed the dark makeup on her arms but no matter how much strength she used, that disgusting color would not come off. Even the use of water was completely useless. It was as though it was her natural skin tone and after failing multiple attempts of removing the makeup, Xiao YanXue began bawling her eyes out.</p><br/><p>In actuality, this wasn’t anything surprising either. These colored makeup were the peak accomplishment from his previous life, so how could it be washed away by water so easily?! Xiao YanXue didn’t know that if there were a concealment expert here who witnessed these concealment tools, he would definitely be completely dumbfounded. Ling Tian’s methods and tools were too perfect. It was perfect to that point it was frightening! He was actually able to destroy the looks of a country toppling beauty without any trace of her former beauty being left behind. This was the very peak of face concealment techniques!</p><br/><p>Xiao YanXue naturally didn’t know about this and she was only afraid that the disgusting things which Ling Tian had applied to her would stick to her forever. If that was the case, she would rather die!</p><br/><p>To a beautiful lady like Xiao YanXue, she was afraid of being killed, afraid of being raped, but her true fear was the fear of losing her beauty! This was the biggest fear of any lady!</p><br/><p>As she cried, she realized that her throat was also extremely hoarse, as though sand had filled up her throat. Her sweet voice was no longer there and her current voice was extremely dry. She sounded no different from a hundred-year-old lady who lost all of her teeth… She then suddenly thought about the pill that Ling Tian stuffed into her mouth in the end…</p><br/><p>“That darn Ling Tian! That darn pig head! Dammit dammit dammit dammit!!!” Xiao YanXue began cursing like an old witch and a ferocious bestial glare could be seen in her eyes. If Ling Tian had not run away at this moment, he would have probably been scared out of his wits…</p><br/><p>A woman would definitely fight with her life for her appearance!</p><br/><p>While Ling Tian had already unleashed his movement techniques to escape, he still felt a chill by his back. He could not help but sneeze continuously and after a few sneezes, the dogs surrounding him began to bark and attract the Yu Family’s patrols.</p><br/><p>At the same time, a bright firework shot up into the air and exploded into a big flower.</p><br/><p>Ling Tian stuck out his tongue and thought, Women! I must definitely remember not to provoke them in future. Because Ling Tian received a report that third young noble Yu would definitely take action tonight to investigate his second brother’s courtyard, Ling Tian had no choice but to disguise Xiao YanXue up to ensure her safety if she was found. With Xiao YanXue’s current appearance, even a starving man would probably lose all of his appetite and think about self-defense!</p><br/><p>Was I wrong? Ling Tian thought to himself in indignance. Where was I wrong? If I were to doll you up like an angel… no, I don’t even need to doll you up as an angel. Even if you were average looking, your stunning figure would definitely attract the attention of the guards. At that time, those lechers would definitely find a problem even if there is no problem at all! You have really taken my goodwill for granted! You really do not know how to recognize my goodwill! Just see how this young noble will settle this score with you in future!</p><br/><p>However, settling the score is in the future. The problem now was the numerous experts chasing behind Ling Tian at this moment. Ling Tian could not help but be depressed. I only came out a little bit early and have not begun to attract all of you yet. Why are you guys following me for? Didn’t I only sneeze a few times? Is there a need to make such a huge fuss?</p><br/><p>All of a sudden, a thought flashed past Ling Tian’s mind. Didn’t I come out to do something? Didn’t I want to coordinate with Yu LiuFeng’s actions? While he definitely wouldn’t thank me. While it is a little bit early now, if I can create some trouble now and attract the bulk of the troops in the city, there would be another benefit that comes along with it. Those fellows from Above Heavens would probably end up canceling their mission right? If that’s the case, I will be able to truly give them a lightning strike and earthly fire. Hehe…</p><br/><p>Ling Tian let out a cunning chuckle and took out a black cloth from his embrace to cover his face. Then, a thought came into Ling Tian’s mind, If that’s the case, perhaps the effect would be better?</p><br/><p>Right when he was proceeding forward at full speed, Ling Tian suddenly stopped atop a roof. He then stood with one leg forward, another leg back and placed his hands behind his back as he looked up towards the moon with an extremely ‘cool’ and carefree posture. Then, Ling Tian bent forward slightly and a tyrannical aura exploded from his figure and all the barking sounds in the surrounding disappeared completely as though a knife had sliced through the throats of the dogs!</p><br/><p>Feeling the pressure emanating from Ling Tian, the experts chasing after him could not help but stop far away and form a large circle around him. At the same time, their eyes were filled with shock.</p><br/><p>This person was actually able to stop indifferently despite being pursued by numerous experts. Was this something that an ordinary person would do? Furthermore, they were in Bright Jade City which was the territory of the Yu Family! Could it be that this person disdained the strength of the Yu Family?</p><br/><p>“The moon is the same, but everything in the world has changed! This old man has not appeared in the pugilistic world for decades, but I never imagined that a few little brats would dare to follow me! You guys are really seeking death!” Ling Tian was extremely satisfied with the effect he had just created as he snorted with an old voice, “Who dares to follow this old man in the night?! Do you guys really think that I wouldn’t dare to kill? Could it be that the Yu Family of Bright Jade City has fallen to such a pathetic state?”</p><br/><p>As these words were said, everyone could not help but be dumbfounded, F**k, just who is this fellow? How can he talk so big? What an old and decrepit fellow! The Yu Family is like the bright sun in the sky right now and this fellow actually called it pathetic?! Everyone could not help but swallow down the curses that were about to explode forth from their mouths as they felt that the man standing in front of them might be a true otherworldly expert.</p><br/><p>“Sir, who are you?” The white-robed man in the lead looked at Ling Tian with a solemn expression and his tone no longer had the usual arrogance of a Yu Family disciple. Instead, it was extremely careful and filled with respect with even a tinge of fear. Upon coming into contact with Ling Tian’s eyes, the white-robed man could feel a powerful wave of killing intent that made all of his hair stand up on edge! The white-robed man could not help but be in shock, My goodness, how many people must he have killed in order to develop such a killing intent? This person must definitely be a respectable elder. Although the Yu Family seems to be prospering on the surface, we are currently plagued with troubles and it would be best to not provoke an additional enemy.</p><br/><p>“Sir?” Ling Tian sneered and bent forward slightly as though he did not place the white-robed man in his eyes. He then said with a tyrannical and unreasonable tone, “Do you think ‘Sir’ is something that you can call me? Only Yu TianShan in your Yu Family has the right to call me that!” He then snorted, “Why did you guys follow me for nothing? Spill the beans!”</p><br/><p>Yu TianShan!</p><br/><p>The seven to eight Yu Family White Jade experts took in a breath of cold air. Yu TianShan was the grandfather of Yu ManLou, and also the Family Head from two generations ago. He was a stunning figure in the Yu Family but has already passed away more than twenty years ago. Could it be that this old man belonged to the same generation as their ancestor?</p><br/><p>They had truly kicked an iron plate!</p><br/><p>The Yu Family experts looked at each other with a bitter expression. Just what should they do?</p><br/><p>The White Jade expert in the lead said in a respectful tone, “May old senior calm down, all of us juniors are only carrying out our responsibilities. Enemies have infiltrated into the city recently, and we are under orders to apprehend the culprit.” At the same time, he thought to himself, So it turns out that he was a friend of our old Family Head.</p><br/><p>Ling Tian let out an unhurried ‘oh’ before continuing, “I see. I was wondering; the Yu Family has a thousand years of tradition and should definitely have a good upbringing and discipline. Why would they go around biting others like a bunch of rabid dogs? It turns out that it was a misunderstanding.”</p><br/><p>Everyone didn’t know whether to laugh or cry as they heard that. As they heard the first half of Ling Tian’s words, they felt extremely comfortable. However, However, they never expected the next sentence of his to turn in the opposite direction. The White Jade expert in the lead immediately responded upon hearing the first half of Ling Tian’s sentence, “Old senior is wise.” At this moment, it was far too late for him to take his words back, and he felt a wave of depression in his heart. The other party called him a ‘rabid dog’ and he had actually praised the other party for being wise.</p><br/><p>F**k! This old fellow is too cunning!</p><br/><p>Hearing the tone of the old senior ease up slightly, the White Jade expert in the lead asked, “May I ask for old senior’s name? May old senior allow us juniors to appreciate senior’s greatness.”</p><br/><p>Ling Tian cast a glance at him and snickered, “A little brat like you wants to know this old man’s name?”</p><br/><p>The White Jade expert quickly made a bow and said with an apologetic smile, “It is our responsibility and I plead for old senior to be understanding. Old senior is magnanimous and will definitely not lower yourself to our level.”</p><br/><p>Ling Tian then muttered, “This little brat’s words sound pretty good. Alright then, this old man will not make things difficult for all of you. If that old fellow Yu TianShan asks, you can just report this old man’s name.”</p><br/><p>That expert in the lead quickly responded with a bright smile and nods but cursed in his heart, How do you expect me to report anything if you haven’t said your name yet? Besides that, the old Family Head has already passed away for almost twenty years. If you want me to report your name to him, aren’t you cursing me to die an early death?</p><br/><p>“It has been almost forty years since I last used this name of mine. Time truly flies.” Ling Tian lamented, and the other White Jade experts could not help but straighten their backs in respect! An old senior indeed, to think that he had not appeared in the pugilistic world for forty years.</p><br/><p>After which, Ling Tian faced the sky and said with a reminiscing tone, “Back then, the experts in the pugilistic world were engaged in a brutal battle under the lead of Yu TianShan and Shui QingYun. This old man was unable to put up with it and decided to interfere. At that time, they gave me the nickname of…”</p><br/><p>Ling Tian then paused as he continued to stare at the moon. In the eyes of the White Jade experts, the old senior was obviously reminiscing about old times, and they would naturally not dare to interrupt him. Yu TianShan and Shui QingYun engaged in brutal battle? Interfering with the matter because he couldn’t put up with it?! Everyone could not help but be filled with reverence as they stayed silent in fear. However, they never imagined that this ‘old senior’ in front of them was still thinking of what his name should be.</p><br/><p>Ling Tian pondered for a while before finally thinking of a name, “Back then, that ‘immortal-like, deity-like, devil-like, unprecedented expert who grasped the three islands, five mountains and everything in all directions’ was this old man! ” 1 A majestic aura then shot out from Ling Tian’s eyes, “Remember this old man’s name. This old man is surnamed Qin and I am called Qin ShiHuang!” This sentence of his was earth-shattering and full of majesty . 2</p><br/><p>In truth, Ling Tian truly respected Emperor Qin who swept through the whole of China and united the nation under a single dynasty. As he proclaimed his ‘name’ an excerpt from a song came to his mind: ‘Who was the one who flattened the six nations? Who was the one who ruled the world? Who’s battle contributions were higher than mine?</p><br/><p>Everyone was completely bewildered! Was there ever such a character in the pugilistic world? The long nickname of this old senior in front of them had truly stunned them all silly.</p><br/><p>“Err… so it is old senior Qin.” That White Jade expert said with a doubtful look, “Can I ask old senior Qin if you are here in Bright Jade City to see our Old Family Head?”</p><br/><p>“If this old man isn’t here to visit Yu TianShan, could it be that I am here to visit you juniors?” Ling Tian rolled his eyes, “In this city, could there be anyone else worth me making a trip apart from Yu TianShan? After being alive for a hundred years, one should have a few friends at the very least. But even after being alive for a hundred years, death is still inevitable. This old man wants to visit my old friends before I pass on!”</p><br/><p>That White Jade expert was stunned for a moment and rolled his eyes immediately as he thought, If you are here to find your old friend, you would have to die first. Just when he wanted to say something, a few swooshing sounds could be heard and another three figures shot over like a shooting star. After being unable to catch anyone of importance despite a full day and night of searching, the Yu Family’s experts were all extremely agitated. Seeing the fireworks in the sky, all of them fought for the opportunity to charge over.</p><br/><p>The person in the lead was a white-bearded old man with a sinister aura and eagle-like eyes. His gaze swept past everyone present coldly and asked calmly, “Is it this fellow? Why haven’t you apprehended him?” He then pointed his chin towards Ling Tian in an arrogant manner. However, he immediately felt the oppressive aura being given out by Ling Tian the next moment and could not help but grow wary.</p><br/><p>Ling Tian let out a dissatisfied snort and the White Jade expert by the side quickly explained, “Head Deacon, this is… old senior Qin.”</p><br/><p>“Old senior Qin?” the Head Deacon asked in a depressed tone, “What old senior Qin?”</p><br/><p>Ling Tian’s black robes fluttered in the winds and an imposing aura emanated from his figure. The moment the White Jade expert called out ‘Head Deacon’, Ling Tian could not help but be depressed. Why did I attract him here? I am only trying to attract some attention to facilitate Yu LiuFeng’s actions and to make preparations for the dog-eat-dog show later. Didn’t the intelligence report say that the leader of Yu LiuFeng’s forces was this Head Deacon? Why is this old man still outside at this time? Furthermore, he was actually attracted by me!</p><br/><p>If this old man were to stay behind because of him, wouldn’t his plan be foiled?</p><br/><p>The White Jade Expert said respectfully, “This is old senior Qin, Qin ShiHuang, from forty years ago who was the ‘immortal-like, deity-like, devil-like, unprecedented expert who grasped the three islands, five mountains and everything in all directions’.” After finishing his sentence, he took in a deep breath of air. It was truly a challenge for him to say so many words together at once.</p><br/>\n</div>"}