{"title": "Chapter 483 - Family Head Takes a Concubine", "id": 483, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-483-family-head-takes-a-concubine", "volume_title": "Volume 5", "body": "<h1>Chapter 483 - Family Head Takes a Concubine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 483: Family Head Takes a ConcubineTranslator: DavidT Editor: Rock, DavidT</p><br/><p>Both the Yu brothers ran out of the room pathetically and right before they stepped out of the door, they looked at each other with disgust and bone-deep hatred! An irreconcilable hatred!</p><br/><p>Who was Yu ManLou? He naturally saw all of this and was angered to the point he began to tremble. He swept a white glass onto the ground and smashed it into pieces. However, his anger was not quenched fully, and right when he wanted to find something else to smash, he realized that he had lost control of his emotions. He quickly circulated his inner qi to suppress his emotions, and blood rushed to his head to the point his whole face flushed red.</p><br/><p>Ling Tian’s words were akin to a venomous seed which had taken root in his heart. As time went by, it also began to sprout just as Ling Tian had planned…</p><br/><p>This move of Ling Tian was sinister indeed and capable of killing someone without making a move. However, even if Yu ManLou was aware of that, he had no choice but to fall into the trap! Thus, Yu ManLou was both frustrated and heartbroken with his emotions in a complete mess.</p><br/><p>“Head Deacon.” Yu ManLou growled in a low voice.</p><br/><p>“This subordinate is here.” The Head Deacon took a step forward with unease. At the same time, his heart was pounding as though there were a hundred deer galloping in his heart. He naturally knew what he did between both the young nobles, and he could also guess the reason why Yu ManLou was calling for him. Thus, he was immediately flustered.</p><br/><p>In the Yu Family, Yu ChaoRan was considered the most senior person and he could even be considered to be Yu ManLou’s uncle. Furthermore, Yu ChaoChen was also his biological brother and it wouldn’t be an exaggeration to say that he held a high status in the Yu Family. But in front of this merciless Family Head, he would never dare to display his displeasure. After witnessing more than ten years of their Yu Family’s bloody history, Yu ChaoChen was extremely clear just how heartless this seemingly magnanimous Family Head of theirs truly was. Ever since Yu ManLou took over the Yu Family, he had never shown mercy in killing those who needed to be killed.</p><br/><p>Thus, Yu ChaoChen would never dare to display the slightest bit of disrespect in front of his Family Head. At the same time, he would never dare to flaunt his seniority and consider himself as Yu ManLou’s uncle. He knew that his Family Head didn’t like that!</p><br/><p>Yu ManLou’s piercing glare was fixed coldly on Yu ChaoRan and he did not say a single word for a long time. However, Yu ChaoRan was already covered with a cold sweat at this moment. His glistening sweat rolled down slowly off his cheeks, and in just a short moment a puddle of sweat could be seen forming under Yu ChaoRan’s feet.</p><br/><p>“Head Deacon seems to be very busy recently.” Yu ManLou finally opened his mouth and said with a tinge of frustration, “You are already getting old and shouldn’t tire yourself out!”</p><br/><p>The Head Deacon trembled before replying hoarsely, “Yes. Thank you Family Head for your concern. This subordinate will remember Family Head’s words.”</p><br/><p>Yu ManLou continued to glare at him for a moment before retracting his gaze. Let everything come to an end here. Since I don’t plan to punish both of my sons, why should I make things difficult for their assistant? In Yu ManLou’s heart, Yu ChaoRan was far more important than both his sons at this moment. For no other reason but because Yu ChaoRan was still of use to him right now.</p><br/><p>Feeling his Family Head’s gaze shift away from him, Yu ChaoRan let out a sigh of relief. As his senses eased up, he suddenly felt a chilly feeling and was shocked to realize that his clothes were already drenched from his sweat.</p><br/><p>Yu ManLou let out a long breath and in the ears of Yu ChaoRan, it sounded like a long sigh. He could not help but feel his heart tighten up again only to hear Yu ManLou’s calm voice, “I heard that the previous prime minister of Northern Wei has a daughter in his residence?”</p><br/><p>Yu ChaoRan was completely oblivious as to why his Family Head would ask such a question and could only reply carefully, “Yes, this subordinate has also heard of her before. It is said that she is sixteen this year and has the title of number one beauty in Bright Jade City. However, this old man has never seen her before. For Family Head to ask about her, does Family Head intend to propose a marriage for the two young nobles?”</p><br/><p>A rare look of embarrassment flashed past Yu ManLou’s face before he remarked in a cold voice, “How can those two little beasts be worthy of her? Mmm, if that’s the case, choose an auspicious date and fetch her in directly.” Yu ManLou said that both his sons were not worthy of her but still insisted on fetching her into the Yu Residence. If that’s the case, wasn’t it extremely obvious who the groom would be?</p><br/><p>Yu ChaoRan’s face cramped up as though he was trying to hold something back and said respectfully, “Yes.” He then pondered for a moment, “The eighth of this month is an auspicious date suitable for getting married. Hmm, would it be too rushed?”</p><br/><p>Yu ManLou responded with an ‘oh’ before asking, “Is it very rushed?”</p><br/><p>Yu ChaoRan felt his heart skip a beat as he chuckled, “Not rushed, not rushed at all and there is definitely sufficient time.” At the same time, he grumbled in his heart, It is already the third of the month and even the marriage of an ordinary peasant would require at least three months of preparations. right? Since the other party is the daughter of the ex-prime minister, we should at least go through the proper rites, right? Even if we want to speed things up, it would still take half a year at the very least! However, it seems as though his Family Head cannot wait any longer already! Just what was going on with the Family Head?!</p><br/><p>Yu ManLou turned around and noticing the queer expression on Yu ChaoRan’s face, he asked, “What are you laughing at? Is this matter very funny?”</p><br/><p>“Ah… this… this subordinate doesn’t dare.” Yu ChaoRan was frightened to the point he began sweating again, “This subordinate will go and arrange matters immediately.” He then escaped hurriedly.</p><br/><p>In the mouth of Yu ManLou, the daughter of a prime minister was no different from the daughter of an ordinary farmer. As long as he said that he wanted to marry her, she must enter his Yu Family. Furthermore, everyone was certain that even if he were to say ‘immediately’ instead of in a few days, this matter would be accomplished without any effort. Even if effort was required, the ones putting in the effort would definitely be others. After all, Yu ManLou was someone who was only concerned with the outcome and not the process.</p><br/><p>In the Northern Wei territory, the Family Head of the Yu Family enjoyed a status that was a hundred times greater than any imperial family member! So what if she is the prime minister’s daughter? Furthermore, he was only a former prime minister!</p><br/><p>Seeing the Head Deacon leave as though he was escaping, Yu ManLou’s eyes seemed to have been lit up with two ghostly flames.</p><br/><p>Yu Family Head is going to take a concubine!</p><br/><p>While this piece of news was intentionally being concealed, it still spread throughout the city like the wind. In just a single night, the whole Bright Jade City was aware of this matter. Naturally, it would also enter Ling Tian ears.</p><br/><p>Hearing this, Ling Tian’s first reaction was to spit the mouthful of tea he had just drank onto Xiao YanXue’s face. He angered her to the point steam could be seen emitting from her head and she wanted to pounce onto Ling Tian to give him a good beating again.</p><br/><p>After Xiao YanXue knew that there wasn’t going to be any more danger, she immediately pestered Ling Tian to remove her disguise. The moment her disguise was removed, she rushed straight into her room to put on a fresh set of makeup, leaving only after she confirmed that her beautiful appearance was regained. Just when she walked in front of her beloved man with the intention to flaunt her beauty, she was greeted with a mouthful of tea…</p><br/><p>Ling Tian did not know whether to laugh or cry. He never imagined that beneath that old man’s dignified appearances, he was actually such a hasty individual. However, Ling Tian also respected the fact that Yu ManLou could actually accept the advice of an enemy.</p><br/><p>Of the millions of people in the world, how many would be able to accept another’s advice so easily? Furthermore, such characters were even rarer when only considering martial arts experts. Especially a peerless expert like Yu ManLou who was even the overlord of a territory. In his previous life and this, Ling Tian was certain that only Yu ManLou would be able to accept the ‘disgusting’ advice of his enemy.</p><br/><p>If Ling Tian were to be completely honest with himself, he knew that it was impossible for him to accept his enemy’s advice after being ‘humiliated’ by his enemy.</p><br/><p>Yu ManLou, a truly extraordinary individual and worthy to be my greatest opponent.</p><br/><p>Xiao YanXue flusteredly cleaned herself up and upon seeing Ling Tian holding in his laughter so badly, she thought that Ling Tian was mocking her. Thus, she took a step forward and grabbed him at his collar, “Are you crazy?! What are you laughing for? Shut up! You’re not allowed to laugh at me! Be serious!”</p><br/><p>She then realized that Ling Tian’s expression really changed after her words. He became strict, respectable and full of wariness… such an expression made Xiao YanXue truly flustered. She didn’t know what could have happened to make her beloved man, who was the proud ruler of a territory at such a young age, have such an expression! Could it be that my words were truly that effective?!</p><br/><p>“What’s going on?” Xiao YanXue let go of Ling Tian and asked softly.</p><br/><p>“Yu ManLou is taking in a concubine.” Ling Tian waved a slip of paper in his hand and said with an odd expression.</p><br/><p>“Ah?!” Xiao YanXue was startled and she began to stutter, “Yu… Man… ManLou… is going to… take in a… a concubine? He… he… he is probably past his fertile age right?”</p><br/><p>“Not yet, it seems that he is only forty-nine!” Ling Tian said.</p><br/><p>“Not yet fifty? Forty-nine… my goodness, is that any different from being fifty? I wonder who was the unlucky fellow who gave him such an idea? An old man like him is going to ruin a young lady!” Xiao YanXue was furious!</p><br/><p>Ling Tian responded with an awkward expression, “I think that I am that unlucky fellow who caused this incident. Yu ManLou was probably urged on by me to take a concubine…”</p><br/>\n</div>"}