{"title": "Chapter 488 - Love Without Prospects", "id": 488, "volume": 5, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-488-love-without-prospects", "volume_title": "Volume 5", "body": "<h1>Chapter 488 - Love Without Prospects</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 488: Love Without ProspectsTranslator: chuchutrain Editor: Rock, DavidT</p><br/><p>“I came here to see our great talented lady, to see what sort of poetry she’s composing right now.” As Ling Chen smiled, she teased, “I did not expect to see our little talent here deep in grief, sighing nonstop as though she had just lost her love. This really made me stop in shock. Come, tell sister, what sort of great work have you come out with?!”</p><br/><p>Ling Chen clearly knew that Shui QianRou was not doing any sort of composition, but still chose to deliberately tease her. This was to soothe her worries, and this point was duly noted by Shui QianRou, filling her with gratitude!</p><br/><p>“You’re the beautiful lady with worries!” 1 Shui QianRou rolled her eyes at her, after which she could not help but sigh. “I won’t hide this from sister. They’re almost here, at most in another three days.”</p><br/><p>“I guessed as much.” Ling Chen immediately kept her smile, not bothering to tease her anymore. “Are you worried for your brother’s safety?”</p><br/><p>“It isn’t so bad to the point that his well-being is threatened, but with this huge loss that brother has suffered, the family has already stripped him of his right for first-in-line successor of the family. I do not know what punishments await him, and furthermore, those three have always looked unfavorably at my brother. Humiliation will definitely be on the list!” Shui QianRou worriedly replied.</p><br/><p>“Oh.” Ling Chen’s eyes flashed as she consoled, “No matter what, your brother is still the son of the current family head, so who would dare to do anything to him? The humiliation in a way could serve as a driving force. Sister shouldn’t be too worried about it. You have to take care of yourself, only then can you remain as the greatest support for your brother.”</p><br/><p>Shui QianRou’s expression grew cold as she forced out, “It might just be a small humiliation, but in the eyes of those three, elder brother isn’t a person of respect even though he is the son of the Family Head. Instead, they treat him as a thorn in the eye. Elder brother’s failure this time, they will definitely not let go of this heaven-sent opportunity for them! They would definitely go to all lengths to humiliate him, and with brother’s pride, how could he bear it?!” As she spoke, her brows furrowed, and she continued with a hint of suspicion, “Furthermore, this matter of elder brother getting into trouble is rather fishy. If Yu ManLou really possessed the strength to topple my Shui Family, then why did he wait til now in order to take action? I keep feeling as though there is something behind the scenes, but I just cannot fit the puzzle pieces together!”</p><br/><p>Ling Chen gently smiled, “Even if there’s more than it meets the eye, there’s no need for you to torture yourself like this, right? In addition, even if your three cousins come over, this place still belongs to the Ling Family, and they definitely have to give this elder sister some face. As such, protecting your elder brother shouldn’t be too big a problem.” She easily and deftly maneuvered Shui QianRou away from her suspicions, to the point that it was seamless. Even Ling Tian would blush in shame before her act!</p><br/><p>Ever since Shui QianRou received the letter from her family, she had been pondering over this problem. While she was sworn sisters with Ling Chen, she had some measure of being able to ask for her help, but Shui QianHuan had constantly pestered Ling Chen during his time here such that he already aroused the ire of Ling Chen. For the latter not to kick him while he was down would already be a good thing, let alone giving him help. However, seeing Ling Chen voluntarily extend her help to aid her elder brother, Shui QianRou was overjoyed. She immediately jumped up and grabbed onto Ling Chen hands, mumbling in gratitude, “Then I’ll have to really thank big sis. Ai, so long as I can temporarily secure my brother’s well-being until he reaches Heavenly Wind Continent, then that would be enough. Little sister here has always been embarrassed of my brother purposely making things difficult for you and so did not know how to open my mouth to ask… Don’t worry big sis, this little sister here knows how to repay her saviors, there will come a day where we will repay you for your gratitude.”</p><br/><p>But Ling Chen only laughed it off, “We’re sisters, and we value matters of the heart. Less of this talk about repayment, it will only hurt our relationship! However, there’s something that I have to tell you beforehand. If little sister cannot achieve it, then we can forget about anything else.”</p><br/><p>Shui QianRou said, “Big sis, just say the word. If I can do it, I will definitely not shy away from it.”</p><br/><p>A chilly look appeared in Ling Chen’s eyes at this moment as she quietly said, “Little sister has also mentioned it. This life and body of mine have long been a possession of my young noble, and as for your brother… heh, you should know that young noble cannot tolerate such matters the most. If the same problem persists in the future, then your elder brother would rather wish that he fell into the hands of his three competitors. We’re sisters, so I’ll just say this up front, if this continues, then big sister can only apologize to you.”</p><br/><p>Shui QianRou’s face changed, but before she could say a word, Ling Chen continued, “Big sister is also a woman, so I care the most about how the young noble looks at me. Little sister, you have to bear this in mind.”</p><br/><p>Shui QianRou sighed to herself. How could she not see the love her brother Shui QianHuan had towards Ling Chen? However, with the single sentence that Ling Chen spoke she knew that her brother did not even stand a chance at all and could not help but feel a little bitter inside her heart. With his life in the dumps, his future bleak and dark, and now having no hope for the love of his life, could her brother really handle all these multiple setbacks at once?</p><br/><p>She originally thought of waiting for Shui QianHuan to return before going over to persuade Ling Chen. Even if it was a hypocritical show of affection to console him, it would still allow her elder brother to feel a lot better! However, now that Ling Chen had already stated such a term, if her brother continued to foolishly anger this powerful assistant, incurring her wrath, then her brother would merely be sending himself to his own grave!</p><br/><p>A clamor sounded from afar, followed by the footsteps of someone hastily running over. Moments later, the voice of Shui QianRou’s serving girl, Die’er, could be heard saying, “Missy, good news, young noble… he is already back.” While the content of her phrase sounded like good news, the worry and fright in her tone could not be masked, as though she had seen something frightening.</p><br/><p>Shui QianRou’s heart was filled with joy upon hearing that her beloved elder brother was back, and she immediately rushed to the front door. However, what greeted her left her in shock. In the courtyard were two human-shaped figures completely covered in blood, as though on their last breaths, having difficulty even standing. One of them was her elder brother, Shui QianHuan.</p><br/><p>“How did brother get such grievous wounds?” Shui QianRou immediately commanded people to carry her brother into her room, before asking the maids to fetch some hot water as well as prepare some medicine.</p><br/><p>“In Northern Wei, our tracks were spotted, and we were besieged by the Yu Family, who pursued us for a thousand miles…” The only person who was fortunate enough to still escape with his life intact, Shui Seven, recounted the incident as his body trembled in fear. While he managed to escape, his injuries were not light, with serious internal injuries plaguing him as well.</p><br/><p>Ling Chen only stood coldly in the room as she observed the wretched states of the two. Her brows were slightly furrowed, but she did not say a word, turning around instead to walk out.</p><br/><p>She had already walked to the doorstep when Shui QianHuan’s voice was heard calling out, “Miss… Miss Ling… you’re here… why are you in such a hurry to leave… have you been well?”</p><br/><p>Ling Chen slightly turned around. Behind her, Shui QianHuan had ignored his own body to struggle up on the bed, his eyes blazing as he stared at Ling Chen, as though a drunken man seeing wine. With the exertion his wounds opened up once again, causing thin streams of blood to leak out.</p><br/><p>Ling Chen however replied in an indifferent tone, “Many thanks to Young Master Shui for the concern. I’m quite well, Young Master be at ease and treat your injuries.” The moment she finished speaking, she turned and left, not even sparing him another glance.</p><br/><p>Shui QianHuan only let out a sad sigh, before crashing back onto the bed with a ‘peng’. In that instant, he felt as though his heart had shattered, every hope of his turning into dust.</p><br/><p>Calling him ‘Young Master Shui’ was as good as sending Shui QianHuan from Heaven to Hell. This one sentence allowed him to understand his current circumstances. Back then, he was full of mettle, disdaining all with contempt, but now, what right did he have to beg such a fairy-like lady for her love?</p><br/><p>Shui QianRou looked at her elder brother with pity, suddenly feeling powerless. At this point, she acutely felt that it was the wrong choice for the both of them to have come to the Heavenly Star Continent!</p><br/><p>While it was true that Shui QianHuan had walked into a dead end in his love life, probably unable to extricate himself in this life, what about herself? Wasn’t she the exact same situation? That person… since when had he ever placed her within his eyes? Both brother and sister could be said to be suffering the same fate, right?</p><br/><p>Shui QianRou let out a self-deprecating smile, but upon thinking of how Ling Tian had tenderly kept the jade she passed him into his bosom, she could not help but blush as she secretly thought, I’ve already passed you my pledge of love, so how could I get married to someone else? However, this annoying guy is just so insensitive, despite me liking you so much, where have you placed me in your heart? I’ve even gone to great lengths to get close to Ling Chen and Yu BingYan… bah, what am I thinking about?!!</p><br/><p>If one were to talk about QianRou’s marriage, the biggest problem would actually be the fact that she had to forsake her family! Shui QianRou could not help but feel a little sour at that fact. It was not that she had no hope of getting married, but rather that the choices were equally heavy, one side was her loved one, but how could she forsake the family which had always been ranked first in her heart?! This would be akin to cutting up one’s intestines and organs…</p><br/><p>“Missy, the hot water is ready. Should we apply the medication to Young Master?” Die’er’s voice sounded beside her, startling Shui QianRou out of her reverie. She hurriedly agreed before walking over to her brother’s side.</p><br/><p>On this same night, ten or so experts remaining from the NanGong Family disguised themselves as merchants, soundlessly slipping into Sky Bearing Empire, with the aim of getting close to the Ling Family Courtyard.</p><br/><p>Within the Courtyard, Ling Jian was clothed completely in black as he silently stood by the door, looking at Ling Chi practicing his swordplay. Having suffered such a serious injury, his face still bore a telltale paleness from the severe loss of blood, but his aura was completely restrained within him, and even the killing intent he normally exuded had been completely kept hidden. If one did not know who Ling Jian was, they would naturally mistake him for someone else. Originally, Ling Chi and the rest thought that his cultivation had dropped due to his grievous wounds, but none of them realized that after so many life and death battles, Ling Jian had made a qualitative breakthrough and had reached the first stage of completely restraining one’s aura within themselves.</p><br/><p>“Eh?? Isn’t this Little JianJian?” A clear teasing voice suddenly sounded. Ling Jian’s face unconsciously twitched, Not this demoness again!</p><br/>\n</div>"}