{"title": "Chapter 505 - Benefitting from Disaster", "id": 505, "volume": 6, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-505-benefitting-from-disaster", "volume_title": "Volume 6", "body": "<h1>Chapter 505 - Benefitting from Disaster</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 505: Benefitting from Disaster</p><br/><p>Translator: DavidT Editor: Rock, DavidT</p><br/><p>If the meridians of an ordinary individual were like a trickling brook, then under the cleansing of inner qi, the meridians of a martial arts expert would be like an uninterrupted stream.</p><br/><p>Ling Tian’s meridians were originally in such a state, but after this incident they had transformed completely! If the meridians of other experts were like a small pond, his would be like a lake! If the meridians of other experts were like a stream, then his meridians were akin to a vast river! It was impossible to predict just what would happen when Ling Tian cultivated with such broad meridians! From the ancient times until now, not a single expert had achieved such broad meridians! None apart from Ling Tian! The breadth of Ling Tian’s meridians had even left the number one expert in the world today, Justice, in the dust completely!</p><br/><p>Without this incident, it was impossible for Ling Tian to achieve such a realm! After all, no martial arts cultivator would be crazy enough to pay the price of his whole body almost exploding to make a gamble on the one in a million chance! The way Justice saw it, Ling Tian was a lucky b<em>st</em>rd who coincidentally met with such a fortuitous encounter and had ascended to the heavens in a single step! This made Justice, who had cultivated bitterly for a few decades before achieving his current height, feel a sense of grievance in his heart. Isn’t it far too easy for Ling Tian? This is no different from benefits falling down from the heavens and right into Ling Tian’s lap!</p><br/><p>Even if he had a celestial guarding him in the dark, things can’t be so simple right?! Where is the justice?!</p><br/><p>Currently, Ling Tian was like a priceless treasure to Justice! Justice wanted to see what martial arts heights a person with such broad meridians would be able to reach!</p><br/><p>Could Ling Tian reach his own realm or even overtake him?!</p><br/><p>Furthermore, just what was that miraculous phenomenon that happened to Ling Tian? Just what had happened to the Heaven’s Heart jade pendants that the Shui and Yu Family had been fighting over for a thousand years? What happened to the Heaven Splitter thatwas rumored to allow one to rule over the world? As someone who belonged to Beyond Heavens who had safeguarded the continent for a thousand years, how could Justice let go of this opportunity in front of him?</p><br/><p>Ling Tian was obviously an important piece of the puzzle! Currently, not to mention a single Martial Order Medallion, even if there was a mountain of Martial Order Medallions, Justice would never kill Ling Tian!</p><br/><p>Besides that, Ling Tian who had his meridians greatly widened had also become the person who had the highest possibility to ascend the peak of martial arts! Ling Tian was also the only person who Justice had truly acknowledged!</p><br/><p>When Ling Tian woke up again, the first sight upon opening his eyes was Xiao YanXue’s love-filled gaze. Seeing Ling Tian waking up, Xiao YanXue’s face was immediately filled with a heartfelt and sincere smile but her eyes began to well up with tears. After looking at Ling Tian for a moment, she actually began wailing.</p><br/><p>During the time when Ling Tian was unconscious, it was akin to an unbearable torture to Xiao YanXue. At the same time, no matter how much pain she felt, she would force herself to stay awake to keep watch on Ling Tian. Every time she saw Ling Tian’s unconscious appearance and the wounds all over his body, Xiao YanXue felt an intense pain in her chest as though it was about to explode and she hated the fact that she could not replace Ling Tian being the one unconscious! Upon seeing Ling Tian finally regaining consciousness, Xiao YanXue could not help but shed tears of joy.</p><br/><p>Ling Tian blinked his eyes and saw how frail Xiao YanXue had become after worrying about him for the past few days. Her hair was also in a complete mess, and she no longer had the look of the arrogant talented fortune deity of the Xiao Family.</p><br/><p>But at this moment, Ling Tian had a strange feeling in his heart. After knowing Xiao YanXue for such a long time, her present appearance was the most beautiful and amiable. Despite looking extremely frail, she also had an allure capable of enticing all men in the world. He could not help but let out a smile as he raised his hands with difficulty and stroked Xiao YanXue’s drooping hair. With a smile he said, “Little cat, don’t cry… you won’t be cute if you continue crying…”</p><br/><p>Xiao YanXue did not respond to Ling Tian’s attempt to tease her as she said with her body trembling, “I want to cry… I want to cry… wuwuwuw… you almost scared me to death… the wounds all over your body scared me to death… what would I do if anything untoward happened to you?! You have really frightened me to death…” Xiao YanXue kept repeating how she was scared to death and said those words while crying and smiling at the same time, looking as though she was truly frightened by what had happened.</p><br/><p>After he had spoken those words, Ling Tian suddenly realized that the heavily injured him could already speak properly. While his voice was still soft, it was undeniably clear and the burning pain in his throat had also disappeared! The bone-shattering pain all over his body and soul-burning pain in his consciousness had also disappeared. Apart from a slight stinging pain in his wounds and a feeling of numbness, he did not feel anything else. Even the condition of his meridians was far better and without any problems. He had suffered from extremely heavy injuries a few days ago with all of his meridians and organs heavily injured. Not only that, but he also had external wounds all over his body and not a single piece of complete skin could be seen from his neck down.</p><br/><p>However, he had actually recovered so quickly! Ling Tian could not help but be dumbfounded.</p><br/><p>Hearing Xiao YanXue’s weeping sound, he knew that this lass must have been greatly frightened over the past few days and could not help but be filled with pity. Gently stroking her hair, Ling Tian comforted Xiao YanXue without saying a single word.</p><br/><p>It wasn’t that Ling Tian was far too weak to even speak but his attention was focused on circulating his inner qi. After a round of circulation, Ling Tian realized that the meridians in his body had been completely transformed! While his meridians were still like uneven ground with many parts even cracking up and needed to be properly cared for, his meridians were widened by at least twice! This was an unbelievable miracle! While it was still dangerous for Ling Tian to circulate all of his inner qi through his meridians currently, after his meridians healed up, they would definitely be far tougher! The internal injuries that Ling Tian had been the most worried about weren’t as serious as he had expected! Ling Tian was naturally overjoyed!</p><br/><p>The many things that had happened to Ling Tian were undoubtedly considered second to none. He started cultivating ever since he was in his mother’s womb and had used the pure XianTian qi in the womb to cultivate a top grade cultivation manual. At the same time, the cultivation manual that he cultivated was from his previous life, and it was definitely the purest and best quality cultivation manual! On top of that, Ling Tian also carried with him the knowledge from his previous life and after his body was washed with pure XianTian qi, he was naturally far superior to an ordinary person with his cultivation far ahead of his peers. Thus, Ling Tian was able to achieve such a martial arts height despite his young age and was even capable of escaping from the hands of a peerless expert like Justice! All of Ling Tian’s accomplishment was a result of his many fortuitous encounters!</p><br/><p>However, nothing in the world would be complete, and his shocking improvement would definitely slow down or even stop at a certain point. It was probably because the human body could only grow step by step and his prenatal advantages would not exist forever. While Ling Tian consumed a top grade elixir like the Great Cyclic Pellet and his cultivation had taken a huge step forward, the bulk of the medicinal effect was not truly absorbed by Ling Tian to make his own. Thus, Ling Tian decided to make use of that opportunity to attack the ninth level of his Divine Shocking Dragon Formula. While he had succeeded in his attempt, it was undeniably a fluke.</p><br/><p>Not too long later, Ling Tian comprehended being one with the world and had gained the true Divine Shocking Dragon Formula from Li Xue. While Ling Tian’s cultivation seemed to have taken another step forward, he didn’t know that this improvement of his was actually extremely damaging. After his multiple rapid increases in his inner qi, the amount of inner qi in Ling Tian’s body had already exceeded the capacity of Ling Tian’s meridians. Furthermore, even if his body had been tempered to the extreme by the Divine Shocking Dragon Formula, the meridians of his body were only akin to a small pond. With the sudden addition of the unending flow of water from a large river, it was already filled to the brim but was still continuously filled up. The hidden dangers of that could be easily imagined!</p><br/><p>Thus, while this incident seemed to be extremely dangerous, it had actually saved Ling Tian’s life! Ling Tian’s original injuries were extremely severe, but Justice who had wanted to kill Ling Tian had actually given aid at this moment. The number one expert in the world was actually a grandmaster physician as well! Despite Ling Tian’s injuries seeming extremely serious, it wasn’t much to this grandmaster physician!</p><br/><p>Just as the saying goes ‘fortune is accompanied by misfortune and misfortune hides within fortuitous encounters’. Just who would be able to fully understand the profound meaning behind those words?</p><br/><p>After the huge transformation, if Ling Tian’s original meridians were like a broad and open road that had plenty of vehicles on it with an accident possibly happening at any time, Ling Tian’s current meridians were akin to a highway without any risks. It would be difficult for any accidents to happen! Of course, this highway currently did not have any cars on it, but with such a safe highway, was there a need to worry about the lack of cars?</p><br/><p>Ling Tian naturally understood what this transformation signified. His cultivation speed would definitely be doubled after today! At the same time, his speed would also be doubled during a fight! The most important benefit was the fact that there wouldn’t be many barriers in his future cultivation! A moment of pain brought him such endless benefits and it was just unimaginable!</p><br/><p>Ling Tian began to grow excited. If his current speed were to double, just what would that mean?! Thinking about that possibility, Ling Tian had the urge to let out a loud roar of excitement!</p><br/><p>With his current condition, while his inner qi was dried up, he only needed to meditate silently and absorb the qi of the world. In less than three days, he would be able to regain the internal cycle of his inner qi. As for his external injuries… while they were serious, as long as his bones weren’t broken Ling Tian wouldn’t be bothered by a mere rupture of his skin.</p><br/><p>Ling Tian was truly overjoyed and could not help but laugh out loud. The moment the muscles on his stomach moved, he felt a wave of soreness and itch in his stomach. Ling Tian knew that Justice’s treatment method was truly amazing and a portion of his injuries had already begun to form a scab. However, he still could not help but let out a bitter laugh. While his injuries couldn’t be considered much, the pain and itch he felt would still be pretty torturous…</p><br/><p>The folds of the tent were lifted and a green-robed man stood in front of Ling Tian. “Are you awake? How do you feel? Do you feel good? Young noble Ling Tian who is in his birthday suit!”</p><br/><p>Ling Tian rolled his eyes and chuckled, “I sense a tinge of sourness. Justice, you should know of my circumstances and are you jealous of me? You must be extremely envious right?!”</p><br/><p>Justice’s face turned dark, “Ling Tian, don’t act so snotty after receiving such a huge benefit. If this seat’s mood isn’t good, I will take back the life that I saved!”</p><br/><p>Ling Tian burst out laughing as his eyes cunningly narrowed. “Do you mean that you do not wish to kill me right now?”</p><br/>\n</div>"}