{"title": "Chapter 515 - Wonderful Acting", "id": 515, "volume": 6, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-515-wonderful-acting", "volume_title": "Volume 6", "body": "<h1>Chapter 515 - Wonderful Acting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 515: Wonderful ActingTranslator: DavidT Editor: DavidT, Rock</p><br/><p>DongFang Hen received the sword and felt relief in his heart. It seems like the martial arts of this assassin isn’t much, but could there be other experts hiding in the vicinity? All of a sudden, DongFang Hen charged forward and instructed with confidence, “Leave three people behind to cover the crown prince’s retreat. The rest of you are to spread out and form a large circle. We must not let this fellow get away!” He then lifted up his sword and charged forward into battle.</p><br/><p>Three guards hugged DongFang XingChen and retreated while the others coordinated with DongFang Hen’s attack and surrounded the white-robed man. The assassin was already surrounded by almost a hundred men, and it was impossible for him to escape!</p><br/><p>DongFang XingChen regained his composure and roared, “Catch him! This crown prince will rip him into shreds! If anyone lets him off, he will be punished for the same crime as the assassin!”</p><br/><p>DongFang Hen cursed in his heart. This crown prince is truly foolish to the extreme! Can’t he take a good look at the current situation? Is he trying to force the assassin to escape? From my first exchange with him, his movement technique definitely isn’t any weaker than mine. If he truly wants to escape, this situation would only take a turn for the worse and they would definitely have to pay a heavy price! The thing that they should be doing now is to demoralize their enemy and try to capture him without exchanging any blows. However, this crown prince of theirs had actually done the complete opposite! To think that their wise emperor would give birth to such a foolish son! How unfortunate!</p><br/><p>With two clanging sounds, DongFang Hen had exchanged two sword blows with the white-robed man. All of a sudden, he looked at the white-robed man and said in a mellow tone, “Friend, it seems like you are here on orders from someone. Why do you have to throw your life away? If you can tell me who the mastermind is, this old man can help plead to the crown prince to spare your life. What do you think about that?”</p><br/><p>As he said that, DongFang Hen observed the surroundings. This white-robed man is already trapped in such a perilous situation, but his comrades have not rushed out to rescue him. Could it be that he… doesn’t have any comrades?</p><br/><p>The eyes that were revealed blinked with hesitation, and a trace of fear could be seen. However, he did not stop in the slightest and tried charging out of the encirclement. Seven to eight guards immediately brandished their swords to force him back into the encirclement.</p><br/><p>The actions of the white-robed man had confirmed DongFang Hen’s guess and he was immediately relieved. Seeing the other party’s pathetic appearance, he had the feeling that victory was within his grasp.</p><br/><p>Victory was determined!</p><br/><p>The next step…</p><br/><p>DongFang Hen was extremely pleased with himself as he enticed the white-robed man while fighting, “Friend, can’t you read the current situation? You no longer have any hope of escaping. Even if you were to grow a pair of wings now, it would be impossible for you to escape. It is best for you to wise up lest you suffer from endless physical pain.”</p><br/><p>The white-robed man sneered and suddenly said, “Alright, let me tell you.”</p><br/><p>DongFang Hen was elated and his sword slowed down, “Speak.”</p><br/><p>“The mastermind behind me is Family Head DongFang JingTian of the DongFang Family!” The white-robed man sneered before avoiding two sword strikes from the rear.</p><br/><p>“Bullsh*t!” DongFang XingChen roared, “Darn b*stard, even if you want to frame someone, you should find the right target! D*mmit, even if you do not say anything, do you think that I won’t know that DongFang JingLei was the one who sent you?”</p><br/><p>Hearing what DongFang XingChen had said, the white-robed man seemed to have been mentally shocked and his footwork was disrupted slightly, resulting in his white robe being slashed apart in a few different areas. Thankfully, he was not wounded in the slightest and he cursed coldly, “Nonsense! This daddy here was indeed sent by DongFang JingTian!” The white-robed man then blocked a few sword strikes and stumbled back pitifully with his breathing becoming heavy.</p><br/><p>“Were you really sent by Second Master?” DongFang Hen’s sword slowed down again and he asked with some doubt.</p><br/><p>“No! The one who sent me here was First Master DongFang!” The white-robed man avoided a few more sword strikes and continued denying what DongFang Hen had said. However, a hole was still stabbed in his shirt but despite things being so dangerous, the white-robed man was still not injured! How could this white-robed man be so lucky?</p><br/><p>“Darn b*stard!” DongFang Hen cursed and did not continue questioning the white-robed man. Like a cat chasing after a mouse, his sword was brandished around the white-robed man but he grew weary after a while. At the same time, he cursed in his heart, It turns out that this fellow’s movement technique is so exceptional. However, he only specializes in assassination and is utterly incapable in a frontal battle.</p><br/><p>The white-robed man clenched his teeth but did not say another word. Like a crazed tiger in a cage, he charged towards the left and right but was unable to charge out of the encirclement.</p><br/><p>However, DongFang Hen and DongFang XingChen had already come to a conclusion upon seeing the white-robed man’s reaction! The mastermind behind the assassin was undoubtedly DongFang JingLei! Furthermore, DongFang JingLei actually wanted to frame his own elder brother, DongFang JingTian! It was only that his means were far too clumsy. Could it be that they thought that this crown prince was an idiot?</p><br/><p>With a plan in his heart, DongFang Hen no longer showed any mercy and roared, “Go all out! It would be best to capture him alive but if you can’t, kill him on the spot and shred him into smithereens!”</p><br/><p>The dozens of guards roared out together in unison and brandished their weapons! Being caught off guard, the white-robed man tried his best to avoid the attacks and his white robe seemed to have turned into white butterflies, flying out in all directions. At the same time, a few bloody wounds also appeared and the white-robed man was finally injured!</p><br/><p>DongFang Hen raised his sword and charged forward aggressively with a powerful gust of wind whooshing behind him. His sword then slashed down mercilessly towards the white-robed man like the rushing winds in a thunderstorm and rapid currents of a river. The attack was loud like thunder but yet silent like a virgin. Every single action he took was filled with a carefree heroism, and he had the demeanor of an unparalleled expert.</p><br/><p>The guards by the side were also unwilling to be outdone. How would they give up the opportunity to beat the white-robed man when he was down? They charged forward with valor and their battlecry shot through the clouds with the atmosphere of victory in the midst!</p><br/><p>This was killing an assassin and the huge merit of saving their crown prince! It was as though a pile of gold had appeared in all of their eyes.</p><br/><p>The white-robed man shouted out flusteredly and spat out a mouthful of blood. All of a sudden, a powerful sword qi shot out from the white-robed man’s sword and after brandishing his sword three times, three guards cried out miserably and fell down onto the ground. The white-robed man’s inner qi seemed to have been raised to a whole different level at this moment and he was like a crazed tiger trying to break out of the encirclement.</p><br/><p>“Trap him! He used a forbidden art to forcefully raise his inner qi, and it will not last for long! He doesn’t have much strength left! Try to drag on the battle and avoid frontal confrontations! Tire him to death!” Being a top notch expert of the DongFang Family, how could DongFang Hen not recognize the symptoms of the white-robed man’s actions? He was immediately elated and began roaring out commands to his subordinates.</p><br/><p>Afraid that something might go amiss, DongFang Hen dashed forward and chased behind the white-robed man. Being blocked from the left and right, the white-robed man suddenly shot towards the sky and tried charging out in an almost suicidal manner.</p><br/><p>“Where do you think you’re going?” DongFang Hen burst out into laughter and gave chase immediately. In just an instant, he appeared in front of the white-robed man and slashed down fiercely! At the same time, he gathered his inner qi in his left palm and struck out without hesitation. He was certain that the white-robed man would lose the ability to resist after this sword and palm strike!</p><br/><p>Indeed, the white-robed man hurriedly blocked the sword strike with his sword and after a loud clang, DongFang Hen’s left palm smashed onto the white-robed man’s chest, sending him flying with a grunt.</p><br/><p>The white-robed man then shouted out miserably and another mouthful of blood shot out from his mouth. All of a sudden, he spun around in the sky and after lifting his left hand up, a rope shot out from his sleeves and coiled onto the branch of a tree forty feet away. Tugging hard on the rope, the white-robed man borrowed the force from the rope and shot away like a shooting star. The moment he reached the tree, the white-robed man snapped the tree branch and with a ‘kacha’ sound, and the white-robed man disappeared into the dense forest with the falling branch!</p><br/><p>No one imagined that the assassin would have such a trump card left, and the sudden event had stunned them all into silence.</p><br/><p>“Give chase! He is injured already and can’t run far!” They never imagined the roasted duck to fly away under their very eyes! DongFang Hen’s countenance was ashen as he let out an exasperated roar. At the same time, he shot off in the direction that the white-robed man disappeared and gave chase.</p><br/><p>If he didn’t intentionally try to act cool, perhaps the assassin would have been caught by now. Thinking about that, DongFang Hen was both enraged and embarrassed.</p><br/><p>The white-robed man, Ling Tian, appeared behind the rushing Xiao YanXue like a gust of wind. Amidst Xiao YanXue’s shriek, he said softly, “It’s me.” Xiao YanXue immediately went silent and Ling Tian picked her up before speeding up to a speed three times his previous speed. He then disappeared into the dense forest like a puff of green smoke.</p><br/><p>As for the guards giving chase to him from behind, even if they chased after him with their fastest possible speed, they were still forty to fifty feet away from Ling Tian when he picked Xiao YanXue up. This resulted in them rummaging around the jungle like headless flies trying to find a buried corpse. Upon thinking about the hilarious scene of them doing so, Ling Tian could not help but snicker evilly.</p><br/><p>The previous battle made Ling Tian frustrated to the point he felt like dying. It was like a burly grown man accompanying a bunch of preschoolers in a fighting game. Furthermore, he had to act as though he couldn’t win against his opponents. Despite having ten portions of strength, he was only allowed to use one to two portions of it. Even though he was able to defeat his opponent in a few blows, he had to act as though he wasn’t a match for them… such a thing made Ling Tian feel speechless.</p><br/><p>However, Ling Tian was extremely pleased with his acting and was sure that he deserved a trophy if he was in his previous life. While the mission was tough, he had finally completed it beautifully. After this event, it would probably be useless for DongFang JingLei to quibble his way out of this mess and he would definitely become DongFang JingTian and the DongFang imperial family’s common enemy! Regardless of how eloquent DongFang JingLei was, he wouldn’t be wiggling out of this mess for sure! However, all of this wasn’t enough yet. Ling Tian will still have to root for DongFang JingLei and set Eastern Zhao on fire before he made a leisurely trip back to Sky Bearing. If he rushed back, he would probably be able to enjoy the show in Southern Zheng as well.</p><br/><p>Furthermore, he missed Ling Chen, Yu BingYan and the rest. Of course, he also missed his parents and family members…</p><br/><p>At that time, he could command his army into battle with one eye and watch the internal struggle of Eastern Zhao with his other eye. It was truly turning the rivers and mountains into painting with his words, watching a beautiful show silently from the side. Isn’t it enjoyable to lead such a life?!</p><br/>\n</div>"}