{"title": "Chapter 522 - Internecine Strife", "id": 522, "volume": 6, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-522-internecine-strife", "volume_title": "Volume 6", "body": "<h1>Chapter 522 - Internecine Strife</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 522: Internecine StrifeTranslator: chuchutrain Editor: DavidT, Rock</p><br/><p>Actually, based on Ling Tian’s temper, he would have long ago slapped this sex maniac to death with a palm. So what if this land was part of Eastern Zhao?! The real reason as to why Ling Tian was depressed was not because of DongFang XingChen’s type of lecherous behavior, but rather the fact that he himself might not be able to control his killing intent and annihilate him on the spot! Then all the effort he had put in before would all go to waste! From the situation now, it looked as though it would not take long to attract Ling Tian’s killing intent.</p><br/><p>This kid really doesn’t know what death looks like, right?!</p><br/><p>Could it be that today is an auspicious day to walk on the yellow springs road?!</p><br/><p>Ling Tian was trying his best to control himself currently, to not incite his killing intent towards such a despicable character, or else all the effort he spent within the forests would be rendered useless. After all, he was still counting on DongFang XingChen to sow dissension when he returned, allowing the imperial family and the DongFang family to fight internally. If the crown prince were to die here just like that, wouldn’t it be a waste of his efforts? The effectiveness would be diminished if it was just DongFang Hen and the guards left!</p><br/><p>As Ling Tian looked at the ever rampant DongFang XingChen, he really wanted to ask a question, Kid, did you manage to divine the fact that I cannot kill you? Or else why would you be so arrogant in front of me?!</p><br/><p>Finally, DongFang XingChen let out a pained cry, holding onto his left arm with his right hand. There was no sign of pain on his face, but he angrily called out, “Darned thing, to try and assassinate this prince! You’ve made this crown prince suffer such a heavy injury. Come on men, bring down this fool who doesn’t know what is it to die! Dead or alive, it doesn’t matter!” After a slight pause, as though afraid that his guards would also kill his beauty, he added on, “The assailant is the male!”</p><br/><p>A series of weird expressions surfaced on the looks of the various guards. The guy was obviously standing so far from you, not even budging a single inch, but you actually mysteriously got injured! Even if you wanted to pretend, at least make a good show out of it… your scream was so fake, your face still so energetic… you just want the life of that scholar over there…</p><br/><p>Just as the various guards were contemplating whether to rush forward like what their Crown Prince commanded, Ling Tian and Xiao YanXue were also heatedly discussing something.</p><br/><p>“It seems like this Crown Prince really has some intentions towards you, to actually wish to silence me in broad daylight. Sigh, femme fatale, what an injustice to me!” Ling Tian ridiculed even as he laughed.</p><br/><p>“Annoying! Tian’ge, how do you plan to deal with him? Kill him?!” Xiao YanXue had on a face of dislike.</p><br/><p>“This would have to see what sort of suggestion my dear wife would want! If you think that he’s too boring, then I will finish him off! It depends on you, at most we will just redo the drama that we’ve set! Ling Tian sinisterly sniggered, not even putting those dozens of guards rolling their sleeves up for battle in his eyes.</p><br/><p>“I know that you wish to kill him even more than I do, but this will affect your original plan, and will cause all your hard work to go down the drain. But such a b*st*rd cannot be allowed to go scot-free, or else we might not know how many other women will fall prey to him. As such…” Xiao YanXue spat out with clenched teeth as she stared at DongFang XingChen, the underlying meaning clear in her words.</p><br/><p>Ling Tian felt a chill through his heart. This lass was seriously vicious, and from her unspoken words, Ling Tian could hear her meaning. How to go about not letting him be able to harm other ladies? The solution was simple, so long as he did not have his ‘tool’ to harm ladies, that would do. In Ling Tian’s previous life, the famous martial exponent, the top expert of the world had reached that stage because he did not have his tool! And his name was –</p><br/><p>DongFang BuBai! 1</p><br/><p>“It seems like I’ll have to turn him into another DongFang BuBai. How coincidental that his surname is also called DongFang, and a pity that this world does not possess a Sunflower Manual, or else this fellow would really be invincible!” With slight regret, Ling Tian stared at DongFang XingChen’s lower half as he shook his head.</p><br/><p>“… what invincible below the heavens?” Xiao YanXue had a confused look on her face.</p><br/><p>“Oh, I was saying, it’s time for me to move my limbs a little.” Ling Tian hastily covered up. After this sentence, he moved forward. It was then that Xiao YanXue found out seven or eight of the guards had already surrounded them with swords drawn.</p><br/><p>Ling Tian took two steps forward, arms folded around his chest. Suddenly, his voice turned cold as ice, “Are you guys really going to take the side of the evildoer, and help your Crown Prince to snatch away my wife?”</p><br/><p>The surrounding guards were all speechless, and one of them immediately scolded, “What’s with all that nonsense! Brothers, let hurry and get rid of this poor guy, no, this assassin for the Crown Prince!” As he spoke, he raised his blade and brought it down. The rest followed suit, shouting as they stabbed forward. The next scene would probably be when this weak scholarly person gets chopped into pieces. That is if Ling Tian was really a weak scholar.</p><br/><p>DongFang Hen only let out a long sigh and closed his eyes. While he disagreed with such matters, as a subordinate, how was it his place to spoil the matters of his Crown Prince? Furthermore, the opponent was probably just a poor scholar with no backing nor status to his name. If he was killed, then so be it. There would not be any repercussions. This was not the first time it had happened anyway.</p><br/><p>Ling Tian let out a cold smile and he suddenly rushed forward in high speed, straight into the encirclement. Suddenly, the guards rushing forward let out cries of pain, miserable beyond belief.</p><br/><p>Possessing acute senses, DongFang Hen immediately discovered that the situation was amiss, and opened his eyes. Seeing the scene in front of him, his eyeballs nearly popped out of their sockets!</p><br/><p>Behind him, the seventy to eighty men who wore looks of schadenfreude as they prepared to watch the cruel show had lost their voices. The scene in front of them made them doubt their eyesight. What, just what had happened?</p><br/><p>Following this, someone felt his intestines spasm, and started to puke… even all the bile inside was puked out.</p><br/><p>Of those eight who had rushed forward with their swords, all of them remained standing upright on the ground, but they had already lost their lives. One of them had a sword stabbed into his throat, another into his heart… eight sword blades, all ended one of their own companion’s lives, forming a macabre spectacle where the eight corpses still stood stable and upright like Mount Tai itself…</p><br/><p>Fresh blood spewed nonstop out of them as though it was free of charge, and below each corpse was an ever-growing puddle of blood. The pools of blood flooded the hard ground, combining to form a river of blood that was still slowly lengthening…</p><br/><p>In that instant the guards had stepped forward, Ling Tian had used his own movement techniques to skirt around the group, applying minute forces to each of their elbows, diverting and rectifying their swords toward their own companions instead. As such, the eight of them turned into a beautiful scene of internecine strife!</p><br/><p>Right now, only Ling Tian remained standing at the same spot, clapping his hands as he spoke, “You guys are really righteous warriors! Unable to bear seeing my wife and I get forcibly separated, you actually chose the path of suicide, unwilling to help the evildoer in his crimes! Such a heroic bearing, you guys are really the role model of the pugilistic world! I’ll forever carve your actions in my heart!”</p><br/><p>Seeing how this ‘weak scholar’ who was supposed to be cut down was actually still able to stand off to one side and speak such cynical remarks, everyone felt themselves shiver uncontrollably!</p><br/><p>One moment ago he was a harmless sheep, suddenly he transformed into an asura from the underworld! This huge reversal caused everyone’s mind to be unable to wrap around it, and they stared foolishly at Ling Tian instead!</p><br/><p>Who exactly was this guy?!</p><br/><p>The majority of the guards present still did not know what was happening, or why this bunch of people suddenly started killing among themselves. But the only thing they could confirm was that this frightening sight in front of them was created by this jerk who was smiling like a Cheshire cat in front of them. It was just that Ling Tian’s movements were too quick, and out of the blue, which made them question their eyesight as to whether he really moved or stood still.</p><br/><p>The only person who could have shone some light on this incident, DongFang Hen, chose precisely the wrong moment to close his eyes instead…</p><br/><p>But there was one point that all present were clear about, and that was the fact that the Crown Prince had kicked an iron board this time! Whether it was witchcraft or martial skills didn’t matter. At this level for witchcraft would mean that no one would be able to resist. If it was martial arts, then that would be even scarier, for it would mean that their Crown Prince had offended a peerless genius for no reason, and everyone related to him would get their heads ripped off as recompense!</p><br/><p>For such a person, the Crown Prince actually thought of taking his wife to play?! Seems like the guy would play his brains first before he even gets to do anything!</p><br/><p>“What happened? Ah? D*mmit, you bunch of failures! Even if you aren’t willing to help this daddy do his business, you don’t need to commit suicide, right? Are you guys trying to spoil my happy mood?” The Crown Prince’s enraged cry now carried some form of hysteria. DongFang XingChen stared with wide eyes, unable to believe the terrifying scene in front of him. He felt as though his heart was about to leap out of his chest, his voice carrying some fear as he screamed, “Charge! What’s the use of me raising all of you? Bunch of trash, you cannot even settle a poor guy? All of you charge!”</p><br/><p>Hearing the urging of the Crown Prince, not only did the remaining guards not charge forward, but they collectively retreated a step as though they had some hidden chemistry. Charge? Go on top of your mom instead! 2 You think this daddy’s life here is as worthless as grass? Daddy here has not lived his life enough yet!</p><br/><p>Ling Tian had a big smile on his face as he looked playfully at DongFang XingChen’s ashen face. He gently replied, “Crown Prince, if you want to play with women belonging to others, you have to do it personally. How could your men replace you in doing it? Maybe if you step forward yourself, you just need to shake your tiger-like strong body, no, you’re the Crown Prince, so it should be dragon-like strong body, and I might just pee in my pants. Come on, don’t be shy. Such a peerless beauty in front of you, you’ve probably never seen the likes of her in your entire lifetime, right? Quickly come over, this is a once in a lifetime opportunity. If you miss this, then there will not be another chance! You’ll regret this for life!</p><br/><p>DongFang XingChen’s lips trembled nonstop, turning back and staring pitifully at the guards who were huddled behind him like a flock of geese. His body started to tremble, almost falling off from his horse.</p><br/>\n</div>"}