{"title": "Chapter 537 - Extreme Slaughter", "id": 537, "volume": 6, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-537-extreme-slaughter", "volume_title": "Volume 6", "body": "<h1>Chapter 537 - Extreme Slaughter</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Li Xue nodded her head and with a wave of her hands, a sleeved dart shot towards the sky!</p><br/><p>Without a sound, another three black figures charged onto the battlefield like ghosts. Their figures weaved through the forest swiftly but the sound of their clothes rushing through the air could not be heard at all. They appeared like a gentle fog on the battlefield but carried with them a boundless killing intent!</p><br/><p>Each of the three black-masked men was holding onto a longsword and they charged into the battlefield like a bunch of locusts going through a farm field. Following the entrance of the three of them, a river of blood began to flow around them as they swiftly and easily reaped the lives of the people around them with clouds of blood exploding at their sides.</p><br/><p>If the battle between the Shui and Yu Family experts was like street hooligans having a street fight, then these three new black-masked men were like world-class professional boxers! It was as though the experts of the two families were rookies of the pugilistic world, and these three black-masked men were grandmasters!</p><br/><p>The difference between the two groups was far too obvious and huge!</p><br/><p>Every sword that struck out was extremely ferocious, accurate and swift. Every attack of theirs would definitely land and every attack that landed would definitely kill. At the same time, every attack of theirs would be extremely precise with the amount of energy used being just right to kill their enemy. Not a single shred of energy was wasted and their actions were extremely nimble. Anyone they passed by would hold onto their necks and collapse onto the ground! The blood that shot out from their necks was no thicker than a string. While there would occasionally be a thicker string of blood being shot out, it would be no thicker than the diameter of a finger. This special scene fully displayed the exquisite killing techniques of these three black-masked men. The accuracy of their attacks and control of their strength had achieved perfection! Ever since the three of them entered the battlefield, not a single person that they killed had blood spurting out from his neck!</p><br/><p>What frightening killing techniques!</p><br/><p>Countless corpses collapsed onto the ground and faced the sky with a small fountain of blood shooting up towards the sky. Ling Tian suddenly thought about the irrigation system in his previous life watering the town garden. The scene before him today was just too similar to that scene!</p><br/><p>The only difference was that the former was pleasant to view but the latter was terrifying!</p><br/><p>The three individuals swept through the battlefield like a violent tornado and anyone in front of them, regardless of whether they were a Yu or Shui Family expert, would be killed without mercy. When these three well-rested top-notch assassins faced off against the fatigued soldiers who could barely lift up their swords, it was no longer a fight but a one-sided massacre! In fact, it couldn’t even be considered a massacre, it was no different from a little child destroying an ant’s nest!</p><br/><p>Or perhaps another analogy could be made. They were like three hardworking farmers waving their sickles to reap their wheat harvest. They were like starving beasts swallowing prey that were completely incapable of defending themselves. Or perhaps it could be said that they were like the lightning of the heavens forming a gigantic mountain crushing towards a little mound!</p><br/><p>This was the instant for them to collect their harvest and those who were the ‘harvest’ could only accept their fate!</p><br/><p>At the end of the day, Xiao YanXue who was atop the tree was a pampered young miss who had never witnessed such a bloody scene before. At the very most, she would have witnessed the killing of a few of her family’s enemies. While the previous battle between the Yu and Shui Families was intense, it wasn’t considered bloody. With Ling Tian and Li Xue analyzing the battlefield beside her, while she felt a tinge of discomfort, it was still bearable. But ever since the three black-masked men entered the battlefield, the atmosphere of the battlefield changed entirely, exploding forth with bloodiness and violence. After she witnessed the fountains of blood shooting out from the corpses, Xiao YanXue felt her body tremble and legs turn to jelly. With a soft squeal, she dived into Ling Tian’s embrace and shut her eyes tight, not daring to watch the battle any longer. However, the fishy bloody smell in the surroundings still made her have the urge to puke!</p><br/><p>Ling Tian patted her on the back gently to console her and imbued his pure inner qi into her body as well. Ling Tian’s inner qi flowed into her body like a small stream and immediately alleviated the disgust she felt in her heart making her feel much better.</p><br/><p>Countless frightened screams endlessly sounded and both the Yu and Shui Family experts were petrified by the entrance of these three mysterious experts. They originally thought that these three experts were here to aid their enemy but were shocked to realize that these three experts were killing both parties indiscriminately. Be it the Shui or Yu Family members, anyone who was within their range was killed without mercy! Ever since these three black-masked men appeared, there were more than a hundred experts of the Shui and Yu Family experts dying under their hands! The frightening speed of these three experts, the ferocity of their means, and viciousness of their hearts was a ghastly sight to all the experts present!</p><br/><p>A war between the sandpiper and clam with the fisherman catching them both in the end?!</p><br/><p>However, just who was the fisherman?</p><br/><p>Just what organization would have this courage to enter the battlefield between these two thousand-year-old families?!</p><br/><p>Yu ZhanKong deflected the attacks of the Shui Family experts and retreated a full thirty feet while roaring, “Where did these friends come from? Why are you guys killing without distinguishing black from white? This old man is the Elder of the Yu Family, Yu ZhanKong. If this is a misunderstanding and a slip of the hand, may you friends stay your hand and this old man will promise to not pursue the matter!”</p><br/><p>Yu ZhanKong reported his name and took a large step back with extremely attractive conditions. After all, almost half of the experts who had died belonged to the Yu Family and the ones who were still alive now were naturally not weak. In just a short instant, there were plenty of Yu Family experts who had died and Yu ZhanKong had actually promised to not pursue the matter! This was indeed a huge step back!</p><br/><p>However, the only response he got was a sharp sword shooting towards his throat at a lightning fast speed!</p><br/><p>Yu ZhanKong was startled and it was far too late for him to block the attack. He quickly dodged to the left and his figure drifted out diagonally. However, this sudden dodging action of his had resulted in his inner qi almost flowing back in reverse. He felt his blood churning and he only managed to resist the side effects with his pure inner qi! Before Yu ZhanKong could catch his breath and recover from the shock, another silver light flickered before him and he felt a bone-piercing chill targeted at his throat. That sword had actually shot towards him again with the target being none other than his throat!</p><br/><p>Yu ZhanKong’s expression changed drastically. At this moment, his body was still hovering in mid-air and he had no choice but to forcefully increase the speed of his descent. At the same time, his right leg kicked out. However, this kick of his was not targeted at the black-masked man but targeted at a random person below him. He only hoped that the person that he sent flying would be able to block the black-masked man for a short instant. After the person let out a mournful groan, Yu ZhanKong realized that the person he sent flying was actually a member of his Yu Family!</p><br/><p>With a ‘shua shua’ sound, the Yu Family member who was sent flying was diced into pieces before he could even react and his body was reduced to a bloody cloud! He was the only person who did not die with a complete corpse under the hands of the black-masked men!</p><br/><p>The black-masked man then emerged from the bloody cloud like a demon and brandished his sword at Yu ZhanKong’s throat again! His sword was both swift and stubborn as though the only mission of his sword was to pierce through Yu ZhanKong’s throat and would not rest until that mission was achieved!</p><br/><p>Underneath the black mask, a pair of cold eyes stared at Yu ZhanKong emotionlessly as though he was staring at a dead person!</p><br/><p>Yu ZhanKong’s action of sending someone flying to block his enemy for an instant was undeniably the right action. For an expert of his level, even a small window of time was enough to buy him his life!</p><br/><p>Yu ZhanKong suddenly let out a loud roar and circulated all of his inner qi and retreated backward with all he had. Everyone he met along the way would be sent flying by Yu ZhanKong’s powerful inner qi! He had actually forcefully bashed out a road among the crowd! Under such circumstances, Yu ZhanKong could no longer consider if he would commit fratricide and his only thought was to protect his life. As long as he could escape from the sword of this black-masked man, he would be satisfied. He no longer had the luxury of thinking about anything else!</p><br/><p>The black-masked man chased after Yu ZhanKong closely and his sword was never more than three inches away from Yu ZhanKong’s throat. His figure followed closely behind Yu ZhanKong like a shadow and despite Yu ZhanKong still holding onto his sword, this little distance was insufficient for Yu ZhanKong to retract his sword. Despite holding onto his sword, he could not do anything with it! If his retreat was delayed by just a short moment, his throat would definitely be pierced by the demon in front of him!</p><br/><p>In less than half a breath’s time, Yu ZhanKong was already filled with sweat all over and beads of sweat rolled down his face. It had even entered his eyes but he just did not dare to even blink his eyes. All of his heart and soul was covered by the fear of death and he suddenly felt as though his soul was floating in the air and was completely powerless!</p><br/><p>Using the lives of his subordinates in exchange for a chance to stay alive was actually such a difficult task. If that’s the case, perhaps it would be better for him to have a swift death!</p><br/><p>With one person escaping and the other chasing, these two individuals had weaved through the entire battlefield in just a short few breaths! Just when the fear in Yu ZhanKong’s heart was at the extreme and he felt as though he was about to collapse, that bone-piercing sword light was suddenly retracted and a trace of mockery could be seen in the eyes of the black-masked man. The black-masked man then retracted his sword and following a wave of miserable groans, he killed his way back to the battlefield!</p><br/><p>He had actually given up on an opponent who lost all hope and went back into the battlefield!</p><br/><p>Yu ZhanKong had become the lucky and only individual to escape from the black-masked man’s hands!</p><br/><p>Yu ZhanKong rubbed his throat and panted heavily. He could not even see what was in front of him clearly and his body was completely exhausted. Up until now, his eyes were still filled with shock and he just could not understand why the black-masked man would let him go despite the fact that he did not have any chance of escaping! Could it be that the black-masked man was showing mercy? Since the black-masked man had killed so many people mercilessly, why would the black-masked man let him go? Why would the black-masked man show him mercy? If the black-masked man did not want to kill him, why did the black-masked man chase him for such a long time? As Yu ZhanKong thought about that, his body slumped onto the muddy ground without the strength to even move his fingers.</p></div>\n</div>"}