{"title": "Chapter 543 - Deployment", "id": 543, "volume": 6, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-543-deployment", "volume_title": "Volume 6", "body": "<h1>Chapter 543 - Deployment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ling Tian began to frown and responded with an ‘Mmm’ without saying anything else. After a moment of silence, he said, “We need to put in more effort into our information net in the north. I feel that the reason for Yu ManTang and Yu ManTian’s departure can’t be simple. They actually had the ability to escape from our information net.”</p><br/><p>Li Xue acknowledged what Ling Tian said before continuing, “There is also Eastern Zhao. The DongFang Family Head, DongFang JingTian, was assassinated by a mysterious assassin. The assassin’s martial arts are extremely profound and unfathomable. He was actually able to kill the number one expert of the DongFang Family in a few breaths time! The rumors of the world say that it is extremely likely to be the actions of the First Pavilion Head. Ling Jian has already confirmed that this matter was not performed by our side. On top of that, Ling Jian has seen DongFang JingLei’s strength before and if DongFang JingTian’s martial arts were similar, there wouldn’t be anyone in the First Pavilion capable of easily killing him. DongFang JingLei washed out the DongFang Family in a bloody operation seven days ago and has taken over the position of Family Head. But for some odd reason, whenever the imperial palace summons DongFang JingLei, DongFang JingLei will reject the summons using the excuse of being sick. According to the news from Eastern Zhao, DongFang MingRi seems to hate DongFang JingLei to the bone and has the intention to get rid of him. This is something that we have to guard against.”</p><br/><p>As she said that, Li Xue looked at Ling Tian with a profound look. While she did not know why Eastern Zhao would fall into such chaos and did not hear Ling Tian mentioning the matter, she was certain that Ling Tian was definitely related to the matter. After all, the martial arts of the assassin were just too unfathomable. There weren’t many individuals in the world with such a martial arts accomplishment and Ling Tian just happened to be one of them. On top of that, the person who took over the DongFang Family was DongFang JingLei and not anyone else. DongFang JingLei was the person who had an agreement with Ling Tian!</p><br/><p>As Ling Tian saw Li Xue’s gaze, he naturally knew what she was thinking about. He then replied with a smile, “Order Shen RuHu that he can make use of the army to echo DongFang JingLei’s actions. However, he must never enter into battle no matter what. Also, order Ling Thirty-three to work together with DongFang JingLei. He must aid DongFang JingLei in taking over the DongFang Family while sowing discord between the DongFang Family and Eastern Zhao imperial family. The best would be for both the parties to end up fighting each other. As for the detailed plan, he can come up with it on his own and he does not need to report anything to me.” Li Xue acknowledged the order and recorded it down.</p><br/><p>“As for the Shui Family…” Ling Tian looked at Ling Chen.</p><br/><p>Ling Chen immediately reported all of the Shui Family actions and how their Courtyard was involved. As Ling Tian heard Ling Chen’s report, he could not help but shake his head with a bitter laugh. He even had the urge to grab the lass over to his knee and give her a good spanking! The moment the thought about that, his thoughts immediately drifted elsewhere. Thinking about Ling Chen’s appearance when being spanked and the soft feeling on his palms, a ball of fire burned in his abdomen. Young noble Ling had not ‘eaten’ for almost half a year already and it was time for him to have a good meal.</p><br/><p>While Ling Chen’s actions may seem extremely profound in the eyes of others, how could Ling Tian who was extremely familiar with Ling Chen not know what she was thinking about?</p><br/><p>This lass obviously wants to me eat Shui QianRou up! Isn’t this lass fantasizing too much? She actually wants to win the whole Shui Family over without fighting a battle? That was a thousand-year-old family on par with the Yu Family! Even if all of their successors are dead, there will still be a bunch of old fogies around. Only if all the old fogies were dead would Ling Chen’s motives be achieved. However, what was the point of having a Shui Family with everyone dead?</p><br/><p>At the same time, Ling Tian was also able to see other things from Ling Chen’s actions. Ling Chen was definitely extremely fond of Shui QianRou. Since things had already developed to such an extent, they could only take things one step at a time. In any case, it would be impossible for the Shui Family to create a storm in the Heavenly Star Continent.</p><br/><p>Ling Chen glanced at Ling Tian anxiously to see what kind of an expression he had. Seeing his emotionless expression as though he was thinking about something, Ling Chen could not help but be flustered and thought that Ling Tian disagreed with her actions. Who would have thought that a lascivious smile would suddenly curl up on his face? With her understanding of Ling Tian, how could she not understand what he was thinking about? Her face flushed red immediately as she lowered her head in embarrassment…</p><br/><p>The secret chamber fell silent as everyone stared at each other not knowing why their young noble would suddenly fall into deep thought and have such a… lecherous smile on his face. Just what was he thinking about?</p><br/><p>Just when Ling Tian was fantasizing about his night, he suddenly felt a pain and it was Li Xue giving him a good pinch on his side. Ling Tian glared at her while gritting his teeth in pain and was immediately awoken from his daze. Looking at everyone, Ling Jian still had the same expression and was seated with his back straight and a serious expression on his face. As for Meng LiGe, he had an amiable smile on his face. However, Ling Tian was enraged to realize that the smile on Feng Mo’s face was even more perverted than his! An experienced man like Feng Mo naturally knew what his young noble was thinking about. It was no wonder why he smiled at Ling Tian with a look of tacit understanding…</p><br/><p>“Cough cough… Feng Mo, why are you smiling in such a weird manner? Do you need this young noble to help treat your ailments? This young noble’s medical skills aren’t too bad!” Ling Tian glared at Feng Mo and asked seriously.</p><br/><p>“Ah? Err… this subordinate… err… no…” Feng Mo stuttered on the spot without knowing what to say. Facing the fierce glare of his young noble, he did not even know where to place his arms.</p><br/><p>“Are you sure? Your head is swaying like there is an anteater underneath your ass. I cannot even see your eyes in the midst of your hairy face and I thought that your face was cramping up. Are you sure you don’t need me to treat your ailments?” Ling Tian said with a trace of pity and his fierce gaze told Feng Mo that he truly wanted to ‘treat’ him.</p><br/><p>“There really isn’t anything wrong with me. I thank young noble for your concern!” A chill ran down Feng Mo’s spine and he quickly added on, “This subordinate’s body is as tough as an ox and I can go through mountains of blades and seas of fire for young noble at any time!” The expression on his face was one of absolute loyalty as though he was ready to give up his life for Ling Tian. Anyone who saw such an expression would definitely praise him for being a truly loyal warrior!</p><br/><p>Ling Tian replied with a bland ‘oh’ and said with a tinge of disappointment, “If that’s the case, remember to inform this young noble when your face cramps up again. This young noble will definitely treat it for you personally and I will not go back on my words!”</p><br/><p>Feng Mo’s face immediately turned bitter, “This subordinate does not dare.” He then recalled the times when someone tried to escape training by feigning cramps. In the end, Ling Tian personally treated that ‘sick person’ and that fellow truly had cramps all over his body… With such a precedence, Feng Mo would never dare to say that he had cramps in front of Ling Tian even if he had a hundred times the guts!</p><br/><p>Ling Tian snorted and said with dissatisfaction, “Remember to open your mouth when you smile in future. Don’t put on such a bitter expression as though you want to fart but can’t do so. It wouldn’t be good if I think that you have cramps.”</p><br/><p>Feng Mo’s quickly acknowledged what Ling Tian said with a bitter expression and did not dare to say anything else.</p><br/><p>Meng LiGe, Ling Chen and Li Xue leaned on the table as their shoulders trembled… at the same time, Ling Jian also looked at Feng Mo with a sympathizing smile…</p><br/><p>Ling Tian coughed, “Back to the main point. Chen’er, where were we?”</p><br/><p>Ling Chen quickly suppressed her laughter and continued the report.</p><br/><p>As Ling Tian heard about the actions of the three Shui brothers, he could not help but let out a sigh as he thought, <em>Why are these aristocratic disciples all so useless? Could it be that the only thing left of their thousand-year-old inheritance is their arrogance and schemes? </em>He then thought about all the aristocratic disciples which he had met before. It seems as though only DongFang JingLei and Shui QianHuan truly had some capabilities. However, Shui QianHuan was currently on the brink of death…</p><br/><p>“… when the Shui Family launched an ambush against the Yu Family, Ling Chi personally took action to capture the three Shui brothers and they are now our captives. As for whether or not we should hand them over to Shui QianRou, may young noble give us the instruction.”</p><br/><p>After thinking for a moment, Ling Tian said, “Hand them over to Shui QianRou. After all, Ling Chi already made a promise to Shui QianHuan. However, I think that Shui QianRou should only take care of Shui QianHu alone and the other two should be fine. This is also good. If the other two are also dead, things would become boring.”</p><br/><p>Meng LiGe chuckled, “That’s right, these two individuals are our treasures. Them making a scene in the Shui Family will be far better than us trying to sow discord. This may end up becoming a huge aid for our plans to invade Heavenly Wind.”</p><br/><p>Li Xue twitched her lips, “The thoughts of you men are all so vile. Always wishing for a fire to break out in the backyard of other people’s homes before picking up benefits from the side. The two of you can truly bring out the best in each other.”</p><br/><p>Meng LiGe burst out laughing.</p><br/><p>“There is also Miss Shui QianRou. After I brought her back, she regained her consciousness once but was extremely agitated. She was in a state of hopelessness and almost attempted suicide. I could only give her some medicine to calm her mind down and she is currently sleeping.”</p><br/><p>Ling Tian shut his eyes and said after a long while, “I shall go and pay her a visit when she is awake. She is also a pitiful lady.” He then glared at Ling Chen, “Since your plan has already developed to such an extent, you probably wouldn’t let me go if I do not go along with your plans.”</p><br/><p>These were the words that Ling Chen had been waiting for and she quickly agreed.</p><br/><p>Seeing that no one else had anything to report, Ling Chen continued, “When I was chasing after those black-robed men, I found something strange.” She frowned with a vexed expression.</p><br/><p>“Oh? What’s the matter?”</p><br/><p>“The martial arts of those black-robed men were extremely high. If they did not escape in three different directions, it would have been impossible for me to snatch back younger sister Rou. But when I was fighting the black-robed man that I chased, I felt as though he was holding back and could not use his full strength. It was definitely not because he was afraid of injuring younger sister Rou who was on his back.” Ling Chen sat by the side with her brows furrowed.</p><br/><p>“Did you feel as though his inner qi wasn’t weak but his martial skills weren’t complete? He only used half his strength in every move he made?” Ling Tian asked with a profound grin.</p></div>\n</div>"}