{"title": "Chapter 545 - How to Comfort", "id": 545, "volume": 6, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-545-how-to-comfort", "volume_title": "Volume 6", "body": "<h1>Chapter 545 - How to Comfort</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>With regards to the first and third matter, one was extremely brain taxing while the other required a lot of strength. Both of them weren’t easy matters to solve and even the slightest mistake would screw matters up completely. Naturally, Ling Jian’s matter would become the second matter. Ling Tian completely intended to treat Ling Jian’s battle with Li Xue like a show for him to enjoy. It would be like relaxing with a good show after a day of hard work…</p><br/><p>With regards to the battle between the two, even if Ling Tian did not think highly about Ling Jian, it was still necessary to allow Li Xue to force out Ling Jian’s potential. After all, it wasn’t easy to find someone capable of suppressing Ling Jian completely with his current strength. Even if there was, Ling Jian would definitely have to put his life at risk and if something were to go wrong, the losses would far exceed the gains! While Ling Tian would be considered someone who could suppress Ling Jian, Ling Jian would have his hands tied when facing him and would never be able to unleash all of his strength… Furthermore, there was another reason for Ling Tian to agree to this battle. He wanted to see just what level Ling Jian was at so that he knew how to guide him from now on.</p><br/><p>Of course, regardless of whether it was Li Xue forcing out Ling Jian’s potential or allowing Ling Tian to observe Ling Jian’s strength, there was one condition which had to be fulfilled: Ling Jian must definitely be wasted by Li Xue. The only thing that Ling Tian could do would be to control the matter such that Ling Jian’s prestige in the Courtyard would not be affected. Thinking about how Ling Jian had already prepared the goldthread, Ling Tian could not help but laugh. Ling Jian who was so eager for revenge must have definitely prepared a large amount of goldthread. Who knows if he was aware that this goldthread was actually prepared for himself?</p><br/><p>Thinking about how Ling Jian’s valor would land him with a bunch of bruises while ‘enjoying’ his goldthread drink, Ling Tian suddenly felt that life was extremely wonderful. While he was extremely busy right now, there would always be someone in the world suffering more than him. When comparing his plight to Ling Jian, he was naturally in a much better situation… ( )</p><br/><p>Hearing a soft groan coming out from the room, Ling Tian slapped his forehead. <em>Time to get busy! </em>He then hurriedly walked into the room.</p><br/><p>The one who let out the groan was naturally Miss Shui QianRou. Her injuries from the battle weren’t too heavy and she had only overused her inner qi. But after witnessing the repulsive actions of her family’s Elders, she was completely disappointed with the attitude of her family and could no longer see any hope for the future of her family. At the same time, the conviction that she had held onto all her life had also collapsed. Under a state of over-exhaustion, she could no longer battle the demons in her heart and collapsed.</p><br/><p>The fatigued Shui QianRou was struck down by the internal and external assaults of her mind and body. It was also Ling Chen’s mind-calming medicine that allowed Shui QianRou to rest and recover. After a long rest, Ling Tian was certain that Shui QianRou’s situation should be better.</p><br/><p>“It’s you? You’re back?” On the bed, an extremely weak Shui QianRou looked at Ling Tian with shock. At the same time, a trace of joy flashed past her eyes and her face flushed red. But upon thinking about the things that had happened recently her mood could not help but turn dull again.</p><br/><p>“It is me indeed.” Ling Tian walked in with a chuckle, “Miss Shui, we are truly fated. Every time we meet, you would be lying on the bed.”</p><br/><p>Shui QianRou let out a melancholic smile and forcefully lifted herself up as she said in a lonely tone, “Ling Tian, congratulations for coming back safely. You should be very happy to see me like this, right?”</p><br/><p>“That’s right.” Ling Tian dragged a chair over to the bed and sat with his legs crossed. He then looked her through the corner of her eyes, “Especially when seeing someone sink into hopelessness because she had been abandoned by the family that she had devoted her all to. When I see someone incapable of finding hope in their future, I would definitely laugh.”</p><br/><p>Shui QianRou smiled with hopelessness, “That’s right, you have a reason to laugh because you are the victor. Furthermore, you have successfully escaped from the number one expert in the world and shocked the world with your name. I believe that there wouldn’t be anyone in the world that you don’t dare to laugh at. I… should I congratulate you?”</p><br/><p>“I accept your congratulations, even if you are not sincerely congratulating me but ridiculing me.” Ling Tan looked at her with a smile, “But I will treat it as an abandoned person being envious and jealous of a victor.”</p><br/><p>“You!!!” Shui QianRou sat up in anger with the intention to curse at Ling Tian but just did not know what to say. She then collapsed back into bed and said with a disheartened tone, “I wouldn’t dare to be jealous. However, young noble Ling’s accomplishment is truly worthy of my envy.” As she said that, she turned away from Ling Tian and faced the wall as a tear rolled down her cheek. She refused to show Ling Tian her weakness.</p><br/><p>Ling Tian laughed coldly but his tone suddenly became gentler, “There is someone who was betrayed by his friend and abandoned by his family and loved ones. He was left with nothing and was injured in both body and spirit. A few days later, his parents were harmed by their enemies and also passed away,” Ling Tian said with a tinge of mockery. At this moment, he actually began telling Shui QianRou a story.</p><br/><p>Shui QianRou didn’t know what Ling Tian’s intention was but upon hearing the words betrayed and abandoned, she thought that Ling Tian was trying to describe her. With a grunt, she turned around and covered her ears refusing to listen to Ling Tian. However, even when she covered her ears, Ling Tian’s voice still entered them clearly. “As such, this person experienced all the misery of life and was filled with hopelessness in his heart. He cried every day, every night, every month and every year. Apart from eating, he did not do anything else but cry. In the end, after crying for a few months, he actually had a huge harvest. Can you guess what his harvest was?”</p><br/><p>Shui QianRou snorted and felt that Ling Tian was just too irritating. To think that he would actually mock her at such a moment. He was far too ungentlemanly!</p><br/><p>She then heard Ling Tian feigning shock. “He cried every day and not only did his friend return, his friend even paid him back for all his losses and apologized to him earnestly.”</p><br/><p>“Ah?” Shui QianRou turned around and was filled with incredulity.</p><br/><p>“The moment he realized that crying was effective, he continued to cry every day. All of a sudden, even his family accepted him and even allowed him to become the Family Head. At the same time, his lover also returned to his side and everything returned back to normal.” Ling Tian said with a serious expression.</p><br/><p>“…” Shui QianRou’s mouth widened in speechlessness.</p><br/><p>“Seeing the effectiveness of crying, he cried even harder.” Ling Tian continued, “Finally, after half a year of crying, even his enemies died from his crying and his parents who had died actually came back to life. His parents then enjoyed their old days in peace with the company of him and his family…”</p><br/><p>“Nonsense! How is this possible? How can the dead come back to life?” Shui QianRou was exasperated. It turns out that this fellow was only teasing her. “What is the point of crying? Ling Tian, do you treat me as a fool?”</p><br/><p>“Perhaps crying may be useless for him, but if Miss Shui continues crying, all your wishes would definitely come true.” Ling Tian said with all seriousness.</p><br/><p>“Ah…” Shui QianRou glared at Ling Tian and was completely dumbfounded.</p><br/><p>It turns out that this fellow was only going a large round to try and comfort her. However, his method of comforting her was truly unique… After almost angering her to death, he came up with some weird story and force her to comfort herself at the very end. Ling Tian was truly too crafty!</p><br/><p>However, she had to admit that this method of his was extremely effective!</p><br/><p>Shui QianRou smiled with tears in her eyes before suddenly bursting out into tears again. However, there was a dense feeling of joy in her heart this time.</p><br/><p>With her tear-filled eyes, she could see that Ling Tian was still looking at her. However, there wasn’t a hint of mockery or ridicule in his eyes. There was only peace and even a trace of… tenderness?</p><br/><p><em>Facing a beauty in distress, I am filled with tenderness!</em></p><br/><p>It was enough! Shui QianRou was satisfied! <em>It turns out that he does care for me… he doesn’t hate me… he is here to comfort me…</em></p><br/><p>Shui QianRou suddenly felt extremely rich and full in her heart. After the two of them been through so much, and after Shui QianRou had given up all hope, this sense of peace in her heart far exceeded any form of comforting words. Could she even dream for Ling Tian to show her love the moment he came? If that was the case, Shui QianRou would probably be even more afraid…</p><br/><p>It was only through such a way that Shui QianRou would know that the other party wasn’t taking pity on her or giving her charity. Instead, he was sincerely trying to guide her out of her sea of bitterness.</p><br/><p><em>That’s right, the family has already regressed to such a state. I am truly devastated, in despair and in disappointment. Even if I were to die disheartened, what is the use of that? Elder brother has already been sacrificed because of the family and I do not want to become the next sacrifice!</em></p><br/><p>Shui QianRou smiled secretly and upon seeing Ling Tian still looking at her, she could not help but turn her face in embarrassment and cover her face with her hands. “What are you looking at? Do I look very… ugly right now?” As she said the last few words, she began stammering as though she was afraid of the answer. With the knot in her heart finally untied, a lady like her would naturally care about her appearance.</p><br/><p>“Err… ah?” Ling Tian was taken aback. He never imagined for this lady in front of him to have such a swift change in her mood. He was still wondering if she had thought through things and never imagined that Shui QianRou would ask him such a question shyly. He could not help but be dumbfounded for a moment.</p><br/><p>“You fool!” Shui QianRou said with displeasure, “I am asking you if I look very ugly right now.”</p><br/><p>Ling Tian then studied her carefully and nodded with honesty, “Mmm, extremely ugly. If you continue crying, you will be even uglier! You will not be able to meet anyone!”</p><br/><p>“You!!!” Shui QianRou blew up. “Scram!”</p><br/><p>“Ah?” Ling Tian cried out in protest, “I was only speaking the truth.”</p><br/><p>“Scram! Who wants to hear your stinking truth?” Shui QianRou was completely incensed. Her eyes were wide open and she had a ferocious expression as though she wanted to swallow Ling Tian alive. At the same time, it seemed like just scolding Ling Tian wasn’t enough and she grabbed the things by her side and began throwing it at Ling Tian. Very quickly, clothes, pillows, candle holders… various ‘hidden weapons’ flew towards Ling Tian unceasingly.</p><br/><p>Ling Tian blocked the first wave of clothes but the attack of the other party was far too ferocious. Being unable to block the incoming flurry of attacks, his head was covered by something and he could only turn around and flee. Just when he escaped from the room, he heard a ‘dong’ sound and something was smashed onto the door.</p><br/><p>Ling Tian let out a sigh and took off the cloth covering his head. Upon taking a look at it, he could not help but be dumbfounded. It was soft, silky and white… It was actually a lady’s undergarment that still had the lingering fragrance of its owner…</p></div>\n</div>"}