{"title": "Chapter 554 - Decisive Battle Begins", "id": 554, "volume": 6, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-554-decisive-battle-begins", "volume_title": "Volume 6", "body": "<h1>Chapter 554 - Decisive Battle Begins</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>For such a scenario, if Xiao YanXue were to actually question Ling Tian, he probably would not be able to answer either. In real life, achieving such wealth through official channels wasn’t actually possible. If Xiao YanXue found out that the most infamous bandit groups within Heavenly Star all belonged to this Young Noble Ling, then she wouldn’t be so surprised anymore!</p><br/><p>As for saying that nobody was corrupt, what was supposed to be an impossibility could also become a possibility if you were like Ling Tian, instilling all sorts of loyalist mentality into them since they were young. Just look at Ling Jian, Ling Chi, Ling Twenty, XiMen Sa, and the rest, and nobody would find it astonishing!</p><br/><p>With this group of cold-blooded killers staring like loyal tigers at the Ling Family’s businesses, even if one person wanted to stuff their pockets, they would also need to reconsider if their heads were rooted and steady. Everyone present was clear on Ling Tian’s ruthless methods, as well as his strictness towards his subordinates. Nobody dared to commit the heavenly crime of going against his authority!</p><br/><p>In actuality, the humongous funds inside the Ling Family Courtyard not only came from their scattered businesses such as hotels and gambling dens all over the continent, but a large portion was also obtained through robbing. This sort of ‘business’ had no startup cost and was naturally more profitable since all income was pure profit. This was to the point that under the urging of the insatiable Ling Jian, they had repeatedly ‘practiced’ their operations, achieving a large and unimaginable bounty!</p><br/><p>What was meant by ‘practice’ was actually auctioning off the items that they had stolen, then after collecting the money, stealing them again so they could sell them off once more…</p><br/><p>Naturally, this sort of behavior was quickly halted by Ling Tian, or else that Boss Tian’s… no, it should be Boss Ling Tian’s, number two man would probably have created something unspeakable in the future…</p><br/><p>Under this sort of frightening speed in collecting funds, the financial resources under Ling Tian naturally ballooned up like a ball being inflated. Every day there would be a few bandits dressed up as businessmen bringing in a few carriages worth of loot… Naturally, under this sort of speed, even if you were a serious professional you would need to work night and day to barely sort things out. If a group of old men was tasked to account for these things in the warehouse, it would definitely end up as a mess, and the accounts would be in a similar mess.</p><br/><p>Even though Chu Ting’er had sent thousands of professionals over to maintain the foundation and integrity of the business, and was still sending over large numbers of personnel each year, compared to the needs of the Ling Family Courtyard it was as good as pouring a cup of water onto a cart of burning firewood. This was especially so for the large expansion the Ling Family Courtyard was undergoing, as well as their conduct of inhaling large amounts of military supplies and food. It practically multiplied year after year, causing the place to be severely understaffed! A bunch of uneducated old men had to unwillingly begin to take up this complicated work…</p><br/><p>Ling Tian naturally knew that with his meager influence at the start as well as his family’s superficial foundations, he could not actually fight against the huge Xiao Family. Going through proper channels to amass money would be considered a fool’s dream. The moment the Ling Family Courtyard was built, he sent out all the Blood Iron Warriors to “make money”. All dynasties in the world had amassed money that was reeking in blood, and even for Ling Tian who had two lifetimes of experience, it was no different…</p><br/><p>This was also why Ling Tian had practically excavated the entire Mount Victory to turn it into several hundred large storerooms…</p><br/><p>When Xiao YanXue first understood the nature of Ling Tian’s business, other than fright and shock, she also felt panic and could not believe it. She found it utterly unbelievable!</p><br/><p>To think that Ling Tian’s concrete details would be so frightening, so atrocious!</p><br/><p><em>Grandpa, you were right in your judgment about Ling Tian, but why did you not follow through? The Xiao Family will face this huge hoodlum soon enough, and maybe even the number one financial magnate in the entire continent will vanish into smoke!</em></p><br/><p>While she had long considered herself as Ling Tian’s woman, but upon understanding his financial ability and internal information, she could not help but worry for her family. She was extremely clear that this involved not only financial ability but also military affairs. If that was the case, then how strong was his military force? And what about his intelligence force, which had never been revealed yet?</p><br/><p>She did not even dare to continue pondering.</p><br/><p>Not out of Ling Tian’s expectations, only an hour had passed when he heard the same Old Tie shuffle past in dejection, while mumbling dispiritedly to himself. After Xiao YanXue had looked at his accounts, she had immediately thrown them into a corner before lecturing him ruthlessly and commanding him to alter this and that and had even set a time limit for him. For someone who only knew how to use his fists, having a sword chop off his head would be better! No wonder that the five huge men that walked out previously looked as though they were holding a funeral…</p><br/><p>Ling Tian however would naturally not care about such things. He only set down an order, that all finance related matters would be taken over by Xiao YanXue, and everyone needed to comply without questions. If there were violations, they would be taken care of using martial law!</p><br/><p>It was precisely because of this order that left the bunch of lawless men all screaming in misery. Where was their justice?! To let them plunder, kill, conquer lands, that wasn’t a problem, but these little scribbles on the accounting books were difficult beyond belief. Furthermore, their thick fingers which were akin to carrots could not even hold the slender brush properly, let alone write!</p><br/><p>From behind him, the door softly creaked open, and when he turned around, Ling Tian saw Ling Chen slightly frowning as she bashfully bit her lips, standing red-faced by the entrance of the door. After the extreme joy she went through last night, the Ling Chen who was completely bereft of strength revealed her most resplendent charm, much like a Chinese crabapple slowly blossoming, full of grace and maturity. The glance Ling Tian casually gave made him stand stock still, and little Ling Tian leaped up at this time, signaling his intention to continue his expedition!</p><br/><p>As though sensing his fiery gaze, Ling Chen rolled her eyes at him, half in joy and half in annoyance, her face turning scarlet.</p><br/><p>A satisfied feeling rose from the depths of Ling Tian’s heart. Knowing full well that his lover could not take much more, he suppressed little Ling Tian, and was about to speak, but was interrupted by two people flying from different directions.</p><br/><p>The figure in white had with black hair cascading like a waterfall, her figure graceful like the willow; while the other was dressed in black, straight as a sword, his eyes shooting out ice cold killing intent!</p><br/><p>Both sides clashed with their gazes in mid-air, and it was as though two swords just clashed and created sparks.</p><br/><p>Li Xue, Ling Jian!</p><br/><p>The two of them were finally here!</p><br/><p>Ling Tian saw how Ling Jian’s hands held a small bag, and a weird expression appeared on his face. If he was not wrong, that should be the Chinese goldthread <sup>1</sup> that Ling Jian went to painstaking lengths to search for.</p><br/><p>The two of them stared at Ling Tian together, their eyes shooting out strong battle intent.</p><br/><p>Ling Jian turned to look at Li Xue, shooting out a cold smile as he said, “For today’s battle, I just ask for it to be satisfying!” As he spoke, he threw out his hand, and the bag landed and opened, showing over a dozen big and small goldthreads! Ling Jian smiled coldly in and in an arrogant manner, “This will be our bet!”</p><br/><p>“Whoever loses will have to boil these goldthreads in water and drink nine bowls consecutively!” Ling Jian crowed. Looking at Li Xue, he seemed to already imagine that hateful woman pinching her nose and drinking bowl after bowl. This filled him with unprecedented glee.</p><br/><p>Ling Tian sighed as he looked at Ling Jian, “Ah’Jian, won’t you reconsider? Fighting with a woman, is it glorious even if you win? And how many goldthreads are there? Can you really bear to force them down her throat?” His eyes were directed towards Ling Jian, yet he was already sending meaningful glances towards Li Xue, telling her that since she had tortured Ling Jian throughout their entire journey back, shouldn’t she show mercy this time around?</p><br/><p>Ling Jian nodded his head as he resentfully spat, “Young Noble, it’s not that I’m bullying the weak. You don’t know about this, but the amount of goldthread I ate throughout the journey back can be compared to all these here. She actually took advantage of my precarious position, so how can I not return this favor?!”</p><br/><p>Li Xue’s face seemed to be a little nervous as she said, “Ah’Jian, you seem to have prepared a few too many goldthreads. Why don’t we reduce the amount by half?”</p><br/><p>Seeing this, Ling Tian found it unexpected, ‘What was going on with this great demoness today, that she suddenly would show such kindness? She seems to really be showing me a lot of face. Half is not too bad, let me help and see how much more I can reduce for Ling Jian.’ He added on immediately, “Yes, it’s indeed too much, even half is too much, how about… one-fifth? Maybe one-tenth would do too!”</p><br/><p>Ling Jian bowed as he replied, “Young Noble, I know you have protective feelings for the fairer sex, but do you know, how vicious this Miss Li was, how much she tortured me along the way?!” Turning his head, he icily stared at her as he hissed, “Now you’re scared? What did you do in the past, didn’t you think of this when you tortured me in the past!”</p><br/><p>Ling Tian stared, a little dumbfounded. <em>How could I not know Li Xue’s frightening ability? I should be asking if you understand how truly frightening she is instead. How could this lass ever be kind? This is just basically pushing you towards a trap full of spikes for you to fall in to! People are pushing you in, yet you are not trying to fight back or dodge, and instead go with the momentum and jump into the trap, are you a fool?!</em></p><br/><p>The originally worried face of Li Xue suddenly took a 180 degree change as she exclaimed, “Young Noble Ling, see, I was trying to help him by giving him a chance, but he doesn’t want to accept it! I have no choice, do I?” Ling Tian only rolled his eyes at her. Others might not know, but how could he not be aware of her methods? Wasn’t this the archetype of a conveniently obedient person?</p><br/><p>Li Xue followed closely with another sentence, “Ah’Jian, are you prepared?” Ling Jian only straightened and snorted deeply, retorting, “Miss Li, are you prepared to drink the goldthread water?”</p></div>\n</div>"}