{"title": "Chapter 597 - Justice Negotiates", "id": 597, "volume": 6, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-597-justice-negotiates", "volume_title": "Volume 6", "body": "<h1>Chapter 597 - Justice Negotiates</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Upon reaching the scene, he originally had the thought that to act would be humane, but not to act would be the logical choice. But if he chose not to act, then his conscience would never allow him to live with it. Furthermore, he had already given the Heaven Splitter to Ling Tian, which meant that they were now in the same camp. If he were to be a passive bystander as Ling Tian’s people died, Justice would not feel comfortable in his heart. Even if he could somehow persuade his conscience, he could not ignore the heroism of Ling Feng and Ling Yun, and of course, he would not wish for the beautiful flower Ling Chen to die!</p><br/><p>In fact, there was still another reason that could not really be considered a reason. It was if Ling Tian were to come back and find that he didn’t lift a finger to help, with his temper, he would take his anger out on everyone related. Who knows, the entire Beyond Heavens might actually be flattened by him alone! Justice believed that if Ling Chen and the rest were to die, then Ling Tian would not be above doing such a thing. After all, other than himself in Beyond Heavens whom he could not deal with, the rest would not require much effort from him!</p><br/><p>However, if he were to take action and help, then Justice would feel indignant. How lowly to have a brat slander you, but you still had to save his wife and his brothers…. Isn’t that as good as not having anything better to do? So long as Justice existed, even if Ling Tian wanted to take his anger out on Beyond Heavens, he could not do so!</p><br/><p>As such, to conclude, Justice himself didn’t know what kind of feeling he was supposed to have now. He was totally confused, as though he was thrown in a mixed spice warehouse. Even he did not know just how much he cared about Ling Tian but did not wish to see him go insane.</p><br/><p>Looking at the important figures of the Ling Family Courtyard slowly walk behind him one by one, he realized that he had become some sort of protective deity or a shield. Justice could only let out a bitter smile as he thought, D*mmit, I’m being pulled onto the pirate ship of that brat Ling Tian once again. Furthermore, it seems like I boarded it willingly this time…</p><br/><p>On the other side, Lei ZhenTian let out an astringent smile as he commented, “No wonder! This old man always found it strange how the undefeated Martial Order Head actually could not kill Ling Tian. So it turns out that you guys are already in cahoots! Beyond Heavens has also decided to come out of seclusion? And your candidate is Ling Tian, right?!”</p><br/><p>Having said this, Lei ZhenTian suddenly burst into laughter as he venomously gazed at Justice, spitting out, “What a good Martial Order Head! What a good Martial Order Medallion! To actually make a fool of the entire world like this. Justice, oh Justice, the thousand year reputation of the Beyond Heavens has been wiped clean by you alone today! Haha… the Martial Order Medallion, which is treated as a treasure beyond all others by Emperors, actually turned out to be a joke! How laughable! Haha, hahaha….”</p><br/><p>Justice’s expression did not change, however, instead staring at Lei ZhenTian and passively asking, “Lei ZhenTian, are you trying to infuriate me? Haha, my Martial Order Medallion may not be able to kill Ling Tian, but to annihilate your entire Lei Family is still something I can achieve. Why don’t you give it a try?”</p><br/><p>Lei ZhenTian’s body trembled at that sentence, and he was struck speechless for a while. Justice’s words were clear, that even the entire Lei Family was incomparable to Ling Tian himself. Even with the entire influence that the Lei Family possessed, it still was not comparable to Ling Tian’s own power! Furthermore, Lei ZhenTian had already woken up from his self imposed anger, and he realized that let alone after the damage done to the Lei Family during this assault, even if they were at their peak strength they still could not afford to infuriate Justice! In the past, the Yu Family was also a hegemon but still chose to swallow the insult given by Justice. So how could he even enter the eyes of Justice?</p><br/><p>The sound of hoofbeats sounded, heralding the arrival of more troops, and the Lei Family’s second Master brought over 500 of the Lei Family elites to rush over to the Ling Family Courtyard to reinforce the Lei Family. When the Ling Family sentries moved to obstruct them, Ling Chen came to her senses and commanded them to disperse and let them in instead.</p><br/><p>She was very clear that when facing these experts of the Lei Family, that no matter the number of fully armed ordinary soldiers, they would all just be sent to their deaths. So long as Justice was standing guard here, the Ling Family Courtyard would currently be safe, and in the unlikely event that if Lei ZhenTian did not care and was willing to fight till either the fish died or the net split, then having all her troops gathered in one area would be better. Since that was the case, why not allow them to enter, and settle everything face to face? After all, their situation now was already far better than before, and they might be able to hold on until Ling Tian returned.</p><br/><p>In addition, Ling Chen’s heart still hid another idea. Right now, Lei ZhenTian already had a hint of restraining fear towards Justice and did not dare to attack. But if the newcomers did not get the situation right and rashly attacked, they might form an irreconcilable hatred with the world’s number one expert. By then, the Ling Family would not even need to lift a finger for the entire Lei Family to be destroyed, how ingenious….</p><br/><p>But Ling Chen had in truth trapped herself into a wrong logical sequence. True, Justice possessed exceptional martial talent and be it any scenario of killing the Lei Family’s elites, it would be a simple task. But right here was over 2000 experts of the Lei Family! The Ling Family Courtyard was already at the end of their flight. If Lei ZhenTian were to ignore all consequences and command the attack, then even if Justice were to take his head, everyone from the Ling Family, including Ling Chen, would all have to be buried with him at this place!</p><br/><p>A pity, that Lei ZhenTian was just like the Yu ManLou of the past, treasuring his life too much…</p><br/><p>The Second Master Lei ZhenPeng came over to his brother’s side with a perplexed expression, staring blankly at him as he said, “Big brother, with such a good position, why did you stop? Even if you want to recruit them right now, what’s the use?” Lei ZhenPeng could see clearly that most of the people in the Ling Family Courtyard were either injured or crippled and did not have much fighting strength left, all clustered before his elder brother. Furthermore, there were even some severely wounded people in their surroundings, and it would be said that it was a complete wipeout. But his elder brother had already stopped the assault, this was preposterous! Even if one were to talk about stopping hostility for friendship, at this point, it wasn’t too suitable, right?</p><br/><p>Lei ZhenTian hatefully sighed as he replied, “How would I not know? We could have succeeded, but to think that at this critical juncture, the Beyond Heavens Sect’s Justice just had to appear to intercede for them, not compromising at all, thus we are stuck in this situation. How goes your side?” A sense of hope sparked inside him, as he thought that even if he failed to obliterate the Ling Family Courtyard today, so long as he managed to crush the main residence of the Ling Family, Ling Tian would still receive a terrible blow.</p><br/><p>Lei ZhenPeng, unfortunately, shook his head in depression as he replied, “Don’t talk about it, I invaded the Ling Family only to see over a hundred servants of the family, but not a single one of the core figures. In my fury I set fire to the entire place, burning the residence to kingdom come.” At this point he suddenly realized something and jerked, “Justice? Martial Order Head? Why would he appear here, wasn’t he killed by Ling Tian?”</p><br/><p>Lei ZhenTian did not reply, only looking at the corpse of his son lying on the ground, revealing unspeakable anguish.</p><br/><p>“XiaoSong! He….” Lei ZhenPeng’s body shook from the realization, and looking at the body of his nephew, his mind went blank as tears slid down his face. Suddenly, he turned and walked out with large steps, staring dead at Justice as he bit off word by word, “You’re the Beyond Heavens Martial Head, Heavenly Justice?”</p><br/><p>Justice did not even deign to reply his words, as though he was spouting nonsense. If I’m not the Martial Order Head, then would it be you instead? What bullsh*t.</p><br/><p>Lei ZhenPeng’s glare became more vicious, and in his anger he shouted, “This master is talking to you, are you mute?!”</p><br/><p>“Pa!”</p><br/><p>Peng!</p><br/><p>A faint killing intent surfaced on Justice’s face, and a white handkerchief suddenly appeared in his hands . He slowly wiped his hands as his incisive eyes stared at Lei ZhenPeng who was knocked back by him, as though he was a ruler looking down upon his subjects.</p><br/><p>Just now, no one was able to see anything clearly, and they only saw Justice’s figure blur a little before the “pa” sound was heard. The next thing they knew, Lei ZhenPeng had already flown backward, spinning once in midair before smacking on the ground like a rag doll. When his mouth opened, five or six teeth were spat out.</p><br/><p>This Second Master of Lei Family was considered a first-rate expert of the current era, but actually could not even see how Justice moved! Seeing him lying on the ground like a dead pig, everyone’s eyes widened in shock!</p><br/><p>Lei ZhenTian slowly put down his son’s corpse, standing up and gazing at Justice with a venomous look. His eyes were cold as he spoke, “Justice, are you insistent upon being the roof to shield all of the Ling Family today?”</p><br/><p>Justice only let out an indifferent smile, as he mocked, “The Lei Family is also considered one of the influential families of this current age, not to mention the reputation that the Lei Family Head possesses. However, they actually came over to flaunt their influence while the true owner of the Ling Family was not around. This sort of behavior is something that this seat cannot tolerate. If you have some hidden grudge with Ling Tian, then I of course understand, since all enmities must be solved! However, your two families are just like the first and last of eight poles strung together, never ever touching each other, so for you to do such a matter as attacking them is really food for thought.”</p><br/><p>After mentioning this, Justice slightly lifted his head, and two piercing rays shot onto Lei ZhenTian’s face. “Could it be that the high and mighty Lei Family Head actually does not dare to face Ling Tian at all? With the identity of Family Head, to actually not dare to face an opponent?! I seem to have overestimated Family Head.”</p><br/><p>Lei ZhenTian’s face turned red and he replied, “In the past, I had no hate, but it doesn’t mean that it is not so now. Martial Head, my only son by birth has lost his life in the midst of the Ling Family, and I cannot exist under the same heavens as the Ling Family! This is an irreconcilable hatred! The Lei Family truly does not wish to make an enemy out of Beyond Heavens, and I beseech Martial Head to compromise, that so long as this Lei can get revenge for his son’s death, then I will immediately retreat, and will owe you a favor on top of that, not daring to disobey any order of yours.”</p><br/><p>Right now, Lei ZhenTian was still unaware that his three greatest experts, the three deacons in his family, had already left for the heavens, or else he might really go insane…</p><br/><p>“Take revenge for your son’s murderer?” Ling Chen coughed lightly twice, before angrily staring at Lei ZhenTian. “To think that the Lei Family Head whose name is known throughout the world is actually just a person who fiddles with the truth and changes black to white! If your Lei Family did not come to invade my Ling Family, how would your son die here? The matter was caused by your Lei Family, and your son dying is considered an act of karma! Furthermore, the blood debt that your Lei Family owes our Ling Family has not been washed clean. The fresh blood of the Ling disciples has to be paid back double by your Lei Family!”</p></div>\n</div>"}