{"title": "Chapter 614 - Training", "id": 614, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-614-training", "volume_title": "Volume 7", "body": "<h1>Chapter 614 - Training</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Even when Yu BingYan was forced into a pathetic state by the attacks of the other two ladies, she was still able to maintain her natural elegance. Justice was certain that this elegance was already a part of Yu BingYan, every inch of skin and every drop of blood was deeply rooted with this elegance!</p><br/><p>Justice believed that even if Yu BingYan died a tragic death right now, she would be able to maintain her high-class disposition! Such an elegance was something that she was born with and it was impossible for someone to erase. Even the heavens wouldn’t be able to take it away!</p><br/><p>Li Xue launched a few attacks and forced Yu BingYan into retreat. Yu BingYan quickly retracted her moves expressionlessly.</p><br/><p>Ling Chen and Li Xue’s education methods were extremely different. This was something that Yu BingYan could clearly feel.</p><br/><p>When Ling Chen unleashed a few moves that Yu BingYan wasn’t able to deal with, she would stop to give an explanation. As she analyzed the moves one by one, she would have a smile on her face and would never show any impatience. She would only stop when Yu BingYan fully understood her teachings.</p><br/><p>As for Li Xue… it was no different from torture.</p><br/><p>She would usually send out a couple of moves that Yu BingYan was completely unable to block and could only retreat. Then, Li Xue would stop and allow Yu BingYan to reflect on the moves on her own but she would never provide Yu BingYan with any pointers. After a short moment of reflection, Li Xue would take action again and she would use the same three moves again. If Yu BingYan still couldn’t block the moves, Yu BingYan would end up suffering for sure. She would then allow Yu BingYan to take a short break to ponder over the weaknesses of her move. After which, it would be the same three moves again. If Yu BingYan still couldn’t block the moves, Yu BingYan would suffer greatly.</p><br/><p>Li Xue didn’t intend to show Yu BingYan any mercy at all. Only when Yu BingYan was able to block the three moves of hers completely would the torture end. However, a new round of training would follow closely…</p><br/><p>With such a training method, Yu BingYan’s improvement was undoubtedly huge. She would always be in a tense mental state and her understanding of the various martial arts moves also deepened. At the same time, she also became more and more familiar with the usage of her inner qi.</p><br/><p>Ling Chen was aggrieved.</p><br/><p>She tried her best to use a gentle method to teach Yu BingYan and wouldn’t be frustrated at the need to repeat her explanations. However, whenever Yu BingYan used the moves she taught to deal with Li Xue, it would be completely useless. On the contrary, the moves that Yu BingYan conceived under Li Xue’s pressure would be extremely effective when dealing with her. This made Ling Chen feel a huge sense of defeat.</p><br/><p>She had already tried dozens of different methods to educate Yu BingYan. Before she taught Yu BingYan, she would have to first prepare the lesson carefully and plan out what she wanted to do in detail. Yu BingYan wasn’t the only person who was fatigued, even Ling Chen who was the teacher was also extremely exhausted.</p><br/><p>As for Li Xue, she would always have a stern expression on her face and only used the simplest and most violent method to force Yu BingYan to learn. In spite of that, Li Xue produced more results than her! Why was this so? Why would this happen?!</p><br/><p>During the training, Ling Chen could clearly feel that Yu BingYan enjoyed her teaching method and rejected Li Xue’s teaching method. However, the effect of this method which she rejected was even more effective than one which she enjoyed!</p><br/><p>It was truly strange!</p><br/><p>Ling Chen was completely puzzled.</p><br/><p>As though she could tell what Ling Chen was puzzled about it, Li Xue asked with a smile, “Do you think that it is extremely strange?”</p><br/><p>Ling Chen laughed bitterly and said weakly, “It isn’t just strange! It is bewildering! Why would this happen?”</p><br/><p>Li Xue chuckled, “There is a saying that goes ‘a tune taught by others shouldn’t be sung’. In the martial arts world, this logic is extremely important!”</p><br/><p>“A tune taught by others shouldn’t be sung?” Ling Chen muttered under her breath, “What do you mean?”</p><br/><p>“What a good ‘a tune taught by others shouldn’t be sung’! What a good logic!” Justice walked over with a look of praise on his face, “This phrase divides the grandmasters from the ordinary martial arts practitioners in the world!” Justice shook his head with a sigh and looked at Li Xue, “Lass, you aren’t simple!”</p><br/><p>Li Xue replied with a smile, “Senior is over-praising me.”</p><br/><p>“Ling Chen knows that senior’s martial arts are unfathomable. May senior guide me.” Ling Chen seemed to have understood something but yet the thin veil in front of her was still present. She gave a respectful bow towards Justice. Ling Chen knew that Justice’s martial arts were peerless in the world and with an otherworldly expert in front of her, she would be a fool if she doesn’t seek guidance from him!</p><br/><p>“The logic in those words are simple. While your teachings are extremely detailed and comprehensive, your brilliant teachings are also the reason for her inability to learn. Even if she learns everything you teach, all of these come from you and do not belong to her. Do you understand what I mean?”</p><br/><p>Justice chuckled, “On the contrary, this lass does not bother explaining anything and allowed that Yu Family lass to ponder over the mysteries of each move on her own and seek a method to defeat them. This would allow her to find her own path. This path would be one that belongs to her completely. On this path, she would be the founding grandmaster and she would be far clearer on what she should do than anyone else. In fact, she would be able to walk freely on this path. Although it was forced out of her, it still belongs to her. Thus, the effect far exceeds your teachings. If you really want this Yu Family lass to accomplish much on her martial path, it is best for you to let this lass grind on her alone!”</p><br/><p>“Senior is indeed wise. This junior has received your teachings!” Ling Chen came to a realization.</p><br/><p>“That’s right, this is indeed the case!” A clear voice sounded and a suave figure appeared before all of their eyes. He was dressed in snow white robes and had a golden crown on his black hair. On his waist, a light green belt was fluttering in the wind. Ling Tian had finally finished his seclusion.</p><br/><p>“This is akin to an author writing a novel but being stuck halfway with no ideas. At this moment, he can only rely on himself. If he seeks help from his friends and his friends give him another idea, while he would be able to continue the story, he would face a bigger barrier when he reaches the end of that idea. In fact, his book may become trash halfway through because of that. Why is this so?”</p><br/><p>Ling Tian looked at the others with a smile, “Because that idea wasn’t his own but belonged to someone else. It is impossible for everyone’s thinking to be the same. If I am able to think of this idea, I would be able to continue it. But if you want to continue on my idea, you would realize that it is an extremely difficult task. When it is joint together with what your idea at the start, it would be an even bigger mess. That would then be the beginning of a tragedy.”</p><br/><p>Everyone nodded their heads and fell into deep thought.</p><br/><p>Ling Tian then turned to look at Ling Chen and said with a doting smile, “In fact, Chen’er’s education method isn’t entirely wrong. It is probably the best method for educating anyone else. However, it is completely useless today. Do you know why?”</p><br/><p>Ling Chen looked at Ling Tian and shook her head in confusion. Why did Ling Tian say that it was useless then said that it was useful? Just what does he mean?</p><br/><p>“Because you chose the wrong target. BingYan is a brilliant lady and has a wealth of martial arts knowledge. Your teachings are far too detailed and you obstructed BingYan from displaying her own wisdom. The more detailed your teachings, the more BingYan would learn, but the more you would restrict her. Li Xue, on the other hand, is able to dig all up all of BingYan’s hidden potential and allow her to think about how she should solve the problem on her own. With BingYan’s wisdom and knowledge, she definitely has the ability to do so. Thus, Li Xue is helping BingYan to break through her limits and increase her strength!”</p><br/><p>“Of course, if BingYan was an idiot who would never be enlightened, then even if Li Xue forces her to become crazy, she wouldn’t be able to understand anything.” Ling Tian smiled gently, “Thus, while Li Xue’s education method seems simple, it is the best method to educate BingYan. While Ling Chen’s education method is meticulous, it isn’t meaningful to BingYan.”</p><br/><p>Ling Tian paced around twice then said, “This is the meaning of adapting your education philosophy.”</p><br/><p>“If a teacher isn’t able to adjust his education method based on his disciple’s strengths, his disciples would never be able to shine. Even if his disciple was a genius, the teacher would only be able to educate another copy of himself! Of course, Li Xue’s method won’t be useful to everyone. For example, if Li Xue tried to use this method on four simple-minded boorish men, even if she tired the four of them to death, they might not be able to gain any insights. Similarly, if you used your current method to educate a bunch of talents like BingYan, these talents would only become ordinary.”</p><br/><p>Ling Tian then concluded, “There isn’t a method that is flawless and a method that is useful for one individual may not be useful to another. This is something that all of you must remember. Regardless of whether or not you are teaching disciples or any other things, you have to always consider different methods and use the most effective method to achieve your goal.”</p><br/><p>As he said those words, everyone fell into deep thought.</p><br/><p>Justice was by the side with a solemn expression on his face as he looked at the sky silently. He understood what Ling Tian had said and when he understood this logic, Ling Tian wasn’t even born yet. However, how could a young teen who wasn’t even 20 analyze this matter so deeply? Justice saw Ling Tian in a different light again. This brat is indeed my strongest opponent!</p></div>\n</div>"}