{"title": "Chapter 627 - Heart Attacking Blade", "id": 627, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-627-heart-attacking-blade", "volume_title": "Volume 7", "body": "<h1>Chapter 627 - Heart Attacking Blade</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Fighting during winter is the biggest taboo in warfare. Especially trying to siege a city during winter as it was a battle that would be lost for sure! Even if one had ten times the number of soldiers than the defending party, it would be impossible to successfully take down the city during the winter. Furthermore, the target of their attack was the Heavenly Water Ravine Pass! This was akin to a suicidal battle! So what if you had two million soldiers?!</p><br/><p>Especially after hearing the words ‘my Ling Family’s Heavenly Water Ravine Pass’ coming out from Ling Tian’s mouth, Xiao FengYang’s mouth could not help but cramp up.</p><br/><p>After a long while, Xiao FengYang finally came to his senses and shook his head. “I don’t believe you. My brother also knows the art of war and will not make such a foolish decision. You are definitely lying to me.”</p><br/><p>Ling Tian chuckled, “Second Master Xiao is a grandmaster in the art of war and it is only natural for you to not believe me. However, whether or not you believe my words isn’t very important anymore. I am not trying to convince you but am only informing you. Besides, you are already my captive and what good would it do for me to lie to you? Do you truly think that you will be able to leave this place? Oh, one more thing. I heard that the overall manager of the army is Sect Head Meng QiHun of Above Heavens and all the experts under him moved out this time. It seems like this Sect Master Meng truly hates me to the bone.”</p><br/><p>Ling Tian then teased, “Are you interested to know my arrangements? If you are, I am very willing to share them with you!”</p><br/><p>Hearing that the overall manager of the army was the Above Heavens Sect Head together with the fact that Ling Tian even knew the name and origins of the Above Heavens Sect Head, Xiao FengYang began to believe what Ling Tian said. Above Heavens had always wanted authority in the Xiao Family army but Xiao FengYang had always been wary of them. Without him around, if Above Heavens truly held onto the military authority of the Xiao Family, their Xiao Family would no longer be of any worth to Above Heavens. When he was captured in defeat, Xiao FengYang already knew that Above Heavens would take this opportunity to take advantage of the Xiao Family. Now that he heard it from the mouth of Ling Tian, his heart clenched up in nervousness.</p><br/><p>He then replied calmly, “It is your choice if you want to talk about your plans. Besides that, what has your plan got to do with me?”</p><br/><p>Ling Tian smiled mysteriously as he said, “My plan is actually very simple. I only ordered the guards of the Heavenly Water Ravine Pass to seal the city gates towards the southeast. I ordered my troops to first crush the enemies with rocks before pouring freezing water down onto them. My troops have already collected all of the snow inside the Pass and filled up 5000 large pots. Haha, I have increased the number of elites in the Heavenly Water Ravine Pass to 50,000 men and apart from that, I stationed another 400,000 men in the valley of the Heavenly Water Mountain.</p><br/><p>Ling Tian looked at Xiao FengYang merrily, “Second master Xiao, do you think that the little troops of mine would be able to defend against the crazed attacks of the Xiao Family’s army? You are a grandmaster in the art of war and I trust your judgment!”</p><br/><p>Xiao FengYang could no longer keep his cool and shut his eyes in agony.</p><br/><p>Melting snow into ice isn’t anything special and even dousing the enemies in boiling water was an ordinary defensive method. However, the weather was at its coldest and this method would be extremely effective.</p><br/><p>When the Xiao Family attacked the city, there wasn’t any need to pour boiling water on the soldiers as pouring the melted snow would be equally effective. In the freezing weather, as long as the melted snow was poured on the soldiers, the soldiers who didn’t take off their armor in time would be frozen to death with their armor. Even if the soldiers wanted to take off their armor, they would definitely peel off a layer of their skin.</p><br/><p>Regardless of the sacrifice that the Xiao Family made and how many layers of city walls that the Xiao Family broke through, it wouldn’t matter as long as the Pass was held in the hands of the Ling Family. All the Ling Family needed to do was to pour water on the walls and after a night, all of the damage done to the wall would be filled up by the frozen water.</p><br/><p>On top of that, Ling Tian had already increased the number of soldiers stationed in the Pass to 50,000 men and had even arranged for reinforcements of 400,000 men!</p><br/><p>With the narrow terrain of the Heavenly Water Ravine Pass, they would only be able to send a small batch of soldiers up to siege the city in waves. Not to mention the 2,000,000 man army of the Xiao Family, even if they added another 2,000,000 soldiers, it would be impossible to take down the Pass during the winter!</p><br/><p>Originally, the experts of Above Heavens might have been able to sneak into the Pass with their martial arts to open up the city gates but Ling Tian had already sealed up the city. Ling Tian’s single move had completely destroyed the final hope of the Xiao Family.</p><br/><p>Xiao FengYang sat motionlessly in a daze and a look of hopelessness could be seen in his eyes.</p><br/><p>Ling Tian stood up and cupped his fists, “Second Master Xiao, Ling Tian only came here to report to you about these military affairs. Now that my report is over, I shall not disturb Second Master Xiao any longer. I shall take my leave!” He then smiled and walked out proudly.</p><br/><p>The entrance to the stone chamber was slammed shut. Xiao FengYang’s body trembled and his previously straight back slowly curled down. In that instant, he seemed to have aged greatly.</p><br/><p>“The Xiao Family is… finished!” A long desolate sigh came out from Xiao FengYang as he sat on the ground hopelessly.</p><br/><p>******</p><br/><p>However, was what Ling Tian said really the truth?</p><br/><p>Of course it wasn’t.</p><br/><p>Apart from Ling Tian’s plan to deal with the Xiao Family being real, the news of the Xiao Family attacking them was not.</p><br/><p>Ling Tian did not want to wipe out the Xiao Family and never had such a plan. This was something that he had decided a long time ago. Old Master Ling and Xiao FengHan were sworn brothers and while Xiao FengHan betrayed Old Master Ling, Old Master Ling still placed a great deal of importance on this sworn brotherhood. As he grew older, Old Master Ling would reminisce about the times when he was young, and his adventures with Xiao FengHan were some of the happiest memories of Ling Tian’s grandparents.</p><br/><p>However, these two elderly Lings only watched from the side and did not interfere with Ling Tian’s plans. They did not want and were not willing to add another huge burden on the tender shoulders of their grandson. Thus, the two Lings did not do or say a thing.</p><br/><p>However, just how intelligent was Ling Tian? Every time he went back to the Ling Residence and talked about the situation of the continent, his grandparents would obviously be depressed when he mentioned the Xiao Family. After the battle with Xiao FengYang, Ling Tian could see how his grandparents had visibly aged.</p><br/><p>Ling Tian was not a fool and would understand the reason behind this. The two of them were already old and if their sworn brother’s family was extinguished by the hands of their grandson, these two would probably be unable to take such a blow. At that time, if something untoward were to happen to his grandparents, it would be too late for Ling Tian to regret. Ling Tian was not willing to give them any more blows. Thus, Ling Tian had always been looking for a way to perfectly settle this matter.</p><br/><p>As for the reason behind cooking up this lie to Xiao FengYang, it was Ling Tian trying to assault Xiao FengYang’s heart. Ling Tian would first throw Xiao FengYang into despair before giving him hope. It was akin to giving him the cane before giving him the candy. This was what Ling Tian was best at. As an important character in the Xiao Family, the meaning that he had to the Xiao Family was even above that of the family head Xiao FengHan. At the same time, his attitude would also be crucial to changing Xiao FengHan’s attitude. As long as Xiao FengYang gave in to Ling Tian, there would be hope for his plan to succeed if he also had the help of Xiao YanXue.</p><br/><p>Over the past few days, Ling Tian had slowly inched nearer and nearer to his plan. He first talked about the information that he collected, the deployment of troops and supply of grains. Because none of these were false or exaggerated, a seed of truth had already been planted in Xiao FengYang’s heart and Xiao FengYang truly believed that war was imminent. After lying about the large reaction of the Xiao Family today, it was indeed effective.</p><br/><p>Naturally, if Xiao FengYang did not fall into his trap and refused to submit to him, Ling Tian would have no choice but to take a risky move and send out all of his experts to wipe out Above Heavens. If the biggest supporter of the Xiao Family was wiped out together with a few threats from him, there would still be the chance for him to subdue the Xiao Family. However, this plan would have to be shelved for the moment. The strength of Above Heavens couldn’t be underestimated and it would be a dream to wipe them out without paying an appropriate price. Furthermore, even if Above Heavens was wiped out, the Xiao Family might not surrender immediately. After all, they still had their 2,000,000 man army!</p><br/><p>The second reason for him to make such meticulous plans would naturally be because of Xiao YanXue. Since he had already accepted Xiao YanXue as his woman, Ling Tian wasn’t willing to see his woman lead a miserable life or have a knot in her heart. If the other party was his enemy, Ling Tian could use the most unscrupulous and vicious means to wipe them out. But if he wasn’t able to coax his own woman, he would not be a man. These were Ling Tian’s principles!</p><br/><p>Ling Tian then planned about how he should report to Xiao FengYang about the ‘newest battle situation’ as he left with delight.</p><br/><p>******</p><br/><p>Yu ManLou’s resolute attitude was shown at this very moment!</p><br/><p>After receiving Ling Tian’s letter, Yu ManLou pondered for an entire night before finally making a decision.</p><br/><p>Three days later, Ling Tian received news that all of the men, women, and children of the Lei Family who were in Bright Jade City had been killed without mercy! Their deaths were extremely miserable and the killer was unknown. The killer only used fresh blood to write on the wall, “A blood debt shall be paid in blood! Those who provoke Ling Tian shall have their family wiped out!”</p><br/><p>As this matter was spread, the whole world was shocked!</p><br/><p>Everyone knew about the Lei Family attacking the Ling Family and with the bloody words on the wall, the deaths of the Lei Family would naturally be attributed to Ling Tian! There were many who were frightened by Ling Tian’s viciousness and some who were furious!</p><br/><p>Taking his revenge so openly through the employment of such vicious means had truly stirred the continent. Ling Tian even had signs of becoming the number one public enemy…</p><br/><p>It was reported that Yu ManLou was devastated about the death of his alliance mate and personally arranged a majestic funeral for the Lei Family. It was said that as he read out the eulogy, tears streamed down his cheeks and he was visibly agitated. He swore to the heavens in front of the public that he would seek justice on behalf of the aggrieved souls of the Lei Family!</p><br/><p>After Ling Tian heard about this incident, his suave face cramped up in disbelief and he let out a bitter laugh.</p><br/><p>The old ginger is truly spicier! Yu ManLou’s move was truly devious but extremely effective. Ling Tian could not help but give Yu ManLou a thumbs up.</p></div>\n</div>"}