{"title": "Chapter 626 - Heart Knot Untied", "id": 626, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-626-heart-knot-untied", "volume_title": "Volume 7", "body": "<h1>Chapter 626 - Heart Knot Untied</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was only after a long time that Shui QianRou finally woke up from her reverie and hurriedly asked, “Sister Xue, do you really mean it?”</p><br/><p>Li Xue smiled as she replied, “Whether it’s real or false, can you not tell them apart? That mountain peak has been standing there for tens of thousands of years, so how could it suddenly collapse for no reason at such a critical juncture? Furthermore, Ling Jian and Feng Mo’s group played a part in this, and you can know the truth by just confirming it with them. Is there a need for me to lie to you?”</p><br/><p>Shui QianRou, Yu BingYan, and Xiao YanXue all fell silent immediately.</p><br/><p>Ever since she came over, the war between Ling Tian and the Xiao Family was a knot in Xiao YanXue’s heart. She couldn’t help but still have a little bit of anxiousness and grudge. However, upon hearing this news, a sense of bliss suddenly occupied her heart.</p><br/><p>“So it turns out, that Tian’ge has always been sacrificing for me! But instead, I’ve… I’ve really disappointed him.” Thinking along these lines, she did not speak further, but instead, tears rolled down her face.</p><br/><p>Shui QianRou acted in the same manner, her whole face red with guilt.</p><br/><p>Li Xue pressed her brows together as she replied, “What are you girls doing? I’m saying these only because I don’t wish for all of you to misjudge him. So long as everybody is aware of what he has done for us, it will be fine. Just look at the two of you, even openly crying. Imagine what would happen if that sentimental fool came in? He would be so heartbroken at the sight of you two, and if that’s not all, he would even come after me for revenge. What do you want me to do then?! Anyway, he has done all this for your sake, and this is his way of embodying his message of love. You all should feel happy because of this, instead of crying!”</p><br/><p>While choking back her tears, Xiao YanXue replied, “Sister Xue, I, I am just too happy… so happy that I cried….”</p><br/><p>Li Xue was at a loss for words. It was only after a while that she said, “Then today, let us sisters enjoy appreciating the snow and wine. The wine today was specially brewed by Tian’ge, and it’s called Maiden’s Heart. I believe the meaning in this does not need to be said further. Today, I’ll make it clear to all sisters here, that Tian’ge works so hard is purely to steal all of our ‘maidens’ hearts’!</p><br/><p>Meaning cannot be understood without explaining, and a conversation cannot be understood without speaking. Now that Li Xue had pierced through the veil covering this reasoning, all of the women present fell into silence. All of them truly felt the heartfelt effort that Ling Tian had put in for them, and their eyes began to redden as the tears began to flow.</p><br/><p>With her intelligence, upon observing this scenario, Li Xue knew that none of the ladies present would have any knots within their hearts regarding this point. Thus, this was the time to strike while the iron was hot! She immediately exchanged a glance with Ling Chen. Some matters needed Ling Chen to speak instead, because while she was not the oldest, her position would always be the first! This was something no one could surpass, nor would any of the ladies present dare to! Even the proud and arrogant Li Xue would not dare to do so. Simply because, if anyone tried to do so, they would immediately come face to face with Ling Tian’s full wrath!</p><br/><p>No one was willing to incur the wrath of Ling Tian! Nor did they have the intention!</p><br/><p>Noting the glance shot towards her, Ling Chen coughed twice, before softly saying, “Little sister BingYan, little sister Rou, the two of you will be returning to your various families in a short period of time for the generational battle. Inside the battle, you two are even the pre-destined enemies, with the aim of fighting each other to the death. Is that true?”</p><br/><p>Yu BingYan and Shui QianRou suddenly raised their heads. After exchanging a look, they remained silent, finally nodding.</p><br/><p>Ling Chen’s tone became slightly more solemn as she continued, “Right now, young noble wants me to pass down the message that no matter which one of you, no harm is allowed to befall you two. Not even the slightest injury!”</p><br/><p>The two of them still did not speak, only carrying expressions of respect as they quietly listened.</p><br/><p>Ling Chen slowly continued, “After this, I’ll draft out a separate practice field for the two of you. What we need to do next is a lot, but also very simple. It will be to familiarize yourselves with the skills of your opponent, every last one of them! After that, both of you are to come out with ways to counter them. This point has to be completed within five days! The Yu Family is already here to escort sister BingYan back, and Young Noble says that he can at the most delay them for another five days. Thus, this is the only span of time you two have left.”</p><br/><p>Time was tight, and both Yu BingYan’s and Shui QianRou’s face turned solemn and heavy.</p><br/><p>Outside the window, the snow continued to float about, as though it was endless…</p><br/><p>The ladies who have had all their heart knots untied began rearranging the cups and chopsticks again, before serving up the wine and snacks. The ladies then drank till they were dead drunk, leaning upon each other for support, before contentedly passing out and sleeping…</p><br/><p>Only Li Xue, with her left hand around Xiao YanXue’s head, and her right hand supporting Shui QianRou, stared at the fluttering snow in the air. She sighed deeply, and a hint of tears appeared in her eyes even as she muttered, “Tian’ge, this matter that you were most troubled about, I’ve helped you to solve it. You… are you happy?”</p><br/><p>She silently sat there looking at the window, sighing ceaselessly in her heart. As a female from the modern era, not only did the husband have to be faithful to the wife, but he even had to go on bended knee to propose before the female would consider the marriage. To think that right now, not only did she have to share her husband, but she was even required to come out and solve the problem of her husband’s concubines! Even if she did not say it out loud, Li Xue was rather dissatisfied in her heart. However, thinking about the love that she had pursued across two lifetimes, as well as the miserable fate she had given him in her previous life, Li Xue immediately began to feel ashamed in her heart.</p><br/><p>Forget it, treat it as what she owed him from the past life. This enemy yet also her loved one…</p><br/><p>It was only after a long time that Li Xue fell asleep due to the influence of the wine. Furthermore, it was a deep and comfortable sleep…</p><br/><p>This snowfall lasted for more than three days.</p><br/><p>On the third day, Yu XiaoRan and this entourage felt like captured beasts, only able to be seated in an enclosed area worrying about the walls, at their wit’s end.</p><br/><p>Ever since they met up with Ling Tian three days ago, the highest ranked people they had seen inside the Ling Family Courtyard were only those in charge of operations, bringing in wood and necessities for them. For their everyday activities they had to take care of themselves, and the Ling Family Courtyard did not even give them a single servant to call upon. Their three meals were all delivered by someone, and even the hot water, as well as tea, were brought in regularly. As for the reason why they were not provided with any servants, the reply was truly maddening. Ling Tian said that because the Ling Family Courtyard was a place where everyone earned an honest living, there was thus no servants present. Furthermore, he even infuriatingly added that the elders themselves were all experienced people, able to take care of their own needs, and having servants would only hinder them if they chose to wander around!</p><br/><p>They ate well, drank well, and even lived well, yet all four of them had the impression that they were serving their jail terms currently! While the Ling Family did not send anyone to monitor their actions, how would the few elders still dare to walk out? If they were falsely accused of going out to ‘look for happy endings’, then they would be throwing all their old faces away! After enduring for one or two days, an even worse form of torture arrived, which was that snippets of whispering came from the surrounding courtyards around them. The contents made them blow their tops and almost sink into despair.</p><br/><p>“…. Did you hear? A few experts from the Yu Family are staying in that courtyard, and apparently, their grand elder was defeated by young noble’s study aide. You know, that weak guy who always stays beside young noble! And to think they’re still considered experts from the Yu Family, what kind of shitty experts are those?” One could imagine the scorn on the person’s face as he was saying this…</p><br/><p>“Is that true? How could a great elder of the Yu Family be so worthless? Even failing to defeat a mere study aide? While Jian’ge status is high, that’s because he’s the personal study aide of the young noble, thus he receives his favor!” a light and curious voice replied.</p><br/><p>“Maybe it’s that the Yu Family experts are rubbish, right? I really saw it with my own eyes, so how could it be false? It was your bad luck that you missed out on such a show. A short elder was rolled into a snowball by Jian’ge, and the taller one even got smacked in the face by him, and oh my, the sound was unbelievably crisp. The old man was really embarrassed, like a maiden just about to get married. Hehe, his face looked just like a peach.”</p><br/><p>“This part you might not know, but I heard that these few elders only have an old appearance but not an old sex life. They even asked the young noble where that particular place in Sky Bearing was! I’m curious to know that when they’re doing the dirty deed, will their faces turn red like peaches?!”</p><br/><p>“Maybe when they go up into ‘heaven’, they’ll never come down afterward, hehehehe…” A round of sniggering could be heard.</p><br/><p>This type of conversation actually happened a few times, causing the elders to feel like they were going to have a stroke. From then on, all their windows were fully closed, and let alone talking about walking around, they did not even dare to move out of their house…</p><br/><p>The snowfall finally cleared up, leaving the world wrapped up in a layer of white and silver, gleaming beautifully in the skies and lands.</p><br/><p>Today, Ling Tian woke up early, smiling to himself as he walked towards a certain area. After making a few turns, he came to a chamber with four guards tightly guarding the location, before opening the door and walking in. Inside was a table and chair, coupled with a bed, all impeccably arranged. The materials were of high quality, but that was not the main point. The main character was actually a thin old man sitting in front of his desk, a book in his hand as he engrossed himself within. To that point, he was not even aware of Ling Tian’s presence, without even the twitch of an eyebrow signaling his notice, as he continued to read. The person was no bystander, but rather Xiao FengYang.</p><br/><p>In this period of time, Ling Tian practically visited him once every other day, and could be considered a familiar face by now.</p><br/><p>“It’s been a long time, Second Master Xiao. I trust that you have been well these few days?” Ling Tian greeted courteously, with a mild tone.</p><br/><p>“With your blessings, I’ve been able to survive.” Xiao FengYang did not even blink, merely replying in an indifferent tone.</p><br/><p>Ling Tian did not even show any courtesy, immediately sitting down on Xiao FengYang’s bed. Feeling its softness and warmth, he contentedly let out a sigh as he spoke, “That’s right, to be able to stay in peace, together with a comfortable bed and pillows, even having enough food and water. There are books to keep you occupied, no noise to bother your ears, and no problems to drain your energy. One can literally live here like an immortal, free of all of bloodshed and politics in the world. To speak the truth, Ling Tian here really admires Second Master Xiao for being able to escape like this.”</p><br/><p>Xiao FengYang only furrowed his brows in response. It was not because of the sarcasm that Ling Tian spoke with, but because Ling Tian was seated on his bed. Xiao FengYang was mysophobic, and even when he was out in the field, his requirement to himself was to keep everything clean and tidy. Even though he had turned into a prisoner of war, Ling Tian’s apparent lack of restraint made him inwardly angry. However, because Ling Tian had been doing the same thing the last few weeks, Xiao FengYang was also beginning to get used to it.</p><br/><p>Snorting coldly, Xiao FengYang replied, “Since that’s the case, why don’t you also move in and accompany this Xiao?”</p><br/><p>“How would I dare to disrupt the peace and quiet of Second Master Xiao?” Ling Tian carelessly laughed out loud. “I only came here to report something to Second Master. The Xiao Family has wantonly fielded 2 million soldiers, and ignoring the chilling conditions, has rushed towards the west for an assault. There’s a total of 200,000 men in the vanguard, already nearing the natural stronghold of Heavenly Water Ravine Pass that my Ling Family is currently occupying. To hold a battle in this severe weather, there might be a chance that something out of the ordinary will occur, and our Ling Family could lose control of the Heavenly Water Ravine Pass. Right now, the morale of the Xiao Family is high, and they believe that they have victory in their hands. Ling Tian here congratulates Second Master Xiao in advance!”</p><br/><p>Pa! Xiao FengYang could no longer maintain his calm attitude, and his hand landed heavily on the table. His body trembled and his face turned pale. How could this be a congratulatory note from Ling Tian? He was just mocking them for lacking a godly military strategist.</p></div>\n</div>"}