{"title": "Chapter 628 - BingYan Returns Home", "id": 628, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-628-bingyan-returns-home", "volume_title": "Volume 7", "body": "<h1>Chapter 628 - BingYan Returns Home</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ling Tian’s original plan was to have Yu ManLou step out and kill off all the Lei Family remnants, then Ling Tian would take the chance to announce to the world his misdeeds and sully the reputation of Yu ManLou. The best scenario was to completely isolate him, thus allowing himself to achieve an easier time in the final battle.</p><br/><p>Furthermore, what Ling Tian asked for was the heads of the Lei Family members. Inside his plan, Yu ManLou would need to personally deliver the heads, and by that time, there would be no way for him to deny this accusation.</p><br/><p>How would they know that Yu ManLou would actually act so shameless?! Although they did not meet, Yu ManLou evidently saw through Ling Tian’s scheme and countered it immediately. You told me to bring over the heads, but you didn’t mention I had to do it in person! Now that the heads have been taken, all I just need to do would be to write a few words on the wall. I have the freedom to do so…</p><br/><p>In this manner, he had instead pushed Ling Tian to bear the brunt of the accusations from the public.</p><br/><p>To go for wool but end up being shorn, this was the exact feelings of our Young noble Ling Tian.</p><br/><p>“Truly an old fox! A scheming and wily old fox!” Ling Tian viciously cursed. However, he suddenly laughed out loud. One would not have the ability to take benefits from every opportunity after all.</p><br/><p>“I had actually wished to borrow the matter of the Lei Family to flaunt my influence, with the intention of warning everyone before taking advantage of the situation for my own benefit. This would push the Yu Family to the point of no return, and they would be forced to take the path labeled as deviants of society. To think that Yu ManLou would actually be so scheming, to convert a dying situation to counterattack, using my name to accomplish the task. He not only completed my request perfectly, and he did not even compromise a single bit of the Yu Family reputation. Indeed my destined foe.” Ling Tian let out a bitter smile, as he thought that this might not be a bad thing even though he did not achieve his ideal scenario. At least in the future, if any of the families had evil intentions against them, they would first need to consider the ending of the Lei Family. In this world, how many families could boast that they had a force stronger than the original Lei Family? Whichever was the case, even the evildoers themselves would fear another evildoer!</p><br/><p>With the precedent of the Lei Family, who would dare to make a rash move? Even if they had the intention, they would not have the guts!</p><br/><p>However, Ling Tian was still feeling a little troubled. So in this manner, did he benefit this time or did he suffer a loss? This debt was really difficult to calculate. Yu ManLou not only successfully resolved his problem this time but also managed to counterattack. While he got rid of the Lei Family once and for all, they both did not manage to do any lasting harm to each other, only managing to feel each other out.</p><br/><p>Three days later, the two elders from the Yu Family came back.</p><br/><p>This time, Ling Tian did not make any excuses, but instead straightforwardly dispatching 500 of his troops to accompany Yu BingYan as they escorted her to Bright Jade City. As a precaution, Ling Feng, Yun, Lei, and Dian dressed up as part of the troops to infiltrate and protect Yu BingYan on her journey. Her original bodyguards, the Xue Brothers, had perished in the battle against the Lei Family, and Ling Tian did not feel comfortable leaving her safety to outsiders even if they were from her own family.</p><br/><p>Furthermore, the four Ling bodyguards had received personal coaching from Justice himself, and after consuming the flood dragon inner pellet they experienced a huge improvement in their inner strength. Since they had already acclimatized to the huge increase in strength, Ling Tian believed that even if an army of 10,000 came along, they would still be able to ensure that not a single hair of Yu BingYan’s head would be harmed. In addition, now that Yu BingYan herself could cultivate, she had achieved a strength that could be comparable to the Feng and Yun brothers.</p><br/><p>With these five great experts present, how could they be stopped by any mere motley power? This was especially so considering their unique ability, which was that they were able to completely conceal their own strengths. The four Ling brothers even received teachings from Justice on how to properly control their breaths that would even make Ling Tian ashamed of his own skills. On the surface, the four of them only exuded the strength of a first-rate expert in the HouTian stage. Of course, if one took their age into account, this was something that was already outstanding.</p><br/><p>As for Yu BingYan, she was in the midst of recovering and had coincidentally opened her own Conception and Governing Meridians. After absorbing the various remnant medical efficacy left in her body over the years, her own strength immediately shot up to the XianTian realm, giving her a vibrant appearance. Just with the basis of her current cultivation, she did not lose out to Ling Chen nor Shui QianRou. In addition, having practiced the secret manual, the Mysterious Yin Essence Heart Sutra that Ling Tian had gifted her, it suited her innate Yin constitution greatly. While the technique might not possess a destructive strength, it was the best at concealing one’s cultivation. As such, Yu BingYan did not appear to have improved greatly when compared to her past self.</p><br/><p>Ling Tian added another layer of precaution, asking Li Xue and Ling Chen to infuse a pure strand of frost true energy into her body. One, this could act like the symptoms of her ailment, where it would retaliate if someone used their true energy to probe her meridians. The second point was that these two strands could turn into Yu BingYan’s secret weapon!</p><br/><p>Knowing that it was the time for her to leave, Yu BingYan became extremely crestfallen. She first went over to the Ling Family in Sky Bearing to bid farewell to the elders, crying out rivers of tears. Before she actually left, she also ended up hugging Li Xue and Ling Chen, bawling out loud.</p><br/><p>Ling Tian also felt a little sour in his heart, but he forcibly endured it. It took him quite the effort to coax Yu BingYan up into the carriage. As the carriage left, Yu BingYan continued to lean halfway out of the carriage, all the while waving.</p><br/><p>After he sent Yu BingYan off, Ling Tian also began to get busy, and furthermore, he was overwhelmingly busy. The current Ling Tian could only hope that he could take care of all his current affairs and matters, and run over to the Heavenly Wind Continent to take refuge.</p><br/><p>Even without him, following the successive victories of the Ling Family army, first swallowing Southern Zheng, then conquering Eastern Zhao, the entire half of the country had already been occupied by them, their positions stable. This would be the time for them to sit back and digest, allowing the place to return to its former peace as well as for the wild lands to give rise to life once more.</p><br/><p>In view of such circumstances, all the various officials in Sky Bearing became restless. This included the overwhelming majority of those in Ling Family Courtyard. On this topic, Meng LiGe was one of the most resolute.</p><br/><p>It was about rushing the Ling Family to quickly take on the title of a dynasty, establishing an empire. This would allow the future generations of the Ling Family to hold formal authority, and be raised as an emperor. Because of this matter, the people were bubbling over in excitement, causing Ling Tian to be at a loss for words.</p><br/><p>If one decided based on seniority, then naturally Grandpa Ling Zhan would be the most suitable. However, his attitude was extremely firm against this decision, stating that he was already old and muddled, and did not have that many years left to live. It would be better to ask Ling Xiao to hand over command of his troops and return back to Sky Bearing to accept the appointment of the Emperor.</p><br/><p>However, our dear Grand Marshall Ling was even more resolute, “Anyone can be the emperor, but definitely not me! Give it to that brat Ling Tian!”</p><br/><p>Ling Tian now naturally had his own reasoning, “Above me, there’s my father and even my grandfather, what I am worth compared to them? If I really ascend as the emperor, then wouldn’t I have to receive the pointing and scolding of everyone under the heavens?! Such an unfilial act unbefitting of a ruler, treating his elders as though they did not exist, how could he bear to perform it? Better to hand it to Grandfather instead.”</p><br/><p>Just like that, the position of Emperor was kicked around by the three generations just like a rubber ball. None of them was willing to sit on the throne.</p><br/><p>In this manner, everyone was thoroughly exhausted by them. Meng LiGe even tried to invite the great Mister Qin, who had already secluded himself from politics and worldly affairs, but to no avail. Instead, he gave Ling Tian the chance to invite Mister Qin over to the Ling Family Courtyard to live out the rest of his retirement in luxury. However, the true purpose was to thoroughly milk that poor old man of his surplus value.</p><br/><p>Helplessly, Meng LiGe could only resort to doggedly following behind Ling Tian every day and nagging continuously, causing Ling Tian much misery. However, every method has a way to counter it, and the cunning Ling Tian was just like a sly rabbit who has three burrows. He started to avoid Meng LiGe as though he avoided ghosts when he saw them, running as fast as he could in the opposite direction. Under his supreme movement technique, Meng LiGe naturally could not even manage to catch his shadow, making the old man depressed.</p><br/><p>Bright Jade City, Yu Family.</p><br/><p>Yu BingYan slowly got out from within the carriage. As she stared at the majestic decorated archway of her front gate, she could not help but feel her emotions fluctuate. That year, she brought with her the intention to face death as she walked out of this place, ready to squander all her wealth and live the rest of her life in luxury. However, she actually met with her loved one as a result, obtaining the most sincere love and bliss. What was even better was that the illness that plagued her for eighteen years had actually vanished for good. Standing here right now, she suddenly felt as though her past few years were like scenes from a previous lifetime flashing past her eyes.</p><br/><p>In the great hall, Yu ManLou, Yu ManTang and Yu ManTian looked at Yu BingYan as she walked in, an emotional look on their faces. A trace of guilt actually flashed past Yu ManLou’s face at this time, but it instantly vanished.</p><br/><p>Yu ManTian boomed out loudly as he laughed and Yu ManTang could not help but walk down a few steps. As he gazed at his daughter’s figure, his expression was anxious and her figure trembled.</p><br/><p>“Daddy…” Yu BingYan let out a soft cry as she pounced in front, right into the arms of her father. Yu ManTang’s eyes got a little wet as he hugged his daughter tightly. “Yan’er, come, let father look at you. Did you lose weight? My good girl… you’ve really suffered…”</p><br/><p>Yu BingYan’s tears slowly dripped down.</p><br/><p>Yu ManTang looked at his daughter as he slowly sized her up, his eyes revealing boundless affection.</p><br/><p>Yu ManLou stroked his beard as he happily watched the father and daughter reunite. Suddenly, he discovered something, and an incredulous look filled his face.</p><br/><p>“Second Brother, BingYan… her illness has been treated?!” Yu ManLou exclaimed in joy, but it was also laced with some suspicion.</p><br/><p>“BingYan…” Upon hearing this, Yu ManTang too discovered the anomalies in his own daughter, the lack of the frost energy that always accompanied her. An expression of ecstasy filled his face. “BingYan, you’ve truly recovered?!”</p><br/><p>“En, Tian’ge knew about my terminal illness from the start, and he did not spare any price to bring about various famed doctors as well as treasured medicines, it was just that they could not do much. Finally, Tian’ge got the Beyond Heavens’ Justice to personally act, The Divine Black Negative Meridians turned out to be domineeringly strong, to the point that even Justice could not do much. However, he indeed holds the reputation of the number one person. He actually used his internal energy to forcefully lock the frost energy within the Divine Black Negative Meridians into a small portion of my body. While he couldn’t remove it completely at once, and there will still be repercussions, the frost poison will not activate within the next decade as long as there are no unforeseen circumstances. Compared to the situation of the past, it is akin to heaven and earth.”</p><br/><p>As she talked about this, Yu BingYan had a sweet smile on her face. Regarding the matter of her illness, they had long ago come to a consensus that the Great Cyclic Pellet, as well as the inner pellet of the flood dragon, were definitely matters that could not be spoken about. The cultivation levels of Ling Chen, Ling Tian, and Li Xue were matters that could not be revealed either. After much consideration, they could only pin the source of the cure on Justice.</p></div>\n</div>"}