{"title": "Chapter 637 - Beating the Dogs", "id": 637, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-637-beating-the-dogs", "volume_title": "Volume 7", "body": "<h1>Chapter 637 - Beating the Dogs</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ling Tian lifted up his wine glass and slowly enjoyed the wine within it. He then took out a white cloth to wipe his hands before laughing and saying, “The first meal in Heavenly Wind is truly delightful. The food is truly delectable and the wine is sufficiently strong. Furthermore, there is still an entertainment program after our meal. I wonder if there will be anything more exciting than this?”</p><br/><p>Ling One smiled malevolently and revealed a grin. “As long as young noble likes it, we can come here every day. Something more exciting is about to come.”</p><br/><p>Ling Tian smiled and leaned back with a smile, “Good! Now that our meal is completed, it is time for us to watch a show. The show can begin.”</p><br/><p>Ling One chuckled, “This subordinate will ensure that Young Noble will enjoy the show.”</p><br/><p>Ling Tian responded with an ‘Mmm’ and suddenly lifted up his head.</p><br/><p>At that moment the whole hall, the heavens and earth, seemed to have darkened. Ling Tian’s gaze was like a bolt of lightning breaking through the heavens and landing on the earth. His gaze was extremely sharp and resplendent!</p><br/><p>Song Kuang who was opposite him, including Old Ding and the 24 burly men behind, felt the world before them darken before being lit up again. The hair all over their bodies also stood up on end!</p><br/><p>This was the pressure of a ruler from above capable of completely controlling their life and death!</p><br/><p>Indeed so! The black-robed old man was filled with boundless helplessness. With just the pressure the young man before him had displayed, the old man had never witnessed such an expert in his past 60 years of roaming the continent! Just what kind of a cultivation would this require?!</p><br/><p>It seems like they kicked a steel board today! Furthermore, it was an extremely thick one! They could only pray to the heavens that they would be able to leave with their life today!</p><br/><p>All of a sudden, a figure flashed past their eyes and one of the five individuals disappeared before their eyes! Before the old man could even turn behind to take a look, a white-robed teen stood in front of the door of the restaurant and the doors of the restaurant slowly closed! There were more than twenty people gathering around the door but not a single one of them were able to witness how the white-robed teen weaved past them!</p><br/><p>Closing the door to beat the dogs?!</p><br/><p>A wave of cold air blew from the tip of the old man’s head all the way to his toes! At this moment, this old man who had roamed the pugilistic world for a couple of decades felt his legs cramping up! This was not because of him being a timid character but because the white-robed teen was far too unfathomable. The old man even had the feeling that he had already taken a step onto the Yellow Springs Road! How could he not be frightened?!</p><br/><p>The white-robed teen who floated past him did not make a single move but only stood in front of the door silently. However, the gigantic door behind him actually began slowly closing as though there was a ghost in the room.</p><br/><p>The meaning behind those actions was obvious! They did not want to let a single one of them escape! In other words, all of them would have to die today!</p><br/><p>The eyesight and experience of this old man who had roamed the world for decades had come into use again. However, he would rather be blind and completely inexperienced! At the very least, he would still have the courage to fight for his life! That white-robed teen was definitely a peak XianTian expert! As for the person in the hall, he was definitely stronger!</p><br/><p>The black-robed man was on the verge of tears. Was there even a meaning to fight for his life?!</p><br/><p>What kind of luck did they have?! Such an expert belonged to the legends and it would be amazing if they could find three of them in the world today! An ordinary individual would only be able to dream of such a character or hear about him from legends. However, he actually met two of them when coming out for a meal with his young noble. Furthermore, they had still taken the initiative to provoke these experts!</p><br/><p>In front of such an expert, not to mention himself, even his young noble and the whole Song Family would only be faced with a single outcome: complete destruction! However, they had actually thoroughly provoked these experts today!</p><br/><p>The black-robed old man turned around and fell into a daze again. It turns out that the matter was worsening further.</p><br/><p>Apart from the suave young man remaining seated, the three others beside him stood up with a sneer on their faces. Three powerful auras exploded forth and a cyclone seemed to have been formed in the hall. The twenty plus burly men felt as though they had descended into a freezer and all of their limbs froze up without daring to make a single move.</p><br/><p>Song Kuang was also not completely retarded and finally realized that something was wrong. He immediately took his leg off from the manager’s head and let out a dry cough before forcing a chuckle, “I wonder where this brother is from? I am Song Kuang from the Song Family.” Noticing that he wouldn’t be able to win against the other party in a fight, he could only hope that the other party would give his Song Family some face.</p><br/><p>“Song Kuang of the Song Family?” One of the three men looked at Song Kuang as though he was staring at a corpse, “Even if Song TianQiao was here today, he would have to act obediently in front of me! Is Song Kuang even a thing? Do you even have the right to call me your brother?”</p><br/><p>“Who are you?” The black-robed man’s expression transformed. Song TianQiao was the Family Head of the Song Family, Song Kuang’s father! These people in front of him dared to speak in such a bold manner? According to the old man’s knowledge, there were only three people in the world today who were qualified to say such words! The prestige of the Song Family Head was not one that any Tom, Dick, or Harry would dare to challenge! Even if someone had the guts to say such words, they would only be dreaming!</p><br/><p>These three people were: The number one expert of the Shui Family, Shui WuBo. The Shui Family Head, Shui ManKong. The alliance head of the Sky Alliance, Tian ZhiYi! Of the three individuals, this old man had only not met with the last of the three! If the person in front of them was the legendary…</p><br/><p>Could it be…</p><br/><p>Could they truly be so unlucky? However, how should they explain everything before them?</p><br/><p>At this moment, the whole restaurant fell into a delicate stalemate!</p><br/><p>All of a sudden, the sound of galloping horses could be heard and a robust voice with a tinge of anxiousness sounded, “If young noble Song Kuang inside? City Head of the Jade River City, Jiang XiaoFeng, seeks an audience!”</p><br/><p>This voice had unknowingly broken the stalemate!</p><br/><p>The legs of the unbelievably arrogant Song Kuang had turned into jelly. The powerful aura given out by Ling Tian and his subordinates had completely scared his soul out of his body! He had never seen anyone capable of suppressing the actions of twenty men without making a single move but using his aura alone. Even his father, Song TianQiao, would not be able to give out such a powerful pressure! Not to mention seeing, Song Kuang had not even heard of such strength before!</p><br/><p>Song Kuang was already full of regrets in his heart. He wasn’t a fool either and could be considered to be pretty wise in fact. While he still didn’t know the status of the people in front of him, he knew that they were not people that he could afford to provoke! Seeing the dense killing intent in the eyes of the people in front of him, he was frightened out of his wits! However, at this critical moment, the voice of the Jade River City Head had actually sounded. It was as though a lifesaver had suddenly arrived and Song Kuang was naturally overjoyed.</p><br/><p>Currently, no one would have the confidence or rights to resolve this conflict with the master of this restaurant being the only exception!</p><br/><p>If this matter was handled by Jiang XiaoFeng, Song Kuang would be able to keep his life for sure.</p><br/><p>This was a matter of complete irony; Song Kuang and his followers were here to seek trouble with Jiang XiaoFeng but he had currently transformed into the savior of all of them!</p><br/><p>Song Kuang’s eyes spun around and wanted to take the initiative to speak. As long as he could allow Jiang XiaoFeng into the restaurant, he would have some hope of keeping his life. However, before he could even open his mouth, Ling Tian let out a cold grunt. A dense killing intent enveloped the entire restaurant and despite Song Kuang and his followers trying their best to resist Ling Tian’s aura, they were like little boats in the midst of a thunderstorm. How would they be able to even say a single word? The only sound coming out from their mouth was the clattering of their teeth.</p><br/><p>Ling One took a few steps forward and shouted, “Tian ZhiYi from the Sky Alliance is borrowing this place to settle some of my personal affairs. May City Head Jiang do me a favor and I will pay a visit to City Head Jiang another day.” His voice sounded like rumbling thunder, being emanated powerfully and fully displaying the depth of his cultivation.</p><br/><p>The moment these words were said, the whole hall fell silent. Song Kuang did not dare to believe what he had just heard! It was one thing to make a guess but another to have his guess verified! Sometimes, ignorance was bliss!</p><br/><p>My goodness, please let me die! I actually dared to point at the nose of the Sky Alliance Head and curse him to his face. I even intended to make him kneel before me… At this moment, Song Kuang even had the heart to commit suicide.</p><br/><p>The black-robed man felt his whole body trembling as he let out a desolate sigh. It was indeed him! It would be impossible for them to turn things around today. The Sky Alliance Head had already proclaimed that he was borrowing this place to settle his personal affairs and it wouldn’t be good for even the owner of this place to intervene. This single phrase of his had sealed all of their destinies! As for whether or not their Song Family would be entangled in this mess, that would be another issue altogether!</p><br/><p>Silence filled the place for a moment, before City Head Jiang’s trembling voice could be heard, “It was actually Head Tian settling your affairs. How would I dare to disturb you? I shall be taking my leave now. I have long admired Head Tian’s heroic name and if Head Tian is free, I invite Head Tian to pay a visit to my humble abode.”</p><br/><p>Following that, the sound of the soldiers leaving could be heard. All of the soldiers moved nimbly and quietly as though they were afraid of making a loud noise. A short while later, silence filled the entire place.</p><br/><p>Beads of sweat dripped down onto the ground from Song Kuang with his face completely ashen. All of them present were experienced individuals and they knew that their death was certain!</p><br/><p>Ling Tian’s eyes were narrowed as he lazily leaned back on the chair. His aura was already retracted and his finger tapped on the table lightly. In the ears of Song Kuang and the rest, that rhythmic tempo seemed to be the melody of their death!</p></div>\n</div>"}