{"title": "Chapter 639 - All Hope Turns to Dust", "id": 639, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-639-all-hope-turns-to-dust", "volume_title": "Volume 7", "body": "<h1>Chapter 639 - All Hope Turns to Dust</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“What a headache. How about this, catch all of them and cut off one of their arms. Use their arms as a token of identity to negotiate with those two old b*st*rds. As long as one of them takes action, the development of the matter won’t be within their control anymore. Pick a few people from the Sky Alliance to fan the flames and ignite this inferno. After that, we can all grab a seat and watch a good show. The existence of such an aristocratic family is akin to a tumor in the continent. We might as well get rid of them early. Song Kuang’s coincidental visit gave me good inspiration. Thinking about it, I should really thank him for this. As a reward, I will let him have a peaceful death.”</p><br/><p>Ling Tian stroked his chin and frowned slightly like he was a depressed young man trapped in the webs of love. His charisma shot out in all directions and if an ignorant young lass were to see him right now, she would definitely fall in love with him. However, the words that came out from his mouth were extremely bloody and devious.</p><br/><p>Ling One and the others were dumbfounded! If everything really went according to what Ling Tian had planned, these two large aristocratic families second only to the Shui Family would probably be wiped out in a short amount of time. However, the mastermind behind this event, the Sky Alliance, would not suffer much of a loss.</p><br/><p>“What are you looking at?” Ling Tian looked at the three of them with a strange look, “You guys are not going to carry out your tasks but are staring at me intently instead. Is there something on my face? The three of you couldn’t have learned some bad habits right?!”</p><br/><p>The three of them laughed bitterly at the same time and Ling Two said, “While Young Noble’s plan is brilliant, the two families aren’t idiots either. I am afraid that they would not fall for the trap despite their anger. After all, the strength of both families isn’t too far apart. If any one of the two families attempted to wipe out the other family, the outcome would probably be the mutual destruction of both families. If we are able to forecast such an outcome, I believe that they would be able to do so as well. I am afraid that the Song and HuangFu families would not make such a rash move.”</p><br/><p>“Idiot! You guys are truly fools! Are you guys pig-headed? You guys still dare to praise yourselves for being the brains of the Sky Alliance?!” Ling Tian cursed with disappointment, “While both the Song and HuangFu Family would not dare to make a rash move, can’t you spread the news out and arrange for some opportunities for the matter to blow up? For example, after news of their young noble being kidnapped spreads, one family would suddenly suffer a huge amount of casualties for no reason. The same thing would then happen to the other family. It wouldn’t be difficult for you guys to disguise yourselves as members of the Song and HuangFu Family right? Why do you guys need me to spell everything out so clearly?!”</p><br/><p>“If once isn’t sufficient, you guys can do it twice. Even three or four times wouldn’t be too much!” Ling Tian reprimanded, “All of you must try to look at things from a different direction and come out with new ideas. Do you understand? If not, what is the point of me teaching you guys the art of assassination?! As more and more people from their families die, they would understand that their destruction is imminent if they do not take action. If they go all out and fight, perhaps they can luck it out and survive for a longer period of time. With such a thought, I don’t believe that either of the families would still have any thoughts of playing it safe. You guys are truly idiots!”</p><br/><p>The three of them felt sweat rolling down their forehead. If things really turned out in such a way, an intense confrontation would certainly be the only way out. At the same time, their Sky Alliance would definitely be able to pick up a huge bargain. The most vicious part of this plan is the fact that even if both the families do not wish to fight, they would have no choice but to fight each other in the end! Even if they knew that their destruction would be the only outcome and that someone was pulling strings behind the scene, they would have no choice but to fall into the trap!</p><br/><p>The decision did not lie in their hands!</p><br/><p>The three of them immediately began their discussions.</p><br/><p>Ling Tian said with a cold laugh, “This matter must be accomplished before we leave Heavenly Wind! As for the Shui Family…” Ling Tian paused for a moment before revealing a mysterious smile, “leave them to me!”</p><br/><p>The three of them agreed in unison while thinking to themselves. The Shui Family is going to be your future in-laws. Who would dare to touch them?</p><br/><p>In the depth of the night, Shui Family.</p><br/><p>The dim candlelight illuminated two faces.</p><br/><p>“Rou’er, just what exactly happened in your trip to Heavenly Star? When we were in the main hall previously, there were too many people around and I did not want to go into details. However, I could feel that there must definitely be many hidden intricacies in your trip to Heavenly Star. You had better come clean with what happened in Heavenly Star, especially with regards to QianHuan’s whereabouts. I do not believe that Beyond Heavens would take Huan’er away.” The Shui Family Head, Shui ManKong fixed his gaze on his daughter’s face, “I do not believe what you said in your messenger pigeon. There are far too many things that don’t make sense! I only believe my daughter’s words!”</p><br/><p>Shui QianRou’s eyes were red and puffy, obviously crying a while ago. Looking at her father’s stern gaze, she felt a wave of anxiousness before a wave of grief. Speak the truth? Just what should she say? Would her father be able to take the blow?</p><br/><p>Seeing the grief in his daughter’s eyes, Shui ManKong had a bad premonition in his heart as he urged, “Hurry up! Say everything you know! You are not allowed to hide anything from me!”</p><br/><p>“In my trip to Heavenly Star, we first borrowed Northern Wei’s strength to break the military forces of Sky Bearing before controlling Northern Wei. After all, we have the most seeds planted in Northern Wei and our foundation is the thickest there. Our original plan was to make use of Wei ChengPing to control Northern Wei before giving the Yu Family a huge blow. When we set off to battle, we flushed out all of the officers that were related to the Yu Family and my brother personally led the army. I went to Sky Bearing to mess up all of the arrangements that Sky Bearing had…”</p><br/><p>“What were you guys thinking?! Do you think that Yu ManLou is someone so easily fooled? You guys were truly too bold!” As he heard Shui QianRou’s recount, Shui ManKong’s face turned dark, “You are trying to say that all of your plans were foiled by a single person? Ling Tian? After that, the reason why the Shui Family was able to set up the Shui Family Courtyard was also because of Ling Tian?”</p><br/><p>“That’s right!” Shui QianRou’s face flushed red in an adorable manner.</p><br/><p>Shui ManKong who was deep in thought did not notice his daughter’s expression and was trying to organize all of the information which he had learned over the past few days. After a long while, he said with a heavy tone, “If that’s the case, all of your plans were disrupted by a single person and Ling Tian stirred the clouds and the winds with just a flip of his palm. He is truly a heaven-defying talent!”</p><br/><p>Shui QianRou did not let out a single sound. Hiding within her father’s praise was a deep sense of wariness. However, Shui QianRou did not place all of these in her heart. Despite giving a brief outline of everything that had happened in Heavenly Star, Shui QianRou still had not told her father about her brother’s death. She just did not know how she should open her mouth about this.</p><br/><p>Shui ManKong looked at the oil lamp on the desk with loneliness on his face. The wrinkles on his face were clearly highlighted under the warm orange glow and his white beard glimmered slightly. He suddenly said in a cold voice, “If that’s the case, can you tell me just how did QianHuan die?”</p><br/><p>“Father!” Shui QianRou was caught off guard and let out a gasp.</p><br/><p>Shui ManKong looked away as he did not want to let his daughter see the tears in his eyes. However, his tone was still calm, “You described everything that happened in Heavenly Star but did not mention your brother from start to end. You are trying to avoid the topic in front of me. What does this mean? I am not that foolish! If not for the fact that QianHuan met his demise, why would you be acting in such a manner? Don’t tell me that the Martial Order Medallion owner brought him away. I do not believe that nonsense! If QianHuan was truly brought away by the Martial Order Medallion owner, why would you be avoiding the topic? It would be a huge matter instead and that would definitely be the first thing you said!”</p><br/><p>“Speak. I could already guess that QianHuan is no longer with us. But I wanted to hear it from you personally. What exactly happened!” Shui ManKong’s words were desolation. From the start to the end, his face remained turned away from Shui QianRou.</p><br/><p>“Big brother… big brother was…” Shui QianRou could no longer hold her tears in a burst out crying.</p><br/><p>Shui ManKong trembled as he grit his teeth, “What happened to him?! Speak!”</p><br/><p>“While big brother was ambushed in Northern Wei and suffered severe injuries, his injuries weren’t sufficient to threaten his life. He managed to escape to Sky Bearing and met up with me. After taking care of him, his injuries were already recovering! However, that hateful Shui QianJiang and Shui QianHu actually…” Shui QianRou’s words were filled with bone-deep hatred, “He actually further injured big brother and caused big brother’s injuries to turn fatal. Despite trying every means at my disposal, I was completely helpless and could only request for elder sister Ling Chen to seal big brother’s injuries with her Divine Ice Formula to preserve his life for seven days. During those seven days, we caught that darn Shui QianJiang and… with his last breath, big brother personally took his revenge before…”</p><br/><p>“QianHuan! Huan’er! My son!!!!” Shui ManKong’s figure trembled and his teeth clattered. Two drops of tears fell onto the ground and his back slouched forward as though it could never be straightened again…</p><br/><p>While Shui ManKong had already guessed it and prepared himself mentally, he still held onto the last flicker of hope in his heart. Although he pressed Shui QianRou to tell him the truth, he was hoping that his daughter would light up that last flicker of hope. Now that he personally heard of the news from his daughter’s mouth, Shui ManKong had completely despaired!</p><br/><p>He finally could not hold back his tears as he recalled the very first time his son cried out for ‘daddy’, the very first time he taught his son to write, the very first time he taught his son to…</p><br/><p>His only son would never return, would never cry out for ‘daddy’… His only son was already resting in a different place…</p><br/><p>Amidst his tears, it was as though Shui ManKong could see how his son struggled to kill Shui QianJiang with his final breath…</p><br/><p>“HELP ME TAKE REVENGE! FATHER!!!” His son was crying out to take revenge for him!</p><br/><p>“HUAN’ER!!!! AHHHH….” Shui ManKong raised his head and let out a heart-wrenching roar…</p><br/><p>This ambitious figure who was equal in status to Yu ManLou had broken down completely! His only son had left him! That was his only chance to pass down his bloodline and also his only hope! How devastating was it for the old to send the young off? Just what could he possibly look forward to in the future?</p><br/><p>Shui QianRou’s wept bitterly as her body trembled from her grief.</p><br/><p>A long while later, Shui ManKong finally came back to his senses. However, his gaze was vacant as he fell into a long daze. It was as though he could not see anything in front of him and he aged a decade in that instant…</p></div>\n</div>"}