{"title": "Chapter 640 - Huge Change in Heavenly Wind", "id": 640, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-640-huge-change-in-heavenly-wind", "volume_title": "Volume 7", "body": "<h1>Chapter 640 - Huge Change in Heavenly Wind</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3>Chapter 640: Huge Change in Heavenly Wind</h3><br/><p><strong>Translator: </strong>Atlas Studios <i class=\"_hr\"></i><strong>Editor: </strong>Atlas Studios</p><br/><p>“Father! How… how are you?” Shui QianRou was startled and she grabbed onto her father’s arm, shaking it as she wept.</p><br/><p>Shui ManKong’s maniacal laughter stopped abruptly and he panted heavily for a long while before regaining his cool. He then turned to look at his daughter. “Rou’er, you must not let your mother know about this! You have to hide it from her forever! She will not be able to endure such a blow and would definitely go crazy. Do you understand? Your brother is still alive and was taken away by Justice for treatment!”</p><br/><p>“I know what I should say, but Father, what should we do? It seems like it still isn’t the right time…” Shui QianRou nodded her head in agreement. She originally intended to hide it from her father as well but she was unable to do so. Although she truly wanted to take revenge for her brother as well, she knew that…</p><br/><p>“I… have my own plans!” Shui ManKong looked at his daughter before stroking her on the head indulgently, “Good daughter, don’t cry.”</p><br/><p>Shui QianRou’s tears streamed down her cheeks.</p><br/><p>“I originally intended to engage you to HuangFu Jun after your return,” Shui ManKong said with a self-mocking laugh, “but it seems like there isn’t a need to do so any longer. Rou’er, you are in love with Ling Tian, right?”</p><br/><p>Shui QianRou’s face flushed red and she was awkwardly silent.</p><br/><p>Shui ManKong smiled at her indulgently. “I also know that that darn HuangFu Jun would never be a match for my Rou’er with his horrendous character. However, I only wanted to gather some support to deal with your two uncles. Now that our family has completely fractured from within, why would I still sacrifice the happiness of my only daughter? Don’t worry, I will certainly not stop the two of you. After the generational battle, it can be considered that you have given your all for the family and you can go back to Heavenly Star to find Ling Tian. No matter where you go, you must always remember to be happy. Alright?”</p><br/><p>“FATHER!” Shui QianRou cried out and dove into her father’s embrace.</p><br/><p>Shui ManKong patted his daughter on the head and wanted to let out a sigh. But after a long while, he did not let out the sigh and swallowed it down instead. Looking at a direction where Shui QianRou wouldn’t be able to see his face, Shui ManKong’s eyes glowed with a thick killing intent…</p><br/><p>This night which was supposed to be a silent one was destined to be thrown into chaos. With Heavenly Star’s lord of massacre arriving at Heavenly Wind, he would definitely carry a storm of blood with him.</p><br/><p>While the members of the Yu Family and Beyond Heavens were probably drifting in the sea and would only reach Heavenly Wind a couple of days later, it was destined to be a sleepless night for the Shui Family today. After Shui ManKong sent Shui QianRou back to rest, he walked out of the secret chamber and stood in the pavilion alone. He looked at the starry night and basked under the stars for a whole night without moving a single inch. It was as though he was thinking about something or he was trying to accompany someone. The dew drenched his shirt and hair as this family head of the number one family stood silently in the night…</p><br/><p>There were plenty of others who had a sleepless night like him as well, including Shui ManCheng. Shui ManCheng also sat in a daze for a full night with the grief of losing his son. As for Shui ManShu and Shui ManPing, they gathered those who had just returned from Heavenly Star and analyzed every single event in detail. They hoped that they would be able to come to the conclusion that things weren’t the worst that they could be…</p><br/><p>As for Elder Shui WuBo of the Shui Family, he had a nice and cozy sleep.</p><br/><p>The sun was up and the continent became busy again.</p><br/><p>The hottest topic of discussion was undoubtedly the sudden appearance of the three Sky Alliance Heads. Their sudden arrival to Jade River City and current disappearance scared all the aristocratic families in the city to the point they did not dare to even leave their houses.</p><br/><p>The second hottest topic of discussion was the conflict between Song Kuang and Tian ZhiYi from the Sky Alliance. Song Kuang and his 25 followers had disappeared mysteriously with their life or death unknown…</p><br/><p>Another strange matter was the fact that both the members of the HuangFu and Song Families were weaving around Jade River City with their faces solemn as though they were about to have a huge clash! The atmosphere in the Jade River City was immediately in a state of tension.</p><br/><p>Thankfully, both families were able to restrain themselves.</p><br/><p>When it was noon, news began to spread from some unknown source that it wasn’t only young noble Song Kuang from the Song Family who disappeared. There were plenty of others who disappeared along with him. For example, the second young noble of the Song Family, the illegitimate son of Song TianQiao, and the concubine who Song TianQiao doted on the most.</p><br/><p>However, what the Song Family faced could still be considered alright and there was someone who faced an outcome far worse than that!</p><br/><p>The plight of the HuangFu Family was far worse than that! Their three young nobles disappeared without a trace before the two daughters of the family disappeared shortly after. In the end, even the wife of the HuangFu Family Head was also gone without a trace! Besides that, the treasured sword passed down over generations, the Heavenly Life Treasured Sword, was also stolen by a thief…</p><br/><p>The most unlucky person was undoubtedly the second young noble of the HuangFu Family, HuangFu Jun. He went to receive his beloved lady after her return to Heavenly Wind but was greeted with sarcasm and mockery before being heartlessly chased away. With a belly full of frustration, he could not even enter the door of his house and was knocked unconscious with a wooden pole…</p><br/><p>According to a few eyewitnesses, these blacked robed masked men were all martial arts experts. Especially the masked man who knocked HuangFu Jun unconscious was definitely a top-notch expert…</p><br/><p>With a series of such events happening, the two family heads were naturally furious. They sent out news at almost the same time that regardless of who the culprit was, the culprit would definitely pay a huge price! Even if they had to dig three feet underground to find the culprit, they would definitely dig the culprit up! They would catch the mastermind behind this whole affair and rip him into shreds! As such, the whole city was filled with a bunch of burly men charging around the city as though they were starving beasts.</p><br/><p>Both the families swept through the whole city without letting go of even a single corner. They had even searched the residence of the City Head but weren’t able to find even a trace left behind by the culprits! Despite mobilizing such a large number of troops, they weren’t able to find a single clue!</p><br/><p>Such an outcome was far too shocking!</p><br/><p>These two families were considered to be powerhouses in the Heavenly Wind Continent and Jade River City was the territory of the HuangFu Family! However, the enemy was actually able to capture their young and old right under their very noses without leaving behind a single clue for them to follow! This was akin to giving the HuangFu Family a tight slap on the face!</p><br/><p>The Family Head of the HuangFu Family, HuangFu YanHan was thoroughly enraged as he cursed vehemently at the top of his lungs for a few hours straight. His voice could be heard from a few streets away and those staying near the HuangFu Residence could clearly hear every single word that HuangFu YanHan said. It turns out that this Sir HuangFu actually had such a hobby. Despite cursing someone, his cursing was like a melody without a single phrase being repeated over the past few hours. What a talent!</p><br/><p>Whenever the HuangFu Family Head left his residence, the passersby would look at him with worship in their eyes. This couldn’t be helped as his cursing was far too classic! If those words came out from the mouth of a delinquent, everyone would only treat it as the delinquent letting out a fart. But when these words came out from the famous HuangFu YanHan, they had a completely different flavor! Thus, the HuangFu Family Head had an explosion in popularity despite his graying hair…</p><br/><p>After news of the chaos spread out for a day, the HuangFu Family noticed a delicately made box outside their door on the morning of the next day.</p><br/><p>All of the HuangFu Family experts surrounded the little box as though they were facing a powerful opponent as they opened the box warily. However, the box only contained a letter and some item which was wrapped up thickly in white cloth.</p><br/><p>“HuangFu Family Head: Sir HuangFu YanHan. The world is in admiration of Family Head’s majesty and prestige and the prosperous rise of the HuangFu Family truly makes one envious. With the talent of Family Head HuangFu, Family Head HuangFu must not be willing to bow your head under others and would definitely want to have an empire of your own. Just as the saying goes, how would one allow an enemy to lie beside you when you are asleep. This untalented one is here to help Family Head share your burdens.</p><br/><p>The three young nobles and Madam have been invited by me to be an honored guest and I will definitely serve them carefully. I think that the chance for Family Head HuangFu to rule over the entire continent is right before your eyes and ruling over Heavenly Wind is only a matter of time! The Song Family is too arrogant and unbridled, daring to create trouble in Jade River City! While I am an outsider, I am thoroughly enraged by such an action and cry out in grievance on behalf of Family Head HuangFu!</p><br/><p>Who does the Song Family think they are? They are no more than a nouveau riche family! To think that they dare to be so bold and challenge the City Head of Jade River City in public! If we do not teach them a good lesson, these little b*st*rds would look down on the prestige of the HuangFu Family. Just as the saying goes, we should not bear with the unbearable!</p><br/><p>Thus, in order to accomplish the ambitions of the HuangFu Family, this little one boldly invited the HuangFu young nobles, young madams, and Madam HuangFu to rest at my place. If Family Head sends out your forces immediately to wipe out the Song Family, half the continent will belong to the HuangFu Family. The opportunity is right before your very eyes and should not be missed! The day when Family Head HuangFu returns victorious will also be the day when your loved ones return to your family!</p><br/><p>In order to prevent Family Head from being suspicious, I specially prepared a gift for Family Head and hope that Family Head will come to a decision soon. One will only be able to become a hero in times of disaster and one will only be able to build his legacy in chaotic times! Despite the letter being short, my emotions flow deep and it is my deepest regret that I am unable to enjoy a glass of wine together with Family Head HuangFu! Family Head HuangFu is a refined individual and I hope that you will forgive this boorish individual.</p><br/><p>I need to remind Family Head HuangFu to take note of something. If Family Head HuangFu does not make a move within three days, we will have another small gift for Family Head. May Family Head accept this little insignificant gift of ours.”</p><br/><p>The name which was signed off was a strange one: A warm-hearted individual!</p><br/><p>The members of the HuangFu Family stared at each other with disbelief and HuangFu YanHan snatched the letter in a fit of rage and ripped it to shreds. He took a few heavy breaths and a thick killing intent was emanating from his face.</p><br/>\n</div>"}