{"title": "Chapter 650 - Utterly Insane", "id": 650, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-650-utterly-insane", "volume_title": "Volume 7", "body": "<h1>Chapter 650 - Utterly Insane</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Ah’Hei sniggered as he replied, “The second young noble will certainly deem him as a precious treasure, which will fetch quite the tidy sum for us, haha! Just like that time, when you sent over those homosexuals, didn’t the second young noble give you a thousand taels of silver as a reward?”</p><br/><p>Black lines appeared on Ling Tian’s forehead at this time, and he almost regurgitated all that he had just eaten. Damn it, this young noble only wanted to poke fun at them, to think that I landed myself in such a disgusting situation! Never did I expect that the HuangFu Family would deal in such matters, and their second young noble to be a homosexual himself!</p><br/><p>“You’re seeking death!” Ling Tian did not have the patience to continue hearing. Rage burst out from his heart and head, and a sense of viciousness surged out from his guts. He put out a hand and dragged the still laughing Ah’Hei over, just like grabbing a bunch of hay, before ruthlessly slamming his face onto the table. The resulting impact sent the soup on the table flying everywhere, and a piercing squeal not unlike that of a pig being butchered rang out.</p><br/><p>Ling Tian did not have any intention to do anything else. In the first place, he tried to freeload a meal, thus it was his fault. However, after having heard such a disgusting matter, he thought that if he did not punish these guys severely then he would be too ashamed to face those people that came after him and fell into this ploy!</p><br/><p>Lifting Ah’Hei’s head up, Ling Tian saw that it was already covered in blood. He then savagely rammed it down, grinding it further to resemble meat paste. He lifted it up again and slammed it down. A cracking sound was heard this time as the table sported a new hole. Ah’Hei’s head was wedged perfectly in the hole, remaining there motionless as he had passed out long ago.</p><br/><p>The hooligans off to the side stared with their mouths wide open in shock, gazing at this genteel-looking young noble that could pass as a gigolo. Who would have thought that he actually possessed such ruthless methods? They immediately started to shiver, a pleading expression in their eyes.</p><br/><p>“Seems like you guys have done such a thing for your second young noble more than once?” Ling Tian grinned toothily, his dazzling teeth charming all present.</p><br/><p>“Not… not many times…” The three hooligans, who were aware that they had met with a vicious character this time, were so scared that their legs seemed to turn into springs. They only felt their bodies filled with anxiety.</p><br/><p>“Not many times? That means it’s not the first time you guys did this?!” Ling Tian’s smile grew even colder. “What’s up with today?”</p><br/><p>“Today… tetete…” The hooligan’s teeth constantly clattered against each other in fright as he spoke, “When young noble here walked in, that fatty sent… sent someone to look for us to say… to say that a quality good had arrived… and we were to prepare.”</p><br/><p>“Quality goods? What sort of quality goods?” Ling Tian coldly snapped, “What preparations!”</p><br/><p>“The preparations are for the event that any young and handsome young noble walks in, we would then bring them to the second young noble to look over. If they are not to his liking, then we would send him to the… Leisure Elegance Courtyard, south of the city. Those homosexuals there… gladly welcome any new additions…” Seeing how Ling Tian’s expression grew worse with every word he spoke, the hooligan had to literally force the remaining words out of his mouth!</p><br/><p>Ling Tian felt himself nearing the brink of insanity. “Who’s this second young noble of yours?”</p><br/><p>“It’s… It’s the second adopted son of the HuangFu Family Head. He… he loves beauties but even more, he loves…” Suddenly, seeing the incensed expression on Ling Tian’s face, the hooligans had an idea, and immediately cut short, kneeling down and bawling instead, “Please spare our lives, young noble, we’re… we’re forced to do so as well…”</p><br/><p>“Forced to?” Ling Tian gritted his teeth, “I guess you all were forced to the point that your stomach and intestines are full to the point of bursting, and your families are flooded with unimaginable wealth! What a good ‘forced to do this’, what good forcing this is!” His face suddenly turned cold as he spat, “Then you better know that this young noble is also forced to kill you!” The moment his final sentence landed, the three hooligans immediately collapsed as though they had just drunk a potent jar of wine, and a chopstick was stuck in every man’s temple…</p><br/><p>Turning his attention back to the fatty, who had long lost consciousness, Ling Tian manhandled him up, and with two sounding slaps, smacked his head left and right. Pearly white teeth that were soaked in blood fell out with every slap… and the pain naturally woke the fatty up.</p><br/><p>Ling Tian dusted his hands, wiping the bloodstains on the originally spotless clothes of the fatty, before slowly speaking to him in a ‘warm and friendly’ voice, “Was it fun? Do you still want to play some more?!” He bared his teeth, revealing two perfect rows of pearly white teeth, just like a ferocious tiger who was opening its mouth wide for a bite.</p><br/><p>Ling Tian’s actions caused the shocked fatty shopkeeper to recover his senses. He had a mind to yell out a warning, but he did not dare, and could only forcefully swallow his fear. His beady eyes the size of green beans pitifully blinked, and he suddenly bawled out loudly in fright. However, his cries had just sounded when he suddenly vomited, and as he threw up, he gazed down… to meet with the four pairs of eyes staring at him from the four corpses on the ground. His body trembled, and his eyes immediately rolled up and he fainted once again…</p><br/><p>The poor fatty had been forcefully shocked silly by whatever was happening!</p><br/><p>“Hmph!” Ling Tian hatefully looked down on at his feet, as he thought to himself, “Could it be that I missed out on a young noble of the HuangFu family? How could HuangFu YanHan actually raise such a useless godson? To even have such a hobby? It seems like I have to personally take a look.”</p><br/><p>As he thought, Ling Tian had a look of contemplation as he leisurely walked out. When he walked past the fat shopkeeper, he seemed to have planned it such that he accidentally stepped on the fatty’s head, and with a clear cracking sound, it burst apart like a ping pong ball, and the white brain matter intermixed with the red of blood splashed everywhere around the room.</p><br/><p>Without even turning his head, Ling Tian walked out of the restaurant, picking his teeth as he walked around to obtain information. Those whom he had talked to all showed a face of fear the moment they heard of the HuangFu Family’s name, as though they had just heard the name of a feared plague, immediately avoiding him. Ling Tian asked over half a dozen people to no avail, and it took some difficulty to finally get an old lady to reveal their location. However, huge waves were already forming in his heart.</p><br/><p>With Ling Tian’s current hearing abilities, the surrounding few hundred miles of conversation could not escape his ears. There were cries of pain, curses, and all of them were directed towards the HuangFu Aristocratic family! As he walked, Ling Tian’s expression grew more solemn and heavy! To think that such a corrupt family actually managed to keep developing to this point! This was really an anomaly!</p><br/><p>Ling Tian had already made his decision in his heart, which was the fact that he would completely uproot and destroy the HuangFu Family today! No matter Heavenly Wind Continent or Heavenly Star Continent, such black sheep of the human population was something Ling Tian could not allow to continue living on this earth! This was especially so for such an evil family with power and influence, and the longer they lived on this earth, the more innocents would suffer! Ling Tian knew that he was no savior, but he had a clear conscience in whatever he did. While he wasn’t able to save the whole world on his own, he just needed to show some concern for those that he was aware of. No matter how little it was, every life saved was a life earned! And if a pair of evildoers could be killed, then he would not settle for one!</p><br/><p>As Ling Tian strolled along and listened for news while walking towards the HuangFu Family, HuangFu YanHan and Song TianQiao were also rushing back on horseback as though their lives depended on it. They had no choice, for Ling Jian only gave them a day’s worth of time, and after this day, there might not exist such a thing as a HuangFu Family!</p><br/><p>HuangFu YanHan, however, was completely unaware that no matter the choice he made, his family would only have one fate – to be destroyed! No one would have expected that young and promising godson that he adopted to soundlessly become the greatest malignant star in his family.</p><br/><p>The HuangFu Family was destined to perish in the rivers of time!</p><br/><p>If HuangFu YanHan were to discover that the source of his disaster was because of twenty taels of silver, he would likely pass out from vomiting blood! Were he to discover this matter earlier, he would rather have taken out 2,000 silver in order to prevent this disaster! Even if one were to rip him off, it would still be fine!</p><br/><p>Ling Tian summed up his order to destroy the HuangFu Family, sending down the command. He believed that before long, the Sky Alliance would rush over to the scene under the orders of Ling Jian and company! However, Ling Tian himself could not be bothered to wait any longer, and he chose to first head into the influence of the HuangFu family…</p><br/><p>****** *******</p><br/><p>Releasing his grip, the corpse which was still alive moments ago collapsed at his feet like a lump of mud, without any sign of life left within. The cold and piercing gaze of Ling Tian revealed endless amounts of frosty killing intent! If it wasn’t for him personally hearing and witnessing things, he would never have believed that it was possible for someone to commit such atrocities! Furthermore, it wasn’t just once or twice, but countless times, without any sign of repentance! As if that wasn’t enough, they even purposefully put on the airs of a saint, as though they did not have any sin! The godson of the HuangFu Family was even more splendid, a true genius at incurring heaven’s wrath! Well, that was provided if there was ever justice to be found by looking at the heavens.</p><br/><p>Whether there was justice in the heavens, Ling Tian would not know, but Ling Tian definitely trusted his own eyes!</p><br/><p>He silently infiltrated in the west lateral courtyard of the HuangFu Family’s house. This was the residence of where HuangFu YanHan’s favorite second godson lived, and after grabbing hold of a guard and forcing out an answer, Ling Tian’s anger had reached a boiling point.</p><br/><p>As someone who had lived across two lifetimes, while Ling Tian wouldn’t dare to claim that he possessed more self-restraint than all others to the point of controlling his emotions, he could at least perform the bare minimum of hiding his thoughts. To have our Young Noble Ling so furious, one could imagine just the sort of things this HuangFu ‘Sex’ young master did! [1]</p><br/><p>These few years, just the broad outline coming from the guard he previously coerced already showed that more than a few thousand ladies had been trafficked in the hands of this young noble to various parts of Heavenly Wind Continent. As for forcing ladies into prostitution, or turning people homeless and destitute, these were too numerous to even count! Not to mention capturing those fresh-faced males and forcing them into slavery for other degenerates to abuse as they wished, which also numbered in the thousands! Furthermore, a large number of these victims were also shipped to the distant Heavenly Star and Heavenly Sun Continents, earning an astronomical sum of wealth for the HuangFu Family!</p><br/><p>The wealth obtained was already so terrifying, but it was common knowledge that even the most ordinary guard could know. So what was the actual total revenue?</p><br/><p>Just how much did they indulge in these poor citizens?!</p><br/><p>Devoid of conscience, utterly insane! If this daddy here is unable to clear off your entire HuangFu Family today, then my name will not be called Ling Tian!</p><br/><p>Ling Tian clenched his teeth in determination. Today, even if the Heavenly Emperor personally descended to earth to beg for mercy on the HuangFu Family’s behalf, the outcome would still not change! Even if they could descend, would they even deign to do so for such scum of society? The only place that such scum belonged to was hell!</p><br/><p>If the HuangFu Family’s head, HuangFu YanHan wasn’t aware of such a matter, that would be the biggest pile of dogsh*t on earth! D*mmit! If you were able to count so much silver every day, why wouldn’t you even question the source of such wealth? It would be weird if he wasn’t aware of such matters at all! As such, Ling Tian had already made up his mind in a split second. Even if he had to kill off all five descendants of the HuangFu Family today, he would rather do so than believe that any one of them was innocent! It might be so in the other families, but in the HuangFu Family, the fact that you were born in such a family meant that you had to shoulder this sin!</p><br/><p>Pull out the weeds by the roots, and leave none remaining!</p><br/><p>He left behind a trail of bodies in his wake, and as he barged into the living hall, Ling Tian did a brief search and finally found a wide wardrobe inside one of the bedrooms. With some strength, the wardrobe slowly squeaked open, and it revealed a wide passageway to the underground, with even steps cut in the stone leading down to the basement. From down below, an unsatisfied voice hollered out, “Wang Three, what the hell are you even rushing us for? When us brothers are done pleasing ourselves, it will be your turn then. You always get the d*mned first slot, and only this time you are standing guard outside, do you need to be so urgent about it? How useless!”</p><br/><p>A cruel and cold smile stretched across Ling Tian’s mouth, and he jumped straight down without any hesitation.</p><br/><p>From within the chamber obscene laughter, as well as the despairing screams of women, continuously sounded. These voices were clamorous, indicating the presence of a multitude of people. It turned out that this place was actually a large scale private area for degenerate pleasures!</p><br/><p>After advancing a little, lights filled his vision as a huge cavernous space almost the size of half a basketball court appeared, with numerous Night Illumination Pearls placed densely on the rooftop of the stone chamber, brightening up this area as though it was daytime.</p><br/><p>Surrounding the area were countless stakes with many young ladies lashed on them, their bodies drawing the  character… their heads hung powerlessly down, the hair covering their faces. Many of them were not moving, and it was unknown if they were dead or alive.</p><br/><p>Gazing around, Ling Tian could not help but feel the blood rush to his brain as he stewed in anger. He viciously scolded, “Beasts! A bunch of beasts! You deserve death!”</p><br/><p>There were more than 100 young ladies without a single stitch on their bodies inside this area. Every one of them had the same hopeless expression on their eyes, staring aimlessly into the distance. As for their screams, movements, and cries, they were all instinctive, but they already had no hope of being saved.</p><br/><p>30 to 40 men were similarly without a single thread, every one of them pressing down a girl under them as they barbarously moved. Bursts of crazed laughter sounded now and then, and their faces were all warped into a rictus of pleasure. The ladies under their bodies all powerlessly kept their eyes open, enduring the punishment in despair…</p><br/><p>Peng! Ling Tian’s body flashed, and he pried up the closest hooligan away from the girl, before giving him two tight slaps. The crisp sound echoed throughout the stone chamber and everyone immediately stopped their movements, staring at this uninvited guest. For a moment, no one could process his presence.</p><br/><p>“Who is HuangFu QingYun?” Ling Tian coldly hollered.</p><br/><p>“Who are you?” A large person that was completely naked stood up, viciously staring at Ling Tian. He then let out a strange laugh. “No matter who you are, you must be tired of living to dare to barge inside this place. A pretty boy? Are you itching to get deflowered by me? This daddy will surely satisfy you, I’ll let you experience heaven!”</p><br/><p>Ling Tian only ruthlessly smiled before his body moved, dragging the speaker over by the hairs on his scalp. Throwing him upwards, he caught that person’s arm, and with a sudden yank, he tore the entire arm off in a shower of blood. The sinew from the arm hung out a few feet long in length, twitching like a snake as fresh blood spurted out. The big guy screamed crazily for a moment before fainting! A cruel smile laced Ling Tian’s face as he stepped on the wound he created, before harshly grinding down on it. Cracking sounds could be heard, as though one was walking through a forest filled with dried bamboo, as the remaining bones of his upper arm were smashed to bits!</p><br/><p>Everyone present immediately yelled out in shock. This incomparably violent scene left them frozen in shock. More than a hundred pairs of eyes stared directly at Ling Tian, as though witnessing a demon that had just stepped out of hell, their bodies filled with an ice-cold fear! They were however unaware that the first two slaps he had given the poor guy at the start had immediately shattered his skull, causing him to lose his life immediately. However, looking back on it, this guy was the most blessed as he died in the most painless manner possible without having to suffer this torture of hell on earth!</p><br/><p>The big guy who had the bones on his arm ground to bits screamed in agony as he woke up from the pain. The moment he opened his eyes, he came into contact with Ling Tian’s eyes that were filled with killing intent, and immediately shut up, trembling in fear.</p><br/><p>Ling Tian stared at them, slowly asking, “I’ll ask again. Who here is HuangFu QingYun?”</p><br/><p>Perspiration the size of beans appeared on the brow of the man, as his face contorted into a mass of lines due to holding in the pain. He forcefully lifted up his other arm, pointing towards a direction.</p><br/><p>At the end of where he pointed, a pale white youth about twenty years old could be seen. He was still pressed onto another lady a moment ago, but now he scrambled up his feet as he stared at Ling Tian. While he was not aware of Ling Tian’s identity, from the ability that the latter had displayed along with his movement technique and ruthless methods, even if all the men present were to mob him it would still be a futile attempt! A heavy sense of death loomed in HuangFu QingYun’s mind.</p><br/><p>HuangFu QingYun slowly stepped backward, his mouth babbling nonsense as he did, “You… who are you? This hero, if you have words to say… then let’s hear it. I… I can give you gold, silver… I can give you all my wealth, you you you… don’t kill me. Whichever girl here catches your fancy, you can just… take her and go. If one… one is not enough, then… take a few, AH! ——”</p><br/><p>As he was constantly babbling, Ling Tian was slowly walking towards him, with an expression of killing intent. Wherever he passed by, every thug within thirty feet of himself would fall to the ground noiselessly. However, these guys were not dead, not a single one.</p><br/><p>This was obviously not because Ling Tian suddenly had a change of heart, and wanted to let them go. It was because Ling Tian had sworn that he would definitely not let them die in such an easy and painless death! To allow them to die so easily would be letting them off too easily. Whatever they did had already far crossed Ling Tian’s bottom line, and they definitely needed to pay a price! The cruelest price possible!</p><br/><p>Thus, Ling Tian decided that, even if they had to die in the end, then the time spent between meeting him and dying would be a memory that they would strive to forget even after they had become spirits!</p><br/><p>Peng! The naked HuangFu QingYun kept retreating until he finally backed up onto a stake. From his horrified eyes, Ling Tian slowly stretched out his hand, holding him by his neck. HuangFu QingYun’s eyes rolled as the suppressed fear and looming death in his heart finally burst out and knocked him blissfully unconscious. At this point, he was lucky to be unconscious!</p><br/><p>Releasing his grip, Ling Tian hatefully stared at the guys on the floor, before turning towards the girls that were looking at him with some fear and distrust. He warmly greeted them, “Ladies, you are saved now, I’m here to rescue you. Right now, could I trouble you to help me with something?”</p><br/><p>Upon knowing that they finally would be saved, the overwhelming happiness caused all the girls present to flood the place with their tears. It was only after a while that a round-faced girl shyly covered her privates and gathered the courage to ask, “This… this Mister, may I ask how us lowly slaves can help you?”</p><br/><p>Ling Tian smiled in return, pointing to the heap of clothing at the corner and replied, “Could you all first release the rest of your sisters that are still tied up, then put on some clothes, before tying these beasts on the same stakes? Do you dare to do so?</p><br/><p>“We dare!” All the ladies immediately agreed, clamoring when they heard his words. They immediately rushed towards the scattered articles of clothing in embarrassment, hurriedly putting them on. It was at this point that they affirmed this elegant and handsome young man was indeed here to rescue them, putting an end to their cruel suffering. Their day of revenge had finally arrived! As they gazed at the frozen figures of the men lying on the floor, all their eyes immediately filled with hatred and cruelty. For these devils that they did not even dare to make eye contact with daily, could today actually be the day where they sent them down to hell?</p><br/><p>[1]: The Chinese character for adopted godson is also a slang meaning ‘to have sex’.</p></div>\n</div>"}