{"title": "Chapter 673 - Rebuke in the Face", "id": 673, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-673-rebuke-in-the-face", "volume_title": "Volume 7", "body": "<h1>Chapter 673 - Rebuke in the Face</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>It was a starless night.</p><br/><p>A shrill eagle’s cry could be heard in the sky!</p><br/><p>A black bolt of lightning swooshed down and as Ling Tian stretched out his arm, a black eagle with talons like metal landed on Ling Tian’s arms. This was the eagle that Ling Tian had trained since it was young and it was used to send messages. This eagle before him was different from his ordinary messenger falcons. It was extremely intelligent and its speed was twice that of an ordinary falcon.</p><br/><p>The eagle’s little beak pecked Ling Tian’s shirt in a friendly and loving manner.</p><br/><p>A couple of years ago, Ling Tian went hunting in the mountains and found an eagle’s nest with nine eggs inside. Being unable to find the parent eagle, Ling Tian guessed that the parent eagle must have been killed by the other hunters and thus he brought the eagle eggs back and tried to get a mother hen to incubate these eggs. Who would have thought that he would actually succeed and nine baby eagles were born? These nine eagles were now the trump card of Ling Tian’s intelligence fleet.</p><br/><p>Even up to now, Ling Jian and the others were still joking about an eagle flying out from a hen’s nest. After Li Xue found out about this incident, she naturally mocked and criticized Ling Jian badly for it.</p><br/><p>Only Ling Tian and Li Xue who came from the present day would know that apart from the mother eagle, the second-best alternative would be a mother hen. Even a phoenix would probably not be as effective as a mother hen! There were many scientific principles behind this and it was naturally too difficult for them to explain the matter. Even Ling Tian and Li Xue weren’t completely sure of the scientific principal themselves, not to mention attempting to explain it to someone else!</p><br/><p>Ling Tian smiled and stroked the feathers of the eagle. The eagle raised its head proudly as it let out a few cries. Ling Tian then untied a piece of paper from the leg of the eagle and unrolled it. Upon reading the note, Ling Tian’s expression changed and he turned around. “Inform Ling Jian to gather all the appointed members. Prepare to leave!”</p><br/><p>Ling Chen who was standing behind Ling Tian silently acknowledged the order.</p><br/><p>Li Xue asked lazily, “Are they from the Yu Family or Above Heavens?”</p><br/><p>Ling Tian shook his arm slightly and the eagle shot into the sky with a shrill.</p><br/><p>Ling Tian then turned to look at Li Xue with a smile, “Surprisingly, they belong to both families.”</p><br/><p>Li Xue let out a sigh, “My heart is too soft and I really do not wish to kill them. Why do they have to force me to kill them? Could it be that they truly do not wish to remain alive? Why do they always have to make the kindhearted me kill?”</p><br/><p>“Is it not so? Miss Li Xue is the most kindhearted person in the world!” Ling Tian played along and displayed a look of grief. “It is truly too much for them to force the kindhearted Miss Li Xue as such!”</p><br/><p>“Why are your words so full of sarcasm? Is this miss not kindhearted?!” Li Xue glared at Ling Tian.</p><br/><p>Ling Tian hurriedly replied, “Of course not. Everyone knows that Miss Li Xue’s heart is the kindest and she is almost as kindhearted as Buddha himself!” After being tricked by Miss Li Xue again, how would Ling Tian dare to go against her? He would naturally agree with everything that Li Xue said!</p><br/><p>“That’s more like it. However, all of these people are also too foolish. Isn’t it just surrendering? They only need to kneel on the ground and kowtow a few times in order to save their lives. Why can’t they understand that?” Li Xue frowned and continued her act.</p><br/><p>“The Buddha is merciful.” Ling Tian lowered his head and chanted solemnly.</p><br/><p>Li Xue finally could not hold her laughter back in and burst out into chuckles. As she rolled her eyes at Ling Tian, Ling Tian was entranced by her beauty and could not help but be tempted in his heart. “Beauty, are you ready?”</p><br/><p>“I am always ready! What do you mean by whether or not I am ready?” Li Xue asked doubtfully before seeming as though she was enlightened. “Isn’t it just killing a few scum? Do I really have to get ready to deal with them?”</p><br/><p>Ling Tian stammered for a moment before chuckling, “I am asking, are you ready for something else?”</p><br/><p>“Almost ready. Eh? How did you know?” Li Xue answered instinctively before looking at Ling Tian with her eyes widened. I prepared this matter in secret and was about to give him a surprise. How does he know about it?</p><br/><p>“Err?” It was Ling Tian’s turn to be puzzled as he rubbed his head, “I know about what? Do you have something else you are hiding from me? What is it!”</p><br/><p>“Then why did you ask me if you are ready? Don’t tell me you don’t know?” Li Xue asked with doubt.</p><br/><p>“Err… I am saying, if you are ready, I shall go to your room to spend the night!” Ling Tian laughed like a lecher. “How about that?”</p><br/><p>“You! You… go and die!” Li Xue’s face flushed red and she grabbed a piece of flesh on Ling Tian’s arm. She then formed the shape of scissors with her fingers and threatened, “If you dare to come, I shall snip it off! You can try it if you don’t believe me!”</p><br/><p>Ling Tian immediately felt his back turning cold as he felt a gust of cold air blow past his thighs, “No no no, I wouldn’t dare.”</p><br/><p>“I also think that you wouldn’t dare!” Li Xue snorted. But for some reason, she also felt an uncomfortable feeling in her heart when she heard that Ling Tian did not dare.</p><br/><p>Noticing Li Xue’s emotions, Ling Tian suddenly said boldly as though he was ready to sacrifice his life in battle, “Who says that I don’t dare to? Hmph hmph, just wait! This young noble shall see who comes out on top!”</p><br/><p>Li Xue’s face turned red and she grunted before falling silent. She suddenly felt as though her whole body was burning up. As an individual who cultivated the Divine Ice Formula, this was an extremely rare phenomenon.</p><br/><p>In order to cover up her embarrassment, Li Xue asked, “How do you intend to deal with all of them after this incident?”</p><br/><p>Ling Tian replied indifferently, “They massacred countless innocent villagers without even sparing the animals. Such an action cannot be tolerated by the heavens! I naturally do not plan to leave anyone alive! I shall kill them all as living sacrifices to the dead!”</p><br/><p>“Kill them all as living sacrifices?” Li Xue asked and she forgot about her previous embarrassment, “Are you just going to kill them so easily? Don’t you have any other special means?”</p><br/><p>Ling Tian was taken aback and he looked at Li Xue, “What do you mean?”</p><br/><p>Li Xue let out a sigh and said, “Young noble Ling. You are going to be the ruler of the world in the future, how can you not understand such a simple logic? You could naturally do as you wanted in the past without thinking of anything else. However, the war for hegemony is about to come to an end soon. After wiping out Above Heavens and fighting a final battle with the Yu Family, the entire world will be in your hands. Why are you still acting so recklessly based on your own personal whims?”</p><br/><p>Ling Tian took a couple of steps forward and asked, “You want me to use this incident to deal a blow to Yu ManLou?”</p><br/><p>“Not just Yu ManLou.” Li Xue said with a tinge of exasperation, “You should be considering the will of the commoners at this moment! For the Yu Family to perform such an act that cannot be tolerated by the heavens, wouldn’t it be a waste to just settle for killing them? You will be helping the Yu Family to silence all of the culprits! You should catch them all alive and announce this matter to the public during the ceremony! At that time, whether or not you want to behead them or skin them alive will be up to you. While the outcome will still be their deaths, we would be able to make use of this incident to deal a blow to Yu ManLou and incite the rage and compassion of the commoners. We would also be able to display how our Divine Prefecture Empire cared dearly for the commoners and will punish any lawbreakers with thunderous methods. The benefits from this would be far greater than just killing a couple of fellows. Not to mention the fact that these experts are from the Yu Family. Even if they weren’t, you must blame the matter on the Yu Family! Your political sense is just too greatly lacking!”</p><br/><p>“While it wouldn’t be auspicious to kill during the ceremony, this is only one way of putting it. Another way of putting it would be to use the blood of our enemies as a sacrifice for the flag of our Divine Prefecture Empire! This would also serve the purpose of exciting the public! With war imminent, no one would question our behavior for sure! Besides, with your dictatorial personality, I don’t think anyone will dare to say anything!”</p><br/><p>“It is best for you to spread this matter out and create as large of a commotion as possible! At that time, the Yu Family will lose the heart of the commoners and when battle breaks out, our Divine Prefecture Empire will be far superior to the Yu Family when comparing the foundation in the commoners. We can then declare to the world that Yu ManLou is cultivating an evil martial art right before the battle and announce that we are seeking justice for the world. At that time, while it would still be a war between two empires, Yu ManLou would be the evil entity of the world. Together with this matter in the background, the Divine Prefecture Empire would naturally be on the righteous side! Such a benefit is something that you should probably understand.”</p><br/><p>“Furthermore, another benefit of revealing Yu ManLou’s evil martial art would be to force Beyond Heavens who always claim that they are the protectors of the world to stand on our side. With the aid of Beyond Heavens and the Heaven Splitter in your hands, you can come up with any story you like! Uniting the world would be something that you can look forward to! If you continue to kill and fight as you wish, when will the war come to an end? The outcome may be the mutual destruction of both empires only to benefit a third party! How foolish!”</p><br/><p>Ling Tian was greatly enlightened by Li Xue reprimanding him. “Right right right, Xue’er is extremely right. I am truly too foolish! Your plan is truly wonderful!” He then took a step forward and grabbed Li Xue’s hands and said while stroking them, “Gaining such a lover is akin to gaining a brilliant strategist to aid me in my conquest! If I am able to unite the world and win the war of hegemony, my lover would definitely have the biggest merit. For a man to gain such a wife, what else do I have to ask for in life?”</p><br/><p>Ling Tian muttered nonsense while trying to take advantage of Li Xue.</p><br/><p>Li Xue initially thought that Ling Tian was truly moved by her words. However, upon seeing Ling Tian grab her hands like a lecher, she could not help but fly into a rage and snatch her hands out from the devil’s grasp. “Didn’t you think of all this already? You are intentionally making me say it. Are you using me for your amusement again?”</p><br/><p>“Errr… of course not. I do not have the foresight and wisdom of my dear Xue’er.” Ling Tian immediately replied. He truly wasn’t faking it this time. While he had a vague idea of all this in his heart, since he had already given the order to have them all killed as living sacrifices, he did not think about it any further. Li Xue did indeed remind him of something extremely important.</p><br/><p>“Then you…” Li Xue glared at Ling Tian angrily. She originally wanted to come up with a good idea hoping that Ling Tian would feel as though he was enlightened so that she could feel a sense of accomplishment. However, she never thought that Ling Tian’s reaction would be to take advantage of her instead.</p><br/><p>Somethings not right, Li Xue suddenly thought to herself. Since she could think about it, Ling Tian should have been able to think about it with his wisdom. But why didn’t he make such a decision? Why was he still fooling around after she mentioned it?</p><br/><p>There was only a single reason. Ling Tian wasn’t willing to do so!</p><br/><p>Li Xue’s face turned solemn and she looked at Ling Tian with sharp eyes. “Ling Tian, are you still treating the war for hegemony as a huge game? A game that you want to continue playing?”</p><br/><p>Ling Tian fell silent and did not say a single word.</p><br/><p>Li Xue took two steps forward and said with a heavy tone, “Before this, perhaps it was reasonable for you to treat the war for hegemony like a game. But at this very moment, it would be a huge mistake if you want to continue doing so! Right now, there is a chance for the entire world to be united because of your presence. Regardless of what your initial intention was, it is no longer important. It is now time for you to take responsibility for the commoners of the world! Ending the war earlier would mean less suffering for the commoners! So…” Li Xue glared at Ling Tian coldly, “stop treating this as a game!”</p><br/><p>“Even if your soul does not belong to this world, you can no longer return! Even if your thoughts and knowledge are from beyond this world, you no longer have a choice. It is time for your thinking to change! If not, even if you become the ruler of the world, you would not be concerned about the suffering of the commoners and would only be a cruel ruler! You would only leave a disaster for future generations!”</p><br/><p>Li Xue looked at Ling Tian and said, “You are very selfish! You have always been until today! However, it is time for you to make a choice! For the world!”</p><br/><p>Ling Tian looked at the entire world and fell silent.</p><br/><p>Li Xue’s words were akin to a fierce rebuke to Ling Tian.</p><br/><p>It could be said that Ling Tian’s thoughts had never melded together with the world before!</p><br/><p>Ling Tian had always felt that he had come from Earth and his soul was completely different! He was a being high up above! The fortune and disaster of the world had nothing to do with him! Ling Tian had always used killing to solve all of his problems and had never hesitated! Since all of these people were different from him, so what if he killed them all?!</p><br/><p>Today, Li Xue’s words had finally jolted him awake! I am also a part of this world! Could it be that I am still waiting for something? That I am still hoping for something?</p><br/><p>For the entire world and for the commoners!</p><br/><p>While these words were extremely pretentious in his previous life, it was something that he had to face in the world today! Today was different from yesterday. With a perfectly good opportunity before him, it was time for Ling Tian to change!</p><br/><p>Ling Tian let out a self-mocking laugh and suddenly felt a wave of loneliness. Despite the spring sunlight shining on him, Ling Tian felt the autumn chill. He could not help but pull Li Xue into his embrace, “Ah’Xue, thank you for your reminder. Thank you.”</p><br/><p>Li Xue leaned on Ling Tian and said gently, “With both of our hearts as one, I am extremely happy. I only wish to see you every day and aid you.”</p><br/><p>“Ah ah…” Ling Tian chuckled and Li Xue could clearly feel the slight rising and falling of Ling Tian’s chest. Li Xue shut her eyes with satisfaction and she leaned on Ling Tian’s chest comfortably.</p><br/><p>Time seemed to have been frozen at that moment!</p><br/><p>Ling Chen had already arrived but she did not make a single sound and stood by the side silently. Looking at the Ling Tian and Li Xue, a tinge of envy and jealousy could be seen in her eyes. While she knew that she shouldn’t be having such thoughts, she could not control her heart.</p><br/><p>Ling Tian turned around and grabbed Ling Chen into his embrace as well. With the two beauties in his embrace, he let out a soft sigh. “The riches and authority of the world are both unimportant in my eyes. All of you are the most precious treasures in my life.”</p><br/><p>The two ladies could tell that Ling Tian’s words truly came from his heart! The two ladies looked at each other and a gentle smile could be seen on their faces.</p><br/><p>“Even if I have any one of you, it is already my greatest fortune. I have truly let all of you down.” Ling Tian let out a sigh.</p><br/><p>While Ling Chen did not know what Ling Tian meant, Li Xue did. She then hammered Ling Tian on the chest softly and said softly, “With you by my side, there is no bitterness or grievance.”</p><br/><p>Ling Tian felt warmth in his heart and hugged the two ladies tighter.</p><br/><p>After some time, the sound of footsteps could be heard. Ling Jian had arrived with his brothers.</p><br/><p>Upon witnessing such a warm scene, all of them stopped their steps and held their breath, afraid that they would disturb the three.</p><br/><p>A long while later, both the ladies struggled free from Ling Tian’s embrace with their faces red. While they enjoyed such a feeling, it was extremely awkward for them with so many people staring.</p><br/><p>Including Ling Jian, fifty individuals stood up straight. The only one missing was XiMen Sa who was still in the Yu Family. As Ling Tian looked at the fifty of them one by one, a satisfied smile could be seen on his face. This was Ling Tian’s foundation!</p></div>\n</div>"}