{"title": "Chapter 674 - Operation Ox Blade", "id": 674, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-674-operation-ox-blade", "volume_title": "Volume 7", "body": "<h1>Chapter 674 - Operation Ox Blade</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Including Ling Jian, fifty individuals stood up straight. The only one missing was XiMen Sa who was still in the Yu Family. As Ling Tian looked at the fifty of them one by one, a satisfied smile could be seen on his face. This was Ling Tian’s foundation!</p><br/><p>As he saw a figure trying his best to conceal himself at the rear, Ling Tian could not help but be dumbfounded. He then turned around to look at Ling Jian with disbelief, “You are… Fifty?”</p><br/><p>The other forty-nine burst out into laughter.</p><br/><p>That person squeezed his way through the crowd and had a face full of embarrassment, “Ling Fifty pays my respects to young noble.”</p><br/><p>Ling Tian’s jaw dropped in shock. “Fifty, this young noble thought that there is nothing more in the world capable of shocking me. I never expected that you would be able to shock me this way.”</p><br/><p>Ling Fifty lowered his head with his face reddened.</p><br/><p>Upon seeing Ling Fifty’s figure, Li Xue was also taken aback. He was like a gigantic ball standing in the middle of the plaza and even if he didn’t make a single move, just taking a breath of air would result in waves rolling around his entire body. He was just too fat!</p><br/><p>Furthermore, he wasn’t too tall and only about 1.7 meters. However, the width of his body actually wasn’t that much different from his height! Furthermore, his stomach was far too heavy and already drooped down to his kneecaps…</p><br/><p>No wonder Ling Tian was so shocked. Five years ago, Ling Fifty was no more than 100kg when he left the Courtyard. But now, he was 300kg at the very least! Ling Tian found it extremely difficult to understand, how could an individual increase his weight by three times in just a short five years?</p><br/><p>“Young noble, I… I also don’t know what is going on.” Ling Fifty had a look of helplessness on his face, “After parting with all of my brothers five years ago, I fell extremely ill. After I recovered from my illness, this fat began growing out at a crazy rate. It seems as though the fat will grow out even if I drink water… Haiz…” Ling Fifty let out a long sigh full of grievances.</p><br/><p>The other forty-nine individuals laughed to the point they could not even stand up straight. Ling Chi stood out with a face full of doubt. “Old brother, I am only curious about one thing.”</p><br/><p>Ling Fifty rubbed his head and asked, “What thing?”</p><br/><p>Ling Chi frowned and asked with doubt, “With your stomach drooping down, your little brother would definitely be covered by it. Then how do you relieve yourself? Could it be… you have to raise your stomach up first?”</p><br/><p>Waves of laughter could immediately be heard. Both Ling Chen and Li Xue also could not help but burst out into laughter.</p><br/><p>Ling Fifty’s face was completely red and Ling Chi’s guess had hit the truth. Every time he wanted to relieve himself, the process was indeed just as Ling Chi had said…</p><br/><p>Ling Jian immediately felt that he had thrown a great deal of face and he glared at Ling Fifty, “Come to the Courtyard after our mission is completed and I will help you to lose some weight. If you continue growing at this rate, your stomach will probably touch the ground!”</p><br/><p>After that, Ling Jian looked at the crowd and said, “This is the first time in the past ten years that all of us brothers have gone out on a mission together. Not a single one of you can have any mishaps! Are all of you clear?”</p><br/><p>Everyone immediately acknowledged in unison.</p><br/><p>Following that, Ling Jian began reading out the names of those participating in the mission. By the time he finished reading all of the names, only Ling Fifty was left behind in the plaza. He could not help but be anxious and asked, “Brother Jian, what about me? What am I going to do?”</p><br/><p>“You?” Ling Jian looked at him and said, “You shall guard the house!”</p><br/><p>“Why do I need to guard the house?” Ling Fifty became anxious. It was one thing for him to be teased because of his weight. But to think that he was being left out of the mission because of it!</p><br/><p>“Do you think that you can go? Let’s not talk about the rest. Can you even land on top of the roof now? What kind of roof would be able to take your weight? With you crushing the entire roof under your weight, there isn’t any point to talking about stealth!” Ling Jian reprimanded mercilessly, “Are you any different from a large elephant?”</p><br/><p>With his weakness being struck, Ling Fifty lowered his head and said meekly, “I also didn’t want to…”</p><br/><p>Ignoring Ling Fifty, Ling Jian looked at the others and asked, “Do all of you understand!”</p><br/><p>“We understand!”</p><br/><p>While Ling Tian was going to participate in the mission, Ling Jian was going to be fully in charge. After all, after the Divine Prefecture Empire was set up, nobody apart from Ling Jian would be able to handle it. However, Ling Tian wouldn’t be at ease to hand the Courtyard over to anyone else.</p><br/><p>“Does young noble have any other instructions?” Ling Jian bowed and asked.</p><br/><p>“Nothing else. Very good.” Ling Tian nodded his head.</p><br/><p>“If that’s the case, set off!” Ling Jian turned around and ordered. The forty-nine individuals split up into two groups and disappeared.</p><br/><p>Ling Tian walked over to Ling Fifty slowly and comforted, “Fifty, being overly fat is also a type of sickness and this isn’t your fault. I will give you a recipe book after this mission is over and after training with Ling Jian for a period of time, you should be able to lose some weight.”</p><br/><p>“Really?” Ling Fifty was originally a little depressed but his eyes lit up immediately upon hearing those words. As a former assassin, his current figure was truly too unbearable. Hearing that there was a chance for him to lose weight, it was as though he grabbed onto a lifesaving herb.</p><br/><p>“Really!” Ling Tian nodded his head in affirmation, “However, you will definitely have to suffer a little.”</p><br/><p>“Young noble, I am not afraid of suffering. As long as I can shed this hateful layer of fat, I am willing to do anything.” Ling Fifty was agitated to the point his fats began jiggling.</p><br/><p>Ling Tian immediately felt a wave of disgust. Giving him a light tap on the shoulder, he left together with Ling Chen and Li Xue.</p><br/><p>After leaving the Courtyard, Ling Tian turned around and asked, “Do you have any confidence?”</p><br/><p>Li Xue frowned. “It will be impossible for him to regain his original appearance! However, there will definitely be very obvious effects.”</p><br/><p>Ling Tian let out a sigh of relief, “That will be for the best!”</p><br/><p>The evening mist was dense and the small village was covered in mist. This scene that should have been an extremely peaceful one was now an extremely eerie scene!</p><br/><p>Including Ling Tian, Li Xue, Ling Chen, and Ling Jian, there were a total of 52 top-notch experts participating in this mission! Not to mention the fact that Ling Tian and the others were top-notch experts in the world today, any one of the experts participating in this mission was capable of ruling over a region in the continent! This was also the largest scale operation that Ling Tian had conducted up to now!</p><br/><p>With such a prestigious lineup including Li Xue, Ling Chen, Ling Jian and the rest, Ling Tian was confident that they would even be able to take down Justice if he met him!</p><br/><p>Moving out such a lineup in this mission of theirs was akin to killing a chicken with an ox’s blade! However, if Ling Tian wanted to ensure that not a single person escaped, such a lineup was definitely necessary! Ling Tian was confident that there wouldn’t be another power in the world capable of taking out such a lineup!</p><br/><p>Their operation this time was called ‘Operation Ox Blade’!</p><br/><p>The sky was turning dark and sounds of barely audible snoring could be heard. The originally frequent patrols had also disappeared without a trace.</p><br/><p>The time was right!</p><br/><p>With an order from Ling Tian, the 52 individuals split up into ten teams of five and infiltrated into the village. From the outermost ring of the village, they began their clean-up operation!</p><br/><p>Anyone in the village was their enemy! There wasn’t a need to question or show any mercy. They only needed to knock their enemies out! Perhaps this was the only benefit of massacring an entire village!</p><br/><p>The wooden door opened up soundlessly and Ling Tian’s figure darted into the room like a ghostly figure. Before the four in the room could react, Ling Tian had already pressed on all of their acupoints and the four individuals who were lying on their beds could only remain motionless on the bed.</p><br/><p>Without stopping, Ling Tian shot out of the room and went into another house.</p><br/><p>The scene above repeated itself over and over again. Apart from the sound of snoring disappearing, the entire village was actually no different from its usual calm!</p><br/><p>The ten groups invaded the village and conducted a carpeting search without a single house being missed. With almost half of the village taken down, not a single sound had been heard! Apart from their speeds being incomparable to Ling Tian, they did not lose out to Ling Tian in any other areas! If Ling Tian was like a demon, the others were like ghosts! Their actions were also soundless and extremely bizarre!</p><br/><p>Their black figures weaved about the houses and they all seemed to have melded into the darkness. Despite having so many of them taking action together, not a single sound of their clothes fluttering in the wind could be heard. Not a single one of them would interfere with their comrades and not a single house would be searched twice. Every individual played their own role and not a single house was missed!</p><br/><p>Their peerless chemistry had already attained a level of perfection! This was the realm of their hearts and thoughts being connected!</p><br/><p>Nodding his head with satisfaction, Ling Tian’s figure soared like an eagle and he landed on a house in the middle of the village. At the same time, Ling Chen and Li Xue also darted over from two different directions. The target of the three was the same.</p><br/><p>Ling Jian’s figure shot through the sky like an arrow cutting through the atmosphere! Killing intent flashed past his eyes and he entered the room like an asura descending down to earth!</p><br/><p>With Ling Jian’s entrance, his frosty killing intent had also exploded forth and the entire night sky seemed to have transformed into a city of ghosts! His killing intent surged ike waves!</p></div>\n</div>"}