{"title": "Chapter 681 - Fan of the Assassin", "id": 681, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-681-fan-of-the-assassin", "volume_title": "Volume 7", "body": "<h1>Chapter 681 - Fan of the Assassin</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“What do all of you know?” Ling Tian shook his head in disagreement, “To deal with an icy beauty like her, the first thing one must do is shatter that ice-mountain mask of hers. You must first reveal a gap in her heart’s defenses so that you can enter her heart. This is something that Ling Jian is already successful in doing. The moment their two eyes meet, they will both fly into a rage within a couple of sentences. He is truly a genius for learning how to pick up girls without a teacher!”</p><br/><p>“But he is complete trash after that. He actually wants to kill the other party!” Li Xue let out a sigh as she shook her head, “How noobish!”</p><br/><p>Ling Tian suddenly burst out into laughter, “Ah’Xue, based on your judgment, how do you think Meng FanYun from Above Heavens compares to Ling Jian?”</p><br/><p>The moment this was mentioned, Xiao FengYang, Xiao YouHan, and Ling Jian’s attention was drawn over. Xiao YouHan looked at Ling Jian and compared him to Meng FanYun in her memories. While the martial arts of this stone-faced fellow wasn’t too bad, he was a young boy after all. However, Meng FanYun was the head of one of the three hidden sects. How could they even be mentioned in the same breath?</p><br/><p>Indeed, Li Xue frowned and said, “If our information isn’t wrong, Meng FanYun’s martial arts are above Yu ManLou’s and Ling Jian probably isn’t a match for him! There is definitely a gap between both of their martial arts.”</p><br/><p>“What you mean is that Ling Jian will definitely not be a match for Meng FanYun if they fight in a face-to-face battle?” Ling Tian asked purposefully.</p><br/><p>“Yes!” Li Xue replied.</p><br/><p>“If that’s the case, I will hand Meng FanYun over to Ling Jian. Ah’Jian, I want you to take off Meng FanYun’s head. Are you able to do that?” Ling Tian asked coldly.</p><br/><p>“Yes! I will definitely cut off Meng FanYun’s head and present it to young noble!” Ling Jian swore.</p><br/><p>Xiao FengYang and Xiao YouHan were both startled upon hearing that. Handing Meng FanYun over to him even though he wasn’t a match for Meng FanYun? Isn’t this forcing Ling Jian to his death?</p><br/><p>Ling Tian looked at Xiao YouHan and smiled, “Miss, Ling Jian offended Miss just now and I shall let him take this mission as a punishment. I wonder if Miss is satisfied?”</p><br/><p>Xiao YouHan was dumbfounded. Why was I pulled back into the matter after such a round-about conversation? Is this stone-faced fellow going to accept a suicide mission because of her?</p><br/><p>This, just where did this come from?</p><br/><p>Xiao YouHan could not help but stutter, “Crown Prince Ling Tian, isn’t this a little inappropriate?”</p><br/><p>Ling Tian replied with a low voice, “What’s inappropriate about that?”</p><br/><p>Upon witnessing Ling Tian’s displeasure, Xiao FengYang gave an eye signal to Xiao YouHan to indicate that she should stop talking. However, Xiao YouHan could not bear to see Ling Jian give up his life just because he offended her. Ignoring Xiao FengYang’s eye signal, she said anxiously, “Even if he has made mistakes, you can’t just send him to his death, right?”</p><br/><p>“Send him to his death?” Ling Tian raised an eyebrow, “Why does Miss say that? I have only given him a challenging mission. Since when did I say that I was sending him to his death?”</p><br/><p>Xiao YouHan was exasperated and said loudly, “Our sect master’s martial arts are a hundred times better than his, but you want him to kill someone that he can’t kill? Isn’t this akin to sending him to his death? Besides, he… he didn’t even offend me or make any mistake. How can you do that?…”</p><br/><p>The moment these words were said, Xiao FengYang’s face turned blue. To think that she dared to reprimand the crown prince of an empire to his face…</p><br/><p>“Oh?” Ling Tian was completely unbothered and looked at her with a profound gaze instead, “It’s such a pity. Since this young noble has given an order, I will not be taking it back! Miss’s words are a little too late and even if he is wronged, he has no choice but to go.”</p><br/><p>“Could it be that you are going to send your loyal subordinate to his death because of your face?” Xiao YouHan reprimanded with tears in her eyes. She never imagined that a small little argument with Ling Jian would send him to his death. Her heart was immediately in turmoil.</p><br/><p>“A woman should not interrupt the matters of men.” Ling Jian frowned and scolded, “Why are you babbling rubbish when this has nothing got to do with you? You are indeed my heart demon, you actually dare to try to stop my young noble from giving me a mission!” Ling Jian was originally extremely delighted that his young noble would give him the exciting mission of killing Above Heavens’ sect master. However, Xiao YouHan spoke out to stop his young noble and had even said that he wasn’t a match for Meng FanYun. How could he not be frustrated?</p><br/><p>“You!” Xiao YouHan never imagined that her goodwill would be met with such a response from Ling Jian! She could not help but well up with grievances as tears flooded her eyes, “Who do you think you are? Do you think that you are the First Pavilion Head? Do you know how high Meng FanYun’s martial arts are? With just your substandard martial arts, how will you be able to kill him?”</p><br/><p>The moment these words were said, Ling Tian, Ling Chen, Ling Jian, and Li Xue had a strange look on their faces. They looked as though they were about to laugh but were trying their best to hold it in. Xiao YouHan’s words had accurately pointed out Ling Jian’s most secret identity!</p><br/><p>The lives of all humans are in my hands, the winds and rains heed the first pavilion!</p><br/><p>The First Pavilion Head!</p><br/><p>“The First Pavilion Head?” Ling Tian asked curiously, “Does Miss Xiao think that the so-called First Pavilion Head would be able to kill Meng FanYun? I think that my Ah’Jian is more outstanding!”</p><br/><p>“How can the two of them be compared? One is like the clouds in the sky while the other the dirt on the ground. Is there anyone in the world that cannot be killed by the First Pavilion Head?” Xiao YouHan said with pride on her face as though she was the First Pavilion Head. Worship could be seen in her eyes and stars could be seen glimmering in them. The moment her idol was being mentioned, she no longer had the demeanor of the icy goddess. “The fame of the First Pavilion Head shocks the entire world and he never returns empty-handed. Even the monarch of Eastern Zhao died under his sword with a single strike! How majestic is he! What amazing killing intent! What kind of a hero is he! A despicable scum like you cannot even be compared to a finger of his!”</p><br/><p>“Even in an army of millions, the First Pavilion Head is able to take the heads of individuals at ease! The First Pavilion Head is even able to come and go as he pleases in the number one aristocratic family in the world, the Yu Family, rendering the thousands of Yu Family experts helpless! The Northern Wei back then was extremely tyrannical with its citizens in rage. The First Pavilion Head sought justice for the world and wiped out the Northern Wei imperial family in a single night!”</p><br/><p>Xiao YouHan said with excitement on her face before sweeping Ling Jian with a look of disdain, “Look at his coffin-like face full of bad luck. It would be sufficient for him to protect himself if he had one-hundredth of a percent of the First Pavilion Head’s abilities. If this Miss is going to marry someone, I will marry a hero like the First Pavilion Head!” She then looked at Ling Jian with the meaning of ‘a brat like you should just give up’.</p><br/><p>So it turns out that the mysterious First Pavilion Head is the dream lover for that lass! Ling Tian was dumbfounded!</p><br/><p>Talking about the past First Pavilion Head, it seems like the past First Pavilion Head truly wasn’t a match for the current Ling Jian. After all, Ling Jian had already achieved multiple breakthroughs and he was far more powerful than before. However, he was actually disdained for being dirt on the ground!</p><br/><p>Life is truly mysterious!</p><br/><p>Ling Chen and Li Xue who knew the truth covered their mouths tight and strictly maintained their poker faces, afraid that they would burst out into laughter if they made any movements. If they burst out into laughter at this moment, it would truly ruin matters.</p><br/><p>It was best for them to watch the show quietly.</p><br/><p>Ling Jian coughed awkwardly before saying with a depressed tone, “Err, Miss, that so-called First Pavilion Head is no more than an assassin. What’s the big deal about him? He definitely isn’t as exaggerated as what you described. You are describing him as though he is omnipotent.”</p><br/><p>“He is no more than an assassin?!” Xiao YouHan jumped up immediately with her face flushed red in anger, “You are making it sound so simple! There have been plenty of assassins from ancient times until now! Which one of them had a good ending? Either they were caught or killed. How many would be able to achieve the heights of the First Pavilion Head? Not only is he always successful, he is always able to fully retreat. He comes and goes without a trace and is capable of playing the entire world in his palms! Up until now, no one knows where the First Pavilion Head lives or what his name or appearance is!”</p><br/><p>“His ability to conceal himself isn’t something that just any individual is capable of achieving! Just like young noble Ling, despite acting like a profligate young noble, weren’t you also exposed in the end? However, the First Pavilion Head hasn’t been revealed even up to now! When comparing the two, the superior individual is obvious! Besides, the First Pavilion Head rarely takes action but the moment he takes action, the entire world will shake! Such a hero is ‘just an assassin’ in your eyes?!”</p><br/><p>“What are your intentions?!” Xiao YouHan looked at Ling Jian with a blazing rage as she inched nearer to him, “Do you think that you are capable of achieving that?”</p><br/><p>She then walked closer again, “Are you able to?! ARE YOU?!”</p><br/><p>With another step, “If it were you, you would probably have announced it to the entire world right? Hmph!”</p><br/><p>Ling Jian was forced back by Xiao YouHan and looked extremely pathetic. When she finally stopped walking forward, Ling Jian stood up straight and bellowed angrily, “Isn’t it just killing a couple of fellows? There isn’t anything amazing about that! I may not have killed any less than him!”</p><br/><p>However, it is impossible for me to kill any more than him. Ling Jian added on in his heart. Comparing himself with himself, is there a point? No matter how he compares, it would always be a draw!</p><br/><p>Xiao YouHan suddenly felt as though it was a waste for her to be so worried about such a fellow! Such a fellow deserved death! She then glanced at Ling Jian with disdain and waved her hands expressionlessly, “Do you even believe your own bragging?! How shameless! On behalf of young noble Ling Tian’s face, this Miss shall not be calculative with you today! A frog in the well looking at the sky, how can you know how large the ocean is? What would a despicable scum like you know? Quibbling with you is akin to lowering my status.”</p><br/><p>“So it turns out that the mysterious First Pavilion Head is the ideal candidate for Miss to spend your entire life with?” Ling Tian said with a smile that didn’t seem like a smile as he coughed awkwardly. It was truly too difficult for him to hold his laughter in.</p></div>\n</div>"}