{"title": "Chapter 696 - Clothed in Yellow Robes", "id": 696, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-696-clothed-in-yellow-robes", "volume_title": "Volume 7", "body": "<h1>Chapter 696 - Clothed in Yellow Robes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Looking at the submissive appearance of his daughter, he naturally understood that it was already a done deal. He then replied with a smile, “As long as my daughter isn’t opposed to it, both my wife and I would naturally be willing. However, we may not be a match for that Divine Sword Duke.”</p><br/><p>“Haha, I wonder if Miss YouHan herself is willing? If she isn’t willing…” Ling Tian chuckled and looked at Xiao YouHan who was hiding her head in her mother’s embrace with a cheeky smile, “Err, Miss Xiao, are you willing or not? It isn’t good for you to continue hiding all the time. You have to give us a certain answer. Could it be that you aren’t willing?”</p><br/><p>However, how would a young lady like her be able to say such words openly? If she wasn’t willing, all she had to do was to reject it. But…</p><br/><p>Xiao YouHan began burning from the embarrassment and she could no longer hide in her mother’s embrace. Jumping out, she scolded with her face flushed red, “Since I didn’t say that I wasn’t willing, I am naturally… big baddie! Big baddie! All of you are big baddies!” She then covered her face in embarrassment and charged out.</p><br/><p>Everyone burst out laughing and Xiao FengYang looked at Ling Tian with a smile, “Crown Prince’s words are truly straightforward and effective. You made my granddaughter YouHan run to escape from embarrassment. You must be punished with three glasses of wine for this!”</p><br/><p>Ling Tian burst out into laughter and said, “Not to mention three glasses, I would drink even thirty glasses willingly. I am being happy for my brother!”</p><br/><p>Seeing both parties in agreement, Ling Chen and Li Xue hurriedly urged Ling Jian to take out a token of engagement. After searching his body all over with his face flushed red, he could only find three swords on his body and nothing else.</p><br/><p>Everyone was dumbfounded. This world-famous First Pavilion Head, a first ranked Duke in the Divine Prefecture Empire actually had nothing else on him! He was truly too poor! Who would believe such a thing?!</p><br/><p>Ling Tian let out a bitter laugh and took out a jade pendant. Giving a dry laugh he said, “Actually, Ah Jian had already handed his possessions to me. This jade pendant, cough cough, while this jade pendant isn’t extremely valuable, it is Ah Jian’s ancestral jade pendant. Using this as a token of engagement would be the most suitable. Ah ah.”</p><br/><p>Xiao FengHan hurriedly played along. “That’s right, that’s right! With Crown Prince personally suggesting the engagement and personally presenting this token of engagement, it is a great honor to my Xiao Family.”</p><br/><p>Xiao YouHan’s parents thanked Ling Tian and took out a bright red jade hairpin. After exchanging it with Ling Tian’s jade pendant, the marriage was set. Ling Jian then went forward to pay his respects and Madam Xiao helped him up with a smile, “We truly aren’t a match for Divine Sword Duke.”</p><br/><p>Ling Jian’s face flushed red and he laughed awkwardly not knowing what to say.</p><br/><p>It wasn’t an exaggeration to say that they weren’t a match for Ling Jian. After all, Ling Jian wasn’t only the world-famous First Pavilion Head, he was also the number one subordinate of Ling Tian. The Divine Sword Duke was definitely an individual who was high above the rest in the Divine Prefecture Empire! He was definitely a figure with the authority to decide the life and death of the commoners! This was something that anyone could tell!</p><br/><p>Regardless of whether he was Divine Sword Duke of the Divine Prefecture Empire or the world-famous First Pavilion Head, he wasn’t someone that the current Xiao Family could be a match for! Furthermore, with Ling Tian personally being the matchmaker, it meant that Xiao YouHan would be married off as Ling Jian’s first wife. Such a position was one that would be a joyous occasion for the previous Xiao Family!</p><br/><p>With the Xiao Family’s current almost taboo status, if not for Ling Jian having interest in Xiao YouHan, Ling Tian would never agree to the matter. For Ling Tian to take the initiative to propose this marriage, it could be said that he had given the Xiao Family a great deal of face. If the Xiao Family still didn’t agree to it, they would truly not know what is good or bad.</p><br/><p>As for the nobility position of Divine Sword Duke, it was naturally something that Ling Tian came up with on the spot. After all, he couldn’t possibly ask Xiao YouHan to marry his ‘subordinate’ or ‘study attendant’ right? Since Ling Jian did not have any official position or title at the moment, Ling Tian could only make use of the imperial authority prematurely and grant Ling Jian the position of duke and settle his matter of life-long happiness. If not, it would truly be difficult to say what Ling Jian’s exact status was.</p><br/><p>With the marriage settled, everyone naturally seemed closer than before.</p><br/><p>Of course, it wasn’t appropriate for them to have discussions about Xiao YanXue’s marriage at the moment. While everyone knew that she was Ling Tian’s woman, they had not announced the matter to the world but Xiao YanXue was already staying at the Ling Family. Running over to the man’s house before the marriage was even settled was…</p><br/><p>Everyone was intentionally avoiding the topic but Xiao YanXue’s mother was looking at Ling Tian like a mother-in-law looking at her son-in-law.</p><br/><p>According to Ling Tian’s intentions, he definitely wouldn’t return to Sky Bearing so soon. However, he had no choice but to do so at this moment. After resting for a few days in the Xiao Family, Ling Tian received a note from Meng LiGe and Ling Tian could not help but sigh with depression. It wasn’t a big issue but Ling Tian’s father, Ling Xiao had ignored all of his responsibilities and refused to do a thing.</p><br/><p>With the recent founding of the Divine Prefecture Empire, there were many things to be taken care of. Regardless of whether it was the military, politics or agriculture, there were far too many things for the new emperor to decide. However, Emperor Ling Xiao was scared silly by all of these troublesome decisions.</p><br/><p>Originally, Ling Xiao couldn’t be bothered with reading any memorandums and he threw his jade seal over to Meng LiGe and got Meng LiGe to decide everything on his own. As for the matters which Meng LiGe couldn’t or didn’t dare to decide, all of those matters would be put off to a later date when Ling Tian returns.</p><br/><p>During this period of time, the number of memorandums that were put off to a later date was sufficient to form a small mountain! With such an emperor on the throne, even if he was a talented individual who could bring stability to the lands, he was completely helpless. While there were many things that needed to be resolved urgently, there were far too many things which he didn’t have the authority to decide!</p><br/><p>Recently, Ling Xiao had been pressed by Meng LiGe and all the officials of the court day after day and hounded for deadlines all the time. In a fit of rage, he let out a roar of anger in the palace, “This daddy here just doesn’t want to do it! That little b*st*rd can do as he wishes.” He then moved back to the Ling Residence and shut himself in.</p><br/><p>They weren’t able to solve a single problem but forced the Emperor into hiding instead.</p><br/><p>All the officials of the court looked at each other not knowing whether to laugh or cry.</p><br/><p>As Ling Tian held onto the message sent by the messenger falcon, he wanted to laugh but couldn’t laugh. He wanted to cry but had no tears. He could only let out a bitter laugh.</p><br/><p>The second morning he said his goodbyes to Xiao FengHan and left the Southeast. He sped his way back to Sky Bearing without resting.</p><br/><p>Xiao FengHan knew that the moment Ling Tian returned, he wouldn’t be the Crown Prince any longer but would become the ruler of an empire. From today on, regardless of whether it was in name or in power, Ling Tian would be the single ruler of the Divine Prefecture Empire.</p><br/><p>Thus, Xiao FengHan did not dare to delay and arranged for his Xiao Family to pack their luggage and leave for Sky Bearing three days after Ling Tian’s departure. As for the Xiao Family’s military and administrative affairs, he left it all the Xiao FengYang. They needed to wait for the arrival of Ling Tian’s imperial edict before they can make a final decision!</p><br/><p>The situation did not allow any delay.</p><br/><p>When Ling Tian returned to Sky Bearing, Meng LiGe and the others were already waiting outside the city gates. They were like a bunch of clamoring and wailing children, whining the moment they saw Ling Tian return.</p><br/><p>Ling Xiao had long prepared the imperial edict to pass the throne down to Ling Tian and the various officials had pestered Ling Tian to quickly ascend to the throne. After that, all the rites were greatly simplified which was also to Ling Tian’s liking.</p><br/><p>When he finally arrived at the administrative hall, he took in a deep breath of cold air as he saw the large mountain of memorandums for him to approve.</p><br/><p>Wasn’t this too… spectacular a sight?!</p><br/><p>Turning around to see the look of grievance on Meng LiGe’s face, Ling Tian frowned and asked, “The retired emperor didn’t even look at a single memorandum? He left everything for me?”</p><br/><p>Meng LiGe had obviously lost a great deal of weight over the past few days and said with a bitter expression, “The Divine Prefecture Empire has been through two emperors. The Imperial Ancestor did not attend a single court session and the retired Emperor did not even show his face… Haiz…” He then let out a long sigh of frustration.</p><br/><p>Ling Tian looked at him with compassion. “It has been tough on you.”</p><br/><p>Hearing those words, Meng LiGe had almost burst out into tears with complicated feelings in his heart. Even with the many affairs of the Ling Family Courtyard, I would be able to manage them in an orderly fashion. However, this is an entire empire!</p><br/><p>In the Ling Family Courtyard, he only had to answer to Ling Tian. However, the Divine Prefecture Empire had far too many officials and generals for him to answer to…</p><br/><p>After going through two emperors, if not for him looking forward to Ling Tian’s return, Meng LiGe would have probably resigned from his post by now. This truly wasn’t the job for a human! Working for a single day would reduce his lifespan by a month!</p><br/><p>Ling Tian hurriedly gathered all of his women and split the memorandums into batches for them to aid him. Of course, Meng LiGe wasn’t spared either and also had a pile of memorandums in another room.</p><br/><p>Meng LiGe wanted to cry but no tears could come out. He had been looking forward to Ling Tian’s return for a long time, but after Ling Tian’s return, his workload had not decreased in the slightest.</p><br/><p>After assigning all the jobs, Ling Tian enjoyed his tea with his legs crossed. His relaxed expression could be compared to both his grandfather and his father…</p><br/><p>Of course, these helpers couldn’t be a match for Meng LiGe. However, Ling Chen had followed Ling Tian for more than ten years and naturally knew how to deal with these matters. Xiao YanXue, Shui QianRou, and Yu BingYan were descendants of famous aristocratic families and were naturally not unfamiliar with such affairs. As for Li Xue, there wasn’t a need to say anything more. Coming from the present day and having the experience of five thousand years of culture, her ability to make decisions was something that even Ling Tian wouldn’t be a match for.</p><br/><p>Besides that, they did not have anything to be wary about like Meng LiGe and dared to make decisions. Thus, things were settled extremely swiftly.</p><br/><p>Ling Tian held onto the jade seal in one hand and the teacup in his other hand. After the others read through the memorandums and penned their opinions, Ling Tian placed his seal on it without even bothering to take a look. After that, the eunuchs who were waiting by the side immediately went out to announce the decrees.</p><br/><p>During this period of time, Li Xue had joked, “Your Majesty, do you remember that the imperial harem must not participate in politics?”</p><br/><p>Ling Tian chuckled and waved his hands, “All of you aren’t considered part of the imperial harem yet so it naturally doesn’t count.”</p><br/><p>Li Xue rolled her eyes and muttered, “I have never seen an emperor like you before.”</p><br/><p>Meng LiGe hurriedly added on with satisfaction, “This is already considered very good. In comparison… cough cough cough… at least we can have our morning court session now. I am already very satisfied.”</p></div>\n</div>"}