{"title": "Chapter 698 - Difficult Choice", "id": 698, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-698-difficult-choice", "volume_title": "Volume 7", "body": "<h1>Chapter 698 - Difficult Choice</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>To Ling Jian and his brothers, the young noble who they had been loyally serving for the past decade was finally going to be married to their sister, Ling Chen. It was as though their biological sister was about to be married. Each one of them was full of excitement and even those who had not fully recovered from their injuries joined the crowd in celebration.</p><br/><p>The Imperial Ancestor was personally hosting the wedding and had a big smile on his face.</p><br/><p>On top of the Ling Residence Pavilion.</p><br/><p>Ling Ran was dressed in ceremonial attire and upon witnessing her daughter in her wedding dress, her heart was filled with complicated emotions as tears streamed down her cheeks.</p><br/><p>She truly did not wish to think back on past events. While her daughter’s wish was finally fulfilled, thinking about her crazy husband, she did not know what to feel.</p><br/><p>As Old Madam Ling looked at her daughter standing in a daze, she let out a soft sigh and said, “The past is over and there isn’t a point to think too much about it. From today onward JiaoYue can be considered a part of our Ling Family and we definitely won’t mistreat her. You should be happy for her as a mother. Why are you crying instead?”</p><br/><p>Ling Ran nodded her head silently and dove into Old Madam Ling’s embrace with tears all over her face.</p><br/><p>Following the loud roar of ‘prosperity’, the wedding was at its final stages.</p><br/><p>After paying respects to the heavens, earth, and ancestors, the imperial decree was read.</p><br/><p>Ling Chen was officially crowned Empress and moved into the eastern palace.</p><br/><p>The other five were all conferred upon the title of imperial escorts and were assigned into their own palaces.</p><br/><p>After the majestic ceremony, it was naturally time for a banquet.</p><br/><p>The happiest person was Yu ManTian. As Third Master Yu witnessed his niece happily being married into the Ling Family, he immediately had a sense of satisfaction and felt as though he truly had the talent to be a matchmaker. This was the only time in his life when he had been a matchmaker and both parties were joined together in a successful union. As such, he lifted his wine glass up in joyous celebration.</p><br/><p>Seeing Ling Jian running around busily, Yu ManTian grabbed him and growled to vent his new and old hatred, “Dammit, you little brat dared to hit me the other day?”</p><br/><p>“Err?!” Ling Jian was stumped. He originally thought that Yu ManTian caught him for a drink but never expected that Yu ManTian wanted to settle scores with him instead.</p><br/><p>“Talk less rubbish! For the number of times that you hit me back then, you have to drink that many glasses of wine!” Yu ManTian’s face turned black, “Hurry up and stop delaying. Can you do it or not?! Give me an answer.”</p><br/><p>“Can! Of course I can!” Ling Jian answered without any hesitation as he recalled how many glasses of wine he should drink. At the very most, I only kicked him to the ground once and sealed his acupoints. Two glasses should be sufficient and I can be on my way after that. As such, Ling Jian poured himself two glasses and downed it quickly.</p><br/><p>“Finished drinking?” Yu ManTian asked and Ling Jian nodded his head in response. Yu ManTian then chuckled and his malevolent teeth could be seen breaking out into a wide smile. “Let this daddy here return you a few hits after you finish drinking. Don’t worry, this daddy here won’t go too far!”</p><br/><p>Ling Jian was speechless. He truly hasn’t seen someone so shameless before.</p><br/><p>Yu ManTang held onto his wine glass and walked over with a smile on his face, “This must be the world-famous First Pavilion Head right? I have long heard of your fame and it is truly better to see you in person than hear about you from rumors!” He then reprimanded Yu ManTian, “Are you not going to move to the side? This is your niece’s wedding! What do you want to do? Start a fight in this place?!”</p><br/><p>Yu ManTian glared at Yu ManTang for a long while but chose to remain silent as he moved to the side. He then said to Ling Jian, “Little brat, it is this daddy niece’s wedding today and I shall let you off first. I will find a time to settle scores with you someday! First Pavilion Head, hehehe, what amazing fame. This daddy isn’t convinced.”</p><br/><p>He then left.</p><br/><p>Yu ManTang dragged Ling Jian with a bright smile on his face as he lifted his glass to give Ling Jian a toast. He then suddenly whispered to Ling Jian, “Tell Ling Tian that I want to meet him.”</p><br/><p>Ling Jian’s eyes gleamed for a moment before lifting up his glass, “I thank Second Master for your kindness. We are all a big family and there isn’t a need to stand on ceremony.”</p><br/><p>Yu ManTang laughed in response.</p><br/><p>The smell of wine permeated the hall and chattering filled the place.</p><br/><p>“There isn’t anything else, I only want to ask. Is Shui WuBo’s death because of my big brother’s martial arts? You are the only one who can tell me the truth…” Yu ManTang’s expression was heavy as he asked Ling Tian with his eyes gleaming. It was as though there wasn’t anything more important than this matter to him in his heart.</p><br/><p>Ling Tian looked at Yu ManTang and felt that the reaction of his father-in-law was a little exaggerated and he was no longer his wise and resolute self. Everyone probably has an answer in their hearts already, what is the point of asking such a question now? Why do you have to ask an outsider like me if your big brother is using a venomous martial art?</p><br/><p>Besides, this isn’t the most appropriate occasion to ask about this matter either. Today is the day of my marriage and I have a few brides waiting for me. Even if you are my father-in-law, you can’t be acting in such a manner right?</p><br/><p>While he had the heart to ignore Yu ManTang, he just could not bring himself to do it. Yu ManTang wasn’t only his father-in-law, he even owed Yu ManTang a favor from before. Regardless of how dissatisfied he was, he couldn’t possibly voice his dissatisfaction!</p><br/><p>“After Shui WuBo suffered from Yu ManLou’s palm strike, his heart burst apart. In the beginning, nothing seemed to be wrong with his body but his entire body dissolved into black water after an hour. The toxicity of the black water withered the surroundings with the ground cracking up. There is still a sense of lingering fear upon thinking back about that event.” Ling Tian said patiently, “Shui WuBo did not have any other injuries and this is something that both Justice and I can be a witness to. Shui WuBo’s cause of death is definitely Yu ManLou’s venomous martial art.”</p><br/><p>“Indeed so, indeed so…” Yu ManTang’s face turned pale as though he lost his spirit. He then suddenly burst out laughing strangely with tears in his eyes. Shaking his head, he said, “The return of the corrosive art, the destruction of white jade. The return of the corrosive art, the destruction of white jade. HAHAHA… this is indeed so! The Yu Family has truly fallen to such a state. Hahaha… our dear ancestors, the Yu Family is about to be defeated. The thousand years of our Yu Family’s glory is about to be defeated! What should I do? What should I do?!”</p><br/><p>“Hmm?” Ling Tian turned around and looked at Yu ManTang with doubt.</p><br/><p>Yu ManTang let out a miserable laugh as his body stumbled pathetically. “A few centuries ago, the entire pugilistic world was gathered to surround a demon. Finally, the Martial Order Medallion owner of that generation personally sent that demon into a valley ten thousand feet deep. Before the death of that demon, my Yu Family ancestor found the hiding place of that demon and retrieved the cultivation method of that demon. Because of a moment of greed and selfishness, my ancestor hid the cultivation method in our Yu Family. After finding out that the cultivation of that demonic martial art went against the heavens, my ancestors wanted to destroy it on many occasions but couldn’t bear to do so. Finally, it was sealed in the top-most pavilion and all Yu Family members were forbidden from cultivating that demonic martial art.”</p><br/><p>“A couple of generations later, this matter was slowly forgotten and the demonic martial art also went missing. Finally, there was an ancestor of our Yu Family who was crippled and couldn’t cultivate. However, he was well versed in fortune-telling and divination. When he was a hundred years old, he helped our Yu Family to make a final divination before dying from shock.”</p><br/><p>Yu ManTang looked at Ling Tian and said slowly, “The divination left behind from our ancestors can be split into two parts. The first was: The return of the corrosive art, the destruction of white jade! In other words, the reappearance of the demonic martial art would spell the doom of our Yu Family!”</p><br/><p>“What about the other part?” Ling Tian asked with curiosity.</p><br/><p>“The other was…” Yu ManTang laughed bitterly and said, “Fighting with men would lead to a thousand years of prosperity. Fighting with the heavens would lead to destruction in a single night!”</p><br/><p>Ling Tian’s heart shook and he replied with an ‘oh’.</p><br/><p>“We have always thought that our Yu Family would never overestimate our abilities and be arrogant to the point that we would fight against the heavens! Furthermore, even if we wanted to go against the heavens, we wouldn’t know how to!” Yu ManTang let out a self-mocking laugh, “Only today do I finally understand that the ‘heavens’ wasn’t the heavens!”</p><br/><p>“Fighting with the heavens would lead to destruction in a single night! This ‘heavens’…” Yu ManTang looked at Ling Tian and a desolate smile could be seen on his face, “This ‘heavens’ actually referred to you! The ‘Tian’ in your name which refers to the heavens! The monarch is Ling Tian. With Yu fighting Tian, how can we survive?!”</p><br/><p>Ling Tian let out a dry laugh and felt his back turning cold.</p><br/><p>“Forget it, regardless of reason, it is an undeniable truth that my big brother has chosen to cultivate that vile demonic martial art that cannot be accepted in the world! It seems like the fortune of our Yu Family has reached its end and there is no turning back. This is probably so, hahaha…” Yu ManTang then stood up and walked towards the outside.</p><br/><p>“Father-in-law!” Ling Tian cried out to stop Yu ManTang, “Since Yu ManLou has chosen to go against the heavens and incite the anger of men and the heavens, with the present state of the world being extremely clear, I wonder which side father-in-law will be standing on?”</p><br/><p>Yu ManTang’s body froze in front of the entrance and the past few decades from his youth till now flashed past his eyes. He thought about how his brother took care of him when he was young and how the three of them brothers were as close as one. All of the past events had slowly surfaced in his mind.</p><br/><p>While Yu ManTang’s body did not even move an inch at that moment, Ling Tian who was behind him could clearly feel as though Yu ManTang seemed to have aged a couple of decades in that instant.</p><br/><p>“After returning, I will persuade big brother again. He is my big brother after all.” Yu ManTang did not turn around again but replied with a soft voice, “Regardless of the outcome, I am a member of the Yu Family after all…”</p><br/><p>“Of the matters in the world, what is right is right, what is wrong is wrong. Everyone will be able to see through right and wrong clearly. Even if one is confused for a moment, there will be a time when the truth comes out. I have never been a fool and can naturally see through things clearly. However, I have to do some things even if I know that it is wrong.”</p></div>\n</div>"}