{"title": "Chapter 694 - Pacifying the Southeast", "id": 694, "volume": 7, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-694-pacifying-the-southeast", "volume_title": "Volume 7", "body": "<h1>Chapter 694 - Pacifying the Southeast</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>“En, I understand!” Ling Tian nodded his head, his face passive, not showing any sort of satisfaction nor disappointment.</p><br/><p>Xiao FengYang and Xiao FengHan, as well as the various managers from the Xiao Family, sat by the side with haggard faces. Towards the deaths in the Xiao Family, Ling Tian naturally would not voice out any of his opinions to them. If he appeared to be too saddened, then with their superficial ties binding them together, it would only seem artificial. However, if he appeared too nonchalant, then it would appear too harsh towards the Xiao Family.</p><br/><p>“In the battle at the Xiao Xiang area, none of the 330 Above Heavens disciples managed to escape. We’ve killed a total of 216 of them, and captured the other 114. Statistics from the Xiao Family show that 87 people died in the war, with Ling Twenty-Seven and Ling Twenty-Nine seriously injured, but in no danger to their lives.” Ling Chen reported. From the result of the two, one could see that Ling Chen was still lacking in viciousness compared to Li Xue. Li Xue had practically killed off everyone, whereas Ling Chen still left a couple of hundred captives.</p><br/><p>“Bury the dead, and treat the wounded properly.” Ling Tian blandly nodded.</p><br/><p>“The Above Heavens Sect had a total of 1,537 death warriors, and we have confirmed that all of them died! Concerning the Divine Wind Guards of the Xiao Family, out of 5,000, over 3,700 were killed, with 600 seriously wounded. There are no light wounds. Ling Thirty-Two, Thirty-Five, and Thirty-Nine are all seriously injured. Ling Thirty-Eight lost an arm, Ling Thirty-Four was disabled in one of his eyes, and also had his left leg broken.” Ling Chi’s face was mournful. While he had already changed into a fresh set of clothes, the blood from his chest continued to seep through, so obviously, his injuries were not light as well. “This battle caused us to suffer disastrous losses, and if not for Sister Chen and Lady Xue that provided aid in the nick of time, I’m afraid our losses would have been more severe! Ling Chi had betrayed Young noble’s hopes, causing many of our brothers to suffer. I ask Young noble to hand out an appropriate punishment!”</p><br/><p>Xiao FengYang and Xiao FengHan’s expressions paled at this news! The Divine Wind Guards were the most elite troops of the Xiao Family! The Xiao Family had activated all 5,000 of them yesterday for the sake for getting it over once and for all! But never in their dreams did they expect that one battle would cause all the foundations to be wiped out!</p><br/><p>The brothers faced the heavens and sighed, no longer having any words to say!</p><br/><p>From today on, the Xiao Family no longer had any more military strength!</p><br/><p>“1,500 death warriors?! They actually could get rid of 3,700 guards that were led by the top 10 assassins, and heavily injure 600?! Even my Ling Family brothers have three grievously wounded, with two crippled?!” Ling Tian was also shocked to the core!</p><br/><p>Ever since the fifty brothers had mastered their skill sets, there had not been a case of them suffering from injuries, be it warring among thousands of soldiers on the battlefield or assassinating someone from the imperial palace. All their missions were successful without any hitches! Even when they were tasked to gain hegemony over an area, they had all succeeded without question!</p><br/><p>Even if they were injured it was not to the point of being crippled, but today…</p><br/><p>Including himself, everyone had been confident that when the 50 brothers all joined hands, in addition to the six from the First Pavilion, this force was enough to move unhindered! Under the heavens, there was only a minute number who could withstand such strength, maybe even none!</p><br/><p>But the cruel truth was shown in front of them, that while their strengths were humongous, it was not something that couldn’t be defeated! In order to overcome the 1,000 odd death warriors in their training grounds, Ling Chi had brought ten brothers with him, together with the Divine Wind Guards, and yet they had to pay the price of over 3,000 of the guard members. This was twice the number of deaths! They had not even counted the injured and crippled within the Ling Family, as well as the wounds on the leader Ling Chi! If not for the timely rescue of Li Xue and Ling Chen, Ling Tian could imagine that he would have received the news of the death of his brothers! And not just one of them!</p><br/><p>Just how elite were the death warriors of the Above Heavens Sect?</p><br/><p>This sort of prowess was already above that of Ling Tian’s Blood Iron Warriors!</p><br/><p>What a frightening prowess, what a frightening bunch of elite troops!</p><br/><p>If the numbers were evenly matched, what sort of price would he then need to pay?</p><br/><p>Even with his unflustered attitude, Ling Tian could not help but have some lingering fears. He sighed deeply before saying, “Have a good rest. In addition, have you found out the training methods for the Above Heavens’ death warriors?”</p><br/><p>Ling Chi respectfully replied, “I was aware that Young noble would ask about this. The arrangements have been done, and all of the teaching methods are in my hands. Furthermore, the contents include the experiences of the thousands who failed.”</p><br/><p>Ling Tian nodded his head, and in the end, could not hold in his anxiety to ask, “What about Ling Thirty Eight and Thirty Four? How are they holding it in?”</p><br/><p>“Rest assured, Young noble. They are still fine. Ling Dian and Ling Yun had brought along the Heaven Reversing Restoration Pill that Justice had concocted along this time, and using that, have protected their vitals. Their lives are no longer in danger.” Ling Chi blinked his eyes rapidly, holding back the hot tears that threatened to spill out. “This time, the battle that took place was extremely intense. In their final throes, the death warriors were holding their own against 10 people each. Their battle strengths were off the charts, and furthermore, all were unafraid of dying! To still be able to hold on to their lives could already be considered a blessing.”</p><br/><p>Pausing for a moment, he then continued, “The injuries of our brothers were mostly caused by the trading of lives; the ‘Jade Fragment’ war tactics of the Above Heavens death warriors were much crueler compared to our Ling Family’s ‘Blood Iron’, and much more effective.”</p><br/><p>“En, I understand.” Ling Tian nodded. “In a while, I’ll go pay them a visit.”</p><br/><p>At this moment, Ling Jian walked over, sporting a pale complexion as he spoke, “Young noble, for the headquarters of Above Heavens, none of them remained alive! In addition to Meng FanYun, no one was spared, including all the head instructors!”</p><br/><p>If the previous injuries that were reported just now were considered a normal occurrence, then the words spoken by Ling Jian could be considered a divine equalizer!</p><br/><p>Hearing such good news, Xiao FengYang and Xiao FengHan all revealed expressions of joy! The sword of Damocles that had always hung over the heads of the Xiao Family members had finally been eradicated!</p><br/><p>When the two powers were cooperating, they were naturally on harmonious terms. However, the disciples from the Above Heavens Sect always placed themselves at the top, causing the Xiao Family members to have to restrain their anger. Furthermore, they were becoming more unbridled even within the Xiao Family’s compound, which had made the Xiao Family even angrier! They did not dare to complain as they required the help of the Above Heavens Sect to conquer the world.</p><br/><p>However, both the masters of the Xiao Family had long begun discussions in secret on how to get rid of the Above Heavens Sect after they had conquered the world! No matter what, there would come a day when their relationship would come to an end! They had just moved the date forward by a few years.</p><br/><p>Right now, upon hearing that the entire Above Heavens Sect had been annihilated, with Meng FanYun who was akin to a deity having perished at the hands of Ling Jian, this meant that their malignant tumor had already been removed. How could the Xiao Family, who had been suppressed for so long, not feel happy?</p><br/><p>The news of Meng FanYun’s death replaced the pain and sadness of the large number of casualties that was hanging in the air previously! Xiao FengHan and Xiao FengYang even felt that, for such an outcome, the number of sacrifices was justified. Even if a few more people were to be thrown in the pit, it would still be worth it!</p><br/><p>“Oh, about your wounds, how are they? Are they serious?” Gazing at Ling Jian’s pale complexion, Ling Tian felt a sense of worry.</p><br/><p>“My injuries are of no concern. If not for the armor that young noble gave to me, I’m afraid I would not have the chance to report to you.” Ling Jian laughed bitterly, before stuttering as he lowered his head to Ling Tian’s ear. “Young noble, that lass ended up being angry at me for a whole night.” As he spoke, he glanced around shiftily before lightly pulling up his sleeve, bearing a bitter expression as he continued, “Look, my entire body turned out to be like this. This lass is really fierce!”</p><br/><p>Ling Jian’s entire arm was actually decorated with many bruises all over!</p><br/><p>Ling Tian was rendered completely speechless. This sort of henpecked conduct from Ling Jian he had not seen for quite a while. The last time was when Li Xue was making life difficult for him! However, this could be said to be his own just desserts, for not considering the lady’s image before acting. It would be weird if she did not throw a tantrum. Ling Tian could only laugh helplessly in response.</p><br/><p>Xiao YouHan dawdled as she too slowly strolled over, seemingly a little bashful, as she avoided looking at Ling Jian directly. Ling Tian had just turned over to look at her, but Xiao YouHan immediately lowered her face as she blushed. However, just a second after, she lifted her head again, fiercely staring back at Ling Tian. In the entire Ling Xiao Families, the only person who had the guts to gaze at Ling Tian this way would probably be this big Miss here. Most likely, there was no precedent, and there would also be nobody who would continue this in the future!</p><br/><p>Ling Tian laughed, staring at her with a mischievous look on his face as he said, “Miss Xiao, I trust that you are in good health? Your body should be fine, right!”</p><br/><p>“Thank you for the concern, it’s all thanks to the contributions by Crown Prince that I can feel a lot better.” Xiao YouHan huffed, “Crown Prince has really schemed wonderfully. It’s just that to scheme against a small girl is a little too underhanded of you.”</p><br/><p>Ling Tian laughed louder as he replied, “Miss, don’t stand on ceremony, wasn’t this in accordance with your wishes? I only helped Miss fulfill her dreams, you don’t need to be too grateful towards me. Everyone here knows that I’m a person who only helps but doesn’t expect anything in return. That’s right, for this matter, Justice from Beyond Heavens has really put in quite the bit of effort. If you really wish to thank someone, then you should thank him! The stuff about Yin and Yang negating each other, it was all taught by him!”</p><br/><p>Xiao YouHan was so angered that her breath caught in her throat. She could only resort to stamping her feet and pout. Seeing Ling Jian laughing like an idiot at the corner, she could not resist but roll her eyes at him. “It’s all your fault!”</p><br/><p>Ling Chen and Li Xue looked confused. Why did Ling Tian and Xiao YouHan start pointing daggers at each other after merely a night? Their sentences were loaded with gunpowder, and Xiao YouHan’s attitude was unlike her previous aloof and cold self. Furthermore, what yin and yang negating each other, what was all of this?!</p><br/><p>The two ladies had their curiosity piqued, and immediately pulled Xiao YouHan to the side to interrogate her.</p><br/><p>Xiao YouHan actually did not wish to say anything. After all, this matter was a little embarrassing to her, however, Ling Tian knew that this was his chance to brag to the two ladies who were his partners. Thus, he chose to say it out openly, and claim credit for his efforts. Wasn’t this killing two birds with one stone?</p><br/><p>After hearing her hatefully finish her story with a reddened face, Li Xue and Ling Chen both burst into laughter as well. They only felt that Ling Tian was too mischievous this time around, and in addition, there was still Justice, that old man who knew no shame. What sort of esteemed senior was he, that guy deserved a beating!</p><br/><p>The two ladies immediately came to the same conclusion after that: Ling Tian that jerk really knew his way around ladies! It seemed like they had to keep a close eye on him thereafter. If they did not do so, maybe one day, they would return to see the harem being filled with a few more ‘sisters’. Hmph hmph hmph, the two shared a sly glance at each other, coming to a tacit mutual understanding.</p><br/><p>Ling Tian still remained unaware that it was his prank that was not a prank that completely destroyed his perfect dream of being able to flirt with ladies all around. If he were to find out, his smiling expression right now would completely devolve into that of sobbing bitterly.</p><br/><p>As the saying goes, ‘The evil we bring upon ourselves is the hardest to bear’!</p><br/><p>“Xiao Family Head, now that the Above Heavens Sect has been eradicated, what does the Xiao Family intend to do in the future?” Ling Tian laughed as he faced Xiao FengHan, speaking in a sincere tone, “My grandfather has always been reminiscing about the days spent with Xiao Family Head, and the rescue this time was also because His Majesty, my grandfather, had given consent to it. Since the few of you are already getting along in age, how about living harmoniously under a roof, enjoying what life has to offer together in the twilight years of one’s life. Wouldn’t that be nice?”</p></div>\n</div>"}