{"title": "Chapter 701 - Silence", "id": 701, "volume": 8, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-701-silence", "volume_title": "Volume 8", "body": "<h1>Chapter 701 - Silence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>After the intense battle last night, Ling Chen and Li Xue were finally able to escape from the demonic hands of Ling Tian. After a night of endless joy and pleasure, the two of them were completely drained of all their strength! Even with the two of them working together, they weren’t able to deal with a single Ling Tian! Ling Tian had intentionally vented his frustrations on Li Xue for spoiling his plans over and over again. Since it was the first time for Li Xue, she knew that she wouldn’t be a match for Ling Tian alone. However, even with the aid of Ling Chen, the two of them were still helpless against Ling Tian. At the very end, even Li Xue who refused to admit defeat had no choice but to raise the white flag of surrender.</p><br/><p>Ling Tian had thoroughly enjoyed himself this time around! He had never felt such a sense of satisfaction ever since he came into this world! With his heart full of satisfaction, he let down all of his defenses for once and fell into a deep sleep.</p><br/><p>He slept until…</p><br/><p>The sun was high up in the sky and Shui QianRou was puzzled. Yesterday, the six of them had agreed to have a good conversation but there was no news of Ling Chen and Li Xue up until now. Helpless, the remaining girls could only gather together to find the other two ladies. When they went to the eastern palace to find Ling Chen, they were greeted with emptiness. The palace maids greeted them while stammering, saying that the Empress had not rested in her palace since last evening. If not for Ling Chen giving an order for them to not worry, the entire palace would probably be in complete chaos.</p><br/><p>Being filled with doubts, the ladies then visited the palace of imperial consort Li Xue and were immediately at ease. It turned out that Ling Chen and Li Xue spent the entire night talking. No wonder the two of them were still asleep at this moment. It seems like the two ladies must have talked for an entire night.</p><br/><p>Stopping the maids from reporting their arrival, the four ladies tiptoed their way into Li Xue’s bedroom and wanted to give the two ladies a surprise. Charging into the room, Shui QianRou shouted out in surprise while snatching the blanket away from the bed.</p><br/><p>“Time to get up! Haha… Ah? AHH?!!” A gasp of shock could be heard and the four ladies turned around with their faces red.</p><br/><p>On the bed and under the blanket were three stark-naked bodies.</p><br/><p>“AHHH!!” A cry of extreme embarrassment sounded…</p><br/><p>“Where are my clothes?… this… this…”</p><br/><p>“Ahhh… this is too embarrassing…”</p><br/><p>“You you you you… hmph hmph hmph…”</p><br/><p>A frenzied mess erupted.</p><br/><p>After the intense battle last night, Ling Tian was truly too exhausted and was currently in deep sleep. If not for this, with his current cultivation, it would be impossible for a bunch of people to approach him without him knowing. Being deep in sleep, he suddenly felt his body become cold and upon opening his eyes, he understood what was going on. Looking at Ling Chen and Li Xue putting on their clothes with their faces flushed in embarrassment, Ling Tian stretched his body and a pillar rose to the sky. Even after the battle last night, his little brother had…</p><br/><p>Since they are all my wives, so what if they take a look? Ling Tian thought to himself without the slightest bit of shame. With his pillar standing up proudly, the ladies were even more embarrassed as they turned around and ran out of the room.</p><br/><p>A bunch of clothes were thrown in his face and Li Xue’s embarrassed voice sounded, “You you… hurry up and put on your clothes!!!”</p><br/><p>…</p><br/><p>They were finally fully dressed and Ling Tian walked out of the room with a bright smile of satisfaction on his face. He reminisced about last night as he walked out of the room and sat on the chair.</p><br/><p>All of the six peerless beauties were present and all of their faces were flushed red and heads lowered. Especially Ling Chen and Li Xue, they looked as though they had committed the same crime as they squirmed around uneasily in the chair as though they wanted to find a hole to hide themselves in.</p><br/><p>Especially Li Xue, her entire body was on fire and she did not know where to hide her face. After all, she was the mastermind behind their little plan and she had gathered together all of the other ladies to work together with her. In the end, she was actually caught in bed with Ling Tian… just what should she do?</p><br/><p>If they suspected her… it would truly be too embarrassing! For her to be caught in the act completely naked…</p><br/><p>“Why… why are all of you here? Don’t all of you have any manners!” Ling Tian asked with an innocent pair of eyes.</p><br/><p>“We… this… cough cough…” All of the ladies were stumped. They couldn’t possibly say that they didn’t feel too good about last night’s matter and were gathering together to discuss the matter.</p><br/><p>Shui QianRou stood up with her face flushed red, “This consort was wrong. This consort shouldn’t have barged in and disrupt the good affair of the Empress and Imperial Consort. This consort seeks forgiveness from the Emperor, Empress, and Consort.”</p><br/><p>With her words, both Ling Chen and Li Xue were even more embarrassed. Li Xue began cursing under her breath as she glared at Ling Tian, “It’s all your fault! All your fault!!”</p><br/><p>Ling Tian chuckled and said, “We are all a big family and there isn’t a need to seek forgiveness. I have already given orders for my bedroom to be expanded and all of you can shift over to stay there in the future. As for all of your current palaces, you can all go back when you wish or just leave it empty.”</p><br/><p>“Really? That’s great! It is truly too tiring for us to stay so far from each other!” Yu BingYan’s eyes glowed with excitement and almost leaped for joy. The other ladies also had a look of elation on their faces. With this small interruption, the awkwardness that Ling Chen and Li Xue felt was greatly reduced.</p><br/><p>Only then did Li Xue say with a chuckle, “Last night when we all chased him out, the Empress wasn’t at ease and dragged me out to look for him.”</p><br/><p>All of the ladies then let out a profound ‘oh’…</p><br/><p>Li Xue’s face flushed red and she hurriedly defended herself, “It isn’t like what you think…”</p><br/><p>Yu BingYan smiled and made a funny face, “What we think? What exactly are we thinking about?”</p><br/><p>Li Xue’s face turned even redder and ignored Yu BingYan entirely, “Unable to find him, younger sister Chen and I decided to talk through the night. Who would have thought that halfway through the night, this shameless scoundrel would find his way over and he actually jumped in from the window…”</p><br/><p>All the ladies burst out into laughter together, “So it turns out that elder sister met a lecher last night. Elder sister didn’t lose your body, right? Hahaha…”</p><br/><p>Seeing the other ladies not misunderstanding anything, Ling Chen and Li Xue finally thought about questioning the other ladies, “Hmm? That’s right! Aren’t all of you too bold this morning? No matter what, this is still the palace of an imperial consort and how can all of you be so preposterous?! All of you cannot be let off so easily!”</p><br/><p>Only then did Ling Chen lift up her head. “That’s right! All of you went too far! None of you shall be spared lightly! This seat wants to punish all of you!”</p><br/><p>“Ah?” All of the ladies were dumbfounded. While they tended to tease each other frequently back in the Courtyard, it didn’t matter since no outsiders were present. However, this morning was entirely different. After all, a man was added into the mix and it was truly too… awkward. Everyone could not help but tremble slightly.</p><br/><p>“All of you cannot be let off lightly indeed!” Ling Tian said with a solemn expression, “My dear wives, how about this? I shall drag these four ladies into my bed tomorrow morning and the two of you can uncover the blanket as revenge. How about this? This is a good idea, right? This is called an eye for an eye! Haha, while it would be a little tiring for me, I wouldn’t mind at all…”</p><br/><p>The instant those words came out from Ling Tian’s mouth, a flurry of fists and kicks came flying towards Ling Tian and drowned him.</p><br/><p>“You must be dreaming!”</p><br/><p>“Wouldn’t you be the only one benefitting?!”</p><br/><p>“Sisters, beat him up…”</p><br/><p>Ling Tian clutched his head pitifully…</p><br/><p>In his first honeymoon month, Ling Tian truly had an extremely sweet month. He had lazed his days away for an entire month and spent his days in softness. If not for Meng LiGe pressing him, Ling Tian also wanted to be an emperor that didn’t attend morning court.</p><br/><p>However, Ling Tian made a decree: He pushed back the time for morning court by three hours!</p><br/><p>He pushed the timing of the morning court from five to eight in the morning. While he sounded extremely righteous and caring on the surface, saying that he was concerned about the old age of the ministers and generals. In truth, it was just because emperor Ling Tian could not bear to part with his bed in the morning.</p><br/><p>Time passed by in a blink of an eye and a year and a half passed by quickly.</p><br/><p>Nothing much happened during this time. After the wedding of emperor Ling Tian, Ling Tian conferred the title of Divine Sword Duke to Ling Jian and Ling Tian then personally hosted Ling Jian’s wedding.</p><br/><p>With the founding of the Divine Prefecture Empire, the atmosphere of the court was extremely fresh and clean. Ling Tian pushed out a series of new policies that were both beneficial to the country and commoners. Together with Ling Tian’s iron-fisted methods and numerous talents under his charge, all of Ling Tian’s decisions and policies were carried out efficiently. Any form of opposition was almost non-existent!</p><br/><p>In the entire empire, all the government officials performed their jobs dutifully and the commoners were at peace. The entire empire was filled with prosperity and peace.</p><br/><p>At the borders of the empire, both the Ling and Yu Family were biding their time and preparing for battle. Soldiers and military resources were continuously sent towards the borders with both empires on high vigilance. However, both parties did not dare to take the initiative to make a rash move.</p><br/><p>Everyone knew that the moment battle broke out, it would not end unless one party ended in destruction. Furthermore, the battle would drag on for a long period of time, and on top of the massive wealth required to support the battle, there would be hundreds of thousands who would lose their lives. Both the Yu Family and Divine Prefecture Empire had just emerged from war. If they were to start such a huge battle again, neither of the two families would be able to endure the expenditure. Thus, this formed a delicate situation where both empires did not dare to make a rash move.</p><br/><p>However, everyone knew that there would come a time when both countries were well-rested. As the days passed one by one, it signified that they were getting closer to war day by day. Thus, not a single person dared to ease up.</p><br/><p>Regardless of the generals or soldiers, they were all extremely clear about that!</p><br/><p>Both the families would break out in small skirmishes once in a while and they both treated it as training for their soldiers.</p><br/><p>During this period of rest, Yu ManLou conscripted soldiers endlessly. He knew that the number of soldiers he had was far inferior to Ling Tian’s forces. After all, Ling Tian did not expend a single man to subdue the Xiao Family and they had even incorporated a large number of the Xiao Family’s troops into their own forces. If their Yu Family didn’t conscript more soldiers, Ling Tian could easily overrun their forces by using a human wave tactic.</p><br/><p>On the other side, the prestige of the Sky Alliance was unstoppable. Under the aid of the Shui Family, the Sky Alliance rapidly swept through the entire Heavenly Wind like a miracle! In just a short year and a half, the underworld of the Heavenly Wind Continent was already under the control of the Sky Alliance!</p><br/><p>Those who defy me shall die!</p><br/><p>At the same time, another mysterious organization appeared on the Heavenly Wind Continent.</p><br/><p>League of Rosy Cheeks!</p><br/><p>The appearance of this name was just like the First Pavilion and Crystal Pavilion from back then! It appeared out of nowhere and shook the entire continent in a short period of time!</p><br/><p>It is said that all the members of this League of Rosy Cheeks were ladies and their targets were all the wealthy tyrants who bullied the commoners, local tyrants who did all kinds of evil, and the government officials who abused their power for personal interests. The moment these individuals were found, rivers of blood would flow! Not a single person would be spared! The viciousness of their means and swiftness of their attacks was truly astounding!</p><br/><p>This organization made a sudden appearance and swept through the entire continent in a short amount of time. Currently, it had even begun to appear in Heavenly Star as well. Everywhere they went, corrupt officials would wallow in grief and the local tyrants would be frightened out of their wits. The name of the League of Rosy Cheeks shook the entire world and the commoners treated them like living Buddhas. This good news had even spread into the palace and the ears of emperor Ling Tian. This made emperor Ling Tian who was busy with his everyday affairs dumbfounded.</p><br/><p>“So quickly?” Ling Tian raised his head up in shock as he looked at Ling Jian. After the wedding, Ling Jian was still as cold as ever. However, those who were familiar with Ling Jian could tell that the current Ling Jian had a lot more human emotion than before. Ling Tian frequently joked that Ling Jian was finally more like a living person.</p><br/><p>“When Ling One and the others trained the League of Rosy Cheeks, they used the methods that young noble used to train us.” Ling Jian’s eyes glowed and a look of admiration could be seen in his eyes, “To a bunch of weak ladies, such intense training was no different from a living hell! However, they were actually able to endure all of that. While there were thirty or so ladies who died from fatigue, not a single person gave up…”</p><br/><p>Ling Tian took in a deep breath and understood what Ling Jian’s words meant.</p><br/><p>When he trained Ling Jian and the others, they were still children and at the best age to train. Their bodies were flexible and they still had a great deal of potential for growth. However, the ladies who he saved had mostly passed that age and it could be said that most of them were fully developed!</p><br/><p>With their fully developed bodies and being weak ladies, they had to endure the devilish training that Ling One and the others went through. This was originally almost impossible to complete! This was a huge error on Ling One’s part! However, those ladies were able to endure the training and graduate from training in a year and a half!</p><br/><p>This was an unbelievable miracle!</p><br/><p>Just what kind of unbelievable torture did they have to endure? It would be impossible for an ordinary individual to imagine it. However, as the person who designed the training and Ling Jian who had personally experienced the bitterness of the training, how would they be unable to imagine the pain?!</p><br/><p>“They are all ladies and their bodies were weaker than ours.” Ling Jian narrated slowly, “With the severe training, they shouldn’t have been able to endure the stress on their bodies. However, the moment they endured the initial training phase, their improvements after that were even swifter than men… so…”</p><br/><p>Ling Tian immediately understood Ling Jian’s intentions and said with a deep breath, “Ah Jian, you have personally experienced the intense training before and should understand just how difficult it is to tide over the initial training phase! With the weaker bodies of a lady, just what kind of willpower was required for them to achieve such a feat?!”</p><br/><p>Ling Jian fell silent for a long while before saying, “The willpower of these ladies is probably above that of us in the past!”</p><br/><p>Ling Tian stood up and walked in front of the window. Shaking his head, he said, “This is definitely true! The constitution of a female body is weaker than a male but once a female has a target in mind, her willpower will exceed that of a man! All the ladies of the League of Rosy Cheeks were ordinary commoner daughters and the only reason behind their accomplishments today was because they had suffered too greatly in the past! The deep hatred in their heart had become their greatest motivation and formed unbreakable willpower. If not, it would be impossible for them to endure such hardship! It truly wasn’t easy…”</p><br/><p>“Yes! It wasn’t easy indeed.” Ling Jian’s eyes lit up and said, “If we can train another batch of ladies using this method, wouldn’t it mean…”</p><br/><p>“No! You must not even entertain this thought! These ladies are a complete coincidence and an exception! You must not attempt this again!” Ling Tian ended the idea blooming in Ling Jian’s head, “There are certain things that a man must not do! This is something that I will never do! Not only me, no one else will be allowed to do this! I forbid to train any ladies with such a method forever! Forever! Those who defy this order shall be executed regardless of who the person is!”</p><br/><p>“Yes!’ Ling Jian replied emotionlessly and a look of admiration could be seen on his face.</p><br/><p>“How is the organization that you are managing in secret?” Ling Tian asked casually.</p><br/><p>Ling Jian’s eyes lit up and said, “All of the manpower has been prepared and the first batch is already being sent out. We are going to train the few subjects that young noble and imperial consort said.”</p><br/><p>Ling Tian nodded his head before saying, “Make some arrangements to aid the League of Rosy Cheeks in their missions. Also, you must monitor their actions well. While it isn’t wrong for them to uproot evil, they cannot be too lawless either. There must be a good balance in their actions and you better manage it on your own.”</p><br/><p>Ling Jian bowed in response and was extremely used to such orders. This was something that did not pose any difficulty to him at all.</p><br/><p>“Has there been any movements in the Yu Family?” Ling Tian walked forward slowly and asked casually.</p><br/><p>“There aren’t any big actions and the situation on the border is just as before. However…” a strange expression could be seen on Ling Jian’s face, “I heard that Yu ManTian had a couple of arguments with Yu ManLou and was reprimanded a couple of times. He was even grounded twice and jailed once.”</p><br/><p>Ling Tian could not help but laugh, “With that fellow’s character, this is extremely ordinary.” After pausing for a moment, he asked, “Second Master Yu… didn’t send any news?”</p><br/><p>“Apart from sending Imperial Consort Yu a jade hairpin, he did not come again. He is also extremely silent in the Yu Family and there isn’t any news of him doing anything out of the ordinary.” Ling Jian walked beside Ling Tian.</p><br/><p>“Oh.” Ling Tian suddenly stopped walking and looked up at the sky, “Heavenly Wind…”</p><br/><p>“Everything is ready!” Ling Jian replied immediately.</p><br/><p>“Mmm.” Ling Tian shut his eyes and muttered, “Since that’s the case, the time is about right and Yu ManLou should be becoming anxious soon. Since everyone is already tired of waiting…” His voice was soft and calm. However, even the usually calm and vicious Ling Jian felt a chill run down his spine. As Ling Tian said those words, Ling Jian could imagine a sea of blood flowing before him…</p><br/><p>“During spring of next year will be the time when I flatten the Yu Family and unite the entire world!”</p><br/><p>Ling Tian lifted his head up and look at the sun in the sky. At this moment, the divine glow in his eyes seemed to be capable of suppressing the splendor of the sun! His yellow robes fluttered in the winds and he looked as though he was capable of soaring above the nine heavens!</p><br/><p>At the same time, in the Yu Family’s imperial palace.</p><br/><p>Yu ManLou looked at the sun with his eyes half shut as he muttered, “A storm that should have erupted two years ago has been suppressed until now. With the storm clouds gathering for such a long time without any rain, the storm clouds must be getting impatient. Ling Tian, among the two of us, who will be the first to break this delicate situation? The silence of the forest awaits the rain! The storm has to come eventually!”</p><br/><p>He then shook his head with a smile, “Regardless of who goes first, this delicate balance will have to be destroyed eventually.” He then turned around and ordered, “Men! Inform the five battalions to prepare for battle! All of the experts in the Yu Family who have martial arts are to report to the military! During spring next year, our army shall raise our flags and trample over Sky Bearing. We will capture Ling Tian alive and unite the world!”</p><br/><p>“Yes!”</p><br/><p>One in the north and the other in the south, the two peerless rulers had made the same decision and decided on the same time!</p><br/><p>The two of them unveiled their final trump card at the same time!</p><br/><p>Who would be the final victor?!</p><br/><p>The skies were changing rapidly!</p><br/><p>Plans can never change as fast as times.</p><br/><p>Both Ling Tian and Yu ManLou probably wouldn’t be able to imagine that this huge battle which they had been waiting for would be unveiled in such a bizarre manner.</p><br/><p>As such, when they heard of the actions of the other party, they were both dumbfounded. Everything that happened was truly out of their expectations and plans! At that moment, both rulers had a sense of loss.</p></div>\n</div>"}