{"title": "Chapter 706 - Moment of Life and Death", "id": 706, "volume": 8, "url": "http://boxnovel.org/legend-of-ling-tian-chapter-706-moment-of-life-and-death", "volume_title": "Volume 8", "body": "<h1>Chapter 706 - Moment of Life and Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<div class=\"cha-words\"><br/><p>Far behind Ling Jian and his group were seven to eight others proceeding forward in a fan shape. While their speed was praiseworthy, compared to Ling Jian and company, the group could be considered like tortoises crawling.</p><br/><p>But their work was more important.</p><br/><p>They were tasked to scrutinize the area, finding possible routes that would allow the army, horses, and logistics to pass by easily. With precipitous cliffs along the journey, as well as accumulated snow almost half the height of a person and the snow flurries that blocked out most of their vision, such work was incredibly dangerous. Thus their responsibility was all the greater! A slight miscalculation and this would cause irreparable damage to the thousands of troops when they fell into the abyss…</p><br/><p>Every one of them had on a long rope in their hands, such that if they misstepped and fell into a ravine, then their teammates would be able to use the rope to pull them back to safety…</p><br/><p>Of the seven to eight people, at the head was Ling Chi. One could only see him continuously sigh, as he occasionally raised his head to gaze at the front where faint sounds of killing could be heard while grumbling about his bad luck. However, this was only his imagination, as they were separated by a good five kilometers or so. To be able to hear noises from that far was not something anyone could do, not even Ling Tian!</p><br/><p>He was completely relying on his feet to test out the route in front of them. Even with his abilities, Ling Chi did not dare to be careless. With the snowfall already lasting several days, the entire mountain and forest had been leveled by the snow, and no one could tell apart the roads from the cliff sides. A misstep would only result in broken bones!</p><br/><p>With his current responsibility, he could not behave like those brothers of his ahead and rely on his movement techniques to skim the surface of the snow…. as he mused, the snow beneath his feet suddenly gave way. Ling Chi shouted out loudly as he felt his body plummet.</p><br/><p>“Sou!” A long rope flew over and wrapped across the waist of Ling Chi in a moment. Borrowing this force, Ling Chi shot back up to where his last steps were. Brandishing his sword, he hacked off four to five yards of snow in front of him, revealing a deep crevice beneath his feet. Seeing this yawning gap, even Ling Chi who had a stable temperament could not help but feel a little fear. He seriously marked down this spot on the map, before the group continued their sweep.</p><br/><p>Behind them, at a distance of around 1,000 feet, the main force tagged closely to the route they had opened up, plowing with difficulty through the snow.</p><br/><p>…</p><br/><p>The sounds of killing and scream resounded in the sky, as the Yu Family attacked once more, pouncing forward ferociously.</p><br/><p>Right now, it was currently twilight.</p><br/><p>Ling Feng and Ling Yun stood at a vantage point, their bodies covered with blood as ten or so experts of the Yu Family that were dressed like ordinary soldiers carried out a vicious attack while encircling them!</p><br/><p>The consecutive attacks made the last few days by the Yu Family experts allowed them to know that the unrestrained killing by these two youths was the reason that the Yu Family Generals had all perished without justice in this war! The methods employed by the duo were ruthless and vicious, and those who had seen them act before felt their hearts turn cold. The swords in their hands were akin to the scythe of the grim reaper, Every time it shot out, there would definitely be a life reaped!</p><br/><p>If they were unable to get rid of the duo, the troops of the Yu Family would suffer huge losses! As such, the objective of their attacks this time was just the two of them! The Yu Family even employed 20 experts of the XianTian realm, just to counter the two youths!</p><br/><p>Feng Mo angrily roared, gathering reinforcements to rush towards Ling Feng and Ling Yun as though he cared not for his life any longer. He had long seen through the enemy’s ruse, and even if he had to sacrifice his own life, he had to bring Ling Feng and Ling Yun back!</p><br/><p>But facing the densely packed enemy troops in front of him, no matter how much he staked forth, the enemy was willing to sacrifice the attack on the mountain pass just to prevent Feng Mo from assisting the duo. This group even included more than ten White Jade Experts from the Yu Family, and both sides traded lives repeatedly, causing the battlefield to become more tragic and even bloodier!</p><br/><p>Seeing that his vision was getting blurry, Ling Feng instinctively realized that it was because he had already lost too much blood along with an over-exertion of his inner qi. By his side, Ling Yun had also begun to stagger in his footsteps. Most likely, he was also on his last legs. However, both of them still had the same steely expression on their faces, determinedly stabbing out their swords each time. They had decided to trade every inch of their flesh and blood with the lives of the Yu Family experts, making them accompany them to their graves!</p><br/><p>On the hill far away, a group of people had their eyes fixed on the tragic battle that was unfolding, their expressions ever-changing. The grit and perseverance that Ling Feng and Ling Yun had displayed were totally beyond everyone’s expectations. Based on the injuries they had suffered, if it was another person, even if they were a White Jade ranked expert, they would have long ago fallen unconscious and maybe even died! However, these two youths were still akin to lively dragons and animated tigers, without showing the least bit of fatigue!</p><br/><p>If it was any other fighter in the martial world, under such circumstances they would have long ago lost the will to fight on. However, the expressions of the two youths were still serene, as though it was them that were the masters of death, not the other way round!</p><br/><p>Out of the 20 odd White Jade experts that were sent to encircle them, they were all led by an expert at the Gold Jade rank. However, more than half had already perished at this point to reach such a result!</p><br/><p>That’s right, death!</p><br/><p>Only death, nothing else!</p><br/><p>The actions of the two youths left none alive! The moment the sword shot out, it was an absolute kill!</p><br/><p>Even so, there was a limit to the strength of a single person. At this point, they were already unable to turn around their undesirable scenarios. While a fierce tiger might be the King of the Beasts, it could maybe kill off a wolf, 10 wolves, but it would, in the end, find it hard to fend off 100, maybe even 1,000!</p><br/><p>The battle on the hill was becoming more desperate, and the situation of Ling Feng and Ling Yun was becoming more dangerous by the second. They could be in mortal danger at the slightest misstep. Feng Mo who was barricaded by a human wall screamed out to the heavens, the rims of his eyes turning bloodshot in anger. But even he had no idea how to break this scenario.</p><br/><p>On the side of the Yu Family, a middle-aged male stood far away on one of the hills with his eyes twinkling in undisguised coldness as he gave the command, “The entire Northern army of 30,000 is to go all out, pressure the line, and break through the mountain pass in one go! Slaughter the remnants of the enemy, there’s no need to take prisoners! Leave no one alive, kill them all!” Beside him, a pitch-black flag rose up, fluttering in the wind.</p><br/><p>From the camp, the low beats of a war drum could be heard, the vibrations causing the hearts of everyone to shake. The army surged forward like a tsunami, and the warhorses were unleashed. On this field of white, their momentum pressuring the Ling Family’s forces.</p><br/><p>The corner of Feng Mo’s eyes cracked due to his agitation as he screamed himself hoarse, “Brothers, let’s stake it all!”</p><br/><p>“We’ll risk it all!” Amid the furious screams, the multitude of soldiers from the Divine Prefecture Empire poured out from the bunkers. Everyone had varying degrees of injuries, such as bandaged legs or arms. All their bodies were stained with blood, and those that could still stand all raised their weapons, densely packing themselves at the mountain pass.</p><br/><p>This was already the final moments! Facing an enemy whose strength vastly outnumbered theirs, even though there was no hope of survival, there was still the instinct to struggle and put up a last stand!</p><br/><p>“These two youths are definitely part of the First Pavilion! Possibly even important figures within the First Pavilion!” Within the Yu Family, the same square-faced middle-aged man exclaimed as he sighed, watching Ling Feng and Ling Yun in the battle. “In just a few days, the number our people who died under the hands of these two numbered close to 2,000!</p><br/><p>On average, each one of them had killed a thousand each! Within those targeted, there were no injuries, only deaths! They were all killed in a single blow, without even the ability to shout for help before they died! Other than the First Pavilion, I believe there’s nobody else capable of such merciless slaughter!”</p><br/><p>“Even if they are from the First Pavilion, they will still have to die!” A shrunken elder by the side viciously stared at Ling Feng and Ling Yun who were embroiled in the battle. “Since they have already chosen the route of slaughter, then they are definitely prepared to be killed one day!”</p><br/><p>“This is not what I meant!” The square-faced man was a little worked up, and he furrowed his brow as he spoke, “Our attack this time was because they had killed many of the third generation disciples from our Yu Family, which incited our revenge! But have you ever thought, if we were to kill an important person from the First Pavilion, then what will happen to us in return?”</p><br/><p>“Especially that number one assassin, how will he react? Don’t forget, the danger of the First Pavilion’s Master is above that of the Martial Order Medallion Owner, Heavenly Justice! While Justice might be the world’s number one, but he doesn’t make a move easily. So long as we do not provoke him, then he will not care about us! But what about the Master of the First Pavilion?”</p><br/><p>“That guy is a pure asura! So long as he wishes to take revenge, our endings will be tragic!”</p><br/><p>A couple of people standing on the slope had their expressions change. The fear brought about by the First Pavilion’s Master was naturally something they knew and were clear about. They knew that these were not just empty words of the square-faced guy.</p><br/><p>“Could it be that we still have to let them go, even though the matters have reached such a point?” At the side, one of the Yu Family’s people stared with anger at Ling Feng and Ling Yun. He hatefully spat out, “So what if it’s the First Pavilion? So what, even if we take revenge? Just because they’re from the First Pavilion, does that mean that my grandsons and disciples have to die for nothing?!”</p><br/><p>He coldly barked with laughter, looking at the square-faced guy with sarcasm, “Don’t tell me Second Brother that you are afraid of revenge from the First Pavilion? Don’t forget, the First Pavilion has completely pledged their allegiance to the Divine Prefecture Empire, and showing mercy to our enemies is as good as being cruel to our own people! You’re lucky only we are around to hear your words. If the Emperor hears of this, I’m afraid that Second Brother will be in big trouble!”</p><br/><p>“What bull are you spouting!” The square-faced male panicked immediately, feeling a little powerless under the stupidity of his fellow teammates. He fiercely lectured, “You didn’t even bother to properly clarify what I meant! Do you think I’m unaware that the First Pavilion and our Yu Family are at odds?”</p><br/><p>“The two kids there have killed off so many of our Yu Family disciples, to kill them just like this would be too cheap for them. Since we’ve already confirmed that they’re from the First Pavilion, then why not use this to our advantage? Since the First Pavilion will definitely take revenge, then we’ll plan on how to deal with the repercussions so we can breathe easier afterward! If we capture them alive and cripple their cultivations, then wouldn’t we be able to use these two as a death trap? Even if we can’t capture them alive, their bodies can still be used to tempt the enemy!”</p><br/><p>“All of you can’t even think of such a simple plan, and only know how to kill people to take revenge. Do you think the matter would end after you guys took your revenge? What about your future plans?!”</p><br/><p>Everyone fell into silence.</p><br/><p>“Brilliant plan!” The shriveled elder’s eyes lit up as he raised his head to speak, “This is indeed an ingenious plan! After the First Pavilion pledged their allegiance to Ling Tian, they hid so deeply that we couldn’t find any traces of them or their headquarters! While the Master of the First Pavilion might be the top assassin in the world, vicious and ruthless with martial skills at the pinnacle, he has a shortcoming which is that he deeply treasures his subordinates.”</p><br/><p>“So long as we can get both of them in our hands, then I can vent my frustration by inflicting a hundred different tortures on them. At that time, be it alive or dead, they will become the best weapon we have against the First Pavilion!”</p><br/><p>Everyone nodded their heads in agreement, thinking to themselves about the completeness of this plan. Not only would they be able to rid themselves of their anger and frustrations, but also could stage a huge scheme to wipe out their enemy, this was killing two birds with one stone!</p><br/><p>At this point, a cold voice rang out, carrying with it obvious sarcasm, pressure, and anger, not to mention an unadulterated killing intent, “Brilliant plan? Is it really THAT ingenious?”</p><br/><p>The voice appeared out of nowhere, and even if the multitude of experts present here, no one could detect when the owner of the voice had arrived! All of them lost color in their faces as they turned to face their back.</p><br/><p>About 70 to 80 feet behind the group, a figure dressed completely in black was standing in front of a shrub that was completely buried by snow, with his back towards them. His black winter cape fluttered along with the wind, and within the field of white snow, he was akin to a black specter. If anyone were to look directly at him, they would be able to feel as though there was a chill seeping out from their hearts, akin to the coldest air from the underworld!</p><br/><p>Death, Damnation, Deathly aura. Everything about him spelled death!</p><br/><p>From first glance, it could be seen that the black-robed male had a skinny figure, and his height was not tall as well. But standing there, he seemed to tower over even the tallest person from the Yu Family. It seemed possible that he could decide their life and death with just a single palm strike!</p><br/><p>As though feeling their gazes on him, the man in black slowly turned around and walked a few steps towards them. His piercing gaze punched through them one after another, indifferently and coldly remarking, “It’s just you guys?”</p><br/><p>“Traceless steps on the snow!” The shriveled elder exclaimed, a rarely seen look of cautiousness appearing on his face, even as his body started to prepare for battle. When everyone else heard his statement, they immediately trembled before staring incredulously at the newcomer’s feet. A pair of black shoes was clearly seen floating on the snow, with the yellowing upper area of the shoe appearing extremely clear as well.</p><br/><p>The black-robed man probably weighed over 50 kilograms, yet he was able to tread so lightly on the snow, to the point that he left no traces where he walked! It was as though his weight was lighter than that of a feather! Because even a feather would leave traces when dropped on the snow!</p><br/><p>The pupils of all the Yu Family experts present shrunk at this sight!</p><br/><p>The so-called traceless steps on the snow was just a term given to a realm which one has achieved for their movement techniques. Everyone present had naturally heard of this term, but no one had ever managed to see it with their eyes!</p><br/><p>Even those experts who claimed that they had achieved this fabled level were only able to make their bodies slightly lighter, reducing the weight and thus the imprint where they stepped on the snow. However, no one was able to achieve the level of not leaving any footprints. This was the same as the fabled ‘traveling a thousand miles in a blink’ and the famed ‘shrinking meters into inches’. They were merely terminologies, no one had ever managed to walk a thousand miles in an instant…</p><br/><p>But the man in black had lightly taken a few steps forward, and everyone could see that behind him there was no trace of the footsteps he had taken! This was a true traceless steps on the snow!</p><br/><p>Such movement techniques were simply that of a monster! Just what sort of inner qi was required to bring forth so a divine level of footwork? Let alone them, even their own peerless master, the Yu Family Head Yu ManLou was probably unable to achieve that!</p></div>\n</div>"}