{"title": "Chapter 5", "id": 5, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-5", "volume_title": "Volume 1", "body": "<h1>Chapter 5</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 5: Of course you guys have to take full responsibility!</b></p><br/><p>“Tell me what happened earlier. And what are you going to do about my ceiling? After we deal with these two issues, I will leave.” I leaned forward as I glared at Suyang.</p><br/><p>“Ok ok ok. Let’s take it slow. I will explain.” Shen Shaoqian was acting like a middle man as he tried to soothe me. It seemed like he was afraid I would turn nuts and get into a physical fight with Suyang.</p><br/><p>“The water pipes exploded two days ago. At the time, it wasn’t leaking a lot of water. Also, Suyang and I were too engrossed in our characters. So we weren’t aware.”</p><br/><p>“Engrossed in your characters?”</p><br/><p>“Suyang is a speculative author. This is his creation period. In order to obtain the real psychological emotions, we have already been facing each other in this room for two days. I am the murderer, and he is the victim.”</p><br/><p>“Why are you telling her all this?” Suyang interrupted.</p><br/><p>“I’m explaining to her!? Your temper….keep your mouth shut!”</p><br/><p><i>For some reason, in my eyes, Suyang and Shen Shaoqian were like an old couple….could they be?</i></p><br/><p>“No wonder your body odour was….” My mouth twitched.</p><br/><p>“Originally, we were already finished. Unexpectedly, you arrived. So Suyang said, if he added a witness to the story, it might be even better…”</p><br/><p>“But who would have thought you would be so senseless. You didn’t give me any inspiration.” Suyang interrupted again.</p><br/><p>“I swear, what’s wrong with you? Do you have a ‘I won’t feel good unless I suppress others’ illness?'” I yelled</p><br/><p>“Alright alright alright. Calm down! Don’t be so emotional!” Shen Shaoqian deliberately stood in between me and Suyang to soften the situation.</p><br/><p>Lunatics! I silently gave those two a label. Also, they do not seem like authors at all. They seem more like models? No, actors?</p><br/><p>I was still furious at Suyang. I glared at him with Shen Shaoqian in between us. But then I saw something strange.</p><br/><p>“Watch out!” I went past Shen Shaoqian and pulled Suyang behind me. Then, I yelled at my hot bodyguard, “What are you doing?!”</p><br/><p>…..</p><br/><p>Right away, the atmosphere seemed to freeze.</p><br/><p><i>Allow me to explain: While I wasn’t paying attention, my hot bodyguard suddenly appeared behind Suyang and reached out to attack him.</i></p><br/><p>I temporarily forgot that ghosts could not touch humans. But seeing his malicious intentions, I subconsciously wanted to protect Suyang. But from those two’s point of view, I was a crazy woman talking to air….eh?</p><br/><p>“What are you doing?” Suyang was staring at his hand that I had grabbed onto. He appeared frightened. What? Did he assume I wanted to take advantage of him?</p><br/><p>“I-I am not doing anything!” I awkwardly released his hand. My pupils were filled with doubt as my mind spun. Quick! Hurry up and think of an explanation! Explain this strange behaviour they had just witnessed.</p><br/><p>My hot bodyguard gave me a puzzled expression; as if he was asking me why I wouldn’t allow him to beat up Suyang.</p><br/><p>I gave him a glance to indicate that I wanted him to return home immediately.</p><br/><p>“Umm…could we go to your apartment to see the damages? I think it’s about time we discussed about the compensation….” asked Shen Shaoqian.</p><br/><p>Wow, what a good person! Shen Shaoqian was reaching out to help me escape this uncomfortable atmosphere.</p><br/><p>Since Shen Shaoqian mentioned about compensating me, I felt much better.</p><br/><p>But my face appeared unmoved. I made it seem like money didn’t faze me. “Since you suggested, I can show you. We will slowly discuss about the compensation.”</p><br/><p>“You go. I am going to stay here.” Suyang went to the blanket and sat cross-legged.</p><br/><p>“There is no point of you sitting here by yourself! We’re going to together!” Shen Shaoqian went over and forcefully pulled Suyang up and out the door.</p><br/><p>The two of them were being all touchy in front of me. Although I wasn’t sure, I felt like those two had a type of relationship….the legendary BL…I think so!</p><br/><p>But it was none of my business. So, I just had a huge smile plastered against my face as I looked at them from behind. My smile actually freaked Suyang out and he turned back a few times to look at me.</p><br/><p>My hot bodyguard was probably upset since I was harsh with him earlier. Currently, he gave off the impression that he was extremely depressed and lacked willpower as he lied on his stomach across the entrance.</p><br/><p>Suyang and Shen Shaoqian stepped on him as they entered. I subconsciously said, “Watch out…”</p><br/><p>Fortunately, they didn’t hear me.</p><br/><p>When we entered my apartment, the ceiling was even more damaged than when I had left.</p><br/><p>I was shocked. Was this place still liveable? The ceiling was going to cave in….</p><br/><p>Before I said a word, Shen Shaoqian and Suyang seemed to have an unspoken understanding and went off in separate directions to observe my apartment. Afterwards, Suyang turned around and nodded as he gave his assessment, “Yes. It’s quite serious.”</p><br/><p>I coldly made eye contact with him.</p><br/><p>Was he inspecting? How come his tone sounded more like a leader speaking to a subordinate?</p><br/><p>I was waiting for him to continue. But it turned out, there was no continuation.</p><br/><p>While I was giving him a skeptical look, he shamelessly pulled a stool to sit down and nearly sat on my ghost cat, Tom.</p><br/><p>“Don’t worry. We will take full responsibility for the repairs.” Shen Shaoqian pledged as he slapped his chest.</p><br/><p>“Of course you guys have to take full responsibility. It was your water pipe that caused my ceiling to be in this state. But during this time, I will not be able to live here. So….” I was testing them as I slyly peeked at Shen Shaoqian at the corner of my eyes.</p><br/><p>“I totally understand! Don’t worry. I will make sure you are satisfied. Please give me three hours and I will have everything resolved.”</p><br/><p>Not bad. He was reasonable and bright; quite efficient with handling tasks. I suddenly had a favourable impression of Shen Shaoqian. Although I was still annoyed at how they scared me earlier, but in comparison to Suyang, I preferred Shen Shaoqian much more.</p><br/><p>“I want to say….” Suyang was about to speak.</p><br/><p>“Don’t speak. You are done looking at my apartment, so you guys can leave now.” I cut Suyang off and gave them the notice to leave.</p><br/><p>I honestly didn’t want to hear him say another word.</p><br/><p>Shen Shaoqian was trying very hard not to laugh. He pretended to joke around with Suyang, “Understand? You’re very unlikeable. Since we’re done here, let’s go!”</p><br/><p>I followed Shen Shaoqian and Suyang out of the apartment. Shen Shaoqian turned around and asked me out of curiosity, “Are you leaving with us?”</p><br/>\n</div>"}