{"title": "Chapter 6", "id": 6, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-6", "volume_title": "Volume 1", "body": "<h1>Chapter 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 6: You can temporarily live here </b></p><br/><p>“Ah! No! I am going out.”</p><br/><p>While we were waiting for the elevator, my stomach grumbled and made a long ‘gu lu lu’ sound to show I really wasn’t leaving with them.</p><br/><p>I was positive they heard it. They just pretended they didn’t because it was embarrassing.</p><br/><p>“I am going down to eat some noodles because I am hungry.” I shook my head as I avoided eye contact with them.</p><br/><p>The elevator arrived and Shen Shaoqian made a hand gesture and said, “Ladies first.”</p><br/><p>I entered the elevator by myself. The moment the elevator doors closed, I felt like my mental state was going to topple over. I tightly grasped onto the handrail as I stared into the mirror and howled at my stomach, “Why couldn’t you give me some face?”</p><br/><p>I was moody as I went to my go-to noodle vendor stall. Honestly, their noodles weren’t the best. But a few years ago, the vendor’s daughter passed away from a car accident, and occasionally I would see her watching her father from the side when I passed by.</p><br/><p>For some strange reason, I had passed by the stall many times but never had the urge to try it. On one particular day, it was as if I was possessed. There was a voice in my head that kept telling me to, “Please come here and eat. Come here….”</p><br/><p>In the end, I sat down and tried their noodles. After that, I never went anywhere else for noodles.</p><br/><p>Even though I never came across the daughter again, I still continued to eat here.</p><br/><p>“Boss, give me a bowl of knife-shaved noodles.”</p><br/><p>Strictly speaking, this boss was someone I was familiar with. Except our conversations only consisted of ordering noodles, making noodles, eating noodles, paying, and leaving.</p><br/><p>The boss was a very silent and uncommunicative man. Most of the time, he would be expressionless as he restlessly worked.</p><br/><p>This time was no exception. The boss didn’t say a word to me as he handed me the bowl. I also didn’t say a word as I took the bowl from him. Then, I wolfed down my food.</p><br/><p>I looked at my watch and I was slightly concerned. Could Shen Shaoqian really handle everything within three hours?</p><br/><p>Was he going to give me cash? Or a cheque?</p><br/><p>Haha. When I thought about the money, I was very giddy.</p><br/><p>But what if the amount wasn’t something I was satisfied with? What should I do then?</p><br/><p>Should I directly explode? Or shamelessly lie on the ground? That was a difficult choice…</p><br/><p>After dinner, I decided to go for a voluntary stroll. If Shen Shaoqian wasn’t ready by the time we agreed upon, I will go prompt him.</p><br/><p>I was unemployed anyway. It was just to kill time.</p><br/><p>The moment I returned home, I noticed that my hot bodyguard was floating back and forth in the corridor. He looked stressed and lost.</p><br/><p>When he saw me, he quickly made a hand gesture indicating for me to hurry; as if something had happened.</p><br/><p>“What is it?” I asked as I ran towards him. When I got to the door, I held my breath and understood why my hot bodyguard was so alarmed.</p><br/><p>The door of my apartment was opened. My quilt, pillow, clothes, books, computers… everything had been taken away!</p><br/><p>“What? A thief came in? I just went to eat a bowl of noodles….” I entered the apartment absentmindedly as I subconsciously tried to search for my phone to call the police. Then, I noticed a note on the table.</p><br/><p>Your things are on the 27th floor -Shen Shaoqian.</p><br/><p>I angrily slammed the table as I ran straight upstairs to argue with him.</p><br/><p>The elevator door happened to be open as people were returning home from work.</p><br/><p>When I got off, I saw Shen Shaoqian in the corridors of the 27th floor.</p><br/><p>I stormed up to him and interrogated him. “Was it you who took everything from my apartment? What makes you think you have the right to touch and remove my things? Do you know that your behaviour is against the law? How did you get in anyway? I am positive I had locked the doors…”</p><br/><p>“Because this entire building belongs to me. But that’s not the point. The point is, I have solved your problem. This is your temporary home.” Shen Shaoqian made a hand gesture, “While your apartment is under renovations, you can live here for free. Also, this place is several times bigger than your current apartment!”</p><br/><p>He said this entire building is his? Does he have a delusional disorder?</p><br/><p>How can I believe a man that was wearing rubber gloves <i>fixing someone else’s toilet </i>is the owner of an expensive building?</p><br/><p>The only way I could believe it was if that image disappeared from my mind. But I guess if I focused purely on his looks, it was slightly believable.</p><br/><p>My eyes followed the direction of his hands. Although Shen Shaoqian’s solution wasn’t money, this apartment was definitely much bigger than my own.</p><br/><p>Although we were in the same building, the layout was very different!</p><br/><p>I wasn’t going to contemplate how he did it. I was quite satisfied by this new apartment.</p><br/><p>“So I can temporarily stay here?”</p><br/><p>“Yup! You can stay here until the renovations are completed. In addition, to compensate your wounded spirit, I also have a free unexpected surprise for you!” Shen Shaoqian beamed as he pulled my sleeves and led me to the apartment.</p><br/><p>140 square metres! One of its bedrooms was already many times better than my shitty 40 square metres apartment. Although it was temporary, my heart was still beating with excitement.</p><br/><p>“Well, it’s not like I have anywhere to go. So I guess I will temporarily stay here….” I pretended to act cold as I rushed Shen Shaoqian out. “You’re done moving all my stuff, right? So…you’re leaving now?”</p><br/><p>“Leaving! Yes, I’m leaving! Haha.. enjoy your rest. If you have any questions, here’s my number.” Shen Shaoqian handed me his business card.</p><br/><p>Before he walked out the door, he gave me a very strange smile. But I wasn’t in the mood to bother with that. I tightly shut the door and happily squealed!</p><br/><p>“Big apartment! Big apartment! Woo hoo! Big apartment!” I jumped onto the sofa as I sharply shrieked.</p><br/><p>*sings song* I bounced on the soft sofa. Currently, describing my mood as ‘cheerful’ was an understatement.</p><br/><p>I leaped into the air and twirled. As I was in the air, I noticed someone was wearing a pair of grey pyjamas as he held onto his shoulder and watched me from a crooked angle.</p><br/><p>It was Suyang.</p><br/><p>I immediately froze.</p><br/><p>“EH?” I was stunned to see Suyang. Instead of landing steadily on the sofa, I stepped on the edge and fell flat onto the ground.</p><br/><p>*This is the song that she was singing* LOL I found this video on youtube. She was probably dancing like that too!</p><hr/><br/>\n</div>"}