{"title": "Chapter 4", "id": 4, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-4", "volume_title": "Volume 1", "body": "<h1>Chapter 4</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 4: Shen Shaoqian and Suyang </b></p><br/><p>“Ah!” I yelled out as I awoke from my dreams.</p><br/><p>I wiped the sweats off my forehead as I placed my left hand on my chest and attempted to calm my beating heart down.</p><br/><p>I sat up and released all my thoughts in one breath, “Whew…it was a dream it was a dream..haha I can’t believe I dreamt that my ceiling was leaking and then I went to find my upstairs neighbour to discuss but due to bad luck I ended up being part of a crime scene and became a witness and the killer was going to kill me but the moment I was about to die those guys told me they were roleplaying ahahahahahahah what a ridiculous story something like this would never happen ahaha turns out it was a dream….”</p><br/><p>By now, I was almost out of breath.</p><br/><p>“Are you done talking?” A cold voice cut me off.</p><br/><p>Since it was a voice I didn’t recognized, I immediately became alert and realized I was lying on top of the blanket on the ground.</p><br/><p>This wasn’t my apartment. It looked like the apartment that was covered with water…</p><br/><p>But the water was gone. The furnitures were gone too. Actually, aside from the blanket underneath me, there were no items left in the room.</p><br/><p>“Huh? What happened?” I clasped the blanket as I looked around my surroundings. In the end, my gaze landed on an attractive man that was leaning against the wall on my right side. He was sizing me up. I instantly turned red, “You are…”</p><br/><p>The moment I spoke, the gorgeous man made a humph sound and titled his head, “You slept too much and became a fool? Or did you lose your memory from shock? You are such a dull woman.”</p><br/><p>He sure was handsome, but too bad his mouth was vile.</p><br/><p>I wasn’t going to settle for that type of attitude, so I stood up. But my head was still spinning.</p><br/><p>After a few seconds later, I took huge strides towards the man.</p><br/><p>Although I was half his size, my attitude was comparable to his. I lifted my chin and glared at him, “A fool? Excuse me. This is the first time we’ve met. How can you be so rude? What happened to those two uncles? I don’t want to talk to you. Go get them. I have stuff to say to them.”</p><br/><p>“What uncles?” The handsome man slightly frowned. He appeared to be confused.</p><br/><p>“Earlier, there were two uncles with mustaches all over their face. You should know them, right? Get them for me.”</p><br/><p>“You don’t remember us?” Another unfamiliar voice spoke up. I immediately turned towards the source. It was another hot guy. His smiling face peeked out from the washroom.</p><br/><p>What was going on? The two uncles disappeared, and now there were two good looking men here?</p><br/><p>My mind was utterly confused, “What are you saying….?”</p><br/><p>“We just washed our faces and you can’t recognize us? Suyang, we must have looked very sloppy!” The man in the washroom started to chuckle.</p><br/><p>Something clicked and I pointed my finger at the Suyang guy closest to me. I couldn’t hide my shock as I exclaimed, “You two were the two uncles from before?”</p><br/><p>Unexpectedly, Suyang quickly enclosed his hand around my finger. His face remained icy. “Bingo. But when you’re speaking, don’t point. It’s rude.”</p><br/><p>“O-ok. I understand. Let go.” I forcefully pulled my finger from his grasp.</p><br/><p>My finger was warm now. My fingertip actually felt a bit numb.</p><br/><p><i>You shouldn’t touch a young lady so casually, ok?</i></p><br/><p>The man from the washroom came out as well. As he walked over, he was trying to forcefully remove his rubber glove.</p><br/><p>It took him a lot of effort before he managed to pull one off, and he reached out to shake my hand, “Hi. My name is Shen Shaoqian. We scared you today, didn’t we?”</p><br/><p>I stared at his hand as I hesitantly decided whether I should shake it or not. He had just came out of the washroom with rubber gloves on. Who knows where his hands had reached?</p><br/><p>But he was sending me a bright smile, so I couldn’t bear to reject. I summoned up the courage and touched his hand, “I’m not good.”</p><br/><p>“All the furnitures have been damaged by the water. So we called the moving company to help us remove it. There was so much noise and commotion, yet you still managed to sleep through it. I’m impressed! I was wondering if you were sleeping or fainted from fright.” Shen Shaoqian stated very cheerfully.</p><br/><p>His cheerfulness seemed a bit abnormal to me. Why didn’t they fix the water pipe if it was damaged? Their furnitures were damaged and they act like it didn’t matter? They had nothing left in the apartment yet he was still cheerful?</p><br/><p>My mind was filled with questions I wanted to ask. But right now, the most important one was –</p><br/><p>“You two are honestly the two men from before?”</p><br/><p>“Of course! Replacement guaranteed if fake! Did we turn too handsome that you cannot recognize? As I mentioned previously, my name is Shen Shaoqian. The guy over there with the poker face is Suyang. He is the owner of this apartment.” Then, Shen Shaoqian patted Suyang’s back with the hand that still had the rubber glove on. Instantaneously, Suyang’s poker face became the disgusted face.</p><br/><p>“You just reached your hands down the sewers. Don’t touch me!” Suyang sternly warned Shen Shaoqian.</p><br/><p>“I was wearing gloves, you punk! How dare you give me such a disgusted expression? You’re the one that pledge your life you wouldn’t do this type of work, so I had no choice but to help you. I worked so hard and you don’t even know how to be grateful. You’re just standing there like it’s none of your business. Have you no shame?”</p><br/><p>“Hey, I’m giving you an opportunity to workout. As a good friend, I want you to maintain a healthy physique at all times.” When Suyang spoke, I didn’t feel any emotions. He wasn’t convincing at all.</p><br/><p>“Excuse me! Who is the more healthier person out of us two? I workout everyday! Whereas, you just stay home all day…”</p><br/><p>The two wouldn’t stop bickering while I was silently observing. Honestly, what happened while I was asleep? How could those two gruffy uncles transformed into these two attractive young men?</p><br/><p>“Are you done staring?” Perhaps my stare was too intense, Suyang gave up his tongue battle with Shen Shaoqian and casted a glance at me.</p><br/><p>“No…” I subconsciously replied. When I snapped out of it, Shen Shaoqian and Suyang were giving me the “WHAT” expression.</p><br/><p>It was so awkward, I didn’t know where to look. In order to dissolve the bizarre atmosphere, I lightly coughed twice, *cough cough*….oh yeah, the water from your apartment has damaged my ceiling. It is now dripping water.”</p><br/><p>I was finally back on track.</p><br/><p>“So what’s next?” Suyang asked.</p><br/><p>I blinked. What kind of human being is this Suyang person? How could he still remain so calm and confident when he had caused damage to his downstairs neighbour? He looked like he didn’t give a damn.</p><br/><p>At least, give me a line of apology? ….. Ugh. Whatever. It wasn’t like I came here to hear an apology. I want to solve the issue!</p><br/><p>Of course, using money!</p><br/><p>I suppressed my explosive emotions and calmly stated, “And then, I came over to find you guys. Who would have thought you two would be playing some f**kup roleplay? And forcefully included me as well! I actually thought it was real. I even reminisced all my experiences and sorrows from my 25 years… all….”</p><br/><p>“Didn’t you say you had nothing in these 25 years? Why are you going through your memories then?” Suyang gave me a look of disdain and cut me off.</p><br/><p>“You!”</p><br/><p>I wanted to storm and punch Suyang’s handsome face twice, but Shen Shaoqian held me back. “Calm down! Calm down! He’s like that. He has a repulsive mouth. Don’t lower yourself to his level!”</p><br/>\n</div>"}