{"title": "Chapter 2", "id": 2, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-2", "volume_title": "Volume 1", "body": "<h1>Chapter 2</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 2: I’m going to be a victim of homicide</b></p><br/><p>“Bang! Bang! Bang!” I pounded on the door like I was going to break in. I wasn’t in the mood to knock nicely. Enough is enough. Maybe an uncle can hold it in, but this aunty cannot. “Open up! Hurry and open your door!”</p><br/><p>After knocking for awhile with no response, I increased my strength. “Hey! I’m from downstairs. Do you have a swimming pool in your apartment? My ceiling is damaged and submerged because of you!? Hurry up and open the door. We need to talk!”</p><br/><p>There was still no activity coming from within. It didn’t seem right. I wondered if something happened inside. So I quietly plastered my face against the door.</p><br/><p>At this moment, the door suddenly opened. I was caught off guard as I staggered to catch myself. I nearly fell head first into the room. The man who opened the door was an uncle with a face full of beard. He unleashed an aura of death as he glared at me. Having shivers down my spine would be an understatement.</p><br/><p>He reminded me of a psycho of a show I enjoyed to watch. It was a psychological criminal type of shows, and the character was a homicidal maniac that had a mental disorder.</p><br/><p>Before I could open my mouth, he lifted me like a little chick and effortlessly flung me into the room.</p><br/><p>“Hey! Hey! What are you doing?!” I acted like an arrogant bully. But deep down, I was already calling for my mommy.</p><br/><p>The moment I set my foot inside, the water level was already at my ankle. When I stared around the room, I realized the entire 2705 room was filled with water. No wonder the water was soaking into my ceiling!</p><br/><p>“Excuse me, Uncle. But are you really trying to create a swimming pool? If your water pipe is broken, then repair it! Your entire apartment is filled with water!! …..wait. No. Do you realize the water from your apartment is soaking into my ceiling?! Soon, the water is going to cave into my apartment!”</p><br/><p>As I complained, I walked further into the room. Suddenly, the extremity of my foot kicked something soft.</p><br/><p>The window curtains were tightly shut, so there wasn’t any light in the apartment room at all. Since it was so dark, it was naturally very difficult to see. There was also a moldy smell emitting through the air.</p><br/><p>My entire body froze. Then, I slightly took a step back as I gulped down my saliva and anxiously looked down. I wanted to see the object that I had just kicked.</p><br/><p>It was a person. A person that didn’t move at all. He was lying in the water.</p><br/><p>I was not stupid enough to assume he was willingly lying there… I heard the steps coming closer and closer towards me. Both my hands were clenched into fists and my heart beat was gradually increasing. I wanted to run, but within three steps, something assailed my nostrils and my attempt to cry for help was caught in my throat. My consciousness was slipping and I was getting more and more dizzy.</p><br/><p>Ah… it turns out I am the fool who would recklessly go towards the mountain while knowing it has tigers…</p><br/><p>“Mmm….mmmm…..”</p><br/><p>Fighting was no use. My eyelids became heavier and heavier. Finally, I lost consciousness.</p><br/><p>—–</p><br/><p>By the time I woke up, my hands and feet were tightly tied up around a chair. I couldn’t make a single move.</p><br/><p><i>Wow. I’m so unlucky. I’m actually so unlucky that I’m going to be a victim of homicide</i>.</p><br/><p>I was still feeling the drug effects, so I was very groggy. The killer uncle was sitting across from me; motionless.</p><br/><p>We were staring at each other. After being in silence for two minutes, he finally couldn’t take it anymore and spoke up in his raspy voice. “Do you know why I’m treating you like this?”</p><br/><p>I calmly nodded my head. After pondering about my life for the past two minutes, I realized throughout my 25 years, my life was meaningless aside from being able to communicate with ghosts. <i>Wow. I was always encountering ghosts. Now, I’m going to become one too. </i></p><br/><p>Then, I thought about it a bit more. My life was so meaningless that there wasn’t much difference between being dead or alive.</p><br/><p><i>Wait, that’s not true! Maybe I’ll be like the mistress hanging by my window! I’ll probably be floating around. Would I still possess this supernatural power? I definitely wouldn’t have to worry about finding work. I wouldn’t have to worry about money either. Honestly, to me, there wouldn’t be substantial changes I would have to adapt to.</i></p><br/><p>Thinking of this, I immediately felt a lot more optimistic. I gave the uncle a brilliant smile.</p><br/><p>I couldn’t guarantee my smile was “brilliant” under the uncle’s eyes; as I haven’t smiled for a very long time. But the uncle gave me a look as if he had stepped in shit. I guess it wasn’t as brilliant as I thought.</p><br/><p>Aii, he was deeply affecting the self-esteem of a person who was preparing for death.</p><br/><p>“You know you’re going to die soon, right?” The uncle was probably reminding me because he thought I didn’t understand my situation.</p><br/><p>“I know. You want to kill me to silence me. I totally understand.” I composedly replied. “I have a small request. I hope you will agree to it.”</p><br/><p>“What is your request?”</p><br/><p>“I am extremely afraid of pain. Could you make it quick?”</p><br/><p>The uncle stood up as he roughly pinched my chin. “Those are your last words?”</p><br/><p>It appeared he wasn’t satisfied by my fast acceptance of being killed.</p><br/><p>I solemnly nodded. “Please and thank you.”</p><br/><p>“You don’t have anything else you want to say? No reflection? Mood? No views you want to express?” The uncle’s words reminded me of my University professor who prompted me with my paper…mood? Views? Who gives a shit when they’re about to die?</p><br/><p>“Alright. Since you’re not in a rush, unhand me first. I do have a request.” After hearing my words, the uncle untied my hands.</p><br/><p>I wasn’t sure if it would hurt his feelings, but I had the mindset of a dying person, so I had to say it, “Umm.. could you move further away from me? Your body odour…is a bit..strong..”</p><br/><p>“What?” The uncle was stunned. I guess my words did hurt him. Honestly, that wasn’t my intention. I was already trying to be discreet.</p><br/><p>Suddenly, he reached out and grabbed my hair. He pulled it so hard that my scalp hurt as he leaned his filthy face over. “Is this rubbish all you want to say? Young lady, when you turn into a lonely ghost, don’t come find me. If you want to blame someone, just blame yourself for your bad luck. Who told you to ring the…”</p><br/><p>I crinkled my brows. I really couldn’t take his gibberish, so I cut him off. “Uncle, could you stop with the bullshit? If you want to kill me, then just kill me. You talk too much garbage. If I was a person determined to live or run, you would be screwed! Haven’t you seen it on TV or movies? Whenever the bad guys are talking too much, the main character will find a way to KO them!”</p><br/>\n</div>"}