{"title": "Chapter 17", "id": 17, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-17", "volume_title": "Volume 1", "body": "<h1>Chapter 17</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 17: I know who the killer is</b></p><br/><p>“I have already told you the reason. Go figure out the rest on your own! Also, if you have any other troubling issues in the future, you can always come find me. This place is rather quiet. Not many people come here and I’m really bored….”</p><br/><p>I looked around my surroundings and my mouth twitched. Deep down, I thought to myself, “Why would anyone want to come here? If they come, they would probably be like me or even weirder.”</p><br/><p>But I was still thankful for Grandmother Meng’s help. At least now I have a general idea of what to do.</p><br/><p>“Thank you!” I gave Grandmother Meng a deep bow and then quickly left. I didn’t want to come back to such an eerie place ever again.</p><br/><p>The moment the elevator door opened on the first floor, Huang Zhiwen was standing in front of me.</p><br/><p>How did he know where I was?</p><br/><p>But since he came to find me, it meant he had already made up his mind.</p><br/><p>It was an unnecessary step, but I decided to ask anyway, “Have you decided to unite with me?”</p><br/><p>Huang Zhiwen nodded and floated in front of me.</p><br/><p>I steadily followed behind him. My intuition was telling me that he was going to lead me to the killer.</p><br/><p>Initially, I thought he was going to lead me back to that smelly and dirty alley with garbage piling up like a village deep in the mountains. Surprisingly, after walking for a long time, our destination was poles apart from what I had imagined it to be.</p><br/><p>It was Spring and its prime blooming time. I didn’t know the breeds nor the names. However, there were all sorts of flowers along the paths, alleys, and the parks. They were all trying very hard to stand out amongst each other during their short seasonal lives.</p><br/><p>There was a college nearby and many couples would often be enticed to come over for pictures. To the left and right were peach blossom trees. When the wind blows, the petals would gently fall down onto the pedestrians’ back.</p><br/><p>Huang Zhiwen was pointing at a direction. I followed his finger and noticed there was a college flower shop in the middle of the peach blossom path.</p><br/><p>Every single person who came out of that shop was holding onto a bundle of flowers. Their faces were beaming with joy and all of them had satisfied smiles on their faces. Were they going to declare their love? Or were they the receivers? I honestly couldn’t see the connection between this sweet elegant place and the homicidal maniac.</p><br/><p>“Are you positive he’s here?” I frowned as I doubtfully asked Huang Zhiwen.</p><br/><p>He nodded with confidence.</p><br/><p>A smiling middle aged man came out of the flower shop with a flower pot. The moment Huang Zhiwen saw him, he instantly turned around and hid behind something.</p><br/><p>I also went to hide along with Huang Zhiwen as I racked my brain and observed the boss of the store. From the horrified expression on Huang Zhiwen’s face, I was 80-90% sure that he was the killer. But no matter what, I couldn’t connect this guy with the evil and vicious homicidal maniac who tried to kill me.</p><br/><p>In order to confirm, I turned to Sheyu, “Is it really him?”</p><br/><p>Sheyu also nodded and my scale swayed.</p><br/><p>I couldn’t help but create a profile in my mind: <i>This is the disguise of the homicidal maniac. His disguise is an ordinary middle aged man. He uses his bloody hands to gently caress flowers. The flower is a symbol for happiness. Beneath his kind smile, he is actively using his merciless eyes to locate his next victim. In order to satisfy his desire, his true self will be revealed in the dark alley when he becomes the killer who finds joy in massacring others. </i></p><br/><p>Thinking of this, I couldn’t help but sweat profusely.</p><br/><p>What am I supposed to do? Although I had managed to find the homicidal maniac with my method, I could not call the cops to capture him because I have no presentable evidence! Do I seriously have to wait until he commits another crime to seize him?</p><br/><p>Deep down, I knew I must not be rash. If by chance the boss escaped because he figured out I knew he was the killer, Sheyu, Huang Zhiwen, and all the other dead victims from before will never forgive me.</p><br/><p>After hesitating over and over again, I turned away from the flower shop and walked the opposite direction.</p><br/><p>For the time being, I must think twice before I act.</p><br/><p>Suddenly, I heard the sound of a vehicle stepping on its emergency brake. My childhood memory of the car accident immediately popped up in front of me and made me feel very uneasy.</p><br/><p>After I snapped out of it, I noticed a car had stopped on my right side of the street. The car window rolled down and revealed Suyang as the driver.</p><br/><p>I recalled our unpleasant interaction from this morning and waited for him to speak first.</p><br/><p>Suyang’s first line was, “You’re going the wrong way.”</p><br/><p>“I can go whichever way I want. I’m not a car.” I rolled my eyes at him as I conveniently swept my eyes across his car.</p><br/><p>Ohhh, a luxury car!</p><br/><p>“What are you doing here?”</p><br/><p>“I am an unemployed person. I’m just strolling around. What about you, huh? Aren’t you an author? Shouldn’t you be at home writing a novel?” As I retorted, my eyes landed on his front passenger seat and I directly entered his car.</p><br/><p>Sheyu and Huang Zhiwen also followed along. They obediently sat behind me.</p><br/><p>“Who told you to get on?” Suyang glared at me. His entire body language was telling me to…. Get. Off.</p><br/><p>I pretended not to notice as I put on my seatbelt. I had thick skin, “If you didn’t want me to get on, then why did you stop your car in front of me? Since I’m already on, you might as well take me along.”</p><br/><p>“Uggh. Forget it. I’m going home anyway. It’s on the way home.” Suyang gave up as he started the engine.</p><br/><p>“I’m not going home! I want to go to the Police Station! Please!” I clasped my hand together as I smiled and begged.</p><br/><p>“Get off!” Suyang was trying to kick me off again. I guess my brilliant cute smile didn’t manage to work on him. “The Police Station is located on the opposite direction. If you want to go, take a taxi yourself!”</p><br/><p>“I am giving you a great opportunity right now! Don’t you want to write speculative novels? Don’t you want to get into the psychological minds of criminals? The Police Station is a perfect place for you to learn. You need to cherish your opportunities. Not everyone can casually enter and exit the Police Station, you know?” I teased my hair as I proudly stated.</p><br/><p>“You and your twisted words and forced logic.” Suyang’s car was still heading towards the direction of the apartment.</p><br/><p>“No, think about it! You and Shen Shaoqian were cosplaying because you wanted to truly experience the roles in order for a more realistic effect, right? If you bring me to the Police Station, you can personally witness all the different types of roles they have from within. It will definitely help you with your writing. Plus….”</p><br/><p>Suyang seemed to be slightly affected by my flowery speech. “You’ve almost convinced me. Keep going.”</p><br/><p><i>Yessir! </i></p><br/><p>I turned to salute at Suyang as I continued, “This morning, I told you I was going to capture the homicidal maniac, right? He should be captured in the next few days. Trust me. If you bring me to the Police Station, I will convince the other Police Officers to let you personally interview him after he is seized. That way, you can ask him about his dark and twisted world one on one. Wouldn’t that be great source material for you?!”</p><br/><p>There happened to be an intersection in front of us, and Suyang suddenly made a dramatic turn at the lights as he headed towards the opposite direction. We were heading towards the Police Station!</p><br/><p>Currently, Suyang still had a frozen expression on his face. “Congratulations, you have convinced me.”</p><br/><p>“YES! YES!”</p><br/><p>My heart was shrieking from excitement. I was proud of my silver tongue. But for a simple ride, wasn’t this a big price to pay?</p><br/><p>“Don’t be so stimulated because I have agreed. I just want to carry on the tradition and virtue of Greater China -protect the animals. You’re merely a goldfish!” Suyang calmly stated.</p><br/><p>“Pssssh! I’m fine with being a goldfish! Goldfishes are super cute. Their eyes are so big! Don’t you know?” I rolled my eyes at him as I rebutted.</p><br/><p>“I know, goldfishes are really cute.”</p><br/><p>Suyang carelessly slipped a line, but it really touched me. My finger lingered on the tip of my curled hair as I attentively gazed at Suyang’s side face. Suddenly, I realized he was actually quite adorable.</p><br/><p>“A goldfish only has a memory of seven seconds. I guess it would be ranked as mentally disabled.”</p><br/><p>“You! Annoying goblin!” I shouted. I should have known he would have something else to say.</p><br/><p>“Nowadays, the cops don’t just listen and obey. Even if I request, they may not let you see the criminal face to face…” I growled. I wanted to get revenge for the goldfishes.</p><br/><p>After our mouth battle, Suyang and I were very quiet. It was too boring. I couldn’t help but start a new topic, “Don’t you think it’s tiring for a person to act like an angel when in reality he’s actually a shady devil?”</p><br/><p>“A lot of people are like that. Who are you talking about?”</p><br/><p>“A lot of people are like that?”</p><br/><p>“Regardless of who you are, we all have a different side to us. For example, the way you act towards your parents and teachers would be different. The way you interact with your friends and lover would be different. Perhaps I didn’t have the intentions, but I felt like I had to do it. Or maybe, I wanted to do it but I felt like something was stopping me from acting. Humans tend to contradict themselves. Only when they are alone, are they truly themselves.”</p><br/><p>Wow, an author was truly an author. His words were so deep. I had difficulties understanding him.</p><br/><p>“Can you simplify what you’re saying?”</p><br/><p>“For example. When you first met us, didn’t you assume Shen Shaoqian was a criminal?”</p><br/><p>Now that Suyang mentioned it, I thought about my first impression of Shen Shaoqian.</p><br/><p>True. If I randomly came across him on the streets, I definitely wouldn’t be able to associate the Uncle version of Shen Shaoqian with the hot version of Shen Shaoqian. They completely contradicted each other, even though they were both Shen Shaoqian.</p><br/><p>Seeing how I had lowered my head without a word, Suyang continued, “Shaoqian is not a criminal. He had never even purposely stepped on an ant. But he was able to convince you that he was a vicious criminal. Do you see what I mean?”</p><br/><p>“So basically, you may know a person but you don’t know his true nature? Sometimes, we could be wrong, because what we see was a disguise the entire time….” I pondered on this thought as I thought of a plan. I turned to Suyan and exclaimed, “I don’t want to go to the Police Station anymore. Take me to the hospital!”</p><br/><p>“You want to go to the hospital again?”</p><br/><p>“You’ll find out when we get there! Hurry! Turn around!” I urged Suyang as I touched his arm.</p><br/><p>“Do you seriously think I’m your driver….?” Suyang muttered resentfully, but still altered his path to take me to the hospital.</p><br/>\n</div>"}