{"title": "Chapter 13", "id": 13, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-13", "volume_title": "Volume 1", "body": "<h1>Chapter 13</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 13: Who were you talking to?</b></p><br/><p>“If I committed murder, do you think I would return home so calmly? You think I would come back and wait for the cops to catch me?”</p><br/><p>Suyang’s reaction surprised me. I didn’t expect him to be so calm seeing me all bloody like this. In comparison to the taxi driver, whose soul had nearly left his body, Suyang was clearly abnormal.</p><br/><p>He wasn’t human.</p><br/><p>“Psssh.. With your slow personality? You were probably fighting someone randomly on the streets and got stabbed?” Suyang rubbed his chin with his right hand as he made a guess.</p><br/><p><i>He has a personality issue and he dares to say I do?! </i></p><br/><p>I coldly snorted, “I don’t have the vitality of a cockroach. If I had been stabbed, do you think I would be able to stand in front of you right now? Don’t worry. I didn’t stab anyone and no one stabbed me. But a police officer saved me, and now she is in the ICU…”</p><br/><p>I took a bottle of water from the fridge and planned to return to my bedroom.</p><br/><p>Before I went inside, I purposely glared and warned Suyang. “I have something really important to do. Don’t come bother me. It’s late, so go back to your room and sleep!”</p><br/><p>When I walked inside my room, Sheyu was hanging upside down by the window next to the mistress. I quickly closed the curtains and said, “Don’t follow bad examples. That is her hobby.”</p><br/><p>I sat down on the bed and gestured Sheyu to come over.</p><br/><p>“Today, if it weren’t for you, I probably, no, I would have been dead for sure.” I wanted to grab onto Sheyu’s hand, but all I was able to do was grab onto air.</p><br/><p>I forced a smile on my face as I tried to comfort Sheyu, “Based on my intuitions, you are not dead. It’s just that your spirit has temporarily left your body. Have you seen it on television? The spirit separated from the physical body?! That’s you right now… aiya, honestly I don’t know too much. Basically, you still have a chance to survive, so don’t give up!”</p><br/><p>I jabbered on and on. Sheyu’s face remained emotionless. Suddenly, my bedroom door cracked open. Suyang was leaning by the door and surveying my room with an alert expression. He was baffled, “Who are you talking to?!”</p><br/><p>“Who let you in?” I retorted, “Didn’t I say not to bother me?”</p><br/><p>Suyang had thick skin as he fully returned my critical look. “I didn’t come in. Can’t you see I’m standing outside?”</p><br/><p>“What do you want? If you have something to say, say it all now. I’m very busy.”</p><br/><p>Suyang raised his hand and knocked on my door twice.</p><br/><p>“What’s that supposed to mean?”</p><br/><p>“Let me come in.”</p><br/><p>“The door is already opened. Just come in yourself. What?! Do you need me to carry you?”</p><br/><p>Suyang ignored the fact that I was pissed. He knocked twice again. “Say you’ll let me come in.”</p><br/><p>I realized something as I curved into a smile, “Suyang, if I do not say come in, does it mean you won’t come in?”</p><br/><p>Suyang was caught off guard. Although it only lasted for a second, I caught it with my quick eye.</p><br/><p><i>Oh!! So turns out Suyang does have a weakness. If I do not say he can enter, he wouldn’t come into my personal space. </i></p><br/><p>That was my assumption.</p><br/><p>“Who are you talking to? The contract clearly stated that if you want to bring friends over, Party B, which is me, must approve…”</p><br/><p>Suyang pointed to himself as he continued to look around my room.</p><br/><p>“Friend? Do you see anyone else in here?” I waved my hand and strongly rebutted.</p><br/><p>“I need to enter in order to confirm. Let me come in.” He grumbled.</p><br/><p><i>Am I dreaming? The almighty Suyang was cutely throwing a tantrum? </i></p><br/><p>“The door is opened. No one is blocking you.” I refused to say the two words Suyang wanted to desperately hear. I want to drive him nuts! Drive him insane!</p><br/><p>Suyang placed his hands on his waist, “You’re doing this on purpose, aren’t you?!”</p><br/><p>I pretended to be innocent as I batted my eyes, “I don’t understand what you’re talking about. But if you don’t take action soon, I’m going to shut the door and continue talking to myself!”</p><br/><p>Suyang was so furious that his face was turning red and green. I was starting to worry that he will kick me out at this point. I better quit while I’m ahead.</p><br/><p>“Please enter.”</p><br/><p>To Suyang, those two words were like the opening gunshot that allowed athletes to begin the race. Suyang immediately entered my room. “If I find someone here, you’re dead!”</p><br/><p>“Feel free to look around, but if you can’t find anything, I am not going to willingly allow you accuse me!” I knew he wouldn’t be able to see Sheyu, so there was nothing I had to be afraid of.</p><br/><p>As expected, Suyang couldn’t see or sense Sheyu even though she was in front of him. He directly passed by her.</p><br/><p>“I swear I heard you talking to someone….” Suyang muttered under his breath as he began to flip through my wardrobe. He even cautiously explored underneath my bed.</p><br/><p>“Wow, you went as far as eavesdropping outside my door? You have no class!” I rolled my eyes at him as I watched him try to drill himself underneath my bed.</p><br/><p>I turned away and decided to ignore him as I took my bloody top off and looked for a clean top to wear.</p><br/><p>Suyang got up from the ground and noticed I only had a tank top on. Right away, he covered his eyes and turned around as he stuttered nervously, “Y-you….why did you take off your clothes? Are you crazy?”</p><br/><p>“My clothes are covered in blood, of course I have to change! What do you expect? You want me to wear this to celebrate the New Years*?”</p><br/><p>Suyang’s extreme reaction was quite interesting to me.</p><br/><p>He was ….so….pure?</p><br/><p>Suyang was speechless.</p><br/><p>After being silent for a moment, he pointed towards me as he hotly stated, “In the contract, it states that you must not expose yourself in a public space. Did you forget? You want to go against the contract?”</p><br/><p>“Bro. Is this a public place? This is my bedroom! And I’m not naked. Can’t you see this tank top?!” I smacked Suyang on the back.</p><br/><p>Surprisingly, Suyang jumped as if I had stabbed him with needles. He closed his eyes and hopped off my bed as he ran out. Before he closed the door, he also crashed against the wall.</p><br/><p>“I can’t believe you would take off your top in front of a man. You pervert!” Suyang yelled from the other side of the door.</p><br/><p>“You!” I violently pulled my door open as I glared at Suyang. I crossed my arms and held it at the bottom of my tank top; pretending to pull it up.</p><br/><p>As expected, Suyang couldn’t handle it. He instantaneously bolted back into his room.</p><br/><p><i>Psssh, you want to fight me? </i></p><br/><p>I slapped my hands and grinned victoriously. I turned around and closed the door as I gave Sheyu a victory sign. “I found the annoying goblin’s weakness.”</p><br/><p>Now that I got rid of Suyang, I continued our previous discussion. But we couldn’t come up with a solution. So I turned on my laptop as I researched about spirits that have left the bodies.</p><br/><p>Sadly, most of the results were useless. The more I searched, the more hopeless I felt. I had the mindset of barking up to any tree possible in my desperation, and left a question on a forum roughly seeking for advice on how to return a spirit back into the body.</p><br/><p>After waiting for many hours, someone finally responded, but he was mocking me…</p><br/><p>A few moments later was another response. But it was either a sarcastic comment or some weird advertisements. I felt like my method had failed. As I pondered deeply once again, I suddenly thought of something. I excitedly slammed my hand down, “Sheyu, let’s return back to the hospital!” Then, I put on my jacket as I was about to leave the room.</p><br/><p>“I have seen it on TV before. Since your spirit exited through your body, why can’t it enter it again? Scientifically, your physical body is still living. You should be able to return…. Regardless of the result, we must go back to the hospital and attempt!”</p><br/><p>I was anxious and eager at the same time as I tried to open the door.</p><br/><p>“Huh? Strange… how come I can’t open the door?”</p><br/><p>I increased my strength and twisted the knob left to right, but it wouldn’t budge at all. I swear, it was fine earlier when I was teasing Suyang…</p><br/><p>I came to a realization as I banged the door and shouted, “Suyang! What the hell are you doing?!”</p><br/><p>No response.</p><br/><p>“Suyang! I know you did something to my door! You better let me out! I have something urgent I have to do!” I didn’t understand why he was locking me in.</p><br/><p>A few moments later, a note entered through my door crack.</p><br/><p>It said: “Considering what you went through today, I am not going to investigate your abnormal behaviour and punish you for violating the contract. As a kind-hearted roommate, I have decided to let you rest well to show my considerate side.”</p><br/><p>*In the Chinese culture, it is common to wear red to celebrate the New Year. Red is considered a lucky colour.</p><br/>\n</div>"}