{"title": "Chapter 14", "id": 14, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-14", "volume_title": "Volume 1", "body": "<h1>Chapter 14</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 14: I’m going to capture the bad guy </b></p><br/><p>Oh God! Do all authors have such bizarre mindset? What kind of logic was that? Did he injure his head when he crashed against the wall?</p><br/><p>“Bro…I honestly have something urgent to do. Open up!” I continued knocking furiously. But there was no response. Ultimately, I gave up.</p><br/><p>“You annoying goblin!” I screamed at the door.</p><br/><p>I hopelessly turned around and faced Sheyu, “I don’t think we can go out today.”</p><br/><p>Sheyu heard what I said, and then in front of my face, she went through the walls and came back, through the walls and came back, through the walls and came back</p><br/><p>…….</p><br/><p><i>Woman, you can go through walls but I can’t! </i>I thought to myself.</p><br/><p>But on the outside, I was clapping as I said in a saucy tone, “Wow! Going through wall technique! So amazing…are you trying to tease me?”</p><br/><p>She seemed to sense my sarcastic attitude and left me alone as she crouched down at the corner to play with my ghost cat.</p><br/><p>Strictly speaking, Sheyu was still a human since her body was still living. So this was the first time someone willingly stayed overnight with me.</p><br/><p>Could this be the legendary bestie night?</p><br/><p>Thinking of this, I felt unusually happy. From time to time, I would glance at Sheyu. She was still playing with Tom.</p><br/><p>Wasn’t she my ideal type of friend? Pretty, honest, and brave! Most importantly, she accepted me for who I am!</p><br/><p>I didn’t know if she was willing, but I had already secretly considered her as my bestie.</p><br/><p>In actuality, I wasn’t sure what the definition of a bestie was, but Sheyu was my definition now.</p><br/><p>Ughh… I shouldn’t be thinking of this right now. Even though we can’t leave the room, I must get to work. I must catch the crazy psycho!</p><br/><p>Especially since I have an advantage that no one else has. I have the ability to see the two ghosts that are following him. That means, I can pinpoint the killer’s position.</p><br/><p>But the question is, how am I going to find the two ghosts again?</p><br/><p>I began to search the web for the latest news on the killer. I can’t believe someone could be so evil. Since last February until now, the police department had investigated nine other similar cases. He is the main suspect, but so far, he hasn’t been caught.</p><br/><p>Nine cases, seven dead, and two were in a coma.</p><br/><p>Two were in a coma?</p><br/><p>Maybe that would be the key to locating the killer. Thanks to the quick web, I was able to find the pictures of the two living victims in less than two minutes.</p><br/><p>“What?!” I stared at my monitor screen in astonishment. Those two were the ghosts that were following the killer!</p><br/><p>Oh, so turns out they weren’t dead. So were their situations similar to Sheyu’s?</p><br/><p>Coincidentally, they’re also staying in the same hospital as Sheyu’s. I finally saw a glimmer of hope.</p><br/><p>I received a reminder from the forum: You have received a response.</p><br/><p>Another response from the web? I was no longer hopeful. However, due to my OCD, I had to click onto the red dot since its existence bothered me a lot. I carelessly glanced at the response. The replier asked, “What type of experience led to this out-of-body case?”</p><br/><p><i>Did I come across a professional?</i></p><br/><p>I quickly replied, “Her body is in the hospital -it is functioning fine but her spirit is alone on its own. How can I return her spirit back into her body?”</p><br/><p>The person then asked, “How do you know that her spirit is on its own?”</p><br/><p>My response, “I can see it.”</p><br/><p>Usually, by this point, most people would ridicule or dismiss me. But this person was different. The person appeared to be fascinated.</p><br/><p>“Interesting! Tomorrow afternoon at 3pm, come to Qing Tan A building, 16th floor, and room 1804. There will be a person to show you the way once you are inside.”</p><br/><p>Then, that was it.</p><br/><p>Regardless of what else I said, the person wouldn’t respond anymore. I looked at his status; it was offline. I was afraid this was a scam, but since I was so desperate, I wrote down the address.</p><br/><p>Qing Tan building, 16th floor, room 1804. I have never been there before.</p><br/><p>I gradually became more and more sleepy. Today was truly too shocking and disturbing. I leaned against the headboard as I continued to watch Tom play with Sheyu. Slowly, I sank into slumberland.</p><br/><p>I had a dream. And Suyang was in it.</p><br/><p>It wasn’t a dream located at a specific place. The background was pure white. In my dream, Suyang was wearing a loose senior high school uniform as he stood in front of me. He yelled, “Why are you standing there like a fool? Come on!”</p><br/><p>I was astonished. I watched him attentively as I slowly raised my finger to point at myself, “Are you talking to me?”</p><br/><p>Suyang lovingly chuckled as he took huge strides towards my way. He placed his hand and elbow on my head as he gently leaned against me. “You foolish girl, of course I am speaking to you!”</p><br/><p>“Why are you and me….” Since our proximity was very close, I could clearly feel my cheeks flushing. Furthermore, I was no longer able to shift my sight away from Suyang’s facial features.</p><br/><p>“If you’re going to remain so stiff and motionless, I’m going to disappear.” Suyang softly threatened.</p><br/><p>I shook my head, “You will disappear?”</p><br/><p>I wanted to test him, so I tried to grab his hand. But I didn’t manage to grab onto anything. Instead, Suyang’s body was slowly turning into a semi translucent state in front of me.</p><br/><p>“You…”</p><br/><p>“I told you not to be so stiff and motionless. I’m going to leave first.” I saw Suyang touch my head, yet I didn’t feel a thing. I hopelessly stared as his smile dissipated in front of me little by little….</p><br/><p>In the end, I was all alone in the white space.</p><br/><p>The white space no longer felt innocent. I felt as if I had been placed in a perplexed world.</p><br/><p>What was our relationship in my dream?</p><br/><p>I had no idea. But I knew in the dream, new feelings had arised. It was different from how I felt towards him in real life. Instead of being all upset and driven the moment I see him in reality, it was a maidenly impulse that should not be in a person of my age.</p><br/><p>“Goldfish! Wake up….” My eyes were shut. I heard someone lightly calling me.</p><br/><p>Surprisingly, last night, I fell asleep with my laptop wrapped in my arms. I opened my drowsy eyes and the first thing I noticed was Suyang leaning by the door. He had a glass of milk in his hand.</p><br/><p>“Are you an alarm clock? Everyday, you punctually wake me up in the morning…” I grumbled as I got out of bed in a whoosh.</p><br/><p>I got up too swiftly and my long weedy hair covered my face like a female ghost. I glared at Suyang through the gaps.</p><br/><p>“Last night, I called Shaoqian. He told me that after humans go through a horrific experience, they tend to turn unstable and treat everyone as an enemy; especially weak and fragile girls. I am certain that you do not belong in the “weak and fragile” category, but he insisted that I need to take the time to comfort you, tolerate you, and understand you.”</p><br/><p>“So are you prepared to comfort me? Tolerate me? And understand me?” I took the rubber band from my arm and gathered my hair to tie it together. Then, I stepped into my slippers and dragged my feet over as I stood in front of Suyang with my messy hair and dirty face. I lifted my head and looked straight at him.</p><br/><p>After Suyang sized me up and down for awhile, he sighed. Then, it was as if he had made some sort of resolution. He lifted the glass of milk like a display, and said, “I specifically warmed this up for you.”</p><br/><p>I am sure he had just gone through a lot of internal struggle.</p><br/><p>“Thank you.” I took the glass from him and finished the milk in one go. Then, I squeezed the glass back into his hand. “But if you truly want to treat me better, could you please stop casually opening my bedroom door? Let me wake up naturally. Please.”</p><br/><p>Suyang gave me a “you’re expecting way too much” expression as he sternly stated, “This is the only time I am treating you well.”</p><br/><p>“You!” I pointed my finger at Suyang, but he grabbed hold of it. When he released my hand, I had an extra tissue in my hand.</p><br/><p>He turned his head and walked away without looking back.</p><br/><p>I waved the tissue and asked, “What does this mean?”</p><br/><p>Suyang’s back view had already disappeared from my sight. His voice spreaded from the kitchen. “Your mouth…”</p><br/><p>Subconsciously, I touched the corner of my mouth. Ugh…he saw me in a gross state again.</p><br/><p>I recklessly wiped my mouth with the tissue as I ran to the washroom to wash my face and rinse my mouth. Then, I woke up Sheyu. She had dozed off in the corner while crouching.</p><br/><p>“We have to go now!”</p><br/><p>Sheyu was right behind me as I hurriedly ran towards the front door to change shoes.</p><br/><p>Suyang was on the couch playing with the tablet. But the moment he saw my actions, he came over and asked me, “Where are you going now?”</p><br/><p>“I’m going to capture the bad guy.”</p><br/>\n</div>"}