{"title": "Chapter 41", "id": 41, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-41", "volume_title": "Volume 1", "body": "<h1>Chapter 41</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 41: The fake Xu Weishan’s true identity was…?</b></p><br/><p>After digging for another five minutes or so, I finally managed to take the entire metal box out of the ground.</p><br/><p>The box was around the size of a dictionary. There was no way it could fit a body; it wouldn’t even be able to fit an arm….</p><br/><p>I shook the box, but there was no sound coming from within. I opened it, and ashes flew out. I instantly closed the box as I fearfully stared at Xu Weishan. If these were ashes, these must be Xu Weishan’s ashes.</p><br/><p>Because of me, some of it had flown out. What a sin, what a sin.</p><br/><p><i>The younger sister burned her older sister’s body?</i></p><br/><p>Indeed, if she had burned the body and hid the ashes, no one would be able to discover her secret of pretending to be Xu Weishan.</p><br/><p>After a long time, only one Xu Weishan would remain in this world.</p><br/><p>Knowing that I was holding on a box of ashes brought shivers up my back. How could her body be burnt so thoroughly? This wasn’t a crematorium.</p><br/><p>I held onto Xu Weishan’s silver bracelet with my soiled hands as I comforted her, “Now that you’ve been burnt to ashes, I’m afraid it is impossible for others to identify you. But fortunately, we have your bracelet as evidence. Don’t worry, I’ll make sure your sister gets the punishment she deserves.”</p><br/><p>Xu Weishan nodded her head skeptically. Although she was a ghost, I could see her crumpled brows and droopy mouth. I wasn’t sure if I was over thinking, but I felt like she had been acting very strange today. Was it because she didn’t trust me?</p><br/><p>The next day, I sneaked out before Suyang woke up and took a taxi to the fake Xu Weishan’s home. I waited underneath her building as I nibbled on my breakfast bun. The plan was to wait patiently for things to expose themselves. I didn’t believe she wouldn’t come out. The moment she leaves her door, I will tailgate her. As long as I followed her, I was positive that I will be able to discover something odd or suspicious.</p><br/><p>For instance, right now, Xu Weishan was speaking to a woman who appeared to be very distressed and tearful. There must be something fishy about this.</p><br/><p>They were sitting on a long bench at a park as they chatted. I was observing them from behind an ice cream cart. Unfortunately, I had to follow the cart as it moved. Our distance was gradually growing further and further apart.</p><br/><p>I tried to stop the ice cream cart from moving as I gazed at the cold aunty above me, “Could you remain here for a bit longer? Just a bit longer!”</p><br/><p>“Crazy woman….” The old aunty heartlessly rolled her eyes at me and continued to push the ice cream cart forward.</p><br/><p>“Please!?” I pleaded as I handed 20rmb to her, “Give me an ice cream and stay here for a few more minutes?”</p><br/><p>The old aunty sighed and took my money. Then, she handed me three scoops of ice cream and promised to let me temporarily shield behind her cart.</p><br/><p>As I licked the ice cream, my brain was trying to piece everything together. Although I couldn’t hear what they were talking about from where I was hiding, I could tell it wasn’t something typical based on their facial expressions.</p><br/><p>“Do you know that woman?” I pointed at the middle aged woman who was crying to the the fake Xu Weishan as I asked ghost Xu Weishan.</p><br/><p>“What did you say?” The old aunty asked me.</p><br/><p>“Ah? No..nothing….”</p><br/><p>I looked at Xu Weishan, but she shook her head.</p><br/><p>That means the woman was one of the fake Xu Weishan’s people. Very good! I nodded my head in a satisfying manner. After the two of them separated, I changed my target and began to stealthily follow the middle aged woman instead. Soon, we arrived at an orphanage.</p><br/><p>Orphanage…</p><br/><p>This was probably the orphanage that Kevin had mentioned about?! From the outside, I could see a few children playing with each other. Suddenly, a child threw the ball my way. It landed in front of my feet. God was truly trying to assist me.</p><br/><p>I picked up the ball.</p><br/><p>“Big sister, can you return the ball back to me?” An energetic little girl yelled towards me.</p><br/><p>“Alright, here you go!” I warmly smiled. Then, I lightly threw the ball back to her. Since I picked up the ball, I had the opportunity to get closer towards the orphanage.</p><br/><p>However, instead of paying attention to the cheers of joy from the children, what caught my attention was a little boy that was sitting alone on the swings underneath a big tree.</p><br/><p>I felt my heart tightening. Orphanage, swings, a bunch of children laughing and having fun, plus an uncommunicative child…. It was as if history had repeated itself.</p><br/><p>In another world, I saw another me from sixteen years ago.</p><br/><p>All by myself; with my head lowered.</p><br/><p>“Why aren’t you playing with the other children?” I went over to talk to the child on the swings. It looked like he was also a child from the orphanage.</p><br/><p>Since he didn’t reply, I crouched down. Just as I was about to continue prompting, he lifted his head and made eye contact with me.</p><br/><p>The child’s eye sockets were deep, and his entire face was pale. He looked very sick. I almost thought he was a ghost.</p><br/><p>I was stunned.</p><br/><p>He opened his mouth, “Xiao Xin is waiting for sister Bei to come. Xiao Xin only plays with sister Bei.”</p><br/><p>“Sister Bei?”</p><br/><p>“Sister Bei and sister both have the same type of shoes. Sister, do you know sister Bei?”</p><br/><p>I lowered my head and stared at my shoes. This morning, I was in too much of a rush so I randomly put on a pair. I was wearing the brand name sports shoe that the school had given all their students.</p><br/><p><i>Could sister Bei be the fake Xu Weishan?</i></p><br/><p>Since Xu Weishan was from an upper class society, it was rather easy to find her picture of her on the internet.</p><br/><p>I showed it to Xiao Xin, “Is this your sister Bei?”</p><br/><p>Xiao Xin appeared to be very emotional as he nodded his head very passionately, “Sister, so you do know sister Bei! Can you tell her to come? Please tell her, Xiao Xin misses her a lot….”</p><br/><p>This child was around eight or nine years of age. <i>What was his relationship with Xu Weishan? Was sister Bei the true identity of the fake Xu Weishan? </i></p><br/>\n</div>"}