{"title": "Chapter 64", "id": 64, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-64", "volume_title": "Volume 1", "body": "<h1>Chapter 64</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 64: Hunting Lu Wenxue down, layer by layer</b></p><br/><p>Suyang felt strange. He was wondering if he had fallen into some type of trap.</p><br/><p>“Haha, really?” I gave him an awkward brilliant smile. Deep down, I decided that I will never let him know the real reason why I want to find out Mi Fan’s dark secrets. (It was because of my jealousy towards their date).</p><br/><p>After a brief moment of silence, I opened my mouth.</p><br/><p>“Actually, I’m the type that’s cold on the outside and warm on the inside. Also, I’m very righteous….. So can you tell me what you and Shen Shaoqian have found out? Can you give me a brief summary of your findings?”</p><br/><p>“Why should I tell you?” It appeared that Suyang wanted to purposely leave me with a cliffhanger as he turned to leave my room.</p><br/><p>I hurriedly ran to grab onto him, “Don’t go! If you didn’t want to tell me, why would you have mentioned it? If you only say half of your sentence, then you’re not being an upright gentleman!”</p><br/><p>“I have always been an upright gentleman.” Suyang flung my hand away. His arrogant character had resumed. “I never had the intentions of telling you from the start. Don’t overthink.”</p><br/><p>I pouted, “You’re too unfair…just tell me. Perhaps I can help out!”</p><br/><p>I gave Suyang a flirtatious glance.</p><br/><p>“This is actually much more complicated than you might think. Her backup isn’t someone we common people can come in contact with. The more you know, the more danger you will be in.”</p><br/><p>“Then how about you? If you’re investigating, aren’t you putting yourself in danger too?” Once again, I seized him by the arm. This time, I used all my strength to ensure he cannot fling me off again.</p><br/><p>“Hmm…” Suyang rubbed his chin as he thought about it. Then, he played it down. “Ok, it’s not that dangerous. But how should I say it? I just don’t want you to take part.”</p><br/><p>I pretended to act cute as I made my voice all girly and whiney, “Bbbbb-osssss. Just tell meeeeee….!”</p><br/><p>“Stop! How old are you? Why are you howling?” Suyang made me shut up as he violently pulled me off of him. Then, he used his big red hand to push against my forehead, “I need to sleep now. From now on, you’re not allowed to think about the Mi Fan incident, understand?”</p><br/><p>“Oh….” Since Suyang was so determined, I couldn’t say anything else.</p><br/><p><i>No way! I’m not the type of worker who wouldn’t care about things if it was a matter of no concern to me. Plus, Suyang already said it might be dangerous. So that means I must help him!</i></p><br/><p><i>But if I don’t know anything, how can I help…..</i></p><br/><p>“Hey!” Suyang interrupted my thought process as he accused, “Are you thinking about it again? Stop it!”</p><br/><p><i>Could he read my mind?</i></p><br/><p>Before he left, Suyang was mumbling to himself, “Should I find something…”</p><br/><p>Once the door was closed, my mind became clear again.</p><br/><p>I thought about my advantage. I could contact the dead Lu Wenxue and find out about things that others will never know.</p><br/><p>Wasn’t that a way to help Suyang? Also, originally, I wanted to grasp Mi Fan’s tail using my own method.</p><br/><p>But the problem is, how can I see Lu Wenxue again? Last time I saw him, he was following Lu Zhengyang. As a father, even though he was dead, his child was the one he missed the most and couldn’t let go of. That was why he was always by his side.</p><br/><p>So, I should go find Lu Zhengyang instead.</p><br/><p>But Lu Zhengyang wasn’t that easy to locate either. Aside from his name and lots of fake news articles online, I didn’t know anything else about him.</p><br/><p>The only connection we had together was Shen Shaonu. But I didn’t have Shen Shaonu’s contacts either.</p><br/><p><i>Shen Shaonu? Shen Shaonu? I recall seeing her name tag on her uniform… what was the name of her school again? </i></p><br/><p><i>I remember! It was Chengxin Female High!</i></p><br/><p>I smiled cunningly. <i>I will hunt Lu Wenxue down, layer by layer! </i></p><br/><p>When my cat Tom saw the evil expression on my face, he couldn’t help but back away a few steps.</p><br/><p>The next day –</p><br/><p>Chengxin Female High was our city’s most extravagant female high school. So it turned out Shen Shaoqian’s family was part of the invisible wealthy sect…. I should’ve known.</p><br/><p>All I had on me was 153rmb. That wasn’t even enough to buy a sleeve of their school uniform. I knew I was categorized as the cheap broke type. After entering the school N times, I kept getting blocked by security. It was truly quite depressing.</p><br/><p>I told them I knew Shen Shaonu. Yet, they all “humph” and dismissed me.</p><br/><p>Since I couldn’t get my way face to face, I decided to leap over the wall from the back.</p><br/><p>I patted the tree next to the school wall. “When you’re alive, you should attempt everything….” Fortunately, I was relatively fit enough and managed to flip into the school yard.</p><br/><p>I was actually so proud of my perfect landing that I didn’t pay attention to my surroundings. The first step I took, I accidentally slipped on an empty bottle and fell on my bottom.</p><br/><p>I rubbed my sore butt as I walked towards the school building. Inside, there were young girls around 18 or 19 of age. Each and everyone of them were wearing school uniforms. Their youthfulness was a slap to my “auntie” face.</p><br/><p>I entered the school building but I couldn’t recall which class Shen Shaonu was in. I didn’t even remember which grade she was in.</p><br/><p>But since Shen Shaonu was attractive, rich, and had a feisty personality, I was quite certain she was a known figure in the school. So, I randomly asked a girl next to me, “Excuse me, do you know which class Shen Shaonu is in?”</p><br/><p>“Shaonu? Third year, class B.”</p><br/><p>As expected…everyone knew who she was.</p><br/><p>I arrived at the third year, class B room. From the outside, I immediately saw Shen Shaonu. I waved my hand, indicating for her to come out.</p><br/><p>She seemed surprised to see me. Then, she hesitated. Ultimately, she walked towards me. The first thing she said to me was, “Auntie, why are you here?”</p><br/><p>“Who’s your auntie? Call me sister!”</p><br/><p>“Oh…” Shen Shaonu appeared unwilling, “So, why are you here, sister?”</p><br/><p>“Obviously I came to find you. I want to see Lu Zhengyang. Help me out!”</p><br/><p>“Why do you want to see Lu Zhengyang? Aren’t you on Suyang brother’s side? Was he the one who sent you here? If so, there is nothing to talk about. Whatever we choose to do is none of your business!” Shen Shaonu suddenly began to attack me with her mouth cannons. Most likely, she had been wary of me since Lu Zhengyang’s arrest.</p><br/><p>“Stop! I haven’t said anything yet, and you’re already creating scenarios in your head. I came without notifying Suyang. That day after I returned home, I thought about it very deeply. I decided I want to help you and Lu Zhengyang.”</p><br/><p>“You want to help us?” Shen Shaonu wasn’t as happy as I thought she would be. Her tone of voice was filled with disdain.</p><br/><p><i>Was she looking down on me? Ahhh! Hey missy! I can see Lu Wenxue! If you knew how amazing I was, I bet you would have tears and snots running down your face and you’d be holding on my thigh begging me to help you! </i></p><br/><p>“Is it because you don’t believe I have the ability to help you?”</p><br/><p>Since I was so direct, Shen Shaonu no longer felt the need to hold back. She told me straight up, “Honestly, sister, you’re Suyang brother’s assistant. In my opinion, you can’t help us. Plus, Zhengyang doesn’t want too many people to know about him. So…”</p><br/><p>“I understand your concerns. But, your Suyang brother wants to date Mi Fan. Are you sure you don’t want a spy to help you watch over them on a daily basis?” I used the fatal bomb on Shen Shaonu.</p><br/>\n</div>"}