{"title": "Chapter 70", "id": 70, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-70", "volume_title": "Volume 1", "body": "<h1>Chapter 70</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 70: Director Rui</b></p><br/><p>“Sorry. I will tidy up immediately.” Then, I rushed to put all the utensils onto the dining cart. But because I was so nervous, my hands were shaking. I told myself to calm down, but my heart was still pounding like *ping ping ping*. To me, it was an ear-piercing sound.</p><br/><p>I could feel the person approaching me from behind. I paused my movements as I felt cold sweat running down my back. <i>It’s over! It’s over!</i></p><br/><p><i>If he figures out I’m a fraud, then what? What should I do? Hit him and run? Or should I explain? No no no! This was unexplainable! So of course I would have to smack him! I must strive to KO with one punch. Then run for my life. </i></p><br/><p><i>Yeah! That was the plan! </i></p><br/><p>“1, 2….” I counted on the inside. I planned on making my move at the count of three as I tightened my grip on the lid and decided it was the weapon that would determine my victory or not.</p><br/><p>“You purposely want to catch my attention, don’t you?” The man suddenly shifted his head towards my right neck. He was whispering like he was blowing air into my ear. It made my neck and ear tingle. But I didn’t dare to move.</p><br/><p>“Huh?” I wasn’t sure what he meant.</p><br/><p>“New server. You know you’re quite attractive, so you purposely acted clumsy in front of your boss to lure him, eh?”</p><br/><p>Then, he lustfully placed his chin on my shoulder as he handed me his business card with his right hand.</p><br/><p>“Would you like to spend tonight with me?” He murmured.</p><br/><p>On the card, there were the following texts: <i>Jingrui Hotel, CEO, Director Rui</i>.</p><br/><p>Jingrui Hotel was the hotel we were currently in. In our city, the Jingrui corporation had connections in all industries. In terms of the hotel and restaurant business, it was the biggest. No wonder Suyang said Mi Fan’s background supporter was very powerful.</p><br/><p>Initially, I thought this guy saw through me. But it turned out he was simply a narcissistic, perverted young man. He gave me such a fright!</p><br/><p><i>Alright, fine. I’ll continue to act along with you. That was the only way I could guarantee a safe exit. </i></p><br/><p>I pretended to be bashful as I slowly reached for his business card. I put up a front as if I was “that type of women” and I coquettishly tried to appear seductive, “I understand, boss….” My voice sounded so disgustingly sweet that I wanted to puke.</p><br/><p>“I’ll be waiting for your call tonight…” Director Rui removed his head from my shoulder. But before leaving the room, he pinched my butt.</p><br/><p>“Ahhhh!!!” I was screeching from within. I wanted to explode.</p><br/><p><i>My beloved butt!….the butt I had raised for 25 precious years….!!</i></p><br/><p><i>I can’t believe Director Rui was so different from his appearance! He actually dared to sexually lure his female subordinates. Despicable! Sickening! </i></p><br/><p>Director Rui left before me. I imitated his words after he had disappeared from my sight to show my disgust towards him.</p><br/><p><i>“I will be waiting for your call tonight</i>….you are the scum of society! I represent a vast amount of my fellow women as we all looked down upon you!”</p><br/><p>Oh yeah, tonight, I had made plans with Lu Wenxue to see Grandmother Meng. I should hurry to notify Grandmother Meng ahead of time. Or else, she might think Lu Wenxue was some evil spirit and get rid of him. Also, I wasn’t finished with Suyang’s mission yet. I still had to complete it despite how terrible it was. So, there was no time to waste!</p><br/><p>Now that Director Rui was gone, it wouldn’t matter even if I didn’t finish tidying up.</p><br/><p>So I abandoned the dining cart and quickly left the hotel as I took the taxi to see Grandmother Meng.</p><br/><p>Once again, I was back at this icy, gloomy place. Yet oddly enough, I was beginning to develop an amiable feeling towards this place.</p><br/><p>When I had arrived, Grandmother Meng was sitting on her seat playing a game. It looked like it was related to slaughtering zombies.</p><br/><p>As expected of Grandmother Meng, even a simple game had to be related to her field.</p><br/><p>The moment Grandmother Meng saw me, she was abnormally excited. She quickly tossed her game aside to welcome me.</p><br/><p>Her first line was, “My younger sister! How I have missed you!”</p><br/><p>Immediately, my nostrils expanded. <i>Oh my goodness, I had forgotten that we were sworn sisters. We’re considered the same generation. </i></p><br/><p>“Can you not call me your younger sister? Grandmother Meng….” I gave her a depressed expression. <i>As the proverb says, there is a generation gap for every three years. Couldn’t she tell we have a few thousand years of generation gap between us? </i></p><br/><p>Grandmother Meng completely ignored my request as she stood up. “Younger sister, please have a seat. I’m going to wash and prepare a fruit for you to eat.”</p><br/><p>“No, it’s okay! Rather than wash a fruit for me, I’d prefer if you turn off the AC. This place is way too cold…” Then, I happened to sneeze, “Ahhh-choo!”</p><br/><p>“Cold? But I don’t feel anything.”</p><br/><p>“That’s because you’re wearing a wool coat! It’s Summer! What kind of person wears a wool coat indoors?!” I was so flabbergasted by Grandmother Meng’s silly brain that I wanted to crash my head against the wall. If it weren’t for the fact I needed her help, I would say a lot more. But I suppressed it all as I gently touched my head to silently cheer myself on, “Good! Good job! You’re doing well!”</p><br/><p>“Today, I came because I have something I need you to help me with.”</p><br/><p>“I know, you only come when you need help.”</p><br/><p>Now that she said this, I felt sort of guilty.</p><br/><p>“Umm, are you annoyed at me?”</p><br/><p>Grandmother Meng shook her head, “It’s not like I have anything to do at home. Plus, I’ve had contacts with spirits all my life. Anyway, what fun stuff do you have for me today?”</p><br/><p><i>Fun…? Ok there….</i></p><br/><p>“Do you remember body possessing thing you’ve done for me before? I want to do it again!”</p><br/><p>“Last time, a spirit almost screwed you over, and you still want to try again?”</p><br/><p>Grandmother Meng was referring to the Xu Weishan incident. Xu Weishan had wanted to replace me. At the time, I was really scared. But I can’t let one bad experience rule my life.</p><br/><p>“That was an accident. This time, I must figure out what had happened through his memories. So, this is the only option. Plus, I have you here with me, right?” I made a heart shape with my hands, “I trust you.”</p><br/><p>“After your previous experience, you do know that even if you do this, you may not know the whole truth. You’re only able to read his thoughts after sharing the body.”</p><br/><p>“I know. You’ve already mentioned this. But I have no other choice, so I can only request for your service! Please help me once more!”</p><br/><p>“I can help you, but tell me what it’s for?”</p><br/><p><i>There should be no harm in telling Grandmother Meng right? </i></p><br/><p>“Are you aware of the Lu Wenxue incident that had shocked the nation?”</p><br/><p>“Lu Wenxue? How come you have ties with him?”</p><br/><p>“Uh…..*explains*… so naturally….” I stammered.</p><br/><p>“Are you aware of how dangerous this situation is? No! I will not let you take part! I do not approve!” Grandmother Meng refused as she turned her seat around and faced her back at me.</p><br/><p>I could tell Grandmother Meng had analyzed the situation. She was really different from the mass. Although she didn’t know the truth, she didn’t blindly choose to believe the public opinion.</p><br/><p>Since Grandmother Meng was unwilling to help, I had to use my ultimate weapon.</p><br/><p>“Suyand has already taken part in this case. In order to help him, I must figure out everything before he does. You also know there’s a conspiracy going on. But we don’t know what the conspiracy is.”</p><br/><p>“Xiao Su? How did he get involved in this case?”</p><br/><p>“I must help him! He is in too much danger on his own. The longer he is involved in this case, the more danger he will be in. So, the only way to come to a quicker conclusion is with your help.”</p><br/><p>“You….” Grandmother Meng sighed and didn’t say anything else. It appeared she had silently agreed to my request.</p><br/><p>As expected, the moment I mention Suyang, she had nothing else to say.</p><br/><p>“Thank you!” I looked at my watch, “It’s only noon? I made an appointment with him to meet here at 7pm. Since I have 7 hours, I will stay here to complete the mission your precious grandson gave me!”</p><br/><p>“Xiao Su? What type of mission did he give you?”</p><br/><p>“Don’t mention it. The moment I think of it, I feel so irritated. Suyang actually demanded me to go to the aquarium to take pictures of every single species and write a description for each. I have to create a powerpoint presentation for him too. He purposely want to make my life difficult.”</p><br/><p>Grandmother Meng bursted into laughter, “As expected of my grandson, he really has fresh ideas to mess with someone. I think he is personally making your life difficult because he doesn’t want you to participate in dangerous events with him.”</p><br/><p>“Yeah….” I can’t believe she could say this in such a carefree manner. I hopelessly shook my head. The Su descendants were truly something else.</p><br/><p>So, I focus on creating my powerpoint and in no time, it was already 6:30pm.</p><br/><p>Surprisingly, I got the hang of this useless assignment and more or less completed it. Then, I waited for Lu Wenxue.</p><br/>\n</div>"}