{"title": "Chapter 75", "id": 75, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-75", "volume_title": "Volume 1", "body": "<h1>Chapter 75</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 75: Teasing Suyang</b></p><br/><p>At that moment, I suddenly realized how calm Suyang truly was. The way he analyzed was different from me. I had the tendency to incorporate my own biases and emotions when coming up with conclusions. Whereas, Suyang used a spectator perspective. He would arrange all the clues before carefully examining them.</p><br/><p>“Suyang, were you part of the police department previously?” I asked out of curiosity.</p><br/><p>“No, why?” Perhaps he was astonished by my admiring gaze as he lightly coughed twice.</p><br/><p>“No, I just feel like the way you organize your thoughts is very professional; just like a detective!” I had both my hands on my chin as I gave him an idolized look.</p><br/><p>Suyang proudly smiled, “Have you forgotten who I am? I’m a speculative author!”</p><br/><p>“Oh yeah! I’m speechless!” Seeing how Suyang was so full of himself, all my admiration vanished without a trace. All I had left were sarcastic words.</p><br/><p>“So who are these people?” I took out the profiles of those I hadn’t seen before. <i>They seemed like random strangers that were passing by. How were they related to the case? </i></p><br/><p>“They are either experts or influential people around this territory.”</p><br/><p>“How are they related to this case?”</p><br/><p>“They’re Lu Wenxue’s ex students. They must know Lu Wenxue’s character. If they are willing to step out and say a few words for Lu Wenxue, there would be some influence and we may have a chance of success.”</p><br/><p>“You want to go against the Jingrui corporation?” I blurted.</p><br/><p>“What? Are you afraid?”</p><br/><p>I shook my head. “What is there to be afraid of? Those who are the most dangerous are people like myself. Since we have nothing, there’s nothing for us to lose. However, as an author, aren’t you afraid to be blacklisted?”</p><br/><p>“Blacklisted? Before you can blacklist me, you better get through Shen Shaoqian. Don’t underestimate him. He has quite a powerful background.”</p><br/><p>“I see. No wonder you’re so brave, boss. You have backup, so you can afford to be righteous.” I lightly teased. “But when the incident happened, no one stepped out for Lu Wenxue. What makes you think they will do so now?”</p><br/><p>Suyang placed his arm over my shoulder as he solemnly stated, “Goldfish… since you want to take part in this, it is your responsibility to get these three to help us.”</p><br/><p>“My responsibility?”</p><br/><p>“Convince them to speak up. I believe you can do it!”</p><br/><p>“Can you assign me something else? I have never met those three before. I would probably have a better chance of going after him.”</p><br/><p>I flaunted Director Rui’s business card in front of Suyang.</p><br/><p>“Why do you have Director Rui’s card?”</p><br/><p>“I told you. I was present while he was eating with Mi Fan earlier. It was a coincidence, but they thought I was a server from the Jingrui hotel. That’s why I was able to overhear their conversation. Before he left the room, he made a sexual move on me. Then, he gave me his name card. Oh yeah, Director Rui knows of you and warned Mi Fan to watch out for you…. Maybe you shouldn’t meet her anymore.”</p><br/><p>I secretly added the last line since it was my wish.</p><br/><p>“Sexual move?!” Suyang raised his voice.</p><br/><p><i>Was that the main point?</i></p><br/><p>“Lower your voice! He said I was pretty and he will be waiting for me to contact him at night. I can’t help it. Since I’m such a pretty girl, I’m admired wherever I go. So troublesome….” I batted my eyes and flipped my hair shamelessly.</p><br/><p>“I think Director Rui’s eyes must be slanted.” Suyang heartlessly teared my confidence apart.</p><br/><p>“Psssh… anyway, why don’t we split the tasks. You are responsible for Mi Fan while I am responsible for Director Rui. Perhaps I’ll get to the bottom of this faster than you can! After all, I feel like Director Rui doesn’t have much of a brain.”</p><br/><p>“He might not have a brain, but you’re even more brainless than him!” Suyang harshly jabbed his finger at my brain, “Before you can trick him, he would’ve already swallowed you whole! He’s a dangerous person. Don’t be a fool and try to get close to him!”</p><br/><p>“That’s true… what he did to me today was rather frivolous.”</p><br/><p>“What did he do to you?”</p><br/><p>“Allow me to demonstrate!” Then, I turned Suyang’s body around and stood on top of the couch as I imitated Director Rui’s movement. First, I bent down my waist and lowered my head towards Suyang’s shoulder. Then, I lightly whispered into his ear.</p><br/><p>“Today, he stood behind me and whispered in my ears….”</p><br/><p>To make it more realistic, I blew air into Suyang’s ear and made him feel goosebumps all over. He shivered.</p><br/><p>Hehe. Fine. I was purposely trying to flirt and tease him. For some reason, I really enjoyed making him flustered.</p><br/><p>“Also, before he left, he pinched my butt!”</p><br/><p>“He pinched your butt?!” It looked like Suyang’s green veins were about to pop out. His eyes looked like they were about to blast out fire. Suyang aggressively snatched the name card from my hand and crumpled it as he threw it into the garbage.</p><br/><p><i>Three point shot! </i></p><br/><p>“Boss, you’re going to bed? You don’t want to see my demonstration anymore?” I called out as Suyang stormed back to his room. It was actually quite fun being teased and teasing Suyang.</p><br/><p>Just as I was reminiscing, Suyang suddenly came back out and took off his outer shirt. “Disgusting! I can’t wait until tomorrow. Wash it now!”</p><br/><p>Then, he slammed the door.</p><br/><p>I frowned. <i>If he thought it was gross, then why didn’t he push me away while I was drooling? Ugghh</i>…</p><br/><p><i>No one told him to remain there while I drooled! </i></p><br/><p>Anyhow, after some deep reflection, I decided to listen to Suyang and not mess with Director Rui. After all, I wasn’t stupid and I could tell what type of person Director Rui was. Currently, he wasn’t someone I could afford to mess with.</p><br/><p>—–</p><br/><p>It was a fine sunny day; the perfect day to find people.</p><br/><p>I had Suyang’s profiles in my hand as I decided to pay a visit to Lu Wenxue’s three ex students.</p><br/><p>Mo Xiaotian was a top outstanding graduate of a prestigious University. She was married to a CEO of a listed company and now she was extremely wealthy.</p><br/><p>Ye Lili was one of the most sought after lawyers today. She specialized in helping rich people with private consultation. Lastly, Xuduo was an ordinary white collar worker. Last week, he donated bone marrow to a child with leukemia and saved his life. Many newspapers reported it. Based on the search results, he may have the biggest influential power.</p><br/><p>He seemed to be the best person to start off with. Since he was an ordinary white collar worker, he would be the easiest person to approach. Also, if he was willing to donate bone marrow to a stranger, he must be rather kind.</p><br/><p>Anyhow, I had no idea where Suyang found all this information. He had all the addresses, phone numbers, and even their workplaces written down.</p><br/><p>Modern people truly have no privacy.</p><br/><p><i>Today was Sunday, they should be home, right? </i></p><br/><p>Just as I was about to walk towards the bus stop, a cool and wild Lamborghini I had never seen before stopped in front of me.</p><br/><p>“Who is it?” Seeing this flashy car, the level of my disgust was raised by ten thousand percentage points. Thinking, who would be so boastful?</p><br/><p>As expected, it was him.</p><br/><p>Shen Shaoqian pressed down the window as he smiled at me with his sunglasses on, “Where are you going? I’ll drive you!”</p><br/><p>“No thanks. I can take public transportation.” I walked by his car pretending I didn’t know him as I headed towards the bus stop.</p><br/><p>“No! Don’t reject my kind offer. Just let me take you there!” Shen Shaoqian drove in turtle speed as he followed me. “At the same time, you can experience my new car! When we’re on the highway, you’ll feel like wind.”</p><br/><p>“I don’t need to feel like wind. And the speed of this street is 60km/hour. How can you drive so quickly? Do you want a ticket?” I kindly reminded this “friend” of mines.</p><br/><p>“Stop with the bullshit and get on!”</p><br/><p>“Suyang is the one who asked you to come, right? He wants you to monitor my moves and not spy on Director Rui?” I was a smart girl. I could tell what was going on immediately.</p><br/><p>Shen Shaoqian clapped his hands and nodded, “You’re correct! I guess you have become smarter ever since spending more time with Suyang.”</p><br/><p>“I didn’t become smarter because of Suyang. I was already smart, ok?” I rolled my eyes at Shen Shaoqian, “If not, why haven’t you become smarter since you’ve been friends with him for all these years?”</p><br/><p>“Ha! Now you’ve also learnt how to insults others from Suyang, eh? Don’t forget. If it weren’t for me, the two of you wouldn’t be living together.”</p><br/><p>“Yes yes yes. It’s all because of you. Because of you, I’m always in deep waters and scorching fires. Thanks to you, I am living a life of slavery!”</p><br/><p>“Ahhh..don’t say that! Your salary is quite high, no? Plus, you have a lot of free time. You can always take a walk and do your own thing. You should be thanking me.”</p><br/><p>I finally arrived at the bus stop, but Shen Shaoqian was still beside me. He stopped right in front of the bus area where only buses were allowed to stop.</p><br/><p>“Don’t worry about it. I won’t be so stupid to look for Director Rui. Just tell Suyang no need to worry.” It was quite awkward since I could feel many eyes on me and Shen Shaoqian. <i>It was because of his flashy car…. </i></p><br/><p><i>I felt like I was losing face…</i></p><br/><p>“Hurry and leave! This is for the buses only. You can’t stop here. Go go go!” I looked at a distance and avoided Shen Shaoqian’s eyes as I waved my hands in the air to indicate for him to leave.</p><br/>\n</div>"}