{"title": "Chapter 71", "id": 71, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-71", "volume_title": "Volume 1", "body": "<h1>Chapter 71</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 71: Lu Wenxue’s story (Part 1)</b></p><br/><p>I was a bit anxious because I was afraid he wouldn’t remember the address; or he might not show up.</p><br/><p>At 7:10pm, the doorbell rang. Lu Wenxue suddenly appeared in front of me. I was shocked.</p><br/><p>“I knew he was coming, so I removed the ghost blocker seal.” Grandmother Meng was resting as she suddenly opened her eyes, “He’s here?”</p><br/><p>I nodded.</p><br/><p>“Then, let’s get started?”</p><br/><p>“Wait, I must seek his consent first.”</p><br/><p>I went over to Lu Wenxue and explicitly told him what we were about to do, “Mr. Lu Wenxue, I know I am just a stranger to you. Perhaps you don’t trust me, but I’m sorry to tell you that I’m the only person who could help you. I remember the first time I had seen you was the day that Zhengyang attempted to pour sulfuric acid on Mi Fan. That day, your heart must have ached, right? Since the case from a year ago, Zhengyang has never lived a day at ease. Each day, all he thinks about is revenge. I could understand how he feels. After all, his beloved father died because he was framed. I could understand all the extreme things he has been doing. But at this rate, one day, he will be a target. These people have very powerful backgrounds. We shouldn’t put Zhengyang in this danger.”</p><br/><p>Lu Wenxue solemnly listened to my words as he covered his face with his hands and began to gradually lower his head.</p><br/><p><i>Was he feeling guilty because of my words? </i></p><br/><p>“Don’t misunderstand! I am not trying to blame you. Because this doesn’t have anything to do with you…. Ah! No! It’s not that it doesn’t have anything to do with you…. Except…ai ya! I’ll just explain the procedure we’re about to do to you. What’s going to happen is that I am going to allow your spirit to enter my body. Once our spirits are connected in the same body, I can get into your thoughts. Under these circumstances, as long as you are recalling your past, I will also be able to experience the same thing. But please take caution and not lie. Every single small detail could affect my judgment. Do you understand?”</p><br/><p>Lu Wenxue nodded; indicating his consent.</p><br/><p>I turned around to lay down on the familiar seat. But suddenly, my memories of Xu Weishan jumped out and messed with my mind. I ended up landing on the ground with my bottom.</p><br/><p>Grandmother Meng was shocked. “What’s wrong?” She was sharpening the knife in her hands.</p><br/><p>I rubbed my chaotic brain as I shook my head, “Nothing.. It’s just that….nothing.” Then I attentively stared at the knife that Grandmother Meng had in her hands.</p><br/><p>“Are you using that to take my blood or murder me?”</p><br/><p>Although I was a thousand times unwilling, I pushed away all those thoughts and laid down again, “You may begin now.”</p><br/><p>—–</p><br/><p>I wasn’t sure if it was real or fake, but through Lu Wenxue, I was able to see the story from his perspective.</p><br/><p>Nowadays, people with undergraduate degrees could be found everywhere. So in terms of looking for employment, being a University graduate no longer has any advantages. However, in Lu Wenxue’s era; approximately some time in the 1980s, being a University graduate undoubtedly brought honor to one’s ancestors.</p><br/><p>Ever since he was little, Lu Wenxue had always been his parents’ hollow of the palm. He was his entire family’s hope. As expected, Lu Wenxue didn’t let them down. He graduated in one of the top ten schools in the city. He brought glory to his hometown and married his childhood sweetheart.</p><br/><p>But one day, he made a decision that stunned everyone. He gave up a high salary job in a big city and took his child and wife to the countryside to teach.</p><br/><p>According to him, “In the past, he had completed a week of volunteer work at the mountain village. However, he realized they didn’t even have a public school within the distance of many children. The boys would already be in the workforce in their early teens, while the girls would already be married. They were only children and hadn’t experience life yet! At the time, he had encountered a girl who was only fifteen but already pregnant. Due to a miscarriage, she passed away. That child hadn’t even experience anything yet….”</p><br/><p>“That is the life of others, what does it have to do with you? Just live your own life!” Lu Wenxue’s mother gritted her teeth as she lectured her son. At the same time, she was surprised her filial son would express such a strong desire when he had always been very submissive and obedient towards his family.</p><br/><p>“No! I want to go there to teach the children how to read and write. I want them to have better lives and greater opportunities. At least, give them some options and choices!”</p><br/><p>*Pa* Lu Wenxue’s father slapped his son across his face. As his father, he couldn’t understand why his son would do such a thing and sabotage his own future.</p><br/><p>“Today, I’m here to notify the two of you that I’ve decided to move to the countryside.”</p><br/><p>That was the last line Lu Wenxue said to his parents. In the second year, he used up all his personal savings and built a school at the place where he had done volunteer work in the past. He worked alongside with his wife. One of them was responsible for teaching, while the other one focused on management.</p><br/><p>Once, Lu Wenxue had asked his wife, “Do you feel like our days are causing you a lot of suffering? After all, we have a child. This type of environment….”</p><br/><p>Although Lu Wenxue was determined to help other children who were in need, from time to time, he would have all sorts of concerns for his own family.</p><br/><p>There were countless of times where he had doubted himself and wondered whether he had made the correct choice or not. But each time, his wife would encourage and support him. She gave him the strength and desire to carry on.</p><br/><p>His wife shook her head, “As long as you’re around, I’m not suffering. Plus, our child has such a kind and giving father as a role model. I cannot ask for a better environment than this. Your actions are the best lessons. I want us to set a great example, so what is there to worry about?”</p><br/><p>Lu Wenxue was grateful to God for giving him such an amazing wife.</p><br/><p>As time passed, Lu Wenxue’s school situation began to improve. Initially, it was only the two of them working. But gradually, they had grown into a staff of five and a hundred students.</p><br/><p>As for Lu Zhengyang, he also grew up and began to attend the school his father had built.</p><br/><p>The family of three lived simply and happily until Lu Wenxue’s wife was diagnosed with cancer.</p><br/><p>At the time, Lu Zhengyang had just turned ten.</p><br/><p>Lu Wenxue’s wife was dying as she weakly called Lu Zhengyang to her side. She gently wiped the tears off little Zhengyang’s face as she said in a hoarse voice, “Zhengyang, mommy is going to be going to somewhere far away soon. In the future, it will only be Zhengyang and daddy. Zhengyang, you must take good care of your daddy, okay?”</p><br/><p>“Mommy, where are you going? Can’t you bring us along?” Lu Zhengyang firmly tightened his grip on his mother’s blanket.</p><br/><p>“Mommy is going to somewhere far that Zhengyang and daddy cannot go right now. But, mommy will be watching over you from where she is. Don’t worry.”</p><br/><p>“I don’t want mommy to leave! Mommy, don’t go! Don’t leave me and daddy….” Lu Zhengyang began to violently sob by his mother’s side.</p><br/><p>Lu Zhengyang’s mother was suffering tremendously. She coughed as she continued to talk, “*cough cough*….Zhengyang, don’t cry. If Zhengyang is crying, daddy will also cry. Zhengyang, promise mommy to stay by daddy’s side and take good care of him, okay?”</p><br/><p>But at that moment, Lu Zhengyang was in no state to process any more words. All he did was bawled his eyes out.</p><br/><p>Three days later, Lu Zhengyang’s mother left them forever. Practically, the entire town came to the funeral to offer condolences. Lu Zhengyang will never be able to forget the sad, sorrowful figure of his father from his childhood.</p><br/><p>Lu Zhengyang was a good child. He listened to his mother and naturally helped his father with a lot of tasks at home.</p><br/><p>From then on, the two of them relied upon each other for survival.</p><br/><p>After Lu Zhengyang had graduated the school at the age of fourteen, his father sent him far away to attend high school. Originally, Lu Zhengyang didn’t want to leave his father’s side, but the school they had only went up the Grade 8 level. He had no choice but to go elsewhere to continue his education. So, Lu Zhengyang took the bus and arrived at the city to attend high school.</p><br/><p>So now, Lu Wenxue was all alone.</p><br/><p>Actually, the most difficult thing about opening a school in the countryside was not the teaching component. It was convincing the parents to allow their children to go through education.</p><br/><p>Some parents refused due to the tuition fees. Or perhaps, they believe their children would be better off as farmers. There was no need to study.</p><br/><p>So, each day, Lu Wenxue would go from house to house to attempt and convince the parents to allow their children to attend school.</p><br/><p>But a lot of parents couldn’t afford the tuition fees. At that moment, Lu Wenxue would always respond with, “The child’s education is the priority. Don’t worry about the tuition.”</p><br/><p>Gradually, the school’s expenses were no longer within the scope of Lu Wenxue’s abilities.</p><br/>\n</div>"}