{"title": "Chapter 88", "id": 88, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-88", "volume_title": "Volume 1", "body": "<h1>Chapter 88</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 88: Mi Fan’s POV (Part 1) </b></p><br/><p>My name is Mi Fan. I’m a reporter.</p><br/><p><i>When exactly was it when everything changed? </i></p><br/><p>I became used to insomnia every night. I’ve repeatedly asked myself why? There were numerous times where I had wanted to refuse and start over, but sadly, I’ve already stepped onto this road.</p><br/><p>I couldn’t break free. I could only cover my eyes and proceed forward.</p><br/><p>This was similar to the feeling that I experienced when I had played on the beach. I was being very careful because I was afraid to dirty my shoes.</p><br/><p>But unexpectedly, a fish leaped up from the waters and dirtied my pure, white shoes.</p><br/><p>The dirt was extra conspicuous on my white shoes. It bothered me tremendously, yet I was helpless.</p><br/><p>After some consideration, I decided that since my shoes were already dirty, I’ll just clean it when I get home.</p><br/><p>So, I became more fearless and waded deeper into the waters.</p><br/><p>Weeds and mud covered the soles of my shoes, but I was oblivious to it.</p><br/><p>It wasn’t until my knees had submerged into the waters did I question myself why I was in this filthy water? I could no longer see my shoes; even my legs were muddy now.</p><br/><p>I was stunned, and hastily tried to get back on shore. Surprisingly, it was as if there were something in the waters was holding me back. It wouldn’t allow me to turn around. It had a death grip on me; as if it wanted me to remain in this filth with it forever.</p><br/><p>No one came to save me. I watched as my sight of vision became lower and lower.</p><br/><p>The beautiful scenery I once saw gradually disappeared from my view.</p><br/><p>I was submerged.</p><br/><p>I had been captivated by the sludge. I violently fought to keep my eyes open and noticed a filthy, stinky, greedy monster waving at me.</p><br/><p>I desperately shouted for help, but no sounds came out.</p><br/><p>Instead, the sludge entered my body from my mouth and I was ultimately devoured by the river.</p><br/><p>Then, I concealed myself underwater as I looked up and anticipated for the next person to sink and accompany me.</p><br/><p>—-</p><br/><p>Suddenly, I awoke from this suffocating dream.</p><br/><p>I had cold sweat running down my entire body. I warily turned to the alarm clock next to me.</p><br/><p><i>It was already 9am? How could I have slept in so much? </i></p><br/><p>My body felt very heavy. I took a hot shower and checked my schedule for the day.</p><br/><p><i>Oh yeah, today I have a blind date. </i></p><br/><p>I silently laughed.</p><br/><p>I finally agreed to it because my aunt wouldn’t shut up. <i>24 hours wasn’t even enough for my job. And I still had to find time to go on a blind date? </i></p><br/><p>Thinking of this, I was quite moody…</p><br/><p>I chose the most simplistic outfit to meet my match. From others, I was aware that my match was an online author.</p><br/><p>The location we were meeting in was a very cozy and quiet coffee shop.</p><br/><p>It had the type of atmosphere I enjoyed.</p><br/><p>Because I woke up late, I was approximately 30 minutes late.</p><br/><p>When I arrived at the entrance of the coffee shop, I saw a man who was reading.</p><br/><p>He was very slim and had distinct facial qualities.</p><br/><p>He was very deep into his novel…</p><br/><p>I was quite certain he was the guy. Subconsciously, the corners of my mouth curved into a smile.</p><br/><p>I walked in and approached him.</p><br/><p>“Hi, my name is Mi Fan.”</p><br/><p>I gave him my professional smile and waited for him to stand up to pull out my chair.</p><br/><p><i>He wasn’t what I had imagined? Umm… he didn’t seem to look forward to this meeting as much as I had thought. </i></p><br/><p>When he saw me, he lightly closed his book and politely greeted me, “Hi, I’m Suyang.”</p><br/><p>Since he didn’t show any indication he was going to get up, I pulled out my chair myself and sat down across from him.</p><br/><p><i>Was it because I was late? </i></p><br/><p>I felt like the atmosphere was a bit strange. It was totally not what I had expected.</p><br/><p>“In regards to my lateness, I would like to first apologize. Normally, I’m quite….”</p><br/><p>“My name is Suyang. What would you like to eat?” Suyang cut me off and directly called the waiter over.</p><br/><p>“Huh?”</p><br/><p>“I’m asking you what you would like to eat. We can’t just sit here and not order?” Suyang smiled at me.</p><br/><p><i>But why didn’t the words and smile align? </i></p><br/><p>I looked at the table. <i>He didn’t order anything either?! </i></p><br/><p>He had already called the waiter over. I couldn’t say anything else. Since I hadn’t eaten breakfast, I might as well combine lunch and breakfast together.</p><br/><p>“I’ll have a cheesecake and a cup of caramel macchiato.”</p><br/><p>“I’ll have a cup of water.”</p><br/><p>I think I got the message now. His family probably forced him to come. So, he didn’t want to set a good impression.</p><br/><p>“Why did you come?” I got straight to the point. He was forced and I was forced. It was unnecessary for both of us to pretend.</p><br/><p>“Why did I come?” Suyang thought about it. Then, he casually responded, “Because of my assistant.”</p><br/><p>“Your assistant? It wasn’t your family that forced you here?”</p><br/><p>“Nope, it’s because of my assistant.”</p><br/><p>“What did your assistant do?”</p><br/><p>“She didn’t stop me, so I came.”</p><br/><p>That was the strangest reason I’ve ever heard. <i>Because his assistant didn’t stop him?</i></p><br/><p>I began to feel curious towards this man.</p><br/>\n</div>"}