{"title": "Chapter 99", "id": 99, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-99", "volume_title": "Volume 1", "body": "<h1>Chapter 99</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 99: Heading to the television station again</b></p><br/><p>“Lame..” I mumbled. All of a sudden, I turned around and attacked Suyang. I quickly ran towards him and then grabbed his face, stood on tiptoes, and planted a huge smooch on his lips.</p><br/><p>His lips had a mung bean taste to it.</p><br/><p>Suyang was bewildered. His eyes were wide open like an innocent maiden. He looked dumbfounded.</p><br/><p>“What? You think you’re the only one who could make moves? And I can’t?!” I hugged Suyang with a proud smile on my face.</p><br/><p>As I embraced him, I suddenly remembered how I felt when I was a ghost. I was so horrified when I had discovered I couldn’t hold onto him. Hugging him like this really gave me a real sense of security.</p><br/><p><i>Most likely, Wen Yufan appeared because he was experiencing the same emotions that I was.</i></p><br/><p><i>Or perhaps, he wanted me to help him take care of Gao Jialan? But even if Wen Yufan had never appeared, I wouldn’t have been untouched after hearing her story…</i></p><br/><p>—–</p><br/><p>It was September. Global warming was already nothing new, but it was as if the weather wasn’t satisfied and wanted to roast us before Fall. Nowadays, the temperature reached as high as 40 degrees celsius.</p><br/><p>The moment you stepped out of a building, it was as if you had entered an oven. Even if you stood underneath a tree, it made no difference.</p><br/><p>These days, Suyang was addicted to eating ice-cream. He could literally eat ten a day. At this rate, ice-cream could be his main dish.</p><br/><p>“Stop staring at me with your pervy eyes!” Suyang commanded as he licked his ice-cream.</p><br/><p>“Boss…. Suyang… Xiao Su Su…..” I stretched out my voice and tried to sound as feminine and sweet as possible. Then, I gradually leaned towards Suyang with starry eyes, “What type of flavour do you enjoy eating? I see that you often choose green. Is it the apple flavour or the honeydew melon?”</p><br/><p>“I’m giving you an opportunity. Speak properly.” Suyang didn’t even bother looking at me. His eyes were glued to the TV the entire time.</p><br/><p>“Boss… I can see that we’re almost out of ice-cream in the freezer. Tell me what flavour you like, and I will instantly buy some for you!”</p><br/><p>“What’s with you today?” Suyang shifted his butt away from me. He purposely wanted to keep a distance between us.</p><br/><p>I followed him and pressed forward, “Tell me which flavour!”</p><br/><p>Suyang shoved the one he was eating towards me. He almost got it in my face, “Mung bean! I like the mung bean flavour! Okay?!”</p><br/><p>“Mung bean, right?! Your wish is my command! I will return very shortly!” I rushed to get ready. On the way, I nearly crashed into Gao Jialan. “Sis, I am going out for a bit. I will be back soon. Oh yeah, later, Suyang and I will not be eating at home. Just order takeout for yourself! Do it now?!”</p><br/><p>“What do you mean? I’m not going out today….” I didn’t let Suyang finish as I sped out the door at the quickest speed of my life. I stormed into the closest supermarket from the apartment and bought all the mung bean flavoured ice-cream on the shelves. Then, I dashed back home.</p><br/><p>It took less than two minutes. I think I broke a personal record. I panted as I collapsed by the entrance; exhausted.</p><br/><p>“I b-bought them all! M-mung bean….mung bean flavour!” I threw the bag towards Suyang and attempted to stand up. Sadly, the will was there but not the strength. I began to laugh like a crazy woman, “Hahaha….”</p><br/><p>Suyang gave me a look of disdain and threw an unopened package of ice-cream at me. Then, he went to put the rest inside the freezer. He probably figured I had an objective. So, he towered above me and stated, “Say it. What do you want?”</p><br/><p>“Hehe!” I love how he was so smart. “Let’s go to the television station today!”</p><br/><p>“I already knew you would never be sweet for no reason….you must have evil intentions. Why are we going to the television station?”</p><br/><p>I pouted and then looked at Suyang with shifty eyes, “It’s because of you. Last time, you said all those things without going through your brain. After thinking it through a few times, the best solution is to go to the television station to tell them to cut those parts out. That way, I can live with ease.”</p><br/><p>Suyang didn’t seem to care about my request. He sat back down on the couch and coolly responded, “I’m not going.”</p><br/><p>“Don’t be like this… who would recognize me if I go alone? Most likely, they won’t even let me get through the door….” I whimpered and tried to look pitiful. “Just go with me! Save a life!”</p><br/><p>“If you want to go, you can go yourself. It’s too hot. If I go out, I will melt.” Suyang touched his face, “I’m so precious. I cannot melt.”</p><br/><p>“Just go with me! Can you take into consideration I bought your favourite flavour of ice-cream?! As the saying goes, ‘You can’t eat someone’s food without doing a favour in return.'”</p><br/><p>“I wasn’t the one who told you to buy the ice-cream. Plus, I don’t care if the television station cuts what I said or not. Even if that part is cut off, it doesn’t matter. Because I have already publicly announced I am in a relationship with you. You’ve also made me public. So we are even!”</p><br/><p>I rolled my eyes at him and roared, “That’s not the same! By making you public, I’m helping you attract more fans. But by making me public…. it’s because.. because your brain isn’t working! Who would put their girlfriends where the wind and the waves are the fiercest? You don’t know how to protect a woman…!”</p><br/><p>“You don’t understand women….” Suyang shook his head in disappointment.</p><br/><p>“Ha?” I coldly laughed. Deep down I thought to myself, <i>you’ve been single all your life and you dare to say I don’t understand women? At least I am one! I already have an advantage over you, ok? </i></p><br/><p>“You’re really not going to go with me?” I confirmed one last time. Then, I stood up with dignity as I patted the dust off my butt.</p><br/><p>“Stop trying to make your face look like a bun to act cute. It’s useless against me. Because I’m much cuter than you.” Suyang imitated me and made a cute face, “If you want to go, then go by yourself. I. Am. Not. Going.”</p><br/><p>Then, Suyang laid down on the couch and closed his eyes to ignore me.</p><br/><p>“Rude!” I stomped and rushed out the door. While I was waiting for the elevator, I muttered to myself, “I don’t have to bring you. I could always try my luck. I don’t believe that no one would recognize me.”</p><br/><p><i>Damn that Suyang…</i></p><br/><p>I sat on the bus that would take me to the television station. Wen Yufan actually sat next to me and accompanied me. He was zoning out and staring straight ahead.</p><br/><p>“Don’t worry. I will take care of Gao Jianlan and her child.” There was no one on the bus, so I wasn’t afraid to speak to Yufan.</p><br/><p>Wen Yufan’s eyes appeared disturbed for a second. But they were calm again. He sat next to me like a wooden puppet.</p><br/><p><i>Was it because he didn’t trust me?</i> But after encountering so many ghosts, I was already used to their expressions. They weren’t like normal people. Most of the time, they were staring into space. I shouldn’t take it personally.</p><br/><p>After forty minutes or so, we finally arrived at the television station. The moment I tried to enter, a security guard stopped me.</p><br/><p>“Miss, you’re not allowed in.”</p><br/><p><i>I didn’t expect to be blocked before the main entrance?!</i></p><br/><p>“Why not?” I pointed at some people who were entering freely. They didn’t look like workers either, “Why can they enter?”</p><br/><p>The security guard hesitated for a second. Then, he said in a low tone, “Umm… Miss…we’re not allowed to let suspicious looking people enter.”</p><br/><p>I coolly laughed. I took a few steps back and looked up the 60 storey building. <i>Suspicious? </i>I touched my forehead. I wasn’t sure if it was the weather or I was heating up due to the security guard. I decided to sit right in front of the entrance.</p><br/><p>“If Suyang was here, this wouldn’t be happening…” I irritably mumbled as I waited for someone who recognized me to bring me in.</p><br/><p>“Miss, if you do this, you’re making my job very difficult….”</p><br/><p>“What am I doing? I’m not forcing my way into the television station! I can’t even sit down outside?” I raised my voice at the security guard and attracted a lot of strange looks.</p><br/><p>The security guard couldn’t do anything and left me alone.</p><br/><p>“How long do you plan to stay here?” It was abnormally hot. I began to gather my hair together as I fanned my clothes to cool down. Suddenly, Yufan appeared right in front of me and I felt a blast of cold air. My surroundings instantly became very refreshing.</p><br/><p>“You….!” I pointed at him. It was as if I had discovered China. <i>So it turned out the appearance of ghosts could be so cold…it was like having a portable A/C</i>…</p><br/><p>There were tears in my eyes. I got up and stood next to Yufan. Although it was deathly hot outside, I was no longer dying from the heat. The temperature was very cool around me.</p><br/><p>But it was kind of awkward standing next to each other in silence. So, I initiated a conversation.</p><br/><p>“I know you cannot speak, let’s figure out a way to communicate. You can just indicate yes or no. Raise your left hand to say no, and raise your right hand to say yes. Understand?”</p><br/>\n</div>"}