{"title": "Chapter 96", "id": 96, "volume": 1, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-96", "volume_title": "Volume 1", "body": "<h1>Chapter 96</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 96: Three months</b></p><br/><p><i>Seriously? Such a coincidence?! Speak of the devil! </i></p><br/><p>For a long period of time, I couldn’t shift my attention from him. My heart was beating so loudly like it was about to explode.<i> He didn’t even look at me, yet I felt so guilty?!</i></p><br/><p><i>It must be because of Gao Jialan. I can’t let her stay with us in such a shady manner anymore. No matter what, I must kick her out tonight! I can’t handle another epic drama of the wealthy… </i></p><br/><p>Before I could recover from this shock, Suyang’s interview was over. He came out of the television recording studio and made eye contact with me.</p><br/><p>“Are you alright?” Suyang smiled as he came over and wrapped his arm around my neck and pressed my head against his chest. Then, he vigorously dragged me out.</p><br/><p>“Hey! Suyang! Release me! There are so many people here!” I tried to escape from his grasp, but it was useless.</p><br/><p>“No…. I refuseeeeee…..” Suyang kept up with his shameless behaviour all the way until we reached the car.</p><br/><p>Using my thumb, I buckled up my seatbelt. I was pondering whether I should tell Suyang about my concerns.</p><br/><p>Suyang could see the stressful look on my face. After he buckled his seatbelt, he turned to me, “Are you still angry? I’m sorry I didn’t follow your wishes. But you exposed me to the public first. So let’s call it even.”</p><br/><p>He had misunderstood. He assumed I was upset about what had happened in the television studio.</p><br/><p>“You admit you’re wrong? I can’t believe you. You had already promised, yet you went back on your word.” Since Suyang initiated an apology, I might as well deal with this issue first.</p><br/><p>“Did you know how anxious and stressed I was? I had such a stupefied expression on my face. Your millions of fans probably burst into laughter when they watched the interview….”</p><br/><p>“Don’t worry. It’s not a live broadcast. Perhaps, they might not even show your part.” Suyang comforted.</p><br/><p>“Not a live broadcast?!” I exclaimed. Suddenly, I felt a glimmer of hope, “That means they could cut off the parts where you mentioned me? Awesome! If my part isn’t deleted, I will kill you!! I’m serious! You traitor!”</p><br/><p>I pointed at Suyang as I gave him my killer glare.</p><br/><p>Suyang spread his arms out hopelessly. He looked troubled, “I don’t get it. Does being my girlfriend make you this unhappy?”</p><br/><p>Suyang’s acting had always been impressive, but hearing him say this aloud made me feel slightly guilty.</p><br/><p>“I never said that! Stop overthinking. Hurry and drive so we can go home.” I patted Suyang’s shoulder to urge him. On one hand, I wanted to skip this topic. On the other, I wanted to get home as soon as possible. After all, there was a woman from an unknown origin in our apartment. I had a bunch of questions to ask her.</p><br/><p>The moment I entered through the doors, I saw Gao Jialan resting contently on the couch.</p><br/><p><i>Damn that woman… I had just gone through so much stress and shock, yet she dares to act so comfortable in front of me? </i>My eyes sharpened.</p><br/><p>I purposely went over and plopped down onto the couch with all my strength. Gao Jialan was surprised and awaken by my movement.</p><br/><p>Suyang had gone into his room to change, but he happened to walk out and witnessed the scene. He shook his head and mouthed the word at me, “Childish!”</p><br/><p>I had decided not to tell Suyang about the possibility that Gao Jialan and the Wen clan were related. I didn’t plan to let Gao Jialan stay, so there was no need to tell him.</p><br/><p>“You guys are back?!” Gao Jialan sounded very drowsy and her voice was a bit hoarse. “I’ve prepared lunch for you. Let me go warm it up now.”</p><br/><p>“No need. I’m not hungry.” I seized Gao Jialan by the hand, “Let’s go out to have a chat.”</p><br/><p>“Why do you have to go out to chat? Just chat here. There are no outsiders around.” Suyang “coincidentally” came over and squeezed his big ass in between me and Gao Jialan.</p><br/><p>Gao Jialan smoothly released my hand, but I was too slow. As a result, Suyang ended up sitting on my hand.</p><br/><p>Although he was sitting on my hand, Suyang acted as if nothing had happened. He turned to Gao Jialan, “We were quite busy this morning. So, I’m actually quite hungry. Please help us warm up food.”</p><br/><p>Gao Jianlan could detect the atmosphere in a second and hastily stood up.</p><br/><p>I gave Suyang a killer glare, “You. Are. Sitting. On. My. Hand!”</p><br/><p>I gritted my teeth as I growled each word. However, Suyang remained at the same spot. Regardless of how hard I tried to pull my hand out, it wouldn’t budge. He must be doing it on purpose!</p><br/><p>Hearing this, Suyang pretended to act shock. He slightly lifted his butt and teased, “Why are you touching my ass?”</p><br/><p>“What did you say?!” My palm was beginning to turn red. I didn’t know whether I should laugh or cry.</p><br/><p>“If you want to take advantage of me, just say it directly. We can go to my room. It’s kind of inconvenient in the living room….” Suyang began to nudge me with his shoulder. He was so shameless.</p><br/><p><i>He seriously never had a girlfriend before? How could he be so smooth?! I was no match for him….</i></p><br/><p>“Look at my cold face. Does it look like I want to deal with you right now?” <i>I must not react to Suyang. At this moment, that was the only path I could take. I must control myself. Control myself!!!</i></p><br/><p>“Time for lunch!” Gao Jialan’s voice echoed from the kitchen. Suyang bounced up and pulled me with him, “Time to eat. We were so busy, we didn’t eat anything this morning.”</p><br/><p>Originally, I wanted to protest and show my dislike towards Gao Jialan by not eating her food. But my stomach refused to listen and began to rumble. Ultimately, I couldn’t help but eat.</p><br/><p>Gao Jialan made a few simple dishes, but they were quite delicious. Unwittingly, I was already onto my second bowl.</p><br/><p>“Yixin, do you remember I used to cook back at the orphanage?”</p><br/><p>The moment Gao Jialan spoke, I put down my bowl. Then, I coolly stated, “I’ve already told you that I don’t remember my past. Stop trying to force me to remember.”</p><br/><p>“You forgot….” Gao Jialan lowered her head. As for me, I remained stiff for a long time. Suddenly, Gao Jialan went back to my bedroom and took something out with her.</p><br/><p>“This is all I have. I hope you can allow me to stay for awhile. I promise I won’t bother you guys for too long!”</p><br/><p>I stared at the 600rmb Gao Jialan put on the table. I didn’t know how to respond.</p><br/><p>“I know you’re thinking of all sorts of way to kick me out. I also know I shouldn’t be interrupting your lives. But I seriously hope you can allow me to stay for three months. Three months is all I need!” Gao Jialan was turning more and more emotional. By the end of her sentence, she sounded as if she was about to collapse on her knees at any moment.</p><br/><p>I rushed to hold onto her as I turned my eyes towards Suyang. I wanted him to say something, or perhaps give me a hint on what I should do.</p><br/><p>But through his soften expression, I could already tell he was leaning on Gao Jialan’s side. I knew I had lost my battle.</p><br/><p>“Take away your money.” I sighed as I sat back down.</p><br/><p>“I….”</p><br/><p>Gao Jialan still wanted to say something, but I cut her off, “Three months. The moment three months is up, you must leave. Also, if you cause us trouble within these three months, you’re gone.”</p><br/><p>“Thank you!” Gao Jialan grabbed my hand. Her eyes were filled with gratitude.</p><br/><p><i>Sigh. Originally, I was going to kick her out…. </i></p><br/><p><i>Why couldn’t I be more harsh? </i></p><br/><p>—-</p><br/><p>That very night –</p><br/><p>I was lying on Suyang’s arm and he was petting my hair. He asked, “Why are you so against on letting Gao Jialan stay with us? Based on your personality, you usually wouldn’t mind helping strangers.”</p><br/><p>“You think you know me well?! I am the cold and reserved type.” I lifted my head and gave Suyang a proud look.</p><br/><p>“Mmm…. I’m very good at reading people. Plus, I understand you more than you think. Just a bit more.” Suyang confidently boasted.</p><br/><p>I squeezed myself into Suyang’s embrace as I wrapped my arms around him. Suyang seemed a bit surprised, and his body stiffened.</p><br/><p>Suyang’s arms were very warm and I felt extremely safe. I took a deep breath and then burrowed my face into his chest. Then, I shared my deep thoughts with my eyes closed.</p><br/><p>“Let me tell you a secret. I actually remember Gao Jialan. At first, I honestly forgot about her. But gradually, those memories returned. During my time at the orphanage, I didn’t have any family or friends. The adults and the children alienated me. Regardless of where you go, people tend to bond over their dislike of a person. I was the person who was sacrificed….”</p><br/><p>“Yixin….” Suyang wanted to say something, but I stopped him.</p><br/><p>“Listen to me. Gao Jialan was a few years older than me. She had always been the leader of the children. I was extremely envious of her. She was always praised by the adults and worshipped by the children. But aside from envying her, I hated her even more. She would see me on the swings playing by myself, yet she wouldn’t do anything about it. When children targetted me, she would pretend not to see. Personally, she had never directly bullied or hit me. But I found her attitude of trying to stay out of it the most despicable….”</p><br/><p>I could feel Suyang tightening his arms around me.</p><br/><p>“You’ll never be alone again. From now on, I will stay by your side forever.”</p><br/>\n</div>"}