{"title": "Chapter 104", "id": 104, "volume": 2, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-104", "volume_title": "Volume 2", "body": "<h1>Chapter 104</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 104: Yixin’s childhood memory (Part 1)</b></p><br/><p><i>Life… There are always so many questions on life. </i></p><br/><p><i>What is life? What is the value of life? What are we living for? Is life predestined at birth? Who’s actually in control of life? </i></p><br/><p>These questions will probably remain unanswered throughout life.</p><br/><p>If I could control my life, I definitely would not have chosen this path. <i>Wait, actually, I’m not sure now that I’ve met Suyang… </i></p><br/><p>But prior to meeting him, I was very certain.</p><br/><p>Many years ago, I was my parents’ bundle of joy. The three of us lived happily together.</p><br/><p><i>When did the car accident occur? When I was three or four? </i>My memories were a bit fuzzy. That was the year I lost my parents.</p><br/><p>All my concrete memories began when I was living at the orphanage. I remembered the president of the orphanage, the teachers, and the children. I also had a special friend.</p><br/><p>I thought the world was like that. There were normal people, and there were some transparent people.</p><br/><p>“Why don’t you say anything?” I was building a sand castle as I questioned my friend who was always by my side. “Do you live nearby?”</p><br/><p>As usual, she didn’t respond. She silently watched me play.</p><br/><p>“Yixin, are you playing by yourself?” A female volunteer came over to chat with me.</p><br/><p>“No, I’m not by myself.” I smiled at her as I pointed to my friend, “We’re playing together.”</p><br/><p>Although I was a child at the time, I could see the volunteer’s face turning pale. She forced a smile as she trembled, “Yixin, where is your friend?”</p><br/><p>“Over here!” Back then, I didn’t understand why people would deny my friend even though she was right in front of them.</p><br/><p><i>Adults were so strange….they would say they don’t see things when it was clearly in front of them. </i></p><br/><p>“Yixin, why don’t we go play with the other children over there?” The volunteer forcefully grabbed my hand and took me away.</p><br/><p>I sadly turned to look at my friend. She waved at me.</p><br/><p>Based on the colour of the sky, the Sun was about to set. She was probably returning home now, right?</p><br/><p>“Bye bye! See you tomorrow!” I enthusiastically bid farewell to my friend. When I turned around, the volunteer looked very uncomfortable.</p><br/><p>That night….</p><br/><p>“Yixin is a very strange child. She keeps pointing to air and saying there’s someone there. Do you think she’s possessed? She could see spirits?” The volunteer muttered as she tidied up the toys.</p><br/><p>“Don’t make up stuff. Children just want the attention of adults. It’s not a big deal.”</p><br/><p>“I’m not the only one who thinks she’s weird…! Everyone thinks there’s something wrong with her too….” The volunteer retorted.</p><br/><p>“Hmm, it is a bit problematic if she doesn’t try to play with the other children at all. Give her more attention and care, I guess?”</p><br/><p>“You guys can do it. I’m not going to do anything! Who knows what’s around the kid? I’m scared!”</p><br/><p>I had eaten too much and was lazily trying to seize a butterfly. I happened to overheard that conversation between the adults. It was then I finally realized how “special” I was.</p><br/><p>I released my hand to let the butterfly go. The butterfly flew away with no hesitation.</p><br/><p>“So it turns out you’re scared of me too, huh? Just like the adults.” I whispered as I leaned against the wall and secretly observed all the other children who were playing together. I envied them and wished I was part of the group too.</p><br/><p>Initially, the words were only spoken amongst the adults. But very quickly, it entered the kids’ ears.</p><br/><p>Soon, not only did the children avoid me, they also began to target me.</p><br/><p>“Monster.”</p><br/><p>“Devil.”</p><br/><p>“Freak.”</p><br/><p>After hearing these words hundreds of times, I became accustomed to them. Fortunately, during that time, I was always in the orphanage, so I didn’t end up encountering other ghosts.</p><br/><p>However, my personality became more and more reclusive.</p><br/><p>I still had my special friend by my side though. I spent my childhood with her. But even though I truly believed in her, eventually I figured out what she was.</p><br/><p>However, it didn’t matter. She was always with me.</p><br/><p>I was about to start elementary school, but my “friend” was still the same size. I was already a head taller than her.</p><br/><p>When I started elementary school, I began to have more real life friends. From time to time, I would think of my ghost friend. I knew other people couldn’t see her. So when others were around, I would also pretend not to notice; I wouldn’t acknowledge her.</p><br/><p>But regardless, she would always follow me. Soon, it began to feel like I was being supervised and I didn’t like it at all.</p><br/><p>One day, I couldn’t handle it anymore and decided to end our friendship. I told her, “I know you do not belong in this world. I don’t need you anymore. Just leave!”</p><br/><p>She remained where she was and stared at me with no expression.</p><br/><p>At the time, the Sun was setting and the sky had been dyed red. I could hear the leaves rustling around me. A dead leave went through her body and landed calmly on the ground.</p><br/><p>She actually listened to my words and never reappeared again.</p><br/><p>She was forever gone from my life.</p><br/><p>That night, I pondered in the park for a long time. I was swinging on the swings.</p><br/><p><i>I did the right thing. In order to live a normal life, I must stay away from these ghosts. </i></p><br/>\n</div>"}