{"title": "Chapter 135", "id": 135, "volume": 2, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-135", "volume_title": "Volume 2", "body": "<h1>Chapter 135</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 135: Lin Yixin is back!</b></p><br/><p>“I already told you I’ve made up my mind to leave.” I took a look around the room as I smiled bitterly. I didn’t feel good saying this.</p><br/><p>“I’m doing it for Xiao Su. You understand, right? In the future, make sure you learn some spiritual techniques. The older you get, the easier it is for evil spirits to find loopholes to use you. You must learn to protect yourself.”</p><br/><p>“Before I met you, I was doing just fine. I can be alone…”</p><br/><p>“If you didn’t attract so many ghosts, I would’ve approved of you as my grandson’s wife.”</p><br/><p>“I want to apologize for not letting you know that Suyang and I had became a couple. I knew you were against us, that’s why I purposely didn’t say anything. I was afraid you would kick me out…” I held onto Grandmother Meng’s hand. I sounded both nervous and pained.</p><br/><p>“You can save those touching words when you’re Lin Yixin again!” Grandmother Meng rushed me, “We don’t have much time.”</p><br/><p>“Ok.” I was no longer emotional as I laid on the bed. My eyes stared at the design on the ceiling. Suddenly, my eyelids became heavier and heavier. Soon, my eyes were closed.</p><br/><p>This time, I knew what was going on. Although my eyes were closed, I could clearly feel my body turning lighter and lighter. It was slowly floating upwards like a cotton.</p><br/><p><i>Was I coming out of Anson’s body? I could finally say goodbye to being a man?! To be honest, these past few days were very inconvenient for me. Let’s not talk about the other stuff, just going to the washroom alone was veryyyyyy uncomfortable! </i></p><br/><p>It was actually a simple process. In no time, I heard Grandmother Meng’s loud snap and I woke up. I turned my head and saw Anson lying next to me.</p><br/><p>“Whew….” I touched my soft boobs and felt a breath of relief. I was back. The female Lin Yixin was back!</p><br/><p>The moment I tried to get up, I felt a burning pain coming from my right arm. “Pain pain pain! This….”</p><br/><p>“You forgot? Lin Yixin got shot on her arm! Now that you’re back, you must experience the pain.” Grandmother Meng seemed to be rejoicing in my misfortunes.</p><br/><p>“Even though it’s painful, I’m so glad to have my body back!” I grinned.</p><br/><p>“This is for you.” Grandmother Meng handed a piece of paper to me.</p><br/><p>“What is it?” I took the piece of paper and noticed an address was written on it.</p><br/><p>“This is where my Master lives. If you want to learn how to control your spiritual powers, then go find him. If you guys are destined to meet, you will be able to find him.”</p><br/><p><i>Not that I wanted to be rude, but</i>… “Grandmother Meng…your Master? How old is your Master?” I carefully asked. <i>Grandmother Meng’s Master was still alive?</i></p><br/><p>“People who have spiritual powers tend to live a long life. Let me see… my Master should be 102 years old this year! Is it 102 or 103?! Aiya, I am a bit confused myself.”</p><br/><p><i>Don’t worry about it. That’s pretty much the same thing</i>…</p><br/><p>I scrupulously put the paper away.</p><br/><p>“When are you planning to leave?” Grandmother Meng asked.</p><br/><p>“Now!? We only have an hour, right? I need to rush back to the hospital for Xialing.”</p><br/><p>“No, I’m not talking about that. I want to know when you’re leaving this city.”</p><br/><p>“Huh? I don’t know…is it that urgent? I will leave! Don’t worry!” I honestly didn’t want to continue with this topic. So I stared at the unconscious Anson and asked, “What’s wrong with him?”</p><br/><p>“I don’t think the child will be able to wake up.” sighed Grandmother Meng.</p><br/><p>“What?” I was stunned.</p><br/><p>“The child isn’t injured. He has sealed off his soul. How should I explain it? I guess you can consider it as a type of suicide? He chose to be a person in a vegetative state.”</p><br/><p>“So Anson is not going to wake up for the rest of his life?”</p><br/><p>“I’m not sure. It will depend on him. Sources say the child has committed many terrible crimes. I guess we’ll let him use his own method to settle the debt. Sigh. I’m partially responsible. Back then, if I had taught him the difference between right and wrong, perhaps he wouldn’t have ended up like this.”</p><br/><p>“Wow….oh yeah… Grandmother Meng, I hope you won’t mention my departure to Suyang when he comes in. Before I leave, I want to make sure we have no regrets.”</p><br/><p>“No regrets?” Grandmother Meng covered her mouth in shock, “What are you going to do to my precious grandson? I’m telling you, Suyang is a very innocent child! You better not corrupt him!”</p><br/><p>“Stop thinking in the wrong direction! Plus, you think your Suyang is innocent?!”</p><br/><p><i>Psssh. Suyang always act like a pervert. But I didn’t tell that to Grandmother Meng. I was afraid to give her a heart attack. </i></p><br/><p>“Isn’t it going to be more difficult for you guys to separate the longer you two stay together?” Grandmother Meng gave me a sideway glance.</p><br/><p>“No. We’re both adults. We know we should make decisions that are best for everyone. I just want to give myself some memories. After I leave, time will dilute everything… Suyang will be fine.”</p><br/><p>“Alright.” After thinking about it, Grandmother nodded in agreement. Her support meant more than words could say.</p><br/><p>I held onto my painful arm and ran out of the room. Suyang was standing near the couch very anxiously. I ran straight for him and fell into his arms. Suyang was caught by surprise. He didn’t seem to know how to react.</p><br/><p>“Hey! I’m already delivering myself to you and you’re not even holding onto me?” I grumbled as I lifted my head to glare at him.</p><br/><p>Suyang rubbed my head and lovingly murmured, “My goldfish has returned.”</p><br/><p>“Of course!” I behaved like a cute innocent bird and burrowed myself deeper in his arms.</p><br/><p>Grandmother Meng came out and coughed aloud. She reminded us we didn’t have time to linger around. We had to rush back to the hospital.</p><br/><p>When Suyang and I entered the hospital, Sheyu happened to be taking a nap while she was on guard. We entered the ward and Xialing was napping as well. We woke her up right away.</p><br/><p>Xialing opened her drowsy eyes and gazed at me and Suyang. She asked gruelingly, “You have switched back?”</p><br/><p>“Yes.”</p><br/><p>“Who are you guys?” Suddenly, Sheyu stormed into the room. Xialing was still lying on the bed!</p><br/><p>The three of us froze.</p><br/><p>“Oh? Y-you’re awake!?” Sheyu pointed at me. Her tone sounded warmer.</p><br/><p>“Uh… yes. I’m awake.” I awkwardly said, “Long time no see….”</p><br/><p>“Uh…” Sheyu took out a pair of handcuffs and handcuffed me to the handrail of the bed. “You’re a kidnapper and you’ve violated the law. So now that you’re awake, I must follow procedures.”</p><br/><p>Suyang stood in front of me. “Didn’t you say it’s fine as long as we revoke all her accusations? I am now revoking all of Lin Yixin’s accusations.”</p><br/><p>I gazed at Suyang’s broad back and secretly chuckled.</p><br/><p>Then, Xialing pressed the emergency button and called the doctor over to examine me.</p><br/><p>Sheyu informed her colleague and soon he arrived. He wanted to record an oral confession.</p><br/><p>“I’ve already told you guys many times! We were just playing. Who would’ve thought that the cops would take it so seriously and shoot me in the arm! But as a generous person, I will forgive you. Just pretend nothing happened!” I quibbled.</p><br/><p>“Bullshit! You guys called the cops! And you were holding onto a real gun.”</p><br/><p>“Yeah, you saw me! At the time, I was pointing the gun at me! I wasn’t pointing it at anyone else. You could say it was an unsuccessful suicide!”</p><br/><p>I watched as Suyang and Xialing were driven out of the room, “Plus, Suyang says he doesn’t wish to press charges. If I were really kidnapping them, why would he help me?”</p><br/><p><i>There’s no way I’m going to jail for what Anson has done!</i></p><br/><p>“You!”</p><br/><p>“If anything, you can say I was hindering business from operations. But there’s no way I’m going to accept kidnapping charges! I won’t accept it even if you kill me!”</p><br/><p>“This woman!” The police officer was so mad that steam was practically coming out of his head.</p><br/><p>“I don’t know what happened between you guys, but after the recording today, we won’t be looking for you anymore. You can be at ease and take your time to heal.” Sheyu told me after she walked her colleague out the door.</p><br/><p>“Really?”</p><br/><p>“Yes. Since the victim says not to investigate, we cannot file a case.” Sheyu took off her hat. “Honestly, I’m glad that this incident ended this way. I don’t know what happened but I trust you.”</p><br/><p>“Thank you!” I smiled and hugged Sheyu.</p><br/><p><i>I’m alive! I’m alive! I leaned on Sheyu’s shoulder and gave Suyang a victory sign “V”</i>!</p><br/><p>—–</p><br/><p>Everything went back to course and life continued. It was as if I had woken up from a dream. I was still me. I was still Lin Yixin.</p><br/><p>As for Anson, we found out from Xialing that Huaze Yuxiang was taking Anson back to Japan. Now that he was in a vegetative state, we didn’t think it was right to start a trial against him.</p><br/><p>As for my departure, I never brought it back up to Suyang again. Suyang didn’t say anything about it either. We pretended as if that part never happened. We continued living together. But I was only putting on an act; hoping that our separation will not come so soon.</p><br/><p>I realized my abilities to heal were different from ordinary people. Within a few days, I was able to move my arm at ease. Last time, the same occurred for my chest wound. The doctor praised me and said it was the first time he had met a patient that could heal so well.</p><br/><p>With each passing day, the weather was turning colder and colder. I would spend the entire day wrapped up in my blanket at home. Today, Suyang had something to do so he wasn’t home. So, I was looking up online flights while I was on the couch.</p><br/><p>Behind his back, I decided to depart the day after tomorrow at 10am. I bought the ticket to City B.</p><br/><p>I could hear the password being pressed. Suyang was back! I swiftly closed the ticketing booking site from my phone and lay on the couch as I pretended to be asleep.</p><br/><p>But through the blanket, I could smell fried chicken. It was mouthwatering. When I tried to focus on the aroma, my soul nearly flew away with it. I couldn’t hold it anymore and flipped open the blanket.</p><br/><p><i>No wonder the smell was so strong! Suyang was in front of me pacing back and forth with the fried chicken! He deliberately wanted to lure me. </i></p><br/><p>“Woah! It smells so good!” I sighed. Then, I snatched the box from his hand, “For me?”</p><br/><p>“You’ve already taken it. I can’t say it’s not for you….” Suyang sat next to me as he joked, “Eat less. You already don’t exercise enough. After eating fried chicken, you’re going to get even fatter!”</p><br/><p>“Hey! I’m a victim of gunshot wound! I’m a patient! I must eat something good to comfort myself!” I refuted.</p><br/><p>Suyang looked at me from left to right, “I swear, you’re quite good at absorbing bullets. You’re basically a reincarnation of a bullet sucking machine!” He smirked.</p><br/><p><i>…..as expected, the poisonous tongue Suyang was back. I miss the gentle and considerate Suyang</i>…..</p><br/><p>Based on his expression, he looked like he was going to say something else. Before he could say another word, I stuffed a chicken thigh in his mouth.</p><br/><p>I had a silly smile on my face, “Our author Su has been busy the whole morning. You must eat something yummy to replenish your physical strength! No more talking for you!”</p><br/><p>Suyang’s mouth was all greasy from the fried chicken. There was something sexy about it.</p><br/><p>As I ate the fried chicken, I suddenly recalled there was something that we never finished from the past. I wanted to make sure we did it before I left.</p><br/><p>I leaned over to Suyang and placed my head on his shoulder, “Do you remember back then you were going to write a love novel? We had a 24 hour date that we never finished!”</p><br/>\n</div>"}