{"title": "Chapter 141", "id": 141, "volume": 2, "url": "http://boxnovel.org/supernatural-girlfriend-chapter-141", "volume_title": "Volume 2", "body": "<h1>Chapter 141</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><b>Chapter 141: The aftermath</b></p><br/><p>“We’ve been waiting for you for so long! Everyone is here now. Let’s go!” Someone complained.</p><br/><p><i>Based on the situation, it was obvious that the punk had lied to me. I should’ve used my brain. Why would a big corporation hold a welcome ceremony for their job candidates? Lin Yixin! Use your brain! </i></p><br/><p>“Why are you dressed like this….?” Seeing how formal I was, one of the girls secretly asked me.</p><br/><p>“Ah, I thought today was the welcoming ceremony….” I awkwardly smiled as I touched my hair. Fortunately, I only bought a black dress. It didn’t stand out too much.</p><br/><p>“The company party is next week. Today, we’re just hanging out with the new hirees to get to know one another.” The girl kindly told me.</p><br/><p>“Then, where are we going?”</p><br/><p>“We’re heading to a BBQ shop! Apparently, there’s a very delicious BBQ shop around here.”</p><br/><p><i>BBQ shop?! I’m dressed way too formal for a BBQ shop</i>….</p><br/><p>I gave Guo Zijun an icy glare. He happened to turn around and made eye contact with me. He had a “if you can’t take it, then battle with me” face. My level of anger increased substantially.</p><br/><p>Suyang was correct. I had a fiery personality that never went away.</p><br/><p><i>Alright! Guo Zijun! You just wait! From now on, you’re my enemy! We’ll see who dies at the end!</i></p><br/><p>—–</p><br/><p><i>Alcohol is a scary thing.</i></p><br/><p><i>It wears a sparkling translucent mask. On the outside, it may seem pure. But deep down, it evilly grins as it watches its victims devour cup after cup. Gradually, it will steal their consciousness just when they least expect of it.</i></p><br/><p>I hadn’t touched so much alcohol since Xialing’s birthday. Usually, I would control myself. After all, I was always working. However, yesterday, the young hirees were very good drinkers. I ended up drinking far more than I had anticipated.</p><br/><p>“Ah… my head hurts!” I grumbled. I drank way too much last night. The moment I woke up, I could barely turn around. All my body parts ached.</p><br/><p>I gazed around my surroundings. <i>This….doesn’t look like my hotel room. Yet, it was so familiar….abnormally familiar</i>…</p><br/><p>I tried very hard to recall the sequence of events from last night. But my memories were only filled with loud noises and cheering glasses.</p><br/><p><i>This is bad. I couldn’t remember anything after the alcohol. Where am I? Who brought me here? </i></p><br/><p>When I attempted to dig through my memories again, someone suddenly tugged the blanket.</p><br/><p>Instantly, my body stiffen.</p><br/><p><i>Who was behind me? What the heck? Wait a sec…why am I naked? </i></p><br/><p><i>Oh God! Oh Heavens! F**k my life! Don’t tell me last night I ended up in bed with someone after I was drunk!?!??! </i></p><br/><p>I began to have a mental breakdown as I gripped my hair with both hands. I looked like I was going to pull all my hair out. Then, I gulped down my saliva and anxiously turned my head to stare. I wanted to confirm there was actually a person next to me.</p><br/><p>I reached out my shaky hands and gently lifted the corner of the blanket.</p><br/><p>It was a man with an angelic face. <i>Su..yang?</i></p><br/><p><i>Could we have…the two of us….last night….AH!?!?!?! What?! HOW!?!??!?!?!</i></p><br/><p>“Are you alright?” Suddenly, Suyang’s hazy voice appeared in my mind. It seemed to be part of last night’s missing snippets.</p><br/><p>I wanted to scream, but luckily, I covered my mouth just in time to drown out the sound. Suyang was still deep asleep, but I couldn’t think anymore. The only solution was to leave the scene as soon as possible!!!</p><br/><p>I sat up but my bones wouldn’t stop crackling each time I moved. I was so afraid to wake Suyang that I held in my breath.</p><br/><p><i>Where were my clothes?! Clothes!!?!?!?! </i>I looked all around the bed. Eventually, I found a pile of clothes all piled up on the messy floor. Then, I stared at the walls around me. The walls were covered with anime posters and the cabinets were stuffed with action figures. <i>My intuition was correct. This was Suyang’s bedroom! </i></p><br/><p>I got out of the bed and considered my current state. I had no idea when Suyang was going to wake up. So, I snatched the pile of clothes and dashed into the washroom as quickly as I could.</p><br/><p>Then, I wrapped a towel around my body and sat on the toilet as I began to pick out my clothes from the mess. All of them reeked of alcohol.</p><br/><p>I finally found my cell phone in my pocket and checked the time. It was only 6 am or so. I still had enough time to return to the hotel and shower.</p><br/><p>After I put my clothes back on, I secretly poked my head out of the washroom door. I walked quietly on tiptoes towards the entrance. Just before I left, I glanced at Suyang’s bedroom. He was still in a deep slumber.</p><br/><p>I leaned against the door frame and had a blissful smile on my face. But a second later, I snapped out of it. <i>What am I doing? This is not the time!</i></p><br/><p>On my way back to the hotel, I was in a zoned-out state the whole duration. I leaned my back against the taxi seat as I stared outside the window. Based on the throbbing pain from my lower region and how sore I was, we must have done something very intensive last night.</p><br/><p><i>But how did I end up in his bed after the party? It didn’t make sense! </i></p><br/><p>Before I could solve this riddle, the taxi had already arrived back at the hotel. I hurriedly got off the moment I paid. I didn’t want to see the subtle smile that the taxi driver kept throwing me.</p><br/><p>I looked like filth. Fortunately, there was still two hours before work.</p><br/><p>I knelt in front of my bed and questioned my life.<i> How can I return to work after this? I’m definitely going to encounter Suyang at work! What should I say? I don’t even know what happened last night….what could I say?</i></p><br/><p>The more I thought about it, the more scared I became.</p><br/><p><i>Should I just not go to work? </i></p><br/><p><i>No no! If I do that, it means I’m definitely guilty! The new hirees must know something?! I’ll just ask the friendly girl. She doesn’t seem to be the scheming type. Maybe I could find out from her what happened.</i></p><br/><p>After making up my mind, I went to shower. But there was another problem. Suyang made so many marks and scars on my body. <i>It was so visible! People would definitely notice it at work. What should I do? </i></p><br/><p>I had no choice but to put on a high collar shirt to hide it. It will be hot, but it was better than letting people see the hickeys.</p><br/><p>Even the side of my cheek were a bit red. <i>Did he bite my face too? What the f**k!</i> I had to use a bandaid to cover it. Then, I tidied up everything and went to work.</p><br/><p>When I went to my cubicle, I couldn’t sit still. I kept looking around. Suyang wasn’t in the office yet. I decided to head to another department to find that nice girl from yesterday. Sadly, she was nowhere to be seen.</p><br/><p>Just as I was about to return back to my department, I turned around and noticed Suyang turning out of the elevator. I was so scared that I quickly hid under an office table next to me.</p><br/><p><i>He shouldn’t have seen me, right? Right?! </i></p><br/><p>I was still panicking so I decided to take a peek. <i>Great. There was no one there. </i></p><br/><p><i>But oh no!! It’s over! It’s over! It’s over! </i>I said it three times on the inside.</p><br/><p><i>Suyang came to work! How am I going to face him!?!? I have no face! Ahhhhhhh. I should just go home! When I say home, I’m talking about City B! I will transfer this case to Xialing. Ah shit! I can’t because Suyang knows Xialing. I’m going to make Jia Wenwen replace me!</i></p><br/><p>“What are you doing?” While I was still in panic mode, someone appeared behind me. I swiftly turned my head around. It was the woman that led us on a tour yesterday; sister Luo.</p><br/><p>She surprised me and I harshly bumped the back of my head against the corner of the table.</p><br/><p>“I came to find one of the new hirees. But she doesn’t seem to be here… haha.. I’m going to return now! I’ll come find her later.” I rubbed my head and tried to remain calm. <i>She must think I am super weird. A job candidate from the marketing department was lying underneath the table of the finance department. She might even assume I’m trying to steal something</i>…</p><br/><p>Luo Zhen didn’t seem to be letting me go. She stared at me; up and down. Then, she mumbled, “Your clothes….”</p><br/><p>I wasn’t sure what she was going to say next. My heart was about to leap out of my throat.</p><br/><p>“You have great taste in clothes.” She patted my back, “Many job candidates dress differently from you. They’re always wearing the same type of suits. I’m sick of it. In the future, continue to dress like this. I like your style.”</p><br/><p>“Ah…” I was scared for nothing. I quickly smiled, “Thank you, sister Luo. I will be returning to work now.”</p><br/><p>“Ok. Go!”</p><br/><p>While I was leaving, I turned to ensure that Luo Zhen wasn’t watching me anymore. It was only then that I felt a breath of relief. Along the way, I bumped into Guo Zijun.</p><br/><p>He probably knew what happened last night. But seeing how he tried to set me up yesterday, I didn’t trust him.</p><br/><p>“You injured your chin area?” He acted like nothing had happened between us as he made casual conversation.</p><br/><p>“Yes.” I coldly replied.</p><br/><p>“How did you hurt yourself?”</p><br/><p>“Umm.. this morning, I accidentally cut myself while I was shaving my beard.” I gave Guo Zijun a fake smile. Then, my smile vanished.</p><br/><p>Guo Zijun actually believed me. He continued to follow me around as he asked more questions, “You have a beard? Do you have to shave your beard every morning? That’s so crazy!!”</p><br/><p>I wanted to ignore him so I turned and directly looked into Suyang’s office. Suyang also happened to be looking at my direction.</p><br/><p>The moment we made eye contact, my heart was beating so fast that it probably broke my life record. My eyeballs turned the other direction before my head did.</p><br/><p>“Oh yeah, did you get home ok last night?” Guo Zijun asked.</p><br/>\n</div>"}