{"title": "Chapter 2 Red Grace Inn (2)", "id": 2, "volume": 1, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-2-red-grace-inn-2", "volume_title": "Volume 1", "body": "<h1>Chapter 2 Red Grace Inn (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Red Grace Inn (2)</p><br/><p>Brennan Charlando didn’t give off any impression that he was the owner of the inn. Ignoring the endless chatter of the head serving girl, Louise, he took a few beast skin parchments, knelt on the floor and rummaged around the rattan box, the beast skins as well as the bags, as he mused:</p><br/><p>“Two pieces of Dark-scaled Rhinoceros skin, this is Throm the Armorer’s order…”</p><br/><p>“Five pieces of Crimson-eyed Black Fox skin, for old Park from the leathersmith’s…”</p><br/><p>“Three pieces of Gold Python skin, Jason from the weaponsmith’s needs these to make scabbards…”</p><br/><p>“One Striped Wildebeest’s tendon, Jecks wants to use this as a bowstring…”</p><br/><p>…….</p><br/><p>“What is this?” said Charlando as he lifted up a greyish-white, meter-long bone.</p><br/><p>Lorist put down the roasted goose and said, “It’s a legendary Razorbeak Owldragon’s humerus that is used by the indigenous Remandotu people on the island as staves. It’s both light and tough. I believe Sir Maleiff asked for this.”</p><br/><p>According to legend, the Razorbeak Owldragon came about thousands of years ago from experiments conducted by ancient magi by cross-breeding nightowls and draconians, which resulted in the creation of a large flying beast that was savage and adept and combat. Only, it has already been extinct for a long time. The only complete skeletal specimen was only found a hundred years ago at the Relic Islands by an expedition team sent by the Magi State. It was named as such due to its seemingly large body and razor-sharp beak.</p><br/><p>Sir Malieff was one of the more high-ranking regulars of the Red Grace Inn. Rumored to be a noble from some faraway republic, he came over to Morante City and lived a life of seclusion in a house near the inn, citing his hatred of war as the main for his leaving his country. He is a man who likes to collect weird and eccentric items.</p><br/><p>“Oh.” That’s just another one of Sir Maleiff’s eccentricities. Placing the bone down on the floor, Charlando took out a leather pouch that contained several test tube-like glass containers which contained liquids of different colors. “What about this?”</p><br/><p>“Seven types of magical beast blood, as request by Professor Simpkin of White Rose Academy. He said he got an ancient tome that detailed a recipe for a potion that required the blood of these magical beasts. He wanted to see if he could synthesize the potion mentioned in the book,” explained Lorist.</p><br/><p>Only now did Charlando notice the small labels at the bottom of the containers, with names of various magical beasts, including, Dark-gold Pythons, Greenback Direwolf, Dark-scaled Rhinoceros, etc.</p><br/><p>“That old guy Simpkin sure has a lot of money to throw around. Replicating a potion? That’s ludicrous! Mana doesn’t even exist anymore, and the magi are not faring any better. How can you make potions without mana?” mused old Tom as he shook his head incessantly.</p><br/><p>“Then what about this thing?” Charlando waved around a large, sealed bamboo container that was almost a meter long. Sounds of flowing liquid could be heard as he shook it around.</p><br/><p>“Erm……” mumbled Lorist, embarrassed. He hesitated a moment before replying “That’s some Terrence-donkey Whip I got for Els……”</p><br/><p>The Terrence-donkey Whip was a native product of the Relic Islands which was famous for being a potent sexual stimulant. It was very popular among the nobles, especially the men whose sexual potency withered early.</p><br/><p>“Pffft!” Upon hearing about Els’s request, Louise laughed her guys out nonstop.</p><br/><p>Charlando looked grim. “What is wrong with him… This little runt using aphrodisiacs at his ripe young age… Skirt-chasing all day long without actually doing anything useful… I gotta teach him a lesson! Leave that with me and tell Els to see me when he asks about it.</p><br/><p>Els, or Brennan Evanport, was one of the syndicate heads three districts away. He was a Two Star Silver Swordsman as well as Charlando’s one and only family member; his nephew.</p><br/><p>The table was cluttered with utensils and plates. Finishing what’s left of his ale and burping in satisfaction, Lorist called for McDuffin to clear the stuff up. “Big sis Louise, go see if old man Luke from the back street is busy. If he isn’t, I’d like to get a haircut and a beard trim. Oh, and, get me a room upstairs and prepare the bath for me. And, please get the clothes in the rattan box washed and go buy me some new ones at Auntie Misha’s as well. Put that bill on my tab.”</p><br/><p>Old Luke packed his tools and came over with little delay. At this hour, there was usually little to no customers for the barber shop behind the inn. Putting a black linen cloth around Lorist, and placing a shiny silver mirroring plate on the table that was just cleaned up by Louise, Luke took up his scissor and walrus tusk comb and asked, “Would you like your usual cut?”</p><br/><p>On the Grindia Continent, nobles from certain countries were expected to wear a certain hairstyle to differentiate themselves from the commoners. There was no rule for commoners though and they chose whatever hairstyle they liked, though sometimes hairstyles like ponytails gained popularity and many people followed suit. Aside from the slightly inferior barber tools, everything else pertaining to hairstyles were pretty much the same with that of Lorist’s previous life.</p><br/><p>Lorist has always preferred a crew cut for two reasons: In his previous life he served as a soldier for seven years and it has become something like a habit to him. It was also much easier when it came to styling his hair.</p><br/><p>“Yup, I’d like the usual,” replied Lorist as he straightened himself in his seat.</p><br/><p>Old Luke cleared his throat and said, “Actually, Locke, your hair is very lush and black. I bet you would be able to easily charm countless young maidens if you kept a ponytail.”</p><br/><p>“Get out, that kind of hairstyle requires so much effort to maintain. It’s too much trouble. By the way Luke, why don’t you tell me about the things that happened here during the past six months?”</p><br/><p>Old Luke loved to gossip when he gave haircuts. He was very well versed with the rumors and stories being passed around in the local grapevine.</p><br/><p>Luke made a thoughtful expression as he continued tending to Lorist’s hair. “Well, it’s been pretty much the usual. Two months ago, Lind, the one who runs the roadside fruit stall, had his stall run over by a startled horse. Despite that, the owner reimbursed him with four gold Fordes and he even profited from that incident. Just last month, Watt the butcher’s wife got into some trouble with a mercenary. The funny thing is: the mercenary actually got slashed in the shoulder by Watt, a person who hasn’t even awakened his Battle Force! What a joke!</p><br/><p>“Idle gossip aside, three months ago it was announced on the newspapers that the war in the north finally ended, most of it thanks to the various trade unions slaving away for two years nonstop. A peace treaty was signed and the northern market seemed like a gold mine to many. For two whole months the papers were filled with recruitment notices for mercenaries and northern business investment advertisements. There were also multiple reports of people getting attacked by bandits though.”</p><br/><p>“Oh, the Krissen Empire finally stopped attacking?” Lorist really didn’t expect such a big historical event occurred in the six months he went on the expedition. As for the peace treaty, nobody really treated it seriously as the Krissen Empire had been enemies with the Forde Trade Union for more than a century, during which at least three major conflicts erupted between the two powers. Why would the Trade Union bother to settle anything, given that the empire had already began to tear itself up since the start of the power struggle between the three princes for the throne of the late Krissen Emperor six years ago? It was already a blessing that the union did not take advantage of the empire’s situation.</p><br/><p>“What does the treaty entail, exactly?” Lorist was very curious about the specific agreements between the two powers. The northern empire’s princes and dukes has been at odds with each other for almost six years now, uprooting the once stable foundations of the empire and crippling the economy, causing much poverty and famine. Even the nobles had to rely on loans to maintain daily life. If anything, it was much more believable for the trade union to have been involved in putting the empire into this predicament.</p><br/><p>“Hmm, I really didn’t pay much attention to the details of the treaty. I’m just a barber, you know. I’ve never really been into these confusing political things…” said old Luke with a blush.</p><br/><p>“I know about it!” beamed old Tom with a bright smile. As a retired postman, he has always liked to pay attention to the political undercurrents on the continent. “There were three main clauses. First, the empire is to be partitioned into three kingdoms and seven grand duchies. In other words, the Krissen Empire has ceased to exist and there will no longer be any northern invasions. Secondly, the stability and security of the trade routes are to be maintained and taxes will remain the same for all nations, regardless of whether they are kingdoms or duchies. Additionally, the subsidiaries of the trade union shall be allowed to conduct business freely in any territory. The third clause states that the trade union is to give loans to the seven nations with different interest rates ranging from 13 to 70 percent depending on the nation.”</p><br/><p>“Brother Locke, aren’t you a northerner yourself? I remember you riding in a carriage with some kind of insignia, usually the kind used by nobles. Given that the war is no longer ongoing, wouldn’t you like to go back to your hometown for a visit?” said McDuffin as he reminisced the time when he first met Lorist in front of the academy entrance ten years ago.</p><br/><p>“Locke, are you really a citizen of the Krissen Empire? A noble at that?” exclaimed old Luke with a surprised tone.</p><br/><p>Back when the Krissen Empire was still standing strong, conflicts between the empire and the Forde Trade Union were common and battles frequently happened on the Falik Plains. Many of the soldiers were led by the nobles who really caused the folks of the trade union a lot of grief. Although not everyone in Morante City would actually assault anyone of the empire, nobody had any good impressions on them either.</p><br/><p>“To be precise, I came from the northern parts of the Krissen Empire; I’m a northern highlander. The highlands should be located thousands of kilometers from here, which is way too far and impractical for soldiers over there to come over. The march itself would take more than three months. My father was a baron and his barony was situated in the far north. I have an elder brother as well as a younger brother. I guess that makes me the second son, which means I won’t be inheriting the barony at any rate. The fact that I’m so far out here means that my family has abandoned me. I’ve had to rely on myself for seven whole years since I lost all contact with them. That’s why I now consider myself a Moranite and have nothing to do with the north or my family anymore,” explained Lorist.</p><br/><p>“That’s right. Many nobles send away every child but the heir to the land to prevent infighting and strife, usually by means of exile, separation or marriage. Locke’s case is pretty common. After all, his family does have a hereditary title,” appended old Tom.</p><br/><p>Luke worked quickly and finished the haircut as well as the shave. He ended the session by applying a final layer of oil to moisturize the skin.</p><br/><p>Lorist stroked his clean-shaven chin with satisfaction and paid old Luke a small silver coin. He subsequently asked McDuffin to get Luke and Tom a glass of ale and put it on his tab. He took his swords and went upstairs with Louise.</p><br/><p>There were eight rooms on the second floor of the inn, four on each side of the corridor.</p><br/><p>As they arrived on the second floor, loud sounds of men and women during intercourse resounded throughout the corridor.</p><br/><p>Lorist asked with much curiosity, “Who is the one getting it on at this kind of time?”</p><br/><p>“That’s Jumile. She picked up the three Blackbear brothers from the streets for seven large silvers. They’ve been at it for three hours or so. I wonder if she can still get up tonight.”</p><br/><p>“Jumile was also one of the serving girls of the inn. As for the Blackbear brothers, Lorist knew for a fact that all three of them were low-ranked mercenaries, usually only working on short escort missions and miscellaneous tasks for others. All three of them were burly and tanned and people started calling them the Blackbear brothers and eventually, the name caught on and stuck.</p><br/><p>Louise brought Lorist to his room, which was situated at the far right end of the corridor. The bathtub was already set up and filled with hot water.</p><br/><p>Taking out a pink fragrant bar of soap and a white linen cloth, she subsequently collected the clothes on the ground and placed the wallet, the sword belt and the waist bag on the table and was just going to leave, before turning back and asking, “Locke, are you free on the night three days from now?”</p><br/><p>“I don’t know, what for?” Lorist popped out from the water and took a deep breath.</p><br/><p>“There’s this girl from the village who wants to work here as a serving girl. She’s looking to sell her first time for quite the sum, about two gold coins. Since you’ve made quite a profit this time around, why don’t you help me out?”</p><br/><p>“Hm? Doesn’t the inn already have you, Jumile, Shala and Nina? Is it going to hire another one?”</p><br/><p>“Nina just got married last month and isn’t coming back. The girl from my village is also going to work here for two to three years for some money before going back to the village and finding someone to marry. I promised her that her first client would be a handsome and magnanimous young lad. Come on Locke, help me out, won’t you?”</p><br/><p>“I… I’ll think about it later,” said Lorist in an awkward muffled voice and submerged his head back into the bathwater.</p><br/>\n</div>"}