{"title": "Chapter 27 Final Preparations", "id": 27, "volume": 1, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-27-final-preparations", "volume_title": "Volume 1", "body": "<h1>Chapter 27 Final Preparations</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Final Preparations</p><br/><p>\"Thanks brother. Just let him work as your personal assistant and teach him some swordsmanship whenever you're free. While that kid is wild and stubborn, he's not that bad and gives it his best when he works. I'll feel more assured if he's by your side and not causing me any more worry,\" said Els with a face filled with gratitude.</p><br/><p>Lorist waved his hand and said, \"Hehe, no worries. It's not like we're strangers. Not to mention, I have just moved into the Gold ranked instructor residential area recently. Given the size of my new home, I could really use some extra help. It's thanks to you I won't have to hire anyone else.\"</p><br/><p>\"Oh, I feel like I'm forgetting something else...\" Having thanked Lorist for agreeing to take that kid in, Els seemed like he was trying hard to recall something else.</p><br/><p>\"Hmm... When I was walking past here with Jindoz, Uncle Girald told me that you've returned. That's when I decided to come over. What did Jindoz say when he heard about your coming back? I think it was about brother Laude... The next district... Representative Wombart... Could it be about that perverted old freak!? Ah! I finally remember!\" exclaimed Els.</p><br/><p>\"Hehe, my dear brother Locke, did you bring the goods I asked for back from your Relic Islands expedition?\" said Els with a wide grin as he stretched out both his hands.</p><br/><p>\"Oh, you mean the Terrence-donkey Whip? I went through great lengths to get that for you... But that uncle of yours confiscated it. He said that you often neglect your training and play with women all day long and was quite pissed that you even dared to attempt to consume aphrodisiac... That's why he took that with him and asked you to go get it from him yourself,\" said Lorist as he repeated what Charlando had said to him.</p><br/><p>\"What? My uncle has the goods?\" said Els as he started in shock. \"Nonsense! My sexual prowess is still robust and well! That meddling old man... Causing trouble for me all the time... I actually got that for that lewd old man Representative Wombart! Now that the other two districts' boss, Isidor, is retiring, I have negotiated with him to take over the management of the districts. I only need to satisfy the council representatives' regulations to get things going.\"</p><br/><p>Seeing Els freak out like that, Lorist laughed for a while and continued, \"Sigh, Els... Didn't the city management set a rule that one syndicate cannot be in charge of more than three districts? You already have three under your wing, now you're thinking of taking up another two? Why would the city council agree to that?\"</p><br/><p>\"This was all Jindoz's idea. He suggested that we have brother Laude take action and have half of our crew and Isidor's crew to form another syndicate to manage the extra districts. On the surface, it will be managed by two different syndicates. However, it will actually operate as one,\" explained Els all in one go. \"That Wombart fellow is really hard to handle... Even though I've given him a hundred gold coins, he still won't promise me anything and only said that he'll give it a try. Later, after I heard about the miraculous effects of the Terrence-dokey Whip from one of my subordinates, I asked you to bring one back from the Relic Islands. I had really hoped that after consuming that medicine, Wombart would die after playing around with more women than he can handle.\"</p><br/><p>While Els casually cursed Wombart to death, he naturally didn't mean it literally. If that were to happen, it would only cause more trouble to him and force him to bribe some other council representative instead.</p><br/><p>Lorist thought for a bit and came up with an idea. When he purchased the Terrence-donkey Whip from the Relic Islands, he had heard that only a small, thin piece was enough for a man to get it up throughout the whole night. The amount he brought back was enough for 200 such slices. Lorist planned to cut them up into pieces, pack ten or so slices inside nice glass jars and pickle them with some other medicinal wines to make it a premium and expensive looking novelty that would also serve as an excellent as a gift. The most important part was only putting enough of the donkey whip in each jar, unlike Els, who had planned to give the whole thing to Wombart. The whole thing was enough to last a person for three whole years! It would be extremely hard to ask favors from Wombart anymore if his expectations rise from that extravagant gift.</p><br/><p>\"Wow, why didn't I think of that? I didn't know that you're quite the schemer yourself,\" said Els happily. Lorist's suggestion opened up a whole window of opportunity for him. He instantly came up with an even grander plan, \"Maybe we can start a whole business out of this... Next time, we'll send people to the Relic Islands to buy up all of these Terrence-donkey Whips, even if they're at three times market price, slice them up, and package them nicely before selling it out! It would definitely be a money-making business. Only, procuring glass jars would be a little troublesome.\"</p><br/><p>Lorist nodded at Els's concern. Only two kinds of glass could be found on the Grindia Continent. The first type was green glass: it was a murky green-colored glass that doesn't have good transparency and was commonly used for making windows due to its low price point. The other type, oil glass, was far clearer and transparent and was usually picked to make glassware such as wine glasses and bowls. Though, the price of that material was far more expensive in comparison.</p><br/><p>These two types of glass were products produced only by the Forde Trade Union's southern neighbor, the Teribo Kingdom, because the material required to make the glass could only be found at the largest quartz mountain within the kingdom. The production method of either glass was a national secret and was tightly guarded to prevent leakage. According to the legends, back in the magic civilization, the magi used their mystical powers to produce glass which far exceeds glass today in terms of quality. It was a shame that the techniques used in the past had vanished in the end days of the civilization.</p><br/><p>One magus, however, had managed to devise a method to produce green glass and oil glass without magical formations and passed the secrets of its creation to his descendants. When the Teribo Kingdom was formed, the descendants of the magus gave the production method to the king and had their family status elevated to that of a duke's. The Teribo Kingdom had been exporting their glass products to the rest of the continent ever since.</p><br/><p>After inspecting the two types of glass, Lorist thought that the reason green glass had such a high opacity was due to the impurities that were not removed during the production process. Why then, had the glass production techniques of green glass not improved over the years to get rid of that problem? The fact that the quality of green glass had remained unchanging all these years was an intriguing mystery.</p><br/><p>As for oil glass, it was something that Lorist had never seen before even in his past life. It looked a lot like the common, clear glass in his previous world, but it had a 'slippery' quality that caused nothing to be able to stick on it. It was said that the 'slipperiness' of the glass made it the ideal material to make laboratory apparatus for the magi given that it was easy to wash and clean. The see through quality of the glass also made it easy for the magi to observe the changes going on within the apparatus.</p><br/><p>In one of the experiments Lorist did, he tried to coat an oil glass test tube with a strong adhesive. After it dried up, he picked the test tube up and gave it a light shake or two. It only took a while before the dried adhesive fell off the test tube like crumpled old paper.</p><br/><p>This peculiar quality also caused Lorist quite a headache when he was deliberating between the two types of glass to use for the windows of the boutique. Green glass couldn't display their clothes with their full glory while oil glass couldn't be easily made into flat sheets. Lorist only managed to solve the problem by asking a few craftsmen to carve up a piece of large crystal into a flat sheet to be used as the window and used the crystal shards as decorations for the chandeliers inside the shop, spending more than ten gold coins in the process.</p><br/><p>\"Currently, oil glass test tubes usually cost around one large silver each while oil glass tea sets can go up to one gold coin per set. Maybe you can go ask someone to make a jar prototype and ask for a price quotation from the producers in the Teribo Kingdom? As long as it's lower than 1 gold coin each, it will be fine. You can just consider that part of the production cost. In marketing, the most important part is the packaging. As long as it looks expensive, people will be willing to pay a high price for it,\" said Lorist.</p><br/><p>\"Hm, now that you said it, it does seem like it will sell well. Alright, I'll be heading straight to the inn just in case that old guy uses up that medicine!\" Els said impatiently and prepared to rush over to the inn to demand that item from Charlando.</p><br/><p>Lorist laughed as he called out, \"Come on, Charlando won't need something like that! While he may be quite harsh on you at times, he's actually looking out for you in his own way. Oh, and don't forget to hand 18 gold coins over to him when you take it. I'll get it from him later.\"</p><br/><p>\"Oh, there's one thing that you might have not heard about yet. Last month, that old uncle of mine actually proposed to Louise, and she agreed! In another two months, she'll be the female owner of the Red Grace Inn. To think that 60 year old man would decide to settle down, the fact that Louise agreed despite their age difference was surprising too. That's why I was so worried about leaving the aphrodisiac with him!\" exposed Els.</p><br/><p>\"Is that true?\" Lorist instantly sat straight.</p><br/><p>\"Of course. Everyone already knows since a month ago. Maybe they just forgot to bring it up while you were there,\" said Els.</p><br/><p>Lorist sincerely felt happy for Louise when he heard that she was going to settle down. While Charlando was already rather old, he was a pretty good man who was still in decent physical shape given his abilities as a Gold ranked swordsman. Maybe Els would have another younger cousin brother or sister in the years to come.</p><br/><p>\"It seems that I'll have to go look for a congratulatory gift for the two of them,\" muttered Lorist.</p><br/><p>\"There's no rush, the ceremony's in another two months. Help me pick one out for them too. I'm too busy to be bothered with stuff like that,\" Els said. \"I'm going to the inn now. Will you be tagging along?\"</p><br/><p>\"Nope, I'll spend one last night in this room. Do send 2 coachmen here tomorrow to help me move my stuff back to the academy and get that kid who wants to learn swordsmanship to come along too.\"</p><br/><p>\"Alright, I'll take my leave now then.\" Els slipped into the shadows silently and the room returned to its former tranquility, as if no one else other than Lorist had been here all along.</p><br/><p>......</p><br/><p>The sky slowly brightened as the city dwellers woke from their slumber one by one. The streets slowly filled with people and horses as Morante City started the day with renewed vigor.</p><br/><p>Lorist slept on the table throughout the night. He let out a smile after seeing the moonlight recede from the room as the twin moons disappeared in the sky whilst the bright morning rays shone through the horizon.</p><br/><p>It was a new day for a fresh start.</p><br/><p>The voice of servants talking could be heard downstairs. After a while, a knock resounded on Lorist's door.</p><br/><p>Lina came in with another female servant. The two of them served Lorist a large helping of breakfast just like they did for the past three years.</p><br/><p>Lina seemed like she cried for the whole night given her puffy eyes.</p><br/><p>The other servant exited the room and left Lina and Lorist in the room together.</p><br/><p>Lorist looked at those puffy eyes and resisted the urge to laugh. \"Why didn't you rub your eyes with some eggs? It helps with the puffiness.\"</p><br/><p>\"I'm alright. I was just too busy that I forgot,\" said Lina as she turned away, not wanting Lorist to look at her face.</p><br/><p>\"Sigh...\" Lorist stood up, went to his bookshelf and took out a thick book that was wrapped in a dust jacket. The book was titled 'The Fantastical Adventures of Knight Mingorak'. It seemed to be a fictional adventure tale.</p><br/><p>Placing the book on the table in front of Lina, Lorist said, \"Here, it's for you.\"</p><br/><p>Seeing Lina's confused expression, Lorist explained as he laughed, \"I know that you don't like to read novels like these just like your mistress. Just open the book up and you'll be surprised.\"</p><br/><p>Carefully prying the book open, Lina clasped her mouth in surprise. Within it was pages and pages filled with designs for women's clothing.</p><br/><p>\"All of these were drawn by me during the past year. The mistress wanted to put all of these to production, but she was stopped by me. That's because if all of them were to be released to the market at once, it would cause lots of confusion and we'll lose the ability to control the fashion trends, which will ultimately lead to a decrease in profit. That's why for the past few years, I only allowed a little over than a hundred designs to be released, some of which that had undergone the creative changes that you lot have made. Within this book is 300 or so designs which haven't seen the light of day yet. I'm giving them to you, Lina.\"</p><br/><p>\"Does... does the mistress know about this?\" said Lina as she hugged the book in her chest as if she was afraid that it would be taken from her.</p><br/><p>\"She knows, but she'll never expect that I've drawn so many. Do you see the mess in the room? That was all created by the mistress when she tried to search for the designs while I was away. Little did she know that they were hidden on the bookshelf, right under her nose. She didn't ask me for them last night though... Maybe she thinks that I still hate her,\" said Lorist with a hint of bitter pain as he let out a light laugh.</p><br/><p>\"What I will tell you later should not be made known to anyone aside from your father. Do you understand?\" said Lorist as he looked deeply into Lina's eyes.</p><br/><p>\"I... I swear...\" said Lina as she stuttered.</p><br/><p>\"Tell your father, Knight Somm, that I think that depending on the Lorf house is not a wise move. The mistress was willing to marry into the house because she thought they would be able to protect the Windsor house. If the Lorf house's intention is to take advantage of the Windsor house, however, then there will be nothing else for the Windsor house to rely on. This was especially the case given how your mistress sold away the businesses she had in Morante City. At this point, we can only hope that the Lorf Marquis truly loves her and doesn't have any hidden agendas.</p><br/><p>\"Your mistress told me yesterday that the marquis had a method of taking over the dominions of the four houses that were the enemies of the Windsors and would give the them half of the dominion that they have obtained. If that succeeds, then you might even become a noble yourself one day. Tell your father that he can agree to cooperate with the Lorf house on everything but these two factors.</p><br/><p>\"First, never let the 11-year-old Windsor young master accept knight education and training from the Lorf house just in case they plan to harm him under the pretense of an accident. Always let the young master be by your father's side and send him to Morante City for his studies when he matures. Second, when the young master grows up, the Lorf house might suggest a political marriage between the two families. To prevent that from happening, tell your father to prepare a suitable partner for the young master early on so that the Lorf house can't take advantage of that.</p><br/><p>\"The last thing is about you, Lina. Don't let anyone know that I've given you those designs, not even Suzy or the young mistress. This time, the young mistress plans to restart her business in the Jigda Kingdom with the aid of the Lorf house. I'm worried that they are targeting the young mistress's apparel business as well. Should that happen one day, these designs will help you and her start over from scratch. I'm afraid that you'll be in danger if word about you having the designs get out. That's why, don't tell anyone else, alright?\"</p><br/><p>Lina nodded fervently with her face flushed red as tears welled up in her eyes.</p><br/><p>\"If the Lorf house truly doesn't have any bad intentions towards the Windsors, then you can give the young mistress one or two designs once a month and tell her that you drew them yourself. It's okay. I've seen how talented you can be when you made the creative alterations here and there. When designing something, the most important thing is to have originality and individuality. As long as you can make your name as a talented fashion designer, it wouldn't be suspicious for you to release more of the designs gradually in the future.\"</p><br/><p>Looking outside the window, Lorist said, \"Oh, the horse carts are already here. It's time I bid you goodbye. Did you understand what I said just now?\"</p><br/><p>\"Yes, I have, master Locke. I will do as you say.\"</p><br/>\n</div>"}