{"title": "Chapter 33 Journal Entries and The Duels", "id": 33, "volume": 1, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-33-journal-entries-and-the-duels", "volume_title": "Volume 1", "body": "<h1>Chapter 33 Journal Entries and The Duels</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Journal Entries and The Duels</p><br/><p>Bill’s journal:</p><br/><p>Year 1767, 19th day of the 2nd month, Trade Union Calendar Weather: Sunny</p><br/><p>Just this afternoon, I have sent the young master to enroll into the academy. Instructor Locke had said that the young master wouldn’t have more than a couple of years to live if he doesn’t start losing weight and continues his old eating habits, just like the Blademaster the master has hired just two months ago. I have brought the master to the academy and he has decided to let Instructor Locke conduct his fat loss course and even signed an agreement. The master has tasked me to remain at the academy and assist Instructor Locke wherever possible, but I am not allowed to interfere with the training course nor interact with the young master in any way and can only observe the situation from afar. Even though I agreed to comply, I can’t help but feel that things won’t go that well for the young master in the times to come.</p><br/><p>As expected, after Instructor Locke finished briefing the other instructors, he asked me to go get a cart full of lettuce, carrots as well as celery. After that, he brought the young master away. When I returned with the things I bought, Instructor Locke brought me to a small building made out of bluestone and had me place the vegetables on the floor. The small room felt like a sword training room to me. Just as that impression entered my head, I saw the young master crouching in a corner crying. I couldn’t ask him personally what had happened nor could I talk to him, so I asked the instructor what was going on.</p><br/><p>Instructor Locke gave a savage smile before replying, and said that this would be the place that the young master will be living at from this day onward. Good lord, that room doesn’t have a bed nor a furnace. How will the young master be able to sleep like that?</p><br/><p>But Instructor Locke didn’t seem to think that was a problem and said that the straw mat and a woolen blanket would be sufficient. “If the young master feels cold at night,” he said, “then he should get up to exercise and warm himself up.” He also mentioned that the main feature of this room was that it was soundproof and no matter how the young master screamed, nobody would be able to hear a thing.</p><br/><p>I then asked him what the young master would be having for dinner. He merely pointed towards the vegetables I have brought and said that the young master would be feeding on only those vegetables for the coming three days. I was greatly surprised; was he treating the young master like a pet rabbit? I tried to subtly tell him that the young master didn’t like to eat vegetables, especially raw ones. He merely laughed it off and tapped on my shoulders before saying that there wasn’t anything to worry about. He said that when humans were hungry, they would even eat the rotting corpse of another if they had to, not to say much about vegetables.</p><br/><p>Instructor Locke is really disgusting, cold-blooded and iron-hearted. It is not an overstatement to say that he is the incarnation of evil himself. The young master really is unfortunate to have fallen into his hands. I have to record all of this down and report it to the master so that he doesn’t get away with this.</p><br/><p>Bill’s journal:</p><br/><p>Year 1767, 20th day of the 2nd month, Trade Union Calendar Weather: Sunny</p><br/><p>Yesterday, the young master threw a huge racket and cried for the whole night, but nobody gave him any heed. I wanted to go there to calm him down, but the assistant instructors who were on night guard wouldn’t let me and warned me that I couldn’t go near the room without permission. I could only listen to the cries of the young master from afar and couldn’t do anything about it.</p><br/><p>After the cries had subsided, I heard a crunchy sound of vegetables being chewed that originated from within the room. The young master bawled and cried as he bit down on the vegetables until finally, he fell asleep just before dawn.</p><br/><p>In the afternoon, Instructor Locke came over with a few others to help clean up the room, help the young master bathe and gave him a set of garments made out of rough hemp. The instructor then took hold of the young master’s wrist and said that he was helping him read his pulse. The young master cursed and cried at Instructor Locke throughout the whole process but the instructor didn’t give it any heed and even said that he intends to have a cane made that wouldn’t be able to hurt one’s bones but still manage to inflict a lot of pain! Oh lord! Is he treating the young master like a slave now?</p><br/><p>After that, he asked me to go over and gave me a drawing parchment which had some building designs on it. He said that he wanted a vast bathroom built in the academy that would be part of the necessary facilities the young master would have to use during his weight loss training. I heavily suspected that he was just trying to weasel additional benefit for the academy as I have never ever seen a bathroom that had a room within that was built entirely out of wood, which he called a ‘sauna’. Who does he think he’s tricking?!</p><br/><p>Bill’s journal:</p><br/><p>Year 1767, 21st day of the 2nd month, Trade Union Calendar Weather: Sunny</p><br/><p>The young master had another vegetable-only meal yesterday, but he didn’t make as much of a racket like he did yesterday.</p><br/><p>Instructor Locke came over again today afternoon. As usual, he had somebody bathe the young master before taking his pulse and cleaned up the room like he did yesterday. He also instructed me to go buy more vegetables this time around, during which I secretly sneaked in a few tomatoes inside the pile. I believe the master would be happy with that.</p><br/><p>The bathroom design that Instructor Locke brought to me yesterday is estimated to cost more than 100 gold coins to be built. After I showed it to the master at the mansion, he instantly approved of it and sent people to the academy to work on it right away.</p><br/><p>Bill’s journal:</p><br/><p>Year 1767, 22nd day of the 2nd month, Trade Union Calendar Weather: Sunny</p><br/><p>The young master had eaten nothing but carrots yesterday. It seems that I have bought a little too much of that last time around.</p><br/><p>After bathing the young master and taking his pulse, Instructor Locke gave me a list of medicines that he wanted me to purchase for the young master.</p><br/><p>Bill’s journal:</p><br/><p>Year 1767, 23rd day of the 2nd month, Trade Union Calendar Weather: Cloudy</p><br/><p>The young master only had celery to eat yesterday night as the carrots had already run out.</p><br/><p>Instructor Locke had a few other assistants hold on to the young master and forced him to drink a medicinal liquid from a test tube. It must have been really bitter as the young master looked like he was about to cry.</p><br/><p>It didn’t take long for the young master to start experiencing diarrhea.</p><br/><p>……</p><br/><p>Bill’s journal:</p><br/><p>Year 1767, 31st day of the 2nd month, Trade Union Calendar Weather: Sunny</p><br/><p>The young master had slept rather soundly without snoring or sleep talking throughout the whole night.</p><br/><p>For the past few days, the young master has been fed a laxative medicine. Though, the frequency at which the young master had to go to the lavatory had decreased gradually. He also looked far more energetic than before, unlike the past few days when his face was pale from releasing all that waste from his body.</p><br/><p>In the afternoon, the young master had his body weighed and the result was he had lost up to 8.5 kilograms within only just a few days! It seems that the young master really did have some hope losing weight after all. However, Instructor Locke remarked that the young master would have to lose at least 85 more kilograms to be at normal body weight. Will that really be possible? It’s really hard to imagine the young master having the same body weight as me at about 80 kilograms approximately.</p><br/><p>This time, the instructor gave me another list of medicines to be purchased while mentioning that the young master no longer had to take the laxatives. Now that the young master had expelled all the waste he could from his body, Instructor Locke said that he could start doing physical training from tomorrow onwards and take a whole new type of medicine as a supplement.</p><br/><p>Bill’s journal:</p><br/><p>Year 1767, 32nd day of the 2nd month, Trade Union Calendar Weather: Sunny</p><br/><p>The young master had a good night’s sleep the night before.</p><br/><p>Instructor Locke came over early in the morning and had the young master run three laps around the field. Initially, the young master refused. But the instructor took out two buns about the size of fists and said that if the young master would run the laps, he would be allowed to eat the buns. Having eaten nothing but raw vegetables for the past few days, the young master instantly lost it and leaped towards the instructor in an attempt to take the buns for himself but was struck down to the floor as a result. Instructor Locke then said that he would toss the buns into the lavatory if the young master didn’t run and let him eat vegetables for another week.</p><br/><p>For this crudely baked black bread, the young master ran around the field three times and collapsed in the middle of the last lap and had to climb the rest of the way to the finish line. Instructor Locke had a few assistants hold the young master up and walk half a round on the field for him to catch his breath before allowing him to come back to us. I was literally at the brink of tears when I saw the scene of the young master stuffing the bread into his mouth.</p><br/><p>From today onwards, the young master’s menu had changed. In the morning, he was fed a bowl of porridge with two pieces of bread. For lunch and dinner, he only had raw vegetables. Additionally, the young master started working out every day. During the morning and the night, he had to run around the field for three laps as usual while he did other exercises in the afternoon. After every training session, the young master had to drink a large bowl of salt water to replenish the salt content in his body. Every night before sleep, he will have to consume another serving of a special medicine.</p><br/><p>During today afternoon, the young master refused to exercise because the instructor had wanted him to jump like a rabbit and push up from the ground. Without hesitation, Instructor Locke took out a cane and sent a lash towards the young master. A loud sound rang out as the cane stroke the young master’s back, leaving behind a red mark on his skin. The young master had never been beaten all his life! I wanted to go stop him, only to be severely warned by the assistant instructors beside me that this would be indirect violation of the agreement the master had signed. I didn’t dare to bear the responsibility for voiding agreement and could only witness the young master suffer the lashings until the training was completed.</p><br/><p>Bill’s journal:</p><br/><p>Year 1767, 33rd day of the 2nd month, Trade Union Calendar Weather: Sunny</p><br/><p>Having been caned all day the day before, the young master groaned for the whole night as he tried to sleep. Even though Instructor Locke had someone apply some medicine onto his wounds, he didn’t sleep well and was even dragged out of bed for training today.</p><br/><p>The good news, on the other hand, was that the bath has just been completed not long ago. After having his daily dose of medicine, the young master was brought into the sauna and I was allowed to follow them inside.</p><br/><p>The sauna was a small wooden hut with a cauldron of cobblestones that were heated up and then sprinkled with water for the steam to evaporate. The room quickly filled with steam the moment the water was splashed onto the hot cobblestones and I found it a little difficult to breathe due to the sudden influx of hot air. Everyone had to strip naked before entering the sauna. Instructor Locke had a magnificent physique while nothing but fatty meat could be seen on the young master’s body. Having been put in charge of putting the heated cobblestones into the cauldron and sprinkling water over it, I was sweating all over. The young master on the other hand sat at a corner unmoving as glistening oily sweat oozed out of the pores of his skin. After about 20 minutes, the young master lost consciousness. Instructor Locke said that it wasn’t anything to worry about and that he would slowly wake up upon being brought to somewhere with normal air circulation. The young master woke up after being sprinkled with some cold water. He was bathed and put to sleep soon after.</p><br/><p>……</p><br/><p>Bill’s journal:</p><br/><p>Year 1767, 1st day of the 3rd month, Trade Union Calendar Weather: Sunny</p><br/><p>Yesterday, the young master had yet another night of sound slumber. These few days, he has been training under the threat of the cane from Instructor Locke the whole time whenever he tries to slack off. Before going to sleep, he goes to the sauna every night. These days the young master seems much more revigorated than before: his strength has increased and he no longer starts gasping for breath after walking a few steps. When I was at the sauna with him just now at night, the young master suddenly grabbed on my hand and to my surprise, it hurt. The young master said that he wanted to eat meat so much that he’s going to go crazy over it and wanted me to sneak some smoked meat for him.</p><br/><p>But I don’t dare do such a thing as Instructor Locke, who was standing behind the young master unnoticed by him, was glaring at me with a savage gaze in an attempt to warn me.</p><br/><p>Instructor Locke wasn’t present this afternoon for the training as he had to prepare for the duels tomorrow. I really don’t understand what kind of person would attempt this kind of crazy feat and take on all the Silver ranked instructors from 27 different academies. I’ve heard that they number up to 1600 or more people and I don’t believe that a sole Iron ranked instructor like Locke can defeat all of them without losing. A tavern near the academy called ‘Sword and Beauty’ has a betting pool for the duels that are to come. I shall go bet 1 gold coin on Instructor Locke’s loss as I’ve heard that the payout for 1 small silver is 1 gold coin. If I win, I’ll instantly gain 100 gold Fordes! I really hope that Instructor Locke would lose tomorrow.</p><br/><p>—————————————————————–</p><br/><p>The 2nd day of the 3rd month finally arrived and the weather on that day was clear and bright. Lorist walked casually in the academy as if he didn’t mind the oncoming duels one bit.</p><br/><p>He has already received the list of challengers a day before for the inter-academy duels. The open matches would start on the 3rd day of the 3rd month, which was tomorrow. However, he did not have a list of competitors for that as Charade had forgotten to give him one, or maybe he didn’t, as he believed that Lorist would defeat all of the challengers without exception anyway. On the other hand, Charade has provided Els with the list of all the challengers, both the instructors and non-instructors, with excruciating detail so that Els would spread rumors about the challengers’ abilities to easily defeat Lorist.</p><br/><p>“It can’t be helped, if we don’t do that, we won’t be able to attract any customers for the betting pool. We must give the betters information as detailed as possible to make them think that the challengers have a chance against Lorist,” said Charade as he shrugged his shoulders.</p><br/><p>Lorist didn’t really want to bother with the name lists anyway. The instructors today were from the Hoary Stock Academy that was ranked at the 21st place and didn’t have any famous Silver ranked instructors among their ranks, resulting in Lorist feeling no enthusiasm whatsoever for the duels to come.</p><br/><p>The members of the Enforcement Division as well as the elites of the Swordsmanship Society could be seen receiving instructions from the fatty nearby. Seeing Lorist, who was looking around aimlessly, Charade said, “Don’t walk away just yet, there’s a good show that you should see.”</p><br/><p>Without much delay, the ‘show’ that Charade had predicted was slowly unraveling. A group of people dressed in black entered from the academy entrance with the Silver ranked instructors who were wearing the instructor badge of the Hoary Stock Academy leading the other non-challengers from other academies who were here to witness the duels into the premises.</p><br/><p>Academy Head Levins who was holding his walking stick was standing by the training hall which had just been completed recently after a month of rushed renovations. With a wide smile, he received the academy heads and brought them to the dueling hall, but he didn’t let the other people following behind enter.</p><br/><p>“Rotten old man, what is the meaning of this?” asked the head of the Saint Marceau Academy with a grim expression.</p><br/><p>Academy Head Levins was struck by a rather serious disease that had left his legs only partly functional for the rest of his life.</p><br/><p>Smiling, Levins said calmly, “Old bastard, the Hoary Stock Academy is here to participate in the duels. Given that you academy heads have come to witness the spectacle, it’s only natural for me to receive you. The rest who were left outside can enter from the other door if they want to.”</p><br/><p>As he said that, Levins pointed towards the other direction where a large sign could be seen hanging with the words ‘Ticket Counter’ on it. It seemed that the audience had to pay a fee to be able to view the oncoming duels.</p><br/><p>“The price isn’t expensive, only one small silver per person,” said the academy head.</p><br/><p>“Rotten old man, you’ve really been blinded by money to the point where you wouldn’t even let some small change like this go uncollected. Can’t you be more generous in your ways? I’ll pay for the tickets of the audience today, just tell me how much I need to pay in total,” said the Weston Academy Head magnanimously as he took out an intricate pouch and tossed it towards a Silver ranked instructor from the Saint Marceau Academy.</p><br/><p>“The Weston Academy Head is so generous…” “Thank you, academy head…” Such cries and cheers could be heard coming from the audience.</p><br/><p>Pretending not to see the Weston Academy Head’s gleeful expression, he stretched out his hands and motioned towards the inside of the halls and said, “Over here, my fellow guests.”</p><br/><p>—————————————————————–</p><br/><p>The newly-renovated training hall had changed a lot after the process. In the center of the hall was a 7m x 5m elevated platform with up to eight terraces of audience seats surrounding it which could seat up to 2000 people.</p><br/><p>Lazily standing on the dueling platform, Lorist looked casually at the uniform-clad Dawn Academy schoolgirls who were walking around the audience seats and saying in a clear voice, “Get your betting tickets here! Is there anyone who wants to make a bet? The payout for Instructor Locke’s victory is 1 small silver for every large silver and the payout for his loss is 1 large silver for every small silver!”</p><br/><p>The Weston Academy and the Hoary Stock Academy heads were infuriated at the scene on the seats. “Rotten old man, what’s the meaning of this?”</p><br/><p>Academy Head Levins merely said, “What’s so weird about a few girls working so hard to run a betting pool to earn some cash for a living? Maybe they’re just very confident in Instructor Locke’s abilities and set the betting payouts to be so skewed. If you two are unhappy with that, why not buy some tickets for your victory and teach them a lesson?”</p><br/><p>Only an idiot would believe that you wasn’t involved in it! The two academy heads glared at Levins furiously. The Weston Academy head said, “I have more than 10 gold Fordes in this pouch and I bet on the victory of the Hoary Stock Academy! I’ll make sure you go bankrupt from the payout!”</p><br/><p>The Hoary Stock Academy head also said to the instructors and students of his academy, “Everyone, put some money in the pool and bet on our victory. It isn’t like that Iron ranked kid on the platform there has three heads or six arms, I doubt that not even one out of the twenty Silver ranked instructors can take care of him! With enough people, no matter how strong he is, he’ll definitely tire out near the end!”</p><br/><p>The female students accepted the bets without hesitation even though almost nobody bet for Lorist’s victory aside from a few other Dawn Academy students.</p><br/><p>The Hoary Stock Academy head held a handful of betting tickets and whispered to the Weston Academy head, “Even though Instructor Worbas is only a Two Star Silver, his swordsmanship is not something to be underestimated. I’m sending him out first to test out that kid Locke’s abilities. Even if his swordsmanship is superb, there’s no doubt that he’d fall after several tiring matches. Look, Instructor Worbas is already on the platform. With his rich experience and 17 wins out of all 18 duels he has had… Huh?”</p><br/><p>Charade quickly walked up the dueling platform and announced after examining Worbas, who was lying flat on the ground, “The challenger was knocked out from blunt force trauma to the chin and is unable to continue battling. Next one.”</p><br/><p>Within half an hour, all twenty of the Hoary Stock Academy instructors had been wholly defeated by Lorist, who still had the ‘energy’ to yawn lazily on the stage.</p><br/><p>The beauties who were running the betting pool as well as the patrolling Enforcement Division members, who held their swords up high, let out cheers of joy and chanted, “Instructor Locke, Silver Undefeated!” over and over again.</p><br/><p>The Weston Academy head was stunned speechless and ruthlessly tore up all the betting tickets that he had bought. Without even saying his farewells to Academy Head Levins, he turned towards the exit and left right away. The people from the other academies who came to cheer for the Hoary Stock instructors left disappointed as well.</p><br/><p>The Hoary Stock Academy head’s expression was dark as the dirt on the ground. He didn’t even notice the tickets falling out from his grip. How could it be… The instructors from my academy were mostly defeated within one exchange… Even the best only lasted three bouts…</p><br/><p>Lorist called Charade over and said, “How many challengers are there for tomorrow?”</p><br/><p>“Twenty, just like today,” replied Charade.</p><br/><p>Lorist said, “That’s way too less. Next time, increase the amount to 50 a day. It’s better if I can settle this sooner.”</p><br/><p>—————————————————————–</p><br/><p>Bill’s journal:</p><br/><p>Year 1767, 2nd day of the 3rd month, Trade Union Calendar Weather: Sunny</p><br/><p>I lost a gold coin in the betting pool today. Who would’ve expected that all the 20 Silver ranked instructors sent by the Hoary Stock Academy to be so useless and got defeated by Instructor Locke… However, I believe it will be different tomorrow, as the duels are open to all the famous combatants who are not representing any academy. They should be too much for an instructor who always spends his time in the academy teaching without much combat experience. It’s fortunate that the payout for the betting pool still stayed the same. It seems that I still have a chance to get the gold coin that I lost back.</p><br/><p>The young master was in pretty good shape today as well. He bathed and went to sleep after training as usual.</p><br/>\n</div>"}