{"title": "Chapter 34 Dueling Period", "id": 34, "volume": 1, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-34-dueling-period", "volume_title": "Volume 1", "body": "<h1>Chapter 34 Dueling Period</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Dueling Period</p><br/><p>Seeing the Silver ranked mercenary rush at him with a sword, Lorist instantly visualized more than ten ways to defeat the opponent, but he wasn't allowed to use any one those. That was because Charade said this to him the day before, \"Oh Lord Locke, why don't you just let me call you that? You should always give them a fighting chance! Don't just take them out in an instant, alright?! At least pretend to fend away a few of their strikes and maybe even try for a close victory and make people think that you were just on the edge of losing and merely lucked out. This way, people will continue to bet against you! Otherwise, everyone will no longer bet on your loss and the betting operation Els is running would no longer earn as much, surely you understand that much?\"</p><br/><p>Fine, I'll just dance around and act out the fight the whole time. Though, I can't say I'm pretty good at it... This Silver ranked mercenary may be pretty ferocious, but he has lots of openings to strike at, thought Lorist as he tried to match the opponent's ragged movements and try to dodge in a manner that seemed difficult for him. This... this really is too hard...</p><br/><p>The seven years he served in the military in his previous life had left too deep an impression on Lorist. He had been enlisted as an assault trooper and not a support troop, so he had witnessed all kinds of blood, violence and death that was not too uncommon on the battlefield. While the world as a whole was relatively peaceful during those seven years in his life, shootouts were still a common occurrence during anti-terrorism or drug busting operations. In those bloody fights, a single bullet would equal death to the soldiers and taking the least effort to eliminate the enemy was the most efficient and best way to protect oneself and one's comrades on the battlefield. They even had to make sure their enemies were not playing dead by shooting the corpse of the enemy in the head. That was why Lorist was finding it so hard to purposely not take the finishing move and end the duel there and then.</p><br/><p>However, to the audience witnessing the battle from the seats, it seemed like the Silver ranked mercenary was slowly pushing Lorist into a corner as Lorist flailed around desperately trying to parry blow after blow. It really was rather rare for an opponent to not be instantly taken out by Lorist. Perhaps Instructor Locke is weak against rapid attackers, thought some of the people in the audience as they quickly made a mental note of this perceived weakness and determined to verify this fact in the future duels.</p><br/><p>At that moment, the mercenary had exposed his chin and Lorist really couldn't resist it anymore. He planted his right foot firmly on the ground in front of him as his left foot instantly kept up and made a big step forward in a swift and agile manner, much like that of a fish swimming in water. Within but a moment, Lorist appeared before the mercenary and swung the sword in his right arm and lightly grazed the chin of the opponent. The Silver ranked mercenary reacted as if he had been struck by lightning and took a few unstable steps forward before falling flat on his face entirely.</p><br/><p>Charade rushed up to the platform and checked the condition of the defeated mercenary before announcing, \"The contestant has passed out from an injury to his chin. The next contender, please prepare for your turn on the stage.\"</p><br/><p>After signalling for the medical team to take the mercenary away, Charade said to Lorist in a low voice, \"That was great, just keep this up for the rest of the battles and let the audience think that the challengers have some hope in winning. However, please pay attention to not always hit their chins to end the duel so that they won't discover that you're holding back.\"</p><br/><p>With 20 challengers in a day and each taking up about five minutes, it all totals up to 1 hour and 40 minutes. Add in another rough 20 minutes for things like announcements and medical checks, the duels would take around 2 hours per day. That should be enough for the audience to feel fulfilled from paying the ticket price of one small silver. Sigh... It seemed that Lorist still had to continue putting up an act for quite a while.</p><br/><p>When the first dueling day with the Hoary Stock Academy ended, Lorist had asked Charade to increase the number of challengers per day from 20 to 50 so that he would be able to settle the duels within half the amount of time. However, it was rejected as the revenue generated from the tickets and other miscellaneous sales during each open dueling day easily reached 40 gold Fordes and more. That prompted the finances department of the academy to make sure that duels during those days were dragged on for as long as possible and shoot down Lorist's request without even considering it.</p><br/><p>As expected, the next few challengers all employed the same tactic of attacking rapidly. However, with his dynamic vision ability, the sword strikes which seemed swift as the wind, clustered as rain and powerful as lightning could all clearly be identified by Lorist down to every single detail. If the duels were life-and-death battles, Lorist could break the momentum of the enemy with only one stroke and pierce their hearts instantly. Though, he had no choice but to hold back during these duels.</p><br/><p>Many of the challengers attempted to use their superiority as Silver ranks to try to trump Lorist, who was only an Iron ranked fighter, and attempted to break Lorist's sword with the blade glows emanating from their weapons to render Lorist helpless. No matter how tough Lorist's sword was, with his Battle Force at the Iron rank, he wasn't able to manifest a blade glow to counteract that of the challengers' and his sword would break within a few exchanges.</p><br/><p>But Lorist wasn't going to go along with their intentions either. Every time he crossed weapons with his opponent, Lorist aimed for the crossguards of the swords and cleverly put his blade out of the way of the blade glows, much to his opponents' annoyance.</p><br/><p>The audience started gasping in anxiety as they witnessed Lorist win by a hair's breadth against one opponent after another. Most of those victories seemed to have been a result of Lorist taking advantage of the challengers' mistakes. Had they been more careful and lucky, it would be hard to say who would take the victory for each match. The audience seemed convinced that Lorist's weakness was indeed a crazed flurry of attacks.</p><br/><p>That was until a One Star Silver mercenary started taking Lorist on with the standard rapid attack tactic. Sheesh, your Battle Force is of the earth attribute which makes you more suited for using a sword and a shield in battle, as a semi aggressive guardian. How in the world did you think you would win with rapid attacks while hiding behind your shield? Can you even see where I'm standing at?</p><br/><p>Lorist merely took a few steps forward, sidestepped, and gave a low sweep to his opponent with his leg, tripping the whole guy over. Lorist then proceeded to step on the fellow and tapped his shoulder with his sword twice. Hearing the laughter coming from the audience, the Silver ranked mercenary's face reddened as he picked up his equipment and dashed for the exit.</p><br/><p>Clang, clang... Clang! Sharp resounding sounds of metal clashing rang out from within the hall.</p><br/><p>It was currently the final duel scheduled for today and the opponent was a Three Star Silver mercenary who looked in his forties. The main difference between him and the rest of Lorist's previous challengers was how he didn't bother to rain attacks on Lorist and instead took on a defensive stance while awaiting Lorist's move.</p><br/><p>This was the most impressive challenger up to date as he had managed to perfectly hold his defenses against three of Lorist's aggressive assaults. With his curiosity piqued, Lorist circled around the defending challenger and started to observe him carefully.</p><br/><p>The middle-aged man had an unfazed expression and calm and cool breathing. With one leg in front and the other behind, he seemed pretty relaxed and unconcerned. Every time Lorist made a dash to his side, he merely swiped his front leg to point it in Lorist's direction, not once exposing his back to him.</p><br/><p>This person was a real expert who had the potential to break through to the Gold rank in the near future and must have experienced his own fair share of life-and-death battles given his calm and reactive disposition and the solid swordplay that he has displayed. During the last three bouts of savage attacks by Lorist, there were quite a number of strikes that would've been lethal to that mercenary but all of them were successfully deflected by him by relying on his great reflexes. It was as Lorist had said before, this person has mastered all the eight basic moves of swordsmanship to the point when every move was as natural as breathing which allowed him to emerged unscathed from the flurry of strikes.</p><br/><p>Standing there, Lorist said respectfully to that middle-aged mercenary, \"Nice to meet you, I'm Norton Lorist. It is an honor to be able to face you in this duel.\"</p><br/><p>It was the first time Lorist had introduced himself on the stage as this middle-aged mercenary was definitely worth this respect. No matter who it was, as long as one managed to practice the eight basic swordsmanship moves to this level, one would deserve this kind of respect.</p><br/><p>The middle-aged man was slightly surprised as a warm light flashed past his eyes. He slightly nodded his head and replied, \"My name is Grei Potterfang. It's my pleasure to be able to fight you as well.\"</p><br/><p>Lorist waved the sword in his hand and said, \"Please watch out, I'm about to attack.\"</p><br/><p>This time, Lorist didn't simply unleash all his force like he did the past three times but rather approached Potterfang gradually and planned to use a steady and firm approach against him. From his dynamic vision, he could see that almost all of the middle-aged man's moves had a small window of opportunity that he could exploit. As long as he suddenly changed his move mid-trajectory, there was a chance that the middle-aged man wouldn't be able to respond in time and create the decisive opening for Lorist's victory.</p><br/><p>The experienced mercenary Grei Potterfang was retreating step by step and neutralized Lorist's blows one after another without leaving much of an opening. It was then when Lorist's move suddenly changed from a round of quick attacks to a leap towards him in an attempt to launch a close quarters move.</p><br/><p>Potterfang's expression changed instantly as he let out a low groan, expanded the blade glow from his sword and quickly slashed downwards. Lorist's forward movement didn't slow down at all as the sword in his right hand came up and parried the downward moving sword. The middle-aged man quickly tried to move a few steps back only to hear a sound of a blade unsheathing. A light flashed out before his eyes and a short blade could be seen dangerously pressed on the side of his neck. It appeared that Lorist had pulled his sidearm; an action that was far beyond the mercenary's expectations.</p><br/><p>Potterfang's body froze as he placed the longsword in his hand down before saying, \"It's my loss. I've forgotten about that other blade you were carrying on your hip...\"</p><br/><p>Lorist kept the short blade and said, \"You're pretty skilled. Nobody else has managed to force me to draw my other blade until now.\"</p><br/><p>\"Nevertheless, a loss is still a loss, I have no excuses,\" replied Potterfang with a bitter laugh. \"Thank you for showing mercy. I have indeed learned much from this duel. I'll be taking my leave now.\"</p><br/><p>Potterfang turned around and left the dueling platform right away as the audience let out jeers and sighs and tore their betting tickets to pieces. This has been a common sight for the whole of the month.</p><br/><p>In actuality, had Lorist utilized the explosive power of the Inch Stage of the Aquametal Technique, he could have easily broken through the middle-aged mercenary's defenses but it would be difficult for him to control the amount of power he used and might end up injure the mercenary badly. Given that he had already reached the Dark Stage, that kind of power was easily way beyond what a Silver rank could handle. If he could, Lorist didn't want to hurt his opponent too badly and just try to knock the opponent out. That was why he liked to go for his opponents' necks.</p><br/><p>Charade looked at Lorist's thoughtful expression asked, \"What's going on? Are you thinking of something?\"</p><br/><p>Lorist replied, \"That middle-aged mercenary just now was a true expert. If it were you or Els instead of me fighting here, I'm sure it wouldn't turn out good. He's far stronger than many of the Silver ranked instructors of our academy.</p><br/><p>Charade repled, \"You didn't have to tell me that. I could feel the tension when I was watching from the seats and was truly concerned about whether you have finally met the one who would defeat you. This match was really exciting. It's the first time I've seen someone who managed to hold out in so many moves against you.\"</p><br/><p>\"Well, I still think that I wouldn't lose either way, that much I'm confident in. I just dragged it on to make it seem more tense for the audience. The 20 duels today have really worn me out. I really shouldn't have listened to what you guys said about faking the duels,\" complained Lorist.</p><br/><p>\"Come on, just shrug it off. It's all for the golden bright future[1] that awaits us. Please bear with it for our sakes, would you? Oh, today's the academy payday. You haven't collected your salary from the finance department yet, right? We're having a party at the Red Grace Inn tonight,\" said Charade.</p><br/><p>Thinking back at the day he covered for their bills, Lorist said in an annoyed tone, \"Don't think that I'll pay for the bills this time. You even took so much food with you back home... You're really shameless you know!\"</p><br/><p>[1] This actually a pun between money (, qian) and future (, qian tu). Golden bright future (, qian tu) reads the same as future (, qian tu) in Chinese.</p><br/>\n</div>"}