{"title": "Chapter 41 Counting Earnings and Beggars", "id": 41, "volume": 1, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-41-counting-earnings-and-beggars", "volume_title": "Volume 1", "body": "<h1>Chapter 41 Counting Earnings and Beggars</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Counting Earnings and Beggars</p><br/><p>“How boring…” said Lorist.</p><br/><p>Cups and plates could be seen all over the table. Lorist was leaning on the wall stretching and sighing after enjoying a nice, filling meal.</p><br/><p>“Sol, you’ve already a become super rich man yet you’re complaining over something as small as this… How frustrating,” said Charade as he chewed on a toothpick and looked at Lorist with contempt.</p><br/><p>“Hehe, fatty… Am I bothering you? Don’t forget that I treated you to breakfast today you know. Other people would be courteous after receiving a treat from someone, yet you start giving me that angry look after you’ve been treated.” Given that Lorist had nothing better to do, he started arguing with Charade.</p><br/><p>“I’m not angry at you… I’m just despicably envious and jealous! Back then, you would join me to go on missions all over the place for a couple of gold coins. But now, you’ve already managed to purchase your own building that costs 5000 and more gold coins without batting an eye! With more than 40 rooms in it, you could easily collect up to 8 gold coins of rent per month! How am I supposed to stay calm about that?! Terman, Yuriy, Steve, don’t you all think so too?” said Charade as he attempted to drag the others to his side.</p><br/><p>The others nodded and agreed at what Charade had just said.</p><br/><p>Yuriy asked curiously, “Locke, how much money did you earn within this month?”</p><br/><p>Lorist gave it some thought and shook his head. “I haven’t counted it yet, but there should be seven to eight thousand gold coins. I only noticed that I had so much saved up when Els asked me if I was interested in that building. Since I had nothing better to spend it on, I bought it right away.”</p><br/><p>“I think you should leave the counting to me.” Charade was instantly piqued upon the mention of money. “Within the 3rd and 4th months, you’ve defeated all 27 academies in the Academy Sector and that old bastard promised you 100 gold coins per academy right? That should already amount to 2700 gold coins, correct?”</p><br/><p>“Sol, how did you know about that?” Lorist gritted his teeth. The old bastard was afraid that the reward would cause other people to be green-eyed with jealousy so that’s why he only notified me personally… How did that fatty know about it?</p><br/><p>“You don’t need to know how I got the news. That did happen, correct?” said Charade full of smiles as he held his nose high like he knew everything, making Lorist have an urge on giving his face a good punch.</p><br/><p>Lorist nodded hesitantly.</p><br/><p>“That’s only part of the story. You should have earned a decent sum from the challengers that don’t represent any academy as well. The number of challengers each month starting from the third is 240, 360, 680, 700 and within the last month itself, which is the 7th month, you had 520 challengers which totals up to 2500 people. By the end of each month, the finance department would give you a commission of 3 gold coins per challenger. Based only on that, you’ve got another 7500 gold coins down your pocket. So that’s already more than 10000 gold coins. It’s no wonder that you didn’t even blink when taking out all that money for that building,” recalled Charade with great detail.</p><br/><p>Lorist suddenly remembered that Charade’s Enforcement Department also got a 10% cut for each challenger. That’s why he was so clear about the details.</p><br/><p>“Also, within this month, there has been 18 open challenge days for those not affiliated with academies. Even though there are still tons who want to register, the academy has decided to end this dueling event when the challenger count reaches 3000. After the day after tomorrow which is an open challenge day, you should already have 380 challengers for this month. After defeating another 120 of them, you’ll hit your 3000th victory. That’s why, you still have another 1500 gold coins that you haven’t claimed from the finance department.”</p><br/><p>Terman seemed to have remembered something as he asked, “I heard that if Locke manages to get a 3000 win streak, the academy would spend another 1000 plus gold coins to craft a life-sized bronze statue of him in the academy to commemorate that. I wonder if it’s true…”</p><br/><p>“So what if it is? It’s not like the 1000 gold coins will go into Locke’s pocket, so it’s pointless. If it were me, I’d give him the 1000 gold coins and have him stand there all day in place of a statue.” Charade absolutely couldn’t bear the fact that the reward wouldn’t increase the money that they would get. That was the main reason why he was so opposed to the construction of the statue.</p><br/><p>“Buzz off, I don’t have the time to stand around the academy pretending to be a statue. I’m not Els, you know,” barked Lorist. Upon hearing that, everyone recalled the incident when Els impersonated a plaster statue in the female bath house and broke into laughter.</p><br/><p>Charade continued to count Lorist’s haul, “Locke’s largest earnings come from the betting pool Els set up. Though, he hasn’t got it yet, and lesser and lesser people are betting on Lorist’s loss. He can only collect the earnings by the time the dueling event ends. However, last time when I checked with Els, Locke has a share of an estimated 20000 gold coins at least! Good Sol! I really can’t stand the thought of Lorist swimming in a sea of gold coins… I’ll never make that much no matter how hard I work in my life!” Charade really felt that he was slowly going nuts.</p><br/><p>“Hey, don’t say that like you deserve it. I am the one doing all the work up there on the dueling platform you know. Don’t forget that you’ve got quite a sum yourself without doing much to begin with, at least 10000 gold coins. Now that you mention it, each of you here already have made at least a few thousand gold coins yourselves. Even if you can’t purchase a building, surely you can afford a nice mansion, right? Fatty, if you want to swim in a sea of gold coins, why don’t you take my place on the dueling platform?”</p><br/><p>“Sol, if I had the ability to do so I wouldn’t have let you take the spot in the first place,” said Charade bitterly.</p><br/><p>“Then you better keep your mouth shut. Rather than grumbling about how much Locke is earning, you should be training your Battle Force and try to break through into the Gold rank. Brother Locke relied on his own skills to earn that money. You don’t know how much risk he has had to take by dueling all those people within the recent months. Do you lot think that any of you can last even one day up there? The people of Morante City don’t call him Iron Locke the Silver Undefeated for nothing you know,” a voice interjected and heavily rebuked Charade.</p><br/><p>“Sol, Els… Since when has it been your job to nag at me?” said Charade as he jumped in anger.</p><br/><p>The one who just arrived was Els. He stared at Charade with an annoyed expression and said, “What? You’re not content? Why don’t we go out and settle it with our fists?”</p><br/><p>“Good Sol…” said Charade as he lifted his cup of ale and drank a few gulps in anger. “Your brother here is a civilized person and wouldn’t take what a ruffian like you say seriously.”</p><br/><p>Two months prior, Els’s dark attribute Battle Force had finally reached the Three Star Silver rank which prompted him to go seek out Lorist for a duel, only to end up losing flat on the ground as usual. Given that Charade was talking down on him during his duel with Els, he got challenged by him right after that.</p><br/><p>Having reached that rank a year before Els and seeing Lorist defeat him without breaking a sweat, Charade believed that he wouldn’t have much trouble defeating a newbie like him. Nobody would have expected Els’s dark attribute Battle Force to be far superior to normal ones. Coupled with the various rogue skills Els claimed to train in, Charade was totally creamed three out of three times. Not satisfied with his loss, Charade challenged Els for seven more times privately within the coming month. Even though Charade wanted Els to keep the results of the duels a secret, Els didn’t bother either.</p><br/><p>“Here, it’s settled,” said Els as he handed Lorist a leather pouch. It contained a deed for the building along with a receipt for the management fees as well as taxes with a few gold coins and some gold coin notes left over.</p><br/><p>Picking up a bottle of blackcurrant ale and removing its cork, Els drank directly from the bottle before saying, “The building is already registered under your name. The management fee is 0.5% of the price while the tax is about 10%. There will no longer be any other fees in the future and the change is all in the pouch. Give it a count to make sure it’s correct.”</p><br/><p>Lorist picked up his wine cup and said, “Thanks, Els.”</p><br/><p>“It’s no big deal, brother.”</p><br/><p>This was the first piece of property that Lorist had purchased in Morante City and it was located at Rose Street which is near the Business Sector. It was a building with Gothic-like architecture that had four floors with 12 rooms on each floor. Originally, it belonged to a count from the Mobia Duchy who decided to sell it in a rush due to some personal circumstances.</p><br/><p>When Els heard about that news, he recalled that Lorist had once mentioned that he wanted to buy some property in the city and invited him to go check that building out. Satisfied with the building, he had Els help him out with the purchase. Even though Els managed to seal the deal at only 5400 gold coins instead of the original 7000, the taxes and management fee still didn’t make Lorist feel any better. On the bright side, after paying off those fees, the building would truly belong to Lorist and he wouldn’t have to pay any other fees for the rest of his life.</p><br/><p>“What are you planning to do with the building?” asked Els.</p><br/><p>“I’ll leave that to Jindoz. Wasn’t he going to set up an organization that provides labor services? I’ll let him use the building and collect half of the rent from him every month,” said Lorist.</p><br/><p>“That’s a good idea. I’ll get Jindoz to prepare the contract for you within the next two days,” said Els as he nodded.</p><br/><p>“Uncle Locke, I want another large drumstick,” said Alisa as she ran over and tugged on Lorist’s arm. Before that, she was playing around with her brother Howard in the backyard of the Red Grace Inn.</p><br/><p>Lorist’s friend from the same homeland, the peak Silver ranked mercenary Potterfang, had recovered after two months of rest. The two of them didn’t talk much, but their implicit mutual understanding made them intimate friends. As for Potterfang’s two children, Lorist spoiled and took great care of them. Howard was a studious and hardworking child. When Potterfang saw Lorist giving Reidy some pointers in swordsmanship, he told Lorist that he would like Howard to also become Lorist’s disciple when he awakens his Battle Force in a few years.</p><br/><p>Originally, Potterfang only intended to mention it casually but Lorist reconfirmed it with him in a serious tone. Potterfang only nodded and Lorist instantly got Howard to bow down to him 3 times and had Reidy perform the same ceremony as well. That was how Howard officially became Lorist’s second disciple with his senior apprentice brother being Reidy.</p><br/><p>As for Potterfang’s daughter, Alisa, Lorist cared for her very much and was often reminded of his own daughter back in his past life. That resulted in him granting every request of hers to the point where he had a craftsman hired to renovate the attic into a proper bedroom for the siblings, much to their excitement and joy. Potterfang was even a little jealous that his children were closer to their beloved Uncle Locke than him.</p><br/><p>When Potterfang fully recovered and was about to leave with his children, he was stopped by Lorist with tons of excuses. Some of the main ones were the fact that the children absolutely loved it here and the city would be a better environment for the children to grow up as opposed to having them wander around with Potterfang. And, given that Howard is already Lorist’s disciple, there was no way that he would leave before he was taught anything right? The other reason was that since Potterfang didn’t really have a set destination to go to, he shouldn’t let his children suffer along the journey with him. The final reason was the most convincing, that is, Potterfang would be allowed to leave whenever he manages to defeat Lorist.</p><br/><p>Seeing his two children so attached to Lorist, he could only reluctantly agree to stay for a little longer until he can decide where he will settle down in the future.</p><br/><p>Lorist offered to recommend Potterfang as a Silver ranked instructor for the Dawn Academy, but that proposition was rejected by him as he did not intend to permanently settle down in Morante City. Lorist knew that there wasn’t a point in forcing it so he brought him to the Red Grace Inn and introduced him to Charlando so that he may accept private requests there in the future.</p><br/><p>It was already the 8th month of the year and most of the courses in the academy had halted for the semester break, except for the Battle Force awakening course that Lorist was in charge of. There were tens of students in the last batch who would awaken their Battle Force by the end of the month, among which included President Peterson’s son who had lost more than half of his body weight from 180 plus kilograms to 90 kilograms. While that was still slightly overweight, it was no longer an obstacle in awakening his Battle Force.</p><br/><p>Last month when President Peterson came over to check on his son, he shed tears of joy from seeing his son’s current physique and instantly took out a couple of gold bank notes as a sign of his gratitude. Had Lorist not stopped him before, he might have already got the 3000 gold Forde reward that the president had promised long ago. On that day itself, the president had forcefully stuffed nine such notes into Lorist’s pocket, which was worth about 900 gold coins.</p><br/><p>The academic season on the Grindia Continent was rather peculiar and lax. Every year, there were two academic semesters with one longer than the other. The longer one starts at the 3rd month and ends around the middle of the 8th month. On the 9th month, the citizens of the continent celebrate the harvest festival so no activities in the academy would be carried out then. After that, school resumed on the 15th day of the 10th month and ends around the 15th day of the 12th month and the vacation period would start again until the 3rd month of the following year. Lorist figured that the long winter break was due to the culture of Grindians to stay cooped up in their homes during the winter.</p><br/><p>Additionally, while the Dawn Academy boasted to have over 5000 students, it was already quite a good number if at least 2000 plus of them showed up for studies during a semester. Most others were usually registered students who worked part time in the academy or took some time off from school to earn some money to pay their fees. Some others were like Charade who took advantage of the cheap housing rent in the academy and even brought their families along to stay there with them, as evidenced by one survey Charade conducted some time ago which revealed some students who had already been there for 5-6 years and were unwilling to graduate because they wanted to live in the student dorms. The lax regulation of the students of the academy made Lorist feel that it was more of a commune than an educational institution.</p><br/><p>As Els had mentioned before, Lorist had already become one of Morante City’s most well-known personalities with his moniker being Iron Locke the Silver Undefeated, a proud dual Gold ranked instructor with an Iron ranked Battle Force. Some rumors even said that during the year end academy assessments, the Dawn Academy’s rank would rise by one place, setting it ahead of the Saint Marceau Academy. The main contributor to that rise in rank was probably Lorist’s victories over the Silver ranked instructors from the 27 different academies of the Academy Sector.</p><br/><p>After the 7th month, the number of Silver Swordsmen who came to challenge Lorist had decreased quite substantially despite the fact that Academy Head Levins raised the reward prize to 500 gold Fordes. Charlando, the owner of Red Grace Inn even said, “While 500 gold coins certainly seems appealing, most people knew that they wouldn’t be able to obtain it without enough skill. Rather than chasing after a pipe dream, people would probably grasp the 10 gold coins that would be required for the registration fee tightly within their hands instead.”</p><br/><p>That caused Lorist to feel rather bored as he had already been accustomed to dueling people for the past few months. Now that the number of opponents had suddenly lessened, he felt like he had nothing else to do. Even though he wanted to go adventuring with his other mercenary buddies, he was unable to do so as he still had things to settle within the academy. That was why he brought the two kids and Reidy and invited his other friends from the academy to the Red Grace Inn for a feast once again.</p><br/><p>Intimately scrubbing the nose of the little girl who was tugging at his arm, Lorist said, “Alright, alright. I’ll get my little princess her favorite chicken drumstick.”</p><br/><p>Looking towards the counter, Lorist shouted, “Louise, ask McDuffin to make me another plate of fried chicken drumsticks.”</p><br/><p>Standing behind the counter was the new female owner of the inn, Louise, who had just got married to Charlando three months ago. After purchasing another elixir from the Mishla Shrine to recover her fertility, she got pregnant pretty quickly despite not having been married for long. That caused many to praise Charlando for still having ‘it’ in him despite being of relatively old age. Though, Els privately told Lorist that the old man ordered quite a few jars of Terrence-donkey whip from him. “If that didn’t help him recover his sexual ability, then he would only have himself to blame,” said Els at that time.</p><br/><p>The golden-brown chicken drumstick was quickly served on the table and Alisa took two of them and said that she would give her brother one and ran off. However, a little bit later, Alisa came back and took two more.</p><br/><p>“Huh? Alisa, why are you eating that fast? I’ve only managed to get two bites out of my own during this short time. Could your mouth actually be bigger than mine?” said Els as he teased that cute girl.</p><br/><p>“It isn’t! Alisa’s mouth is small unlike yours. Just now, I gave the chicken to a beggar who looked really pitiful,” said the little girl, dissatisfied at having been said to have a big mouth.</p><br/><p>Lorist gave the girl another two drumsticks and said, “Now, don’t go giving these to the beggar again, okay? If he really needs it, you can ask your brother to give him two copper coins.”</p><br/><p>The girl took the chicken and replied innocently, “But my brother has already given him his money. He said that he was from the Northlands who had come to Morante City to look for someone called Norton Lorite whom he referred to as his young master. Big Sis Louise said that she hasn’t heard that name before and gave him a bowl of porridge. Alisa only gave him her chicken because he didn’t have anything else to go with the porridge.”</p><br/><p>……</p><br/>\n</div>"}