{"title": "Chapter 62 Offense and Defense", "id": 62, "volume": 1, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-62-offense-and-defense", "volume_title": "Volume 1", "body": "<h1>Chapter 62 Offense and Defense</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Offense and Defense</p><br/><p>Marksman Josk looked to be in his thirties. With his head of blonde hair and well-defined physique, he looked exceedingly handsome and wore a resolute expression on his face. However, Lorist could detect a faint hint of grief between his eyebrows.</p><br/><p>After receiving him from the entrance and introducing him to the rest of the family knights, Lorist gave a brief summary of the convoy’s situation and told Josk about how he captured the camp out of retaliation from the attack earlier that day. He also asked Josk the main reason he decided to visit them.</p><br/><p>Knight Josk also spoke rather frankly and said that he had come to check whether the military might of the convoy could withstand the attack from the count’s regiment of garrison troops as well as another company of pike cavalry. His original intention of lurking around the area in the afternoon was to sabotage and burn the count’s supplies as the security was more lax than usual and force the count’s army to retreat to their main base to resupply and give the insurgents of the western mountains some time to rest and recuperate.</p><br/><p>Now that Lorist had conquered the camp, he had unintentionally helped the insurgents out. Josk confessed that when he saw Lorist bringing less than 100 soldiers to attack the camp, he thought that Lorist’s forces wasn’t really trying to conquer it given the disparity of his forces and that of the camp. He also said that he was anticipating the arrival of the other company of pike cavalry to come back to defend that place before he met Charade and the rest of the convoy when he was leaving the forest and understood that the pike cavalry unit had probably clashed with the convoy already. Worried that Lorist wouldn’t be able to handle the full brunt of the count’s forces and incur a huge loss, Josk felt that he should warn them just in case.</p><br/><p>According to him, Count Cobry had a total of five companies of garrison troops with each having a bowman squad, an infantry squad as well as two pike infantry squads with each squad having 120 people each. All the soldiers in the garrison troops numbered around 2400 people. Including the company of pike infantry that was patrolling the outer areas of the mountains, the count’s rebel-sweeping troops had up to 2900 people.</p><br/><p>Charade interjected and mentioned that according to Soria, they only had 1000 pike infantry and 2000 garrison troops and wondered how the count had managed to expand his forces that quickly.</p><br/><p>“Who’s Soria?” Josk asked. Charade proceeded to tell the knight about their encounter with Baron Charles and his son.</p><br/><p>Curling his lips, Josk said, “I know Baron Charles and I’ve even met him a couple of times. Knight Soria’s information isn’t totally wrong, but the information only describes the count’s forces a year ago. At that time, the count had only returned to his dominion for a short while. Given that he has been fighting battles here and there and wiping out several landed nobles, he definitely would have expanded his forces by now. Other than the troops that were dispatched to wipe out the insurgents in the western mountains, Count Cobry still has around three companies of pike infantry back at his dominion as well as a regiment of garrison troops and two other newly-formed companies of garrison troops.”</p><br/><p>In the recent times, the troops of the count have successfully wiped out a few insurgent strongholds in the mountains and obtained a substantial amount of food and other supplies. During the past two days, they had turned their attention to the largest insurgent group in the area who were based at Hiddenbull Stronghold. While the insurgents at the stronghold have managed to resist due to the advantage of terrain, they were at their breaking point due to the sheer number of casualties they had sustained. That was why Josk intended to burn the supplies of the camp to ensure that the assault will stop temporarily. However, now that Lorist had occupied the encampment, the count’s forces will definitely return to recapture the place when they get wind of it.</p><br/><p>Josk suggested to Lorist that if their forces would not be enough to defeat that of the count’s, they should quickly leave the area and burn the whole camp down to force the count’s forces back to the dominion. Given that the western mountains was only one day of travel away from the camp, they would definitely get news about the conquered camp and return by the evening of the next day. If the convoy doesn’t hurry up, they wouldn’t be able to escape in time.</p><br/><p>Shaking his head, Lorist said, “No, the convoy cannot leave. They’ll definitely catch up to us if we try because the convoy travels so much slower than a single military unit. As long as the pike cavalry manages to stall the convoy, their regiment of infantry garrison troops will definitely catch up eventually. Instead of giving the enemy the advantage of attacking us head on in an open field battle, it would be wiser to secure the camp and use the terrain to our advantage to minimize our losses.”</p><br/><p>Filled with killing intent, Lorist said, “If we’re going to fight, let’s give it our all! I want to use this camp to wipe out all the 3000 men of their rebel-sweeping army and teach that damned count a lesson.”</p><br/><p>He also elaborated that even though the count’s forces outnumbered them three to one, their actual battle prowess was far inferior to that of the convoy’s forces. According to the testimonies of the prisoners, the only unit of the count that posed a threat to the convoy was the pike cavalry unit which were constituted mainly of soldiers who have had their Battle Force awakened. However, if their cavalry lost the advantage of charging and had to engage in close combat with the convoy’s heavy-armored soldiers, they would definitely be wiped out without question. As for the remaining 2000 garrison troops who can’t utilize Battle Force, wouldn’t they just be like a herd of sheep thrown into the midst of a wolf pack that was Terman’s Battle Force-trained knight brigade?</p><br/><p>As for Yuriy and his squad of light cavalry scouts, they will ensure that not one of the count’s soldiers manage to escape. Lorist also mentioned that they also had crossbowmen, pike infantry as well as a carroballista unit and he couldn’t imagine how in the world the convoy would lose to the count’s forces.</p><br/><p>“As for how we would bait the enemy into our trap, that’s easy. Knight Josk has mentioned that even though the sweeping troops have breached a few mountain strongholds and have gotten ahold of a batch of supplies, it would only last them for up to 6 days at most. After receiving news of their camp being conquered by us, they will only be left with two choices. Either they return to the count’s dominion or come here to try to recapture the camp. I’m sure they will choose the latter, because if they choose to return to the count’s dominion, they would definitely be severely punished by the count for the deaths of three of his illegitimate sons. The officer in charge will have no choice but to try to recapture this place to make up for the losses he has incurred.</p><br/><p>“When we defend the camp, we must lure them into a false sense of security and let them feel that they have a chance at taking the camp back. After two days of stalling, we’ll open the gates and let all of their forces in and use various obstacles to limit their efficiency and deploy the heavy-armored soldiers to give them a fatal blow and wipe them out entirely.”</p><br/><p>Everyone in the tent looked as if they had been struck by enlightenment. All of them knew that there was no way to avoid this conflict and agreed with Lorist that they would fare better by defending the camp rather than being pursued on an open field. To Lorist’s credit, he also came out with a rather viable plan that could potentially cause the enemy a loss of 3000 men.</p><br/><p>Bringing the map of the area surrounding the camp over, Charade started to discuss with the rest about how they would set up their traps and contraptions to shave down the enemy’s forces.</p><br/><p>Josk seemed like he was a little envious of Lorist and his knights’ solidarity. Seeing the group talking about how to set up the defensive fortifications, he turned to Lorist and offered to lend a hand in the upcoming battle.</p><br/><p>Lorist naturally agreed to that proposition and told Josk that the Norton Family’s convoy will definitely be sparing no resource in the battle to come and that if Josk was able to gather some people to ambush the enemy’s rearguard, he would definitely be a huge help to the convoy.</p><br/><p>Upon hearing the suggestion, Knight Josk agreed to it excitedly and said that he would head back to rally up the insurgents and trail the count’s rebel-sweeping forces from behind their backs and launch their ambush when the forces are being lured into the camp. He then left the camp hurriedly.</p><br/><p>—————————————————————–</p><br/><p>Evening on the day after, Count Cobry’s forces appeared nearby the camp as expected with the pike cavalry company leading the charge. When they arrived at the camp entrance, the soldiers witnessed the display of severed heads that were impaled on stakes with the head of the brown-haired man placed at the foremost front.</p><br/><p>The pike cavalry all started freaking out and cursed loudly towards the encampment. Some of them even tried to rush to the entrance directly, only to be shot down by the crossbowmen stationed at the walls, causing 10 casualties to their side in the opening volley.</p><br/><p>When the garrison infantry arrived, they sent out four squads that were fully-armed with shields to protect them from the crossbow bolts while they retrieved the heads before setting up their camp in the distance.</p><br/><p>Standing on the walls and nodding, Lorist commented, “The officer in command seems pretty level-headed and his troops are pretty disciplined. Fatty, let’s go. Els, there won’t be any more attacks tonight. The real show starts tomorrow.”</p><br/><p>Charade said in a worried tone, “What if they don’t use the main entrance and start attacking from the other parts of the walls of the camp? For the record, we have most of our forces stationed here at the entrance.”</p><br/><p>“They won’t,” said Lorist as he pointed towards the walls. “Look, Count Cobry didn’t choose this place to build an outpost arbitrarily. First, the terrain around here is flat without any elevated lands around the area apart from a slight two-meter-high slope outside the camp that makes it easier for cavalry to gain momentum and charge downwards as well as make it hard for the enemy to observe the situation within the camp. Second, other than the three-meter-long road leading to the main entrance, there is no other way to enter the camp as it is surrounded by a two-meter-wide moat that has a depth of around two meters. Even if they manage to cross the moat, they will be met with a barricade that is two meters tall with a 1.5-meter-tall fence right up on the main walls. When defending the surrounding areas, one can hide behind those fences for extra protection.</p><br/><p>“So, if they want to attack from the other sides, they will have to first fill up the moat before they remove the barricades to make some space for ladders, which in turn have to be at least 5 meters tall to overcome the fence. I’m sure they understand that attacking from the main entrance of the encampment is the optimal way as it they were originally stationed here anyway. And given the amount of time their supplies would last them, I doubt that they’ll resort to such time-consuming methods by circumventing the main entrance. To be honest, the fortifications of this camp may actually be stronger and better than that of some other castles that I’ve seen. I bet the count didn’t expect that his forces would have to siege the encampment that he had built to protect his forces from insurgent assaults. It’s like they’re digging their own graves by attacking this place.</p><br/><p>“Apart from the main entrance, there is also a smaller one at the rear of the camp, but to get there, the drawbridge would have to be lowered so that soldiers would be able to cross the moat. I believe the most they would do would be to send a pike cavalry squad to secure that drawbridge from the other side so that we won’t be able to escape. As for the main force, they would fare much better by attacking directly from the main entrance. I’m sure that they are under the impression that victory would be theirs the moment they breach the camp. Have some old men and children wear armor and patrol the walls tomorrow to make them think that we’re short on personnel and lower their guard.”</p><br/><p>Els asked, “Then, what if they send a Gold rank expert to sneak into the camp at night?”</p><br/><p>Lorist laughed and said, “Els, do you think everyone is a nightcrawler like you? The prisoners said that there were 11 illegitimate sons leading the sweeping operation and only 3 of them are Gold ranks with the others being Silver ranks. I’ve already killed 1 Gold rank and two other of the Silver ranks, so I bet that they definitely wouldn’t dare to sneak inside again. Know that one-on-one fights and all out battles are different: on the battlefield, you can swarm the enemy with your subordinates if you aren’t able to take out your opponent. But if anyone dares to sneak in like you mentioned, that person would not be able to bring many people with him or he will risk being discovered by us. Being all alone, the odds of the person returning alive are slim, so they definitely wouldn’t bother doing that. Additionally, we have Potterfang and Loze on night duty today, so what is there to fear?”</p><br/><p>……</p><br/><p>The whole night passed without incident. Given that the count’s forces have spent a full day rushing back to the camp, it wasn’t weird for them to rest and recover their energy for the night. And Lorist’s side didn’t send anyone out to harass them either. Coupled with sightings of old men and children wearing armor on the walls, the enemy also came to the conclusion that Lorist’s forces were severely undermanned to the point where they were even forced to conscript the children and elderly.</p><br/><p>During noon, the count’s forces sent several loud-mouthed garrison troops over and they started shouting for Lorist’s group to surrender the camp or face certain death. Annoyed at their loud ramblings, Lorist ordered the crossbowmen to turn them into human porcupines and quickly ordered for the old men and children to leave the walls as the battle was about to start.</p><br/><p>As expected, the deaths of the soldiers who had come to demand the occupants’ surrender had greatly angered the rebel-sweeping troops, causing hordes of men to emerge from their camp with the swordsmen in front and the bowmen following closely behind. The crossbowmen in Lorist’s camp reacted by open-firing right away. Given the advantage of being able to take cover behind the fence and the stronger firing power of the crossbow, the efficacy of Lorist’s crossbowmen far exceeded that of the enemy’s bowmen who had to fire the arrows in a parabolic trajectory to be able to even shoot remotely close to the crossbowmen on the walls.</p><br/><p>The bowmen were currently in a very awkward position; they would suffer huge casualties from the crossbowmen if they approached too closely, but if they didn’t, they wouldn’t be able to cause the enemy any harm. After shooting a few volleys of arrows, aside from planting a couple of arrows onto the wooden fences, they didn’t manage to kill even one crossbowman.</p><br/><p>They were subsequently ordered to retreat and the enemy tried to employ a different tactic. They sent their shield and sword infantry troops forward to attract fire from the crossbowmen in an attempt to cause them to waste their crossbow bolts. At that moment, Lorist ordered the crossbowmen to stop firing and let the enemy’s infantry arrive at the main gates before he ordered for it to be opened. Terman’s knight brigade that had been standing by beyond the gates instantly charged towards the enemy’s infantry troops like a tiger pouncing towards its prey. Chaos ensued and blood was spilled with only 50 of the 200-odd infantry soldiers managing to return to their camp alive.</p><br/><p>The pike cavalry units of the enemy had wanted to intercept Terman’s knights, but they were fended off by the constant firing of the crossbowmen. By the time the count’s forces mobilized their bowmen in response, Terman’s knight brigade had already returned to the camp. That exchange alone caused the rebel-sweeping troops a loss of over 150 infantrymen whereas Terman and his knights weren’t injured in the slightest.</p><br/><p>Even though the enemy had incurred quite a loss, their commander believed that it wasn’t for naught. According to the reports of the pike cavalry soldiers who had attacked the convoy while it was on its way to the camp, the convoy’s forces was estimated to have around 100 crossbowmen who were currently guarding the camp from the walls, the 40-odd knights who had rushed out just now and only a few hundred other infantry pikemen. Seeing the old men and children on the walls of the camp earlier that day, the commander’s belief that the convoy had lost quite an amount of soldiers when they fought against the forces that were stationed at the camp was reaffirmed once again.</p><br/><p>In the afternoon, the enemy stopped their attacks and only sent some pike cavalry soldiers to spy on the convoy’s movement from afar. The rest of the infantry soldiers were sent to fell some trees in the forest and move the logs back to the camp. Lorist could see the soldiers working together to make large wooden shields and battering rams out of the wood they have obtained.</p><br/><p>“It seems that the main attack will be launched tomorrow. Are the fuel jars ready?” asked Lorist to Charade who was standing beside him.</p><br/><p>“Yeah, we have 55 of them in total. I wonder if they’re enough,” said Charade in a worried tone.</p><br/><p>“That’s more than enough. Tomorrow, we’ll burn down their siege engines and initiate our counterattack,” said Lorist as he laughed.</p><br/><p>……</p><br/><p>Just as Lorist was about to wipe his body of his sweat after completing his training routine in the morning of the next day, Charade ran over and said that the enemy has started their assault.</p><br/><p>Sol, it’s still so early! The sun’s not even out yet! Lorist looked towards the sky and discovered that the weather was rather dark and cloudy. It seemed that there may be snowfall coming either in the afternoon or the evening. It was currently the 1st month, so a number of heavy snowfalls was to be expected. The rebel-sweeping troops might have picked up on the change in weather as well and decided to launch their attack earlier.</p><br/><p>Looking at Charade, Lorist said, “Go check on the family members of the soldiers and make sure they have enough to wear to accommodate for the changing weather. I don’t want any of them falling sick due to the cold and cause us any trouble. I’ll handle the matters concerning the battle, so don’t worry about it.”</p><br/><p>……</p><br/><p>Standing on the walls, Lorist could see the enemy soldiers lining up side-by-side behind rows of wooden raft-like shields and marching forward step by step. Behind the rows of shielding were three simple battering rams that were pushed by tens of other soldiers. The whole group traveled along the road rather slowly.</p><br/><p>Lorist, standing beside Potterfang, who had been on night guard duty during the night, laughed out loud. “It would appear that today’s battle will turn out to be quite ferocious. They seem so desperate.”</p><br/><p>Potterfang nodded and said, “The change in weather must have affected their plans as well. If they were to stay there for the next few days amidst the snow, they would be better of retreating right here and now. They probably have no choice other than trying to recapture the camp given that their resources wouldn’t be able to sustain them for long. They must have no other option aside from forcing their way through without regard to their casualties for the sake of taking the camp back. I believe that we will be able to launch the trap without having to wait until tomorrow.”</p><br/><p>Lorist replied, “Alright. If they continue the assault with full force, open the gates and lure them inside. I doubt postponing it for another day would make much of a difference.With the weather looking like this, even if they want to retreat, they wouldn’t be able to go far. Reidy, notify the rest that we’ll be giving our foes there a huge surprise…”</p><br/><p>……</p><br/>\n</div>"}