{"title": "Chapter 86 Construction Staff Appointment", "id": 86, "volume": 1, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-86-construction-staff-appointment", "volume_title": "Volume 1", "body": "<h1>Chapter 86 Construction Staff Appointment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Construction Staff Appointment</p><br/><p>During morning the next day, Josk, Shadekampf and Patt brought fifty guards and 24 carriages with them to the copper mine. The main reason for that excursion was to rescue the members of the Norton Family as well as eliminate the thirty or so mercenaries hired by the Kenmayses to be stationed over there.</p><br/><p>Ovidis and Reidy on the other hand repurposed the coachmen into a garrison squad which was tasked with maintaining the security of the two walls of the castle in construction. The remaining 70 or so guard squad members were subsequently assigned to watch over the thousands of slave laborers and the surrendered mercenaries.</p><br/><p>The plan had been drafted out the night before. Originally, Lorist wanted to go to the mines himself, but that idea spawned unanimous disapproval from his subordinates. Josk said that they couldn’t let Lorist, their leader, do all the heavy-lifting and said that his frequent handling of every matter, large or small, caused a family knight like him to feel pathetic and useless. Lorist thus agreed to allow Josk to bring Shadekampf and Patt with him to the mines while he stayed put at the construction site.</p><br/><p>After sending Josk and the rest off, Lorist patrolled the surroundings for a bit before returning to the building atop the inner walls. The more he stared at the sand table, the more questions surfaced within his mind. Having only obtained their dominion for less than two years, the Kenmays Family was able to carry out their expansion plan within such a short time. However, even though the Nortons have been enfeoffed their dominion for two hundred or so years and have had 7 generations of family heads, not only were they unable to successfully develop their land, they even ended up being sealed in the Northlands. Given the dire state of the family, they could only turtle up and hide in their bastide without being able to retaliate.</p><br/><p>Lorist really troubled himself over the fact that his own family had allowed the Kenmayses to do as they pleased within their dominion without taking any action. Given that the Nortons have successfully repelled the assault on their bastide by the viscount half a year ago, and taking into account that the viscount himself had lost tens of men during that assault, it showed that the Norton Family still had quite a bit of military power. Logically speaking, the moment Viscount Kenmays started to retreat, the Norton Family would’ve sent some scouts to monitor the situation of the enemy’s soldiers. However, not even one scout has been sighted during that span of time. What, then, had happened to the family?</p><br/><p>It could be that the family had sent out scouts already on another target other than the Kenmays Family, but according to the leader of the mercenaries, one such scout had quickly left after discovering that the copper mine had been taken over. Sigh, I really shouldn’t be thinking about the potential income the mine would bring during a situation like this. Additionally, even if the mine was being occupied, they should at least worry about the wellbeing of the Norton Family members who were working there. However, not even a single messenger was sent to the Kenmays Family to negotiate their release. It was truly too weird.</p><br/><p>Even though Lorist was only 1 day of traveling away from the family bastide, he couldn’t just leave everything here and depart without the others. He would still have to consider how he would manage the 1000 or so slave laborers as well as the 40-odd surrendered mercenaries as well as what to do with the semi-complete castle that he had just conquered. Lorist really missed Charade’s presence; if he were there, Lorist would be able to leave everything to him without any worries.</p><br/><p>Upon thinking of Charade, Lorist’s thoughts drifted onto his fellow knights and friends, Potterfang, Loze, Els, Terman and Yuriy. I wonder if they’ve started the journey again with the convoy and how long they will take before they arrive at the Northlands. Gosh, there’s the trouble of making the preparations for the arrival of the convoy as well…</p><br/><p>Lorist’s head started to hurt when he recalled the large group of people that was traveling to the Northlands. Given Charade’s temper, how many of them would still remain by the time they reach the dominion? 20000? Or 30000? Thinking of how to let the people of the convoy settle down after they arrive was also quite a huge undertaking.</p><br/><p>Looking back at the sand table, Lorist’s gaze suddenly brightened up as he thought, isn’t this the perfect place for them to settle down? I only have to take the plan of the Kenmays Family and implement it myself! If I choose to continue the construction of the castle here, the slave laborers would also have retain their jobs and I won’t have to trouble myself to think about what to do with them. And when the castle is complete, I can have them go work on the hill city, after which they will be granted freedom and allowed to become citizens of the family’s dominion.</p><br/><p>Lorist wasn’t worried about the costs involved to build the castle, as he wasn’t lacking in money. There were only two things that he had to carefully consider. First, was the staff he would appoint to supervise and manage the construction project. Second, he would have to find a way to procure the materials required for the construction. Being the founder of one of the largest construction merchant guild of the former empire, the Kenmays Family naturally would have their own ways of finding materials and workers for their project. However, Lorist didn’t have that ability and the Kenmayses may even prove to be an obstacle to the project’s continuation.</p><br/><p>“Men, get that old man with a goatee, what’s his name… Ah, I remember. Get Boris to come here,” instructed Lorist to the guards outside.</p><br/><p>Butler Boris was quickly brought over and Lorist started to ask him about further details on the blueprints of the castle as well as some more information on the Kenmays Family.</p><br/><p>According to Boris, Viscount Kenmays wasn’t living at the Redriver Valley Bastide but rather the most developed city in the Northlands that was within the dominion of Duke Loggins, Gildusk City, where he owned a large viscount manor. Ever since Viscount Kenmays’s cousin sister had become a mistress of the duke, the relationship of the Kenmays Family and Duke Loggins had gotten pretty close. The Kenmayses has also helped out quite a lot with the formation of the duke’s Northland Army.</p><br/><p>Viscount Kenmays preferred to stay in Gildusk City because he was a man who revelled in the parties and social gatherings of the nobles there and loved the company of the other noble ladies which his rural bastide castle was completely devoid of. The other reason was to maintain his good relationship with the duke. His presence during the return of his family’s convoys when it entered the customs of the duke’s dominion also made it harder for the duke to brazenly purchase too many items for half the market price.</p><br/><p>The Redriver Valley Bastide of the Kenmays Family was currently only serving as a transfer point for the resources and supplies they transported around. And the butler also revealed that there would be a large shipment of around 3000 buckets of green vine glue, construction tools, an estimated 250000 kilograms of food as well as some other necessities like clothes to the construction site on the 10th of the next month. There might even be around 1000 extra slave laborers with another 200 or so female slaves.</p><br/><p>“Are the female slaves the family members of the slave laborers?” asked Lorist curiously.</p><br/><p>“Um, they aren’t, milord. The slave laborers are mostly strong and virile youths. So, to stop them from causing trouble, we must placate and reward them once in a while. These female slaves are for that specific purpose. If the laborers perform well in their work, they would be allowed to spend a night with a female slave. This is a tried and true method the Kenmays Family has used to manage their slaves over the years,” said Butler Boris.</p><br/><p>Sol, that means that the women are there only to serve as sex slaves. Shaking his head, Lorist asked, “Are the Kenmayses that rich? I heard that they got their dominion by donating 200000 gold Fordes to the Second Prince. They should’ve spent quite a bit on the construction of Redriver Valley Bastide during the last two years. And now, they are prepared to allocate another 300000 gold Fordes for the development of the Morgan Hills. They must have at least millions of gold Fordes in hand to be able to accomplish all that.” Lorist then pointed to the sand table.</p><br/><p>Butler Boris explained, “Milord, from my experience of working at the Kenmays Family for 40 plus years, they are actually doing worse than before. I’ve always believed that the old master had decided to develop the Morgan Hills as a final lifeline for the Kenmays Family. They haven’t made much money after the civil war broke out in the empire a few years prior. And ever since the founding of the Second Prince’s Iblia Kingdom, they have been using their reserve funds. Even though the budget for the development of Morgan Hills is 300000 gold Fordes, 100000 of that is allocated to the construction of the castle and the city while the rest will be used to help the citizens settle down after the completion of the construction.”</p><br/><p>“100000? That shouldn’t be possible. Based on my estimations, the construction of the castle should cost at least seventy to eighty thousand gold Fordes. There’s no way that 100000 gold Fordes would be enough for both the castle and the hill city,” said Lorist.</p><br/><p>“Milord, in actuality, the cost for the construction of the castle is only 30000 gold Fordes, with most of the money being used to purchase the 12000 buckets of green vine glue and the rest to be spent on the resources and food required by the workers. Given that the main labor force of this construction project will be the slaves of the family, it wouldn’t cost them anything. And, some of the building materials can be foraged from the surrounding area. For example, the completion of this wall only used up 2000 buckets of green vine glue: the other materials used to make green clay were mostly gathered from the surroundings.”</p><br/><p>Oh, so according to Boris, apart from the green vine glue, the rest of the building materials can be harnessed elsewhere. This is good news indeed.</p><br/><p>“Then, Butler Boris, you should understand how much supplies is left over here right?” Lorist asked.</p><br/><p>Given that they had just conquered the castle the day before and Josk having just set out during the morning to the copper mine, Lorist’s group still hadn’t made an inventory of the supplies at the construction site.</p><br/><p>“Milord, during the past four months, there have been 3 shipments of resources to the construction site that mostly comprised of green vine glue and food. With every shipment having 3000 buckets of green vine glue and given that 2000 buckets have been used to construct the walls, there are currently 7000 buckets remaining. By the time the next shipment on the 10th of the next month arrives, the 12000 buckets required for the construction of the castle will have all have been delivered and the following shipments after that will mainly concern food. If there are no changes, the shipment should come as planned. Nowadays, the food we have in the warehouse is running low with around 20000 kilograms left. The next order for food is supposed to be carried out after the following shipment, but now that you’ve conquered the site, there is a chance that it wouldn’t come anymore. So, you will have to provide food for these laborers.”</p><br/><p>Boris looked at Lorist for a while before he continued, “Milord, The food available to the slave laborers is really limited. Given the tiresome nature of their work, each person requires 1.5 kilograms of food that will be split up into three meals a day. That means that the 1000 slave laborers would consume more than 50000 kilograms each month[1]. Milord, if you intend to use the slave laborers, you must make sure they have enough food to sustain them.”</p><br/><p>Lorist stood up, went beside Boris and gave his shoulder a pat before saying, “Butler Boris, you’re pretty good at what you do. If you continue to give it your best, the Norton Family will definitely not mistreat you. Alright, you may go back for now.”</p><br/><p>“Yes, milord,” said Boris as he bowed and started to leave. Just before he exited the room, Lorist suddenly thought of something else.</p><br/><p>“Oh, wait, Butler Boris, where did the Kenmays Family buy so many of these ballistas?”</p><br/><p>Boris replied, “Milord, these ballistas were order-made and not purchased. Three years ago when the Kenmays Family went to purchase slaves, they bought a father and son who used to be famed ballista craftsmen of the Teribo Kingdom who was sold into slavery as a result of offending a noble. Even though the Kenmays Family was a landed noble family, they did not have good family knights nor did they have a proper garrison, so they could only hire mercenaries to defend their territories. To strengthen their castle’s defense, they sent the father and son over here to craft some ballistas to be installed here.”</p><br/><p>“Where are the two that you’ve mentioned right now?”</p><br/><p>“They’re together with the slave laborers,” said Boris.</p><br/><p>“How about this, Boris, please make sure the father and son have everything they need. They will be of good use to me in the future. And you, accompany Butler Boris on this errand and make sure to cooperate with him in completing it,” said Lorist to a guard standing nearby.</p><br/><p>“Yes, milord.”</p><br/><p>……</p><br/><p>As Lorist circled around the sand table within the room, he thought about what Boris had said. The issue with the food wouldn’t be a problem as the smaller convoy he had returned with had more than 50000 kilograms of food which would definitely be able to last the workers a whole month. By the time he returns to the dominion, he would then be able to send more food over to the construction site. Or, he could try to take the food shipment that will be coming the next month, though that was still some time away so there wasn’t a need to worry.</p><br/><p>It was currently the 32nd day of the 2nd month and Josk and the others would be returning the next day. The day after that would be the 34th day of the 2nd month and Lorist had to depart for the family bastide no matter what on that day. However, who would be in charge of the construction of the castle after his departure? There was no way Josk could, as he was a lone ranger who wasn’t that good at working with others and hated troublesome matters like this, as exemplified from his previous performance when Lorist once asked him to form a mounted cavalry unit only to have Josk quit after a few days due to lack of interest after sending the men back to Yuriy’s light cavalry scouts.</p><br/><p>Shadekampf must also return together with him as Lorist would need him as a guide given that he had not been there in person even once before as he had transmigrated when the original owner of the body was studying at Morante City. He could have Josk, Reidy and Ovidis stationed here to watch the place and he believed that the guard squad would be more than sufficient for the castle’s defense. However, Lorist needed someone to be in charge as he didn’t know how long he would spend at the family bastide before he would be able to return to the castle here.</p><br/><p>“Bring the grand architect over here,” instructed Lorist.</p><br/><p>The architect who had been given 50 canes had been brought before him. The once arrogant looking man currently looked incredibly haggard with his hair tousled all over his face and his garments torn and stained with blood. With a body full of cane marks, he slowly limped into the room.</p><br/><p>“Grandmaster Ciroba? It was pretty rude of me the day before. I am the dominion lord of this land, Norton Lorist and I intend to have the construction of this castle continue as planned. I wonder if you would be willing to oversee the construction for me? I will definitely give you the appropriate remuneration for your efforts,” said Lorist sincerely.</p><br/><p>Grandmaster Ciroba merely gave Lorist a venomous glare without saying a word, having learned his lesson the day before. But he still spit on the floor and looked high up to the roof, indicating that he did not intend to give Lorist any heed.</p><br/><p>Bursting out in laughter, Lorist told the guard, “Since he dirtied my room, should I have him lick his own spit clean?”</p><br/><p>“Milord, that sounds like a good idea,” replied the guard with a serious look.</p><br/><p>Grandmaster Ciroba’s face tensed up as he shivered at that moment…</p><br/><p>“Oh well, let’s not give him a hard time. For someone of his age to still behave so uncouthly… Just bring him back to his quarters,” said Lorist.</p><br/><p>[1] Each month on the Grindia Continent is 35 days long. See Chapter 30 for an explanation of the calendar.</p><br/>\n</div>"}