{"title": "Chapter 93 Enticement", "id": 93, "volume": 1, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-93-enticement", "volume_title": "Volume 1", "body": "<h1>Chapter 93 Enticement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Enticement</p><br/><p>Lorist had already been rather suspicious of the situation even before he arrived at the town. What kind of injury could cause a Three Star Silver knight of the family to be unable to recover even after three whole years?</p><br/><p>Given that he had taken the herbalist course at Dawn Academy before, even though he didn’t have proper certification as a rank 1 herbalist because that would require one year of practical training in the field and Lorist didn’t have the time for that, the fact that he had been able to complete the course meant that he was already a qualified apprentice herbalist. Combined with the ancestral medical techniques of his former life, Lorist wasn’t a stranger to the inner workings of the body.</p><br/><p>During his herbalist training, Lorist understood that in this world where Battle Force exists, no matter how serious the injury sustained, with proper treatment and the use of Battle Force, most injuries to the body would be able to recover. Even if one’s arm or leg were to be cut off, as long as it wasn’t missing, it could be reconnected. Even if the whole of the body’s bones were broken, it wouldn’t leave a permanent trauma on the body after recovery. There was a case where two Blademasters engaged in battle with the loser sustaining serious injuries to the point where his body was almost completely pulverized with him barely able to breathe. But after a year and a half’s time of treatment, the loser could once again move freely without issue and was able to retrain his Battle Force to its previous level before the injury.</p><br/><p>When Lorist was reading Belnick’s pulse just before, he noticed that his physical injuries had long recovered and the reason he was so weak and frail was because he was being poisoned for the long term with force-dispersing toxin!</p><br/><p>Thinking back at the food that was served to Belnick, Lorist didn’t have to be a genius to figure out that Master Dunbarsen was behind all this. Even though he’s only a rank 1 herbalist, he dares to call himself a master… Ptooey! How shameless. After regularly feeding Belnick with force-dispersing toxin, he caused him to be completely unable to recover his Battle Force. The meager meals he’s been having has also made him extremely feeble! Just by blaming all the symptoms on Belnick’s ‘ruptured internal organs’, he’s managed to trick a Three Star Silver ranked knight like him for this long a time!</p><br/><p>Three years ago, Belnick, one of the Norton Family’s most important military backbones, had been put out of commission just like that. Had he recovered quickly enough, father might have survived the battle with the barbarians! And if he were still protecting the family, then the Kenmayses wouldn’t have dared to set their sights on us.</p><br/><p>And just because we didn’t have a Three Star Silver ranked knight to rely on, the garrison forces dared to not heed the orders for reinforcements of the family during father’s expedition to repel the barbarians and even started to dream of breaking free from their status as peasants… At that moment, Lorist started to get angrier and angrier as the air around him turned cold from the killing intent he emanated.</p><br/><p>“Curses…” Lorist really felt like killing Master Dunbarsen and culling the rest of his family in one fell swoop. He solemnly swore that he would definitely not let any one of the Dunbarsen Family off unscathed.</p><br/><p>Even though Belnick was currently very weak, given his experience during his travels, while he was startled at Lorist’s sudden change, he still thought that it was because Lorist was grieving at his body’s current state. He smiled and patted the back of Lorist’s hands before he said, “Don’t feel too down, milord. I’m already used to this. One day, all this suffering will come to an end…”</p><br/><p>“Brother Beck, you can no longer stay over here. I will bring you back to the family bastide and find a way to cure you,” said Lorist.</p><br/><p>Belnick looked at him in a confused manner before he took a deep breath and said, “Alright, milord. I’ve also gotten sick of staying here. For the past three years, I feel like I’ve been imprisoned within this small hut. I’ve always dreamed of going back to the bastide…”</p><br/><p>“Without my permission, you won’t be going anywhere…” said a rough voice which sounded from behind Lorist and Belnick.</p><br/><p>“Oh, Master Dunbarsen, you’re here,” said Belnick softly.</p><br/><p>Lorist turned exceedingly slowly to his back and saw a proud, arrogant old man with eyes as deep as the abyss itself wearing a black long gown with a grey leather vest over it.</p><br/><p>“So you’re the herbalist they call Dunbarsen?” said Lorist as he carefully enunciated each syllable of his question.</p><br/><p>The old man gave Lorist a glance and didn’t pay him any heed as if he didn’t even acknowledge his existence before he circled around Belnick and said with his unsettling, crow-like caw, “Beck, your body is in a real terrible state now. Yesterday when you wanted to go back to the bastide to attend the inheritance ceremony, due to your unstable emotional state, the positions of your internal organs have once again shifted, rendering months of treatment and effort wasted. For your own sake, you’d be better off staying here without going anywhere.”</p><br/><p>“Dogshit!” Lorist roared. “Old man, why don’t you just admit that it’s your treatment’s inefficacy that’s at fault?! Three years ago when Brother Beck was injured from his encounter with the Northlander Bear, he could still travel to the bastide and to Wildnorth Town for treatment with some help. However, after your years of ‘treatment’, why would he be unable to take a single step on his own? Isn’t his current state worse than before he came here at all? I think it’s because of the incompetence of a self-proclaimed herbalist master like you that Brother Beck is in his current state. Brother Beck, I am bringing you back. At most, I’ll be spending a couple of gold coins to hire a proper high-ranked herbalist to treat you. Don’t worry, money is not something I lack.”</p><br/><p>The moment Lorist let out his outburst, the old man started to look disturbed. “Who are you? What are you doing here? Who allowed you to enter this hut?”</p><br/><p>“Hahaha… Who am I? Brother Beck, introduce me to that old geezer,” said Lorist.</p><br/><p>“Master Dunbarsen, he’s the new dominion lord and this town is within his dominion. It would do you good to pay him your respects…” said Belnick.</p><br/><p>“This… this one gives his respects to the dominion lord,” said the old man in a forced manner.</p><br/><p>“Good thing you understand your place, old man. Otherwise, I would’ve ended you personally with my sword. Considering the effort that you must’ve made to help Brother Beck, even though he didn’t get better at all, I’ll forgive your transgression. Now, you shouldn’t be against me bringing him back to the bastide, right?” announced Lorist with his hand on the handle of his sword.</p><br/><p>The old man’s started sweating more profusely as he said hesitantly, “Since milord believes it is the best course of action, I have no further comments. Please allow me to excuse myself to prepare the necessary medicines that Beck will need to consume back at the bastide so that his injuries don’t worsen…”</p><br/><p>“Alright, I give you one hour to prepare it,” Lorist said.</p><br/><p>Seeing the old man quickly exit the hut, Lorist looked at Belnick, who was currently wearing an extremely confused expression. He lightly squatted down and whispered, “Brother Beck, from this moment onwards, do not consume any food or drink unless I say you can, understand?”</p><br/><p>Belnick’s body shook with realization as he said, “You’re saying… I understand.”</p><br/><p>One hour quickly passed, but Dunbarsen still hadn’t returned with the medicine.</p><br/><p>Supervisor Kedan then came to report, “Milord, a few of the squad leaders of the Wildnorth Town garrison and the other family heads of the four great families have come to pay their respects. Please be wary as they probably didn’t come with the best of intentions.”</p><br/><p>……</p><br/><p>“These here are, the Mollin, Hassen and Qubim family heads as well as garrison squad leaders, Mollin, Hassen and Qubim. Oh, please watch out for that pothole on the ground. This one is Squad Leader Dunbarsen, and Master Dunbarsen, which you have just met previously,” said Kedan as he introduced the people present one by one to Lorist.</p><br/><p>Every one of them greeted Lorist respectfully with Lorist returning their greetings by nodding subtly.</p><br/><p>When the last one came over, Lorist laughed and said, “Master Dunbarsen, did you bring the medicines? Oh, it must be in this bag. Shadekampf, take it and don’t forget to ask the master on how it should be consumed. What? You’ll demonstrate right now? Hehe, there’s no rush. Come on, master. Sit over here. We’ll get to that after we discuss some stuff.”</p><br/><p>When everyone was seated, Lorist looked at each one of them before he began, “Given that you have all assembled here, there must be something that you want to tell me. I’ll be returning soon to settle some other matters, so please get straight to the point.”</p><br/><p>A fat old man stood up. According to Kedan’s introductions, he was the family head of the Mollins. The fat man made a greeting and explained their intentions.</p><br/><p>The Mollin family head first apologized for their absence during Lorist’s inheritance ceremony and cited the reason that they didn’t have the face to show up as they had not managed to prepare a congratulatory gift in time. That’s why the moment they heard that the dominion lord had come over to visit, they all rushed over to offer their respects and mentioned that they would once again send someone to the bastide to deliver their gifts at a later date.</p><br/><p>Lorist magnanimously said, “I don’t really mind things like that, but I thank you for your kind intentions. I will naturally be glad to receive your gift by the time it arrives.”</p><br/><p>After the pleasantries, they started talking about the core issues. The Mollin family head represented the garrison force to voice an objection to the Norton Family for their lack of communication during the last two years and the salary they owed the garrison force during that timeframe. Even though one garrison soldier’s payment is only 1 imperial silver coin per month, 200 of their salaries over 2 years amounted to 48 imperial gold coins and that was not a small sum.</p><br/><p>The second issue concerned the promise of the founding Norton Family ancestor with the garrison force of Wildnorth Town on the granting of roughly 7000 square meters of farmland per family member of a garrison soldier. Now that most of the farmable land around Wildnorth Town had been allocated, many family members of garrison soldiers did not obtain their fair share of farmland. They hoped that Lorist would rectify the issue as the new dominion lord so that the promise of the first ancestor doesn’t get violated.</p><br/><p>The third issue was about the relative size of the population and the amount of land they had. According to the Mollin family head, many of the family members of the garrison soldiers did not have much to do within the town. He requested Lorist to give them a few permits so that the citizens of the town who have nothing better to do can form their own merchant convoys to conduct trade. Naturally, the merchant convoys would still pay 10% of their profit to the dominion lord as per the agreed upon tax rates.</p><br/><p>Lorist kept smiling and nodding throughout the proposals as if he agreed wholeheartedly to the points made by the Mollin family head. But within his mind, a cold resolve was slowly building up. So they’re actually treating me as a complete idiot. You really think I don’t know the true reason you lot of trash have come to see me? The real thing you want are the trade permits so that you can use the Norton Family name to form your own merchant convoy. Without the permit, no other merchant convoy would agree to trade with you and you can only secretly smuggle and profit on a much smaller scale.</p><br/><p>Also, the ‘agreed upon tax rates’ of 10% is complete bull. While it is not unprecedented for dominion lords to give their subjects trade permits, the tax rates are usually around 30 to 50 percent. Some greedier dominion lords even charge up to 70%, which is not that uncommon. Did they think that the tax rates for trading would be the same as that of being a citizen of the dominion?</p><br/><p>When the family head of the Mollins finished up, Lorist expressed his apologies on the issue of the delayed salary and explained that he only got to know about it just now given that he had just inherited the position. He promised that he would definitely look into the matter once he returns and make the appropriate reimbursements. Lorist also mentioned that he brought 10000 gold Fordes on his trip back to the dominion, and, according to the exchange rates, 48 imperial gold coins were only worth 12 gold Fordes. He assured them that a small figure like that was no issue and that it would definitely be paid out.</p><br/><p>As for the second matter, Lorist said that the main problem was with the flawed system his ancestor had established. However, he said that he was confident that he would be able to solve it and asked them to listen to and consider his proposal.</p><br/><p>“Supervisor Kedan, how much farmland does Wildnorth Town have?” Lorist asked.</p><br/><p>“Milord, there are around 18 million square meters of farmland, or around 18 square kilometers, in the whole of Wildnorth Town,” replied Supervisor Kedan.</p><br/><p>“Here’s what I think…” Lorist said. “I plan to expand the garrison force of Wildnorth Town to 400 people.”</p><br/><p>“What?!” The several family leaders and squad leaders jointly let out a cry of surprise. The past few Norton family leaders had tried their very best to limit the scale of the garrison force, or even outright disband them altogether. Why, then, did Lorist make a proposition like that?</p><br/><p>“Milord, how do you plan to make up for the lack of farmland?” the Hassen family head stood up and asked.</p><br/><p>“Farmland? Farmland is everywhere,” laughed Lorist as he said, “Using Wildnorth Town as an example, say that there are 18 million square meters of farmland at Wildnorth Town. For a garrison force of 400 men, let’s assume every one of them and their direct family members include their parents, two wives, and two children, and that each person is given around 7000 square meters of farmland, each family would only need a little more than 40000 square meters of farmland, right? So 400 garrison soldiers only require approximately 16 million square meters.”</p><br/><p>“But… But milord, those garrison soldiers have other family members as well, like their siblings…” shouted the Mollin family head.</p><br/><p>“There’s no need to shout, I have a solution for that. Supervisor Kedan, bring me the map of the dominion,” instructed Lorist.</p><br/><p>The map was quickly unraveled on the table for everyone to see.</p><br/><p>“Look here, the land around this area is relatively flat and is not too far away from Wildnorth Town. I plan to have a new town built here. When it is complete, the area of the land around the town is more or less equal to that of Wildnorth Town’s. So, if I set up another garrison unit there, then I can distribute the land just like we did at Wildnorth Town, right?” said Lorist casually.</p><br/><p>“But, milord… That place occasionally gets attacked by mountain barbarians…”</p><br/><p>“So what? I’ve hired a well-known mercenary group over here just for that purpose. It’s fine and dandy if the barbarians don’t attack. But if they do, we can catch and enslave them to aid with the construction of the new town! Nobody complains about free labor! Also, just because there are barbarians there, you plan to turtle up in Wildnorth Town for the rest of your lives? Look at this vast land. There is so much potential for development! Also, the expanded garrison force must also be stationed at the town construction site for the long term. Given that the remaining 2 million square meters at Wildnorth Town that are still without owner, I plan to split it into three parts of 666 thousand square meters each and enfeoff them to three honorary knights respectively and let the citizens of the town pick one from the three to be the mayor of Wildnorth Town with the other two being the vice mayors,” said Lorist as he dangled his bait before the eyes of the family heads and the squad leaders.</p><br/><p>“Mi–milord… Is what you’re saying… true?” Quite a number of them started to get excited about the proposition.</p><br/><p>“Of course, I’m sure you guys know that I’ve been studying at Morante City for the past ten years. This method of government is quite popular over there as it is one of the most democratic ones to ever exist. I plan to slowly implement that in the dominion as well. Supervisor Kedan, for the next few days, stay at Wildnorth Town and make a registry of the family members of the deceased family soldiers as well as the citizens who don’t have any farmland. I plan to have them help out with the construction of the new town. What do you think, gentlemen?” Lorist said.</p><br/><p>“This… This sounds pretty good. We definitely agree to that proposition…”</p><br/><p>It’s a given that you do. Heck, maybe you can’t even wait for those people I asked Kedan to check on to leave Wildnorth Town for good, thought Lorist. With a calm look on his face, he said, “That’s great. I’ll leave the expansion of the garrison force to you. It’s best if you start allocating farmland to the candidates for the new garrison force. As for those who don’t have farmland allocated to them, let them help out with the construction effort of the new town as well. This way, there will no longer be any problems. I’m counting on you guys and will definitely remember your efforts.”</p><br/><p>“Milord, what about the trade permit?” said Master Dunbarsen with his rough, unpleasant voice.</p><br/><p>“About that, I apologize but due to being in conflict with the Kenmays Family, Viscount Kenmays has sealed off all our routes to exit the Northlands. Let’s discuss it again after we defeat the Kenmayses and gain control of the pathway to the outside world,” Lorist said.</p><br/>\n</div>"}