{"title": "Chapter 101 Mistakes", "id": 101, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-101-mistakes", "volume_title": "Volume 2", "body": "<h1>Chapter 101 Mistakes</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Mistakes</p><br/><p>By the time the sky brightened up, Lorist exited his tent to do some stretches. Shadekampf who was standing right beside brought over a linen cloth for Lorist to wipe his face with. When Lorist was done, Shadekampf handed him some gargling water.</p><br/><p>“Milord, breakfast is ready,’ said Shadekampf.</p><br/><p>Lorist waved his hand and said, “There’s no need, I only want two pieces of bread to bring with me when I go take a quick look at the wall ahead.”</p><br/><p>As he slept quite late the day before, Lorist woke up in the late morning. When he got to the walls, he noticed Old Man Balk standing there. Upon seeing Lorist approach from afar, Balk bowed and greeted him.</p><br/><p>As Lorist went up the walls, he saw the slave laborers working away to dig up a moat. After the laborers dug out the earth for the moat, they placed it within a rectangular wooden mold before they sprinkled some water within and covered it up with another wooden board on top. Following that, the laborers would then step on the wooden board repeatedly to compress and flatten the mixture within before dismantling the wooden mold to create a block-shaped piece of clay. After that, the slaves would stack the clay blocks together and repeat the whole process again.</p><br/><p>“What are they doing?” Lorist asked.</p><br/><p>Old Man Balk replied, “Milord, they are making clay bricks. After adding some green vine glue and letting them dry for a day or two, they will be nice and tough. By then, building structures is just as easy as stacking them up. As long as a proper foundation is built, the toughness of walls made with bricks like these is not one whit inferior to those made from stones. It is worth mentioning that a slave came up with this idea and he has already been selected to become Miss Telesti’s personal aide…”</p><br/><p>Lorist nodded and said, “If one has talent that serves the family well, then they naturally should be rewarded. Telesti made a good call on this matter. Hm? What are those people doing?”</p><br/><p>Lorist then pointed towards the scaffolding by the walls where a couple of laborers could be seen working.</p><br/><p>“Milord, they are evening out the surface of the walls to prevent enemies from being able to climb up and pose a threat to the defenders. This was also the idea of the aforementioned slave laborer. The rocks that are chipped off in the process can also be used to fill up the internal walls. It really is a pretty nifty idea,” said Old Man Balk.</p><br/><p>“Not bad, I see that the moat is almost done too. When does the wall construction officially start?” Lorist asked.</p><br/><p>“In another two days. The foundation for the walls can already be laid. We already sent some laborers to start collecting the stones that we need for establishing the foundation,” said Balk. He then pointed at a line drawn on the ground with limestone and said, “Look, milord. That will be where the foundation will be laid.”</p><br/><p>“Good work. That aside, doesn’t Miss Telesti come to the site in the mornings?” Lorist asked.</p><br/><p>Balk shook his head and said, “She usually doesn’t come over in person as most of the workflow has already been established. I’m the one who supervises all work in this area, so unless there is any urgent matter, Miss Telesti usually wouldn’t come to the site itself as it is too messy and dirty around here.”</p><br/><p>“Alright, I’ll leave you to your business and go discuss something with her,” said Lorist as he patted Balk’s shoulders before he turned and left.</p><br/><p>……</p><br/><p>Lorist went up to the rear wall and headed towards the middle of the 5 buildings. Upon entering, he saw the busy scene of four laborers carving away at something delicately using small chisels. Beside the table that was placed in the middle of the room lay Telesti’s maidservant, Vinny, who was currently looking intently at a model house she held within her hands.</p><br/><p>“Little Vinny, what are you up to?” Lorist asked.</p><br/><p>Vinny gave Lorist a look and quickly stood up. “Milord, this is a model house I made! Look, isn’t it pretty?”</p><br/><p>Lorist gave it a quick look before he noticed that the sand table in the middle of the room had been replaced by another one which had another replica of the city layout. It seemed that Telesti had remade the model of the mode according to what she had in mind.</p><br/><p>Lorist recalled that the main purpose of the city was to serve as a citadel, but the model seen on the table right now seemed more like a trade city than a military facility. Aside from the two walls on each side of the valley as well as the castle that was built along one side of the mountain range, Telesti had remodeled the whole replica of the valley into vast stretches of trade sectors and residential areas, which were even separated by small parks. Lorist could already imagine that if the city was built according to Telesti’s plan, it would definitely be a beautiful place.</p><br/><p>However that was not what Lorist had intended the city to be. He praised the beauty of the replica of the city before asking Vinny where Telesti was.</p><br/><p>Vinny pointed to the door of the next room and Lorist went over to give it a knock. “Come in,” Telesti’s voice rang out almost instantly.</p><br/><p>“Lorist opened the door and noticed that there were three tables within the relatively small room. The sand table that was originally placed in the room outside was at the far corner of the wall, with Telesti’s workdesk placed right beside it. On the workdesk was a beastskin book and some writing materials. Beside the workdesk was a square table on which several pieces of blank canvases were placed. Telesti’s Iron ranked butler and another short-haired, tanned middle-aged man were standing beside the square table.</p><br/><p>“Milord…” said Telesti and her butler in unison as they made a deep bow and greeted Lorist. The middle-aged man beside them on the other hand looked a little panicked and didn’t know what to do.</p><br/><p>“Who’s that?” asked Lorist as he looked at the middle-aged man.</p><br/><p>“Milord, he is Zanben. He was originally one of the slave laborers who I picked to become my aide after I noticed his decent drawing skills and deep understanding in construction methods. Zanben, quickly greet the lord,” explained Telesti.</p><br/><p>Zanben hurriedly paid his respects to Lorist, who waved and said, “It’s alright, you don’t have to be so courteous. I heard Old Man Balk praised you quite highly. As long as you give it your best as a loyal subject, the family will definitely reward you for your efforts.”</p><br/><p>Telesti then asked, “Milord, did you see the replica of the city and the moat outside?”</p><br/><p>Lorist nodded and said, “Miss Telesti, I was just about to discuss that matter with you. I’ve already seen the replica outside and to be honest, I’m not too happy about it. The main reason for that is because you’ve misunderstood the purpose of this place.”</p><br/><p>“But milord, you didn’t explicitly tell me what you wanted this place to serve,” she interjected.</p><br/><p>“And that is admittedly my fault. Since it’s your first time doing city planning, I didn’t tell you the aims I had for the city in detail and I don’t blame you for getting it wrong. Let’s go outside to talk more about it.”</p><br/><p>Lorist and Telesti walked outside together and he pointed to the replica and said, “Miss Telesti, look at the construction site here. This is an important opening for our dominion and it is one of the ways the people within the dominion can leave for the outside world. As long as we can take control of this place, our family will be able to control what and who goes in and out of the dominion. However, if we lose it to our enemies, we will be trapped within the Northlands for sure. Back then, Viscount Kenmays had intended for it to be a complete military installation, but that doesn’t suit my needs perfectly. What I wanted it to be was a defense citadel and also a normal city, but I didn’t expect you to decorate the residential and trade sectors so much to the point that it basically seems like a recreational park now. While its beauty is definitely undeniable, it doesn’t do anything for the defense of the place at all, leaving our only line of defense to be the two walls. The moment an enemy captures either wall, the whole city will effectively have been occupied.”</p><br/><p>Telesti breathed a sigh and said resignedly, “Alright, milord. Tell me how you want the castle and city to be constructed. It is fortunate that it is currently still at the planning stage, so it wouldn’t be too late to change it now.”</p><br/><p>Lorist then overhauled the whole layout of replicas on top of the table. “The core of this valley city will be a castle, which will serve as the final line of defense for the city. The location of construction will still remain unchanged at the mountain side, but it definitely has to be able to hold its ground against all invaders. As for how it will achieve that, I will leave it to you, and you can even beautify it how you want as long as it doesn’t compromise its defensive capabilities. In front of the castle will be the main plaza and two walls will stretch out from the left and right of the castle that will connect with the walls at the two ends of the valley. That way, should either of the walls at the valley’s openings fall, we only have to lower the portcullis of the walls from the castle within the valley to cut off the enemy’s route and entrap them, giving the defense force of this area ample time to resist and even retaliate.</p><br/><p>“On either side of the castle, there should be some storehouses for supplies and weapons. There should also be some stables outside of the castle walls. And in the middle of the walls here will be the main route to pass to the other side of the city where two thirds of that spot will be used as the trade and residential sectors, the specifics of where to allocate will be left to you. I have no further specific requests, aside from by the time of completion of this valley city, it should be able to house up to 15000 people. Oh, you should also pay some attention to how you organize the underground waterways. That should be all.”</p><br/><p>Telesti’s old butler has been noting down all the specifics the whole time and handed the document to his mistress. After taking a brief look, Telesti put her signature on the document after making sure it was as Lorist had instructed and gave it to Zanben as she said, “Zanben, let’s change the design according to the lord’s requests.”</p><br/><p>“Understood,” Zanben said respectfully.</p><br/><p>Little Vinny on the other hand was tearing up upon seeing her precious little replica city messed and moved around by Lorist to the point that it was already unrecognizable. She said in a crying voice, “Mistress, the lord is a mean person! He messed up all the models there…”</p><br/><p>Lorist said, “I’m sorry, Vinny. I wasn’t paying much attention…”</p><br/><p>Telesti rubbed Vinny’s tears off with her napkin and said, “It’s okay, we can always make a new, more beautiful one. And milord, didn’t you say you had something else you wanted to tell me about?”</p><br/><p>Lorist brought Telesti back into the room she was in before.</p><br/><p>“It’s like this…” Lorist started explaining his intention to lure the forces of the Kenmayses into the construction site and try to force them to surrender and hoped that Telesti would cooperate with him on that by changing the schedule for the construction.</p><br/><p>“Sigh, milord, you know I hate to dabble in matters of killing and whatnot. You men are all about wars and battles. Why can’t you just sit still quietly and focus on the construction of the castle first?” said Telesti as she sighed loudly.</p><br/><p>Lorist shrugged and said, “I don’t really have a choice. If I don’t exterminate this escort of theirs, the Kenmays Family would definitely find out that we have already occupied their construction site and will instantly send more of their forces to take it back. And given that the first defensive walls haven’t completely been constructed yet, it will be extremely difficult for us to hold our ground and we will definitely incur huge losses. Whereas if we manage to exterminate them, we will be able to keep news about this place being occupied from them a little longer. By the time they find out, we will have already completed construction on the walls and will have a much easier time defending ourselves from their soldiers.”</p><br/><p>“Alright, milord. I will do as you wish and amend the schedule,” said Telesti.</p><br/><p>“There’s also another matter that needs your attention. I have a supervisor from our family, Hansk, who is well-versed with inventory and supply management and he will be helping you with this construction project. I will ask him to report to you later,” Lorist said.</p><br/><p>Telesti nodded and suddenly seemed like she has remembered something. “Milord, what will you name this castle when it is completed?”</p><br/><p>Lorist gave it some thought and said, ‘Let’s call it Firmrock Castle. I hope it will be as stable and firm as a rock and will not shake no matter what is thrown at it.”</p><br/><p>Telesti suddenly seemed rather unhappy and pouted.</p><br/><p>Lorist was stunned at the sudden change in her expression, but he understood why almost immediately. He smiled as he said, “Miss Telesti, I see what you are getting at. I’m really sorry, but as this will be a really important base for the family, its naming will also be a really serious matter. If you are willing to take charge of the construction of the castle, I will allow you to name the valley city after your family name, Nico City, or even Telesti City if you prefer, what do you think about that? If you have anything else in mind, i will even leave the naming of the city to your complete discretion. Is that okay with you?”</p><br/><p>……</p><br/>\n</div>"}