{"title": "Chapter 100 Barbarians, Gold Mine and Plotting", "id": 100, "volume": 1, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-100-barbarians-gold-mine-and-plotting", "volume_title": "Volume 1", "body": "<h1>Chapter 100 Barbarians, Gold Mine and Plotting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Barbarians, Gold Mine and Plotting</p><br/><p>“Barbarians!” screamed some at the front of the convoy. The convoy instantly broke into a huge chaotic mess…</p><br/><p>“Shadekampf, help restore order to the convoy. There’s nothing to fear about 50 or so barbarian riders. Guard squad, march forward on my lead!” roared Lorist.</p><br/><p>Just when the 120 mounted guards scattered throughout the convoy gathered into a line formation near Lorist, a chestnut brown horse rode out from the group towards the barbarian riders with its rider holding a great green longbow. When he was around 150 meters from the barbarians. the thunderous sound of the bowstring rang out repeatedly…</p><br/><p>One barbarian rider after another was struck down by the emerald-colored arrow-bolts. After both parties traveled for another 30 meters towards each other, more than 20 barbarians had fallen from their mounts…</p><br/><p>The remaining 30 or so barbarian riders stopped their mounts in terror. All of a sudden, another savage cry sounded from far away, causing the riders to turn back and retreat…</p><br/><p>Josk breathed in a huge gulp of air while lightly shaking his hand which was slightly numb from all that firing before he once again lifted his longbow and circulated his Battle Force. But this time, he didn’t shoot rapidly and instead relaxedly shot at the 3 barbarian riders who were at the back of their retreating group, swiftly ending their lives. Seeing the rest of the barbarians escape into the trees, he kept his longbow and stopped his assault.</p><br/><p>However, one of the riders turned around and started cursing and gesturing. Even though Josk didn’t hear that barbarian from far away, he figured that the savage was probably saying something derogatory to him and shot out another arrow in rage.</p><br/><p>That barbarian immediately tried to evade the incoming projectile and successfully did so, with Josk’s arrow taking the barbarian’s feather-decorated helmet off and pinning it onto a tree not far away. The tree shook so hard from the force of that arrow that it actually snapped into half and gradually fell towards the ground.</p><br/><p>After seeing Josk’s arrow snap a huge tree’s trunk, the barbarian who had managed to evade certain death looked up and locks of long golden hair could be seen falling over that person’s shoulder now that the helmet was absent. It appeared that the barbarian rider was a woman. Even though that female barbarian rider had escaped with her life, she fainted from sheer terror of almost losing her life and laid unconscious below the shade of the tree. However, a few other barbarians helped to carry her to safety and led her mount deeper into the forest.</p><br/><p>The slowly falling tree eventually crashed onto the ground, causing a cloud of dust to obscure the area from sight. When the dust settled, there was no longer any trace of the barbarians at the edge of the forest.</p><br/><p>Apart from the 20 or so barbarian corpses and their riderless mounts, the scene from before seemed to have been nothing but a dream.</p><br/><p>Josk turned his horse and returned to the convoy, only to be received by a sudden loud cheer, “Divine marksman! Divine marksman!”</p><br/><p>Lorist went up to Josk to receive him. He patted his shoulder and said, “You did great!”</p><br/><p>Then he raised Josk’s right hand and cheered towards the convoy, “Josk! Josk!…”</p><br/><p>The people of the convoy responded with great fervor. “Josk! Josk! Divine Marksman Josk!……”</p><br/><p>Josk rubbed his nose and said embarrassedly. “Milord, this is a little too much…”</p><br/><p>Lorist said, “Joe, you deserve it.”</p><br/><p>……</p><br/><p>Due to encountering the patrolling barbarian cavalrymen, Lorist decided to not rest at the lake up ahead and continue their travels just in case the escaped barbarians called for more reinforcements.</p><br/><p>Shadekampf brought a few guard squad soldiers to rally up the dead barbarians’ mounts and loot their corpses. Lorist on the other hand called Supervisors Hansk and Kedan over and asked them whether barbarians were commonly sighted in that area.</p><br/><p>Hansk shook his head and said, “Milord, I’ve never heard of any barbarian sightings here and there is no such instance stated in the family records either. Commonly speaking, barbarians are usually seen around the Magical Dragon Mountains. This place is quite far from there and is actually closer to the Black Forests and the Desolate Hills and the family troops have never noticed the presence of barbarians here for the past 100 years even though not many from the family ventured much to this area. I believe it must’ve been a rare coincidence for us to have encountered those barbarian cavalrymen.”</p><br/><p>After cleaning up the battlefield, Shadekampf let the guard squad members continue collecting the mounts and rode over to where Lorist was.</p><br/><p>“Milord, take a look at this,” said Shadekampf as he handed over a small leather pouch.</p><br/><p>After opening it, Lorist reached his hand inside and took out a handful of golden dust.</p><br/><p>“Gold dust!” cried out Supervisors Kedan and Hansk.</p><br/><p>“Milord, the barbarians that were killed by Sir Josk mostly had a pouch on them that was filled with gold dust like this, I even noticed this on one of them,” said Shadekampf as he took out yet another piece of gold that was about the size of a thumb.</p><br/><p>“A gold nugget!” exclaimed Lorist as his eyes brightened.</p><br/><p>“Milord, I suspect that there are some gold deposits around the forest or the hills which is also the reason for the presence of the barbarians. I suggest we send some people here to conduct a survey of the land. If we really do discover a gold mine, then the family will definitely not lack any funds to develop the dominion in the future,” said Supervisor Kedan passionately.</p><br/><p>Lorist took the gold nugget from Shadekampf, weighed it in his hand, before he gave it a closer look. He then looked towards the mountains in the distance and then to the forests where the rest of the barbarians had escaped to and shook his head. “At this point, we still don’t have enough military prowess nor manpower to start developing this area. Even if there is a gold mine, there is no guarantee that we will be able to sustain the mining operations and may even cause the family to be entangled with the barbarians because of this. There is a possibility that the price we pay for the gold mine will far exceed what we actually get from it, so let’s put that idea to rest for now. It’s not like that mine will one day leave the place anyway, so it won’t hurt to wait for a while until the northbound convoy arrives. By then, we should have more than enough manpower and resources to do so.”</p><br/><p>……</p><br/><p>Lorist’s convoy only managed to reach the construction site at around 10 in the night. Having been given an early notification, Telesti had already instructed the laborers to set up a camp and also prepared some food to receive the people who had traveled for almost a day straight.</p><br/><p>As Lorist was biting into a piece of bread, he asked Reidy, “Where’s Miss Telesti?”</p><br/><p>“Milord, she has already gone to sleep at 10 o’clock and left me in charge of the place. Do you need me to wake her up?” Reidy asked.</p><br/><p>“It’s alright, I only wanted to ask about the progress of the construction. I’ll be able to see it tomorrow anyway, so there’s no need to bother her right now. Oh, and, ask for Butler Boris to come over. I have something I want to ask him about,” Lorist said.</p><br/><p>Butler Boris was brought over to Lorist without much delay with a sour look on his face.</p><br/><p>“Huh, Butler Boris, what’s with you? You look like you’re about to cry. What’s going on?” Lorist asked curiously.</p><br/><p>The butler instantly kneeled before Lorist and said, “Milord, please save my family members. If Viscount Kenmays knows that I surrendered and started working for you, he’ll definitely prey on my family.”</p><br/><p>Shocked, Lorist said, “Please stand up, Butler Boris. Tell me where your family is and I’ll see if I can help reunite you with them.”</p><br/><p>But the butler refused to stand up and continued to kneel. “Milord, my family are all living at the Redriver Valley Bastide within the viscount’s dominion and the shipment convoy will be coming over within two days. If they notice that this place has already been occupied and send word back there, it will be the end for my family. They will definitely be punished in my stead by the viscount! Given that I’ve failed my responsibilities as the chief manager of this place, he’ll definitely release his anger onto my family regardless of whether I’m still alive! That’s just how his temperament is! I’ve already lost sleep for the past couple of days because of this… Milord, I beg you…”</p><br/><p>“Please get up first, Butler Boris. The reason I asked for you was to get some information about the incoming shipment convoy. How many carriages would they have and how powerful is their escort? I need that information in order to know if I can swallow them whole. After that, you can tell me more about the bastide so that I can see if there’s some way I can save your family,” consoled Lorist.</p><br/><p>Now that his family members’ lives were at risk, Butler Boris revealed every detail he could about the shipment convoy. According to him, the convoy that would arrive on the 10th would have around 400 carriages and based on their previous shipments, 200 of them will be carrying 3000 buckets of green vine glue with each carriage holding 15 buckets and each bucket weighing around 50 kilograms, so each carriage would weigh around 1000 kilograms including the weight of the wooden buckets. The remaining 200 carriages would mostly transport food ranging from smoked meat to alcohol and other supplies like clothes and building tools.</p><br/><p>The escort that was in charge of the shipment was the Feathersoar Mercenary Crew. They were considered to be one of the more active mercenary crews during the time of the civil war and had around 200 members in total with their insignia bearing a white goose feather. The crew leader Adams was an old Three Star Silver veteran with tens of other members of the crew being Silver ranks as well with the rest being at the Iron or Bronze rank. They had been paid quite a huge sum by the Kenmays Family to serve as their main fighting force.</p><br/><p>The Redriver Valley Bastide of the Kenmayses was approximately 1 day of travel away from the construction site at Morgan Hills and it would take around 6 to 7 hours on horseback to cover the distance. Now that the bastide had become a central supply distribution point, a huge amount of resources were stored within and was managed entirely by the head butler of the Kenmays Family, Pelador, who was aided by tens of other guards of their family.</p><br/><p>Not far away from the bastide was the immigrant town the Kenmayses had paid a huge price to recruit vagabonds to build, which had a population of around 2000 people that was defended by a garrison squad of 100 soldiers. However, if the Kenmays Family intended to send the 1000 slave laborers along with the shipment to the construction site, the garrison soldiers would join the escort as well.</p><br/><p>After Butler Boris told Lorist all that information, he was asked if there was a possibility of baiting the escort of the shipment convoy into the area of the construction site and force the mercenary crew to surrender so that the Norton Family can obtain all the resources of the shipment.</p><br/><p>The butler replied that it would definitely be difficult as Crew Leader Adams was a cunning and careful man. Given that he knew many of the mercenaries who were previously stationed at the construction site, if Adams noticed their absence when he approached, there was a huge possibility that he wouldn’t enter the site.</p><br/><p>Lorist looked at Josk who was chomping down at a bone and asked, “How about it? Are you confident with being able to trick them?”</p><br/><p>Josk placed the bone down, wiped his mouth, and said, “Milord, there’s no need to do so much plotting like that. Just give me a squad of guards and I will be able to eradicate the whole mercenary crew in an open field battle and take the whole shipment for ourselves.”</p><br/><p>Lorist laughed out loud and said, “No way, I worry that our losses would be huge if we were to engage in an open field battle. Think about it, most of the guard squad members used to be common bandits who have never received any formal military training or drills and know nothing about strategic formations other than rushing straight at the enemy like how most bandits fight. If we were up against weaklings, then there wouldn’t be a problem. But our enemy is an experienced mercenary crew which has weathered many battles, so it is almost guaranteed for the guard squad to be at a severe disadvantage given their lack of understanding of military tactics.”</p><br/><p>Ovidis, who was just sitting beside Josk, exclaimed in a dissatisfied tone. “Milord, we’re your family’s soldiers, not a band of lowly bandits.”</p><br/><p>Lorist waved towards him and said, “Come on, don’t be sour about that. I was just making an example.”</p><br/><p>Lorist continued, “If we manage to trick the Feathersoar Mercenary Crew to enter the construction site, it would be akin to us locking up a rabid dog before beating it. We could even use the ballistas on the walls to pressure them into surrendering. Doesn’t the leader of that crew recognize some of the mercenaries who have yielded to us? It wouldn’t be too hard to carry this out. Patt…”</p><br/><p>Patt stood up in response and awaited his orders.</p><br/><p>“Rush to Poplar Coast tonight itself and ask the mercenaries there if they want to make some quick money. As long as they manage to lure the Feathersoar Mercenary Crew into the construction site, each one of them will receive 10 gold Fordes. I only need twenty people, and no matter if they accept it or not, I want you to make it back here by the morning of the 9th, which is tomorrow, understood?” Lorist instructed.</p><br/><p>“Yes, milord. I will set out right away.”</p><br/><p>“Good, I’m counting on you. Please be careful on your way there.”</p><br/>\n</div>"}