{"title": "Chapter 121 Duke Loggins's Plot", "id": 121, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-121-duke-logginss-plot", "volume_title": "Volume 2", "body": "<h1>Chapter 121 Duke Loggins's Plot</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The obese Duke Loggins rammed around and busted up his study with a semblance of a savage wild boar, causing a pile of mess to gather on the ground. The only things within the study that survived were the ones that were too heavy for him to move, for instance, the furniture.</p><br/><p>\"Deploy! Deploy the Northland Army to the Norton Family dominion immediately! I want the Nortons to be vaporized and that family leader kid to beg for mercy while prostrating in front of me like an insignificant bug! After that I will hang him publicly for all the nobles in the Northlands to see the ending of someone who dares to resist me!\" roared the count with bloodshot eyes as he breathed ragged breaths.</p><br/><p>When Baron Camorra returned and reported the Norton Family's refusal to hand over the 100000 gold Fordes, the duke's anger gradually built up. Upon hearing that they do not acknowledge him as their senior noble, he became even more furious and started thrashing around, enraged. By the time Baron Camorra informed Duke Loggins about how the Norton Family leader incapacitated Knight Tabik and killed 8 of their Silver ranked knights, and even took all their money pouches and withheld their mounts, the duke completely lost it and flipped the desk he was sitting behind while muttering nonstop, \"How dare they do this... How dare a puny bug like him resist my will...\"</p><br/><p>Standing beside the entrance to the study were three people. They chose that spot because the objects flying about in the room wouldn't easily reach there and they would also get a clear look into the study, so if something were really to fly out, it wouldn't be too hard for them to dodge and not become collateral damage of the duke's fit of rage.</p><br/><p>Apart from the expressionless Baron Camorra, the other two were armored knights with huge physiques. The one with the beard was Duke Loggins's chief family knight, Wesson Chevany who also served as the chief commander of the Northland Army. The younger Gold ranked knight beside him was Hennard.</p><br/><p>Hennard looked with an expression of excitement and envy at Duke Loggins who was sitting amidst broken chairs and messed up books while breathing raggedly. He said, \"I really wish I could afford to smash a study up like that... It must feel so liberating...\"</p><br/><p>\"Stop talking crap...\" said Chevany with a humph. He turned to Baron Camorra and said, \"Milord seems to be losing his temper more easily recently... That doesn't seem to be a good sign.\"</p><br/><p>Baron Camorra replied quietly, \"It has been like that since he met with the Second Prince the last time. I heard that he had been provoked and humiliated by one of the Blademasters serving the Second Prince. Oh well, at least milord will return to normal after he lets off some steam...\"</p><br/><p>Chevany sighed and said in a self-blaming tone, \"It's all my fault for being unable to grasp the intricate insights required to break through to the Blademaster level and caused our lord to be humiliated in front of the Second Prince like that...\"</p><br/><p>\"That can't be blamed on you. You've already tried your best and did pretty well. If only the Second Prince did not have two Blademasters serving him, then he would have come groveling to our lord for help long ago...\" consoled Baron Camorra.</p><br/><p>By the time Duke Loggins raised his head, his expression had already cleared up. Looking at the mess he made, he laughed out and said in a self-ridiculing fashion, \"Gosh, it really is hard to control my anger at this age of mine. Come on, let's go to the small meeting room. Camorra, tell me the details of the happenings once again from the top and let's discuss how we should handle the Norton Family.\"</p><br/><p>Following that, with Baron Camorra's excellent memory, he described the happenings without missing a single detail to the duke down to the attitude, intonation and expression of Lorist when he spoke.</p><br/><p>\"How are Tabik's injuries?\" Duke Loggins asked.</p><br/><p>\"They shouldn't be anything serious. Mainly, his two arms which were rather severely twisted. The herbalist said that it would require around 1 year of rest for him to be able to recover,\" said Knight Chevany.</p><br/><p>\"Then, do you think that the Norton Family leader is strong? What rank is he at? How was Tabik unable to hold his ground against him?\" asked the duke.</p><br/><p>The two knights looked at each other before Chevany replied, \"Milord, after receiving a notification from the guards, I went to visit Tabik. According to him, the twerp of the Norton Family should only be at the Iron rank. That was the reason why Tabik dared to act in the first place. But what he didn't expect was that the twerp excelled in unarmed combat. Tabik said that his loss was probably due to him having underestimated the Norton Family leader and let down his guard and lost the advantage during the first exchange. When he was aware of the situation, he was no longer able to fight back and that's how he ended up so severely injured.\"</p><br/><p>\"What a load of crap... I guess Tabik still isn't that honest of a chap yet. How is it possible for an Iron rank to injure him so badly? If he lost, he should just admit it and not come out with so many excuses...\" Duke Loggins said as he knocked onto the tea table with his fist angrily.</p><br/><p>\"No, milord. That is indeed within the realm of possibility. The ancient legends from the Magical Civilization spoke of a profession called the combat monk. They were devout believers of the gods and also cultivated amazing fighting skills that could even take down dragons. However, they eventually died out during the war between the magi and the gods. Hundreds of years ago, some combat monk techniques were also excavated from some ruins and they were all cherished by the shrines like precious treasures. In present day, some of the shrines have practitioners who train in the revamped techniques of the combat monks from the days of old which also frequently allowed them to defeat opponents of a higher rank. I suspect that the Norton Family twerp had managed to get his hands on one such technique that specializes in unarmed combat. If that were really the case, then it isn't weird for Tabik to have lost at all,\" explained Knight Chevany.</p><br/><p>\"However, please be assured, milord. Even though techniques like these are extremely effective in one-on-one battles, in a battlefield scenario, the Norton kid will never be able to defeat a fully-armored Tabik charging at him from his mount,\" added Hennard.</p><br/><p>\"I see. Then I suppose this will serve as a good lesson for Tabik. I've heard that he's been getting more and more out of control lately. Hopefully this will change how he behaves in the future so that he doesn't get on the bad side of others and cause all sorts of unnecessary trouble,\" said the duke as he breathed out loudly twice from his nose.</p><br/><p>\"Chevany, can you defeat the Norton Family's forces if I let you command a regiment of troops?\" the duke asked.</p><br/><p>Chevany shook his head and said, \"It won't be possible, milord. I've already checked the map and according to Sir Camorra, the Norton Family has built a new castle at the Morgan Hills. The fortifications at the castle according to Sir Camorra seems to indicate that a 2000-strong regiment wouldn't be enough to occupy it.\"</p><br/><p>Baron Camorra took out a beastskin map from the pouch beside him and said, \"Milord, please take a look over here. The route at Morgan Hills is the only one that leads into the Norton Family dominion. On my way back, I've came to a conclusion that the reason the Norton Family was daring enough to go against milord was because they believed that if they can defend the castle at Morgan Hills, even the Northland Army wouldn't be able to force their way into the dominion. I also have a few other drawings depicting the fortifications of the main defensive wall of the castle which Sir Chevany has also seen. He thinks that we can only conquer it if we continuously exhaust our soldiers in successive waves of attacks. However, the casualties will no doubt be huge and is estimated to be around 6000 people.\"</p><br/><p>Duke Loggins looked at the map passed over by the baron carefully and could not help but admit that the terrain was severely disadvantageous to them in that it was easy to defend but extremely hard to attack. Just as Chevany had mentioned, a 2000-strong regiment was definitely not enough to conquer the castle.</p><br/><p>\"Then do we have no choice but to let the Norton Family off scot-free?\" Duke Loggins was severely bothered by that notion. The fact that the Norton Family had managed to resist the duke's will was a bad example for the rest of the nobles in the Northlands and it would definitely affect his control and influence over the area negatively. He had to make the Nortons pay and use them as a warning for the other nobles who were unsatisfied with his rule so that they would not even think of rebelling.</p><br/><p>\"Milord, there is actually another route that leads to the internal part of the Norton Family dominion which will enable us to circumvent the pass at Morgan Hills,\" said Baron Camorra.</p><br/><p>\"Oh? Then where is that route you mentioned?\" asked the baron as he looked intently on the map but failing to see anything of note. He thought that the Norton Family dominion was truly placed at a strategic location. The Blackmud Marsh at the north of the dominion sealed it off from any attempt at entry from there. At the dominion's west was the Bladedge Mountains and the open seas, at its south was the Morgan Hills and the Black Forests and to its east was the Magical Dragon Mountains. Apart from the pass at Morgan Hills which the Norton Family had constructed their castle to seal off, the duke couldn't find any other place where he could allow his soldiers to enter the Norton dominion.</p><br/><p>\"To be honest, I don't know where it is myself,\" said the baron. \"However, the night I left the Norton Family's headquarters, I met with some visitors. They were the elders and the squad leader of the garrison of Wildnorth Town, the only town within the Norton Family dominion. The reason they came to me was that they wanted to complain about how the Norton Family leader changed the governing policy his ancestor first instilled to cause unfair treatment to the people of Wildnorth Town. That was why they came to me to offer help and said that they would stand at our side to aid in the defeat of the Norton Family when milord's forces come to punish them.</p><br/><p>\"According to them, the new Norton Family leader has always been a cruel person even from the days of his childhood. In one instance, he even pushed his 7-year-old younger brother into a well and almost killed him. In the end, someone from the family could no longer stand it and exiled him for ten years and he had only returned a few months ago to succeed as the dominion lord. After becoming the family leader, his behavior worsened and he went all over the place to instill conflict and tortured the poor citizens of Wildnorth Town. As a result, the citizens of the town who have had enough of the harsh treatment started planning to rebel in secret. They said that if the Lord Duke is willing to punish the Norton Family to right the wrongs they have done towards the citizens of the town,they will definitely be more than happy to help guide our forces into the Norton Family dominion through that secret route to catch them off guard...\"</p><br/><p>\"Oh. I see...\" said the duke as he breathed a long sigh. \"Then did he say how the Norton Family kid changed the policies of his ancestor to oppress the people of the town?\"</p><br/><p>Duke Loggins had always been rather interested with how other nobles reaped benefits at the expense of their own subjects. He believed that learning more methods from others would enhance his own way of squeezing the last copper coin from the hands of his poor subjects.</p><br/><p>Baron Camorra's face contorted in response to the weird situation. \"It's like this...\"</p><br/><p>Baron Camorra was an intelligent individual and he had seen all too often how the nobles outsmarted each other for the slightest additional gain. The methods he learned was also put to good use by him. That night when he received the visitors from Wildnorth Town, he put on a friendly smile and personally served his guests to ease them up. Coupled with his expertly subtle questioning, it didn't take long for him to make the visitors reveal the truth completely and unknowingly.</p><br/><p>By the time Baron Camorra finished describing the relationship between Wildnorth Town and the Norton Family, he was faced with three men who looked at him with expressions of bewilderment.</p><br/><p>\"That kind of situation actually happened? So there are nobles who are like that as well...\" mused Knight Hennard.</p><br/><p>Knight Chevany thumped on the table and said, \"Ridiculous! Those heartless ingrates deserve death! Were the ancestors of the Norton Family idiots? They should've slaughtered people like that long ago! Why have they let them propagate until now?\"</p><br/><p>\"Oh, so the taxes the Nortons paid to us actually came right out of their own pockets instead of their subjects... It seems that the Nortons are rather wealthy. After all, they have near 300 years of history and their foundation should be rather steep...\" The duke was instead focused on the financial aspect the situation that was just revealed. To him, morals and righteousness were merely secondary to monetary profits.</p><br/><p>\"Did the people from the town request anything in exchange for their guidance?\" asked the duke calmly.</p><br/><p>\"This.... Um...\" Baron Camorra started to hesitate.</p><br/><p>\"Tell me. I want to hear what kind of ridiculous request they made,\" prompted the duke.</p><br/><p>\"They... They said that since the Norton Family dominion was rather large and they weren't that greedy, they hope that after you exterminate the Norton Family, you will assign four baronies to them from a small part of the Norton Family's territory...\" Baron Camorra was embarrassed to even recite the request of the four great families of Wildnorth Town. They were thinking too far ahead of themselves.</p><br/><p>\"They dare to request that in exchange of merely being a guide?\" said Knight Hennard in with his jaw agape after hearing that.</p><br/><p>\"They said that the four great families combined have more than 600 Battle Force-awakened people and up to 10 of them are Silver ranked. Other than that, they also have more than 2000 youths. According to them, if they side with the Norton Family, milord will never even stand a chance. Other than that, the secret route leading into the Norton Family dominion is also a something that was kept untold for hundreds of years among the leaders of the great families which they also use to smuggle their goods. They said that if they reveal it to milord, it will be exposed and they desire compensation for that...\" explained Baron Camorra.</p><br/><p>\"Hehe, a smuggling operation that has been going on for hundreds of years... And they only had to pay the Nortons 10% of their harvest. It seems that the town is pretty wealthy after all. Promise them that after we enter the Norton Family dominion, we will agree to their conditions if they can conquer the castle of the Nortons. Let them be at the frontlines so that they will decrease the casualties of the Northland Army,\" decided the duke.</p><br/><p>\"But milord, are you really going to make them barons after they manage to take over the main castle of the Norton Family?\" asked Knight Hennard with displeasure in his voice.</p><br/><p>\"Do you really think that a noble title is that easy to obtain? We are not as... kind... as the Norton Family. By the time the Wildnorth Town troops successfully conquer the Norton Family's castle, that is when we will strike...\" said Duke Loggins as he let out a sly smile.</p><br/><p>\"What if they refuse to attack the Nortons?\" asked Knight Chevany.</p><br/><p>\"Refuse? Hehe, then invite them to our main army camp and tell them that we are going to carry out the entitlement ceremony to grant them their baronies. That is when we will strike and grab all the wealth of Wildnorth Town for ourselves. As for the citizens... Kill all the elderly, the youths and the children. Leaving them alive will only spawn trouble in the future. Spare the young women and don't lay a hand on the virgins. I've heard that prices for female slaves have risen recently, just in time for us to make a killing,\" said the duke.</p><br/><p>\"Then how many troops are we going to mobilize? And, do we have to lockdown the pass at Morgan Hills where the other castle is located so that nobody gets out?\" Knight Chevany asked.</p><br/><p>Duke Loggins gave some thought before he said, \"We'll send out two regiments of 4000 troops. That should be enough. The regiments will be led by Hennard and you. Don't forget to pay attention to that Gold ranked Divine Marksman. If he's willing to defect to our side, bring him back here. As for the castle at Morgan Hills, there's no need to pay attention to that. Viscount Kenmays has just departed with his 2000-strong force yesterday to take back the gold that was stolen from them. Hehe, let's just sit here and wait for them to wear their own numbers down by attacking the castle at Morgan Hills.\"</p><br/><p>\"Oh, before I forget, Camorra, contact the representatives of Wildnorth Town and tell them to supply us with the necessary provisions and food for the expedition. After all, they won't believe that we've accepted their proposal that easily if we don't even attempt to negotiate the conditions in our favor a little.\"</p><br/><p>\"Yes, milord,\" said Baron Camorra as he bowed deeply.</p><br/>\n</div>"}