{"title": "Chapter 133 Rolling Boulders", "id": 133, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-133-rolling-boulders", "volume_title": "Volume 2", "body": "<h1>Chapter 133 Rolling Boulders</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Knight Chevany was feeling incredibly frustrated as he thought, how infuriating! How could he be like that? As a knight, especially a Gold ranked one, how can he stop doing something halfway without finishing it? He's been shooting ten arrows every time during the past few nights. He should've shot ten yesterday as well! Why did he stop at seven? That even caused the men in the camp to stupidly wait for two whole hours before I had to order them to get some sleep... and even then, they were worried that the shots would continue on later...</p><br/><p>Had it not been for his position of authority as the commander of the army, Knight Chevany would have went to the bastide walls and challenged the Gold ranked marksman to a one-on-one death battle. Even though he had participated in many battles before, he had never once encountered something so extraordinary like three unshot arrows causing a whole army to lose sleep for the night. It truly was exceedingly humiliating for him. What can I do now... thought the knight as he looked at the tired soldiers and felt that they weren't in good shape to attack the bastide that day either.</p><br/><p>After giving it some thought, Knight Chevany finally made up his mind to move the camp 200 meters away where the marksman of the Norton Family would not be able to fire his arrows. It was also better that way as it would allow the soldiers to rest unworried. They might as well do some work to move the camp away since they were not attacking and make the Nortons pay after they were properly rested up.</p><br/><p>Josk, Belnick and Pajik were currently standing atop the castle walls and looking towards the camp of the duke's army. They expected a bloody battle to commence on that day given that the enemy had finished constructing their siege engines and already had a whole day of rest.</p><br/><p>It could be said that the Maplewoods Bastide was situated at a rather advantageous location. The whole bastide was built upon a hard rock mound and the area surrounding it was mostly flat and level. Aside from using a 200 or so meter long slope which was only tens of meters wide, there was no other way the enemy could attack the bastide because the cliffs of the mound was easily near 20 meters in height which couldn't be reached even with the aid of siege ladders.</p><br/><p>Apart from the main drawbridge, the walls of the castle do not have any large openings or windows. However, they were laden with firing holes which could be used by defenders to shoot at enemies from the safety within. The first assault of the duke's army failed because of that: the jars of oil that caused the siege engines to burn them were also thrown from the firing holes.</p><br/><p>\"That's weird, it's already ten but they aren't making any indication to attack... They really like the dawdle, don't they?\" Pajik said.</p><br/><p>\"That's right. Are they planning to come in the afternoon?\" Josk also felt that something was off. Even though they have finished making their defense preparations, the enemy was still lumbering about slowly without a hint of urgency.</p><br/><p>Belnick looked at the enemy camp and said, \"Don't tell me they're doing this on purpose? Are they planning to make us let our guard down before they attack us? That shouldn't be the case though, pushing the tall siege towers should take quite some time and we would've finished our preparations by then.\"</p><br/><p>\"Who cares? No matter how many comes, we'll just kill them all. We only have to focus on the four siege towers. Also, those towers would block the line of sight of their bowmen, so that would work to our advantage as well,\" Josk said. As a person who specialized in longbows and archery, he knew the extent of the capabilities of the longbowmen unit of the duke. Even though he managed to kill 50 or so of the longbowmen during the last skirmish, he was left completely tired out by the end of it.</p><br/><p>\"The enemy commander really has a good eye: he managed to discover the weakness of our defenses after just one attack. The top of the castle is indeed our weak point. That's where they plan to aim using their four siege towers that would allow them to evade any damage from the firing holes that are only at the lower section of our walls; firing arrows at their towers are pointless with the huge wooden boards they have in place. We won't be able to toss our oil jars over the moat either as the tower wouldn't need to approach the walls that much to lower their bridges for their soldiers to cross. Currently, they have around 3000 men which is five to six times that of ours. Even if we manage to kill three for every one we lose, we still won't be their match. I only hope that the morale of their soldiers right now is not high so that they don't try so hard during the actual attack. Otherwise, we might find it exceedingly hard to overcome this obstacle today,\" Belnick said.</p><br/><p>\"The only opportunity we have to retaliate is the moment the siege towers lower their gangplanks. If we manage to toss one of our oil jars into the opening and have Sir Josk shoot a flaming arrow into it, then the whole siege tower would be rendered useless. If we manage to do that to two towers, we will be able to severely lessen the burden on our men as well. With that, 400 or so family soldiers might be enough for us to defend the top part of the castle,\" said Pajik as he looked at the bundle of oil jars beside him.</p><br/><p>Supervisor Spiel and Pesha got out of the stairwell while breathing raggedly at that moment.</p><br/><p>Pesha asked, \"The enemy still hasn't attacked?\"</p><br/><p>\"That is the case, mistress,\" said Pajik as he saluted Pesha. He had no choice but to do so as his wife who had birthed him a son had been 'given' to him by Pesha.</p><br/><p>Belnick merely nodded to Pesha as he was only acquaintances with her. On one hand, he knew that Pesha was the fiancee of the late First Young Master. On the other, he understood that Lorist didn't like her that much.</p><br/><p>Josk, however, didn't pay her any heed and pretended he didn't notice her arrival at all. After hearing about how Pesha had taken Lorist's weapons without his permission to melt them down to fashion a weapon for herself from Reidy, he grew to have a really bad impression of her.</p><br/><p>\"Mistress, why have you come here?\" Pajik asked.</p><br/><p>\"Is there anything wrong with me being here? I'm a knight of the Norton Family as well. It's all Little Locke's fault for angering the Duke of the Northlands. Just look at this, the duke can easily send thousands of people over here without breaking a sweat. Is that a foe that our family can afford to anger? They even managed to kill off the people of WIldnorth Town. I was right all along when I told Grandpa Gleis that he shouldn't have let Little Locke return here. He's not fit at all to become a dominion lord,\" said Pesha as she started complaining about Lorist in front of everyone present.</p><br/><p>\"What did you say?!\" roared Josk as he turned around to glare at Pesha with a furious expression.</p><br/><p>\"Did I say anything wrong?! Didn't all this start to happen after he returned to the dominion? If he didn't go and rob the Kenmays Family of their gold, would the duke have come to our doorstep? Had he not changed the regulations to anger the people of Wildnorth Town, would they have bothered to guide the men of the duke into the dominion? If Little Locke didn't become the dominion lord, then we wouldn't have to dip our hands in conflict either and the folk of WIldnorth Town will be respectful to us as always like the old times... And they wouldn't have been massacred either...\" argued Pesha, obviously satisfied with her own reasoning.</p><br/><p>Caught off-guard by the inane statements Pesha had just uttered, Josk was so angered that he was left completely speechless.</p><br/><p>Belnick shook his head and thought, I've heard that the mistress was a stubborn person, but I didn't know that she would actually say something that ridiculous. Then again, she's been spoiled by the old butler ever since her childhood, so I think we know who to thank for her haughty behavior... Belnick didn't feel like debating her either as he believed that Lorist's eventual victory would make it even harder for the mistress to retract the statements she just made.</p><br/><p>\"Don't bother with her. She's just letting her mouth run even though she knows little about the whole situation. I'm sure that milord will teach her a lesson when he gets back,\" advised Belnick as he held onto Josk's arm to stop him.</p><br/><p>\"She really doesn't know what's good for her... I don't understand why milord didn't punish her for her transgressions back then. She should've lost her status as a family knight from that so that she wouldn't cause trouble for anyone else in the future... I really wanted to beat her up for talking bad of milord behind his back...\" said Josk angrily.</p><br/><p>Pajik on the other hand was put into an awkward position. He didn't expect that Pesha would actually dare to say something like that. Beside them, Supervisor Spiel made a bitter smile and said, \"Mistress, how can you say things like that when our enemy is just about to attack? Milord will definitely not be happy to hear about it when he gets back...\"</p><br/><p>Upon the mention of Lorist, Pesha humphed with dissatisfaction before she quieted down and headed for another spot on the walls to continue to look towards the enemy camp.</p><br/><p>\"Supervisor Spiel, why have you come here?\" Belnick asked.</p><br/><p>\"Oh, it's about this... Old Butler Gleis heard that the enemy had built four bridged siege towers and wanted me to remind the three of you that you can use the rolling boulder tactic as a countermeasure for that,\" Spiel replied.</p><br/><p>\"Rolling boulders? Are you talking about the 8 huge spherical boulders that are placed within the garden of the bastide?\" Belnick asked. Right after, he jumped with realization and continued, \"Darn, why did I forget about this...\"</p><br/><p>\"Rolling boulder tactic? What is it?\" asked Josk and Pajik curiously in unison.</p><br/><p>\"Haha, Brother Joe, Pajik, come over here and take a look. It's those 8 boulder balls that are placed over there,\" said Belnick with a smile after he headed to the other side of the castle walls and pointed downwards.</p><br/><p>Beyond the main gates of the castle were a few flower beds where 8 huge boulders could be seen.</p><br/><p>The moment he laid his sight on them, Josk understood and said, \"So those 8 boulders can be used like that as well... I thought that they were just decorations at first. I even wondered once why they weren't sculpted into some other shape and believed that you guys were simply unable to find a good sculptor within the dominion.\"</p><br/><p>Still confused, Pajik asked, \"What would we do with those boulders?\"</p><br/><p>Belnick smiled and said, \"Those 8 boulders each weigh over thousands of kilograms and they have all been carved to be able to fit through the castle gates so that they can roll straight down the drawbridge. Think about how the spectacle would look like the moment we push the boulders down after the enemy has pushed the siege towers halfway up the slope!\"</p><br/><p>Pajik stood there stunned the moment he heard it, but he recovered rather quickly and said, \"Haha! To think that the family would still have this up their sleeves! I can't wait to see how the siege towers will fall... With this, we will be able to teach the duke an unforgettable lesson! We are definitely going to win the battle...\"</p><br/><p>\"You may not know it, but the boulders have been there for at least two to three hundred years...\" Belnick told Josk. \"After the first ancestor of the Norton Family built the family bastide, it was frequently attacked by the mountain barbarians. The longest siege even lasted for half a year, but the barbarians incurred quite huge casualties themselves. That was when the rolling boulder tactic was thought up and one huge boulder was carved into a spherical shape. During the last siege the barbarians laid on the bastide, the result of the tactic was absolutely devastating. According to the family records, the slope outside the main gates was full of flattened corpses. There was so many that one would bloody one's whole leg the moment one stepped onto it.</p><br/><p>\"After that, the family spent tens of years to carve up the rest of the boulders in case we would need them once more. It would be the second time we use it since almost 300 years ago. We can finally behold the might of this tactic with our own eyes.\"</p><br/><p>Josk thought for a bit before he said, \"I hope that these rolling boulders don't frighten the enemy all the way back to Wildnorth Town. That way, milord's plan might have to be changed entirely again.\"</p><br/><p>\"The enemy has started to move...\" said Supervisor Spiel from not too far away. The three knights ran over there immediately only to be flabbergasted by what they saw.</p><br/><p>\"What's going on? The enemy looks like they're moving their camp further away. What happened?\"</p><br/><p>The three knights looked at each other but they couldn't figure out the reason for the sudden move of the duke's army.</p><br/><p>......</p><br/><p>Knight Chevany's eyes were completely bloodshot as he stared at Maplewoods Bastide. If stares could set things on fire, then the bastide would be completely consumed by raging flames of hatred by now...</p><br/><p>On the slope leading to the main entrance of the bastide were countless flattened bodies of the duke's soldiers who had toiled incredibly hard to push the siege towers halfway above the slope only to have two of them knocked off the slope with the other two lying flat on the slope itself. Between the two toppled towers was where the bloody spherical boulder lay.</p><br/><p>It was the 10th day of the expedition led by Knight Chevany to conquer Maplewoods Bastide. After getting a good rest the day before, the soldiers were all energized and ready to attack to take over the bastide in one fell swoop. Chevany had also resolved that he would continue the assault and force the Nortons to submit no matter the casualties as long as the siege towers manage to reach the walls of the bastide.</p><br/><p>After finishing breakfast, the soldiers got into their lines orderly behind the four siege towers and were led into battle by Knight Chevany. By the time the siege towers were pushed halfway up the slope, one hour and a half had already passed and it seemed that the attack would not truly begin until late in the afternoon. However, the knight thought that he would continue the assault throughout the night if it was necessary.</p><br/><p>Having rested for half an hour, the soldiers began pushing the siege towers up again. However, after only advancing tens of meters, a few loud cries could be heard. \"Milord, the city gates are open! The drawbridge is being lowered!\"</p><br/><p>That was something that Chevany had predicted all along. He thought that the Nortons would have no choice but to send their men on a suicide mission to stop the siege towers. He was confident that the Norton Family's soldiers understood that all would be lost if they allowed the siege towers to reach the walls.</p><br/><p>Knight Chevany raised his hand calmly and said, \"Have the longbowmen aim forward. Sword and shield infantry, enter a defensive formation. Pike infantry, be ready to receive the assault.\"</p><br/><p>The well-trained soldiers of the duke's army entered their stations orderly. The moment the soldiers rushed out of the gates, they would definitely be in for a harsh treat.</p><br/><p>However, not a single one of their enemy emerged from the castle gates. Instead, Chevany and the surviving soldiers were presented with a scene that they would never forget for the rest of their lives: a huge boulder rolled out from the castle gates down through the drawbridge and headed for the slope as it accelerated more and more...</p><br/><p>Everyone there were completely terrified and stood there motionless as the boulders rolled closer and closer in their direction...</p><br/><p>Finally, someone shouted, \"Run!\"</p><br/><p>The formation instantly crumbled into smithereens with soldiers running all over the place into and over each other, especially with the four siege towers blocking their way. Some more clear-headed soldiers no longer gave a damn and jumped straight off the slope despite the risk of falling and injuring themselves while the rest could do nothing but scream as they stared at the giant boulder that encroached them by the moment...</p><br/><p>Boom! The rolling boulder rammed straight into the two siege towers at the front, causing wooden splinters and body parts to fly everywhere while the bloodied boulder continued to push the siege towers down the slope.</p><br/><p>Before Knight Chevany regained his composure, he heard another soldier cry out, \"There's one more...\"</p><br/><p>Raising his head, the knight saw another boulder rolling down in his way...</p><br/><p>With his quick wit, Knight Chevany ordered, \"Topple the siege towers to block the boulder!\"</p><br/><p>Miraculously, the siege towers managed to be pushed down before the boulder reached them. While it smashed its way through the first toppled tower, the boulder stopped when it reached the second tower as it had lost all its momentum.</p><br/><p>As the soldiers that narrowly escaped death let out a cheer of relief, Knight Chevany was dripping cold sweat atop his mount. He could only stare at the bastide atop the slope as he thought, as long as they have more of those boulders, I will never be able to attack them from the front...</p><br/>\n</div>"}