{"title": "Chapter 136 Out of Options", "id": 136, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-136-out-of-options", "volume_title": "Volume 2", "body": "<h1>Chapter 136 Out of Options</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Lorist pushed open the door to the room lightly and saw a bunch of huge wooden chests put together neatly with each of them having labels that denoted the type and quantity of coins contained within. After a rough count, he found that there were around 16 of those huge boxes within the room.</p><br/><p>Leaving the room and closing the door, Lorist thought to himself, the citizens of Wildnorth Town were actually saving up their wealth for the past 200 or so years within these four rooms... The hearts of people are truly difficult to fathom. To protect their hard-earned wealth, they were actually willing to conspire with the Duke of the Northlands to rebel against us, their own rulers, only to be sent to their deaths as a result of their own actions...</p><br/><p>\"Seal these rooms. Make sure to assign some guards to overlook this place,\" Lorist told Reidy.</p><br/><p>Reidy nodded and said, \"Understood, milord.\"</p><br/><p>\"Waxima, how's it going over at your side?\" Lorist asked.</p><br/><p>Waxima replied, \"After some checking, 631 young and virgin girls had been discovered to be kept within the yard nearby. The surrendered Silver ranked knight told me that the duke had ordered for those girls to be sold to slave traders for a huge sum. Other than that, there are up to 800 young women within the army camp and they look to be in a rather bad state from the treatment they received from the enemy soldiers... I also found quite a number of women within the houses of the Silver ranked knights which they have claimed for themselves. How should we deal with this?\"</p><br/><p>Lorist patted his forehead and said, \"Bring the young women out of the camp and let them live with the girls. Given that the town is quite huge, I'm sure that many of them are relatives and it would probably be easier on them if they received consolation from each other. Give them some space to live in and supply them with food and water and let them take care of themselves. After this battle, we will bring them away. Given that there are so many youths at Firmrock Castle, it wouldn't hurt to add some women to the population there to balance things out. I hope that when these women form new families in the future, they will be able to forget about the nightmare that is Wildnorth Town and start their new lives afresh...\"</p><br/><p>\"Yes, milord. However, there were four other women within the mansion who were serving the Gold ranked knight. They're quite beautiful too, do you want...\"</p><br/><p>\"Just send them away. I have no intention of doing that. As for the loot you guys find, pass them to Reidy so that he can process them after the whole conflict ends. Also, make sure the security at the place where the women will be staying at is tight. Don't let the mercenaries do any harm to them...\" Lorist instructed.</p><br/><p>\"Yes, milord. I will pay extra attention to that,\" Waxima replied as he stood straight up.</p><br/><p>\"Milord, Jim has returned,\" reported Paulobins.</p><br/><p>Surprised, Lorist said, \"Why hasn't he entered yet? Doesn't he usually rush in without a second thought?\"</p><br/><p>Paulobins laughed before he said, \"Jim said that after learning the etiquette of knights from Waxima, he would also act like one in the future...\"</p><br/><p>Lorist joined in the laughing and said, \"Let him in. It sure is quite surprising that a guy like him would go out of his way to learn etiquette... And to think that I was planning on getting him a tutor for that after the conflict... It seems that it's no longer necessary.\"</p><br/><p>Even though he still looked a little rough around the edges, Jim's accurate standing posture that was unlike his former relaxed slump impressed Lorist greatly.</p><br/><p>\"Milord, we have made sure that the secret route taken by the duke's men is no longer usable. This is a detailed map that we have drawn according to the terrain over there,\" Jim said as he passed a beastskin map to Lorist.</p><br/><p>A few days back when they were camping within the forest, Jim complained that he was bored and had nothing to do and kept on bugging Lorist to be allowed to once again attack the enemy's main camp. Lorist then gave him a mission to investigate whether the path that Hausky had discovered is rendered completely unusable and survey the surrounding terrain in the meantime to construct a map.</p><br/><p>Jim brought a few guards with him and returned within 6 days.</p><br/><p>\"Milord, you really attacked far too soon. You didn't bother to wait for me at all. I only just discovered that we've conquered the town after seeing the family flag flying at the walls,\" Jim complained.</p><br/><p>\"Hehe, opportunities like that don't come often you know. When the time comes to attack, there can be no hesitation. Who asked you to complain about boredom a few days back when we were at the forest? Then again, your survey of the area is quite a big accomplishment as well and the next step we have to take is to deal with the soldiers that are besieging Maplewoods Bastide. I want ensure that they won't get to depart from the route they came from. While entering the dominion was easy for them, I definitely will make it as hard as possible for them to leave. Jim, go take some rest and return to Maplewoods Bastide later tonight. Tell Knight Josk and Knight Pajik to bring two squads of family soldiers to tail the enemy from a distance if they decide to move their camp. If the enemy comes back to attack Wildnorth Town, have our forces from the bastide attack their camp from behind, understood?\" Lorist asked.</p><br/><p>Jim straightened his back and said, \"Yes, milord.\"</p><br/><p>\"Paulobins, bring the surrendered Silver ranked knights over here. I have something I want to ask them,\" Lorist said.</p><br/><p>The knights were rather honest and they replied to every question that was asked of them. They even revealed the arguments between Knight Hennard and Knight Chevany without missing out on the slightest detail.</p><br/><p>\"Then again, you said that the duke ordered Hennard and Chevany to bring two regiments of soldiers here, right? Then why are there only 4000 plus men in total? What about the other two companies?\" Lorist asked.</p><br/><p>One Silver ranked knight said, \"Sir, each regiment left a company behind to watch over their main camp, so, only 4000 plus people were deployed for the expedition.\"</p><br/><p>\"I see,\" said Lorist as he nodded. \"Why were the citizens of Wildnorth Town massacred? Weren't they the ones that led you lot into the dominion in the first place?\"</p><br/><p>\"Sir, that was the Lord Duke's order,\" replied the knight. \"The duke thought that traitorous and untrustworthy people like them were better off dead. He also believed that the people of the town have been stockpiling their wealth given that they've had access to the smuggling route for up to 100 years, so, he wanted to take it all for himself. Even though Knight Hennard and Knight Chevany didn't wish to kill them that soon and planned to use them to help attack your family bastide, they were extremely uncooperative and came up with multitudes of excuses like being attacked by your forces and weren't willing to send any soldiers out. That's why Knight Chevany felt that it was better to wipe untrustworthy people like them out as soon as possible in one go by tricking all of them to gather in one place using the entitlement ceremony as an excuse.\"</p><br/><p>Oh, so the townsfolk have themselves to blame for their untimely deaths as well, Lorist thought as he sighed inwardly. \"Alright, you may go back. I will instruct the guards to treat you well.\"</p><br/><p>\"Wa-wait, sir. Can I pay a ransom to reacquire my freedom? I still have some savings left on myself and at home...\" asked the knight hurriedly.</p><br/><p>Lorist gave it some thought before he said, \"Let's talk about this after the battle. I will consider your proposition.\"</p><br/><p>\"Then... Thank you, sir...\"</p><br/><p>......</p><br/><p>Two days had already passed by the time Knight Chevany received news of Wildnorth Town's fall. Hilariously, they only found out about it because a few patrolling leather armored cavalrymen wanted to sneak off to the town to have fun with some women only to discover the Norton Family flag being flown at the walls of the town, causing them to rush back as quickly as they could to make the report.</p><br/><p>At that time, Knight Chevany was in the middle of drinking some water and when he heard of the news, he dropped his cup in stupor. Within moments, he reasoned that the true reason they didn't receive any attacks for the past two days was due to that. The mercenaries who had been attacking their troops with guerilla tactics were all gathered at Wildnorth Town.</p><br/><p>Whether Knight Hennard was okay at Wildnorth Town was none of Chevany's concern. He was instead considering whether there was a chance he could take the town back. Otherwise, the wealth gained from the massacred citizens of Wildnorth Town would never end up in the hands of the duke. While he would definitely be rebuked if he failed to punish the Norton Family, his fate might end up being worse than that if the duke found that all the riches that he could've had ended up in another party's hands. The enraged duke might even strip him of his status as a knight and exile him from the Loggins Family. To Chevany, that was a humiliation he couldn't afford to bear for the rest of his life.</p><br/><p>\"Wrap up and get ready to move. Pack up all the camping gear and be prepared to attack Wildnorth Town,\" Knight Chevany ordered.</p><br/><p>After keeping all their stuff, the whole group of soldiers headed towards the town and by the time they arrived, it was already the evening. Ignoring the cries of fatigue of his soldiers, the anxious knight commander ordered his men to fell more trees to construct siege ladders during the night so that they could besiege the town on the next morning.</p><br/><p>After having breakfast the next day, Knight Chevany rallied his men into formation and marched towards the town with 20 siege ladders. From his estimates, even if the Norton Family took over the town with the aid of mercenaries, they must have lost quite a number of their own men considering that over 700 soldiers of the Northland Army, one Gold ranked knight and a few other Silver ranked knights were stationed there. No matter whether the Nortons used a surprise attack or some other tactic to occupy the town, it was hard to imagine the few men they have left would be able to defend it effectively. That way, Chevany felt that the 2000 plus soldiers led by him would be enough to put pressure and break through the defense of the Nortons and allow him to take the town during the first wave of attacks.</p><br/><p>Lorist stood on the walls and stared coldly at the enemy that was approaching gradually from a distance. Further away near a small hill, a green smoke signal could be seen spiraling towards the sky. That was the signal they had agreed on and it signified that Josk and the others were already near the enemy camp and were ready to attack at any time.</p><br/><p>\"Hehe, they really plan to take back the town in one fell swoop? They only have a measly 2000 plus people... I really don't know where Knight Chevany got the confidence for that...\" Lorist mused before he turned back to the four mercenary leaders and said, \"Have your men come back up here. I no longer need him to stay hidden. Back when we took the town, our victory has already been set. Tell your crew members that I will reward one gold Forde for each enemy killed during the first wave of attacks.\"</p><br/><p>The four mercenary leaders were rather satisfied with that arrangement as they had earned quite a huge sum of money from working for the Norton Family this time around. Other payments aside, the loot that the mercenaries collected were enough to make them smile with joy uncontrollably. The soldiers of the duke were nothing but moving crates of money to them and each of their money pouches contained at least 4 to 5 gold Fordes. To mercenaries like them who fought with their lives on the line for a living, that was already one or two year's worth of income.</p><br/><p>Even though the riches were gained from the massacred folk of the town, according to the original agreement, the loot of dead soldiers belonged to anyone who killed them. That's why the mercenaries did not fear the superior number of enemies at all and were delighting in the thought of the extra money they could make.</p><br/><p>Upon seeing more and more troops equipped with grey leather armor appear on the walls, Knight Chevany's confidence sunk and he thought that the situation had far surpassed his expectations. Are these really the mercenaries the Norton Family hired? No way, given how desolate the dominion of the Norton Family is, how did they find so many mercenaries to employ? There's almost a thousand of them... However, if they really are the family soldiers of the Nortons, then the duke really has made a huge mistake this time and has severely underestimated their true might...</p><br/><p>\"Stop advancing!\" ordered Chevany as he raised his hand. \"Longbowmen, march forward and suppress the enemies who are defending the walls. Sword and shield infantry, ready your defenses...\"</p><br/><p>As the longbowmen shot their arrows in parabolic arcs at the walls, the guards defending it raised their shields and wooden boards. Another 100 or so soldiers on the walls counterattacked with their own longbows.</p><br/><p>While the duke's longbowmen were suppressing the soldiers on the walls, other soldiers holding long siege ladders quickly approached it. As they placed their wooden boards and used them to cross the moat, their allied longbowmen stopped firing and rushed forward along with the sword and shield infantry. The guards on the walls then shot their arrows directly downwards at the sword and shield infantry and the pikemen of the enemies.</p><br/><p>Having lost the defensive support of the sword and shield infantry, the casualties beneath the walls soared all of a sudden, however that was still worth it in Knight Chevany's eye as 10 plus of the 20 siege ladders have already been laid with soldiers ascending upwards to the walls.</p><br/><p>Contrary to his expectations, however, the guards on the walls cheered as each soldier of the Northland Army reached them. Normal guards would fight for their lives to make sure that none reached the top of the walls instead, causing Chevany to feel both confused and intrigued at the same time.</p><br/><p>The situation on the walls seem to already be set. The four mercenary crews each took a side of the wall where five or six of siege ladders were placed. Every time an enemy soldier got up, there would be up to 5 mercenaries waiting for him. Given their superior combat abilities, it didn't take long for the Northland Army soldiers to perish under the blade and pike of the mercenaries. After killing off the invading soldiers, the mercenaries stacked the bodies together for loot collection after end of the battle.</p><br/><p>\"Sol, are they treating the ladders like a monster spawners?\" Lorist stared at the whole situation, dumbfounded. Currently, Waxima, Jim, and tens of other guards were completely unharmed despite the enemy rushing up onto the walls so relentlessly.</p><br/><p>Knight Chevany was getting even more confused. Why does it seem like chaos is not breaking out on the walls even though so many soldiers have went up? Even the Silver ranked knights I sent up seemed to have disappeared completely...</p><br/><p>The more he waited, the more anxious he got. The bad omen he felt got worse the longer he waited. Just as he was unsure of whether the battle was going well for him or not, loud, savage cries rang out from behind him. Turning to his back, the knight saw a group of soldiers slaughtering away at his camp and setting fire to the tents. The single squad of pike infantry soldiers were so terrified that they were running desperately away from their enemies within the sea of flames like cowardly rats.</p><br/><p>\"Blow the horn! Retreat! Everyone, retreat and save the main camp!\" shouted Knight Chevany who was at his wit's end.</p><br/><p>......</p><br/><p>The casualties were far too huge. The original 2300 plus soldiers were only left with 1700 and the first attack took the lives of more than 500 of their men whose bodies were nowhere to be found. The Silver ranked knights that served Knight Chevany were also mowed down to fewer than ten people.</p><br/><p>\"More than half of the supplies in the camp have been destroyed within the fires and the remaining ones that we managed to salvage can last us at most 5 more days at two meals per day. Sir, if we don't turn this around by taking the town, we are going to be completely crushed...\" reported the logistics officer.</p><br/><p>Knight Chevany let out a long sigh before he said, \"You may go back. I need some time to think...\"</p><br/><p>After sitting in deep thought for a long time, Knight Chevany took out a blank beastskin and started writing a letter. He described every detail about the expedition from the massacre of the Wildnorth Town citizens and the riches he found there as well as the fortifications of the walls of Maplewoods Bastide and the trap which he fell for that caused him to lose control of the town. The whole letter was so lengthy that it took up a number of beastskins. After that, he rolled them all up and put them into a silver tube which he then sealed with candle wax before he called for his two other attendants.</p><br/><p>\"I will bring the army back tomorrow. The two of you should hide yourselves well and when nobody is scouting around this area after our departure, try to sneak out from the entry at Morgan Hills. Make sure the contents within this silver tube reach the hands of our Lord Duke, understood?\"</p><br/><p>One of the attendants asked curiously, \"Sir, why do we need to do it this roundabout way?\"</p><br/><p>Knight Chevany sighed again as he said, \"I suspect that we will no longer be able to return. The Norton Family has already forced us into this predicament and they'll definitely not let us off so easily. I myself am not sure of what would happen during our trip back, so I have decided to send you two to return to the duke using the route through Morgan Hills as insurance. Make sure to be extra careful; this letter must definitely reach the hands of the duke so that he will be informed of the true strength of the Norton Family...\"</p><br/><p>......</p><br/><p>When Lorist saw the enemy pack up and leave for the direction of the hidden path they used to enter the dominion, he was elated. They're heading the way of their deaths. It appears that the enemy is still unaware that the route had already been destroyed. Lorist brought Josk and the mercenaries from the four crews and two squads of family soldiers to tail the duke's men from their rear.</p><br/><p>When the enemy entered the long caverns, Lorist had his men seal off the entrance and awaited their eventual return.</p><br/><p>After two days, a huge battle seemed to have erupted within the caverns and during the afternoon, a Silver ranked knight holding up a white flag could be seen walking towards Lorist.</p><br/>\n</div>"}