{"title": "Chapter 148 The Mounted Archers Unit", "id": 148, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-148-the-mounted-archers-unit", "volume_title": "Volume 2", "body": "<h1>Chapter 148 The Mounted Archers Unit</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>After 5 days of traveling with the mounted archers squad, just before Lorist arrived at the ferry port near Metropoulos River, he arrived at a field where two dominion lords were facing off against each other in a battle with around 200 troops on both sides in total.</p><br/><p>Well, using battle to describe this situation is indeed a little too much... At most, it's only a village-scale skirmish... Only four to five men were mounted and the troops they led were mostly farmer soldiers who were dressed rather raggedly and only equipped with farming tools.</p><br/><p>As the neutral side, Lorist was prepared to enjoy the show from the sidelines. But it was a shame that the two dominion lords didn't share the same sentiment as they merely trashed talked each other instead of going straight into battle.</p><br/><p>Getting more impatient, Lorist thought, just start fighting already and make way for us to pass. What's the point of sitting there and doing nothing and being in the way like that? Isn't that like going to the lavatory and occupying it so that others can't use it?</p><br/><p>\"Patt, go ask them if they're going to start fighting or not. Otherwise, demand them to make way for us to pass.\"</p><br/><p>Had it not been for the five carriages full of supplies he brought along with him, Lorist would have chosen to cross the wilderness instead of taking the main path. But it just couldn't be helped as the mounted archers' arrows and the rest of the food and camping gear for the 100 plus people as well as the hay for their mounts had to be brought along. It was only thanks to Shadekampf that they were able to stuff all that into five carriages. Lorist couldn't help but lament that he only needed two rucksacks and mounts if he traveled with only Patt and regretted agreeing to Josk's proposition to bring the mounted archers squad with him.</p><br/><p>The squad that was led by Pete only had 97 people instead of the usual 120 of a full squad. However, due to the rest of the supply carriages, Lorist had to bring along another 20 guards. Since Ruhr and Mort were so willing to tag along, he appointed them to be the captains of the guards to manage the security of the supply carriages.</p><br/><p>Patt came back with a troubled look and said, \"Milord, they want us to continue to sit here and even said that they would come to collect a toll fee from us after they settle their differences...\"</p><br/><p>\"Huh?\" Lorist looked back at the five supply carriages and realized that the two idiotic dominion lords had mistaken his group to be a guard escort for a merchant convoy.</p><br/><p>\"Sol... They want to collect toll from me? Lorist said as he smiled.</p><br/><p>\"Pete, bring the mounted archers with you. I'll give you ten minutes to chase them away. Capture two of them and ask them what they're fighting over,\" ordered Lorist calmly.</p><br/><p>\"Yes, milord,\" said Pete, before he whistled to signal for the mounted archers behind him to get into two neat formations and led them to begin the charge.</p><br/><p>As they approached the spot where the two dominion lords and their men were, the mounted archers stopped their horses and drew their longbows wide. Without delay, Pete gave the order to fire and sent out a volley of arrows towards the two factions.</p><br/><p>The two dominion lords were completely befuddled as merchant convoys usually didn't interfere with battles like that. As the volley of arrows blanketed their troops, all hell broke loose with cries of pain and agony resounding throughout the battlefield.</p><br/><p>Patt had ordered his men to fire three volleys in total and whistled once more to instruct them to put away their bows. Subsequently, they drew their swords and split into two groups that charged towards both factions. As expected, the soldiers of the two factions crumbled instantly and the two dominion lords were the first to ride away as they saw the mounted archers approaching. The soldiers they left behind fared even worse as they melted into an undisciplined mess.</p><br/><p>\"Our mounted archers are truly quite formidable. They managed to defeat a few hundred people without even incurring a single casualty. No wonder milord requested for their formation at that time...\" Patt praised.</p><br/><p>Before he finished, an audible thump could be heard. Turning his head back, Patt saw that Lorist had actually fallen from his mount. Surprised, Patt asked, \"Milord, what's going on?\"</p><br/><p>Lorist wiped the dust off his face as he stood back up from the ground. Waving his hands, he said, \"I'm fine. I slipped off the horse cause my legs weren't in the stirrups...:</p><br/><p>By the gods, that isn't the 'mounted archers' I had in mind! When he saw the troops in action, he was so shocked that he actually fell off his horse. Those are not mounted archers... They're just bowmen on horses! How did that idiot Josk train his men?</p><br/><p>Pete brought a few captives over and reported, \"Milord, according to them, this path is frequently used by merchant convoys and Viscount Darwof set up a customs point nearby to collect toll. The two dominion lords near here also wanted a part of the profit and decided to set up another customs on this path for themselves. However, this path is at the border of the dominions of those two nobles and both of them insisted that the area belonged to them. The battle that was supposed to occur back then was to be used to decide which family would own that area.\"</p><br/><p>Well, it's too bad that their settlement had to be disrupted. Then again, it's their fault for picking the wrong place and barring my way.</p><br/><p>\"When was the customs point further ahead formed? How many guards are there and what is their estimated battle strength?\" Lorist asked the captive that seemed to be a squad captain given his wearing a half-body leather armor that most of the other captives weren't equipped with.</p><br/><p>\"Since half a month ago, milord,\" replied the captive quickly. \"There is a squad of garrison soldiers stationed there and they were originally part of the garrison of Viscount Darwof's newly-built town. Just recently, they were also appointed to guard the customs point and collect toll. I really don't know how formidable they are, but they're quite well equipped with some of them even having metal armor...\"</p><br/><p>Metal armor, recalled Lorist suddenly, before he called out, \"Ruhr, Mort, come over here for a bit.\"</p><br/><p>\"Ah, milord, when we passed by this place and were about to enter the town next to the customs point to get some rest, the garrison soldiers came to apprehend us and even called us bandits...\" Ruhr said.</p><br/><p>\"Pete, bring your mounted archers squad and capture all of the garrison soldiers there. Patt, accompany Ruhr and Mort over there to see if they are indeed the garrison soldiers that attacked them. If they are, hang them at the customs point on the spot,\" Lorist instructed Pete and Patt. He was not prepared to witness another performance of the so-called 'mounted archers'.</p><br/><p>\"Alright, milord. We'll head out now,\" Pete said. \"Um, what do we do with these captives?\"</p><br/><p>After hearing that question, the captives all started to shiver. The moment they heard Lorist instruct for the garrison soldiers to be hung, they felt that their fates had been set in stone.</p><br/><p>\"Milord, please have mercy...\" said the captives as they kneeled and cried for Lorist's forgiveness in front of his mount.</p><br/><p>\"Just release these guys. Um, you there, go to the carriages and get some bandages and medicine for them so that they can help fix up the injured ones over there. Let's go,\" Lorist said.</p><br/><p>Just as they were a few kilometers away from the customs point, Lorist and the rest of the carriages were greeted by a scene of the corpse-filled ground with a few other captives who were clutching the back of their heads with their hands and kneeling on the ground. Ruhr and Mort were currently constructing wooden frames with the help of a few other mounted archer troops.</p><br/><p>Lorist noticed that a few of the archers were bandaged up. Seeing Pete and Patt coming over, Lorist asked, \"What's wrong? Are there any casualties?\"</p><br/><p>\"Just 6 lightly-injured men. It won't be a problem and they'll recover in another ten days. It was mainly due to some of the enemy guards who had been hiding within the building. They got hurt when we were trying to flush them out,\" Pete replied.</p><br/><p>\"Milord, we finally managed to get the ferries on the other side of the shore to come over...\" Patt said.</p><br/><p>Lorist took a look around the area that he had once traveled by during his initial journey back to the Northlands and noticed many changes. The main thing that caught his attention was the ferry port which had two additional ferries. Over there, a group of half-naked boatmen were giving their best at cranking the windlasses to help the ferries dock at the bank of the river. Hmm, it seems that Baron Silas had earned quite a bit of money from the service and even added two new ferries to accommodate the increased demand.</p><br/><p>\"Just now when we were fighting off the garrison soldiers, the boatmen all jumped into the river in fear and we spent quite a bit of effort to call them back. I promised to give them one imperial silver coin each...\" Patt said.</p><br/><p>Lorist nodded and thought that the boatmen did indeed deserve a tip given how hard they worked.</p><br/><p>Back then, the place was but a piece of desolate land. But after only half a year, a town had already been built on a hill in the distance. However, the town seemed rather tightly fortified and numerous people could be seen wielding weapons and pointing towards the customs point. It was apparent that the battle at the point had alerted the garrison troops within the town of the presence of Lorist's forces whom they believed to be enemies. They were currently doing their best to prepare for the imminent attack.</p><br/><p>Ruhr and Mort had already erected tens of tall wooden frames and were hanging the captives by force. After only a few were hung, the rest of the captives frantically begged to be spared and some of them even started running in the direction of the town in desperation. However, Pete had long been prepared for such a possibility and ordered his dismounted archers to fire a volley of arrows in the direction of those who tried to escape and turned them into human porcupines.</p><br/><p>The soldiers on the walls of the distant town started shouting and screaming out loud at what they had just witnessed. Lorist however ignored all the fuss and was currently lecturing Ruhr and Mort. \"Are you guys idiots? Not only did you not tie them up, you didn't keep the rest at a spot where they couldn't see the wooden frames and hanged their comrades in front of them! Even pigs would try to escape after seeing that! What do we now given that they're all dead? Whatever, just hang their corpses up anyway. They actually dared to rob my messengers, I wonder how they got the guts to do that... Pete, make a plaque and carve the reason why we put these men to death on it!\"</p><br/><p>\"Understood, milord.\"</p><br/><p>On the opposite bank of the river, another squad of armed guards showed up. Given that they had just witnessed the spectacle over at the other side, it was only natural that they would be on alert.</p><br/><p>\"Patt, bring some men across the river first and tell Baron Silas that an old friend has come to visit to calm him down for a bit. I will pay him a visit later after I cross the river.\"</p><br/><p>\"Milord, I think you should just cross the river now,\" Patt said.</p><br/><p>\"There's no need,\" Lorist said as he pointed at the town in the distance. \"Those people over there seem to be up to something. I'm prepared to go teach them a lesson.\"</p><br/><p>The 100 plus men and the 5 carriages took more than 3 hours to be ferried across the river. Lorist was one of the last people to be transported across. Just as the ferry was approaching from the other side for the last remaining 8, more than 100 soldiers within the town on this side of the bank exited the town gates and rushed towards them as they brandished their blades and spears with the intent to kill.</p><br/><p>Lorist's javelins and the arrows of Pete and his men instantly skewered more than 20 of the bravest soldiers of the town who rushed at the front. Following that, Lorist and Pete got mounted and raised their riding lances as they charged into the remaining group. After a the flurry of thrusting spears and slashing swords, only 30 lucky men of the original group managed to survive and ran towards the town again with their tails between their legs before shutting the gates entirely. It seemed that they wouldn't come out anymore no matter what.</p><br/><p>\"That was refreshing!\" Pete said as he waved his lance around to shake off the fresh blood that coated it.</p><br/><p>\"Let's go. The ferry is approaching,\" Lorist said.</p><br/><p>......</p><br/><p>\"Pete, back when I was at Morante City, I read a book that mentioned that during the dark ages that followed the fall of the magical civilization, a type of mounted archer unit emerged. Those archers were able to fire their arrows from horseback and could even shoot backwards while their horses rushed forward to eliminate any enemies that dared to give them chase. Anyone that fell into their sights would never be able to escape and they never engaged the enemy up front. Instead, they were skirmishers who rode their horses near their enemy's flank and used hit and run tactics to harass them until the enemy formations crumbled...\"</p><br/><p>Lorist was using this opportunity during their time on the ferry to impart upon Pete what he believed mounted archers should be, just like the Mongol mounted archers he had read about in his past life. \"They could regroup and disperse at will and their mobility allowed them to show up on the battlefield or vanish within moments. In one instance of those legends, they even managed to obtain victory over an enemy which had ten times their own numbers after four months and didn't have many casualties. Every time their enemy sent out a group of soldiers to pursue them, they would entrap them and lead their enemies along as they shot from afar until they wore the enemy numbers down. According to the books, that tactic was called kiting because it was much like how a person would pull a kite along and never getting close to it.\"</p><br/><p>\"Milord, I understanding what you're trying to say. You want a mounted archer unit that can do all that, right?\" Pete asked.</p><br/><p>Lorist nodded happily at Pete's quick understanding.</p><br/><p>\"However, it's a shame that it is not possible with our troops. The mounted archer unit that you described can only exist in legends and it's not possible to pull off in real life,\" Pete said regrettably.</p><br/><p>\"Why?\" Lorist asked with a surprised tone.</p><br/><p>\"Milord, firstly, we don't have suitable bows for that purpose. While the bows that some nobles use when they hunt can be shot from horseback, the firing distance is not far and can only reach around 40 meters ahead because they're relatively weak don't fire with much force. While that is sufficient for hunting animals like turkeys and rabbits, it's completely useless against magical beasts or soldier formations. Of all the bows available to us, the one with the strongest force and the farthest firing distance is the longbow. It can fire arrows that hit targets 100 meters away and even pose a threat to Gold ranked knights. Even though the bow itself has weaker tension than a hunting bow, hunting bows can only shoot as far because of the heavy arrowheads that are used to hunt magical beasts.\"</p><br/><p>Pete continued to educate Lorist about archery, \"The longbow is recognized by most, if not all, as a bow that is able to fire the fastest and deadliest arrows which makes it one of the most crucial ranged attacking methods for offense and defense alike. However, it's not suited to be used on horseback even if the horse is not moving because it's exceedingly hard to draw it and maintain balance on the horse at the same time. Sir Josk had spent huge amounts of effort to even make sure that our men can fire when their horses are stationary. Of all of us, only Sir Josk can continually fire arrows on horseback without falling off while the rest of us would lose balance after only three shots.</p><br/><p>\"Additionally, if we don't use longbows, we won't be able to match the enemy's firing distance, and if we approach them too much, we would be attacked instead and be unable to retaliate. That's why, to form the ideal mounted archer unit that milord had described just now, the first problem that has to be solved is creating a type of bow that can be used on horseback that can also rival the firing distance and strength of a longbow. Other than that, we also lack the horses that can perform like those used by the mounted archers you described. Of all the horse breeds on the Grindia Continent, none of them would be able to fit those criterias,\" Pete explained.</p><br/><p>\"...Hmm?\" Lorist mumbled in puzzlement.</p><br/><p>Pete continued, \"Milord, the mounts of the mounted archers you read about must be robust and have excellent endurance and stamina. They must also be able to recover their energy quickly to be able to run long distances as well as being agile and reactive enough to be able to travel on both flat and mountainous terrain to be able to escape enemy pursuit. They must also be hardy enough to be able to resist cold and hot weather as well as having high resistance to diseases. Perhaps the most important requirement they must have is to be able to consume huge amounts of feed and also digest them at a quick speed. No horse on all of Grindia is capable of that.\"</p><br/><p>Is this guy talking about the Mongol horse?[1] The horses the Mongols used were quite common across the Eurasian Continent, but to think that Grindia doesn't have this kind of breed... That's just a real shame, thought Lorist with much frustration.</p><br/><p>Pete further dulled Lorist's hopes as he said, \"Milord, look at our mounts. These Northlander Horses are different from other breeds and they can be considered to be the more balanced type among their kind. While they are easy to raise and take care of, they are far from being able to serve the role of those horses used by the mounted archers you talked about. Also, the reason three out of five of our carriages are filled to the brim with grain and oats is because we are worried that we won't be able to find enough feed during our journey. If we don't have enough, the horses would lose weight and when coupled with a long distance journey, these Northlander Horses would end up completely useless.</p><br/><p>\"If the mounted archers that you mentioned rode Northlander Horses, each rider would have to bring at least 7 to 8 mounts with him so that he would always have a fresh mount to switch to and loads of horse feed to be able to maintain the horses' physical condition. Using the battle you mentioned as an example, two regiments consisting of 2000 riders would require at least 10000 Northlander Horses. While Zeno Horses and Baligali Horses are better for long distance trips and have great endurance, the way to feed and maintain them is even more complicated than that of Northlander Horses.\"</p><br/><p>Lorist had no choice but to admit that Pete made quite a few good points. Lorist wanted to form mounted archer units after all, not horse-breeders. Even if each rider could take care of 8 horses on his own, there was also the problem of them being mistaken as a horse merchant.</p><br/><p>Stroking his nose, Lorist suddenly felt rather embarrassed as he had made the decision to form a mounted archer unit without even understanding the basics of archery and horsemanship. Had it not been for Pete's explanation, he might have blamed Josk for not trying hard enough to make the unit of his dreams. It was primarily the fault of the knight training course instructors back in the Dawn Academy who always said that knights should be brave and courageous during a charge and that using a bow is an act of cowardice. That had caused Lorist to neglect archery training almost entirely to the point that he could only use javelins to attack enemies at a distance.</p><br/><p>Oh well, I guess after I settle most of the pressing matters and have enough time, I can go find some people to start research on whether we can make bows that are shorter than longbows that they can be used on horseback. I'm only worried about whether its firing range and strength can compare to that of a longbow though, pondered Lorist during the rest of the journey.</p><br/><p>[1] A special breed of horses native to Mongolia. See: Wikipedia.</p><br/>\n</div>"}