{"title": "Chapter 140 Shock", "id": 140, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-140-shock", "volume_title": "Volume 2", "body": "<h1>Chapter 140 Shock</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The large tent was quickly filled with the tables that were brought within it by the servants. The difference between these tables and those which the knights sat by outside was that these were far more intricate and the servants even laid a fine, white linen table cloth onto them before they placed vibrant flowers and baskets of assorted fruits upon them.</p><br/><p>In total, there were 20 long tables lined up into two rows. On either side of each table were 12 chairs in total. Lorist took a few looks before Viscount Kenmays told him that since the knight competition was organized by their two families, there was no master seat. It was possible that he merely didn't want the Nortons to use the opportunity to steal the spotlight. Even so, Lorist felt that this arrangement was apt as it symbolized the equal standing between the two families.</p><br/><p>The few tables in the middle were reserved specifically for dominion lords. Apart from Lorist and Viscount Kenmays who were seated face to face at the first table given their status as the organizers of the competition, the rest of the seats were arranged according to the relative titles of the attendees with some noble ladies sandwiched in between. The side-most tables were prepared for the guests or Gold ranked knights who were invited to the banquet by the dominion lords. Lorist noticed that apart from Josk, only two other Gold ranked knights were brought over by their lords. Shadekampf on the other hand had a seat for himself over there as he had played a large part in the committee of the competition.</p><br/><p>Given that it was Lorist's first time attending a formal nobles' banquet, he tried his best to behave cordially and seriously. That aside, Viscount Kenmays who was seated directly opposite him was chattering away, impressing his listeners with the vast knowledge he had. They were especially enraptured with his unique interpretations of the major events that had happened during the course of Grindian history.</p><br/><p>As he cut the steak with his silver utensils and brought them to his mouth while listening to the incessant tales of Viscount Kenmays, Lorist heard a mention of Morante City. All of a sudden, Viscount Kenmays turned to Lorist and said, \"I've heard that Baron Norton had left the Northlands and studied at Morante City for more than 10 years. Something quite major happened over there last year, didn't it?\"</p><br/><p>Last year? I don't remember anything particularly significant. I don't think anything noteworthy happened before I left. Lorist shook his head and said, \"Last year, after I received the summons from my family, I began my journey back immediately, so I'm afraid I'm not informed about what you are referring to.\"</p><br/><p>\"Oh, then you must've made your move too early. Back at the Dawn Academy within Morante City, there was an Iron ranked instructor called Locke who dueled all the Silver ranked instructors within the academy sector. Up to 30 Silver ranked instructors were defeated by him during that time. After that, the Iron ranked instructor Locke stepped down from the dueling platform and has gained a fearsome moniker of Iron Locke the Silver Undefeated for beating all his challengers without losing even a single duel. It's a shame that I had something else on my hands back then and wasn't able to make my way to the city to witness the wonder myself, what a shame...\" said the viscount with utmost regret.</p><br/><p>No worries, this one is sitting right in front of you. You can open your eyes wide and observe to your heart's content.</p><br/><p>\"Oh, I know about that. Instructor Locke's swordsmanship truly is profound. He is really deserving of that moniker,\" said Lorist without the slightest hint of embarrassment nor shame.</p><br/><p>Viscount Kenmays changed the subject quickly and said with a smiling face as he raised his silver cup, \"This knighthood competition lasted 27 whole days and Baron Norton, you only showed up today on the closing banquet. Don't tell me that you got bored of seeing fights like these back in the city and can't be bothered to witness the competitions between the knights? Baron Norton, shouldn't you at least try to explain the reason for your absence?\"</p><br/><p>Lorist raised the silver cup in his hand in a similar fashion and said, \"Haha, I really didn't have a choice as there were really too many matters I had to settle within my dominion. I'm sure all of you here know that I've just succeeded the dominion and the title recently and I hope you can tolerate my absence because of that. Even so, Lord Viscount, no, I should address you as Lord Count now... I've heard that Count Lopez has passed his title and dominion to you. I really have to congratulate you for this. Here's a toast to your amazing achievement.\"</p><br/><p>Even though Lorist didn't say it that loudly, every person within the tent didn't miss a single word and chatters resounded throughout the tent. By the time it finally quieted down, the gazes of everyone within the tent were focused on Viscount Kenmays. A few dominion lords even seemed rather restless on their seats as if they wanted to return to their dominions right away. Baron Felim of the Family of the Pegasus even seemed like he was in deep thought.</p><br/><p>Viscount Kenmays's face froze up with a smile, but he quickly recovered and made a pained expression as he said, \"Sigh, I'm sure that most of you know that I've been here for the most part of the competition, so I really didn't expect that something of that magnitude would happen. All of you know about the close and intimate relationship between Count Lopez and my father. It truly is a tragedy for the count to have been injured during an encounter with the mountain barbarians. Didn't he write me a request for help some time ago? After I received it, I brought my family's forces to his dominion right away so that he may command it to defeat the barbarian threat. Not in my wildest imaginations would I have thought that the count would entrust his title and dominion to me on his deathbed and request that I take care of his two sisters from the threat of the mountain barbarians. While taking care of his family is something is definitely an obligation I intend to fulfil, I still have the issue of the barbarians to worry about. How troublesome.\"</p><br/><p>Lorist tried to console him and said, \"The Kenmays Family is indeed one with a rich mercantile background. I'm sure that you will manage to find a way to make up and coexist with the mountain barbarians. As long as they don't launch any assaults, then I'm sure that you'll be able to bring the dominion the count left you to prosperity within no time.\"</p><br/><p>\"Thank you for your kind words, Lord Baron. Then again, I've heard that you refused the demand of Duke Loggins not long ago and even hurt his Gold ranked knight who was sent there as an ambassador and incited the duke's rage in the process, causing him to announce his deployment of the Northland Army to punish your family. I wonder if you need our help to console the duke and put in some good words for you... Perhaps he may consider sparing the Norton Family...\" Viscount Kenmays retorted.</p><br/><p>\"There is no longer a need for that,\" Lorist said in a dissatisfied tone as he chugged a few gulps of wine. He continued, \"That dogshit Duke Loggins has sent two regiments of the Northland Army numbering around 4000 people led by Gold ranked knights Chevany and Hennard to invade the dominion of my family. After they entered the dominion, they massacred all the folk of Wildnorth Town right away...\"</p><br/><p>Lorist paused and could clearly see the look of perturbation and delight that flashed past quickly on the face of Viscount Kenmays.</p><br/><p>\"A massacre... of the whole town?\" Viscount Kenmays muttered stammeringly.</p><br/><p>The part of the announcement that made the viscount feel delight was the fact that the duke's men had already entered the Norton Family dominion using a new, yet undiscovered route. The part that made him perturbed was the massacre of the townsfolk; given the scarce population within the Northlands, even if two lords were to start an all-out war with one another, they wouldn't lay their hands on the non-combatants and would at most pillage them for their goods. Duke Loggins on the other hand massacred a whole town at the Northlands and news of that would definitely incite strong animosity and objection from the other nobles in the Northlands. Nobody liked to deal with a greedy and cruel superior noble.</p><br/><p>Soft chatters once again filled the tent as the various nobles discussed with one another the things Lorist had just said. Knowing that Josk was a knight of the Norton Family, the noble ladies gathered around him and offered their condolences, causing Josk to feel awkwardly uncomfortable and struggle to respond while sweating out in anxiety.</p><br/><p>Many nobles looked at Lorist with sympathetic gazes as the two regiments numbered around 4000 men and the Gold ranked knights of the duke would definitely give the Norton Family a hard time. Even though Lorist was attending the banquet like nothing was happening, in the eyes of the other nobles, he might probably have to surrender and be stripped of all his belongings to be able to escape the predicament he was in. They believed that the only reason Lorist was there was so that he doesn't lose any face as most of them knew the temperament of the duke quite well.</p><br/><p>However, Baron Felim was the only one who looked at Lorist with suspicion as he found that Lorist's face didn't have the slightest indication of worry at all as well as the audacity Lorist showed when he insulted the duke in front of all the nobles. A person who was getting ready to surrender to the duke's forces would definitely not be able to utter something like that.</p><br/><p>\"That's right. The males, the elderly and the infants were all killed with only 1000 or so women and young girls remaining to be sold to slave traders. That son of a bitch of a duke can't be human, for him to even be willing to do something so heartless. The reason I wasn't able to be present during the competition was because I had to deal with all that. I only managed to settle all of it during the past few days, just in time for today's banquet,\" Lorist said as he used his fork to stuff yet another piece of steak into his mouth and accidentally smearing some oil on his cheeks. \"Wow, your family's chefs are really great. This taste is wonderful.\"</p><br/><p>\"Urk... Sold to slave traders... How terrifying...\"</p><br/><p>Lorist turned his head and saw one lady beside Josk who pretended to faint sickly into his embrace, perfectly emulating what a model benevolent noblewoman would do once she heard about the cruel and indifferent nature of reality. Poor old Josk didn't know what to do as he couldn't hold her tightly nor let her fall to the ground and had no choice but to gaze at Lorist and signal for help.</p><br/><p>Hah, it's your own fault for looking so good and dressing up so flashily like a peacock, Lorist thought as he pretended to not see anything.</p><br/><p>\"If Lord Baron, you, are enjoying the steak, why don't I order another serving for you?\" said the viscount as he twirled the silver cup in his hand nonstop. After arduously waiting for Lorist to have another gulp of meat and wine, he asked impatiently, \"What happened next?\"</p><br/><p>\"Huh? What about it?\" Lorist asked while he seriously considered whether he should get another steak.</p><br/><p>\"Well, didn't you say that the duke sent 4000 men into your family's dominion and massacred the citizens of Wildnorth Town? What happened after that?\" Viscount Kenmays had the sudden urge to smash his silver cup into Lorist's face as he thought, can't you finish your story before you take another bite? How long has it been since you had any steak? Don't tell me the forces of the duke sweeped your dominion clean to the point that you can't even get some yourself?</p><br/><p>\"Oh, you were talking about the duke's force of 4000. Hehe, they're completely decimated. While they entered the dominion quite easily, there's no way I would just sit back and let them waltz out,\" Lorist said candidly.</p><br/><p>Clang! The cup Viscount Kenmays was holding fell straight to the floor. Directly following that, a few other clangs could be heard as the nobles stared blankly at Lorist.</p><br/><p>\"You... What did you say? What was that about decimation?\" Viscount Kenmays couldn't care less about the cup he had dropped and pestered Lorist for a more detailed explanation.</p><br/><p>\"Come on, what's so surprising of the duke's men being completely wiped out? You're already this old and yet you couldn't hold a cup properly, how uncouth... And to think that I was planning to have you do me a favor... It seems that I have to seriously reconsider it,\" Lorist said slowly and calmly.</p><br/><p>\"How can that be...\" Viscount Kenmays cried out loud.</p><br/><p>Back then when the new nobles that were just entitled by the Second Prince, the one who had the most military might was one of the Second Prince's Gold ranked guards. Due to being entangled in an affair with the queen of the Iblia Kingdom, the guard was exiled to the Northlands and demoted to a baron. Probably due to the sponsorship of the queen, the Gold ranked guard managed to bring around 1000 soldiers into the Northlands and wasn't willing to submit to the duke. In the end, the duke sent 2000 Northland Army soldiers led by Knight Chevany and conquered the new baron's castle within a mere three days. The head of the Gold ranked guard could still be seen hanging from a wall within the duke's mansion in Gildusk City. Viscount Kenmays could recall the times he saw the head for himself during his visits to the duke.</p><br/><p>That was the reason why all of the nobles within the Northlands feared the duke so much and didn't dare to antagonize him lest they had to face the brunt of the Northland Army, causing the duke to grow ever more arrogant and dare to reap more profits from the nobles. Now that Lorist mentioned that he had defeated over 4000 soldiers of the Northland Army, the nobles were all filled with shock and doubt.</p><br/><p>\"Oh, that's right, what about Knight Chevany and Knight Hennard?\" asked Viscount Kenmays hurriedly. Even though Lorist said that he had wiped the duke's men out, if he said that the Gold ranked knights leading the soldiers managed to escape, then there was a huge possibility that Lorist was lying. Hennard might have managed to run away... Given that Viscount Kenmays was an acquaintance of Knight Chevany, he understood that the knight definitely wouldn't leave his men behind given his stubborn and old-fashioned personality.</p><br/><p>\"The favor I was about to ask of you is in part related to that,\" Lorist said. He asked the viscount in a steady tone, \"I heard that you have quite a close relationship with the dogshit of a duke?\"</p><br/><p>\"It's... it's passable. What did you mean by the involvement of the favor with the knights?\" asked Viscount Kenmays as he once again felt the unbearable urge to tear Lorist's mouth open. Can you not dally around when talking about something so serious?!</p><br/><p>\"It's like this: Knight Chevany had sacrificed himself heroically on the battlefield. I have his body and I hope that you can help me transport it to his family. Other than that, we have captured Knight Hennard and ten plus other Silver ranked knights. They hope that they will be able to pay a ransom for their freedom, so I will pass the name list to you later. Tell their family members or friends within the army to come here and pay the ransom,\" Lorist said.</p><br/><p>\"Sho-shouldn't you be giving the name list to the duke?\" Viscount Kenmays asked curiously.</p><br/><p>\"Well, I've thought about it before,\" Lorist said. \"Those Silver ranked knights think that the duke wouldn't bother to pay their ransom. So, they'd rather pass the word to their family members and friends for their help.\"</p><br/><p>Viscount Kenmays listened in shock before he thought in realization, what a great, calculative move... If rumor of that spreads within the Northland Army, who would still be willing to serve the duke? His marvel aside, the viscount was more than willing to help out with that task as causing the duke trouble would be good for the formidable reputation he was trying to build up for his family.</p><br/><p>\"Very well, I'm more than happy to help you out with that,\" said Viscount Kenmays. He looked at Lorist and asked sincerely, \"Given that you've wiped the men of the duke out, I'm sure that you've sustained quite some amount of casualties. Don't hesitate to come to me should you need any help.\"</p><br/><p>Lorist looked at the viscount and thought, hehe, are you still pining for the return of the 100000 gold Fordes? Are you trying to see if you're able to launch an attack if my family is weak from weathering the duke's assaults?</p><br/><p>\"Oh, the casualties truly are horrible...\" Lorist said as he sighed deeply. \"We actually lost up to 30 brave men with almost 100 injured soldiers... It truly is horrible...\"</p><br/><p>Viscount Kenmays turned and left immediately as he had better things to do than listening to Lorist's bullcrap.</p><br/><p>\"Hey, don't go just yet! Didn't you say you want to help out?\" Lorist called out from behind him.</p><br/>\n</div>"}