{"title": "Chapter 145 Release", "id": 145, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-145-release", "volume_title": "Volume 2", "body": "<h1>Chapter 145 Release</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Atop the castle, Baron Camorra looked at the distant group of people approaching with the knight leading it holding up the banner of the Norton Family.</p><br/><p>\"Is that the army of your family?\" asked Baron Camorra.</p><br/><p>Lorist merely nodded.</p><br/><p>\"What have they set out for?\" he asked again.</p><br/><p>Lorist laughed and said, \"They went to teach the newcomer nobles of the Northlands a lesson on the customs of the people here. One noble actually dared to capture and give trouble to the messengers of the family, so I had my soldiers hang that guy in front of his own castle.\"</p><br/><p>\"And who may that be?\"</p><br/><p>\"Some guy called Baron Farad.\"</p><br/><p>Baron Camorra furrowed his brow in thought before he said, \"I know that guy and he's very good at horse-breeding. Originally, he was the breeder of the Second Prince and he even saved his life once during their second attack against the Melein Duchy. After that, he was made a baron and sent to the Northlands. That guy is rather stubborn and the moment he arrived, he attacked the nearby Baron Slaydor and even killed all his family members before taking over the dominion.\"</p><br/><p>Lorist gave a surprised look at Baron Camorra before he asked, \"Why did Duke Loggins leave him be without doing anything about it? Isn't he supposed to be in charge of the dominion lords of the Northlands?\"</p><br/><p>\"Well, Baron Farad was a noble entitled by the Second Prince so it wouldn't do the duke any good to antagonize him,\" said the baron as he shook his head. \"The duke said that since the old noble of the Northlands don't really treat him with respect, he'll lord over the new ones. As long as they pay their taxes to him, he wouldn't give them any trouble. That way, the Second Prince won't have anything to pick with the duke as well.\"</p><br/><p>\"So the duke does fear the Second Prince after all...\" Lorist said as he chuckled. \"No wonder even though everyone in the Northlands know the duke's ambition of forming his own duchy, he hasn't made any concrete moves just yet. So that was the reason. With that small, little gut of his, there's no way he's gonna achieve anything great.\"</p><br/><p>Baron Camorra no longer continued to speak. He regretted running his mouth too much and allowed Lorist to guess the truth of the situation without too much trouble.</p><br/><p>\"Camorra, forgive me for being candid about this, but as nobles, we have to have the behavior and pride befitting of one. I'm sure you understand as well that the values the duke holds is considered a violation against the traditions of nobility and I really find it hard to understand the duke's intentions. Can you enlighten me about them?\" Lorist asked as he once again changed the subject to the ransom of the knights.</p><br/><p>\"Sigh... Actually, the duke isn't planning to pay the sum as a ransom for their freedom but rather as a reward for apprehending criminals...\"</p><br/><p>If a criminal who escaped from Count A's territory was captured at Viscount B's territory, Count A can send someone to Viscount B's dominion to bring the criminal back for punishment. At the same time, Count A had to pay Viscount B a fitting bounty as a sign of gratitude and that was an unspoken convention among the nobles.</p><br/><p>\"Wait, what did you say? A reward for handing back the criminals? What does that even mean? Don't tell me Duke Loggins thinks that Knight Hennard is a criminal?\" Lorist cried out in surprise.</p><br/><p>Baron Camorra merely nodded bitterly.</p><br/><p>Lorist widened his eyes as he said, \"That's far too ridiculous, right? Isn't this just the duke trying to save himself some money on the ransom by exploiting this tradition? I've long heard that the duke was quite the miser, but he actually used this method to free his Gold ranked knight? Does he think that others are idiots? Nobody in their right mind would label someone a criminal just because they lost in the war...\"</p><br/><p>\"It's true. The duke truly thinks of Knight Hennard and the other Silver ranked knights as criminals and the reason he sent me here was to bring them back for their punishment,\" said Baron Camorra as he stared to the ground, seemingly wanting to bore a hole in it and jump inside to hide his embarrassment.</p><br/><p>\"I can't believe this...\" Lorist said as he shook his head. \"Unless, your duke has truly gone insane. It's just not right for anyone to be labeled as a criminal just because they lost in a war.\"</p><br/><p>Sigh, I guess I better make it clear. It's only a matter of time before word of the duke's actions spread across the Northlands anyway. I was bound to be humiliated the moment I was sent here. I only hope that this young lord of the Norton Family will refuse to release Knight Hennard for it will be far worse for him to return to the dominion as a criminal than to stay here as a captive, thought Baron Camorra. The duke's actions against the family members of Knight Chevany had completely stoned the hearts of his men to the point that even the baron himself lost all confidence and hope.</p><br/><p>\"It's not because he was defeated. He is going to be punished for losing the money of the duke,\" Baron Camorra said.</p><br/><p>\"Huh? They lost his money? What does that mean?\" Lorist asked as he got even more puzzled.</p><br/><p>Baron Camorra snickered cynically before he continued, \"Didn't they take over Wildnorth Town already and gathered up the 300000 gold Fordes' worth of wealth only to lose it to you? The duke was extremely mad at that fact and he thinks that the 300000 gold Fordes' of wealth already belonged to him and losing it was tantamount to causing him to lose his money. That to him was unforgivable. That's why the duke sent me here to bring buy them back to punish them...\"</p><br/><p>Good Sol! What kind of reasoning is that?! Lorist finally came to a realization. He asked, \"How did Duke Loggins know about that sum?\"</p><br/><p>\"It's all Knight Chevany's fault. After failing to take back Wildnorth Town, he was worried that he wouldn't be able to make it back to the dominion and decided to write a letter about the details of the battles in your dominion and sent his two attendants back to deliver it. Only one of the attendants survived the trip and managed to pass the letter to the duke. Chevany really shouldn't have written about the gains they got in Wildnorth Town. The duke was enraged upon seeing it and started to blame Knight Chevany and Knight Hennard for losing the gold that could have been his because they didn't focus on sending it back first. Not only did the duke hang the attendant by labeling him a deserter, he also exiled the family members of Knight Chevany and left them to starve on the streets without any belongings whatsoever.\"</p><br/><p>\"That's...\" Lorist was completely flabbergasted at what he had heard. He did not have a single doubt that the duke had gone completely insane.</p><br/><p>Understanding what Lorist was about to say, Baron Camorra continued, \"The duke even ordered the corpse of Knight Chevany to be tossed into the wilderness to be fed to wild dogs. However, Knight Bitson had already secretly sent someone to sneak the body away and give it a proper burial. We will also secretly take care of Chevany's family members and help them leave the Northlands when the duke forgets the matter and is no longer paying any attention to it...\"</p><br/><p>\"Your duke is truly the incarnation of greed itself. Given his almost maniacal fixation on wealth, he'll definitely want to vent his frustrations on the family members of Knight Chevany. While he isn't doing it now, one day he might think of selling them to the slave traders. You had best help them move away from the Northlands as soon as possible,\" Lorist said.</p><br/><p>That was indeed within the realm of possibility. The duke who had lost it no longer cared about the opinions of others and if he truly did that, the Northland Army was bound to crumble from the chaos. Fortunately for the duke, the presence of Knight Bitson still managed to hold the army together. However, it was only hanging by a thin thread that could snap at any moment given the rumors that were spreading around which caused the army's morale to drop significantly. As the commander of the army, Knight Chevany had always acted rather righteously and he was beloved by his subordinates. Many soldiers felt that the duke's treatment of Knight Chevany was ridiculous and were already at their boiling point. If the family members of the knight were really sold to slave traders, then it was possible for the soldiers to even revolt.</p><br/><p>Oh Lord Duke, do you have anything in your sights other than money? Without the Northland Army, no matter how much money you have, you won't be able to keep it safe! Baron Camorra nodded towards Lorist gratefully for the warning and decided that he should head back to the dominion quickly so that he can help the family members of Knight Chevany move as soon as possible.</p><br/><p>\"I think what happened to Knight Chevany was truly a shame. He was a magnificent leader. Even though we were enemies, I have to agree that he is a stellar Gold ranked knight. He had already did all he could. The true irreversible mistake was made when the duke sent his soldiers against us and gave Chevany an enemy he could not defeat. Originally, he didn't have to die, but for the sake of asking me to spare his subordinates and atoning for his failure to the duke, he decided to put himself in harm's way when he dueled me and upheld the pride of a knight till the very end. I deeply respect him for doing that and he is a true, chivalrous knight,\" Lorist said.</p><br/><p>\"If anything, the only mistake Knight Chevany made was pledging his allegiance to a madman like the duke. Sane people can never reason or converse with the insane, especially the paranoid ones. Duke Loggins is an embarrassment to all the nobles of the Northlands and he had dug his own grave this time. I believe that even now, he is still obsessed with the 300000 gold Fordes that were never his in the first place and is dreaming of getting it from my hands...\" Lorist laughed as he pointed at the soldiers who were entering the castle and told Baron Camorra, \"These are the forces of my family. If the duke wants the money, he will have to ask them for permission first...\"</p><br/><p>Looking at the soldiers from the walls, Baron Camorra felt conflicting emotions assailing him and didn't say a word.</p><br/><p>After receiving news that 4000 plus Northland Army soldiers had lost, they thought that the Norton Family forces must have sustained heavy casualties as well. However, Baron Camorra discovered that the Nortons' forces seemed to have increased even more after visiting Firmrock Castle. From the walls that were fully-staffed by patrolling guards and the sight of the new recruits who were practicing military drills, all of them were fully-equipped and armed with metal armor. The most surprising part was that the Norton Family was still able to send out soldiers to deal with the noble that had did ill to their messengers. Baron Camorra could only laugh cynically as he was forced to admit that the Norton Family's power was going to be a huge hurdle even for someone like Duke Loggins.</p><br/><p>Josk, Waxima and Shadekampf ascended the walls followed behind by Ruhr and Mort.</p><br/><p>\"Milord, we have completed your assignment and hung Baron Farad at the front of his own castle,\" reported Josk after he saluted.</p><br/><p>\"How are the casualties?\"</p><br/><p>Josk shook his head as Waxima started to laugh out loud. The two of them looked rather delighted.</p><br/><p>\"Milord, we didn't have any casualties...\" Shadekampf stepped to the front as he reported. \"Well, apart from a few soldiers who injured themselves when they fell from horseback because they still weren't used to being mounted. Sir Josk said that they would only get used to riding after falling a couple more times, so it's nothing to worry about. Everything went perfectly well.\"</p><br/><p>\"Tell me what happened in detail,\" Lorist instructed.</p><br/><p>\"Milord, when we arrived, Baron Farad was leading a few hundred men to fight against a nearby noble, Viscount Skim. Josk and Waxima ordered the soldiers to intercept the baron's forces immediately and crushed them within an instant. As Baron Farad attempted to escape, Josk used an arrow to kill his mount from afar and managed to capture him. He was quite the feisty guy and even said that he was a favored subordinate of the Second Prince and warned us to watch our backs. We ignored him and took over his castle before Ruhr and Mort personally hung him from a wooden rack. Sir Waxima also erected a wooden plaque beside it and stated the reason he was put to death,\" Shadekampf concluded.</p><br/><p>Lorist nodded with satisfaction as the mission was completed without any casualties with the best possible outcome.</p><br/><p>\"Milord, that Baron Farad was actually quite a poor guy. We ransacked his whole castle and only found 300 imperial gold coins. On the other hand, his stable was rather plentiful and there were more than 400 fine horses there as well as two herds of goat and tens of cows. An interesting fact is Baron Farad had constructed his own castle at another noble's dominion because his own dominion was in fact a desolate place devoid of any resource. It was only later that Viscount Skim told us that Baron Farad had occupied the dominion of Baron Slaydor and everything within the dominion belonged to the Slaydor Family in the past.</p><br/><p>\"Viscount Skim also said that Baron Farad also kidnapped his subjects from their villages to force them into labor for the construction of his castle, so we returned the citizens of the viscount back to him. The rest who remained were the former subjects of Baron Slaydor, but we weren't able to find the baron himself and we heard that his whole family had been eradicated by Baron Farad. That's why we brought the citizens back here along with their livestock and left the castle and its inhabitants to the discretion of Viscount Skim,\" Shadekampf said.</p><br/><p>\"Good, you did very well. Have you found the bodies of the messengers of our family?\" Lorist asked.</p><br/><p>\"Yes, we have. We brought them back after we cremated them and put their remains into urns,\" Shadekampf replied.</p><br/><p>\"Alright. We'll have a burial for them at the Martyrs' Graveyard tomorrow morning. Ruhr and Mort, you two should really get some rest now that your task is complete.\"</p><br/><p>\"Thank you, milord,\" said the two messengers gratefully.</p><br/><p>\"Also, Shadekampf, get Patt to escort Knight Hennard and the other ten plus Silver ranked knights over here. Baron Camorra, let's settle the issue today. We'll wait within the room for now. After you,\" Lorist said.</p><br/><p>After that, Patt brought the knights to the walls and entered Lorist's reception room, filling it to the brim.</p><br/><p>Knight Hennard was delighted to see Baron Camorra as he quickly called out, \"Sir Camorra, did the duke ask you to come to pay our ransom?\"</p><br/><p>Baron Camorra responded by making a forced smile.</p><br/><p>Lorist clapped his hands to call for the attention of the others before he said, \"I apologize, but I have to tell you all some bad news. I believe that the ransom offered by Duke Loggins is completely unacceptable, so I refused Baron Camorra's request.\"</p><br/><p>The whole room erupted into chatters right away and a Silver ranked knight could even be heard saying, \"You see? I knew the duke would be stingy and offer a low price for our ransom.\"</p><br/><p>Some even said, \"Lord Norton, tell us how much you want. If it's okay with you, we'll make up the difference for ourselves...\"</p><br/><p>Some of them made a wild guess and said, \"I think the Norton Family must have asked for a ridiculous price...\"</p><br/><p>Knight Hennard approached Baron Camorra and asked him in a low voice how much the ransom offered by the duke was. But the baron merely stayed quiet.</p><br/><p>\"Please quiet down, everyone...\" Lorist said.</p><br/><p>The room returned to its former tranquility with everyone's eyes trailed on Lorist.</p><br/><p>\"To clarify, the reason I refused the duke's request is because the price offered is a complete insult to knights like you as well as our family.\"</p><br/><p>\"Can I ask how much the duke offered?\" Knight Hennard interjected.</p><br/><p>Lorist looked at him before he pointed directly at him and said, \"Yours is 100 imperial gold coins and theirs are 10 imperial gold coins each.\"</p><br/><p>\"What did you say?!\" Knight Hennard was so shocked that he almost jumped with the rest of the knights being stupefied as they thought, nobody would accept that kind of price...</p><br/><p>\"I'd also like to mention that the money offered was not as a ransom for your freedom but a gratitude fee for sending you lot back to him as criminals,\" Lorist said.</p><br/><p>Knight Hennard's eyes turned bloodshot as he turned to Baron Camorra and asked, \"Is what he said true?\"</p><br/><p>Baron Camorra nodded with much reluctance.</p><br/><p>\"Why? What crimes did we commit? Are we considered criminals just because we became captives?\" Knight Hennard bellowed as his voice turned hoarse with rage.</p><br/><p>\"Becoming a captive is not a crime. But the duke believes that you are at fault for losing the wealth at Wildnorth Town to us which was worth about 300000 gold Fordes and cannot forgive you no matter what. He thinks that the 300000 gold Fordes' worth of wealth already belongs to him. Baron Camorra, should I continue or do you want to say it yourself?\" Lorist said as he turned to the baron and feigned a smile.</p><br/><p>Baron Camorra looked at Lorist with a complicated expression as he replied exasperatedly, \"Let me tell them the rest.\"</p><br/><p>He understood that if Lorist was allowed to continue, he might intentionally infuse some provocative statements as he explained away. It was better for the baron himself to tell it as it was and let the others understand that the duke had only made those rushed decisions because of his anger. Sigh, I really didn't want to make this visit, but the duke forced me to come here so I had no choice...</p><br/><p>......</p><br/><p>\"...and so Knight Bitson thought that it was better for you guys to stay with the Norton Family as captives instead of returning to the dominion. When the duke regains his calm, we will once again come to negotiate for your release.\" That was the only way the baron could have consoled the knights.</p><br/><p>\"There's no need to negotiate anymore. I plan to restore their freedom without collecting a random as an act of opposition to the despicable actions of the duke. He only wants money and is willing to throw away even his pride and standing as a noble for it. But the Norton Family believes that a knight's pride and dignity is not something that can be infringed upon so lightly and I don't want to receive any more insulting offers from the duke. That's why I hereby proclaim that you are all free to go. You can collect your mounts and belongings later and if you have any attendants, you can also tell us about them for their release. It's already getting late, so I request that you gentlemen stay for one more night before leaving tomorrow.\"</p><br/><p>Lorist then took out a sack filled with coins and said, \"Baron Camorra, here is 100 gold Fordes. Please pass this to the family members of Knight Chevany. This is my way of showing respect to a true knight like him. I hope you can help me out with this.\"</p><br/><p>Baron Camorra looked at Lorist before he finally let out a long sigh as he received the sack and said, \"Lord Norton, you've won completely and thoroughly. I will definitely pass this on to his family members on your behalf.\"</p><br/>\n</div>"}