{"title": "Chapter 159 Assault During a Snowy Night", "id": 159, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-159-assault-during-a-snowy-night", "volume_title": "Volume 2", "body": "<h1>Chapter 159 Assault During a Snowy Night</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Assault During a Snowy Night</p><br/><p>Here's the first sponsored chapter of the week brought to you by Sebastian S. from Germany. Vielen Dank!</p><br/><p>On a side note, the chapters are getting long again &gt;&lt;.</p><br/><p>By the time the snowflakes started falling to the ground, Lorist suddenly recalled that he had forgotten something really important, that was, the arrival of winter.</p><br/><p>It was the 11th day of the 11th month. In his previous life, that day was celebrated as Singles' Day in his country. However, on Grindia, it was just another normal day like any other. For him, it was also the day the last batches of vagabonds arrived at Vanades City.</p><br/><p>Lorist's face was incredibly glum as the coming of winter foiled his plans for the convoy to continue its journey back to the family dominion. His current priority was to secure a safe place for the convoy and the vagabonds for them to weather through the winter season for now.</p><br/><p>\"We took 25 whole days to get to here from the border... A short distance of 70 plus kilometers took us so long to travel... How much longer would it take us to reach the dominion? One year? Or two? How much food would we consume within a single day with more than 100000 people? I'm sure that after you make some calculations, you'll find that it's something that we can't afford to bear...\" Lorist said with a stern look.</p><br/><p>\"It's all the fault of the vagabonds for slowing our journey down. If we traveled with only our convoy, we can travel up to 30 kilometers each day,\" Yuriy complained. As the leader of the light cavalry scouts who could travel more than 100 kilometers in a day, he was the one who couldn't bear the slow speed of the convoy the most.</p><br/><p>\"Look here, there is still around 500 kilometers of distance from Vanades City to Metropoulos River and at our rate, it will take us another 200 plus days to arrive and that definitely won't do. A round of snow has already fallen. Eve though Vanades City is the largest trading city of the Madras Duchy and we have obtained a bunch of food and supplies after occupying it, it's still rather tough for us to be able to sustain 100000 people comfortably through the winter. Thus, we must take certain measures to travel to Kobo City before the snow blocks off the road completely!\"</p><br/><p>Lorist pointed at Kobo City on the map and said, \"This city is under the control of Duke Madras himself and it is the largest food storage location within the Delamock Province where most of the duke's produce is stored. We can see from the administrative documents we got in Vanades City that the food trade that goes on here is fully supplied by Kobo City, and last year, the duke even lent the Second Prince 40 million kilograms of food which was shipped over from Kobo City.</p><br/><p>\"Another document here that shouldn't have been announced officially yet states the estimated amount of food the duke currently owns as well as another agreement between him and the Second Prince to lend him 75 million kilograms of food with the condition that the Second Prince first pay back what he owed him. It seems that the Second Prince is pretty drained as well,\" Lorist said as he tossed a stack of beastskin documents on the table.</p><br/><p>\"We've got a huge burden of 100000 vagabonds on ourselves and winter is already at our doorstep. However, we're still unable to procure the necessary clothes, food and shelter for them to survive through the winter. It's already the 11th day of the 11 month and we must occupy Kobo City before the 12th month when the snowfall begins to intensify. After that, we will be able to move all the people of the convoy and the vagabonds over to spend winter there,\" Lorist said.</p><br/><p>\"Milord, taking Kobo City will be rather difficult. Back then, the Third Prince led 60000 plus soldiers of the Royal Defense Guard to attack that place but still had to return due to their complete defeat at the hands of the Ironguard Legion. The news of our occupation of Vanades City and Xith Castle must've spread all over Delamock Province by now and I'm sure the soldiers there must've began to make their preparations. We will no longer be able to rely on the element of surprise and a long term attack on the city might wear down the numbers of our convoy even faster,\" Potterfang expressed his worries.</p><br/><p>\"To allow the 100000 plus people to survive, we have no choice but to occupy Kobo City. That was then and this is now. We are not the Third Prince's Royal Defense Guard, and neither are the ones who are currently defending Kobo City the Ironguard Legion. According to the captive officers, there is only one regiment of garrison troops defending Kobo City right now, and that's why I'm confident that we'll be able to take it without problems. However, I'm still worried that even if we manage to conquer Kobo City, the 100000 vagabonds will travel too slowly to arrive there. We must find a way to transport them there as soon as possible and not let them delay us any further,\" Lorist said worryingly as he tapped onto the table with his fingertip repeatedly.</p><br/><p>\"I believe we can use military discipline to manage the vagabonds like the family members of our soldiers who are now within the garrison legion. We can also give them the same treatment as the relatives of our convoy's forces and allocate some carriages for them. That way, at least 60000 of them will be able to travel at the same speed as our convoy,\" suggested Freiyar as he stood up. As the new commander of the garrison legion of the convoy, he was well aware that his men were quite envious of the treatment received by the relatives of the formal soldiers of the convoy escort.</p><br/><p>\"That's a pretty decent idea,\" Lorist said as he nodded.</p><br/><p>\"But milord, we don't have enough carriages for that. We only found around 2000 carriages within Vanades City itself,\" Charade said with a troubled tone.</p><br/><p>\"How about this... Charade, do your best to gather vehicles within the city but leave the things of the merchants untouched. We can't afford to be transporting any supplies here and there because our priority now is to travel as quick as we can. During the expedition to conquer Kobo City, I'll leave you in charge over here. Make sure to instruct the work smiths to construct as many carriages as they can and if we don't have enough horses, use one horse for one carriage. I don't expect the vagabonds to be able to travel 30 kilometers per day like the convoy, but they must at least be able to cover 15 kilometers of distance a day.\"</p><br/><p>Lorist understood Charade's behavior rather well. He noticed that the moment Charade arrived at Vanades City, his old ways began to surface and he was prepared to expropriate one third of the goods of the merchants at Vanades City to bring it back to the dominion. That's why Lorist warned him sternly to not neglect the convoy and the vagabonds for the sake of acquiring those resources.</p><br/><p>\"Pog, has the Second Highness's Royal Defense Guard been stationed at Xith Castle yet?\" Lorist asked.</p><br/><p>Potterfang replied, \"They've already arrived, around 10000 of them. After I completed my mission, I handed the castle to him and returned. Loze left a little bit later with our heavy-armored cavalry regiment and mounted archers and will be arriving here by tomorrow afternoon.\"</p><br/><p>\"Weird, Duke Madras's reaction to this seems a little slow. Hasn't he noticed that we've stopped all traffic outward from Sidgler Province?\" thought Lorist as he stroked his chin.</p><br/><p>Potterfang laughed and said, \"Milord, Duke Madras must have long known about the Xith Castle's occupation because when the light cavalry scouts entered Sidgler Province to do some probing, they noticed that the bastides there were more fortified that usual. I believe that the duke is merely unclear on whether we would attack the province or only defend the Xith Castle for the moment. That's why he didn't send out the Seamountain Legion to attack us, fearing that we will take the whole province by surprise if he leaves it undefended.\"</p><br/><p>\"That sounds about right,\" Lorist said as he nodded. \"Well, since the Xith Castle is already under the Second Highness's control, we would have to hand Vanades City to him as well. That way, he can reconstruct this place into a citadel city as a main base for him to swallow up the Yungechandler Province. Right now, the Second Highness only lacks an excuse for us to give this place to him earlier. I believe that all he is wishing for right now is for us to get out of the way as soon as possible before we suck this place dry, resulting in him being unable to benefit from any resources or recruit any manpower from here.</p><br/><p>\"I want to move us to the Kobo City mainly because there is a huge stockpile of food there and it is much closer to the Northlands than Vanades City. That way, we can return to the dominion quickly when spring time comes next year. Also, I don't wish to stay over here for long because this place would no doubt become a battlefield when spring comes. I'm worried that we will be involved in the battles if we stay here for too long.\"</p><br/><p>\"Then, when should we depart to attack Kobo City?\" Potterfang asked.</p><br/><p>\"Tomorrow morning. We will leave with Yuriy's light cavalry scouts and Terman will bring the knight brigade and follow us from behind. Loze shall also lead the three regiments of heavy-armored cavalrymen towards Kobo City. We must move quick as the time we have is limited. We will gather again when we arrive,\" Lorist said.</p><br/><p>......</p><br/><p>Six days later, Lorist was riding on a carriage with ten plus guards and arrived at a castle at the heart of Kobo City. The carriage he was in was flying the flag of the Tebri Family.</p><br/><p>The one who received Lorist was a white-haired officer in his sixties.</p><br/><p>\"Lord Viscount, I am Chief Officer Bloom. I truly apologize because even though Kobo City is under the direct control of Duke Madras, it is both a military base as well as a warehouse area and usually doesn't allow guests within it. Lord Viscount, if you'd like to find a place of residence, you will have to travel around 5 kilometers from here where Count Kelock's bastide is located. The count is a friendly man who's extremely welcoming towards guests and I'm sure, Lord Viscount, you, will receive the best hospitality and treatment over there. As for your request to purchase some food, I'm sorry to say that I can't make the decision to approve or deny it. Usually, we are not allowed to provide any food without the authorization of the duke,\" said the officer as he respectfully declined Lorist's request.</p><br/><p>\"Oh, I see. It's my fault for not knowing better of the situation. Chief Officer Bloom, I also have to apologize for making such a request as this is my first visit to the duchy. I only heard that Kobo City was the central area for food trade within the duchy so I thought that it would be like the other mercantile cities where trade is usually carried out on the spot,\" Lorist said sadly, fully putting on an act of a disappointed noble who had traveled all the way for nothing.</p><br/><p>\"It truly pains us as well for your wasted trip. In actuality, we usually conduct our trade at Vanades City. We would only ship the required amount of food according to the orders made there. However, I've heard that the city is occupied by vagabonds now, so we can only allow the purchase if the duke himself permits it,\" said the old officer as he bowed down deeply.</p><br/><p>\"Oh. Then I have no other choice but to find a way to meet with the duke or wait for a little longer until the situation changes. I really thank you for your guidance, Chief Officer Bloom. I shall take my leave now,\" Lorist said as he nodded to the officer before he reboarded his carriage and left Kobo City.</p><br/><p>As he looked at Lorist's carriage depart, the old officer muttered curiously, \"Why would a noble from the Redlis Kingdom come all the way here to buy food? Would he be able to transport it back even if he was allowed to buy some? The Second Prince will definitely expropriate more than half of it anyway when he returns... It'll be fortunate if he's even left with a third of it...\"</p><br/><p>Lorist's carriage continued towards the east and left the range of Kobo City's security force. Within 30 minutes, they arrived at a thick, lush forest. Past the forest was a huge army outpost.</p><br/><p>Lorist entered the tent with a gloomy face. Potterfang, who was looking at some maps, asked curiously, \"Milord, why are you back here?\"</p><br/><p>\"The plan didn't work. I was prepared to get a residence there so our main force can have a conspirator within the city before the attack, but I didn't expect that they didn't allow visitors to stay, even if they're nobles,\" Lorist said with a deep voice.</p><br/><p>Taking a blank beastskin and an ink pen, Lorist started drawing while he talked. \"Kobo City has two walls. The first one is as described according to the intelligence we gathered. It's around 10 meters high while the second wall is roughly 20 meters from the first wall and standing at a height of 12 meters. There are a few sentry towers on the two walls, but I didn't see any defensive machines of any kind. Those are probably protected within the towers. At the middle of the city is a 5-storey castle too. Even if the walls outside were breached, the soldiers can still retreat into the castle to put up resistance. As expected of Kobo City, the City of Forged Iron! What a befitting name!\"</p><br/><p>Potterfang shook his head as he watched Lorist draw the layouts of the defenses as he couldn't think of a good way to attack the place either. He turned his attention towards the outside of the tent and exclaimed, \"Milord, look! It's snowing again. This is the second snowfall of the year. If we don't have a way to attack Kobo City, we'll have to move our troops back to Vanades City...\"</p><br/><p>The snow fell from the darkened skies ever so gently, before wetting the ground outside the tent.</p><br/><p>Lorist's eyes suddenly gleamed with excitement as he thumped onto the map and said, \"Gather all the Silver ranks among our troops! I will bring them on a night assault against Kobo City!\"</p><br/><p>Lorist's plan was simple: during snowfall at night, the moon wouldn't be visible in the sky and the darkness made it difficult for one to even see one meter ahead of oneself. The defending troops at Kobo City would also be more laid back than usual given the weather, as, in Grindian history, battles conducted during snowing nights was without precedent.</p><br/><p>Having gathered the Silver ranked soldiers, they rushed to Kobo City while the skies were still dark and Lorist himself scaled the walls before he let down a rope ladder, which allowed the rest of his men to climb up the walls. After they took control of the four sentry towers, they were able to open the gates of the city and lower the drawbridge to let the rest of the troops into the city.</p><br/><p>The second inner wall was also taken over rather quickly. As a group of men were opening up the main gates of the inner wall, the other group began their assault on the castle within the middle of the city. As long as they were able to control both of the gates, by the time dawn arrived, the regiment of soldiers would have ample time to take care of the rest of the defending enemy troops on the walls and the sentry towers who were still unaware of the situation.</p><br/><p>Even so, attacking during the night was not without its difficulties. Mainly, one couldn't see one's own five fingers clearly as the snowfall limited the visibility of each individual to only one meter ahead. Secondly, Kobo City had a 6-meter-broad moat. How would they be able to cross it? It wasn't like they could just get a 10-meter-long wooden plank out of nowhere. It was doubtful that a board of that length even existed anyway. However, they were still able to utilize the long siege ladders, but that would increase the risk of some soldiers missing their foothold and falling through the holes of the ladder, shaking off the rest who were also on the same ladder.</p><br/><p>Lorist's solution to that was relatively simple: the soldiers would use ropes to tie them up together like a daisy chain. Even though they would move slower as a result, it wasn't much of a problem as the enemy troops weren't able to see them either. Using that method, they managed to to reach the walls of Kobo City without any soldiers losing their way in the darkness.</p><br/><p>\"As for crossing the moat, we'll use goat skin rafts; the rafts are used by the local fishing folk to cross the river. Given their relatively light weight, they're easy to transport and there are quite a number of them within the bastide we had conquered yesterday which were used as makeshift roofs by the residents. We only need one of those rafts for this operation. After ferrying the first group of people to the opposite bank of the moat, we'll use a rope to pull the raft back from the other side for the next batch of people to cross. We'll be able to move our men across the moat quickly that way.</p><br/><p>\"When our night assault troops take the two gates and let down the drawbridges, they will blow the horn two times long and one time short. That's the cue for the regiment to light their torches and advance towards Kobo City.</p><br/><p>\"And, we're done!\" Lorist said as he concluded the briefing confidently. \"This is a risk that we have to take. Everyone, go make your preparations!\"</p><br/><p>Before he left, Lorist thought of Els, who was currently resting up for his injuries to heal at Vanades City. That guy has extremely good night vision and he's actually the best pick for operations like these. It's a shame that he was hurt and won't be able to join us on this operation...</p><br/><p>Chief Officer Bloom, who was residing within Kobo City, wasn't able to sleep well given his old age; he only slept for three hours during the night before he woke up and couldn't go back to sleep no matter what. That's why he decided to wake up and light a candle to read a book to pass time until dawn. Seeing the snowflakes falling down from the dark sky above through his window, the old officer muttered to himself, \"Yet another year passed just like that...\"</p><br/><p>At that time, he thought he heard three horn blaring sounds. \"Those patrolling soldiers must be drunk and fooling around again... They'll be in for a beating tomorrow morning.\"</p><br/><p>After that, sounds of thunder rang out repeatedly without pause.</p><br/><p>The old officer was quite surprised that there would be thunder during a snowing night. A storm might be brewing for tomorrow... I better go to check the warehouses and see if there are any leaks that need to be fixed... Sigh...</p><br/><p>Hearing some ruckus going on at the floor below his room, the old officer was quite mad and thought, what's going on tonight? Why is it so noisy? If the servants aren't sleeping right now, how would they work effectively tomorrow?</p><br/><p>The old officer then put on his robe and prepared himself to head downstairs to give his servants a stern scolding. However, just as he opened the door, he saw three to four people rush up from beyond the castle walls with a ladder. They appeared before him not long after.</p><br/><p>With the light of the candle, the old officer could see that one of them was the young noble 'Viscount Tebri' from the Redlis Kingdom that had visited just yesterday. However, that man was covered in mud and blood and he even seemed quite oblivious about it. The young man revealed his two rows of teeth and let out a standard noble's smile before he said, \"I'm really glad I got to meet you again, Chief Officer Bloom...\"</p><br/>\n</div>"}