{"title": "Chapter 163 River Crossing", "id": 163, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-163-river-crossing", "volume_title": "Volume 2", "body": "<h1>Chapter 163 River Crossing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>River Crossing</p><br/><p>And here's the second regular chapter of the week. Second Highness's douchebaggery intensifies!</p><br/><p>On the 18th day of the 2nd month of Year 1768 of the Grindian calendar, the vanguard of the northbound convoy led by Fiercetiger Loze and the light cavalry scouts led by Yuriy started leaving for the Metropoulos River ahead of the rest towards Baron Silas's dominion where the crossing point was located at. They planned to build the floating bridge there and set up their camp before receiving the rest of the convoy and vagabonds and help them with crossing the river.</p><br/><p>Els also rushed to Kobo City to report to Lorist on that exact day. He had just recovered completely after resting for the whole winter at Vanades City and rushed there impatiently the moment he was fit enough to move with his four other guards. Els brought two pieces of intel for Lorist, the first being his sighting of the Second Highness's Royal Defense Guard unit that he encountered on the way back numbering around 10000 people that would arrive at Kobo City within two more days.</p><br/><p>The second piece of information was about the Second Highness's mobilization of around 5000 laborers to begin construction of a citadel at the steep mountain path towards Lichtana Citadel which was within 5 kilometers of Vanades City.</p><br/><p>Lorist took a look at the map and felt that something was up.</p><br/><p>Charade, Potterfang and Terman proceeded to debate about the issue. Charade felt that the 10000 plus soldiers that were heading to Kobo City must be waiting to receive control of it from the convoy. Given that Kobo City was the central location of Delamock Province and is also a fortified city which was easily defended and difficult to take over, the Second Highness definitely wouldn't leave the city unattended. With the 10000 plus Royal Defense Guard troops, he should be able to hold off the forces of the Iblia Kingdom's Second Prince for a period of time.</p><br/><p>However, not one of them understood the intent behind the Second Highness's citadel construction project near Vanades City. Practically speaking, he should reinforce and fortify the defensive faculties of Vanades City instead and renovate it into a fortified city. As long as they occupied Vanades City, they would be able to control the transportation route there and maintain the attacking initiative on the battlefield, allowing them to advance or retreat as they pleased.</p><br/><p>In the end, they settled on Potterfang's guess. He believed that the Second Highness's construction of another citadel was to ensure that he had another place to retreat to. Other than that, the additional citadel could aid in restricting the enemy offense in that they would be able to prevent Vanades City from being completely surrounded. Another advantage that citadel offered them was that even if their forces weren't able to hold Vanades City, they would be able to retreat to that citadel. It also ensured that the Yungechandler Province which had just entered the control of the Andinaq Kingdom would be kept safe from enemy attacks.</p><br/><p>Lorist could understand why Potterfang came to those conclusions. However, as the convoy and the vagabonds were about to leave Kobo City for the family dominion, Lorist no longer cared about what would transpire over there and felt that they should be more worried about the journey ahead of them.</p><br/><p>Two days later, the troops the Second Highness sent arrived at Kobo City and Charade passed the defense of the city to them as well as the 10 million kilograms of food there.</p><br/><p>Out of Lorist's expectations however was how the troops didn't increase the fortifications of the city; on the contrary, they proceeded to dismantle the fortifications. They spent around ten days to completely remove the defensive walls and ruin the tens of sentry towers before taking the food and leaving.</p><br/><p>\"Good Sol...\" Charade cursed. \"What a devious move... He's practically using our convoy as bait now...\"</p><br/><p>With a gloomy face, Lorist said, \"We have to increase our traveling and transportation speed. It's fortunate that we sent some of us off a few days ahead of schedule. If we only started our departure now, it would've been too late. Order the light cavalry scouts to scan the area and watch out for the movements of the noble families within Delamock Province, especially the ones near the southern border next to the Iblia Kingdom. Transport the rest of the people and goods to the river crossing point...\"</p><br/><p>Nobody would've expected that the Second Highness would actually send his troops to render the strongly-fortified Kobo City useless. The road from Kobo City to the crossing point was around 150 kilometers long. Given the scale and size of the convoy which was hindered by the additional 100000 plus vagabonds, they would have to spend at least three months to travel that far under normal circumstances. With the crossing of Metropoulos River further bottlenecking their progress, it would take them even longer to arrive at the family dominion.</p><br/><p>It was already near the end of the 2nd month and even if the Second Prince led his troops to attack Delamock Province one month later, it would take only 15 days for his troops to make their way from the border to Kobo City. When they notice that the city's defensive capability had been crippled, they would be faced with only two options: to advance towards Vanades City or to tail the convoy and attack them while they're stuck crossing the Metropoulos River.</p><br/><p>Given the amount of resources the convoy had and the Second Prince's insatiable greed, it was easy to guess which choice he would make.</p><br/><p>Lorist was currently filled with rage. He had been willing to unconditionally hand Kobo City to the Second Highness and even provide 10 million kilograms of food in hopes that he would defend the city and face off against the troops of the Second Prince, thus allowing the convoy more time to cross the river and arrive at the Northlands. However, he didn't think that the Second Highness would be that savage and sabotage Kobo City intentionally to put the convoy in further danger.</p><br/><p>\"Good Sol!\" Lorist cursed towards the skies. In actuality, he wasn't afraid of the Second Prince's forces given the current military strength of the convoy. While it wouldn't be impossible for them to be able to completely fend off their assaults, if they were able to wipe out 3000 enemies, how would that justify their own losses of around 800 because of the Second Highness's actions? Even if they defeated the Second Prince, what benefits would they get? Nothing! They might even anger the father-in-law of the Second Prince, the mighty Duke Fisablen, as a result.</p><br/><p>In truth, none of them were fools; Lorist wasn't one and neither was the Second Highness. The reason Lorist wanted to make his way out of the Madras Duchy was so that he wouldn't be taken advantage of by the Second Highness in the first place. He could also head to his dominion and start developing it as soon as possible. However, the Second Highness insisted on involving Lorist in this conflict in hopes that the convoy's forces would be able to buy him some time to prepare for battle and even hoped that the two clashing forces of the convoy and the Second Prince would result in heavy losses on both sides so that he could reap all the benefits easily.</p><br/><p>As expected of a person who would do anything to realize his ambition! Lorist was forced to accept that he had miscalculated gravely and shouldn't have placed his hopes on the Second Highness in the first place. Now that the Second Highness had pulled a move like this, all the convoy stood to gain from it was losses.</p><br/><p>\"Heed my orders...\" Lorist said after thinking solemnly for quite some time.</p><br/><p>\"Potterfang is to lead his heavy-armored infantry to reach the river crossing point as soon as possible and begin setting up camp as well as have some men start building some defensive fortifications.</p><br/><p>\"Loze, Terman and Pete will each lead the heavy-armored cavalry, knight brigade and mounted archers respectively to expropriate the carriages of the landed nobles of Delamock Province as well as some goat skin rafts and fishing boats. Try to get as many as possible. If anyone dares to put up any resistance...\" Lorist paused, before coldly saying, \"Kill them without question!</p><br/><p>\"After Malek leaves with part of the garrison legion, Freiyar will maintain the security and order of the convoy members and the vagabonds. If anyone dares to cause trouble, kill them off!</p><br/><p>\"Also, the work smiths must use whatever method they can to construct enough boats for us to make at least four floating bridges across the river. If we lack materials and tools for that, have Loze and his men be in charge of expropriating them.\"</p><br/><p>Reidy recorded every order Lorist barked out on a piece of thick beastskin before handing it to Lorist to be signed. Patt dripped some hot red wax onto the location of the signature for Lorist to seal with his ring. After that, Patt rolled up the beastskin and put it into a silver tube and sealed it with more wax before stamping on the seal of the raging bear and handing the tube to the guards to be passed on.</p><br/><p>\"We have to hasten our plans as well. By the end of this month, no matter what, we have to finish moving the food within Kobo City and leave this place,\" Lorist said as he turned towards Charade.</p><br/><p>Charade merely nodded.</p><br/><p>......</p><br/><p>By the time Lorist made his way to the crossing point within Baron Silas's territory, it was already the 6th day of the 3rd month. Apart from roughly a thousand troublemakers who were excommunicated from the convoy and the vagabond group, the rest of the people were traveling to the crossing point at that very moment.</p><br/><p>Three floating bridges had already been built across the Metropoulos River with the fourth one being halfway done. On the opposite shore, a convoy camp could be seen and the convoy members who had arrived were already crossing the river using two of the floating bridges. The third floating bridge was being used to transport the resource-carrying carriages to the other side. The coachmen carefully led their horses and carriages across the river from the bridge.</p><br/><p>\"Milord, you should go rest at the bastide nearby,\" Potterfang said as he approached Lorist.</p><br/><p>Lorist looked at the direction Potterfang was pointing in and understood that he was referring to Baron Silas's bastide. He then asked, \"Where's Baron Silas?\"</p><br/><p>\"Who?\" Potterfang asked curiously.</p><br/><p>\"I was talking about the local dominion lord,\" Lorist replied.</p><br/><p>Potterfang revealed a surprised look and pointed towards the port as he said, \"He's over there...\"</p><br/><p>Lorist turned his head to look only to see a high wooden frame where four to five corpses could be seen hanging in mid air.</p><br/><p>\"Whose work is that?\"</p><br/><p>\"Yuriy and Loze,\" replied Potterfang.</p><br/><p>\"Why?\"</p><br/><p>\"That dominion lord didn't allow us to build the floating bridges and said that a hundred kilometers within the range of the crossing point was his territory and that we had to pay if we wanted to cross the river. Angered, Yuriy and Loze hung him up right away and occupied his bastide in the meantime.\"</p><br/><p>Lorist was speechless as he thought, yet another fellow who has a death wish... Is he blind? Did he not notice the number of soldiers we had? He still thinks that it is peacetime within the empire and that nobody dared to offend nobles... To think that he insisted on collecting toll instead of withdrawing back into his bastide to defend it... It's his own fault for being so money-minded to the point of being willing to risk his own life for it.</p><br/><p>Yuriy and Loze were not the most diplomatic if Lorist's men. One was among the earliest followers of Lorist since the days of Dawn Academy and the other was a person who had just been given the moniker of 'Fiercetiger' by Lorist. Given that they had hung more than 100 nobles as they traveled through the Andinaq Kingdom, they had long lost all respect they had for nobility. Since Baron Silas was considered to be a subordinate of Duke Madras, he was considered to be an enemy and Yuriy and Loze didn't have the slightest reservation about sending him to the gallows.</p><br/><p>\"Whatever... Get him down from there and bury him. Since we knew each other, it wouldn't be right to leave him hanging so unsightly like that.\"</p><br/><p>\"Yes, milord.\"</p><br/><p>After another ten days, Loze, Terman and Pete returned. It was already their third expropriation run and they had long taken whatever they could from the nearby territories. So, they had to venture further this time around and brought back around 1000 huge carriages as well as more than 100 goat skin rafts and tens of small fishing boats along with 200 or so resource-filled carriages. These were all the loot they obtained from wiping out three noble families that dared to resist.</p><br/><p>Lorist noticed that the rafts and boats they got as well as the ones the work smiths constructed were sufficient for six floating bridges, so he stopped the passionate Loze and gang from any further expropriation attempts. He also allocated more carriages to Charade so that he could increase the rate of sending the rest of the people to the other side while also letting the soldiers rest for two days. After that, they only had to make the wooden planks to quicken the construction of the floating bridge.</p><br/><p>On the 18th day of the 3rd month, Yuriy rushed to the port and told Lorist something surprising. On the 12th day of the 3rd month, the king of the Iblia Kingdom, also known as the Second Prince of the former empire, Krissen Iblia, proclaimed that on the grounds of sending reinforcements to the Madras Duchy to defend them from the Andinaq Kingdom's invasion, he would send his 70000-strong force to attack the Andinaq Kingdom's forces through the land of the Madras Duchy.</p><br/><p>This time, the Second Prince borrowed three armies from his father-in-law, Duke Fisablen. Combined with his own garrison army as well as the subordinate nobles' soldiers, he managed to rally up 70000 men and led them into the Delamock Province.</p><br/><p>\"Sol, where did he get so much food to sustain an army like that? Aren't they only beginning to harvest the winter wheat?\" Lorist asked curiously, before he came to an instant realization. \"Darn! They're getting more cunning one after another! He's planning to rob the food of his enemies' forces to sustain his own army!\"</p><br/><p>However, Lorist wasn't too concerned about the Second Prince's army because the construction of the five floating bridges had already been completed with the 6th already in the works. The convoy members and the vagabonds that were still on their way no longer had to wait and could cross over to the camp on the opposite bank to rest right away.</p><br/><p>The only thing that troubled Lorist was the 60 million kilograms of food. If each four-wheeled carriage carried 1000 kilograms of food, then 10000 of those carriages could only transport 10 million kilograms of food each round, meaning that they had to make six trips to and fro the river to completely ship everything to the other side.</p><br/><p>Lorist called for Potterfang and had him lead the heavy-armored infantry soldiers to the opposite bank first so that they could guard the camp over there. As the people and supplies they had increased, it was already beyond the ability of Terman's knight brigade and one company of light cavalry scouts to maintain security over there.</p><br/><p>Potterfang however expressed his worries on how he wouldn't be able to defend against the Second Prince's forces' attacks after he moved the heavy-armored infantry to the other side of the river.</p><br/><p>Lorist merely laughed out loud and said that there was currently no need to worry about the Second Prince's forces as the Second Prince was planning to get more food to sustain his own army, so there's no way he would be able to catch up to the convoy at the river so quickly. Even if he did send some forces over, it would only be a small squad at most. With Loze's three regiments of heavy-armored cavalry guarding the place, the small group of cavalrymen the Second Prince would hypothetically send posed no threat whatsoever.</p><br/><p>\"Also, when you cross the river, conquer the town on that side as well. Get that viscount... Erm, what was he called again... Something-wof... Well, just hang him in front of his town,\" instructed Lorist.</p><br/><p>\"If I may ask, milord, why? It's just a shabby old town,\" Potterfang said curiously. Ever since the convoy arrived and started building the floating bridges and transported their supplies across, the people of that town merely stayed cooped up within without even bothering to send someone over to ask about the situation, causing Terman's knight brigade to not even bother to go check that town out.</p><br/><p>\"The messengers you guys sent from the convoy were accused of being bandits and most of them were killed by the garrison soldiers of that town with only five of the messengers managing to escape. Back when I crossed the river to seek out the convoy the last time, I've already hung the garrison soldiers that were collecting toll at the customs point nearby. Today, I feel like pulling out the roots of that damned place once and for all,\" Lorist explained.</p><br/><p>\"Your will is my command, milord.\"</p><br/><p>The moment Potterfang and his troops crossed over to the other side, they launched into a full-on charge and managed to conquer the town without a single casualty. After half an hour, Potterfang grabbed a horse and rushed back without delay.</p><br/><p>\"Milord, that shabby town didn't have many people there at all. I heard that Viscount Darwof brought the men of his town to join up with Duke Loggins's forces to attack the Norton Family... I believe that transpired more than a month ago...\"</p><br/><p>\"What did you say?\" Lorist was so shocked by the news he almost jumped in response. Was the duke unable to accept his loss? Did he start plotting against us again?</p><br/><p>\"Order Yuriy to mobilize the light cavalry scouts to gather some information about the situation within the Northlands. Also, have Jim bring a squad of men there to check out on the family dominion. Since he used to be a mercenary, he should be rather well-versed with the terrain of the Northlands. Patt, you should follow him there as well,\" said Lorist as he calmed down and realized that there wasn't a need to be so disturbed at all.</p><br/><p>Lorist himself understood how well-defended the Firmrock Castle was. Additionally, with Divine Marksman Josk guarding the place, he felt that he didn't have to worry much about their safety. Additionally, the route heading towards the middle of the dominion that the duke's men used previously had already been destroyed, so there was no way for them to attack the Norton Family dominion without first going through Firmrock Castle. Is the duke seriously going to challenge Firmrock Castle with the farmer soldiers of his junior nobles? Hehe, what a joke...</p><br/><p>Lorist felt that he should first get a better understanding of the situation and come to a decision when the rest of the people and supplies get sent over to the other side. I definitely have to give that dogshit of a duke a serious slap in the face. For him to dare to provoke me again... Does he think that I would only defend without taking the initiative to attack?</p><br/><p>This time, Charade employed the same method he used to send the people from Vanades City to Kobo City. He set up multiple convoy camps spread out 50 kilometers from each other along the route to Metropoulos River from Kobo City that acted as interchange stations and the carriages only had to travel to and fro between their stations to transport the people and resources to the next stop. Before long, they were able to begin crossing the river right away.</p><br/><p>On the 3rd day of the 4th month, the light cavalry scouts sent to check out on the Second Prince's troops had returned with the news that the Second Prince's forces were busy harvesting the winter wheat while suppressing the resistance of the nobles within Delamock Province. So far, only a fraction of the nobles in that province still survived. Most others had already been hanged by the Second Prince on the basis of collaborating with the Andinaq Kingdom and refusing to send reinforcements to aid Duke Madras's ally, the Second Prince himself.</p><br/><p>On the 5th day of the 4th month of Year 1768 of the Grindian calendar, Lorist himself was one of the last people to cross the river and he ordered for the six floating bridges to be destroyed. Thus, the convoy and the vagabonds finally made their way to the Northern Highlands.</p><br/>\n</div>"}