{"title": "Chapter 187 Development Plans", "id": 187, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-187-development-plans", "volume_title": "Volume 2", "body": "<h1>Chapter 187 Development Plans</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Development Plans</p><br/><p>Show TL Note</p><br/><p>And here's the second regular chapter of the week! Enjoy the read!</p><br/><p>\"Milord, I have a question...\" said Supervisor Hansk who was the head of the allocation department as he stood up. \"If we were to build a 10 plus kilometer wall and another embankment that stretches around 50 kilometers, as well as build a port and clear out the magical beasts within the part of the Blackmud Marsh near our dominion, this will be a huge undertaking and will definitely span a long time. How much manpower and resources does the family plan to invest and where would we get all these resources?\"</p><br/><p>Lorist nodded towards Supervisor Hansk before pointing the wooden stick to the map of Blackmud Marsh. \"I have come up with this plan with the future of the family in mind. To realize this plan, we will have to rely on everyone's efforts. Not only that, this plan will even affect the prosperity of the family for the coming hundreds of years. Once we achieve it, our family dominion will no longer merely be in a rural corner of the Northlands and will be the main cornerstone for humanity's venture into the wildlands and unknowns.</p><br/><p>\"This plan to build a port will definitely have a long term effect on the family's development. As for manpower and resource allocation, the family is definitely committed to it. We will support this venture with all we can regardless of the cost. No matter how long it takes, we have to complete this venture. Now, may I have Grandmaster Ciroba and Mister Zanben stand up for a bit...\"</p><br/><p>At the back of the hall, Grandmaster Ciroba and the slightly tanned Zanben both stood up.</p><br/><p>Telesti had gotten two maidservants to take care of the grandmaster perhaps due to her pity for his experiences. Because of that, Grandmaster Ciroba looked rather well and no longer shivered in absolute terror when he saw Lorist like before. Even though he still seemed a little stiff, it was quite commendable of him to be able to retain his calm when faced with the many curious stares of others within the hall.</p><br/><p>As for Zanben, the former talented slave laborer among the 2000 plus laborers bought by the Kenmays Family that was promoted by Telesti, he had already gained Lorist's trust after his involvement with the construction of the defense infrastructures of the many towns and villages within Felicitas Settlement. That was why he was allowed to attend the family meeting along with Grandmaster Ciroba. But because it was his first time, he felt a little unnerved being the center of attention.</p><br/><p>\"I must first thank Grandmaster Ciroba and Mister Zanben for their efforts of surveying the land from Blackmud Marsh all the way to the bay at Bladedge Mountains which took up to half a year. Even though they have experienced some potentially life-threatening experiences, their efforts still resulted in the culmination of the method and procedures of this development plan.</p><br/><p>\"From today onwards, I intend to form a construction department headed by Grandmaster Ciroba with Mister Zanben as his aide to manage this huge project of constructing the sea port. The other departments of the family shall aid and cooperate with them in all construction-related matters,\" Lorist said as he waved his hand to gesture for Grandmaster Ciroba and Zanben to sit back down. Since they were already introduced to the others within the hall, there was no longer a need for them to remain standing.</p><br/><p>Lorist once again pointed to the map with the stick and said, \"For the next five years, we will work on gaining control of this part of the Blackmud Marsh to set up the foundation for the plan. There will be three main components which we will have to focus on. The first component is the completion of the initial stages of construction for the citadel at Hidebull Mound as well as the foundations of the 20-kilometer wall from Tortoise Hill. The surrounding area of Tortoise Hill will be cleansed and a defense camp will be set up there.</p><br/><p>\"The second component is to build a path from the middle of the Blackmud Marsh connecting it to the Highlands over here.</p><br/><p>\"The third component concerns the Bladedge Mountains. We will start collecting rocks and earth here to fill up the gullies and the swamp around the parts from Bladedge Mountains to the place where the Azure River meets the ocean. By filling up the reefs and connecting them to the bay, that place will be able to serve as the departure point for the ships of our family.\"</p><br/><p>Lorist then shook his head and laughed bitterly before he said, \"There is no doubt that this undertaking will cost us lots of manpower and resources. However, as long as we take this first step and continue down the journey, there will be a day when we complete it. No matter whether it will take 10 or even 20 years, we must definitely achieve that milestone! As long as we have this port, we will definitely have a bright future ahead of us!</p><br/><p>\"Old Man Balk, your task this year will be really important. Not only do you have to gather up the carpenters who have experience building ships to begin research and development into constructing large sea vessels, you also have to head to the Black Forests to find some wood that will be suitable material for those ships and have them dried in the shade. The moment we connect the Bladedge Mountains and the sea port with the highland hills, you will have to find a suitable spot to build a shipyard. I hope that by next year, we will be able to use the bay to begin training our sailors and navy troops.\"</p><br/><p>Balk stood up and said confidently, \"Please be assured, milord. I will definitely complete this task. It is also my earnest wish to one day see the magnificent sight of the ships flying the Norton flag being sent out to sea...\"</p><br/><p>Lorist laughed out loud said, \"Things occur because people act. That day will definitely come. As long as we put in effort, there is no unachievable goal.\"</p><br/><p>Lorist turned his attention back to the map and said, \"As for the future plans of the family, I'm sure that all of you are aware of the three components I've just mentioned. As for our security during the development process, I will have the carroballista brigade be the main force to defend us from the Ironspine Crocodiles in the marsh. I will also have all the Silver ranked swordsmen and knights form smaller groups to escort the carroballista brigade when they travel.</p><br/><p>\"Since the roads within Felicitas Settlement are almost completely built, I will use the 30000 plus laborers there as manpower for the three main components of the plan. Apart from some of them whom I will assign to help out with the mining efforts, the rest of them will all be sent to the Blackmud Marsh.\"</p><br/><p>\"Wait, milord, you seem to have forgotten a key point,\" said the human resource department head, Supervisor Kedan, as he stood up.</p><br/><p>\"What's wrong?\" Lorist asked.</p><br/><p>\"Milord, some time back, you have promised the laborers that you would free them after three years of labor. And that term will end by the 5th month of this year. We will have no choice but to let them go,\" Kedan reminded.</p><br/><p>\"Ugh...\" Lorist said as he facepalmed. \"I apologize, I have indeed forgotten about that. Thank you for your reminder. That means that they only have two months of service left?\"</p><br/><p>\"Yes, milord. Should we extend their term by one year?\" Kedan suggested.</p><br/><p>\"There's no need. We must definitely not go back on our word. This is a matter that concerns the reputation and prestige of our family and we cannot treat it lightly. For now, have the laborers finalize the construction of the roads at Felicitas Settlement and carry out the final touches. After that, let them take a break,\" Lorist said.</p><br/><p>\"However, milord, some laborers already have their family members moved into the dominion by us, and a good number of them have decided to remain within the dominion and also hope that they can bring their families here. Others who have awakened their Battle Force also want to join our family forces,\" Kedan said.</p><br/><p>\"Hmmm, then let those who want to remain do so. You will be in charge of registering the family members of the laborers who have decided to stay that come into the dominion. Now that the Felicitas Settlement has a stable foundation, let's allocate some farmland and houses to these laborers and treat them no different than we would our own citizens. Help those with other skills find jobs as well and we can also offer loans to those who wish to start their own production workshops. Remember, don't look down on them just because they have been our prisoners, okay?\" Lorist reminded as he made his decision.</p><br/><p>\"Milord, what about those who want to join the family forces?\"</p><br/><p>\"Take them in as long as they satisfy the Battle Force requirements. The Iron ranked ones can first be accepted into the new recruit camp for three months of training before being assigned to more specialized units according to their individual skills.\"</p><br/><p>\"Milord, I was just about to report to you that from last year to now, the new recruit camp has produced around 5000 soldiers with awakened Battle Force apart from those who were disqualified because they couldn't keep up. All of them are eager to be enlisted into our official forces,\" Belnick said as he stood up.</p><br/><p>Even though Lorist specified that the formal soldiers of the family had to have at least Iron ranked Battle Force, 75 percent of the 16 brigades of the family don't meet that requirement with most of them still being at the Bronze rank. That's why he had no choice but to have the respective leaders of the brigades organize regular training sessions every day so that they rise up to the Iron rank as soon as possible.</p><br/><p>When the family forces were first reorganized, there were around 10000 youths around the ages of 20 who have been removed from the forces because they didn't meet the minimum Battle Force requirement. They were subsequently sent to train within the new recruit camp. Surprisingly, many of them awakened their Battle Force within a short half year.</p><br/><p>After some consideration, Lorist felt that there wouldn't be a point for those soldiers to remain within the new recruit camp and decided that it would be better for them to be assigned to other units.</p><br/><p>\"How about this,\" Lorist said. \"Since the carroballista brigades will play a huge role in the development of Blackmud Marsh, we will expand it by two more brigades into a total of 5 with a soldier count of around 15000 men, essentially making it a complete division. Gold ranked knight Mons Malek, you shall pass on your duties on managing the patrol companies of the seven central towns of Felicitas Settlement and take up the position as commander of the carroballista division with Dulles as your second in command.\"</p><br/><p>The emotionless Malek stood up and said, \"Yes, milord.\"</p><br/><p>Dulles also stood up at the same time. He understood that his Battle Force was still at the Three Star Silver rank and he also had some trouble controlling and disciplining some experienced soldiers within the three brigades he commanded. Given that complaints of discontent were already floating around among his troops, there was no way that he would be able to shoulder the burden of the two additional brigades. The reason Lorist appointed Iron-faced Malek to become the commander of the new division was probably because he had heard of such troubles and decided to reinforce the discipline of that unit.</p><br/><p>That was why Dulles didn't feel at all discouraged by Lorist's decision. In fact, he was even a little thankful. \"Milord, I will definitely help Knight Malek to the best of my ability in the management of the carroballista division.\"</p><br/><p>Lorist nodded and said, \"It is one of the main forces of the family troops and I have high hopes for you all.\"</p><br/><p>\"It is in safe hands, milord,\" Malek and Dulles said as they saluted.</p><br/><p>Lorist then turned to Belnick and said, \"If the number of laborers who want to join the army is enough for two brigades, make one brigade of armored pike cavalrymen and another brigade of heavy-armored infantry soldiers. However, make sure that they receive the basic three month training and understand the regulations of our army well before assigning them to their respective units.\"</p><br/><p>\"Understood, milord,\" Belnick responded.</p><br/><p>Potterfang and Loze also stood up and said, \"Thank you, milord.\"</p><br/><p>\"The two of you will have to work hard too. Pick a few experienced soldiers from your troops and have them serve as instructors in the new recruit camp to help Knight Belnick with training the fresh recruits. Pog, I am especially satisfied with the attack formation you devised with small teams of ten. However, you still have to practice and improve upon any weaknesses you may find.\"</p><br/><p>\"Yes, milord. I will work hard on it,\" Potterfang replied.</p><br/><p>\"Alright. Back to the main topic. Since we're no longer able to utilize the manpower of the 30000 prisoners, we will have to turn to our own people. I hereby order that our family forces who are off-duty to work in shifts of three months to develop the Blackmud Marsh. Whether they be of the main family forces or the local garrison forces, they have to participate in this endeavor. The garrison of each village and central town will have to take turns to work there. Naturally, the soldiers of the main family force will have to serve too as this concerns the future of the whole dominion,\" Lorist said.</p><br/><p>\"But, milord, why don't we just recruit laborers from the citizens of Felicitas Settlement? It won't be hard to find 100000 free laborers from our 500000 citizens. They'll work as long as we feed them well,\" Terman said as he felt that letting his knights work as measly laborers was extremely demeaning.</p><br/><p>Lorist's expression turned sour right away. He gave everyone within the hall a look before turning his attention back to Terman. \"I hope that all of you can understand a simple principle. The forces of the Norton Family is not a tool we use to oppress our citizens, nor are they superior to those citizens who are not enlisted in our forces. Instead, they are their protectors. They should be the ones whom the citizens of our dominion place their trust in as well as the ones who pave the way for the development of the future of the dominion. Additionally, they are the most reliable force available to the dominion lord who are willing to even climb mountains of blades and enter seas of fire to achieve the lord's goals. In other words, they are the most resilient executors of the lord's will.</p><br/><p>\"Now, do you still honestly think that serving the family by contributing to the construction work is an insult to your personage? My hope is that everyone within the dominion, no matter they be family knights or family soldiers, will become the constructors of our own home so that tens of years later in the future, you all can be proud of the prosperous cities and rich farmlands and stand tall when you tell your children and grandchildren that it was you who had turned the wastelands into the grand spectacle they see before them. It was you, who have put in your efforts in turning the Blackmud Marsh into the haven they live in.</p><br/><p>\"As your dominion lord, I will also accompany you and work alongside you at the development site itself just like any common soldier so that I can make my own contributions to the family's future.\"</p><br/><p>\"Milord, you don't have to say anything else. It was my mistake. I will definitely strive towards becoming one of the constructors of the dominion's future myself,\" Terman said as he sat back down in shame.</p><br/><p>\"In actuality, you're not entirely wrong, Terman. I have no doubt that many others will have the same opinion you did and question why I don't just use the citizens as my workforce instead,\" Lorist said with a solemn voice. \"It's not that I didn't think about it. However, the citizens of Felicitas Settlement has just managed to settle down and wouldn't be able to handle the additional burdens this project will place on them. We, the Norton Family, can't just make decisions based on what we see now. I'm sure you all know that since the magical beast wave is eliminated, we must proceed to develop farmland at the settlement to be able to sustain the food consumption of the dominion.</p><br/><p>\"Starting from next year, we will start collecting taxes from the citizens that settled there. That's why, we must also work harder to ensure that they can begin their peaceful new lives here without a hitch. Apart from criminals and prisoners of war, the Norton Family will not use our own citizens as free laborers. While we can offer to pay them to work on the construction when most of the farming is done, we will definitely not force them to work as unpaid laborers so that they don't feel like second class citizens of the dominion. That is a small insistence of mine as the dominion lord.\"</p><br/><p>The hall quieted down before erupting into a torrent of applause.</p><br/><p>\"Milord, we are grateful for your benevolent intentions,\" said the family knights of common birth like Potterfang as they stood up and saluted Lorist in unison.</p><br/><p>\"Alright, now that the general direction of progression for the family's development has been decided, let me brief you all on the specifics. There will be an administrative department formed for each central town of the seven sectors of Felicitas Settlement. These departments will collectively form the administrative institution of the family dominion which will be led by Knight Charade with Butler Boris as the vice head. Other than the seven central towns, the Maplewoods Bastide and the rear city at Firmrock Castle will also fall under the jurisdiction of the administrative institution.</p><br/><p>\"Mister Camorra, please stand up,\" Lorist said.</p><br/><p>The current vice head of the human resources department, formerly known as Baron Camorra, stood up.</p><br/><p>\"I hereby appoint Mister Camorra as the main supervisor of the military resources department. From today onwards, the management of the military provisions will be done separately from that of the citizens. The military resources department will be in charge of the allocation of weapons and equipment, food and other consumables as well as the benefits and salaries of our family soldiers. As you all know, Grandmaster Sid has just developed a set of metal armor that is far superior to that of the Whitelion Legion. Therefore, Mister Camorra's first assignment will be handling the replacement of the Whitelion Legion equipment of the family forces with the new armor across the various brigades of our forces. I hope everyone will be patient as well, your turn will definitely come,\" Lorist said as he laughed.</p><br/><p>\"Alright, meeting adjourned. The various department heads and brigade leaders will have to stay back for a little longer. The rest of you may rest today and tomorrow and we will set out to the Blackmud Marsh the day after. Let's all put in our fair share of work as one into the development of the dominion for the prosperity of the family.\"</p><br/><p>\"Yes, milord!\"</p><br/>\n</div>"}