{"title": "Chapter 182 Military Reorganization", "id": 182, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-182-military-reorganization", "volume_title": "Volume 2", "body": "<h1>Chapter 182 Military Reorganization</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Military Reorganization</p><br/><p>Here's the first regular chapter of the week, enjoy!</p><br/><p>Lorist said, \"As long as we come up with adequate countermeasures, the magical beast wave will no longer pose a threat to us.\"</p><br/><p>\"I think that the magical beast wave brings some advantages to us too. At the very least, they provide lots of fresh meat. Burp. Apologies, I've had a little too much mutton,\" said Potterfang.</p><br/><p>\"I want some vegetables... Even potatoes would do... Don't feed me any more beef... I've been eating beef and drinking beef soup for two whole months now and I already feel like puking the moment I smell it,\" Els complained.</p><br/><p>\"I agree with Els, I want some potatoes too,\" Patt said.</p><br/><p>\"Haha, the magical beasts didn't even stand a chance against the carroballista division!\" exclaimed Dulles excitedly.</p><br/><p>Josk said, \"I think that the ballista milord designed changed our situation entirely. We wouldn't have been able to defeat the beasts with only courage and passion and no good equipment.\"</p><br/><p>\"The creation of the steel ballistas did in fact prepare us well for the coming of the magical beast wave. This truly is a mighty revolution in the field of ballistics. After that, we will start working on more improvements on the current ballistas. Our goals for now are to increase the firing distance, firing rate, accuracy, and strength of the shots,\" said Grandmaster Fellin.</p><br/><p>\"I suggest that the ones who contributed a lot to the resistance against the beasts be rewarded 50 kilograms of magical bull meat. What do you guys think?\" Charade said.</p><br/><p>\"The quality of the skin of the bulls are great for making leather products as long as we dry and preserve them well. The skins of lower quality can also be made into beastskins. Additionally, the meat can be dried and preserved or made into sausages. As for the bones, we can use them as soup stock and even burn them to ash to be used as fertilizer. We must use all we can with as little wastage as possible. However, it definitely will be a little hard to clear up so many bull carcasses. Milord, can you please send a few thousand more family soldiers to help out? It's not possible for the current workforce of over 10000 men to deal with all those carcasses within a month...\"</p><br/><p>Due to the sheer amount of beasts they had killed, Lorist mobilized near 100000 men within the dominion and managed to take care of the matters before the 5th month.</p><br/><p>......</p><br/><p>On the 10th day of the 5th month, Lorist organized the first meeting of the year at Firmrock Castle with the family knights and officers of the dominion. Like the previous year, Charade was in charge of giving a summarized report about the happenings within the dominion.</p><br/><p>\"The magical beast wave that came during the winter brought us countless amounts of furs and leather as well as near 15 million kilograms of bull and goat meat. It can be said that the dominion will no longer have any problems with food for the next three years. The most encouraging piece of news is still the fact that the magical beasts will no longer pose any threat to us and will instead be an opportunity for us to gain big hauls.\"</p><br/><p>Everyone applauded as they regained the hope of settling down in a harsh and desolate place like the Northlands based on the harvests and hauls in recent times.</p><br/><p>\"After enduring a year of hardship, the construction of the defensive facilities at the towns and villages of Felicitas Settlement is finally completed. That's one of the main reasons we were able to survive the magical beast wave. This year, our focus will be on building more roads to make the villages and central towns more interconnected as well as building proper residences so that the people at the settlement can live within warm and safe homes. Not only is this the promise of our lord, it is also his way of rewarding the hard-working citizens who had accompanied the convoy to the dominion despite the things we suffered on the way.</p><br/><p>\"Other than that, we will also form several departments for the seven sectors of Felicitas Settlement. Each department will have to maintain and improve the living standards of the sector they are put in charge of and contribute to the family in the coming year.</p><br/><p>\"Even though last year was a tough year, it was also a plentiful one. The factories and workshops set up within the dominion has also made us self-sufficient. I believe that the Norton Family's future will shine under milord's leadership!\"</p><br/><p>The room once again erupted with applause, ending the meeting on a grand note.</p><br/><p>After the meeting, Lorist had six Gold ranked knights and Charade, Yuriy, Terman and a few other knights stay back for another meeting focused on military reorganization matters.</p><br/><p>The military distribution of the various powers on Grindia were mainly organized as armies. Each army would have multiple divisions with each division containing a few regiments. A regiment on the other hand would contain a few companies which in turn was made out of a few squads. The various units would also be classified according to the types of soldiers within, such as a longbow regiment, a heavy-armored company and a pike infantry squad, etc.</p><br/><p>A squad usually consisted of 80 to 150 people and the squad leader was the most basic commanding officer who was aided by a few vice squad leaders who would each be put in charge of tens of other soldiers.</p><br/><p>Lorist was quite dissatisfied with this arrangement as whenever a squad leader and his aides fell on the battlefield, the whole squad would fall into disorder. However, Lorist did not want to overhaul the organization completely and instead divide each squad into smaller teams.</p><br/><p>As a solution to that, Lorist devised a new, more discrete organizational structure with ten people for one squad of mixed types of soldiers unlike the former structure which had soldiers of the same training and equipment in the same unit. Each squad would have sword and shield infantry, pikemen and longbowmen so they can better adapt during times of battle.</p><br/><p>Lorist hoped that his troops would one day be able to form the 'mandarin duck formation' of the 'Qi Family Troops' he had heard of from his previous life. Even though he wasn't too well-versed in the military tactics of old and didn't understand the specifics, he felt that he could slowly experiment around with trial and error until he found the perfect balance. In the era of cold arms, only with coordination and tactics can a unit be effective in combat as well as survive the chaotic situation of the battlefield.</p><br/><p>Potterfang and the other family knights on the other hand felt that Lorist was trying to incorporate the tactics of smaller mercenary groups into the family forces, which was not a completely foreign thing to them. It was a known fact that a small group of elite mercenaries were more effective and versatile than huge numbers of family soldiers.</p><br/><p>Above the newly-revamped squads of ten men were companies. Each company would include ten squads, totaling at a member count of 100. Five companies would form a battalion of 500 men and five combat battalions and one logistics battalion would form a brigade of 3000 men. Lorist made it so that a brigade would be a singular, full-functioning unit capable of acting independently.</p><br/><p>WIth the aim of completely reorganizing the military of the family, Lorist first disbanded the three garrison divisions. Each of the 80 plus villages within Felicitas Settlement would have a company of garrison soldiers of 100 men formed and each of the central towns of the seven sectors in addition to the industrial city at Bladedge Mountains would have a garrison battalion of 500 men stationed there. Similarly, Maplewoods Bastide and Firmrock Castle each had a battalion of 500 garrison troops stationed there.</p><br/><p>These garrison troops were mainly responsible for the security and stability of the towns and the areas surrounding it. The task of restructuring the garrison force was handed to Gold ranked knight Freiyar to be completed within the year.</p><br/><p>Lorist then ordered Gold ranked knight Malek to form a patrol company of 100 men at each town that will be responsible for solving civil disputes, maintaining order as well as hygiene of the towns. The members of these patrol companies would be picked from the ranks of the retired family soldiers and the disbanded garrison troops.</p><br/><p>Following that, Lorist turned his 'scalpel of reorganization' to Potterfang and Loze's heavy-armored division and requested them to reform their organizational structure into 2 brigades, each numbering 3000 men. The ones to be picked for the brigades must be of Iron ranked Battle Force at the very least ranging from the age of 20 to 25. As for the officers, they can be as old as 35. Lorist stressed that he didn't want to focus on quantity but rather quality.</p><br/><p>Dulles's carroballista division was also restructured by Lorist into three brigades of 9000 men. The steel ballistas had replaced the longbow troops as the main ranged attacking force of the family and Lorist didn't intend to change that.</p><br/><p>Yuriy's three regiments of light cavalry scouts was changed into a brigade of 3000 men. Apart from the ones who were disqualified based on their age or Battle Force rank, the men who were not included into the light cavalry scouts brigade formed companies of 100 men and were absorbed into the logistics battalions of various other brigades. Lorist felt that every logistics battalion should have one light cavalry scout company, one heavy-armored infantry company, one logistics company as well as two cargo guard companies. Only by having 500 men supporting the main force of 2500 men within a brigade could it function independently.</p><br/><p>Josk's mounted archer unit however wasn't affected by the changes. Lorist was already working with Grandmaster Fellin to work on a new riding bow that would eventually replace the longbows used by the mounted archers. Even so, the prototypes so far still weren't able to emulate the strength of the longbow. It was apparent that a proper replacement would only come at a later date.</p><br/><p>Terman's knight brigade wasn't touched either, but Lorist still had it reorganized into a brigade of 3000 men according to his new standards, causing Terman to have to recruit a few hundred others to fill in the extra vacancies.</p><br/><p>The guard division led by Els on the other hand underwent a huge overhaul. Originally, the division numbered around 5000 soldiers and their duties, according to Els, were all over the place. Some were in charge of escorting the convoy, others were guarding the mines and factories with some even monitoring the laborers. Additionally, Lorist's personal guard was also part of Els's guard division. They were basically something like duct tape, which was used to patch up all sorts of smaller problems.</p><br/><p>The guard division was split into two in the end and the first would cease all their activities and only answer to Lorist and Els's orders. The newly-formed guard brigade would take over the duties of securing the warehouses, refineries and other jobs. Lorist also planned to have the other soldiers who were removed from their respective units as a result of the reorganization to join together and form a second guard brigade which would be in charge of monitoring the 30000 plus laborers.</p><br/><p>Apart from that, the former-bandit Ovidis's defense company was revamped into the first local defense brigade that would defend Firmrock Castle. Knight Pajik on the other hand was tasked with forming the second local defense brigade to defend Maplewoods Bastide.</p><br/><p>Pointing at the map, Lorist said that he wanted to build a new citadel at Hidebull Mound where the mounted archers were stationed so that the two other citadels at the border of the dominion and the Magical Dragon Mountains could be better provided with support. Additionally, it was a strategic location with the river valley and two citadels to its east, the Blackmud Marsh to its north, and the Poplar Coast to its west. As long as Hidebull Mound could be occupied, even if the two mountain citadels were to be taken over, the barbarians still wouldn't be able to launch an attack on the dominion. Also, the magical beast wave had to pass through that area, meaning that attacks could be launched from there if their numbers were small to wipe them out before they even set foot into the Felicitas Settlement.</p><br/><p>While the family did plan to build a citadel at that location, it lacked the manpower and funds at that time and was also bogged down by the troublesome folk of Wildnorth Town. The citadel constructed at Hidebull Mound had to be huge; small ones wouldn't be that reliable and sufficient for the purposes of the family. Now that the family had stable foundations and additional resources, the project could be realized and Knight Pajik's second local defense brigade would be able to guard it to ensure the safety of the family dominion.</p><br/><p>Finally came Pesha's female garrison unit. They performed exceedingly well during the past two magical beast extermination operations at Felicitas Settlement. Lorist allowed Pesha to expand her unit to 3000 women but also requested her to have her subordinates be well-versed in first aid and medicinal skills so that they can also play the role of a medic unit on the battlefield.</p><br/><p>As for the medic squad of the northbound convoy, Lorist disbanded it and tasked Lundmorde to set up medical centers within the various towns and distribute the medics around to manage the centers and tend to the sick and injured.</p><br/><p>Lundmorde himself was given two choices. Either he takes up his post as the manager of the medical center at Firmrock Castle or he becomes a medical instructor for the female unit.</p><br/><p>Needless to say, Lundmorde happily chose the latter went to report to Pesha for his new post.</p><br/><p>Potterfang asked, \"Milord, since our forces will mainly be using brigades as the largest unit, we won't have legions and divisions in the future, right?\"</p><br/><p>Lorist laughed out and said, \"How can that be? So far, the military trend right now is for legions to be formed. Even the Kenmays Family formed a legion of 30000 soldiers, not to mention the Second Prince's Iblia Kingdom's First Legion that he recently formed with around 56000 soldiers. My plan is for five brigades of 15000 men be put under a division, with five divisions of 75000 men forming a legion. So far, the point of the reorganization is to cement this new structure into our forces so that future expansions will be much more convenient.\"</p><br/><p>\"I see, so that is what you have planned. I understand now. I will definitely train an elite troop of soldiers for the family according to your orders, so please rest assured,\" Potterfang said.</p><br/><p>\"But milord, why didn't you give me any tasks?\" Belnick asked as he stood up.</p><br/><p>\"Calm down, I was just going to get to that,\" Lorist said as he waved his hand. \"I plan to set up a new recruit brigade at Maplewoods Bastide for those aged between 20 to 25 with Battle Force beneath the Iron rank. There, they will continue to train until they meet the conditions to join the other units of our forces. In the future, we no longer have to recruit soldiers from our citizens. The men we need can be sourced from this brigade.</p><br/><p>\"Other than that, every male citizen below the age of 18 will be required to join the recruit brigade to accept training to awaken their Battle Force. This will be optional for female citizens of the same age range. Each course will last three months and those who haven't awakened their Battle Force can attend these courses three times in succession. In the future, the candidates for recruitment will be chosen from these people who pass the course. The main force of the family will be required to have at least Iron ranked Battle Force with the garrison troops having the Bronze rank as the base requirement. When we have enough soldiers in each unit, we can begin expanding. I will leave this recruit brigade for you to manage, Brother Beck.\"</p><br/><p>\"Yes, milord,\" Belnick said as he saluted.</p><br/><p>......</p><br/><p>Not including the garrison troops of the villages and towns, the family forces had a total of 16 brigades with almost 50000 troops in total. To Lorist, that was only barely satisfactory with the ratio of soldiers to citizens at around 1 to 10, and even then, that ratio was obtained by including the garrison and patrol troops as part of the family forces. Even if Lorist disregarded those two units, the family still had to spend quite a bit on the salary of those soldiers.</p><br/><p>While the northbound convoy didn't do much trade on its journey to the Northlands, it was fortunate that they did quite a bit of pillaging, garnering the family up to 3 million gold Fordes in wealth. Given that the equipment of the Whitelion Legion were given to him, Lorist was still able to sustain the current family force.</p><br/><p>Now that the various industrial activities within the dominion was owned by the family, it wasn't too hard for Lorist to offer special bonuses to the family soldiers either.</p><br/><p>By the time he finished drafting the regulations of the family forces with Charade and the others, it was already near the end of the 6th month. Just when Lorist was about to set out to Maplewoods Bastide for two months of vacation to spend some time with his son, Count Kenmays came to visit.</p><br/><p>The reason for the count's visit was to fulfill the agreement they signed the last time. Not only did the count ship away the 33000 sets of metal armor from Firmrock Castle, he also struck a bargain and bought 200000 gold Fordes' worth of salt and 1 million kilograms of smoked magical bull meat from Charade.</p><br/><p>Charade was incredibly mad by the time the negotiations concluded as he understood that the count could sell the stuff he bought with 200000 gold Fordes for 600000 gold Fordes simply by reselling them to another party and marking up the price.</p><br/><p>However, Lorist felt that there was nothing they could do about it as the suspension bridge was controlled by the Kenmayses and there was no point in keeping the extra meat and salt stored up anyway. Since those were local products of the dominion, Lorist felt that it was a rather good source of revenue despite the slightly low price offered by the count.</p><br/><p>Charade on the other hand felt that they absolutely had to find a suitable place to build a port within the dominion as the furs they had could be sold at Morante City for a high price.</p><br/><p>Lorist agreed to that suggestion and made a mental note to continue to look into it more when he had more time.</p><br/>\n</div>"}