{"title": "Chapter 188 The Ultimatum", "id": 188, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-188-the-ultimatum", "volume_title": "Volume 2", "body": "<h1>Chapter 188 The Ultimatum</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Ultimatum</p><br/><p>Show TL Note</p><br/><p>Here's the first bonus chapter of the week thanks to the support of Thomas A. from the USA! Enjoy the read~</p><br/><p>Viscount Zinderson departed from Gildusk City on the 15th day of the 3rd month as the Second Prince's messenger. As the snow was still melting, the roads were muddy and hard to traverse and he arrived at Firmrock Castle by the 23rd day of that month. At that time, Lorist had already brought around 40000 of his forces to the Blackmud Marsh to begin gathering stones and earth in preparation for laying the foundations for roads to be built there.</p><br/><p>Charade, who was in charge of various miscellaneous tasks at Firmrock Castle, received Viscount Zinderson. Upon hearing that he had come as a messenger of the Second Prince, Charade asked him to rest for a few days so that he could contact Lorist and ask him to return.</p><br/><p>On the morning of the 25th day of the 3rd month, Lorist was standing before the carcass of an Ironspine Crocodile that was almost ten meters long and inspecting that beast's weakness. The crocodile's body was impaled with more than 30 iron ballista bolts and it was one of the largest they have encountered during the past few days. Even though it had sustained the strikes of more than 30 bolts, it still struggled intensely like a lively tiger and rushed towards the carroballista brigade with its fangs and claws bared.</p><br/><p>Had it not been for the good fortune which allowed one of those bolts to pierce through its tail and nail it on the ground almost 30 meters from the carroballista brigade, that reptile might have began a massacre at the defense lines of the brigade. It was not until the crocodile breathed its last breath that everyone let out a breath of relief.</p><br/><p>\"Milord, look. This Ironspine Crocodile died because of this bolt that pierced its lower jaw into its head. At that time, it was nailed to the ground at its tail but it was still rushing forward with all its might with its head raised, allowing us to fire a bolt to its underjaw. As for the 30 plus bolts on its body, even though they did injure the beast, they weren't fatal nor effective and only served to provoke it further. We were quite lucky this time around to have not lost any men to this ferocious beast,\" said Malek, who was the current commander of the carroballista division.</p><br/><p>\"During the past few days, we've killed around tens of those crocodiles and even the largest one was only 5 meters long and died from 5 ballista bolts. We were too careless and thought that those crocodiles were the worst the marsh could throw at us and that there was nothing to worry about. To think that an even larger one showed up... It seems that our steel ballistas won't be that effective against these larger ones. The bolts on its body seem like small toothpicks,\" Els described the situation imaginatively.</p><br/><p>\"Given the size of Blackmud Marsh, there might just be crocodiles that are even larger than this. Milord, even though this one is already around 2 meters tall, I've read in the family records that they can be as tall as 5 meters as well. I wonder how long would a crocodile of that height be... I heard they were essentially as large as a small mound,\" said Patt worryingly.</p><br/><p>Lorist nodded and said, \"That said, the development of the marsh must continue. We must best the obstacles no matter how large they may seem. However, I will be wary of your warnings as well. To be honest, even I didn't imagine that we would have so much trouble with the beasts given that we have our steel ballistas. Reidy, make a trip to Grandmaster Fellin's and ask him if he can construct an even larger steel ballista for use against these Ironspine Crocodiles. It doesn't have to adhere to the strict military standards of those used in the carroballista division, so it's fine if it takes more time to operate. I only need it to have at least twice the power.\"</p><br/><p>\"Yes, milord. I'll depart right now,\" Reidy said before he left.</p><br/><p>\"Alright. Malek, have someone deal with this carcass. Even though it looks ferocious and savage, its meat tastes pretty good, you know. Tell the rest that we're having crocodile meat today. Don't forget to keep the leather as well. This leather is the ideal material for the leather armor of our navy troops,\" Lorist instructed. \"Also, tell the others to pay attention to pay attention to their safety when they work later. It's okay for them to work at a slower pace. If the sky starts darkening, have them stop for the day lest they be ambushed by crocodiles.\"</p><br/><p>\"Alright, milord. I will caution them well,\" Malek replied.</p><br/><p>At that moment, Jim brought a few others over. He was currently a regiment leader of the guard division. \"MIlord, Knight Charade sent someone over to pass the message that Viscount Zinderson has come to visit again as the messenger of the Second Prince and he hopes that you can return to Firmrock Castle sooner.\"</p><br/><p>Huh? Lorist was a little shocked as he thought, what's the Second Prince up to again? Even though I've already refused him so many times, he still hasn't given up. Isn't he worried that I will once again refuse him this time around? I have no time for the silly games of nobles. How annoyingly persistent.</p><br/><p>After a pause, Lorist said, \"Have Viscount Zinderson stay there for a few more days. I will head there within two days.\"</p><br/><p>......</p><br/><p>\"My deepest apologies, Viscount Zinderson, for making you wait for long. I've really been far too busy with various matters.\"</p><br/><p>Lorist only made his way back to Firmrock Castle on the 28th day of the 3rd month. Without bothering to take a bath to wash off all the sweat and dust from traveling, he met with Viscount Zinderson right away.</p><br/><p>\"I suppose it's understandable. After all, your family must be busy fending off the magical beasts during the whole winter. To be honest with you, Baron Norton, I have seen the carcasses of the magical beasts back at Gildusk City and I truly express my deepest respects to your family's efforts. It's no wonder the Norton Family is also known as the Raging Bear of the Northlands. Only a family like yours can bear *Ryogawa: pun unintended* to resist the fierce assault of beasts like that,\" Viscount Zinderson praised.</p><br/><p>\"I appreciate your compliment. Might I enquire why you've made your visit?\" Lorist asked, not even bothering to put up with the pleasantries and going straight to the point.</p><br/><p>\"Oh. This time around, I have come on His Majesty's behalf to deliver a letter to you and inform him of your response. The letter is here with me and I believe he expressed his worries and concerns for your family's heroic battle against the magical beasts within it,\" Viscount Zinderson said as he passed the letter over.</p><br/><p>Lorist received the letter with a smile and said, \"Oh, isn't it a little too much to send a viscount like you all the way here for a small task like this? Couldn't he have sent a normal messenger? It's a little bit of overkill for His Majesty the King to send you here just to deliver a letter.\"</p><br/><p>Viscount Zinderson mocked himself in a joking manner and said, \"Oh, Lord Baron, you truly give me too much credit. I'm merely an honorary noble and not a landed noble like you. Also, I don't really have much on my plate, so doing various errands for the king is the least I can do.\"</p><br/><p>\"Lord Viscount, you're being far too humble,\" Lorist smiled before tearing the envelope open.</p><br/><p>Sol! This Second Prince must have gone crazy. There's definitely something wrong with that head of his!</p><br/><p>Even though Lorist felt like cursing out loud, since Viscount Zinderson was right in front of him, he had no choice but to resist the urge.</p><br/><p>The tone of the Second Prince in the letter was unlike the pleasant one within his previous letter. In fact, the Second Prince launched into three demands straight away.</p><br/><p>First, Lorist was to head to Gildusk City before the 5th month to meet the Second Prince to pledge his allegiance to him and present a fitting gift as a sign of respect.</p><br/><p>Second, the Norton Family must pay 500000 gold Fordes to the Second Prince as a punishment for the disrespect they have shown the Second Prince.</p><br/><p>Third, from that year onwards, the Norton Family must provide the Second Prince with 5 million kilograms of salt without any cost annualy.</p><br/><p>At the end of the letter, the Second Prince stated that he was already unable to bear the Norton Family's refusals to his numerous gestures of goodwill. He stressed that if the Norton Family refused these demands of his once more, he would form an allied noble army and march towards the Firmrock Castle. He warned Lorist that the fate of the Norton Family hung on his decision to accept the demands or not and advised him to choose wisely.</p><br/><p>Only a madman would dare to imagine that this would go his way. He must've received some kind of stimulation that prompted him to issue an ultimatum to the family like this. That letter was akin to a declaration of war as there was no way that Lorist would agree to those unreasonable terms. Where did that bastard gain his confidence from? His First Legion that has only been formed for one year? Hahaha...</p><br/><p>Lorist raised his head with a cold smile and asked, \"Lord Viscount, are you sure you want my reply to this?\"</p><br/><p>Viscount Zinderson nodded and said, \"Yes, His Majesty stressed that I must have a reply from you before I return.\"</p><br/><p>\"Alright, please wait a moment,\" Lorist said before he sat down on his desk and quickly drafted a response.</p><br/><p>\"Tarkel,\" Lorist said as he pulled onto the rope bell to summon Tarkel into the room.</p><br/><p>\"The Lord Viscount has traveled far and must've suffered quite a bit to get here. Go get a few magical beast furs and give it to him as a sign of our gratitude for his troubles,\" Lorist instructed.</p><br/><p>\"Yes, milord,\" Tarkel said before he left.</p><br/><p>Lorist handed the letter he wrote to Viscount Zinderson and said, \"Please forgive me, Viscount Zinderson. The Norton Family's dominion is located in the rural, far ends of the Northlands and there isn't anything valuable that we can present to you. The most fitting gifts that I can think of are these furs which I present to you as an apology for not being able to offer anything better. I am also really sorry for the troubles you have went through to carry out this errand.\"</p><br/><p>Viscount Zinderson happily accepted the letter and said, \"Thank you, Lord Baron, for your gift. Actually, I do fancy these furs quite a lot.\"</p><br/><p>......</p><br/><p>Bam! The Second Prince smashed his chair right on his desk in front of Viscount Zinderson. On the desk was a beastskin which was Lorist's reply to the Second Prince's letter, on which only a single, huge 'Ptoooey!' was written.</p><br/><p>The Second Prince was so mad that his face flushed completely red. The response he received was akin to a square slap in the face by Lorist. When he first saw the letter, he recalled the last letter Lorist wrote him which contained only the words 'Top Kek' which evoked a massively humiliating feeling in his mind and couldn't control his anger any longer, causing him to unwittingly stand up and smash his chair onto the desk despite being in the presence of Viscount Zinderson.</p><br/><p>The loud bang snapped the Second Prince out of his fury. Even though the chair was completely shattered, the letter Lorist wrote was still in pristine condition, causing rage to well up in the Second Prince once again. However, he managed to suppress himself and waved towards Viscount Zinderson as he said, \"Buzz off. And don't you go around blabbering about this.\"</p><br/><p>Viscount Zinderson retreated with a pale face as he hurriedly said, \"Yes, Your Majesty.\"</p><br/><p>The only ones who remained within the study were the Second Prince and the man who had disguised himself as Viscount Zinderson's attendant during the visit to Firmrock Castle.</p><br/><p>\"How dare he... How dare the Norton Family disrespect me so dismissively? Do they think that they will be safe just because they have Firmrock Castle locking us out? Well, I will crush their naive dreams and will never forgive them. They will pay this price in blood. Only their fresh blood can wash away the humiliation I have received...\" roared the Second Prince as he paced around in his study.</p><br/><p>After a while, the Second Prince stopped in front of the silent man and said, \"Tell me, what did you manage to find out during the visit?\"</p><br/><p>The middle-aged man bowed down and said, \"Your Majesty, as you have predicted, the defenses at Firmrock Castle is extremely lax and I estimate that they have only 3 companies of roughly 1500 men defending that place. Three companies of troops are responsible for the defense of the front, middle and back walls of the castle respectively. Regrettably, I didn't encounter a single Norton Family soldier when I visited the taverns and inns over there. Apart from the walls and the army camps, the soldiers were not allowed to go anywhere else.\"</p><br/><p>As the middle-aged man didn't know about Lorist's reorganization of the military structure, he could only see the Norton Family soldiers through the mold of the First Legion's organizational structure. He wasn't aware that almost all the family soldiers of the Norton Family had been deployed to develop the Blackmud Marsh and at least half of the soldiers defending Firmrock Castle had been sent away as well with their shifts rotating every three months.</p><br/><p>\"I've heard one of the tavern owners complain that after every winter, some magical beasts will remain in the dominion even if the wave has passed and that seriously affects the agricultural development and the spring harvests. That's why the Norton Family soldiers will still be occupied with killing the rest of the magical beasts. That's also where they get their source of meat. The tavern said that the effort usually lasts till the 5th month. I believe this year will be similar as well.\"</p><br/><p>Apart from informing the family knights and administrative officers of the dominion, the development of the marsh to build a port was not publicly announced. The fact that the family soldiers were mobilized to work on the project also made the citizens within the dominion think that they were being deployed for the usual hunt for the magical beasts post the yearly wave.</p><br/><p>\"Your Majesty, I also discovered that the Norton Family's second line of defense, which are the garrison soldiers that are responsible for the security of the place, number only very few. Even the warehouses were only guarded by ten plus people each, far less than a usual squad. Additionally, behind Firmrock Castle, a new city has been constructed and is defended by only less than 300 garrison soldiers. Also, I used the excuse to visit the Martyrs' Graveyard to climb up a hill that was near the rear city walls of Firmrock Castle and discovered that there was not even one defense ballista atop those walls. It seems that they have lost a huge number of ballistas from their battles with the magical beasts.\"</p><br/><p>The middle-aged man was indeed a talented spy. However, he didn't know that Lorist had actually reformed the command units of his forces with the smallest squads numbering only 10 men. When it came to keeping an eye on the warehouses, that arrangement was in fact ideal as before the reformation, the 100 plus men of each squad was far too large a number for a menial task like guarding a warehouse, resulting in many of them sitting around having nothing better to do. Also, almost half of the soldiers from the garrison regiment at the walls of the rear city of Firmrock Castle were deployed as laborers for the marsh development project with the middle-aged spy to know no better.</p><br/><p>Thus, the middle-aged man took the drastically small number of soldiers there to be a sign that the Norton Family was extremely lacking in military might. The absence of any ballistas at the wall of the rear city also seemed to convince him further about the theory that the Norton Family lost a lot of men and equipment from battling the magical beasts. That's why he believed that the reason the Norton Family refused the Second Prince's demands was due to their pride as a noble family and not the fact that they could back themselves up in terms of military might.</p><br/><p>\"Hahahaha...\" After hearing the conjectures of the middle-aged man, the Second Prince laughed out maniacally.</p><br/><p>\"After the winter harvest concludes in the 5th month, I want to deploy my soldiers in a campaign against the Norton Family,\" said the Second Prince coldly.</p><br/><p>\"Coincidentally, the various nobles of the Northlands will gather for their regular alliance meeting. At that time, I only have to announce that the Norton Family has disrespected me and showed signs of rebellion with Baron Norton's acceptance of the title granted by the Andinaq Royal Family as proof to declare war against their family with the aid of the noble alliance.\"</p><br/><p>\"Your Majesty, you should also be vary of Baron Shazin and Count Kenmays. Those two have had business relations with the Norton Family and they also have strong forces of their own. It's better if you be on guard towards them as well,\" reminded the middle-aged man.</p><br/><p>The Second Prince nodded and said, \"I am well aware of that. When they come to the alliance meeting, I will forcefully hold them back to make them contribute to the campaign. Baron Shazin shall give me at least 10000 soldiers and since the Kenmays Family has a force of 30000 men, they will naturally have to send 20000 of them to me at the very least if they want their count to survive that ordeal.</p><br/><p>\"There's also Baron Felim from the Family of the Pegasus. That guy also has quite a formidable force in his hands, so I'll have him send 5000 of them my way as well. Apart from the Norton Family, these three noble families are the most powerful ones at the moment. This time around, not one of them can hope to sit back idly and must all do their part in this campaign. Then again, Baron Felim has always been rather respectful towards me, so I might just raise his title after this campaign if he performs well...\"</p><br/><p>\"Your Majesty truly is wise,\" praised the middle-aged man. \"So, how many soldiers does Your Majesty plan to deploy against the Norton Family?\"</p><br/><p>The Second Prince fell into deep thought before he said, \"This campaign will be a good chance to show off the prowess of my kingdom's army, the First Legion, to these backwater nobles. The First Legion shall deploy 50000 troops for this campaign and leave behind 10000 troops to guard the main camp. The remaining two regiments will be in charge of the supply lines.\"</p><br/><p>\"Your Majesty, isn't that a little too much for a small family like the Nortons?\" asked the middle-aged man.</p><br/><p>\"You don't understand. The Norton Family doesn't even consider me a worthy adversary. But, we only need to lock them in their dominion for half a year to win without even engaging in a single battle with them. I'd like to see how the Norton Family plans to feed their 200000 plus citizens without access to food from outside their dominion. I won't be that stupid to have my First Legion attack the Firmrock Castle head-on and cause any unnecessary losses.</p><br/><p>\"The deployment of the First Legion is mainly to pressure Baron Shazin and Count Kenmays's forces to attack the castle in our stead. With the might of the First Legion, let's see how many nobles of the Northlands dare to hold any reservations about serving me. I hope that after this victory against the Norton Family, the situation of the Northlands will be able to stabilize, causing it to become a rich provider of food and soldiers for me in the future,\" said the Second Prince.</p><br/><p>\"Your Majesty truly is wise!\"</p><br/>\n</div>"}