{"title": "Chapter 191 Ballista Storm", "id": 191, "volume": 2, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-191-ballista-storm", "volume_title": "Volume 2", "body": "<h1>Chapter 191 Ballista Storm</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Ballista Storm</p><br/><p>Hi guys, this is your first regular chapter of the week and I really have to apologize for letting the cliff hang for so long. Sorry for the note I have included in the main chapter body as the release note only takes 1500 characters. It's important, so I would appreciate it if you readers took your time to read it.</p><br/><p>As much as I don't want this to pass of as an excuse, I suppose I owe you guys an explanation, and here it is: for the past week, my sibling has contracted dengue fever (which is not too uncommon in where I live) and has been hospitalized. That's why for the early part of the week, I was a little caught up with hospital visits, hence the delays. He's just discharged yesterday afternoon and is doing fine now, and I do intend to at least try to release 4-5 chapters this week, maybe a double chapter tomorrow if I can really find the time.</p><br/><p>I've also read some of your comments in the previous chapter, and the following part is important.</p><br/><p>Some of you have expressed the desire for chapters with cliffhangers to be stockpiled and released in one go. I understand that many of you also prefer to be able to read the chapters ASAP. So, here's a poll for TRL readers to decide on the general release direction I will take in the future. I haven't ironed out the details for what I would do for witholding cliffhanger chapter releases, but generally if the cliffhanger chapters are less than 3, I will release them all at once. And if the continuous cliffhanger chapters span more than that, I might release them as two halves. Please also feel free to comment and discuss other chapter release methods that you feel is better if you neither like the release ASAP option or the stockpile release option.</p><br/><p>Without further ado, here's the poll:</p><br/><p>http://www.strawpoll.me/13140028</p><br/><p>P.S. the recent chapters were a little longer than the usual 6-page chapters I do, so I hope you forgive me for a slightly lower weekly chapter count. I usually try to release 6 chapters under normal circumstances, but if they get a little on the long side, the number could drop to around 4-5 per week (including bonus chaps). Number of regular chapters per week will remain the same regardless of chapter length, and same applies to bonus chapter donations. The amount I take per bonus chapter will stay the same regardless of chapter length, that's the least I can do as a translator who has received the support and trust of you, my awesome readers. That's all.</p><br/><p>400 meters away from the Second Prince's army, the Norton Family arranged themselves in a weird manner with three square formations of silver-armored infantry soldiers lined up next to each other, forming a straight line of sorts, with cavalry troops flanking both sides of each of those three square formations.</p><br/><p>Even though the Second Prince had experienced many battles, he was also confused by the odd formation. While having cavalrymen flanking both sides of the infantry troops would allow quite a bit of flexibility in that they would be able to both attack and defend, lining up three square formations in a row decreased the overall defensiveness. Additionally, the space between each of the three square formations were a little too wide and if they were closer together, they could form a larger rectangular formation instead.</p><br/><p>Eventually, nine square formations were formed neatly with each one having roughly one regiment of troops at a total troop count of roughly 20000. It seems like the Norton Family had indeed sustained huge casualties from fighting the magical beast wave. But despite having only 20000 troops, they chose to fight an open field battle... What's going on here? Are they so desperate that they lost all their wits? Or are they going to engage in a suicidal battle to make sure we suffer even more to retaliate against me no matter the cost, the Second Prince wondered.</p><br/><p>And so, the Second Prince decided not to mobilize his troops and have his First Legion assume a defensive formation. If the Norton Family troops don't show any movement in the coming moments, the Second Prince would order Count Kenmays or Baron Shazin to send out part of their forces to test the waters. Since the Norton Family only have that many soldiers in contrast to the Second Prince's own 100000, which was easily five times as much as the former's, the Second Prince figured that the Norton Family wouldn't be able to fight their way out of this predicament no matter what.</p><br/><p>At that moment, the Second Prince was already considering whether to move the soldiers of the allied noble army to the front of his First Legion troops so that he would be able to sustain far less losses.</p><br/><p>\"Your Majesty, the Norton Family does seem rather wealthy. Look, all of their soldiers are wearing a shiny, new metal armors that cover their whole body for optimal defense. Tsk tsk tsk...\" The one who said that was a high officer in the court of the Iblia Kingdom, who was in actuality the personal guard of the Second Prince, Blademaster Louinse. Had it not been for his presence, Baron Shazin Hennard, who was a Gold ranked knight, wouldn't have stayed by the Second Prince's side so obediently for such a long time.</p><br/><p>The Second Prince turned his attention back to the forces of the Norton Family and instantly felt a mix of hate and jealousy. Even a normal soldier of the Norton Family was equipped with defensive armor more complete than that of his own knights, causing them to look far more impressive in comparison. All of them looked like shiny, gleaming tin men.</p><br/><p>\"Hmph! Even if they have money, they have nowhere else better to spend it apart from the defense of their own soldiers. After all, they have to rely on these soldiers to fend off the assaults of those magical beasts. If they don't arm them enough, how would the soldiers be willing to stand off against those ferocious beasts? However, it won't matter. These shiny armor will eventually be mine anyway and I will form a personal guard that will be given the armor we take for ourselves today. Just follow me closely by my side,\" the Second Prince said before he gripped his horsewhip and waved it in the air harshly, as if the armor of the Norton Family would belong to him in mere moments.</p><br/><p>\"Your Majesty, look, what is that? A war chariot?\" Blademaster Louinse said urgently as he called out to his liege. The battlefield had been introduced to yet another variable.</p><br/><p>The Second Prince snapped out of his daydream and raised his head only to see one chariot after another fill up the ranks of the Norton Family. Countless black chariots traveled between the space of the square formations and took their place at the very front to form a defensive line. It was as if they didn't even consider complementing the square formations and decided on the spot to line up in a straight line. In fact, the row of chariots even blocked the cavalrymen behind.</p><br/><p>These chariots looked like wide-open wooden boxes with one fully-armored coachman for each controlling the horses and two fully-armored pikemen equipped with kite shields and two other soldiers at the back. Each chariot was manned by 5 soldiers in total.</p><br/><p>\"Haha, so this is the vanguard of the Norton Family?\" the Second Prince said before he laughed out loud. \"Does he really think his chariots stand a chance against my 100000-strong army? Is the dumb bear treating us like magical beasts? They must be brain dead... Hahaha... This is far too idiotic. Have they been isolated from the world of men for far too long?\"</p><br/><p>\"Your Majesty, what do you mean?\" Blademaster Louinse asked as he didn't understand why the Second Prince was ridiculing the Norton Family troops.</p><br/><p>\"My dear Louinse, as a Blademaster who concentrates all your attention on the path of the blade, it's understandable that you're not well-versed in the art of war. It is obvious that the Norton Family intends to take advantage of the wide-open battlefield by surprising us with the war chariots. They intend to use the chariots which have good defense and mobility to break through our defense line to massacre away as well as allow their troops at the rear to follow up with the assault to gain victory in one fell-swoop,\" explained the Second Prince.</p><br/><p>\"So what's the problem then?\" the Blademaster said, still confused.</p><br/><p>The Second Prince felt a little tired and annoyed from having to explain the basics of military strategy to the fool. \"My dear Louinse, you don't understand... Hundreds of years ago, humankind has already abandoned usage of war chariots on the battlefield because of its impracticality. No matter how good the defense or mobility, as long as the chariots enter the firing range of longbow troops, the horses would definitely be the first to be shot at.</p><br/><p>\"As long as the horses are killed, the chariots will no longer be able to advance would even become obstacles to the troops that are charging up from the rear. And usually, if only a single chariot is stopped, a chain reaction would occur causing the other chariots will crash into one another as a result. To prevent that from happening, the distance between each chariot must be increased. However, that in itself will decrease the impact of the chariots' charge.</p><br/><p>\"Also, the use of chariots are also really situational with terrain being the most important aspect. A simple ditch of 1.5 meters deep can easily stop the advance of those chariots. The most crucial point here is that we have a large number of cavalrymen. As long as the cavalrymen circle around to the back of those chariots, the soldiers riding the chariots will be defenseless against our cavalrymen's attacks. The reason I was ridiculing them was because the Norton Family treated us as magical beasts. Using chariots against magical beasts is indeed a valid strategy because those beasts don't have ranged attackers and don't know how to circumvent the approaching chariots to attack them from the back. However, it's downright delusional to think that this tactic will work against us.\"</p><br/><p>\"I see, I didn't know that chariots had so many downsides. I even thought that riding on a chariot seemed pretty imposing. Your Majesty, after we defeat them, let me have one of those chariots to play around with. Hmm? Your Majesty, look over there. Are those two huge things chariots too?\" Blademaster Louinse said curiously after seeing two huge 'chariots' appear at the ranks of the Norton Family's forces that were each pulled by tens of horses. It advanced slowly between the three infantry square formations before stopping entirely.</p><br/><p>......</p><br/><p>It was entirely Lorist's fault. As he had felt that victory was already at bay, he didn't bother to give the family knights specific instructions. The strategy he had initially chosen to employ was to fire a few waves of ballista bolts to crumble the morale of the enemy before letting the other units charge into the disarrayed enemy ranks.</p><br/><p>It wasn't that Lorist underestimated the Second Prince's 100000-strong allied noble army, but he truly had access to far too many ungodly powerful ballistas -- five whole brigades of them. Each brigade had 500 carroballistas with a grand total of 2500 of them within the division, each with a firing range of 320 meters. The only thing that piqued Lorist's curiosity was how many volleys of ballista fire the Second Prince's First Legion could endure.</p><br/><p>That's why Lorist made a careless mistake. What he truly underestimated was the battlelust of his subordinates. The moment the tune of assault was blown, Potterfang's 3 heavy-armored brigades, Fiercetiger Loze's 3 pike cavalry brigades, Terman's knight division, Yuriy's light cavalry scout brigade and Josks's mounted archer brigade all rushed out of Firmrock Castle, leaving the carroballista division that was making preparations to be the main attacking force at the rear. Lorist, who didn't expect that to happen, was flipping mad when he saw that unfold before his eyes.</p><br/><p>At least those fellows didn't turn stupid from the battlelust and know how to get in formation first before rushing into the enemy lines, thought Lorist before he hurriedly ordered Malek to direct the carroballista division to get into formation ahead of the other soldiers.</p><br/><p>On the other hand, Els himself was up to some other mischief and insisted that the supersized carroballistas Grandmaster Fellin built to be deployed as well. He ordered his guards to painstakingly bring the gigantic carroballistas out from the castle gates past the drawbridge out to the battlefield.</p><br/><p>\"Locke, I'm not being stubborn. i just want to see how far these super ballistas can fire. According to Grandmaster Fellin, they can shoot as far as 500 meters. Think about it, by launching only two bolts to the enemy's command center, we will be able to shake this battle up quite a bit. Maybe, we might even wrap this battle up before it even beings, just like that 'shoot through the brain'[1] tactic you mentioned, with which the enemy forces will crumble in confusion and mayhem from the loss of their leader,\" Els said.</p><br/><p>Fine, I'll let him do as he likes since we're gonna win anyway, thought Lorist, too lazy to continue arguing with Els.</p><br/><p>\"No matter what, just make sure you clean up the mess after playing around with it,\" Lorist said as he yawned. Incidentally, he had 'worked' himself quite tirelessly with Telesti the night before and didn't get enough sleep.</p><br/><p>\"Alright, Malek, if the preparations of the carroballista division is ready, you may begin. The sooner we finish, the sooner we'll be able to rest. After this, we still have to go back to developing Blackmud Marsh,\" Lorist said to Malek, who was mounted and riding forward beside the super carroballista.</p><br/><p>\"Yes, milord,\" Malek said as he made a knight salute and headed to the front.</p><br/><p>Having nothing better to do, Lorist sat down on the super carroballista and looked at Els give his commands. \"It's that spot over there in the middle with the huge rectangular flag with the royal crest on it. That represents the Second Prince. He must be beneath that flag, so just aim there...\"</p><br/><p>\"But sir, I really can't see it clearly enough,\" complained the archer who was operating the super ballista. It couldn't be helped as average humans couldn't see a spot 500 meters away with perfect clarity. Perhaps, only eagles were capable of that.</p><br/><p>\"Sheesh, what a useless idiot you are... How did you become an archer with that eyesight of yours? Have someone else who has better eyesight take your place,\" Els reprimanded with dissatisfaction.</p><br/><p>After finally settling on the right person to make the shot, Els jumped down the super ballista and headed for the other one. Before he left, he had a few guards stay to give instructions in his stead. \"When I finish the preparations over there and give the order to fire, you shall follow suit. Understood?\"</p><br/><p>The horn resounded once more and the carroballistas at the front row advanced tens of meters before stopping once more, followed by the second and third rows. After that, all three rows of carroballista units adjusted their aims.</p><br/><p>Subsequently, the drums began to pound. For as long as the drum beat went on, the ballistas must continue firing without stopping unless the ballistas malfunctioned for some reason.</p><br/><p>The two shield-bearers at the front of each 'chariot' squatted down, revealing the loaded steel ballistas behind them, before one loud twang another rang out across the battlefield in a constant, repetitive rhythm.</p><br/><p>Countless bolts whooshed through the distance that separated the two armies, heading straight for the First Legion's formation, causing one cry of agony after another to be heard. The frontmost row of soldiers collapsed within an instant with black, iron ballista bolts piercing through their bodies. Some ballista bolts even skewered a few soldiers in one shot.</p><br/><p>The First Legion also responded rather swiftly. The blow of a horn could be heard as the two cavalry brigades on each flank rushed forward with the obvious intent of taking out the ballista troops as they were busy reloading to spare their own comrades from the fate of being impaled once again by the powerful ballista bolts.</p><br/><p>Lorist who was seated on one of the super ballistas clicked his tongue and thought that the Second Prince did indeed have some military experience after all. However, what the Second Prince didn't expect was how advanced the steel ballistas of the Norton Family were compared to normal ones. It only took less than 40 seconds for the next bolt to be loaded, and that time even included the time an archer required to take aim.</p><br/><p>The pulley-like mechanism Lorist included when he designed those ballistas allowed the next bolt to be easily loaded by a simple tug of a lever at the side of the ballista to cock the string followed by an assistant placing the next bolt into the slot, similar to the mechanism used in older machine guns in Lorist's world.</p><br/><p>Another round of twanging rang out as the second volley was launched straight into the cavalry brigades that were charging straight for the carroballistas, completely decimating their ranks.</p><br/><p>Apart from a few hardy war horses that neighed out loud from the searing pain, the whole battlefield was almost entirely quiet. Even the cavalrymen who were following the first wave behind stopped advancing altogether. There was still a 300 meter distance to cover, and the time that they required to reach the enemy ranks would be well enough for another four to five volleys of ballista bolts. To them, this wasn't a battle. It was a massacre.</p><br/><p>Another honk of the horn rang out, prompting the longbowmen of the First Legion to step forward and begin firing in rage right next to their fallen comrades.</p><br/><p>Perhaps due to the lackluster quality of the longbows of the First Legion, thousands of arrows landed straight on the ground with only a couple managing to reach the ranks of the carroballistas. However, with the shields protecting the soldiers on the carroballistas and the armor the horses were equipped with, apart from one unlucky horse that got struck in its rear, there were no other results to show for the volley of arrows fired by the First Legion.</p><br/><p>Due to their short firing range, the longbowmen of the Second Prince's army marched forward to make up for the deficit, only to be hit squarely once again when the third volley of ballista fire began, easily crippling half of the ranks of the longbowmen. The lucky ones that managed to avoid being perforated by the iron bolts stared at the fallen corpses that littered the battlefield before letting out cries of panic as they abandoned their bows and fled. They had lost all hope.</p><br/><p>Twang, twang! This time around, Els finally ordered the two super ballistas to fire. Unsurprisingly, the two archers that fired the super ballistas were stunned from the recoil of the shot.</p><br/><p>However, something out of Lorist's expectations occurred. After the two super ballistas fired, the flag representing the Iblia Royal Family collapsed, causing the rear of the First Legion to break into mass confusion.</p><br/><p>Baron Shazin, also known as Knight Hennard, and Baron Felim's troops that were stationed at the left flank of the First Legion, also began to leave the battlefield. In a mere couple of moments, all that could be seen in their direction was the dust that had been kicked adrift from the movement of man and horse. As for the Kenmays Family forces that were positioned at the right flank of the First Legion, they retreated two hundred meters before beginning to set up their camp, taking up a neutral stance.</p><br/><p>The twanging resumed as the fourth volley of ballista fire began. After that, three short honks of the horn could be heard accompanied by a continuous drum beat. That was a signal for the carroballistas to advance 30 meters forward before resuming fire.</p><br/><p>By the time the fifth and sixth volleys were released, the remnant enemy troops that managed to survive already turned tail to escape.</p><br/><p>The drumming finally stopped before a loud, sharp honk was heard, signalling for the troops to pursue the fleeing enemy soldiers.</p><br/><p>\"Norton!\" A loud cheer rang out as the pike cavalrymen, light cavalry scouts, mounted archers and knights charged towards the enemy.</p><br/><p>Els jumped down from the other super carroballista and got onto his mount before shouting out, \"All mounted guards, charge forth! Let's go catch ourselves some prisoners!\"</p><br/><p>\"Gosh, what's up with you guys? Are you really that excited for battle? Also, shouldn't your war cry be something simpler like 'kill'? Why are you so specific about catching prisoners?\" Lorist said with a hopeless expression before turning around only to see Reidy trying hard to hold back his laughter.</p><br/><p>Reidy had followed Lorist along when he was 16 and 4 years had already past. As Lorist's eldest disciple, he had just broken through to the Silver rank ten or so days ago and was just recently knighted by Lorist. He was currently the youngest knight of the Norton Family.</p><br/><p>\"What are you laughing about?\" Lorist asked.</p><br/><p>\"Milord, did you forget that you said that the Norton Family could only use prisoners and criminals as unpaid laborers?\" Reidy reminded.</p><br/><p>Good Sol! Lorist suddenly realized the real reason his knights were so eager to do battle and why they were so happy when they heard war was about to break out. In actuality, they had wanted to catch prisoners to take their place in the development of Blackmud Marsh. No wonder back then Potterfang said that the knights of the family would do their best to capture more prisoners, not to mention Els's weird war cry.</p><br/><p>Lorist laughed out loud and grumbled, \"What do I do with you guys, sheesh...\"</p><br/><p>1. I did some googling and I believe the author was referring to J.F.C. Fuller's work, 'Military History of the Western World'. More details here: https://en.wikipedia.org/wiki/Plan_1919#The_Plan</p><br/>\n</div>"}