{"title": "Chapter 206 Enslaved [Cliffhanger 5 of 5]", "id": 206, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-206-enslaved-cliffhanger-5-of-5", "volume_title": "Volume 3", "body": "<h1>Chapter 206 Enslaved [Cliffhanger 5 of 5]</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Enslaved [Cliffhanger 5 of 5]</p><br/><p>Hi guys, I know it's late, but here it is! The first bonus chapter of the week is brought to you by Pierre B. from Germany, Jakub D. from Poland and Aaron T. from the USA! Thank you for your support!</p><br/><p>There will also be another release today in plus minus an hour. Stay tuned!</p><br/><p>One guard rushed into the tent hurriedly with a grim look on his face. \"Sir, we followed the trail Sir Reidy left us and arrived at the edge of a cliff where we found the steel ballista he left behind, the Blademaster's corpse and Milord Lorist's sword. But milord and Sir Reidy were nowhere to be found! The marks left on the edge of the cliff seem to indicate that they've both fallen into the river below...\"</p><br/><p>The four Gold ranked knights within the tent, Fiercetiger Loze, Malek, Belnick and Freiyar, all stood up and said in unison, \"Bring us there!\"</p><br/><p>The nearby area around the cliff had long been searched thoroughly by the guards and when the four Gold ranked knights arrived, they were greeted by the sight of Els, Yuriy, Jim and a few other Silver ranked knights looking at the flowing river beyond the cliff.</p><br/><p>\"So this is that Blademaster? Milord said he was called Zarinan... Was he sent here by the Second Prince?\" Loze said as he inspected the corpse on the ground.</p><br/><p>\"That's right, Knight Josk and Knight Potterfang had both been injured quite severely by him. The family forces also lost more than 400 good men because of him, among which 11 were family knights,\" Els said as he approached with a grim expression.</p><br/><p>\"Did you not locate any trace of our lord?\" Malek asked.</p><br/><p>\"No... He must've fallen straight into the river. This river flows inland towards the wildlands and connects to the Azure River over there. I've already sent someone over to search.\" Els said.</p><br/><p>\"We must definitely find our lord. Have the other search parties come here and make sure to search both sides of the banks of this river carefully. I shall take the lead, so you guys can send this corpse back first and look after it. We'll deal with it after milord returns,\" Belnick decided grudgingly.</p><br/><p>......</p><br/><p>Lorist was currently experiencing a fever and he only managed to regain consciousness for a bit only to barely hear some people say, \"Woke up...... This guy...... incredibly lucky...... Fell straight into the...... Tell the young mountain chief......\"</p><br/><p>Feeling someone place a cool water sack at his mouth, he took in large gulps of the liquid within before losing consciousness.</p><br/><p>The next time he regained consciousness, he realized that he was within a large cloth sack which was being shaken around really hard. Lorist realized that his whole body hurt so much that he almost felt numb from the pain. The insides of the sack was filled with the stench of blood and sweat that caused Lorist to feel like vomiting, but he couldn't even if he wanted to. His head hurt so much that it felt to him like it was about to explode while he kept on sweating. Even though he wanted to cry out, he couldn't do so as his throat felt inflamed and painful with his lips so dry that it cracked. His whole body was also bereft of energy.</p><br/><p>The cloth sack continued to shake indefinitely and before long, Lorist realized that the people who were transporting him seemed to be in a rush and believed that he had been stuffed into a sack and hung to the side of a horse, just like how the merchants hung loads on both sides of workhorses. As the shaking continued, Lorist fainted once again.</p><br/><p>The next moment Lorist opened his eyes, he was no longer within the large cloth sack and could see the star-filled night sky above him. The chatter of people and horses could be heard nearby and it seemed that they had stopped at some kind of resting stop. Lorist found that he was tossed amidst a pile of grass and left there just like that. But he couldn't move a single muscle, not even being able to raise his head, and could only stare at the night sky quietly while laying sprawled on the ground.</p><br/><p>This doesn't seem good, I think I've fallen into the hands of the mountain barbarians, Lorist hypothesized after hearing the noise around him. But what made him curious was why he was rescued and taken away. According to his understanding on mountain barbarian culture and behavior, when the barbarians met a heavily-injured person in the wilds, they would usually kill that person to end the suffering, or rob that person and leave without doing anything else, instead of wasting effort and resources to save that person.</p><br/><p>He also wondered where Reidy, who had fallen off the cliff with him, had gone. Was he similarly rescued by the barbarians? If so, where would he be now? Lorist could barely remember that he was fed some kind of bitter medicine when he was still half-conscious. While the medicine did seem to treat some of his injuries, it made him completely weak and powerless with his dantian being completely empty without a single shred of internal energy within. Right now, Lorist was even weaker than the common person and couldn't kill a chicken even if he wanted to.</p><br/><p>For now, he could only lie unmoving. Even though he wanted to activate his technique to recover some internal energy, he found that he wasn't able to do so as his body didn't react at all and only let out a bunch of sweat.</p><br/><p>Sounds of giggling approached from the distance as two male and female barbarians approached Lorist. Perhaps they found the place to be nice as it was quiet and sheltered. Not long after, the male barbarian began to make his move, but the female barbarian said something that Lorist wasn't able to hear. But he was able to hear clearly the male barbarian's reply, \"That one is gonna die soon, he can't do anything. We don't need to care. Come on...\"</p><br/><p>Even though the female barbarian wanted to push him away, she was pressed to the ground by the male barbarian and the humping soon ensued.</p><br/><p>Lorist smiled bitterly as he couldn't even turn his head to look even if he wanted to. That was what the male barbarian meant when he said that Lorist was on the brink of death. The two continued their 'vigorous exercise' and they had already switched to another position, with the male barbarian having his mate get on all fours with her backside raised. Incidentally, the female barbarian faced Lorist and saw his opened eyes when she raised her head.</p><br/><p>\"He's awake, he's awake... I have to tell the young mountain chief,\" said the female barbarian before she pushed the male barbarian away and ran off into the darkness. The male barbarian remained in his ready-to-thrust position for a few moments before looking at Lorist and cursing savagely when he left.</p><br/><p>After a while, Lorist was surrounded by a bunch of people whose faces were painted with various patterns, causing Lorist to recall a documentary he watched in his previous life about a few explorers who made their way into a cannibal settlement within a forest. There was a shot where the primitive people gathered around the camera and it was exactly like the scene he saw before him, as if he had become a meat dish ready to be served.</p><br/><p>Do the mountain barbarians eat people? Lorist wondered as he tried to recall everything he knew about the barbarians. It was said that during the winter seasons, if the mountain barbarians lacked food, they would cook up the people who starved to death and consume them for sustenance. Given that winter was already on the way, were the barbarians going to bring Lorist back as reserve food?</p><br/><p>At the very least, Lorist felt that it was fortunate that he wasn't about to be eaten by the primitive, hairy-looking cavemen as they were often depicted in media of his past life, but mountain barbarians who differed little in appearance to himself. Those barbarians also seemed to be more cultured than those he saw in documentaries in that they would season their food as they were cooking it, unlike the cavemen who probably didn't even know about washing their food before tossing it into a cooking pot.</p><br/><p>Lorist shut his eyes and ignored the incessant chattering of the barbarians. Even though they also spoke the same common Grindian Language, after a millennia of living in isolation within the mountains and forests, their language evolved in their own way and included much vocabulary specific to their weird barbarian dialects. Coupled with the slightly different intonation and pronunciation they used, it almost hurt Lorist's head to listen to so many of them speak at once.</p><br/><p>All of a sudden, the voices quieted down and Lorist opened his eyes curiously, only to see that the heads that gathered around his face had dispersed with only a young female mountain barbarian within his line of sight. She had a head of long, brown hair with a shiny, golden tiara on her head. Had it not been for the three streaks of painted tiger stripes that covered her face, she would've been considered quite the beauty based on her facial features.</p><br/><p>The female barbarian stared at Lorist for a while before asking whether he could already talk.</p><br/><p>Another bushy-haired barbarian appeared beside her and it was unclear whether that person was male or female. That person began to feel Lorist up and took out a stick on which some disgustingly sticky substance was stuck and poked on Lorist mouth with it. After being carefully inspected, Lorist was almost choked to death from the stinky breaths of that barbarian.</p><br/><p>Before long, the barbarian raised his or her head and said roughly that Lorist wasn't beyond saving and mentioned that the reason he couldn't move right now was because of the side effect the medicine they fed him, and that it would wear off naturally after a while.</p><br/><p>The crowned barbarian woman looked rather happy to hear that and instructed them to save Lorist's life. Before leaving, she looked at him and said, \"This is my first flatlander prisoner who has an important position... I will bring him back for daddy to see...\"</p><br/><p>The things that happened soon after caused Lorist to feel extremely embarrassed and angered. After the crowned woman left, five to six female barbarians beside him stripped him naked. One of them was surprised when she saw Lorist's flaccid member and pointed at it with her finger while saying something that basically amounted to, 'If his member is already so big while soft, then wouldn't it be quite impressive if hardened?' And so the few barbarian women crowded around Lorist's lower body and prodded his junk from time to time.</p><br/><p>Lorist was so embarrassed that he wanted to die. Fortunately, his junior didn't react as Lorist himself didn't have any shred of energy left. Otherwise, he was sure that he would be group raped by the barbarian women. The one who got Lorist out of his predicament was the bushy-haired barbarian from before, saying something that caused the barbarian women to leave him alone, but not before they each grabbed his member one last time before leaving, angering Lorist so badly that he almost fainted.</p><br/><p>After that, the bushy-haired barbarian got a huge basin filled with a greenish-black paste and proceeded to apply it all over Lorist's body, with extra layers padded onto Lorist's injuries, before feeding Lorist a bottle of sticky, bad-smelling, black-colored medicine, causing Lorist to faint from all his built up anger.</p><br/><p>The next time he awoke, he felt his whole body hurt and itch as if he had been encased in concrete. The soreness, numbness and pain he felt in his wounds were especially unbearable. Even though he wanted to scratch them, he wasn't able to as he was still so weak that he was unable to move.</p><br/><p>At that moment, a female barbarian with thick lips appeared beside him and her face was full of circular, black tattoos. Seeing Lorist wake up, she fed him a large bowl of meat soup. Not long after finishing the soup, Lorist felt his stomach hurt badly. In the end, he could no longer hold it in and emptied the contents within his stomach while lying down.</p><br/><p>As if she knew that Lorist would have that reaction after drinking the soup, the thick-lipped woman had made sure to stand far away before it all happened. When Lorist finally stopped, she called two male barbarians to bring Lorist to the side of a stream and they placed him on the cobblestone bank before washing his body clean.</p><br/><p>Even though the cold water made Lorist shiver quite badly, he couldn't move at all and was at the mercy of the thick-lipped female barbarian. When he was finally washed clean, the barbarian woman wiped his body all over with some kind of beastskin before letting him dry under the sun while she began toying with Lorist member, causing him to wish for death to spare him from the embarrassment.</p><br/><p>As the thick-lipped barbarian played around with Lorist's thing, she even mocked the other two male barbarians, saying that their manhood wasn't nearly as big as Lorist's, causing the two of them to feel rather dissatisfied and begin lifting their beastskin kilts to compare their manhoods with Loirst's. After a while, the thick-lipped woman finally let go of Lorist's member and began comparing those of the other two men with her hands and gradually engaged in a bout of pleasurable intercourse with the men.</p><br/><p>When they finally finished, the two men brought Lorist back to their camp and tossed him into a dark tent. The bushy-haired barbarian once again appeared before Lorist and prodded his body for a bit before nodding with satisfaction. But this time, the barbarian didn't apply the green mud from before and only fed Lorist a bowl of bitter medicine before leaving.</p><br/><p>In the middle of the night, Lorist woke up all of a sudden and realized with surprise that energy had returned to his body and he could sit up normally again. His throat no longer hurt and he tried clearing it and realized that he could speak. Even though Lorist was completely undressed, his body was covered by a strong-smelling beastskin. With his stomach rumbling in hunger, he tried to get up but found that his legs were still far too weak.</p><br/><p>Lorist then tried to stand up by using his arms to hold onto the support of the tent, but the unexpectedly brittle support cracked and snapped before he could react and the whole tent collapsed with Lorist under it.</p><br/><p>A pair of hands soon raised the tent above Lorist and he realized that it was the thick-lipped woman from before. Barely able to sit up properly, Lorist said, \"Thank you. Do you have something to eat? Also, my clothes...\"</p><br/><p>The thick-lipped woman stared at Lorist for a while before leaving and returning with a huge basin that contained a big piece of roasted meat along with four palm-sized, black-colored biscuits as well as a flask with clean water.</p><br/><p>Lorist wolfed down his food and quickly finished it within moments. Even the flask of water was drunk completely without a single drop remaining. However, he was still troubled as his clothes still weren't there...</p><br/><p>And so, Lorist turned to the thick-lipped barbarian woman and said, \"Clothes, my clothes...\"</p><br/><p>But that woman didn't move a single finger in response.</p><br/><p>Thinking that she probably didn't understand the word 'clothes', Lorist tried to mime it with his hands, only to accidentally have the beastskin covering him slide off. The thick-lipped woman's eyes flashed all of a sudden and she stared at Lorist with a hungry look.</p><br/><p>This reminded Lorist of the scene when she toyed with her manhood not so long ago. Already panicking, he clutched the beastskin tightly before retreating into a corner like a helpless little girl.</p><br/><p>Fortunately, the sky was brightening by the moment, causing the thick-lipped woman to leave. Not long after, two male barbarians wearing beastskin kilts came to Lorist and signalled for him to follow them.</p><br/><p>When the beastskin-covered Lorist was brought outside a large beastskin tent, he found that many other barbarian women came over to see him and whispered that the flatlander that was Lorist was awake and could already stand up.</p><br/><p>After waiting for a while, he was brought into the tent and sitting within the middle of it was the gold-crowned woman with tiger stripe facepaint. Before her was a small wooden table on which Lorist's outfit and pants were placed.</p><br/><p>\"Who are you? What's your name? Where are you from?\" asked the barbarian woman with a weird dialect of the Grindian Common Language.</p><br/><p>Lorist narrowed his eyes and saw that she was toying around with his Gold ranked instructor badge that he had put on back then as he reminisced his glorious days at the Dawn Academy when he was showing Telesti his academy badge collection to give her some inspiration in designing the emblem for her academy. It was at that point when the cursed Blademaster Zarinan launched his assassination, causing Lorist so much trouble that he had no time to even remove his badges.</p><br/><p>\"I pay my respects to you, beautiful lady. I am called Locke and I come from the Dawn Academy of Morante City. I am a Gold ranked instructor for that academy,\" Lorist greeted the woman politely.</p><br/><p>\"Are you not from the Mordon Family?\" asked the crowned woman.</p><br/><p>After some deliberation, Lorist realized that she was referring to the Norton Family. But her weird pronunciation caused it to sound like 'Mordon' to Lorist.</p><br/><p>\"No, no,\" Lorist said hurriedly as he shook his head. If he had messed up his reply, he was certain that his head would soon end up upon a stake at the barricades outside. After all, the Norton Family had nursed a grudge with the mountain barbarians for more than 200 years.</p><br/><p>\"Respected lady, take a look at the badges on my clothes. The silver one is the emblem of the Dawn Academy and the gold one represents my status as a Gold ranked instructor there,\" Lorist replied with a straight face. It's not like he was lying. After all, what he said was technically true a few years ago.</p><br/><p>\"I guess you aren't lying. The people from the Mordon Family wear no such badges and you do look like someone from an academy. But what does a Gold ranked instructor do? Why have you come to the Northlands and why are you so badly injured?\" questioned the crowned barbarian woman.</p><br/><p>Thus, Lorist began to tell the tale he spun up. \"Respected lady, I am a Gold ranked instructor from the Dawn Academy and I have come here because I've received the invitation from the Norton Family to help them design a castle. I ended up injured like this because I encountered with someone who bears a grudge against me. Initially, I accepted the Norton Family's invitation so that I could avoid my enemy, but who knew that he would chase me all the way here and I kept running away to no avail. Fortunately, I was saved by you, respected lady. Please accept my gratitude. I will definitely return the favor in the future...\"</p><br/><p>\"I don't need your thanks or your favor, and I'm no respected lady. I am the mountain chief of Whitesnow Mountain. Since I've saved you, your life now belongs to me. From now on, you're my slave, understand?\" said the crowned barbarian coldly before raising her head to signal for her servants.</p><br/><p>Two huge barbarian men came over from the side and restrained Lorist before putting a thick collar around his neck that was connected to a long chain.</p><br/><p>Already despairing, Lorist said, \"Then, may I have my clothes back...\"</p><br/><p>Whap! A whip struck Lorist's back harshly, sending waves of pain down his nerves. One of the men yelled, \"Darned pig, you shall address her as master!\"</p><br/><p>After giving it some thought, the crowned barbarian woman tossed Lorist his clothes and said, \"You can have them. But these two badges, I will keep...\"</p><br/>\n</div>"}