{"title": "Chapter 212 Setting Out", "id": 212, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-212-setting-out", "volume_title": "Volume 3", "body": "<h1>Chapter 212 Setting Out</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Setting Out</p><br/><p>Hi guys, here's the third bonus chapter of the week by Tyler L. of the USA!</p><br/><p>There will be another release coming in ten minutes so stay tuned!</p><br/><p>From the depths of darkness came a voice that whispered, \"My... my child...\"</p><br/><p>Started awake from sleep, Lorist sat straight up on his bed. He was relieved to find that he was in a familiar room. Oh, I've already returned to the dominion for a month or so and I'm here at Firmrock Castle... I'm no longer that pathetic, oppressed slave. Bu-but... why do I keep dreaming about the last words of that thick-lipped barbarian woman?</p><br/><p>But the kid is not mine! Lorist denied with a fervent rage. He still recalled the days when the barbarian woman forced herself upon him. During that time, she also did it with two other barbarian men when she brought Lorist near the stream to bathe. There was no way that the child could so coincidentally be his, and her claim that it was his was based on the witch doctor's arbitrary reading.</p><br/><p>It was as if there were two different people arguing within his mind. One of them maintained the view that the child was not his and that it wasn't wrong for him to kill her for leaving a mark of eternal shame on him that will last his whole life.</p><br/><p>The other kept doubting himself. She's only a barbarian woman who had lost her husband, and without a child, she wouldn't have any status within the tribe when she gets old. No matter who she does it with or how she forced me to do it with her, she only did it to have a child for herself. What's wrong about that?! She only wanted a child for herself! I shouldn't have killed a poor widow like her! All she wanted was a child...</p><br/><p>Leaning on the headboard of his bed, Lorist couldn't help but tremble while sweating profusely.</p><br/><p>\"Locke? What's wrong?\" asked Telesti who was sleeping beside him.</p><br/><p>\"Nothing, I just had a nightmare,\" Lorist said as he lowered his head and gave Telesti a kiss on her forehead. \"I'm going to start training my swordplay soon. You should get more sleep since you're pregnant right now. Take better care of your health, alright?\"</p><br/><p>\"Okay...\" Telesti mumbled before she turned and fell back into deep sleep.</p><br/><p>Lorist made a bitter smile and thought, this must be my punishment. When Lorist returned to the dominion, he heard that when he was being assassinated by Blademaster Zarinan, the fainted Telesti was discovered to be pregnant one month later. At that time, Lorist's whereabouts was still unknown, causing her much pain and worry. Every moment she thought of Lorist, her face would be covered in tears. It was so bad for her that she almost had a miscarriage.</p><br/><p>By the time Lorist returned to the dominion, the pregnant Telesti who was also emotionally sensitive was especially insistent on staying by Lorist's side, and he also treated her with utmost care and even agreed to her request that the child she was bearing would also inherit the name of her adopted family, Nico, instead of being registered as a member of the Norton Family.</p><br/><p>At the same time, every time Lorist saw Telesti's bloated belly, he would recall the pregnant thick-lipped barbarian whom he killed and even dream about her dying words only to wake up shocked and sweaty.</p><br/><p>Perhaps, I was wrong and shouldn't have killed that barbarian woman. While Lorist was a little regretful for his actions, he had felt incredible shame when he heard the woman say that she was pregnant with his child back then. With the desire of killing her being fostered throughout the time when she forcefully bedded him, Lorist only knew how to react by feeling anger from the pain and humiliation he suffered, causing him to take up his sword from the fire pit and pierce it into her chest without a second thought.</p><br/><p>It was only when he had killed her that Lorist snapped out of his wild fervor and realized that he had just taken a human life, no, two human lives. And that child she bore could possibly be his. That's why he slumped into a blank stupor by the grave marker of that woman after he buried her.</p><br/><p>I can't continue like this, Lorist thought as he rubbed his face. Removing his sleeping robe and changing into his normal attire, Lorist left his bedroom and took his sword with him before heading downstairs. I should do something to keep myself occupied and forget this matter as soon as possible. Since it has already happened, there's no point for me to continue wailing like this in regret. If I continue to have nightmares like this, it won't be surprising if I eventually lose my mind.</p><br/><p>......</p><br/><p>Back then, Lorist's journey home with Reidy was a rather smooth-sailing one. In fact, they actually bumped into a few guards who were looking for them. Upon seeing Lorist and Reidy returning safe and sound, those guards who had searched painstakingly for three months let out loud cheers of joy.</p><br/><p>The ones who led the guards were Gold ranked knight Belnick and Els, who both welcomed Lorist and Reidy into the main tent with tears of joy streaming down their faces. After that, they informed Lorist about the situation of the family during his three months of absence.</p><br/><p>Upon knowing that Lorist had suffered an assassination attempt by a Blademaster, as well as the injuries sufferd by Gold ranked knights Josk and Potterfang, the four Gold ranked knights, namely, Fiercetiger Loze, Freiyar, Malek and Belnick, headed to the assassination site immediately and began to search for Lorist and Reidy. When they realized that the two couldn't be located and had possibly fallen down to the river below, they had a meeting with Charade, Terman and the others and decided jointly to hide news of Lorist's disappearance from the three allied families. At the same time, they sent a battalion of 500 men to Maplewoods Bastide to ensure the safety of Irina and her son.</p><br/><p>\"Milord,\" Belnick said embarrassedly, \"During the meetings, we also discussed that if something bad truly happened to you, we would let the young master inherit the position of the Norton Family head and give him authority over the family after he is raised until the age of 18...\"</p><br/><p>Lorist nodded and said, \"It's alright, I can understand that. You guys have planned for this quite thoroughly. How are Josk and Potterfang doing?\"</p><br/><p>Belnick replied, \"Knight Josk's injuries are rather light and they pose no restriction to him at the moment. A few days ago, he even said that he wanted to join the search for you. Knight Potterfang on the other hand is more badly injured and has to rest bedridden for at least two more months. Blademaster Zarinan had managed to make a deep cut from his left shoulder to his chest and Potterfang almost couldn't be saved. That fellow Fiercetiger Loze was incredibly pissed and kept saying that he wanted to go to Windbury City to capture the Second Prince to avenge you, but he was stopped from doing so by Knight Charade.\"</p><br/><p>Els added, \"At that time, Charade told Loze that our priority was to find you first and that revenge won't happen right away, managing to stop Loze from pursuing the matter temporarily. We have already been searching around the wildlands for three whole months and were just about to give up hope. Thankfully for the protection of War God Singwa, you returned to us safe and sound, milord.\"</p><br/><p>Lorist suddenly recalled something important and asked, \"What is the date today?\"</p><br/><p>Els replied, \"It's the 19th day of the 2nd month of Year 1772 of the Common Grindian Calendar.\"</p><br/><p>\"Then was there a magical beast wave within our dominion during winter?\" Lorist asked.</p><br/><p>Belnick and Els laughed out and Els said, \"Milord, are you still worried about the magical beast wave? It's already gone. During last winter, only a couple of magical bulls arrived at Hidebull Mound and even then, they were blocked from entering the dominion by the wall stretching all the way from Tortoise Hill. We mobilized the family forces and killed all the bulls in one go. However, I heard that recently, the number of magical wolves beneath the walls was increasing and the patrolling soldiers complained that the howls were too noisy for them to bear.\"</p><br/><p>As the magical beast wave that had plagued the family had truly been exterminated, Lorist let out a breath of relief for the successful resolution of that huge problem. After he returned to the camp of the guards who were searching for him, he made his way back to the dominion after spending a night there.</p><br/><p>When he arrived at the dominion, he received news about Telesti's pregnancy and judging by the time, the child should've been conceived during the 10th month of the previous year when he went to Bladedge Mountains to bring Telesti back to Firmrock Castle. After he heard that she almost had a miscarriage from her grief, Lorist hurriedly went to comfort her and had been stuck with her ever since. He was also constantly reminded of the barbarian woman he killed when he saw Telesti's belly and was haunted by the nightmares frequently.</p><br/><p>......</p><br/><p>During the meeting held a few days ago, Lorist discussed his experience of the assassination attempt by the Second Prince's Blademaster and expressed his condolences for the family knights and soldiers who had sacrificed themselves heroically. After receiving requests from some within the family to take revenge, Lorist appointed Loze as the head of three pike cavalry brigades and two heavy infantry brigades with Malek as his vice along with two carroballista brigades and the light cavalry scouts led by Yuriy to capture the Second Prince, effectively sending up to 24000 soldiers to Windbury City.</p><br/><p>The next thing Lorist discussed during the meeting was the reinitiation of the development of Blackmud Marsh as well as the development of the dominion formerly belonging to Count Spenseid that was renamed the Salus Settlement. Within the next two years, he would prioritize settling down the commoners. If they were able to successfully develop the Felicitas Settlement and the Salus Settlement into the main food providers of the dominion, only then will the Norton Family have a stable footing on their path to prosperity.</p><br/><p>Apart from that, another high priority project was the construction of the shipyard. So far, the intersection point between Bladedge Mountains and Blackmud Marsh, which was a shallow swamp, had been filled in and made into level ground. With the path heading to the highlands near Blackmud Marsh already available, the next step was to expand the area of the highlands by carrying out land reclamation on the shallower areas by the coast. It was estimated that the reclaimed land would be enough for a small port for ships to stop within as soon as next year.</p><br/><p>Lorist requested Old Man Balk to begin the construction of the shipyard right away alongside the construction of the port instead of delaying it until the port to be completed so that they could learn to build smaller ships in the meantime. He hoped that the Norton Family would be able to set sail on the seas as soon as possible that way.</p><br/><p>As for Gold ranked knight Freiyar, he was tasked by Lorist to handle the formation of the navy and said that he would rather having the trained soldiers wait for the completion of the ships than beginning training only after the ships were completed. If they begin training after the shipyard's completion, that would be a little too late. Lorist believed that he had to first have a batch of navy marines ready so that they could set sail right away.</p><br/><p>......</p><br/><p>After Lorist trained for an hour or so, he saw Howard waiting outside the gate and asked curiously, \"Weren't you taking care of your father? Why have you come back here?\"</p><br/><p>Howard said, \"Father said that I'm your attendant, milord, and I have to be by your side at all times. His injuries will recover completely in another month and he can already make some slight movements, so he won't need me to take care of him all the time anymore.\"</p><br/><p>Lorist agreed with that assessment as he had visited Potterfang two days ago and saw that he was indeed recovering well.</p><br/><p>After pondering for a while, he asked Howard, \"How many days has it been since Fiercetiger Loze and Malek left?\"</p><br/><p>\"They left two days ago and will arrive at the Hendliff Suspension Bridge in another six days. From there, they will launch their attack on Winston Province and will be able to reach Windbury City in roughly 15 days.\" Howard understood the geography of the land well and was quite accurate at estimating the traveling speed of the family forces.</p><br/><p>After stroking his chin in thought, Lorist decided that he would leave the pregnant Telesti alone for now and said, \"Howard, after I have lunch with Telesti later, you'll act like you've received an urgent letter sent by Baron Shazin and Baron Felim that calls for my presence at Gildusk City to meet up with them to discuss the deployment of soldiers to the capital, understand?\"</p><br/><p>Stunned, Howard retreated warily and asked, \"Milord, what are you planning?\"</p><br/><p>\"Nothing, really. I only want some time for myself. Dumb child, just listen to what I say and I will bring you with me to the royal capital of Windbury City for a trip. Otherwise, the two of us will be staying here and won't be able to go anywhere else,\" Lorist rebuked.</p><br/><p>After deliberating for a while, Howard agreed and said, \"Then you have to promise me that you won't leave me behind. I also want to go there with you to get to know the place.\"</p><br/><p>......</p><br/><p>While Telesti didn't suspect Howard's lie at all, she cried out sadly at the thought of Lorist leaving her for somewhere far away. Lorist tried hard to console her for days and said, \"My dear, even if you don't care about your health, you have to think about the little Nico that's in your belly. Don't worry, I'm not going to war or anything, I'm just going to meet those two idiot barons. It's not dangerous at all and I'll return quickly. At most, it will take up to 20 days or a month.\"</p><br/><p>Howard clicked his tongue and thought, ah, milord's lying again... It will take at least one month or more for our trip to Windbury City...</p><br/><p>After expending a lot of effort to finally calm Telesti down, Lorist sighed as he exited the door and said, \"Howard, you should remember this well. The more intelligent a woman is, the more troublesome she will be, especially when she's pregnant when she will be more emotionally sensitive than usual. You should learn from my example and not get in a relationship with a female scholar in the future...\"</p><br/><p>Howard merely looked at Lorist with a distasteful expression.</p><br/><p>Els, Patt and Reidy had long received word of Lorist's plan to leave and had already prepared the guard brigade to accompany him.</p><br/><p>Lorist said, \"Patt, bring a few guards with you to take Blademaster Zarinan's body with us. Fiercetiger Loze and Malek forgot to bring it with them when they left a few days ago. We will bring this cursed old man's body to Windbury City and let everyone know that the Blademaster sent by the Second Prince was killed by our family forces. With the corpse of the Blademaster, let it be known that others who side with the Second Prince and has hostile intentions towards the Norton Family will end up like the Blademaster!\"</p><br/><p>\"Long live the Nortons!\" cheered the guards after hearing Lorist's speech.</p><br/><p>Howard thought as he cheered, great, milord has also come up with a good excuse to head to Windbury City...</p><br/>\n</div>"}