{"title": "Chapter 214 Royal Capital", "id": 214, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-214-royal-capital", "volume_title": "Volume 3", "body": "<h1>Chapter 214 Royal Capital</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Royal Capital</p><br/><p>Hey guys, sorry the first regular chapter of the week came later than usual. The lack of a win10 delete confirmation dialog actually caused me to accidentally some of my own notepad archives of previous translations and they were gone when I cleared my cluttered recycle bin. Fortunately I was able to restore it through manually copying from online backups of different formats, but it took some time to get things back into order.</p><br/><p>Important note: Some people might find the language I've used in this chapter a little offensive, and there's even a TL note I inserted at the part where it begins. Feel free to suggest better ways of stating what I stated without being too offensive if I did a bad job at it and I will change it.</p><br/><p>On the 4th day of the 5th month of Year 1772, the Norton Family of the Northlands suddenly deployed 24000 elite family soldiers to encircle the Royal Capital of the Iblia Kingdom, Windbury City. They declared that the reason for that was to capture the king of the Iblia Kingdom, the Second Prince Iblia of the former Krissen Empire, for his underhanded actions of sending a Blademaster on an assassination attempt against the leader of the Norton Family, Count Norton, who had been entitled by the Andinaq Royal Family.</p><br/><p>The regiment of soldiers defending the city discarded their weapons and surrendered wisely, mainly because of the disparity of their forces against the Norton's with every one of them knowing that they had no odds of success to begin with. Additionally, the garrison forces of the city were far too weak compared to the Norton Family forces, and it was especially apparent when the 1000 or so carroballistas were pushed near the city walls, causing all the garrison soldiers to lose any hope of defending the city altogether.</p><br/><p>Lastly, the garrison force's leader made his decision after the Gold ranked knight, Fiercetiger Loze, gave his ultimatum. According to Loze, if the garrison soldiers don't give up all resistance, the forces of the Norton Family will not let the family members of the soldiers off even if they die in battle. He advised the soldiers who decided to resist to take their family members' well-being into consideration.</p><br/><p>After the Norton Family forces entered the city and strictly forbade any traffic into or out of it, the Second Prince who was hiding within the Rose Palace heard about the commotion. It was as if a lightning bolt had crashed down on him during a sunny day. He was already incredibly worried about how Blademaster Zarinan still hadn't returned yet and felt a bad omen welling up in his heart. Despite that, he still believed that his teacher wouldn't lose since he was a quasi-Sword Saint. At most, he was probably just injured after the assassination attempt and was resting up somewhere else.</p><br/><p>But little did the Second Prince expect that as he waited impatiently for the Blademaster's return while paying attention to any rumors of misfortune befalling the leader of the Norton Family, the Norton Family forces began their attack on the royal capital. The Second Prince was so greatly shocked that he killed the maidservant who had delivered the news to him and stripped her bare to put her clothes on himself and secretly left the Rose Palace while crossdressing to head to the commoners' ghetto.</p><br/><p>Hiding among the poor commoners was indeed a rather good idea as the Second Prince understood that the soldiers of nobles weren't interested in the dirt poor commoners and usually swept the business area of the city clean first before going for the middle-class citizens and other rich nobles within the city. But the Second Prince underestimated how 'morally bankrupt' the forces of the Norton Family were as they took not only the money and resources but also considered the lowly commoners to be a great resource to develop the Northlands with. As long as the commoners receive their farmland and settle down nicely at the dominion, they would turn into one of the most loyal defenders of the Norton Family.</p><br/><p>Even so, the crossdressing Second Prince's mustache drew much attention to him, but the Norton Family soldiers did not recognize the king of the Iblia Kingdom and were only mildly curious about the crossdressing man. Some of them believed him to be some kind of pervert while some gay soldiers wondered if the crossdressing Second Prince was someone with similar inclinations... (Translator's note: Please tell me if the language I'm using here is offensive or not. I apologize in advance if it offends anyone and will gladly change it if any of you have some suggestions. As much as I don't want to cast people of any demographic in a bad light, it is against my translation principles to censor the work by explicitly removing all reference to the author's original wording, so it would be helpful if any of you know of a better way to describe these terms than how I did it.)</p><br/><p>At that moment, a few Norton Family soldiers with an unhealthy enthusiasm for conducting searches even prepared to feel the Second Prince up to see if he did indeed have any balls, with some of the gay soldiers jumping excitedly, wanting to do the same, and were ready to bring the Second Prince to 'interact' in the nearby cabin. Faced with the thought of his rear orifice possibly being compromised, the Second Prince finally caved and loudly declared himself to be the king of the Iblia Kingdom and requested to be treated accordingly.</p><br/><p>But nobody paid any heed to what he had to say and only focused on his fair and unblemished skin that was a consequence of his pampered lifestyle. To some of the sexually excited soldiers, the Second Prince was practically a gift from heaven! These ravenous family soldiers seemed to stare at the Second Prince with glowing-red eyes and disregarded what he had to say entirely. It was only after they had released their pent up desires that they bothered to listen to the gasping Second Prince who still insisted he was the king.</p><br/><p>The Second Prince was then brought before Loze and Malek in that state. After getting a few other nobles to confirm the identity of the naked Second Prince whose backside was still mildly bleeding, the usually loud Loze was completely speechless and could do nothing but look for a few herbalists to give the Second Prince some treatment.</p><br/><p>After getting word that the Norton Family forces invaded Windbury City, the two Frontier Legion cavalry divisions stationed at Pedro City made their move under the order of Viscount Kristoph and arrived at Windbury City three days later, trapping the Norton Family within the city.</p><br/><p>Viscount Kristoph was still rather clear-headed as he didn't launch an assault on the royal capital right away and only used the better mobility of his troops to keep the Norton Family forces stranded within it. While he wasn't confident that his two divisions would be able to take on the forces of the Norton Family in an all out battle, Viscount Kristoph was assured that he would be able to stop the Norton Family forces from leaving with all the wealth and resources of the royal capital.</p><br/><p>Five days passed without confrontation, but Viscount Kristoph was not impatient in the least. To him, the longer it dragged on, the better it would be for him. Firstly, he understood that the food supply within the royal capital was limited with most of the food of Winston Province within the hands of the noble families. He believed that when the food within the city runs out, the Norton Family forces would no doubt crumble and he would be able to obtain victory easily. Secondly, he had already sent a messenger to Duke Fisablen and the duke himself would be leading two other cavalry divisions over in another five to six days. That way, the Norton Family won't be able to retreat even if they wanted to like a turtle trapped within an urn.</p><br/><p>But Viscount Kristoph didn't expect that on the next day itself, the Norton Family forces mobilized an entire army as if they were preparing for an open field battle. The viscount thus positioned one cavalry division directly facing the Norton Family forces with another at its flank in preparation to intercept the Norton forces before engaging their flank with the true aim of harassing and slowing down the enemy's progress.</p><br/><p>But then, the blaring of the horn made Viscount Kristoph realize that his two cavalry divisions were the ones that had fallen into a trap. As the soldiers closed in on each other on the battlefield, the two cavalry divisions were eventually encircled and pushed into a tight corner outside the walls of Windbury City by the forces of the Norton Family, the Shazin Family and the Felim Family that numbered almost 50000 soldiers.</p><br/><p>Seeing that his cavalry divisions had been forced into a corner by the forces of the three families of the Northlands, sealing off their attacking capability in the process, the viscount ordered his men to begin digging trenches on the battlefield. This time around, he understood that he was in deep trouble as he had already lost the perk of mobility that allowed the cavalry soldiers to soar to their utmost battle potential. To make a path of survival for himself, Viscount Kristoph decided to to lead the charges himself. But all three of this surprise attempts were shut down completely by the incessant longbow and carroballista fire, causing him to have no choice to retreat with his forces having suffered huge casualties.</p><br/><p>Looking at his soldiers who had lost all morale, Viscount Kristoph made yet another decision. He stepped on the battlefield alone with sword in hand and requested a duel, with the request that if he won, he hoped that the three families of the Northlands will allow the remaining 14000 plus soldiers of his to leave while he would be willing to submit to the three families and accept whatever treatment. However, if he lost the duel, he would order his cavalry soldiers to surrender unconditionally.</p><br/><p>Even though Hennard and Baron Felim expressed their vehement objections, Lorist still agreed to Viscount Kristoph's request and decided to take the viscount on himself.</p><br/><p>Viscount Kristoph who was a rank 1 Blademaster quickly realized with despair that he wasn't a match for the young count of the Norton Family, whose swordplay was cold as winter, which caused him to feel as if he had been tossed into a land filled with snow. Lorist's sword strikes were like ephemeral snowflakes that were able to enter the smallest gap in one's defenses. Even though they looked light and weightless, when the viscount's sword clashed against Lorist's, he felt as if he was being pushed back by the great earth itself. He finally believed the rumors about how Blademaster Zarinan failed his mission and was killed himself despite being sent to assassinate Count Norton.</p><br/><p>Viscount Kristoph who had painstakingly withstood more than 200 strikes eventually had his sword knocked away by Lorist, causing him to disheartenedly order his soldiers to surrender without resistance. The remaining 14000 cavalrymen complied with the order and became the prisoners of war of the Norton Family.</p><br/><p>After the defeat of the two cavalry divisions that were causing Lorist quite some concern, he kept his promise and ordered his two carroballista brigades to help the Shazin and Felim families sweep clean the castles and estates of the other nobles in the Winston Province. Lorist insisted that they prioritize taking food as only with it can the dominion truly be stable. He said that the Norton Family would be willing to buy the food the two families took at two times the market price.</p><br/><p>After entering the royal capital, the first thing Lorist did was to check out the Second Prince who was walking with his lower body exposed. That was the first time the two of them met face to face and after Lorist heard about his encounters, he lost control of his laughter and said that the Second Prince had it coming for him as this was all his own fault in the first place. Lorist didn't care about the cold, venomous gaze the Second Prince gave him. The Second Prince spat on the ground and left without a single word.</p><br/><p>During his occupation of Windbury City, Lorist made a few orders that many found to be weird. Firstly, he still paid his respects to the queen of the Iblia Kingdom who stayed within the Rose Palace and even ordered his guards to keep the place safe and secure. Secondly, apart from the few food stores belonging to the royal family, Lorist didn't touch any of the assets of the other nobles or tycoons within the city and didn't even make a single threat.</p><br/><p>Thirdly, the Norton Family also didn't engage in any large-scale moving of the commoners and only brought away a few tens of thousands of poor commoner work smiths from the commoner area of the city, causing some of the nobles to sigh in relief, as the Norton Family was willing to 'do them a favor' to move the poor commoners out of the city for them, which many of the nobles considered praiseworthy.</p><br/><p>The only part of Lorist that dissatisfied the nobles within Windbury City was their perception of his short-sightedness from how he held his grudges deeply. Lorist erected a tall pillar in the central plaza of the royal capital and installed the crucifix bearing Blademaster Zarinan's corpse upon it with the reason that the Blademaster listened to the Second Prince's order and attempted to underhandedly assassinate the leader of the Norton Family. That caused the nobles who once felt pride in having a rank 3 Blademaster protecting their city to feel gravely insulted and humiliated.</p><br/><p>On the 19th day of the 5th month, Duke Fisablen who was leading two more cavalry divisions as reinforcements received word that Viscount Kristoph had already been taken captive. After hearing about how two of his other cavalry divisions had been completely wiped out, the duke stayed at Sunset Lake Town which was 50 kilometers from Windbury City and no longer pressed forward. Instead, he even set up a defense line and sent a messenger to the royal capital to meet Lorist.</p><br/><p>When Lorist met the messenger, he expressed that he had no intention at all to exterminate the Iblia Kingdom and said that the reason for his actions was his personal grudge with the Second Prince, as was apparent from his polite treatment towards the other nobles of the royal capital without the slightest ill inflicted upon them. After that, he brought the messenger to meet with the queen who was staying at the Rose Palace and the messenger confirmed that she was indeed the daughter of Duke Fisablen. The queen of the Iblia Kingdom still lived as freely as ever and wasn't the slightest affected by the events of the prior days. She still had the mood to invite the other nobles within the city to grand balls and parties to make merry.</p><br/><p>Despite that, Lorist rejected two requests the messenger made. The first concerned the payment of ransom for the release of Viscount Kristoph and the 14000 plus soldiers. Lorist said that Duke Fisablen should only begin to negotiate for their release after the forces of the Norton Family makes its way back to the dominion since it was rather inappropriate to hold such discussions at the moment given that the military campaign was still ongoing.</p><br/><p>The second request concerned the fate of the Second Prince. Lorist insisted that he would not agree to releasing the Second Prince but promised that he would only imprison him without letting any harm come to him since he doesn't want the Norton Family to be tainted by the reputation of a king killer. As for the lack of a king for the Iblia Kingdom, Lorist stated that it was not his problem to worry about as he was only a count of the Andinaq Kingdom and that he wouldn't interfere with the official affairs of the Iblia Kingdom since he only bore a personal grudge against the Second Prince.</p><br/><p>The messenger was flabbergasted as he had never heard such shameless reasons ever before throughout his whole career. When he broke out of his stupor, he said that everything about the Iblia Kingdom directly concerned Lorist, from the matter with Duke Loggins all the way to the Second Prince himself.</p><br/><p>Lorist on the other hand argued against it by citing that the Norton Family had carried out its duty to protect the northern borders of the empire without any intention of partaking in the political affairs during times of war. However, the Duke of the Northlands and the Second Prince overestimated their abilities and instigated the conflict themselves, causing the Norton Family to have no choice but to retaliate. But arguing like that with the messenger was to no end and there was no real need for them to waste their breaths on semantics.</p><br/><p>As for the matter of the Iblia Kingdom's vacant throne, Lorist suggested that the queen's son who was staying at Duke Fisablen's be made king after the forces of the Norton Family retreat from Windbury City. That way, Duke Fisablen himself could use the ascension to make himself a regent for the young king and take control of the Iblia Kingdom entirely. He also added that as long as Duke Fisablen didn't mess with the four families of the Northlands, they could no doubt have a peaceful relationship.</p><br/><p>After the messenger left, Lorist stayed within Windbury City for a little more than ten days before he led his forces back to the Northlands. Baron Felim and Baron Shazin on the other hand returned with a haul full of stolen goods and practically swept clean almost two-thirds of the whole Winston Province. The endless chain of carriages carrying food, wealth and other resources was so long that it almost seemed like a flowing river. Apart from those, they even forced up to 200000 commoners mostly belonging to the nobles of the Winston Province to move into the Northlands with them.</p><br/><p>One day after the Norton Family left the royal capital, Duke Fisablen led his soldiers to retake Windbury City. Two months after the three families of the Northlands moved their newfound resources and commoners back to the Northlands, the duke who had just taken control of the city could no longer withstand the incessant bickering of the nobles there and casually gave the right to rule to his own daughter, the queen of the Iblia Kingdom, before hurrying back to the Eastwild Province.</p><br/><p>This time around, the three families of the Northlands truly made a big haul from razing the Winston Province. Apart from the gains reaped from Windbury City that belonged solely to the Norton Family, the rest of the pillaged resources and citizens who were moved were divided equally among the three families. Lorist gave the responsibility of looking after the commoners and their loot to Malek and Fiercetiger Loze before he left by himself to head to Firmrock Castle ahead of the others because Telesti was about to give birth.</p><br/>\n</div>"}