{"title": "Chapter 213 Analysis", "id": 213, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-213-analysis", "volume_title": "Volume 3", "body": "<h1>Chapter 213 Analysis</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Analysis</p><br/><p>This fourth bonus chapter of the week was also brought to you by Tyler L. of the USA! See you guys next week and enjoy the read!</p><br/><p>When Baron Shazin and Baron Felim got the report from their messengers, they thought that something was off. A few days ago, the Norton Family forces passed through their territory to head towards the royal capital of Windbury City to capture the Second Prince. Right after that, they got word that Lorist wanted to meet with them and wondered what was up.</p><br/><p>However, that didn't stop them from welcoming Lorist's arrival. But when the two barons saw the corpse of Blademaster Zarinan nailed upon a crucifix, they were stunned speechless.</p><br/><p>This time around, Lorist came within a four-wheeled carriage upon which the crucifix was installed and had Blademaster Zarinan's corpse nailed upon it so that it could be paraded around as he traveled. Since the Blademaster's corpse had already been embalmed, it wouldn't rot within the next two to three months.</p><br/><p>\"Locke, it's a little too excessive for you to be doing this, right? After all, he's a rank 3 Blademaster and is even considered to be a quasi-Sword Saint. Nailing his body on the crucifix is a little in bad taste...\" Baron Felim said as he looked at the body.</p><br/><p>\"Chack, I've never treated him as a Blademaster. He's but a lowly assassin that was sent to kill me. Since he can disregard his reputation as a Blademaster and sink so low to carry out an assassination, I can naturally treat him as a common assassin since he failed,\" Lorist said disdainfully. Baron Felim's full name was Felim Chalvode, and Chack was his nickname.</p><br/><p>\"I heard your family forces suffered huge losses, right?\" Baron Shazin asked. He had seen Blademaster Zarinan twice before and knew that his abilities far exceeded those of Blademaster Louinse. It was said that Louinse wouldn't be able to last more than 100 strikes when fighting against Zarinan. Additionally, when Baron Shazin was still serving as a Gold ranked knight of Duke Loggins, he had been toyed with by Blademaster Louinse twice when they sparred and could only endure the anger he felt at him, so he can only imagine how much stronger Blademaster Zarinan could be.</p><br/><p>Lorist sighed deeply before he said, \"This old fellow killed up to 500 of my good men and 11 Silver ranked family knights. Even Potterfang and Josk were injured heavily and I had to heal for two months myself. That's why I've decided to no longer let the Second Prince off on this matter. I nailed the old guy on the crucifix so that I can spread the word about how the Second Prince actually used an underhanded method like assassination against me by employing a Blademaster so that everyone else can see that he isn't fit to be king. That way, even if I capture him, the Norton Family won't be considered to be rebelling against a royal family.\"</p><br/><p>\"So what if you capture him? The reputation of a king-killer is definitely not something you want to bear...\" Baron Felim said worryingly, with good reason. Even if the Second Prince did not deserve to be a king, he was still technically one and in Grindia, killing a king brought no good reputation to a noble family.</p><br/><p>\"It's fine. I will first imprison him for a period of time and send him to be judged by the Second Highness of the Andinaq Kingdom since his family is the rightful successor to the Krissen Imperial Family. This is their family matter,\" Lorist explained his decision, to which the two barons thumbs-upped in agreement.</p><br/><p>\"This method of yours is savage. Not only does it leave nothing to be criticized, it also allows you to get your revenge. The Andinaq Royal Family hates the Second Prince to the bone because if the Second Prince and his associates did not raise the banner of rebellion, the great empire wouldn't have perished and shattered just like that. If the Second Prince falls into their hands, it would already be considered humane if he was simply hanged to death,\" praised Baron Felim.</p><br/><p>Baron Shazin pointed at the corpse of the Blademaster and asked, \"Locke, are you going to march into Windbury City just like that? Do you need any help from us?\"</p><br/><p>Lorist sighed and said, \"Hennard, Chack, you idiots... The reason I'm here is to ask you to mobilize your forces...\"</p><br/><p>Baron Shazin's full name was Shazin Hennard and he had no other nickname. Before this, he used to be one of the five Gold ranked knights serving Duke Loggins and even led a military campaign against the Norton Family. Ever since he was captured by Lorist, his fate took a completely different turn.</p><br/><p>Baron Shazin was stunned by what he heard and asked, \"Why do you need us to do that?\"</p><br/><p>\"Didn't you three other families say that my forces swept the land barren without leaving even a single commoner for you to take? I'm presenting a huge opportunity to you guys now yet you're still unable to see it... What can I say about you? During this excursion of my family to capture the Second Prince, do you think anyone within the Winston Province can stop our advances? What are you doing sitting and watching by the sidelines instead of reaping some benefits for yourselves?! Send your soldiers to raze the place you idiots! People, money and food, they're all up for the taking!\" Lorist exclaimed with an annoyed look.</p><br/><p>\"Ugh...\" Baron Felim had already understood Lorist's intentions. But with a face blushing with embarrassment, he said, \"Locke, it's not that we don't want to mobilize our forces... It's...\"</p><br/><p>\"It's alright. I understand your concerns. You're just worried about the two Frontier Legions stationed at Pedro City, right? I heard that you sustained some losses the last two times you sent your soldiers to the Winston Province,\" Lorist said with a laugh. After that, he waved to Howard and said, \"Howard, bring me the map of the Iblia Kingdom.\"</p><br/><p>\"He's called Howard and is also my disciple like Reidy. His father is Potterfang, which the two of you should be acquainted with. Right now, he has just awakened his Battle Force and is accompanying me as an attendant, so look after him for me, alright?\" Lorist said as he introduced Howard to the two other barons.</p><br/><p>\"That's a given,\" said the two barons in unison. Hennard even took out a jeweled sword and gave it to Howard as a meeting gift.</p><br/><p>As Baron Felim himself didn't have anything fitting to give, he started suggesting that Howard and his illegitimate daughter meet up sometime. He praised his daughter to the heavens and said that she was not only beautiful but also obedient. And given their similar age, with her being 15 that year, one year younger than Howard, the baron thought they would be a good fit. Even though she was only the baron's illegitimate daughter, she was also included in the registry of the Felim Family.</p><br/><p>The more he got to know Howard, the more Baron Felim liked him. In stark contrast to the rough and quiet Reidy, Howard looked more refined and had an intelligent and calm aura. As Baron Felim had been looking for a suitable husband for his beloved daughter, he found Howard to be the ideal candidate, given his Gold ranked knight father and his status as Lorist's personal disciple. With his looks and charisma being better than most, Howard's future was sure to be a bright one and the baron felt that having his daughter marrying Howard would be a great idea.</p><br/><p>Howard himself was dumbstruck by that as he didn't expect to be introduced a wife just because he was asked to fetch a map. He so embarrassed by Baron Felim's actions that his face was completely reddened as he panicked on how he should respond. In the end, Lorist saved him from the predicament and said, \"Alright, Chack, finding a son-in-law is not an urgent matter. Perhaps you would want to discuss this with Potterfang when we finish things over here since Howard and your daughter are still young. If both of you agree, then maybe we can let them be engaged first. It won't be too late to officiate their marriage when they reach 20.\"</p><br/><p>Baron Felim said, \"She's not that young. When my daughter was born, her mother was only 16...\"</p><br/><p>Hennard and Lorist both shoved a middle finger in Baron Felim's face as they both thought that it was far too predatory of him to lay his hands on a 15-year-old girl, causing him to be completely speechless.</p><br/><p>Lorist then proceeded to spread the map of the Iblia Kingdom open before tapping on the two provinces belonging to Duke Fisablen and said, \"Duke Fisablen was originally the second son of a viscount from the Wild Husbandry Province. After that, he joined the army and was promoted to be the commander of the Frontier Legion for his stellar military achievements and at that time, the Frontier Legion was one of the largest cavalry armies set up to defend the northeastern plains of the empire from the grassland barbarians with a force numbering up to 25000 soldiers. When Duke Fisablen became the leader of that legion, he expanded it greatly and gained a huge victory over the grassland barbarians around 34 years ago, allowing the empire to establish the Eastwild Province, earning himself the rank of the duke in the process. The Eastwild Province was also made the hereditary dominion of the Fisablen Family.</p><br/><p>\"Given that the Frontier Legion had around 78000 soldiers, rivaling the army of the empire itself, the duke was always under strong suspicion from the central powers of the empire. As such, the duke could only focus his efforts on managing the Eastwild Province and the Wild Husbandry Province to protect his own family. During the civil war of the empire, the Second Prince went to the Eastwild Province to see Duke Fisablen and subsequently took his daughter's hand in marriage, thus securing the support of the Fisablen Family for himself and cementing the foundations of the Iblia Kingdom.</p><br/><p>\"After the formation of the Iblia Kingdom, the Second Prince paid no heed to the livelihood of his subjects and stubbornly sent his soldiers to attack the Melein Duchy, but was eventually defeated at the hands of the Fiercegale Legion of the Melein Duchy. Not only did the Second Prince suffer a huge loss, the battles also completely ravaged his Southern Province. Under such circumstances, the Second Prince borrowed three divisions of cavalry troops and took the opportunity to cause trouble when our northbound convoy and the Andinaq Kingdom were marching through the Madras Duchy. In the name of defending the Madras Duchy from the invasion of the Andinaq Kingdom, the Second Prince used his forces to swallow up the the Madras Duchy's Delamock Province.</p><br/><p>\"However, he didn't expect that the whole situation would take a completely different turn when Duke Madras signed a peace treaty with the Andinaq Kingdom all the while he turned against the Second Prince and defeated his troops at the battle at Kobo City. Having no choice but to retreat from Delamock Province, the Second Prince took the chance to occupy the dominion of the Duke of the Northlands after my family defeated Duke Loggins.</p><br/><p>\"Only after occupying the dominion of the duke did the Second Prince have some territory under his direct control. That's also why he left the Iblia Kingdom's Southern Province, which is to say, the three southern commanderies, and the Winston Province where the royal capital of Windbury was, uncared for. That's because the three commanderies were already a wasteland and to recover it was to put in lots of funding and effort to resist the attacks of the Melein Duchy's soldiers. To the Second Prince, that was not a worthwhile endeavor, hence his willingness to leave the provinces be.</p><br/><p>\"Additionally, within the Winston Province, apart from Windbury City, the rest of the land belonging to the Second Prince had long been sold away, and the lack of his own land there prevented him from raising an army. That's why after he took over the duke's dominion, he stayed there without returning to the royal capital and used the food and resources he took from the Delamock Province to form the First Legion of the Iblia Kingdom before he jumped right back into the game of war and domination.</p><br/><p>\"But what the Second Prince shouldn't have done was to anger us, the Norton Family, ultimately causing all his efforts to go to waste. He had to run all the way back to the royal capital with tens of guards and even sent his Blademaster to assassinate me. How truly shameless of him.</p><br/><p>\"Judging by how Duke Fisablen stationed his Frontier Legion, he must've already filled up the vacancy left by the three cavalry troop divisions he lent the Second Prince. Right now, the Frontier Legion should have a full 78000 soldiers with 43000 of them stationed in the Eastwild Province alone.</p><br/><p>\"Duke Fisablen also stationed two cavalry divisions at the border between the Eastwild Province and the Wild Husbandry Province and another division at Eastriver Citadel as the main force to resist the attacks of the grassland barbarian hordes. Additionally, there's also another division of soldiers stationed at the border of Eastwild Province and Southern Province. The moment the forces of Duke Melein invades the three southern commanderies, the cavalry divisions would be able to react immediately to defend against the invasion before more reinforcements arrive.</p><br/><p>\"Even though the Second Prince was willing to leave the Southern Province and Winston Province unattended, Duke Fisablen definitely wasn't. If the two provinces get conquered by an enemy, then the Wild Husbandry Province and the Eastwild Province will be under threat from both sides, and that would spell the beginning of the end of the Fisablen Family. But the most laughable part was that even though the Second Prince didn't care for the two provinces at all, he still refused to hand control of them over to the duke. It is apparent that he distrusts his father-in-law greatly. Otherwise, the Iblia Kingdom would've been far more stable even if the Second Prince was a puppet ruler.</p><br/><p>\"The soldiers Duke Fisablen stationed at the Wild Husbandry Province numbering around 35000 was led by the duke's adopted son and Blademaster, Viscount Kristoph. Given that the Wild Husbandry Province wasn't the main site of conflict with the grassland barbarians, only one cavalry division was stationed there at the border of Eastwild Province which also serves as reserve troops just in case reinforcements are needed. The remaining 25000 men was instead stationed at Pedro City within the Winston Province. The moment word of conflict within the Winston Province breaks out, the two cavalry divisions stationed at Pedro City will take immediate action and be able to reach any location in the Winston Province in five short days.</p><br/><p>\"By the way, I heard that the two of you suffered some losses from the cavalry divisions stationed there during your last two attacks, right?\" Lorist ended his long-winded explanation by asking the two barons his question with a smile.</p><br/><p>Baron Felim nodded with his face flushed red and said, \"The first time my family sent the troops there, we encircled a bastide manor and began our siege. But after four days when victory was almost ours, we got ambushed in the middle of the night. Only half of our 2500 soldiers returned alive.\"</p><br/><p>Hennard added with a tone of dissatisfaction, \"The second time around, I sent out my soldiers as well along with Chack and managed to conquer two dominions. Just as we were about to continue, we encountered the two Frontier Legion cavalry divisions. Our combined forces number 15000 men and theirs being around 20000, and we weren't worried about facing them in an open field battle. But they resorted to hit and run tactics by assaulting our camps and destroying our supply lines, using the mobility of the cavalry troops to their utmost advantage to harass us, forcing us to have to retreat. After that, we saw that our supply lines weren't able to keep up with us, so we had to abandon our spoils and return as quickly as possible without any gains. That attempt alone cost us two families up to 3000 troops...\"</p><br/><p>Baron Felim added hatefully, \"Even though our two families did manage to cause them around 3000 casualties, both attempts ended in our failure and that's why we gave up on attacking Winston Province. If we don't solve the issue of the two cavalry divisions at Pedro City, then we will not be able to enter Winston Province as we please.\"</p><br/><p>Lorist clapped his hands as he exclaimed, \"That's exactly it! This time, I have come here to discuss with you on how to get the pain in the neck out of your way. The Norton Family will be mobilizing 24000 soldiers to head to the royal capital to capture the Second Prince and I believe the two cavalry divisions there will make their move the moment they receive the news. As long as we are able to catch the two cavalry divisions by surprise and defeat them, Winston Province will be free for us to roam and we can take whatever we want.\"</p><br/><p>\"Alright, I'm in. I'm going to rally my troops now,\" Hennard said.</p><br/><p>\"Wait a second,\" Lorist said. \"This time around, we're facing off against the cavalry divisions of the Frontier Legion that specializes in mobility. I'm sure that you've seen my forces. Apart from the carroballista units, the rest of them are all cavalry troops. Originally, I wanted to move as quickly as possible as I hoped that we can arrive at the royal capital before the enemy is able to react, allowing us to capture the Second Prince without any sort of warning. Additionally, we can also retreat without being harassed by the two Frontier Legion cavalry divisions.</p><br/><p>\"However, during the past two days, I have a feeling that I should just exterminate those two legions in one go. That way, not only can I stand up for the two of you, I can also show Duke Fisablen that the four families of the Northlands is not something that should be messed with. Two days ago, I received a letter from that Kenmays fellow and he said that the sale of salt to the Wild Husbandry Province got into some trouble. So, I want to teach Duke Fisablen a lesson and show him our might.\"</p><br/><p>\"Alright then. I'll send out 8000 cavalrymen and all of them are my elite troops armed with new equipment,\" said Baron Felim as he made his decision. His total troops numbered 15000 and the 8000 cavalrymen among them were already considered experienced veterans.</p><br/><p>Hennard gave it some thought before he said, \"Then I'll send out 12000, all of whom are also fitted with new equipment. The only thing is I don't have that many cavalry soldiers...\"</p><br/><p>Even though Hennard had reorganized the original Northland Army into a force of 24000, he only had one division of cavalry troops.</p><br/><p>\"Alright, that makes 20000 troops. We only have to wait here another two days. I've already ordered my family's knight brigade and one carroballista brigade to rush over here. Coupled with the 2000 guards I have with me, we will have a total of 28000 soldiers. By that time, we will trap the cavalry divisions of the Frontier Legion and bash them up. They will not be able to escape even with their increased mobility. Also, you guys should send out more scouts to secretly take note of the movements at Pedro City. As long as the cavalry divisions make their move, we will follow straight behind and let them have a taste of being ambushed,\" Lorist decided.</p><br/>\n</div>"}