{"title": "Chapter 224 Hector", "id": 224, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-224-hector", "volume_title": "Volume 3", "body": "<h1>Chapter 224 Hector</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hector</p><br/><p>Hey guys, second regular chapter of the week coming your way. Enjoy the read.</p><br/><p>\"Mi-milord, Viscount Aslan is indeed the tax collector sent by the Second Highness...\" Old Hugo muttered as he stared at Viscount Aslan being dragged out of the building. Not long after, cries of pain and ear-cracking whipping sounds could be heard, followed by the cheers of the onlookers.</p><br/><p>He didn't understand why that young dominion lord, Count Norton, dared to treat the Second Highness's tax collector like that without any hesitation. Either he was inexperienced or he truly knew what he was doing and didn't have a single care for Second Highness Auguslo who was at the peak of his position and feared like a tiger by all the other nobles of the Andinaq Kingdom.</p><br/><p>Either way, Old Hugo was worried that the young dominion lord would incur the wrath of the Second Highness and cause 'the innocent fish of the pond to perish along with the city fire'. Even though Grindia didn't have the exact saying per se, there were similar idioms that carried the same meaning. Old Hugo was worried that Count Norton would just run off and leave the people of Whitebird Town to suffer the consequences.</p><br/><p>\"Hehe, Old Hugo, don't worry. I have my own reasons and thoughts for treating Viscount Aslan like this,\" Lorist said with a smile to the old man. \"As you have spent most of your life in the army, so you might not understand the traditions and customs between nobles and don't know the responsibilities of a tax collector. In actuality, as the mayor of a town within the Norton Family dominion, you have right to refuse unreasonable taxation unless you were specifically ordered otherwise by a dominion lord like me.</p><br/><p>\"A tax collection officer's responsibilities include collecting the taxes from the various areas under the jurisdiction of the royal family and stopping corruption and tax evasion. To dominion lords, their authority only concerns inspecting the economical situation of their dominions and collect any due taxes from us as a tribute for the royal family. They have no authority at all to increase tax rates and must definitely gain the approval of a dominion lord like me first before they do anything. As he dared to introduce more taxes and increase the main tax of Whitebird Town, is he treating our dominion like the territory belonging to the royal family? That act of his has already infringed upon the honor of the Norton Family and that goes against the customs regarding the interaction between a senior and junior nobles. Even if I hang him, the royal family won't be able to do anything about it.</p><br/><p>\"In a few days, I will bring this viscount to the Second Highness and ask him whether his actions are carried out per his orders. I will make sure that the Second Highness personally orders this dogshit viscount to be hanged, and he will, unless he intends to offend all the other nobles by violating our sacred customs by protecting the viscount. No matter what, this viscount is definitely a goner.</p><br/><p>\"You might not understand the behavior of the nobles well enough, and I don't blame you for that since you only served in the army before. The more you tolerate their selfishness, the more ridiculous they will act. Like today, this viscount even dared to bring soldiers into Whitebird Town. Since he didn't gain permission from me to do so, that can be considered a declaration of war. That's why I definitely won't let this slide. Don't worry, if the sky falls, the Norton Family will be here to bear it for you.</p><br/><p>\"For now, just call your subordinates over here to make some introductions. This is the chief knight of our family, Charade. Everything concerning the administration of Silowas Island will be temporarily his responsibility.\"</p><br/><p>\"Alright, dominion lord. I will call them over right now.\" Since Lorist was so confident, Old Hugo could only keep his worries to himself and call the rest over.</p><br/><p>In a few moments, Old Hugo returned with five other people.</p><br/><p>\"Dominion lord, this is Old Mike, my accountant. He had worked for 20 years for the Carey Merchant Guild in the imperial capital and only came back to his hometown here after it closed down.\"</p><br/><p>Old Mike was an old man with balding white hair even though he only looked around 54. It was probably because he taxed his mind so often as an accountant that his hair fell that quickly.</p><br/><p>The next person was a 49-year-old skinny, tall man. He stepped forward and introduced himself, \"Dominion lord, I am Kriston, the security official of Whitebird Town.\"</p><br/><p>Old Hugo added, \"Dominion lord, Kriston here used to work as an undercover inspector for the security bureau of the former empire and he has handled all sorts of cases. His wife is a Whitebird Town local, so he settled here after the empire broke apart.\"</p><br/><p>Lorist nodded and made a mental note on Kriston. Even though the family set up various patrol forces within the towns it controlled, the forces can at most handle small cases like drunk people getting into brawls and still lack the ability to properly investigate and crack criminal cases. As the dominion continues to develop, the population will increase as well and it will require a lot more people and procedures to maintain order.</p><br/><p>The third man who stood forward was a red-faced old man. Old Hugo said, \"Dominion lord, this here is Old Hart and he has been the tax collection official for Whitebird Town all this time. During his forty plus years on the post, he has gotten to know almost everyone on Silowas Island.\"</p><br/><p>The fourth person was the limping garrison captain Victor and he reported, \"Dominion lord, the soldiers are already settled down and I stationed a squad of garrison troops to keep watch on them.\"</p><br/><p>The last person was a pale-faced youth who should be around five to six years older than Lorist. He stepped forward, bowed respectfully, and said, \"Dominion lord, I am Hector, the main secretary of Whitebird Town. I'd like to add that your treatment of Viscount Aslan is a little rash. Are you not worried about the vengeance of the Aslan Family?\"</p><br/><p>\"The vengeance of the Aslan Family?\" Lorist said as he laughed out loud. \"Well, tell me more about what you understand of the situation at hand.\"</p><br/><p>\"Dominion lord, even though Viscount Aslan is only an honorary noble, his brother Count Aslan is a proper landed noble. Additionally, the Aslan Family is one of the first to side with the Second Highness and they are well-trusted by him. Not only is Count Aslan a Gold ranked knight, he is also the commander who rebuilt the Royal Family's Second Local Defense Legion and his family holds great power and influence. This is why even though I knew clearly that Viscount Aslan's requests were excessive, I could only advise Old Hugo to endure it. After all, your family hasn't had any contact with us back then and I was worried that Old Hugo would be put to death if he dared to resist. In fact, a few other accusations could be made on Old Hugo for being a mayor picked by the townsfolk without the official sanction of the ruling family...\"</p><br/><p>Hector paused for a while before he continued, \"Dominion lord, I'm actually quite uninformed about the might of the Norton Family. But I've heard rumors that five years back, your family's northbound convoy helped the Second Highness out tons, but the original dominion of the Norton Family is really too far away. The Second Highness also holds a really high position in the kingdom nowadays and has built himself six legions with up to 300000 soldiers to prepare for the reunification of the former empire. At this crucial time, if you, dominion lord, think that you can rely on previous favors and friendship to avoid repercussion for your actions, I'm afraid that the Second Highness wouldn't be too pleased with this. I believe the case of Viscount Aslan's treatment should be given more serious consideration.\"</p><br/><p>Charade laughed out loud and said, \"Hector, I hope you can understand one thing. The Norton Family is not relying on anything like favor or friendship, but our own might. Milord has his own reasons for treating Viscount Aslan the way he did. However, I am interested in what you said about the Second Highness's six legions of 300000 soldiers. Can you tell me more about that in detail?\"</p><br/><p>\"You are...?\" Hector muttered as he gave Lorist a weird look. That knight that just spoke up only wears a Silver ranked badge and isn't even a Gold ranked knight. How can he interject so casually like that?</p><br/><p>\"This is Chief Knight Charade of our family. He will be in charge of all affairs concerning Silowas Island,\" introduced Lorist once more.</p><br/><p>\"Oh...\" Hector said as he suppressed his curiosity and nodded in acknowledgement to Charade. \"Sir Knight, I don't really know too much myself, but during these past two years when I dealt with the fish merchants, I heard a lot of rumors about the Second Highness. Five years back, after the Second Highness went to war with the Redlis Kingdom and the Madras Duchy, he reformed the various legions of the Royal Family's Local Defense Army. After disbanding the Fiercegale Legion, he organized the Local Defense Army into three separate units each with up to 56000 soldiers. After that, he formed three other Reserve Legions each with 42000 soldiers and another 5000-strong Royal Knight Brigade.</p><br/><p>\"According to my understanding, the taxes that all the nobles have to hand to the royal family has increased to 30 percent with the territory belonging to the royal family themselves charging up to 70 percent. All the wealth gained through the increased taxes will go towards funding these six legions. The Second Highness even announced that he hopes that the people of the Krissen Empire whether they be nobles or commoners endure for the next few years, and promised that he would make up to them for it after unifying the empire...\"</p><br/><p>Lorist couldn't help but laugh out loud and pat on Howard's shoulder uncontrollably. \"Howard, did you hear that?! This is the epitome of alpha-strike mentality! The Second Highness wants to replicate the achievements of the first Krissen Founding Emperor, Krissen I, and is ready to use his 300000 soldiers to unify the empire. But it's a shame that he forgot that times have changed. Right now, he's alone in his effort and if he fails, he will no longer be able to retaliate and the Andinaq Kingdom will end at that time.\"</p><br/><p>\"Milord, even you are doubtful of the chances of the Second Highness's war plans?\" Hector asked.</p><br/><p>\"I'm not just doubtful. I am completely certain that the Second Highness's plan to unify the empire has zero chance of success. Putting other things aside, in the time of the first Krissen emperor, it was the warring-states period and each kingdom was akin to a modern-day barony. Krissen I's 300000-strong army naturally was able to sweep the floor with his enemies and even if tens of kingdoms unite together to resist, they wouldn't even stand a chance against the army's assault. It must be noted that at that time, the most elite force of a kingdom was lesser than 100 men, so how would they even stand a chance?</p><br/><p>\"But now? Even you were able to find out about the Second Highness's movements through mere rumors from merchants, so the nations at the border would definitely be keeping their guards up as well. Even if the Second Highness manages to conquer a few cities, he would suffer heavy casualties. And if he bumps against a foe that has a clear mind and is able to manipulate his enemies well and can stop the Second Highness's army from obtaining the necessary supplies, if the Second Highness continues to stubbornly persist in his struggle, how long can the poor commoners of the Andinaq Kingdom last? I suspect that the kingdom would collapse even before half of the 3000000-strong army is eliminated...\"</p><br/><p>Howard looked to be in deep thought. Charade asked, \"What I'm curious about is this... The Second Highness and the Redlis Kingdom as well as the Madras Duchy signed a ceasefire for 5 years, but it's already expired. Since he already has an army of 300000 prepared, why isn't he taking the opportunity to start the battle for unification right away? Isn't he letting this chance go? The longer he waits, the more the Madras Duchy and the Redlis Kingdom will be able to build up their defenses...\"</p><br/><p>Hector said, \"Perhaps, I know the reason to that. A while ago I heard the merchants say that the Third Prince's sickness is getting rather bad and he doesn't have much longer to live. The Second Highness might just be waiting for his father to pass on first before launching the battle of unification. I'm guessing that it's because he wants to be crowned the monarch after the unification. If the Third Prince doesn't die, the crown has little chance on falling on the Second Highness's head...\"</p><br/><p>\"Hehe, he's blinded by his lust for power,\" Lorist commented.</p><br/><p>At that moment, Jim and Els entered with smiles on their faces and said, \"Milord, we have completed your orders and Viscount Aslan's body has been covered with fish glue and feathers. Right now, he looks completely like a weird bird being tied up on the wooden structure by us.\"</p><br/><p>\"Alright,\" Lorist said while nodding. \"Old Hugo, how many people did you say are at Seaview Manor?\"</p><br/><p>\"I'm not too sure about this myself, but judging by the number of guards there, I'd say around 100 or so is there,\" Old Hugo replied after giving it some thought.</p><br/><p>\"Josk, Freiyar, the two of you shall bring Els and the other guards and sailors for a trip there and bring everyone at the manor over here. Anyone who resists shall be killed without quest-- Actually, try your best to catch as many alive as possible. I suddenly feel that we will be needing much manpower over here for many things,\" Lorist said in a frustrated tone.</p><br/><p>\"Milord, will you be fine here after we leave?\" Freiyar expressed his worries.</p><br/><p>\"It's alright. It's not like you guys don't know my abilities. It'll be enough for me to have Knight Charade and Howard here. Also, Victor, bring 100 men from your garrison force over there as well,\" Lorist instructed.</p><br/><p>\"Dominion lord, the Whitebird Town Garrison isn't equipped with even leather armor and are barely armed with only a pike each man. How can we even stand a chance against the fully-armed guards of the manor? We can't do anything about that,\" said Victor as he refused Lorist's order.</p><br/><p>\"I'm not asking you guys to go on a suicide mission and don't need the garrison soldiers to attack the manor. Just leave that to my family soldiers. The reason I asked you go there is because you know the terrain better and will be able to stop anyone from escaping. Other than that, you just need to bring along some rope to tie up the prisoners with. If the attack doesn't work out, I will allow the garrison soldiers to retreat first,\" Lorist said as he met Victor's gaze.</p><br/><p>Convinced, Victor said, \"Alright, dominion lord. I will gather my men right now. I hope our excursion will not be for naught.\"</p><br/><p>\"Milord,\" Freiyar said as he stepped forward. He pointed to the map of Silowas Island on the table and said, \"After taking Seaview Manor, should we attack and conquer that Farama Village as well?\"</p><br/><p>Lorist shook his head and said, \"There's no need. We are a little short on time, so all you have to do is to attack Seaview Manor and capture the nobles and others that are there. I will be waiting to deal with those insolent idiots tonight. As for Farama Village, I will bring you guys along with me there tomorrow. Nobody in our dominion will be allowed to go unpunished after challenging the Norton Family. They didn't pay their taxes for five whole years? Very well....\"</p><br/><p>\"Alright, milord. Then we will leave right away,\" Freiyar said before bowing to Lorist with the rest and leaving the building.</p><br/><p>\"Dominion lord, if they really make that trip, then we won't only be offending the Aslan Family. You should know that after the Second Highness left the island, the ones who remained at Seaview Manor are the descendants of some of his noble attendants. They can at most be considered to be causing mischief like all youngsters do. If you really punish them seriously, then you will be considered to not be giving the Second Highness any face and will also be offending the other noble attendants of the Second Highness,\" Hector warned hurriedly.</p><br/><p>\"Hehe, he's quite an interesting fellow,\" said Lorist to Charade. \"He doesn't understand that we only bother to give the Second Highness face because he is our senior noble and we've never once feared the might or power of the Second Highness. As long as others don't offend us, we won't cross them either. But since someone is knowingly causing trouble, then our only response will be blood and fire. Charade, this guy is a talented fellow. Don't let him continue working as a mere secretary, let him stay by your side to train instead.\"</p><br/><p>\"Yes, milord. I already know what to do with him,\" Charade replied.</p><br/><p>\"Good, then I'll leave this place to you. You should research more about the situation of Silowas Island, Whitebird Town and the other villages here and think of how we can develop this dominion. After our forces return in a few days, we will head straight for the imperial capital, so go get on with your work. Howard, let's go take a walk.\"</p><br/><p>\"Alright, milord!\" said Howard gleefully.</p><br/>\n</div>"}