{"title": "Chapter 225 Whitebird Restaurant", "id": 225, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-225-whitebird-restaurant", "volume_title": "Volume 3", "body": "<h1>Chapter 225 Whitebird Restaurant</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Whitebird Restaurant</p><br/><p>Here's the first bonus chapter of the week courtesy of Josh S. from the UK. Thank you so much for the support.</p><br/><p>There was once again hundreds of people gathered at the plaza, but this time around all of them were there to look at the feather-covered Viscount Aslan. Lorist didn't bother to join in the commotion and merely brought Howard to a small alley and looked at the sights of Whitebird Town in a casual manner.</p><br/><p>The road they walked on was made up of huge rocks with cobblestones squeezed in between with various houses and buildings built from clay lining its sides. Even though the structures didn't have a uniform outlook, they looked rather clean and there wasn't any trash to be seen all around. The two sides of the alley were lined by the walls of the buildings and from time to time, fish racks could be seen with some fish placed upon it and left to dry. The breeze brought with it a slight fishy smell.</p><br/><p>The alley was quiet and curvy. After a while of walking, they reached the end of the road and had to turn into another path within the town. That path was wider than the alley before it and could even allow carriages to pass through. On one side of the road was the tideland with some plants growing on it. The tide had already receded that time and tens of people carrying something on their backs and picking stuff up on the tideland could be seen. The adults walked barefoot with their pants rolled up and used the wooden sticks in their hands to poke around the muddy ground while the children ran around and played naked.</p><br/><p>\"Master, this place is so different from the Northlands. The sights here are so pretty,\" Howard said.</p><br/><p>Lorist looked into the distance and replied, \"This is an island after all and it is very different from the Northlands. The Northlands are mostly desolate with the skies high up and the clouds thin. But this place on the other hand is like a pearl in the middle of the sea with wide skies and blue seawater; it is indeed a great place. It's a shame that Second Highness Auguslo doesn't have an eye for these things and didn't know about the value of this place when he was here and even abandoned it to us for an incredibly low price. How laughable...\"</p><br/><p>Howard tilted his head in confusion and asked, \"Master, why do you think so? Transport to and from Silowas Island is inconvenient and its farmable area is also rather small. I feel that the Second Highness made the right choice to abandon this place and left for the imperial capital.\"</p><br/><p>\"It's about perspective, Howard. You must change yours. Farmable land is not the most important cornerstone of a nation or family's might. I've told you before that the main expenditure of war is manpower and resources. The present is really different from hundreds of years ago when one knight and his few attendants could dictate the tide of war. Battles on the scales of tens of thousands are no longer new on the continent of Grindia, and that's why I don't approve of the Second Highness's preparation to reunite the empire with his 300000 plus troops.</p><br/><p>\"The Andinaq Kingdom currently has six provinces and the Second Highness has used up almost one whole province to feed his soldiers. They're only barely hanging on just by relying on the local produce and you've also heard that the tax rate of the territory of the royal family has been raised to 70 percent, which can already be considered tyrannical. If this goes on, the commoners will definitely not be able to hold on. No matter what grand excuse the Second Highness uses, that doesn't change the fact that he's barely sitting still on the sides of the volcano.</p><br/><p>\"You'll understand it right away after looking at the map. Silowas Island is actually the central hub of this region of the sea and controlling this island is akin to controlling the thousands of kilometers of shores nearby. From an offensive standpoint, we can attack the Andinaq Kingdom as well as the Redlis Kingdom's coastal province s. From a defensive standpoint, we only have to retreat back to Silowas Island and there's nothing the enemy can do about us. Naturally, our family will first require a strong fleet.</p><br/><p>\"That is only the military considerations. Howard, think, what will happen if we convert Silowas Island into a central trading hub?\" Lorist asked.</p><br/><p>Howard thought for a bit and replied, \"Just like the offensive standpoint, our family can ship the salt we produce to the coastal provinces and trade it with money or other required resources. Even if we don't have enough farmland on this island, we can still trade for huge amounts of food for our use, is that right, master?\"</p><br/><p>\"You're half correct. Our family still needs to form a strong fleet first. If we can have full dominion over the waters from this island to the Northlands, we can use Silowas Island as a starting point for our merchant vessels to travel to any other coastal city on the continent of Grindia. As long as trading continues, money will continue to flow to us and our family's might will also increase. That's why I feel that the Second Highness made an idiotic decision to give up on this island. All he has in his mind are outdated ideas,\" Lorist insulted.</p><br/><p>\"Master, I feel that you've been getting more and more confident in the recent days. Just like Knight Josk said, you're starting to have a more domineering aura and is starting to feel more like an actual dominion lord,\" Howard praised.</p><br/><p>Patting on his disciple's head, Lorist said, \"Oh, your ass-kissing skills have improved... Howard, you must remember this well. Confidence must come from the might of the family. The stronger the family is, the more you can back your confidence up with. In the case of Viscount Aslan's treatment, we can afford to not give the Second Highness any face. While he can instill fear in other nobles with his 300000-strong army, it is useless against us because we understand that even if we end on pissing the Second Highness off, he can't do anything about us given our might.</p><br/><p>\"Think about it. A few years ago when we were still leading the convoy back to the dominion, could we have imagined that a day like this would come? At that time, don't even talk about the Second Highness's 300000-strong army, what about that Count Cor-something? His force of around 10000 soldiers was enough to make us jump with worry. But during the past few years we stayed put within the dominion to development it like a turtle withdrawing into its shell, the Duke of the Northlands, Duke Loggins, and the Second Prince thought that we've become a ripe persimmon that can be squeezed for juice. Right now however, Duke Loggins is already ill and bedridden and doesn't have long to live and the Second Prince just became our prisoner.</p><br/><p>\"The reason we don't use the same alpha-strike mentality is because even if we occupy huge amounts of territory, without developing them, they would not provide any benefit for us. Just like right now, even if our family forces were to be wiped out, the family can still form a second one, and perhaps even a third. It is because we have this foundation that we don't fear our enemies. Development is the only correct way, understood?\"</p><br/><p>\"Development is the only correct way? Master, this saying is a little of a mouthful, but I guess it does make sense. When I heard that the Second Highness had a force of 300000 soldiers, I didn't even feel any dread at all. I guess you're right that our family's might allowed me to not be bothered at hearing about the 300000 troops,\" Howard said as he nodded, before his stomach grumbled.</p><br/><p>Lorist snickered and said, \"Kid, you should've said so if you were hungry. Come on, let's find a place to grab something to eat. I already forgot about eating after we got off the ship and getting so busy...\"</p><br/><p>Past the corner ahead was a wooden, brown plaque which had a picture of a white bird with the words 'Whitebird Restaurant' engraved upon it.</p><br/><p>\"I didn't think that a small town like this would have a restaurant. I thought that sailors would usually frequent inns or taverns for food and drink. Let's go check it out,\" Lorist said.</p><br/><p>The restaurant wasn't that big and it was obvious that the wall dividing the living hall and the dining hall was knocked down for more space. Six small square tables could be seen with each of them covered with a linen cloth with blue boxy patterns and had small baskets placed on them with bunches of wild flowers within. While the small restaurant was rather simple, it was unusually clean.</p><br/><p>It was currently around three in the afternoon and only two tables by the walls were seated by other guests. One red-nosed, fat old man saw Lorist and Howard enter and was dumbstruck, before he said, \"Hey, look who's here? Isn't that the dominion lord who just arrived at our Silowas Island? I didn't think that the dominion lord himself would come to a small restaurant like ours...\"</p><br/><p>The red-nosed man's whole face was slightly flushed red, probably because he had drunk quite a bit of alcohol. Lorist didn't mind his crude manner of speech and instead nodded to the other customers before smiling and saying, \"Even though I am indeed the dominion lord, I have to eat and sleep too. Is there anything wrong with me coming to a restaurant when I'm hungry?\"</p><br/><p>After he said that, he found a table and sat down before waving for Howard to come over as he asked, \"May I know how I can order food over here?\"</p><br/><p>That red-nosed man looked at Lorist for a good while before he shouted towards the stairwell, \"Nataya, there's a customer here! You won't imagine it... The dominion lord is here for a meal! Also, don't let little Martha come downstairs... Dominion lords are all fiendish perverts and he'll definitely take Martha away if he sees her...\"</p><br/><p>Howard was enraged by that comment and was just about to thump on the table and curse at the old man, but he saw Lorist smile and shake his head. Lorist said, \"Don't you think that old man is rather cute? He made us aware of the presence of a pretty girl by asking her to stay upstairs...\"</p><br/><p>A stocky woman hurriedly came over and bowed to Lorist with respect before she asked, \"Milord, what do you wish to order?\"</p><br/><p>\"Is there something you can serve right away?\"</p><br/><p>\"Milord, we have some steamed bread, meatballs, sausages, smoked fish and some grilled food along with seaweed soup, conches, crabs, breaded and fried small crabs, loaches, mashed potatoes, baked apples and seafood pie....\"</p><br/><p>\"Then I'll have a seafood pie, meatballs, steamed bread, smoked fish and two servings of seaweed soup. And give me one of those breaded crabs or something. I'd like to give it a try. Also, what drinks do you serve here?\" Lorist asked.</p><br/><p>\"Milord, we only have our self-brewed fruit wine here and it tastes rather good.\"</p><br/><p>\"Then I'll have that too, and some fresh fruit if you have some.\"</p><br/><p>\"Alright, milord. Please wait a while, I'll start serving the dishes right away,\" said the stocky middle-aged woman before she hurriedly left.</p><br/><p>It didn't take long for Lorist and Howard to be able to take a look at the beauty Martha. She was only around 17 to 18 years of age and she had long, chestnut-brown hair with large, grey eyes and some freckles beside her nose, giving her a rather energetic and rowdy feel. Paired with her fair skin and slender figure, Lorist rated her 80 out of 100 points.</p><br/><p>Martha was there to serve the dishes and she gave each of them a brief introduction. Lorist was surprised that the food served by a small restaurant like that would taste that good and focused on eating without caring much for staring at the beauty. In the end, the dish Lorist liked the most was the fried breaded small crabs. The crabs were first washed before being dipped into some batter and bread crumbs and deep fried until they become golden brown in color. Each bite off the crab let out a satisfying crunch and its brittle shell only served to enhance the mouthfeel. Paired with the sweet and sour fruit wine, the crab tasted magnificent and Lorist ordered two more servings after finishing the first until he was satisfied.</p><br/><p>\"The food you served were all really delicious. Sum it all up and tell me how much they cost,\" Lorist said to the beautiful Martha with a satisfied tone as he wiped his mouth with a white linen cloth.</p><br/><p>\"Milord, your presence here is already bestowing us an incredible honor. This meal's on the house as our welcoming treat to you, milord,\" said the bowing stocky woman from behind Martha.</p><br/><p>\"Hehe, forget it. I'm a dominion lord but I won't eat anything for free,\" Lorist said as he took out a large silver coin and paced it on the table. \"Is this enough?\"</p><br/><p>\"Oh, no, milord... This is too much. Your food didn't cost more than 3 small silvers...\"</p><br/><p>One gold Forde was worth 20 large silver and each large silver was equal to 5 small silvers.</p><br/><p>\"Keep the change as your tip. Howard, give them three more gold Fordes, we'll be ordering 70 people's worth of food later tonight. There's a ship called Flying Fish of Dawn at the port and I'll have you send over 21 meals there, with the remaining ones sent to the administration building of the town. If there's any money left over, I'll use it to buy some of your self-brewed wine. Also, after you finish cooking the meals, notify us at the administration building and I'll send some garrison soldiers to help you transport the food,\" Lorist instructed.</p><br/><p>The stocky woman stared at the three gold Fordes and one large silver on the table in a daze before she nodded hesitantly. \"Alright, milord. I will do as you say.\"</p><br/><p>After filling up their stomachs, the two of them strolled about the town once more and quite a number of strangers bowed to Lorist when they recognized him and Lorist greeted them back with a warm and friendly smile.</p><br/><p>It was only after his facial muscles were sore from all the smiling that he decided to head back to the administration building. The sky was already turning dark. Freiyar and the rest were back with the troops and a busy commotion could be seen right in front of the administration building. Apart from a huge group of onlookers, there were another 400 or so men and women who had both their hands tied behind their backs, kneeling on the ground.</p><br/><p>\"Milord, we've returned with the rest of the people from Seaview Manor and left only a squad of ten sailors there to watch the place,\" reported Freiyar who was standing at the entrance of the building.</p><br/><p>\"How were the casualties?\" Lorist asked.</p><br/><p>\"Milord, we didn't sustain any casualties, but some of the guards at the manor resisted capture and after we killed some of them, the rest attempted to escape, only to be stopped by Patt and Els. In the end, we killed 27 of their guards and not one of the eight nobles who occupied the manor managed to escape. They've all been captured by us.\"</p><br/><p>\"Who are these people tied up over here?\"</p><br/><p>\"Milord, these are all the servants and maidservants of the manor. Didn't you ask us to bring everyone here? We've done just that,\" Freiyar replied.</p><br/><p>\"Ugh...\" Lorist grunted as he patted his forehead. He didn't think that those nobles would actually treat the Seaview Manor as their own home and brought so many of their servants there.</p><br/><p>\"Why are the ones watching the place our sailors? What about the garrison soldiers?\" Lorist asked as he wondered why he couldn't see even a single garrison soldier with them. Did the 100 or so soldiers leave the moment a fight began?</p><br/><p>\"Oh, they went back for dinner and said that they would switch out with another group after finishing,\" explained Els.</p><br/><p>I guess that's fine, Lorist thought while stroking his chin.</p><br/><p>\"Milord, we've worked for the whole day and only had something at the Seaview Manor to fill up our stomachs. What do we do about dinner?\" Patt said as he walked over with his armor still bloodied. It was said that the last resisting guard was cut into two halves by him.</p><br/><p>\"I've already ordered food from a restaurant nearby. I think it's about time they sent it over,\" Lorist said as he looked at the darkening sky.</p><br/><p>\"Milord, there's a woman who says that the food is done and is asking us to go collect it,\" reported a guard, right as the food was mentioned.</p><br/><p>\"Alright, I'll go. I'm already dying of hunger,\" Patt said as he turned and walked away.</p><br/><p>After that, a loud shriek could be heard, startling everyone present.</p><br/><p>When Lorist went over, he saw the beauty Martha sitting on the ground crying, with Patt troubled and not knowing what to do.</p><br/><p>\"What's going on?\"</p><br/><p>Seeing Lorist there, Martha suppressed her cries embarrassedly and explained in a stuttered voice that she was shocked by Patt's bloodied look and how he walked towards her with a fierce and murderous aura.</p><br/><p>After resolving the misunderstanding, Lorist sent Patt with some other guards to follow Martha to collect the food and asked him to clean his armor off at the restaurant. After that, Lorist entered the administration building and heard a voice screaming out when he opened the door. \"You actually dared to attack us... The Reid Family will definitely not forgive you for this! This is a declaration of war against our family!\"</p><br/><p>Lorist entered with a gloomy look and said, \"What the heck are you doing? I heard that their families are rather strong? Heed my orders, have the loudest one caned 100 times with the rest given 50 canes and leave them hanging for one night. Remember to use more force. I don't mind even if they end up dying.\"</p><br/><p>The few guards present quickly hauled the loudest brat outside before cries of agony and pain rang out.</p><br/><p>\"Knight Charade, did you become soft after staying in the family dominion for the past few years? The title you got at the Andinaq Kingdom, 'Charade the Demon', doesn't fit you at all!\" said Lorist strictly.</p><br/><p>\"Milord, I only wanted to ask him who instructed them to occupy the manor in our dominion,\" said Charade while shrugging helplessly.</p><br/><p>\"Did you even need to ask? Seeing that they brought so many servants and guards with them, it's obvious that their family leader was the one who did all this. They took advantage of the fact that our dominion is far away and thought that we wouldn't be able to manage this place. It's enough if we know which family is behind it. We'll settle the bill with them when we reach the imperial capital.</p><br/><p>\"Also, Knight Charade, screen the rest of the people outside and we'll move into Seaview Manor tomorrow before we bring some troops to give Farama Village a visit. We must squeeze the pus out of the wound to make it recover faster,\" Lorist said.</p><br/>\n</div>"}