{"title": "Chapter 235 Discussion", "id": 235, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-235-discussion", "volume_title": "Volume 3", "body": "<h1>Chapter 235 Discussion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Discussion</p><br/><p>Here's the first bonus chapter of the week, courtesy of Joshua L. from the USA. Enjoy the read!</p><br/><p>Lorist did not currently live at Whitebird Town. According to the development plan Charade drafted, the whole of Whitebird Town would be shifted 1000 or so meters to the east. The original location of the town would be further developed into a proper port,true defensive walls. At the moment, Whitebird Town was far too close to the jetty for the Norton family’s plans. They wanted to turn the place into a central maritime transfer point. It would, however, require that the port be expanded. The temporary wooden jetty also had to be exchanged for a stone one.</p><br/><p>Charade's plan involved building up the residential and business areas of the new Whitebird Town, before moving the townsfolk over, after which the old houses would be demolished. These steps had to be completed before the expansion of the port could proceed, including the construction of the walls and defensive fortifications. As a result, Lorist could only stay within a temporary log house located at an ad-hoc army camp near the town.</p><br/><p>\"Agh... That hurts! Let go, Glacia! I'm Count Norton, the leader of the family! I order you to let go!\"</p><br/><p>The moment Lorist returned to his room, his ear was given a harsh pinch by Glacia.</p><br/><p>\"I'm currently educating you as your cousin. That has nothing to do with your status as count or family leader,\" Glacia said.</p><br/><p>How does that even work?!</p><br/><p>Lorist looked around, stunned, before he shouted, \"You guys, scram! What are you looking at? Don't tell me you've never seen an elder sister teaching her little brother a lesson? Howard, you stay. Make my beloved cousin a pot of macks.\"</p><br/><p>After that, Els, Josk and the rest left the house, chuckling. It was not everyday that they got to see Lorist get the short end of the stick. The matter would almost undoubtedly be spread around the grapevine of the soldiers who had nothing better to do in their free time.</p><br/><p>\"That's enough, sis. It's about time you let go. Sheesh, you didn't give me any face at all even though I was in front of my knights... I'm already an adult, and you're also not the snotty blonde lass from before. Act your age,\" Lorist said.</p><br/><p>\"You were the snotty brat, not me. Let's not forget that you were quite the crybaby too. I still remember that you would cry out almost instantly whenever I pinched you like that,\" Glacia said as she loosened her pinch on Lorist's ear, \"Even though the family dominion was within the desolate Northlands, the days when we lived at the bastide was fun. I still remember that I would visit the family dominion every summer with my parents. My mom definitely wasn't too keen on those trips. The distance we had to travel was too great. Each trip would take us at least two months...\"</p><br/><p>\"Well, it's definitely much better right now; we've built a port at the family dominion. It'll only take around ten days for us to travel from there to Silowas Island,\" Lorist said.</p><br/><p>\"Tell me, Locke... What have you done after you took the position of family leader? What changes have there been in the dominion?\" Glacia asked.</p><br/><p>Lorist began to describe the occurrences and changes within the family dominion of the past few years, such as the new family mausoleum at Whitedeer Mound, the resistance the family put up against the magical beast wave, the construction of Firmrock Castle, the development of the Felicitas and Salus settlements, the defeat of the Second Prince, as well as the alliance formed between the Nortons and the other three great families within the Northlands.</p><br/><p>Glacia looked a little down as she muttered, \"I really want to go back to the dominion to take a look... A dozen of years have passed just like that...\"</p><br/><p>\"The family will always welcome you, Glacia. Oh, I almost forgot about the main issue. Tell me frankly, is the Second Highness going to deal with the Norton family next?\" Lorist asked as he poured a cup of macks and handed it to Glacia.</p><br/><p>Glacia glanced at Lorist from the corner of her eyes and said, \"Why, aren't you a bold one... The moment I returned to the imperial capital, I heard of your heroic exploits... From beheading Viscount Aslan to defeating Blademaster Climonto at the banquet His Highness had organized for your sake... You truly didn't even bother to consider his standing, did you? Had it not been for the fact that you brought the Second Prince before him, greatly contributing to the kingdom, His Highness would've turned on you right away.</p><br/><p>\"ANd before I’d even had enough time to digest what I heard, I heard about your defeat of 7500 elite soldier from the Royal family’s Local defense Force. And that with only 500 family soldier no less! You even managed to kill Count Aslan, and left his head impaled on a branch at the coast as a show of might to us. You're really over the top... I already don't know what I should say to you, my little cousin. You're too different a person from what you used to be in your childhood...\"</p><br/><p>Lorist snickered before he said humbly, \"People always change. That aside, I'm no way as mighty as you have praised me to be...\"</p><br/><p>Glacia stretched out her hand to pinch Lorist again. \"Which one of my statements did you mistake for praise? I only know that you're becoming wilder and wilder. Locke, the way you handled this matter was too audacious. It will easily put our family at the center of the storm. The other nobles will start to see us as a threat...\"</p><br/><p>\"Glacia, it's fine. You don't have to worry. The family is strong enough now, so we don't have to fear anyone,\" Lorist interjected.</p><br/><p>Glacia breathed a long sigh and said, \"Locke, since you're so confident about it, there isn't much that I can say. His Highness did not mean to blame you for this matter. He told me to notify you about how he dealt with the Aslan family as well as his hopes that you will give him a hand by helping him to strategize during the unification war.\"</p><br/><p>After hearing Glacia explain the actions Second Highness Auguslo took against the Aslan family, Lorist gasped.</p><br/><p>\"Isn't that a little too harsh? The Aslan family will never have a chance to rebuild themselves ever again. No, wait... Glacia, why do I have a feeling that the true purpose the Second Highness eliminated the Aslan family was to take their wealth for his own use?\"</p><br/><p>Glacia nodded helplessly when she heard that.</p><br/><p>\"No way... Are the kingdom's finances that bad? Then why is the Second Highness so hell-bent on reuniting the empire? Can't he focus on ruling the Andinaq Kingdom properly first? He should settle the commoners down and strengthen the kingdom before trying unification again.\" Lorist said, expressing his shock and confusion of the Second Highness's intentions.</p><br/><p>\"Glacia, I really don't understand why he's in such a rush to reunite the empire. Having 300000 soldiers under his command was already a big enough mistake. There is no way that the six provinces of the kingdom can afford to sustain that many soldiers. I believe that the Second Highness should've emptied the savings of the royal family on those troops... And the costs will only rise even further when the war starts. How will the Second Highness deal with the logistics issues, as well as the pension and reimbursement for the dead soldiers?\"</p><br/><p>Seeing Glacia shrug, Lorist widened his eyes in realization, \"No way, is he counting on raiding the territories he conquers for resupplication?\"</p><br/><p>Glacia nodded helplessly once again and said, \"Locke, I know all this sounds ridiculous to you. But the kingdom truly has no better option to pick. What would you think if I told you that in actuality, the kingdom cannot even sustain one legion of soldiers?\"</p><br/><p>Lorist shook his head and said, \"Impossible. There are six provinces within the kingdom. How is it possible for the kingdom to not be able to sustain even one legion of troops?\"</p><br/><p>Glacia said with a solemn expression, \"It's like this... There hasn’t been any trade between the Andinaq Kingdom and other territories since its founding almost a decade ago. As the nation that bears the legitimate legacy of the Krissen Imperial family, the kingdom has been put under embargos, both publicly and secretly, by the Forde Trade Union. The products we managed to sell using our smuggling channels would also have their prices forcefully lowered greatly, and smuggled imports of the kingdom cost more than ten times the market price.</p><br/><p>\"Without trade, there is naturally no profit. The tax the kingdom collects is also incredibly limited, with most of it being paid in goods rather than gold. Also, at the Great Andalou Plains where the kingdom is located, even though it used to be the trading center of the empire, a vagabond crisis has emerged after the civil war. Everyone there lives in extreme poverty now. It was only after our family convoy brought those vagabonds away, and cleared out the nobles of the original three provinces of the kingdom five years back, that the Second Highness was able to stabilize the kingdom.</p><br/><p>\"After that, he emerged victorious from the First Prince's assault and forced him to hand two provinces over to the kingdom, as well as Yungechandler Province from the Madras Duchy. Even though the kingdom now controls six provinces, it's completely drained of resource. The past few years could be considered rather peaceful, but the tax we collected was only in the form of food. What the kingdom actually needs are war horses and iron ores.</p><br/><p>\"Not one of the seven iron mines of the empire falls within the borders of our kingdom. The Redlis Kingdom and the Iblia Kingdom each have two of those mines. Of the four great duchies, the Farkel Duchy owns two while the Handra Duchy owns only one. With the embargoes in place, we aren't able to trade our own produce for the other resources we need. Agricultural development requires huge numbers of metal farming tools. The kingdom has been forced to make do with wooden ones instead, despite the greatly inferior productivity.</p><br/><p>\"It's not that the Second Highness doesn't want to rule the kingdom properly; as things stand now, he just can’t. During the past few years, the First Prince, king of the Redlis Kingdom, drove up to 400000 vagabonds over our borders. Coupled with the trouble-making deserters and the armed vagabonds, the Second Highness had no choice but to recruit them into the army to ensure the peace of the kingdom.</p><br/><p>\"Take, for instance, the Fiercegale Legion. Even though it was considered one of the three main armies of the empire, they had begun to become more independent after being outside of the Second Highness's jurisdiction for such a long time. The Second Highness was forced to disband them and absorb those troops into the Local Defense Force to prevent unforeseen changes from surfacing. Unfortunately the move was misunderstood by others.</p><br/><p>\"As the reorganizations progressed, the number of soldiers only grew. If the army is disbanded and the troops are let loose within the kingdom, there would be no doubt that it would fall into a state of chaos and confusion. We must give the 300000-strong army a goal, something to fight for. That is why the Second Highness brought out the unification war: to raise the morale of the troops.</p><br/><p>\"In actuality, he is only targeting the Redlis Kingdom this time around. As long as the kingdom can absorb the Redlis Kingdom, then many of our problems would be solved in one go. Not only would the Andinaq Kingdom be able to obtain some much-needed resource, the Second Highness would also be able to take the first steps to building up our own market and economy so that we would no longer be affected by the embargoes of the other powers. As for the other duchies, the Second Highness thinks that there's no need to mobilize the troops against them. He believes that the dukes will submit themselves to him once the Andinaq Kingdom gains a stable footing. Once they do, the reunification of the empire will truly be something that is within our means to achieve.</p><br/><p>\"Locke, the First Prince is undoubtedly the Norton family’s enemy. Had it not been for his rebellion, my father, our Third Uncle and the First Young Master wouldn't have died. The deaths of our loved ones are inextricably linked to the First Prince. The Second Highness intends to make the First Prince pay, and I think you should give him a hand with that. He really admires you and even said that your tactics and strategies somehow always manage to catch the enemy off-guard and bring you victory. It was like that five years ago, and it still is today,\" Glacia said, giving Lorist a pleading gaze.</p><br/><p>Shaking his head, Lorist said, \"Glacia, since His Highness has already finished reorganizing his 300000-strong army, why didn't he launch the attack immediately? Instead, he’s put the matter aside for almost a whole year now. This delay has allowed the Madras Duchy and the Redlis Kingdom to make more than enough preparations at their respective borders to defend against him. Tell me, why is that so?\"</p><br/><p>\"Sigh... Isn't it because the Third Prince hasn't passed on yet? Even though he’s been in a critical condition a number of times, he still manages to live on. If the Second Highness engages in his expedition now, given how far from the imperial capital he would have to go, he would inevitably lose his control and influence. If the Third Prince suddenly regains consciousness and does something against the Second Highness's favor, it would be too late and he will lose everything...\"</p><br/><p>\"Haha,\" Lorist laughed. \"Even though you're in the loop, an outsider like me is able to have a clearer view of the situation. Glacia, you trust the Second Highness way too much. That's why you believed the excuse he gave you. It would cost at least fifty to sixty thousand gold Fordes each year to sustain a 300000-strong army. With a huge spending like that, why can't he just form a standing army? If we take into account the cost to supply 300000 soldiers with weapons and equipment, the Second Highness has invested at least 1 million gold Fordes already. It's too big of a waste to spend that amount of money on military forces alone. With that kind of money, what's stopping him from developing the kingdom properly?\"</p><br/><p>\"But, I've already seen the tax records of the kingdom. Each year, we collect less than 40000 in trade taxes, while sustaining an elite standard legion would cost more than 100000 gold Fordes,\" argued Glacia stubbornly.</p><br/><p>\"Glacia, if the Great Andalou Plains was only good for agriculture, there is no way that the imperial capital would be situated there. If you read more, you'll find that the Great Andalou Plains used to produce a good amount of gold nuggets. It's even known as the 'home of gold nuggets'. It’s able to produce tens of thousands of gold Fordes' worth of them each year. In actuality, the embargo is nothing but a joke. Merchants crave profits, and if an opportunity is profitable enough, they would definitely carry it out even if it would cost them their heads. The kingdom would definitely be able to get the resources it wants if it tried. If it really couldn't, how is the Second Highness able to supply the 300000 troops with weapons and equipment?</p><br/><p>\"I believe that His Highness is actually just going with the flow and utilizing the advantageous standing he has now. He's always been incredibly ambitious. The reunification of the empire is his ultimate goal. Just compare our family dominion with the kingdom. Which do you think has it worse? Despite that, our family put our priorities on development, and within a mere five years, the dominion changed radically. Our family might increased to the point that we were able to defeat the Second Princes 100000-strong army in one fell swoop. That's why development is the only correct path to grow one's might. Having a strong force is but a means to an end,\" Lorist said.</p><br/><p>\"Forget it, Locke. I don't want to argue with you about this. His Highness doesn't intend to force you into this either. If you don't want to help him, then at the very least, the family forces at the Northlands should pay attention to Duke Fisablen. He will definitely pose a threat in the unification war, so you can do at least that, right?\" Glacia said, switching to plan B.</p><br/><p>After circling around in the room for a few moments, Lorist agreed to the request begrudgingly.</p><br/><p>\"Another thing. Hand the soldiers of the Royal family's Local Defense Force back to me. You better not have any plans for them,\" Glacia said.</p><br/><p>\"Fine, you can bring them away,\" Lorist said reluctantly. \"But I will need you to compensate for that. You have to pay at least 100000 gold Fordes for their ransom.\"</p><br/><p>Glacia glared at Lorist and said, \"Dream on. I don't even have a copper coin for you.\"</p><br/><p>\"Then I won't be able to explain this to my knights. I originally planned to use them as laborers after bringing them here to Silowas Island,\" Lorist said as he shrugged.</p><br/><p>Enraged, Glacia grumbled, \"They are the soldiers we’ve taken so long to train... And you plan to use them as mere laborers?! No way. I will be bringing them back. If you need manpower, go find some yourself. There are tons of vagabonds at the southern and eastern provinces.\"</p><br/><p>\"Will the Second Highness agree to that?\"</p><br/><p>\"Of course. In fact, he would be more than glad for you to take the vagabonds away.\"</p><br/><p>\"How about this, Glacia... I will agree to let you bring the prisoners away, but you must promise me that our recruitment of the vagabonds will not be obstructed in any way. Also, ask the Second Highness to let us recruit some administrative officials from the imperial capital. The family dominion needs more talent,\" Lorist said.</p><br/><p>\"Deal!\" Glacia agreed without the slightest hesitation.</p><br/><p>Glacia was in a rush to return despite having spent only one night on the island. However, there were only three small ships at Silowas Island, so transporting the 2000 or so prisoners back would take quite a few trips.</p><br/><p>After sending Glacia off, Lorist said to Charade, \"I will have to make a trip to Morante City.\"</p><br/><p>\"For what?\"</p><br/><p>\"I want to buy boats and order a huge amount of food,\" Lorist replied.</p><br/>\n</div>"}