{"title": "Chapter 232 Leaving", "id": 232, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-232-leaving", "volume_title": "Volume 3", "body": "<h1>Chapter 232 Leaving</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Leaving</p><br/><p>Hey guys, this third bonus chapter of the week was also brought to you by Anh D. L. from the USA. Many thanks for your support!</p><br/><p>The one who brought the Second Prince into the hall was Josk. Four other guards also came in with a huge chest in their hands.</p><br/><p>At that moment, the Second Prince was wearing a black head sack. Coupled with the black cloth draped around his cubic prison when he was transported to the hall, the guards of the hall were guessing who that mysterious figure within was moments before. Now that the secret was out, the Second Prince's head sack was removed and a few of the nobles let out gasps of surprise.</p><br/><p>\"It's the Second Prince...\"</p><br/><p>\"It's Iblia!\"</p><br/><p>Lorist used his sword to push aside the latch of the chest and kicked its cover open. Within it, a crown, scepter, and a set of royal robes could be seen.</p><br/><p>\"Your Highness, I believe that you should be familiar with him, the renowned Second Prince and King of the Iblia Kingdom. My family forces breached Windbury City and managed to capture him. However, his fate and judgment is a matter of the Krissen Imperial Family, so I could only bring him to the imperial capital so that Your Highness can deal with this matter,\" Lorist said with his finger pointed at the Second Prince.</p><br/><p>\"And these,\" Lorist said while kicking the chest on the ground. \"The whole set of royal regalia of the Iblia Kingdom. This is the gift from the Norton Family to the Andinaq Royal Family to express our loyalty and service.\"</p><br/><p>However, the Second Highness wasn't paying attention to what Lorist was saying and only looked at the Second Prince before he asked, \"Has the Norton Family took over the Iblia Kingdom?\"</p><br/><p>Lorist shook his head and said, \"No. After eliminating the 100000-strong force of the Second Prince, we also suffered immense casualties. We then used guerilla tactics to occupy Windbury City and captured the Second Prince before we were chased out again by the forces of Duke Fisablen. So far, we can only stay within the Northlands to defend ourselves and the Iblia Kingdom is currently ruled by their queen.\"</p><br/><p>Lorist lied without batting an eye so that he would be spared from being used as the Second Highness's spear. Since the Southern Province and the Winston Province that the Iblia Kingdom controlled was a total mess, it was not a threat at all to the Norton Family. The Southern Province had already become a wasteland, whereas the Winston Province nobles and the nobles of the Southern Province, who were hiding within the royal capital, were at war with each other. The queen, on the other hand, merely hid within the Rose Palace to enjoy her life as much as possible. Even Duke Fisablen had given up on taking any action and left the Iblia Kingdom on the verge of collapse.</p><br/><p>As expected, when Second Highness Auguslo heard Lorist's reply, he breathed a sigh of relief while also feeling a little dissatisfied. He was relieved to hear Lorist say that his forces had suffered immense casualties. It was only to be expected after a battle with the 100000 soldiers of the Second Prince. Even if he won, some amount of lost vitality was to be expected. He also believed that after occupying Windbury City and catching the Second Prince, the forces of Duke Fisablen that attempted to take the Second Prince back must have also caused the Norton Family troops to pay a hefty price.</p><br/><p>But the Second Highness was also aware that he wouldn't be able to use the Norton Family's force to achieve his plans. With a great achievement like sending the Second Prince straight to him, Lorist would definitely say that the Norton Family has already did their best to play their part and have his family forces rest to recuperate and rebuild. The Second Highness who had prepared to watch his plans unfold by the sidelines was incredibly dissatisfied and felt as if he his full-force punch had landed on nothing but air.</p><br/><p>However, the Second Highness no longer paid attention to Lorist since the unmasked Second Prince had just realized where he was. The confused Second Prince had already regained his calm and adopted his usual elegant facade and began loudly greeting the nobles he recognized regardless of whether they were willing to pay any attention to him.</p><br/><p>\"Aha! Aren't you my second nephew? Long time no see. Second Uncle here misses you so much! Is my brother not here?\" The Second Prince had noticed the presence of the Second Prince and began to bring up their familial relations.</p><br/><p>The Second Highness merely gave the cheerful Second Prince a hateful stare infused with killing intent. The three people the Second Highness hated the most included the First Prince, the Second Prince and Duke Madras. Even though the First Prince was the first to raise the banner of rebellion, the empire reacted quickly enough and mobilized its forces to slowly push the First Prince into the corner.</p><br/><p>But the Second Prince, who saw an opportunity amidst the chaos and confusion, stabbed the empire in the back and rebelled at Winston Province, forcing Duke Melein to bring his forces back and allowing the First Prince to jump out of his predicament. Ever since then, the three princes fought for the throne of the empire and the once strong empire fell into disarray and conflict.</p><br/><p>Just when the empire was about to gain some advantage, with victory in sight, thanks to the foundation of their strength -- which had been lain over hundreds of years -- Duke Madras suddenly seceded from the empire and caused the advantageous situation to evaporate in no time. The civil war continued for another three years before the empire fragmented into the many kingdoms and duchies it was in the present.</p><br/><p>Now, with one of the main instigators in his hands, Second Highness Auguslo looked coldly at the Second Prince. It was as if he was staring at an animal waiting to be slaughtered.</p><br/><p>\"Hehe... Hehehe... My little Auguslo, what's up with you? Are you not happy about Second Uncle's visit?\" asked the Second Prince, forcing himself to continue smiling despite the cold gaze the Second Highness was giving him.</p><br/><p>\"I don't see any Second Uncle of mine. I only see a traitor of the empire before me. Right now, I'm thinking of how I should put you to death to teach the rest of the defectors of the empire a deep lesson they'll never forget,\" said the Second Highness after a long pause. However, his statement made the Second Prince pale instantly.</p><br/><p>\"I-I'm your Second Uncle, you know. Do you intend to bear the stigma of killing one of your own seniors?\" said the Second Prince in a last-ditch attempt.</p><br/><p>\"I don't mind taking a page out of Krissen IV's book to deal with a traitor of the imperial family like you,\" said the Second Highness coldly, causing the Second Prince to slump to the ground weakly.</p><br/><p>Krissen IV was one of the longest ruling emperors of the Krissen Empire. During his 70th birthday, he put to death 7 of his sons, 4 of his daughters, over 20 of his grandchildren as well as more than 4000 others, all for attempting to usurp the throne. At that time, more than 100 noble families were involved in that incident.</p><br/><p>That was one of the most well-known incidents in the history of the Krissen Empire. It caused Krissen IV to come to be known as the Ironheart Emperor. The reason it happened was simple: Krissen IV had been on the throne for far too long. His whole ruling term was a staggering 84 years. Even the three sons of his that were made crown prince didn't live as long as he did. In the end, the few remaining sons of his who yearned to be emperor decided to send their father on a premature journey from the world, but they were exposed and dealt with in the end.</p><br/><p>The Second Highness had brought up the tale to imply that he would hold no regard for any familial ties, causing the Second Prince to crumble entirely. The Andinaq Kingdom was perfectly in line to deal with Second Prince and it was already inconceivable for him to die a swift death, being the traitor he was.</p><br/><p>\"Take him away and lock him up for now,\" the Second Highness said. Now that I have one of the biggest troublemakers in my hands, it won't take long until the other two's turns. When my father passes on, I will become Auguslo I and lead my 300000 soldiers to conquer the various lands and rebuild the empire to its former strength.</p><br/><p>\"Ah, Count Norton, you looked so handsome when you defeated Blademaster Climonto just now! Given that your swordsmanship is so amazing, do I have the honor to ask for a bit of guidance from you? We have a manor in the imperial capital which boasts an amazing view. Nobody will bother us over there...\" said Princess Carey with a coquettish tone. She no longer put up the arrogant and cold front towards Lorist. Instead, she radiated an air of anticipation as she made that request, and looked at Lorist with wide puppy-dog eyes.</p><br/><p>Ugh, Princess Carey... Putting aside your age of 25, your physique is not suitable for sword-fighting... But it would no doubt be incredibly compatible for pole-dancing. Forget giving you any pointers, I don't want to end up in your bed halfway through the lesson. 'Boons don't come without effort, and calamities happen for a reason'. Thinking back at how the First Highness died in the middle of the night after coughing out a mouthful of blood, Lorist was not the least interested in involving himself in the drama of the Andinaq Kingdom and desired to stay as far from the imperial capital as possible. Handing the Second Prince to the Andinaq Royal Family is already an irrefutable achievement on my part, so better give the other nobles a chance to contribute during your unification war.</p><br/><p>\"I deeply apologize, Your Highness,\" Lorist said as he took two steps back to distance himself from Princess Carey before bowing slightly. \"It’s rather unfortunate, but I’m rather busy with my duties as a dominion lord. Silowas Island is still not completely peaceful and there's a lot I have to do, so I really cannot afford to spare any time to guide you in swordsmanship. And to be honest, there isn't much I can teach either. To me, there are only two secrets when it comes to practicing the sword, and those are diligence and low regard for one's own life. If Your Highness can work on these two points, I believe your swordsmanship will definitely improve greatly.\"</p><br/><p>Princess Carey stomped on the ground angrily at Lorist's crudeness, but she still smiled shyly and said, \"Then, Count Norton, I've heard that the sights at Seaview Manor at Silowas Island is not bad. I wonder if I am fortunate enough to make a trip there?\"</p><br/><p>Oh no, don't tell me that this lass is smitten with me... Just tell me which part of me you like and I'll definitely change it right away, thought Lorist irresistibly. But he still smiled and nodded as he said, \"Of course you can, Your Highness. The Norton Family will always be honored to host your visit to Seaview Manor. I will have my subordinates receive you there. But as I will be moving around a lot personally, if I am not present on the island when Your Highness arrives, I hope you will forgive me for my inability to tend to you.\"</p><br/><p>It was at that moment when the Second Highness came over and said with a praiseworthy tone, \"It seems the two of you are having a good time. Locke, this niece of mine is one of the most beautiful women in the kingdom and has always set her sights incredibly high and doesn't mingle with others easily given her cold personality. I didn't think that she would get along so well with you, Locke. This must be fate. Locke, you must definitely grasp this opportunity...\"</p><br/><p>Princess Carey curled up in embarrassment and said, \"Uncle...\"</p><br/><p>Lorist was tempted to roll his eyes as he thought, which one of your eyes saw me enjoying my conversation with the princess? Sheesh, one spouting crap with their eyes wide open after another... She may indeed be the most beautiful within the kingdom, but -- forget about her having a cold personality -- I’ve already seen her performing enthusiastically in front of everyone else butt-naked.. Not only did she put up a great show herself, she even caused the people around her to start humping passionately...</p><br/><p>\"Your Highness, since the Second Prince is already in your hands, I will take my leave now,\" Lorist said to cut the conversation short as he decided to leave the imperial capital as soon as possible.</p><br/><p>\"Oh...\" mumbled the Second Highness, surprised. \"What's going on? Are you unhappy with our hospitality? Locke, you and I go way back and to be honest, I hope that you will be able to contribute even more during the unification war. As for the things that just happened, I admit that it was lack of consideration on my part for neglecting the reputation and honor of the Norton Family. I express my sincerest apologies to you.\"</p><br/><p>Lorist waved his hand and said, \"Your Highness, there's no need to dwell on such things. I truly believe in your sincerity and understand that you've always been focused on working towards rebuilding the empire, so it's completely understandable that you would let small things like this slip by since such things are usually unpredictable. However, after taking on the 100000 soldiers and ambushing Windbury City, the Norton Family force is already incredibly weakened. It's already uncertain whether I'll be able to protect myself and I've only sent the Second Prince here as a precaution. Duke Fisablen is definitely not an easy person to deal with and I must even keep one eye open when I sleep in my dominion to stay alert...\"</p><br/><p>Since Duke Fisablen was busy gathering all the livestock to exchange for military equipment, Lorist didn't bother too much and dumped all the blame on him. Additionally, as the Second Prince's father-in-law, the duke was supposed to be the enemy of the Second Highness in the first place. Given his moniker as the war god of the plains, the Second Highness would only believe in Lorist's description of the situation of the Norton Family if he inflated the might of Duke Fisablen.</p><br/><p>\"That's why I still have to rush back to the Northlands to rebuild my family forces. Initially, I thought that I would be able to gain some resources from Silowas Island to aid in the recovery of my dominion in the Northlands but I didn't think that the island would be ravaged so badly. Your Highness, please forgive me for not being able to partake in the unification war. It is beyond my ability to do so no matter how much I wish it were. All I can do here is to wish you all the best in your efforts and hope that I will be able to come here again to congratulate Your Highness when you succeed.\"</p><br/><p>Since Lorist was insistent on leaving, the Second Highness didn't do too much to stop him. Given the achievement of capturing and bringing over the Second Prince, it would be troublesome for him to force Lorist to stay. If anything were to happen to the Norton Family dominion as a result of that, there's no doubt that Lorist would hate the Second Highness to the bone, so Second Highness Auguslo felt that it was better to let him go back to fight with Duke Fisablen since he had originally intended to use the Norton Family forces to hold back those of Duke FIsablen anyway.</p><br/><p>Having finally obtained permission to leave, Lorist departed immediately without looking back.</p><br/><p>After exiting the capital, Josk laughed and said, \"Milord, why weren't you moved even the slightest when that beautiful princess approached you? She tried so hard to get close to you that I thought she had glued herself to you.\"</p><br/><p>Lorist laughed bitterly and said, \"Joe, that woman is not as simple as she seems. If it were another woman, I would be more than happy to encourage you to court her. After all, it's not every day that you praise a woman for her looks. However, I can't help but feel that this princess seems to be plotting something. 'Empire-ruining beauties' are used to describe those kinds of women. Coupled with the mysterious circumstances surrounding her father, the First Highness's death, I feel that interacting with Princess Carey will bring us even greater trouble, so I believed that it would be best for us to stay far away from her. I don't want to be in embroiled in yet another incredibly complicated situation.\"</p><br/><p>At that moment, Freiyar came forward and asked, \"Milord, what's the plan for the rest of our trip?\"</p><br/><p>\"After leaving the city walls and arriving at our camp, we will set out immediately. I am afraid that the Second Highness will change his mind and have us stay at the imperial capital. I didn't think about it too much when I decided to bring a whole regiment of Local Defense Force soldiers with me, and the Second Highness hasn't seen how well-armed they are yet. If he does, he'll definitely realize that I've been lying to him. These 500 soldiers are far more elite and well-disciplined than the royal guards stationed at the hall just now,\" Lorist said while furrowing his brow.</p><br/><p>Josk nodded in agreement and said, \"That's right, milord. When I was waiting for my turn to bring the Second Prince into the hall, the guards there were talking about how impressive our guards' equipment were with some of them even coming close to take a look while praising their quality. It looked as if they were about to strip our guards naked right then and there. When the Second Highness has more time, the guards will definitely report to him about it and I believe that the he will start to pine for our equipment not long after.\"</p><br/><p>\"Sigh, so many things to worry about. Leaving early is for the best,\" Lorist said.</p><br/>\n</div>"}