{"title": "Chapter 257 Clash of the High-Tiers", "id": 257, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-257-clash-of-the-high-tiers", "volume_title": "Volume 3", "body": "<h1>Chapter 257 Clash of the High-Tiers</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Clash of the High-Tiers</p><br/><p>This third bonus chapter of the week was brought to you by an anonymous supporter. See you next week!</p><br/><p>\"The Union managed to push the kingdom's army out of their territory in just ten days? Does that mean that the Teribo Kingdom will fall in another month?\" asked Els.</p><br/><p>Dulles clicked his lips and said, \"The situation is already beyond me. When I arrived, the Union's main force was in a standoff with four-allied nations' armies. The army they can muster now has to be from Teribo VII requesting aid from his neighboring kingdoms. I have no doubt that they are desperate to chase the Union out of the kingdom.\"</p><br/><p>\"According to them, however, they have come to mediate the conflict. The reason they stopped the Union's forces from advancing was to prevent peace from being further disrupted. They all know full well that the Teribo kingdom's forces can't withstand the Union's. Had it not been for the huge price offered by Teribo VII, no nation would dare to offend the trade union.</p><br/><p>\"Was there any conflict during the standoff?\" asked Josk.</p><br/><p>He had quite a bit of experience in life, so the joke of a war fascinated him.</p><br/><p>\"How could there not be? The Union's ragtag bunch are at least still not completely insane. They wouldn't launch an attack on well-fortified defenses unless there were worthwhile benefits involved. In fact, the reason they invaded the kingdom in the first place was so they could benefit. They want to rack up some contributions and raid the lands of the kingdom's rich nobles. None of them are idiots who would go on a suicidal mission for no gain. President Cobleit is having an emergency discussion with the allied nations as we speak. He's hoping to convince them to retreat and refrain from interfering in the two country's war.</p><br/><p>\"Milord, when I departed, the trade union had already taken over seven of the kingdom's commanderies, almost half its territory. Despite this massive gain, they've never actually fought a proper battle! Most of the time the kingdom's soldier would surrender the moment they notice the Union approaching. There was even one garrison captain from one of the commanderies who sent somebody to inform President Cobleit that he would open the gates without resistance as long as he was given the dominion lord's daughter's hand in marriage. Naturally, the president accepted,\" said Dulles.</p><br/><p>He gulped down a cup of water to quench his thirst. His throat was not used to being used this much.</p><br/><p>Charade barged into the room all of a sudden. He had just returned from surveying the construction site. The moment he heard about the war between the Teribo kingdom and the trade union, he became anxious. Given that his father was a glass merchant, would the war affect the peace of his family?</p><br/><p>Without waiting for Charade to say anything, Dulles said, \"Don't worry, Brother. Your family is fine. Given your father's fox-like cunningness, he had long brought the whole family to hide at the Dawn Academy. He also bought a few warehouses' worth of glass with the money he had remaining. After I asked him why he bought so much glass, he said that since glass products wouldn't expire as long as they weren't broken, he could keep them until the Peterson Merchant Guild starts the trade route to our dominion. He will ship all the glass to the Northlands and be satisfied if he can get his capital back four times over.\"</p><br/><p>Even though Charade felt relieved after hearing of his family's safety, he blushed when he heard about how his father planned to do business at the dominion. His awkward expression caused all those present to laugh teasingly.</p><br/><p>Lorist patted on Charade's shoulder and said, \"There's no issue. Uncle is quite a fast-adapting person. He is always welcome to come to the dominion to do business. As long as he doesn't violate our regulations and doesn't oppress others with his power, he is free to earn all he wants. If his business runs well, we can even have him take charge of our house's exports. Dulles, tell me more about the war.\"</p><br/><p>\"Yes, milord,\" Dulles said.</p><br/><p>He paused for a while to recall what he could before continuing.</p><br/><p>\"Over 100 thousand Union troops have moved in and occupied the kingdom's territory. They've noticed how weak the kingdom actually is. It's basically a piece of deboned meat. Naturally, everyone wants to take a bite. Almost all of Morante's mercenaries are over there now. Even Charlando formed a mercenary band with Kindoz and the rest. They're intent on making a profit in the kingdom. Louise said they were going to raid some of the rural nobles' manors.</p><br/><p>\"Now that Teribo VII is facing the destruction of his kingdom, even he must be starting to realize that things have gotten out of hand. He's ordered Count Edmund to be hung and requested the aid of his neighboring nations.</p><br/><p>\"He's also ordered his ambassadors to spread word of the increasing threat the Union poses. Apparently, they are supposed to put emphasis on that the Union has turned its sights on the previously either uninvolved or allied nations now that the Krissen Empire has been dissolved. Now that the kingdom has already become the union's first victim, Teribo VII wants to warn everyone that the neighboring nations will be next. I understand that he's encouraging the nations to unite against the Union.</p><br/><p>\"His propaganda has been quite effective. He's been king for 20 years now and is no doubt using every trick he has. I'm sure he can sleep soundly again now that he has four other nations helping him out.</p><br/><p>\"It seems he isn't satisfied with just sleeping soundly, however. I've heard he's contacted even more nations, asking them to join his campaign against the Union. He wants to fight all the way to Morante and force the Union to surrender. Aside from the benefits he wants to demand from the Union, he also wants to include the prohibition of glass production in the terms of surrender.</p><br/><p>\"Sol, if that isn't excessive, I don't know what is! Teribo VII truly is simple-minded. Even at a time like this, he's still not willing to give up on glass,\" commented Els.</p><br/><p>Dulles continued, \"Of course it is. Apparently, it's left his allies dumbstruck. The Union has already flatly rejected his demands. They're only willing to accept a cease-fire if Teribo VII reimburses them for the damages caused during the Mayflower Merchant Guild incident. They've also demanded that he cede the territory the Union currently occupies.</p><br/><p>\"Right now, the allied army is in quite a pinch. They only have 47 thousand people. They can't possibly take on 100 Union soldiers. They might have accepted Teribo VII's offer, but that doesn't mean they're willing to clash with the Union in full-on battle. Given that they won't even clash with the Union at all, Teribo VII's dream of having them fight all the way to Morante is just wishful thinking, it's never going to happen. They just want to end the conflict so they can go their own ways.</p><br/><p>\"They don't realize, however, how troubled President Cobleit is. He only controls half of the troops. The other 50 thousand are acting independently, and thus don't take orders from him. They're merely messing around in the territory already conquered. The trade union's own forces only include those of thebig-seven guilds, the patrol regiment, and the garrison regiment. However, these people number fewer than 30 thousand. They have even taken on a defensive stance just in case the allied army decides to ambush them.</p><br/><p>\"So far, the kingdom's forces are also watching the negotiations defensively. There was an article in the Morante Daily that mocked the war for being a stagnated one with no end in sight. \"</p><br/><p>Not one of them expected the war to stay at a stalemate for three long months. When Dulles left Morante, the stalemate had already lasted for little over ten days.</p><br/><p>\"Are you sure the big-seven guilds have their attention fully focused on the Teribo kingdom? Even the Chikdor Merchant Guild? They won't be coming over to fight for Silowas Island anytime soon, will they?\" asked Lorist.</p><br/><p>\"That is correct, milord,\" Dulles replied, \"Just before I boarded the ship to leave, I saw the Twinhead Dragon Merchant Guild, Mayflower Merchant Guild, Peterson Merchant Guild, and Chikdor Merchant Guild each send another regiment of reinforcements to the Teribo Kingdom. The Forde Merchant Guild, on the other hand, is busy taking in the Lormo duchy's Puljas province; and the Wald Merchant Guild is trying hard to convince the Mobia duchy to join the trade union in the same manner. As for the Wessia Merchant Guild, they're hesitant about the whole thing. They've invested a lot in the Redlis kingdom and aren't willing to give it up just yet.</p><br/><p>\"Oh, and President Peterson told me something secretly before I left. He said that the Chikdor Merchant Guild was originally going to hire eight blademasters above rank 2 to assault you. They've been left cowering by your killing spree last time,\" concluded Dulles with such an important revelation.</p><br/><p>\"What did you say?!\" Els, Josk and the others all jumped in surprise, \"You should've brought that up first!\"</p><br/><p>\"Hehe, there's no need to worry about that anymore,\" Dulles said as he shrugged, \"The Chikdor Merchant Guild's plan can no longer be implemented. All the high-tier fighters have gone to the kingdom, including even the Chikdor Merchant Guild's own blademasters. \"</p><br/><p>\"Are you sure about that?\" Charade asked, furrowing his brow, \"What does the war there have anything to do with blademasters? Also, didn't President Cobleit only bring a few high-tier fighters with him? Don't tell me the Chikdor Merchant Guild is trying to mislead us. Milord, you should definitely pay attention to your safety in the future. While you can handle a single blademaster with ease, being assaulted by a group of them would definitely be disastrous.\"</p><br/><p>\"I'm sure,\" Dulles said, nodding, \"Actually, this was the result of Teribo VII's antics. With the allied army standing off against the Union's troops, Teribo VII is preparing to reorganize the military layout of the kingdom. However, the kingdom's army has always been incredibly weak, especially for the last 200 years. What's even worse, the majority of the gold-ranked knights the kingdom had were wiped out during their assault on the Mayflower Merchant Guild.</p><br/><p>\"Without them, the nobles who wish to win some quick victories, as well as the normal soldiers, no longer have proper leaders. It seems that Teribo VII is trying to pull the Union down to his level since he can't match them as they are now.</p><br/><p>\"I suspect that's why he's begun to recruit the high-tier fighters of his neighboring nations. I doubt it's so they can join his army. It's far more likely that he wants them to assassinate the Union's gold-ranked knights and their blademasters. He's offered astronomical bounties for the heads of gold-ranked knights and blademasters, a single gold-ranked knight is worth 10 thousand gold Fordes, and a blademaster is worth 200 thousand. \"</p><br/><p>The bounties tempted even Lorist. He had half a mind to return to the Union to earn himself a few million gold Fordes.</p><br/><p>\"Has the measure been effective? \" asked Els.</p><br/><p>\"Yes!\" Dulles responded almost instantly.</p><br/><p>\"In the eight days between his announcement of the bounties and my departure, nine gold-ranked knights were already assassinated. They were mostly either mercenary leaders or captains of civilian militias. They were targeted when they were busy raiding manors. Not only were they wiped out, their troops were dragged into the mess as well. Only a lucky few managed to escape alive.</p><br/><p>\"Apart from them, one of the Riwald Merchant Guild's blademasters was also assassinated. According to the kingdom's official statement, two blademasters from the Teria duchy were responsible for that and the bounty has already been given out.</p><br/><p>\"President Cobleit was no doubt furious. He sent his men to the Teria duchy to confront their leader. Unfortunately, he didn't know where the blademasters had gone. He's insisted that Teribo VII be blamed, not him. The duchy apparently only pays its blademasters 6 thousand gold fords annually. It's no wonder they were swayed by the bounty.</p><br/><p>\"Just one day before I left, the Morante Daily reported that President Cobleit himself had been targeted several times. Fortunately, he wasn't injured and the three blademasters that came for him were killed. His bounty is far higher than that of an average blademaster. Since he's the commander-in-chief of the Union's forces, his head is worth 1.5 million gold Fordes. The identities of the three blademasters have also been revealed. They belonged to the neighboring nations as well.\"</p><br/><p>\"I'm worried for that darned uncle of mine,\" said Els.</p><br/><p>Laughing, Dulles said, \"Don't worry. Old Char's still pretty clear-headed and more cunning than most. The moment the bounty was released, he knew something was up and went back to Morante with me. They managed to raid two manors and brought with them quite a huge amount of fine wine and made quite the profit. Right now, he's happily continuing his job as the boss of the inn.\"</p><br/><p>\"Then, did the Union take any measures against Teribo VII's bounties?\" asked Charade.</p><br/><p>\"There's not much they can do,\" Dulles said, shaking his head, \"I thought about it quite a bit on my way here. I couldn't come up with any possible countermeasure. The Union can't retaliate in kind since they don't have any high-tier fighters left, apart from rank two and three blademasters. The Union is likely also unwilling to stoop to Teribo VII's level. It's laughable to even think that they can compete with the king's bounties. I have no doubt that they think Teribo VII's gone completely mad to be throwing away his money like dirty water. Nobody's willing to pay that kind of money.</p><br/><p>\"As for the ones who assassinated the Union's high-tier fighters, they were mostly from other nations. There's no way that the trade union can accuse them and put bounties on their heads without any hard evidence, it would only make them more enemies. Even if they did have the evidence, the nations could simply claim the blademasters acted independently and shift all the blame on them. This move has completely destabilized the Union's position, and apart from securing their high-tier fighters, there's not much they can do about it.</p><br/><p>\"There is word that one of the mediators from the neighboring nations criticized Teribo VII's move for creating more conflict. Right now, the Union has already sworn to wipe the kingdom out. But Teribo VII has still declared that he doesn't mind spending 20 million gold Fordes to wipe out all of the Union's high-tier fighters. He even claimed that it wouldn't take long for the Union to start begging to negotiate peace.\"</p><br/><p>\"Good Sol! He's smacking other people's faces with money!\" Els cried out, \"It's a shame I'm not a blademaster. Otherwise, I would be there earning a quick buck right now.\"</p><br/><p>Future military historians criticised the war for being just a series of skirmishes over villages, but what they failed to mention was the absolute massacre of high-tier fighters that happened in the shadows between the skirmishes. About 76 high-tier fighters fell during the Glass War, ten times the amount expected from a war of similar scope fought on the field of battle. Among the 76, 52 were gold-ranked swordsmen, mostly belonging to the trade union, and 24 were blademasters. However, only 7 of the 24 were members of the Union.</p><br/><p>The manner in which the war was fought was primarily decided by Teribo VII. The confrontations between the Union's high-tier fighters and those of the allied nations continued for almost half a year, but the Union stood as the victor in the end.</p><br/><p>Without their high-tier fighters, the seven nations bordering the Teribo Kingdom were pillars infested with termites. Though they appeared strong from the outside, their power was hollow. They were crushed by the Union's army easily.</p><br/><p>\"While there's nothing weird about you coming back with the talent you recruited, why did the Peterson Merchant Guild send their people here too? Are they up to something? Did you interact with them during the trip?\"</p><br/><p>After being briefed on the war, Lorist asked Dulles about the people of the Peterson Merchant Guild.</p><br/><p>\"I have no idea,\" Dulles said, \"I only know that the vice president cares the most about the local products and goods we have over here, he's even come along on the trip. They never asked about our military, so instead, we talked about the ironspine crocodiles we have at Blackmud Marsh. I suspect he wants to monopolize trade with our dominion.\"</p><br/><p>\"That's weird. Wasn't the Peterson Merchant Guild going to take the northwestern area of the Redlis Kingdom as their dominion? That's the main reason they weren't able to deal with our house directly. It seems that they've changed their mind about the embargo on products and trade with the Andinaq Kingdom. Oh well, there's no use pondering over it. I'll get to know what's going on after talking to the vice president during the banquet tonight,\" said Lorist as he shook his head as if it helped him to toss the matters he couldn't understand out of his head.</p><br/>\n</div>"}