{"title": "Chapter 259 The Second Highness's Assault", "id": 259, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-259-the-second-highnesss-assault", "volume_title": "Volume 3", "body": "<h1>Chapter 259 The Second Highness's Assault</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Second Highness's Assault</p><br/><p>Second regular chapter of the week, coming right up! Enjoy!</p><br/><p>Lorist looked at the dark skies. Small fine snowflakes that floated to the ground ever so gently.</p><br/><p>The second month's end had already arrived and it was rather cold, roughly around -70 to -80 degrees centigrade. The third local defense brigade continued to train twice a day despite the cold, which awed of the Peterson Merchant Guild's men.</p><br/><p>The group sighed. Though the Teribo kingdom and the Union claimed their two armies were standing off against one another, they were actually waiting for winter to pass.</p><br/><p>Apart from the Union's citizens, who had joined in the hope of earning some riches through raiding, not many were willing to leave their camps to work. Even the ones assigned patrol duties were cursing their luck. Only the bounty hunters didn't curse. They had been drawn into the conflict as a result of Teribo VII's astronomical rewards, as well as those who fought back against them. But it was a conflict among high-tiers which did not concern the rest of the soldiers.</p><br/><p>With the coming of the 3rd month, winter was over. What came next was a month-long rainy season. As a result, wars rarely occurred between the 12th and 3rd month. It was only by the 4th to 5th month that the armies would have enough food, taken from the harvests of winter wheat, and enough free time to begin arming themselves against any potential foe.</p><br/><p>The war between the Union and the Teribo kingdom was already considered an exception to the rule, mainly because of Teribo VII's simple-minded actions, which had greatly angered the Union. Had it not been for that, nobody would want to fight during the winter season.</p><br/><p>Wait, the second highness picked a season like this to attack the Redlis kingdom's capital? Is he insane or did I hear wrong? wondered Lorist.</p><br/><p>Charade, on the other hand, looked incredibly agitated. He grabbed the messenger, the same one Charade had brought to the southwestern provinces to recruit vagabonds as labor for the development on Silowas, by the collar. He had been left there to pay attention to the situation between the two kingdoms that were about to go to war.</p><br/><p>\"That's impossible! How was the second highness able to breach the defensive line at Kanbona province? The first prince has already fortified it so heavily! How did Auguslo make his way to the kingdom's capital?\" roared Charade, spitting lots of saliva in the process.</p><br/><p>Charade almost choked the poor messenger to death.</p><br/><p>After struggling to reply for a while, he managed to mutter, \"The se-second highness di-didn't go through Kanbona... He... he took a huge detour through Greatsnow Mountain at the Cloudsnap mountain range and arrived at th-the Bodolger province before attacking the Frederika, the royal capital... He managed to occupy the city b-by taking advantage of its lacking defenses, but the fi-first prince managed to escape...\"</p><br/><p>The messenger hesitated before he continued, \"I... I heard that the second highness left with m-more than 30 thousand men, but only had around 8000 remaining when he arrived at the city...\"</p><br/><p>Good Sol! How ruthless! Lorist felt a sudden chill run down his spine.</p><br/><p>It seemed the second highness had picked an incredibly dangerous route for the sake of attacking the city.</p><br/><p>\"Go fetch me a map in the house,\" instructed Lorist.</p><br/><p>Five years earlier, the second highness had exterminated the first prince's force of 30 thousand elite troops at Flowater Creek and had continued his assault on the kingdom. After encircling Frederika with his troops, he forced the first prince to sign an agreement to cede two provinces to the Andinaq kingdom. The new border was drawn along the Northern Province and the Kanbona.</p><br/><p>The Northwestern Province was the hilly coastal area Lorist and the convoy had passed through all those years ago. Neither the second highness nor the first prince paid any attention to it, to go to the Redlis kingdom's capital from there one would have to first cross the wide Morrison river, one would also have to pass through Kanbona. The ideal route for an attack on Frederika was through this very province, which was why the second highness had managed to capture it during his previous invasion.</p><br/><p>He could not do the same thing this town around. By the time the second highness had gathered his 300 thousand soldiers, the king of the Redlis kingdom, first prince Krissen Redlis, hadn't just sat by idly, he had gathered up large sums of money and a lot of resources to reinforce the forces stationed in Kanbona. All over the province, there were well-defended citadels with wide moats and tall walls. If the second highness wanted to reach Frederika, he would have to conquer one citadel after another to clear his path to the capital.</p><br/><p>\"Auguslo will sustain at least 200 thousand losses in Kanbona, and the remaining 100 thousand soldiers will be exhausted. They will never be able to conquer the capital. After this battle, I can promise you the punk will not dare to attack our kingdom for at least 20 years,\" the first prince had once said to his officials proudly.</p><br/><p>The prince understood the importance of wearing down the 300-thousand-strong army well. He had gathered all the family members of military officials above the rank of Squad Leader in Frederika under the ruse of keeping them safe for that very reason. Everyone knows it was just a ruse, however. If they didn't do enough damage to the second highness' forces, and the city fell, their families would fall with it.</p><br/><p>It was the prince's plan that this knowledge would motivate the forces defending Kanbona to fight to the death. The prince felt that, even though his move was incredibly cruel, this was the only way his soldiers would be desperate enough to take down three soldiers before falling. In essence, the first prince was prepared to sacrifice 70 thousand soldiers to grind away at the second highness's forces as much as possible.</p><br/><p>Nobody had expected that the second highness would be even more savage than the first prince, savage to himself and his own forces no less! He actually personally led his soldiers through Greatsnow Mountain in such horrible weather. Despite losing three-quarters of his troops, he managed to take Frederika in one fell swoop, forcing the first prince to flee the capital.</p><br/><p>Lorist looked at the map in awe. It was worth noting that the second highness had delivered an impassioned speech just a month earlier at the capital of his own kingdom, pledging to restore the Krissen Empire to its former state. It was also said that he would be busy with the funeral of the third prince, patrolling the front lines and making preparations for war. It caused others to think that he would only attack the Redlis kingdom during the 4th or 5th month, as was military convention. Nobody had dared to imagine that the second highness would conquer Frederike just one month later. Such speed shocked and awed many.</p><br/><p>Charade pointed at the map and exclaimed, \"Good heavens! The second highness actually made his way across the Cloudsnap mountain range and scaled Greatsnow Mountain... It is completely suicidal... It's far too risky.\"</p><br/><p>There was a natural barrier in the Bodolger province, between the capital and the northwestern area of Kanbona. The barrier was known as the Cloudsnap mountain range. It was a densely packed collection of tall mountains and dense forests. Additionally, Greatsnow Mountain, situated in the middle of the mountain range, was easily taller than 10 normal mountains combined. Snow piled up on the mountain and didn't melt easily. The terrain was also incredibly hard to scale. It was difficult, if not outright impossible, to cross over. Despite that, the second highness cut through like a dagger flung at a snake.</p><br/><p>Lorist laughed, pointing at the map.</p><br/><p>\"The second highness actually did something smart for once. He only managed to cross the Cloudsnap mountain range thanks to his timing.\"</p><br/><p>\"What do you mean?\" Charade asked as everyone wondered.</p><br/><p>\"Look here. The Cloudmist Swamp stretches for around 50 kilometers along the bottom of the range. It is said that the swamp is formed from the melted snow that gathers up in the area. If the second highness attempted to cross during summer or fall, it would take him at least two or three months. But during winter, most of Cloudmist Swamp is frozen, allowing the troops to travel into the deeper parts of the mountain range without restraint. After that, they only have to make their way over Greatsnow Mountain to arrive at Bodolger,\" explained Lorist.</p><br/><p>\"Ah, is that so... No wonder he's hailed as one of the greatest military strategists of the new generation. To think that he actually grasped an opportunity that hidden, his fame is completely deserved!\" exclaimed the vice-president of the Peterson Merchant Guild.</p><br/><p>Lorist sighed and said, \"It's a shame that his losses are not small. Only 8000 of the 30 thousand troops survived the journey. It seems that he didn't make sufficient preparations.\"</p><br/><p>Lorist could already infer that the second highness had only mobilized his so-called elite troops, but didn't have enough knowledge of the troubles of winter. Had he been better prepared, he wouldn't have had to attack the city with so few soldiers.</p><br/><p>Lorist's guess was actually correct. Only around 4000 soldiers died from the hike across the mountain range. But more than 20 thousand of them perished due to the extreme cold. Less than 8000, able to resist the cold with battleforce, survived. It was still more than enough to defeat the unprepared troops defending the city.</p><br/><p>\"Even so, it's still better than attacking Kanbona's citadels one after another. Had he done so, he would have lost more than 100 thousand troops easily. Considering this, his choice was the wiser, despite the losses he suffered,\" argued one of the military officials of the Peterson Merchant Guild.</p><br/><p>Lorist lightly shook his head, If war was merely mathematics, it would be much simpler.</p><br/><p>He didn't bother to argue, however.</p><br/><p>\"How do you think the war will progress now that the second highness has the Redlis kingdom's capital, Lord Count? Does first prince stand a chance to make a victorious comeback?\" asked the vice-president, who cleverly changed the subject.</p><br/><p>\"The current situation has already mostly stabilized. Unless some sort of miracle happens, the first prince will not be able to escape defeat,\" commented Lorist.</p><br/><p>\"That's hard to say. The second highness only managed to conquer Frederika thanks to the element of surprise. The 8000 soldiers he has at hand now is far too little. If the first prince manages to form an army a few ten thousand strong, the second highness might just lose,\" said the very same military official, still taking the other side of Lorist's argument.</p><br/><p>\"Hahaha...\" Lorist laughed, before he continued, \"It would be great if things were that simple. How would the First Prince be able to gather more troops, now that Frederika has already fallen? Who would bother to aid him now that he's on the run, powerless and poor? And who would be willing to fight to their deaths for him just to retake a city that isn't their home?\"</p><br/><p>\"But he's still the king! His righteous cause is reason enough!\" The military official was still not convinced.</p><br/><p>This time, it was Charade's turn to speak.</p><br/><p>\"Righteous my ass! The first prince is nothing but a traitor, one of those who raised the flag of rebellion and caused the empire to split. While he was definitely worth reckoning with when he had troops, the loss of Frederika means that he no longer has any riches left with which form an army. Who, then, would bother with a beggar like him? It's already incredibly merciful not to outright kill him on and present his head to the second highness.\"</p><br/><p>\"Well,\" Lorist interjected, \"I doubt anybody would go so far as to kill him. 'King Slayer' is not a name any noble wants to have. Traitor or not, he's still a king. But the title will do him no good. The nobles will help him superficially at most. Even if he did get a couple of soldiers, there's no way he'll be able to take the city back, which is his own fault given how heavily he fortified the city's walls. Also, all the valuable resources and equipment are kept within the city.</p><br/><p>\"The second highness is no idiot. After conquering Frederika, he will definitely use his spoils to recruit more troops. Even though he only has around 8000 right now, his force will definitely grow three to four times in less than a fortnight. When the first prince arrives at the capital, he'll realize that the second highness already has tens of thousands of troops waiting for him.\"</p><br/><p>Lorist thought deeply for a while before he continued, \"If the First Prince is smart, he will begin gathering as many troops and resources as he can and retreat to the Majik province for now. If he does so, he can draw out the conflict at the very least and wait for opportunities to turn the tide.\"</p><br/><p>\"Will the second highness actually afford him that kind of time?\" asked Charade.</p><br/><p>\"He will. Right now, the second highness only has 8000 soldiers with him and can't do much apart from defending the capital. Pursuing the first prince is out of the question. Even if he does manage to gather more troops, he'll deal with the 70 thousand soldiers defending Kanbona first. Fortunately for him, the first prince had moved the family members of officers to Frederika as hostages. He can use them as bargaining chips to force surrender.</p><br/><p>\"And by the time the 70 thousand troops switch allegiances to the second highness, the 100 plus thousand soldiers he stationed at the two southwestern provinces will begin their march towards Frederika. With that, the second highness won't need to break a sweat to destroy the Redlis kingdom and to eliminate all nobles that refuse to yield.</p><br/><p>\"That's why I believe the first prince will have the time he needs to gather troops and resources. Majik's terrain will make sure the second highness' troops are stalled for a period of time. There is no doubt, however, what will happen after the second highness' main force arrives in a month or two.</p><br/><p>\"The Northern Province won't be a threat to Second Highness Auguslo. Once he obtains final victory over the prince he can just send an ambassador there. There's no need to mobilize his troops. As for the 70 thousand troops stationed in Kanbona, they're sandwiched between the second highness' main force and Frederika. Their supply chain is completely cut off. They have no choice but to surrender.\"</p><br/><p>The fates of Kanbona and Bodolger were indeed set in stone. What came next were the Anderwoff and Majik provinces. Anderwoff was the main military center for the Redlis kingdom's nobles. The joint forces of around 30 noble houses were nothing to scoff at. Together, they had the same standing as the first prince himself. They had always been at odds with him, much to his misfortune. When he asked for aid, he received only mockery.</p><br/><p>If Anderwoff's nobles thought they could treat the second highness the same way, they were in great trouble, however. The second highness, with his army of more than 100 thousand soldiers, definitely didn't mind letting his men win some military contributions by fighting the soldiers of the noble houses.</p><br/><p>Majik was close to the Handra and Farkel duchies. It had served as the springboard for the first prince's invasion into the four central duchies. It had been reduced to a collection of ruins by the latter's counterattack. Even after five years, it had yet to be repopulated.</p><br/><p>\"Lord Count, where do you think the second highness will turn his attention to after destroying the Redlis kingdom?\" asked the vice-president.</p><br/><p>\"Well, there are many options. It's most probable for the second highness to use the troops he's gathered to attack the four central duchies and force them to relinquish their independence. After that, he will likely bring his troops through the four duchies and gather them the Melein duchy before starting an invasion of the Iblia kingdom. After defeating Duke Fisablen's Frontier Legion he could launch a pincer attack on the Madras duchy, which would end Duke Madras.</p><br/><p>\"He'll only turn to the Lormy duchy after all of this has been achieved. If the Union doesn't want the Lormo duchy to rejoin the empire, the 100-year conflict between the Union and the empire will restart again. However, the second highness would have reunited much of the territory of the former empire. He'll likely declare himself Emperor after he takes back the Lormo duchy. He'll be immortalized as the one who reunited the Krissen Empire, as Auguslo I,\" speculated Lorist.</p><br/><p>The vice-president looked rather pale, Lorist's guesses were well within the realm of possibility.</p><br/><p>He half-bowed to Lorist and said, \"Lord Count, I thank you for your kind hospitality over the last couple of days, but I believe the time has come for us to leave. We will handle the deal between you and the guild, so please rest assured.\"</p><br/><p>Lorist stood up and said, \"You're welcome to visit anytime you like. As our friends, you will receive the warmest welcome House Norton can give. Also, this here is my letter to the president. I'll have to trouble you to hand it to him on my behalf.\"</p><br/>\n</div>"}