{"title": "Chapter 256 The Haphazard War", "id": 256, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-256-the-haphazard-war", "volume_title": "Volume 3", "body": "<h1>Chapter 256 The Haphazard War</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Haphazard War</p><br/><p>The second bonus release of the week was brought to you by an anonymous donor. Enjoy!</p><br/><p>The Glass War that occurred during the 1st month of the year 1773 between the Forde Union and the Teribo Kingdom caused much distress among the military historians. There were many arguments regarding the event and no consensus was ever reached.</p><br/><p>One historian argued that the 30 years of peace enjoyed by the Union had caused their people to forget how to go to war. As for the performance by Teribo VII, it was even more laughable. During the war, which lasted for eight months, the confrontations were at most skirmishes over a village or two, there wasn’t a single account of either side launching a proper attack, or of a field battle between the two sides. The war was fraught with betrayals, surrenders, trades, and ploys, however.</p><br/><p>In the end, the war was recorded in the chronicles of Grindia as one that greatly influenced the political situation of the whole continent. Although the war lasted only eight months, it resulted in the destruction of the Teribo kingdom and seven other neighboring nations to vanish. In actuality, the conflict was a disorganized, brainless, and messy affair, nothing more than an insane banquet of insidious plots.</p><br/><p>If you were to read a whole book on the subject, you would be unable to breathe afterward. ‘Death by laughter’ would be written on your tombstone.</p><br/><p>Teribo VII, for instance, ordered a count, Count Edmund, at one point to attack Morante with his 500-thousand-strong-army. The count instructed his troops to march on Bluweck, a Union city in the Falik Plains, he even ordered the marching band to perform as they marched.</p><br/><p>One might argue that the count intended to use a hitherto unheard of tactic to confuse his enemy before launching the attack, but the truth was that he simply thought it was standard military procedure. The count’s troops actually did manage to confuse the garrison, if only because of the complete illogicality of their behavior. In fact, the garrison troops even thought the Union had struck some sort of agreement with the kingdom.</p><br/><p>The garrison didn't bother to stop the advance of the troops, they merely watched the performance. The soldiers even informed their captain to come out and receive them as guests. The captain, upon witnessing the scene, was confused as well. Why on earth had he not received any notice of their impending arrival beforehand?</p><br/><p>The kingdom’s troops, who, at this point, had marched to the gates of the city, hadn’t even bothered to send out scouts. The impression they gave was that of a friendly army. The garrison’s captain could only curse the messenger he believed to be drunk somewhere for not bringing him the notice due. Despite his misgivings about the situation, he headed outside to prepare the reception.</p><br/><p>And that was how one of the Union’s cities was lost. After the city’s successful capture, Count Edmund ordered his troops to continue on to Ritte. It, too, fell by the same token. Had Count Edmund known his success was thanks to the confusion his own ignorance had wrought on the enemy, he would have attacked a few more cities before the enemy could react. His fame would have soared overnight had he done so.</p><br/><p>It was a shame that he didn't. He thought, instead, that the garrisons had surrendered out of fear, that they had been terrified by his army’s confidence. He didn’t bother to question the two officers, whose names were indicative of their peasantry. He simply locked them up.</p><br/><p>What Count Edmund did pay attention to was the arrival of tea time. He was already rather satisfied with conquering two cities within a day and felt that he should throw a banquet during the night to congratulate himself. There were a number of noble-born widows in Ritte. The count felt that some might just choose to follow him after hearing of his magnificent military exploits.</p><br/><p>The count ordered his troops to lock down the city and prevent any entry or exit and prepared his magnificent banquet. As he went about preparing for his feast, his soldiers began harassing the citizens. At the same time, a patrol outside the city realized what had happened, and began to take action.</p><br/><p>The Union’s garrison forces couldn't really be blamed for being so careless. They had been indoctrinated with the idea that the Teribo Kingdom was a great ally to the Union. Even after the Mayflower Merchant Guild incident, most of the people felt that it was just some kind of freak accident that the higher-ups would sort out sooner or later.</p><br/><p>The other reason for the failure was winter. Even though the Falik Plains were far warmer than the Northlands during the winter, there had been no precedent for battles breaking out during the season. Most of the garrison had taken leave to spend time with their families. The patrol troops were left even more confused when they saw the kingdom's army advance with a marching band. Nobody would imagine that an attack would accompany the performance.</p><br/><p>During the evening, news of the kingdom’s 'attacks' and the loss two cities spread to Morante. In stark contrast to the cheers and excitement the city’s folk had shown when they had heard about the war, the big-seven guilds were completely terrified. They didn’t know how strong the kingdom’s forces actually were for them to be able to take two cities in a single night.</p><br/><p>It should be noted that the Union’s garrisons had experienced incredibly gruesome sieges in the past.</p><br/><p>It's no wonder that Teribo VII dared to threaten to go to war with us, thought the heads of the big seven guilds, who were under the impression that losing two cities was a testament to the might of the Teribo Kingdom's forces.</p><br/><p>However, they did not cower even though the enemy was already at their doorstep. Quickly, the Union decided to formally declare war. After considering the harshness of a dragged-out conflict, they announced that any citizen would be allowed to participate in the war, and those with contributions would also be awarded titles and land following the implementation of the nobility system.</p><br/><p>The Twinhead Dragon Merchant Guild's president, Cobleit William, solemnly took up the role of commander-in-chief. He had undertaken painstakingly careful preparations to combat the might of the kingdom's forces. The plan was to build an army and deploy it at Calidor, the third-closest city to the kingdom, and their next logical target, by the 3rd month.</p><br/><p>President Cobleit contacted the Calidor's garrison immediately and forbade them from going into battle, no matter how much they were provoked by the enemy, and make defense their only priority. As long as they could defend Calidor, the Union's army could use the same strategy they had used against the Krissen Empire a couple of decades earlier: the would drag the conflict on for as long as possible and bleed the enemy white. One the enemy was pale, they could launch a single, decisive counterattack that would end the war and give them ultimate victory.</p><br/><p>The Union didn't put much emphasis on military might. Despite being at war with the Krissen Empire for more than a century, their standing army had always been quite small. It couldn't even rival the forces of a standard, small duchy. The whole of the Union, across the rich Falik Plains, the Callisto Hills, and Hidegold Bay was only defended by three armed forces, namely: the garrison's of the respective cities, the patrol regiments, and the Invincible Fleet.</p><br/><p>Apart from Morante, seven other cities were located on the Falik Plains. However, each city was only defended by a 2 thousand man garrison. Morante was slightly better off. Their garrison numbered 4 thousand. The rest of the Falik Plains and the Callisto Hills were only defended by a small regiment of patrol troops that did monthly rounds.</p><br/><p>The most well-funded force was the Invincible Fleet, and that was mainly due to them having to deal with raiders and pirates on a regular basis. After all, those parties were what truly threatened the interests of the Union. There had also been suggestions to put the Invincible Fleet under the complete control of the Chikdor Merchant Guild since it was already the hegemon of the sea. The Union would no longer need to fund the fleet, it could instead leave it entirely to the Chikdor Merchant Guild.</p><br/><p>However, the Chikdor Merchant Guild rejected the suggestion, they argued that its fleets only engaged in ocean combat to protect its monopoly on the various trade routes. They even threatened to keep the fleet anchored at Hodegold Bay; it would serve only as a symbolic deterrent, without any actual combat capabilities.</p><br/><p>The most underfunded segment was the garrison forces. They enjoyed no sympathy from the council members, despite being as severely understaffed as they were. Some within the council felt that, since the Krissen Empire was no more and their neighbouring nations were all on friendly terms with them, it was time for the garrison forces under the direct command of the Union to be disbanded. The cities would have to rely on their own local militia garrisons to defend themselves. Of course, the reduction in expenditure was a great incentive for this opinion.</p><br/><p>It was a bad habit of merchants to skimp on any spending that wouldn't bring them profit. Every annual council meeting saw countless arguments concerning military spending. The big-seven guilds were markedly more rational than the rest, however. They had jointly vetoed the proposal to disband the state-funded garrisons as well as proposals to decrease the Invincible Fleet's funding.</p><br/><p>As a result, the retaliatory army formed by President Cobleit had a regiment of garrison soldiers from Morante and a regiment of light cavalry patrol troops from the Callisto Hills as its main force. The rest of the army included seven armed regiments belonging to the big-seven guilds, which were considerably more capable. The rest of the army consisted of civilian companies from smaller merchant guilds, mercenary bands, as well as some Moranites who wished to answer to the Union's call to arms. Within the span of three days, President Cobleit managed to gather an army of 500 thousand men, though they were naught but a ragtag bunch of troops.</p><br/><p>The president didn't mind the that it wasn't a cohesive unit, however. After all, the Union was quite experienced with siege battles. For the past century, it was with these 'ragtag forces' that the Union had resisted the invading Krissen Empire. The army would still be of much use in resisting the kingdom's forces.</p><br/><p>President Cobleit found the most comfort and confidence in the fact that his army contained a high number of high-tier fighters despite being not formally trained. For instance, the leaders of the mercenary bands were usually of the gold rank. Other than that, the seven groups of soldiers sent by the seven largest merchant guilds had all had their battleforce awakened, not to mention the blademaster that led them.</p><br/><p>While a group like that wasn't easy to deal with, it would definitely serve as a real pain defending against the enemy. Should the Teribo Kingdom wish to take the city, they would have to lose lots of experienced soldiers and high-tier fighters. This was the foundation of the Union which had resisted the Krissen Empire's 100-year-long invasion.</p><br/><p>Naturally, there would be a lot of factors at play on the battlefield that couldn't be accounted for beforehand. As countless military historians have pointed out, while the Union's army was a disorganized bunch, the Teribo Kingdom's army was nothing but a joke.</p><br/><p>When President Cobleit led the Union's forces towards Calidor to set up a defensive line, he heard some rumors from Ritte that sounded like something out of a legend.</p><br/><p>Count Edmund had already been held up at Ritte for three days, mainly because he got intimate with two beauties there and wasn't ready to part with them yet. So, the count reported to his king that he was sitting out battle during the winter. He stated that the bad weather made it incredibly hard for troops to travel. He would continue his advance when the snow melted a little bit more.</p><br/><p>Teribo VII was quite convinced with the count's excuse, given the count's reputation. He proceeded to wait patiently for news of the Union losing the war to come from the front lines. Never did he consider how long it would take for messengers to travel between him and the front.</p><br/><p>The night before President Cobleit arrived at Calidor, Ritte was thrown into utter turmoil. One of the garrison's top officers, gold-ranked swordsman Jessbon, had been absent during the original attack, of the original 2 thousand or so soldiers in the garrison, 1418 had escaped the city during the original assault. Of the remaining forces, 300 had been put to death for their resistance, and another 400 held captive.</p><br/><p>\"Brothers, our garrison force has always been neglected. Those council members can't wait to disband us and have forgotten the sacrifice and contributions we made during the Krissen Empire's invasion.</p><br/><p>\"Even though we are a proud unit, we also have a rather embarrassing record. We lost Ritte just like that. I refuse to live with the shame of losing the place we were supposed to defend. So, I will ambush our enemy tonight. Is there anyone here who is willing to die fighting alongside me?\" Jessbon had asked those who accompanied him.</p><br/><p>All 1 thousand 1 hundred plus garrison soldiers responded fervently. They would rather die in battle. So, they secretly snuck into the city under Jessbon's lead and began their suicidal assault on the city hall.</p><br/><p>Over the century-long conflict with the Krissen Empire, the Union's garrison forces had gained a lot of experience. For example, they knew that all walled cities had three or four secret paths to the outside which could be both used to escape in a time of crisis. Even if a city was taken by the enemy and heavily defended, the rightful rulers could use the secret paths to begin their assault and catch the enemy unawares.</p><br/><p>This assault was no exception. The thousand plus garrison soldiers' attack greatly surprised the troops occupying the city. As Count Edmund, who was staying at the city hall, heard the sounds of fighting encroach upon him, he jumped out of his bed naked and stretched out his hand. However, he didn't manage to grasp his clothes and instead caught his hands on a band he wore around his waist in formal attire.</p><br/><p>Count Edmund thus rushed out of the building naked without batting an eye. Arriving at the stables, he quickly took one of the horses and began riding. At the same time, the soldiers that barged into the count's room only saw two confused beauties. By then, the count had already managed to rush out of the city hall and went his own way.</p><br/><p>As for the soldiers who noticed the commotion at the hall, they hurriedly prepared to eliminate the enemy, only to be greeted with the sight of Count Edmund riding towards them butt-naked. As he swayed, he called out, \"I'm Count Edmund! Quick, let me through the gates!\"</p><br/><p>The gates had only been opened slightly when the count was already through and on his way to the horizon. Seeing that their general had run away, the soldiers who remained didn't bother to fight either and made their escape.</p><br/><p>So transpired the greatest recapture of a city in the entire history of Grindia. The Union's 1 thousand 1 hundred plus garrison soldiers' suicide attack against the 45 thousand Teribo soldiers stationed at Ritte ended with the enemy general, Count Edmund, escaping naked on horseback, and the remaining soldiers crumbling in disarray. There were roughly 10 thousand who escaped and 27 thousand who surrendered. It was said that the troops that surrendered even obediently stacked their weapons in a corner and lined themselves up by the streets in an orderly fashion.</p><br/><p>Regiment Captain Jessbon, who had become famous because of the battle cried that night. Where would he find the food needed to feed the 27 thousand prisoners?! Upon receiving Jessbon's message, President Cobleit hurried to Ritte to take in the prisoners.</p><br/><p>Count Edmund took two cities in a single day and lost them in a single night as well. After he escaped from Ritte, he went to Bluweck and shouted beyond its gates. There were 5 thousand Teribo soldiers stationed there. By the time the gates were open, clouds of dust had begun to form behind the count.</p><br/><p>Ah, that must be from the soldiers who escaped... Wait, what if they're actually the enemy? Gah, I have no time to differentiate between them!</p><br/><p>After finishing the thought, Count Edmund quickly fled to the Teribo kingdom.</p><br/><p>The moment the soldiers stationed at Bluweck witnessed his retreat, they thought that since the force of 45 thousand that went ahead of them had already lost, there wouldn't be much of a point to them remaining. So, they began their retreat as well. Bluweck was miraculously recaptured that very night.</p><br/><p>After two days, President Cobleit arrived at the border of the two nations with his 500 thousand troops. As for the conflict, the Teribo kingdom's forces crumbled even before any actual battle began. Given the situation, was the Teribo kingdom going to be on the losing side?</p><br/><p>Even though the big-seven guilds were considering what they should do to wrap up the situation, the smaller merchant guilds, mercenary bands, and volunteer soldiers were unhappy. Since all of them were there because they were promised land and titles for their achievements, if no battle occurred, wouldn't they have wasted their trip? So, the decision was made to breach the kingdom's border.</p><br/><p>After the big-seven guilds hesitated for two days, they received word that two of the kingdom's commanderies had already been conquered.</p><br/><p>The Mayflower Merchant Guild's president said, \"Since it has boiled down to this, let's just wipe Teribo out. We will need land to enfeoff for those with achievements, after all. Other than that, the simple-minded king will only cause us worry if left to his own devices right next to the Union. And since we already have the secret of glass production, we might as well take the source of their ingredients: Quartz Mountain. That would save us even more capital for venturing into the glass business.\"</p><br/><p>Since the Teribo kingdom is such a delicious dish, we shouldn't abstain from enjoying it now that it has already been brought to our mouths! thought President Cobleit as he grit his teeth.</p><br/><p>He converted his retaliatory army into an invasion force and sent it marching towards the Teribo kingdom.</p><br/>\n</div>"}