{"title": "Chapter 271 Battle Report", "id": 271, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-271-battle-report", "volume_title": "Volume 3", "body": "<h1>Chapter 271 Battle Report</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Battle Report</p><br/><p>Here's the fourth release of the week. Enjoy the read!</p><br/><p>Not a patron yet? Come support us at www.patreon.com/talesoflord if you feel so inclined! You'll be given a cool discord role on our discord server too! Pop in for a chat!</p><br/><p>\"Milord, why do you want the three other houses to expand their military? Not only would you have to provide them loans, you would also have to sell them weapons and equipment at a low price. Currently, our house's treasury has less than a million gold Fordes. Supervisor Hansk said that if you continue to spend so much money, we will no longer have enough for future developments,\" said Howard as the two were en route to Professor Balbo's gunpowder research lab.</p><br/><p>Lorist stretched out his hand to ruffle Howard's hair as he chuckled.</p><br/><p>\"And here I thought spending time with your fiancee had taken your focus away. I didn't think that you would be pondering a matter such as this...\"</p><br/><p>\"Milord!\" exclaimed Howard with dissatisfaction, \"I was just puzzled at why you did that...\"</p><br/><p>\"Haha, come on, Howard, I was just joking around. Don't mind me,\" Lorist said, \"There's a saying that goes like this, 'prepare an umbrella when the sky looks dark, or risk being showered like a roadside dog'. The situation our house is facing right now is a little similar to that. If we don't make ample preparations, we will be soaked in the rain when the time comes.</p><br/><p>\"I'm not that worried about the Chikdor Merchant Guild. Even if they're the so-called hegemon of the sea, they are, in the end, just merchants. I'm not worried about our expedition to the Hanayabarta kingdom either since they're naught but a bunch of pirates, slavers, and slave traders. They won't be able to resist our house's elite soldiers for long.</p><br/><p>\"The one person I'm most worried about is Second Highness Auguslo. Given his long-held ambition of becoming the emperor of the reunited Krissen Empire and his recent success in conquering Frederika despite the odds that were stacked against him, there's little doubt that he'll be on the winning side of the conflict at the Redlis kingdom.</p><br/><p>\"From the ambush, we can see that the second highness is indeed a brilliant strategist and not just an inept king. He really hopes that he can realize his ambitions one day. After exterminating the Redlis kingdom, his armies will most likely turn to the Iblia kingdom next. So far, given the status of the Iblia kingdom, there's no way they'll be able to resist the second highness's attack.</p><br/><p>\"Given that the Northlands is already under our full control, we don't really have anything to worry about. But, when the second highness completes his extermination of the Iblia kingdom and turns his troops to the Northlands, given how much of a control freak he is, do you think that he will allow the three houses, the Shazins, Kenmayses, and Felims, to control part of the Northlands? After all, they are nobles entitled by the second prince.</p><br/><p>\"Even if those three pledge allegiance to the second highness, the second highness's next move would be to try and split our alliance apart. He would either decrease their noble rank and take part of their territory away or move their territory to another place entirely. That way, the second highness will be able to stretch his claws into the Northlands. Salus and Redriver are both outside of the formal dominion of the house. The second highness would easily be able to come up with an excuse to enfeoff those lands to other nobles intentionally and cause conflict between us and them.\"</p><br/><p>\"But Milord, didn't the second highness say that he would make you the Duke of the Northlands? As long as the whole of the Northlands become yours...\" Howard said before he paused after seemingly realizing something.</p><br/><p>\"Hehe,\" Lorist chuckled, \"When the second highness said that back then, he was in a weak position, given that he had only just gained control of the Andinaq kingdom. He still required us to do the heavy-lifting, so he made all sorts of promises. But right now, he has control over 300 thousand soldiers. By the time he exterminates the Iblia kingdom, his power will be set in stone. The other nobles will flock to him in droves and his army might become even bigger. It's not impossible for him to end up with 500 thousand troops. Do you think he will keep the promises if this were to become the case?</p><br/><p>\"Our house focuses on raising elite soldiers. While we seem to have quite a huge number of troops right now, the actual land forces we have capable of participating in open field battles number only around 80 thousand. We're also going to war with Hanayabarta soon. Only two divisions of spear cavalry and one carroballista division, along with our knight brigade, will be left behind to protect the dominion once the expedition departs.</p><br/><p>\"Other than that, the mounted archers stationed at Hidebull Mound are there to resist any barbarian invasions. The other two local defense brigades are stationed at Tortoise Hill and Firmrock Castle respectively. As for our three police brigades, they're in charge of guarding our warehouses, prisons, labor camps, factories, and much more. The only ones remaining are the garrison squads of the various towns which are also responsible for the people's safety.</p><br/><p>\"If you look closely at this map, you'll come to understand that the western area of the Northlands has already been made into grazing plains for the livestock of our house, roughly 300 thousand cows and lambs are currently being raised there. In the next three years, the Fisablens will be providing us with another 600 thousand of them to fulfill their agreement with us to trade livestock for military equipment. The other three houses allied to us don't really mind that we're using the area to raise livestock since they will also benefit from purchasing some for themselves at a lower price.</p><br/><p>\"But if the second highness starts expanding his influence in the Northlands, the western livestock area is where he'll strike first. After all, it is not part of our dominion. There are many excuses he can use to take the livestock away and we'll be unable to do anything about it. Unless we want to fight against the forces of the second highness when they're in their prime, we will have no choice but to swallow the losses without complaint.</p><br/><p>\"Given the might of our house, we are able to recruit up to 300 thousand soldiers and are not afraid of the second highness's forces. In fact, we can even defeat him. But what good would that do us? Not only would it affect the lives of our subjects, we would also suffer great losses even if we defeat the second highness. And given that the second highness is our senior noble, going against him is treason.</p><br/><p>\"The ideal course of action is to strengthen the three houses allied to us and let them take the brunt of the second highness's assault in our stead. Our house will only have to provide reinforcement without actually being involved in direct confrontation. With a natural barrier like the Metropoulos River, I'd like to see if the second highness will be willing to send his troops to the grinder just to conquer the two suspension bridges. Either the second highness agrees to our conditions and leaves the Northlands under our control and that of the other houses, or he grinds against our allies until they give way.\"</p><br/><p>\"Milord, what if the second highness orders us to take out our allies? He's our senior noble after all,\" asked Howard.</p><br/><p>\"There would be no issue with that. Unreasonable orders from senior nobles can be refused with no repercussions. He has no right to ask us to betray an alliance we have formed,\" replied Lorist.</p><br/><p>......</p><br/><p>It had been two months since Lorist supplied some firearms to Professor Balbo to experiment on, and, just recently, the professor reported that he had made great progress. After sending off Baron Shazin, Baron Felim, and Count Kenmays, Lorist made his way to the laboratory as soon as he could.</p><br/><p>Professor Balbo, Grandmaster Sid, Grandmaster Julian and Grandmaster Fellin were all present. Upon getting into their seats, they began reporting their progress to Lorist.</p><br/><p>While Professor Balbo had yet to find any success making the canister shot ammunition that Lorist described to him, he did have a surprise in store. The professor took out a few bullets encased in a bronze shell.</p><br/><p>\"How did you make the primer for these rounds?\" asked Lorist.</p><br/><p>\"Milord, I simply had some fire crystal grains placed at the bottom of the shell with a piece of flint. When the hammer knocks against the flint, the smallest spark will ignite the fire crystals and set off the gunpowder in it as well. The gunpowder will then explode and propel the projectile outward,\" explained the professor.</p><br/><p>Grandmaster Fellin opened a red wooden box on the table and revealed two revolvers intricate golden patterns on their barrels and ivory grips. The ivory grip on one side had a carving of a beautiful woman and the other was carved with detailed patterns. Lorist thought they looked completely like the antique revolvers he had seen online in his past life.</p><br/><p>\"Oh? You guys actually managed to make the revolvers,\" mused Lorist with surprise.</p><br/><p>\"Yes, Milord,\" Grandmaster Fellin said, \"We spent two months making the two according to the designs you provided. I also handcrafted the bullets personally.\"</p><br/><p>\"Ugh...\"</p><br/><p>Lorist was speechless the moment he found that the parts of the two revolvers were all handcrafted by Grandmaster Fellin. His craftsmanship was at such a high level that even Grandmaster Sid wouldn't be able to compare. However, the problem was that Lorist had hoped that they would be able to find a way to mass produce the guns instead of having Grandmaster Fellin craft them himself. That way, the grandmaster probably wouldn't be able to finish more than a hundred guns even if he worked until he dies of old age.</p><br/><p>\"Do these guns work?\" asked Lorist worriedly.</p><br/><p>\"Of course they do,\" Grandmaster Fellin hurriedly replied, \"We tried firing them a couple of times. However, the firing range is quite short. A lead bullet fired from roughly 30 meters away can only punch through a wooden board as thick as a finger. If the gun is fired from 50 meters away, it wouldn't hit its target at all.\"</p><br/><p>Hmmm, so it has an effective firing range of roughly 30 meters... Any further than that, the bullet would go off course...</p><br/><p>\"Also, milord, we weren't able to make the automatically-rotating cartridge that's connected to the trigger mechanism. So, we had no choice but to borrow the dwarven gun's design. The hammer has to be cocked back for the next bullet to be loaded,\" said Grandmaster Fellin.</p><br/><p>Ah, no wonder the hammer looks a little large. It's so that it can be cocked by the hand more easily.</p><br/><p>\"Milord, you should also take note that the barrel will overheat after five quick shots. It must cool before it can be reloaded and fired again,\" reminded Grandmaster Julian.</p><br/><p>Well, I guess the material for the construction of the barrel isn't ideal either, for it to overheat after only five shots...</p><br/><p>\"Are there any other flaws?\" asked Lorist.</p><br/><p>\"Well, Milord, even though the bullet primers are made by me with each one containing the same amount, sometimes one or two out of five bullets would fail to ignite. I suspect that's because the flint piece didn't produce any spark,\" added Professor Balbo.</p><br/><p>Lorist was already completely speechless. In the end, the two revolvers are nothing but intricately-carved decoration pieces. It's no wonder that the engravings were so detailed. The product was meant only for admiring its craftsmanship. But no matter what, they were still the first two revolvers the house produced and they still had some historical value to them.</p><br/><p>\"Were the bullet shells all made by you guys personally too?\"</p><br/><p>\"No, we hired over 20 smiths and had each of them make ten shells. After that, we picked those that were roughly of the same size and gave them to Grandmaster Fellin for some polishing. We picked 73 of them and filled them up with the chemicals so they can be used with the guns. You can reuse these shells simply by filling them up with more gunpowder. We also have some molds for making lead bullets and a tool to fit the lead bullet into the shell,\" said the professor.</p><br/><p>As long as the shell was kept, one could refill it with gunpowder. That was a rather decent solution for limited ammunition.</p><br/><p>\"Alright, I'll take these two guns, the bullets, and the molds. You will no longer have to work on these anymore. Having grandmasters like you spend two months on these is a little too wasteful. You're no regular smiths, your talents can be put to far better use,\" said Lorist, much to the grandmasters' joy.</p><br/><p>\"Were there any difficulties you faced during testing?\" asked Lorist.</p><br/><p>\"Milord, we found that the main problem was that there was no suitable material available to us for the construction of the gun barrels. The ones on the guns we have now are made of steel. It's far from ideal, they overheat too easily. Also, making the barrels takes quite some time and effort. We also had to test different heat-resistant bricks to see if we could modify our furnace to see if we can directly cast molten steel into barrels,\" expressed Grandmaster Sid.</p><br/><p>Nodding in agreement, Lorist thought that he had been far too ambitious. Without establishing the more fundamental technological foundations, he had intended to leap straight into producing such advanced contraptions. Even though the grandmasters were able to make those two revolvers with much effort and time, the revolvers had too many flaws and were incredibly impractical to make. Grandmaster Sid was correct in that they had to discover a new material to make the barrel with before they could progress.</p><br/><p>\"Very well, Grandmaster Sid's statement holds true. It won't be good for us to rush this. The house will fund you for testing different materials. Also, right now, we're only using our water-powered machines to hammer and press metals. I wonder if you can try to make similar machines for hole-boring, cutting, and drilling? That would save us lots of manpower and time,\" said Lorist as he casually tossed a few rough blueprints of the machines he just named, which Grandmaster Sid took in a hurry as if they were heavenly treasures.</p><br/><p>\"Milord, right now our consumption of saltpeter is far too high because we are using 40 cannons to train our cannoneers. The production of saltpeter will no longer be able to keep up with the consumption in ten days,\" reported the professor.</p><br/><p>This is a new issue... After giving it some thought, Lorist replied, \"How about this? Decrease the amount of gunpowder used for the training sessions. It'll be enough as long as they can fire the cannons. Ration the gunpowder we give to the cannoneers and caution them to use them sparingly. Other than that, I will invest more funds into making a few more mining valleys near the Bladedge mountains to increase its production.\"</p><br/><p>......</p><br/><p>After leaving the gunpowder research lab, Lorist rushed to the port city. Senbaud's fleet had returned the day before and they would be leaving after a day of rest to transport soldiers to Silowas.</p><br/><p>Engelich and Loze would also be sailing aboard the Flying Fish of Dawn to the Sea of Grief to expropriate more ships while Lorist had to stay at the dominion.</p><br/><p>Within the main camp at the port, Senbaud and the rest welcomed Lorist's arrival.</p><br/><p>\"Senbaud, you shall stay here the day after tomorrow and leave the fleet to Uncle Torin. Let them depart first,\" said Lorist.</p><br/><p>\"Understood, Milord,\" replied Senbaud, even though he didn't understand why Lorist instructed him to do so.</p><br/><p>\"Do you see the Windstorm over there? That's your new flagship. You have to familiarize yourself with it before you set sail,\" said Lorist as he pointed to the new ship that was docked at the bay nearby.</p><br/><p>With his eyes gleaming, Senbaud praised, \"What a beautiful ship, milord. But can't I just get used to sailing it during the journey itself?\"</p><br/><p>\"No, Senbaud. This ship is not anything like the regular ones you have sailed. This is the only invincible warship on the whole of Grindia so far. You'll understand what I mean when you get on board,\" teased Lorist.</p><br/><p>\"Very well, Milord. I shall carry out your will. Also, this is the battle report submitted to us from Knight Lundmorde at Morante,\" said Senbaud as he handed over a thick back of documents.</p><br/><p>Lorist took one out and realized that it detailed the war effort of the second highness at the Redlis kingdom. Huh? This doesn't look right... Why hasn't the second highness wiped out the Redlis kingdom's resistance yet?</p><br/><p>Not counting the force stationed at the border of the Madras duchy as well as the garrison forces within the Andinaq kingdom, the second highness should have around 240 thousand soldiers. With the occupation of Frederike and the surrender of the 70 thousand troops defending Kanbona Province, the second highness should have more than 300 thousand men at his disposal.</p><br/><p>But after the nobles at Anderwoff refused to surrender to the second highness, and the first failed attempt at wiping them all out, the second highness turned to a more gradual strategy and managed to obtain a victory by conquering Anderwoff. However, the remaining nobles banded together and were still resisting in Majik. It also seemed that they had received large numbers of reinforcements as well, further strengthening their forces.</p><br/><p>Weird, why is there no news of the first prince? It's only mentioned that he's missing after escaping from Frederika, thought Lorist as he continued flipping through the pages.</p><br/><p>The second highness had split his 300-thousand-strong force into three units. One unit was stationed at the Lormo duchy's border as a threat for them to relinquish their autonomy and fall under the banner of the empire once more. Another unit was busy sweeping clean the riches of the nobles within the territory of the Redlis kingdom while pillaging their resources and food so that the main force would have enough sustenance. The last unit was marching towards the Redlis kingdom's final province, Majik, and would be engaging the traitorous nobles there.</p><br/><p>The second highness seems a little too rushed, commented Lorist.</p><br/><p>He took out a report concerning the war between the Teribo kingdom and the Union.</p><br/><p>The moment he read it, he was dumbstruck. What the hell is going on? Why are the Urubaha and Teria duchies wiped out from a conflict that's supposed to involve only the Union and the Teribo kingdom? Add to the fact that the Urubaha duchy is thousands of kilometers away from the Teribo kingdom, and is separated by the Tedanini mountains and two other smaller nations, how in the world was it wiped out?</p><br/>\n</div>"}