{"title": "Chapter 277 Hector and the Slave Camp", "id": 277, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-277-hector-and-the-slave-camp", "volume_title": "Volume 3", "body": "<h1>Chapter 277 Hector and the Slave Camp</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hector and the Slave Camp</p><br/><p>Here's the fifth chapter of the week~ I'll be taking a test early next week (well, tomorrow, to be exact), so expect updates to come around the latter part of the week. See you again soon!</p><br/><p>Karman did not disappoint. He quickly gathered up the slaves at the port and began to set up camp. He also sent some slaves who were familiar with the islands and terrain to serve as guides and aided with the occupation of the warehouses in and out of the walls. He also managed to recruit other slaves to his cause and set up tens of youth slave squads numbering around a hundred men each to keep the camp in order. Not only that, he also had the women and children help out with other chores such as cooking food and making soup, greatly contributing to the Norton forces.</p><br/><p>Being the most well-known slave trading area, Nupite was considered a rather large city, even though the inner walls weren't that large. Ever since the founding of the kingdom, the city's walls had never once been assailed by enemies, so the slavers and slave traders turned complacent and began expansive development at the outer part of the cities away from the defense afforded by the inner walls. They built mansions, manors, warehouses, and trade areas, all of which had fallen into Lorist's hands.</p><br/><p>Countless slaves gathered together joyfully and the newly set-up camp continued to grow in size. The slavers and traders cried and cursed from the top of the walls as they watched one warehouse after another pried open and stripped bare.</p><br/><p>At three in the afternoon, the guards on the inner walls began to throw flaming torches down to light up the houses built along the sides of the inner walls. Perhaps they had intended to use the flames to torch all that was outside the walls, but Lorist reacted quickly and had the slaves aid the family forces to set up an isolated area beyond which the fire could not spread just shy of the of the ballistae on the walls' range, thus foiling the enemy's plan. He had his own ballistae firing at the walls all the while, inflicting severe casualties on the those atop them.</p><br/><p>In the evening, a group of soldiers Lorist sent out to scout brought some good news: they had found Hector, the chief secretary of Silowas, much to his surprise and delight. The slave camp they had built held around 80 thousand people, but that number was still shy of a third of the total slave population on the archipelago. There was little doubt that the population in the camp would grow explosively over the coming days, so Lorist was glad to hear that Hector would be able to return to his service and manage the area. Lorist had much else to do.</p><br/><p>When the slavers attacked Silowas, Hector could have retreated to Farama Village first. But just as he was leaving Whitebird Town, a group of slavers was on their tail and Mayor Hugo brought ten or so youths with him to keep them at bay. Hector, on the other hand, was busy evacuating the panicked townfolk, which had cost him the time he needed to escape, leading to his eventual capture.</p><br/><p>The only thing Hector could find solace in was the fact that he had moved his family members to the Northlands back when he thought that the Chikdor Merchant Guild would attack the island. He was glad he wouldn't have to worry about his family's safety. He had witnessed more than a few tragic moments, of families being broken apart, during his voyage to the kingdom.</p><br/><p>To Hector, the slavers were nothing but uncultured beasts wearing the skin of men. They did not contain a single shred of humanity. Putting aside the slaughter of the elderly and injured before leaving the island, during the ten-odd days of sailing back to the Hanayabarta kingdom, they violated every single woman on the ships save a few nubile maidens picked and saved for the slaver nobles.</p><br/><p>Hector, on the other hand, was rather lucky as his captors had noticed his talents during the voyage. Upon knowing that he was the chief secretary of Silowas and graduate of the Krissen Empire's Mobor Academy, the slavers did not treat Hector as they did the other slaves. Instead, they had him become a bookkeeper to handle the miscellaneous matters of a company at Nupite.</p><br/><p>When the Norton forces took over one warehouse after another, Hector was flabbergasted. He had thought that Lorist would at most send a representative to ransom him and the rest of the knights. He didn't think that Lorist would be able to mount a full-scale attack in just three short months.</p><br/><p>During the day, Hector continued his work in the warehouse as usual without knowing about the situation outside. It was not until he saw the troops dressed in Norton standard issue armor that he announced his identity and was brought before Lorist.</p><br/><p>After some consolation and pleasantries, Lorist quickly assigned Hector some tasks. Hector felt his head numbing when he saw the thick stack of documents on the table and started to miss his job back at the warehouse.</p><br/><p>\"Milord, you've given me so much to handle, but do you have anything you want me to focus extra effort on?\" asked Hector.</p><br/><p>Lorist realized that he shouldn't have asked Hector to take care of every single matter, trivial or not, and said, \"How about this... Just deal with the matters of the slave camp. The main priorities of the house are to rescue our knights and officials that were captured and avenge the deaths of our good folk during their assault. As an aside, we're going to glean as much wealth as possible from the kingdom to solve the lack of funds our house is facing.</p><br/><p>\"To be frank, this deployment is an incredibly risky endeavor. Apart from a few select high officials of the house, the rest are not aware that we only had little more than a week's worth of supplies before we took over the resources here. In other words, our fleet wouldn't have enough food for a return trip. Had we encountered misfortune on the way here, the tens of thousands of troops would very possibly perish.</p><br/><p>\"That's why, the forces will have to rely on this place to get our supplies, and it is crucial that we get the help of the slaves for this. I have declared that we came to take revenge on the slavers as well as to liberate the slaves of the archipelago, with the condition that they must first be organized. Otherwise, the whole situation would fall into chaos with vengeful slaves messing up our plan and causing a huge fiasco.</p><br/><p>\"The Hanayabarta kingdom has more than 400 thousand slaves, with more than 100 thousand located at the plains near Hamidas. The other 200 thousand are most likely located around the area of Port Nupite. Today alone, we have taken in more than 70 thousand slaves. Countless more are due to arrive in the next week. The key of your task is to manage them well enough so they can aid our forces in our expedition.</p><br/><p>\"Milord, I understand. I will definitely make sure that they're in good order,\" said Hector.</p><br/><p>Lorist shook his head and said, \"Hector, don't treat these slaves like normal refugees, that will be to your detriment. You can't allow the slaves to spend long periods of time in the camp with nothing to do. The key is to keep them occupied. The thing I'm most worried about is that these slaves will launch a revolt against the slaver nobles right away the moment they are freed, setting fire to the manors and mansions if they are unable to find their tormentors. This situation is so volatile that it may erupt at any moment.\"</p><br/><p>Lorist handed Hector a document.</p><br/><p>\"Read through it,\" he said, \"We have two warehouses' worth of linen cloth from our spoils. I have already instructed for it to be sent to the slave camp to be made into clothes for the slaves. I want to gain their trust and confidence, and show them that our efforts to liberate them are sincere, not some ploy to trap them.</p><br/><p>\"Doing so will also keep the slaves occupied instead of letting them dilly-dally around the camp with nothing to do. The latter is just a recipe for disaster. Some of the more ambitious slaves could use this chance to rally some minions and push the others in the camp around. The moment that happens, it will become a huge pain for our house. You should be aware that there are over 300 thousand slaves on the whole of the archipelago while our forces only number around 40 thousand.</p><br/><p>\"When you manage the camp, put your efforts into these few things. First, form a smith camp and have slaves with any sort of skill in crafting assigned there. Second, form a few patrol brigades from a few strong reliable youths to keep the order of the camps. Third, screen the slaves and pick out any bad apples, especially those that have oppressed other slaves on their masters' behalf. Kill those who have blood on their hands and put the others into a camp for hard labor. Those are the ones who will cause the most trouble.</p><br/><p>\"Additionally, make sure to pay extra attention to our captives. I will assign two heavy-armored brigades and one wheelbarrow-ballista brigade to you that will be in charge of watching the captives and our supply stores, and as a precaution against any form of revolt or chaos breaking out in the slave camp. Should that ever happen, mobilize those three brigades to quell any resistance. We must ensure that the slave camp is kept in order at all times.</p><br/><p>\"I've already instructed the Oceanic Legion to scour the surrounding islands. They will bring more captives and slaves here over the next few days. The population of the slave camp will easily shoot past 300 thousand. As it's already the 9th month and the harvest season, we should not waste the food planted around the island. You may organize some slaves to help out with the harvest, and if there are any who wish to stay on the island after this whole ordeal to make a life for themselves, we can promise them farmland here. They can settle down here as our subjects and enjoy a life of bliss and stability.\"</p><br/><p>\"Milord, are you saying that you're going to make this place a dominion of the house?\" asked Hector.</p><br/><p>\"That's right,\" Lorist nodded and said, \"I intend to exterminate the Hanayabarta kingdom and make this the overseas dominion of our house. After screening those slaves and rooting out the troublesome ones, you can assign those who are willing to stay back here on the archipelago to help us out. The house will provide them with living necessities as well as farmland and houses.\"</p><br/><p>\"What about the captives, Milord? How should we handle them? Let them work hard labor?\"</p><br/><p>\"Hard labor? Hehe, only in their wildest dreams. They aren't even qualified for that,\" Lorist said as an insidious smile surfaced on his face, \"Ask the soldiers of the house whether they're willing to let those murderers off after seeing the state of Silowas. Only humans serve hard labor, not animals. Let me be honest with you, Hector, I'm not going to spare a single soul of the citizens of the Hanayabarta kingdom, whether they be nobles or commoners. I will kill every single one of them to make an example for the rest of the world to see...\"</p><br/><p>Hector felt a chill down his spine from the seething killing intent radiating from Lorist.</p><br/><p>\"Milord, I understand that the slavers and slave traders are deserving of death. Their soldiers that have committed so many atrocities are no different either. But you can't kill the commoners, especially those innocent women and children... They of all people should not be your target to vent your rage on...\"</p><br/><p>Lorist smiled while shaking his head as his gaze turned ice cold. \"Hector, I know you are a good man. But you've forgotten that the Hanayabarta kingdom is a nation built on the suffering of countless slaves. The commoners, including their women and children, are guilty by birth. While some of them did not personally take the life of a slave, it doesn't change the fact that they're benefitting off the blood and tears of the slaves. Now, the time of retribution is upon them. They will not be able to escape it.\"</p><br/><p>\"Milord, we have more men than woman and most of them are young and fit, can't we draft the female captives into a harlot camp to serve those slaves that serve our house? Also, if they wish to settle down here, they may take those captives as wives. Our soldiers will also need an outlet for their lust after all the killing, right? I think that at the very least, taking the female captives into the harlot camp as atonement for their sins is far better than killing them off just like that,\" suggested Hector as a compromise.</p><br/><p>Lorist fell into deep thought and finally said, \"You're right, Hector. I'll leave this matter in your hands. Remember, maintaining the order of the slave camp is of paramount importance.\"</p><br/><p>\"Understood, Milord. I will start working right away,\" said Hector before he bowed.</p><br/><p>\"Take these documents with you. Also, I will have Karman, who's in charge of the slaves right now, come see you. He's a slave himself but has a three-star iron battleforce rank. He's a trustworthy one and you can make him the leader of the slave patrol squads after they are formed. Tell him that if he manages to break through to the silver rank, I will take him in as a household knight.\"</p><br/><p>\"Understood, Milord.\"</p><br/><p>Hector left hurriedly and would be busy for quite a while. Lorist sat down in his chair and breathed a relieved sigh.</p><br/><p>War was not just about charging into enemy formations and slaughtering away. It was a complicated intertwined web of logistics, food supply, casualty management, defensive patrols, and stationing troops. Only when all those aspects are taken into consideration would the end result be a favorable one. While 40 thousand elite troops were more than enough to wipe out the Hanayabarta kingdom, managing the 400 thousand slaves was the key to realizing the goals of House Norton.</p><br/><p>Potterfang entered the tent and said, \"Milord, your instructions have been fully carried out. More than 2000 captives have been decapitated and their heads are already in the process of being embalmed. The headless corpses are being buried by the slaves. Also, the cremation of our dead troops by the pyre is also complete and their ashes have been gathered up.\"</p><br/><p>Potterfang hesitated for a while before he continued, \"Milord, I don't understand why you gave that kind of order. What would you do with the heads of the enemy? You also instructed Fiercetiger Loze to do the same and bring the heads with him when he comes over. What good will this do?\"</p><br/><p>Lorist smiled and was just about to speak when a guard rushed in from outside the tent and reported that an ambassador carrying a white flag had been sent from the inner walls of the city.</p><br/><p>\"I'll answer your question later, Pog. Let's see what those ravenous wolves have to say for themselves.\"</p><br/><p>The ambassador representing the slavers in the inner city was an old man, who introduced himself as a viscount of the Hanayabarta kingdom with no hereditary dominion. In other words, he was merely an honorary noble who had been picked to be the ambassador after drawing an unlucky lot.</p><br/><p>Lorist and Potterfang were seated within the tent and the old man began to make his objections heard.</p><br/><p>\"Do you know that your mobilization in our territory is an affront against peace and our kingdom? You have brought blood and fire with you and caused us nobles of the kingdom to sustain severe losses! This is not something we are willing to forgive and put behind us!\"</p><br/><p>Lorist laughed heartily before he stood up and said, \"I'm sure you know very well who I am, where I'm from, and why I came. I'll get straight to the point. Since you lot were daring enough to attack my house's dominion, you better be ready to accept our retribution. Don't tell me that you're willing to reimburse us for our losses. To be honest, there's nothing you can do to make up for our losses unless you can revive the poor people you killed on Silowas.\"</p><br/><p>Lorist patted on the shoulder of the old ambassador in a friendly manner.</p><br/><p>\"We are reasonable men. Since you're here as an ambassador, we won't harm a single hair of yours. Even though we're at war, we will treat ambassadors well, so you don't have to be so afraid. We'll definitely see to it that you'll make it back safe and sound. Tell those in the inner city to have a good meal and enjoy the night, since it'll be their last. It's best if you bathe yourselves properly too. That way, the weapons of my soldiers won't be dirtied when they cut you down tomorrow.\"</p><br/><p>The old man shivered uncontrollably and forced himself to stammer out a response.</p><br/><p>\"We w-will not s-submit... We still have si-six blademasters... W-we can hold on u-until the f-forces of the k-kingdom r-reinforce us...\"</p><br/><p>\"Ah, wonderful,\" Lorist said gleefully, \"Just this noon, I killed only three blademasters, but it wasn't satisfying enough for me at all. I hope that your six blademasters can last longer and not let me down. As for that king of yours... Don't worry, he will be buried alongside you soon enough.\"</p><br/><p>The ambassador collapsed and burst out into tears as he made his way back whence he came.</p><br/><p>\"Pog, bring some men with you and head to an empty lot of land outside the inner walls. Stack the embalmed heads into a pyramid. As for the heads of the four blademasters, put them up on a stake and display them in front of the head pyramid. Make sure to put some torches there so the pyramid can be seen clearly even at night,\" said Lorist.</p><br/><p>\"Milord, you intend to...\"</p><br/><p>\"Don't ask, you'll understand it when it's done.\"</p><br/><p>A hundred meters from the walls of the inner city, Potterfang cleared a piece of land and began to stack the heads on one another. Even though the plot of land was within range of the ballistae, and orders could be heard barked on the walls, they never fired. The threat of return fire from the wheelbarrow ballistae was too great. The guards could only wait to see what the Nortons were up to. It didn't appear they would be attacking anytime soon.</p><br/><p>When the few carriages' worth of heads were sent over, some of the Norton soldiers with more courage than the others began to build the head pyramid amidst the silence of the night. It was so quiet that Potterfang was even able to hear the chattering of his own teeth. During the deathly silent hour, the construction of the pyramid took, not a single arrow was fired from the walls.</p><br/><p>Ah, so this will terrify the enemy and greatly lower their morale, figured Potterfang.</p><br/><p>At two in the morning, a guard rushed into the tent, woke Lorist, and reported, \"Milord, the enemy has breached encirclement! All of them charged out from the rear entrance towards our defense lines without regard for casualties and attempted to escape! Our troops stationed there were unable to handle the sudden surge of fleeing people. Blademaster Engelich also called for reinforcements to help hunt down the escaping enemies.\"</p><br/><p>Good Sol, to think that the structure would actually scare them shitless to the point of reckless escape, thought Lorist frustratedly.</p><br/>\n</div>"}