{"title": "Chapter 279 Changing Strategic Arrangements", "id": 279, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-279-changing-strategic-arrangements", "volume_title": "Volume 3", "body": "<h1>Chapter 279 Changing Strategic Arrangements</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Josk and Yuriy returned the next day. Both looked incredibly haggard. Well, anyone would look like they did if they only just managed to escape being chased by three blademasters for a whole night.</p><br/><p>The order Lorist had given them was to lock down the route between Nupite and Hamidas so the news of the port's assault and fall wouldn't spread to the capital. During the afternoon of the day before, they arrived at the target location with their scout brigade and began to set up their defensive line after picking a place to set up camp. They even managed to capture a number of messengers heading for Hamidas. All seemed to be going well.</p><br/><p>But a day later, Josk and Yuriy noticed the appearance of a convoy of carriages guarded by a substantial cavalry detachment. They were initially able to stop them from advancing, but, as time passed, more and more enemies began to arrive. They easily numbered ten thousand. Eventually, they launched a full-scale assault on the brigade's position.</p><br/><p>Josk and Yuriy believed that the enemies had escaped from Nupite and were prepared to stop every one of them. They had their scouts occupy the high ground around the path for ease of interception.</p><br/><p>Despite making two frenzied charges, the enemy did not succeed in dislodging the scout brigade from their positions and suffered heavy casualties. Their corpses littered the road. They responded to the situation by breaking their forces into two units. One was sent against each of the enemy positions whilst their carriages charged down the road once more. In order to prevent a sidestep along the other side of the road, the scout brigade had to spread itself too thin to cover both sides of the road. They were unable to bring their full force to bear on either of the two units and began to waver. Things soon broke into chaos.</p><br/><p>Josk and Yuriy were targeted by three blademasters right away. Josk's marksmanship could threaten a rank 1 blademaster, but it was not able to do the same for those of higher ranks. Unfortunately for the two, the enemy had exactly a rank 2 blademaster among their number. The blademaster quickly understood the situation and pursued Josk relentlessly. If not for Yuriy's desperate assistance, Josk might have met his end. The two were quickly separated from their troops and had to spend the whole night running around before they finally shook the blademasters off.</p><br/><p>When the two regrouped with their troops, they counted 1000 casualties, and that despite the fact that the enemy had only fought to break through their lines, and not to eradicate or exterminate them. Seeing that their troops were tired and worn, the two of them decided not to give pursuit and instead brought the men back.</p><br/><p>While it pained Lorist to admit it, Josk and the others knew that his actions had been a grave error. Underestimating the enemy and treating them like a pack of wild dogs, Lorist thought that he would be able to overwhelm them by stacking the last proverbial straw, hence his decision for Josk and Yuriy to intercept them initially. Had the scouts allowed the enemy to use the path and employed hit-and-run tactics by attacking from their rear, in which their advantage of ability could be fully utilized, they might have been able to cause huge damage to the enemy, far more than the 8000-odd kills they had.</p><br/><p>Waving his hands to dismiss the two of them, Lorist began to think with a solemn expression. It seems that this expedition is not going as well as I had hoped. I guess exterminating a whole kingdom was never going to be an easy task. While the enemies at Nupite didn't even stand a chance, the things that happened after the first attack has been one accident after another.</p><br/><p>With only 8000 enemies killed, at least 15 thousand will make it back to Hamidas, and I'm sure they have quite a few high-tier fighters in their ranks as well. The royal capital is also guarded by 28 thousand soldiers of the royal family's defense legion. Taking into account the conscription of the slavers who make it back, it is extremely possible for them to cobble together over 40 thousand men. Should that be the case, their military might will rival my own...</p><br/><p>After a rough estimation of his troop numbers, Lorist concluded that the two heavy-armored divisions and one wheelbarrow-ballista division each had 15 thousand men left. Given that he left two heavy-armored brigades and one wheelbarrow-ballista brigade back at Silowas, he only brought around 36 thousand men with him. Coupled with the Thunderbolt Brigade's catapults, the scout brigade, his two guard regiments, and Senbaud's Oceanic Legion, he had 46 thousand men.</p><br/><p>However, Senbaud's Oceanic Legion could not participate in land battles, unless Lorist no longer wanted to return to his dominion. The post-landing casualties so far amounted to 5000 men. This meant that he only had 38 thousand able-bodied men left. After assigning a heavy-armored brigade and a wheelbarrow-ballista brigade to Senbaud to sweep the other islands, that number decreased by another six thousand. Add to the fact that he left a company of a hundred heavy-armored troops on each of the 27 islands to stand guard, up to another brigade's worth of men were no longer available. Additionally, the two heavy-armored brigades and one wheelbarrow-ballista brigade he would be stationing at Nupite meant that Lorist only had a little over 20 thousand soldiers for the march to Hamidas.</p><br/><p>Though Lorist felt like crying from his frustration, he was not able to tear up. With only 20 thousand men available to him, forget about taking Hamidas, it would already be fortunate for him to not be encircled by the enemy midway there. If he were the king of the Hanayabarta kingdom, he would forcefully conscript another 60 thousand young slaves and mount a suicide attack on his camp. He would use the assault to exhaust the enemy's ammunition stores and take things from there. He would likely not win the battle, but it would definitely severely wound the enemy. Not only would the capital be safe, the kingdom might even stand a chance at retaking Nupite.</p><br/><p>No, this won't do. I'll have to reorganize the distribution of my forces. Attacking Hamidas will require at least one complete heavy-armored division and three wheelbarrow-ballista brigades as the vanguard. Coupled with my one thousand guards and another two thousand scout cavalry troops as well as the Thunderbolt Brigade, I will have close to 30 thousand troops. If I can form another five police brigades with the slaves, we should be just a little shy of 40 thousand men.</p><br/><p>Lorist sighed and reminded himself that war was no children's game and that describing military might by only approximating numbers was incredibly unwise. Despite that, he had to consolidate the number of his veteran soldiers. Only by being able to do so could he obtain victory and minimize his losses. Using untrained slaves on the battlefield was a double-edged sword. While he could superficially inflate his numbers by doing so, the first troops to collapse into disorder when the battle broke out may very well be those slaves. The chaos that would inevitably ensue thereafter might also cause them to turn back in an attempt to escape and disrupt the formations of his main forces.</p><br/><p>Forcing the slaves to act was no great feat for the Hanayabarta kingdom. If they refused to comply, they could simply put some to death to scare the rest into submission. However, there was no way Lorist could employ such a method. He had justified his attack with the liberations of the laves, doing such a thing would go against his stated goal and undermine his position.</p><br/><p>A simple mistake during the first conflict had cost Lorist so much. If the enemy could be wiped out when they were within the inner city itself, then the Norton forces would be able to show up at Hamidas without anyone noticing. Even if they weren't able to wipe out those in the inner city all at once, they could still keep the enemy trapped within and slowly claim the land around the capital with the help of the slaves' support and gradually deal with Hamidas.</p><br/><p>But now, he had to prepare for open field battles. The Hanayabarta kingdom would definitely mobilize their troops. The fact that so many people were able to escape from the inner city was a testament to the low number of troops the Nortons had brought with them. Even idiots would not sit around helplessly and watch their doom encroach upon them. The next step the Hanayabarta kingdom would take would be to conscript more soldiers and send out some troops for reconnaissance as well as attempt to drive the Norton troops back to sea.</p><br/><p>Lorist summoned his guards and instructed them to pass the order down for a few gold-ranked knights and Blademaster Engelich to go to the city hall of the inner city for a meeting on revising their strategy.</p><br/><p>During the night, the main hall of the building was illuminated by candlelight. Lorist pointed at the map of the Hanayabarta kingdom as he briefed his subordinates on the current state of affairs.</p><br/><p>Potterfang asked, \"Milord, do you mean to say that we're no longer able to attack Hamidas head-on with our soldiers?\"</p><br/><p>\"Pog, if you're the king of the Hanayabarta kingdom, what would you do when you receive reports of our invasion?\" questioned Lorist.</p><br/><p>After giving it some thought, Potterfang said, \"I would mobilize my troops immediately to conquer the hilly area between Nupite and the capital and set up defensive lines there to prevent our forces from entering the plains where the capital is located. After that, I would send out scouts to gain an understanding of the might and distribution of the enemy forces, all the while conscripting more soldiers to aid with the war effort. If the enemy forces are not enough, I would choose to drive them back to sea and take back Nupite.\"</p><br/><p>\"Not bad, Pog. Your hypothetical is spot on. While we don't know for sure whether that's what the enemy will do, it's best if we no longer act carelessly and give them the benefit of the doubt. Tomorrow morning, the five reorganized heavy-armored and wheelbarrow-ballista brigades will have to march to the hilly areas to set up a line of defense before the troops of the kingdom do so.</p><br/><p>\"This unit will be led by Fiercetiger Loze with Malek as his vice. Pog, since you're injured, stay here to guard the port. Josk, Yuriy, take two thousand mounted scouts and keep an eye on the enemy's movement, patrol the supply routes to Loze and Malek as well. Also, send some troops to the plains' slave farms and free as you can. Cause as much trouble as possible. Don't allow the enemy to harvest their crops, we need to keep our siege as short as possible, understood?\" asked Lorist as he thumped on the map.</p><br/><p>\"Understood, Milord,\" replied Josk and Yuriy in unison.</p><br/><p>\"Preserve as many of your men as you can; don't clash with the enemy if you don't have to. Your advantage lies in the fact that you're light cavalry, meaning that you can easily escape enemy pursuit. Since the Hanayabarta kingdom doesn't breed horses, and they only have around 1800 cavalry, they're greatly inferior to us on that front. If you have a chance, wipe them all out in one go.</p><br/><p>\"Another thing, if you do manage to cause chaos at the plains near the capital, the enemy will definitely hate you to the bone. They might just send out blademasters to wipe you out the moment they spot you. Knowing that you can have Malek and Loze set traps for the enemy blademaster and deal with them using our steel ballistae. Don't use our scouts to engage the enemy head-on like you did yesterday,\" warned Lorist.</p><br/><p>\"Yes, Milord, we will definitely pay attention to that,\" said the both of them with a slight flush of embarrassment.</p><br/><p>\"Pog, it is really important for you to stand guard at Nupite. The house only mobilized eight heavy-armored brigades, but we've already got more than a brigade's worth of incapacitated troops, not to mention the other thousand cavalry scouts and two regiments of wheelbarrow-ballista troops. I've already ordered Senbaud to stop sweeping the neighboring islands for now to consolidate our forces. When he sends the rest of our troops here, reorganize two heavy-armored brigades and one wheelbarrow-ballista brigade and deploy them to the frontlines to reinforce Loze. Other than that, order Ovidis's Thunderbolt Brigade to head out at the same time. It will become our main force against Hamidas.</p><br/><p>\"Gather all the injured in the inner city and leave a brigade of heavy-armored troops and another regiment of wheelbarrow-ballistae to guard them. I will also have 500 of my personal guards stay behind. That way, the remaining heavy-armored brigade can be disbanded, reassign the men as senior officers to the police slave brigades.</p><br/><p>\"I will give you five days. After the formation of the ten police slave brigades, send five of them to bolster our ranks at the frontlines where they can also receive preliminary training to get them into shape. Senbaud will be assigned two of the remaining five brigades as well as another regiment of wheelbarrow-ballista troops to continue the island-sweeping operation. The other three brigades will be in charge of helping out with supplying the frontline troops and will be our rearguard.</p><br/><p>\"We've already conquered Nupite and the supplies here, including the food and equipment, are quite plentiful. So far, we've no need to worry about being unable to sustain our troops. The ten new slave brigades may take as many supplies as they need. So, you must be vigilant in the selection of the slaves that join the ranks. They will be treated the same as proper soldiers of the house, and their family members will also be allowed to enter the inner city to help us with various tasks such as caring for the injured. Make sure to compensate them for their work, understood?\"</p><br/><p>Potterfang nodded and said, \"Milord, I got it. I will make sure to turn their allegiance to us as soon as possible and make them feel proud to be House Norton's soldiers. However, after we form the ten police brigades, who will keep the order? As of today, we have more than 30 thousand of them here.\"</p><br/><p>\"I've already instructed Hector and Karman to aid you however they can. After the formation of the ten police brigades, more slaves will be recruited to form some defense units. After each island is swept, leave behind around a hundred to three hundred men from the defense units to stand guard. Two additional defense brigades will also be formed from the slave camp. The rest of the men will fish, harvest, and transport supplies. We have to keep them occupied.</p><br/><p>\"Also, Josk, Yuriy, before you two leave tomorrow, head to the slave camp first. Karman has assembled a group of slaves who are familiar with the layout of the terrain around the capital. They also have quite a number of other acquaintances there. With their help, the slaves at the plains will be able to trust that we've truly come to rescue them.\"</p><br/><p>\"Alright, milord,\" replied Josk.</p><br/><p>\"Engelich, I suppose you should leave with Fiercetiger Loze and the rest to guard the frontlines. That will be all for now. Does anyone have any other opinions?\" asked Lorist.</p><br/><p>Engelich stood up and said, \"Milord, the attack on Hamidas has been delayed, and the arrangements you made will take quite some time to complete. The Hanayabarta kingdom has ample time to be aware of the real reason for our invasion. Won't they take vengeance against our captive knights and soldiers?\"</p><br/><p>Oh, I see that the old fellow is worried for his grandson-in-law's safety. I suppose I can hardly blame him for it.</p><br/><p>Lorist smiled and answered, \"I've just received some good news this afternoon. Some guards that were surveying the results of the battle involving the scouts informed me that the ambassador that had been sent to meet me is dead. So I'll be leaving with Tarkel tonight and head to Hamidas to rescue our knights and soldiers at the Dueling Grounds.</p><br/><p>\"If the Hanayabarta kingdom deploys their troops, the longer you can drag the battle at the hilly area on, the safer my mission will be. Also, make sure not to be too hard on them and cause them to turtle up and retreat. We will be trapped within the capital and that would be horrible. Make sure to pretend to be unable to resist their onslaught and let them take a few areas that are not crucial to our overall strategy. Put them under the impression that they still stand a chance to win if they give it another push.\"</p><br/><p>Everyone within the tent erupted in laughter, with Josk saying, \"Milord, should I follow you to the royal capital as well?\"</p><br/><p>Lorist laughed and said, \"No, you can't. The three blademasters that chased you down will definitely be able to recognize you. Not one of you should follow me there. The sudden presence of a gold-ranked swordsman will bring suspicion to me. The enemy aren't idiots, you know, so only Tarkel and I will be going. That's final. It'll get really busy tomorrow, so make sure to fulfill your respective duties and not let me down.\"</p><br/><p>\"Understood, Milord.\"</p><br/>\n</div>"}