{"title": "Chapter 287 Taking Action", "id": 287, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-287-taking-action", "volume_title": "Volume 3", "body": "<h1>Chapter 287 Taking Action</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Taking Action</p><br/><p>Enjoy the fifth and last release of the week! Chapters will resume updating on next Wednesday because next Tuesday is test day for me. Cya then!</p><br/><p>Charade, Jim, and Tok were dragged out of their cells. Charade stood in the middle. He did not say a word and merely stared coldly at Blademaster Benack with eyes full of scorn. Jim wanted to stand in front of Charade but was stopped by him. Tok was already cursing. Being an ex-pirate, his choice of expletives was not of the mild variety; from the moment the cell was opened to when he was brought out, Tok had already 'laid' with more than 17 generations of the blademaster's female descendants, and he was already making his way to the 18th.</p><br/><p>The Norton knights and soldiers kept within the third basement all cussed and jeered, banging at the iron bars behind which they were locked.</p><br/><p>Els jumped around angrily and demanded that Blademaster Benack spare them, saying that he would consider taking him as his master should that be the case.</p><br/><p>\"Shut up!\" cried Charade to Els.</p><br/><p>His voice carried a hint of scolding, much to Stam's surprise.</p><br/><p>Charade pointed at the blademaster and yelled, \"Are you really going to take that darned big rat as your master? You're going to embarrass the whole of the house! Look at that pathetic excuse of a man! Do you think you'll be able to live this shame down even with the rest of your life? The moment you take him as your master, your life is over! I don't care if I die, but you must never take this kind of shame upon yourself! When the house's forces arrive, I trust that our lord will not let this stinking rat off and will exterminate all his kin alongside him!\"</p><br/><p>The reason Charade was so emotional was because apprenticeship was a huge deal on the continent. The relationship between a master and apprentice was far closer and significant than how it was in Lorist's past life. Choosing a master was a serious deal filled with lasting implications. The apprentice had to see his master as a second parent. They were obligated to obey their master for the rest of their lives, and serve in some capacity to further their goals.</p><br/><p>In the case of the blademaster forcing Els to be apprenticed to him, the moment Els signed the agreement he would have to look at the rat-like Benack as his master. Not only would he have to pay his dues for the guidance, but he also had to abide by his master's every whim. Blademaster Benack could have Els solve every one of his problems no matter how trivial.</p><br/><p>Should Els go back on his agreement, the blademaster can use the contract against him and spread word of his disobedience. No one would care why Els took the man on as his master. It would only matter that he was indeed the blademaster's apprentice, and he would receive appropriate criticism for his bad behavior. It would be a lifelong stain on his reputation.</p><br/><p>Even the Peterson Merchant Guild, with which he claimed affiliation, would have their reputation sullied. The other reason Blademaster Benack wanted to forcefully take Els as his apprentice was because he wanted to be affiliated with one of the largest guilds in the Union.</p><br/><p>At that moment, Els's face was already covered with tears. He cried wildly.</p><br/><p>\"You freaking big rat, I beg you to spare them! As long as you do so, I'll give you all the money you could ever want! Ten thousand? How about twenty?! If you kill them, I swear that I will use the cruelest methods to put you and your family to death, ending your line once and for all! Mark my words!\"</p><br/><p>\"Oh, is that so?\" Blademaster Benack mused with his face flush with anger, before his expression turned calm as he said, \"Since you're not willing to take me as your master, I will kill these three filthy slaves in front of you. If you do decide to sign this agreement, I'll agree to give them a swift and painless death.\"</p><br/><p>Everyone present could hear the venom infused in the blademaster's threats. Even his high-pitched voice turned deep and dark as he uttered them. He had already made up his mind to kill off Charade and the other two no matter what, given how they berated him and stopped Els from agreeing to sign the agreement despite being only silver ranks.</p><br/><p>Hmph, stupid filth who's not even a gold rank... Since you dare to behave like that in my presence, I will make sure that you die in the most excruciating way possible. I'll show you what horrors a blademaster like me is capable of.</p><br/><p>Blademaster Benack drew his sword. Under the illumination of the torches, the blade glowed subtly like the reflection of the moon in calm water, an indication that the sword was of good make.</p><br/><p>\"Very well... You filthy slaves... Did it feel good to berate me? If you kneel and prostrate yourself to that punk and ask him to take me as master, you'll be graced with a painless death,\" said the blademaster with his sword pointed at the three.</p><br/><p>\"Ptooey!\"</p><br/><p>All three of them spat on the ground in at the same time, rousing yet another round of mocking laughs in the opposite cell.</p><br/><p>\"Big rat, aren't you a blademaster? If you dare, remove their chains and give them a weapon to fight you fairly! You're a freaking blademaster and they're only three unarmed silver ranks locked up in chains. If you kill them as is, it'll be nothing but shameless slaughter. Give them weapons and remove their chains to give them a warrior's death!\" said a rough voice.</p><br/><p>The gold-ranked slaves began to chant, \"Give them weapons, remove their chains!\" incessantly.</p><br/><p>The blademaster deafened himself to the chants and walked over, raising his sword and slashing down savagely.</p><br/><p>The flash of the blade was akin to lightning. The strike seemed slow but was horridly fast. It carried with it a seething vibe of poison. The trajectory it traced would split Charade's face in half, severing his lower jaw from the rest of his head and revealing his tongue if it hit. With another loop, the blademaster could easily cut off the tongue itself.</p><br/><p>Charade shut his eyes and rushed straight towards the incoming strike. Jim and Tok, on the other hand, leaped forward as well, dragging their chains with them.</p><br/><p>The rough voice resounded again angrily, \"Big rat, you better not give me a chance in the future. Otherwise, I'll definitely skin you alive and remove every gram flesh from your body...\"</p><br/><p>Clang! A bronze pike suddenly appeared, blocking the longsword strike. Even though the pike was cut clean in half as a result, the longsword was deflected to the side. Blademaster Benack didn't expect a guard from the royal defense army would actually manage to parry his longsword. During his moment of stupor, he saw a semi-circular bronze shield smashing towards his face.</p><br/><p>\"What the heck are you doing?!\" roared the blademaster in rage. With a sweep of his legs, he managed to avoid the shield bash. But he did not predict that Lorist would be right in front of him. Perhaps, he had moved to face Lorist inadvertently while avoiding the strike.</p><br/><p>Lorist lowered his head and headbutted the blademaster right away with his bronze helmet. The latter stumbled and fell to the ground. A massive lump quickly formed on his forehead. There were even a few cuts all over his face. Even a blademaster would not be able to resist having his unprotected face smashed in with a bronze helmet.</p><br/><p>Stretching out his hand, Lorist grabbed onto the blademaster's outstretched wrist and gave it a harsh twist. The sword the hand was holding fell and Lorist caught it. With a few casual slashes, he severed Blademaster Benack's arm and leg, causing him to fall unconscious from all the screaming in pain.</p><br/><p>The others in the basement looked on in absolute silence. They never thought that such a complete reversal would occur in those few moments. It was as if time itself stopped flowing.</p><br/><p>Els continued to stare with tears all over his face and his mouth agape. Charade maintained his forward-rushing posture with a shocked expression. Jim and Tok were already prepared to take the strike for Charade, but the scene stopped them in their tracks completely.</p><br/><p>The gold-ranked slaves in the other cells stared wide-mouthed, seemingly unwilling to believe that a mere foot soldier was able to so easily take out Blademaster Benack without any traces of using battleforce.</p><br/><p>Stam was the first one to snap out of his stupor. Shivering all over, he turned tail to run. Lorist gave the broken pike a light kick and caused it to pierce through Stam's undefended back. THe poor man fell face first into the ground and didn't move again.</p><br/><p>\"Good thing I arrived just in time to save you lot,\" said Lorist with a smile as he removed his helmet. Given the force he used during the headbutt, Lorist's forehead was slightly bruised as well.</p><br/><p>\"Mi-milord...\" Charade, Jim, and Tok all knelt in relief, having survived in the face of certain death.</p><br/><p>The imprisoned soldiers and knights of House Norton began to chant 'Milord' in the same fashion.</p><br/><p>Lorist moved his index finger to his mouth and hushed them.</p><br/><p>\"Shut up! I still need to bust you guys out of here! Stop making so much noise!\"</p><br/><p>He moved to help the three to their feet and hugged all of them tightly.</p><br/><p>\"It must've been tough on you guys. I'm proud that our house has such unrelenting and strong-willed knights.\"</p><br/><p>Tok mumbled, \"Milord, I'm still not a household knight yet...\"</p><br/><p>\"Shut up!\" Lorist exclaimed, \"If I say you are, then you are! See that corpse over there? Drag him over here and take the keys to the cells.\"</p><br/><p>Charade laughed and said, \"Tok, Milord means to say that he's accepted you as one of his household knights. He'll give you the badge and admittance gift after we escape.\"</p><br/><p>\"Oh,\" said Tok before he turned to loot Stam's corpse.</p><br/><p>\"Come back here,\" Lorist called out. With a flash of his sword, he cut off the chains binding them.</p><br/><p>Els was the first one to be let out. He kneeled right away in front of Lorist while giving himself two harsh slaps on the face.</p><br/><p>\"Milord, it's all my fault... I almost caused Charade and the others to lose their lives...\"</p><br/><p>Lorist helped him up.</p><br/><p>\"What's your problem? There's no need to slap yourself like that. This is not your fault. It's all because of that greedy rat. He's the one that tried to prey on you.\"</p><br/><p>Lorist pointed at the fallen blademaster who had just regained awareness and was screaming in pain again. He clutched the stump of his arm with his other hand. Els leapt over to him and gave him a harsh walloping before finally stomping down on the blademaster's chest. The man fainted once more.</p><br/><p>\"How many of those here are men of our house?\" asked Lorist.</p><br/><p>\"Milord, there are 257 remaining. That stupid rat killed five just this evening alone,\" said Charade hatefully.</p><br/><p>\"Milord, avenge us! We had 1300-odd people when we were first imprisoned!\" called out one soldier kneeling with tears all over his face.</p><br/><p>Lorist covered his face and tried not to let his own tears flow.</p><br/><p>\"Let's be patient. Our forces have already conquered Nupite and will soon advance to the capital. As long as they are subjects of the Hanayabarta kingdom, they will not escape my wrath. I want a few of you to come here and wake this blademaster up with your piss. After that, I'll skin him slowly so that he doesn't enjoy the luxury of a swift death,\" said Lorist.</p><br/><p>Blademaster Benack cried out in agony as Els brought a few soldiers and broke his bones with the chains that previously bound them. Every time the blademaster fainted from the pain, they would piss on his face to wake him up. His cries in the basement prison sent chills down the onlookers' spines.</p><br/><p>Half an hour later, Blademaster Benack finally breathed his final breath. His corpse had already become an unrecognizable mess of pound meat. By then, the Norton soldiers had all been released and they were resting.</p><br/><p>\"Milord, how are we going to make it out?\" asked Charade.</p><br/><p>\"I haven't given it much thought. Well, we could always slaughter our way out,\" replied Lorist.</p><br/><p>\"No darn way!\" Charade cried out while giving himself a smack in the forehead, \"You were so reckless that you didn't even have a plan in mind before you acted?\"</p><br/><p>Lorist said casually, \"Doesn't this count as an emergency? You were about to lose your lives, you know. I can't stay my hand at that.\"</p><br/><p>\"But right now, we're mostly unarmed and not in prime condition. How will we bust our way out by force?\" complained Charade.</p><br/><p>\"Why don't we just make the iron bars into makeshift pikes by sharpening the point? That way, we'll at least be armed,\" said Lorist as he looked at the iron bars.</p><br/><p>\"It's pointless, milord. The material is the same as those of our chains. They don't conduct battleforce and we won't be able to use them as weapons,\" replied Charade with a bitter smile.</p><br/><p>\"Hey, kid, come here and let us out. We'll be able to help you,\" said the man with the hoarse voice.</p><br/><p>\"Oh, milord, let me introduce you to him. That over there is Brother Shuss, a blademaster. He showed us the ropes when we first arrived. I need to thank him for it,\" said Charade as he headed for the man's cell.</p><br/><p>The slave was an old man of abnormally large stature with a determined gaze. Wounds from battles long past decorated his body all over. The chains that bound him were at least three times thicker than those that bound Charade. However, Charade could not find the key to his cell, which was not something to be surprised about, since the keys Stam took were silver. Lorist remembered seeing another set of bronze keys at the twin gates which were probably those used to open the other set of cells.</p><br/><p>Lorist infused Blademaster Benack's sword with his internal energy and cut off the thick bars of the cells. When Shuss emerged from it, Lorist's longsword flashed past before the chains binding him fell to the ground with loud clatters.</p><br/><p>\"Magnificent swordsmanship!\" praised Shuss with a thumbs up.</p><br/><p>Lorist looked at the other four gold-ranked slaves' yearning expressions and said apologetically, \"Just wait here for a moment. I will go get the keys from the guards to let you out. Cutting the bars will expend too much of my energy.\"</p><br/><p>\"Milord, won't you alert the guards that way?\" asked Els.</p><br/><p>\"Don't worry, those guards know that the big rat frequently tortures you lot to death. That's why they are not willing to approach this hall in the slightest. We can use the excuse of getting cleaning supplies to approach and kill them. After that, you guys will put on their equipment and pretend to be guards, understood?\" asked Lorist.</p><br/><p>\"Alright, Milord,\" replied Els.</p><br/>\n</div>"}