{"title": "Chapter 284 Drunken", "id": 284, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-284-drunken", "volume_title": "Volume 3", "body": "<h1>Chapter 284 Drunken</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Drunken</p><br/><p>Enjoy the second release of the week! Check out our Patreon page if you haven't already and support us if you are able to!</p><br/><p>Kalik only went downstairs after Lorist and Tarkel finished their meal. Tarkel ordered more food for Kalik and told him that he would go out for a stroll with Lorist a little bit later. Kalik could put anything on his tab if he needed something.</p><br/><p>It was already evening by the time Lorist and Tarkel departed for the dueling grounds. The Blood and Flame was quite close to the tournament area. After passing through a small alleyway, they arrived at the royal district's main road where the royal defense army's camp was located. Even though the army was mobilized, the campsite was still bustling. Flags of various colors and patterns were flown at the entrance of the camp, with many people equipped with armor, swords, and spears, going entering and leaving incessantly.</p><br/><p>Before they passed through the main road, a few people from the camp came over and surrounded the two.</p><br/><p>\"Hey, you two must have come to answer the king's call to arms, right? I'm the Senbak Mercenary Band's vice-leader, Jason, and I welcome you two brave warriors to our band with open arms,\" said a thin man in old and torn leather armor.</p><br/><p>\"Go back to your crummy old mercenary band. Your men number less than 50, and most of them are injured fighters anyway. These two might as well jump off a cliff. Brothers, we are the Tigershark Slavers, subordinates of Duke Gouffman himself. We have more than 300 members. Joining our team is definitely the wiser choice,\" interjected a tall and proud-looking man.</p><br/><p>Another huge red-faced man called out, \"Join us, the Kalir Slavers, and you'll be provided with weapons and equipment! Friends, they're all free, so don't miss out on this chance!\"</p><br/><p>\"We're the mercenary band of Duke Hock. Even though we've just formed, we treat our recruits well! You'll be treated to a bottle of sweet wine every day!\" said a middle-aged man in mail.</p><br/><p>Oh, so all of these people are here to recruit and expand their forces.</p><br/><p>\"My deepest apologies to you great warriors,\" Tarkel responded with a smile on his face, \"The two of us work for the Peterson Merchant Guild and we've come to the kingdom to deal with setting up a trade route and other affairs while learning more about this place. We only came over because we spotted the busy campsite over there. I'm very sorry to have disappointed you gentlemen...\"</p><br/><p>The moment they heard that many turned around and returned crestfallen. However, a few people remained.</p><br/><p>\"I recognize you,\" said a man, looking at Tarkel.</p><br/><p>\"Who may you be?\" asked Tarkel, scratching his head.</p><br/><p>\"You're one of Ballop's friends. I've seen you drinking together with him,\" said the man.</p><br/><p>\"Oh,\" Tarkel muttered with relief, \"Pleased to make your acquaintance. I'm Tarkel. Do you know what happened to Ballop and the rest? We lost sight of each other when we rushed out of Nupite. I haven't seen any of them since.\"</p><br/><p>\"Ballop's dead. I saw him collapse with a few arrows in his back when we were rushing the enemy lines,\" replied the man.</p><br/><p>\"What about Feline, Krinando, and Chelwar? Do you know them and their whereabouts?\" asked Tarkel concernedly.</p><br/><p>Shaking his head, he said, \"I don't know them, but I think I've heard Chelwar mentioned somewhere before. He should be in the camp over there. Do you want me to take you to have look?\"</p><br/><p>\"How may I address you?\"</p><br/><p>\"The name's Drei. I used to be one of the supervisors in charge of shipments at the port. Just recently though, I was forced to enlist as a soldier of the Snowshame Army,\" replied he.</p><br/><p>\"The Snowshame Army? What's up with that?\" asked Tarkel curiously.</p><br/><p>\"It's nothing surprising. Ever since we escaped the city's encirclement, the king blamed us for losing it to the enemy. Even Duke Gouffman and Duke Hock were put under house arrest so they could repent for their mistakes. As for us, we were forcefully drafted to form the Snowshame Army. Once we have 24 thousand men, we'll be sent to aid the royal defense army's recapture of Nupite. All of those people were trying to recruit scapegoats for their own men.\"</p><br/><p>\"Scapegoats?\"</p><br/><p>\"That's right,\" Drei replied, \"Many mercenary and slaver bands incurred huge losses during the escape from the port, so they are trying to recruit more people to bolster their ranks. When we reach the frontlines, they will send out their new recruits to take the brunt of the enemy's hits to prevent actual harm from coming to their long-time members. Consequently, the new recruits' sacrifice will also show their bands in a good light and they might be rewarded.\"</p><br/><p>\"Do you think that will fly?\"</p><br/><p>\"Of course it will. Since the king has already declared a call to arms, those who wish to join the army's forces will come over here and be split up among the slavers and mercenaries. Once our ranks fill up in another couple of days, we'll move towards Nupite. We'll have to rely on Singwa's protection to be able to survive,\" said Drei with a pained smile on his face.</p><br/><p>\"I believe you'll easily live to your hundreds. Perhaps, you might even be able to score a huge achievement in the coming battles and be made a noble,\" Tarkel consoled before he pointed at Lorist and continued, \"This friend of mine hasn't been in this area before. I was just going to show him to the dueling grounds to expand his horizons. We'll come visit you once we're done and take you for a few drinks at the Blood and Flame.\"</p><br/><p>Drei nodded and said, \"Very well. I'll help you locate Chelwar and the rest in the meantime. When you reach the camp, just mention Drei of Thunder's Fire. They'll know what to do.\"</p><br/><p>Lorist and Tarkel arrived at the dueling grounds shortly after bidding Drei goodbye. The dueling grounds was the second-most impressive building within the capital, after the royal palace. From the outside, it seemed like two oranges squished against each other on the ground, a little similar to the sport stadiums in Lorist's previous life.</p><br/><p>\"There is a mulberry tree in the left alley near the entrance,\" Tarkel remarked, \"Look, it's over there.\"</p><br/><p>The alley was incredibly quiet and the air there carried with it a displeasing stench. Perhaps, it was used by the show-goers as a makeshift toilet of sorts, the walls were stained to a yellowish-green and a vomit-inducing stench seeped into the air from them.</p><br/><p>However, the wall itself was marked with more than 30 strange markings that looked to be children's doodles.</p><br/><p>Pinching his nose, Tarkel said, \"Milord, every time Els goes inside, he would leave two horizontal markings on the walls, and when he comes back out, he'll add a vertical strike through the horizontal lines. Others think that he's only here to take a piss and wouldn't imagine the markings to be anything but the works of children.\"</p><br/><p>\"31, 32, 33., 34...\"</p><br/><p>Tarkel stopped. The last marking didn't have a vertical line through it, meaning that Els did not leave the last time he made his visit.</p><br/><p>\"Come on, let's go ask around,\" said Lorist.</p><br/><p>The soldiers they met were not aware of what Tarkel was talking about. It was only after Tarkel snuck a large silver down all of their pockets that they called their company leader over. However. the company leader denied that Els had come over and insisted that he'd left after sparring two days earlier. He thought it was weird for Els to not visit for two days.</p><br/><p>Lorist tugged on Tarkel's clothes and the two took their leave.</p><br/><p>On the way back, Lorist told Tarkel confidently, \"Something must've happened to Els. The company leader was averting his gaze without daring to meet yours. We should come again secretly during the night to find out more about this.\"</p><br/><p>Tarkel said, \"But that would be rather risky. Why don't we wait until we visit Viscount Timba tomorrow and have him ask around with us?\"</p><br/><p>Lorist merely shook his head. Just as Tarkel was about to make another objection, someone called out to him loudly out of nowhere. It was Drei. He brought with him a few other men, Chelwar was among them, a friend Tarkel made at Nupite.</p><br/><p>Chelwar came over with a brilliant smile and gave Tarkel a big hug, congratulating him on his successful escape to Hamidas. He wanted Tarkel to treat him to a meal because he had nothing to eat apart from the black bread and vegetable soup they served at the camp due to losing his official documents during his escape. Now that he had met with the rich Tarkel, he would not hold back, throughout their conversation, he introduced his friends.</p><br/><p>Oh great, here comes another freeloader like Kalik, thought Tarkel, though he did ask the rest of them to go to the Blood and Flame for a good meal nevertheless. On the way, Tarkel gave a brief account of their travels to Hamidas and breathed a long sigh.</p><br/><p>\"What's wrong, Tarkel, my brother? Why are you sighing? Are you blaming us for feasting at your expense?\" asked Chelwar with dissatisfaction.</p><br/><p>\"It's not that. The two of us just went to the dueling grounds just now and realized that one of our friends staying there has gone missing. I'm just worried about his safety... I wonder how I will inform my uncle,\" said Tarkel in a wistful tone.</p><br/><p>\"What's wrong?\" asked Drei.</p><br/><p>\"Chelwar, you should know that there was another person called Els that traveled to Nupite with me. He's is my uncle's sun. Being a martial maniac, he only occupies his time with swordsmanship training. Didn't you bring us to the dueling grounds to watch a show once? Els said that he wanted to spar with the gladiators afterwards and chose to stay here at the capital. But when I got back to the inn earlier today, the owner said that Els hasn't been back for the past two days. When I went to the dueling grounds to ask about it, they said that they haven't see Els either.</p><br/><p>\"Everyone knows that the two of us came here representing the Peterson Merchant Guild. This trip of ours also involves starting a new trade route and choosing a place to build our office. Naturally, we had a secret method of contacting each other, and I just realized that Els didn't make a mark when he left the dueling grounds last time. The soldiers we asked over there, including a company leader, also told us they haven't see Els.\"</p><br/><p>\"You're saying that Els is missing?\" Chelwar exclaimed with surprise, \"Forget about the meal, let's head back. I'll gather a few people to search the dueling grounds with you.\"</p><br/><p>\"There'll be no need,\" Tarkel hurriedly said as he stopped Chelwar, \"I am more than happy with just the sentiment. However, you can't do something like this. We can't afford to offend the king by causing trouble at a time like this...\"</p><br/><p>\"He doesn't scare me. We're already going to battle in a couple more days, so it makes no difference whether I die now or on the battlefield. There are only fewer than 200 people at the dueling grounds, so now's the perfect time to cause a commotion. Perhaps, we won't be sent to the battlefield after some chaos breaks out,\" said Chelwar.</p><br/><p>\"Huh? Didn't you tell me that there were more than a thousand royal defense soldiers stationed there? Why are there only 200 all of a sudden? What're they going to do if the slaves revolt?\"</p><br/><p>\"Hehe, the royal defense army already sent out 25 thousand men. They've left behind less than three thousand. Those who remain also have to deal with the safekeeping of the warehouse sector, so there won't be that many left at the dueling grounds! All of the gladiators are locked behind bars anyway, and there are no weapons or equipment there. So, there'd be no point for them to revolt.</p><br/><p>\"Additionally, we of the Snowshame Army are gathered nearby the tournament area. If something does happen at the dueling grounds, we'll be there to stop things from getting out of hand. While I can't speak for our abilities against other fighters, we'll have no problem suppressing some slaves. Don't worry, the capital won't fall into chaos.</p><br/><p>\"Also, I heard that the king is preparing to host a huge show at the dueling grounds on the day we mobilize. More than 1600 slaves will be split into two factions for a fight to the death as a sacrifice for the war god so that we can gain his blessing for a victorious battle,\" Drei informed resourcefully.</p><br/><p>\"Oh, then the show on that day will definitely be an amazing one. I love watching those gladiator shows. Chelwar, make sure you don't do anything rash at the moment. I will visit Viscount Timba tomorrow. I trust that he'll accompany us. Let's stick to the plan for a nice drink tonight!\" Tarkel Chelwar told.</p><br/><p>\"Alright then, it's a deal! We won't go home until we're dead drunk!\" exclaimed Chelwar cheerfully.</p><br/><p>They arrived at the Blood and Flame soon and Drei, Chelwar and the rest ordered one delicacy after another. Tarkel asked the owner whether Kalik was upstairs, but the owner said that Kalik left after drinking three bottles of fruit wine and had yet to return.</p><br/><p>Chelwar patted on Tarkel's shoulder and said, \"Stop worrying about Kalik. I think he mentioned that he has a cousin brother living here in the capital. Perhaps, he went there for a visit. Friend, book me a room, will you? I haven't laid with anyone for a long time.\"</p><br/><p>Tarkel turned around only to see that Chelwar had already begun flirting with one of the maidservants of the inn. Smiling, he told the owner, \"Boss, I'll be booking all the rooms upstairs for the night. Friends, if you'd like to let loose, just bring whoever you like up to those rooms before coming back for a feast. The bill's on me.\" When he finished, he placed a gold Forde note on the counter, garnering cheers and praise from all those present.</p><br/><p>Drei didn't bring any maidservant into a room and only stayed to drink. Upon finishing his fourth bottle, he looked at the silent Lorist with interest and challenged him to a drinking game.</p><br/><p>However, Lorist refused the challenge on the pretense of being Tarkel's guard. Despite that, Drei was insistent on challenging Lorist to a drinking match. In the end, Tarkel had to 'order' Lorist to accept a match so that his friend didn't lose face.</p><br/><p>Lorist said with a distressed look, \"Young master, I'm not good at holding my drink...\"</p><br/><p>But under everyone's pressure, Lorist downed three bottles of fruit wine before spitting his last mouthful out and collapsing on the table unmoving, much to the rest's amusement.</p><br/><p>Tarkel complained, \"Sheesh, you guys... You didn't have to force a non-drinker like him to get drunk... Someone, help me carry Locke up to the room for some good rest. I'm afraid he'll rat me out when we get back to the guild...\"</p><br/><p>Downstairs, ass Tarkel and his friends were just beginning to make merry, loud humping sounds along with the moans of the maidservants could be heard from the room next door. The 'drunken' Lorist, on the other hand, opened his eyes wide and quietly sat up straight...</p><br/>\n</div>"}