{"title": "Chapter 295 Dread Monument", "id": 295, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-295-dread-monument", "volume_title": "Volume 3", "body": "<h1>Chapter 295 Dread Monument</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Dread Monument</p><br/><p>The most prominent building in Hamidas which also served as the center of power for the Hanayabarta kingdom, was where Lud III would summon his nobles for meetings or wave to the adoring masses.</p><br/><p>There were 36 huge pillars supporting the great hall, with all of them made from greengold stone. On the pillars were engravings of intricate patterns and murals that depicted the various legends and folktales of the era. That building was Herbitra, also known as the Palace of 36 Pillars.</p><br/><p>At that moment, droves of people made merry within the great hall. Lorist had hosted a large celebratory feast over there to commemorate the victory of the House of Norton as well as the extermination of the Hanayabarta kingdom, fulfilling his promise of 'those who slight the Nortons shall be put down, far as they may be'.</p><br/><p>\"Let me dedicate this first toast to the heroic soldiers and fighters that have sacrificed themselves to wash away the humiliation of the house while liberating the slaves!\" announced Lorist before he poured the cup of wine onto the ground.</p><br/><p>The hundreds of fully-armored knights and ten other elaborately-dressed officials within the hall did the same.</p><br/><p>\"This second cup shall be dedicated to the slaves who have suffered for the past century under the tyrannical reign of the Hanayabarta kingdom. They have been subjugated, emasculated and enslaved. Despite that, they were the ones who built this kingdom from the ground up. Do you see the 36 majestic pillars in this hall? Who would think for a second that those were built at the cost of countless numbers of corpses?! They have lost their freedom here and became nothing more than animals. In the eyes of the demonic slavers, they are no different from livestock!</p><br/><p>\"But that has changed since our arrival! The House of Norton has already exterminated this sinful nation! The slaves are finally freed and restored dignity as all humans deserve. However, we did come a little too late, as there are many others whom we were unable to save. Let us mourn and grieve for their suffering. This toast is made in their honor.\"</p><br/><p>Lorist poured the wine once again on the ground. While Lorist's true reason in attacking the kingdom was to gain the resources gathered over the century by the kingdom, he had to pretend that saving the slaves from suffering was his main goal in the interest of political correctness.</p><br/><p>As for the liberate slaves who would not join the forces of the Nortons or help out with the harvest or other tasks and preferred to laze around in the camp despite only being served two meals of porridge daily, Lorist did not really care about them. Since he has already given them freedom, Lorist felt that they were free to decide their destinations and vocations. As long as they did not obstruct the house's operations, they were free to do whatever they wanted.</p><br/><p>However, all the resources around the archipelago down to the smallest grain was the de facto property of the Norton house, not to mention the ships that would be required to send those slaves off to their hometowns. Without Lorist's permission, not one of them would be able to leave the archipelago.</p><br/><p>There were some free slaves that remained within the camp that had gotten sick of eating nothing but porridge and wanted to get some farming tools to harvest some wheat for their own consumption. However, they were stopped by patrolling guards right away, because almost all the property of the slavers were already in the hands of the Norton house.</p><br/><p>Those slaves were dissatisfied from being denied their will and argued that they deserved a share of the wheat because they had a part in cultivating it. It did not take long before they were brought to the main camp of the Norton forces and showed the corpses of near a thousand Norton soldiers who had died fighting the slavers. Following that, those slaves were given 20 canes each to ensure that they understood the reason the wheat belonged solely to the Norton house. The fortunate thing was that they no longer had to worry about starving, as they were punished to help out with the harvests for their transgressions.</p><br/><p>All was according to Charade's plan to spread the propaganda that the Hanayabarta kingdom had fallen only because of the huge sacrifice of House Norton to liberate the slaves. 'That's why everything on the archipelago belong to us, as, without us, you would still be slaves whose lives are at the whims of your masters. Even though you're now free men, your freedom came at the expense of the Norton house. So, we're under no obligation to sustain you any longer.'</p><br/><p>All the Norton soldiers were rather convinced with Charade's arguments. Additionally, House Norton did not leave the slaves to their own devices for survival. They did offer opportunities for the slaves to work for proper meals, clothing, shelter and even payment. Not only that, the slaves were not required to do anything remotely threatening to their lives. That was why the Norton soldiers despised the slaves that did not help out even when being given the chance and thought that they were thankless and shameless fools.</p><br/><p>\"This third cup of wine is dedicated to the slave fighters who fell before the coming of dawn,\" Lorist said before he gave Blademaster Shuss and the other slave fighters a glance, \"Without their painstaking resistance, our house would never have been able to occupy the capital with so few casualties. It was their life and blood that limited the enemy's ability to launch a last-ditch resistance against us, defending the dueling grounds until our forces arrived. This toast will be in the honor of the brave warriors and their sacrifice.\"</p><br/><p>After the three toasts, the atmosphere within the hall reverted to its former merriness. Everyone began to celebrate again. A group of young and beautiful female slaves with varied talents put on a magnificent show of dance, sleight of hand and performances for the conquerors of the Hanayabarta archipelago.</p><br/><p>As it was a celebratory occasion, the soldiers of the Nortons received a great number of bonuses. Those who participated in battle were awarded ten gold Fordes, with the injured receiving double that amount. Additionally, they were also treated to a sumptuous feast. As for the volunteers that helped out, they received a large serving of ale and a huge piece of smoked meat. Even the slaves who did not contribute got two pieces of black bread sandwiching a piece of meat.</p><br/><p>On the next day, Lorist gathered the knights and important officials of the house for a meeting about the fate of the Hanayabarta archipelago.</p><br/><p>Nobody held any objection about making the Hanayabarta archipelago the dominion of the Norton house nor Lorist's plans for the 400 thousand or so slaves there. However, some had differing opinions about what to do with Hamidas.</p><br/><p>Hector and some other administrative officials believed that the capital should be kept intact, especially a palace as magnificent as Herbitra. While it did have a tainted history of being built on the backs of slaves, it was still a magnificent building that should be cared for over the generations.</p><br/><p>Blademaster Shuss and two gold-ranked slave fighters, Jades and Messen, who were attending a meeting like this for the first time, stressed that the capital had to be demolished, especially the dueling grounds, which reminded them of their most painful experiences in their lives. Countless comrades of theirs had fallen to their deaths there and only the demolition of the symbol of their pain would appease them.</p><br/><p>Potterfang on the other hand believed that the demolition of the capital would allow them to gain favor more quickly with the slaves. During his time being in charge of the security of the slave camps, he found that all the slaves have deep hatred for the Royal Capital of Hamidas, with some calling it a devil's den and other's thinking it no different than hell. The slaves would definitely be more obedient following the demolition of the capital.</p><br/><p>Malek thought that the demolition of the capital would save them quite some trouble when they excavate for the hidden riches of the slaver nobles, as they would no longer have to ensure the integrity of their buildings during their operations.</p><br/><p>Charade approached the matter from a different perspective and thought that the demolition of the capital would be far more beneficial for the administration of the Norton house at the Hanayabarta archipelago. For one, Hanayabarta was quite far away from the main dominion and maintaining a castle as large as the capital would definitely put quite a heavy burden on the finances of the house. Since the house would not be moving their headquarters to Hanayabarta, there was no need for the capital to be kept.</p><br/><p>Herbitra alone would cost at least 300 gold Fordes yearly to maintain. While the annual amount was by no means astronomical, the upkeep over decades or a century would be staggeringly high. That way of spending was no different from dropping gold coins into the sea; one would not even hear the coins reach the ground.</p><br/><p>Not only that, given how far Hanayabarta was from the main dominion of the Nortons, an enemy attack on the island was only a matter of time. As a measure of precaution, the demolition of the capital would serve to make it easier for the house to rule over the various islands and their forces would not incur as much casualties to quell any revolts or chaos.</p><br/><p>Also, while there would be over 100 thousand slaves staying behind at the archipelago that would require farmland and houses, only a brigade of soldiers would be left to defend the area at most. That was why the area to be defended must be decreased. In the future, the area around the capital would only serve two purposes: as a trade center and a storage hub for food and other resources.</p><br/><p>The reasons Charade brought up cemented the decision to demolish the capital. Lorist decided that apart from the business sector, that would be retained and expanded, the other sectors of the capital would be demolished. However, that would only occur after Malek and the rest finish scouring the noble sector and royal sector for their treasures.</p><br/><p>Lorist also managed to convince them to retain the 36 pillars and the half of the dueling grounds' audience seats to serve as a reminder to future generations about the two buildings that were the cornerstone of the slaves' suffering.</p><br/><p>Upon deciding Hamidas's fate, Lorist declared Hector the first governor of the Hanayabarta archipelago with his first term lasting five years. His duties during that time was to ensure that the 100 thousand slaves were given farmland and houses so that they could settle down into their new lives and become the subjects of the Norton house.</p><br/><p>Gold-ranked knights Josk and Yuriy would check on the manors at the plains around the capital once more to capture any subject of the Hanayabarta kingdom that might have escaped to make sure that not a single one of them was spared. They were also tasked to transport all the goods found at the manors to the capital.</p><br/><p>Gold-ranked knight Malek was put in charge of the scavenging of the valuables within the capital as well as the transportation of the goods found at the western city sector. Apart from some food and other supplies, the rest were to be brought to Port Nupite to be shipped to Silowas.</p><br/><p>Gold-ranked knight Fiercetiger Loze would command the half of the Norton troops that stay behind and assist Malek with the transportation of those resources, as well as guide the rest of the slaves to Port Nupite. Only those who wanted to stay would be allowed to remain at the plains near the capital. The rest must leave with no exceptions. However, the Norton house did promise those who wish to return to their homes that they would be guaranteed safety and transport to the main continent of Grindia for no fee at all.</p><br/><p>Lastly, Lorist made gold-ranked slave fighters Jades and Messen aides to Potterfang. Those three were given only three tasks: the formation of the ten new brigades to maintain security through the recruitment of the 16 silver-ranked and 400 other bronze or iron-ranked slave fighters, the transport of the 100 thousand plus captured subjects of the Hanayabarta kingdom to Port Nupite to where the other captives were held, as well as the cleansing of the battlefield. The last task involved the decapitation and embalming of the heads of the enemy corpses that would be sent to Port Nupite. The headless corpses were then disposed through burning.</p><br/><p>Some felt that Lorist's order to keep the heads of the enemies a little weird. Charade on the other hand asked Lorist how they would deal with the 100 thousand or so captives of the Hanayabarta kingdom.</p><br/><p>Lorist stayed silent with a gloomy look for a good while before he softly announced his decision. \"Behead them all.\"</p><br/><p>Everyone present were shocked beyond their wits. Hector and Charade jumped with terror as they said, \"Milord, you can't do that! Those are 100 thousand human lives!\"</p><br/><p>\"They are not human, merely animals wearing human skin,\" Lorist said as he thumped heavily on this desk, \"They have never seen the slaves as fellow humans and are the demons of this sinful kingdom. Even if they are commoners instead of nobles or slavers, they have lived in prosperity thanks to the blood, tears and deaths of the slaves. Not only that, I've made an oath to bury 100 Hanayabartans alongside each of our dead soldiers. But now, these 100 thousand captives are still not enough to make it up to our comrades who died at the dueling grounds! My decision is final, and I will shoulder all the consequences of it!\" exclaimed Lorist, before he left to conclude the discussion.</p><br/><p>On the 24th day of the 10th month of Year 1773, Count Norton Lorist ordered for the beheading of up to 100 thousand Hanayabartans at the shores of Port Nupite, and used 176243 heads to build a 33-meter-tall human-head pyramid, which was known as the Dread Monument.</p><br/><p>Right before the beheading, the governor of Hanayabarta, Hector, had kneeled to Lorist and begged for seven whole hours before he finally received permission from Lorist to spare the lives of 12 thousand young women that would be made the wives of the liberated slaves of the archipelago. The genocide of Hanayabarta was deeply imprinted in the hearts of many.</p><br/><p>During the 3rd and 4th months of Year 1774, when many of the slaves that left the archipelago to return to their homes at Grindia, word of Lorist's use of more than 170 thousand heads to build a pyramid spread across the nations on the continent. Almost overnight, the name of the Roaring Raging Bear became the go-to tale that mothers told their misbehaving children.</p><br/><p>In the 5th month of Year 1774, word of the extermination of the Hanayabarta kingdom spread to another island-based nation -- the Shyarsia kingdom. The queen of the nation that was famed for their spice production, who was the cousin little sister of Lud III, cried until she fainted when she heard the news. Her son, the young prince, instantly ordered his royal uncle to mobilize their troops against the occupying forces at Hanayabarta for causing his mother that much grief.</p><br/><p>The army sent out by the Shyarsia numbered 18 thousand men. They left with a fleet of 40-odd ships and by the time they arrived at Port Nupite, it was already the latter half of the 6th month. Being noon when they arrived, the distant human-head pyramid was more apparent than ever for the newcomers. At that time, Port Nupite was defended only by a brigade of 3000 soldiers with the defense infrastructure still incomplete. As the knights of the garrison soldiers readied themselves for a battle to the death, something incomprehensible happened.</p><br/><p>The fleet of the Shyarsia kingdom circled around at the front of the human-head pyramid and left for the seas, never to return, as if they had come just to witness the pyramid itself. Not one of their men got off shore for a fight.</p><br/><p>In the 8th month, Senbaud's Oceanic Legion arrived at the Hanayabarta archipelago with six sail-powered, cannon-equipped warships to patrol the area. The moment Senbaud heard about the arrival of the Shyarsia fleet, he set out for the Shyarsia kingdom right away. But before they even exchanged the first volley of fire, the Shyarsia kingdom raised their white flag in surrender. It was later known that everyone of the Shyarsia kingdom was terrified by the human-head pyramid. Given that none of them wished for a similar one to be erected at their kingdom, they surrendered immediately for safe measure.</p><br/><p>Thus, the Kingdom of Shyarsia became the first nation to subordinate themselves to the House of Norton, marking the beginnings of a new era.</p><br/><p>Seriously, that was no joke. It really happened.</p><br/>\n</div>"}