{"title": "Chapter 300 Refusal", "id": 300, "volume": 3, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-300-refusal", "volume_title": "Volume 3", "body": "<h1>Chapter 300 Refusal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Refusal</p><br/><p>Finally, we're at the 300-chapter mark. It truly has been a rather hectic (and rewarding) journey for us. Here's to the next smooth-sailing release of the next 100 chapters! Hope you all enjoy the read!</p><br/><p>P.S. it's the fourth release of the week.</p><br/><p>Please note that this chapter is still unedited.</p><br/><p>Looking at the sails in the distance, Lorist furrowed his brows in worry. First Young Master Serihanem of the Chikdors was aboard that very ship. As the 6000-odd sailors of the northern fleet would not fit in one ship alone, Serihanem had casually hired the Norton house's men to transport their ransomed crew back to Morante.</p><br/><p>Lorist was not concerned for the safety of those transport ships as there would be no chance the Chikdor Merchant Guild would be willing to get into conflict with the Norton house just for the sake of those ten-odd measly ships. However, before Serihanem left, he had revealed where the troops of the Union that occupied Bodolger Province had come from. Even Lorist could have never imagined something like that being pulled.</p><br/><p>A few days back following his conversation with Serihanem, Lorist came to understand some more details about the internal affairs of the Union. Ever since the Union obtained victory in the War of Glass, the nations neighboring them had sealed their borders and erased the trade routes as a kneejerk response to the sudden expansionist policy of the Union. But given that the Union had occupied seven other nations following the war, their territory had expanded by at least four to five times. As long as they allocated and managed their resources well, there would be no cause for concern for their sustenance.</p><br/><p>However, after the big seven guilds of the trade union obtained their own dominions, they refocused their efforts and resources to their own territory. In that situation, their grasp on the control of the Union itself had waned. At the same time, the sub council that was usually relegated to the sidelines had increased their influence. It was then when the aftereffects of the War of Glass began to show.</p><br/><p>The Union's sub council comprised mostly the representatives of the citizens, the second-rate merchant guilds and representatives of guilds of various crafts. The sub council's main purpose was to take care of the miscellaneous stuff like enforcing security, and bringing in more civilians. Following the war, the big seven had managed to successfully realized their goals to expand the Union. But even though the territory had expanded greatly, most of it was swept up by the big seven guilds and some other outstanding second-rate guilds. As a result, there were those who still had yet to have enough of their fill.</p><br/><p>For instance, during wartime, the short-sighted merchant guilds and mercenaries who only focused on plundering the wealth of the nobles of the nations they invaded disobeyed orders from the military to do their own thing, much to the dismay of President Cobleit, then commander of the Union army. That was why the president decided to get back at those disobedient folk when the time came to split the rewards up, greatly decreasing the benefits they ought to have received as a punishment for disobedience and also kicking out a few that were promised noble titles out of the list.</p><br/><p>It was already too late for the second-rate guilds and mercenary groups that had lost the lands that were once promised to them to regret. But that did not stop enmity from building up in the subsequent discussion of the sub council of the Union, much to the trouble of the big seven guilds. But given that the war had ended, there was no longer any place they could take for more territory to appease those parties. As a result, the Wessia Merchant Guild, one of the big seven, came up with an idea.</p><br/><p>Back then, the Union had good reason to be wary towards the second highness and his army of 300 thousand. But given that he had been entangled with the nobles of the Redlis kingdom all this time since the War of Glass, those at the Union had begun to see through the second highness's facade of might. Additionally, if the second highness eventually manages to occupy the whole of the Redlis kingdom, he would proceed to the Lormo duchy and force Duke Lormo to return under the banner of the empire. That was something which the Union would never allow to happen. Since Second Highness Auguslo was eventually bound to be their enemy given their conflicting interests, the Union definitely did not mind driving the proverbial knife up the second highness's back to destroy his dreams of reuniting the empire.</p><br/><p>Other than that, while the big seven guilds have obtained their own dominions, the nobles who originally controlled those lands were not easy to deal with. This would be a good opportunity to send those nobles to the frontlines to earn achievements to qualify for new noble titles and land.</p><br/><p>That was the reason for the military intervention conducted by the Union at Bodolger Province. Only the Wessia Merchant Guild participated in the attack. The rest of the big seven were busy settling down into their new dominions. It did not help that the second highness had made an error himself, choosing to gather his troops at the Majik Province leaving only a small number of old garrison troops at the citadels around Kanbona Province. Perhaps, he had thought that there would be no point in stationing so many soldiers at places so far behind where his army was currently located at.</p><br/><p>But never did Second Highness Auguslo expect that the Union would launch a surprise attack and actually manage to conquer Kanbona Province. Given that the citadels over there was his only connection to the Andinaq kingdom, the strategy of the Union could be said to almost been executed with surgical precision. With but one strike, they had cut off the lifeline of the second highness. Not only that, the four central duchies have once more refused the second highness's beckoning to return to the empire and even formed an allied army of 100 thousand men to face off against the troops of the second highness and reinforce the troops at Majik Province, causing the second highness to be surrounded by enemies front and back.</p><br/><p>Lorist breathed a long sigh at hearing all that.</p><br/><p>\"Milord, what are you worried about?\" asked Potterfang from the side.</p><br/><p>\"The second highness's situation at the Redlis kingdom,\" said Lorist. He did not feel the need to hide anything from his treasured subordinate.</p><br/><p>\"Milord, there's no need for you to concern yourself over this,\" Potterfang said frankly. Ever since the experience of being manipulated and used by the second highness, he had held the grudge close to his heart, especially with regards to some of his friends which the second highness had poached. \"Since the second highness didn't ask us to deploy our troops, there's no need for us to go out of our way to clean up his mess. Even if he's considered to be a senior noble of our house, we've always fulfilled our due obligation to him. I believe that Milord shouldn't have sent Supervisor Hansk to the imperial capital. You also shouldn't poke your hands into the affairs of this conflict. It's best for our house to rest up in the coming two years to reorganize our military and wait for better opportunities.\"</p><br/><p>Lorist shook his head and said, \"No matter what, the second highness is still a senior noble of mine. I should at least worry about him a little. If the imperial capital requests for us to deploy our troops to rescue the second highness, all we'll do is to send our forces and breach the enemy front at Kanbona Province. As for the nobles of the Redlis kingdom at Majik Province, I couldn't be bothered to care about them, unless I stand to see the first prince gone for good. Weird, as the king of the Redlis kingdom, why is the location of the first prince still unknown? It's already been a year and a half since his disappearance...\"</p><br/><p>At the end of the 6th month, Supervisor Hansk who was sent as an ambassador to the imperial capital had returned. Lorist was sparring with Blademaster Shuss at Seaview Manor at that time. After resisting over more than a hundred strikes from Lorist, Shuss eventually discarded his weapon and surrendered. As Lorist wiped some sweat off his face, he received the letter that Hansk handed over.</p><br/><p>Upon opening it, he could see that the letter asked for the Norton house to stay put and not involve themselves into the military affairs of the Andinaq kingdom. The letter was even sealed with the insignia of the kingdom's regent.</p><br/><p>Lorist read the letter over and over before turning to Hansk and asking, \"Who's in charge at the imperial capital currently?\"</p><br/><p>\"Milord, the one who received me at the imperial capital was Marquis Reid. When he read the letter you penned, he respectfully refused help from our house and said that he has already ordered the second royal local defense legion stationed near the borders of the Madras duchy to barge its way through Kanbona Province to arrive at the frontlines to reestablish contact with His Majesty the King. He then wrote this letter and had me deliver it back to you,\" replied Hansk.</p><br/><p>\"Marquis Reid?\" Lorist murmured, as he recalled the old man he saw at one banquet of the imperial capital. While he could not quite remember how the man looked like, he did remember that the young son of the old man had brought a bunch of other noble youths to occupy Seaview Manor on Silowas for up to five years. It was not until Lorist's arrival on the island that they were apprehended and punished.</p><br/><p>\"Hahaha...\" This old guy is definitely doing this out of spite. Sol, for him to let his private feelings affect his decision on the military matters of a nation and deal with this in such a childish manner... Hmph, you think I wanted to send my soldiers out? You just saved me a bunch of trouble, old fool! With this letter in hand, Lorist had all the reason in the world to completely ignore the second highness no matter how dire in need he was in.</p><br/><p>\"Well, Howard, make sure to keep this letter well no matter what. This is extremely important,\" said Lorist as he handed Howard the letter.</p><br/><p>\"Milord, just before I started heading back here, Marquis Reid assigned an escort for me. When I arrived at Jillin Harbor, I heard the garrison squad leader make an order to not let the soldiers of our house step on the shores even one bit,\" added Hansk.</p><br/><p>Confused, Lorist asked, \"What is the meaning of that? Are they treating us like enemies?\"</p><br/><p>Hansk made a bitter laugh and said, \"Well, I don't know why myself. But that was the order I heard. They were also told to monitor our troops on high alert.\"</p><br/><p>\"But, Sir Hansk, even if they give that order, they shouldn't say it in front of you! Did you offend anyone of the escort?\" interjected Howard.</p><br/><p>\"Hmmm,\" Hansk mumbled as he scratched his head in thought, \"I don't think I had. All I did was stop them from attacking those helpless refugees on the way back... Did they have to offend us just because of that?\"</p><br/><p>\"What's that about the refugees?\" Lorist asked, \"Tell me about that in detail.\"</p><br/><p>\"Well, it all started like this. We encountered lots of refugees during our stay at the imperial capital who were originally from the two southwestern provinces. We even managed to recruit up to 60 thousand of them to go to the island to help out with the development. However, after the second highness's assault on the capital of the Redlis kingdom, Frederika, he conquered Kanbona Province without even a single fight. It was then when the second highness settled the refugees down at Kanbona Province temporarily. But now that the forces of the Union have occupied Kanbona Province, those refugees have nowhere else to go and traveled to the imperial capital,\" explained Hansk.</p><br/><p>\"Why would they go to the imperial capital? They could always head to the territory of the Union, or even Morante,\" said Howard.</p><br/><p>\"That's because the Union doesn't welcome them. They are, after all, civilians of the former Krissen Empire, a scapegoat for the hate of those of the Union. The former empire had been at war with the Union for almost a century and who knows how much blood has been spilled over those conflicts. Both sides hate each other profusely. This is a grudge borne for life that is ingrained deep in their bones. Don't be mistaken about our amicable relationship with the Peterson and Chikdor merchant guilds. They are merchants, and they don't believe in justice or injustice, only profits. However, the civilians under their rule are different. Only after another century or so would the grudge between those two parties begin to fade,\" said Lorist as he stroked Howard's head. Having lived at Morante for almost a decade, he understood the mindset of the citizens well.</p><br/><p>Hansk said, \"Milord, that's exactly the case. Those refugees told me the same thing. According to them, the soldiers from the Union occupying Kanbona Province would attack them for no good reason. There has already been plenty refugees murdered for no just cause. The refugees were forced to leave that place. Fortunately, they set out on their journey early. Given how the Union's forces have already arrived at the two southwestern provinces, it won't take long until they reach the capital.\"</p><br/><p>Hansk clutched his chest in worry and continued, \"During our journey back, we would frequently encounter refugees in the way of our path. The ones escorting me would not hesitate to cut them down with no discourse whatsoever and even cursed the refugees for being cowardly leeches that allowed Kanbona Province to slip from their hands. They even blamed them for not being willing to fight to their deaths with the enemy and wanted to punish the refugees with death as they would deserters.\"</p><br/><p>\"Good Sol!\" Lorist cursed uncontrollably, \"How did knights like them even think that the refugees are responsible for this war? It's not their fault that Kanbona Province was lost! Their brains must be rotting from the insides!\"</p><br/><p>\"That's all too right, Milord. The behavior of those knights got on the nerves of Sir Reidy, who promptly walloped them and gave their faces a few harsh slaps. Oh, now I know... Those knights must have been pissed that they've lost face to the enraged Reidy. That was why they bothered to announce their disrespectful orders right in front of us in an attempt to shame our house,\" said Hansk as he began to flush with embarrassment.</p><br/><p>Both Els and Jim who led the guard brigade had gone on vacation to break through to the gold rank, so Lorist had Reidy take over as the leader of the guard brigade temporarily and accompany Hansk on his trip to the imperial capital.</p><br/><p>\"Haha, they wish to shame the House of Norton? I'd like to know where they got the guts to do that,\" Lorist said while snickering, \"Howard, pass down my orders. Have Senbaud prepare his Oceanic Legion and get Potterfang's first division on board the ships. I want to head to Jilin Harbor to see for myself the one who gave the order to not allow Norton troops to step on the shores of the kingdom.\"</p><br/><p>\"Milord, if you do that, they'll think that we're trying to revolt right away,\" said Hansk in a hurry to dissuade Lorist.</p><br/><p>\"Worry not, my governor. I won't be stupid enough to actually order our troops to attack Jillin Harbor. All I want is to bring my guards there for a shopping trip. I'd like to see whether the garrison of Jillin Harbor will dare to attack a count of the kingdom like me. It's well within my rights to bring a guard escort with me around the kingdom. The moment they attack us, I'll charge them for treason for attempting to harm me, a count of the kingdom. After that, we'll be fully within our rights to act out of self defense. I want to see evidence for the order to not let us get on shore with my own two eyes no matter what!\" said Lorist. However, he did not act rashly with anger like Hansk had predicted and was rather clear-headed instead, causing the old supervisor to heave a sigh of relief.</p><br/><p>\"Lord Locke, let me come along with you for a stroll,\" said Blademaster Shuss proactively.</p><br/><p>\"Alright, we'll leave right away. Let's see which fool dares come causing trouble for the House of Norton.\"</p><br/>\n</div>"}