{"title": "Chapter 327 The Princess's Heart", "id": 327, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-327-the-princesss-heart", "volume_title": "Volume 4", "body": "<h1>Chapter 327 The Princess's Heart</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Princess's Heart</p><br/><p>Enjoy this week's fourth release!</p><br/><p>Since Princess Sylvia already arrived at Firmrock Castle, Lorist traveled ahead of his escort so that he would arrive sooner. He was curious how she knew of his refusal of the duke’s conditions already.</p><br/><p>She's not here to interrogate me, is she?</p><br/><p>Count Kenmays, Baron Felim, and Baron Shazin mocked Lorist jokingly as he left with Reidy, Howard, and ten-odd guards, wishing him a 'blissful life'. It took them just three days to reach Firmrock Castle.</p><br/><p>The moment Lorist dismounted, before he could even dust himself off, Princess Sylvia rushed over and hugged him -- tears streaming down her face.</p><br/><p>Lorist hurriedly tried to apologize, \"Sylvia, I'm So--\"</p><br/><p>Before he finished, Princess Sylvia bawled even louder, mumbling, \"Brother Locke... Hollycost... He... He left just like that... He's not even ten!\"</p><br/><p>Wait, what? Who's Hollycost? That name sounds familiar, thought Lorist for a good while before he finally remembered, Isn't Hollycost the young prince of Iblia? That child of the second prince the queen birthed after their drunken lock-up?</p><br/><p>Unfortunately, perhaps because of the use of drugs, Hollycost was born with a congenital heart disease. One of his herbalists said he would likely not even see his twentieth birthday.</p><br/><p>The young prince was abandoned by the queen after his birth and was put under Duke Fisablen’s charge, who treasured the child like his very own kin. However, when he found that the young prince had a birth defect, he no longer cared as much and didn't consider him a trump card anymore. In fact, it was Sylvia who had dragged the child along with her and raised him like her own little brother.</p><br/><p>After she stopped crying thanks to Lorist's consolations, she explained why she didn't participate in the knighthood tournament. Hollycost had passed away suddenly without warning. The servants initially thought he had simply fallen asleep. It was only in the evening, when the servants felt that he had slept for far too long and attempted to wake him, that they realized that his body had cooled and he was no longer breathing.</p><br/><p>When Princess Sylvia received word at Windbury, she requested Duke Fisablen postpone the tournament by a couple of months so she could return to Eastwild to tend to the matters resulting from poor Hollycost's death. After all, he was technically the rightful heir to the kingdom’s throne. However, Duke Fisablen refused. He thought the prince, who had just died wasn't of much use to him in the first place, and the knighthood tournament concerned the reputation and future of the house, especially because it involved Sylvia's marriage. It had to go on no matter what. As for the dead Hollycost, he would deal with it as he would with deceased household knights.</p><br/><p>Sylvia was angered and disappointed at Duke Fisablen's cold and heartless decision. After a huge argument, she looked for her aunt, the queen, to report the death of her son.</p><br/><p>She didn’t expect the queen to be even more heartless than her father.</p><br/><p>“I never cared about him when he was alive, why should I now that he’s dead?” was all she was on the matter.</p><br/><p>Fuming with rage, Sylvia threw a huge tantrum before she brought Blademaster Xanthi and her guard with her back to Eastwild to bury Hollycost.</p><br/><p>However, she realized that she wouldn't be able to give Hollycost a burial fitting a prince no matter how hard she tried, because even in the entire kingdom, Hollycost's name itself was somewhat of a taboo. Since the queen herself didn't want anything to do with the dead prince, the nobles treated him like he didn't exist. In fact, the queen and the nobles were relieved that they didn't have to bother with the prince’s burial.</p><br/><p>So, Sylvia could only carry out the matter herself. While she did receive Duke Fisablen's incessant letters demanding her return to show her face at the tournament, the letters only made her angry and caused her to ignore the messengers completely. But when the final messenger came over with a letter that stated the princess would be dragged to the capital by the duke personally, she made the decision to run away. She headed for Firmrock Castle. She did so because she felt the Norton dominion was the only place her grandfather couldn’t drag her out of.</p><br/><p>Lorist breathed a long sigh.</p><br/><p>So the princess isn't here to ask about my refusal after all.</p><br/><p>However, Lorist soon found himself troubled. Should he tell the princess about his objection to the duke’s conditions and the subsequent annulment of their engagement, or not? Lorist saw Sylvia’s tender emotional state at pr sent and decided to keep quiet on the matter for the time being. He would tell her once she was more stable.</p><br/><p>In the month that followed, Lorist traveled around with Sylvia in an attempt to lighten up her mood, which meant that Count Kenmays and the barons weren’t greeted by anyone when they arrived at the castle. The angered count wrote Lorist a letter. ‘You bastard! You’re putting hoes before bros. You’re so caught in your lust you’ve completely forsaken friendship!’ were but one of the many things he had to say in his letter.</p><br/><p>Lorist didn't really mind the count's comments. In truth, he felt rather guilty towards the princess, perhaps because he still hadn’t informed her of his refusal of the duke's requests. Her mood had improved substantially over the last couple of days and her smile started to regain its former glamor. Lorist really didn't feel like ruining the good mood by bringing up his falling out with the duke.</p><br/><p>The moonlight melded with the waters and illuminated the clear waters. The proud hull of Northsea cut across the silvery surface of the sea and sailed on the infinite waters of the ocean.</p><br/><p>After having fun at Silowas for about half a month, Princess Sylvia was finally in the condition to return to The Northlands. During that time, Sylvia was just like a lovestruck maiden falling in love for the first time. She grew closer and more reliant on Lorist, which only served to intensify Lorist's guilt about the matter. He knew well things might not remain as they were for long, with the mountainous obstacle that was Duke Fisablen standing between them.</p><br/><p>The round silver moon appeared like a gleaming plate of silver, hanging from the dark blue veil of the night.</p><br/><p>Princess Sylvia leaned on the ship’s railings and stared out over the ocean. as she looked at the ocean.</p><br/><p>\"Brother Locke, I never imagined the sea could be this beautiful. I remember grandfather brought me to a cliff near a beach once. It was the first time I saw the sea with my own eyes. All I saw were harsh waves bashing against the cliff harshly. The water was black and the wave’s splashes were unbearable. The winds were very strong. I clutched onto my grandfather with all my strength, I didn’t dare let go. He told me such was the sea, borderless and infinite. I've always had the impression that the sea was something ferocious and that sailing was a huge risk on one's life.</p><br/><p>\"I didn't think traveling to Silowas with you would make me realize that the sea also had times it is calm and gentle. We can build sandcastles, collect seashells, and even play by the water. I didn't think it would be that fun,” she said, the moonlight on the water shimmering in her eyes, “Look, Brother Locke, the moonlight looks like silver sparkles on the sea’s surface. How beautiful...\"</p><br/><p>“It's the 7th month right now,” Lorist said smiling sweetly, “It’s when the northern seas are the calmest. When the 11th month comes, it will become harsher, almost like what you saw in your childhood. Sailing then will definitely be very risky. I once sailed to The Northlands during the 11th month. The waves were so tall they could reach the ship’s deck. Fortunately, the ships built by our house are sturdy. There's no worry of them being crushed by the waves.\"</p><br/><p>Sylvia's eyes gleamed.</p><br/><p>“Brother Locke, you're amazing,” whispered she.</p><br/><p>\"Well,\" mumbled Lorist as he stroked his nose shyly, Why do I feel like a middle-aged man tricking a little girl with a lollipop?</p><br/><p>Despite his slight sense of forbiddenness, Lorist couldn't help but feel a certain sense of pride and achievement from seeing Sylvia's adoring gaze.</p><br/><p>Sylvia accosted Lorist and leaned on his body. He froze like a statue.</p><br/><p>\"Brother Locke, you still haven't told me about your experiences in the tournament,\" Sylvia whispered.</p><br/><p>Lorist grit his teeth. He had known the time would come eventually.</p><br/><p>\"I'm sorry, Sylvia. Your grandfather brought up three requests I couldn’t accept.”</p><br/><p>\"I knew it,” the girl sighed, “You wouldn't be accompanying me on this trip otherwise, would you? Can you tell me what the requests were?\"</p><br/><p>Thus, Lorist informed her about the requests without holding any detail back.</p><br/><p>Sylvia turned around slowly and looked at Lorist with her starlight-like eyes.</p><br/><p>\"Brother Locke, don't you fancy me?\"</p><br/><p>\"Sy-sylvia... I... I do like you, that much is true... But if it means having to e-exile them... It isn't f-fair to them... After all, t-they're my women and children, and I am their man and father. I f-feel responsible for their well being...\"</p><br/><p>Sylvia leaned on Lorist's chest. Her arms slipped around his waist, clasped his back, and drew him into a deep hug.</p><br/><p>\"I... I know, Brother Locke. I can see your sincerity in the first two requests. I don't blame you for turning down the third. In fact, if you had agreed to it, I would have looked down on you. It's because you aren't cruel and heartless that you stood your ground. I... I can't help but envy your lovers and children...\"</p><br/><p>The girl slipped into silent weeping as the last words left her mouth.</p><br/><p>\"H-hey, don't cry now Sylvia... It's my fault,\" mumbled Lorist in a panicked fit.</p><br/><p>Sylvia raised her tear-covered face, her crystal eyes pierced into Lorist’s soul.</p><br/><p>\"Kiss me...\" she whispered.</p><br/><p>Lorist’s arms wrapped the princess in his embrace. He lifted her to him and the two kissed under the gentle gaze of the moon. In the corner of the deck, Blademaster Xanthi let out a soft sigh. She stayed quiet for a long moment before she spoke.</p><br/><p>\"It’s getting late, Sylvia. You should get some sleep. You wouldn't want to catch a cold, the winds are rather chilly.\"</p><br/><p>The pair separated. Lorist stared silently at Sylvia’s red face, like a moon-rising on a wet evening, one last time before she darted for her cabin. He glared at Xanthi but only got light giggles in return.</p><br/><p>When they arrived at The Northlands, Sylvia told Lorist, \"I'm going to return to the house. Brother Locke, you've already agreed to the first two requests for the sake of House Fisablen. As for the third, I should have a say in it since it concerns me directly. I’ll make sure my grandfather understands and doesn't make an issue of it.\"</p><br/><p>Lorist finally relaxed after the girl departed. He decided to take a stroll around the dominion instead of returning to Firmrock Castle right away.</p><br/><p>Charade, busier than ever, rolled his eyes at Lorist once he returned.</p><br/><p>\"Aren't you carefree as always? Traveling with a beauty at a time like this...\"</p><br/><p>\"Well, it's because you're here that I'm able to take it easy. Tell me, is there anything important going on within the dominion?\" laughed Lorist.</p><br/><p>Charade put down the folder in his hand.</p><br/><p>\"Did you forget Els is going to get married? The big day's on the 10th day of the 8th month,” inquired he.</p><br/><p>Oh, there was that too, thought Lorist as he slapped his forehead, \"Ah, I think he mentioned it while we were still in Windbury. He said he was going to take Mancheny’s daughter as his wife after he broke through to the gold rank. I think the ceremony will be held in Redriver Valley, at his manor. He also said that he would go to Morante to see his uncle and his other pals, so I gave him a three-month leave.\"</p><br/><p>\"Very well, we ought to present him with a great gift,” Charade snickered, “I still remember he caused so much trouble during my wedding. I’ll finally get my chance to pay him back. Haha, I'll definitely make sure he regrets what he did...\"</p><br/><p>Lorist wiped the sweat off his forehead.</p><br/><p>To think this fatty would hold a grudge for such a long time! He's still on about that thing during his marriage even though his son's already a few years old!</p><br/><p>Lorist knew Charade was just fooling around and wouldn’t go too overboard, so he didn’t interfere.</p><br/><p>\"Is there anything else?\" asked Lorist.</p><br/><p>\"There are two pieces of good news and one bad one,\" said Charade.</p><br/><p>\"What are they?\"</p><br/><p>\"Ovidis and Dulles have managed to break through to become gold ranks. The two remaining manors at Redriver Valley have owners now. As for the bad news, Jim failed his breakthrough and must take half a year off to recover according to the herbalist.\"</p><br/><p>It was definitely good news for Ovidis and Dulles to succeed in their endeavors. Despite being a former bandit, Ovidis had been loyal ever since he pledged his allegiance, which was why Lorist trusted him deeply. Enough to give him command of the Thunderbolt Brigade. It was a definite improvement for him to breakthrough to the next rank.</p><br/><p>As for Dulles, he had been traveling with Lorist ever since the days of Dawn Academy. Being the founder of the carroballista unit and its commander, he had gained many achievements over the last decade. However, his silver rank battleforce had caused him to stand out in a bad light even more among the commanders of his army. Now that he had broken through to the gold rank, he had become one of the 16 gold-ranked knights of the household. Being another person Lorist deeply trusted, he would definitely be utilized more often now.</p><br/><p>It was too bad that the joy of hearing about Ovidis and Dulles's successes was dampened significantly by word of Jim's failure.</p><br/><p>\"Jim was in too much of a rush to break through,” Charade sighed, “Even though he was injured in Hanayabarta’s conquest, he insisted on trying to break through the moment he was reasonably healed. He might have stood a chance if he’d waited another six months. You ought to visit him when you're free. I checked on him a few days back and he seemed rather down and unstable.\"</p><br/><p>Lorist nodded and was just about to say something when he heard hurried footsteps coming his way.</p><br/><p>\"Milord!\" Tarkel yelled the moment he opened the door.</p><br/><p>\"Come in!\"</p><br/><p>Breathing raggedly, Tarkel reported, \"Mi-milord... There's word from Iblia. On the 30th day of the 6th month, the four central duchies united and launched a military campaign against the Melein duchy. They sealed off the roads into and out of the duchies so we only got word from our informants fifteen days ago. We just received word that the duchies’ army attacked Messen Castle on the 23rd day of the 6th month. Duke Melein also died on Mount Leiffdema surrounded by enemies. Melein’s been completely wiped out!\"</p><br/>\n</div>"}