{"title": "Chapter 337 Conditions", "id": 337, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-337-conditions", "volume_title": "Volume 4", "body": "<h1>Chapter 337 Conditions</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Conditions</p><br/><p>Enjoy the fourth release of the week!</p><br/><p>In the end, the second highness insisted that he follow Lorist to the war zone.</p><br/><p>\"Your Highness,\" Lorist said, \"even though House Kenmays and House Shazin are our allies, they are still considered nobles of the Iblia kingdom. Given the hostile situation between them and the Andinaq kingdom, I am rather worried for your safety. I think it's best if you don't head to the frontlines.\"</p><br/><p>The second highness patted on Lorist's shoulder with a smile.</p><br/><p>\"No worries. With Brother Locke around, I don't have to worry for my safety. As for Baron Shazin and Count Kenmays, since they're your allies, I believe they wouldn't be interested in a kingdom's former monarch like me. Also, I'm only going there to take a look, not to meddle in military affairs. I believe I will be treated well as a fellow knight there to observe the tide of war.\"</p><br/><p>And so, Lorist had no choice but to bring the second highness along.</p><br/><p>Four days later, Lorist and company crossed the floating bridge that stretched across Metropoulos River and arrived at the borders of the Madras duchy.</p><br/><p>The Northlands's army was situated not far from the river's crossing point. After destroying the enemy fortifications and routing their troops, Count Kenmays and Baron Shazin ordered their troops to a mound nearby instead of having them press their attack into the duchy. They set up camp where Baron Silas' castle once stood. The baron had been hung some years earlier. The troops fortified their camp so heavily that it seemed they intended to stay there for quite a while.</p><br/><p>Lorist had received a letter from Count Kenmays five days ago, stating that the army wouldn't press their assault and instead cooped up at the castle ruins atop the mound. As Lorist predicted, the Madras duchy's nobles' private forces, as well as the duchy's main force, seemed to have run completely amok, savagely attacking the allied army's camp. Those hectic times lasted for more than ten days until the Madras forces lost more than five thousand men from their assaults. They finally halted their attacks and sent a messenger to the enemy's camp.</p><br/><p>\"Locke, your plan to stand our ground instead of attack truly is marvelous! Hennard himself said if we had continued to advance, we would've been attacked by the private armies and the duchy's main force. It would no doubt have multiplied our casualties. All we had to do was occupy this area and defend it to crush their counterattack attempts without breaking a sweat! Umm, who is he?\"</p><br/><p>When Count Kenmays saw Lorist, he began to boast about how effective the latter's strategy had been, until he saw the smiling second highness whose eyes were gleaming with excitement.</p><br/><p>Lorist briefly introduced the two, causing Kenmays to act rather awkward, given that he was a noble of the Iblia kingdom and the king of the enemy kingdom was right in front of him. However, the second highness was only a former king and had also come as a fellow knight to observe the battles, so Kenmays didn't intend to do anything about his presence.</p><br/><p>The second highness, on the other hand, acted very amiably to the count, first praising the Kenmays house for running the largest construction guilds back during the time of the empire, expressing what a shame he thought it was for them to have pledged allegiance to the Iblia kingdom, as well as mention how much he admired the count's talent. In just ten minutes, the second highness and Kenmays were already close to the point they decked shoulders like long lost brothers and chatted happily without end.</p><br/><p>When they arrived at the tent, Shazin Hennard had also just returned. After Lorist introduced the second highness to the baron, the second highness expressed his friendly and familiar attitude once more. However, Shazin didn't really trust the display and maintained a formal and polite demeanor.</p><br/><p>The reason Lorist had to rush over was that of the matter of the messenger. At first, Kenmays only demanded the trade routes through the duchy be restored and for the allowance of crossing through Metropoulos River with low taxes for merchant convoys. He didn't think the messenger would return quickly after being sent back with an agreement to all of the count's requests. Since it had already been achieved, there would no longer be a reason for their troops to stay. In essence, they would have to withdraw their forces once more and the war would end.</p><br/><p>Not knowing what he should do, the count wrote to Lorist while he tried to delay the duchy as best he could. After hearing about the count's explanation, Lorist laughed.</p><br/><p>\"Don't care about them. We just have to mind our own business. For now, we must make sure this camp has enough resources to winter here. If you have time on your hands, sweep some of the local nobles' castles or demand they pay a tribute for the war. Only attack them if they don't comply.\"</p><br/><p>\"What if their messenger comes to object to our actions?\" asked Kenmays.</p><br/><p>\"Simple. Who was the cause of this war in the first place? It's none other than the arrow outposts situated at the duchy's defensive line that not only forbade passage through the river but also sunk two of Hennard's fishing boats. We must have the duchy pay for their mistakes as well as make up our military expenses. Just make ridiculous demands, if they want to bargain or negotiate, make sure to drag them on for as long as possible. All we have to do is maintain the status quo until winter is over. We must also have the duke himself sign on our agreement and not some nobody who claims to be able to accept the conditions on behalf of the duchy. Only then will we withdraw our forces.\"</p><br/><p>Kenmays was overjoyed to the point that he slapped his thigh.</p><br/><p>\"That's right! Spending so much time in this military encampment has rusted my mind. I didn't even think of such a simple solution and felt a little odd when I thought about how easy it was to defeat the duchy. The moment I heard their agreement to our conditions, I thought we had lucked out, but I almost ended up tricked by them. I can almost be sure the duchy's folks won't acknowledge the agreement after we withdraw our forces and deploy their troops at the bank of the river once more.\"</p><br/><p>\"All we have to do if that's the case is launch another attack,\" said Hennard confidently.</p><br/><p>\"Locke, if the duchy accepts the rest of our conditions, what do we do?\" asked Kenmays after some thought.</p><br/><p>\"Then we have no choice. If Duke Madras is willing to pay such a price, we will have to withdraw. However, we can use the excuse of not trusting them to request for a plot of land near the riverbank to garrison a division of troops two reasons. The first is to protect the bridge and the second is to ensure safe passage for the merchant convoys from The Northlands,\" replied Lorist.</p><br/><p>\"Very well, we'll do just that. I'll tell the messenger that when he comes again. If they are able to abide by our conditions and show the duchy's sincerity, we will agree to end the war.\"</p><br/><p>Originally, the second highness only intended to watch their discussion with a smile. However, he felt something was off the more he listened to the point he couldn't resist his urge to speak.</p><br/><p>\"Apologies for interrupting, Brother Locke, Count Kenmays, may I ask you the reason for this war?\"</p><br/><p>\"Oh, Your Highness, it all started like this. Duke Madras sealed off the crossing point at the river and even sunk two of House Shazin's fishing boats. This attack was made in retaliation for the duchy's acts. If Duke Madras agrees to no longer seal off the river and reopen the trade routes, allowing our merchant convoys to conduct business within the duchy, we will end the war,\" answered Kenmays politely.</p><br/><p>\"Does that mean you're not willing to conquer the duchy and make it your own dominion? That would achieve your goals as well, won't it?\" asked the second highness curiously.</p><br/><p>Kenmays rolled his eyes and looked at the second highness like he would an idiot.</p><br/><p>\"Your Highness, it's not that we don't want to occupy the duchy, the price we have to pay for it is far too high. Even though we are able to pull it off, our goal is first and foremost the reopening of trade. Why would we bother with conquering the duchy? We'd have to invest much more resources to develop the place as well if we do, and we're not stupid enough to. As long as Duke Madras agrees to our conditions, it won't hurt to end the war.\"</p><br/><p>The second highness looked disappointed because he thought the reason the Nortons and their allies attacked the duchy was to exterminate it instead of just giving it a small poke to re-establish trade. He had thought that he could use the chaos that would result from the war to recruit the refugees into his new Whitelion Legion so he could travel through the duchy to reclaim his throne. His dreams were shattered without any mercy at all.</p><br/><p>Seeing the second highness's disheartened look, Lorist tried to resist his urge to smile. He had already known the true goal of the second highness for making this trip. While Lorist had his own plans for occupying the duchy, he wouldn't let the second highness take advantage of it.</p><br/><p>\"Alright, let's get something to eat. Also, Hennard, please see that His Highness is settled down and rested. We have traveled for quite a number of days, so let's rest after our meal and leave any talking to tomorrow.\"</p><br/><p>Even though it was wartime, with the spoiled and indulgent Kenmays around, the ad hoc banquet was as plentiful as ever. However, the second highness appeared rather down for the most part and didn't have much of an appetite. It didn't take long for him to leave for the room Hennard had prepared with the excuse of feeling a little tipsy.</p><br/><p>\"Why did you bring him along? It was so awkward for me just now,\" complained Kenmays.</p><br/><p>\"I didn't have a choice either,\" Lorist shrugged, \"He insisted on following, and I can't just refuse my senior noble without good reason. Since he's no longer the king, there's nothing wrong with him coming here as a noble knight.\"</p><br/><p>\"Didn't he disappear for quite a while? Why has he showed himself all of a sudden? Since you were already a free noble, it must feel quite bad for your senior noble to pop up again all of a sudden,\" said Hennard.</p><br/><p>Lorist breathed a long sigh and told them about how the second highness managed to escape his predicament, as well as what he requested of the Norton house.</p><br/><p>\"Hahahaha!\" Kenmays and Hennard both laughed upon hearing how the second highness wasn't able to recruit soldiers at the Norton dominion.</p><br/><p>\"You know, Locke, don't you think that ex-king of yours is rather useful? You can use him and his name to send your troops to reclaim his kingdom. You can then install him as a puppet ruler. He can jump to your will whilst you pull the strings from the shadows,\" said Hennard with a flash of inspiration.</p><br/><p>Kenmays didn't hesitate to put a damper on the thought.</p><br/><p>\"Forget it, I'm sure you know of the ambitions that man has. He's always wanted to be the emperor that reunites the empire. Controlling him is out of the question. What a mastermind requires is a cowardly dog, not a wolf king that'll take a bite out of him at the first opportunity.</p><br/><p>\"Just look at how he treats Lorist. Not only did he use him while he called him Brother Locke, he's actually rather guarded and fearful of House Norton's might. Now he got himself into this pool of trouble, he still wants to rebuild his army and rely on himself to reclaim the throne instead of letting Locke do the honors and agreeing to the terms of his house. That alone should be enough to show how hard it is to control someone like him.\"</p><br/><p>\"I sent someone to have Ovidis hide his catapults before I came; the second highness won't learn of our secret weapon. Make sure you order your subordinates to not leak it either. It's fine if the second highness wants to see anything else. Since we're not in conflict at present, the frontlines are rather peaceful. I'm sure they won't be able to hold on for a few more days. It'll be much easier for us when they leave. All we have to do now is follow our original plan,\" said Lorist as he stood up and concluded the banquet.</p><br/><p>Lorist didn't feel like going to rest after a full meal. Since it was still the afternoon, he had Els bring him two fishing rods from Kenmays's tent. He had just tasted some fresh whitefish from Metropoulos River during the banquet and Kenmays didn't fail to boast about his fishing skills. Hennard, on the other hand, said hatefully that when he was busy beating away the duchy's forces, Kenmays was fishing. However, there was naught Hennard could do but complain, given how his favorite woman was the count's cousin.</p><br/><p>After three hours of fishing, they got many different types of catch, all apart from whitefish. Seeing that it was getting late, Lorist and Els rowed their fishing boat back to shore and returned to their camp.</p><br/><p>The ruined castle on the mound had already been restored halfway. It was the center of operations for the army as well as Hennard and Kenmays' temporary residence. It was arranged for Lorist to stay in a building not far from the main castle. He ordered a couple of guards to deal with the catch as he climbed the stairs to his room for a bath.</p><br/><p>After Lorist entered the tub, a guard outside reported that Kenmays had come over, probably to invite Lorist for dinner. Lorist didn't mind and let Kenmays into the room. Since they were both men, there wasn't anything to be shy about.</p><br/><p>Unexpectedly, Kenmays's first words were.</p><br/><p>\"Your king got me to chat with him for the whole afternoon. Do you know what he's up to?\"</p><br/><p>Surprised, Lorist asked, \"What?\"</p><br/><p>\"He promised to grant many of my wishes and drew a huge picture of what I would receive if I agreed to pledge allegiance to him,\" Kenmays laughed, \"He said he would elevate me to the status of a duke and give our house a whole province.\"</p><br/><p>\"Do you trust his word?\" asked Lorist, laughing.</p><br/><p>Kenmays shook his head.</p><br/><p>\"Not really, but I can't say I'm not moved by his words.\"</p><br/><p>\"Why?\"</p><br/><p>\"Locke, House Norton is a military-based noble house; it has centuries of history in the Krissen Empire. We are not. House Kenmays only used to be the largest construction guild during the days of the empire. We practically paid the second prince for our noble title, and that guy's a traitor to the empire. Now that he's dead, Iblia's future is on a precipice of uncertainty. If the kingdom is exterminated, nobody will be willing to acknowledge our peerage. The Andinaq royal family, on the other hand, has the legacy of the Krissen Empire. That, is what the second highness symbolizes.\"</p><br/>\n</div>"}