{"title": "Chapter 348 Gold Coins (1)", "id": 348, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-348-gold-coins-1", "volume_title": "Volume 4", "body": "<h1>Chapter 348 Gold Coins (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Gold Coins (1)</p><br/><p>Hey Guys.</p><br/><p>We've been working on something wonderful behind the scenes. We just know you guys will enjoy it! Everything's hush-hush for now, but check out our \"Patreon page\" (link to patreon page) and Liberspark's homepage tomorrow at the usual chapter release time for the big announcement. Just a hint: You might want to start revising what you know of TRL's world so far to prepare yourself. We can't wait to tell you guys what we have planned! Enjoy this week's last chapter and stay tuned for an announcement!</p><br/><p>Ryogawa and Prince</p><br/><p>\"Your Grace, the inventory of the spoils from the Madras duchy is finished,\" said Spiel with a yellow folder in hand.</p><br/><p>\"How much is there?\" asked Lorist.</p><br/><p>\"There were only 1.74 million gold coins in all the houses' treasuries, including House Madras'. It doesn't even make two million,\" replied Spiel, disappointed.</p><br/><p>While the conquest of the Hanayabarta kingdom brought House Norton 27 million gold coins, the conquest of the Madras duchy only netted them 1.7 million. The disparity was akin to robbing a beggar after breaking into a tycoon's house.</p><br/><p>It did seem reasonable after some consideration. The Hanayabarta kingdom was an isolated island kingdom that had enjoyed peace for nearly a century and profited greatly from the slave trade and managed to gather lots of resources, which eventually ended up in House Norton's hands. As for the Madras duchy, they were embroiled in conflict every couple of years. Lorist himself had plundered quite a bit of their wealth when he came through with the convoy. The second prince's 'reinforcement', actually a cover for taking advantage of the duchy, had caused the duchy huge losses shortly after. It took the duke a lot of money and effort to stabilize the duchy and fortify its borders thereafter. They would've finally had some peace, that was until the Nortons spoiled their plans by coming from the seas and wiping the duchy off the map altogether.</p><br/><p>Just like an old man that punched with all his might but missed and hurt his back at the same time, Duke Madras's efforts and spending were all for naught. Whether it be the newly built citadels or his armies, they couldn't be put to any use in the conflict. It didn't change the fact that the duchy's treasury was in a pitiful state to say the least, however.</p><br/><p>\"Duke Madras spent over six million gold Fordes on his military over the past five years. I really want to see Kenmays's face when he finds out the profits he made from the duchy by selling our outdated armor left the duchy's wallet practically empty,\" said Lorist hatefully.</p><br/><p>\"Your Grace, half of the six million was used to construct the seven citadels near Sanderson Hills and to fund the formation of the four garrison legions stationed there. What remained of the money was used to purchase equipment and weapons. Of that, one million was used to purchase iron ingots from the Handra duchy for their own smiths to work with,\" said Spiel after looking through the accounts.</p><br/><p>Lorist dropped the account sheet on his desk.</p><br/><p>\"In essence, we got lots of military gear and resources?\"</p><br/><p>\"Yes, Your Grace,\" Spiel said before he flipped the folder in his hand and continued, \"The weather over the last couple of years has been rather benign, with no notable instances of natural disasters, allowing Delamock's storehouses to fill up with food. The accounts state that there are approximately 13 million Pors. We shouldn't have to worry about food for the next three years.\"</p><br/><p>There were 13 million Pors, each representing 50 kilograms. The duchy's conquest netted the house 650 million kilograms of food -- definitely good news. Even though the Norton dominion had been developed rather extensively over the last ten years, the dominion's food production only just barely satisfied the demand. Should a natural disaster ever occur, the house would have to fret over the matter of securing food. Now that one of the dominion's larger problems had been solved, Lorist felt pronouncedly relieved.</p><br/><p>\"Your Grace, apart from food, there are also a lot of other military resources left behind by the surrendered soldiers. There is enough equipment to arm 300 thousand men. We've sorted it all according to quality, there are around 300 sets of superb quality armor, 70 thousand of decent quality, just over 100 thousand of average quality, and around 270 thousand sets of varied weapons. The armor of any worse quality has already been sent to the forges to be made into farming tools. How are we to deal with the armor and equipment we gained?\" asked Spiel.</p><br/><p>It was a rather worrying problem. Since the house already had Sid steel armor and many of their own weapons, they wouldn't use the outdated gear they sold to the duchy. That was also the case with their three allies, as their forces also used equipment produced by them. Lorist would have to find another way to strike a military arms deal.</p><br/><p>\"Keep the superb ones and around 30 thousand sets of the decent ones. When the house finishes entitling our vassals, we can assign these to their garrison and private forces so they'll be well-protected whenever they follow us into battle. As for the rest, send a portion to Silowas and ask whether the Peterson Merchant Guild wants to sell them on our behalf. If they're not interested, we'll wait for Count Kenmays to return. Didn't he say he wanted to start a new trade route to the four central duchies? We'll see if we can sell the equipment to them,\" said Lorist,</p><br/><p>Shocked, Spiel said, \"Milord, aren't they our enemies? Would it be appropriate to sell to them?\"</p><br/><p>\"If not them, then to whom?\" Lorist asked, rolling his eyes, \"The second highness will only pay us in the form of credit, we won't get a single copper coin out of him. As for House Fisablen, the military arms deal with them still hasn't concluded yet. We have Peterson Merchant Guild collecting orders for us at the Union, but ever since the Chikdor Merchant Guild's purchase of the armor we produced, they didn't submit any further orders. That makes the four central duchies the only viable target.</p><br/><p>\"Supervisor Spiel, you have to be more confident in the house. If the four central duchies become our enemy, the equipment will just come back to us.\"</p><br/><p>The lack of people to trade with was one of the negatives of The Northlands' ruralness. Grindia was rather large and irregularly shaped. Humans only populated two-thirds of the land area that formed the shape of a ladle. The Northlands wasn't truly located in the north of the Grindian continent, but rather the middle. The reason it was called as it was, was because it was the northmost point humans had settled. Past The Northlands was uncharted wildlands that humans hadn't frequented since the end days of the magical civilization more than two thousand years earlier.</p><br/><p>Lorist was right in that there were no other targets for House Norton to sell to, apart from the four central duchies. It made him rather envious of the strategic location of the Union's territory; it was situated in the middle of the north and the south and had the neighboring duchies with which to trade. Perhaps, he could have Senbaud take the Oceanic Legion and start a new trade route to the Golden Bay. It just might bring the house even more wealth.</p><br/><p>Spiel quickly realized the new Duke of The Northlands was gazing off into the distance with empty eyes, oblivious to what he was saying.</p><br/><p>\"Hrmm-hrmm.\"</p><br/><p>\"Sorry. My thoughts wandered. Could you repeat what you said?\" admitted Lorist.</p><br/><p>\"Your Grace, even though we only obtained 1,74 million gold Fordes from the duchy, we found three underground treasuries at the duke's mansion in Edelise. They contain imperial gold, each treasury has just over 3 million. We have ten million imperial gold coins in total.\"</p><br/><p>\"Then we did end up earning quite a lot after all,\" Lorist exclaimed, elated, \"Ten million gold coins make about three million gold Fordes.\"</p><br/><p>\"Your Grace, the duchy has never thought of exchanging imperial gold coins for gold Fordes,\" Spiel countered with a stern expression, \"According to the mansion's butler, the duke intended to mint gold Fordes himself.\"</p><br/><p>\"What did you say? Duke Madras wanted to mint gold Fordes?\" asked Lorist curiously.</p><br/><p>\"Yes, Your Grace. Currently, the exchange rate for imperial gold to gold Fordes is three to one. That rate is actually a small act of revenge by the Union against those of the empire. Simply put, of the three imperial gold coins exchanged, one would be pocketed by the merchant guild carrying out the exchange,\" replied Spiel.</p><br/><p>\"You're saying the real rate is two to one? Two imperial gold coins for one gold Forde?\" asked Lorist.</p><br/><p>Spiel shook his head.</p><br/><p>\"No. In terms of weight, the exchange rate is actually 1.7 imperial gold coins to one gold Forde, and that ratio hasn't changed for the past 30 years. When the Union first began minting gold Fordes, the exchange rate was only 1.2, which then rose to 1.5 and settled at 1.7, and hasn't changed since.\"</p><br/><p>\"Wait, aren't gold coin exchange rates dependent on the gold each coin actually contains? Since when was weight used as a measure?\" asked Lorist curiously.</p><br/><p>\"Your Grace,\" mused Spiel with a troubled expression.</p><br/><p>He found his lord often had no idea about common knowledge like this, even though information concerning gold coins were not all that well known.</p><br/><p>\"All gold coins contain the same gold ratio: 7.5:1.5:1; 75 percent gold, 15 percent bronze and ten percent chrome. That ratio has existed since the days of the magical civilization since only coins minted with that ratio can pass the liquid test. Even if coins were minted with 100 percent gold, they would still be considered fakes and nobody would dare to trade with them.\"</p><br/><p>Lorist palmed his forehead when he finally recalled some information about gold coins. Back before Lorist transmigrated, the original owner of the body had been taught this at Dawn Academy. The memory wasn't his own, so he neglected it most of the time. All gold coins on the continent were made in that ratio. It was said the ratio was set by the magi for the common people during the magical civilization, whereas they used an even better kind of magical gold coin.</p><br/><p>Coins made according to that ratio had one amazing quality: they wouldn't change in color and were extremely resistant to the trials of time. Even after long periods of use, they would still retain their shiny look. Even the imprint on the coins would still look good as new. The magi had also made a kind of liquid to be used to test the authenticity of such coins. Any coin that wasn't made in that ratio would sink straight down when put in the liquid, whereas coins made according to the ratio would float.</p><br/><p>It was a truly mysterious and unique liquid. Lorist recalled that, during one of his herbalist classes, the professor prepared a large basin filled with the mysterious liquid. The materials used to make the liquid were extremely cheap -- around two small silvers -- and was used to drill the basics of mixing into the students. Lorist still remembered the fun he had when he tossed gold coins into the pool of water and the curiosity he had for how it worked. The professor said that if Lorist wanted to know the answer, he had to research the material himself, saying that the secret to finding out how the liquid worked was up to him.</p><br/><p>He was reminded once again that he wasn't in his previous life where coins could be minted with varying ratios. Back then, there were many anniversary coins minted to commemorate certain events. One time, he bought a large amount from some sport event, thinking their price would appreciate in time, only to realize they actually began to rust.</p><br/><p>Aren't these coins minted by the government? How can they rust?!</p><br/><p>After getting them inspected by experts, he learned that the anniversary coins were minted with really small traces of gold by a non-government institution.</p><br/><p>Grindia's the best after all. Since the ratio is the same, people only have to weigh the coins to determine their relative value. I remember someone said... who was it again? Ah, that professor from Dawn Academy said proudly that the number of gold coins minted by a nation represented its might. The citizens of the Forde Trade Union has always been rather proud of the fact that its currency was used all over the continent.</p><br/><p>The stronger the might of a nation, the more reliable others would consider their currency. When the Krissen Empire was at its prime, imperial gold coins and gold Fordes only had an exchange rate of 1.7 to one. But now the empire was in shambles, the exchange rate actually became three to one. It was no wonder Duke Madras wanted to re-mint imperial gold coins into gold Fordes to cut his losses.</p><br/><p>Lorist also remembered that his house used to trade mainly with imperial gold coins according to the three to one ratio. The loss of a third of the value made his heart wince with slight pain.</p><br/><p>\"Supervisor Spiel, doesn't our house have imperial gold coins as well? Were they all exchanged to gold Fordes?\"</p><br/><p>\"Your Grace, back then, we used imperial gold coins according to the three to one ratio. But Knight Charade later instructed us to stop using them and stock them up instead. Since we didn't lack gold Fordes, we did as he instructed. After obtaining the ten million imperial gold coins from the duchy, I went to check our accounts. We have eight million imperial gold coins, most of which have been exchanged from the commoners with the three to one ratio.\"</p><br/><p>The moment Lorist heard this, his heart skipped with excitement. With 18 million imperial gold coins in hand, he could try to re-mint the gold coins into gold Fordes as Duke Madras had attempted. If the ratio was two to one, then everything could be converted into nine million gold Fordes, which would do wonders to make up for the house's massive spending over the past two years.</p><br/><p>\"Can we re-mint the imperial gold coins into gold Fordes too?\" asked Lorist hurriedly.</p><br/><p>\"I am only in charge of overseeing the treasury, Your Grace,\" Spiel said, shaking his head, \"I don't know about minting coins. You should discuss this with Sir Charade.\"</p><br/><p>\"Alright. Howard, have Knight Charade come over immediately.\"</p><br/><p>\"Yes, Milord.\"</p><br/>\n</div>"}