{"title": "Chapter 345 An Audience", "id": 345, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-345-an-audience", "volume_title": "Volume 4", "body": "<h1>Chapter 345 An Audience</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>An Audience</p><br/><p>This week's second release is coming your way! Also, don't forget to join our discord server. Drop in for a chat and say hi!</p><br/><p>The southern area of The Northlands was House Shazin's dominion, where the former duke's mansion at Gildusk was located.</p><br/><p>The days passed like years for the second highness. Fortunately, the sun would shine upon The Northlands once more after 20 or so more days of rain. Even so, he was impatiently waiting for the four nobles to invite him over as a spectator to the battle with the Madras duchy. After sending his henchmen to ask about the news, the response he got angered him so much that his face almost contorted irreversibly.</p><br/><p>\"What did you say?! The four nobles are busy with their winter harvests and don't have time to watch the battles?!\"</p><br/><p>He felt he truly didn't understand what was going on in their minds.</p><br/><p>The duchy's 100 thousand plus forces have already waited through winter and the rainy season. Their morale must've dampened considerably. Forcing an enemy to a decisive battle will definitely lead to victory! Those fools are still bothering with the winter harvests at a time like this?! Are they out of their minds?! Once we lose this chance, it'll be too late for regrets! The enemy will be able to use the time to regain morale and vigor!</p><br/><p>It wasn't that he didn't think the winter harvests weren't important. It would be equally troubling to miss the appropriate time to harvest and sow new seeds, but even so, was it more important than what was happening on the frontlines? The second highness hurriedly wrote a few letters to remind the nobles to not forget about how important the upcoming conflict was. He included an anecdote about his own failings and suggestions to avoid making the mistakes he had.</p><br/><p>It didn't take long for him to receive a reply, however. Lorist's response was as short as letters get, containing only three words: I got it.</p><br/><p>Baron Shazin sounded slightly more annoyed, saying: I'm the one at the frontlines. I know better than you.</p><br/><p>Baron Felim's response addressed the strategic suggestions of the second highness. It pointed out that the two points the second highness put out wasn't exactly adequate, and explained the reason for his rebuttal.</p><br/><p>Count Kenmays penned a really long letter filled with flowery words that filled up five whole pages, three of which were expressions of his concern and care for the second highness's living conditions and mental state. He even said that if the chef preparing his meals weren't satisfactory, the count would send his own personal chef to ensure the second highness got the best treatment during his stay. On the fourth page, the count stated his thoughts about the time he visited the imperial capital and expressed sympathy for the second highness's homesickness. The final page contained a whole discourse about how busy the count was within his dominion, as well as how his knights were acting according to House Norton's orders for the moment. The letter closed with, 'I believe the situation will stabilize soon enough. Victory is already in sight. Please rest assured, Your Highness.'</p><br/><p>The letters caused the second highness to fume so intensely he wanted to tear the letters up in anger. Not one of the nobles bothered to invite him to the frontlines. Not willing to accept it, the second highness sent his gold-ranked knight Ripleid to check the situation.</p><br/><p>However, Ripleid returned just three days later. He reported that he was prohibited from crossing the bridge into the duchy. He stayed there for a day and apart from seeing the Norton forces prepare for the construction of a citadel at the crossing, he didn't notice anything and had no choice but to return.</p><br/><p>The second highness was even more depressed. It was apparent the four houses had come to an agreement to not let him meddle in the conflict. At the same time, it also showed that, even though the four houses considered him their liege, they were still very cautious of any of his advances. They knew of his plan to rebuild Whitelion Legion from the war-torn duchy. It definitely played a huge part in why he was forbidden from entering the duchy.</p><br/><p>Gah, how frustrating!</p><br/><p>The second highness hoped deeply that the four houses and the duchy's forces would have as huge a battle as possible. One that saw both sides suffer severe casualties. Perhaps only then would the four nobles recall the second highness's reputation as a war god and seek him out to save their sorry asses.</p><br/><p>The only good news the second highness received when he arrived at Gildusk was the growth of the army with which he planned to restore his throne. They had recruited around 600 people from the Norton dominion. But at Gildusk, they were able to get more than three thousand in less than a month, with four freelance knights and around ten wandering knights pledging allegiance as well. The second highness ordered Glacia to have the Whitelion Legion equipment brought over while he remained at the army camp to train his troops.</p><br/><p>Seeing that the 5th month would soon be upon them, the second highness decided to test the four nobles by offering his own troops as reinforcement. If they were making good progress, they would refuse his help. If the opposite was true and their forces were entangled with those of the duchy, they would definitely be more than happy to have the second highness on the frontlines. If that were the case, however, the second highness's newly built force would no doubt have to suffer heavy casualties.</p><br/><p>Just when the second highness was pondering whether he should offer help, he heard a soldier outside the tent report, \"Your Highness, Count Kenmays has arrived and wishes to have an audience with you. He's waiting for your summons outside the camp.\"</p><br/><p>Count Kenmays is here? thought the second highness with joy.</p><br/><p>Just as he was about to summon the count, he suddenly felt that he was being a little too rash.</p><br/><p>I should put on some airs and let the count wait for a while first.</p><br/><p>Thus, he announced, \"Tell Count Kenmays I'm a little busy right now and have him wait for a bit.\"</p><br/><p>The second highness felt the count must've come because of the conflict. Given that the total force count in the conflict was at least two or three hundred thousand, there was no way victory would be so easily decided, especially with the duchy's troops, which had a reputation of being incredibly hardy. Thinking of the time he tried to attack the Redlis kingdom with his army of 300 thousand, it was that old tortoise Duke Madras that had caused him the most grief.</p><br/><p>The second highness looked for Ripleid for a sword training session. The second highness was also a three-star-gold-ranked knight at the end of the day. He took just thirty minutes to defeat the two-star Ripleid. Sweating profusely, he ordered a bath and fresh clothes prepared. After all that, he felt it was about time for him to receive Count Kenmays, who had been waiting outside the camp.</p><br/><p>The guard quickly left and came back alone, reporting, \"Your Highness, after Count Kenmays heard you were busy, he left almost immediately on his carriage, saying he'd come visit again in two days.\"</p><br/><p>The second highness was completely flabbergasted.</p><br/><p>What's the meaning of this?! Wasn't the count going to see me for my opinions and strategies to use in the conflict? Did I guess wrong? Are the four houses actually holding up well against the duchy?</p><br/><p>It can't be. While that old tortoise Madras isn't any good when it comes to attacking, his forces excel in defense. Such was the case when the second prince attempted to attack Kobo as well! The second prince lost eleven times and ended up wearing his own army out! The duke was able to turn it into a huge victory and forced the second prince back to Delamock!</p><br/><p>Perhaps Count Kenmays was only pretending, thought the second highness hurriedly.</p><br/><p>It was to be expected given how the count was responsible for the oath contract, which he realized too late and found he didn't gain any real benefits apart from being liege in name and even handed the authority to make the decisions to Lorist.</p><br/><p>It's best if I am warier when dealing with Count Kenmays, lest I get duped again.</p><br/><p>Having learned his lesson, the second highness finally called his guards to monitor the count's actions after a good moment of thought. Perhaps he would be able to get some inkling of his intentions after seeing what he did.</p><br/><p>\"Your Highness, Count Kenmays is going to organize a ball at his mansion and he has invited many noble ladies.\"</p><br/><p>He's still in the mood to dance… there shouldn't be a problem with the war...</p><br/><p>The second highness forced himself to stay calm so he wouldn't be misled by the count's many tactics.</p><br/><p>\"Your Highness, Count Kenmays went frolicking to the south of the city with a few noble ladies and even brought a few rattan balls for fun. He will also be partying with them at his mansion in the evening.\"</p><br/><p>The second highness finished the fruit wine in his cup frustratedly. Had he gotten the wrong impression of the count's visit? Did the count only do so out of formality?</p><br/><p>\"Your Highness, this afternoon, Count Kenmays met with a few traveling merchants. At ni-night, he brought the merchants to the largest brothel in the city to… to let loose.\"</p><br/><p>The second highness was so angry he instantly smashed the table he was using.</p><br/><p>That darned bastard! What the heck?! Didn't he say he would come see me in two days? It's already the third day, and instead of coming to see me, he actually went to frequent the brothel?! How can he do that as a noble?!</p><br/><p>\"Your Highness, Count Kenmays is here.\"</p><br/><p>\"Oh, quick, have him come in...\"</p><br/><p>During the afternoon of the fourth day, the count finally came to see the second highness, who lost so much sleep his eyes had sunk noticeably.</p><br/><p>\"Ah! Your Highness, what's going on? You don't seem well! What happened?\" asked the count after he saluted.</p><br/><p>It's all because of you, bastard...</p><br/><p>The second highness had tossed about in his bed for the whole night, not getting the slightest bit of sleep.</p><br/><p>\"These days,\" he sighed, \"I've been rather troubled. I just can't seem to get any sleep the moment I think about the kingdom's situation. My throne was taken and now I'm here, stranded in The Northlands, looking at our great empire crumble day by day. The Union's influence is getting stronger while the four central duchies forgot about the glorious days of the empire and unite with the enemy. Hearing this tears my heart apart! How can I even get a good night's rest with all this happening?!\"</p><br/><p>\"Your Highness, while it's your duty to be worried about the state of your kingdom as king, you must look after your health.\" Count Kenmays consoled, \"Don't worry too much about this matter and tire yourself out. The past has already happened, as long as you stay strong, you will definitely be able to regain your throne one day. With you on our side, we are confident the empire will return to its former glory. Since you're not in prime condition right now, I suppose I'll come visit you on another day.\"</p><br/><p>What?! You're going to leave after just spewing a few lines of crap to me?! You haven't told me anything I want to hear about yet!</p><br/><p>The second highness hurriedly stopped the count.</p><br/><p>\"No, I can't do this. If you're not in good shape, I definitely shouldn't disturb your sleep any longer. I... I think it's better if we do this another time,\" refused Kenmays.</p><br/><p>No way I'll let you do that! snapped the second highness inwardly, It's not like I'm actually king now, so there's nothing better for me to do! Staying at the camp all day long training those rookie soldiers is so dull I almost want to go count ants!</p><br/><p>\"Wait a second,\" said the second highness as he grasped the count's hand and pushed him onto a chair, \"Since you took your time to make the trip here, let's have a good chat. I'm feeling fine so there's no need to worry about me. I only lacked a bit of sleep over the past two days, it's no big deal.\"</p><br/><p>\"Then, it's more important if you rest! I think it's best for me to not interrupt.\"</p><br/><p>\"There's really no need. Lord Count, how's the war with the duchy going? Are the casualties great? Do you need me to reinforce you with the five thousand men I have here?\"</p><br/><p>The count looked shocked and said, \"The war? It's going well and we aren't losing that many men. There's no need for you to send your men over, Your Highness. All you should do is get some good rest.\"</p><br/><p>\"There aren't many casualties? Then how are things progressing with the war?\" asked the second highness anxiously.</p><br/><p>\"Ah, you were talking about the casualties for the final battle? The final battle hasn't even started yet!\" laughed the count.</p><br/><p>\"Hasn't even... started? Why? Didn't you tell me you were going to attack and wipe the duchy's forces out in one fell swoop? Why aren't you going with the plan any longer?\"</p><br/><p>\"Oh, it's like this, Your Highness... It's not that we weren't going to launch our attack. The duchy's forces surrendered before we could start.\"</p><br/><p>\"What did you say? Surrendered? The 100 thousand soldiers of the duchy surrendered to the four houses of The Northlands?\" asked the second highness in disbelief.</p><br/><p>\"Indeed, Your Highness. Not only did they all surrender, Duke Madras has also been captured. The Madras duchy is no more,\" said the count with a face full of smiles.</p><br/><p>The second highness sat back in his chair, stupefied.</p><br/><p>What... what about the final battle? Aren't you going to go into a bloody battle with the duke's forces and end up badly hurt yourselves? Was it all just my imagination?</p><br/><p>\"How did you guys do it?\"</p><br/><p>The second highness began to smile bitterly the moment he realized all his plans had gone down the drain. Despite his bitterness, he was curious how the four houses managed to pull off such a feat. He didn't suspect the count's words at all because the count definitely wouldn't dare lie about having the duke captured.</p><br/><p>\"The sea,\" the count said, \"Lorist landed his household forces on Platinum Beach and attacked Edelise, before occupying Xith Castle, Vanades, and Kobo. When the three locations were taken, the duchy's forces camped opposite our own lost their supply line and had no choice but surrender.\"</p><br/><p>The second highness thumped on the table hatefully the moment he understood. He had also boarded the ship from Silowas to The Northlands during the previous year and even passed by Platinum Beach on the way. Yet he hadn't imagined that it was an avenue of attack he could use. When Duke Madras deployed all his soldiers to the frontlines, his headquarters was left undefended. It was a fatal weakness that Lorist had managed to grasp. With but a light push, the duchy came toppling down.</p><br/><p>\"So you came here to see me just to tell me this? Congratulations, my count. You've just become a duke,\" said the second highness mockingly.</p><br/><p>How ironic. Even though the duchy was exterminated, a king like me doesn't get any benefits. As the contract states, as long as the duchy is no more, Count Kenmays automatically becomes a duke and Sidgler becomes his hereditary dominion, all without needing my permission.</p><br/><p>The second highness was so displeased he felt his heart throb with pain. If it were other nobles promoted, they would have to present a sum of gold to their liege. Yet, the fellow in front of him had managed to skimp even on that. The second highness really could use more funds for his army.</p><br/><p>\"Your Highness, this is all thanks to your wisdom and leadership,\" thanked Kenmays habitually without caring about how insulting it could be construed as, causing the second highness to flush red immediately.</p><br/><p>\"We have conquered the duchy, but a situation has come up that we need your advice on, Your Highness. Our losses were minimal, so some of us think we should keep the momentum going and go for Queen Carey right away so you may get your throne back at the earliest moment possible. Some, however, were against the idea and think we should help Baron Felim attack and reconquer Southern first. Naturally, Your Highness, I'm on the side of sending troops against Queen Carey,\" said Kenmays.</p><br/><p>I bet you are actually part of the camp wanting to attack Iblia!</p><br/><p>The second highness took two deep breaths and forced himself to calm down.</p><br/><p>\"Why don't you strike down the illegitimate ruler first? I remember the contract contains a clause that necessitates the restoration of my throne. Are you about to go against your oaths?\"</p><br/><p>\"Your Highness, we will definitely restore your throne, but so far, we've encountered a tricky situation. We lack the funds to deploy our troops, so many of us think we should slowly gather funds before we launch a campaign against the queen.\"</p><br/><p>\"Out with it. Just tell me what you want and stop going in circles,\" the second highness exclaimed as he stood up.</p><br/><p>\"I want a written promise from you, Your Highness, which is signed and stamped with your royal seal just like our contract,\" said the count as he stood up, \"If we restore your throne in this year, you will exempt the four houses from any taxes for the next five years and pledge that you won't collect any form of payment from us. The five-year exemption will make up for our military costs.\"</p><br/><p>The second highness furrowed his brow.</p><br/><p>\"Three years is the most I can do.\"</p><br/><p>\"It would seem it is best we gather the funds on our own then. Good day, Your Highness,\" the count said, preparing to leave.</p><br/><p>\"Fine, you win. I agree to your proposal, but you have to ensure I can return to the imperial capital by the end of this year,\" said the second highness.</p><br/>\n</div>"}