{"title": "Chapter 343 Suggestion", "id": 343, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-343-suggestion", "volume_title": "Volume 4", "body": "<h1>Chapter 343 Suggestion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Suggestion</p><br/><p>Hey guys, here's the fifth and last release of the week! Also, we have a live reading session on our discord channel fifteen minutes after the release of this chapter! Feel free to join us there using this link: https://discord.gg/4eGrngf</p><br/><p>Just join the general voice channel and you're good to go!</p><br/><p>A storm raged outside the window.</p><br/><p>It was already the middle of the 3rd month. On Grindia, this was the start of the rainy season. The season lasted for nearly two months in the south of the continent. The Northlands was in the middle of the continent, however, and thanks to the naturally barrier of the Magical Dragon Mountains, not much of the weather from the south existed there. The Northlands only had 20 days of rain during the rainy season.</p><br/><p>Lorist had already returned to Fimrock Castle and left Potterfang to deal with what was left of the duchy. After becoming Duke of The Northlands, he had to act the part per his subordinates' advice and not lead the charge every time there was a battle. All he had to do, and should do, was ensure the house was heading in the general direction of his goals. The details were up to the household knights and officials.</p><br/><p>Nowadays, there were 16 gold-ranked knights serving the house. Had it not been for the fact that Duke Madras had a rank 2 blademaster by his side, Lorist wouldn't have bothered to be present for the operation. His desire for absence was because his presence made him miss Dilianna's delivery date. When Lorist was enjoying the service of his two new companions, the young aunt of Arriotoli gave birth to another child for the house at Firmrock.</p><br/><p>Lorist looked at the map for a good while as Charade instructed Howard to get two more candles.</p><br/><p>\"Locke, are you still worried about the operation? Firmrock Legion has already occupied Kobo and cut off the supply lines of our hundred thousand or so enemies. From the successful occupation, we discovered they had planned to ship another batch of resources to their camp before the rainy season but were unable to do so before our arrival. I'm sure the soldiers of the duke's army will be worn out and starving by the end of the season. They won't have any option other than surrender.\"</p><br/><p>\"I know the situation in the duchy is mostly set in stone,\" Lorist answered, shaking his head, \"I've already ordered Tigersoar to head west after the rainy season to force the enemy to surrender. I'm sure you've also read Pog's report that we've already taken control of their supplies when we conquered Kobo. They were only unable to launch a counterattack to retake the city because the season is already upon us.</p><br/><p>\"I know the enemy we have to face is the 60 thousand men of Seamountain Legion. Originally, the garrison of Kobo and Vanades each had another ten thousand men. There are also 20 thousand troops stationed at Sanderson Hills, not to mention the 10 thousand private troops of the nobles. It's clear as day they're trying to fight back with the coming of spring in one decisive battle, but we didn't even give them such a chance.</p><br/><p>\"Without their supplies, the duchy's troops will struggle to survive. I expect what remains of their supplies and workhorses will probably last them through the season. I didn't intend for Tigersoar to fight them when I deployed them. I already wrote to Loze and told him his main purpose was to keep the enemy trapped in their camps. Since the harvest season follows directly on the rainy season, I definitely won't allow them to start harvesting crops to get out of their predicament.</p><br/><p>\"According to our plan, Tigersoar will keep the enemy in camp while Hennard brings the Shazin forces to encircle the seven citadels at Sanderson Hills. Without supplies from Kobo, the 20 thousand soldiers will have to surrender in at most two months. House Kenmays' forces will also head to Sidgler to take Firmrock Legion's place so the latter can return to Silowas for the next phase of our plan. As for House Felim's light cavalry legion, we will leave it to them to exterminate the nobles in Delamock that still resist. Given most of the Madras nobles have already fallen into our hands, I'm sure it will be an easy task for Felim.\"</p><br/><p>Charade flipped open another folder.</p><br/><p>\"Locke, Firmrock Legion captured 38 landed nobles in total during the capture of the duke's mansion in Edelise. According to a list with their respective titles, there are members from 63 houses of the duchy. It should've been more than 80, but the second prince took out 20-odd houses when he stormed Delamock. The nobles that participated in the banquet at the mansion can't be considered the duke's confidants. The people he truly trusts probably serve Seamountain Legion and the garrison forces. We better be wary when dealing with the aftermath to prevent anyone from putting up a last stand.</p><br/><p>\"Also, even though the nobles of the houses trusted by the duke didn't attend the banquet, the female and younger members of those houses did and have also fallen into our hands. There are around 100 noble ladies and young masters from these houses among those we captured. Perhaps, we can use them as bargaining chips to get their houses. As long as they give up resistance, we will allow them to leave the duchy with their wealth and family members go wherever they want. I believe it'll rid them of any desire to resist.\"</p><br/><p>Lorist nodded.</p><br/><p>\"Alright, do so. I'll write a letter to Pog, Loze, and the rest to cooperate with you. Let's obtain victory at the smallest price possible. I hope the situation can be settled before the 6th month.\"</p><br/><p>\"Locke, would the second highness have any objections to us letting the nobles loyal to the duke go?\" asked Charade.</p><br/><p>Even though the second highness was the former king of the Andinaq kingdom in name, the knights of the house addressed him as 'His Highness' instead of 'His Majesty', and Charade was no exception.</p><br/><p>\"Don't care about him. Even if he sees those nobles as traitors of the empire for joining up with Duke Madras, there's no point in us sacrificing our house's troops to exterminate them. If the second highness wants to punish them, he'll have to catch them himself. Since there's nothing in it for us, we're not obligated to do anything.\"</p><br/><p>The ten-odd years of experience as a dominion lord had familiarized Lorist with the norms of the world and the nature of his position. Causing trouble for the royal family is the favored pastime of almost all landed nobles.</p><br/><p>\"Understood. But what do we do about the 38 captured nobles?\" snickered Charade.</p><br/><p>\"For the noble houses of the old Krissen Empire, those above the title of viscount will be demoted one rank. Don't bother with the barons. There's no way they can be demoted further. After you're done with the demotions, move their dominions to Winston. As for the nobles Duke Madras entitled, we don't have to acknowledge their peerage. Just release them and confiscate two-thirds of their assets. Let them leave with the rest and go wherever they desire,\" replied Lorist.</p><br/><p>\"Whoa! Then we won't have many landed nobles left! I've already estimated we'd only have around 20 houses left,\" Charade exclaimed, looking at his list.</p><br/><p>\"Locke, what do we do if the nobles close with the duke insist on keeping their titles and dominions?\" continued he.</p><br/><p>\"Well, tell them they can remain nobles with a one-rank demotion as long as they become our vassals. We'll accept their pledge of allegiance if they can prove their worth. Duke Madras was no fool, and anyone he prioritizes must be capable to some degree. Perhaps, some of them might prove rather useful.\"</p><br/><p>Lorist gave it some thought before added, \"Also, House Yujink and House Sabri don't need to be demoted or moved. Just have them become vassals. Their dominions will have to be adjusted, though.\"</p><br/><p>House Yujink and House Sabri were the houses of the two beauties with whom Lorist had spent that pleasurable night. Thanks to letting their daughters warm Lorist's bed, the houses wouldn't be punished and survived the transition to another lord smoothly with minimal losses, much to many's envy. At the same time, it showed the leader of House Norton, the Duke of The Northlands, was a person who cared for relationships and connections, instead of being cruel and heartless.</p><br/><p>Charade tried to stifle his laugh as he commented, \"I heard it gave you quite some trouble back then.\"</p><br/><p>Lorist stroked his nose awkwardly as when he returned to Firmrock Castle from Edelise, he brought the two beauties along. It naturally enraged Arriotoli.</p><br/><p>\"We sisters and our aunt are already your women, and our aunt even birthed you a son! Yet, you used attacking the Madras duchy as your excuse to skip my aunt's delivery and even dare to bring two beauties back with you?! Do you think I'll just sit quietly and accept this?! I'll show you what I've got, you shallow, superficial bastard!\" she had said at the time.</p><br/><p>\"How did you resolve it?\"</p><br/><p>Charade was rather curious about the matter. Even though Arriotoli was a jealous and envious woman, the household knights and officials had a rather good impression of her. Mainly because of the effort she put in to become a silver-ranked knight, as well as how she only kept her tantrums between her and Lorist. On one occasion when she tried to pitch her sister as the matron of House Norton, she made sure to ask the officials and knights about their opinions on the matter. But when she learned that it wouldn't work, she dropped it without complaint instead of pestering Lorist.</p><br/><p>\"Nothing much. I just agreed to move House Dina's dominion to Delamock and take it as our vassal,\" Lorist said with a troubled smile, \"I also promised I would bring the two sisters with me during my excursions in the future. They said it was necessary to stop me from bringing back more beauties after every trip.\"</p><br/><p>\"Hahaha,\" laughed Charade heartily.</p><br/><p>Lorist got a bottle of fruit wine and poured Charade some during their little interlude.</p><br/><p>\"Oh, Milord, Knight Malek sent a report that requires your attention. He requested to be held responsible for the revolting citizens' massacre in Edelise,\" Charade said as he took out a piece of beastskin from his blue folder, \"It arrived yesterday afternoon. Take a look.\"</p><br/><p>Lorist gave it a quick glance before he did something that surprised Charade. He set the report on fire using a nearby candle and let it burn.</p><br/><p>\"Locke, what are you doing? We have to archive it,\" said Charade, stunned.</p><br/><p>\"No,\" Lorist said, shaking his head, \"Not this report. No record will be kept of the revolt. I'll also reward Knight Malek and have him give me a list of people who managed to contribute to its suppression. This matter was dealt with swiftly. I've long told you that as Edelise has been the headquarters of House Madras for more than 40 years, the citizens are no doubt very closely tied to it. Having only ten thousand men stationed there is a little too careless. Had Malek not steeled himself and cut the root of the problem away, we would've been chased out of the city. If that happened, I have no doubt the whole of Sidgler would have joined in.</p><br/><p>\"Apart from Edelise, House Madras didn't enfeoff any other noble house land within Sidgler and instead constructed around 40 farmland manors and took in 200 thousand people. Among them are the family members of Seamountain Legion troops. It's the reason they are the most elite among the duke's troops. It's as if Duke Madras kidnapped their families. If they don't perform well, their families will pay the price. They were forced to give their all and fight to their deaths.</p><br/><p>\"According to the name list of the legion, which we got from the duke's mansion, I've already had Furybear collect the families' belongings. We'll send them to the legion after the rainy season to crumble their will to resist. Part of the reason those who pulled the strings behind the scenes started the revolt was to stop us so the legion wouldn't be out of the fight. They hoped to buy time for an opportunity.</p><br/><p>\"Hehe, it's too bad they were merely dreaming. There's no way they can change the situation now. I bet they didn't think we would move House Kenmays's dominion to Sidgler. The huge move will wipe the province clean. It'll extinguish all insurgent factors. Let's see who'll have the last laugh.\"</p><br/><p>According to the agreement with House Kenmays, 250 of the current 340 thousand people living in the eastern Northlands -- thanks to the Kenmayses' refugee recruitment effort over the last couple of years -- would be moved to Sidgler, while the Nortons would be in charge of the evacuation of the original Sidgler citizens so the Kenmays folk would have homes to live in and land to farm.</p><br/><p>Put bluntly, House Kenmays planned to move most of their subjects with them to Sidgler to displace its original citizens, who would be in turn moved to the eastern Northlands. According to Charade, it was an unnecessary move, but House Kenmays felt it was best to bring their own subjects with them. Otherwise, their position might not last longer than a few years.</p><br/><p>\"Locke, will the soldiers of Seamountain Legion and the duchy's garrison forces be required to serve three years' labor to develop the eastern area of The Northlands?\" asked Charade.</p><br/><p>Lorist gave it some thought before he replied.</p><br/><p>\"The east's development has to wait. The vacation of the citizens of Sidgler, who are the family of many in Seamountain Legion, is to let them get used to The Northlands' environment. The skilled ones like smiths are the ones who will meld with our house the easiest since there isn't anybody but us who appreciate their talents more. They'll be given preferential treatment and be allowed to work at our factories to fill up the demand.</p><br/><p>\"As for the soldiers of Seamountain Legion and the garrison forces, let them build the roads in Delamock after they surrender. I hope we will be able to connect Vanades and Kobo in two years, before building another highway straight to The Northlands. I really don't understand how the empire was run back then. If they had built a highway, it wouldn't take more than five days to travel from Vanades to The Northlands. There's no point in making the journey curve and triple in traveling time...\"</p><br/><p>Charade laughed at Lorist's complaints.</p><br/><p>\"Locke, you didn't know how much the Krissen Empire spent to build the current connections. The reason behind its current state is the fact that the highway would have to pass through the dominions of many nobles. They've objected to its constructions vehemently for many decades. The empire rejected their demands to be allowed to collect tolls on the highway, so they refused to let the highway pass through their dominions. In the end, the empire didn't have a choice and had to build the pathway around the borders of those dominions. All this is recorded and archived.</p><br/><p>\"Not only that, many nobles stood to gain lots of profit from the construction of the current highway. The construction of the current road from Delamock is recorded to cost the most in the history of the empire. It took seven years to build and the cost involved was enough to build seven similar roads. I remember back then there were even newspapers that justified the way it took by arguing that it was the best way to facilitate the transport of the food produced in the dominions of all the nobles to Delamock, the main storehouse of the empire's food. What a shameless joke.\"</p><br/><p>Lorist chuckled.</p><br/><p>\"I don't care about the things that happened in the past. Whatever the case, I want to make it clear that nobody may stop us from doing what we want in the lands we control. Oh well, the territories in Delamock will all have to be moved anyway. I expect there to be more than 100 thousand people who surrender. We'll just have them build the highway. A straight highway will save us so much time and allow us to better respond to military situations. I want this highway finished in two year's time.\"</p><br/><p>\"Your Grace,\" responded Charade as he stood up.</p><br/><p>Ever since he was made duke, his subordinates and household knights began to address him as 'Your Grace'. Only a few people still called him 'Milord Lorist'. Privately, some like Charade would call Lorist 'Locke', but in official discussions, they would still use 'Your Grace'.</p><br/><p>\"There's a piece of bad news. The house is likely to spend more than the expense stipulated in our budget. Apart from helping House Kenmays and House Shazin with their dominion's relocation, we have to begin development on the eastern Northlands and the former territory of the Shazins, as well as take charge of the move of Sidgler locals. We have to mobilize Tigersoar to deal with Queen Carey soon as well.</p><br/><p>\"And now, you've just announced you'll be building a highway from Delamock to The Northlands. Our house has already exceeded our budget by six million gold Fordes. The way I see it, development is more important than war. Your Grace, I urge you to consider the stability of the house's finances. I suggest we postpone the war against the Andinaq kingdom's current administration. Restoring the second highness's throne will set our house back one million gold Fordes, and I believe it an unwise move.\"</p><br/>\n</div>"}