{"title": "Chapter 360 Igloo", "id": 360, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-360-igloo", "volume_title": "Volume 4", "body": "<h1>Chapter 360 Igloo</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Igloo</p><br/><p>Here's the second release of the week!</p><br/><p>Tagging along behind Tarkel, Howard brought the 30 guards and Jisan and the gold eagle trainer, Morbinghan, with him. It was rather crowded around Lorist and Reidy. Seeing that Reidy was fine, Tarkel breathed a sigh of relief. He had been worried he would hear word of Reidy's demise along the way because he was the one that requested Reidy deal with the underground crime syndicates.</p><br/><p>Howard hugged his senior apprentice-brother and complained about how tough the journey had been and the interesting things they saw along the way. Els instructed the 30 guards to set up a perimeter around Lorist after removing his skis to prevent any excited Andinaq soldiers clamoring down the hill from running into Lorist and the second highness.</p><br/><p>The second highness had already dismounted and was coming over with a soldier. He analyzed the skis and their poles as he approached. After taking a good look at the whole thing, he put the skis down and stepped on the ski binding. Poles in hand, he gave it a small push… and fell.</p><br/><p>Lorist struggled to resist the urge to laugh as he helped the second highness up.</p><br/><p>\"Your Majesty, this is called a ski. It's used to travel on snow. You have to have adequate training before you can master skiing. Nobody can learn how to ski just by watching someone do it once, especially considering you have to learn to balance on them. If Your Majesty doesn't mind learning from me, I wouldn't be averse to teaching you in my free time.\"</p><br/><p>Not only did the second highness not get angry or embarrassed, he held Lorist's hand and praised him instead.</p><br/><p>\"Brother Locke, your house's new contraption is truly amazing! This is amazing for winter warfare! If a whole legion were trained to use skis, we could cover a lot of ground with good snow coverage and even circle around our enemy's forces! We'll have a definite advantage if we can access and attack the enemy's vulnerable rear!\"</p><br/><p>As expected of the second highness -- who shot to fame after a battle that took place during winter. The first thing he thought of was military utility.</p><br/><p>Lorist shook his head.</p><br/><p>\"Your Majesty, this is included in the standard winter loadout for our soldiers. While up to a hundred people can move together effectively like this in the winter, even faster than horses, I'm afraid I can't use them offensively on the scale of a division, not speak of a whole legion. It's no easy task.\"</p><br/><p>The second highness quickly understood Lorist's meaning. The winter loadout for around a hundred scouts already cost quite a bit. Just looking at the equipment and fur mantles, which were all made of magic beast fur, it could be seen how expensive it was. While Lorist could afford to spend a little more to increase the efficacy of his guards in the winter, supplying a whole legion with such high-quality magic beast fur was a ridiculous expenditure. Perhaps all the other equipment in their loadout combined couldn't even match the fur clothing's cost.</p><br/><p>\"You're talking about this, right?\" asked the second highness, pointing at the guards' clothes.</p><br/><p>Lorist nodded.</p><br/><p>\"Your Majesty, skiing and marching in snow are different. While marching is rather tiring, your body moves constantly and generates a comfortable amount of heat. Skiing, in contrast, makes you move against the wind; the cold air will quickly cut through normal clothes and freeze you. And it's just the beginning of your troubles. The other is to make sure you don't lose your way. The winter weather changes whimsically, it would be the end of you if you ran into a snowstorm.\"</p><br/><p>\"But didn't you guys make it here safely?\" the second highness countered with dissatisfaction, \"The last couple of days' weather wasn't that good either.\"</p><br/><p>Lorist sighed, turned around and pointed at Morbinham.</p><br/><p>\"That's because we had him, Your Majesty.\"</p><br/><p>Morbinghan took out a jade-colored bone whistle and blew it. A loud high-pitched sound rang out, much to the second highness's surprise. The gold eagle circling around the area flew down and perched on Morbinghan's right arm. He stroked its feathers lovingly and brought out a piece of beef warmed by his body heat and fed it to the eagle.</p><br/><p>\"Is... Is this the gold eagle you brought with you?\" the second highness asked, flabbergasted, \"Did you rely on it to find us?\"</p><br/><p>\"Indeed, Your Majesty. This gold eagle is a precious son to Morbinghan. They've lived together for more than a decade. It only listens Morbinghan. When I received word that Reidy was being pursued and had escaped to Egret Basin, I had Morbinghan instruct his eagle to find a place where many people were gathered. Had it not been for the eagle, we would have been searching for a needle in a haystack. We would have had to wish on luck to help us find you,\" explained Lorist briefly.</p><br/><p>The second highness was no fool, he knew he shouldn't desire the gold eagle after hearing Lorist's words. He looked at the eagle with a slight blush of shame and a hint of regret.</p><br/><p>\"No wonder you were able to find us so quickly. So it was thanks to the gold eagle's help. I never thought they could be used like this. I only considered them pets that brought entertainment to nobles. If only I could train them to scout… A single eagle could stand in for a scout squad of 100 men.\"</p><br/><p>\"Your Majesty's idea sounds magnificent,\" Lorist laughed, \"I should go back and experiment. I'd like to see if I could train a few eagles as scouts. Our soldiers wouldn't have worry about falling into a trap or ambush.\"</p><br/><p>At that moment, Ripleid returned with some toxin and fed it to the messy-haired Xanthi, who had just regained consciousness. She obediently drank it as she stared hatefully at Lorist. She didn't bother to hide her seething enmity.</p><br/><p>Seeing her taken away, the second highness asked, \"Locke, let's head to the camp first. When are you preparing to return?\"</p><br/><p>Lorist looked at the skies and saw the weak sunlight blocked by the many clouds.</p><br/><p>\"A snowstorm is coming. We'll rest at Your Majesty's camp for a few days. My guards could really use the rest. They've been running all around the basin with me. I'll teach you to ski so you can start practicing soon and master it quickly while we rest.\"</p><br/><p>Upon reaching the campsite, Lorist looked at the tents, dumbfounded.</p><br/><p>\"Your Majesty, are you letting your soldiers stay in those in this weather?\"</p><br/><p>\"Yes,\" the second highness said a little proudly, \"Even though the cloth is thin, it's actually made of double-layered linen and given an oil coating. This is more than enough cover against snow and rain. When the snow melts, the water won't soak it either.</p><br/><p>\"Your Majesty, a storm is coming and snow will pile up quickly. Many soldiers will get frostbite from the cold,\" said Lorist without hesitation.</p><br/><p>\"Well, that was the case a few years ago. However, we've made some changes over the years as well. We assigned them gloves and extra clothing, so the number of injured should be relatively low. Also, we brought a lot of frostbite medication with us,\" argued he.</p><br/><p>\"This is what we call 'building a carriage with its doors closed'. You should've asked if you had anything you didn't understand. Els, build an igloo outside the camp, you have an hour. Show the second highness the right way to camp in winter,\" instructed Lorist.</p><br/><p>The poor Els had to get straight to work right after putting his heavy bag down. He didn't get any rest. But when he saw the tents, he knew it would already be lucky if anyone managed to get any sleep in the night, given that one could survive it and not freeze, that is.</p><br/><p>With a beckon, 20 guards came over to help him. Within an hour, a squarish igloo was built in front of the second highness. Its design was really simple. It started with the laying of wooden blocks to use as a base. Snow as watered next to solidify it into bricks. The bricks were then stacked and the gaps between each watered lightly. The liquid was allowed to freeze before the next placed on top. The only hard part was the construction of the roof. First, a few wooden beams were laid over the walls from one edge to the other and watered lightly so the ice would hold them in place. Finally, the whole igloo was watered from top to bottom to secure it to the ground so even the largest storms wouldn't shake it. Els also set up a tent behind the igloo.</p><br/><p>\"The tent is there to prevent the cold from harming our bodies. You can light a brazier inside. While the outside is freezing, the igloo is actually rather warm. Els will have to make some holes for ventilation. The igloo doesn't have any doors, instead, we use a fur flap to keep the wind out,\"</p><br/><p>\"Locke, my brother, how do you come out with all these great ideas?\" the second highness asked.</p><br/><p>\"This discovery isn't mine to claim, Your Majesty,\" Lorist smiled, \"It was the great adventurer, Carmen Pride, who lived around a century ago, that discovered this method. I bought his autobiography when I studied at Dawn Academy and this method was recorded in it. You should know I had to deal with the magic beast wave every winter in the wildlands ever since my return to the dominion, right? Had it not been for these igloos, we'd have lost too many men to the cold, we wouldn't have been able to take out the magic beast wave.\"</p><br/><p>\"Even though you weren't the one who invented this, it was you who actually put what you learned into practice,\" the second highness continued his praise, \"If it were that easy, why hasn't anyone heard of this method before and tried it out? Being able to apply what you learn gives you the most credit, my dear Duke of The Northlands.\"</p><br/><p>\"You speak too highly of me, Your Majesty. It's still only afternoon, we have some time to build a couple more. It would help if we could use a few of your soldiers.\"</p><br/><p>\"Very well. Ripleid!\" called the second highness.</p><br/><p>And so, Ripleid was made the chief supervisor of the igloo construction project to aid Els with the restructuring of the campsite.</p><br/><p>The evening's banquet was held in the largest one. The second highness was elated as Lorist's arrival spared him the fate of being taken prisoner. Instead, the tables turned on the enemy and he even managed to capture a blademaster. A few might have escaped without him noticing, but he didn't care. Leaving for the wilds in such heavy snow was suicidal, to say the least.</p><br/><p>Lorist left all the captives to the second highness. He couldn't be bothered to bring the thousands back. He had spent quite a number of days searching for his apprentice, in just a couple more days it would be the 24th day of the 12th month. The return trip to Firmrock would take 15 days and Lorist had to rush because he wanted to make it to the new year's celebration where other nobles and his vassals were awaiting his participation. Fortunately, he didn't have to circle around Egret Basin anymore, he could just use the main path at Egret Lake. It should take just around ten days to travel to Firmrock Castle on skis without taking any useless turns.</p><br/><p>Outside, the storm blew strong. But the candles in the igloo merely flickered, keeping the ones making merry within warm and lit.</p><br/><p>Blademaster Manst respectfully toasted Loris.</p><br/><p>\"Your Grace, do you think Blademaster Xanthi has broken through to the third rank?\"</p><br/><p>Lorist knew the reason Manst came over to ask that question and nodded. \"That's correct. When I fought her years ago, she was still only a rank 2. Even though I managed to defeat her back then, I fainted from physical and mental exhaustion and only woke up after three days of rest. In my duel with her today, her attacks seemed even more ferocious than before, which led me to that conclusion.</p><br/><p>\"I understand what you're trying to say. You're thinking that Blademaster Xanthi is a little undeserving to be called a rank 3, right? If she really were a rank 3 blademaster, she should've been able to easily kill you instead of having a few of her strikes blocked by you during your fight at the campsite yesterday.</p><br/><p>\"I believe you interpreted the situation a little wrong. First, the attack during the night was a surprise attack, and Xanthi used mainly hit-and-run tactics while you focused on defending the second highness with the best of your ability. As Xanthi couldn't afford to clash with you and get entangled in a fight, she instantly stepped back after testing your defense out. Another factor is not the power of her attacks, but rather your advantage in terms of elemental attribute. Your battleforce attribute is earth, right?\"</p><br/><p>Blademaster Manst nodded.</p><br/><p>Lorist continued his explanation, \"Xanti's battleforce attribute is wind, so her sword style using light, swift and agile movements. Yours is the complete opposite. You express your swordsmanship through heavy, accurate and powerful strikes. Even though she trumps you in terms of rank, if you defend with all your abilities, even she wouldn't be able to get the better of you. If there were no other soldiers pressuring Xanthi to escape, you would've lost in around a hundred strikes. Also, what do you think of Reidy's swordsmanship?\"</p><br/><p>Manst gave it some thought and said, \"Even I wasn't as good as him when I was his age. His swordsmanship is impeccable and he excels in both offense and defense.\"</p><br/><p>Lorist laughed and said, \"But even he got injured by Xanthi during their clashes because his battleforce attribute is metal, an element that considers the best defense to be offense. That's the reason he was easily crushed by Xanthi from being unable to block those formless strikes like the wind.\"</p><br/><p>Manst mused in deep thought, \"Oh, so that's the case. Thank you, Your Grace, for your insight on the matter.\"</p><br/><p>Raising his own golden cup for a toast, Lorist said, \"You're welcome. Let's drink to this.\"</p><br/><p>Wiping the sweat from his forehead, Lorist thought, you really believe what I made up just like that? You didn't even consider the fact that Reidy no longer trains in battleforce. How would he even have battleforce attribute?</p><br/>\n</div>"}