{"title": "Chapter 363 Banquet and Entitlement", "id": 363, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-363-banquet-and-entitlement", "volume_title": "Volume 4", "body": "<h1>Chapter 363 Banquet and Entitlement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Banquet and Entitlement</p><br/><p>Enjoy the fifth release of the week! There's something big happening on Monday, so look forward to it!</p><br/><p>The common Grindian calendar had 12 months and it contained the good elements from the magi's calendar and the fairy calendar for practical purposes. Each month of the common calendar had 35 days. The 5th, 9th and 12th months each had an extra day, not noted on the calendar.</p><br/><p>These three days were publicly acknowledged by all of Grindia as Bathing Day, Harvest Day and New Year's.</p><br/><p>As Lorist had promised, Viscount Eidis, Viscount Zinderson, Baron Klaus, and Baron Wade -- nobles who used to belong to the peerage of Iblia -- were all taken in as vassals. It was rather troublesome Charade. Not only did he have to confirm their new territory, he also had to organize the formal enfeoffment ceremony during the new year's celebration. He was so busy he didn't have time to attend Lorist's reception of Duke Kenmays, Count Felim, and Count Shazin. When Howard came to ask him to attend, he said he was far too busy and merely asked some food be sent over.</p><br/><p>It wasn't until the late morning of the 36th day of the 12th month that Charade finished his work. Lying on the couch tiredly and looking at Lorist looking the documents over, he mused that he'd definitely resign if there was another similar incident. He was more than fed up with Lorist's whimsical decisions that made him work overtime all too often.</p><br/><p>Lorist smiled and reminded Charade that the new year's celebration would commence at seven so they had more time. Charade ought to go back home for a few hours and rest before washing up and preparing to attend the banquet. Since Charade was one of the nobles formally entitled during the celebration, he reasoned he wouldn't want to look too haggard during the party.</p><br/><p>Charade got up and ran out. His voice drifted into the office from the hallway.</p><br/><p>\"That's right, I've finished my work. Why am I still here? I'll go back home now.\"</p><br/><p>Lorist smiled.</p><br/><p>\"And there he was complaining how harsh the work I gave him was. Yet, he's running out so quickly in such an energetic manner,\" commented Lorist to Howard.</p><br/><p>Firmrock Castle was decorated all over that day and the central part of the castle was been cleaned up rather well. On both sides of the streets hung flags of varying colors and the weather also seemed excellent. Not only was there no snow, the sky was bright and blue with the crescent Silvermoon hanging brightly above as well.</p><br/><p>\"If it weren't this cold, the day would be perfect,\" said Duke Kenmays.</p><br/><p>He was standing with Lorist, Felim, and Shazin on the veranda on the castle's top floor, looking at the distant carriages approaching the center. Behind the four nobles were Howard and his fiancée, Katrina, Felim's beloved daughter. They were both talking quietly in a corner wearing sweet smiles.</p><br/><p>Kenmays had already changed his dominion to Sidgler and had taken everything with him. At the same time, the five nobles' territory he occupied had also been handed to House Norton. Having nothing better to do, he came over to enjoy the festivities and dragged Felim and Shazin along to become the entitlement ceremony's witnesses.</p><br/><p>\"If you ask me, Firmrock Castle is far too small. It doesn't fit your status as a duke. It was designed to be a citadel, so it's a little too small to be The Northlands' base of operations,\" commented he.</p><br/><p>Lorist nodded.</p><br/><p>\"That's true. Come spring, I will move to Gildusk. It's a convenient place from which to oversee the war soon to take place in Winston and Southern. Baron Charade has already instructed Grandmaster Ciroba to begin redeveloping the city and the southern part of The Northlands, but Grandmaster Ciroba made a rather problematic request.\"</p><br/><p>\"Oh? What is it?\" asked the three nobles curiously.</p><br/><p>They all knew Ciroba was the house's chief architect. Almost all the developmental projects had to go through him before making it to Lorist's desk.</p><br/><p>\"Well, he said the name of Gildusk came from the two artists cum architects that designed the city, Gil and Dusk. He feels he's even more amazing than them and wants the reconstructed city to be named after him. Otherwise, he wouldn't involve himself. Tell me, doesn't Ciroba sound really weird to you?\" asked Lorist with a furrowed brow.</p><br/><p>Ciroba's weird inclination to name every project after himself was indeed rather troubling.</p><br/><p>\"Hahahaha...\"</p><br/><p>\"Well, Locke. just tell the grandmaster I will construct my household castle when I return to Southern. If he's willing to come help out, I'll let him name the castle,\" said Felim.</p><br/><p>\"Are you crazy?\" Kenmays rolled his eyes, \"Last time you mentioned wanting to name your castle Pegasus Castle since that was also what your ancestors' first castle was called before it was destroyed by Krissen IV in the War of the New Moon. Now that House Felim is finally returning to its original domain, would it be appropriate for your new castle to be named Ciroba Castle instead? You're right, it does sound rather weird and hard to pronounce.\"</p><br/><p>\"Haha, I'll definitely have the castle's name engraved in the smallest form possible and display a huge statue of the Pegasus on our walls. That way, everyone will come to call it Pegasus Castle instead of paying attention to the inscribed name,\" Felim said with a confident smile, \"Do you think I'd be that stupid?\"</p><br/><p>Kenmays gasped.</p><br/><p>\"You... Isn't that cheating?\"</p><br/><p>\"What? I will inscribe his name on the castle for real. If others can't see it properly, it's their eyes' fault, not mine. House Felim doesn't pull tricks like that, alright?\" argued Felim.</p><br/><p>\"Alright, there's no need to overthink this. I'll have Grandmaster Ciroba design a new castle for you. I believe he'll be more than interested in redesigning such a well-known castle without having to name it after him. All you have to do is dedicate a statue to him,\" interjected Lorist with a smile.</p><br/><p>\"Locke, the number of people here is increasing. Look, it's filled with carriages. It's finally time to receive the guests. How many years has it been since I attended something like this? The last time was before the second prince was defeated.\" asked Kenmays as he turned to the plaza.</p><br/><p>\"If you like parties so much, why didn't you just host your own banquet? You're also a duke. You're more than qualified to host a banquet. Don't tell me House Kenmays doesn't even have enough money for a simple banquet!\" said Lorist with a laugh.</p><br/><p>Kenmays sighed.</p><br/><p>\"Talking to a banquet idiot like you is really off-putting. Don't you know the most important thing of a banquet or social event is the attendees? The more the merrier! What good would a banquet do if I hardly have any household knights or vassals? There's no point hosting one just for my house!\"</p><br/><p>\"You could promote a few knights. It's not like there's anyone to stop you.\"</p><br/><p>\"They aren't qualified yet. Their contributions are still lacking. Additionally, my father said it was thanks to House Norton and luck that House Kenmays managed to make it this far. All we should do is mind our own business and pay attention to our dominion since the external affairs of our alliance are all dealt with by you. We only have to fulfill our duties as your allies and will be compensated in kind.\"</p><br/><p>\"I really have to say, your father is a cunning man. Not only is he using us as his shield, he even gets to taste some leftover blood,\" praised Lorist.</p><br/><p>\"It's to be expected. Who asked House Norton to be the strongest? If there's anyone that has to take hits for us, it's you! Don't the rest of you agree?\" asked Kenmays, confiding in his comrades.</p><br/><p>Felim and Shazin both laughed. Without Lorist, there wouldn't be the alliance. Neither would their houses have been able to soar to such heights and even solidify their titles among their peers. Kenmays' words rang true in that Lorist was indeed their leader that had to take care of his subordinates.</p><br/><p>\"Well, it's about time. Should we head down now?\" asked Shazin after taking another look at the carriages.</p><br/><p>\"Alright. Let's get going. Best not let your ladies wait,\" agreed Lorist.</p><br/><p>He was chaperoned by Telesti of Nico Academy. She brought her two daughters along. The moment they met, Lorist was shocked to see how slender Telesti had become. After asking about it, he learned that she was stressed from having to take care of the academy and her two daughters. Losing sleep was something she had to deal with on a regular basis.</p><br/><p>\"Locke, had it not been for the fact that today was also an entitlement ceremony, I wouldn't have left the academy. My schedule is really far too tight, there's too much I have to do. Stop advising me to stop. This is a choice I made for myself,\" said Telesti.</p><br/><p>Lorist sighed deeply and gave her a hug.</p><br/><p>\"My dear, the sea of knowledge is vast and endless. Even a sailor has to rest and recuperate once in a while.\"</p><br/><p>Kenmays' chaperone was a voluptuous noble lady -- the widow of some count long passed away.</p><br/><p>Felim's chaperone was his beloved daughter Katrina.</p><br/><p>Shazin came with his concubine, Kenmays' cousin, as his chaperone. It seemed the beauty from House Kenmays stood a chance of being made the matron of his house.</p><br/><p>Lorist led the group with Telesti at the front. Applause and cheers thundered in the hall as the group entered.</p><br/><p>The banquet's organizer, Charade, represented the house in the welcome speech. Lorist gave a light-hearted speech that basically outlined the plans for the next year, and stated that House Norton was confident their might and courage would bring them all to victory in the upcoming conflicts. Their allies' trust was thus, of course, not for naught.</p><br/><p>\"What on earth did you have me read?\" Lorist complained afterward, \"This isn't like me at all. Do you have any idea how embarrassed I was up there?\"</p><br/><p>\"I worked on this all night, I didn't even sleep,\" Charade rolled his eyes, \"Besides, you checked the speech yourself this morning. You should have complained then.\"</p><br/><p>\"Sol,\" Lorist gasped as he wiped the sweat from his forehead, \"I didn't think you would write something like this so I didn't remember to check. Nobody reminded me either...\"</p><br/><p>\"Whatever,\" Charade shrugged, \"It's not like they were all paying attention anyway. It's mostly just formalities. What they're anticipating is the entitlement ceremony so there's no point complaining about the speech now.\"</p><br/><p>The entitlement ceremony soon began. First was the re-entitlement, or demotion, of the 17 nobles relocated to Delamock. Thereafter the five Northland nobles House Kenmays kept followed suit. Next came the two Madras nobles whose beauties had pleased Lorist and managed to save their houses by becoming vassals. Finally, it was Viscount Eidis and the other four who joined the faction at the last moment's turn. They used to be Iblian nobles, but now they were Lorist's vassals. The last one to be entitled was Baron Dina, whose title was given to Lorist's lover, Dina Arriotoli temporarily until her younger brother matured.</p><br/><p>The ceremony was simple. Charade announced the names and rank of the house to summon the nobles. They would go up the stage and salute. They received the silver tray Howard brought over containing the deeds of entitlement and the deeds to their land, as well as a decree signed personally by Lorist along with their identification badge which bore the insignias of the respective houses.</p><br/><p>Lorist remained seated on his throne. His right hand held a sword and his left hand was outstretched. The pose was one a liege assumed when accepting a vassal's pledge of allegiance. The left hand represented grace and acceptance, while the sword symbolized caution and might. Each noble would receive the silver tray and pledge their allegiance by kissing the back of Lorist's left hand, before bowing and leaving. After the vassals were entitled it was the turn of the 14 new houses.</p><br/><p>The two grandmasters, Sid and Fellin, were up first. They received their certificates with teary eyes and prostrated in front of Lorist during their pledge of allegiance on behalf of their future descendants. Lorist expended quite some effort to get them to stand up and regretted giving them a rank so high it might've taxed their hearts a little too much with excitement.</p><br/><p>Potterfang and Loze's entitlement went off without a hitch. But Charade's entitlement caused a small commotion when his father fainted from sheer excitement, much to Charade's embarrassment.</p><br/><p>After the 14 nobles were entitled it was the honorary nobles' turn. Apart from Hanayabarta's Governor Hector -- who was absent -- the other five were present for the ceremony.</p><br/><p>The ceremony wasn't enjoyed by everyone, however. More than 30 nobles of the Madras duchy had been stripped of their dominions. Only after House Norton eliminated the Iblia kingdom and conquered Winston would they be enfeoffed. These nobles were in a similar situation to many of the original Northlander nobles and had no choice but to patiently wait in The Northlands.</p><br/><p>Apart from them, and the household knights and high-ranking household officials, there were some other people of relatively higher status given honorary titles. They were the rich factory owners and merchants who operated within the dominion. However, they were considered nobility among The Northlands because of their honorary titles and status. Even Lorist didn't think The Northlands would have so many honorary nobles. A large majority were those who escaped from the smaller duchies eliminated by the Union.</p><br/><p>While House Norton could ignore and not acknowledge the honorary titles graced upon them by others, it wasn't that they could outright revoke the titles since they were qualified to attend the social gatherings of nobility. Since they all received invitations, they had to contribute to the banquet as well by becoming event sponsors.</p><br/><p>Kenmays was the one most familiar with the honorary nobles. It was apparent that he enjoyed the night greatly from how well he blended in with the ladies among them.</p><br/><p>After seeing the worn-out Telesti, Lorist said with concern, \"Let's go, my dear. I'll take you to rest. You seem exhausted.\"</p><br/>\n</div>"}