{"title": "Chapter 377 Boblige Mountain Range", "id": 377, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-377-boblige-mountain-range", "volume_title": "Volume 4", "body": "<h1>Chapter 377 Boblige Mountain Range</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Boblige Mountain Range</p><br/><p>Here's the fourth release of the week, albeit a little late. Enjoy!</p><br/><p>Lorist thought Duke Fisablen had no option but to withdraw his army. After all, the border between Southern and Eastwild was not far past the camp being burnt down, he was not rushing in the slightest. He had his scouts go ahead to find out where Fisablen's forces had gone while he allowed the rest of his forces to prepare to pack up and leave in another two days.</p><br/><p>Maybe I should even send troops straight into Eastwild while I'm at it, all the way to House Fisablen's headquarters. I wonder if Old Fisablen will finally face me or lower his proud head in submission if I really razed his precious castle?</p><br/><p>Just as he was lost in his thoughts, a scout came returned.</p><br/><p>\"Lord Duke, House Fisablen's forces didn't retreat to Eastwild. They set up camp at the Boblige mountain range in the south of Southern instead.\"</p><br/><p>\"What?\"</p><br/><p>This surprised Lorist greatly. The name sounded rather familiar.</p><br/><p>\"Map.\"</p><br/><p>Howard quickly opened the map of Southern and laid it on the table. Lorist took a look. Indeed, his doubts were answered. In his original plan, after chasing the Fisablens out of Southern, he'd have set up a defense line along the border of Southern and Eastwild. Part of the plan involved building a citadel at the Boblige mountain range, which would serve as the defense headquarters and seal off the border.</p><br/><p>The border between Southern and Eastwild was not only long, it's terrain was also really flat; the grassland barbarians had mainly relied on the route from Southern to the inner lands of Eastwild to conduct their raids. Count Felim's ancestors used to reside in Southern, they had learned the advantages of the barbarians' ways and formed a famous light cavalry legion like Pegasus.</p><br/><p>The border was also what separated the grasslands and the hilled area. While the lands were relatively flat, there wasn't a shortage in lakes. Lorist had intended to capitalize on the natural terrain by erecting five citadels as the center of defense to support towers which would be connected by trenches and set up a spider-web-like net as a defense to seal House Fisablen's off from the outside world. It would prevent the frontier legions from launching hit-and-run attacks against his forces stationed in Southern.</p><br/><p>What does the old fellow intend by bringing his forces into the Boblige mountain range? Why didn't he retreat to Eastwild? It's his dominion, his playing field. The lands are wide and flat, perfect for the tactics the frontier legions use. House Fisablen would be like a fish in water. It seems the duke isn't aware of this? He's even left the way to Crouchtiger Castle wide open. What does he intend by stationing his troops there? Isn't he worried I would send my catapults to destroy his new camp?</p><br/><p>After staring at the map for a good amount of time, Lorist still couldn't figure out the duke's intentions. However, it seemed he had no intention of returning to his dominion.</p><br/><p>Perhaps he's venting? If he can't defeat me, he wants to piss me off just because he can by leaving 80 thousand troops in my yard so my rear is constantly under threat? I would have to delegate a number of troops to watch him. It would limit my moves.</p><br/><p>After scanning the area around the Boblige mountain range, Lorist realized he would have to control three points around the mountains to be able to effectively keep Fisablen's forces quarantined. It would require he build a citadel and station at least 60 thousand people.</p><br/><p>Sol, this old man is trying to spread my forces thin, cursed Lorist hatefully.</p><br/><p>He was starting to understand why Duke Fisablen had done what he did. If he left the route into Eastwild undefended by stationing the troops at the Boblige mountain range instead, Lorist couldn't afford to leave them unattended. If he intended to attack Crouchtiger Castle, there was a chance Duke Fisablen could interfere. The consequences could range from having his supply line disrupted to causing chaos in the entire Southern.</p><br/><p>There were only two ways to keep them in check. The first was to deploy troops to defeat them and chase them out of the mountain range. The other was to station troops to guard a few vital transportation routes and build temporary forts, which was both costly and time-consuming. Stationing 20 thousand people to guard one spot was only good for defense and not for offense. After all, House Fisablen's forces numbered 80 thousand. Just like a fist, they could be flung wherever they wished. Defending three locations by stationing each with 20 thousand men to control the situation in the mountain range effectively took 60 thousand men off Lorist's roster. The move also prevented him from taking the initiative and attacking as the enemy's numbers were quadruple that of the troops stationed at each location.</p><br/><p>Even though it was only a small part of Southern, the mountain range was a range that could be reached from quite a number of paths from both Southern and Eastwild. Many roads crossed it. By occupying it, House Fisablen's frontier legions could leave Southern and retreat to Eastwild any time he wished. It was a place easy to defend and convenient to use to launch attacks.</p><br/><p>I have to take the mountain range and chase House Fisablen out of Southern, thought Lorist resolutely as he decided to make a trip to check the mountains out for himself.</p><br/><p>Duke Fisablen knows I have the advantage of catapults and steel ballistae. Why did he choose to occupy the range? Where did he find such confidence?</p><br/><p>Lorist couldn't calm down until he surveyed the mountains with his own eyes.</p><br/><p>He left for Boblige mountain range with only Reidy, Howard, Els, and a thousand of his personal guards with the light cavalry scouts as his guide in spite of his household knights' objection. The moment he saw the mountains, he understood why the duke had chosen to occupy the location.</p><br/><p>Unlike other mountains, the mountain range's outer area was surrounded by cliffs at least 40 to 50 meters in height. The routes to the central part of the range were either valleys or sides of a cliff. The scouts caught an old bandit who gave them a brief introduction to the range. According to him, the slopes leading up to the top of the cliffs were only accessible from the inner part of the range. It was the opposite of most other mountains. However, this mountain range was a one which sloped upwards from the inside. It was a citadel formed by nature itself.</p><br/><p>The old bandit also said there were originally six bandits who each set up their own strongholds in the mountains. Each housed a few thousand men. But last year, Third Frontier came over on the duke's order to have the bandits surrender. They launched a sudden attack in the midst of negotiations instead and managed to conquer all the strongholds before moving all the youths to Eastwild, supposedly to mine gold.</p><br/><p>Given the bandit's age and bad leg, Third Frontier's troops spared him. He now lived in a small hut at the foot of the mountains. He farmed a small plot of land for a living. Before he had time enjoyed his freedom for long, he was captured by a different group of soldiers.</p><br/><p>Given that the bandit had lived all his life in the mountain range, he was really familiar with the terrain and routes. He told Lorist that, while its cliffs sealed it off from the outside world, there was a nice valley, forest, and even a stream within. It was a wide and scenic location. Apart from the three routes that led into the mountains, there was no other way to enter the range.</p><br/><p>\"Milord, while it might seem like there are a lot of small paths you can use along the cliffs, they all lead to dead ends. You won't know it until after half a day of travel. Basically, roads where there is thick grass are all dead ends. The other paths meet up at this main route over here, which is the same one that stretches into the mountain range. The other two routes are roughly 25 kilometers to the south. The other is roughly 2 kilometers to the west.\"</p><br/><p>As the old bandit didn't know who Lorist was, he went with 'Milord' to be safe.</p><br/><p>\"Is the terrain around the two other roads like this as well?\" asked Lorist while he pointed at the cliff.</p><br/><p>\"They're all like that, Milord. The mountain range is rather weird. The outer region is mostly like that, whether it be the end near Southern or Eastwild. Legend goes that its name actually means 'giant's stronghold. It really does seem like a gigantic stronghold,\" replied the old bandit confidently before he snuck in the little factoid about mountain range's name.</p><br/><p>The problem now was that Duke Fisablen had occupied the gigantic stronghold with a force of 80 thousand. Taking the mountains would require forces were sent in from three paths towards the main peak. Lorist didn't think Duke Fisablen would give him that chance. According to the old bandit, it would take about half a day to reach the center along any of the three paths. All Fisablen's forces had to do was roll a few large boulders from higher ground to bring about a tragedy for those attempting to invade.</p><br/><p>He brought out his simple telescope and inspected the tallest peak. A Fisablen banner fluttered in the wind on the edge of a cliff along the way there. It was apparent attacking via this particular path wasn't an option. The enemy had also built fortifications along the way. Though they were only rock and wood, they put great pressure on him.</p><br/><p>The bastard really picked a good place. This range renders two of our most advanced weapons useless.</p><br/><p>Lorist believed Thunderbolt Brigade's catapults couldn't lob their stones over the 50-meter-tall cliffs. As for the steel ballistae, firing at an angle couldn't achieve any results either. With the enemy hiding beyond the cliffs, the catapults and ballistae weren't a threat.</p><br/><p>If there was no way to attack, he had to consider how to defend. After much thought, the only reliable solution he could come up with was to construct three forts, one at each of the paths into the mountain range. He was really bitter about it. Constructing three forts handed the initiative to the enemy. The project would consume lots of funds. Following their completion, each fort would also have to be manned by 20 thousand soldiers. In other words, 60 thousand of his troops would be held back just to defend against the enemy here. On the other hand, if Boblige mountain range was under his control, he only needed 20 thousand men to secure the border.</p><br/><p>He continued to scan one peak after another using his telescope.</p><br/><p>Oh? What are those soldiers doing?</p><br/><p>It took quite a while to understand that House FIsablen's soldiers were setting up a suspension bridge that connected the two cliffs. It would allow them to move their forces around much faster. The duke soon emerged. It was indeed the duke. His face was clearly visible through the telescope's small lens. The old man seemed to have aged quite a bit and no longer looked as domineering as he had in the past. Nevertheless, he still oozed pride. He must be monitoring the soldiers constructing the suspension bridge. Lorist only got such a clear look because the duke faced him directly. The old man must've realized Lorist's forces had arrived and was checking them out.</p><br/><p>Lorist and Duke Fisablen were looking at each other from a distance of about 500 meters. However, Lorist could see better with his telescope while it took quite a while for the duke to realize the one standing at the foot of the mountain was Lorist. His expression tensed as he said something. Lorist felt they must've been curses directed at him.</p><br/><p>It didn't take long for the low sound of a horn to echo down the valley between the cliffs.</p><br/><p>\"The old man actually deployed his troops?\"</p><br/><p>Not long after, hordes of grassland barbarian cavalry gushed out of the route leading into the mountain.</p><br/><p>\"Good Sol! This bastard's far too shameless! He actually sent his grassland barbarian cavalry to apprehend me,\" cursed Lorist.</p><br/><p>He felt completely humiliated. Even though he had managed to chase a rank 3 blademaster like the duke away, the duke actually thought grassland barbarians were enough to apprehend him. It was clearly an act of mockery.</p><br/><p>\"Your Grace, we ought to leave.\"</p><br/><p>Els didn't hold the same opinion. Thirty of the duke's 80 thousand men were grassland barbarian cavalry. The rest were the remnants of Third and Fifth Frontier. As Lorist only brought around a thousand guards to check out the mountain range, Els didn't dare to be careless. After all, even elephants could be bitten to death by swarms of ants.</p><br/><p>\"Alright. Let's retreat. Bring the old bandit along. He's a living map and will be useful,\" Lorist ordered as he turned his horse.</p><br/><p>Either the barbarians were bored to death staying in the mountain range or Duke Fisablen had placed a ridiculous bounty on his head. The barbarian cavalrymen numbered close to ten thousand and showed no sign of giving up the pursuit. Frustrated, Lorist ordered Howard to head back and make a report with a few other guards while he brought the rest up a small hill to take a defensive position. After battling on the hill for more than two hours, the barbarian cavalry didn't manage to bring anything back. Instead, they left behind more than two thousand corpses.</p><br/><p>Lorist faced the ten thousand troops alone. He occupied the path leading up the small hill and slaughtered the barbarian soldiers till they lost every ounce of their courage. Bathed in blood, he managed to vent his frustration. It didn't take long for Pegasus to arrive and disperse the remaining enemies at the foot of the hill. They escorted him back to the camp.</p><br/><p>He changed into new armor after he'd washed up and entered the tent.</p><br/><p>\"Tomorrow, we depart for Boblige mountain range. I want everyone to come up with an idea that could allow us to take the enemy camp,\" he said with a glum look to his commanders.</p><br/>\n</div>"}