{"title": "Chapter 378 Two Pieces of Bad News", "id": 378, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-378-two-pieces-of-bad-news", "volume_title": "Volume 4", "body": "<h1>Chapter 378 Two Pieces of Bad News</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Two Pieces of Bad News</p><br/><p>We're at the end of the week once more! Here's the fifth release of the week and cya guys next week!</p><br/><p>Faced with a place with such unique terrain, no one could come up with a way to attack it. Lorist was prepared to gather the house's skilled fighters and launch a swift attack in the night while Fisablen's men were off guard. He wanted to bust through the defenses along the path between the cliffs and kill all the forces he encountered while his main force made it to the insides of the mountain. Unfortunately, the plan was objected to by his higher-ranking subordinates. None of them wanted Lorist to take such a huge risk.</p><br/><p>Putting aside the cliffs approximately 50 meters tall, which would cause everything to go south with the slightest mistake, as well as the question of whether it was even possible to scale the mountain in the dead of night, even if the group were able to get up the cliffs, how many enemies would they face? Eighty thousand! And, according to the old bandit's estimations, the household forces would take at least half a day without obstruction to travel along the paths through the cliffs into the open area deeper inside.</p><br/><p>In other words, Lorist and his group would be fighting to defend the main force for eight whole hours! It was nothing short of impossible. It was especially so since the group couldn't just hold one position. They would have to respond to the main force's progress. Also, if the group got into some trouble on the cliffs, the main force traveling below wouldn't be able to escape and would fall into enemy hands.</p><br/><p>Lorist was no superman. He understood that well. Even if he were a swordsaint, he would be pushed back when faced with a ten-thousand-strong elite troop. No matter how strong a swordsaint was, he would at most be able to kill around three thousand enemies before being swarmed by the soldiers that remained. Lorist was filled with regret. At first, he had planned to make a tactical assault on Duke Fisablen's position. He wanted to bring his men up on the cliffs to cause trouble for the duke. As long as he was able to capture or subdue the man, perhaps the 80 thousand soldiers would surrender obediently.</p><br/><p>Naturally, it was just his fantasy. Given Duke Fisablen's personality, even if he fell into Lorist's hands, he would struggle like a dying fish and might even order his troops to fight to their deaths. There was no way they would meet his terms. The moment the duke realizes Lorist was on the cliff, he would not hesitate to order his troops to attack.</p><br/><p>Potterfang made a rather sensible argument: when it came to numbers and household might, the Nortons were superior. No matter how long it took, he was confident they could defend against Duke Fisablen's assaults. Other things aside, holding out for a year was something the four houses could do incredibly easily. House Fisablen, on the other hand. would be on the edge of collapse because of their lack of resources. After all, sustaining a force of 80 thousand wasn't easy.</p><br/><p>So far, Southern was basically in the four houses' hands. Having successfully cut the trade route between the Fisablen dominion and the four central duchies off, even if the 80 thousand troops occupied Boblige mountain range, there wasn't much they could do. The general situation was already set in stone. The most they could do was struggle to their deaths. Even if House Norton couldn't attack Eastwild, all they had to do was form a strong defenses at the mountain range. The more time passed, the more resources House Fisablen would consume, and the sooner their defeat would come.</p><br/><p>Despite that, Lorist was still rather unwilling to accept this state of affairs. While Potterfang made it sound really easy, House Fisablen's occupation of the mountain range bogged down a substantial number of the houses' soldiers. In their original plan, they would have chased House Fisablen's forces out of Southern and built forts at the border between Southern and Eastwild. All Lorist had to do was let Firmrock guard the border with House Felim's Pegasus' support.</p><br/><p>The current situation forced him to station the four houses' forces here instead. And not just the same amount he had planned for originally, nearly double! This meant he had no troops to keep in reserve. Even though the house was rich in resources, it would still cost quite a bit to keep House Fisablen's forces cornered and he didn't doubt that Baron Spiel, the one in charge of the house's finances, would come see him not long after he heard about the plan.</p><br/><p>While he was rather troubled, a place like Boblige mountain range was not a place the household forces could attack. Doing so was nothing short of suicide. The old duke had found a great spot Lorist could do nothing about. After some thought, he ended up going with Potterfang's suggestion. First, they would set up proper defensive fortifications and drag the situation out. The one that gave out first would be House Fisablen.</p><br/><p>Lorist left the assignment to Potterfang and Firmrock. He ordered House Felim's Pegasus to aid them. Fiercetiger Loze would lead Tigersoar and House Kenmays's heavy-armored division, and House Shazins' light cavalry division and light infantry division to the border of Southern and Eastwild and set up their defenses there.</p><br/><p>Time flowed quickly. The next three months were rather peaceful. Apart from the occasional attack by the grassland barbarian cavalry, there were no large conflicts. Even the night assaults were ended in moments. If the Fisablens saw they didn't hold any advantage, they would retreat as quickly as they attacked. It would be more appropriate to describe their attacks as harassment instead.</p><br/><p>It was already the 11th month and the weather was getting progressively colder. Lorist was curious how House Fisablen's forces intended to spend the winter given their equipment. The mountains were definitely much colder than below and the winter could freeze people to death. Lorist had inspected them closely on a few occasions and didn't discover any signs of timber felling. When he questioned the old bandit about it, he was assured there were no large caverns within the mountain range. Perhaps House Fisablen had set their camp up on the other side of the mountain.</p><br/><p>Then again, launching a surprise attack in the winter was a rather good idea. He believed House Fisablen's soldiers wouldn't stand on the cliffs like idiots when it was snowing, so their guard on the routes stretching into the insides of the mountain range might not be as well guarded. When the snow covered the mountain roads, they could use skis to launch a sudden, swift attack. The house's forces had always insisted on training in the winter after all. Perhaps they could even mount the steel ballistae on sleds and take the mountain range with only one division.</p><br/><p>The more he thought about it, the better Lorist felt about the plan. Just as he was about to gather his generals for a discussion, he saw Howard enter the tent frantically.</p><br/><p>\"Your Grace! Your Grace!\"</p><br/><p>\"Clam down. What's there to panic about? It's not like the sky's about to fall. You must always keep your calm, even when a mountain is about to collapse. Where did all your training go?\" rebuked Lorist, dissatisfied.</p><br/><p>\"No, Your Grace! Look! These are two secret reports from the dominion! It's incredibly urgent!\"</p><br/><p>Howard put the two pieces of silk cloth, thin as a moth's wing, on the table. The cloths were covered with tight rows of words and were probably delivered by the messenger eagles.</p><br/><p>Lorist took a look and felt his head blur for a moment. He read the messages and paled right away.</p><br/><p>Sol, we've been had! Fisablen, you old fox... How did you manage to spirit yourself away all of a sudden? I thought you were still in the mountain range, but you got back to Wild Husbandry?!</p><br/><p>There were two heavy attacks launched on two critical locations, yet Lorist couldn't move his troops to respond.</p><br/><p>The two silk letters brought over by Howard were fraught with bad news. The first letter reported that Jaeger had suffered heavy casualties in Wild Husbandry. Their commander, Divine Marksman Josk, and vice-commander, Yuriy, sustained heavy injuries. The third division commander, Pete, perished. The three divisions suffered more than 30 thousand casualties and Jaeger had been neutered completely. They were retreating to the eastern area of The Northlands. The huge territory they occupied in the province had been completely reclaimed by House Fisablen. Had it not been for the seventh local defense brigade that guarded the iron suspension bridge with their steel ballistae, the bridge might've been destroyed as well.</p><br/><p>The letter cited the reason for Jaeger's defeat: ever since Josk defeated Fourth Frontier with his legion, he managed to conquer a large part of Wild Husbandry. Fourth Frontier had no choice but to retreat to the east bank of Soxius, allowing two-thirds of the territory to be occupied by Jaeger. According to their former orders, Jaeger forced the commoners and livestock of Wild Husbandry to move to the eastern part of The Northlands to wear away at House Fisablen's might.</p><br/><p>Three days ago, Pete led Jaeger's newly formed division and two carroballista brigades and carried out a sweep of Wild Husbandry's borders. The 21 thousand men carried out the mission without issue, but they didn't expect to be suddenly assailed by countless grassland barbarian cavalrymen. In the end, they were forced up the highlands to call for help with their messenger eagles. Yuriy, who had received the call for help, rushed to their aid with the second division of Jaeger. But it was a setup. Before they arrived, they were attacked by Fourth Frontier. After a tough fight, they managed to break out of the encirclement and meet up with what remained of the third division.</p><br/><p>Had it not been for Josk, who came to their timely aid with the first division, the second and third divisions would've been wiped out completely. By then, Pete had already fallen and Yuriy was greatly injured. He helped the remaining soldiers escape, but he ended up falling from his mount and greatly injuring himself for attempting to hold Duke Fisablen back. He was only saved thanks to the sacrifice of seven other silver-ranked household knights.</p><br/><p>According to the report, the grassland barbarian soldiers numbered over a 100 thousand. Jaeger's survivors recalled the number of grassland barbarian soldiers didn't decrease at all no matter how many they killed. They also used large shield carts to make the steel ballistae lose their effectivity. Jaeger's soldiers had no choice but to fight the barbarians in close combat. Fourth Frontier was also recently assigned more men to fill up their ranks, but most of those who joined were picked from the barbarians as well.</p><br/><p>It was bad news indeed. Without Wild Husbandry and with Jaeger neutered, Pedro, the citadel located at the crossing point through Pisper Mountains, which was the border between Wild Husbandry and Winston, would lose all protection. If Duke Fisablen led his grassland barbarians to besiege Pedro and conquered it, Winston would be a shivering and helpless girl before an assailant. The effort the four houses had expended conquering Windbury would also go to waste. There was nothing they could do but recall all their soldiers to Winston and launch a counterattack. Should that happen, the situation in Southern would revert to how it was previously, with House Fisablen and the four central duchies' connection restored.</p><br/><p>What a move!</p><br/><p>Lorist was faced with a dilemma. He couldn't send any troops from Southern given that House Fisablen's 80 thousand men were still cooped up in the mountain range. If he really did send reinforcements, the defenses they had spent three months building would easily be breached. Given that Lorist had already pushed House Fisablen's forces to the door, if he sent soldiers to reinforce the other front, the old fellow would lead the grassland barbarians into Southern and further worsen the situation.</p><br/><p>\"Where's Baron Freiyar?\"</p><br/><p>Lorist suddenly thought about the local defense legion's commander.</p><br/><p>\"This...\"</p><br/><p>Howard flipped open a notebook and scanned the pages quickly.</p><br/><p>\"Your Grace, Lord Freiyar left for Windbury after checking on the construction at Sehak. On the way back, he still has to check the construction at Twilight Lake Town. He should've just made it back to Windbury.\"</p><br/><p>\"Send a messenger eagle immediately and tell Freiyar to defend Pedro no matter the cost. Send another message to Count Shazin to inform him of the current situation and request he sends another household division to reinforce Pedro.\"</p><br/><p>\"Yes, Your Grace,\" said Howard as he hurriedly left the tent.</p><br/><p>Taking a deep breath, Lorist continued, \"Els, Reidy.\"</p><br/><p>\"Your Grace,\" said the two in unison.</p><br/><p>\"You've heard everything, right? The old bastard managed to deal us a huge blow. I have a mission for the two of you. Think of a way to capture a few soldiers from the mountains alive. I want to know how many men are still holding the place and how many he brought away with him, as well as how they intend to spend the winter.\"</p><br/><p>\"Understood, Your Grace.\"</p><br/><p>When Els and Reidy left, Lorist sat down again and read the second silk letter. It was a letter Tarkel had penned personally, it didn't bring any good news either. The letter described the movements of the mountain barbarians in the Magical Dragon mountain range. They seemed to be targeting the Norton dominion for a raid.</p><br/><p>The mountain barbarians were a sensitive matter to him. He had been intentionally avoiding the affairs concerning them. Even though he had spent a few months among them and learned quite a bit, like the tribe that neighbored the Nortons, Habibaba. Back then, there was a conflict for the position of Great Jambassen, so they didn't divert much of their attention to his dominion.</p><br/><p>During the first few years after Lorist returned to the dominion to answer his calling, he set up a small tower outpost near the border and hired the Pentasword Mercenary Band to guard it. After his narrow escape from the assassination attempt and his stay with the barbarian tribe, he gave the tower outpost to Pentasword Mercenary Band and developed it into a small town for mercenaries. The town became the main trade hub for the barbarians, where they traded for other resources.</p><br/><p>Tarkel warned off an incident concerning the town. Thanks to rumors that the mountain barbarians would soon invade the dominion, the townsfolk panicked and mostly moved back to the household dominion. Not only that, the person in charge of the salt merchant committee's trading post there sent over a secret correspondence. The barbarians who had good trade relations with the trading post revealed that a group of grassland barbarians traveled into the mountains hoping to join up with the mountain barbarians and attack the dominion together.</p><br/><p>Needless to say, it was a move made by Duke Fisablen.</p><br/><p>One move after another, huh. As expected of the war god of the plains.</p><br/><p>Lorist deliberated whether he ought to return to the dominion to calm the people there down. The mountain barbarians were no threat given that there were so many local defense brigades in the dominion. The only thing he worried about was whether he could keep Pedro. It was the key factor which would determine whether House Fisablen could turn the tables completely.</p><br/>\n</div>"}