{"title": "Chapter 375 Victory", "id": 375, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-375-victory", "volume_title": "Volume 4", "body": "<h1>Chapter 375 Victory</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Victory</p><br/><p>Enjoy the second release of the week! Things sure are building up in the story, huh?</p><br/><p>Afternoon at two, Lorist stood atop a tower in the middle of the third line of defense. He looked at the four central duchies' and House Fisablen's forces as they gathered under their banners following horn after horn. Gradually, they got into formation for the upcoming field battle.</p><br/><p>\"Your Grace, aren't they a little too slow? It's already been two hours since lunch, yet they're still not done arranging their troops. Look, our men already took a short nap,\" complained Howard as he pointed to the lazy-looking household soldiers who had just woken up.</p><br/><p>Reidy patted his shoulder with a smile.</p><br/><p>\"That's why His Grace had everyone rest well after lunch. Weren't you against it at first? You thought we were being a little too careless, weren't you? You even said we'd suffer heavy losses if we aren't able to react in time. But look at how it turned out. They're still getting into formation after we took our nap. If we had the soldiers stand at attention for two whole hours, they'd be worn out before the battle even started.\"</p><br/><p>Howard hurried to find an excuse.</p><br/><p>\"Well, I was just saying that we should be ready just in case! If everyone dismounts and rests and the enemy suddenly launches an attack, then we'd be too late! The distance is only 300 meters and it won't take them a few minutes to reach us! I'm curious why they didn't launch a sudden attack like I thought they would, though.\"</p><br/><p>Lorist laughed.</p><br/><p>\"If we were facing that old fellow Duke Fisablen himself, I wouldn't have allowed the rest. It would have been far too risky. But we're faced with the four duchies. When we got into formation for a field battle, even if House Fisablen's cavalry wanted to attack, the duchies would object. Just look at our enemy. They've placed their heavy infantry in the center. They intend to use their numerical superiority to crush us and win.</p><br/><p>\"However, infantry troops like those travel really slowly. And after fighting and conquering our first line of defense, they've no doubt suffered a lot of casualties and require some time to reorganize. When they saw us dismount and rest, they thought we were trying to bait them into attacking and falling into a trap. Even if they only launched their cavalry, if we did in fact have an ambush prepared, they would suffer huge casualties. Having one's cavalry so badly beaten would only negatively impact army morale. So they opted to stay put. There's no way they would've allowed the cavalry to attack when we're resting. The other reason is that they need time to arrange their forces. Having our own troops dismount to rest is a signal that we'd wait for them to get into formation before beginning the battle and that we wouldn't disrupt them before they finish getting into formation.\"</p><br/><p>Loze and Pajik both arrived on the roof and saluted Lorist.</p><br/><p>\"How are the flanks? To which house do the troops facing you belong?\" inquired Lorist.</p><br/><p>Loze gave Pajik a look. The latter nodded.</p><br/><p>\"Your Grace, the troops on both our flanks are the same. They're the divisions from Fifth Frontier. On my side, they are the first and third division, on Pajik's, the second and fourth. They brought 20 thousand barbarian cavalry along. We each face around 40 thousand,\" replied Loze.</p><br/><p>\"24-25 thousand faced with 40 thousand, huh... Even though the enemy's numbers exceed yours, I doubt they'd center their attacks on the flanks. The mounted barbarians are merely a hodgepodge bunch that can only help in battles they're already winning. As long as you can endure the first three waves, they will reach their limit. Given Tigersoar's might and equipment, we still suppress them.</p><br/><p>\"As for Fifth Frontier, according to our captives, they're a newly formed legion and also the weakest of Fisablen's forces. The only thing worth considering is the fact that most of the soldiers are armed with crossbows and other ranged weapons. I heard they are most used to dismounting and launching ranged attacks in a formation. So when the battle begins, make sure to pay attention to our spear cavalry when they launch their attacks,\" said Lorist after some thought.</p><br/><p>\"As you wish, Your Grace. We will be on the watch,\" Loze agreed, \"However, we're currently worried about our center. The enemy has obviously centered most of their forces, so aren't our own a little thin?\"</p><br/><p>While both flanks of the enemy number approximately 80 thousand troops combined, the center had 60 thousand duchies forces and 20 thousand from House Fisablen's reserve legion, adding also to a total of 80 thousand. It was almost double the number of troops Lorist had stationed there. It was no wonder Loze and Pajik were rather worried.</p><br/><p>\"It's fine,\" Lorist laughed, shaking his head, \"I have already secretly moved Ovidis's Thunderbolt Brigade and Terman's Ragebear Knights behind of the center. When the battle begins, we'll give our enemies a surprise. The numbers of an enemy destined for failure is nothing to worry about. It is your flanks that require more attention. In the event the enemy crumbles, don't give chase. Let House Felim's Pegasus chase. They are light cavalry. You two will have to lead the Tigersoar divisions to the center to intercept them. Our target this time is the duchies' elite infantry. As long as we can eliminate enough of their infantry, the old fellow won't be able to stand back up, understood?\"</p><br/><p>\"It will be done, milord,\" said Loze and Pajik as they puffed out their chests.</p><br/><p>\"Good. Go lead your troops. The enemy's finishing up their preparations and the fight will break out soon. Make sure to watch out for your own safety too. Don't forget to protect yourselves as you rake in achievements.\"</p><br/><p>\"Thank you, Your Grace.\"</p><br/><p>Long, low-pitched horn blowing could be heard. Loud drumming rang throughout the enemy lines. From the tower, the enemy could be seen waving their banners, cheering and shouting their chants.</p><br/><p>Lorist snapped alert.</p><br/><p>\"It's finally beginning. Howard, what time is it now?\"</p><br/><p>Howard ran downstairs and back up quickly. \"It's fifteen past three, Your Grace.\"</p><br/><p>\"Blow the horns! Have all troops get ready!\"</p><br/><p>There were no messengers sent over to formally declare war, nor were there knights who came forward to issue challenges. The duchies' elite infantry and House Fisablen's forces rested for less than half an hour after getting into formation and launched their attack. Countless two-wheeled log shield carts were arranged into three neat lines, forming three defensive lines at the enemy's vanguard.</p><br/><p>\"Your Grace, we can have Thunderbolt Brigade fire their rock projectiles now. They are already in range,\" suggested Howard as he looked at the waves of wooden shield carts.</p><br/><p>\"Patience. They just started moving. It won't be too late to strike when they cross the centerline. I already ordered Ovidis to estimate the range. Wave the black flag in ten minutes, the signal to fire,\" Lorist said without any hint of haste, \"Also, order Suleimos to be prepared to receive the enemy. His heavy-armored division is the first line of defense of our center formation.\"</p><br/><p>Suleimos was a household knight of Duke Kenmay -- a one-star gold rank. It was said that he used to be a slave fighter of the Hanayabarta kingdom. Back then, Kenmays was still a viscount and his father had traveled to the slave kingdom on a business trip and watched a bloody show in the dueling grounds. He became interested in Suleimos, the victor, and paid a huge sum to buy his freedom. Suleimos, having become a free man, joined House Kenmays as a household knight. Just recently, he had been transferred to his position as division commander of the house's heavy-armored division.</p><br/><p>The duchies' advancing forces looked rather impressive. However, they crept forward at a moderate pace, The three frontmost rows of shield carts wouldn't be easy to push all the way to the third defense line as there were roughly 300 meters to cover.</p><br/><p>Given that the log shield carts were crudely made, with their wheels being not perfectly round or of identical size, some of the carts got stuck after being pushed around 50 meters. A good number had malfunctioned.</p><br/><p>Lorist's original estimate of ten minutes for the enemy to make their way to the centerline was 20 minutes off. It took them nearly half an hour. At that moment, a few of the carts in the rear stopped. Those were intended to protect the longbowmen who could now reach the four houses' lines. They would start raining arrows down on their ranks soon.</p><br/><p>\"Have Thunderbolt Brigade start firing. Destroy the shield carts in the front and order Malek's carroballista brigade to target the longbowman. Have Suleimos's heavy-armored division defend against the arrows!\"</p><br/><p>Lorist barked three orders in quick succession, compelling Howard and Reidy to wave the flags around to relay the orders by the edge of the tower's roof.</p><br/><p>Shen the first volley of 500 stone balls were sent flying into the ranks of the duchies' infantry, many of the soldiers merely stood still, watching as the gigantic projectiles unknown to them crashed down from the sky.</p><br/><p>While the log shields were able to block bolts, they weren't able to resist the gigantic stone balls. Tens of log shield carts were smashed to smithereens immediately. In one of the cases, a stone projectile slammed down on a log shield cart. Not only did the shield crumble, the two-wheeled cart was sent flying. A few unprepared soldiers pushing it were sent flying 8 meters away. There were also more than ten unlucky fellows tossed about by the force of the impact.</p><br/><p>Apart from the stone balls that struck the shields, those that landed on the ground bounced and rolled through the infantry's tidy ranks. In mere moments, their formation was completely destroyed. None were able to stop the gigantic balls. Any soldier in the balls' way ended up injured or dead. Cries of despair and pain could be heard from the dozen centremost formations.</p><br/><p>It was only the beginning, though. Countless blurs whooshed through the gaps left by the obliterated shield carts. The carroballista division's bolts killed the fortunate, disoriented soldiers not crushed by the stone balls. Corpses piled into mountains and blood flowed in rivers. The cruel sight was difficult to watch.</p><br/><p>Even though the damage only covered a small part of their ranks, the rest hesitated after taking such a blow. The soldiers pushing the shield carts not struck raised their heads to look at the skies. Even the foot soldiers following behind directed their attention up.</p><br/><p>They were not disappointed. Soon, closely packed gigantic stone balls became visible again. The moment they were certain where the balls would fall, the soldiers pushing the shield carts turned tail and ran. The foot soldiers behind them caved as well and scrambled all over the place as they screamed at the top of their lungs. The 100-man leader that intended to stop them was pushed to the ground and trampled by tens of feet without the slightest hesitation.</p><br/><p>\"Oh? What's that?\" asked Duke Fisablen, his eyes popping out.</p><br/><p>He was watching the battle from the roof of a tower in the second defense line with fright as the foot soldiers were turned into shambles by the balls that fell from the sky.</p><br/><p>\"I heard that when the Nortons attacked Andinaq to force Queen Carey's abdication, they used a contraption that could fling gigantic rocks to take down the citadels. I think they were called catapults. Those stone balls should have been fired from one of those,\" said Duke Shabaj with a grim look.</p><br/><p>\"What should we do now?\" asked Duke Handra anxiously.</p><br/><p>The ones being smashed were his duchy's most elite forces.</p><br/><p>\"Signal the retreat. We'll retreat for now while we figure out how we should deal with the catapults,\" suggested Duke Farkel.</p><br/><p>\"No!\" Duke Fisablen exclaimed, \"You saw how messy the lines are right now! The moment you call a retreat, they'll crumble completely and the enemy will give chase! Your foot soldiers won't be able to outrun their cavalry. We should signal a charge and fight to the death. Our forces still outnumber theirs and our losses aren't that heavy yet. We still have hope if we launch an all-out attack!\"</p><br/><p>\"What crap are you spouting?!\" Duke Handra cried, \"Just look! The lines are already falling apart! There's no way they can launch a frontal attack now! We'd best retreat while more than half of our forces can still hold on. We should quickly retreat and reorganize. The enemy won't give chase because of our superior numbers.\"</p><br/><p>As the dukes argued, the situation devolved beyond control. With most of the shield carts destroyed, the carroballista division gave the four duchies a taste of their ballista firestorm. The incessant stream of ballista bolts penetrated the dozen 1000-man formations in the front. One duchy soldier after another fell to the ground.</p><br/><p>Thanks to the rain of gigantic stone balls and ballista bolts, a dozen more infantry formations. The soldiers discarded their weapons and ran. The remaining formations in the rear fizzled with commotion.</p><br/><p>\"Have Ragebear Knights attack. House Kenmays's heavy division will follow. Have Malek's carroballista division advance and support them. Thunderbolt Brigade should advance as well. Have the catapults fire as far as they can and stop the enemy from retreating!\" ordered Lorist once more.</p><br/><p>The attack of Terman's Ragebear Knights accelerated the enemy's crumbling. The sight of the heavy-armored knights cleaving away at the backs of the retreating soldiers was akin to the sight of a light assaulting a herd of sheep. However, the enemy also reacted quickly. House Fisablen's reserve legion hurriedly charged forward to tangle with the knights and protect the infantry as they retreated.</p><br/><p>Lorist was getting rather impatient. If more than half of the infantry were allowed to retreat, his victory was still in question. Even if he managed to gain the upper hand for now, if the retreated soldiers regrouped and were sent into battle again, the enemy could still use their numerical advantage to turn the tide. He had to crush them completely.</p><br/><p>It would be great if my guards were here. I could lead them into battle myself.</p><br/><p>\"Ready the horses. Let's join the fray.\"</p><br/><p>He needed all the forces he could muster right now.</p><br/><p>The moment he descended from the tower and mounted, loud cheers echoed from the battlefield.</p><br/><p>\"Your Grace, we've won! We've won!\" cried Howard full of excitement.</p><br/><p>Lorist looked up and saw Tigersoar's banners on both flanks. Fiercetiger Loze and Pajik didn't let Lorist's hopes down and ordered their cavalry to cut off the enemy's retreat from both sides.</p><br/><p>Lorist smiled.</p><br/><p>\"Yes, we've won. Blow the horns and have everyone engage!\"</p><br/>\n</div>"}