{"title": "Chapter 381 The Bloody Battle of Pedro (1)", "id": 381, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-381-the-bloody-battle-of-pedro-1", "volume_title": "Volume 4", "body": "<h1>Chapter 381 The Bloody Battle of Pedro (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Bloody Battle of Pedro (1)</p><br/><p>Here's the third release of the week! Sorry for the delay! It completely slipped my mind!</p><br/><p>People and horses rolled down the slope. The first wave of attacking barbarians, around two thousand riders, were crushed before they even scaled half of the slope. Of the riders flung off their mounts, the fortunate ones were still not beyond salvation, while those less fortunate broke their necks and suffocated to death. The second and third waves of barbarian riders following tightly behind them stopped their mounts immediately and began to rescue the rest. After a lot of effort, they turned tail and ran. The cheering barbarians all seemed to have been given a face slap and no longer uttered a sound. They made no further movements on the city.</p><br/><p>Chieftain Korinubi's expression was rather sour. He felt like he lost a lot of face for stopping his attack halfway.</p><br/><p>\"Go, get Halikai, Lunigigi, and Morimod here. I want to hear their explanation for stopping their attack.\"</p><br/><p>The barbarian guards soon returned with the two of the three.</p><br/><p>\"Revered Chief Korinubi, your humble servants Halikai and Morimod greet you.\"</p><br/><p>\"Where is Lunigigi?\" hmphed the chief.</p><br/><p>\"Revered Chief Korinubi, Lunigigi has returned to the embrace of the wolf god,\" replied Morimod, the elder of the two, respectfully.</p><br/><p>\"What did you say?!\" the chief exclaimed, stunned, \"He's dead? Nonsense. How could he die? He drank a large jar of my milk wine yesterday and one of my roast goats! Wasn't he looking well when he was sent out?\"</p><br/><p>\"It's true, Revered Chief Korinubi. Your humble servant dares not lie to you. The brave Lunigigi rode at the front as per your instructions. However, the cowardly flatlanders dug lots of horse pit traps on the slope. His steed stepped into one of them and broke its right front leg. Lunigigi was flung off forward. He broke his neck and returned to the wolf god's embrace,\" described Morimod in detail.</p><br/><p>\"What? The slope was fraught with pit traps?\"</p><br/><p>\"Yes, Revered Chief. Your humble servant doesn't lie. Of the two thousand riders Lunigigi took with him, more than 1300 lost their horses to the pits. More than a thousand are injured. Over a hundred returned to the wolf god's embrace just like Lunigigi. Not only did the flatlanders dig pit traps, they also dug a lot of other ditches and traps with wooden stakes inside. There was no way we could rush up the slope with our horses. We decided to retreat first,\" explained Morimod hurriedly.</p><br/><p>He wanted to make it clear it wasn't that they didn't want to fight. They simply had no way to.</p><br/><p>\"Hmm, I hope you speak the truth,\" said Korinubi as he swept Halikai and Morimod with his gaze.</p><br/><p>Seeing the two of them stand there like the most natural thing in the world, he reasoned that they couldn't have been lying, so he turned to Duke Fisablen.</p><br/><p>\"Haha, no problem, my friend.\"</p><br/><p>As Duke Fisablen also heard the conversation, he took the initiative to speak first.</p><br/><p>\"I will leave the shield carts we brought with you. I'm sure you know better than anyone how to use them. With the shield carts, you can fill up the ditches quickly enough while protecting your riders as they approach the city walls. I think it's obvious from the number of traps and ditches they don't have nearly enough troops to defend the castle. They had no choice but to use such underhanded tactics to delay our brave warriors' attack.\"</p><br/><p>Even though Korinubi had hoped the duke would send Frontier to use the shield carts and protect his men as they made their approach, the duke had spoken out first and stated his intentions.</p><br/><p>You can have all the shield carts you want but don't even think of laying your hands on my men.</p><br/><p>Hatefully cursing the old fox under his breath, Korinubi nodded and thanked him. He instructed Morimod and Halikai to collect the shield carts. He also had some of the barbarian riders dismount and grab some tools to fill the traps, ditches, and holes up and down the slope.</p><br/><p>Duke Fisablen gave the order to set up camp and Korinubi didn't bother to stop him. As pushing the shield carts up the slope would take who knew how long, and filling up the traps and ditches would require lots of manpower and time, there was no way they'd let the 100 thousand barbarian cavalrymen wait like idiots on their mounts. Korinubi postponed the attack by a day and stuck with establishing a method for the attack for what's left of the current day.</p><br/><p>At four in the morning, they'd managed to push the shield carts 300 meters up the slope. As the people in Pedro didn't seem to respond at all, the tool-wielding barbarians dropped their guard and focused their attention on filling up the traps and ditches. Korinubi had given the order for one route of attack to be established by the end of the day. As not one of the barbarian soldiers wanted to be punished, they only thought of completing their work as soon as possible so they could rest when they returned.</p><br/><p>Without anyone noticing, the 23rd local defense brigade, led by Eidelwoke, formed an assault unit around a thousand strong. It left through the rear gate and circled the moat, approaching where the barbarians were. When they were less than ten meters away, they leaped and rushed into the crowd of busy soldiers.</p><br/><p>It was a complete massacre. The four thousand or so barbarian soldiers filling up the ditches were caught completely off guard and met tragic ends. When their enemy showed up, they panicked and forgot where they put their weapons. The tools in their hands were broken by a single slash before they felt a cold glint and lost consciousness, seeing nothing but darkness.</p><br/><p>The 100 thousand soldiers who'd settled down in the camp stared wide-eyed at the massacre atop the slope. All of the working barbarians were slaughtered easily like chickens. Only a fortunate few managed to run down the slope, crying for their parents. However, they were not so lucky in the sense of having left the shield carts behind. Due to the inactivity of Pedro's defenders, they didn't feel the need to push the heavy shield carts up the slope, so they proceeded without them.</p><br/><p>Currently, the carts were obstacles to their escape. The groups weren't able to squeeze between them as the barbarians behind began to let out pained cries. The local defense brigade soldiers that caught up were able to pierce three enemies' chests with only one thrust of their spears.</p><br/><p>The barbarians in the camp finally snapped out of their stupor and reacted. They let out beastly cries and got onto their mounts without caring about anything else. They rode for the slope. At that time, the city's bell rang out once more. The local defense brigade soldiers that came out to launch a surprise attack didn't pursue their enemy. Instead, they took out the leather sacks slung on their sides and splashed the fuel contained within on those huge, wooden shield carts before they ignited them. More than 50 bonfires were lit on the slope. Following that, the local defense soldiers stayed to loot the dead barbarians before returning to Pedro.</p><br/><p>Only around seven hundred of the original four thousand barbarians managed to make it back. They left approximately three thousand corpses on the slope along with the 50 shield carts that were all set alight. That was a huge and harsh slap to the faces of all the grassland barbarians.</p><br/><p>The riders rode to reinforce their comrade with fervent anger. They had just received the other seven hundred plus who managed to escape and stared red-eyed at the corpses of their fellow tribesmen that littered the slope. The mocking laughter and cheers from Pedro sounded ever so ear-piercing. One of the grassland barbarians cried loudly in a crazed manner and rode speedily upwards the slope. Countless other riders joined him in his endeavor with similarly pained cries and launched their attack on Pedro.</p><br/><p>The riders' skill seemed to improve thanks to their anger. They rode speedily up the slope, almost seeming like they were flying up the uneven terrain as they passed the burning shield carts and avoided the corpses of their tribesmen, approaching the walls at breakneck speed. But they ran into some trouble when they were less than three hundred meters from the walls. The ditches and pit traps began to slow them down. Some riders would fall from time to them from the traps or ended up in ditches because of riding too quickly. However, those whose heads were filled with wrath and felt no fear. Those able to get back up after their mounts collapsed continued running at the city while waving their weapons around as they called out loudly to plead for the protection of the wolf god.</p><br/><p>\"Fire!\" Seeing the grassland barbarian troops appearing within two hundred meters of the walls, Eidelwoke finally gave the order.</p><br/><p>Following the subsequent twangs, the first volley of the two hundred plus steel ballistae mounted on the walls blanketed the battlefield, skewering the approaching barbarians, mounted or otherwise. Many of them were nailed to the ground by the bolts along with their mounts. Cries of pain and agony reverberated throughout the slope.</p><br/><p>While the two hundred or so bolts gave the grassland barbarians quite a harsh blow, even more barbarian cavalrymen took their place. They ignored the skewered bodies in front of them as well as the incoming ballistae attacks as they rode onwards towards Pedro, shouting to raise their morale and courage while they were at it.</p><br/><p>\"Steel ballistae, fire at will! Longbowmen, standby! Fire when the enemy is a hundred meters away! There's no need to wait for further orders!\" instructed Eidelwoke once more.</p><br/><p>House Norton's local defense brigades comprised two regiments of sword-and-shield infantrymen, approximately a thousand of them, one regiment of five hundred heavy-armored pikemen, one regiment of five hundred longbowmen, one regiment of five hundred ballistae soldiers armed with a hundred ballistae, as well as a logistics regiment of five hundred men. If they were tasked with defending a location, they would be assigned another hundred steel ballistae to be manned by the regiment of sword-and-shield soldiers. The 23rd local defense brigade was stationed in Pedro and assigned two hundred steel ballistae in total, which were all installed on the front wall by Eidelwoke and were engaged in a different type of massacre against the barbarian riders.</p><br/><p>The first surprise attack by the local defense brigade soldiers gathered by Eidelwoke was conducted with close combat. But now, the soldiers manning the steel ballistae were engaging in ranged combat with the approaching cavalry. As soon as one of them evaded the traps and leaped over the ditch, the ballistae bolts that followed would put an end to their anger and effort in an instant. From time to time, soldiers would be sent flying by the bolts and fall into the ditches or onto the ground. Not one got to within a hundred meters of the walls thanks to the storm of ballistae bolts.</p><br/><p>Korinubi and many other chieftains were calling out loudly to motivate their men.</p><br/><p>\"Rush up there! Kill them all! Massacre the whole city!\"</p><br/><p>In the end, Duke Fisablen was no longer able to resist and reminded, \"I think it's best we retreat for now. If we want to mount an attack, we can use the shield carts left. Rushing up there right now would make you nothing but targets and sacrifice the lives of our brave warriors.\"</p><br/><p>Korinubi snapped out of his blinding rage.</p><br/><p>\"That's right! Blow the horn and have our warriors retreat for now!\"</p><br/><p>The loud blaring of the horn covered the whole plains and the attacking barbarian riders finally regained their sanity. They retreated from the slope like a receding wave, leaving behind a fresh trail of blood and corpses.</p><br/><p>Then they had all made it back to camp, the chieftains conducted a head count. They were all deeply enraged. Before they even launched a proper attack, more than six thousand had died on the slopes. Korinubi himself was incredibly regretful as his tribe had already lost around four thousand men from the first attempt at filling up the holes and ditches and the second retaliatory attack which he personally encouraged.</p><br/><p>Duke Fisablen advised, \"Even though it didn't start off well, we managed to get an understanding of Pedro's defenses. Taking a loss due to carelessness isn't much. Let's rest for a night and attack the city tomorrow.\"</p><br/><p>Korinubi refused Duke Fisablen's advise coldly with bloodshot eyes.</p><br/><p>\"No, we will press our attack through the night. I will not allow them to rest well for even one more night. A debt of blood must be repaid in blood. We have 100 thousand men, and from now on, I won't give them even a moment of rest. We will continue to attack until we conquer the city. Great Lion Duke, please leave the remaining shield carts with us. We will organize our men into different units and have them take turns attacking.\"</p><br/><p>\"Naturally. We are allies and should stand together. I will have all the shield carts I have left sent to you. At the same time, I pray for your success in conquering the city and avenging the brave warriors lost so far,\" agreed Duke Fisablen with a smile.</p><br/><p>The horn rang out once more and three square formations of barbarian soldiers gathered at the foot of the slope. Each of the formations contained five thousand men. In front were roughly thirty wooden shield carts. These barbarians had dismounted and were split into three waves that would push the shield carts up the slope towards the city. The orders received by the first wave were simple: collect their comrades' corpses as they close in on the city. The second wave would use longbows to suppress the enemy and defend the other barbarian soldiers who would fill up the holes and ditches. Naturally, they would also have to pay attention so any surprise attack like the last one wouldn't be repeated.</p><br/><p>The third wave was the attack's main force. Apart from bringing shield carts, they also carried many wooden ladders. After the second wave opened a path towards Pedro, they would approach the walls. They would then scale them with the ladders as the longbowmen protected them and slaughter away at the enemy when they made it to the top. They would take control of the area so their comrades could continue to flood into the city and obtain victory.</p><br/><p>That was the traditional siege tactic used by the barbarians against flatlander towns for the past few centuries. That was the reason the third wave of barbarian soldiers comprised only the most famous warriors and strongmen across all the tribes. Currently, they were drinking the milk wine from their water skins nonchalantly as they packed up their armor and waved the weapons in their hands around, laughing and talking loudly as the other barbarian soldiers looked at them respectfully.</p><br/><p>The skies soon darkened and the shield carts that laid across the near-one-kilometer slope burned even brighter. The horn blared once more. The only difference was the steadily thudding drums that accompanied it. The booming drums echoed across the wide expanses of the plains and brought with them a feeling of cold dread.</p><br/><p>The barbarians at the foot of the slope all let out a chilling war cry.</p><br/><p>\"Hujorah!\"</p><br/><p>That was the name of the celestial wolf god that all the grassland barbarians across the great northeastern plains worshipped. Calling out the name symbolized a single-minded determination on marching forward to victory or to death. The first wave of the barbarians marched up the slope, pushing the shield carts as they advanced. The siege on Pedro had begun.</p><br/>\n</div>"}