{"title": "Chapter 389 Barbarians and Gold Mine", "id": 389, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-389-barbarians-and-gold-mine", "volume_title": "Volume 4", "body": "<h1>Chapter 389 Barbarians and Gold Mine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Barbarians and Gold Mine</p><br/><p>Enjoy this week's first release!</p><br/><p>\"We Nortons know a sickness of the heart only gold can cure.\" ~ Charade</p><br/><p>On the 23rd day of the 2nd month in the meeting room on the second floor of Firmrock Castle, Lorist tapped on the map of the dominion on the wall with a wooden pointer.</p><br/><p>\"I'm sure you've all heard what Mayor Doboff had to say about the barbarian tribes, right? A hundred thousand barbarian soldiers can't compare to even just one of Duke Fisablen's frontier legions' strength. In terms of organization and equipment, our forces' greatly surpass theirs. I ignored them until now because they haven't caused trouble before and I didn't want to bother playing hide and seek in the forests.</p><br/><p>\"But now they've come with an army of 100 thousand. They consider us no different from the scattered nobles of past Northlands. They really think that 100 thousand soldiers will let them walk unhindered through The Northlands. In actuality, they're no different from a dish served to our doorstep. Like a fresh fish sent for us to butcher. We ought to polish our blades and think of where we should cut first.\"</p><br/><p>The household knights laughed at how Lorist described the whole situation.</p><br/><p>When they'd quieted down, he continued, \"I never really considered them a threat. Not because of ignorance, because I understand them far too well. Even if they have another 100 thousand, they still won't be a threat.</p><br/><p>\"They'll have a hard time coming for us from the 500 kilometer stretch starting from Azure River to the eastern part of The Northlands, all the way to the part of Magical Dragon Mountain Range that border the dominion. But, according to historical records, only two areas were really harmed by their pillaging: our dominion and the eastern Northlands. These two areas are where their raids are most rampant. They are also the most developed areas.</p><br/><p>\"Ever since House Kenmays took control of the eastern area, their approach to dealing with the barbarians has been carrot and stick. They set up a trading post and began doing business with them. Through trading fairly according to market price, they managed to obtain various specialties in exchange for other useful daily necessities. As a result, the barbarians were able to get their hands on what they needed and wanted without resorting to pillaging. They also divided them to incite inner conflict between the tribes through trade relations. This way they could ensure they wouldn't unite.</p><br/><p>\"As for the barbarian tribes that only cared for pillaging, House Kenmays hired other tribes to attack them. They offered high rewards according to how well the employed barbarian fighters performed and also occasionally mobilized their household forces to deal an even harsher blow to the incessant raiders. By exterminating them or driving them far away from the eastern area, the raiders were no longer a threat. Within five or six years, the eastern part of The Northlands no longer had to suffer pillages. The border was completely peaceful.</p><br/><p>\"The facts show that House Kenmays's policy is really effective. Currently, the barbarians' herbs and specialties are a large part of the salt merchant committee's business. I really can't help but admire House Kenmays' head for his wit and farsight. As expected of one who hails from a merchant family.</p><br/><p>\"However, we can't mimic their methods. We're running out of time. The barbarian army will soon arrive. While we did have the opportunity to do so in the past, we didn't set our sights on them. Back then, our forces were far too busy with things going on in the west.</p><br/><p>\"Mayor Doboff just briefed us on a tribe called Habibaba which rules the territory near our dominion. Habibaba is a tribe with roughly 300 thousand members. The chief is the Great Jambassen, akin to a duke. He also commands over 20 vassal tribes. Given their tradition of conscripting all their tribesmen as warriors, it's no ruse that they can mobilize 100 thousand.</p><br/><p>\"Even though there is also word of the army's intentions to raid the eastern area, it's all based on the testimonies of the barbarians that come here to trade. They spread it around like some kind of folktale. The area they'd have to go through to attack the east isn't under Habibaba's control and the tribes there haven't answered the call. This alone makes me confident they won't target the eastern area. While we still have to keep our guard up, there's no need to be too anxious.</p><br/><p>\"In the area between the eastern Northlands and Firmrock Castle is the fully developed settlement, Redriver. It's separated by hundreds of kilometers and the Black Forest from the mountain range, which serves as a natural barrier, there's no way the barbarian's will attack through there unless they're willing to spend two or three months paving a way through the forest. This is why Redriver wasn't invaded in the past, and why it won't be now.</p><br/><p>\"Our house has also developed part of Blackmud Marsh near our dominion. We have a wall from Tortoise Hill to Hidebull Mound where the 3rd and 4th local defense brigades are. Twinmount Town is right in front of that line, and that's where it'll be the easiest for them to invade. They used that very spot to enter the dominion in the past as well. Now that we have completed our defenses there, we can be confident in keeping them out.</p><br/><p>\"If their army is blocked here, they'll look for another location to break through. The area between Hidebull Mound and Firmrock Castle is separated by the Black Forest, which is roughly 50 kilometers wide. However, that part of the forest isn't where the swamp intersects, so it's the mostly likely place to go through. It'll be Tigersoar's hunting ground. All the mountain barbarians coming through there are your prey. I don't want to hear about any barbarians making their way to the villages or towns.\"</p><br/><p>Fiercetiger Loze stood up and clutched his chest.</p><br/><p>\"Your Grace, Tigersoar will not disappoint you. We promise to not let even one escape.\"</p><br/><p>Lorist nodded and gestured for him to sit.</p><br/><p>\"I trust you and Tigersoar's abilities. I'll leave this to you. As for Terman's Ragebear Knights, you will be transferred to Tortoise Hill fort to hold them there. The moment you see their forces split, attacks them from the fort. Strike all the way along Azure River until you circle to the rear pathway where they came from. From there, launch a pincer attack to crush them completely.\"</p><br/><p>\"Understood, Your Grace,\" said Terman as he stood up and accepted the order.</p><br/><p>Lorist pointed the stick at the eastern Northlands.</p><br/><p>\"I've already ordered Waxima to temporarily serve as Jaeger's division leader. This time around, they suffered huge casualties because of the ambushes. However, the remaining soldiers are still enough to form a division. We will station them in the eastern part of The Northlands as a contingency. As for the villages of Felicitas, Salus, and Redriver, have them enter combat level two after the harvest. Make sure they're on guard when they start sowing seeds for spring. Also, form garrison regiments that can be sent to reinforce the frontlines at any time. Baron Charade, you are in charge of this.\"</p><br/><p>Charade stood up.</p><br/><p>\"Your will be done, Your Grace.\"</p><br/><p>\"Next, we have a piece of good news,\" Lorist said as he tapped on the map, \"Over here.\"</p><br/><p>Lorist pointed at the part of Black Forest between Hidebull Fort and Firmrock Castle. He dipped a goose feather into some ink and drew a red circle around the area. \"This is the hilly part of the forest. There's also a large riverbank there roughly 20 kilometers away from Firmrock. According to Mayor Doboff's surveys, there is sure to be a gold mine. He reported his findings not long ago.</p><br/><p>\"However, it's inhabited by 30 thousand barbarians. They're a tribe called Warisingk, one of Habibaba's vassals. Our true focus this time shouldn't be defeating the 100-thousand-strong barbarian army, but, instead, occupying these hills and taking the gold mine.</p><br/><p>\"Let me first remind all of you that in this conflict, performance is not measured by the ratio of kills to deaths. Instead, what we want is for as many of them to be taken captive as possible. Why do we want that? Simple: the house is extremely lacking in manpower. The 20-odd thousand captives that surrendered after we took Madras have already served two years. This year is their third and they'll regain freedom the next year. The transportation and irrigation routes in Delamock have also been greatly overhauled thanks to the hard work of these captives and they will be working on the final phase of development for the rest of the year.</p><br/><p>\"However, we just defeated House Fisablen and obtained two provinces. Winston and Southern are in need of development. It's rather barren and there will be lots of development projects that require lots of manpower. While we have more than 100 thousand captive soldiers, a good number of them are injured, far from enough are left to develop the two provinces.</p><br/><p>\"The whole region is now under Norton control. It's imperative we restructure the transportation facilities to increase the region's productivity. We need lots of free labor. Even if we conquer the gold mine, we will need laborers. Since there's an army of 100 thousand coming our way, I hope we can capture at least 60 thousand youths to contribute to the development of our dominion.\"</p><br/><p>Tigersoar's carroballista division leader and Gold-ranked Knight Dulles stood up.</p><br/><p>\"Your Grace, do the barbarians we capture this time get freed after three years of labor as well?\"</p><br/><p>Lorist shook his head.</p><br/><p>\"They're not soldiers belonging to the former empire. They are different from us. These barbarians will serve eight to ten years until they assimilate our way of life. When they agree to be our subjects, they will regain their freedom. Otherwise, let them work as laborers for the rest of their lives.\"</p><br/><p>Dulles breathed a sigh of relief.</p><br/><p>\"I can finally stop worrying. If you said they would be free after three years of work, where would we find free labor after that?!\"</p><br/><p>The rest broke into laughter. Tigerloze stood up again.</p><br/><p>\"Your Grace, is Tigersoar put in charge of securing the gold mine?\"</p><br/><p>\"No, you will only play a supportive role.</p><br/><p>\" Lorist said as he pointed to Reidy.</p><br/><p>\"Originally, I had planned to have Els and Reidy take over Jaeger, but, due to the matter of this gold mine, I've decided to let them take over the two guard brigades as the main force for the operation. At the same time, I have also transferred the 7th and 18th local defense brigades over to take charge of the defenses at the gold mine after we conquer it.</p><br/><p>\"Tigersoar lost almost a division after the huge battle in Southern. They'll have to wipe out the mountain barbarians that come out from that part of the Black Forest. As for the hills around the gold mine, I will leave it to Els and Reidy's guard brigades.\"</p><br/><p>\"Understood, Your Grace,\" said Loze as he sat back down.</p><br/><p>\"Even though I want you guys to catch as many captives as you can, but don't take any risks. A hundred thousand mountain barbarians aren't scary. We can definitely defeat them. But what we have to watch out for is that each of those mountain barbarian warriors is tough and courageous. They will fight to the end even when the odds are stacked against them, given how they glorify death on the battlefield. In the same vein, I hope that you guys don't put our household soldiers in danger in trying to catch those captives.</p><br/><p>\"The easiest way to deal with these barbarian warriors is to take out their braves. Fight them one on one and make them lose their morale and their will to fight to the death. Mountain barbarian warriors have always worshipped strength and they believe that one-on-one duels are sacred. They will definitely not do anything underhanded to interfere with a duel. That is a trait we can make use of. After encircling the enemy, challenge their representative to a duel. If we win, they surrender, and if we lose, we release them. Only through doing so will those mountain barbarian warriors obediently surrender themselves to become our captives.</p><br/><p>\"That's the gist of our strategy in dealing with the barbarian invasion. If there's anything that we need to change later, I will make sure to notify all of you. It is now the second month and I estimate that the barbarian army will descend from the mountains around the 5th month. There's still roughly three months' time. The rainy season will follow after winter and we have to harvest the winter wheat and plant the spring crop following the rainy season. So, we must use what little time we have to train an reorganize. If you guys need anything, report to Baron Charade. He will be in charge of the logistics in this operation to resist the barbarian army.\"</p><br/><p>After Lorist concluded his announcement, the meeting adjourned. Everyone returned to their own posts to begin preparation. Lorist, on the other hand, brought a regiment of guards and headed to the eastern Northlands. He wanted to visit Josk and Yuriy, the two commanders of the defeated Jaeger Legion who were recovering from their injuries.</p><br/>\n</div>"}