{"title": "Chapter 393 The Barbarians Cometh", "id": 393, "volume": 4, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-393-the-barbarians-cometh", "volume_title": "Volume 4", "body": "<h1>Chapter 393 The Barbarians Cometh</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Barbarians Cometh</p><br/><p>Here's the fifth release of the week! See you guys on Tuesday!</p><br/><p>Also, if you're a Patreon, you will now be able to access chapters from \"The Sword and The Shadow\" as well for no extra cost! Check out our Patreon page here to support what we're doing!</p><br/><p>The rainy season was over and the winter's wheat harvest was underway in the 4th month. The entire Northlands was becoming very lively.</p><br/><p>Just as Lorist was about to depart from Firmrock Castle to check on the other parts of the dominion, Sylvia and her escort set out for The Northlands from Crouchtiger Castle. She had been given the heavy burden of being an envoy to House Norton.</p><br/><p>As the barbarian invasion was impending, Lorist had the house's forces be on standby even though it was harvest season. In the fields, the harvesters had a sickle in one hand and a weapon in the other. Halfway through the harvests, however, word came from Twinmount Town that the barbarians had finished their preparations. According to the plan, the town's residents would be evacuated orderly. They would leave traces of panicked escape, though, to mislead their attackers.</p><br/><p>On the 21st day of the 4th month, the barbarian army conquered Twinmount Town. Great volumes of fine wine and other daily necessities intentionally left in town made the barbarian soldiers incredibly excited about their victory. They believed the might of their combined force was enough to sweep the whole Northlands. Every warrior scrambled to be made part of the vanguard in fear of losing out on the chance to raid for spoils.</p><br/><p>Lorist arrived at Hidebull Citadel on the 23rd day of the month. This was where the wall was and it would be among the first places to come under attack. He had to be present to make sure it remained safe. At noon, however, he received an urgent message from the acting commander of Jaeger, Waxima. House Fisablen's Princess Sylvia had come as an envoy to discuss the ransoming of his prisoners and matters relating to trade.</p><br/><p>After receiving the news, he was both elated and troubled. He was glad that the old fox had finally acknowledged his loss. However, he was troubled that the envoy was Sylvia. He couldn't receive her even if he wanted; he was just too occupied. After some consideration, he sent the messenger back to Firmrock have Charade receive her for him and have her stay there for the time being. He would only return after the current situation was dealt with.</p><br/><p>Frankly speaking, the part that troubled him the most was that he didn't know how he should face the princess. He was aware that he had completely flipped out against her grandfather when he led his forces to exterminate Iblia and a number of House Fisablen's legions. He had inflicted a lot of damage on her house. He had suppressed their rise to power and was one of their archenemies.</p><br/><p>Because of that, he was incredibly troubled by the fact that the princess who loved him so dearly, to the point she would marry no one else, was a member of the house he had just ruined. As Kenmays had said jokingly, Iblia's extermination was in part the four houses venting on Lorist's behalf for Duke Fisablen's refusal to accept his proposal. At the moment, word among the folk was that House Norton's leader, Duke Norton, had rained fire and fury on Iblia and focused their attacks on House Fisablen because of this. Sylvia's name was no different from other bad omens now.</p><br/><p>He sighed lightly.</p><br/><p>I guess I can only wait until the war is over. I'll make it up to the girl afterwards. I really made her suffer this time, especially with what this has done to her reputation...</p><br/><p>Actually, even Duke Fisablen knew that even if he'd agreed to let Sylvia go through with the marriage, war would've been inevitable. House Fisablen's dominance conflicted with House Norton's interests, only one could emerge victorious.</p><br/><p>\"Your Grace, they're here.\"</p><br/><p>Lorist gazed into the distance. He just barely make out clusters of black dots among the trees. The clusters coagulated into a larger mass as a wave rushed at the wall, swallowing the land as it went. Using the telescope, he could see the different beast-leather armor they wore. Some of them even fought with their chest exposed. Their faces were painted with ghastly and eerie tattoos, wielding bronze axes and weapons of crude design as they ran maniacally at the walls.</p><br/><p>At four in the afternoon of the 23rd day of the 4th month, the barbarian vanguard launched the first wave of attacks on the defensive wall between the citadels at Hidebull Mound and Tortoise Hill. However, these barbarians had never seen such a tall defensive wall before and they couldn't help but stop in their tracks when they encountered the ditch. They stared at the three-to-four-meter-deep ditch laden with spiky wooden stakes in a stupor before the carroballistae on the walls took their lives with ease.</p><br/><p>The first wave's vanguard soon turned tail and ran. They left about 500 corpses behind. Around five or six in the evening, the vanguard launched another attack. They were probing the wall's defenses. This time around, they used wooden shields tied together with vines as walking planks to cross the moat. Even so, the carroballistae mowed their ranks down just as easily. Nearly a thousand fearless barbarians died unceremoniously. The crudely made shields were ripped to pieces. Those not killed outright had no choice but to run away again.</p><br/><p>\"Haha, this is far too easy. It felt like we were shooting turkeys. How relaxing.\"</p><br/><p>The carroballistae operators seemed rather excited. The enemy on the other side of the ditch were nothing but target practice. Some would rather die than retreat. The braver ones were frequently skewered by ballistae bolts.</p><br/><p>The wall between Hidebull Mound and Tortoise Hill stretched for 36 kilometers. It was eight meters high but only six wide. The wall was also separated by battlements every five to six kilometers where the soldiers could rest or stand guard. When the fight began, the battlements could be left in charge of a company. In front of the wall, a moat five meters wide and three to four meters deep was also dug, creating a chasm in the flat ground.</p><br/><p>\"I'm bored...\" yawned Lorist.</p><br/><p>The invasion didn't put even the slightest pressure on his forces. Their threat was far inferior to even that of the four duchies and Duke Fisablen's allied army half a year ago. Only local defense brigade soldiers who hadn't seen combat would be excited about fighting them. However, it was not often that the local defense brigades who only trained all day got to see blood. He decided he wouldn't give any commands during the battles to assess the command abilities of the two brigades' leaders. The only reason he stayed was so the soldiers would feel at peace, and to act as a contingency against any enemies of the blademaster level. There should at least be a few in a 100-thousand-strong army. They were Lorist's actual targets.</p><br/><p>The enemy vanguard finally learned their lesson after their second failure. They knew they couldn't scale the walls on their own, so for the next two days, they patiently waited in the forests for the rest of their forces to arrive.</p><br/><p>The rest of the army arrived two days later. Lorist learned the intel they received was accurate. There were at least 100 thousand men. Even though they lacked supplies and didn't set up a campsite, their bonfires looked like a field of stars in the middle of the forest. The forest seemed littered with little embers.</p><br/><p>Many of the soldiers in the local defense brigades had never actually seen such a large army before. The elation they felt at their victory two days earlier washed away completely. They began to talk in silent hushes; they doubted whether they could actually defend against so many barbarians. They put aside their lack of confidence and anxiety during the battle the following day, though. All they had to do, after all, was load the machinery, fire, rinse and repeat. They forgot everything else and followed the instructions of their superiors like mannequins.</p><br/><p>\"Fire!\"</p><br/><p>The order sent a volley of arrows at the barbarians' ranks. They rained down and cleared out an area on the other side of the ditch, making countless barbarians clutch the parts where they were hit and scream in agony. It didn't last long, though; more barbarians replaced them soon enough. Those injured lightly were quickly taken back while those beyond salvation were given a quick send off, back to the embrace of the mountain gods, as they sang their songs of war.</p><br/><p>The ditch was soon filled with corpses, branches, mud, stones, and other miscellaneous materials. Countless barbarians swarmed towards the wall, unhindered by the now-filled moat. They soon found themselves in another awkward position, though: the ladders they brought were far from tall enough. In a fit of rage, some tossed their weapons up at the walls, inflicting some light injuries on the defenders.</p><br/><p>Some witter barbarians lash some of the ladders together, but they were soon spotted and shot. Whenever similar attempts were spotted, they would be promptly stopped. None of the attempts succeeded. Instead, the barbarians soon began to connect the ladders further away from the walls. Though they finally had their ladders, they were shot before they made it up to the walls. The sword-and-shield soldiers, bored to death, finally had a chance to act. They tossed rocks, fuel jars, and torches down the walls. The smell of burnt flesh soon filled the air. Some vomited from the disgusting smell.</p><br/><p>The barbarians' ferocious attack lasted from morning to after noon. The only time a dangerous situation almost came into being was right before they retreated. The enemy had gathered a group of braves to attack the walls all at once. They were surrounded and slaughtered by a group of Ragebear Knights before Lorist could react. As the knights slaughtered the braves one after another, it was as if all the barbarians felt themselves punched in the gut. They let out cry after cry of grief and began to hesitate.</p><br/><p>Soon, the retreat was blown. The horn resounded across the plain. Lorist watched them retreat, leaving their comrades' corpses all over the battlefield. There were so many they were several layers thick in some places. They barely left any room for people to move around. Seeing this, he took benevolent action. He had the ranged units hold fire to the enemy could retreat unharassed. There were an estimated 20 thousand corpses beneath the walls. The battle taught the barbarians a huge lesson. They lost nearly half of the 50 thousand that had participated in that assault. He believed they would not attempt to take the wall again.</p><br/><p>After Lorist gave his order, the area around the wall quieted down. But the silence didn't last long. Cheers soon exploded all along the wall.</p><br/><p>\"We won! We defeated them! We held the wall!\"</p><br/><p>Many exhausted ballistae operators collapsed right away. Many had fired non-stop for the whole battle like autonomous machines. Only after receiving the order to stop did they realize how fatigued they were. They were so worn they didn't feel like moving, even their voices were sore. The only thing they could do was tear up joyously.</p><br/><p>Opposed to the optimism on the walls, pained and grief-stricken cries wafted over from the forest on the wind. They grew ever louder until it sounded like a chorus. It seemed all the more ghastly and sorrowful when night fell.</p><br/><p>Lorist looked at the forest in the distance before gazing at the corpses littering the battlefield. He shook his head.</p><br/><p>\"Maybe the barbarians will know this defensive wall of ours as the wailing wall in the future,\" he sighed at the commander of Ragebear Knights, \"They will remember this staggering loss of life. I don't feel a thing for them, though. If the wall were breached, it'd be our people crying.\"</p><br/><p>After the failed assaults, the enemy army stopped bothering with it. Over the next four days, they only sent several parties to collect the dead's heads. They also took the ballistae bolts. No one dared approach the not or the wall, though. In the end, Lorist ordered two regiments of pikemen and sword-and-shield infantry to move the corpses in the ditch and at the base of the wall to the barbarian corpse collectors under the longbowmen and ballistae's protection.</p><br/><p>After another six uneventful days, Lorist was woken by Terman, who was running and screaming as he approached Lorist's bedroom.</p><br/><p>\"Your Grace! Your Grace! They're on the move! They split up!\"</p><br/>\n</div>"}