{"title": "Chapter 412 Survey", "id": 412, "volume": 5, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-412-survey", "volume_title": "Volume 5", "body": "<h1>Chapter 412 Survey</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Survey</p><br/><p>Hey Everyone.</p><br/><p>Well, today is one of those special days when the universe conspires to crap on you. We just want to wish everyone a lucky Friday the 13th. May you step on all the cracks, spill a the salt, walk underneath all the ladders, see all the black cats, and so much more... and still come out fine on the other end! Here are our team's thoughts on today:</p><br/><p>\"Weird things are supposed to happen on Friday the 13th, right? Maybe I'll take the day off...\" ~ Ryogawa</p><br/><p>\"Don't be supersitious. Nothing will happen on Friday the 13th that cannot happen on Saturday the 14th.\" ~ Prince</p><br/><p>What are your favourite friday the 13th sayings? Do you avoid anything on this particular day?</p><br/><p>Roughly four to five days after the wedding, Lorist brought Sylvia and his four concubines to Cherry Blossom Ridge. Logically speaking, newlyweds should have all the time with each other and it wasn't appropriate to have concubines come along. However, Sylvia had no choice as her body was more sensitive than most and she couldn't handle Lorist's vigor. Every time he reached his peak, she would've long been expended, slumping down like mud, unable to even move her fingers. So, he had no choice but to have his concubines help relieve him.</p><br/><p>He left all his work to Charade when he began his travels and only returned to Ragebear in the snow of the 12th month. There wasn't a choice as the new year's celebration was on the horizon. It was the second celebration organized by House Norton and even more nobles would participate, landed or honorary. They all brought their families and filled up the city streets, bringing an aura of warm merriness during the cold, muted winter.</p><br/><p>The most important part of the celebration would be the entitlement ceremony. With Iblia no more and Winston firmly in House Norton's hands, Lorist could finally realize his promise to the nobles of Delamock. There were 19 noble houses from the province to be enfeoffed land in Winston. As for the 17 Winston noble houses that had defected, they would be relocated to Delamock.</p><br/><p>In contrast to the slightly down Madrasan nobles, the Winstonian nobles were elated. They had defected quickly and mobilized their forces during the barbarian army's attack on Pedro to help out. Also, since Delamock used to be the empire's main food store, its land was fertile and produced three times more than other areas. Those relocated there couldn't be happier. As for the nobles of the now-defunct Madras, they had picked the right side. Not only were they demoted when they were moved to Winston, the land there was also relatively poor.</p><br/><p>Lorist also had to announce the list of House Norton honorary nobles. Most were merchants who had spent money to be given their titles, while others were house officials who had shown decent prowess; Boris, governor of Hanayabarta, Professor Balbo of the gunpowder research lab, Kriston, head of security, and several others. Lorist didn't entitle any landed nobles this time. It wasn't that he lacked candidates. Their contributions, time, or service just weren't enough to warrant it.</p><br/><p>Usually, new year's celebrations would go on for three days. But many of the nobles who came to participate had already purchased houses in the wealthy area of the city. Kenmays had bought a large courtyarded house nearest the duke's manor to use as his residence. It was practically next to the central castle. Following the celebration, Kenmays hosted his own parties at his residence non-stop. As Lorist had said, he preferred silence while Kenmays thrived on merrymaking. He would spend most of the money he earned from the salt merchant committee on events like these instead of developing his dominion and military.</p><br/><p>It took Lorist only a few days of residence in the castle to lose all patience with the noise coming from Kenmays's home. He took Sylvia and his four concubines to Cherry Blossom Ridge and stayed there until after the rainy season when the winter wheat was being harvested.</p><br/><p>Lorist returned to Ragebear and settled in for the spring. Once the spring sowing began he finally went on a tour of the dominion with his lovers. He took his time on the trip, unlike the previous year. He planned to check every location in detail, especially the seven settlements' towns. He also wanted to tour the countryside with Sylvia so she could show herself before the commoners and make her status as the house's matron known.</p><br/><p>The trip was rather costly. They handed out a large silver for each member of each garrison of each town they visited - about 300 thousand gold Fordes' worth. Luckily it had been budgeted for, so it wasn't an unexpected expense.</p><br/><p>As their destinations were quite numerous, the trip took some time. They only reached Northsea in the 7th month. From there, they were ferried to Silowas by a small contingent of the fleet by the same name. During the voyage, Lorist received more details about the war.</p><br/><p>The Union and the mid-southern nations were still engaged in minor skirmishes. However, a few nations' forces had suffered quite heavy casualties. Coincidentally, the three were near the Jigda kingdom. In other words, they were not far away from the Chikdor Merchant Guild's territory. The Union spotted the opportunity and launched a major operation in the area. Their forces came by sea and landed on the border. Within hours they were across the border and pushing everything out of the way.</p><br/><p>Lorf Fustat, general of the mid-southern nations' military, was greatly shocked and launched an immediate counterattack. It managed to force the Union back across the border but the nobility that had lived in the area were already dead. None of the families now had any surviving heirs, save for one of the duchies, who now had but a single princess. Lorf had no choice but to station his troops in the decimated nations to keep the Union at bay.</p><br/><p>Meanwhile, the conflict between the two southernmost nations, Romon and Khawistan, seemed to be escalating. Both sides had launched three large-scale offensives with hundreds of thousands of troops. Both sides had also suffered comparable losses. It had developed into a full-blown war and neither side could now call it off. They were constantly moving soldiers around and the battles couldn't be more gruesome. It was as if they were trying to vent all the hatred of the past two centuries at once.</p><br/><p>Lorist stroked his chin.</p><br/><p>While those involved might be ignorant, we spectators aren't. There must be a scheme behind all this! In fact, it seems familiar... Didn't something similar happen with House Windsor's dominion? The four noble houses around it launched a coordinated attack, and when their forces were mostly defeated, a sudden savior popped out of nowhere to eradicate the aggressors, conquering the dominions of the four houses without much effort. Right now, the conflict between the Union and the mid-southern nations seem to be going down the same path. The three nations' forces were first expended on the frontlines, then the Union launched a surprise attack out of nowhere. Duke Lorf then leads his troops to fend the Union off but the ruling families were wiped out already. He has 'no choice' but to station his troops in these nations now. I bet the three will soon be assimilated into Jigda.</p><br/><p>They're working together!</p><br/><p>When he read the news about the war between Romon and Khawistan, he suddenly had his doubts.</p><br/><p>Why would these two nations go to war, and wipe out Kalia?</p><br/><p>The three each had a swordsaint. Kalia was relatively small but they had managed to maintain the status quo for many years. No matter which side started a confrontation, Kalia would side with the other. Neither faction wished for the other two to mobilize their swordsaints against theirs, so nothing ever came of the stand-offs.</p><br/><p>Romon and Khawistan actually united and wiped out Kalia, and made their swordsaint vanish. Then they go to all-out war? If they hadn't gone to war, they might've been attracted to the war to their north.</p><br/><p>Even Kalia might have tried to expand while the mid-southern nations were in chaos. However, the outbreak of war between Romon and Khawistan allowed one ambitious faction in the mid-southern nations the perfect opportunity to expand.</p><br/><p>The timing was too perfect. Duke Lorf's stationing of troops in the three nations and the inevitable absorption of their territory into Jigda kingdom wouldn't be opposed by anyone. In fact, it couldn't have been more welcome. After all, their enemy was the Union, and the Union had exterminated several of their royal lines. Only Jigda's duke could save them from their peril, so, they hurried to flock to his feet and side with him without hesitation.</p><br/><p>Lorist laughed bitterly.</p><br/><p>This scheme is truly wondrous. First, they incite conflict between Romon and Khawistan and have them tear each other's throats out. The bitter hatred brewed over two centuries won't be extinguished easily. Even if the conflict ends, both sides will be completely beaten up. It'll resolve the worries Jigda might have. They then incite war between the mid-southern nations and the Union and absorb the nations around them. It allows the kingdom to expand its territory and become another one of the superpowers on the continent.</p><br/><p>Lorist had already designated the general, Duke Lorf, the main culprit. It should be expected for the playing field on Grindia to shift greatly after the war. However, he didn't know how ambitious that duke really was. How many among the 20 remaining nations would he swallow before he was satisfied?</p><br/><p>He picked up a folder on his desk, flipped it open, and focused on a particular page. It contained information about some of the alliance's members. The first entry was of none other than Lorf himself.</p><br/><p>Duke Lorf, member of the Jigda kingdom's royal family and chief military strategist. Controls eighty percent of the kingdom's forces. His personal dominion exceeds the entire royal family's. He is known as the non-king king and the shadow king. His first wife passed on many years ago. Currently, he is happily wedded to his second wife, Windsor Prinna. She has borne him three sons and a daughter. The couple is happily married.</p><br/><p>Sol!</p><br/><p>Lorist tossed the folder to the ground with an expression bordering on crying and laughing at the same time. He didn't know what kind of emotion to feel as he recalled the moonlit night. Within the dark room, the girl sat crying as she talked about how she had no choice but to marry the marquis for the sake of her house. Lorist could recall the grief and hate he had felt at the time. He cursed the shallow mistress for suffering misfortunes after leaving him and leaping into the marquis's embrace. It was too bad things hadn't panned out as he had imagined. It was obvious that his first love was living a blissful life.</p><br/><p>Whatever, it's been so long. Maybe that young missy has forgotten me. I have Sylvia, Dilianna, Fennazali, Daisy, and Maria now, why should I feel vexed about a relationship that ended more than a decade ago?</p><br/><p>Lorist smiled at himself mockingly and picked the folder up again. He analyzed the information about the duke. The more he read, the more restless he became.</p><br/><p>Since the duke is so powerful in Jigda, why doesn't he seize the throne and become king? Is he really that loyal to the royal family? Or does he have other reasons for not doing so?</p><br/><p>As he was on a ship, there was no one with whom he could discuss the matter. So, he put the thought in the back of his mind and had Jinolio archive the reports. He stepped onto the deck and saw Sylvia and his four concubines ordering the guards to toss the fishing net into the sea. Even though the ship was currently sailing, it didn't stop the net from being cast. Sometimes, there would be surprising catches. For instance, sharks lured into the trap by beef.</p><br/><p>They arrived at Silowas three days later. Pajik and Hector had already been waiting in the harbor. After Lorist surveyed the garrison, Pajik reported something that surprised him. Blademaster Shuss, who had been training in seclusion in Seaview Manor, felt the time had come to advance a rank. He had taken his sword and entered the volcanic areas of the island alone. If he succeeded and broke through to become a rank 2 blademaster, he would naturally return. If he failed, he would not.</p><br/><p>Lorist knew blademasters took quite a long time to make their breakthroughs. At the very least, it would take a year. It required summarizing one's insights and identifying one's weaknesses. During that process, the blademaster would continue training and refining his insights and feel for the next step to advance his swordsmanship. Blademasters usually headed to desolate, uninhabited places or harsh environments. It wasn't just a form of physical training, it allowed them to better attune to the changes in nature and gain inspiration to incorporate into their swordsmanship for further advancement. Since Shuss had picked that path, Lorist could only pray for his success.</p><br/><p>He stayed at Silowas until the end of the 8th month. This time around, they would survey the eastern regions where Jaeger, Tigersoar, and Firmrock were. Out of Lorist's expectations, Jaeger's men weren't the least bit averse to Sylvia. In fact, they cherished the commemorative medals with which Lorist had come up. Who wouldn't cherish gold commemorative medals that could be traded for three gold Fordes?</p><br/><p>When he finished his rounds and returned to Ragebear, it was already the 11th month of Year 1780. A year had passed in the blink of an eye. The dominion had truly grown too great. Before he could get two day's rest, Charade barged inside</p><br/><p>\"Your Grace... out of seclusion...\"</p><br/><p>\"What? What part of me got out of seclusion?\" asked Lorist, confused.</p><br/><p>\"No, not you...\" Charade recovered his breath.</p><br/><p>\"His Majesty! He came out of seclusion after breaking through to become a rank 1 blademaster!\"</p><br/>\n</div>"}