{"title": "Chapter 423 Stalemate", "id": 423, "volume": 5, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-423-stalemate", "volume_title": "Volume 5", "body": "<h1>Chapter 423 Stalemate</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Stalemate</p><br/><p>\"The only true fool is the man that thinks his enemy an idiot.\" ~ Kenmays</p><br/><p>Mountains, rivers, plains, hills, plains, mountains, Egret Swamp...</p><br/><p>A brief description of the terrain in Farkel and Forund now occupied by Andinaq could be no other way. In more than a month, the map had almost been torn to shreds multiple times. Heated arguments broke out all the time in the incessant military councils. The nights of non-stop brainstorming for new ideas tired out many of the higher military officials. Nothing, whether it be probing or reconnaissance, helped the situation.</p><br/><p>The four central duchies had been famed for producing the most elite infantry troops in the empire. The terrain was rather hilly, which only served to complement their strategy: defense. While they lacked cavalry, should the war continue dragging on, it would only continue to sway further in their favor. The first prince, who led an army of 100 thousand against the four duchies, had been entangled for three years and eventually retreated having suffered almost complete casualties. This allowed the duchies to invade Majik and force the prince to sue for peace.</p><br/><p>It wasn't that Auguslo had never thought of aiming for the hills. The current problem was that, among the troops on their side, the only ones suited for battles in the mountain were Count Shazin's two light infantry divisions, just 20 thousand men. There was no way a force that small could carve a path through the enemy lines. Whitelion and House Kenmays's two heavy-armored divisions were equipped with heavy armor. While they were great for besieging castles and defending them, having them scale the hills and travel across wetlands was futile. Even if they made it they would be too exhausted to fight. Nobody could cross the large river on Forund's borders as no one had any naval troops in the area. Boats could only ferry a few soldiers across at a time, and they were easy targets. The construction of boats would also be rather costly.</p><br/><p>Auguslo's plan to attack the four central duchies was originally centered around using cavalry to sweep across the plains and taking the initiative away from his enemies before waiting for the heavy-armored legion's arrival to conquer the citadels and towns. He had wanted to exterminate the duchies in one go and capture the traitorous dukes. That was the main reason he gave for having Duke Fisablen submit.</p><br/><p>However, nobody would expect that Duke Forund and Duke Farkel would dig so many trenches and erect mud walls to widen their defensive network. It completely warped the plains and rendered cavalry useless. The trenches even neutralized House Norton's siege weaponry as well. It seemed from the current situation that there was no way to continue apart from filling the trenches patiently.</p><br/><p>Auguslo was incredibly dissatisfied and had launched a few probing attacks on different locations no avail. The results were the same. Facing them were endless stretches of trenches and mud walls. Even after Lorist handed over control of one thunderbolt brigade, they still couldn't break through.</p><br/><p>As Lorist had said, \"There's no target to strike. What would you be demolishing with our catapults?\"</p><br/><p>When Auguslo discovered that no matter which location he attacked, the enemy would move through the trench network to reinforce it, he finally gave up and wiped the thought of more offensives from his mind. After returning to the camp, he stayed in his tent to brainstorm in hopes he could find a way to break through the current obstacle. The only reasonable method available was suggested by Kenmays. He had come up with it based on how Auguslo crossed Cloudsnap Mountains in the snow to attack Redlis and conquer Frederika. Kenmays believed they could launch a sudden attack in the dead of winter through Egret Swamp, which should be frozen over at that time. As long as they crossed the nameless mountains and hills at the side of the swamp, they could quickly arrive at Farkel's capital, Freimox. If they took the city, the rest would follow.</p><br/><p>Kenmays's suggestion made the others see him in a different light. They didn't think a duke from a merchant family could actually have a talent for matters of war. It was truly shocking. But Lorist soon shot down the suggestion. The three remaining duchies understood Auguslo well, what Kenmays had just suggested would definitely occur to them as well. The king's reputation was practically built on launching surprise attacks; the enemy would definitely pay attention to Egret Swamp in the winter and further reinforce their weak points. They could be forced to return without achieving much, or, in the worst case, be caught in an ambush. Not only would it make them suffer huge casualties, it would reinforce the enemy's confidence and resolve.</p><br/><p>Kenmays wasn't satisfied at first and argued that the enemy probably wouldn't be so thorough, but he knew Lorist was right the moment he witnessed the acknowledging gazes of Duke Fisablen and King Auguslo. The only true idiot was he who considered his enemy an idiot. Duke Handra, Duke Farkel, Duke Shabaj, and Duke Forund were all elite tough nobles who had far more experience in conflict. They were obviously not as careless as he was suggesting.</p><br/><p>Duke Shabaj's defeat was thanks to Lorist's sudden moves. His capabilities could already be seen from how he decisively abandoned Messen and escaped for Farkel without Tigersoar and Shazin's two light cavalry divisions able to do anything about it. Had he been a day late or had he stubbornly continued his course, it would have ended up completely differently. He would have either died in the final battle or ended up a prisoner of war.</p><br/><p>Actually, Kenmays's suggestion to attack Egret Lake and head to Farkel's capital had already occurred to the others long ago, and they had given up on it for the very same reasons. The other reason was that it was still only the end of the 10th month. There were at least two months to wait before Egret Swamp would freeze over. The military expenditure for 300 thousand troops over the course of two months during the cold weather was astronomical. The food they managed to obtain from Shabaj was already running out and they would have to bring in even more. It was not only a huge undertaking but also a troublesome effort.</p><br/><p>The main mechanic of war was logistics, and should they emerge victorious, there would be profit to gain. The food they obtained at Shabaj would at most sustain the army for a month. Nobody had expected they would be stopped in their tracks as they had been. Their original plan was to live off the resources they obtained. But most of the food had already been expropriated. Shabaj had been cleaned. And there was the fact that Auguslo had to provide for the 200 thousand civilians being moved away given his position as king. He couldn't just leave them alone, so that would have to factor into the total food consumption.</p><br/><p>So far, Camorra was stationed in Messen and used the place as a logistics outpost. All resources transported by any house would be kept there. The food Auguslo had no longer had to go through a long way to arrive from the imperial capital. The route stretched straight through Egret Swamp and passed Rimad to arrive at Messen. Lorist was faring rather well in that there was still a lot of resources he could ship over from Windbury through the same route from Southern, to Rimad and Messen. Duke Fisablen and Shazin shared the same situation in that the distance to transport food was great, so lots of it would be consumed along the way. It was already quite impressive for sixth-tenths of the food they made out with to end up there. The one in the worst position was Felim. His dominion had just begun to develop. With the 500 thousand civilians forced to move there, he already had to rely on Lorist for transportation costs and food for the move. He didn't have any vigor left to press the attack.</p><br/><p>Duke Fisablen suggested they retreat temporarily and wait for another opportunity to attack in the future. It didn't mean they would give up on Jigzai. They would leave a cavalry legion behind to hold any attacks off and retaliate. When he made his suggestion, he gave Lorist a look and obviously hinted that Tigersoar was the best candidate. 'If Farkel and Forund see our troops retreating, they might want to reclaim Shabaj. At that time, having a strong force like Tigersoar counterattacking would be a great blow' was the gist of it.</p><br/><p>Naturally, since Tigersoar wasn't a light cavalry legion and was thus slightly limited in their mobility, Duke Fisablen was willing to leave his reserve legion behind as well. If there were any who disobeyed Lorist's orders, he could do with them what he pleased as well.</p><br/><p>While Lorist didn't really understand the reason the duke made the suggestion, there was something lurking beneath his actions. But before he could figure out what, Auguslo announced their war council would recess for a while. He would consider Duke Fisablen's suggestion and give his answer in two days.</p><br/><p>After leaving the tent, Lorist sought the duke out to ask about the suggestion and was even willing to leave reserve legion under his command.</p><br/><p>\"There's no helping it. It's for the bigger picture. I can't allow this to go on. We'll retreat and lure the snake out of its hole. I believe you can deliver fast results. Even if they don't come out, don't worry. Hold them there for three or four years. The remaining three duchies will be unable to sustain the costs of defense and might crumble on their own.\"</p><br/><p>\"Old guy...\"</p><br/><p>As the duke walked away, Lorist thought, That darned fellow is trying to keep me here at Jigzai for a few years so I don't cause trouble in The Northlands. That's why he's even willing to let me command even the reserve legion...</p><br/><p>However, he still couldn't help but spit in spite. The reserve legion was wholly grassland barbarians. Even if he wiped them all out, the duke wouldn't be bothered. While the legion wasn't that important, it would still make Lorist owe him a favor.</p><br/><p>He didn't imagine Auguslo would overthink the duke's suggestion. While he understood the current situation and knew retreating was the most rational choice, the fact that he couldn't accomplish much during this war frustrated him greatly. He was really unwilling. Then came Duke Fisablen's suspicious suggestion.</p><br/><p>What's this? Has Duke Fisablen really made peace with Lorist? Why else would he be willing to hand his reserve legion over? The grassland barbarians are wild and disobedient and listen to nobody apart from the duke. Yet, he's going to hand it to Lorist just like that? Did they come to some kind of agreement? Do they have some scheme in mind?</p><br/><p>It was as if Auguslo had developed a phobia for ropes after being bitten by a snake. When he was being restored to the throne, he fell for the alliance's scheme and lost Delamock, Sidgler, Winston, and Southern. The mere thought of it made him feel as if his heart was being cut open. He had even been the one to propose the agreement.</p><br/><p>Thinking back, he felt great regret and wanted to cut off the hand that had signed the agreement. While the four provinces hadn't been under his control, as he saw it, he should be the one to control them after reuniting his empire and leave his name in the annals of history as a great emperor. The agreement he signed was the largest humiliation in his entire bright career. So, to him, the alliance's conquest of Iblia and Madras was not an honorable contribution, but a sore slap to his face instead.</p><br/><p>Even if he admitted Lorist was the best choice to leave behind and keep the three duchies engaged, it didn't feel right for him, who couldn't understand the reason Duke Fisablen had suggested Lorist. If he didn't have answers, he couldn't calm down. The suspicion he had about Lorist and Duke Fisablen aiming for the duchies made him delay the announcement more than three days.</p><br/><p>Lorist didn't plan on staying in Jigzai for a few years either. He decided that if Auguslo really wanted Tigersoar to remain, he would leave it to Loze. He brought Loze to a hill just behind the front line to check on the situation and told Loze about some tactics he could use to deal with retreating enemies.</p><br/><p>\"Do you think we can attack a front like this?\" asked Lorist.</p><br/><p>Loze shook his head.</p><br/><p>\"Your Grace, this is completely impregnable. I suspect this system is designed specifically to counter Tigersoar's ranged weapons and cavalry. The duchy's infantry are moles; they burrow underground all the time. With the mud walls' cover, we can't figure out their deployment. Usually, knowing the enemy's deployment is a great advantage to the attacking side. Also, we are cavalry troops and the enemy are trench-dwelling moles. As long as they stay in their holes and tunnels we can't do much.\"</p><br/><p>Beside them, Dulles, colonel of the carroballista division, spoke.</p><br/><p>\"Your Grace, our ballistae are completely useless in trench warfare. It's better to use the old style mangonels. While those don't shoot far, their shots are quite powerful and their smaller size also makes them more convenient for use in trenches like these. Our current ballistae are completely useless against these entrenchments. Our ballistae have always been famed for being able to fire further, stronger and more accurate shots, but now they are completely useless. I can't help but wonder if our research has gone down the wrong path... What would we do in the future if our enemies use these tactics again? This is troubling.\"</p><br/><p>Lorist patted Dulles's shoulder.</p><br/><p>\"Worry not, this is but an exception. The reason Forund and Farkel can set up such a formation is that we've given them time to mobilize their civilians. The duchies always had elite infantry, so they excel in terrain like this. If any other nation copies this without any elite foot soldiers, it would be a fool's errand and they'd just be wasting their manpower and resources.\"</p><br/><p>\"If Lord Potterfang were here, maybe Firmrock could breach their lines by attacking from within the trenches,\" said Loze.</p><br/><p>Lorist remained speechless. Firmrock was currently stationed at the border with House Fisablen's territory as its main defense. There was no way he would mobilize them. That aside, even if he did, they would still have to pay a huge price to breach the enemy's line. He didn't want to lose so many men for Auguslo's sake.</p><br/><p>\"Maybe we can wait for winter. When the snow falls and fills the trenches, we can rely on sleds and snowboards to cross the fortifications,\" suggested Dulles.</p><br/><p>\"Are you an idiot?!\" Loze rebuked, \"Since when has snow stacked up to over two meters? These trenches are at least two or three meters deep! What kind of snowstorm would we need to fill the trenches?!\"</p><br/><p>\"W-well, we could wait for the rainy season... When the rain pours over the trenches, the mud here won't be able to hold its shape,\" countered Dulles with dissatisfaction.</p><br/><p>\"Wouldn't we have to be rained on as well?\" said Loze as he knocked Dulles on the back of his head.</p><br/><p>\"Wait, what did you say?\" Lorist snapped suddenly before he laughed, \"Return to camp at once! I know how we can breach the lines.\"</p><br/>\n</div>"}