{"title": "Chapter 453 Hostage", "id": 453, "volume": 5, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-453-hostage", "volume_title": "Volume 5", "body": "<h1>Chapter 453 Hostage</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hostage</p><br/><p>\"There can be no negotiating with idiots.\" ~ Norton Lorist</p><br/><p>\"Good news, Your Grace. Blademaster Shuss is back...\" said Jinolio with ragged breath as he rushed into the study with a white silk cloth.</p><br/><p>It was an eagle message from Silowas.</p><br/><p>\"Let me see it,\" said Lorist, shooting to his feet.</p><br/><p>Shuss, who was guarding Silowas, went to the island's mountains four years earlier to break through. He left a letter saying he wouldn't return if he couldn't become a rank 2 blademaster. While Lorist was worried, the recent war broke out soon after he left. He didn't have any time to visit the island since his return. He forgot about the old man. He couldn't be happier to hear Shuss was returning.</p><br/><p>The letter was penned by Baron Hector and Pajik. It said the fire crystal foraging team on its way to the volcano angered the white-headed sea condors. They were surrounded and attacked when Shuss showed up and killed their seven attackers. The report said he broke through to the second rank two years earlier but had stayed in the mountains to stabilize himself. He bumped into the team and helped them. He would join Lorist in a few days.</p><br/><p>Apart from Lorist, the house also had Engelich and Shuss, both blademasters. Reidy was also now equal to a rank 1 blademaster. Lorist didn't include Engelich in his force count, however, the old man was a coward and wouldn't ever be of any real use. He wasn't just living in 'retirement' at his home, not contributing to the house at all, he pushed every once of responsibility he could onto others. Besides, he had grown so weak even Reidy could defeat him now.</p><br/><p>In contrast, Shuss used to be a dueling slave in Hanayabarta. He spent years struggling to survive, living in slaughter. His bloodthirst and killing intent were among the strongest Lorist had ever encountered. Even as a rank 1 blademaster back then, he was on equal standing with a rank 2 blademaster. His breakthrough added substantially to House Norton's might. He was the best sparring partner for Reidy, at the very least.</p><br/><p>......</p><br/><p>Tarkel entered the study with a large stack of documents.</p><br/><p>\"Your Grace, something big's happened in the war in the south,\" said he the moment he was inside.</p><br/><p>\"What's wrong?\"</p><br/><p>The war was in its fifth year, yet nothing had changed in the last two. The nations to the south of the war-zone, those being led by Jigda, were completely disorganized. The union swallowed up three and turtled. Everything was peaceful on the border, like there wasn't a war.</p><br/><p>\"Romon and Khawistan signed an armistice not too long ago. The fighting there has ended. Khawistan suffered slightly more and gave up a part of Kalia's land. Their new border is the Kesarubi River. Back with the Union's war, Jigda swallowed seven nations stormed by Union forces. Their territory has doubled. They now rival Romon in size. Some of the remaining 13 countries finally woke to the scheme. Jigda and the countries suspicious of its intentions are now at war. The coalition army disbanded as a result.</p><br/><p>\"The Union signed a peace treaty with Jigda and recognized their sovereignty over all the land they now control. All the trade routes are now restored, and they signed a mutual defense agreement. Other than that, the Union gave Jugda a 15 million gold Forde loan, without interest. Our informants have yet to infiltrate their internal councils so we don't know too much.</p><br/><p>\"The 13 remaining independent countries are split into two factions. The five neighboring the Union have formed a union of their own, called the Morunzik Union of Kingdoms. They're preparing to negotiate peace with the Union. Maybe they think they can't keep fighting the Union and are trying to protect themselves? Either way, they want to end the war.</p><br/><p>\"The eight countries nearest Jigda will continue to fight. They made Jekhano's first prince, Yorksem, their new commander-in-chief and are launching a new campaign against Jigda. Duke Fustat is in command on the other side and is leading 100 thousand men against the former's 140 thousand. They're expected to clash in what used to be the kingdom of Odma. We expect it will be another stalemate.</p><br/><p>\"Lundmorde is still in Jekhano with that prince. Also, the Union have yet to reinforce Jigda per their treaty. They've sent out envoys to negotiate peace instead.\"</p><br/><p>Lorist choked on his tongue and laughed. What a joke! Who would have imagined this? It was flabbergasting. The initial 24 countries that formed the coalition had united against the Union. But now Jigda had betrayed them and eaten up at least a third of the coalition. Rather than unite to pool what strength they had left they turned on each other. The coalition was now two broken factions. To top it all off, the Union was now playing the nice guy? How laughable! Nobody could make this prediction when the war started, hell, nobody could predict this three months ago. They might as well just have skipped the fighting altogether. Just sit around a table and negotiate a few concessions.</p><br/><p>Lorist walked over to the map of the continent hung on one of his study's walls. He updated it with a pencil to match the information Tarkel had just given him. Jigda's current size took Lorist aback. This was the most complex and impactful plot he'd ever seen.</p><br/><p>\"What is it, Your Grace?\" asked Tarkel.</p><br/><p>Lorist shook his head.</p><br/><p>\"See this? You were right. This whole war was just a farce. It's finally been exposed, but it's too late, Jigda is one of Grindia's superpowers. The guy who came up with this must be a genius...\"</p><br/><p>\"But, Your Grace,\" Tarkel said with some dissatisfaction, \"Don't you think this was a little rash, absorbing seven countries? Everyone now knows what Jugda is up to. They can't do this again. It feels a little to bumbling to have been carefully planned out. They should instead have simmered their prey and taken them in slowly. They wouldn't be facing any backlash that way.\"</p><br/><p>\"You're wrong. Your suggestion will only work if Romon and Khawistan kept fighting. Unfortunately, the two countries are at peace. They'll go after Jigda the moment they recover.</p><br/><p>\"Jigda can't keep fighting in the north. They must focus on stabilizing their gains and building their military strength back up. If not, there's no way they can stand up against the two empires when they invade. They forcefully absorbed the last seven countries so they can prepare for the inevitable invasions as soon as possible. The relationship between them and the Union is also very obvious now, so it's best that the Union sends no reinforcements. If they did, the remaining countries in the coalition will fight even harder to spite them and the war will just drag on.</p><br/><p>\"This is the only reason the Union is sending negotiators. It's the best move they can make. This will save Jigda's strength so they can better resist Romon and Khawistan. If negotiation go well, the coalition will also form a deep grudge against Jigda, so they won't make as much trouble for the Union. The Union at least fought them openly and honestly, Jigda is a snake, a traitor deserving of all the contempt in the world. This will also make sure that Jigda won't have any energy to spare to have plans for the Union.</p><br/><p>\"Despite Jigda becoming a superpower and gaining a lot of land, they didn't really get much. They now have a lot of territory with people that hate them, they are the sole opposition to two empires, and have at least eight countries in their backyard that hate them and can't wait to get in a good jab. The Union, they are the real beneficiaries of this whole debacle. They got three countries' territory, force the trade routes to open again, and got a strong buffer between them and Romon and Khawistan. The coalition are the real losers. They lost half their countries and are now split in two weaker factions and have another superpower on their borders.\"</p><br/><p>Lorist 'tsked' audibly.</p><br/><p>\"They're all burning the midnight oil, huh? None are idiots. Tarkel, increase our surveillance on the Union and Jigda. Try to find the mastermind behind this.\"</p><br/><p>\"Understood, Your Grace.\"</p><br/><p>......</p><br/><p>Jinolio entered the room with a gold-gilded invitation card.</p><br/><p>\"Your Grace, Duke Kenmays sent an invitation to the summer party. It'll be on the 15th day of the 8th month at Platinum Beach.\"</p><br/><p>Lorist suddenly remembered Kenmays wanted to build a grand palace there. He wanted to make the beach a tourist destination. So he had finished the palace and was now holding the opening ceremony...</p><br/><p>I must attend. There're two months before the party. I have nothing better to do. Might as well go and relax. Oh, I should bring Sylvia, the girls, and the kids as well!</p><br/><p>\"All right. Tell him I'll bring the family along,\" answered he.</p><br/><p>\"Yes, Your Grace. Will you travel by ship?\"</p><br/><p>Lorist shook his head.</p><br/><p>\"I'll go by land. I'd like to visit the Dina barony along the way.\"</p><br/><p>Arriotoli had given birth to a son named Dina Terryke almost exactly a year ago. She wrote Lorist saying the kid would be turned into the most impressive knight in the history of her house and Lorist had no say in the matter. He could only pray the kid would survive his mother's demonic claws.</p><br/><p>\"Understood. When will Your Grace leave?\"</p><br/><p>Hasty footsteps stopped Lorist's reply. A moment later Howard burst into the room.</p><br/><p>\"Count Lower's whole family's been captured!\"</p><br/><p>Count Lower? Who's that? wondered Lorist.</p><br/><p>Howard caught his breath and explained. Count Lower wasn't a member of the house. He was a noble from the capital. He'd bought his title of count from Auguslo several years ago. The count moved to The Northlands when he realized he couldn't do business in the capital and had even bought a commiserate title from the house. Lower had decent instincts. He had quickly realized House Norton's shade was a lot better than the king's.</p><br/><p>He moved to The Northlands five years ago and bought a plot of land in the second special noble district. He also partnered up with a few people and built several factories and even started a merchant guild. It specialized in leather, wine and other foodstuffs. His factories were already well-established when Duke Fisablen made his massive order two years ago and got the biggest slice of the pie. He had trouble finding places to store all his gold. His business expanded rapidly and his partnership soon had ten more factories.</p><br/><p>Unfortunately for him and his partners, Lorist announced that the volume to be traded with House Fisablen would be cut in half overall, daily necessities was the section hardest hit. The coming years would be hard for the count.</p><br/><p>While the factories could be closed and skilled workers fired, their money lay in warehouses as products that could now not be sold. This story rang true for most merchants all across the duchy. They either had to sell at trash prices, or hope to sell things off over several decades.</p><br/><p>Charade's revamp project was also now in full swing. He closed many duplicate production units and arranged new jobs for the fired workers. His efforts were showing signs of stabilizing the duchy's economy. Their swift action limited the damage to the merchants.</p><br/><p>Lower had made the choice to keep his produce. He hired a mercenary band to keep watch on his warehouses, but most of them were killed off during an excursion to hunt ironspine crocodiles. They demanded he compensate them for their losses but he had no money. A fight broke out and the band had taken the entire family hostage.</p><br/><p>\"Baron Ovidis and the local garrison have surrounded the manor and Sir Charade will be on-site shortly. The mercenaries insist that they won't let anyone go until their ransom is paid. They even demanded we leave, apparently this has nothing to do with the house,\" reported Howard.</p><br/><p>Lorist quietly took his sword.</p><br/><p>\"Let's go look,\" said he.</p><br/>\n</div>"}