{"title": "Chapter 464 Surprise Attack Ongoing", "id": 464, "volume": 5, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-464-surprise-attack-ongoing", "volume_title": "Volume 5", "body": "<h1>Chapter 464 Surprise Attack Ongoing</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Surprise Attack Ongoing</p><br/><p>\"Fate is fickle and wretched. It robs a man of is friends and swamps him with enemies. Some, it even turns from friend to foe. And the worst part of it all is that man makes his own fate.\" ~ Norton Lorist</p><br/><p>The wooden houses in the distance burned brightly. Crimson streaks stained the white ground. Pained cries echoed out of agonized mouths and mixed with the wailing winter wind.</p><br/><p>The last three days' heavy snow had stopped just in time to fail to cover this horrid scene. A few streaks criss-crossed the thick clouds, giving glances of the blue sky; Needles of sunlight mocked the world below.</p><br/><p>Lorist's expression gloomed at the hut in front of him. 173 Tigersoar soldiers' bodies lay in neat rows on the ground in front of them. Many were missing limbs and several had severe wounds on their torso. Their crimson-stained bodies were tragic against the pure snow.</p><br/><p>\"What happened here? How could a ruddy manor cause so many casualties among my men?\"</p><br/><p>Pale words seeped out through the gaps between Lorist's teeth. Who knew what kind of fire burned in his heart?</p><br/><p>\"It's my fault, Your Grace,\" Dulles said as he stepped forward, \"We didn't expect this old manor to be Baron Abott's dominion, the one Sir Tarkel warned in his list we should be extra careful about. He used to be the Union's 21st-ranked mercenary band's vice-captain. He was a gold-ranked know as 'Goldeagle'.</p><br/><p>\"One of the troops from a scout company discovered this run-down manor. None of us associated it with Baron Abott. They rushed in to force its occupants to surrender, but found the baron and his knight inside. The entire company was wiped out.</p><br/><p>\"Baron Abott prepared to attack us, but we caught up too quickly. We lost 421 people in total, 173 of them lie here, dead. The baron only lost 70. Everyone's been beheaded.\"</p><br/><p>House Norton's military units were divided into squads of ten, their leader a sergeant. Ten squads made a company, their leader a lieutenant. Per the house's winter protocols, the scout company would watch a spotted target from afar undiscovered while it waited for the main force to attack.</p><br/><p>Furybear finished their investigation of Anderwoff's nobility more than a year earlier. Their informants donned various disguises and roles and scoured every corner of the region. They recorded everything, from the number of the noble's men, to the daily routines of their servants. Tigersoar only needed to look through Tarkel's list and act accordingly and the region could be taken in a few weeks.</p><br/><p>The only mistake they'd made so far was the one currently being confronted. The baron was marked as a target of concern requiring caution because of his retinue's size, but three days of incessant snowfall made it almost impossible to match map to land. So, despite his mansion being marked on the map, no one realized the unassuming hut was his residence.</p><br/><p>Most people assumed all decent nobles lived in stone castles, so no one thought the little wooden motte-and-bailey castle would belong to Baron Abott. At best they thought it belonged to an inconsequential, broke minor noble. It might possibly even just be used as whilst the noble hid out the winter in the nearest large town. Given their disposition, the officer launched an attack without proper preparation or consideration.</p><br/><p>When the soldiers rushed in, the baron and his knight fought back ferociously. The two-star gold-ranked baron, his three-star silver-ranked knight, and his one-star iron-ranked treasurer massacred their attackers. The group realized their mistake too late and were slaughter to a man. The three broke out of the hut, immediately rallied their men and attacked the rest of the company.</p><br/><p>Fortunately, the reinforcements arrived at almost the same time. They arrived as the baron was killing the last of the scouts, he had yet to find out who was attacking. Seeing their comrades' corpses, they returned the favor with furious gusto.</p><br/><p>The first squad to arrive couldn't match their opponents and lost quite a few men initially. The situation quickly stabilized as more reinforcements arrived and soon the tables turned. The three men were finally overpowered when about a hundred more had arrived.</p><br/><p>Lieutenant Dulles's arrival was the final straw. A gold rank himself, Dulles ignored the baron's attempts to surrender and beheaded him on the spot. The knight attempted to escape but was skewered by the just-arrived ballistae. Out of all the men, only the treasurer was taken captive, barely alive.</p><br/><p>\"Goldeagle Abott...\" Lorist stared at the corpse. He recognizes the face in spite of its state.</p><br/><p>The old man could be considered an old acquaintance. Lorist's first paycheck was related to him, in fact. He, Charade, and a few friends had gathered some capital to have some modern rucksacks made and sold at the mercenary guild. Some rowdy mercenaries wanted to buy them at an extremely low price. Goldeagle Abott had stepped in and helped them. He paid a huge price to buy all their remaining rucksacks and also made an order for another batch.</p><br/><p>Lorist was out of contact with the house at the time and had to work as a lowly bronze-ranked mercenary for his semester fees and living costs. The rucksacks were one of the means he'd used. If not for Abott's intervention, he might've been beaten alongside Charade.</p><br/><p>Two decades later, because of a twist of fate, Lorist's benefactor, had become an enemy and was now dead, killed at the hands of his beneficiary's men. A long sigh escaped Lorist's mouth, but he remained silent. He made sure Dulles gave the man a proper burial before leaving.</p><br/><p>On the 27th of the 12th, Year 1786, Lorist's Tigersoar used the strong snowfall to occupy the whole of Anderwoff without Wessia's knowledge. Frederika was in a festive mood in preparation for the new year's celebration.</p><br/><p>Given the surprising number of casualties in the operation — mainly from the Abott incident — Lorist decided to slow down and take the necessary precautions going forward. He reached Frederika only on the 21st of the 1st.</p><br/><p>\"We've arrived, Your Grace,\" Potterfang and Malek shouted as they rushed over.</p><br/><p>They were gathered in a large snow-made dome. It was indistinguishable from the terrain at a glance. Many of these 'mounds' dotted the hillside, connected by ditches and tunnels dug into the white blanket covering the land. Men could move without anyone on top knowing any better. They would only be discovered if someone quite literally stumbled over or into one of their constructions. A large tent filled the inside. Eight braziers filled its corners, fueled by smoldering coal.</p><br/><p>\"How are things coming along?\"</p><br/><p>Lorist removed his furs, handing them to Jinolio, before motioning for the rest to take their seats.</p><br/><p>Potterfang brought out a map of the capital and lay it on the wooden table.</p><br/><p>\"This will be a tough battle,\" he commented, his expression solemn.</p><br/><p>\"How so?\" asked Lorist.</p><br/><p>\"Wessia completely reworked the city's defenses. Most of the layouts we have are completely useless now.</p><br/><p>\"We've investigated as best we can. The city is split into five districts. The center is the inner-city district, where the palace is. It's now surrounded by a high wall. The eastern district houses the high-class' residences, the southern district holds most of the city's industry and commerce, the western district contains most of the military, and the low-classes live in the slum of the northern district.</p><br/><p>\"The city used to have 200 thousand inhabitants, but after the king's attack several years ago, that dropped to 100 thousand. Most now live in the slums and serve their Union overlords. Wessia clearly considers Frederika crucial. They use it to store most of their wealth, especially that taken from the region. They've split up the region up between 37 new nobles. We don't have to worry about their forces in the city as long as we take them by surprise, but that's the issue. The castle has several good lookout points that can keep an eye on most of the city and all the approaches to the castle.</p><br/><p>\"Wessia has taken Frederika's previous fall very serious and have made adjustments to make sure it can't happen again. We've noticed all their properties light torches every 10 days. It must be a way to check whether a place has fallen to an enemy. We've waited for your arrival rather than attack on our own when we can't finish everything in one go.</p><br/><p>\"The city itself has a 45 thousand strong garrison. The nearby fortifications can reinforce the city with a further 18 thousand within a few hours though. We've confirmed Sir Tarkel's report; they do indeed have four blademasters, though only one, maybe two, are in the city. One is stationed in the city specifically, the second protects the guild president, so his presence or absence depends on whether the president is in the city or not. Of the other two, one is guarding the guild's properties in Morante and the other is with the forces they've deployed to Jigda. The ones guarding the guild's properties are new recruits.</p><br/><p>\"We noticed most of the city's inhabitants are still active. Their clothes aren't as good as ours, but it's enough to let them move and work outside despite the cold. The city walls' defenses are also tighter than the castle's. The walls are patrolled every two hours, and each tower is manned. We don't have a good chance of slipping in undetected.</p><br/><p>\"We've set up camp so far from the city so we won't be discovered, if not for their tight defenses we would have done so much closer. We've sent out three divisions to set up positions all around the city. When we're joined by Tigersoar, we will be strong enough to attack.</p><br/><p>\"We don't have any elegant solutions to taking the city. Brute force is the only real option. I'm concerned even now Wessia might realize something's amiss and rally their 50 thousand miners. If they do, we won't be able to take the city without a protracted siege.\"</p><br/><p>\"Is the secret path His Majesty used still an option? Can attack through there?\" Lorist enquired.</p><br/><p>Potterfang shook his head.</p><br/><p>\"I've already taken a look. Lady Glacia gave us an accurate map, but Wessia found the tunnel and sealed it. It's not an option.\"</p><br/><p>\"Let's leave things at that for now. We'll discuss our plan of action after Tigersoar catches up. They should be here in two days.\"</p><br/>\n</div>"}