{"title": "Chapter 479 Awakening", "id": 479, "volume": 5, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-479-awakening", "volume_title": "Volume 5", "body": "<h1>Chapter 479 Awakening</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Awakening</p><br/><p>Please read an announcement here to find out how you can enjoy an early access chapter of TRL by participating in a competition!</p><br/><p>On the 11th day of the 7th month, Year 1787, King of Andinaq Auguslo I gathered his million-man army to reclaim the provinces of Anderwoff, Bodolger, Kanbona and Northwest (the northwestern area). As their troops approached the border of the Union, they demanded the Union to return the territory formerly belonging to the Lormo duchy, Armenia and Malivia, to Andinaq so that the empire could once more be reunited and refounded.</p><br/><p>After the 100 thousand reinforcements sent by the Union to Kanbona was destroyed by the Norton forces of Andinaq, the Union successfully hurried the signing of the peace treaty with the midsouthern nations and recalled the six armies of the big six guilds from the midsouthern nations. They also ran a recruitment drive for a garrison force and also requested their ally, Jigda, to send reinforcements. They managed to gather an army of approximately 500 thousand to stand off against the Andinaq army at the border.</p><br/><p>On the 13th day of the 8th month, the Union sent an envoy to Whitelion's camp in the name of discussing a peace treaty between the Union and Auguslo I. Auguslo I was elated by the news and set up a 5-kilometer-long path of peace to express his sincerity during the welcome of the envoy.</p><br/><p>However, the king who had his mind completely on the peace talks didn't think that the Union only pretended to send a team of envoys over. Instead, they also secretly included the windstorm swordsaint among the ranks in an attempt to hustle the king and the kingdom's nobles to travel to Morante and sign a humiliating agreement of surrender.</p><br/><p>During the negotiation process, the Union suddenly had their forces travel in five different routes to attack Andinaq's army camp. Counting on the fact that Auguslo I and the kingdom's elite were being held up by the windstorm swordsaint, they planned to take advantage of the fact that the army was without any leader to cripple it and remove the threat it posed to the Union.</p><br/><p>If things went according to plan, then Andinaq would never pose any threat at all to the Union in the coming century. The kingdom's economy might even fall into the Union's hands. But what nobody expected to happen was that during the most crucial moment, Duke of The Northlands Norton Lorist stood up against the windstorm swordsaint and those two fought till the both of them were heavily wounded. The windstorm swordsaint made a haggard escape with heavy injuries and was said to have needed more than three years to completely recovered. That led to the failure of the Union's plan to kidnap Auguslo I and the nobles.</p><br/><p>Having suffered the five-pronged attack from the Union's army, the Andinaq army experienced great casualties in their unprepared state and retreated immediately. However, House Norton's Firmrock remained to secure their camp and managed to use the territory to their advantage and dealt a heavy blow to the Union's forces. The Union split their forces into three to besiege Firmrock's stronghold for a whole month only to return with failure, causing Firmrock's reputation to soar right after.</p><br/><p>As Firmrock had managed to hold back a large portion of the Union's forces, Auguslo I had the necessary time to regroup his troops. After a month, Auguslo I returned with more than 600 thousand troops. Being angered by the union, Auguslo I made a solemn oath that he would use the Union's blood to wash away the humiliation he and the kingdom received from them. The Union's forces stood up to the challenge and sent 400 thousand of their own forces to wage battle in Armenia and Malivia. Both sides had their fair share of victories and losses and were in fierce competition.</p><br/><p>On the 23rd day of the 10th month, House Norton's Tigersoar and Jaeger launched their assault and appeared on the battlefield all of a sudden. Their path was unabated and they crushed every obstacle in their way. The Union suffered consecutive losses and lost over 100 thousand troops, being helpless before the Norton assault, having no choice but to retreat from Armenia and Malivia back to the Falik Plains.</p><br/><p>As the Union's forces were occupied by the Norton forces during their retreat, they neglected Auguslo I, who was watching and waiting for an opportunity. In the end, Auguslo I used mobility of cavalry troops from the Frontier legion of House Fisablen and their reserve legion as well as the Pegasus legion to mount a night attack on the Union's forces during their retreat. The attacked was launched on their vanguard and rearguard as well as their flanks, causing the whole army to be drowned up in slaughter. The Union's forces suffered yet another gross loss of 240 thousand troops.</p><br/><p>After that battle, Auguslo I ordered for the thousand captive nobles to all be killed before leading his troops all the way to the Falik Plains, ushering in two years of bloody sieges and battles there. The Union on the other hand had been severely wounded by that exchange and had started to destabilize internally. Though they were considered the largest superpower on Grindia, their army had been beaten back to their original form by the forces of Grindia. The big six guilds, having been greatly wounded, could only barely hold their defense line at the Falik Plains.</p><br/><p>In the history of Grindia, as the Union had broken the sacred, unspoken noble tradition of not deploying troops during the negotiation of a peace treaty, the war starting all the way from Auguslo I's gathering of a million-man army at the Union's border to the night cavalry attack on the retreating Union soldiers was known as the War on the Traitorous Union. Some war scholars refer to it as the Betrayal of Peace.</p><br/><p>During that war that fundamentally altered the political landscape of the continent, the richest and most popular legends were about Andinaq's Duke of The Northlands, Norton Lorist. Before the age of 40, he had challenged Windstorm Swordsaint Magrut, someone who had already taken the continent by storm before. Before 15 minutes elapsed during the fierce battle, he managed to greatly wound the swordsaint. Even though he had been greatly injured himself, his name still spread all over the continent overnight. That was the birth of a new swordsaint in the past five decades, one that was younger than 40 no less, and that incident was one of the most contented and doubted topics of all.</p><br/><p>In the millennia-old records on Grindia concerning swordsaints, the youngest to ever reach that realm was 68. That person was one of the most legendary figures in the past millennium: Master Cloudsaint Cameron who lived three centuries back. However, Duke of The Northlands Norton Lorist actually broke that record, and that was where the point of contention was at. The duke was younger than 40 and it was said that he didn't train in the hereditary battleforce technique of his household, but instead, a mysterious technique of the eastern martial monks that lived during the era of the magical civilization.</p><br/><p>Regardless of the fact that the duke didn't train in traditional battleforce but rather a lost, ancient martial monk technique, he had still managed to heavily wound the windstorm swordsaint. Even though the duke himself suffered similar levels of injury, being able to face off against the windstorm swordsaint gave Andinaq more confidence in their continued fight against the Union. The Kingdom of Andinaq now had a swordsaint they could call their own. It was a shame that the windstorm swordsaint had entered seclusion to recover from his sever injuries after returning to Morante and nobody was able to extract a testimony from him concerning the duke.</p><br/><p>According to a reveal by the windstorm swordsaint's first disciple, Count Bolyde, the windstorm swordsaint did confirm that the Duke of The Northlands was a swordsaint. His domain was an incredibly weird one too that was filled with bloody gore and killing intent, like a domain of blood. It could be seen that the duke must be a crook with his hands stained with the blood of others. But Count Bolyde later added that the Duke of The Northlands also suffered a strike from the windstorm swordsaint and was injured far worse and would require an even longer time to recover. The windstorm swordsaint said that he would challenge the Duke of The Northlands once more when he recovers to wipe that humiliation off his name once and for all.</p><br/><p>After getting heavily injured in the fight against the windstorm swordsaint, Duke of The Northlands Norton Lorist also vanished without a trace and had probably gone to recover from his wounds. During the War on the Traitorous Union, House Norton's performance was stellar beyond comparison. FIrmrock legion defended their army camps steadfastly while Tigersoar cruised forward, busting through one obstacle after another. Jaeger could scatter and gather freely as the wind and managed to find its way through any defense. It could be said that it was because of the three Norton legions that secured the kingdom's edge over the Union.</p><br/><p>After that war, it was said that the Union formed a unit with 15 blademasters to infiltrate The Northlands to assassinate the wounded Duke of The Northlands. It was recorded in the Norton chronicles that the Norton forces frequently encountered hostile blademasters during that period. However, it was a point of suspicion that the high officials and household knights as well as the family members of the Duke of The Northlands weren't targeted by the assassins as well. However, that soon proved to be nothing but a rumor. After the Duke of The Northlands lost contact with his household, the internal situation of the household started to destabilize and that culminated into an internal rebellion.</p><br/><p>The internal rebellion within the Norton domain caused the three Norton legions to return to The Northlands from the frontlines. Having lost the support of the three Norton legions, the Andinaq forces didn't have any momentum to carve their way forward, making them unable to take over the last three remaining stronghold cities and Morante the Union had on Falik Plains. That caused the war situation there to enter its bloodiest state. The Andinaq kingdom and the Union didn't think that in the following year and a half, both sides would lost more than 30 thousand elite soldiers on the bloodstained plains. That was a war without victor.</p><br/><p>Extract from Rise of the Ragebear Dynasty -- Book 1: Fall of the Empire, authored by continental war historian and expert, imperial scholar, and professor of Dawn Academy, Sir Anderwlin Mismord, published throughout Year 2127 to Year 2131 of the Grindian calendar.</p><br/><p>\"Where... am I?\" Lorist finally awakened and said a full, clear sentence. The house he was in was completely dark and the sound of falling rain could be heard from the outside.</p><br/><p>Ever since he fainted from his heavy injuries following his battle with the windstorm swordsaint, Lorist felt as if he dreamed for a really long time. He could only barely remember what the dream was about as well as the bitter and viscous medicines he had to drink, the pain he suffered all over his body, and the vague feeling on having been on a stretcher or a carriage. His body hurt the whole time like he was being baked by an intense heat. From time to time, he would wake up and see the blue sky. He also vaguely recalled hearing the sound of fighting and agonized cries.</p><br/><p>\"Your Grace, you're finally awake?\" said a familiar voice beside him. It sounds like Reidy...</p><br/><p>\"Is it Reidy? Where is this? Why don't you have a candle lit?\" asked he doubtfully.</p><br/><p>\"Your Grace, we're at Kobo. We can't light any candles for your safety,\" said Reidy with difficulty after a period of hesitation.</p><br/><p>Kobo? Can't light any candles for my safety? Lorist took a few breaths and felt that his chest was still pulsing with pain. But the sword he remembered sticking out of it was no longer there. He soon happened upon the memory of his fight with his swordsaint.</p><br/><p>\"Tell me what time is it and what kind of situation we're in.\" As his eyes gradually got accustomed to the darkness, he could more or less make out the linen sacks all around him. He was probably within some food storehouse.</p><br/><p>\"Your Grace, you've been unconscious for nearly six months and was only sustained by medicinal concoctions. His Majesty had wanted to let you recover at the imperial capital, but the Union sent ten blademasters to the royal palace in an attempt to assassinate you. But you weren't within the palace like they thought. Blademaster Manst, who was recovering there, and another blademaster called Joseph, died from battle there. The imperial capital was thrown into chaos, and Blademaster Shuss and I killed three of the Union blademasters who were tracking you and used that chaos to bring you away from the imperial capital. We then left for Vanades with the guards.</p><br/><p>\"We had thought that since Knight Terman was stationed at Vanades with his brigade, he could help us protect you. But we soon discovered that the knight brigade had been reassigned to Wild Husbandry by the house. That was when the Union blademasters got on our tail again. To lead them away, Shuss and Jinolio brought the guard regiment with them to The Northlands, while I secretly brought you to Kobo in a food cart. It is the rainy season of the new year right now and we've been staying here for a month and a half.\"</p><br/><p>Reidy's explanation contained quite a lot of huge developments that Lorist had to make a bit of effort to process and make sense of them.</p><br/><p>\"Did His Majesty send anyone to pursue the windstorm swordsaint after I fainted?\" asked Lorist.</p><br/><p>\"He did, but the Union forces arrived just when they were about to catch him. A few divisions from Whitelion had already crumbled and everyone was busy running for their lives back then. Jinolio and I brought you and the guards to retreat. After that, His Majesty said that you had to be saved no matter what and let and had the injured Blademaster Manst bring us back to the imperial capital so that a herbalist could be found to treat you. We wanted to let you stay in the palace, but the poisonous wench of House Fisablen didn't let you live in 'for the sake of avoiding gossip and rumors'. So, we had to settle you down within a count's mansion near the palace. We didn't think that we'd manage to avoid the assassination attempt that way,\" said Reidy with relief.</p><br/><p>\"His Majesty didn't return to the capital?\"</p><br/><p>\"No. The million-man army crumbled this time around and only Firmrock held firm within camp. That managed to buy His Majesty some time to regroup his soldiers. A month later, he led his troops on an assault. He had stayed at the frontlines the whole time without returning to the imperial capital. After that, Sir Potterfang sent Blademaster Shuss to the capital to protect you He brought news that His Majesty had shaved himself in front of the army and made an oath to fight the Union to the bloody end to wash away his humiliation.\"</p><br/><p>Alright. Looks like Auguslo will be busy for a time. Who knows how long this battle will last?</p><br/><p>\"You just said that Knight Terman was moved from Vanades to Wild Husbandry. Why? What about Jaeger? Weren't they within Wild Husbandry? Did something happen?\"</p><br/><p>\"This... This is because His Majesty is going to lead his troops to attack the Union, so the knight brigade had nothing better to do at Vanades. General Josk was also said to explode with anger when he heard that Your Grace was injured and wouldn't follow his orders. All he cared about was bringing aeger and Sir Loze along with Tigersoar to fight the Union at the frontlines to avenge you. Wild Husbandry was left empty, so the house had no choice to call for Sir Terman and his knights to defend it,\" replied Reidy with a stammer.</p><br/><p>\"They're all messing around!\" snorted Lorist. However, he could do nothing about it now that he was hiding within a food storehouse. Josk had always been rather close with him, so it was no surprise that he had to act after hearing about what happened. It wasn't something Charade could stop. Fiercetiger Loze on the other hand was arrogant and proud and heeded only Lorist's orders. He wouldn't even bother with Charade at all. If he weren't hiding away in this corner, he'd order those two to return obediently to pay for their mistakes.</p><br/><p>\"Does anyone else know that I'm here?\" asked Lorist.</p><br/><p>\"Your Grace, only three people know. There are around three thousand local defense brigade soldiers here in Kobo. Apart from me, only the major of the brigade and his attendant know. The major called Selikoff and used to be part of our guard brigade. His attendant is his own cousin who is also in charge of bringing us food. However, when the rainy season passes and the harvesting of winter wheat in Delamock begins, there will be many food carriages traveling here. There will no doubt be more people by then and if anyone realizes that Your Grace is here, we might attract the attention of assassins.\"</p><br/><p>\"Let's find another place. There's no way we can return to The Northlands right now as some people will be looking out for us there. Let's disguise ourselves as the food-transporting farmers come the 4th month and head to the Dina barony,\" said Lorist after some consideration.</p><br/><p>Please read an announcement here to find out how you can enjoy an early access chapter of TRL by participating in a competition!</p><br/>\n</div>"}