{"title": "Chapter 488 Bad News", "id": 488, "volume": 5, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-488-bad-news", "volume_title": "Volume 5", "body": "<h1>Chapter 488 Bad News</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Bad News</p><br/><p>Lorist's return to The Northlands was a breeze. No one was willing to fire at him. Wherever he went, the rebels surrendered obediently. They let Firmrock march across the river as well and didn't resist when they were arrested.</p><br/><p>On the 21st day of the 7th month, Year 1789, Lorist, led the Northsea fleet to the city of Northsea. The sentry legion's third brigade, first division received him and surrendered. Lorist headed straight for Maplewoods and rescued Belnick, who was still sitting prisoner there, and arrested everyone related to the bastide, Irina and her sons included.</p><br/><p>From there he retook the town of Poplar and marched onwards to Nico Academy where his visited Telesti and his daughters. He rested there for two days and then left for Firmrock Castle, making an appearance at every town along the way. The castle was taken without incident and Lorist ordered news of his return be spread to the rest of the world.</p><br/><p>The first to bring bad news was Howard, who came from Cherry Blossom Ridge. The cannon foundry and training grounds were discovered by the blademasters after him. They thought he was hiding behind the guards, and attacked. Lorist read the damage report and exploded. Of the 200 cannons, 141 was destroyed, and 1377 of the 2000 artillerymen were dead or injured. The sentry regiment suffered 824 casualties. Their captain, Jim, was still recovering from his wounds and Regiment Sergeant-Major Paulobins was dead.</p><br/><p>Lorist managed to keep himself under control, but completely lost it when he heard about what happened to his refineries in the Bladedge mountain range. Grandmaster Sid's research facilities and foundries as well as Grandmaster Felin's workshops were searched, by enemy blademasters, lead there by the constabulary. Most of the blueprints for his weaponry was stolen.</p><br/><p>\"Who... who gave the order?! Who revealed our top secret industrial centers to the enemy?!\" Lorist's demanded, eyes bleeding.</p><br/><p>\"S-Supervisor Hansk. He sent the constabularies and the blademasters. He said he was forced to do so because they held Madam Irina and the second young master hostage, so he had no choice but to yield to their demands. He even said that since Your Grace wasn't there, there was no harm in letting them go...</p><br/><p>\"He even said the house spent too much money there without seeing any returns and wanted to uncover what was going on there. He said the mountains were part of the old house's domain and was thus under Lysecott's jurisdiction. As such, he had to root out the corruption there. He planned to investigate the accounts personally when he had the time.</p><br/><p>\"When the blademasters found the cannon ranges and the explosives research center, Sir Jim refused the search order and got into a fight. Several dozens were killed before they could chase the blademasters away. Which roused their suspicions.</p><br/><p>They attacked the facilities 14 days later. Jim was prepared and had several canons aimed at the valley entrance. The first volley killed three blademasters and heavily wounded four. The remaining seven retreated with the dead and wounded. They snuck into the valley that night and slaughtered everyone and destroyed the cannons...\"</p><br/><p>\"Where are they now?\"</p><br/><p>The cannons and the men that operated them were his trump cards. They were his house's greatest security. It had taken them years to build the cannons and train the men, this was an unbelievable setback. It would take years to recover, maybe even a decade.</p><br/><p>\"They left The Northlands in the 5th month. Supervisor Hansk issued arrest warrants for them, but he has no strength to actually carry it out. They left by sea and we only know they're heading south.\"</p><br/><p>Lorist stroked his chin. So he had seen so few during his stay in the barony because they were mostly busy here.</p><br/><p>\"How many blueprints?\"</p><br/><p>\"The ones for the super steel ballistae, three types of catapults, and 16 types of armor. They also took the designs for Jaeger's new crossbows. The rest are designs for failed projects. Fortunately, Master Julian's material recipes were kept safe. I don't think they knew what those recipes were so they just left them. Without them, it should be almost impossible to make the designs work.\"</p><br/><p>Lorist breathed a sigh of relief. That they'd left behind the recipes was his only consolation. It was manageable to lose the designs, but the recipes could not be leaked. The former were pretty much useless without the latter.</p><br/><p>\"Is Sylvia and the others alright?\"</p><br/><p>\"Lady Sylvia, your mistresses, and your children are fine. They told me to tell you not to worry about them and deal with the situation first. Lady Sylvia said they would spend the summer in the palace and return to Ragebear come autumn.\"</p><br/><p>\"I heard Jinolio and Shuss went there with the city's garrison. Reidy and I are worried, why didn't they come with you?\"</p><br/><p>\"Jinolio's helping me investigate what let all this come about. Supervisor Hansk played a huge part, but he certainly can't be the sole reason behind this.\"</p><br/><p>\"No worries. You did well. Jinolio did great too. I heard the blademaster actually barged into the mansion in Ragebear and you even held one back for a time. Is it true?\"</p><br/><p>Howard scratched his head.</p><br/><p>\"I was at a disadvantage and even hurt my hand. I had no choice but to have Jinolio write the reports. He has pretty handwriting at least. I'm only at the level of a two-star gold rank. Your training is what let me fight a blademaster.</p><br/><p>\"Six came over to search the mansion. They were really careful since they knew you were a blademaster. They didn't cause anyone any trouble or hurt anyone. Apart from Blademaster Shuss, Lady Xanthi and Grandpa Engelich was there too. They were the ones who chased the blademasters away.\"</p><br/><p>Howard didn't blow other people's horns, nor was he greedy with credit. His humility was refreshing.</p><br/><p>\"Since the cannon range is damaged, Paulobins is dead and Jim is injured, I need someone to take care of the mess. You will be the artillery brigade's major. Rebuild the brigade. I will have Sid restore the cannons. You can fill your command as you see fit. What do you think?\"</p><br/><p>\"You wish is my command, Your Grace,\" Howard saluted, \"It's just... Is it okay to hand internal security to Jinolio?\"</p><br/><p>Lorist shook his head.</p><br/><p>\"Jinolio is still young and naï¿½ve. He should focus on his training instead. He'll stand by my side again. Anyone else in mind?\"</p><br/><p>\"Baron Calliston is a suitable candidate.\"</p><br/><p>\"How so?\"</p><br/><p>\"Internal security is basically spying on the people in the house for the house's safety. I didn't get a grasp on things quick enough, Hansk rebelled before I could get everything in place. Baron Kriston is in charge of investigating crimes in a whole region and I've met with him a number of times. He was the one who pointed out the odd prejudice the constabulary and sentries have against the immigrants. I didn't take his warning seriously and investigate. I would have caught this before the rebellion if I had.</p><br/><p>\"While the constabulary is important, we shouldn't waste Baron Kriston's talent there. He is bright, capable, and -- most of all -- loyal. He is a perfect replacement.\"</p><br/><p>\"Alright. I'll summon him when I go back to Ragebear.\"</p><br/><p>Lorist arrived in Ragebear on the 25th of the 7th. The moment the city gates opened, Glacia, the new general of the first sentry legion, paid her respects to him with her subordinates. Firmrock relieved the local garrison, which left the city, leaving only Glacia and Lorist to walk to the castle and mansion.</p><br/><p>\"This isn't fair, Locke. The men were just following orders. They didn't know they were betraying the house. They were actually the most loyal. You can't treat them like this.\"</p><br/><p>\"So I should, what? Reward them? Knowingly or not, they betrayed me and rebelled against my authority. You're my elder cousin sister. I really appreciate that you're willing to step out of the shadows to serve the house. I'm thankful for what you did for Sylvia and for keeping a battle from breaking out. But there's something you're failing to understand. You may think this is what's good for the house, but it's not. I'm already doing as little as possible. I am going to execute everyone involved in this rebellion knowingly, the legion should just be thankful their heads aren't going to roll as well.\"</p><br/><p>\"No! You can't, Locke! The men were following orders. They're loyal!\" cried Glacia. She didn't understand why Lorist would be this angry.</p><br/><p>Lorist smiled bitterly.</p><br/><p>\"Firmrock, Tigersoar, and Jaeger's men are the loyal ones. While the sentry legion are obedient, we don't know for sure where their loyalties lie. You know almost all the men in the legion used to be our prisoners. They're all former enemies. They were only recruited because they served us well for years. This is nothing but a way to feed their families to them.</p><br/><p>\"The policies I have for my men make them increasingly loyal over time, yes. Whether it be Firmrock, Tigersoar, or Jaeger, even if their general went missing and many of their superior officers were replaced, I am willing to bet they would never march on my capital even if they were ordered to. I would have to order them to do so myself, in person or they would kill anyone who showed any sign of listening to the order. They would never believe I gave such an order in my absence and would arrest the messengers immediately.</p><br/><p>\"Even a letter written in my handwriting and carrying my personal seal might not be enough for them to carry out such an order. Were they really following orders or are they just fools? Did they never question their orders? Is someone who follows a wrongful order loyal to the house?\"</p><br/><p>Glacia was speechless.</p><br/><p>\"...Then how will you deal with the men?\"</p><br/><p>\"I will not let them stay in my demesne. They can settle in Wild Husbandry. If they don't want that, they can move to one of my other jurisdictions, but I will not let them set foot on my land again.\"</p><br/>\n</div>"}