{"title": "Chapter 489 The Loyalty of a Scoundrel, The Loyalty of a Traitor", "id": 489, "volume": 5, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-489-the-loyalty-of-a-scoundrel-the-loyalty-of-a-traitor", "volume_title": "Volume 5", "body": "<h1>Chapter 489 The Loyalty of a Scoundrel, The Loyalty of a Traitor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Loyalty of a Scoundrel, The Loyalty of a Traitor</p><br/><p>\"The law is the law. Princes and paupers are punished the same!\" ~ Norton Lorist</p><br/><p>Hey Guys!</p><br/><p>Winter and summer are past their prime in their respective hemispheres and will soon begin winding down. At the same time we are about to hitting our final hundred chapters in TRL, and they are more exciting than any that have come before! We've decided to implemented two new patreon tiers so you guys can binge the big buildup and look forward to hearing what you guys have to say. Things are heating up and the stakes are becoming greater and greater. What new twist or turn will Lorist's journey take? The new tiers, Extinct Swordgod and Ancient Magus have the answers. We'd also like to let our patrons know that we're implementing charge up front on our patreon page. Which means you'll be charged for any new pledges or increases in your pledges as you make them, not just at the end of the month. We look forward to this new chapter and can't wait to find out where the novel will go in it's final 100! And, since we can't wait, and have recently come onto some extra free time, we've decided to put up a new goal! If you guys can help us reach that goal, we'll put out 6 chapters a week until we finish TRL!</p><br/><p>Excited Greetings</p><br/><p>Ryogawa and Prince.</p><br/><p>Spiel stared at Hans, who stood in front of the reception team, and felt like laughing. Hansk had held power for a few days, far above the command of anybody else and with the power to jail anyone, even Kedan was forced to go with the flow to make sure the administration's operations weren't impeded. However, when Hansk received word of Lorist's return, he aged ten years overnight. His aloofness and arrogance vanished; he now acted with earnest sincerity and a twang of fear. He had, after all, named himself chief administrator. Though Lorist might tolerate his son's appointment to heir, he wouldn't let Hansk off scot free.</p><br/><p>Hansk appeared a martyr as he awaited Lorist's arrival. He instructed Lysecott in hushed tones how to greet his father and how to deal with his questions. He might even believe making Lysecott the heir in exchange for his life was the right and best thing he could do. If one viewed it in that light, he was indeed loyal to the house. Unfortunately Lorist didn't care for loyalty to the house, but about loyalty to him, personally. Besides, the house to which Hansk was loyal wasn't the same house Lorist was in.</p><br/><p>Horses rumbled up the street. Lorist soon appeared round a curve in the road. Glacia rode behind him. Reidy, Tarkel, Potterfang, the guard brigade, and Firmrock followed behind her. The reception group started chattering, Hansk and Lysecott included. When Lorist stopped in front of them on horseback, they bowed. Everyone understood Lorist was House Norton's sky. He was now a swordsaint and the proudest protector of the house.</p><br/><p>\"We welcome Your Grace back to the house...\"</p><br/><p>According to noble etiquette, Lorist should get off his horse and ask them to drop the formalities before tending to the officials there to receive him one by one. He didn't need to say much, only a word or two of greeting and a pat on their shoulders to thank them for their hard work and express his gratitude. But their lord sat firmly in his saddle. Everyone felt his eyes stab the tops of their heads. Everything was quiet as a soft gust of wind blew across the yard. The pressure made some who knew what they did lower their heads further and bow deeper as if it would help them hide in the others' shadow.</p><br/><p>\"Your Grace!\" Hansk finally stood straightened up proudly to dispel the atmosphere.</p><br/><p>Lorist waved his hand without saying anything. Reidy, astride his horse, trotted in front of the group. He took a silver tube out of a pocket on his saddle. He removed from it a scroll which he unrolled and read.</p><br/><p>\"Grus! Ivanson! Ikefall! Moslin! Byschuss!...\"</p><br/><p>Two guards vanished into the reception party and dragged someone out with every name announced. A few realized they were all either Hansk's confidantes or people from the bastide. Most were retired soldiers who'd moved to the constabulary and had been deeply involved in the rebellion. Reidy didn't name either Hansk or Lysecott though.</p><br/><p>\"What are you doing?!\" Hansk panicked and ran up to Reidy.</p><br/><p>Reidy tightened his legs round the horse's middle, and it sidestepped Hansk, who now stood at its flank. Reidy slipped his foot out of the stirrup and slammed it into the man's face. The old man stumbled back several feet and fell to the ground. He raised his head heavily. A dirty boot print and bruise straddled his face. He spat out a mouthful of blood and two teeth. The names continued to be announced.</p><br/><p>One after another the culprits were dragged out of the group. Reidy rolled the scroll up and return it to the tube when 45 stood on the side. Lorist dismounted behind him and walked up to the remaining officials, a sincere smile on his face. He raised each from the ground and thanked them warmly.</p><br/><p>Kedan apologized to Lorist, tears running down his face incessantly on behalf of the thirty or so left.</p><br/><p>\"No apology can make up for this, Your Grace. It is our fault this could not be stopped or avoided.\"</p><br/><p>Lorist waved dismissively.</p><br/><p>\"Don't say anything. You did what you could. You did well to not spill blood. You continued to perform your duties and waited for my return loyally. You did the right thing. I cannot express my gratitude adequately. But let these two words stand. Thank you.\"</p><br/><p>The officials in the centre of the yards shuddered, tears running down their faces. The ones held by the guards on the side paled. Lorist had declared the incident a rebellion with these words. There were all now officially traitors, at least as far as everyone else was concerned, and they would be recorded as such in the house's records, if every mention of them was not erased entirely.</p><br/><p>\"We... we're not traitors! We're the ones most loyal to the house! We will not stand for this insult!\" Hansk shouted, his face crimson. There was no greater insult to his loyalty. He stepped in front of Lorist in spite of his swollen face.</p><br/><p>\"Ho, look who we have here,\" Lorist chirped as he finally noticed Hansk's existence, \"I'm curious, Baron. What are you doing here? Didn't I tell you to buzz off to your lands and reflect on your shitty attitude and behaviour? I resolved myself to not mention things further out of consideration for what you did for me in the past, but here you are. Tell me, who gave you permission to come here, and who told you you could open your mouth?\"</p><br/><p>\"I...\" Hansk suddenly realised his dilemma. His prepared arguments were useless. Lorist didn't recognise him as an official of the house, but spoke to him as just another vassal. Clearly he had no authority to meddle in the house's affairs as an outsider. Without recognition as a member of the house, he had no foot to stand on, no excuse for his presence or actions.</p><br/><p>If he were indeed a loyal house official, he should have stayed in his dominion as ordered. He had no right to leave his lands if he still regarded himself as a house official. Being here was itself basically a declaration that he was no longer a house official, just a vassal.</p><br/><p>\"I... I was here to support Young Master Lysecott as regent and heir de jure. I was only doing my duty as a loyal servant,\" he replied after some thought.</p><br/><p>\"Hehe, regent? Heir de jure?\" Lorist turned to the shivering ostrich. Hate flashed across his eyes as they gazed at the fat figure.</p><br/><p>\"I don't remember ever naming an heir,\" the man murmured, as if in thought to himself. \"Lysecott, my son, time really flies. You're seventeen already. I was too busy, so I neglected your upbringing. I didn't think you were in such a rush to become heir de jure. Is this really what you want?\"</p><br/><p>Though Lysecott didn't frequently get to see his father, he feared him down to his bones. Lorist had tossed him to Malek's family to be disciplined. The man even had Reidy cane him thirty times in Nico Academy publicly because of a simple mistake and sent him back to the bastide, bloody and battered. He remembered the lessons and froze though Lorist asked him nicely. He couldn't stop teeth chattering.</p><br/><p>When his father's gaze fell on him, he remembered his mother's instructions and Hansk's encouraging words. 'No matter what, you're His Grace's eldest son. He won't do much to you'. He mustered his courage and answered.</p><br/><p>\"Mo-mother a-and Ha-- Uncle Hansk said I am your rightful heir. Everything that belongs to the house also belongs to me and no-no one ca-can take it from m-me...\"</p><br/><p>\"My rightful heir?\" Lorist laughed, stretching out his hand.</p><br/><p>Tarkel handed him a scroll.</p><br/><p>\"I was injured and lost contact. You declared yourself heir on your own, I never endorsed you. I can't fault you, having ambition isn't a bad thing, but you listened to others. You're just going along with the ambitions of others. Others used you and you were happy to be manipulated. You're nothing but a brainless fool--\" Lorist opened the scroll. \"--You've been in Ragebear for seven months, right? Let's see what you did.\"</p><br/><p>\"Wow, how amazing! You raped 21 maidservants, killed four servants and a cook because you didn't like their cooking and tossed their heads into the fire. Your uncle even went out of his way to gag everyone for your sake and buried the corpse in the garden...</p><br/><p>\"You ordered Dawn Academy to tie up Helias and send him to you so could get back at him for calling you out when you were harassing your half-sisters. The academy refused, so you ordered the legion to burn it to the ground. Luckily Glacia refused. In turn you cursed her in front of a lot of people.</p><br/><p>\"You sent your guards after Madam Malek so you could pay her back for the years of hard work she put in to raising you properly. Luckily she wasn't at the mansion, but in retaliation you burned it to the ground.</p><br/><p>\"You went out four times in the last seven months and raped three women and killed their families. You ran thirteen people over in the streets with your carriage, killing three and badly injuring the rest. You demanded tributes of interesting trinket from the merchants in the city...</p><br/><p>\"I admire that you did everything I wanted to, but didn't. I've always wanted to act like you did and ignore everything, I've always entertained the idea of being a tyrant. You know why I didn't become one? If I did, my father, your grandfather, would hang me to apologize to the ancestors and strike my name from the registry.</p><br/><p>\"Your mother spoiled you and raised you into a monster. You don't have empathy or humanity. As House Norton's lord, as your father, I have to correct my mistake. You are hereby struck from the family registry. Neither you, nor anyone else, may ever use your name and House Norton's name in the same sentence. You are unfit of my name, unfit to be even a bastard. I shall uphold my father's honour, the honour of my ancestors, and the honour of my name. The world will be told of your crimes. The names of every victim and the crime you committed against them will be tattooed on your body and you will be hanged in the city square. Once you're dead, your body will be left on the gallows to rot.\"</p><br/><p>Lorist turned to everyone else present and raised his voice.</p><br/><p>\"From this day forth this shall be the fate of every man, woman, and child who tarnishes the Norton name! Be they peasant, soldier, official, noble, or family member!\"</p><br/><p>Lysecott paled and stumbled backwards as he listened to the lord. He never dreamt the man had been keeping such a close eye on him. His gaze flitted to the house's officials. He was certain they had ratted on </p><br/><p>\"F-f-f-father... F-f-forgive me...\" he tripped and fell on his ass. His pants darkened, and a puddle formed under him.</p><br/><p>\"You can't do this, Your Grace! The king had recognized Lysecott as your heir. I have a sealed decree from His Majesty! You do not have the right or authority to harm him!\" bellowed Hansk frantically as he scrambled in front of Lysecott and fumbled for Auguslo's decree.</p><br/><p>\"The king's decree?\" Lorist chuckled, \"Are you joking? Or did I hear wrong? Baron, when did I give the king the right to meddle in my personal affairs, or in the internal affairs of the house? Do you really think he can just appoint my heir on a whim? Is he trying to incite a rebellion and start another civil war?\"</p><br/><p>\"H-He made his decree because you were absent and no one knew if you were still alive! We asked the king to endorse Lysecott because you weren't here to do so yourself!\"</p><br/><p>\"And who told you I would ever have made him my heir?! So you didn't hear from me for a while, do you assume I'm dead the moment I walk out of the door and you can't see me? Do I have to stand in front of you every minute of every day so you can be sure I'm alive?! How quickly do you want me to die?\" Lorist was a swordsaint, he could easily live for two or three centuries even if he never improved his cultivation another step. His endorsement aside, even if Lysecott was the best heir in the world, if he didn't become a swordsaint himself, he would never live long enough to inherit his father's position.</p><br/><p>\"Is that why you let the enemy blademaster go around looking for me? You were fine with revealing our secrets to the enemy as long as they could take me out of the picture for good, huh?! You killed 2000 of my loyal men!\"</p><br/><p>\"I... I was just trying my best to ensure the house remained stable... and helping Young Master Lysecott manage the dominion. I am loyal...\"</p><br/><p>\"Loyal? Ha! You soil the word with your lips!\" Lorist sneered, \"Even if I were dead, you of all people had the least right to step in! Imprisoning a gold-ranked knight and forging his order to take over his forces and attack the capital; sealing the dominion's entrances; cutting off supply to our forces on the front lines; and burying Lysecott's crimes... Is this what a loyal man would do? If it is, then I want nothing of this loyalty! This is the loyalty of a scoundrel, the loyalty of a traitor!</p><br/><p>\"Take them away. I don't want to soil my eyes with their visages. I will personally announce your crimes before I execute you!\" ordered Lorist coldly. He watched on as the guards took the traitors away.</p><br/><p>Glacia walked over.</p><br/><p>\"I'm sorry, Locke. I didn't understand what the brat was doing. I would've stopped him if I did. Are you really going to kill him? He's your eldest--\"</p><br/><p>\"The law is the law. Princes and paupers are punished the same!\"</p><br/>\n</div>"}