{"title": "Chapter 491 Human Resources", "id": 491, "volume": 5, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-491-human-resources", "volume_title": "Volume 5", "body": "<h1>Chapter 491 Human Resources</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Human Resources</p><br/><p>Lorist didn't attend the execution. He shut himself in his study, turning away all audience requests. Charade and the other officials understood how he felt and made sure not to bother him. Sylvia couldn't hold back any longer and went to visit him that evening. She found him sitting in his chair, facing the window, watching the moon quietly as tears rolled down his face. This was the largest single-event execution the house had ever carried out. They hanged and beheaded 349 people in one go. Lysecott, the king-endorsed heir, was also hung from the gallows. Thousands more were exiled from Lorist's demesne.</p><br/><p>Unsurprisingly, it sent waves across the entire kingdom. Outsiders considered it excessive for a bloodless revolt put down without incident. The rebels neither killed nor tortured anyone. Lorist looked like the tyrant by contrast. Especially on the matter of his son. Lysecott may be a legitimized bastard, but he was still the duke's son. His crimes were made public, but they were nothing untoward for nobles. No one in the nobility considered it something worth an execution. Even the strictest of nobles usually only demanded an apology and some form of compensation. Lorist had reacted way to excessively.</p><br/><p>The other thing that brought up big discussions, was the fact that, under false impressions or not, the boy had the king's endorsement -- sealed decree and all. How it was obtained was irrelevant. Custom and norms dictated that Lorist accept it, or at the very least find a way of dealing with his son that wasn't a clear disregard of the royal decree. Instead, the duke just hanged his son. He acted like the decree didn't exist. His status as the country's only swordsaint protected him from public criticism, however.</p><br/><p>Only the duke's inner circle knew the reason for his fury. Hansk's rebellion destroyed years of his hard work, especially where his cannons were concerned. Only the few that had seen them in action knew how much of a setback this was. The rebel had indeed sought his own death. When Kedan brought him his last meal, the old man cursed his lord for being blind to his loyalty and ignoring his advice. He cursed the house a fall from grace and a descent into ruin, proclaiming that he would laugh at the fools from beyond the grave.</p><br/><p>Kedan watched on silently. He didn't speak until the old man was done with his food.</p><br/><p>\"Hansk, you've been blinded by power. Your talents weren't enough. I understand what you want. You want to be the next Gleis and control almost everything in the house. You would have been, too, if the house was still just a backwater barony, but it's not. His Grace has a full provinces and the equivalent of a second as his demesne, and two more under his jurisdiction.</p><br/><p>\"Lord Norton is the one that led us to the glory we have today. You just had to follow him obediently and serve him loyally. You're delusional if you think you can compare to Gleis. It's too bad your delusion is now your end. Why do you still pretend like this is out of loyalty?\"</p><br/><p>Kedan left as Hansk slumped. The man knew Kedan was right. Gleis had been in charge of everything, baron in all but name, until Lorist returned. Lorist's father couldn't be bothered with the small things so he left everything to Gleis. All he did was hunt magical beasts and barbarians. Hansk wanted to be the same for Lorist. He wanted the kid to go off hunting beasts and barbarians and leave him in command of everything. Had the new lord been anyone but Lorist, this would have been the case, but Lorist was different.</p><br/><p>Hansk could not compare to any of the new officials, the only reason he and the rest of the old guard hadn't been forsaken already was because Lorist didn't want to step on Gleis' wishes. In his resentment he didn't work hard and even split the house between factions. He had undone the trust Lorist had in him himself. Lorist didn't give him special treatment, despite technically being the most senior servant, he was passed over for promotion and it took him years more to be enfeoffed than the newcomers. Rather than get his act together, he blamed everything on Lorist and the greenhorns and even started openly disobeying and lecturing his lord.</p><br/><p>Some things could be tolerated, but this disrespect was not one. He had brought about his own downfall. If only he'd obediently reflected for a few years in his fief, but, instead, he returned to the bastide and fanned the flames of insurrection in his lord's son.</p><br/><p>He'd dreamt of splitting the house's ancestral homelands off from the greater dominion and governing it under Lysecott, but dreams were far-fetched and reality cruel. His forces surrendered without even complaining when Lorist returned. They'd let the core of their plan, Lysecott, be captured. If they had kept him out of Lorist's reach, then even if the rebellion failed, they could still return with the heir and the decree when the house was weak and push their claim. But with him captured, there was no way out. They were tried for treason, heir included, and were now going to be executed.</p><br/><p>His greatest mistake was underestimating how much control Lorist had over his lands. He now understood that the rebellion was only allowed to happen so Lorist had an excuse to get rid of him and everyone in his faction.</p><br/><p>Three days after the execution, Baron Kriston rushed to Lorist's study. Lorist was back to normal, save the gloom in his forehead. He held a scroll containing Kriston's personal information.</p><br/><p>\"Please have a seat, Kriston. You have done well for several years now as security chief. You've formed multiple constabularies and organized the drafting of laws and regulations, with appropriate punishment for crimes. You've even been given a fief.\"</p><br/><p>Kriston rose the moment his toosh touched the cushion and bowed.</p><br/><p>\"I'm only doing my duty. I do not deserve your praise.\"</p><br/><p>\"I'll get straight to the point. I summoned you because I have a new job for you. Furybear, my intelligence service, is being broken up into two smaller departments. Each will focus on a particular domain of security, one internal, the other external. The former I'll call the Department of Internal Affairs. It will be in charge of counter espionage, counter insurgency and maintain a stable, peaceful internal environment. Howard recommended you for the position of Head of Department. Any thoughts?\"</p><br/><p>Kriston's mouth dropped. He paid great attention to detail, and was aware of the two's relationship. So this was why the lord had sent a messenger directly to his castle to summon him.</p><br/><p>\"I am willing to serve you unreservedly, You Grace. I give you my word.\"</p><br/><p>\"Very well. I am happy you're up to the task. You have three days. Have Tarkel give you a crash course. I expect a report on my desk by sundown on the third day with your thoughts on how to structure the department and a complete preliminary budget.\"</p><br/><p>\"As you will, Your Grace.\"</p><br/><p>Belnick entered the room shortly after Kriston left. The old white-haired man shuffled in and knelt as soon as he was through the doorway.</p><br/><p>\"This whole debacle is my fault, Your Grace. I beg for your punishment.\"</p><br/><p>Lorist hurriedly pulled back on his feet and consoled him. The man had only been captured because he had been too trusting. Belnick was one of the house's oldest and longest-serving gold-ranked knights. His greatest claim to fame was facing a bear to save Lorist's younger brother when he was just a three-star silver rank. His efforts, unfortunately, were for naught. The young lord died soon after of the wounds from his fall from his horse. The fight injured him severely and a plot by the denizens of Wildnorth to poison him saw him bedridden for three years.</p><br/><p>He only learned what was going on when Lorist informed him. Not only had his lord saved his life, he'd even given him the manual that let him finally break through into the gold rank. His loyalty was above reproach, which was why he was given command of a legion and stationed in the house's home territory.</p><br/><p>His origin was his downfall during the rebellion. Being from the bastide as well, he didn't want to offend Hansk, so he went to the bastide at the latter's invitation and was captured. He would have been executed if Hansk did not believe he would eventually come round and join his side. Belnick could not contain his shame at being poisoned twice in his life.</p><br/><p>Though Lorist spent lots of effort on consoling him, he wouldn't accept it. He had to be held accountable for his failures. Frustrated, Lorist relieved him of his command and fined him two years' bonus and salary. He transferred him to the three main legions. Belnick was only willing to leave after he heard he had a chance to go to the battlefield.</p><br/>\n</div>"}