{"title": "Chapter 499 The Second Naval Battle", "id": 499, "volume": 5, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-499-the-second-naval-battle", "volume_title": "Volume 5", "body": "<h1>Chapter 499 The Second Naval Battle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Second Naval Battle</p><br/><p>\"Invincible's arrogance cost it its existence, but Northsea was no better. Their arrogance cost them a perfect record only a few days after they'd used the enemy's arrogance to inflict on them a great loss. In all honesty, neither fleet was any better where its commanders and tactics were concerned. Northsea was saved only by its technology.\" ~ Professor Nico, Nico Academy</p><br/><p>On the 17th day of the 1st month, Year 1790, Invincible's patrol flotilla heading to the sea of grief was attacked by Northsea and sunk. Captain Sylode surrendered six LLDAWs and nine MSAWs. This was the start of Invincible's fade into obscurity.</p><br/><p>In the evening the 20th, Admiral Senbaud attacked Einiba. They sunk the 500 merchant vessels in the harbor and defeated Invincible's third flotilla. The fleet was completely unprepared. They did not think Northsea would be daring enough to strike their home port so deep in their territory. Most of the flotilla's men were ashore and could only watch as their ships were sunk.</p><br/><p>Not even Senbaud thought everything would go so smoothly. His men couldn't stop laughing and kept joking around for hours afterwards.</p><br/><p>The port was engulfed in flames. They had to stop firing after a while so the cannons could cool down, so Senbaud had the ships close in so they could use their backup catapults. The ships moved without hesitation. When the ships left, the entire city was burning. The flames didn't die down for two weeks. They left nothing but ash and cracked stone in their wake. The ships that arrived after the attack could only drift outside the port and watch the blaze from a distance. One or two ships tried to beach themselves nearby so their crew could help put out the fire, but were forced to turn around when gusts of wind blew sparks dangerously close to the sails.</p><br/><p>The attack, the first port burning by sea -- soon called the Burning of Einiba -- instantly made the fleet and its admiral famous. Few people actually died, only a couple thousand, but the Union's material losses were enormous. And put the Union in a terrible position. The surviving sailors were forced to walk back to Morante and so were out of commission for several weeks. The ships burned in the harbor carried the weapons and armor intended for the next wave of reinforcement destined for Southern, which meant they had to be deployed unarmed and armored. It also didn't just destroy Invincible's reputation, but also the trust merchants had in them. Those who lost ships in the port and in the encounters with Northsea out at sea blamed Invincible and called them incapable and inept. Some even demanded outright compensation.</p><br/><p>The city's inhabitants refused to leave their carcass of a city, which forced the Union to divert resources to tide them over for the winter. This one, single burning, the actual attack of which lasted only half a day, cost the Union at least 20 million gold Fordes. But the damage went far beyond monetary and resource loss. Without the port the Union couldn't adequately resupply the front line. Even worse, it shook their confidence and morale. And things only got worse.</p><br/><p>They soon heard that a patrol flotilla had gone missing in the sea of grief, and rumours started trickling in of merchant ships going missing up and down the Golden Coast. A few incidents were even reported further south than Morante. The higher-ups didn't believe the last could possibly be Northsea, but after what happened in Einiba, they couldn't be sure. They were suddenly fighting an enemy that appeared to be popping in and out of existence everywhere.</p><br/><p>The Union had gone from controlling most of the known world's oceans, to controlling only the port in Morante in a couple of days. At the very least the entire Hidegold Bay region was silent, as if it'd vanished off the face of the world. Any ship that sailed north of the ghost city vanished. And most of them carried much-needed supplies.</p><br/><p>The plains could not hold without their supplies. The two years of war had stripped the plains clean, no crops were left in the field their forces could requisition, no rivers had any drinkable water left, no fruit tree or berry bush had not been picked clean. Their forces there were completely reliant on supplies shipped or carted in from elsewhere, and most of it was moved by ship. The forces could be kept alive by land supplies, but it was only barely enough to keep them from starving, not enough to keep them in fighting condition.</p><br/><p>The Union had to retake the seas, only, they didn't have the manpower. The first flotilla was wintering in Jigda, and the second was wintering in Chikdor's new dominion. The first could not be pulled because they were there at Jigda's request, and moving them would break their agreement. The second could also not be moved because Chikdor's dominion was the source of most of the supplies heading to the front, and their coasts were rife with piracy, if they moved the fleet they would only be worsening their supply situation, not solving any problems.</p><br/><p>The third flotilla didn't exist anymore, burned with Einiba and, though the crews were mostly alive, they had no ships. The fourth was on station in Hidegold Bay, but they were already engaged with Northsea, and had lost a flotilla of their own already. The biggest problem for the fourth was that they didn't know how to face their enemy. They didn't know how big their fleet was, but they clearly had enough strength to wipe out a patrol. How many should they mobilize, then? If they sent everything out, and the enemy could fight them, they'd only be destroying the flotilla. If they sent out less, but they weren't enough, they'd be whittling themselves down.</p><br/><p>Most of the crews knew this, and many refused to sail unless the entire flotilla moved, some even refused to sail at all, regardless of whether the entire flotilla sailed together. By the second month, however, they'd finally come to a decision and convinced everyone to follow it. They sailed out of the bay to have a decisive battle with Northsea and let the gods of the sea decide the victor.</p><br/><p>They sent out a different force than normal. They deployed all their ships save their two Subnims and their ramming ships, which stayed behind to protect the bay. They wouldn't be worth much in a confrontation with Northsea anyway since they couldn't sail well in the stormy winter sea in the north.</p><br/><p>The second clash between the two fleets took place not long after. They came across the captured merchant vessels heading for Silowas a day after leaving the bay, escorted by just four Blitzes. They sent out 39 LLDAWs -- 28 of which had a hundred corsairs on board -- 83 MSAWs, and a blademaster.</p><br/><p>The commander split the force into three waves, three kilometers apart. They knew from the one or two ships that had seen the burning of Einiba and survived, that Northsea only had 20 ships in the region, which operated in four contingents.</p><br/><p>The day was dark, the black sky peppered with the occasional snowflake. The darkness blinded by the vicious rocking of the ship in the waves and the darkness. The two sides only noticed one another when they were 400 marks apart.</p><br/><p>When the merchant vessels noticed the flotilla, they immediately swung out and ran strait for them. The Northsea contingent's commander made a grave mistake in that moment. Rather than immediately fire at the approaching enemy, he shot at the fleeing merchants instead.</p><br/><p>The chaos destroyed the fourth's formation and they suffered heavy casualties as they tried to avoid the merchants. Things soon cleared up, however. The first wave was ordered to keep the enemy busy while the rest of the flotilla surrounded them. They new Northsea couldn't match their numbers, so they were willing to pay any price to sink the enemy. Unfortunately, they severely underestimated their enemy, for which they paid dearly.</p><br/><p>The first volley aimed at the flotilla destroyed three LLDAWs. Another lost its masts and was dead in the water, though in no danger of sinking. A dozen MSAWs managed to close in, however, and started fighting the enemy's LLDAWs at close range. Those enemy ships weren't armed with cannons, only the usual ballistae, which the flotilla could match. Two of the four enemy LLDAWs were soon smoking.</p><br/><p>\"More enemy ships! They're six hundred marks away on our flanks!\" cried a lookout.</p><br/><p>Though his telescope increased his range, it was almost completely negated by the rough seas and the darkness. Though he noticed the second wave further than the first, it was still too late to pull out. Right at that moment, however, several of the ships shuddered in explosions of splinters. Moments later a blur of booms echoed across the ocean. The lookout didn't even need to check to know who it was. Senbaud had arrived with the rest of the contingent.</p><br/><p>Another volley from the four black ships wiped out the rest of the first wave. Six MSAWs were limping away. In exchange, however, Northsea's contingent had lost three LLDAWs.</p><br/><p>\"Give chase! Sink every last ship!\" Senbaud shouted.</p><br/><p>His voice had barely faded when the lookout shouted.</p><br/><p>\"Enemy ships to port! More than 30! Currently 700 marks and closing!\"</p><br/><p>Moments later he shouted again.</p><br/><p>\"Another thirty to starboard! Six hundred marks and closing!\"</p><br/><p>It's a trap!</p><br/><p>\"To port! Broadside to the ship forward! Break through the encirclement!\" the admiral ordered.</p><br/><p>The fourth flotilla's commanders had predicted the enemy wouldn't give up easily, but they didn't think their cannons would pack such a punch and have such a range. The first wave was reduced to splinters in just a couple of volleys. The two enemy detachments were separated from one another however, and flotilla's blademaster was slaughtering his way across one of the encircled black ships' deck.</p><br/><p>A few minutes later the other back ship was boarded as well.</p><br/><p>\"Turn broadside on our captured ships! We must not let the enemy take them!\" Senbaud ordered.</p><br/><p>Invincible did not expect the enemy to fire on their own ships even before they had completely fallen. The two ships were quickly reduced to rubble, and the flotilla's only blademaster was dragged down with them.</p><br/><p>--------------------------------------------</p><br/><p>Mini announcement:</p><br/><p>Here's this week's quiz question! Get it right and you will be given a chance to read ahead one extra chapter from public release (or your current tier if you're a patron)!</p><br/><p>What is the east and west continent called in the world of TS2? Please specify which is east and west.</p><br/><p>Send your answer to [email protected] and include your name and patron tier (submissions without patron tier and patron account name will be considered as a submission from a public release reader). We will give access to the early chapter during the end of the week's release.</p><br/><p>For those wondering what this quiz is about, it's an event where TRL readers will get access to one chapter ahead of their patron tier (one chapter ahead of public release for public release readers) by answering the quiz question correctly. The questions will all be about our other novel, The Sword and The Shadow (TS2) that is being hosted on volarenovels.com so go there to check it out if you haven't already!</p><br/>\n</div>"}