{"title": "Chapter 503 Captain Woodleis's Worries", "id": 503, "volume": 6, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-503-captain-woodleiss-worries", "volume_title": "Volume 6", "body": "<h1>Chapter 503 Captain Woodleis's Worries</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Captain Woodleis's Worries</p><br/><p>Thunderous booms echoed across the waves. Captain Woodleis had heard it came from Norton cannon fire. He could only hear the cries and screams of terror around him. When he realized the nearby ships were still intact condition and maintained their formation, he breathed a sigh of relief.</p><br/><p>Mermaid's Song, his LLDAM was his pride and joy; it could carry 5 tons of goods. The hard fight and sacrifice of three generations of his family, his grandfather, father, and now himself, had culminated in Mermaid's Song. She was his kingdom, and he was king. He had no interest in putting his ship on the line in someone else's war, but he had no choice. When one of the big-six demanded something, no one dared not give it. And so, he was now in the midst of a warzone, sailing with over a thousand other ships in what must be the biggest naval convoy in history, listening to ships exploding and people dying all around while he prayed he and his ship didn't become one of them.</p><br/><p>When he first got the order, he quickly made inquiries with his connections and learned why they were mobilizing so many ships so forcefully. Invincible was fighting with Northsea and they'd lost badly. Port Einiba had also been torched.</p><br/><p>Northsea had also captured almost every ship that sailed the surrounding waters for the whole season. Among them were ships and captain Woodleis knew, a few could even be counted as friends. Eima, Dragonfly, Molinmodren were just three that had been captured. He even heard rumours that Northsea's ships could spew fire and decimate ships from unheard of distances. One connection told him it had something to do with the dwarves and their gunpowder and cannons.</p><br/><p>The Union was utterly reliant on the sea to keep their soldiers on the plains supplied and reinforced, they could not afford to lose the sea. But that's what had happened for the last four months. They were desperate, and this convoy was their last answer, their last hope. This was their life line, not just for their war on land, but for their war on the sea as well. They desperately needed to resupply their armies, but they also needed to boost their navy's morale. They had to win a victory, and one that didn't cost them half their deployed ships.</p><br/><p>Captain Woodleis was one of the people they were trying to reassure. He suspected this voyage was not going to be peaceful, and, indeed, it wasn't. The danger began even before they'd left port. He was woken the night before they were scheduled to set sail by explosions. Northsea had attacked the bay where the convoy was anchored.</p><br/><p>He couldn't be more thankful that his ship was anchored the furthest away from the bay's entrance. Smoke was blotting out the stars by the time he got onto the balcony and he could see the glow on the horizon from the burning ships. It might well have become a second Einiba had the fleet's Swifts not taken immediate action and chased their attackers away. He thought of that glow every time he went to bed.</p><br/><p>The attack delayed their departure by a week while the bay's entrance was cleared of the burning wrecks. The men who saw the attack were forbidden to talk about it, but the grapevine could not be silenced. The fleet had apparently suffered heavy losses in the initial attack and during the chase that followed. They lost 50 medium supply ships and 20 Daws and 30 Swifts. The Nortons, on the other hand, didn't even suffer a single injury or a chip on their boats.</p><br/><p>It seemed the flotilla's commanders finally realised they weren't up against mere pirates, because they issued a new voyage plan the day before departure. Instead of sailing straight across the open sea to Hidegold Bay, they would not hug the coast all the way. This upped the travel time from 21 days to over 40.</p><br/><p>It was almost funny that the biggest fleet in history had to sneak along the coast like a small smuggler ship, but Woodleis knew this was the best option. The coast would force their enemy to attack from a predictable direction and kept them from being surrounded. Normally this would also mean that the ships would be cornered and could not escape, but the fleet's size made that a moot concern.</p><br/><p>The escort's main concern wasn't defeating Northsea, at least not for now. They had to keep the convoy safe until they reached Hidegold Bay. They would focus on escort duty until then and only bother with a full on confrontation once they reached the bay. The coast meant that the relatively smaller escort could better protect the convoy since they only had to defend one side, and it also meant that any damaged transports could beach themselves and save their cargo.</p><br/><p>\"This is the third time, huh?\" mused Woodleis as he listened to the distant booms.</p><br/><p>The coast was safer, but they weren't sailing fast enough for his taste. They were indeed crawling along. They'd been at sea for 21 days and they weren't even halfway yet. The first attack was the one in the bay. The second came fourteen days into their journey. It lasted three days. He suspected the enemy only withdrew because they ran out of either shells or gunpowder. Their escorts were quite a bit fewer when they returned. He couldn't be sure, but they certainly hadn't lost any less than 50, 70 was more likely.</p><br/><p>After that attack, ten sailors were moved onto Mermaid's Song. Woodleis was told it was to protect the ship in case the enemy broke through, but everyone knew they were rescued from the sunken ships and the escort didn't have space for them. He had his quartermaster and a few midshipmen make merry with them for a few days, after which they let slip a few details of the battle.</p><br/><p>The enemy admiral was very cunning, it seemed. He only had fourteen ships, but he sank numerous ships. He skilfully kept his fleet at their maximum range and peppered the escorts from there. If the escorts turned to pursue them, he'd run away and keep peppering the enemy as he withdrew. The escorts couldn't just keep chasing the detachment either, they had to stay close to the fleet. When they turned around to return to the fleet, the enemy admiral would also turn around and start peppering them again. The escort fleet had tried a couple of times to set a few traps for their harassers, but they never fell for them.</p><br/><p>Woodleis also learned a bit about the ships attacking them. They were very powerful. Their cannons could do significant damage all the way up to what seemed to be their maximum effective range, about 300 meters. They fired iron balls about the size of a big fist which shredded through hull, deck, and mast alike.</p><br/><p>The most talkative of the bunch was a man named Shira. He seemed very happy to babble about the enemy when alcohol lubed his lips. Woodleis didn't know how he'd gotten by without being whipped regularly all this time, the fleet didn't like babblers.</p><br/><p>\"So we really can't sink just a few enemy ships with our entire fleet? Surely their cannons can't sink our entire fleet before we've surrounded and closed in on them!\" complained Woodleis.</p><br/><p>Shira burped, \"Y-you... you don' un'ershtan. Northshea iz really hard'o catchch. They shail much fashter an'r much more agile than'r warshipsh. If we chashe'em, they'll draw ush out to shea and shink ush'ere. We shent thiry shipsh af'er 'em onshe an' ony three came back.</p><br/><p>\"Initially, our rammersh poshed a huge threat'o 'em. The.. the lash'ime... we managed'o chashe 'em away with'ose little rammers lasht time... But recently, they come with a cruel countermeas-sure. You know norm'l met'l cannonballs're about the diameter'f a bowl, right? Hic B-but they've an ev'n small'r one... pelletsh ab't the shize of a fing'rtip... Eash shot they fire'll launch a hun'r'd an' they'll spread all ov'r...</p><br/><p>\"'Fore this, they'd ushe thoshe larg'r cannonballs'o fire a'the ramm'rsh a'miss seven ou'of ten. Now they've switched'o these pelletsh, they le'the ramm'rsh ge'closhe an' fire when they're 60 met'rsh away. The poor bast'rdsh jus'vanish...\"</p><br/><p>Woodleis cursed his curiosity from that day onwards. Every night he'd wake up in a cold sweat. Dreaming of his ship being torn to shreds, and watching his crew crawling into his cabin, half shredded, cursing at him for bringing them to their deaths.</p><br/><p>He decided he'd escape the moment he got the chance. He'd wait for the escorts near him to chase after the Nortons and make a break for it. If he ran into the Nortons, he'd wave the white flag and plead for his ship. He was fine with having to spend some time under scrutiny if he could just keep his ship and crew. It wasn't like he really had a side in the war. He just wanted to keep trading.</p><br/><p>The next attack started a week after the previous one. They definitely had a supply base nearby, no way they could get to Silowas, resupply, and return in just seven days. He didn't even want to think about the other possibility, which was that these weren't the same ships, and that they actually have a massive fleet waiting for them somewhere up ahead.</p><br/><p>He didn't care who won the battle, he just wanted to make it out alive with his ship intact. He stroked the white flax cloth in his hands as the cannons boomed in the background. He carried the white flag with him all the time lately.</p><br/>\n</div>"}