{"title": "Chapter 506 Suicide Charge", "id": 506, "volume": 6, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-506-suicide-charge", "volume_title": "Volume 6", "body": "<h1>Chapter 506 Suicide Charge</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Suicide Charge</p><br/><p>\"The point of war is not to die for your country, but to make the other fucker die for his. So if you have no chance of survival, if you are certain to die, make sure you take ten of those devils with you!\" ~ Serhinem</p><br/><p>\"Why are you panicking?!\" Lorist cried as he drew his sword and shielded Jinolio.</p><br/><p>Clang! Clang! Clang! He parried more than ten arrows instantly. Cries of pain rang out all over the rest of his ship. The empty deck had been covered in arrows. The unshielded artillerymen and catapult operators had nowhere to hide and a third now lay dead and dying.</p><br/><p>Damn it! Lorist's heart sunk.</p><br/><p>Most of his men wore a layer of waterbeast leather that improved buoyancy instead of the usual armor. He trusted in his cannons and thought the enemy would be exterminated long before they had a chance to get into range to use their own weapons. His men were now paying for his shortsightedness.</p><br/><p>He didn't think Invincible would drag them down with them. They ignored the fact that the 60 plus ships ahead of them had been immobilized and destroyed by the chain shot and flaming rocks. They didn't retreat. Instead, they charged right through their own wrecks. Now they were within range of their own weapons and were beginning to reap his men's lives.</p><br/><p>The rain didn't stop.</p><br/><p>Lorist never imagined this would happen. His men were cowering wherever they could, not one of his weapons was returning fire. Only the Invincible fleet could pull this off. They shot one ship at a time, when one had to reload, another took over, making sure that the arrows never stopped falling on their enemies. If only he'd kept a few ballistae he could have returned fire. He couldn't sink ships with them, but they could keep the enemy suppressed while the rest of his weaponry did that job.</p><br/><p>\"Sixty marks and -- agh!\"</p><br/><p>The crew soon plopped down, its nest empty.</p><br/><p>Lorist jumped off the deck.</p><br/><p>\"Joe, protect Jinolio.\"</p><br/><p>He rushed to one of the catapults, grabbing its leaver and trying to reset it. Ovidis rushed over.</p><br/><p>\"Let me do it, Your Grace.\"</p><br/><p>Lorist drew his sword again and started parrying the incoming arrows.</p><br/><p>\"Get a few sacks of gunpowder from the cabin! Have the cannons fire again!\"</p><br/><p>Ovidis rushed into the cabin despite the rain. Soon, the bronze booming sounded again. They couldn't sink the firing ships easily, but the ones already on fire were a different matter. They were half-sunk already. As the flames faded away, the breeze unveiled the enemy. They were on half-sail. A few rows behind them came the Sabnims. Their decks teemed with archers.</p><br/><p>Lorist kicked the lever, and a rock flew.</p><br/><p>\"Load the catapult with gunpowder and get me oiled rope! Cut off half and ignite it, quick!\" shouted Lorist to Ovidis, who was coming out of the cabin with a few sacks of gunpowder.</p><br/><p>Ovidis cut half a piece of oiled rope with his sword just as a flaming arrow landed by his feet, setting the rope on fire. Lorist pulled the lever again, and the catapult sent the bag flying.</p><br/><p>It quickly turned into a tiny dot. A bright flash exploded just as it was about to hit the deck. The arches in the vicinity vanished.</p><br/><p>\"Quick, keep firing like that!\"</p><br/><p>Ovidis jumped in front of Lorist.</p><br/><p>\"Let us do it. Take back command.\"</p><br/><p>The surviving sailors heeded the call and soon the second bag of gunpowder flew. There were enough uninjured crew to man seven catapults. Lorist had one run back and forth below decks ferrying bags of gunpowder for the rest to fire. Lorist and Ovidis focused on parrying the arrows.</p><br/><p>After a flurry of flinging and explosions, the rain stopped. The charging wedge was reduced to a V, but they kept charging. The cannon-equipped ships continued to fire nonstop, with barely any effect. Mainly because the flaming ships shielded the rest. They weren't the usual, flimsy merchant ships. They were ablaze, but they just refused to sink.</p><br/><p>......</p><br/><p>Penelope hid his head in shame. He had fought a hundred battles, but he didn't have his men's bravery. When the 60 Daws lost their masts, collided with the second row, and were being assailed by catapults, he panicked. His first thought was to retreat. He did it in the name of preserving the fleet, but deep down he knew it was just to save his life. It didn't help that no one questioned his order. They'd finally found a countermeasure to the enemy, but these were losses they'd never suffered, and now they were using catapults as well? Was everything with the Norton name behind it destined to be more impressive than anything anyone else had? Even their catapults were better than what his side had.</p><br/><p>\"We can't retreat!\" called a determined voice just as Penelope announced the order.</p><br/><p>Serihanem stood out in the crucial moment and changed everyone's minds. They decided to fight the Norton bastards to the death even if they only bloodied their nose. It wasn't like they would ever get such a chance again. The Nortons were bastards, but they weren't stupid. They'd have a new tactic or technology next time and things would only get worse. This was their one and only chance.</p><br/><p>\"We have a chance at victory as well!\" Serihanem shouted.</p><br/><p>He'd predicted this would happen to the vanguard, so he'd kept their corsairs back. If they could charge through and make it to the enemy ships, they still had all their close quarters strength intact and could wipe the enemy out.</p><br/><p>Everyone cheered and their resolve returned. The enemy's painful wails shortly after only bolstered their resolve. Not long after, however, the enemy retaliated. A bag with a flaming rope soared over the burning ships and exploded right above their decks.</p><br/><p>\"What the hell?!\"</p><br/><p>\"Forget about it!\" Serihanem shouted, \"Forget about everything! Just charge forward!\"</p><br/><p>The horns blared. The men shouted. The ships charged. Everyone ignored the intermittent explosions, the smell of burnt flesh, and the cries of their friends and comrades.</p><br/><p>The enemy cannons fired incessantly. The ships shook with every boom. But no one cared anymore. They saw only the devils in front of them and heard only their own desire to kill.</p><br/><p>......</p><br/><p>A man-sized rock bounced on the deck next to Lorist. The man only glanced at it momentarily before turning back to the enemy ships barrelling towards them.</p><br/><p>\"Quick, prepare the chain shot!\" instructed Howard impatiently.</p><br/><p>Only four of the ten cannons on the deck were still manned. The rest were abandoned, their crew laying dead or dying somewhere nearby.</p><br/><p>\"We're out!\" yelled an artilleryman.</p><br/><p>Howard watched the enemy ships close in.</p><br/><p>\"Prepare the scatter shot, then! Get a sword or spear for each of you as well! Prepare to repel boarders!\"</p><br/><p>His words had barely left his mouth when a massive explosion wracked the ship to his left. His eye settled on it just in time to see one of the wheeled cannons splash into the water in front of the ship.</p><br/><p>\"Fuck them! What the hell are they doing?!\" he roared.</p><br/><p>Someone must have dropped a match onto the store, or they'd used too much gunpowder and blew up the cannon.</p><br/><p>The enemy's cheers drifted on the breeze soon after. The enemy's weapon glints were starting to break through the smoke as they closed in. Each rammer had 24 rowers, twelve to a side, and they pulled with all their might.</p><br/><p>\"Rammers! Lower the cannons! Fire the scatter shot!\"</p><br/><p>All the artillerymen were familiar with these rammers. Scatter shot was the most effect. So everyone was ready with it. Unfortunately they were already too close. The shot didn't have time to spread out enough, so they couldn't hit multiple ships with one shot. Only thirty of the incoming 100 were hit.</p><br/><p>A few seconds later the first rammers made contact. Grappling hooks soon sunk their teeth into the railings, and enemy corsairs started pouring onto the decks. Soon booming cannons were replaced with clanging swords.</p><br/><p>Lorist's gaze settled on a Sabnim nearby. It was ramming into a whaling ship a bit down the line. The ship creaked and started to split in half. It held, only to be swarmed by enemy corsairs like ants swarming a carcass.</p><br/><p>The crews still with their cannons turned them on the boarding enemies and turned them into a paste, but the rest just kept charging.</p><br/><p>Lorist's gaze froze. \"Jinolio!\"</p><br/><p>\"Yes!\"</p><br/><p>\"Order the Saws on the right flank to move in! Form a secondary firing line on the flank and splinter the enemy ships! Bring the guards in the cabin out as well! I'm going to clean up the mess!\"</p><br/><p>\"Yes!\"</p><br/>\n</div>"}