{"title": "Chapter 516 The Angle of Merchants", "id": 516, "volume": 6, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-516-the-angle-of-merchants", "volume_title": "Volume 6", "body": "<h1>Chapter 516 The Angle of Merchants</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>The Angle of Merchants</p><br/><p>\"It is sometimes better to give up a city, than to fight for it.\"</p><br/><p>Just as Lorist was wracking his brains over the livelihoods of the city-folk on the 33rd day of the 6th month, the seventh day of House Norton's occupation of the city, the 400 thousand Union troops on the front-lines finally got word of the city's fall, as well as the occupation of Mass and Gypsy.</p><br/><p>All the commanders seemed to have been done in the posterior. They instantly broke into a huge frenzy. The finally realized why the enemy had kept attacking them for the last two weeks.</p><br/><p>The forces that had most troubled them, and continued to do so now, were House Norton's two other legions on the field: Tigersoar and Jaeger. They always had the upper hand in their confrontations and made the Union eat dust far too many times. They'd swept over every obstacle since the moment they showed back up on the front-lines and pushed the front-line back by a large stretch. If they hadn't had to return to the Northlands when the rebellion broke out, the war would likely have been over already.</p><br/><p>They had to admit that House Norton and its damnable armies were far beyond their ability to fight. Luckily they were only a small fraction of the total enemy army. The rest of Andinaq's forces were incompetent at best, and downright dangerous to their own side at worst. A cake walk for the Union. So far they'd made up for the losses they suffered at the hands of House Norton's forces with victories against the rest of the enemy forces.</p><br/><p>They won every battle in which House Norton was not involved. And beat Auguslo like a bully would beat a retard. It was almost sad. They'd done especially well during House Norton's absence and were on the brink of victory. But that damned fool just had to clean everything up just in time and send his men back into the fray. In just a few months they'd gone from being on the brink of victory to being on the brink of defeat. With Morante's fall, that was no longer just the brink of defeat, but the brink of total defeat.</p><br/><p>The Nortons didn't strike their strongest fortresses; they hit only where the Union was weak. It wasn't very efficient and had confused the Union for a while. Why would House Norton, known for striking decisively and trying to end things as quickly as possible, now hit large inconsequential places? The attacked slowly opened a hole in the lines in the far north of the plains, and they rushed in, forcing the Union back quite a bit. It took the Union three days and a hundred thousand men to close the gap.</p><br/><p>It wasn't enough to stop them, however. Jaeger and Tigersoar didn't meet them on the field. They just melted away whenever the Union showed up. They soon lost track of the two legions entirely. When next the two legions were sighted, they were opening another hole in the south of the plains. It took four days this time to close the hole. Again the enemy melted away when they showed up and struck somewhere else. This quickly sapped them of their momentum and soon Andinaq had the initiative.</p><br/><p>The Union's upper command, led by Twinhead Dragon's president, Cobleit, was painfully aware of this fact, but they could do nothing. Most of their troops were infantry and could not keep up with the mounted enemy. What little cavalry they had were all in personal guard units and no noble was willing to let them go out and face an entire legion on their own, not to mention that it would leave the nobles unguarded. They'd considered, for a while, sticking infantry on horses and just throwing them at the enemy, but horses were in cripplingly short supply.</p><br/><p>Only two places on the continent bred horses in any real quantities. One in Andinaq's territory, the other straddled the border between Romon and Khawistan.</p><br/><p>The Union had once been capable of fielding a 30-thousand-strong cavalry force, back during the War of Glass, but it'd taken generations to build up the horses and expertise for that unit, and the wars since then had all but wiped it out. They couldn't replace them either since both powers had stopped their horse trading with the Union, and Andinaq would certainly not sell them horses.</p><br/><p>Lorist had played with the thought of joining the horse business, but it wasn't lucrative enough to be worth it. It certainly didn't help that the horses native to his territory were lean, relatively small, and weak compared to proper warhorses. They were fine for farmwork and other civil duties such as transport, but ill-suited to warfare, especially if they were to be armored to keep them alive.</p><br/><p>The Union had been on the brink of negotiating a deal with Duke Fisablen several years back, but then Lorist attacked the duke and destroyed their plans.</p><br/><p>The Union now paid for their lack of cavalry. The Nortons bullied their men with impunity. They could strike at a moment's notice, and didn't even have to bother with planning since they could just run away if things were looking bad.</p><br/><p>Fisablen and Felim's cavalry suffered heavy losses two years earlier because they used them to take on strongholds, the worst thing one could do with cavalry besides trying to fight a navy. Tigersoar did not have that problem. They used their cavalry only to strike ill-defended positions and moved their catapult brigade against heavier positions.</p><br/><p>The Union had built up their own catapult forces using the blueprints they got from The Northlands, but, while they were better than their old ones, without the right materials they were still no match for their Norton counterparts. Though every fort, castle, city, and stronghold was armed to the teeth with catapults and ballistae, they could do nothing as the enemy's rocks soared in from beyond their range and pummeled them into dust and bloody pulps.</p><br/><p>Duke Cobleit, had been brainstorming plans to deal with the two legions for two days without sleep and was on the brink of collapse. He had just sent for his aides, advisors, and subordinates for the umpteenth time when he got news of Morante's fall. He fainted even before he could vomit the blood that suddenly burst into his mouth from that magical gland the people of Grindia had that stored blood for just such occasions. It was left to drool out of his mouth as he lay, convulsing, on the floor.</p><br/><p>He was woken by his men several minutes later, his attack having passed, to hear of Mass and Gypsy's fall. He empty's that special gland, wiped his mouth, and started the meeting.</p><br/><p>A few hot-headed youths among the junior staff clamored for revenge. They wanted to march on Morante with the entire army immediately. Their wiser seniors were wary of such a reckless move. They suggested redeploying only a part of the army. They suspected House Norton's two fielded legions would move the moment they noticed a thinning of the front-lines. If they turned their backs on them, they'd be wiped out.</p><br/><p>The two sides fought endlessly in the tent. One side accused the other of cowardice, whilst the latter accused the former of stupidity. Cobleit was forced to adjourn the meeting for the day so everyone could calm down and think things through on their own.</p><br/><p>He called a second, secret meeting with the other guild-heads in his private quarters.</p><br/><p>Duke Peterson wanted to know why they had to have a secret meeting.</p><br/><p>Cobleit smiled wryly.</p><br/><p>\"Information will leak easily with many people, and everyone is too emotional right now to think clearly. I'll be plain and direct. We've lost. This war is over. All we can hope for now is a good exit. We haven't lost because the Nortons took Morante, if only that we could still turn this around. We lost because those bastards sank the fleet and took the convoy. There's no coming back from this, there isn't even a stabilizing of this.\"</p><br/><p>Duke Chikdor's expression fell apart.</p><br/><p>\"Impossible!\"</p><br/><p>\"Nothing's impossible,\" Cobleit countered solemnly, \"They started their attack from Hidegold Bay. We had a whole flotilla there, and the rest of the fleet was heading there. They've obviously been lost. You should've seen the fourth's report regarding their clash with the Norton fleet. They call it a victory, but it was a rout.</p><br/><p>\"We've not heard from the rest of the fleet for a month. They're gone as well. It's even more certain with the bastards having taking Morante. I suspect we'll hear of the fleet and convoys' demise in a few more days, but even if they weren't taken or sunk, we have no way of bringing supplies in by sea anymore and land transport is too slow. We should make our preparations.\"</p><br/><p>\"Shouldn't we take back Morante immediately even more if that's the case?\" asked Peterson.</p><br/><p>His angst to retake the city made sense, it was their capital. It wasn't just a matter of practical problems as a result of its loss. It having fallen to the enemy at all was bad enough for their honor and reputation already, but if it was still in enemy hands when they called it quits and surrendered, their honor would be completely destroyed and they'd never </p><br/><p>\"No, we can't turn back,\" said Cobleit, shaking his head.</p><br/><p>\"Why not?\"</p><br/><p>Peterson aside, the other presidents also let out shocked gasps.</p><br/><p>\"Think about it. What benefit does taking the city have? There are no food stores, so we don't get back supplies. Besides the losses we'd have to suffer to take it back, it would be a burden on us rather than a benefit. We'd have to find food elsewhere suddenly to feed the million people. We're already struggling to feed our million people here, how will we feed double that amount?</p><br/><p>\"Morante isn't the anchor for our rule anymore, we can do without it. If anything, losing Morante has lightened our burden quite a lot. The biggest benefit is that we don't have to worry about feeding a million people that don't give us anything in return. Without our extensive trade network, all those merchants and craftsmen in the city are worthless. The farmers and miners, woodcutters and hunters in the rest of our lands are worth far more right now. We don't have to worry about the enemy pushing beyond the city much either. They won't be able to hold the city for long, hell, I wouldn't be surprised if they're already losing dozens of men a day keeping the people at bay. Remember why we moved out of Morante in the first place, and why we didn't hand it over to someone as a fief. The people in the city are completely dedicated to the idea of freedom and equality because of our propaganda during our war with the Krissen Empire. They'll never accept being ruled over by nobles. That same sentiment will be even stronger when the noble took over by force and is a sworn enemy of the Union.</p><br/><p>\"Let them keep Morante. This is actually an opportunity to inflict heavy losses on them. Send agents to infiltrate the city and whip the people up into revolt. They want to take Morante from us? Let's show them how stubborn the people there can be, and bleed them dry while we're at it! Even if we have to lose the war, we'll make sure they don't have the people to work the land they'll get and will be forced to pull back to their stinking castles!</p><br/><p>\"We'll hold out in our dominions and wait for them to have to withdraw, and sweep in as the saviors again. If we play our cards right, they might even be so much weakened we can just march into their lands and wipe them out.</p><br/><p>Cobleit's words didn't invigorate the other presidents.</p><br/><p>Duke Forde sighed.</p><br/><p>\"Have we really lost the war, Cobleit? Can we not turn this around somehow?\"</p><br/><p>\"I wish it were otherwise, We've not been bested on the field, but we can't keep this war going any longer. That bastard Norton struck us where we couldn't afford to be struck. We can't just keep fighting on the front-lines because we don't have the supplies, but we can't turn back and march on Morante because his allies will stab us in the back if we do. Not that taking back Morante will do anything, without the convoy and its resources, we'll starve in a few more weeks, anyway.\"</p><br/><p>\"We still have 400 thousand men, though, right? They can't just swallow us whole!\" Duke Riwald interjected.</p><br/><p>\"Numbers alone don't matter. In fact, having that many makes us even weaker right now. Our supplies will run dry much faster because of our numbers. We can have all the men in the world, without food, every additional man just starves us out that much faster.\"</p><br/><p>\"What do we do now?\" asked Peterson.</p><br/><p>\"We should conserve as much of our core and elite units as possible, the 200 thousand of our personal retinues, mainly. The rest can be sacrificed to cover our retreat. March the freedom zealots from Morante back to the city to hold them down. Charge the remaining hundred thousand against Andinaq here while we withdraw.\"</p><br/><p>Cobleit brought over a map.</p><br/><p>\"We'll charge them into the enemy here, here, and here and withdraw while the enemy's focused on dealing with them. We'll head for Mauvlin as fast as we can. Everything between here and there is wasteland thanks to the war, so we lose nothing by giving that up. Mauvlin is the best place to defend. We can also keep our 200 thousand men fed with the rest of our territories and it's much closer to them so we will have an easier time getting the food there.\"</p><br/>\n</div>"}