{"title": "Chapter 530 Loan Problems", "id": 530, "volume": 6, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-530-loan-problems", "volume_title": "Volume 6", "body": "<h1>Chapter 530 Loan Problems</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Loan Problems</p><br/><p>\"A man buys a slave not to sit in the closet for the rest of his life, but to work for him and earn him money. Why, then, do men hide their money in their chests? Should money not, like the slave, work for its owner?\"</p><br/><p>Lorist got a message from Silowas on the 21st of the 9th. Charade and Duke Fustat had come to an agreement. House Fustat would pay a million gold Fordes for the duke and his legion. House Norton would send them back with Northsea.</p><br/><p>Each soldier's ransom was ten gold. Five hundred thousand in all. Fustat, the gold, and the silver knights combined were a million. Charade didn't hold back at all. Windsor Prinna didn't get much of a discount.</p><br/><p>Duke Fustat made a tempting proposal when he was released. The legion was stripped of its weapons and armor when it surrendered. He wanted to buy equipment from Lorist before he returned home. Charade was all too happy to oblige the duke -- this was no small deal, at least 60 gold per soldier, three million in all. Unfortunately, Charade did not have the authority to sell equipment to technical enemies, so they had to talk to Lorist himself.</p><br/><p>Charade also passed along news he got from Sylvia and the rest. They were heading to Silowas. They would all leave for Morante in a couple of days.</p><br/><p>Why is Sylvia coming to Morante? Don't tell me she heard about Wenna and wants to keep an eye on me. No, surely not... Didn't Charade tell her I refused to see the woman? I haven't done anything to give her a reason to come...</p><br/><p>Whatever. Those women are a force of nature. I'll worry about them when they arrive, no point in losing sleep before then.</p><br/><p>If only she wasn't that young and Lorist wasn't always out on campaign. She missed him very much and worried incessantly. Perhaps he should treat this as a vacation and spend some time with them and show them around the city which was his hometown for over a decade.</p><br/><p>Spiel requested an audience two days later. He had been given charge of the prison camp near the docks and had been trying his best to empty the inhabitants' wallets. This had been settled since Charade and Kaet made their agreement two months earlier. The second last group of 10 thousand were now being moved to Mauvlin, completely broke. In total, Spiel had brought in seven million gold, mostly in jewelry and other valuables.</p><br/><p>He had come to complain because the last ten thousand refused to part with their money. They'd been living off the free food and weren't doing anything to spend their money. Lorist gave up, he couldn't get the people to let go of their money, and his patience was running thin with Kaet, who kept sending him letters of protest almost daily, so he ordered Spiel to just let them </p><br/><p>\"I need just one more month. I'll get their money if I have just another month,\" Spiel begged.</p><br/><p>\"Let them go. One more month would have been worth it for 20 thousand, but we'll lose more than we'll make for just 10 thousand people.\"</p><br/><p>The money wasn't the only problem. Tarkel had done his best to put up their facade of struggle, but it was only a matter of time before their real situation leaked, and that became more likely with every passing day. For one, the Union had gotten sniff in the nose that something was off with the constant requests for more agents and had stopped sending them.</p><br/><p>Morante was also starting to improve enough that a keen eye could see it even from outside the city walls. The factories were getting back up to speed and the merchants would soon come from the south to begin large scale trading again. Even if Lorist could keep up the facade until then, it would crumble the moment the merchant ships sailed into the harbor.</p><br/><p>There was also the problem of Kaet noticing the livelier atmosphere and sending word back to the Union directly. He was being kept separate from the main population, but once things got really lively, he'd hear it. What city's people laughed and cheered whilst in the midst of constant uprisings and bloody street fighting?</p><br/><p>No, it was time to wrap things up and pull out.</p><br/><p>\"The new government's made a request. They want to borrow ten million gold. Everything will be invested in the city and the surrounding areas, so I've agreed. I just need you to iron out the detail. Deal with it as soon as you're done with the final arrangements for the camp,\" commanded Lorist.</p><br/><p>Such loans were usually issued at high interest rates. The shrine of the Goddess of Wealth and Trade's, Zejin's, primary income was from high-interest loans, though they also had a stake in the Forde bills industry. The guilds would deposit money with the shrine and get a bill of equal value which they could turn in at any other shrine for the money, for a fee, of course. The money was safe, both for storage and for transport since no one acted against the shrine.</p><br/><p>It was much like the Catholic Church from Lorist's previous life. The shrine was as much a bank as it was a religious organisation. The Union had paid his ransoms completely in bills as well. They might have thought he'd ransack the shrines anyway, so they'd pay him in a way so he wouldn't get anything more, anyway. If he really did ransack the shrines, the bills would be worthless, anyway.</p><br/><p>The shrine begged that they not cash all the bills at once when Charade and Spiel took them to the shrine. The shrine's entire vault came from the Union, so if everything was paid out, they'd be bankrupt.</p><br/><p>Spiel jumped like a cat whose tail was stepped on.</p><br/><p>\"No, Your Grace! How can you agree to this? They already owe us four million! If we give them this as well, they'll owe us fourteen million! They can't service this loan, and even if they do, it'll take decades, maybe even a century for them to pay it back!\"</p><br/><p>If this was anyone else, Spiel would gladly have made the loan, but this was too risky. The new government didn't even have anything to put up as security!</p><br/><p>Lorist had agreed, however, despite knowing how horrible a deal this was.</p><br/><p>\"Think about all of our people that've died in this war. We've gotten just barely more than nothing from this and now you want to piss millions away? You're pissing away everything we've worked decades to build!\"</p><br/><p>\"Oh, tell me how much we made, then,\" said Lorist coldly.</p><br/><p>\"We got ten million from the city in gold and goods. We got ten million in basic material from the outskirts of the city, but it's all completely useless and there isn't a market for the stuff. The ransoms also got us just over six million, and we got just over seven from the prisoners.\"</p><br/><p>\"In all we made 23 million, but four of that's already been lent to the new government. If you take away the money we spent on food, we have just over fifteen million left. If you give them another ten, we'll have just three million!</p><br/><p>\"You said logistics is the key to war. Just the last three months of campaign have cost us one and a half million, and then you put aside another five for Northsea's retrofit. And then there're all the pensions for the wounded and the compensation for the dead, which is another half a million.\"</p><br/><p>\"Enough. I understand. This loan would put us in the red, yes? But what would you do with the ten if we kept it? You're just going to ship it back to the dominion and shove it into our vaults to rot. You remembered my comment about logistics, but it seems you forgot what I said about money. Money is worthless unless it's flowing in the economy.</p><br/><p>\"Besides, you forgot a lot of benefits. What about the money we got from selling food in the city? What about the money we got from the trade with the merchants? The four million we lent will earn us interest, and it'll help get the economy here back up and running and we can sell stuff here as a result.</p><br/><p>\"I trust your loyalty, but your eyes disappoint me. You know what we plan to do here. But the new government isn't yet sure if we'll be any better than the old Union. I bet you this loan is less about them lacking funds, though they no doubt do, and more about testing our commitment to supporting them. Loaning them this money is us guaranteeing them that we will stand by them and guarantee their independence. You talk about security on the loan, this loan itself is their security on our support.</p><br/><p>\"Stop questioning my financial decisions and just do what I say. This loan will let them form a decent military, which means we can pull out and send out people home. The rest will speed up their development and let us start selling into the market in larger volumes faster.</p><br/><p>\"This is a great deal for us, actually. Ten million now will get us a great buffer against the old Union, a decent ally, and a good share in a market that will earn us hundreds of millions over the coming decades.\"</p><br/><p>\"...I understand. I shall do as you wish, Your Grace.\"</p><br/>\n</div>"}