{"title": "Chapter 558 Dominion for Rent at 3000 Gold", "id": 558, "volume": 6, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-558-dominion-for-rent-at-3000-gold", "volume_title": "Volume 6", "body": "<h1>Chapter 558 Dominion for Rent at 3000 Gold</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>\"Good investments don't have expiry dates.\"</p><br/><p>Jindoz hurried to Lorist the next day.</p><br/><p>“Your Grace, did we do something to offend you?” asked he.</p><br/><p>“Huh? What do you mean?” asked Lorist.</p><br/><p>“Why did Baron Charade come and ask us to lease the land next to the harbour to you?”</p><br/><p>Ah, that was what he was talking about! So he'd over-thought things and come to the wrong conclusions.</p><br/><p>“You misunderstand, Jindoz. I asked Charade to rent that land for you. Currently, peace has returned to Falik Plains and we have no reasons to be here. Our main forces are going home, they'll be almost entirely gone by the end of the year. The original plan was to send the fleet home as well, but then I remembered you guys don't have a fleet. It'll take you a lot of time to build a new one, so I thought of leasing an area next to the harbour from you as a base of operations for my fleet in the south.</p><br/><p>“I'm also not very fond of putting military and civilian ships in the same place, it's not good for security. I also don't think it's right for us to use your facilities for free, especially not of we're going to be equals, so it would be best to lease some land from you and build a naval base.”</p><br/><p>“I see,” Jindoz sighed with relief, “The Union is not yet ready to start building a fleet, so we'll be reliant on you for some time yet. But you don't have to pay for it. We'll give you a payment free lease.”</p><br/><p>“No, we can't have that. You're at peace and you're an independent nation, plus Morante is your capital, we can't be rooming here without a proper agreement. If we aren't paying for the lease, others might suggest you're selling yourselves out. Besides, with how quickly trade is picking up, the harbour is due for an expansion, anyway.</p><br/><p>“This isn't wild guesses either. People might not think much about us being here like this right now, but what about in three years? If things continue to pick up, we will be in the way soon and people will become irritated and start asking questions. Better to move out of the harbour before the situation sours.”</p><br/><p>“Aren’t you over-thinking things a little?”</p><br/><p>Lorist smiled.</p><br/><p>“It’s just a precaution. I have always been straightforward with my intentions. I'm just looking at the bigger picture and taking preemptive measures.”</p><br/><p>“...Alright. Where do you want to build your naval </p><br/><p>Lorist tapped on the map on the wall depicting the greater Hidegold Bay area.</p><br/><p>“Here. This is the place we want to rent.”</p><br/><p>“What?! But, Your Grace, that's barren land. It's nothing but bedrock and reef!”</p><br/><p>Hidegold Bay was almost more of an inland sea than just a bay, and its entrance was a large channel cleft between two mountains. It shielded the bay from storms and the worst of ocean weather, which made the bay ideal for fish colonies, and thus fishing and human settlement, but also for hosting large fleets of ships. The two mountains themselves and their surrounding mountainous ridges were bare rock. Only the occasional tree broke ground on their faces. The numerous cliffs were home to many birds of prey, most of whom hunted fish in the bay.</p><br/><p>Millennia of such calm waters also let murky-water reefs grow quite extensively along the inner coast of the bay. They narrowed the channel down to a thin corridor which ships had to navigate to enter or exit the bay.</p><br/><p>The inner reaches of the bay was shaped like a gourd, or a water droplet. It opened up from the thin entryway to a large bulbous sea which terminated in a gentle curves coast like the bottom of a water droplet. The water inside was not just calm, but exceptionally warm and fertile, especially since the continent's largest river, the Silver River, fed into the bay. It was a large, muddy river that constantly carried rich sediment into the bay. It looked very much like the Yellow River of Lorist's old world, though it flowed much lazier.</p><br/><p>Morant sat at the southern extreme of the bay where the bay was at its widest. The bay's shores were sparsely populated besides Morante, especially the riverbanks and bay entrance. That area was entirely unsuited for human settlement, but that was where Lorist wished to build his naval base, right by the entrance to the bay.</p><br/><p>“Yes. I want to lease that land. Fifteen kilometers of coastline stretching several kilometers inland as well,\" Lorist nodded, “Military and civilian spheres of operation should be kept separated as much as possible.”</p><br/><p>“But... isn’t it too far from the city? It'll be a task to move supplies, plus you'll have to build the base from scratch. And why so much land? That's an entire barony!”</p><br/><p>It would be better for the fleet to be close to the city. Other things aside, the food they consumed was a good source of income, not to mention other money the sailors would spend in the city. Norton soldiers were generous with their spending and good, rule-abiding folk. They were far better than common freeloading soldiers and were most welcome in many taverns and brothels.</p><br/><p>“That’s because apart from building the base, I plan to provider living space for the families of the men for the time they're stationed here. Naturally most of them will only be here or a few years before going back home, but in that time I'd like the families to stay together. We can set up a ferry to the city to solve the transport problems. It shouldn't be a problem, right? It's not like you have a use for the land, anyway.”</p><br/><p>“This... for how long do you intend to lease it?\"</p><br/><p>“Well... we still have to make our final decision, part of it depends on what you want for the land. I’m sure you understand we're not just giving away money, we need a return on our investment. The lease will be for at least as long as it takes for us to earn back our setup costs, but you can discuss that with Charade.”</p><br/><p>Jindoz bowed respectfully and bid his farewell.</p><br/><p>Charade reported the deal's agreement three days later. The lease was for the next 99 years. Charade had wanted to push for 150, but Jindoz would have none of it. The rent was 3000 gold. Charade was, however, a little disconcerted that the land was desolate, it might be a waste to invest so much money to develop it.</p><br/><p>“Hehe. Just 3000 a year? Charade, you've outdone yourself! That bit of land and coast is unbelievably valuable. It might be desolate, but it gives us a base of operations from which we can not just control Hidegold Bay, but project our power and influence to the rest of the southern half of the continent. And then there's the reef!”</p><br/><p>Lorist took a pencil and began sketching the area in question.</p><br/><p>“See?”</p><br/><p>Lorist connected the reef area with the shore of the entry point of the bay. Now, it looked like an outstretched fist from the shore.</p><br/><p>“Your Grace, you mean to build another seafort like the one we built near Cape Romani?”</p><br/><p>Lorist nodded.</p><br/><p>“The reef isn't very big, but it's still enough to let us put cannons there. We'll have iron-fisted control of the bay. Controlling that bit of land and sea is the same as controlling all of the bay, and with it all of the trade going on in Morante.”</p><br/><p>“Who will you give the task of building the fort? How big do you want it?”</p><br/><p>“I was only going to build a naval base for the fleet originally. I didn't expect the Union would give us the whole stretch of coast and land I demanded. I was only starting with a high bid so I had room to compromise and negotiate. And with the length of our lease contract, we have more than enough time to recoup the costs of developing the area. If everything works out, the entire fleet's operating costs could be covered by that little bit of land alone.</p><br/><p>“As for the development itself, our first priority is sending out surveyors. Send a division along to occupy the territory as well. Since it's coastline, send an artillery brigade along. As for who to put in charge of the project, Howard is obviously the best choice, he's the only one with actual experience in this sort of thing. You can also put him in command of the base and make him the governor of the area. It will be good practice for when he retires to his own dominion. What do you think?”</p><br/><p>“Everything seems in order. I have no worries with Howard in charge. I'll have Malek send some surveyors to the area as soon as possible. My only question is where we get the manpower?”</p><br/><p>“Just contract a few guilds in the city and let them handle the civilian side of it. But the military installations and the harbour and docks we have to build ourselves.”</p><br/><p>“Very well. Let me get to it immediately. I'll leave with Malek tomorrow.”</p><br/><p>“I’ll come with you. I don’t have anything to do tomorrow, anyway.”</p><br/>\n</div>"}