{"title": "Chapter 566 Belief and Supervision", "id": 566, "volume": 6, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-566-belief-and-supervision", "volume_title": "Volume 6", "body": "<h1>Chapter 566 Belief and Supervision</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Hey Guys! Prince here.</p><br/><p>So I made it through surgery, now four and a quarter teeth lighter; three wisdom teeth, one molar, and a quarter of a poor bystander which will have to be fixed once the mouth is in working order again.</p><br/><p>The worst part for me is always waking up from anaesthesia afterwards. That feeling of being awake but with only half your head working is the worst! Anyway, I look and feel like I've been through a boxing match, and I suppose you could say I have. The pain medication is doing its thing, though, and, whilst making me feel like I haven't slept in days, it keeps the pain at bay. So I can get back to editing and you guys can get back to reading.</p><br/><p>Don't forget to join our discord server if you guys want to hear about these kinds of shenanigans as they're happening or just want to argue with people over which of Lorist's concubines makes the best waifu.</p><br/><p>Toothless regards.</p><br/><p>Prince</p><br/><p>“You can’t let these foreigners spread their superstitions in your land. These supposed representatives of the divine are just a bunch of power and wealth hungry dogs. They would pray for any place that’s prosperous and rich and use the excuse of converting people to scour wealth. Some of them even preach disloyalty to the secular lords. You can’t let the Morantian shrines into your land.”</p><br/><p>Viscount Hector, governor of Wild Husbandry, was the first to oppose the shrines. He used to be an apprentice instructor in Mobel Academy in the imperial capital. He escaped the war and fled to Silowas, becoming Whitebird Town’s secretary. He was accepted into Lorist’s service when the duke retook the island and slowly rose through the ranks to the position of governor thanks to his excellent ability in administration.</p><br/><p>It was common knowledge that back when the Krissen Empire was in its prime, a few emperors ignored the shrines. Krissen IV famously chased shrine ambassadors out of the empire when they went to ask him for permission to spread their faith in his empire.</p><br/><p>He believed the empire was founded by the labour of man alone, the gods had no place in it. The only time he ever heard the gods mentioned, was in the prayers of soldier before going into battle, yet no god ever came to aid them. He believed in his hands and his sword alone.</p><br/><p>In response, the shrines did most of their conversion and proselytizing near the empire’s borders were the emperor and his forces rare tread. The most prolific of the shrines worshipped the wargod, the god of wisdom, the goddess of the earth, and the goddess of the silver moon. But the emperor was considered the spirit of the nation, so since he did not believe, most of his people did not either and even those that were converted, were lukewarm believers at best. The shrines could thus not get enough money to fund their activities from the people and were forced to return to Morante after the war ended.</p><br/><p>The instructors-in-training and budding officials in Mobel Academy were trained to follow in the footsteps of the imperial family. Since they practically worshipped the emperors, they were vehemently opposed to the shrines. The shrines claimed the gods were the ultimate authority over the world, which was an affront to the right of the emperor to rule over his empire.</p><br/><p>Charade was of a different opinion, however. He believed it was inevitable that the shrines would wish to come north after they saw how prosperous the north was through the trade done in Morante. Lorist had many subjects and they were, on average, far more wealthy than any other land’s people. The shrines wanted a piece of the pie and there was no real way get them to give up.</p><br/><p>The shrines couldn’t compare to House Norton’s might, but they had the commoners’ hearts. If Lorist blatantly opposed the shrines, he risked alienating his people. Most of his subjects had been forced to move into his lands from elsewhere, from places where the shrines were dominant. As a result most of his people were believers in the gods. Their hatred for Lorist and his forces had begun to mellow because he had given them good lives, but if he attacked or slighted their faith, that might all be undone.</p><br/><p>There was also the matter of the political implications of turning away the shrines. Lorist was supporting the Free Union, and the shrines were one of the greatest factions there. Turning them away would strain his relationship with the Free Union.</p><br/><p>Charade was in favour of letting the shrines operate within Lorist’s dominion, on condition that they were closely monitored and regulated to ensure they didn’t spread any messages or beliefs that conflicted with Lorist’s objectives and interests.</p><br/><p>Kedan also shared his opinion, a rare occurrence. He was of the same mind as Charade. Being in charge of the police, he had a firm grasp on what was going on in Lorist’s dominions. The people were naturally superstitious, and needed some spiritual force in their lives. Without the shrines there to fill that role, countless cults had sprung up across the land and they were the primary source of crime and unrest at the moment.</p><br/><p>The house had opened many halls of learning, but it would take decades for the population to become literate and be well-educated enough to not fall to superstition. And most of those being taught were children, the adults were all still just as uneducated and superstitious as before. Their superstition made them believe their good fortune was thanks to favour from the gods, rather than good governance by Lorist and his vassals and subordinates.</p><br/><p>A couple of villages in Redriver Valley, for instance, had recently started worshipping a wiccan god said to live in the nearby Black Forest. They frequently made blood sacrifices under the full moon. Two children, a boy and a girl, would be killed as sacrifices. Another cult was becoming popular in the east of The Northlands. They worshipped Walis, a sun god and brother of Singwa. Walis was said to be immortal and could turn stone into gold and even pass on his divine abilities to a believer. Some were donating their wealth to the cult in hopes of being blessed by Walis and becoming richer. Naturally they ended up on the streets, some then killed their family believing they hadn’t donated enough, and sacrificing their family would make up the difference.</p><br/><p>The shrines didn’t bother when the lands were desolate, but now they could make a lot of money, so of course they were coming. It helped that most people used to be so concerned with just putting food on the table and saving up to wait out the winter that they didn’t have time or energy for frivolous faiths. What little they could spare for prayer and faith was all directed at the sun and war gods. Now, however, they had more than enough time, energy, and money. A few religious scuffles had even broken out between fanatic groups.</p><br/><p>If for nothing else, the shrines were not extremists, so it was better to have the people believe in mundane and benign faiths than have them fall to violent and deviant cults. And even better if they worshipped at shrines that could be closely monitored to ensure they toed the lord’s line.</p><br/><p>The others present were silent as they carefully contemplated Kedan’s words. This was indeed a new and serious problem. At times of war people were easy to please and they all tended to worship gods related to war. Now, however, their beliefs were started to scatter in all strange directions.</p><br/><p>Viscount Camorra agreed with his two foregoers, but also shared Hector’s concerns. The shrines had been willing to compromise so far because they didn’t have much influence among the people, but once they became entrenched, they would no doubt begin to think about throwing off Lorist’s overwatch and use the people to pressure him to agree to their demands.</p><br/><p>At the very least, the shrines could not be allowed to congregate. Each shrine had to base itself in a different region, ideally, they’d also only be allowed to proselytize in their specific region so that their growth could be limited and they could be kept from coming into conflict with one another or uniting to form a single faction. It wouldn’t be too difficult to come up with good arguments for this either.</p><br/><p>They could just argue that they’re letting each shrine build its headquarters in a place most relevant to its god, such as putting the god of the sea and god of storms shrines in Northsea since they’re all about the water and sailing. Putting the goddess of the earth and the goddess of the harvests’ shrine headquarters in Felicitas since they’re related to agriculture, which was that region’s specialty. The goddess of the forest and the goddess of the rivers could be put near Black Forest. And Firmrock and Ragebear would have the wargod.</p><br/><p>In this way, Camorra quickly came up with a reasonable division of the land between the 20 or so deities and their shrines. They could put shrines in Wild Husbandry and the eastern parts of the Northlands to speed up the mountain and grassland barbarians’ assimilation.</p><br/><p>The group quickly agreed with Camorra’s plan. They would let the shrines operate in their lands, but they had to headquarter themselves as directed. The next question, then, was how to regulate them. Charade supported Camorra’s idea that they be limited to operating only in their designated region. Spiel quickly added that they should limit the money the shrines were allowed to take from the people. Each believe could only donate up to a certain limit of his income in a year, any further donations would result in punitive taxes on his income. The shrines should also have to report their income and should be required to spend at least a specific portion thereof on charity work to support the poor, such as setting up and running charitable hospitals.</p><br/><p>Kedan added that the shrines should not be allowed the right to give anyone sanctuary from the law, and any members of the clergy would also be subject to the law. They would also have the responsibility of maintain religious order by combatting any cults that appear in their region. Camorra chimed in again to suggest that the forceful conversion of people should also be forbidden, as well as any interference with another shrine’s operations. They would only be allowed to talk to people about their gods and their faith, but couldn’t force them to follow the faith, and they couldn’t try to make it so that businesses and other organisations required their workers to be of a certain faith to be hired or to continue to work there or get promotions.</p><br/><p>With these regulations in place, Hector slowly came around to the idea that the shrines could be beneficial. In the end, everyone decided on 18 regulations and presented them to Lorist.</p><br/><p>Lorist smiled.</p><br/><p>“And who would enforce these regulations?”</p><br/><p>Everyone was stunned. None of them had thought about who would be responsible for ensuring the shrines followed their regulations. The government didn’t have the spare manpower to allocate to this task, but they couldn’t let the shrines in without these regulations.</p><br/><p>Lorist shook his head. He suggested that they have the shrines regulate each other alongside his government. They would form a regulatory council that would ensure everyone kept to the regulations and deal with any offenses.</p><br/><p>The shrines would have to fund the council from their own pocket as well. The council officials could work in the administration on the side, but they couldn’t let that interfere with their council duties. The council could fine member shrines for offenses and the fines would be used to fund the council as well, though of course a portion would be taxed. If it came to the point where a shrine was banned and their region confiscated, the council could allocate it to bordering shrines by majority vote of the council. The council would also be called the Council of the Faiths.</p><br/><p>Lorist was confident it would be a very tempting pot of gold for the shrines, so they would keep each other in check and look for any opportunity to call each other out to get a portion of the fine money. This would pit the shrines against one another and keep them from banding together against him and his government.</p><br/><p>Charade led the negotiations. The negotiations took all the way to the 7th month to conclude. The next month, Lorist signed the regulations into law and the shrines were officially allowed to begin operating in his dominion within their designated regions.</p><br/><p>The populace quickly calmed down and many of the cults vanished.</p><br/>\n</div>"}