{"title": "Chapter 570 Terrence-donkey Whip", "id": 570, "volume": 6, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-570-terrence-donkey-whip", "volume_title": "Volume 6", "body": "<h1>Chapter 570 Terrence-donkey Whip</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Terrence-donkey Whip</p><br/><p>\"We're going for a stroll around town. Want to come along?\" asked Sylvia, entering the study.</p><br/><p>\"Weren't you out the whole day yesterday?\" asked Lorist, a book in hand.</p><br/><p>\"Come on, we only toured the palace with the new queen, stared at memorabilia, saw a few flowers, and played with the queen's pets a bit. That's not going out, it's socializing. It's just like how you men get together to drink.</p><br/><p>\"We're going to the most famous commercial street in the capital today. I heard they have sales all over to commemorate the ceremony. They even have dresses and accessories imported from Morante. I want to go have a look.\" Sylvia approached Lorist as she spoke and pulled him up from his chair.</p><br/><p>Lorist got up unwillingly and pulled her into his armed, stealing a kiss.</p><br/><p>\"I'll stay here. I have several appointments today. Go have fun and buy whatever you fancy.\"</p><br/><p>Sylvia stoop on her toes and returned the kiss.</p><br/><p>\"Alright, we're leaving now, then. Don't worry about us, Xanthi is coming along,\" said she.</p><br/><p>Lorist had merely made an offhand comment for her to be careful, he didn't think she'd go and take that old woman with her. The capital was safe; it would be a slight to Auguslo's honour if something happened to a noble or his family right under his nose, after all. He would not forgive anyone that tried to disturb the ceremony.</p><br/><p>Lorist scratched his nose as he watched his wife leave and thought about how women loved going out whether it was on Grindia or in his past life. Even his wife, Duchess of the Northlands got excited after hearing about sales, even if the goods weren't what she needed. She would always boy everything in a sale that caught her eye. In that moment it was about buying, she could figure out what to do with the stuff later.</p><br/><p>There were five special noble districts outside Ragebear's east district and Lorist intentionally set up one luxury shopping and one entertainment district in the middle to exploit this very characteristic of women. It was the most luxurious area in the entire Northlands. Commoners couldn't go there if they weren't the guest of a noble. Even the staff were of the higher non-peer classes.</p><br/><p>Lorist didn't expect his five women would become the district's most frequent customers. Almost their entire monthly allowances went into buying 'discounted' goods there. They even bought Norton products rather than just asking Lorist for them. They were definitely spending for spending's sake -- they never even touched most of what they bought.</p><br/><p>Lorist once spoke with Kenmays about letting the maids dress more evocatively. Lorist came up with the trendy back-revealing design so popular among celebrities in his previous life. Kenmays made off with it like it was a treasure, but instead of making uniforms for his maids, he made a new line of dresses and sold them to nobles.</p><br/><p>Sylvia and her sisters found out about it through their extensive social network the moment the dresses hit the shelves and nearly trampled someone under their carriage as they rushed to get the prettiest of the dresses. Sylvia got several dresses which she loved to bits, but when she tried them on in her room, she realised she could never wear these in front of anyone else. They were incredibly alluring, but she, as a duchess, had to be elegant, majestic, classy, not alluring. She was married, after all, what business had she wearing dresses designed to seduce men? In the end she gave her dresses to Fennazali. Her figure could make the most use of the dresses and she, being a concubine, was expected to dress seductively, her only purpose in life was to amuse and arouse her lover.</p><br/><p>Dilianna, Fennazali, Daisy, and Maria however, also felt the dresses weren't fit for them once they got back to the castle. They may be concubines, but they weren't just any concubines, oh no, they were a duke, nay, a swordsaint's concubines. How could they dress as skimpily as other concubines did? They, being a swordsaint's concubines, were equal to the wives of other nobles, you know. They had to dress with accordant grace and elegance. They gave their dresses to Sylvia instead. If the head wife dressed like that, then they would only be following her lead and could not be criticised. They would just buy a new set for themselves later.</p><br/><p>Sylvia had given one away and gotten four in return… They had each bought the dress separately from the others, so they only realised they'd all bought the same dresses after giving them to one another. Lorist couldn't stop laughing about it for two weeks. He couldn't argue, however, that the dresses were inappropriate for nobles of their standing. He suggested that they, instead, reserve the dresses for their nightly appointments with him.</p><br/><p>Back in the present. Lorist wanted to avoid going anywhere in public with his women and children together at all costs. The last time had traumatized him more than that unrequested trip to the barbarians in the mountains all those years ago. He would rather fight someone even stronger than a swordsaint than go through that again.</p><br/><p>Lorist didn't know where women got the energy to haggle for hours over a few coppers when they had a bag full of gold around their waist. The women, however, beamed more at winning a few coppers in a haggle than during the heights of their times with Lorist.</p><br/><p>Sylvia, usually so concerned with appearing elegant and graceful, would hop around like a little girl, puffing out her cheeks and pouting so much Lorist could swear her lips would never return to normal, when she was having a particularly tough haggle.</p><br/><p>Jinolio dashed in later that morning to find Lorist still stuck in his reverie.</p><br/><p>\"Your Grace, Sir Loze is back. He's a blademaster now!\"</p><br/><p>\"Let him in, quick!\" Lorist said, jumping from his seat.</p><br/><p>Loze had disappeared two years earlier and left Tigersoar without a commander. The only trace of him was a letter he left on his desk in his office saying he was cultivating somewhere isolated and would return after making good progress. Now, two years later, the man had returned a blademaster.</p><br/><p>Loze marched into the study proudly.</p><br/><p>\"I'm back, Your </p><br/><p>He dropped a large bundle of bamboo containers. Lorist stared at the containers, trying to remember where he had seen them before. Why would Loze bring them into his study? Why not leave them outside? He couldn't find the answer and dropped the thought after a few moments.</p><br/><p>\"It's great you're back. Where did you disappear to? We couldn't find you these whole two years. We were really worried.\"</p><br/><p>\"Hehe… I was at the Relic Islands,\" Loze chuckled, \"The magic beasts there are fierce and maniacal, just right for my training. Oh, I brought Your Grace a gift.\"</p><br/><p>Lorist immediately knew what was in the containers. His expression turned a little awkward. Terrance-donkey Whip, the world's strongest aphrodisiac. Back when he was still an iron-ranked instructor at Dawn Academy, he had signed a few unreasonable agreements with Levins to be allowed to go to the Relic Islands to train.</p><br/><p>Per Els's request, he returned with two Terrence-donkey Whips -- the genitals of those poor animals. Els cut them into slices and jarred them for a little business, but the venture didn't last long. A merchant guild that specialized in the product clamped down on it the moment the first batch was sold.</p><br/><p>\"Bastard, do I look like someone who needs that sort of thing?\" Lorist barked, \"But... since it's your gift, I'll force myself to accept it. Jinolio, put them away somewhere safe.\"</p><br/><p>Loze glared at Lorist.</p><br/><p>\"Your skin is getting thicker by the day, as you sure you don't have a skin illness? Maybe it's malgrowth! I should call a doctor for an exfoliation treatment… I didn't say I was going to give everything to you either. It took me two years to get eleven sets, I'll give you three at most. Potterfang and Malek each have one reserved, and Dulles and Messen get a half each. The rest are for me. I didn't even tell Patt what these were when he asked. What if he wants some as well?\"</p><br/><p>Lorist's face turned red again.</p><br/><p>\"Why would you need so many? We'll split half between the two of us!\"</p><br/><p>\"No. Your Grace gets three at most. Just cut the slices extra thin if you want more of it. You'll have enough for three years even if you use two portions a day! Didn't you say you didn't need any in the first place?\"</p><br/><p>\"Fine.\"</p><br/><p>Lorist didn't want to make too big of a fuss. His manhood didn't need others finding out about him using such things. Rumours of his dependence on such things would be even worse for him than being labelled a kingslayer.</p><br/><p>\"If you hadn't broken through, I would've thought you went there just to get these. I'm sure it wasn't easy getting so many,\" Lorist quickly changed the subject.</p><br/><p>\"Of course. Nobody can imagine how agile these beasts are. The slightest movement will send them scattering like bolts of lightning. Catching them is too difficult, to say nothing of hunting them. The 11 I got were wild as well. They work far better than bred ones. Hunting Terrence-Donkeys is the best kind of training, not least for the material rewards.\"</p><br/><p>Terrence-donkey Whip was the concentration of thousands, if not hundreds of thousands of sunjoy grass leaves. Terrence-donkeys loved to eat the grass and its meagre effects gathered in their whips over the years.</p><br/><p>Loze happily rambled on about his heroic exploits for several hours. Lorist was forced to step in to silence him and get back on track. Loze then explained he had come to the capital after returning to Hidegold Bay to see Howard, who told him Lorist was in the capital for the king's ascension.</p><br/><p>\"I wanted to give him one since he's staying with his wife now, but he wouldn't take it. He kept saying his young and has more than enough energy for his wife. He'll regret it in a few years,\" complained Loze.</p><br/><p>\"Alright, enough,\" said Lorist exasperatedly, \"I'm sure Malek and Potterfang will be really grateful. You should spar with Potterfang when you get back home. You're good at attacking while he's good at defending, it'll be good practice for you two. You should be able to suppress him as much as you can. He won't be happy with being at a disadvantage against you so it should pressure him into making his breakthrough.\"</p><br/><p>Loze nodded seriously.</p><br/><p>Kenmays stepped into the room at that moment. He was both Lorist's equal in title, his close friend, and his neighbour for the time being, so he could come and go as he pleased. He didn't see the bamboo containers and tripped over them, luckily none broke.</p><br/><p>\"What are these?\" asked he.</p><br/><p>\"Terrence-donkey Whips. They're mine,\" snapped Loze as he quickly grabbed hold of them.</p><br/><p>He had sensed the silver rank coming from a distance away, so he didn't even bother to look at him. Silver ranks were nothing in his eyes.</p><br/><p>Kenmays's eyes brightened immediately.</p><br/><p>\"Dear Loze, it's wonderful to see you again. So, how much for a whip?\"</p><br/><p>\"Not for sale.\"</p><br/><p>Lorist shrugged at Kenmays, who shot him a hopeful glance. Loze had offered even his liege on three, how would he give some other noble any? Lorist happily picked up his three and handed them to Jinolio, whom he quickly shooed away before Kenmays had a chance to pester him for one.</p><br/><p>He must need something even if not money... thought Kenmays.</p><br/><p>He pulled the man to a corner and whispered something to him. Loze beamed happily and pushed a container into Kenmays's hands.</p><br/><p>\"Sheesh, we're friends, brothers even! No need for money! Take it as a gift!\"</p><br/><p>Lorist watched Kenmays unhappily.</p><br/><p>Don't think I didn't hear you just because you were whispering in the corner.</p><br/><p>Kenmays had promised to get Loze the most beautiful little flower buds amongst the lesser nobles to keep him company while he was in the capital. He made them out as open-minded and willing to do anything exciting. Loze immediately declared the duke his brother and gave him a whip.</p><br/><p>\"Did you come here for poppy-talk, or do you have an actual reason to come see me?\" grimaced Lorist.</p><br/><p>\"Yes, yes, about that. I want you to come and check out the committee's new branch office.\"</p><br/>\n</div>"}