{"title": "Chapter 578 Free Citizens", "id": 578, "volume": 6, "url": "http://boxnovel.org/tales-of-the-reincarnated-lord-chapter-578-free-citizens", "volume_title": "Volume 6", "body": "<h1>Chapter 578 Free Citizens</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Free Citizens</p><br/><p>There were only two things in 1783 that concerned Lorist. The first was the grand ceremony of Auguslo's ascension. Even though it was already over, the falling out with him and the wariness he had for House Norton and the four allied houses only grew. The two factions were practically rivals and it seemed like their battle would be battled out in the arena that was the Krissen Empire. Before Lorist the swordsaint and Auguslo the emperor settled who won, the situation wouldn't calm down.</p><br/><p>The other matter was the construction of the grand palace in Ragebear. After three hard three years, and the painstaking effort of nearly 200 thousand laborers, the grand palace was finally complete. On Grindia, there was no tax for constructing new properties. As long as nobles had the money and power, they could build a palace even grander than that of the royal family's and make it their residence. Not only was that a display of wealth, it would also serve as a legacy for their descendants to inherit, while also helping the house leave a mark in the annals of history. Handra's Inkcuby Palace and Forund's Summer Palace were such examples.</p><br/><p>What dumbfounded Lorist was that he had made the decision to construct the Palace Ursa Rex wasn't for the fame, but rather to solve the issue with overproduction of a mineable resource in the dominion. In other words, he was increasing demand for the material to make up for the falling prices and also giving the farmers a chance to earn some extra money, which could then be used to stock up on more of House Norton's products. That way, the dominion's economy would get the stimulation it needed and the folk would lose the habit of saving every single coin they made.</p><br/><p>That was why even though Palace Ursa Rex was grand in size, it wasn't very detailed and ornate to squinted eyes. The grandest palaces on Grindia were no different from several beautiful manors and castles linked together with a shared garden. They were far from what Lorist imagined fantasy-world castles would look like. And given that the term of the project was quite short, it couldn't compare to some palaces in his past life, which easily took more than a decade to construct. Then again, perhaps because of the advent of battleforce, the people in this world had an advantage when it came to building speed. Battleforce-using workers could easily lift large rocks and greatly increase the efficacy of construction.</p><br/><p>Lorist had interfered with the design of Palace Ursa Rex to resemble the Forbidden City which he had seen during a visit with his secretary once. Even though he couldn't exactly replicate the whole thing, the grand scale of the whole project earned Ciroba's awe; the old architect's belief that Lorist had architectural talent was once again reinforced through the layout and design he provided of the buildings. But when Lorist received the final designs and saw the Gothic-style decorations on his Chinese-style palace, he thought that it felt a bit off, but it was already too late to change.</p><br/><p>Ciroba on the other hand was filled to the brim with ambition. He was driven to make Palace Ursa Rex a Grindian structural marvel so as to leave his mark in the world of architecture. Had Lorist not decided on the name of the palace early on, Ciroba would be willing to give up on his riches, title and everything else to have the building named after him. If it were called Palace Ciroba, he would die with no regrets.</p><br/><p>The grand architect spared no effort when it came to the construction and monitored the whole project closely, not letting off the slightest mistake. He even lived on the site itself. Given the humongous nature of the project, its term was set at two years and its budget, two million gold Fordes. But due to Ciroba's request, it swelled to three million, five million, and finally, eight million with Spiel's permission following the proposal to make it the greatest palace ever built on the continent. The term of construction was also lengthened to three and a half years while the 100 thousand laborers doubled. They were all brought over from various other project sites.</p><br/><p>Spiel didn't think that spending so much on Palace Ursa Rex was a waste as it was a core matter of the house. Given House Norton's current might and prosperity, it required a palace just as grand to flaunt and make a statement. That was all the more justified taking into the fact that Lorist was a swordsaint of the kingdom. He was the greatest thing to ever come out of House Norton during the past three centuries. A residence fitting for his status was obligatory. After a few centuries, his descendants would also live in that palace proudly and admire his legacy.</p><br/><p>When Lorist received that proposal, he was completely dumbstruck. A budget of eight million gold Fordes was more than three times the annual income received by the house a few years back. The usually stingy and pauper-like Spiel actually agreed to spend so much. If Lorist didn't trust in the chief finance supervisor's usual tact and wit and his scrutiny for every single bit of spending, he was going to send people to investigate whether there was corruption involved in the project.</p><br/><p>Fortunately, the house had already established their trade route to the south of the continent and earned around six million gold Fordes yearly by exporting the goods it produced to Morante. Jillin Harbor's market also brought some one million gold Fordes in profit. Even though the house spent three hard years to defeat the Trade Union and lent so much money to the Free Union to aid their development, the income largely made up for the costs and there wasn't a need to worry about any financial crisis brewing in the following years.</p><br/><p>Lorist smiled bitterly when he saw the figure of eight million. He was more than willing on spending that amount on raising living standards for the citizens or improving the gear of his forces. He didn't want a grand palace in the first place and how it had all come to this was genuinely a surprise to him. The budget for the palace that was planned to stimulate the household economy didn't require it to be grand or well decorated. But now, there was nothing he could change about the quadrupled budget. He had no choice but to live in the palace.</p><br/><p>He didn't quite like living there. Unlike his expectant lovers and children, Lorist much preferred staying in simple fortress strongholds like Firmrock. He could hear the horns to wake the forces in the morning and listen to the grunts of the training soldiers. That was the life he truly wanted to read.</p><br/><p>He recalled a saying in a webnovel he read in his past life: 'a beautiful palace is nothing but a beautiful cage in which the emperor locks himself. That's why there are no heroes after the wise founding emperor because they have been spoiled by their luxuries and lost touch with reality, being toyed around by the others like birds in a cage'. That was the case as well with the Song dynasty. The succeeding emperors were nothing but shipwreck after another.</p><br/><p>During the 10th month, Lorist left Silowas with his family members and arrived in The Northlands. He was already preparing to move into Palace Ursa Rex. If he were honest, he didn't really like the name of the palace, which was set after the elders of the house all agreed to it. Since House Norton was called the Roaring, Raging Bear of The Northlands, the names suggested by the elders all had something to do with bears. Palace Ursa Rex was the one that was picked for its imposingness. Lorist settled with it because it was at least better than Palace Ciroba.</p><br/><p>\"Your Grace, in the palace are 3461 statues of a magic beast bear in various poses. To capture a sense of reality, we captured 17 magic beast bears from the wild and sketched them for reference and picked some poses that were most suited to be made into sculptures,\" introduced Ciroba as he pointed to the various bear statues place across the palace according to his design.</p><br/><p>Ah, so all the money was spent by you! Do you think we're in a bear museum? commented Lorist in his mind. Unlike the heart-aching Lorist, his lovers and children were all stunned by the beauty and majesty of the palace. Sylvia loved her new abode. The children on the other hand had long dispersed and started playing tag around the bear statues. Anderbael climbed up the largest statue and stood proudly to show off, much to his personal caretakers' anxious worry.</p><br/><p>I'm so busy and tired! Ever since returning to the dominion, Lorist had to move as well as plan the new year's celebration at Palace Ursa Rex. As it was the first time the celebration was being held at that venue, Lorist didn't dare to slack off. He welcomed one guest after another daily and missed the peaceful and relaxing days he spent at Cherry Blossom Ridge last year.</p><br/><p>After the new year, everything finally quieted down for Lorist during the rainy season. The year of 1784 had arrived and i was when House Norton would begin their expansion towards the northern border of the empire into the Magical Dragon Mountains. A new province would be formed with Twinmont Town at its center, giving the house another province under their jurisdiction. The province would be henceforth named Montside after the fact that it was beside Magical Dragon Mountains.</p><br/><p>\"I intend to implement a policy that allows private ownership of land in this province,\" decided Lorist.</p><br/><p>In some sense, the current three million plus subjects living in the Norton dominion were no different from tenants as all the land in The Northlands belonged to the house. Even though House Norton forcefully moved more than two million other citizens into their domain and gave them farmland and houses to settle down, they didn't really own those. They had to pay half of their crop harvest to the house as rent. Both the land and the house couldn't be sold away either, but they could be renovated and inherited by their descendants. But in doing so, they would have to pay a fee to the house for the procedures.</p><br/><p>In The Northlands, apart from the manors given by House Norton to the gold-ranked knights, even the land of Dawn Academy and the special noble district belonged to House Norton. The lease of Dawn Academy's land was indefinitely termed and free for them to use, but if the academy wanted to move away, the land would be returned to House Norton unconditionally.</p><br/><p>The special noble district was slightly different. House Norton sold them the right to use the land however they saw fit. The nobles were free to construct their own manors and castles and give them to their descendants and also sell and trade them without obstruction from the house. However, the current 'owner' of the land still had to pay a sum to the house on an annual basis. Even though the sum wasn't huge, if the sum wasn't paid and accumulated up to a certain amount, House Norton had the right to confiscate everything within it including any manors or castles built.</p><br/><p>However, the house wasn't such a ravenous, blood-sucking vampire. They would auction the property away and only take what they were owed before returning the extra money to the debtor. Alternatively, a noble could pass on the property and debts to another for them to bear. However, that meant a departure from the noble circle in The Northlands and that was a method only employed during the most desperate of times. The nobles were even willing to borrow money from high-interest lenders just to be allowed to stay in the special noble district, because there was always hope for recovery as long as they remained.</p><br/><p>As for the reason for the boost in real estate price in Felicitas's seven towns, it was due to the special districts that were built there. The only difference was that it wasn't exclusive to nobles. The treatment the residents there would receive was the same. That was an opportunity for the richer folk in the dominion as the houses in the special district were far better than the free ones they were given. Farmers that purchased the houses would be able to return their former one to House Norton and get a ten percent tax cut on their crops.</p><br/><p>The largest difference between the household dominion and the territories under the house's jurisdiction was that in the household dominion, the main house was the highest power. The true people with power in territories under the house's jurisdiction were the nobles that were enfeoffed there. Apart from those lands, the remaining land belonged to the main house. So, for larger noble houses, they were really unwilling to make vassals of their subordinates because the produce of the dominion belonged to the house. The house stood to lose income after enfeoffing part of the dominion to a vassal noble.</p><br/><p>Lorist intended to implement a private property policy in the new province on Montside. In other words, he was going to give away all the right to ownership to the land there of the house. The province would be the free domain of capitalists and it was done so because of need. Montside was a new province and it required people. However, most of the subjects of the house were forced to move to The Northlands. Given that Montside bordered Magical Dragon Mountains, not only were they exposed to barbarian raids, they also had to defend against magic beasts. The people living there required the ability to defend themselves to survive.</p><br/><p>While most of the barbarians and magic beasts could be countered by the household forces, small scale bandit raids and random animal attacks were going to happen even with the precautions in place. So, Lorist set his sights on the retired household soldiers and mercenaries. He would offer them the tantalizing prospect of owning their own land in Montside and each retired soldier of the house would receive around 17 square meters of land in Montside and be allowed to do anything with it as they pleased. Ten They could transfer it to their descendants or sell them to other people without the permission of House Norton.</p><br/><p>\"Perhaps the land-owning citizens of Montside will become the first of truly free citizens in our domain,\" said Lorist.</p><br/>\n</div>"}