{"title": "Volume 3 Chapter 6", "id": 6, "volume": 3, "url": "http://boxnovel.org/zero-no-tsukaima-volume-3-chapter-6", "volume_title": "Volume 3", "body": "<h1>Volume 3 Chapter 6</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>From Baka-TsukiJump to: ,</p><h3><span class=\"mw-headline\" id=\"Chapter_Six:_Treasure_Hunting\">Chapter Six: Treasure Hunting</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><span class=\"mw-editsection-bracket\">]</span></span></h3><br/><p>Tabitha hid beside a tree with her breath held. In front of her was a temple that had been reduced to ruins. Columns that once boasted magnificence had collapsed and fences had rusted away. Bright stained glass windows had been shattered, and weeds filled the garden. It was the temple of a pioneering village that had been abandoned decades ago. It was completely desolate; no one was close by. However, when the sunlight shone upon it, there was a somewhat pastoral atmosphere to the place. The place would probably be where travelers would set up for lunch or the like.</p><br/><p>A loud explosion suddenly broke the calm atmosphere. Kirche had set a tree next to the gatepost on fire. Tabitha, in the shade of the trees, gripped her wand. The reason why the pioneering village had been abandoned came dashing out. It was an orc. It was two meters tall and weighed about five times that of an average human. Its fat ugly body was covered by skin peeled off from animals. With a large nose on its face, it looked much like a pig. In fact, you could say that it was a pig that stood on two legs.</p><br/><p>There were around ten of them. Orcs liked human children, and being attacked by a group of creatures with such troublesome tastes, the villagers abandoned the village and fled from it. The villagers told the lord of the area, but the lord disliked dispatching soldiers in forests, and so ignored their requests. This village was one of the many villages in Halkeginia that had had this happen.</p><br/><p>The orc conversed with the others through sounds similar to that of a pig, while pointing at the fire blazing around the gatepost. It then yelled angrily at every one of them.</p><br/><p>“Fugii! Pigii! Agii! Nguiiii!”</p><br/><p>Waving the clubs in their hands, the orcs were obviously angry. There was a fire, which meant humans were nearby. They were enemies, and the fire was a bait. Watching this, Tabitha considered which spell she would use. There were more enemies than she had expected. She couldn’t continuously fire spells out. If they didn’t carry everything out smoothly, they could easily lose the advantage of their surprise attack.</p><br/><p>Just then, the air around the orcs shimmered and seven bronze maidens appeared before them. They were Guiche’s golems. Tabitha knitted her eyebrows. That wasn't what they had decided on. Guiche must have gotten impatient.</p><br/><p>Guiche’s seven valkyries charged at the head orc. They thrust their short spears at it. The tip of the spears sank into the orc’s stomach and the orc was knocked back onto the ground. However, the wound was shallow. Its thick skin and fat had acted as its shield, protecting its internal organs from damage. It quickly stood back up, and waved its club, ignoring its small wound. The other orcs rushed over with their clubs, swinging them at the bronze maidens. The clubs the orcs were swinging, were about the size of a human. One hit on the delicate golems, and they were sent flying, broken on the ground.</p><br/><p>Tabitha started reciting an incantation while waving her wand. Water, wind, wind. One water and two winds. The two elements intertwined with each other and the spell was complete. The vapor in the air froze and became several icicles. They skewered the wounded orc from all directions. It was one of Tabitha’s strongest attacks, 'Windy Icicle'. The wounded orc fell to the ground at once.</p><br/><p>Kirche, who was watching on top of a tree that was separated by a fair distance from Tabitha’s hiding spot, waved her wand. Fire, Fire. Two fires. A ball of fire, larger than a normal fireball spell, attacked the orcs. It was the 'Flame Ball' spell. With agile movements that didn’t seem possible for their size, they tried avoiding the ball of fire. However, as if it were attached to a string, the ball of fire was homing. It shot inside an orc's howling mouth, and its head burst into flames. However, that was the end of such effective spells. They couldn’t keep using such strong spells.</p><br/><p>The orcs were scared, but they realized they were being attacked by only a few mages. After realizing this, they remembered a long battle they had with humans once. If they lost, they would lose in an instant. However, only two of them were killed by magic so far, which meant that the humans' attack had failed.</p><br/><p>Their anger overcame their fear. Their sharp noses twitched, trying to find the humans. A young delicious smelling human could be smelt from outside the temple’s garden. The orcs ran at once. Suddenly a person with a sword carried on his back appeared. Next to him was a fire salamander. Without hesitation the orcs continued to charge forward. The salamander would be a strong foe, but with only the two, it would be no problem. The human warrior wasn’t even going to be a problem. It was said that one orc can match five human warriors. And that was for skilled warriors. A child like that would be disposed of with one swing of the club.</p><br/><p>Saito whispered to the salamander next to him.</p><br/><p>“I’ll attack them from the right. Stop any of those monsters from reaching Kirche.”</p><br/><p>Fire flickered from the tip of the mouth of the fiery lizard, and it nodded with a “kyuru kyuru.” The large pigs formed groups to attack. They were trying to intimidate them. Saito’s hand was shaking. <i>I’m sorry for being well dressed. What the hell is that. Scary.</i></p><br/><p>The orc was wearing a necklace. After a better glance, it could be seen that it was a necklace made from a straw rope and human skulls. <i>My world’s rules really don’t exist in this world.</i> The beast’s horrible stench could be smelt.</p><br/><p>With a shaking left hand, he grabbed Derflinger. The runes on the back of his hand shone. The anger and the vigor bursting inside his body made his body hot. He started tapping a rhythm with his index finger on the grip of the sword, allowing him to compose himself. He calculated the timing of his leap.</p><br/><p>Tap, tap, tap… The rhythm of his pulse.</p><br/><p>Saito opened his eyes, and gazed at the orcs who were roaring towards him.</p><br/><p>An orc swung its club at the child. It was a hit… It should have been that is. But its club only hit the ground. It tried raising its head to see its surroundings, but its vision slipped down. Its neck wouldn’t move. Its hands reached desperately for its head only to find that it was missing.</p><br/><p>Saito had jumped faster than the orc’s swing, and had cleaved off its head. How was that! The decapitated orc tumbled to the ground. Saito leapt at a nearby orc. In an instant, he cut down the stunned orc. With the force of his sword he finished it off. To the left, the fiery lizard was battling an orc, scattering fire everywhere. Flame overpowered the orc and sent a blaze of inferno to its head.</p><div><div></div></div><br/><p>Losing three allies already, they surrounded Saito cautiously. With his sword ready, Saito stared at the orcs with a cold gaze. It was as if a dragon was glaring at them. Their instincts told them that he was dangerous. It told them that they couldn’t win against him. The orcs looked at each other.</p><br/><p>But, it was a human. They couldn’t possibly lose. It must have been a mistake just then. Ignoring their instinct, experience and common sense, they roared and went in for an all out attack.</p><br/><p>And so, they lost their lives. With the help of magic, Saito and Flame decimated them within two minutes.</p><br/><p>Tabitha’s dragon landed on the ground. If the wind dragon had been hurt, it would mean that they would have to walk home, so they decided he wasn’t allowed in the battle. Coming down from the tree, Kirche gave Guiche a shove.</p><br/><p>“Ouch! What are you doing?”</p><br/><p>“It’s your fault that we got in such a mess!”</p><br/><p>The plan was to lure them into a pit that Verdandi had dug and light the oil that was prepared in that pit. All the orcs would then burn to their deaths.</p><br/><p>“As if they would just all fall into a pit like that. The first to make a move wins. I only put that into practice.” Grumbled Guiche.</p><br/><p>“Your mole dug it right? Have some faith!”</p><br/><p>“Well we’re all ok, so it’s fine,” said Saito</p><br/><p>Siesta, who was hiding and shaking, rushed over to Saito and hugged him, overcome with emotion.</p><br/><p>“That was incredible! Killing those violent orcs in a matter of no time! You’re incredible Saito!”</p><br/><p>Siesta then timidly glanced at the corpses of the orcs.</p><br/><p>“With these around I guess you can’t really go calmly pick mushrooms in the forest.”</p><br/><p>Saito wiped off the blood and fat stuck on Derflinger with a leaf. His hands were still shaking. <i>Haven’t gotten used to battle yet I guess</i>, he thought. <i>Even though they were monsters, they were living things. Things like battles are easily said but they are really living things killing each other. Even if you win, it’s not a good feeling. Although I have powers of the familiar Gandálfr, my body is still made of flesh and blood. If I had slipped and received a blow from one of those clubs… it might be me lying there now.</i></p><br/><p>Noticing Saito’s hands were shaking, Siesta firmly grasped them. Are you ok? Her eyes seemed to ask. Saito forced a smile and nodded.</p><br/><p>“You were incredible… but I guess such dangerous things are bad…” whispered Siesta.</p><br/><p>Meanwhile, despite the battle, Kirche acted as if nothing had happened. Looking at the map, she said, “Um, within the temple there’s an altar… and beneath that altar there’s a hidden chest.”</p><br/><p>“And within that chest…”</p><br/><p>Guiche gulped.</p><br/><p>“Lies the gold and silver and legendary treasure ‘Brisingamen[1]’ that the priest hid when he abandoned the temple, apparently.”</p><br/><p>Kirche brushed her hair triumphantly.</p><br/><p>“What’s a Brisingamen?” asked Guiche.</p><br/><p>Kirche read the notes on the map.</p><br/><p>“Umm, it seems like it’s a necklace made of gold. It’s made from ‘blazing gold’! Wow, even the name makes me excited. When you wear it you will be protected from any disaster and…”</p><br/><p>That night… they crowded around a bonfire in the garden of the temple. Everyone had a weary face. Guiche said bitterly, “So the so called treasure was that?”</p><br/><p>Guiche pointed at a color faded accessory and a few dirty copper coins. Underneath the altar, there was a chest. However, it was full of junk that they didn’t even consider taking back home.</p><br/><p>“This is made of brass. These cheap necklaces and ear rings, these aren’t that ‘Brisingamen’ right?”</p><br/><p>Kirche didn’t reply. She just filed her nails with a bored look. Tabitha was reading a book as usual. Saito was lying down, gazing at the moon.</p><br/><p>“Hey Kirche, that’s the seventh one already! We followed those maps with such effort and yet all we get are a few copper coins! The treasures aren’t even close to what the notes of the maps say! Those maps are all hoaxes!”</p><br/><p>“Shut up. I said it before, there -might- be a real map within that bundle.”</p><br/><p>“It’s too mean! Monsters and beasts dwell in ruins and caves after all! Only getting this in return for defeating monsters is far from enough!”</p><br/><p>Guiche held the artificial rose in his mouth and lay down on a spread out blanket.</p><br/><p>“Well yeah. If you could get treasure by just simply killing monsters, then no one would be poor.”</p><br/><p>A gloomy atmosphere drifted amongst them. But Siesta’s cheerful voice drove it away.</p><br/><p>“Everyone, dinner's ready!”</p><br/><p>Siesta started dividing the stew for everyone from the pot on the bonfire. It smelled good.</p><br/><p>“This is good! Wow, it’s really good. What kind of meat did you use?” Guiche asked while stuffing his mouth full.</p><br/><p>Everyone else tasted it and started to say how delicious it was. Siesta smiled and said, “Orc’s meat.”</p><br/><p>Guiche suddenly spat out the stew. Everyone stared slack jawed at Siesta.</p><br/><p>“I-It was a joke! I made it from a wild rabbit. I caught it with a trap.”</p><br/><p>Siesta went on to explain how she had set up traps to catch rabbits and partridges, and collected herbs and vegetables for the stew, while everyone else was hunting for treasure.</p><br/><p>“Don’t scare me like that. But, you’re really handy, being able to make something so nice from things in a forest.” Said Kirche in a relieved tone.</p><br/><p>“It comes from living in a village,” said Siesta shyly.</p><br/><p>“What’s this stew called? The herbs you’ve used are quite different from usual. I’ve never even seen some of these vegetables.” Said Kirche while spinning one of the vegetables on her fork.</p><br/><p>“It’s a stew that’s made in my village, called Yosenabe.” Explained Siesta while stirring the pot.</p><br/><p>“My father taught me how to make it. From edible wild plants, roots of plants… My father learned it from my grandfather. It’s a specialty in my village.”</p><br/><p>Thanks to the delicious food, they felt more relaxed. Ten days had passed since they had left the school. As Saito gazed up at the sky, he wondered what Louise was doing.</p><br/><p>“Is it good, Saito?”</p><br/><p>Next to him, Siesta smiled warmly. Stuffing his mouth full with stew, he smiled back. Siesta’s smile, the taste of the stew, they both reminded him of something. He had no idea how long he had been away but Saito remembered his own world.</p><div><div></div></div><br/><p>After dinner, Kirche spread out the map again.</p><br/><p>“Let’s just give up and return to school,” urged Guiche, but Kirche did not budge.</p><br/><p>“Just one more. One more.”</p><br/><p>As if she was obsessed, Kirche’s eyes gleamed over the maps. Picking one map, she placed it on the ground.</p><br/><p>“Ok this one! If this one is also a hoax we’re going back to school!”</p><br/><p>“What’s the treasure?”</p><br/><p>Arms crossed, Kirche replied, “Dragon’s Raiment.”</p><br/><p>Siesta, who was eating stew after everyone had finished, choked slightly on her food.</p><br/><p>“R-Really?”</p><br/><p>“What about it? Do you know something about it? It’s close to a village called Tarbes. Now where’s Tarbes…”</p><br/><p>Siesta replied quickly, “It’s in the direction of La Rochelle. There’s a big field… It’s my home town.”</p><br/><p>The next morning, whilst they were riding the wind dragon, Siesta explained to everyone. There wasn’t much to tell. There was a temple near the village and in that temple there was something called the Dragon’s Raiment.</p><br/><p>“Why is it called ‘Dragon’s Raiment’?”</p><br/><p>“Apparently you can fly when you put it on,” said Siesta, weakly.</p><br/><p>“Fly? So it’s a wind type item?”</p><br/><p>“It’s really not that important of a thing…” said Siesta, looking troubled.</p><br/><p>“Why?”</p><br/><p>“It’s a hoax. It’s one of those ‘treasures’ you can find anywhere. It’s all just the name. Yet the locals are grateful… they decorate the temple, worship it…”</p><br/><p>“Really?”</p><br/><p>Siesta then proceeded to say nervously.</p><br/><p>“Actually… the owner of it was my grandfather. One day, my grandfather appeared in the village. Apparently he told everyone that he came from the east with the Dragon's Raiment.”</p><br/><p>“Wow…”</p><br/><p>“But no one believed him. Everyone says that my grandfather was weird.”</p><br/><p>“Why?”</p><br/><p>“Someone told him to fly with it, but he told them it couldn’t. He made a lot of excuses, but no one had a reason to believe him. After that, he said that it ‘couldn’t fly anymore’ and settled down in the village. He worked really hard, and gave his money to nobles, asking them to put a spell of permanence on the ‘Dragon's Raiment’. He treated it with a lot of care.”</p><br/><p>“What a strange person. It must have been hard on your family?”</p><br/><p>“No, apart from the Dragon's Raiment, he was a nice, hard working person. Everyone liked him.”</p><br/><p>“It’s something famous within the village right? Just like that Yosenabe… Then we can’t take it back with us.”</p><br/><p>“But… It’s like our family property… If Saito wanted to, I could ask my dad to show it to you,” Siesta said in a troubled voice.</p><br/><p>Just as Saito thought <i>hoaxes are useless anyway</i>, Kirche remarked, “Even if it is a hoax, there are ways to sell hoaxes. There are many people with different tastes in this world.”</p><br/><p>“You’re a horrible woman.” Guiche said, shocked.</p><br/><p>The wind dragon flapped its wings and headed towards Tarbes.</p><br/><p>Meanwhile at school, Louise was still skipping lessons. She didn’t want to meet anyone in her current mood. She only left her room to eat in the dining hall and when she went to take a bath. She knew that Saito was living in a tent in the Vestri courtyard so she went down there a few days ago to see how he was doing, but no one was there. When she asked Montmorency, who was passing by, she found out that Saito, Guiche, Kirche and Tabitha had been skipping lessons to go treasure hunting. The teachers were apparently mad and were going to make them clean the whole auditorium when they got back. She felt even sadder when she thought about how much fun they must be having. She felt as though she was the only one being left out.</p><br/><p>Louise cried in her bed again. Whenever she saw the empty haystack, tears would come to her eyes. A knock came from the door. The door opened with a clank as soon as Louise replied that it wasn’t locked. The school headmaster Old Osman was at the door, which surprised Louise. Louise quickly put on her gown and got off her bed.</p><br/><p>“How have you been feeling?”</p><br/><p>Feeling down, Louise replied, “I’m sorry I’ve made you worry. It’s really nothing. I just don’t feel very well…”</p><br/><p>Osman pulled out a chair and sat down.</p><br/><p>“You’ve rested for quite a long time. I was worried, but it seems you’re alright.”</p><br/><p>Louise nodded, and sat down on a chair. With a weary face, she stared out the window.</p><br/><p>“Have you finished the edict?”</p><br/><p>Louise gasped and hung her head. With a sorry expression, she shook her head.</p><br/><p>“Seems like you haven’t from the looks of it.”</p><br/><p>“I’m sorry.”</p><br/><p>“There’s still two weeks. Think about it slowly. It’s your important friend’s wedding after all. Make sure you choose your words carefully.”</p><br/><p>Louise nodded. She was ashamed that she had forgotten about the edict because she was so absorbed with her own thoughts. \"I’m terrible aren’t I. She considers me as a friend, and even gave me the role of being the maiden.”</p><br/><p>Osman stood up.</p><br/><p>“By the way, where’s that familiar of yours?”</p><br/><p>She averted her eyes and kept silent. Osman smiled.</p><br/><p>“Did you two have a fight?”</p><br/><p>“When you’re young, you fight about trivial things. It’s because young people don't know how to compromise. Sometimes, these cracks will develop into something irreparable. You should be careful.”</p><br/><p>Laughing, Osman left the room. After the door shut behind him, Louise whispered, “It’s not something small…”</p><br/><p>Louise went to her desk. She ignored everything else and opened the Founder’s Prayer Book. And as if clearing her thoughts, she closed her eyes. She concentrated, trying to think of an edict. I must think of a great edict for Henrietta.</p><br/><p>Louise kept her eyes closed. <i>Eh?</i> There was a bright light. Suddenly she could see letters on the pages. Louise’s eyes froze. However, in the next moment, they faded from the pages like mist. <i>What was that?</i> She thought, while looking at the pages.</p><br/><p><i>I can’t see it anymore. My eyes are probably just tired</i>, she thought.</p><br/><p>“It’s all Saito’s fault” she whispered.</p><br/><p></p><table border=\"1\" cellpadding=\"5\" cellspacing=\"0\"><tbody><tr><td></td><td></td><td></td></tr></tbody></table><div><div></div></div><br/>\n</div>"}