{"title": "Volume 3 Chapter 7", "id": 7, "volume": 3, "url": "http://boxnovel.org/zero-no-tsukaima-volume-3-chapter-7", "volume_title": "Volume 3", "body": "<h1>Volume 3 Chapter 7</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>From Baka-TsukiJump to: ,</p><h3><span class=\"mw-headline\" id=\"Chapter_Seven:_Dragon.27s_Raiment\">Chapter Seven: Dragon's Raiment</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><span class=\"mw-editsection-bracket\">]</span></span></h3><br/><p>Saito’s eyes went round at the sight of the “Dragon’s Raiment”. They were in the temple built close to Tarbes, Siesta’s hometown. That was where the “Dragon’s Raiment” lay. Actually it would be more correct to say that the temple had been built to cover the Dragon’s Raiment. The shape which Siesta’s grandfather had built the temple into made Saito nostalgic. The temple was built in the corner of a field. Its door was made by logs joined together, and its walls were made from planks and mortar instead of stone. On top of an area of the wooden floor that was painted dark green, lay the Dragon’s Raiment. Perhaps it was due to the permanence spell… but there were no signs of rusting. It was as if it had just been made.</p><br/><p>Kirche and Guiche looked at the Dragon’s Raiment, dispirited. As if struck by curiosity, Tabitha looked at it with interest. Amazed, Saito stared at the Dragon’s Raiment.</p><br/><p>“Saito, are you ok? If I showed you anything to make you feel bad…” said Siesta in a worried voice.</p><br/><p>Saito didn’t reply. He continued to gaze at the Dragon’s Raiment as though he were deeply moved.</p><br/><p>“Of course this thing can’t fly,” said Kirche.</p><br/><p>Guiche nodded.</p><br/><p>“This is some sort of canoe right? And look at the wings, they can't even move. It’s like toy bird or something. Not to mention that even the wings of small dragons are the size of these wings. Dragons and wyverns can only fly because they can flap their wings. So much for ‘Dragon’s Raiment’.”</p><br/><p>Guiche pointed at the Dragon’s Raiment and nodded, convinced that he was right.</p><br/><p>“Saito… Are you really alright?”</p><br/><p>Saito grasped Siesta’s shoulders as she was peering into his face. Saito spoke feverishly.</p><br/><p>“Siesta.”</p><br/><p>“Y-Yes?”</p><br/><p>“Did your grandfather leave behind anything else?”</p><br/><p>“Um… the only noteworthy things are his grave and a few of his belongings.”</p><br/><p>“Show them to me.”</p><br/><p>The grave of Siesta’s grandfather was located in the village cemetery. The tombstones were made from large white stones. Among them there was a tombstone made from a black stone, creating a clear contrast with the others.</p><br/><p>Words were inscribed on the tombstone.</p><br/><p>“My grandfather made this tombstone before he died. It’s written in a language from a different country, so no one has been able to read it. I wonder what it says…” said Siesta.</p><br/><p>Saito read it out loud.</p><br/><p>“Navy ensign Sasaki Takeo, rests in another world.”</p><br/><p>“What?”</p><br/><p>Siesta’s eyes widened at Saito, who read it fluently.</p><br/><p>Saito looked at Siesta feverishly, causing her to blush.</p><br/><p>“Stop… If you look at me like that…”</p><br/><p>Black hair, black pupils… This nostalgic feeling… So that’s why, Saito thought, realizing why he was feeling nostalgic.</p><br/><p>“Siesta, you were told that your hair and eyes were similar to your grandfather’s right?” Said Saito much to Siesta’s surprise.</p><br/><p>“Y-Yes! How did you know that?”</p><br/><p>Returning to the temple, Saito touched the “Dragon’s Raiment”. When he did, the runes on the back of his left hand started to shine. <i>I see, so this must also be considered a “weapon”,</i> Saito thought as he looked at the machine guns sticking out from the wings. As the runes shone, the construction and the controls of the \"Dragon's Raiment\" came clearly to Saito. He could fly this himself, he thought.</p><br/><p>Saito found the fuel tank and opened it. Just as he expected, it was empty. No matter how well it was preserved, it still couldn’t fly without gasoline. <i>I wonder how he had wandered into Halkeginia with this plane…</i> Saito wanted to trace the trail, no matter what answer it would lead to.</p><br/><p>Siesta returned from her parent’s home.</p><br/><p>“Everyone was really surprised since I’m two weeks earlier than I said I would be.”</p><br/><p>Siesta excitedly handed over the item in her hands to Saito. They were old goggles, probably the ones her grandfather wore as a navy ensign. He was like the owner of the staff of destruction which Saito had used to defeat Fouquet’s golem, someone from another world. A foreigner, like Saito.</p><br/><p>“Grandfather only left this behind. He didn’t keep a diary or anything like that. But father said he left behind a will.”</p><div><div></div></div><br/><p>“A will?”</p><br/><p>“Yes. ‘If someone who could read the inscription on the tomb appeared, give him the Dragon’s Raiment’.”</p><br/><p>“Meaning it’s mine now?”</p><br/><p>“Yes. Father said it was alright to give it to you. It was a bother to take care of anyway… It’s big and there are some people who worship it… but it’s just collecting dust in this village.”</p><br/><p>“Well, I won’t hesitate then,” said Saito.</p><br/><p>“Father also wanted me to tell you something.”</p><br/><p>“What did he say?”</p><br/><p>“He said he wants you to return the Dragon’s Raiment to the king. King… I wonder which king he means. We don’t even know which country my grandfather is from…”</p><br/><p>“He’s from my country,” said Saito.</p><br/><p>“Really? So that’s why you could read the words on the tombstone. Wow! I’m kind of moved. My grandfather was from the same country as Saito. It seems like fate.” Siesta said absentmindedly.</p><br/><p>“Then grandfather really did come to Tarbes using the Dragon’s Raiment.”</p><br/><p>“This isn’t called the Dragon’s Raiment.”</p><br/><p>“What is it called in Saito’s country?”</p><br/><p>Looking at the “Dragon’s Raiment”, Saito remembered a plastic model he put together when he was small. Why would someone call it the \"Dragon's Raiment\"? Perhaps it was just easier to understand that way. The same way it was with the “staff of destruction”.</p><br/><p>He looked at the country’s symbol drawn on the wings and the body of the place. A red dot. It seemed like it had white colored around it but it was covered by the same dark green paint used on the rest of it. The character for the dragon zodiac sign was written on the black cowling. It was probably the name of the unit he was in.</p><br/><p>Saito felt very nostalgic from merely seeing such an old thing from his own world.</p><br/><p>Saito replied, “It’s called a Zero fighter. It was a fighter aircraft used in the past in my country.”</p><br/><p>“Zero fighter? Fighter aircraft?”</p><br/><p>“In other words, an airplane.”</p><br/><p>“It’s a plane? The one you mentioned before?”</p><br/><p>Saito nodded.</p><br/><p>That day, they all stayed at Siesta’s home. As nobles were staying over, even the village chief came to greet them. Siesta introduced Saito to her family, her father, mother and siblings. Siesta was the eldest daughter of the eight siblings. Her parents viewed Saito in a harsh light at first, but that was soon broken when Siesta told them that he was looking after her at the academy. Having not been home for a while, Siesta looked quite happy being surrounded by family. Saito was envious of her. When he thought about it, Louise, Kirche, Tabitha and Guiche all had families. He also had one, but he couldn’t meet them like this. Even if he wanted to meet them, he didn’t even know where to start.</p><br/><p>In the evening, Saito gazed out at the wide field. The sun was setting behind the mountains beyond the field. It was a huge field. Just as Siesta had said, flowers were blooming everywhere. <i>So this is the beautiful field that Siesta wanted to show me.</i></p><br/><p>The pilot who ended up in this world with the zero fighter probably tried to find a way home by flying in the sky… But his fuel ran out and he landed on this field. The field was flat and wide, so landing here was probably easy. He couldn’t fly when he was asked to because he had run out of gasoline.</p><br/><p>Siesta came to Saito, who was still gazing at the field, drowned in the memories of his world. She was wearing a brown skirt, wooden shoes and a dark green cotton shirt, instead of her usual maid outfit. Like the field in front of him, her appearance was like that of the smell of sunlight.</p><br/><p>“So you were here! Dinner’s ready. Father insists we eat together.” Said Siesta shyly.</p><br/><p>“I did ask you to come visit, but I didn’t expect it to really happen.”</p><br/><p>Siesta stretched both her arms out at the wide field before them. The setting sun bathed the field with a beautiful light.</p><br/><p>“Isn’t this field beautiful? This is what I wanted to show you, Saito.”</p><br/><p>“Yeah, it is.”</p><br/><p>Siesta then cast her eyes downwards and twiddled her fingers.</p><br/><p>“My father said that meeting with someone who came from the same country as grandfather must be fate. He asked if you could settle in the village. And then said if you did then I… could stop my work at the academy and return here with you.”</p><br/><p>Saito didn’t reply. He just stared at the sky. He was thinking of how kind Siesta was to him. If she said any more nice things to him, his heart would probably melt. He felt lonely when he saw Siesta happily sitting and chatting with her family. After seeing the zero fighter, his homesickness grew much more intense.</p><div><div></div></div><br/><p>Siesta looked at Saito who was still staring at the sky and smiled.</p><br/><p>“But, it’s alright. I know it won’t work out. You’re like a bird. You’re bound to fly away some day.”</p><br/><p>Saito then decided to tell Siesta the truth.</p><br/><p>“Your grandfather said he came from the east, right?”</p><br/><p>“Um…yes,” Siesta said, slightly worried.</p><br/><p>“Your grandfather, like I, wasn’t born in this world.”</p><br/><p>“You were born in Rub' al Khali in the east, right?”</p><br/><p>“No. It is much, much further than that.” Said Saito in a serious tone. “It’s a different world. I’m not from this world.”</p><br/><p>“You’re just playing around with me aren’t you? If you don’t like me, then just say it.” Said Siesta, pouting her lips.</p><br/><p>“No, it’s not that at all. I’m not playing around with you.”</p><br/><p>“Is there someone waiting for you there?”</p><br/><p>“No. But my family is waiting. I'll someday have to leave this world for my own.”</p><br/><p>Saito turned to Siesta, and said weakly, “That’s why I can’t do the things you mentioned.”</p><br/><p>Saito was very serious. Siesta knew he wasn’t joking around.</p><br/><p>“I can protect people with my power while I’m here. But that’s all. I don’t have the right to reside with anyone. I don’t.”</p><br/><p>“But my grandfather did, didn’t he?”</p><br/><p>“Your grandfather didn’t have the power of Gandálfr like I do. Up until now, there have been many enemies, but I’ve defeated them with this power. I feel as though this power will guide me.”</p><br/><p>“Then… Can I wait for you? I don’t have any qualities, but I can wait. If you try your best to find a way home and you still don’t, then…”</p><br/><p>Siesta then became silent. <i>If that really happened, what would I do?</i> Saito thought. His pulse raced just by looking at Siesta. She was cute, and stunning without clothes on. She’s kind and can even cook. She’s a great girl. All the more reason why he couldn’t promise her.</p><br/><p>Regaining herself, Siesta smiled.</p><br/><p>“A carrier owl just sent this. It seems like the teachers are very angry. Miss Zerbst and Mr. Gramont were pale. They mentioned me as well. They said that I could have a holiday for the time being. The princess’s wedding is coming soon anyway. So until the holiday ends, I’ll be here.”</p><br/><p>Saito nodded.</p><br/><p>“Um… so can you make that Dragon’s Raiment fly?”</p><br/><p><i>With gasoline, probably,</i> thought Saito.</p><br/><p>“I’m not sure. I have to talk it over with someone first. If I do get it to fly, I want to go to the lands in the east. Your grandfather flew over from there, right? There must be some hint there.” Said Saito, watching the setting sun.</p><br/><p>“Really? If you could get it to fly, then it would be wonderful. The Dragon’s Raiment was called a Zero fighter, right? If you get it to fly, then please let me ride it just once.”</p><br/><p>Saito nodded.</p><br/><p>“I can let you ride it as many times as you like. It was your family’s to begin with anyway.”</p><br/><p>The following morning, using a few of Guiche's dad's connections, Saito managed to obtain the services of a few dragoons and their dragons. They carried the zero fighter in a large net to the academy.</p><br/><p>Guiche initially wondered why they were carrying the useless \"Dragon's Raiment\", but because Saito insisted on it, he gave in. The costs of making a large net and calling the dragoons were ridiculously high. Saito was troubled because he obviously couldn’t afford the transportation fees. However, as soon as the Zero fighter arrived in the courtyard of the academy, someone appeared in an instant and paid the fees. It was Mr Colbert.</p><br/><p></p><table border=\"1\" cellpadding=\"5\" cellspacing=\"0\"><tbody><tr><td></td><td></td><td></td></tr></tbody></table><div><div></div></div><br/>\n</div>"}