{"title": "Volume 20 afterword", "id": 196, "volume": 20, "url": "http://boxnovel.org/zero-no-tsukaima-volume-20-afterword", "volume_title": "Volume 20", "body": "<h1>Volume 20 afterword</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>From Baka-TsukiJump to: ,</p><h3><span class=\"mw-headline\" id=\"Afterword\">Afterword</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><span class=\"mw-editsection-bracket\">]</span></span></h3><br/><p>Well, well, the story of Zero no Tsukaima is coming to an end. The mystery of the \"Holy Land\" is slowly being revealed. Likewise, what really happened six thousand years ago? To be honest, I would have never thought that I could have come this far, so there were a lot of emotions welling in my chest. Even though I plan to finish the story in another two volumes, I'm still worried if I could finish writing them. However, I should not be saying such negative things, and I should be giving it my all instead!</p><br/><p>My boy Saito, has also grown up bit by bit over the years. Well, teenagers tend to grow up after they have found their direction in life anyway. This has also been said by Louise somewhere in the story, though it was only for a brief moment. A brief but brilliant moment. Although the willful part of her and the core of her personality will never change, there is bound to be some other part of her that had undergone a metamorphosis of her own. The girls were not the only ones who have undergone development, you know. As a buddy of almost every boy and young men out there, I also want to cheer for the guys in the story. Even if I won't be doing anything specific at all.</p><div><div></div></div><br/><p>In any case, a young man with passionate dreams of upholding justice will always be a radiant symbol to others.</p><br/><p>I sincerely hope that everyone reading this book will also find \"something that they want to do\". Although it will be hard to find it in this day and age, but no matter the era, it will always exist. The \"something you want to do\".</p><br/><p>There are still some things I have to mention before the end. Even though we're almost near the finish line, I still want to thank Mr. Eiji for your beautiful illustrations for this volume! You've not only increased the quality of the illustrations, but also your drawing speed every year. That is really impressive, Mr. Eiji is really a special person. I'll have to reflect on that.</p><br/><p>There's also Mr. S, my editor. Mr. S was the one who made this volume possible. It has been seven years since we've first known each other, and I am very thankful for you all this time! It is not an exaggeration to say that Mr. S was the only reason that I got to hold on until now. I hope that you will continue putting in your all in the next volume! Thank you very much.</p><div><div></div></div><br/><p>Alright, everyone reading this volume, there's just a little bit left, so I wholeheartedly hope that everyone will accompany us to the end. Writing this made me feel like I was talking about a different life. There is no greater honor as an author than this.</p><br/><p>Well then everyone, please look forward to the twenty-first volume!</p><br/><p>Noburu Yamaguchi</p><br/><p></p><table border=\"1\" cellpadding=\"5\" cellspacing=\"0\"><tbody><tr><td></td><td></td><td></td></tr></tbody></table><div><div></div></div><br/>\n</div>"}