{"title": "Volume 22 prologue", "id": 212, "volume": 22, "url": "http://boxnovel.org/zero-no-tsukaima-volume-22-prologue", "volume_title": "Volume 22", "body": "<h1>Volume 22 prologue</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><h3></h3><br/><p>6000 years ago, in that era Halkeginia was known as the \"unknown land\". There were no aristocrats or commoners, nor the Kingdoms of Gallia, Romalia, Tristain or similar countries.</p><br/><p>Not far from a small village called Nidabelio, located in the hills of the great plains, a young man in a robe said farewell to a girl.</p><br/><p>Dragging the robe that was too long, the small statured youth's appearance seemed gentle but not too eye-catching.</p><br/><p>It's no wonder… since the girl is a real elf.</p><br/><p>\"You must be careful on the road Sasha. After all, your face is very conspicuous.\"</p><br/><p>\"Please, who do you think I am?\"</p><br/><p>The elf girl named Sasha answered noncommittally, and showed off the runes glowing on her left hand</p><br/><p>\"I'm your 'Gandálfr'.\"</p><br/><p>\"Yes, you're right.\"</p><br/><p>The youth smiled. He could really be a worrywart, since the power of the \"Gandálfr\" resided in her body, even if she were attacked by the fearsome \"Varyag\", she could overcome it by herself.</p><br/><p>\"I'll go and convince those stubborn-headed elders, then come back right away.\"</p><div><div></div></div><br/><p>\"Please, the future of our clan depends on you.\"</p><br/><p>The emotional young man replied. After all, things are getting worse, day by day. However, it goes far beyond the threat of the \"Varyag\", and may even lead to a world ending \"cataclysm\". In order to avoid destruction, they had to cooperate with the elves, at the very least.</p><br/><p>\"I'll also go and try to stop the war faction. We must avoid the worst case from happening.</p><br/><p>\"Yes, please.\"</p><br/><p>Sasha nodded, then her vision blurred.</p><br/><p>\"What's wrong?\"</p><br/><p>\"I hate you, you big idiot.\"</p><br/><p>Seeing the youth's unthinking question, Sasha puffed out her cheeks in dissatisfaction. Then slender arms quickly went around the youth's neck, and she kissed him.</p><br/><p>They kissed for a while… Finally the two slowly separated from each other.</p><br/><p>\"I love you, Brimir.\"</p><br/><p>\"I love you too, Sasha.\"</p><br/><p>Brimir Ru Rumiru Yuru Viri Vee Varutori.</p><br/><p>Later known as the \"Founder\", the youth the received the worship of all the people of Halkeginia, firmly hugged Sasha.</p><br/><p>Feeling the warmth of his sweetheart, Brimir thought at the same time.</p><div><div></div></div><br/><p>\"God, what am I doing….\"</p><br/><p>The runes currently engraved on her body weren't \"Gandálfr\", but new runes.</p><br/><p>\"Lífþrasir.\"</p><br/><p>Summoned out of love, the Void familiar that bears the cruelest fate.</p><br/><p>If negotiations with the elves break down, at that time… do you intend to use this terrible power granted by god….</p><br/><p>No, that kind of thing can't possibly happen… negotiations will definitely succeed.</p><br/><p>While tightly holding Sasha, Brimir told himself this.</p><br/><p></p><div><div></div></div><br/>\n</div>"}