{"title": "Chapter 3: Xiangfu’s Third Miss", "id": 3, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-3-xiangfu%E2%80%99s-third-miss", "volume_title": "Volume 1", "body": "<h1>Chapter 3: Xiangfu’s Third Miss</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 3: Xiangfu’s Third Miss</p><br/><p>July.</p><br/><p>The sun is so bright that it’s burning the eyes. In Cui Zhu yuan1 at southeast corner of the prime minister’s mansion, while Murong Qi Qi is eating iced watermelon, she is listening to Su Yue who is telling the interesting things that happened recently in the capital.</p><br/><p>“Miss, since you came back, every three days, there will be someone who start a rumor to slander you……”</p><br/><p>“Some say you are ugly and really ill and will not live past eighteen…….”</p><br/><p>“Some say your personality is vulgar, even rural women are not as wild…..”</p><br/><p>“There were also people who mentioned the theft of that year. They told it like it has a nose and eyes, like they personally have witnessed miss steal the glowing pearl……”</p><br/><p>“This subordinate has found out. The person who is spreading the rumor is Murong Xin Lian’s head maid Fei Cui. Miss, should I……”</p><br/><p>The more Su Yue was talking, the angrier she got. She want to pass a knife directly into the people who were badmouthing Murong Qi Qi.</p><br/><p>“Su Yue, calm down!”</p><br/><p>Murong Qi Qi took over the wet handkerchief from Su Mei and carefully wiped her fingers.</p><br/><p>“I’ve told you long ago, fighting and killing won’t solve the problem. This miss is a clear sighted person. A gentleman only use words and not hands.”</p><br/><p>Hearing this, Su Mei and Su Yue’s eyes couldn’t help but twitch. Miss really could say such empty words without a change of expression and without turning red. When weren’t the matters at the end solved by miss with the most direct ‘violence’……</p><br/><p>This pair of master and servants were talking, when they heard sound of footsteps. It seemed like some people came to Cui Zhu yuan in search of trouble! And it appeared that it was more than one person!</p><br/><p>But since the master didn’t say anything, Su Mei and Su Yue also didn’t say anything. They immediately went obediently behind Murong Qi Qi. Just as they finished putting a humble appearance, the people entered Cui Zhu yuan.</p><br/><p>“Yo! You are really tolerant, ah!”</p><br/><p>Murong Qing Lian stepped into Cui Zhu yuan and saw Murong Qi Qi lying leisurely in a rocking chair with her eyes half closed.</p><br/><p>“I say third big sister, outside the rumors are flying to the sky. You the involved party is still indifferent. Is your face really thick skinned or is it that you don’t know what shame is, ah?!”</p><br/><p>The one speaking is Murong family’s fourth miss. Although her mother Liu Yan Zhi is a concubine, but she is Murong Tai’s most pampered concubine. Murong Qing Lian has reached the fourth level of martial arts. She is leader of the new generation. That’s why she got Murong Tai’s love and also made her develop her arrogant personality.</p><br/><p>The young woman in pink beside Murong Qing Lian was Murong Xin Lian. Of course, she came to watch. Seeing that Murong Qi Qi didn’t say anything and also didn’t open her eyes to look at them, Murong Xin Lian pretended to be surprised: “Third little sister, you went to Jing Xin An for five years, can it be that your illness got worse?! Or is it that you have turned deaf?!”</p><br/><p>Su Yue frowned slightly. Then she looked at Murong Qi Qi. She (MQQ) was still like a dead pig who wasn’t afraid of hot water. Didn’t say anything and didn’t look up. Knowing that her master was doing this on purpose, she also played deaf and mute.</p><br/><p>Murong Xin Lian and Murong Qing Lian talked for half a day, still Murong Qi Qi didn’t say anything. When had people treat the two of them so coldly?</p><br/><p>Murong Qing Lian rushed to Murong Qi Qi. Just as she was about to scream in Murong Qi Qi’s ear, but she had been frightened by Murong Qi Qi’s scream.</p><br/><p>“Third big sister, you want to scare people to death, ah?!”</p><br/><p>Murong Qing Lian clutched her ears and flashed to a side. Her eardrums are painful.</p><br/><p>“Fourth little sister, it’s you, ah?!”</p><br/><p>Murong Qi Qi smiled. When she looked at Murong Xin Lian, her eyes widened and she said in astonishment: “Second big sister, you also came to see me, ah?! Aiya ya, sorry, just now I was asleep and dreamed a good dream. I didn’t know you came. This truly is a sin!”</p><br/><p>Originally, she thought Murong Qi Qi was playing the fool. At this time, seeing that she was still as simple as five years ago, the doubts in Murong Xin Lian’s heart dispelled a bit.</p><br/><p>“Third little sister, what did you dream about? Tell us, la!”</p><br/><p>“Right, ah! Third big sister, what good dream have you dreamed about? Tell me, ah!”</p><br/><p>At this time, Murong Qing Lian’s ear didn’t hurt anymore. Instead, she seemed more interested in Murong Qi Qi’s dream.</p><br/><p>These two people obviously had no sisterly love. They had come over to provoke and attack Murong Qi Qi. But they still had to act as if they had sisterly love between them. Murong Qi Qi felt funny looking at them and also felt disgusted. Because Murong Qi Qi inherited the memory of the previous owner of this body, naturally Murong Qi Qi knew how these two people tormented Murong family’s third miss in private. Which begun with grabbing her clothes; then putting sand and worms in her food and finally giving her beatings for no reason. Pinching and twisting her flesh when they were in a bad mood and also threatened her to not tell anyone……</p><br/><p>As long as a place had these two women, there wouldn’t be a good day for Murong Qi Qi. Now she had become Murong Qi Qi. Speaking about this, it was time to look for them to let them repay the past debt. she couldn’t be bullied without gain.</p><br/><p>When Murong Qi Qi got in touch with the ‘hatred’ in Murong Xin Lian’s eyes, her heart jumped. She made her face get a touch of blush. Her expression also turned shy: “I dreamed about Jing wangye[Wang/wangye: the prince of first rank]. I dreamt about Jing wangyetaking me to an outing……”</p><br/><p>The moment Murong Qi Qi’s words left her mouth, Murong Xin Lian’s face immediately paled. She clenched her fists and gritted her teeth. That’s right, how come she had forgotten that this rubbish is the future Jing wangfei2?!</p><br/><p>The man she had a crush on, in the end would need to marry this rubbish, which made Murong Xin Lian’s heart furious. Although she was more beautiful and more outstanding than Murong Qi Qi, she was born by concubine. Even though she’s the daughter of the prime minister, an illegitimate daughter could, at most, marry into a good family as a concubine. Thinking about the difference between her mother Zheng Min and the main wife Li Qiu Shui, Murong Xin Lian’s heart overturned the seas and rivers. One is the legitimate daughter of one of the great families; one is just a merchant family’s illegitimate daughter. After marriage, the difference would be naturally as big as the sky. Not only was the difference between their statuses big, even the statuses of their children would have a big gap.</p><br/><p> Overturned the seas and rivers: be in a spectacular mess</p><br/><p>What did Murong Xue Lian have to be able to ener the palace? What did she have to get the emperor’s love and become an imperial noble consort? All of it was because of her noble birth! She just didn’t have a mother born from one of the four great families, why was her life so unfair?</p><br/><p>The moment she thought about that Murong Qi Qi this rubbish born from a daughter of one of the four great families, even though she’s incompetent and is only rubbish, she could still become Jing wangfei, Murong Xin Lian’s heart felt as bad as though she had eaten a fly.</p><br/><p>Her birth was only ten days apart from Murong Qi Qi’s, but why is there such a big difference in their fates?!</p><br/><p>Murong Xin Lian doubted more than once. It must had been the wet nurse who switched the babies. It was her who should have been Li Qiu Shui’s daughter. But after all, reality is reality. No matter how much she fantasied in her mind, she was still a concubine’s daughter and was still illegitimate.</p><br/><p>“Second big sister, what’s the matter with you?”</p><br/><p>Seeing Murong Xin Lian’s face changing into different kinds of expressions, Murong Qi Qi pretended to be concerned and asked. In fact, Murong Qi Qi is delighted!</p><br/><p>Envy la!</p><br/><p>Be jealous la!</p><br/><p>Hate la!</p><br/><p>As the seed of greed begins to grow, the flower of indulgence blooms and people will lose their intellect. This miss couldn’t find an opportunity to take revenge, just waiting for you to come and ‘make trouble’!</p><br/><p>1. Yuan:part of a residence</p><br/><p>2. Wangfei: the main wife/consort of the prince of first rank</p><br/>\n</div>"}