{"title": "Chapter 13: A Glance at the Mundane World", "id": 13, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-13-a-glance-at-the-mundane-world", "volume_title": "Volume 1", "body": "<h1>Chapter 13: A Glance at the Mundane World</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 13: A Glance at the Mundane World</p><br/><p>Duanmu Yi Yi was unwilling to spare Murong Qi Qi. Murong Qi Qi finally got annoyed. She had already tolerated for a long time. This woman still wanted to force her, then she also didn’t want to hold in any longer.</p><br/><p>“Good!”</p><br/><p>Murong Qi Qi took out a box and opened it. She put it in front of everyone. Inside the box laid a pill, white-like jade filled with excellent fragrance.</p><br/><p>“This is Xue Fu pill. If I lose, it’s yours. If I win, you also have to jump in the lake!”</p><br/><p>“Xue Fu pill?”</p><br/><p>Originally, they thought that Murong Qi Qi didn’t have any treasures. They didn’t expect that she would actually take out Lian gongzi’s 1 “Xue Fu pill”, making the way everyone looked at her immediately change.</p><br/><p>Xue Fu pill was a first-class beauty product that improved one’s appearance and maintained a youthful appearance, and it was made by strange doctor Liangongzi. The rumors say that with just one pill, you could maintain a youthful look. The face would not get old. Why did Murong Qi Qi have this?</p><br/><p>“You say it’s Xue Fu pill, is it really? Who knows if you didn’t just take out some rubbish for show……”</p><br/><p>Duanmu Yi Yi hadn’t finished talking when Bai Mu Fei picked up the box. After carefully looking at it, Bai Mu Fei announced the result: “It really is Xue Fu pill! Third miss is really generous!”</p><br/><p>Everyone knew that Bai Mu Fei’s ‘poisonous eyes’ are very powerful. If he said that this was ‘Xue Fu pill’, the others would no longer object.</p><br/><p>Why did Murong Qi Qi have Xue Fu pill? Did she know strange doctor Liangongzi?</p><br/><p>At this moment, Murong Xin Lian’s heart felt like it had spilled a bottle of flavors. The taste was really strange. She wanted to watch a play. Watch Duanmu Yi Yi humiliate Murong Qi Qi. But now, although she didn’t know why, Murong Xin Lian was actually somewhat worried.</p><br/><p>The surprises that Murong Qi Qi had given Murong Xin Lian were already too many. Was she really the delicate Murong Qi Qi from this afternoon?</p><br/><p>Duanmu Yi Yi stared at ‘Xue Fu pill’. Her eyes were shining. If she won against Murong Qi Qi and got this treasure, she would surely give it to her aunt Duanmu Qing. There were no women who didn’t love beauty, not to mention the mistress of the harem. Didn’t Murong Xue Lian rely on a fox face to get the emperor’s favor and become Imperial Noble Consort?!</p><br/><p>In chinese myth foxes are very beautiful in human form</p><br/><p>When she gives the Xue Fu pill, aunt would certainly be overjoyed and would reward her. Then she can mention Longze Jing Tian. Jing wangfei2, that place was hers, Duanmu Yi Yi’s! She would surely not lose to Murong Qi Qi, this rubbish!</p><br/><p>“Murong Qi Qi, you don’t know martial arts, I will not compete with you on that as to not have an unfair advantage. Today, this miss will compete with you on qin skills! And also while playing, we need to sing!”</p><br/><p>Qin: Chinese zither. Guqin is a seven stringed zither</p><br/><p>Although Duanmu Yi Yi said it very dignified, who didn’t know that she was an expert at playing the zither? At playing zither, even the number one beauty of the capital Murong Xin Lian would lose. Besides, Duanmu Yi Yi had a moving voice like the birds. Competing like this, it was obvious that she was bullying Murong Qi Qi.</p><br/><p>“Duanmu Yi Yi, such competition is really unfair.”</p><br/><p>Shangguan Wu Ji once again couldn’t help but protect Murong Qi Qi. He couldn’t take Duanmu Yi Yi’s arrogant appearance. Murong Qi Qi obviously didn’t do anything, why was Duanmu Yi Yi making things difficult for her?</p><br/><p>“Shangguan Wu Ji, this is my and her bet. It’s none of your business! Murong Qi Qi, if you know your place, then obediently admit defeat and jump in the lake yourself. There might be a hero who rescues the beauty……”</p><br/><p>Duanmu Yi Yi’s eyes swept once over Murong Qi Qi. The mocking in her eyes was really obvious.</p><br/><p>“Miss Duanmu, I think your ears definitely have some problems. When did I say that I’ll lose?”</p><br/><p>Murong Qi Qi’s originally gentle face turned calm. Shangguan Wu Ji protected her several times, she already saw him as a friend. Now Duanmu Yi Yi was even mocking Shangguan Wu Ji. This made Murong Qi Qi furious.</p><br/><p>“Instead of mocking me, you might as well think how to win against me. If today, miss Duanmu loses to this rubbish, then I’m afraid that your face will get lost till your grandma’s home……”</p><br/><p>Murong Qi Qi humphed once. The elegance was exposed in her eyes, covering Duanmu Yi Yi’s limelight.</p><br/><p>“You!”</p><br/><p>Duanmu Yi Yi had been turned speechless by Murong Qi Qi.</p><br/><p>“Servants, bring my guqin here!”</p><br/><p>Duanmu Yi Yi’s instrument was the guqin. It’s the famous ‘Bi Lan Qin’. It seemed that this miss had already came prepared. In this regard, Murong Qi Qi didn’t care. She let someone bring out a liuqin4 and tried the tones.</p><br/><p>guqin</p><br/><p>guqin</p><br/><p>liuqin</p><br/><p>liuqin</p><br/><p>quzheng</p><br/><p>quzheng</p><br/><p>Seeing the liuqin in Murong Qi Qi’s embrace, Duanmu Yi Yi scoffed. Liuqin wass mostly used by commoners. Noble ladies learned the high up guzheng5 orguqin. Where did people play that thing? Just from this, Duanmu Yi Yi already felt that she had won.</p><br/><p>But even so, Duanmu Yi Yi was still very cautious. She knew that she could not lose today. In this competition, you must know yourself and know your enemy. That’s why she went to one side and let Murong Qi Qi play first.</p><br/><p>“Are you sure?”</p><br/><p>Knowing Duanmu Yi Yi’s little plan, Murong Qi Qi felt very disdainful. Holding the liuqin, she sat down on the edge of a stone in the pavilion. Jade-like fingers plucked at the strings. The song poured from the fingers.</p><br/><p>: a glance at the mundane world. Literal meaning: Laughing at a secular world. It’s a famous song from the film Swordsman 2</p><br/><p>“The mundane world is ridiculous,</p><br/><p>the love affair is meaningless,</p><br/><p>so let’s just be arrogant and supercilious.</p><br/><p>Life hasn’t ended, mind has already cleared,</p><br/><p>and all I want is to be free and unfettered.</p><br/><p>Put up a smiley face when I’m awake, dump away all worries when I’m asleep.</p><br/><p>This nightfall came just too early. Afterlife is unpredictable, love and hatred are untraceable.</p><br/><p>Get me a drink and I’ll start a tune and I’ll sing alone and I’ll get old but I’ll be bold……”</p><br/><p>“I won’t run away though the wind is chill.</p><br/><p>I won’t desire more though the flower is pretty,</p><br/><p>so let it be and leave me alone.</p><br/><p>The higher the sky the narrower the minds and we never ask why,</p><br/><p>so let it be and leave me drunk. I’m crying today but I’ll laugh tomorrow.</p><br/><p>This is hard to explain and you don’t know why I’m so proud.</p><br/><p>I’m singing now and I’ll dance more. Days and nights and I’ll keep looking for happiness……”</p><br/><p>Under the moonlight, Murong Qi Qi exuded confidence which attracted everyone’s attention. The smile that was like a flower on the confident girl was so beautiful, it made people ignore her ordinary looks and every ‘scandal’ about her.</p><br/><p>“Such confidence……”</p><br/><p>Li Yun Qing looked at Murong Qi Qi with narrowed eyes. Some place in his heart had been touched by her singing. Was this the real you? So proud, so confident, so satisfied……so it turned out what you wanted were these……</p><br/><p>Beside Li Yun Qing, Shangguan Wu Ji’s eyes were also firmly locked on Murong Qi Qi.</p><br/><p>That was right, she was not the most beautiful, but she was the most enchanting!</p><br/><p>A smile, a frown, magnificent style unmatched in this generation. Shangguan Wu Ji had never known that women could also have such aspiration and passion, making people unable to do anything but chase after her! Unfortunately……such a wonderful woman was already engaged and would soon marry another. Thinking till here, Shangguan Wu Ji’s eyes darkened.</p><br/><p>Everyone was attracted by Murong Qi Qi sitting on a stone and singing confidently with ease. No one noticed a pair of deep eyes hidden in the dark, which were already locked on Murong Qi Qi. Glaring at her like she was his prey. The treasure he had been looking for, had actually appeared in Murongfu3, making this pair of eyes immediately brighten up.</p><br/><p>How could this be?</p><br/><p>Duanmu Yi Yi looked in shock at Murong Qi Qi. She (MQQ) was so elegant, so free and so easy. Even she (DYY) herself couldn’t learn it. What to do now?! What to do now?! Duanmu Yi Yi grabbed her sleeves. Just from the expression on everyone’s faces, she knew that Murong Qi Qi had won. She hadn’t competed yet, but she has already completely lost.</p><br/><p>At the end, Murong Qi Qi sighed gently. She lowered her head and smiled at everyone.</p><br/><p>“How was it? Was it enjoyable to the ears?”</p><br/><p>1. Gongzi: unmarried man/ young master/ also used to call a famous unmarried man</p><br/><p>2. Wangfei: main wife/consort of the prince of first rank</p><br/><p>3. Fu: mansion/residence/household</p><br/>\n</div>"}