{"title": "Chapter 17: The Enemy of My Enemy Is a Friend", "id": 17, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-17-the-enemy-of-my-enemy-is-a-friend", "volume_title": "Volume 1", "body": "<h1>Chapter 17: The Enemy of My Enemy Is a Friend</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 17: The Enemy of My Enemy Is a Friend</p><br/><p>After Zheng Min and that man’s body had been thrown out, Murong Tai flung his sleeve and left. He needed to go to Liu Yan Zhi’s to search for consolation. After all these kind of matters really hurt a man’s self-esteem.</p><br/><p>Murong Qing Lian looked once at the fainted Murong Xin Lian, sneered and also went back to Lan Xiang yuan1.</p><br/><p>After quite a while did Murong Xin Lan slowly woke up. The maroon blood on the ground reminded her what just happened. Murong Tai actually killed her mother in front of her. No matter what Murong Xin Lian couldn’t accept this.</p><br/><p>“Ma Nao, come here!”</p><br/><p>Murong Xin Lian looked gloomily at Ma Nao.</p><br/><p>“Why was my mother here? Where is that slut Murong Qi Qi? And where is Murong Jun? Should it not have been them who should be here?!”</p><br/><p>“Second miss, this slave doesn’t know, ah!”</p><br/><p>Ma Nao had also been scared to death by what happened.</p><br/><p>“This slave obviously helped third miss get in the bed. Later I also led young master here. Why it became like this, this slave also doesn’t know, ah!”</p><br/><p>Murong Xin Lian didn’t listen to Ma Nao’s explanation. She only wanted to vent. She wanted to vent the anger and sadness in her heart. Murong Xin Lian pulled out a hairpin and fiercely stabbed it in Ma Nao’s face.</p><br/><p>“Bitch! You cause my mother to die! Give my mother back to me!”</p><br/><p>“Miss, don’t!”</p><br/><p>Ma Nao raised her arm to dodge. This kind of action made Murong Xin Lian more furious.</p><br/><p>“I let you dodge! I let you dodge!”</p><br/><p>Murong Xin Lian grabbed Ma Nao’s hairs. She directly stabbed the hairpin into Ma Nao’s eye. She pricked once, but it didn’t lessen her hate. She pricked above ten times.</p><br/><p>“Second miss, spare me! Second miss spare this slave!”</p><br/><p>Ma Nao’s miserable cries attracted the servants over. When they saw Murong Xin Lian’s ferocious appearance and the small and large holes full of blood on Ma Nao’s face, everyone was scared till they were in daze by Murong Xin Lian’s cruel means.</p><br/><p>Was this still the gentle and pleasant second miss? Could it be that this was second miss’s true colors? In a moment, the image that Murong Xin Lian shaped so hard, fell apart. But at this moment, Murong Xin Lian didn’t care about that. Zheng Min had been caught in bed. She, this second miss had long lose all face.</p><br/><p>Even if Murong Tai blocked everyone’s of the mansion’s mouth, there was no guarantee that others wouldn’t tell; for example the young masters and miss of the three great families. Now her face was gone, why did she still need to care about image?!</p><br/><p>At this moment, Murong Xin Lian only wanted to vent. Vent the anger inside her. Until Chen Zhong appeared again and dragged the tragic sight of Ma Nao with a body covered in blood away, did Murong Xin Lian sat limply on the ground.</p><br/><p>Over, all was over. Today’s matter would let her become Murong household’s, no, she will become the joke of the capital! No one will marry her who had such a matter. No need to mention Jing wangfei2, even becoming a concubine to warm Longze Jing Tian’s bed was now impossible…….</p><br/><p>Murong Xin Lian sobbed for a while. Until everyone had left, did Fei Cui came.</p><br/><p>“Second miss, condolences!”</p><br/><p>Fei Cui handed a handkerchief to Murong Xin Lian.</p><br/><p>“You can’t give up like this, ah! Someone certainly tempered with today’s matter. You must pick yourself up and get revenge for concubine Zhen!”</p><br/><p>Fei Cui’s words pulled Murong Xin Lian from her grief. That was right, she couldn’t give up like this! Why did the matter become like this? She must find the reason. She couldn’t let Zheng Min die unjustly!</p><br/><p>“Did you look carefully?!”</p><br/><p>Murong Jun gritted his teeth and glared full of hate in the direction of Ou Xiangyuan. Murong Xin Lian actually calculated him and Murong Qi Qi to ruin their reputations! That bitch was really malicious!</p><br/><p>“Why did you help me?”</p><br/><p>Murong Jun looked at the person in black. If it wasn’t because of this person’s help, the one who would’ve died on Murong Tai’s sword tonight would be him, Murong Jun!</p><br/><p>“Can’t continue looking at that bitch pretending!”</p><br/><p>The person in black left this sentence and disappeared from the room. Seeing that no one was here, Murong Jun hurriedly left. After he left, the person in black went to Cui Zhu yuan.</p><br/><p>“Miss, the matter is finished!”</p><br/><p>The person in black ripped of the black cloth on her face. It was Su Yue. She made an ‘ok’ gesture at Murong Qi Qi.</p><br/><p>“Not bad!”</p><br/><p>Murong Qi Qi was sketching on a paper. Su Yue went forward and looked. Murong Qi Qi is designing jewelries, hairpins, earrings, buckles, bracelets, rings…… a set. All have a Begonia flower design.</p><br/><p>“Miss, are these for Bai family’s eldest miss? So beautiful! It really matches miss Bai’s aura!”</p><br/><p>“Clever!”</p><br/><p>Murong Qi Qi nodded. After the final brush, Murong Qi Qi put down the brush and carefully dried the ink.</p><br/><p>“Su Mei, tomorrow you make a trip to Tong Bao Zhai. Let master Li make the jewelries with the best jade. The sooner the better.”</p><br/><p>“Why did miss save Murong Jun? Making that stick be ruined isn’t it very good?”</p><br/><p>Su Mei didn’t understand.</p><br/><p>“The enemy of my enemy is our friend. With one more person to resent Murong Xin Lian, will I not have more time to sleep……”</p><br/><p>“Yes!”</p><br/><p>Su Mei and Su Yue glanced at each other and laughed. Miss was like this. Those who treated her well, even if it was with a drop of water, she would remember. Those who were bad to her, she would also not let go.</p><br/><p>Bai Yi Yue would have never thought that today she unintentionally helped Murong Qi Qi, she would be able to get ‘Guang Hua gongzi’s’[] 3. Gongzi: young master/ also used to call a famous unmarried man] full set of jewelry. If she knew that the Guang Hua gongzi from the rumors was Murong Qi Qi, how would she feel?</p><br/><p>Recently, too many things happened at Murong fu3. Third miss Murong Qi Qi injured miss Duanmu, cutting of the tendons of his right hand. Duanmu Lei filled a lawsuit at the imperial censor. Murong fu’s favored concubine Zheng suddenly died from illness. Second miss couldn’t accept the fact that her mother had passed away and was sick in bed……</p><br/><p>1. Yuan: a part of a residence</p><br/><p>2. Wangfei: main wife/consort of the prince of first rank</p><br/><p>3. Fu: residnece/mansion/household</p><br/>\n</div>"}