{"title": "Chapter 30: Ce Wangfei", "id": 30, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-30-ce-wangfei", "volume_title": "Volume 1", "body": "<h1>Chapter 30: Ce Wangfei</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 30: Ce Wangfei</p><br/><p>Longze Yu Er’s overbearing manner made Bai Mu Fei and Fang Kuifrown at the same time. Bai Mu Fei didn’t say anything, but Fang Kui couldn’t let someone speak like this about his master.</p><br/><p>“Even if princess can pay, it also depends on whether or not our family’s gongzi 1 is in the mood. Not to mention…….”</p><br/><p>Fang Kui looked at Longze Yu Er from head to toe: “Looking at princess’ worth, I fear that you cannot afford it.”</p><br/><p>“What did you say? Did you say that bengong 2 doesn’t have any money?”</p><br/><p>Being the high-above princess, when has Longze Yu Er ever been mocked like this?</p><br/><p>“What bengong has is plenty of money. Say, how much do you want?”</p><br/><p>“Hehe……”</p><br/><p>Seeing Longze Yu Er acting so ignorant, Fang Kui sneered.</p><br/><p>“Just the material of this set of ‘Begonia’s spring sleep’ in miss Bai’s hand is worth ten thousand golden teals, not including labor, product price and appreciation potential. Only this, princess is already unable to afford it. Moreover, even if princess is willing to sacrifice everything you have and is somehow able to get the money, our family’s gongzi may be unwilling to do it. After all, there are only very few people who can get in my family’sgongzi’s eyes. Princess can have less of these ideas, so as not to become a joke!”</p><br/><p>“You!”</p><br/><p>Fang Kui not giving her face, made Longze Yu Er flip out on the spot: “Servants! Kill this bastard! Seal Tong Bao Zhai! Everywhere beneath the sky is the imperial family’s; around each corner, there are imperial officials.Bengong doesn’t believe that a small Tong Bao Zhai can defy bengong’scommand!”</p><br/><p>“Ha ha ha!”</p><br/><p>Hearing Longze Yu Er’s words, Fang Kui laughed out loud: “Don’t need to trouble princess! From this day forward, there’s no longer a Tong Bao Zhai in Xi Qi country. My family’s gongzi has already moved Tong Bao Zhai to another country. The gift for miss Bai is our family’s gongzi’s last work in Xi Qi country.”</p><br/><p>After saying this, Fang Kui bowed respectfully to Bai Mu Fei and Bai Yi Yue: “Our family’s gongzi said to thank you two for your former care. Today, he has repaid miss Bai; in the future, he will surely send a big gift for Bai gongzi. The task gongzi gave this little one has been fulfilled. I won’t stay any longer and will take my leave!”</p><br/><p>After just a ‘take my leave’, Fang Kui and the attendant disappeared in front of everyone.</p><br/><p>Level eight martial artist! Bai Mu Fei was really shocked. Such a person is actually willing to be Guang Hua gongzi’s subordinate and be a small shopkeeper. Then what kind of stunning figure is that Guang Hua gongzi?!</p><br/><p>When the imperial guards of the capital arrived at Tong Bao Zhai, it was empty. Because princess Ping Yang wanted to close down Tong Bao Zhai, Tong Bao Zhai became the new topic. Miss Bai getting the set of ‘Begonia’s spring sleep’, Jing wang 3 breaking off the engagement andMurong Qi Qi marrying to a far away land became the hottest topics in the capital.</p><br/><p>At this point, the gloomiest person was none other than Jing wang Longze Jing Tian. With great difficulty, he was able to get rid of Murong Qi Qi. He didn’t expect that instead, he would be bound by Murong Xin Lian.</p><br/><p>What Murong Tai said the moment he opened his mouth was about killing Murong Xin Lian. A woman’s body had been seen by another, no one would be willing to marry her. Such an immoral thing, it’s really a shame to the family. Holding a life in his hand, he forced Longze Jing Tian into agreeing to let Murong Xin Lian become a cefei4.</p><br/><p>The second Longze Jing Tian nodded, Murong Tai immediately went into the palace to get the emperor’s approval. Soon afterwards, he let a small carriage directly send Murong Xin Lian to Jing wangfu5.</p><br/><p>Now, Murong Xin Lian has already become Longze Jing Tian’s official ce wangfei. Without a reason, the wangfu got one more woman, which madeLongze Jing Tian feel extremely irritable.</p><br/><p>It just so happened that at that time, Du Xian Er had sent someone over with the jade pendant to get the five hundred thousand silver teals. After getting the money, the other party kept saying: “the greatest wish of our family’s miss in this lifetime is ‘willing to get one person’s heart</p><br/><p>till their hairs become white and still unwilling to be apart’. Since wangyealready has a gentle and charming bride, don’t put on that kind of infatuated expression anymore. Deceiving another’s feelings is a small thing, but delaying our family’s miss’ marriage is big trouble!”</p><br/><p>Don’t know where Du Xian Er got such an eloquent girl. Every word was able to choke people to death but Longze Jing Tian was unable to do something to the other party. After all, she’s Du Xian Er’s confidante. He still wanted to marry Du Xian Er and make her his wangfei. He couldn’t offend the people around her.</p><br/><p>“Wangye, I lost her.”</p><br/><p>Lu Yuan stood with his hands behind his back in front of Longze Jing Tian. His head was lowered and he’s waiting to be reprimanded. He was originally following Su Mei and didn’t expect that the other party knew the capital very well. Just two blocks and she put him behind her.</p><br/><p>“Asking wangye for punishment!”</p><br/><p>“Her people, naturally……”</p><br/><p>Everything was within Longze Jing Tian’s expectations. Such a woman who was clear as ice and clean as jade, the people around her were naturally not bad. But she misunderstood him,</p><br/><p>didn’t want to see him, what can he do?</p><br/><p>After thinking for a long time, Longze Jing Tian commanded: “Du Xian Er is surely inside the capital. Lu Yuan, send people to investigate. You must find out Du Xian Er’s whereabouts. Benwang 6 doesn’t want her to misunderstand. Benwang must clearly explain it to her in person.”</p><br/><p>“Yes!”</p><br/><p>Regarding wangye’s infatuation, Lu Yuan could only sigh in secret. It’s just that she wants to hide with all her heart, so how will they be able to find her?!</p><br/><p>Outside the study, Lu Ye stopped Murong Xin Lian, who had come to visitLongze Jing Tian while carrying a tray of food.</p><br/><p>“Ce wangfei, wangye has something to do and doesn’t want to be bothered.”</p><br/><p>“Oh……”</p><br/><p>Murong Xin Lian was somewhat disappointed. She lifted her eyes to look at the closed door. Her wish had finally come true. Although it’s only acefei, Murong Xin Lian was confident that with her wisdom and beauty, she would surely be able to seize Longze Jing Tian’s heart. But yesterday night, Longze Jing Tian didn’t come to her place. In other words, Longze Jing Tian just gave her a place to live in the wangfu and didn’t have any other thoughts about her. This made Murong Xin Lian a bit worried.</p><br/><p>Seizing a man’s heart or giving birth to an offspring. This was the method Murong Xin Lian’s mother Zheng Min had once taught her! Not getting love? Then, must have a son to fall back on. Only then could a woman be considered to have something to look</p><br/><p>forward to.</p><br/><p>No, no, it can’t be like this! Cannot admit defeat easily like this!</p><br/><p>Murong Xin Lian took a deep breath. She just came into the wangfu. There would be ample time. She cannot be impatient. Impatience will botch things. After all, she has plenty of time! Longze Jing Tian’s heart, she wants! Son, she wants! The seat of wangfei, she also wants! What women deserve or not deserve, she wants them all!</p><br/><p>“This is the green bean lily soup I personally stewed. Troubling you to send it to wangye. I will go back now!”</p><br/><p>Murong Xin Lian let the maid next to her put down the food container. From beginning to end, her face showed a soft smile. There isn’t any trace of anger.</p><br/><p>“I will go back! Sorry to trouble you!”</p><br/><p>Longze Jing Tian’s attitude towards this new ce wangfei, Lu Yuan and Lu Ye, who followed him, knew very well. Originally, Lu Ye thought that after Murong Xin Lian heard that Longze Jing Tian didn’t want to see her, she would get angry and put up airs. He didn’t expect that the other party was so pleasant. This made Lu Ye have some good feelings towards this ce wangfei. He picked up the food container and walked in.</p><br/><p>“Benwang doesn’t like sweets, you guys eat!”</p><br/><p>Longze Jing Tian frowned and pushed the food container away.</p><br/><p>“In the future, if she sends more, you eat them all. Benwang doesn’t want to see it.”</p><br/><p>For ten consecutive days, regardless of the weather, every afternoon Murong Xin Lian would personally send a pot of soup for Longze Jing Tian. The result was that all of it went to the two brothers from Lu family and she didn’t know.</p><br/><p>And during these ten days, from Bei Zhou came the news that Nan Lin wang Feng Cang would personally come to Xi Qi to escort wangfei to Bei Zhou. And he sent an aunt who knew etiquette very well to teach Bei Zhou’s court etiquette to Murong Qi Qi. He also sent a multi-talented master to travel with the aunt, mainly to teach the future Nan Lin wangfei Bei Zhou’s language and customs.</p><br/><p>Footnotes:</p><br/><p>1. Gongzi: young master/ also used to refer a famous unmarried man?</p><br/><p>2. Bengong: I, used by the females of the imperial family?</p><br/><p>3. Cefei/cefei: side concubine/ second ranked wife of a wangye?</p><br/><p>4. Wangfu: residence of a wangye?</p><br/><p>5. Benwang: I, used by wangye ?</p><br/><p>6. Benwang: I, used by a wangye?</p><br/>\n</div>"}