{"title": "Chapter 39 Gold thread dress", "id": 39, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-39-gold-thread-dress", "volume_title": "Volume 1", "body": "<h1>Chapter 39 Gold thread dress</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 39 Gold thread dress</p><br/><p>“Oh……”</p><br/><p>Inside Murong Qi Qi’s voice, there’s no surprise. When she had met Jin Mo earlier, Murong Qi Qi had already known that Feng Cang was in Xi Qi. Today, he came to visit Jue Se Fang, he seemed to be in a good mood.</p><br/><p>Just thinking once, Murong Qi Qi already guessed Feng Cang’s intention.</p><br/><p>During this time, she seemed to have been ‘pampered’ till she had became spoiled by Feng Cang’s care. Clothes, foods, houses, transportation, Feng Cang made all the arrangements for her. Even the plants and flowers in her Cui Zhu yuan1 had been specially sent by his people.</p><br/><p>Feng Cang was even worried that she would not be accustomed to the food of Bei Zhou. He specifically sent the cook of his wangfu2 to chengxiangfu3 to make roast lamb, Mongolian hotpot (instant boiled mutton) and milk tea for her.</p><br/><p>This man must’ve learned the trick to get someone’s heart. He’s obviously in Xi Qi, but never showed up. He just let everything around her, every stitch, every plant and trees be branded with his mark, making it so that even if she wanted to forget, it would be difficult. Have to say, this was a very good method. Now, even Su Yue and Su Mei are talking about how good Feng Cang is.</p><br/><p>Not long ago, news came from Fang Kui. On the first day Tong Bao Zhai had opened at Bei Zhou, the flower crown design Murong Qi Qi made with golden threads ‘Autumn Flower’ was bought by a mysterious person at a high price. That person was Feng Cang’s subordinate. Feng Cang probably did it for the banquet at the palace!</p><br/><p>However, as to why Feng Cang was treating her so good made Murong Qi Qi feel very confused.</p><br/><p>According to research, his parents had died at the battle on Yangdang Mountain. The one who’d turned the tables, making Xi Qi win the battle was Murong Tai. Feng Cang should be hating Xi Qi, hate the Murong family. So why does he want to marry her, this ‘rubbish’ from Murong family and keep spoiling her again and again?</p><br/><p>Could it be that he changed his method to get revenge? Does he want to get her to the top and then let her fall to her bones as revenge for his parents? If it’s like this, then he picked the wrong person……</p><br/><p>“Miss, you look… …,” Fang Tong opened his mouth. This matter was related to Murong Qi Qi, miss needed to make her own decision.</p><br/><p>“No need to worry!”</p><br/><p>Seeing through Fang Tong, Murong Qi Qi smiled: “Whenever he takes a fancy to any clothes, just shout a high price. Having Nan Lin wang4 Feng Cang’s campaign for us, Jue Se Fang would surely be on fire in Xi Qi country. This banquet at the palace is a good opportunity!”</p><br/><p>Talking til here, Murong Qi Qi paused.</p><br/><p>The only clothes that could match ‘Autumn Flowers’ was the ‘Gold thread dress’. If Feng Cang gave her ‘Autumn Flower’ in order to gain her favor, then only this ‘Gold thread dress’ could match it.</p><br/><p>“Send the ‘Gold thread dress’ out. He would surely love it.”</p><br/><p>Murong Qi Qi slowly stood up. A silver light flashed from her hand. A little dandelion got hooked and was now in her sight. (TN: she hooked the flower from outside the window)</p><br/><p>Seeing miss taking action, Fang Tong didn’t even dare to breathe loudly.</p><br/><p>Everyone knew that miss had sir Mozun’s skills. The ‘Grasp flower laugh’ seen just now was one of sir Mozun’s secret skills. If you got the strength right, then taking people’s lives was a matter simpler than breathing.</p><br/><p>“By the way, tell him the poem.”</p><br/><p>Murong Qi Qi got the dandelion down and stared at it thoughtfully.</p><br/><p>Seeing that Murong Qi Qi didn’t speak any further, Fang Tong bowed again and retreated. He personally took the ‘Gold thread dress’ to Feng Cang.</p><br/><p>“This is our shop’s treasure ‘Gold thread dress’.”</p><br/><p>Although Feng Cang was wearing a gauze hat and Fang Tong couldn’t see this wangye’s expression, but with his knowledge of his miss’s craftsmanship, he must be shocked. If this future guye5 found out in the future that his miss is Guang Hua gongzi6, really don’t know what kind of expression he’ll expose!</p><br/><p>Although it’s called ‘Gold thread dress’, in fact it has nothing to do with gold. It’s a fire-red dress. The color was youthful and beautiful. On top, it’s covered with a gold colored gauze.</p><br/><p>The most amazing thing was that on the gold colored gauze, there’s landscape outlined on it. Thousand cranes flying, vigorous pines majestically towering over a cliff to covet a day, whereas breeze strokes the goldenrod cliff.</p><br/><p>And at the end of the cliff, there’s a waterfall spraying many splashes. Even the drops were clearly outlined like they’re alive. Under the waterfall, you would even be able to see a few fish swimming joyously.</p><br/><p>If it was a painting, it’s already artistic. If it’s on a dress, it could be considered a treasure.</p><br/><p>Feng Cang had never seen such a painting being drawn on clothes. So alive. It seemed that Jue Se Fang was so famous since it indeed had some capabilities.</p><br/><p>“Not bad…..”</p><br/><p>It’s like what Fang Tong thought. Feng Cang really took a fancy on this ‘Gold thread dress’.</p><br/><p>“Did your gongzi say where this gold thread dress came from?”</p><br/><p>“When our gongzi designed this gold thread dress, he made a poem.”</p><br/><p>“Oh?”</p><br/><p>Feng Cang obviously had strong interest in this poem. Fang Tong saw this and acted according to Murong Qi Qi’s order. He wrote down the poem and handed it to Feng Cang.</p><br/><p>“Advise gentleman to not pity gold thread dress, advise gentleman to cherish time (of being young), flowers blossoming may endure breaking but must break over time, don’t stay there waiting till the flower breaks.”</p><br/><p>Feng Cang’s voice was very appealing to the ears. Even Fang Tong, as a man, felt very comfortable listening to it. It’s just, don’t know how the personality of this future guye is……</p><br/><p>“Guang Hua gongzi is really interesting! This dress, I… …”</p><br/><p>Feng Cang hadn’t finished speaking when they heard an arrogant voice: “Bengong7 wants this dress!”</p><br/><p>At the door stood a well-dressed girl. She rushed to ‘Gold thread dress. There were stars shining in her eyes.</p><br/><p>“Heavens! Really beautiful! Bengong finally understands why Nan Feng’s imperial noble consort only loves Jue Se Fang’s clothes! Imperial sister-in-law, look, isn’t it really beautiful?”</p><br/><p>The one talking was princess Ping Yang Longze Yu Er and the imperial sister in law was Murong Xin Lian. The two originally came to prepare for the banquet at the palace. They heard that Jue Se Fang had come to the Xi Liang, so they came together.</p><br/><p>Xi Liang is the capital of Xi Qi.</p><br/><p>Since the lake tour, Longze Yu Er and Murong Xin Lian inexplicably became a lot closer. Maybe it’s because the two of them don’t like Murong Qi Qi. That’s why they have so much in common to talk about. Longze Yu Er even saw Murong Xin Lian as her close friend and would talk about everything with her.</p><br/><p>“Really beautiful!”</p><br/><p>After Murong Xin Lian saw this ‘Gold thread dress’, her gaze never left it. Although she also wanted this dress, but Longze Yu Er was a princess. Her purpose today was to please Longze Yu Er, so she had to reluctantly cut her love.</p><br/><p>“When princess wears it at the banquet, princess will surely shine over everyone else there!”</p><br/><p>Longze Yu Er was very happy after hearing Murong Xin Lian’s flattery. She took a fancy to this dress from the first glance. In Longze Yu Er’s eyes, this dress was tailor made for her. And only her, this noble and excellent princess, had the right to wear this ‘Gold thread dress’.</p><br/><p>Fang Tong knew who she was, but miss said this dress was for future guye. Fang Tong naturally wouldn’t let other people get it.</p><br/><p>“Sorry! This dress has already been bought by this young master!”</p><br/><p>“What?!”</p><br/><p>Hearing someone refuse her, Longze Yu Er angrily put on one hand on her hip. The other hand pointed at Fang Tong’s nose. She said angrily: “Open your dog eyes and look clearly. Bengong is princess Ping Yang! Who took a fancy on this dress? Is the other party nobler than bengong?”</p><br/><p>1. Yuan: part of a residence</p><br/><p>2. Wangfu: residence of the wangye</p><br/><p>3. Chengxiangfu/ xiangfu: residence of the prime minister</p><br/><p>4. Wang/ wangye: prince of the first rank</p><br/><p>5. Guye: son in law/ also used by the servants of the female’s family</p><br/><p>6. Gongzi: young master/ also used to refer to a famous unmarried man</p><br/><p>7. Bengong: I, used by the females of the imperial family</p><br/>\n</div>"}