{"title": "Chapter 31 Feng Cang’s Mass Line", "id": 31, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-31-feng-cang%E2%80%99s-mass-line", "volume_title": "Volume 1", "body": "<h1>Chapter 31 Feng Cang’s Mass Line</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 31 Feng Cang’s Mass Line</p><br/><p>20160717_144506</p><br/><p>Cui Zhu yuan 1 was filled with the gifts Feng Cang had sent over from Bei Zhou. From clothes and jewelries to home decorations. He even sent snacks from Bei Zhou. In short, everything a wangfei 2 should have, Feng Cang had prepared them all.</p><br/><p>“Princess is really beautiful, wearing our Bei Zhou’s clothing!”</p><br/><p>Feng Yu stood in front of Murong Qi Qi with a face full of glee. Feng Yu is the aunt Feng Cang sent. She’s Feng family’s servant. Only because her family had shown loyalty, generation after generation, that she was bestowed the surname ‘Feng’.</p><br/><p>Through living together these past few days, Feng Yu had become very satisfied with Murong Qi Qi, this future Nan Lin wangfei. The same etiquette,Feng Yu only needed to show it once, Murong Qi Qi would learn it very well. No need to show it a second time.</p><br/><p>Feng Yu had seen many noble ladies in Bei Zhou, but she’d never met one who learned so quickly. Just after a few days, Feng Yu felt that whatever she knew,Murong Qi Qi now knew. She’s nearly becoming useless.</p><br/><p>“No matter what our miss wears, it’ll look good!”</p><br/><p>Su Mei had high expectations for the future guye3. At least for now, Su Mei was very satisfied about the attitude Feng Cang showed towards Murong Qi Qi. Besides, this guye seemed really attentive. Even her and Su Yue’s clothes have been prepared. It seemed that this guye really knew how to ‘follow the mass line’!</p><br/><p>Su Yue really liked Bei Zhou’s clothes. The upper half and bottom half were separated. Bei Zhou’s folk were also not as strict as the south. Women could ride a horse and play football. This was really to Su Yue’s personality.</p><br/><p>“Although miss is very beautiful when wearing a dress, but wearing Bei Zhou’s clothes makes miss look more valiant and easy going!”</p><br/><p>Su Yue’s evaluation was very fair.</p><br/><p>“Aunt Feng Yu, these few days have been a trouble for you to teach me, thank you!”</p><br/><p>Murong Qi Qi respectfully thanked Feng Yu according to Bei Zhou’s etiquettes.</p><br/><p>“Aiyo, princess, what are you doing?! Such a big etiquette, I won’t be able to accept it!”</p><br/><p>Feng Yu quickly helped Murong Qi Qi up.</p><br/><p>“These are what this slave should do. Princess shouldn’t be like this anymore in the future. If outsiders see it, it’ll be bad for princess. You are the futurewangfei. This slave is always just a slave. Should pay attention to the hierarchy!”</p><br/><p>“Aunt Feng Yu, there are no outsiders now. Could it be that aunt wants to tell other people?!”</p><br/><p>Su Yue smiled while looking at aunt Feng Yu.</p><br/><p>“Our family’s miss is thanking aunt sincerely. Aunt, don’t refuse it!”</p><br/><p>Although Su Yue said it very reasonably, but Feng Yu still didn’t dare to be so rash. Before she came, Feng Cang said a thousand times to let her serveMurong Qi Qi well. Feng Yu had stayed at wangfu4 for so long and had never seen Feng Cang care so much about a miss. Even to Bei Zhou’s Princess Bao Zhu and the number one talented woman Mu Yu Die, wangye5 didn’t show a good face.</p><br/><p>Earlier, Feng Yu still had some doubts about this bestowed princess, the future Nan Lin wangfei, but after getting along these past few days, Feng Yu felt thatFeng Cang’s eyes were very good.</p><br/><p>Although Murong Qi Qi’s looks were ordinary, but she’s agile and intelligent. Her personality was generous and gentle. Just with learning Bei Zhou’s language, the teacher had only taught for three days and Murong Qi Qi’s accent scared the teacher so much that he nearly kowtowed to let Murong Qi Qi become his teacher.</p><br/><p>With such a pleasant person next to wangye, presumably wangye will get better soon!</p><br/><p>How could Feng Yu know that the so-called Bei Zhou’s language was exactly the same as Mandarin of the future. For Murong Qi Qi, this was a piece of cake.</p><br/><p>Only speaking after learning for three days was because Murong Qi Qi didn’t want to scare the teacher, but she didn’t expect that she would still frighten the teacher. The teacher kept saying ‘princess is talented’. Su Mei and Su Yueturned him into a joke.</p><br/><p>“Miss, it is time for the teaching.”</p><br/><p>Su Yue looked at the time and reminded her.</p><br/><p>The so-called teaching, aside from learning Bei Zhou’s language, there’s also Bei Zhou’s history.</p><br/><p>The teacher Feng Cang sent was actually not over twenty-six years old. He’s in fact a young talent named Nalan Xin. After Murong Qi Qi opened her mouth to speak Bei Zhou’s language and scared Nalan Xin, the class of language was skipped. Nalan Xin began to teach Murong Qi Qi Bei Zhou’s history.</p><br/><p>Nalan Xin didn’t know with what words he could describe this student. Have to say, this princess Zhao Yang is exceptionally intelligent. Just with some teaching, she’s able to learn by analyzing. Originally, Nalan Xin didn’t understand why wangye chose Murong Qi Qi, but now he totally understood.Wangye was insightful and saw a pearl. Only such a glowing pearl is worthy ofFeng Cang.</p><br/><p>“Da Lu has four countries: Bei Zhou, Xi Qi, Nan Feng and Dong Lu. Dong Lu country is the oldest. From the beginning of its dynasty till now, it’s already 238 years.”</p><br/><p>“Bei Zhou, Xi Qi and Nan Feng formed 25 years ago. At that time for some reason, the then great general Wanyan Zhi occupied the north and established Bei Zhou. The minister of personnel Longze Lan established Xi Qi. Guo Zhang Ming unknowingly established Nan Feng which resulted in the world being split into four!”</p><br/><p>Nalan Xin didn’t know why Feng Cang wanted him to tell Murong Qi Qi about this. Murong Qi Qi is only a woman, why did she have to know so much? But this was Feng Cang’s command, he could only follow it.</p><br/><p>“Teacher, I heard that Dong Lu is not big. How did it exist for so long even when facing with other countries being usurped?”</p><br/><p>Murong Qi Qi’s question made Nalan Xin nod approvingly. He had forgotten that just now, he’d thought that Murong Qi Qi was just a woman and didn’t need to know so much.</p><br/><p>“Princess, Dong Lu is near the sea. Their maritime industry is very well developed and their relationship with Peng Lai Island is very good. Every empress of Dong Lu is a student of Peng Lai Island. If the country is met with crisis, Peng Lai island will definitely come forward to help.”</p><br/><p>“Moreover, Dong Lu produces salt. Salt is something commoners must have. Although other countries have vast land, but they still need Dong Lu for salt.”</p><br/><p>“Peng Lai Island?”</p><br/><p>Murong Qi Qi thought of the legendary Peng Lai fairyland, but this Peng Lai Island was not the same as the one in the legend.</p><br/><p>Nalan Xin especially took a day off to tell her about Peng Lai Island. He heard that over there, martial experts were as much as clouds. The great purple level seven experts from Da Lu are just small level disciples at Peng Lai Island.</p><br/><p>If there’s really such a place, I really need to find an opportunity to go take a look! As Murong Qi Qi is thinking, Peng Lai Island made all the combative cells on her body jump. Don’t know with her current ability, what position she would get in Peng Lai Island?</p><br/><p>In a house in the capital, Feng Yu and Nalan Xin were standing respectfully behind a man in white clothes. One hand was holding a container with fish food, the other hand tossed the fish food in the pond in front of him, attracting a group of koi.</p><br/><p>koi</p><br/><p>Koi</p><br/><p>“Oh? Wangfei performed so well?”</p><br/><p>After listening to the two’s report, Feng Cang’s mouth showed a smile.</p><br/><p>“It seems that this little wangfei is a somewhat unpredictable woman! It was hard on you two!”</p><br/><p>The happiness revealed inside Feng Cang’s words was sincere. Feng Yu andNalan Xin lowered their heads slightly to express their respect to this man in front of them. Being able to make wangye happy, they were also happy. But all of these were thanks to Murong Qi Qi.</p><br/><p>1. Yuan: mansion/residence </p><br/><p>2. Wangfei: the wife of the wangye</p><br/><p>3. Guye: son in law/ als used by the servants of the female’s family</p><br/><p>4. Wangfu: residence of a wangye</p><br/><p>5. Wangye: prince of the first rank</p><br/>\n</div>"}