{"title": "Chapter 37 If I become the emperor", "id": 37, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-37-if-i-become-the-emperor", "volume_title": "Volume 1", "body": "<h1>Chapter 37 If I become the emperor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 37 If I become the emperor</p><br/><p>“The difficulties occurring in heaven would lead to the emergence of a greater immortal. Therefore, people can also become greater. They must first suffer and work to their bones, until their skin become stuck on their body from hunger, making their body weak. The road to one’s appointed place is full of confusion, so it’ll tempt people’s heart and they are able to suffer what others won’t. Once people survive that, they can change. Trap their heart, consider well and then make the move. The journey is full of colors showing one’s inner voice. Such a person can’t go home without capabilities and leave this foreign land without having suffered. They’ve known hardship through life and will die of happiness too.”</p><br/><p>This was a poem MQQ wrote for MYC. MQQ is telling MYC that even though he is a hostage now (in a difficult situation), he can become stronger. He must first pass many hardships before he can get back to his appointed place (the future emperor of Nan Feng). During that process, he may have many doubts which will tempt him, but he will be able to overcome hardships that others can’t. Once he passes through these hardships, he will become stronger. Make the decision, consider all possibilities and take action. His journey will be hard and he’ll want to give up many times. A great person can’t go home without having the abilities. After he understood all the hardships, he can enjoy his life and die in happiness.</p><br/><p>Just a few words made Ming Yue Cheng emotionally overwhelmed and burning with excitement. He looked at Murong Qi Qi’s carriage which was travelling further away. Ming Yue Cheng clenched the letter in his hand. Only then did he notice a sentence written on the back: “A great man has to be ruthless.”</p><br/><p>“Hahahaha!”</p><br/><p>Ming Yue Cheng laughed out loud while looking at the direction of Murong Qi Qi’s carriage. His eyes turned darker.</p><br/><p>That young maiden in white actually could see through his endurance of humiliation as part of an important mission. She actually could see deep into his heart. On one side, she’s telling him to continue to endure. On the other side, she’s telling him to assess the situation and look for an opportunity to use a killer move without letting the other party have time to react.</p><br/><p>Sure enough, it’s really a pity that you are getting married to Bei Zhou… …</p><br/><p>Fu Er didn’t know what was written in the letter. Seeing that Ming Yue Chen’s demeanor was not quite right, he quickly stepped forward and said with care: “Your highness, what’s wrong?”</p><br/><p>“Fu Er, that woman is my soulmate.”</p><br/><p>Ming Yue Cheng pointed forward. His eyes were firm.</p><br/><p>“If I become the emperor, I will snatch her to be my empress!”</p><br/><p>“Miss, what did you write in the letter? Why is Nan Feng’s crown prince laughing so happily?”</p><br/><p>Su Yue glanced back curiously at Ming Yue Cheng, who stood there laughing.</p><br/><p>Murong Qi Qi brushed the hair off her forehead, picked up the feather fan and gently shook it.</p><br/><p>“I was just thinking with what identity should I form an alliance with this crown prince who is in dire straits……”</p><br/><p>“Hehe,” Su Yue laughed. “Miss, you have so many identities. Just take any out, wouldn’t he be willing? But why do you want to help him?”</p><br/><p>“A crafty rabbit has three burrows.”</p><br/><p>A crafty rabbit has three burrows: a sly individual has more than one plan to fall back on.</p><br/><p>Murong Qi Qi’s words made Su Yue turn silent. Indeed, going to the far away Bei Zhou this time, it’s still unknown if it’s a blessing or a curse. Having a place to retreat to is always good.</p><br/><p>After ‘A glance at the mundane world’, ‘One laughter on azure water’ once again swept the capital. More and more people wanted to learn Murong Qi Qi’s easygoingness. But in the end, no one could be like Murong Qi Qi.</p><br/><p>Inside Ci Ning Palace, empress dowager Shangguan Fei Yan tasted Murong Xin Lian’s lotus seed soup. She kept saying ‘it’s good’.</p><br/><p>lotus seed soup</p><br/><p>Lotus seed soup</p><br/><p>“You and your big sister are alike. You all are well behaved!”</p><br/><p>“Thanking empress dowager!”</p><br/><p>Murong Xin Lian took over Shangguan Fei Yan’s bowl and then she filled some more for her.</p><br/><p>“If you like it, Xin er1 will make it every day!”</p><br/><p>“This child, your mouth is really sweet!”</p><br/><p>Obviously, Shangguan Fei Yan has a good impression of Murong Xin Lian. Gentle and beautiful. Has a good personality. It’s really pleasing to the eye.</p><br/><p>“Call aijia2 imperial grandmother like Jing Tian! We all are one family. Calling aijia empress dowager really isn’t intimate!”</p><br/><p>Hearing empress dowager say that, Murong Xin Lian was really happy. She immediately knelt and kowtowed: “Xin er thanks imperial grandmother!”</p><br/><p>“Hehe, get up, ah! Really a truthful child!”</p><br/><p>Shangguan Fei Yan let people help Murong Xin Lian up.</p><br/><p>“You, ah. Don’t always run to aijia here. Making aijia hold a great-grandson is the real business! Put the heart you spend on aijia on Jing Tian instead. Aijia has wished for this great-grandson for a long time!”</p><br/><p>“Imperial grandmother……”</p><br/><p>Murong Xin Lian blushed but in her heart, she’s secretly crying. Since the lake tour, Longze Jing Tian seemed to be acting colder to her. It’s certainly because of that bitch Murong Qi Qi!</p><br/><p>“Are you shy now? Young people, ah really have thin face. Take it slowly! You see, your big sister will soon add a prince to the imperial family. You also need to work hard!”</p><br/><p>Shangguan Fei Yan’s words made Murong Xin Lian suddenly understand one thing. That is, the emperor hadn’t named a crown prince yet. Seeing how Murong Xue Lian is currently favoured, maybe the prince she gives birth to would be bestowed the title of crown prince. Then won’t her dream of crown princess, her dream of empress, become shattered?!</p><br/><p>No! The place of the crown prince is Longze Jing Tian’s. The place of the crown princess is hers! She must think of a way to give birth to the first imperial grandson! They say that after a generation, the relation would be closer. Maybe by that time, the emperor would love the first imperial grandson and will then make Longze Jing Tian the crown prince.</p><br/><p>Previously, all of her fifteen years had been suppressed by Murong Xue Lian. With great difficulty, she had finally entered the imperial family. If she’s still surpassed by her, then won’t her efforts, her work and Zheng Min’s death be wasted!</p><br/><p>After returning to the wangfu, 3 Murong Xin Lian once again prepared soup and delivered it to Longze Jing Tian’s study. It had long become Lu Ye’s snack. After these past few days, they were already familiar with it. Within their hearts, their impression of Murong Xin Lian, this cefei4 was not bad. They felt that she’s beautiful and polite and didn’t have the arrogance of those pampered noble ladies.</p><br/><p>“Wangye5, ce wangfei sent soup to clear the heat.”</p><br/><p>“You drink it!”</p><br/><p>Longze Jing Tian didn’t even raise his head.</p><br/><p>“That’s right, how’s the matter that I let you investigate going?”</p><br/><p>“Answering wangye, there was nothing wrong with Murong Qi Qi on the night of admiring the moon at the pavilion. But this subordinate found out another matter. It’s that on that same night, ce wangfei’s mother was having an affair with another man and got caught by the prime minister. Prime minister killed them on the spot. Regarding this matter, aside from the Duanmu family, the young masters and misses of the other three families were also present.”</p><br/><p>Lu Ye told Longze Jing Tian everything he found out whilst drinking the ‘clearing heat’ soup.</p><br/><p>“Oh? Such coincidence?”</p><br/><p>Longze Jing Tian touched his chin. He felt that there’s something fishy. He believed Murong Qi Qi’s words. That woman dared to do and dared to admit. What she said must be true.</p><br/><p>“Yes, ah!”</p><br/><p>Lu Ye put down the bowl and wiped his mouth.</p><br/><p>“Prime minister sealed all the mouths of the people of xiangfu6. To the outside, he said that concubine Zhang died of illness. At that time, ce wangfei was sick for a long time.”</p><br/><p>The more Lu Ye talked, the thirstier he felt. His whole body was hot. He couldn’t help but fan with his hand. After that, he simple tore off his collar, but his whole body was getting hotter and hotter.</p><br/><p>“Hot?”</p><br/><p>Longze Jing Tian spotted Lu Ye’s strangeness. He put his hand on Lu Ye’s wrist. After he checked, the color of his face changed.</p><br/><p>“Servants, prepare cold water! Also, call the physician!”</p><br/><p>The physician came over and carefully examined the ‘clearing heat’ soup.</p><br/><p>“Answering wangye, inside there’s a medicine added which will let people act impulsive.”</p><br/><p>The physician’s words were very subtle. When saying it plainly, it’s spring medicine (aphrodisiac). This result made the physician wonder. Could it be that wangye is unable to do that? He actually needs such stuff?</p><br/><p>Obviously, he guessed wrong. Longze Jing Tian seemed to have felt the physician’s strange look. He looked at the physician coldly. The physician immediately lowered his head.</p><br/><p>“Go look at him!”</p><br/><p>Longze Jing Tian pointed at Lu Ye who’s soaking in cold water.</p><br/><p>“Is there a way to make him more comfortable?”</p><br/><p>“Answering wangye, this medicine is too strong. The only remedy is woman.”</p><br/><p>“Idiot!”</p><br/><p>Longze Jing Tian kicked down the stool. Now he finally came to understood the meaning of Murong Qi Qi’s words. Murong Xin Lian actually used such villainous ways to seduce him. If the one who had drank the ‘clearing heat’ soup today was him, then she would have surely succeeded.</p><br/><p>Just thinking that from the first moment he saw Murong Xin Lian, he had already entered her calculations, all her gentleness and goodness was a disguise, Longze Jing Tian felt that this woman was too disgusting.</p><br/><p>Presumably the matter of Zheng Min was because she wanted to calculate Murong Qi Qi but in the end, she ended up with an egg on her face. Then after thinking about how Murong Xin Lian used such low ways to deal with Murong Qi Qi, Longze Jing Tian felt fire in his heart which he had no place to vent.</p><br/><p>1. Er: term of endearment</p><br/><p>2. I, used by the empress dowager</p><br/><p>3. Wangfu: residence of a wangye</p><br/><p>4. Cefei/ ce wangfei: second ranked wife of a wangye</p><br/><p>5. Wang/ wangye: prince of the first rank</p><br/><p>6. Xiangfu: residence of the prime minister</p><br/>\n</div>"}