{"title": "Chapter 49 Bet on your lives", "id": 49, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-49-bet-on-your-lives", "volume_title": "Volume 1", "body": "<h1>Chapter 49 Bet on your lives</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 49 Bet on your lives</p><br/><p>“Who said Qing Qing is a rubbish? Qing Qing has more capabilities than any of them! What does Qing Qing want to compete in? They don’t believe in you; I believe in you. I bet a hundred thousand golden taels that Qing Qing will win!”</p><br/><p>One hundred thousand golden taels! The people around couldn’t help but exclaim! They heard that the Gold thread dress on Murong Qi Qi is worth ten thousand golden teals. This Nan Lin wang1 is really too generous!</p><br/><p>Now everyone is looking at Murong Qi Qi from the top to the bottom. They wanted to see some clues on her body. No matter how they look, she’s just an ordinary beauty; pure and cute. She doesn’t have the fox beauty. How was she able to make Nan Lin wang become crazy about her? Not only did he come forward for her, but also gave her backing? Really don’t understand, ah… ….</p><br/><p>“Wangye, talking about money will hurt feelings. It’s a bit vulgar, how can this be worthy of wangye’s status!”</p><br/><p>Just as everybody was sighing, Murong Qi Qi spoke softly: “Besides, you protecting me like this, I’m afraid that you have scarred the two big sisters. How would they dare to show off in front of you? This seems a bit unfair to the two princesses…….”</p><br/><p>Unfair? Feng Cang smiled. It seems that little wangfei2 has found some fun.</p><br/><p>“Qing Qing, what do you want then?”</p><br/><p>The little person in his embrace had a faint fragrance on her body, making him a bit obsessed with it. Forget it, let her play. Anyway, if something goes wrong, he’ll clean-up for her……</p><br/><p>“Just take it as a girls’ game. It has nothing to do with others!”</p><br/><p>Murong Qi Qi stood up and went to the middle of the hall. She looked at Longze Yu Er and Ming Yue Xin smilingly. Her face is as smooth as jade. There simply isn’t a trace of those tears anymore.</p><br/><p>“Just us three playing for a moment, how does that sound? Don’t take out the identity of a princess and also don’t put emperor or wangye out to scare others. We bet between us, how about that?”</p><br/><p>How could Longze Yu Er stand being provoked by a rubbish? She immediately stood out and walked to Murong Qi Qi.</p><br/><p>“Alright, bengong3 takes this bet!”</p><br/><p>At the other side, Ming Yue Xin also came over. She was not afraid! Besides, she needs to get that position of Nan Lin wangfei!</p><br/><p>“Alright, what do we bet?”</p><br/><p>“Why don’t we bet what we have? For example, bengong’s crown, bengong’s position of wangfei or… … …your lives!”</p><br/><p>The lethality of the last phrase ‘your lives’ coming out of Murong Qi Qi soft voice was diminished a lot. In Longze Yu Er’s and Ming Yue Xin’s ears, it sounded like a joke.</p><br/><p>“Betting lives? What a big tone! Can you afford to bet?”</p><br/><p>The mockery on Ming Yue Xin’s face was very evident. A rubbish daring to just bluster things out. What kind of ability does she has? Besides, just now, Murong Qi Qi didn’t let Feng Cang help. Putting aside her backing, she’s just a useless thing… …</p><br/><p>Ming Yue Xin’s words let Longze Yu Er pinch a sweat. But after seeing that Feng Cang’s just sitting there, without any intention of helping Murong Qi Qi, Longze Yu Er put her heart at ease. It seemed that Feng Cang really doesn’t plan on reaching out a helping hand. That’s why her courage also gradually became bigger.</p><br/><p>“That’s right, ah. Can you afford to bet it?”</p><br/><p>“Hehe… …”</p><br/><p>Seeing that the matter was developing according to her expectations, Murong Qi Qi smiled.</p><br/><p>“Since the two big sisters aren’t at ease, we can write down an agreement! Today, there are representatives of all three countries, we can ask them to be the judge, isn’t that right?”</p><br/><p>“Setting an agreement of the bet? This is not bad!”</p><br/><p>Longze Yu Er was very happy. Just now, she had been worried that Murong Qi Qi would put Feng Can out to protect her. She (LYE) didn’t expect that she (MQQ) would make such a request. Didn’t this fit her(LYE) own purpose?</p><br/><p>Anyway, if Murong Qi Qi loses, even if they want her life, Feng Cang will not violate the bet agreement. After all, offending two countries because of a woman is not a worthwhile thing!</p><br/><p>“Emperor, since it’s like this, why don’t we invite Nan Lin wang, Nan Feng’s crown prince and Jing wang to be the judges!”</p><br/><p>High on the platform, Murong Xue Lian’s jade hand moved back and forth on the back of Longze Yu’s hand. No matter what, today’s matter has nothing to do with her. No matter what the outcome is, she will be happy. So this imperial noble consort would gladly push the boat with the current.</p><br/><p>Push the boat with the current: take advantage of the situation for one’s own benefit.</p><br/><p>“Alright!”</p><br/><p>Longze Yu nodded. At least, if something happened like this, Feng Cang couldn’t hold anyone accountable for it.</p><br/><p>“It’s just what do you want to bet on?”</p><br/><p>“Emperor, why don’t you come up with the subject?!”</p><br/><p>Murong Qi Qi threw this question to Longze Yu.</p><br/><p>“This… …”</p><br/><p>Longze Yu narrowed his eyes in deep thoughts.</p><br/><p>Murong Qi Qi’s performance just now made Longze Yu very dissatisfied. She’s just a bestowed princess; does she really think she’s something?! She didn’t even marry and already forgot that she’s Xi Qi’s citizen. She almost stabbed him in the back and also ignored him when he sent her signals with his eyes. He must let her suffer to make her know how much she weighs!</p><br/><p>Weighs here means what kind of position/importance she has.</p><br/><p>Longze Yu looked at Ming Yue Xin and Longze Yu Er. Ming Yue Xin is famous for her paintings in Nan Feng. Although his daughter is somewhat mischievous, but she wouldn’t lose to Murong Qi Qi in this. Thinking till here, Longze Yu cleared his throat: “This year, the chrysanthemums in the imperial garden has just opened. Why don’t you compete on painting! The subject is chrysanthemum, along with a poem!”</p><br/><p>“Good!”</p><br/><p>Ming Yue Xin was the first one to agree. In this respect, she’s an expert. She didn’t believe that Murong Qi Qi could win over her. Ming Yue Xin looked provocatively at Murong Qi Qi once as if she was saying ‘you’re dead!’.</p><br/><p>Towards Ming Yue Xin’s provocative eyes, Murong Qi Qi only laughed: “Since we already have the subject, we can now talk about the bet!”</p><br/><p>“I want the position of Nan Lin wangfei!”</p><br/><p>Not waiting for Murong Qi Qi to finish, Longze Yu Er rushed to say it out loud.</p><br/><p>“If you lose the position of Nan Lin wangfei is bengong’s!”</p><br/><p>“Yu Er!”</p><br/><p>Hearing her daughter’s words, empress Duanmu Qing was shocked. She never expected that Longze Yu Er’s heart would move for Feng Cang. Although that man is very beautiful, but he isn’t a good person, ah!</p><br/><p>Even Longze Yu frowned. Before, the one who cried and refused to be Nan Lin wangfei was her. Now, the one who is fighting to be it is also her. This daughter, ah. In the end, she had been spoiled by him……Longze Yu helplessly shook his head.</p><br/><p>“What about you?”</p><br/><p>Murong Qi Qi looked at Ming Yue Xin.</p><br/><p>“Bengong wants your life!”</p><br/><p>Ming Yue Xin revealed a ruthless smile. She won’t be as mindless as Longze Yu Er. If there’s a possibility that Feng Cang really has an interest for Murong Qi Qi, and would not letting her become Nan Lin wangfei, then he can let her become cefei4. That’s why she wants her life! As long as Murong Qi Qi is dead, with her talent, beauty and her noble identity, Ming Yue Xin didn’t believe that Feng Cang wouldn’t be tempted!</p><br/><p>“Good… …if you win, I will surely let your wishes come true.”</p><br/><p>Murong Qi Qi smiled like a dream and a fantasy.</p><br/><p>“As for bengong, usually what bengong likes the most is collecting beautiful things. The two princesses’ hands are very beautiful. If you lose, troubling you to leave your pair of hands here… …”</p><br/><p>Leave a pair of hands? The moment Longze Yu Er thought about the image of her hands being chopped off, she couldn’t help but shudder. She wanted to back off, but when she met Murong Qi Qi’s eyes, she could see the sarcasm at the bottom of her eyes. Longze Yu Er gritted her teeth and took the bet.</p><br/><p>“Good! No problem! Now we only have to see if you have the ability!”</p><br/><p>“Bengong also doesn’t have a problem with it!”</p><br/><p>Ming Yue Xin was full of confidence. Confronting Murong Qi Qi, she only needs a small finger. She has nothing to worry about.</p><br/><p>Wang/ wangye: prince of the first rank ↩</p><br/><p>Wangfei: wife of a wangye ↩</p><br/><p>Bengong: I, used by a female of the imperial family ↩</p><br/><p>Cefei/ ce wangfei: second ranked wife of a wangye</p><br/>\n</div>"}