{"title": "Chapter 44 Infatuated princess’s regret", "id": 44, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-44-infatuated-princess%E2%80%99s-regret", "volume_title": "Volume 1", "body": "<h1>Chapter 44 Infatuated princess’s regret</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 44 Infatuated princess’s regret</p><br/><p>It could be seen that this devilish beauty was also arrogant……</p><br/><p>Murong Qi Qi lowered her head and smiled. Long before Feng Cang opened his mouth, her ears were covered by his big hands as if he feared his voice would hurt her. It seemed that he didn’t find out everything about her. That’s very good.</p><br/><p>“Ahem… …,” Longze Yu coughed twice, embarrassed. The whole scene became chaotic because of Feng Cang. Those eunuchs and maids knew they did wrong. All of them were kneeling on the ground, trembling in fear.</p><br/><p>“Retreat, retreat!”</p><br/><p>Longze Yu didn’t punish them. Although these people made him lose face, but what difference was there between him and those people? Wasn’t he also attracted by his face? Really lost face at his own home!</p><br/><p>Only then did the people notice the girl standing next to Feng Cang. For a time, no one recognized Murong Qi Qi. Even Murong Tai didn’t recognize his own daughter. Instead, he was wondering who this girl was. Could it be that Feng Cang wanted to break the engagement? And wanted to marry this beauty?</p><br/><p>Seeing that she had become the focus of many, Murong Qi Qi was about to greet the emperor and empress who were sitting on the top seat but was pulled up by Feng Cang, who didn’t let her kneel. Why should his people bow and bend the knee for others? He will not allow it!</p><br/><p>“Qing Qing, our seat is here!”</p><br/><p>Feng Cang gently held Murong Qi Qi’s hand and led her to their specified seat. His gestures were so gifted and noble, making those women’s eyes almost fall out from envy. All of them were speculating as to who this girl was. What did she have to be able to accompany such a man?</p><br/><p>However, the one who first recognized Murong Qi Qi was Murong Xue Lian. After all, she’s a country’s imperial noble consort. Although Feng Cang was indeed attractive, she knew that the only man she could rely on was this man next to her. That’s why she collected her heart back quickly and observed the girl next to Feng Cang. That appearance was somewhat similar to the Murong Qi Qi from her memories, but Murong Xue Lian wasn’t very sure.</p><br/><p>“Third little sister……,” Murong Xue Lian decided to test the waters.</p><br/><p>“Greetings to eldest sister!”</p><br/><p>Murong Qi Qi smiled and raised her head. She finally saw her big sister of the same mother and father. But when she saw Murong Xue Lian, she was somewhat surprised.</p><br/><p>Murong Xue Lian’s features are lovely. She has an oval face, petal-like eyebrows, almond eyes, cherry lips; she’s born with a seductive appearance which seems to emit from her bones. But as her sister of the same mother and father, why are her own looks so different from Murong Xue Lian?</p><br/><p>On Murong Xue Lian’s body, you could still see Murong Tai’s shadow. Even the other people in xiangfu1 looked like Murong Tai, but on her own body, it’s something that cannot be found. Could it be that she resembles Li Qui Shui?</p><br/><p>It’s just that Li Qui Shui had entered the temple after she was born. Seeing her just once seems harder than seeing the emperor… …a small question mark appeared in Murong Qi Qi’s heart.</p><br/><p>“You are Murong Qi Qi?”</p><br/><p>Now it’s Longze Yu Er’s turn to be surprised. Her eyes were full of disbelief. When she saw Murong Qi Qi’s dress, Longze Yu Er’s eyes slowly turned from surprise to hatred.</p><br/><p>Longze Yu Er’s shout attracted the attention of several people to Murong Qi Qi. After looking at her from head to toe, everyone sighed. Really people rely on clothes, Buddha demands gold adornments.</p><br/><p>People rely on clothes: clothes make the people</p><br/><p>Buddha demand gold adornments????: I don’t know what this means. I think it means that even Buddha demands gold to be seen as Buddha.</p><br/><p>Earlier on, the matter of Longze Yu Er fighting with Feng Cang over the ‘Gold thread dress’ had been spread throughout the whole capital. All the people present knew about the matter. Now seeing the dress on Murong Qi Qi, the women exclaimed. The originally ordinary Murong Qi Qi had been made like an angel by this dress. Who didn’t want such an outcome?!</p><br/><p>“Is that the ‘Gold thread dress’?”</p><br/><p>“How beautiful!”</p><br/><p>“My god! When I go back, I need to make a trip to Jue Se Fang!”</p><br/><p>“Lord, you need to buy for me!”</p><br/><p>Various types of voices reached Murong Qi Qi’s ears. Her heart has long been so happy that it bloomed like a flower. It seems that giving that ‘Gold thread dress’ to Feng Cang was a good idea. After today’s advertisement, Jue Se Fang’s business will probably have a good start in Xi Qi. By that time, countless gold and silver will go into her pocket.</p><br/><p>And when the eyes of those women moved from Murong Qi Qi’s body to the crown on her head, Murong Qi Qi felt envy, jealousy and hatred coming from them. Even the empress Duanmu Qing was attracted by that gorgeous crown. She couldn’t help but ask: “Is this the new work of Guang Hua gongzi2……”</p><br/><p>Murong Qi Qi glanced once at Feng Cang. Only when he nodded did she answer Duanmu Qing: “Answering empress niangniang3, ‘Autumn flower’ is Tong Bao Zhai’s treasure at Bei Zhou and has been bought for me by wangye4.”</p><br/><p>While talking, a faint red appeared on Murong Qi Qi’s cheeks. When looking at it, people thought she was shy and also made people feel surprised at the level of Feng Cang’s care towards Murong Qi Qi.</p><br/><p>However, Murong Qi Qi’s words also aroused all the women’s dislike for Longze Yu Er even more. If it wasn’t because of her, would Guang Hua gongzi have migrated Tong Bao Zhai to Bei Zhou? In the future, if they wanted to buy those fine jewelries, it would be so much trouble. They would have to get it from Bei Zhou. This was the ‘good thing’ that this insensible princess did!</p><br/><p>Sensing the hostility from the women, Longze Yu Er’s gaze fiercely swept once over the crowd, forcing those people to lower their heads. But when her gaze met Murong Qi Qi’s, Longze Yu Er clearly saw the ridicule in Murong Qi Qi’s eyes and also the provocation.</p><br/><p>That’s right. It’s provocation! Murong Qi Qi’s black and white eyes was entirely full of provocation!</p><br/><p>Longze Yu Er clutched her sleeves. Her teeth rattled. That’s right, she regretted it! If she had known sooner that Feng Cang was such a figure, no matter what, she wouldn’t have listened to the rumors and missed this marriage.</p><br/><p>At this moment, Longze Yu Er had long forgotten the words Duanmu Qing usually told her. Also Bai Mu Fei, Bai Fu’s eldest daughter-in-law, all of this, she threw them to the back of her mind. In her eyes, there’s only Feng Cang and also ‘Gold thread dress’ and that dazzling ‘Autumn flower’.</p><br/><p>All of these should have been mine! No matter if it’s the handsome Feng Cang, or other things, they should have been hers! Why are they now that rubbish’s?! This is not fair!</p><br/><p>Longze Yu Er’s head was filled with such thoughts. From her point of view, all of this was Murong Qi Qi’s fault. It’s she who stole everything that belonged to her. Feng Cang’s gentleness, his smile, all of this should have belonged to her, Longze Yu Er. But now they were occupied by Murong Qi Qi, she occupied her territory!</p><br/><p>Longze Yu Er’s dark expression and her eyes full of hatred, Murong Qi Qi was very familiar with them.</p><br/><p>It seemed that today wouldn’t pass in ease! But it also seemed that it’s been a long time since she had encountered such a fun thing. Besides, she lived cowardly for so long. It’s time to counterattack. Some people still owe her a debt. Before leaving Xi Qi, she must let them repay her back. Thinking till here, Murong Qi Qi revealed a tempting smile.</p><br/><p>The smile on Murong Qi Qi’s mouth was directly defined as ‘sarcasm’ by Longze Yu Er, making the last string of sensibleness in her head snap.</p><br/><p>No, what belonged to her, she must win it back! Why should she let Murong Qi Qi have it?! She is nobler than Murong Qi Qi. She is more beautiful than Murong Qi Qi. No matter where, she is stronger than Murong Qi Qi. Why should she surrender her belongings to Murong Qi Qi?!</p><br/><p>1. Xiangfu: residence of a prime minster </p><br/><p>2. Gongzi: young master/ also used to refer a famous man </p><br/><p>3. Niangniang: used to call the female’s of the imperial family by people of lower rank </p><br/><p>4. Wangye/ wang: prince of the first rank</p><br/>\n</div>"}