{"title": "Chapter 50 Borrow your blood for a moment", "id": 50, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-50-borrow-your-blood-for-a-moment", "volume_title": "Volume 1", "body": "<h1>Chapter 50 Borrow your blood for a moment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 50 Borrow your blood for a moment</p><br/><p>Immediately, a paper was brought up where the bet had been written in black ink on white paper. The three read it over once. Since there weren’t any questions, they put down their fingerprints.</p><br/><p>“To the imperial garden!”</p><br/><p>Because of the bet of the three princesses, it became crowded inside the imperial garden. Aside from those high level officials and their wives who were in the Hall of Supreme Harmony, the aristocratic and officials’ families who were waiting outside also came over. Everyone wanted to see this competition.</p><br/><p>Seeing Murong Qi Qi once again, Li Yun Qing and Shangguan Wu Ji were shocked. Normally, she was dressed very plainly; now that she had dressed up, she didn’t lose to others. When they saw Feng Cang next to Murong Qi Qi, they were even more surprised. So Nan Lin wang1 turned out to be such a beautiful person!</p><br/><p>Feng Cang’s appearance once again caused a small sensation. All those bad rumors about him was crushed by that devilishly beautiful face of his. In particular, the hearts of those misses were greatly moved. When they saw Murong Qi Qi’s clothes and crown, they all became envious.</p><br/><p>“Heavens! Is she Murong Qi Qi?”</p><br/><p>Duanmu Yi Yi prodded Murong Qing Lian and found that the other party had lost her mind on Feng Cang’s beauty.</p><br/><p>Duanmu Yi Yi had already seen Feng Cang. He is indeed a stunning man, but Duanmu Yi Yi felt such a devilishly beautiful man is too unreal. In comparison, she prefers Longze Jing Tian more.</p><br/><p>Duanmu Yi Yi already knew that Ming Yue Xin had come to form a marriage alliance. Now, Ming Yue Xin is competing with Murong Qi Qi. Although Duanmu Yi Yi doesn’t like Murong Qi Qi, but she still hopes that Murong Qi Qi will win. After all, if Murong Qi Qi wins, Ming Yue Xin will lose face. In Duanmu Yi Yi’s eyes, that is a happy thing.</p><br/><p>Murong Qing Lian’s eyes never left Feng Cang since the moment he appeared. Heavens, since the moment she was born until now, she actually didn’t know that in this world, there’s such a man. He really is the favorite of the heaven and earth… …</p><br/><p>After the bet agreement was made public, the content caused an uproar. It’s known in the capital that Murong Qi Qi is a rubbish. Even if she had recently made two songs, but it still can’t change her identity as a rubbish. On the surface, this didn’t seem to be a bet in favor of Murong Qi Qi!</p><br/><p>“Big brother, what do you think?”</p><br/><p>At Bai Yi Yue’s side stood Bai Mu Fei. The brother is handsome, the sister fresh and pure. They looked very outstanding in the crowd.</p><br/><p>“Ah……”</p><br/><p>Bai Mu Fei smiled, this third miss Murong had brought them too many miracles. Presumably, today there will also be a miracle!</p><br/><p>“I bet that princess Zhao Yang will win!”</p><br/><p>Bai Mu Fei was so sure, Bai Yi Yue also smiled: “I think the same as big brother!”</p><br/><p>But this was only the Bai sibling thoughts. In most people’s eyes, Murong Qi Qi will definitely lose. No! She is dead! After she loses, Ming Yue Xin will take her life. So losing is dying. Dying is also losing.</p><br/><p>The platform where the painting competition would take place was built in a moment. Three people, three places where they would not disturb each other. The time is one incense stick. Incense has been lit. Paint of good quality was brought out for the three people by palace servants.</p><br/><p>When they reached Murong Qi Qi, just as the palace maid was about to hand over the paint, she had a slip of hand. The porcelain box fell on the ground, breaking into pieces. The paint inside scattered all over the ground. With a gust of wind, those powdered colors flew away.</p><br/><p>“Aiya, how can you be so careless?!”</p><br/><p>Longze Yu Er’s voice, which sounded like she’s rejoicing from other’s misfortune, sounded at the back of Murong Qi Qi.</p><br/><p>“What do we do now? Without paint, how can you paint, ah?”</p><br/><p>“Asking princess for forgiveness! This slave didn’t do it on purpose! This slave didn’t do it on purpose!”</p><br/><p>Although the palace maid knelt down in front of Murong Qi Qi and her mouth kept saying ‘asking princess for forgiveness’, but the tone of her voice didn’t show any guilt. It seemed that it had some happiness and the feeling of success in it. It seemed that this palace maid definitely did it on purpose and she must’ve been ordered by someone.</p><br/><p>Such a person, she would definitely calculate with her in a moment. Murong Qi Qi rolled the paper open. She leisurely started grinding.</p><br/><p>“First, continue kneeling……”</p><br/><p>Originally, she thought that without paint, Murong Qi Qi would surely become frantic or directly admit defeat, but all this time, she was calm as if nothing had affected her mood. Instead, it let people admire this princess Zhao Yang’s tolerance.</p><br/><p>The wind was blowing slowly. The incense had already burned down to half.</p><br/><p>Ming Yue Xin and Longze Yu Er have long began to paint, only Murong Qi Qi was still grinding. She seemed like she wasn’t worried, making the onlookers couldn’t help but pinch a cold sweat for her!</p><br/><p>At this time, Longze Jing Tian couldn’t sit still anymore. What’s the matter with Murong Qi Qi? Just now, she had the look that she would win; so why is she indifferent now? Could it be that she gave up? Or is it that she really didn’t want to be Nan Lin wangfei2? If it’s like that, then after she loses and Ming Yue Xin is making trouble for her, he must come forward to protect her!</p><br/><p>Compared to Longze Jing Tian, Ming Yue Cheng’s expression seemed more at ease, but in his heart, he was really worried. He didn’t know what Murong Qi Qi wanted to do. Although he’s very willing to believe that Murong Qi Qi would win, but towards this imperial little sister Ming Yue Xin’s capabilities, Ming Yue Cheng is more or less clear about. If in the end, Murong Qi Qi really lost, what method should he use to protect her?</p><br/><p>The only person who didn’t change was Feng Cang. This wangye seemed assured of success. His expression was calm as always. He sipped tea with an expression that showed he was not worried. And his calm demeanor looked more tempting, making Murong Qing Lian blush.</p><br/><p>Why did Murong Qi Qi this rubbish had to meet such a man? If she had known it’ll be like this, then she should’ve taken the initiative and pleaded. Even if it’s chongxi3!</p><br/><p>“You, get up!”</p><br/><p>Finally, just when everyone almost lost their patience with waiting, Murong Qi Qi commanded with her fingers at the palace maid who had just broken the porcelain box to let her come over.</p><br/><p>Seeing Murong Qi Qi’s innocent looking face, the palace maid glanced at the person high up. That person nodded at her. Only then did the palace maid slowly stand up and walked to Murong Qi Qi.</p><br/><p>“Princess, what matter do you have by looking for this slave?”</p><br/><p>“You destroyed bengong’s4 paint, of course you need to lend some color to help bengong finish this painting!”</p><br/><p>“This slave didn’t do it on purpose. Princess, what do you want this slave to do?”</p><br/><p>Although she’s claiming that she didn’t do it on purpose, but on the palace maid’s face, there’s written ‘deliberately did it’.</p><br/><p>And the eyes of the palace maid betrayed her inner thoughts. The one she looked at was precisely the empress who got pregnant because of Murong Qi Qi’s help… …Duanmu Qing.</p><br/><p>“That’s easy. Come here!”</p><br/><p>When the other party moved her head over, Murong Qi Qi grabbed the palace maid’s hair. She poured all the ink in palace maid’s mouth.</p><br/><p>Not waiting for people to understand the situation, Murong Qi Qi slapped the palace maid twice on her face.</p><br/><p>“Pu… …”</p><br/><p>The palace maid felt pain. She opened her mouth. The black ink sprayed like rain on the paper.</p><br/><p>“Thanks!”</p><br/><p>Murong Qi Qi’s voice just fell, in her hand there’s suddenly a shiny dagger. The palace maid didn’t have time to struggle. On her white neck, there’s a trace of blood. The next moment, blood gushed out.</p><br/><p>“Ah!”</p><br/><p>The palace maid felt pain. She struggled while screaming. But unfortunately, her hair was held by Murong Qi Qi. She couldn’t break out. Looking once more, Murong Qi Qi’s right hand has a brush now. She mixed the blood with the ink and began to paint quickly on the paper.</p><br/><p>TL Note: I don’t understand why they just don’t go get another set of paint. It’s almost impossible for the palace to only have three boxes of paint. </p><br/><p>Wanng/ wangye: prince of the first rank ↩</p><br/><p>Wangfei: main wife of a wangye ↩</p><br/><p>Chongxi: Chongxi: arrange a wedding for a very ill young man with the hope that the ’event of great joy’ will drive away his bad luck and hasten his recovery, what does it matter?! To be able to be with such a man, even if in the next moment she’d die, she’ll still be happy ↩</p><br/><p>Bengong: I, used by the females of the imperial family</p><br/>\n</div>"}