{"title": "Chapter 59 Cohabiting before marriage (1)", "id": 59, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-59-cohabiting-before-marriage-1", "volume_title": "Volume 1", "body": "<h1>Chapter 59 Cohabiting before marriage (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 59 Cohabiting before marriage (1)</p><br/><p>The supposed to be very lively Chongyang palace feast, because of the death of one princess and the miscarriages of three imperial females became very strange. Smell of blood entered the people’s noses. The wind also became biting. The whole scene was very quiet. So quiet that it became somewhat scary.</p><br/><p>“Wangye1 I’m tired.”</p><br/><p>Just then, Murong Qi Qi softly spoke: “Let’s go back…….”</p><br/><p>“Alright!”</p><br/><p>Feng Cang saw from Murong Qi Qi’s face that she is tired. He held her hand and said goodbye to Shangguan Fei Yan.</p><br/><p>“Please return, Nan Lin wang. When princess Zhao Yang marry, aijia2 will definitely personally send her off!”</p><br/><p>Shangguan Fei Yan waved her hand somewhat tired.</p><br/><p>A royal scandal was seen by a wangye of another country. No matter how you see it, her face can’t be held up. Letting them go back is better, lest to let them find out the truth. If these people know that royals are killing each other, then Bei Zhou country will laugh till they lost their teeth.</p><br/><p>Out of the palace, Murong Qi Qi became a lot more relaxed. Even breathing became more easy.</p><br/><p>“Miss!”</p><br/><p>Seeing that Murong Qi Qi came out, Su Yue and Su Mei immediately went forward and greeted.</p><br/><p>“Let’s go!”</p><br/><p>Murong Qi Qi went on the carriage. She didn’t expect that Feng Cang will follow her.</p><br/><p>“Qing Qing, why don’t you come and live at with me?”</p><br/><p>“Does wangye want to cohabit before marriage?”</p><br/><p>Murong Qi Qi removed a hairpin. Hair fell like loose like waterfall.</p><br/><p>Really tired! Although this ‘Autumn Flower’ is really beautiful, but those gold are really too heavy. If she had known that this crown will be on her head, she would’ve designed it more light weighted.</p><br/><p>“Cohabiting before marriage? This sentence is not bad!”</p><br/><p>Feng Cang came nearer, lifted some hair and sniffed it.</p><br/><p>“I don’t have a problem. Don’t know what Qing Qing think of it?”</p><br/><p>“Not good!”</p><br/><p>Murong Qi Qi withdraw her hair from his hand and sat on the other side.</p><br/><p>“Wangye, I want to go back to xiangfu3. Today was so busy. I’m tired. After the marriage, wangye can see me every day. Now, asking wangye to leave. After all men and women have differences. Etiquettes are indispensable!”</p><br/><p>Murong Qi Qi’s words were so upright, making it that Feng Cang can only laugh bitterly. Originally he thought that after what happened at the palace, little wangfei4 will accept him. He didn’t expect, ah……that there also will be a day when he is rejected. He is actually being ‘driven’ out of the carriage by Murong Qi Qi.</p><br/><p>Looking at Murong Qi Qi’s carriage slowly fading away, Feng Cang heard a chuckle around him. It’s Ru Yi. His face was red, but he didn’t dare to laugh out loudly.</p><br/><p>“Laugh, don’t suffocate to death…….”</p><br/><p>“Hahahaha!”</p><br/><p>Not waiting for Feng Cang to finish speaking, Ru Yi hunched down with his hands on his belly. He laughed out loud. Even tears came out.</p><br/><p>“Wangye……. hahaha……wangfei is really too cute……hahaha……if those misses in Bei Zhou gets to know this……. hahaha……. wangye, your fame, ah…….”</p><br/><p>“Are you very happy that your wangye has been rejected?”</p><br/><p>Seeing the tears in Ru Yi’s eyes, Feng Cang smiled while shaking his head.</p><br/><p>Remembering Murong Qi Qi’s smile like flower and her faint sense of alienation, Feng Cang said: “I’d like to let my fame go into ashes, just to get the beauty to smile……”</p><br/><p>Back at Cui Zhu yuan5, Murong Qi Qi let the people retreat and only let Su Yue and Su Mei stay.</p><br/><p>Murong Qi Qi didn’t speak. She just quietly stared at the tea leaves rotating in the cup. So silent, that it made Su Yue and Su Mei terrified. Probably they followed ‘humane’ Murong Qi Qi for too long and has forgotten her identity and also forgotten her methods.</p><br/><p>It was quiet for about the time to make tea, Murong Qi Qi gently put down the cup of tea.</p><br/><p>“Su Mei, Su Yue, you go back to Moyu and exchange Wu Qing and Tie Xue to come serve me……”</p><br/><p>Hearing this, the two alarmed. They immediately knelt down in front of Murong Qi Qi.</p><br/><p>“Miss, subordinates know our fault! Miss don’t drive us away!”</p><br/><p>“What, you don’t even listen to my words anymore?”</p><br/><p>Murong Qi Qi’s voice is very gentle. Her gaze floated over the two.</p><br/><p>“Or is it that you think I’m not as great as godfather. That’s why I can’t order you?”</p><br/><p>“Miss, subordinates know our wrong. Subordinates must devote to our duty and stopped Nan Lin wang. Subordinates are wrong!”</p><br/><p>Su Mei and Su Yue kept kowtowing. The two know very well what they did wrong today. They are the most personal people of Murong Qi Qi. Today they just let Feng Cang in. Fortunately, Feng Cang didn’t have any bad intention towards Murong Qi Qi. If he wanted to harm Murong Qi Qi, in an unsuspecting circumstance even if Murong Qi Qi is an expert in martial arts, she will suffer first before she can react.</p><br/><p>The two heads made ‘dangdang’ sounds on the floor, but Murong Qi Qi didn’t relent.</p><br/><p>Presumably it has to do with her experience from the previous life. Even here, when Murong Qi Qi is asleep, she is sixty percent asleep and forty percent awake. Only until when she got Su Mei and Su Yue, the two were very loyal, she gradually loosened and was able to sleep peacefully.</p><br/><p>It’s just that this time, the two let Feng Cang in. It seemed that she needs to restore to her previous state.</p><br/><p>It was rare to believe in people again. She has placed her life in the two’s hands. But can people’s heart really be trusted? In the previous life, the person she trusted so much have given her a fatal blow. The pain of the bullet penetrating her heart, she still can feel it…….</p><br/><p>Seeing Murong Qi Qi’s eyes became misty, Su Mei and Su Yue felt heartache.</p><br/><p>That year when sir Mozun brought Murong Qi Qi to Moyu, she was like this. She is clearly in sight, but will let people feel out of reach. As if when they touch her, she will disappear.</p><br/><p>“Miss, give subordinates one opportunity to correct! Please give subordinates one more opportunity!”</p><br/><p>Gradually, the two’s forehead skin became torn. Blood began to came out. How can they forget that as personal guards, they are Murong Qi Qi’s eyes and ears and her last line of defense, ah?! Their master is only Murong Qi Qi, ah!</p><br/><p>“Miss, please give us one more chance! The last chance! We will definitely not disappoint miss again!”</p><br/><p>Today, the trust they cultivated so hard at Murong Qi Qi’s disappeared. This is what they protected for so long, ah! Because of an oversight, they lost miss’s trust!</p><br/><p>Another time to make tea passed. Murong Qi Qi stood up and throw a porcelain bottle at Su Mei and Su Yue.</p><br/><p>“Only on time, the last chance!”</p><br/><p>“Yes! Thanks miss! Thanks miss!”</p><br/><p>Being able to say at Murong Qi Qi’s side, Su Mei and Su Yue almost shouted in happiness. The two quickly got up and respectfully stood behind Murong Qi Qi.</p><br/><p>“First apply the medicine. It’ll be bad if you are disfigured. It’s better for females to be beautiful!”</p><br/><p>“Yes! Yes!”</p><br/><p>Su Mei and Su Yue rubbed the medicine. Murong Qi Qi looked at the happy appearance of these two people who followed her and smiled.</p><br/><p>Since life is a gamble, then let her gamble one more time! And be stubborn for one more time. Believe people’s heart one more time! If she is wrong, then she only has to pay with one life. It’s just that the next time, she doesn’t know if there will be a chance to be reborn again……</p><br/><p>At night, news came from the palace. The truth has been found out. The culprit behind everything is Murong Xin Lian. She played and directed a miscarriage drama and got one stone hitting three birds. Not only did she let empress and imperial noble consort lost their child, she also killed princess Ping Yang.</p><br/><p>“Miss, did second miss really do it? How come subordinate feel that there more inside all of this?”</p><br/><p>The forehead of Su Yue became less swollen after applying medicine. Although there’s still some clotted blood, but Murong Qi Qi’s medicine, with only two or three days, it’ll become turn back to how it was before.</p><br/><p>“She?”</p><br/><p>Murong Qi Qu laughed.</p><br/><p>“She is nothing but a pitiful scapegoat……”</p><br/><p>“Then who is the culprit behind of this?”</p><br/><p>Su Mei frowned.</p><br/><p>“Although miss provoked the fight between princess and second miss, but the other things were out of our reach, ah!”</p><br/><p>“Ah……who is the biggest beneficiary? The one who laughed last is the real culprit!”</p><br/><p>A dark mist crossed Murong Qi Qi’s eyes. She looked in the direction of Jing wangfu6.</p><br/><p>TLNote: remember in the previous chapter when DQ was surprised that the maid had been murdered? I think she didn’t gave MXL any abortion medicine. It’s all done by Jing wang. But it isn’t specified in the book, so let your imaginations run wild.</p><br/><p>Inside the dungeon, Murong Xin Lian slapped the cell door with a pale face,</p><br/><p>“Let me out! I’m Jing wang cefei7! Let me out! I’m innocent!”</p><br/><p>“What are you screaming about? Do you not want to let people sleep?”</p><br/><p>The head prison guard came over. He raised a whip and whipped a few times.</p><br/><p>“If you don’t stay still, I’ll kill you!”</p><br/><p>Having eating pain, Murong Xin Lian became well-behaved. She didn’t cause a ruckus anymore and grabbed the head prison guard’s trouser. Trembling she handed him the gold bracelet from her wrist.</p><br/><p>“Please help me. Please go to Jing wangfu. Jing wang will definitely come to rescue me! I’m beg you!”</p><br/><p>Weighing the gold bracelet in his hands, the head prison guard smiled and revealed a mouth full of yellow teeth. His eyes swept back and forth over Murong Xin Lian’s body.</p><br/><p>“And these, all of these I can give you!”</p><br/><p>Seeing this person’s greed, Murong Xin Lian quickly took down all the jewelry from her body and gave them to the head prison guard.</p><br/><p>“If I can go out, I’ll definitely repay your kindness! I beg you, help me find Jing wang. I’m his beloved consort. He will definitely help righten the injustice!”</p><br/><p>“This is not bad!”</p><br/><p>The head prison guard put away the treasures and went back to Murong Xin Lian. He opened the door. The head prison guard walked to Murong Xin Lian while revealing a mouth of yellow teeth.</p><br/><p>“Beauty, want me to help you get out, alright! But you should let me and my brothers feel happiness first!”</p><br/><p>“What do you want to do?!”</p><br/><p>Only now did Murong Xin Lian saw the desire in his eyes. She took a few steps back. But because of her body being weak, only a few steps and she had been caught.</p><br/><p>“Let me go! I’m Jing wang cefei! Bastard! Let me go! Your gall is big!”</p><br/><p>Murong Xin Lian struggled, but unfortunately during the day all her energy has been depleted. Now her body doesn’t even have the slightest strength. She is no match for the strong head prison guard. After just a moment, she had been stripped clean.</p><br/><p>“Zeze! In the end you really are a wangye’s woman. The skin is soft, ah!”</p><br/><p>The head prison guard stared at Murong Xin Lian. His saliva almost dripped out. A white flower like nephrite simulated his senses. Not waiting any longer, in just a moment, he stripped himself clean.</p><br/><p>“I beg you, don’t! I just had a miscarriage, I won’t be able to……”</p><br/><p>Murong Xin Lian cried. She shoved the head prison guard who is coming at her. But her strength is too small. Her fist hit the head prison guard, but they felt like raindrops on the ground. It didn’t have any effect.</p><br/><p>“Beauty, just let me be! I will love you very well……”</p><br/><p>“Ah! Beast……wuwuwu……get away……”</p><br/><p>Outside the cell, a candle flickered. The shadow on the wall moved very hard. Murong Xin Lian’s mouth has been covered by the head prison guard’s hand. Desperate tears rolled down her cheeks and landed on the straw. Everything was crystal clear with unlimited resentment……and humiliation.</p><br/><p>The time seemed particularly slow. So slow that it felt like a lifetime.</p><br/><p>After the head prison guard put on his pants and stood up contentedly, Murong Xin Lian’s didn’t have any more tears to shed.</p><br/><p>“The taste is not bad! Next time, I still want……”</p><br/><p>The head prison guard didn’t finish yet, when his body went to the ground. On his back, there’s a shiny dagger. And behind him, stood a masked person in black.</p><br/><p>“Can you still move?”</p><br/><p>“Who, who are you?”</p><br/><p>The sudden appearance of the person in black scared Murong Xin Lian. Can it be that he came to silence her? Can it be that she will die being so weak? She is unwilling, ah! Obviously she is the victim, ah!</p><br/><p>The person in black threw a set of clothes at Murong Xin Lian.</p><br/><p>“The palace told everyone that you did everything. You are now an abandoned person. If you don’t go now, you’ll become a vengeful spirit. You can choose to follow me or you can choose to wait and die here.”</p><br/><p>Long before, Murong Xin Lian already guessed this outcome, but she still held on the illusion. At least she got pregnant for Longze Jing Tian and also had a miscarriage for him. He at least will care about their old love. She didn’t expect……</p><br/><p>“I, I’ll go with you!”</p><br/><p>Enduring the pain on her body, Murong Xin Lian gritted her teeth and stood up. She covered her body in the black clothes.</p><br/><p>“Go!”</p><br/><p>The person in black seemed very familiar with the surroundings. Murong Xin Lian carefully followed behind him until the palace was far behind them.</p><br/><p>“Benefactor, thank you!”</p><br/><p>Reaching a safe place, Murong Xin Lian couldn’t bear it any longer and limply fall to the ground. She breathed quickly. The pain from her body stimulating her. If it wasn’t because she had to survive, she simply won’t be able to endure for so long.</p><br/><p>‘Pa!’</p><br/><p>The person in black threw a black bag towards Murong Xin Lian.</p><br/><p>“Flee! Flee to somewhere nobody knows you. Begin a new life!”</p><br/><p>Opening the bag, inside are full of gold leaves. Murong Xin Lian immediately kowtowed three times to the person in black.</p><br/><p>“Benefactor, today you saved me. I, Murong Xin Lian’s life is yours. In the future if benefactor has any need, just order. Even if it’s going through fire and water, I will do I without hesitation!”</p><br/><p>“You are someone who knows gratitude……”</p><br/><p>The person in black laughed. He went forward and helped Murong Xin Lian up.</p><br/><p>“No matter if in the future you are living in riches or living humbly, you only have to do one thing. Don’t let Murong Qi Qi live well. Then it’s a repayment to me!”</p><br/><p>“Murong Qi Qi?”</p><br/><p>Hearing this familiar name and thinking back to the today’s series of tragedies; everything happened from the moment she brought in Fei Cui. Only after that did she end up so miserably. Murong Xin Lian gritted her teeth and nodded fiercely.</p><br/><p>“Benefactor, be assured. Murong Qi Qi is also my enemy. As long as I have one breath, I will be her enemy and let her not be able to live well for her whole life. If there’s me, there won’t be her. If there’s her, there won’t be me!”</p><br/><p>“Then I can be assured! Go quickly. If you go later, then it’ll be too late!”</p><br/><p>Murong Xin Lian said her goodbyes to the person in black. With pain, she walked slowly. She walked two step and turned back. The person in black already disappeared.</p><br/><p>Who is that person in black? Why does he have so much hostility towards Murong Qi Qi?</p><br/><p>Murong Xin Lian doesn’t know this. She also doesn’t want to figure it out. The only thing she is certain about is that she needs to go to Bei Zhou country. Not for anything else, just because Murong Qi Qi will go there. Because Murong Qi Qi is the woman who ruined her life!</p><br/><p>She wants revenge! Take revenge! For her mother, for her son, for her loss of the position of wangfei, for all the humiliation she suffered! She must take revenge! She must let Murong Qi Qi fall into the eighteenth level of hell without any chance to revive again!</p><br/><p>When the news of Murong Xin Lian escaping the prison came out, Murong Qi Qi was lying lazily on the roof. She was enjoying the chrysanthemum cake that Su Mei just made.</p><br/><p>“Oh? Escaped?”</p><br/><p>Murong Qi Qi’s mouth turned into a devilish arc.</p><br/><p>“Miss, should we investigate?”</p><br/><p>Murong Qi Qi’s intuition is telling her that Murong Xin Lian can’t stay alive. Besides, she always does things without giving a chance for the enemy to survive! Cutting the weed without eliminating the roots, the spring wind blows once and it’ll live again! Moreover, it’s Murong Xin Lian. Such a stubborn thing that no matter how you beat it, it won’t die! So, this person must die!</p><br/><p>Cut weed and eliminate the roots: eliminate completely</p><br/><p>“Issue an ‘Order to kill’. No matter who, as long as they take Murong Xin Lian’s head, then he is this year’s ‘Best killer.’</p><br/><p>“Yes!”</p><br/><p>Inside the palace, because of Murong Xin Lian’s matter, Longze Yu was very furious. He immediately approved a decree. The whole country is to chase after Murong Xin Lian. For a time, Murong Xin Lian’s potraits were plastered over whole Xi Qi’s streets. Whole Xi Qi knows of Murong Xin Lian’s ‘stained misdeeds’. Everyone casted this snake-hearted woman away.</p><br/><p>In contrast, Ming Yue Xin this Nan Feng’s princess has been forgotten by people.</p><br/><p>Without her hands, Ming Yue Xin was crying in Xi Qi’s palace. Longze Yu was so busy. He can only get Ming Yue Cheng to appease her. However, it doesn’t seem to have any effect at all. Only in the middle of the night did Ming Yue Cheng return to his own hostage fu8.</p><br/><p>“Who?”</p><br/><p>Just when he opened the door of the study, Ming Yue Cheng felt the strangeness. The next second, two silver light went straight to his eyes!</p><br/><p>‘Hong!’</p><br/><p>Ming Yue Cheng dodged. His hand clamped silver needles, but the other party has a backup move. A silver dagger flew over. It left only a half-inch away from his throat.</p><br/><p>‘Ka……’</p><br/><p>Ming Yue Cheng opened his mouth and bite the dagger. The silver needles in his hand flew out at the same time to the other party’s face. But it didn’t reach the other party yet, the other party waved; the needles went into the sleeves.</p><br/><p>TLNote: This will be the last chapter for quite a while, cause I’ve midterms in two weeks. Also, as you can see the chapters are getting pretty long. The future chapters are also very long. It’s hard to translate two chapters a week. So I will do one chapter one week, two chapters next week; back to back. Of course, I will try to make time for sponsored chapters. Have a nice week end &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;333333333</p><br/><p>Wangye/wang: prince of the first rank ↩</p><br/><p>Aijia: I, used by the empress dowager ↩</p><br/><p>Xiangfu: residence of the prime minister ↩</p><br/><p>Wangfei: main wife of a wangye ↩</p><br/><p>Yuan: part of a residence ↩</p><br/><p>Wangfu: residence of a wangye ↩</p><br/><p>Cefei/ce wangfei: second ranked wife of a wangye ↩</p><br/><p>Fu: residence/ mansion ↩</p><br/>\n</div>"}