{"title": "Chapter 63 Wangfei eloped with a man (1)", "id": 63, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-63-wangfei-eloped-with-a-man-1", "volume_title": "Volume 1", "body": "<h1>Chapter 63 Wangfei eloped with a man (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 63 Wangfei eloped with a man (1)</p><br/><p>The world only knew about Guang Hua gongzi’s1 talent, but no one knew that he is the hear the wind and lose gall Du Xian Er. Also, no one knew that from a shopkeeper to a small servant of Tong Bao Zhao and Jue Se Fang, all were killers from Moyu.</p><br/><p>Hear the wind and lose gall: terror-stricken</p><br/><p>All of these were the prelude.</p><br/><p>When Ming Yue Cheng gets the throne, she gets the ‘special access order’. She will build the ‘world’s best place of business’ in You Yun’s sixteen states. A continental bag of business and earning universal money! She will let the world’s best place of business really become the world’s best. At that time, the people of Moyu can also proudly start a new life!</p><br/><p>At this time, Shangguan Wu Ji, being the messenger to escort princess, was promoted to a general and had the special task of taking care of the basic necessities of Murong Qi Qi and to take care of her safety.</p><br/><p>All the way, unavoidable, Shangguan Wu Ji personally intervened and checked everything.</p><br/><p>Escorting the person in his heart to marrying far away, seeing her becoming someone else’s wife with his own eyes, undoubtedly to Shangguan Wu Ji, it was an extremely cruel thing. Every time he saw Murong Qi Qi’s indifferent expression, Shangguan Wu Ji felt like a knife was stabbing into his heart. Piece by piece, making blood drip.</p><br/><p>A day passed again. The sun went down. The long line of troops stopped and stationed. Shangguan Wu Ji rode a horse and stopped next to Murong Qi Qi’s carriage.</p><br/><p>“Princess, tomorrow we will reach the Stone Gate.”</p><br/><p>Stone Gate is the border between Xi Qi and Bei Zhou. After passing the Stone Gate, they will be in Bei Zhou.</p><br/><p>Although she’s someone who practiced martial arts, but sitting in the carriage for the whole day was somewhat too much for Murong Qi Qi. Her whole body felt like it’s breaking apart. The moment she heard that they would take a break, Murong Qi Qi, with the help of Su Yue and Su Mei, went down the carriage.</p><br/><p>The closer they got to the north, the more flatter and open the terrains became, and it also became more and more desolate. There are no Xi Qi’s mountains. Only a grey vast field could be seen. Plus the fact, that’s already early in the winter. The grass has withered. The whole vast ground is desolate, looking increasingly tragic.</p><br/><p>“Princess, the moment we pass Stone Gate, we will be entering Bei Zhou. If we ride day and night, only need ten days’ time to reach Bei Zhou’s capital Yan Jing.”</p><br/><p>Shangguan Wu Ji dismounted, walked towards Murong Qi Qi and explained the journey of the following day.</p><br/><p>“Ten days, still ten days…….”</p><br/><p>Just the thought of needing to stay in the carriage for ten more days made Murong Qi Qi get a headache. It just so happens that she is a ‘princess’ and can’t ride on a horse. She can only hide in the carriage. The following days will be harder to pass.</p><br/><p>Murong Qi Qi’s expression went into Shangguan Wu Ji’s eyes, but it turned into another meaning.</p><br/><p>Sure enough, she doesn’t want to go to Bei Zhou and doesn’t want to marry Feng Cang! That being the case, why didn’t he take her away with him. The further away they get, the better!</p><br/><p>This night, the moon and the stars were diluted. There was no wind. A quiet full moon hung on the sky. It’s the fifteenth of a month again.</p><br/><p>Feng Cang was already asleep. And his eagle troops were like usual, setting up hundreds of tents which surrounded Feng Cang’s and Murong Qi Qi’s tents like two huge arms which protected them inside.</p><br/><p>Late at night, aside from the night watcher, the others were asleep. Suddenly, a bird shouted twice: “Cuckoo! Cuckoo!”</p><br/><p>Then a gust of wind passed dragging a long arrow and shot over.</p><br/><p>“Assassin!”</p><br/><p>A shout, the eagle troop went to meet the enemy. No panic could be seen. The ones who came were five hundred men. Black clothes, black clothed masks, revealing only their black eyes.</p><br/><p>“Kill!”</p><br/><p>“Protect princess!”</p><br/><p>Shangguan Wu Ji shouted loudly while he rushed to Murong Qi Qi’s tent.</p><br/><p>The attack at night came so sudden. The five hundred people were well-trained people. Their skills were no less than the eagle troop and they seemed to hold the determination to die. So the killers became more ruthless. For a time, the scene was in chaos. Blood and fire filled the air.</p><br/><p>“Princess! Princess!”</p><br/><p>When Shangguan Wu Ji arrived, Murong Qi Qi was already fully dressed and was sitting inside the tent.</p><br/><p>“Come with me!”</p><br/><p>When he saw Murong Qi Qi, he grabbed her hand and pulled her out of the tent. Outside, everything was on fire. Shangguan Wu Ji pulled Murong Qi Qi onto his black horse. A whip hit the horse butt. The horse rushed towards the side with fewer people.</p><br/><p>“Shangguan Wu Ji, where are you taking me to?”</p><br/><p>The wind was whistling in Murong Qi Qi’s ear. Shangguan Wu Ji’s horse’s hooves sounded loudly and ran very fast.</p><br/><p>“Taking you away!”</p><br/><p>Shangguan Wu Ji ripped off his cloak and wrapped Murong Qi Qi in it.</p><br/><p>“Are you crazy?”</p><br/><p>Murong Qi Qi was very surprised.</p><br/><p>“Shangguan Wu Ji, you are defying the decree, you know?!”</p><br/><p>“Can’t bother with it so much! I can’t let you marry him!”</p><br/><p>The news that Shangguan Wu Ji took away Murong Qi Qi, spread to the outside of Feng Cang’s tent in a moment.</p><br/><p>“What happened?”</p><br/><p>Feng Cang was bathing in a bucket full of medicine. The dark syrup emitted an odor. He was pale. Large drops of sweat were on his forehead. He looked very scary. The only thing that didn’t change was that pair of crystal like water eyes.</p><br/><p>“Wangye2, all is right.”</p><br/><p>Jin Mo stood behind Feng Cang. The silver needle in his hand stuck into Feng Cang’s skull.</p><br/><p>“They are just some small things. It won’t take long. Be assured……”</p><br/><p>“Is it?”</p><br/><p>Feng Cang didn’t believe Jin Mo. He heard someone mention Murong Qi Qi.</p><br/><p>“Ru Yi, you say!”</p><br/><p>“This venomous insect is too strong. Wait till I force it out.”</p><br/><p>The silver needles in Jin Mo’s hands rapidly went into Feng Cang’s body. From the back of his head to his back, all have a silver color.</p><br/><p>“Jin Mo, what are you hiding from me?”</p><br/><p>Knowing Jin Mo’s personality, Feng Cang didn’t let those words sway him.</p><br/><p>“Ru Yi, if you don’t say it, then don’t stay at benwang’s3 side anymore.”</p><br/><p>Ru Yi is now in a dilemma. If he doesn’t say, Feng Cang will get angry. According to his (FC) personality, he really wouldn’t be able to serve at wangye’s side anymore. However, today is the fifteenth. It’s a critical moment of wangye’s disease. If he tells Feng Cang that little wangfei4 eloped with Shangguan Wu Ji, wangye will get angry. It’ll be bad if this anger hurts his body.</p><br/><p>Just as Ru Yi was hesitating, Feng Cang pushed Jin Mo away and stood up.</p><br/><p>“Wangye……”</p><br/><p>Seeing Feng Cang acting like this, Jin Mo became nervous and anxious. The treatment being interrupted, how much damage that will cause Feng Cang’s body, he knows it all too well.</p><br/><p>Feng Cang’s vessels bulged like vines wrapped around his arms, covering his whole body. It looked very scary, but the coldness coming out of his body was the scariest of them all.</p><br/><p>“Say! What happened to wangfei?”</p><br/><p>Feng Cang glared at Ru Yi. The coldness in his eyes was overflowing. There wasn’t a trace of human in it. And the pressure released from his body made people unable to bear it.</p><br/><p>‘Pa!’</p><br/><p>Knowing that wangye had become really angry, Ru Yi’s knees went weak and he knelt in front of Feng Cang.</p><br/><p>“Wang, wangfei she……”</p><br/><p>“Why are you mentioning her?! Wangye, I’ll continue…….”</p><br/><p>Jin Mo prevented Ru Yi from speaking. But the next moment, Feng Cang’s big hand unexpectedly locked tightly at his throat, making it difficult for him to breathe.</p><br/><p>“Wangye……”</p><br/><p>“Jin Mo, benwang will say it once again, Murong Qi Qi is benwang’s wangfei. If you don’t respect her, benwang will kill you!”</p><br/><p>The coldness in Feng Cang’s eyes is true. The intention to kill is also true. Jin Mo never expected that after following him for a decade, Feng Cang would do this to him because of this little trifle.</p><br/><p>“Say!”</p><br/><p>Feng Cang’s hand tightened some more. His purple eyes are desolate, icy and even more colder. It’s like an ice-house which is able to freeze people.</p><br/><p>Feng Cang’s eyes turns purple when his disease is acting up. His eyes are normally black. Later in the book, we will find out the reason why. </p><br/><p>How long has it been since he last saw Feng Cang get so angry? Jin Mo’s heart tightened. The pain on his throat spread throughout his body. He knew that if he said one more word, Feng Cang will not be lenient. So, he honestly closed his mouth.</p><br/><p>“Wangye, general Shangguan took wangfei away!”</p><br/><p>Ru Yi closed his eyes, endured the tears and told the truth.</p><br/><p>“Took away……”</p><br/><p>After hearing this, Feng Cang froze for a moment. His heart bolted out of the blue as if he suddenly lost a bone. The strength in his hand weakened and his body fell back.</p><br/><p>‘Boom.’ The medicine water spilled all over the floor.</p><br/><p>“She left?”</p><br/><p>Feng Cang thought that Murong Qi Qi would follow him to Bei Zhou, would marry him and they would have their own children. He didn’t expect that she would go away with Shangguan Wu Ji! Why? Why?</p><br/><p>“Wangye, wangfei went away with Shangguan Wu Ji.”</p><br/><p>Seeing Feng Cang so pale and feeble sitting there, Jin Mo couldn’t bear to see him like this. This wangye’s love got moved, his heart turned chaotic. Finding out that wangfei eloped with another man, his heart must be in pain. He is such a proud person, this time he must be really heartbroken……</p><br/><p>Enduring the pain on his throat, Jin Mo continued to put needles into Feng Cang. Today is the fifteenth. It’s the day Feng Cang’s disease will act up. Jin Mo already cursed Murong Qi Qi a thousand times. This woman is really not letting them be peaceful! Since she has another in her heart, why did she still provoke Feng Cang?! Damn!</p><br/><p>“Wangye, endure. It’ll only take a while.”</p><br/><p>Time seemed to have stopped at this moment. Feng Cang let Jin Mo practice acupuncture on him and pushed back those ugly bruises. His hair hung down, blocking his purple eyes, making people unable to guess what this wangye is thinking. It’s just that even Jin Mo and Ru Yi could detect the disease in Feng Cang was becoming slightly worse. It’s all because of that woman!</p><br/><p>“Done……”</p><br/><p>Finally, Jin Mo let out a long sigh. Fortunately, this time, they passed through it. He was worried that Feng Cang’s impulsiveness would ruin today’s treatment.</p><br/><p>Just as Jin Mo said the word done, Feng Cang spit out a mouthful of black blood.</p><br/><p>“Wangye!”</p><br/><p>Jin Mo was shocked. He had guessed wrong. The position Murong Qi Qi has in Feng Cang’s heart is not normal. Just now, he (FC) forced all the rage into his body. Now the matter has become worse! If it damages the internal organs, it’ll be big trouble!</p><br/><p>Feng Cang opened his eyes. His eyes turned back to black. He wiped the blood from his mouth and stood up.</p><br/><p>“Ru Yi, guide benwang to search for wangfei!”</p><br/><p>“Wangye, you can’t. Your body……”</p><br/><p>‘Peng……’</p><br/><p>With one stroke, Feng Cang swept Jin Mo who had been blocking the way. He strode out of the bucket and draped his body in white clothes. He turned back. The coldness on his body was strong.</p><br/><p>“Jin Mo, if next time you have so many words again, benwang really won’t be polite anymore!”</p><br/><p>“Wangye!”</p><br/><p>This time, Ru Yi was very anxious. Seeing Feng Cang looking like this, if he really goes out to search for Murong Qi Qi now, what should he (RY) do if he (FC) faints? Or if wangfei wanted to elope from the bottom of her heart, then what should wangye do? Would he let them be or kill that pair on the spot?</p><br/><p>Ru Yi couldn’t speculate Feng Cang’s inner thoughts. Seeing him so decisive, nobody could stop him. Ru Yi could only help Feng Cang dress and get the horse for him.</p><br/><p>“Ji Xiang, let the eagle troop kill without leaving any survivors!”</p><br/><p>As he left the tent, he glanced at those stubborn people in black. Feng Cang humphed coldly and quickly mounted the horse. He thought about which way Shangguan Wu Ji went with Murong Qi Qi and chased after them in that direction.</p><br/><p>“That’s demon wang! Kill him!”</p><br/><p>When a white clothed Feng Cang appeared in front of the people in black, someone immediately shouted.</p><br/><p>“Big reward for killing demon wang……”</p><br/><p>This person hadn’t even finished talking when a sharp arrow went straight through his throat. Not far away, Ji Xiang held a bow in her hand. The bow had five arrows. She shot all the black people who rushed towards Feng Cang to death.</p><br/><p>“Overconfident!”</p><br/><p>The eagle troop who got the command, now they also got serious. They only listened to Feng Cang’s command. Since wangye commanded that they need to kill without leaving any survivors, then these five hundred people can only stay here to become fertilizer.</p><br/><p>At this side, Shangguan Wu Ji is rushing with Murong Qi Qi.</p><br/><p>Shangguan Wu Ji had studied the escape route many times. If they go back to Xi Qi, before long they will be found. Only the most dangerous place is also the safest place. Surely Feng Cang wouldn’t expect that they will go to Bei Zhou, so they need to go to Bei Zhou first to stay out of trouble and then go to Dong Lu.</p><br/><p>“Shangguan Wu Ji, put me down!”</p><br/><p>Shangguan Wu Ji suddenly making such a scene, made Murong Qi Qi completely became senseless. He wants to flee with her from the marriage? Take her wandering around the world? Did he ever ask about her thoughts?!</p><br/><p>“Put me down!”</p><br/><p>Murong Qi Qi struggled hard. Shangguan Wu Ji was worried that she will fall from the horse, so he could only stop.</p><br/><p>Not waiting for the horse to stop, Murong Qi Qi got off, scaring Shangguan Wu Ji so much that he also jumped off. He wanted to see if Murong Qi Qi was hurt, but she evaded him.</p><br/><p>“Take me back!”</p><br/><p>The moment Murong Qi Qi opened her mouth, it was those words.</p><br/><p>“No!”</p><br/><p>Shangguan Wu Ji shook his head.</p><br/><p>Sending her back into that pit of fire? Let her marry demon wang and then die on the wedding night? He couldn’t do this, no matter what! And he can’t see her disappear from this earth with his own eyes! When he asked a decree to escort Murong Qi Qi, Shangguan Wu Ji already had the thought of taking her away. Now is the right opportunity!</p><br/><p>“Do you know what you are doing?”</p><br/><p>Facing such a handsome and stubborn man, Murong Qi Qi was completely speechless. Does he think he is a knight who rescued a princess from a monster’s hands? Does he know what’s at stake here?</p><br/><p>Hearing the anger in Murong Qi Qi’s voice, Shangguan Wu Ji took a few steps forward and took Murong Qi Qi into his embrace.</p><br/><p>“Qi Qi, come with me! I’ll take you away!”</p><br/><p>Shangguan Wu Ji’s heart jumped strong and powerful. In this quiet night, you can hear it particularly clear.</p><br/><p>Go away? It’s much easier said than done. Has this man thought about it? If the princess to form a marriage alliance disappeared, the emperor of Bei Zhou will be angry; if war is started, then many lives will be lost. The ones who will be suffering are the commoners. They will have to bear the name of causing disaster!</p><br/><p>“Wu Ji, I know you care about me and worry about me, but I can’t go away with you!”</p><br/><p>Murong Qi Qi shook her head and broke away from Shangguan Wu Ji’s embrace.</p><br/><p>To her, a soul in a different world, she can settle everywhere. But now she has the title of princess Zhao Yang, she must continue to walk on this road.</p><br/><p>She cannot, because of her own happiness and freedom, let others sink into unhappiness. Besides, behind her she still has more than a thousand lives from Moyu. She has promised them to use clear means to let them have the right to stand under the sun. How can she leave them alone……?</p><br/><p>“You are a child from great family Shangguan. You can’t betray your blood! You can’t let the people fall into water and fire because of your selfishness! You also can’t let Shangguan family’s ancestors be in shame just because of the braveness of a moment! Besides, the empress dowager is still there. How can you let empress dowager broke her heart?!”</p><br/><p>“And I also can’t go with you. I have my responsibilities and obligations. I also have people I want to protect. I can’t give them up because of my selfishness.”</p><br/><p>Can’t betray the godfather who gave her a new life. Can’t betray the people from Moyu who accompanied her for five years.</p><br/><p>Murong Qi Qi’s words engraved in Shangguan Wu Ji’s heart. She has people she wants to protect? But doesn’t she know that the only one he wants to protect is only her, Murong Qi Qi?!</p><br/><p>Under the moonlight, Murong Qi Qi’s decisive face made Shangguan Wu Ji feel heartache. If he had spoken first and asked the empress dowager to grant marriage, then would there still be these twists and turns? And she also wouldn’t have to bear all of this.</p><br/><p>“Wangye, how come you came?”</p><br/><p>Murong Qi Qi looked behind Shangguan Wu Ji and exclaimed.</p><br/><p>Hearing that Feng Cang came and he didn’t even notice, Shangguan Wu Ji was very shocked. He turned but there was no one, he only felt pain at his neck. With a sound, Shangguan Wu Ji fell onto the ground.</p><br/><p>“Miss, subordinates came late!”</p><br/><p>Su Mei and Su Yue appeared in front of Murong Qi Qi and knelt down.</p><br/><p>“Bring general Shangguan back.”</p><br/><p>“Yes!”</p><br/><p>Su Mei and Su Yue strapped Shangguan Wu Ji onto the horse and left. Murong Qi Qi also mounted a horse and slowly went back.</p><br/><p>At this time, Murong Qi Qi is thinking how to explain what happened today to Feng Cang. General escaped with the princess, Feng Cang must already know this. What will he think? Will he hold Shangguan Wu Ji responsible? Will he magnify the blame and because of this, deal with Xi Qi?</p><br/><p>Although in Murong Qi Qi’s opinion, the matter of the country has nothing to do with her, but Shangguan Wu Ji is her friend. He had repeatedly extended a hand to help her, she can’t let something happens to him. Although what Shangguan Wu Ji did was reckless but the starting point is because of her.</p><br/><p>Murong Qi Qi was lost in thoughts. She didn’t even sense Feng Cang coming closer. When she looked up, Feng Cang already reined the horse. He was only five meters away from her.</p><br/><p>“Wangye……”</p><br/>\n</div>"}