{"title": "Chapter 89 Despicable Dong Lu people (1)", "id": 89, "volume": 1, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-89-despicable-dong-lu-people-1", "volume_title": "Volume 1", "body": "<h1>Chapter 89 Despicable Dong Lu people (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 89 Despicable Dong Lu people (1)</p><br/><p>“It’s princess who let me do it!”</p><br/><p>At this time, Yong er1 knelt.</p><br/><p>“Princess said to not let people participate in the tournament, so she let this slave use Croton powder! It’s princess who let this slave do it!”</p><br/><p>“Yong er!”</p><br/><p>Wanyan Bao Zhu never expected that Yong er would betray her so quickly.</p><br/><p>“Yong er, bengong2 doesn’t treat you badly, so why do you frame bengong? If bengong let you do it, why would bengong have to bear with such pain?!”</p><br/><p>Because she ate the breakfast this morning, Wanyan Bao Zhu also got diarrhea. Now, her face was terribly pale.</p><br/><p>“Servants, detain princess and the palace maid. Ji Xiang, let someone specially look after them. After the tournament is finished, benwang3 will re-trial this matter!”</p><br/><p>Feng Cang didn’t want to bother with this matter right now. Instead, he let Ji Xiang detain Wanyan Bao Zhu and Yong er separately. Now, he was most concerned about the health of the contestants. The tournament was imminent. The knockout competition would begin tomorrow. It would be very troublesome if the contestants couldn’t participate.</p><br/><p>“Wangye4, I’m afraid they can’t participate in the tournament anymore!”</p><br/><p>Jin Mo shook his head. He prescribed a medicine and let people go get the ingredients.</p><br/><p>“The drug is too heavy. Tomorrow, they won’t have any strength and there’s no way they can participate in the tournament.”</p><br/><p>This time, it’s big trouble. From all the contestants, only Wanyan Kang was fine. What should they do?!</p><br/><p>At Meixiang yuan5, Feng Cang stood among the red plum flowers. With a lowered head, he thought about the knockout competition.</p><br/><p>Feng Cang intended to take a few of his people along to participate in the knockout competition. Although this might expose a part of his power, but this was the only way out. If it was a normal tournament, then he wouldn’t have minded the outcome of the competition. However, this was related to his future happiness. Let it all be exposed! After all, he had tolerated for so long. It’s time to expose!</p><br/><p>At this moment, Murong Qi Qi stepped onto the snow and moved towards Feng Cang. Out of habit, she nestled in his arms.</p><br/><p>“Wangye, let me participate in the tournament!”</p><br/><p>“Qing Qing?”</p><br/><p>Feng Cang was somewhat surprised at Murong Qi Qi’s request. But aside from the surprise, he somewhat understood Murong Qi Qi’s idea.</p><br/><p>“Qing Qing, the tournament of the four countries is not a usual game. Hand this matter over to me. Don’t worry, I will certainly get the first place of the tournament for you!”</p><br/><p>“Wangye!”</p><br/><p>Murong Qi Qi held Feng Cang’s hand and looked at him seriously.</p><br/><p>“Wangye, I sincerely want to participate in the tournament of the four countries! It’s not for getting glory for the country. This has nothing to do with honor. I just want to personally win my happiness!”</p><br/><p>It took only a moment, before Su Mei and Su Yue knew that Murong Qi Qi wanted to participate in the tournament. Seeing that their miss wanted to participate, these two also wanted to participate, but they were stopped by Murong Qi Qi.</p><br/><p>“Well, quietly wait for the results. Could it be that you doubt my ability?”</p><br/><p>“Miss, subordinates don’t dare. It’s just that it has always been where miss goes, that’s where we’ll follow. This time, the tournament of the four countries is no joke. Subordinates are willing to follow at miss’s side. Even if it’s one more person, one more face without having to do anything is also alright!”</p><br/><p>Usually, Su Yue was calm and collected. What she usually said at key moments, would make people feel it’s right. However, Murong Qi Qi had already made her decision and would not tolerate Su Mei and Su Yue’s pleas.</p><br/><p>“I already told wangye, if I win, he must give me the Wind Chase Cliff as a dowry. Wangye agreed!”</p><br/><p>“Miss……”</p><br/><p>Su Mei suddenly realized that this was the case, that Miss wanted to participate in the tournament for the Wind Chase Cliff.</p><br/><p>“It’s fine, you don’t need to worry. Nothing will happen to me!”</p><br/><p>“No!”</p><br/><p>Although Murong Qi Qi said it like that and her ability was also not ordinary, but this time, Su Yue gritted her teeth and adhered to her thought.</p><br/><p>“Miss, Su Mei has quick reaction. If you want to go, you must take Su Mei with you. This subordinate will stay outside as backup. If miss doesn’t take Su Mei with you, then Su Yue doesn’t agree! Presumably, the brothers of Moyu will also disagree!”</p><br/><p>Having Su Yue’s words, Su Mei also insisted. In the end, Murong Qi Qi had no choice but to nod and take Su Mei with her.</p><br/><p>Although Feng Cang agreed on Murong Qi Qi participating, but he was also very worried. Only Murong Qi Qi and Wanyan Kang were not enough. After thinking about it, he also let Ruyi go.</p><br/><p>A day before the knockout competition, the contestants of Bei Zhou were finally set……. Murong Qi Qi, Su Mei, Wanyan Kang and Ruyi. This team was formed at the last moment. Really don’t know what would happen.</p><br/><p>“Cousin brother, I know. Must certainly protect imperial sister-in-law’s safety; don’t let her lose even a strand of hair! I already know! You’ve said it a hundred of times already!”</p><br/><p>The next day, on the way to the tournament, when Feng Cang was about to open his mouth, Wanyan Kang immediately expressed all that Feng Cang wished to say.</p><br/><p>“My good cousin brother, she’s your wangfei6, but I’m your little cousin brother, ah! Why don’t you care a bit more about me, this little cousin brother, ah?!”</p><br/><p>“Your life is lucky!”</p><br/><p>One sentence from Feng Cang blocked Wanyan Kang deadly.</p><br/><p>“Ruyi, did you see?! He hasn’t even married her yet and he’s already pampering her like this. In the future, if cousin-in-law enters the fu7, then wouldn’t she be the biggest in wangfu8?”</p><br/><p>Wanyan Kang put on a helpless expression. He shrugged his shoulders. His voice was exaggerated. His expression was even more exaggerated.</p><br/><p>“What, is fifth highness feeling uncomfortable?”</p><br/><p>Inside the carriage, Murong Qi Qi heard Wanyan Kang’s voice. She opened the curtain, revealing a lively small face.</p><br/><p>“Wangye, fifth highness is not young anymore and needs to get married. It’s time to find someone to control him!”</p><br/><p>The moment Murong Qi Qi said that, Feng Cang immediately pretended to ponder over it.</p><br/><p>“Qing Qing is right. When we go back, I’ll go look for uncle……”</p><br/><p>“Don’t, don’t! I was wrong! I was wrong, alright?!”</p><br/><p>Wanyan Kang immediately put on a bitter look.</p><br/><p>“Cousin-in-law, just now, it’s this little brother’s head which went into water and became confused! This little brother was wrong! This time, this little brother will closely follow behind cousin-in-law and protect cousin-in-law’s safety without taking a single step away! As for the marriage, let’s dismiss it. I haven’t played enough yet!”</p><br/><p>Since the time he had been scammed by Murong Qi Qi in the palace, Wanyan Kang knew that this cousin-in-law was someone who could con people without blinking an eye. In any case, if she whispers in Feng Cang’s ears and let him go ask Wanyan Lie to get a princess consort for him, then his free life would be gone! He didn’t want to marry so early. He didn’t want any women!</p><br/><p>“Puchi……”</p><br/><p>Hearing Wanyan Kang say that coupled with his current expression, Su Mei laughed out loud, attracting Wanyan Kang’s gaze.</p><br/><p>Wanyan Kang also had seen Su Mei before. However, she’s Murong Qi Qi’s maid. So, Wanyan Kang didn’t carefully take note of her. Now looking at her, he discovered that this little girl was very lively and cute.</p><br/><p>“What are you laughing at?’</p><br/><p>Wanyan Kang let the horse go to Su Mei’s side.</p><br/><p>“Could it be what I said was not right?!”</p><br/><p>“Humph!”</p><br/><p>Su Mei humphed lightly. She raised her chin.</p><br/><p>“Our family’s miss naturally has me to protect her. Fifth highness, if you don’t meddle too much and provoke trouble, then we can thank the gods! How can we expect you to help?!”</p><br/><p>The pride in Su Mei’s eyes made Wanyan Kang surprised for a moment. This girl was interesting. Obviously, she’s a maid, but she’s so bold and dared to speak to him like that. She’s more fun than those people from the palace.</p><br/><p>“You, this little girl, how come you’re so eloquent?! Could it be that if the master is like this, the slave is also like this?”</p><br/><p>“Of course, my family’s miss is the best. Although, I’m not even a tenth of miss, but compared to fifth highness, I’m more than enough.”</p><br/><p>Su Mei wasn’t modest. Every word she said, was a praise of Murong Qi Qi, making Wanyan Kang even more curious. Before, Murong Qi Qi beating Guli already made him very shocked. Now, whenever Su Mei mentioned Murong Qi Qi, she’s so proud. What more did this pair of master and servant not shown yet?</p><br/><p>Although in his heart, he was thinking that, but his mouth was saying otherwise: “Tsk! Don’t talk big! In the end, who is more powerful, we’ll see at the knockout competition!</p><br/><p>“Compete, then compete! Who is afraid of who?!”</p><br/><p>Wanyan Kang’s provocation directly stimulated Su Mei’s desire to win.</p><br/><p>“When a certain someone loses, don’t come crying with snot in your nose! Otherwise, the dignified fifth prince will lose face till your grandmother’s home!”</p><br/><p>“You!”</p><br/><p>Wanyan Kang pointed at Su Mei. He ‘you-ed’ for a long time without saying any following words.</p><br/><p>He’s a prince. Who, when seeing him, was not respectful and licked his butt? This only happened when he encountered Murong Qi Qi and her servant. He can accept the master bullying him. After all, next to Murong Qi Qi, there’s the big mountain Feng Cang. He couldn’t afford to offend that mountain. However, why was Murong Qi Qi’s people also ‘bullying’ him like this? Moreover, why was it, whenever he was bullied, he was still very happy? Could it be that he had the tendency to like being abused?</p><br/><p>Seeing Wanyan Kang was no longer talking, Su Mei smiled proudly. Because of the cold weather, that pretty face was rosy. It looked more attractive. Coupled with that pair of shiny eyes, it made Wanyan Kang lose his soul.</p><br/><p>“What are you looking at? Have you never seen a beauty?!”</p><br/><p>Su Mei glared at him after seeing Wanyan Kang stare at her, making her look more beautiful.</p><br/><p>“I’ve seen beauties, but I’ve never seen such a small pepper like you!”</p><br/><p>Even Wanyan Kang didn’t notice that the sound of his voice had changed a bit. However, just because he didn’t notice, doesn’t mean that the others didn’t hear the change.</p><br/><p>“Small pepper. Su Mei, this name matches you quite well!”</p><br/><p>Murong Qi Qi had been looking at the two. They’ve been bickering the whole way. How come she felt that the way Wanyan Kang looked at Su Mie was quite not right? Could it be that she’s too sensitive?</p><br/><p>“Su Mei? Su Mei……because of laziness, painting the eyebrow (mei). Good name. Good name!”</p><br/><p>Hearing Wanyan Kang say that, Su Mei was so angry her face turned red. Why was it that whenever he said her name, it felt so weird? How come this man was such a smooth talker and at the first look, he looked like a player prince?! A young master who only knows to dally around?! It seems that she needs to give him a little lesson!</p><br/><p>Thinking till here, Su Mei silently came to Wanyan Kang’s back. With a whip, she whipped Wanyan Kang’s horse’s butt. The war horse became frightened. It spread its hooves and rushed forward.</p><br/><p>“Aiya, small pepper, you want to murder, ah?!”</p><br/><p>Wanyan Kang grabbed the reins tightly. Although he was shouting exaggeratedly, but the actions of his hands were not bad. In just a moment, he controlled the manic horse.</p><br/><p>“Next time, if you want to murder, please say it in advance. I’ll clean my neck for you to cut it, ah!”</p><br/><p>“Pei!”</p><br/><p>Su Mei’s face turned red.</p><br/><p>“Lecher! Ignoring you!”</p><br/><p>Su Mei let the horse come next to the carriage. She talked with Murong Qi Qi in a low voice and didn’t bother anymore with Wanyan Kang.</p><br/><p>Seeing that little girl’s beautiful face and rosy cheeks, Wanyan Kang shook his head while smiling. In the end, she’s just a little girl and couldn’t stand provocation well. Interesting! Very interesting!</p><br/><p>Wanyan Kang didn’t know that unconsciously, on his mouth hung a naughty smile. And this smile, had been put into Murong Qi Qi’s eyes.</p><br/><p>Without Su Mei’s bickering, Wanyan Kang was a lot quieter. He was somewhat not used to this quietness. From time to time, he would look back at Su Mei. However, the other party ignored him, making Wanyan Kang get the feeling that he had lost face for the first time. He was actually looked down upon by a small maid. It seems that he must show his talent at the knockout competition!</p><br/><p>The venue of the knockout competition was at the pagoda that drove away evil spirits, located outside the city. Because the content was decided by Dong Lu, the location of the knockout competition was also selected by Dong Lu.</p><br/><p>This pagoda that drove away evil spirits was in a Buddha temple. The Buddha temple was made in a golden period during the former Qin. Later, because of the war, the temple was destroyed, leaving only a lonely ‘drive away evil spirits’ pagoda, which towered in the clouds.</p><br/><p>At this time, the contestants of the four countries have arrived.</p><br/><p>Bei Zhou had two men and two women. Xi Qi had the same as Bei Zhou. Aside from Long Duo and Helan Lian Yi, Nan Feng had five more people. As for Dong Lu, it had the most people.</p><br/><p>Dong Lu arrived last. Moreover, the contestants stayed at the house of embassy without revealing themselves. This time they came out, making Murong Qi Qi gain knowledge. Fifty people! A total of fifty people!</p><br/><p>“Did cousin-in-law see? Dong Lu likes to use the tactic of a sea of people!”</p><br/><p>Wanyan Kang sneered.</p><br/><p>“Every time, they are so shameless, wanting to tire people to death. Are the people of Dong Lu so cheap?”</p><br/><p>“Puchi…….”</p><br/><p>The moment Su Mei heard that, she laughed. This person really spoke interestingly!</p><br/><p>“Mei er, why are you laughing? Don’t be afraid of them! Rest assured, when I take action in a moment, I’ll immediately take all of them down!”</p><br/><p>Seeing Su Mei laugh like a flower, Wanyan Kang couldn’t help himself from teasing her.</p><br/><p>“Humph! Don’t need! It’ll be fine if I only follow our miss! Also, you’re not allowed to call me Mei er. Did you hear?!”</p><br/><p>Su Mei glared at Wanyan Kang once and stood behind Murong Qi Qi. Her mouth revealed a smile, completely not putting Wanyan Kang in her eyes.</p><br/><p>“Heihei!”</p><br/><p>Being looked down upon, Wanyan Kang still laughed, making Su Mei feel that this fifth prince’s mind was not so good.</p><br/><p>“Wangye, since the knockout competition is decided by Dong Lu, will they play favoritism?”</p><br/><p>After Murong Qi Qi looked at Dong Lu’s disposition of forces and then looked at the pagoda that drove away evil, she had some questions. Dong Lu had this many people. If they wanted to cheat, then wouldn’t the other countries lose the decisive opportunity?</p><br/><p>“Princess Zhao Yang, please be assured. I can personally guarantee that the thing you worry about, won’t happen.”</p><br/><p>Not waiting for Feng Cang to answer, a man’s voice, full of confidence, reached over. A man in blue walked over from not far away.</p><br/><p>This man was wearing blue and liked blue like Jin Mo. However, Jin Mo’s blue was the color of the sky and the blue on this man, was deep like the sea. On the blue clothes was waves embroidered with silver threads. There were also somersaulting koi. It looked very alive.</p><br/><p>Murong Qi Qi raised her head and looked at the man. Long eyebrows, long and narrow phoenix eyes, tightly closed thin lips. He wasn’t such a devilish beauty like Feng Cang and also didn’t have Feng Cang’s cold proudness. Instead, he looked easy going with a warm smile. He looked someone you can get close to.</p><br/><p>“I’m Jia Lan, the person who made the content of the knockout competition. The content of the knockout competition today is this pagoda that drives evil spirits away. Buddha has a seven level pagoda; humans have seven emotions and six desires. Each level of this pagoda has a different test. The ones who safely arrive at the top of the tower will be the finalists for the tournament.”</p><br/><p>The seven emotions of human: joy, anger, anxiety, thought, grief, fear and fright.</p><br/><p>“No way!”</p><br/><p>Immediately, there was someone who shouted.</p><br/><p>“Seven level, is it then not seven rounds of test? Then, this knockout competition will be competing through seven games, ah?! In case no one passes, then what?”</p><br/><p>“No one passing?”</p><br/><p>Jia Lan smiled. His smile was like a blooming Epiphyllum oxypetalum.</p><br/><p>Epiphyllum oxypetalum</p><br/><p>“No one passed, then there’s no winner. Everyone loses.”</p><br/><p>“How could it be like that?!”</p><br/><p>Hearing Jia Lan say that, everyone began to talk about it. Form outside the pagoda, there’s no way to see inside it. Really made people curious about what kind of competition it was.</p><br/><p>“No matter what method is used; no matter if you beat a friend or foe, as long as you can reach the top, then you’re the winner!”</p><br/><p>Jia Lan’s voice was full of temptation. His ‘no matter if you beat a friend or foe’ made Murong Qi Qi frown.</p><br/><p>“Hearing your words, do you mean for us to massacre one another?”</p><br/><p>“Oh……”</p><br/><p>Seeing that Murong Qi Qi quickly seized the meaning behind his words, Jia Lan couldn’t help but have a deeper understanding of this little woman.</p><br/><p>“Princess, you can’t always do as you like. Every secret is inside the pagoda and since princess is a contestant, why don’t you go inside and give it a try?!”</p><br/><p>“Don’t need you to say that. Naturally, I’ll go!”</p><br/><p>At this point, Murong Qi Qi had an inexplicable feeling towards this pagoda where the knockout competition was being held. This pagoda was emitting a dangerous aura. What was inside there? Aside from this Jia Lan, no one knew. Also, his words of just now, obviously had the feeling of wanting to watch a play. Could it be that he would also watch the contestants of Dong Lu go die?</p><br/><p>“After entering the pagoda, the door will be locked. You can only wait till someone passes the seven levels test and appear at the top, before the door will be opened.”</p><br/><p>While saying this, Jia Lan maintained a gentle smile on his face. The smile was like a spring breeze in May. Warm, making people get lost in that smile and almost forget the chill in his words.</p><br/><p>What did this person mean with those words? Longze Jing Tian frowned. If no one passed, then didn’t it mean that the door of this pagoda wouldn’t be opened? Then wouldn’t everyone be trapped inside and be starved to death? Is that what Jia Lan meant?</p><br/><p>“Those who have regrets, there’s still a chance to quit.”</p><br/><p>Seeing that there’s some hesitation, Jia Lan continued to smile.</p><br/><p>“If there’s no one who will quit, then please enter!”</p><br/>\n</div>"}