{"title": "Chapter 109 Proposing (1)", "id": 109, "volume": 2, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-109-proposing-1", "volume_title": "Volume 2", "body": "<h1>Chapter 109 Proposing (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 109 Proposing (1)</p><br/><p>“I agreed?” Murong Qi Qi raised an eyebrow. “Which one of your ears heard me say to let you enter wangfu’s1 door? Hmm?”</p><br/><p>“We didn’t hear! Miss didn’t say that!” Su Mei and Su Yue quickly and cooperatively shook their heads.</p><br/><p>“Crown princess, princess, did you hear?” Murong Qi Qi looked at Yu Shi Shi and Wanyan Bao Zhu. Although these two really wanted to help Mu Yu Die, but from beginning to end, Murong Qi Qi didn’t nod nor agree. The two could only shake their heads.</p><br/><p>At this point, Mu Yu Die’s face turned green. What did she mean? Could it be that the words she’d just said didn’t mean that she was willing to share a husband? The meaning was so obvious, how come Murong Qi Qi was now going back on her words?</p><br/><p>“What do you mean?” Mu Yu Die blurted out.</p><br/><p>Seeing Mu Yu Die acting so eager, Murong Qi Qi chuckled, “Miss Mu doesn’t understand what I mean? Our family’s wangye2 will have me as his only woman. It would be like this before the wedding and it would be like this after the wedding. As for miss Mu’s wishful thinking, listen well and let the meaning get in your head. If I had to agree to every woman who are eager to paste themselves on my family’s wangye, then even this capital wouldn’t be able to fit them all!”</p><br/><p>“You…,” Mu Yu Die never expected that Murong Qi Qi would say such things so straightforwardly, so…ugly to hear. This was simply humiliating her, humiliating her feelings for Feng Cang!</p><br/><p>“Princess, it’s not only you who loves wangye! You should at least respect my true feelings for wangye!”</p><br/><p>After hearing those words, Murong Qi Qi acted like she’d heard the biggest joke. Slowly, step by step, she walked towards Mu Yu Die. Looking at the firmness in her eyes on her pale face, Murong Qi Qi sighed.</p><br/><p>“Helplessly, the falling flower is yearning for love, but the heartless brook ripples on. Even if the love miss Mu has for our family’s wangye is higher than the mountains and deeper than the seas, what does it matter? Feng Cang’s heart only has me. It so happens that I am someone possessive and has possessed his full heart. Even a strand of your hair wouldn’t be able to enter. You should be more conscious and let go! Don’t be at such an age and still thinking so wishfully!”</p><br/><p>The falling flower is yearning for love, but the heartless brook ripples on: one side is willing, yet the other one remains indifferent</p><br/><p>Murong Qi Qi’s poisonous tongue made Yu Shi Shi and Wanyan Bao Zhu startle. She’d completely disregarded Mu Yu Die’s face and ‘humiliated’ her on the street like this. Could it be that Murong Qi Qi wasn’t afraid of offending the prime minister? Besides, how could there be such a woman who repeatedly said that she’d not let Feng Cang take concubines? Was this woman a jealous wife? Would Feng Cang agree with such an unreasonable request?</p><br/><p>Sure enough, Mu Yu Die got angry. The thing she cared about the most was when people talked about her age. Now, Murong Qi Qi keeps saying ‘at such an age’. She was clearly bullying her.</p><br/><p>“Princess, you went overboard! You take decisions according to your wishes like that, wangye may not agree!”</p><br/><p>“Ha…,” Murong Qi Qi sneered and casted a glance at Mu Yu Die’s black face. Her mouth went up a beautiful curve. “Wangye said inside Nan Lin wangfu, I’m the boss! My decision also means wangye’s decision!”</p><br/><p>That Feng Cang pampered Murong Qi Qi this much was more than Yu Shi Shi and the others had expected. It seemed that the hope to push Mu Yu Die into Nan Lin wangfu would fall!</p><br/><p>Yu Shi Shi couldn’t bear to see Murong Qi Qi’s proud face. If in the past, she didn’t take one step wrong, how would Murong Qi Qi act so domineering like this now? Why did such a good thing fall into Murong Qi Qi’s hands? This Murong Qi Qi didn’t have the appearance nor the body; why did Feng Cang happen to like such a woman? Truly incredible!</p><br/><p>“Wangye is not bigger than the emperor! The emperor hasn’t spoken about this matter, so this matter isn’t certain yet!”</p><br/><p>After being irritated by Murong Qi Qi, Mu Yu Die finally pulled Wanyan Lie out.</p><br/><p>So, it was like that! Murong Qi Qi finally understood. No wonder these three women would group together; no wonder Mu Yu Die dared to be so bold and confident. It seemed that old thing from Mu fu wanted to walk the road of Wanyan Lie. They wanted to use the emperor and get a decree to suppress her? Could it be that she, Murong Qi Qi, was a lamb waiting to be slaughtered?!</p><br/><p>“Then, we can talk about this after the emperor opens his golden mouth.”</p><br/><p>The arrogant face of Murong Qi Qi changed to a calm one. So calm, it was like the deep sea without any trace of waves. She looked at her beautiful fingers and gently touched the pink nails.</p><br/><p>“However, miss Mu should be careful, ah! Two happy occasions at one home, but there are many cases where people didn’t have the blessing to receive such a situation. Even if the emperor sent a decree, you should also have the blessing to receive it…If by chance, the head accidentally fell, then it would be like miss Mu using a wicker basket to draw water! After all, sometimes, old women’s heads would get short circuited and the reaction is not so agile. There are also cases of sudden deaths.”</p><br/><p>Using a wicker basket to draw water: wasted efforts</p><br/><p>Just now, Mu Yu Die was at ‘such an age’. Now, she’d become upgraded to ‘old woman’. No matter how good Mu Yu Die’s temper was, she could hear the sarcasm and threats in Murong Qi Qi’s words. She (MQQ) was too daring!</p><br/><p>“Murong Qi Qi! Are you threatening and intimidating me?! I’m the granddaughter of an official of the first rank; who gave you the gut to treat me like this?”</p><br/><p>“Benwang3 gave it…,” not waiting for Mu Yu Die to finish venting her anger, a cold voice came over. The next moment, Murong Qi Qi fell into a warm embrace. She didn’t need to guess to know it’s Feng Cang.</p><br/><p>Feng Cang’s appearance made the three women take half a step back. After his gaze swept over the three women once, Feng Cang lowered his head and gently kissed Murong Qi Qi’s forehead.</p><br/><p>“Why did you not bring more people when coming out?! What if you’d encountered mad dogs?”</p><br/><p>Feng Cang’s words directly categorized the three women as mad dogs. Su Mei and Su Yue covered their mouths and laughed in secret. Wangye’s poisonous tongue’s skills have become better, ah! The crazy look of Mu Yu Due just now, truly was like a mad dog!</p><br/><p>“Wangye, when encountering a mad dog, naturally one should kill and then strip it to warn the public….”</p><br/><p>Murong Qi Qi’s gaze fell on Mu Yu Die’s face. Her eyes were full of smiles but they let Mu Yu Die feel a coldness. She immediately tightened her cloak.</p><br/><p>“What, is miss Mu dissatisfied with benwang’s wangfei?”4 </p><br/><p>“No, no, no, I’m not.”</p><br/><p>With Feng Cang here, how could Mu Yu Die dare to be rude to Murong Qi Qi? Unless she was blind; otherwise, how could she not see the love in Feng Cang’s eyes for Murong Qi Qi? In her heart, she felt so jealous, but she couldn’t say anything! It seemed that she definitely needed to let grandfather go to the emperor. She also wanted Feng Cang to look at her with so much love in his eyes and be gentle like this towards her!</p><br/><p>After Feng Cang came, Yu Shi Shi’s gaze immediately was full of hidden bitterness. Why did he only show such a gentle side to Murong Qi Qi? Why wouldn’t he take one more look at her? Could it be he hates her for annulling the engagement in the past? It was just, she also didn’t have a choice; she was forced, ah…</p><br/><p>At this time, Yu Shi Shi’s illness of being infatuated acted up again. She was clearly searching for trouble. Seeing Yu Shi Shi like this, Murong Qi Qi wanted to vomit. It seemed that none of these mad and disorderly butterflies were well behaved! It’s time to let them eat some bitterness!</p><br/><p>“Wangye, in fact, they did it for my own good.”</p><br/><p>Murong Qi Qi put her small hand into Feng Cang’s big palm.</p><br/><p>“They were worried that I would have a short life and wouldn’t live pass the wedding night. So, crown princess and princess tried their best to pair miss Mu and you. Just now, the three persuaded me and wanted to let me agree on letting miss Mu and I serve and marry you together! I heard that sir prime minister personally took your and miss Mu’s eight characters to let someone calculate it. The result is that you two were a perfect match…”</p><br/><p>Hearing Murong Qi Qi say that, the three wanted to die on the spot.</p><br/><p>These were only some words that they’d wanted to test Murong Qi Qi privately with. It was a bunch of nonsense. How could they’ve expected that Murong Qi Qi would tell Feng Cang everything?! Didn’t all women, when faced with such a situation, pretend to be generous and take the concubine for their husband? How could there be such a woman like Murong Qi Qi, who wanted to let the world know about this?!</p><br/><p>“It seems that prime minister is already old. It’s time for him to retire and return back to his hometown to enjoy his later years…” Feng Cang narrowed his eyes and looked at Mu Yu Die. His body burst with coldness. “That being the case, benwang will add one more sentence on the memorial to the emperor, lest the emperor forget about this matter and also to avoid prime minister being confused and do something detrimental to the country.”</p><br/><p>When Feng Cang’s words reached Mu Yu Die’s ears, she couldn’t help but shudder. What did Feng Cang mean? Did he want to remove her grandfather from his position? How could this be?! Then won’t her Mu clan’s splendor and wealth come to an end?</p><br/><p>“Wangye, this is not a bad idea! This way, crown prince’s heart can be at ease. Crown princess niangniang5 is really a good helper, ah! The prime minister leaving his post is all niangniang’s credit…”</p><br/><p>Murong Qi Qi’s words let a trace of appreciation flash in Feng Cang’s eyes. This little wangfei knows how to sow dissension! Everyone knew that the prime minister supported second prince Wanyan Yi. If the prime minister retires, the second prince would lose a source of power. The one who would benefit then would be crown prince Wanyan Hong!</p><br/><p>Must say, the result of this trick from Murong Qi Qi was very obvious.</p><br/><p>Although Mu Yu Die tried to convince herself that Murong Qi Qi was sowing dissension, but the thought about how recently Yu Shi Shi had been encouraging her to marry Feng Cang and also telling her to let her grandfather go to the emperor; the meaning behind these actions were worth thinking about! Could it be that Yu Shi Shi came to find her because she wanted to consolidate crown prince’s position?</p><br/><p>Everyone knew the emperor favored Feng Cang. If Feng Cang didn’t agree, then Wanyan Lie would also not force Feng Cang to do things he didn’t like. By chance, if the matter didn’t go as they planned, then not only did they offend Feng Cang, maybe her grandfather would truly need to resign and return to their hometown. In the end, the one who would profit from all of these is definitely crown prince Wanyan Hong!</p><br/><p>After thinking about all of these, Mu Yu Die glared once at Yu Shi Shi. Seeing that her (YSS) eyes dodged her eyes, Mu Yu Die was even more sure about the truth in Murong Qi Qi’s words. No wonder Yu Shi Shi recently came to look for her and pretended to be close to her.</p><br/><p>In the past, because of the awkward situation between the second prince and the crown prince, Yu Shi Shi always kept a distance from her. Now, she suddenly became so close to her; there’s certainly a hidden motive! She actually fell into Yu Shi Shi’s trap!</p><br/><p>This woman was truly hateful! She used her love for Feng Cang to shake their Mu fu! Feeling that she had been used, especially her love for Feng Cang had been used, Mu Yu Die wasn’t able to accept it. The way she looked at Yu Shi Shi was not as amiable as before. It seemed that gaze held two knives.</p><br/><p>Obviously, in the past, Wanyan Bao Zhu was like her and liked Feng Cang till they hovered between life and death, but today she was unusually quiet. Instead, she went along with Yu Shi Shi. These two definitely planned to let her fall into a pit! She almost fell for it!</p><br/><p>Being slandered by Murong Qi Qi like this, Yu Shi Shi couldn’t clear herself even if she had a hundred mouths. She just wanted to use Mu Yu Die to crack Murong Qi Qi. She didn’t expect that Murong Qi Qi would excavate the deep meaning behind it. Besides, she didn’t even think about that.</p><br/><p>Seeing that her words had caused some effects, Murong Qi Qi chuckled.</p><br/><p>“Wangye, I just joked with you. Don’t take it seriously?! Just now, crown princess niangniang, princess Bao Zhu and miss Mu were just joking with me! I just shared the jokes between our sisters with wangye, how could wangye take it seriously? Prime minister Mu is highly respected and a pillar of the country…”</p><br/><p>Seeing that pair of clever eyes on Murong Qi Qi, Feng Cang’s eyes no longer could tolerate another. Feng Cang already knew that Murong Qi Qi being like this meant that she had found a way to punish these women and didn’t want him to help. Since his little wangfei is happy, then he should just watch the play! Anyway, no matter what she does, it would be alright since behind her, there’s him!</p><br/><p>“Oh? Really?” Feng Cang ‘suddenly realized’. “Qing Qing, in the future don’t use such jokes to scare me. It’s not like you don’t know; in my heart Qing Qing is more important than all existence. If Qing Qing is unhappy, I’ll let everyone be unhappy. Come, let me coax Qing Qing till she’s happy…”</p><br/><p>In comparison, Feng Cang’s words were truly a threat and also made these people dare not to say anything. Feng Cang said it like that, then it’s certain that he would do it. It was just, Yu Shi Shi and the other didn’t think that Murong Qi Qi was so important in Feng Cang’s heart. If Murong Qi Qi is unhappy, then he would let everyone be unhappy? Feng Cang could absolutely do such a thing!</p><br/><p>Feng Cang cooperated so well and gave her so much face, making Murong Qi Qi become very happy. She’d already wasted so much time on these three women. It’s time to go to Jue Se Fang.</p><br/><p>“Wangye, I want to go to Jue Se Fang to pick a few clothes…”</p><br/><p>“I’ll accompany you!”</p><br/><p>Leaving these three women behind, Feng Cang personally led Murong Qi Qi away. And Feng Cang’s appearance made the people inside the gambling dens come out.</p><br/><p>“Did you see? That is princess Zhao Yang! This time, our contestant got into an accident, it’s princess Zhao Yang who substituted them. That’s why we won the tournament!”</p><br/><p>Some people in the crowd introduced Murong Qi Qi’s wonderful story. The people who originally wanted to see the outcome of the wedding, when they saw that Murong Qi Qi was such a well-behaved and pretty person, they felt pity for her.</p><br/><p>“Maybe in a few days, she’ll become a red skull!” Someone whispered and sighed. However, this sentence reached Feng Cang’s and Murong Qi Qi’s ears. Feng Cang’s hand tightened. Murong Qi Qi could feel the chillness coming from his hand.</p><br/><p>Seeing the attitude of Feng Cang, Murong Qi Qi gave a gentle smile.</p><br/><p>She didn’t believe those god-like rumors! In this world, there’s no ghost; there’s only people’s hearts acting like ghosts! After living together these days, she could feel what kind of person Feng Cang truly was. If Feng Cang’s life was really as strong as the rumors say, then why was it that after so long, she’s still safe? It seemed that the only problem was the wedding night.</p><br/><p>“Wangye, let’s go!”</p><br/><p>Now, it was Murong Qi Qi who led Feng Cang. She used action to tell those people who looked at her with pity that she is happy! And that she would continue to be happy like this!</p><br/><p>After Feng Cang and Murong Qi Qi left, Mu Yu Die felt unsatisfactory. She put all of these on Yu Shi Shi. After saying a ‘I’ll take my leave’, she left. Wanyan Bao Zhu also wanted to leave. Ever since she had intimate contact with Wanyan Hong, she consciously avoided the people of the East palace. However, today she was dragged out by Yu Shi Shi. Now, even if she wanted to leave, she feared that she wouldn’t be able to.</p><br/><p>Being defeated by Murong Qi Qi, being hated by Mu Yu Die and now seeing Feng Cang and Murong Qi Qi showing so much love, Yu Shi Shi felt that nothing went according to her plan today! Yu Shi Shi stared at Feng Cang’s back. The vinegar pot in her heart had been knocked over.</p><br/><p>Look, see how other people’s men love their women? And then thinking about that one in the East palace, aside from being a man, nothing about him is normal! How could Wanyan Hong be compared with Feng Cang? With what could he be compared to? Appearance? Personality? Ability? Temperament?</p><br/><p>Now, Yu Shi Shi felt that she was blind. In the past, because of being afraid, afraid that Feng Cang would die young; so in the end, she chose Wanyan Hong who may become the emperor. Now, what kind of days was she living? Only she knew.</p><br/><p>She’d promised that person to certainly break up Murong Qi Qi and Feng Cang, but now looking at the situation, this simply couldn’t be done. What should she do?</p><br/><p>Now, Yu Shi Shi had anger, and she had nowhere to vent. She turned and saw Wanyan Bao Zhu who was in deep thoughts with her head lowered.</p><br/><p>“Imperial little sister, why didn’t you say anything just now? In the past, didn’t you hate Murong Qi Qi the most? You liked Nan Lin wang so much; why is it that after a trip to Yongzhou, you changed?”</p><br/><p>Yu Shi Shi’s words made Wanyan Bao Zhu startled. Presumably because she had a guilty conscience; after hearing Yu Shi Shi’s words, she felt like she had been seen through.</p><br/><p>Only after being in a daze for quite a moment, did Wanyan Bao Zhu recover. Since Wanyan Hong was unable to recognize her, Yu Shi Shi definitely wouldn’t be able to recognize her. Why should she scare herself like this?!</p><br/><p>“What’s the matter?” Seeing that Wanyan Bao Zhu didn’t seem right, Yu Shi Shi chuckled. She showed a smile full of sarcasm. Just now, she (WBZ) gave a performance of having no interest in Feng Cang and now she was immersed in her own world. She’s certainly thinking about Feng Cang.</p><br/><p>Ah, when had this girl learn to loosen the reins only to grasp them better? It was just, Feng Cang didn’t put such a small trick into his eyes. Now, his heart must be filled with Murong Qi Qi…</p><br/><p>“Let’s go!” Yu Shi Shi went forward and grabbed Wanyan Bao Zhu’s hand.</p><br/><p>“Where to, imperial sister-in-law?” Wanyan Bao Zhu raised her head and was met with Yu Shi Shi’s pair of calculating eyes. Her heart was alarmed and beat hard like bells. She always felt that Yu Shi Shi, this crown princess, wasn’t ordinary. She looked gentle and delicate but was in fact, very insidious. She’s comparable with Wanyan Hong. No wonder they’re husband and wife.</p><br/><p>“Of course, to Jue Se Fang, ah! I want to go buy beautiful clothes! We need to go congratulate when Nan Lin wang gets married! If we’re defeated by Murong Qi Qi in appearance, wouldn’t it be very shameful?!”</p><br/><p>Not waiting for Wanyan Bao Zhu to refuse, Yu Shi Shi pulled Wanyan Bao Zhu along in order to catch up with Feng Cang and Murong Qi Qi.</p><br/><p>“Flies! So hateful!” When Su Mei saw Yu Shi Shi and Wanyan Bao Zhu following them from far away, she immediately humphed. People need to have face, trees have skins, why were these two so shameless? They actually followed them! She really didn’t know how, with such tyrannical faces, they could still laugh!</p><br/><p>“Su Mei, calm down!” Murong Qi Qi patted Su Mei’s hand. “The road is for people to walk on. We can’t stop them!”</p><br/><p>She guessed that Yu Shi Shi and Wanyan Bao Zhu would follow them to Jue Se Fang, but she didn’t stop them. She was still relying on them to do live advertisement for her. No one would make things difficult for money.</p><br/><p>After Fang Tong heard that miss had arrived, he immediately came out to greet. He hadn’t walked to Murong Qi Qi yet, when he was stopped by Yu Shi Shi.</p><br/><p>“Shopkeeper, what new things do you have recently?”</p><br/><p>Fang Tong knew Yu Shi Shi. She was the crown princess; the eldest imperial grandson’s biological mother. Seeing that Murong Qi Qi and Feng Cang continued to look around, Fang Tong knew that miss didn’t need his service. He smiled and accompanied Yu Shi Shi.</p><br/><p>“Yo! Isn’t this crown princess niangniang? This commoner greets niangniang!”</p><br/><p>Just now, she lost face by Murong Qi Qi’s actions. Now, she got it back from Fang Tong’s respectful attitude, making her heart feel great satisfaction.</p><br/><p>“Mm! I came today with princess Bao Zhu. We just want to look to see if there are any beautiful clothes!”</p><br/><p>“Greeting to princess!” Hearing that the one beside Yu Shi Shi was Wanyan Bao Zhu, Fang Tong immediately paid his respect.</p><br/><p>“You may dispense yourself from curtsying…”</p><br/><p>After Wanyan Bao Zhu said one sentence, Fang Tong became startled. Then, he looked carefully at Wanyan Bao Zhu. At last, he smiled, “Great, wait here for a moment!”</p><br/><p>When a beautiful blue dress was brought out and shown in front of Yu Shi Shi and Wanyan Bao Zhu, the two’s eyes almost fell out.</p><br/><p>“How beautiful!” Yu Shi Shi reached out and gently touched it. She felt the softness of the blue dress.</p><br/><p>“How pretty!” When Wanyan Bao Zhu once again opened her mouth, Fang Tong was certain that the person in front of him was Murong Xin Lian.</p><br/><p>Fang Tong had a pair of preternaturally good ears. In the past, at Xi Qi, with just the word ‘good’ from Feng Cang, he was able to recognize that he was Nan Lin wang. Now, although Murong Xin Lian wore a human skin mask, but after two sentences, it was enough to let Fang Tong confirm the true identity of Murong Xin Lian.</p><br/><p>Why was Murong Xin Lian at Bei Zhou? Why was she dressed and appeared like Wanyan Bao Zhu? The fact that she looked like this now was definitely because she wore a human skin mask. It was just, what’s her purpose for coming here (BZ)? Could it be to deal with miss?</p><br/><p>Thinking till here, Fang Tong concluded. He must tell Murong Qi Qi Wanyan Bao Zhu’s true identity. He couldn’t let his miss stay in the dark.</p><br/><p>Yu Shi Shi and Wanyan Bao Zhu each chose a dress. Although the dresses here were very expensive, but they were unique. The thing women buy when spending money was vanity. To be able to wear a beautiful and unique dress in Bei Zhou and even unique in the four countries, becoming the focus of everyone, what importance did spending some money have?!</p><br/><p>Although Wanyan Hong’s personality was bad and he was not so normal, but on materialistic things, he gave Yu Shi Shi great satisfaction. Don’t know if it was because she wanted to prove to Feng Cang that she was living very well now or that she wanted to show her wealth, Yu Shi Shi also generously bought that dress of Wanyan Bao Zhu and gave it to her as a gift.</p><br/><p>“A total of one thousand, two hundred silver teals!”</p><br/><p>“These are bank notes! Count them!” Yu Shi Shi proudly took out a stack of bank notes and gave it to the servant. Her eyes swept over Murong Qi Qi as if she was saying, how do you feel? With one gesture, I can get a thousand teals! Did I scare you?!</p><br/>\n</div>"}