{"title": "Chapter 101 Want to admit defeat, not a chance (1)", "id": 101, "volume": 2, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-101-want-to-admit-defeat-not-a-chance-1", "volume_title": "Volume 2", "body": "<h1>Chapter 101 Want to admit defeat, not a chance (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 101 Want to admit defeat, not a chance (1)</p><br/><p>When Wanyan Kang mounted the venue, Murong Qi Qi returned to her seat and nestled into Feng Cang’s arms. She looked lazily at Longze Jing Tian.</p><br/><p>“Don’t look at him!”</p><br/><p>Sensing that Murong Qi Qi’s gaze had stayed on Longze Jing Tian, Feng Cang turned Murong Qi Qi’s small face towards him.</p><br/><p>“Aside from me, don’t look at other men, especially him!”</p><br/><p>“Why…why is he special?”</p><br/><p>Seeing the strong jealousy in Feng Cang’s eyes, Murong Qi Qi pretended not to know anything. She opened her eyes wide, making them look more innocent than those of a small deer and blinked at Feng Cang.</p><br/><p>“Wangye,1 tell me!”</p><br/><p>“Puchi….”</p><br/><p>Seeing their miss acting so coquettishly towards guye, 2 Su Mei and Su Yue retreated to a side while smiling because the couple needed space to exchange some intimate words.</p><br/><p>“Don’t look is just don’t look!”</p><br/><p>Feng Cang didn’t like the way Longze Jing Tian looked at Murong Qi Qi. Although the way Li Yun Qing looked at this little woman was also not usual, but at least he had a degree of relaxation, unlike Longze Jing Tian. His (LJT) eyes were like a hunter looking at a prey. Besides, there had been a marriage arrangement between Longze Jing Tian and Murong Qi Qi in the past. If it wasn’t because something had happened in between, which made him write the ‘breaking off engagement’ letter; by now, Murong Qi Qi would’ve been his Jing wangfei3.</p><br/><p>Just the thought of this charming person in his arms, almost becoming the bride of someone else, made Feng Cang’s heart feel very uncomfortable. Besides, it seemed that Longze Jing Tian had discovered the good of Murong Qi Qi. He’s beginning to pay attention to her. This made Feng Cang become even more vigilant. The feeling of having his woman being thought about by another is bad!</p><br/><p>“Qing Qing, what did you talk about with ah Kang just now?”</p><br/><p>Feng Cang’s lips reached Murong Qi Qi’s ear and gently bit her earlobe.</p><br/><p>“Tell me, tell me, what did you talk about? Does it have something to do with Longze Jing Tian?”</p><br/><p>The hot air at her ear and also the way Feng Cang gently bit her ear, made a burst of numbness spread through Murong Qi Qi’s body. She quickly pushed Feng Cang away.</p><br/><p>“Wangye, there are many people here! Wangye, pay attention to your image!”</p><br/><p>“Alright! Qing Qing, if you tell me about your and ah Kang’s little secret, then I’ll let you off!”</p><br/><p>It’s not easy to let Feng Cang be at ease. Longze Jing Tian is a lump on his heart. That’s why, he needed to figure out this problem.</p><br/><p>“Alright…”</p><br/><p>Seeing Feng Cang being so persistent, Murong Qi Qi put her hand in a circle against Feng Cang’s ear and whispered in it.</p><br/><p>“Really?”</p><br/><p>Feng Cang’s eyes were full of smiled.</p><br/><p>“Qing Qing is the best!”</p><br/><p>“Humph! Of course!”</p><br/><p>Murong Qi Qi raised an eyebrow.</p><br/><p>“This man had once humiliated me. Wangye, don’t you know in this world, women and small-minded people are the hardest to deal with? That I didn’t give him something in return then, doesn’t mean that I’ve forgotten the humiliation he brought me. So, I’ll let ah Kang teach him a very good lesson in my stead!”</p><br/><p>“I feel much regret that I didn’t draw Longze Jing Tian at this competition. So, I could only ask ah Kang! Wangye, I told ah Kang, if he wins against Longze Jing Tian, then I’ll buy a set of Guanghua gongzi’s4 jewelry for Su Mei as a dowry!”</p><br/><p>“He agreed?”</p><br/><p>“Of course! Even heroes would find it difficult to get past the charms of a beautiful woman!”</p><br/><p>Seeing Murong Qi Qi’s triumphant face, Feng Cang couldn’t help but pinch her nose.</p><br/><p>“Naughty! Why didn’t I discover before that my little wangfei is such a naughty child?”</p><br/><p>“I’m not a child…”</p><br/><p>Murong Qi Qi was dissatisfied with Feng Cang addressing her like that and wrinkled her nose.</p><br/><p>“Alright, alright. It has started. Let’s watch the competition!”</p><br/><p>On the platform, Longze Jing Tian had long pushed out his inner energy. He was afraid that what had happened to Li Yun Qing would happen again. He was afraid that Wanyan Kang would grab the crucial moment and take the initiative. By then, he (LJT) would lose the opportunity to push out his inner energy. That’s why, from the moment he came up, he exposed his seventh level purple inner energy.</p><br/><p>“Tsk…”</p><br/><p>Seeing that Longze Jing Tian was acting so impatiently, Wanyan Kang yawned. This person truly gauged the heart of a gentleman with one’s own mean measure. He was being so impatient, as if he (WK) would do something to him. So petty. He truly is the same as how cousin-in-law described. This man has a bad personality!</p><br/><p>To gauge the heart of a gentleman with one’s own mean measure: narrow-minded people always guess things in their own narrow-minded ways.</p><br/><p>Now, Wanyan Kang’s whole mind was thinking about Murong Qi Qi’s words. If he wins against Longze Jing Tian, she will give him a set of Guanghua gongzi’s jewelry. So great! He has seen Guanghua gongzi’s Tong Bao Zhai’s jewelries. Not only were women moved; even he, a man, loved them so much, he was unable to put them down. If Su Mei has a set of Guanghua gongzi’s jewelry, she would certainly be so happy! No matter what, today for that jewelry, he would fight with his life!</p><br/><p>“Please!”</p><br/><p>Longze Jing Tian did a gesture of inviting. Wanyan Kang humphed once.</p><br/><p>Could this be the pretension that cousin-in-law mentioned? Being a fake gentleman? The sound of the drum to start the competition hasn’t even sounded yet! What does he mean with this? He pushed his inner energy out and pulled out such a gentlemanly manner to invite him. Very hypocritical! No wonder cousin-in-law dumped him! Cousin-in-law made a truly wise choice!</p><br/><p>‘Boom…’</p><br/><p>The drums sounded. The third competition finally began.</p><br/><p>The moment it started, Longze Jing Tian flew fast like an arrow to Wanyan Kang. His weapon was an exquisite blue sword. Seeing Longze Jing Tian being so ‘impatient’, Wanyan Kang laughed. This person really couldn’t constrain his personality. Since it’s like this, then let’s play with him according to how cousin-in-law instructed!</p><br/><p>At this point, Wanyan Kang didn’t push out his inner energy. Murong Qi Qi fancied his qinggong5 and let him wear Longze Jing Tian out. Sure enough, this competition became a ‘catch me if you can’ game. Longze Jing Tian was the cat and Wanyan Kang was the mouse. On the platform, a game of the cat trying to catch the mouse was playing.</p><br/><p>Shameless! Longze Jing Tian couldn’t help himself from cursing Wanyan Kang in his heart.</p><br/><p>Wanyan Kang being like this was for nothing more than wasting time and while he (WK) was at it, it also consumed the inner energy he (LJT) pushed out. Besides, before at the pagoda, he had hurt his feet. Although the medicine Murong Qi Qi gave was indeed very good, but now, scabs have already formed, since it’s not a miracle medicine. His feet were also bandaged and they were also hurting! This person obviously wants to wear him out!</p><br/><p>Longze Jing Tian guessed right. Wanyan Kang did indeed intend to go on like this. When Murong Qi Qi told him that Longze Jing Tian’s feet had only recovered fifty percent; that at most, scabs had formed and he was not completely healed, he’d already intended to use such a way to consume time with Longze Jing Tian.</p><br/><p>What cousin-in-law said was right. No matter if it’s black cat or white cat, the cat who caught the mouse is a good cat. No matter what kind of way he used, as long as he wins the competition, he’s the king! Anyway, he didn’t care about those images. This time, he needed to wear out Longze Jing Tian! Let him waste a pair of feet! Who let him always have intentions on cousin-in-law?! Cousin-in-law is cousin brother’s!</p><br/><p>Before the finals, Wanyan Kang also became aware about the ‘bad intentions’ in Longze Jing Tian’s eyes towards Murong Qi Qi.</p><br/><p>In Wanyan Kang’s heart, such a man is very shameless! In the past, he broke off with cousin-in-law. Now, he wants to eat medicine for regret. Where in the world is there such a thing?! Besides, only his cousin brother, Feng Cang, is worthy of Murong Qi Qi. Others are just floating clouds!</p><br/><p>On the platform, Wanyan Kang was energetically dodging; Longze Jing Tian was hot in pursuit. Grudgingly, it was as if eyes grew on the back of Wanyan Kang’s head. Always, when Longze Jing Tian was just about to catch him, he would immediately fly away from the range of attack. Longze Jing Tian was helpless towards Wanyan Kang, but he also couldn’t help but admire Wanyan Kang’s qinggong.</p><br/><p>Wanyan Kang turned his head and looked at Longze Jing Tian. He revealed a naughty smile.</p><br/><p>“Jing wang, continue, ah! Let’s warm up before we begin! I haven’t warmed up yet!”</p><br/><p>The audience almost vomited blood. People with a fast mind already calculated that they had already run one hundred and eight laps. What’s haven’t warmed up yet? He ran for so long and still hadn’t warmed up? It seemed that his highness the prince was deliberately amusing himself with Xi Qi’s wangye!</p><br/><p>If it was at another country, the audience would’ve surely spat on Wanyan Kang and let him get off the platform! However, now they were in Bei Zhou. The citizens of Bei Zhou were happy looking. Anyway, as long as fifth highness wins, why bother with what kind of measures he used?!</p><br/><p>In order to support Wanyan Kang, there were people in the audience who cheered: “Your highness, take your time to warm up! What we have is time!”</p><br/><p>“That’s right, your highness! At worst, we will eat dinner here before going home!”</p><br/><p>When these words of Bei Zhou’s citizens reached Murong Qing Lian’s ears, she almost died from anger.</p><br/><p>“These Bei Zhou’s people are really shameless!”</p><br/><p>Murong Qing Lian began to curse. She has never seen such a thick-skinned prince. Obviously, Jing wang’s feet were still hurt. He (WK) had actually used such a despicable way to compete! Really despicable! No need to mention those Bei Zhou’s people who were cheering! Really, what kind of prince the country has, is what kind of citizens it would have!</p><br/><p>Seeing Bei Zhou’s people ‘ugly and repulsive faces’, Murong Qing Lian once again thought about that bitch, Murong Qi Qi. Truly a bitch like the others, over the top bad! When it’s her turn, she must definitely teach Murong Qi Qi a good lesson. She needs to trample very hard on that arrogant face! For sure!</p><br/><p>While Murong Qing Lian was worried about Longze Jing Tian, at the other side, Wanyan Bao Zhu’s heart was also beating in her throat. Although, she didn’t know that Longze Jing Tian had injured his feet at the pagoda, but from Longze Jing Tian’s face, she could see the seriousness of the matter. In her heart, she couldn’t help but curse Wanyan Kang countless times.</p><br/><p>On the platform, Wanyan Kang was playing leisurely. If it wasn’t because Murong Qi Qi gave him this trick, he would’ve long pushed out his inner energy and went head to head with Longze Jing Tian. Now, he was bouncing to here and bouncing to there. Very relaxing. Occasionally, he would stop to rest and take a breath. He felt great!</p><br/><p>In contrast to Wanyan Kang, because of him running around for a long time, the wounds on Longze Jing Tian’s feet opened once again. Blood slowly spread in his socks. His shoes had a wet feeling. The most painful thing was, he had sweaty feet. At this moment, his two feet were emitting a lot of sweat. The wound was infected with salty sweat; a burning pain came that few people could endure.</p><br/><p>Damn it! Even if Longze Jing Tian needed to pay attention to his image, he now truly wanted to curse! Looking once again at that smiling face of Wanyan Kang; in his heart, he wished he could grab him and cut off his head with one stroke of the sword.</p><br/><p>Wanyan Kang sensed the change in Longze Jing Tian. He took a closer look. It was just like how Murong Qi Qi described it. On Longze Jing Tian’s black shoes, a somewhat darker color appeared. Also, on the white soles, there was a touch of red. It seemed that he had endured to the extreme. Wanyan Kang admired Murong Qi Qi endlessly.</p><br/><p>However, while admiring, Wanyan Kang became more aware that there wouldn’t be a good end if he offended Murong Qi Qi. This cousin-in-law was clever, but she also held long grudges. This Longze Jing Tian had offended cousin-in-law; it could be considered that he was unlucky! He also needs to be more careful in the future. He must not offend Murong Qi Qi, lest he also be abused!</p><br/><p>Longze Jing Tian stopped and no longer chased after Wanyan Kang. If he continued like this, his pair of feet would certainly be destroyed. Now, he must stop and it would be better to quickly finish this! Wanyan Kang was obviously consuming his time; wanting to hold him here! He had already been fooled once. He could no longer let this nasty person’s wish be fulfilled!</p><br/><p>Since Longze Jing Tian didn’t move, Wanyan Kang also didn’t move. He used his pair of hands as a fan and fanned at his face. While fanning, he spoke in a peculiar tone: “Aiya, it is indeed a warm up, ah. After running a few laps, I finally got warm. My whole body is covered in sweat. Later when I go back, I need to comfortably take a bath. Otherwise, if I smell, the beauty won’t like it.”</p><br/><p>Wanyan Kang’s voice was loud. Coupled with that lowly face, it made people couldn’t help themselves but want to go to him and give him two slaps in the face.</p><br/><p>“Miss, did you give him the idea?”</p><br/><p>Seeing Wanyan Kang acting like that, Su Mei couldn’t help but laugh.</p><br/><p>“He doesn’t have such a clever mind!”</p><br/><p>Murong Qi Qi smiled but didn’t answer. Looking at the situation, Longze Jing Tian wouldn’t be able to hold it in much longer. She didn’t mind using ‘despicable’ means to beat the opponent. As long as one can win, what did it matter if it was fair or unfair?!</p><br/><p>Fairness was just a big hat the ruling social class forced the commoners to wear. If there was fairness, then there wouldn’t be a gap between rich and poor! If there was fairness, when Longze Jing Tian looked at her with contemptuous eyes and saw her as a rubbish, did he thought to be fair to her?</p><br/><p>Longze Jing Tian tried to put on a calm expression. His eyes were focused on Wanyan Kang. The pain on his feet distracted him. Those wounds, which had formed scabs, were now open again. Pain spread from the soles of his feet and stimulated his brain.</p><br/><p>“Show your weapon. Fight squarely like a man with me!”</p><br/><p>The goading in Longze Jing Tian’s words may have had an effect on somebody else, but on Wanyan Kang, it didn’t have any effect. He (LJT) chose the wrong person! This prince never cared for things like face and image. If he cared about face, then he wouldn’t be the prince of Bei Zhou’s dynasty who let the emperor get the most headaches!</p><br/><p>“What to do? I didn’t finish warming up yet. Besides, I’m only eighteen! Also, I haven’t married yet! I don’t even have a woman! I haven’t experienced a woman; how can I be called a man?! Please, call me a little boy! I’m still very innocent!”</p><br/><p>When Wanyan Kang said that, he turned his head and gave Su Mei a flirtatious wink.</p><br/><p>“Pu…”</p><br/><p>Su Mei almost spurted out blood. This guy, really! Such a serious moment like this competition, he still said such words! And thinking about the content of those words, it’s simply too bad! Really worthy of being a player!</p><br/><p>On contrary to Su Mei, Murong Qi Qi admired Wanyan Kang more and more. he truly is a weirdo of the imperial family. His skin is thick enough! It’s just, don’t know what Longze Jing Tian would do when encountering such a person!</p><br/><p>Sure enough, Longze Jing Tian almost went crazy because of Wanyan Kang. Is this person truly a prince from Bei Zhou’s imperial family? Why is he so out of tune? That skin is thicker than the walls! Why did Bei Zhou make such a weird prince?!</p><br/><p>Wanyan Kang was put by Longze Jing Tian in the category ‘off the mark’ humans. There was a language barrier while talking to such a person. It’s better to act than talk!</p><br/><p>They had already rested for a while. Although on the surface, Longze Jing Tian put on a very tired look, but the hand holding the sword had been secretly moving his energy. He must take the other party down in one strike! Let him never be so arrogant again!</p><br/><p>Wanyan Kang pretended to have not seen through Longze Jing Tian’s thoughts. Instead, he continued to wink flirtatiously at Su Mei; as if this was his stage and he’s fawning at the woman he likes.</p><br/><p>“This bastard! Is he still competing or not?!”</p><br/><p>Seeing that everyone were looking over here, Su Mei’s face got hot again. She ferociously glared at Wanyan Kang. However, in her complaining words was a touch of sweetness.</p><br/><p>“Ai, people in love, ah! How beautiful!”</p><br/><p>Murong Qi Qi couldn’t help but lament, but she had been pulled by Feng Cang into his arms.</p><br/><p>“Does Qing Qing envy ah Kang and Su Mei very much? Could it be that I don’t treat Qing Qing good enough? Why is there a need to envy others?”</p><br/><p>Feng Cang once again began to find vinegar to eat. Murong Qi Qi gave one of his cheeks a kiss.</p><br/><p>“Wangye, I was just lamenting for a moment! Su Mei followed me for so many years. When a girl grows up, it’s difficult to keep her. I have a feeling that I’m marrying a daughter off!”</p><br/><p>Hearing Murong Qi Qi’s and Feng Cang’s, Su Mei stood up.</p><br/><p>“Miss is the most bad one! I’m ignoring miss!”</p><br/><p>While stomping, Su Mei turned away from the stands.</p><br/><p>“Heehee!”</p><br/><p>Su Yue covered her mouth with laughter, but she has been caught by Murong Qi Qi.</p><br/><p>“Su Yue, Su Mei has already fallen in love, you also need to do your best, ah! I’m still waiting to eat sweets from your wedding! If you guys marry at the same time, how great would that be?!”</p><br/><p>“Miss!”</p><br/><p>Su Yue blushed.</p><br/><p>“Miss broke down Su Mei and is now making fun of me! I won’t marry! I want to follow and serve miss for a whole lifetime!”</p><br/><p>“Tsk, tsk…”</p><br/><p>Seeing Su Yue like that, Murong Qi Qi couldn’t help but tsked twice.</p><br/><p>“When I marry, could it be that you want to be a dowry maid?”</p><br/><p>Dowry maid are maids/girls who follow the bride to the groom’s house. Usually, they would be used as a way to let the bride stay in power in the family by sending her maid to the groom’s bed. The bride would stay in power since her slave contract is in the bride’s hands. It’s better to let the dowry maid get the groom’s love instead of some unknown girl who cannot be controlled by the bride.</p><br/><p>“Miss!”</p><br/><p>Su Yue’s face had gone completely red. What is she (MQQ) talking about? She doesn’t want to be a dowry maid! She only wanted to follow Murong Qi Qi and never thought of something else.</p><br/><p>“If miss continues to talk nonsense, then I and Su Mei will isolate you!”</p><br/><p>“Alright, alright, alright. I won’t talk about it anymore! I’ll keep you and send Su Mei away. In the future, you’ll follow me. I won’t marry you off!”</p><br/><p>Murong Qi Qi gestured with her hands in mercy and put on an ‘I surrender’ expression. That amused Su Yue, making her laugh. At this time, the two people on the platform had already confronted each other for a long time. Longze Jing Tian stood there without moving. Wanyan Kang also didn’t move. On his face was a naughty smile. He looked left and right as if this was not a competition but a picnic.</p><br/><p>Wanyan Kang’s attitude irritated Longze Jing Tian. This bastard! What did he take the competition for? He didn’t respect the competition like this! Longze Jing Tian wished he could go and twist Wanyan Kang’s neck. He had never seen someone more shameless than Wanyan Kang. This person is truly the scum of the imperial family!</p><br/><p>Wanyan Kang turned a blind eye to Longze Jing Tian’s ugly expression. He dug in his ears for one moment. He lazily stretched for another moment. He looked at the sky for another moment. In short, he was very comfortable and relaxed. When he saw Su Mei walk down the platform, Wanyan Kang waved at her.</p><br/><p>“Little Mei er!6 I’m here!”</p><br/><p>It’s this opportunity! Longze Jing Tian cleverly captured Wanyan Kang’s ‘blind spot’. He flew in the sky and shouted once. The sword went straight at Wanyan Kang’s back.</p><br/><p>“Be careful!”</p><br/><p>Seeing Longze Jing Tian flying full of murderous aura towards Wanyan Kang, Su Mei screamed. However, she was too late. Longze Jing Tian’s swords was almost at Wanyan Kang’s back.</p><br/><p>“Your highness, kill him!”</p><br/><p>Seeing this scene, Murong Qing Lian couldn’t help but clench her fists and began to scream excitedly.</p><br/><p>After being played by Wanyan Kang for so long, Longze Jing Tian finally exposed a cruel smile. Dare to make fun of him? Where’s there such a beautiful thing in the world?! He’s Xi Qi’s Jing wang Longze Jing Tian! Not everyone can make fun of him!</p><br/><p>Under the winter sunlight, the sword exuded a quiet cold light and went straight at Wanyan Kang’s back. Murong Qi Qi wasn’t as excited as Su Mei, but her hand tightly held Feng Cang’s big hand. Her heart was also very nervous.</p><br/>\n</div>"}