{"title": "Chapter 102 Want to admit defeat, not a chance (2)", "id": 102, "volume": 2, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-102-want-to-admit-defeat-not-a-chance-2", "volume_title": "Volume 2", "body": "<h1>Chapter 102 Want to admit defeat, not a chance (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 102 Want to admit defeat, not a chance (2)</p><br/><p>“It would be alright!”</p><br/><p>Feng Cang was a lot calmer. How could he not know Wanyan Kang’s ability? If he couldn’t dodge this, then he’s truly too weak!</p><br/><p>Just when the sword was about to stab Wanyan Kang, Wanyan Kang somersaulted backwards and fell off the platform, but his hands were still at the edge of the platform.</p><br/><p>That his sword stabbed into air was beyond Longze Jing Tian’s expectations. When he saw that pair of hands, Longze Jing Tian’s sword mercilessly went to Wanyan Kang’s fingers.</p><br/><p>Kuang…</p><br/><p>Wanyan Kang rolled his body and went up the platform again. His feet kicked Longze Jing Tian’s sword, making a burst of golden light.</p><br/><p>Only now did Longze Jing Tian found out that Wanyan Kang’s shoes each had a shiny dagger.</p><br/><p>“Oh no!”</p><br/><p>Longze Jing Tian shouted once. Wanyan Kang’s feet already flew over at him. Seeing this, Murong Qi Qi understood that the most powerful thing about Wanyan Kang were those legs. Fast, ruthless and sinister! Wanyan Kang’s pair of legs repeatedly attacked Longze Jing Tian’s lower part, especially his legs. Every attack had the intention to kill!</p><br/><p>Seeing this, Su Mei finally sighed from relief. In her heart, she reproached Wanyan Kang for a while. This guy truly let people worry. He truly didn’t keep himself from trouble!</p><br/><p>In just a moment, Longze Jing Tian became the passive one. Originally, his feet had already hurt a lot. Now, they became the object of Wanyan Kang’s attack. Gradually, every step Longze Jing Tian took would leave a bright red blood print on the ground. Seeing this, the audience couldn’t help but stand up.</p><br/><p>Can’t be like this! Can’t lose! Longze Jing Tian gritted his teeth. He’s Xi Qi’s Jing wang.1 How could he lose to Bei Zhou’s prince?! Then he would lose all face!</p><br/><p>When Wanyan Kang’s attack came once again, Longze Jing Tian didn’t hide or dodge. His pair of legs suffered two cuts.</p><br/><p>“Wangye!”</p><br/><p>Murong Qing Lian screamed, but Longze Jing Tian acted as if he didn’t feel the pain. Without even pausing the slightest, he stabbed with his sword at Wanyan Kang. He let Wanyan Kang attack him because he wanted to find an opportunity to be close to him (WK)! Now, he already pushed Wanyan Kang to the edge of the platform. Now, he only needs this opportunity!</p><br/><p>Longze Jing Tian, at the expense of his legs, was all for an opportunity to defeat him. This made Wanyan Kang admire him a bit. He couldn’t dodge the sword which suddenly came at him. He could only approach and grab Longze Jing Tian’s sword with his left hand.</p><br/><p>“Ah…,” someone in the audience screamed.</p><br/><p>Longze Jing Tian didn’t stop. The sword continued to pierce forward. The sword passed through Wanyan Kang’s hand. At this point, the two were face to face. There was only the distance of a finger between them.</p><br/><p>“Hehe…,” Wanyan Kang suddenly laughed. This made a bad feeling rise in Longze Jing Tian’s heart.</p><br/><p>“Jing wang, it’s not only you who knows how to break an arm to protect yourself!”</p><br/><p>Finished speaking, Wanyan Kang’s right fist hit Longze Jing Tian’s chest.</p><br/><p>Bang!</p><br/><p>Longze Jing Tian let go and fell back from the platform.</p><br/><p>Wanyan Kang removed and threw away the sword in his hand and looked at Longze Jing Tian with a serious expression. The blood on his palm dripped drop by drop on the ground.</p><br/><p>“You lost! However, you’re an admirable opponent!”</p><br/><p>When Wanyan Kang stepped down the platform, Su Mei immediately rushed towards him and held his hand. Seeing the cut made from the sword as well as the exposed bones, Su Mei felt so much heartache that she cried.</p><br/><p>“You fool!”</p><br/><p>“Little Mei er2, are you crying for me?”</p><br/><p>Wanyan Kang’s finger gently touched Su Mei’s tears. He put it to his mouth and tasted it.</p><br/><p>“Tears are bitter. I don’t like it! In the future, don’t cry anymore! I like your fierce self better!”</p><br/><p>Wanyan Kang saying such unsensational words made Su Mei cry even harder.</p><br/><p>“You, this bastard! Could it be that you don’t know how much I’ll be worried?!”</p><br/><p>“Aiyaya!”</p><br/><p>Being scolded by Su Mei made Wanyan Kang be in a good mood, but he put on a painful expression.</p><br/><p>“Little Mei er, if you don’t cure my hand, I’m afraid that it would become crippled in the future!”</p><br/><p>Only now, did Su Mei remember that Wanyan Kang’s hand was injured. She immediately took him away to bandage it.</p><br/><p>At this side, Longze Jing Tian was also escorted back to his seat. Seeing the doctor bandage the wounds on his feet, Murong Qing Lian’s tears rolled in her eyes.</p><br/><p>“The injury didn’t reach the bones. It’s only injury of the surface!”</p><br/><p>Although the doctor said that, but Murong Qing Lian still felt that her heart hurt very much.</p><br/><p>If it wasn’t because she was afraid of rats and he had carried her across the chain, then Longze Jing Tian’s feet wouldn’t have gotten wounded and he also wouldn’t have been bullied at the competition by that bastard Wanyan Kang.</p><br/><p>“Don’t cry anymore. Prepare yourself to play a good battle!”</p><br/><p>Longze Jing Tian looked a bit tired. After losing this competition, he felt that there was no longer hope for this tournament of the four countries. Murong Qing Lian going up against Murong Qi Qi; his intuition told him Murong Qi Qi would win.</p><br/><p>Murong Qing Lian didn’t know Longze Jing Tian had already prepared himself for a loss. Instead, because of his words, her confidence rose more than one hundred percent.</p><br/><p>“Wangye, don’t worry. I will certainly win!”</p><br/><p>Murong Qing Lian was hell bent on winning against Murong Qi Qi in order to avenge Longze Jing Tian. Murong Qi Qi slowly took off her fox furred coat. She stepped on the platform at a leisurely pace.</p><br/><p>Today was the competition. She had specially put on red clothes. The warm and unrestrained color made Murong Qi Qi look clever and refined, as though a proud snow red plum flower was blooming in this winter December.</p><br/><p>When Murong Qing Lian came to the platform with a bitter and hateful expression, Murong Qi Qi laughed: “You’ve arrived!”</p><br/><p>After seeing Murong Qi Qi’s calm face, Murong Qing Lian immediately got angry. She pulled out her soft sword and her inner energy was quickly released.</p><br/><p>“Yo, has become serious? Since you became serious, then I’ll accompany you!”</p><br/><p>Murong Qi Qi’s weapon was the same as when she had fought with Guli. It was the red muslin. Seeing that Murong Qi Qi was so calm, Jia Lan couldn’t help but nod.</p><br/><p>“The imposing attitude is not bad! Don’t know how the result would be!”</p><br/><p>“Sir Jia Lan, who do you think would win?”</p><br/><p>Jin Yu stood beside Jia Lan and looked at the two women on the platform.</p><br/><p>“Murong Qi Qi.”</p><br/><p>“Why?”</p><br/><p>Jia Lan’s answer was a bit of a surprise for Jin Yu.</p><br/><p>“Intuition.”</p><br/><p>“But the pearl we found at the sixth floor had come from a pearl necklace. That necklace belongs to Murong Qing Lian!”</p><br/><p>Jin Yu’s voice showed that he was very confused.</p><br/><p>“Oh, just because she was able to clear the floors doesn’t mean that she would win here. Wait and see!”</p><br/><p>This pair of sisters, Murong Qi Qi and Murong Qing Lian, shed all pretenses of cordiality. This time, they no longer spoke those words of courtesy. When the sounds of the drums sounded, the two became very serious.</p><br/><p>This was the last competition of the tournament of the four countries. It was also the most critical competition. Before, Bei Zhou had two wins and was temporarily in the lead. Now, if Murong Qing Lian wins, then the two countries would tie. By then, one more competition would be held.</p><br/><p>Everyone could see the contestants of the two countries clearly. Murong Qing Lian was the blue fifth level. With her age of fifteen years, to be able to reach this level was already very good. Looking at this side, Murong Qi Qi didn’t have any inner energy and was rumored to be a rubbish. Could she really deal with this competition?</p><br/><p>This question hovered in the hearts of the citizens. Everyone stared without blinking at this pair of sisters from Murong family. They wanted to know who was a level above the other.</p><br/><p>Murong Qi Qi didn’t intend to be polite with Murong Qing Lian. So, from the moment it started, she let the red muslin go straight at Murong Qing Lian.</p><br/><p>Danger! Murong Qing Lian’s nerves sensed danger coming. She wanted to dodge, but unexpectedly, Murong Qi Qi’s speed was so fast. So fast, that she hadn’t even moved her body yet, when the red muslin heavily hit her butt.</p><br/><p>‘Pa!’</p><br/><p>Murong Qing Lian couldn’t help but shout in a low voice from the pain.</p><br/><p>“Painful?”</p><br/><p>Murong Qi Qi’s revealed an evil yet beautiful smile.</p><br/><p>“There are more painful things that would follow!”</p><br/><p>‘Pa!’</p><br/><p>Once again, the red muslin hit Murong Qing Lian’s body. This time, the force was more powerful. It directly made Murong Qing Lian hit the ground.</p><br/><p>Murong Qing Lian hadn’t even made a move yet, but she had already been made to hit the ground by the other party. This let the citizens, who had been a little afraid of Xi Qi’s contestant, begin to scoff. Outside the platform, it was full of voices of dissatisfaction as if Murong Qing Lian was a weakling.</p><br/><p>“Murong Qi Qi!”</p><br/><p>Murong Qing Lian didn’t expect that from the moment it started, Murong Qi Qi would use such a way to ‘humiliate’ her. A girl being hit on the butt in the public; how shameful was that?!</p><br/><p>“Ah…”</p><br/><p>Murong Qi Qi didn’t answer Murong Qing Lian. Instead, she moved the red muslin in her hand and once again let it go to Murong Qing Lian.</p><br/><p>Two parts of red muslin were like two fire red snakes with bloody mouths, wanting to devour Murong Qing Lian.</p><br/><p>This time, Murong Qing Lian was prepared. Not waiting for the red muslin to come near, she rolled over to another side.</p><br/><p>‘Pa!’</p><br/><p>The red muslin hit the ground, breaking the stone into small pieces. One of those small pieces hit Murong Qing Lian’s face. Immediately, her forehead became swollen.</p><br/><p>Before, she tolerated Murong Qing Lian for so long. This time, Murong Qi Qi didn’t simply want to teach Murong Qing Lian a lesson. She wanted to kill Murong Qing Lian.</p><br/><p>There had been many times before, where someone died at the tournament of the four countries. It would only be a small matter if she killed Murong Qing Lian here. So, Murong Qi Qi didn’t intend to let Murong Qing Lian go down the platform. She also didn’t intend to give her the opportunity to beg for mercy.</p><br/><p>‘Papapa!”</p><br/><p>The red muslin followed Murong Qing Lian. Again and again, it hit Murong Qing Lian.</p><br/><p>Before, when dueling with Guli, Murong Qi Qi had the heart to play with Guli. That’s why the red muslin only hit the stones next to Guli’s feet and didn’t hurt her (G). This time, Murong Qi Qi’s red muslin accurately hit Murong Qing Lian’s body.</p><br/><p>At this time, Murong Qing Lian’s whole body suffered a beating. It was so painful; her tears almost fell out. Her inner energy was completely useless. One, it was because she couldn’t get close to Murong Qi Qi. Two, from the moment it started, Murong Qi Qi didn’t give her the opportunity to attack.</p><br/><p>Attacking, attacking without stopping was what Murong Qi Qi currently doing.</p><br/><p>When a person loses the initiative, it’s the same as putting his/her life in someone else’s hands. So, in order to survive, one must grasp the initiative first. This was what adopted father taught her (MQQ) before and also something she had never dared to forget.</p><br/><p>‘Pa!’</p><br/><p>This time, the red muslin hit Murong Qing Lian’s face. Immediately, her left cheek became red and swollen like a red steamed bun.</p><br/><p>Seeing the red muslin once again coming at her, Murong Qing Lian wanted to block her face. However, she didn’t know why she was one beat slower. The red muslin hit her right cheek. Now, Murong Qing Lian’s face was swollen like a pig. Seeing her appearance, the audience laughed. Some people shouted: “Good.”</p><br/><p>There were also people who clapped and cheered for Murong Qi Qi.</p><br/><p>Seeing Murong Qi Qi beat Murong Qing Lian in a rage, Wanyan Bao Zhu couldn’t help but shudder.</p><br/><p>It turned out that she had been mistaken. In the past, she thought that Murong Qi Qi was so arrogant because she was relying on the powerful maids at her side. Now, she finally understood, Murong Qi Qi didn’t need to rely on anyone. She herself was someone powerful. That’s why she’s so arrogant.</p><br/><p>Murong Qi Qi, you hid very well! You deceived everyone!</p><br/><p>The thought that she was deceived so bitterly by Murong Qi Qi; and lost her mother, her child and the position of wangfei3 which she had almost gotten in her hands, Wanyan Bao Zhu clenched her fists tightly. She glared fiercely at Murong Qi Qi. She wished she could peel her (MQQ) skin, eat her flesh and drink her blood.</p><br/><p>The abnormal state fell into Ji Xiang’s eyes. She silently remembered this scene. Feng Cang let her spy on Wanyan Bao Zhu in secret. Whenever she encounters something strange, she must report back to him. That’s why Ji Xiang had been paying close attention to Wanyan Bao Zhu. It’s just that now, Wanyan Bao Zhu’s eyes and heart were full of hatred for Murong Qi Qi; how would she notice that Ji Xiang had been hiding in the dark and observing her every move?</p><br/><p>“Cousin brother, cousin-in-law is very valiant, ah…”</p><br/><p>The already bandaged Wanyan Kang looked with eyes wide open at Murong Qi Qi, full of disbelief.</p><br/><p>“Cousin brother, is that still my gentle, kind and amiable cousin-in-law? Why do I feel that she’s so frightening, ah?!”</p><br/><p>“Is she not great? I like it very much.”</p><br/><p>Feng Cang put a candied fruit in his mouth.</p><br/><p>“She is most beautiful being like this…”</p><br/><p>“Ah, ah, ah! You’re both perverts!”</p><br/><p>After hearing Feng Cang’s words, Wanyan Kang quickly flashed to a side.</p><br/><p>“Cousin brother and cousin sister are perverts! You two really are a true match!”</p><br/><p>Feng Cang turned his face and smiled at Wanyan Kang.</p><br/><p>“If you say one more word, when she comes back, I’ll tell Qing Qing what you said just now. Tell me, would that handsome face you cared about so much turn the same as Murong Qing Lian’s, looking like a pig’s?”</p><br/><p>The evil smile on Feng Cang’s face made Wanyan Kang shudder. He immediately put on a smile: “Cousin brother, we’re brothers. There’s no need to tell cousin-in-law those words! See, I still need to rely on this face to pursue little Mei er! Cousin brother, have mercy, ah!”</p><br/><p>“Ah…”</p><br/><p>No longer bothering anymore with Wanyan Kang’s brazen face, Feng Cang’s gaze once again followed Murong Qi Qi.</p><br/><p>On the wide platform, Murong Qi Qi, dressed fully in red, was like a warm day in this silent winter, illuminating everyone’s eyes.</p><br/><p>In the people’s eyes, aside from Murong Qing Lian’s screams, this was not a competition. It was a gorgeous solo dance. Murong Qi Qi danced with the red muslin in her left hand. The red muslin looked like a sleeve dancing in the sky, throwing a beautiful arc. Her slender waist also swayed in this cold weather. It was truly a beautiful picture.</p><br/><p>“This woman is an extraordinary person.”</p><br/><p>Jia Lan quietly looked at Murong Qi Qi.</p><br/><p>No one would link killing and art together. Although Murong Qi Qi’s body emitted a cold, killing aura; but on her face was a smile, a sweet sweet smile, and coupled with a flying appearance, it simply didn’t look like she was in the midst of killing someone. Instead, it was as if she was completing a piece of art.</p><br/><p>Such a woman would make people couldn’t help but want to explore everything about her. He didn’t think that coming to the mainland this time, he would be able to see such a woman as Murong Qi Qi. It’s just, Murong Qi Qi wanted to kill Murong Qing Lian. He couldn’t watch that happen with folded arms. If Murong Qing Lian truly was that person Misha wanted to find; if she died, how would he explain to Misha?</p><br/><p>Watch with folded arms: stand by without doing anything</p><br/><p>Murong Qing Lian laid on the ground, battered and exhausted. The pain on her body was already inexplicable with words. It looked like Murong Qi Qi’s red muslin just hit her body; however, those parts it hit were very critical. Now, her ankles had been dislocated. Her calves were also dislocated. Aside from her two arms that could still move, she was simply unable to stand up.</p><br/><p>This woman is truly too frightening! Murong Qing Lian finally understood that Murong Qi Qi was someone not to be offended. Those reckless words of hers were completely spoken without thought. Her brain must’ve been filled with feces. How could she have done such a stupid thing?</p><br/><p>Before coming to Bei Zhou, big brother Murong Jun repeatedly told her not to go find trouble at Murong Qi Qi’s. At that time, she scoffed and felt that Murong Jun was making a fuss about nothing. What can a rubbish do? However, now she knew the real Murong Qi Qi. She really regretted it! She’s truly afraid!</p><br/><p>“Qing Lian, admit defeat. End the competition!”</p><br/><p>Longze Jing Tian, who was looking at the tournament, become aware of Murong Qi Qi’s intention to kill Murong Qing Lian. He immediately gave a command to Murong Qing Lian.</p><br/><p>“Quickly, get off the platform!”</p><br/><p>“Oh…”</p><br/><p>Seeing that Longze Jing Tian ordered Murong Qing Lian and once again wanted to save her, Murong Qi Qi laughed. He’d already saved her one, two times from her (MQQ) hands; could it be that he wanted to save her for the third time? This time, even if Yanwang comes, he (Y) wouldn’t be able to save her!</p><br/><p>Yanwang: the king of hell and the judge of the death.</p><br/><p>The rule of the finals was that you only needed to let the opponent get off the platform or that you admit defeat to end the competition; otherwise, the competition would continue.</p><br/><p>Murong Qi Qi seized this point. That was why her goal had been to aim at her (MQL) ankles and calves. It was to let her unable to get off the platform. Like that, the competition would continue, till she was beaten to death.</p><br/><p>Murong Qing Lian heard Longze Jing Tian’s words. She also knew that Murong Qi Qi wanted to use this opportunity to kill her. So, even though her legs had been dislocated, she still struggled to crawl to the edge of the platform. One step, two steps…Not waiting for Murong Qing Lian to crawl to the edge, the red muslin wrapped around her feet and pulled her back.</p><br/><p>“Good little sister, didn’t you say before that you wanted to let me see some color? Now, it’s already been so long, but I haven’t seen any color. How could this be alright?! Maybe you should let out some blood to let me see some red; perhaps then, this competition would be over. “</p><br/><p>Letting someone see color: teach someone a lesson</p><br/><p>“Murong Qi Qi, don’t go overboard!”</p><br/><p>Murong Qing Lian gritted her teeth. What see red? Isn’t that letting her (MQQ) see blood! She’s already in such a sorry state, what more does Murong Qi Qi want?</p><br/><p>“I went overboard?”</p><br/><p>Hearing this from Murong Qing Lian, Murong Qi Qi acted like she heard the world’s biggest joke. The red muslin danced, wrapping around Murong Qing Lian tightly and bringing her to Murong Qi Qi.</p><br/><p>“When daddy punished me with the wooden stick, who secretly put nails on the stick?”</p><br/>\n</div>"}