{"title": "Chapter 128 The Fight of the dragon and the phoenix (2)", "id": 128, "volume": 2, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-128-the-fight-of-the-dragon-and-the-phoenix-2", "volume_title": "Volume 2", "body": "<h1>Chapter 128 The Fight of the dragon and the phoenix (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 128 The Fight of the dragon and the phoenix (2)</p><br/><p>Thinking till here, Su Mei quieted down. Seeing the two pretty girls in front of her, Murong Qi Qi sighed. She walked to them. Her left hand held Su Mei, her right hand held Su Yue.</p><br/><p>“You two fools, ah! With I, your miss’s ability, how would I not be able to take care of myself?! Men and women should get married once they’ve come of age. You’re always staying at my side, what to do if you’ve missed your life?! I don’t have sisters, so I took you as my close big sisters! If you aren’t happy, then I also won’t be happy!”</p><br/><p>“So, if you have someone you love, have a relation you want to pursue, you must let yourself go and love boldly. If the fate is missed, then it would be a regret of your whole life. I don’t want to see you two sitting there regretting about the past when you’re old…”</p><br/><p>“Miss…,” Murong Qi Qi’s words made the two girls want to laugh and also become moved.</p><br/><p>Even though Murong Qi Qi was their master, but she didn’t have the arrogance of a master. Instead, she was very forgiving to them. She really was like their sister. To be able to stay at Murong Qi Qi’s side was something to be proud of for Su Mei and Su Yue.</p><br/><p>“Promise me, if you find your happiness, you must bravely pursue it!” Murong Qi Qi put Su Mei and Su Yue’s hands together. Her hands also fell on theirs. “It won’t be enough if only I was happy. All three of us need to be happy!”</p><br/><p>“Mm!” Murong Qi Qi’s words made Su Yue and Su Mei’s eyes become wet. They nodded.</p><br/><p>This scene fell in Nalan Xin’s eyes. It seemed that wangfei 1 truly wasn’t an ordinary person! Even in this time where the hierarchical system was very important, she was able to get along with her maids like sisters!</p><br/><p>These past few days, Nalan Xin had followed orders to investigate Guanghua gongzi.2 He didn’t expect that this Guanghua gongzi was truly like the rumors. He was like a holy dragon without a tail. He (NX) simply couldn’t find his tail.</p><br/><p>Murong Qi Qi and Guanghua gongzi knew each other, so they should have a special way of contacting each other. Hence, Nalan Xin set his eyes on Murong Qi Qi. It was just that, usually Murong Qi Qi doesn’t go out of the residence. Wangye 3 was also almost always at her side. Therefore, the one who contacted Guanghua gongzi for her must be one of her maids.</p><br/><p>Look out for Su Mei and Su Yue and find the clues from them, was the idea Nalan Xin came up with.</p><br/><p>“Miss, look, Nalan Xin is secretly staring at Su Yue again!” Su Mei had sharp eyes. With one look, she saw Nalan Xin. She immediately stabbed Murong Qi Qi at her side, “Like I said, Nalan Xin took a fancy to Su Yue.”</p><br/><p>Hearing Su Mei say this, Su Yue’s face became red again. After Murong Qi Qi’s marriage, she and Nalan Xin indeed have a few encounters. However, they didn’t talk much and only nodded at each other, nothing more. Nalan Xin’s character was not bad. It was just, Su Yue doesn’t know if she liked him or not.</p><br/><p>Seeing Nalan Xin appear, Murong Qi Qi laughed. It seemed that there was a chance. Why doesn’t she play matchmaker a bit? “Cough, cough! Su Yue, go to Tong Bao Zhai to see if the jewelry I’d designed for the empress dowager’s birthday is done. I have Su Mei to serve here, you don’t need to worry…”</p><br/><p>Murong Qi Qi’s words were very blatant. It was like, you stay outside for a bit longer. Even if you don’t come back, it’s fine…</p><br/><p>“Miss…,” Su Yue was shy.</p><br/><p>“Go! Naturally, I should bring a gift to grandmother’s birthday! Usually, it was Su Mei who run the errands. Today, I need to talk with Su Mei about Wanyan Kang. It’s better if you go.”</p><br/><p>Nalan Xin was far. He didn’t hear what Murong Qi Qi said. Seeing Su Yue leave, he also followed.</p><br/><p>Nalan Xin following Su Yue confirmed Murong Qi Qi and Su Mei’s thoughts. The two exchanged a glance and laughed. There’s indeed a chance!</p><br/><p>After leaving the wangfu,4 Su Yue went directly to Tong Bao Zhai. After three days, it would be the empress dowager’s birthday. Earlier, Murong Qi Qi had designed a set of jewelries called ‘Red Phoenix Facing the Sun’. All were made from the best red jade. During these past two days, it should have been completed.</p><br/><p>Nalan Xin followed not far nor near behind Su Yue. Only after seeing Su Yue enter Tong Bao Zhai, did he affirm his thoughts. Murong Qi Qi had indeed communicated with Guanghua gongzi through her maid. It was just, only knowing this was not enough. The most critical thing was finding Guanghua gongzi.</p><br/><p>Recently, even though on the surface wangye was deadly calm, but Nalan Xin, who’d followed Feng Cang for a long time, felt Feng Cang’s anxiously waiting heart. Presumably, everyone in love was like this.</p><br/><p>“Teacher Nalan, what are you doing here?” When Nalan Xin came out of the daze, Su Yue was already in front of him. Once again, being in such close proximity with Su Yue made Nalan Xin’s heart couldn’t help but jump badly.</p><br/><p>Su Yue was not a very beautiful girl, but she was the kind who, the more you looked at, the more comfortable it would get. The more you looked at her, the more she was worth a second look. Especially Su Yue’s eyes. They seemed like they could talk. It’s said that the eyes were the windows to the soul. Presumably, this girl’s heart was also very beautiful.</p><br/><p>“I was only passing, turn…turn…,” Nalan Xin didn’t know why; but when Su Yue looked at him, he had a feeling of suffocation as though he couldn’t breathe. It was very uncomfortable.</p><br/><p>Could he be possessed? Nalan Xin patted his forehead. How silly he could look like, was how silly he looked like now.</p><br/><p>Seeing Nalan Xin like this, Su Yue was somewhat anxious. Unconsciously, her hand touched his forehead. “You don’t have fever, ah…”</p><br/><p>Feeling the warmth of Su Yue’s soft hand and smelling the fragrance from her fingertips, Nalan Xin’s face turned red. Like avoiding plague, he stepped back, “That, I’ll go first. I still have something to do!”</p><br/><p>Not waiting for Su Yue to speak, Nalan Xin fled the scene like a gust of wind.</p><br/><p>The attitude of the other party made Su Yue feel a bit injured. Could miss be wrong and Nalan Xin didn’t like her? Otherwise, why would he escape so fast?</p><br/><p>At the other side, Nalan Xin was also surprised. When had he ever acted like this? Why was it whenever he saw Su Yue, his heartbeat would speed up and he wouldn’t even be able to speak a full sentence?</p><br/><p>He heard that the people from Moyu were good with poisons. Presumably, Su Yue at Murong Qi Qi’s side, should also be an expert at poison. It was just, when did she put poison on him and let him get infected unknowingly? It seemed that in the future, he needed to stay far away from Su Yue!</p><br/><p>In just a moment, Nalan Xin gave up on the idea of inquiring about Guanghua gongzi from Su Yue. He decided to do as Feng Cang said; kidnap the people of Tong Bao Zhai and Jue Se Fang to force Guanghua gongzi to come out. It was wangye who was right; when it’s necessary, using violence was the fastest solution to the problem!</p><br/><p>Dongfang Lan’s birthday arrived as planned. During these past few years, Dongfang Lan had been staying in the temple. This was the first time that she’d celebrated her birthday. Originally, the empress dowager didn’t want to get so many people involved and be too extravagant. However, Wanyan Lie said that they could use this opportunity to introduce princess Zhen Guo. Only after thinking about Murong Qi Qi, did Dongfang Lan nod and accept the celebration.</p><br/><p>As the only person who had a blood relationship with her in this world, Murong Qi Qi was very respectful towards Dongfang Lan. Early in the morning, Murong Qi Qi arrived at Jinxuan palace. These past few days, aside from staying in the wangfu, she also came to Jinxuan palace to accompany the empress dowager.</p><br/><p>“Aunt Qing, good morning!” Murong Qi Qi entered smilingly. When she saw Qing Gu, she greeted her.</p><br/><p>“Princess, today you came really early!” Qing Gu also liked this long-lost princess very much. In the past, it was she who raised princess Ming Yue. Now, although the beauty had passed away, but Wanyan Ming Yue’s daughter inherited her looks and gesture, making people couldn’t help but transfer their love for Ming Yue to Murong Qi Qi.</p><br/><p>“Aunt, has grandmother woken up?”</p><br/><p>“She just woke up and asked about princess. Didn’t expect princess to come so soon!”</p><br/><p>When Murong Qi Qi put the set ‘Red Phoenix Facing the Sun’ made from red jade in front of Dongfang Lan, not only Dongfang Lan, even the eyes of the palace maids at a side, almost fell out.</p><br/><p>“Wishing grandmother to have this day every year and that you’ll have today’s glory forever! May your happiness be as immense as the East Sea and may you live as long as the Zhongnan Mountains!”</p><br/><p>“Good! Good! So beautiful! Aijia5 has seen many treasures, but none were as good as the one Qi Qi gave me!” With one look, Dongfang Lan fell in love with this set of jewelries. Not to mention the value, the design itself was unheard of and unseen before. Dongfang Lan didn’t even know how to describe it.</p><br/><p>“This jewelry must be from Tong Bao Zhai, isn’t that right?!” Qing Gu had sharp eyes. With only one look, she could tell that this set of jewelries was out of the ordinary.</p><br/><p>Seeing that Qing Gu recognized it, Murong Qi Qi nodded, “That’s right! I and Guanghua gongzi met once. It just so happened to coincide with grandmother’s birthday; I especially let Guanghua gongzi create this ‘Red Phoenix Facing the Sun’ for grandmother. Grandmother, do you like it?”</p><br/><p>“Like! Like! Qing Gu, today aijia will wear this ‘Red Phoenix Facing the Sun’ and let everyone know my granddaughter’s filial piety.”</p><br/><p>“Good!”</p><br/><p>Originally, Dongfang Lan was already dressed. Now, especially for this set of jewelry from Murong Qi Qi, she’d changed. When this pair of grandmother and granddaughter arrived at Taiji hall, everyone had already arrived and only waited for Dongfang Lan.</p><br/><p>“Empress dowager arrived! Princess Zhen Guo arrived!”</p><br/><p>The moment they’d heard Murong Qi Qi arrived, the officials stretched their neck, wanting to see Murong Qi Qi’s appearance clearly.</p><br/><p>Ever since the moment Wanyan Lie made Murong Qi Qi’s identity public and also bestowed her with the title of princess Zhen Guo, the officials were very curious about this offspring of Feng Xie and Wanyan Ming Yue. Although from the palace came the news that Murong Qi Qi looked very much like Wanyan Ming Yue and was a beauty of this generation, but the things you hear may be false. Only believe in what you see.</p><br/><p>Although Wanyan Ming Yue’s appearance was still deeply engraved in these people’s hearts, but Murong Qi Qi, that ordinary girl who’d appeared on the palace banquet, how could she be Feng Xie and Wanyan Ming Yue’s daughter? This news was too shocking.</p><br/><p>In order to confirm the truth, many people sharpened their heads to squeeze into Nan Lin wangfu to see Murong Qi Qi’s beauty.</p><br/><p>However, Feng Cang protected Murong Qi Qi very well. He declined everyone and besides, every time Murong Qi Qi entered the palace, Feng Cang would be at her side. The carriage was also tightly covered. This made everyone’s curiosity rise to the peak. So, they waited for the empress dowager’s birthday. Big and small officials, all came to Taiji hall.</p><br/><p>‘Bang…’ One person’s chopsticks fell onto the ground. His mouth was wide open. Beautiful, so unusually beautiful…</p><br/><p>Not only this person, the others also felt the same. That woman wore a yellow dress. On the dress were lilies embroidered with golden threads.</p><br/><p>Her thick black hair was in a high bun. She didn’t use any jewelry. Only a yellow band fixed the hair. A few strands hung loosely and reached Murong Qi Qi’s waist. With every step, they gently swung with her body like a fairy descending from heaven.</p><br/><p>The hand Wanyan Lie stroked his beard with froze when Murong Qi Qi entered.</p><br/><p>Ming Yue…seeing Murong Qi Qi who looked and acted like Wanyan Ming Yue, Wanyan Lie’s eyes got wet. Ming Yue, zhen6 has found Qi Qi. Are you happy?</p><br/><p>Crown prince Wanyan Hong and second prince Wanyan Yi were designated to sit at either side, and their eyes flashed amazement. Although this wasn’t the first time they saw Murong Qi Qi, but every time they saw her, she was able to give them a new feeling.</p><br/><p>The hand Wanyan Hong had on Yu Shi Shi couldn’t help but pinch her waist fiercely.</p><br/><p>“Ah…,” Yu Shi Shi frowned and screamed in a low voice. Wanyan Hong’s strength was great. Presumably, on her waist there would be one more purple trace.</p><br/><p>Yu Shi Shi’s scream let Wanyan Hong laugh. His aquiline nose looked sharper, “It seemed that this crown prince wasn’t dreaming. This is real!”</p><br/><p>Only after Wanyan Hong said that, did Yu Shi Shi understand what he meant. It turned out that he thought he was dreaming after seeing the fairy like Murong Qi Qi. That was why he’d pinched Yu Shi Shi hard. Only after hearing her pain, was he sure that he wasn’t dreaming. This man was really despicable!</p><br/><p>Yu Shi Shi endured the pain and gritted her teeth. She couldn’t express any trace of dissatisfaction. Recently, Wanyan Hong’s attitude towards her was very bad. Yu Shi Shi knew that this change was because of Murong Qi Qi. Wanyan Hong had set his eyes on Murong Qi Qi. So, he wanted her to give up her position and give it to Murong Qi Qi.</p><br/><p>Now, to Yu Shi Shi, she’d come to the most critical moment in her life. She couldn’t and wouldn’t give up her position of consort to others like this. Not to mention, it was Murong Qi Qi! She couldn’t let Wanyan Hong pick her thorn (find any fault in her)!</p><br/><p>How would Yu Shi Shi know that Wanyan Hong already had the intention to kill her. No matter how good she performed, she was only an abandoned chess piece. She was useless, so naturally he should give up on her, lest to let her block his foot and also take up space! So, no matter what Yu Shi Shi did, her fate was only death.</p><br/><p>Murong Qi Qi personally helped Dongfang Lan sit down. Then, she walked to her seat. Her seat was next to Feng Cang. She had just sat down when Feng Cang’s handsome face came over, “Qing Qing, you’re so beautiful today…”</p><br/><p>“Thank you…,” Murong Qi Qi smiled at Feng Cang. Her small hand also reached out for Feng Cang under the table and went into Feng Cang’s big hand. “Cang, today you’re also particularly handsome and charming…”</p><br/><p>Feng Cang was happy from the bottom of his heart. Because today, Nalan Xin will bring people to sweep Tong Bao Zhai and Jue Se Fang in Yan capital. He already ordered to let none of those who protested to remain alive. And to tie up those still living. He would use these lives to force Guanghua gongzi to appear.</p><br/><p>All the beautiful things of this woman belonged to him. All her bad things also belonged to him. Of course, in his eyes, Murong Qi Qi was perfect without any flaws. So, no matter what happened, Murong Qi Qi was his woman. He would not allow anyone to have ideas about Murong Qi Qi!</p><br/><p>Hearing Murong Qi Qi once again use ‘charming’ to describe him, Feng Cang chuckled and revealed a smile which was able to entice all living beings. His fingers gently scratched Murong Qi Qi’s palm, making Murong Qi Qi giggle.</p><br/><p>Murong Qi Qi was happy. Feng Cang was also happy. By the time the palace banquet was finished, Nalan Xin would also have done everything successfully. Guanghua gongzi always cherished his underlings. If he found out that his people were kidnapped, he would certainly take the initiative to find him (FC). By then, he would trample this rival like trampling an ant to death to avoid this man tempting his little wangfei’s heart! That heart belongs to him. She had long been branded with his traces. Even if she allows it, he wouldn’t agree!</p><br/><p>Seeing the intimate interaction of Feng Cang and Murong Qi Qi, Wanyan Lie was increasingly pleased. Heaven must’ve felt the depression and injustice that he’d felt in his heart. That was why it made such a pair of siblings to complete what he couldn’t personally accomplish.</p><br/><p>This pair of children must be as pitiful as he was in the past. It was just, they were braver than he was!</p><br/><p>Thinking till here, Wanyan Lie somewhat envied Feng Cang. At least, he’s (FC) brave and had the courage to fight for his happiness. And Wanyan Lie himself, because of being siblings, he felt shameful and also deliberately avoided Wanyan Ming Yue. If he also had Feng Cang and Murong Qi Qi’s courage, would it be different now?</p><br/><p>Lin Ke Xin, who’s sitting beside Wanyan Lie, clearly felt the fluctuation of the moods from the man next to her. From the touch of sadness and the thick pampering from Wanyan Lie’s eyes, Lin Ke Xin was certain that Wanyan Lie truly loved Feng Cang and Feng Qi Qi. It seemed that she must let her son do his best more often.</p><br/><p>She heard that recently, Wanyan Kang had been frequently going to Nan Lin wangfu. It seemed that this younger son of hers forgot her hint. He truly wanted to compete for the throne with Wanyan Yi! She wouldn’t allow such a thing to happen! This world is Wanyan Yi’s. Even if it’s Wanyan Kang, he also couldn’t take it!</p><br/><p>1. Wangfei: main wife/consort of the prince of first rank</p><br/><p>2. Wangfei: main wife/consort of the prince of first rank</p><br/><p>3. Wang/wangye: prince of first rank </p><br/><p>4. Wangfu: residence of the prince of first rank</p><br/><p>5. Aijia: I, used by an empress dowager</p><br/><p>6. Zhen: I, used by the emperor</p><br/>\n</div>"}