{"title": "Chapter 138 A plot to be exposed (2)", "id": 138, "volume": 2, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-138-a-plot-to-be-exposed-2", "volume_title": "Volume 2", "body": "<h1>Chapter 138 A plot to be exposed (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 138 A plot to be exposed (2)</p><br/><p>“Yi er,1 if the crown prince isn’t deposed, then you wouldn’t be able to be at ease. Only when he truly falls from power would we be able to celebrate.”</p><br/><p>Seeing the happiness of her son, Lin Ke Xin couldn’t help but point that out. “Not only can you not be happy. Instead, you must pretend to be concerned. You also need to plead for your imperial big brother and leave a good impression in front of your emperor father. Having the two to compare, your emperor father naturally will understand who is the most appropriate heir to the throne in the end.”</p><br/><p>“Yes! This subject son thanks consort mother’s teachings!” Although he was saying that, but inside Wanyan Yi’s heart, he was indeed very happy. In the past, Wanyan Hong relied on his status as the crown prince and gave him a hard time. Now, it’s great. He actually came with an incest between siblings and was caught in the act by emperor father. It seemed that he wouldn’t be able to turn his fortune any longer.</p><br/><p>How could Lin Ke Xin not know her son’s thoughts. She couldn’t help but be worried. Although Wanyan Yi performed well, but he was still somewhat immature. When meeting with unexpected things, he was unable to remain calm. However, with her, this consort mother covering him, she definitely wouldn’t let this throne fall into another’s hand.</p><br/><p>“That’s right, Yi er, what has your little brother been doing recently?”</p><br/><p>“Before, ah Kang had been frequently running to Nan Lin wangfu.2 These days, Feng Cang and Feng Qi Qi are not there. So he mostly stayed at his palace and didn’t go anywhere.”</p><br/><p>Mentioning this playboy and incompetent little brother, Wanyan Yi’s eyes couldn’t help but flash disdain. Although he and Wanyan Kang came from the same mother, but he looked down upon this little brother who idled his time away.</p><br/><p>Every day, he was smiling mischievously. It seemed that there wasn’t a time when he had been serious. Suh a brother was somewhat a shame.</p><br/><p>“Consort mother, I feel that Feng Cang and Feng Qi Qi’s relationship are not ordinary. These days, Feng Cang doesn’t appear. It looked like he took Feng Qi Qi out for a scenic tour. Could it be that they also want to commit incest?! If it’s like that, then that would be great. It would be good enough to take them down at once!”</p><br/><p>Lin Ke Xin didn’t agree with Wanyan Yi’s argument. Although Feng Cang and Feng Qi Qi’s relationship was out of the ordinary, but how could the crown prince be compared to Feng Cang, “Yi er, don’t touch Feng Cang for now. You’re not his opponent!”</p><br/><p>Wanyan Yi didn’t put this advice from Lin Ke Xin in his heart. After verbally promising Lin Ke Xin, Wanyan Yi went out of the palace and summoned his confidant.</p><br/><p>“Your Highness, you want to kill Feng Cang?” The moment Sun Xing heard Wanyan Yi’s idea, he was shocked. “Your highness, Nan Lin wang3 isn’t someone ordinary, ah! Not to mention the eagle troop under him, even he is very skilled. Your highness, killing Feng Cang is not like a child playing a house; it’s not child’s play. Asking Your Highness to reconsider!”</p><br/><p>Sun Xing’s words were the same as Lin Ke Xin’s. This made Wanyan Yi frown.</p><br/><p>“This prince feeds you not to let you help the opposition’s aspiration, while undermining our own power and prestige! It’s not like you need to do it with your own hands. Could it be that you don’t know how to find an assassin?! Use your pig’s brain, alright! This prince isn’t fighting with Feng Cang on a battlefield. This prince wants to play underhanded tricks!”</p><br/><p>Although Sun Xing was not too happy after being scolded by Wanyan Yi, but the other party was the master. He couldn’t refute him.</p><br/><p>“Your Highness, if you really want to find an assassin to kill Feng Cang, then I suggest doing it on the night of the fifteenth. I heard that demon wang’s power is the weakest on the night of the full moon. Killing him at that time would most likely be successful.”</p><br/><p>“Even if you don’t say this, this crown prince knows. I ask you, which organization is the best at assassinations in this jianghu?”4</p><br/><p>“Moyu and Fo Sheng Men are about the same. It’s just, Moyu is the best at using poisons and killing without a trace. Moyu’s assassins are also famous throughout the jianghu.”</p><br/><p>After Sun Xing’s explanation, Wanyan Yi completely understood. After thinking for a while, Wanyan Yue issued a command to Sun Xing, “Look for Moyu! Since Moyu’s assassins are the best, give them five thousand golden teals! This prince wants Feng Cang’s head!”</p><br/><p>“Yes…,” Sun Xing knew that no matter how much he persuaded, Wanyan Yi’s mind was set. He (SX) could only do according to his (WY) wishes.</p><br/><p>When Wu Qing appeared in front of Murong Qi Qi, they had already spent a few days happily in this small town.</p><br/><p>These past few days, Feng Cang and Murong Qi Qi was like any other ordinary couple. They were inseparable and watched the sunrise and sunset. In the morning, the two would go buy ingredients hand in hand. When they came back, Murong Qi Qi would wash the vegetables and Feng Cang would cook. The days flew away very ordinarily and simply, but it was full of warmth.</p><br/><p>“Miss, someone paid a lot of money for guye’s5 head.” Wu Qing stood respectfully in front of Murong Qi Qi. He roughly told the matter of Wanyan Yi coming to find them and wanting them to kill Feng Cang on the night of the full moon.</p><br/><p>“How much?” Murong Qi Qi snuggled lazily in Feng Cang’s arms. Want her people to kill Feng Cang? Feces must’ve entered this Wanyan Yi’s head! Why didn’t he inquire first, ah?!</p><br/><p>“Five thousand golden teals.”</p><br/><p>When she heard that it was only five thousand golden teals, Murong Qi Qi laughed with a ‘puchi’ sound. She raised her head and looked at Feng Cang, “Didn’t expect that the famous Nan Lin wang was only worth five thousand. Really so…cheap.”</p><br/><p>“Cang, why don’t you give me ten thousand golden teals? Then this matter would be forgotten! My people had run an errand. You should at least give them some money to buy them drinks, ah!” Murong Qi Qi’s fingers jumped on Feng Cang’s palm like someone dancing ballet.</p><br/><p>The itch coming from his palm made Feng Cang grasp Murong Qi Qi’s soft body and put her small hands on his lips. He kissed it a bit, “What if I say no?”</p><br/><p>“Then, it’s easy!” Murong Qi Qi pulled back her hand and turned to look at Wu Qing, “Wu Qing, issue the ‘Chasing life’ command. Rewarding ten thousand golden teals for killing demon wang plus the award of ‘the best killer of the year’.”</p><br/><p>Listening to his miss, the originally ruthless expression on Wu Qing’s face twitched a bit. “Miss, really?”</p><br/><p>“Hehe, of course it’s real….” Feng Cang picked her up. “Qing Qing, could it be that you want to murder your husband?”</p><br/><p>“Cang…,” His name was stretched out as Murong Qi Qi spoke. “If not, then how can I have an affair?!”</p><br/><p>A ‘have an affair’ completely made Feng Cang angry. Leaving Wu Qing, he returned to the room while holding Murong Qi Qi. “It must be because this husband didn’t satisfy Qing Qing. That’s why Qing Qing wants someone else. It seemed that before, my love was too gentle. If now, I don’t let Qing Qing see the real me, Qing Qing will certainly think that I’m useless and jump into another’s arms.”</p><br/><p>“Don’t…hehe, so itchy…don’t, I was joking…”</p><br/><p>How could Feng Cang comply with Murong Qi Qi’s plea now. Now, his skills at taking off clothes were becoming better and better.</p><br/><p>Feng Cang still couldn’t help but sigh. This woman was certainly sent by heaven to torture him.</p><br/><p>A starving wolf throwing oneself at food; the consequences could be imagined. Even when it became night, Murong Qi Qi still didn’t appear. When Feng Cang came out, Wu Qing had already cooked and also prepared wine.</p><br/><p>The two men didn’t bother with their relationship of master and servant and sat down. They ate big mouthfuls of meat and drank lots of wine.</p><br/><p>Originally, Wu Qing didn’t know Feng Cang too well. Now, after seeing that he (FC) was also someone so straightforward, he (WQ) revealed a thin smile. It seemed that miss didn’t choose the wrong person.</p><br/><p>After a few cups of wine, Wu Qing was tipsy and he also became more talkative.</p><br/><p>“When miss first arrived, she was reluctant to speak. Every day, she would just follow sir Mozun to practice martial arts. She didn’t rest for a moment. At that time, miss was just ten years old, but in her eyes, she had the coldness and ruthlessness of an adult.”</p><br/><p>“Sir Mozun loved miss very much. He always tried to tease her into speaking. However, no matter if he did a joker face or anything else, miss still had a cold expression. Her eyes were empty. Her gaze obviously fell on you, but there was no you in her eyes. It made people’s hearts ache for her. Only after two years did miss slowly begin to speak. Later, her personality also gradually became cheerful. When sir Mozun passed away, miss was already in charge of Moyu.”</p><br/><p>Feng Cang never knew Murong Qi Qi had such a past. Just the thought of the appearance of the ten-year-old Murong Qi Qi who didn’t speak, made Feng Cang’s heart twitch from pain.</p><br/><p>“Miss is our Moyu’s treasure. Before, when I heard that miss needed to marry you, I objected very much. In my eyes, miss is my little sister. I didn’t want her to suffer the slightest grievances. Once, I even thought about killing you…”</p><br/><p>Wu Qing confessing his thoughts so honestly made Feng Cang admire this person in front of him. He was named Wu Qing (heartless), but he was someone who took friendship seriously.</p><br/><p>“However, ever since miss began to stay with you, the smiles on her face became more and more cheerful by the day. Seeing miss’s happiness, we’re all also very happy. These few years, miss suffered much for Moyu. We, Moyu owe miss. So, in our eyes, miss’s happiness is more important than our lives!”</p><br/><p>“I know.” Feng Cang understood the meaning of Wu Qing’s words. He also made a promise to Wu Qing and also to the Moyu he represented, “I will cherish her like how I cherish my eyes.”</p><br/><p>Wu Qing stared at Feng Cang’s eyes and was silent for a long time. In the end, he nodded, “You better remember today’s promise. Miss takes relationships very seriously. If you betray miss, she’d certainly rather flee and wouldn’t touch you a bit. However, miss is like that, but we won’t let it go. If you hurt miss, even if there’s only one person left in Moyu, he/she would also kill you to take revenge for miss!”</p><br/><p>After speaking, Wu Qing drank the cup of wine in one gulp and showed the bottom of the cup to Feng Cang. Feng Cang smiled and also drained his cup. The charm of men’s promise lied in what was left unsaid.</p><br/><p>After that, Wu Qing and Feng Cang talked in detail about the recent happenings at the capital. Especially, the dark movements of the imperial family.</p><br/><p>“I know you don’t want to bring miss into these whirlpools. It’s just, even if you hide, what needs to come would still come in the end. I hope that when you’re met with danger, you could be like how you said and protect our miss…Although, miss may not need your protection.”</p><br/><p>When Wu Qing left, the sky was shining hazily. Looking at Wu Qing’s back, Feng Cang felt that this person was a real man. Besides, he was someone worthy of someone’s admiration. The things of the capital had come a bit too fast. So fast, that it was outside of his expectations. It was just, since it would come sooner or later, why couldn’t he catch it without a moment’s hesitation?!</p><br/><p>“Cang, what’s the matter?” Murong Qi Qi who had just woken up appeared behind Feng Cang. Her hands hugged him from behind.</p><br/><p>Feng Cang didn’t hide it from Murong Qi Qi. Instead, he told her the news that Wu Qing brought, “Qing Qing, what do you think we should do?”</p><br/><p>“What we should do? Continue the honeymoon! The matters of the imperial family have nothing to do with us. Since second prince likes to toss around, then let them go make trouble for themselves. Sandpiper and clam war together and the fisherman catches both. Why don’t we watch quietly and be the outsiders?!”</p><br/><p>Sandpiper and clam war together and the fisherman catches both: neighbors who can’t agree lose out to a third party</p><br/><p>A few simple words from Murong Qi Qi let Feng Cang see the great wisdom of this woman. She was like the roundworm in his belly and saw the struggle of the imperial family clearly. Really, getting such a wife, what more could a husband ask?!</p><br/><p>“Since Qing Qing said so, this husband could only follow the instruction of my wife! The scenery of this small town is so great. Let’s spend a few more days here!”</p><br/><p>These two people made up their minds to be outsiders and watch a play. Inside the palace, empress dowager Dongfang Lan’s ears had been disturbed without end by the empress’s crying.</p><br/><p>“Empress mother, Hong er was definitely set up by someone! What kind of person he usually is, could you not know?! Empress mother, it certainly must be that someone is jealous of us, this pair of mother and son. That’s why that person had set a trap. The purpose is to get Hong er’s position of crown prince!”</p><br/><p>Li Bing’s eyes were red from crying. She was completely not in her usual dignified and decent state. Wanyan Hong had been imprisoned by Wanyan Lie. Wanyan Lie didn’t even allow her, the empress, to go see him. He also said that if she went to visit Wanyan Hong, he would strip her of her phoenix crown. That’s why, Li Bing went to vent her feelings at Dongfang Lan’s.</p><br/><p>“It’s useless for you to cry here at aijia’s.6 The emperor saw this thing with his own eyes. It was not someone else who let him go there.” Dongfang Lan was also very angry at Wanyan Hong’s ugly act. It’s alright no matter what kind of women you like, but to actually do it with your own little sister…Ay, really a misfortune of the imperial family, ah!</p><br/><p>“Empress mother, you need to help chenqie!7 Bao Zhu, that girl, insisted that it was Hong er who forced here. How could Hong er commit incest with his little sister?! From chenqie’s point of view, this thing must’ve been colluded by Bao Zhu with that one in Jingxin hall!”</p><br/><p>Li Bing kept saying that Lin Ke Xin was the one behind it, making Dongfang Lan get a headache. Not a day or two goes by without these two women fighting each other in the palace. No matter what, wasn’t it just for the throne? Could it be that, that position was really so good?</p><br/><p>“Aijia won’t meddle in this matter and also couldn’t meddle in it. Aijia is already old. It’s been so long that aijia doesn’t ask about these things…” Dongfang Lan gestured with her hand to let Qing Gu send the guest off.</p><br/><p>“Empress mother, the emperor had always been filial and would certainly listen to you! Woo, woo, chenqie only has this one son Hong er. If something happens to him, chenqie also can’t live anymore!” Dongfang Lan refusing to help was in the expectations of Li Bing. However, she couldn’t accept that her son missed the position of crown prince so narrowly.</p><br/><p>Now, Li Bing knelt in front of Dongfang Lan. While she kowtowed, she cried. She looked very pitiful. Probably, all mothers in the world would be like this. It was just, this matter was related to the throne. Dongfang Lan couldn’t help her.</p><br/><p>Although Wanyan Hong was the crown prince, but his words and deeds didn’t have the posture of an emperor. If such a person became the emperor, the ones who would suffer would be the citizens. Dongfang Lan couldn’t disregard the country and its people because of her love for her grandson.</p><br/><p>They should let the right person sit on the throne. Wanyan Hong isn’t approporate, so he should let someone else sit on it.</p><br/><p>Dongfang Lan’s thoughts were the same as Wanyan Lie’s. After imprisoning Wanyan Hong for a few days, Wanyan Lie finally appeared in front of him. Seeing his son’s decadent face, Wanyan Lie hated the iron for not becoming steel.</p><br/><p>Hated the iron for not becoming steel: to feel resentful towards somebody for failing to meet their expectations and impatient to see improvements</p><br/><p>“Do you know that you’re wrong?”</p><br/><p>“This subject son doesn’t know.” A bandage was wrapped around Wanyan Hong’s head. Although he was imprisoned, but his treatment had not been harsh. So, his complexion wasn’t that bad.</p><br/><p>“You did such a thing to your little sister and you’re still not wrong?” Seeing Wanyan Hong’s indifferent expression, Wanyan Lie became very angry. Because of being stirred up, the veins of his hands were exposed. One by one, they became exceptionally obvious.</p><br/><p>“Hahahaha!” Being talked to like that by his father, made Wanyan Hong laugh out loud. He cried from laughing. He reached out to wipe his tears. His eyes stared at the man in front of him wearing a dragon robe.</p><br/><p>“Emperor father, troubling you to look clearly. Where does that woman look like Bao Zhu? She just wore a human skin mask. Hahaha!”</p><br/><p>Wanyan Hong’s words made Wanyan Lie shocked. He nodded, and Jing De immediately went to the room next door. Just a while later, Jing De came over with a human skin mask and handed it over to Wanyan Lie.</p><br/><p>“Did you see, emperor father?! This is a human skin mask! Although this subject son really wanted to learn to commit incest like emperor father, but this subject son doesn’t have a number one beauty of the world as little sister, ah!”</p><br/><p>1. Er: term of endearment</p><br/><p>2. Wangfu: residence of the prince of first rank</p><br/><p>3. Wang/wangye: prince of first rank</p><br/><p>4. Jianghu: world of martial arts</p><br/><p>5. Guye: son-in-law, used by the servants of the female family</p><br/><p>6. Aijia: I, used by an empress dowager</p><br/><p>7. Chenqie: this subject wife/ I, used by the wives of the imperial family</p><br/>\n</div>"}