{"title": "Chapter 147 Have no sense of shame (1)", "id": 147, "volume": 2, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-147-have-no-sense-of-shame-1", "volume_title": "Volume 2", "body": "<h1>Chapter 147 Have no sense of shame (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 147 Have no sense of shame (1)</p><br/><p>“Why did the emperor send a secret guard? Could it be to come catch us in the act?!” After hearing Feng Cang, Murong Qi Qi immediately sat up excitedly. “Is he already on the way? What do we need to do?!”</p><br/><p>Murong Qi Qi didn’t notice that after Feng Cang saw this little woman being so excited about ‘caught in the act’, he reached out and pulled her into his arms, “What to do? Of course, it’s to do some things that would let people misunderstand!”</p><br/><p>“Cang…I am talking about serious things with you!” Murong Qi Qi’s face got hot. She reached out and grabbed Feng Cang’s restless big hand. “How do you plan to deal with Xia Yun Xi?! Seeing her appearance, she seemed to be set on you!”</p><br/><p>“Doesn’t Qing Qing believe in me?” Feng Cang turned over and held Murong Qi Qi under his body…</p><br/><p>“Not that I don’t believe you…I’m only worried that woman would use underhanded means…Mm, don’t…I’m talking with you!”</p><br/><p>“I already let Ji Xiang watch over her. Nothing will happen!” Feng Cang’s lips fell on Murong Qi Qi’s earlobe. “Xia Yun Xi’s emperor father and my mother are half-brother and sister (same father, different mothers). Her grandmother is my grandmother’s junior sister. The one who poisoned my mother is her…”</p><br/><p>The maternal grandfather and maternal grandmother of Feng Cang were emperor and empress of Dong Lu. Feng Cang’s maternal grandmother was a disciple of Peng Lai Island. Then, the maternal grandfather took maternal grandmother’s junior sister. Maternal grandmother died, leaving FC’s mother. The junior sister poisoned FC’s mother with the fetal poison and gave birth to the current DL’s emperor Xia Jin. </p><br/><p>“So, she should call you cousin brother?”</p><br/><p>“Hehe, to be exact, we’re enemies…”</p><br/><p>“Why don’t we catch her and use her to exchange the fetal poison in your body!”</p><br/><p>“If you don’t concentrate, I’ll punish you!”</p><br/><p>The person in black squatted outside Long Autumn palace and stared at the situation inside until morning. When the sky didn’t turn bright yet, he heard a “squeak” sound. The door opened. Feng Cang came out of the chamber in full spirits. Before he left, he gently closed the door as if he was afraid to disturb Murong Qi Qi’s sweet dreams.</p><br/><p>Sure enough, there’s adultery! The person in black lamented very much in his heart. There’s too many horror things during these times! Big brother stayed in the little sister’s room. If this thing gets out, it would be an explosive news, ah!</p><br/><p>The person in black reported Feng Cang’s situation to Wanyan Lie. Hearing this news, Wanyan Lie was in a great mood. If Feng Cang didn’t bother with the proper human relationship and really got together with Murong Qi Qi, then when will their child be born? Maybe, this child already existed now!</p><br/><p>Thinking about the child, Wanyan Lie inexplicably got excited. If there’s a child, what should he gift this child? At least, the child’s parents were brave. They did the thing he wanted to do in the past, but didn’t dare to do it.</p><br/><p>The person in black could feel the joy from the body of the man wearing a dragon robe in front of him. Although he didn’t know where this joy came from, but the person in black kept his kneeling position, and didn’t dare to have the slightest neglect.</p><br/><p>“Emperor, it’s time for the morning court meeting!” Jing De came to Wanyan Lie’s side, dragging him from his feverish fantasy back to the reality.</p><br/><p>“Alright!” Wanyan Lie tidied up his clothes. Before he left, he repeatedly reminded the person in black, “Continue keep watch. Report their interactions at any time to zhen.”1</p><br/><p>During the morning court, the officials discovered that the emperor’s mood was very good today. From beginning to end, Wanyan Lie kept a touch of smile. Besides, his mind wandered several times. He needed Jing De to remind him before he got his mind back.</p><br/><p>After the morning court, the officials gathered in groups of three and four. They wanted to know what good things had happened for such an abnormal behavior to appear in the always calm and collected Wanyan Lie.</p><br/><p>Some people guessed that the emperor got a new favorite concubine and filled the vacancy Yue Lan Zhi left. Some people said it was because the treasury was full, which made the emperor happy. There were also people who said that Nan Lin wang2 and Dong Lu’s princess Xia Yu Xi’s good matter was approaching. The emperor could get the fishery through a marriage alliance. That was why he was happy…</p><br/><p>In the end, all kinds of rumors merged together and spread to Wanyan Yi. After hearing everyone’s assumptions about Feng Cang and Xia Yun Xi, Wanyan Yi couldn’t help but clench his fists. If emperor father really thought like this, then what should he do?</p><br/><p>Inside Nan Lin wangfu,3 from the moment Xia Yun Xi had woken up early in the morning, she had been boiling chicken soup. The small fire burned slowly. When Feng Cang came back from the morning court; he would be able to drink a delicious chicken soup. While Xia Yun Xi fanned next to the small stove, she reveled in her own virtuousness.</p><br/><p>Before, at White Cloud Restaurant, Murong Qi Qi said that Feng Cang liked virtuous women the most. Like her, not only was she virtuous, she also had a strong background, identity and such a rich dowry. Even if Feng Cang lit up the lanterns, he wouldn’t be able to find another! Who wouldn’t be attracted to her?!</p><br/><p>“Princess, wangye has returned!” Hong Ye trotted back and panted. The moment she reached Guanyu building, she reported to Xia Yun Xi the news she’d acquired.</p><br/><p>“Really?!” Xia Yun Xi was so happy, she almost knocked over the chicken soup. Feng Cang had returned. This was the time for her to show a good performance!</p><br/><p>Xia Yun Xi let people bring the chicken soup out with a ladle and let a small palace maid hold it. After that, she was escorted by Hong Ye to Tingsong building</p><br/><p>Only after personally going this time, did Xia Yun Xi discover that Guanyu building and Tingsong building were so far from each other. Although the winter was over and the spring had just began, but she was used to using a sedan for travel. When had she ever walked so far?</p><br/><p>“Stop…rest for a while. I can’t walk anymore!” Xia Yun Xi sat on a stone bench. Her hands rubbed her legs. Why is Nan Lin wangfu so big, ah?! Till when does she have to walk before she could see Feng Cang, ah?!</p><br/><p>Hong Ye squatted to massage Xia Yun Xi’s legs. All the way, Xia Yun Xi had been resting. The originally one-hour route was now more than two hours walk for her. Now, there’s still a great distance between this area and Tingsong building. According to Xia Yun Xi’s way of walking, they may not even reach it tonight.</p><br/><p>“Princess, if you continue to rest, when the chicken soup reaches wangye, it would be cold!”</p><br/><p>Hong Ye carefully reminded at a side. Hearing her mention the chicken soup, Xia Yun Xi immediately stood up. “Right, right, right, how could I forget that?! If the chicken soup gets cold, it won’t be tasty! Feng Cang’s body is not good, naturally he can’t eat cold things! Hong Ye, let’s go, let’s quickly go!”</p><br/><p>When Xia Yun Xi arrived at Tingsong building, her pair of legs were almost ruined. From young till now, Xia Yun Xi had never walked such a long way. This time, she broke this rule for Feng Cang.</p><br/><p>Originally, Xia Yun Xi wanted to enter the place directly, but she was blocked by Ruyi. Knowing that it wouldn’t be easy to see Feng Cang, Xia Yun Xi quickly adopted a gentle policy, “This little brother, bothering you to go inside and inform wangye; say that Dong Lu’s princess Yun is seeking a meeting.”</p><br/><p>“Wangye is dealing with the government affairs. He doesn’t allow anyone to disturb him.”</p><br/><p>“However, bengong4 has come a very long way to let wangye drink the soup bengong has personally boiled. This little brother, help a bit out and give a bit of convenience!” Xia Yun Xi gave Hong Ye a glance. Hong Ye immediately took out a silver ingot worth ten liang, and gave it to Ruyi.</p><br/><p>Ruyi didn’t reject and generously received the money. Originally, Xia Yun Xi thought that after getting the money, Ruyi would make way. She didn’t expect that he would still block the way in front of her and didn’t let her go in.</p><br/><p>“Wangye said that he doesn’t want to see anyone.”</p><br/><p>“You…” Seeing Ruyi receive an advantage and not give a convenience, made Xia Yun Xi’s face turn red. “Bengong is princess Yun. It’s your majesty who let me move into Nan Lin wangfu! You’re only a slave. Blocking bengong here, what kind of ability is that?! Get out of the way, bengong wants to see Feng Cang!”</p><br/><p>“Although I’m a slave, but I’m wangye’s slave and only listen to wangye’s orders.”</p><br/><p>Ruyi’s puffed face made Xia Yun Xi very angry. “Bengong boiled the chicken soup that wangye loves the most. You use all sort of excuses to not let bengong see wangye. Later, when the chicken soup gets cold, would you be able to bear responsibility?!”</p><br/><p>Hearing Xia Yun Xi say that made Ruyi laugh just once.</p><br/><p>“Who said our wangye loves chicken soup the most? If our wangye touched chicken meat, his whole body would get an allergy. In this life, he hates chicken the most, not to mention chicken soup. In this wangfu, there isn’t even one living chicken! Princess, where did you hear this? Haha, fortunately I blocked you. If you went inside, the moment wangye sees that it’s chicken soup, he would certainly turn the table over and think that you wanted to harm him!”</p><br/><p>Ruyi’s half true and half false words stopped Xia Yun Xi, “What? Wangye can’t eat chicken?”</p><br/><p>“I won’t lie to you! If I let you in, and because of this soup, wangye gets annoyed, I would also be punished.”</p><br/><p>After Ruyi said this, Xia Yun Xi began to somewhat believe it. It was clear that someone wanted to sabotage her!</p><br/><p>Thinking till here, Xia Yun Xi turned her head and glared at Hong Ye. Hong Ye was startled and immediately knelt in front of her, “Princess, this slave really heard it from this wangfu’s people. Even if this slave has a very big gut, but this slave wouldn’t dare to fool princess, ah!”</p><br/><p>“It’s really not you?” If you said that Xia Yun Xi’s heart was a calm water, then Ruyi’s words were like a small stone. Throwing it and with a ‘splash’, a circle of ripples would appear.</p><br/><p>“Princess, this slave, like princess had just entered wangfu not long ago. How would this slave know that wangye is allergic to chicken?! This slave followed you for so many years, presumably princess knows more than anyone what kind of person this slave is!”</p><br/><p>Although Hong Ye had followed Xia Yun Xi since little and was her confidante, but after meeting with Feng Cang’s matter, Xia Yun Xi would still lose her reasoning. Immediately, two slaps went to Hong Ye’s delicate face, “Lowly slave! You set up bengong! Fortunately, this little brother told bengong the truth, otherwise, wouldn’t bengong have harmed wangye!”</p><br/><p>“This slave is innocent, ah! Princess, this slave is innocent!” Hong Ye wore two red handprints, her mouth kept shouting ‘innocent’ and her head knocked heavily on the ground. It so happened that this place had a stone road. Hong Ye only knocked three or four times, which made her head already swell up like a purple bag.</p><br/><p>Hong Ye kept shouting ‘innocent’. Her intonation was tearful. Xia Yun Xi wasn’t moved because of this. Her eyes stared at Tingsong building. She wanted to make trouble to cause Feng Cang to come out.</p><br/><p>It was just, Xia Yun xi calculated wrong. Feng Cang knew that she was about to come, so he had long left wangfu. Now, it was only Xia Yun Xi standing foolishly outside Tingsong building.</p><br/><p>After waiting for a long time, not a sound came out of the building. Xia Yun Xi got anxious. She had sacrificed Hong Ye for Feng Cang. Hong Ye’s head was already broken because of the knocks. Could this still not move Feng Cang? He refused to come out and take one glance at her?</p><br/><p>Although it had been some time since she’d arrived at Bei Zhou, but Xia Yun Xi didn’t even get to see Feng Cang’s face. So, she’d boiled chicken soup and brought it over. She didn’t think that this message was wangfu’s slaves fooling her.</p><br/><p>Xia Yun Xi knew that Hong Ye was not to blame. However, to see Feng Cang once, she couldn’t not use the trick of injuring oneself to gain the enemy’s confidence. Xia Yun Xi wanted to let Feng Cang know through punishing Hong Ye, that as long as the matter was related to him, she would fully protect him and she hoped to move Feng Cang’s heart. However, it seemed that Feng Cang doesn’t allow himself to be pushed around.</p><br/><p>The pair of master and servant in front of him couldn’t help but make Ruyi feel sick. He had never seen such a master. When meeting with things, she would let the slave block it! Seeing that Xia Yun Xi got impatient from waiting and wanted to rush inside, Ruyi pulled out his sword without a trace of politeness and stopped in front of Xia Yun Xi.</p><br/><p>“Presumptuous!” Seeing Ruyi use his weapon, Xia Yun Xi’s expression turned dark, “Do you know who bengong is? You actually dared to use force on bengong!”</p><br/><p>“You’re a princess, but my master is wangye! Wangye said to not allow anyone to put one step inside Tingsong building; otherwise, kill without pardon! Princess, don’t force me!”</p><br/><p>From Xia Yun Xi’s point of view, Ruyi was just a slave. He was so humble, he couldn’t even be compared to ants. Now, he was the fox exploiting the tiger’s might. He kept saying that it was Feng Cang’s meaning and blocked her outside of Tingsong building. This was obviously stopping her and not wanting her to see Feng Cang.</p><br/><p>The fox exploiting the tiger’s might: use powerful connections to intimidate people</p><br/><p>“Get out of the way! Bengong wants to see wangye!” Xia Yun Xi wasn’t scared. Since she wasn’t afraid of Ruyi, she wanted to force her way in. The next moment, a cool air appeared on her neck. It turned out that Ruyi’s sword was already on her neck. Just a bit closer would’ve cut her beautiful throat and let her become a corpse.</p><br/><p>The small palace maid who’d carried the chicken soup, the moment she saw this situation, she was so scared that her hand drooped. The food tray in her hand fell on the ground. The chicken soup spilled and sprinkled all over the place.</p><br/><p>“Princess, don’t get angry!” Hong Ye found that the momentum wasn’t right. She quickly stood up and pulled Xia Yun Xi.</p><br/><p>“Princess, here is Bei Zhou. Everyone knows that Nan Lin wang is temperamental. If you offend him, maybe…,” Hong Ye didn’t finish her sentence, but she told Xia Yun Xi the truth. This is Feng Cang’s territory. You, ah, should act a bit more leisurely. After all, there were so many rumors about Feng Cang. Even if he really killed Xia Yun Xi, at this time, no one would come save her.</p><br/><p>“Humph!” Xia Yun Xi stomped and glared ferociously at Ruyi, “You wait! When bengong becomes Nan Lin wangfei,5 bengong will let you see (suffer)!”</p><br/><p>Ruyi’s obstruction made Xia Yun Xi even more determined to see Feng Cang and become his woman. He’s just a small guard and dared to be so arrogant. She must become Feng Cang’s woman. By then, she’ll let Ruyi suffer and avenge for today’s humiliation!</p><br/><p>Xia Yun Xi left angrily. As she was leaving, she moved too quickly and stepped on her skirt. Like eating dog’s poop, she fell on the ground, making Ruyi laugh out loudly.</p><br/><p>“Princess!” Hong Ye and the small palace maid quickly stepped forward to support Xia Yun Xi. They didn’t expect that the moment she got up, the first thing she did was give each one of them a slap in the face. Then, she turned her head and glared once at Ruyi.</p><br/><p>“Let’s go!”</p><br/><p>Xia Yun Xi had never received such humiliation. The one who gave her grimaces of displeasure was just a slave. How could the anger be eliminated from Xia Yun Xi’s heart?</p><br/><p>After returning to Guanyu building, Xia Yun Xi was already tired half to death. Plus the fact that she was humiliated, made her angry and annoyed. Her charming face was very red.</p><br/><p>“Hong Ye, when will eldest senior brother and third senior brother arrive?”</p><br/><p>“Princess, sir Misha and sir Jia Lan must be on the way. Sir Misha is unable to move freely. Presumably, they will be delayed for some days.”</p><br/><p>“Humph!” Xia Yun Xi threw the porcelain cup onto the ground. “When eldest senior brother and third senior brother arrive, I will let them see! Feng Cang is mine. No one can stop my determination to become Nan Lin wangfei! This man is mine. I will definitely not give up!”</p><br/><p>Regardless of how ugly Xia Yun Xi cursed, Feng Cang couldn’t even hear it. At this time, he was at Long Autumn palace, keeping Murong Qi Qi company.</p><br/><p>Ever since Feng Xie disguised himself and entered Long Autumn palace with Murong Qi Qi, he spent all his time accompanying Wanyan Ming Yue. Feng Xie wanted to make up for the many days and nights he had been separated from Wanyan Ming Yue. He also hoped that Wanyan Ming Yue would wake up quickly from the deep sleep and let their family be reunited.</p><br/><p>Feng Xie was like this, and Feng Cang and Murong Qi Qi also thought like that. The two also freed as much time as possible to take turns and keep Wanyan Ming Yue company.</p><br/><p>Murong Qi Qi and Jin Mo also prepared a herbal tea created specficially for Wanyan Ming Yue. Plus, Feng Xie personally fed liquid food to Wanyan Ming Yue.</p><br/><p>Feng Cang coming to Long Autumn palace; firstly, was to accompany Murong Qi Qi. Secondly, was because he didn’t want to see Xia Yun Xi. Now, Xia Yun had taken the imperial decree and moved into Nan Lin wangfu. If something happened to her, he would become the biggest suspect. So, Feng Cang temporarily hid from this ‘plague’.</p><br/><p>However, today, Feng Cang calculated wrongly. Because after Xia Yun Xi hit the wall at Tingsong building, she rested for a while and then went to the palace. Her purpose was to find Murong Qi Qi.</p><br/><p>After returning to Guanyu building, the more Xia Yun Xi thought about it, the angrier she got. She’s the dignified Dong Lu’s princess. She was actually played by those servants of wangfu. Firstly, she got the wrong information. Then, a sword was directly put on her neck by Ruyi. This made her not be able to swallow this anger, no matter what.</p><br/><p>However, now she’s alone without any help in Bei Zhou and no one to support her. Feng Cang didn’t even want to see her. This really made Xia Yun Xi’s heart hurt. In pain, Xia Yun Xi suddenly remembered Murong Qi Qi.</p><br/><p>Regardless if the rumors from the outside were true or false; no matter if the relationship between Murong Qi Qi and Feng Cang was impossible to unravel, but at least, she’s Feng Cang’s biological little sister. They had blood ties that couldn’t be severed. If she could work on Murong Qi Qi and get Murong Qi Qi’s support, maybe, it would be easier to deal with Feng Cang.</p><br/><p>Thinking till here, Xia Yun Xi soaked in a bath and washed away the tiredness from her body. She put on new clothes and went to the palace.</p><br/><p>“Princess, Xia Yun Xi is asking to see you!”</p><br/><p>Murong Qi Qi had just come from the underground palace with Feng Cang. Su Mei came to them and said that Xia Yun Xi had arrived. The moment Murong Qi Qi heard this, she exchanged a glance with Feng Cang. This woman really travelled everywhere. She had actually come to Long Autumn palace.</p><br/><p>“Cang, isn’t it better if you withdraw for a moment?! I fear that after that infatuated flower sees your ‘countenance of a flower, face like a moon’ appearance, water would flood Long Autumn palace and make this place become full of saliva.”</p><br/><p>Countenance like a flower, face like a moon: very beautiful</p><br/><p>Murong Qi Qi’s words revealed a sour taste. She looked carefully at this man’s extraordinary and devilishly beautiful face. She sighed deeply. Why be so devilishly beautiful, ah? Fondling the flowers and trampling the grass everywhere. It would take a long time to shoot all those small flies away.</p><br/><p>Fondle the flowers and trample the grass: womanize</p><br/><p>How could Feng Cang not understand Murong Qi Qi’s gaze? He pulled her into his arms. A deep kiss locked her lips. He used action to express his true feelings.</p><br/><p>Su Mei saw this couple kiss like there was no one around, and her face got red. Now, it’s during the day. Miss and guye6 are already like this…Cough, cough, really didn’t pay attention to the location! At a side, there’s still her, this unmarried girl! They’re not afraid to lead her astray!</p><br/><p>“Is Qing Qing satisfied?” After a long time, Feng Cang let go of Murong Qi Qi’s lips. Looking at her swollen pinkish lips and her slight panting, Feng Cang’s finger brushed over Murong Qi Qi’s sideburn, “Be good! Wait for me at night!”</p><br/><p>Feng Cang’s words let Su Mei’s face burn utterly red. Really, shy to death! Miss and guye are too much of that!</p><br/>\n</div>"}