{"title": "Chapter 159 Bai Yi Yue meeting with danger", "id": 159, "volume": 2, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-159-bai-yi-yue-meeting-with-danger", "volume_title": "Volume 2", "body": "<h1>Chapter 159 Bai Yi Yue meeting with danger</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 159 Bai Yi Yue meeting with danger</p><br/><p>Jingting mountain, although it’s called a mountain, but it was in fact a small hill. Bei Zhou is flat. Therefore, such a hill was extremely rare. They put the name ‘mountain’ on it and became a good place to sightsee.</p><br/><p>Bai Yi Yue arrived at the foot of Jingting mountain, the location written in the invitation. Today, the weather was very good. The spring breeze blew slowly. Although there was still a slight coldness, but it didn’t have the winter’s chill anymore. It made people feel a lot more comfortable.</p><br/><p>The carriage stopped at the foot of the mountain. Bai Yi Yue got off the carriage. The road going up from the foot of the mountain was made from stones. It was twisted and rugged all the way till the top of the mountain. You could see the so-called top with one glance. Above the top was a small pavilion with red glazed tiles. It was particularly eye-catching in the vast of green.</p><br/><p>“Miss, don’t you want this slave to follow you?” Bai household’s servant Bai Qi stood next to the carriage. He had a slender figure and was Bai Yi Yue’s coachman.</p><br/><p>“No need! It’s just a few steps! Wait here for me!” The invitation was written by Murong Qi Qi. Bai Yi Yue didn’t harbor any suspicions. After letting Bai Qi wait for her at the foot of the hill, she walked up, step by step.</p><br/><p>There were surprisingly very few people around. Occasionally, she could see one or two. At this time, it’s a bit early to go for a hike in spring. When the weather turned warm in April and May, then that’s the best to go for a hike. Now, it was a bit cold and there were only some flower buds. The spring mountain scene couldn’t be seen.</p><br/><p>At the top of the mountain, Misha gently tapped the handle of the wheelchair. From the moment Bai Yi Yue appeared at the foot of the mountain, his heartbeat quickened. Looking at the woman in white slowly climb the mountain and get closer and closer to him, Misha’s heartbeat also gradually jumped to his throat.</p><br/><p>Are you Yi Lian? Misha’s throat was a bit dry. He licked his lips. The rhythm of his finger tapping also accelerated.</p><br/><p>When Bai Yi Yue was almost at the top of the mountain, Xia Xue came to Misha’s side, “Young master, she’s about to arrive. Should we hide?”</p><br/><p>“Good!”</p><br/><p>Misha nodded. Xia Xue pushed Misha and left the pavilion. They hid in the woods.</p><br/><p>Bai Yi Yue’s cheeks were red after walking to the top of the mountain. She took out a handkerchief and wiped the sweat on her forehead. She also used the handkerchief to gently fan herself.</p><br/><p>Although Misha was not far away, but their hiding place was completely covered. Bai Yi Yue didn’t realise that there was someone peeping at her. Hiding behind a tree, Misha carefully looked at Bai Yi Yue. He wanted to find Yi Lian’s shadow in her.</p><br/><p>“Young master, is it miss Yi Lian?” After waiting for a long time and seeing that Misha still hadn’t spoken, Xia Xue gently asked.</p><br/><p>“Let them try…,” As always, Misha didn’t directly answer Xia Xue. Instead, he let Xia Xue go prepare. A whistle was sent from Xia Xue’s mouth. Suddenly, ten people surrounded the pavilion.</p><br/><p>Originally, Bai Yi Yue had sat down to take a rest. After hearing the whistle, she wondered why it happened when in front of her appeared more than ten men. Her heart immediately became alarmed.</p><br/><p>“What do you want?” Bai Yi Yue put her hand on the sword at her waist. She looked vigilantly at these people.</p><br/><p>“Little lady, what are you doing here alone? Are you waiting for this big brother, ah?”</p><br/><p>A heavy and big man sat lecherously beside Bai Yi Yue. He put his hand on Bai Yi Yue’s shoulder, but she dodged it. “Be a bit more respectful!” Bai Yi Yue frowned. She turned and wanted to go down the mountain, but she was stopped by five people</p><br/><p>“Beautiful little lady, how come you just came and already want to leave, ah?! Spend more time with us, ah! Your lover didn’t come, there’s us to keep you company, ah!”</p><br/><p>Ten people surrounded Bai Yi Yue. On everyone’s face was a dark smile, making the restlessness in Bai Yi Yue’s heart gradually expand. Bai Yi Yue wasn’t a fool. These people must’ve hidden here long ago and she was presumably their goal.</p><br/><p>However, wasn’t the one who invited her Murong Qi Qi? Why didn’t Murong Qi Qi appear, but these rogues did? “Who sent you?” Bai Yi Yue looked at the heavy and big man. He looked like the head of this group.</p><br/><p>“Hehe, no one sent us, ah! We are brought together by fate from a thousand miles to meet each other! This is destiny, ah!” The heavy and big man smiled, revealing yellow teeth. A foul odor would emit from his mouth with every word he spoke, making people feel nauseous from the smell.</p><br/><p>The heavy and big man was talking about destiny, but his hand did an ‘action’ gesture. These ten people were like hungry wolves and jumped towards Bai Yi Yue.</p><br/><p>“Looking for death!” Although Bai Yi Yue had a gentle personality, but she wasn’t a weak woman that let other people bully her. The sword flashed in her hand. The two people who first rushed at her, immediately hugged their arm, rolled on the ground and cried for their father and mother. Blood flowed along the gap of their fingers. The muscle tendon of the right arms of these two people had been cut by Bai Yi Yue.</p><br/><p>“Tsk, tsk, didn’t know that little lady is very hot tempered, ah!” At first, the heavy and big man was shocked by Bai Yi Yue. Later, he spat on the ground and revealed a cruel smile, “This lord likes women who look gentle on the outside but are in fact hot-tempered. When doing ***, they can stand the toss and turns. This lord took a fancy to you! Brothers, go! Grab her, tonight, we’ll all get to eat!”</p><br/><p>“Oh, oh!”</p><br/><p>Those men who were, just now, shocked by the blood, after hearing this sentence from the big and heavy man, they acted like they’d been injected with chicken blood and began to fire up. Their gaze wandered unscrupulously all over Bai Yi Yue’s body as if they already could see how she would toss about in bed under their body, making them happy.</p><br/><p>“Bastard!” No matter how good Bai Yi Yue’s personality was, after hearing such humiliating words, she also got furious. She’s a lady of a prominent family. Usually, she came in contact with people at the same level as her status. When had she ever met such shameless rogues?</p><br/><p>“Hear that, her voice is like the oriole bird. Brother, look at her, she’s still a virgin, yo! We’re blessed!” The heavy and big man rubbed his hands. His eyes were full of desire as if he immediately wanted to peel off Bai Yi Yue’s clothes and get a taste of her.</p><br/><p>Being stimulated repeatedly by the heavy and big man and being overwhelmed by lust, people with big lustful guts rushed at Bai Yi Yue. Now, Bai Yi Yue didn’t have the gentleness of before. She directly cut off the tendons of the arms and feet of the person who came at her.</p><br/><p>“Ah…,” The injured people cried and rolled in front of the heavy and big man, but they were kicked away by him. “Rubbish! Useless! We’ve so many people and can’t even deal with a little woman! Have you all not eaten?!”</p><br/><p>“Boss, she knows martial arts. There’s a sword in her hand, ah!”</p><br/><p>There was already three people who had been injured. Especially the last one. The tendons of his hands and feet had all been severed. The bloody appearance of the wrists and ankles was very frightening, making the rest of the people feel very scared and afraid. At this time, they surrounded the heavy and big man.</p><br/><p>“Damn! Rubbish! Rubbish!” The heavy and big man once again spit. “Did you forget the old rule?!”</p><br/><p>The moment they heard ‘old rule’, the eyes of the rest of the people immediately lightened up. Everyone took out a rough hemp rope. Seven people surrounded Bai Yi Yue.</p><br/><p>Sensing something bad, Bai Yi Yue stomped and wanted to use qinggong1 to leave the top of the mountain. Unexpectedly, when she jumped, two ropes were thrown into the air at the same time. The rope intertwined in the air and blocked Bai Yi Yue’s path.</p><br/><p>‘Ceng…’ Bai Yi Yue’s sword cut off the rope. Two other ropes had been thrown by people. The ropes tied into a knot and wrapped around Bai Yi Yue’s ankles and dragged her back to the ground.</p><br/><p>“Let me go!” Bai Yi Yue didn’t expect that these people were able to trap her with only ropes. From the top to the foot of the mountain was still some distance. Even if she screamed from the top of her lungs, Bai Qi, who’s at the foot of the mountain, wouldn’t be able to hear her.</p><br/><p>These people heard Bai Yi Yue’s cries, but they had no intention of letting her go. The two people who held the ropes that were wrapped around Bai Yi Yue’s left and right hand, after a few turns, they bundled Bai Yi Yue’s arms together. At this time, Bai Yi Yue’s legs were also bundled tightly together.</p><br/><p>‘Pa!’ The hemp rope in the heavy and big man’s hand fiercely hit the hand which Bai Yi Yue used to hold the sword. Bai Yi Yue felt pain on her right hand. Her hand loosened. The sword fell and was kicked away by the heavy and big man. It directly spiked on the side of the trunk.</p><br/><p>“I told you, the strength of being united is great! Brother will only get to eat meat if we’re united!” The heavy and big man walked with a smile towards Bai Yi Yue. With every breath he took, that kind of rotten smell could make people faint.</p><br/><p>Bai Yi Yue turned her face to a side to not be face to face with him, to avoid that she would faint.</p><br/><p>Seeing this expression of Bai Yi Yue, the heavy and big man’s face sank. Presumably, he also knew that he had this bad breath disease. Now, Bai Yi Yue was being so obvious. It was a direct provocation to his self-esteem.</p><br/><p>“F***! Dislike this old one for being stinky! Tonight, this old one will use thins stinky mouth to bite your whole body!” The heavy and big man cursed fiercely.</p><br/><p>At this side, after Misha saw this scene, he frowned, “Xia Xue, what kind of people did you find? I only let you find people to test Bai Yi Yue’s skill. Why are the people you found such hoodlums and ruffians?”</p><br/><p>“Young master, I couldn’t request people at such a short period of time…,” Xia Xue’s eyes flashed a strange light, but the expression on her face was more respectful than usual.</p><br/><p>Xia Xue’s explanation made Misha’s expression get a bit better, “Go, help that girl. As for those hoodlums…kill them all! they’re disgusting!”</p><br/><p>Hearing these words from Misha, Xia Xue’s eyes lightened up, “Young master, she isn’t miss Yi Lian?”</p><br/><p>“No…,” Misha shook his head disappointedly. He didn’t look at Bai Yi Yue anymore, but he looked at the vast land far away. “Yi Lian won’t easily take action. If she takes action, no one will live. Bai Yi Yue isn’t Yi Lian. Yi Lian…not everyone can insult her!”</p><br/><p>The moment she heard that Bai Yi Yue wasn’t the person Misha was looking for, Xia Xue’s heart immediately relaxed. As long as it isn’t Yi Lian it would be good!</p><br/><p>Although when Misha mentioned Yi Lian, his tone would be so gently, so gentle that it made her jealous. However, as long as they don’t find Yi Lian, she could stay one more day at young master’s side. It would be the best if this Yi Lian never appears. Then, she could continue to serve Misha…</p><br/><p>Being invited to Jingting mountain by Murong Qi Qi, in the end, such a gang of hoodlums appeared, was really outside of Bai Yi Yue’s expectations.</p><br/><p>What happened in between? Could these people be sent by Murong Qi Qi? If it was true, why would she (MQQ) treat her like that?</p><br/><p>Bai Yi Yue couldn’t remember when she and Murong Qi Qi had incurred hatred. Aside that her tone was a bit harsh before and that she refused to get in touch with her (MQQ), she (BYY) didn’t do anything too overboard. Could Murong Qi Qi’s tolerance be so small?</p><br/><p>Thinking till here, Bai Yi Yue shook her head. Although, the time she spent with Murong Qi Qi wasn’t much, but the girl who was able to compose &lt; A glance at the mundane world&gt;, how would she be someone with such a small tolerance?! Someone was certainly behind this!</p><br/><p>It was just, time didn’t allow Bai Yi Yue to think about these. A burst of foul odor came at her. the two big purple lips of the heavy and big man came at Bai Yi Yue.</p><br/><p>“Ou…,” Bai Yi Yue didn’t hold it. She almost vomited the things she ate in the morning.</p><br/><p>“Bitch!” Originally, the heavy and big man wanted to suck Bai Yi Yue’s cherry lips and get a taste of them, he didn’t expect that other party retched. His interest was completely gone.</p><br/><p>He raised his hand. The heavy and big man wanted to give Bai Yi Yue a slap on the face, but his hand was juts raised and didn’t fell, suddenly he held his left hand and knelt on the ground.</p><br/><p>Looking again, the hand of the heavy and big man had been cut off by someone. That cut off hand lay bloodily on the ground. It twitched slightly and was still emitting heat, making people who watched it feel frightened.</p><br/><p>‘Sou, sou…’ two sounds appeared. The rope on Bai Yi Yue’s body was cut. The sword that was spiked on the tree trunk returned to her hand once again.</p><br/><p>“Why is it you?”</p><br/><p>When Bai Yi Yu saw the person who came, she was so surprised that she shouted. Wasn’t this person Ruyi the one who fought with her in the ring?! Why did he appear here?</p><br/><p>Ruyi didn’t waste time to talk nonsense. He threw a smoke bomb on the ground. With a ‘boom’ sound, it exploded. At this time, he pulled Bai Yi Yue’s hand and rushed down the hill.</p><br/><p>The loud noise on the top of the hill made Bai Qi at the foot of the hill surprised. Thinking abut that Bai Yi Yue was still at the top of the hill, Bai Qi quickly flew up the mountain. Now, Ruyi had already taken Bai Yi Yue to halfway of the hill.</p><br/><p>Maybe because they run in a rush, the two people didn’t realize that Ruyi’s hand was tightly wrapped around Bai Yi Yue’s small hand. Until when they met Bai Qi, Bai Qi shouted, “Let go of our family’s miss!” And he came with a sword towards them, that these two people realized that their hands were sweetly ‘entangled’ together.</p><br/><p>“Aiya…,” Bai Yi Yue blushed. She quickly pulled her hand out. Bai Qi’s sword was already in front of Ruyi.</p><br/><p>“Bai Qi, stop!” Bai Yi Yue shouted, but it was already too late.</p><br/><p>Seeing Bai Qi’s sword almost hurt Ruyi, Ruyi folded his arms and held Bai Qi’s sword in his hand. “Ha!” Ruyi shouted once. He glared and his face got red. ‘Bang, bang, bang…’ Bai Qi’s sword had been jolted into two just like this, making Bai Qi stunned.</p><br/><p>Very thick inner force! A hint of admiration flashed through Bai Qi’s eyes.</p><br/><p>“Bai Qi. he’s not a bad guy!” Bai Yi Yue anxiously came before Ruyi. “Are you fine? Did you get hurt? I’m sorry!”</p><br/><p>“It doesn’t matter!” Ruyi shook his head and gave an honest and simple smile. The broken sword fell on the ground and made a ‘kuangdang’ sound. “I just broke his sword!”</p><br/><p>“Bai Qi, he’s my savor!” Bai Yi Yue told Bai Qi what had happened at Jingting mountain. Bai Qi got embarrassed and quickly bowed at Ruyi, “Thanking her for saving our eldest miss! If it wasn’t because hero, our miss would’ve been bullied by the villains! Bai Qi was reckless and didn’t distinguish between the right and the wrong. Bai Qi almost injured hero. It’s Bai Qi’s fault! Asking hero for forgiveness!”</p><br/><p>For many generations, Bai Qi had been Bai household’s servant. Because of his loyalty, he had been given the surname ‘Bai’ by his master and because he was ranked as the seventh brother, so he’s called Bai Qi. Now, Bai Qi knew the truth, he felt very guilty. Fortunately, he hadn’t injured Ruyi or else he would’ve feel guilty for life.</p><br/><p>Bai Qi (): literal meaning is white seven.</p><br/><p>“No problem! You didn’t hurt me. not to mention, I ruined your sword. It could be considered an offset,” Ruyi also cupped his fists and bowed.</p><br/><p>Seeing that Ruyi was so courteous and didn’t care for his (BQ) rudeness, Bai Qi had an even more favorable impression of Ruyi, “Our miss received princess Zheng Guo’s invitation and came to enjoy the flowers at Jingting mountain. We didn’t expect that such a thing will happen…”</p><br/><p>After Bai Qi said that Ruyi was more bewildered. It was simply impossible for Murong Qi Qi to invite Bai Yi Yue, ah!</p><br/><p>“I’m from Nan Lin wangfu.2 As far as I know, princess is at the palace keeping empress dowager company. She didn’t mention that she had an appointment with someone. Where did miss Ba get the invitation?”</p><br/><p>“Someone sent the invitation to my home!” Bai Yi Yue took out the invitation and handed it to Ruyi.</p><br/><p>The moment he saw the invitation, Ruyi understood, “This invitation is not our Nan Lin wangfu’s!3 Perhaps miss Bai doesn’t know, Nan Lin wangfu had special invitations. Every invitation has wangye’s 4 seal. Princess’s invitation also has princess’s seal. Besides, this is not princess’s handwriting.”</p><br/><p>Although, Ruyi only occasionally saw the songs Murong Qi Qi wrote, but with only two to three lines of words, Ruyi remembered Murong Qi Qi’s handwriting. That was why he could be so certain now.</p><br/><p>“Someone certainly pretended to be princess and invited miss Bai here. Our princess certainly didn’t send such an invitation!”</p><br/><p>Ruyi was so sure also confirmed Bai Yi Yue’s previous thought. Murong Qi Qi would certainly not do such a tasteless and lowly thing.</p><br/><p>At the peak of the mountain, when the smoke was cleared, everyone discovered that Bai Yi Yue was gone. The heavy and big man hugged his cur off arm. His head was full of cold sweat. Someone cough because of the smoke. The heavy and big man straightly kicked that guy’s ass. “what ass are you coughing for, ah?! The person already escaped! Are you still not going to chase?! Catch that lady back for me!”</p><br/><p>Just when the heavy and big man’s group was about to chase after Bai Yi Yue, Xia Xue appeared in front of them.</p><br/><p>Although the heavy and big man was in much pain, but when he saw that it was the girl who gave him silver before, his face was full of flatter, “Lady, we didn’t do the thing well. It’s our fault. But don’t worry, we will certainly catch that bitch. By then, we can ensure that you will be satisfied!”</p><br/><p>“Humph!” Xia Xue humphed once lightly. The people saw a silver light flash by. The smile of the heavy and big man froze there. After a few seconds, suddenly a burst of blood sprayed out. The head of the heavy and big man fell on one side and completely separated from his neck. A very round head rolled on the ground and was contaminated a thick layer of dust.</p><br/><p>“Boss!” The person beside him cried from surprise, but he didn’t have the time to shout more. His throat had already been cut off by Xia Xue’s sword.</p><br/><p>“Quickly run!”</p><br/><p>Finally, a clever person saw that Xia Xue wanted to silence them. He immediately run. Those people who were injured before, naturally was behind. In a very short while, they became a dead soul under Xia Xue’s sword.</p><br/><p>“Help! Help!” Someone ran very hard. He wanted to even put the strength of drinking milk in use, but in only a blink of eye, Xia Xue was in front of him. Seeing Xia Xue’s cold eyes with the aura of death in them, his whole body trembled. His voice stuck in his throat. He couldn’t make a sound. The next moment, he became a dead man.</p><br/><p>In just a moment, ten people were lying on the ground. The blood merged into a trickle on the gray-yellow land. Then the blood infiltrated into the thick soil and dyed it into dark red.</p><br/><p>Hearing someone shout to save him on the hill, Ruyi and Bai Qi’s expression sank. They both looked at Bai Yi Yue. Bai Yi Yue knew that these two people want to go up and find out exactly what had happened. She also wanted to know who framed Murong Qi Qi to calculate her (BYY), “Let’s go! Let’s go up and take a look!”</p><br/><p>When the three people reached the top of the hill, they saw corpses lying disorderly. They counted. It was exactly ten corpses. It was the same number as the people from before.</p><br/><p>Ruyi and Bai Qi checked everyone and shook their head at Bai Yi Yue. All these people died in such a short time. Besides, it was killed by one stroke. “Who was it?” This question of Bai Yi Yue was the thoughts of Ruyi and Bai Qi.</p><br/><p>Who was it? In such a short time, he/she killed ten people. Besides, every stroke was a killing stroke. Who was it that acted so viciously? These questions lingered in the head of the three.</p><br/><p>Ruyi and Bai Qi looked around. Ruyi discovered traces of two rows of wheels pressed on the grass. Looking at the appearance of the grass; this trace seemed to be new. Could it be done by this mysterious person?</p><br/><p>Until the afternoon, did Murong Qi Qi got to know what happened to Bai Yi Yue at Jingting mountain. She immediately hurried out of the palace and arrived at Nan Lin wangfu.</p><br/><p>“Yi Yue, are you alright?!” After seeing Bai Yi Yue, Murong Qi Qi’s first words were her concern about Bai Yi Yue’s safety. Those alienation of Bai Yi Yue from before, Murong Qi Qi did as if nothing had happened. She was only concerned about if Bai Yi Yue was hurt.</p><br/><p>Murong Qi Qi’s words and her anxious demeanor let Bai Yi Yue’s heart got warm. Aside from the warmth, she also felt guilt and self-blame. She felt that she was too tangled in the past and too small belly, chicken’s gut, causing her to almost lost Murong Qi Qi, this good friend.</p><br/><p>Small belly chicken’s guts: narrow-minded</p><br/><p>“I’m fine; thanks to Ruyi arriving in time.”</p><br/><p>Only when Bai Yi Yue was in the carriage did she got to know that, that time after she left, Murong qi Qi asked Feng Cang to let him send Ruyi to protect Bai Yi Yue secretly. These past few days, Ruyi had been following her in secret. However, this morning, when Ruyi went to Bai residence to work, he didn’t find her. After inquiring did he got to know that Bai Yi Yue went to Jingting mountain. So, he immediately rushed there. He was just in time to save her.</p><br/><p>“If it wasn’t because Ruyi arrived in time, I’m afraid…”</p><br/><p>Bai Yi Yue didn’t dare to go think of those things. Recalling that nauseating face of the big and heavy man, Bai Yi Yue wanted to vomit. Especially when she thought about the rotten smell that came from his mouth, Bai Yi Yue shivered slightly.</p><br/><p>Although at that time, she didn’t feel afraid, but recalling it, Bai Yi Yue felt very frightened. She lived in an excellent environment and the most people she came in touch with were nobilities and officials. Even when she took charge of the family’s business, the people she met with were mostly decent people. She had never encountered this sort of people.</p><br/><p>If Ruyi didn’t arrive and Bai Qi at the foot of the hill also didn’t know what had happened, perhaps, she would’ve been…by that group of people. Bai Yi Yue shuddered.</p><br/><p>“Everything is fine now! Yi Yue, you’re safe now!” Feeling Bai Yi Yue’s whole body get cold, Murong Qi Qi held her (BYY) small hand. She gently rubbed it, “Don’t be afraid, don’t be afraid! I’m here!”</p><br/><p>Murong Qi Qi’s voice was like a gentle light and slowly healed Bai Yi Yue’s cold. She comforted for a long time and also poured warm honey water for Bai Yi Yue. Bai Yi Yue gradually calmed down.</p><br/><p>“Qi Qi!” Bai Yi Yue held Murong Qi Qi’s hand. Her eyes were full of apologies, “I’m sorry. Before, because of my own things I was in loggerheads with you and almost lost you as my friend. I’m really sorry!”</p><br/><p>Murong Qi Qi had let Su Mei go investigate about Bai Yi Yue’s matter. The information let Murong Qi Qi understand Bai Yi Yue’s difficulties and also could understand the ‘abnormalities’ of this friend. Now, Bai Yi Yue mentioned it at her own initiative made Murong Qi Qi feel assured. It seemed that she (BYY) really took her as a friend!</p><br/><p>“Yi Yue, are we good friends?! You also know that I don’t have many friends in this world. You are one of them. I don’t want to the matter of the previous generation affect our friendship. I want to be friends with you!”</p><br/><p>Murong Qi Qi’s sincere eyes let Bai Yi Yue felt more guilt. After the guilt, Bai Yi Yue gave Murong Qi Qi a generous smile and clasped their hands together, “I’m willing to be your friend!”</p><br/><p>The others were very happy that Murong Qi Qi and Bai Yi Yue restored their feelings of the past. Especially Su Mei; she was so happy that she clapped. “So great! Miss Bai, in the future, you need to come see our miss frequently, yo!”</p><br/><p>“Mm! alright!” The people around Murong Qi Qi were so warm made Bai Yi Yue’s face have more smiles.</p><br/><p>After the talk and laughter, Murong Qi Qi’s face sank, “Su Mei let people go investigate about today’s matter! Someone used my name to do such a thing. I let people go investigate! I must find the person behind this!”</p><br/><p>Before, Murong Qi Qi was afraid that Bai Yi Yue will think about the bad things, so she didn’t mention a word. Now, Bai Yi Yue restored her usual appearance. They have to investigate this matter.</p><br/><p>Seeing Murong Qi Qi so serious, Su Mei’s expression also sank, “Miss, don’t worry. We will definitely find the person behind this and get revenge for miss Bai.”</p><br/><p>While Su Mei was talking about revenge, how would she know that someone already set eyes on her?</p><br/><p>After confirming that Bai Yi Yue wasn’t Yi Lina, Misha felt very desolate. The whole way, he was silent and didn’t say a word. After returning home, he was still quiet. He just stared at the sky in daze. His gaze was very grave.</p><br/><p>Xia Xue felt much heartache seeing Misha like this. She wanted to go comfort Misha, but she didn’t dare to move forward. When Misha was quiet, he didn’t like being disturbed. This was his rule and Xia Xue understood it.</p><br/><p>Misha is Penglai Island’s grand disciple. Because of the inconvenience of moving his legs, many people took care of Misha on the island. However, those people had been sent away by Misha. In the end, Misha chose Xia Xue. There were two reasons for it. One was because her personality was cold and she didn’t talk much. Second was because she was obedient. What Misha said was what she would do.</p><br/><p>Xia Xue knew that the reasons Misha let her stay were because she wasn’t meddlesome and was obedient.</p><br/><p>She wanted to stay at Misha’s side forever. Therefore, these past six years, she developed her cold and detachment to the fullest. She became unfeeling and would say yes at every request of Misha. Besides, she will do them strictly according to Misha’s requirements.</p><br/><p>For example, Misha didn’t like to let women touch him. Aside from pushing the wheelchair, she tried not to come in contact with him as much as possible. For example, when Misha was in deep thoughts, he didn’t like to be disturbed. So, even if she wanted to hug Misha now and comfort him, but she still had to keep her cold appearance and stand with a straight back behind Misha. Even if she looked at his back in daze, she was motionless to avoid disturbing him.</p><br/><p>Where did it went wrong Misha looked at the blue sky and thought about the reason.</p><br/><p>Could it be because he was too conceited for thinking that because of the seven floor pagoda, he would be able to detect his Yi Lian? After all, a lot of content inside the test were things he and Yi Lain went through many times while training as a child. He only made some improvements to test who is Yi Lian. However, it looked like this approach didn’t seem feasible.</p><br/><p>Could it be that Yi Lian didn’t come to this world? Or perhaps, Yi Lian time-travelled into a child or someone of another age. Did he not consider every aspect enough?</p><br/><p>There are so many people in this mainland. If he searched like this, till when would he search? Could it be that only when he dies, he will find Yi Lian? Or was this perhaps heaven’s punishment? He and Yi Lian live in the same sky, but never let him see her again?</p><br/><p>If it was really like this, how cruel is it, ah?! He preferred to not be able to stand up again than to be separated from Yi Lian! In the previous life, he did wrong. Don’t torture him again like that in this life, alright?</p><br/><p>The more he thought, the more dispirited Misha became. If he couldn’t find Yi Lian, then what meaning does his life have?</p><br/><p>“Ah!” Misha fiercely beat his legs. His eyes were flushed, “Ah!”</p><br/><p>Misha’s cry surprised Xia Xue. Seeing him beat his injured legs like this, Xia Xue quickly grabbed Misha’s hands, “Young master, what’s the matter? Young master!”</p><br/><p>“F*** off!” Misha pushed Xia Xue away. He continued to beat his legs. He’s a waste of a person. Heaven already punished him by letting him unable to stand up. Why did it still need to hide his Yi Lian? Could it really be to let him be lonely for his whole life?!</p><br/><p>“Young master, don’t!” Although being pushed away by Misha, Xia Xue still crawled forward and grabbed Misha’s hand, “Young master, you will definitely find miss Yi Lian! You will definitely find her!”</p><br/><p>Xia Xue knew that the only thing in this world that can let Misha calm down was that name only…Yi Lian.</p><br/><p>Sure enough, under Xia Xue’s persuasion, Misha’s red eyes returned to their normal color, “Xia Xue, I can’t find her! She hid away! She certainly hates me very much. She hates me for killing adoptive father, hates me for killing her! But, I really love her, ah!”</p><br/><p>Seeing Misha like this, Xia Xue’s heart twisted in pain. She hated ‘Yi Lian’ even more. All was to blame her (YL). She caused young master to be like this. She caused young master to be so deranged! Everything is her fault!</p><br/><p>Although, she was thinking like that in her heart, but on her face, Xia Xue didn’t dare to show the slightest disrespect towards Yi Lian. Instead, she tried to advise Misha gently, “Young master, miss Yi Lian is certainly in a corner. She’s certainly waiting for you! As long as you be a bit more patient and take a little more time, you will certainly find her!”</p><br/><p>“Is what you said the truth?” Misha raised his head. That pair of innocent eyes was full of innocence and naivety like a child. Xia Xue looked at them and couldn’t help but nod. “It’s the truth. Young master, please believe me. I will never lie to young master!”</p><br/><p>“You’re the best…,” Misha said this one sentence long-drawn-out. This ‘you’re the best’ made Xia Xue burst in joy. “Young master, didn’t you say that Su Mei’s weapon was very special. Why don’t we investigate Su Mei? Maybe we can find a clue!”</p><br/><p>1. Qinggong: the ability to move swiftly and lightly at superhuman speed, and perform gravity-defying moves such as gliding on water surfaces, scaling high walls and mounting trees</p><br/><p>2. Wangfu: residence of the prince of first rank</p><br/><p>3. Wangfei: main consort/wife of the prince of first rank </p><br/><p>3. Wang/wangye: prince of first rank</p><br/>\n</div>"}