{"title": "Chapter 180 part1", "id": 180, "volume": 2, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-180-part1", "volume_title": "Volume 2", "body": "<h1>Chapter 180 part1</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 180 (Part 1) Returning to the country</p><br/><p>It turned out that the people of Penglai Island took meat as the main food and didn't like to eat vegetables. She strolled through whole Penglai Island and didn't see many families eat vegetables and fruits. Here, they used all kinds of meat, birds and animals to entertain guests, but no vegetables.</p><br/><p>The folic acid in vegetables and fruits is a very important nutrient. It plays a very crucial role during the pregnancy. The residents of the island liked meat and hated vegetables; plus, the fact that many people married their close relatives on the island, the cleft lips became a genetic disease and had been passed down through generations.</p><br/><p>Master Taixu couldn't understand what Feng Qi Qi said. \"Girl, what is the folic acid you talked about? Could it be that we will get it if we eat vegetables and fruits? Since it was like his, then why can't folic acid be made. Are you not a doctor?\"</p><br/><p>Master Taixu's words made it difficult for Feng Qi Qi. In the modern world, it is indeed possible to extract folic acid. However, in the ancient times, there were no advanced equipment. How could the folic acid be extracted?!</p><br/><p>\"Elder, I really don't have a way to make it. Moreover, there are some degree of poison in medicine. Instead of using drugs to supplement the nutrients the body needs, it's better to take it from food. This is more beneficial to the human health.\"</p><br/><p>Feng Qi Qi made very sense. Master Taixu nodded. \"Good! I will spread the two points you mentioned! First is to include fruits and vegetables into the diet. Especially pregnant woman must eat several vegetables and fruits daily. Secondly is that immediate families are forbidden to marry within three generations.\"</p><br/><p>\"Right! That's it! I believe that if you insist on it, there will be fewer and fewer children with cleft lips. The residents of the island would also become healthier.\"</p><br/><p>Feng Qi Qi couldn't think of other methods at the moment. She also didn't see those fruits and vegetables rich in folic acid on the island. They could only wait for people to send the seeds afterwards to Penglai Island. However, she made a nutrition list according to the diet of the residents on the island, let master Taixu sent it to each household and let the everyone adjusts their diet according to the list.</p><br/><p>After finding out the reason, Feng Qi Qi began to do surgery for the residents with cleft lips. The surgery wasn't difficult. It only required an assistant. Considering that in the future more children with cleft lips may be born who also needed the surgery, Feng Qi Qi specifically called Jia Lan in as her assistant. In fact, she wanted to teach Jia Lan how to perform the surgery of cleft lips. After all, after Feng Cang is cured, they still have to go back to Bei Zhou and couldn't continue to stay here. <em>Give a man a fish and you feed him for a day</em>!</p><ul><li><em>Give a man a fish and you feed him for a day; teach a man to fish and you feed him for a lifetime</em></li></ul><br/><p>When Jia Lan knew that Feng Qi Qi wanted to pass her valuable skills to him, he was very excited. It should be noted that in this era, these techniques were passed down from generation to generation. Moreover, it was usually passed to the boy and not the girl and also wouldn't be passed to outsiders. Feng Qi Qi actually passed it to him so generously; how could Jia Lan not be excited? Every day, he followed behind Feng Qi Qi and became more focused.</p><br/><p>Feng Qi Qi divided the residents with cleft lips into three groups. Among which toddlers younger than one year were classified into one group. She performed the surgery first one them.</p><br/><p>Due to the hurry, Feng Qi Qi didn't have much anesthesia. Fortunately, there are many Datura flowers at the cliff of the South Mountain. Feng Qi Qi let Su Mei and Su Yue pick them. After drying it, it was used for other drugs. It became anesthesia and solved the problem.</p><br/><p>The residents of the island were very surprised after they heard that the female holy doctor could cure the cleft lips through surgery. However, after listening to Feng Qi Qi explained the process of the surgery, those people who had hoped to cure the cleft lips, all backed down.</p><div><div></div></div><br/><p>\"Master, it's not that we doubt the ability of female holy doctor. It is that we had never seen any cleft lips surgery. If, if it was a failure, then wouldn't it ruin everyone?!\" An elder man on the island represented and expressed the thoughts of the residents.</p><br/><p>\"Yes, yes! No one had ever done the cleft lips surgery. How would we know if it would succeed?!\"</p><br/><p>\"This…\" Hearing everyone say this, master Taixu looked at Feng Qi Qi. To be honest, it was reasonable that everyone had this fear. After all, it was difficult for people to accept something unknown and they wouldn't cooperate easily.</p><br/><p>The residents of the island didn't cooperate. Feng Qi Qi also didn't know how to persuade them. Without a successful case, these people wouldn't believe her. They would only believe what their eyes see.</p><br/><p>\"I've a way!\" At this moment, a sweet voice could be heard. Feng Qi Qi turned and saw that the one who spoke was Xiao Mi.</p><br/><p>\"Beautiful sister, I've a way!\" Xiao Mi jumped to Feng Qi Qi and snuggled into her arms. \"I also have the cleft lips. Sister can cure me first. As long as I'm cured, it would mean that beautiful sister didn't lie. Everyone can believe beautiful sister then!\"</p><br/><p>The sudden emergence of Xiao Mi and her words undoubtedly helped Feng Qi Qi a great deal. Originally, master Taixu wanted to do this. He didn't expect that his good granddaughter mentioned it first. \"Right, girl, perform the surgery on Xiao Mi first! I believe you!\"</p><br/><p>Feng Qi Qi was very touched with master Taixu and Xiao Mi's support. She didn't expect that they believed so much in her. She didn't say anything else, Feng Qi Qi, Su Mei and Su Yue went to prepare for the surgery of Xiao Mi.</p><br/><p>For the room of the surgery, Feng Qi Qi specifically selected a room that was sunny and dry. Before the surgery, the entire room was completely disinfected.</p><br/><p>Feng Qi Qi, Jin Mo and Jia Lan wore surgical gowns and entered the room. On the bed, Xiao Mi who took the anesthesia was already in deep sleep.</p><br/><p>\"Let's start!\" Feng Qi Qi used high concentration of alcohol to disinfect Xiao Mi's upper lip. Then, she picked up a thin blade. \"Cooperate with me according to the steps I will be talking about!\"</p><br/><p>Feng Qi Qi took the blade and cut two times on Xiao Mi's lips. When the blood flowed out, Feng Qi Qi reached out and said, \"Give me the crochet needle and the baleen!\" Jin Mo quickly handed Feng Qi Qi the crochet needle with baleen on it. Jin Mo took over the blade in Feng Qi Qi's hand.</p><br/><p>Feng Qi Qi sewed the inside of the lips together. Her sewing skills were very great. Only in a blink of eyes, the inside of Xiao Mi's upper lips had been sewn together. The outer part of the lips was also sewn with the same stitches.</p><br/><p>Because the skin of the lips had been cut open, the two pieces of bloody meat were tightly connected by the stitching of the needles.</p><br/><p>\"Medicine!\" Feng Qi Qi reached out. Jia Lan handed her a small bottle. She poured an herbal plaster that was like a sheep's fat. She gently rubbed the herbal plaster on the wound. Originally, the blood was still flowing. After meeting with this herbal plaster, it immediately solidified.</p><br/><p>\"Carry Xiao Mi to the bed and let her take a rest. After the anesthesia loses effect, she would feel a bit pain. But, it's not a big deal. With my plaster, the lips would be fine after four to five days. Not to mention, a child's ability to recover is very strong. It won't take long before her lips will be the same as ordinary people’s.\"</p><br/><p>The whole surgery didn't take a long time. When Feng Qi Qi came out, master Taixu went anxiously to her. \"How is it? How did it go?\"</p><br/><p>\"The surgery was very successful, but the post-operative care should be paid attention to. I will personally take care of Xiao Mi. Don't worry!\"</p><hr/><br/><p>Sure enough, after the anesthesia dispersed, Xiao Mi woke up from pain. When she opened her eyes, she saw Feng Qi Qi. She (FQQ) was holding a fan and gently fanned her (XM). Feng Qi Qi's appearance made Xiao Mi's eyes wet. She said one word, \"Mother…\"</p><div><div></div></div><br/><p>\"Xiao Mi, you're awake!\" Feng Qi Qi was very happy that Xiao Mi woke up. \"Is it very painful? Bear with it a bit. Our Xiao Mi is a strong child. Hold it a bit. After the wound is healed, you will be able to speak and eat like before!\"</p><br/><p>\"Mother, woowoo, Xiao Mi misses you!\"</p><br/><p>Seeing Feng Qi Qi being so gentle and cared so much for her, Xiao Mi cried. Her small hands clutched Feng Qi Qi's clothes and refused to let go.</p><br/><p>Feng Qi Qi had long heard Xiao Mi's history from Jia Lan. Her parents suffered a storm during a fish trip on the sea and died on it. Because master Taixu and Xiao Mi's grandfather were friends, after Xiao Mi became an orphan, master Taixu took Xiao Mi in and treated her like his own granddaughter.</p><br/><p>Now seeing Xiao Mi keep calling \"mother\", a soft place in Feng Qi Qi's heart was also moved. This child surely missed her mother! Really a child who would let people love!</p><br/><p>Feng Qi Qi stayed with Xiao Mi the whole afternoon. She fed her and applied medicine for her. She also told Xiao Mi a lot of fairy tales.</p><br/><p>\"Beautiful sister, the Cowherd and the Weaver can only see each other once a year. They are so pitiful!\"</p><br/><p>\"The Little Red Riding Hood should not meet the wolf again!\"</p><br/><p>\"Snow White and the prince lived happily ever after. Where did the seven dwarves go to?\"</p><br/><p>Xiao Mi's innocent voice was continued heard from the room, letting Jia Lan's mouth be in a rising arc after he kept listening. Unexpectedly, that woman had such a gentle side…</p><br/><p>Until after Xiao Mi fell asleep did Feng Qi Qi gently withdrew her hand from Xiao Mi's. After covering her with a blanket, Feng Qi Qi went out of the room.</p><br/><p>At this point, the sun was already gone. Feng Qi Qi shook her sore neck. She didn't take two steps when her legs went soft.</p><br/><p>\"Be careful!\" A pair of hand supported her. Feng Qi Qi looked up and saw that the person was Jia Lan.</p><br/><p>\"Thank you…\" Feng Qi Qi thanked politely.</p><br/><p>\"Are you alright? It had been hard on you! You're pregnant and still need to do these things. In the future, if there's something, just call me!\" Jia Lan was really concerned. After seeing the tiredness from the woman's face, Jia Lan intended on helping her to her room. At this time, Su Mei walked over.</p><br/><p>\"Miss!\" Seeing that Feng Qi Qi was very tired, Su Mei quickly went forward and supported Feng Qi Qi. \"Miss, are you alright?!\"</p><br/><p>\"I'm fine. I'm only a bit tired. It would be fine after a rest.\"</p><br/><p>Before leaving, Feng Qi Qi said goodbye to Jia Lan. Jia Lan gestured with his hand and watched the pair of master and servant leave.</p><hr/><br/><p>When he went to the river of forgetfulness to give Feng Cang dinner, Jia Lan flew to below the waterfall. He sat on the large rock on the shore. While watching Feng Cang eat, he chatted with him. However, usually, it was him who talked. Feng Cang didn't talk much.</p><br/><p>At this time, it was evening. The temperature of the water in the pool was no longer as ablaze and had been quickly dropping. Feng Cang's face was still red. Now, it was beginning to turn white and even somewhat blue.</p><br/><p>\"Feng Cang, you have to hold on! Princess is still waiting for you!\" While speaking, Jia Lan admired Feng Cang very much. Even he didn't dare to touch the water of the river of forgetfulness easily. The temperature of the water changed greatly. Moreover, the stench would let people unable to bear with it. Let alone, soak in the water.</p><br/><p>\"I know.\" Feng Cang finally opened his mouth and said some words. \"Help me tell Qing Qing to let her take care of herself well. Do the surgeries slowly. I believe in her ability! Also…I miss her.\"</p><br/><p>After Jia Lan heard this sentence, he blushed. How could he pass the love words between this couple? It was just, Feng Cang already said it. He, this messenger should pass the words.</p><hr/><br/><p></p><div><div></div></div><br/>\n</div>"}