{"title": "Chapter 198 Skillfully winning people’s hearts", "id": 198, "volume": 2, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-198-skillfully-winning-people%E2%80%99s-hearts", "volume_title": "Volume 2", "body": "<h1>Chapter 198 Skillfully winning people’s hearts</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 198 Skillfully winning people’s hearts</p><br/><p>At night, Ming Yue Cheng stared at the roof of the room. Feng Qi Qi and Feng Cang was just in the room next to him. Through the wall, Ming Yue Cheng could imagine how Feng Qi Qi would sleep in Feng Cang’s arms.</p><br/><p>Although, he tried very hard to show that he didn’t feel anything and also wanted to pretend to be in love with Gu Yun Yao, but without the feelings and without the heart, no matter how he tried he couldn’t fake it. Time went by seconds after seconds. Ming Yue Cheng could hear Gu Yun Yao’s even breathing. That soothing rhythm seemed to remind Ming Yue Cheng that it was not early, and that he should rest.</p><br/><p>“Ay…” Ming Yue Cheng sighed deeply and closed his eyes. After the gu on Feng Xiao was solved, she would presumably return; return to that home of hers and Feng Cang’s. It was better if he grabbed the time to get along with her and help Feng Xiao get rid of the gu.</p><br/><p>Ming Yue Cheng had a small hidden motive in his heart. He had it from the moment he let Feng Xiao recognize him as godfather. Since he wouldn’t be intimate with any woman aside from her, he wouldn’t have children in this life. Nan Feng’s root couldn’t be broken at his generation. So, he wanted to pass the throne to Feng Xiao. Perhaps, this idea was his wishful thinking, but he had decided. In the future, no matter what method is used, he would abduct, Feng Xiao, his godson to Nan Feng.</p><br/><p>After wading through the mountains for two days, Feng Cang’s group finally arrived at the legendary residence of the Qiang tribe…White Bird Mountain.</p><br/><p>White Bird Mountain, as its name suggest, it was a mountain. Because there were many birds in the mountain it got the name White Bird mountain. Most of the north were plain fields. There were only a few mountains. The south had many mountains. White Bird mountain was steep. There was only a scattered and fragmented stone road. After many twists and turns, it was a road to the top of the mountain.</p><br/><p>The road was not easy to walk on. Until night did they arrive at the village of the Qiang tribe. The bamboo house of Qiang tribe were built in sky. They were one meter away from the ground. The moment the tribe’s people heard that the chief Gu De and great miss Gu Yun Wan had returned, they all went out too welcome them. Here, Feng Qi Qi clearly felt the enthusiasm of the Qiang tribe. Gu De’s prestige was high in the Qiang tribe. Many people came to great Gu De and Gu Yun Wan. Compared to them, Ming Yue Cheng, this emperor wasn’t as popular as them.</p><br/><p>After knowing that Feng Cang and the others were noble guests from the far away Bei Zhou, the people of Qiang tribe took out fine wine and delicious fruits to treat them. This simple ethnic minority set up a bonfire on the empty ground beneath the house. Men, women, children and elders dressed in clothes of their tribe, danced and sang to welcome these noble guests.</p><br/><p>“Have a taste of our specialty, grilled pine mushroom!” In front of Gu De was a grill. Various kind of foods were pierced through a thin hook and giving of an enticing scent.</p><br/><p>The food of the Qiang tribe were based on barbecue. During the barbecue, a special sesame oil and honey was brushed over the food. After the food was grilled, it was prepared according to the different tastes of the individual. The original sauce preserved the original taste of the food.</p><br/><p>“Have a taste!” Gu De handed a string of pine mushroom to Feng Cang. “See if it’s to your taste!”</p><br/><p>While Gu De was speaking, the people of the Qiang tribe looked at Feng Cang. They wanted to know what this person would do. Feng Cang took over the pine mushrooms from Gu De. He dipped it in the sauce and brought it to his mouth.</p><br/><p>“How is it?”</p><br/><p>“Very delicious! I like it very much!”</p><br/><p>After hearing Feng Cang, Gu De laughed out loudly. Those people of Qiang tribe also followed him with laughter.</p><br/><p>“You have been accepted!” Ming Yue Cheng carefully explained to Feng Qi Qi. It turned out that the worship Qiang tribe’s people had for food was far greater than everything. They thought that food was a gift from the nature. Only those who accepted the food of Qiang tribe would be regarded as friend. Just now, Feng Cang liked the pine mushroom. This was the biggest affirmation of Qiang tribe’s food. Those simple and honest people of the Qiang tribe accepted Feng Cang for such a simple reason.</p><br/><p>“Have a drink!” Gu De poured a cup of wine made from grapes to Feng Cang. “Let’s make a night of it!”</p><br/><p>“Let’s make a night of it!”</p><br/><p>The people of Qiang tribe raised their cups made from horns and cheered. The lively atmosphere affected Feng Qi Qi and the others. Wanyan Kang also raised his cup made from horns. “Cheers! Let’s make a night of it!”</p><br/><p>Wanyan Kang’s spirit was to the people of Qiang tribe’s taste. There were some girls of the Qiang tribe who pulled Gu Yun Yao and Su Mei to let them go dance. “I don’t know how to dance, ah!” Gu Yun Yao wanted to be modest but was dragged by Gu Yun Wan to the crowd. “Come, let’s dance together. Just follow the beat!”</p><br/><p>Su Mei was easy-mannered. Although, she couldn’t dance, but only after seeing it for a few times, she could follow these people. Feng Qi Qi held Feng Xiao. So, she only sat and looked at Su Mei and the others laughingly.</p><br/><p>“Mistress, go dance!” A girl with small braids came to Feng Qi Qi and invited her.</p><br/><p>“I need to take care of the baby!” Feng Qi Qi declined politely, but that girl refused to give up. “Mistress, you can give the baby to your husband! It was hard that you come be a guest at ours, come! Mistress is so beautiful. Your dance must also be very beautiful!”</p><br/><p>Feng Qi Qi still wanted to refuse, but Feng Cang took Feng Xiao from her arms. “Go, I will take care of the child!”</p><br/><p>“Alright!” Feng Cang was so considerate. Feng Qi Qi smiled and walked to the crowd.</p><br/><p>When Gu Yun Wan saw that Feng Qi Qi came over, she immediately shouted a slogan. Then, she said a large number of words that Feng Qi Qi couldn’t understand. Presumably, it was the dialect of the Qiang tribe. After listening to Gu Yun Wan, every one of the Qiang tribe cheered. Everyone made an empty spot in the middle. They clapped their hands and looked smilingly at Feng Qi Qi. There were also people who began to cheer.</p><br/><p>“Little Wan, what did you say?” Feng Qi Qi was a bit puzzled. Gu Yun Wan smilingly went forward and took Feng Qi Qi’s hand. “I told them that you’re a very beautiful and talented girl and was very good at dancing! So, everyone was welcoming your performance!”</p><br/><p>“Eh…” Feng Qi Qi went blank. She had been ‘sold’ by Gu Yun Wan.</p><br/><p>“Qi Qi, dance! I heard from Jin Mo that you can dance beautifully! The women of our Qiang tribe likes to dance very much. If you dance beautifully, everyone would like you!”</p><br/><p>Gu Yun Wan pulled Feng Qi Qi to a side and quietly added, “The people’s heart, ah. Qi Qi, if you want to get rid of the gu for Feng Xiao, you need to let everyone like you. Did you see? Everyone who sat at that side are elders! Even if you can pass the three tests, if the elders oppose, we still can’t cure the gu for Feng Xiao. At Qiang tribe, it’s not my father who has the final say. Everything should be voted on! Don’t underestimate these people. They all have voting rights!”</p><br/><p>Gu Yun Wan’s explanation let Feng Qi Qi began to understand that this tribe wasn’t as terrifying as the rumors made it to be. The Qiang tribe was good at using gu. Gu was a horrible creature in people’s heart. So, Qiang tribe was also a mysterious existence which makes people feel fear.</p><br/><p>However, after coming to White Bird mountain and getting to know the Qiang tribe in this short time, Feng Qi Qi discovered that the people of Qiang tribe were very warm and hospitable. Their hospitality was direct and simple. They were a simple ethnic group.</p><br/><p>Feng Qi Qi knew that Gu Yun Wan was helping her. She’s the great miss of Qiang tribe and was familiar with the characteristic of the Qiang tribe. She knew that in order to get the people of Qiang tribe’s recognition and support, they must use a way that the Qiang tribe liked.</p><br/><p>“If this is the case, then I will not be modest!” Feng Qi Qi whispered a few words in Gu Yun Wan’s ear. Gu Yun Wan nodded.</p><br/><p>Feng Qi Qi was dressed in red. Her hand held a red muslin. Gu Yun Wan retreated and took a drumstick from a man. She beat two times on the big drum that was as big as two people hugging each other, “Boom…boom, boom, boom…boom…”</p><br/><p>When the drums sounded, the field went quiet. All eyes were on the woman in red on the field.</p><br/><p>The bright moonlight shrouded Feng Qi Qi and plated her red dress with a silver layer.</p><br/><p>“Boom…boom, boom, boom…boom…” Feng Qi Qi followed the beat of the drums and waved the red muslin in her hand. She rose up in one bound like a fairy under the moon. Gu Yun Wan’s beat of drum was fierce like the drums on the battlefield. The rhythm was intense, sonorous and stirred the will of the people.</p><br/><p>The whole dance was without any assistance of music. There were only the fierce sounds of the drum. Feng Qi Qi was like a goddess of war and displayed that kind of passion and enthusiasm. Originally, women used flexibility as being beautiful, but Feng Qi Qi could couple strength and gentleness, adding a feminine factor to the fierce drum sounds.</p><br/><p>Ming Yue Cheng looked at Feng Qi Qi. He didn’t know what language he should use to express his current mood.</p><br/><p>This dance was probably Feng Qi Qi’s inner world! There was gentleness through her firmness without losing all the good qualities of a woman like her character. Such a dance, such a woman, how could people not love and not like?</p><br/><p>Like Ming Yue Cheng, the people of the Qiang tribe had also been attracted by Feng Qi Qi’s dance. This person was very beautiful. The soul of her dance was like the character of the Qiang tribe.</p><br/><p>They’ve lived on this land for generations. They used their way to fight against nature. They rooted here and strongly survived. Many people had sympathetic response from Feng Qi Qi’s dance. Many people began to beat the drums in their hands. They followed Gu Yun Wan’s rhythm to give background music to Feng Qi Qi.</p><br/><p>Shocking was the feeling Feng Qi Qi brought to Gu De. This whole way, the feeling Feng Qi Qi gave Gu De was that of a gentle and virtuous woman. He didn’t expect Feng Qi Qi to have a valiant, proud and wild side.</p><br/><p>Feng Qi Qi danced in the sky like an elf. When she flew up, her toes stepped on the fallen bamboo leaves. Using their strength, she rotated into a beautiful ‘flower’. The postures were splendid and let people feel that it was refreshing to look at.</p><br/><p>Seeing the appearance of his people, Gu De knew that this woman had conquered his people. Using a dance to conquer the hearts of people was indeed a good idea. It seemed that Gu Yun Wan really saw Feng Qi Qi as a very good friend. That was why she (GYW) helped her (FQQ) so much out.</p><br/><p>However, Feng Qi Qi indeed did have the ability to attract people. From the moment she began to dance till now, the atmosphere was brought to the highest level by her. Those people had obviously been moved by Feng Qi Qi’s dance. Even the elders nodded repeatedly. It seemed that they also had good feelings for Feng Qi Qi.</p><br/><p>Elder Teng Yuan sat among the elders. From the moment Gu De returned, he had been looking at Feng Cang’s group. As one of the elders who had the most right to speak, elder Teng Yuan had long got to know from Longze Jing Tian the purpose that Feng Cang came here for. He reached an agreement with them. As and exchange for the Immortal cream, he wouldn’t let Feng Cang’s wish be fulfilled.</p><br/>\n</div>"}