{"title": "Chapter 199 Indispensable", "id": 199, "volume": 2, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-199-indispensable", "volume_title": "Volume 2", "body": "<h1>Chapter 199 Indispensable</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 199 Indispensable</p><br/><p>“Oh…” Contrary to the lively atmosphere on the field, elder Teng Yuan yawned. There were a few tears on the corners of his eyes. He blinked and took out the Immortal cream from his sleeve. He carefully scooped out a little bit and stuffed it in the tobacco.</p><br/><p>“Bada, bada!” Not waiting for the tobacco to burn, elder Teng Yuan already took two smokes. Tasting the familiar taste, elder Teng Yuan had a face of satisfaction. A thick smoke came out of his mouth. They turned into circles and faded in the sky.</p><br/><p>Smoking the Immortal cream, watching Feng Qi Qi dance and the drums sounds that stirred people’s hearts rang in his ears, elder Teng Yuan had his legs crossed, swayed his head and closed his eyes. From time to time, he would also tip his right fingers on the table following the beat of the drums. He had a very enjoyable look.</p><br/><p>In all fairness, he liked Feng Qi Qi’s dance very much. Her dance interpreted a positive and uplifting soul like the ancient people of the Qiang tribe. They had lived at White Bird mountain for generations and had struggled with various environments. Finally, they became the owner here. The dance of Feng Qi Qi expressed the spirit of the people of the Qiang tribe. Elder Teng Yuan liked it very much.</p><br/><p>However, he made a promise to Longze Jing Tian. Moreover, the Immortal cream was indeed a good thing. If he could get the prescription of the Immortal cream, in the future he would then have endless Immortal cream.</p><br/><p>At this side, Wanyan Kang took Feng Xiao from Feng Cang’s arms and also pushed him (FC) to the crowd.</p><br/><p>Everyone of the Qiang tribe could sing and dance. Now, seeing that Feng Cang also joined in, everyone started to cheer. Feng Qi Qi landed in front of Feng Cang and handed a bamboo stick to him. The two had a tacit understand and did a ‘double martial arts dance’. Feng Cang couldn’t dance. He used the bamboo stick as a sword and did a sword dance around the campfire.</p><br/><p>The white Feng Cang was cold as snow. The red Feng Qi Qi was passionate as fire. The two pushed the atmosphere to the highest level which were met with a warm cheer. They coordinated very well. The woman was like a fire phoenix, dancing in the sky. The man was like the snow on the ground and contrasted the fiery red phoenix. They sketched a perfect picture.</p><br/><p>“So beautiful!” Gu De stroked his beard. The elders who sat at the other side also nodded frequently. They were all experts in dance. Of course they could understand the meaning of the dance of this pair. They were also impressed by them.</p><br/><p>“Good…” At the end, everyone stood up and cheered for Feng Cang and Feng Qi Qi. this couple landed on the ground from the sky. Everyone went to them and surrounded them. The music began again. Everyone began to sing and dance, using their way to welcome Feng Cang and Feng Qi Qi.</p><br/><p>“It’s so great here!” Feng Qi Qi returned to her seat and smiled at Gu De.</p><br/><p>“Since wangfei1 likes it here, wangfei can live here. Our Qiang tribe is very hospitable. Unfortunately, there are too few people who wants to be friends with us.”</p><br/><p>There was some helplessness inside Gu De’s words.</p><br/><p>Indeed, to others, Qiang tribe was a weird existence that associated with the gu. Not only were they repelled by the Nan Feng, when other countries heard about the gu, their faces would also change color. In the memory of Gu De, it had been a long time since White Bird mountain had been so lively.</p><br/><p>“Good!” Just when Gu De was immersed in the memories of the past, Feng Cang’s voice reached over, “Since chief invited us, naturally we will accept the invitation as long as chief doesn’t get tired of us.”</p><br/><p>Feng Cang’s words surprised Gu De. That he agreed so readily was beyond Gu De’s expectations. “Could it be that wangye2 isn’t afraid of the gu?”</p><br/><p>“Could it be that chief would put gu on us?” Feng Qi Qi used a rhetoric question to answer Gu De, making Gu De laugh out loudly. These two people were indeed a match. They were really a wonderful pair.</p><br/><p>“Regent and wangfei can rest assured. We have our principles. Not to mention that you are noble guests who came from far away. I can assure you that no one would put gu on you.”</p><br/><p>Gu De really appreciated Feng Cang’s character. Although the two didn’t talk much while on the road. However, now they were being a chatterbox and talked non-stop with each other.</p><br/><p>It was lively on the scene. No one noticed that in the shadow not far away, someone was staring infatuatedly at Feng Qi Qi.</p><br/><p>Knowing that Feng Qi Qi would arrive today, Longze Jing tian used the night to hide here. The dance of Feng Qi Qi just now deeply stunned him. Longze Jing Tian finally understood what kind of beautiful scenery he had missed.</p><br/><p>If he hadn’t written the “Break Off Engagement Letter”, the one who would dance with her and receive the blessings of the people would be him. Longze Jing Tian always wondered about why Feng Qi Qi didn’t choose him. He was also handsome. This question had puzzled Longze Jing Tian for a long time. He hoped that he could get the answer one day from Feng Qi Qi.</p><br/><p>“Slut!” A voice came from Longze Jing Tian’s side. Only now did he discovered that Taji Guli also came here. Obviously, Taji Guli saw Feng Cang and Feng Qi Qi coordinated flawlessly in a dance. She hated it so much that she gnashed her teeth. Her right hand was clenched into a fist.</p><br/><p>“Don’t be impulsive!” Longze Jing Tian grabbed the iron hook on Taji Guli’s left hand. “Don’t forget the agreement between us! If you dare to touch Feng Qi Qi, I won’t let Feng Cang off!”</p><br/><p>Longze Jing Tian’s threat let Taji Guli humph coldly. “I know! You can’t bear to see your beauty suffer! Don’t worry, I’m not an idiot!”</p><br/><p>Taji Guli pulled her hook fiercely, turned and left here.</p><br/><p>“Bastard! Bastard!” While Taji Guli walked, she waved with the iron hook on her left hand. Why would every man view Feng Qi Qi in a new light? Her looks were only a bit more beautiful. She had nothing else that was special.</p><br/><p>Recalling the scene of the deep affection between Feng Cang and Feng Qi Qi, Taji Guli’s heart felt uncomfortable like it had eaten a fat fly. Before, she thought to abide to the agreement between her and Longze Jing Tian. As long as she could get Feng Cang, she didn’t want anything else. However now, after seeing the deep and sweet love between Feng Cang and Feng Qi Qi, Taji Guli changed her mind.</p><br/><p>Feng Qi Qi must die. Feng Cang’s heart was already fully filled with this woman. Even if she gets Feng Cang’s person, she wouldn’t be able to enter his heart. She didn’t want it like that! She wanted to let Feng Cang look at her deeply in love like the way he looked at Feng Qi Qi. She also wanted Feng Cang to love her!</p><br/><p>Taji Guli didn’t know that her ally, Longze Jing Tian had the same thoughts as her at this time.</p><br/><p>Longze Jing Tian had long wanted to get rid of Feng Cang. He is a man. A man’s possessiveness was stronger. He could ignore Feng Qi Qi’s past, but in Feng Qi Qi’s future, there could only be one person; that is him, Longze Jing Tian.</p><br/><p>After Taji Guli left, Longze Jing Tian looked once deeply at Feng Qi Qi before he turned and left.</p><br/><p>No matter what, he had to get rid of Feng Cang! Longze Jing Tian gritted his teeth. Feng Cang’s existence would be a forever nightmare for Longze Jing Tian.</p><br/><p>The campfire was busy until late at night. Gu De let Feng Cang’s group live in his own bamboo building. Gu De’s bamboo building was at the east. The bamboo building was small and exquisite. It was not big but very heartwarming.</p><br/><p>Qiang tribe village was build houses after houses. There was no barrier between the houses. Just like how the people of the Qiang tribe wouldn’t set up their defenses against each other. The people of the village were like one big family.</p><br/><p>Gu De planned to let Feng Cang and Feng Qi Qi see the elders on the second day. Today was their dust-washing feast. Gu De didn’t mention the matter of curing the gu to the elders. However, looking back at Feng Cang and Feng Qi Qi’s performance, it seemed that they left a good impression on the people. He hoped that they could solve the gu smoothly!</p><br/><p>The next day, Feng Qi Qi was woken up by the sounds of the birds outside.</p><br/><p>Those birds sang happily in the woods. When the wind blew through the wood, it made ‘shua, shua…’ sounds. The air was filled with a freshness. The greetings in their language by the farmers of the Qiang tribe could be faintly heard. Lying on the bamboo bed and feeling the nature, such a state was really wonderful!</p><br/><p>After Feng Cang and Feng Qi Qi got up, cleaned up and had breakfast, Gu De let Gu Yun Wan led Wanyan Kang and the others to take a look around the village. He led Feng Cang, Feng Qi Qi and Ming Yue Cheng to elders.</p><br/><p>The five elders had been invited to the ancestral temple of the Qiang tribe. This ancestral temple was a house built from stones. It seemed a bit out of place among these bamboo houses.</p><br/><p>After everyone sat down, Gu De told the five elders the reason they came for. When they heard that Feng Cang came with his child to cure the gu, the elders began to discuss.</p><br/><p>“Curing the gu is not a problem, but you need to follow the rules.” Elder Teng Yuan knocked the pocket with the tobacco on the shoe of his sole. “Mounting the mountain of daggers, going through the sea of flames and enter the dragon pool. You can’t miss one of these three.”</p><br/><p>“Mm, I agree!”</p><br/><p>Elder Teng Yuan was ranked third among the elders. The one helping him now was the fourth elder.</p><br/><p>“The rules of the ancestors had long been set. If outsiders want to solve the gu, they must pass through the three tests. I agree with third elder on this. Although regent is a friend, but the rules couldn’t be ignored. If we broke the rules this time, when the same thing happens next time, then it would be difficult to deal with!”</p><br/><p>The two elders had already showed their stance. After the other elders thought for a while, they agreed with elder Teng Yuan.</p><br/><p>This was the result that Feng Cang expected. He didn’t expect that the elders of the Qiang tribe would accommodate in respect of his identity. “The rules couldn’t be ignored. I can understand this. I want to know when I can start with these three tests.”</p><br/><p>Feng Cang’s answer surprised elder Teng Yuan a bit. He thought that Feng Cang would make threats and put out his identity to ‘frighten’ people. He didn’t expect that the other party was so frank and straightforward and agreed so directly. This was very different from the description of the ‘demon wang’ by Longze Jing Tian. This Feng Cang was quite interesting!</p><br/><p>The elders negotiated for a while. In the end, they decided to do it in three days.</p><br/><p>“I’m sorry, I couldn’t help you!” After leaving the ancestral temple, Ming Yue Cheng felt a bit guilty. Although he followed them, but he was unable to be of any help. His status as the emperor was of no use to these elders of the Qiang tribe.</p><br/><p>“You introduced chief Gu De to us. That is already the greatest help for us! Ming Yue Cheng, if I can pass the three tests successfully, I will definitely have a few drinks with you!”</p><br/><p>1. Wangfei: main consort of the first-rank prince</p><br/><p>2. Wang/wangye: the first-rank prince</p><br/>\n</div>"}