{"title": "Chapter 202 (Part 2) Love is in sky of affection (1)", "id": 202, "volume": 3, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-202-part-2-love-is-in-sky-of-affection-1", "volume_title": "Volume 3", "body": "<h1>Chapter 202 (Part 2) Love is in sky of affection (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>TLNote: Chapter 203 will be released in a while.</p><br/><p>Chapter 202 (Part 2) Love is in sky of affection (1)</p><br/><p>“Chief, don’t worry! We will definitely find great miss. Guys, don’t you all think so?!” “Yes! Chief, don’t worry!”</p><br/><p>Everyone didn’t rest for the whole night. They hurriedly filled their stomachs. A new round of search began again.</p><br/><p>White Bird mountain was very large. It would take half a day to search the entire mountain. Jin Mo followed the people of the Qiang tribe into the forest. Although, it was spring, but the weather wasn’t that warm. However, the people of the Qiang tribe lived in the south and White Bird mountain was a dense forest. Not long after, everyone’s back was full of sweat.</p><br/><p>“Great miss!” “Little Wan!”</p><br/><p>The sounds echoed in the mountain. After Gu Yun Wan who was in the deep hole persisted for one night, her mouth and tongue were dry. She was thirsty and hungry. At this time, she didn’t have the strength she had before. Even if she heard those voices, she couldn’t respond.</p><br/><p>Another day had passed. The people who had returned still didn’t find Gu Yun Wan. This time, Gu De got anxious. “How could this be? Little Wan disappeared. Could she had been taken away by Longze Jing Tian? What does he want to do?”</p><br/><p>Feng Cang and Feng Qi Qi felt very guilty about Gu Yun Wan’s abduction. The ones Longze Jing Tian probably hated were them. Naturally, he didn’t want Feng Xiao’s gu to be cured. Now, because of the matter of curing the gu, Gu Yun Wan got involved in this. These two people felt very guilty.</p><br/><p>Deep in the forest, the small group of Jin Mo were still looking for Gu Yun Wan. A whole day had passed. It was already evening. Jin Mo drank some water at the spring and wiped his mouth. They searched for such a long time and still hadn’t found Gu Yun Wan. Could there be some places that they had missed? Just when Jin Mo was thinking about this, a green worm climbed on his hand.</p><br/><p>“Goo, goo, goo, goo…” the small worm weakly flicked its wings and made “googoo” sounds.</p><br/><p>Jin Mo had seen this worm before. Before, at Bei Zhou, in order to study the gu Jin Mo asked Gu Yun Wan to release her gu. The appearance of that one was exactly the same as this one.</p><br/><p>“Do you know where Gu Yun Wan is?” When he saw the small worm, Jin Mo was very surprised. He immediately called the other people.</p><br/><p>“This seems to be great miss’s gu!”</p><br/><p>“That’s right! It’s great miss’s!”</p><br/><p>The small worm lingered in the left hand of Jin Mo. It looked very pitiful.</p><br/><p>“Goo, goo…” The small worm was not a human being. It couldn’t talk. It could only make sounds.</p><br/><p>“You want me to go save little Wan?”</p><br/><p>The gu fanned its wings and flew.</p><br/><p>“Follow her. Maybe we can find great miss!” Jin Mo followed behind this little worm. It fanned its wings with all its strength, but it was too weak. A while later, it fell on the ground.</p><br/><p>“Great miss’s gu is still a larva. It can’t fly for too long. It must be that great miss encountered trouble and let the gu come back to tell us!” Someone went forward and wanted to pick up the small worm, but he didn’t expect that the small worm would flash its wings ad fell on Jin Mo’s hand.</p><br/><p>“Young master Jin Mo, it seems that great miss’s gu trusts you! I have to trouble you!”</p><br/><p>Jin Mo nodded and gently stroked the wings of the small gu. “Since you can’t fly, then tell us the direction. If we go in the right direction, then make sounds, alright?”</p><br/><p>“Goo, goo…” The gu agreed and nodded.</p><br/><p>Jin Mo sent someone to go notify the village. He took the other nine people and followed the gu’s instruction to find Gu Yun Wan.</p><br/><p>“Googoo!” “Googoo!”</p><br/><p>The gu continued to make sounds. Jin Mo let people follow the sound to distinguish the direction. They travelled back and forth through the forest. It took a long time before they came to the deep hole.</p><br/><p>“Googoo, googoo!” When they got here, the gu made fiercer sounds. It even jumped from Jin Mo’s hand and fell on the ground. It directly climbed into the deep hole.</p><br/><p>“Great miss is inside!” Jin Mo immediately understood the gu.</p><br/><p>At this time, the sky was already dark. Someone lit a torch, and another used the surrounding vines to make an ordinary rope.</p><br/><p>“I will go down. Wait here for me!” Jin Mo grabbed the vines and went down the hole.</p><br/><p>“Weng….” A group of bats saw that someone came and flew away immediately. The blood and rotten smell filled Jin Mo’s nose and made him startled. The bats love the smell of blood the most. These bats came to eat in the hole. Could this blood be Gu Yun Wan’s? Nothing happened to her, right?!</p><br/><p>Jin Mo held the torch with one hand and the other moved the branches and leaves.</p><br/><p>“Little Wan?!” When he saw the woman lying on the ground, he shouted, “Great miss is here. We found great miss!”</p><br/><p>When the people at the entrance of the hole heard that Gu Yun Wan was found, they were very excited. Jin Mo checked Gu Yun Wan and found out that only her acupuncture point had been hit. He immediately released it and also took away the worn-out cloth from her mouth.</p><br/><p>“Are you alright? I will check for you!”</p><br/><p>“I, I can’t move,” Gu Yun Wan said with difficulty. She had been in this position for a day and a night. Her blood wasn’t flowing well. Her whole body was completely numb.</p><br/><p>Jin Mo immediately helped Gu Yun Wan improve her blood circulation. After massaging for a long time did Gu Yun Wan’s limbs gain some of their sense of feel back.</p><br/><p>“Don’t move, let me piggy-back you back to above!”</p><br/><p>Jin Mo reached out and put Gu Yun Wan on his back. Then, he climbed with the help of the vines to above.</p><br/><p>“Great miss, it’s good that you’re alright!” “Great miss!”</p><br/><p>The others gathered around and helped Jin Mo put Gu Yun Wan down. Jin Mo once again checked Gu Yun Wan carefully. He wrapped the wounds on her body and knelt down to rub her legs that had been stiff for a long time.</p><br/><p>“How is it? Why doesn’t my legs have any feelings yet?”</p><br/><p>“It’s just that the blood isn’t circulating well. So, it’s a little bit troublesome. Let’s go back and talk then!”</p><br/><p>Jin Mo was a doctor. Even if Gu Yun Wan felt that something was not right, she still chose to believe Jin Mo.</p><br/><p>Immediately someone made a simple chair from the branches and vines. Jin Mo put Gu Yun Wan in the chair. Then, the group hurried back to the village. When they were halfway, some people came to pick them up. After Gu De got to know that Gu Yun Wan was found, he personally rushed over. When he saw Gu Yun Wan in the chair, Gu De was very excited.</p><br/><p>“It’s good that you came back! It’s good that you’re fine!”</p><br/><p>When they were back in the village, Jin Mo found an opportunity to talk to Feng Qi Qi. “Junior sister, something is not good!”</p><br/><p>“What’s the matter?” Feng Qi Qi was a bit puzzled. Why was is not good that Gu Yun Wan is found? “Senior brother, what happened?”</p><br/><p>“Gu Yun Wan’s acupuncture point had been hit and she had been thrown into the hunting hole. She hasn’t moved for a whole day and night. The blood in her limbs isn’t circulating well, maybe…”</p><br/><p>Jin Mo hasn’t finished speaking, Feng Qi Qi already understood what he meant. Long-term immobility caused the blood to not circulate well. The nerves were oppressed and would cause necrosis. Could it be that such a thing happened to Gu Yun Wan?</p><br/><p>“Senior brother, let’s go take a look!”</p><br/><p>Feng Qi Qi handed Feng Xiao to Su Mei and hurried with Jin Mo to Gu Yun Wan’s room. At this time, Gu Yun Wan had bathed and put on clean clothes with the help of her maid. However, her right hand and feet still have no feelings.</p><br/><p>When she saw Feng Qi Qi, Gu Yun Wan had an ominous premonition. She knew Feng Qi Qi’s ability. Now, Feng Qi Qi came over and her expression was so serious, could it be that something had happened? When she looked at Jin Mo, although his expression hadn’t changed, but his eyes were not right. Gu Yun Wan wasn’t a fool. They were both famous doctors. The two came at this time and with these expressions, it didn’t seem like they came to chat with her.</p><br/><p>“Qi Qi, are my legs ruined?” Gu Yun Wan asked when Feng Qi Qi wanted to examine Gu Yun Wan, making Feng Qi Qi startled. Feng Qi Qi laughed, “No, I just came to see you! Besides, even if there’s something, I will make you safe and sound!”</p><br/><p>After Feng Qi Qi said this, Gu Yun Wan knew that there really was a problem with her legs. After Gu De heard the talk between Gu Yun Wan and Feng Qi Qi, he also moved closer to them. “Princess, if you have something to tell, tell us directly. What’s the matter to my Wan er1?”</p><br/><p>“Chief, keep calm! I was just not sure, so I brought my junior sister to confirm the diagnosis! Don’t worry, with me and my junior sister here, nothing will happen to great miss!”</p><br/><p>After Jin Mo said this, Gu De’s face sank. “So, something is wrong with Wan er?”</p><br/><p>Feng Qi Qi didn’t say anything. After checking Gu Yun Wan once again, she stood up.</p><br/><p>“Qi Qi, is it that I can’t walk anymore? And my right hand can’t move anymore?” Gu Yun Wan couldn’t accept this reality. This way, wouldn’t she become a rubbish?</p><br/><p>“Little Wan, don’t think so bad of things. Your legs and right hand only temporarily lose their feeling. Trust me, you will be the same as before.”</p><br/><p>“Really? You didn’t lie to me?” Gu Yun Wan didn’t believe it. From the moment she had been rescued by Jin Mo till now, her legs and right hand didn’t have any feeling. Isn’t this disability?</p><br/><p>“If you lie to me, I will hate you!”</p><br/><p>“Believe us, nothing will happen to you.” Seeing Gu Yun Wan like this, Jin Mo squatted in front of her. “You need to cooperate well with the treatment, so that you can restore your health. You have been in the same position in the hole for too long. So, the blood isn’t circulating well in your body and caused the current condition of your body. With acupuncture plus rehabilitation, your will restore your health soon!”</p><br/><p>The words of Jin Mo calmed down Gu Yun Wan’s giddiness. She stared into Jin Mo’s eyes. “Jin Mo, you won’t lie to me?”</p><br/><p>“I won’t lie to you. I and junior sister will definitely cure you!”</p><br/><p>After comforting Gu Yun Wan for a long while did Feng Qi Qi left. Gu De followed behind Feng Qi Qi. The two walked for some distance before they stopped. Feng Qi Qi explained the reason why this condition had happened to Gu De.</p><br/><p>“Qi Qi, what do you mean with the vascular necrosis of the calf? How much chance does Wan er have at recovering? How long will it take to recover?”</p><br/><p>“At least half a year.”</p><br/><p>“Half-year?!” Gu De’s heart immediately hung on the air. “You said half-year?”</p><br/><p>“Chief doesn’t believe in my and senior brother Jin Mo’s medical skills??”</p><br/><p>“I…I believe you.” Gu De didn’t expect that things would be so bad. Half-year, how could Gu Yun Wan accept it?</p><br/><p>Feng Qi Qi saw Gu De’s worries from his expression. She quickly comforted him, “Chief, I only estimated the period roughly. As long as little Wan coordinate well with senior brother’s acupuncture and my message, perhaps it wouldn’t take so long. Little Wan is a strong girl. Nothing will happen to her, believe me!”</p><br/><p>Feng Qi Qi’s words were very sincere letting Gu De slowly put his fears down. Now, the one he hated the most was Longze Jing Tian. Not only did he kidnap Gu Yun Wan, but also harmed her like this. “All the blame is on Longze Jing Tian! I must find him and kill him!”</p><br/><p>1. Er: term of endearment</p><br/>\n</div>"}