{"title": "Chapter 204 (Part 2) Love is in sky of affection (3)", "id": 204, "volume": 3, "url": "http://boxnovel.org/demon-wangs-golden-favorite-fei-chapter-204-part-2-love-is-in-sky-of-affection-3", "volume_title": "Volume 3", "body": "<h1>Chapter 204 (Part 2) Love is in sky of affection (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 204 (Part 2) Love is in sky of affection (3)</p><br/><p>“How was it?” Gu De and the four elders were waiting at the side. After seeing Feng Qi Qi perform the acupuncture, everyone was surprised.</p><br/><p>They had never seen such exquisite medical skills. Those silver needles were flying in the hands of Feng Qi Qi and landed exactly on the acupuncture points of elder Teng Yuan. Accurate to perfection, it made these people broaden their horizons.</p><br/><p>Accurate to perfection: precise to the finest detail.</p><br/><p>“This old man thought that princess Zhen Guo was a weak woman, but didn’t expect it….”</p><br/><p>The words of fifth elder spoke out the thoughts of everyone. Feng Qi Qi’s method was fast and accurate, and there was a right amount of strength. How was this a weak woman? It was clearly a martial arts master and also a medical expert. Immediately, the recognition of Feng Qi Qi rose to a very high level in the hearts of these elders.</p><br/><p>After waiting for an hour, Feng Qi Qi finally retrieved the silver needles from the body of elder Teng Yuan. Elder Teng Yuan’s madness of just a moment ago had also disappeared, and he slowly felt asleep.</p><br/><p>“Thanks a lot, Princess!” Gu De stepped forward and bowed to Feng Qi Qi. Although Elder Teng Yuan did wrong, he (TY) once taught Gu De the method of gu. Now, seeing that he (TY) had been used by people and became like this, it made Gu De very worried about elder Teng Yuan.</p><br/><p>After seeing the medical treatment of Feng Qi Qi, Gu De’s worries were completely gone. Elder Teng Yuan was in good health. The Qiang tribe owed Feng Qi Qi a favor. “Thank you!”</p><br/><p>“Chief doesn’t need to be polite. It’s a very slight effort. It’s what I should do.”</p><br/><p>After seeing the ‘extraordinary methods’ of Feng Qi Qi and seeing her be so modest, the good impression of the four elders who was standing aside, of Feng Qi Qi rose a lot again. They lived in White Bird mountain for generations, and didn’t like complicated conflicts and the scheming against one another. The four elders really liked such a simple person like Feng Qi Qi.</p><br/><p>“Not good!” While everyone was talking, Su Mei rushed in and looked anxious. “Miss, it’s not good! Little shizi1 is gone!”</p><br/><p>“What happened?”</p><br/><p>Su Mei’s words made Feng Qi Qi shcked and immediately grabbed Su Mei’s hand, “What happened?”</p><br/><p>“Miss, I just bathed little shizi and went out to throw out the water. After I returned to the house, little shizi had disappeared! Guye2 has already gone to find little shizi!”</p><br/><p>That Su Mei said so, made Feng Qi Qi’s face sank. She (FQQ) had already guessed who captured Feng Xiao. It must be Longze Jing Tian and the others.</p><br/><p>“Let’s go!”</p><br/><p>One after another, Su Mei and Feng Qi Qi left the bamboo building. Seeing Feng Qi Qi in the fluttering red dress and just barely touched the ground, she had already reached a hundred meters away, Gu De and the others even more surprised.</p><br/><p>“Chief, let us help too!”</p><br/><p>“Good!” Gu De and the four elders followed closely behind.</p><br/><p>Just by following, made Gu De and the four elders even more amazed by Feng Qi Qi. She was just a 17 to 18-year-old woman. Why was her qinggong3 so good?</p><br/><p>The four elders were all experts from the Qiang tribe, but they were all left far behind Feng Qi Qi. This time, the shock that Feng Qi Qi brought to them was already hard to express in words. Such an expert but so subtle and restrained, was rare in the younger generations.</p><br/><p>Feng Qi Qi followed Su Mei and following the message left by Feng Cang, they finally came to the millennium cold pool at the foot of White bird Mountain. The moment they arrived, Feng Cang and Longze Jing Tian were standing opposite each other. Taji Guli stood on the left side of Longze Jing Tian, while Duyi on the right side and Feng Xiao was being held by Longze Jing Tian.</p><br/><p>“As expected, it’s you!” Seeing Longze Jing Tian again, Feng Qi Qi felt that he had changed a lot.</p><br/><p>Although the Longze Jing Tian from the past couldn’t be a friend, but he was also not an enemy. However, the current Longze Jing Tian standing like that, regardless of imposing manners or attitudes, was completely different from the past, especially when Feng Qi Qi saw Feng Xiao in the arms of Longze Jing Tian, she almost screamed.</p><br/><p>Soon after, Gu De and the elders rushed over. Even Ming Yue Cheng and Wanyan Kang who had heard the news, also arrived here. Everyone surrounded Longze Jing Tian and the others, but no one dared to move. Because the hand of Longze Jing Tian was placed on the head of Feng Xiao.</p><br/><p>“You have come….”</p><br/><p>The voice of Longze Jing Tian was a little hoarse. He (LJT) didn’t expect that elder Teng Yuan would betray them at the crucial moment, and even more that Feng Cang would follow so soon. It would be very hard to get out with so many masters around them.</p><br/><p>Feng Qi Qi didn’t answer Longze Jing Tian. At this moment, her eyes were eagerly watching Feng Xiao who was in the arms of Longze Jing Tian. That child didn’t seem to know that he was in danger. He was just playing with the small golden bell with on his wrist with his own small chubby hands producing sharp and clear sound.</p><br/><p>“Put down Feng Xiao and I’ll give you a way to survive.” Feng Cang stood next to Feng Qi Qi and looked at Longze Jing Tian. If it weren’t because Feng Xiao was in their hands, he would have already ground the bones of these three people in front of him to dust.</p><br/><p>“A way to survive? By this moment, do you think I still care about life or death?</p><br/><p>When Longze Jing Tian and Feng Cang were talking, Taji Guli’s eyes were smitten with Feng Cang. He was still so charming, but his cold eyes deeply hurt the heart of Taji Guli. From the beginning to the present, he didn’t look at Taji Guli at all. How could she not be upset?</p><br/><p>“Feng Cang!”</p><br/><p>Taji Guli called out the name of Feng Cang. Her voice trembled slightly, so the sound on the last word almost broke.</p><br/><p>Feng Cang didn’t look at Taji Guli. This woman had long been defeated by him. Now that she had colluded with Longze Jing Tian, Feng Cang couldn’t wait to kill her. Why should he pay attention to her at this time?</p><br/><p>The indifference of Feng Cang made Taji Guli’s heart chilly. She didn’t think that Feng Cang’s attitude towards herself was like this. Previously, she had secretly observed the attitude of Feng Cang towards Feng Qi Qi. Such a gentle and affectionate man would only appear in the dream of Taji Guli. Now, with his cold face, he didn’t bother to look at her. It made Taji Guli’s heart very painful.</p><br/><p>“Feng Cang, I’m Taji Guli. Look at me, alright?”</p><br/><p>It was said that love made people petty and low like the dust. Taji Guli felt that she was like a female slave creeping on the ground and looked pettily at the highly Feng Cang. She had already trampled on her own self-esteem like this; why was Feng Cang still so mean and unwilling to distribute some love to her?</p><br/><p>“Shameless!”</p><br/><p>When Su Mei saw Taji Guli like this, she readily uttered a curse. Su Mei’s words immediately received a response from Wanyan Kang, “Agree, she’s really shameless! Who is this ugly person? If benwang4 was this ugly, I’ll definitely hide at home and wouldn’t come out to see anybody! Don’t know how her parents raised her!”</p><br/><p>Su Mei smiled at the words of Wanyan Kang and added a sentence at the back, “Husband, how can you talk like that of other people’s parents! Which parents don’t want their children to be well? If the seeds were good, I don’t know how one became like this at the later age. I think, this is a problem of the person herself!”</p><br/><p>“Yes, yes, wifey is right! Can’t blame the parents for the people becoming lowly! Besides, her parents died early, when did they had the time to teach her how to be a good person?!”</p><br/><p>This couple echoed one another and scolded Taji Gul making her have cuts and bruises all over (figuratively). This made Taji Guli very furious that she shouted and attacked Su Mei.</p><br/><p>“Tsk, tsk, so ugly and still want to fight me! Considering that you only have one hand, I’ll also use one hand to fight you! I don’t want others to say that I bully people with disabilities. If this gets out it won’t be good to my reputation!”</p><br/><p>1. Shizi: heir of the first-rank prince, usually born by the main wife </p><br/><p>2. Guye: son-in-law, also used by the servants of the mistress</p><br/><p>3. Qinggong: martial arts technique for making the body extremely light in weight, by altering the distribution and flow of qi</p><br/><p>4. Benwang: this king, I used by the first-rank prince</p><br/>\n</div>"}