{"title": "Chapter 3 - Makers Mistake (2)", "id": 3, "volume": 1, "url": "http://boxnovel.org/praise-the-orc-chapter-3-makers-mistake-2", "volume_title": "Volume 1", "body": "<h1>Chapter 3 - Makers Mistake (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 3 - Maker’s Mistake (2)</span></p><br/><p><span>As Ian approached the wall, two orcs in chain armor stood tall like stone statues. </span><span>Their blades flashed in the sun.</span></p><br/><p><span>They discovered Ian and laughed. They were laughing, but due to their tusks and their heinous appearance, their faces seemed evil.</span></p><br/><p><span>\"Hey, are you alive?”</span></p><br/><p><span>\"I’m alive. I came here to become a fellow warrior.”</span></p><br/><p><span>They burst out laughing. It was a unique tone caused by their stomachs shaking. </span><span>Ian gulped at their overwhelming momentum. </span><span>He had once been a soldier, but he couldn’t help but shrink back at the two monstrous orcs side by side.</span></p><br/><p><span>One of the orcs held out a fist.</span></p><br/><p><span>“...?”</span></p><br/><p><span>Ian looked at the rough hand blankly before realizing it was a greeting. Ian also made a fist and bumped it against each other. </span><span>The orc guard smiled and said,</span></p><br/><p><span>\"Anyway, you have arrived at Orcrox and I wish you good luck. Today there is a funeral where we will remember an honorable warrior. Kulkul. Stay alive.”</span></p><br/><p><span>They shouted to open the door. </span><span>The walls were high enough to cover the sun, and the giant door that was the size of the building started to slowly open. </span><span>The door opened with a thunderous sound and Ian was able to see the inside of Orcrox Fortress.</span></p><br/><p><span>“Ohh...”</span></p><br/><p><span>Ian thought of orcs as savage monsters, since their appearance alone was heinous. </span><span>But that wasn't it. </span><span>The scale of the buildings were different. There were tall buildings around the giant tree in the center, with bridges in the sky connecting each one. </span><span>Above his head, orcs were busy going to and fro.</span></p><br/><p><span>It felt like the city of elves in a fantasy world! </span><span>There weren’t just warriors with weapons or shamans with staffs, but various orcs, such as merchants, in order to form a civilization.</span></p><br/><p><span>It was a magnificent landscape that was more realistic than reality. </span><span>The orc fortress filled Ian’s view.</span></p><br/><p><span>\"This is really a game...”</span></p><br/><p><span>\"Hey, you’re alive. Are you new?”</span></p><br/><p><span>Passing orcs smiled at the stunned newcomer and held out their fists. Ian bumped them with his fists.</span></p><br/><p><span>Whether he was alive or not, it didn’t take long for him to realize that it was the orcs’ greeting. All of them asked each other if they were alive, meaning this was a place where life and death occurred often enough for it to become a greeting.</span></p><br/><p><span>Ian didn’t know what to do after entering Orcrox Fortress, so he checked the interface for beginners tips.</span></p><br/><p><span>[If you selected an orc, can you really endure it?]</span></p><br/><p><span>[If you are a beginner, look for Instructor Lenox at Orcrox Fortress.]</span></p><br/><p><span>\"Lenox...?\"</span></p><br/><p><span>It was at that moment.</span></p><br/><p><span>\"Uh, a user? Wah, a real user?”</span></p><br/><p><span>There was a loud and gruff voice, but the tone was light. </span><span>Ian turned his head and saw a shabby looking orc.</span></p><br/><p><span>\"This is the first time I’ve seen another beginner orc. It’s nice to meet you!”</span></p><br/><p><span>He tried to shake hands before grunting and putting out his fist like the other orcs. Ian smiled and bumped his fist.</span></p><br/><p><span>\"Are you alive?”</span></p><br/><p><span>\"I’m alive. Haha, by the way, did you just start playing? What’s your name? I’m called Grom. I got it from a character in an old classic game.”</span></p><br/><p><span>“Yes. I'm Ian.\"</span></p><br/><p><span>Ian nodded. </span><span>Ian then discovered something on the other person’s forehead. A white star was shimmering in the middle of his forehead.</span></p><br/><p><span>“That...?”</span></p><br/><p><span>\"What?\"</span></p><br/><p><span>Grom followed Ian’s gaze to his forehead.</span></p><br/><p><span>“Ah, this. You don't know? The white star allows you to identity the users. Ian has one on your forehead as well. That’s how I knew that you were a user. NPC’s can’t see it, only we can. This is really the first time I’ve seen it.”</span></p><br/><p><span>\"Is that so?\"</span></p><br/><p><span>\"There are even some who hide it to pretend to be NPCs. You must have really started without investigating anything.”</span></p><br/><p><span>\"This is the first time I’m playing a game.”</span></p><br/><p><span>“I see. Be careful, this is a big deal. Elder Lord is a really hard game so you should look at the tips.”</span></p><br/><p><span>He nodded and smiled.</span></p><br/><p><span>\"Of course, you didn’t see it, which is why you picked an orc.”</span></p><br/><p><span>“Huh?”</span></p><br/><p><span>\"It's nothing. Are you going to see Lenox?”</span></p><br/><p><span>\"That is what the tip said.”</span></p><br/><p><span>“Let’s go together. I was about to start heading there now.”</span></p><br/><p><span>Ian followed Grom.</span></p><br/><p><span>Ian was immersed in the sight of the city. Orcrox Fortress was filled with all types of things. </span><span>There was a market and smithy. It was a realistic scene that couldn’t be thought of as a game as merchants shouted about their goods, adventurers gathered to fight monsters and orcs drank alcohol.</span></p><br/><p><span>Ian started to think differently of Elder Lord. </span><span>The game system seemed to have a personality and story for each character. A civilization and culture was created for the orcs. </span><span>It was a wonderful game.</span></p><br/><p><span>As Ian immersed himself in the world of Elder Lord, Grom laughed.</span></p><br/><p><span>“Isn’t it amazing?”</span></p><br/><p><span>“Yes. I can’t believe this is a game. How...”</span></p><br/><p><span>He couldn’t believe that what he was seeing, hearing and feeling now was a game.</span></p><br/><p><span>\"Oh, there is a funeral.\"</span></p><br/><p><span>“Funeral?”</span></p><br/><p><span>\"Orcs are mourning the death of a great warrior. He was a great NPC who sacrificed himself to protect his allies.”</span></p><br/><p><span>Suddenly, the faint sound of a horn could be heard.</span></p><br/><p><span>At that moment. </span><span>The entire Orcrox Fortress became quiet.</span></p><br/><p><span>“Ah...?”</span></p><br/><p><span>All the orcs were silent. Even the merchants shouting at the market and the drunkards became silent. </span><span>The horn rang out slowly in the midst of this quiet. </span><span>All the orcs looked at the center of Orcrox Fortress.</span></p><br/><p><span>There appeared to be an altar made of bricks with an orc body lying on top of firewood. </span><span>The orcs started humming in bold tones. </span><span>It was a thick, subdued tone, like the humming of the Tibetan monks. The entire Orcrox Fortress was filled with the beat of the funeral procession.</span></p><br/><p><span>At the bottom of the altar, the orcs presiding over the funeral started to slowly beat the drums. </span><span>The sound of the horns and the drumming and humming of the orcs mixed together. </span><span>The warrior’s body caught on fire, the flames consuming the body of the dead orc warrior. The orcs held a ceremony in remembrance of their own. </span></p><br/><p><span>“Ah...”</span></p><br/><p><span>Ian was shocked.</span></p><br/><p><span>A ceremony to honor their comrades.</span></p><br/><p><span>He was reminded of a soldier on the battlefield. Cornell had become a star in the sky due to rebel bullets, and his colleagues had sent him away with bright smiles instead of sad tears. The song chosen wasn’t a tranquil song, but an army song. Nobody cried that day, but their hearts and minds were overflowing with hot and sad emotions.</span></p><br/><p><span>The memory of that day was revived.</span></p><br/><p><span>The humming of the orcs was grand and noble. Ian couldn’t take his eyes off the burning orc warrior. </span><span>The mournful cry of the horns wandered throughout Orcrox Fortress.</span></p><br/><p><span>Ian didn’t know the name of the orc, since he was just a character in the game. However, it is clear to Ian that he was a great and respected man.</span></p><br/><p><span>\"Ah, noisy.”</span></p><br/><p><span>Ian’s mind snapped back at Grom’s words. Grom was grumbling beside him.</span></p><br/><p><span>“A funeral should proceed quickly and quietly. Ahyu. Right?”</span></p><br/><p><span>Ian looked at him blankly.</span></p><br/><p><span>Did this person really feel no emotions when seeing this scene? </span><span>In a world that seemed more real than reality, could he throw away the solemn ceremony of the orcs just because it was a game?</span></p><br/><p><span>Ian turned his gaze once again to the burning body of the orc warrior.</span></p><br/><p><span>[Assimilation: 50%]</span></p><br/><p><span>[Assimilation: 51%]</span></p><br/><p><span>[Assimilation: 52%]</span></p><br/><p><span>......</span></p><br/><p><span>Ian didn’t know about the changes in his status window.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>-Hello! I am a helper to help you live a comfortable Elder Lord life, Yoojung!</span></p><br/><p><span>-I am Jaehan!</span></p><br/><p><span>-Today we will talk about assimilation rate. Jaehan-ssi, what is your current assimilation rate?</span></p><br/><p><span>-When my condition is good, it is over 50%. On average, it is 40%.</span></p><br/><p><span>-That is amazing. I am usually 30%. An average user is between 30~40%, so Jaehan-ssi is capable.</span></p><br/><p><span>-Hahaha. Still, I don’t want to get hurt when fighting, so I often end up limiting it. At 50%, I feel dizzy like I am actually hit by a knife.</span></p><br/><p><span>-In fact, I usually play at a limit of 20% due to that.</span></p><br/><p><span>-Oh, that is worse.</span></p><br/><p><span>-Hihihi. Anyway, what is the assimilation rate of the viewers? The survey results say that the average is between 30~40%. In the case of high rankers, especially those who are role-playing, it may be up to 70%.</span></p><br/><p><span>-Amazing, don’t they seem to be properly immersed? </span></p><br/><p><i><span>Tremble tremble.</span></i></p><br/><p><span>-In particular, the most popular roleplayer, user Kim Dalkwang of the militia, has released his latest status window. His assimilation rate is a huge 73%.</span></p><br/><p><span>-Whoa! Is that how he became a ranker?</span></p><br/><p><span>-The game publishers didn’t disclose how the assimilation rate affects performance, but it certainly has an effect. It is common sense that rankers have a higher rate of assimilation, since the assimilation rate determines the ranker’s abilities. Their skills, attacks and movements are superior in every way. Doesn’t this narrow down the difference between NPC’s and users?</span></p><br/><p><span>-Ah, scary NPCs! I don’t like NPCs!</span></p><br/><p><span>-Haha. Is that so? That is why users are attempting to create a village! I interviewed Elaine, an elf user who designed Shangri-la, the village of users...</span></p><br/><p><span>A restaurant staff member changed the television channel.</span></p><br/><p><span>\"Eh, the world is going crazy for games...”</span></p><br/><p><span>Jung Yiyu, who was immersed in the contents, recovered. Her friends who she was eating together with also turned their heads away.</span></p><br/><p><span>\"What is your assimilation rate?”</span></p><br/><p><span>“I’m around 20~30%?”</span></p><br/><p><span>\"I've gone over 40% but I’m usually around 30%.”</span></p><br/><p><span>Jung Yiyu laughed, </span><span>“I am 10%!”</span></p><br/><p><span>\"Hey, what is this?”</span></p><br/><p><span>\"Do you only play with the right side of your brain while the left side is sleeping?”</span></p><br/><p><span>“It’s a game. The thought of it being a game keeps me from being immersed... Well, I did level up.”</span></p><br/><p><span>\"You died to a rabbit.”</span></p><br/><p><span>“What? How did a rabbit kill you? Is that possible? Do rabbits even attack?”</span></p><br/><p><span>Yiyu sighed.</span></p><br/><p><span>\"I don't know. I tried to attack it, but the rabbit bit my legs. I was constantly bitten by the rabbit and died from severe bleeding.”</span></p><br/><p><span>“Amazing.”</span></p><br/><p><span>“Crazy...”</span></p><br/><p><span>Jung Yiyu laughed.</span></p><br/><p><span>\"But don’t worry. Now my troubles are over, since my brother has started playing the game.”</span></p><br/><p><span>\"Ah, that brother?”</span></p><br/><p><span>“Yes. Oppa will become a high ranker quickly and take care of me. I will catch up to all of you.”</span></p><br/><p><span>A friend who was listening interrupted her, \"Why will he become a high ranker?\"</span></p><br/><p><span>“My brother is a soldier.”</span></p><br/><p><span>“Soldier?”</span></p><br/><p><span>\"Will a soldier be more familiar with something like Elder Lord?”</span></p><br/><p><span>\"There are plenty of army men.”</span></p><br/><p><span>\"He was in a real battlefield, not a normal soldier. Do you know the foreign troops? He shot people in the Middle East and Africa.”</span></p><br/><p><span>“Really? Then he has killed people?”</span></p><br/><p><span>Everyone’s gaze turned to Yiyu, who shrugged.</span></p><br/><p><span>\"I don't know, he doesn’t talk about it...”</span></p><br/><p><span>“Amazing. A friend of my brother’s is a martial arts player and adapted immediately. Isn’t he a ranker now?”</span></p><br/><p><span>“Hey, Jung Yiyu. Don't pretend not to know me later.”</span></p><br/><p><span>Yiyu shrugged at her friends.</span></p><br/><p><span>\"So be good to me.”</span></p><br/><p><span>However, Yiyu didn’t know one important thing about Ian, whom she was putting all of her expectations in.</span></p><br/><p><span>He chose the orc that was called the game maker’s mistake.</span></p><br/><p>I have a Glossary of Common Korean Terms for any unfamiliar honourifics or other Korean elements that you might be unfamiliar with.</p><br/><p>My editor Superposhposh also created a glossary to keep track of everything. Currently it is up to chapter 5 so be careful of spoilers. Glossary Link. </p><br/><p>Current schedule: 2 chapters a day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I release a chapter. I am also opening sponsored chapters at $50 a chapter. Any support would be appreciated.</p><br/>\n</div>"}