{"title": "Chapter 34 - Contrast (1)", "id": 34, "volume": 1, "url": "http://boxnovel.org/praise-the-orc-chapter-34-contrast-1", "volume_title": "Volume 1", "body": "<h1>Chapter 34 - Contrast (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 34 - Contrast (1)</span></p><br/><p><span>Crockta wasn’t impressed as he finally entered the elven city of Arnin.</span></p><br/><p><span>Of course, everything was well organized. The scale of the buildings was enormous, and the beautiful elves smelling the leaves of the trees looked like the gods from Greek mythology. </span><span>But it wasn’t any more grandiose than Orcrox Fortress. Apart from the elves’ buildings being whiter with their aesthetic tastes, the level of construction in the city was similar to that in Orcrox.</span></p><br/><p><span>So he wasn’t impressed like the elf guiding him expected.</span></p><br/><p><span>“It has been a long time since I’ve seen an orc. How about it, isn’t our city beautiful compared to what you are used to?”</span></p><br/><p><span>Crockta nodded slightly.</span></p><br/><p><span>\"Look, this building is in the latest Bellitran style. It is an architectural style developed by the elf architect, Bellitran. It was a revolution. There was an uproar in the capital. To emphasize the depths...”</span></p><br/><p><span>“Where is Ilya?</span></p><br/><p><span>Crockta interrupted. </span><span>The elf pouted with dissatisfaction.</span></p><br/><p><span>\"Don’t be in a hurry. Once you learn more about Arnin...”</span></p><br/><p><span>\"I didn’t come here to play.”</span></p><br/><p><span>Crockta looked around. </span><span>There were only two species in Arnin, humans and elves. They were mostly elves, and occasionally humans could be seen. </span><span>But most users were humans. </span><span>In his eyes, they all seemed suspicious, like they were members of the Thawing Balhae Clan.</span></p><br/><p><span>\"Oh, you are urgent. Too urgent. I know why you came here, but you shouldn’t live like that.”</span></p><br/><p><span>“......”</span></p><br/><p><span>“Okay. Follow me.\"</span></p><br/><p><span>The elf raised a hand to Crockta’s shoulder. </span><span>He turned away from the residential area of Arnin where they were walking into an alley between two buildings. The elf increased his pace. </span><span>Arnin was filled with greenery, so it wasn’t hard to keep up with his movements. He jumped between trees like a monkey and led Crockta to a hidden place in the city.</span></p><br/><p><span>Soon, an entire forest was revealed. There was a lush forest inside the city. </span><span>As the elf ran through the forest, his form temporarily couldn’t be seen. Crockta sped up as he headed in the direction that the elf had disappeared.</span></p><br/><p><span>It was a while before Crockta caught up with him again. The elf was sitting at a round wooden table in the middle of the forest.</span></p><br/><p><span>“This place?”</span></p><br/><p><span>\"I have fond childhood memories here. It is also a safe place.”</span></p><br/><p><span>The elf grinned.</span></p><br/><p><span>\"I am Ilya.”</span></p><br/><p><span>“I guessed so.”</span></p><br/><p><span>“Is that so? Huhu. I was surprised when Derek suddenly said he would help me... It is even more surprising that the person sent is an orc.”</span></p><br/><p><span>He waved his hand. The magic power swayed and a few leaves fell into his hands. </span><span>He arranged them on top of the table. </span><span>\"Our objective is the same, so let’s join hands.”</span></p><br/><p><span>“Please explain in detail.”</span></p><br/><p><span>\"You want to get rid of the group of cursed people called Thawing Balhae. I want to get rid of the corrupt people who colluded with Thawing Balhae and establish a clean order in Arnin.”</span></p><br/><p><span>\"Corrupt?”</span></p><br/><p><span>\"Who is the corrupt person?”</span></p><br/><p><span>Ilya placed three leaves on the round table and picked up one of them. It had a hole in it from where a worm had bitten through. Ilya raised it to his eyes. </span><span>His blue eyes were visible through the hole.</span></p><br/><p><span>\"Arnin’s mayor, Elsanad.”</span></p><br/><p><span>Crockta nodded. He recalled Derek’s voice.</span></p><br/><p><span>‘I have planned a few investments on the premise that you are successful in your revenge.’</span></p><br/><p><span>Derek was betting on the collapse of the Arnin mayor. </span><span>Crockta looked into Ilya’s eyes. </span><span>Derek was absolutely not a good person. It was hard to believe in Ilya if he had a good relationship with Derek.</span></p><br/><p><span>Ilya shrugged.</span></p><br/><p><span>\"All you have to do is hit the Thawing Balhae Clan with me. I will take care of the rest, so don’t worry.”</span></p><br/><p><span>“...Um.”</span></p><br/><p><span>But Crockta wasn’t a good person either. His goal was a bloody revenge. </span><span>Therefore, he would join hands with Ilya for the collapse of a common enemy.</span></p><br/><p><span>“I understand.”</span></p><br/><p><span>“It sounds like you have decided to do it together with me, so let me explain in more detail.”</span></p><br/><p><span>Ilya placed a hand on the round table. Suddenly, the wind blew away the leaves.</span></p><br/><p><span>\"In the past, Mayor Elsanad and I were friends. She was a dear friend of mine.”</span></p><br/><p><span>His eyes became distant as he recalled the past.</span></p><br/><p><span>\"We once wanted to make Arnin a happy place for everyone. We were young. I helped her to become the mayor. However, she gradually changed. After getting the taste of power, she changed. Now she isn’t the Elsanad that I knew anymore.”</span></p><br/><p><span>“Is this related to the Thawing Balhae Clan?”</span></p><br/><p><span>\"Of course. She is conspiring with those cursed by the stars called Thawing Balhae...they started elf trafficking and the reconstruction of the city.”</span></p><br/><p><span>“......”</span></p><br/><p><span>\"The people you want to kill are the dogs of Mayor Elsanad, the ones enjoying profit from her. Here, let me show you.”</span></p><br/><p><span>Ilya beckoned to the air. </span><span>Then two elves walked out from among the bushes. Crockta wasn’t surprised since he had noticed them. Ilya introduced them, </span><span>\"They are my friends.”</span></p><br/><p><span>“It is nice to meet you.”</span></p><br/><p><span>“Nice to meet you.”</span></p><br/><p><span>They greeted Crockta. They felt something unusual in the orc’s eyes. Crockta greeted them.</span></p><br/><p><span>“Are you alive? I am the orc Crockta.”</span></p><br/><p><span>Ilya explained Crockta’s words. </span><span>\"This is an orc greeting.”</span></p><br/><p><span>The two elves moved. </span><span>The group left the forest where the round table was located, heading in the opposite direction from the way Crockta entered.</span></p><br/><p><span>Crockta frowned as he saw the landscape outside of the forest. </span><span>It was far from the glamorous Arnin that he saw earlier. There were crumbling buildings and houses that were just barely keeping their shape. These were the streets of the poor. </span><span>It was like looking at the back alleys of Anail.</span></p><br/><p><span>\"I showed you Arnin’s sunny spot earlier, while this is Arnin’s shade. Nobody cares about this place.”</span></p><br/><p><span>Suddenly, there was a disturbance. </span><span>Ilya placed his finger to his lips in a ‘shh’ gesture. </span><span>They approached the place through some shade.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Crockta’s eyes widened. </span></p><br/><p><span>A group of humans were kidnapping an elf in front of an old house. </span><span>The elf’s mouth was covered with a towel and her body restrained so that she couldn’t move. The captured elf was twisting her body to resist, but she couldn’t go against the strength of many. </span><span>A kidnapping was taking place in broad daylight.</span></p><br/><p><span>“Damn!”</span></p><br/><p><span>Crockta tried to run out. </span><span>However, Ilya grabbed Crockta. His body was greatly shaking. Ilya looked startled as he saw Crockta’s arm trembling.</span></p><br/><p><span>\"Calm down.\"</span></p><br/><p><span>\"Look at that...!”</span></p><br/><p><span>\"I know where they are going.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>\"They are the small fries. Taking care of them will just make their leaders more vigilant. We must wipe them all out.”</span></p><br/><p><span>The kidnappers disappeared with the elf. Crockta took deep breaths to try and calm his anger.</span></p><br/><p><span>“You have a strong sense of justice. I’m really surprised.”</span></p><br/><p><span>“......”</span></p><br/><p><span>Ilya said, “Hang in there. I also want to save her right now. But numerous other women, children, and men have disappeared this way. We have to save them as well.”</span></p><br/><p><span>\"Doesn’t Arnin have security forces or guards?”</span></p><br/><p><span>“They do, but they don’t come here. It is an abandoned area.”</span></p><br/><p><span>“......”</span></p><br/><p><span>“One or two people will disappear and the empty houses will become a rich elven villa.”</span></p><br/><p><span>He pointed to a distant place. </span><span>New buildings were going up in that area. Elves and humans alike were sweating as they built a mansion. </span><span>It was strange comparing the large building to the old and ruined houses.</span></p><br/><p><span>Crockta asked,</span></p><br/><p><span>\"What about the kidnapped people?”</span></p><br/><p><span>“There are only a few options. Sold into slavery, selling their bodies, or worse.”</span></p><br/><p><span>Ilya placed an arm over Crockta’s shoulder.</span></p><br/><p><span>\"I also feel the emotions that you are currently feeling.”</span></p><br/><p><span>They looked around the slums for a while before entering the center of Arnin through the forest. </span><span>It was a stunning city compared to the streets that he had just seen. Elves were smiling as they walked the streets, looking like they were from photographs of famous brands.</span></p><br/><p><span>But it no longer looked beautiful to Crockta.</span></p><br/><p><span>\"I’ll introduce you to the inn where you will be staying for the time being.”</span></p><br/><p><span>\"When will the plan begin?”</span></p><br/><p><span>\"Tomorrow, or maybe as early as tonight.”</span></p><br/><p><span>Crockta nodded.</span></p><br/><p><span>\"I know that orc warriors are tough, but there are many enemies. Be well prepared.”</span></p><br/><p><span>Ilya guided Crockta to his accommodations. </span><span>It was a small inn located on the corner of the main street. The owner was an old friend of Ilya’s. He was surprised to see an orc but nodded at Ilya’s description. Then he welcomed Crockta.</span></p><br/><p><span>\"It is the first time I will have an orc guest, hahahat! You are really big and strong. Elves aren’t like this. Kuhuhuhut!”</span></p><br/><p><span>Despite being an elf, the owner had rugged muscles. </span><span>There were a few muscular people among the elves.</span></p><br/><p><span>\"Yes, aren’t you a little bit heavy? What is your weight? Is it three times mine? Hahat!”</span></p><br/><p><span>“......”</span></p><br/><p><span>\"Next time, you should exercise with me. Hahat!”</span></p><br/><p><span>Ilya paid for the inn.</span></p><br/><p><span>Crockta put down his luggage, left the inn, and looked around Arnin. </span><span>The rare appearance of an orc drew the attention of the elves. Crockta ignored their gazes and reached the fountain in the center of the main street.</span></p><br/><p><span>\"Can I ask you one thing?”</span></p><br/><p><span>He talked to a young man sitting idly at the fountain. </span><span>He was a human and he seemed to be thinking as he stared into the air. </span><span>Then he looked startled as Crockta appeared.</span></p><br/><p><span>“Wow, an orc! How surprising. What did you want to know?”</span></p><br/><p><span>\"What is Mayor Elsanad like?”</span></p><br/><p><span>\"Elsanad? She is an excellent mayor. She has made Arnin prosperous.”</span></p><br/><p><span>\"Is that so?”</span></p><br/><p><span>\"I hope she will be elected again. There is an upcoming election. I will vote as a citizen of Arnin.”</span></p><br/><p><span>Crockta nodded.</span></p><br/><p><span>\"So she has no problems?”</span></p><br/><p><span>“Problem... I heard that she’s worried that her daughter isn’t listening to her. Why? Do you want citizenship here?”</span></p><br/><p><span>\"Something similar.\"</span></p><br/><p><span>“Haha, Arnin is a livable city. Welcome.”</span></p><br/><p><span>“I will think about it. By the way, what were you thinking about so intently just now?”</span></p><br/><p><span>\"Ah...in fact...” </span><span>The young man struggled to open his mouth. </span><span>\"The person I love...how to... I want to confess...what do you think about expressing my heart publicly? Would you be impressed?”</span></p><br/><p><span>“......”</span></p><br/><p><span>\"I’m going to do a surprise event after calling her. I’ll make a heart with candles and serenade her, singing publicly in front of many people....”</span></p><br/><p><span>Crockta shook his head. </span><span>\"Get rid of that.”</span></p><br/><p><span>“...Huh?”</span></p><br/><p><span>\"Listen to my words.\"</span></p><br/><p><span>“T-Then...”</span></p><br/><p><span>\"Rather than a spectacular event, your sincerity will work better.”</span></p><br/><p><span>“...Ah...”</span></p><br/><p><span>“It is better to confess your heart when the both of you are alone.”</span></p><br/><p><span>Like this, he saved the life of the young man. </span><span>Crockta finished the conversation and got up from his spot.</span></p><br/><p><span>Something had been irritating him from the beginning. </span><span>Crockta turned his head. There was an elf looking at him from the middle of a crowd. He smiled as he noticed Crockta’s gaze. Crockta approached him.</span></p><br/><p><span>It was Ilya.</span></p><br/><p><span>\"Are you following me?”</span></p><br/><p><span>\"Yes, something like that. Please understand. Derek sent you, but I can’t trust you straight away.”</span></p><br/><p><span>He cleared his throat and placed an arm around Crockta’s shoulder. Then he lowered his voice. </span><span>“I heard your conversation with that young man.”</span></p><br/><p><span>“......”</span></p><br/><p><span>\"Just like that young man, Arnin’s citizens are being deceived. Everybody thinks she is a good person. The truth is...what we saw. The awful truth.\"</span></p><br/><p><span>Crockta and Ilya moved with their shoulders close to each other. As Crockta walked a little bit, he saw Ilya’s colleagues. </span><span>They whispered something to Ilya.</span></p><br/><p><span>“The date is decided. Tonight, we will move.”</span></p><br/><p><span>“......”</span></p><br/><p><span>“I will stop by the inn at midnight. I’ll see you then. Please be prepared.”</span></p><br/><p><span>Crockta nodded. </span><span>Ilya licked his lips before saying something else. </span><span>“Right now, your anger at their misdeeds is vivid. I have been waiting for someone with a strong sense of justice like you to come.”</span></p><br/><p><span>He grinned. </span><span>\"Arnin needs people like you. Welcome. Then...”</span></p><br/><p><span>He disappeared into the crowd with his group.</span></p><br/><p><span>Crockta considered his words. </span><span>A sense of justice. </span><span>It didn’t fit at all. He was angry at the scene, but that didn’t mean that it was due to a sense of justice. Crockta looked in the direction that Ilya had disappeared in for a while. His eyes blazed.</span></p><br/><p><span>He just had common sense.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule:  <strong>Another Patreon goal has been reached!! Thank you for the support. There will now be 13 chapters a week.</strong> Check out updated posting days here.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I release a chapter. I am also opening sponsored chapters at $50 a chapter. Any support would be appreciated.</p><br/>\n</div>"}