{"title": "Chapter 41 - Chesswood (2)", "id": 41, "volume": 1, "url": "http://boxnovel.org/praise-the-orc-chapter-41-chesswood-2", "volume_title": "Volume 1", "body": "<h1>Chapter 41 - Chesswood (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 41 - Chesswood (2)</span></p><br/><p><span>Crockta didn’t like the sound of footsteps behind him. </span><span>He stopped and looked back.</span></p><br/><p><span>“Why do you keep following me?”</span></p><br/><p><span>But the other person didn’t feel intimidated. </span><span>\"We’re just going the same way, so don’t flatter yourself. Did you rent this road? How much did you pay to rent it?”</span></p><br/><p><span>“......”</span></p><br/><p><span>It was Derek’s subordinate, Jeremy. </span><span>He had caught up as Crockta left Arnin, and headed northeast to Chesswood.</span></p><br/><p><span>“Good, renting is comfortable. Renter, renter, renter, renter...ick.” Jeremy</span><span> smiled at Crockta’s fierce glare. </span><span>“You are scary. Relax, Brother”</span></p><br/><p><span>“......”</span></p><br/><p><span>Crockta decided to ignore him. He started moving again.</span></p><br/><p><span>Jeremy whistled from behind him. </span><span>Jeremy’s whistling was very clear and high. At first, Crockta thought it was a flute sound. There was a time when he admired it, but now that whistling didn’t sound very pleasant.</span></p><br/><p><span>Jeremy’s whistle rang throughout the plains.</span></p><br/><p><span>Thus, they continued their awkward companionship.</span></p><br/><p><span>As the name suggested, the Chesswood area that they were heading to had small human villages scattered about in a checkered pattern. Chesswood wasn’t a big city like Arnin was, but a cluster of various small villages gathered together with their own system.</span></p><br/><p><span>What was the Thawing Balhae Clan doing there? Would he be able to find Grom’s new character, the traitor called Hyunchul, and get revenge?</span></p><br/><p><span>The future was unknown, so he had to do the best that he could right now. Crockta decided to just go there for now.</span></p><br/><p><span>As they headed further east from Arnin, the forest disappeared, and an oft-traveled trail could be seen. If he proceeded to the center of the continent in this direction, he would be able to reach the big cities of the other species.</span></p><br/><p><span>“Hey, Orc brother.”</span></p><br/><p><span>“...I am called Crockta.”</span></p><br/><p><span>“Oh. Are we already friendly enough to call each other by name? Is this Day 1 of our relationship?”</span></p><br/><p><span>“......”</span></p><br/><p><span>Crockta wanted to kill him.</span></p><br/><p><span>\"What are you going to do with the cursed people in Chesswood? Are you going to use the Concrete method?”</span></p><br/><p><span>“There is no need to know.”</span></p><br/><p><span>\"No, I’m Derek’s delegate, so I should know if you’re planning to do something strange. Our investment might fly away, after all. I need to know since our money is on the line.”</span></p><br/><p><span>\"Where did Derek invest in Chesswood?”</span></p><br/><p><span>“Secret, a secret.”</span></p><br/><p><span>At the end of his words, Jeremy was standing beside Crockta. Crockta glanced at him but didn’t point it out.</span></p><br/><p><span>\"Isn’t that a good sword? Is it expensive?” Jeremy asked.</span></p><br/><p><span>“It’s the work of the Golden Anvil clan.”</span></p><br/><p><span>\"Hyu, how great. I’m envious. I also want to buy a new sword.”</span></p><br/><p><span>As they talked, the two people started walking together.</span></p><br/><p><span>Jeremy started to whistle again. </span><span>Crockta didn’t know where it came from, but there was a melody to it. It wasn’t too bad to walk leisurely while listening to Jeremy.</span></p><br/><p><span>\"You are good.” He said. </span></p><br/><p><span>\"When I was a child, I was proud of both my whistling and my sword skills.” Jeremy</span><span> started whistling again. The sound was crisp, and sounded good overall. </span><span>\"Orc brother, do you know any songs?”</span></p><br/><p><span>“Songs?”</span></p><br/><p><span>\"I don’t think that a whistle can come out well from an orc’s lips, so how about a song? Your voice is pretty good.”</span></p><br/><p><span>“A song.”</span></p><br/><p><span>There was the orc song that he had learned from a pub in Orcrox. Maybe he should try it once. Crockta coughed. Jeremy looked at him with expectant eyes.</span></p><br/><p><span>\"Hmm hmm.” </span><span>He cleared his throat. It was slightly embarrassing singing this alone. </span><span>However, he couldn’t betray Jeremy’s expectations, so he started awkwardly singing the warrior’s song.</span></p><br/><p><span>“We are orcs! The mighty orcs! You’ll be in trouble if you mess with us! The great warriors have appeared. Humans, get lost! Elves...get lost! Dwarves, get lost...! Gnomes...”</span></p><br/><p><span>It was an exciting song when sung in a group, but it was shameful to shout it out alone. The contents of ‘Gnomes, get lost’ followed by ‘warriors don’t need a woman’ didn’t fall from his mouth.</span></p><br/><p><span>“......”</span></p><br/><p><span>Jeremy looked taken aback.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Jeremy flashed an awkward and nodded. </span><span>“G-Great.” </span></p><br/><p><span>It was humiliating. </span><span>It would’ve been okay if Jeremy had teased him. But even Jeremy wasn’t able to make fun of him! </span><span>He even pretended and gave Crockta a compliment!</span></p><br/><p><span>Crockta became anxious and dropped his head.</span></p><br/><p><span>It was impossible for humans to understand the wonderful song of orc warriors. He tried to maintain the spirit of victory. But he was a warrior who could face reality, so he couldn’t turn away from his conscious and pride.</span></p><br/><p><span>\"Isn’t every culture different? Ha, haha.”</span></p><br/><p><span>Crockta felt more shame at Jeremy’s nice remark. </span><span>Therefore, Crockta cleared his throat again. </span><span>He wanted to let this guy know what a real song was.</span></p><br/><p><span>He said, \"That was just a joke.” </span></p><br/><p><span>\"No. The song was good, Brother.”</span></p><br/><p><span>“I will let you hear what a real song is.”</span></p><br/><p><span>\"There is no need...”</span></p><br/><p><span>Crockta grabbed Jeremy’s shoulder. He flinched. </span><span>\"Jeremy.\"</span></p><br/><p><span>\"Yes...?”</span></p><br/><p><span>\"Have you ever been in love?\"</span></p><br/><p><span>\"L...Love?”</span></p><br/><p><span>\"Yes, love.”</span></p><br/><p><span>\"What...I did have a love relationship...?”</span></p><br/><p><span>“Then listen.”</span></p><br/><p><span>Crockta was very serious. </span><span>He closed his eyes and remembered the sound. </span><span>Right now he had the low bass tones of an orc that most singers couldn’t mimic.</span></p><br/><p><span>He recalled his school days. That boy’s genuineness as he wept still breathed in his chest. </span><span>He poured out the distant memories into the lyrics. </span><span>This song would suffice.</span></p><br/><p><span>Crockta’s voice poured out like a sigh.</span></p><br/><p><span>\"Just like I wasn’t prepared for the rain, I sent you away with silence.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Jeremy’s eyes widened. Crockta’s voice, which was strangely low, sank calmly. </span><span>The lyrics he sang were beautiful and melancholy, just like a poem.</span></p><br/><p><span>\"For a while, I would get drunk or sleep at dawn, trying to forget you.”</span></p><br/><p><span>“......”</span></p><br/><p><span>\"I can’t forget that time, I realized something while thinking...”</span></p><br/><p><span>“Ah...”</span></p><br/><p><span>Crockta’s low voice rang out. The bass tone was filled with heartbreaking emotions.</span></p><br/><p><span>\"A good person, if I had cherished you then, I wouldn’t have been so sad when we broke up...!”</span></p><br/><p><span>Jeremy closed his eyes. </span><span>Suddenly, an old relationship passed through his mind.</span></p><br/><p><span>Jane. Her name was unforgettable, Jane. Both of them were in love, but she was the daughter of a well known family, and Jeremy was just a swordsman from the back streets. It was a relationship that wasn’t possible. A painful love. She eventually left him, but Jeremy couldn’t blame her.</span></p><br/><p><span>She...was a good person... </span><span>Jeremy's eyes became wet.</span></p><br/><p><span>Now Crockta’s song was reaching the climax. The end of the heartbreaking love song rang out.</span></p><br/><p><span>“I would like to say that I will always protect you, please come back again...I’ll make amends...”</span></p><br/><p><span>His song was over.</span></p><br/><p><span>Crockta closed his eyes and become drunk on his emotions for a while. Just like there was black soul in reality, Elder Lord had the orcs. It was a vocal structure that seemed born for this type of song.</span></p><br/><p><span>A stunning performance.</span></p><br/><p><i><span>Clap.</span></i><i><span>Clap.</span></i><i><span>Clap.</span></i></p><br/><p><span>He opened his eyes at the sound of applause. It was from Jeremy. </span><span>However, he wasn’t the only one applauding. Crockta and Jeremy turned their heads at the same time. </span><span>There was a strange man wiping his watery eyes.</span></p><br/><p><span>\"I heard it very well. It was a song that really made me feel like my heart was breaking.”</span></p><br/><p><span>“You...”</span></p><br/><p><span>The man was carrying a musical instrument resembling a guitar. </span><span>\"I am the minstrel Blackmore. I was heading this way when I heard a heartfelt voice by chance. It was a really great song.”</span></p><br/><p><span>\"I am embarrassed.”</span></p><br/><p><span>\"Don’t be, Brother. It really was amazing. Your were hiding your singing skills.” </span><span>Jeremy also acknowledged Crockta’s song.</span></p><br/><p><span>Blackmore asked, \"Did you create that song?”</span></p><br/><p><span>“No, I just imitated the song of another singer.”</span></p><br/><p><span>\"I see... But the impression you have given me hasn’t faded. What is your name?”</span></p><br/><p><span>“I am called Crockta.”</span></p><br/><p><span>\"Based on your direction, are you perhaps heading to Chesswood?”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>\"I am also heading there. Do you mind if I accompany you?”</span></p><br/><p><span>\"Feel free to do so.\"</span></p><br/><p><span>Crockta and Jeremy were joined by Blackmore. A light conversation was started after that as Blackmore asked, </span><span>\"The lyrics to that song are especially beautiful. What is the title of the song?”</span></p><br/><p><span>\"As the lyrics said, it’s called ‘Good Person’.”</span></p><br/><p><span>“Good Person... How great. If you love a good person, you won’t be sad if you break up...”</span></p><br/><p><span>Blackmore nodded and wrote something in his notebook. </span><span>“Of course... That doesn’t mean that you weren’t really sad...”</span></p><br/><p><span>“Right...”</span></p><br/><p><span>\"Kuoh...”</span></p><br/><p><span>Paradoxical lyrics that a man could understand! </span><span>The eyes of the three men became distant. They were gazing at old memories.</span></p><br/><p><span>\"I had those days as well... Orc, why are you going to Chesswood? Are you going to participate in the contest...?”</span></p><br/><p><span>“Contest?”</span></p><br/><p><span>\"Ah, you don’t know. A small contest for minstrels will be held in Chesswood.”</span></p><br/><p><span>“Hoh, really?”</span></p><br/><p><span>\"It isn’t a big competition. It’s a small contest between the Chesswood villages, but the pride of the villages is at stake. I know since I am from Chesswood. That’s why I returned home after a long time.”</span></p><br/><p><span>\"I would like to see you play.”</span></p><br/><p><span>“Hahaha. Please come and watch. I will be singing.”</span></p><br/><p><span>The conversation continued as they walked along the road. </span><span>They started to enjoy music while walking. Blackmore played his instrument while Jeremy whistled. Crockta hummed along with his bold voice.</span></p><br/><p><span>A jazz conversation with their own melodies! </span><span>It was fun to enjoy the music without worrying.</span></p><br/><p><span>“What are you talking about?” </span><span>Suddenly, a voice was heard. Crockta looked in the direction of the sound.</span></p><br/><p><span>It was a group of humans. </span><span>Crockta didn’t miss the white star on the forehead of the woman riding in the lead.</span></p><br/><p><span>\"NPCs?”</span></p><br/><p><span>\"Isn’t this a funny combination? Orc musician?”</span></p><br/><p><span>There were five people, all users. </span><span>Jeremy was unconcerned but Blackmore welcomed them cheerfully. He greeted them.</span></p><br/><p><span>\"Hello!”</span></p><br/><p><span>The woman who seemed to be leading the group laughed and replied. </span><span>“Yes, hello. Mister Minstrel!” </span><span>She was also friendly to NPCs. She seemed to be familiar with Elder Lord.</span></p><br/><p><span>\"I am the minstrel Blackmore, and these two are Crockta and Jeremy, who are accompanying me to Chesswood.”</span></p><br/><p><span>Crockta and Jeremy lightly bowed.</span></p><br/><p><span>\"Oh my god, really? We are also going there.”</span></p><br/><p><span>She turned around and talked briefly with her group. She seemed to be asking if they should join up. </span><span>\"Then would you like to go with us? I would like to hear your music. Is everybody here a minstrel?”</span></p><br/><p><span>“Hahaha. I am the only minstrel, but they are musically talented.”</span></p><br/><p><span>“Wow, great.”</span></p><br/><p><span>Blackmore declared, \"Let’s go together. Sharing music is a wonderful thing.”</span></p><br/><p><span>The party increased. There was now a group of eight people heading to Chesswood.</span></p><br/><p><span>Blackmore was returning to his home after a long time, so he started to sing song reminiscent of his hometown. It was a singing skill that was just as wonderful as his skill with the musical instrument. The users clapped in response.</span></p><br/><p><span>Suddenly, Jeremy grabbed the hem of Crockta’s clothes and pulled him close.</span></p><br/><p><span>“Huh?”</span></p><br/><p><span>\"Brother, are they people cursed by the stars?”</span></p><br/><p><span>He asked in a low voice. He knew that Crockta was one of those cursed by the stars and that they could recognize each other. </span><span>Crockta nodded. </span><span>Jeremy whispered again to Crockta, \"Be careful.\"</span></p><br/><p><span>“About what?”</span></p><br/><p><span>\"Those guys and Chesswood.”</span></p><br/><p><span>Jeremy pulled Crockta a little further away from the group.</span></p><br/><p><span>\"Blackmore, I don’t think he knows the news yet.” </span><span>Jeremy squinted at Blackmore. Blackmore was playing his instrument with a bright face. </span><span>\"Chesswood isn’t an idle place right now.”</span></p><br/><p><span>“Then...”</span></p><br/><p><span>\"It is a land of discord due to the cursed people.”</span></p><br/><p><span>One user suddenly looked at the two of them. Jeremy slung his arm over Crockta and grinned. As the gaze of the user moved away, he whispered again in Crockta’s ears. </span><span>\"So these people over there are enemies.”</span></p><br/><p><span>“I see.”</span></p><br/><p><span>Certainly, Enyanis of Arnin had referred to Chesswood as in a state of pandemonium. </span><span>Crockta nodded.</span></p><br/><p><span>“Do you understand?”</span></p><br/><p><span>Jeremy hit Crockta’s chest and released him. Blackmore’s singing became louder.</span></p><br/><p><span>In the distance, the dim shape of a village started to appear.</span></p><br/><p>I will be turning off sponsored chapters for BEM and PTO for now while I catch up with Patreon chapters. I am also going on a trip to New Zealand for 5 days at the end of July, so need to stack up chapters for that.</p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule:  <strong>Another Patreon goal has been reached!! Thank you for the support. There will now be 13 chapters a week.</strong> Check out updated posting days here.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I release a chapter.</p><br/>\n</div>"}