{"title": "Chapter 40 - Chesswood (1)", "id": 40, "volume": 1, "url": "http://boxnovel.org/praise-the-orc-chapter-40-chesswood-1", "volume_title": "Volume 1", "body": "<h1>Chapter 40 - Chesswood (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 40 - Chesswood (1)</span></p><br/><p><span>“What will you do?” asked Jeremy, Derek’s subordinate.</span></p><br/><p><span>Derek had invested in Ilya betting on Elsanad’s downfall, but the results had turned in an unexpected direction. </span><span>Crockta had accused both Ilya and Elsanad.</span></p><br/><p><span>\"Wait a minute.\"</span></p><br/><p><span>Derek was writing at his desk in his office. Jeremy waited. Derek wrote something for a while before putting down his pen.</span></p><br/><p><span>\"I wish you luck... Let’s pray that the Ashira flowers will bloom soon... Which one is okay?”</span></p><br/><p><span>Jeremy’s eyes widened. </span><span>It was because there was a smile in Derek’s voice.</span></p><br/><p><span>\"I think both are good.”</span></p><br/><p><span>\"If you think it is bad, then you can tell me.”</span></p><br/><p><span>Jeremy nodded and asked Derek a question. </span><span>\"Is the person a man or a woman?”</span></p><br/><p><span>\"A man.”</span></p><br/><p><span>\"Then the former would be better.”</span></p><br/><p><span>\"But he is an elf.”</span></p><br/><p><span>\"Then I will recommend the latter.”</span></p><br/><p><span>\"You are very prejudiced about gender and species.”</span></p><br/><p><span>Derek laughed and picked up his pen again.  </span><span>The sentence about the flowers blooming was derived from an epic poem. The Ashira flowers decorating a garland meant a march of victory. </span><span>It was meant to express good luck, but in a less dry manner.</span></p><br/><p><span>\"Do you know how long it has been since I had to write a letter to fix an unexpected problem?”</span></p><br/><p><span>\"I’ve never seen it happen.”</span></p><br/><p><span>“Yes. It was so long ago that I don’t even remember it.”</span></p><br/><p><span>Derek placed the letter in an envelope and sealed it with candle wax and handed it to Jeremy. </span><span>“Very interesting.”</span></p><br/><p><span>\"Is this as you expected?”</span></p><br/><p><span>\"Jeremy, victory is only worth it if you meet a difficult and unexpected problem, and manage to jump over it.”</span></p><br/><p><span>Jeremy was told to deliver a letter. </span><span>The recipient was a name that he didn’t know.</span></p><br/><p><span>“Who is it?”</span></p><br/><p><span>\"Who? My new puppet.”</span></p><br/><p><span>Derek laughed. </span><span>\"Our orc warrior has upset Arnin, so now I need someone to fix it.”</span></p><br/><p><span>“Then...”</span></p><br/><p><span>\"The bad guys have been cleansed. However, new villains always appear in the world.”</span></p><br/><p><span>Jeremy nodded. </span><span>This was why he followed Derek. Jeremy had never seen any gaps in Derek. He responded as if everything was as expected, and produced results according to his own will.</span></p><br/><p><span>It was also true for his incident. Crockta did things in a way that they hadn’t expected. Ilya, whom they had invested in, was now a criminal and would be held in Arnin’s dungeon. </span><span>Derek had said that this was unexpected, but Jeremy didn’t think so. Derek had plenty of precautions for just in case.</span></p><br/><p><span>In the larger picture, Derek still controlled everything according to his will.</span></p><br/><p><span>\"Also, pass on the following information to Crockta.”</span></p><br/><p><span>\"Even though he broke the contract?”</span></p><br/><p><span>\"In a way, I was in the wrong.”</span></p><br/><p><span>Crockta had placed a condition in the contract. He wouldn’t do anything that would go against a warrior’s honor.</span></p><br/><p><span>\"I didn’t know that Ilya and Elsanad were such villains, so I suppose it was to be expected that Crockta would be so willful.”</span></p><br/><p><span>“I understand.”</span></p><br/><p><span>“Please. This time, I hope that you will help Crockta a bit.”</span></p><br/><p><span>Jeremy read the letter recipient’s name again and nodded. </span><span>The recipient was the Arnin Plains administrator, Enyanis.</span></p><br/><p><span>Now that Ilya and Elsanad had fallen, Arnin would need a new mayor. It didn’t matter who they were. As long as he accepted Derek’s help, he would become the new mayor of Arnin. The citizens would be enthusiastic about him without knowing his deceit. This was the world that Jeremy saw.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>The two politicians turned out to be criminals. </span><span>There was a city wide outrage. They desired a new beginning. As there was a lot of excitement for a fresh start, new politicians appeared in Arnin and spoke about clearing up the ugly past.</span></p><br/><p><span>The name of the honorary citizen Crockta also filled the city. </span><span>However, the orc didn’t want the attention and didn’t appear in front of the people. There was a huge response for Enyanis, the elf who appointed him as the honorary citizen.</span></p><br/><p><span>A statue of the honorary citizen was erected in Arnin Square. </span><span>It was of an orc, not an elf, nor a human.</span></p><br/><p><span>They didn’t write his name in respect for his will, but all of the citizens of Arnin knew who the honorary citizen was. It was an expression of the citizen’s wish for an ‘honorary citizen’ to appear again whenever Arnin was corrupted.</span></p><br/><p><span>\"I'm tired.\"</span></p><br/><p><span>Crockta hid his body because of his popularity. A hood covered his face, but it couldn’t hide the orc’s unique size, so he refrained from going out as much as possible.</span></p><br/><p><span>\"It is because you are the only orc in Arnin,” Enyanis said.</span></p><br/><p><span>\"Are you really leaving?”</span></p><br/><p><span>\"I have something to do.”</span></p><br/><p><span>“Too bad. It would be nice if you could’ve stayed longer.”</span></p><br/><p><span>Derek had unexpectedly given Crockta information about the next destination. Crockta became aware of another Thawing Balhae base. </span><span>The name of the destination was Chesswood.</span></p><br/><p><span>This time, Derek didn’t ask for anything. Derek’s messenger said that Crockta could do what he wanted. </span><span>It was hard for Crockta to guess Derek’s intentions, but he chose not to think too deeply. He would do what he needed to do.</span></p><br/><p><span>\"This was the first place I saw you.”</span></p><br/><p><span>Crockta and Enyanis were standing on the Arnin Plains where they first met. </span><span>Enyanis nodded. He looked at the rock that Crockta left behind. ‘A warrior doesn’t attack unarmed people.’ The thrill Enyanis felt at that time was still vivid in his mind.</span></p><br/><p><span>The orc in front of him was the type of person that he had never met before. </span><span>Many people spoke about justice with their mouths, but it was the first time he saw someone act directly on their words. </span><span>He was looking forward to the orc’s actions in the future.</span></p><br/><p><span>\"Where are you going?”</span></p><br/><p><span>“Chesswood.”</span></p><br/><p><span>\"Chesswood...”</span></p><br/><p><span>It is the land of humans.</span></p><br/><p><span>And the word that best suited it was ‘pandemonium.’ A cursed place. </span><span>But if it was this orc, it might turn out well.</span></p><br/><p><span>“Good luck. I hope that every step you take is filled with Ashira flowers.”</span></p><br/><p><span>“Thank you.”</span></p><br/><p><span>Crockta didn’t know what it implied, but it sounded good. </span><span>Suddenly, a yell was heard from those hunting the triters on the plains.</span></p><br/><p><span>“Wahh! Help me!”</span></p><br/><p><span>A man was running away from a triter, but Crockta wasn’t the one who moved. </span><span>Suddenly, dozens of arrows flew through the air and pierced the triter. </span><span>It was the skill of the user Yurin, who had joined the Arnin Plain’s Rescue Unit after Crockta. She winked as she noticed Crockta’s gaze. Crockta nodded.</span></p><br/><p><span>In addition to Yurin, other NPCs and users were wearing the red rescue vest that symbolized the Arnin Plains’ Rescue Unit. </span><span>Those who didn’t have the ability relied on the rescue unit to help them out with the triters. The Arnin Plains were filled with a lot of warmth.</span></p><br/><p><span>“This is your heritage.”</span></p><br/><p><span>The number of people who died hunting the triters greatly decreased. Crockta had made a contribution as the honorary citizen, alleviating the criticism towards other species.</span></p><br/><p><span>\"Well, let’s live and see each other again.”</span></p><br/><p><span>It was time to leave. </span><span>Crockta extended his fist in the orc manner. </span><span>Enyanis also extended his fist. The orc greeting was strange, but he could feel something. Something seemed to rise in him as his fist met the orc’s hard skin.</span></p><br/><p><span>The two people firmly bumped fists.</span></p><br/><p><span>Crockta turned around. </span><span>The large orc moved away from Arnin. It was calm after the great orc left.</span></p><br/><p><span>“Phew.”</span></p><br/><p><span>Somebody approached Enyanis, who had been staring blankly. </span><span>It was Jeremy, who had been sent by Derek. Jeremy whistled as he stood beside Enyanis.</span></p><br/><p><span>“Phew. That orc is truly frightening.”</span></p><br/><p><span>Enyanis stared at him. Jeremy turned around. </span><span>Both of them had already talked to each other. </span><span>Jeremy asked, \"Anyway, have you made up your mind?”</span></p><br/><p><span>\"You will definitely keep the promise?”</span></p><br/><p><span>“Of course. We'll help you.”</span></p><br/><p><span>\"I didn’t know a mere money lender would have so much money.”</span></p><br/><p><span>“Watch your mouth. Derek is more than that.”</span></p><br/><p><span>Enyanis nodded. </span><span>“Okay.”</span></p><br/><p><span>“It's a deal.\"</span></p><br/><p><span>\"But keep this in mind. I might receive political funds from you, but I won’t do anything unjust.”</span></p><br/><p><span>“We’ll soon see.”</span></p><br/><p><span>Jeremy grinned. Everyone was like that at first. </span><span>\"Then other people will come and talk to you about the rest. I have to go.”</span></p><br/><p><span>\"Are you going with Crockta?”</span></p><br/><p><span>\"He doesn’t need to know.”</span></p><br/><p><span>Jeremy looked in the direction that Crockta went. </span><span>Derek said it was fine, but Jeremy was unsure. He would keep a close eye on the orc.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Ian disconnected.</span></p><br/><p><span>He checked his watch and saw that he had been playing for a long time. The strange thing was that he didn’t feel dizzy or tired at all. His body was refreshed, like he had a good night’s sleep.</span></p><br/><p><span>He looked back on the previous game play. </span><span>He was immersed, like he really was Crockta. The things that happened in the place called Arnin truly made him furious.</span></p><br/><p><span>Thanks to Arnin, his achievement points had gone up tremendously. Despite accusing a high ranking NPC like the mayor, he seemed to have been praised for his influence in the world of Elder Lord. As his achievement points rose, his level also increased.</span></p><br/><p><span>Now there weren’t a lot of people playing Elder Lord who could ignore him.</span></p><br/><p><span>He went out to the living room and turned on the TV. [Elder Lord News] was playing, a program that briefly told news about the world of Elder Lord. </span><span>There was also news about Arnin’s mayor replacement. The details weren’t revealed, but it mentioned that Arnin’s mayor and mayor candidate were arrested after the accusation of a citizen.</span></p><br/><p><span>“Umm...”</span></p><br/><p><span>He checked his phone and saw that it was the busy time at the café. </span><span>He had left Han Yeori in charge. An image of her looking at him resentfully appeared in his head. </span><span>He needed to pay a bit of attention to her.</span></p><br/><p><span>Ian left his house and drove to the café. </span>After parking the car and entering the café, he heard the greeting of the new part-timer, Yoo Sooyeon.</p><br/><p><span>\"Welcome! This is Café Reason.”</span></p><br/><p><span>It was a cheerful voice that brightened up the listener’s mood. Ian nodded. Han Yeori had taught her well. </span><span>Han Yeori confirmed Ian’s appearance and said, “It’s the boss.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>There was something strange. </span><span>Yoo Sooyeon’s expression sank as she heard Han Yeori’s words. It felt like she had lost all sense of animation. It was a subtle distinction, but Ian could clearly feel it. </span><span>Han Yeori looked at Ian and nodded towards a corner.</span></p><br/><p><span>Ian turned towards where she was indicating.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Ian was surprised again. </span><span>A familiar woman was elegantly sitting down with her legs crossed while also drinking a cup of coffee.</span></p><br/><p><span>She was Ji Hayeon, the heir to the Myeongsong Group. She had already seen Ian and was smiling at him. </span><span>The men in suits that Ian had seen outside the café were because of her.</span></p><br/><p><span>Ian approached. Ji Hayeon spoke first. </span><span>\"Have you been busy these days?”</span></p><br/><p><span>\"I think Hayeon-ssi is busier than me.”</span></p><br/><p><span>\"That's right. I’m busy, but I made some time.”</span></p><br/><p><span>She took a sip of coffee. It was like a scene from a movie.</span></p><br/><p><span>\"Ian-ssi, do you want some coffee? Or are you tired of it, after owning a café?”</span></p><br/><p><span>\"Not really.\"</span></p><br/><p><span>\"Have you eaten?”</span></p><br/><p><span>There were a lot of questions. Ian smiled and shook his head. </span><span>“No.”</span></p><br/><p><span>\"Then do you want to go and have dinner together? I'll buy it for you.”</span></p><br/><p><span>Ian shook his head again. Ji Hayeon’s expression became sulky. </span><span>“I’m sorry, I’m going to eat dinner with someone else later.”</span></p><br/><p><span>“Who?”</span></p><br/><p><span>He looked at Han Yeori instead of answering. She was making a drink for a customer. </span><span>She seemed listless, so he was going to buy her delicious food.</span></p><br/><p><span>“Is it like that between you two?”</span></p><br/><p><span>\"It’s just a boss and employee relationship.”</span></p><br/><p><span>\"Hrm...”</span></p><br/><p><span>She looked at Ian like she was suspicious. Ian just shrugged. </span><span>The conversation between the two broke off. Ji Hayeon seemed to be thinking about something as she hesitated before opening her mouth.</span></p><br/><p><span>“Do you play Elder Lord?”</span></p><br/><p><span>Ian looked at her.</span></p><br/><p><span>Recently, he discovered that Elder Saga Corporation was an affiliate of the Myeongsong Group. </span><span>Therefore, he didn’t feel like her question was strange.</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>“I see.”</span></p><br/><p><span>\"What about Hayeon-ssi?”</span></p><br/><p><span>“I don’t. Um...maybe Ian-ssi shouldn’t play it either.”</span></p><br/><p><span>She could be called a shareholder of Elder Lord. Ian cocked his head. </span><span>\"Is there a problem?\"</span></p><br/><p><span>“Nothing, just...”</span></p><br/><p><span>Her voice trailed off.</span></p><br/><p><span>Ji Hayeon’s father, Ji Eunchul, didn’t allow his family to play Elder Lord.</span></p><br/><p><span>It was due to safety. </span><span>It was a secret that Elder Lord’s core system wasn’t properly controlled. Even though the user protection system on the capsules guaranteed the safety of the users, Ji Eunchul had strictly forbidden any shareholders from playing it.</span></p><br/><p><span>It was a matter that involved the reputation of the Myeongsong Group, so the company was using every means possible to find Yoo Jaehan, the only man who could solve it. </span><span>However, he was nowhere to be found.</span></p><br/><p><span>Ji Hayeon couldn’t explain that to Ian, so she laughed it off as a joke.</span></p><br/><p><span>“Don’t people turn violent after playing games? Huhu.”</span></p><br/><p><span>She glanced somewhere else. One of her bodyguards outside the café was pointing to his watch. It was almost time for her next appointment. </span><span>She wanted to cancel it for dinner with Ian, but it seemed like today wouldn’t work. She sighed. </span><span>\"I was rejected today. Do you dislike me?”</span></p><br/><p><span>\"That's impossible.\"</span></p><br/><p><span>Ian laughed. \"I’ll have dinner with you next time.”</span></p><br/><p><span>“Okay, it’s a promise. How about the day after tomorrow?”</span></p><br/><p><span>“Okay.”</span></p><br/><p><span>\"It’s a promise.”</span></p><br/><p><span>Ji Hayeon rose from his seat. </span><span>\"Then, I’ll see you the day after tomorrow.”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>She left the café with her unique and elegant gestures.</span></p><br/><p><span>Ian headed to the counter after seeing her off. Yoo Sooyeon greeted Ian. She had been helped by Ian, and had become noticeably brighter ever since she started the part-time job. </span><span>Han Yeori glanced at Ian.</span></p><br/><p><span>\"Boss-nim, what do you want? An expresso?”</span></p><br/><p><span>It was a sullen voice. Ian laughed. </span><span>\"Yeori.”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>\"Let’s close up early today, and come have a good meal with me.”</span></p><br/><p><span>“Omo, really?”</span></p><br/><p><span>Her expression changed in an instant. </span></p><br/><p><span>“Yes.”</span></p><br/><p><span>\"Ah, didn’t you have an appointment with her?”</span></p><br/><p><span>“No.”</span></p><br/><p><span>\"Can I eat something expensive?”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>Han Yeori nodded. </span><span>The café’s automatic door opened and some  customers entered. Han Yeori greeted them quickly.</span></p><br/><p><span>\"Welcome. This is Café Reason.”</span></p><br/><p><span>She once again returned to her normal animated self. Ian started laughing.</span></p><br/><p>Reminder, I will be having a monthly Q&amp;A on the Wuxiaworld Discord Channel. The next one is this Saturday evening Australian time. Click here to see when it is your time. </p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule:  <strong>Another Patreon goal has been reached!! Thank you for the support. There will now be 13 chapters a week.</strong> Check out updated posting days here.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I release a chapter. I am also opening sponsored chapters at $50 a chapter. Any support would be appreciated.</p><br/>\n</div>"}