{"title": "Chapter 44 - SMOKE (1)", "id": 44, "volume": 1, "url": "http://boxnovel.org/praise-the-orc-chapter-44-smoke-1", "volume_title": "Volume 1", "body": "<h1>Chapter 44 - SMOKE (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 44 - SMOKE (1)</span></p><br/><p><span>Higashi didn’t let Crockta think for any longer, charging over straight away. Crockta defended while his head was busily brainstorming.</span></p><br/><p><span>Think. </span><span>He had to think.</span></p><br/><p><span>He staggered as he was hit by the shield again. Higashi struck with not only his sword, but with his shield as well. </span><span>Crockta concentrated on thinking as he avoided Higashi’s attacks.</span></p><br/><p><span>How would he win this war?</span></p><br/><p><span>He swung his greatsword, which bounced off the shield. The attack was filled with momentum, but Higashi’s shield didn’t move. Rather, Crockta was kicked and rolled across the ground.</span></p><br/><p><span>He scanned the battlefield as he struggled to get up. Blackmore and Jeremy were being simultaneously pressured by several users. In the first place, this was a war caused by the clan for their own purposes. Their numbers would gradually increase.</span></p><br/><p><span>In the other clans, there might be really strong users like Higashi. Crockta’s power alone was insufficient to protect Chesswood.</span></p><br/><p><span>Crockta once again squinted at Laney. </span><span>Even if he lost the battle, he had to win the war.</span></p><br/><p><span>Crockta’s mindset had already returned to the Raven of the past as he focused on the most efficient method of winning. If his chances of victory were slim to none, he should struggle to get the most out of the situation. In order to do that, he would crawl on the ground to make it possible.</span></p><br/><p><span>Anyway, he couldn’t win this battle. </span><span>The number of users kept increasing, and even Jeremy was now trying to escape from the battle. Blackmore was also gradually becoming conscious of the rear. They would soon have to retreat.</span></p><br/><p><span>Crockta closed his eyes as he heard the screams of the villagers.</span></p><br/><p><span>\"What? Are you giving up?” Higashi asked.</span></p><br/><p><span>Crockta laughed instead of answering.</span></p><br/><p><span>‘Yes, look at me, Higashi. </span><span>Take a look at me, Laney.</span></p><br/><p><span>If there is to be a fight, then I’ll give you a hard time. </span><span>Look at me.’</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Laney rapidly gained fame after uploading the fight between the orc and the user hunters. Now her Youvids channel had tens of thousands of people visiting a day.</span></p><br/><p><span>The reason she did this was insignificant.</span></p><br/><p><span>She didn’t like bad people and she also got money. </span><span>She was able to earn money from upsetting the villains. That’s all it was. Laney wanted to distort the faces of those using dirty tricks while trying to avoid the eyes of others.</span></p><br/><p><span>It worked better than she thought, and she was now a famous Youvidser.</span></p><br/><p><span>Reports from other people also increased. </span><span>There was a piece of information that caught her eyes.</span></p><br/><p><span>The famous Thawing Balhae and other big clans were gathering in one area. Furthermore, they started to control the access of other users. </span><span>Those who didn’t belong to the clans were forced out by their threats.</span></p><br/><p><span>The name of the area was Chesswood.</span></p><br/><p><span>It was well known that clans would slaughter weak NPCs for their own benefit. There was a lot of talk about this in the Elder Lord community, but it was the first time in Elder Lord that they tried to rule an area and exclude others on such a large scale.</span></p><br/><p><span>Laney’s senses tingled. </span><span>She wanted to reveal disgusting actions.</span></p><br/><p><span>She hated the big clans. They used their size to nurture rankers and raise the clan. </span><span>If the former rankers enjoyed the fantasy life of Elder Lord, the newest rankers were just mechanical users fostered to make money.</span></p><br/><p><span>It stunk. </span><span>She went to learn what was happening in Chesswood. </span><span>Her class was the hidden piece called Shadow Assassin, and it was a character that specialized in hiding in the shadows. No one noticed her.</span></p><br/><p><span>When she first arrived, nothing had happened. It was an ordinary village. The special point was that all of the villagers loved singing and didn’t know how to fight. </span><span>It was a village where the residents welcomed travelers and lived without locking their doors.</span></p><br/><p><span>But Laney had accused users and she knew how dangerous this could be. </span><span>The clans would erase the Chesswood area in order to raise the level of the clan members. </span><span>The users entered Chesswood disguised as travelers, dividing sections of Chesswood among themselves.</span></p><br/><p><span>But Laney was distressed. </span><span>Could she really file a complaint about this? </span><span>The clans were gathering and killing NPCs, disturbing the balance of Elder Lord. But was this really something that people would consider a crime? </span><span>Would they respect NPCs who weren’t users?</span></p><br/><p><span>She didn’t know. </span><span>So she just continued shooting mechanically. Her idea was to watch until the end.</span></p><br/><p><span>Then the full-scale attack of the clans began. </span><span>Laney was able to find a black bandana that she had seen somewhere before.</span></p><br/><p><span>“Bul’tar──────!”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>He had changed, but it was the same bandana. An old bandana with the mark of the Blacksmith Company on it. </span><span>He was bigger, and there were tattoos all over his body, but he was the same orc.</span></p><br/><p><span>He appeared and started to fight for the villagers. The battle turned against the users in an instant. </span><span>He was like an incarnation of the battlefield as he ruthlessly swung his greatsword and cut down the users. There was a fountain of blood every time he moved his greatsword.</span></p><br/><p><span>However, it was only for a while. </span><span>Within a few minutes, the Yamato Clan’s vice-leader, ranker Higashi appeared. He and the other high level users had joined to help the clan members. </span><span>He was the main force of the Yamato clan.</span></p><br/><p><span>The orc and Higashi fought. At first, the orc fought enthusiastically, but was eventually pushed back by the difference in power. </span><span>Higashi effortlessly suppressed the orc.</span></p><br/><p><span>After Higashi appeared, the situation changed again. The residents resisting the users were broken, and the men helping along with the orc gradually retreated. </span><span>But the orc wielded his greatsword till the very end.</span></p><br/><p><span>“Ugh!”</span></p><br/><p><span>Higashi’s one-handed sword sliced the orc’s thigh. </span><span>The orc fell to his knees.</span></p><br/><p><span>\"Why don’t you run like your colleagues?”</span></p><br/><p><span>“......”</span></p><br/><p><span>The orc didn't answer. He raised his body using his greatsword. </span><span>The two people clashed again.</span></p><br/><p><span>The orc’s greatsword reached Higashi’s neck, but Higashi blocked it with his shield. The greatsword was deflected, revealing the orc’s abdomen that Higashi’s sword instantly sliced apart. Blood gushed out.</span></p><br/><p><span>The orc grabbed his abdomen.</span></p><br/><p><span>\"I’ll give you an opportunity. If you run away now, then I won’t chase you.” </span><span>Higashi twirled his one-handed sword as he walked up to the orc. </span><span>“Orc, why do you need to die for the humans over there?”</span></p><br/><p><span>Higashi shrugged. </span><span>Now the battle was over, and the only thing left was the massacre. The villagers couldn’t resist and were becoming the users’ experience. </span><span>In addition, those with weapons kept joining the battle.</span></p><br/><p><span>“Yes, even your allies ran away.”</span></p><br/><p><span>Laney filmed all of this. </span><span>She wondered what the orc would answer.</span></p><br/><p><span>But he never opened his mouth and continued the meaningless fight.</span></p><br/><p><span>The orc rushed back. </span><span>There were wounds all over his body. He was bloody. He tried to resist Higashi, but his body didn’t listen.</span></p><br/><p><span>\"Now this is just disgusting, you bastard!” Higashi cried out.</span></p><br/><p><span>During the fight, the orc slashed at one of Higashi’s arms. </span><span>It wasn’t a big wound, but Higashi’s face distorted. </span><span>He swung his sword with a fierce momentum and hit the orc, who flew through the air.</span></p><br/><p><span>It was towards Laney’s location. </span><span>She hurriedly moved her body. The orc hit the wall where she had been standing by and rolled to the floor. Blood stained the wall. </span><span>The orc crouched on the ground and used the greatsword to raise his body up. It seemed like it was harder for him to stand.</span></p><br/><p><span>Laney felt an unknown emotion. </span><span>What caused the orc to keep standing up?</span></p><br/><p><span>She recalled the voice of the orc in the past video that she shot.</span></p><br/><p><span>‘Where are the people who know honor?’</span></p><br/><p><span>Higashi approached and said, \"I definitely gave you a chance to get away. You have chosen death, you stupid orc.”</span></p><br/><p><span>His sword raised itself high in the sky to deal the final blow. </span><span>The blade glinted in the sun.</span></p><br/><p><span>The silent orc finally opened his mouth.</span></p><br/><p><span>\"You, is that right?”</span></p><br/><p><span>\"What?”</span></p><br/><p><span>The orc raised his gaze. </span><span>It was an intense gaze.</span></p><br/><p><span>“You.”</span></p><br/><p><span>The orc straightened and raised his greatsword. He yet again took a step towards Higashi. </span><span>The orc asked, \"You, can you just turn around and run away as you see people being slaughtered for no reason?”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Laney felt like she had been hit with a hammer on the head at those words.</span></p><br/><p><span>Higashi’s face distorted. </span><span>\"What are you saying now, you bastard!”</span></p><br/><p><span>“You don’t understand.” </span><span>The orc grinned through his bloody face. </span><span>\"It is you who is stupid, not me.”</span></p><br/><p><span>“Hah.”</span></p><br/><p><span>Higashi grinned and looked at the sky and angrily wielded his sword. </span><span>“This bastard!”</span></p><br/><p><span>The orc blocked with his greatsword. Then the shield slammed into his torso. He rolled on the ground together with the shield. </span><span>But the orc couldn’t get on his feet again. Higashi walked towards him with a face that was red with anger.</span></p><br/><p><span>He intended to really finish this. </span><span>But Higashi was forced to stop moving.</span></p><br/><p><span>At that moment. </span><span>A woman suddenly appeared beside the orc. </span><span>A masked woman wearing black clothes that clung to her body appeared.</span></p><br/><p><span>Laney, it was her.</span></p><br/><p><span>Higashi was unable to move because he was wary of the unknown strength he felt from her.</span></p><br/><p><span>“Who?”</span></p><br/><p><span>Laney didn't answer. Instead, she spoke to the orc. </span><span>“Hey.”</span></p><br/><p><span>The eyes of the fallen orc turned towards her. </span><span>“...You?”</span></p><br/><p><span>“There is no need to know who I am.”</span></p><br/><p><span>The orc stood up again. However, it seemed like it was difficult to raise his body due to the accumulated damage to his body. </span><span>In the end, the orc stretched out on the ground. </span><span>Laney raised her palm in a gesture for Higashi not to approach and asked the orc again.</span></p><br/><p><span>“Why are you fighting? It is a dog’s death.”</span></p><br/><p><span>Laney couldn’t understand it. </span><span>The orc, Crockta laughed. </span><span>Crockta squeezed out all the power in his body and got up again.</span></p><br/><p><span>[It wouldn’t be unusual for your broken body to die right away.]</span></p><br/><p><span>[Nevertheless, you keep getting back up.]</span></p><br/><p><span>[I pay homage to your spirit.]</span></p><br/><p><span>[Indomitable Fighting Spirit (Rare) has been upgraded to Combative Spirit (Essence).]</span></p><br/><p><span>\"Only humans worry about such calculations.”</span></p><br/><p><span>Crockta raised his greatsword and gestured to Laney to move. Laney turned sideways.</span></p><br/><p><span>This was the last one. </span><span>Higashi was in front of them. </span><span>Just before he charged forward, Crockta whispered to Laney.</span></p><br/><p><span>\"A warrior doesn’t yield to injustice.”</span></p><br/><p><span>That was one of the laws of a warrior that he heard from Lenox, an oath that he had sworn to uphold.</span></p><br/><p><span>Laney didn't answer. </span><span>It was no longer necessary to talk. Crockta glared at Higashi. It was time to end this. </span><span>Crockta squeezed out his remaining strength to deliver a battle cry.</span></p><br/><p><span>“An honorable death is better than a craven life──────!”</span></p><br/><p><span>His roar shook the area.</span></p><br/><p><span>Crockta ran forward. Higashi, who had paused at Laney’s appearance, also got ready for the final clash. </span><span>The two rushed at the same time. </span></p><br/><p><span>At that moment, Laney reached out and hit the back of Crockta’s neck.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Neat work! </span><span>Crockta collapsed. Laney grabbed Crockta’s huge body.</span></p><br/><p><span>“What?”</span></p><br/><p><span>Higashi hesitated. He felt like Laney was a tough opponent and had been wary since she appeared. </span><span>Laney just sighed. </span><span>She cast a Shadow Assassin skill.</span></p><br/><p><span>[Shadow Escape (Essence) has been used.]</span></p><br/><p><span>[It can’t be used for another 168 hours.]</span></p><br/><p><span>Laney and Crockta’s bodies started blurring. They were like a shadow as they became translucent and disappeared, completely gone from the previous scene. </span><span>Laney’s body appeared far away from Dandelion Village.</span></p><br/><p><span>“Aigoo, aigoo. Ah, why did I do that? What’s going on?”</span></p><br/><p><span>Laney grabbed her head. </span><span>It was an impulsive behavior.</span></p><br/><p><span>As she was groaning, Crockta was snuck a peek at Laney from the ground, smiling with satisfaction.</span></p><br/><p><span>That’s right.</span></p><br/><p><span>He actually wasn’t knocked out! </span><span>Laney was strong, but that wasn’t enough to make an orc faint. </span><span>He just pretended to be stunned. </span><span>He didn’t know that she had such a miraculous skill, but he was able to achieve the result that he wanted.</span></p><br/><p><span>Had she filmed it?</span></p><br/><p><span>Crockta smiled before hurriedly closing his eyes and pretending to be stunned as Laney glanced over him. Laney’s lamenting continued. </span><span>A man had to resort to trickery to grab her heart!</span></p><br/><p><span>If he asked for help, then Laney would’ve ignored him. Instead, he showed the tragic image of a warrior who was about to die. </span><span>Even if she didn’t help, Crockta would lose nothing. He was a user. He could live again. He didn’t care about death.</span></p><br/><p><span>In the first place, what he was trying to save wasn’t his own life.</span></p><br/><p><span>He wanted Laney’s help with Chesswood’s plight.</span></p><br/><p><span>In order to win the war, he needed to use everything in his favor.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule:  <strong>Another Patreon goal has been reached!! Thank you for the support. There will now be 13 chapters a week.</strong> Check out updated posting days here.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I release a chapter.</p><br/>\n</div>"}