{"title": "Chapter 59 - Quantes (2)", "id": 59, "volume": 1, "url": "http://boxnovel.org/praise-the-orc-chapter-59-quantes-2", "volume_title": "Volume 1", "body": "<h1>Chapter 59 - Quantes (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 59 - Quantes (2)</span></p><br/><p><span>Crockta drank with Tiyo and the rest of the garrison before returning to his accommodation. It was a clean inn. The city of gnomes was a good place to stay because it was clean throughout.</span></p><br/><p><span>The innkeeper was wary towards Crockta, but eventually accepted his money and reluctantly gave him a room.</span></p><br/><p><span>“Your room is Number 304. Here is the key.”</span></p><br/><p><span>\"Thank you.\"</span></p><br/><p><span>Crockta went up to his room and opened the door. The first thing that stood out to him was the white sheet.</span></p><br/><p><span>“Hoh.”</span></p><br/><p><span>Everything was arranged without error like in a hotel instead of an inn. Everything was clean. It was enough to make him forget the innkeeper’s unkind attitude.</span></p><br/><p><span>Crockta sat down on the bed. He could see the bathtub from there through the half-open door of the bathroom. This meant the drainage facilities were good. Crockta marveled at the level of civilization that the gnomes had achieved. It seemed like they weren’t just experts in magic engineering.</span></p><br/><p><span>The accommodation was a little expensive, but it was reasonable if the facilities were this clean.</span></p><br/><p><span>Crockta laid down on the bed and thought of what to do next.</span></p><br/><p><span>First, look for information about the North. He also needed to prepare for the trip. If possible, find some colleagues. The north was a harsh land so it was better to go with other people instead of alone.</span></p><br/><p><span>“Temple of the Fallen God...”</span></p><br/><p><span>He wondered if he could find answers there.</span></p><br/><p><span>Crockta reached out for the ceiling.</span></p><br/><p><span>The rough hands of an orc were visible. He slowly formed a fist. As he used his strength, his blood vessels could be seen through the green skin. The muscles protruded and the blood pumped stirred along with his heartbeat. His whole body felt full of vitality.</span></p><br/><p><span>Was this truly a fantasy world? </span><span>Crockta was overwhelmed by an unknown feeling after he met the man called Gordon. It seemed like he could find the answer if he went to the Temple of the Fallen God.</span></p><br/><p><span>“Hoo.”</span></p><br/><p><span>Crockta got up from the bed. It was nighttime, but Users didn’t need to sleep. He headed to the bathroom to wash up. </span><span>However, there were no towels in the bathroom. Crockta went down to the counter on the ground floor to receive a towel and returned to his room.</span></p><br/><p><span>An elf was using a key on the door next to Crockta. </span><span>Their eyes met. </span><span>The elf stared at Crockta.</span></p><br/><p><span>Crockta greeted her, “...Hey, are you alive?”</span></p><br/><p><span>“......”</span></p><br/><p><span>The elf didn’t respond and just walked through the door. </span><span>Crockta shrugged. He had endured many cold winds blowing from women before.</span></p><br/><p><span>Crockta opened the door and entered the bathroom. </span><span>He decided to take a soak in the bathtub. The burning hot water sloshed against the thick skin of the burly orc. Crockta buried his body deep into the narrow bathtub and closed his eyes.</span></p><br/><p><span>It was relaxing. </span><span>He was an orc, so would he dream an orc’s dream? The distant scenery of Orcrox Fortress appeared as he lightly napped.</span></p><br/><p><span>He saw Lenox, as well as Grant and Hoyt. </span><span>He seemed to have a dream about fighting the enemy with a lot of orcs.</span></p><br/><p><span>Crockta opened his eyes. </span><span>His keen hearing had captured a small noise from across the bathroom wall and in the next room. </span><span>He recalled the appearance of the female elf who he met before.</span></p><br/><p><em><span>Smack lips. Slurp.</span></em></p><br/><p><span>There was a noise. An unpleasant noise.  </span><span>He heard the sound of something chewing. Crockta left the bathtub and held his ear close to the bathroom wall.</span></p><br/><p><em><span>Drip.</span></em></p><br/><p><span>At that moment, a drop of water on the ceiling fell back towards the tub.</span></p><br/><p><span>\"Ohuum...um...”</span></p><br/><p><span>He heard a groaning sound.</span></p><br/><p><span>It was the sound of a pained scream that was being blocked by something, a familiar sound to Crockta. When he had struck at the Thawing Balhae Clan members, they would make this sound through the gag.</span></p><br/><p><span>Crockta’s eyes cooled.</span></p><br/><p><span>He left the bathroom and roughly put on clothes before grabbing his greatsword. </span><span>He killed the sound of his footsteps and approached the next room where the elf was. </span><span>As he came closer, his ears could hear the subtle sound again.</span></p><br/><p><span>\"Hup...um...!”</span></p><br/><p><span>The groaning became more vivid. </span><span>Crockta immediately kicked at the door, breaking both the door and its latch wide open.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Crockta was speechless at the sight before him. </span><span>An elf was lying on the floor with both of her arms bound. </span><span>Another elf had their face buried in her thigh and was chewing on it. </span><span>Blood flowed from the flesh.</span></p><br/><p><span>“...Grr?”</span></p><br/><p><span>The elf who was eating the thigh turned their gaze towards Crockta. The white part of their eyes was black, and their teeth were also extremely sharpened as if they weren’t an elf's. </span><span>More than anything else, her appearance was the same as the elf who was bound.</span></p><br/><p><span>Doppelganger!</span></p><br/><p><span>The doppelganger discovered Crockta and flashed a wicked grin and a mocking expression. Crockta’s face distorted.</span></p><br/><p><span>“Bul’tar!”</span></p><br/><p><span>Crockta rushed forward and wielded the Ogre Slayer. The doppelganger retreated with bizarre movements that weren’t like a human.</span></p><br/><p><span>“Ufff...!”</span></p><br/><p><span>The doppelganger did such rough movements using the elf’s face. </span><span>Crockta quickly squinted at the injured elf and pulled her towards him.</span></p><br/><p><span>“Are you okay?”</span></p><br/><p><span>“......”</span></p><br/><p><span>The elf didn’t reply, like she had fainted. Crockta placed the elf behind him and raised his greatsword. The doppelganger stared at him with mocking eyes. </span><span>The moment that Crockta approached, the doppelganger turned around.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>It was like it was listening to something. </span><span>Crockta didn’t miss that small gap and jumped. </span><span>He swung his greatsword, but the doppelganger avoided Crockta’s attack with a strange elasticity that wasn’t elf-like.</span></p><br/><p><span>It hangs to the ceiling upside down like a spider.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Crockta was confused but the doppelganger still had its head turned and was paying attention to something out the window.</span></p><br/><p><span>“What are you looking at? Bring it on!” Crockta shouted.</span></p><br/><p><span>The doppelganger spun its head. </span><span>It hung upside down and its body didn’t move at all, with only the neck turning in the opposite direction.  </span><span>Crockta got goosebumps as an elf showed such bizarre movements.</span></p><br/><p><span>The doppelganger whispered, \"Calling me...” </span><span>It was a strange voice. </span><span>“It is calling...”</span></p><br/><p><span>Crockta waved his greatsword vertically towards the doppelganger on the ceiling. The doppelganger twisted its body to avoid it and fell to the floor. </span><span>Then it broke the window and ran outside.</span></p><br/><p><span>“This!”</span></p><br/><p><span>Crockta looked out the window. The doppelganger landed on the ground. </span><span>The black shadow of the doppelganger fell into the darkness of the city at a tremendous speed. Soon its appearance couldn’t be seen anymore.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>A truly bizarre monster. </span><span>It was literally as Tiyo said: The doppelganger was a threat to Quantes. </span><span>Ogres and doppelgangers. It definitely wasn’t ordinary. What was going on in Quantes right now?</span></p><br/><p><span>Crockta turned back to the elf, who had lost consciousness.</span></p><br/><p><span>“Wake up.”</span></p><br/><p><span>Crockta shook her. </span><span>Then he could hear the sound of running. It seemed like people were coming due to the chaos of the fighting and the broken window. Crockta shouted.</span></p><br/><p><span>\"This way!\"</span></p><br/><p><span>The innkeeper wasn’t the only one who appeared, since he had already called Quantes’ garrison soldiers. Crockta beckoned.</span></p><br/><p><span>\"You came. This elf here was attacked by the doppelganger...”</span></p><br/><p><span>“As expected from the outsider!”</span></p><br/><p><span>The innkeeper cut off Crockta’s words. Crockta shook his head. </span><span>\"There seems to be a misunderstanding. I didn’t...”</span></p><br/><p><span>\"What are you doing? Arrest that orc!”</span></p><br/><p><span>The gnomes of the Quantes garrison approached. None of them were the soldiers whom he had fought and played with during the day. </span><span>The gnomes in uniform pointed guns, similar to the Asura Thousand Wave Artillery, at the harsh looking orc with nervous expressions on their faces.</span></p><br/><p><span>“We will take you to jail. Come along obediently.”</span></p><br/><p><span>Crockta spoke again, “It is a misunderstanding. The doppelganger is...”</span></p><br/><p><span>“......”</span></p><br/><p><span>They stared at him with disbelieving eyes. </span><span>Crockta sighed. He didn’t want to cause any trouble. He had a connection with Tiyo and the other garrison members, so he decided to follow the procedure for now.</span></p><br/><p><span>\"You will know that you made a mistake once the elf wakes up. Please treat this elf quickly,\" Crockta said. </span><span>He held out his hands without resisting and continued. </span></p><br/><p><span>\"There is a procedure so please follow it.” </span><span>The gnome soldiers handcuffed him.</span></p><br/><p><span>\"Of course, I respect you.” </span><span>Crockta grinned.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Thanks to the elf’s testimony, Crockta was soon released but the sun was already rising. He had stayed all night in a narrow solitary confinement so his body was stiff. </span><span>The gnome guards respectfully apologized. Crockta politely accepted their apology.</span></p><br/><p><span>\"You were just following procedure. I understand.”</span></p><br/><p><span>“I’m sorry.”</span></p><br/><p><span>Crockta shook hands with the gnome defenders and stepped outside. </span><span>Quantes was lively in the morning. The gnomes that came up to Crockta’s waist were busy coming and going. The gnomes were small in stature, so it was like a panoramic view.</span></p><br/><p><span>He was looking around for a good restaurant when someone spoke to him, “Excuse me.”</span></p><br/><p><span>“Huh?”</span></p><br/><p><span>It was the female elf that Crockta saved last night. She approached Crockta. </span><span>\"You saved me, right? I have been waiting to thank you.”</span></p><br/><p><span>Crockta thought as he watched her bow. </span><span>Was the elf who opened the door with the key and ignored his greeting the real elf or the doppelganger?</span></p><br/><p><span>The elf smiled gently at Crockta’s stare. </span><span>\"I’m sorry for not responding to you the first time. I am a very shy person.”</span></p><br/><p><span>It was like this. Crockta nodded. </span><span>\"You don’t have to thank me. Anyone else would’ve done it.”</span></p><br/><p><span>\"Nobody else did it.”</span></p><br/><p><span>She had a limp, and there was a bandage around the portion of the thigh that was eaten by the doppelganger. </span></p><br/><p><span>Crockta asked, \"Are you okay?”</span></p><br/><p><span>“Yes. It isn’t a severe injury, thanks to you. Thank you.”</span></p><br/><p><span>\"How did you get hit by the doppelganger?”</span></p><br/><p><span>\"I don’t know. I walked into my room when someone who looked exactly like me popped out from the corner...” </span><span>She shuddered. </span><span>“I thought I was going to die.”</span></p><br/><p><span>\"You were lucky. Be careful from now on.”</span></p><br/><p><span>\"Orc, what is your name?”</span></p><br/><p><span>“Crockta.”</span></p><br/><p><span>The elf’s eyes widened. She didn’t know the details, but it seemed like she had heard the name before.</span></p><br/><p><span>“Ah, that...”</span></p><br/><p><span>\"What is your name?\"</span></p><br/><p><span>\"I'm Eileen.\"</span></p><br/><p><span>After a quick conversation on the street, Eileen decided to treat Crockta to a meal. They headed to a nearby restaurant. </span><span>Crockta ordered a thick steak while she ordered a salad.</span></p><br/><p><span>“Are you going to the north?”</span></p><br/><p><span>\"I want to find the Temple of the Fallen God.”</span></p><br/><p><span>\"The Fallen God...” </span><span>She didn’t know it. </span><span>“It’s the first time I’ve heard of it, but the north is known as a dangerous place...”</span></p><br/><p><span>\"A warrior isn’t afraid of danger.”</span></p><br/><p><span>“How great.”</span></p><br/><p><span>\"Why did you come to Quantes?”</span></p><br/><p><span>\"I am studying magical engineering at Quanta’s Academy.”</span></p><br/><p><span>Crockta nodded. The gnomes’ skills in this field of research were world renowned. It wasn’t strange for people to study with them.</span></p><br/><p><span>\"In particular, I am studying artifacts that were recently excavated in Quantes.”</span></p><br/><p><span>“Artifacts?”</span></p><br/><p><span>“Yes. It is an ancient and mysterious legacy that can’t be created with today’s technology.”</span></p><br/><p><span>Artifacts were more than just magic enchanted items. There were some users who obtained artifacts. However, after their existence was known, the users were killed and the artifacts were stolen. </span><span>Then Eileen lowered her voice, \"In particular, the thing discovered this time... it is a belt called the Demon’s Mouth.”</span></p><br/><p><span>“Demon’s Mouth...?”</span></p><br/><p><span>“Yes. The exact purpose of its existence hasn’t been revealed, but it is a strange thing that emits a dreadful aura. There are rumors that the researchers who first discovered it went mad when studying it.”</span></p><br/><p><span>The Demon's Mouth. Crockta was curious about it. But Eileen didn’t know the details either.</span></p><br/><p><span>\"Right now, the gnomes have sealed it, and are arguing if they should continue studying it or not... I wish I could continue my research. I came because of it.”</span></p><br/><p><span>“I’m also curious. Let’s pray,” Crockta said as he chewed on his steak. </span><span>It was oversized, but the amount was still small. However, the taste was wonderful.</span></p><br/><p><span>Eileen asked, \"Are you going to visit the academy today?”</span></p><br/><p><span>\"Hmm...\"</span></p><br/><p><span>Crockta planned to follow Tiyo’s advice and stop by the academy for information about the North. Crockta thought for a moment before nodding.</span></p><br/><p><span>\"I have no other plans so I will do so.”</span></p><br/><p><span>\"Then can I guide you around the academy?” </span><span>Eileen said with a smile. Crockta nodded without any hesitation. Unlike her first impression, she was a moderately friendly elf.</span></p><br/><p><span>\"It is an honor. Please do so.\"</span></p><br/><p><span>“Huhu. It is nothing.”</span></p><br/><p><span>Eileen bowed her head at Crockta’s reply.</span></p><br/><p><span>At that moment... The system message that he hadn’t seen for a while popped up.</span></p><br/><p><span>][You are doing very well!]</span></p><br/><p><span>[Love Mode is currently locked. Do you want to activate Love Mode?]</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: <strong>Next Patreon goal has been reached!! Thank you for the support. There will now be 14 chapters a week, meaning two chapters every day.</strong></p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}