{"title": "Chapter 78 - Orcheim (3)", "id": 78, "volume": 1, "url": "http://boxnovel.org/praise-the-orc-chapter-78-orcheim-3", "volume_title": "Volume 1", "body": "<h1>Chapter 78 - Orcheim (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 78 - Orcheim (3)</span></p><br/><p><span>\"I have traveled around the world. I wandered to the northernmost part of the continent and saw the most beautiful lands,” Caburak said.</span></p><br/><p><span> They walked from the hot spring towards the Holy Land of the orcs hidden deep in the forest. </span><span>The ecology of the forest gradually changed. There were strange plants that he saw for the first time. The green forest gradually became white, silver and a mixture of other colors. </span><span>Flowers and plants with a strange beauty that couldn’t be seen anywhere else stood in front of them.</span></p><br/><p><span>\"Wasn’t the land of the dark elves in the north?”</span></p><br/><p><span>\"At that time, such limits didn’t apply to me. Kyulkyulkyul.” </span><span>Caburak laughed.</span></p><br/><p><span> \"Did you change your appearance?” Crockta asked.</span></p><br/><p><span>\"Kyulkyul, something like that.”</span></p><br/><p><span>It was said that changing his appearance and deceiving others was very difficult magic. Crockta nodded. Caburak was certainly a mighty shaman.</span></p><br/><p><span>\"I found an ominous presence in that place.”</span></p><br/><p><span>Caburak recalled his memories. It was the presence of a demon. It had been sleeping a long time to regain its strength, and its power was so strong that the fallen beings of that land were raising themselves into undead.</span></p><br/><p><span>\"I asked for support from the dark elves but...they didn’t believe me.”</span></p><br/><p><span>\"Um...”</span></p><br/><p><span>\"The demon was soon about to wake up. I had no choice but to get rid of it alone.”</span></p><br/><p><span>He was a great demon who called himself the demon king. He still hadn’t recovered his strength but his undead army made him the worst to face alone. </span><span>If left alone, he would be resurrected and not just the dark elves, but the orcs and most of the north would be devastated.</span></p><br/><p><span>That’s why Caburak faced him alone. </span><span>He used the treasure of his family, the artifact called ‘Constellation Staff’, but it was destroyed during the battle.</span></p><br/><p><span>Caburak was determined to die to stop it. </span><span>He fought using everything he had. </span><span>Thus, after using all his powers, he succeeded in killing the demon.  </span><span>The price was his magic power, the Constellation Staff and...</span></p><br/><p><span>His life force.</span></p><br/><p><span>\"I won’t be able to live for a long time...kyulkyulkyul!”</span></p><br/><p><span>“......!”</span></p><br/><p><span>Caburak laughed like it didn’t mean anything. </span></p><br/><p><span>\"Since I lost my strength and couldn’t freely move around the north like before...I tried to return to Orcheim. I had just barely reached the territory of the orcs when I was captured by the Great Clan and sold as a slave. Then we met, Crockta!”</span></p><br/><p><span>His eyes were telling the truth. </span><span>Caburak omitted a lot of the story, but Crockta knew of his hard work. Caburak, the orc shaman who sacrificed his life to save the world. </span><span>But his story wouldn’t be remembered by anyone in history. His noble sacrifice wasn’t recorded anywhere.</span></p><br/><p><span>Now Caburak didn’t look like a normal orc to Crockta. </span><span>Crockta asked, \"How can you laugh?\"</span></p><br/><p><span>\"We're here.” Caburak</span><span> pointed to the front instead of answering. Crockta turned his head.</span></p><br/><p><span>There was a cave. </span><span>An unknown, refreshing feeling was felt from it. It was the opposite of the demonic energy of the Forest of Creatures.</span></p><br/><p><span>\"Something feels good </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>“Kyulkyulkyul, follow me.”</span></p><br/><p><span>Upon entering the cave, Crockta felt a sense of deja vu. </span><span>Yes, it looked similar. </span><span>It resembled the path that he walked towards the Hall of Fame in Orcrox. The cave was artificially cut, like someone had touched the wall.</span></p><br/><p><span>They walked through the darkness. Caburak created a light at his fingertips to light up the way. </span><span>They kept walking. </span><span>Finally, there was a large space at the end of the cave.</span></p><br/><p><span>A monument stood there.</span></p><br/><p><span>“This...”</span></p><br/><p><span>It was the same as the monument that had the warrior’s laws carved on it. There was writing in the ancient orc language that he couldn’t understand.</span></p><br/><p><span>\"It is a unique object from our god,” said Caburak. </span><span>\"We don't believe in the gods. The Goddess of Benevolence, God of Light, God of War, etc. They aren’t gods, they are just stronger than we are.”</span></p><br/><p><span>Tiyo nodded. Gnomes traditionally didn’t have a religion. They were usually atheists.</span></p><br/><p><span>Caburak laughed. The sound of his low laugh rang through the space. He raised the light to reveal the words written on the monument. </span><span>They were different from the warrior’s laws.</span></p><br/><p><span>“Crockta,” Caburak called out. </span>His eyes were clear. It was no longer Caburak’s voice.</p><br/><p><span>“The world is like dust that runs into the void.”</span></p><br/><p><span>Crockta’s eyes widened. </span><span>He heard a similar story somewhere before.</span></p><br/><p><span>\"If you look at the universe, the world is empty and all living things will eventually sink into the void.”</span></p><br/><p><span>“......”</span></p><br/><p><span>\"Some people believe in heaven after death, but it is inevitable that they will sink downwards.”</span></p><br/><p><span>It was the story told by the demon when Crockta obtained the Demon’s Belt. Crockta touched the belt. It didn’t respond. </span><span>Caburak was talking about the same nothingness, but his voice was somewhat gentler.</span></p><br/><p><span>\"In this tiny world, is your Bul’tar meaningful?”</span></p><br/><p><span>“......!”</span></p><br/><p><span>\"I killed the demon and saved the world. That was my honor. But Crockta, in a world that will sink anyway, is our clamoring meaningful? Don’t you think?”</span></p><br/><p><span>Caburak was still laughing.</span></p><br/><p><span>Crockta couldn’t answer. </span><span>If he hadn’t obtained the Despairing Demon’s Mouth, he might not have considered his answer. </span><span>But he had been infused with the idea of the voice by the Demon’s Mouth. </span><span>He witnessed it, making this question too difficult. </span><span>In the end, everything would die.</span></p><br/><p><span>Caburak kept laughing as he looked at Crockta. </span><span>\"What do you think, Crockta?”</span></p><br/><p><span>Crockta looked at Caburak. The face of this broken orc seemed to already have its own answer.</span></p><br/><p><span>Crockta replied, \"It doesn't really matter.\"</span></p><br/><p><span>“Hoh.”</span></p><br/><p><span>\"No matter what meaning it has, I will do what I believe. I’ll just do what I have to. Even if it doesn’t make sense, I will walk along my own path.”</span></p><br/><p><span>“Even if no one acknowledges you? What if no one understands, or if the world is against your beliefs?”</span></p><br/><p><span>\"It will be the same.\" </span><span>Crockta also laughed as he looked at Caburak. </span><span>\"If the road is solitary, I will be a little lonely. But that is it.”</span></p><br/><p><span>Caburak’s expression changed. </span><span>His eyes grew larger and he started to laugh out loud.</span></p><br/><p><span>\"Only loneliness...you really are an orc. Crockta.” </span><span>Then he pointed to the monument. </span><span>\"His voice came and he looked at us. He promised us only one thing.”</span></p><br/><p><span>Caburak cried out loudly, his voice echoing throughout the cave.</span></p><br/><p><span>\"We will look so that you aren’t lonely.”</span></p><br/><p><span>He also heard this somewhere before. </span><span>A familiar face popped into his head.</span></p><br/><p><span>Lenox.</span></p><br/><p><span>‘God, please acknowledge me. See that our honor won’t be lonely.’</span></p><br/><p><span>Lenox had said this before passing on the warrior’s laws.</span></p><br/><p><span>Caburak's voice continued, \"He who we don’t understand or can’t understand. He who builds the world and supports the world. And he who always watch us.”</span></p><br/><p><span>Crockta and Tiyo listened. Caburak’s voice sounded like a spell in their heads.</span></p><br/><p><span>\"He who blows the wind along our back when we walk the road alone.” </span><span>Caburak’s eyes turned towards the monument. </span><span>\"This is our god... no, our pathetic belief.”</span></p><br/><p><span>“......”</span></p><br/><p><span>“I sacrificed my life to save the world. But nobody knows. If this was meaningless, how lonely would I be?” </span><span>Caburak hit Crockta’s shoulders. </span><span>\"So I desperately hoped. Someone is watching. That is why we walk through life with a sense of honor.”</span></p><br/><p><span>\"That is the case.”</span></p><br/><p><span>\"We believe in the forgotten god of the orcs, the nameless god.”</span></p><br/><p><span>Silence filled the space.</span></p><br/><p><span>Tiyo spoke like he wanted to break the atmosphere.</span></p><br/><p><span>\"We are the same dot. We gnomes are atheists. One gnome said that if there is something they can’t understand, it isn’t worthy of their faith. If they couldn’t understand, there is no reason to believe in it. But we gnomes sometimes pray for salvation. Orcs are like gnomes.”</span></p><br/><p><span>\"Then Tiyo, you also believe in our nameless god. You can shout Bul’tar nicely.”</span></p><br/><p><span>“Bah, people who preach are disgusting dot!”</span></p><br/><p><span>\"Gnomes too. Kyulkyulkyul!”</span></p><br/><p><span>They left the Holy Land. </span><span>It was called a Holy Land, but it was just a cave and monument.</span></p><br/><p><span>He asked Caburak, \"Well, the reason why... it is the only relic left by our god, so we call it the Holy Land.”</span></p><br/><p><span>\"I see.”</span></p><br/><p><span>Crockta looked up at the sky. </span><span>There was no difference from the sky in reality. </span><span>If he kept on playing Elder Lord, he would forget that this is a game. Once he heard about the orc’s beliefs, he felt like this world was more realistic.</span></p><br/><p><span>Looking at the smiling Caburak and straight-backed Tiyo, he could hardly think of them as meaningless existences. </span><span>The nameless god.</span></p><br/><p><span>As Caburak said, he was watching over them. </span><span>Crockta was locked in his thoughts. </span><span>And at that moment, an arrow flew out from among the bushes.</span></p><br/><p><span>“Again?” </span><span>Tiyo rolled his body and cried out like he was tired. Caburak ran towards the place where the arrow had fallen, while Crockta lowered his position and grabbed his greatsword.</span></p><br/><p><span>“This isn’t an arrow from a dark elf.”</span></p><br/><p><span>\"Then who</span><i><span> dot</span></i><span>?” </span><span>Tiyo asked.</span></p><br/><p><span>\"It is from a gnome’s crossbow.”</span></p><br/><p><span>\"What?”</span></p><br/><p><span>Tiyo’s eyes widened. Arrows flew again. Crockta’s group flung themselves down. </span><span>Then a voice was heard, \"This is the Holy Land of the orcs.”</span></p><br/><p><span>An alluring female voice. </span><span>\"We can get rid of all of them. Kill them all.”</span></p><br/><p><span>Crockta looked for the source of the voice and saw a gap in the bushes. </span><span>A female gnome wearing armor was commanding the unit. She was small but she looked like a beautiful woman. </span><span>The gnomes followed her order and advanced quickly. They were all carrying crossbows.</span></p><br/><p><span>\"Gnomes...</span></p><br/><p><span>Tiyo’s expression changed. He immediately seized General on his back.</span></p><br/><p><span>“Tiyo?” </span><span>Crockta called out to him but Tiyo got up from the ground and fired General towards the front.</span></p><br/><p><span>\"The ones who have forgotten the honor of the gnomes, die</span><i><span> dot</span></i><span>!”</span></p><br/><p><span>Colorful flashes hit the gnomes. There was a rain of magic bullets and due to the small size of the species, the gnomes couldn’t endure the hit and collapsed. </span><span>Other gnomes tried to aim their crossbows but Tiyo moved quickly and disturbed them.</span></p><br/><p><span>Crockta plunged in with his greatsword whenever there was a gap.</span></p><br/><p><span>\"Be careful!”</span></p><br/><p><span>Crockta blocked the crossbow arrows with his greatsword. The gnomes shouted and tried to reload the arrows. However, giving such a moment to an orc warrior was a precursor to a slaughter. </span><span>A few gnomes held up shields and spears to stop Crockta. But it was clearly the difference between David and Goliath.</span></p><br/><p><span>\"There is a gnome with an artifact.”</span></p><br/><p><span>The gnome commander gritted her teeth. </span><span>She shouted in Tiyo’s direction, “You are a gnome! A gnome joining forces with those hostile to us, you should be ashamed!”</span></p><br/><p><span>“Stop talking nonsense </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>Tiyo jumped up. </span><span>Then Tiyo flinched and stopped as he was about to shout. He was at a loss after seeing the commander’s face.</span></p><br/><p><span>\"A tremendous beauty</span><i><span> dot</span></i><span>...”</span></p><br/><p><span>Tiyo muttered. The commander was embarrassed.</span></p><br/><p><span>“...S-Shut up.”</span></p><br/><p><span>Tiyo soon regained his spirit. </span><span>“I-In any case! Gnomes who are linked with trafficking slaves are shameful </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>\"Bah, how old-fashioned!”</span></p><br/><p><span>Their eyes flashed as they glared at each other. </span><span>At that moment. </span><span>The bush next to Tiyo started shaking. </span><span>It was the enemy. A gnome soldier jumped out and aimed a spear at Tiyo.</span></p><br/><p><span>“...Tiyo!” Crockta shouted.</span></p><br/><p><span>The spear was heading towards Tiyo’s chest. </span><span>It was only for a moment.</span></p><br/><p><span>“Stupid child.”</span></p><br/><p><span>Tiyo skillfully dodged the attack and placed his arm around the enemy gnome’s neck.</span></p><br/><p><span>“...K-Keok!”</span></p><br/><p><span>Tiyo seemed hesitant, but he soon put strength in his arms.</span></p><br/><p><i><span>Crunch.</span></i></p><br/><p><span>The gnome’s neck was broken and he fell down.</span></p><br/><p><span>“......!”</span></p><br/><p><span>An outstanding body! </span><span>Tiyo truly was like Bruce Lee.</span></p><br/><p><span>“Hoo.”</span></p><br/><p><span>Tiyo let go of the dead and stared up at the sky. </span><span>He never killed his own people. </span><span>He was a gnome of the Quantes garrison. He protected gnomes and never imagined that he would kill another gnome.</span></p><br/><p><span>But the time had come for him to do so. </span><span>He killed the gnome with his own hands.</span></p><br/><p><span>'We walk our lives with honor.’</span></p><br/><p><span>He remembered Caburak’s words. Then Tiyo nodded. </span><span>He would just believe as well. </span><span>His path was right.</span></p><br/><p><span>Tiyo turned his head. The gnomes flinched. In addition to the powerful artifact, they were afraid of his ability to kill a soldier in a flash.</span></p><br/><p><span>Tiyo met Crockta’s gaze. </span><span>Crockta nodded. They were eyes that seemed to understand everything. Tiyo smiled at him.</span></p><br/><p><span>He was a reliable colleague. </span><span>If so, there was nothing to hold him back.</span></p><br/><p><span>\"Let's go, Crockta!”</span></p><br/><p><span>“Yes!”</span></p><br/><p><span>Tiyo shouted as he rushed forward with General.</span></p><br/><p><span>“Bul’tarrrr!”</span></p><br/><p>I'm going New Zealand tomorrow for 5 days. I'll have time to post one more chapter tomorrow but then it will be no chapters. The chapters will be slowly released when I get back, including those from when I went to the hospital as well.</p><br/><p>Chapters owed: 13 PTO, 13 BEM.</p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: <strong>Next Patreon goal has been reached!! Thank you for the support. There will now be 14 chapters a week, meaning two chapters every day.</strong></p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}