{"title": "Chapter 76 - Orcheim (1)", "id": 76, "volume": 1, "url": "http://boxnovel.org/praise-the-orc-chapter-76-orcheim-1", "volume_title": "Volume 1", "body": "<h1>Chapter 76 - Orcheim (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 76 - Orcheim (1)</span></p><br/><p><span>\"Thank you,” Caburak said. </span><span>He was one of the slaves rescued by Crockta and Tiyo. His pronunciation was strange due to his broken teeth, but he laughed like he didn’t care. </span><span>\"I am alive thanks to people like you.”</span></p><br/><p><span>He was riding behind Tiyo on the caruk.  </span><span>Tiyo complained, \"Be careful, you spit every time you speak </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>Caburak laughed, “Sorry, kyulkyulkyul! </span><span>I heard that you are going North, but what is your specific destination?”</span></p><br/><p><span>\"We are heading for the Temple of the Fallen God.”</span></p><br/><p><span>“The Fallen God...?”</span></p><br/><p><span>\"Ask Crockta.”</span></p><br/><p><span>Tiyo gestured towards Crockta. Crockta looked at Caburak and nodded. </span><span>“Yes.”</span></p><br/><p><span>“What brings you there?”</span></p><br/><p><span>\"There is something I want to find out personally.”</span></p><br/><p><span>Crockta looked at the distant horizon. If they continued this way, they would arrive at a village of dark elves. Although they were hostile towards orcs, he needed to find a way to reach the Temple of the Fallen God.</span></p><br/><p><span>Caburak was heading North to his hometown, so they would travel together to the dark elf village before splitting up.</span></p><br/><p><span>“Hrmm... Fallen God...” Caburak muttered.</span></p><br/><p><span> Crockta laughed and asked, \"Do you know about the Temple of the Fallen God?’</span></p><br/><p><span>\"From what I know...hrmm...” </span><span>Caburak looked up at the sky in an exaggerated manner and touched his chin. </span><span>“If I were you...hrmm...”</span></p><br/><p><span>\"What is it?”</span></p><br/><p><span>\"Crockta... I want to ask you. Why did you save me?”</span></p><br/><p><span>\"Does there need to be a reason?”</span></p><br/><p><span>\"It is like... a personal belief? Or...”</span></p><br/><p><span>Crockta laughed and replied, \"I am a warrior.\"</span></p><br/><p><span>\"Right, a warrior. The ones who captured us were also warriors.”</span></p><br/><p><span>\"A real warrior.”</span></p><br/><p><span>“A real warrior?”</span></p><br/><p><span>\"On the southern continent, you can’t become a warrior just because you are strong. Fighters aren’t warriors.”</span></p><br/><p><span>Crockta pointed to his tattoos. He had received the Tattoos of Honor when he first became a warrior, and they were now upgraded to Tattoos of Honor and Fighting Spirit.</span></p><br/><p><span>These were granted by the shaman who controlled the warrior’s ritual, and evolved with the warrior’s actions and beliefs. Unlike Crockta, there were those who had Tattoos of Power or Tattoos of Revenge.</span></p><br/><p><span>Obviously, those who didn’t qualify as warriors couldn’t get the tattoos. No matter how much power the shaman put in, the tattoos wouldn’t appear. On the continent, any orcs with tattoos would be a warrior.</span></p><br/><p><span>Crockta continued, \"If I had to give you a reason, I would say one thing.”</span></p><br/><p><span>\"What is it?”</span></p><br/><p><span>“The warrior’s laws, the fifth one.”</span></p><br/><p><span>“Umm?”</span></p><br/><p><span>\"A warrior doesn’t shame the gods!” </span><span>Crockta grinned. </span><span>\"Turning others into slaves is a shameful thing.”</span></p><br/><p><span>Orcs rarely mentioned the gods. The first he heard of it was when Lenox taught him the warrior’s laws in the Hall of Fame. </span><span>Orcs didn’t have statues towards gods like the Goddess of Benevolence or God of Light like the other species. There were no temples, festivals or a religion that borrowed the divine power of the god.</span></p><br/><p><span>Nevertheless, the warrior’s laws were an oath to the gods. </span><span>So Crockta guessed that it was like a belief in his heart.</span></p><br/><p><span>“The gods!” </span><span>Caburak’s eyes widened. </span><span>“Gods!”</span></p><br/><p><span>As if he was listening to the echo, he repeated it once and closed his eyes. </span><span>Then he laughed loudly, “Kyulkyulkyulkyul! A warrior talking about the gods!”</span></p><br/><p><span>Caburak tapped on the shoulder of Tiyo who was steering the caruk.</span></p><br/><p><span>“Hey, Tiyo! The orcs in the south are like this! Kyulkyulkyul!”</span></p><br/><p><span>\"It hurts </span><i><span>dot</span></i><span>, hit me gently!”</span></p><br/><p><span>\"Sorry, kyulkyulkyulkyul!” </span><span>Caburak laughed as the caruk cried out. Caburak felt sorry towards the caruk and patted its ass. </span><span>\"You want to go to the Temple of the Fallen God?”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>\"If you aren’t in a hurry then you should follow me!”</span></p><br/><p><span>Caburak pointed to the mountain range that had started to appear on the Northeast horizon. </span><span>\"My beautiful home is located in the Luklan Mountains!”</span></p><br/><p><span>Tiyo’s eyes shone at the prospect of a new destination. Tiyo wanted to explore everywhere in the North. </span><span>\"Hoh, it sounds magical!”</span></p><br/><p><span>\"Kyulkyul, there are also gnomes living nearby.”</span></p><br/><p><span>\"Hoh, the Northern gnomes, it must be an impressive place!”</span></p><br/><p><span>Tiyo glanced at Crockta. His eyes expressed a desire to go there. Crockta shrugged.</span></p><br/><p><span>\"There is no reason not to. But why are you inviting us all of a sudden?”</span></p><br/><p><span>Caburak pointed to Crockta. </span><span>\"You mentioned the gods!”</span></p><br/><p><span>“Gods?”</span></p><br/><p><span>\"The Northern orcs that remember the gods have disappeared! Everybody has forgotten! Then you appeared and mentioned the gods, so I should invite you!” Caburak shouted with a shine in his eyes.</span></p><br/><p><span>\"To the Holy Land of the orcs, Orcheim!”</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>They started to climb the mountain. The caruks were able to climb the mountain due to their low center of gravity, but they were breathing hard after a short period of time. The group decided to take a break.</span></p><br/><p><span>Until recently, they had run through the wilderness and now they were climbing a mountain. The Northern terrain was really fickle.</span></p><br/><p><span>Crockta looked at Caburak.</span></p><br/><p><span>At first, he was an orc captured by the slave merchants. After seeing Crockta defeat Hammerchwi, the clan warriors, and the slave traders, Caburak asked if he could join them on their way. </span><span>Others were thankful to Crockta but they also felt fear. Caburak talked intimately with Crockta, the warrior who defeated the Great Clan warriors, without any fear.</span></p><br/><p><span>It wasn’t like Caburak had no idea what was going on. </span><span>Caburak just had a strange optimism that couldn’t be understood. </span><span>He wasn’t broken despite being a slave.</span></p><br/><p><span>\"I’m glad to be going back home!” </span><span>He smiled at Crockta.</span></p><br/><p><span>Tiyo asked from where he was lying on top of the caruk, “Hey! Caburak! Where are the gnomes </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>\"It is near Orcheim so you can stop by there, kyulkyul.”</span></p><br/><p><span>\"I wonder what the Northern gnomes will look like!” </span><span>Then Tiyo pointed to Crockta. </span><span>\"The Northern orcs are just strange Crockta! The gnomes will be different </span><i><span>dot</span></i><span>! Hahahahat!”</span></p><br/><p><span>“Kuoong.”</span></p><br/><p><span>\"Oh Caburak, I didn’t mean you </span><i><span>dot</span></i><span>! Kikik!”</span></p><br/><p><span>\"You’re not wrong. This gnome friend talks without any hesitation! Kyulkyulkyul!”</span></p><br/><p><span>Their laughs echoed on the mountain. </span><span>Then soon rose from their seat.</span></p><br/><p><span>\"If we go a little future then it will appear.”</span></p><br/><p><span>They dragged the caruks up the mountain. The mountain gradually became rougher. Caburak wasn’t in a good state so he kept stumbling or falling on the steep path. Crockta and Tiyo helped him.</span></p><br/><p><span>“Kyulkyulkyul! Thank you!”</span></p><br/><p><span>They climbed the mountain and reached a ridge.</span></p><br/><p><span>\"It is over there.” </span><span>Caburak pointed down the mountain.</span></p><br/><p><span>It was a wonderful scenery. </span><span>There were no other mountains in the vicinity and the horizon was clear. The Northern landscape was beautifully spread below them, from the wasteland where they walked to plains and forests.</span></p><br/><p><span>\"Beautiful,” admired Crockta.</span></p><br/><p><span>\"This is exciting, kyulkyulkyul!”</span></p><br/><p><span>The moment he burst out laughing. </span><span>An arrow flew past the face of the smiling Caburak.</span></p><br/><p><i><span>Susuk!</span></i></p><br/><p><span>“......!”</span></p><br/><p><span>His cheek was sliced and there was a thin line of blood.</span></p><br/><p><span>“Huh...?”</span></p><br/><p><span>Caburak frowned as he touched his wound. Crockta quickly grabbed his arm and pulled him down.</span></p><br/><p><span>“The enemy.”</span></p><br/><p><span>“Where </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>Tiyo immediately pointed General in the direction that the arrow came from. </span><span>It was from the ridge above them. Crockta stared at the other side. The bushes faintly shook. </span><span>An arrow flew once again.</span></p><br/><p><span>Crockta moved Ogre Slayer and blocked the arrow. The arrow fell to the ground after hitting the greatsword. The greatsword shook from the shock. </span><span>Caburak picked up the arrow from where he was lying down.</span></p><br/><p><span>\"Dark... dark elf arrows...”</span></p><br/><p><span>“Dark elves.”</span></p><br/><p><span>Crockta had seen some dark elves on the continent. Unlike elves, dark elves had dark hair and tanned skin. Their physical abilities were better than general elves. </span><span>Indeed, the arrows had power.</span></p><br/><p><span>“Where are they?”</span></p><br/><p><span>Tiyo shouted as he aimed General. </span><span>Colorful magic bullets shot into the forest. The bushes exploded from the energy released. </span><span>At that moment, there was a low scream. Tiyo shouted again.</span></p><br/><p><span>\"If you don’t want me to become even angrier, then reveal your identity at once!”</span></p><br/><p><span>The bushes shook and the voice of a dark elf was heard. It was the voice of a woman. </span><span>\"Are you the dogs of the Great Clan?”</span></p><br/><p><span>\"What are you saying </span><i><span>dot</span></i><span>! We have nothing to do with them!”</span></p><br/><p><span>The dark elf hiding in the bushes became silent before speaking again. </span><span>\"Then who are you?”</span></p><br/><p><span>\"Show yourself first!”</span></p><br/><p><span>“...I am Yanura, a ranger of Dejame.”</span></p><br/><p><span>She looked at Crockta, Tiyo and Caburak on the slopes. Caburak nodded. </span><span>He rose from his spot.</span></p><br/><p><span>\"I am Caburak and I’m returning to Orcheim!”</span></p><br/><p><span>“Orcheim?”</span></p><br/><p><span>Then a dark elf rose from the bushes. </span><span>With black hair and dark skin, she was a beautiful woman. She carried a heavy bow that looked much bigger than her body.</span></p><br/><p><span>“What is an orc from Orcheim doing here?”</span></p><br/><p><span>\"I am returning to Orcheim after a trip, but why is a dark elf of Dejame here?”</span></p><br/><p><span>\"A trip... that’s right. You probably don’t know yet.” </span><span>She nodded. </span><span>“Things have changed while you were away. Orcheim and Dejame are now allied together to guard this area.”</span></p><br/><p><span>\"From what?”</span></p><br/><p><span>She frowned as she looked at Tiyo. Then Tiyo stiffened at her next words.</span></p><br/><p><span>“It is due to the wicked gnomes.”</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>They headed to Orcheim with Yanura.</span></p><br/><p><span>During the trip, they could hear her explanation.</span></p><br/><p><span>There were orcs, dark elves and gnomes living in their respective areas in the Luklan Mountains. Unlike the orcs and dark elves who fought outside, they enjoyed a self-sufficient and peaceful life. </span><span>But the gnomes broke this balance.</span></p><br/><p><span>They betrayed both species and joined with the Great Clan.</span></p><br/><p><span>After the gnomes leaked the circumstances and security of this place, orcs from the Great Clan came to the Luklan Mountains and started to plunder and slaughter the people. The gnomes benefited from attacking the other species with the orcs.</span></p><br/><p><span>There was a secret contract, so the conditions for the gnome must involve the Luklan Mountains.</span></p><br/><p><span>Unlike the other species in the North, the gnomes had no independent armies. There were just small communities scattered around. So the gnomes of the Luklan Mountains were trying to build their own territory here.</span></p><br/><p><span>Tiyo was devastated by the words.</span></p><br/><p><span>\"T-The Northern gnomes...”</span></p><br/><p><span>\"Kulkul, the Northern gnomes are also strange.”</span></p><br/><p><span>Crockta teased him. Tiyo dropped his head with a grouchy expression. He was sorry.</span></p><br/><p><span>Yanura looked towards Crockta and said, \"I want to apologize for attacking you. I’ll escort you to Orcheim. That way, you won’t be misunderstood.”</span></p><br/><p><span>She was subtly looking Crockta up and down. An orc from the south. He felt different from the orcs here. His body was covered with tattoos and such a huge sword was rare. </span><span>She instinctively felt that Crockta was strong.</span></p><br/><p><span>It would be great if he helped out.</span></p><br/><p><span>\"Why are going to Orcheim?” asked Yanura.</span></p><br/><p><span> Crockta nodded towards Caburak and aswered, \"He said that Orcheim is the orc’s Holy Land. I was curious, so I decided to stop by.”</span></p><br/><p><span>“Holy Land?”</span></p><br/><p><span>She looked at him like she didn’t know it.</span></p><br/><p><span>As they continued walking, orcs started to be seen. Orcheim was located flat on the mountainside after crossing over the Luklan Mountains. </span><span>It wasn’t a developed place but it was a well-maintained village. Orcs were returning from their hunting while carrying a big wild boar. </span><span>The gazes of the orcs gathered as a group containing a dark elf, gnome and orcs appeared.</span></p><br/><p><span>Caburak took the lead. He made a regal gesture.</span></p><br/><p><span>“I’m back! Orcheim!” shouted the freed slave. </span><span>The orcs looked puzzled but they soon shouted his name.</span></p><br/><p><span>“Caburak!”</span></p><br/><p><span>“Caburak has returned!”</span></p><br/><p><span>\"Caburak?”</span></p><br/><p><span>Crockta and Tiyo exchanged glances.  </span><span>They thought he was a good and frivolous orc, but was he actually a great orc?</span></p><br/><p><span>“Wait a minute, Caburak?”</span></p><br/><p><span>Yanura looked like she was reminded of something. Then she spoke in a trembling voice. </span><span>\"The son of the Orcheim Chief who disappeared, the genius orc shaman Caburak?”</span></p><br/><p><span>Crockta and Tiyo’s eyes widened. They looked at Caburak. Caburak was spreading both arms wide open. His hands glowed white with his magic power. He was using an unknown magic.</span></p><br/><p><span>“I, Caburak have returned!”</span></p><br/><p><span>Pink petals started to appear in the arm in accordance with his strength. </span><span>The petals blew in the breeze as Caburak laughed heartily.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: <strong>Next Patreon goal has been reached!! Thank you for the support. There will now be 14 chapters a week, meaning two chapters every day.</strong></p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}