{"title": "Chapter 81 - Stranger (1)", "id": 81, "volume": 1, "url": "http://boxnovel.org/praise-the-orc-chapter-81-stranger-1", "volume_title": "Volume 1", "body": "<h1>Chapter 81 - Stranger (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 81 - Stranger (1)</span></p><br/><p><span>The orcs invading the Luklan Mountains retreated. Most of them died or returned with terrible injuries. </span><span>Crockta’s name was stamped into the northern orcs. </span><span>Now he was obviously an enemy of the Great Clan.</span></p><br/><p><span>\"Golito.”</span></p><br/><p><span>A gnome with a long beard stood in front of Gorit. </span><span>It was Golito, the leader of Altanas.</span></p><br/><p><span>Golit of Orcheim, Janaru the leader of Dejame, Crockta and Tiyo were gathered in Altanas. </span><span>The disarmed gnomes lowered their heads but Golito glared sharply at Gorit.</span></p><br/><p><span>“Gorit.” </span><span>Golito puffed up his chest. </span><span>\"There is nothing more to say. Dispose of me.”</span></p><br/><p><span>\"Are you sorry towards the many who have died because of your actions?”</span></p><br/><p><span>“That would be a lie. I don’t regret it.”</span></p><br/><p><span>The orcs and dark elves surrounding Golito cursed at him. Due to Golito’s decision, the Luklan Mountains had been covered with blood. </span><span>However, Golito still maintained his dignity.</span></p><br/><p><span>“Once the border opens, the gnomes will clearly be in a crisis. It is fate so I was just trying to do what I could for us gnomes.”</span></p><br/><p><span>“Due to your anxiety, the blood of numerous people were shed.”</span></p><br/><p><span>\"My anxiety? Can’t you see it? The destruction of our world in the war is right in front of us!”</span></p><br/><p><span>\"That is a leap!”</span></p><br/><p><span>“No! You underestimate the situation! No matter what the situation over the border is, the crazy chieftain has already decided on a war. Soon the dark elves and you orcs will fall into slavery. When the time comes, Orcheim can just be incorporated into the Great Clan. But us?”</span></p><br/><p><span>He looked at Janaru, the leader of the dark elves. </span><span>“It is the same for you too! You are just foolish elves!”</span></p><br/><p><span>\"Shut up.”</span></p><br/><p><span>\"Don't turn away from this. The world is already on the verge of war. Janaru, you should think about this if you really care about Dejame. Whether it is fighting against your fellow people or selling them to the great chieftain, you should plan your future! Why don’t you understand this?”</span></p><br/><p><span>Golito argued with wild eyes.</span></p><br/><p><span>\"As long as the Great Clan has decided on war, the gnomes will be destroyed! This world is about the survival of the fittest! All I did was try to live! I will never regret my decision! Who can blame me? Then blame me!”</span></p><br/><p><span>There was silence at Golito’s strong sincerity. </span><span>No one could blame him.</span></p><br/><p><span>At that moment. </span><span>Someone struck Golito.</span></p><br/><p><span>“Cough!”</span></p><br/><p><span>The person was Tiyo. </span><span>\"Stupid bastard!\"</span></p><br/><p><span>Golito touched his cheek where he was hit and raised his head. </span><span>The culprit was a gnome he hadn’t seen before.</span></p><br/><p><span>“Who are you?</span></p><br/><p><span>“My name is Tiyo! I am a rational gnome who was the captain of Quantes Gnomes Garrison and I can’t stand such stupid words </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>“Quantes?”</span></p><br/><p><span>“That’s right </span><i><span>dot</span></i><span>.” </span><span>Tiyo raised General to his shoulder and cried out. </span><span>\"I have come over the border from the continent with Crockta</span><i><span> dot!</span></i><span>”</span></p><br/><p><span>Golito’s eyes widened at the declaration. There was a commotion in the surroundings.</span></p><br/><p><span>\"But where I come from doesn’t matter </span><i><span>dot</span></i><span>. I just wanted to tell you that you are someone who has lost the cool judgement of a gnome. You are a stupid gnome </span><i><span>dot!</span></i><span>”</span></p><br/><p><span>\"What?\"</span></p><br/><p><span>\"Anxiety based on fear will just proliferate. That is why us gnomes always look objectively. But you are a stupid gnome who lost your composure due to fear! No, you are just a stupid person </span><i><span>dot!</span></i><span>” </span><span>Tiyo declared. He was more confident than he had ever been.</span></p><br/><p><span>\"B-Bullshit!”</span></p><br/><p><span>“Think about it! If, as you say, the great chieftain has turned to madness, do you think his peace with you will last forever?!”</span></p><br/><p><span>\"Surviving the catastrophe in front of us is more important than the distant future! Survival is a priority!”</span></p><br/><p><span>\"That is why you are stupid </span><i><span>dot</span></i><span>! Gnomes who only think about one thing is a gnome who has lost their reasoning to fear!” </span><span>Tiyo was speaking to the other gnomes as well as Golito. The gnomes avoided the intensity in his eyes. </span><span>\"Guys like you are under the illusion that you are doing something important! You become confident after feeling like you’ve made a big decision, but that is just a delusion </span><i><span>dot!</span></i><span> Poor man, you are really poor </span><i><span>dot!</span></i><span>”</span></p><br/><p><span>Golito’s eyes distorted at Tiyo’s words. </span><span>\"If so, what should I do? We gnomes...!”</span></p><br/><p><span>\"Your reasoning </span><i><span>dot!</span></i><span>” </span><span>Tiyo shouted. </span><span>\"Don't ask me, ask your sense of reason!”</span></p><br/><p><span>\"I am rational...!”</span></p><br/><p><span>\"You are asking the fear that is eroding your heart. Listen to the answer from your reasoning, not your fear </span><i><span>dot!</span></i><span>” </span></p><br/><p><span>Tiyo brought up the essence of magic engineering. </span><span>\"Then I’ll ask you again Golito! The answer! Is it selling your old friends, making other species into slaves and cowardly joining hands with the crazy orc who knows nothing but war?! And!”</span></p><br/><p><span>Tiyo shouted towards all the gnomes in Altanas. </span><span>\"Resisting evil deeds to the end, isn’t that the reason why we follow ‘ein guter Wille’?”</span></p><br/><p><span>“......!”</span></p><br/><p><span>Golito’s eyes widened. </span><span>This gnome, he was shouting in the ancient gnome language that was no longer remembered. </span><span>Everybody knew it but they ignored the old stories.</span></p><br/><p><span>\"How is it Golito? What do you grey brain cells say?”</span></p><br/><p><span>Golito couldn’t open his mouth. </span><span>He also knew it. </span><span>But he had been afraid of the destruction that would come, afraid of the death of his own people. He just wanted to stop the destruction of the gnomes living in Altanas.</span></p><br/><p><span>Golito dropped his head. </span><span>Then someone responded on behalf of Golito.</span></p><br/><p><span>\"You are an outsider so you can speak easily.” </span><span>Tiyo turned his head. It was Golito’s daughter, Yona.</span></p><br/><p><span>As Tiyo stared at her, Yona also faced him. </span><span>The gazes of the two met.</span></p><br/><p><span>Yona laughed. Tiyo looked embarrassed by her sudden laugh.</span></p><br/><p><span>\"And you can speak correctly because you are an outsider.”</span></p><br/><p><span>Golito looked at his daughter. </span><span>“Yona.”</span></p><br/><p><span>\"Father, I respect your will. You made the decision for our people. But the gnomes of Altanas and I aren’t so weak. We can fight.”</span></p><br/><p><span>“......”</span></p><br/><p><span>Yona looked back at the gathered gnomes. </span><span>\"If we bow down to the Great Clan, we will be the same as them. Father, you always told me. No, you said this to all gnomes, not just me.”</span></p><br/><p><span>“Yona...”</span></p><br/><p><span>\"Rather than being full pigs, let’s be hungry gnomes.”</span></p><br/><p><span>The gnomes of Altanas nodded. </span><span>It was an old saying passed down to the gnomes.</span></p><br/><p><span>Crockta made a strange expression as he watched the gnomes. </span><span>As he listened to the conversation between Tiyo and the gnomes, familiar words rang in his ears. </span><span>There were words and sentences that he read in philosophical books during his breaks in the army.</span></p><br/><p><span>Was this really a game that reflected the tastes of the makers, or was Elder Lord connected to a real world? </span><span>He didn’t know.</span></p><br/><p><span>As Crockta thought this, Golito was lamenting.</span></p><br/><p><span>\"I see...”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>\"Yona you, and everyone else’s will...”</span></p><br/><p><span>Golito looked around at the gnomes. They nodded. The gnomes respected Golito but they also questioned his decision.</span></p><br/><p><span>Golito sighed. </span><span>“I’ll acknowledge my misjudgement.”</span></p><br/><p><span>Gorit tied Golito up and spoke. </span><span>\"You are in custody. For the crime of betraying your neighbors in the Luklan Mountains...”</span></p><br/><p><span>The gnomes were nervous. </span><span>Gorit exchanged glances with the dark elf Janaru. </span><span>Gorit declared.</span></p><br/><p><span>\"There were be no hostile actions under the agreement that a new leader sits down with us and joins forces with Orcheim and Dejame to protect our home from the Great Clan.”</span></p><br/><p><span>“......!”</span></p><br/><p><span>The gnomes were shocked by the exceptional concession. The tied up Golito looked between Gorit and Janaru. </span><span>Gorit just laughed. </span><span>\"Don’t be too surprised. As our gnome friend from the continent said, I made the decision using my reasoning.”</span></p><br/><p><span>“...I see.”</span></p><br/><p><span>\"But there were many sacrifices. So you will need to apologize and prepare reparations for them, as well as make efforts to reclaim those sold as slaves.”</span></p><br/><p><span>“I accept.”</span></p><br/><p><span>It was an amicable ending. </span><span>As Crockta watched, he suddenly recalled a sentence from a philosopher. He was somehow captured by the idea of the great sight that would occur if he spoke those words now.</span></p><br/><p><span>‘I will. I won’t.’</span></p><br/><p><span>He hesitated over whether he should say it or not.</span></p><br/><p><span>\"As an outsider watching this, I suddenly had a thought.” </span><span>Crockta was filled with a burning desire and opened his mouth. </span><span>Everyone’s gazes focused on Crockta.</span></p><br/><p><span>\"As I think about it, there are two things that fill my heart with every increasing admiration and awe.</span></p><br/><p><span>“......?”</span></p><br/><p><span>\"One is the stars shining in the sky above me and the other... </span><span>Crockta paused and everyone focused on him. </span><span>\"It is the moral law within us that tells us the way to walk.” (TL: Paraphrased from philosopher Immanuel Kant, in </span><i><span>Critique of Practical Reason)</span></i></p><br/><p><span>An outright imitation! </span><span>Crockta opened his eyes and looked around.</span></p><br/><p><span>“......!”</span></p><br/><p><span>The people in the surroundings were looking at him with awe. Tiyo’s mouth fell open.</span></p><br/><p><span>\"I-I thought you were just an orc good at fighting but...”</span></p><br/><p><span>\"Such an intellectual sentence...”</span></p><br/><p><span>\"Unbelievable...coming from an orc...!”</span></p><br/><p><span>\"What a wonderful verse that contrasts nature with the human nature...!”</span></p><br/><p><span>Crockta closed his eyes. Then he smiled widely.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Crockta and Tiyo prepared to leave Orcheim.</span></p><br/><p><span>They had experienced the orc’s Holy Land and ended the dispute in the Luklan Mountains. Now it was time to leave. </span><span>Gorit, Caburak and many orcs saw them off.</span></p><br/><p><span>\"Crockta, thank you and sorry for giving you more baggage. Good luck.”</span></p><br/><p><span>Caburak said.</span></p><br/><p><span>Crockta was now heading towards the Temple of the Fallen God. However, it was in the territory of the dark elves.</span></p><br/><p><span>Crockta had made an enemy of the great chieftain. No matter how strong he was, he couldn’t deal with all of the Great Clan alone. So Crockta would head to the Temple of the Fallen Gods and also try to persuade the dark elves, one of the two peoples in the northeast to oppose the Great Clan.</span></p><br/><p><span>Gorit held Crockta’s shoulder and nodded.</span></p><br/><p><span>\"The dark elves aren’t easy because they are closed off. Our Luklan Alliance will keep sending messengers so you don’t have to bear all of the burden. Good luck.”</span></p><br/><p><span>Orcheim, Dejame, and Altanas had joined together in one alliance.</span></p><br/><p><span>Crockta nodded. The warriors of Orcheim who fought with Crockta wished him good luck and extended their fists. </span><span>Crockta bumped fists with numerous warriors.</span></p><br/><p><span>“I will surely return </span><i><span>dot.</span></i><span>” </span><span>Tiyo’s voice was heard. Crockta turned to see Tiyo talking to Yona.</span></p><br/><p><span>\"Bah. Whether you return or not...”</span></p><br/><p><span>\"If you don’t give a definitive answer then I will just return home. I am a straightforward man</span><i><span> dot. </span></i><span>If I am in your heart then tell me now.”</span></p><br/><p><span>Tiyo said without hesitation. </span><span>Crockta felt admiration towards him.</span></p><br/><p><span>Tiyo was a real man.</span></p><br/><p><span>At his mighty request, Yona avoided his gaze and replied in a small voice.</span></p><br/><p><span>“...Stop by when everything is finished.”</span></p><br/><p><span>Tiyo laughed. </span><span>\"I understand </span><i><span>dot.</span></i><span> Wait for me.”</span></p><br/><p><span>There was another piece of good news.</span></p><br/><p><span>Tiyo received a clue on his father’s whereabouts. Tiyo asked the gnomes of Altanas while giving his name and description. Yona and the other gnomes told him about his father. It was said that he carried mysterious goods and drifted around the north.</span></p><br/><p><span>The last time they saw him was a few years ago when he was heading towards the area of the dark elves to the north.</span></p><br/><p><span>Thus, Crockta and Tiyo left the Luklan Mountains.</span></p><br/><p><span>\"It feels like everything is in the north</span><i><span> dot.</span></i><span>”</span></p><br/><p><span>The Temple of the Fallen God.</span></p><br/><p><span>The Great Clan’s war.</span></p><br/><p><span>Tiyo’s father.</span></p><br/><p><span>All the answers were there.</span></p><br/><p><span>\"How about it Crockta? Are you confident about the future?”</span></p><br/><p><span>“Of course!”</span></p><br/><p><span>Crockta grinned.</span></p><br/><p><span>There were no users in the north. </span><span>However, this was the place where Crockta had felt the freest. Everything meshed together like cogwheels without any discomfort. Every single person that he met here was living their own lives.</span></p><br/><p><span>Crockta liked this world. </span><span>Maybe the users barging into Elder Lord had created debris.</span></p><br/><p><span>\"What is that animal </span><i><span>dot</span></i><span>?” Tiyo asked.</span></p><br/><p><span>Just before they completely left the Luklan Mountains, they saw the creature tanding in the middle of the forest. </span></p><br/><p><span>It looked like a lizard but it had wings. He thought it was a dragon but it didn’t have the majesty of one. However, the body was big and the eyes wild. Flames were emerging from between its snout.</span></p><br/><p><span>\"Isn’t that a drake?”</span></p><br/><p><span>“Drake!”</span></p><br/><p><span>It was a powerful flying monster inferior to a dragon, but much stronger than a wyvern. </span><span>The drake started to come towards them, emitting threatening flames.</span></p><br/><p><span>Crockta and Tiyo exchanged glances.</span></p><br/><p><span>\"Are you confident ,Tiyo?”</span></p><br/><p><span>“Of course </span><i><span>dot.</span></i><span>”</span></p><br/><p><span>They laughed, raising their weapons and rushing towards the drake. </span><span>It was a world where he didn’t know when something unexpected would happen! </span><span>Crockta felt a burning sensation in his chest as he jumped.</span></p><br/><p><span>\"Events without notice are welcome!”</span></p><br/><p><span>The drake shot its flames towards Crockta. However, his greatsword split the flames apart. The drake’s terrible face came closer. </span><span>As Ogre Slayer was descending towards the drake’s head,</span></p><br/><p><span>\"What are you doing to Third Dragonnnnn!” shouted someone from behind them. </span></p><br/><p><span>The moment that Crockta hesitated. The drake slammed its forehead into Crockta. Crockta flew through the air and landed on the ground. </span><span>His ribs were aching. He could taste blood in his mouth.</span></p><br/><p><span>\"Kuheok! A-Are you okay? Third Dragon! Why did you do that?”</span></p><br/><p><span>Crockta sat on the ground and laughed.</span></p><br/><p><span>Look, he really didn’t know when something would happen.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: <strong>Next Patreon goal has been reached!! Thank you for the support. There will now be 14 chapters a week, meaning two chapters every day.</strong></p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}