{"title": "Chapter 93 - Nameragon (2)", "id": 93, "volume": 1, "url": "http://boxnovel.org/praise-the-orc-chapter-93-nameragon-2", "volume_title": "Volume 1", "body": "<h1>Chapter 93 - Nameragon (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 93 - Nameragon (2)</span></p><br/><p><span>Crockta’s party set up camp near Nameragon.</span></p><br/><p><span>Tiyo was messing around with General and trying to imagine a new form for his weapon.</span></p><br/><p><span>Along with the Vulcan form that could fire many bullets at once, Tiyo wanted to develop the same destructive power as the cannon showed by Gushantimur. But it didn’t seem to be working out very well.</span></p><br/><p><span>Tiyo examined General and exclaimed, “It is hard </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>Then he looked at Anor who was playing with bones on the side. </span><span>Anor had received a few bones from the lich and was advised to diligently handle them in order to use the power of a necromancer in a more sophisticated manner.</span></p><br/><p><span>He didn’t know what animal bones they were, but they came alive once Anor injected his strength. </span><span>He wondered if they were dog bones as they ran around and rubbed themselves against Anor.</span></p><br/><p><span>\"Can we really go into Nameragon </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>According to Crockta, Nameragon would need them two days later. The exact meaning was unknown but Crockta didn’t explain, so they just waited silently.</span></p><br/><p><span>\"Where is Crockta <em>dot</em>?”</span></p><br/><p><span>\"He is going to look around.”</span></p><br/><p><span>Tiyo accidentally stepped on a bone.</span></p><br/><p><span>\"Ah, don’t step on my bones!”</span></p><br/><p><span>\"You dark elves are really stiff </span><i><span>dot</span></i><span>. I didn’t know Nameragon would react like this.”</span></p><br/><p><span>\"That's right. They are very bad guys, which is why I cut my ears off.\"</span></p><br/><p><span>“......”</span></p><br/><p><span>Anor’s ears were healed but traces of the forceful cutting remained. It wasn’t a nice sight to see. </span><span>He didn’t understand the impact it must’ve had on Anor.</span></p><br/><p><span>\"Which way did Crockta go </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>\"That way. Ah, totally cool. Did you change it again?”</span></p><br/><p><span>\"Huhuhu, this is the sniper edition. Sniper.”</span></p><br/><p><span>General had grown longer and Tiyo placed it on his shoulder. </span><span>They were currently on the plains and could see Nameragon. They had decided to stay under a large zelkova tree. </span><span>There was a forest growing around Nameragon. It was a forest leading from the mountain side where the Black Forest was, but there were no threats like creatures present. </span><span>Crockta was going to take a look at it.</span></p><br/><p><span>Tiyo looked for Crockta. </span><span>He felt Crockta’s presence not long after he entered the forest. The orc’s distinctive large body could easily be seen.</span></p><br/><p><span>“Crockta! What do you find </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>\"Tiyo.” </span><span>Crockta was standing in the middle of the forest and looking somewhere.</span></p><br/><p><span>“Did you find something </span><i><span>dot</span></i><span>?” </span><span>Tiyo stood next to Crockta and looked in the direction of his gaze.</span></p><br/><p><span>\"They’ll need us in two days so you must know something.”</span></p><br/><p><span>“Um...”</span></p><br/><p><span>Crockta frowned.</span></p><br/><p><span>He was able to identity the lifespan of the elves on the walls of Nameragon using the Gray God's Eyes. All of them had two days remaining. This meant that most of the dark elf soldiers would die in two days.</span></p><br/><p><span>The most likely thing was the orcs attacking, just like Nuridot. </span><span>A skill was used to secretly infiltrate Nuridot, so it was possible to use the same method to attack Nameragon.</span></p><br/><p><span>So he looked around to see if he could find enemy scouts near Nameragon. </span><span>The best place to hide around Nameragon was the forest. It looked like it was flowing down from the mountain. After leaving the forest, it would only be a short walk to Nameragon. </span><span>It was strange no matter how he thought about it.</span></p><br/><p><span>Crockta told Tiyo honestly.</span></p><br/><p><span>Tiyo touched his chin and fell into thought. </span><span>“Hrmm... The ability to see the remaining lifespan... and furthermore, two days </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>\"I was surprised as well.”</span></p><br/><p><span>“If we wait we’ll know.” </span><span>Tiyo nodded. </span><span>\"Can the lifespan change?”</span></p><br/><p><span>\"I don't know yet.\" </span><span>Crockta checked the description of the skill but it didn’t reveal anything else. </span><span>It wasn’t a common skill as it was outside the ratings. Maybe that was the only way to obtain the skill. </span><span>“We will find out in a few days.”</span></p><br/><p><span>Tiyo’s eyes looked through the scope of General in sniper form.</span></p><br/><p><span>\"But I don’t see anyone aiming for Nameragon...”</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Two days passed. </span><span>There weren’t any invaders like Crockta expected.</span></p><br/><p><span>Crockta, Tiyo, and Anor sat around a campfire and eat a light stew while looking at Nameragon.</span></p><br/><p><span>\"Crockta, the day has come</span><i><span> dot</span></i><span>. Are you certain?”</span></p><br/><p><span>“Um...”</span></p><br/><p><span>If the system’s description was true, it was definitely happening today. </span><span>At that moment,</span></p><br/><p><span>Anor cried out as he looked at Nameragon’s walls, “Ehhh...?”</span></p><br/><p><span>\"What is it </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>\"I feel something.\"</span></p><br/><p><span>\"What do you feel </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>Anor rose from his spot with a hard expression. </span><span>“Death.” </span><span>He was a necromancer who dealt with death. His senses had developed after training with the lich at Gushantimur’s lair. </span><span>“Something is happening within Nameragon.”</span></p><br/><p><span>Tiyo devoured his bowl of stew before rising. </span><span>His hands naturally grabbed General.</span></p><br/><p><span>“It is coming from inside.”</span></p><br/><p><span>Crockta also grabbed his greatsword.</span></p><br/><p><span>“There.”</span></p><br/><p><span>He saw smoke rising from Nameragon.</span></p><br/><p><span>\"Something seems to be happening.”</span></p><br/><p><span>Crockta and Tiyo stepped forward first. </span><span>They approached Nameragon’s gate but didn’t see the soldiers who greeted them before. It was the same when Crockta knocked on the gate. </span><span>What was happening?</span></p><br/><p><span>Crockta and Tiyo looked at each other.</span></p><br/><p><span>\"Enter.\"</span></p><br/><p><span>\"Good </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>Crockta pulled out his greatsword. </span><span>The gate was hastily repaired so it wasn’t as hard to destroy as before.</span></p><br/><p><span>Crockta felt a little guilty as he swung Ogre Slayer again. </span><span>His blade tapped the gate. </span><span>Then the inside of Nameragon was revealed.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Fires were occurring all over the place. Arrows were flying in the distance. </span><span>Crockta and Tiyo entered. They never imagined Nameragon looking so bleak. Battle noises were coming from everywhere.</span></p><br/><p><span>The subjects of the fighting were all dark elves. </span><span>The dark elves of Nameragon had split in two and were fighting each other.</span></p><br/><p><span>Crockta gulped at the sight.</span></p><br/><p><span>“An internal schism...”</span></p><br/><p><span>Then all his questions were answered. </span><span>Crockta’s party were well-known in the north. </span><span>They were good news for the dark elves who had to defend against the Great Clan’s attacks after Nuridot. </span><span>The Luklan Mountains and Nuridot would’ve sent messengers, but the reaction of the dark elves defending the walls was strangely hostile.</span></p><br/><p><span>There was something wrong.</span></p><br/><p><span>\"There, someone is collapsed </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>Crockta and Tiyo discovered a dark elf. He was collapsed on the ground and bleeding.</span></p><br/><p><span>\"Hey, are you okay</span><i><span> dot</span></i><span>?”</span></p><br/><p><span>“Uhh...” </span><span>He stared at Tiyo with blurry eyes. </span><span>\"Dwarf... it is futile...”</span></p><br/><p><span>\"It isn’t futile and I’m not a dwarf </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>Tiyo slapped his head.</span></p><br/><p><span>Then the dark elf’s face became more vivid as his spirit returned.</span></p><br/><p><span>\"You are...?\"</span></p><br/><p><span>\"I am Tiyo and this is Crockta. What is happening in Nameragon?” </span><span>Anor poured a potion on his wound. If the dark elf received treatment then he wouldn’t die.</span></p><br/><p><span>\"Travelers... right now, Nameragon is divided.”</span></p><br/><p><span>\"What are you talking about?</span></p><br/><p><span>\"Those who want to keep the dark elf’s legacy. And...” </span><span>The dark elf got up. </span><span>\"The reformists who joined hands with the Great Clan to move forward.”</span></p><br/><p><span>“What about you?”</span></p><br/><p><span>\"I can't trust the Great Clan. Holding hands with the crazy chieftain...”</span></p><br/><p><span>He coughed. Blood flowed out. Anor stabilized him.</span></p><br/><p><span>\"The dark elves who didn’t trust the Great Clan were predominant, but at some point, a person named Aden appeared and started to recruit people. Their numbers grew until this bloodshed began in Nameragon...’</span></p><br/><p><span>It was at that moment. </span><span>An arrow flew towards the dark elf.</span></p><br/><p><span>Crockta’s hand moved and caught it.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>The dark elf gulped as he belatedly noticed that the attack. </span><span>Crockta glanced in the direction of the attack. There was a group of dark elves holding arrows and knives.</span></p><br/><p><span>\"Who are you?\"</span></p><br/><p><span>Crockta got up. </span><span>The dark elves became nervous at the sight of the orc’s burly body. It was like a bunch of foxes greeting a tiger. </span><span>Crockta stepped forward while they retreated.</span></p><br/><p><span>“A-Are you from the Great Clan? Then we aren’t enemies.”</span></p><br/><p><span>A dark elf said. Crockta and Tiyo exchanged glances. </span><span>At that moment, the enemy was identified.</span></p><br/><p><span>\"Not the Great Clan, but those who came to hunt the Great Clan </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>Tiyo fired General. </span><span>The elves couldn’t respond to the sudden burst of continuous fire and fell down. Crockta ran and subdued them.</span></p><br/><p><span>\"Maybe we should meet the leader of Nameragon </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>Crockta agreed. </span><span>He didn’t know who he should wield his sword against.</span></p><br/><p><span>They brought the collapsed dark elf with them and walked through Nameragon. </span><span>Arrows were flying here and there. Dead bodies were scattered all over the place.</span></p><br/><p><span>“Where can I find the leader?”</span></p><br/><p><span>The dark elf helped by Anor answered Crockta’s question. </span><span>\"He will be building a line of defense at City Hall...”</span></p><br/><p><span>\"City Hall?”</span></p><br/><p><span>“If you go that way...”</span></p><br/><p><span>They turned the corner and saw a group of dark elves. </span><span>The dark elves discovered Crockta’s party and also raised their weapons.</span></p><br/><p><span>Crockta also raised his greatsword.</span></p><br/><p><span>\"We have come to help Nameragon. Which side are you on?”</span></p><br/><p><span>\"I came to help Nameragon.”</span></p><br/><p><span>A dark elf came forward. It was a dark elf with scars on his face. Everyone watched his movements like he was the leader.</span></p><br/><p><span>“An orc with a red headband and a greatsword, yes, you are clearly Crockta.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>He knew Crockta.</span></p><br/><p><span>\"And the dwarf who is Crockta’s...”</span></p><br/><p><span>“What </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>Tiyo raised General.</span></p><br/><p><span>The dark elf continued. </span><span>“Half breed trash with the ears cut off...”</span></p><br/><p><span>\"I wonder how your face will look once I smash it into the ground, you fucking bastard.</span></p><br/><p><span>Anor used his unique cursing defense mechanism before the words were over. </span><span>The dark elf looked stunned for a moment.</span></p><br/><p><span>\"Very vulgar...”</span></p><br/><p><span>Crockta stepped forward with his greatsword.</span></p><br/><p><span>\"It is bullshit, especially after seeing how relaxed you are. Whatever the case, reveal yourselves first.”</span></p><br/><p><span>\"Huhu, excess self-confidence is like poison.”</span></p><br/><p><span>He clapped his hands. </span><span>Then a dark elf walked forward. The dark elf was holding a sword in both hands. </span><span>His eyes stared blankly at Crockta. There were no emotions in them, like he was a doll.</span></p><br/><p><span>\"Kill the trash that disturbs the north.”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>The dark elf with the double swords came at them. </span><span>Crockta felt an unknown momentum from him. His movements were light. This guy wasn’t trash. </span><span>He glanced at Tiyo and Anor and already plotted a battle strategy with them.</span></p><br/><p><span>\"I’ll go first</span><i><span> dot</span></i><span>!”</span></p><br/><p><span>Tiyo fired General. </span><span>General’s colorful magic bullets flew towards him.</span></p><br/><p><span>At that moment, the dark elf with the double swords muttered.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>A magic circle floated in the air and absorbed all of Tiyo’s attacks. The magic circle shone as it received more energy and revolved around the dark elf. </span><span>His expression was still calm.</span></p><br/><p><span>“Magic swordsman?”</span></p><br/><p><span>A dark elf with long grey hair, wielding double swords and magic. </span><span>Crockta gulped. </span><span>This didn’t seem easy.</span></p><br/><p><span>Crockta blinked. </span><span>In the short moment that he closed his eyes and opened them again...</span></p><br/><p><span>The dark elf’s double swords were already before him.  </span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: <strong>Next Patreon goal has been reached!! Thank you for the support. There will now be 14 chapters a week, meaning two chapters every day.</strong></p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}