{"title": "Chapter 102 - How to Become a Magician (2)", "id": 102, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-102-how-to-become-a-magician-2", "volume_title": "Volume 2", "body": "<h1>Chapter 102 - How to Become a Magician (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 102 - How to Become a Magician (2)</span></p><br/><p><span>Jamero’s expression didn’t change as he nodded.</span></p><br/><p><span>\"You are Crockta. Hello.”</span></p><br/><p><span>“I am alive.” </span><span>Crockta gestured to an empty seat as he welcomed Jamero, \"Sit down.\"</span></p><br/><p><span>\"Thank you.\"</span></p><br/><p><span>He sent a glance to the two elves following him and they immediately unpacked, pulling food out of a large backpack. Tiyo’s eyes widened.</span></p><br/><p><span>\"Good prey. Welcome <em>dot</em>.”</span></p><br/><p><span>Tiyo and Anor rose and received the food they handed over. They immersed themselves in the cooking. </span><span>There was only the iron pot so they eventually decided to boil it all together. But Tiyo and Anor listened once the dark elves started talking.</span></p><br/><p><span>They were making stabbing motions with a twig. </span><span>Was it a skewer? Maybe something new might come out.</span></p><br/><p><span>He looked at them before turning back to Jamero. </span><span>“You came from Spinoa.”</span></p><br/><p><span>\"Yes.\" </span><span>He looked at Crockta and asked, \"What do you see?”</span></p><br/><p><span>\"You are strange.”</span></p><br/><p><span>He raised his hand, causing a faint ember to float out from the fire. It looked like a mini firecracker. </span><span>The mysterious appearance caught Crockta’s eyes. </span><span>The small ember turned blue.</span></p><br/><p><span>\"What do you feel when you see this?”</span></p><br/><p><span>It was like the color of a kitchen gas fire. </span><span>Crockta unconsciously muttered, \"Complete combustion...”</span></p><br/><p><span>Oxygen and heat were supplied in a sufficient amount to burn without leaving any byproducts. It was complete combustion. </span><span>If this wasn’t satisfied and the combustion was incomplete, a red flame would burn.</span></p><br/><p><span>Jamero looked at Crockta’s face with a curious expression. </span><span>Ah, Crockta regretted what he just said. He was using words from Earth. It might be hard for Jamero to understand. </span><span>But Jamero showed an unexpected reaction.</span></p><br/><p><span>“You, won’t you become a magician?”</span></p><br/><p><span>He put out the ember and leaned towards Crockta. </span><span>Crockta quickly withdrew and said, “What are you saying? I am a warrior.\"</span></p><br/><p><span>\"What do you think magic is?”</span></p><br/><p><span>Crockta couldn’t answer. </span><span>He had devoted himself to becoming a warrior. He didn’t touch the skills or abilities of any other class. </span><span>Just like a mother buying clothes, he learned only the skills he needed to move through the rough world of Elder Lord.</span></p><br/><p><span>Then he received this question. </span><span>What was magic? </span><span>If Elder Lord was another dimension, where did the strange ability that was impossible in his world come from? </span><span>Users could acquire magic through the system, but how did the residents of this place create such a miracle?</span></p><br/><p><span>Crockta stared at Jamero. </span><span>He smiled and said, \"You don’t need to think so hard. It is an easy answer. A question with no answer.”</span></p><br/><p><span>Crockta was troubled. </span><span>He was just Crockta the orc warrior. Furthermore, the words ‘complete combustion’ had already attracted Jamero’s interest. That’s why he received an offer to become a magician.</span></p><br/><p><span>Crockta didn’t want to give a disappointing answer. </span><span>Crockta’s head became tense. However, he pasted a casual expression on his face.</span></p><br/><p><span>Crockta started to speak, \"The world is made up of earth, fire, wind, and water.”</span></p><br/><p><span>\"Hoh...the elements...”</span></p><br/><p><span>“But...”</span></p><br/><p><span>Crockta recalled the heart of his child self. </span><span>That mindset spoke through Crockta towards a magician in Elder Lord.</span></p><br/><p><span>“There is one more thing.”</span></p><br/><p><span>\"A fifth element. What is it?”</span></p><br/><p><span>“That...”</span></p><br/><p><span>Crockta pointed to Jamero’s chest instead of answering. </span><span>He followed Crockta’s fingertips and his eyes shone as Jamero realized that Crockta was pointing at his heart.</span></p><br/><p><span>“Heart.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>\"Earth, fire, wind, water, and the heart, if those five powers are gathered...”</span></p><br/><p><span>Jamero’s eyes increasingly grew larger at Crockta’s answer. </span><span>Crockta seemed to hum his reply.</span></p><br/><p><span>“This is a beautiful world, a beautiful world...”</span></p><br/><p><span>Crockta’s fingertips now turned towards the sky. </span><span>The sky in the north. </span><span>As the seasons passed, the constellations looked different but they always touched the hearts of the people. </span><span>The universe. </span><span>The sight was imprinted on Jamero. A sea of stars seemed to be falling down towards him.</span></p><br/><p><span>\"We use our hearts to move the four elements that make up the world.”</span></p><br/><p><span>He added the word ‘heart’ thanks to the glimpse he saw of the Hero rank. </span><span>Crockta proclaimed towards Jamero who was still staring up at the sky.</span></p><br/><p><span>\"I think that change is magic.”</span></p><br/><p><span>Applause was heard from behind Crockta. </span><span>The two dark elves who followed Jamero were clapping. </span><span>Anor and Tiyo were piercing meat with sticks beside them.</span></p><br/><p><span>\"You are really amazing.\" </span><span>Jamero nodded. </span><span>\"The fact that you instinctively realized this despite your young age and the fact that you are a warrior...”</span></p><br/><p><span>\"Ten Thousand Flow Gathering School!”</span></p><br/><p><span>\"Hah...!”</span></p><br/><p><span>Jamero nodded. The other dark elves looked even more impressed. </span><span>Tiyo and Anor were ignoring the nonsense and placing the skewered meat in the campfire. The stew that they have been making was enriched with more ingredients and smelled delicious.</span></p><br/><p><span>Now everyone sat around the campfire. Jamero spoke to Crockta again. </span><span>\"I was a born magician. So I always worried. It the power transmitted through blood was the only case of the mysterious phenomenon of magic.”</span></p><br/><p><span>Anor nodded. He also became a necromancer due to his mother’s lineage.</span></p><br/><p><span>\"But there was a gradual understanding as I kept training. Magic is the power of the heart reacting to the world and creating change. I was born with a talent that allowed my heart to reach the world through magic...”</span></p><br/><p><span>He looked proud. </span><span>\"Crockta. You will also learn magic.”</span></p><br/><p><span>\"It isn’t necessary for a warrior.”</span></p><br/><p><span>\"It is obvious that you already feel magic. Such instinctive senses is an essential quality for a magician.”</span></p><br/><p><span>Tiyo and Anor were turning the skewers.</span></p><br/><p><span>“Please take this.”</span></p><br/><p><span>Jamero handed him something. </span><span>It was a book.</span></p><br/><p><span>\"The youngest son of the...?”</span></p><br/><p><span>Jamero nodded.</span></p><br/><p><span>“The author was born the youngest son of a magic family and persecuted, but eventually wrote this masterpiece thanks to intense research and effort. It is a new type of education that uses the style of autobiographical storytelling and effective training to make the reader unable to put it down. It is the most recommended magic tutorial. Take it.”</span></p><br/><p><span>Crockta accepted it.</span></p><br/><p><span>[Magic Tutorial has been acquired.]</span></p><br/><p><span>[The conflict between the warrior class and magician class will slow down the acquisition of magic skills.]</span></p><br/><p><span>[Are you sure you want to learn magic?]</span></p><br/><p><span>System messages appeared. </span><span>The system messages hadn’t been seen for a while.</span></p><br/><p><span>Crockta frowned. It was apparently the gray woman. The fact that she was watching made Crockta feel bad.</span></p><br/><p><span>Jamero seemed to misunderstand his expression. </span><span>\"Don’t worry too much. As a favor to me, just take a look.”</span></p><br/><p><span>\"Thank you.\"</span></p><br/><p><span>Jamero didn’t want to place any more burden on him so he didn’t say anything else about magic. Instead, he praised Tiyo’s cooking skill. </span><span>“The skill of your gnome friend is excellent.”</span></p><br/><p><span>\"Huhu, real men should know how to cook <em>dot</em>.”</span></p><br/><p><span>He just skewered the meat and placed the remaining meat in the pot, but Tiyo shrugged.</span></p><br/><p><span>\"What is Spinoa like? Is the world tree really big?”</span></p><br/><p><span>\"It is really big. A beautiful place. You will be surprised as well.”</span></p><br/><p><span>Anor was filled with expectations. He was a dark elf but he had never been outside Nuridot. To see the world tree in Spinoa was the dream of all the dark elves in the north.</span></p><br/><p><span>\"You should take a close look. It is a place we have to protect.” </span><span>Jamero declared.</span></p><br/><p><span>The atmosphere became tense.</span></p><br/><p><span>“The orc chieftain is currently crazy. He probably... it is clear that he is bewitched.”</span></p><br/><p><span>\"What do you mean?”</span></p><br/><p><span>\"Now isn’t the time. You will know once you go to Spinoa. Anyway, he seems unable to make rational judgments. He only wants war and destruction. If he takes the north and then the rest of the continent, what will remain after that?”</span></p><br/><p><span>“......”</span></p><br/><p><span>\"A series of infinite tribulations. Disputes and slaughter will repeat throughout the world. That is what he wants, and it is our worst future.”</span></p><br/><p><span>Jamero looked at them. </span><span>\"Meet Zelkian in Spinoa.”</span></p><br/><p><span>Zelkian was the name of the leader of the dark elves. </span><span>All dark elf villages and cities in the north were loosely under his control. It was known that he communicated with the world tree to make the right decisions for the dark elves.</span></p><br/><p><span>Crockta nodded. </span><span>There was probably an important reason to call them to Spinoa.</span></p><br/><p><span>\"Zelkian is expecting you. Hahaha. Zelkian waiting for an orc, I never imagined it.” </span><span>He laughed.</span></p><br/><p><span>All the food was finally cooked.</span></p><br/><p><span>Each person placed a skewer in their mouths. Unlike the stereotype of elves being vegetarian, they knew how to eat meat properly. In particular, Jamero ordered the dark elves to bring out more meat.</span></p><br/><p><span>New meat was placed on the fire.</span></p><br/><p><span>\"Good.”</span></p><br/><p><span>Anor laughed, “It would be nice if this trip could continue.”</span></p><br/><p><span>Anor was enjoying himself after leaving Nuridot. </span><span>Their stay at Gushantimur’s lair, Nameragon and this campsite, Anor wanted this time to continue. It was a bright expression that couldn’t be seen in Nuridot.</span></p><br/><p><span>\"It will continue.” </span><span>Crockta smiled and replied, \"After catching the great chieftain.”</span></p><br/><p><span>Anor’s eyes widened. </span><span>\"It will continue even after that?”</span></p><br/><p><span>\"This brat, what is with those eyes? Why do you even need to ask <em>dot</em>?”</span></p><br/><p><span>Tiyo placed Anor in a headlock. Anor struggled.</span></p><br/><p><span>\"I-It hurts. Hurts...fuc...!\"</span></p><br/><p><span>Tiyo blocked his mouth before Anor could curse and released him. Anor scratched his head.</span></p><br/><p><span>\"Since you only lived in Nuridot, you should see the continent beyond the north <em>dot</em>. This Tiyo will show you the continent.\"</span></p><br/><p><span>\"You haven’t even been outside Quantes.”</span></p><br/><p><span>“...Shut up <em>dot</em>.” </span><span>Tiyo said energetically. </span><span>\"Good <em>dot</em>, after killing the great chieftain, we will commemorate the peace with a parade around the continent. A pilgrimage around the continent!”</span></p><br/><p><span>Anor’s eyes shone. </span><span>Then Jamero chimed in, “It is good to be young.”</span></p><br/><p><span>\"Jamero, how old are you that you are pretending to be an old man <em>dot</em>?”</span></p><br/><p><span>\"Let's see...I haven’t counted after I turned 350.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>He was an aging dark elf, despite his young appearance. </span><span>The elves had twice the lifespan of humans. For human, 70 was already an old man.</span></p><br/><p><span>\"O-Old...!”</span></p><br/><p><span>\"Uhuh!”</span></p><br/><p><span>Jamero waved his hand and an unknown force grabbed Tiyo’s collar. </span><span>Tiyo floating in the air. As his footing disappeared, he started struggling.</span></p><br/><p><span>“W-What did you do? What is this <em>dot</em>?”</span></p><br/><p><span>\"For a gnome who can’t honor an adult, I shouldn’t let his feet touch the ground.”</span></p><br/><p><span>Tiyo floated up to Crockta’s height and frantically struggled. </span><span>“S-Stop <em>dot</em>!\"</span></p><br/><p><span>Crockta and Anor burst out laughing. </span></p><br/><p><span>Magic was a mysterious force. The energies around Tiyo were picking him up according to Jamero’s will. The flow through Crockta’s sixth sense was beautiful. </span><span>It wasn’t bad to learn it once.</span></p><br/><p><span>Crockta nodded. The system message that he had turned off popped up again. </span><span>There was an oddly pleased tone.</span></p><br/><p><span>[The just warrior Crockta has learned magic. How far will he go? Introduction to Magic (Common) has been learned. Congratulations!]</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: <strong>Next Patreon goal has been reached!! Thank you for the support. There will now be 14 chapters a week, meaning two chapters every day.</strong></p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}