{"title": "Chapter 120 - Before the Storm", "id": 120, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-120-before-the-storm", "volume_title": "Volume 2", "body": "<h1>Chapter 120 - Before the Storm</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 120 - Before the Storm  </span></p><br/><p><span>Crockta’s injuries weren’t recovered yet so the troops of the Luklan Mountains set off first. Crockta’s group was able to catch up quickly on the undead wyvern so they decided to delay their departure.</span></p><br/><p><span>Crockta had a monster-like resilience. Wounds that would take others a long time to heal were recovered in seconds. Indeed, Crockta was an amazing warrior.</span></p><br/><p><span>“Crockta is a very important figure,” said Gorit, Caburak’s father.</span></p><br/><p><span>He was in change of the Luklan Mountains Alliance.</span></p><br/><p><span>\"He is one of the keys in this war. Kyulkyul!”</span></p><br/><p><span>\"What would the north be like if it weren’t for him?”</span></p><br/><p><span>Crockta hadn’t ruined  Calmahart’s plans just one or two times. </span><span>Even the fate of the Luklan Mountains wouldn’t have been assured without Crockta. They might’ve become slaves working for the Great Clan.</span></p><br/><p><span>“Father.”</span></p><br/><p><span>\"What is it?”</span></p><br/><p><span>\"Calmahart wasn’t always mad. How long has it been since he got this madness?”</span></p><br/><p><span>Calmahart was originally rough, but he wasn’t crazy enough to slaughter the other species in order to unify the north and invade the continent. </span><span>He followed the logic of power and respected the strongest of the warriors: those who had inherited the position of great chieftain by defeating the previous one.</span></p><br/><p><span>He was cruel but also able to restrain himself. </span><span>However, he became a maniac at some point and everything changed. </span><span>Everything in the Great Clan was determined by the chieftain; therefore, the moment the chieftain changed, the Great Clan did as well.</span></p><br/><p><span>\"I don't know very well, but I do remember the first time I felt like something was wrong. It was when he sent a messenger to join him.”</span></p><br/><p><span>\"When was that?”</span></p><br/><p><span>“I guess it was around two years ago.”</span></p><br/><p><span>“Umm...”</span></p><br/><p><span>\"The conditions were filled with nonsense so I couldn’t accept. At that time, I felt like he wasn’t normal. He seemed to be treating us as slaves.”</span></p><br/><p><span>Caburak nodded as his eyes deepened in understanding.  </span><span>\"I understand.”</span></p><br/><p><span>\"Why?”</span></p><br/><p><span>\"Just curious. Kyulkyul!”</span></p><br/><p><span>\"This brat, right now you’re someone who can’t help much. Once the fight begins, be careful not to get involved too much.”</span></p><br/><p><span>\"Kyulkyul, don’t make a fuss, Father. I specialize in running away.”</span></p><br/><p><span>Gorit couldn’t get rid of his concerned expression. </span><span>Caburak touched his father’s back as if he wasn’t worried.</span></p><br/><p><span>He looked around at the Luklan allied forces. </span><span>The orc warriors were leading the charge while the dark elves and gnomes were mixing arrows, crossbows, and all sorts of tools. </span><span>This was a benefit created by mixing the abilities of all three species. It was more advanced than a unit made up of orcs rushing with axes or of dark elves launching volleys of arrows.</span></p><br/><p><span>However, he had an ominous feeling. </span><span>If it was as he thought, these soldiers or crude weapons might not be necessary in the first place.</span></p><br/><p><span>“No...”</span></p><br/><p><span>He shook his head. </span><span>The following battle would decide the future. </span><span>Nameragon and Spinoa were both important cities that couldn’t be left for the dark elves. It wouldn’t be an exaggeration to say that all other cities could collapse as long as these two remained.</span></p><br/><p><span>In addition, Spinoa had the world tree. </span><span>Occupying Spinoa would never be easy as long as the world tree was present.</span></p><br/><p><span>So Caburak wondered about the Great Clan’s next move.</span></p><br/><p><span>Head to Nameragon or Spinoa? </span><span>If they headed to Nameragon, it would probably fall. Even if Spinoa’s personnel went out to support them, they wouldn’t be able to stop the madness of the great chieftain and the Great Clan. It would be difficult unless they moved the world tree.</span></p><br/><p><span>However, the dark elves couldn’t give up Nameragon, so the siege would be fierce. </span><span>After breaking down Nameragon, their forces might be too weakened to take Spinoa.</span></p><br/><p><span>Caburak thought that would be the best way. </span><span>But...</span></p><br/><p><span>\"Where is the Great Clan heading? Is it still the same direction?\"</span></p><br/><p><span>\"According to the most recent news...” </span><span>Gorit scratched his head. </span><span>“They seem to be heading to Spinoa, but it still isn’t certain.”</span></p><br/><p><span>\"......!\" </span><span>Caburak stopped. </span><span>\"Why?”</span></p><br/><p><span>The Great Clan was leaving Nameragon alone and heading to Spinoa, which meant that their goal was the world tree. </span><span>Their goal was neither the territory of the dark elves nor their submission, but the acquisition of the world tree.</span></p><br/><p><span>\"...No.” </span></p><br/><p><span>Caburak closed his eyes. </span><span>He prayed to the nameless god that his imagination was wrong.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>\"Those guys have turned to this place.”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>“Understood.”</span></p><br/><p><span>Zelkian nodded.</span></p><br/><p><span> Jenado, an apostle of the world tree like Zelkian, bowed and withdrew.</span></p><br/><p><span>Zelkian stood on top of the world tree. </span><span>From the summit of the world tree, he could see the distant scenery. It was a beautiful scenery allowed only to apostles.</span></p><br/><p><span>But the landscape no longer looked beautiful to Zelkian. </span><span>The cities of dark elves, as well as his children, had all been devastated. There seemed to be no life in the distant cities. Nurido, Emeranian, and Yekator, places he occasionally visited, were now  reduced to rubble and piles of dead bodies.</span></p><br/><p><span>Everyone had died and perished.</span></p><br/><p><span>Zelkian felt a burning pain in his chest.</span></p><br/><p><span>“Kuock...”</span></p><br/><p><span>There was a deep pain. </span><span>The world tree was mourning. Its painful emotions were transferred to its apostle, causing Zelkian to suffer. </span><span>He knelt on one knee and waited for the world tree to calm down. </span><span>The joys and sorrows of a great being like the world tree would make mortals suffer just by sharing that pleasure.</span></p><br/><p><span>Zelkian, who groaned in pain for a while, finally caught his breath. The world tree became calm. </span><span>Zelkian kicked the huge branch that he was standing on.</span></p><br/><p><span>\"Hey, relax. I am also in pain.”</span></p><br/><p><span>A branch of the world tree rose and hit Zelkian’s legs. The two fought for a while.</span></p><br/><p><span>\"Anyway, I’m not joking.”</span></p><br/><p><span>Zelkian’s gaze moved. </span></p><br/><p><span>There were things filling up the plain near Spinoa.</span></p><br/><p><span>Orcs. </span><span>It was a really large army. Even if he joined the forces of Spinoa and Nameragon, it seemed to be several times their number.</span></p><br/><p><span>Furthermore, the orcs were familiar with fighting. While the dark elves locked their gates and enjoyed their own peace, the great chieftain continued fighting and subduing orcs. Fighting was part of their species’ culture. It was different from the dark elves’ experience with war.</span></p><br/><p><span>And the great chieftain.</span></p><br/><p><span>Zelkian borrowed the power of the world tree to capture his appearance. </span><span>He was much larger than the other orcs, an oppressive appearance. A menacing presence.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>His chest burned again. Zelkian closed his eyes and took deep breaths. The world tree shook. </span><span>Calmahart’s sedan was being supported by only dark elves. </span><span>Although there were many slaves, he made only a small number carry his sedan. It was a scene where he was enjoying his power. </span><span>The orc soldiers following Calmahart periodically wielded the whip and urged the dark elves on.</span></p><br/><p><span>The world tree was furious. </span><span>It also became Zelkian’s anger. </span><span>He opened his eyes in order to carve the appearance of Calmahart inside him. The world tree could never forgive him. Zelkian confirmed his face.</span></p><br/><p><span>And...</span></p><br/><p><span>Their eyes met.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>He was aware of Zelkian. He gazed at Zelkian and smiled, his eyes a clear blood color.</span></p><br/><p><span>A mark appeared on the great chieftain’s forehead—a red, bizarrely twisted cross.At that moment, the world tree recognized it and flinched. The world tree shook for a short time. The dark elves inside the world tree screamed at the abrupt shaking.</span></p><br/><p><span>Zelkian asked the world tree, “Just what is that?”</span></p><br/><p><span>But the world tree didn’t answer.</span></p><br/><p><span>“He looks like an apostle. Who is he the apostle of?”</span></p><br/><p><span>The world tree was silent. The answer that came from it was difficult to understand.</span></p><br/><p><span>Zelkian shrugged. </span><span>\"Well, we will be fighting soon. Are you scared?”</span></p><br/><p><span>The world tree slapped his head. </span></p><br/><p><span>Zelkian grumbled, “You are very violent. Tree brat. Ah, stop!”</span></p><br/><p><span>He tried to find the great chieftain again, but Calmahart was no longer visible. Where was that giant mass of muscle hiding? Zelkian touched his chin. </span><span>The great chieftain was probably an apostle like him.</span></p><br/><p><span>Who was the existence behind the great chieftain? </span><span>As a result of the great chieftain’s appearance, there was a high probability of fighting over the world tree. It wouldn’t be easy to borrow the power of the world tree. The world tree had a dirty nature, but it wasn’t a good fighter.</span></p><br/><p><span>As he worried about the future battle, the world tree tapped his shoulder.</span></p><br/><p><span>“What?”</span></p><br/><p><span>The world tree pointed to the sky. Zelkian’s gaze followed the direction that it was pointing. </span><span>Something was coming. </span><span>Zelkian laughed as he saw it.</span></p><br/><p><span>\"What the, those people? What are they riding?”</span></p><br/><p><span>Crockta, Tiyo, and Anor were rushing through the sky and heading towards Spinoa on the undead wyvern, Boro. </span><span>Crockta had bandages on his body but he seemed fine. Zelkian had been worried after his battle with Calmahart, but Crockta still seemed capable of fighting.</span></p><br/><p><span>His mind felt reassured at the sight of them approaching. </span><span>Crockta was a warrior who had already shaken the north several times. He had rescued several cities from the Great Clan. </span><span>Now that the final battle was approaching, they couldn’t be left out. Zelkian laughed.</span></p><br/><p><span>Dark elves had gathered from all over and reinforcements came from the Luklan Mountains. As long as the world tree existed, the dark elves were one. </span><span>The Great Clan or the great chieftain didn’t matter.</span></p><br/><p><span>Zelkian opened his arms. He appeared to be embracing the landscape of Spinoa. Beyond it was the Great Clan.</span></p><br/><p><span>\"Yes, let's end the great chieftain.”</span></p><br/><p><span>The world tree trembled in response.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>The orcs gathered in front of Spinoa. It seemed like the Great Clan decided that the decisive battle would be at Spinoa instead of Nameragon.</span></p><br/><p><span>As a result, the dark elves guarding Nameragon joined Spinoa. </span><span>Spinoa prepared all of its strength. The walls were reinforced to become much higher and tens of thousands of arrows were prepared. Jamero’s magic strengthened the defenses around Spinoa.</span></p><br/><p><span>\"Amazing.\"</span></p><br/><p><span>Crockta watched the scene from the walls. </span><span>It was the largest battle he ever experienced in Elder Lord.</span></p><br/><p><span>“The number of orcs is terrible </span><i><span>dot</span></i><span>...”</span></p><br/><p><span>Tiyo watched from beside him on the wall and muttered in a stricken voice.</span></p><br/><p><span>\"Too bad </span><i><span>dot</span></i><span>. If this were Quantes, I could’ve wiped them all out with the magic engineering cannons...”</span></p><br/><p><span>\"Instead you have General.”</span></p><br/><p><span>“That’s right </span><i><span>dot</span></i><span>. This will deal harsh damage to the orcs. Huhut.”</span></p><br/><p><span>\"A tragedy.\"</span></p><br/><p><span>Crockta turned his head away from Tiyo after the joke. Tiyo wasn’t the only one waiting for the fight. </span><span>Driden’s scimitars were moving through the air. Like a painter imagining a composition before drawing it, he was imagining his own trajectories. </span><span>He felt Crockta’s gaze and glanced over.</span></p><br/><p><span>Radet, who led the army from Nameragon, and Jamero also appeared. </span><span>The troops from the Luklan Mountains were deployed throughout the city in preparation for the battle.</span></p><br/><p><span>And...</span></p><br/><p><span>Crockta looked back.</span></p><br/><p><span>The pillar of the world, the world tree was standing in the center of Spinoa and overlooking everything. </span><span>Standing on top of it was Zelkian. He waved his hand. Crockta waved back.</span></p><br/><p><span>\"Crockta. Are you ready </span><i><span>dot</span></i><span>?” Tiyo asked.</span></p><br/><p><span>Crockta followed Tiyo’s gaze. </span><span>The large army of orcs in front of Spinoa was slowly advancing forward. </span><span>Leading them was the oversized great chieftain, the monster called Calmahart. </span><span>He walked towards Spinoa. The large army advanced along with him. The orcs that covered the plains marched towards Spinoa.</span></p><br/><p><span>Crockta held Ogre Slayer in his hands.</span></p><br/><p><span>\"I was born ready.\"</span></p><br/><p><span>“What </span><i><span>dot</span></i><span>? Then I was ready from my mother’s womb </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>Crockta and Tiyo started laughing. </span></p><br/><p><span>Tiyo laughed aloud as he said, \"Crockta, I’m glad I met you </span><i><span>dot</span></i><span>. I got to experience such a great adventure.\"</span></p><br/><p><span>\"Why are you already amazed? This is just the beginning.”</span></p><br/><p><span>“Hoh. Really </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>Crockta smiled.</span></p><br/><p><span>\"After the war, there will be more grand adventures waiting. Don't spread it around.”</span></p><br/><p><span>“Kahahat, how fun!”</span></p><br/><p><span>Tiyo raised General.</span></p><br/><p><span>The Great Northern War, which began with the call of the mad chieftain Calmahart, was now heading towards the end.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}