{"title": "Chapter 146 - Dirty South (3)", "id": 146, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-146-dirty-south-3", "volume_title": "Volume 2", "body": "<h1>Chapter 146 - Dirty South (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 146 - Dirty South (3)</span></p><br/><p><span>The questionable knight headed towards Crockta.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>The bandits and Crockta’s party faced each other with the knight in the middle.</span></p><br/><p><span>“The south is truly strange </span><i><span>dot.</span></i><span> Knights attacking bandits, and this time the knight is being chased </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>“Gnome Brother! Save me!”</span></p><br/><p><span>\"Who is your brother </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>The bandits flinched as they saw Crockta’s ugly face. </span><span>The leader looked behind him. Bandits were still rushing over. </span><span>Once there were enough of them, the bandits looked at Crockta with confidence.</span></p><br/><p><span>“Orc and Gnome! Give that knight to us!”</span></p><br/><p><span>They raised their weapons as the leader spoke with a threatening manner and voice. </span><span>They were different from the villagers, as they looked like real bandits.</span></p><br/><p><span>\"Tell me what is your relationship to each other.”</span></p><br/><p><span>“Tell you?” </span><span>The bandits burst out laughing. </span><span>\"The orc isn’t scared! He dares to speak to me, the Mountain King Nodun!”</span></p><br/><p><span>The bandits behind him also laughed.</span></p><br/><p><span>“Hey! Knight! Both that orc and gnome are going to die because of you!”</span></p><br/><p><span>\"You aren’t a knight but a grim reaper! Kelkelkel!”</span></p><br/><p><span>\"Get along well! Kekeke!”</span></p><br/><p><span>The bandits taunted the knight’s as tears welled up in his eyes.</span></p><br/><p><span>\"Orc Brother, you have a big sword so please lend me your strength...”</span></p><br/><p><span>However, the knight seemed to become desperate as he saw that the number of bandits kept on increasing. </span><span>The number of followers of the self-proclaimed Mountain King Nodun continued to grow, and there now seemed to be several dozens. </span><span>Unlike the other bandits, they were equipped with proper weapons and armor. Archers were aiming bows at them from the rear.</span></p><br/><p><span>Real bandits. </span><span>While Crockta could easily handle them, they were at a level that couldn’t be matched by an ordinary warrior.</span></p><br/><p><span>The knight frowned before bowing his head and sighing. </span><span>“Hoo. It is only up to here. It is a shame.”</span></p><br/><p><span>The knight raised his head. </span><span>He grabbed the long sword hanging from his waist. He placed the handle and guard section in front of his forehead and whispered.</span></p><br/><p><span>\"The Alaste Knights live without regrets and die while laughing.”</span></p><br/><p><span>The trembling voice slowly calmed down. </span><span>He looked at Crockta and said, “Orc Brother, I’m sorry. Run away.”</span></p><br/><p><span>“What about you?”</span></p><br/><p><span>\"Out of fear for my life, I have shamefully placed you in danger. I will endure as long as possible. I apologize for the inconvenience.”</span></p><br/><p><span>He stepped forward and took a stance. Mountain King Nodun laughed and raised his axe in response. </span><span>\"Now you want to come out and pretend to be a hero?”</span></p><br/><p><span>\"Do I look like a hero?” </span><span>The knight rushed forward. </span><span>\"I am an ordinary knight, bastards!”</span></p><br/><p><span>It wasn’t seen when he was running away, but his movements when charging into battle were quite good. </span><span>There was no contest if he was fighting Nodun one-on-one. The knight pierced through any gaps with brilliant movements and predictions as he aimed at Nodun.</span></p><br/><p><span>Nodun faced the knight with his axe but he eventually retreated. The difference in skill was remarkable. </span><span>Nodun immediately called for his fellow bandits.</span></p><br/><p><span>\"Guys! Catch this guy!”</span></p><br/><p><span>“Yes!”</span></p><br/><p><span>\"Let's go!\"</span></p><br/><p><span>The bandits stampeded forward. </span><span>The knight stepped back as if he expected it and cut the person who approached him first before shouting, \"I am Knight Vigo of Alaste!”</span></p><br/><p><span>The knight was remarkably brave when dealing with the bandits alone. </span></p><br/><p><span>He gave Crockta a good impression. </span><span>“That guy is different from the fake knights.”</span></p><br/><p><span>Suddenly, the axe of a bandit aimed towards Vigo’s back. </span><span>A crisis situation! </span><span>At that moment, a light flashed.</span></p><br/><p><i><span>Puoong!</span></i></p><br/><p><span>Tiyo’s magic bullet pierced through the air and hit the bandit. </span><span>The bandit flew in the air. </span><span>Tiyo’s artifact, General, was gradually becoming more destructive.</span></p><br/><p><span>“Go Crockta, </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>“Bul’tar!”</span></p><br/><p><span>Crockta got off his horse and joined the battlefield. </span><span>He grabbed Vigo’s collar and threw him back, dealing with the bandits alone. </span><span>Every time his greatsword swung, the enemies would be broken down. It was an overwhelming force, like a lion among sheep. </span><span>No one could stop Crockta.</span></p><br/><p><span>“W-What is this guy?” </span><span>Nodun stepped back and ordered the archers to shoot.</span></p><br/><p><span>\"O-Our companions are there!”</span></p><br/><p><span>\"Shut up! Just shoot!”</span></p><br/><p><span>“Yes, yep!”</span></p><br/><p><span>The arrows fired without caring about the bandits hit as well. </span><span>Crockta stopped the arrows with his greatsword.</span></p><br/><p><span>\"Ack!\"</span></p><br/><p><span>“...Cough!”</span></p><br/><p><span>“Keooook!”</span></p><br/><p><span>The arrows just ended up reducing the people on the same side. </span><span>The bandits hit by the arrows stared incredulously before dying. The pupils filled with grudges stared at Nodun.</span></p><br/><p><span>\"Uhhh...shit.” </span><span>Nodun gritted his teeth and shouted, “Monster! Run away!”</span></p><br/><p><span>“Retreat!”</span></p><br/><p><span>“Retreat!”</span></p><br/><p><span>The bandits started to run away. The speed at which they escaped was fast.</span></p><br/><p><span>Crockta watched them and shrugged. </span><span>\"It isn’t worth chasing them.”</span></p><br/><p><span>He smiled and turned around.</span></p><br/><p><span>\"Oh my god....!\" </span><span>Vigo’s eyes were shaken after witnessing the dance.</span></p><br/><p><span>It was a short fight but it was enough to guess the orc’s level. </span><span>Only a few knights were able to overcome such a huge difference in numbers. A one-sided slaughter was even rarer. </span><span>Only a handful of knights, called masters, were capable of it.</span></p><br/><p><span>The master knights all led a unit and were coveted talents in every city, the most important power. </span><span>In addition, the orc’s skills seemed to be beyond a master. </span><span>Maybe he was a grandmaster.</span></p><br/><p><span>Grandmaster! </span><span>A true legend that transcended a master! There was only one grandmaster in Alaste, where he came from.</span></p><br/><p><span>Vigo was thrilled as he rushed up to Crockta.</span></p><br/><p><span>\"Orc Brother!</span></p><br/><p><span>He hugged Crockta and shook his body to the left and right. </span><span>It seemed like he was trying to lift Crockta, but Crockta was too heavy.</span></p><br/><p><span>\"I’m so lucky to meet Brother! Orc Brother! What is your name?” I’ll be your brother from now on! I love you!”</span></p><br/><p><span>“......”</span></p><br/><p><span>Crockta couldn’t tell if this knight was good or shameless. </span><span>Then the watching Tiyo came over.</span></p><br/><p><span>\"Kiiyok!”</span></p><br/><p><span>“Keok!”</span></p><br/><p><span>\"What Crockta Brother </span><i><span>dot</span></i><span>? I am the one who saved your life, Tiyo from Quantes </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>\"Ah, Gnome Brother. Hahahat! Brother! Vigo greets you!” </span><span>He smiled and bowed deeply. </span><span>\"I am Knight Vigo of Alaste! It's an honor to meet you today! Hahahahat!”</span></p><br/><p><span>\"We didn’t allow you to...”</span></p><br/><p><span>“Crockta Brother! Tiyo Brother! Hahahat!” </span><span>Then Vigo discovered the hiding Anor. </span><span>“Hey! Are you their follower?”</span></p><br/><p><span>“Huh?”</span></p><br/><p><span>“I’m asking if you are their follower! A thin fellow like you...”</span></p><br/><p><span>\"Why is a bastard like you trying to convert me to a follower?”</span></p><br/><p><span>“W-What...”</span></p><br/><p><span>\"You fuc...oof! Don't stop me...this bas...oof oof!”</span></p><br/><p><span>Crockta blocked his mouth. </span><span>\"This is Anor, a companion.”</span></p><br/><p><span>Vigo nodded as he ignored Anor who kept trying to curse. </span><span>\"Ah...yes...Anor...Brother?”</span></p><br/><p><span>\"Be careful of his swearing.”</span></p><br/><p><span>“I-I will be careful.”</span></p><br/><p><span>\"What type of scavenger...oof!”</span></p><br/><p><span>Thus, they defeated the bandits and met a knight of Alaste.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Vigo stood up and shouted. “Brothers! Be Alaste’s strength!”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Vigo’s drunk voice resounded loudly in the pub. The eyes of those drinking gathered on him. </span><span>Vigo noticed and carefully sat down. </span><span>The eyes of the drunkards weren’t good.</span></p><br/><p><span>\"What, an Alaste bastard?”</span></p><br/><p><span>\"Get out of our neighborhood!”</span></p><br/><p><span>\"They will be crushed and will fall.”</span></p><br/><p><span>The men occupying another table cried out. </span><span>This was a kingdom of humans. </span><span>After going south from Maillard, there was a wide forest and after that, they would see a human city. </span><span>Other species were about to enter, but like Orcrox and Maillard, the humans were dominant and the rulers were also human. </span><span>This was the first checkpoint city, ‘Reynolds’.</span></p><br/><p><span>\"What is a bastard from Alaste doing in Reynolds?”</span></p><br/><p><span>“Be patient, patient.”</span></p><br/><p><span>“Hey, my mood is bad now.”</span></p><br/><p><span>They stared at Vigo with threatening eyes.</span></p><br/><p><span>\"Beat up that Alaste bastard.”</span></p><br/><p><span>Vigo’s eyebrows twitched. He couldn’t endure the insults. </span><span>At that moment, the door opened.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Everyone’s breathing stopped.</span></p><br/><p><span>An orc. </span><span>As soon as the door opened and the horrible face entered the pub, all drunkards regained their spirits. It wasn’t a hangover remover. </span><span>The pub became quiet as the large body with menacing tattoos and the greatsword entered the room.</span></p><br/><p><span>Orcs rarely appeared in the south. </span><span>In addition, it was rare to see such a vicious looking orc among the orcs. </span><span>The orc looked around the pub with fierce eyes before sitting down at a table. </span><span>It was the table with the person from Alaste.</span></p><br/><p><span>\"Crockta, you came </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>“Um. You are late.”</span></p><br/><p><span>Crockta had stopped by the blacksmith to repair Ogre Slayer. A lot of blood covered it so it needed to be checked.</span></p><br/><p><span>\"But why do they call you a bastard from Alaste? They use that phrase for you </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>\"Alaste?” </span><span>Crockta looked around the eerily quiet pub. </span><span>“It is quiet.”</span></p><br/><p><span>There were no more voices mocking Alaste. Those who made the threatening remarks were now quietly sipping alcohol while staring at their table. </span><span>After the silence caused by Crockta, Vigo shouted, “Hooray, Alaste!”</span></p><br/><p><span>“......”</span></p><br/><p><span>Alaste was unique in the human territory because it was a city that declared itself completely neutral. </span><span>In other words, it wasn’t under the reign of the king. </span><span>It hadn’t been a problem when the king’s existence was just a symbol, but now it was a huge problem when the king declared himself an emperor. He demanded Alaste’s submission. </span><span>The king’s policy had changed.</span></p><br/><p><span>\"The kingdom will soon become an empire. This isn’t just our problem. It is a continent-wide problem.”</span></p><br/><p><span>\"Hrmm.”</span></p><br/><p><span>The great chieftain in the north, and an emperor in the south. </span><span>Crazy people kept appearing.</span></p><br/><p><span>\"The world is becoming ridiculous.”</span></p><br/><p><span>“That’s right. It is ridiculous.” </span><span>Vigo lowered his voice as he said, \"In fact, I think the guy called the Mountain King was chasing after me because of the emperor.”</span></p><br/><p><span>“What do you mean?”</span></p><br/><p><span>“He and his men suddenly appeared and occupied the area. They only attack people traveling to Alaste. So I was dispatched for reconnaissance, but my companion was caught.”</span></p><br/><p><span>\"Your companion?”</span></p><br/><p><span>\"My companion...” </span><span>Vigo paused. </span><span>\"My companion is… a brave Alaste knight who is now gone.”</span></p><br/><p><span>\"I'm sorry. It is a shame.”</span></p><br/><p><span>“...No. Anyway, those bandits use axes but their movements are definitely trained. In particular, they use the swordsmanship of the kingdom. It is obvious. It doesn’t make sense that those guys are just bandits. They must be soldiers assigned here.”</span></p><br/><p><span>Vigo thought that the kingdom deliberately created bandits in order to harass Alaste.</span></p><br/><p><span>\"Alaste’s future is dark, but I saw hope today, brother!”</span></p><br/><p><span>“......”</span></p><br/><p><span>\"Help Alaste!”</span></p><br/><p><span>Crockta looked at Tiyo, who just shrugged.</span></p><br/><p><span>\"Let’s listen a bit more </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>Anor didn’t speak as he quietly sipped his drink. </span><span>His hood was down so the females in the pub were also looking at him with strange eyes. He was too handsome.</span></p><br/><p><span>\"How can we help? Do we have to spend our whole lives in Alaste? That is impossible.”</span></p><br/><p><span>“That’s not it.” </span><span>Vigo took another gulp of his beer before thumping the glass against the body. Then he said. </span><span>\"Compared to the kingdom, Alaste is weak. It is obvious. Everyone knows this. So the king calling himself the emperor took mercy on us and made a proposal.”</span></p><br/><p><span>A one-on-one fight between the most powerful person in Alaste and the kingdom! </span><span>A proxy war with the best knights! </span><span>If Alaste won, the kingdom would leave them alone. If the kingdom won, Alaste would join the kingdom.</span></p><br/><p><span>\"Once the king places Alaste and other cities under his control, he will change his title to Emperor and start earnestly creating an empire. Most places have already joined and among the few remaining cities, our Alaste is especially symbolic. It is the biggest situation.”</span></p><br/><p><span>“Um...”</span></p><br/><p><span>“You might’ve guessed already. The kingdom is full of tremendous knights. In particular, Grandmaster Paklinche is an unbeatable knight who has never been defeated.”</span></p><br/><p><span>“Paklinche?”</span></p><br/><p><span>“Yes. He is Adandator Paklinche.”</span></p><br/><p><span>\"Does he have a relationship with Leyteno Paklinche?”</span></p><br/><p><span>\"...Ah...the traitor. You know him.”</span></p><br/><p><span>Crockta’s eyebrows twitched.</span></p><br/><p><span>Vigo raised both hands. </span><span>“I don’t mean anything by it. Please understand.”</span></p><br/><p><span>Leyteno Paklinche. </span><span>The great warrior in the Hall of Fame, ‘Master of the Greatsword!’ </span><span>He was why Crockta used the greatsword. </span><span>A human who hated the false hypocrisy of humans and fought with the orcs against his fellow countrymen.</span></p><br/><p><span>\"Leyteno is a distant ancestor of Adandator Paklinche. A master of the family.”</span></p><br/><p><span>“I see.”</span></p><br/><p><span>\"In any case, it is expected that he will come out in the proxy war. If he comes out, there is no knight in Alaste who can fight against him...ah!” </span><span>Vigo’s eyes lit up. </span><span>\"I have Brother today! Please come out in the duel for Alaste!”</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}