{"title": "Chapter 145 - Dirty South (2)", "id": 145, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-145-dirty-south-2", "volume_title": "Volume 2", "body": "<h1>Chapter 145 - Dirty South (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 145 - Dirty South (2)</span></p><br/><p><span>The appearance of the knights in the iron armor was imposing. It was hard to see so many fully armed people in the land of other tribes. </span><span>They never bowed their heads. They were arrogant people who looked down at the villagers like they were dirty from their horses.</span></p><br/><p><span>\"His Majesty is merciful. You have another chance.”</span></p><br/><p><span>The villagers recalled the past and shivered with fear. </span><span>As nobody answered, a knight came forward and pulled out his sword. </span><span>The sunlight falling through the dense trees reflected off the blade, causing a dazzling flash.</span></p><br/><p><span>\"All you dumb people! Answer!”</span></p><br/><p><span>The villagers were hesitant and resigned. Their eyes were focused on the blades of the knights.</span></p><br/><p><span>These swords. </span><span>Their homes had been trampled and the family was killed by these swords. They would be forced by those swords to follow the emperor. </span><span>The obvious way was to follow the emperor. In the end, they would become serfs and sacrifice their lives. No, the emperor would recruit them for a war that they didn’t want to participate in.</span></p><br/><p><span>The emperor was such a person.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Hans shook from behind Crockta’s back. </span><span>He took deep breaths. </span><span>He held the gold coins he received from Crockta, hesitated for a moment before grasping Crockta’s hand. </span><span>Crockta accepted his hasty gesture.</span></p><br/><p><span>Hans whispered. </span><span>\"Run away!”</span></p><br/><p><span>“......”</span></p><br/><p><span>He headed towards the knights without looking back. </span><span>He was the representative of this place.</span></p><br/><p><span>\"I will be happy to answer. Sir Knight.”</span></p><br/><p><span>He bowed his head in front of the knights. </span><span>The knight’s blade descended towards Hans’ head.</span></p><br/><p><span>“Go ahead.”</span></p><br/><p><span>\"We are...”</span></p><br/><p><span>\"Before you say it...” </span><span>The knight interrupted Hans’ words and laughed. </span><span>\"Look at the people around you and think about it.”</span></p><br/><p><span>Hans closed his mouth and looked back. The eyes of all the villagers were facing him. </span><span>The wrinkled eyes of the elderly, the nervous faces of the youths, the frightened women and the infants sleeping without knowing anything.</span></p><br/><p><span>Hans closed his eyes, took a deep breath and spoke again. </span><span>\"I live in a small village and don’t know anything about the world, like you knights...”</span></p><br/><p><span>The blade fell to the top of his head. Hans stopped breathing.</span></p><br/><p><span>\"...After the knights came, we moved to the forest to become bandits. We tried to hunt and fight, but were often defeated.”</span></p><br/><p><span>\"You speak too much.”</span></p><br/><p><span>\"...We are just normal people. If the knights point swords at us then we can only follow. It is better than dying. But that is what I’m saying.”</span></p><br/><p><span>Hans raised his head. </span><span>The sun reflected off the helmet but he stared directly at knight’s face. It was the face of a young man. Hans spoke.</span></p><br/><p><span>\"We also know what the Emperor is like. We aren’t people who fit your world. Can’t you just let us go?”</span></p><br/><p><span>There was an earnest appeal in Hans’ eyes. </span><span>The knight nodded. </span><span>“I see. I heard it well.”</span></p><br/><p><span>Hans bowed his head again. The knights glanced at each other. </span><span>After a short exchange of opinions, the knight opened his mouth.</span></p><br/><p><span>\"People not from His Majesty’s world...” </span><span>The knights pulled out their swords. </span><span>\"Then you should go to a world that suits you.”</span></p><br/><p><span>The village residents shrieked. </span><span>The first target was Hans. The sword descended towards him.</span></p><br/><p><i><span>Kakang!</span></i></p><br/><p><span>Then there was the sound of weapons hitting each other.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>The knight was stunned. </span><span>Something was blocking him. </span><span>It was a gigantic greatsword that couldn’t be lifted even if he tried.</span></p><br/><p><span>“Bul’tar. You don’t deserve the name of a knight.”</span></p><br/><p><span>The ferocious orc moved the greatsword and the knight staggered. </span><span>He was strangely covered in tattoos. His body emitted a terrifying killing intent.</span></p><br/><p><span>“Who are you?”</span></p><br/><p><span>The knights were hesitant. </span><span>They instinctively felt that this orc wasn’t easy. </span><span>Crockta pushed the puzzled Hans back before firmly replying, “My name is Crockta.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Crockta, a name they had heard somewhere before. </span><span>It was a name that all the gods whispered in the temples. A northern hero who conquered the north and stopped the great chieftain.</span></p><br/><p><span>Northern Conqueror. </span><span>But the only thing known about him was the name Crockta and that he was an orc. It was hard to believe that he was Crockta.</span></p><br/><p><span>The knights snorted, \"Where did you hear that?”</span></p><br/><p><span>They thought that he was just borrowing the name of Crockta. Crockta placed the greatsword on his shoulder and declared, \"If you are really a knight, there should be oaths that you made when you became one.”</span></p><br/><p><span>Chivalry wasn’t that different in the world of Elder Lord. </span><span>They pledged to defend the knight’s oath. It wasn’t that different from the warriors’ law that Crockta received.</span></p><br/><p><span>\"Do you remember?”</span></p><br/><p><span>The knights’ faces distorted. </span><span>\"What Crockta nonsense? Garbage orc bastard. Everyone attack!”</span></p><br/><p><span>“Yes!” They shouted as the horses started running.</span></p><br/><p><span>At that moment, Crockta roared and kicked off from the ground.</span></p><br/><p><span>“Bul’tarrrrrrrrrr──────!”</span></p><br/><p><span>A shout like thunder! </span><span>At the same time, Crockta’s energy exploded. The horses were shocked and turned like something was blocking the front.</span></p><br/><p><span>“Whoa! Whoa!”</span></p><br/><p><span>\"What is going on?\"</span></p><br/><p><span>The knight in the lead called out. </span><span>The orc looked like a giant, no huge monster in front of the horses. </span><span>He was actually like that. </span><span>His killing intent shot into the sky.</span></p><br/><p><span>The knights started sweating. The horse’s eye level was much higher, but it seemed like the orc was looking down at them from a huge height. </span><span>The greatsword seemed like it could break a mountain. </span><span>The pressure was huge.</span></p><br/><p><span>Was this orc really that person? </span><span>The orc Crockta, who killed the great chieftain and conquered the north alone! </span><span>Did he come to the south after leaving the north?</span></p><br/><p><span>\"Tell me.\" </span><span>Crockta gazed at them with fierce eyes. </span><span>\"What was your oath?’</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>The illusion of a giant orc crushed them.</span></p><br/><p><span>\"Did you swear to persecute the weak? Is that the type of knight you are?”</span></p><br/><p><span>\"Something like this...!”</span></p><br/><p><span>\"Or did you want to swear an oath now?”</span></p><br/><p><span>Crockta’s killing intent tied up their bodies. </span><span>A knight feared the crisis and aimed his sword at Crockta.</span></p><br/><p><span>\"Shut upppp!”</span></p><br/><p><span>His body filled with strength. He wasn’t an ordinary soldier. At the end of hard training, he was a man who received the title of a knight. </span><span>The knight who was after Crockta’s life laughed wildly and got off his horse.</span></p><br/><p><span>“Chivalry? Puhahat, what nonsense.”</span></p><br/><p><span>He realized that he shouldn’t rely on horses to deal with this orc. </span><span>The horse was unable to charge because of the opponent’s fierce killing intent. He could feel that his horse was shivering.</span></p><br/><p><span>\"Everyone get off your horses and deal with this orc. He is someone who can’t be ignored.”</span></p><br/><p><span>Crockta was calm. He was familiar with one-to-many fights. </span><span>The knights started to surround Crockta.</span></p><br/><p><span>“Chivalry? An orc shouldn’t say something so funny. But I will give an answer.” </span><span>The knight talking to Crockta laughed. </span><span>They were knights. No matter how strong this orc was, he would never be able to win against so many knights.</span></p><br/><p><span>He shouted, </span><span>\"I said to protect the weak, fight injustice and do justice. But what good is that? Anyway, strength is the only thing that matters in this world. You will die today! Kuhahat!”</span></p><br/><p><span>The blades of many knights headed to Crockta.</span></p><br/><p><span>\"The emperor is more important to us than the oath! For His Majesty!”</span></p><br/><p><span>“For His Majesty!”</span></p><br/><p><span>The knights aimed for Crockta. It was a forest of swords with no place to avoid.</span></p><br/><p><span>Ogre Slayer moved.</span></p><br/><p><span>\"You forgot your shame and are speaking so unabashedly.”</span></p><br/><p><i><span>Kang!</span></i></p><br/><p><i><span>Kang!</span></i></p><br/><p><i><span>Kang kang kang kang kang!</span></i></p><br/><p><i><span>Kaaaang!</span></i></p><br/><p><span>At that moment, Ogre Slayer hit dozens of blades at the same time. </span><span>The swords of the knights bounced back. </span><span>The knights retreated from the tremendous shock. </span><span>They couldn’t comprehend the situation.</span></p><br/><p><span>What just happened? </span><span>Only one sword had blocked their swords at the same time. The attacks were all from different angles. But the sword had met dozens of blades at once.</span></p><br/><p><span>Crockta opened his mouth. </span><span>\"Destroy the covenant.”</span></p><br/><p><span>“What?”</span></p><br/><p><span>\"The burden on your back!” </span><span>Crockta lowered his posture. </span><span>His lower body contracted. </span><span>\"It will be the cause of your death.”</span></p><br/><p><span>Crockta exploded forward. </span><span>The knights raised their swords but Ogre Slayer penetrated through the gap. </span><span>The broken bodies and blades flew through the air. A fountain of blood followed. </span><span>Crockta laughed as his sword pierced a stomach. </span><span>\"If you wonder why the emperor will die, this is your answer.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>The knights’ morale was broken after suffering from his explosive strikes. The formation was broken. </span><span>Crockta didn’t miss this chance as he dug into the knights’ encirclement and broke it further.</span></p><br/><p><span>\"Kuaaaak!\"</span></p><br/><p><span>“Aaaah!”</span></p><br/><p><span>Terrible screams were heard. </span><span>The horses were watching their masters be slaughtered with frightened eyes. </span><span>The sight of blood spouting and the greatsword separating the body was reflected in their big eyes.</span></p><br/><p><span>Ogre Slayer sank into the belly of a knight who resisted. </span><span>The situation was over. </span><span>The knights were scattered all over the place, making it impossible to tell which body and head went together.</span></p><br/><p><span>Crockta kicked a head at his feet while walking towards the one remaining knight. </span><span>The knight fell to the ground and shivered while moving backward.</span></p><br/><p><span>““M-Monster...!”</span></p><br/><p><span>“Monster?” </span><span>Crockta kicked him. The knight fell back on the ground. </span><span>\"You are the monster.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>\"It isn’t just here. How many villages did you destroy?”</span></p><br/><p><span>When he didn’t answer, Crockta placed the greatsword against his neck. </span><span>The knight hurriedly opened his mouth.</span></p><br/><p><span>\"W-We didn’t kill everything. According to orders, we didn’t kill...”</span></p><br/><p><span>\"So how many did you kill?”</span></p><br/><p><span>“......”</span></p><br/><p><span>The knight moved his mouth but couldn’t speak.</span></p><br/><p><span>\"Ohh...” </span><span>He suddenly fell face-down in the dirt. </span><span>\"P-Please spare me.”</span></p><br/><p><span>He spoke as his forehead touched the floor. </span><span>It was a subservient appearance.</span></p><br/><p><span>\"It can’t be helped since I just followed the emperor. Please spare me. I worked my whole life to become a knight. My dream just barely came true so I can’t die like this...please forgive me once!”</span></p><br/><p><span>“......”</span></p><br/><p><span>Crockta couldn't answer. </span><span>The knight became still but slowly looked up when there was no answer.</span></p><br/><p><span>“...Ah?”</span></p><br/><p><span>But the greatsword was right before his nose. </span><span>The greatsword moved.</span></p><br/><p><i><span>Kwajik!</span></i></p><br/><p><span>“Kuaaaaak!”</span></p><br/><p><span>The knight’s right hand was severed. </span><span>The severed limb rolled across the ground. The bleeding continued. </span><span>Crockta tore clothing from a dead knight’s body and threw it at him.</span></p><br/><p><span>\"Tell the one you call the emperor.”</span></p><br/><p><span>The knight covered his wrist with the cloth before wriggling to retrieve the hand that had been cut off. If he went quickly then he could reattach it. </span><span>Crockta kicked the severed hand away. The knight felt despair.</span></p><br/><p><span>\"I am Crockta, the one who killed the crazy chieftain. He who has killed innocents and cast the world into darkness for his own sake.”</span></p><br/><p><span>Crockta grabbed the knight’s neck and raised him. Then he placed the knight on top of a horse. </span><span>The horse trembled lightly. </span><span>Crockta whispered in the ear of the knight.</span></p><br/><p><span>“Let the emperor know that his fate can be the same.”</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Crockta’s party left Hans’ village. </span><span>After witnessing Crockta’s ruthlessness, Hans and the villagers worshiped Crockta like he was a god. </span><span>Crockta gave them money and sent them to the Rehabilitation Brothers in Maillard. He wrote a letter asking them to be looked after.</span></p><br/><p><span>Hans and the villagers bowed in thanks before leaving immediately. It was because the emperor might dispatch more men if they stayed there. Maillard, the area of the elves, was beyond the emperor’s touch.</span></p><br/><p><span>\"The south is a little strange </span><i><span>dot</span></i><span>.” </span><span>Tiyo said.</span></p><br/><p><span>They were now riding the horses that used to belong to the  knights. </span><span>After seeing their masters die because of Crockta, the horses started following them in earnest. The rest of the horses were given to the villagers.</span></p><br/><p><span>\"Humans are the strange ones.”</span></p><br/><p><span>It seemed like hierarchy still remained in the southern part of the continent.</span></p><br/><p><span>\"Even so </span><i><span>dot</span></i><span>... Look, isn’t that strange </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>Tiyo pointed in front of him. </span><span>Crockta looked forward. </span><span>Then he slowly opened his mouth.</span></p><br/><p><span>\"What is that?”</span></p><br/><p><span>\"I don’t know </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>\"Isn’t it a knight?”</span></p><br/><p><span>\"What are you saying </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>As Anor said, it was a knight. </span><span>But it was different from the knights they met before.</span></p><br/><p><span>“Help me! I am a knight! Save me!”</span></p><br/><p><span>Someone was running on all fours. </span><span>And there were bandits chasing him.</span></p><br/><p><span>\"You can't run away! Give us everything you have, Knight!”</span></p><br/><p><span>“Nooooooo!”</span></p><br/><p><span>The knight’s eyes shone as he saw Crockta. Then he started to run towards them.</span></p><br/><p><span>\"Orc Brother! Hey, Orc Brother! I am a knight so can you help me? Orc Brother!”</span></p><br/><p><span>\"Crazy!”</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}