{"title": "Chapter 150 - Evil Empire", "id": 150, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-150-evil-empire", "volume_title": "Volume 2", "body": "<h1>Chapter 150 - Evil Empire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 150 - Evil Empire</span></p><br/><p><span>The two sides confronted each other on the plains. </span><span>The kingdom’s and Alaste’s flags danced in the wind. </span><span>The king and the lord of Alaste headed towards each other on horseback.</span></p><br/><p><span>\"It is great to see you.”</span></p><br/><p><span>\"It has been a while, Earl Alaste.”</span></p><br/><p><span>The king was a young man, the epitome of a noble with blonde hair and observant, blue eyes. </span><span>Of course, he was more than a mere noble. He was the king who would soon stand at the top.</span></p><br/><p><span>\"It's a good day. I will cleanly accept the result today. In the name of the gods.”</span></p><br/><p><span>“Yes. I will as well. I hope Your Highness keeps the words you said beforehand.”</span></p><br/><p><span>The king’s eyes narrowed. Earl Alaste’s expression didn’t change. </span></p><br/><p><span>The king asked, “You seem to have confidence. How is Galadin?”</span></p><br/><p><span>\"He’s as upright as always. Do you want to see him?”</span></p><br/><p><span>“It’s okay. It is enough to see you instead of that old man’s face.”</span></p><br/><p><span>Both of them didn’t avoid the other’s eyes.</span></p><br/><p><span>“...Okay.”</span></p><br/><p><span>The king’s lips twisted before he smiled and said, \"Once the sun comes up to the middle, the duel will start. I’ll tell Adandator to control his strength in consideration for Galadin’s old age.”</span></p><br/><p><span>\"Thank you for your words. Just...”</span></p><br/><p><span>\"Just?\"</span></p><br/><p><span>“Galadin won’t be fighting today.”</span></p><br/><p><span>\"What?\" </span><span>The king gazed at the lord with a suspicious expression. </span><span>\"Then who will come out?”</span></p><br/><p><span>\"You will see when the sun rises to the middle.”</span></p><br/><p><span>“......”</span></p><br/><p><span>The king’s face twisted at the lord’s relaxed attitude. </span><span>He was dissatisfied with the lord’s relaxed attitude and confused about the unknown warrior. </span><span>He spat out in a rough voice, “Yes, I’ll see soon.”</span></p><br/><p><span>They turned around and returned to their camps. </span><span>Lord Alaste immediately sought out Crockta who was in a tent at the rear of the camp. His face was stiff with tension. </span><span>However, he couldn’t help smiling at the sight within the tent.</span></p><br/><p><span>Crockta was lying on a bed and humming, while Vigo was sitting next to the bed and fanning Crockta.</span></p><br/><p><span>\"Are you cool?”</span></p><br/><p><span>“Harder.”</span></p><br/><p><span>“Hiyah!”</span></p><br/><p><span>\"Do it properly. You will be responsible if my condition isn’t good.”</span></p><br/><p><span>“No! Brother!”</span></p><br/><p><span>\"A knight should have a better wrist snap.”</span></p><br/><p><span>He didn’t seem like a warrior who had the fate of the city on his shoulders. That made him seem more reliable. </span><span>This was none other than Northern Conqueror Crockta. He would clearly be able to cope with Adandator.</span></p><br/><p><span>Even Galadin acknowledged that Crockta was stronger than him. The lord decided to give up worrying. </span><span>It had already left his hands. He had dealt the best hand he could.</span></p><br/><p><span>“Vigo.”</span></p><br/><p><span>\"Yes, Lord!\"</span></p><br/><p><span>“Fan him properly. The future of Alaste hangs on your fan.”</span></p><br/><p><span>\"Cough! Yes!”</span></p><br/><p><span>Tiyo and Anor came together and weren’t worried at all. They were dozing in a corner of the tent. They had drunk alcohol all night. </span><span>They were friends who had no tension at all.</span></p><br/><p><span>\"Crockta, I want to thank you once again. Thank you for your willingness to go to such a dangerous place.”</span></p><br/><p><span>\"Kulkulkul. There is no need for thanks, I am just doing the work of a warrior.” </span><span>Crockta leisurely stretched while enjoying the breeze from the fan. </span><span>\"So when is the duel?”</span></p><br/><p><span>“Noon.”</span></p><br/><p><span>Crockta looked at the sky through the open gap in the tent. </span><span>It was pretty soon.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Trumpets sounded. </span><span>Both sides were nervous. </span><span>The sun had risen above their heads. Now the duel would begin. </span><span>It was a fight to determine the future of each side. So many things were involved.</span></p><br/><p><span>Adandator appeared first. </span><span>The king placed a hand on his shoulder and spoke to him. Adandator answered in a short manner.</span></p><br/><p><span>\"It is lively.”</span></p><br/><p><span>Adandator was a beautiful young man. His body was well balanced. </span><span>He was still young, but he was a seasoned knight who had gone through many battles.</span></p><br/><p><span>Then it was time for Alaste’s representative to come out. </span><span>Crockta walked forward.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>The kingdom’s side was shaken and murmurs gradually spread. </span><span>They all expected the warrior for Alaste to be Galadin. </span><span>It was common knowledge that the best knight in Alaste was Galadin, and there was no stronger knight. </span><span>The kingdom was convinced of their victory because Galadin was too old compared to Adandator.</span></p><br/><p><span>However, a surprising figure appeared. </span></p><br/><p><span>An orc. </span><span>A warrior with a heinous face and tattoos all over his body. </span><span>His enormous mass and greatsword could be seen clearly from afar.</span></p><br/><p><span>Adandator looked at him curiously. </span><span>It wasn’t a tense face. He thought it would be a tragic comedy.</span></p><br/><p><span>“I am Adandator Paklinche. Who are you?” </span><span>He was curious about the orc standing in front of him. </span><span>\"Are you really the representative of Alaste?”</span></p><br/><p><span>Crockta nodded. </span><span>The plains gradually became quiet.</span></p><br/><p><span>Crockta smiled and looked at Adandator. </span><span>“My name is Crockta. I came from Orcrox and stand here to guard Alaste.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Adandator’s eyes widened.</span></p><br/><p><span>Crockta. </span><span>He knew that name. </span><span>It was the unidentified orc who killed the great chieftain and blocked them before the call for the northern war began in earnest. </span><span>On that day, all the gods whispered to his name.</span></p><br/><p><span>\"Alaste has prepared a hidden card.”</span></p><br/><p><span>His expression recovered and he lifted his sword. </span><span>Adandator didn’t use a greatsword like Crockta. It was a thin and long sword that looked elegant. </span><span>Both of them used Paklinche’s swordsmanship, but they had different attitudes and atmosphere.</span></p><br/><p><span>Crockta asked, “Do you know Leyteno Paklinche?”</span></p><br/><p><span>“Hoh?” </span><span>Adandator laughed. </span><span>\"The traitor Leyteno. Orcs should know him. Yes, I know Leyteno. He is a coward on the side of the orcs. The traitor who turned his sword against us. That is why he is a blot to the rest of the Paklinche family. In the end, he died miserably.”</span></p><br/><p><span>“A coward. A traitor. A blot.” </span><span>Crockta laughed out loud.</span></p><br/><p><span>The Leyteno that Crockta heard about was absolutely not a coward. </span><span>He wasn’t a traitor or a blot, but a shining star. </span><span>The hero who followed the path of his sword. </span><span>Everyone would’ve blamed him. If Leyteno just closed his eyes and aimed his sword at the orcs, he could gain wealth and honor.</span></p><br/><p><span>However, he gritted his teeth and did what he believed was right. </span><span>He wasn’t a slave but his own master. </span><span>If he followed the same direction that all the other fingers were pointing, he was just a slave.</span></p><br/><p><span>However, Leyteno shook his head and pointed to the other side alone. </span><span>He straightened up, pointed to his own beliefs and moved. </span><span>That was why he would stand forever in the Hall of Fame. </span><span>Leyteno Paklinche would never die. </span><span>None of the warriors in the Hall of Fame would die.</span></p><br/><p><span>\"Right now, I will connect to Leyteno Paklinche’s will.”</span></p><br/><p><span>Crockta raised his greatsword. </span><span>As Crockta reached a higher ground, he had gone beyond Leyteno’s swordsmanship but it was still alive in Ogre Slayer.</span></p><br/><p><span>\"Feel it yourself. Paklinche.”</span></p><br/><p><span>\"Show me your blade, Orc.” </span><span>Adandator grinned. </span><span>“You are ignorant. I can see an echo of the traitor. Okay, just once...”</span></p><br/><p><span>At this moment, everyone on the plains was watching Crockta and Adandator.</span></p><br/><p><span>\"Let's do it!\"</span></p><br/><p><span>Adandator plunged in first. </span><span>Crockta watched him. </span><span>The world slowed. </span><span>Adandator’s handsome face was shining with a mixture of arrogance and self-confidence. Crockta’s greatsword swung towards his shining face.</span></p><br/><p><i><span>Kaaaang!</span></i></p><br/><p><span>Adandator was a genius and was waiting for Crockta in the realm of the Pinnacle. </span><span>The two blades met several times. </span><span>It was a battle that ordinary eyes couldn’t follow. </span><span>They exchanged blows for a long time. As explosive sounds were heard from both sounds, small wounds appeared on their bodies.</span></p><br/><p><span>Blood splattered on both their faces.</span></p><br/><p><span>There would be cheers from both sides whenever dust rose as a result of the collision between swords. </span><span>It was a fight of absolute power that could rarely be seen!</span></p><br/><p><span>At that moment, Crockta’s battle cry shook the plains.</span></p><br/><p><span>“Bul’tarrrrrrrrrr──────!”</span></p><br/><p><span>It was like an earthquake occurred as the audience member’s legs shook from the roar. </span><span>Adandator, who faced it directly, felt like his heart was going to stop. </span><span>Crockta's overwhelming presence was pouring toward him. </span><span>As his eyes flicked, the trajectory of the greatsword flying towards him changed in a subtle way.</span></p><br/><p><span>Adandator tried to block it but was thrown back by a huge power.</span></p><br/><p><span>“Kuheeok!”</span></p><br/><p><span>The moment of the attack, Crockta’s fist struck Adandator’s abdomen. </span><span>Adandator flew through the air and landed on the ground. </span><span>Crockta's powerful blow!</span></p><br/><p><i><span>Waaaaaaaaaaaah!</span></i></p><br/><p><span>Alaste’s side cheered. On the other hand, the side of the kingdom became completely quiet.</span></p><br/><p><span>“......”</span></p><br/><p><span>Adandator stood up. </span><span>He shuddered from the impact as blood poured from his nose. </span></p><br/><p><span>Crockta laughed and raised his finger, signalling his opponent to quickly come at him. </span><span>\"Kulkul, are you okay?”</span></p><br/><p><span>\"You aren’t a mere child. I understand...”</span></p><br/><p><span>Adandator laughed. He spat out the blood in his mouth. Then he took a serious posture with his sword. </span><span>His body started to enter the Pinnacle. Over and over, he once again reached a high ground. </span><span>The world was still.</span></p><br/><p><span>He jumped and brandished his sword at Crockta. </span><span>Crockta blocked it with Ogre Slayer. </span><span>However, his skin was torn and blood poured out. Crockta hurriedly stepped back.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>This time, it was the kingdom’s side that cheered. </span><span>Adandator smiled and repeated Crockta’s words, \"Are you okay?”</span></p><br/><p><span>Crockta responded with a smile, \"You also aren’t a mere child.”</span></p><br/><p><span>“Kilkilkil.”</span></p><br/><p><span>Crockta calmly raised Ogre Slayer.</span></p><br/><p><span>Adandator was a genius. </span><span>He could believe that. </span><span>Adandator had surpassed the realm of the Pinnacle. It was the realm of the Hero that Crockta had learned while crossing life and death. </span><span>If so, Crockta should do the same thing.</span></p><br/><p><span>The cheers and boos became mixed together. The sun was shining above their heads. Sweat was pouring down their cheeks as they recognized the weight of the weapons they held. </span></p><br/><p><span>A formidable opponent. </span><span>A high level of swordsmanship where anyone could win was implemented. </span><span>An interesting opponent.</span></p><br/><p><span>They moved their bodies while thinking the same thing. </span><span>The strands of causality started to converge on both of them. </span><span>The strands of causality stretched out like tentacles towards each other. </span><span>One step, one stroke, a stepping motion, every time the blades moved, they aimed to create a life or death injury.</span></p><br/><p><span>Indeed, Paklinche’s blood was very deep.</span></p><br/><p><span>\"I never thought you would follow this far...”</span></p><br/><p><span>Adandator was inwardly impatient. </span><span>He was convinced that he could win without fail if Galadin was his opponent. </span><span>But then this orc appeared instead of Galadin. </span><span>His instincts sent a warning. They were both on the same ground. </span><span>This orc had also surpassed the Pinnacle.</span></p><br/><p><span>Maybe he would die today. </span><span>The chains of causality stretching from Crockta sought to swallow Adandator.</span></p><br/><p><span>The sun was blazing above his head. </span><span>It was hot. </span><span>Adandator’s eyes were dazzled. If he was careless, the orc would cause him to die under this sun.</span></p><br/><p><span>In the infinitely slow world, Crockta and Adandator met each other. Sweat trickled down Adandator’s face. But he never looked away. </span><span>Now the plains were still. </span><span>They felt that the fight had reached a realm that they didn’t dare to evaluate.</span></p><br/><p><span>The first one to move was Adandator. </span><span>He exploded his power in order to win the battle before it lengthened even further. </span><span>Pressure rose from his body. </span><span>His power reversed causation and rushed towards Crockta’s death.</span></p><br/><p><span>It was like a tsunami was heading towards Crockta. </span><span>Numerous blades were aiming at his neck. </span><span>Causality sped towards Crockta’s death. Crockta aimed for Adandator’s death and canceled out the attack.</span></p><br/><p><span>Blood poured from wounds on his limbs. </span><span>The blades from Adandator inevitably fell towards Crockta from all angles. </span><span>They pierced his shoulders, sides, and thighs at the same time.</span></p><br/><p><span>“Ugh!” </span><span>Crockta fell down.</span></p><br/><p><span>“Waaaaaaack!” </span><span>Adandator didn’t miss this gap and rushed forward. He wanted to finish this in one blow.</span></p><br/><p><span>A huge wave pushed towards Crockta. </span><span>Death seemed unstoppable. </span><span>The handful of wind, bubbles, nail-sized mass and every other trivial thing could cause death. </span><span>Compared to that, the tool called a sword, which was made to kill others, was like a large army advancing towards death.</span></p><br/><p><span>Dozens then hundreds of swords poured towards Crockta. </span><span>The probability of survival and probability of death were reversed. </span><span>Life itself led to death. </span><span>However.</span></p><br/><p><span>“Bul’tar.”</span></p><br/><p><span>Crockta whispered. </span><span>As Adandator’s tsunami of death flew towards him, he started weaving together the causation of the world. </span><span>It was risky.</span></p><br/><p><span>This was the first time Crockta thought about death since the battle against the great chieftain. </span><span>He needed to risk everything to overcome Adandator’s blow. Crockta held Ogre Slayer. He would fight back with his life on the line.</span></p><br/><p><span>However, at that moment...</span></p><br/><p><span>Crockta suddenly saw something.</span></p><br/><p><span>‘I am alive.’</span></p><br/><p><span>He didn’t know what it was. </span><span>However, Crockta instinctively leaned towards the line that was passing through the world. </span><span>It was a color that was hard to describe. </span><span>It was a color that didn’t exist in the world.</span></p><br/><p><span>That line penetrated both the visible world that people could see, the world of the Pinnacle and the world of the Hero that reversed causality. </span><span>Even death couldn’t bear it.</span></p><br/><p><span>‘Honor.’</span></p><br/><p><span>What was that line? </span><span>In addition, the color as well. </span><span>Why was it so radiant? </span><span>The moment that his body touched that line. </span><span>The whole world pushed Crockta’s back. </span><span>It was a helping hand to raise all the sinking things.</span></p><br/><p><span>Crockta rushed towards the infinitely unfolding tsunami of death. He flew towards the infinite expanse of the abyss.</span></p><br/><p><span>Bul’tarrrrrrrrrr──────!</span></p><br/><p><span>There was light.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>It was a long fight. </span><span>Crockta and Adandator gradually entered a state of fighting that couldn’t be understood. </span><span>Only a few senior ranking knights could feel the level. </span><span>The two repeated the gains and losses as they kept attacking each other. Blood sporadically splattered but they didn’t back down.</span></p><br/><p><span>The king stared blankly and inadvertently dropped his wine glass. </span><span>However, the king and his knights were conscious of the pieces of glass. </span><span>It might be a fight that they could never see again in their lives.</span></p><br/><p><span>“I can’t believe it...”</span></p><br/><p><span>At that moment, Adandator rushed like crazy. </span><span>It was an attack on everything. </span><span>As if a storm was taking place around his body, countless attacks were launched. </span><span>Crockta blocked with his greatsword but fell down to one knee.</span></p><br/><p><span>Adandator didn’t miss this and chased him. </span><span>Everyone sensed that it was the final blow. </span><span>There was a black wave.</span></p><br/><p><span>In that instance, the kingdom was convinced that Adandator had won. </span><span>It was a blow containing everything. </span><span>No one could survive that hit.</span></p><br/><p><span>Then...</span></p><br/><p><span>A bolt of light. </span><span>It was a very short moment. </span><span>Light enveloped the plains. </span><span>It was a color that had never been seen before. They didn’t know what color it was. It destroyed Adandator’s black wave.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>The light disappeared and dust rose up. </span><span>They could only see that Adandator’s sword was broken and Crockta’s Ogre Slayer was pointed at his neck. </span><span>Silence fell over the plains. </span><span>The winner and loser didn’t move. There was silence. The clouds moving through the sky stopped.</span></p><br/><p><span>Then a gnome standing on Alaste’s side broke the silence.</span></p><br/><p><span>“Kahahahat! Victory <em>dot</em>!”</span></p><br/><p><span>There was no tension in the voice. </span><span>Then Alaste’s side understood the situation and started cheering. They threw their weapons and helmets and yelled. </span><span>Everyone embraced each other as they shouted.</span></p><br/><p><span>“Waaaaaaah!”</span></p><br/><p><span>“We won!”</span></p><br/><p><span>“Hooray Alaste! Alaste!”</span></p><br/><p><span>\"Hooray Crockta!”</span></p><br/><p><span>\"Alaste! Alaste!”</span></p><br/><p><span>The kingdom’s side was silent. </span><span>The faces of the young king, his knights and the Heaven and Earth executives stiffened. </span><span>They hadn’t expected Adandator to be defeated. </span><span>However, the orc Crockta had ruined their ambitions.</span></p><br/><p><span>\"Dammit, that person...I knew it.”</span></p><br/><p><span>The former master of Thawing Balhae and current vice master of Heaven and Earth, Keynes muttered. </span><span>That Crockta kept continuing to disturb him. </span><span>The guy who got rid of Thawing Balhae. Now he was chasing the Heaven and Earth Clan and hindering their work. </span><span>He gritted his teeth. </span><span>Somehow, he had to get rid of that orc.</span></p><br/><p><span>Rommel kept silent with a stiff face.</span></p><br/><p><span>Adandator dropped his weapon and declared his surrender, causing the duel to completely end.</span></p><br/><p><span>The lord of Alaste approached the king. </span><span>Now that victory had been decided, the Alaste lord descended from his horse and bowed towards the king in a polite manner.</span></p><br/><p><span>“Please accept the result. Your Highness.”</span></p><br/><p><span>“......”</span></p><br/><p><span>Instead of answering, the king quietly turned his head away. </span><span>The lord of Alaste smiled and stepped back. He felt very uncomfortable. </span><span>But it didn’t matter now. </span><span>It was time to go back to Alaste and celebrate.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Alaste scheduled a city wide festival. The protagonist was Crockta.</span></p><br/><p><span>Everyone praised him as the hero who saved Alaste. </span><span>Crockta’s group traveled through the streets and shared food and alcohol with the citizens. </span><span>To the children, he wasn’t an orc but an orc knight. </span><span>The children gathered every time he appeared. They were all calling Crockta’s name.</span></p><br/><p><span>There was a proposal to build a statue of Crockta in commemoration of today. All the sculptors in Alaste volunteered. </span><span>Crockta shook his head but was forced to accept their will. </span><span>His appearance, made of marble, was to remain in Alaste forever.</span></p><br/><p><span>There were women confessing to Anor. Anor didn’t avoid them, staring straight into their eyes as he politely refused. </span><span>They smiled and expressed their thanks for Anor’s gentlemanly attitude. Tiyo hit Anor’s ass.</span></p><br/><p><span>Yellow appeared and hugged Crockta before giving him a kiss on the cheek. </span><span>Crockta couldn’t stop her actions. </span><span>She loved Alaste and praised Crockta, stating that she would be his fan in the future. People were surprised since this was the first time they saw her drunkenness.</span></p><br/><p><span>Tiyo eventually accepted Galadin’s advice. </span><span>Crockta didn’t know the specifics, but Galadin laughed heartily while Tiyo remained patient. </span><span>His expression was rotten but his attitude was so polite that Crockta and Anor ridiculed him. Tiyo closed his eyes and endured it.</span></p><br/><p><span>Crockta’s group enjoyed the atmosphere but eventually had to leave Alaste. </span><span>As Alaste’s heroes, Alaste promised that they would always receive a warm welcome. </span><span>All the citizens blessed their way as Crockta’s group left the gate.</span></p><br/><p><span>Crockta’s group was heading towards the resort city Gridori.</span></p><br/><p><span>After Crockta’s group left, the kingdom broke their agreement and invaded Alaste. </span><span>Alaste was devastated. </span><span>The kingdom became an empire, and the king became an emperor.</span></p><br/><p>This month's Q&amp;A had been delayed and will now take place in ~11 hours on the Wuxiaworld discord.</p><br/><p>In addition, vote here at Volare's special event for the chance to get two extra chapters of PTO released.</p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}