{"title": "Chapter 151 - Rain is Coming", "id": 151, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-151-rain-is-coming", "volume_title": "Volume 2", "body": "<h1>Chapter 151 - Rain is Coming</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 151 - Rain is Coming</span></p><br/><p><span>The rain fell down in droves, relentlessly striking the umbrellas. </span></p><br/><p><span>Ian tilted his umbrella and looked up at the sky. </span><span>A steady stream of water poured out from the gray sky. </span><span>Suddenly, the sound of music was heard from a store. </span><span>It had a catchy melody. He didn’t know whose song it was, but it was sung by a familiar voice he heard often. </span><span>The singer was singing about a goodbye in a melancholy tone.</span></p><br/><p><span>Students ran splashing through the water. Ian’s feet were wet. </span><span>He looked down at his wet feet. </span><span>The neon signs were reflected on the surface of the puddles and the sound of laughter from distant children overlapped with the rain.</span></p><br/><p><span>Ian shook his head.</span></p><br/><p><span>Gloomy thoughts filled his head. </span><span>This wasn’t good.</span></p><br/><p><span>Ian tried to clear his mind.</span></p><br/><p><span>\"What are you doing? You look miserable.” </span><span>A voice broke through Ian’s thoughts. He looked back and saw Yiyu. </span><span>She was smiling at him from under her colorful umbrella.</span></p><br/><p><span>“Hello...”</span></p><br/><p><span>Yiyu was with Yoon Bora. </span><span>Yoon Bora bowed awkwardly as Ian greeted her lightly.</span></p><br/><p><span>“Was Oppa waiting long?”</span></p><br/><p><span>“Yes. I waited a long time.”</span></p><br/><p><span>“Well, that might be the case. Bora was the one who made me late. Isn’t that right?”</span></p><br/><p><span>\"No, you...”</span></p><br/><p><span>\"Right.\"</span></p><br/><p><span>“Hey! Oppa, Yiyu is falsely blaming me.”</span></p><br/><p><span>“Be quiet.”</span></p><br/><p><span>Ian smiled as he glanced at the two of them and asked, </span><span>“Okay, what do you want to eat?”</span></p><br/><p><span>\"I was thinking about it. I got over 900 points, so shouldn’t it be 90,000 won per person?”</span></p><br/><p><span>“......”</span></p><br/><p><span>\"Didn’t you say don’t worry about the price?”</span></p><br/><p><span>Yoon Bora poked Yiyu’s side, who shrugged.</span></p><br/><p><span>Today was the day when Yiyu received her TOEIC score. </span><span>On the day of the exam, Yiyu had suggested this if she got the score that she was aiming for, and Ian had accepted without thinking. </span><span>Her target score was quite high so he internally thought it would be difficult. </span><span>But she was quite good at languages and eventually got the score she was aiming for. Yoon Bora, who took the test with her, decided to accompany her.</span></p><br/><p><span>Ian smiled and said, \"Yes, then let’s go somewhere expensive. At least 90,000 won.”</span></p><br/><p><span>“Uh...um...”</span></p><br/><p><span>She didn’t know a place that was so expensive. </span><span>How could a student living off pocket money suddenly think about expensive food? </span><span>At best, only the tuna that Han Yeori liked came to mind. </span><span>However, Yiyu didn’t like eating raw fish when it was raining.</span></p><br/><p><span>“So...” </span><span>Yiyu looked at Yoon Bora, as if urging her to say something. </span><span>But Yoon Bora shook her head. She didn’t know anything about expensive food.</span></p><br/><p><span>Yiyu struggled for a moment before opening her mouth, “B-Beef?”</span></p><br/><p><span>“......”</span></p><br/><p><span>Ian looked at her with raised eyebrows.</span></p><br/><p><span>“W-What?”</span></p><br/><p><span>“Just follow me. Bora-ssi, do you have anywhere you want to go?”</span></p><br/><p><span>“No. Everything is good. Oh, if you just...”</span></p><br/><p><span>\"Is that so?”</span></p><br/><p><span>\"Ah, where are we going?!” Yiyu cried out impatiently.</span></p><br/><p><span>\"You just have to follow me.\" </span><span>Ian led them as he headed to the restaurant that he ate at with Ji Hayeon. </span><span>He hadn’t driven his car so they took a taxi. </span><span>The employees remembered him from when he came with Ji Hayeon and treated him deferentially.</span></p><br/><p><span>Ian refused to be served directly by the manager. </span><span>An employee escorted him to a private room. Ian naturally ordered the course dishes. </span><span>Various dishes came out as Yiyu nagged at him. Ian and Yiyu tasted the food, talked and laughed at jokes.</span></p><br/><p><span>Then a voice popped into Ian’s head.</span></p><br/><p><span>‘Viva Alaste!’</span></p><br/><p><span>The lively laughter of Alaste was overlaid over Yiyu and Yoon Bora’s voices. </span><span>He recalled the shrimp dish that had been served to him by Alaste’s best chef. </span><span>The sweet and sour taste of the shrimp made him constantly eat it, leaving him with a bucket of shrimp shells.</span></p><br/><p><span>“Oppa?”</span></p><br/><p><span>“Huh?”</span></p><br/><p><span>“Are you okay? You don’t look good.”</span></p><br/><p><span>“I’m just a little tired.\"</span></p><br/><p><span>He smiled. </span><span>Yiyu turned from Ian towards Yoon Bora. During their conversation, Ian frowned.</span></p><br/><p><span>It was rare for him. </span><span>He rarely looked back on the past. It was because the weight of the things he had done was so heavy it was difficult for him to raise his head. Therefore, he decided to look ahead instead of dwelling on it.</span></p><br/><p><span>However, today his thoughts turned towards the past.</span></p><br/><p><span>Why?</span></p><br/><p><span>Vigo’s face as he laughed and bragged about Alaste entered Ian’s mind. </span><span>When he closed his eyes to shake it off, he could see the barbecue ribs cooked at the festival. </span><span>The people shared the barbecue with him and praised him as a hero.</span></p><br/><p><span>Now they were no longer there. </span><span>Everyone he knew in Alaste had died.</span></p><br/><p><span>That fact weighed on him. </span><span>He knew that it wasn’t a game, but living beings from a real world. Ian suppressed his emotions. </span><span>Death was one-sided and couldn’t be reversed.</span></p><br/><p><span>Ian closed his eyes, feeling both grief and regret. </span><span>He had been too naive. </span><span>If he had stayed a little longer in Alaste, he could’ve stopped them. He shouldn’t have thought about anything else until he pulled out the seed of the Heaven and Earth Clan.</span></p><br/><p><span>Regret led to a more distant past. </span><span>A memory from a previous battlefield came to mind. </span><span>The faces of those he couldn’t see anymore.</span></p><br/><p><span>“Oppa?”</span></p><br/><p><span>“Wait.” </span><span>Ian stood up. His face was pale. </span><span>\"I need to quickly go to the bathroom.”</span></p><br/><p><span>“Uhh...”</span></p><br/><p><span>Ian opened the door and left. </span><span>The manager was surprised at Ian’s complexion. </span><span>Ian just smiled and left the restaurant.</span></p><br/><p><span>It was still raining. </span><span>Ian leaned his head against the wall of the building. </span><span>The landscape of the world melted into the rain.</span></p><br/><p><span>“Why...?”</span></p><br/><p><span>Even if he closed his eyes, he couldn’t erase their faces in the darkness. </span><span>Ian stared at the street through blurry eyes. </span><span>He remembered his deceased comrades. </span><span>He felt enough sadness at their funerals, so there was no reason to be shaken now.</span></p><br/><p><span>Nevertheless, their faces were so scary because they eventually led him to one face in the darkness. </span><span>He had to see her. </span><span>Ian bit his lips and opened his eyes.</span></p><br/><p><span>“Crazy...”</span></p><br/><p><span>Yes, Elder Lord was a real world. The knowledge of that fact might break him. He was tired of seeing people die. </span><span>No one knew that he was fighting for them as they kept swinging their weapons without a sense of guilt. It was a meaningless resistance. Just.</span></p><br/><p><span>‘Raven, I was wrong.’</span></p><br/><p><span>Ian’s eyelids drooped.</span></p><br/><p><span>‘Go.’</span></p><br/><p><span>It was her last gesture to him.</span></p><br/><p><span>What type of expression was he making at that time? He wondered if he was looking at her with a resolute face, determined to never abandon her. </span><span>He didn’t think so. </span><span>Maybe there was some hypocrisy mixed in with regret and sorrow, or a condescending expression as he retreated.</span></p><br/><p><span>He didn’t know. </span><span>Shortly after she gestured, a shell flew into her body and Ian was staring stiffly at flesh and guts. </span><span>Her laughing face as she held an assault rifle could no longer be seen. </span><span>Her death was no different from the other deaths.</span></p><br/><p><span>Ian instinctively reached into his pocket, an old habit. </span><span>He had no cigarettes. He removed his hand from his pocket and raised it to his face. </span><span>He desperately tried to block the memories, but they kept clinging to him.</span></p><br/><p><span>Maybe, if he had moved a little faster. </span><span>If only he performed the operation properly.</span></p><br/><p><span>Perhaps he did. He built meaningless assumptions and talked nonsense. </span><span>The memories of that day repeated against his will. </span></p><br/><p><span>Go, go, go. Explosion, explosion, explosion. His expression, expression, expression.</span></p><br/><p><span>Ian slammed his fist against the wall.</span></p><br/><p><span>Alaste, Alaste, Alaste.</span></p><br/><p><span>Pain spread. </span><span>He took a deep breath. </span><span>Ian grabbed one of his injured hands before heading back to the restaurant and handing over his card.</span></p><br/><p><span>\"Something happened...please tell my companions that I am leaving first.”</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Han Yeori switched off the last light.</span></p><br/><p><span>The sound of a broadcast was heard from her phone that she had unknowingly left on.</span></p><br/><p><span>-</span><i><span>The Heaven and Earth Clan had issued a statement about the broken agreement.</span></i><i><span>They defended themselves by saying it couldn’t be helped because they were ordered by the emperor.</span></i><i><span>They are playing as the emperor’s vassals and it is a game, so the users of the Alaste Love club should understand since they are also roleplaying...</span></i></p><br/><p><span>She suddenly turned her head. </span><span>She felt a haunting feeling. The cafe was clearly empty. She tilted her head. </span><span>Then she was shocked to see something moving in the darkness.</span></p><br/><p><span>“Hah.” </span><span>She froze before frowning, as she realized that the silhouette belonged to a familiar person.</span></p><br/><p><span>Then she looked again. </span><span>He must have a reason for doing this.</span></p><br/><p><span>“Boss-nim.”</span></p><br/><p><span>Ian didn't answer. Han Yeori pouted.</span></p><br/><p><span>He had the ability to move without any sound. </span><span>It was a strange talent from his old days as a soldier.</span></p><br/><p><span>“Boss-nim?”</span></p><br/><p><span>He raised his head. </span><span>It was dark but the lights from the street outside leaked in, revealing his bloodshot eyes.</span></p><br/><p><span>“Are you okay?”</span></p><br/><p><span>Ian looked at her and blinked before smiling. </span><span>\"Have you finished?”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>\"Can I have just one cup of coffee?”</span></p><br/><p><span>Han Yeori didn’t complain. She looked at Ian's face and nodded.</span></p><br/><p><span>\"Yes.”</span></p><br/><p><span>She walked into the preparation room and turned on the light. </span><span>She hesitated in front of the espresso machine before making a drink and setting it down in front of Ian.</span></p><br/><p><span>Ian looked down at it quietly. </span><span>“Is this coffee?”</span></p><br/><p><span>“Just drink it.”</span></p><br/><p><span>Mint chocolate frappe. </span><span>Ian quietly put the straw in his mouth. </span></p><br/><p><span>Han Yeori asked, “Are you okay?”</span></p><br/><p><span>Ian laughed. </span><span>She noticed that his laugh sounded a little unusual.</span></p><br/><p><span>“Yes, I’m fine.”</span></p><br/><p><span>He drank the mint chocolate frappe for a while as the chill faded. Han Yeori sat next to Ian.</span></p><br/><p><span>\"Why are you acting like a man who had his heart broken?”</span></p><br/><p><span>“How did you know?”</span></p><br/><p><span>\"I have to leave work, so regain your spirit.”</span></p><br/><p><span>She tapped Ian’s head. </span><span>Ian chuckled in a low voice. His voice rang through the empty café. </span><span>Suddenly, Ian leaned against her.</span></p><br/><p><span>Han Yeori complained, \"Heavy.\"</span></p><br/><p><span>“Just for a moment.”</span></p><br/><p><span>Ian said with a sigh, \"Let me do this for a moment...”</span></p><br/><p><span>As he closed his eyes, Han Yeori looked at his face leaning against her shoulder, at the still remaining mint chocolate frappe and then up at the ceiling. </span><span>Ian’s breath tickled her ears. </span><span>The second hand of the clock touched her nerves.</span></p><br/><p><span>“......”</span></p><br/><p><span>Time passed. </span><span>Han Yeori whispered towards the silent Ian, “You don't have to worry.” </span><span>As Ian’s breathing evened out, she added, \"I won’t report you for sexual harassment...”</span></p><br/><p><span>She reached out a hand towards Ian’s bangs. There was still sweat on his forehead. </span><span>She wiped it with her fingers and then smiled as she wiped it on Ian’s clothes.</span></p><br/><p><span>\"Why is my boss like this...?”</span></p><br/><p><span>Ian’s heartbeat was transmitted from where he was leaning against her. </span><span>Han Yeori felt his pulse and then got up. </span><span>She carefully laid the sleeping Ian on the body and placed a cushion under his head.</span></p><br/><p><span>Ian was now asleep.  </span><span>Han Yeori looked at his sleeping self before taking a coat from the counter and covering his body. </span><span>It was summer. </span><span>He shouldn’t get a cold.</span></p><br/><p><span>It was still raining outside the store. Cars passed through water. The procession of umbrellas could be seen.</span></p><br/><p><span>“Um...”</span></p><br/><p><span>Han Yeori slung her bag over her shoulder and looked at Ian one last time.</span></p><br/><p><span>\"People with quick senses...”</span></p><br/><p><span>Rain poured down as soon as she opened the door and opened her umbrella. The rain striking the umbrella was heavy. </span><span>Han Yeori stood at the doorway of Café Reason. </span><span>As her ears became familiar with the sound of the rain, she began to move.</span></p><br/><p><span>Rain was coming. </span><span>So it was like this. </span><span>She steadily moved away from the café as her silhouette gradually melted into the rain.</span></p><br/><p>This month's Q&amp;A had been delayed and will now take place in ~11 hours on the Wuxiaworld discord.</p><br/><p>In addition, vote here at Volare's special event for the chance to get two extra chapters of PTO released.</p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}