{"title": "Chapter 165 - Five Senses Landscape (1)", "id": 165, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-165-five-senses-landscape-1", "volume_title": "Volume 2", "body": "<h1>Chapter 165 - Five Senses Landscape (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 165 - Five Senses Landscape (1)</span></p><br/><p><span>Inside the city, there were still those who were resisting.</span></p><br/><p><span>\"As long as we buy some time, reinforcements will come,” said Gerd, the militia leader.</span></p><br/><p><span>However, he wasn’t convinced as he spoke. </span><span>The enemies hadn’t used their knights yet. The horsemen were circling the city to prevent any fugitives, with only those cursed by the stars entering the city. </span><span>They were having fun as they slaughtered the residents of the city.</span></p><br/><p><span>“Can’t we build up a lot of experience here?”</span></p><br/><p><span>\"Yes, that is why we came here.”</span></p><br/><p><span>\"I keep on receiving rewards for the achievements. Wow, this is rare grade.”</span></p><br/><p><span>\"I barely get any rare grade rewards. Why can’t I receive the Flying Heaven Sword Style?”</span></p><br/><p><span>They chattered and laughed together.</span></p><br/><p><span>Gerd bit his lip. The ones cursed by the stars were hateful. </span><span>They were all around him.</span></p><br/><p><span>“Endure. We can endure.”</span></p><br/><p><span>Of course, nobody believed those words. </span><span>They were waiting for reinforcements but who would come? </span><span>The empire had a great army. It was a war to win if they just hid behind walls. Entering the city to save them was nothing more than a waste of troops.</span></p><br/><p><span>He repeated to himself, </span><span>“Endure...”</span></p><br/><p><span>But there was a disturbance in the distance. Gerd became tense. The knights might’ve entered.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>At that moment, he could see something flying over the building in front of him. </span><span>It was the appearance of an enemy who had his body split apart. </span><span>As soon as the red lump fell, it became white particles.</span></p><br/><p><span>“W-What?”</span></p><br/><p><span>It continued. </span><span>Behind the outer walls of the building, a fountain of blood appeared in the air. </span><span>There was the sound of screams and bones breaking as the bodies continued to burst. The blood, flesh and internal organs were stuck to the ground.</span></p><br/><p><span>What the hell was going on at the smithy?</span></p><br/><p><span>“Kyaaak!”</span></p><br/><p><span>“Stop!”</span></p><br/><p><span>“Monster!”</span></p><br/><p><span>Once again, dozens of people flew through the air at the same time and fell down in the dust. </span><span>Gerd and his companions flinched as they held their weapons. </span><span>The fallen people twitched and died. Their bodies turned white.</span></p><br/><p><span>“Who...?”</span></p><br/><p><i><span>Step, step.</span></i></p><br/><p><span>Footsteps could be heard. Gerd gulped and looked at the corner of the building. There was the shadow of a man of great size. </span><span>The slaughterer’s image was revealed. </span><span>The first thing that stood out was the gigantic greatsword that reflected the sunlight. It was so big that he couldn’t face it properly.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>An orc. </span><span>He was burly and the battle scars were mixed together with the tattoos. </span><span>Blood and flesh dripped down from his body.</span></p><br/><p><span>The vicious eyes turned to Gerd. </span><span>Gerd shook.</span></p><br/><p><span>He knew who the orc was. </span><span>The orc warrior widely known throughout the continent. The one who killed the crazy chieftain in the north. All gods had whispered his name. </span><span>Northern Conqueror Crockta. </span><span>He heard rumors that Crockta was going against the empire. But,</span></p><br/><p><span>“God...”</span></p><br/><p><span>Showing up on this battlefield was reckless. </span><span>Gerd never imagined his appearance. He knew the orc species, but he always thought of heroes as people with shining smiles and a dignified appearance. They were knights who wore armor.</span></p><br/><p><span>But he was mistaken. </span><span>The orc called Crockta wasn’t a knight. </span><span>He was a monster. </span><span>Knights were those who wore shining armor and rode on a white horse in fairy tales.</span></p><br/><p><span>Crockta was a warrior who slaughtered his enemies with his greatsword, scattering the flesh and blood of those who got in his way. If he wasn’t killed on the battlefield, he would wipe out all enemies. </span><span>The eyes were filled with killing intent, making Gerd unable to face them at all.</span></p><br/><p><span>But,</span></p><br/><p><span>“Bul’tarrr──────!”</span></p><br/><p><span>At Crockta’s roar, the enemies didn’t dare come closer and fell back.</span></p><br/><p><span>Gerd formed a fist. </span><span>Despite the horrible appearance, hope sprouted in his heart.</span></p><br/><p><span>He had prayed for a long time. </span><span>He prayed every day that he could continue to live as a free man, for the march of the imperial forces to slow down and to help them win this battle. He prayed for all the beautiful things in this world.</span></p><br/><p><span>However, no one answered. </span><span>It wasn’t the benevolent goddess or a knight on a white horse who responded. </span><span>It was a brutal orc warrior covered in the enemy’s blood. A killer who beheaded the enemies directly.</span></p><br/><p><span>Crockta, he came for them.</span></p><br/><p><span>Gerd shouted, </span><span>“Crockta has come! Gather your strength!”</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>The front lines became messy at Crockta’s appearance. </span><span>The enemies rarely came close to Crockta, giving the residents and militia time to reorganize the line of defense.</span></p><br/><p><span>“Crockta!”</span></p><br/><p><span>The ‘He’s an Orc, yet still Praiseworthy’ members were also present. </span><span>They were very tired. In particular, Gilgamesh was barely holding onto his sword and couldn’t exert any further strength.</span></p><br/><p><span>\"Meet over there.”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>\"There are still people remaining.”</span></p><br/><p><span>Crockta approached Gerd’s group. </span><span>They were busy raising the defenses. They held spears carved out of wood and cautiously watched for enemies from behind the barricade.</span></p><br/><p><span>“I am Crockta. I came to help.”</span></p><br/><p><span>Gerd responded to Crockta.</span></p><br/><p><span>“Thank you. I’ve heard a lot of rumors about you.”</span></p><br/><p><span>\"More troops will be coming soon.”</span></p><br/><p><span>Rommel was committed to the growth of the clan members. But that changed after Crockta’s appearance. Soon the knights and regular soldiers would appear. </span><span>Considering the gap between numbers and level, it was close to a hopeless battle.</span></p><br/><p><span>\"Wait for the reinforcements.”</span></p><br/><p><span>\"Reinforcements...” </span><span>Gerd was skeptical about the reinforcements. He shouted about reinforcements to raise morale, but he didn’t think they would come.</span></p><br/><p><span>“Believe in them.” </span><span>Crockta stated. It was an intense gaze. </span><span>\"They will come.\"</span></p><br/><p><span>It was hope that made people hold on, even if it was feeble. As long as there was hope, the possibilities could be doubled. </span><span>A miracle could happen as long as it wasn’t 0%.</span></p><br/><p><span>\"I understand.” </span><span>Gerd nodded.</span></p><br/><p><span>Crockta scanned the area.</span></p><br/><p><span>\"It is tense.”</span></p><br/><p><span>They had just joined but there was no time for proper introductions. </span><span>It was the last defense line and the children and elderly were behind it. All of them were now visible.</span></p><br/><p><span>Crockta raised his greatsword. </span><span>It was obviously the worst situation. </span><span>He wanted to protect them, but it was a dangerous situation. However, if there was nothing to protect, there was no reason to fight.</span></p><br/><p><span>It was an irony he always experienced.</span></p><br/><p><span>Crockta opened his mouth. </span><span>\"I have been through many battles...”</span></p><br/><p><span>The formation of the enemies was changing. They had now completely retreated. It meant that reinforcements for the enemies were coming soon. </span><span>The sound of horseshoes neared.</span></p><br/><p><span>\"There have been many more dangerous fights. This is nothing. Kulkulkul.”</span></p><br/><p><span>It was his own method of cheering them on. </span><span>Gerd and the militia members laughed slightly at Crockta’s words.</span></p><br/><p><span>\"So let's try our best.”</span></p><br/><p><span>\"I understand.”</span></p><br/><p><span>New enemies appeared. </span><span>Both the White Lion Knights and Blue Dragon Lancers appeared. The regular army followed behind them. </span><span>The Heaven and Earth Clan were still here, surrounding the area in several layers, in order to block any retreat.</span></p><br/><p><span>The number and quality of the other side were no match.</span></p><br/><p><span>Crockta cracked his knuckles. </span><span>As he mentioned, he had experienced more dangerous battlefields. But it was the first time he had to defend people against so many enemies. </span><span>At the very least, he fought with his friends who had the ability to resist the enemy.</span></p><br/><p><span>Even in the north, he had the dark elves who were good hunters and swordsmen. </span><span>This place was different. </span><span>They were at a disadvantage in terms of equipment and skills. </span><span>Maybe everyone would die.</span></p><br/><p><span>“Stay alive.” </span><span>He muttered.</span></p><br/><p><span>Gilgamesh spoke from behind him, </span><span>\"Is there a ‘stage’ that finally suits me...? The curtain call will be the screams of the enemies. Kukuk...!”</span></p><br/><p><span>His voice was dying but his personality was still constant. </span><span>Crockta grinned. </span><span>The enemies came to a stop.</span></p><br/><p><span>“Knights, be prepared!”</span></p><br/><p><span>The leader of the White Lion Knights in the rear cried out. It was the vice leader Betring, who had taken over for Adandator. </span><span>It was an expression of intent to engage in close combat. </span><span>They started walking on both feet.</span></p><br/><p><span>The militia members readied their arrows. However, none of them hit. They were avoided or blocked using swords and shields. It was truly the empire’s elite.</span></p><br/><p><span>“For His Majesty!” Betring shouted in an excited voice that didn’t fit his age.</span></p><br/><p><span>\"Assault, White Lions!”</span></p><br/><p><span>The knights started the assault. </span><span>Crockta broke through the knights running at the forefront and shouted, \"Come at me, knight!”</span></p><br/><p><span>Crockta’s momentum pushed against the knights.</span></p><br/><p><span>“You’re better than expected, Orc!” </span><span>It was Betring who didn’t back down from Crockta’s threat. </span><span>He met Crockta’s greatsword as the two swords hit each other.</span></p><br/><p><span>“Now! Charge!”</span></p><br/><p><span>As Betring shouted, the knights plunged towards Crockta’s left and right. </span><span>Crockta tried to stop them, but Betring’s sword persistently pursued him. Crockta struck him in annoyance. </span><span>Betring continued to mark Crockta. </span><span>He wasn’t trying to kill Crockta, and didn’t even intend for this to be a confrontation. He just stuck to Crockta so that Crockta couldn’t go anywhere else.</span></p><br/><p><span>Crockta grit his teeth.</span></p><br/><p><span>An expert. This was annoying.</span></p><br/><p><span>“Aaack!”</span></p><br/><p><span>The knights didn’t hesitate. The residents died as the knights’ swords pierced their hearts.</span></p><br/><p><span>“It is shameful.”</span></p><br/><p><span>“Ho?” Betring asked nervously as he attacked Crockta.</span></p><br/><p><span>\"A knight should be ashamed of this behavior.”</span></p><br/><p><span>The ruined city. </span><span>The dead or dying residents. </span><span>The flag of the empire flying in the air.</span></p><br/><p><span>“Shame...” </span><span>Betring smiled bitterly. </span><span>\"Old people like me don’t worry about things like that.”</span></p><br/><p><span>It was a familiar expression that he had seen in the north on Hammerchwi, a brave man who had been bent from many years of inertia while adrift in a world mixed with right and wrong.</span></p><br/><p><span>\"I understand,” said Crockta before his figure disappeared. </span><span>Then Crockta appeared right in front of Betring’s nose with Ogre Slayer at his neck.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>An enormous pressure was aiming for his neck. He couldn’t avoid or block it. Betring's head became blank.</span></p><br/><p><i><span>Kakang!</span></i></p><br/><p><span>Just before Ogre Slayer reached Betring, the sword was blocked. </span><span>It was from the spear of a Blue Dragon member.</span></p><br/><p><span>“Don’t overdo it.”</span></p><br/><p><span>\"Thank you for your help. Bluno.”</span></p><br/><p><span>The two leaders of the empire’s knights stood in front of Crockta. </span><span>They gulped. Even if they joined together, they couldn’t beat Crockta. </span><span>They could only buy some time. </span><span>The orc in front of him was a monster.</span></p><br/><p><span>\"Come all at once!”</span></p><br/><p><span>At the same time, Crockta’s greatsword aimed at both of them. </span><span>Betring bounced back and rolled across the ground. Bluno avoided it then swung his spear. </span><span>Crockta ducked and kicked Bluno’s abdomen. Bluno collapsed.</span></p><br/><p><span>The greatsword descended towards Betring. </span><span>He blocked with his sword. The blade couldn’t overcome the impact and was broken. Betring’s face stiffened. </span><span>Crockta raised his greatsword again. Betring rolled across the ground. It was ugly behavior for a knight, but it allowed him to barely survive.</span></p><br/><p><span>“Aaaaaaah!”</span></p><br/><p><span>Bluno attacked. It was a rapid stinging attack that made him one of the best knights. </span><span>Crockta grabbed the spear.</span></p><br/><p><span>“Crazy!”</span></p><br/><p><span>Crockta started to break the spear. Bluno stumbled at the power placed on his spear. </span><span>He gritted his teeth and tried to aim the spear again.</span></p><br/><p><span>Crockta struck his shin with a fist.</span></p><br/><p><span>“Cough!” </span><span>Bluno flew back and crashed onto the ground. His shin was broken. He grabbed his leg and moaned. </span><span>Betring looked at it and muttered. </span><span>“Truly a monster...”</span></p><br/><p><span>His face was completely frightened.</span></p><br/><p><span>Crockta looked around. </span><span>The knights were already slaughtering the residents. </span><span>Crockta headed towards the knights, ignoring Betring and Bluno. However, it wasn’t enough for him to block them alone.</span></p><br/><p><span>Countless people were dying. </span><span>The Heaven and Earth members were pushing to the front like hyenas.</span></p><br/><p><span>“Come again!”</span></p><br/><p><span>“Get those bastards!”</span></p><br/><p><span>“Cheeky bastards!”</span></p><br/><p><span>Their goal was the ‘He’s an Orc, yet still Praiseworthy’ members.</span></p><br/><p><span>\"The garbage who follow the orc!”</span></p><br/><p><span>\"Kukuk...weak dogs are barking?”</span></p><br/><p><span>\"What is he saying?”</span></p><br/><p><span>In the middle of it, Crockta shook his head. </span><span>The knights and residents, users and users, everything was mixed up and confusing. The debris of the destroyed buildings was scattered about.</span></p><br/><p><span>‘Now you see that the world is full of death.’</span></p><br/><p><span>The system message seemed to be mocking him. </span><span>Crockta jumped over a knight. Betring was chasing him from behind. Crockta wanted to go after the knights killing the residents. Betring’s blade cut his thigh.</span></p><br/><p><span>Crockta looked angrily at Betring, but he had already withdrawn. Meanwhile, residents were dying. Crockta gritted his teeth. The moment Betring retreated, weapons flew at Crockta from all sides.</span></p><br/><p><span>Crockta roared and swung his greatsword. The knights flew back.</span></p><br/><p><i><span>Puok!</span></i></p><br/><p><span>“Ugh!”</span></p><br/><p><span>An arrow struck Crockta’s shoulder. </span><span>It was difficult to respond because there were so many people. </span><span>Crockta used the power of a Hero. It consumed a lot of stamina but it couldn’t be helped. </span><span>Crockta slaughtered the enemies with the power of causality. A fountain of blood.</span></p><br/><p><span>Nevertheless, the number of teammates was decreasing.</span></p><br/><p><span>“Gerd!”</span></p><br/><p><span>There was no answer. </span><span>He had died a long time ago.</span></p><br/><p><span>\"Shit!”</span></p><br/><p><span>The corpses were accumulating. </span><span>He couldn’t save everyone. The consequences of death were overflowing in the city, and there was a limit to how much he could reverse.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Suddenly, white particles were scattered. </span><span>He looked back. The ‘He’s an Orc, yet still Praiseworthy’ members were dying. </span><span>Alex’s eyes met his as he turned into white particles. He nodded with a pale face. That was the last action.</span></p><br/><p><span>Their particles and those of the Heaven and Earth members, along with the dust, blurred his vision.</span></p><br/><p><span>\"Hell, this is a place that suits me! Come you, you dog-like bastards.\"</span></p><br/><p><span>Gilgamesh was the only one remaining and he had lost his concept. </span><span>He could no longer manipulate the blades and wielded them directly. However, his weapons were quickly suppressed. </span><span>Crockta tried to rescue him, but the knights kept blocking him. Several layers of infantry surrounded him.</span></p><br/><p><span>\"Dammit.\" </span><span>Crockta raised his greatsword. </span><span>He was about to use strength to break through the encirclement.</span></p><br/><p><span>\"I’ve caught this bastard! Concrete method!”</span></p><br/><p><span>\"Tie him up! Rope!”</span></p><br/><p><span>\"Kukuk...oof...kuk...!”</span></p><br/><p><span>Crockta ran in Gilgamesh’s direction. </span><span>A blade stuck in his back. Blood splattered but he ignored it and attacked those in front of him. He stepped on the enemies. </span><span>Gilgamesh could be seen in the distance.</span></p><br/><p><span>\"Gilgamesh!\"</span></p><br/><p><span>Crockta broke through the enemies to try and save him, but he was blocked again. There was no end. He was surrounded by the enemy. </span><span>There was even the bombardment from magicians. Fireballs flew at Crockta.</span></p><br/><p><span>“Bul’tarrr──────!”</span></p><br/><p><span>Crockta ignored it all and threw his greatsword.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Ogre Slayer split apart Gilgamesh’s body. </span><span>Gilgamesh was split in half. </span><span>With only his upper body left, he stared at Crockta. There was surprise in Gilgamesh’s eyes before he laughed. Crockta chuckled slightly.</span></p><br/><p><span>Soon, Crockta’s body was hit by a fireball.</span></p><br/><p><span>“Cough!”</span></p><br/><p><span>Crockta rolled on the ground. The flames burned his body. Crockta gritted his teeth. Blades flew in succession. </span><span>Crockta raised his body and knocked them down with his fists. </span><span>The enemies were ripped to pieces.</span></p><br/><p><span>Crockta straightened his waist and looked around.</span></p><br/><p><span>\"Kulkulkul...”</span></p><br/><p><span>He laughed. </span><span>Now Crockta was alone. </span><span>The militia, the elderly people and the ‘He’s an Orc, yet still Praiseworthy’ members...</span></p><br/><p><span>They all died. </span><span>He was left alone.</span></p><br/><p><span>He knew.</span></p><br/><p><span>“Kill!”</span></p><br/><p><span>\"He is alone!”</span></p><br/><p><span>“Everyone charge!\"</span></p><br/><p><span>From the beginning, he had a feeling it would be like this. </span><span>Nevertheless, he had no choice but to struggle.</span></p><br/><p><i><span>Kaack!</span></i><i><span>Kaack!</span></i><i><span>Kaaack!</span></i></p><br/><p><span>He looked up at the sky.</span></p><br/><p><span>Crows were crying out above his head. </span><span>Auspicious or a disaster. </span><span>It was said that crows were birds who lead the souls of the dead to the afterlife. </span><span>How did the landscape look like in their eyes? He wondered if the souls of the dead were filling this land in white.</span></p><br/><p>My Q&amp;A ended up being delayed to today at the normal time. If you are unsure when that is, check this link.</p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}