{"title": "Chapter 167 - Five Senses Landscape (3)", "id": 167, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-167-five-senses-landscape-3", "volume_title": "Volume 2", "body": "<h1>Chapter 167 - Five Senses Landscape (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 167 - Five Senses Landscape (3)</span></p><br/><p><span>The commentators picked their words carefully. </span><span>They realized it.</span></p><br/><p><span>-</span><i><span>Hahaha, Crockta is working hard… He is resisting.</span></i></p><br/><p><span>-</span><i><span>There are also people in his fan club.</span></i></p><br/><p><span>Words were useless in the face of reality. </span><span>This was a program which placed the Heaven and Earth Clan as the heroes. However, the identity of the hero and the villains were becoming clearer to the public.</span></p><br/><p><span>It wasn’t bad when the Heaven and Earth Clan entered the city and massacred the people. In fact, it was an exciting victory. </span><span>The strong resistance fell under Rommel’s splendid commanding. </span><span>Following Rommel’s gestures, the conductors acted, and drums sounded through the battlefield. The troops then changed shape, as if they were one single unit.</span></p><br/><p><span>This was the greatness of the Heaven and Earth Clan’s War Maestro.</span></p><br/><p><span>When Crockta appeared, the public’s reaction was at the peak. </span><span>It was a fight between a named NPC and users. The related media reported the news, and the ratings topped the record high for Undergames.</span></p><br/><p><span>Crockta appeared with four allies. </span><span>They were users whom nobody knew.</span></p><br/><p><span>In the end, they fought the Heaven and Earth Clan. </span><span>They persisted in their resistance. Crockta and his four allies broke through the Heaven and Earth Clan and the imperial army, entering the city. Then they joined the rebels and continued fighting fiercely.</span></p><br/><p><span>Anyone could see that it was an impossible battlefield. </span><span>There was an overwhelming difference in numbers. </span><span>However, Crockta was a warrior who didn’t know how to give up. Every time he roared and swung his greatsword, the expressions of the viewers changed.</span></p><br/><p><span>-</span><i><span>Crockta, how terrible.</span></i></p><br/><p><span>-</span><i><span>Those who are with him are the ‘He’s an Orc, yet still Praiseworthy’... Fan club members are rebels?</span></i></p><br/><p><span>-</span><i><span>They are all enthusiastic users.</span></i><i><span>The members of the Heaven and Earth Clan, and the He’s an Orc, yet still Praiseworthy fan club, they are playing in the game in their own ways...</span></i></p><br/><p><span>-</span><i><span>Crockta is fighting well.</span></i></p><br/><p><span>The Heaven and Earth Clan members retreated, and the knights rushed forward. There was an overwhelming difference in numbers, and Crockta’s giant mass was quickly covered in a wave of knights.</span></p><br/><p><span>Crockta was at the front, but the army passed him and headed for the rebels. </span><span>As Crockta struggled to save them, he kept being obstructed. Still, he wielded his greatsword. </span><span>He fought against those killing the weak.</span></p><br/><p><span>Seeing those who killed and those who saved...</span></p><br/><p><span>The hearts of the viewers became heavy at the scene. </span><span>Even the commentators fell silent. </span><span>For a while, there were only the sounds of the battlefield and Crockta’s roaring. </span><span>The camera angle was focused on Crockta. </span><span>The eyes of the world were also focused on Crockta.</span></p><br/><p><span>The stage of the Heaven and Earth Clan was now the indomitable struggle of the orc warrior.</span></p><br/><p><span>The orc and knights confronted each other.</span></p><br/><p><span>“It is shameful.”</span></p><br/><p><span>Crockta opened his mouth to say. </span><span>The camera angle sank down, and the screen was now looking at the confrontation between Crockta and a knight. </span><span>They looked like giants.</span></p><br/><p><span>The empire’s flag flew above their heads.The blazing sun which symbolized the empire. </span><span>The ruined city...</span></p><br/><p><span>Crockta’s voice was clear, despite the noise of the battlefield. </span><span>In the background, the blade of a soldier was piercing another resident. The last moments of the victim were caught on screen.</span></p><br/><p><span>Crockta spoke again, </span><span>“A knight should be ashamed of this behaviour.”</span></p><br/><p><span>The knight smiled bitterly, </span><span>“Shame… Old people like me don’t worry about things like that.”</span></p><br/><p><span>However, his face did seem to carry an expression of shame.</span></p><br/><p><span>At that moment, everyone watching realized it. </span><span>The reality of this fight...</span></p><br/><p><span>It wasn’t a story made up by the game channel, the Heaven and Earth Clan, and the commentators. </span><span>This was the scene of NPCs who actually lived in the world of Elder Lord. </span><span>Crockta explained why he entered the impossible battlefield.</span></p><br/><p><span>Then the struggle continued. </span><span>Crockta overwhelmed the two knight leaders. However, this wasn’t a fight to kill but to protect. Then he turned to save the resistance. </span><span>He desperately wielded his greatsword at those killing the residents. </span><span>The battle leaned to one side as Crockta got an arrow stuck in his shoulder. The ‘He’s an Orc, yet still Praiseworthy’ members became white particles.</span></p><br/><p><span>“Gerd!”</span></p><br/><p><span>Crockta shouted the name of the dead.</span></p><br/><p><span>“Shit!”</span></p><br/><p><span>He was besieged again. </span><span>The arrows, spears, swords, and fireballs were aimed at Crockta. He gritted his teeth and looked around. </span><span>It was a crisis. </span><span>Suddenly, someone was captured.</span></p><br/><p><span>“I’ve caught this bastard! Concrete method!”</span></p><br/><p><span>“Tie him up! Rope!”</span></p><br/><p><span>The Heaven and Earth members tried to use the Concrete method on a ‘He’s an Orc, yet still Praiseworthy’ member. </span><span>It was an act which would never be considered honourable when revealed to the world.</span></p><br/><p><span>The silent commentators quickly opened their mouths.</span></p><br/><p><span>-</span><i><span>Haha, that... The Heaven and Earth Clan are decisive… They are such a clan,</span></i><i><span>yes.</span></i></p><br/><p><span>-</span><i><span>It is like this during a war.</span></i><i><span>Maybe he will be released when the quest ends...</span></i></p><br/><p><span>Crockta reacted immediately. </span><span>He ran towards the fanclub member. A blade was stuck in his back, attacks flew from every direction, and fireballs were rushing towards him. </span><span>However, nothing stopped him.</span></p><br/><p><span>“Bul’tarrr──────!”</span></p><br/><p><span>Crockta ignored it all and threw his greatsword.</span></p><br/><p><span>-</span><i><span>No...!</span></i></p><br/><p><span>-</span><i><span>T-This!</span></i></p><br/><p><span>The remaining member was mutilated by the greatsword. </span><span>Crockta killed his companion before the Concrete method could be used. </span><span>The last member of ‘He’s an Orc, yet still Praiseworthy’ turned into white particles.</span></p><br/><p><span>-</span><i><span>Ah...</span></i></p><br/><p><span>Crockta was hit by the fireballs. </span><span>However, he got up and knocked down the enemies with his bare hands while gasping for air. </span><span>The imperial army and Crockta stared at each other. </span><span>The battlefield suddenly became quiet.</span></p><br/><p><span>Everyone watching the screen realized it. </span><span>All of the others had died. </span><span>Now, Crockta was alone.</span></p><br/><p><span>“Kulkulkul...”</span></p><br/><p><span>Crockta chuckled in a low voice.</span></p><br/><p><span>He raised his head. </span><span>He straightened his back. </span><span>He stared at the sky.</span></p><br/><p><span>In a world which was real to him, the warrior remained alone. </span><span>What type of sky was he seeing? In a state where time seemed to have stopped, the viewers also stared at the sky in the screen.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Crockta eventually returned alive. </span><span>Another group had appeared to save him, and the Heaven and Earth Clan stopped. </span><span>It was fortunate for everyone. </span><span>The viewers were relieved that Crockta’s adventure wasn’t over, while the broadcasters were delighted by the ratings.</span></p><br/><p><span>The Heaven and Earth Clan had a chance to reform their image. </span><span>In the meantime, a user raised suspicion in the Elder Lord community.</span></p><br/><p><span>[Author: Evening Games]</span></p><br/><p><span>[Title: (Must Read) Crockta might be a user.txt]</span></p><br/><p><span>[I am an Elder Lord pro who has been watching Crockta.</span></p><br/><p><span>I think that Crockta is a user. This is based on three reasons.</span></p><br/><p><span>Not long ago, something strange occurred during the battle where Crockta was in danger.</span></p><br/><p><span>Elder Lord’s time zone is different from reality, making it hard when broadcasting. In other words, the videos shown are on fast forward. Undergames cut out any unnecessary parts in order to make it in real-time as much as possible.</span></p><br/><p><span>The reason why Undergames’ broadcast is much faster than the private broadcast of BJ Heaven and Earth is due to editing.</span></p><br/><p><span>I don’t know about the people who only watched Undergames’ broadcast, but in the BJ Heaven and Earth’s video, a member of the clan reached out towards Crockta’s forehead in the middle of the danger zone.</span></p><br/><p><span>I asked the clan executives whom I personally know about what that member was doing.</span></p><br/><p><span>At the time, the clan member saw something white between the torn parts of the headband. He didn’t see it properly and failed to confirm it before dying.</span></p><br/><p><span>In retrospect, have we ever seen Crockta’s forehead? He first appeared in Laney’s video wearing a black bandana, and later on he wore the headband.</span></p><br/><p><span>NPCs can wear headbands, but it is a little suspicious.</span></p><br/><p><span>Additionally, everyone saw Crockta killing the ‘He’s an Orc, yet still Praiseworthy’ member before the Concrete method could be used. NPCs know about this method, but it is strange that he would throw his body to save the person.</span></p><br/><p><span>It is understandable if Crockta is a user. If people think Crockta is a NPC, he doesn’t have to worry about the Concrete method, and if he dies, he can survive. So, his actions are natural if he has multiple lives.</span></p><br/><p><span>Even when Crockta was fighting the Thawing Balhae Clan, he used the Concrete method against them. At that time, I thought of him as just a scary NPC, but it is natural behaviour if Crockta is a user.</span></p><br/><p><span>First, let’s assume that Crockta really is a user. </span><span>His level must be very high. His achievements score wouldn’t be a joke. He must be a ranker. </span><span>When looking at the rankings, Choi Hansung is No.1 in Elder Lord.</span></p><br/><p><span>The who is No.2?</span></p><br/><p><span>‘Mystery,’ a private ranker who doesn’t disclose any information. I think that Crockta is ‘Mystery.’ </span><span>It is common sense that being a ranker can turn you into a star, so why would the second ranked person remain private?</span></p><br/><p><span>Mystery is now level 142. It is much higher than Choi Hansung’s level. Nobody knows who the level 142 monster is, but this is explained if Crockta is Mystery. In other words...</span></p><br/><p></p><ol><br/><p></p><li><span> Crockta's forehead.</span></li><br/><p></p><li><span> Concrete method.</span></li><br/><p></p><li><span> The mystery of the identity of the second ranked user in Elder Lord.</span></li><br/><p></p></ol><br/><p><span>I think that Crockta is a user for these three reasons. </span><span>Of course, this evidence isn’t sufficient. In fact, Crockta’s actions don’t make sense if he is a user. I never would’ve believed it if his headband hadn’t been torn this time.</span></p><br/><p><span>He will soon go against the Heaven and Earth Clan, and I hope it is properly revealed then.]</span></p><br/><p><span>This post attracted people’s attention.</span></p><br/><p><span>The comments became a war between those who thought it made sense and those who didn’t.</span></p><br/><p><span>[Conspiracies Out: Now, there are even conspiracy theories for a game.</span></p><br/><p><span>└ Nod Nod Bang: There is no physical evidence, and everything is circumstantial.</span></p><br/><p><span>└ Post-it: The pieces moderately fit together ㅋㅋㅋㅋㅋㅋㅋ The lady selling bread in Maillard always wears a bandana, is she a user too? ㅋㅋㅋ A user hiding her forehead ㅋㅋㅋㅋㅋ</span></p><br/><p><span>└ China Road: I am curious about Mystery’s identity. Level 142... Doesn’t the description fit Crockta? ㅋㅋㅋ Although I don’t know why he would pretend to be a NPC... There are no other obvious users who could be Mystery.</span></p><br/><p><span>└ Food Fighter: Shut up. Whether Crockta is a user or not, he will be punished by the Heaven and Earth Clan.</span></p><br/><p><span>└ Lime Tree: Mystery can’t be an orc... I hate orcs. I wish that Rommel would take care of him.</span></p><br/><p><span>└ Orc User: Lime Tree// Shut your mouth.</span></p><br/><p><span>└ Lime Tree: Heaven and Earth Lover/// The orc lovers will be going for you next ㅅㄱ</span></p><br/><p><span>└ Orc Chanyanghae:  I want to have a drink with Crockta if he really is a user.</span></p><br/><p><span>└ Lukakuno9 : Crockta is a user. He is my Hyung-nim ㅋㅋㅋ</span></p><br/><p><span>└ Lime Tree:  Lukakuno9/// Tell your next lie.</span></p><br/><p><span>└ (View more)</span></p><br/><p><span>It became a flash fire that attracted people’s attention. </span></p><br/><p><span>Meanwhile, the Heaven and Earth Clan and the army prepared to march. </span><span>Their goal was Katalu in the center of Espada. Crockta would also be there. </span><span>Now, the Heaven and Earth Clan and the empire were moving towards their ultimate goal.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Crockta held the old helmet. </span><span>It was a black and solid steel helmet, with cuts and scratches all over due to its long history. </span><span>Lenox’s helmet...</span></p><br/><p><span>The faint specks on the surface would be the blood of the Lenox enemies killed. Maybe the blood from when Lenox died still remained on it somewhere. </span><span>Crockta couldn’t bear to wear it and placed it on his knee.</span></p><br/><p><span>Tashaquil’s note was concise.</span></p><br/><p><span>[You will need this, Great Warrior.]</span></p><br/><p><span>He had sent Lenox’s helmet to Crockta through Simba. On the way, Simba had met Kumarak, and Kumarak because interested in it due to Tashaquil. </span><span>However, Crockta didn’t know why Tashaquil said this would be necessary.</span></p><br/><p><span>Crockta closed his eyes.</span></p><br/><p><span>“Crockta! Eat </span><i><span>dot</span></i><span>! Come out!”</span></p><br/><p><span>“I’ll be there soon.” </span><span>Crockta replied.</span></p><br/><p><span>However, his body didn’t move from where he was sitting on the bed. He touched Lenox’s helmet and sighed. </span><span>He walked to the window and looked down at Katalu. </span><span>They were busy preparing for the future battle. Everyone was collecting and moving wood to build walls and barricades.</span></p><br/><p><span>Their expressions weren’t dark. There was hope. </span><span>They saw a chance after Crockta, Kumarak, Tiyo, and Anor joined them. They believed they might be able to win.</span></p><br/><p><span>However, Crockta felt despair as he looked at their hopeful faces. </span><span>He saw the tragedy before him. </span><span>They would die.</span></p><br/><p><span>...In the near future.</span></p><br/><p><span>“Dammit…”</span></p><br/><p><span>There was a strange phenomenon when he shook hands with Guardi, the leader of this place. </span><span>Since then, his vision had changed. </span><span>‘Grey God's Eyes’ continued to be activated. He couldn’t adjust it to his will, so he had to face the grim reality of their deaths.</span></p><br/><p><span>This...</span></p><br/><p><span>It was pointing to everyone’s death. </span><span>He heard the sound of laughter. It came from a child. The child laughing on the street would soon die. </span><span>The smiling mother following the child, she would also die. </span><span>The deaths of the soldiers arming themselves were scheduled as well.</span></p><br/><p><span>Everybody he saw would die in one day.</span></p><br/><p><span>Crockta wanted to turn his eyes away, but he couldn’t. He had to face the passing procession of those whose deaths were already determined.</span></p><br/><p><span>“Crockta! Why aren’t you coming </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>Tiyo called out to him from the bottom of the building. </span><span>By his side were Anor and Kumarak. Simba yawned.</span></p><br/><p><span>“Go first. I will come soon.” </span><span>Crockta replied.</span></p><br/><p><span>Crockta watched his companions walk away with burning eyes. </span><span>They were no exception.</span></p><br/><p><span>All of Katalu was going to die. </span><span>There were no exceptions. </span><span>Buildings, livestock, animals, soldiers, youths, children, seniors, women and men, they all had the same death number above their heads.</span></p><br/><p><span>He couldn’t face such a horrible sight. </span><span>Crockta closed his eyes. </span><span>He would rather see the darkness behind his eyelids.</span></p><br/><p><span>“Shit...”</span></p><br/><p><span>Everyone who resisted had died. The tragedy would repeat in this place. </span><span>The power of the imperial forces was overwhelming, and there was no mercy. This time, they would devote themselves to destroying Katalu.</span></p><br/><p><span>Crockta just wanted to turn away from it. </span><span>If he closed his eyes, he didn’t need to see any more deaths. </span><span>How could he watch the cold deaths of those he valued through the numbers on top of their heads? He would rather turn away.</span></p><br/><p><span>Then Crockta suddenly felt the rough texture of the helmet under his fingertips.</span></p><br/><p><span>“Lenox.”</span></p><br/><p><span>This was what it meant. </span><span>Lenox had taught him the laws of a warrior. </span><span>As Crockta was about to fall into despair, Lenox’s helmet returned him to reality.</span></p><br/><p><span>Tashaquil might have seen all of this.</span></p><br/><p><span>Crockta couldn’t sit down like this. Somehow, he had to stand up. </span><span>He wasn’t just an orc. </span><span>He was a fighter, a warrior...</span></p><br/><p><span>And a warrior didn’t give in.</span></p><br/><p><span>“Indomitable will.”</span></p><br/><p><span>That was always the answer. </span><span>Crockta opened his eyes.</span></p><br/><p><span>Suddenly, something white scattered. </span><span>White ash fell all around him.</span></p><br/><p><span>“......!”</span></p><br/><p><span>It wasn’t the room he had just been in. </span><span>This was a white world covered in ash, where the stars were blurred.</span></p><br/><p><span>It was her.</span></p><br/><p><span>“I missed you.” </span><span>The grey god laughed brightly.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}