{"title": "Chapter 172 - Encirclement Battle (3)", "id": 172, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-172-encirclement-battle-3", "volume_title": "Volume 2", "body": "<h1>Chapter 172 - Encirclement Battle (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 172 - Encirclement Battle (3)</span></p><br/><p><span>Andre and his white horse ran down the hill.</span></p><br/><p><span>Rommel gave a direct command. </span><span>The soldiers supporting the knights’ encirclement split to the right and left. </span><span>They split apart to open the way for him. Then the next layer was divided. The layered encirclement divided like Moses’ miracle.</span></p><br/><p><span>Andre’s unstoppable charge streaked past the soldiers. </span><span>Now the final encirclement formed by the knights was at hand. Andre’s horse gradually accelerated until it was like a meteor. </span><span>The knights opened the way.</span></p><br/><p><span>Now there was only a single circle left. </span><span>Beyond it was Crockta. </span><span>There were no brakes on a charging horse. He only headed forward and the knights moved out of his way. </span><span>He bent his body further. </span><span>As the horseshoes hit the ground, he entered the world beyond. The world compressed and the space was thrust aside. He penetrated straight towards his goal.</span></p><br/><p><span>The lance was already aiming straight at the enemy’s heart. </span><span>Crockta’s body appeared in front of him. </span><span>Andre grinned. </span><span>His mouth curved as he anticipated the collision that would soon occur. </span><span>Adrenaline reached its peak and his arms tingled as they welcomed the collision.  His body was pushing towards a thrilling impact.</span></p><br/><p><span>Crockta’s body became a blur. </span><span>But Andre didn’t stop.</span></p><br/><p><i><span>Kwaang!</span></i></p><br/><p><span>One.</span></p><br/><p><i><span>Kwa kwang!</span></i></p><br/><p><span>Two.</span></p><br/><p><em><span>Kwa kwa kwa kwang!</span></em></p><br/><p><span>He struck more than three people. </span><span>The bodies of the knights caught in his first clash flew to the side. </span><span>His charge continued without any brakes. He crushed the knights and infantry. </span><span>The knights’ and soldiers’ ranks were broken. </span><span>Andre explosively pushed through towards the rear of the army.</span></p><br/><p><span>The shattering assault of one person! </span><span>The imperial army was breached. </span><span>There were only dead bodies left in his wake. </span><span>The encirclement around Crockta was cut off.</span></p><br/><p><span>Andre’s final target was Rommel, who was commanding the army in the rear. </span><span>Andre’s white horse accelerated. Their faces were confused. Andre tightened his grip on his lance.</span></p><br/><p><i><span>Kwaaaang!</span></i></p><br/><p><span>One person turned into white particles. </span><span>It wasn’t Rommel. His charge missed. </span><span>Keynes and the Heaven and Earth members beside Rommel used magic and their bodies to protect him. </span><span>Andre looked around. Rommel and his entourage escaped into the army.</span></p><br/><p><span>He gradually slowed down.</span></p><br/><p><span>“Too bad.”</span></p><br/><p><span>It wasn’t enough to kill Rommel. </span><span>He turned his horse around and looked at his work. </span><span>The imperial army was still struggling to recover. Smoke seemed to drift up from the ground in the wake of his charge.</span></p><br/><p><span>Andre raised his lance and celebrated, \"Kuahahat.”</span></p><br/><p><span>He met Crockta’s eyes.</span></p><br/><p><span>\"Brat, your face is surprised,” muttered Andre as he lowered his lance.</span></p><br/><p><span>He was already aware that Crockta was his disciple, Jung Ian. </span><span>It had been a long time since the character, ‘Crockta’, started to be famous. It was in the first duel video against the user hunters that Baek Hanho was able to find Ian’s old habit in Crockta.</span></p><br/><p><span>The index finger.</span></p><br/><p><span>Ian didn’t even know it himself. </span><span>After returning to South Korea, Ian would always twitch his index finger whenever he entered the confrontation phase of a spar. Maybe he saw the image of a trigger. Either way, it was a habit gained from the battlefield.</span></p><br/><p><span>Crockta moved his index finger slightly in the video, twitching it whenever he wielded his greatsword. </span><span>His body was bigger, and his face was heinous, but his stance and moves were distinctive and the same.</span></p><br/><p><span>How could he not know? </span><span>Baek Hanho had taught his student ever since Ian was a child, after all. </span><span>He knew all of Ian’s moves. </span><span>Baek Hanho was convinced that Crockta was Ian after seeing the orc’s attitude. </span><span>The testimony from Ian’s little sister, Yiyu, which stated that he was playing Elder Lord, added to this.</span></p><br/><p><span>Therefore, he pretended not to know and tried to cause a dispute with his disciple in the game; however, the situation became like this. </span><span>Unfortunately, he missed. </span><span>The scale of this battle was suitable for Baek Hanho’s disciple.</span></p><br/><p><span>\"Now, let’s go back.”</span></p><br/><p><span>The white horse started running again. </span><span>This horse wasn’t just a horse. This white horse was Andre’s greatest treasure. </span><span>It didn’t matter even if the legendary red hare appeared at the end of a quest. This was a horse with dragon’s blood.</span></p><br/><p><span>\"Let's go, back.\"</span></p><br/><p><span>Andre started to circle the imperial army’s formation, trying to cut them from the sides. </span><span>The soldiers were terrified. They had already experienced this with Crockta, so fear took over.</span></p><br/><p><span>Inside was Crockta. </span><span>Outside was Andre.</span></p><br/><p><span>The empire’s army fell into confusion at the hands of only two enemies. </span><span>Andre got into the proper position and started to charge again. Crockta also raised his greatsword.</span></p><br/><p><span>The hammer flew towards the anvil.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Crockta laughed.</span></p><br/><p><span>He had been conscious that White Knight Andre was Baek Hanho, but his teacher already knew that Crockta was Ian. </span><span>The mentor and disciple met in the game during a one-sided battle, but the world wouldn’t know this.</span></p><br/><p><span>Crockta raised his greatsword. </span><span>The imperial forces were recovering from what Andre had done. Still, there were too many enemies. However, the burden had divided by half. </span><span>This was enough.</span></p><br/><p><span>Andre started charging again. Crockta wielded the greatsword in response to Andre. </span><span>The new blood transformed the stagnant battlefield. The imperial troops were dying. Blood fell to the ground. </span><span>The knights were pushed back by Crockta’s fierce attacks. However, Rommel was skilled.</span></p><br/><p><span>He had lost his composure from Andre’s sudden attack, but he immediately resumed command and tightened the circle of knights. </span><span>Then he created formations on the outside to keep Andre in check. </span><span>It was solid on the inside and outside.</span></p><br/><p><span>Andre couldn’t repeat his exciting dash across the entire army like he did before. </span><span>The soldiers were easy but he needed to be careful of the knights on horses.</span></p><br/><p><span>A struggle of life and death followed.</span></p><br/><p><span>Crockta had to deal with Adandator, Betring, and Bluno at the same time. </span><span>The three of them stabbed at Crockta’s gaps. Crockta moved back and forth between the Pinnacle and Hero realms to deal with the enemies.</span></p><br/><p><span>He was expanding his limits by the extreme crossing back and forth of realms. </span><span>He used the Pinnacle in a necessary moment to defeat the enemies. Then he manipulated causality to reverse a dangerous moment. </span><span>The enemies continued to suffer damage because they couldn’t resist Crockta’s greatsword.</span></p><br/><p><span>Adandator gritted his teeth. </span><span>The wounds Crockta dealt caused blood to flow from his mouth. He spat out some of the teeth that hadn’t fallen yet. </span><span>A strong fighting desire filled him.</span></p><br/><p><span>\"I will deal with Crockta. Stop the other one.”</span></p><br/><p><span>His pronunciation was ruined but the knights nodded calmly. </span><span>Adandator immediately reached the Hero realm. He pulled out all his strength. The tentacles that violated the laws of the world stretched out from him. That energy shot towards Crockta.</span></p><br/><p><span>Crockta sensed it and his face hardened. Adandator’s power burst forward. </span><span>Crockta smiled while grasping his greatsword.</span></p><br/><p><span>\"Do you like soup? Won’t you have to eat it for the rest of your life?”</span></p><br/><p><span>\"You scum!”</span></p><br/><p><span>Adandator plunged forward. Crockta also entered the Hero realm. Both swords hit each other. At the same time, the strands of causality wove together. </span><span>Offense and offense, both sides were offset. It was a chaotic fight where it was difficult to tell where things were reversed.</span></p><br/><p><span>Crockta didn’t lose his concentration and persistently pursued Adandator with his greatsword. </span><span>Adandator’s leg was hit. He lost his balance and fell. However, the other knights immediately attacked Crockta from behind.</span></p><br/><p><span>Crockta ignored them and his greatsword descended. </span><span>Adandator tried to avoid it but his greatsword was quick. </span><span>Crockta’s shoulders and thighs would be hit, while he would pierce Adandator’s heart.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>However, causality reversed. Their powers tweaked their attacks. </span><span>Instead of his shoulders and thighs, his back was cut. Ogre Slayer stabbed Adandator’s shoulder instead of his heart.</span></p><br/><p><span>“Ugh.”</span></p><br/><p><span>“Aaack!”</span></p><br/><p><span>Adandator struggled. </span><span>Crockta received some damage, but the wound he inflicted meant that Adandator was out of the battle. </span><span>He was satisfied at this and stepped back. The knights picked up Adandator. Crockta turned and looked for Betring and Bluno.</span></p><br/><p><span>They couldn’t be seen. </span><span>He hurriedly turned his head. They were heading away from Crockta towards Andre. </span><span>Andre's assault was fearsome but it would be tough if he went against both of them. </span><span>The repeated assaults meant the he and his horse were injured all over. Now he was tired. It was hard to maintain the same explosive assault. </span><span>In the near future, Andre would be caught up in the imperial army and the situation would worsen again.</span></p><br/><p><span>Crockta raised his greatsword and tried to break through the knights. However, the encirclement was solid. </span><span>Using the power of transcendence, four or five knights were beheaded in unison. Their heads flew through the air.</span></p><br/><p><span>Despite the fearsome sight, the knights remained calm.</span></p><br/><p><span>Crockta looked up and saw Rommel watching the battlefield from far away. </span><span>This was the amazing ability of the War Maestro class. His strength bound this army together. Thanks to Rommel’s power, the knights forgot their fear and countered Crockta.</span></p><br/><p><span>“Kulkulkul.”</span></p><br/><p><span>He knew. </span><span>It was impossible to deal with these troops alone. </span><span>But it didn’t matter. </span><span>He held his greatsword. The enemies stepped back. </span></p><br/><p><span>Crockta grinned. </span><span>“Did you hear what I said?”</span></p><br/><p><span>He remembered the face of the gray god, who was watching him. </span><span>His assimilation rate was now 100%, so dying in Elder Lord would be the same as dying on Earth. Despite the grim, desperate situation, Crockta still felt joy.</span></p><br/><p><span>He was just doing what he had to, with the world pushing at his back.</span></p><br/><p><span>“Come.”</span></p><br/><p><span>The knights rushed in an organized manner. Crockta broke them down one by one. Death and death mixed together. Crockta yelled towards his enemies.</span></p><br/><p><span>“Bul’tarrrrrrrrrr──────!”</span></p><br/><p><span>He was a warrior and survival wasn’t enough. </span><span>He recalled the ceremony on the day he received the name Crockta.</span></p><br/><p><span>Honor. </span><span>As a glorious warrior, he would use the blade of honor against death.</span></p><br/><p><span>\"Come──────!”</span></p><br/><p><span>The enemies burst forward. </span><span>Crockta’s body was wounded. The blades of the enemies were stabbed in his thighs and back. He cut their necks in return. </span><span>He pulled the weapons out of his body. Blood poured from the split skin.</span></p><br/><p><span>He didn’t care. </span><span>He could see Andre surrounded by knights. The horse had already disappeared. It was dead or gone. He was struggling against Betring and Bluno.</span></p><br/><p><span>Andre met Crockta’s eyes.</span></p><br/><p><span>‘Hey, Kid.’</span></p><br/><p><span>He remembered the first time he met Baek Hanho.</span></p><br/><p><span>'Are you fighting?’</span></p><br/><p><span>At the time, Baek Hanho was young. He asked Ian point-blank, while Ian thought he was a neighborhood gangster.</span></p><br/><p><span>It was a memory now. </span><span>However, there was no point thinking about old enemies.</span></p><br/><p><span>He was Crockta. </span><span>An orc and warrior.</span></p><br/><p><span>\"Andre──────!”</span></p><br/><p><span>Crockta called his name loudly. </span><span>Andre looked at him. He was on the brink of being pushed back by Betring.</span></p><br/><p><span>Crockta yelled with a smile.</span></p><br/><p><span>\"Ugly──────!”</span></p><br/><p><span>Andre’s eyes widened at the words then he started laughing. He found some strength and counterattacked. </span><span>Their swords met. Betring retreated.</span></p><br/><p><span>\"You’re good──────!”</span></p><br/><p><span>Andre responded by kicking Betring.</span></p><br/><p><span>Crockta started laughing. </span><span>He killed and killed, as more enemies kept coming. </span><span>He pushed forward but the situation didn’t change much. </span><span>There seemed to be no end. </span><span>His greatsword dragged on the ground as he moved forward.</span></p><br/><p><span>Now was the time to think. He was in the midst of reminiscing about his sister, the balance of his account and Cafe Reason when...</span></p><br/><p><span>“......?”</span></p><br/><p><span>A strange sound was heard from far away. </span><span>Crockta and the troops looked around and saw a man. It didn’t matter if that was his true movement speed or if he used a speed enhancement spell—he was still taking to the air like a madman.</span></p><br/><p><span>Crockta gulped as he saw the man.</span></p><br/><p><span>The man’s voice gradually grew closer.</span></p><br/><p><span>“Aigoo! I beg your pardon! I was proud of my body in the old days, although you probably can’t guess or imagine it! Kukakakat! When you go to hell, will you let the beautiful demon take hold of you...? Huhuhu, isn’t this a basic masterpiece for a hero? No! You really are! What a series of surprises. Listen to my shoulders shaking! Shake shake! How long are you going to make my shoulders dance? Kukakakakakak!”</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}