{"title": "Chapter 175 - Olympus", "id": 175, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-175-olympus", "volume_title": "Volume 2", "body": "<h1>Chapter 175 - Olympus</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 175 - Olympus</span></p><br/><p><span>The battle ended with the resistance’s victory.</span></p><br/><p><span>The empire failed to win the south, which caused the region to be divided into different areas: the empire’s territory and the Free Cities Coalition, including Espada.</span></p><br/><p><span>The emperor remained silent.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>The incident triggered a huge storm in the real world.</span></p><br/><p><span>The fight between Crockta and the imperial army became a hot topic, with the ratings record being broken every day. The videos were replayed during the day and night as they replaced Youvids’ top hits.</span></p><br/><p><span>In the meantime, Laney, the famous youvidser, released a new video from secretly tracking Crockta. This time, it was a record of his struggles in the south. </span><span>Laney’s name was once again stamped onto the minds of the people.</span></p><br/><p><span>Thanks to her, people found out the specific details of what happened. </span><span>These were the contents:</span></p><br/><p><span>After conquering the north, Crockta returned to the continent and headed south. </span><span>He fought bandits and accidentally met a knight of Alaste. </span><span>Vigo’s earnest persuasion moved his heart and Crockta’s group headed to Alaste.</span></p><br/><p><span>As a city known for its liveliness, Alaste gave him a warm welcome. </span><span>Crockta became friends with the bright and cheerful Alaste people, accepting the request to duel the empire. </span><span>Crockta fought against the genius of the empire, Adandator, and eventually won.</span></p><br/><p><span>Alaste maintained its independence. Crockta became Alaste’s savior and there was a feast to rejoice in the victory.</span></p><br/><p><span>He left Alaste with blessings and farewells. </span><span>It seemed like a happy ending.</span></p><br/><p><span>However, the news exploded. After they left for the resort town, the empire broke its promise and destroyed Alaste. </span><span>It was a tragedy. </span><span>Crockta was saddened. </span><span>The empire wanted the entire south to submit, not just Alaste. </span><span>They invaded cities and captured the people, making them soldiers or serfs for the empire. The entire south moaned.</span></p><br/><p><span>Crockta stood up for Alaste’s revenge, facing the wicked empire and his own enemies, the Heaven and Earth Clan.</span></p><br/><p><span>The slaughter began. </span><span>He was constantly wielding his sword to save villages, residents, and cities, but he couldn’t do enough alone. In the end, most of the south was incorporated into the empire. Crockta left to join Espada’s resistance.</span></p><br/><p><span>A frantic struggle followed. </span><span>Along the way, Crockta fought alone until he lost all his comrades. His attempts, while ignoring the risk to his own life, moved the hearts of the viewers.  </span><span>The viewers only watched the heavily edited videos of the Heaven and Earth Clan, but through Laney, they were able to see the war from Crockta’s viewpoint.</span></p><br/><p><span>Then there was a video of Crockta’s ‘final battle.’</span></p><br/><p><span>Laney didn’t illuminate Crockta alone from the viewpoint of the army. Rather, she should the overwhelming number of troops that Crockta faced from his side. It was a great army that no one dared face alone.</span></p><br/><p><span>In front of them, Crockta emphasized his beliefs and raised the greatsword. </span><span>It was an incomprehensible sight and no one could imagine victory.</span></p><br/><p><span>But he wasn’t alone. </span><span>The work he did, the path he took, his accomplishments had turned people into his allies.</span></p><br/><p><span>First of all, Andre appeared. They thought he would attack Crockta, but he broke through the imperial army. People were enthusiastic. </span><span>It was followed by the ‘wine maniac’ Iron and the role playing group, F4.</span></p><br/><p><span>Then there were those reborn again due to Crockta, the ‘Rehabilitation Brothers. After that was Kenzo and the ‘Mountain of Sabres, Forest of Swords’ group, wearing red headbands. In addition, Crockta’s fanclub ‘He’s an Orc, yet still Praiseworthy.’</span></p><br/><p><span>Finally, the ‘Orc Users Brotherhood’ appeared, like a scene from a movie. </span><span>The battle became skewed and they eventually won. </span><span>If Crockta only emphasized the Marxist beliefs, he would’ve been scattered as a handful of ashes in this battle. But he practiced his own faith and the reckless fight resulted in his victory.</span></p><br/><p><span>Once the edited video that showed Crockta’s struggle was released, his fanclub numbers soared. Now there was no one who didn’t know Crockta’s name. </span><span>Crockta wasn't an already dead hero or a media star. He was a living hero who personally proved his path to other people.</span></p><br/><p><span>They all praised Crockta.</span></p><br/><p><span>Opinions differed on how the situation would change in the future. The Elder Lord community was hotter than ever. </span><span>The imperial army retreated and Rommel was captured. </span><span>When looking back on Crockta’s actions, Rommel had probably received the Concrete method. Without Rommel, the Heaven and Earth Clan couldn’t exert the same power.</span></p><br/><p><span>The users looked forward to what the empire and Heaven and Earth Clan would do in the future. </span><span>But the situation went in an unexpected direction.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>\"Ah, Crockta.”</span></p><br/><p><span>“It is Tiyo!”</span></p><br/><p><span>“Kyah, so cute!”</span></p><br/><p><span>\"Can I have a signature?”</span></p><br/><p><span>\"NPCs don’t know about signatures, fool.”</span></p><br/><p><span>\"Crockta looks really scary.”</span></p><br/><p><span>The users started to flock to Espada. </span><span>The number of users in the south was reduced after the empire started their military domination, but as Crockta’s popularity peaked, more and more people came to see him.</span></p><br/><p><span>“It is embarrassing.”</span></p><br/><p><span>\"Because of my popularity...I’m sorry </span><i><span>dot</span></i><span>. Kahahat.”</span></p><br/><p><span>Tiyo laughed in a pleased manner. </span><span>As Crockta’s tracks were followed, the cute gnome Tiyo and beautiful dark elf Anor were noticed. </span><span>Inside Crockta’s fan club community, ‘He’s an Orc, yet still Praiseworthy’, there was a small part set aside for Tiyo and Anor.</span></p><br/><p><span>Every time they moved, the users’ attention was focused on them.</span></p><br/><p><span>\"I would be several times more popular if my performance was shown. I missed the opportunity because Crockta acted alone </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>\"Kulkulkul. I'm sorry.\"</span></p><br/><p><span>The residents of Katalu were initially confused as they suddenly received the news that Crockta repelled the imperial army, then they cheered. </span><span>Tiyo and Anor were a bit upset about him leaving silently, but the result was good and everyone was rejoicing.</span></p><br/><p><span>The empire showed no reaction yet. Due to this, the people of Katalu weren’t completely satisfied. It was an uneasy peace. </span><span>Still, the mood of the city was much brighter than before. Tiyo waved his hand towards the female fans.</span></p><br/><p><span>\"Is that guy doing well </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>\"It is enough that he feels bad.”</span></p><br/><p><span>“Hrmm. I’m curious </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>They were heading to the prison facility in Katalu’s militia barrack. </span><span>There was a person in custody who had decided to help them.</span></p><br/><p><span>“Crockta! You’ve come?</span></p><br/><p><span>“I am alive. Thank you.”</span></p><br/><p><span>“It is an honor!”</span></p><br/><p><span>After finishing the war with the empire, Crockta received the respect of the Katalu militia. </span><span>He fought directly on the front lines, so the residents’ awe towards Crockta increased by several times.</span></p><br/><p><span>\"He is having lunch. Do you want to see him?”</span></p><br/><p><span>“Of course.”</span></p><br/><p><span>Crockta headed to the prison in the basement.</span></p><br/><p><span>Rommel was there. </span><span>He was sitting at a table inside the prison and eating lunch. He was imprisoned but it was just a gimmick. He wasn’t even wearing shackles. </span><span>Officially, he had received the Concrete method in Katalu’s prison. </span><span>And unofficially...</span></p><br/><p><span>“You were right.”</span></p><br/><p><span>Rommel nodded. </span><span>He tried to negotiate with Crockta by telling him how to end Keynes and Luin.</span></p><br/><p><span>It was all true. </span><span>When he said ‘completely’, it wasn’t a bluff. </span><span>Keynes and Luin were completely finished.</span></p><br/><p><span>Crockta touched his chin and said skeptically, </span><span>\"I don’t know about those who have been cursed by the stars but...”</span></p><br/><p><span>First of all, he kept up the pretense. </span><span>Pretending to be an NPC was getting harder. However, Crockta’s name was so well-known then it would be annoying if he exposed himself. </span><span>Tiyo and Anor, as well as his teacher Andre, were the only ones who knew he was cursed by the stars.</span></p><br/><p><span>Crockta continued speaking, </span><span>“According to Edgar, they have disappeared from the ‘Abyss of Stars.’ He confirmed it with Robina. They also picked up the circumstances you described.”</span></p><br/><p><span>\"It is all true. As your friends from the Rehabilitation Brothers said, they will disappear forever from this world.”</span></p><br/><p><span>Edgar. </span><span>The head of the Heaven and Earth branch in Maillard.</span></p><br/><p><span>He was originally part of the Rehabilitation Brothers and joined Heaven and Earth after breaking up with Robina. A man who decided to accept Crockta as his brother after drinking together in Maillard.</span></p><br/><p><span>He knew Crockta’s identity and betrayed him, but Crockta didn’t hate him. </span><span>He ended the connection by killing himself and warned Crockta to watch out for the Heaven and Earth Clan. </span><span>At that time, he refused to make any excuses to Crockta. </span></p><br/><p><span>\"We have strict rules in the ‘Abyss of Stars.’ They have committed a serious crime.” Rommel explained.</span></p><br/><p><span>Crockta had heard about the Elder Lord doping from Ji Hayeon.</span></p><br/><p><span>The Heaven and Earth Clan was doing it.</span></p><br/><p><span>They put drugs into people, turning them semi-comatose and then connected them to Elder Lord through illegally modified capsules. The victims were injected with nutrients and forced to play Elder Lord.</span></p><br/><p><span>They were able to maintain a high rate of assimilation due to the effect of the drugs. Because they couldn’t terminate their connection, they worked endlessly in Elder Lord. </span><span>The Heaven and Earth Clan made them subservient in such a way. Then the clan grew quickly due to the high assimilation rate of the clan members.</span></p><br/><p><span>Keynes and Luin did this secretly so Rommel hadn’t known about it. However, Rommel had guessed and was convinced about the situation by Edgar not long ago.</span></p><br/><p><span>This was their weakness, Rommel explained.</span></p><br/><p><span>“......”</span></p><br/><p><span>Crockta heard about their atrocities and evaluated them again. They weren’t clever game players. They were real garbage. </span><span>Rommel misunderstood the strange expression Crockta was making and added.</span></p><br/><p><span>\"You don’t have to be disappointed about them being eliminated so easily. The punishment from the ‘Abyss of Stars’ is more painful than anything you can do to them.”</span></p><br/><p><span>“I see.”</span></p><br/><p><span>\"They will lose everything.” </span><span>Rommel said while calmly drinking his tea.</span></p><br/><p><span>It was like he said. </span><span>It was the punishment from reality, not Elder Lord. They would be put in prison and have their assets confiscated.</span></p><br/><p><span>\"Putting your old colleagues in hell, you aren’t a normal human being.”</span></p><br/><p><span>“Huhuhu.”</span></p><br/><p><span>Rommel laughed. When Crockta asked about why Rommel changed his mind, he replied,</span></p><br/><p><span>'Just, I don’t want to be hurt.’</span></p><br/><p><span>Rommel wasn’t playing Elder Lord due to the money paid to him, unlike the others in the Heaven and Earth Clan. </span><span>Rommel the ‘War Maestro’, he enjoyed playing Elder Lord itself. </span><span>He was in the Heaven and Earth Clan because it guaranteed him the position of commander, not because of anything else. Keynes and Luin weren’t worth more than that to him.</span></p><br/><p><span>\"It isn’t normal. I heard that a lot. But...” </span><span>Rommel grinned. </span><span>\"Looking back now, I think I was secretly angered by what they were doing. I am also an ordinary human. They have sinned, so they should pay the price.”</span></p><br/><p><span>Maybe this cold looking guy had sobered up when he was hit by Crockta’s punch. </span><span>The moment that Crockta was going to leave the prison... Rommel called out.</span></p><br/><p><span>“Crockta.”</span></p><br/><p><span>\"What is it?”</span></p><br/><p><span>\"You have a lot of friends. Warriors, necromancer and several humans...”</span></p><br/><p><span>\"There are a lot.”</span></p><br/><p><span>“So...”</span></p><br/><p><span>“So?”</span></p><br/><p><span>Rommel hesitated for a moment and sighed. </span><span>Then he opened his mouth again. </span><span>“Can I also be your friend?”</span></p><br/><p><span>Crockta’s expression became strange. </span><span>He didn’t have any good feelings towards Rommel, as Rommel had destroyed Alaste and harassed the south. </span><span>However, Rommel was an ordinary user who didn’t know this world was another dimension. </span><span>For him, killing people was just part of the gameplay. He just played as a villain.</span></p><br/><p><span>Crockta’s mind became complicated. </span><span>Crockta asked, “Why are you saying this all of a sudden?”</span></p><br/><p><span>\"I just admire you.” </span><span>Rommel raised his teacup to his mouth again. However, he realized that he already drank all the tea and put down the cup. </span><span>\"I was once an enemy but I would like to continue to know you...”</span></p><br/><p><span>\"Pff. This sounds like a love confession </span><i><span>dot</span></i><span>.” </span><span>Tiyo interrupted from where he stood. </span><span>“It is funny but just nonsense</span><i><span> dot</span></i><span>. You only cooperated for a short time, yet you want to be friends with Crockta after killing innocent people? Hell no.”</span></p><br/><p><span>His words were decisive. </span><span>Rommel nodded. He knew that he was an unforgivable villain from the NPCs’ point of view.</span></p><br/><p><span>Tiyo added, </span><span>\"If you want to be friends with Crockta, you should show it in your behavior </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>“Behavior...”</span></p><br/><p><span>\"People are evaluated by their actions </span><i><span>dot</span></i><span>. You can never be close friends with Crockta using meaningless words. If you really have a change of heart, you need to prove it.”</span></p><br/><p><span>Crockta nodded in agreement. Tiyo’s words represented his heart.</span></p><br/><p><span>\"It is like Tiyo said.”</span></p><br/><p><span>\"Look, I can tell Crockta’s heart without needing any words </span><i><span>dot</span></i><span>! This degree is needed to be his friend.”</span></p><br/><p><span>Tiyo raised his shoulders. Rommel laughed.</span></p><br/><p><span>“I see. I understand. See you next time.”</span></p><br/><p><span>Crockta and Tiyo left the prison. </span><span>Rommel decided to stay here until the Heaven and Earth Clan were destroyed. It would be a while.</span></p><br/><p><span>Crockta and Tiyo left the prison. </span><span>Their work was completed.</span></p><br/><p><span>This time, it seemed like they could travel leisurely.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>There were voices.</span></p><br/><p><span>‘It was definitely her. She showed up. Death is back.’</span></p><br/><p><span>‘I’ll find her. i will find and stop her. Do whatever it takes.’</span></p><br/><p><span>'It wasn’t an error? Was she alive?’</span></p><br/><p><span>‘We need to stop her. For the sake of the world.’</span></p><br/><p><span>‘What does she want?’</span></p><br/><p><span>‘The destruction of the world.’</span></p><br/><p><span>‘The destruction of the world.’</span></p><br/><p><span>‘The destruction of the world.’</span></p><br/><p><span>'How do we stop it? I can hardly see her. It is suspicious. Is it really her?’</span></p><br/><p><span>‘That guy, the orc who conquered the north. It is him. It is obvious.’</span></p><br/><p><span>'Is he related?’</span></p><br/><p><span>‘I understand. Orc! The orcs! She is going to use the orcs. This time, the orcs!’</span></p><br/><p><span>‘It still isn’t certain. Orcs don’t believe in anyone. We can’t jump to conclusions.’</span></p><br/><p><span>'They are orcs. The only thing they believe in is the forgotten god. No one protects them, so she probably reached out.’</span></p><br/><p><span>‘Really, the orcs?’</span></p><br/><p><span>‘Orcs.’</span></p><br/><p><span>‘Orc.’</span></p><br/><p><span>‘Orc.’</span></p><br/><p><span>‘Orc.’</span></p><br/><p><span>‘The orcs.’</span></p><br/><p><span>‘They are people we can’t manage anyway.’</span></p><br/><p><span>‘It doesn’t matter even if they disappear.’</span></p><br/><p><span>‘No one will trust those cheeky brats.’</span></p><br/><p><span>‘'The orcs.’</span></p><br/><p><span>‘The orcs and Crockta.’</span></p><br/><p><span>‘Cheeky brats.’</span></p><br/><p><span>The voices expressed their opinions.</span></p><br/><p><span>‘No.’</span></p><br/><p><span>‘Get rid of them, get rid of her.’</span></p><br/><p><span>‘Protect the world.’</span></p><br/><p><span>‘Our world.’</span></p><br/><p><span>‘For the world.’</span></p><br/><p><span>That day. </span><span>A divine message was sent down again.</span></p><br/><p><span>Every god whispered the same thing.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}