{"title": "Chapter 189 - Kill the Thunderbird (2)", "id": 189, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-189-kill-the-thunderbird-2", "volume_title": "Volume 2", "body": "<h1>Chapter 189 - Kill the Thunderbird (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 189 - Kill the Thunderbird (2)</span></p><br/><p><span>Tiyo’s skill was revealed with the drake meat dish. </span><span>He boiled water in a large pot obtained in Geherad. Then he placed the drake meat and spices inside to make a stew. </span><span>Boiled food was convenient when camping in the woods. They had been eating similar stews for a few days, but they didn’t get tired of it due to the different spices that Tiyo put in.</span></p><br/><p><span>Zankus admired the taste as he said, “The taste is good. Is that gnome friend a chef?”</span></p><br/><p><span>\"Huhu, men who cook are popular </span><i><span>dot</span></i><span>. I have a good body, can cook, and am intelligent! I’m not lacking anything </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>He spooned up some more stew from the pot.</span></p><br/><p><span>“There are a lot of things here. Do you always carry this big pot around?”</span></p><br/><p><span>“Of course </span><i><span>dot</span></i><span>. This much is needed if you want delicious food! There is no cooking without it! It is all my hard work </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>\"Amazing.\"</span></p><br/><p><span>“...Excuse me.” </span><span>It was actually Crockta who carried the big pot, but Tiyo just shrugged.</span></p><br/><p><span>Zankus asked Crockta, \"I suppose you're going to Orcrox?”</span></p><br/><p><span>“Yes,” answered Crockta.</span></p><br/><p><span>\"Huhuhu, a long time has passed. The young warrior who wielded the sword...”</span></p><br/><p><span>Zankus pulled something out of his bag. </span><span>It was alcohol.</span></p><br/><p><span>\"Nowadays, you are a warrior sweeping through the continent that is now returning to save Orcrox.”</span></p><br/><p><span>Crockta received the cup with a smile. </span><span>Tiyo and Anor also received cups. Then Zankus poured one for himself. The alcohol was strong, which they could tell just from the smell. Anor was couldn’t hold his alcohol, so he frowned at the smell.</span></p><br/><p><span>“Zankus, will you go?”</span></p><br/><p><span>“I have to go. I will go after catching the thunderbird.”</span></p><br/><p><span>Thunderbird, the giant bird that suddenly appeared and disappeared with the drake’s body.</span></p><br/><p><span>\"Why are you trying to catch it?”</span></p><br/><p><span>\"In order to pay back a favor...” </span><span>He said while drinking the alcohol. </span><span>“You, didn’t you meet Shakan?”</span></p><br/><p><span>\"Shakan?”</span></p><br/><p><span>\"Of course. Every hunter knows him. The last Shakan. The great hunter.”</span></p><br/><p><span>Crockta remembered Shakan, a great hunter who lived a long life and hated the behemoth. He ate the hearts of his prey and corrupted his body in order to fight the behemoth. </span><span>In the end, he was able to hunt the behemoth and opened up the north. </span><span>Shakan was a man who had a great influence on Crockta, just like Lenox and Hoyt did. He was someone who allowed Crockta to grow as a warrior.</span></p><br/><p><span>\"Did you know that Shakan once tried to hunt the thunderbird?”</span></p><br/><p><span>“I didn’t know that.”</span></p><br/><p><span>“But the thunderbird is still alive, meaning he also failed. When I asked him about the thunderbird, he told me not to dream of hunting it.” </span><span>Zankus looked at the sky like he was remembering it. </span><span>“I always wanted to surpass Shakan, but he is dead. Now, this is the only way left to prove that I am a better hunter.”</span></p><br/><p><span>Hunt the thunderbird. </span><span>This was the method Zankus had chosen to prove himself.</span></p><br/><p><span>\"I’ll go to Orcrox after hunting the thunderbird.”</span></p><br/><p><span>Crockta nodded and said, \"I understand.”</span></p><br/><p><span>\"Therefore, I would like to hear more about Shakan and the behemoth. Please tell me.”</span></p><br/><p><span>“Kulkulkul, of course.”</span></p><br/><p><span>Crockta bumped cups with Zakan. </span><span>They talked about Shakan. Tiyo interjected at the exciting parts. Anor didn’t know Shakan so he just listened from the side.</span></p><br/><p><span>The first strange meeting, Shakan showing the strength he gained to defeat the behemoth, dedicating everything he had to kill the behemoth until he eventually fell, they told Zankus everything they remembered. He</span><span> was a man with an indomitable tenacity that really caused admiration.</span></p><br/><p><span>Zankus smiled. </span><span>\"He really was the best hunter. He went that far and died a hunter. I want to live my life like him.”</span></p><br/><p><span>“I’m not a hunter but I agree.”</span></p><br/><p><span>\"In the meantime, I've been running after his back. However, now he is gone. So I decided to surpass him by hunting the thunderbird. I’ll hunt the prey that Shakan couldn’t catch, then I can go my own way.”</span></p><br/><p><span>\"You are already a well-regarded hunter. The hunter who shot down the sun, ‘Zankus the Sun Killer.’”</span></p><br/><p><span>\"That is a nickname. I know that I haven’t reached Shakan yet.” </span><span>Zankus laughed.</span></p><br/><p><span>They drank the alcohol again. </span><span>Crockta quietly tilted the cup when the wind blew, making the edge of his red headband touch the alcohol. </span><span>After fighting the empire, he had bought a new trademark red headband to place around his head.</span></p><br/><p><span>“It is windy.” </span></p><br/><p><span>The wind was strong. A noise was gradually heard. They looked up at the sky. The black figure passed quickly.</span></p><br/><p><span>“This?”</span></p><br/><p><span>“The thunderbird showed up again.”</span></p><br/><p><span>The giant bird, clearly the thunderbird, flew elegantly in the sky while its dark blue feathers scattered.</span></p><br/><p><span>\"It has started hunting again. I don’t know what is going on, but this is a chance for me.” </span><span>Zankus got up. It was an unthinkable agility considering he just ate so much stew. </span><span>Then he said to Crockta’s group. </span></p><br/><p><span>“Do you want to go with me?” </span><span>He pointed in the direction of the thunderbird. </span><span>“I have a good feeling today. This is a chance to see me succeed in hunting the thunderbird. How about it?”</span></p><br/><p><span>He grinned.</span></p><br/><p><span>Tiyo got up immediately. </span><span>\"Kahahat, a confident man. Good</span><i><span> dot</span></i><span>. Those skills, I will look at them with my own eyes!”</span></p><br/><p><span>Crockta and Anor nodded in agreement with Tiyo. </span><span>They got up and followed Zankus.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Zankus ran without any hesitation, like he already devised a way to track the thunderbird. </span><span>He sometimes looked at the sky to determine the direction, but they couldn’t figure out how.</span></p><br/><p><span>“There are three trolls!” </span><span>Zankus suddenly shouted. </span><span>As he said, they headed forward a little bit and there were three trolls. They were surprised at the sudden appearance of an orc.</span></p><br/><p><span>\"I'll entrust this to you!”</span></p><br/><p><span>Zankus jumped over them. </span><span>Zankus overtook them with flexible movements, grabbed the branch of a tree and flew forward again using the rebound. </span><span>It was an incredible stunt more suitable for an elf than an orc.</span></p><br/><p><span>Tiyo, who followed Zamkus, also jumped up to mimic him.</span></p><br/><p><span>\"I’ll leave it to you </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>Tiyo kicked against the ground. </span><span>However, the jump wasn’t strong enough. A troll’s hard fist rose and struck Tiyo’s abdomen.</span></p><br/><p><span>“Cough!” </span><span>Tiyo fell down. </span><span>“I-I could’ve done it </span><i><span>dot</span></i><span>...”</span></p><br/><p><span>Crockta pulled Tiyo up. Tiyo’s face was red as he was filled with rage and shame at his failure. He immediately raised General.</span></p><br/><p><span>\"I would let these bastard trolls get away </span><i><span>dot</span></i><span>! You stay there! I will blow your heads off with General </span><i><span>dot</span></i><span>!” </span><span>The trolls recoiled as they felt an unusual atmosphere from the little gnome. </span><span>\"It will be different now</span><i><span> dot</span></i><span>! Dieeeeee!”</span></p><br/><p><span>Tiyo rushed forward and fired General. </span><span>When he reached the Pinnacle, he said he would go back to basics. So Tiyo abandoned the Vulcan form and used the old rifle form. </span><span>He rolled roughly across the ground and shot the trolls in a sitting position.</span></p><br/><p><i><span>Dadadadada!</span></i></p><br/><p><span>The magic bullets hit the trolls. They failed to withstand the impact and fell over. </span><span>Tiyo rushed forward immediately. </span><span>The trolls were terrified by his violent appearance. Tiyo kicked against the ground. </span><span>Then he jumped over them. </span><span>It was a clean jump.</span></p><br/><p><span>\"Huhu, look </span><i><span>dot</span></i><span>. I eventually jumped over.” </span><span>Tiyo landed on the floor and praised his performance, looking back and raising a thumb. Then he spoke to the blankly staring Crockta and Anor. </span><span>\"Then, I’ll leave it to you</span><i><span> dot</span></i><span>!”</span></p><br/><p><span>Was that what he really wanted to do? </span><span>Tiyo started running. He tried to grab the branches like Zankus, but eventually gave in.</span></p><br/><p><span>\"He is too excited.”</span></p><br/><p><span>\"That’s right.”</span></p><br/><p><span>Crockta and Anor shook their heads.</span></p><br/><p><span>\"Let’s go.”</span></p><br/><p><span>They walked towards the fallen trolls. </span><span>The trolls were stunned by Tiyo’s General. They became terrified with the orc warrior approached. </span><span>Crockta grinned. </span><span>Then he jumped over them. </span>He raised a thumb towards Anor.</p><br/><p><span>“I’ll leave it to you.”</span></p><br/><p><span>“......”</span></p><br/><p><span>Crockta also ran away. </span><span>The trolls looked at the lone Anor. </span><span>They were looking at Anor with eyes that sought sympathy.</span></p><br/><p><span>Anor suddenly said, </span><span>“A warrior doesn’t attack unarmed people!”</span></p><br/><p><span>The trolls were bare-handed from the beginning, but Anor shouted it anyway. </span><span>Then he ran after his party.</span></p><br/><p><span>“...Kuock?”</span></p><br/><p><span>\"Kueeeeok.”</span></p><br/><p><span>\"Kuweeok.”</span></p><br/><p><span>The three trolls looked at each other and sighed with relief. </span><span>The great forest was truly a difficult place to live.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>\"Ohhhh! Look up </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>Crockta raised his head when he heard Crockta’s words. </span><span>The thunderbird’s body was covering the sky. </span><span>Its spread out wings filled their vision. </span><span>But there was something else. The shape wriggling under the thunderbird was an ogre.</span></p><br/><p><span>\"It hunted an ogre </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>The ogre twisted in the thunderbird’s claws, like it was painful. The sharp claws became tighter. A perfect hunting skill. </span><span>However, the thunderbird wasn’t in an ordinary state either. </span><span>The thunderbird caught the ogre but it was struggling frantically in the air. Strong winds were sweeping around it.</span></p><br/><p><span>\"Why is the bird acting like that </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>\"It is magic.”</span></p><br/><p><span>“Magic?”</span></p><br/><p><span>Zankus glanced at it with sharp eyes.</span></p><br/><p><span>“Ogre wizard.”</span></p><br/><p><span>\"Oh, an ogre wizard </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>The ogre wizard that was mentioned last time really appeared. </span><span>This meant there was a group of ogres near here.</span></p><br/><p><span>\"Look at the tail of the thunderbird.”</span></p><br/><p><span>As Zankus said, a shining blue rope was wrapped around the thunderbird’s tail. </span><span>It connected the thunderbird to the ground so that it couldn’t fly further.</span></p><br/><p><span>\"Kuaaaah!\"</span></p><br/><p><span>“Kuwaaah!”</span></p><br/><p><span>The roars of the ogres could be heard at the source of the rope.</span></p><br/><p><span>“The thunderbird seems to have messed with the ogres.” </span><span>Zankus was confused. </span><span>“Strange. Why would a smart guy like that hit the ogres? Besides, it just grabbed the body of a drake. The rate of hunting food is too frequent...”</span></p><br/><p><span>\"Maybe it is hungry</span><i><span> dot</span></i><span>.”</span></p><br/><p><span>\"Hrmm...\"</span></p><br/><p><span>The thunderbird struggled in the sky and the rope made of magic power soon disappeared. </span><span>The thunderbird flew high in the sky.</span></p><br/><p><span>\"It escaped...what is that</span><i><span> dot</span></i><span>?”</span></p><br/><p><span>However, there was still a translucent line linked to the thunderbird.</span></p><br/><p><span>“Tracking magic.”</span></p><br/><p><span>The ogre wizard was tracking the whereabouts of the thunderbird. The translucent line followed the direction of the thunderbird.</span></p><br/><p><span>\"If we follow that, it will lead us to the thunderbird’s nest.”</span></p><br/><p><span>\"Then isn’t the bird in danger </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>“Of course. It must’ve caught a pretty important ogre. The ogre wizard will trace it until the end.”</span></p><br/><p><span>Zankus raised a finger to his mouth and hid in the bushes. </span><span>\"Hide.”</span></p><br/><p><span>Crockta’s group followed. </span><span>Soon, a group of ogres appeared with a loud sound. </span><span>They were running in the thunderbird’s direction. It wasn’t just one or two. There were dozens of ogres. </span><span>It was the first time Crockta had seen so many ogres together. </span><span>The ground shook like an earthquake was occurring.</span></p><br/><p><span>“That is the ogre wizard.”</span></p><br/><p><span>Zankus pointed to the ogre in the vanguard. </span><span>The wizard was holding a staff and his body was like a big ogre warrior, but lightning appeared around him every time he screamed. </span><span>Once the ogres left, Tiyo stood up and asked.</span></p><br/><p><span>“Zankus! Won’t you lose your prey at this rate</span><i><span> dot</span></i><span>?” </span><span>He exclaimed. </span><span>\"I didn’t think you were a coward who would give up </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>Zankus laughed. </span><span>A man who could speak such taunting words to Zankus was uncommon on this continent. He liked this little gnome.</span></p><br/><p><span>\"I understand, I’ll show you.” </span><span>Zankus lowered his posture, his expression that of a merciless hunter. </span><span>“I am the hunter Zankus.”</span></p><br/><p><span>He watched the running ogres.</span></p><br/><p><span>“Thunderbirds and ogres, now you are all my prey.”</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}