{"title": "Chapter 196 - The Road to Orcrox (2)", "id": 196, "volume": 2, "url": "http://boxnovel.org/praise-the-orc-chapter-196-the-road-to-orcrox-2", "volume_title": "Volume 2", "body": "<h1>Chapter 196 - The Road to Orcrox (2)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 196 - The Road to Orcrox (2)</span></p><br/><p><span>The expedition entered Chesswood. They were able to stay in a vacant lot in the center of the village. </span><span>However, their expressions weren’t bright. It was because of the insults that been poured their way.</span></p><br/><p><span>Chesswood didn’t welcome them. The residents went as far as throwing eggs.</span></p><br/><p><span>“Ack! Eggs! These bastards...!”</span></p><br/><p><span>“Be patient, patient!”</span></p><br/><p><span>\"Don’t react to the residents of Chesswood.”</span></p><br/><p><span>Aklan and the commanders calmed down the expedition troops. </span><span>As the representative of Chesswood, Ingram spoke to Aklan.</span></p><br/><p><span>“I’m sorry.”</span></p><br/><p><span>“No.”</span></p><br/><p><span>“Crockta is a hero in our village, so people who want to kill Crockta will never be welcome here.” </span><span>Ingram was a man with a solid body. In the past, he might’ve been a mercenary or a soldier. </span><span>“It is because Crockta saved our village, which was once on the verge of destruction.”</span></p><br/><p><span>\"It is understandable. I’m curious.” </span><span>Aklan nodded. </span><span>\"What is he like?”</span></p><br/><p><span>\"Crockta?”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>\"Huhu, it is better not to know. If you know, you might want to disobey the gods’ will.”</span></p><br/><p><span>“Is he that strong?”</span></p><br/><p><span>\"He is strong, but at the same time, if you know what a wonderful warrior he is, you won’t want to be hostile towards him. Rather, you would want to be friends with him.” </span><span>Ingram added with a smile. </span><span>\"Of course, the orc warrior’s song he sang is terrible.”</span></p><br/><p><span>Aklan discovered that Ingram really liked Crockta. </span><span>Aklan smiled bitterly and looked around. He could feel the gazes of the villagers. </span><span>Following Maillard, there were traces of Crockta here. He was the founder of the Rehabilitation Brothers in Maillard and the hero who saved Chesswood.</span></p><br/><p><span>There was a song in Chesswood praising Crockta. </span><span>It was an epic song about how the strong and honest orc fought against the people raiding the villages, calling his friends and achieving a brilliant victory.</span></p><br/><p><span>People booed the expedition and sang the song. It was to the point where the expedition had memorized the lyrics. In particular, the ‘Bul’tar bul’tar bul’tar~’ refrain was so addictive that the soldiers of the expedition couldn’t help humming.</span></p><br/><p><span>“The orc is more amazing than I thought.”</span></p><br/><p><span>Adandator just shrugged and said.</span></p><br/><p><span>\"Our expedition is turning out worse than we thought.”</span></p><br/><p><span>Adandator heard some expedition members shouting at the villagers and not following commands. </span><span>The volunteers were angry at the reception from the village. If Aklan hadn’t swung his sword and set an example for a few people, there might’ve been trouble.</span></p><br/><p><span>“Adandator. Please manage the soldiers.”</span></p><br/><p><span>Aklan was a paladin who believed in the war god, so he wouldn’t spare his sword if necessary.</span></p><br/><p><span>“If you need to, discipline them using military standards.”</span></p><br/><p><span>If they caused problems for ordinary people, not Crockta and the orcs, their honor would fall to the ground. </span><span>This had to stop. They were gathered for an honorable reason, not plunderers who attacked villages.</span></p><br/><p><span>The children they encountered at the entrance kept chasing them and calling out rhymes.</span></p><br/><p><span>\"Get out of Chesswood! We can’t sleep because of you!”</span></p><br/><p><span>\"I will stab you in the shoulder! Move your feet on the road!”</span></p><br/><p><span>\"You will never win against Crockta, you are a hammer that will be nailed in! Reflect!”</span></p><br/><p><span>“These guys...”</span></p><br/><p><span>Ingram chased the children away. The children screamed and ran away. </span><span>He shook his head and told Aklan, </span><span>“If you continue, you will see a wide open space. You can stay there for a day. If you need more space, you can occupy the path. I will let the villagers know.”</span></p><br/><p><span>“Thank you for your consideration. And...” </span><span>Aklan laughed awkwardly and said. </span><span>\"Can I recruit volunteers from the village?”</span></p><br/><p><span>\"Hehe, well... Are you really going to do it? I can’t stop you. Try it if you want.”</span></p><br/><p><span>Looking at the atmosphere of the village, no one would come. </span><span>Still, it was better to try than to do nothing. Aklan gathered the priests of each temple.</span></p><br/><p><span>\"People from each temple will recruit volunteers.”</span></p><br/><p><span>“Based on this atmosphere, will there be any volunteers?”</span></p><br/><p><span>The priests had already given up. Aklan had a bitter expression on his face.</span></p><br/><p><span>\"Let's just give it a try.”</span></p><br/><p><span>They traveled to the other villages of Chesswood to recruit volunteers. But in the end, there was only booing. </span><span>They were priests who worshiped the gods, so the villages didn’t throw eggs or hurt them. However, they all had hostility in their eyes.</span></p><br/><p><span>It was an unfamiliar sight for the priests. </span><span>In the end, they returned to the camp without recruiting one volunteer. </span></p><br/><p><span>\"The plan is going wrong.”</span></p><br/><p><span>\"First Maillard and now Chesswood.”</span></p><br/><p><span>Aklan frowned at Adandator’s smile. </span><span>He had expected a tremendous number of volunteers from Chesswood, but the result was zero. There were no volunteers whatsoever.</span></p><br/><p><span>\"It's okay. We have plenty of troops now.”</span></p><br/><p><span>The expedition army was already great in number. Too many was the problem.</span></p><br/><p><span>\"There are many cities in the future.”</span></p><br/><p><span>“Yes. Let’s hope so.”</span></p><br/><p><span>\"Besides, good news will come soon.” </span><span>Aklan said to comfort himself. </span><span>“Once we get a reply from Blacksmith, the marching speed will increase. Materials will be supplied quickly.”</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>The Blacksmith Company’s headquarters meeting room, where only the heads of the Blacksmith Company could gather. </span><span>There was a meeting going on there. </span><span>It was different from the usual calm atmosphere.</span></p><br/><p><span>There was one woman who raised her voice the most, </span><span>\"The life of the company is trust!”</span></p><br/><p><span>\"But this case is different!”</span></p><br/><p><span>\"It is different! Mister Pascal! Think closely. Crockta is our top rated member and has a great deal of money! In addition, the whole world knows it! Crockta is advertised as our customer! Crockta’s red headband is also a popular item! Besides, how many orcs are among our customers? Numerous orcs use our company!”</span></p><br/><p><span>\"But if we make a deal with the expedition, our profits will be enormous. There is a lot of money!\"</span></p><br/><p><span>\"The trust of our customers is better than short-term profit! That is our cardinal rule! But what if we make a deal with the expedition? What will the customers think? That we consider customers as trash who can be sold to others?”</span></p><br/><p><span>\"It isn’t that bad!”</span></p><br/><p><span>\"So are my words wrong? Customers trust us. Orc customers! Crockta! They believed in us and dealt with us! The amount of money from the orcs is huge! It is a betrayal for them!”</span></p><br/><p><span>\"The orcs will be gone anyway!”</span></p><br/><p><span>“How do you know that? Even if they do disappear, this history will be remembered! That Blacksmith betrayed its customers!”</span></p><br/><p><span>\"This is really...!”</span></p><br/><p><span>\"Does anyone else think like Mister Pascal?” </span><span>The woman turned her head and asked, “What do you think?”</span></p><br/><p><span>Black Smith, the chairman of the Blacksmith company, smiled as he watched the controversy.</span></p><br/><p><span>“Huhuhu.”</span></p><br/><p><span>The executive that he promoted was truly unique.</span></p><br/><p><span>At first, she was a poor position as an employee who had a negative impression because she was cursed by the stars. However, the number of vegetables she sold in Anail was abnormal, causing her to become the selling queen of the market.</span></p><br/><p><span>Stella. </span><span>The youngest but most innovative executive of the Blacksmith Company.</span></p><br/><p><span>\"Huhuhu, Stella expressed my thoughts.”</span></p><br/><p><span>\"In the end, the most important thing is what the chairman thinks. Heheh.”</span></p><br/><p><span>\"I will express my thoughts.” </span><span>Black Smith laughed out loud.</span></p><br/><p><span>Innovation meant thinking different from others. However, she didn’t forget the cardinal rule of the Blacksmith Company. The root of everything. </span><span>There were numerous talents from across the continent gathered beneath him, but it was rare that they had both innovation and this understanding of the fundamentals. </span><span>Black Smith thought that this root essence absolutely couldn’t be lost.</span></p><br/><p><span>But Stella had it. </span><span>The root. </span><span>The chairman thought about Stella’s words and opened his mouth again.</span></p><br/><p><span>\"The trust of our customers is better than short-term profit...” </span><span>He looked at Stella and smiled. </span><span>\"Thank you for reminding me of something I had forgotten for a while. Miss Stella.”</span></p><br/><p><span>“It is nothing. Any employee of Blacksmith knows it. Chairman has proved it personally.”</span></p><br/><p><span>\"Knowing it and putting it in practice is different. It looks like your colleagues who perform well have forgotten this fact. They don’t see it anymore.”</span></p><br/><p><span>Some of the executives flinched at his words. </span><span>They sometimes did dishonest things for the sake of Blacksmith’s profits. It was how they had been able to raise their status. </span><span>But the chairman already knew.</span></p><br/><p><span>The chairman continued speaking, </span></p><br/><p><span>\"I agree with you. If we make a deal with the expedition, our profits will be enormous. The position of our Blacksmith, the top company on the continent, will be further strengthened. It will make up for the losses we recently got from the Thompson Company. But...”</span></p><br/><p><span>The chairman looked at the executives.</span></p><br/><p><span>\"Miss Stella’s words are significant.”</span></p><br/><p><span>“......”</span></p><br/><p><span>“Didn’t I tell you? If there isn’t an answer, always look at the root. Our root that is always there.”</span></p><br/><p><span>Black Smith pointed behind him. </span><span>There was a big framed picture. Above the picture was the motto of the Blacksmith Company, that made it what it was today. </span><span>All executives fell silent as they saw it. </span><span>It hung in every branch of the Blacksmith Company.</span></p><br/><p><span>[The trust of the customers is heavier than your life.]</span></p><br/><p><span>Even since Black Smith was a young man, he never broke this promise. </span><span>Even when the staff miscalculate the numbers and the company received huge losses, he didn’t withdraw from the contract. </span><span>He opened a branch in remote villages and didn’t close it down, despite the labor costs causing a deficit. </span><span>It was because they were all promises.</span></p><br/><p><span>As the size of the company increase, he couldn’t manage all employees so he had this included as part of the staff training.</span></p><br/><p><span>\"We might see a loss now. But the world will remember that our company never harms its customers. The orcs might disappear in this war but their names will remain in our books. If we help the expedition, how can we open our books again?”</span></p><br/><p><span>Stella's face brightened. The executives also nodded. The chairman’s decision was made.</span></p><br/><p><span>\"Remember. Our company's mission isn’t to make a profit.”</span></p><br/><p><span>The words that Black Smith always said, “What is our mission?”</span></p><br/><p><span>The executives answered at the same time, \"It is to benefit the world through distribution.”</span></p><br/><p><span>\"Yes, that’s right.” </span><span>Black Smith rose from his seat. </span><span>“As a child, I wanted to eat fish. There was no fish available in a mountain village. Only pale chubs in the valleys...then one day, a company started trading with our village and I could eat the fish I like.”</span></p><br/><p><span>It was his origin that everyone in the Blacksmith Company knew.</span></p><br/><p><span>\"Thanks to it, my village could enjoy not only fish, but medicines, rare goods and new food. There are plenty of young Black Smith in the world. Everyone. We aren’t merchants who profit from war, but true merchants who benefit the people.”</span></p><br/><p><span>\"I understand.”</span></p><br/><p><span>\"I'll always remember this, Chairman.”</span></p><br/><p><span>\"I will follow your words.”</span></p><br/><p><span>Black Smith’s will was absolute in the Blacksmith Company. The executives who objected to Stella changed their attitudes quickly. </span><span>Stella bowed her head. Black Smith smiled. It felt like he had a smart granddaughter.</span></p><br/><p><span>“Then send the reply. Unfortunately, we can’t agree to the deal.”</span></p><br/><p><span>The answer of the Blacksmith Company was decided. They would refuse the expedition’s deal.</span></p><br/><p><span>\"Now they will probably try to make a deal with the Thompson Company,” said an executive.</span></p><br/><p><span>The Thompson Company was an emerging threat. It started from Anail and now its activities were spreading across the world.</span></p><br/><p><span>\"That's right. I guess so. What will Thompson do? Hahaha.”</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}