{"title": "Chapter 206 - War of the Gods (4)", "id": 206, "volume": 3, "url": "http://boxnovel.org/praise-the-orc-chapter-206-war-of-the-gods-4", "volume_title": "Volume 3", "body": "<h1>Chapter 206 - War of the Gods (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 206 - War of the Gods (4)</span></p><br/><p><span>The orcs crashed into the shields of the expedition army. </span><span>Once Crockta and Hoyt hit the front, the formation collapsed. They dug in. </span><span>As flesh was exposed, the soldiers beyond the shield were crushed like tofu under the two blades.</span></p><br/><p><span>“Only this much!”</span></p><br/><p><span>\"Bul’tarrrr!”</span></p><br/><p><span>The orc warriors followed them. The weapons of the orcs hit the armor of the soldiers. Some killed and others died. These actions were repeated time and time again. </span><span>The orcs that stood up in the end had brutal looks in their eyes.</span></p><br/><p><span>“I’m going this way.”</span></p><br/><p><span>\"I will take that way.”</span></p><br/><p><span>Hoyt and Crockta turned away from each other. </span><span>Crockta broke through the enemies like he was digging a cave. </span><span>God Slayer killed the enemies. The moment he was about to enter the interior and start a full-scale massacre.</span></p><br/><p><span>“Crocktaaaaaaaaaa!” </span><span>Someone charged. </span><span>“It has been a while!”</span></p><br/><p><span>A blade flew towards him. </span><span>Crockta moved his greatsword and blocked the storm of swords. The face of the person wielding the blade was somehow familiar.</span></p><br/><p><span>Crockta laughed, </span><span>“Adandator.”</span></p><br/><p><span>Adandator was the genius of the empire who joined the expedition to kill Crockta.</span></p><br/><p><span>\"It has been a while. You came here?” Crockta asked. </span></p><br/><p><span>\"I wanted to kill you.”</span></p><br/><p><span>“Do you have dentures?”</span></p><br/><p><span>“What?”</span></p><br/><p><span>Crockta pointed to his teeth. </span><span>\"Last time, my fist knocked them out. Now they look fine, so are they false teeth?”</span></p><br/><p><span>Adandator’s face turned red. </span><span>“This bastard...!”</span></p><br/><p><span>“They are dentures. Whoa whoa, calm down.”</span></p><br/><p><span>“Die!”</span></p><br/><p><span>The outraged Adandator carelessly wielded his sword. </span><span>When they first met during the duel, it was a tight match. Crockta had been on the defensive against Adandator’s attacks, which seemed unstoppable. </span><span>But now it was different.</span></p><br/><p><span>Constant progress. </span><span>Crockta progressed every day.</span></p><br/><p><span>He always fought by himself, so he had to grow on a daily basis. After he risked his life and won, he faced a stronger opponent and his life was in danger again. He faced the northern great chieftain and the empire alone.</span></p><br/><p><span>He didn’t have a limit.</span></p><br/><p><span>\"Manage it well; it’ll be ugly if the colors are different.”</span></p><br/><p><span>“Uwaaaack!”</span></p><br/><p><span>As Crockta touched on a sore spot, Adandator raged and wielded his sword. </span><span>An opponent who lost his composure in battle was easy. </span><span>There were too many loopholes in Adandator, as Crockta became immersed in his thoughts.</span></p><br/><p><span>They once experienced some good times together.</span></p><br/><p><span>‘That light, you will know what it is if you keep training. You were just afraid.’</span></p><br/><p><span>‘Nonsense...’</span></p><br/><p><span>‘We are creatures who like using our fists and stumble when the temple is hit. Don’t choke.’</span></p><br/><p><span>‘Talking nonsense...’</span></p><br/><p><span>Adandator was a cute kid who came to him after being defeated by the sword and wanting to learn from Crockta. </span><span>He was an enemy and a friend, but now he was once again an enemy on the battlefield. Crockta thought they wouldn’t see each other again, but Adandator came to kill him.</span></p><br/><p><span>This might be the final destination of their relationship.</span></p><br/><p><span>“Adandator!”</span></p><br/><p><span>Crockta erased his thoughts and wielded God Slayer. </span><span>The greatsword attacked Adandator’s gaps. </span><span>At that moment, the world slowed down. </span><span>Crockta and Adandator’s eyes met in the realm of the Pinnacle.</span></p><br/><p><span>Adandator gritted his teeth. His body accelerated. Acceleration and acceleration. However, it wasn’t enough to avoid Crockta’s blade that was already at the Pinnacle. </span><span>Crockta’s sword slid towards his body.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Crockta’s attack was clean. </span><span>Then the speed of the world returned to normal. </span><span>The silence from the realm of the Pinnacle was broken. The noise of their battlefield entered their ears again. </span><span>Adandator looked up with stupefied eyes.</span></p><br/><p><span>Crockta’s greatsword. </span><span>Instead of going through Adandator, it slashed his side. </span><span>Crockta had saved Adandator’s life.</span></p><br/><p><span>“Hu...huhuhu. Hahahat. Hahahahat.” </span><span>Adandator laughed.</span></p><br/><p><span>Now the gap between the two of them had become too wide. </span><span>He couldn’t understand it. How did Crockta become stronger so quickly? </span><span>It was understandable that a talented person would develop rapidly when first holding the sword, but a miracle exceeding the limits in such a short amount of time went beyond common sense.</span></p><br/><p><span>“How did you become so much stronger?” asked Adandator, dropping his sword..</span></p><br/><p><span>Crockta smiled and replied with a question, “You really don’t know?”</span></p><br/><p><span>“Tell me.”</span></p><br/><p><span>\"You came to kill me. It is impossible to lose with the vast army and the power of the gods.”</span></p><br/><p><span>\"That's right.\"</span></p><br/><p><span>\"If you want to be stronger, stand on a battlefield that you can’t win.”</span></p><br/><p><span>Adandator’s expression changed.</span></p><br/><p><span>\"Go to the battlefield that needs you, not your desired battlefield. Go to the place where the lament of the loser is scheduled, not the roar of the winner. Walk towards the guillotine instead of the laurel. Wield your sword until you fall. Do that..” </span><span>Crockta grinned and said, \"If you don’t die, you will become stronger.”</span></p><br/><p><span>Adandator closed his eyes. </span><span>He remembered the orc who stood alone against the great army of the empire. </span><span>And now, Crockta was fighting an impossible war against the gods.</span></p><br/><p><span>\"I hope to see you again.” </span><span>At the end of the speech, Crockta passed by Adandator. </span><span>Adandator slumped down. In the middle of the battlefield, he stared up at the sky.</span></p><br/><p><span>“Aklan...”</span></p><br/><p><span>The name of a colleague who walked a long way with him.  </span><span>Then he laughed.</span></p><br/><p><span>“What about you...?”</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Olympus, the residence of the gods. </span><span>There were as many gods as there were people’s beliefs, so no one knew exactly how many different gods existed. No one could say exactly who had a higher status.</span></p><br/><p><span>But it was clear that the most dangerous one was the ‘war god.’ </span><span>He was someone who great his strength in times of slaughter. </span><span>The scream of the battlefield was his breathing and the final ending was his heartbeat.</span></p><br/><p><span>“God.” </span><span>Aklan grabbed his sword and shield. </span><span>\"Victory.\"</span></p><br/><p><span>Then the war god responded. </span><span>A red energy blazed around Aklan’s body. </span><span>The power of the gods fell on the bodies of their believers and the air shook. </span><span>This was the real start.</span></p><br/><p><span>\"It might be elevated by a little propaganda, but everything is weak before the power of the gods.”</span></p><br/><p><span>The orcs’ momentum slowed after the meteor shower from the goddess of magic. Many orcs were killed in that blow. Their formations were broken as fires burned and the earth melted. </span><span>The god of light was still blessing them in the sky. The goddess of mercy might be busy with a female orc, but her healing power raised the expedition army.</span></p><br/><p><span>In addition, countless gods participated in this fight and were helping the expedition. </span><span>The orcs’ assault was simply a last hurrah to escape from that hell.</span></p><br/><p><span>\"Please do your part.”</span></p><br/><p><span>Suddenly, he looked at an orc warrior walking towards him. </span><span>Aklan smiled.</span></p><br/><p><span>“This...”</span></p><br/><p><span>A steel helmet. A giant greatsword. The belt that looked like a demon. Full body tattoos. </span><span>A heinous face.</span></p><br/><p><span>“I’ll kill you.”</span></p><br/><p><span>The orc locked eyes with Aklan. The orc laughed. Aklan raised his sword. </span><span>It was the first time the two of them met, but as soon as their eyes cross, they knew. </span><span>Today, one of the two would die.</span></p><br/><p><span>\"Kuaaaaaaaaaaah!”</span></p><br/><p><span>Aklan roared. At that moment, a red light surrounded his eyes. </span><span>The descent of a god. </span><span>The war god.</span></p><br/><p><span>At the same time, the paladins and priests standing with Aklan ran towards the periphery. Their goal was to help the other gods and destroy the orcs. </span><span>The movements containing the power of the gods broke the rhythm of the battlefield and inspired a new wind.</span></p><br/><p><span>Amongst all of this, Crockta didn’t take his eyes off Aklan.</span></p><br/><p><span>“Crockta...grey god...”</span></p><br/><p><span>But the voice didn’t belong to Aklan. </span><span>It was a voice that was as rough as iron. </span><span>This was the war god.</span></p><br/><p><span>“Die.”</span></p><br/><p><span>At that moment, Crockta was able to see the war god approaching him. However, his body couldn’t move.</span></p><br/><p><span>Fast, strong.</span></p><br/><p><span>Crockta only managed to grab God Slayer by the time the opponent had crossed half the distance to him. </span><span>Once the war god reached him and attacked, Crockta had barely lifted his greatsword. </span><span>As soon as his sword cut Crockta’s chest, Crockta’s greatsword moved through the air.</span></p><br/><p><span>“Keheok!”</span></p><br/><p><span>Blood splattered as he fought back, but the war god was already far away. </span><span>The war god held the shield and sword in front of him, revealing only the flashing eyes under the helmet. </span><span>His eyes glowed red.</span></p><br/><p><span>“You can’t win. I am the war god. The god of invincibility.”</span></p><br/><p><span>Crockta laughed as he glanced at the wound on his chest. </span><span>He looked around. </span><span>All the gods were exerting their strength. The orcs resisted but were gradually crumbling. The flames swallowing the battlefield were burning at a higher temperature.</span></p><br/><p><span>He might not win. </span><span>However, his mind had already pushed such concerns far behind him. He was Crockta, the ‘Northern Conqueror and Empire’s Deficit.’ </span><span>Winning or losing, living or dying, they weren’t his domain.</span></p><br/><p><span>His body, the greatsword, and ‘Bul’tar’ that was always burning within him. </span><span>That was his way.</span></p><br/><p><span>“Did you say the god of war?” </span><span>Crockta placed the greatsword on his shoulder and grinned. </span><span>“You might cause the war, but I will end it.”</span></p><br/><p><span>At first glance, he seemed to be standing casually but his body was continuing to accelerate. He stared closely at the enemy’s face. </span><span>The outline of his blazing fire, the traces of dust floating in the sky, they all grabbed his senses.</span></p><br/><p><span>He could see everything. </span><span>On this battlefield of life and death, lives were continually blinking out. </span><span>Numerous deaths circled around him. The overwhelming net of causality whispered of his death.</span></p><br/><p><span>“Good.”</span></p><br/><p><span>It was suitable. </span><span>This was just the right amount of tension. </span><span>Crockta met the eyes of the war god. </span><span>At that moment, the two blades hit each other.</span></p><br/><p><span>“Bul’tarrrrrrrr──────!”</span></p><br/><p><span>Crockta’s battle cry was filled with physical strength. </span><span>The earth shook. </span><span>Crockta wielded his greatsword at the war god several times. </span><span>Either the shield of the war god or his sword blocked Crockta’s attack.</span></p><br/><p><i><span>Kwaang!</span></i><i><span>Kwaang!</span></i><i><span>Kwaang!</span></i></p><br/><p><i><span>Kwaang!</span></i><i><span>Kwaang!</span></i><i><span>Kwaaaang!</span></i></p><br/><p><span>A loud sound was emitted with each hit. </span><span>Every time they collided, the body of the war god shook like there was an electric shock running through his body.</span></p><br/><p><i><span>Kuaaaaang!</span></i></p><br/><p><span>The shield was distorted.</span></p><br/><p><i><span>Kuaaaaang!</span></i></p><br/><p><span>The war god was pushed down towards the ground.</span></p><br/><p><i><span>Kwaaaaaaaaaaaaaaang!</span></i></p><br/><p><span>His feet were buried in the ground.</span></p><br/><p><span>“Garbage orc──────!”</span></p><br/><p><span>The war god swung his sword angrily; however, due to the strength in Crockta’s sword, his reaction was one beat too late, causing a gap to appear. </span><span>Crockta grinned and said, \"Settle down.\"</span></p><br/><p><span>Then he used all his strength and brandished the greatsword again.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}