{"title": "Chapter 209 - War of the Gods (7)", "id": 209, "volume": 3, "url": "http://boxnovel.org/praise-the-orc-chapter-209-war-of-the-gods-7", "volume_title": "Volume 3", "body": "<h1>Chapter 209 - War of the Gods (7)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 209 - War of the Gods (7)  </span></p><br/><p><span>“Is it up to here </span><i><span>dot</span></i><span>...?” </span><span>Tiyo laughed bitterly while aiming General </span><span>“Anor, are you okay </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>“No...”</span></p><br/><p><span>Anor was staggering after consuming his strength. The undead he summoned were destroyed by the persistent resistance of the expedition forces and the power of the gods. </span><span>The remaining enemies headed towards Tiyo and Anor, the necromancer who summoned the dead and the gnome who slaughtered the soldiers with a magnificent weapon.</span></p><br/><p><span>They were approaching. </span><span>General made a dull clang as it turned round and round. However, Tiyo didn’t have the strength to control it anymore.</span></p><br/><p><span>\"Crockta...” </span><span>Anor saw Crockta fighting with the war god far away. Every time the swords collided, fire flashed. </span></p><br/><p><span>\"He is fighting well </span><i><span>dot</span></i><span>...”</span></p><br/><p><span>It might be because the god was in a human body or because he was overwhelmed by Crockta’s power. Crockta was slowly pushing the enemy back. </span><span>Ordinary human eyes wouldn’t be able to see their movements.</span></p><br/><p><span>“Kahahahahat!”</span></p><br/><p><span>Tiyo fired General. Now it was in an ambiguous shape that wasn’t a rifle or pistol. </span><span>It felt like Tiyo’s current condition. </span><span>However, he raised his gun once again.</span></p><br/><p><span>“Come on </span><i><span>dot</span></i><span>! Tiyo won’t run or hide!” </span><span>The expedition members withdrew at the shout of the small gnome. There were some lower gods, but Tiyo’s momentum overwhelmed them all. </span><span>\"Anor</span><i><span> dot</span></i><span>! Are you ready?”</span></p><br/><p><span>“R-Ready for what?”</span></p><br/><p><span>\"Of course</span><i><span> dot</span></i><span>! Ready to die!”</span></p><br/><p><span>\"I don’t...”</span></p><br/><p><span>\"How wonderful </span><i><span>dot</span></i><span>! Fight until the end!”</span></p><br/><p><span>The expedition members rushed.</span></p><br/><p><span>Tiyo rolled to the side, evading the attacks and firing General. The obviously weakened magic bullets struck them, and while they couldn’t kill them, they were capable enough to make the enemies fall to the ground.</span></p><br/><p><span>Tiyo pulled something out, a dagger, and aimed it at the necks of the fallen enemies. Blood splattered every which way.</span></p><br/><p><span>\"You are lucky to see the knife fighting of Quantes’ Gnomes Division </span><i><span>dot</span></i><span>.”</span></p><br/><p><span>Tiyo wiped the blood off his face and grinned. </span><span>The expedition members rushed angrily. </span><span>Then those who were just killed by Tiyo jumped up and started attacking. Anor exerted his power. </span><span>However, the power of the gods disturbed the necromancer’s energy. The corpses fell back to their rest.</span></p><br/><p><span>\"Kuuack! Tiyo. Attack!\"</span></p><br/><p><span>Anor shouted. Tiyo’s General struck them before the enemies could rearrange themselves.</span></p><br/><p><span>“There are many enemies. The other orcs...”</span></p><br/><p><span>Now Tiyo and Anor were the only ones in the area. The other orcs had died. </span><span>Both sides suffered irreparable damage from the fierce fighting, but the expedition had more numbers and survived until the end.</span></p><br/><p><span>“This...”</span></p><br/><p><span>More members encircled Tiyo Light filled the eyes of a believer as a god entered. The god wanted to finish off Tiyo and Anor.</span></p><br/><p><span>\"Gnome and half-dark elf...you made a foolish choice. Standing on the side of the orcs.” </span><span>One god said. </span><span>\"In particular, the necromancer is a dirty bloodline.”</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Anor’s face turned sour.</span></p><br/><p><span>\"You aren’t associated with the grey god but... I see you well. You guys are worthy of death.”</span></p><br/><p><span>“What the hell are you saying, you bast...”</span></p><br/><p><span>The moment that Anor was going to furiously curse... </span><span>A spear of light flew from the god’s hand. It headed for Anor’s heart.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>Anor stared blankly at it. </span><span>A light flashed. </span><span>There was a moaning sound.</span></p><br/><p><span>“Hoh...”</span></p><br/><p><span>“Tiyo!”</span></p><br/><p><span>Tiyo pushed Anor away and was hit by the spear instead. </span><span>It wasn’t a mortal wound but blood was flowing from his abdomen. Tiyo fell to the ground and coughed up blood.</span></p><br/><p><span>“Kuhuhuhut... Cough, cough! Kuhut, kahahat! Cough!” </span><span>Tiyo jeered while coughing up blood at the same time. </span><span>“Only this much </span><i><span>dot</span></i><span>...?”</span></p><br/><p><span>Tiyo stood up on trembling legs. Anor tried to stop him, but Tiyo pushed his hand away. </span><span>As Tiyo stood up, an expression of admiration appeared on the god’s face.</span></p><br/><p><span>\"Who are you? I’ve never seen a gnome like you.”</span></p><br/><p><span>“Me </span><i><span>dot</span></i><span>?” </span><span>Tiyo raised his chin. He was bloody but his expression was still confident. </span><span>\"I am the son of the great adventurer Hedor, the former captain of Quantes’ Gnomes Garrison and a friend of Crockta and Anor, Tiyo</span><i><span> dot</span></i><span>!”</span></p><br/><p><span>“Tiyo...” </span><span>The god nodded at his dignified declaration. </span><span>\"I'll remember it.”</span></p><br/><p><span>Then he created a light spear again. It flew in a clean line towards Tiyo’s heart. </span><span>It was an unwavering trajectory.</span></p><br/><p><span>“Tiyo!” </span><span>Anor screamed.</span></p><br/><p><span>Tiyo closed his eyes. </span><span>All things born were meant to die in the end. The important thing wasn’t when he died. It was where and how he died. </span><span>He had no regrets in that regard. </span><span>He didn’t want to die in a place that wasn’t worthy. </span><span>Therefore, he was able to laugh at the last moment.</span></p><br/><p><span>\"Adios.\"</span></p><br/><p><span>The light spear headed straight for Tiyo’s heart. </span><span>It flew straight at him. </span><span>It would split his body apart in one blow.</span></p><br/><p><i><span>Kwajik.</span></i></p><br/><p><span>The spear was crushed. </span><span>An arrow had pierced through it and entered the abdomen of a soldier surrounding Tiyo.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>The soldier coughed up blood. </span><span>But that wasn't the end. </span><span>The arrow started to rotate fiercely in his abdomen. </span><span>It became a storm that sucked in the soldiers around it. The bodies of the soldiers were shredded and flew through the air.</span></p><br/><p><span>“Kuaaaaah!”</span></p><br/><p><span>“What?”</span></p><br/><p><span>\"This...!\"</span></p><br/><p><span>Everyone looked at the flying flesh with shock. </span><span>It was an incredible sight.</span></p><br/><p><span>There. </span><span>A goblin was holding a bow.</span></p><br/><p><span>\"Goblin...?”</span></p><br/><p><span>However, the goblin didn’t care about them. His eyes were only focused on Tiyo, who was ready to die.</span></p><br/><p><span>“Hey </span><i><span>kyak</span></i><span>!”</span></p><br/><p><span>Tiyo’s eyes widened.</span></p><br/><p><span>\"Y-You...!”</span></p><br/><p><span>“Hedor’s son</span><i><span> kyak</span></i><span>! Captain of Quantes’ Gnome Garrison</span><i><span> kyak</span></i><span>! Crockta’s follower! Why did you omit one </span><i><span>kyak</span></i><span>?” </span><span>The goblin pointed to his chest and laughed. </span><span>\"Tiyo, the goblin Kiao’s disciple</span><i><span> kyak</span></i><span>!”</span></p><br/><p><span>The goblin who pursued the path of the strong, the shooter who wiped out the enemy by causing a spatiotemporal storm, Kiao.</span></p><br/><p><span>\"How did you come here </span><i><span>dot</span></i><span>?”</span></p><br/><p><span>\"Don’t complain </span><i><span>kyak</span></i><span>! You were yelling at me to save you </span><i><span>kyak</span></i><span>!”</span></p><br/><p><span>\"I never said that </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>\"How funny that you’re trying to deny it</span><i><span> kyak</span></i><span>!”</span></p><br/><p><span>\"B-Bullshit </span><i><span>dot</span></i><span>!”</span></p><br/><p><span>\"Adios </span><i><span>kyak</span></i><span>? Adios</span><i><span> kyak</span></i><span>! I will play alone </span><i><span>kyak</span></i><span>!”</span></p><br/><p><span>“This bastard!” </span><span>The face of the god with the light spear distorted as he watched Tiyo and Kiao fight. </span><span>\"Where did this monster come fro...!”</span></p><br/><p><span>The answer came from elsewhere.</span></p><br/><p><span>“Say it again.”</span></p><br/><p><span>The god flinched. A huge shadow covered his body.</span></p><br/><p><span>“Monster, cancel, what you said.”</span></p><br/><p><span>The god turned his head. </span><span>A giant cyclops was looking down at him.</span></p><br/><p><span>“We aren’t! Monsters! Cancel it!” </span><span>The cyclops shouted and swung his fist. The god barely escaped but had to roll across the ground in an ugly manner. </span><span>“I am Hawkeye! He is Kiao! We aren’t monsters!”</span></p><br/><p><span>It was the giant Hawkeye, who fought with Crockta.</span></p><br/><p><span>The expedition panicked at the sudden appearance of the monsters. It wasn’t just Kiao and Hawkeye. There was a varity of species, a centaur, a lich, an unknown robed person, and a terrifying ogre.</span></p><br/><p><span>“How are you...?”</span></p><br/><p><span>\"Came with the orcs! We! Go together!”</span></p><br/><p><span>The cyclops pointed to another direction.</span></p><br/><p><span>There.</span></p><br/><p><span>The northern orcs were charging forward. The enemies were easily broken when the orcs attacked the expedition. </span><span>The divine message spread in the north as well. Gushantimur’s friends heard about it and came down with the Great Clan orcs to help Crockta.</span></p><br/><p><span>The balance was reversing again.</span></p><br/><p><span>“You guys...” </span><span>The faces of the gods watching distorted. </span><span>“Taste the true wrath of the gods!”</span></p><br/><p><span>Their bodies shone white. Then their power started to wriggle. The expedition members were screaming from the pressure but they didn’t care. </span><span>Tiyo, Anor, and the creatures retreated with an alert expression. They could feel that the gods were really angry.</span></p><br/><p><span>A storm of power headed to them.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Kumarak laughed at the appearance of the orcs he had never seen before.</span></p><br/><p><span>“I don’t know what is going on, but I will crush you!”</span></p><br/><p><span>He looked up at the dwarf holding the hammer.</span></p><br/><p><span>“We won’t lose!”</span></p><br/><p><span>The dwarf, the father of all underground creatures, Tartatod looked down at him with cold eyes.</span></p><br/><p><span>\"It doesn’t matter. It is obvious that you will die right now.”</span></p><br/><p><span>“Kulkulkul! Kill grrung! Warriors aren’t afraid of death!”</span></p><br/><p><span>\"I will get revenge for Almutad today.”</span></p><br/><p><span>The dwarf raised his hammer. </span><span>Then he brought it down with no hesitation. </span><span>It was an intense blow that would split anyone’s head apart. It contained enough power to every cause an earthquake.</span></p><br/><p><span>But just before the hammer hit Kumarak. </span><span>The dwarf felt something targeting his neck and heart at the same time, and reflexively twisted his body.</span></p><br/><p><span>“What?”</span></p><br/><p><span>Sharp blades passed by him. Blood dripped down. </span><span>Tartatod backed away, but the double swords continued to chase him. </span><span>The source was a dark elf with black skin and grey hair.</span></p><br/><p><span>\"There will be many interesting people on the continent. Those words are true.” </span><span>He waved his double swords and stared at Tartatod. Killing intent was emitted from his body. </span><span>\"Gods, are there any better opponents?”</span></p><br/><p><span>“Who are you?”</span></p><br/><p><span>He smiled faintly. Then he briefly replied, </span><span>“Driden.”</span></p><br/><p><span>Soon after, he disappeared. Tartatod felt something aim at him from behind and leaned forward. Then a blade stabbed his side. It was a whirlwind linked attack that was hard to stop. </span><span>The genius Driden, who competed with Crockta, had come down to the continent with the Great Clan.</span></p><br/><p><span>Tartatod shouted. </span><span>Now Tartatod’s opponent was Driden The two of them wielded their weapons towards each other.</span></p><br/><p><span>“They are the north...” </span><span>The goddess of mercy frowned.</span></p><br/><p><span>She was overpowering Anya in a place not far away. </span><span>She was covered with multiple stab wounds from Anya’s axe. The goddess treated herself with her own power, but she was stained with blood.</span></p><br/><p><span>“I have to help. The battlefield is becoming strange.”</span></p><br/><p><span>The northern orcs were destroying the expedition. The goddess of mercy’s expression soured. </span><span>Her mind was troubled.</span></p><br/><p><span>Anya laughed, </span><span>“Where do you want to go? It is an honor to die by the goddess of mercy.”</span></p><br/><p><span>“......”</span></p><br/><p><span>The goddess of mercy’s lips firmed. Then she started to put strong pressure on Anya’s neck. </span><span>Anya’s complexion changed. Her face turned white as she ran out of air.</span></p><br/><p><span>“Kuooock...”</span></p><br/><p><span>In the midst of it, Anya scoffed. </span><span>She wouldn’t yield to the enemy under any circumstances. </span><span>There was a warrior who admired that.</span></p><br/><p><span>\"There are female orcs with spirit on the continent!”</span></p><br/><p><span>The goddess of mercy looked around. </span><span>An old orc with a giant hammer stood there.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Wallachwi collapsed on the ground and sighed. He used all the magic he had, but it wasn’t enough to overcome the power of the gods.</span></p><br/><p><span>“Foolish guy.” </span><span>The old man declared. His body was half eaten by darkness due to Wallachwi’s magic. </span><span>\"Did you really think you would win?”</span></p><br/><p><span>“Kuhul...hul!”</span></p><br/><p><span>\"That laugh makes me feel bad to the end.” </span><span>His face twitched. </span><span>\"Laugh a lot. If you want to laugh underground, you can never laugh at all.”</span></p><br/><p><span>Wallachwi laughed again, but the god’s hands grasped his neck. Wallachwi could no longer make any noise.</span></p><br/><p><span>“Die.”</span></p><br/><p><span>Light emerged from the god’s body. Vitality began to disappear from Wallachwi’s body. </span><span>His eyes became faint. </span><span>Wallachwi wanted to give one last laugh.</span></p><br/><p><span>He had to laugh. He was the abyss seeker, the shaman who wanted to touch the bottom of the endless darkness. </span><span>He looked deep into the abyss and the abyss looked back at him. He always laughed so that he wouldn’t be swallowed by the unknown darkness, and so he wouldn’t choke on the fear.</span></p><br/><p><span>Kuhul...hul!</span></p><br/><p><span>But there was no sound. </span><span>Too bad. </span><span>In the distant, invisible darkness, the abyss was licking at him. </span><span>The moment his mind was about to become faint.</span></p><br/><p><span>Suddenly, a loud laugh rang in his ears and woke him up.</span></p><br/><p><span>“Kyulkyulkyulkyulkyulkyul!”</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}