{"title": "Chapter 201 - Opening of the War (1)", "id": 201, "volume": 3, "url": "http://boxnovel.org/praise-the-orc-chapter-201-opening-of-the-war-1", "volume_title": "Volume 3", "body": "<h1>Chapter 201 - Opening of the War (1)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 201 - Opening of the War (1)</span></p><br/><p><span>The military expedition also received a cold shoulder in Quantes. </span><span>Crockta was a hero who saved the city from the cursed item called the ‘Demon’s Mouth’, but Aklan didn’t care, as he had now stopped worrying about Crockta.</span></p><br/><p><span>No matter what Crockta did, he was an enemy. A saint could kill a saint, and a wicked man could kill a wicked man. </span><span>He erased all previous doubts.</span></p><br/><p><span>\"Something’s wrong.\"</span></p><br/><p><span>Peros was a noble who knew Anail’s back alley very well. </span><span>His plan to put pressure on Thompson failed.</span></p><br/><p><span>“The head of the underworld has changed, and the new leader is Crockta’s friend. Rather, the messenger was beaten to death...”</span></p><br/><p><span>“Friend...” </span><span>Aklan laughed. </span><span>“It is funny.”</span></p><br/><p><span>“T-That’s right.”</span></p><br/><p><span>\"Thompson said the same thing.”</span></p><br/><p><span>“Really? He has really wide feet. Hahahat...”</span></p><br/><p><span>“......”</span></p><br/><p><span>“Haha...”</span></p><br/><p><span>Peros laughed awkwardly. </span><span>The aura coming from Aklan was sharper and darker than ever.</span></p><br/><p><span>“It doesn’t matter. This is a little inconvenient, but having extra help is unnecessary. We have a sufficient number of troops and plenty of funds.\"</span></p><br/><p><span>They had difficulties in some of the major cities, but there were enough volunteers. </span><span>The scale of the military expedition was unthinkable, and was perhaps the largest number of people in history gathered under a single flag. </span><span>The orcs would be trampled on by this army and forgotten.</span></p><br/><p><span>“The gods are helping us.”</span></p><br/><p><span>\"Yes...”</span></p><br/><p><span>\"The gods are still whispering. In the end, we will win.”</span></p><br/><p><span>The expedition didn’t need anything else. </span><span>Aklan was convinced. </span><span>No matter how strong the orcs were, they wouldn’t be able to resist the wrath of the gods.</span></p><br/><p><span>\"Victory is only a matter of time. Please relax your mind.”</span></p><br/><p><span>An unknown power emerged from Aklan as he said this. </span><span>He gripped his fists tightly. </span><span>His body shuddered as his whole body filled with an unknown strength.</span></p><br/><p><span>“The war god has spoken.”</span></p><br/><p><span>\"Ah, I understand.”</span></p><br/><p><span>Peros stepped back, confused by Aklan’s changed appearance. </span><span>The smell of fanaticism was coming from Aklan. </span><span>Adandator watched Aklan and asked, “Are you okay?”</span></p><br/><p><span>\"I am as okay as ever.”</span></p><br/><p><span>\"You know...” </span><span>Adandator studied Aklan and sighed. </span><span>He could see that Aklan was in an unknown state. </span><span>\"Any more divine power will break your body.”</span></p><br/><p><span>The power of a god dwelt in Aklan. </span><span>It was an arrangement for the future war. </span><span>Adandator didn’t know what the war god was planning, but a tremendous amount of divine power was entering Aklan.</span></p><br/><p><span>Aklan smiled and said, \"It's okay. It is different from what you are concerned about. I am more powerful than ever.”</span></p><br/><p><span>“...Yes. You would know best.”</span></p><br/><p><span>Adandator shrugged. In fact, he didn’t care about Aklan’s condition.</span></p><br/><p><span>“We are finally at Orcrox.”</span></p><br/><p><span>“Yes. I can see the end.”</span></p><br/><p><span>Aklan smiled. </span><span>At last, this expedition was heading towards the climax. </span><span>The expedition passed through Quantes and arrived in Anail. </span><span>They also didn’t receive hospitality in Anail. The king of the underworld, Jeremy, and Thompson were close to Crockta.</span></p><br/><p><span>Everywhere they went, they saw people who saw Crockta as their savior.</span></p><br/><p><span>He was the one who made the volunteer group, the hero who saved a village, the honorary citizen who exposed the ugly side of the mayor, the warrior who stopped the demon in a city, and the savior of many influential people.</span></p><br/><p><span>But he had brought the wrath of the gods on him. </span><span>No matter what Crockta had done, he was defined by the last line. </span><span>Anyway, everything was decided by the gods. </span><span>Human work was useless against divine matters.</span></p><br/><p><span>The lead riders waved their flags. They reported something to Aklan and Adandator. </span><span>Indeed, as they said, something could be seen in the distance. </span><span>All the leaders were agitated. </span><span>Aklan smiled.</span></p><br/><p><span>They were orcs. </span><span>They had come out, rather than hiding in Orcrox.</span></p><br/><p><span>A battlefield suitable for the climax. </span><span>It was the opening of the great war.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Ian looked at Yiyu with a mouth full of Burger King’s extra large burger.</span></p><br/><p><span>\"Why do you look like that?” she asked.</span></p><br/><p><span>“You’re acting like a beggar.”</span></p><br/><p><span>“......”</span></p><br/><p><span>Yiyu snorted before eating her hamburger again and drinking some soda with her straw. </span><span>Ian picked up some fries and placed them in his mouth.</span></p><br/><p><span>“Eat slowly.”</span></p><br/><p><span>He had accessed Elder Lord for so long that he hadn’t seen her in a while, so they went out together.</span></p><br/><p><span>\"You know what? There will be another great war in Elder Lord. Will Oppa be taking part? You have been living in the game lately.”</span></p><br/><p><span>The fight between the expedition and the orcs was a hot topic in reality. </span><span>This time, users weren’t involved since it was a dispute between NPCs. Thus, it was difficult to predict who would win. </span><span>On the gambling sites, the dividends for who would win were quiet even, while users who wanted to fight were waiting impatiently.</span></p><br/><p><span>As well as the expedition, the orcs of Orcrox were fighting together, causing a lot of confusion.</span></p><br/><p><span>\"Let's see...\"</span></p><br/><p><span>Ian’s voice trailed off. </span><span>In fact, he couldn’t not go. </span><span>He was one of the parties involved in the war, but Ian couldn’t tell her that. </span><span>He started stretching inside the fast food restaurant.</span></p><br/><p><span>\"Isn’t Oppa a ranker now? You aren’t still a beginner, are you? A few of my friends are playing it full-time. Tsk tsk. They don’t study and play games instead.”</span></p><br/><p><span>\"What have you been doing in the meantime?”</span></p><br/><p><span>Yiyu laughed with the straw in her mouth. </span><span>\"I will receive a scholarship this semester.”</span></p><br/><p><span>\"I’m not expecting anything, so you don’t have to.”</span></p><br/><p><span>“Really.”</span></p><br/><p><span>\"Just work hard.”</span></p><br/><p><span>\"Wow, you don’t believe your little sister.”</span></p><br/><p><span>“It will be bad if you overdo it.”</span></p><br/><p><span>The expression of her goal was good, but if she couldn’t keep her word after declaring it so badly, she would be the most embarrassed.</span></p><br/><p><span>\"Hrmm...\" </span><span>Ian looked at Yiyu and smiled as he said, “Jung Yiyu.”</span></p><br/><p><span>“Huh?”</span></p><br/><p><span>“Can you do it?”</span></p><br/><p><span>\"Haven’t I always done well?”</span></p><br/><p><span>\"Then I'm glad.”</span></p><br/><p><span>Ian nodded. </span><span>As he told Yoo Jaehan, he refrained from playing Elder Lord often and was going to stay away from dangerous events. </span><span>But it didn’t help the situation. </span><span>His assimilation rate was still at 100%.</span></p><br/><p><span>The grey god no longer spoke to him, but her words about dying in Elder Lord were still valid. </span><span>He wasn’t a game player anymore. His status window had also disappeared. There was no such thing as skill level or item rating. </span><span>The moment he accessed Elder Lord, he became the orc warrior Crockta.</span></p><br/><p><span>\"Then once things finish, I should go...”</span></p><br/><p><span>\"What? Where? Why?\" </span><span>Anxiety filled Yiyu’s eyes. </span></p><br/><p><span>Ian shrugged and replied, </span><span>\"I was thinking about going on a trip...”</span></p><br/><p><span>\"Alone?\"</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>\"I will go too!\"</span></p><br/><p><span>\"You will?”</span></p><br/><p><span>Ian laughed as he saw Yiyu’s excitement. </span><span>There was a battle ahead of him. </span><span>He couldn’t step back here. Elder Lord might be a game in the past, but he couldn’t escape now that he knew they were alive.</span></p><br/><p><span>He was Crockta. </span><span>Due to that, all the orcs were being threatened. </span><span>He vowed to avoid dangerous situations but he couldn’t do so. The moment he joined Elder Lord, he became Crockta and thought like an orc warrior. </span><span>He wanted to consider Yiyu but the moment he became Crockta, living as a warrior became more important than anything else.</span></p><br/><p><span>\"I know all about your trip,” Yiyu said. </span></p><br/><p><span>Ian was confused.</span></p><br/><p><span>“Huh?”</span></p><br/><p><span>\"You aren’t going on a trip alone.”</span></p><br/><p><span>“Uhh...”</span></p><br/><p><span>\"Aren’t I quick to notice?”</span></p><br/><p><span>Ian rolled his eyes.</span></p><br/><p><span>Yiyu grinned. </span><span>“Don’t you have a girlfriend?”</span></p><br/><p><span>“...Eh?”</span></p><br/><p><span>\"Oppa finally got a girlfriend and you’re thinking about marriage. So you say that you’re going alone. It is great, so I respect Oppa’s thoughts. Of course, you should introduce me to your girlfriend.”</span></p><br/><p><span>“No...”</span></p><br/><p><span>\"Is she perhaps younger than me?”</span></p><br/><p><span>“That...”</span></p><br/><p><span>\"I’ll still understand. Don’t worry about me. I originally do well alone. I don’t want you to sacrifice yourself because of me.”</span></p><br/><p><span>\"Right now, I am sacrificing the value of those hamburgers...”</span></p><br/><p><span>\"Quiet!” </span><span>Ian smiled as Yiyu pointed her finger at him and placed the last piece of hamburger in her mouth. </span><span>\"Anyway, Oppa should do whatever you want. Have I ever been in an accident when Oppa wasn’t with me? No?”</span></p><br/><p><span>When Ian was a soldier, she had stayed with some relatives. They weren’t relatives with a strong affection for their kin. </span><span>Rather, they were more interested in Ian’s money. </span><span>It wasn’t a comfortable place, but Yiyu never complained or caused problems. She behaved too well.</span></p><br/><p><span>Ian smiled bitterly. </span><span>He knew. Yiyu had endured some difficult times. People would experienced hardships would become tougher. Yiyu was probably stronger than he knew.</span></p><br/><p><span>\"I'm pretty and have a good head, so I live in a comfortable world. Oppa doesn’t have to worry about me.”</span></p><br/><p><span>\"Good head?”</span></p><br/><p><span>\"Oh, my grades are like this because I don’t study! My mind is good.”</span></p><br/><p><span>“I see.”</span></p><br/><p><span>Ian laughed. </span><span>His will had been written since he was a soldier. Between then and now, nothing had changed in the contents of the will. </span><span>Furthermore, he could trust his teacher Baek Hanho. </span><span>Yiyu hadn’t known it, but Baek Hanho had kept watch to see if her relatives would harass her. </span><span>He would protect Yiyu if something happened to Ian.</span></p><br/><p><span>\"Let’s really go on a trip later. Where do you want to go?”</span></p><br/><p><span>\"The Maldives!\"</span></p><br/><p><span>“Okay. Let's go.\"</span></p><br/><p><span>\"Kyah, really?”</span></p><br/><p><span>This was the most important thing. </span><span>He couldn’t die.</span></p><br/><p><span>\"When have I ever lied?”</span></p><br/><p><span>\"Indeed. I acknowledge that.”</span></p><br/><p><span>Ian had always survived. This time would be the same as well. He would become Crockta and defend Orcrox. </span><span>When Crockta held God Slayer, he was confident that he couldn’t lose to anyone. </span></p><br/><p><span> Once this fight ended, he had the feeling that the grey god would appear. Then he would ask her the question he really wanted to ask.</span></p><br/><p><span>***</span></p><br/><p><span>-</span><i><span>Hello.</span></i><i><span>Thank you to the viewers who have always loved the Undergames Channel.</span></i></p><br/><p><span>-</span><i><span>Today is the day when the battle between the orcs and the expedition will occur. Everyone has been looking forward to it.</span></i><i><span>Yes, that is today!</span></i><i><span>Do you see the huge number of people?</span></i><i><span>That is the expedition.</span></i></p><br/><p><span>-</span><i><span>Incredible.</span></i></p><br/><p><span>-</span><i><span>It can be compared to the battle with the imperial army.</span></i><i><span>No, a lot more.</span></i><i><span>Many times larger.</span></i></p><br/><p><span>-</span><i><span>It is true that many of the expedition members aren’t trained, but that doesn’t matter if so many people are gathered.</span></i><i><span>Look.</span></i><i><span>There are knights, soldiers, and many volunteers. Who can deal with all this?</span></i></p><br/><p><span>-</span><i><span>Still, won’t the orcs show something?</span></i></p><br/><p><span>-</span><i><span>That’s right!</span></i><i><span>We are looking forward to it!</span></i><i><span>The orc who always show us something!</span></i><i><span>The Northern Conqueror and Emperor’s Deficit!</span></i><i><span>The idol of He’s an Orc, yet still Praiseworthy, Crockta!</span></i><i><span>A warrior who always achieves the impossible, so we can’t predict the outcome.</span></i><i><span>In addition, many of the legendary NPCs apart from Crockta are participating.</span></i><i><span>The result still remains to be seen.</span></i></p><br/><p><span>-</span><i><span>Legendary NPCs?</span></i></p><br/><p><span>-</span><i><span>Yes.</span></i><i><span>NPCs like Zankus and Kumarak...</span></i><i><span>I will explain it in parts.</span></i></p><br/><p><i><span>-Haha.</span></i><i><span>You are very prepared today.</span></i></p><br/><p><span>-</span><i><span>As a commentator, I always have to study.</span></i><i><span>That is my obligation.</span></i><i><span>Huhuhut.</span></i></p><br/><p><span>-</span><i><span>How wonderful.</span></i><i><span>Ah, right now!</span></i></p><br/><p><span>The screen showed something. </span><span>In the orc camp, a bunch of people moved to the front.</span></p><br/><p><span>-</span><i><span>What is that?</span></i></p><br/><p><span>-</span><i><span>Ah, that...!</span></i></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>‘Northern Conqueror’ Crockta.</span></p><br/><p><span>‘Sun Killer’ Zankus.</span></p><br/><p><span>‘Mountain Smasher’ Kumarak.</span></p><br/><p><span>The three of them appeared first. </span><span>However, that wasn’t the end. </span></p><br/><p><span>The worst fighter who led a group of berserkers to massacre the human earl for Lenox’s revenge. </span><span>‘Mad Slaughterer’ Anya.</span></p><br/><p><span>A magician who was like a madman but traveled to the ends of the world. </span><span>‘Abyss Seeker’ Wallachwi.</span></p><br/><p><span>“Great...”</span></p><br/><p><span>They appeared.</span></p><br/><p><span>“Hehe, this battlefield suits me <em>dot</em>!”</span></p><br/><p><span>“This fight...”</span></p><br/><p><span>The ‘Magic Bullets Berserker’ Tiyo who used an artifact to launch a bombardment. </span><span>The ‘Ruler of the Dead’ Anor, who raised the dead using necromancy. </span><span>The orcs who recently started to make a name for themselves appeared in turn. ‘Bandit Slaughterer’ Keruta, ‘Purgatory Incarnation’ Malaka, ‘Drunk Fighter’ Asulchwi, etc.</span></p><br/><p><span>“This is due to a divine message?”</span></p><br/><p><span>\"If you want to destroy the orcs, the whole world should come.”</span></p><br/><p><span>“Kulkulkul, there is nothing better than fighting when drunk.”</span></p><br/><p><span>The thrilling sight of those who were called one-man armies standing side by side. </span><span>An army of one-man armies. </span><span>The expedition members were scared. </span><span>The strongest people with high fame or infamy were gathered in one place.</span></p><br/><p><span>\"Huh...they are really gathered together.”</span></p><br/><p><span>“All the monsters...”</span></p><br/><p><span>“Can we win...?”</span></p><br/><p><span>The morale of the expedition began to fall. </span><span>They had regarded this war as easy to win due to their overwhelming numbers. It was a thought that only a large army could have. </span><span>The orcs looked shabby compared to the expedition.</span></p><br/><p><span>But now...</span></p><br/><p><span>They felt fear as they saw the orcs standing at the forefront. </span><span>They had worried about Crockta, but the fearsome existences, whose names had been known longer, also appeared.</span></p><br/><p><span>\"Don't be scared! Stay calm!”</span></p><br/><p><span>Aklan frantically shouted. </span><span>However, their shaking wasn’t easily calmed. The entire expedition stalled. Aklan urged the riders.</span></p><br/><p><span>“The flags...”</span></p><br/><p><span>At that moment, the orcs looked at each other and discussed something. Then the orcs laughed and pushed one forward. </span><span>He came out of the camp.</span></p><br/><p><span>It was Crockta. </span><span>Crockta, with the huge greatsword on his shoulder and the silver helmet, walked in front of the expedition with a dignified appearance, just like when he fought the empire. </span><span>He was calm in front of so many soldiers.</span></p><br/><p><span>Crockta reached a location where his voice would reach the expedition members, and opened his mouth as the representative of the orc army.</span></p><br/><p><span>\"I don’t think there is anything to say, so let’s start quickly.”</span></p><br/><p><span>His voice rang out through the plains. </span><span>At the same time, killing intent rose from the orcs.</span></p><br/><p><span>\"All at once...” </span><span>Crockta smiled as a huge aura was emitted from him. </span><span>“Come.”</span></p><br/><p>TL: I figured out that the author used the English pronunciation spelling for God, rather than the actual Korean word. Therefore, I have decided to change New Slayer to God Slayer from now on.</p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}