{"title": "Chapter 217 - Tumult (3)", "id": 217, "volume": 3, "url": "http://boxnovel.org/praise-the-orc-chapter-217-tumult-3", "volume_title": "Volume 3", "body": "<h1>Chapter 217 - Tumult (3)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 217 - Tumult (3)</span></p><br/><p><span>The users remaining in Elder Lord gathered in the safety zone of each city, according to government orders. </span><span>The broadcasters who connected reality to Elder Lord became envoys of the government. They received a small reward for cooperating with the government.</span></p><br/><p><span>At first, there was a lot of confusion. But once the situation settled down, the users showed their usual behavior patterns. </span><span>Fortunately, there were many high-level users left, so it was easy to solve the problem of food for survival.</span></p><br/><p><span>“What are the government people doing?”</span></p><br/><p><span>“They should do their work properly. But the Elsaco people are worse. Making a game like this...”</span></p><br/><p><span>A user’s voice trailed off into silence. </span><span>The world of Elder Lord was just too realistic. </span><span>They had stayed here for so long that they were confused about whether they were playing a game, or if they were really part of this world.</span></p><br/><p><span>“Aren’t we really NPCs and aren’t the other memories a lie? If our brains...”</span></p><br/><p><span>This was like an SF novel.</span></p><br/><p><span>\"Anyway, I don’t have to go to work.”</span></p><br/><p><span>\"Yes. Should we thank the grey god?”</span></p><br/><p><span>\"Stop talking nonsense. We don’t know when this situation will end so saying that...”</span></p><br/><p><span>“It is a joke. Who would actually think that?”</span></p><br/><p><span>\"Good. I hope everyone feels comfortable. I will go and eat now.”</span></p><br/><p><span>“Eat? You’re going to eat at a time like this?”</span></p><br/><p><span>\"We're not in elementary school... we need to take care of our own food. Don’t worry, I’ll come back.”</span></p><br/><p><span>“Are you going alone?”</span></p><br/><p><span>\"I have a brother who is treating me. Ah, is your level low?”</span></p><br/><p><span>\"Well, I am relatively new.”</span></p><br/><p><span>There were disputes relating to the levels and assets of Elder Lord. </span><span>The low-level users were frightened and stayed in tents while the high-level users continued their activities and enjoyed various luxuries. </span><span>In order to control them, the rankers and those connected to reality were busy.</span></p><br/><p><span>“Shouldn’t we say something?”</span></p><br/><p><span>“Leave it alone,” Rommel said as he watched the spectacle. </span><span>“We can’t control everyone. It will be up to them if there is a problem.”</span></p><br/><p><span>The world of Elder Lord was different from reality, as it was a place where they could die from a sword or through an accident. </span><span>Now that this situation was happening, the penalty was ‘death’ itself. </span><span>He needed to take care of himself.</span></p><br/><p><span>\"What are those outside saying?”</span></p><br/><p><span>“It is all the same. The experts are analyzing this. I’m tired of them not saying anything.”</span></p><br/><p><span>“......”</span></p><br/><p><span>Rommel felt anxious. </span><span>Efforts had been at a standstill for a long time. When thinking of the time difference between the reality and Elder Lord, it had been at least a week. </span><span>Nevertheless, there was no news from outside. They repeated the same thing from the beginning until now.</span></p><br/><p><span>\"Let's go see the mayor again.”</span></p><br/><p><span>\"Ah, I’ll call a few more people to come along.”</span></p><br/><p><span>\"It's okay. I’ll go alone. I can protect my body. There will be no problems.”</span></p><br/><p><span>\"Will you be okay?”</span></p><br/><p><span>“Don't worry.”</span></p><br/><p><span>Rommel left the ‘user village’. </span><span>They were trapped here, while the world of Elder Lord was still flowing on. The outside demanded information, so Rommel often left to figure it out. </span><span>Rommel, who was famous as a genius leader, was well known among the NPCs and was well suited to collecting information. </span><span>Appalachia’s mayor was familiar with Rommel, so after the situation occurred, Rommel often met him in order to talk.</span></p><br/><p><span>Rommel’s face brightened as he greeted a familiar guard. The mayor welcomed Rommel into the reception room.</span></p><br/><p><span>“Ohh, Rommel! You came again, it is such a pleasure. What brings you here today?”</span></p><br/><p><span>\"I just wanted to thank you. I really appreciate you arranging a spot for us on the outskirts of the city. Everybody is doing well thanks to you.”</span></p><br/><p><span>\"Hahaha, it is nothing. This matter involves all those cursed by the stars. In particular, the era now...we should help each other.” </span><span>He stroked his mustache and said, </span><span>\"Well, I suppose you are wondering about the grey god.\"</span></p><br/><p><span>\"That isn’t necessarily the case.”</span></p><br/><p><span>“Haha, there is no need to act like that. I will tell you that the strongest people are gathered and heading north to stop the grey god. But they are currently experiencing obstacles.”</span></p><br/><p><span>“Obstacles...?”</span></p><br/><p><span>\"The demons, whom we thought had disappeared, have revived and are attacking them. Furthermore, they are supported by the power of the grey god, so it will take some time. Well...” </span><span>The mayor smiled. </span><span>\"All the gods are with us. There won’t be any problems.”</span></p><br/><p><span>‘All the gods teamed up, but they didn’t win against the orcs.’</span></p><br/><p><span>Rommel swallowed back his thoughts. </span><span>Those powerful orcs were now allies. Furthermore, all of the species from the north and the continent had joined forces with the gods.</span></p><br/><p><span>“What is the grey god?”</span></p><br/><p><span>“We don’t know very well. An ancient god who fell due to the gods a long time ago... I don’t know why, but she wants to destroy this world and has somehow appeared again. Hah.”</span></p><br/><p><span>This was already known information. It wasn’t just Appalachia. Users gathered in cities like Maillard, Arnin and those in the empire and collected similar information. </span><span>If game logic held up, the only way to save themselves was to dispose of the grey god.</span></p><br/><p><span>If the grey god won, the world would perish and all lives in Elder Lord would be wiped out. The users would also die. </span><span>Death in Elder Lord would lead to death in reality. </span><span>They had goosebumps thinking about it. </span><span>It was a terrible quest.</span></p><br/><p><span>The distressed Rommel asked, </span><span>\"Then should an army be sent? A great number of orcs and expedition members were wiped out...”</span></p><br/><p><span>“It is said that the demons can’t be defeated in a conventional manner. Any ordinary people would die straight away, so they would just be a hindrance...”</span></p><br/><p><span>\"Is there no time limit until the grey god destroys the world?”</span></p><br/><p><span>\"I don’t know. It is said that the grey god is gradually using her magic, but I don’t know how long it will take.”</span></p><br/><p><span>At that moment. </span><span>Something appeared in front of Rommel’s eyes.</span></p><br/><p><span>A system message.</span></p><br/><p><span>[The last quest.]</span></p><br/><p><span>[The grey god is still alive. The power of the grey god is increasing rapidly. The world is heading towards a new beginning. I am sorry to all of you, but with your sacrifice, the universe can be conceived again.]</span></p><br/><p><span>[D-7 until the destruction of the world.]</span></p><br/><p><span>[In one week, at sunrise, the world will perish.]</span></p><br/><p><span>Rommel was speechless for a moment. </span><span>The mayor didn’t know anything and just smiled.</span></p><br/><p><span>“In any case, don’t worry so much. Isn’t Crockta there?”</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>The dedicated cameraman for Undergames Channel in Elder Lord, Polaroid grabbed his head. </span><span>His broadcast program was shown on the Undergames Channel. It was now being used to talk to the government officials.</span></p><br/><p><span>However, he received a secret proposal not long ago.</span></p><br/><p><span>「Sanghyun.」</span></p><br/><p><span>「If this succeeds, it will be a jackpot. You will sit on a pile of money. 」</span></p><br/><p><span>「We will deal with any problems. 」</span></p><br/><p><span>While the government officials were away, the Undergames Channel asked him something. </span><span>Go to the north and relay the battle between the gods and the grey god. </span><span>Of course, his life would be at risk. However, if successful, the world would be thrilled by the best video. A fight with the lives of everyone in the world on the line. </span><span>The expedition battle couldn’t be compared to the ‘true war of the gods.’</span></p><br/><p><span>The director tried to convince him by saying it would be the greatest broadcast since ELder Lord began.</span></p><br/><p><span>「Sanghyun, we have to hurry. Do you think we are the only ones doing this? BJs from other broadcasting networks will be trying to sneak in through the backdoor.  It isn’t known, but I’m sure there are some people who are already going. Don’t you know that BJs aren’t sane? If you don’t go, then you will miss the jackpot.」</span></p><br/><p><span>Polaroid closed his eyes. </span><span>His life was at stake. </span><span>When he was relaying wars, he was caught up in the terrible battle and died several times. At that time, he could be brave then because he wouldn’t receive any penalties when dying. </span><span>But now his death meant death in reality; money and fame was worth nothing compared to his life.</span></p><br/><p><span>He had a wife and child. It was a honeymoon. When his wife had handed him his newborn daughter with a haggard face, he had cried in front of his wife for the first time. It was an overwhelming feeling he had never felt before.</span></p><br/><p><span>For them, he couldn’t die.</span></p><br/><p><span>“I’m sorry. I...”</span></p><br/><p><span>At that moment.</span></p><br/><p><span>[The last quest.]</span></p><br/><p><span>[The grey god is still alive. The power of the grey god is increasing rapidly. The world is heading towards a new beginning. I am sorry to all of you, but with your sacrifice, the universe can be conceived again.]</span></p><br/><p><span>[D-7 until the destruction of the world.]</span></p><br/><p><span>[In one week, at sunrise, the world will perish.]</span></p><br/><p><span>Polaroid froze after reading the system messages. </span><span>The director he was talking with also fell silent. </span><span>Polaroid was silent for a while. </span><span>Some time passed before the director spoke again.</span></p><br/><p><span>[Sanghyun. I’m sorry to say this to you.」</span></p><br/><p><span>「The government doesn’t have a method. There was nothing inside Albino. Right now, no one has any idea how the game works. Experts? They don’t know anything. Some people say that this is a paranormal phenomenon. All governments in the world are keeping this a secret.」</span></p><br/><p><span>「So, Sanghyun.」</span></p><br/><p><span>Polaroid blankly listened to the words.</span></p><br/><p><span>「You understand this time right? I will take care of your family. There is no need to worry about them. The best thing is for you to come back alive...but they will never encounter any problems.」</span></p><br/><p><span>The director sighed before continuing.</span></p><br/><p><span>「I will make sure that your wife and daughter live comfortably for the rest of their lives. I know this might be rubbish but honestly, if you don’t do the broadcast and just die, I can’t help you. Government compensation? How do you think it will go? Do you understand? There aren’t just one or two trapped people. It varies from unit to unit. The compensation won’t be good if you don’t do this. Roughly speaking....」</span></p><br/><p><span>\"I understand.\" </span><span>Polaroid interrupted. </span><span>“I’ll understand. I'll go and broadcast it.”</span></p><br/><p><span>The director didn't answer.</span></p><br/><p><span>Polaroid looked at his hands for a moment. They were shaking. He blinked once before standing up.</span></p><br/><p><span>「I’m sorry. I’ll come back later.」</span></p><br/><p><span>He ignored the director’s words and put on his equipment. </span><span>Outside was already a mess. </span><span>The system messages had just been sent to the users. There were loud shouts and questions directed towards the government and the Elder Saga Corporation.</span></p><br/><p><span>Polaroid hid. If he were caught, he would be forced to stay here. </span><span>However, this was the only place where he could get outside the village.</span></p><br/><p><span>No, there was one more. </span><span>Someone was standing next to him.</span></p><br/><p><span>“You...”</span></p><br/><p><span>Youvidser Laney. </span><span>Laney had concealed her trail and settled in the user village at Appalachia. It seemed that she had done her own investigation. </span><span>She ignored the words from the government officials. </span><span>She showed herself now.</span></p><br/><p><span>“I heard it all.” </span><span>She said. </span><span>“Shall we go?”</span></p><br/><p><span>Polaroid looked at her. Her face was stiff. But her eyes were firm as she thought about the countdown to their deaths.</span></p><br/><p><span>She said, “Let’s go together.”</span></p><br/><p><span>“Huh...?”</span></p><br/><p><span>“Let’s go together. It will be tough with you alone.”</span></p><br/><p><span>\"You, why...”</span></p><br/><p><span>“I know. There is no solution in reality. If it is a crisis where I will die anyway, I would rather make a gamble.” </span><span>Laney grinned. </span><span>\"And, there is a man I really want to see.”</span></p><br/><p><span>Polaroid knew who that person was. </span><span>The one Laney persistently strived after. </span><span>The indomitable person who never yielded. The great warrior who confronted the empire alone, and who dueled against a god to save his own people. </span><span>An NPC, but his name was enough to heat up the chests of any user in Elder Lord.</span></p><br/><p><span>Orc Warrior Crockta. </span><span>He was there.</span></p><br/><p><span>“Indeed.”</span></p><br/><p><span>Polaroid smiled faintly. It was the first smile since this incident occurred. </span><span>He was a member of Elder Lord’s broadcasting system. He knew as much about Crockta as she died. During the battle against the expedition forces, all videos had been on him.</span></p><br/><p><span>When Polaroid thought about Crockta, a vague hope rose in his heart.</span></p><br/><p><span>He was such a person. </span><span>Hope and faith. </span><span>He was always on the battlefield where defeat was confirmed, and he created victories in impossible places.  </span><span>Now he was on their side. </span><span>Whether he knew it or not, Crockta was fighting for their lives. The greatest warrior was their ally.</span></p><br/><p><span>“Let’s go watch it. The orc will beat her.”</span></p><br/><p><span>Laney held out her hand. </span><span>Polaroid approached and grabbed her hand. </span><span>Laney used a skill. Their appearance gradually blurred.</span></p><br/><p><span>When people opened the door roughly, there was nobody in the room.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}