{"title": "Chapter 222 - A Road has No Gate (5)", "id": 222, "volume": 3, "url": "http://boxnovel.org/praise-the-orc-chapter-222-a-road-has-no-gate-5", "volume_title": "Volume 3", "body": "<h1>Chapter 222 - A Road has No Gate (5)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 222 - A Road has No Gate (5)</span></p><br/><p><span>The situation worsened after Elder Lord’s system ‘Albino’ counted down to the end of the world. </span><span>The countries around the world declared a state of national disaster, but there was no progress. </span><span>Everyone knew this situation couldn’t be solved from outside. It was accepted that if the ‘grey god’ couldn’t be defeated in the next week, all those still connected would die.</span></p><br/><p><span>But who would kill the ‘god’? </span><span>The users were just shaking in the user villages of each city. </span><span>It was the same with the people watching. They hoped that the situation would be resolved and that everyone would return safely. </span><span>Then something shocking happened.</span></p><br/><p><span>“What is that?”</span></p><br/><p><span>“Wow, are they crazy? They want to broadcast in the midst of all this?”</span></p><br/><p><span>“What incredible minds.”</span></p><br/><p><span>Some BJs left the village to stream the battle against the grey god. </span><span>At first, they thought that it was just one BJ who lost composure due to fear. However, even the Undergames Channel started broadcasting it.</span></p><br/><p><span>The attention of the world focused on it. Every government tried to control it, but the dam that had already burst couldn’t be stopped. </span><span>Above all, the video wasn’t broadcast on a normal server, but an Elder Lord server that no one but Albino could touch.</span></p><br/><p><span>A live broadcast to tens of millions of people. </span><span>Ethical standards were pointless in this situation. Anyway, there were no users in the army.</span></p><br/><p><span>It was a battle between NPCs, with the bet being the lives of the users. </span><span>This, the struggle for the survival of the world of Elder Lord was broadcast to the people.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>The citizens stopped walking. </span><span>A large screen was installed on a building, where a video of Elder Lord was being played. It was the first time since the incident occurred. </span><span>There were captions. </span></p><br/><p><span>「This is a real situation.」</span></p><br/><p><span>「A cameraman called Polaroid, belonging to the Undergames Channel, has started a livestream. 」</span></p><br/><p><span>Everyone knew what the video was about: a battle for the fate of those connected. </span><span>And it was Polaroid, a cameraman from Undergames, who was streaming it. </span><span>He was an unknown employee, but now everyone around the world knew him. His breathing was transmitted through the video.</span></p><br/><p><span>Polaroid was accompanied by the celebrity Laney. </span><span>They arrived at the Temple of the Fallen God. </span><span>It was the first time the north was shown. After this situation happened, the limit line had disappeared. The north was a desolate land.</span></p><br/><p><span>-</span><i><span>This is where the fight will take place.</span></i></p><br/><p><span>-</span><i><span>In the end, we arrived here.</span></i></p><br/><p><span>The Undergames Channel wasn’t foolish enough to place commentators on such a life-threatening broadcast. </span><span>The station just broadcasted Polaroid’s video without any effects, making his voice resonate towards the viewers. </span><span>Those watching the video could hear the tremble in his voice.</span></p><br/><p><span>-</span><i><span>How...</span></i></p><br/><p><span>The first sight they were met with was a horrific bombardment. </span><span>The citizens groaned. </span><span>The power of the bombardment was evident from a distance. Like ancient knights meeting modern times, the army advanced as the shells fell down.</span></p><br/><p><span>There was a formidable magic power within the shells.</span></p><br/><p><span>-</span><i><span>It seems like most of them are dead already...</span></i></p><br/><p><span>Death. Every time an explosion occurred, someone died. This was close to a massacre. </span><span>The army literally stepped on the bodies of their teammates as they desperately fought against the ugly monsters. </span><span>If they got closer, there was the possibility that Polaroid and Laney would be caught up in the bombardment. They moved to the highlands to secure visibility.</span></p><br/><p><span>Not long after, they found a familiar face of a character that everyone knew.</span></p><br/><p><span>-</span><i><span>Crockta!</span></i></p><br/><p><span>He started to run without any interruptions to a place where a demon was standing. </span><span>The cannons continued to fire behind the demon. </span><span>Beyond that was a huge cannon they had never seen before. </span><span>An attack from this cannon would have severe consequences.</span></p><br/><p><span>-</span><i><span>This is a fight between gods.</span></i><i><span>That is the power of the grey god...</span></i></p><br/><p><span>Laney muttered.</span></p><br/><p><span>Crockta ran towards it, but the demon blocked his way. The demon avoided a frontal collision and moved around him, annoying Crockta. It was clear that the demon was trying to buy time. </span><span>Gradually, light started to appear at the muzzle of the cannon as the atmosphere started to shake. It was possible to predict the tragedy that the weapon would create.</span></p><br/><p><span>The army would be decimated, signalling the grey god’s victory.</span></p><br/><p><span>\"It is a pity...”</span></p><br/><p><span>\"Can’t anybody stop it?”</span></p><br/><p><span>\"Why is Crockta fighting alone?”</span></p><br/><p><span>The citizen’s voices rose. </span><span>Then something stood out in their field of view. At first, they thought it was a mistake. However, it gradually became a giant figure that occupied most of the field of view.</span></p><br/><p><span>A dragon. </span><span>A dragon, which had never been seen since the beginning of Elder Lord, appeared in front of everyone at this moment. </span><span>The dragon opened its mouth and blew out a breath, covering the whole screen in white.</span></p><br/><p><span>A huge ray of light fell down to the ground. The huge cannon was melted down. </span><span>The breath pierced through everything that it touched. The ground collapsed and the whole area was shaken. There was nothing left in the place where the breath passed.</span></p><br/><p><span>The breath stopped. </span><span>In the place where the great cannon was located, only a while hole remained. </span><span>People cheered. </span><span>They didn’t know where the dragon came from, or what type of existence it was. However, a legend appeared and used its power against the grey god.</span></p><br/><p><span>They all realized. </span><span>It wasn’t just the lives of the users that were at stake. </span><span>The characters of Elder Lord were struggling to survive and save their world. Everyone was desperately resisting the grey god.</span></p><br/><p><span>Elder Lord as a whole was a team. </span><span>This dragon proved it. </span><span>Feared enemies were now fighting with them against the grey god. </span><span>People started to feel hope. Maybe the grey god would be defeated and those connected would return.</span></p><br/><p><span>And at the forefront...</span></p><br/><p><span>There was the great orc, Crockta.</span></p><br/><p><span>-</span><i><span>Laney.</span></i><i><span>Let’s go.</span></i></p><br/><p><span>-</span><i><span>Yes.</span></i></p><br/><p><span>Polaroid’s and Laney’s voices trembled. </span><span>They took the risk and stood up. After witnessing such a fight, they needed to see it through to the end.</span></p><br/><p><span>The ending.</span></p><br/><p><span>The bombardment stopped and the army started to head towards the Temple of the Fallen God. </span><span>People held their breath. </span><span>As news of the broadcast spread, people started to watch the battle using various methods.</span></p><br/><p><span>The whole world was watching this fight.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><span>Crockta and the army could finally see the Temple of the Fallen God. </span><span>They had overcome the barrier and the shelling. </span><span>Their numbers had already been reduced by more than half. Only the upper ranked gods and some mortals remained to continue the march.</span></p><br/><p><span>There was no time to mourn for those who died. </span><span>The grey god was here. </span><span>They stood in front of the Temple of the Fallen God and shook at the unknown power that emerged from it.</span></p><br/><p><span>“From now on, it is completely her domain.”</span></p><br/><p><span>The war god said. </span><span>This whole place was filled with her power. The grey god’s divinity grew with every inhalation and exhalation. Her power was like a net around the white sphere.</span></p><br/><p><span>“Be prepared.” </span><span>He declared.</span></p><br/><p><span>Everyone was ready for the end as they grabbed their weapons. </span><span>It was at that moment. </span><span>The grey god suddenly manifested. </span><span>A clear figure emerged in front of their eyes. Her grey hair was a mess. Her eyes didn’t reflect any emotion. </span><span>No one could open their mouths. </span><span>Her power surrounded her.</span></p><br/><p><span>“Keok!”</span></p><br/><p><span>\"Ack...!\"</span></p><br/><p><span>The white power flew sharply towards them. </span><span>It was a simple attack. However, the strength in them was incomparable when thinking of the bombardment before. </span><span>They couldn’t stop it or avoid it.</span></p><br/><p><span>The victims followed.</span></p><br/><p><span>“Grey God!”</span></p><br/><p><span>Crockta split apart her divinity with God Slayer and rushed forward. </span><span>She stepped back, but Crockta leapt forward and wielded her sword.</span></p><br/><p><span>“Bul’tarrr──────!”</span></p><br/><p><span>The grey god and Crockta. </span><span>It was the first conflict.</span></p><br/><p><i><span>Kakakakak!</span></i></p><br/><p><span>His sword scratched the surface of the shield around her. Crockta stepped forward and wielded God Slayer again.</span></p><br/><p><i><span>Kaaaang!</span></i></p><br/><p><span>At the same time, power emerged from the grey god. Crockta twisted his body but the power stabbed his side. Blood splattered. </span><span>While he was stunned, the grey god aimed her power again. </span><span>However, it wasn’t just Crockta who ran towards her.</span></p><br/><p><span>The war god was surrounded with flames as he swung his sword at the grey god. </span><span>It wasn’t the image of a war god, but a demon crawling from hell.</span></p><br/><p><span>“Because of you!” </span><span>The war god stabbed with an angry expression. The protective shield was penetrated. There was a gap in the center. </span><span>\"Everything went wrong because of you. Grey God.”</span></p><br/><p><span>There was no expression on her face. </span><span>Instead, she raised her hand and pointed to the war god. </span><span>It was a simple gesture. </span><span>She beckoned. </span><span>The sky opened.</span></p><br/><p><span>\"......!\"</span></p><br/><p><span>The war god looked up at the sky. Then he froze. </span><span>He looked back. There were those who still hadn’t recovered from the grey god’s first blow.</span></p><br/><p><span>“Avoid it! Avoid i...!”</span></p><br/><p><span>It was too late. </span><span>Magic power fell from the white sphere covering the sky. </span><span>The war god rushed away from the grey god. </span><span>The magic power hit the ground and caused huge destruction. </span><span>The world shook. </span><span>The legendary beings, who seemed like they would never die, was dying en masse. Many of the gods hit were returned to Olympus.</span></p><br/><p><span>Silence fell. Everything was covered with ash. </span><span>Tinnitus filled the world. </span><span>Inside, something wriggled and moved.</span></p><br/><p><span>It was Crockta.</span></p><br/><p><span>Ash flowed down as he raised his body. His vision was blurry. The world seemed superimposed. </span><span>He shook his head and tried to regain his perspective. He looked down at his hands and flexed it. It didn’t look good. He spread open his hand again.</span></p><br/><p><span>Crockta looked around. </span><span>One or two gods raised their bodies. However, there were those who didn’t move. </span><span>The entire area around the Temple of the Fallen God was covered with ashes.</span></p><br/><p><span>It was like the landscape he saw when he was invited to her world. </span><span>He endured the throbbing pain and raised God Slayer. Even in the midst of the explosion, he didn’t let go of his long-time companion. He relied on the greatsword to raise his body.</span></p><br/><p><span>The grey god was standing there. </span><span>Crockta lifted his head. The grey god still had no expression on her face. </span><span>Crockta pulled out a piece of stone that was stuck in his shoulder. He ignored the flowing blood and raised God Slayer.</span></p><br/><p><span>\"Your friends are dead.\" </span><span>The grey god opened her mouth. </span><span>“Are you sad?”</span></p><br/><p><span>\"Shut up.”</span></p><br/><p><span>“Don’t be sad. I always see death; and now, I am looking at your death. There is no difference.” </span><span>The grey god smiled. </span><span>“All deaths are the same. I will make it the same.”</span></p><br/><p><span>Crockta wielded God Slayer with all his strength. However, the grey god gestured again. </span><span>Crockta coughed up blood. </span><span>It was a blow that reversed causality. However, her gesture blocked it instantly. Crockta was pushed to the ground. </span><span>The difference in power was remarkable.</span></p><br/><p><span>“Kuock...”</span></p><br/><p><span>There was a body beside him. </span><span>It was Anya. </span><span>She had already died. The mad slaughterer who laughed cheerfully when throwing her axes, her eyes were closed here. </span><span>She survived the bombardment but fell to the grey god’s blow.</span></p><br/><p><span>Crockta called out to her. </span><span>“Anya.”</span></p><br/><p><span>But the dead had nothing to say.</span></p><br/><p><span>Why? </span><span>The clock of destruction had started, and to prevent it from spreading, they had to grit their teeth and ignore the corpses. New corpses would be created in order to stop the advance of doom.</span></p><br/><p><span>“Stupid woman. Grrung.” </span></p><br/><p><span>A voice was heard from behind him. </span><span>Kumarak.</span></p><br/><p><span>\"You always look stupid to me, and the way you died was stupid. So stupid. Grrung! Stupid woman!”</span></p><br/><p><span>He was crying. </span><span>One of his arms were blown off.</span></p><br/><p><span>“Stupid!”</span></p><br/><p><span>He lifted Destroyer with his one remaining arm.</span></p><br/><p><span>“I will get revengeeeeeeeee──────!”</span></p><br/><p><span>It was a fierce roar.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}