{"title": "Chapter 221 - A Road has No Gate (4)", "id": 221, "volume": 3, "url": "http://boxnovel.org/praise-the-orc-chapter-221-a-road-has-no-gate-4", "volume_title": "Volume 3", "body": "<h1>Chapter 221 - A Road has No Gate (4)</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><span>Chapter 221 - A Road has No Gate (4)</span></p><br/><p><span>There had been war since ancient times. </span><span>It all began when the stars died.</span></p><br/><p><span>As the star god returned to the void, the grey god watched over all deaths as she received the heritage of the star god.  </span><span>As a result, the grey god witnessed the end of the universe.  </span><span>The lights in the universe were turned off and the world sank into darkness, returning to a space with no time.</span></p><br/><p><span>That was their last appearance. </span><span>They were the last civilization left in this lonely universe. </span><span>Even the last sun was going to die out.</span></p><br/><p><span>The grey god fell into despair. </span><span>There was a chance. Through the legacy of the star god, she realized that there was a great magic that could reverse the fate of the universe and return it to the beginning. </span><span>But there wasn’t much time left and the sun continued to fall.</span></p><br/><p><span>She tried to reverse the fate of the world, before the sun’s power was exhausted. </span><span>The gods resisted. </span><span>Thus, the grey god and the species of death collided against the gods of Olympus. </span><span>It was a fierce fight.</span></p><br/><p><span>And he was there: Gushantimur, the most powerful dragon. </span><span>Following their own beliefs, the dragons stood on both sides of the argument, with Gushantimur being one that followed the grey god.</span></p><br/><p><span>He was the last dragon who bit the gods by her side, until the grey god was defeated and thrown into another dimension. </span><span>Due to his mighty power, he could keep himself fully awake, even though the other dragons were killed or in hibernation.</span></p><br/><p><span>After the grey god was thrown into another dimension, Gushantimur was left alone to contemplate the world. </span><span>He became a hermit of the Black Forest.</span></p><br/><p><span>“She is back.”</span></p><br/><p><span>Gushantimur set up a castle and reached out to those who needed help. </span><span>They were mainstream people of the world, such as humans, elves, and dwarves, as well as those treated like monsters: the goblins, ogres, trolls, etc. </span><span>Gushantimur shared the feelings of the weak and the small.</span></p><br/><p><span>It was just a moment in comparison to the time he had lived. </span><span>However. </span><span>These short moments were never in vain. </span><span>They were raw but strong students. </span><span>Their minutes and seconds shone so brightly compared to those who lived for a long time.</span></p><br/><p><span>\"Do I really want to see the end...”</span></p><br/><p><span>The grey god aimed to save the universe from its fate and reconnect the cycle of life. </span><span>He looked at the sun and sighed. </span><span>Now he didn’t know what was heavier or more important.</span></p><br/><p><span>Gushantimur closed his eyes. </span><span>The wind blew through his hair. His disciples felt the aura of the grey god and looked towards the north. </span><span>His always loud lair was locked in silence.</span></p><br/><p><span>There was a sad smile on his face as he remembered the grey god.</span></p><br/><p><span>‘The world will be saved from destruction.’</span></p><br/><p><span>No one could see the world like the grey god. </span><span>Therefore, no one could truly understand her despair.</span></p><br/><p><span>‘I won’t let the universe cool down forever.’</span></p><br/><p><span>The universe was nearing its end and all she saw was death. </span><span>She saw the darkness in the morning sun and felt hopeless over the eternal void. It was a terrible sinking worse than death.</span></p><br/><p><span>A north wind blew. </span><span>Gushantimur kept his eyes closed. </span><span>He couldn’t figure out what to do.</span></p><br/><p><span>Suddenly, he remembered a warrior. </span><span>The warrior was someone who caused miracles everywhere they went. </span><span>A warrior who accomplished things that seemed impossible. He cut the neck of the great chieftain who was possessed by the Tribulation, faced the great empire alone and defeated a god. </span><span>Now he was going against the grey god to save the world. </span><span>One of the greatest fighters of this era.</span></p><br/><p><span>Crockta. </span><span>While their time together was short, he was someone who couldn’t be forgotten. </span><span>A tough face that always smiled mischievously. The one who wielded a huge greatsword. Someone who rushed recklessly and didn’t know how to retreat.</span></p><br/><p><span>What was the reason for fighting like that? </span><span>How could he do so?</span></p><br/><p><span>“I...”</span></p><br/><p><span>Someone called out to him, “Master!”</span></p><br/><p><span>He looked back to see a weak guy that just entered, an innocent kobold. </span><span>He was the kobold shooter Komojak, and his idol was the goblin Kiao. </span><span>He entered the Black Forest and begged to be his disciple.</span></p><br/><p><span>\"I will shoot a bow today!”</span></p><br/><p><span>A straw doll was shaking in front of him. His accuracy wasn’t that great but there was pleasure on the kobold’s face.</span></p><br/><p><span>\"I will shoot this twice tomorrow keong keong! Please train me tomorrow keong!”</span></p><br/><p><span>He said with a bright smile.</span></p><br/><p><span>Tomorrow.</span></p><br/><p><span>Gushantimur looked at him blankly.  </span><span>The kobold didn’t know anything. Even though the countdown to the end of the world was going on, he was laughing and talking about tomorrow. </span><span>Gushantimur looked around. </span><span>Numerous disciples were looking at him. Unknown emotions were in their eyes.</span></p><br/><p><span>“Tomorrow.”</span></p><br/><p><span>If tomorrow came like the kobold said. </span><span>It wouldn’t stop tomorrow, there would be many more tomorrows. </span><span>Gushantimur and all his disciples would enjoy tomorrow and the rest of their lives.  </span><span>The sun would go down and rise again. Thus, they would live another day. </span><span>Every day, every minute.</span></p><br/><p><span>That’s right. </span><span>He already knew.</span></p><br/><p><span>Gushantimur spoke in a soft voice, </span><span>\"Two times isn’t enough.”</span></p><br/><p><span>“Keong?”</span></p><br/><p><span>“You will have to shoot it three times, not two. Can you do it?\"</span></p><br/><p><span>The kobold looked awkward. </span></p><br/><p><span>\"T-Three keong...”</span></p><br/><p><span>He scratched his head and avoided Gushantimur’s eyes. </span><span>He looked at the straw dolls and the wounds on his hands, before nodding at Gushantimur.</span></p><br/><p><span>\"T-Three times is too much keong...but, let’s try it keong...”</span></p><br/><p><span>“Yes.”</span></p><br/><p><span>Gushantimur turned to the other disciples. </span><span>Everyone was staring at him. </span><span>He spoke again, </span><span>\"Tomorrow, I want to see how everyone has improved. It will be a harsh day. Is everyone prepared?”</span></p><br/><p><span>Their eyes widened. The disciples looked at each other and nodded.</span></p><br/><p><span>Gushantimur smiled. </span></p><br/><p><span>“Yes.”</span></p><br/><p><span>His body floated in the air. </span><span>Gushantimur’s body, which was in the form of a young man, started to slowly change. </span><span>Black scales sprouted on his body. His body extended. Wings spread out from his back and the irises of a beast appeared in his eyes.</span></p><br/><p><span>Now he was as big as the castle. </span><span>His body was huge enough to cast shade on his entire body. </span><span>Beautiful scales and broad wings. </span><span>The mightiest species, a dragon. </span><span>His true appearance was revealed. </span><span>The kobold stared at him with wide eyes and a gaping mouth. Even his original disciples had never seen Gushantimur like this.</span></p><br/><p><span>After returning to the form of a black dragon, Gushantimur whispered. </span><span>His voice was as soft as always.</span></p><br/><p><span>'Rest early today and prepare for tomorrow.’</span></p><br/><p><span>One disciple asked aloud, </span><span>“Master, where are you going?”</span></p><br/><p><span>‘I...’ </span><span>Gushantimur used his wings to turn his body. </span><span>‘I am also preparing for tomorrow.’</span></p><br/><p><span>He flew towards the Temple of the Fallen God.</span></p><br/><p></p><p style=\"text-align: center\"><span>***</span></p><br/><p><i><span>Kurwarwarwarwa!</span></i></p><br/><p><span>The black dragon’s breath poured towards the giant cannon. Crockta and Abaddon rolled to avoid the aftermath.</span></p><br/><p><i><span>Kurwarwarwarwa!</span></i></p><br/><p><span>The world was filled with a ringing sound. </span><span>The breath melted everything. </span><span>The breath swallowed everything, leaving behind a huge hole. </span><span>It was like lava flowed over the ground. In the place where the ancient weapon was, only a smoking hole remained.</span></p><br/><p><span>Crockta stared blankly at the sky. </span><span>It was the first time he saw a black dragon. </span><span>However, he knew the identity of the dragon.</span></p><br/><p><span>\"Gushantimur──────!”</span></p><br/><p><span>He appeared to neutralize the enemy’s weapon. Crockta smiled. It was an unexpected salvation.</span></p><br/><p><span>He asked, \"Did you have a connection with Gushantimur?”</span></p><br/><p><span>Abaddon spoke in a dismal voice, </span><span>\"As far as I know, he...he was a great friend who fought with us in the past. Why is he stopping us now?”</span></p><br/><p><span>\"Kulkul, the Gushantimur that I know is different.”</span></p><br/><p><span>He didn’t know what Gushantimur was like in the past. But the Gushantimur that he knew in the Black Forest wasn’t someone who would follow the grey god. </span><span>Magic power stretched around Gushantimur’s body in the air. According to his will, dozens of spheres dropped towards the magic cannons.</span></p><br/><p><span>“Kuok...!”</span></p><br/><p><span>Abaddon extended his power to try and stop Gushantimur’s attack, but Crockta struck quickly with God Slayer aimed at the demon.</span></p><br/><p><span>\"Hat!\"</span></p><br/><p><span>Abaddon barely avoided the attack as one of his arms was cut, flames springing from the wound.</span></p><br/><p><span>\"Kuaaaaak!\"</span></p><br/><p><span>Abaddon tried to stop the flames from God Slayer, but it didn’t work. </span><span>He fell helplessly to the ground. </span><span>In the meantime, all of the magic cannons were destroyed by Gushantimur. </span><span>Once the bombardment ceased, the gods advanced and destroyed the monsters. </span></p><br/><p><span>Abaddon panicked. </span><span>\"An unidentified shaman at the beginning and now the ancient black dragon, Gushantimur.”</span></p><br/><p><span>Things Abaddon thought would never be broken through were destroyed. </span><span>It was by third beings that they didn’t anticipate. </span></p><br/><p><span>'The heavens are helping me.” Crockta said.</span></p><br/><p><span>\"The heavens... hahaha, the heavens. Because of the heavens...” </span><span>Abaddon laughed.</span></p><br/><p><span>It sounded like something from a black comedy. Crockta also laughed.</span></p><br/><p><span>Abaddon laughed for a while before saying, </span><span>“Kill me. I can't fight anymore.”</span></p><br/><p><span>The last fire from God Slayer was still eating at his body. The flames rose from his arm to his shoulder, slowly burning his body.</span></p><br/><p><span>Crockta shook his head. </span><span>\"I don’t intend to kill you.”</span></p><br/><p><span>\"If you don’t kill me now, I will recover and hit your back.”</span></p><br/><p><span>“If you are able to do so.”</span></p><br/><p><span>\"Why are you sparing me?”</span></p><br/><p><span>Crockta looked down at him and said, </span><span>\"I still need you.\"</span></p><br/><p><span>“Need me...?”</span></p><br/><p><span>\"You treated me to a wonderful dish. I can’t forget that taste.”</span></p><br/><p><span>“......”</span></p><br/><p><span>“I want to eat your spicy dishes again. So next time...” </span><span>Crockta grinned at Abaddon. </span><span>“Let’s meet at the table.”</span></p><br/><p><span>Then he moved towards the Temple of the Fallen God.</span></p><br/><p><span>Abaddon stared blankly after him. </span><span>“Next time...”</span></p><br/><p><span>Abaddon smiled at the words. </span><span>Somehow, he felt carefree. Maybe he secretly hoped for this conclusion. Avoiding death was the instinct of all living things. </span><span>The gods were approaching. Abaddon moved away from the front lines to avoid them. </span><span>He watched as the gods and mortals followed Crockta.</span></p><br/><p><span>\"Do you like spicy food?” </span><span>Abaddon suddenly asked.</span></p><br/><p><span>Gushantimur was standing next to him in human form. </span><span>A weary face. It was difficult for him to use that degree of breath.</span></p><br/><p><span>Gushantimur replied, </span><span>\"I don’t like nor dislike it.”</span></p><br/><p><span>\"Is that so?” </span><span>Abaddon said. </span><span>\"If there really is a next time...I will make the spicy flavor for you. My spicy noodles are great, even Crockta’s acknowledged it.”</span></p><br/><p><span>“I see. I look forward to it. Sincerely.”</span></p><br/><p><span>\"Hahaha, I’m serious...”</span></p><br/><p><span>Above their heads, the white sphere created by the grey god floated. </span><span>Now fate had left their hands. The ending was something that not even the gods could know.</span></p><br/><p><span>The battle for the world’s fate ran without pause towards the end.</span></p><br/><p>Glossary of Common Korean Terms.</p><br/><p>Praise the Orc: Glossary Link. </p><br/><p>Current schedule: There will now be 14 chapters a week, meaning two chapters every day.</p><br/><p>I have also updated my Patreon to reflect my new novels. Every tier has early access to a certain number of unedited chapters and the chapters will be updated after I finish releasing the chapters for the day.</p><br/>\n</div>"}