{"title": "Chapter 8 – 9", "id": 8, "volume": 1, "url": "http://boxnovel.org/beloved-little-treasure-chapter-8-%E2%80%93-9", "volume_title": "Volume 1", "body": "<h1>Chapter 8 – 9</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Yuan Gun Gun glanced at the clothes on the floor around the big dog, she jumped off the bed and hugged the big dog.</p><br/><p>‘Big dog, you’re beautiful,’ Yuan Gun Gun said.</p><br/><p>Qiu Li Luo was happy she was right about Yuan Gun Gun. She licked Yuan Gun Gun’s neck.</p><br/><p>‘Aunty Li are you the big dog?’ Yuan Gun Gun asked.</p><br/><p>Qiu Li Luo howled softly.</p><br/><p>‘Aunty Li, you’re a beautiful big dog,’ Yuan Gun Gun said. ‘Aunty Li if you come home with me, I’ll marry aunty Li’s son.’</p><br/><p>Yuan Gun Gun wanted to climb onto Qiu Li Luo’s back.</p><br/><p>Qiu Li Luo wanted the innocent Yuan Gun Gun to be her daughter-in-law. Where else would Qiu Li Luo find such a loveable daughter-in-law who loved werewolves instead of being scared of werewolves? Qiu Li Luo believed Yuan Gun Gun would love Hao Yan Che too. Hao Yan Che needed someone warm and loving like Yuan Gun Gun.</p><br/><p>‘Aunty Li, I want to sit on your back,’ Yuan Gun Gun said.</p><br/><p>Qiu Li Luo’s tail lifted Yuan Gun Gun onto her back. Yuan Gun Gun clapped and laughed happily.</p><br/><p>Yuan Gun Gun tickled Qiu Li Luo to make Qiu Li Luo roll on the floor and howl. Qiu Li Luo’s tail lifted Yuan Gun Gun onto the bed, she jumped on the bed and sat on Yuan Gun Gun. Yuan Gun Gun laughed and tickled Qiu Li Luo again. They played with each other until they fell asleep.</p><br/><p>When Hao Yan Que walked into the guest room, he saw a sleeping little round ball hugging a snow white werewolf.</p><br/><p>Hao Yan Que rubbed Qiu Li Luo’s head. Qiu Li Luo opened her eyes and jumped off the bed. She pointed her head at Yuan Gun Gun on the bed. He understood what she wanted. He pulled the bedsheet over Yuan Gun Gun’s body.</p><br/><p>Qiu Li Luo rubbed her head on Han Yan Que’s leg, and she walked out of the room.</p><br/><p>Han Yan Que followed Qiu Li Luo outside and he closed the guest room door.</p><br/><p>In the master bedroom, Qiu Li Luo jumped onto the bed and she transformed into a naked woman.</p><br/><p>‘Xiao Luo, are you seducing your husband?’ Han Yan Que teased.</p><br/><p>Qiu Li Luo crawled under the bedsheet.</p><br/><p>‘You perverted wolf,’ Qiu Li Luo said.</p><br/><p>Hao Yan Que slowly took off his clothes and smiled at Qiu Li Luo.</p><br/><p>‘Xiao Luo, you should know I’m a demon not a wolf,’ Hao Yan Que said.</p><br/><p>‘You perverted demon,’ Qiu Li Luo said. ‘Why are you taking off your clothes?’</p><br/><p>‘You’ll find out soon,’ Hao Yan Que said.</p><br/><p>Hao Yan Que crawled under the bedsheet and kissed Qiu Li Luo’s lips.</p><br/><p>‘Xiao Luo, your first sin was leaving the bed before me,’ Hao Yan Que said. ‘Neglecting me to be with the little round ball is your second sin. Calling your husband a perverted demon is your third sin. What can you say to defend yourself?’</p><br/><p>Qiu Li Luo pouted her lips and hugged Hao Yan Que’s neck.</p><br/><p>‘Are all vampires like you?’ Qiu Li Luo asked. ‘Only loves to drink blood and sleep with their lover?’</p><br/><p>‘I’m not an ordinary vampire,’ Hao Yan Que said. ‘I’m a vampire king. My head doesn’t lust for blood and naked bodies.’</p><br/><p>‘Then what’s in your head?’ Qiu Li Luo asked.</p><br/><p>‘There’s only you in my head,’ Han Yan Que said. ‘I want to sleep with you so there is only me in your head.’</p><br/><p>Han Yan Que bit Qiu Li Luo’s lips.</p><br/><p>‘Oh, then vampire king, you should punish me,’ Qiu Li Luo said.</p><br/><p>‘Xiao Luo, it’s good you admitted your sins,’ Han Yan Que said.</p><br/><p>Han Yan Que enjoyed punishing Qiu Li Luo.</p><br/><p>***</p><br/><p>The vampire king thoroughly punished Qiu Li Luo, and she laid on his chest.</p><br/><p>Han Yan Que stroked Qiu Li Luo’s hair. He loved to see how relaxed she looked after each time they were intimate.</p><br/><p>‘Que, have you heard of a family household named Fat?’ Qiu Li Luo asked.</p><div></div><br/><p>‘Didn’t you say I’m a foreigner?’ Hao Yan Que asked. ‘Shouldn’t you know the family names of your own nationality?’</p><br/><p>Qiu Li Luo bit Hao Yan Que’s chest.</p><br/><p>‘How many years have I been alive?’ Qiu Li Luo asked. ‘How many years have you been alive? You’re an ancient vampire and lived through history. You’ve travelled everywhere too. Of course you would know more than me.’</p><br/><p>‘Luo Li Qiu!’ Hao Yan Que said. ‘I think your heart and head isn’t with me. Let’s frolic on the bed until you only think of me.’</p><br/><p>Qiu Li Luo knew Hao Yan Que was angry whenever he mixed up her name.</p><br/><p>‘I don’t want to,’ Qiu Li Luo said. ‘You’ve exhausted my body.’</p><br/><p>‘Even if you don’t want to, you have to want to,’ Hao Yan Que said. ‘It’s your fault for biting me.’</p><br/><p>Hao Yan Que began to tease Qiu Li Luo’s body.</p><br/><p>‘Han Yan Que!’ Qiu Li Luo called. ‘Do you know how to be reasonable?’</p><br/><p>‘No,’ Hao Yan Que said. ‘So you don’t need to open your mouth.’</p><br/><p>Hao Yan Que kissed Qiu Li Luo’s lips.</p><br/><p>Qiu Li Luo turned her head to the side.</p><br/><p>‘Wait,’ Qiu Li Luo said. ‘Answer my question first.’</p><br/><p>‘There isn’t a family called Fat,’ Hao Yan Que said. ‘The little round ball’s mum is Feng Du Du and the little round ball’s dad is Yuan Ting Liu. Her dad is the CEO of Yuan’s company. I’ve notified her dad that she is safe here with us. He’ll come here to pick up the little round ball soon. You saved the little round ball’s life, her dad will grant any request you want.’</p><br/><p>Hao Yan Que held Qiu Li Luo’s face, and he kissed her senseless.</p><br/><p>The atmosphere in the master room became steamy again.</p><br/><p>At Yuan’s company, Yuan Ting Liu looked suspiciously at the letter he received early in the morning, ‘Mr Yuan, if you want to know where your daughter is, wait outside Yuan’s company headquarters tomorrow morning at nine.’</p><br/><p>Then Yuan Ting Liu picked up the strange plaque left on his office desk.</p><br/><p>Na Liu Ting Du knocked on Yuan Ting Liu’s office door.</p><br/><p>‘Dad, it’s me,’ Na Liu Ting Du said.</p><br/><p>‘Come in,’ Yuan Ting Liu said. He nodded his head at his adoptive son Na Liu Ting. ‘Ting Du, investigate the origin of this plaque.’</p><br/><p>Na Liu Ting Du was a handsome fifteen-year-old who had intelligent eyes, long hair and a regal aura.</p><br/><p>‘Dad, Gun Gun isn’t found yet,’ Na Lui Ting Du said. ‘Dad, what do you think this plaque means? Do you think it belongs to the kidnapper? Do they want money or is this a trap? Dad, don’t go see the owner of this plaque tomorrow.’</p><br/><p>‘Ting Du, if you can’t find out news about this plaque by tomorrow then I need to go see the owner of this plaque,’ Yuan Ting Liu said. ‘I don’t care of it’s a trap. If there’s a chance of finding Gun Gun, I need to take it. Ting Du, if anything happens to me, Yuan’s company is yours and I want you to take care of Du Du and Gun Gun for me.’</p><br/><p>‘No,’ Na Liu Ting Du said. ‘I don’t want anything to happen to you. Dad, let me come with you tomorrow.’</p><br/><p>‘Ting Du, you can’t come with me,’ Yuan Ting Liu said. ‘I need you to be safe.’</p><br/><p>‘Dad, take me with you,’ Na Liu Ting Du said. ‘If something happens to you, I can sacrifice my life to protect Gun Gun.’</p><br/><p>‘Alright,’ Yuan Ting Liu said. ‘I’ll take you with me. Ting Du, you have to protect Gun Gun if anything happens to me.’</p><br/><p>‘Yes dad,’ Na Lui Ting Du said. ‘I’ll go investigate this plaque.’</p><br/><p>‘Um, go,’ Yuan Ting Liu said.</p><br/><p>Na Lui Ting Du left Yuan Ting Liu’s office.</p><br/><p>‘Gun Gun, daddy won’t let anything happen to you,’ Yuan Ting Liu promised.</p><br/><p>***</p><br/><p>End of Chapters Eight to Nine</p><br/>\n</div>"}