{"title": "Chapter 14 – 15", "id": 14, "volume": 1, "url": "http://boxnovel.org/beloved-little-treasure-chapter-14-%E2%80%93-15", "volume_title": "Volume 1", "body": "<h1>Chapter 14 – 15</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>In the study room of the Yuan Mansion, Yuan Ting Liu looked sadly at the plaque. He wished thirteen years didn’t past by so quickly, but he had a promise to keep.</p><br/><p>‘Daddy,’ Yuan Gun Gun called.</p><br/><p>‘Come in,’ Yuan Ting Liu said.</p><br/><p>Yuan Gun Gun and Na Liu Ting Du walked into the study room and they sat on the sofa.</p><br/><p>‘Daddy, why do you want to see me?’ Yuan Gun Gun asked.</p><br/><p>‘I found the painting you accidently teared hidden behind a bookshelf,’ Yuan Ting Liu said.</p><br/><p>Yuan Gun Gun hid her face behind Na Liu Ting Du’s back.</p><br/><p>‘Dadddy… I’m sorry,’ Yuan Gun Gun said. ‘I shouldn’t have played with a ball inside. Daddy, don’t be angry.’</p><br/><p>‘Don’t worry,’ Yuan Ting Liu said. ‘I didn’t ask you to come here to talk about the painting.’</p><br/><p>Yuan Gun Gun sighed. She was relieved Yuan Ting Liu wasn’t angry about the painting. She ran to sit next to Yuan Ting Liu and she hugged his arm.</p><br/><p>‘Daddy, what do you want to talk about with me?’ Yuan Gun Gun asked sweetly.</p><br/><p>‘Starting tomorrow you’ll be going to the CEO of Hao Yan’s company’s home to be his maid,’ Yuan Ting Liu said.</p><br/><p>Yuan Ting Liu took out a feather from Yuan Gun Gun’s hair.</p><br/><p>‘What?’ Yuan Gun Gun asked. ‘CEO of Hao Yan’s company’s maid?’</p><br/><p>Na Liu Ting Du silently looked at Yuan Ting Liu’s poker face.</p><br/><p>‘Tomorrow someone will come here to pick you up,’ Yuan Ting Liu said. ‘Gun Gun, you’ll be living at his home from now on.’</p><br/><p>‘Daddy, I don’t want to go,’ Yuan Gun Gun said. ‘I want to live here with daddy, mummy and big brother Du.’</p><br/><p>‘Are you disobeying me?’ Yuan Ting Liu asked.</p><br/><p>‘Daddy, I don’t know how to be a maid,’ Yuan Gun Gun said. ‘If I go, my small friends will miss me and I’ll miss them too.’</p><br/><p>‘You can learn how to be a maid,’ Yuan Ting Liu said. ‘I’ll hire someone to take care of your small friends.’</p><br/><p>‘Daddy, I…’ Yuan Gun Gun said.</p><br/><p>‘I’ve made my decision,’ Yuan Ting Liu said.</p><br/><p>Yuan Gun Gun cried.</p><br/><p>‘Daddy, why do you want me to leave home?’ Yuan Gun Gun asked. ‘Daddy, don’t you need me anymore?’</p><br/><p>‘Gun Gun, you’re grown up now,’ Yuan Ting Liu said. He suppressed the sadness in his heart. ‘You can’t be here with everyone. You need to learn to be independent so in the future you won’t be useless.’</p><br/><p>‘Daddy, are you saying if I learn to be a maid then I’ll be useful in the future?’ Yuan Gun Gun asked.</p><br/><p>‘You’ll at least learn how to take care of yourself and others,’ Yuan Ting Liu said.</p><br/><p>Yuan Ting Liu wiped Yuan Gun Gun’s tears.</p><br/><p>Yuan Gun Gun sniffed her nose.</p><br/><p>‘How long do I need to train as a maid before I can come home?’ Yuan Gun Gun asked.</p><br/><p>‘Three years,’ Yuan Ting Liu said.</p><br/><p>Yuan Gun Gun cried uncontrollably.</p><br/><p>‘Daddy will buy a baby panda for you as a welcome home gift,’ Yuan Ting Liu bribed.</p><br/><p>Yuan Gun Gun was conflicted. She wanted a baby panda to raise, but she didn’t want to leave home.</p><div></div><br/><p>‘Daddy will buy you a baby fox too,’ Yuan Ting Liu said.</p><br/><p>‘Daddy, I want a white fur baby fox,’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun wiped her face.</p><br/><p>‘Alright,’ Yuan Ting Liu said.</p><br/><p>Yuan Ting Liu pinched Yuan Gun Gun’s nose affectionately. He wanted his little girl to be happy. He believed it was fate giving her a chance to find her own happiness.</p><br/><p>***</p><br/><p>Yuan Gun Gun had a long crying session.</p><br/><p>‘Gun Gun, don’t cry,’ Yuan Ting Liu said. ‘Go to sleep. Your bags are packed. Tomorrow morning someone will come pick you up.’</p><br/><p>‘Daddy, can I sleep with big brother Du tonight?’ Yuan Gun Gun asked.</p><br/><p>‘No,’ Yuan Ting Liu said firmly. ‘You can’t sleep with daddy and mummy tonight either. You’re eighteen. You can sleep by yourself.’</p><br/><p>Yuan Gun Gun pouted her lips, stood and walked to the door.</p><br/><p>‘And you can’t sleep with your small friends,’ Yuan Ting Liu warned.</p><br/><p>Yuan Gun Gun’s shoulders sagged, and she walked pitifully to her bedroom.</p><br/><p>‘Dad, can you tell me why?’ Na Liu Ting Du asked.</p><br/><p>‘It’s a promise I made with the person who saved Gun Gun’s life,’ Yuan Ting Liu said.</p><br/><p>‘Dad, are you saying…’ Na Liu Ting Du said.</p><br/><p>‘Um, the wife of the founder of Hao Yan’s company that we met thirteen years ago is the person who saved Gun Gun’s life,’ Yuan Ting Liu said.</p><br/><p>‘Does Gun Gun need to be their maid?’ Na Liu Ting Du asked.</p><br/><p>‘Not their maid but their oldest son’s maid,’ Yuan Ting Liu said.</p><br/><p>‘Why?’ Na Liu Ting Du asked.</p><br/><p>‘His parents want Gun Gun to be their daughter-in-law,’ Yuan Ting Liu said.</p><br/><p>Na Liu Ting Du stared at the tea cup on the desk. He hid his secret desire deep in his heart.</p><br/><p>‘I only agreed for Gun Gun to live with their oldest son for three years,’ Yuan Ting Liu said. ‘If after three years, they don’t love each other then Gun Gun is free to come home.’</p><br/><p>‘Dad, Gun Gun doesn’t need to be his maid,’ Na Liu Ting Du said. ‘Gun Gun lived a sheltered life. I don’t want Gun Gun to be taken advantage of.’</p><br/><p>‘Ting Du, it’s our fault for sheltering Gun Gun,’ Yuan Ting Liu said. ‘What will happen to Gun Gun after dad and mum die?’</p><br/><p>‘Dad, I’ll be there to take care of Gun Gun,’ Na Liu Ting Du said.</p><br/><p>‘Ting Du, how can you take care of Gun Gun the rest of your life after you’re married with children and a busy career?’ Yuan Ting Liu asked.</p><br/><p>Na Liu Ting Du didn’t say what was in his heart.</p><br/><p>‘Ting Du, we can’t shelter Gun Gun forever,’ Yuan Ting Liu said. ‘We need to let her mature.’</p><br/><p>‘Dad, I understand,’ Na Liu Ting Du said softly.</p><br/><p>Yuan Ting Liu patted Na Liu Ting Du’s shoulder.</p><br/><p>‘Go to bed,’ Yuan Ting Liu said.</p><br/><p>Na Liu Ting Du didn’t want Yuan Gun Gun to leave the nest.</p><br/><p>***</p><br/><p>End of Chapters Fourteen to Fifteen</p><br/>\n</div>"}