{"title": "Chapter 24", "id": 24, "volume": 1, "url": "http://boxnovel.org/beloved-little-treasure-chapter-24", "volume_title": "Volume 1", "body": "<h1>Chapter 24</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>The legendary Yuan Gun Gun was responsible for waking up Hao Yan Che and cooking three meals a day for him. Each day she was frightened for her life.</p><br/><p>After living together several days with Hao Yan Che, Yuan Gun Gun was used to his habits. He liked to work at home, and if he went to Hao Yan’s company headquarters, two handsome men followed him. The first man was Jia Tu, he was a quiet man. The second man was Yi Tu who was friendly, and reminded Yuan Gun Gun of Na Liu Ting Du.</p><br/><p>Yuan Gun Gun sat in the study room as usual while Hao Yan Che worked on his laptop. She didn’t understand the strange beautiful monster who wanted her to watch him work and eat every day.</p><br/><p>Yuan Gun Gun turned around to look at Jia Tu and Yi Tu standing still. She wondered why how they could stand still all day and not feel frustrated.</p><br/><p>Yi Tu smiled at Yuan Gun Gun’s curious face looking at him and Jia Tu. Yuan Gun Gun smiled back at Yi Tu and two dimples appeared on her cheeks.</p><br/><p>‘Yuan Gun Gun,’ Hao Yan Che called.</p><br/><p>‘Yes young master,’ Yuan Gun Gun said.</p><br/><p>‘Go cook twenty dishes including one bowl of soup,’ Hao Yan Che ordered. ‘If you don’t cook properly, you know the consequences.’</p><br/><p>‘Twenty dishes?’ Yuan Gun Gun asked.</p><br/><p>‘Are you opposing me?’ Hao Yan Che asked.</p><br/><p>‘But…’ Yuan Gun Gun said.</p><br/><p>‘Why are you still here?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun ran outside. Hao Yan Che glared at Jia Tu, and resumed working on his laptop.</p><br/><p>A couple of seconds later, Yuan Gun Gun ran back to the room.</p><br/><p>‘Young master, is there a time limit?’ Yuan Gun Gun asked.</p><br/><p>‘If you don’t finish cooking in an hour, you’ll find out what will happen to you,’ Hao Yan Che threatened.</p><br/><p>Hao Yan Che shot a pen into the door. Yuan Gun Gun pitied the pen and she ran into the kitchen.</p><br/><p>Hao Yan Che cursed the chubby little girl. Why couldn’t he kill her?</p><br/><p>One hour later, Yuan Gun Gun popped her head into the study room.</p><br/><p>‘Young master, your meal is cooked,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che scoffed at the scared little rabbit, and he walked to the dining room.</p><br/><p>‘Yi Tu,’ Yuan Gun Gun whispered. ‘Today young master is angrier than usual. What did I do wrong?’</p><br/><p>Yi Tu rubbed Yuan Gun Gun’s head.</p><br/><p>‘You didn’t do anything,’ Yi Tu said. ‘Young master is being his usual self.’</p><div></div><br/><p>‘Yuan Gun Gun!’ Hao Yan Che called.</p><br/><p>Yuan Gun Gun ran witless to the dining room.</p><br/><p>‘Why are you crawling like a snail?’ Hao Yan Che asked. ‘Are you waiting for someone to serve you?’</p><br/><p>Yuan Gun Gun shook her head. She didn’t know why the icy Hao Yan Chen suddenly turned into a fire breathing dragon.</p><br/><p>‘Feed me!’ Hao Yan Che ordered.</p><br/><p>Yuan Gun Gun quickly put a variety of food into Hao Yan Che’s bowl.</p><br/><p>Hao Yan Che picked up his chopsticks and he ate a mouthful of food.</p><br/><p>‘Tastes bad,’ Hao Yan Che said.</p><br/><p>‘Impossible,’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun obliviously took Hao Yan Che’s chopsticks and sampled a mouthful of the food she cooked.</p><br/><p>‘It tastes delicious,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che silently looked at his chopsticks in Yuan Gun Gun’s hands.</p><br/><p>‘Young master,’ Yuan Gun Gun called.</p><br/><p>‘I said it tastes bad so it tastes bad,’ Hao Yan Che said.</p><br/><p>‘But yesterday you liked eating this dish,’ Yan Gun Gun said.</p><br/><p>‘Which one of your ears heard I said I liked eating this dish?’ Hao Yan Che asked. He pinched Yan Gun Gun’s ears. ‘Is it your left ear or your right ear?’</p><br/><p>‘It hurts… yesterday young master ate many portions of this dish,’ Yuan Gun Gun said.</p><br/><p>‘Today I said this dish tastes bad,’ Hao Yan Che said. ‘Go clean the bathrooms.’</p><br/><p>‘Young master, you’re being unreasonable,’ Yuan Gun Gun said.</p><br/><p>‘I’m unreasonable,’ Hao Yan Che said. ‘Do you want to see what happens if you cry?’</p><br/><p>Yuan Gun Gun bit her lips.</p><br/><p>‘And who said you can ask other people to help you cook?’ Hao Yan Che asked. ‘There are ten dishes on this table cooked by someone else.’</p><br/><p>‘Young master, you didn’t say I couldn’t ask other people to help me cook,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che thumped the table.</p><br/><p>‘If I find a spot of dust in the bathrooms, I’ll ask someone to give you a beating,’ Hao Yan Che threatened. ‘Go!’</p><br/><p>Yuan Gun Gun ran outside the dining room.</p><br/><p>Hao Yan Che stared at the twenty dishes on the dining table. He was angry Yuan Gun Gun smiled alluringly at his guards.</p><br/><p>***</p><br/><p>End of Chapter Twenty-Four</p><br/>\n</div>"}