{"title": "Chapter 38", "id": 38, "volume": 1, "url": "http://boxnovel.org/beloved-little-treasure-chapter-38", "volume_title": "Volume 1", "body": "<h1>Chapter 38</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Yuan Gun Gun snuck her small friends into Hao Yan Che’s bedroom. There was a big unused drawer beneath the book shelf furthest from Hao Yan Che’s bed. The drawer could fit five people. There were decorative holes outside the drawer. It was a perfect hiding spot for her small friends. She lined the bottom of the drawer with blankets for them to sleep on, and she put food and water inside the drawer for them to eat.</p><br/><p>‘Stay here,’ Yuan Gun Gun said. ‘At night, big sister will bring you back to my room. Don’t let anyone see or hear you.’</p><br/><p>Yuan Gun Gun ran back to the pink bedroom before Chen Jia Wen knocked on the door.</p><br/><p>‘Gun Gun, young master is back,’ Chen Jia Wen said. ‘He wants to see you.’</p><br/><p>‘Young master is back early,’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun wiped sweat off her forehead.</p><br/><p>‘Let’s go,’ Chen Jia Wen said.</p><br/><p>‘Wait,’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun picked up the three tier meal box, and she followed Chen Jia Wen to the study room.</p><br/><p>‘Young master, you’re back,’ Yuan Gun Gun said and put the box on the desk.</p><br/><p>‘What is this?’ Hao Yan Che asked.</p><br/><p>‘My mummy made it to bribe you… I mean mummy wanted me to give this to young master as a gift,’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun opened the box, and she took out a hot bun. Hao Yan Che slapped her right hand away from the box, and he put the hot bun back in the box.</p><br/><p>‘Ow… it hurts,’ Yuan Gun Gun said. She rubbed her right sore hand. ‘Why did you hit my hand?’</p><br/><p>‘Go wash your hands,’ Hao Yan Che said.</p><br/><p>‘Then why aren’t you washing your hands?’ Yuan Gun Gun asked.</p><br/><p>Hao Yan Che scoffed, and Yuan Gun Gun followed him to the bathroom.</p><br/><p>Yuan Gun Gun washed her hands, and ran back to the desk. She picked up the hot bun again, but Hao Yan Che was glaring at her. She smiled at him and heled the bun in front of his lips.</p><br/><p>‘Young master, eat this,’ Yuan Gun Gun said.</p><div></div><br/><p>Hao Yan Che bit the bun, chewed and swallowed.</p><br/><p>‘Your mum is a better cook than you,’ Hao Yan Che said.</p><br/><p>‘Of course my mummy is a better cook than me,’ Yuan Gun Gun said softly.</p><br/><p>Yuan Gun Gun picked up another hot bun, and her white teeth chomped the bun into her mouth. Hao Yan Che thought she looked like she was eating her own kind.</p><br/><p>‘You and the bun are cast from the same mould,’ Hao Yan Che said. ‘Why are you eating your own kind?’</p><br/><p>Yi Tu laughed at Hao Yan Che’s joke.</p><br/><p>Yuan Gun Gun didn’t understand Hao Yan Che’s words. She picked up a tier of food, and offered the food to Jia Tu and Yi Tu.</p><br/><p>‘Big brother Jia Tu and big brother Yi Tu, taste my mummy’s cooking too,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che knocked Yuan Gun Gun’s head.</p><br/><p>‘Ow… why did you hit my head?’ Yuan Gun Gun asked.</p><br/><p>Hao Yan Che grabbed the tier of food from Yuan Gun Gun’s hands, and ate it by himself.</p><br/><p>‘Save some for me,’ Yuan Gun Gun said. ‘I want to eat too.’</p><br/><p>Hao Yan Che closed the box, and he gave Yuan Gun Gun a warning look. She smiled at him, and patted his hand with her greasy fingers.</p><br/><p>‘Hehe… I meant my mummy’s dishes are for young master to eat,’ Yuan Gun Gun said.</p><br/><p>‘Go wash your hands,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun walked to the bathroom and mumbled she wanted to eat too.</p><br/><p>‘Why are you two giving me that look?’ Hao Yan Che asked Jia Tu and Yi Tu.</p><br/><p>‘Young master, how do you feel after eating a little round bun for the first time?’ Yi Tu asked.</p><br/><p>‘Go outside,’ Hao Yan Che ordered.</p><br/><p>‘Yes young master,’ Jia Tu and Yi Tu said and left.</p><br/><p>Hao Yan Che ignored Jia Tu and Yi Tu’s laugher from outside the door. He opened the box again, and looked at the hot buns. He wondered if their big sister would taste delicious like them.</p><br/><p>***</p><br/><p>End of Chapter Thirty-Eight</p><br/>\n</div>"}