{"title": "Chapter 85", "id": 85, "volume": 1, "url": "http://boxnovel.org/beloved-little-treasure-chapter-85", "volume_title": "Volume 1", "body": "<h1>Chapter 85</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>‘Gun Gun, I’m building a castle for you using my own hands,’ Na Liu Ting Du said. ‘Will you be my queen?’</p><br/><p>‘Queen?’ Yuan Gun Gun asked.</p><br/><p>‘Yes,’ Na Liu Ting Du said. ‘Are you willing to be my wife?’</p><br/><p>‘Wife?’ Yuan Gun Gun asked.</p><br/><p>‘Yes,’ Na Liu Ting Du said. ‘You’ll be my wife and I’ll be your husband. That way we’ll always be together.’</p><br/><p>‘Impossible,’ Yuan Gun Gun said. ‘It’s not practical if we’re always together. What happens when you want to eat, but I want to go to the bathroom?’</p><br/><p>Na Liu Ting Du laughed. Yuan Gun Gun’s backward way of thinking dispelled the romantic atmosphere he weaved.</p><br/><p>‘Gun Gun, you’re amazing,’ Na Liu Ting Du said. ‘What should I do with you?’</p><br/><p>‘What are you saying?’ Yuan Gun Gun asked.</p><br/><p>‘Gun Gun, forget I’m your big brother,’ Na Liu Ting Du said. ‘I’m Na Liu Ting Du, and you’re Yuan Gun Gun. I’m a man, and you’re a woman. In your heart, I don’t want to be your big brother. I want to be your husband.’</p><br/><p>‘Are you saying you want to take me?’ Yuan Gun Gun asked.</p><br/><p>‘I want to marry you,’ Na Liu Ting Du said. ‘Not take you.’</p><br/><p>‘I understand,’ Yuan Gun Gun said. ‘Like how if you take mummy away from daddy, daddy will kill you.’</p><br/><p>Na Liu Ting Du was lost for words.</p><br/><p>‘But big brother Du, you can’t marry me,’ Yuan Gun Gun said. ‘You’re my big brother.’</p><br/><p>‘Starting from today, don’t think of me as your big brother,’ Na Liu Ting Du said.</p><br/><p>‘But…’ Yuan Gun Gun said.</p><br/><p>‘Gun Gun, you don’t need to give me an answer today,’ Na Liu Ting Du said. ‘I’ll wait three years to hear your answer.’</p><br/><p>Yuan Gun Gun sat in silence. She didn’t know what to say or think.</p><br/><p>At half past one, Hao Yan Che returned to his office but he didn’t see his rice ball. He immediately called her phone.</p><br/><p>‘Hello,’ Na Liu Ting Du greeted. ‘Are you looking for Gun Gun?’</p><br/><p>‘Where is she?’ Hao Yan Che asked.</p><br/><p>‘Does she need your permission to see me?’ Na Liu Ting Du asked.</p><div></div><br/><p>‘Don’t provoke me,’ Hao Yan Che said. ‘If you do, you’ll only make her suffer.’</p><br/><p>‘You dare?’ Na Liu Ting Du asked.</p><br/><p>‘Why don’t you ask her if I dare or not?’ Hao Yan Que asked.</p><br/><p>‘Don’t be delusional,’ Na Liu Ting Du said. ‘You only have three years with her.’</p><br/><p>‘I get to decide whether I’m with her for three years, thirty years or three hundred years,’ Hao Yan Che said. ‘You’re the delusional one.’</p><br/><p>Na Liu Ting Du saw Yuan Gun Gun coming back from the bathroom. He hung up and put the phone in its original spot.</p><br/><p>On the other end, Hao Yan Che smashed the phone against a wall.</p><br/><p>‘Yi Tu, Jia Tu, go find her and bring her back here,’ Hao Yan Che ordered.</p><br/><p>Yi Tu and Jia Tu didn’t want to end up like the broken phone. They quickly left Hao Yan Che’s office to look for Yuan Gun Gun.</p><br/><p>At Ting’s cafe, Yuan Gun Gun looked at the clock above the counter and panicked.</p><br/><p>‘Big brother Du, I need to get back to work,’ Yuan Gun Gun said.</p><br/><p>‘Eat your meal first,’ Na Liu Ting Du said.</p><br/><p>‘But I need to go,’ Yuan Gun Gun said.</p><br/><p>‘I said eat your meal,’ Na Liu Ting Du said.</p><br/><p>Yuan Gun Gun was shocked. She didn’t know when Na Liu Ting Du turned temperamental like Hao Yan Che.</p><br/><p>‘You shouldn’t waste food,’ Na Liu Ting Du said.</p><br/><p>Yuan Gun Gun heard Na Liu Ting Du’s usual gentle tone, and felt like she was seeing things before.</p><br/><p>Yuan Gun Gun ate her meal and occasionally looked at Na Liu Ting Du’s face to be certain it was Na Liu Ting Du.</p><br/><p>Na Liu Ting Du broke the pair of glasses in his hands, and vowed to be himself.</p><br/><p>At ten to two in the afternoon, Yuan Gun Gun ate a plate of egg tarts, a sundae and drank milk tea.</p><br/><p>‘Big brother Du, I’m done eating,’ Yuan Gun Gun said. ‘Let’s go.’</p><br/><p>‘Alright,’ Na Liu Ting Du said. ‘I’ll take you back to work.’</p><br/><p>***</p><br/><p>End of Chapter Eighty-Five</p><br/>\n</div>"}