{"title": "Chapter 83", "id": 83, "volume": 1, "url": "http://boxnovel.org/beloved-little-treasure-chapter-83", "volume_title": "Volume 1", "body": "<h1>Chapter 83</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>‘Don’t make me say it a second time,’ Hao Yan Che said.</p><br/><p>‘But… it’s a waste…’ Yuan Gun Gun mumbled.</p><br/><p>Hao Yan Che stood and walked to Yuan Gun Gun. She gave him the orchids, and he tossed them in the bin.</p><br/><p>‘Today you’re not allowed to eat dessert,’ Hao Yan Che said.</p><br/><p>‘Why?’ Yuan Gun Gun asked.</p><br/><p>Hao Yan Che sat back in his chair.</p><br/><p>‘You’re being unreasonable,’ Yuan Gun Gun said.</p><br/><p>‘Tomorrow you’re not allowed to eat dessert either,’ Hao Yan Che said.</p><br/><p>‘You…’ Yuan Gun Gun mumbled.</p><br/><p>‘What?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun stomped a foot, and sat at her desk.</p><br/><p>At the Hao Mansion study room at ten that night, Yi Tu gave Ning San Yuan’s file to Hao Yan Che.</p><br/><p>‘Young master, here is Ning San Yuan’s file,’ Yi Tu said.</p><br/><p>Hao Yan Che opened the file, and read Ning San Yuan’s work duties.</p><br/><p>‘Tomorrow transfer him to Canberra (Australia’s ACT, midway between Sydney and Melbourne),’ Hao Yan Che said. ‘Promote him and give him a five thousand dollar bonus.’</p><br/><p>Hao Yan Che threw the file on the desk, stood and walked to the master bedroom.</p><br/><p>‘Young master knows how to give out punishments and rewards,’ Yi Tu said to Jia Tu. ‘Young master is jealous, but he got rid of a love rival under a guise of a promotion.’</p><br/><p>Jia Tu silently agreed.</p><br/><p>In the master bedroom, Yuan Gun Gun was too upset to watch TV. The door opened, she turned her back to Hao Yan Che and pulled the bedsheet over her head. He ignored her childish antics, and walked to the bathroom.</p><br/><p>Later Yuan Gun Gun felt Hao Yan Che got into bed, and she moved close to the edge of the bed.</p><br/><p>‘Do you want me to kick you out of bed?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun moved away from the edge of the bed. Hao Yan Che hugged her.</p><br/><p>‘You dare act like a mistress in front of me?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun didn’t open her mouth.</p><br/><p>‘Are you mute?’ Hao Yan Che asked.</p><br/><p>Hao Yan Che nibbled and kissed Yuan Gun Gun’s lips.</p><br/><p>‘You’re not allowed to receive flowers from another man,’ Hao Yan Che said.</p><br/><p>Hao Yan Che nibbled Yuan Gun Gun’s neck.</p><br/><p>‘Did you hear me?’ Hao Yan Che asked.</p><br/><p>‘Yes,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che bit Yuan Gun Gun’s neck, and left his teeth mark on her neck.</p><div></div><br/><p>‘What about my dessert?’ Yuan Gun Gun asked.</p><br/><p>‘You want to eat dessert?’ Hao Yan Che asked.</p><br/><p>‘Yes,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che unbuttoned Yuan Gun Gun’s night shirt and he cupped Yuan Gun Gun’s breasts.</p><br/><p>‘If you bend your head you’ll get to eat sweet buns,’ Hao Yan Che teased.</p><br/><p>Yuan Gun Gun blushed.</p><br/><p>‘Look at the appetizing pink peaks on the sweet buns,’ Hao Yan Che whispered in Yuan Gun Gun’s ear.</p><br/><p>Hao Yan Che massaged Yuan Gun Gun’s breasts until her nipples hardened.</p><br/><p>‘I… don’t want to eat,’ Yuan Gun Gun said.</p><br/><p>‘You don’t want to eat dessert?’ Hao Yan Che asked.</p><br/><p>Hao Yan Che looked at Yuan Gun Gun’s rosy face in the dark.</p><br/><p>‘Little Chub, I’m hungry,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun wiggled her body under Hao Yan Che’s body, but she couldn’t escape.</p><br/><p>‘You can bend your head and eat sausage,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che was surprised to hear dirty talk from Yuan Gun Gun’s mouth. He let go of her breasts and pinched her bottom.</p><br/><p>‘Who taught you?’ Hao Yan Che asked.</p><br/><p>‘I don’t need someone to teach me,’ Yuan Gun Gun said. ‘I’m not smart. But at least I know the difference between a man’s body and a woman’s body. I know two people should only kiss on the lips if they love each other. I know in the mornings how hard and excited your little brother is when your little brother is rubbing against my body.’</p><br/><p>Hao Yan Che laughed and kissed Yuan Gun Gun’s cheek.</p><br/><p>‘You’re not a total dummy,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun thought Hao Yan Che was in a good mood. She held his face and smiled at him in the dark.</p><br/><p>‘Young master, tomorrow I want to eat dessert,’ Yuan Gun Gun said.</p><br/><p>‘No,’ Hao Yan Che said and kissed Yuan Gun Gun’s nose.</p><br/><p>‘Why?’ Yuan Gun Gun asked.</p><br/><p>‘No reason,’ Hao Yan Che said.</p><br/><p>‘What about the day after tomorrow?’ Yuan Gun Gun asked.</p><br/><p>‘I’ll think about it,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun found a comfortable spot on Hao Yan Che’s chest and closed her eyes. If she could see in the dark, she would see his violet eyes looking at her face lovingly.</p><br/><p>***</p><br/><p>End of Chapter Eighty-Three</p><br/>\n</div>"}