{"title": "Chapter 104", "id": 104, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-104", "volume_title": "Volume 2", "body": "<h1>Chapter 104</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Warning: Chapter 104 contains SV and likely to cause distress for readers. Readers under 18 do not read chapter 104.</p><br/><p>In reality, any form of violence against females or males is not condoned.</p><br/><p>‘I’ll let you eat the ice-cream,’ Na Liu Ting Du said.</p><br/><p>Yuan Gun Gun held a spoon of ice-cream in front of Na Liu Ting Du’s mouth.</p><br/><p>‘Big brother Du should eat too,’ Yuan Gun Gun said. ‘It’s not fun if I eat ice-cream by myself.’</p><br/><p>Na Liu Ting Du ate the ice-cream Yuan Gun Gun offered and smiled back at her.</p><br/><p>‘What’s wrong?’ Yuan Gun Gun asked.</p><br/><p>Yuan Gun Gun rubbed her face to see if she had ice-cream on her face because Na Liu Ting Du was looking at her strangely.</p><br/><p>‘Nothing,’ Na Liu Ting Du said and drank coffee.</p><br/><p>‘Ah!’ Yuan Gun Gun cried out. She was scared to see the clock on the wall. ‘It’s eleven twenty. Big brother Du, take me home. Che is going to kill me.’</p><br/><p>Na Liu Ting Du didn’t want to hear Yuan Gun Gun wanting to go home to Hao Yan Che. He knocked the cups and ice-cream platter off the table.</p><br/><p>‘Big brother Du…’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun was startled by Na Liu Ting Du’s indifferent expression.</p><br/><p>‘Do I have a place in your heart?’ Na Liu Ting Du asked.</p><br/><p>Yuan Gun Gun stood, and took steps away from Na Liu Ting Du.</p><br/><p>Na Liu Ting Du stood and loomed over Yuan Gun Gun.</p><br/><p>‘Right now in your heart is there only Hao Yan Che?’ Na Liu Ting Du asked.</p><br/><p>‘No,’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun was cornered to a wall. Na Liu Ting Du pulled down her collar, Hao Yan Che’s kiss marks were all over her neck, shoulders and collar bone.</p><br/><p>Yuan Gun Gun covered her neck.</p><br/><p>‘Big brother Du… what’s wrong?’ Yuan Gun Gun asked.</p><br/><p>Na Liu Ting Du pulled Yuan Gun Gun’s hands away. He ripped her shirt and forcibly kissed her lips.</p><br/><p>Yuan Gun Gun was scared of Na Liu Ting Du. She pushed his chest away from her. He wouldn’t let her go. He felt like a scary stranger to her. She didn’t know what happened to her gentle big brother.</p><br/><p>Yuan Gun Gun bit Na Liu Ting Du’s tongue hard, but he didn’t pull away.</p><br/><p>‘No,’ Yuan Gun Gun said.</p><div></div><br/><p>In Yuan Gun Gun’s head there was only Hao Yan Che. She wanted Hao Yan Che to appear.</p><br/><p>Na Liu Ting Du didn’t care if Yuan Gun Gun was in pain. He forced her onto the floor, and his hands moved all over her soft body.</p><br/><p>‘It hurts,’ Yuan Gun Gun said and cried loudly.</p><br/><p>Yuan Gun Gun wanted Na Liu Ting Du to get off her.</p><br/><p>‘Gun Gun,’ Na Liu Ting Du called.</p><br/><p>Na Liu Ting Du left his teeth mark on Na Liu Ting Du’s body.</p><br/><p>‘Big brother Du… no!’ Yuan Gun Gun said. ‘Don’t do this.’</p><br/><p>Yuan Gun Gun couldn’t move her body to run away.</p><br/><p>‘Gun Gun, you’re mine,’ Na Liu Ting Du said.</p><br/><p>Na Liu Ting Du kissed Yuan Gun Gun’s lips of tears.</p><br/><p>‘Big brother Du, stop!’ Yuan Gun Gun said. ‘Che, where are you?’</p><br/><p>Yuan Gun Gun calling out Che’s name made Na Liu Ting Du livid.</p><br/><p>‘Don’t call his name!’ Na Liu Ting Du said.</p><br/><p>‘Stop!’ Yuan Gun Gun said.</p><br/><p>‘Let me love you,’ Na Liu Ting Du said and kissed Yuan Gun Gun’s tearful face.</p><br/><p>‘Big brother Du, I’m begging you to stop,’ Yuan Gun Gun said.</p><br/><p>Na Liu Ting Du pretended he didn’t’ hear Yuan Gun Gun’s pleas. He pulled down his pants, his hands played with her body and his body.</p><br/><p>‘I only like Che,’ Yuan Gun Gun said. ‘Big brother Du, I’m begging you to stop. Don’t do this.’</p><br/><p>Na Liu Ting Du heard Yuan Gun Gun’s choked sobs, he discharged on her chest and his hands stopped moving on her body.</p><br/><p>‘Gun Gun, I’m sorry,’ Na Liu Ting Du said.</p><br/><p>Na Liu Ting Du licked his wet substance off Yuan Gun Gun’s body. She only felt repulsed and wanted to be far away from him.</p><br/><p>‘Big brother Du, stop,’ Yuan Gun Gun said.</p><br/><p>‘Gun Gun, I was slow from the start,’ Na Liu Ting Du said. ‘I lived with you for years, but I couldn’t hold onto you. I only have myself to blame. Gun Gun, you’re my slow burn addiction. There is no cure for me to get over you after being addicted to you for years. Tell me what I should do? How do I stop being addicted to you?’</p><br/><p>‘Big brother Du, don’t be like this,’ Yuan Gun Gun said.</p><br/><p>***</p><br/><p>End of Chapter 104</p><br/>\n</div>"}