{"title": "Chapter 109", "id": 109, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-109", "volume_title": "Volume 2", "body": "<h1>Chapter 109</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Hao Yan Che wiped Yuan Gun Gun’s mouth.</p><br/><p>‘Take a painkiller and soak your body in herbal water,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun shook her head.</p><br/><p>‘I’m not asking for your opinion,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun pushed Hao Yan Che’s chest.</p><br/><p>‘I don’t want to!’ Yuan Gun Gun said in a hoarse voice.</p><br/><p>‘Does your throat hurt?’ Hao Yan Che asked. ‘Why are you crying?’</p><br/><p>‘Hurts,’ Yuan Gun Gun said. ‘I don’t want to.’</p><br/><p>‘You need to,’ Hao Yan Che said.</p><br/><p>‘No,’ Yuan Gun Gun said.</p><br/><p>‘Be quiet,’ Hao Yan Che said. ‘You’re hurting my ears.’</p><br/><p>‘Then you shouldn’t hurt my ears,’ Yuan Gun Gun said.</p><br/><p>‘Why don’t you call your big brother Du to confront me on your behalf?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun closed her mouth.</p><br/><p>Hao Yan Che stormed out of the bedroom.</p><br/><p>Yuan Gun Gun fell into dark thoughts. She didn’t have a big brother to rely on anymore. Na Liu Ting Du was the one person in her life who used to love her and took care of her since she was five. But she couldn’t rely on him anymore.</p><br/><p>In the evening, Hao Yan Che returned to the bedroom. Yuan Gun Gun was crying in her sleep. He sat on the bed next to her, and patted her shoulder.</p><br/><p>‘Yuan Gun Gun,’ Hao Yan Che called.</p><br/><p>Yuan Gun Gun murmured on a pillow. Hao Yan Che helped her sit up on the bed. She opened her eyes and looked at him.</p><br/><p>Hao Yan Che picked up a warm bowl of herbal broth, and began feeding the broth to Yuan Gun Gun.</p><br/><p>‘Tastes bad,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che put another spoon of broth into Yuan Gun Gun’s mouth.</p><br/><p>‘I don’t want to eat,’ Yuan Gun Gun said.</p><div></div><br/><p>‘Eat,’ Hao Yan Che said.</p><br/><p>A while later, the bowl of herbal broth was empty.</p><br/><p>Hao Yan Che took the empty bowl outside, and Yuan Gun Gun slept.</p><br/><p>At eleven at night, Yuan Gun Gun woke up naked in Hao Yan Che’s arms.</p><br/><p>‘Ah!’ Yuan Gun Gun screamed.</p><br/><p>‘Be quiet unless you want me to drown you,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun hugged Hao Yan Che’s neck. She didn’t want to soak her body in the herbal water.</p><br/><p>‘If you don’t let go and stop crying, I’ll drown you,’ Hao Yan Che said.</p><br/><p>‘No,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che undressed, and got into the bathtub of herbal water with Yuan Gun Gun. The smell of herbal water was like dung to his nose. He didn’t know why he sacrificed himself for Yuan Gun Gun. Why couldn’t he drown her and send her back to the Yuan Mansion?</p><br/><p>‘I want to go outside,’ Yuan Gun Gun said.</p><br/><p>The herbal water stung Yuan Gun Gun’s body.</p><br/><p>‘In thirty minutes,’ Hao Yan Che said.</p><br/><p>‘I want to go outside,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che closed his eyes, and held Yuan Gun Gun in the herbal water. She hugged his neck so she wouldn’t drown. But their naked bodies being close together made her feel strange.</p><br/><p>Thirty minutes later, Hao Yan Che kept his promise. He carried Yuan Gun Gun out of the herbal water, helped rinse and dry her body and carried her to the bed.</p><br/><p>Hao Yan Che went back to the bathroom to rinse the herbal water dung smell off his body. After he returned to the bed, Yuan Gun Gun rolled the bedsheet around her body like an Eskimo.</p><br/><p>***</p><br/><p>End of Chapter 109</p><br/>\n</div>"}