{"title": "Chapter 115", "id": 115, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-115", "volume_title": "Volume 2", "body": "<h1>Chapter 115</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>The next seven nights, Yuan Gun Gun had nightmares. Hao Yan Che gave her a bit of his blood to help her sleep. She was sheltered by her parents, it would be strange if she wasn’t scared of the serial killer.</p><br/><p>‘Che…’ Yuan Gun Gun murmured in her sleep.</p><br/><p>Hao Yan Che stroked Yuan Gun Gun’s back and kissed her forehead.</p><br/><p>‘It’s OK,’ Hao Yan Che said. ‘I’m here. Sleep.’</p><br/><p>Hours later, Yuan Gun Gun woke up.</p><br/><p>‘Today we’re not going to work,’ Hao Yan Che said. ‘Go change your clothes and I’ll take you out.’</p><br/><p>‘Where are you taking me?’ Yuan Gun Gun asked.</p><br/><p>‘Go change your clothes,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun went to the bathroom, brushed, washed and changed her clothes.</p><br/><p>One hour later, Yuan Gun Gun sat next to Hao Yan Che at a restaurant. He fed her sweet and sour ribs. But it was the plates of desserts on the table that surprised her.</p><br/><p>‘Che, there are too many dishes on the table,’ Yuan Gun Gun said. ‘We won’t be able to eat it all.’</p><br/><p>‘I know,’ Hao Yan Che said.</p><br/><p>Hao Yan Che put a shumai in Yuan Gun Gun’s mouth.</p><br/><p>Yuan Gun Gun didn’t understand why Hao Yan Che took her out to eat a meal at a crowded restaurant. In the past he hated being in noisy places. But the sounds of chatter and glasses clinking helped calmed her anxiety.</p><br/><p>‘Eat,’ Hao Yan Che said. ‘The food is getting cold.’</p><br/><p>For several days Yuan Gun Gun lost her appetite. She lost a lot of weight and looked sick. Even she didn’t want to look at herself in the mirror.</p><br/><p>Hao Yan Che watched Yuan Gun Gun eat, and he endured the noisy surroundings.</p><div></div><br/><p>‘This tripe tastes delicious,’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun fed Hao Yan Che a tripe. He was relieved to see her smile. If she smiled, he felt his world was at peace.</p><br/><p>Three hours later, Hao Yan Che took Yuan Gun Gun to an amusement park. He was unhappy she was having too much fun and didn’t pay attention to him.</p><br/><p>Five hours later, Hao Yan Che and Yuan Gun Gun sat on a bench under a shady tree.</p><br/><p>‘Thank you Che, it’s been a long time since I had fun at an amusement park,’ Yuan Gun Gun said. ‘You’re the best.’</p><br/><p>Yuan Gun Gun linked arms with Hao Yan Che. Strangers would have thought they were lovers. But she didn’t know how he saw her. To him, was she his lover, maid or secretary?</p><br/><p>Hao Yan Che opened a bottle of water and passed it to Yuan Gun Gun. She drank half the bottle and felt satisfied.</p><br/><p>‘Where do you want to go next?’ Hao Yan Che asked.</p><br/><p>‘I want to go to the zoo,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che’s nose twitched.</p><br/><p>‘You don’t want to go?’ Yuan Gun Gun asked.</p><br/><p>‘Let’s go,’ Hao Yan Che said.</p><br/><p>One hour later, Hao Yan Che walked around the zoo and looked like he wanted to vomit. Yuan Gun Gun was right, having a strong sense of smell like Xiao Chi who fainted from vomit odor was a curse.</p><br/><p>‘Che, are you OK?’ Yuan Gun Gun asked. ‘You look sick.’</p><br/><p>‘It’s nothing,’ Hao Yan Che said.</p><br/><p>Hao Yan Che held Yuan Gun Gun’s hand. He walked quickly to the zoo’s restaurant so his nose could escape the torturous dung odors.</p><br/><p>***</p><br/><p>End of Chapter 115</p><br/>\n</div>"}