{"title": "Chapter 121", "id": 121, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-121", "volume_title": "Volume 2", "body": "<h1>Chapter 121</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Warning: Chapter 121 has incest references, and may cause some readers distress.</p><br/><p>Yuan Gun Gun opened her eyes. Qi Tu had changed into a golden werewolf. The golden werewolf viciously bit off the French woman’s flesh piece by piece. The French woman’s blood shot eyes were opened and looked in Yuan Gun Gun’s direction.</p><br/><p>‘Ah!’ Yuan Gun Gun screamed.</p><br/><p>The golden werewolf looked at Yuan Gun Gun. It widened its mouth, bit another flesh chunk off the French woman’s body, spat it out in Yuan Gun Gun’s direction and blood dripped onto the floor.</p><br/><p>‘Big brother Qi Tu, are you crazy?’ Yuan Gun Gun asked. ‘Don’t do that to the woman!’</p><br/><p>The werewolf bit off the French woman’s chest, and ate her heart.</p><br/><p>The werewolf jumped off the bed, and changed into the naked Qi Tu. He stood drenched in blood in front of Yuan Gun Gun.</p><br/><p>‘Che… Che… Che…’ Yuan Gun Gun called and cried.</p><br/><p>Qi Tu dressed, and his bloodied hands clutched Yuan Gun Gun’s head.</p><br/><p>‘Xue Yi is more beautiful than you,’ Qi Tu said.</p><br/><p>The moment Yuan Gun Gun blinked again, Hao Yan Che knocked down the door and glared at Qi Tu.</p><br/><p>‘Che…’ Yuan Gun Gun called.</p><br/><p>‘Qi Tu, what do you want?’ Hao Yan Che asked.</p><br/><p>Qi Tu’s bloodied hands rubbed blood on Yuan Gun Gun’s face.</p><br/><p>‘I want to be the werewolf king,’ Qi Tu said.</p><br/><p>Hao Yan Che didn’t hesitate to take off the werewolf ring on his left thumb. He threw it and Qi Tu caught it.</p><br/><p>‘Let her go,’ Hao Yan Che said.</p><br/><p>Qi Tu’s fingernails cut the ropes binding Yuan Gun Gun. She stood, and took a step toward Hao Yan Che. Qi Tu pulled her long hair, held her neck and licked blood off her face.</p><br/><p>‘Don’t!’ Yuan Gun Gun said.</p><br/><p>Qi Tu’s bloodied body made Yuan Gun Gun nauseous.</p><br/><p>‘Qi Tu, don’t take it too far,’ Hao Yan Che said.</p><br/><p>Hao Yan Che’s voice was calm, but his clenched hands betrayed his true feelings.</p><br/><p>‘What sort of a king are you?’ Qi Tu asked. ‘Why did you make this pathetic woman your queen? Why did you let her drink your blood and made her an immortal? Yet you let the beautiful Xue Yi die in front of you and refused to save Xue Yi.’</p><br/><p>‘Qi Tu, you know clearly Xue Yi killed herself,’ Hao Yan Che said.</p><div></div><br/><p>Hao Yan Che’s heart hurt to see how scared Yuan Gun Gun was.</p><br/><p>‘Xue Yi killed herself because of you,’ Qi Tu said.</p><br/><p>Qi Tu’s bloodied hands rubbed blood on Yuan Gun Gun’s neck.</p><br/><p>‘Its’ Xue Yi’s choice whether she wanted to live or die,’ Hao Yan Che said. ‘She choice to die.’</p><br/><p>‘You are the Vampire King’s son,’ Qi Tu said. ‘Your blood could have saved Xue Yi. Why did you refuse to save her?’</p><br/><p>Qi Tu squeezed Yuan Gun Gun’s neck. A second later Hao Yan Che stood behind Qi Tu and aimed a silver gun at Qi Tu’s heart.</p><br/><p>‘Qi Tu, don’t force me,’ Hao Yan Che said.</p><br/><p>Qi Tu let go of Yuan Gun Gun, and turned around to face Hao Yan Che. Bloodied tears flowed down Qi Tu’s face.</p><br/><p>‘Do you know how important Xue Yi is to me?’ Qi Tu asked. ‘I love her. I love my twin sister. I’ve loved her since we were children. But she loved you since she was a little girl. I thought if she married you, I would be happy to see her happy. You’re my king and friend. We grew up together. How can you be this cruel to us?’</p><br/><p>Hao Yan Che threw the gun away.</p><br/><p>‘Xue Yi said if I don’t love her then I shouldn’t save her,’ Hao Yan Che said.</p><br/><p>Qi Tu’s shocked eyes looked at Hao Yan Che.</p><br/><p>‘Qi Tu, do you understand how hard it is to live forever?’ Hao Yan Che asked.</p><br/><p>Hao Yan Che tried to put the werewolf ring onto Qi Tu’s left thumb, but a bright white light emitted from the werewolf ring and the werewolf ring rejected Qi Tu’s left thumb.</p><br/><p>Qi Tu stood in disbelief.</p><br/><p>‘Now do you understand?’ Hao Yan Che asked.</p><br/><p>Qi Tu laughed despairingly.</p><br/><p>‘I never wanted this but I can’t escape my fate,’ Hao Yan Che said.</p><br/><p>Hao Yan Che put the werewolf ring back on his left thumb, and stroked Yuan Gun Gun’s shivering back.</p><br/><p>Qi Tu picked up the silver gun. Yuan Gun Gun fainted in Hao Yan Che’s arms. Someone behind Qi Tu flung the silver gun out of Qi Tu’s hand and knocked Qi Tu unconscious.</p><br/><p>Hao Yan Che carried Yuan Gun Gun to the silver Rolls-Royce.</p><br/><p>***</p><br/><p>End of Chapter 121</p><br/>\n</div>"}