{"title": "Chapter 124", "id": 124, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-124", "volume_title": "Volume 2", "body": "<h1>Chapter 124</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>The night before Hao Yan Che and Yuan Gun Gun’s wedding day.</p><br/><p>‘I feel like I’m a witch that forced a moon like you to marry me,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che patted Yuan Gun Gun’s bottom.</p><br/><p>‘Ow… it’s true,’ Yuan Gun Gun said. ‘You don’t look happy to marry me.’</p><br/><p>Yuan Gun Gun laid in bed. By the following day she would be Hao Yan Che’s wife. She felt like he didn’t want to marry her. But she was happy in three years she didn’t have to be separated from him.</p><br/><p>‘Why are you smiling like a fool?’ Hao Yan Che asked.</p><br/><p>‘Che, when will you love me?’ Yuan Gun Gun asked.</p><br/><p>‘I don’t know,’ Hao Yan Che said.</p><br/><p>‘When…’ Yuan Gun Gun said.</p><br/><p>‘Sleep,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun slept soundly that night. Hao Yan Che looked at her sleeping face in the dark and sighed. He didn’t know why she couldn’t feel how much he loved her.</p><br/><p>The morning of Hao Yan Che’s and Yuan Gun Gun’s wedding day, Yuan Gun Gun had a final wedding dress fitting.</p><br/><p>In a room at the Hao Mansion reserved for Yuan Gun Gun’s personal fitting room, Yuan Gun Gun rubbed her flat stomach. She was hungry, and wondered when she could eat.</p><br/><p>‘Miss Yuan, all these wedding dresses are designed by Mr Hao,’ an assistant said. ‘Which wedding dress do you like?’</p><br/><p>‘The wedding dresses are all beautiful,’ Yuan Gun Gun said. ‘It’s hard for me to choose. I don’t mind wearing any of the wedding dresses.’</p><br/><p>‘What about this dress?’ the assistant asked.</p><br/><p>The assistant held a collar laced white wedding dress with embroidered diamond beads and a wide tail that flowed to the floor.</p><br/><p>‘OK,’ Yuan Gun Gun said. ‘I’ll take this wedding dress.’</p><br/><p>‘Mr Hao instructed for the wedding dresses Miss Yuan didn’t want to be taken to room fifty-five,’ the assistant said to the servants.</p><br/><p>The servants took the other wedding dresses to room fifty-five in an orderly fashion.</p><br/><p>‘Are all the wedding dresses mine?’ Yuan Gun Gun asked.</p><br/><p>‘Yes,’ the assistant said. ‘Mr Hao also designed dresses for Miss Yuan to wear tonight at the wedding reception.’</p><br/><p>The assistant smiled at Yuan Gun Gun, and went to store the wedding dress Yuan Gun Gun chose in a safe place. The assistant knew Yuan Gun Gun didn’t have to worry about the diamond beads that all the servants’ lifetime work pay combined wouldn’t be enough to buy the wedding dress.</p><div></div><br/><p>Yuan Gun Gun wanted to call Hao Yan Che. She picked up her phone, and received an international caller ID.</p><br/><p>‘Hello,’ Yuan Gun Gun greeted.</p><br/><p>‘Gun Gun,’ Na Liu Ting Du said.</p><br/><p>‘Big brother Du?’ Yuan Gun Gun asked.</p><br/><p>Yuan Gun Gun was sad and happy to hear Na Liu Ting Du’s voice.</p><br/><p>‘It’s me,’ Na Liu Ting Du said.</p><br/><p>‘Big brother Du, why did you have to move to Paris?’ Yuan Gun Gun asked. ‘Don’t you need your little sister anymore? Why did you leave without saying goodbye?’</p><br/><p>‘Gun Gun, you’re about to get married,’ Na Liu Ting Du said. ‘You’re not a little girl anymore. You shouldn’t cry so easily.’</p><br/><p>‘Big brother Du, can’t you come back?’ Yuan Gun Gun asked. ‘If you stay in Paris, how do I see you?’</p><br/><p>‘Gun Gun, if you could only choose one person between me and Hao Yan Che, who would you choose?’ Na Liu Ting Du asked.</p><br/><p>‘I choose both,’ Yuan Gun Gun said.</p><br/><p>‘Gun Gun, since you were a little girl I gave you everything you wanted,’ Na Liu Ting Du said. ‘On this occasion you can only choose one person between me and Hao Yan Che. If you choose me, I’ll come back home and I’ll deal with the consequences. If you choose Hao Yan Che, I won’t come home and I’ll wish you happiness.’</p><br/><p>Yuan Gun Gun covered her mouth and muffled a cry.</p><br/><p>Na Liu Ting Du gambled everything one last time. He looked at the smiling photo of Yuan Gun Gun he carried around everywhere with him, and he knew he lost everything.</p><br/><p>‘I’ll help you choose,’ Na Liu Ting Du said. ‘I choose to wish you eternal happiness.’</p><br/><p>Yuan Gun Gun sat on the floor and cried a river of tears.</p><br/><p>On the other end Na Liu Ting Du laughed sadly at himself. He knew he shouldn’t have called Yuan Gun Gun one last time. But he wanted the glimmer of hope that Yuan Gun Gun would choose him to come true. He regretted he had to wake up from a fleeting beautiful dream, and lost the most important person to him.</p><br/><p>***</p><br/><p>End of Chapter 124</p><br/>\n</div>"}