{"title": "Chapter 135", "id": 135, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-135", "volume_title": "Volume 2", "body": "<h1>Chapter 135</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>‘Mr Yuan, Yuan Ting Liu has a surprise for you and young mistress Yuan,’ the man said. ‘He sent me here to drive you there.’</p><br/><p>‘Where?’ Feng Du Du asked.</p><br/><p>‘Follow me,’ the man said.</p><br/><p>The gullible Feng Du Du and Yuan Gun Gun held each other’s hands, and followed the man to a car.</p><br/><p>‘Mistress Feng and young mistress Yuan, take a seat in the car,’ the man said.’</p><br/><p>‘Talk less and capture them,’ the ponytail man said.</p><br/><p>The ponytail man grabbed Yuan Gun Gun’s arms.</p><br/><p>‘Ah… let me go!’ Yuan Gun Gun said.</p><br/><p>‘Gun Gun, let go… let go of me!’ Feng Du Du said.</p><br/><p>The man grabbed Feng Du Du too, and neither mother nor daughter could move.</p><br/><p>‘Let go of us!’ Yuan Gun Gun said.</p><br/><p>‘Who are you?’ Feng Du Du asked.</p><br/><p>Yuan Gun Gun bit the ponytail’s arm hard. The ponytail man threw Yuan Gun Gun to the ground.</p><br/><p>‘Gun Gun…’ Feng Du Du called.</p><br/><p>‘Ah!’ the men cried out.</p><br/><p>A tall beautiful woman with long hair to her thighs kicked the two men’s faces. The two men fell to the ground, and looked up the woman’s dress.</p><br/><p>‘Did you two see something forbidden?’ Long Liu Bao asked.</p><br/><p>‘Does white underpants count?’ the two men asked.</p><br/><p>Long Liu Bao cracked her knuckles and smiled at the two men.</p><br/><p>‘Ah!’ the two men cried out.</p><br/><p>Long Liu Bao’s beautiful hands cracked the two men’s necks. Then she tossed the two silent men onto the ground.</p><br/><p>Long Liu Bao turned around and assessed Feng Du Du and Yuan Gun Gun for injuries.</p><br/><p>‘Are you two ladies OK?’ Long Liu Bao asked.</p><br/><p>Feng Du Du and Yuan Gun Gun looked at Long Liu Bao like she was a heroine out of fairy tale.</p><br/><p>‘What are your names?’ Long Liu Bao asked.</p><br/><p>‘Yuan Gun Gun,’ Yuan Gun Gun said.</p><br/><p>‘Feng Du Du,’ Feng Du Du said.</p><br/><p>Long Liu Bao thought she heard them called themselves little round ball and little chub. She held their soft hands, and smiled warmly at them.</p><div></div><br/><p>‘What adorable names,’ Long Liu Bao said. ‘Where are you ladies going? Do you ladies want me to take you two home?’</p><br/><p>‘To your home,’ Feng Du Du and Yuan Gun Gun said.</p><br/><p>Feng Du Du and Yuan Gun Gun followed Long Liu Bao to Long Wu’s company.</p><br/><p>Inside the CEO’s office, two handsome identical looking men were happy to see Long Liu Bao. One man looked like a gentle angel and the second man looked like an oppressive king.</p><br/><p>‘Bao Bao, why are you here?’ Long Liu Lang asked gently. ‘Didn’t you say you wanted to go shopping?’</p><br/><p>Long Liu Bao hugged Long Liu Lang.</p><br/><p>‘I saved these two lovely sisters from thugs,’ Long Liu Bao said. ‘We hit it off, and became friends.’</p><br/><p>Long Liu Bo looked at Yuan Gun Gun who looked familiar to him.</p><br/><p>‘Aren’t you Che’s wife?’ Long Liu Bo asked Yuan Gun Gun.</p><br/><p>‘Hehe… hi big brother Lang and big brother Bo,’ Yuan Gun Gun greeted.</p><br/><p>Yuan Gun Gun’s life was over. Yuan Gun Gun couldn’t believe she met the Long brothers’ little sister. Hao Yan Che was going to kill Yuan Gun Gun.</p><br/><p>‘Everyone knows each other?’ Long Liu Bao asked and stood next to Yuan Gun Gun.</p><br/><p>‘Gun Gun is your big brother Che’s little treasure,’ Long Liu Lang said.</p><br/><p>‘Hao Yan Che?’ Long Liu Bao asked.</p><br/><p>Long Liu Bo knocked Long Liu Bao’s forehead.</p><br/><p>‘Where are your manners?’ Long Liu Bo asked.</p><br/><p>‘Impossible,’ Long Liu Bao said. ‘Gun Gun can’t be the wife of the beautiful angel with a demon soul.’</p><br/><p>Yuan Gun Gun held Long Liu Bao’s hands like she met a kindred spirit. Yuan Gun Gun finally met someone who wasn’t hoodwinked by her husband’s beauty.</p><br/><p>‘Xiao Bao, even if it’s the truth, you shouldn’t let him hear you praise him like that,’ Long Liu Bo said.</p><br/><p>***</p><br/><p>End of Chapter 135</p><br/>\n</div>"}