{"title": "Chapter 140", "id": 140, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-140", "volume_title": "Volume 2", "body": "<h1>Chapter 140</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Warning: Chapter 140 has polygamy references and may cause some readers distress.</p><br/><p>‘The heavens’ crying because of me,’ Yuan Gun Gun said.</p><br/><p>‘Oh please,’ Long Liu Bao said. ‘If it’s raining it’s because the heavens’ peeing.’</p><br/><p>‘Then the heavens’ lightning bolts are striking the ground because they’re angry on my behalf,’ Yuan Gun Gun said.</p><br/><p>‘Oh please,’ Long Liu Bao said. ‘The heavens’ lightning bolts are accidental farts.’</p><br/><p>‘Then the heavens’ hailing on that hateful man on behalf of me,’ Yuan Gun Gun said.</p><br/><p>‘Oh please,’ Long Liu Bao said. ‘The heaven’s hailing because it’s their number twos.’</p><br/><p>Yuan Gun Gun had enough. She turned around and glared at her laughing friend.</p><br/><p>‘Do you actually think the heavens can’t control their bladder, farts and bowel?’ Yuan Gun Gun asked.</p><br/><p>‘Gun Gun, everyone has the same three kinds of emergencies,’ Long Liu Bao. ‘You shouldn’t assume the heavens can control every emergency.’</p><br/><p>‘What a hateful friend you are,’ Yuan Gun Gun said. ‘Can’t you sympathise with me a bit?’</p><br/><p>‘Your husband at most would pat you two times if he’s angry,’ Long Liu Bao said. ‘His heart would break if his little treasure is in pain. Not like me, I’ve been given beatings since I was a little girl.’</p><br/><p>‘Do they break your phone?’ Yuan Gun Gun asked.</p><br/><p>‘What’s a broken phone?’ Long Liu Bao asked. ‘They’ve broken my laptop before.’</p><br/><p>Yuan Gun Gun was grateful Hao Yan Che didn’t break her laptop.</p><br/><p>‘Does your husband threaten to lock you in the bedroom with him if you don’t cooperate with your husband?’ Long Liu Bao asked.</p><br/><p>‘Usually he doesn’t threaten to lock me in our bedroom with him,’ Yuan Gun Gun said. ‘He takes me to bed and keeps me in bed with him for a long time. Even if I beg him to spare me, he won’t let me go until he’s satisfied.’</p><br/><p>Long Liu Lang thought Hao Yan Che was a true monster.</p><br/><p>‘Do they hit you there?’ Yuan Gun Gun asked.</p><br/><p>‘Where?’ Long Liu Lang asked.</p><br/><p>‘You know,’ Yuan Gun Gun said. ‘On your round place.’</p><br/><p>‘Do you mean my bottom?’ Long Liu Bao asked. ‘Yes they’ve hit my bottom right in front of the servants.’</p><br/><p>Yuan Gun Gun sympathised with Long Liu Bao’s plight. The Long brothers were too much.</p><br/><p>‘Does your husband hit your head with his knuckles?’ Long Liu Bao asked.</p><br/><p>‘No,’ Yuan Gun Gun said.</p><br/><p>‘Then you’re luckier than me,’ Long Liu Bao said.</p><br/><p>‘He hits my head with his whole hand,’ Yuan Gun Gun said.</p><div></div><br/><p>The two women exchanged a sympathetic look with each other. They were born to be friends. Who else suffered the same fate as them?</p><br/><p>‘But isn’t big brother Lang gentle?’ Yuan Gun Gun asked. ‘At least if big brother Bo is angry at you, you have big brother Lang to protect you. If Che is angry at me, I have no one to protect me.’</p><br/><p>‘Do you actually think big brother Lang is gentle?’ Long Liu Bao asked.</p><br/><p>‘Yes,’ Yuan Gun Gun said. ‘Big brother Lang is gentle and caring.’</p><br/><p>Yuan Gun Gun had dreamt of marrying a gentle and caring man.</p><br/><p>‘Yes, big brother Lang is gentle and caring,’ Long Liu Bao said. ‘But if he loses his temper, he’s scarier than big brother Bo.’</p><br/><p>Long Liu Bao and Yuan Gun Gun popped a chocolate in their mouths.</p><br/><p>‘At least there are times when big brother Lang is gentle and caring,’ Yuan Gun Gun said.</p><br/><p>‘You’re right,’ Long Liu Bao said. ‘But have you thought how scarier it is for me when they’re angry at the same time? At least you only have to deal with one Hao Yan Che no matter his mood swings. When big brother Bo and big brother Lang are angry at the same time, the person who’s dead is me.’</p><br/><p>‘It sounds like you live a more dangerous life,’ Yuan Gun Gun said.</p><br/><p>‘Gun Gun, don’t you think it’s wrong for them to be with me?’ Long Liu Bao asked.</p><br/><p>‘What’s wrong about it?’ Yuan Gun Gun asked.</p><br/><p>‘Do you think it’s normal for two men to be with the same woman?’ Long Liu Bao asked.</p><br/><p>‘As long as you love them then there is nothing wrong,’ Yuan Gun Gun said. ‘I don’t think there is anything absolutely right or wrong in the world. It depends on each person if they think what they do with their own life is worth it. You and big brother Lang and big brother Bo are compatible with each other and love each other. There is nothing wrong with you being with them.’</p><br/><p>‘Thank you my dear friend,’ Long Liu Bao said.</p><br/><p>‘What is there to thank me for?’ Yuan Gun Gun asked.</p><br/><p>‘Nothing,’ Long Liu Bao said and pinched Yuan Gun Gun’s cheeks.</p><br/><p>‘The truth is I wanted a husband who is gentle and caring like big brother Lang,’ Yuan Gun Gun said.</p><br/><p>‘Do you want me to help you find a gentle and caring husband?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun hugged Long Liu Bao. Why did Hao Yan Che always appear at the wrong time? Yuan Gun Gun wondered if there was bad blood between her and the heavens.</p><br/><p>***</p><br/><p>End of Chapter 140</p><br/>\n</div>"}