{"title": "Chapter 157", "id": 157, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-157", "volume_title": "Volume 2", "body": "<h1>Chapter 157</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Hao Yan Che gripped the letter, and his violet eyes gleamed murderously.</p><br/><p>‘My suspicion is right,’ Long Liu Bo said.</p><br/><p>The gentle Long Liu Lang lost his temper. He took out his phone, and called Fang Kuang.</p><br/><p>‘Fang Kuang, I want you to send a search party to the airport,’ Long Liu Lang said. ‘Search every corner of the airport. If no one finds Long Liu Bao after half an hour, you know the drill. Stop all planes from arriving or departing the airport. If she protests, you have my permission to knock her unconscious and bring her home.’</p><br/><p>‘Yes young master Lang,’ Fang Kuang said.</p><br/><p>Long Liu Lang hung up the phone.</p><br/><p>‘Big brother Che, I’m sorry,’ Long Liu Lang said. ‘It’s the Long Household’s fault for not knowing how to discipline our little trouble maker. I promise I’ll bring your wife back without one hair strand missing.’</p><br/><p>‘After my wife returns, I’ll give her an incentive to not runaway again,’ Hao Yan Che said.</p><br/><p>Hao Yan Che understood Yuan Gun Gun’s motivation for wanting to make him happy.</p><br/><p>Long Liu Bo called Fang Lang on the phone.</p><br/><p>‘Fang Lang, I want you and Fang Ming to search all departing gates where passengers are scheduled to depart within the next three hours,’ Long Liu Bo said. ‘Don’t stop looking until you find Long Liu Bao.’</p><br/><p>‘Yes young master Bo,’ Fang Lang said.</p><br/><p>Long Liu Bo threw the phone onto the floor.</p><br/><p>‘Long Liu Bao, you’re going to die after I find you,’ Long Liu Bo vowed and walked to the bedroom.</p><br/><p>‘I’m going home,’ Hao Yan Che said. ‘I’ll order demons to search for my wife and Long Liu Bao.’</p><br/><p>On a private plane, Long Liu Bao and Yuan Gun Gun ate and drank.</p><br/><p>‘Bao Bao, didn’t you buy plane tickets?’ Yuan Gun Gun asked. ‘It’s a waste of money if we’re flying on a private plane.’</p><br/><p>‘Gun Gun, it’s called a diversion,’ Long Liu Bao said. ‘I bought plane tickets to Paris to make them think we’re going to Paris. Knowing them, they will ask big brother Fang Kuang to search for us at the airport. Big sister Lang has access to all systems at the airport. She’ll find out we bought plane tickets to Paris. Now do you understand why we’re taking a private plane to Las Vegas?’</p><br/><p>‘Bao Bao, I miss Che already,’ Yuan Gun Gun said.</p><br/><p>‘Gun Gun, don’t worry,’ Long Liu Bao said. ‘Between five to seven days, they’ll find us. Let’s think of this as work leave and have fun.’</p><br/><p>Yuan Gun Gun ate the piece of steak Long Liu Bao held up in front of her mouth, and she smiled at Long Liu Bao.</p><div></div><br/><p>‘Gun Gun, we’re going to have fun in a city that never sleeps,’ Long Liu Bao said.</p><br/><p>The two women chatted happily together while their men were going crazy looking for them.</p><br/><p>Two hours later at the Long Mansion the Long brothers were ready to kill someone after receiving bad news.</p><br/><p>‘I asked five thousand men to search the airport,’ Fang Kuang said. ‘No one found Long Liu Bao, which means she’s not at the airport.’</p><br/><p>Afterward Long Liu Lang received a phone call from Fang Lang.</p><br/><p>‘Young master Lang, young master Bo’s phone is disconnected,’ Fang Lang said. ‘So I called your phone.’</p><br/><p>‘Get to the point,’ Long Liu Lang said.</p><br/><p>‘In the airport’s system there are two plane tickets bought under Long Liu Bao,’ Fang Lang said. ‘The destination is Paris. The plane departed three and a half hours ago.’</p><br/><p>‘Um,’ Long Liu Lang said. ‘Keep looking for Long Liu Lang.’</p><br/><p>‘Yes young master Lang,’ Fang Lang said.</p><br/><p>Long Liu Lang hung up the phone and he frowned.</p><br/><p>‘Any news?’ Long Liu Bo asked.</p><br/><p>‘Fang Lang said she found two plane tickets to Paris bought under Long Liu Bao’s name,’ Long Liu Lang said. ‘It departed three and a half hours ago.’</p><br/><p>‘Three and a half hours ago?’ Long Liu Bo asked.</p><br/><p>‘Yes,’ Long Liu Lang said.</p><br/><p>‘Impossible,’ Long Liu Bo said. ‘Che brought Gun Gun here less than three and a half hours ago. Even if Bao Bao and Gun Gun sped to the airport, it’ll take them at least half an hour.’</p><br/><p>‘You’re right,’ Long Liu Lang said. ‘It means she didn’t go to the airport.’</p><br/><p>‘What?’ Long Liu Bo asked.</p><br/><p>‘I checked how much money she transferred to her card,’ Long Liu Lang said. ‘She didn’t just buy plane tickets, she bought a private plane.’</p><br/><p>At the Hao Mansion, Yi Tu was a nervous wreck looking at Hao Yan Che brooding on a chair. Like all the servants, Yi Tu didn’t expect Yuan Gun Gun would dare to escape with Long Liu Bao.</p><br/><p>‘Young master, I’ve asked all the demons around the world to be on the lookout for Gun Gun,’ Yi Tu said.</p><br/><p>Hao Yan Che looked at the full moon. He knew he couldn’t live without Yuan Gun Gun. That night he found out, being apart one day from Yuan Gun Gun was more painful than he imagined it would be.</p><br/><p>‘Yi Tu, do you think I mistreat my wife?’ Hao Yan Che asked.</p><br/><p>***</p><br/><p>End of Chapter 157</p><br/>\n</div>"}