{"title": "Chapter 152", "id": 152, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-152", "volume_title": "Volume 2", "body": "<h1>Chapter 152</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>‘I don’t want to,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che didn’t let go of Yuan Gun Gun until she napped. After she woke up, he took a bath with her, fed her and was intimate with her again. She thought he lost his conscience. How could he sleep with another woman, and slept with her like he didn’t betray her? How could he say hurtful words to her and not feel guilty?</p><br/><p>Hao Yan Che looked at his wife’s crying face. He was angry she ran away from home. Why didn’t she trust him? Why did she say she wanted to divorce him? Why couldn’t she see there was only her in his heart? Why couldn’t she understand that he wouldn’t betray her? How could he betray someone who was everything to him?</p><br/><p>‘Che, let go of me,’ Yuan Gun Gun said. ‘Why do you have to treat me this way?’</p><br/><p>‘If you know what’s good for then cooperate with me,’ Hao Yan Che said.</p><br/><p>‘Che, I was wrong,’ Yuan Gun Gun said. ‘I’m sorry. I won’t do it again. Let go of me.’</p><br/><p>‘Too late,’ Hao Yan Che said. ‘I gave you a chance, but you didn’t take it.’</p><br/><p>Hao Yan Che looked at his wife’s face. She looked like was going to faint. He kissed her lips and continued to move inside her body.</p><br/><p>A long time later, Hao Yan Che lifted Yuan Gun Gun’s bottom and planted his seed inside her.</p><br/><p>Yuan Gun Gun lost count how many times her body and Hao Yan Che’s body reached ecstasy.</p><br/><p>‘Remember that I don’t want to hear divorce come out of your mouth again,’ Hao Yan Che said. ‘You know what happens if you say divorce again.’</p><br/><p>‘I promise I won’t say it again,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che let go of Yuan Gun Gun. The moment he got out of bed to go to the bathroom, she fell asleep.</p><br/><p>At ten in the morning, Hao Yan Che woke up.</p><br/><p>‘Little rice ball, wake up,’ Hao Yan Che said.</p><div></div><br/><p>‘No… no,’ Yuan Gun Gun murmured in her sleep.</p><br/><p>Hao Yan Che regretted he was too rough with Yuan Gun Gun last night. She wasn’t an ordinary person. She drank his blood so he thought she could endure more than an ordinary person.</p><br/><p>Hao Yan Che hugged Yuan Gun Gun and stroked her back.</p><br/><p>‘You don’t need to be scared,’ Hao Yan Che said. ‘You can sleep.’</p><br/><p>Hao Yan Che loved how vulnerable Yuan Gun Gun looked when she cried. But it didn’t mean he wanted her to feel sad. He wanted her to feel how much he loved her.</p><br/><p>Hao Yan Che felt Yuan Gun Gun’s body relaxed. He kissed her forehead, let go of her and prepared for work. He planned to come home early to be with her.</p><br/><p>After Hao Yan Che left for work, Yuan Gun Gun was woken up by the nonstop ringing of her phone.</p><br/><p>‘Hello, who is it?’ Yuan Gun Gun asked.</p><br/><p>‘Gun Gun, it’s me,’ Long Liu Bao said.</p><br/><p>‘Bao Bao…’ Yuan Gun Gun called.</p><br/><p>‘Are you OK?’ Long Liu Bao asked.</p><br/><p>‘I’m OK,’ Yuan Gun Gun said. ‘Last night I was one step away from dying.’</p><br/><p>‘Gun Gun, listen to me,’ Long Liu Bao said. ‘Right now you need to act like you want to please Hao Yan Che.’</p><br/><p>‘Why?’ Yuan Gun Gun asked.</p><br/><p>‘So we can runaway together,’ Long Liu Bao said. ‘First we need to give them a false sense of security. We wait until they are deliriously happy that we’re doing everything to please them. When they put their guards down is the perfect time for us to escape. We need to show them they shouldn’t bully us, and take us for granted.’</p><br/><p>‘Runaway?’ Yuan Gun Gun asked. ‘If I runaway again, Che will kill me after he finds me.’</p><br/><p>***</p><br/><p>End of Chapter 152</p><br/>\n</div>"}