{"title": "Chapter 155", "id": 155, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-155", "volume_title": "Volume 2", "body": "<h1>Chapter 155</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Note: Chapter 155 has mature content. Readers not of a mature age, skip chapter 155.</p><br/><p>Hao Yan Che turned Yuan Gun Gun around to face him, and her legs straddled his thighs.</p><br/><p>‘What else did you learn to make me happy?’ Hao Yan Che asked.</p><br/><p>‘Bao Bao taught me to say to you that I want do a role play with you,’ Yuan Gun Gun said.</p><br/><p>‘Alright,’ Hao Yan Che said. ‘Let’s play.’</p><br/><p>Hao Yan Che kissed Yuan Gun Gun’s lips. She remembered Long Liu Bao told her to slowly rub her hand up and down Hao Yan Che’s chest.</p><br/><p>‘Little rice ball, I like you making me happy,’ Hao Yan Che said. He stood and carried Yuan Gun Gun in his arms. ‘I want you.’</p><br/><p>‘Che, wait,’ Yuan Gun Gun said. ‘What about dinner?’</p><br/><p>‘We’ll eat later,’ Hao Yan Che said.</p><br/><p>Hao Yan Che carried Yuan Gun Gun to their bedroom. He was happy she did have an epiphany.</p><br/><p>Yuan Gun Gun wrapped her arms around Hao Yan Che’s neck, and she looked hungrily over his shoulder at the abandoned delicious dinner dishes she cooked.</p><br/><p>One week later, an exhausted Yuan Gun Gun rolled onto her side of the bed.</p><br/><p>‘Che,’ Yuan Gun Gun called sweetly.</p><br/><p>‘Yes?’ Hao Yan Che asked.</p><br/><p>Hao Yan Che hugged Yuan Gun Gun’s waist from behind, and he kissed her bare shoulder.</p><br/><p>‘I want to visit Bao Bao,’ Yuan Gun Gun said.</p><br/><p>‘Why?’ Hao Yan Che asked and fondled Yuan Gun Gun’s soft breasts.</p><br/><p>‘Because I miss Bao Bao,’ Yuan Gun Gun said.</p><br/><p>‘No,’ Hao Yan Che said and pinched Yuan Gun Gun’s nipples.</p><br/><p>Yuan Gun Gun turned around and looked pitifully into Hao Yan Che’s eyes.</p><br/><p>‘Why?’ Yuan Gun Gun asked. ‘I want Bao Bao to teach me to cook new dishes so I can cook them for you to eat.’</p><br/><p>‘Your cooking isn’t bad,’ Hao Yan Che said. He stroked Yuan Gun Gun’s hair. ‘You don’t need to learn how to cook new dishes.’</p><br/><p>‘I don’t mind if you come with me to the Long Mansion,’ Yuan Gun Gun said. ‘I promise I won’t cause trouble.’</p><br/><p>Hao Yan Che loved hearing Yuan Gun Gun sweet talking him. He didn’t mind if Long Liu Bao taught Yuan Gun Gun more ways to make him happy.</p><br/><p>‘Do you really want to go?’ Hao Yan Che asked.</p><div></div><br/><p>‘Yes,’ Yuan Gun Gun said. ‘And I want to learn to cook new dishes for you.’</p><br/><p>‘If you want to go, you know what to do,’ Hao Yan Che said.</p><br/><p>‘But we’ve done it often today,’ Yuan Gun Gun said.</p><br/><p>‘If you don’t want to do it again then you can stay home,’ Hao Yan Che said.</p><br/><p>Hao Yan Che turned around. Yuan Gun Gun looked at the curve of his back, and remembered what Long Liu Bao taught her.</p><br/><p>Yuan Gun Gun hugged Hao Yan Che’s waist, and pressed her body against his back. One of her hands caressed his toned stomach. Her other hand slowly rubbed his hardness between his legs and felt his erection.</p><br/><p>Hao Yan Che’s body stiffened under Yuan Gun Gun’s touch. Her technique was clumsy, but her touch turned him rock hard.</p><br/><p>Yuan Gun Gun rubbed her breasts against Hao Yan Che’s back, and slowly licked his ear.</p><br/><p>Hao Yan Che was under Yuan Gun Gun’s spell. All she needed to do was touch him, and he would melt under her touch.</p><br/><p>Hao Yan Che gave in, he turned around and pinned her body under his body.</p><br/><p>‘Hehe… Che, your face is pink,’ Yuan Gun Gun teased.</p><br/><p>‘Do you think it’s funny?’ Hao Yan Che asked.</p><br/><p>‘Funny,’ Yuan Gun Gun said carelessly.</p><br/><p>Hao Yan Che kneaded Yuan Gun Gun’s breasts. He watched her face turn pink and listened to her soft moan.</p><br/><p>‘I hope you’ll get the last laugh,’ Hao Yan Che teased.</p><br/><p>Yuan Gun Gun realised her mistake too late.</p><br/><p>Later in the master bedroom, Yuan Gun Gun’s cries were heard instead of her laughter.</p><br/><p>The following day, Hao Yan Che escorted Yuan Gun Gun to the Long Mansion.</p><br/><p>‘Gun Gun, I really missed you,’ Long Liu Bao said. She hugged Yuan Gun Gun. ‘You finally succeeded.’</p><br/><p>Long Liu Bao knew the monster Hao couldn’t resist his loveable little rice ball’s seduction.</p><br/><p>The Long brothers were suspicious why Hao Yan Che would release his little rice ball. They expected Hao Yan Che would at least lock his little rice ball in the bedroom for half a year.</p><br/><p>***</p><br/><p>End of Chapter 155</p><br/>\n</div>"}