{"title": "Chapter 178", "id": 178, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-178", "volume_title": "Volume 2", "body": "<h1>Chapter 178</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Na Liu Ting Du walked to the bed, and held Yuan Gun Gun’s arm.</p><br/><p>‘Mr Hao, let go of my wife’s hand,’ Na Liu Ting Du said. ‘You’re scaring her.’</p><br/><p>‘Your wife?’ Hao Yan Che asked. ‘Mr Na, don’t you feel guilty calling another man’s wife, your wife?’</p><br/><p>‘Why should I feel guilty?’ Na Liu Ting Du asked. ‘I live with my wife, sleep with my wife and have a son with my wife. When you didn’t want her anymore, I protected and loved her. You’re the one who abandoned her. Now you want her back, how shameless can you be?’</p><br/><p>Hao Yan Che looked resentfully at Na Liu Ting Du for lying to Yuan Gun Gun and stealing Yuan Gun Gun and their son from him.</p><br/><p>‘Mr Hao, let go of my wife’s hand,’ Na Liu Ting Du said. ‘Our son is waiting for his mum at home.’</p><br/><p>‘Your son?’ Hao Yan Che asked. ‘He’s my son. He has my violet eyes and white hair. He also has my powers. Did my son with my wife inherit his genes from you or my wife?’</p><br/><p>Na Liu Ting Du knew it was over, Hao Yan Che knew the truth.</p><br/><p>‘Mr Na, do you not feel guilty deceiving a woman who lost her memory?’ Hao Yan Che asked. ‘A woman who is another man’s wife? Now you’re standing in front of her husband and still denying the truth, how shameless can you be?’</p><br/><p>‘I protected and loved my wife and son who you didn’t want,’ Na Liu Ting Du said. ‘It was you who let her go. Where were you these two years? You didn’t care about her. You didn’t look for her. Where were you while she lost her memory? I was with her when she lost her memory, and I held her hand when she had a difficult labour. I was the first dad our son saw, and the man who our son calls dad. What right do you have to ask me if I feel guilty?’</p><br/><p>‘You…’ Hao Yan Che said.</p><br/><p>‘Stop!’ Yuan Gun Gun said. ‘You’re all liars!’</p><br/><p>Yuan Gun Gun pulled her arm out of Na Liu Ting Du’s hold, and she pushed Hao Yan Che away from her.</p><br/><p>Yuan Gun Gun ran to the bathroom. She locked the door, and cried in the bathroom. Na Liu Ting Du lied to her. She wasn’t his wife, and Na Liu Hao wasn’t his son. If everything was a lie then who was she? She couldn’t remember anything. How could she believe all the lies? Everyone lied to her.</p><br/><p>Na Liu Ting Du and Hao Yan Che glared at each other, and they knocked on the bathroom door.</p><br/><p>‘Ling Ling, come out and I’ll explain everything,’ Na Liu Ting Du said.</p><br/><p>‘Yuan Gun Gun, come out and I’ll tell you the truth,’ Hao Yan Che said.</p><br/><p>‘You’re all liars!’ Yuan Gun Gun said. ‘Stay away from me!’</p><br/><p>‘Ling Ling,’ Na Liu Ting Du called.</p><br/><p>‘Gun Gun,’ Hao Yan Che called.</p><br/><p>‘I only want my parents,’ Yuan Gun Gun said. ‘Stay away from me!’</p><br/><p>Yuan Gun Gun hit her head against the door. Lies! Why couldn’t she remember her past?</p><br/><p>‘I’ll call dad and mum to come here right now,’ Na Liu Ting Du pleaded. ‘Don’t hurt yourself.’</p><div></div><br/><p>Yuan Gun Gun’s wrenching cry answered Na Liu Ting Du’s plea.</p><br/><p>Hao Yan Che was scared Yuan Gun Gun would do something crazy if she didn’t open the door.</p><br/><p>Twenty minutes later, Yuan Ting Liu arrived at Hao Yan Che’s office. Yuan Ting Liu was displeased to see his son and son-in-law.</p><br/><p>‘Where is Gun Gun?’ Yuan Ting Liu asked.</p><br/><p>A year ago, Na Liu Ting Du brought Yuan Gun Gun to the Yuan Mansion. Yuan Ting Liu wanted to kill Na Liu Ting Du for not telling him about Yuan Gun Gun’s lost memory, and about his grandson. If Na Liu Ting Du wasn’t his son, he would have killed him for deceiving Yuan Gun Gun and deceiving him.</p><br/><p>Yuan Ting Liu knew Na Liu Ting Du loved Yuan Gun Gun, but he didn’t approve of Na Liu Ting Du’s deceit. It hurt him to see his daughter anxious, and scared of him and Feng Du Du. He missed his daughter. The situation escalated, he didn’t want his daughter to live a lie.</p><br/><p>‘Dad, did you know long ago that Gun Gun lost her memory and gave birth to my son?’ Hao Yan Che asked.</p><br/><p>‘Yes,’ Yuan Ting Liu said.</p><br/><p>Yuan Ting Liu’s priority was Yuan Gun Gun. He would explain everything to Hao Yan Che later.</p><br/><p>‘Dad, why didn’t you tell me?’ Hao Yan Che asked. ‘Gun Gun is my wife. I’m the father of her son.’</p><br/><p>‘You’re wrong,’ Yuan Ting Liu said. ‘Two years ago you said to me you want to return my daughter. In other words, you and my daughter are strangers.’</p><br/><p>Hao Yan Che’s father-in-law’s words stung.</p><br/><p>‘Dad, Gun Gun locked herself in the bathroom,’ Na Liu Ting Du said. ‘Dad, convince Gun Gun to come home with me. Hao Hao is waiting at home for her.’</p><br/><p>‘Bring Hao Hao to the Yuan Mansion,’ Yuan Ting Liu said. ‘Starting from today, Gun Gun and Hao Hao will live at the Yuan Mansion.’</p><br/><p>‘Dad…’ Na Liu Ting Du said.</p><br/><p>‘Ting Du, do you remember what you did two years ago?’ Yuan Ting Liu asked. ‘I called you, and you didn’t tell me Gun Gun lost her memory. You fed lies to Gun Gun while she lost her memory. One year ago, you brought Gun Gun back to me. I didn’t curse you because I knew you loved Gun Gun. But it doesn’t mean I approve of your deceit, and it doesn’t mean I forgive you. Ting Du, do you understand?’</p><br/><p>Na Liu Ting Du understood he disappointed Yuan Ting Liu.</p><br/><p>‘Both of you have hurt Gun Gun,’ Yuan Ting Liu said. ‘I know both of you love Gun Gun. But I’m using my status as Gun Gun’s father to ask both of you not pressure Gun Gun. Give her space to calm down. Give her space to decide who she wants to be with. I’ll support her decision. If she decides she doesn’t want to be with any of you then both of you need to respect her decision. Mr Hao, let me take my daughter home.’</p><br/><p>***</p><br/><p>End of Chapter 178</p><br/>\n</div>"}