{"title": "Chapter 177", "id": 177, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-177", "volume_title": "Volume 2", "body": "<h1>Chapter 177</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Long Liu Bao worried about Yuan Gun Gun on the way home.</p><br/><p>‘What if Hao Yan Che kills Gun Gun?’ Long Liu Bao asked.</p><br/><p>‘Isn’t it too late to feel guilty now?’ Long Liu Bo asked.</p><br/><p>‘What guilt?’ Long Liu Bao asked. ‘Hao Yan Che needs to suffer so he doesn’t take Gun Gun’s love for granted.’</p><br/><p>‘Bao Bao, call Na Liu Ting Du,’ Long Liu Lang said. ‘After today, we can’t interfere in their business anymore.’</p><br/><p>Long Liu Bao called Na Liu Ting Du.</p><br/><p>‘Hello,’ Na Liu Ting Du greeted.</p><br/><p>‘Big brother Du, you need to go to Hao Yan’s company,’ Long Liu Lang said. ‘Hao Yan Che kidnapped Ling Ling.’</p><br/><p>Na Liu Ting Du immediately hung up. Long Liu Bao didn’t doubt he rushed to Hao Yan’S company to save Yuan Gun Gun.</p><br/><p>Long Liu Bao pitied Na Liu Ting Du. Na Liu Ting Du loved Yuan Gun Gun who didn’t love him. Long Liu Bao thought there was nothing wrong with Yuan Gun Gun living with Na Liu Ting Du except she knew Yuan Gun Gun’s heart was always with Hao Yan Che even if Yuan Gun Gun forgot everyone.</p><br/><p>At Hao Yan’s company, Hao Yan Che carried Yuan Gun Gun to the bedroom and dropped her on the bed.</p><br/><p>‘Tell me, did you run away to be with Na Liu Ting Du?’ Hao Yan Che asked.</p><br/><p>Hao Yan Che sat on the bed and held Yuan Gun Gun’s shoulders.</p><br/><p>‘You dare take my son away to live with him?’ Hao Yan Che asked. ‘You dare leave me when you were pregnant with my son? Tell me, what were you thinking?’</p><br/><p>‘Don’t,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che wanted to calm himself down. But Yuan Gun Gun looking at him like they were strangers made it hard for him to calm down.</p><br/><p>‘Yuan Gun Gun, tell me you’re lying,’ Hao Yan Che said. ‘Tell me that you remember me, and remember us.’</p><br/><p>Yuan Gun Gun shook her head. She couldn’t stop crying.</p><br/><p>‘How can you forget me?’ Hao Yan Che asked. ‘You’re not allowed to forget me!’</p><br/><p>‘Big brother Du…’ Yuan Gun Gun called.</p><br/><p>‘You’re not allowed to call him!’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun covered her ears, and avoided looking at Hao Yan Che’s eyes.</p><div></div><br/><p>Hao Yan Che felt Yuan Gun Gun shaking. He hugged her and stroked her back.</p><br/><p>‘Little rice ball, I’m sorry,’ Hao Yan Che said. ‘It’s all my fault.’</p><br/><p>Yuan Gun Gun sniffed Hao Yan Che’s body. She pressed her body closer to him. Why did his body smell so familiar?</p><br/><p>Hao Yan Che thought it was too long since the last time he hugged Yuan Gun Gun, and smell her body scent. In his dreams, if he held her hand, she would disappear. It was painful to wake up, and spend every second and minute of the day without her. His heart and soul left him the day she left him. Why did he do something foolish like letting her go? He should have patiently waited for her to love him. Why did he waste two years? It was one sad joke on him. She came back to him, but she forgot him.</p><br/><p>Yuan Gun Gun closed her eyes. She listened to Hao Yan Che’s heartbeats, felt relaxed like she was sleeping and forgot that he raised his voice at her.</p><br/><p>Na Liu Ting Du slammed the door opened. He caught Hao Yan Che in bed with Yuan Gun Gun. They were holding onto each other tightly, and looked like a beautiful painting of a pair of lovers’ reunion.</p><br/><p>‘Ling Ling,’ Na Liu Ting Du called.</p><br/><p>Yuan Gun Gun heard Na Liu Ting Du’s voice, and she realised she was hugging Hao Yan Che. She pushed Hao Yan Che away from her, and looked at No Liu Ting Du.</p><br/><p>‘Big brother Du,’ Yuan Gun Gun said.</p><br/><p>Na Liu Ting Du felt like he lost Yuan Gun Gun again.</p><br/><p>Hao Yan Che’s calmness disappeared after Yuan Gun Gun pushed him away because of Na Liu Ting Du.</p><br/><p>‘Big brother Du, I…’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun didn’t know what to say. She willingly hugged Hao Yan Che.</p><br/><p>‘Come here,’ Na Liu Ting Du said. ‘Let’s go home.’</p><br/><p>Yuan Gun Gun didn’t know why she wanted to hug someone like Hao Yan Che who suddenly looked coldly at her again. She wanted to go home.</p><br/><p>Hao Yan Che hugged Yuan Gun Gun tightly again.</p><br/><p>‘Your home is here,’ Hao Yan Che said.</p><br/><p>***</p><br/><p>End of Chapter 177</p><br/>\n</div>"}