{"title": "Chapter 180", "id": 180, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-180", "volume_title": "Volume 2", "body": "<h1>Chapter 180</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>At night, Na Liu Ting Du brought Na Liu Hao to the Yuan Mansion.</p><br/><p>Na Liu Ting Du held Na Liu Hao in his arms, and knocked on Yuan Gun Gun’s bedroom door.</p><br/><p>‘Ling Ling, it’s me,’ Na Liu Ting Du said. ‘Open the door.’</p><br/><p>Yuan Gun Gun didn’t want to open the door. She didn’t want to see Na Liu Ting Du.</p><br/><p>‘Ling Ling, even if you don’t want to see me, don’t you want to see Hao Hao?’ Na Liu Ting Du asked.</p><br/><p>Na Liu Ting Du didn’t care Na Liu Hao had violet eyes and white hair. He loved Na Liu Hao like his son, because half of Na Liu Hao was a part of Yuan Gun Gun.</p><br/><p>Yuan Gun Gun opened the door, and she looked at Na Liu Ting Du like he was a stranger.</p><br/><p>Na Liu Ting Du’s heart hurt to see Yuan Gun Gun’s indifference toward him. He put Na Liu Hao on the pink bed.</p><br/><p>‘Ling Ling, can’t you forgive me?’ Na Liu Ting Du asked.</p><br/><p>‘I’m not Ling Ling,’ Yuan Gun Gun said. ‘I’m Yuan Gun Gun.’</p><br/><p>‘If Gun Gun loved me, I wouldn’t have lied to you that you’re Na Liu Ling Yan,’ Na Liu Ting Du said.</p><br/><p>Yuan Gun Gun’s heart received another punch by Na Liu Ting Du.</p><br/><p>‘Even if I lied that you’re Na Liu Ling Yan, you still didn’t love me,’ Na Liu Ting Du said. ‘Whether you’re Yuan Gun Gun or Na Liu Ling Yan, in the last two years I couldn’t live in your heart. Even if you were separated from Hao Yan Che, and you couldn’t remember Hao Yan Che, your heart didn’t allow room for me. You’ll always see as your big brother, someone you turn to if you’re hurting. But you gave your body and soul to Hao Yan Che. Gun Gun, if you love me a bit of how much you love Hao Yan Che, I wouldn’t have lied to you. I wouldn’t worry every day that you’ll remember. I lied to myself every day that one day you’ll love me. I couldn’t escape how much I love you. Gun Gun, can you forgive me?’</p><br/><p>Yuan Gun Gun couldn’t remember the past. But looking at Na Liu Ting Du suffering made her think she had seen him suffer in the past. She cried because he was hurting too.</p><br/><p>Na Liu Ting Du hugged Yuan Gun Gun.</p><br/><p>‘Why can’t you live without Hao Yan Che?’ Na Liu Ting Du asked. ‘I met you first. I protected and lived with you from when you were five to eighteen. Why didn’t you choose me?’</p><div></div><br/><p>Na Liu Hao elevated the objects in the room. He was unhappy Na Liu Ting Du and Yuan Gun Gun neglected him.</p><br/><p>Na Liu Ting Du let go of Yuan Gun Gun. He walked to the bed, and coaxed Na Liu Hao.</p><br/><p>Yuan Gun Gun walked the bed, and held Na Liu Hao in her arms.</p><br/><p>Na Liu Hao’s small hands wiped the tears off Yuan Gun Gun’s face.</p><br/><p>‘Ugly mummy,’ Na Liu Hao said.</p><br/><p>Yuan Gun Gun sniffed her nose, and she kissed Na Liu Hao’s chubby cheek.</p><br/><p>‘It’s late,’ Na Liu Tin Du said. ‘You and Hao Hao should sleep.’</p><br/><p>‘Big brother Du, what about you?’ Yuan Gun Gun asked.</p><br/><p>‘I’ll sleep in the guest room,’ Na Liu Ting Du said.</p><br/><p>Na Liu Ting Du turned around and walked slowly to the door.</p><br/><p>‘Big brother Du, I don’t blame you,’ Yuan Gun Gun said.</p><br/><p>Na Liu Ting Du turned around and looked at the mother and son.</p><br/><p>‘Thank you,’ Na Ling Ting Du said.</p><br/><p>‘Daddy, kiss,’ Na Liu Hao said.</p><br/><p>Na Ling Ting Du felt a knife stabbed his heart. He walked to Na Liu Hao and kissed Na Liu Hao’s cheek.</p><br/><p>‘Goodnight Hao Hao,’ Na Ling Ting Du said. ‘Hao Hao needs to listen to mummy.’</p><br/><p>‘Goodnight,’ Na Liu Hao said.</p><br/><p>Na Liu Hao let the flying objects fall onto the ground. He was happy Na Liu Ting Du and Yuan Gun Gun said goodnight to him.</p><br/><p>Na Liu Ting Du rubbed Na Liu Hao’s cheeks. He turned around and walked outside.</p><br/><p>Yuan Gun Gun considered continuing to live with Na Liu Ting Du because he loved her and Na Liu Hao. Since she couldn’t remember the past, perhaps she could start a new life with Na Liu Ting Du and Na Liu Hao. But she remembered Hao Yan Che’s violet eyes looked at her like she betrayed him, and made her heart break.</p><br/><p>At the Hao Mansion at midnight, Hao Yan Che held Yuan Gun Gun’s nightshirt. He looked at the DOVE she wrote on her nightshirt collar. He wanted to take Yuan Gun Gun home, and ask her if she remembered what DOVE meant.</p><br/><p>Mrs Chen knocked on the door.</p><br/><p>‘Young master, Na Liu Ting Du is here to see you,’ Mrs Chen said.</p><br/><p>‘Let him in,’ Hao Yan Che said.</p><br/><p>‘Yes young master,’ Mrs Chen said.</p><br/><p>***</p><br/><p>End of Chapter 180</p><br/>\n</div>"}