{"title": "Chapter 187", "id": 187, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-187", "volume_title": "Volume 2", "body": "<h1>Chapter 187</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Yuan Gun Gun looked at Hao Yan Che’s beautiful face. She didn’t register she was lying underneath him.</p><br/><p>‘Little Chub,’ Hao Yan Che called.</p><br/><p>Hao Yan Che’s finger brushed Yuan Gun Gun’s lips. His lips slowly moved toward her lips. She closed her eyes, and felt like the beautiful face in front of her would disappear if their lips touch.</p><br/><p>Hao Yan Che gently kissed Yuan Gun Gun’s lips. She opened her eyes, and pushed his shoulders.</p><br/><p>‘Just one kiss,’ Hao Yan Che pleaded. ‘One kiss is enough.’</p><br/><p>Yuan Gun Gun didn’t know why her heart hurt hearing Hao Yan Che’s desperate plea. It was like he waited forever to kiss her lips.</p><br/><p>Hao Yan Che’s gentle kiss became rougher. His tongue wouldn’t let Yuan Gun Gun’s tongue rest. She liked him kissing her unlike when Na Liu Ting Du kissed her.</p><br/><p>A long time later, Yuan Gun Gun’s head spun and Hao Yan Che let go of her lips.</p><br/><p>‘Your kissing skills are still poor,’ Hao Yan Che said. ‘You need more practice.’</p><br/><p>Yuan Gun Gun was too lost in Hao Yan Che’s kiss to register his words.</p><br/><p>Hao Yan Che caressed Yuan Gun Gun’s face. When did he fall in love with her? Was it when she held a plunger in front of his bed? Or when she fell onto him and touched his chest? Perhaps it was when she risked her life to stop him from taking painkillers. Could it be when she sweetly bickered with him? Maybe it was when she cried and asked him why he must bully her. He didn’t know when he fell in love with her. He only knew the moment he realised he loved her, it was too late to late to escape.</p><br/><p>‘It’s late,’ Yuan Gun Gun said. ‘You should go to a different room and sleep.’</p><br/><p>‘Where do you want me to sleep?’ Hao Yan Che asked. ‘This is my room.’</p><br/><p>‘Alright,’ Yuan Gun Gun said. ‘I’ll go sleep in Hao Hao’s bedroom. Tomorrow you can choose another room for me.’</p><div></div><br/><p>‘Remember this is our room,’ Hao Yan Che said.</p><br/><p>Hao Yan Che didn’t let Yuan Gun Gun leave the bed.</p><br/><p>‘That was in the past,’ Yuan Gun Gun said. ‘Get off me.’</p><br/><p>‘Do you want to see what happens if you move again?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun laid frozen underneath Hao Yan Che.</p><br/><p>‘You can’t remember what we did together on this bed,’ Hao Yan Che whispered in Yuan Gun Gun’s ear. ‘But I remember everything. If you don’t want me to help you remember right now then listen to me.’</p><br/><p>Yuan Gun Gun didn’t understand why Hao Yan Che was gentle one moment, and turned into someone unreasonable the next moment.</p><br/><p>Hao Yan Che caressed Yuan Gun Gun’s neck.</p><br/><p>‘Do you want me to help you remember right now?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun cried and made Hao Yan Che want to tease her.</p><br/><p>‘On this bed we loved each other,’ Hao Yan Che whispered in Yuan Gun Gun’s ear. ‘There wasn’t a part of our bodies that didn’t touch. Our rotten little demon son is proof of our love.’</p><br/><p>Hao Yan Che wiped Yuan Gun Gun’s tears.</p><br/><p>‘Yuan Gun Gun, even if you lost your memory, you can’t deny the truth,’ Hao Yan Che said. ‘You’ll always be my wife.’</p><br/><p>Yuan Gun Gun covered her face and cried. Hao Yan Che pulled her hands away from her face.</p><br/><p>‘I love seeing you cry,’ Hao Yan Che said. ‘If you keep crying, I’ll show you how we conceived our rotten little demon son.’</p><br/><p>‘You’re a perverted monster,’ Yuan Gun Gun said.</p><br/><p>‘It’s good you know the truth,’ Hao Yan Che said. ‘Don’t provoke a monster like me, because I won’t show you mercy.’</p><br/><p>***</p><br/><p>End of Chapter 187</p><br/>\n</div>"}