{"title": "Chapter 195", "id": 195, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-195", "volume_title": "Volume 2", "body": "<h1>Chapter 195</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>‘Yi Tu, is your nose broken?’ Hao Yan Che asked sarcastically.</p><br/><p>Yi Tu looked confusedly at Jia Tu.</p><br/><p>‘Gun Gun lost her memory,’ Hao Yan Che said. ‘Don’t scare her when you see her.’</p><br/><p>Hao Yan Che stood, he walked to the pig fridge, grabbed fresh milk and puddings and walked to the bedroom.</p><br/><p>Yi Tu and Jia Tu were both speechless.</p><br/><p>Hao Yan Che walked into the bedroom. His wife was holding their son on the bed and watching TV. It made him jealous of their son.</p><br/><p>Yuan Gun Gun saw Hao Yan Che, and she immediately looked away.</p><br/><p>Hao Yan Che put the fresh milk and puddings on the table. He poured a glass of milk, and gave it to his son. His son gulped down the glass of milk.</p><br/><p>‘Don’t fight with me,’ Hao Yan Che said and gave Yuan Gun Gun a pudding.</p><br/><p>Yuan Gun Gun accepted the pudding.</p><br/><p>‘Why do I need to fight with you?’ Yuan Gun Gun asked. ‘I’m no one to you.’</p><br/><p>‘Do you need me to remind you that you’re my son’s mother?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun didn’t dare continue to fight with Hao Yan Che, and she began eating the pudding.</p><br/><p>‘Do you want to go anywhere?’ Hao Yan Che asked. ‘I’ll take you there.’</p><br/><p>‘Anywhere,’ Yuan Gun Gun said. ‘Besides, my opinion doesn’t matter since CEO Hao makes all my decisions for me.’</p><br/><p>‘Then we’ll go home,’ Hao Yan Che said.</p><br/><p>Hao Yan Che kicked the door open.</p><br/><p>Na Liu Hao ignored his dummy mummy, and silently drank another glass of milk.</p><br/><p>Yi Tu knocked on the door, and stood like a dummy.</p><br/><p>‘Did something happened?’ Yuan Gun Gun asked.</p><br/><p>‘Gun Gun, it’s been a long time since we saw each other,’ Yi Tu said.</p><br/><p>Yuan Gun Gun didn’t recognise Yi Tu.</p><br/><p>‘I’m Yi Tu,’ Yi Tu said. ‘In the past you used to call me big brother Yi Tu. Come with me, and I’ll take you home.’</p><br/><p>‘Big brother… Yi Tu?’ Yuan Gun Gun asked.</p><div></div><br/><p>Yuan Gun Gun felt like she knew Yi Tu.</p><br/><p>‘Yes,’ Yi Tu said. ‘Do you remember?’</p><br/><p>‘I’m sorry,’ Yuan Gun Gun said. ‘I don’t remember.’</p><br/><p>‘It’s OK,’ Yi Tu said. ‘One day you’ll remember. Let’s go.’</p><br/><p>‘Yes,’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun carried Na Liu Hao, and Yi Tu finally notice Na Liu Hao.</p><br/><p>‘Who is this?’ Yi Tu asked.</p><br/><p>‘This is my son Na Liu Hao,’ Yuan Gun Gun said.</p><br/><p>‘He’s a handsome boy,’ Yi Tu said.</p><br/><p>Yi Tu wanted to ask the heavens what happened in the last two years. Why did Yuan Gun Gun lose her memory and suddenly popped out Hao Yan Che’s son?</p><br/><p>At the Hao Mansion at night, Hao Yan Che returned to the master bedroom after exercising. His anger reappeared after he couldn’t see his wife on their bed.</p><br/><p>Hao Yan Che went to the study room to look for Yi Tu and Jia Tu.</p><br/><p>‘Where’s Gun Gun?’ Hao Yan Che asked.</p><br/><p>Yi Tu thought it was unfair innocent bystanders were caught in the crossfire every time Hao Yan Che’s wife went missing.</p><br/><p>‘Gun Gun is staying in a guest room,’ Yi Tu said.</p><br/><p>‘What room?’ Hao Yan Che asked.</p><br/><p>‘Room seventy-four,’ Yi Tu said.</p><br/><p>If Yuan Gun Gun wanted to rebel then Hao Yan Che was going to make the next move.</p><br/><p>‘Young master, wait,’ Yi Tu said.</p><br/><p>‘What is it?’ Hao Yan Che asked.</p><br/><p>‘Young master, Jia Tu and I agreed that young master should let Gun Gun take the initiative to come to young master,’ Yi Tu said. ‘It’s better than young master going to see Gun Gun now and fight with her.’</p><br/><p>‘What’s your plan?’ Hao Yan Che asked.</p><br/><p>Yi Tu explained his plan to Hao Yan Che and Jia Tu. They looked at Yi Tu like his plan would fail.</p><br/><p>‘Isn’t my plan a good plan?’ Yi Tu asked.</p><br/><p>Hao Yan Che and Jia Tu got goose bumps.</p><br/><p>***</p><br/><p>End of Chapter 195</p><br/>\n</div>"}