{"title": "Chapter 193", "id": 193, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-193", "volume_title": "Volume 2", "body": "<h1>Chapter 193</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>The employees shook their head. They didn’t want to offend CEO Hao, and they also didn’t see Yuan Gun Gun injure Yang Wen. But they witnessed flying objects hitting Yang Wen.</p><br/><p>‘They’re all lying!’ Yang Wen said. ‘Yuan Gun Gun injured me!’</p><br/><p>‘I saw what happened,’ an employee said. ‘Miss Yang wanted to push Yuan Gun Gun. But the files on the desks fell onto Miss Yang’s feet, and Miss Yang fell onto the floor. Miss Yang picked up a glass vase and threw it at Yuan Gun Gun. Then I don’t know how the glass vase flew backward and hit Miss Yang’s forehead. Yuan Gun Gun wanted to help Miss Yang stand up, but Miss Yang hit Yuan Gun Gun.’</p><br/><p>‘Gun Gun, did she hit you?’ Hao Yan Che asked. ‘Where did she hit you?’</p><br/><p>‘It doesn’t hurt anymore,’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun thought Hao Yan Che looked like he wanted to kill someone.</p><br/><p>Hao Yan Che smiled coldly at Yang Wen.</p><br/><p>‘You dare hit my wife?’ Hao Yan Che asked.</p><br/><p>‘No,’ Yang Wen said. ‘CEO Hao, I…’</p><br/><p>‘Throw her outside,’ Hao Yan Che ordered. ‘Make a public announcement that anyone who hires her is my enemy.’</p><br/><p>Yang Wen crawled to Hao Yan Che.</p><br/><p>‘CEO Hao, I’m begging you not fire me,’ Yang Wen said.</p><br/><p>The only woman in the world Hao Yan Che cared about was Yuan Gun Gun.</p><br/><p>Yang Wen grabbed onto Hao Yan Che’s pants. He kicked her into the air, and she fell onto the floor.</p><br/><p>‘Don’t touch me,’ Hao Yan Che said.</p><br/><p>‘Don’t hurt her,’ Yuan Gun Gun said.</p><br/><p>‘You’re not allowed to help her,’ Hao Yan Che said. He held Yuan Gun Gun’s hand, and carried their son in his other arm. ‘Come with me.’</p><br/><p>Hao Yan Che took his wife and son to the elevators.</p><br/><p>The security guards dragged Yang Wen outside like she was a rubbish bag.</p><br/><p>The employees saw the trail of blood on the floor and winced.</p><br/><p>‘What is everyone standing idle for?’ Feng Ting asked coldly. ‘Get back to work.’</p><br/><p>The employees wisely returned to their desks, and acted like nothing happened.</p><br/><p>Feng Ting walked to her office, and thought about what delicious food to buy to entice her dummy friend to come see her so they could catch up on old times.</p><div></div><br/><p>In Hao Yan Che’s office, Yuan Gun Gun stood in front of Na Liu Hao.</p><br/><p>‘I’m sorry,’ Yuan Gun Gun said. ‘Hao Hao didn’t mean to harm anyone.’</p><br/><p>‘Move away,’ Hao Yan Che said.</p><br/><p>Hao Yan Che couldn’t believe Yuan Gun Gun was scared of him that much.</p><br/><p>Yuan Gun Gun refused to move away from Na Liu Hao.</p><br/><p>Hao Yan Che easily picked up his son.</p><br/><p>‘Wait,’ Yuan Gun Gun said. ‘We can slowly talk about this.’</p><br/><p>‘Son, you did a good job,’ Hao Yan Che praised. ‘Next time if anyone bullies your mummy, you have daddy’s permission to kill them.’</p><br/><p>Na Liu Hao was surprised by the old man’s words.</p><br/><p>Yuan Gun Gun’s mouth opened wide. She couldn’t believe Hao Yan Che would teach their son to kill people.</p><br/><p>Hao Yan Che gently poked Yuan Gun Gun’s forehead.</p><br/><p>‘Why aren’t you as smart as our son?’ Hao Yan Che asked.</p><br/><p>‘How can you say this?’ Yuan Gun Gun asked and rubbed her forehead.</p><br/><p>‘What do you want me to say?’ Hao Yan Che asked. ‘How can you be a dummy, and let anyone bully you? Yuan Gun Gun when will you understand how important your status is? You can bully other people, but other people are not allowed to bully you.’</p><br/><p>Hao Yan Che put his son down on the floor, and continued to poke his wife’s forehead.</p><br/><p>‘Aren’t you bullying me right now?’ Yuan Gun Gun asked.</p><br/><p>‘Apart from me,’ Hao Yan Che said and pinched Yuan Gun Gun’s ear.</p><br/><p>Na Liu Hao let the old man pinch his mummy’s ear.</p><br/><p>‘Ow… it hurts,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che let go of Yuan Gun Gun’s ear, and he rubbed her ear.</p><br/><p>‘I’m not injured,’ Yuan Gun Gun said. ‘Spare Yang Wen. If you fire her, no other company will dare hire her. If she doesn’t have a job, how is she going to make a living to support herself?’</p><br/><p>‘If you know what’s good for you, don’t ask me to spare her,’ Hao Yan Che said. ‘Do you think she would be grateful toward you?’</p><br/><p>‘I…’ Yuan Gun Gun said.</p><br/><p>‘Stop,’ Hao Yan Che said. ‘I don’t want to fight with you over someone insignificant.’</p><br/><p>***</p><br/><p>End of Chapter 193</p><br/>\n</div>"}