{"title": "Chapter 199", "id": 199, "volume": 2, "url": "http://boxnovel.org/beloved-little-treasure-chapter-199", "volume_title": "Volume 2", "body": "<h1>Chapter 199</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Hao Yan Che opened the wedding invitation. He smiled and ate breakfast.</p><br/><p>‘Young master, Gun Gun is back with your son,’ Mrs Chen said. ‘Shouldn’t you look for master and mistress? Perhaps master can give Gun Gun her memory back.’</p><br/><p>‘If my dad doesn’t want to be found, who can find him?’ Hao Yan Che asked.</p><br/><p>Mrs Chen didn’t answer.</p><br/><p>‘Aunty Chen, let nature takes its course,’ Hao Yan Che said.</p><br/><p>Hao Yan Che stood, and walked to the master bedroom. He was happy as long Yuan Gun Gun was by his side. They had forever together for her to slowly remember their past.</p><br/><p>At ten at night, Yuan Gun Gun opened her eyes and stretched her body on the bed.</p><br/><p>‘You’re awake,’ Hao Yan Che said. ‘You must have slept well.’</p><br/><p>Hao Yan Che put his work papers on a table, and walked to the bed.</p><br/><p>‘Go wash up and eat a meal,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun crawled under the bedsheet, and wished she was invisible.</p><br/><p>Hao Yan Che sat on the bed. Yuan Gun Gun refused to come out from under the bedsheet.</p><br/><p>‘Are you still upset with me?’ Hao Yan Che asked.</p><br/><p>Hao Yan Che ran out of patience, and ripped the bedsheet in half.</p><br/><p>Yuan Gun Gun coughed out feathers from the ripped bedsheet, and Hao Yan Che brushed feathers off her face.</p><br/><p>‘Wake up and eat a meal,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun remembered last night, she covered her face and Hao Yan Che pulled her hands away from her face.</p><br/><p>‘Tell me what’s wrong,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun couldn’t hide her blushing face.</p><br/><p>‘Are you embarrassed?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun’s face turned a brighter red.</p><br/><p>Hao Yan Che poked Yuan Gun Gun’s red cheeks and laughed.</p><br/><p>‘Gun Gun, there is nothing for you to be embarrassed about,’ Hao Yan Che said. ‘It’s normal for a husband and wife to sleep together.’</p><div></div><br/><p>Yuan Gun Gun covered Hao Yan Che’s mouth.</p><br/><p>‘You’re not allowed to say it,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che pulled Yuan Gun Gun’s hand away from his mouth, and smiled.</p><br/><p>‘Why can’t I say it?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun wanted to bite Hao Yan Che’s smug face, and he wanted to kiss her face.</p><br/><p>‘Are you looking at me because you want to kiss me?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun pulled Hao Yan Che onto the bed, she laid on top of him and covered his mouth.</p><br/><p>‘You’re not allowed to say nonsense,’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che smiled at Yuan Gun Gun’s angry face, and he caressed her bottom.</p><br/><p>‘You…’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che rolled on top of Yuan Gun Gun.</p><br/><p>‘Why do you look like you want to cry?’ Hao Yan Che asked.</p><br/><p>Hao Yan Che gently kissed Yuan Gun Gun’s lips.</p><br/><p>‘Because you’re bullying me,’ Yuan Gun Gun said.</p><br/><p>Yuan Gun Gun covered her face, and cried softly.</p><br/><p>‘No crying,’ Hao Yan Che said.</p><br/><p>Hao Yan Che grabbed half the bedsheet, covered Yuan Gun Gun’s naked body and he hugged her.</p><br/><p>‘Little Chub, don’t cry,’ Hao Yan Che said.</p><br/><p>‘You’re the chub,’ Yuan Gun Gun said. ‘Your family is the chub family.’</p><br/><p>‘My family includes you,’ Hao Yan Che teased.</p><br/><p>Yuan Gun Gun ignored Hao Yan Che. He kissed her cheek.</p><br/><p>‘I want to tease you because I like you,’ Hao Yan Che said.</p><br/><p>‘You like me?’ Yuan Gun Gun asked.</p><br/><p>‘Yes,’ Hao Yan Che said.</p><br/><p>‘Really?’ Yuan Gun Gun asked.</p><br/><p>‘Yes,’ Hao Yan Che said.</p><br/><p>***</p><br/><p>End of Chapter 199</p><br/>\n</div>"}