{"title": "Chapter 204", "id": 204, "volume": 3, "url": "http://boxnovel.org/beloved-little-treasure-chapter-204", "volume_title": "Volume 3", "body": "<h1>Chapter 204</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Yuan Gun Gun pushed Hao Yan Che’s arms off her. Then she got out of bed and walked to the bathroom.</p><br/><p>Hao Yan Che felt Yuan Gun Gun leave the bed. He woke up and followed her to the bathroom.</p><br/><p>Yuan Gun Gun quickly brushed her teeth, and ignored Hao Yan Che brushing his teeth next to her. He knew she didn’t want to be in the same room as him.</p><br/><p>Hao Yan Che held Yuan Gun Gun’s elbow.</p><br/><p>‘Do you not want to see me this much?’ Hao Yan Che asked.</p><br/><p>Yuan Gun Gun looked at the ceiling like she couldn’t hear Hao Yan Che.</p><br/><p>‘About yesterday…’ Hao Yan Che said.</p><br/><p>‘It’s my mistake,’ Yuan Gun Gun said. ‘Hao Hao and I shouldn’t have come to your home. Right now I only want to take Hao Hao to my daddy’s home. Mr Hao, I know you’re the king of your world. But I’m only an ordinary woman. As an ordinary woman, I’m begging you to let go of me and Hao Hao.’</p><br/><p>Hao Yan Che wanted to say sorry to Yuan Gun Gun, but she threw water back at his face. In the last two years, she became more stubborn than him.</p><br/><p>‘What are you going to do if I don’t let you go?’ Hao Yan Che asked.</p><br/><p>‘You…’ Yuan Gun Gun said.</p><br/><p>‘Yuan Gun Gun, I’m not going to let you leave me again,’ Hao Yan Che said. ‘If you listen to me, I’ll let you see our son. If you keep opposing me then I can make you suffer.’</p><br/><p>Hao Yan Che put his and Yuan Gun Gun’s toothbrushes down. He held her chin and kissed her lips that she bit.</p><br/><p>Hao Yan Che’s rough kiss made Yuan Gun Gun’s heart hurt. He bit her lips hard, let go of her lips and he wiped blood off his lips.</p><br/><p>‘If you keep opposing me, you’ll only end up being injured,’ Hao Yan Che said.</p><br/><p>Hao Yan Che suppressed his desire to hug Yuan Gun Gun and comfort her. He turned around and left the bathroom.</p><div></div><br/><p>Yuan Gun Gun sat on the bathroom floor. She wiped blood and tears off her face. She realised Hao Yan Che was capable of being cruel or gentle on a whim. He knew how to make her live in hell. But why didn’t she hate him?</p><br/><p>Two days past, and the atmosphere inside the Hao Mansion was tensed like when Yuan Gun Gun was gone.</p><br/><p>In the study room Hao Yan Che knocked everything off the desk. He didn’t know who taught Yuan Gun Gun to be stubborn and unreasonable.</p><br/><p>‘Young master, if you want to reconcile with Gun Gun, I have a way,’ Yi Tu said.</p><br/><p>‘Who said I want to reconcile with her?’ Hao Yan Che asked.</p><br/><p>‘I mean Gun Gun wants to reconcile with young master,’ Yi Tu said. ‘She needs young master to give her a ladder to climb down.’</p><br/><p>‘What do you want to say?’ Hao Yan Che asked.</p><br/><p>‘Young master, why don’t you use Gun Gun’s fear of ghosts to your advantage again?’ Yi Tu asked.</p><br/><p>Hao Yan Che thought it was embarrassing for everyone to know he would resort to childish tactics to get Yuan Gun Gun to pay attention to him again.</p><br/><p>‘Go prepare everything,’ Hao Yan Che said.</p><br/><p>‘Yes young master,’ Yi Tu said.</p><br/><p>At night a full moon shone through the master bedroom window. Yuan Gun Gun thought she saw a reflection of a white dress on the TV screen. She told herself it was only the moon’s reflection.</p><br/><p>Hao Yan Che sat on a chair and pretended to read reports. He was unhappy Yuan Gun Gun didn’t jump into his arms. When did she become stronger? He missed the Yuan Gun Gun who used to rely on him.</p><br/><p>Yuan Gun Gun chanted to herself, it was the moon’s reflection and not the dead maid from room seventy-four.</p><br/><p>***</p><br/><p>End of Chapter 204</p><br/>\n</div>"}