{"title": "Chapter 202", "id": 202, "volume": 3, "url": "http://boxnovel.org/beloved-little-treasure-chapter-202", "volume_title": "Volume 3", "body": "<h1>Chapter 202</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p></p><div></div><br/><p>Na Liu Hao looked coldly at the old man.</p><br/><p>‘Old man, I don’t need you to lecture me,’ Na Liu Hao said.</p><br/><p>Yuan Gun Gun was shielding Na Liu Hao’s face so Hao Yan Che could only hit Na Liu Hao’s back.</p><br/><p>‘Hao Hao is still little,’ Yuan Gun Gun said. ‘How can you use force to hit your son?’</p><br/><p>‘Is he my son?’ Hao Yan Che asked. ‘If I remember correctly, a couple of minutes ago you and he called Na Liu Ting Du his daddy and called me his uncle.’</p><br/><p>‘You…’ Yuan Gun Gun said.</p><br/><p>‘Isn’t it true you miss his daddy?’ Hao Yan Che asked. ‘Who knows what you and his daddy did in bed together for two years?’</p><br/><p>‘You’re right,’ Yuan Gun Gun said. ‘I miss Hao Hao’s daddy. At least when Hao Hao and I lived with his daddy, his daddy didn’t do anything to hurt us. Hao Hao’s daddy is a gentle man unlike Mr Hao.’</p><br/><p>‘You’re right,’ Hao Yan Che said. ‘I’m not a gentle man like his daddy. You chose to crawl onto my bed. What does that make you?’</p><br/><p>Yuan Gun Gun didn’t expect Hao Yan Che’s words would cut her heart deeply.</p><br/><p>Na Liu Hao didn’t understand what the old man’s words meant, but he understood it made his mummy sad. He levitated a chair and aimed it at the old man’s head.</p><br/><p>Hao Yan Che waved a hand and the chair flung against a wall. Then he picked up his son from Yuan Gun Gun’s arms.</p><br/><p>‘You exist because of me and I can take away your life too,’ Hao Yan Che said.</p><br/><p>Hao Yan Che choked his son’s neck. But his son didn’t beg him to spare his life.</p><br/><p>‘Are you crazy?’ Yuan Gun Gun asked. ‘Let go of your son!’</p><br/><p>Hao Yan Che heard Yuan Gun Gun’s anxious voice, and he immediately let go of their son’s neck. He looked at their son gasping for air, and regretted using force on their son.</p><br/><p>Yuan Gun Gun held Na Liu Hao in her arms. She stroked his small face.</p><br/><p>‘Hao Hao, don’t be scared,’ Yuan Gun Gun said. ‘Mummy will take you back to grandpa Yuan’s home.’</p><br/><p>Hao Yan Che stood in front of Yuan Gun Gun, and she moved a few steps back.</p><br/><p>‘What do you want?’ Yuan Gun Gun asked.</p><br/><p>Hao Yan Che didn’t want Yuan Gun Gun to be scared of him and runaway.</p><br/><p>‘Where do you think you are?’ Hao Yan Che asked. ‘Do you think you can come here and leave anytime?’</p><div></div><br/><p>‘Mr Hao, where my son and I go is none of your business,’ Yuan Gun Gun said. ‘Didn’t you say you’re not my son’s father?’</p><br/><p>Yuan Gun Gun sounded calm, but her heart panicked. She hugged Na Liu Hao tightly.</p><br/><p>‘Good,’ Hao Yan Che said. ‘It looks like we understand each other.’</p><br/><p>‘I wish Hao Hao and I were still living in Paris and never met you,’ Yuan Gun Gun said.</p><br/><p>‘Say it again,’ Hao Yan Che said.</p><br/><p>‘I said…’ Yuan Gun Gun said.</p><br/><p>Hao Yan Che grabbed Na Liu Hao from Yuan Gun Gun’s arms again, and he pulled her dress collar.</p><br/><p>‘I wish I killed you the first time I met you six years ago,’ Hao Yan Che said.</p><br/><p>Yuan Gun Gun didn’t want to believe the cruel man in front of her was the same gentle man she lived with for weeks.</p><br/><p>‘Yuan Gun Gun, you should know what happens if you provoke me,’ Hao Yan Che said.</p><br/><p>Hao Yan Che raised his arm, Na Liu Hao closed his eyes and Yuan Gun Gun hit Hao Yan Che’s chest.</p><br/><p>‘What are you doing?’ Yuan Gun Gun asked.</p><br/><p>‘Yuan Gun Gun, starting today, you’ll never see Na Liu Ting Du and your son again,’ Hao Yan Che said.</p><br/><p>Hao Yan Che carried his son, held Yuan Gun Gun’s hand and took them outside the room.</p><br/><p>‘Young master,’ Yi Tu and Jia Tu called.</p><br/><p>Hao Yan Che pushed Yuan Gun Gun toward Yi Tu and Jia Tu like he was throwing away rubbish.</p><br/><p>‘Lock her up in the master bedroom,’ Hao Yan Che said. ‘No one is allowed to open the master bedroom without my permission.’</p><br/><p>Yuan Gun Gun fought to free her arms from Yi Tu and Jia Tu’s hold.</p><br/><p>‘Hao Yan Che, you have no right to treat me like this,’ Yuan Gun Gun said.</p><br/><p>‘You should know under my roof there is nothing I can’t do,’ Hao Yan Che said.</p><br/><p>Hao Yan Che carried his son away from Yuan Gun Gun. He wished he was capable of being drunk and forgetting about his son and Yuan Gun Gun’s existence. They couldn’t hurt him if they never existed.</p><br/><p>Jia Tu and Yi Tu didn’t know what happened. A moment ago, Hao Yan Che, Yuan Gun Gun and Na Liu Hao were a happy family together. Why did they suddenly turn their backs on each other?</p><br/><p>***</p><br/><p>End of Chapter 202</p><br/>\n</div>"}