{"title": "Chapter 19: Cruel Training", "id": 19, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-19-cruel-training", "volume_title": "Volume 1", "body": "<h1>Chapter 19: Cruel Training</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 19<u><strong>:</strong> </u>Cruel Training</u></strong></p><br/><p>In the morning, a pale mist had shrouded the surrounding summit and lingered for a very long time. A gentle wind blew by and suddenly a physical grunt could be heard.</p><br/><p>Behind the summit, in a hidden groove, both of Xiao Yan’s feet were inserted into the soil like tree stumps. His toes clung to the ground while he gnashed his teeth together and had cold sweat pour over his forehead. He only wore short pants and on his naked upper body were crisscrossed scars.</p><br/><p>Behind Xiao Yan was Yao Lao in spirit mode, cross-legged above a giant stone. His face was solemn as he gazed at Xiao Yan clenching his teeth to fight off the pain and then his palm softly swung upwards.</p><br/><p>Following Yao Lao’s palm, a red, materialized Dou Qi shot out from Yao Lao’s palm. Just like a whip, it harshly smashed against Xiao Yan’s shoulder, leaving behind a long bruise.</p><br/><p>As the corners of his mouth violently trembled, Xiao Yan inhaled cold air through the slivers between his teeth in response to the pain. Xiao Yan’s shoulder numbed and a wave of scorching pain made its way to his heart. Under the brutal pain, Xiao Yan felt his feet soften, and almost fell off balance…</p><br/><p>Under the violent pain, the original weak Dou Qi within Xiao Yan became more animated than before and quickly flowed through the Qi paths and pressure points on Xiao Yan’s shoulder. Strands of cool slowly seeped into into his bones and quietly strengthened in the progress.</p><br/><p>“Again!” When the pain on his shoulder gradually faded away, Xiao Yan young face was filled with persistence and stubborness and yelled while clenching his teeth.</p><br/><p>Looking at persevering Xiao Yan, a gratified smile appeared on Yao Lao’s withered face. Slightly nodded, a red materialized Dou Qi shot out from his palm again.</p><br/><p>“Bang, Bang, Bang…” Within the small forest, as strike after strike hit Xiao Yan, low grunts along with naked hits sounded…</p><br/><p>Every one of Yao Lao’s attacks were at the exact point of maximum endurance for Xiao Yan’s body. The attacks wouldn’t harm Xiao Yan seriously but still brought Xiao Yan the maximum pain possible.</p><br/><p>The pain from the Dou Qi lashes caused an unbearable pain, forcing Xiao Yan young face to contort in agony.</p><br/><p>On his body, with Yao Lao’s swings, more and more crisscrossed scars appeared…</p><br/><p>“Bang!” another materialized Dou Qi shot out and the wood stake like Xiao Yan finally reached his limit. With weakened legs, he fell down paralyzed.</p><br/><p>Fiercely gasped for air, Xiao Yan wiped away the cold sweat on his forehead and lifting his head up to make a rough smile, he asked: “Teacher, how was it?”</p><br/><p>“Not bad, you took eighty four Dou Qi lashes today. That’s a lot better than when you started out half a month ago and only able to take nine lashes…” Yao Lao had a smile on his face and nodded. A glint of surprise flirted across his eyes, in the past half-month, the tenacity that Xiao Yan displayed was far beyond what was originally expected. For example, today, Yao Lao had originally thought that seventy Dou Qi lashes was Xiao Yan’s limit but the later had persevered to eighty-four lashes. Yao Lao could not help but admire the spirit of Xiao Yan.</p><br/><p>After listening to Yao Lao words, Xiao Yan let out a deep breath and slumped on the ground. When he regained feeling, he slowly crawled back up and put back on the clothing he had taken off and placed on a nearby rock.</p><br/><p>When wearing the clothes, whenever the cool fabric touched against the bruises, Xiao Yan winced and gritted his teeth.</p><br/><p>The transparent Yao Lao turned into a ray of light and disappeared within the black ring. Before disappearing, he left behind a phrase that he had said countless times: “Quickly go back and submerge yourself within the Foundation Elixir to make sure that the congested blood doesn’t leave behind hidden wounds!”</p><br/><p>Nodding, Xiao Yan finished putting on his clothes and left the forest.</p><br/><p>….</p><br/><p>Once Xiao Yan finally made it back to his room while enduring the pain, he quickly took off his clothes once again and jumped into his wooden bowl of green liquid…</p><br/><p>TL: Bath Bowl – http://www.inspirationgreen.com/wooden-bathtub.html</p><br/><p>The ice cold green liquid alleviated the pains from the bruised skin and Xiao Yan slowly closed his eyes, enjoying the soothing liquid flow over his skin.</p><br/><p>After a while, Xiao Yan’s rushed breathing slowly calmed and even incorporated a couple of snores! After a painful beating, Xiao Yan couldn’t take the fatigue on both his body and mental state and fell asleep…</p><br/><p>While Xiao Yan was asleep, the green liquid rippled slightly and slivers of peaceful energy quietly slipped into Xiao Yan’s open pores. They washed away the lashes of congested blood and at the same time they revitalized and strengthened the muscles that were already at their utmost limit…</p><br/><p>While sleeping, Xiao Yan’s body had been strengthened to a whole new level!</p><br/><p>While strengthening and repairing Xiao Yan’s muscles, the green liquid slowly became lighter and lighter. Obviously, the energy in the liquid was decreasing.</p><br/><p>…..</p><br/><p>Unaware of how long he had fallen asleep, Xiao Yan only knew that the warm sunlight had already brightened his room when he woke up.</p><br/><p>Stretching out his body, his bones suddenly made rattling noises. When he lifted his head, he realized that his entire body was full of energy and power. Xiao Yan couldn’t help but yell out: “Great!”</p><br/><p>As Xiao Yan stepped out from the wooden bowl, he unexpectedly discovered that the bowl of Foundation Elixir had already turned into transparent water from its originally green state.</p><br/><p>“My elixir had already been used up?” Scratching his nose Xiao Yan helplessly shook his head. Suddenly recalling something, he happily closed his eye and carefully sensed his Dou Qi state.</p><br/><p>A moment later, Xiao Yan opened his eye and happily laughed: “Finally, I’m at fifth Duan Qi!”</p><br/>\n</div>"}