{"title": "Chapter 25: Ill Pay for It", "id": 25, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-25-ill-pay-for-it", "volume_title": "Volume 1", "body": "<h1>Chapter 25: Ill Pay for It</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 25<u><strong>:</strong> </u>I’ll Pay for It</u></strong></p><br/><p>After he sneaked back into his room, Xiao Yan quickly closed the door and went to the corner of the room, before finally taking out a bunch of medical herbs and magic crystals. He carefully placed them in the cabinet and deeply sniffed the smell of herbs as he smiled with relief.</p><br/><p>To practice uninterrupted, Xiao Yan had purchased the amount of herbs needed for 8 months of usage, allowing him to practice non-stop for the rest of the year.</p><br/><p>As he affectionately patted the cabinet, his lips cracked open and he lazily goes on the side of his bed, putting his head down. Today’s activities had made him really tired</p><br/><p>“Yan Er, are you there?” A mumbled voice and a knock pass through his door..</p><br/><p>Opening his blurry eyes, Xiao Yan hurriedly jumped out of his bed, then opened his room’s door, looking at Xiao Zhao outside of the door and asked: “Father, do you need something?”</p><br/><p>“Can’t I see for you even if I don’t need anything from you? You kid, you hid from me for 2 months.” Xiao Zhan reprimanded as he rubbed Xiao Yan’s head affectionately.</p><br/><p>Looking at Xiao Zhan’s warm smiling face, Xiao Yan’s was moved as he pumped his sore nose, not knowing what to say.</p><br/><p>“Are you still feeling responsible for that ? Haha, if she can’t take a liking to my son, it is her loss. You don’t have to be sad. Why should a great man act like a little kid? I know that this son of Xiao Zhan, is not a cripple.” Xiao Zhan boldly said.</p><br/><p>“Haha father, after 3 years, Yan Er will go to the Faction of Misty Clouds personally.” Xiao Yan said in a soft voice with a smile.</p><br/><p>Xiao Zhao’s smiling face became more serious, as he stared at Xiao Yan. After a while, he said with some hesitation: “Father feels fine, but… are you really going to? Father isn’t saying that you can’t reach Nalan Yanran, but the strength of the Faction of Misty Clouds…”</p><br/><p>Xiao Yan smiled as he nodded, his thin lips forcing a somewhat stubborn line: “Father, that there are some things, that as a man, I have to bear.”</p><br/><p>“Aha, this temper of your resembles mine much, if your two big brothers knew that you thought like this, they would probably be very happy”, Towards Xiao Yan’s dedication, Xiao Zhan smiled pleased before sighing and nodded heavily: “Good, father waits for his son to give him some face, I want the old bastard Nalan Shu to beg me to remake that marriage promise.”</p><br/><p>Xiao Yan nodded and couldn’t help but laugh.</p><br/><p>“Hey, I’ll give you this, consider it as your father’s support.” He handed to Xiao Yan a very familiar white bottle.</p><br/><p>Looking at this elixir that went back to his own hands, Xian Yan didn’t know whether to laugh or to cry. But on his face, he maintained a puzzled expression : “Father, this is?”</p><br/><p>“Foundation Elixir, it’ll accelerate your Dou Qi cultivation, I just bought it today.” Xiao Zhan’s mouth smiled.</p><br/><p>“You must have spent a lot of money for this right?” As he received the white jade bottle, Xiao Yan’s heart felt warm.</p><br/><p>“40 000 gold coins, but if it can be of use to you, it is worth its price ” Xiao Zhan smiled as though he didn’t care.</p><br/><p>“You spent 40 000 gold coins for buying me this foundation spirit elixir? Won’t the elders perhaps cause trouble to you using this excuse?” Xiao Yan smiled bitterly.</p><br/><p>“Tssk, I am the Clan Leader, they can at most utter some words” Xiao Zhan said coldly.</p><br/><p>“Father, thank you, during the adult ceremony in one year, I will make them shut their mouth completely”. Xiao Yan calmly laughed as he said that.</p><br/><p>“Good, I am waiting for my son to transform once more !” Although he didn’t know from where Xiao Yan’s confidence came from, Xiao Zhan was very happy seeing his son’s confident appearance.</p><br/><p>“Alright, I won’t disturb your rest. If there are any problems come and see your father, as a family member, I cannot let you be disgraced.” Waving his hand, Xiao Zhan turned around, as he took big strides leaving the front yard.</p><br/><p>“Shit, I also have to face these old fools now. I only spent 40 000 Gold Coins, but they will act like I had spent the money that was supposed to be used for buying their coffins.” From the night, Xiao Zhan’s mutters floated to Xiao Yan.</p><br/><p>Looking at his father vanish into the darkness, Xiao Yan touched his nose and smiled while saying in a low voice:”Relax, father, I will use reality to make these people quiet. 3 years before, I could make them look up at me, 3 years after, I will still be able to !”</p><br/><p>After standing at his door for a while, Xiao Yan put away the white jade bottle. Then, he shot a look at the corner of the room, teasing: ”Girl ! Is it fun to eavesdrop on people?”</p><br/><p>“Xiao Yan ge-ge, that was keen from you…….” From the corner, a pretty young girl wearing a purple skirt came out elegantly. Leaning her little head, a big smile was revealed on her beautiful face.</p><br/><p>Looking at the mischievous girl’s face, Xiao Yan helplessly shook his head.</p><br/><p>“Where did Xiao Yan ge-ge go this afternoon?” Xun Er came forward, walked up lightly and asked with a smile.</p><br/><p>“I was just on a little stroll.”</p><br/><p>“Is that so?” Her eyes looking up and down, Xun Er suddenly took a step forward and bent slightly. Her nose wrinkled while she said: “I smell the fragrance of a woman.”</p><br/><p>“*Cough*, come on, why would I have a woman’s fragrance.” Xiao Yan’s immature face suddenly blushed, but in the dark, his as well as the girl’s face couldn’t be seen clearly.</p><br/><p>“Hee hee.” Seemingly liking this predicament Xiao Yan was in, Xun Er laughed and a moment later, stopped laughing. Before quietly saying : ”A moment ago, I also heard Xiao shu-shu’s words, I believe that Xiao Yan ge–ge, yup……. In the future, you really want to go to the Faction of the Misty Clouds, Xun Er will come with you, to help you……”</p><br/><p>Hearing this, Xiao Yan blinked and tightly stared at the young girl’s beautiful small face.</p><br/><p>Under Xiao Yan’s unrestrained vision, Xun Er’s her face flushed a little from shyness as she whispered :”Xiao Yan ge-ge, what are you looking at…..”</p><br/><p>“Hehe, Xun Er can also blush, such a rare sight.” Xiao Yan unexpectedly said with a smile.</p><br/><p>Xun Er coldly glanced at Xiao Yan and she muttered under her breath: ”And you can also glance at people this way.”</p><br/><p>“Good, good, have confidence in ge-ge, although the Faction of Misty Clouds is formidable, I am still young. This Yun Yun who spoils that girl Nalan Yanran, definitely isn’t too great of a teacher.“ Xiao Yan smiled as he rubbed the black hair of the young girl. “Well, it is late, head back for a rest.”</p><br/><p>Looking at Xiao Yan waving, Xun Er shakes her head reluctantly. And went into the darkness under his sight.</p><br/><p>After turning a corner, sounds could be heard from a quarrel between Xiao Zhan and the several elders. The topic of the quarrel: how the 40 000 gold coins were used.</p><br/><p>Stopping, Xun Er’s little eyebrows wrinkled and she lets out a small sigh while a purple card appeared between her slim fingers.</p><br/><p>Her fingertips flicking the purple colored gold-card, making the purple-gold card flash into golden light as it soared towards the room where the elders are quarrelling with Xiao Zhan.</p><br/><p>The room suddenly became silent while Xun Er faintly said: ”This is the money for the Foundation Elixir. In this card there are 100,000 gold coins, now that I’ve given you this, I hope that you elders won’t continue to give uncle Xiao trouble.”</p><br/><p>The room was completely silent before the “yes” acknowledgments from the three elders came through.</p><br/>\n</div>"}