{"title": "Chapter 24: Everything For Later", "id": 24, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-24-everything-for-later", "volume_title": "Volume 1", "body": "<h1>Chapter 24: Everything For Later</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 24<u><strong>:</strong> </u>Everything For Later</u></strong></p><br/><p>Leaving the first auction hall, Xiao Yan returned to the Inspection Room and under the respectful gaze of the middle aged man, patiently waited.</p><br/><p>A few minutes later, with a flurry of footsteps, two shadows pushed the door open.</p><br/><p>“Hehe, are you the owner of the Foundation Elixir? Mister, this must be the first time you’ve come to Wu Tan City right?” With a gust of perfume, a charming yet numbing giggle sounded besides Xiao Yan. It made his firm mindset waver.</p><br/><p>After cursing “Yao Jing”, Xiao Yan furrowed his face further within the robe before turning around to look at the red-dressed woman besides him.</p><br/><p>With close contact, Xiao Yan once again realized the charm within Ya Fei. On the dazzling face was a pair of watery eyes with long eyelashes that seemed to always send out strands of binding ropes to men. Looking down, past the graceful white neck, Xiao Yan was almost sucked into her cleavage. Her natural charm even influenced the calm Xiao Yan…</p><br/><p>Although Xiao Yan had a red face, thankfully, it was covered by his robe. Calming himself, Xiao Yao slightly nodded and at the same time, Yao Lao’s voice also floated out: “The auction was successful? Give me the money, I have something to do!”</p><br/><p>As if she was intrigued by the age of the owner of the black robe, Ya Fei covered her mouth as she laughed. After a while, she recovered: “Please excuse us for a little while longer. We’re still working on the paperwork.”</p><br/><p>Slightly nodding, Xiao Yan didn’t open his mouth again and moved his sight from Ya Fei while keeping silent.</p><br/><p>Looking at the mysterious person covered in the black robe, Ya Fei’s brows furrowed. Looks like her prideful beauty had no effect. Pursing her lips, her gaze swept over the mysterious person, trying to discern every single detail in order to find out who she was dealing with.</p><br/><p>After sweeping through Xiao Yan and not getting any information, Ya Fei disappointedly looked at Gu Ni. After their eyes met, she bit her lips and asked: “Mister, Ya Fei has rarely seen an alchemist that doesn’t have the alchemist badge, could I ask for your name?”</p><br/><p>“Huh? Girl, coming to this place means that I need to say who I am?” Under the black robe, Yao Lao’s voice coldly spoke up.</p><br/><p>“Hehe, Ya Fei was only curious. If mister doesn’t want to say it, Ya Fei wouldn’t force you.” Ya Fei lightly laughed.</p><br/><p>Through the black robe, Xiao Yan watched the white legs wrapped in a red dress besides. Even though he couldn’t help but admire her beauty, he silently reminded himself that for Ya Fei to become the top auctioneer, she wasn’t some flower pot. Everyone said that beauty was trouble, after all, in the entire Wu Tan City, there were countless suitors but even to this day, none of them achieved their goal. Even though many of them blamed the Primer Auction House behind her, none of them would claim that she was a pretty flowerpot.</p><br/><p>With such a clever woman besides him, Xiao Yan was as careful as if he was walking on top of ice. He was afraid that Ya Fei would discover something from him but thankfully, with Yao Lao talking, the mysterious geezer wouldn’t be charmed by the “Yao Jing” besides him.</p><br/><p>From Yao Lao’s impassive words, Ya Fei wasn’t able to find any information. In the end, she gave up on trying to find new information and instead smiled while taking out a crystal card. On the card was the Primer Family logo: “Mister, this is the Primer Auction House’s VIP card. With this card, you can receive VIP treatment at any Primer Family Auction House. At the same time, the taxes that the Auctions take would go from 5% to 2%!”</p><br/><p>Hearing that, Xiao Yan’s brows jumped. Compared to the blabber before, he liked this kind of solid benefits, so after pausing for a while, he took the crystal card.</p><br/><p>Seeing the long and pale hand out of the back robe, a glint of confusion flashed across Ya Fei’s eyes. The voice from the person under the black robe was obviously the voice of an old man but he has a hand that looks like a young man. This person, who is he?</p><br/><p>At this time, a waitress ran in and courteously handed a green card to Ya Fei.</p><br/><p>“Mister, the Foundation Elixir sold for 40,000 Gold Coins and taking out 2% as auction fees, the rest is in here.” Ya Fei smiled while handing the green card over.</p><br/><p>Taking the green card, Xiao Yan’s tense heart fell. The funds for his training were inside that tiny green card. 40,000 Gold Coins, that would be enough to train to a Dou Zhe….</p><br/><p>Since he already got the money, Xiao Yan didn’t have any more reason to stay and after carelessly pushing his hands together, a wizened voice calmly said: “I can leave now right?”</p><br/><p>“Hehe, of course. If you would like to auction off any more pills, please keep the Primer Auction House in mind.” Ya Fei smiled.</p><br/><p>“Mm.” Carelessly responding, Xiao Yan stood up and left the tense room.</p><br/><p>Watching the disappearing shadow of Xiao Yan, the smile on Ya Fei’s face slowly disappeared and she plopped down into a nearby chair.</p><br/><p>“Gu Ni shu-shu, is he really an Alchemist?” After an awkward silence, Ya Fei broke the stillness.</p><br/><p>“Yeah, and his Alchemy skills are better than mine. That second tier Foundation Elixir, I can’t refine it.” Gu Ni answered while sighing.</p><br/><p>“Even with the formula?” Slightly wincing, Ya Fei’s red mouth carelessly let out a dangerous sentence.</p><br/><p>Hearing Ya Fei’s words, Gu Ni’s face changed and he hurriedly said: “A formula is an alchemist’s life. Please don’t think that again. To carelessly anger a mysterious alchemist, even for the Primer family, is a huge deal. A couple dozen years ago, the famous Cech family of Jia Ma Empire enraged Pill King Gu He and was annihilated by 4 Dou Wangs that Gu He sent. Even the Jia Ma Empire’s royalty wouldn’t control the matter!”</p><br/><p>“Even though our family is much stronger than the Cech family, it’s best not to offend some mysterious alchemist. Alchemists are like a hornet’s nest, once you poke it, he’ll find countless friends and many experts would love to have an Alchemist owe them a favor.”</p><br/><p>Watching the panicking Gu Ni, Ya Fei bitterly smiled while massaging her forehead: “Gu Ni Shu Shu, what are you saying. I wasn’t thinking any of that, do you think that Ya Fei has wasted these few years?”</p><br/><p>“I was reminding you.” Hearing Ya Fei’s words, Gu Ni let out a breath. He was really afraid that she would do something stupid.</p><br/><p>Pursing her lips, Ya Fei propped up her cheek while sighing. Alchemists, they really are some dangerous people but why don’t I have such a talent?</p><br/>\n</div>"}