{"title": "Chapter 48: Qi Method Pavilion", "id": 48, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-48-qi-method-pavilion", "volume_title": "Volume 1", "body": "<h1>Chapter 48: Qi Method Pavilion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 48<u><strong>:</strong> </u>Qi Method Pavilion</u></strong></p><br/><p>Standing within the group, Xiao Yan lifted his head to look at the colossal pavilion in front of him and let out a sigh, marvelling at the amazing view before him.</p><br/><p>On the sign in front of the building were three engraved words - “Qi Method Pavilion” - which exuded ancient grandeur. The signboard in front had a slight yellow hue and coupled with the chips and dents that covered its body, it was obvious that this place had gone through the vicissitudes of time.</p><br/><p>This was the most important place in the entire Xiao clan: the Qi Method Pavilion!</p><br/><p>Every single Qi Method that the clan has gathered for the past hundreds of years were all stored here. These techniques were the foundation on which the Xiao Clan secured its status to this day.</p><br/><p>As the most important place of the clan, the security on the pavilion was extremely stringent. On every other day, it was essentially a forbidden place that even Xiao clan members were prohibited from entering. It was only after the Coming of Age Ceremony that this place would be temporarily opened to the clan.</p><br/><p>Squinting his eyes, Xiao Yan briefly swept his gaze across the several hidden corners of the pavilion that were concealed by shadows. His keen soul perception informed him that every movement made in this place was being closely monitored by the guards that were concealing themselves.</p><br/><p>In several hidden places within the pavilion, Xiao Yan noticed that powerful auras were lurking unseen. It seemed that the clan really held this Qi Method Pavilion in great esteem.</p><br/><p>Slightly turning his head, Xiao Yan exchanged a quick glance with Xun Er. Both of them noticed a hint of a smile in the other’s eyes. Clearly, the guards that were hidden in the surrounding area had been detected by the two of them.</p><br/><p>……</p><br/><p>“I have already announced the rules regarding entry into the Qi Method Pavilion many times in the past, so I shall not repeat them in detail again. In short, after entering the Qi Method Pavilion, all of you are to return within 2 hours, In addition, each person is permitted to only 1 Qi Method which is to be compatible with their attribute. You may not take more than that. If anyone tries to sneak away with more, that person will forfeit his or her right to obtain a Qi Method. Therefore, all of you best take heed!” Standing at the top of the stairs, Xiao Zhan’s commanding gaze swept across the youths below him as he said this in a solemn tone.</p><br/><p>“Yes!” The group shouted excitedly in reply. Everyone stared at the gigantic pavilion with fiery eyed desire. Obtaining a better Qi Method was equivalent to gaining a head start over one’s peers, directly putting themselves in the lead. This had always been something that every clan member deeply desired.</p><br/><p>“Since you are all clear on the rules, let us begin then.”</p><br/><p>Xiao Zhan nodded in satisfaction. He took a step back and revealed a stone pillar that was in front of the pavilion’s doors. The pillar was around 1 meter in height and atop it rested a clear crystal ball.</p><br/><p>With a flourish of his hand, two guards that were behind started pushing at the enormous black door, the doors produced a low creak as they slowly opened.</p><br/><p>“After determining your attribute, you may enter the pavilion. Remember, upon entering, follow the passage marked with your corresponding attribute. Do not accidentally wander onto the wrong path!” Nodding his head towards the crowd, Xiao Zhan gestured for the test to begin.</p><br/><p>Seeing Xiao Zhan’s signal, a youth in front excitedly jumped onto the stairs. As he laid both of his hands onto the crystal ball, a faint green glow was issued.</p><br/><p>“Wind attribute. Ok, you may enter.” Xiao Zhan took a sideways glance at the crystal ball and nodded with a smile.</p><br/><p>Since someone had already taken the lead, everyone below could no longer remain still. One by one, they rushed up the stairs, and upon determining their attribute, swarmed en masse the Qi Method Pavilion.</p><br/><p>Seeing the crowd thin around him around him, Xiao Yan touched his nose and smiled at Xun Er, “Let’s go see what kind of technique we can get our hands on.”</p><br/><p>Xun Er cutely laid her hands out. The clan’s Qi Methods actually did not attract her in the least. However. since Xiao Yan was interested, she would happily accompany him.</p><br/><p>Because the pair was not in any rush, it wasn’t until everyone else had already gone in that they started to slowly walk up the stairs. Seeing this, Xiao Zhan could only give them a helpless look.</p><br/><p>Xiao Yan flashed a toothy grin at Xiao Zhan and touched the crystal ball with his palm. A fiery red light, several times brighter than any before it, lit up, signifying an affinity for the fire attribute.</p><br/><p>Xiao Zhan had already known his own son’s attribute, so his expression remained unchanged. With a slight nod, his eyes suddenly darted across the surrounding area and then he inconspicuously took a step forward. Letting out a cough, Xiao Zhan bent forward and uttered in a soft voice, “ Passage of Fire, path 3, room 43!”</p><br/><p>Upon hearing what Xiao Zhan said, Xiao Yan was initially shocked, but immediately found it amusing as he came to to realize that his father was actually abusing his authority for his son. After giving an almost unnoticeable nod, Xiao Yan stood aside to observe. It was now Xun Er’s turn to be tested.</p><br/><p>Xun Er looked at the shiny crystal ball and hesitated for a moment. Then, as she shook her head with a reluctant look, she lightly prodded at the crystal ball with a slim finger.</p><br/><p>Following Xun Er’s touch, the crystal ball that had just quieted down suddenly burst forth in red light again. For the briefest of moments, the ball became as hot and dazzling as a fireball.</p><br/><p>Astounded by the crystal ball that had now turned into a ball of flame, Xiao Zhan’s mouth dropped open a little as he involuntarily took in a sharp breath.</p><br/><p>The fireball persisted for a short period of time and it was only until Xun Er retracted her finger that the flames slowly began to die. After the light died down, one could see various thin cracks covering the entire crystal ball.</p><br/><p>Bitterly looking at the crystal ball that was on the verge of shattering, Xiao Zhan could only let out a sigh. Looking at Xun Er with a gaze that seemed to be filled with some hidden meaning, he waved his arm and said, “Hurry up and go in.”</p><br/><p>“Tsk, such a pure body of fire. Such a shame that she was not born with an affinity for the wood attribute. Otherwise, she would have been a natural born Alchemist.” While Xiao Yan remained shocked from the incident that occurred before him, he heard Yao Lao’s voice that was filled with amazement.</p><br/><p>Nodding silently in his heart, Xiao Yan looked at Xun Er who was walking towards him. Letting out a shrug, he turned around and walked into the Qi Method Pavilion.</p><br/><p>Xiao Zhan’s eyes lingered on the two people who walked into the Qi Method Pavilion side by side and then returned to look at the crystal ball. It had finally broken into several pieces with a “ka cha” sound. He stroked his chin and mumbled to himself. “Sigh, this really is… this really is way too remarkable. This girl Xun Er, not only does she have a good temperament, she is also a real beauty too. But her background is also extremely terrifying. She is incomparably better than that Nalan Yanran. If only Yan Er could have a bride like her, how nice that would be……”</p><br/><p>After saying his thoughts out loud, Xiao Zhan shook his head and burst into laughter, ridiculing himself. He could not believe that he actually entertained such a wild fantasy.</p><br/><p>While Xiao Zhan was laughing at himself, he didn’t realize that Xun Er who was about to enter the pavilion, stiffened while her delicate ears turned, just like the crystal ball from earlier, fiery red and alluring.</p><br/>\n</div>"}