{"title": "Chapter 46: The Enraged Xiao Yan", "id": 46, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-46-the-enraged-xiao-yan", "volume_title": "Volume 1", "body": "<h1>Chapter 46: The Enraged Xiao Yan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 46<u><strong>:</strong> </u>The Enraged Xiao Yan</u></strong></p><br/><p>After the Coming of Age Ceremony, Xiao Yan could finally take a breather. His days, which were usually jam-packed with training, became relaxed.</p><br/><p>Though the ingredients he had previously bought for the Foundation Elixir were almost exhausted, Xiao Yan did not consider buying any more. The him right now had finally stepped into the 8th Duan Qi and on this level the benefits of the Foundation Elixir were next to nothing.</p><br/><p>Now even though the Foundation Elixir had lost its use, Yao Lao refrained from replacing it with a new one. Instead, he told Xiao Yan to use this period of time to relax and calm his mental state. The true way of training is to to train in bouts and take a break between them. Training yourself to death might backfire and lead one down the wrong path.</p><br/><p>During these relaxed and happy days, Xiao Yan, who was used to toiling everyday, felt bored to death but he had no choice in the matter. Everyday, he would only accompany Xun Er to roam about the city. However, sometimes he would go behind the mountains to train his Dou Techniques.</p><br/><p>The current Xiao Yan had undoubtedly become the focus of the Xiao family. Wherever he went, gazes of reverence stuck to him him like shadows. And the few respectful greetings here and there made Xiao Yan wonder at the difference in treatment before and after his display.</p><br/><p>……</p><br/><p>“Peng!”</p><br/><p>In the thick and lush forest of the back mountains, a strong looking monkey-like shadow dodged and jumped with unbelievable speed. It moved through the forest quickly and nimbly, dodging all obstacles in its path. Then, with a heavy thud, a punch containing Qi and ferocious strength cracked a tree trunk that was at least 2-3 metres wide. The crack on the tree spread out continuously, and at last, with a “Bang!”, the tree snapped in half.</p><br/><p>Nimbly avoiding the falling tree, Xiao Yan jumped on top of a rock. He aimed his right hand towards his clothes which were hanging on the fallen tree and a spiral of force suddenly appeared, pulling the clothes towards his palm.</p><br/><p>Wiping the sweat from his brow, Xiao Yan let out a puff of air and slowly put his clothes on.</p><br/><p>Wearing his clothes messily, Xiao Yan’s eyebrows suddenly perked up. He squinted his eyes as he looked towards the outside of the woods and let out a chuckle.</p><br/><p>Xiao Yan’s mouth twitched into a grim smile as he brushed aside the leaves on his shoulders and started walking out of the forest.</p><br/><p>Out in the woods, the light from the sun fell down onto his body, seeping into his bones and imparting a warm cozy feeling deep down. Covering his eyes as he adjusted to the sunlight, Xiao Yan slightly tilted his head and saw the form of a woman on a rock not too far away from him.</p><br/><p>The sun illuminated the tall graceful girl’s delicate figure, highlighting her captivating curves – especially her pair of long, slender, sexy legs.</p><br/><p>Looking over at Xiao Yu who was sitting quietly on the rock, Xiao Yan rested his hands on the back of his head and slowly walked towards the giant rock. He looked up at the impassive beauty; his gaze fell particularly long on her pair of sensual legs, lingering there for more than a moment. He then sniffled and let out a haughty comment, \"Your legs are beautiful. No need to show them off.....\"</p><br/><p>With just a few words, the cold Xiao Yu’s charming face turned dark.</p><br/><p>Her chest heaving slightly, Xiao Yu bit down her teeth and coldly replied, “Do you know why I came looking for you?”</p><br/><p>\"To beat me up?\" Withdrawing his hands from his nose, Xiao Yan casually guessed, laughing a little.</p><br/><p>\"My brother was seriously wounded by your punch and now is stuck in bed, unable to move. Since you were so ruthless, I, as his sister, cannot let him be thrashed without payback.\" Xiao Yu’s beautiful pair of eyes glared at Xiao Yan, full of malice.</p><br/><p>His mouth forming into cynical grin, Xiao Yan slanted his head and sneered, “Then tell me, from your point of view, in such an instance should I have remained still and took his attack, letting him break my arm in the process?\"</p><br/><p>Xiao Yu bit her scarlet lips. She still stubbornly fixed her eyes on Xiao Yan, her eyes filled with hatred not diminished in the slightest.</p><br/><p>“No. If he really shattered my arm, your heart would only grieve for the unlucky <em>me</em> for a few minutes at most. Then, you wouldn’t feel any guilt, you wouldn’t even care if I were crippled for the rest of my life. Haha. It’s still that same old story again. You, Xiao Yu, with a personality like yours, one that enjoys discriminating without reason, what else can you do? I really freaking hate people like you. If your brother is a human, am I not then a human too?!” Xiao Yan’s anger rose with every sentence and in the end, he couldn’t help but resort to vulgar language.</p><br/><p>\"F*** you. ‘A Big chest but no brains,’ that's the best way to describe idiotic woman like you.”</p><br/><p>\"Xiao Yan, you little bastard. Shut your mouth!\"</p><br/><p>Her face contorted in anger, turning green and white in frustration. Finally, Xiao Yu lashed out, unable to endure Xiao Yan anymore after his last bout of cursing.</p><br/><p>Looking at Xiao Yu’s beautiful face turn ashen, Xiao Yan’s eyes filled with burning anger as he sneered and smacked his lips: His heart held a hint of glee.</p><br/><p>Taking a deep breath, Xiao Yu slowly quelled the anger in her heart and used her seductive long legs to jump down from the boulder. She gritted her teeth as she said: \"No matter what, I won’t let a little bastard like you off easy today.\" After saying that, she stepped forward with her left foot and, gracefully moving her delicate body, her right leg stretched forward with air whistles as she ruthlessly aimed a kick at both of Xiao Yan’s legs.</p><br/><p>With her sudden movement, Xiao Yan could only curse and quickly jump back, barely avoiding Xiao Yu’s kick.</p><br/><p>\"Hmph, no matter how talented you are, you are just an 8 Duan Qi. If I don’t teach you a lesson today, your arrogance may reach as high as the skies.” Looking at Xiao Yan, who was constantly dodging her attacks, she laughed coldly as her long slender legs danced in the air like a hurricane. The violent kicks brought about gusts of strong wind, tossing the leaves on the ground about.</p><br/><p>Xiao Yu, having the strength of a 3 Star Dou Zhe, was by far stronger than Xiao Ning. In such a quick onslaught of attacks, Xiao Yan couldn’t even find a chance to counter-attack; he could only dodge.</p><br/><p>In spite only being able to dodge Xiao Yu’s relentless flurry of kicks, Xiao Yan’s face retained its calm. He squinted slightly and with a sharp gaze he constantly searched his opponent for weaknesses to exploit.</p><br/><p>Xiao Yan blocked Xiao Yu’s continuous barrage of kicks with his arms, but with each blow his arms grew a little more sore. Really, it seemed that Xiao Yu wasn’t a complete idiot; she didn’t go all out to deal with Xiao Yan and although her attacks seemed aggressive, they would at most cause short-term injuries.</p><br/><p>Looking at Xiao Yan’s hurriedly retreating figure, Xiao Yu’s red lips lifted up in satisfaction. She tiptoed forward a little and once again ferociously prepared to spring an attack.</p><br/><p>But when she started her attacks, Xiao Yan, who has been evading her ever since the start, suddenly went from a docile sheep to become a ferocious wolf. With Xiao Yan’s curled palms pointing at her, Xiao Yu felt a strong suction force suddenly pull her in and she stumbled forward.</p><br/><p>As her body leaned forward, the Dou Qi in Xiao Yu’s body rapidly pooled at her feet. She was about to stand firm on the ground, however, the suction force abruptly disappeared and in its place was a powerful pushing force.....</p><br/><p>With a pull and a push, Xiao Yu finally lost her balance and staggered back a few steps, unexpectedly falling and landing on her butt.</p><br/><p>Being suddenly pushed down by Xiao Yan’s sudden burst of skills, Xiao Yu seemed extremely shocked. She actually forgot to quickly get back up and when she finally snapped out of her daze and tried to react, a figure resembling a ferocious tiger descended from the skies and pinned her fast to the ground.</p><br/><p>\"Motherf***ker, this master is going to rape you today!”</p><br/><p>TL: Note that this novel doesn't... I'll just let the next chapter explain it...</p><br/><p>The bruises on his face and injuries all over his body made Xiao Yan suck in a breath as his two hands pinned Xiao Yu’s pulse on her pale wrists.</p><br/>\n</div>"}