{"title": "Chapter 51: Relief", "id": 51, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-51-relief", "volume_title": "Volume 1", "body": "<h1>Chapter 51: Relief</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 51<u><strong>:</strong> </u>Relief</u></strong></p><br/><p>Nearing the heavy door, there were more than 10 guards with indifferent eyes standing firmly before the gate, barring it. At one corner of the gate in a chair, sat an aloof looking man. In his hands was a pen and a thick book.</p><br/><p>At this moment many clansmen lined up in a row in front of the old man, each one of them had brought whatever Qi Method to him so they could sign it out. After doing so, they carefully left the pavilion under the cold stares of the 10 or more guards.</p><br/><p>This was the procedure to leave the Qi Method Pavilion. Before entering the Qi Method Pavilion, Xiao Yan and everyone else was informed about the procedure, therefore it was not something unexpected.</p><br/><p>The Qi Method Pavilion was a place where all of the clan’s Qi Methods were held; methods that were acquired painstakingly by the clan for over dozens of generations. These Qi Methods were the foundation of Xiao Clan, thus the clan had extremely protective measures on the methods.</p><br/><p>The Clan had their Qi Method scrolls made out of a special type of bamboo. The bamboo could be defined as a mother-son. The mother part was the size of the palm while the son part would be able to grow as large as a dozen meters. Since the technique scrolls were made from this special material, as long as the clan chief held onto the mother part, there was no way that anyone could sneak away with a scroll. The moment one left the area with a son scroll, the mother scroll would notify everyone.</p><br/><p>The Parent’s area of influence just happened to cover the entire Xiao Clan. Therefore, once a technique scroll leaves the Xiao Clan, it is detected. Of course, nothing is absolute in this world. An individual with powerful enough Dou Qi could forcefully destroy the connection between the scrolls. However, with power at that level, why would one bother to steal Huang level Qi Methods…?</p><br/><p>It was finally Xiao Yan’s turn after waiting in line for a period of time. Walking to the front, he withdrew a Qi Method from his pocket and gave it to the old man.</p><br/><p>Receiving the dark red scroll from Xiao Yan left the old man slightly surprised. His eyes quickly appraised the boy as he thought to himself “<em>This, the [Burning Flame Refinement], was protected by a shield with the power of a 9th Duan Qi. This little brat, to think he could actually get through it…. It would seem he has some skills after all.</em>”</p><br/><p>After recording that Xiao Yan had that scroll, the old man returned it to him and indifferently cautioned, “I think you know the rules, right?”</p><br/><p>“The scroll can’t leave the clan, otherwise there will be severe consequences! You must return the scroll after one year! There must be no damage to it.”</p><br/><p>Casually nodding his head, Xiao Yan moved to the side. He leaned on the front door and waited for Xun Er’s scroll to be recorded.</p><br/><p>Flashing Xiao Yan a light smile, Xun Er extended her snow white wrist and took out her scroll.</p><br/><p>Seeing Xun Er standing in front of him, the emotionless face of the old man suddenly let a out a hint of a respectful smile. Using both hands to receive the scroll, he then quickly recorded the borrower of the scroll.</p><br/><p>Standing off to the side, Xiao Yan narrowed his eyes at the old man after seeing the change in his attitude. Xiao Yan fingers curled instinctively slightly. Since this old man was in charge of the Qi Method Pavilion, his position in the clan was comparable to that of one of the 3 elders.</p><br/><p>Xiao Yan had heard that this old man’s nickname in the clan, Cold hearted Xiao Han. This old guy, even if it was to his own father, would still talk in a foreign manner. An old emotionless face, like the muscles of the recently dead, stiff with rigor mortis. .</p><br/><p>This cold faced old man, who didn’t even respect the clan elder, was acting so respectful before Xun Er. This once again kindled Xiao Yan’s interest in Xun Er’s identity.</p><br/><p>Rubbing his nose, he thought about how each time Xun Er was silent about her identity. Lifting his head, he saw Xun Er coming over with a smile on her face. With a shrug of his shoulders, he left with her through the front door.</p><br/><p>Bursting out from the crowded entrance, Xiao Yan breathed fresh air. The atmosphere inside the Qi Method Pavilion was far too oppressive to breathe normally.</p><br/><p>\"What's wrong, Yan Er?\" Low laughter greeted Xiao Yan as a figure came into view. Looking through the Qi Method Pavilion’s door, the figure asked with a smile.</p><br/><p>Tilting his head to smile at his father, Xiao Yan nodded back with a smile of his own. A red scroll came out from inside his sleeves, \"I got it.\"</p><br/><p>Seeing the red scroll, Xiao Zhan gave a sharp intake of air, \"It's a good thing you were able to get it.\" He said in a low voice.</p><br/><p>Seeing his father’s expression, Xiao Yan couldn’t help but roar with pride filled laughter alongside him.</p><br/><p>Extending his arm to clap Xiao Yan's shoulder, Xiao Zhan smiled, \"Now that you have a Qi Method, once you become a Dou Zhe, then you'll be able to practice Dou Qi for real.\"</p><br/><p>Xiao Yan nodded obediently as he returned the red scroll back up his sleeves. He could not help but think softly, <em>“Hmm, I don’t know what’s that special about that Qi Method. A Qi Method that can evolve...is that even possible?”</em></p><br/><p>\"It’s even stranger than a Tian level Qi Method...\" Trying to recall the strange yet arrogant words of Yao Lao. Xiao Yan shook his head with a bitter laugh. He had just come across one of the finest Qi Methods in his life: Xun Er’s High Xuan level Qi Method: Flame Manipulation. To be honest, he had an internal struggle when he declined it. After all, Qi Methods of that caliber were not only expensive but extremely rare.</p><br/><p>Massaging his forehead with an open palm, he was starting to regret declining Xun Er’s kindness but the deed had already been done, it was too late. Xiao Yan did not have the face to ask Xun Er again for it, so he had no choice but to pray that Yao Lao was not playing around with him. Otherwise, he would be the biggest loser out of everyone.</p><br/><p>“Hmph, it’s only High Xuan, there’s nothing special about that. Even though she isn’t normal, her collection of Qi Methods can’t possibly compare to mine.” Right when Xiao Yan was praying that Yao Lao didn’t deceive, Yao Lao gave a slight humph and started speaking.</p><br/><p>“At last you say something…” Hearing the voice within his own thoughts, Xiao Yan scratched his nose. His mouth twitched upwards into a pleasant smile as he spoke; his point of saying so much was so that he could force that old geezer to say something calming.</p><br/><p>“Ai…you tiny brat, trying to deceive me…” An echo came out from within Xiao Yan’s mind. Yao Lao didn’t know whether to laugh or cry and instead said, “Brat, keep on practicing Dou Qi. Qi Methods are not something for you to worry about: mine won’t be shabby. In the future, your achievements won’t be lower than that little girl. Her clan is only… Ahem.”</p><br/><p>Even though Xiao Yan was disappointed that the last sentence was incomprehensible, he still nodded with a smile; he was given an answer to his question so he could concentrate on practicing Dou Qi so that he could become a Dou Zhe. This was the first step he had to take in order from him to become strong and…for him to find Nalan Yanran who has been on his mind for quite some time…</p><br/>\n</div>"}