{"title": "Chapter 69: The Furious Xun Er", "id": 69, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-69-the-furious-xun-er", "volume_title": "Volume 1", "body": "<h1>Chapter 69: The Furious Xun Er</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 69<u><strong>:</strong> </u>The Furious Xun Er</u></strong></p><br/><p>After settling everything, Xiao Yan slowly emerged from the cave. Following the mountain path, he sneakily climbed to the mountain top and glanced about to check that no one else was around. Finally, letting out a sigh of relief, he took large strides as he walked directly towards the clan home.</p><br/><p>Leisurely returning to the clan, Xiao Yan chanced upon the three Clan Elders who hurriedly rushed past as they brushed shoulders with him in the front courtyard. Pausing his step, Xiao Yan was somewhat puzzled at the gloomy yet furious faces of the three Elders who had just left.</p><br/><p>“Who has offended them now?” Amazed, Xiao Yan shook his head and turned around to find a green clothed young maiden scuttling out from a side path to stand, slender and elegant, before him.</p><br/><p>At the sight of the adorable Xun Er who wore a smiling expression on her face, Xiao Yan’s heart skipped a beat. Thinking back on what Yao Lao had asked in the cave, his face grew hot as he somewhat guiltily turned his gaze to the sky to act as if he was in thought.</p><br/><p>Slightly dazed by Xiao Yan’s unusual behaviour, it was only a moment later that Xun Er shook her head as she could not make heads or tails of the reason behind this change. Taking a step forward, she fluidly glanced over Xiao Yan as a look of surprise appeared on her delicate face. Both hands on her back, she leaned forward until there was only 1 cm between them, she feigned a smile and said: “Elder Brother Xiao Yan, you’ve advanced to Dou Zhe?”</p><br/><p>Overwhelmed by the fragrant, warm breath that blew onto his face, Xiao Yan momentarily lost his wits. Furiously shaking his head to break the spell, he firmly forced down his fluttering heart. Patting the head of the young maiden who was as tall as him, he grudgingly said: “Why can’t you let me say it myself to satisfy my conceited tendencies?”</p><br/><p>Hearing this, Xun Er’s eyes slightly curved into the shape of a beautiful crescent moon. Like always, She extended out a fair, delicate hand and started to earnestly smooth the creases on Xiao Yan’s clothes.</p><br/><p>In the past, when Xiao Yan was treated this way by Xun Er, he did not think twice about it. Yet today, after the feelings in his heart had been exposed by Yao Lao, he was now suddenly disturbed by this gesture.</p><br/><p>Near this path, other clansmen occasionally passed by. At the sight of Xun Er helping Xiao Yan to tidy his clothes like a wife, they could not help but be full of envy.</p><br/><p>As he inclined his head to look upon her delicate and flawless face, a strand of fine black hair fell across her forehead. It emphasized the largeness of her eyes which fluidly wandered about, an exceedingly touching sight.</p><br/><p>Staring blankly at Xun Er, the pace of Xiao Yan’s breathing gradually increased as his gaze heated up with passion.</p><br/><p>“Xiao Yan ge-ge…...you, what are you looking at.” Xun Er quietly grumbled after she patted down the creases on Xiao Yan’s clothes. She had finally become aware of his passionate gaze, her cheeks reddening in response.</p><br/><p>“Ah? Oh……” coming to his senses, Xiao Yan’s face also turned a shade of pink. Luckily his skin was much thicker than Xun Er’s, after faking two coughs, he nonchalantly replied: “Nothing much, it’s just that Xun Er has become more and more pretty.”</p><br/><p>Hearing Xiao Yan’s words, Xun Er did not reply and gently snorted. However, her rosy lips lifted to form a pleased expression.</p><br/><p>“Oh, right……” Recalling something, Xun Er abruptly cast a glance over Xiao Yan’s body again before gently asking: “Since Xiao Yan ge-ge has already advanced to Dou Zhe, then a Qi Method has also be learnt?”</p><br/><p>Xiao Yan’s expression stiffened as he embarrassedly nodded in affirmation.</p><br/><p>Slim fingers pressed against her snow white chin, Xun Er laughed merrily and said: “Would you let Xun Er see what level Qi Method it is?”</p><br/><p>“*Coughs*.....uh Qi Methods...are just objects, that aside…...As long as one works hard, won’t the level not matter?” Xiao Yan replied as he gave out a hollow laugh.</p><br/><p>Observing Xiao Yan’s expression, a dangerous glint slowly appeared in Xun Er’s eyes, yet her tone remained gentle as she said: “Xiao Yan ge-ge, just let Xun Er take a look……”</p><br/><p>At the obstinate Xun Er, Xiao Yan could only helplessly shrug his shoulders as he stretched out a hand. A moment later, a weak light yellow glow appeared.</p><br/><p>“Xiao Yan ge-ge, this is the better Technique that you talked about?” Staring at the light yellow glow that looked as if it would be extinguished at any moment, Xun Er’s face turned a little unsightly. Her rosy lips pursed, displaying the indignation in her heart.</p><br/><p>Xiao Yan awkwardly laughed, unsure of how to explain.</p><br/><p>“You clearly know that if you possess a high-grade Qi Method in the initial stages, it goes without saying that it would benefit your future training. Yet you rejected me, Xun Er was not trying to give you charity. Worst case scenario, you could have returned the Qi Method when you got a better one. However, now you’re practicing the lowest tier of Qi Methods, is this not to spite me?” Xun Er’s eyes widely opened as she glared at Xiao Yan in anger. Her long eyelashes sparkled with moisture.</p><br/><p>Being capable of making the sweet-natured Xun Er use this manner of speech, it is possible to imagine just how much Xun Er was puzzled and furious at Xiao Yan’s actions.</p><br/><p>As his eyes fell upon a Xun Er who was biting her lips while stubbornly hoping for an answer from him, Xiao Yan helplessly shook his head. He forced a smile and replied in a low voice: “We have lived together for ten years, do you still not understand me? Do you really think that I would be the kind of person that would let go of a high level Qi Method and instead practice the lowest level of Qi Methods like an idiot?”</p><br/><p>“But your Method...is undoubtedly of the Low Huang Level, I can feel it.” Xun Er obstinately insisted after hearing Xiao Yan’s reply; though the anger on her face had already slightly dissipated.</p><br/><p>“A book cannot be judged by its cover, currently it is not convenient for me to tell you in detail about the reason but someday in the future, you will understand. The present me is definitely not letting my emotions cloud my judgement……” Xiao Yan said as he smiled.</p><br/><p>“Really?” Gazing at the serious look on Xiao Yan, Xun Er mulled in silence for awhile before hesitantly asking once again.</p><br/><p>“Yes, it’s true, of course its true……” Xiao Yan hastily nodded his head. Fearing that she would continue to ask about the issue, he quickly changed the topic by asking: “Did something happen in the clan recently? How come the elders had such uncomfortable expressions?”</p><br/><p>“Yea, recently the Jia Lie Clan managed to invite a first tier Alchemist from god knows where. At present, their marketplace has a new remedy called ‘Return of Spring Powder’. This remedy is cheap yet effective, making it extremely well received and loved by the mercenaries in Wu Tan City.” Xun Er nodded as she furrowed her eyebrows and continued explaining: “Because of the influence from the ‘Return of Spring Powder’, the traffic in the Xiao Clan marketplace has been cut by almost half and because of this loss, the merchants from the marketplace have relocated to the Jia Lie Clan’s Marketplace. Though it had only been a few days, the Xiao Clan has already suffered economically by quite a bit, causing Uncle Xiao to worry about this event.”</p><br/><p>Hearing this, Xiao Yan nodded his head in understanding, no wonder the three Elders had such gloomy expressions.</p><br/><p>Xiao Yan slightly narrowed his eyes as he rubbed his nose, sneering in his heart: “Just a mere first tier Alchemist, does Jia Lie Clan really think he’s something?”</p><br/>\n</div>"}