{"title": "Chapter 79: Counter-Attack by the Xiao Clan", "id": 79, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-79-counter-attack-by-the-xiao-clan", "volume_title": "Volume 1", "body": "<h1>Chapter 79: Counter-Attack by the Xiao Clan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 79<u><strong>:</strong> </u>Counter-Attack by the Xiao Clan</u></strong></p><br/><p>After receiving the secret aid of Xiao Yan in the form of the large quantity of healing medication, though the Xiao Clan did not publicize this news, they had already secretly started to prepare for their counter-attack against the Jia Lie Clan.</p><br/><p>The events that occurred in the clan hall were kept a secret by Xiao Zhan and the three elders; everything regarding the healing medicine had been classified as the highest scale of prohibition. None of the clan members could mention this to the outsiders; if any one were to leak information, that person shall be punished according to the clan’s rule.</p><br/><p>Along with the silence of the Xiao family, the behavior of the Jia Lie clan became more and more arrogant, using all kinds of tricks and enticements without restraint to pull away all the customers of the Xiao family’s market.</p><br/><p>Even with this, the Xiao Clan remained silent.</p><br/><p>Seeing the Xiao family watching in silence, some of the small forces allied with them became disappointed and also started to secretly prepared to move to protect themselves.</p><br/><p>With an atmosphere a little bit stranger than normal, two days’ time quietly passed.</p><br/><p>It was another day of radiant and enchanting sunny weather while Jia Lie clan’s market was as hot and crowded like always. On the main street, people’s head were flowing like water. On the “Return of Spring Powder” stall, there was an even larger crowd of people; the sound of shouting, scolding, and scuffles all gathered in one place. The deafening voices pierced through the clouds.</p><br/><p>Behind the brown medicine counter, a medicine salesman of the Jia Lie clan was watching the arguing mercenaries fighting over the medicine. The smile on his face had a prideful look, knowing he had an advantage by being the only supplier of the medicine.</p><br/><p>Jia Lie Ku was a core member of the Jia Lie clan and was in charge of Jia Lie’s clan most popular market.</p><br/><p>Standing on the second floor of the reception hall, Jia Lie Ku looked down from high above upon the big streets of crowded people; his fat and oily face was filled with a complacent smile.</p><br/><p>During this period of time, “Return of Spring Powder” had sold far more than Jia Lie clan’s initial estimates. Under the huge temptation of benefits, the Jia Lie clan was no longer satisfied as they moved the price from 100 gold to 300 gold,</p><br/><p>Initially the many mercenaries were disgusted by the price increase, however there was no other supplier for the “Return of Spring Powder”, thus they could only make a din and complain for a while before grudgingly accepting the reality of getting cheated.</p><br/><p>Jia Lie Ku lightly hummed a small tune as his eyes pulled into a line and happily said: “Even if you don’t buy, other people will still buy……”</p><br/><p>Jia Lie Ku extended his short and fat hand to block the rays of the sun, unable to endure it in front of the warehouse. He wiped the sweat off his forehead as he grumbled: “Damn, it’s way too hot today, looks like I’ll have to release some of my ‘hot spunk’ tonight to cool off. Tch tch, the young girl from last time was so refreshing and lively.” As he recalled the ecstasy of that forbidden place, Jia Lie Ku was filled with an unbearably impatience, yet again wiping his sweat. Then his brows suddenly wrinkled up at the sight of a disturbance at the entrance.</p><br/><p>“Damnit, fighting again? These mercenaries are all brawn and no brain, do they not know that it costs money to fix the things they break?” As Jie Lie Ku gazed at the disturbance, he could not help but curse in irritation.</p><br/><p>“The Xiao Clan marketplace has also started selling healing medication!!”</p><br/><p>Just when Jia Lie Ku was preparing to send guards to settle the disturbance, a loud shout was suddenly heard from the main street.</p><br/><p>When Jia Lie Ku heard this sudden shout, the fat all over his body jiggled like a mountain crashing into the sea and on his face, his complexion slightly changed. However, a moment later he sneered and said: “Looks like there’s no hope left for the Xiao Clan, to actually come up with this kind of methods, they are practically asking for death.”</p><br/><p>The shout had caused the once noisy main street to elapse into a period of silence, however, as everyone started looking at each other in dismay, one by one, the crowd started cursing: “Damnit, don’t even think about using this kind of dirty tactics to steal the place I had been queuing half a day for.”</p><br/><p>It was clear that these people believed that the shout was a ploy to take the chance to shamelessly push to the front of the queue. After all, this kind of trick was common during this period of time.</p><br/><p>After cursing, these people continued their rush for the “Return of Spring Powder” again.</p><br/><p>Of course, not everyone had these thoughts. A small portion of the mercenaries who were sick and tired of the overbearing conduct of the Jia Lie Clan decided to check. After hesitating for a while, they chose to squeeze out of the street and head towards the Xiao Clan marketplace, half in doubt yet half in belief.</p><br/><p>Standing upstairs Jia Lie Ku looked at the still extremely popularity on the main street. He could not help but laugh proudly and spoke shadily: “Xiao Clan? Hey, lets see how long you can persevere. Later on in Wu Tan city, the Jia Lie clan may be the only big clan. The times of the 3 influential clans? Hehe, those days have left forever!”</p><br/><p>The effect of the shout from before on the busy marketplace was like a leaf dropping into the vast ocean, it barely made any ripples’ the popularity of the Jia Lie Clan was not in the least bit affected.</p><br/><p>Naturally, this was only temporary.</p><br/><p>Half an hour after the shout, a few burly men wearing mercenary garb appeared before the marketplace entrance of the Jie Lie Clan. They rudely barged into the marketplace, bumping and pushing over the guards. With gleeful faces, they lifted the green jade bottles in their hands high into the air as they shouted out in unison, momentarily suppressing the noise of the marketplace.</p><br/><p>“The Xiao Clan is also selling healing medication!!”</p><br/><p>Their unified shout caused the marketplace to fall into silence as everyone’s gazes turned to the source of the shout, a flash of understanding in their eyes.</p><br/><p>One of the burly mercenaries who had just barged in hurriedly jumped onto a large rock nearby. With a “Qiang” sound, he drew the broadsword at his side before gritting his teeth as he pulled it over his arm, drawing a fresh line of blood.</p><br/><p>Lifting his bloodied arm for all to see, the burly man tilted the green jade bottle in his other hand as a thick and viscous crimson red liquid slowly poured out to cover the wound.</p><br/><p>Under the watchful eyes of the crowd, the thick and viscous crimson red liquid invaded the wound. A moment later, the flow of the blood that was previously surging out slowed and to everyone’s surprise, the blood had already congealed to form a thin layer over the wound.</p><br/><p>On the main street, the gazes of all who had personally seen this scene suddenly lit up with passion: this kind of rapid staunching effect was essential to any mission!</p><br/><p>“This is the new product sold by the marketplaces of the Xiao Clan called “Blood Clotting Medicine”! Not only is it more effective, but its price is also lower than the “Spring of Return Powder” by more than half! What are you people waiting for? Do you enjoy being extorted like idiots? Still not dispersing?” The burly mercenary held up the jade bottle as he cracked open his mouth and laughed savagely.</p><br/><p>The main street was in silence.</p><br/><p>One of the mercenaries who had just entered the marketplace blankly stared at the green bottle in the burly man’s hand. A split second later, he abruptly turned around and ran…...</p><br/><p>Gazing upon the shadow of the man who had desperately run out of the marketplace, The crowd in the marketplace slightly wavered before loudly moving off, together, their steps caused the ground to tremble as the crowd frantically stampeded out of the marketplace.</p><br/><p>On the rock, a strange smile floated upon the face of the burly mercenary at the sight of the frantic crowd. As a wind blew across the clothes of the burly man, a Xiao Clan emblem was faintly exposed…...</p><br/><p>After the huge commotion, the originally bustling marketplace was suddenly deserted. Besides the few merchants who were still dumbstruck at the scene, there was barely anyone left on the main street.</p><br/><p>“The Xiao Clan…… has started their counter-attack.”</p><br/><p>This thought raced across all of the merchants as they gazed upon the now empty main street.</p><br/><p>They exchanged gazes and as one they lifted their heads to look upon Jia Lie Ku. At this moment, the once gleeful fatty was already paralyzed on the spot with a deathly pale complexion on his face.</p><br/><p>Meanwhile, in the other marketplaces of the Jia Lie Clan, similar situations were occurring…...</p><br/>\n</div>"}