{"title": "Chapter 70: Investigation", "id": 70, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-70-investigation", "volume_title": "Volume 1", "body": "<h1>Chapter 70: Investigation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><u><strong>Chapter 70<u><strong>:</strong> </u>Investigation</strong></u></p><br/><p>Xiao Yan found an excuse to part with Xun Er before stealthily slipping out of the clan. Pausing quickly to think, he decided to go to the nearest small marketplace owned by the Jia Lie Clan.</p><br/><p>Although he was not interested in helping the Elders to ease their troubles, he hoped within his capabilities, he could be of some help to his father. To help, he would need to know where to start, thus, Xiao Yan needed to first investigate the Jia Lie Clan’s marketplaces.</p><br/><p>This small marketplace owned by the Jia Lie Clan was positioned in a somewhat remote area and thus usually enjoyed a small crowd. However, when Xiao Yan walked into the marketplace, he was overwhelmed by the jam-packed streets and the deafening clamor of the crowds.</p><br/><p>On the wide street, people rushed about. Some bare-armed and burly men were shouting while desperately pushing their way through the crowd. From the faint smell of blood emitting from these men, they were probably bloodthirsty mercenaries. Due to being in frequent contact with death, they held a great love for healing ointments, after all, when penetrating deeply into dangerous lands, a little healing ointment might be just the right price to buy back a comrade's life.</p><br/><p>Standing at the entrance of the marketplace, Xiao Yan saw a few mercenaries carrying small wooden cases while pushing their way out of the crowd before joyously darting out of the market.</p><br/><p>“Those cases should contain ‘Return of Spring Powder’ right?”Quietly whispering this line, Xiao Yan also entered the street and used all of his might to burrow into the crowd. At a stall selling ‘Return of Spring Powder’, he spent a hundred gold to buy a case.</p><br/><p>Holding the case as he once again painstakingly squeezed out of the crowd, Xiao Yan finally let out a breath of relief. Thinking back at the proud and impatient faces of the medicine sellers, he could not help but sneer bitterly in his heart: those dogs who use their position to bully others.</p><br/><p>As he walked out of the market with the case, Xiao Yan lifted the case lid. Within it were ten small bottles made of a crude material, probably the lowest grade of jade stone. It would be impossible to maintain the effectiveness of the medicine with this kind of material.</p><br/><p>Opening the bottle, a mildly green fluid which emitted an extremely weak medicine smell was found to be contained within.</p><br/><p>“Teacher, can this even be called medicine?” Somewhat amazed at the diluted medicine, Xiao Yan could not bear but ask in his heart.</p><br/><p>“Yea, it can count as the lowest grade of healing medicine with some healing effects. This kind of simple healing medicine is not hard to make and because of its commonness, it can only be sold at a cheap price. This is why only a few first tier alchemists bother to manufacture it.”</p><br/><p>“It is indeed very cheap, one hundred gold for ten bottles is ten gold per bottle. To an Alchemist, this is really shameful.” Slightly nodding his head, Xiao Yan hesitated for a moment before asking: “Teacher, do you have any remedies that are somewhat better than this?”</p><br/><p>“A lot, but those potions are too low level so I seldom manufacture them.” Yao Lao paused before speaking again: “Do you want to manufacture them for the Xiao Clan? That’s good since you are already a Dou Zhe, it is time to try your hand at refining some medicine.”</p><br/><p>“Oh? I get to refine?” Xiao Yan was slightly astonished at Yao Lao’s words.</p><br/><p>“Could it be that you still expect me to personally handle this kind of thing?” Yao Lao unhappily retorted before proceeding with his instructions: “First, go to the Auction House to find a somewhat better quality medicine cauldron. Afterwards, you need to purchase a big batch of basic medicine ingredients. At the early stages, a new alchemist depends on mass producing pill to gain experience.”</p><br/><p>Xiao Yan licked his lips with an eager expression on his face. Throwing the case into a ditch by the roadside, he ran quickly towards the location of the Primer Auction house.</p><br/><p>Right before he arrived at the Auction House, Xiao Yan once again donned the black mantle in a hidden corner before taking his time to slowly approach the Auction House.</p><br/><p>All of the staff at Primer Auction House were already familiar with Xiao Yan’s disguise, thus when they saw a figure wearing a black mantle slowly advancing from afar, one of them quickly entered into the Auction House to inform Ya Fei and Gu Ni.</p><br/><p>Hearing their subordinates’ announcement, Ya Fei and Gu Ni simultaneously abandoned their current work to appear at the Auction House door and were all smiles as they led Xiao Yan into the guest room.</p><br/><p>“I have made this visit to ask for your help in obtaining a quality cauldron.” The old voice sounded from under the black gown. Then, with both hands, he brought the cup of tea towards his mouth to take a sip.</p><br/><p>Aware of the other party’s status, Ya Fei was not at all surprised at his request. Smiling while nodding her head, she beckoned to call a serving girl. Ya Fei softly gave the girl a few instructions before waving her hand to send the girl off.</p><br/><p>“Haha, sir, you have come at such an opportune moment, just this morning the auction house received a medicine cauldron refined by fiery flames. This cauldron was forged by the famous blacksmith from the Jia Ma Empire, Master He Er. Not only does it amplify the Dou Qi Flame, it is also made of some rare metals that help to increase the chances of successfully refining medicine. These days, these kinds of medicine cauldrons are highly praised by the Alchemists of Jia Ma Empire.” Ya Fei explained as she smiled, her eyes moved about bewitchingly.</p><br/><p>“Mmm.” The old voice carried a slightly pleased tone. Slightly hesitating before asking again: “Also prepare for me a low level “Storage Ring” with 500 stalks of Blood Clot Grass, 600 Bone Growing Flower, 500 Poppy Flowers, 500 Lively Fruits……”</p><br/><p>Hearing these requests, Gu Ni’s eyelids jumped up slightly. Even the lowest grade “Storage Ring” costs about 70 to 80 thousand and though the latter medicine ingredients were not that rare, the large quantity required meant that it would take no less than 100,000 gold to prepare. Lastly, if the medical cauldron mentioned by Ya Fei was auctioned, it could fetch a price of about 150,000. All these things added up, without 300,000 gold it would be difficult to manage.</p><br/><p>Ya Fei was likewise stunned by the request. The auction house was not owned by her alone and thus she had to report most of the profits and transactions to the headquarters. Privately using 300,000 worth of funds was not impossible but it would definitely be found out by her superiors.</p><br/><p>Lightly biting her red lips and taking a bit of time to weigh the benefits a fourth tier alchemist could bring, Ya Fei gave an easy smile as she said: “Old sir, everything will be prepared in an hour.”</p><br/><p>“Haha, good……” For the first time infront of Ya Fai, Yao Lao normally unenthusiastic tone was replaced by a pleased laughter.</p><br/><p>A fair hand emerged from beneath the black gown to fish out a blue jade card and place it on the table. Yao Lao smiled and said: “I am not sure if this money is enough for the purchases…… but you can add in another set of Qi Gathering Pill materials.”</p><br/><p>Hearing what was said, Gu Ni complexion changed faintly. Another set of materials for a Qi Gathering Pill? Wouldn’t that be another 50,000 gold?</p><br/><p>Rosy lips slightly parted, Ya Fei was a little angry too. Although the other party was a fourth tier Alchemist, this was too much.</p><br/><p>Though she was angry, Ya Fei kept these feelings in her heart, not letting even the slightest bit show on her lovely face by donning a fully smiling expression. Thinking to herself for a moment, she laughed bitterly in her heart. Reminding herself that sometimes sacrifices had to be made for the greater good, she had no choice but to sigh and nod, indicating her agreement.</p><br/><p>“Haha, looks like the two of you have misunderstood. This set of materials is not for myself, I was only thinking of helping out by making a “Qi Gathering Pill” for you. Letting you two pay for the cost of the materials shouldn’t be too much right?” The old voice coolly laughed.</p><br/><p>A slightly dazed but still lovely face was soon after suddenly filled with joy, Ya Fei’s wits were temporarily scattered by this abrupt yet pleasant surprise. A short period of time later, Ya Fei finally managed to suppress her flushed face and calm down. Making eye contact with the similarly joyous Gu Ni, she somewhat nervously replied in a soft voice: “Then I’ll have to thank you sir.”</p><br/>\n</div>"}