{"title": "Chapter 75: Big Business", "id": 75, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-75-big-business", "volume_title": "Volume 1", "body": "<h1>Chapter 75: Big Business</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 75<u><strong>:</strong> </u>Big Business</u></strong></p><br/><p>Staring at the man wearing a black cloak who had just entered, Xiao Zhan and the three elders promptly welcomed him; advancing with quick steps, Xiao Zhan showed a respectful smile and said: “Most esteemed guest , forgive me for I have been rather busy with the matters of the clan and was unable to come out to greet you Xiao Zhan, please forgive me. ”</p><br/><p>“Haha, no need to be so formal.” Under the black mantle, an aged voice rang out.</p><br/><p>Xiao Zhan eagerly nodded and gave a meaningful glance to the three elders, hinting them to promptly open up the path and said with a smile, “Please sit, most esteemed guest.”</p><br/><p>The man covered by a black cloak nodded and without being overly formal, directly walked up and sat on the seat next to the head of the table.</p><br/><p>Seeing how respectfully Xiao Zhan was treating the man in the black cloak, the youths of the clan couldn’t help but whisper among themselves. Myriads of curious glances unceasingly swept over that black cloaked man but upon hearing the elder say that he was an alchemist, their eyes suddenly became filled with ardor… and full of worship. No matter where, alchemists were the ones that had the most respected profession in the eyes of others.</p><br/><p>“Sister, this person, isn’t he the mysterious alchemist we saw during the auction the other day?” Xiao Ning’s two eyes fixed on this man dressed in a black cloak as he tugged at Xiao Yu’s sleeve, eagerly asking her.</p><br/><p>“Yeah.” Xiao Yu slowly nodded; her beautiful eyes were still staring at this silhouette covered by a black mantle, as her lovely face showed a slight expression of pleasant surprise: “I didn’t think that this honorable sir would really come to our Xiao clan; it looks like what he said last time about cooperating with us wasn’t just lip service… If we really obtain his help, the Xiao clan should be able to go through this predicament with ease. ”</p><br/><p>Hearing the whispers from the people around her, Xun Er wrinkled her brows and fixed her crystal clear eyes tightly at the stocky man in the black mantle. She didn’t know why, but she felt that the man’s gestures, his speech and his manners were not exactly harmonious.</p><br/><p>After knitting her brows while pondering for a long time, Xun Er could only helplessly renounce this idea.</p><br/><p>“Haha, sir; what brings you here?” Personally preparing a cup of tea, Xiao Yan asked with a smile.</p><br/><p>“I was passing in the neighborhood, so I thought I’d come to visit your noble clan. I brought with me a few Foundation Elixirs that should be able to foster a good amount of youths from your side.” Under this black gown, the elder’s voice was quite joyous.</p><br/><p>Having heard him, Xiao Zhan hurried to look around but didn’t see the faintest trace of Xiao Yan. He couldn’t help but bitterly smile.</p><br/><p>“Haha, the Xiao family head doesn’t need to call him out, I have already met the young master, a quite fine youth, he’s quite to this old man’s liking...” Waving his hands, he stopped Xiao Zhan from calling someone to get Xiao Yan. The tone of the black cloaked man was filled with a touch of admiration that he didn’t conceal and made the youth hidden under the cloak quite embarrassed.</p><br/><p>Hearing the black cloaked man’s tone filled with admiration, the eyes of everyone in the hall were filled with envy. To get such a high evaluation from such an high level alchemist wasn’t something that was easy to come by.</p><br/><p>“All the good stuff happens only to this brat.” As he twitched his mouth, full of unwillingness, Xiao Ning's tone was full of envy.</p><br/><p>Xiao Yu, completely helpless, sighed, her jade-like hands on her cheeks, she silently whispered: “Is that brat so good? How come I never realized it before?”</p><br/><p>Hearing the compliment, Xiao Zhan’s face revealed a huge smile and in his eyes, a glimpse of pride could faintly be seen.</p><br/><p>“Xiao clan leader, I recently heard that your clan was facing hardships, right?” Xiao Zhan’s smile hadn’t stretched out completely before it was struck down by the oppressive voice of Yao Lao.</p><br/><p>Nodding in agreement, Xiao Zhan smiled bitterly, “Surely this sir knows our Xiao clan’s current situation, right?”</p><br/><p>“Mhh, I know a bit about it.” Nodding, the black cloaked man revealed a smile.</p><br/><p>“Ai, in the current Xiao Clan, our business is already no more than half than what it was in the past. In the long term, I’m afraid that our influence is also going to sink down to that of a second-rate clan.” Xiao Zhan sighed in regret, wrinkling his brows. He seemed to age a few years at that particular moment.</p><br/><p>“Haha, Even though I am not so close with Xiao Clan, I am getting along quite well with your son. If you, Xiao Clan leader, are not afraid that this old man may have some bad intentions, how about cooperating together? ” The black cloaked man smiled gently.</p><br/><p>Having heard him, Xiao Zhan was startled at first but soon became wildly joyful; that was all he was what he was waiting for… He gave a look full of excitement to the three elders and soon after, nodded without the slightest hesitation: “Sir, we want to cooperate with you; we’d love to in fact.”</p><br/><p>The assistance of an alchemist above the second tier was something that Xiao Clan could not even dream of. Xiao Zhan didn’t think that his own clan had something that could interest a second tier alchemist and hearing the alchemist’s words, that he would cooperate with the Xiao Clan, Xiao Zhan deduced that the reason of the alchemist helping should be because of Xiao Yan. With such an opportunity, Xiao Zhan would be fighting to get the chance.</p><br/><p>Seeing Xiao Zhan’s approval, the black cloaked man nodded and a white palm appeared from the cloak. On his finger was a red-colored ring and with a flick, it immediately flickered in red light...</p><br/><p>Staring at his palm, as white as a youth’s, Xiao Zhan was shocked. The palm gave him a… familiar feeling.</p><br/><p>But Xiao Zhan didn’t have the time to ponder about the cause of his sensation of déjà vu; immediately, a pile of jade bottles appeared on the table.</p><br/><p>The huge table was, in a blink of eye, entirely covered with little jade bottles; there wasn’t a single place left empty.</p><br/><p>Staring at these jade bottles that appeared out of thin air inside this big hall, except from the green clad lady that was near the window, all the other clansmen, without the slightest exception, were shocked by this tremendous amount of pills to the point that they could hardly breath.</p><br/><p>“Here are 1283 bottles of the healing medicine, “Blood Clotting Powder”. It isn’t the best healing drug in terms of quality but compared to the Jia Lie Clan’s “Return Spring Powder”, its effects are lot more outstanding.” Watching the stunned people in the hall, the black cloaked person carelessly introduced his “merchandise”.</p><br/><p>Xiao Zhan, shocked with mouth wide open, took a deep breath of the surrounding ice-cold air, “This is truly a big business!”</p><br/>\n</div>"}