{"title": "Chapter 86: Challenge", "id": 86, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-86-challenge", "volume_title": "Volume 1", "body": "<h1>Chapter 86: Challenge</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 86<u><strong>:</strong> </u>Challenge</u></strong></p><br/><p>Turning around slowly, Jia Lie Ao slanted his head, the smile on the corner of his mouth was a little sinister. “Liu Xi Da-ge, may I play around with him?”</p><br/><p>Liu Xi nodded his head and smiled. Without leaving any trace, he straightened his palm in front of him and perversely said: “If you have the chance, don’t hold back.”</p><br/><p>Jia Lie Ao smiled and shut his eyes. Liu Xi’s words had abruptly prompted him to recall a secret private conversation he had with Jia Lie Bi. Back then, Jia Lie Bi had just received the news of Xiao Yan having recovered his talents. After a long silence while wearing a gloomy face, Jia Lie Bi used an extremely solemn and cold voice when he finally spoke to Jia Lie Ao.</p><br/><p>“If that boy ever accepts your challenge you must not show any mercy. It would be best if you could kill him on the spot. Even if you are unable to, crippling him will also help the Jia Lie Clan remove a potentially terrifying enemy.”</p><br/><p>Gradually remembering the grave and chilling voice that his father used to deliver the message, the smile on Jia Lie Ao’s face grew increasingly sinister. His awful eyes gazed at the calm Xiao Yan a short distance away. He felt a premonition that the young genius would be killed by his own hands.</p><br/><p>Jia Lie Ao’s confidence originated from his own strength. In addition to the position of a three star Dou Zhe, the Qi Method that he had trained with was a wind element High Xuan one, Hurricane Chant. Adding the few Dou Techniques that he knew, he was already able to be victorious in a challenge against a five star Dou Zhe.</p><br/><p>Compared to him, even though Xiao Yan had his talent return was only 8 Duan Qi at the Coming of Age Ceremony. Even if his strength once again increased during this period, it was impossible for Xiao Yan to surpass him. Regarding this, Jia Lie Ao had absolute confidence.</p><br/><p>Within the entire street, Jia Lie Ao was not the only one who thought that Xiao Yan had no chance of victory. Even the observing mercenaries and Xiao Yu similarly thought that regardless of how outstanding Xiao Yan’s talent was, the gap in the rank of the two was not something that anyone could ignore.</p><br/><p>“Isn’t this little rascal normally overtly shrewd? Why did he fall for that guy’s lowly provocation?” Seeing Xiao Yan who had a metal rod in his hand, Xiao Yu’s face became bleak. Stepping forward, she cruelly scolded in order to protect Xiao Yan: “When have you become someone who doesn’t know his limits? Knowing that you can’t win, why did you accept the challenge? Are you tired of living?”</p><br/><p>Receiving the spurt of reprimands from Xiao Yu, Xiao Yan merely shrugged and smiled: “We haven’t even started fighting. It is difficult to say who is the one who is tired of living.”</p><br/><p>“You…” Watching the stubborn Xiao Yan, Xiao Yu savagely stomped her feet. Her sexy long legs leaped to his front, blocking him. Next, she lashed her green whip in the air and releasing a splitting sound. “Let me fight in your stead. I know your potential is great but that is something for the future.”</p><br/><p>Watching Xiao Yu whose back was facing him, Xiao Yan was stunned. He did not expect that the woman who had always fought with him would in the face of others, protect him to such an extent. He rubbed his head, unable to make heads or tails out of it. After which, he swept his gaze across Xiao Yu’s back to her slender waist, her beautiful butt and finally landing on her pair of perfect and sexy long legs.</p><br/><p>Somewhat surprised at the perfect outline of this wild woman, Xiao Yan smacked his lips and quickly retrieved his gaze before the body’s owner discovered them. His head leaned forward. When viewed from a distance, he appeared to be putting his chin on Xiao Yu’s shoulders. “Eh. Back then, didn’t you wish for someone to beat me to death?”</p><br/><p>The sound of breathing beside her ear lead to Xiao Yu’s body instantly tense up. The delicate tip of her ear was quickly covered by a pink blush. A moment later, she took a deep breath and spoke with indifferent voice that hid a difficult to discern shiver: “You should clearly understand the value you have to the clan. Therefore, you cannot accept any challenges as you please. As your... Biao-jie, I have the right to protect you from some danger.”</p><br/><p>“Eh, what a strange argument.” Xiao Yan could only helplessly scratch his head. “Forget it. I will settle my own problem. As a woman, you should stand aside.” Finishing the sentence, he fiercely tightened his gripped on the metal rod and turned his body to one side, bypassing Xiao Yu who had been blocking him. Stepping off the ground, he suddenly rushed towards the impatient Jia Lie Ao.</p><br/><p>Watching Xiao Yan’s actions, Xiao Yu became anxious. Just as she was about to knock Xiao Yan back with her long whip, a young lady’s clear voice caused her to pause: “Xiao Yu Biao-jie, have faith in Xiao Yan ge ge. He is not an impetuous person. If he did not have the confidence, he would not proactively provoke another.”</p><br/><p>“Xun Er…” Turning around Xiao Yu watched the smiling Xun Er, Xiao Yu was stunned. All she could do was nod and sigh. Her hands, however, continued to grip her long whip tightly.</p><br/><p>“Heh Heh, little bastard, I will make you regret your foolish actions today.” Staring at Xiao Yan, who was rushing over armed with a metal rod, Jia Lie Ao laughed coldly. The pale green Dou Qi was quickly being embodied on his palm.</p><br/><p>Jia Lie Ao stood on the spot without moving. His palms had suddenly changed into the shape of sharp claws. At the tip of his fingers, the green Dou Qi faintly formed 10 sharp wind nails. With a sinister laugh, he moved his hands. Together with a wind-breaking sound, he ruthlessly attacked Xiao Yan.</p><br/><p>Feeling the faint sharp sound of ripping air, Xiao Yan narrowed his eyes. He raised his left hand and ferociously punched the ground in front of him. A shapeless strong gust of air hit the surface and its reflected force suddenly halted Xiao Yan’s advance.</p><br/><p>Seeing how flexible Xiao Yan was in controlling his momentum, the surrounding experienced mercenaries immediately exclaimed in admiration.</p><br/><p>At the moment when his body came to a stop, the metal rod in Xiao Yan’s hand was released and continued forward. Just like a released arrow, it shot towards Jia Lie Ao’s head.</p><br/><p>Watching the metal rod flying towards him, Jia Lie Ao smiled disdainfully. With the flip of the hand with the floating green Dou Qi, the air in front of him became turbulent and a few small green hurricanes appeared.</p><br/><p>After bypassing a few small hurricanes, the metal rod’s strength was easily eliminated.</p><br/><p>Losing its strength, the metal rod fell onto the ground half a meter away from Jia Lie Ao with a clear and loud crash.</p><br/><p>“Ah...” Observing Xiao Yan’s offensive being easily overcome, the surrounding people could not help but sigh. Jia Lie Ao, who possessed a high level skill seemed to be unbeatable.</p><br/>\n</div>"}