{"title": "Chapter 94: Poor Foresight", "id": 94, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-94-poor-foresight", "volume_title": "Volume 1", "body": "<h1>Chapter 94: Poor Foresight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 94: Poor Foresight</u></strong></p><br/><p>“What? All the medicinal ingredients were destroyed by someone?” The furious roar within the large hall nearly caused the roof to collapse.</p><br/><p>The trembling guard that knelt in front of Jia Lie Bi had a face filled with horror as he swallowed his own saliva. Quaking in fear, he said: “The second elder was also killed by the one who destroyed the medicine.”</p><br/><p>Jia Lie Bi’s furious face suddenly froze. His face fell and legs felt weak as he collapsed backwards, onto the chair behind him. Jia Lie Nu was one of the three Da Dou Shi’s of the Jia Lie clan. His death added to the turmoil that the Jia Lie Clan currently faced.</p><br/><p>Seeing Jia Lie Bi’s reaction, the face of the guard who delivered the message was also filled with distress. At that moment, his mind recalled the frightening strength of the black cloaked man. It was difficult to imagine that the second elder, a three star Da Dou Shi, would actually be burnt to ashes by the mysterious man. The frightening scene had given those present the true taste of fear.</p><br/><p>“Who was the one who killed the second elder?” After a few minutes of silence, Jia Lie Bi finally began to gradually recover. His slightly hoarse voice revealed how big a blow Jia Lie Nu’s death was for him.</p><br/><p>“I have no idea. Back then, the man was wearing a black cloak so no one saw his face. But he could control some kind of white flame, which was also the flame the second elder perished under.” The guard shook his head and replied softly.</p><br/><p>“A black cloak? Controlling a white flame?” After a brief silence, Jia Lie Bi’s face changed. Manipulating flames to hurt the enemy was the preference of an alchemist. And the only alchemist who had any enmity with the Jia Lie Clan and possess the strength to easily kill Jia Lie Nu… All of these criteria caused an image of the black cloaked alchemist he had accidentally met at the auction house to flash into his mind.</p><br/><p>Recalling the respectful manner Ya Fei and Gu Ni showed towards the black cloaked alchemist, Jia Lie Bi suddenly felt a bitterness in his mouth. They were wrong from the beginning. Back then, just because of a statement from Liu Xi, they had thought the Xiao Clan was simply lucky enough to hire a novice alchemist. However, the current situation told them that the alchemist of the Xiao Clan was much stronger than the incompetent Liu Xi.</p><br/><p>Jia Lie Bi gently shook his head as malicious fury flashed across his eyes. The four hundred thousand gold coins worth of medicinal ingredients were destroyed and moreover, they still owed three hundred thousand gold coins to the medicinal ingredients supplier in Ta Lan City due to cash flow problems.</p><br/><p>Jia Lie Bi had originally intended to refine this batch of medicinal ingredients into healing medicine and sell the medicine to repay the loan. With the latest development, all of his plans were ruined.</p><br/><p>The medicinal supplier that worked with the Jia Lie clan had significant influence and strength in Ta Lan City. Once they knew that the medicinal supplies were destroyed, they would definitely send someone to collect their debt. However, with the coffers of the Jia Lie clan having been exhausted, how were they going to find such a large sum of money? If they failed to raise the money, then the Jia Lie Clan’s reputation would be completely destroyed by this event.</p><br/><p>“Damn!” Unable to think of a solution, Jia Lie Bi slammed his palm angrily intothe table beside him. Immediately, the black wooden table was smashed into pieces and a wooden fragment hit the face of a guard standing by the side. The latter simply clenched his teeth and withstood it.</p><br/><p>Taking a light breath, Jia Lie Bi forcefully suppressed the fury and malicious resentment towards the Xiao Clan in his heart. He shook his hand and purposefully acted calm as he said, “Distribute all the remaining healing medicine in the warehouse to all the marketplaces. One more thing. I want everyone to keep quiet about everything that has happened today. If anyone spreads this news, they will be punished in accordance with the clan rules.”</p><br/><p>“Yes.” The guard’s body trembled lightly before he respectfully gave a reply. After which, he got up and quickly exited the hall.</p><br/><p>Staring at the empty large hall, Jia Lie Bi tiredly leaned against the chair. This time, even if the Jia Lie Clan managed to survive, their strength would be greatly diminished. From then on, it would be difficult to fight with the Xiao Clan. Thinking of this, Jia Lie Bi sighed deeply. For some unknown reason, he was beginning to regret having started the conflict with the Xiao Clan back then…</p><br/><p>However, this regret came a little too late.</p><br/><p>……</p><br/><p>After settling a few other matters, Xiao Yan threw off his disguise and quickly returned to his clan. He requested Yao Lao to refine some Strength Recovering Pills before quickly delivering them to Xun Er. Seeing the girl caress the pills and her slightly red limpid eyes, Xiao Yan received a great boost to his confidence.</p><br/><p>A few days after Xiao Yan destroyed the medicinal ingredients of the Jia Lie Clan, Wu Tan City continued to remain calm on the surface. However, the more observant people began to realize that the members of the Jia Lie Clan who had been causing trouble near the Xiao Clan’s marketplace silently disappeared. Their usual arrogance had also diminished. In the face of the Jia Lie Clan’s inexplicable actions, some people began to feel a little suspicious.</p><br/><p>Xiao Clan’s meeting room-</p><br/><p>“What is the Jia Lie Clan trying to do these days? Are they trying to give us the impression of being weak?” After receiving various amounts of information in the past few days, Xiao Zhan narrowed his eyebrows as he spoke to the three elders in the hall. His face was filled with suspicion.</p><br/><p>Exchanging looks with one another, the three elders shook their heads in unison. After a deep hum, the first elder slowly spoke, “This abnormality may not be that simple. Jia Lie Bi is a cunning man. He may well be carrying out some schemes; it is better to be cautious.”</p><br/><p>Xiao Zhan nodded his head. Naturally, as a prudent person, he would not relax in the face of the Jia Lie Clan’s actions.</p><br/><p>Shifting his gaze, Xiao Zhan helplessly shook his head at Xiao Yan who was almost napping in his chair. . The rascal seemed unable to show any interest in clan matters.</p><br/><p>“Yan Er, have you met with the esteemed elder recently?” Xiao Zhan randomly asked as he raised his tea cup to his mouth and took a sip.</p><br/><p>TL: Er - an intimate form of address. Yan Er refers to Xiao Yan</p><br/><p>Hearing Xiao Zhan’s question, the three elders also shifted their gaze to Xiao Yan. That esteemed elder’s importance to the Xiao Clan was understood even without saying. However, it appeared that only Xiao Yan in the entire Xiao Clan was favored. No other person had the opportunity to meet the esteemed elder alone.</p><br/><p>Seeing how Xiao Yan got to enjoy such a privilege, everyone was filled with envy.</p><br/><p>Lazily raising his eye lids, Xiao Yan said with a bored voice, “Hmm... I’ve seen him.” After a brief silence, he continued, “He intends to take me as his disciple.”</p><br/><p>Upon hearing Xiao Yan’s words, Xiao Zhan’s hand which had lifted the tea cup froze. He lifted his face, which was filled with emotion and stared at the young man who had shrunk into his chair. Swallowing his saliva, he asked in disbelief, “Did you say that he wants to take you as his disciple?”</p><br/><p>Raising his eyelids and watching Xiao Zhan’s face fill with happiness and excitemen, while the faces of the three elders grimaced with knitted brows, Xiao Yan nodded lazily.</p><br/><p>“Good. Good. Good…” With a flushed face, Xiao Zhan emptied his tea cup in one go and excitedly stood up. He paced the room and rubbed his hands eagerly. “I knew that my son was not an ordinary person. Dammit, whoever dares to call my son ‘cripple’ in the future will be killed personally by me.”</p><br/><p>Watching Xiao Zhan’s agitated manner, Xiao Yan could only helplessly shake his head and say softly, “In half a month, I will leave to train with teacher. I’m afraid it will be over a year before I return.”</p><br/><p>“Ha?” Xiao Zhan was stunned. The smile on his face diminished as he raised his eyebrows and hesitatingly asked, “Are you not planning to take the entrance examination for the Jia Nan Academy? Jia Nan is a well known top academy across the whole Dou Qi continent. If you can enroll there, it would definitely benefit you.”</p><br/><p>“I will take entrance examination, but I may skip for one or two years.” Xiao Yan rubbed his nose and smiled indifferently. “Although Jia Nan Academy is great, they cannot help me surpass Nalan Yan Ran in less than two years…”</p><br/><p>TL: Nalan Yanran - Xiao Yan ex-fiancee; Nalan Su - Nalan Yanran’s father</p><br/><p>TL: Xiao Yan master skipper</p><br/><p>Xiao Yan smiled as his gaze swept across the entire hall. Back then, that arrogant woman had crushed his remaining pride at this very place.</p><br/><p>Hearing the name that was taboo to Xiao Yan, Xiao Zhan face trembled and he became silent.</p><br/><p>Standing up, Xiao Yan lazily stretched his arms and cupped the back of his head as he slowly exited the large hall. The young man’s faint laughter floated through in the large hall.</p><br/><p>“Since I made a promise back then, I must keep my word and meet her. Haha, it is not that I wish for her to look at me in a better light, it is just that I want to tell her that her foresight is terrible when I finally meet her…”</p><br/>\n</div>"}