{"title": "Chapter 92: Rob", "id": 92, "volume": 1, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-92-rob", "volume_title": "Volume 1", "body": "<h1>Chapter 92: Rob</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 92: Rob</u></strong></p><br/><p>By the time Xiao Yan woke up from his sleep, the sky was already very bright. Warm sunlight entered through the gaps in the window, leaving spots of light on the ground.</p><br/><p>Getting up, Xiao Yan’s sleepy gaze was hazy as he sat on the bed and stared blankly for a long while before finally getting rid of his desire to continue sleeping. Shaking his waking head, he lazily got out of bed and randomly washed his face.</p><br/><p>Just as his washing was done, a faint knock vibrated from the door. This was coupled with a young lady’s soft and gentle voice: “Xiao Yan ge-ge, have you not woken up?”</p><br/><p>Hearing this voice, Xiao Yan’s eyebrows twitched. He quickly wiped off the moisture on his face and walked to the door. The door screeched as he slowly pulled it open.</p><br/><p>After opening the door, a blinding light suddenly shot into the room, causing Xiao Yan to habitually close his eyes. A while later, he slowly opened his eyes and shifted his gaze to the lady in green who was standing quietly by the doorway.</p><br/><p>Today, Xun Er was once again wearing green. Her appropriate clothes matched her lotus-like refinement, prompting the young man in the room to let out some praise in his heart.</p><br/><p>After randomly scanning Xun Er’s delicate and slim body, his gaze finally landed on the slightly pale exquisite small face. His eyebrows could not help but form a frown. “What happened?”</p><br/><p>With charming big eyes focused on Xiao Yan’s expression and finding nothing but accusation. Xun Er immediately replied with a smile, “I’m not feeling well. It’s no big deal.”</p><br/><p>“Not feeling well?” Xiao Yan’s eyebrows twitched as he walked out of the room. After closing the door, his palm suddenly grabbed Xun Er’s small hand. A weak and warm Dou Qi under the control of his spiritual perception, slowly circulated in Xun Er’s body.</p><br/><p>A moment later, Xiao Yan expressionlessly retrieved his Dou Qi and sighed in his heart. It seems that the secret technique Xun Er had used last night was extremely exhausting. In her body right now, only a little weak Dou Qi was flowing. Clearly, this was the aftermath of using the secret technique.</p><br/><p>During the early morning, there were many clan members who had woken up to practice. This group was filled with envy upon seeing Xiao Yan holding Xun Er’s hands while standing by the doorway.</p><br/><p>“Xiao Yan ge-ge.” A red faced Xun Er lightly whispered as she struggled to free her hands.</p><br/><p>“I have no idea what you have done. How can you become so weak?” Putting down Xun Er’s small hand, Xiao Yan stiffened his face and softly said.</p><br/><p>After those intelligent big eyes scanned Xiao Yan’s face and once again found nothing, Xun Er secretly heaved a sigh of relief and smiled, “Yesterday I had tried to train a Dou technique that surpassed my level and this is the result. I’ll be fine after a few days of rest. Xiao Yan ge-ge need not worry.”</p><br/><p>Rolling his eyes, Xiao Yan could only shake his head helplessly as he accompanied Xun Er to breakfast. After that, he found an excuse and secretly left the clan.</p><br/><p>……</p><br/><p>Xiao Yan walked aimlessly in Wu Tan City and casually inquired about news on the Jia Lie clan. Liu Xi’s disappearance would definitely cause some sensation within the Jia Lie clan. Contrary to his expectations, however, he could not discover any abnormality in the Jia Lie clan. The marketplaces had continued to operate and the healing medicine continued to be sold. There was nothing different.</p><br/><p>“Heh. No wonder this Jia Lie Bi is a clan leader. He could actually suppress this news. Still, he might be able to suppress this for a day but he can’t do it forever. Once the remaining healing medicine is sold out, I want to see what he can do.” Xiao Yan laughed coldly for a while before heading to the Primer Auction House at the center of the city.</p><br/><p>In a remote area outside the auction house, Xiao Yan put on a black cloak just like he always did and entered the busy auction house.</p><br/><p>Upon entering the auction house, Xiao Yan was courteously led into the VIP room by a beautiful female waiter. He waited for a moment before the graceful looking Ya Fei appeared with a smile in front of Xiao Yan.</p><br/><p>“Haha, an important guest. Xiao Yan Di-di, what brings you to the auction house?” Lifting a tea pot, she personally bent her body and poured a cup of tea for Xiao Yan as she spoke.</p><br/><p>Whether it was intentional or otherwise, the attractive snow white skin on on Yan Fei’s chest appeared and disappeared as she bent her body to pour tea. It caused one’s eyes to be fixated on it.</p><br/><p>“Ke…” Xiao Yan’s gaze was almost lost in the magnificent view but he used his fairly strong willpower and managed to shift his gaze away with a dry cough. His gaze did not leave his cup of tea as he pulled out a dark red storage ring from his breast pocket and extracted five small jade bottles from it. In an indifferent voice, he said: “Today, I am here to fulfill our agreement.” As Ya Fei already knew about his identity, Xiao Yan no longer let Yao Lao speak for him and simply used his young voice.</p><br/><p>Ya Fei’s gaze never left the small jade bottles upon their appearance. Happiness appeared on her enchanting face.</p><br/><p>Ya Fei elegantly sat on the chair beside Xiao Yan. She carefully picked up one of the jade bottles and weighed it with equal care. After which, she slightly opened the bottle. A green coloured round pill naughtily rolled out from the bottle.</p><br/><p>Taking a deep breath of the medicinal smell that assailed her nostrils, Ya Fei’s beautiful eyes constricted. A while later, Ya Fei finally attentively returned the pill to the bottle. She threw an enchanting and beautiful smile at Xiao Yan who was beside her. “It seems that Xiao Yan Di-di is prepared to take action against the Jia Lie clan. Otherwise, why would you come over to prematurally complete our deal?”</p><br/><p>Hearing this, he shrugged his shoulders, neither denying nor acknowledging it. He took out another scroll which contained the names of some medicinal ingredients. These medicinal ingredients had the ability to recover one’s strength. Naturally, this was prepared for Xun Er. Seeing her weak and pale face, Xiao Yan felt his heart ache.</p><br/><p>Receiving the scroll from Xiao Yan, Ya Fei, who had a number of such experiences, knew Xiao Yan’s meaning. Without any unnecessary words, she proceeded to call a female waiter and got her to quickly prepare what was on the list.</p><br/><p>Sitting in the quiet VIP room, Xiao Yan, who had been silent, suddenly said, “It appears that the Jia Lie clan has gone to other cities in search for a new source for medicinal ingredients.”</p><br/><p>“Em, the Jia Lie clan is now working with a medicinal supplier in Te Lan City, However, the price of the medicinal ingredients they purchased from there is four times more expensive than it is in Wu Tan City.” Ya Fei nodded and agreed with a smile.</p><br/><p>“To think that they are willing.” Mockingly shaking his head, Xiao Yan continued with a smile. “Can you provide me with some information on the transportation of these medicines?”</p><br/><p>Hearing this, Ya Fei’s hand which was holding a tea cup trembled. Her beautiful eyes stared at the young man beside her with astonishment and said, “What do you plan to do?”</p><br/><p>“Rob.”</p><br/><p>After a bitter smile, Ya Fei once again sighed: “The Jia Lie clan was really unlucky to meet a little fiend like you.”</p><br/><p>Shaking her head, Ya Fei became quiet. She finally stood up and went to the room behind her. After some time, she finally came out with a scroll and handed it to Xiao Yan. She quietly whispered, “I have received some information from the auction house in Te Lan City. Two days ago, the Jia Lie clan had once again purchased four hundred thousand gold coins worth of medicinal ingredients. This batch of medicinal ingredients should reach Wu Tan City by this afternoon.”</p><br/><p>“The Jia Lie clan has only paid one hundred thousand gold coins as deposit for this batch of medicinal ingredients. The remaining three hundred thousand gold coins is on credit. Protecting the medicinal ingredients are the warriors of the Jia Lie clan, three Dou Shi’s and a Da Dou Shi. There are also another few dozen guards with at least the strength of a Dou Zhe.</p><br/><p>“Four hundred thousand? What a large amount.” Xiao Yan said with a smile as he deposited the scroll into the storage ring. His laughter slowly became colder. “If this batch of medicinal ingredients disappeared, I wonder how they would account to the medicinal supplier. With the current Jia Lie clan being close to bankruptcy, this three hundred thousand gold credit would be its final blow.”</p><br/><p>Lifting his head, Xiao Yan watched a female waiter who had just entered. After cupping one hand over the other and thanking Ya Fei, he went forward and received the medicinal ingredients before walking out of the hall without a backward glance.</p><br/><p>Sitting on the chair and watching the decisive manner in which Xiao Yan left, Ya Fei laughed bitterly and shook her head. She gently sighed: “This little boy’s actions do not correspond with his age at all. That old man, Jia Lie Bi, is likely going to be in deep trouble…”</p><br/>\n</div>"}