{"title": "Chapter 108: Octane Blasts Hidden Force", "id": 108, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-108-octane-blasts-hidden-force", "volume_title": "Volume 2", "body": "<h1>Chapter 108: Octane Blasts Hidden Force</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 108: Octane Blast’s Hidden Force</u></strong></p><br/><p>A lonely crescent moon hung in the pitch black night as its faint, cool, light blanketed the vast land.</p><br/><p>Within the pitch dark forest, a weak bonfire danced gracefully, bringing threads of warm light to the quiet and dark night.</p><br/><p>Beside the bonfire, a young man was leaning against a tree trunk and absent-mindedly prodded the fire with the fire poker in his hand.</p><br/><p>Including today, it has already been five days since Xiao Yan left Wu Tan City. Most of the initial freshness had faded along his lonely journey. A faint feeling of homesickness instead began to slowly climb into the young man’s heart.</p><br/><p>After randomly placing another piece of firewood into the flame, causing it to once again burn brightly, Xiao Yan rested his chin on his palm and lazily said, “Teacher, where exactly are we going?”</p><br/><p>“The Magic Beast Mountain Range,” An aged voice said from within the ring on his finger.</p><br/><p>“I thought that we could also enter the Magic Beast Mountain Range from near Wu Tan City. Why do we have to travel so far?”</p><br/><p>“We are on the eastern side of the Magic Beast Mountain Range. By passing straight through here, we can reach Tagger Desert. That is the final destination for out training.” Yao Lao said</p><br/><p>“Passing straight through the Magic Beast Mountain Range?” The corner of Xiao Yan’s mouth opened as he laughed dryly: “My current strength will only allow me handle some of the younger Magic Beasts. At the very most, I can only roam around its edge. Isn’t it impossible to cut through the mountain range?”</p><br/><p>“Only by being in a dangerous place can one’s talent truly erupt.” Yao Lao said indifferently, “I plan to help you advance to a Dou Shi within the Magic Beast Mountain Range.”</p><br/><p>“Uh… Then I have to stay in the Magic Beast Mountain Range throughout my training period?” Hearing the proclamation, Xiao Yan’s face immediately turned bitter.</p><br/><p>“I estimate that it will take a year. For Tthe remaining half a year, you need to to go and train in the Tagger Desert.”</p><br/><p>“Tagger Desert?” Xiao Yan shook his head as he muttered to himself. Forget it. In any case, he had Yao Lao by his side to protect him. His teacher would not actually let him be eaten by a Magic Beast... right?</p><br/><p>Rubbing his palm against his chin, Xiao Yan licked his lips and asked with a smile, “Teacher… what about the Di Tier Dou Technique?”</p><br/><p>“You little rascal. Don’t you feel irritated bringing it up a couple of times everyday?”</p><br/><p>Listening to Xiao Yan repeating the same question, Yao Lao felt something between a smile and tears. He helplessly shook his head and became silent. Finally, he said: “After going into the Magic Beast Mountain Range, I will teach you the Di Tier Dou Technique. There are far too many eyes outside. If someone were to accidentally see it, there might be some trouble.</p><br/><p>Hearing that it would be delayed by another few days. Xiao Yan despondently nodded his head.</p><br/><p>“Look at your good for nothing manners. Don’t you understand the meaning of ‘Biting off more than you can chew’? Your ‘Vacuum Hand’ and ‘Fire Palm’ have indeed been trained till they have reached perfection but your ‘Octane Blast’ has barely even scratched the surface.” Seeing the despondent Xiao Yan, Yao Lao could not help but reprove him.</p><br/><p>“Just scratching the surface? How can that be? The last time against Jia Lie Ao, I used ‘Octane Blast’ and broke his arm.” Hearing Yao Lao’s reprimand, Xiao Yan muttered with dissatisfaction.</p><br/><p>“Ha ha, correct. You may have broken his arm, however did not your leg become totally numb in the process? If was not for you catching Jia Lie Ao off guard, at best your fight would’ve ended in a draww.”</p><br/><p>Yao Lao said with a laugh, “The attack power of ‘Octane Blast’ is sufficient to be compared to that of a Low Di Dou Technique. If it is trained properly, it is not difficult for your actual fighting strength to exceed someone who is stronger than you by two to three stars. But in your hands, it nearly caused a situation where both parties being injured despite your opponent being same star as you.”</p><br/><p>Xiao Yan became mute. He tightly pressed his eyebrows together and became deep in thought. In his mind, he suddenly recalled the introduction to the ‘Octane Blast’ from the time when Yao Lao had transferred the Dou Techniqueto him.</p><br/><p>“Octane Blast: High Xuan Tier Dou Technique is a close-combat Dou Technique that focuses on having a great number attacks. When mastered, its blast is composed of eight pulses that join together with an attack power equal to that of a Low Di Dou Technique!</p><br/><p>“The eight different forces must be progressively accumulated during training. How many forces have you actually mastered? Ha ha. it seems that other than the force on the surface, there is not the slightest hidden force, right?” Yao Lao said blankly, “If you can secretly add a hidden force on top of the surface one, you would have been able to catch Jia Lie Ao by surprise in your battle with him back then and would not have had such a difficult time.”</p><br/><p>“How do you train the hidden force?” His face gradually became imposing as Xiao Yan finally realized this crucial problem that he had neglected.</p><br/><p>“When you used the ‘Octane Blast’ in the past, you had simply viciously struck out in one go, without the slightest technique. I have never brought this up before for two reasons. One is that your strength was still too weak. The other reason is that you never discovered this.”</p><br/><p>Xiao Yan scratched his head embarrassingly. He had never really considered the hidden force problem. This was because with just the surface strength, ‘Octane Blast’ had an incredibly strong explosive force that was extremely satisfactory to him.</p><br/><p>“Close your eyes and reach deep into your spirit.” Yao Lao ordered quietly, causing Xiao Yan to quickly cross his legs and adopt the training posture.</p><br/><p>Beside the bonfire, the young man slowly closed his eyes and the surroundings once again became quiet. There was only the soft crackling sound of the firewood and the low ringing sound of the insects.</p><br/><p>After the silence had continued for a long time, Xiao Yan, who had closed his eyes, suddenly opened them. He frowned slightly as he deliberated the exchange he had with Yao Lao in his heart.</p><br/><p>After a long silence, Xiao Yan slowly relaxed his eyebrows. He slightly nodded and tightened his fist, where a pale yellow Dou Qi gathered. A brief stillness later, his fist smashed heavily onto a huge tree trunk as he cried softly.</p><br/><p>“Octane Blast!”</p><br/><p>“Bang!”</p><br/><p>A thud sound followed. On the spot where his fist had smashed into, a small hole was created along with a few crack lines spreading out from it.</p><br/><p>“Bang!”</p><br/><p>Not long after the previous noise died out, another lower muffled boom sounded from within the tree trunk.</p><br/><p>“Ka…” The force that accompanied the second muffled sound was directly transferred deep into the tree trunk. A moment later, it suddenly exploded from within. The huge tree trunk, upon being damaged by this hidden force, became shaky, seemingly about to fall.</p><br/><p>“What… What a strong hidden force.”</p><br/><p>Watching the seemingly multiplied destructive force, Xiao Yan became totally stunned. Although this hidden force consumed a third of his Dou Qi, its effect was obviously much greater than the consumed Dou Qi.</p><br/><p>“An ‘Octane Blast’ with the hidden force is truly worthy of being described as being a match for a Di Tier technique.” Xiao Yan sighed with shock as he slowly withdrew his fist.</p><br/><p>“Not bad, being able to release the hidden force on your first try. However, it is obviously not smooth and it took too long for the hidden force to explode. During this time, if your opponent has keen senses, he would be able to eliminate this hidden force before it explodes.” Yao Lao sung a praise before speaking in a manner that suggested that there were small imperfections.</p><br/><p>“Ha ha, it’s alright. This is only the first time. As long as I have more practice, I believe I will be able to control the time when the hidden force explodes.” Xiao Yan quickly threw a few fast punches. His success with the hidden force today had increased Xiao Yan’s combat ability significantly; at the same time, it gave Xiao Yan confidence and joy.</p><br/><p>Nodding his head, Yao Lao hesitated for a moment before saying, “Although ’Flame Mantra’ does have the strange ability of evolving, this Qi Method’s starting level is far too low. The Dou Qi within your body could only provide enough support for you to use the hidden force a few times. If you were to fight with others in the future, you must kill within one strike. This ‘Octane Blast’ is meant to be a swift thunder-like killing Dou Technique.”</p><br/><p>“Ah.” Xiao Yan nodded seriously. He clearly understood his weakness, which was having low stamina or Dou Qi. Should he be unable to defeat his opponent before his Dou Qi was exhausted, the one who would lose would be him.</p><br/><p>“It looks like I need to think of ways to speed up your Dou Qi training. Once we enter the Magic Beast Mountain Range, I will guide you to search for some rare medicinal plants that are needed for refining medicine. At this time, you require medicinal help on top of relying on your talent.” Yao Lao said deeply.</p><br/><p>Xiao Yan smiled. He abruptly raised his eyebrows and said, “That Nalan Yanran might also be using this method of training.”</p><br/><p>“Ha, so what? In all of the Jia Ma Empire, that Gu He’s alchemy skills are considered the best. However, in my eyes, he’s nothing. Competing with me in alchemy skills? In this entire Dou Qi continent, you cannot even find five who can!” Yao Lao said blandly; the bland voice hid an arrogance and disdain.</p><br/><p>Xiao Yan rubbed his nose, feeling slightly curious about Yao Lao’s background.</p><br/><p>“Oh right. Carry this thing. From now on, you are not allowed to put it down, even when you sleep.”</p><br/><p>Yao Lao was silent for a moment before a huge black item suddenly shot out from the old ring and crushed heavily onto the ground, sweeping up a pile of dust.</p><br/><p>“Uh…” Xiao Yan blankly stared at the pitch black item that was as tall as him. Cold perspiration appeared on his forehead as he swallowed his saliva and said, “This...what is this for?”</p><br/><p>“This is made of a black meteoric metal and is likely the only one in the entire continent. Not only is it very tough to break, it is also extremely heavy. Most importantly, it has a strange effect of suppressing one’s Dou Qi. If you can get used to being under its suppression, when you remove it in future battles, your strength after removing it will shock everyone.” Yao Lao said with a smile as he gave a belated explanation.</p><br/><p>“And the Di Tier Dou Technique I will be teaching you in the future is related to this.”</p><br/>\n</div>"}