{"title": "Chapter 103: First Fight with a Da Dou Shi", "id": 103, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-103-first-fight-with-a-da-dou-shi", "volume_title": "Volume 2", "body": "<h1>Chapter 103: First Fight with a Da Dou Shi</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 103: First Fight with a Da Dou Shi</u></strong></p><br/><p>Listening to Xiao Yan agreeing with Teacher Ruo Lin’s condition, everyone threw him a “respectful” gaze.</p><br/><p>Although Xiao Yan was extremely gifted, the huge gap between him and Teacher Ruo Lin was very difficult to overcome. The difference between a Dou Zhe and Da Dou Shi was not something that one could make up through one’s talent.</p><br/><p>Xiao Yu was also stunned by Xiao Yan’s response. A moment later, she helplessly sighed. It seemed that this guy would not turn back until he hit a wall.</p><br/><p>“This place is a little small. Let’s go outside.”</p><br/><p>Smiling at Xiao Yan, Teacher Ruo Lin led them out of the tent. In the blink of an eye, her voluminous and exquisite figure released a mature and attractive loveliness.</p><br/><p>Xiao Yan rubbed his nose, nodded and followed. After a brief hesitation, everyone in the tent also came rushing out.</p><br/><p>The sun was already setting. Its last pale red light covered the plaza with a layer of red carpet. The rocks and ground were also beginning to cool after being baked under the sun for an entire day. Standing in the middle of the plaza, one could occasionally catch a glimpse of the much smaller crowd outside.</p><br/><p>A fresh and cool wind blew across the middle of the plaza, providing comfort to Xiao Yu and the others who had just exited the tent.</p><br/><p>Under the gaze of numerous people, Xiao Yan walked to the middle of the field and stood with a smile opposite of Teacher Ruo Lin. In a dry voice he said, “I hope that Teacher will be merciful.”</p><br/><p>Hearing this, the corner of Teacher Ruo Lin’s mouth curled into a gentle smile. She slowly raised her empty white hand. The green storage ring on her finger flashed and a long blue whip appeared.</p><br/><p>The entire length of the long whip was dark blue. On top of it there was a rich amount of energy oscillating. At the grip of the long whip, was a carefully sculpted serpent’s mouth with a deeply embedded magical stone that was as big as a baby’s fist. Along the long whip were inscriptions of Dou Qi symbols that emitted a faint glow.</p><br/><p>Just by looking at the molding of the long whip, anyone would know that the item in Teacher Ruo Lin’s hand was a magic core weapon that had been meticulously made. Eying the gentle aura of the weapon, it was obvious that the weapon’s attribute was similar to that of Teacher Ruo Lin. By using this weapon to fight, the latter’s strength would be boosted by at least one or two levels.</p><br/><p>TL: Magic Cores are the cores of Magic Beasts</p><br/><p>Faced with Xiao Yan’s dry smile , Teacher Ruo Lin directly used her actions to prove: There was no chance that you will get a one year leave from me.</p><br/><p>Watching the beautiful lady with the long whip and standing prettily before him, Xiao Yan pulled at the corner of his mouth and shook his head.</p><br/><p>“Hey, just choose a weapon to use.”</p><br/><p>Waving her hand, Teacher Ruo Lin withdrew a steel sword from within her storage ring. Her finger lightly flicked, turning the sword into a black shadow which quickly flew toward Xiao Yan.</p><br/><p>Xiao Yan did not move as he eyed the metal sword flying toward him at a frightening speed, allowing it to sweep towards him with great strength.</p><br/><p>When the metal sword was about half a meter from Xiao Yan, it suddenly stopped and dropped, inserting itself into the gap of a black rock.</p><br/><p>Shrugging his shoulders, Xiao Yan extracted the metal sword and slashed it about without any order. He had never learnt any Sword Dou Techniques, so he was quite unfamiliar with a sword.</p><br/><p>Xiao Yan’s calmness caused Teacher Ruo Lin to raise her dark eyebrow. Her beautiful eyes were full of praise. With this kind of mental strength at such a young age and adding his natural talent, Teacher Ruo Lin had a premonition that this person was likely to become very very strong...</p><br/><p>“Shall we start?”</p><br/><p>Teacher Ruo Lin’s long whip struck the ground in front of Xiao Yan. The water energy within it immediately left droplets of water on the rock floor. She slowly raised her head and asked with a smile.</p><br/><p>“Um.”</p><br/><p>Xiao Yan slowly nodded his head, his face becoming more serious. This was the first battle with a Da Dou Shi. Although he had Yao Lao’s secret help, directly confronting such a strong person was giving Xiao Yan quite a bit of pressure.</p><br/><p>Watching the stage where the fight was about to take place, Xiao Yu could not help but tighten her hand in anxiety. The worry on her face was difficult to hide.</p><br/><p>“Ha, what a presumptuous person. Daring to fight with the Teacher Ruo Lin, a five star Da Dou Shi by relying on his little talent, what an arrogant person.” Eyeing Xiao Yu’s worried manner, Luo Bu, who had originally restrained himself after witnessing Xiao Yan’s talent, was overcome by jealousy and once again ridiculed him.</p><br/><p>“What did you say?” Hearing those words, the formerly worried Xiao Yu promptly straightened her eyebrows, angrily turned around and demanding.</p><br/><p>“I’m only speaking the truth.”</p><br/><p>The anger that Xiao Yu displayed had little effect other than increasing Luo Bu’s jealousy.</p><br/><p>“What right do you have to criticise him? Do you even dare to fight with a Da Dou Shi? All you know how to do is to show that hypocritical smile of yours. But when you meet something troublesome, you are the first to hide. I feel most disgusted by this kind of two-faced man. Even if I die, I will never like you.”</p><br/><p>Xiao Yu’s face was utterly cold as she spoke chillingly. Her merciless and disdainful words caused those around them to be stunned. Having known her for so long, they had never seen her speak in such a manner.</p><br/><p>Luo Bu’s face alternated between black and white for a moment before he shifted his twitching eyes away and stared at the young man on the battlefield. An obscured poisonous hatred flashed in his eyes.</p><br/><p>The sarcasm and cold voice outside the battlefield did not affect the intense atmosphere within. Xiao Yan was intently staring at Teacher Ruo Lin, his body repeatedly shuddered slightly. He knew that an attack by a Da Dou Shi would far exceed the speed, strength and experience that his usual opponents’ had. Hence, he could only focus all his attention and stare at every single minute movement of the other party and attempt to predict her next attack.</p><br/><p>Briefly glancing at the readiness Xiao Yan displayed, Teacher Ruo Lin gave a brief smile and waved her hand. Like a snake leaving its hole, the long whip left a faint blue line in the air before striking straight down onto Xiao Yan.</p><br/><p>As the long whip passed through midair, moisture was added to the cool air.</p><br/><p>Seeing the long whip which had crossed a distance of over ten meters, Xiao Yan’s eyes narrowed and he slowly let out a breath. Just as it was about to hit head, he suddenly shifted his body slightly to the left.</p><br/><p>The long whip along with its breaking wind, came lashing down along the side of Xiao Yan’s clothes and finally landing heavily on the rock ground. a huge water stain quickly appeared on the ground.</p><br/><p>After dodging Teacher Ruo Lin’s attack, Xiao Yan’s face appeared imposing as he stepped heavily off the ground. He compressed his body, then shot toward Teacher Ruo Lin like an arrow that had left a bow.</p><br/><p>The short ten meters was a distance that could be covered in the blink of an eye. As Xiao Yan was about to enter his attacking distance, however, a great force came charging from his back.</p><br/><p>Xiao Yan’s face changed and he suddenly threw himself flat on the ground. A blue colored shadow glided closely to the back of his head before continuing on horizontally.</p><br/><p>With his body prone on the ground, Xiao Yan struck his hand fiercely on the ground. A strong yellow shapeless force heavily hit the ground. Immediately, the counterforce pushed Xiao Yan’s body into the air.</p><br/><p>In midair, Xiao Yan rapidly rotated his body. The metal sword in his hand borrowed the momentum from his rotation and, after thrown, shot toward Teacher Ruo Lin.</p><br/><p>The metal sword lacerated the air. Its black figure carried a sharp strength much like lighting.</p><br/><p>Staring indifferently at the metal sword penetrating through the wind, Teacher Ruo Lin lightly flicked her hand. The long blue whip she held returned towards her and mystically entangled itself in the air to form a blue wall.</p><br/><p>“Ding!” As the metal sword and the blue wall came into contact, a clear clashing sound was immediately released. The great shock from the contact broke the sword into numerous pieces.</p><br/><p>Watching the sword that had broken into more than ten pieces, Teacher Ruo Lin raised her moist red small mouth and was about to launch her attack when her face changed.</p><br/><p>The ten plus broken pieces, in midair, were suddenly picked up by a shapeless force and flew toward where Xiao Yan was.</p><br/><p>The small metal pieces pierced through the air and swept toward Xiao Yan. The sharp breaking wind was much stronger than the metal sword that was swung and thrown earlier.</p><br/><p>After the ten plus metal pieces flew half the journey, a ferocious pushing force suddenly erupted from Xiao Yan’s palm. At Xiao Yan’s strike, even the dirt on the ground was scattered throughout the air.</p><br/><p>“Xiu xiu xiu!”</p><br/><p>The ferocious pushing force easily overcame the energy of the small metal pieces. After which, these ten plus metal pieces suddenly changed direction. With much more aggressive speed and strength, they headed towards Teacher Ruo Lin like bolts of lightning.</p><br/><p>“This little boy certainly has some ability.” Seeing how Xiao Yan could use just the strength of a Dou Zhe to attract and repel objects over space, an act that required the strength of a Da Dou Shi, Teacher Ruo Lin let out a surprised praise. Her empty hand swiftly formed a palm in front of her. The Dou Qi in her followed fixed Qi paths and started revolving rapidly.</p><br/><p>“Weakening Water Mirror!”</p><br/><p>Following Teacher Ruo Lin’s voice, a huge piece of pale blue Dou Qi spewed out from her palm, forming a round blue water mirror in front of her.</p><br/><p>“Weakening Water Mirror” was a defensive Dou Skill that could only be mastered by those who practiced water type Dou Qi. It was not a very high level skill, only High Huang. However it was very practical. In the Dou Qi continent, many strong people who were well versed in water type Dou Qi could use their strong Dou Qi to create this strange water mirror that had the ability to reduce the strength of an attack.</p><br/><p>The water mirror which was over half a meter thick, emitted both blue and red lights under the setting sun.</p><br/><p>“Puff, puff…” The ten plus metal pieces that were piercing through the wind made contact with the water mirror and instantly penetrated it. However, after entering the mirror’s interior, each piece's strength was eliminated by the torrent of water.</p><br/><p>“Dang…” Having lost the force behind it, the pieces of metal weakly fell onto the stone floor with a desperate clang as they left the water mirror.</p><br/>\n</div>"}