{"title": "Chapter 109: Blood Lotus Essence", "id": 109, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-109-blood-lotus-essence", "volume_title": "Volume 2", "body": "<h1>Chapter 109: Blood Lotus Essence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 109: Blood Lotus Essence</u></strong></p><br/><p>The scorching sun blazed as the high temperature caused the surface of the ground to crack open. When the sole stepped on the hard soil, a sudden heatwave would rush into the sole, causing travellers to drip with sweat while cursing at the awful weather.</p><br/><p>On the wide yellow road, a youngster dressed in common clothes was sweating heavily as he struggled to walk. Every step the youngster made smashed heavily into the ground as if it was not a foot but a ton of weight, splashing forth a cloud of yellow dust.</p><br/><p>If one were to take a closer look, one would be surprised to see that the youngster carried a humongous black broadsword on his back. Rather than saying it was a broadsword with no edge or a sharp tip, it might as well be called a giant metal ruler. At the top, it was as if it had been cut in half by a knife, revealing a horizontal smooth mirror like surface.</p><br/><p>On the surface of the pitch-black broadsword, there were fuzzy and bizarre veined patterns. The veined patterns continued until the hilt, nearly pervading every inch of the sword. These patterns gave the ruler a special mysteriousness that overwhelmed its simple pitch-black color.</p><br/><p>The length of the monstrous broadsword almost exceeded the youngster’s height. This bizarre combination caused the occasional travellers to cast looks of curiosity towards him.</p><br/><p>Having once again travelled a few hundred meters, the youngster finally could not take it anymore. Like a windmill, his mouth continuously gasped for air as he dragged his feet which felt like they weighed a thousand pounds towards the shade of a big tree by the roadside.</p><br/><p>As the youngster reached the bottom of the tree, he immediately collapsed, face toward the sky. With his head planted on the cooling grass, the sweat on his forehead flowed downward like a small stream.</p><br/><p>“Teacher, this thing…… it’s too terrifying. After carrying it on my back….. the Dou Qi circulating within my body became slow and sluggish. Furthermore, isn’t this god forsaken thing way too heavy? What should have been a one day journey has already become two days, moreover we have yet to reach our destination!” Xiao Yan heavily gasped as he spit out these words, his voice was already somewhat hoarse from the over exertion.</p><br/><p>“Hei hei. The training has already formally started, you couldn’t have expected that it was as simple as roaming about right? Since it is called tough training, you should prepare to enjoy the most hellish treatment. The cozy life in Wu Tan City is already far from your reach.” Within the ring, the sadistic and aged laughter of Yao Lao could be heard.</p><br/><p>Hearing these words, Xiao Yan smiled bitterly and shook his head, slightly leaning to one side. From the corner of his eye, he looked at the bladeless black broadsword on his back with horror.</p><br/><p>He did not expect that this ordinary looking object would be so frightening. Not only did it turn the rapid Dou Qi within his body sluggish, it was also disgustingly heavy such that Xiao Yan almost broke his back while using all his strength to make his Dou Qi flow.</p><br/><p>During these two days, Xiao Yan finally tasted the true meaning of weariness.</p><br/><p>When Xiao Yan carried this weird black broadsword on his back, his fighting strength was comparable to that of a newly advanced Dou Zhe. Although the black broadsword constrained him greatly, this constraining effect helped to ease Xiao Yan’s worries of letting his true strength be found out by others. As he was just a lone traveller journeying through unfamiliar places, it would be foolish of him to so easily reveal his true strength to others.</p><br/><p>Lightly rubbing the Storage Ring on his finger, a light green pill appeared in the palm of his hand. This was a pretty effective Qi Recovering Pill which was able to increase one’s Dou Qi recovery rate over a short period of time.</p><br/><p>The pill was specially refined by Yao Lao for Xiao Yan in the days before they left Wu Tan City. But the ingredients needed for this Qi Recovery Pill were extremely rare, even with the influence of Primer Auction House, only enough ingredients for thirty pills were collected. Thus, normally Xiao Yan did not dare to use it freely, however the current situation did not allow him the luxury to be frugal.</p><br/><p>Cautiously sweeping his gaze over the nearby road, Xiao Yan made sure that no one was around before swallowing the pill in his mouth with one gulp. He leaned against the tree as he unhurriedly waited for the pill to take effect.</p><br/><p>Although it is said that it is best to enter the training state to bring out the highest effect from the pill after consuming it, in his current situation, Xiao Yan clearly was not in the best environment to train. The crowds that continuously passed by on the road would break his thoughts from entering into a training state.</p><br/><p>Slowly closing his eyes, the extremely fatigued Xiao Yan was able to distinctly feel his battered muscles greedily absorb the meek essence emitted from the pill.</p><br/><p>When the last drop of essence had been absorbed, Xiao Yan felt as if the cells of his muscles were invigorated with power and faintly stronger than before…...</p><br/><p>Although the tough training had only started a mere two days ago, Xiao Yan had absolute confidence in defeating a six star Dou Zhe if he were to remove the heavy sword from his back!</p><br/><p>“It seems like there is some effect?” Xiao Yan muttered to himself as he used his hand to touch his face. The corners of his mouth abruptly broke into a grin as he lazily extended an arm, feeling full of vigor, it was as if he was remade anew from the inside out.</p><br/><p>Propping his body up from the ground, Xiao Yan patted the burdensome and strange huge-sword with mixed feelings of love and hate before once again taking a heavy step to continue his journey to the now near destination.</p><br/><p>Before the sky gradually darkened, Xiao Yan finally arrived at a small town which was the close to the Magic Beast Mountain Range.</p><br/><p>The small town was known as Qingshan Town, but because it was close to the Magic Beast Mountain Range, it was also known as Magic Beast Town. The majority of the people within this small town were naturally the mercenaries who spent their days feeding their blades with blood. These mercenaries would form troupes that walked hand in hand on the streets, splattering their spittle about while brazenly discussing about the women in the town, where to find the strongest liquor and which area had the most fierce Magic Beasts…...</p><br/><p>As Xiao Yan walked on the street which was made of limestone while carrying the huge sword that looked out of place on his back, curious gazes were naturally attracted to him. However he ignored the gazes as he wiped off the sweat on his forehead while slowly following the path along the street.</p><br/><p>Many stores dotted both sides of the street and with their favorable location, they could be said to be rather popular. Xiao Yan swept an interested gaze across the brightly lit stores before finally stopping at a rather spacious medicine ingredient store. He paused his step, muttering to himself before once again moving to enter the medicine ingredient store called “Thousand Medicine Place.”</p><br/><p>Xiao Yan did not have much interest in things like weapons or armor but he had a huge interest in the various treasured medicine ingredients. As long as he could find a precious medicine ingredient, Yao Lao would be able to refine it into various power boosting pills. Pills were the most practical for survival while travelling in the extremely dangerous Magic Beast Mountain Range.</p><br/><p>Walking into the spacious store, Xiao Yan realized that it was brightly lit by Moonlight Stones hanging on the walls. Currently, there was a rather high volume of traffic in the store, causing the shop assistants to be extremely busy. Thus, there was no one to welcome Xiao Yan when he entered.</p><br/><p>Even though no one welcomed him, Xiao Yan was quietly happy. His gaze slowly swept across the transparent display counters until arriving on a small jade case, slightly dazed at what he found.</p><br/><p>“Healing Medication? Could there be an alchemist here?” Xiao Yan muttered in astonishment as he stared blankly at the written description under the small jade bottle.</p><br/><p>Shaking his head, Xiao Yan’s gaze continued to move on but when he had seen all of the things in the display counters, he disappointedly shook his head. Although there were some middle-grade medicine ingredients, they were not much use to Xiao Yan now.</p><br/><p>Just as Xiao Yan prepared to leave empty handed, his randomly wandering gaze suddenly stopped.</p><br/><p>Xiao Yan’s gaze pierced through the transparent display case to unwaveringly stare at a light yellow object in a corner. A long time passed before he licked his lips and nonchalantly walked towards the object, tilting his head to once again size up the light yellow object.</p><br/><p>“Cough…… Could I trouble you to help me take out this object.”</p><br/><p>Little by little withdrawing his greedy and excited gaze, Xiao Yan lifted his head towards a male shop assistant and said with a smile.</p><br/><p>Having been called, the young shop assistant cast a glance towards the plainly dressed Xiao Yan before glancing at the item he requested for. After discovering that it was the most lowly graded Yellow Lotus Essence, the young shop assistant curled his lip with impatience. With a rigid face, he retrieved the item from the display case, “Yellow Lotus Essence, low level medicine ingredient, one hundred gold.”</p><br/><p>Not caring about the shop assistant’s discriminating attitude, Xiao Yan sneered in his heart. He received what was thought to be the most lowly graded Yellow Lotus Essence and stealthily drew his fingernail gently across the surface of the ‘Yellow Lotus Essence’. A tiny bit of dark blood red color was revealed from the somewhat yellow surface. As he gazed at the virtually hidden dark red color, the corners of Xiao Yan’s eyes slightly twitched. Shortly after, trying not to reveal his intentions, he rubbed his nose while deeply inhaling the bizarre scent of blood on his finger. Immediately, an extraordinary splendor jumped up in the depths of his eyes.</p><br/><p>“Sure enough, it is a Blood Lotus Essence!”</p><br/><p>As Xiao Yan’s heart beat rapidly in excitement, Yao Lao’s slightly astonished voice suddenly resounded in Xiao Yan’s thoughts.</p><br/><p>“Little brat, your luck is not bad, you actually managed to find such a rare medicinal herb!”</p><br/>\n</div>"}