{"title": "Chapter 113: Cave", "id": 113, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-113-cave", "volume_title": "Volume 2", "body": "<h1>Chapter 113: Cave</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 113: Cave</u></strong></p><br/><p>Staring at the pretty face that had abruptly appeared from the bottom of the cliff, Xiao Yan was shocked. However, he managed to quickly recover and upon a closer look realised that the lady was the Fairy Doctor from the medicinal herb gathering team.</p><br/><p>On the cliff, the two gazes continued to stare at each other. presenting a strange scene.</p><br/><p>“Can… can you pull me up?”</p><br/><p>After staring at each other for a moment, the Fairy Doctor was first to break the awkward atmosphere with her somewhat gentle voice.</p><br/><p>Xiao Yan blinked his eyes and nodded as though nothing had happened. He grabbed the small hand that the Fairy Doctor had extended and with a little strength, pulled her from below the cliff. Her fragile body presented a beautiful curve in midair as she lightly leaped onto the cliff’s edge.</p><br/><p>“Thank you.”</p><br/><p>Once her feet landed on the ground, the Fairy Doctor whispered her thanks as she swiftly released Xiao Yan’s hand. She covertly glanced at the edge of the cliff as her fine fingers touched the black hair on her forehead. Her gaze then swept over Xiao Yan as she said softly, “You...you are one of the mercenaries hired by the ‘Thousand Medicine House’, aren’t you?”</p><br/><p>“Yes.” Xiao Yan briefly relished the softness that was in his hands before nodding his head with a smile. After which, he shifted his gaze toward the endless green mountain that laid beyond the cliff. Although this lady was not extremely beautiful, her gentle and soft demeanor was more than sufficient to sway one’s heart. Had this encounter been at a different time, Xiao Yan would have teased her. However, he did not have such an interest during his intense training session.</p><br/><p>After hearing Xiao Yan’s answer and seeing that he had no intention of leaving, the Fairy Doctor pressed her eyebrows together and allowed her eyes to roam. Finally, she pointed at the white colored plant by the cliff and asked with a smile, “It seems that you had intended to pick this medicinal grass, do you know what it is?”</p><br/><p>Hearing this, Xiao Yan rubbed his nose and smiled, “This should be White Orchard Fruit. A middle-grade medicinal herb which usually only grows by the edge of a cliff. There are quite a lot of them. Unfortunately, they are the favorite food of a bird type Mystical Beast so they would usually be eaten once they grow and can be considered as one of the rarer ingredients among the middle-grade medicinal plants. If this matured White Orchard Fruit were to be sold at a medicinal shop, it should be worth around four thousand gold coins.”</p><br/><p>Seeing how the young man was able to reveal so much about the White Orchid Flower before him, a glint appeared in the Fairy Doctor’s eyes. In a surprised voice, she said, “Have you learned how to differentiate the different medicinal plants?”</p><br/><p>“I have touched the surface.” Xiao Yan said vaguely as he shrugged his shoulders.</p><br/><p>After being with Yao Lao for such a long time, Xiao Yan had not only learned how to refine medicine but to differentiate the different types of medicinal ingredients too. With Yao Lao’s experience, he had seen all kinds of rare medicinal plants and as his disciple, Yao Lao had naturally imparted all this knowledge to him.</p><br/><p>“It can be said that the White Orchard Fruit is fair game for anyone who found it but since you were the first to find it, I shall not snatch it from you.” After giving Xiao Yan a smile, the Fairy Doctor crouched down and carefully picked the crimson fruit from the bunch of flowers before handing it over to Xiao Yan.</p><br/><p>Seeing the Fairy Doctor’s action, Xiao Yan touched his head and nodded indifferently. The White Orchard Fruit may be something rare and precious to others but it was something that Xiao Yan could do without. However, since the Fairy Doctor did not want it, it did not hurt to keep it.</p><br/><p>“Alright. The group is probably well rested by now. Let us hurry back.” After seeing Xiao Yan accept the White Orchard Fruit, the Fairy Doctor hurriedly said with a suspicious happiness.</p><br/><p>Holding the cold White Orchid Flower in his hand, Xiao Yan observed the impatience of the Fairy Doctor and frowned. His eyes narrowed as he felt that the Fairy Doctor now… appeared a little out of the ordinary.</p><br/><p>“Why is she rushing to leave?”</p><br/><p>A suspicion flashed across his heart as Xiao Yan placed the White Orchard Fruit into his breast pocket. Acting as though nothing was amiss, Xiao Yan randomly asked, “Why did you go beyond the cliff?”</p><br/><p>Once Xiao Yan’s question left his mouth, the Fairy Doctor suddenly froze. A panicked expression appeared on her face for a fraction of second before being quickly hidden.</p><br/><p>“Nothing, some medicinal plants grow on the cliff wall so I was just going down to take a look.”</p><br/><p>“Oh…” Xiao Yan nodded his head. With this reason the Fairy Doctor had removed some of the suspicion in him. After all, there were indeed some medicinal plants that grew along the cliff wall.</p><br/><p>“No, there seems to be something below the cliff…”</p><br/><p>Just as Xiao Yan was about to turn around, Yao Lao’s voice suddenly appeared in his heart.</p><br/><p>With narrowed eyes, Xiao Yan involuntarily stepped forward. The precipitous cliff wall entered his sight.</p><br/><p>On the cliff wall, there was only broken rocks, strange branches that were randomly growing and some bone like object.</p><br/><p>Xiao Yan’s eyes slowly swept across the cliff wall. A moment later, he paused at a spot that was covered by the distorted branches that grew from it.</p><br/><p>The strange wooden branches that were on the cliff wall were arranged in a clever manner but with Yao Lao’s reminder, Xiao Yan realized that something was amiss.</p><br/><p>With the help of the sunlight, Xiao Yan’s narrowed eyes could barely make out a pitch black empty hole under the cover of the branches...</p><br/><p>“There is indeed something amiss…” Watching that particular spot on the cliff wall, Xiao Yan whispered in his heart. Suddenly, Xiao Yan’s face changed. His feet staggered as his body retreated. He yelled, “What are you doing?”</p><br/><p>As Xiao Yan stepped backwards, white powder was suddenly scattered all over and quickly covered the retreating Xiao Yan,</p><br/><p>The white powder surrounded Xiao Yan for a long while before it was slowly scattered by the wind, revealing an unconscious Xiao Yan on the ground.</p><br/><p>Eyeing the unconscious Xiao Yan, the Fairy Doctor dusted the powder from her hands. She bit her lips and sighed, “I told you to leave but you didn’t listen to me. Now you know.”</p><br/><p>Shaking her head, the Fairy Doctor slowly walked towards the fainted Xiao Yan and lowered her body. She took out a rope, grabbed Xiao Yan’s hand and prepared to restrain it.</p><br/><p>Just as the Fairy Doctor was about to withstrain Xiao Yan, something unexpected occurred.</p><br/><p>Xiao Yan, who was supposed to be unconscious, suddenly opened his eyes and rotated his palms. Catching the Fairy Doctor off guard, Xiao Yan reached out and grabbed her.</p><br/><p>“I didn’t expect that you would actually be using such things. If it was not for my preparation, I would really have been drugged by you.”</p><br/><p>The sudden change shocked her but it did not slow the Fairy Doctor’s reaction. After her hand was captured by Xiao Yan, she threw a violent kick at him.</p><br/><p>Seeing that the Fairy Doctor relentless, Xiao Yan let out a cold laugh. Mirroring her, he kicked out his right leg and heavily knocked the Fairy Doctor’s small feet aside. Immediately, pain filled her gentle pretty face</p><br/><p>Despite succeeding in one strike, Xiao Yan did not stop. Like a ribbon, his left leg held down both of the Fairy Doctor’s legs. Following that, both of them fell onto the ground, with Xiao Yan pressing down tightly on the Fairy Doctor.</p><br/><p>The softness from beneath him caused Xiao Yan’s head to tremble. Secretly, he let out a pleased cry. Lowering his head, he stared at the red faced Fairy Doctor and raised his lips as he shook his lower body like a hooligan. Immediately, the two bodies became closer to each other.</p><br/><p>“Let me go!” The male scent above her caused the Fairy Doctor to feel a little giddy as she clenched her teeth and seethed.</p><br/><p>“Why did you attack me?”</p><br/><p>Her moist red lips trembled as the Fairy Doctor coldly smiled, “Because I dislike you.”</p><br/><p>“Do you believe that I would take you here and now?” Lowering his head such that they could almost feel each other’s breathing, Xiao Yan coldly smiled.</p><br/><p>“If you have the confidence to handle the hundred plus mercenaries outside, you can try!” the Fairy Doctor said.</p><br/><p>“The breasts aren’t full enough, the butt doesn’t stick out, I am not really interested.” Xiao Yan teasingly smiled before his face slowly turned colder. “What is below the cliff?”</p><br/><p>“I don’t know what you are talking about.” The Fairy Doctor’s face changed slightly as she pressed her eyebrows together and said, “Quickly let me go or else I will scream. If the others see you doing this to me, you can forget about walking out of this Magic Beast Mountain Range alive.”</p><br/><p>“Why don’t you shout? If you want to let more people know about the secret below, you can shout till your voice becomes hoarse.” Xiao Yan’s emotionless voice quickly caused the Fairy Doctor to give up on her intention to shout.</p><br/><p>“What do you plan to do?” The Fairy Doctor took in a deep breath and seethed.</p><br/><p>“What is there below? If you don’t answer me truthfully, I don’t mind tying you up and hiding you here before going down to take a look for myself.”</p><br/><p>“You…” Hearing Xiao Yan’s threat, the Fairy Doctor’s face appeared to panic. Although she was slightly older than Xiao Yan, her mental strength and shrewdness was nowhere near Xiao Yan’s.</p><br/><p>“I heard that there is an Magic Beast known as a Co-Ape in the Magic Beast Mountain Range. This kind of Magic Beast has an interest in human woman…” With the corner of his mouth rising teasingly, Xiao Yan lowered his head and with his lips touching the Fairy Doctor’s ears, he whispered into it.</p><br/><p>“You bastard!” The Fairy Doctor’s face turned white as she obviously suffered a great shock. She had also heard of this horrible Magic Beast’s name.</p><br/><p>“Let me up. I will tell you what is at the below.” Under Xiao Yan’s threat, this Fairy Doctor who could not hold out any longer, helplessly gave up.</p><br/><p>With a smile, Xiao Yan pushed himself up before helping the Fairy Doctor do the same. As a precaution, he forcefully held on to her wrist and ignored her embarrassed and angry expression.</p><br/><p>Both of them headed to the edge of the cliff and stared simultaneously at the strange spot on the cliff wall. A while later, the Fairy Doctor’s red lips slightly opened and somewhat unwillingly said, “That is a something that I have accidentally found when I was gathering medicinal herbs. Hidden behind the strange branches is a cave that is hard to notice.”</p><br/><p>“The cave should contain some things that some ancestor left behind. However, I have never entered it, so I am uncertain about its interior. However, from some of the clues that were left behind, the ancestor who left this should be very strong.”</p><br/>\n</div>"}