{"title": "Chapter 122: Di Class Dou Technique: Flame Splitting Tsunami", "id": 122, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-122-di-class-dou-technique-flame-splitting-tsunami", "volume_title": "Volume 2", "body": "<h1>Chapter 122: Di Class Dou Technique: Flame Splitting Tsunami</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 122: Di Class Dou Technique: Flame Splitting Tsunami</u></strong></p><br/><p>A couple of people were seated within the heavy atmosphere of the hall. Amongst them was the one who had many conflicts with Xiao Yan, Mu Li.</p><br/><p>On the leader’s seat in the hall sat a middle-aged man with a slightly gloomy face. His finger lightly tapped on the tabletop. Finally, he was the one who broke the silence in the room.</p><br/><p>“I’ve just received news that amongst the groups that we had sent out to search, a two-man team went missing within the middle part of the Magic Beast Mountain Range.” The slightly hoarse voice of the middle-aged man slowly sounded in the room.</p><br/><p>“Father. Could they have met with an attack by a Magic Beast?” Mu Li smiled carelessly as he replied. Being killed by a Magic Beast was very common in the Mystical Beast Mountain Range.</p><br/><p>Hearing Mu Li’s address, this middle-aged man could only be concluded to be the leader of the Wolf Head Mercenary Company, Mu She.</p><br/><p>“If they had met with a Magic Beast attack, there should have been some traces of such a fight. However.. the mercenaries that we sent to reinforce them found no traces of a fight after searching the region that the pair was in charge of. If we eliminate the possibility of them falling from a cliff, a mistake that only a novice mercenary would make, I think that they may have been attacked by another person. Those missing traces of battle may have been the doing of that person.” Mu She emotionlessly said as he shook his head.</p><br/><p>“Are you suspecting that this is the doing of Xiao Yan?” Upon hearing Mu She’s reasoning, Mu Li stilled. He quickly shook his head and said, “I’ve exchange blows with that guy. With his strength, to be able to kill two five star Dou Zhe before they even have the chance to raise a signal… it seems impossible.”</p><br/><p>“I don’t care if it’s him or not. Tomorrow, we will send more people to carefully search the place.” Mu She said in a deep voice. The inborn snake-like cautiousness in him did not allow the slightest chance to pass by him.</p><br/><p>TL: Joke on his name, She means snake</p><br/><p>“Ah, just as well,” Mu Li waved his hand and nodded his head indifferently.</p><br/><p>“Have you managed to open the stone box that you carried back from the cave?” After scanning his surroundings, Mu She suddenly asked.</p><br/><p>“The key to the stone box is in Xiao Yan’s hand. I’ve hired the best locksmith in the entire Qingshan Town but from the looks of it, we can’t expect much.” Mu Li said with a frown.</p><br/><p>“If we cannot open the lock, then we’ll try to use force to open the box. To be able to carelessly put aside over seven hundred thousand gold coins and some rare medicinal herbs, this ancient person was likely quite strong. The things that he left behind should also not be anything common.” Mu She tightened his fist as greed flashed across his eyes.</p><br/><p>“Yes.” Mu Li nodded his head and licked his lips. In a low voice, he asked: “Father, what do you intend to do about the Little Fairy Doctor?”</p><br/><p>“Do you know what she obtained from the cave?”</p><br/><p>Seeing Mu Li helplessly shaking his head, Mu She’s eyes narrowed. He waved his hands and said in a deep voice, “We will not touch her for now. Her reputation in Qingshan Town is too good. If we make any rash moves, we may arouse the displeasure of the independent mercenaries.”</p><br/><p>“Are we just going to allow her to peacefully stay at the ‘Thousand Medicinal House’?</p><br/><p>“Haha. It is naturally impossible for her to have any peaceful days. Tomorrow, get someone to spread a rumor. Just say that the Little Fairy Doctor had obtained a relic of some strong person and that this relic was most likely a Xuan Rank Qi Method.” Mu She laughed in a cold and evil manner, “That Little Fairy Doctor may be skilled in the art of healing but she’s too weak. Not everyone in this world is kind. There will always be some greedy people who would think of ways to obtain the relic from the Little Fairy Doctor… As for how to handle such people, we will let her have a headache over it.”</p><br/><p>“This is a good plan. If even the ‘Thousand Medicinal House’ becomes interested in this relic, then the Little Fairy Doctor would lose her safe haven. Haha, when that time comes, it would be exceedingly easy to catch her.” The corner of Mu Li’s lip curled upwards with pleasure as he laughed.</p><br/><p>Mu She nodded his head slightly as he lightly rubbed the a scar below his ear. He said flatly, “The Little Fairy Doctor is not much of a threat. What I’m really worried about is the boy whom you spoke of, Xiao Yan.” Stopping there, Mu She’s eyes showed a glint of resolve.</p><br/><p>“In order to be able to reach a two star Dou Zhe or higher at such a young age, his potential must be very strong… What really attracts my attention is that a boy younger than twenty did not show any arrogance someone his age should have and instead was able to hide his true strength so well. Had it not been for the life and death situation at the last minute, it was likely that no one would have guessed that he could push you back with just one strike.” As his voice died down, a cold killing intent surfaced on his face.</p><br/><p>“An enemy with such a potential must be killed before he has the chance to grow. Otherwise, we will not be able to afford it when he returns to seek revenge in the future!” Mu She’s finger pressed hard on the scar under his ear as he coldly spoke.</p><br/><p>Recalling how Xiao Yan managed to choose the perfect escape plan even when facing the dangerous predicament in the mountain cave, Mu Li’s finger trembled slightly. Having such an enemy was giving him sleepless nights.</p><br/><p>“Tomorrow, I will double the number of people in the search party. The monetary reward will be tripled. We must find that guy in the shortest amount of time!” Mu Li said in a thick voice as he clenched his fist.</p><br/><p>Seeing how the father and son were so alert even when dealing with a young man in his teens, the top brass of the Wolf Head Mercenary Company seated in the hall wanted to snort with contempt. However, on the surface, they respectfully accepted their orders.</p><br/><p>……</p><br/><p>The galloping waterfall heavily smashed on the rocks, emitting a muffled sound of thunder that reverberated throughout the small valley.</p><br/><p>Standing beside the lake under the waterfall, Xiao Yan stared at the ten huge wooden stakes under the pounding waterflow. His face could not help but turn bitter as he smiled at Yao Lao beside him, “Teacher, you don’t intend for me to go down and train, do you?”</p><br/><p>“Your answer is correct.” With a smile, Yao Lao said, “I’ve already told you before not to imagine a Di Rank Dou Technique as being the same as a Xuan Rank Dou Technique and that anyone can learn it. If you wish to learn something of this level, you need to achieve certain essential requirements.”</p><br/><p>“Hand me the Heavy Xuan Ruler.” Reaching out his hand,Yao Lao lifted the strange looking black-colored, heavy ruler from Xiao Yan’s back.</p><br/><p>The extremely heavy ruler on Xiao Yan’s back only caused Yao Lao’s hand to sink slightly upon receiving it. Yao Lao swung the large black ruler easily and asked with a smile, “Have you seen a real Di Rank Dou Technique? Do you want to see one?”</p><br/><p>Hearing this, Xiao Yan’s eyes abruptly brightened. He nodded his head like a chicken feeding on rice.</p><br/><p>With a faint smile, Yao Lao held the Heavy Xuan Ruler as his body slowly ascended into the air, stopping only when his body was above the middle of the lake.</p><br/><p>Yao Lao lowered his head and looked at the lake surface four or five meters below him before raising his head and watching the silver, dragon-like, gigantic waterfall.</p><br/><p>Yao Lao took in a slow breath and narrowed his eyes. A moment later, he suddenly opened them. Instantly, a unfamiliar and frightening force like a dragon being awoken was emitted from Yao Lao’s body.</p><br/><p>In the face of this force, the calm lake surface beneath Yao Lao’s feet suddenly had white bubbles rolling over like it was being boiled. The bubbles being thrashed around under Yao Lao’s feet began to spread until they encompassed the entire lake’s surface.</p><br/><p>Xiao Yan was shocked as he stared at the scene of the lake with a stunned face. The current Yao Lao was entirely different from the lazy and indifferent old man that he usually was. At the moment, he was like a chilling knife being unsheathed, carrying a sharp, imposing force that one did not dare directly look at.</p><br/><p>“I’m afraid that this is someone who is truly strong…” Xiao Yan whispered in his mouth. A moment later, Xiao Yan’s eyes suddenly blazed. He believed that one day, he would also be able to achieve this strength.</p><br/><p>Above the lake, Yao Lao indifferently and slowly lifted the black ruler in his hand. On the surface of the ruler, the numerous bizarre lines that Xiao Yan had once been confused about were emitting a fiery red light. When the surface of the ruler passed through empty space, the surrounding air suddenly became illusionary and blurry.</p><br/><p>Tightly grabbing the black ruler which had turned into the fiery redness like that of the sunset, Yao Lao let out a soft low cry and suddenly moved his body.</p><br/><p>His feet slowly stepped on the empty space as a blurry afterimage shockingly appeared under the light of the setting sun.</p><br/><p>Looking at the blurry afterimage in the empty space with a shocked expression, Xiao Yan became speechless. He did not expect that Yao Lao’s speed was frightening to this extent.</p><br/><p>As the blurry afterimage scattered, Yao Lao’s body appeared to have teleported to a spot under the huge waterfall that was over ten feet away. Compared to the huge waterfall, Yao Lao’s small body was like an ant that did not attract anyone’s attention. However, it was this ant like small figure that was currently carrying a force that was more frightening than the waterfall.</p><br/><p>The intense wind pressure that the waterfall carried as it descended did not even cause the small and weak-looking Yao Lao to move.</p><br/><p>Yao Lao’s body, which had shot forward abruptly, came to a stop. His feet stepped on the empty air and spun a hundred and eighty degrees. The light emitting from the black ruler in Yao Lao’s hand grew increasingly bright. Moments later, the brightness forced Xiao Yan to narrow his eyes.</p><br/><p>“Di Rank Dou Technique: Flame Splitting Tsunami!”</p><br/><p>In the empty space of the valley, a muffled sound like thunder exploded. This was quickly followed by an extremely turbulent heat wave that was scattered throughout the entire valley.</p><br/><p>“Bang!” Numerous water pillars suddenly sprung from the surface of the wide lake, revealing a spectacular sight.</p><br/><p>Between the water pillars, an enormous red light suddenly flashed. At the spots where the red light passed through, the water pillars immediately disappeared and were replaced by a cloud of mist.</p><br/><p>“Bang!” The red light was like a shocked goose that shot across the lake’s surface like lightning, creating a tsunami that was over ten meters tall. Finally, it smashed heavily into the galloping waterfall.</p><br/><p>“Bang! Bang! Bang!”</p><br/><p>A deafening, explosive sound of thunder continued to reverberate through the valley as countless rocks broke and fell from the cliff wall.</p><br/><p>Xiao Yan covered his ears and widened his mouth at the noise that was created by the attack. A moment later, he swallowed his saliva with difficulty and shifted his gaze to the place where the waterfall was. However, a thick fog blocked his sight.</p><br/><p>A ferocious wind blew from the surface of the lake, scattering the fog in the valley. The huge waterfall behind the mist was also slowly revealed.</p><br/><p>Xiao Yan’s eyes widened as he stared at the waterfall that had appeared. He was dull for a moment before slowly taking in a breath of cold air.</p><br/><p>At that moment, the tremendous water flow of the waterfall was actually cut off, exposing the huge rocky gully behind. It was over a hundred feet long and thirty feet wide.</p><br/><p>On the edge of the gully, countless small crack lines covered the entire rocky wall, appearing like an ivy.</p><br/><p>The water stream of the waterfall was cut off for over twenty seconds before it began to gradually flow down, covering the huge scars on the rock surface.</p><br/><p>“This is the strength of a Di Rank Dou Technique?” Xiao Yan rubbed his chest, feeling a little flustered and suffocated.</p><br/><p>Descending from the sky, Yao Lao lightly placed a finger on the stunned Xiao Yan.</p><br/><p>“Flame Splitting Tsunami, Low Di Dou Skill. When mastery is achieved, cutting mountains and breaking waves can be easily accomplished.”</p><br/><p>Even though it was a simple description, it still gave Xiao Yan much happiness.</p><br/><p>Stabbing the Heavy Xuan Ruler into the ground, Yao Lao wiped his hands against each other and raised his chin at the ten huge wooden logs under the waterfall. He smiled, “From today onwards, you will need to withstand the flow of the waterfall as you train. Once you are able to hold your ground on the tenth log and cut against the water flow for three hundred times, you will have achieved the first step in using the ‘Flame Splitting Tsunami’. But you need to remember that with your strength, you can at most use the ‘Flame Splitting Tsunami’ once. If you try to forcefully use it a second time, you will receive a serious internal injury and may affect your future potential. Thus, do not carelessly use it unless it is a very crucial moment!” Yao Lao’s voice grew severe towards the end of his speech.</p><br/><p>Xiao Yan nodded his head as he followed Yao Lao’s gaze and stared at the bottom of the waterfall. The loud, banging noises emitted from the water crashing against the enormous rocks made him shiver as he let out a hollow laugh, “With such a strong force, if one were to enter without the protection of one’s Dou Qi, one would instantly be knocked unconscious, no?”</p><br/><p>“Maybe.” Yao Lao spread out his hands and extended one to Xiao Yan with a smile, “When you are training, you must have the Heavy Xuan Ruler with you. When you want to use the ‘Flame Splitting Tsunami’ in the future, you will have to rely on it. Without it, this Di Rank Dou Technique would only have around thirty percent of its strength.”</p><br/><p>“Additionally, please hand over all the ‘Energy Recovery Pill’ you have with you. This training does not require it. You will have to rely on yourself to recover your Dou Qi.” Yao Lao took the pills directly from Xiao Yan’s storage ring as he smiled.</p><br/><p>Seeing that Yao Lao had confiscated all of his reserve stock, Xiao Yan could only helplessly twitch the corner of his mouth. He turned around and eyed the huge wooden log under the waterfall before clenching his teeth, “What kind of misery have I not overcome? Do you think I would be overwhelmed by this difficulty?”</p><br/><p>“For the Di Rank Dou Technique, I will fight!” Clenching his teeth and letting out an angry cry, Xiao Yan stripped his clothes and jumped onto a huge rock. With a threatening gesture, he leapt to the first wooden log.</p><br/><p>“Bang!” As Xiao Yan landed on the wooden log, a huge force from the waterfall ruthlessly knocked onto his body before he could call upon his Dou Qi to protect his body. He felt a sharp pain on his back before the ferocious force showed no sign of restraint as it knocked him off the wooden log and into the lake.</p><br/><p>Xiao Yan’s head surfaced from the lake and vomited the water that went into his stomach. He shouted angrily, “I’m going to drag it out with you today!” After he shouted, Xiao Yan climbed out the of lake and once again jumped onto the huge rock before furiously rushing onto the wooden log.</p><br/><p>“Bang…”</p><br/><p>“Damn your grandmother.”</p><br/><p>“Bang…”</p><br/><p>“Dammit.”</p><br/><p>“Bang…”</p><br/><p>Seated on a huge rock by the lakeside, Yao Lao watched the young man use his stubborn strength to repeatedly challenge the waterfall. He smiled faintly as a pleased look appeared in his eyes.</p><br/>\n</div>"}