{"title": "Chapter 131: Mysterious Woman and the Rank Six Magic Beast Amethyst Winged Lion", "id": 131, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-131-mysterious-woman-and-the-rank-six-magic-beast-amethyst-winged-lion", "volume_title": "Volume 2", "body": "<h1>Chapter 131: Mysterious Woman and the Rank Six Magic Beast Amethyst Winged Lion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 131: Mysterious Woman and the Rank Six Magic Beast Amethyst Winged Lion</u></strong></p><br/><p>From the blue sky above, the violent waves of energy continued to create repeated muffled thundering noises. Even though Xiao Yan was far from where the battle took place, his ears started to feel uncomfortable.</p><br/><p>Xiao Yan focused intently at the far skyline where green and red seemed to fill the air. The lazy white clouds were also no exception as they were dyed a shade of the two colors.</p><br/><p>Another thunderous roar blasted into Xiao Yan’s ears, causing him to swallow hard. The pressure from the energy in the sky actually caused his legs to shiver.</p><br/><p>“Is this a fight between the strong?” Xiao Yan mumbled in his mouth. This was the first time that he had witnessed the terrifying power from a battle of this level. He felt that the him of the past was but a frog in a well. Only now did he finally understand that the records in the books that described one person handling ten thousand opponents were not simply legends.</p><br/><p>Standing beside Xiao Yan, Yao Lao pressed his eyebrows together and watched the distant battle that occurred at the skyline and muttered to himself, “That female should be a human. Why did she run all the way to the Magic Beast Mountain Range and fight with the Amethyst Winged Lion?”</p><br/><p>“What? Do you feel shocked?” Yao Lao suddenly asked with a smile when he tilted his head and noticed the shivering Xiao Yan.</p><br/><p>Nodding his head with great difficulty, Xiao Yan smiled bitterly. “Only after witnessing their battle do I understand that the fights that I have been involved in were insignificant.”</p><br/><p>“Ke ke, I’ve already said that the Dou Qi continent is very big. There are even a number of people stronger than a Dou Huang practitioner. You have the potential. When you finally step onto that level, you will naturally come to realize that this world is very exciting.” Yao Lao laughed.</p><br/><p>“Although the power that used created in these battle is very scary, I will not be overtly ambitious. The journey should be taken one step at a time.” Xiao Yan smiled brilliantly.</p><br/><p>Hearing this, Yao Lao was momentarily stunned but he quickly gave a pleased smile and nodded.</p><br/><p>“Do you want to go over and have a look at their fight?” Lifting his chin to the far away fight, Yao Lao asked.</p><br/><p>“They won’t discover us, will they?” Xiao Yan initial joy was quickly overshadowed by his concern as he spoke.</p><br/><p>“Aren’t you looking down on me?” Yao Lao waved his hand, transforming his body into a flowing light and entered Xiao Yan’s body. Immediately, a dense white energy warped around Xiao Yan. “I’ll be controlling your body during this period of time.”</p><br/><p>Once he said this sentence, the Ziyun Wings on Xiao Yan’s back automatically extended outwards. The Ziyun Wings this time around were not only over a meter long but had a purple colored light flowing on its surface, appearing both vivid and mysterious.</p><br/><p>The dense white energy slowly encompassed the purple light of the wings, hiding the glaring bright light.</p><br/><p>“Let’s go. Today, I’ll bring you to see what is called a truly strong person!” Yao Lao smiled faintly as he flapped the Ziyun Wings, slowly lifting Xiao Yan’s body into the air. The pair of wings flapped again, sending Xiao Yan shooting at a low altitude towards the battleground.</p><br/><p>Seeing the blurry images of the trees retreating under him, Xiao Yan was so excited that his face appeared to be a little red. With the help of the Ziyun Wings, Yao Lao’s current speed was much faster than what it was back at Wu Tan City. The pleasure of flying at great speed gave Xiao Yan an impulse to face the sky and shout.</p><br/><p>Xiao Yan flew at an extreme speed along the canopy of the woods and after ten minutes, finally closed in on the fight. The pressure that was transmitted from the overwhelming waves of energy caused Xiao Yan’s heart to tremble despite being under the protection of Yao Lao.</p><br/><p>Xiao Yan finally came to a stop less than a hundred meters away from the battle in the sky. Xiao Yan used the cover of the large forest and landed on top of an enormous tree. Here, Xiao Yan could clearly see the pair who were fighting in the sky.</p><br/><p>Watching from a close distance, Xiao Yan once again experienced the fierceness and toughness of a Dou Huang. In the blue sky above, the green and red color enveloped almost half of the entire skyline, giving birth to a spectacular picture.</p><br/><p>Xiao Yan’s gaze first swept over the enormous Magic Beast in the sky. The Magic Beast had a gigantic body that was seven or eight meters long. The surface of its body was covered by a layer of purple colored crystal, which reflected the sunlight and shone it in all directions.</p><br/><p>The Magic Beast’s head was an ominous looking lion’s head with a pair of bloody red beast eyes that carried a strange glint of purplish light and a large mouth covered with fangs. At the top of the beast head was a fiery red helix shaped horn with a cluster of purple colored flame clustered around it. A pair of purple colored wings grew from the back of the lion’s body. When it flapped, numerous small clusters of flame were swept in all directions, much like a flamethrower. Its four rough and strong claws were similarly covered with a layer of purple crystal. Each time they stepped down, they would cause the empty air to shake, displaying a great strength that was difficult to imagine.</p><br/><p>The huge Magic Beast stood in the air while a shapeless pressure descended from the sky, causing Xiao Yan’s spirit to tremble.</p><br/><p>“It this the legendary Amethyst Winged Lion?”</p><br/><p>Xiao Yan mumbled softly as he obscurely watched the Magic Beast which displayed both beauty and destruction.</p><br/><p>Xiao Yan shook his head due to the amazement he felt for the Amethyst Winged Lion. He then shifted his gaze onto the one who had challenged the Amethyst Winged Lion.</p><br/><p>“A female?” When Xiao Yan’s gaze first swept across the well proportioned and exquisite body, he was startled. He did not expect that the strong person who dared fight with the Amethyst Winged Lion was actually a woman.</p><br/><p>The lady in the sky was wearing a tight dress that covered her exquisite frame while wielding a strange looking longsword that was emitting a green colored light. Her black hair was held in place by a noble looking phoenix accessory. The beautiful and moving face of hers was very calm, revealing not the slightest change even when faced with a Magic Beast that was extremely well known in the Dou Qi continent.</p><br/><p>On the mysterious woman’s back was a pair of green colored wings that appeared slightly illusionary. Those were likely formed from the amalgamation of her Dou Qi. The transformation of Dou Qi into wings was a symbol of those who were Dou Wang or stronger.</p><br/><p>The mysterious woman lightly stood in the sky. Her calm and beautiful face carried a gracefulness and nobility that the simple dress she wore could not hide.</p><br/><p>“Human woman, why did you come and disturb my rest?” The huge Amethyst Winged Lion in the sky suddenly roared using the human’s language.</p><br/><p>Upon hearing that the Magic Beast spoke the human language, Xiao Yan was initially shocked but quickly realized something. After reaching this rank, the Magic Beasts had long achieved consciousness and possessed an intelligence that would not lose to a human.</p><br/><p>“I wish to borrow your highness’ Purple Spirit Crystal.” The mysterious woman parted her red lips as her beautiful eyes stared at the Amethyst Winged Lion. Her faint voice was clear and moving.</p><br/><p>“Purple Spirit Crystal? I can only drop a small piece every twenty years. Who are you to ask for it?” The Amethyst Winged Lion mockingly said.</p><br/><p>“I can exchange for it with something that you need.” The mysterious woman seemed also slightly afraid of this rank six Magic Beast that was well known for its fierceness. Thus she was not forceful when she spoke.</p><br/><p>“Exchange? Ha, alright. It so happens that I am now in the body transformation stage. If you can get me a ‘Body Transformation Pill’, I will give you a Purple Spirit Crystal. What do you say?” The Amethyst Winged Lion howled when it heard the woman’s suggestion.</p><br/><p>“To actually ask for so much. The ‘Body Transformation Pill’ is a rare pill that requires a tier seven alchemist to successfully refine. Using it to exchange for a Purple Spirit Crystal? Unless that woman is an idiot.” Hearing the demand of the Amethyst Winged Lion, Yao Lao laughed with his old voice.</p><br/><p>Xiao Yan blinked his eyes. Having heard of this pill for the first time, he curiously asked, “From its name, it seems like this ‘Body Transformation Pill’ is used to help the Magic Beast transform its body, right? Why? Is it very valuable?”</p><br/><p>“With the ‘Body Transformation Pill’, a Magic Beast would be able to completely transform into the human shape. Once they achieved this transformation, their training speed would become comparable with that of a human. Do you think that this thing isn’t valuable?”</p><br/><p>“Uh…” Xiao Yan nodded his head speechlessly. The lifespan of a Magic Beast was much longer than a human’s. Although there were some strange pills that could extend one’s lifespan but when compared with a Magic Beast, especially those of higher ranks, the lifespan of a human was really short. Just imagining a high ranked Magic Beast that had successfully transformed and trained continuously for a hundred or eighty years would be a creepy thought.</p><br/><p>As Yao Lao had expected, the mysterious woman frowned and shook her head upon hearing the Amethyst Winged Lion’s demand. With a soft voice, she said, “I’m sorry, There are only a few people in the Jia Ma Empire who possess something like a ‘Body Transformation Pill’. But if you are willing, I can use three rank five Monster Cores and a High Xuan Qi Method and Dou Technique that you can train with to exchange with you.”</p><br/><p>“Not interested. If you cannot produce the ‘Body Transformation Pill’ then you should leave the Magic Beast Mountain Range.” The Amethyst Winged Lion shook its large head, not hesitating to reject the mysterious woman’s terms.</p><br/><p>Letting out a soft sigh, the mysterious woman slowly lifted the strange looking longsword in her hand and said helplessly, “If it is like this, then I’ll have to use force.”</p><br/><p>“Ha ha! Humans are always like this.” Seeing the mysterious woman’s action, the Amethyst Winged Lion immediately let loose a thundering laugh. A while later, the laughter finally receded and its voice became cold once more, “I know that you are also a Dou Huang but if we were to really fight, it would be a real question of whether you are able to walk out of the Magic Beast Mountain Range alive.”</p><br/><p>“You don’t need to be concerned about that.” The mysterious woman responded indifferently as she lifted her hand gently. As she did so, a small wisp of a green colored tornado suddenly appeared in the air. Initially, the tornado was only two meters wide but a moment later, the tornado began to expand and turned into a huge tornado that was over a hundred feet wide.</p><br/><p>In the space between the sky and the ground, the green tornado whizzed and whirled, constantly uprooting the huge trees on the ground. The ferocious wind quickly grinded the trees down, filling the air with sawdust.</p><br/><p>“Hmm! The Magic Beast Mountain Range is not the territory of you humans. You do not have the right to behave so atrociously!” The Amethyst Winged Lion eyed the growing enormous tornado and growled. From its large mouth, a deep roar echoed throughout the mountain range.</p><br/><p>Following the lion’s roar, the amethyst on its body shone brightly. In the blink of an eye, a savage purple flame violently surged forth from its body. The purple flame gradually spiraled upwards, finally forming an enormous pillar of purple that shot towards the sky. The intense heat caused Xiao Yan, who was a kilometer away, to perspire unceasingly.</p><br/><p>“What a frightening condition.” Xiao Yan spoke dryly as he wiped off the perspiration on his forehead and watched the distant huge tornado and fire pillar with awe.</p><br/><p>“Teacher, who do you think will win?” After wiping his perspiration once more, Xiao Yan asked in a soft voice.</p><br/><p>“At this stage, it is usually difficult to kill off the opponent in one blow unless one possesses an extremely strong trump card. As for who will win or lose, I cannot say for certain. Everything will be known once the fight is over.” Yao Lao replied with a smile.</p><br/><p>Xiao Yan shook his head helplessly. Suddenly, he raised his head, watched the tense atmosphere, and whispered, “The fight is starting….”</p><br/>\n</div>"}