{"title": "Chapter 132: A Dou Huang Level Fight", "id": 132, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-132-a-dou-huang-level-fight", "volume_title": "Volume 2", "body": "<h1>Chapter 132: A Dou Huang Level Fight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 132: A Dou Huang Level Fight</u></strong></p><br/><p>During the time when the mysterious woman waved her hand, the enormous green tornado in the sky rushed towards the Amethyst Winged Lion in an unrestrained manner, carrying a wind that howled frantically.</p><br/><p>In the areas where the tornado passed, the forest on the ground was uprooted, turning the place into a flat yellow ground while many Magic Beasts fled everywhere</p><br/><p>With Yao Lao’s protection, the lucky Xiao Yan was not blown away by the wind. His hands tightly grabbed the tree branch as he stared at the forest that had turned into a mess. Involuntarily, he swallowed his saliva.</p><br/><p>“Hmph!” Watching the spiraling tornado approaching, the Amethyst Winged Lion’s large mouth let out a loud snort. It flapped its wings and the twenty to thirty foot pillar of purple flame pushed outwards and smashed towards the tornado.</p><br/><p>The two enormous objects collided in the sky. The moment they did, there was a dead silence in the air.</p><br/><p>“Bang!” A roar of thunder abruptly blasted in the sunny sky.</p><br/><p>The tornado and the fire pillar violently collided, unleashing an uncontrolled and frightening energy. At the point of contact, ripples seemed to appear in the air.</p><br/><p>“Bang!” A few minutes after the tornado and the fire pillar collided, they seemed to have exhausted their strength and died down with an explosive blast that echoed throughout the mountain range.</p><br/><p>When the tornado and the fire pillar disappeared, the mysterious woman who was quietly standing in midair finally started to move. The green wings on her back flapped and like lightning, her body instantly passed through the area where the energy was still in a turmoil and appeared behind the Amethyst Winged Lion. The strange longsword in her hand stabbed forward. A spinning wind blade was formed at the sword’s tip and spiraled at an incredible speed much like a green colored ball with numerous blades growing from it.</p><br/><p>“Clank clank…” The longsword carrying the wind blades slashed at the body of the Amethyst Winged Lion, creating a clear sound in midair. However, the flashing slashes of the longsword only left a number of white scars. These white scars were present for a short moment before they disappeared.</p><br/><p>Ignoring the ordinary attack from its opponent, the Amethyst Winged Lion swung its head, shooting a strong large purple flame about half a meter in size from the red helix shaped horn on its head.</p><br/><p>The blazing purple flame caused the mysterious woman to knit her eyebrows together as her empty hand formed a strange looking seal in front of her. “Wind Pushing Force!”</p><br/><p>As her clear soft voice died off, a ferocious swirl of green colored wind was immediately summoned in front of her, blocking the purple colored fireball.</p><br/><p>Seeing that the attack by the purple colored flame was ineffective, the purple glint in the Amethyst Winged Lion eyes grew brighter. Its huge claw smashed at the mysterious woman while carrying a beautiful purple light. Wherever the claw passed, it tore apart the air pushing against it, emitting a sharp screech in midair.</p><br/><p>Eyeing the physical attack by the Amethyst Winged Lion, the mysterious woman’s face became more serious. A wind shield about two to three meters long suddenly congregated in front of her.</p><br/><p>“Crack…” The enormous claw crushed the the green colored wind shield. Under the magnificent purple colored light, a clear cracking noise sounded, immediately splitting the wind shield into numerous pieces that scattered with the wind. The physical attack of the Amethyst Winged Lion possessed a strength that could not be underestimated.</p><br/><p>The Amethyst Winged Lion let out a low roar as its attack broke through the opponent’s defence. It twisted its large body, unleashing another ferocious attack with a speed that did not match its enormous body size.</p><br/><p>Faced with the Amethyst Winged Lion’s relentless attack, the mysterious woman could only choose to dodge. After all, it was foolish to attempt to take on the abnormal strength of the former.</p><br/><p>In the sky, the Amethyst Winged Lion’s body continued to make quick motions and that mysterious woman repeatedly retreated. It appeared that she had fallen into a disadvantageous state but thankfully, she did not receive any injuries from the beast.</p><br/><p>Xiao Yan secretly let out a whistle as he lifted his head to face the beautiful battle, admiring its sound effects and the unceasing ripples in the air. Just the strength from the aftermath of their battle was possible to destroy a Dou Shi or even a Da Dou Shi.</p><br/><p>“The Amethyst Winged Lion has a very strong defense and endurance while the woman seems to know numerous Xuan Wind type Dou Techniques. Both of them are also Dou Huangs, with similar strengths. If they continue to fight like this without revealing their trump cards, it is not possible to determine a winner.” Yao Lao carelessly said.</p><br/><p>“It shouldn’t end like this. The Amethyst Winged Lion is of the fire affinity. His combat power would be strengthened under the hot sun while it would be weakened in the night. It will likely try to quickly end the battle before sunset.” Xiao Yan spoke as he lifted his head and watched the pursuit going on in the sky.</p><br/><p>“Ha, you seem to have made a detailed observation. In such a short period of time you actually discovered that the Amethyst Winged Lion relies on the hot sun.” Hearing Xiao Yan’s analysis, Yao Lao could not help but smile somewhat strangely.</p><br/><p>“From what I see, the amethyst on its body seems to be absorbing the sun’s energy. The purple colored flame in its body should also be from those amethysts.” Xiao Yan blinked and suddenly asked, “Teacher, Can the purple colored flame of the Amethyst Winged Lion be refined by an alchemist into a flame seed and stored within the body?”</p><br/><p>“Uh… you have a great imagination.” After being stunned by the ridiculous thinking Xiao Yan had, Yao Lao shook his head and explained, “It is very difficult for an alchemist to refine this kind of flame. They are born from within a Magic Beast so they are harder to tame as compared to a Heavenly Flame. Moreover, this kind of flame cannot be compared to a Heavenly Flame. It is only just slightly stronger than ordinary Dou Qi flame so no one would bother to exhaust a large amount of effort to tame it.”</p><br/><p>Xiao Yan nodded briefly and once again became silent. He lifted his head and continued watching the rare high level fight.</p><br/><p>Due to the huge stir created by the fight between beast and human, many Magic Beasts were disturbed from their sleep. Thus, many different and unique Magic Beasts began appearing on the originally empty mountain range.</p><br/><p>In order to survive in the inner region of the Magic Beast Mountain Range, the strength of these Magic Beasts were basically at least rank three. At this rank, the Magic Beast has gained an initial consciousness and were entirely different from those in the outer regions who basically only had instinct.</p><br/><p>In the world of the Magic Beasts, there was an extremely strict hierarchy. Among those Magic Beasts which had just appeared, the lower ranks consciously fled with their tails behind their backs to the outer regions of the battle field. The Magic Beasts that had the qualification to pause nearby and observe the fight were extremely few in number. Xiao Yan had secretly counted them; there were three large Magic Beasts which stood upright on three of the mountain peaks appearing to look down upon the rest. Their gazes were entirely focused on the battle occurring high up in the air. As for these three Magic Beast’s rank, Yao Lao had informed him that they were rank five, similar to a Dou Wang practitioner amongst the humans.</p><br/><p>Staring at the legendary and well known ferocious beasts, Xiao Yan could not help but moan in his heart. This was only the eastern regions of the Magic Beast Mountain Range, yet a rank six Magic Beast, three rank five Magic Beasts, and several other Magic Beasts of various ranks had already appeared. The power of this frightening group could easily destroy an entire army!</p><br/><p>While many Magic Beasts appeared, not one of them showed any signs of stepping forward to help the Amethyst Winged Lion. They clearly understood that it would be an insult to the king of the eastern mountain region if they interfered.</p><br/><p>The fight in the sky continued from noon all the way until the sun was about to set.</p><br/><p>Seeing the large sun beginning to disappear into the horizon, the Amethyst Winged Lion which had been attacking tirelessly suddenly stopped. Its red eyes with a purple glint carried an intolerant and majestic appearance as it stared intently at the noble looking lady.</p><br/><p>“Human female, you have eroded much of my limited patience!” The low roar of the Amethyst Winged Lion shook the woods in the mountains.</p><br/><p>“As long as your highness is willing to hand the Purple Spirit Crystal over to me, I promise that I will not disturb you again.” Despite being hunted for an entire afternoon, the mysterious woman still appeared both graceful and noble. A fierce swirl of wind appeared and disappeared around her when she spoke.</p><br/><p>“Since you are so ungrateful, don’t blame me!” A lion’s roar carrying a faint trace of anger escaped from the Amethyst Winged Lion’s large mouth. The light on its body grew increasingly intense until the bright light finally began to eclipse that of the setting sun.</p><br/><p>“It is showing its true strength…” Witnessing the power on the body of the Amethyst Winged Lion, anticipation welled up in Xiao Yan as he whispered.</p><br/><p>Seeing the intense purple light on the Amethyst Winged Lion in the air, the surrounding Magic Beasts which were observing the fight suddenly panicked and began to swiftly move back. Even the three gigantic rank five Magic Beasts were no exception.</p><br/><p>The strange state of the Amethyst Winged Lion was also something the mysterious woman was cautious of. Her face gradually grew even more serious as she felt the unnatural flow of the energy around her. A violent gale began to blow within an area that was dozens of feet wide.</p><br/><p>The purple colored light began to envelop the entire place. After a moment of preparation, the light abruptly shrank and in just the blink of an eye, the wide hovering light had shrunk into a deep purple light pillar that was half a foot wide.</p><br/><p>“It’s a seal?” Feeling the energy from the purple colored pillar, Yao Lao could not help but whisper in an astonished voice.</p><br/><p>“A seal?” Xiao Yan quickly asked when he heard the term.</p><br/><p>“Some of the strange high ranked Magic Beasts have an inborn knowledge of how to use seals. It is really unexpected that this Amethyst Winged Lion knows how to use it. That woman is in for some deep trouble.”</p><br/><p>As Yao Lao’s explanation receded, the dark purple light pillar shot out like lightning. Its speed was exceedingly frightening and leaped twice before appearing a short distance away from the mysterious woman.</p><br/><p>“Amethyst Seal!” As the purple light flickered, the Amethyst Winged Lion’s roar reverberated throughout the mountain range.</p><br/><p>At the instant when the dark purple light pillar appeared, the mysterious woman’s face changed. The powerful Dou Technique was quickly released before it could finish.</p><br/><p>“Splitting Wind Dance!”</p><br/><p>Following the call of the mysterious woman, the space in front of her began to fluctuate. Numerous huge dark green wind blades that were over a hundred feet in size appeared in the air. Then they linked together, forming something that appeared like a cylinder of blades that spiraled at extreme speed as it moved forwards.</p><br/><p>“Bang! Bang!” The space where the purple colored light pillar and the spiraling wind blade passed through became distorted. An instant later, the two crashed against each other, releasing a frightening sound similar to two meteorites colliding.</p><br/><p>Briefly after the purple colored light pillar and the spiraling wind blades crashed into each other, the spiraling wind visibly appeared to be weaker. In just a short moment, the spiraling wind suddenly exploded while the purple colored pillar merely dimmed slightly,</p><br/><p>After overcoming the spiraling wind blades, the purple colored light pillar appeared to be at ease as it broke through tens of wind shields that the mysterious woman had put up. It finally shot into her body.</p><br/><p>Right after the attack by the purple colored pillar of light succeeded, the Amethyst Winged Lion’s huge body appeared in front of the mysterious woman. Its huge claw unleashed five extremely sharp purple colored spikes that viciously shot towards the latter’s head.</p><br/><p>“Wind’s Peak, Killer Meteorite.”</p><br/><p>Just as the huge claw was about to penetrate the mysterious woman’s body, the strange sword in her hand suddenly trembled. A thin mysterious beam of light that was about the size of a thumb instantly shot outwards.</p><br/><p>The light beam even made the air quivered.</p><br/><p>“Crack!” The beam of light shot towards the Amethyst Winged Lion’s head, but the beast’s astuteness led it to lower its head slightly, resulting in the beam of light hitting the red horn on its forehead. In an instant, the hardest part of its body was cleanly cut in half.</p><br/><p>The sliced horn caused the Amethyst Winged Lion to feel an immense pain. It let out a violent lion’s roar as its claw slashed forward with an fierce force, smashing heavily against the mysterious woman’s chest.</p><br/><p>Following a piercing metal clashing sound, the mysterious woman who received the heavy blow threw up a mouthful of blood. With a pale face, she abruptly turned around and flapped her green wings. Her body flickered mysteriously and an instant later, disappeared into the horizon.</p><br/><p>Eyeing the frightening speed she displayed despite being injured, the Amethyst Winged Lion, which had temporarily lost his strength due to the broken horn, released a wild roar that was filled with killing intent.</p><br/><p>Under the influence of this roar that was filled with a wild energy, the bases of mountains in the mountain range shook unceasingly like an earthquake, Some of the peaks of the mountain were even broken off by the vibration.</p><br/><p>“Go and search! Find that human woman!”</p><br/><p>The Amethyst Winged Lion let out a menacing roar that was filled with killing intent as its large head faced the bottom of the mountain range and stared with its bloody red eyes. As a result, all the Magic Beasts in the mountain began to hurriedly and frantically move.</p><br/>\n</div>"}