{"title": "Chapter 159: Advancing to Dou Shi!", "id": 159, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-159-advancing-to-dou-shi", "volume_title": "Volume 2", "body": "<h1>Chapter 159: Advancing to Dou Shi!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 159: Advancing to Dou Shi!</u></strong></p><br/><p>“About to break through?”</p><br/><p>Xiao Yan looked at Yao Lao, stunned. It was a while before he gradually recovered his wits after the shock from these words. He proceeded to say, half in disbelief, half in happiness.</p><br/><p>“Yes.”</p><br/><p>Feeling the energy in the surroundings rush about, Yao Lao smiled, “Prepare to break through, this is your chance. If you miss it, you’ll never know how long you will have to wait until your next opportunity.”</p><br/><p>Emotionally nodding his head, Xiao Yan had no time to determine what level his Qi Method had evolved to as he hurriedly once again sat down. Both his hands came together to form a training seal before his thoughts submerged into his body.</p><br/><p>As Xiao Yan entered into a training state, the surrounding energy that was rushing about became increasingly wild and violent. Until finally, Xiao Yan’s body seemed to become a black hole as it continuously devoured the violent energy.</p><br/><p>Xiao Yan’s mind entered into his body and hastily started directing the incoming energy that was flooding in through his pores. Although there was a large quantity of this energy, there were too many impurities within it. Thus the energy needed to be refined by passing through the Qi Paths before it could be completely absorbed. If not, the Dou Qi he had so painstakingly trained might be contaminated.</p><br/><p>However, although Xiao Yan was already doing his best to control the vast amounts of incoming energy, he was eventually unable to gain complete control of suppressing it. After all, the scope of the energy was truly too terrifying.</p><br/><p>With no other way out, Xiao Yan could only try to control a small portion while the rest of the energy was left to freely flow around his body. Of course, Xiao Yan had already proper protection in place for the key areas, thus even though the energy was free to flow recklessly within his body, it only caused Xiao Yan some pain but was currently unable to do too much damage.</p><br/><p>Under Xiao Yan’s careful control, a portion of the natural energy that had flooded into his body circulated for a cycle in his Qi Paths before being refined into pure Dou Qi energy that he poured into the pale purple vortex.</p><br/><p>The pouring of this forceful Dou Qi was like throwing a huge rock into a calm lake, creating huge waves.</p><br/><p>The originally leisurely spinning vortex suddenly began spinning at an increased speed with the pouring of this wave of Dou Qi energy. As the rotation became more and more intense, a ferocious suction force exploded forth. At that moment, Xiao Yan was horrified to realize that his mind was actually unable to control the natural energy that had entered his body.</p><br/><p>Without the suppression from Xiao Yan’s mind, the natural energy that was scattered throughout Xiao Yan’s body and the unceasing absorption of the natural energy from his surroundings were madly being sucked into the vortex.</p><br/><p>Following the fast rotation of the vortex in Xiao Yan’s body, the suction that his body emitted in the cave also grew increasingly frightening. In the end, the mottled natural energy formed a energy curtain around Xiao Yan’s body, giving the surroundings a dazzling appearance.</p><br/><p>Yao Lao floated in mid air and observed the situation Xiao Yan had caused. He frowned. “What is this guy doing? How does he dare to directly put such unpure energy into his vortex?”</p><br/><p>Yao Lao slowly let out a breath as he frowned tensely. He suppressed the anxiety in him and quietly watched Xiao Yan. In his mind, he was prepared to reach out and save Xiao Yan. From the looks of the situation, Xiao Yan should not be able to hold out much longer.</p><br/><p>As Yao Lao was feeling both uncertain and anxious in the outside world, Xiao Yan, with his eyes tightly shut, was also beginning to feel a little panicky in his heart. He realized that because the unrestrained flooding of energy from his surroundings and his mind failing to control and ease it, his Qi Paths were starting to feel a faint swelling sensation and some pain. If he continued to absorb the energy in such a crazy manner, he might face the danger of having his Qi Paths swell and explode.</p><br/><p>“Bastard. Stop right now!”</p><br/><p>Without any strength to stop it, Xiao Yan could only use his mind to repeatedly roar at the fast rotating purple colored vortex.</p><br/><p>Xiao yan was uncertain if the roar was effective but the fast spinning vortex suddenly became a little sluggish. However, before Xiao Yan could express his surprise, the vortex once again madly spun with an even more ferocious speed.</p><br/><p>“Dammit!” Seeing the action of the vortex, Xiao Yan was so angry that he immediately cursed at it. However, just as his scolding died off, he abruptly realized that following the fast rotation, the surface of the purple colored vortex was gradually starting to be shrouded by a layer of purple colored flame.</p><br/><p>The rotation of the vortex grew increasingly fast and the Purple Flame also grew increasingly rich. At this moment, the natural energy that was scattered all around his body quickly and randomly passed through some Qi Paths and rushed into his lower abdomen. They then swarmed into the vortex from all directions.</p><br/><p>Xiao Yan’s mind blankly observed the surging natural energy as he wailed in his heart. If the energy that was filled with impurities was to rush into the interior of the vortex, all of the Dou Qi that he had taken great pains to train would instantly be destroyed.</p><br/><p>Under Xiao Yan’s forlorn observation, the surging natural energy finally began touching the vortex. However, when it touched the purple colored flame, something strange happened!</p><br/><p>That originally mild purple colored flame appeared to have its dignity provoked at that moment. In an instant, it rose into a Purple Flame that was half a foot large. Upon touching the Purple Flame, the swarming natural energy swiftly shrunk. In the blink of an eye, groups of enormous natural energy was calcined into droplets of small liquid energy around the size of a fingernail.</p><br/><p>After the Purple Flame burnt off all the impurities in the energy, it appeared to have an intelligence of its own as it avoided these droplets of pure liquid energy, allowing them to directly break into the vortex.</p><br/><p>When the liquid energy shot into the fast spinning purple colored vortex, it immediately created circles of energy ripples. Under the observation of Xiao Yan’s mind, he abruptly realized that following the input of the drops of liquid energy, the size of the purple colored vortex was strangely shrinking slowly.</p><br/><p>The size of the purple colored vortex grew increasingly small, but Xiao Yan did not worry. He could feel that although the size of the vortex was shrinking, the Dou Qi that was contained within the vortex was growing increasingly richer...</p><br/><p>Feeling the increasingly dense Dou Qi vortex, Xiao Yan began to gradually ease his frightened feeling as he quietly watched the vortex’s action.</p><br/><p>After the first wave of natural energy was refined by the Purple Flame, the remaining natural energy did not disappear because of this. Instead, the vortex ferocious suction strength caused waves of mottled natural energy to violently rush into Xiao Yan’s inner body, much like water sucked into a whirlpool.</p><br/><p>Faced with this seemingly never ending pouring of natural energy, the purple colored vortex directly widened its embrace and did not reject anything that came. However, when the energy entered the boundary of the Purple Flame, it was quickly refined by the ferocious Purple Flame into drops of pure liquid energy. Finally, like a drizzle in Xiao Yan’s body, the energy would drip into the vortex.</p><br/><p>With the support from the extremely pure liquid energy, the suction emitted from the vortex was stronger with each wave. Finally, even Yao Lao in the outside world was slightly affected by this crazy suction force.</p><br/><p>Under the scour of this natural energy, Xiao Yan suddenly realised that the Qi Paths and bones in his body became tougher and more spacious.</p><br/><p>With the situation progressing to this stage, Xiao Yan could no longer get involved. Everything was controlled by the purple colored vortex. Luckily, this strange thing did not really mess around indiscriminately. Otherwise, Xiao Yan may have ended up being badly wounded.</p><br/><p>As his mind roamed about in his body, Xiao Yan could clearly feel that his body was slowly strengthening under the scouring from the continuous waves of natural energy. This kind of sublime feeling almost caused Xiao Yan to moan in comfort.</p><br/><p>Within the cave, Yao Lao watched the comfortable smile on Xiao Yan’s face and finally let out a gradual sigh. He shook his head and smiled. From the looks of the situation, something unknown and mysterious had occurred in the young boy’s inner body. Otherwise, he would not display such a lewd expression.</p><br/><p>Of course, Xiao Yan naturally did not know that his expression of comfort had become something exclusively lewd in Yao Lao’s heart. This was because all of his attention was attracted to the purple colored vortex that was spinning at an increasingly fast speed.</p><br/><p>After absorbing an unknown amount of pure liquid energy, the current purple colored vortex was no bigger than Xiao Yan palm. However, the purple colored flame on its surface grew increasingly rich, showing no sign of weakening.</p><br/><p>Under the careful study of Xiao Yan’s mind, he could vaguely discover that there seemed to be some liquid like thing within the vortex.</p><br/><p>The greedy absorption continued for a long while until the fast spinning purple colored vortex suddenly stagnated. A moment after it came to a standstill before beginning to spin in the reverse direction.</p><br/><p>Seeing that the vortex had suddenly spun in reverse, Xiao Yan was more than stunned. He could only pray in his heart that the vortex would not act recklessly.</p><br/><p>Perhaps the vortex heard Xiao Yan’s prayer. The purple colored vortex that was spinning in reverse did not possess any destructive strength. However, the pure liquid energy that originally was flowing into the vortex was shot out in all direction with the force from the reverse spin.</p><br/><p>The liquid energy was thrown to every part of his body by the purple colored vortex. Each time the liquid energy touched a Qi Path, bone, blood or flesh, Xiao Yan found that the liquid energy was assimilated into them.</p><br/><p>“Hu…”</p><br/><p>Xiao Yan mind let out a gentle breath of non-existent air; an unrestrained happiness surged within his heart. Xiao yan could feel that following the assimilation of the liquid energy, all of his bones, blood and flesh seemed to have been transformed as they felt as if they were flooded with abundant energy.</p><br/><p>The reversed vortex continued to shoot out energy for over ten minutes before it came to a gradual stop. Following its slow stop, the ferocious suction within Xiao Yan’s body was also weakened until it disappeared.</p><br/><p>At the moment when the suction disappeared, Xiao Yan, who was seated cross-legged suddenly opened his eyes. Instantly, the black hair on his back blew back and the clothes drummed without any wind. A wave of ferocious force that was many times stronger than what it was a few hours ago was awakened in his body and was released from it.</p><br/><p>Sensing the vigor from Xiao Yan’s body, Yao Lao smiled and chuckled, “Congratulations, from today onwards, you are a true Dou Shi!”</p><br/>\n</div>"}