{"title": "Chapter 155: The Terrifying Condition", "id": 155, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-155-the-terrifying-condition", "volume_title": "Volume 2", "body": "<h1>Chapter 155: The Terrifying Condition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 155: The Terrifying Condition</u></strong></p><br/><p>A tiny victory: although Yao Lao had been very vague about it, Xiao Yan still managed to sense the meaning within. When the woman was at the Dou Huang level, she had already dared to put her strength against Dou Zong level Practitioners. And at the time when she fought with Yao Lao, she had already reached the Dou Zong level yet it still ended in Yao Lao taking the upper hand. Looks like, it would not be an exaggeration to say that the Yao Lao at that time stood at the apex of the Dou Qi Continent.</p><br/><p>Gazing at Xiao Yan’s stunned face, Yao Lao could not help but chide, “What’s there to be surprised about? In the future, you can also reach such a stage!”</p><br/><p>“Maybe.”</p><br/><p>Xiao Yan shrugged, declining to comment. That kind of level was already beyond the reach of just talent alone, both chance and luck were indispensable for it to happen. The current him merely wished for the Purple Flame to be quickly nurtured before gobbling it up to evolve his Qi Method and also allow himself to quickly become a Dou Shi. As for Dou Huangs, Dou Zongs…… these were just super existences that could easily suffocate Xiao Yan with just their names, he truly did not want to bite off more than he could chew.</p><br/><p>“According to the teacher's explanation...the Fairy Doctor, could she possibly have a Woeful Poison Body?” Xiao Yan asked as his gaze once again swept across the seven colors on the Fairy Doctor’s good-looking face while she laid on the bed.</p><br/><p>“Yes.” Slightly nodding his head, the smiling expression on Yao Lao face slowly receded. He stared at the Fairy Doctor for a good while before lightly sighing, “I had once fought that woman, thus my rather deep impression of the Woeful Poison Body.”</p><br/><p>“This kind of poison training method is rather unique, they do not need long years Dou Qi training. Rather for them to become stronger, they only need……” As he spoke till this point, Yao Lao’s eyes turned towards the traces of powder at the corner of the Fairy Doctor’s mouth with a slightly odd expression.</p><br/><p>“Consume...poison?” As he saw where Yao Lao was looking at, Xiao Yan was firstly stunned, though his expression quickly changed as he said in shock.</p><br/><p>“Ah, correct… it’s is consuming poison. Once they consume poison, their Woeful Poison Body will use a stange technique to convert the energy contained in the poison into a special poison Dou Qi.” Yao Lao smack his lips in amazement as he continued, “The more acute the poison is, the more effective it is in raising their strength. Thus, they don't need to go through any tough training. As long as they continue eating poison, their strength would rapidly rise.”</p><br/><p>“It truly is…...a terrifying physique!” Sighing gently, Xiao Yan bitterly laughed.</p><br/><p>“Naturally, there is nothing perfect in this world. This Woeful Poison Body may be able to swiftly raise one’s strength through the consumption of poison but poison at the end of the day is still poison. By relying on the Woeful Poison Body, one can stop the poison from devouring his or her bodies. However, when more poison accumulates over time to the point when the Woeful Poison Body cannot suppress the poison Dou Qi, then… tens of thousands of poisons will devour the body, causing the owner to slowly die under the most painful torture.” Yao Lao shook his head and sighed.</p><br/><p>Recalling pain makes one prefer death over life, Xiao Yan’s body gently shivered. With some pity, he looked at the Fairy Doctor on the bed who appeared like Sleeping Beauty and dejectedly asked, “Is there no solution to this?”</p><br/><p>“It is only natural to pay the price for gaining the ability to train quickly. In this world, there is no such thing as a free lunch.” Yao Lao said faintly.</p><br/><p>“Then if she were to give up consuming poison to gain strength, is it possible to avoid such an end?” Xiao Yan pupils spun around as he asked.</p><br/><p>“In theory, it is possible.”</p><br/><p>Nodding his head, Yao Lao saw the happiness on Xiao Yan’s face and sighed, “Unfortunately, you need to know that for those who own a Woeful Poison Body, the more potent the poison, the greater the attraction to them. It can even go to the extent of killing and stealing just to get their hands on an acute poison. In their eyes, acute poisons possess a lure similar the lure that the ‘Heavenly Flames’ has to an alchemist. They will use all kind of methods to get it, even if they have to become like moths leaping into a fire, they will not hesitate to leap into it… Do you think it is possible for you to get her to give up consuming poison?”</p><br/><p>“If she had never consumed poison then the Woeful Poison Body would never kick in. However, once she consumed poison, even if it is by mistake, then the Woeful Poison Body will really be activated. Once that happens, the conditions that I have just describe will occur and there’s no longer a chance to reverse it. In summary, we have discovered it too late, otherwise…” Yao Lao sighed regretfully.</p><br/><p>With his mouth opened, Xiao Yan’s expression continued to change irregularly. A long while later, it dispiritedly softened. According to Yao Lao, those acute poisons had the same attraction as drugs to an drug addict. Getting her to give it up may not be possible.</p><br/><p>“Her current Woeful Poison Body is at its initial stage so it is alright for her to come into contact with you when she’s conscious. However, when she’s unconscious or when the poison body matures in the future, that will be… whatever she touches, will die.”</p><br/><p>The corner of Xiao Yan’s mouth twitched. He finally understood why the Fairy Doctor had told him those strange words not so long ago. It looks like she had already known that she possessed this strange Woeful Poison Body.</p><br/><p>“How does she know? She has been staying in that small town, so how would she know about this secret information that not many people in the entirety of the Jia Ma Empire knew?” Xiao Yan mumbled suspiciously.</p><br/><p>Yao Lao quietly mused before his gaze swept towards the seven colored scroll on the Fairy Doctor’s chest. His palm beckoned it and sucked it into his palm. He then slowly opened it and scanned the different kinds of poison formulas on it before stopping at the last paragraph. Instantly, he shook his head helplessly and handed it over to Xiao Yan.</p><br/><p>Xiao Yan received the seven colored scroll and swept his gaze over it. His face was also filled with a bitter smile.</p><br/><p>“Woeful Poison Body, a strange type of Poison Body that can swallow poison in order to swiftly increase one’s strength. The method to recognize a Woeful Poison Body: At the lower abdomen region, there will be a very tiny seven colored line. This seven colored line will grow with the increase in the intensity of the body’s poison strength. When the seven colored line extends towards the heart, it is the time when the Woeful Poison Body is at its strongest. At the same time, the owner will also feel the pain of tens of thousands of poisons devouring the body.” Below this line, there was a detailed explanation on the damage that the Woeful Poison Body can cause. Amongst them were the things the Yao Lao had described earlier.</p><br/><p>“It looks like she already knows about it. If she continues like this, she will sooner or later be a vessel for potent poison.” Xiao Yan waved the seven colored scroll and laughed bitterly.</p><br/><p>“Yes.”</p><br/><p>Nodding his head and sighing, Xiao Yan returned the scroll to Yao Lao. His eyes stared at the Fairy Doctor and said softly, “Isn’t the Woeful Poison Body immune to all poison? Why is she like that now?”</p><br/><p>“The poison’s strength is too intense. She has only temporarily fainted and should wake up very soon.” Yao Lao carelessly said.</p><br/><p>“Oh.” Nodding his head, Xiao Yan sat down beside a table in the small house and waited for the Fairy Doctor to wake. Yao Lao simply gave another reminder before he disappeared back into the ring.</p><br/><p>Seated by the side of the table, Xiao Yan stared at the Fairy Doctor, shook his head and sighed. Her original aspiration was to become an alchemist. Unfortunately, due to her inborn attributes, she had to take a step back and become a physician. However, with the development of her constitution, she will likely end up becoming a grandmaster level poison master that many in the Dou Qi continent would fear.</p><br/><p>When she reached that stage, it may well be like what she had described that day. There would no longer be anyone who dared to come into contact with her, much less become a friend whom she can have a cordial conversation with. She had originally wanted to be a physician who could save lives but the heavens did not seem to want it. Instead, it allowed this kind young lady to have a Woeful Poison Body that everyone feared.</p><br/><p>“Ugh.” Taking in another breath, Xiao Yan lifted his eyes and found the seven colors on the Fairy Doctor’s face slowly diminishing.</p><br/><p>“Is she waking up?”</p><br/><p>Xiao Yan muttered before he once again sat quietly for another short moment. The Fairy Doctor who was tightly closing her eyes on the bed finally opened them slowly. Her hand moved slightly as the corner of her eyes looked at the black poison. The corner of her mouth gradually curled bitterly. A moment later, the bitterness spread as the Fairy Doctor pulled the quilt over her face. On and off, some sobbing noises were emitted from within the quilt.</p><br/><p>“I failed to control myself again… I should really die.”</p><br/><p>Seated on the chair and listening to the weak and gentle sobbing sound, Xiao Yan’s feelings became heavier. He slowly stood up and sat beside the bed. His hand gently patting the Fairy Doctor’s body that was hiding behind the quilt.</p><br/><p>Feeling that someone was touching her, the quilt was abruptly pulled down. The Fairy Doctor’s eyes widened when she saw the young man sitting by her bedside. Quickly, she rubbed away her tears and softly asked, “When did you come in?”</p><br/><p>“I entered when you were still unconscious.” Xiao Yan gently smiled.</p><br/><p>Hearing this, the Fairy Doctor’s pretty face slightly changed. She secretly hid the black colored poison that she held tightly in her hand into the quilt. A moment later, she appeared to have suddenly remembered something and hurriedly asked, “Did you touch me?”</p><br/><p>“Uh,,, after knowing me for so long, do I look like the type who would take advantage of you when you’re in an predicament?” Xiao Yan laughed dryly.</p><br/><p>“No, I’m not talking about this… I mean… you didn’t touch any part of my body, did you?” The Fairy Doctor waved her hands as she asked.</p><br/><p>“No.” Xiao Yan shook his head.</p><br/><p>Seeing Xiao Yan shake his head, the Fairy Doctor finally sighed in relief. She tugged her legs into her chest and lowered her snow white chin onto her knee as she said softly, “I’m fine. There was some problem with the poison I was making.”</p><br/><p>Xiao Yan did not speak. His eyes simply stared at the Fairy Doctor. A long while later, he suddenly said softly, “Really… you cannot abandon that thing?”</p><br/><p>Hearing the words, the Fairy Doctor initially reacted blankly. Following which, her beautiful body tensed and looked at Xiao Yan with an ugly expression, “You...what do you know?”</p><br/><p>“I’ve read the Seven colored Poison Book. At the same time, I know that you consumed poison.” Xiao Yan stared at the pair of vivid eyes as he said.</p><br/><p>“Then… you also know about the Woeful Poison Body described in it?” Seeing Xiao Yan nodding his head, the Fairy Doctor gave a sad smile and bit down hard on her red moist lips. She asked, “Then you are also afraid of me, aren’t you?”</p><br/><p>Staring at the Fairy Doctor who had a tear sliding down her pretty face, Xiao Yan felt emotions stir in his heart. He shook his head and gently patted her head with a warm smile on the corner of his mouth. He said tenderly, “If I was afraid, I would have ran just now. No matter how you put it, we’ve been through thick and thin together.”</p><br/><p>When she heard this, the tears in the Fairy Doctor’s bright eyes paused as she looked at Xiao Yan with a wide mouth. “Are you really not afraid of me? Will you still dare to eat the food that I cook for you?”</p><br/><p>“Anytime.” Xiao Yan said with a face that was full of smiles.</p><br/><p>Watching Xiao Yan’s face that held a smile full of warmth, a warm feeling flowed into the Fairy Doctor’s heart. She wiped away the tears from her face, inhaled through her stuffy nose and mumbled in her heart, “Thank you, Xiao Yan. Perhaps, you will be my only friend in the future. Regardless of what happens in the future, as long as you still consider me as your friend, I will always be the Fairy Doctor from Qingshan Town in front of you even if I end up becoming a grand poison master that everyone fears…”</p><br/>\n</div>"}