{"title": "Chapter 167: The Youngest Tier Two Alchemist", "id": 167, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-167-the-youngest-tier-two-alchemist", "volume_title": "Volume 2", "body": "<h1>Chapter 167: The Youngest Tier Two Alchemist</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 167: The Youngest Tier Two Alchemist</u></strong></p><br/><p>“Continue to take the test for a tier two alchemist?”</p><br/><p>Xiao Yan’s words not only caused Frank and Ao Tuo to display a dull expression but also caused the two ladies, Xue Mei and Lin Fei, beside him to suddenly pause what they were doing and lift their heads. Their faces were filled with astonishment as they blankly stared at the young man by the stone table.</p><br/><p>Within the hall, everyone’s gazes were foolishly staring at the young man. If Xiao Yan’s success in passing a tier one alchemist test just a moment ago caused them to feel amazement in their hearts, then this next question actually caused everyone to feel stunned.</p><br/><p>A nineteen year old tier one alchemist was uncommon but there were still many in the Jia Ma Empire. However, a nineteen year old tier two alchemist was truly rare. It should be known that even the Pill King Gu He within the Jia Ma Empire had only just become a tier one alchemist at this age.</p><br/><p>If Xiao Yan managed to pass the test for the tier two alchemist today, would it not mean that his achievements in the future would be even greater than Pill King Gu He.</p><br/><p>“Oh god… we might be witnessing a monster rising from the Alchemist Association at Black Rock City.” Everyone in the large hall exchanged glances with one another and immediately said with a soft, bitter laugh.</p><br/><p>“You… should not underestimate the requirements for the test for a tier two alchemist. If you want to pass the test for a tier two alchemist, you must not only refine a tier two medicinal pill, but your strength must also reach the Dou Shi level. Dou Shi! Have you achieved it?” Tilting her head, Lin Fei eyed the smiling face of the young man and could not help but knit her eyebrows together as she spoke.</p><br/><p>“Dou Shi…” Smiling gently, Xiao Yan watched Lin Fei’s beautiful and moving face and laughed, “ I only want to try. Whether I pass or not doesn’t make much of a difference.”</p><br/><p>“You really wish to take another test, this one being the tier two alchemist test?” Looking at Xiao Yan who did not display any expression of giving up after hearing Lin Fei’s words, Frank and Ao Tuo exchanged glances before asking seriously.</p><br/><p>“There should not be any problems, is there?” Xiao Yan rubbed his head as he asked with a smile.</p><br/><p>“How confident are you?”</p><br/><p>Ao Tuo’s expression was slightly serious at the moment. If the young man in front of him really passed the tier two alchemist test, then he was someone with incredible talent. In the future, this person might be a new star in the alchemist scene for Jia Ma Empire who is more overbearing than the Pill King Gu He! For the alchemist scene in the empire, this was undoubtedly great news that would cause an uproar.</p><br/><p>“Uh… around fifty percent.” Xiao Yan tightly closed his lips and analysed his success rate for refining a tier two medicinal pill before reporting a number. Since he was afraid of appearing too confident, Xiao Yan reported a somewhat conservative number.</p><br/><p>The number may have been considered conservative in Xiao Yan’s hear, but after he reported it, Ao Tuo and Frank trembled slightly. Some of the expressions on the other people’s faces also changed.</p><br/><p>There was quite a significant rate of failure when refining a tier two medicinal pill. Even some of the alchemists present did not dare guarantee that they would be able to achieve 50 percent success rate when refining a tier two medicinal pill! However, the young man in front of them actually wore a smile on his face as he said these words. Instantly, the few tier two alchemists in the hall began to call into question this figure in their hearts. Evidently, they did not quite believe what Xiao Yan had said even if he did own a strange type of flame.</p><br/><p>“Fifty percent…” After mumbling in her heart, Xue Mei tilted her head and stared at the tall figure of the young man by the stone table. In her heart, she involuntarily whispered, “Isn’t this guy a little arrogant?”</p><br/><p>“So? Can I continue taking the test? If it is really not possible, then forget it. After all, I am only making a temporary stop at Black Rock City. If I have the chance, I will go test somewhere else when I have time.” Seeing that Frank and Ao Tuo did not reply, Xiao Yan helplessly shook his head before speaking.</p><br/><p>“Wait!”</p><br/><p>Hearing Xiao Yan’s words, Frank quickly spoke. What a joke. This was an insane opportunity for the Alchemist Association in Black Rock City to show face among those of the same occupation. Thus, he would not allow Xiao Yan to run to other cities to take the test. If that were the case, it would be like giving the opportunity to others for no reason!</p><br/><p>“Someone, immediately prepare the tier two alchemist test!” When Frank exchanged another glance with Ao Tuo, the two of them found excitement in each other’s eyes. After which, he waved his hand and gave the order.</p><br/><p>Hearing this, a few alchemists behind him hurriedly moved and swiftly walked toward a side door in the hall. On the side door were the words ‘Tier Two Alchemist Test Venue’.</p><br/><p>“Alright, I will let you take the test. Little boy, you better not be deceiving us two old men.” Frank clapped his hands as he turned around and said with a laugh to Xiao Yan.</p><br/><p>“I will do my best… Oh yes, I heard that registering with the Alchemist Association after the test will let one receive some special privileges from the Association?” Xiao Yan walked from the stone table and asked with a smile.</p><br/><p>“Hehe, correct. When an alchemist refines medicinal pills, they usually require some extremely unique and rare plants. A person, however, cannot run all over the place to gather all these things. Hence, after you have registered at our Jia Ma Empire Alchemist Association, you will be able to enjoy the right of exchanges… For example, when you are refining a certain medicinal pill and you lack one of the medicinal ingredients which another alchemist happens to possess, under the consensus of both parties, our association will help you complete this transaction. Of course, the prerequisite is that you must be able to take out something that the other party is satisfied with to complete the transaction.” Frank nodded his head as he said with a smile, “Naturally, if your tier is higher, you would be able to enjoy even more rights. Thus, in order to exchange something which you need from others without many obstructions, you will need to work hard to raise your tier.”</p><br/><p>“It really is something good…” A little bit of joy appeared on Xiao Yan’s face as he nodded his head. This measure taken by the Alchemist Association would undoubtedly save the time required by an Alchemist to roam around to find ingredients. Moreover, it just so happened that Xiao Yan lacked some things right now. After he passed the test, he would definitely get Frank to help him check. If someone else really had the ingredients he needed, he would put in the utmost effort to exchange for them.</p><br/><p>“Alright, the preparations for the test for a tier two Alchemist have been completed. Follow me.” Tilting his head, Frank watched the few alchemists taking turns to exit the small room. After he saw them nod their heads, he then spoke the words with a smile.</p><br/><p>“Okay.” Xiao Yan nodded and subsequently followed Frank into that small room. Ao Tuo, who was behind him, also followed closely. When he was about to enter the door, he turned around and he said with a smile said to everyone outside who were extending their necks, “The examination for a tier two alchemist is different from a tier one alchemist. Thus, all of you cannot just carelessly enter. Just wait outside. There will soon be an answer.”</p><br/><p>“Teacher… please let me go in and take a look.” Hearing Ao Tuo’s words, Lin Fei’s face became anxious as she rushed forward and tugged on Ao Tuo’s sleeve while speaking like a spoiled child.</p><br/><p>“This has always been the rule of the Alchemist Association. Even I cannot do anything about it. You should just wait outside.” Helplessly shaking his head, Ao Tuo gently shook his sleeves, shaking Lin Fei off and forcing her to take a small step backwards. After that, he quickly went behind the door and closed it tightly with a loud slamming noise.</p><br/><p>“Hmph. What’s the big deal. If you don’t let me take a look, then so be it.” Eyeing the door that was tightly shut, Lin Fei snorted arrogantly and mumbled with dissatisfaction.</p><br/><p>Turning around, Lin Fei looked at the pretty and impassive face of Xue Mei and approached her. After which, she softly whispered beside the latter, “Do you think the guy will succeed?”</p><br/><p>“How would I know? Didn’t he say earlier that he is fifty percent confident? That seemed to be quite good.” Xue Mei said indifferently after glancing at Lin Fei beside her.</p><br/><p>Lin Fei curled her lips as her pretty figure jumped to sit on top of the stone table. Her long legs that were revealed under the purple-colored dress created a mesmerising snow-white angle, causing the gazes of some of the men in the hall to be unable to resist the temptation and glance over.</p><br/><p>“Ugh, I thought that it was already very impressive for us to be able to become a tier one alchemist within two years. Unexpectedly, this abnormal guy suddenly appeared. It is still alright that he is a little younger than us but he actually possesses the qualification to take the test for a tier two alchemist. Isn’t this too much of a blow to others?” Tilting her head, Lin Fei faced her rival for a number of years and helplessly said.</p><br/><p>Hearing this, a different undertone surfaced on Xue Mei pale expression. She sighed quietly and whispered, “It is indeed quite a blow to others.”</p><br/><p>“Back then, didn’t you say that no one among the younger generation in Black Rock City could surpass you? Now that someone has appeared, I recall that you said back then, It was something like accompanying…” Lin Fei’s crow-black eyes rotated as she suddenly spoke.</p><br/><p>“I’m sorry but he isn’t someone from Black Rock City.” A faint crimson color surfaced on Xiao Mei’s pretty face as a cunningness flashed across her pretty eyes before she told Lin Fei with a sweet smile.</p><br/><p>“You win…” Lin Fei softly snorted as she combed through the black hair on her forehead as she laughed, “But with that guy’s talent, you would not lose out. Although your teacher is one of the key figures in Black Rock City, you should also know that to be able to teach such an abnormal student, just think how strong his teacher must be.”</p><br/><p>“Not interested. If you like him, take him for yourself. Isn’t Grandmaster Ao Tuo’s reputation as an alchemist on par with my teacher? Moreover, your father is also the governor of Black Rock City.” Xue Mei smiled and said. Her indifferent tone, however, caused Lin Fei beside her to clench her teeth.</p><br/><p>“Che… the people who are chasing me can form a queue up to fifteen kilometers outside the city. I don’t have the leisure to throw myself at him.” Lin Fei prettily rolled her eyes as she laughed in a spoilt voice.</p><br/><p>The faint laughter caused Xue Mei to raise her eyebrow. Her gaze turned toward the door and her fist secretly tightened. She whispered, “They’re coming out.”</p><br/><p>“The examination has already ended?” Hearing this, Lin Fei’s mind was shaken as she hurriedly turned her gaze toward the door.</p><br/><p>Following a crunching sound from the door, it was gradually pulled open. Frank and Ao Tuo were first to exit. The exchanged a glance with each other before sighing softly and shaking their heads.</p><br/><p>Seeing their actions, Lin Fei and Xue Mei frowned. Did he fail?</p><br/><p>“This young boy’s talent in refining medicine is really frighteningly outstanding. Ugh… it’s not possible not to be impressed.”</p><br/><p>Lifting his head, Frank waved his hand and smiled. “Looks like our Black Rock City Alchemist Association has given rise to the youngest tier two alchemist in a hundred years…”</p><br/>\n</div>"}