{"title": "Chapter 182: Tough Training in the Desert", "id": 182, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-182-tough-training-in-the-desert", "volume_title": "Volume 2", "body": "<h1>Chapter 182: Tough Training in the Desert</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 182: Tough Training in the Desert</u></strong></p><br/><p>In the vast desert, a sandstorm raged. A young man wearing the long robes of an alchemist was slowly advancing through the sandstorm. The deep footprints left in the yellow sand behind him were covered by the sandstorm in a moment, burying all traces of his passage.</p><br/><p>The environment within the Tager Desert was more harsh than what Xiao Yan had expected. Under the exposure of the hot sun, the yellow sand under his feet was like scalding, small metal pieces, causing Xiao Yan to involuntarily twitch his mouth each time his feet stepped on it.</p><br/><p>As Xiao Yan slowly walked, the wind blowing toward his face carried fine grains of sand that smashed against his face, causing Xiao Yan to feel a slight stinging sensation. The pain caused Xiao Yan to circulate his Dou Qi all the time, forming a faint Dou Qi mask over his face in order to prevent the possibility of the sandstorm disfiguring him.</p><br/><p>Despite the desert environment being extremely harsh, the fire type energy that it contained made Xiao Yan a lot more pleased. It was perhaps due to the exposure of the sun that resulted in this place having a much richer fire type energy than the Magic Beast Mountain Range. Moreover, the fire type energy was also much more potent and pure, which was extremely suitable for Xiao Yan to use to train his Purple Flame Dou Qi.</p><br/><p>After entering the vast desert for only half a day, Xiao Yan could clearly feel that the Purple Flame Dou Qi flowing in his body was obviously much more active and joyous compared to before.</p><br/><p>Xiao Yan slowly walked another few hundred meters. He wiped away the perspiration on his forehead and licked his somewhat dry lips. Retrieving a bottle of water from his storage ring, he viciously took a few gulps before sighing. Xiao Yan then took out the goatskin map and bitterly smiled, “Teacher, during this half a day, we did not follow the route on the map. Since we did that, it could be considered that we have avoided the main road on here. Where do we go next ?”</p><br/><p>“Ah… then we will first head towards the eastern flame symbol.” Yao Lao randomly said.</p><br/><p>Hearing this, Xiao Yan held the map and studied it for a while. He pressed his eyebrows together and sighed, “Looking at the map scale indicator, it looks like we will need to journey for at least ten more days if we want to get to the region indicated by the eastern flame symbol…”</p><br/><p>“Hee hee, then let’s go… In this desert, even walking can be considered a form of training!” Seeing Xiao Yan’s bitter face, Yao Lao laughed in a gloating manner.</p><br/><p>Sighing once again, Xiao Yan stared at the huge sun in the desert sky. He opened and closed his mouth before returning the map to his storage ring. Touching the Heavy Xuan Ruler on his back with his hand, he could not help but smile with joy. It was strange. Although this Heavy Xuan Ruler was extremely big, it still remained cool even under the extensive exposure to the hot sun. It was as though the sun in the sky did not have much impact on it. In this way, Xiao Yan did not need to think too much. After all, if someone told him to carry a red hot searing piece of metal and walk about, he would definitely not do such a foolish thing…</p><br/><p>Once again Xiao Yan wiped his perspiration off. He was just about to turn his body toward the eastern side of the desert when his face changed. His palm grabbed the heavy ruler, drew it, and viciously stabbed it into the yellow sand under him.</p><br/><p>“Hiss!” A loud shrill immediately rang out from where his heavy ruler was inserted into the ground. Xiao Yan was expressionless as he pulled out the heavy ruler. A pool of bright red blood began to seep up to the surface of the yellow sand, staining it red. As Xiao Yan waved his sleeve gently, a force lifted a small sized Magic Beast from under the yellow sand.</p><br/><p>Xiao Yan glanced indifferently at this Magic Beast which had lost its life force. This kind of Magic Beast was known as the Yellow Sand Magic Scorpion and could only be encountered in the desert. These things frequently hid themselves within the yellow sand, awaiting someone to voluntarily step on them and then they would release a poison liquid that would numb or even kill the target. The Magic Scorpions were also extremely good at hiding. Even some humans who spent most of their time in the desert would occasionally fall into their traps. Thus, this Magic Beast which was not even rank one was frequently regarded by people as one of the hardest living creatures to deal with in the desert.</p><br/><p>Regardless of how good the Magic Scorpions were at hiding, they shone as bright as fireflies in the dark night under Xiao Yan’s exceptional Spiritual Perception. If one wanted to launch a sneak attack… it was basically impossible.</p><br/><p>Xiao Yan’s gaze swept across the Magic Scorpion. He then took two steps forward and cut off its poison stinger which he then stored in his storage ring. After which, he stood up and took somewhat heavy footsteps as he began to slowly walk toward the eastern side of the desert.</p><br/><p>The dullness and the harshness of training in the desert once again exceeded Xiao Yan’s expectations. Back when he was training in the Magic Beast Mountain Range, he did not feel overtly lonely. However, in this vast desert, all that was in his sight were a few sandstorms raging. Forget about people, even the shadow of a Magic Beast was something that was hard to find. This kind of desolate and lonely feeling was a little difficult to bear.</p><br/><p>The second day after Xiao Yan stepped into the Tager Desert was also the official start of his training. Under Yao Lao’s instruction, Xiao Yan only wore knee length shorts on his body while his upper body was simply naked.</p><br/><p>Regarding this image of his, Xiao Yan had thought of protesting but this was directly rejected by Yao Lao. The latter’s reasoning was that only by letting the naked skin be exposed to the sun could his body effectively absorb the fire type energy contained within the air.</p><br/><p>……</p><br/><p>On the endless gold colored desert, a figure wearing shorts with a naked back was clenching his teeth as he laid on the hot yellow sand. Beside him, a somewhat blurry old man was smiling while holding a small jade bottle that was filled with a red colored liquid. The mouth of the bottle was slowly tilted as a few drops of red colored liquid were poured on the back of the young man whose skin had turned a little brown from the sun.</p><br/><p>“Hiss…” As the red liquid dropped onto Xiao Yan’s back, he tightly clenched his teeth as he released a thread of cool air. His pair of hands tightly grabbed some yellow sand, not caring if the sand was hot.</p><br/><p>“Applying this ‘Burning Blood’ in the desert has a much greater effect compared to being in the Magic Beast Mountain Range. Although this thing's a little hard to prepare, its effect is indeed quite good. In the desert, it can cause the skin to be even more sensitive to the fire type energy in the air outside. When you train, it has the ability to get a more benefits for less effort.” Gently scraping the red colored liquid with a piece of jade, Yao Lao watched the young man who was tightly clenching his teeth and enduring it. An apologetic smile flashed in his eyes as he softly explained.</p><br/><p>Xiao Yan opened his mouth and grinned but his smile was extremely ugly. He muttered with a smile, “It’s alright. Just do it. Anyway, I am becoming used to it these days. I don’t have many good points but I am extremely adaptable. Hee hee, my life is even tougher than a cockroach’s life.”</p><br/><p>“But these few days of training has had quite a good effect. I can already feel that the Dou Qi in my body is advancing toward the peak of a one star Dou Shi.” Wiping his palm on the yellow sand, Xiao Yan said excitedly.</p><br/><p>“Haha.” Nodding his head with a smile, Yao Lao said in a soft and even voice, “Alright. Enter your training mode. Now is the most appropriate time to train. Don’t waste these conditions…”</p><br/><p>Hearing this, Xiao Yan hurriedly nodded his head. He stopped talking nonsense as he continued to lay with his back to the sun and his front stuck to the searing hot yellow sand. A Dou Qi mask covered his face and like an ostrich, he buried his head into a hot pile of sand.</p><br/><p>Xiao Yan’s current strange training position was something Yao Lao had specially instructed. The reason for it was because despite the rich fire type energy being present everywhere, the fire type energy in the yellow sand, which had saturated after being exposed to the sun for an entire day, was much purer. This was how Xiao Yan ended up with this strange ostrich training position…</p><br/><p>After burying his head into the yellow sand, Xiao Yan’s senses gradually became still. The surrounding sound of the raging sandstorms were also annihilated. His mind gradually entered into his body. Under the observation from his mind’s eye, Xiao Yan could see that under exposure to the hot sun, the ‘Burning Blood’ liquid which was applied on his back, was swiftly invading his body. Although the searing pain during this time caused his skin to involuntarily convulse, the pure fire type energy continued to give Xiao Yan a pleased feeling as he looked for joy in his sorrow.</p><br/><p>With the stimulation of the ‘Burning Blood’ on Xiao Yan’s skin, the already rich fire type energy in his surroundings seemed to have found a container as it continued to pour into Xiao Yan’s body. After being promoted to a Dou Shi, Xiao Yan could already appropriately arrange these energies pouring into his body without spending too much effort.</p><br/><p>Xiao Yan controlled this fire type energy through a few Qi Paths and then poured it into the purple colored vortex in his lower abdomen after being refined.</p><br/><p>The training was slowly conducted under this harsh and lonely manner. When the ‘Burning Blood’ on Xiao Yan’s back was finally dispersed, a small drop of purple colored liquid finally congratulated within the vortex.</p><br/><p>The small purple colored liquid flowed happily within the vortex, much like a small fish in a lake, agile and active.</p><br/><p>Xiao Yan’s mind observed the newest small drop of purple colored liquid as he smiled. After this period of observation, he had faintly calculated that when the vortex had reached fifteen small drops of liquid, he would achieve the strength needed to be promoted to be a two star Dou Shi. Currently, there were already thirteen small drops of purple colored liquid within the vortex. In other words, once two other small drops of purple colored liquid were congregated, Xiao Yan should be able to be promoted into a two star Dou Shi!</p><br/><p>“Soon…” Xiao Yan silently whispered in his heart. His head looked up abruptly as he ruthlessly shook the yellow sand from his head. After which, he jumped from from the sand’s surface, faced the sky and shouted, “Soon! Two star Dou Shi!”</p><br/><p>Standing on one side, Yao Lao watched Xiao Yan loudly shouting, venting the feelings in his heart. He smiled slightly and muttered softly, “Boy, although your training talent is quite good, your effort is most crucial to success… I really await the Three Year Agreement in a few months time. Back then, she gave you a humiliation that was difficult to erase. Now, you are already qualified to recover it...”</p><br/><p>Slowly raising his head, Yao Lao watched the enormous sun. After which he tilted his head and watched the young man’s back which was as thin as a stick. He suddenly smiled faintly.</p><br/><p>“Although this training is very tough, you have not given up. All of these successes were exchanged with your effort and sweat. I believe that in the future you will be able to stand at the peak of the Dou Qi continent!”</p><br/>\n</div>"}