{"title": "Chapter 184: First Meeting With the Snake-People, Initial Show of a Dou Shis Power", "id": 184, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-184-first-meeting-with-the-snake-people-initial-show-of-a-dou-shis-power", "volume_title": "Volume 2", "body": "<h1>Chapter 184: First Meeting With the Snake-People, Initial Show of a Dou Shis Power</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 184: First Meeting With the Snake-People, Initial Show of a Dou Shi’s Power</u></strong></p><br/><p>The sudden appearance of a young man with a naked upper body caused both sides to be a little stunned. A moment later, however, the side with the mercenaries gradually became calm. Since the one who arrived was a human, they believed that he would at the very least not help the Snake-People.</p><br/><p>The group of Snake-People, upon seeing Xiao Yan, this uninvited guest, became furious. The triangle-shaped pupils of the Snake-People’s leader coldly swept toward Xiao Yan. Without saying anything he waved his hand and two five star Dou Zhe Snake-People swung their tails and charged at Xiao Yan with fierce expressions.</p><br/><p>Lifting his eyes, Xiao Yan gently sniffed the faint fishy wind that was blowing toward him. He frowned slightly, then slowly grabbed the hilt of the Heavy Xuan Ruler. After raising his leg gently, he abruptly stomped down and his body suddenly went from being static to moving rapidly. Under everyone’s gazes, a human figure swiftly interlocked with and then passed by the two Snake-People like lightning.</p><br/><p>“Bang, bang!”</p><br/><p>Just after the figures crossed each other, Xiao Yan’s body suddenly paused. The two Snake-People with fierce expressions were dragged along the sand’s surface as they shot backwards, seemingly having received a heavy blow. As they were thrown backwards, a mouthful of fresh blood was violently vomited out from each of them.</p><br/><p>The palm of Xiao Yan tightly holding the hilt of the Heavy Xuan Ruler relaxed slightly as Xiao Yan licked his lips and moved his gaze to the two Snake-People, who were sent flying for dozens of meters by the heavy ruler. Having received such a heavy blow, even if they did not die, they would end up seriously injured.</p><br/><p>“Hiss…”</p><br/><p>From the time Xiao Yan and the the Snake-People crossed each other till the time the Snake-People vomited blood and retreated, only a short ten seconds had passed. However, in these ten seconds, the victor was determined.</p><br/><p>Watching Xiao Yan with his thunderbolt-like attack, the ten mercenaries had their mouths wide open. Their faces were filled with astonishment as they stared at the young man’s back with stunned eyes. It was difficult for them to imagine how this thin frame managed to hide this kind of terrifying strength within it.</p><br/><p>“This guy… how violent.” Opening her red mouth as she stared at Xiao Yan, who had sent the two Snake-People flying as though he was wrecking houseflies, that sexy lady involuntarily muttered.</p><br/><p>“Hee, Xue Lan, are you alright?” On the sand dune, the man’s face was filled with excitement as he dragged his wounded leg and carefully walked around the few snake-people before coming to the Mercenary Troop and smiling at the lady.</p><br/><p>“Dan Zi… didn’t you return to Rock Desert City to get us reinforcements? Why are you still here?” Seeing the man, the sexy lady called Xue Lan straightened her eyebrows and scolded.</p><br/><p>Being scolded by the lady, Dan Zi could only let out a bitter laugh. He pointed to Xiao Yan’s back and said, “Yes, isn’t this reinforcement?”</p><br/><p>“Him?” Hearing this, Xue Lan momentarily stilled. Her gaze returned to Xiao Yan, frowned and cautiously said, “He doesn’t appear to be a member of our Desert Metal Mercenary Company. How did you manage to get him to help? What condition did he ask for?”</p><br/><p>“I don’t know him either. I met him just now when I fell. Originally, I wanted to ask him to go to Rock Desert City to send a message…” Having said to this point, Dan Zi’s face appeared a little embarrassed. “At first, he ignored me. But when I said that I am a member of the Desert Metal Mercenary Company, he suddenly became warm. He even gave me an antidote and healing medicine…”</p><br/><p>“Does he have some relationship with our Desert Metal Mercenary Company?” Xue Lan’s narrow hand gently swept the black hair on her forehead that had been contaminated by her sweat. Her unintentional loveliness caused the obscene glint in the eyes of one of the Snake-People close by to rise.</p><br/><p>“But I have never heard our Company Leader mentioning that they knew such a strong person of such a young age. Looking at the strength of his earlier attack, he should at least be an eight star Dou Zhe or stronger.” Xue Lan knitted her eyebrows together and said suspiciously.</p><br/><p>“I don’t know either.” Dan Zi smiled bitterly, shook his head and said, “ But I don’t think he has any ill intentions. Otherwise, why would he take the risk to come and save us?”</p><br/><p>“Ugh… but whether he can save us remains a question. Among this group of Snake-People, there are three nine star Dou Zhes. At the end, he might fail to save us and end up losing his life too.” Xue Lan shook her head and said in a worried voice.</p><br/><p>Hearing this, Dan Zi stilled for a moment before laughing awkwardly, “I think… he should be able to handle it. After all, I had told him of the strength of the Snake-People. If he did not have the confidence, why would he come?”</p><br/><p>“Do you want to tell me that that he is a Dou Shi?” Xue Lan shook her slightly curled black hair and helplessly said.</p><br/><p>“This…” Dan Zi opened and closed his mouth but said nothing. Although he looked highly upon Xiao Yan’s strength but a Dou Shi… Xiao Yan’s age was his sore spot. Becoming a Dou Shi before a person was twenty? How was this possible?</p><br/><p>“Ugh. Hopefully he has some hidden cards…” Dan Zi bitterly smiled and shook his head. He could only comfort himself in this manner.</p><br/><p>Xue Lan frowned as she mused for a while. She could only listlessly shake her head. With the current situation, she could only pray that the young man in front of her could display an unexpected performance.</p><br/><p>Seeing that Xiao Yan had easily wounded two of his subordinates, the triangle eyes of the snake leader shrank slightly. His scarlet snake tongue gently extended and shrunk before he said in a thick voice, “Human, offending us Snake-People in the Tager Desert is not a wise choice!”</p><br/><p>Xiao Yan smiled faintly, tilted his heavy ruler and did not respond.</p><br/><p>“If you know what’s good for you, I advise you to leave now. I can forget about the wrong you did by harming my subordinates!” The eyes of the leader of the group of Snake-People were filled with coldness, His words, however, carried fear and a faint malice. Clearly, Xiao Yan’s attack a moment ago caused him to not dare to underestimate Xiao Yan.</p><br/><p>“Sorry…” Xiao Yan smiled and shook his head. The simple word held a tone that bore no room for negotiation.</p><br/><p>“You seek death!” Being rejected by Xiao Yan, bloodlust surfaced on the extremely small snake scale on the Snake-People leader’s face. He waved his hand and coldly said, “Attack together. Kill him! Catch the women and bring them back to enjoy!”</p><br/><p>“Hiss!” Hearing their leader’s order, the surrounding Snake-People hesitated briefly before extending their snake tongues; they held their sharp snake spears and charged at Xiao Yan together.</p><br/><p>“The wounded, stay and wait for orders. The others, follow me and attack!” Seeing that the Snake-People intended to attack together, Xue Lan, who was behind, straightened her eyebrows vertically, waved her delicate hand and coldly ordered.</p><br/><p>“There’s no need. All of you wait there or you might get in the way.” Hearing the commotion from behind, Xiao Yan frowned. He helplessly tilted his head and blandly said.</p><br/><p>“You…” Hearing this, Xue Lan, who had just drew her weapon and charged forward immediately paused. Her eyebrows were vertical. This was the first time she was looked down upon to such an extent. She was just about to scold when she suddenly remembered the person in front was their only reinforcement. Instantly, she could only stomp her feet angrily. After which, she angrily stared at Xiao Yan, hugged her hands on her full chest and took a step back. She coldly eyed Xiao Yan and mumbled in her heart, “Acting strong at such a young age.”</p><br/><p>However, the cold stare Xue Lan gave did not last for very long before it was slowly overcome by shock. Of course, the other mercenaries behind her also expressed shock for the same reason.</p><br/><p>A short distance away from them, the young man stood still while carrying a heavy ruler. He mused for a moment before a faint purple colored Dou Qi cloak gradually covered his entire body. On the outside of this Dou Qi cloak, were purple colored flames lingering and occasionally soared upwards, appearing very mysterious.</p><br/><p>“Hiss…” Seeing the purple colored energy cloak on the young man’s body, everyone present took in a quick cool breath.</p><br/><p>“This… Dou Qi cloak? He really is a Dou Shi?” Widening her pretty eyes, Xue Lan stared at the back of the figure in front of her that was wrapped within a purple colored Dou Qi. Her face was filled with disbelief.</p><br/><p>“...” Everyone was speechless as they faced one another.</p><br/><p>“What an abnormal person… to actually be promoted to a Dou Shi at such a young age. It should be known that the two company leaders are only five star Dou Shis.” Dan Zi opened his mouth wide as he muttered dully with an expression as though he had seen a ghost.</p><br/><p>“No wonder he dared to rush over by himself… he was actually a Dou Shi.” One of the mercenaries let out a sigh and bitterly laughed. His voice carried envy to Xiao Yan and joy from having escaped a close encounter with death.</p><br/><p>“Where did this guy appear from? I have never heard of such an abnormal young man appearing in any of the cities nearby.” Xue Lan frowned as she whispered.</p><br/><p>“No idea…” Regarding this question, the surrounding people similarly shook their heads.</p><br/><p>Seeing the situation, Xue Lan also helplessly smiled. With a bitter smile, she said, “Forget it. Regardless of where he came from, we appear to be lucky to be saved.”</p><br/><p>When Xiao Yan summoned the Dou Qi cloak, the Snake-People who were charging over were clearly thrown into a mess. It appeared that they also understood very well what being able to summon a Dou Qi cloak represented.</p><br/><p>Dou Shi! That was an entirely different class from a Dou Zhe. If one did not possess some ridiculously powerful Dou Technique as one’s trump card, it was basically impossible to win a challenge across the classes. As for abnormally strong Dou Techniques and Qi Methods...would one expect these Snake-People who did not appear to live very well to have them?</p><br/><p>Thus, this would be a completely one-sided battle!</p><br/><p>After summoning the Dou Qi cloak, Xiao Yan gently let out his breath. He tightly gripped the Heavy Xuan Ruler and faced the Snake-People who had begun to panic. The corner of his mouth curled into a cold smile as his feet stomped onto the ground. Following an explosive sound, Xiao Yan’s body was stuck to the sand’s surface as he shot out.</p><br/><p>“Bang!” Xiao Yan appeared in front of a nine star Dou Zhe Snake-Person. With cold eyes, he raised the heavy ruler that carried a ferocious force as he violently smashed it on the other party’s chest. Instantly, a soft muffled noise sounded. The snake-person’s eyes shrunk as he violently threw out a mouthful of fresh blood from his damaged internal organs. At the same time, his body shot backwards like a cannon ball and crashed into a sand dune.</p><br/><p>In an instant, a nine star Dou Zhe received a fatal blow from Xiao Yan without even having the time to use his Dou Techniques. From this, it could be seen just how much simpler it was for Xiao Yan now to handle a Dou Zhe.</p><br/><p>Having killed a nine star Dou Zhe in the blink of an eye, Xiao Yan’s body abruptly turned and once again appeared in the middle of a few Snake-People whose strength were around four to five star Dou Zhes. The heavy ruler that he carried had become like a racket, beating the few Snake-People who were attempting to flee till they were sent flying as they vomited blood.</p><br/><p>Seeing that the Xiao Yan’s “solo”, Xue Lan and the mercenaries could only stare with stunned faces. Even if Xiao Yan was a Dou Shi, it should not have been possible for him to kill the other party so easily. Regardless of how you put it, the other side had three nine star Dou Zhe. However, in this short encounter… they had already lost one nine star Dou Zhe and a few other ordinary Snake-People, this…</p><br/><p>Exchanging glances with totally stunned faces, everyone could only sigh and shake their head. The strength of this guy appeared to be much stronger than an ordinary Dou Shi.</p><br/><p>Seeing that in just a few short exchanges, his side had suffered serious losses, a bloodthirsty sinisterness surfaced in the eyes of the leader of the Snake-People. He exchanged a glance with the other nine star Dou Zhe Snake-Person. Fierce expressions appeared on their faces as they tightly held the sharp snake spear, swung their snake tail on the sand’s surface and formed an crisscrossed as they charged angrily at Xiao Yan.</p><br/><p>Seeing the pair’s familiar coordination, it was obvious that this had been obtained from a long period of training. The two snake spears extended and withdrew strangely and at the tip of the snake spears, a faint crimson color appeared and disappeared. It was clear that poison was applied to the spear.</p><br/><p>After sending the last snake-person flying with the heavy ruler, Xiao Yan felt the dense cold forces rushing at him from his back. He shifted his heavy ruler to his back and blocked the two tricky stabs from the snake spears with a ‘clang’ sound.</p><br/><p>“Puff!” Seeing that their attacks were blocked, the two snake people abruptly opened their mouths in unison without prior agreement. Two smelly quiet green vapors swiftly shot toward Xiao Yan.</p><br/><p>“Be careful of the snake poison!” Seeing the actions of the two snake-people, Xue Lan’s pretty face changed slightly as she hurriedly shouted.</p><br/><p>As Xue Lan’s voice died down, the Dou Qi cloak outside Xiao Yan’s body surged quickly and covered all of Xiao Yan’s body within it. Any green colored poison gas that came into contact with the Purple Flame Cloak was burnt into nothingness and gradually disappeared in the air.</p><br/><p>Resisting the poison gas attack with an indifferent expression, Xiao Yan feet suddenly stomped and in an instant, his body appeared in front of the leader of the Snake-People present. His heavy ruler was swiftly raised and then violently hacked onto the leader’s head.</p><br/><p>The Snake-People leader’s expression changed drastically when Xiao Yan passed through the poison attack and came close to him. At the point of crisis, his snake tail suddenly swerved about strangely. Following a strange ‘Sho sho’ sound, his body slithered like a snake as he retreated for tens of meters, narrowly dodging Xiao Yan’s fatal blow.</p><br/><p>After evading Xiao Yan’s attack, the leader of the group of Snake-People still felt insecure. His snake’s tail swiftly swung around and his body quickly retreated.</p><br/><p>However, he had only maintained this for a few seconds when an unusual ferocious suction force surged out of Xiao Yan’s palm a short distance away. Instantly, the unprepared leader of the group of Snake-People was sucked and flew toward Xiao Yan.</p><br/><p>Lifting his head to watch the Snake-People leader flying at him with a horrified face, Xiao Yan let out a cold smile. He once again violently stepped on the ground. Like a huge fabulous bird, his body swiftly climbed above the snake-person’s head. Then, the heavy ruler in his hand suddenly smashed downwards.</p><br/><p>“Bang!” Fresh blood accompanied by brains rained down from the sky to the ground. A body swiftly descended, finally smashing into the yellow sand. A moment later, the pit formed in the yellow sand slowly disappeared under the flow of the sand.</p><br/><p>Seeing that the leader had died, fear appeared on the face of last nine star Dou Zhe Snake-Person. He let out a few sharp neighing crys, swung his snake tail and swiftly fled toward the inner regions of the desert. After having finished off the Snake-People leader, Xiao Yan’s body rotated in midair. Borrowing the force from the rotation, the Heavy Xuan Ruler abruptly left his hand and shot toward the Snake-Person fleeing.</p><br/><p>“Pu Chi…” The heavy rule sped through the air like lightning and swiftly chased after the snake-person. Finally, it shot through his neck and was accompanied by bright red blood as flew into the yellow sand, leaving only the hilt outside.</p><br/><p>Xiao Yan’s feet landed heavily on the sand’s surface and sunk half a foot deep into the sand as he let out a breath gently. After which, he slowly walked toward the Heavy Xuan Ruler, grabbed the ruler’s hilt with his palm and pulled it out.</p><br/><p>After wiping off the fresh blood on the ruler with gauze, Xiao Yan carelessly replaced it into the sheath on his back before slowly walking toward the ten plus mercenaries who were frozen in shock.</p><br/><p>“Hey, are you alright?” When he had walked closer, Xiao Yan stood in front of the sexy lady and asked with a smile.</p><br/><p>“We’re… we are alright.” Sweeping her gaze across the naked upper body of Xiao Yan, Xue Lan did not reveal any shy expressions due to this. In this desert, the women were much more open-minded. Moreover, she also frequently mingled within the mercenaries, so she did not have the shyness and reservations of those gentler ladies. Seeing the naked upper body of a man did not cause her pretty face to blush.</p><br/><p>“You…” Xue Lan blinked her eyes before saying with a smile to Xiao Yan, “Regardless of your intention in helping us, I will have to say thank you. Otherwise, our fate… I’m Xue Lan, the leader of this small group. At the same time, we are a team of the Desert Metal Mercenary Company.”</p><br/><p>“Xiao Yan” Xiao Yan said as he smiled and nodded.</p><br/><p>“Xiao Yan? This name seems familiar. Where have I heard it?” Hearing the name, Xue Lan frowned slightly. She thought for awhile in her heart but did not manage to get anywhere. After helplessly shaking her head, she raised it and smiled toward Xiao Yan. “Where do you plan to go next? If you have the time, I would like to invite you to Rock Desert City. Our Desert Metal Mercenary Company clearly differentiates between those that help us and those who are our enemies. You have helped us. We will definitely return this favor!”</p><br/><p>“The Rock Desert City isn’t far from here. It is only around half an hour journey away and will not delay too much of your time.” Seemingly afraid that Xiao Yan would reject, Xue Lan hurriedly added.</p><br/><p>Hearing this, Xiao Yan smiled and nodded. Since he had arrived at Tager Desert, he would naturally have to visit the two brothers of his that he had not seen for a long time. Although they had been busy with their careers in the last few years and had seldom gone home, the many years of brotherly relationships still caused Xiao Yan to have deep feelings for them. Within Xiao Yan, other than his father and Xun Er, the two brothers of his were the ones who gave him most care when he was young.</p><br/><p>“I wonder how Xun Er that girl is doing… it’s been one year ah.” In his memory, a elegant young lady in green suddenly surfaced in Xiao Yan’s heart without any warning. Her gentle frown and smile all caused Xiao Yan to quiver.</p><br/><p>During the one year, the tough training took up most of Xiao Yan’s time. Only now did his thoughts suddenly awaken and he got a taste of missing someone. He slowly let out a breath and raised his head. In the slightly distorted air, he saw a young lady’s small hand on her back while her agile body caused Xiao Yan to have the sudden urge in his heart to immediately end his training and head to Jia Nan Academy…</p><br/><p>Xiao Yan trembled as soon as he realized what he was thinking. Violently shaking his head, he suppressed it deep into his heart. That girl had far too many secrets. If he did not work hard to strengthen himself, he would likely die of feeling inferior in front of her.</p><br/><p>After coming out and gaining experience for such a long time, Xiao Yan also understood just how precious a Xuan Class Qi Method was. It should be known that back then, Xun Er could carelessly take out a High Xuan class Qi Method. From this, Xiao Yan gained a better feel of how great and mysterious her identity and background was.</p><br/><p>Moreover, Xiao Yan had personally experienced Xun Er’s training speed. In this one year, he did not know to what level that girl might have leapt to. It was possible that her level would be higher than his current level.</p><br/><p>“Ugh, I wonder how her life is like at the Jia Nan Academy. But with that girl’s looks and demeanor… it was likely she would have many admirers. With Xun Er’s indifferent character… there should not have been any man who would interest her, no?” Rubbing his nose, Xiao Yan opened his mouth and gave a narcissistic smile. Each time he thought of this question, he would rejoice. He rejoiced that back then, he had accidentally and ridiculously caught the heart of this girl.</p><br/><p>“But… it was a pity to see. Back when I was young, I was still trying to see if Dou Qi was really inside my body. At that age, how would I know anything about warming the Qi Paths… but why did I try for so many years? … Don’t tell me that back then I already had ulterior motives toward Xun Er? How can it be…” Some extremely ridiculous questions suddenly appeared in his heart, causing Xiao Yan to be a little frustrated as he mumbled.</p><br/><p>Xue Lan tilted her head and eyed Xiao Yan who had suddenly become silent beside her. At the same time, his face continued to change, causing her to feel a little stunned. A long while later, she finally took the chance and asked, “Hey? Are you alright? Have you been poisoned?”</p><br/><p>“Ah? Oh… ke ke. Sorry, I was distracted. I’m fine.” Waking up from his memories, Xiao Yan first stilled. He watched the surrounding people who were staring at him and could not help but shake his head apologetically.</p><br/><p>“If you are alright, why don’t we set off for Rock Desert City now? What do you say?” Xue Lan tilted her head and asked Xiao Yan.</p><br/><p>“Haha, alright.” Xiao Yan smiled and nodded his head.</p><br/><p>“Fei Gao, go pull out the camel carriage.” Seeing Xiao Yan nod his head, Xue Lan turned around, waved at one of the mercenaries and ordered.</p><br/><p>“Okay.” One of the mercenaries smiled and nodded. After which, he swiftly went into a sand dune not far away and pulled out a camel carriage and brought it over. Xiao Yan realized that on the box at the back of the carriage, there were two tier one Magic Beast corpse. Seeing the fresh blood that had yet to thicken on the corpse, this should be the quarry of Xue Lan and her small group. The size of this kind of desert carriage was not very big and thus the Magic Beast corpses left no room for people to ride in the carriage.</p><br/><p>“You will first bring the thing back to Rock Desert City. Report what happened here to the Company Leaders.” Waving her hand to the mercenary driving the carriage, Xue Lan gave an order in a well practiced manner.</p><br/><p>“Hee hee, alright. I believe that the Troop Leaders will be very happy to meet a new friend.” The mercenary gave Xiao Yan a friendly smile before kicking his feet on the camel’s backside. He swiftly headed to Rock Desert City with the quarry.</p><br/><p>Seeing the carriage that was swiftly disappearing from sight, Xiao Yan gave a smile. He carelessly took out a garment from the storage ring put it on his body and led the way toward the direction the carriage headed in.</p><br/><p>Noticing that Xiao Yan had moved, Xue Lan hurriedly hastened her subordinates.</p><br/><p>“Group leader, do you have the feeling that Xiao Yan and the two Company Leaders… appear somewhat similar?” Staring at Xiao Yan’s back, Dan Zi suddenly said after packing their things.</p><br/><p>“Uh?” Hearing this, Xue Lan stilled. Her gaze shifted to Xiao Yan’s back. A moment later, her heart suddenly moved violently. In a soft voice, she said, “I seem to recall the Company Leaders saying that they had a younger brother, right?”</p><br/><p>“Uh… I also remember. It was that one whose strength had strangely continued to hover below that of a Dou Zhe?Hehe.”</p><br/><p>“The company leader’s younger brother… seems… to also be called… Xiao Yan?” Xue Lan blinked her long eyelashes as her fragrant tongue licked her red lips. She recalled her memories of this company leader brother and a moment later, astonishment gradually covered her pretty face.</p><br/>\n</div>"}