{"title": "Chapter 196: Two-Headed Flame Spirit Serpent", "id": 196, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-196-two-headed-flame-spirit-serpent", "volume_title": "Volume 2", "body": "<h1>Chapter 196: Two-Headed Flame Spirit Serpent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 196: Two-Headed Flame Spirit Serpent</u></strong></p><br/><p>“What do we do now? With this creature guarding, you don’t have a chance to enter.” Sitting beside Xiao Yan, Xiao Ding asked with a bitter smile.</p><br/><p>Xiao Yan sighed gently. He placed an ‘Energy Recovery Pill’ into his mouth. His throat rolled as he swallowed it. After musing for awhile, he said softly, “Regardless of what happens, I must get my hands on this ‘Heavenly Flame’. I know how difficult it is to obtain a ‘Heavenly Fame’ so I’m already mentally prepared. The difficulty now does not exceed the level which I can bare.”</p><br/><p>“You still want to try? Seeing the attacking strength of that two-headed snake, its strength should be around that of a rank four Magic Beast, which is equivalent to the strength of a Dou Ling. Moreover, this place is filled with hot magma. Even if a Dou Wang were to come here, he or she would have difficulty in killing it!” Hearing Xiao Yan’s words, Xiao Ding frowned and said gravely.</p><br/><p>“Hehe, if this beast wants to block me, then I’ll have to kill it...” Xiao Yan laughed softly. A thick icy expression surfaced on his face. His eyes stared intently at the huge two-headed snake in the magma lake. He tightened his fist, slowly closed his eyes and gradually recovered the large amount of Dou Qi he had exhausted while fleeing earlier.</p><br/><p>Seeing that Xiao Yan did not show any intentions of giving up, Xiao Ding could only shake his head helplessly. Although he knew that Xiao Yan had many hidden cards, the chances of successfully beating this two-headed snake, which was unaffected by the magma, in this environment was basically nothing in Xiao Ding’s eyes.</p><br/><p>Seated in this tunnel, Xiao Ding stared blankly at the magma world outside. He started thinking of ways in which he could pull this bull-headed Xiao Yan out.</p><br/><p>On one side, Qing Lin also carefully sat cross-legged by Xiao Yan’s side. When her dark green eyes swept across Xiao Yan’s skin which was grilled red, sadness could not help but flash in her eyes.</p><br/><p>As the three of them gradually became quiet. The explosive movement of the magma lake also calmed down. When the exploding magma pillars calmed down, the two-headed snake which had been scanning all around, finally focused its gaze onto the tunnel. When its gaze found the three people in the tunnel, an excited bloodthirsty screech suddenly sounded inside the hot crypt.</p><br/><p>“This is bad. It has discovered us!” Within the tunnel, Xiao Ding involuntarily cried out as he stared at the savage gaze the two-headed snake was giving them.</p><br/><p>As Xiao Ding said those words, the two-headed snake swung its two huge heads. An instant later, a hot magma column suddenly shot toward the tunnel. From the looks of it, if it shot into the tunnel, the three people within it would be devoured by the high temperature magma in the blink of an eye.</p><br/><p>The hot magma column was like a savage fire dragon and it shot directly towards the tunnel at a dangerous angle.</p><br/><p>Just as Xiao Ding planned to grab Xiao Yan, turn around and run, Xiao Yan, who had his eyes tightly closed suddenly opened them. A profound and much more experienced look gradually surfaced within his dark black eyes. Xiao Yan watched the hot flame pillar indifferently as he gradually stood up. He swayed a little and then mysteriously appeared at the exit of the tunnel.</p><br/><p>Seeing the frightening speed that Xiao Yan suddenly displayed, Xiao Ding’s expression changed. His gaze stared intently at the former’s back and a strange feeling surfaced in his heart without reason. This feeling… was as though the Xiao Yan in front of him had suddenly become another person.</p><br/><p>The odd feeling in his heart caused Xiao Ding to frown deeply. His heart clearly felt that something was different but he could not point out exactly what it was…</p><br/><p>As Xiao Ding behind him was deep in thought, Xiao Yan slowly lifted his palm. He suddenly clenched his fist.</p><br/><p>Following the clenching of his fist, a strange shapeless energy ripple was scattered from his palm and instantly formed a colorless energy cover over the tunnel entrance.</p><br/><p>The magma column shot over and when it was approximately ten meters from the tunnel’s exit, it suddenly burst apart without warning. The magma spread in all directions and slowly flowed down. Finally, it turned the colorless cover into a fiery red color.</p><br/><p>“A ‘Two-Headed Flame Spirit Serpent’ usually lives in places of extreme heat and relies on its consumption of magma to live. It has an extremely large potential for evolution. When it is just born, it is a rank one Magic Beast. If it was lucky enough, it may be able to evolve into a rank six Magic Beast which is comparable to a Dou Huang. Tsk tsk. Quite the strange creature. Looks like this place does indeed have traces of a ‘Heavenly Flame…” Seeing the two-headed snake creating a huge stir in the magma lake, a faint laughter came out as a soft mumble from Xiao Yan’s mouth…</p><br/><p>“Hiss!” Seeing that its attack was blocked, the Flame Spirit Serpent’s eyes clearly grew more agitated than before. It swung its huge tail, violently smashing toward Xiao Yan who was standing at the tunnel exit.</p><br/><p>The Purple Cloud Wings on Xiao Yan’s back flapped as he abruptly shot out, easily dodging the attack from the Flame Spirit Serpent.</p><br/><p>“Bang!” The huge tail, accompanied by an enormous shadow, violently smashed into the cliff wall. Instantly, an intense muffled noise sounded and numerous huge crack lines appeared on the rock wall and expanded like a spider web. They reached out for over ten meters before they gradually came to a stop.</p><br/><p>Floating in mid air, Xiao Yan’s hand slowly gripped the hilt of the Heavy Xuan Ruler on his back. He suddenly drew it and stepped on the air. Suddenly, his body appeared on top of the head of the Flame Spirit Serpent.</p><br/><p>Being exposed to the magma flame at such a close distance, Xiao Yan would have immediately fainted from the high temperature being emitted had it not been for Yao Lao controlling his body.</p><br/><p>The heavy ruler in Xiao Yan’s hand carried a ferocious explosive sound. On the body of the ruler, a turbulent purple colored Dou Qi slashed across the air, forming a huge purple colored arc that appeared extremely beautiful.</p><br/><p>“Bang!” The heavy ruler was like a thunderbolt that did not give the Flame Spirit Serpent any chance to react as the heavy blade smashed ferociously onto the snake’s head. Instantly, the hard fiery red scales were cracked open. Threads of bright red blood flowed out from the gap in the scales and dripped into the magma, turning into nothingness.</p><br/><p>“Hiss, hiss!” Receiving such a heavy blow to its head, the Flame Spirit Serpent let out waves of sharp hissing. Its huge tail thrashed about wildly above its head. Xiao Yan’s body was like a small boat in a storm amidst these violent actions. Although he appeared to be in a dangerous situation, he was still able to barely maintain the perfect equilibrium between life and death as he moved along with the snake.</p><br/><p>The Flame Spirit Serpent thrashing about intensely within the magma suddenly lifted its two huge heads. Its rhombus shape, huge eyes carried a savage bloodthirstiness as it stared intently at Xiao Yan who was repeatedly dodging everything in midair. It suddenly swung its head and a type of deep red flame soared slowly from its body. As the flame gradually rose, it began to permeate through the small space in an instant.</p><br/><p>The dark red flame slowly rotated in midair with Xiao Yan at its center.</p><br/><p>Staying in the same spot, Xiao Yan frowned as he watched the huge flame surrounding him. The temperature of this flame was not much lower than the Purple Flame from the Amethyst Winged Lion back then. Due to the support from the special environment around the dark red, somewhat blood colored, flame, its temperature was faintly showing a trend of surpassing the Purple Flame’s temperature…</p><br/><p>“It’s using its true strength...” Feeling the increasingly hot flame around, ‘Xiao Yan’ softly smiled and said, “Little boy, temporarily leave it to me. I’ll handle it.”</p><br/><p>Within the tunnel, which appeared to have a section destroyed, Xiao Ding and Qing Lin started with stunned expressions at the boundless blood colored flame that had permeated throughout the entire crypt. They involuntarily inhaled a mouthful of cold air. A battle at this level… was truly frightening.</p><br/><p>“Bang!” In an instant, the boundless dark, red flame suddenly began rotating swiftly. An intense fizzling sound echoed within the enormous crypt.</p><br/><p>Following the increased intensity of the rotation, the surrounding flame suddenly wiggled. Over ten Two-Headed Flame Spirit Serpents that were entirely agglomerated from flame energy suddenly surfaced from the flame.</p><br/><p>The ten Two-Headed Flame Spirit Serpent’s sizes were not much smaller than the actual snake’s size. Dozens of enormous savage eyes stared intently at Xiao Yan who was quietly staying in the middle. After they circled around Xiao Yan for a moment, they suddenly cried out in unison. The sharp sound wave reverberated within the crypt and was extremely ear-piercing.</p><br/><p>Following the sound wave, the ten plus Two-Headed Flame Spirit Serpents that were completely created from the hot flame suddenly formed a flame formation. After which, they carried a great amount of heat that was sufficient enough to cause the air to steam, as they charged at Xiao Yan from all directions.</p><br/><p>The ten plus huge creatures, roughly tens of feet long, danced and attacked within the crypt. The scene they created was extremely spectacular. Naturally, behind this spectacular scene, there hid a danger that was easily enough to kill a person.</p><br/><p>Lifting his eyes to watch the Two-Headed Flame Spirit Serpents that were charging from all directions, a faint smile appeared on Xiao Yan’s face. He actually slowly closed his eyes.</p><br/><p>“Bang!” With the sound of an earth-shattering intense explosion, the ten plus Two-Headed Flame Spirit Serpents simultaneously came into contact with each other at the middle. At the moment they came into contact, they suddenly exploded. The ferocious energy explosion turned into an energy ripple and began spreading outwards, shaking the magma lake, which had just calmed slightly, until it wildly rose once again.</p><br/><p>Within the tunnel, Xiao Ding watched the scene of destruction of the magma world in front of him with a dull expression. A paleness involuntarily appeared on his face. Under this kind of frightening attack that could destroy half of Rock Desert City, it was difficult for him to imagine that Xiao Yan could withstand it. He had never seen how strong someone of the Dou Wang level was but he did not think that even a Dou Wang would dare to foolishly meet the attack head on either.</p><br/><p>“This guy… what exactly is he doing?” Leaning on the somewhat hot rock wall, Xiao Ding sat on the ground with a defeated face.</p><br/><p>“Company Leader… Young Master… is still alive!” Just as Xiao Ding’s head was foggy, a surprised cry from Qing Lin suddenly sounded by his ear.</p><br/><p>Hearing this, Xiao Ding abruptly lifted his head. His gaze shifted to the boundless flames and found a young man’s figure appeared indistinctly at the spot where the energy was spreading.</p><br/>\n</div>"}