{"title": "Chapter 199: Under the Crypt", "id": 199, "volume": 2, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-199-under-the-crypt", "volume_title": "Volume 2", "body": "<h1>Chapter 199: Under the Crypt</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 199: Under the Crypt</u></strong></p><br/><p>The instant before Xiao Yan was about to enter the fiery red magma lake, a thick white flame suddenly flowed out from his body and wrapped around him.</p><br/><p>“Splash…” His body shot into the magma, causing the fiery red magma to splash in all directions.</p><br/><p>Hearing this sound, Xiao Ding and Qing Lin above hurriedly shifted their gaze toward the spot on the magma where there were some ripples. However, they did not see any human figure…</p><br/><p>“Where is he?” Watching the scene that suggested something had instantly vaporised, Xiao Ding involuntarily turned his head to Qing Lin by his side and shouted.</p><br/><p>“Ah?” Qing Lin took a small step back. Her face was pale as she eyed the calm magma lake. The person who had just jumped into it seemed to have instantly turned into ashes the moment he came into contact with the magma, without even letting out a scream.</p><br/><p>“Hiss…” A hissing sound from the Flame Spirit Serpent was suddenly emitted from the magma.</p><br/><p>Hearing this hissing sound, a joyful expression surfaced on Qing Lin’s face. Her gaze hurriedly swept across the magma. A human figure covered with a thick white flame suddenly surfaced from the magma and smiled as he waved toward Xiao Ding and Qing Lin above.</p><br/><p>“Thank goodness… luckily nothing happened.” Seeing Xiao Yan who appeared to disregard the surrounding hot magma, Xiao Ding finally and completely sighed in relief. His entire body sat on the ground with exhaustion as he wiped the cold sweat from his face.</p><br/><p>Xiao Yan watched the surrounding slow flowing fiery red magma with a surprised face as his whole body floated in the hot magma. A huge air bubble surfaced by his side, With a ‘bang’, it burst opened and some magma shot toward Xiao Yan’s face. However, in the blink of an eye, it was consumed by the layer of thick white flame.</p><br/><p>With his body protected by the layer of thick white flame, the temperature outside appeared to have been partitioned aside. A somewhat icy feeling hovered around his body instead of the heat that should have been present.</p><br/><p>Xiao Yan lifted some fiery red magma in his hand and allowed it to flow down from the gap between his fingers. He smacked his lips together in surprised. Being in contact with the magma at such close proximity gave his heart the creeps. If the flame covering him suddenly disappeared, then his ending…</p><br/><p>Thinking of the image of a grasshopper jumping and shriveling in a pan, Xiao Yan felt a chill as he shivered violently. His face had also become slightly paler.</p><br/><p>TL: Its a chinese dish where live grasshoppers are grilled</p><br/><p>“Little boy, hurry up. Although I can manipulate the ‘Bone Chilling Flame’ and temporarily protect you, it consumes a large amount of my Spiritual Strength. Once I lose the Spiritual Strength needed to maintain it, you will instantly be burnt to ashes by the Bone Chilling Flame even before the magma swallows you. Thus, stop wasting time. Before my Spiritual Strength is exhausted, you must leave this magma lake. Otherwise, the image of a grasshopper in a pan that you have thought of earlier would become reality.” When Xiao Yan was repeatedly sighing in shock, Yao Lao’s laughter suddenly sounded in his heart.</p><br/><p>“Yes.” With his mouth twitching a couple of times, Xiao Yan hurriedly nodded seriously. He turned around, eyed the huge Two-Headed Flame Spirit Serpent nearby and laughed, “Hey Big Head, lead the way.”</p><br/><p>Hearing Xiao Yan’s shout, the Flame Spirit Serpent simply ignored him. It shifted its head to face the tunnel’s exit and waited for Qing Lin to nod her head and issue an order before it unwillingly turned its body and dived into the magma.</p><br/><p>Seeing that the Flame Spirit Serpent caused circle after circle of ripples to form on the magma lake’s surface, Xiao Yan gently exhaled. After which, he dived into the magma and closely followed behind the Flame Spirit Serpent.</p><br/><p>Everything was fiery red within the magma. However, with the protection from the ‘Bone Chilling Flame’, Xiao Yan could vaguely see the environment around him. His gaze swept once around before he quickly moved his body and closely followed the Flame Spirit Serpent that was diving toward the deepest region of the magma.</p><br/><p>In the fiery red magma, the undercurrent surged. Occasionally, there would be a ferocious wave of magma undercurrent appearing from an unknown direction. These undercurrents contained an extremely large amount of energy. If one was hit, even a Da Dou Shi would end up being seriously wounded.</p><br/><p>However, Xiao Yan was lucky that the Flame Spirit Serpent was extremely familiar with the place. Before the undercurrents arrived, it would be able to find the most suitable route to sneak by. Xiao Yan, who was closely following behind it, also took the opportunity to successfully avoid these undercurrents from the magma.</p><br/><p>In this fiery red world, there did not appear to be any living creature other than the Flame Spirit Serpent. This was not surprising. After all, the requirements to survive here were too harsh. Besides that Two-Headed Flame Spirit Serpent which was a strange beast that relied on consuming magma to live, other Magic Beasts even the lord-like Magic Beast like the Amethyst Winged Lion, would not be able to freely move about in this kind of place without being affected by the environment.</p><br/><p>As Xiao Yan continued to head downwards in a never-ending manner toward the bottom of the magma, he could vaguely feel that the outside world’s temperature was multiplying even with the protection of the ‘Bone Chilling Flame’.</p><br/><p>Sensing this phenomenon, Xiao Yan involuntarily swallowed his saliva. His lips shivered slightly, appearing a little blue. People who had never experienced this kind of environment would have difficulty imagining the notion of swimming within magma. It was only a little different from dancing on the blade of the grim reaper…</p><br/><p>As he went deeper and deeper toward the bottom of the crypt, any slight mistake would mean that even with Yao Lao’s protection, Xiao Yan’s exceedingly frail life would be extinguished.</p><br/><p>While Xiao Yan was fearful and trembled for his insignificant life, the Flame Spirit Serpent still showed no sign of stopping. It did not turn its head around to see if Xiao Yan had caught up as it swam toward the deep regions of the crypt with vigor.</p><br/><p>In this kind of environment where he was deprived of his five senses, Xiao Yan had no idea of the actual flow of time. He only knew that after continuing in this machine like manner, his feet were already feeling a little numb.</p><br/><p>“Little boy, in half an hour time, you must return!” Just as Xiao Yan was feeling a little dazed as he closely followed behind the descending Flame Spirit Serpent, Yao Lao’s serious voice suddenly sounded.</p><br/><p>“Uh? What?” Hearing this, Xiao Yan was briefly stilled before he hurriedly asked, “What happened.”</p><br/><p>“We have descended deeper and deeper. Look at the magma outside…” Yao Lao said in a deep voice.</p><br/><p>Hearing Yao Lao’s words, Xiao Yan’s hurriedly lifted his gaze. He was shocked to realize that the surrounding fiery red magma had unknowingly turned slightly greenish.</p><br/><p>“What happened?” Xiao Yan asked in an aghast manner as his swimming speed gradually slowed.</p><br/><p>“This is a transformation caused by the temperature swiftly rising. The current temperature of the surrounding magma is fast reaching the limit which I can endure.” Yao Lao’s voice contained an unprecedented seriousness.</p><br/><p>“...” Hearing this, the corner of Xiao Yan’s mouth twitched. The perspiration on his forehead fell like dripping water as he muttered, “No way! Isn’t the ‘Bone Chilling Flame’ ranked eleventh on the ‘Heavenly Flame’ ranking? Don’t tell me that the ‘Heavenly Flame’ below is even more ferocious than Teacher’s ‘Bone Chilling Flame’?”</p><br/><p>“You cannot put it this way. I am now in a spirit state and cannot display much of the strength of the ‘Bone Chilling Flame’. Moreover, I must borrow your body to release it. In this way, its strength is dispersed further. Adding the pressure from the surrounding magma and the increasing temperature,a half hours is my limit.” Yao Lao quickly explained.</p><br/><p>“Alright, make full use of the time.” After urging Xiao Yan, Yao Lao once again became silent. It was likely that he did not dare to be distracted, least any accident should occur from the protection from the ‘Bone Chilling Flame’.</p><br/><p>Nodding his head with a bitter smile, Xiao Yan once again looked at the surrounding magma that was turning slightly green. He involuntarily shouted to the front, “Hey, just how much further?”</p><br/><p>Xiao Yan knew that Magic Beasts at the Dou Ling level already possessed an intelligence that could not be underestimated. Thus, he was not worried that it could not understand him.</p><br/><p>Xiao Yan’s voice was carried by Dou Qi as it passed through the magma barrier and entered the ear of the Flame Spirit Serpent in front. The latter turned its huge head around, randomly hissed a few sounds and suddenly increased the speed of its descent.</p><br/><p>“Dammit…” Seeing the Flame Spirit Serpent’s action, Xiao Yan could not resist cursing. After hesitating for a moment, he clenched his teeth tightly and kicked his feet violently. His body which was covered by a thick white flame, turned into a white shadow and suddenly shot downwards.</p><br/><p>Xiao Yan’s body passed through the magma which had almost turned completely green. Perspiration on his face continued to drip into his eyes. Although it felt a little painful, Xiao Yan did not even dare to blink his eyes, afraid that he would be left behind by the Flame Spirit Serpent that had suddenly increased its speed.</p><br/><p>“Che, just how much more do you want to descend?” As he continued to descend, Xiao Yan could clearly feel that temperature was intruding into his body despite the protection from the ‘Bone Chilling Flame’.</p><br/><p>“Ten minutes! Dammit. If I don’t see the ‘Heavenly Flame’ in ten minutes, I will stop searching!” The repeatedly shivering Xiao Yan tightened his trembling fist when he realized that even his voice had started to quaver at this instant.</p><br/><p>…</p><br/><p>A few moments later.</p><br/><p>“Eight minutes!” The corner of his mouth twitched as Xiao Yan yelled in a low voice.</p><br/><p>The Flame Spirit Serpent continued to ignore him as it descended with all its might.</p><br/><p>…</p><br/><p>“Four minutes!” Xiao Yan’s voice was totally dry as he shouted.</p><br/><p>...</p><br/><p>“Two minutes!” Xiao Yan realized that his heart was pounding intensely in a matter that never happened before.</p><br/><p>“Dammit. I’m going back. Not searching anymore!” With crimson eyes, Xiao Yan’s descending body suddenly stopped. Without any unnecessary words, he decisively turned around and began swimming upwards with an ashen expression.</p><br/><p>However, just as Xiao Yan turned around, the Flame Spirit Beast swung its huge tail and twined around Xiao Yan’s waist. Its tail was covered by a rich deep red flame. Although the flame was repeatedly turned into nothingness when it came into contact with the thick white flame, the enormous strength that it contained still violently pulled Xiao Yan back.</p><br/><p>“The heck, have I been toyed with by this beast?” The moment when he was pulled back by the Flame Spirit Serpent, a shocking thought suddenly flashed in his mind.</p><br/><p>This thought had just surfaced when Xiao Yan was thrown toward the front of the Flame Spirit Beast. As he was busy dancing around, he shifted his eyes around in search of a path up. However, he suddenly froze onto a green colored glowing thing a short distance away.</p><br/><p>The green colored glow covered the magma in this region. When Xiao Yan calmed down and looked over, he faintly saw a green colored lotus within the green glow that was standing in a gentle and soft manner.</p><br/><p>“ Green Lotus Core Flame’?” As Xiao Yan glanced at this green colored lotus, Yao Lao’s astonished and joyful laughter suddenly sounded in his heart.</p><br/>\n</div>"}