{"title": "Chapter 209: The City At The Heart Of the Desert", "id": 209, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-209-the-city-at-the-heart-of-the-desert", "volume_title": "Volume 3", "body": "<h1>Chapter 209: The City At The Heart Of the Desert</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p>Chapter 209: The City At The Heart Of the Desert</p><br/><p>In the vast desert, dozens of fully armed Snake-People carrying poison spears in their hands carefully inspected this small plot of land with sharp eyes. Any living creature that was not of the Snake-People race would be killed without mercy.</p><br/><p>The Snake-People in the unit criss-crossed with each other as they patrolled. Scars caused by the swaying of their snake-tails were left behind wherever the squad passed through.</p><br/><p>“These damn humans. They actually dared to be arrogant enough to break into the inner regions of the desert. If I capture them, I must let them taste the pain of being bitten by ten thousand snakes!” Under the hot sun, a Snake-Person who appeared to be the leader, wiped off his sweat and swore.</p><br/><p>“Squad Leader, what exactly happened? Why has our tribe suddenly entered into a state of martial law?” A Snake-Person impatiently swung his tail, sweeping his gaze across the vast desert and asked in a confused voice. He was dragged out early in the morning and forced to start searching throughout the entire desert.</p><br/><p>Hearing this Snake-Person’s question, the other ten plus Snake-People nearby also shifted their confused gaze at the leader. Clearly, these Snake-People who were lowly ranked were not clear of what exactly happened.</p><br/><p>“Hmm, what happened? There was a group of strong humans who suddenly broke through the defence of the Mei’s tribe last night and arrived at the inner regions of the desert. According to the information released by the Mei Tribe, that group appeared to have a Dou Huang, three Dou Wangs and a few Dou Lings.” The Snake-Person who was the leader coldly snorted with a somewhat dark expression.</p><br/><p>When the surrounding Snake-People heard this, their faces changed quickly. A Dou Huang, three Dou Wangs? God! Is the human empire planning on starting another war? This kind of frightening line-up was something that none of the huge tribes among the Snake-People race could resist alone.</p><br/><p>“Currently, all the tribes of the Snake-People race, regardless of big or small have entered into a period of martial law. And according to the information I received, the leaders of the eight huge tribes have already received Her Majesty’s order and have begun to rush toward the Shrine at the center of the desert. The fastest one should be able to arrive by tomorrow night while the slowest would need another day.” When he mentioned Her Majesty, there was the sincerity of a frantic believer on the leader’s face.</p><br/><p>“As long as there are three leaders who can hurry to the Shrine, then Her Majesty would give the order to conduct a carpet search. Hmm, so what if they have a Dou Huang? A group of humans who don’t know their limits. As long as the strong people in our Snake-People race are all gathered, we would definitely be able to beat them until they are like homeless dogs!” The Snake-Person who was the leader coldly laughed. He lifted his head, watched this piece of uninhabited desert and shook his head. Waving his hand, he cried, “Go, let’s go somewhere else. There doesn’t seem to be any traces of humans here.”</p><br/><p>Following the Snake-Person leader’s cry, this small squad gradually moved further away to conduct their search, leaving behind a huge piece of empty desert.</p><br/><p>After the squad disappeared over the horizon, a sand dune in a corner suddenly shook. A moment later, a human figure accompanied by a sand filled sky suddenly leaped out from the sand dune. His feet gently landed on the surface of the sand. Raising his eyes to stare at the spot where the Snake-People squad disappeared, he helplessly whispered, “Now it is getting more and more troublesome. Yhis part of the desert has Snake-People patrol squads appearing every short period of time...”</p><br/><p>“But from what they have said, it appears that the strong ones among the Snake-People race are hurrying over. Although Gu He’s lineup cannot be looked down upon, I think they can only retreat if all the strong people of the Snake-People race were to come together.” The human figure lifted his head slightly and revealed a delicate and handsome face under a black cloak. He was one of the humans who forcefully charged passed the Mei Tribe last night, Xiao Yan.</p><br/><p>“If nothing unexpected were to happen, I think that at the very least, Gu He’s group will take action by tomorrow afternoon. They should also be clear of the strength of the Snake-People race. The longer they drag on, the more danger they face.” Yao Lao’s voice was emitted from the ring.</p><br/><p>“Yes.” Xiao Yan nodded his head and took out a detailed map from his storage ring. His gaze stared at the middle of the desert where there was a vicious snake head symbol. His said softly, “This should be the shrine of Queen Medusa. There are many small sized tribes located around it. The shrine’s defenses are extremely tight and there is also the personal bodyguards of Queen Medusa there, the Queen Medusa Snake Guard. This elite unit gained numerous outstanding battle achievements during the war between the Jia Ma Empire and the Snake-People race. Even the commanders of some of the elite troops of the empire were afraid of them.”</p><br/><p>“Hu… looks like wanting to successfully obtain the ‘Green Lotus Core Flame’ will be an extremely troublesome task.” Xiao Yan let out a gentle sigh and rubbed his vexed forehead. In this kind of dangerous place, he did not dare to act recklessly even with Yao Lao’s protection. After all, Yao Lao was currently only in a spirit state and could not completely display the strength he had in the past. Queen Medusa, on the other hand, was an extremely strong person with a fierce and renowned name. If the current Xiao Yan was to be eyed by her, his ending might not be very nice.</p><br/><p>Moreover, the total strength of the Snake-People race was also much stronger than the Jia Ma Empire. Was it not for these Snake-People having to always handle attacks from all directions, Jia Ma Empire would have suffered a significant defeat in the previous war.</p><br/><p>“Ah…” Shaking his head, Xiao Yan softly asked, “Teacher, what should we do now?”</p><br/><p>“Speed up. We’re traveling too slow. Let’s get close to the shrine of Queen Medusa as soon as possible. If Gu He’s group and Queen Medusa were to start fighting, we will use the opportunity to enter the shrine and search for the ‘Heavenly Flame’. Although my strength has diminished significantly in my current spirit state, Queen Medusa should still have a difficult time sensing you if I hide your Qi.” Yao Lao voiced his thoughts.</p><br/><p>Hearing this, Xiao Yan nodded his head. He removed the Heavy Xuan Ruler from his back and placed it into the storage ring. After which, he released his breath gently and a purple-colored Dou Qi cloak began to gradually cover his body. His feet stepped hard onto the ground and his figure turned into a purple-colored shadow, sticking close to the ground and quickly moving along the path shown on the map.</p><br/><p>Xiao Yan did not dare to open his Purple Cloud Wings and fly in the sky due to the weather being bright and sunny. Otherwise, if he were to be discovered by the Snake-People squad patrolling all over the desert, he would have exposed himself too early. This was not such a good thing for Xiao Yan who wanted to be a ‘fisherman’.</p><br/><p>TL: Take advantage of the fight between the two sides</p><br/><p>Running over the ground may have been a little slow but with the help of Yao Lao’s extremely strong Spiritual Perception, the Snake-People patrol squads that were scattered all over the inner regions of the desert were all avoided by Xiao Yan beforehand.</p><br/><p>After running wildly with all his might for nearly an hour and narrowly avoiding dozens of patrol squads, the hot sun in the sky began to gradually set in the west. An enormous city finally appeared vaguely on the horizon.</p><br/><p>As he grew closer to the city, Xiao Yan realized that surrounding this majestic city, there were many huge rocks on the stereotypically yellow desert. Behind these rocks was the Shine City where Queen Medusa stayed.</p><br/><p>Xiao Yan hid his body behind a huge rock. His mouth swiftly exhaled the coarse air. If he did not have the support from the ‘Energy Recovery Pill’, he would have had to stop during the few hours of continuous running with all his effort because of exhausting his Dou Qi. However, even with its help, Xiao Yan’s legs were already beginning to feel numb. The waves of piercing pain caused the corner of his mouth to twitch.</p><br/><p>After extending his hand to wipe away his perspiration that was mixed with some sand, Xiao Yan lifted his head and watched the darkening sky. He let out a long breath and bitterly laughed, “Looks like I will really have to stake my life to obtain the ‘Green Lotus Core Flame’…”</p><br/><p>Xiao Yan laid on the huge rock and rested for over ten minutes before he forced his aching and numb body to take out an ‘Energy Recovery Pill’ from the storage ring and swallowed it. A long while later, he felt the gradually flow of Dou Qi in his body. He sighed in relief and carefully flipped his body over. His gaze passed through the cover of the huge rock and watched the massive city that stood far away in the desert.</p><br/><p>Perhaps it was because they were in a state of a martial law but the huge city’s gates had already been tightly shut. On top of the city’s wall, there were fully armed Snake-People guards who were pacing up and down, patrolling the place. In the sky above the city wall, there were over ten huge dark black birds that were also circling the city. Their sharp eyes continued to sweep around the city’s surroundings. Any little movement would cause these beasts to issue a warning cry.</p><br/><p>Carefully sweeping his gaze over the city’s wall, Xiao Yan’s face became a little ugly. Although he was still far away, he could sense that the Snake-People guards of this city had an overall strength that was stronger than the Mei Tribe from yesterday night. There were also a few Snake-People, whose clothing appeared a little strange and were mixed among these Snake-People guards. These Snake-People had cold expressions and stood on the city’s wall like a pillar. However, Xiao Yan could vaguely sense that not one Snake-Person dared to step within a radius ten of feet by these people. Clearly, they were fearful of these strangely dressed Snake-People.</p><br/><p>“These people… should be the personal guards of Queen Medusa. They are indeed very strong…” Xiao Yan stealthily withdrew his gaze, shrunk his body into the gap of the rock and softly said with a bitter smile.</p><br/><p>“Now, we should just quietly wait here. I think that Gu He’s group will be here soon. When that time comes, take advantage with the upheaval that occurs to sneak into the city… I am able to roughly sense the presence of the ‘Green Lotus Core Flame’ in this city.” Yao Lao’s voice sounded from the dark black ancient ring.</p><br/><p>“It really is here…” Hearing this, joy surfaced on Xiao Yan’s face. This was one of the few good pieces of news that he had heard in his current situation of being alone in enemy territory.</p><br/><p>Xiao Yan quietly suppressed his happiness. He took out a golden yellow-colored rag from the storage ring and placed it over his body. Immediately, his body turned into the same golden yellow color of the sand. If no one came close to take a look, it would be difficult to notice that there was someone hiding there.</p><br/><p>A short while after Xiao Yan hid his body, Yao Lao’s deep voice suddenly sounded in his heart, “Boy, there is an enormous Qi that is closing in on you here.”</p><br/><p>Hearing Yao Lao’s warning, Xiao Yan’s heart tightened. His breathing quietly calmed down and Yao Lao’s Spiritual Strength covered Xiao Yan.</p><br/><p>Through some gap, Xiao Yan gazed at the distant sky. A moment later, an ink black small dot suddenly appeared on the horizon. In the blink of an eye, it carried the sharp sound of air being compressed and shot toward the huge city.</p><br/><p>Not long after the black dot appeared, the guards on the city wall also took notice. Following the sound of a warning, countless Snake-People lifted their poison spears and prepared to shoot it down.</p><br/><p>When the ink black figure arrived somewhere around a hundred meters from the city, he immediately stopped in midair. A somewhat dark and cold cry sounded, “Mo Tribe leader, Mo Basi, greets Her Majesty!” Hearing this thunder like shout that sounded throughout the desert, Xiao Yan’s eyelids jumped. A leader of one of the eight large tribes had finally arrived...</p><br/>\n</div>"}