{"title": "Chapter 217: Seven-Colored Heaven Swallowing Python", "id": 217, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-217-seven-colored-heaven-swallowing-python", "volume_title": "Volume 3", "body": "<h1>Chapter 217: Seven-Colored Heaven Swallowing Python</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 217: Seven-Colored Heaven Swallowing Python</u></strong></p><br/><p>Under Xiao Yan’s observation, the charred black skin of the stiff, huge snake corpse suddenly began shedding slowly…</p><br/><p>The shedding speed gradually increased and finally, Xiao Yan could roughly see that there seemed to be something in the huge snake corpse that was about to break through the body.</p><br/><p>“Gu.” Watching this strange scene, all of Xiao Yan’s pores stood open. He swallowed his saliva and began to slowly turn around. His gaze stared intently at the enormous snake which was repeatedly shedding its charred black skin. Carefully taking a few steps back, he hurriedly asked, “Teacher, what is happening?”</p><br/><p>“Within the snake body, a Qi has appeared …” Yao Lao’s voice at the moment was much more serious.</p><br/><p>“She succeeded in evolving?” Xiao Yan’s eyes shrunk as he asked dryly.</p><br/><p>“... Seems like it. Be careful.” Yao Lao was also uncertain of what was happening. Thus, his reply was also somewhat vague.</p><br/><p>Hearing this, Xiao Yan felt his heart sink. An instant later, he tilted his head toward the green-colored flame in midair and said decisively, “Teacher. How do we obtain the ‘Heavenly Flame’? Hurry up, there’s no time. Once that thing comes out, I’m afraid that we will…”</p><br/><p>“Be careful!” Before Xiao Yan could complete saying what he wanted to say, Yao Lao’s hurried warning suddenly sounded in his heart.</p><br/><p>When Yao Lao’s cry sounded, Xiao Yan’s heart suddenly tightened. After over a year of tough training, Xiao Yan had obtained the ability to constantly remain alert. His expression immediately changed, the tip of his legs gently tapped on the ground and his body hurriedly pulled back. “Bang!” As Xiao Yan was hurriedly pulling back, the huge snake corpse on the ground suddenly emitted an explosive sound. The black scales flew in all directions and the corpse instantly turned into powder.</p><br/><p>At that instant when the huge snake corpse turned into powder, a vast and frightening Qi was suddenly released and swiftly covered the entire city at a speed that caused others to feel dismay.</p><br/><p>“Her Majesty has succeeded?” Sensing the faintly familiar feel of this Qi, countless Snake-People in the city faced each other. Instantly, their faces were filled with unrestrained joy as an earth shaking cheer sounded throughout the clouds.</p><br/><p>The instant when this vast Qi erupted, the expression of Gu He, who was outside the purple-colored curtain, changed drastically. At the same time, his body involuntarily and quickly retreated over dozens of meters.</p><br/><p>As his figure was hurriedly pulling back, Gu He wore an ugly expression as he shouted to the black-robed person who was quietly standing in midair, “Let’s leave quickly. Queen Medusa had successfully evolved!”</p><br/><p>“Don’t panic!” Facing the sudden surge of energy from the terrifying Qi, the black-robed person still remained calm. Other people may have difficulty sensing the irregularity within the Qi but she could clearly sense it. This Qi may be so strong that it was frightening but it had a faint feeling of lacking the strength to persist.</p><br/><p>Her senses were not incorrect. After this Qi had erupted, it only lasted for over ten seconds before it shrunk back into the light curtain like a tide retreating from the beach.</p><br/><p>Following the Qi being extinguished once again, the cheers in the city also suddenly stopped. All of the Snake-People had stunned faces and their hearts were anxiously for the result of the new development.</p><br/><p>When that Qi suddenly erupted, Xiao Yan’s face paled significantly. His feet stepped on the ground and in the blink of an eye, pulled back for over ten meters.</p><br/><p>The extinguishment of the Qi also caused Xiao Yan’s heart to be dumbfounded. However, he did not dare to take things lightly at the moment. Narrowing his eyes slightly, he stared intently at the region a distance away that had some black-colored dust caused by the snake body exploding. His palms were covered with perspiration.</p><br/><p>The black-colored dust gradually showered downwards. In an instant, a seven-colored light abruptly shot out from the fog. The speed of the light was so quick that one could not react, much like it had penetrated the resistance of the space.</p><br/><p>In Xiao Yan’s dark black eyes, the seven-colored glow flashed. Xiao Yan’s face was startled. Before he had a clear idea of what the thing was he did not dare to have any skin contact with it.</p><br/><p>“Dammit. Its speed is too fast!” Even though Xiao Yan wanted to dodge, the speed of the seven-colored light was so fast that it was frightening. Even Yun Zhi, the one with the fastest speed he had ever seen back in the Magic Beast Mountain Range, was clearly slower than the light by an entire level.</p><br/><p>The Dou Qi in Xiao Yan’s body had just moved when the sharp breaking wind sound that the seven-colored light carried reverberated by the side of his ear.</p><br/><p>“Bang…” At the moment when things grew very dangerous, a thick white flame abruptly soared from Xiao Yan’s body. The high temperature grilled the surrounding air till it became distorted.</p><br/><p>“Zhi!” Seemingly having sensed the strength of the thick white flame, that seven-colored light which had hurriedly shot toward Xiao Yan did not advance any further. It suddenly stopped its body in front of Xiao Yan. The change from extreme speed to extreme silence was done in an almost completely natural manner without the slightest feeling of distortion.</p><br/><p>The seven-colored light stopped a few centimeters in front of Xiao Yan and finally revealed its body to Xiao Yan’s sight.</p><br/><p>The shock caused by the unavoidable collision was still present on Xiao Yan’s face but when he saw the living creature that appeared in front of him, the shock was involuntarily turned into a stunned and dull expression, presenting quite an exciting scene.</p><br/><p>The living creature that had appeared in front of Xiao Yan was a narrow small snake that was only around two centimeters long. Its body was covered with tiny seven-colored scales and its pale purple eyes had a faint bewitching feeling. A unique fresh scent was shrouded around its body. Although it was currently only a snake, both elegance and nobility seeped out from it.</p><br/><p>The small snake did not appear to be vicious looking but it was beautiful to a ridiculous extent. This kind of beautiful living creature may well cause many ladies to forget about their fear and disgust for snakes.</p><br/><p>The entire body of the seven-colored small snake did not have many sharp attacking spots. However, Xiao Yan could vaguely sense a terrifying strength, that even a Dou Huang would not dare underestimate, within its small body.</p><br/><p>The small snake was suspended in midair in front of Xiao Yan. Its pale purple-colored pupils did not have the slightest killing aura. Instead, it appeared extremely pure and clean. Although Xiao Yan clearly knew that this small snake may have been transformed from Queen Medusa whose vicious reputation had frightened the few empires surrounding the desert, he could not find himself raising any hard feelings against the small snake in his heart.</p><br/><p>The seven-colored small snake swayed its tiny tail, widened its purple-colored pupils and watched Xiao Yan who was in front of it. It tried to get slightly closer to Xiao Yan but was also frightened by the thick white flame surrounding Xiao Yan’s body. Immediately, it hurriedly shrank back, curling up its body. The pale purple eyes actually carried an extremely pitiful look as the snake eyed Xiao Yan.</p><br/><p>With a stiffened body, Xiao Yan stared at the seven-colored small snake in front of him that appeared totally harmless. He did not dare make the slightest move. Swallowing his saliva, he asked blankly in his heart, “Teacher… it… this is Queen Medusa?”</p><br/><p>“Yes…” Yao Lao said stuffily as he nodded his head. He let out a soft sigh and muttered, “Its body is seven-colored, its eyes are slightly purple, its body emits a fragrance, its strength is overwhelming… How unexpected. The so called evolution of Queen Medusa is actually evolving her spirit, abandoning the original shell and using her Spiritual Strength to agglomerate into a genuine and new body.”</p><br/><p>“... Then what is this thing that she has currently evolved into?” Xiao Yan asked apprehensively.</p><br/><p>“Queen Medusa’s previous accompanying spirit was the enormous purple snake that you saw just now. That spirit was a rank six Magic Beast, the Quiet Purple Flame Serpent. According to legends, this Quiet Purple Flame Serpent can activate their faint bloodline within their bodies and transform into their ancient ancestor. Naturally, the chances of this happening are extremely meager. They are so meager that it can be simply neglected.” Yao Lao said softly, “That ancient exotic beast that could once contend with those at the Dou Sheng level was called ‘Seven-Colored Heaven Swallowing Python’. Its differentiating point is its seven-colored body, its slight purple pupils, its body fragrance and its strength… overwhelming.”</p><br/><p>“It is exactly the same as the seven-colored small snake in front of me…” The corner of Xiao Yan’s eyes twitched as he moaned in his heart.</p><br/><p>“Yes. If I guess correctly, the small snake in front of you should be the legendary ‘Seven-Colored Heaven Swallowing Python’... At the same time it is also Queen Medusa’s new body.” Yao Lao sighed.</p><br/><p>Swallowing his saliva, Xiao Yan eyed this harmless looking beautiful small snake with some disbelief. This thing, was the ancient exotic beast that could contend with the legendary Dou Sheng class?</p><br/><p>“Uh… that’s not right. If it really is Queen Medusa, why is it that I cannot feel the slightest killing intent for me. According to common sense… if it really were that vicious woman, I’m afraid that I would have already died on the spot.” Staring at the baby like curiosity within the small snake’s pupils, Xiao Yan asked, feeling at a loss.</p><br/><p>“This… I don’t know.” Yao Lao said with embarrassment: “Perhaps… when it was evolving, it became stupid after being struck by the lightning.”</p><br/><p>“...” Hearing Yao Lao’s words, Some dark line surfaced on Xiao Yan’s forehead. He licked his lips and softly said, “Teacher. I feel that it seems… to not have any killing intent. Why don’t you try removing the ‘Bone Chilling Flame’.”</p><br/><p>“This… alright. Be careful.” Hearing the suggestion, Yao Lao hesitated before nodding his head.</p><br/><p>As Yao Lao’s words fell, the thick white flame on Xiao Yan’s body was swiftly extinguished. Once the ‘Heavenly Flame’ completely disappeared, Xiao Yan clenched his perspiration filled fist and stared at the seven-colored small snake in front of him. He carefully said, “Your Majesty?”</p><br/><p>The small snake did not make the slightest response to Xiao Yan’s cry. It simply blinked its quartz like pupils, swayed its snake tail and gradually swam over to Xiao Yan while suspended in the air.</p><br/><p>Seeing its action, Xiao Yan could only remain on the spot quietly while his heart felt jittery.</p><br/><p>The seven-colored snake circled around Xiao Yan twice but did not display any intentions of ill will. This let Xiao Yan heave a sigh of relief.</p><br/><p>After swaying its tail and whirled around Xiao Yan one more time, the seven-colored small snake suddenly stopped in the space above Xiao Yan’s hand. Its crystal clear eyes carried some yearning as it stared intently at the storage ring on Xiao Yan’s hand. It then raised its head and emitted a few soft hiss toward Xiao Yan. The gentle sound was as though it was behaving like a spoiled child.</p><br/>\n</div>"}