{"title": "Chapter 222: Yun Zhi?", "id": 222, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-222-yun-zhi", "volume_title": "Volume 3", "body": "<h1>Chapter 222: Yun Zhi?</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 222: Yun Zhi?</u></strong></p><br/><p>Within the desert, sharps explosive sounds rang throughout the sky. The moment the explosive sound occurred, a figure appeared, paused for a moment and the next time he appeared, he was a few hundred meters away.</p><br/><p>The instant when this figure disappeared, another black figure closely followed. The shape that this black figure adopted while flying through the sky was like a floating willow leaf. As the figure swayed, there was a perfect combination of both speed and elegance which appeared extremely pleasing.</p><br/><p>The speed of this black figure in the back could only be said to be better compared to the figure in front. Each time the figure shot forward like a whirlwind, a faint afterimage would remain in place. A moment later, it slowly disappeared under the hot sunlight. As the figure swept past, there was once a maximum of eight after images that appeared in the sky. From this it can be imagined how terrifying the speed of the black figure was.</p><br/><p>As one person fled and the other gave chase, Xiao Yan’s body had once again turned into a small black spot that had appeared in the black-robed person’s sight.</p><br/><p>The black-robed person lifted her head slightly and watched the black clothed figure ahead who was carrying the Green Lotus Seat and flying quickly. She frowned slightly and mumbled in a slightly suspicious manner from under the robes, “This person’s speed is really somewhat strange. During the flight, there hasn’t been any Dou Qi spilled out. This perfect control is very rarely seen.”</p><br/><p>“Why have I never known that such a strong person has appeared near the Tager Desert? This kind of speed is something that even some Dou Huang cannot compare with. If I did not have ‘Wind Afterimages’, an agility Dou Technique that raises my speed, I would not be able to shorten the distance between him and myself. But even if it is like this, it appears that I still have difficulty catching up to him.” Under the black robe, a pair of long and narrow eyebrows that appeared like a drawing were increasingly knit together, revealing the owner’s doubt in her heart.</p><br/><p>“I cannot continue to let it drag on like this. Otherwise, if a sandstorm were to occur, I would lose my target…” After slowly exhaling a breath with an orchid like fragrance, a pair of snow white hands rolled out of the black-colored sleeves. They slowly formed a seal and softly muttered, “I will be able to attack at a range of five hundred meters. Now, there’s a little more left… I’ll speed up.”</p><br/><p>As the voice fell, the black-robed person’s toes gently pressed on the air. Her body gracefully rotated in midair and an afterimage was left in the original spot. The original body had strangely disappeared and when it appeared again, it was already over a hundred meters away.</p><br/><p>“Teacher, we seemed to have provoked a hornet’s nest…” Feeling the strange wind sound beside his ear, the corner of Xiao Yan’s eyes glanced behind him. He noticed the black-robed person flashing over and could not help but laugh bitterly in his heart.</p><br/><p>“The one who has come is that Dou Huang… no wonder she can catch up.” Yao Lao sighed gently. Immediately, he teased, “I think that the black-robed person seems to have a good impression of you. Why don’t you try and see if she will let you off?”</p><br/><p>“*Cough*... let’s forget it. The last time, she may have showed compassion for the little pitiful me. This time is different. The attraction of something like a ‘Heavenly Flame’ is far too large. She and I aren’t even acquainted. As long as her head was never been caught between the door, I think that she would finish me off very decisively, without the slightest hesitation.” Hearing Yao Lao’s words, Xiao Yan laughed dryly. He was about to urge Yao Lao to speed up when he felt his heart tighten. All the hair on his body stood up at this moment.</p><br/><p>“Be careful!”</p><br/><p>“Rotating Wind Wall!”</p><br/><p>The indifferent cold cry and Yao Lao’s hurried voice suddenly sounded together. As these cries fell, the space tens of meters ahead of Xiao Yan began to become distorted. An essence wall that was completely agglomerated of violent wind abruptly took sharp. On the wall, countless of wind blades were wildly rotating. Looking at its appearance, anyone who knocked into it would immediately be cut into small slices of meat.</p><br/><p>With wide eyes, Xiao Yan stared at the wall of wind blades that he was closing in upon. At that moment, his eyes had shrunk to the size of a pin hole. Although he was trying desperately to break, Xiao Yan’s momentum prompted him to violently fly against the wind blade wall.</p><br/><p>“Wa ah ah! Stop!” The aghast in Xiao Yan’s heart caused his face to turn pale. His body was about a few meters from the wind blade wall when a thick white flame suddenly soared from his body. At the same time, his body froze quietly, as though it had suddenly been ruthlessly nailed in midair.</p><br/><p>Xiao Yan’s lips quivered slightly as his body quietly stopped in midair. A few centimeters in front of him, the enormous wind blade walls was still grinding violently, much like a pulper. Numerous ‘Qiang Qiang’ noises sounded, appearing extremely frightening.</p><br/><p>A few drops of cold sweat rolled down from his forehead. Xiao Yan’s voice trembled a little, “He… This is far too vicious.”</p><br/><p>“Hand over the ‘Heavenly Flame’. I don’t know who you are but offending a tier six alchemist is not a wise decision.” A calm cool voice slowly sounded from behind Xiao Yan. There was a little pant in the voice. Clearly, this sudden attack was a little energy consuming even for her.</p><br/><p>“Ugh. teacher, prepare to go all out.” Hearing the voice behind him, Xiao Yan let out a soft sigh. His plan to flee had already failed. Now, all that remained was the most tragic direct confrontation.</p><br/><p>“Ugh. I’ll try my best. But I still stand by my words. I can protect your life in a battle with a Dou Huang but I cannot guarantee the same for the ‘Heavenly Flame’.” Yao Lao sighed and helplessly said.</p><br/><p>Hearing this, Xiao Yan laughed smiled, “Without my life, what is the point of having the ‘Heavenly Flame’? It’s better to protect my life.”</p><br/><p>Pulling the Lotus Seat with his hand, Xiao Yan eyed the flame at the core of it and gently sighed. His voice was somewhat hoarse after flying for such a long time, “Alright. You win. Take the thing…”</p><br/><p>As he said, Xiao Yan carelessly threw the Green Lotus Seat behind him. At the moment the Green Lotus Seat left his hand, Xiao Yan’s feet suddenly stepped in the air. The pair of wings behind him flapped and his body rushed toward the ground.</p><br/><p>Seeing that Xiao Yan had replied so decisively, the black-robed person was clearly at a momentary loss. She saw the Green Lotus Seat that was slowly floating over and then eyed Xiao Yan who had suddenly escaped fiercely. After a brief hesitation, she gave up blocking him. The wings on her back flapped and she pounced toward the Green Lotus Seat to snatch it back.</p><br/><p>Just as the black-robed person was slightly over ten meters from the Green Lotus Seat, a ferocious suction force was emitted from the ground and the Green Lotus in midair immediately shot down.</p><br/><p>“Hehe. I’m sorry.” After landing on the ground, Xiao Yan beckoned with his palm. The Green Lotus Seat once again landed in his hand. Feeling it’s warmth, Xiao Yan laughed but did not turn back. His wings violently flapped and the yellow sand on the ground swam upwards. In only a moment, it was scattered throughout the sky.</p><br/><p>With her body floating in midair, the black-robed person coldly stared at the raising yellow sand that had covered her vision . She coldly snorted.</p><br/><p>Ignoring the yellow sand, her gaze swept below her amidst the yellow sand. Her delicate hand swiftly formed a seal before she softly cried, “Square Wind Wall!”</p><br/><p>As his voice fell, four enormous wind walls suddenly appeared and covered the entire area within a hundred meters.</p><br/><p>The instant the wind walls appeared, Xiao Yan, who was planning to use the yellow sand to cover his escape immediately stopped. He foolishly watched the huge wind wall a few meters from him. A long while later, he bitterly smiled and said, “This time around, I must risk my life. This person is far too calm, choosing the most effective way to stop me in such a short time.”</p><br/><p>“My patience has a limit. You are fast approaching my limit.”A somewhat icy and bland voice once again sounded above his head. The black-robed person coldly glanced at Xiao Yan’s black clothed figure and slowly descended. There was a compressed rotating tornado on her delicate left hand. It was quickly spun while emitting a ferocious force. Meanwhile, her right hand lightly waved and a strange looking sword which was emitting a pale green glow surfaced.</p><br/><p>“Ah…” Xiao Yan squatted down as he let out a soft sigh. He carefully placed the Green Lotus on the sand dune and inhaled a gentle breath. The hopeless dejection on his handsome and delicate face swiftly disappeared. Replacing it was a ghastly ruthlessness of someone who had been forced into a corner and was ready to strike back..</p><br/><p>Xiao Yan stood up and slowly turned around. Finally, he directly faced this Dou Huang. His finger gently planned over the storage ring and an enormous dark black ruler appeared in his palm.</p><br/><p>Xiao Yan held the Heavy Xuan Ruler tightly in his hand and inserted it heavily in the sand dune. Shrugging his shoulders at the black-robed person, he said with a smile, “You should be a little surprised looking at my face, no? The youth whom all of you randomly rescued in the desert would actually be the one who gave you the greatest headache.”</p><br/><p>Surprise… indeed very surprised. The Dou Huang’s surprise was fast reaching the point of extreme shock…</p><br/><p>The moment Xiao Yan turned his body around, the body of the black-robed person suddenly stiffened. The beautiful eyes under the black robe were filled with shock as they stared at the handsome and delicate face which was wearing a smile. She did not expect that the person who had almost caused her group to fail at the last moment would be this guy… This not only surprised her… It gave her a shock like being struck by lightning.</p><br/><p>“Hiss…” Under the black robe, the black-robed person chest clearly rose and fell intensely once. A long breath was released. The black-robed person’s voice was of an incredulous tone as she softly muttered, “How can it be you? How can it be you?”</p><br/><p>Hearing the repeated words from the black-robed person, Xiao Yan rubbed his head. He then lowered it to glance at the ‘Heavenly Flame’ by his side as he helplessly said, “I’m sorry. I really need it. So…”</p><br/><p>“Didn’t I ask you to go back? Why are you still loitering around in the desert?” A female voice that suddenly sounded a little angry came from under the black robe.</p><br/><p>“Uh…” The black-robed person attitude caused Xiao Yan to be at a loss. Feeling neither able to laugh nor cry, he shook his head and said, “Big sister, the reason for me coming to the desert is to search for the ‘Heavenly Flame’. Moreover, I have known from the beginning that Queen Medusa had the thing I needed. Why do I need to leave?”</p><br/><p>“The ‘Heavenly Flame’ is now in my hands. If you want me to hand it over, I think it would be better if you came and took it instead, However, I will definitely not let it go so easily!” Xiao Yan suddenly lifted the heavy ruler, pointed it at the black-robed person and laughed in a somewhat proud voice.</p><br/><p>“You…” Seeing Xiao Yan’s action, the black-robed person was somewhat angry. It had only been half a year since they saw each other but this guy actually dared to challenge her?</p><br/><p>Under the black robe, a pair of beautiful eyes were both furious and happy as they stared at Xiao Yan who appeared serious as he challenged her. A long while later, she bitterly laughed and shook her head. The force on her delicate hand was slowly withdrawn. She really had trouble fighting Xiao Yan…</p><br/><p>“Ugh, he is really my…” The black-robed person thought in her heart as a bright red color surfaced on her pretty face under the black robe. She helplessly shook her head and mused for a long while. After which, she waved her hand in an extremely distracted manner. The usual restrained and elegant self involuntarily scolded, “Get lost. Just get lost. Take the ‘Heavenly Flame’ and go. Just pretend that I did not catch up with you today.”</p><br/><p>“Uh…” The even stranger action of the black-robed person instantly caused Xiao Yan’s face to completely dull. A long while later, he finally said in a disbelieving voice, “”You… you don’t want the ‘Heavenly Flame’?”</p><br/><p>“I don’t have too much obligation to help Gu He do so many things. I have already done my duty by taking the risk and guarding them as they entered the desert.” The black-robed person said blandly. As she spoke, she suddenly tilted her head and eyed the sky behind her. After which, she turned around to leave.</p><br/><p>“...” Xiao Yan was speechless as he eyed the black-robed person who turned around to leave. Then he suddenly asked, “What are you doing?”</p><br/><p>The black-robed person paused. She was quiet for a long while before she said softly, “There’s some people catching up. You should take your leave first. I’ll… block them.”</p><br/><p>“That… big sister, are you sure your head has not been caught between the door? Don’t tell me you are my relative? My aunt?” The corner of Xiao Yan’s mouth twitched. He was unable to accept this woman’s strange behavior and involuntarily shouted.</p><br/><p>“Get lost!” Hearing Xiao Yan’s words, an embarrassed, angry cry was emitted from under the black robe. She waved her sleeves and a yellow sand arrow viciously shot toward Xiao Yan. Just as it was about to strike Xiao Yan’s head, it suddenly exploded and rained yellow sand over his head.</p><br/><p>Xiao Yan hurriedly pushed aside the yellow sand. His gaze swept the quiet and elegant moving figure that was faintly revealed under the large black robe. He sighed with an utterly confused mind, lowered his body and held the Green Lotus Seat in his palm. Suddenly, he seemed to have thought of something and his body stilled. He abruptly lifted his head and stared intently at the strange longsword that was carrying a green light in the hand of the black-robed person. Slowly, the black-robed person’s figure merged with the noble and beautiful figure of the Dou Huang who dared to confront the Amethyst Winged Lion back then until there was no difference between them as they matched perfectly.</p><br/><p>It was as though a thunderbolt struck through the confused fog within his mind. An elegant name that Xiao Yan could not forget gradually surfaced from deep within his memories. After which, it was like a brand which ruthlessly branded itself in his mind.</p><br/><p>As this name surfaced, the black-robed person’s earlier actions, which were foolish to the point of being pitiful, caused the tip of Xiao Yan’s nose to redden.</p><br/><p>“Yun Zhi! Is it you? Ha ha, I love you so much! Ha ha!”</p><br/><p>From within the sandstorm filled sky, Xiao Yan’s extremely pleased and unrestrained laughter suddenly followed the dancing wild wind and was transmitted to the black-robed person’s ear.</p><br/><p>At this moment, the black-robed person’s lovely body suddenly stiffened. Her delicate and thin body in the fierce wind was like a beautiful peony swaying in the wind, appearing noble and thus elegant.</p><br/>\n</div>"}