{"title": "Chapter 229: Heavenly Flame Forging the Body", "id": 229, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-229-heavenly-flame-forging-the-body", "volume_title": "Volume 3", "body": "<h1>Chapter 229: Heavenly Flame Forging the Body</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 229: Heavenly Flame Forging the Body</u></strong></p><br/><p>Following the withdrawal of the ‘Green Lotus Core Flame’ flame seed, the enormous green-colored flame in front of Xiao Yan immediately began to gradually shrink. A while later, it turned into wisps of tiny green-colored flames and entered into the green-colored lava within Xiao Yan’s hand.</p><br/><p>“This is the Origin Flame Seed of the ‘Green Lotus Core Flame’. Don’t look down on its size. When it was initially formed, it would have been the massive size of half a mountain peak. However, after thousands of years of being honed by the earth, its size has become increasingly small. Only after its size has been compressed to the size of one’s palm would it be able to form a little flame spirit. Only at that moment can it truly be called a ‘Heavenly Flame!’.”</p><br/><p>“This thumb-size strip of lava has absorbed terrifying energy for over the thousands of years it was being compressed... You can just imagine... if such a thing were to completely explode, how extreme of a destruction would released... Bluntly putting it, at such a time, even a Dou Zhong would only have one absolute end when faced with this spontaneously combusting energy…” Yao Lao stared at the green-colored lava in Xiao Yan’s palm that was like a worm as he softly said, “To die!”</p><br/><p>“Hu…” Xiao Yan exhaled a long breath and quietly nodded his head. He carefully held that strip of green-colored lava in his palm. Due to the terrifying temperature contained within the strip of lava, it caused the thick blood-colored cuticle layer to melt at a swift pace that would make most people nervous.</p><br/><p>“What’s next?” Xiao Yan blinked his eyes and muttered.</p><br/><p>“Swallow it…”</p><br/><p>The thick white flame on Yao Lao’s body trembled uncontrollably for a couple of times. He tried his best to maintain the calmness in his old voice but it still shook a little. The current step that Xiao Yan needed to carry out was the most dangerous step in swallowing the ‘Heavenly Flame’. Regardless of how strong and firm the outside of one’s body was, the interior of one’s body would always be the weakest part for him. Forget about the ‘Heavenly Flame’ that possessed great destructive power. If something even a little harmful were to enter into his body, it would cause a strong person to feel neither able to live nor die.</p><br/><p>TL: Feel neither able to live nor die - extreme pain/anguish</p><br/><p>Hearing Yao Lao’s words, Xiao Yan’s hand which was tightly holding the ‘Green Lotus Core Flame’ flame seed trembled a few times in an unobvious manner. He lowered his head slightly and stared intently at the slowly squirming flame seed with his dark black eyes. A struggle could be seen in his black and white eyes.</p><br/><p>Regardless of how calm Xiao Yan’s character was, his heart would unavoidably feel some terror and apprehension when faced with making this kind of life or death decision. Who could blame him? After all, what he was about to swallow was an extremely restless bomb. This bomb had an extremely high probability to blow his body into ashes the moment he swallowed it.</p><br/><p>Following Xiao Yan’s silence, the atmosphere within the cave became quiet. The stifling hot air hovered around the cave before moving along some cracks it formed.</p><br/><p>Yao Lao also sighed softly as he eyed Xiao Yan’s slightly trembling hand. There was no disappointed expression on his face because of Xiao Yan’s hesitation. Being in possession of the experience of swallowing a ‘Heavenly Flame’, he was extremely clear just how uncertain one’s heart and spirit would be at this moment…</p><br/><p>Back them. when he was swallowing the ‘Bone Chilling Flame’, he had even held the flame seed and sat foolishly and trembling for nearly an hour before he finally adopted the thought that he was going to die as he chomped down on the flame seed and violently forced the flame seed into his stomach…</p><br/><p>Seeing that young man who was carrying the flame seed with a struggling face, Yao Lao also remained quiet. He did not open his mouth to say any words of comfort. This was because swallowing the ‘Heavenly Flame’ had always posed an extremely great risk. Although they had prepared the ‘Blood Lotus Pill’ and other things according to his request, these things would only simply raise the success rate of swallowing the ‘Heavenly Flame’ by a little.</p><br/><p>According to his rough estimate, if the ‘Blood Lotus Pill’ and other assisting items were not present, the chance of successfully swallowing the ‘Heavenly Flame’ was not even at one percent. With them, the chances of success may have been raised to around ten percent. Even if this was so… the risk involved was still very significant. It could even be said that swallowing a ‘Heavenly Flame’ was an action that was gambling with one’s luck. If one were lucky, one would roam through the heavens and overtake the land, if one was unlucky, one would turn into ash and be buried with the yellow ground…</p><br/><p>TL: Earth is yellow. Accept it.</p><br/><p>Therefore, when he saw Xiao Yan hesitating and struggling, Yao Lao did not say anything. He simply quietly sat in one corner and waited for the former’s decision. However, he believed that the young man in front of him would not disappoint him. The three years of tough training had allowed Yao Lao to completely understand the viciousness and stubborness that was hidden in the young man’s heart. The young man had put in a lot of effort for the ‘Heavenly Flame’. Now that it was time to bear fruit, his character would definitely not allow him to give up.</p><br/><p>“Since you won’t give up… then seize it! Live or die, strong or weak, will be chosen from this moment.” Yao Lao’s eyes drooped slightly as he muttered softly in his heart.</p><br/><p>Time ticked by in silence. At one moment, the quietly seated young man’s body suddenly trembled slightly. He inhaled a long breath of hot air and slightly raised his head, revealing the side of his face that was gradually escaping from immaturity. He smiled slightly at Yao Lao who was still maintaining his silence by the side and Xiao Yao then waved the flame seed in his hand. In a soft voice, he said, “Teacher, I’m starting!”</p><br/><p>Hearing this, a gratified and gentle smile appeared on Yao Lao’s old face. He slightly nodded his head and said softly, “I wish you success. Believe in yourself. You will not fail.”</p><br/><p>“Ke ke, I have always had confidence in myself.” A brilliant smile appeared on the young man’s delicate and handsome face. He slowly lifted the flame seed in his hand, pausing for a moment, before suddenly throwing it into his wide open mouth.</p><br/><p>Once the green-colored strip of lava entered his mouth, Xiao Yan immediately closed his mouth tightly. At the same time, his entire body seemed to have been struck by lightning. It trembled intensely and his face which originally had some blood color suddenly turned pale.</p><br/><p>Forcefully withstanding the waves of searing pain from within his body, Xiao Yan slowly closed his eyes and his mind gradually descended into his body.</p><br/><p>When his mind sunk into his body, a foggy and misty sensory world immediately appeared within Xiao Yan’s heart. Currently, there were many Qi Paths in his body that were damaged. The green-colored lava that had entered his body earlier had already been divided into threads of tiny green-colored flames. These green-colored flames contained a terrifying energy randomly passed through his Qi Paths. Anything that blocked the path in front of them would be instantly incinerated by them into nothingness.</p><br/><p>As these green-colored flames passed by, the terrifyingly high temperature still managed to seep into Xiao Yan’s Qi Paths despite them being protected by the blood film coagulated from the ‘Blood Lotus Pill’. Although the remnant heat from what seeped through was not very hot, it undoubtedly still had a destructive impact on the weakest part of the human body, the Qi Paths…</p><br/><p>Under the grilling from these high temperatures, the originally spacious and tough Qi Paths had been twisted like scarred skin, giving them an extremely strange and terrifying appearance.</p><br/><p>Naturally, the pain that was created from his Qi Paths being grilled, until they were completely twisted, directly resulted in Xiao Yan’s body repeatedly convulsing. The muscles all over his body tightened and bulged like worms. His pale white face did not have the slightest color of blood.</p><br/><p>Within the Qi Paths, the green-colored flame wildly shuttled through. In just a few minutes, the inside of Xiao Yan’s body was destroyed until it was a mess. The worst thing was that the medicinal effect of the ‘Blood Lotus Pill’ was mostly depleted by the ‘Heavenly Flame’. The dissipated blood film no longer had replacements from the medicinal strength of the ‘Blood Lotus Pill’.</p><br/><p>Under the premise of having the protection from the blood film, the inside of Xiao Yan’s body was still damaged by the terrifying ‘Heavenly Flame’ until this nearly crippled state. Should the blood layer disappear, everything in Xiao Yan’s body, including his Qi Path, bones, heart etc, would be incinerated by the ‘Green Lotus Core Flame’ into nothingness within an extremely short time. When that happened, Xiao Yan, who had lost his essential organs to maintain his life would only be left with the path of death.</p><br/><p>The blood film swiftly became thin under the burning of the ‘Green Lotus Core Flame’. Just as the blood film turned into an transparent state where it was about to volatilize, a warm and cool item was pressed into Xiao Yan’s hand. At the same time, Yao Lao’s grave voice sounded, “Consume the ‘Icy Spirit Cold Fountain’. After that, direct it to circulate within the Qi Paths of your body and raise the familiarity between the energy of the cold fountain and the Qi Paths. Once you complete the circulation, use the Dou Qi to wrap around the ‘Heavenly Flame’ and direct it to circulate through the route of the ‘Flame Mantra’ Qi Method before swallowing it!”</p><br/><p>Xiao Yan nodded in his heart. He swiftly grabbed the jade bottle, squinted his eyes and nestled it close to his mouth. Immediately, an icy flow that was strong enough to cause the human body to become an ice sculpture, suddenly flowed into Xiao Yan’s mouth and entered his body.</p><br/><p>The bone piercing iciness of the cold liquid flowed through Xiao Yan’s throat while felt as if that that section of his throat had been coagulated into an icy roll. His entire body shivered while strands of icy threads hovered over his hair.</p><br/><p>The icy flow charged into his body and followed the Qi Paths as it began to flow in all directions. When the icy flow passed through any Qi Path, it would quickly form a cream layer of ice that covered his Qi Path and bones.</p><br/><p>When the icy flow entered Xiao Yan’s body, its bone piercing coldness coincidentally neutralized the heat in his body that was caused by the ‘Heavenly Flame’. The sudden comfortable feeling caused Xiao Yan to let out a long sigh. His originally extremely pale face also regained some color.</p><br/><p>As the icy layer covered every part of his body, Xiao Yan’s mind also began to attempt to come into contact with a wisp of ‘Green Lotus Core Flame’ that was passing through his Qi Paths. However, his initial contact caused Xiao Yan to feel a great headache. This kind of ‘Heavenly Flame’ energy was extremely wild by nature. It was like trying to pull back a stubborn bull to get it to follow orders and was clearly not an easy thing.</p><br/><p>After his attempt at controlling the flame failed, Xiao Yan did not give up because of it. He spurred on his mind and persistently attempted to control this wisp of ‘Heavenly Flame’.</p><br/><p>One failure, two failures, three failures… after failing an unknown number of time, Xiao Yan, who had tried until he had nearly become numb, suddenly felt his heart leap. He hurriedly steadied his mind and was filled with unrestrained joy as he realized that the wisp of ‘Green Lotus Core Flame’ which had randomly passed through this Qi Paths had actually begun to go along the route that his mind had pulled it through.</p><br/><p>Sensing this situation, Xiao Yan’s spirit was immediately raised. He hurriedly but carefully controlled this small wisp of ‘Green Lotus Core Flame’ and began to slowly circulate it through the correct Qi Path route.</p><br/><p>In his Qi Paths, that were full of holes, a wisp of green-colored flame slowly flowed. Along the way, when it melted the nearby ice layer, a faint white-colored fog would shroud the Qi Paths again. A moment later, the white vapor would transform into some icy crystals that were pasted around Qi Path, creating a barrier to protect the Qi Path from the erosion of the ‘Heavenly Flame’.</p><br/>\n</div>"}