{"title": "Chapter 231: Repairing And Strengthening", "id": 231, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-231-repairing-and-strengthening", "volume_title": "Volume 3", "body": "<h1>Chapter 231: Repairing And Strengthening</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 231: Repairing And Strengthening</u></strong></p><br/><p>Within the mountain cave, the green-colored light cover emitted a high temperature. On top of the light cover, a flame writhed intensely, resulting in any gaze from outside having difficulty in clearly seeing the situation that was happening within it.</p><br/><p>Floating in midair, Yao Lao eyed the green-colored flame cover and sighed. His tense face also gradually relaxed. Since Xiao Yan had already finished everything up to this step, then the chances of him successfully refining the ‘Heavenly Flame’ should at least be around seventy percent. His final task was to store the overbearing ‘Green Lotus Core Flame’ into the Acceptance Spirit. After this happens, the ‘Green Lotus Core Flame’ will have completely become Xiao Yan’s Origin Flame Seed…</p><br/><p>“Once he has completed the steps for refining the flame seed, the next step will be to use the ‘Green Lotus Core Flame’ to evolve the ‘Flame Mantra’. With the strength of the ‘Green Lotus Core Flame’, it is likely that the ‘Flame Mantra’ will be able to directly leap to the Xuan Class this time around.” Yao Lao said with a smile.</p><br/><p>After he laughed softly, Yao Lao once again maintained silence. As he became quiet, the mountain cave also slowly descended into silence. A wave of cool mountain wind blew in from the gaps in the wall, clearing out the hot air from within.</p><br/><p>In the mountain cave, the round shaped light cover flame was emitting a faint green glow. On top of the light cover, the green glow brightened and dimmed. The glow shot onto the mountain wall, as though green-colored water lines had been wrought on the latter.</p><br/><p>Within the interior of the light cover, Xiao Yan was seated cross-legged on top of the green lotus. The current him was in a type of unconscious and mysterious state. The mind in his body had become extremely exhausted after having contended with the ‘Green Lotus Core Flame’ from before. It floated within his body without him being aware of it but had difficulty coagulating.</p><br/><p>While Xiao Yan belonged to this muddle headed half unconscious state, the ‘Green Lotus Core Flame’ that was slowly flowing within the Qi Paths in his body suddenly began to follow the Qi Path routes of the ‘Flame Mantra’ and began to circulate without anyone controlling it…</p><br/><p>Perhaps it was because the current ‘Green Lotus Core Flame’ had been refined by Xiao Yan earlier but it now no longer released any type of terrifying temperature. Instead, it had become somewhat cool. As it flowed along the Qi Paths of Xiao Yan, wisps of tiny green-colored lava would divide from the flame and paste themselves into the Qi Path walls that had been damaged to the point that they nearly lost the ability to contain Dou Qi. The wips wiggled slightly and actually began to gradually merge into the walls of the Qi Paths.</p><br/><p>As the green-colored lava passed through his Qi Paths and with the withering faint flame seedlings patching his Qi Paths, the originally twisted Qi Paths of Xiao Yan that appeared like the stem of a Gentian Vine instantly began to stretch and open up like leaves and grass encounting water in the desert.</p><br/><p>A countless number of Qi Paths in Xiao Yan’s body produced excited squeals at this moment. The green-colored lava liquid that the ‘Green Lotus Core Flame’ had left behind would be swiftly swallowed at a terrifying pace by the repeatedly stretching and shrinking Qi Paths.</p><br/><p>Following the greedy consumption by the Qi Paths, the gray white color in them gradually withdrew. Replacing it was a pale-green color that was flooded with vitality.</p><br/><p>The ‘Green Lotus Core Flame’ flowed along one Qi Path after another. Wherever it passed through, vitality would once again appear in the shrivelled Qi Paths. The cracked bones and burnt flesh were also swiftly recovering at a gratifying speed… Moreover, the extent of the toughness of the completely repaired Qi Paths, bones etc, had far exceeded their original strength before the swallowing of the ‘Heavenly Flame’. Clearly, although the ‘Green Lotus Core Flame’ brought about an immense destruction to them, the compensation it paid also caused these essential organs in his body to feel that it was worth it.</p><br/><p>During the time that the ‘Green Lotus Core Flame’ repaired the interior of Xiao Yan’s body, his skin that was covered with blood scars and blood seams in the outside world was also gradually merging together. The blood scabs swiftly formed and then fell, leaving no trace of a scar behind. The flesh below the skin was also quickly being strengthened. Although Xiao Yan’s muscles did not transform into something that could be compared with those muscular men, when he bent and stretched his arms by reflex, an explosive like strength would be faintly shown.</p><br/><p>On the skin of Xiao Yan’s body, layer after layer of dried skin began to swiftly fall off, much like a snake shedding its skin. The new skin turned the bronze skin, that Xiao Yan had gained after undergoing tough training in the desert for a few months, back into its original pale white. Although the new skin appeared like the delicate skin of a lady, it possessed a greater defensive strength and sensitivity to the natural energy in the surrounding environment that was many times that of what it was in the past.</p><br/><p>The current Xiao Yan was in a mysterious state: the enormous and near terrifying energy that the ‘Green Lotus Core Flame’ contained was swiftly strengthening and repairing his broken body. If one were to explain it, it was really a windfall.</p><br/><p>The repairing and strengthening was slowly being carried out. After the ‘Green Lotus Core Flame’ exited the last damaged Qi Path, the seriously damaged insides of Xiao Yan’s body were completely repaired until they had reached near perfection.The fighting strength that this new body could be capable was definitely much stronger than what his previous body could.</p><br/><p>As there was no one controlling it, after the ‘Green Lotus Core Flame’ had completed the repairs inside and outside of Xiao Yan’s body, it had nothing to do and began to turn its gaze toward the Qi vortex in Xiao Yan’s lower abdomen that was almost completely exhausted.</p><br/><p>The current Dou Qi vortex had already become very empty because of the crazy squandering from before. There were only three drops of purple-colored liquid energy remaining in it and were swimming lonesomely, giving it a desolate appearance.</p><br/><p>The ‘Green Lotus Core Flame’ slowly circled around the vortex. After it stilled for a moment, it suddenly dove into the vortex.</p><br/><p>When the ‘Green Lotus Core Flame’ entered, the calm vortex that was like a pond of stagnant water, the vortex suddenly surged intensely. Circle after circle of energy ripples continued to form waves within the interior of the vortex.</p><br/><p>The green-colored lava formed from the ‘Green Lotus Core Flame’ flowed within the vortex. The three drops of pitiful purple-colored liquid energy appeared to be intending to flee from the lava. However, the instant they came into contact with the green-colored lava, they were incinerated into nothingness as though the latter was cleaning away the dregs. After the remaining three drops of liquid energy was incinerated by the ‘Green Lotus Core Flame’, this vortex that was meant for Xiao Yan to store Dou Qi was completely seized by the ‘Green Lotus Core Flame’.</p><br/><p>Once it had finished forcefully occupying the vortex, the green-colored lava slowly roamed around. A long while later, threads of green-colored pure gaseous energy began to emerge from within it and began to swiftly gather together within the vortex. In only just a moment, the empty interior of the vortex was filled with this pale-green-colored energy.</p><br/><p>The green-colored gaseous energy swiftly expanded within the vortex. As more and more gaseous energies flowed out from within the green-colored lava, a faint moisture began to shroud over the vortex. After another moment had passed, a small droplet of green-colored liquid energy suddenly emerged…</p><br/><p>After the appearance of the first drop of green-colored liquid energy, it appeared to have started a chain effect within the vortex. Drop after drop of emerald like green-colored liquid began to continuously appear from the energy fog and fall into the interior of the vortex, where they behaved like mischievous small fish.</p><br/><p>Drop after drop of liquid energy that Xiao Yan usually needed over ten days of training to agglomerate and form had at the moment, descended like it was drizzling. The dripping sound continued to splash and within a short time, the liquid energy in the vortex had actually been filled till it was nearly half full.</p><br/><p>Back then, from a one star Dou Shi to a two star Dou Shi, Xiao Yan had agglomerated a total of fifteen droplets of liquid energy. Currently, the total amount liquid energy within the vortex would at least be over a hundred droplets.</p><br/><p>If fifteen droplets of liquid energy was a two star Dou Shi… What about a hundred droplets? How many stars was that?</p><br/><p>If Xiao Yan was currently conscious, he would likely rejoice until he could jump to the heavens. Naturally, this was all due to the blessing of his half unconscious and muddled state. Otherwise, this ‘Green Lotus Core Flame’ which had nothing better to do would definitely not be so kind as to use its own energy to help Xiao Yan repair his body.</p><br/><p>When the number of liquid energy in the vortex hit a hundred droplets, the lazily roaming ‘Green Lotus Core Flame’ suddenly ceased its action of continuing to create energy. It moved its body slightly and began to swim towards the tiny grey-colored light at the middle of the vortex. Looking at the glow, the somewhat bright lava body appeared to be like a child who had found a beloved toy.</p><br/><p>The tiny grey-colored light was suspended in the middle of the vortex. Within the light, was an endless and profound darkness. The end of the darkness appeared to be hiding another space, giving it an extremely mysterious appearance.</p><br/><p>The ‘Green Lotus Core Flame’ roamed around the spot where the grey-colored light was. It seemed to be very curious about this thing. On a few occasions, it wanted to touch it but its actions held some hesitation; perhaps because of a thread of fear lingering somewhere. After undergoing thousands of years of honing underground, some spiritual intellect had appeared in the flame spirit. It vaguely knew that if it touched this grey-colored light, it would forever lose its freedom…</p><br/><p>The green-colored lava slowly circled around the spot of light. After deliberating for a few times, it finally gave up this risky action. It was unwilling to lose its freedom because of a new toy.</p><br/><p>After circling for another round, the green-colored lava did not linger as it wiggled its body, turned around and began to leave this place that made it feel uneasy.</p><br/><p>However, just as the ‘Green Lotus Core Flame’ was thinking of leaving, Xiao Yan’s unconscious spirit suddenly trembled and he completely woke up.</p><br/><p>After his spirit woke up, Xiao Yan’s mind seemed to swiftly sweep through the inside of his body as a conditional reflex. The totally new things in his body caused him to blink his eyes and feel a little absentminded. However, when his mind swept passed the middle of the vortex and eyed the green-colored lava which was actually only a short distance away from the grey-colored light spot, his heart was startled. An immediate unrestrained joy that was difficult to hide surged in his heart. Without any time to think, his mind suddenly charged into the vortex. After which… Gathering all of it’s strength, Xiao Yan’s mind ruthlessly knocked against the ‘Green Lotus Core Flame’ that had wanted to retreat.</p><br/><p>At the moment of contact, a thunderous crashing sound suddenly blasted in Xiao Yan’s mind. Instantly, there was a wave of intense pain around his head.</p><br/><p>While Xiao Yan was rubbing his head and clenching his teeth to bare the intense pain, the ‘Green Lotus Core Flame’ in the vortex, which was violently knocked by Xiao Yan, immediately moved quite a distance back. Coincidentally… a section of its tail touched the grey-colored light spot!</p><br/><p>The moment it came into contact, the glow in the grey-colored light spot was swiftly dampened. A frightening suction force surged out from twinkling grey light and with a ‘Suo’ sound, pulled the ‘Green Lotus Core Flame’ that could not escape completely into it…</p><br/><p>After storing the ‘Green Lotus Core Flame’, the interior of Xiao Yan’s body finally descended into complete silence…</p><br/><p>This small grey-colored light spot was created from the tiny Acceptance Spirit that Yao Lao had shot into Xiao Yan’s body a while ago.</p><br/><p>The last step of refining the ‘Heavenly Flame’ into an Origin Flame Seed, which was also the most important step, was to forcefully coerce the ‘Green Lotus Core Flame’ into the space created by the ‘Acceptance Spirit’. Only by completely storing the ‘Green Lotus Core Flame’ into the ‘Acceptance Spirit’ would the refining process considered to have achieved perfection!</p><br/><p>This step was originally very difficult. After all, the ‘Flame Spirit’ inside the ‘Heavenly Flame’ had a little ‘Spirit Intelligence’. With regards to everything dangerous, it had an inherent resistance. If one was to forcefully drive it and fail, the ‘Heavenly Flame’ which had completed the initial refining may once again bite back!</p><br/><p>Currently however, Xiao Yan’s previous muddle headed state resulted in the ‘Green Lotus Core Flame’ to not only completely repair his body out of boredom but also to go to where the ‘Acceptance Spirit’ was and circle it because it had nothing to do. Therefore, this allowed Xiao Yan to pay the lowest price to perfectly complete the last step of the refining process. It must be said that this was an opportunity of complete luck...</p><br/>\n</div>"}