{"title": "Chapter 235: Flame Mantra Evolved", "id": 235, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-235-flame-mantra-evolved", "volume_title": "Volume 3", "body": "<h1>Chapter 235: Flame Mantra Evolved</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 235: Flame Mantra Evolved</u></strong></p><br/><p>In the dark space of Xiao Yan’s conscience, a drowsy mind slowly floated. In this dark black environment, it appeared that there was no concept of time. The mind wandered around as though it was a homeless, lonely soul, appearing extremely desolate.</p><br/><p>At a certain moment, an eye-catching green-colored flame suddenly curled upward and surfaced within the dark black space. The light emitted by the green-colored flame expelled all the pitch-black darkness around it. The flame moved slightly and a moment later, transformed into a green-colored lotus seat.</p><br/><p>After the green-colored lotus seat was formed, it suddenly shot through the dark space. In the blink of an eye, it arrived beside the drowsy mind. A warm glow extended out and wrapped the mind within it…</p><br/><p>Once the mind was completely wrapped, the green-colored lotus seat suddenly began to flash past at high speed and the darkness began to swiftly retreat and shrink. A while later, a little white light appeared at the end of the darkness. The lotus seat carried the groggy mind and charged out of this boundaryless space of one’s conscience.</p><br/><p>……</p><br/><p>Under a huge tree in the mountain forest, Xiao Yan leaned again the tree trunk with his eyes tightly closed. His slightly pale face appeared to be swiftly recovering its rosy color.</p><br/><p>Beside him, Yao Lao, who had been attentively taking care of him, sighed in relief when he saw Xiao Yan’s change.</p><br/><p>After a moment passed in this manner, Xiao Yan’s eyelids trembled slightly and he finally began the slow struggle to open his eyes. Immediately, a large amount of piercing sunlight shining down from the sky once again caused him to shrink his eyes slightly.</p><br/><p>“Have you woken up?” Yao Lao’s faint laughter sounded by the side of his ear.</p><br/><p>Lifting his head slightly and seeing the smiling Yao Lao by his side, Xiao Yan also smiled and nodded. His palm gently rubbed against his face, with some hesitation he asked, “That, has the evolution of the Qi Method succeeded?”</p><br/><p>“Ke ke, take a look for yourself.” Yao Lao did not answer him directly as he laughed.</p><br/><p>Xiao Yan nodded his head and crossed his legs which were still sore. He calmed his mind and swiftly entered into the training posture.</p><br/><p>His mind gradually sank into his body. Instantly, the cumbersome to the point of terrifying map of Qi Paths once again surfaced in his heart.</p><br/><p>Xiao Yan’s mind quickly passed through a few Qi Paths before he swiftly arrived at the top of the vortex in his lower abdomen. His mind swept passed it vaguely. He took in a deep breath of non-existent air. At this moment, an excited feeling that left him weak filled his entire body.</p><br/><p>The Dou Qi vortex that appeared under the observation of his mind’s eye was more spacious with an accommodating capacity of over ten times the amount before. The dark green-colored Dou Qi flowing in it was obviously of a quality that was far from what the purple-colored Dou Qi could compare with. It might have been because he had completely digested the ‘Green Lotus Core Flame’, but above the dark green-colored Dou Qi, there were some green-colored flames. With the adhesion of these flames, the fighting strength of the green-colored Dou Qi was clearly more frightening.</p><br/><p>In the Dou Qi continent, the difference in the Qi Method was dependent on a few factors. The first was the accommodating capacity of the vortex holding Dou Qi. Consider two people of the same level, if one of them were to practice a Huang Class Qi Method while the other practiced a Xuan Class Qi Method, then the one practicing the Xuan Class Qi Method would definitely have a far greater battle endurance compared to the former.</p><br/><p>The second factor was the difference in the Dou Qi quality. Under the assumption that both parties had the same level, if the one practicing the Xuan Class Qi Method had to use one unit of Dou Qi, then the one practicing Huang Class Qi Method would have to use ten times or even more than that amount of Dou Qi in order to obtain the same result as the former.</p><br/><p>The third factor was the effectiveness in absorbing the natural energy and refining it into Dou Qi during training. This was similar to the previous point. If two people wanted to absorb the same amount of Dou Qi energy in the air, the one who practiced the Xuan Class Qi Method may only require ten minutes while the Huang Class Qi Method would require a hundred minutes…</p><br/><p>The fourth factor was that in battle, the person practicing the Huang Class Qi Method would never be able to drive the Dou Qi as quickly or smoothly as the person practicing a Xuan Class Qi Method.</p><br/><p>By summarizing the various reasons above, it clearly showed the reason for why countless of people on the Dou Qi continent would view a good Qi Method as the most important thing over any and all other things. The higher the class of the Qi Method one practices, the larger the amount of benefits that it would bring. Therefore, in order to obtain those high class Qi Methods, countless numbers of strong people would come wave after wave. Sometimes, they clearly knew that they were like moths jumping into the fire, yet they were still willing to be swallowed by the flame…</p><br/><p>Xiao Yan was at a loss as he watched the vortex that was as spacious as a small lake. A long while later, he finally gradually began to recover. His mind moved gently and a thread of green-colored Dou Qi immediately flowed out from within the vortex. It then swiftly flowed along some Qi Paths. Following the start of the flow of the Dou Qi, Xiao Yan could clearly feel that a strong force in his body was rising to a peak that he had never been able to achieve in the past.</p><br/><p>As his mind focused intently on the route that the Dou Qi flowed, Xiao Yan realized that the Qi Method route after the evolution had clearly become more cumbersome than before. Strangely, however, the time needed for the Qi Method to complete one circulation had become increasingly shorter despite the route becoming more complex. Moreover, after a circulation had completed, the strong force in his body would be ready to go. At any moment it was available for its owner to drive it and violently unleash that gushing energy…</p><br/><p>“Have I really succeeded?” Feeling that his body was filled with energy, Xiao Yan inhaled a deep breath, because he felt that it was a little unbelievable. Xiao Yan slowly opened his eyes, raised his head and eyed Yao Lao by the side who was full of smiles. He then parted his mouth and muttered, “Have I succeeded?”</p><br/><p>“Yes…” Seeing Xiao Yan’s somewhat comical expression, Yao Lao smiled and nodded his head. He sighed with great emotion before patting Xiao Yan’s shoulder gently with his palm and said with a smile, “Congratulations. You have successfully proven that this ‘Flame Mantra’ can really swallow the ‘Heavenly Flame’! In other words, its potential is limitless…”</p><br/><p>Yao Lao’s words lingered in Xiao Yan’s ear. The latter was smashed by this sudden bliss until he felt his headache. His body weakly leaned against the tree trunk but the unrestrained joy on his face was difficult to hide.</p><br/><p>After being immersed in an unrestrained joy for a long while, Xiao Yan began to recover his frame of mind. He gradually stood up and closed his eyes. A moment later, a green-colored Dou Qi rose from within his body and formed a perfect green-colored Dou Qi cloak on his body in the blink of an eye. On top of the Dou Qi cloak, green-colored flames would occasionally flare about. The hot temperature heated the air until it became slightly distorted.</p><br/><p>When the Dou Qi cloak was completely summoned, a ferocious Qi suddenly erupted from Xiao Yan’s body. Following the eruption of this Qi, the green-colored Dou Qi on Xiao Yan’s body immediately soared skyward. It soared to a height of ten feet in the air before it ceased continuing to rise.</p><br/><p>Raising his head slowly, Xiao Yan eyed the green-colored flame Dou Qi that tightly covered his body. He smiled slightly, tightened his fist suddenly and violently smashed the enormous tree behind him.</p><br/><p>“Bang!” Following a clear muffled sound, Xiao Yan’s fist tore into the tree trunk without any resistance. His palm shook slightly and a veiled force was released. Immediately, a clear ‘Ka Cha’ sound was emitted. Numerous tiny crack lines swiftly spread over the tree trunk. An instant later, the crack lines suddenly expanded. The enormous tree trunk let out a bang as it broke into pieces and collapsed.</p><br/><p>“Bang…”</p><br/><p>Tilting his head to glance at the fallen huge tree not far away, Xiao Yan let out a soft laugh. He once again closed his eyes and felt the Dou Qi flow quickly through his body and its efficiency in fabricating Dou Qi. A moment later, he opened his eyes, eyed Yao Lao and inhaled a deep breath. A brilliant smile appeared on his face. “Xuan Class Middle Level.”</p><br/><p>The Xuan Class Middle Level that Xiao Yan said naturally referred to the level that the ‘Flame Mantra’ advanced to after swallowing the ‘Heavenly Flame’ and evolving the technique. If one were to calculate, it appeared that the Qi Method had jumped from Huang Class Middle Level to Xuan Class Middle level. Between them, it had increased by an entire class.</p><br/><p>Hearing Xiao Yan’s words, Yao Lao was momentarily stupefied. He was immediately relieved as he nodded his head. The weight in his heart slowly fell. At the same time, his tight chest was also completely relaxed. He smiled and praised, “Not bad. It really is worthy of being called the ‘Green Lotus Core Flame’. Although it requires an enormous amount of energy to increase the class of the Qi Method, this appears to not be something difficult for a ‘Heavenly Flame’ to achieve…”</p><br/><p>After letting out a long breath, the Dou Qi flame in Xiao Yan’s body gradually withdrew into his body. He tensed his fist slightly and said with a grin, “Teacher, it looks like your worries from before were unnecessary…”</p><br/><p>“Che, if the Seven-Colored Heaven Swallowing Python had not aided you yesterday, I do not believe that you would have successfully been able to withstand the backlash from the ‘Heavenly Flame’...” Seeing Xiao Yan’s complacent manner, Yao Lao rolled his eyes and curled his lips as he said.</p><br/><p>“Uh…” Recalling the intense pain caused by the swallowing of the ‘Heavenly Flame’, Xiao Yan’s smiling face stiffened. His rosy face once again became slightly pale. He swallowed his saliva and nodded his head with a bitter smile. He was a little scared as he sighed, “That kind of pain was really terrifying. If the backlash from the ‘Heavenly Flame’ succeeded. I’m afraid that even my spirit would have been incinerated into nothingness.</p><br/><p>“This ‘Flame Mantra’ is indeed somewhat strange… I really don’t know what kind of insane person created it. Back then, those people and I put in so much effort in order to find this thing from that damn place…” After speaking until this point, Yao Lao suddenly ceased saying anything more. Clearly, there seemed to be some taboo.</p><br/><p>Unconcerned that Yao Lao had stopped speaking, Xiao Yan shrugged his shoulders and reached his palm into his sleeves, fishing out the Heaven Swallowing Serpent that had curled its body. Currently, she seemed to have descended into a deep sleep perhaps as a result of swallowing quite a bit of the ‘Green Lotus Core Flame’. A faint green-colored glow shrouded its body, giving it a strange appearance.</p><br/><p>“The ‘Seven-Colored Heaven Swallowing Python possesses several different stages. Larvae, Growing, Matured, Peak… The evolution between each stage requires an extremely large amount of energy. The previous her was only at the Larvae stage. Perhaps it was because of the ‘Green Lotus Core Flame’, but she is currently using this large amount of energy to undergo a transformation.” Yao Lao eyed the small seven-colored snake and said with a smile.</p><br/><p>“After the transformation, how strong will she become?” Hearing this, Xiao Yan asked in a somewhat curious manner.</p><br/><p>“Perhaps she will be of the Dou Wang class…” Yao Lao smiled and said, “Once she enters the peak stage, even a Dou Zhong would not dare underestimate her.”</p><br/><p>“She really lives up to the name of being a natural spiritual being. How envious.” Xiao Yan clicked his tongue in amazement as he sighed emotionally.</p><br/><p>“Ke ke. This kind of living creature is very rare. This Seven-Colored Heaven Swallowing Python in your hand may well be the only one in the entire Dou Qi continent.” Yao Lao said with a smile.</p><br/><p>“If that is the case, it is naturally good.” Xiao Yan parted his mouth and laughed. He then carefully placed the Seven-Colored Heaven Swallowing Python into his sleeve, raised his head and eyed the mountain cliff in front of him. His eyes stared at the floating clouds as he lazily stretched his neck. After being silent for awhile, he said softly, “Teacher, how much time remains till the ‘Three Year Agreement’?”</p><br/><p>“Two months.” Yao Lao said faintly.</p><br/><p>“Two months huh…” Xiao Yan laughed softly. His finger gently tapped on his storage ring and the huge Heavy Xuan Ruler once again appeared. Holding the ruler’s hilt tightly, Xiao Yan violently hacked it downwards. The huge rock under his feet immediately burst apart.</p><br/><p>“Nalan Yanran, it’s the last two months. Have you prepared yourself?”</p><br/><p>In the distant mountain forest, a baby eagle that was attempting to fly was trying its best to flap its wings at the peak of a tree. It gave a sharp eagle cry in its efforts. Immediately after, its struggling wings straightened as it suddenly shot up into the sky...</p><br/>\n</div>"}