{"title": "Chapter 244: Charging In", "id": 244, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-244-charging-in", "volume_title": "Volume 3", "body": "<h1>Chapter 244: Charging In</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 244: Charging In</u></strong></p><br/><p>Xiao Yan and a few others were seated in a spacious hall. The rest of the members of the ‘Desert Metal Mercenary Company’ began to busily clear up their headquarters, which had become a mess. Occasionally, when some mercenaries passed by the parlor, they would throw a respectful gaze at the young man seated beside the table who was smiling warmly as he gently sipped his tea.</p><br/><p>The terrified feeling that they had because of Xiao Yan’s vicious action had been sustained for awhile before it slowly disappeared from these mercenaries’ hearts. They were all people who frequently licked the blood from their blades. The extent of toughness of their minds was naturally far greater than that of ordinary people’s. Moreover, since Mo Ran was the enemy of the ‘Desert Metal Mercenary Company’, it was not worthwhile for anyone to show the slightest pity for him. This was because they clearly understood that if Xiao Yan had not arrived in time today, then Mo Ran would not have shown any mercy when killing their brothers.</p><br/><p>(TL: The brothers here does not refer to blood brothers. Rather, it refers to people extremely close to one another)</p><br/><p>Carrying the warm tea cup, Xiao Yan glanced at the mercenaries who were busy outside. On the chair beside him was Hai Bo Dong whose face had remained indifferent. This person who was once the Ice Emperor did not show any friendly smile because of the relationship Xiao Ding and Xiao Li had with Xiao Yan.</p><br/><p>“Old Mister Hai is my friend. His temper may be somewhat temperamental, ha ha, but he is a truly strong person.” Eyeing Hai Bo Dong who had remained quiet ever since he entered the room, Xiao Yan could only helplessly shake his head and tell Xiao Ding and Xiao Li on the opposite side with a smile.</p><br/><p>Xiao Ding smiled and nodded his head. The corner of his gaze swept across Hai Bo Dong. His senses vaguely told him that under the skinny and hunched body of this indifferent old man, there was a terrifying energy.</p><br/><p>“Ke ke, the strong naturally have the temperament of the strong. Otherwise, how can he demonstrate his individuality?” Xiao Ding laughed softly and joked.</p><br/><p>Xiao Yan also laughed. He then inquired after Xiao Li’s injuries before he frowned slightly and asked, “Can you tell me what exactly has happened? Why did the ‘Sand Mercenary Company’ suddenly have so many more strong people. Also, what has happened to that little girl Qing Lin?”</p><br/><p>Hearing Xiao Yan’s questions, the smile on Xiao Ding’s face slowly disappeared. He laughed bitterly and sighed before musing for awhile, seeming to be arranging his words. A long while later, he finally said slowly, “Half a month ago, Qing Lin never returned after going out once. After our investigation, she seems to have been captured by someone. At the place where she disappeared, we found traces of an intense battle. That place also had many snake scales that were covered with fresh blood, which I think have been peeled off from the Two-Headed Flame Spirit Serpent of Qing Lin.”</p><br/><p>“Being able to defeat the Two-Headed Flame Spirit Serpent and capturing Qin Lin, the other party must at least be a Dou Ling.” Xiao Yan’s finger gently knocked against the table’s surface as he knit his eyebrows tightly together. He asked uncertainly, “But who would act against Qing Lin? She is but a little girl. Which Dou Ling would actually lower himself and target her?”</p><br/><p>“We are also not too certain.” Xiao Ding smiled bitterly and shook his head. He continued, “It is also the second day after Qing Lin disappeared when the ‘Sand Mercenary Company’ suddenly began to swallow or clean-up the other strengths in the city. With the strength of the ‘Sand Mercenary Company’ in the Rock Desert City, other than us and two or three other mercenary Companies, it was impossible for the remaining strengths to contend with them. Therefore, in less than five days, the other weak strengths within the city were completely cleared up by them in a lightning like manner.”</p><br/><p>“At this point in time, the mercenary companies with stronger strengths finally realized their intentions. We immediately formed an alliance to fight with the ‘Sand Mercenary Company’. According to our calculation, even if the ‘Sand Mercenary Company’ had Luo Bu, who is a Da Dou Shi, it was impossible for the company to easily defeat our alliance. However, in the next few days that followed, a Da Dou Shi and quite a number of Dou Shis suddenly appeared within the ‘Sand Mercenary Company’.”</p><br/><p>“Under such a large increase in the opponent’s strength, we began to panic internally. After all, it was a loose alliance formed at the last moment. Therefore, it did not have much binding strength. As a result, under the situation of fighting among themselves, the other three mercenary companies ended up with one being destroyed, one surrendered and one which chose to leave this city after giving the ‘Sand Mercenary Company’ a huge payment to beg for peace.”</p><br/><p>“As for us, since the ‘Desert Metal Mercenary Company’ was the most difficult bone to swallow for them, we were left for the last. Explaining what happened today. If you had come a little later, I’m afraid that the ‘Desert Metal Mercenary Company’ would have been annihilated.” Xiao Ding sighed.</p><br/><p>“Do you know about the background of those people who suddenly joined the ‘Sand Mercenary Company’?” Xiao Yan slowly stroked the warm tea cup as he softly asked.</p><br/><p>“We are not sure.” Xiao Ding shook his head. An expression of deep thought appeared on his face and a moment later, hesitatingly said, “I seem to feel that Qing Lin’s disappearance had some relation to the strong people who suddenly joined the ‘Sand Mercenary Company’. After all, the timing of these two events seemed to be a little too coincidental.”</p><br/><p>“That Flame Spirit Serpent that Qing Lin owns should only be known by very few people. Then why would they choose to attack her?” Xiao Yan frowned and the finger that was knocking the table suddenly paused. He muttered in his heart, “Don’t tell it is because of the Triple Jade-Green Snake Flower Pupils?”</p><br/><p>“We also don’t know what’s happening.” Xiao Ding and Xiao Li exchanged glances. Their faces were filled with bitter smiles.</p><br/><p>“You may not know, but I think that Luo Bu that guy should know.” Xiao Yan sat up and smiled. He said, “I will go and find him and see exactly where his courage came from at the same time.”</p><br/><p>“Uh. We will go and gather some people. Let’s go together. They have many people.” Xiao Ding voiced his thoughts.</p><br/><p>“Do what you want.” Regarding this, Xiao Yan was noncommittal as he nodded his head. He stood up and headed out of the door. When he passed by Hai Bo Dong, he smiled and said, “Old Mister Hai, do you intend to follow along?”</p><br/><p>“I’m also bored of staying here, so I’ll follow you to watch the fun. But don’t think of asking me to act. The price for me doing anything is very expensive.” Hai Bo Dong laughed faintly.</p><br/><p>Xiao Yan smiled and nodded before opening his stride and exiting the hall. Behind him, Hai Bo Dong lazily followed. Further behind, Xiao Ding and Xiao Li swiftly gathered over fifty highly capable members and the entire group of people aggressively charged out of the headquarters. Their faces were filled with killing intent as they headed directly towards the territory of the ‘Sand Mercenary Company’, preparing to kill.</p><br/><p>On the main road, when the surrounding passersby saw this group of fierce faced mercenaries who had suddenly leaped out, they hurriedly made way. Immediately, their bizarre gazes eyed this group of men. Soft whispers rang out among themselves.</p><br/><p>“What, aren’t they the members of the ‘Desert Metal Mercenary Company’? Why do they dare to come out during this time? Aren’t they afraid of the ‘Sand Mercenary Company’?”</p><br/><p>“Chi, I had just heard from a member of the ‘Sand Mercenary Company’ that their mission this time around had failed. Their Da Dou Shi also died in the hands of the ‘Desert Metal Mercenary Company’. Right now, it’s likely that these guys intend to go and find trouble.”</p><br/><p>“What? That Da Dou Shi of the ‘Sand Mercenary Company’ is dead? When did a strong person who could contend with a Da Dou Shi appear in the ‘Desert Metal Mercenary Company’?”</p><br/><p>“Yeah, it’s that young man in black clothes leading the group. Hee hee, are you very shocked? But that Da Dou Shi called Mo Ran was really killed by him under the clear view of everyone.” A passerby who seemed to know some insider information eyed the skinny looking young man in front of the group of large mercenaries with a respectful gaze as he said with a laugh.</p><br/><p>“Damn. How can it be? I’m afraid that that young man isn’t even twenty years old. How can he defeat a Da Dou Shi?” The people surrounding the passerby were all stunned and had faces filled with disbelief.</p><br/><p>“Che, wait and see. This time around, I think that the ‘Sand Mercenary Company’ is going to have extremely bad luck. Who asked them to be so arrogant during this period of time. Hee hee.” The passerby laughed in a gloating manner.</p><br/><p>Under the watch of numerous gazes in the city, Xiao Yan’s group passed through a few streets and after ten minutes, the tightly guarded ‘Sand Mercenary Company’ headquarters that was like a metal pail, appeared in everyone’s sight.</p><br/><p>Currently, the ‘Sand Mercenary Company’ had obviously received the information about Mo Ran being killed. Therefore, the entrance had a large number of mercenaries carrying shiny weapons patrolling. Their tensed faces were extremely grave. When they noticed the large group of ‘Desert Metal Mercenary Company’ appear at the end of the street, a panic immediate swarmed onto their faces. A few mercenaries used both their hands and legs to claw into the huge door and rushed to report the matter.</p><br/><p>Watching those ‘Sand Mercenary Company’ mercenaries whose bodies were trembling slightly as they carried their weapons and gathered at the large door, Xiao Yan’s group slowly came to a stop just outside the entrance.</p><br/><p>“This is the territory of the ‘Sand Mercenary Company’. What are all of you here for?” Seeing the group of large men with ferocious faces and fierce eyes blocking the front door, a bony mercenary company roared with a brave exterior while feeling weak inside.</p><br/><p>“Call Luo Bu to get his a*s out.” Xiao Yan picked away at his finger nail before raising his head and told the guy with a smile.</p><br/><p>Silence. Eyeing the young man in black clothes standing right at the front, all of the mercenaries at the door maintained silence. From the mouths of those people who had returned from the ‘Desert Metal Mercenary Company’ just now, they already knew that the Da Dou Shi had died in an extremely miserable condition in this warmly smiling young man’s hands.</p><br/><p>“Forget it, I will just go in and look for him myself.” Seeing the silent mercenaries, Xiao Yan helplessly smiled and slowly took a step forward.</p><br/><p>“Hua hua.” As Xiao Yan took a step forward, the mercenaries at the door immediately hurriedly took a step back with panicked faces. Their orderly footsteps were quite funny to hear.</p><br/><p>“The Company leader issued an order. Kill them at all cost! Whoever kills this black clothed person will be rewarded with fifty thousand gold coins!” In the midst of the silence, a loud shout suddenly sounded from behind the large door.</p><br/><p>As the shout fell, the eyes of the mercenaries at the door immediately brightened. The gazes that they eyed Xiao Yan had less terror and more greed.</p><br/><p>Clearly sensing the change in these people, Xiao Yan gently shook his head. He was too lazy to say any nonsense. After waving his hand to block those ‘Desert Metal Mercenary Company’ members behind him who were preparing to draw their blades, he once again took a step forward.</p><br/><p>“Kill him!” Under that enormous reward, there was finally a mercenary who could not resist the temptation. He tightly held his sharp weapon and charged at Xiao Yan with a ferocious face, intending to kill him.</p><br/><p>His action undoubtedly created a chain effect. Immediately, the mercenaries behind him wore fierce faces as they held their weapons tightly and charged at Xiao Yan.</p><br/><p>Eyeing the tens of mercenaries charging over, Xiao Yan gently exhaled a breath. His hands rotated slightly and was abruptly pushed forward. “Fire Palm!”</p><br/><p>As Xiao Yan’s palm was pushed forward, an uncomparable ferocious force suddenly surfaced. After which, it carried a wind, that had the power to overturn a huge rock, and smashed the chests of the tens of mercenaries.</p><br/><p>“Grug, grug.”</p><br/><p>When the wind smashed on their bodies, it was like they had been struck by a thousand catty (500kg) huge rock. The faces of the tens of mercenaries which were filled with killing intent immediately turned white. Instantly, they began vomiting mouthful after mouthful of blood, as though it had started to rain blood.</p><br/><p>Clapping his palms gently, Xiao Yan glanced at the large door which had become empty in an instant. He turned around and said with a smile to the ‘Desert Metal Mercenaries’ who had completely stunned faces, “Let’s go.”</p><br/><p>Having said that, he took the lead and stepped through the doorway. His blatant manner made it appear as if he was entering his own home.</p><br/><p>Eyeing the back of the young man in front of them, everyone exchanged glances as they felt speechless. Knocking aside tens of ordinary mercenaries with one palm. Wasn’t this person a little too abnormal?</p><br/><p>“Ugh, what an abnormal guy.” Xiao Li sighed. He exchanged glances with Xiao Ding and the both of them shook their heads helplessly before opening their strides and followed.</p><br/><p>The ‘Sand Mercenary Company’ was indeed the most powerful strength in the Rock Desert City. They had just entered the courtyard when over a hundred mercenaries carrying shining weapons immediately surrounded them. Although they had a weaker killing atmosphere compared to the ‘Desert Metal’ mercenaries, they did have some momentum after having so many people gathered together.</p><br/><p>Eyeing the large group of mercenaries blocking his front, Xiao Yan’s footsteps did not pause even the slightest bit. As his palm pushed forward, ferocious forces came from all directions and were extremely overbearing as they surged out. Under the attack of this force, any mercenary below the strength of a five star Dou Zhe would throw up blood and fall back. Only some who had a slightly greater strength were able to block this wide range attacking by Xiao Yan. However, before they had time to rejoice at overcoming Xiao Yan’s driving air attack, the ghost like figure would flash in front of them. A fist that did not appear to be using much power would cause a mercenary to faint from serious injury each time it was weightlessly thrown forward.</p><br/><p>All the way in, as he eyed those ‘Sand Mercenary Company’ mercenaries collapsing on the two sides of the small path repeatedly rolling and groaning, Xiao Yan finally once again experienced the strength of a Xuan Class Qi Method. If this happened in the past, he would only be able to use the ‘Flame Palm’ Dou Technique five times before the Dou Qi in his body announced that it was exhausted. However, the Xuan Class Qi Method he currently had was able to support his random squandering. The difference between them was like that of the earth and sky!</p><br/><p>Going on a rampage throughout the walk, Xiao Yan seemed to have attacked until he formed an addiction. His body turned into a black shadow and shuttled through the mercenary group whose strength was only that of an ordinary Dou Zhe. The places where he flashed by had blood dancing all over the sky and human figures being shot backward.</p><br/><p>Following behind Xiao Yan, Xiao Ding and the rest were speechless as they eyed the mercenaries in front who were repeatedly throwing up blood or thrown backward. Since they had entered the door until now, they did not even have a single chance to attack. The black clothed young man in front of them seemed to have an inexhaustible vigor and Dou Qi. This squandering without any pity caused the people at the side to feel a little heartache.</p><br/><p>Stepping over some fainted mercenaries’ bodies with agile footsteps, their gazes looked around the extremely messy courtyard and sighed gently. This guy could well terminate the entire ‘Sand Mercenary Company’ on his own.</p><br/><p>In the large hall which had its door tightly shut, tens of people were walking about uneasily. As they heard the blood-curling screams that sounded not far outside the door, their faces were completely filled with alarm. A panicked atmosphere covered the interior of the entire hall.</p><br/><p>On the leader’s seat in the hall, Luo Bu’s face was a little pale as he sat on it. The tea cup which he held in his hand trembled slightly. He lifted his head to eye the hall before turning it toward the few people not far from him. These people did not wear the uniform of the ‘Sand Mercenary Company’ Their chests also did not have the badge for the ‘Sand Mercenary Company’.</p><br/><p>“I have already told the few of you that Xiao Ding and Xiao Li of the ‘Desert Mercenary Company’ have a younger brother with a terrifying strength. Yet you all still insisted on destroying them. Look at things now. That guy has returned. Now they have even attacked. How can we resist them?” Luo Bu’s voice appeared somewhat sharp because of his anger.</p><br/><p>“Company Leader Luo Bu, you need not worry too much. That person’s strength is indeed a little strong, but from the situation of his fight with Elder Mo Ran, it is far from the possibility of being a Dou Wang as you have said. Although he finally defeated Elder Mo Ran, he was also slightly injured. Therefore, I guess that his strength is at most a two star or a three star Da Dou Shi. However, Company Leader Luo Bu, you are a four star Da Dou Shi. Why do you need to fear him? Moreover, as long as you endure for this period of time, we will transmit the news and our clan’s First Elder will hurry over. When that time comes, with the elder’s Dou Ling strength, would he be afraid of this lightweight?” The man in his prime who was probably the leader of the group laughed.</p><br/><p>“I don’t know whether or not he conserved his strength in his fight with Mo Ran but back then, he had come to my room in a bizarre manner. I dare say that the kind of speed is something that even a normal Dou Ling would not be able to possess.” Luo Bu’s face was gloomy as he replied.</p><br/><p>“Back then did Company Leader Luo Bu exchange blows with him?” The man asked with a smile.</p><br/><p>“No.”</p><br/><p>“Ke ke, that’s right. Perhaps his speed may be very fast, but in a fight between the strong, speed is not the most important thing. Perhaps that guy only has fast speed.”</p><br/><p>Hearing this, hesitation flashed across Luo Bu’s face. His heart gradually began to think it over. He nodded his head slightly. Back then, because of Xiao Yan’s bizarre appearance, he was shaken until he had somewhat panicked and jumpy. Now that he thought about it, how could a young man that was not even twenty be a Dou Wang? Even if he ate all sorts of natural treasures everyday and high tier medicinal pills, that was definitely impossible.</p><br/><p>Thinking in this manner, the gloominess on Luo Bu’s face gradually disappeared. He clenched his fist tightly and swallowed a mouthful of saliva with a ‘Pei’ sound. He viciously said, “Just as well. This time, let me take a look at just how strong this guy actually this. I really don’t believe that he alone can knock aside the ten plus Dou Shis in here!”</p><br/><p>Seeing the imposing manner of Luo Bu gradually returning, everyone in the hall who had a tensed expression quietly heaved a sigh of relief. At this moment, if even the leader did not possess any intention to fight, it would really be hopeless.</p><br/><p>“Bang!”</p><br/><p>As everyone’s heart gradually became heated up, a bang sounded. The tightly closed door was convulsed into countless broken pieces which shot in all directions.</p><br/><p>In the doorway, the sawdust gradually scattered and a black garment slowly appeared in everyone’s sight.</p><br/><p>“Everyone, is it very fun to hide in here?” A faint joking laughter floated into the hall.</p><br/>\n</div>"}