{"title": "Chapter 252: Nalan Yanran", "id": 252, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-252-nalan-yanran", "volume_title": "Volume 3", "body": "<h1>Chapter 252: Nalan Yanran</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 252: Nalan Yanran</u></strong></p><br/><p>Xiao Yan’s eyes stared intently at the moon robed lady laughing sweetly and softly by the main door. His face which was covered under the dark shadow suddenly turned from a smiling one to a dark one. Although three years had past and both of them had undergone great changes, he could still see the spoiled shadow of Nalan Yanran in that woman!</p><br/><p>His fist was tightly clenched and his nails pierced into his palms, emitting waves of throbbing pain. With unblinking eyes, Xiao Yan stared at the frowns and smiles of the moon robed lady. A fury that was difficult to control abruptly swarmed out of his heart. She had likely spent these last three years at the Misty Cloud Sect in comfort. What about him?? He had narrowly climbed from the blade of death countless of times. Perhaps she did not know but each time when Xiao Yao was about to reach the limit of what he was able bare during his harsh training, he would forcefully clench his fist and cruelly endure it because of her.</p><br/><p>Xiao Yan’s body trembled slightly. Almost immediately, a ferocious Qi suddenly soared from within Xiao Yan’s body.</p><br/><p>“Xiao Yan?” Hai Bo Dong, who was walking behind Xiao Yan could not help but feel at a loss when he sensed Xiao Yan’s unrestrained Qi surging out. He immediately and hurriedly cried softly behind Xiao Yan.</p><br/><p>Hai Bo Dong’s voice that carried some icy Dou Qi was transmitted into Xiao Yan’s ear, causing the latter to gradually recover from the inexplicable emotion that had suddenly surged in his heart. Xiao Yan inhaled a deep mouthful of cool air and slowly closed his eyes. In his heart, he quietly muttered, “How unexpected!”</p><br/><p>Indeed, it was unexpected. During the three years, the beautiful woman not far in front of him was practically the motivation for him to forcefully bear the lonely tough training. Now that he had suddenly meet her, the emotions he was feeling had almost caused him to act on impulse and forget everything else.</p><br/><p>“It is indeed very unexpected…”</p><br/><p>Yao Lao’s pacifying laughter also slowly sounded in Xiao Yan’s heart. Having been accompanying Xiao Yan during the tough training the entire time, Yao Lao naturally clearly understood just what kind of deep imprint the woman in front had in Xiao Yan’s heart. Even though the imprint was left behind after her trampling of Xiao Yan’s pride, regardless of how one said it, the position this woman held in Xiao Yan’s heart may well be comparable to Xun Er whom Xiao Yan cared about immensely. Of course, Xiao Yan had totally different directions and emotions to the two.</p><br/><p>From a certain perspective, if a woman was able to cause a man to remember her fiercely at every moment, she seemed to have succeeded regardless of what was her intentions were.</p><br/><p>Extending his hand into the black robe, Xiao Yan used a great amount of strength to rub his face until treads of bright red surfaced on his delicate and handsome face. Only then did Xiao Yan stop. He inhaled deeply a couple of times. Finally, he gradually completed the adjustment of his mood. His gaze contained some coldness as it swept across Nalan Yanran and the old man beside her whom had also left Xiao Yan a poor impression. In his heart, he softly asked, “Teacher, can you check what is her current strength?”</p><br/><p>Hearing this, Yao Lao was quiet for a moment. A moment later, he replied, “Cannot…”</p><br/><p>Hearing these words, Xiao Yan’s heart suddenly sank. He was stunned as he let out an involuntary cry in his heart, “Cannot? How can that be? With Teacher’s strength, you are actually unable to find out her foundation? Don’t tell me that in these three years she has actually soared to a Dou Huang or higher?”</p><br/><p>“What nonsense are you saying?” Seeing Xiao Yan losing himself to such an extent, Yao Lao didn’t know whether he should laugh or cry. He continued, “It is not because of her that results in me being unable to probe her true strength. Her body is covered by a layer of energy film. It is this layer of energy film that blocks my Spiritual Perception from probing.”</p><br/><p>“With my experience, she should be carrying some kind of item that could cut-off people’s probing. Therefore, you need not be overly worried. When you fight with her in the future, her true strength will naturally be found out.” Yao Lao comforted.</p><br/><p>“Hu…” Hearing this, Xiao Yan sighed in relief. He slowly suppressed the emotions in his heart, turned his head around and said softly to Hai Bo Dong at his side, “I’m fine.”</p><br/><p>“What happened to you?” Hai Bo Dong was somewhat surprised as he stared at the young man by his side who was covered under the black robe. During this period of time they had gotten to know each other, this was the first time Hai Bo Dong had seen Xiao Yan lose himself to the point that he could not control the Qi in his body.</p><br/><p>“It’s nothing.” Xiao Yan shook his head vaguely. He then raised it slightly and realized that numerous stunned gazes were thrown at him within the interior of the hall because of the Qi that he had suddenly let erupt a moment ago.</p><br/><p>Within these gazes, Xiao Yan could clearly sense a cool gaze that carried a little curiosity. Lifting his head slightly, his gaze passed through the black cover and coincidentally exchanged gazes with the moon robed lady standing by the main door.</p><br/><p>He stared intently at the beautiful and moving appearance. From within, he could even vaguely see the profile of the young lady back then. Slowly exhaling a breath, Xiao Yan’s fist gently pounded on his chest and forcefully suppressed the tread of anger that had once again rose in his heart. He faced Hai Bo Dong beside him and softly said, “Let’s go.”</p><br/><p>Seeing Xiao Yan’s actions which had become inexplicable for a while, Hai Bo Dong was at a loss. Some time later, his gaze swept towards the moon robed lady at the main door and his eyebrows were knit together. In his heart, he seemed to vaguely understand something.</p><br/><p>Hai Bo Dong helplessly shook his head and swiftly followed. With one in front and one in back, Xiao Yan and Hai Bo Dong walked toward the main door.</p><br/><p>Eyeing the two mysterious people whose entire bodies were wrapped under black robes, Nalan Yanran was somewhat interested as she blinked her long eyelashes. Her gaze paused on Xiao Yan’s body for a moment. For some unknown reason, this black robed person kept giving her an inexplicable feeling. Of course, this feeling was natural, not the type between a man and a woman. Instead, it was something like sensing an enemy.</p><br/><p>Nalan Yanran’s white hand rubbed her forehead as she threw this somewhat ridiculous and inexplicable thought out of her head. She tilted her head to eye Ling Lin by her side and softly laughed, “I think that those two should be the ones that offended you yesterday, right?”</p><br/><p>Ling Lin nodded her head in embarrassment. The corner of her eyes swept across the two black robes somewhat timidly. She knew that with even her status, she was actually no different from an ordinary person in the eyes of such strong people. If she really infuriated these people, it would be nothing amazing if they killed her in anger.</p><br/><p>Seeing that Ling Lin nodded her head, Nalan Yanran turned around and softly asked Ge Ye, “Uncle Ge, can you see through these two people’s strength?”</p><br/><p>“Miss, aren’t you overestimating these old bones of mine?” Hearing this, Ge Ye bitterly laughed and shook his head. His turbid gaze was like an eagle as he stared at the two people slowly walking over. He sighed, “I cannot see through the foundation of either one of these people. Clearly, their strengths far surpass mine.”</p><br/><p>Hearing these words of Ge Ye, shock flashed past Nalan Yanran’s pretty face. During these three years, Ge Ye had already successfully broke through to having the strength of a two star Dou Ling from a seven star Da Dou Shi back then. Although this involved the help of Elder Gu He’s medicinal pill, his current strength could be considered that of a strong person. Someone who could obtain such an evaluation from Ge Ye would likely at least have the strength of a five star or even a seven star Dou Ling and above!</p><br/><p>“What Teacher said is indeed true. There are really quite a number of strong people hiding in the Jia Ma Empire!” Nalan Yanran sighed softly in her heart. Although she had the intention of getting acquainted with such strong people, the dressing of the two people clearly indicated that they did not want others to know their identities. Since it was like this, Nalan Yanran would naturally not take the initiative to bring contempt to herself. Regardless of how one said it, her status did not allow her to lower herself in this manner.</p><br/><p>“Junior Yanran, haha, I’m really sorry. There have been many things in the clan these few days that caused us to almost neglect our important guest.” A clear laughter suddenly rang out from the main entrance. Soon after, a young man who was handsome walked in with a face that was full of smiles. He faced Nalan Yanran and intimately said with a smile.</p><br/><p>Eyeing the handsome young man who had entered the door, Xiao Yan’s footsteps once again paused slightly. A strange feeling rose within his heart. This was because he realized that this young man was the young handsome fellow who had accompanied Nalan Yanran to the Xiao clan’s home three years ago and causing the romantic females in the clan to adore him greatly.</p><br/><p>“Ke, looks like the atmosphere today is really positive. These three people have actually once again gathered together.” Xiao Yan shook his head and said coldly in his heart.</p><br/><p>“Senior Mo Li, you are too polite.” A smile surfaced on her pretty face as Nalan Yanran suddenly said to the young man. The smile was reserved and did not become any gentler because of the heat in the young man’s eyes.</p><br/><p>Seeing Nalan Yanran’s soft smile, a disappointment quickly flashed across the eyes of the young man called Mo Li. After living together for a few years, the lady whom he viewed as the goddess in his heart appeared not to have any emotions toward him. This really caused him to feel somewhat dejected in his heart.</p><br/><p>The disappointment in Mo Li’s eyes was quickly hidden as he smiled and said, “Junior Yanran, why don’t you come with me to the Mo clan later? It so happens that it’s in the same direction.”</p><br/><p>Hearing this, Nalan Yanran hesitated slightly before immediately nodding her head with a smile.</p><br/><p>Seeing Nalan Yanran nodding her head, Mo Li was somewhat secretly pleased in his heart. Regardless of what happened, there were at least some results after having lived together for these few years. If it were someone else who asked this, Nalan Yanran might well reject this invitation in her reserved manner. Therefore, he believed that with his extraordinary training talent and great appearance, this future Misty Cloud Sect leader should be unable to escape from his palm as long as he persisted on.</p><br/><p>“As long as she really becomes my woman in the future, who in this Jia Ma Empire would dare offend me?” A wild ambition that no one knew silently rose in his heart. Mo Li’s gaze suddenly swept to Xiao Yan and Hai Bo Dong who were slowly walking toward the door. He recalled the report today from his uncle in the clan and hurriedly took a few steps forward. He was full of smiles as he went forward to greet them.</p><br/><p>Seeing Mo Li’s action, Nalan Yanran also threw her gaze over with some interest. She was also somewhat interested in these two mysterious black robed people.</p><br/><p>“Hehe, two sirs, I am Mo Li of the Mo clan. Yesterday, I heard that my sister had accidentally offended you two sirs. My father has dispatched me to apologize to you two sirs.” The smile on Mo Li’s face looked quite sincere. “Today is a joyous day for the Mo clan. If the two of you do not mind, would you two give us some face and come to the gathering?”</p><br/><p>It must be said that when this Mo Li spoke, he covered all angles and easily gave people a good impression. However, it undoubtedly did not have the slightest effect on Xiao Yan who already had negative feelings towards him.</p><br/><p>Pausing his footsteps, Xiao Yan’s eyes looked at Mo Li in front of him with some mockery. He thought in his heart: “If Mo Li was to know that the person whom he had respectfully addressed as sir was the useless young master whom he could deal with with one hand back then, what kind of interesting expression would he show?”</p><br/><p>Xiao Yan laughed in his heart. He lifted his head slightly and said indifferently, “There is no need for your invitation. Our current aim is to hurry to the Mo clan. I think that not long later, Young Master Mo should be able to see us at the Mo clan’s home.”</p><br/><p>Having said that, Xiao Yan passed straight by Mo Li and the two slowly walked out of the main door. Finally, they disappeared in the street where people come and go.</p><br/><p>Standing at the main door, Nalan Yanran slightly knit her eyebrows together. In a soft voice, she muttered, “Why does that voice give me a familiar feeling?”</p><br/>\n</div>"}