{"title": "Chapter 255: Smashing the Scene", "id": 255, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-255-smashing-the-scene", "volume_title": "Volume 3", "body": "<h1>Chapter 255: Smashing the Scene</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 255: Smashing the Scene</u></strong></p><br/><p>The sudden appearance of the black robed human figure abruptly attracted all the gazes over. After everyone felt somewhat stunned, they immediately eyed Mo Cheng, whose expression had suddenly become dark. At the moment, everyone mourned for that black robed person in their hearts. With Mo Cheng who was extremely particular about his reputation, finding fault with him on such a place and occasion was undoubtedly touching a taboo.</p><br/><p>The black robed person who had suddenly appeared also caused Nalan Yanran and Ge Ye to be shocked as they exchanged glances. They had recognized this black robed person to be the one they had met at the inn today. Their eyebrows were pressed together. Clearly, this mysterious black robed person did not come with good intention.</p><br/><p>“Who are you?” Mo Cheng’s gaze coldly and darkly glanced at the black robed person below before asking in a deep voice as he frowned.</p><br/><p>“You should be Mo Cheng, no? I have been looking for you to inquire about some things.” The voice that was emitted under the black robe was young and smooth. It did not have any change because of the biting expression of Mo Cheng.</p><br/><p>“Today is a joyous day in our Mo clan, could you please give us some respite. If you have anything, we can discuss after the banquet is over tomorrow. Is that fine?” Hearing the young man’s voice, Mo Cheng’s heart sighed in relief. His shriveled hand was slowly extended out of his sleeves and curled up slightly. A wild and stormy fire type Dou Qi agglomerated around his palm, emitting a dark red glow, marking his palm strangely.</p><br/><p>Hearing Mo Cheng’s words which contained some thick cold killing intent, the black robed person shook slightly. The person inside appeared to be shaking his head helplessly. A moment later some presumptuous words that caused everyone seated to be completely stunned were gently transmitted, “Give you face? What right do you have to say these words? Your Mo clan may be quite a strong in the north-eastern region, but ultimately, it is merely a dog of the Misty Cloud Sect.”</p><br/><p>Once these words were said, everyone in the hall was dull. Numerous startled gazes were thrown at the black robed person who had said such presumptuous words. Did this person really intend to anger this butcher who had once massacred the ‘Black Rotary Bandit Troop’ until their blood flowed like a river?</p><br/><p>On the high platform, Nalan Yanran pretty face changed slightly upon hearing the black robed person’s tone. Ever since she had become a disciple of the Misty Cloud Sect, she had not seen anyone who could mention the Misty Cloud Sect in such an indifferent manner.</p><br/><p>Mo Cheng stared intently at the black robed person below. His old face appeared a little savage. The corner of his mouth twitched slightly as he waved his palm. Immediately, the surrounding doors of the hall were kicked open. Tens of fully armed strong people of the Mo clan streamed in with killing intent as they surrounded the black robed person.</p><br/><p>“Ever since the old me had become the First Elder of the Mo clan, you are the first person in so many years who has dared to come to the Mo clan to find trouble.” Mo Cheng tone was thick as he said.</p><br/><p>The black robe was lifted slightly and Mo Cheng seemed to be able to sensed the mocking gaze under the black robe. After the words emitted from under the black robe, the rolling killing intent in his heart was finally beyond what he could endure and it rose boldly.</p><br/><p>“Stop putting down those boring malicious words. You did not guess wrongly. Today, I am indeed here to smash the place. Old Geezer of the Mo clan.” The black robed person’s words carried a soft laughter as it once again startled the entire place.</p><br/><p>“Good, good! Ha ha, brat, you are bold!”</p><br/><p>As he clenched his teeth and laughed loudly, a strong Qi suddenly erupted from within Mo Cheng’s body. His clothes bloated with a ‘hu hu’ noise. Immediately, the chairs and tables around him burst with a bang under pressure from this Qi.</p><br/><p>“This old fellow’s strength is growing increasingly strong.” Feeling the pressuring Qi that was slowly spreading through the entire hall, a surprise flashed across Ge Ye’s eyes.</p><br/><p>“Uncle Ge, do we need to intervene?” Nalan Yanran eyed that rattling Qi, tilted her head and asked Ge Ye softly.</p><br/><p>“Let’s wait and see. This black robed person is not simple. The Mo clan has recently been overly arrogant. Some of the elders in the sect had already begun to be dissatisfied with Mo Cheng. Letting Mo Cheng face some hardship this time around will cause him to restrain himself a little. Otherwise, he would keep feeling that this Jia Ma Empire no longer has any strong people.” Ge Ye shook his head and voiced his thoughts.</p><br/><p>Feeling the pressuring force that had spread out from Mo Cheng’s body, the expression of the surrounding guests began to change. They had not seen Mo Cheng act in these few years. It was unexpected that his strength had grown by so much.</p><br/><p>“It’s likely that he has the strength of at least a five star Dou Ling, no? In only slightly more than two years, this old fellow actually managed to raise his strength by around three stars. He really is terrifying.” Everyone faced each other and sighed quietly in their hearts.</p><br/><p>Eyeing the face of their own elder which was filled with killing intent, the surrounding strong people of the Mo clan all held their weapons tightly. They stared at the black robed person with faces filled with fierceness. Dou Qi began gushing out of their bodies as they prepared to swarm forward any time, cutting this person, who had an exaggerated opinion of his ability, into a pile of meat paste.</p><br/><p>“The main reason that I have come to the Mo clan is because of someone.” Ignoring the inflating Qi of Mo Cheng, the black robed person was quiet for a moment before speaking, “Hand over the little girl called Qing Lin that you have captured from the Rock Desert City.”</p><br/><p>Once the words of the black robed person was said, Mo Cheng’s face suddenly changed drastically. This time around, he did not say any other unnecessary words. With a face that was as cold as a pile of ice, he waved his hand and darkly ordered in a soft voice, “Kill him!”</p><br/><p>Following Mo Cheng’s order, the surrounding strong people of the Mo clan let out a vigorous cry. A few strong people of the Dou Shi class swiftly summoned their Dou Qi cloak and hacked the large blades in their hands violently at the black robed person.</p><br/><p>The black robed person stood on the spot and did not make any attempt to dodge. When those ten plus sharp large knives were about to hack at his body, a thick white flame suddenly surged out from within his body and covered him.</p><br/><p>“Chi…”</p><br/><p>In front of the numerous shocked gazes, the sharp large knives that were covered in Dou Qi were actually turned into a pool of hot metal liquid with a ‘chi chi’ sound in an instant upon coming into contact with that layer of strange thick white flame.</p><br/><p>After that thick white flame incinerated those huge knives, a few wisps of flame seedlings leaped out. Immediately, the flame seedling pounced onto the bodies a few unlucky people who could not dodge in time. At that instant, only a soft muffled sound could be heard. These few strong people of the Mo clan did not even let out a blood-curdling screech before they were turned into a cluster of black colored ashes that sprinkled the floor.</p><br/><p>“Hiss…”</p><br/><p>The horrible sight of the few strong people of the Mo clan immediately caused the sound of the inhalation of a breath of cold air to erupt contagiously. Numerous shocked gazes stared at the black robed person who was standing still. As they recalled the terror of the thick white flame, the skin of everyone’s head was numb.</p><br/><p>“This is a ‘Heavenly Flame’?” Ge Ye cried out involuntarily as he eyed the black robed person with a face filled with shock.</p><br/><p>The pretty face of Nalan Yanran was somewhat grave. She nodded her exquisite chin slowly as her pretty eyes stared intently at the black robed person and said, “This person is really strong! The Mo clan has really provoked someone they should not have provoked this time around.”</p><br/><p>On the other side, the head of the Ye clan, Ye Cong, also jumped in shock at that terrifying thick white flame. Quickly following that, however, a gloating glint flashed across in the deep region of his eyes. Clearly, he felt extremely refreshed at the Mo clan having offended such a strong person.</p><br/><p>“Who are you? It does not appear that our Mo clan has offended you, so why are you finding trouble with our Mo clan? You ought to know that behind our Mo clan…” The thick white flame also caused Mo Cheng’s heart to sink abruptly. An uneasiness gradually shrouded his heart as he opened his mouth to call out loudly.</p><br/><p>“Hee hee, behind your Mo clan is that Misty Cloud Sect, right? However, even if Yun Yun was here today, she would not be able to protect you, Mo Cheng!” The black robed person’s cold laughter interrupted Mo Cheng’s words. Although his current words were even more presumptuous than before, no one dared to think that he was raving with the thick white flame as a deterrent.</p><br/><p>“Hand over Qing Lin. Otherwise today, I will wash your Mo clan in blood!” The black robed person slowly took a step forward. His bland words suddenly had a stern killing intent.</p><br/><p>“I don’t know what you are talking about! Aren’t you being too arrogant. You can humiliate my Mo clan but it is intolerable for you to tarnish the Misty Cloud Sect and Sect Leader Yun Yun with your words!” Sensing the killing intent in the black robed person words, Mo Cheng trembled in his heart. However, he still stiffened his neck and righteously called out.</p><br/><p>“You really know how to curry favor. However, I have already said that even if Yun Yun was to come today, it would be useless!” The black robed person faintly laughed. His footsteps once again slowly stepped forward. Suddenly, his body trembled and an energy explosion was emitted from under his feet. The black robed person was instantly transformed into a black colored shadow and appeared behind Mo Cheng as though he had teleported.</p><br/><p>“If you don’t hand her over, then die.”</p><br/><p>Beside Mo Cheng’s ear rang a soft icy voice causing Mo Cheng’s eyes to suddenly shrink to the size of a pin hole. This monster like speed had already resulted in a chill to surface in Mo Cheng’s heart.</p><br/><p>Although his heart was chilled, Mo Cheng was considered a renowned strong person. The Dou Qi in his body immediately flowed wildly. The deep red colored Dou Qi was like a bunch of red colored flame, covering his body completely within it. At the same time, his palm was curled into a claw and his somewhat sharp fingernails were like an eagle claw as they violently grabbed at the black robed person’s heart.</p><br/><p>Eyeing the violently grabbing shriveled hand, the black robed person laughed coldly. He tightened his fist and smashed on the palm while carrying an incomparably ferocious force. Immediately, following a clear ‘ka cha’ sound, Mo Cheng’s face abruptly became white and a mouthful of fresh blood was violently vomited, drenching his clothes. His body was also sent flying by that ferocious force and smashed heavily onto the ground. After which, he was dragged a long scar that was nearly ten meters in length in the floor before he finally came to a slow stop.</p><br/><p>In only just one exchange, the strong person whose name shook the entire eastern region of the Jia Ma Empire was actually carelessly smacked aside by the black robed person as though he was smacking a housefly. This dramatic scene caused everyone in the hall to be stunned.</p><br/><p>Although everyone had already felt that the black robed person’s strength was incredible after his attack earlier, but no one expected that this extraordinary individual was actually this powerful. A strong person of at least a five star Dou Ling did not have even the slightest strength to retaliate. What kind of frightening strength was this? Dou Wang? Dou Huang?</p><br/><p>With pale faces, the attendants witness Mo Cheng who had in just a few minutes transformed from the lofty First Elder of the Mo clan into an old man in dire straits. From under the black robed, an indifferent voice was emitted, “Hand over that person!”</p><br/><p>“You are now provoking the Mo clan and the Misty Cloud Sect!” Staggering as he climbed to his feet, Mo Cheng kept his toughness as he said. At this moment, he was clearly using the Misty Cloud Sect to cause fear in this mysterious person.</p><br/><p>“I have given you a chance!”</p><br/><p>Sighing somewhat disappointedly, the black robed person lifted his leg gently forward. Once again, he weirdly flashed to the front of Mo Cheng. He suddenly extended his palm and tightly held the neck of the latter. Tilting his head slightly, he said in a dark and cold voice, “Since you don’t know how to treasure it, then you can die!”</p><br/>\n</div>"}