{"title": "Chapter 250: Rest", "id": 250, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-250-rest", "volume_title": "Volume 3", "body": "<h1>Chapter 250: Rest</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 250: Rest</u></strong></p><br/><p>Eyeing the lady who was leaping over with a face filled with joy, the moon robed lady laughed softly. Her smile was reserved, holding a hidden nobility. It did not cause people to feel that it was cold but rather, it possessed an aloofness that gave people a superficial feeling. Regardless of everything, the three years had caused the immature young lady to become much more mature.</p><br/><p>Everyone in the hall swept their eyes over the smile that had surfaced on the moon robed lady’s beautiful face. All of them could not help but be dazzled.</p><br/><p>After the moon robed woman entered, an old man in the same clothes also walked in, smiling. He stood behind the young lady. As his old eyes opened and closed, there would occasionally be a brilliant light flashing past. The shrivelled hand that was stretched outside his sleeves wiggled without any rhythm, much like sharp eagle claws.</p><br/><p>Once Ling Lin had greeted the moon robed lady, she smiled and said sweetly to the old man behind, “Old Mister Ge Ye.”</p><br/><p>“Ke ke, after not seeing you for a few years, Ling Lin is really becoming more and more beautiful.” The old man who was addressed as Ge Ye laughed and nodded.</p><br/><p>A crimson color surfaced on her pretty face as the red dressed lady, called Ling Lin, affectionately pulled the moon robed lady’s warm jade like white delicate hand. She was pleasantly surprised as she said, “Sister Nalan, I didn’t expect that you would personally come down from the Misty Cloud Mountain. If father and the others knew about it, they would definitely be very happy.”</p><br/><p>“I am only carrying out teacher’s instruction. Moreover, it just so happens that I need to return home during this period. Therefore, I stopped by along the way.” The moon robed lady said in a gentle voice. Her bright eyes rotated and swept through the hall before jokingly said, “Seeing Sister Ling Lin’s aggrieved manner a moment ago, did someone bully you?”</p><br/><p>Being reminded of this question by the moon robed lady, an awkward smile surfaced on Ling Lin’s pretty face. Although she was spoiled, she was not a fool. From the actions of the elder who had saved her just now, she knew in her heart that this young man who appeared slightly younger than her was definitely not someone she should easily provoke. Therefore, she did not say everything in detail in order to avoid creating any unnecessary trouble.</p><br/><p>“It’s nothing. I have merely met an interesting person.” Ling Lin waved her hand. The corner of her eyes could not help but glance at the rock carving that had turned into liquid by the side. Her pretty face involuntarily became a little paler. That young man whose appearance seemed delicate and handsome did not show the slightest tenderness toward women when he attacked.</p><br/><p>After three years of training, the moon robed lady was clearly no longer the immature girl who had dared to run to other people’s home to cancel the marriage agreement just because she was unwilling. Therefore, the change on Ling Lin’s face did not escape her notice. Her gaze followed the side and drew over, finally stopping at the rock liquid that was still emitting some heat. She was briefly at a loss. Immediately, a seriousness surfaced on her ever-changing pretty face.</p><br/><p>Tilting her head over, she exchanged glances with Ge Ye by the side. The both of them saw shock in each others eyes.</p><br/><p>“This is a strong person who is well versed in fire type Dou Qi.” As they exchanged glances, this thought swiftly flashed across both their hearts. After which, the shock on their faces was quickly withdrawn.</p><br/><p>The paleness on Ling Lin’s face only lasted for a moment before it disappeared. She turned around and eyed the group of young people who had originally clustered around her, wanting to get into her good books. At the moment, however, they were eyeing the moon robed lady behind her with faces filled with yearning. The face of one of them, who had a weaker mental strength, was flushed red and his eyes were filled with passion.</p><br/><p>Eyeing these people’s humiliating expression, Ling Lin frowned slightly. She quietly muttered in her heart, “A group of people who overestimates their own abilities. The little strength that your clans have is merely some crushed stones under one’s feet when compared to her.”</p><br/><p>Shaking her head, Ling Lin no longer bothered about these young dandies. She smiled and said to the moon robed lady, “Sister Nalan, night is approaching soon. Why don’t you rest here for the night. This place has a specialized room to entertain someone of Sister Nalan’s status.”</p><br/><p>“Okay. I will trouble Sister Ling Lin.” The moon robed lady smiled and nodded. Her gaze once against swept over the pile of liquid rock. With a deeper meaning behind her words, she smiled slightly and said, “Before I descended from the mountain, teacher had told me that this Dou Qi continent is incomparably large with uncountable number of unique people and mysterious events. I did not expect that I have broadened my horizon after only having left a short time ago.”</p><br/><p>Hearing this, Ling Lin smiled awkwardly, but did not say anything. Instead, she focused on showing the way in front, leading the moon robed lady and the old man up the stairs.</p><br/><p>Eyeing the few people that had disappeared at the edge of the staircase, numerous whispers appeared in the hall, sounding like houseflies.</p><br/><p>“Tsk tsk, how unexpected. Even the personal disciple of the Leader of the Misty Cloud Sect personally came here to celebrate Mo Cheng’s birthday. This Mo clan’s prestige has definitely grown.”</p><br/><p>“That’s right. She had such peerless elegance despite being so young. Moreover even with our strength, we are actually unable to see through her foundation. She really deserves to be called the personal disciple of the Leader of the Misty Cloud Sect.”</p><br/><p>“Hee hee, what a beautiful girl. Whoever marries her will have picked up a big bargain. The future Leader of the Misty Cloud Sect, the princess of the Nalan clan. Who in this Jia Ma Empire can compare after adding these two strengths together?”</p><br/><p>“Uh, by chance, I seemed to have heard some rumors the last time that the Third Young Master of the Xiao clan in Wu Tan City seemed to be her fiance.”</p><br/><p>“Che, when did you obtain this news? Three years ago, Lady Nalan aggressively charged into the Xiao clan and forcefully got the head of the Xiao clan to terminate the engagement.”</p><br/><p>“Ah? Wouldn’t the Xiao clan lose all of its face?”</p><br/><p>“So what if they lose all their face? Can that Xiao clan contend with the Nalan clan or the Misty Cloud Sect? Even after taking such a great humiliation, they could only swallow it into their stomach. Moreover, the Third Young Master of the Xiao clan back then was a renowned cripple. How could he be comparable with Lady Nalan with her outstanding talent?”</p><br/><p>“Qie. You don’t know anything yet you dare to spread your lack of information around.” A man seated in the corner curled up his lips in disdain at the two people who were speaking loudly. When he saw their angry eyes glaring at him, he lazily said, “Lady Nalan did indeed go to the Xiao clan to end the engagement. However, she did not get the contract to end the engagement. Instead, she received… a divorce letter. That’s right… that Young Master of the Xiao clan directly divorced this person whose identity could directly be compared to the empire’s princess…”</p><br/><p>“Divorce?” When this word was said, everyone in the hall became dull. They opened their mouths while feeling stunned. Who could believe that a young master, who was a useless being back then, would actually dare to take the initiative to divorce this fiancee whose position was extremely noble?</p><br/><p>“Dammit. This guy’s too awesome…” Although most of the people in the hall did not really believe that these words were true, there were a few people who muttered with a shocked face.</p><br/><p>In order to be able to divorce a fiancee who not only had such a noble status but also such an outstanding appearance, one really needed some courage. At the very least, many people here realized that they did not have this boldness after reviewing themselves.</p><br/><p>…</p><br/><p>Standing at the entrance, Xiao Yan’s gaze saw off the middle-aged man from the Mo clan before slowly closed the room’s door. He turned around and a tiredness was finally revealed on the indifferent face he had maintained. He rubbed the slightly blackened rim of his eyes and helplessly spread his hand out at Hai Bo Dong.</p><br/><p>“I dare to say that after the guy returns home, the first thing he will do is to investigate our background.” Hai Bo Dong lifted the tea cup on the table, took a sip and told Xiao Yan.</p><br/><p>“Yes.” Xiao Yan nodded his head slightly. He said, “But let him do what he wants. His Mo clan doesn’t have that great of an ability to discover our background. Now, we should adjust our condition properly. Rushing through the desert these last few days has really caused me to almost reach my limit… Hmm, after we adjust our condition, we will enter the Mo clan’s home tomorrow to search for Qing Lin.” Xiao Yan stretched his lazy waist and walked into his room while he spoke.</p><br/><p>Eyeing Xiao Yan's back, Hai Bo Dong nodded his head and also walked toward another room. These few days of hurried travel had also caused his spirit to feel somewhat tired.</p><br/><p>After walking into the room, Xiao Yan opened his somewhat heavy eyelids. He forcefully resisted the impulse to just fall asleep. As he stroked his storage ring gently with his finger, a green glow slowly rose and finally turned into the Green Lotus Seat that floated in midair.</p><br/><p>The tip of his feet pressed on the ground gently before Xiao Yan steadily sat on the Green Lotus Seat. Threads of warm energy were emitted from the points where his skin made contact, slowly expelling the tiredness hidden within Xiao Yan’s body.</p><br/><p>Xiao Yan inhaled a long, fresh and cool breath. He extended his hand and a thread of green colored flame began to moved in an unpracticed manner on the tip of his finger. A long while later, he shook his head slightly and helplessly said in a soft voice, “With the terrifying strength in it, it is not as easy to control as I had thought.”</p><br/><p>After training his control over the green flame in his palm for awhile, Xiao Yan slowly closed his eyes and entered the training mode.</p><br/><p>As Xiao Yan entered the training mode, the surrounding energy began to fluctuate. Following which, threads of energy visible to the naked eye agglomerated into strips of mottled energy. This kind of absorbing speed far surpassed what it was in the past. Clearly, after the evolution of the Qi Method, the benefits that it wrought were already beginning to gradually be displayed.</p><br/><p>The slightly mottled energy swiftly passed through the Green Lotus light cover blockade. After going through an initial purification, it poured into Xiao Yan’s body.</p><br/><p>The interior of Xiao Yan’s body was shrouded by bits of green colored glowing energy that swiftly flowed along his Qi Paths. The Qi Path walls were squirming like cells. As the Qi Paths squirmed, the mottled energy was also swiftly becoming purer. A large amount of impure energy was absorbed by the Qi Path walls, swallowed and quietly expelled from within his body with the help of the pores on his skin.</p><br/><p>When the energy flowed through the cumbersome Qi Paths and completed a complete cycle, the mottled energy had already achieved a high purity. At this moment, it passed through the calcining of the ‘Green Lotus Core Flame’. Immediately, waves of large energy shrank at a rate that was visible to the naked eye. A long while later, the energy completely disappeared. Replacing it was a droplet of green colored energy liquid that held an unusual flickering glow. This droplet was slowly dropped into the vortex.</p><br/><p>When Xiao Yan entered the training state that caused him to forget himself, Ling Lin was leading that elegant and beautiful moon robed lady and walking the corridor outside the room. Coincidentally, she stopped just opposite this room of Xiao Yan and Hai Bo Dong, opened the door and slowly walked in.</p><br/>\n</div>"}