{"title": "Chapter 268: Contest", "id": 268, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-268-contest", "volume_title": "Volume 3", "body": "<h1>Chapter 268: Contest</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 268: Contest</u></strong></p><br/><p>At the moment, Xiao Yan and Queen Medusa below him, who was rumored to have an extremely fierce reputation, had an extremely enchanting posture. Not only was her body completely pressed down by Xiao Yan but her red sleek small mouth also had a finger of Xiao Yan’s in it.</p><br/><p>Xiao Yan’s eyes watched the face in his immediate vicinity dully. This appearance that was called bewitching was like the masterpiece of the heavens. Even though this pair of bright eyes contained an evilness, it was still difficult for them to hide her enchanting charm.</p><br/><p>This woman was a stunning creature straight from almost every man’s dream.</p><br/><p>Although the soft and lovely body under him gave Xiao Yan an incomparable pleasure, his face did not dare to express even the slightest bit of it at this moment. His gaze contained some horror as he stared blankly at Queen Medusa. A moment later, the corner of his mouth twitched once and revealed an extremely ugly smile, “Hel… Hello.”</p><br/><p>As he said the words, the finger of Xiao Yan’s which was extended into Queen Medusa’s mouth involuntarily stretched out a little. Immediately, he touched the delicate and moist little tongue. At that moment, Xiao Yan’s body abruptly trembled. A numb feeling spread out from his heart, almost giving him the impulse to violently suck that small tasty tongue.</p><br/><p>Of course, Xiao Yan may have had such an impulse in his heart but he was certain that if he did that, he would be blasted and killed until he turned into dregs by Queen Medusa who even Hai Bo Dong would turn around and flee on sight.</p><br/><p>The bright eyes which were still filled with anger stared at Xiao Yan coldly. When Xiao Yan’s finger had touched her tongue a moment ago, a shallow crimson color flew onto Queen Medusa pretty face. However, a thick killing aura was also emitted by her.</p><br/><p>Queen Medusa’s pretty eyes moved slightly and glanced at Xiao Yan’s hand which was glowing with a rich green light. She then glanced at the green colored jade like finger that reached into her mouth. Immediately, her long eyes narrowed slightly. An instant later, she violently bit down with her silver teeth.</p><br/><p>“Hiss…”</p><br/><p>With his hand being violently bitten, Xiao Yan’s eyes widened. He painfully inhaled a deep breath of cool air and was thinking of struggling to shake her off when a long hand that was like white jade quickly and unexpectedly shot out, firmly grabbing Xiao Yan’s neck. The threatening glare from that pair of beautiful eyes was extremely fierce.</p><br/><p>Being grabbed by Queen Medusa, Xiao Yan became helpless. he could only submit and lower his body. Immediately, two round softness pressed onto him at his chest. A nefarious flame instantly rose from his lower abdomen causing Xiao Yan’s breathing to be somewhat hurried.</p><br/><p>Xiao Yan forcefully endured the nefarious flame in his body. At this moment, he dared not touch this fiend with his hands or legs. His body was straight as he pressed on Queen Medusa’s soft lovely body. Their faces faced each other and their breathing could be clearly heard.</p><br/><p>As Queen Medusa bit Xiao Yan’s finger, bright red blood slowly colored the red sleek lips. Blood added to the redness and the vivid color caused the bewitching Queen Medusa to have a little more of a bloody rose like allure.</p><br/><p>As the blood slowly seeped out, Xiao Yan’s expression changed slightly. He could sense that the enormous energy of the ‘Fire Lotus Seed’ that was moving back and forth in his right arm was swiftly being swallowed by Queen Medusa.</p><br/><p>“There’s no need to worry… giving to the ‘Heaven Swallowing Python’ is the same as giving to her. As long as the excess energy of the ‘Fire Lotus Seed’ can leave my body, it is just the same.” Xiao Yan comforted himself and did his best to calm himself down. His gaze remained on her perfect and nearly flawless yet bewitching face. Although both parties were on opposing sides, his heart could not resist quietly praising.</p><br/><p>Following Queen Medusa’s nearly greedy swallowing, the green colored glow on Xiao Yan’s right hand slowly dimmed at a clearly noticeable rate. The green glow finally completely disappeared after another few seconds. That finger which was like a green colored jade had also gradually recovered to normal.</p><br/><p>Just as Xiao Yan had sighed in relief within his heart when the excess energy was successfully sucked out of his body, his expression immediately changed drastically. This was because after she had completely absorbed the energy, Queen Medusa actually had no intention of opening her mouth. Her long pretty eyes carried a cold laughter as she glanced at him. She gently sucked and the Dou Qi within Xiao Yan’s vortex was immediately hoisted into a wave. It actually steadily moved along his Qi Paths and had the posture of being sucked away.</p><br/><p>“Open your mouth!” Sensing the change in his vortex, Xiao Yan’s expression changed wildly and he hurriedly said.</p><br/><p>Queen Medusa did not have the spare time to bother about Xiao Yan. Her eyes carried a cold laughter as the delicate hand she used to grab Xiao Yan’s neck tightened slightly. Immediately, Xiao Yan’s face became a little flush.</p><br/><p>“Dammit!”</p><br/><p>Sensing the Dou Qi within his body that was about to move along his finger and surge out, Xiao Yan’s eyes immediately became red. During these twenty plus days, he had spent an unknowingly large amount of effort in order to recover his strength. If it was absorbed by this damn woman, when the time came to go to the Misty Cloud Sect, would he end up having to pick up tiles to throw?</p><br/><p>TL: Without weapons to fight with</p><br/><p>With crimson eyes, Xiao Yan’s left hand was slowly raised. The green colored flame suddenly soared. Immediately, the temperature of the interior of the room rose.</p><br/><p>Eyeing the green colored flame on Xiao Yan’s left hand, Queen Medusa’s expression involuntarily changed slightly. Clearly, she had also recognised the cluster of flame as the ‘Green Lotus Core Flame’ that had caused her great suffering.</p><br/><p>“Open your mouth! I know that with your strength, it would be very easy to kill me. However, you did not do this just now. This does not match your fierce reputation… I think that you have not recovered your strength, right?” Xiao Yan’s face was dark as he slightly weakened the green colored flame covering his palm. He said softly, “You should be able to recognize this. Open your mouth immediately or I will ensure you are seriously injured even if I have to stake my life!”</p><br/><p>Hearing Xiao Yan’s threat, the coldness in Queen Medusa’s bright eyes became even richer. With her status, there was no one who had ever threatened her in this manner. Immediately, a pair of pretty eyes stared intently at Xiao Yan. There was a stern killing intent in them.</p><br/><p>Being stared at by Queen Medusa in such a manner, the skin of Xiao Yan’s head become somewhat numb. However, he also clearly knew that at such a time, even if he knew that his future fate may not be very good, he could only stiffen his neck and pretend to be a determined person. After all, if he was feeble, this beautiful snake renowned for her fierce reputation would swallow his person along with his bones.</p><br/><p>Within the quiet room, the gazes of the two people stared intently at each other. Neither one was willing to relax first.</p><br/><p>As the time they stared at each other dragged on, a drop of cold sweat slowly dripped down from Xiao Yan’s forehead. Keeping his imposing composure with this beautiful female snake whose fierce name shook the entire Jia Ma Empire was not an easy job.</p><br/><p>The stalemate continued. Just as the hint of cowering could not help but be born in Xiao Yan’s heart, Queen Medusa finally could not endure the increasingly close green colored flame. She ferociously cut Xiao Yan with her eyes before releasing her mouth with extreme unwillingness.</p><br/><p>Seeing that Queen Medusa opened her mouth, Xiao Yan withdrew his finger in a lightning like manner. His body gently stepped off the bed and his body abruptly shot back. While his body was in midair, he placed his hands together and immediately pulled them apart. The green colored flame was actually pulled into a long whip. The whip circled around Xiao Yan’s body and was ready to block all attacks coming at him.</p><br/><p>Once he completed his defense, Xiao Yan raised his head to eye the bed. Immediately, his eyes straightened. On the bed he could see the hot figure of the beautiful female snake seated nakedly on it.</p><br/><p>Sensing Xiao Yan’s gaze, Queen Medusa’s pretty face became slightly cold. Her delicate hand pulled the blanket by the side and swiftly covered her body. Even though her mesmerising curve was covered by the blanket, it still appeared extremely enchanting. On the side of the bed, a pale-purple colored snake tail was gently lowered. It swayed slightly and emitted a wild allure.</p><br/><p>Xiao Yan eyed Queen Medusa who was coldly staring at him. The corner of his mouth twitched as he wiped his hand clean. With the Dou Qi in his body hurriedly flowing, Xiao Yan stared cautiously at Queen Medusa, guarding against any sudden attack.</p><br/><p>“You are the first person who has dares threaten me.” After staring at the delicate and handsome face for a while, Queen Medusa finally opened her mouth slowly. Her voice was numb and lazy, possessing a temptation that caused a man’s bone to become numb.</p><br/><p>“You are also the first woman to bite me.” Xiao Yan stiffened his neck and said dryly.</p><br/><p>Queen Medusa extended her delicate and bright red tongue and gently licked her red sleek lips. Her casual action had a captivation that cause men’s hearts to feel impulsive. “The energy from before should be coagulated from the lotus seed from within the lotus seat of the ‘Green Lotus Core Flame’, right? Back then, if I had not been seriously injured when I was obtaining the ‘Green Lotus Core Flame’, I would definitely not have left even a little of such a treasure.”</p><br/><p>Xiao Yan laughed dryly but did not reply. The green colored flame in his palm was still dancing.</p><br/><p>Staring deeply at the green colored flame in Xiao Yan’s hand, Queen Medusa shook her head and softly said, “How unexpected. At the end of it all, the greatest benefit was actually all taken by you. That Gu He must have been quite furious.”</p><br/><p>“Hee hee, didn’t Your Majesty also use it to successfully evolve? The benefits that you have obtained are also quite significant.” Xiao Yan laughed.</p><br/><p>“In order to evolve, the misery that I had to bear is something that you witnessed.” Queen Medusa said faintly, “If it were not such a crucial moment back then, I would have personally killed you.”</p><br/><p>“Hee hee.” Hearing this Xiao Yan laughed awkwardly. Back then, she had actually long discovered him hiding by the side.</p><br/><p>“However… human, it must be said that you are really very bold…” Queen Medusa’s delicate finger gently pointed at Xiao Yan. A feminine aura surfaced on Queen Medusa’s face, Her numbing voice faintly carried a stern killing intent. “Not only did you dare to break into the deep regions of the desert by yourself but you even dared to treat the body of my evolution form as a pet and raise it. This courage is something that I haven’t seen in so many years.”</p><br/><p>Sensing the killing intent in Queen Medusa’s words, Xiao Yan shrugged his shoulders and helplessly said, “I have never treated you as a pet to be raised. It is just that you like to follow me, that’s all there is.”</p><br/><p>“Then do I need to to call you… Master?”</p><br/><p>The long eyes of Queen Medusa were bent into a dangerous angle. The last part of her voice was dragged into a somewhat elongated manner. Her numbing tone caused the face of Xiao Yan, who had quite a strong mental strength, to redden. He bowed his body slightly and his pants between his legs appeared to have jacked up by quite a bit.</p><br/><p>The words said with this type of voice were really too terrifying…</p><br/><p>“What you have said before is correct. The current me really doesn’t have the strength to kill you. However… during the next time that I awaken, trust me, I will… take, your, life!” Her delicate hands shakingly pointed at Xiao Yan as Queen Medusa slightly lifted her proud forehead. Her voice that spoke those words and that pause, contained a stern killing intent.</p><br/><p>“Little human fellow, just wait. In this world, a person who has the right to be my master has not been born. At the very least, the current you is still far from having that privilege.” Queen Medusa’s lovely body slowly creeped down. Immediately, the blanket that was wrapped around her body was compressed to reveal an attractive arc. An intense glow shot out. Queen Medusa’s body slowly shrunk, finally transforming into a small seven colored snake…</p><br/><p>Eyeing the small snake that had been transformed into the ‘Heaven Swallowing Serpent’, Xiao Yan’s entire body suddenly became weak. He sat down on the floor. Only at this moment did he realize that he was actually already drenched in perspiration.</p><br/>\n</div>"}