{"title": "Chapter 263: Terrifying Destructive Force", "id": 263, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-263-terrifying-destructive-force", "volume_title": "Volume 3", "body": "<h1>Chapter 263: Terrifying Destructive Force</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 263: Terrifying Destructive Force</u></strong></p><br/><p>The brilliant green-white flame exploded in the blue sky. Like a wave of flames, it engulfed the sky. Instantly, the temperature of this entire area, rose significantly.</p><br/><p>Within Yan City, a countless number of people lifted their heads foolishly and eyed the terrifying wave of flames that had engulfed the sky. Even though it was thousands of meters away, the hot flame wave still caused people to perspire profusely.</p><br/><p>The huge city was completely silent. Everyone swallowed their saliva in their dry mouths. A panic spread from deep within their hearts. If this flame wave was a little lower above Yan City, this place might have been annihilated into a flat plain.</p><br/><p>“Is this the destructive strength of a Dou Huang? How terrifying!” Everyone shivered and groaned weakly in their hearts.</p><br/><p>In the blue sky, the flame wave turned into an energy ripple as it violently surged outward. With the explosion at the center, the surrounding living creatures within a certain boundary all received a destructive blow.</p><br/><p>The green-white flame waves leisurely spread out to a radius of a couple of hundred meters before they gradually began to disappear. In the sky, two humans and a beast had gone into a dire state.</p><br/><p>The blow received by the ‘Eight-Winged Black Serpent Emperor’s, which had a huge body, was undoubtedly the most severe among the three due to its size and its position being closest to the point of the explosion. Because of the destructive flame wave that swept out, over half of the tough scales on the ‘Eight-Winged Black Serpent Emperor’s’ body had been completely broken. Its black body had bright red blood that repeatedly seeped and dripped down as though it was raining.</p><br/><p>Under the broken scales, a couple of horrifying wounds that were visible to the naked eye extended outward and almost covered his entire back. At one glance, one appeared to be able to faintly see the dense white bones.</p><br/><p>Of its eight wings, three of them were destroyed from the rough explosion and another wing had only half of it left with fresh blood flowing wildly. The ridicule in the enormous triangular shaped eyes could no longer be seen. Replacing it was an utter horror. His miserable and dire looking manner no longer possessed the slightest bit of pride and arrogance.</p><br/><p>In a place far away from the ‘Eight-Winged Black Serpent Emperor’, a completely snow white ice cover slowly cracked open. The ice fragments fell, finally exposing an old figure in an almost completely incinerated black robe.</p><br/><p>Currently, Hai Bo Dong’s face was totally pale. The corner of his mouth still faintly possessed a few blood stains. He randomly wiped off the blood stains with his hand, which was trembling without him noticing. In the terrifying explosion a moment ago, Hai Bo Dong had used all of the strength he possessed in order to coagulate over forty layers of tough Dou Qi ice layer in an extremely short period of time. However, this defense which appeared tough and indestructible, appeared to be easily smashed apart under the green-white flame wave that possessed an extremely destructive strength. After the flame wave shuttled past, only the last layer of the over forty Dou Qi ice layers, that had incredible defensive strength, remained.</p><br/><p>“This lunatic, lunatic. He actually dared to act so recklessly!” Thinking about the terrible fate he would be in if his defense was completely broken, Hai Bo Dong’s face turned green. His lips shivered as his hoarse voice scolded.</p><br/><p>Although he was cursing from his mouth, even Hai Bo Dong himself did not realize that some fear for this young man who was not even twenty was produced deep within his heart.</p><br/><p>After a round of scolding, Hai Bo Dong’s gaze swept through midair and finally stopped on Xiao Yan’s body which was suspended in midair with no one knowing if he was dead or alive.</p><br/><p>Currently, over half of the black robe on Xiao Yan’s body was destroyed. The ‘Sea’s Core Vest’ that Yun Zhi had given to him had actually burst apart at this moment. A huge piece of pale-blue colored tough vest slowly descended, revealing Xiao Yan’s body, which was grilled till it was somewhat fiery-red, underneath.</p><br/><p>Flapping the pair of wings on his back gently, Hai Bo Dong quickly appeared beside Xiao Yan. He eyed Xiao Yan’s unconscious miserable manner and immediately glanced at the pale-blue colored inner vest. Surprise flashed across his eyes. The defensive strength of this thing caused him to be somewhat surprise.</p><br/><p>Clearly, if Xiao Yan did not have the protection of this inner vest, he may have been killed on the spot by the terrifying explosion a moment ago.</p><br/><p>“This lunatic. You actually dared to merge two ‘Heavenly Flames’ together. Now, things are just ‘good’. The thing that you have created is something that won’t even recognize you as the owner. Ugh, if you were to die from your own hands, it would be a great fascinating story.” Eyeing Xiao Yan who was in a condition where his fate was unknown, Hai Bo Dong laughed bitterly and shook his head. His palm grabbed Xiao Yan’s hand and roughly probed. He shook his head slightly and sighed. There was a price to pay for creating such a terrifying destruction. The current body of Xiao Yan was on the verge of being completely broken. This was the first time that Hai Bo Dong had saw this person who had such strong mantis like life turn into such a frail state.</p><br/><p>“For my ‘Spiritual Recovery Purple Pill’, you cannot just carelessly die like this.” With a hand supporting Xiao Yan, Hai Bo Dong muttered.</p><br/><p>“Dammit, you deserve to die. You crazy fellow. I hate fighting with lunatics like you the most. A group of bastards, jerks.” In the far distant, the ‘Eight-Winged Black Serpent Emperor’ had finally recovered his consciousness. He scolded while he sensed the serious injury condition that his body was in. His large body trembled. The ‘Eight-Winged Black Serpent Emperor’ clearly knew in his heart that had it not been for Xiao Yan’s first time using that strange green-white flame lotus resulting in his accuracy and control being imprecise, the current him would undoubtedly directly enter deep into the level of serious injury. Should that time come, he would at best see a great drop in his strength, at worst, die on the spot!</p><br/><p>Eyeing the ‘Eight-Winged Black Serpent Emperor’ who still possessed some energy despite being seriously injured, Hai Bo Dong’s expression sank. He placed Xiao Yan protectively behind him. The remaining ice affinity Dou Qi in his body slowly flowed, preparing to deal with this infuriated ‘Eight-Winged Black Serpent Emperor’ at any moment.</p><br/><p>However, just as Hai Bo Dong was preparing to fight, the ‘Eight-Winged Black Serpent Emperor’ simply cursed extremely angrily before shrinking his body, not daring to move closer to Xiao Yan and Hai Bo Dong. After facing off in this manner for a few minutes, the remaining wings of the ‘Eight-Winged Black Serpent Emperor’ suddenly flapped. Immediately, he turned around and fled in front of Hai Bo Dong’s stunned gaze.</p><br/><p>“Dammit, this lunatic. Consider me to be afraid of you. In the future, any place that this lunatic is in, I will not go and join the fun. Lunatic, really a lunatic. This time I have really made a big loss. If that woman, Lu Man, doesn’t increase the reward, I will flip her territory around.” The ‘Eight-Winged Black Serpent Emperor’s ‘ huge body faced the horizon and swiftly flew over. A cussing voice that was filled with fear continued reverberating in the sky.</p><br/><p>Hai Bo Dong was stunned as he eyed the ‘Eight-Winged Black Serpent Emperor’ who had actually chose to flee. He was momentarily lost before he immediately shook his head, unsure if he should laugh or cry. If he was to fight with this unique beast, which had the strength of a six star Dou Huang, in his current condition, he would likely be unable to gain an advantage. Moreover, he still needed to protect the unconscious Xiao Yan. Therefore, when he saw that the ‘Eight-Winged Black Serpent Emperor’ chose to retreat, Hai Bo Dong heaved a sigh of relief.</p><br/><p>“Ah, after today’s events are spread around, this little fellow will likely have some reputation even on the Dou Qi continent. With one strike, you frightened off the ‘Eight-Winged Black Serpent Emperor’ whose fierceness is renowned. This involves a boldness that even that old demon from the imperial family does not have.” Hai Bo Dong turned his head around, eyed the pale faced Xiao Yan in an unconscious state and sighed with envy.</p><br/><p>“Ah, what a terrifying ‘Heavenly Flame’ and crazy little fellow.”</p><br/><p>After exclaiming once again for that destructive energy from before, Hai Bo Dong suddenly pressed his eyebrows tightly together. He lifted his head and his gaze swept both to the east and west. From both places, two powerful Qis were swiftly flying over.</p><br/><p>“Are those two fellows finally coming over?” Hearing Xiao Yan’s attitude from before, it appeared that he and the Misty Cloud Sect had some grudge. In which case, it would be better to take him along and leave this place.” Hai Bo Dong mused slightly. His gaze swept around and then below him. Carrying Xiao Yan, Hai Bo Dong flapped the cold ice wings on his back, turning his body into a flowing light and swiftly shot toward the horizon.</p><br/><p>Following the disappearance of Hai Bo Dong, this sky which had undergone a soul-stirring big battle finally calmed down.</p><br/><p>However, the tranquility continued for only ten plus minutes when two flowing lights swiftly shot over from both the east and west directions. Finally, they stopped at the location where the big battle had occurred.</p><br/><p>The flowing lights disappeared. An old person’s human figure and a lady’s human figure both appeared. The old person was wearing an ordinary yellow robe, his good complexation and energetic manner had a somewhat distinctive and aloof feeling. As his eyes scanned around, they were filled with dignity. The woman was wearing a tight golden colored robe that was complemented with a purple color. Her long black hair was drawn into a phoenix like shape. A nobility that was difficult to hide faintly seeped out from her. Her appearance was tranquil and beautiful, much like a clear spring in a secluded mountain. At the same time, she caused people to feel respect for her because of her inborn high status while a fluttering thought would involuntarily appear in those same people’s heart.</p><br/><p>“Ke ke, Sect Leader Yun Yun, in the few years we have not met, your wind affinity Dou Qi is becoming increasingly polished. This speed is something that the old me cannot catch up with.” Eyeing that graceful, noble and all around gorgeous robed lady, the old man laughed.</p><br/><p>“Jia Lao's breaking mountain Dou Qi is also becoming more and more potent. From a far distance, Yun Yun had already sensed that overbearing Qi.” The gorgeous robed lady laughed.</p><br/><p>“Ah, I’m slightly old and cannot compare with you young people.” The old man who was addressed as Jia Lao waved his hand with a smile. His gaze looked around at his surroundings. When his gaze swept over the huge mountain peak that was crushed, his eyes shrunk and he gently smiled, “Looks like both of us have missed a great event.”</p><br/><p>“Just before, didn’t four different Dou Huangs’ Qis appear here?” The gorgeous robed lady frowned and asked.</p><br/><p>“Ah, there were two Qis who did not appear to be that of a strong person from the Jia Ma Empire. As for the other two who fought with them, I cannot be certain if they are citizens of the Jia Ma Empire or not. After all, with a territory that is so big, some old fellows prefers to hide themselves and would not appear until they die.” The old man laughed. His face gradually became slightly overcast as he said, “But the energy explosion from before is somewhat appalling. I think that even if it was me who faced this kind of energy explosion, I could only end up with a seriously wounded fate.”</p><br/><p>“I wonder when this kind of strong person will once again appear in the Jia Ma Empire. If I have the chance, I would like to become acquainted with him or her.” The old man said somewhat regretfully.</p><br/><p>The gorgeous robed lady smiled and nodded. Her pretty eyes randomly swept across the ground. A moment later, she suddenly exclaimed softly. She beckoned at the ground with her hand. Immediately, a pale-blue colored metal piece swiftly shot toward the sky and she caught it firmly in her hands.</p><br/><p>“This is…” Flipping and looking at this somewhat familiar looking pale-blue metal piece. A moment later, the pretty face of the gorgeous robed lady changed abruptly. She involuntarily muttered, “Sea’s Core Vest?”</p><br/>\n</div>"}