{"title": "Chapter 273: Arriving At The Capital", "id": 273, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-273-arriving-at-the-capital", "volume_title": "Volume 3", "body": "<h1>Chapter 273: Arriving At The Capital</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 273: Arriving At The Capital</u></strong></p><br/><p>The darkness of night arrived and covered the land. A silver moon hung high in the sky. Its faint moonlight shone down weakly, slowly expelling some of the darkness.</p><br/><p>In the quiet courtyard, three brothers were lying on comfortable, soft chairs, raising their heads to watch the stars that filled the sky. Occasionally, they would lift the winecup beside them and pour wine for each other and drink together.</p><br/><p>Drinking all the wine in his winecup in one gulp, Xiao Yan turned around and eyed his two elder brothers who were faintly tipsy. He slowly stood up, took out two scrolls whose covers were extremely old, and gently placed them on a small table beside Xiao Ding and Xiao Li. Seeing their questioning gazes, he said with a smile, “These are two Xuan Class High Level Qi Methods. One is a wood affinity and the other is a lightning affinity. Their affinities exactly match the two of you. Within each Qi Method, there is also a Xuan Class High Level Dou Technique that matches the method. With coordination between the two, their strengths cannot be underestimated.”</p><br/><p>Hearing this, Xiao Ding’s and Xiao Li’s somewhat tipsy eyes suddenly brightened. Just a Xuan Class High Level Qi Method alone was viewed as a treasure in the Jia Ma Empire where one would not find it in the market even if one had the money. Moreover, this Qi Method still had a Dou Technique that formed a complete set with it. If one were to count, the value of this Qi Method was undoubtedly even more valuable than the other Qi Methods of a similar class.</p><br/><p>Under the temptation of such a rare item, even Xiao Ding, with his cool-headedness, had some desire surface on his face. Xiao Li beside him, grabbed that silver colored scroll the instant that Xiao Yan spoke. After which, he played with it in his hand, loving it too much to willingly put it down.</p><br/><p>“If these two things were to be auctioned, it would be diminishing their status if they did not demand a high price of at least three million gold coins.” Xiao Ding received the green colored scroll and gently rubbed it. Its extremely comfortable and flexible feeling allowed Xiao Ding, who had frequently come into contact with Magic Beasts, to know that the scroll was made with the pelt of a rank four Magic Beast. At that moment, he could not help but speak with amazement.</p><br/><p>Xiao Yan smiled and nodded. He had taken out two Xuan Class High Level Qi Methods, each forming a set with a corresponding Dou Techniques. There was likely no more than ten strengths or people within the Jia Ma Empire who were able to spend in such a style. Were it not for the extremely large warehouse of Yao Lao, Xiao Yan would not not have the ability to take them out either.</p><br/><p>“I had planned to give these Qi Methods to you last time. However, I had forgotten about them because I was leaving in a hurry.” Xiao Yan smiled and said. Before he had left for the snake-people race territory, Xiao Yan had taken these two Qi Methods from Yao Lao. However, due to their itinerary being stretched until it was very tight, it was only now that Xiao Yan had the time to recall this matter..</p><br/><p>“Although these Qi Methods are extremely rare, we will not do any of those hypocritical refusals since it is you who has taken them out. Otherwise, it might offend you and make you unhappy.” Xiao Ding, who was clear of Xiao Yan’s character, mused for a while. In the end, he did not reject Xiao Yan’s somewhat generous gifts. Instead, he smiled and nodded before carefully placing the scroll into his chest area without saying any courteous words.</p><br/><p>After Xiao Ding and Xiao Li had stored their Qi Methods properly, Xiao Yan let out a slight smile. He lifted his head to eye the star filled sky and softly said, “Everything has already been arranged appropriately. Tomorrow, I can leave with a peaceful mind.”</p><br/><p>Xiao Ding nodded his head lightly and said with a smile to Xiao Yan beside him, “Little Fellow. Big Brother and Second Brother will wait here for the day that your name shakes the entire Jia Ma Empire in a month’s time. Cheers!”</p><br/><p>Eyeing Xiao Ding who had suddenly become bold, a warmth surged up within Xiao Yan’s heart. He received the winecup and emptied it in one go. He clearly understood the meaning in Xiao Ding’s words. If he could really defeat Nalan Yanran and successfully leave the Misty Cloud Sect, then Xiao Yan’s name would become an overnight sensation throughout the Jia Ma Empire.</p><br/><p>“Of course…, Xiao-Yan-Zi, if you fail to leave the Misty Cloud Sect, your Big Brother and I will not immediately take revenge for you. We will tolerate it secretly, clenching our teeth and forcefully tolerate it… We will wait until the time when we can leave a wound on the Misty Cloud Sect that would cause it to feel a pain deep in its core before we violently bite at it. We will bite until we break its bones!” Xiao Li patted Xiao Yan’s shoulders. However, a ghastliness that would send chills into people’s hearts was faintly seeping out of his smiling face.</p><br/><p>In the desert, the fierce beasts that bear their fangs and brandish their claws were not frightening. The ones that were frightening were those poisonous snakes that quietly conceal themselves under the yellow sand. They would not easily display their fangs. However, once the opportunity arrived, a lethal strike would instantly shoot out of the yellow sand…</p><br/><p>Among the three brothers of the Xiao clan, Xiao Ding was calm, wise and farsighted, Xiao Li was sinister and vicious, while Xiao Yan was mysterious and unpredictable. The three of them had different characters but they were able to cause their opponents to feel uneasy and turn their hearts cold.</p><br/><p>Eyeing the dark and severe Xiao Li, a warmth flowed in Xiao Yan’s heart. He nodded slightly and once again drank a full cup of potent wine that burned his throat. The three of them looked at each other and laughed loudly.</p><br/><p>The morning of the next day, Xiao Yan and Hai Bo Dong did not alert anyone as they left the ‘Desert Metal Mercenary Company’. It was as though every time he would leave silently…</p><br/><p>In the blue sky, two flowing lights suddenly moved closer from a far distance, carrying a violent wind behind them. A moment later, they appeared at the edge of the sky before finally leaving behind numerous envy filled faces of passersby on the ground.</p><br/><p>“Xiao Yan, won’t we save a lot of trouble if we were to fly directly to the capital? Why do you still want to go to Tange City to use the flying beast? Their speed is much slower than our flying speed.” Hai Bo Dong flapped his pair of cold icy wings on his back, glancing at the scenery that was swiftly moving past under him before turning around. His Dou Qi was mixed with a thread of his voice, which was somewhat dissatisfied, as it was transmitted into Xiao Yan’s ear.</p><br/><p>Upon hearing these words from Hai Bo Dong, Xiao Yan, who was using all his might to hurry along their journey, could not help but laugh bitterly in his heart and shook his head. He quietly thought, “From here to the capital is a journey that is a few thousand kilometers. In the past, if I had the support of Yao Lao’s strength, I could endure through it. However, Yao Lao is currently in a slumber. With just my six star Dou Shi’s strength, how could I endure it without stopping to rest? When that time comes, others might see through my facade should I be careless.”</p><br/><p>Although he thought in such a manner in his heart, Xiao Yan would naturally not reply in this manner. The Purple Cloud Wings on Xiao Yan’s back flapped and his speed was slightly reduced. He said with a smile, “Ke ke, it is just that I want to use the time traveling on the flying beast to study the ‘Heavenly Flame’. Moreover, aren’t you planning to search for the medicinal ingredients for the ‘Spiritual Recovery Purple Pill’? We can stop at some of the big cities. The chances of us finding them there are a little higher.”</p><br/><p>Hearing this, Hai Bo Dong’s expression finally became more relaxed. He helplessly nodded. Remembering the rare medicinal ingredients with names that he had not even heard of, he could not continue to oppose the decision of taking the flying beasts.</p><br/><p>Seeing that Hai Bo Dong did not continue to insist, Xiao Yan quietly sighed in relief within his heart. The Purple Cloud Wings on his back suddenly flapped and his flying speed immediately soared. His figure turned into a flowing light and disappeared into the horizon.</p><br/><p>Since morning, they had been travelling quickly. Only when it was the afternoon did Tager City’s outline faintly appear in the sight of the two of them. They landed outside the city before once again leaping toward the city as though they were blown by the wind.</p><br/><p>The current Xiao Yan had already once again put on the tier two alchemist occupational robe. Although the huge black ruler on his back, which was almost to his height, gave him a somewhat strange appearance, the soldiers guarding the city did not have the courage to stop an alchemist for interrogation. Therefore, the two of them successfully entered the city which seemed quite big without any obstruction.</p><br/><p>After entering the city, Xiao Yan and Hai Bo Dong first went to those medicinal shops that appeared fairly large and searched them one at a time. Naturally, Hai Bo Dong’s intention was to find those medicinal ingredients needed to refine the ‘Spiritual Recovery Purple Pill’. Xiao Yan, on the other hand, was secretly observing if there were any medicinal ingredients that possessed the unique properties of swiftly recovering Spiritual Strength.</p><br/><p>Despite there being quite a number of medicinal shops in Tager City, the medicinal ingredients that Xiao Yan and Hai Bo Dong needed belonged to the extremely rare class. Therefore, the two of them would enter with high hopes, but leave with disappointment.</p><br/><p>After coming out of the last medicinal shop in the city, the two of them who were unwilling to give up took a turn and went to the auction house in the city. Unfortunately, they still found nothing.</p><br/><p>Standing on the street, the two of them faced each other and helplessly sighed. They could only give up their search and hurry to the Flying Transportation Company at the center of the city.</p><br/><p>With Xiao Yan’s status as an alchemist, the two of them expectedly and successfully boarded a luxurious flying Magic Beast dedicated to alchemists. After which, they began to spend a good few days travelling through the endless skies. Xiao Yan crossed his legs and began entering his training mode, slowly and quietly waiting reach his destination.</p><br/><p>During the period of the flight, Xiao Yan did not deal with some of the alchemist travelling along with him. However, when they occasionally saw each other, Xiao Yan would have a strange feeling in his heart. This was because of the fact that, after looking at their appearances, that some of these alchemist who were hurrying to the capital were actually not citizens of the Jia Ma Empire.</p><br/><p>Of course, when Xiao Yan was feeling surprised at these alchemist from other countries, those alchemists also had stunned faces when they saw his appearance and the alchemist tier badge on his chest. Clearly, Xiao Yan’s age and his alchemist tier had given them quite a significant blow.</p><br/><p>With the unhappy experience from the last time he took such a flight, Xiao Yan discriminated against communicating with people on the flying beast. Therefore, even when he saw the rich atmosphere when those alchemists were conversing with one another, he did not go forward and converse with them.</p><br/><p>However, on one occasion, Xiao Yan heard the words ‘Grand Meeting’. After being at a temporarily loss, Xiao Yan finally and suddenly remembered the invitation from the branch vice-chairman of an Alchemist Association Branch, Ao Tuo, back in the Black Rock City.</p><br/><p>“It seems that all of these alchemist are hurrying to participate in the Alchemist Grand Meeting…” Xiao Yan nodded his head. Only at this moment did he understand why so many alchemists from other countries had appeared on such a scale within the Jia Ma Empire territory.</p><br/><p>“Since it is the Alchemist Grand Meeting…, then I think that there should be many rare natural treasures in the hands of these alchemists.” Xiao Yan’s heart muttered in this manner. His eyes gradually brightened. If he could find a unique treasure to recover Spiritual Strength before heading up to the Misty Cloud Sect and wake Yao Lao up, Xiao Yan would really rest assured about this journey to the Misty Cloud Sect.</p><br/><p>With this thought,the rest of Xiao Yan’s thoughts became a little urgent. As he waited, the flying beast that had flew for nearly seven days finally and gradually arrived at its destination, the capital of the Jia Ma Empire, Jia Ma Sacred City!</p><br/><p>Standing on the back of the flying beast, Xiao Yan lowered his head to eye the magnificent city which had appeared under the clouds. He slowly exhaled a breath. Three years of time, three years of tough training, he finally arrived here…</p><br/><p>Following the slow descent of the flying beast, Xiao Yan’s gaze suddenly turned toward the north of the capital. There, a huge mountain that was definitely very grand, prostrated like a huge dragon, faintly emitted an aura that soared to the sky.</p><br/><p>Located at that place was the huge power of the Jia Ma Empire, the Misty Cloud Sect!</p><br/><p>“Misty Cloud Sect… Nalan Yanran, this useless person back then has come according to our agreement!”</p><br/><p>Xiao Yan’s eyes stared intently at the majestic mountain peak that was hidden in the faint fog. At this moment, his body trembled intensely...</p><br/>\n</div>"}