{"title": "Chapter 271: Imitation of the Angry Buddha Lotus Flame", "id": 271, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-271-imitation-of-the-angry-buddha-lotus-flame", "volume_title": "Volume 3", "body": "<h1>Chapter 271: Imitation of the Angry Buddha Lotus Flame</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 271: Imitation of the ‘Angry Buddha Lotus Flame’</u></strong></p><br/><p>Xiao Yan was stunned as he eyed the utterly discomforted Hai Bo Dong in the sky. A long while later, Xiao Yan was neither able to laugh nor cry as he shook his head. He waved the two kind of flames on his hand and said with a smile, “Old Hai, with my current condition, I am unable to unleash the explosion like back then… the one I have now is a ‘Angry Buddha Lotus Flame’ that I have modified. The situation of me losing control will not happen.”</p><br/><p>Hai Bo Dong eyed the cluster of Purple Flame on Xiao Yan’ hand. He had just realized that this cluster of purple colored flame was not a ‘Heavenly Flame’. Although its temperature was quite hot, it was undoubtedly much weaker when compared with the thick white flame that Xiao Yan controlled last time.</p><br/><p>“This fellow. Just how many things is he hiding? One moment a green flame, one moment a white flame, now he has come up with a purple flame. It really is impossible to see through him.” A sigh swiftly flashed across Hai Bo Dong’s heart. He faced Xiao Yan, shook his head and said with clenched teeth, “You lunatic. I can’t be bothered about whether you have made improvements. If you want to play, then play by yourself. I don’t want to be like the last time when I was almost played to death by you!”</p><br/><p>After saying this, a pair of icy cold wings were extended out of Hai Bo Dong’s back. He flapped them slightly and swiftly flew into the air in front of everyone’s stunned gazes. When only a small black dot remained, he finally came to a stop. It appeared that after the explosion from Xiao Yan’s ‘Angry Buddha Lotus Flame’ the last time, this person, who was once the Ice Emperor, really had somewhat of a physiological fear that was born. Otherwise, he would not choose to run away in front of so many people.</p><br/><p>Xiao Yan helplessly eyed Hai Bo Dong who had hidden himself far away. He lowered his head and glanced at the strange gazes Xiao Ding and the others surrounding him were using to look at him with. He waved his hand and said, “An old person is usually more cowardly…”</p><br/><p>“*Cough*...” Hearing this, Xiao Ding and Xiao Li gave a few dry coughs. Although Hai Bo Dong was quite old, his strength was so powerful that it was a little terrifying. Seeing the performance of Hai Bo Dong earlier, the hearts of the two of them began to feel somewhat uneasy. They exchanged a glance and immediately laughed dryly, “Xiao-Yan-Zi, exactly what is this experiment you are planning to do.”</p><br/><p>“It is just that I have just researched and found something and I want to try and see if it can succeed. The last time it appeared to have failed and as a result, it nearly blasted Old Hai and myself to death. Uh,,, he seemed to have some sort of mental phobia, which is why he is in this state. You all need not worry. This time around, I have specially reduced its strength. Even if it was to finally fail, it should not have the terrifying destructive power like last time.” Xiao Yan rubbed his head and carelessly said.</p><br/><p>“...” Hearing the somewhat uncertain tone in Xiao Yan’s words, cold sweat began to surface on Xiao Ding and Xiao Li’s forehead. Although they did not know the exact strength of Hai Bo Dong, seeing his ability to agglomerate Dou Qi wings, he should not be weaker than a Dou Wang class. What kind of abnormal thing had Xiao Yan created that could nearly blast such a strong person to death?</p><br/><p>After glancing at one another, their two gazes involuntarily drifted toward the small black dot in the sky. Their feet took a few steps back and dryly laughed, “I think that we should move back a little in order to give you a more relaxed environment…” As they said that, the two of them withdrew to the edge of the open ground at the same time as though they had a tacit agreement.</p><br/><p>Seeing the actions of the two Company Leaders, those Desert Metal Company members surrounding Xiao Yan and Luo Bu also became afraid in their hearts. After giving thought between safety and curiosity, the group of people hurriedly pulled back to the edge of the training ground. Immediately, the crowded training ground became totally empty.</p><br/><p>Eyeing the now open area which had became empty in the blink of an eye, Xiao Yan shook his head helplessly. He turned around and smiled as he eyed the pale faced Luo Bu.</p><br/><p>“Company… Company Leader Xiao Yan, I, I think that we should forget about it. Please find another person.”</p><br/><p>The heel of Luo Bu shivered weakly. He was shocked until his heart started to tremble upon witnessing Hai Bo Dong’s action in which the latter had lost himself. What strength did Hai Bo Dong have? He was a Dou Huang class strong person. Even in the whole of the Jia Ma Empire, he would be ranked among the top few. Despite having such a terrifying strength, he actually ended up losing himself because of the thing that Xiao Yan had created. It was difficult to imagine just how strong that thing actually would be. Luo Bu really suspected whether his actions during this period of time had caused Xiao Yan some displeasure, resulting in Xiao Yan finding an excuse to finish him off…</p><br/><p>“Mister Luo Bu, please relax. The strength of the ‘Angry Buddha Lotus Flame’ this time around is incomparable to the last time. With your strength, there will definitely not be any problems.” Seeing Luo Bu, who was frightened until his face was totally white, caused Xiao Yan to helplessly shake his head and respond reassuringly.</p><br/><p>Eyeing that seemingly utterly harmless delicate and handsome face, Luo Bu felt neither able to laugh nor cry. Why was it that such a bad thing ended up finding him?</p><br/><p>After spending a long time sighing loudly in his heart because of his luck, he could only smile bitterly and nod his head. The Dou Qi in his body suddenly flowed and surged out of his body, immediately covering the surface and solidifying into a hard yellow colored armor.</p><br/><p>The moment he acted, Luo Bu had summoned the ability of a Da Dou Shi, Dou Qi Armor. It appeared that Luo Bu’s heart felt ungrounded.</p><br/><p>Eyeing Luo Bu who had summoned his Dou Qi Armor as though he was about to face a great enemy, Xiao Yan helplessly nodded his head. On his palms, the green colored and purple colored flames writhered by themselves. The two palms faced each other and slowly moved closer.</p><br/><p>As the two flame slowly moved closer, an intense energy fluctuation once again abruptly rippled around Xiao Yan’s body like last time. Numerous muffled thunder like explosions were emitted within Xiao Yan’s palm. However, it was fortunate that the strength of the explosions this time around were not as terrifying as the last time. Therefore, the Dou Qi protecting Xiao Yan’s hands was able to withstand the impact.</p><br/><p>Xiao Yan used all his focus to drive the two clusters of flames to gradually merge. He did his best to recall the mysterious state that he had finally entered at the last moment last time. His dark eyes stared intently at the point where the flames were merging. There, the green-purple colored flame seedlings were like threads of electric flashes, swiftly traversing.</p><br/><p>In the distant tall sky, Hai Bo Dong frowned, eyeing the intense energy fluctuations around Xiao Yan’s body. He said softly, “The fluctuations this time around are indeed much smaller than the last time. Looks like this guy has really made some improvements. But this thing will explode if it is not controlled properly. The destructive strength will similarly not be small. After all, that green colored flame is a real ‘Heavenly Flame’.”</p><br/><p>“Ugh, this insane fellow. He keeps thinking of fiddling with these kinds of strange things.”</p><br/><p>Hai Bo Dong smiled bitterly and shook his head. Although in all honesty, he was rather envious of Xiao Yan’s courage which allowed him to dare to try anything. Back then, he had once met a strong person who was similarly able to control a ‘Heavenly Flame’ in the Chu Yun Empire. However, the attitude that strong person had toward the ‘Heavenly Flame’ was like how one would treat one’s ancestor. He was totally different than Xiao Yan who had actually dared to randomly use it to merge with another flame. In the eyes of many strong people, that was an action almost similar to seeking death…</p><br/><p>In the training ground, Xiao Yan’s eyes stared intently at the green-purple colored flame ball that was already compressed by him. A moment later, his dark eyes suddenly widened. His long ten fingers repeatedly pressed on the flame cluster.</p><br/><p>Controlling the flame cluster under a conscious condition for the first time, Xiao Yan finally understood that this seemingly random and gentle movement actually required a terrifyingly large amount of Dou Qi from the ‘Flame Mantra’ to be instilled. The ten fingers had only pressed and moved for around seven to eight times, but the Dou Qi within Xiao Yan’s vortex had already been reduced by around half.</p><br/><p>Xiao Yan did his best to recall the change the ‘Angry Buddha Lotus Flame’ underwent before it was formed. The black eyes of Xiao Yan were gradually shrouded by the green-purple, colored flames. After a moment, the pressing and moving fingers suddenly stopped. The Spiritual Strength suddenly spread out of Xiao Yan’s body, finally turning into tiny and delicate lines which were inserted thread by thread into the raging flame.</p><br/><p>Following the intrusion of the Spiritual Strength, the violent energy contained with the green-purple flame cluster began to gradually disappear. In only the blink of an eye, the cluster of flame, which was releasing hedgehog like spikes, actually completely quieted down.</p><br/><p>Staring intently at the green-purple flame cluster in his palm which had finally calmed down as he had intended, Xiao Yan sighed in relief within his heart. His right hand dragged the flame cluster as he closed his eyes. The Spiritual Strength that had intruded into the flame cluster began to slowly change the shape of the flame cluster.</p><br/><p>Following the gradual activation of the Spiritual Strength, the cluster of flame which was like a rubber ball began to slowly wriggle. Its size, which was originally that of a head, also swiftly shrank. After a long while, a lotus seat shape at its embryonic stage the size of a palm began to faintly appear between the green and purple light glow.</p><br/><p>After another moment, the green-purple light glow slowly disappeared. An extremely beautiful green-purple lotus seat floated above Xiao Yan’s palm.</p><br/><p>In the sky, Hai Bo Dong’s eyes narrowed as he eyed the green-purple lotus seat that was formed in Xiao Yan’s palm. He muttered, “This guy is really becoming more and more practiced with his control. If he were able to control that ‘Angry Buddha Lotus Flame’ to such an extent when he first used it, it would be likely… that ‘Eight-Winged Black Serpent Emperor’ would have been blasted to death on the spot.”</p><br/><p>“In the future, if he was to once again merge two different ‘Heavenly Flames’ accompanied with this kind of control, I think that other than some extremely abnormal people, there should be no one in the Dou Huang class who would be able to withstand such a terrifying explosion directly.” Hai Bo Dong gently exhaled a mouthful of icy breath. His expression was complex as he whispered while staring at the black clothed young man on the ground.</p><br/><p>On the training ground, Xiao Yan’s hand supported the green-purple lotus seed as he raised his head and eyed Luo Bu who was totally concealed behind the Dou Qi Armour. His slightly pale face revealed a smile as he tapped gently on the lotus seat. Immediately, the green-purple lotus seat abruptly turned into a ray of light and in a lightning like manner, was violently shot in a projectile like manner toward Luo Bu.</p><br/><p>Xiao Yan quietly watched the ‘Angry Buddha Lotus Flame’ whose distance from Luo Bu was becoming increasingly closer. He slowly extended his palm and suddenly clenched it. A soft voice called out, “Explode!”</p><br/><p>As the cry fell, the green-purple lotus flame flying across the air abruptly stopped. Immediately, the lotus seat swelled slightly and then suddenly exploded…</p><br/><p>“Bang!”</p><br/><p>The deafening explosion suddenly blasted through the training ground. An enormous crack line swiftly spread out from where the explosion was…</p><br/><p>“Perfect control…”</p><br/><p>High in the sky, Hai Bo Dong slowly closed his eyes as he softly muttered. At the same time a genuine palpitation rose in his heart...</p><br/>\n</div>"}