{"title": "Chapter 287: The Benefits of the Champion", "id": 287, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-287-the-benefits-of-the-champion", "volume_title": "Volume 3", "body": "<h1>Chapter 287: The Benefits of the Champion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 287: The Benefits of the Champion</u></strong></p><br/><p>Xiao Yan’s gaze stared lazily at this black colored broken jade piece. He randomly held it in his hand. The jade piece that entered his hand was not smooth. Instead, it was covered with tiny granules and appeared as if the material was not very good. Moreover, there were some faint crack lines on the jade piece. Between the gaps there were even some soil stains.</p><br/><p>As he played with the jade piece, Xiao Yan’s eyebrows were knit together. From his senses, he appeared to feel that this thing was somewhat strange. However, he was unable to say where it was strange. His Spiritual Strength explored around it, but found no activity nor did he receive any information.</p><br/><p>“Don’t tell me that I have sensed wrongly?” Xiao Yan uncertainly muttered in his heart. His finger slowly cut across the jade piece. He wanted to put it down, yet his palm could not throw it aside. A long while later, he helplessly shook his head and eyed the man who was staring at him anxiously. His hand randomly chose a few medicinal ingredients that looked barely acceptable. After which, he waved at the young man, smiled and asked, “Do you want to exchange for items or sell them?”</p><br/><p>“Grandmaster, I want to exchange them for a tier three medicinal pill.” Hearing this, the young man’s spirit rose. Immediately, he smiled awkwardly as he spoke. He knew in his heart that these medicinal ingredients did not appear to be worth a tier three medicinal pill.</p><br/><p>Xiao Yan indifferently glanced at him. He placed the things in his hands into the storage ring. After which, he easily took out a bottle which only had three ‘Energy Recovery Pills’. He tossed it to the man and said, “These are tier three medicinal pills, ‘Energy Recovery Pill’. It can swiftly recover Dou Qi that has been depleted. As it belonged to the more common consumption type medicinal pill, I will give you three of them.”</p><br/><p>The man scrambled to received the bottle. A joy that was difficult to hide appeared on his face. Three ‘Energy Recovery Pills’. If one were to discuss about its price, it would not be lower than forty thousand gold coins. Counting in this manner, he had profited by a lot. Immediately, he hurriedly bent his body toward Xiao Yan who was already walking off and bowed.</p><br/><p>Xiao Yan left the counter in this area and headed out of the eastern area. His finger rubbed on the storage ring and the piece of black colored broken jade piece once again appeared in his palm. He frowned and played with it in his hand. A moment later, he still had no clue and could only sigh disappointedly as he held it.</p><br/><p>Standing in the middle of the hall, Xiao Yan was at a loss as he looked around him. He mused for a moment before pulling over a delicate and pretty lady who appeared to be a female servant and softly inquired about the position of the Head of the Alchemist Association Branch at Black Rock City.</p><br/><p>Although this female servant, who appeared to be busy with something, was somewhat angry at being suddenly stopped, her pretty face immediately revealed some respect when she saw the tier two alchemist badge on Xiao Yan’s chest. Her delicate finger pointed at the western area where the human flow was extremely low. With a gentle voice, she said, “That place is the area where the heads of the various Alchemist Association Branches in the Jia Ma Empire is at. However, only alchemist tier three and above have the qualification to enter.”</p><br/><p>“Haha, thank you very much.” Xiao Yan said his thanks, lifted his feet and walked toward the quiet western area. When he was about to enter, he was unsurprisingly blocked by the two guards at the entrance.</p><br/><p>“May I trouble you to help me inform Grandmasters Frank or Ao Tuo from Black Rock City that Xiao Yan has come to see them.” Eyeing the two icy expressions of the guards, Xiao Yan said with a smile.</p><br/><p>The two guards eyes glanced at the tier two alchemist badge on Xiao Yan’s chest and then swept across the young face. Their eyes revealed quite a bit of shock. Becoming a tier two alchemist at such a young age was something that was really rarely seen. Immediately, the coldness on their faces melted a little. They nodded slightly and after asking him to wait, one of them stepped back and swiftly climbed up some stairs.</p><br/><p>Xiao Yan inserted his hands into his sleeves as he stood at the entrance. His eyes were closed as he quietly waited.</p><br/><p>Not long after the guard climbed up the stairs, a wave of hurried footsteps swiftly sounded. A moment later, an old figure was first to appear in Xiao Yan’s sight. A joy covered his face.</p><br/><p>The old man quickly came to the entrance. His gaze swept around but did not see the person that he wanted to meet. The smile on his face stiffened as he frowned. He faced the guard beside him and softly reproved, “Where is he? Don’t tell me that he was ousted by you people?”</p><br/><p>“Grandmaster Ao Tou.” Hearing the old man reprove, Xiao Yan smiled and cried out.</p><br/><p>“You…” Hearing the somewhat familiar voice, Ao Tuo was at a loss. His gaze doubtfully eyed this young stranger in front of him. A long while later, he finally said in a stunned voice, “Xiao Yan? Why have you turned yourself into this manner?”</p><br/><p>Xiao Yan smiled and shook his head. He softly said to Ao Tuo, “I will tell you later. There are many eyes looking around here.”</p><br/><p>“Uh… follow me in.” Hearing this, Ao Tuo took the hint and nodded. He turned his head and fiercely said to the two guards, “The both of you heard nothing. Do you understand?”</p><br/><p>Seeing Ao Tuo’s fierce and vicious manner, the two cold faced guards bitterly smiled. Immediately, they wisely nodded their heads. After being a guard for so many years, they naturally knew what was taboo.</p><br/><p>This action of Ao Tuo caused Xiao Yan to nod his head slightly. Ao Tuo was indeed someone who could become the deputy chairman of the Alchemist Association Branch at Black Rock City. When he did something, he ensured that it was watertight.</p><br/><p>Following behind Ao Dou, Xiao Yan slowly walked up the stairs. Only when the human flow around them became scarce did Ao Tuo softly asked, “Xiao Yan, why did you turn yourself into this manner? Don’t tell me that you have offended someone? Tell me about it. In this Jia Ma Empire Sacred City, the words from me, Ao Tuo, do have some weight.”</p><br/><p>“Hehe, thank you Grandmaster Ao Tuo. It’s just some private matter. I don’t want someone to recognize my identity.” Xiao Yan shook his head and rejected Ao Tuo’s good intention.</p><br/><p>“So it’s like this? Then it’s up to you.” Hearing Xiao Yan’s intention to reject, Ao Tuo did not insist. His old and sharp gaze slowly swept across Xiao Yan. A while later, his voice had a shock that could not be covered, “What a great little fellow. After not seeing you for a year, your strength has actually soared, The current you should at least have the strength of a five star Dou Shi, right?”</p><br/><p>“I was merely lucky.” Xiao Yan shook his head and smiled.</p><br/><p>“Tsk tsk, what a great little boy. This kind of talent really stuns everyone. I wonder which old fellow had the luck to find such a good student.” Ao Tuo said as he praised unceasingly. His face was filled with envy.</p><br/><p>Xiao Yan smiled, but did not chip in on this topic. His footsteps moved at a comfortable pace as he moved in parallel to Ao Tuo.</p><br/><p>TL: Huge thing in china to move parallel to someone</p><br/><p>“We’ve arrived.”</p><br/><p>Their footsteps walked past a few luxurious large rooms and finally stopped outside of a spacious room. When Ao Tuo heard the scolding voice emitted from inside, he smiled and said to Xiao Yan, “This is that old fellow Frank reprimanding that girl Xue Mei. That girl actually used his tier four medicinal formula to exchange for a ‘Peach Blossom Flame Seed’. It pained him to death…”</p><br/><p>Hearing this, Xiao Yan was dumbfounded as he involuntarily laughed. He had already knew that once Xue Mei returned, she would definitely receive a huge scolding. A tier four medicinal formula was not an ordinary thing.</p><br/><p>Xiao Yan stepped into this spacious room. His gaze swept across it and finally stopped at the middle of the room. There, Frank, who was wearing an alchemist’s long robe, was sending his saliva flying everywhere. His old face was green as he furiously slammed the table. In front of him, Xue Mei’s hands were still holding the ‘Lotus Blossom Flame Seed’ while she remained silent and allowed Frank to scold angrily.</p><br/><p>At the other corner of the table, a lady wearing a red colored clothes was gloatingly watching Xue Mei who was being scolded. When she heard the door opening, she swiftly shifted her gaze over. Her sight swept across Xiao Yan’s body behind Ao Tuo. Immediately, she murmured with the corner of her mouth and said, “Teacher, is this the person who requested for you to personally go down to receive him? What a large face he has…”</p><br/><p>Hearing her voice, Frank, who was giving a big reprimand immediately paused. His gaze turned to Xiao Yan and said with surprise, “Old Ao, who is this?” Seeing his manner, they were apparently ignorant of who was coming up when the guard had informed them.</p><br/><p>Seeing the numerous surprised gazes, Xiao Yan touched at the area around his neck and moved. A moment later, he pulled down the mask, revealing his delicate and handsome face which had a fair complexion.</p><br/><p>“Grandmaster Frank. After not seeing you for a year, you are becoming stronger in your old age.” Xiao Yan returned the ice silk dough into his storage ring and said with a smile to Frank.</p><br/><p>“Xiao Yan? It is actually you, little fellow. I thought you wouldn’t be coming.” Eyeing the face that had a diminished tenderness compared to a year ago, Frank was stunned before he immediately said with great joy.</p><br/><p>Xiao Yan smiled and slowly walked forward. He eyed Xue Mei, who appeared glamorous and moving in her silver colored dress. She had also turned her curious gaze over to him. As their eyes met, they courteously smiled at each other.</p><br/><p>“Grandmaster Frank, this kind of ‘Peach Blossom Flame’ may not be considered a strong flame, but it is undoubtedly much stronger than an ordinary flame that was catalyzed from Dou Qi. Moreover, this kind of flame is less frantic compared to other flames, being finer and smoother instead. It is quite suitable to be used to refine medicinal pills. Although a tier four medicinal formula is extremely valuable, grandmaster must have already read it. With your ability, you should be able to prepare another copy if you spend some time.” Xiao Yan smiled and said to Frank as he eyed the pink colored flame seed in Xue Mei’s hand.</p><br/><p>“Ah, this is the only thing that I can do. But without at least half a year, it is impossible to prepare another tier four medicinal formula again. It is too troublesome to create that thing.” Frank helplessly shook his head and finally ceased his scolding.</p><br/><p>Seeing that her Teacher had stopped reprimanding her, Xue Mei also sighed in relief. She faced Xiao Yan and gratefully smiled. Her icy pretty face appeared even more moving.</p><br/><p>“You actually interceded on Xue Mei’s behalf? Have you taken a fancy to her?”</p><br/><p>Being the enemy of Xue Mei, Lin Fei naturally was not happy to see her escape like this. She hurriedly leaped forward. Her hands held her waist as she stared at Xiao Yan’s delicate and handsome face. Her heart inexplicable muttered quietly to herself, “Why does this guy look even better than before?”</p><br/><p>Xiao Yan was not overly concerned about Lin Fei who was like a female cat. His gaze stared at her delicate and pretty face until her face could not help but be flooded with some scarlet color. Only then did he laugh loudly and turn his gaze aside, leaving Lin Fei to stand on the same spot with her crimson face as she angrily stomped her little feet.</p><br/><p>“Ke ke, Xiao Yan. The reason for your coming to the Jia Ma Scared City should be because of the Alchemist Grand Meeting, right?” Pulling Lin Fei aside, Ao Tuo sat on a chair and laughed.</p><br/><p>Hearing these words of Ao Tuo, the eyes of Frank at the side also brightened. He hurriedly turned his gaze toward Xiao Yan. He naturally knew what kind of outstanding refining talent that this little fellow possessed. If he wanted to participate in the Alchemist Grand Meeting, he would be a popular choice of becoming the champion.</p><br/><p>Xiao Yan smiled and gently tapped his finger on the table. He smiled and said, “What benefits do I have for participating in this Grand Meeting? Don’t tell me that it is only to compete for fame? I am not really interested in that.”</p><br/><p>“Uh?” Hearing this, Ao Tuo and Frank were blank. They said in a stunned voice, “If you are able to stand out in the Alchemist Grand Meeting, your future will be really smooth. When that time comes, an unknown number of strong strengths would invite you to join them… and your reputation and status in the Jia Ma Empire would swiftly be raised.”</p><br/><p>“You should know that Pill-King Gu He came to fame in such a manner back then.”</p><br/><p>“I’m sorry. I don’t like to join and rely on any strength.” Xiao Yan shook his head and stretched his lazy waist. He said with a smile, “Therefore, please tell me what kind of substantial benefits there are.”</p><br/><p>“Hey, aren’t you a little too realistic?” In the corner, Lin Fei knit her eyebrows and said annoyingly when she heard Xiao Yan being so forthright.</p><br/><p>Xiao Yan waved his hand and ignored her.</p><br/><p>“Ah, you little fellow… really won’t act until you have identified your target.” Ao Tuo smiled bitterly and exchanged glances with Frank. He helplessly shook his head and slowly said, “According to the rules, each season’s Alchemist Grand Meeting champion will become an honorary elder of the Alchemist Association and enjoy the same welfare and authority as other elders of similar grade. At that time, you would be able to obtain the help within your authority at any Alchemist Association Branch in the Jia Ma Empire. Additionally, you will be able to have priority in exchanging for the rare medicinal ingredients in the association’s warehouse.”</p><br/><p>“Oh right, in the entire of the Jia Ma Empire, the number of people who have the qualification to enjoy such a treatment would not exceed fifteen. As long as you become the Alchemist Association honorary elder, any strength would think carefully before touching you. Remember, this is any strength, including the royalty and the Misty Cloud Sect! Our Alchemist Association has the qualification to say this.”</p><br/><p>Xiao Yan’s finger that was tapping the table’s surface suddenly paused. He pursed up his lips and the glow in his eyes flickered. After Ao Tuo had said up to this point, Xiao Yan’s heart had gradually felt a little moved. He knew that he would sooner or later stand opposing to the Misty Cloud Sect. At such a time, if he had the support of this strength, which could cause the Misty Cloud Sect to think twice, it would naturally help him save a lot of trouble.</p><br/><p>Seeing that Xiao Yan was obviously somewhat interested, Ao Tuo sighed slightly in his heart. He smiled and threw the last temptation, “Additionally, the reward for the champion this season would be a medicinal formula for a tier six medicinal pill.”</p><br/><p>“A medicinal formula for a tier six medicinal pill?” Xiao Yan’s eyes shrunk slightly. He slowly inhaled a breath of cold air. The price of a medicinal formula of this tier would not lose to that of a Di class Dou Technique.</p><br/><p>“What kind of medicinal formula? What use does it have?” Xiao Yan cautiously inquired. Although a tier six medicinal formula was rare, it was also necessary to consider the effect of the medicinal pill. Take the ‘Breaking Adversity Pill’ of Hai Bo Dong the last time. It belonged to a slightly unorthodox medicinal formula and its value is at most similar to a tier five medicinal formula.”</p><br/><p>“‘Thawing Spirit Pill’, a kind of medicinal pill that can let the spirit and the physical body merge together. Its medicinal effect is a little unorthodox, but for a spiritual body, it is a perfect, saint-like medicine. Not only would it cause the spirit to swiftly recover, but it is also able to completely repair all the damage that the spirit has received.”</p><br/><p>“Spiritual body? Recovering spiritual strength?” Xiao Yan was extremely sensitive as he grasped these two key phrases. His heart gradually jumped intensely.</p><br/><p>“Brat, get your hands on the medicinal formula for this ‘Thawing Spirit Pill’ and I will not kill you in the future!”</p><br/><p>Just as Xiao Yan was moved by these two ample condition, his hands, which were in the sleeves, suddenly became cold. A weak spiritual message that carried some enchanting taste was transmitted into his mind.</p><br/><p>The sudden appearance of the enchanting voice caused Xiao Yan to abruptly tighten his fists in his sleeves. A cool air swiftly shrouded his chest, causing his entire body to become icy cold. He recognized the owner of the voice. It was shockingly from Queen Medusa who was hidden within the body of the ‘Heaven Swallowing Python’...</p><br/>\n</div>"}