{"title": "Chapter 295: Black Horse", "id": 295, "volume": 3, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-295-black-horse", "volume_title": "Volume 3", "body": "<h1>Chapter 295: Black Horse</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 295: Black Horse</u></strong></p><br/><p>As Xiao Yan walked out of the test ground, Ao Tuo caught up with him from behind and walked side by side with Xiao Yan. Occasionally, Ao Tuo would tilt his head and glance at the calm faced young man who was smiling. His gaze was somewhat strange.</p><br/><p>“Why do you keep staring at me?” After walking for some distance, Xiao Yan could not endure Ao Tuo’s gaze. Finally, he helplessly shook his head and asked.</p><br/><p>“Ke ke, I am just trying to figure out how many things you, little fellow, are hiding. You are actually able to cause everyone to be so shocked…” Ao Tuo said with a smile.</p><br/><p>Hearing this, Xiao Yan could only helplessly shrug his shoulders.</p><br/><p>“With your performance being so eye catching this time around, I think that old fellow, Qi Mi Er, will definitely come to me to inquire about your background pretty soon. Although he does not know your actual ability, just being able to refine the ‘Black Iron Spiritual Leaf’ eight times when you are only around twenty years old is something that could be counted with one hand since the association was founded.” Ao Tuo said.</p><br/><p>“I know…” As Xiao Yan slowly walked, he nodded his head. During the refining of the ‘Black Iron Spiritual Leaf’, he had also considered all of this. However, the Grand Meeting was about to begin. Revealing his ability was something that had to be done sooner or later. Therefore, there was no necessity to purposefully perform poorly here. Although keeping a low profile was good, if it was overdone, the disdain and the mocking gazes really caused Xiao Yan to feel entangled and helpless.</p><br/><p>“I will have to trouble Grandmaster Ao Tuo to help me keep anything related to my identity a secret.” Xiao Yan pursed up his lips and softly said, “Due to some issues, if my identity is exposed, it is very likely that I would be unable to participate in this Grand Meeting. Therefore, I would like Grandmaster to try your best to help me.”</p><br/><p>Hearing the serious consequence that Xiao Yan had mentioned, Ao Tuo was at a loss. He immediately knit his eyebrows tightly together. If Xiao Yan were to withdraw from the competition, it would result in the Black Rock City’s Alchemist Association losing a chance to obtain a good result. This threat had a very significant weight toward Ao Tuo who had not had any great contributions ever since he came into his position.</p><br/><p>Ao Tuo frowned tightly and mused for a long while before nodding his head. He smiled bitterly and said, “Alright. I will try my best to help you keep it a secret. It is good that the member information has yet to be submitted. I can still change it.”</p><br/><p>“Ke ke, then thank you very much, Grandmaster Ao Tuo.” Hearing his words, Xiao Yan sighed in relief and replied along with a smile.</p><br/><p>“There’s no choice. I don’t want the competitor that I had a difficult time finding to just run away.” Ao Tuo helplessly said.</p><br/><p>Xiao Yan smiled. He was about to say something when Frank’s clear laughter suddenly sounded in front of them, “Hey, Old Ao. How was it? Has the test ended? How did the little fellow do?”</p><br/><p>Currently, Xiao Yan and Ao Tuo had already walked out of the corridor. Since this was an intersection, the human flow here was quite significant. When they heard Frank’s laughter, there were quite a number of curious people who immediately slowed their footsteps and threw their gazes at Xiao Yan, who was walking together with Ao Tuo. As the test before was an internal one, these alchemists did not know the exact results of the competition. However, they were able to know that the people who were able to participate in that internal test were mostly seeded competitors in this Grand Meeting and their abilities were extraordinary.</p><br/><p>Hearing the laughter, Xiao Yan raised his head and eyed Frank who was striding over with a smile. Following beside him was the icy looking Xue Mei, who was wearing a silver colored dress and Ling Fei. At the moment, their gazes were a little curious as they too, shot them toward Xiao Yan. Clearly, they were very curious as to what kind of result Xiao Yan was able to obtain at a test of this level.</p><br/><p>“It’s alright. I have barely managed to pass…” Seeing the three people who had arrived in front of him, Xiao Yan smiled and said.</p><br/><p>Hearing this, Ao Tuo at the side rolled his eyes. If this kind of result was considered just passable, then wouldn’t the rest of the people fail?</p><br/><p>“Haha, you passed? That’s good. I was originally still a little worried. After all, those fellows who participate in the internal test aren’t ordinary people.” Frank said with another smile.</p><br/><p>“Hey, you. This time around, you are representing our Black Rock City. Although I don’t expect you to surpass the geniuses around Liu Ling’s level, you need to at least get into the top ten for this kind of internal test in order for you to gain the possibility of attaining a good result at the Grand Meeting. Just simply passable is inadequate…” Ling Fei muttered. Clearly, she thought the passable that Xiao Yan had mentioned would be the kind that barely met the grade needed to pass.</p><br/><p>“Liu Ling may be a genius, but he is after all the disciple of the Pill-King. Moreover, he is a little older than Xiao… Yan Xiao. Having received such a result is already quite good. At the very least, we don’t even have the qualification to obtain this kind of result.” It appeared that because Xiao Yan helped put in some good words on her behalf on the matter of the ‘Peach Blossom Flame’ the last time around, Xue Mei glanced at Ling Fei and said faintly, “I know that you hero worship that Liu Ling, but Yan Xiao is someone from our side. If he loses, our Black Rock City’s reputation will suffer.”</p><br/><p>“I have only said this because he is the representative from our Black Rock City… and did not say much about him… what does this have to do with Liu Ling?” Ling Fei said resentfully.</p><br/><p>“Oh, alright. The both of you should quiet down.” Seeing this pair of enemies, Ao Tuo helplessly shook his head. He faced Frank and said with a grin, “When you hear what happened, you will likely be shocked until your jaws drop.”</p><br/><p>“Oh? What happened?” Frank was stunned as he uncertainly asked.</p><br/><p>Ao Tuo silently smiled. He was about to open his mouth when a commotion occurred in the corridor behind him. They turned around to take a look. It appeared that the commotion was caused by the competitors that were participating in the test who had successively come out. The two people right at the front were coincidentally the Little Princess and the somewhat gloomy faced Liu Ling.</p><br/><p>“Is that Liu Ling? Pill-King Grandmaster Gu He’s disciple? His presence is indeed extraordinary.”</p><br/><p>“He’s a tier three alchemist at such a young age. Ah, he really causes people…”</p><br/><p>“I think that the one with the best result for the test would undoubtedly be him.”</p><br/><p>“He does have such a good teacher… There’s no point being envious over it.” Eyeing the group of people that had walked out from the corridor, the surrounding people immediately began to engage in their private conversations.</p><br/><p>Xiao Yan tilted his head and eyed Liu Ling, who was walking over. He smiled.</p><br/><p>Walking out of the corridor with a gloomy face, Liu Ling spotted the familiar back with one glance. The corner of his mouth twitched a little. He then inhaled a deep breath of air. Instantly, the emotions on his face swiftly disappeared. Replacing it was that feminine smile.</p><br/><p>“Mister Yan Xiao congratulations.” Liu Ling walked forward. He first bowed and greeted Ao Tuo and Frank before turning his head to speak to Xiao Yan, with a smile plastered on his face.</p><br/><p>Xiao Yan shook his head. “I was lucky.”</p><br/><p>“I still have something to do and it is not convenient for me to converse any longer, Mister Yan Xiao, let us meet at the Grand Meeting tomorrow.” Liu Ling clearly was not in the mood to chat now. After he greeted them, he lifted his feet and quickly moved passed Xiao Yan’s group. After which, he passed through the crowd and disappeared from everyone’s sight.</p><br/><p>“Mister Yan Xiao.” After following Liu Ling and taking a few steps forward, Little Princess suddenly paused. She hesitated a moment before turning around and said with a smile to Xiao Yan, “There is a gathering tonight where many alchemists will be attending, You…”</p><br/><p>“Hehe, I’m sorry. I still have something to do tonight and I’m afraid I won’t have the time…” Xiao Yan was a little stunned at this olive branch that the Little Princess suddenly extended toward him. He immediately understood the true reasoning, shook his head and smiled as he replied.</p><br/><p>Xiao Yan’s rejection was not beyond Little Princess’s expectations. Her lips moved a little. After staring at Xiao Yan for a moment, she finally said with another smile, “Since it’s like this, then I will not force you. In the future, if Mister Yan Xiao needs any help, you can come and look for me. Goodbye.”</p><br/><p>Xiao Yan pursed up his lips as he eyed the Little Princess who slowly disappeared from the edge of his sight. He recalled her attitude toward him before the test and took a look at the situation again. He could not help but smile bitterly as he said in his heart, “She is indeed a person from the imperial family. In her eyes, the difference between someone useful and someone who is not actually makes such a big difference in treatment.</p><br/><p>After watching Liu Ling disappear, Ling Fei, who still had stars in her pupils, finally turned around. She eyed Xiao Yan and asked doubtfully, “That’s right? Why did he congratulate you just now?”</p><br/><p>“It’s nothing.”</p><br/><p>Xiao Yan smiled. He did not think that winning over Liu Ling was something very great. Although he was Gu He’s disciple, but to Xiao Yan, who had once dared to treat Gu He and Queen Medusa as fish and pearl while he acted as a fisherman, this little fame did not cause him to feel the slightest awe.</p><br/><p>TL: Take advantage of Gu He and Queen Medusa’s fight to benefit</p><br/><p>“Everyone, I also have some things to do. I will take my leave first. Let’s meet again at tomorrow’s Grand Meeting.” Without giving Ling Fei a chance to continue to inquire further, Xiao Yan smiled at Ao Tuo and the others. He cupped his hands together before swiftly walking out of the association.</p><br/><p>“The internal test just now was to refine the ‘Black Iron Spiritual Leaf’.” Watching Xiao Yan’s hurrying back, Ao Tuo touched his white beard and suddenly said a moment later.</p><br/><p>“Refining the ‘Black Iron Spiritual Leaf’? That seems quite difficult. That thing is almost the hardest ingredient among the middle-grade ingredients to refine. With my current ability, I would at most be able to refine it eight or nine times.” Hearing his words, Frank was surprised as he turned his head and replied.</p><br/><p>“Haha, that’s right.” Ao Tuo smiled and nodded his head. He faced the spot where Liu Ling disappeared and fondled his chin. “That Little Fellow refined it six times.”</p><br/><p>“Six times?” Hearing Ao Tuo’s words, Frank’s face was immediately filled with shock. He clicked his tongue and praised, “How incredible. At such an age, he was actually able to achieve that many refinements. He really is worthy of being Gu He’s disciple.”</p><br/><p>“That thing… I seem to be only able to refine two times. Ling Fei is around the same as me. That Liu Ling’s talent is really extraordinary.” Xue Mei at the side sighed gently as she said.</p><br/><p>“Hee hee. That is only natural. The most outstanding person among the Jia Ma Empire’s younger generation alchemists is undoubtedly no one but him.” Ling Fei smiled and said. Seeing her manner, it appeared that she was really worshipped Liu Ling.</p><br/><p>“Ke ke, that may not necessarily be true.”</p><br/><p>Ao Tuo smiled and shook his head. Seeing Ling Fei’s angry eyes staring at him, he said with a grin, “Although Liu Ling is extremely outstanding, Yan Xiao is not any worse compared to him. In the test just now, Liu Ling refined six times while Yan Xiao did it eight times!”</p><br/><p>These words of Ao Tuo were undoubtedly like a thunderbolt, causing Frank’s expression to instantly stiffen. Eight times? That was an extent that required a tier four alchemist in order to achieve. Yet Xiao Yan, as a tier two alchemist, was actually able to achieve this? How was this possible?</p><br/><p>“Teac… Teacher, you… you are joking right?” Ling Fei recovered from her shock as she awkwardly said. She had great difficulty believing that Xiao Yan was actually, ridiculously stronger than Liu Ling.</p><br/><p>On one side, Xue Mei also widened her red lips. Her icy expression was at the moment, somewhat shocked. Although she had never underestimated Xiao Yan, she had never thought that he would be able to attain such an eye catching result.</p><br/><p>“Old Ao. Is what you said true?” Fu Lan Ke stared at Ao Tuo intently. His face revealed an unrestrained joy. The more outstanding Xiao Yan’s performance was, the greater the benefit to the Black Rock City’s branch.</p><br/><p>“This little fellow hides his ability absurdly deep. Suddenly, I have began to anticipate the Grand Meeting this time around.” Ao Tuo smiled as he eyed the spot where Xiao Yan had disappeared from. He said, “During this Grand Meeting, Yan Xiao may well be the largest black horse!”</p><br/>\n</div>"}