{"title": "Chapter 316: The Final Round: Begin!", "id": 316, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-316-the-final-round-begin", "volume_title": "Volume 4", "body": "<h1>Chapter 316: The Final Round: Begin!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 316: The Final Round: Begin!</u></strong></p><br/><p>When the sky had just become bright the next day, this flourishing city appeared like a huge machine controlled by a clock as it began to function in an orderly manner. The human flow that passed through the city’s streets were the best attestments to the power of this large machine.</p><br/><p>The place within the city which was most crowded and lively today was without a question the huge Imperial family’s square. After yesterday’s competition had been spread around by the audience, there was an increasing number of people whose minds were attracted by the news of this soul-stirring pill refining competition. Therefore, the area outside the Imperial family square was already filled with people even though it was still quite early. The dark mass of human head extended until the edge of one’s sight.</p><br/><p>As time elapsed, a morning ray from the horizon broke through the restraining layer of clouds and shone on the huge city. The closed main doors of the Imperial Family Square were slowly opened as the sun rose. Immediately, the black mass of people outside began flooding in like the tides.</p><br/><p>Xiao Yan and Hai Bo Dong were stunned when they arrived at the open ground and eyed the long human dragon at the main door. Immediately, they shook their heads helplessly. It was unexpected that the audience today would be even crazier than the one from yesterday.</p><br/><p>“Follow me.” Hai Bo Dong swept his gaze around once before speaking to Xiao Yan. After which, he turned around and walked toward the other side of the plaza. Xiao Yan followed Hai Bo Dong and walked for some distance. The noise had also gradually been reduced by a large amount. They turned at a bend and Xiao Yan realized that there was another back door at the back of the plaza. It was just that there was over a hundred fully armed guards at this back entrance, totally blocking it.</p><br/><p>Hai Bo Dong ignored these soldiers and led Xiao Yan through the entrance as though there was no one else present. Those guards also appeared to be aware of the identities of the two of them since no one came forward to stop them.</p><br/><p>Xiao Yan entered the door and walked for some distance before his sight suddenly broadened. He lifted his eyes and looked around, only to find that Liu Ling, and Little Princess had actually arrived earlier than him. Beside the two of them, there were quite a number of competitors who had passed the two rounds of the competition yesterday. This group of young people were conversing and smiling with one another.</p><br/><p>When Xiao Yan and Hai Bo Dong arrived, everyone, who appeared to be discussing something softly, suddenly lowered their voices significantly. Although Xiao Yan was still wearing the robe of a tier two alchemist, there was not a single person among those present who was stupid enough to think that was a representation of his true ability. In the soul-stirring competition yesterday, the ability that Xiao Yan had displayed had caused everyone to watch him with amazement. Among this group of competitors, Xiao Yan undoubtedly belonged to the leading position. This leading position was something that even Liu Ling and Little Princess had difficulty comparing against. After all, the ridicule from Yan Li yesterday was a blow toward all the Jia Ma Empire’s participants. Yet, Xiao Yan was the only one who could reflect the ridicule back at Yan Li.</p><br/><p>Regardless of where one was, people with ability would always easily obtain other people’s reverence. This did not have slightest change even when one was was placed in the alchemist world.</p><br/><p>“Haha, Mister Yan Xiao, you are quite early.” The Little Princess smiled as she spoke and eyed Yan Xiao, before turning around and moving forward.</p><br/><p>“Little Princess is also early.” Although Xiao Yan did not like the Little Princess’s initial attitude toward him when they first met, she was after all the descendant of that old demon whom even Hai Bo Dong feared. Therefore, it was not good for Xiao Yan to appear too cold. He nodded his head and randomly said some greetings that had no substance to them.</p><br/><p>“The examination today is the final round. Mister Yan Xiao, we cannot lose to that fellow.” The Little Princess softly laughed, unconcerned about the perfunctory reply that Xiao Yan gave.</p><br/><p>“I will try my best. That fellow is definitely not someone simple.” Xiao Yan nodded as he replied.</p><br/><p>“Mister Yan Xiao, you cannot make any mistake during such an important moment. I still wish to compete with you.” Liu Ling walked over and smiled faintly. Although he had managed to persist through the two examination rounds yesterday, it was clear that Xiao Yan was better than him if one did a comparison. This was really a blow to Liu Ling, whose character was usually arrogant.</p><br/><p>Xiao Yan randomly nodded before raising his head. On the second story, Fa Ma and a group consisting of the upper echelons of the association were slowly walking out. When he saw that Xiao Yan had looked over, Fa Ma gave him a friendly smile. After which, he led everyone and walked down to greet Xiao Yan and the others.</p><br/><p>As the group of them descended the stairs, Xiao Yan realized that Jia Lao was actually slowly following behind. He was currently smiling and conversing with a few elders of the association who were beside him.</p><br/><p>Xiao Yan smiled as he chatted with Fa Ma and Jia Lao before he suddenly sensed something and turned his head around. He saw a grey-robed young man was slowly walking in from the spot where he had come in from earlier.</p><br/><p>Following the entrance of the grey-robed young man, the originally noisy large hall immediately became quiet. Numerous gazes that contained all sorts of emotions paused on the former.</p><br/><p>“What this fellow said last night was indeed true. Today, he once again recovered his appearance.” Xiao Yan shook his head slightly as he watched the appearance of the grey-robed young man which was exactly the same as yesterday. Did that so called ‘Appearance Recovery Pill’ really have such a miraculous effect? Even a Dou Huang was unable to distinguish if it was real or fake.</p><br/><p>Fa Ma and Jia Lao eyed the grey-robed young man who had entered with cold eyes. They exchanged glances while smiling faintly. The smile contained some cold killing intent. As strong people who stood at the peak of the Jia Ma Empire, the triumphant action of Yan Li in front of them undoubtedly meant that the latter thought that his lifespan was too long. If it were not for the circumstances of it being unsuitable to strike, and their fear of a blow to the association’s reputation, it was likely that the three Dou Huangs would have instantly taken his life.</p><br/><p>The grey-robed young man, no, he should be called Yan Li, currently had a smile on his tender face. His gaze was unconcerned as it swept passed Fa Ma’s three man group. Finally, he swaggered over to the door that lead from the hall to the open ground. When he passed by Xiao Yan, his footsteps paused and he smiled before saying, “Among the three of you, only you have some ability. However, your good luck ends today. I will not hold anything back in this final round, ha ha!”</p><br/><p>As he eyed Yan Li, who had walked off with a loud laughter, Xiao Yan merely shrugged his shoulders calmly. The Little Princess pretty face became somewhat dark while Liu Ling’s became green. As the disciple of Pill-King Gu He, it was the first time he was looked down upon by someone to such an extent.</p><br/><p>“Forget it, don’t be angry. We will compete on the examination ground,” Xiao Yan slowly exhaled, roughly estimated the time before turning around and headed toward the open ground. Behind him, the Little Princess helplessly followed. Liu Ling, on the other hand, stood in the same spot, violently ground his teeth and cursed before leaving the hall.</p><br/><p>As he eyed the competitors leaving the hall in small groups, Jia Lao knit his eyebrows together. He softly said, “Looks like you have placed your hopes on Yan Xiao, no? However, can he win against that fellow Yan Li?”</p><br/><p>“Ah, I am unsure either. In any case, I have done all that I can do. What remains is for Yan Xiao to rely on himself.” Fa Ma shook his head and sighed, “Honestly speaking, he did not have too much confidence. Xiao Yan’s talent may be great, but he is at a disadvantage by being so young.</p><br/><p>Hearing this, Jia Lao could only helplessly nod his head. He did not inquire about what kind of help Fa Ma gave Xiao Yan. This was after all, an internal matter of someone else’s association.</p><br/><p>As the group slowly walked out of the passageway, a piercing sunlight suddenly shone upon them. Their field of view suddenly widen and ground shaking cheers also invaded their ears like the tide.</p><br/><p>Xiao Yan’s hands covered his eyes, blocking off the sunlight. He raised his head and eyed the extremely crowded audience seats and could not help but quietly feel somewhat shocked. He turned his head and smiled to the Little Princess standing by his side before walking toward his position in the middle of the open ground.</p><br/><p>When some sharp-eyed people in the audience seats saw that Xiao Yan appeared, a racket immediately occurred. Countless people began privately conversing among themselves.</p><br/><p>“Hey, look at the one who obtained the best result yesterday. He’s also very young.”</p><br/><p>“I heard that his name appears to be Yan Xiao, no? Looking at him, he should be just over twenty. How envious I am.”</p><br/><p>“In this examination, it appears that only he has the ability to contend with the grey-robed young man from the Chu Yun Empire. If he had not taken action yesterday, the one who would have had the best result may well have been the person from the Chu Yun Empire.”</p><br/><p>“Today’s the most crucial competition. Hopefully, he can beat that fellow from the Chu Yun Empire. Otherwise, the Alchemist Association will really lose face this time around.”</p><br/><p>“That’s right.”</p><br/><p>Ignoring the conversations that were transmitted from the audience seats, Xiao Yan quietly arrived at the position he held yesterday. After which, he sat cross-legged in the large rock chair behind the rock table. He appeared to be resting with his eyes closed, but in reality, he was repeatedly looking over the various refining methods and the areas where one need to pay special attention to when refining the ‘Three Lines Green Spirit Pill’ within his mind.</p><br/><p>As time slowly flowed by, more and more competitors flooded into the open ground. All the competitors who had entered the open ground acted similar to Xiao Yan as they sat down and adjusted their condition. Most of those who could persist until this point had quite a good ability. None of them wanted to dejectedly leave the competition ground in the final round because of a small, careless mistake.</p><br/><p>When the bright sun was high in the sky, the seats had all be filed with countless crowds.</p><br/><p>“Clang!” In an instant, a clear bell sound resonated through the open ground for a long time.</p><br/><p>The moment the bell sounded, Xiao Yan, who had his eyes tightly closed, opened them. He gently let out a turbid breath that had been lingering in his chest, stood up and raised his head to watch the spot in front of the VIP seats where Fa Ma was at.</p><br/><p>“*Cough*”</p><br/><p>On the high platform, Fa Ma emitted a soft cough as his light gaze swept through the entire place. A long while later, the noisy place slowly quieted down. An elderly, calm tone sounded beside everyone’s ears, “Ladies and gentlemen, today’s examination will be the most important round of our Grand Meeting. The final victor will be the champion of this season’s Grand Meeting. Therefore, do your best today with all the effort you have put forth!”</p><br/><p>“Roar, roar, roar!” When Fa Ma’s voice fell, the human crowd in the audience seats which had waited for a long time immediately let out an excited and unified loud roar. The deafening roar shot directly past the crowd.</p><br/><p>Xiao Yan rubbed his ears, which were shocked by the roar until they became numb. He turned his head around and eyed Yan Li, who was a short distance away. The corner of the latter’s mouth contained a cold smile. In a soft voice, he muttered, “It is finally about to begin. Next, prepare to fight desperately.”</p><br/>\n</div>"}