{"title": "Chapter 329: Night Discussion", "id": 329, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-329-night-discussion", "volume_title": "Volume 4", "body": "<h1>Chapter 329: Night Discussion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 329: Night Discussion</u></strong></p><br/><p>Within the room, Xiao Yan’s hands were placed protectively in front of his face. A long while later, Xiao Yan looked through the gap between his hands and eyed the black colored ring in front of him which was once again calm. Only then did he lower his arms. He inspected his body, which did not appear to have any deformation.</p><br/><p>Xiao Yan’s clothes, which appeared to have bulged out after receiving a blow from the spiritual ripple had already slowly lowered. After sensing that there was no feeling of discomfort being emitted from his body, Xiao Yan finally let out a slight sigh of relief. He lifted his head and eyed the black colored storage ring in front of him. However, he still did not see the figure of Yao Lao.</p><br/><p>“What exactly happened?” Xiao Yan frowned slightly and muttered uncertainly. He called out once again, but the dark black ring merely emitted a dark colored glow. It did not give any response, nor was there even the slightest spiritual movement. Instead, it was quiet like a pool of stagnant water.</p><br/><p>“Don’t tell me that it failed? But the spiritual ripple earlier was indeed teacher’s…” Xiao Yan’s face was a little lost and disappointed after waiting for a long time without witnessing any response. If Yao Lao had really woken up, it was likely that he would immediately reply to Xiao Yan in the latter’s heart. The current situation, however, seemed to only imply that Yao Lao’s spirit was still being limited by something. Therefore, he could not randomly converse with Xiao Yan just like he did in the past.</p><br/><p>Regardless of what the situation was, Xiao Yan could at least tell from the glow emitted by the black colored ring that Yao Lao’s condition was much better compared to when the latter fell into a slumber. From the looks of it, the ‘Seven Magical Green Spirit Saliva’ did have some effect.</p><br/><p>After staring at the ring that was suspended in front of him for a long time, Xiao Yan let out a long breath. He extended his hand and grabbed the ring and once again placed it on his finger. This time around, the ring did not display any resistance. The dark glow continued to remain bright for a while before it completely disappeared. The black ring became like how it looked in the past, appearing inconspicuous.</p><br/><p>As his finger slowly touched the black colored ring, which had returned to being calm, Xiao Yan also rubbed his forehead. A long while later, after a bitter laugh he softly muttered, “Teacher, rest assured that I will continue to look for ways to help you recover sooner…”</p><br/><p>Xiao Yan sighed once again. He was just about to adjust his breath and begin training when his gaze suddenly swept toward the window. A sharp wind sound that carried an icy air was rushing at him from that direction. As the window was forcefully pushed opened, Hai Bodong’s figure appeared within the room. The latter eyed Xiao Yan and was presently surprised as he asked, “Have you recovered?”</p><br/><p>Hearing this, Xiao Yan was at a loss. Immediately, he felt a little relief. The question was likely due to the terrifying spiritual ripple earlier. A strong person of the same class as Hai Bodong was extremely sensitive toward such a large spiritual movement.</p><br/><p>“I have obtained the ‘Seven Magical Green Spirit Saliva’ and have just swallowed it. My spiritual strength did indeed abruptly recover. Unfortunately, for some unknown reason, it once again became quiet after a while…” Xiao Yan shook his head and told a partial lie.</p><br/><p>“Uh?” Hai Bodong was shocked. A long while later, he gave a bitter smile and said, “Then you mean that you have still yet to recover? Don’t tell me that the ‘Seven Magical Green Spirit Saliva’ had no effect?”</p><br/><p>“I am also not too certain… but at the very least I can sense the Spiritual Strength that has not been recovered. Before, I completely did not have such a feeling. From the looks of it, the ‘Seven Magical Green Spirit Saliva’ did indeed have some effect.” Xiao Yan said somewhat helplessly, “It looks like I can only find some other methods to recover Spiritual Strength…”</p><br/><p>“Ah, to think that I was happy over nothing.” Hai Bodong shook his head with disappointment. He sat on the chair and said, “If you have recovered your strength, our safety factor when you go to the Misty Cloud Sect this time around would rise by a lot. If you haven’t, it will be extremely dangerous even with my protection. The Misty Cloud Sect has such a long tradition. The strength of those elders are all ridiculously strong. Moreover, there’s the joint attack Dou Techniques that the members of the Misty Cloud Sect are extremely good at. The superposition of their attacks is a sharp blade that even I have to avoid…”</p><br/><p>“Ke ke, with a Dou Huang like you around, it should not be possible for anyone to stop us from escaping even if we can’t beat them, no?” Xiao Yan joked.</p><br/><p>“Your thinking is really far too simple…” Hai Bodong shook his head. He was silent for a moment when he suddenly stared at Xiao Yan. In a low voice, he said, “Little fellow, in a day’s time, you will be going to the Misty Cloud Sect. I think that there are somethings that we should agree to beforehand.”</p><br/><p>As he eyed Hai Bodong’s face which had suddenly become very serious, Xiao Yan was a little startled. He immediately nodded his head quietly before saying, “Speak.”</p><br/><p>“Back then I have already said that I will try my best to ensure your safety. However, this is only on the precondition of not offending the Misty Cloud Sect. You should already know that my relationship with the Primer clan is quite deep. Therefore, any action of mine would implicate the Primer clan. Although they may appear to be a strength with quite a lot of weight as one of the three large clans in the Jia Ma Empire, you should know that there are other strengths in the Jia Ma Empire. If we are to talk about having a solid strength, the Misty Cloud Sect would take the top spot. These thousands and hundreds of years of tradition is something that even the Imperial family of the Jia Ma Empire cannot compare with. Of course, this is excluding the integrated strength. No matter how one puts it, the Jia Ma Empire’s Imperial family still rules over the entire empire… The strength that this ancient sect hides is also not as simple as what is on the surface…”</p><br/><p>“You should clearly understand that although the lifespan of a human on the Dou Qi continent is limited, if one manages to raise his class within his lifespan, one could extend it by a lot. The last sect leader of the Misty Cloud Sect, ‘Yun Shan’, already had the strength of an eight star Dou Huang when he handed over the sect leader position to Yun Yun. At that point in time, there was still quite a lot of time until the end of his life span. During these years, rarely anyone has heard from him. However, not hearing of him does not mean that he has already died…” Hai Bodong slowly said.</p><br/><p>“You mean that… the previous Misty Cloud Sect leader may still be alive?” Xiao Yan pressed his lips together and softly asked.</p><br/><p>“Although I cannot be certain, the chances of this being true are quite large. If he is still alive… I think that he should have already broke through the barrier of a Dou Huang and become a Dou Zong.” Hai Bodong sighed and said, “Therefore, if it is possible, try your best to avoid coming into too great a conflict with the Misty Cloud Sect. Otherwise, when that time comes, even if you, Fa Ma, and that old fellow Jia Xing Tian have some friendship, they would have to think of the big picture and would not offend the Misty Cloud Sect just because of you!”</p><br/><p>TL: Jia Xing Tian = Jia Lao</p><br/><p>Xiao Yan’s expression was calm, seemingly totally unaffected by the words of Hai Bodong. He had never bore such luxurious thoughts. He had only known Fa Ma and Jia Lao for less than half a month. It was too much wishful thinking if he wanted them to become enemies with the largest strength of the Jia Ma Empire just because of him.</p><br/><p>“If the Misty Cloud Sect and I really end up reaching the point where we become enemies, I think that Old Hai will also choose to withdraw, no?” Xiao Yan suddenly said in a soft voice. He clearly understood that he and Hai Bodong only had a business relationship. If it were not because of the ‘Spiritual Recovery Purple Pill’, it was likely that the two of them would have gone their separate ways.</p><br/><p>Hai Bodong was quiet. He raised his eyes and stared at the calm expression of the young man. A long while later, he said, “As long as Yun Tian doesn’t appear…” The meaning behind his words was very clear. If the previous Misty Cloud Sect Leader was to appear, he could only think of the Primer clan and cease interfering with the issue between Xiao Yan and the Misty Cloud Sect.</p><br/><p>“Ah, little fellow. You are still young. With your talent, your potential in the future will be limitless. Before you have become a truly strong person, you need to endure. Having too sharp an edge is not beneficial to you. It would not be too late to fight with the Misty Cloud Sect once you can freely control the large strength within your body.” Hai Bodong patted Xiao Yan’s shoulders and said in a serious and concerned manner.</p><br/><p>Xiao Yan quietly nodded. If he excluded Teacher’s strength, he would merely be at the Dou Shi class. In the Misty Cloud Sect where the strong were all over the place, one could find many of similar levels to him by just randomly grabbing around. He was still young. This was his greatest asset.</p><br/><p>“Ke ke, alright. I have said all this because I want to remind you at this last moment to be as careful as possible when you arrive at the Misty Cloud Sect.” Hai Bodong smiled and stood up. He continued smiling as he spoke to Xiao Yan, “It is already quite late. You should rest. Have a break tomorrow and then go to the Misty Cloud Sect!”</p><br/><p>Xiao Yan nodded his head slightly as his gaze followed Hai Bodong out of the room. A long while later, he let out a long breath. These words of Hai Bodong had caused him to be much more awake. Although it appeared that Fa Ma and Jia Lao, these strong people among the peak of the empire, were extremely friendly to him, all of these were mostly built upon not knowing Xiao Yan’s background and the mysterious Teacher that did not exist behind him. In the face of a major event, like Xiao Yan’s conflict with the Misty Cloud Sect, which could pull them into a whirlpool, they would definitely not become enemies with the Misty Cloud Sect because of Xiao Yan.</p><br/><p>Reality was always cruel.</p><br/><p>Xiao Yan lay down on the soft bed. His hands supported the back of his head as he stared at the bed curtain above him. He slowly closed his eyes, only to suddenly open them a while later. However, there was no longer the slightest fear of the large being within his dark black eyes. One could say it was the fearlessness of the young or that he was overly arrogant, but he had already said before that he would not choose to give up going to the Misty Cloud Sect for any reason. Forget about the Misty Cloud Sect potentially having a Dou Zong. Even if they had a Dou Sheng, he would definitely appear as he had promised!</p><br/><p>“If people don’t offend me, I will not offend them…” Xiao Yan tightly pursed his lips into a thin line. He was stubborn because he was delicate. If the Misty Cloud Sect really intended to bully him with their strength, Xiao Yan could only use reality to tell them that he was not some mud that they could knead…</p><br/><p>“Regardless of what happens, I must be victorious in the Three Year Agreement! This is because I need it to prove that my three years of tough training was worth it! If I fail, my three years of training will have gone down the drain and become utterly worthless!” Xiao Yan tightened his fist. He deeply inhaled, straightened his back and leaped up. He then sat cross-legged on the bed.</p><br/><p>“Nalan Yanran, just you wait!”</p><br/><p>Xiao Yan muttered softly in his heart. His hands displayed the training seal and his body trembled slightly. After which, Xiao Yan calmed his emotions and swiftly entered into his training mode.</p><br/><p>Since Yao Lao did not appear as he had pictured, Xiao Yan had decided that he would adjust his condition to the peak tonight. Tomorrow, he would consume the ‘Three-Line Green Spirit Pill’ and break through the Dou Shi barrier, striding into the Da Dou Shi class!</p><br/><p>This time around, he definitely couldn’t fail!</p><br/>\n</div>"}