{"title": "Chapter 323: The Final Victor", "id": 323, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-323-the-final-victor", "volume_title": "Volume 4", "body": "<h1>Chapter 323: The Final Victor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 323: The Final Victor</u></strong></p><br/><p>The huge open ground was entirely quiet. A long while later, waves of regretful sighs sounded from the audience seats on both sides.</p><br/><p>“Ah.” The Little Princess gently patted the dust that had shot over onto her sleeves. She raised her head, eyed the white colored fog permeating from the spot Xiao Yan stood and shook her head with a soft sigh. No one had expected that the biggest dark horse of the Grand Meeting this season, who could contend with that mysterious young man, would actually end up failing for such a ridiculous reason.</p><br/><p>“This time around, the reputation of the association will really suffer a big loss.”</p><br/><p>“Ha ha, Chairman Fa Ma, since Yan Xiao has already failed, please announce the final result for the Grand Meeting!” After Yan Li laughed wildly for a good while, he finally suppressed the unrestrained joy in his heart, He lifted his head and laughed as he watched Fa Ma and the others in front of the VIP seats.</p><br/><p>“What should we do?” Hai Bodong frowned slightly. A faint dark and cold killing intent appeared and disappeared on his face. He stared at Yan Li below in a deep manner as he softly asked.</p><br/><p>“What else can we do? Don’t tell me that we can kill him in front of everyone?” Fa Ma’s expression was similarly ugly. However, the current him did not have any other choice.</p><br/><p>“If I knew that this would happen, the old me would have done it last night…” Jia Lao cut with his hand as he coldly said.</p><br/><p>“Ah, it would also be troublesome killing him. That fellow has seized our weakness of not being able to expose his identity.” Fa Ma shook his head and sighed. He smiled bitterly and said, “Looks like we can only let him become the champion. It is impossible for the association to retain him forcefully because of some non-existing reason in front of so many people’s eyes.”</p><br/><p>Hearing this, Hai Bodong’s and Jia Lao’s eyebrows knit together into deep frowns. They exchanged glances, but did not have the slightest solution. Immediately, they could only gloomily nod their heads.</p><br/><p>Fa Ma slowly walked forward. His gaze swept through the open ground. The helplessness in his voice was something that anyone could clearly hear.</p><br/><p>“According to the rules of the Grand Meeting, whoever managed to refine a medicinal pill which is the most useful and of the highest tier would become the final victor. Although Little Princess and Liu Ling both refined tier four medicinal pills, the grade and usefulness of those pills are all inferior to the ‘Purple Heart Barrier Breaking Pill’ that Yan Li had refined. Therefore…”</p><br/><p>The air above the huge open ground was entirely silent. Only the helpless voice of Fa Ma’s slowly resounded.</p><br/><p>“Therefore, the victor for this season’s Jia Ma Empire's Alchemist Grand Meeting…”</p><br/><p>With both his hands crossed in front of his chest, Yan Li smiled as he watched the gloomy faces of Fa Ma’s three man group and stretched his lazy waist. The current him could almost imagine how sought after he would be once he returned to the Chu Yun Empire. When that time comes, there would no longer be anyone who would be able to fight with him for the position of the chairman of the association.</p><br/><p>“The victor is Yan…” Fa Ma slowly closed his eyes. He finally ground his teeth and uttered the last few words.</p><br/><p>“Wait!”</p><br/><p>A sudden cry abruptly sounded on the open ground, interrupting the words that Fa Ma was about to say.</p><br/><p>Countless gazes moved toward the direction of the voice. Finally, all of them locked onto the stone table which had been wrapped in a white colored cold air. The earlier cry was emitted from that place.</p><br/><p>Not long after the voice sounded, the white colored fog that had covered the surroundings of the stone table slowly became faint. A long while later, the white colored fog had already become so faint that it could no longer conceal the things within it from other’s sight. The scene within the interior also appeared in everyone’s eyes.</p><br/><p>There were already quite a number of crack lines that had appeared on the hard green stone table due to the earlier explosion of the medicinal cauldron. The area above the stone table was also a complete mess. As the gazes shifted slightly toward the front of the stone table, there was a young man whose clothes were in pieces. His right hand was supporting himself on the stone table as he panted, releasing coarse air. On the surface of his body, there were faint blood traces which were likely caused by the fragments that had shot out from the sudden explosion of the cauldron earlier.</p><br/><p>Seeming to have sensed the final thread of cold air disappearing, the young man lifted his somewhat pale ordinary face and spoke with a hoarse voice to Fa Ma on the high platform, “There should be around ten plus minutes until the end of the competition, right?”</p><br/><p>“There are fourteen minutes!” Fa Ma nodded and replied as he eyed the extremely weak Xiao Yan.</p><br/><p>“Yan Xiao, even your medicinal cauldron has exploded. What can you do even if you still have ten plus minutes remaining? Don’t tell me that you are going to find a new medicinal cauldron now and start refining from scratch? Ha ha! I advise you to just admit defeat. This wishy washy manner is not how a man should act.” Seeing Xiao Yan appearing once again, Yan Li could not resist mocking.</p><br/><p>“Having the ability to fight yet choosing to shrink back is what a man should not do.” Xiao Yan smiled faintly. He tilted his head a little and coldly laughed with a ridicule contained in the corner of his mouth, “Moreover, who told you that I need to refine from scratch again?”</p><br/><p>“What do you mean?” The smile on Yan Li’s face gradually withdrew. He eyed the mysterious manner of Xiao Yan and shouted a little uneasily.</p><br/><p>Xiao Yan did not reply to Yan Li’s loud demand. Under the tens of thousands of gazes around the open ground, he slowly lifted his right hand. His palm was slightly curled and a suction force abruptly surged violently toward the sky.</p><br/><p>The tens of thousands of gazes followed the direction of Xiao Yan’s palm and slowly moved upward. Finally, they were all stunned as they paused on a flower of white colored flame floating in the sky.</p><br/><p>Since the color of the flame was similar to that of the clouds, it was hard to discover that it was a cluster of burning white colored flame unless one made a careful observation.</p><br/><p>This cluster of white colored flame was a cluster of ‘Bone Chilling Flame’ that Xiao Yan had skillfully used to wrap around the ‘Three-Line Green Spirit Pill’ and sent it flying into the air with a slap on the bottom of the medicinal cauldron just before the medicinal cauldron blew up. Through this method, he allowed the medicinal pill to avoid the impact from the exploding medicinal cauldron.</p><br/><p>In that pressing final second, he was actually able to be unruffled in the face of imminent danger and think of this method to head off a disaster. This was something that caused Xiao Yan to even feel some admiration for himself. The seemingly reckless slap actually managed to reverse the crucial situation of the entire Grand Meeting.</p><br/><p>“This is?” Fa Ma eyed the cluster of white colored flame in the sky, feeling stunned. He could faintly sense that the area surrounding the flame contained an icy cold air. Of course, the most important thing was that in the middle of the flame, there was actually a green colored medicinal pill that was partially concealed.</p><br/><p>“Haha, looks like it is really a little too early to be discussing defeat. A miracle will always occur at the very last moment. Additionally, such a thing is never lacking on this fellow.” Hai Bodong sighed in relief within his heart as he watched the cluster of white colored flame. He just knew that Yan Li’s ability seemed to be a little lacking if he wanted to defeat that little monster.</p><br/><p>“What a little fellow. I have indeed underestimated him! However, why does he have to create so many twists and turns every time he participates in a competition?” Jia Lao clapped his hands and smiled as he praised.</p><br/><p>Fa Ma also shared the same feeling as he nodded. If one did not have a strong mental strength when watching this fellow compete, one would likely really be toyed with until one was dead. With just this one competition, the hearts of an unknown number of people were lifted only to be let down and then lifted once again.</p><br/><p>“What a terrifying fellow. At that very last moment, he could actually think of such a method to preserve the entire medicinal pill. Ah, it is impossible to not admire him!” Nalan Jie fondled his beard and was full of praises.</p><br/><p>Nalan Yanran’s chest gently rose and fell. She let out a long stuffy breath of air that had been suppressed within her chest and nodded slightly. Immediately, her white hand wiped off the cold sweat on her forehead without leaving a trace. She did not expect that the competition which had reached a foregone conclusion currently begun making such a huge reversal.</p><br/><p>“What is that thing?” Yan Li’s expression was dark as he watched the white colored flame in the sky. Compared to before, an even greater uneasiness shrouded Yan Li’s heart.</p><br/><p>Within the open ground, the white colored flame in the air began to swiftly descend under the suction force that Xiao Yan had emitted. Following its descent, the white colored flame on its surface began to swiftly disappear. The green colored medicinal pill within it also became increasingly obvious.</p><br/><p>When the medicinal pill was merely half a meter from Xiao Yan’s palm, the flame finally completely disappeared. A green colored round medicinal pill accurately landed in it.</p><br/><p>Xiao Yan pulled his hand back. Lowering his head, Xiao Yan looked at the green colored medicinal pill in his palm which he had undergone numerous twists and turns in order to successfully refine it. Finally, he could not resist raising his head and inhale the somewhat icy air.</p><br/><p>The medicinal pill was entirely green and was around the size of a dragon’s eye. On the surface of the round pill, there were three lines, one green, one purple, and one white, which were arranged in an extremely orderly manner. As Xiao Yan held the medicinal pill, he could even sense the surging energy contained within it.</p><br/><p>“I have finally succeeded.” A relieved smile surfaced on Xiao Yan’s pale face. Ever since he learned the skill to refine medicine, this was the first time that Xiao Yan had expended such a large amount of Spiritual Strength to refine a medicinal pill.</p><br/><p>“Has he succeeded? What tier is it?” Seeing the smile on Xiao Yan’s face, the Little Princess and the others nearby could not resist opening their mouths and asking. Due to the cold air, this ‘Three-Line Green Spirit Pill’ did not even release any pill fragrance when it was frozen by the icy cold air. Therefore, Little Princess and the others did not know the exact information of the medicinal pill that Xiao Yan had refined. Of course, even without the pill fragrance being emitted, they were not foolish enough to think that it was some kind of low tier medicinal pill.</p><br/><p>Xiao Yan laughed softly. His gaze swept over the dark faced Yan Li, who was a little restless and uneasy. He lifted the green colored medicinal pill high in the air, glanced Fa Ma and the others on the high platform while his clear voice resounded on the entire open ground.</p><br/><p>“Tier four medicinal pill, ‘Three-Line Green Spirit Pill’!”</p><br/><p>“Ha ha, good!”</p><br/><p>Eyeing the young man below who had raised the medicinal pill with his hand while he cried out in a clear voice, Fa Ma could no longer resist the excitement in his heart and laughed out loud in a gratified manner.</p><br/><p>“Three… Three-Line Green Spirit Pill?”</p><br/><p>The voice that was carried to Yan Li’s ear was like thunder that suddenly exploded within his heart. His ears were buzzing. The originally proud expression on his face had instantly become pale. His gaze lacked life as he stared at the green colored medicinal pill in Xiao Yan’s palm. With weakened legs, he finally landed on his backside as he sat on the ground.</p><br/><p>Even though the ‘Purple Heart Barrier Breaking Pill’ was extremely strong, Yan Li clearly knew that a ‘Three Line Green Spirit Pill’ with Three Pill Lines was much higher tier!</p><br/><p>The champion spot which was about to become his had once again transferred to someone else in less than five minutes.</p><br/><p>This was a miracle.</p><br/><p>A miracle created by a young man who was not even twenty.</p><br/>\n</div>"}