{"title": "Chapter 355: Separation and Transaction", "id": 355, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-355-separation-and-transaction", "volume_title": "Volume 4", "body": "<h1>Chapter 355: Separation and Transaction</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 355: Separation and Transaction</u></strong></p><br/><p>On a small path which was lush with greenery, two human figures, a man and a woman, with one in front of the other, slowly walked. The quiet atmosphere shrouded the both of them.</p><br/><p>In the sky above the two people’s heads, two figures were also following far behind.</p><br/><p>At a certain moment, the woman, who was ahead of the others, stopped walking. Her delicate hand gently twirled the black hair in front of her forehead. With a cool voice, she spat some words from her alluring red lips, “The two of you above. Aren’t you tired of flying?”</p><br/><p>Although her voice was not very loud, the two human figures in the sky stopped simultaneously a moment later. They exchanged glances and could only slowly land in a huge tree behind Xiao Yan.</p><br/><p>“Old Hai, what is your intention now? Until now, I have yet to gather all of the medicinal ingredients needed for the ‘Spiritual Recovery Purple Pill’ of yours.” Xiao Yan carefully took a step back. His head turned toward Hai Bodong as he spoke.</p><br/><p>Hai Bodong was startled upon hearing this. He frowned slightly as his gaze, which contained some fear, swept over Queen Medusa who was leaning on a tree trunk, casually playing with a fallen leaf. He mused for a while and smiled bitterly, “Little fellow, since you have successfully left the Misty Cloud Sect, it is likely that you don’t need me to continue protecting you from now on. As for the ‘Spiritual Recovery Purple Pill,’ if you are able to gather the necessary ingredients in the future, you can help me refine it and then find a person you trust to hand it over to me. Henceforth, I will likely continue to be in the capital.”</p><br/><p>Xiao Yan pursed up his lips and nodded in silence. He solemnly bowed toward Hai Bodong in the tree and said in a deep voice, “Old Hai, regardless of what happens, I, Xiao Yan will remember the help that you have given me today. In the future, if Old Hai has any matters that are difficult to solve or needs to gather people, the little me will use all my strength to help you if it is within my capability!”</p><br/><p>“Ke ke, alright. Since it is like this, then let us part ways here. If you need any help in the future, you can directly come to the Primer clan in the capital.” Hai Bodong smiled, nodded his head as he replied.</p><br/><p>“Yes.”</p><br/><p>“Remember, little fellow, I may not know what your relationship with Queen Medusa is, but regardless of what happens, you should take a more cautious approach when dealing with her. The viciousness of this woman is far beyond your expectations.” The corner of Hai Bodong’s eyes once again glanced over at Queen Medusa in front of them. His mouth moved slightly and a voice which was so soft that one could not hear was wrapped by Dou Qi and quietly transmitted into Xiao Yan’s ear.</p><br/><p>Xiao Yan nodded without anyone noticing.</p><br/><p>“Goodbye, little fellow!” Hai Bodong once again cupped his hands toward Xiao Yan. He then glanced at Ling Ying beside him and also gave him a friendly smile. After which, he flapped the wings on his back and suddenly shot into the sky, disappearing in the blue sky.</p><br/><p>“This old sir.” Once he had sent Hai Bodong off with his eyes, Xiao Yan once again threw his gaze toward the smiling Ling Ying and said respectfully.</p><br/><p>“Ke ke, according to my orders, my mission was completed once you left the Misty Cloud Sect. Therefore, I should also return.” Ling Ying smiled and raised a thumb toward Xiao Yan. “Little fellow, this time around, you have done well. You have courage.”</p><br/><p>“Old Sir has given me too much praise. The little me is only emboldened because there are the few of you supporting me. Otherwise, no matter how brave I am, I would not dare to act presumptuously at the Misty Cloud Sect.” Xiao Yan smiled and said.</p><br/><p>Ling Xiao had a good laugh as he replied, “Little fellow, your character is the kind that I like. However, I have other missions to complete and cannot continue to stay any longer. I will bid you goodbye here. If we meet again in the future, the old me will invite you to drink with me to our heart's content.”</p><br/><p>“Thank you very much.” Xiao Yan watched Ling Ying slowly rising and nodded with a smile.</p><br/><p>“Additionally, on account of us having similar character, I will leave some words for you.” Ying Ling’s pair of wings came to an abrupt stop. He looked directly at Xiao Yan and said in a serious manner, “The Dou Qi continent is very big. You must hurry up and make yourself stronger. Otherwise, you will not even have the right to choose the person whom you love!”</p><br/><p>“Alright, that is all I have to say. Look out for yourself. You will know the meaning of these words of mine in the future.” Ling Ying waved his hand while his body swiftly rose into the sky. Accompanied by the sound of rushing wind, his body turned into a blurry black shadow which swiftly disappeared over the horizon.</p><br/><p>“Ah, everyone has left.”</p><br/><p>Xiao Yan stood in the spot and let out a soft sigh. He immediately frowned a little as he watched Ying Ling who had disappeared into the horizon, feeling a little unsure about the words the other party had left behind.</p><br/><p>“Alright, you should have finished saying your goodbyes, no?” While Xiao Yan was staring stupidly into space, a faint numbing voice pulled him back from his absent mindedness.</p><br/><p>Xiao Yan turned his body around and watched Queen Medusa, who was using her pair of bewitchingly beautiful eyes to stare at him. He pulled at the corner of his mouth and revealed a somewhat ugly smile as he said awkwardly, “That… your majesty, why have you not transformed back?”</p><br/><p>“Transformed back?” Queen Medusa raised her eyebrows as she stared at Xiao Yan in a half smiling manner. “Who says that I am going to transform back?”</p><br/><p>“Don’t tell me that you have completely assimilated with the spirit of the ‘Heaven Swallowing Python’?” Xiao Yan’s expression changed slightly. The fists in his sleeves abruptly tightened.</p><br/><p>Queen Medusa faintly glanced at Xiao Yan. The tiny change of his body could not escape her. She straightened her body and stretched her lazy wrist. Her alluring curves were extremely eye-piercing. However, the current Xiao Yan did not dare to leave his gaze on those spots in a presumptuous manner. As long as he made the slightest inappropriate move in front of this person who was feared by even a strong person like Yun Shan, the other party could instantly take his life.</p><br/><p>“As the price of rescuing you, that little fellow will not be able to appear for three days.” A faint smile was present on Queen Medusa’s lips. Clearly, she was extremely satisfied with their exchange this time around.</p><br/><p>“Oh.” Xiao Yan sighed in relief within his heart. He rolled his eyes and smiled as he said, “In that case, is Queen Medusa planning to use a human shape to follow me around during these three days?”</p><br/><p>“Don’t think any funny thoughts. That will cause you to lose your life.” Queen Medusa moved her feet, carrying a unique fragrant wind that caused a fire to rise within people’s belly. She arrived in front of Xiao Yan. That smiling manner of hers, however, caused Xiao Yan’s entire body to stiffen.</p><br/><p>Her snow white hand suddenly extended in front of Xiao Yan. That fair, tender, delicate smooth small hand gave people an impulse to bite at it.</p><br/><p>“Give that thing to me.” Queen Medusa said in a gentle and soft manner.</p><br/><p>“What thing?” Xiao Yan’s face was at a lost regarding this.</p><br/><p>“The medicinal formula for the ‘Thawing Spirit Pill’.” Queen Medusa slowly and leisurely relieved Xiao Yan of his ignorance.</p><br/><p>“Uh.” The corner of Xiao Yan’s mouth twitched. Xiao Yan immediately smiled bitterly and sighed. His hand gently tapped on his storage ring and the medicinal formula for the ‘Thawing Spirit Pill’ which he had spent a tremendous amount of effort to obtain was easily handed over to the other party’s hand in this manner.</p><br/><p>Queen Medusa delicate hand held the medicinal formula for the ‘Thawing Spirit Pill’. For the first time, an emotion that suggested she could no longer wait appeared on that bewitching face of Queen Medusa. Her hands pulled open the medicinal formula and her beautiful eyes read in detail the effect of the ‘Thawing Spirit Pill’ which had been recorded on it. A long while later, she exhaled a long breath of air. She folded the medicinal formula, waved her delicate finger and the medicinal formula began to agily rotate above her hand.</p><br/><p>Xiao Yan muttered in his heart as he watched Queen Medusa who had descended into silence. He too, could only remain quiet.</p><br/><p>“Pa!” The rotating medicinal scroll suddenly hit softly in her hand. Queen Medusa lifted that pair of bewitching pretty eyes, which caused people to involuntarily be obsessed with them. She stared at Xiao Yan and waved the medicinal formula in her hand at him. She asked, “You should have already seen it, right?”</p><br/><p>“Yes.” Xiao Yan honestly nodded.</p><br/><p>“Can you refine it?” Queen Medusa softly asked. At this moment, Xiao Yan could sense that the former’s breathing had quietly hastened.</p><br/><p>“I am only an alchemist who is not even at the fourth tier. This ‘Thawing Spirit Pill’ is a tier six medicinal pill.” Xiao Yan smiled bitterly and spread his hands out. Before his words fell, however, he was interrupted by a cold laughter from the opposite side.</p><br/><p>“Although my spirit has been suppressed by the ‘Heaven Swallowing Python’, I am vaguely aware of some of the matters regarding you. Back then, wasn’t the medicinal pill you gave Hai Bodong to break the seal which I had placed also of the sixth tier? I may not be sure why at times your strength is not in tune with before, I clearly know that you can refine a tier six medicinal pill!”</p><br/><p>“If you are able to refine a tier six medicinal pill, you have the qualifications to speak with me. If you really cannot, I don’t mind… at this spot.” Queen Medusa’s hand gently cut across Xiao Yan’s neck. The latter immediately felt his neck turn cold and he hurriedly touched it. He was shocked to realize that drops of fresh red blood had actually appeared on his neck.</p><br/><p>“What Old Hai said is true. This woman is really vicious.” Xiao Yan swallowed a mouthful of saliva as he quietly cursed in his heart. After musing for a moment, he no longer continued to conceal the information. He looked directly at Queen Medusa. “Alright, I can help you refine the ‘Thawing Spirit Pill’. But what benefits can I get?”</p><br/><p>“Benefits? I can forget about the matter of you offending me earlier.” Queen Medusa said faintly.</p><br/><p>“Chi, in that case, you can find someone else to refine it. I am not interested.” The corner of Xiao Yan’s mouth curled upon hearing this as he coldly laughed.</p><br/><p>Queen Medusa’s beautiful eyes narrowed slightly. An ice cold killing intent slowly shrouded her. A seven-colored energy had suddenly surged out of her delicate hand like waves of water. She watched the seven-colored water-like waves and softly asked with a smile, “Do you have the qualification to discuss terms with me?”</p><br/><p>“If you were to really kill me, I’m afraid that the ‘Heaven Swallowing Python’s’ spirit will also instantly launch a counterattack, no?” Xiao Yan took a step back. A green-colored flame quietly appeared on his hand that was covered within his sleeves.</p><br/><p>The killing intent that shrouded Queen Medusa suddenly became sluggish. She furrowed her eyebrows slightly and said, “You are indeed quite intelligent to actually know how to rely on your relationship with the ‘Heaven Swallowing Python’ to suppress me.”</p><br/><p>Seeing this, Xiao Yan sighed in relief. From the looks of things, it appeared that the ‘Heaven Swallowing Python’ still had some use in suppressing Queen Medusa.</p><br/><p>“I am not someone who would extort an extravagant sum from others. However, your majesty’s attempt to harness a white wolf with your bare hands isn’t very kind. Refining a tier six medicinal pill is an extremely troublesome and tiring thing. Yet, you want me to go all out to refine it with just a casual mention from you. Where can you find such a good thing in this world? Don’t you agree, Queen Medusa?” Xiao Yan appeared somewhat helpless as he spoke.</p><br/><p>TL: harness a white wolf with your bare hands - to force someone to do something without the appropriate reward</p><br/><p>“Stop giving me this glib-tongue of yours. Just tell me your conditions.” Queen Medusa said faintly.</p><br/><p>“Now that Hai Bodong and that Ling Ying old sir have left, I suddenly no longer feel safe.” Xiao Yan rubbed his head and laughed awkwardly, “As long as Queen Medusa is willing to promise to protect the little me for three years, I will help you refine the ‘Thawing Spirit Pill ‘ no matter what.”</p><br/><p>“Tsk tsk, protecting you for three years?” A smile immediately surfaced on Queen Medusa’s bewitching pretty face. Her hand was gently placed on Xiao Yan’s shoulders. That smile of hers was extremely moving. “In which case, isn’t it better to simply take the risk of being suppressed by the ‘Heaven Swallowing Python’ and kill you now?”</p><br/><p>“In other words, there is nothing to discuss then?” Xiao Yan pulled his shoulders back and widened his hand.</p><br/><p>“Alright, you can forget about those unrealistic thoughts. I am not as stupid as Hai Bodong. I will give you one year’s time. In this one year’s time, I will not be your fighter. I will only come out and help you get rid of the trouble only when you are in a situation where you are about to die. During other times, I might take action if my mood is good. Of course, if you are unable to take out the ‘Thawing Spirit Pill ‘ in this one year’s time, don’t blame me for being ruthless. These are my conditions. Do you agree or not?” Queen Medusa said in a somewhat impatient manner.</p><br/><p>Xiao Yan frowned slightly. He finally raised his head a long while later to look at the pretty face of Queen Medusa which already contained a little ice cold killing intent. He could only nod his head unwillingly.</p><br/><p>“Alright.”</p><br/><p>Hearing this, the killing intent on Queen Medusa’s pretty face immediately changed into an enchanting, gentle smile.</p><br/>\n</div>"}