{"title": "Chapter 356: The Journey Back Home", "id": 356, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-356-the-journey-back-home", "volume_title": "Volume 4", "body": "<h1>Chapter 356: The Journey Back Home</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 356: The Journey Back Home</u></strong></p><br/><p>As Xiao Yan eyed Queen Medusa who had withdrawn her killing intent in only an instant, he could only laugh bitterly. This woman indeed did not simply rely on her reputation to cause so many strong people within the Jia Ma Empire to greatly fear her.</p><br/><p>“Where do you plan to go next?” Queen Medusa returned the ‘Thawing Spirit Pill Formula’ to Xiao Yan and randomly asked.</p><br/><p>Xiao Yan carefully received the medicinal formula. He mused for a moment before saying: “I think I will make a trip back to Wu Tan City first. After which, I might have to leave the Jia Ma Empire for a period of time.”</p><br/><p>“Leaving the Jia Ma Empire, huh.” Queen Medusa frowned slightly upon hearing this before immediately nodding slightly. She lazily said “Up to you. In any case, those few leaders within the Snake-People race can temporarily take over in my absence. Until you refine the ‘Thawing Spirit Pill’ I will continue to follow you.”</p><br/><p>Xiao Yan sighed in relief upon seeing that she did not oppose his plan. His hand gently patted the huge black ruler on his back and smiled as he said, “Since it is like this, let us go.”</p><br/><p>“The matter with the Misty Cloud Sect is already over. The current you should not be in a hurry for some time, no? When we pass by some huge cities during this trip back to Wu Tan City, help me look for the medicinal ingredients needed to refine the ‘Thawing Spirit Pill’.” Queen Medusa said faintly. Her words indicated that she was discussing the manner, yet her tone did not allow Xiao Yan to object to the suggestion.</p><br/><p>With regards to this, Xiao Yan could only helplessly nod his head. His eyes glanced at that enchanting, bewitching face of Queen Medusa before shrugging his shoulders and saying, “I suggest for you to cover your face when you enter the city. Otherwise, there will be some unnecessary trouble that will cause quite the headache.”</p><br/><p>Queen Medusa nodded her head slightly. She turned around and slowly walked along a small path within a dense forest.</p><br/><p>Xiao Yan shrugged as he eyed the curvy and attractive figure. He turned his head and his gaze shifted toward the edge of his vision, where the green-colored rock stairs were partially visible. His gaze slowly moved upward and finally stopped at the mountain peak which was shrouded by fog. After being silent for a moment, he let out a gentle sigh. This agreement which had shackled him for three years was finally completed. As the three year target which had caused him to put in effort and struggle faded away, his heart suddenly felt somewhat empty. However, this loss did not last for very long. A young lady’s elegant smile suddenly appeared in his mind caused a warm smile to appear on his face.</p><br/><p>“Xun Er, are you living well there? Wait for me.” Xiao Yan softly muttered. A cluster of heat rose in his heart as he thought of the young lady whom he had not seen for nearly two years.</p><br/><p>Xiao Yan turned around. His gaze glanced at the moving figure which had already walked out of the dense forest. With a smile, he hurriedly chased after her.</p><br/><p>Xiao Yan did not return to the capital after leaving the Misty Cloud Mountain. Instead, he and Queen Medusa changed their direction and flew toward Wu Tan City.</p><br/><p>The distance between the capital and Wu Tan City was almost half an empire away. Even with Xiao Yan’s and Queen Medusa’s flying speed, to cover this huge distance would require at least two to three days. Moreover, due to Queen Medusa’s request, Xiao Yan had to stop whenever they passed by bigger cities and wait for the auction houses and trade fairs to open. As a result of all this, the time they took for their journey was greatly increased. It was fortunate that the Three Year Agreement was currently over, and that Xiao Yan had already escaped the kind of life in the past where he had to squeeze out all the time he had. Along the way, he did not have any constraint or burden in his heart. He swayed leisurely, appearing very relaxed. This was the first time that he had truly enjoyed such a laid back life after the start of the Three Year Agreement.</p><br/><p>During the three days that he was hurrying home, the two of them may have lingered about some large cities for some time, but Queen Medusa was somewhat disappointed that they did not even find one of the unique medicinal ingredients that were needed to refine the ‘Thawing Spirit Pill’. She was also helpless with regards to this. After all, if it were so easy to find the ingredients needed to refine a tier six medicinal pill, its value would also not be so expensive.</p><br/><p>The two of them walked and stopped along the way, like a walking horse observing the flowers. However, Xiao Yan was somewhat surprised that Queen Medusa still did not transform back into the shape of the ‘Heaven Swallowing Python’ despite the three days, that she mentioned, being over. With regards to this, she explained that she had privately discussed with the spirit of the ‘Heaven Swallowing Python’ and thus delayed the time that she was to transform back.</p><br/><p>Xiao Yan may have felt somewhat astonished at this explanation, but he did not have any other choice. If she did not transform back, did he have the ability to force her to do so? When that time came, a slap would come swinging over. Vomiting blood and being seriously injured would be a small matter by then.</p><br/><p>As time quietly passed, Xiao Yan and Queen Medusa came increasingly closer to Wu Tan City’s territory. Due to them being delayed by searching for medicinal ingredients, almost five days had been used for what was originally a mere two to three day journey.</p><br/><p>Hei Yan City, a huge city in the northern province of the Jia Ma Empire. From here, it was not far from Wu Tan City. With Xiao Yan’s and Queen Medusa’s speed, they should be able to reach it within half a day. Since this city was famous for medicinal ingredients in the northern region, however, Queen Medusa swiftly landed without seeking Xiao Yan’s opinion. At the city’s outskirt, she used a thin green yarn to cover her face before she grandly walked toward Hei Yan City. Behind her, Xiao Yan could only, in a resigned manner, resist his desire to return home, and helplessly followed behind her.</p><br/><p>The two of them strolled into the city. During that time, no one came to stop them. Although the eyes of the soldiers guarding the city involuntarily and repeatedly swept over Queen Medusa’s mature and beautiful body, that high and noble aura of hers caused those soldiers, who were ready to create trouble, to not even think about stepping forward to interrogate them.</p><br/><p>After entering the city, Xiao Yan led the way and walked a distance along the street. After which, he entered a restaurant where there was quite a large amount of human traffic. The people of the northern part of the empire were sturdy folks, therefore it was only possible to commonly see such a restaurant in the northern region of the empire. It was not common to see them in luxurious places like the capital.</p><br/><p>People from all trades gathered at such a restaurant. A lot of the news and information among the common people in the empire were spread from such places. Therefore, it could swiftly inform Xiao Yan where the best and widest variety of medicinal ingredients were located within the city.</p><br/><p>The two of them walked into the restaurant and sat at a table beside the window. Queen Medusa supported her cheek with her hand as her pretty eyes stared out of the window. Her expression was that of disregard and indifferentness. During these few days, all the matters regarding getting information were entirely handled by Xiao Yan.</p><br/><p>Seeing this manner of hers, Xiao Yan could only helplessly shake his head. He waved his hand and called a female servant over. After ordering some wine, which was not very potent, he stood up and headed toward some spots which were crowded with people. After doing this again and again for a long time, Xiao Yan finally withdrew back to the table with a face covered in perspiration. He eyed Queen Medusa who was comfortably sipping the wine and could not resist sighing dispiritedly. Was this woman not a little too arrogant.</p><br/><p>“How was it? Have you asked clearly?” Queen Medusa’s pretty eyes glanced at Xiao Yan as she softly asked.</p><br/><p>“It is said that there is a herb hall with great fame in this city. There are some stocks for many rare medicinal ingredients there. It is just that the price for them is extremely expensive.” Xiao Yan lifted his wine cup and poured it into his mouth before growling.</p><br/><p>“Take a rest. After this, we will go to that herb hall to take a look.” Queen Medusa nodded in satisfaction as she replied with a smile.</p><br/><p>Xiao Yan gently patted the black ruler on his back, but was too lazy to continue speaking.</p><br/><p>“Hey, have you heard of the matter with regards to the Misty Cloud Sect?” Just as Xiao Yan and Queen Medusa were resting quietly, a secretive voice could be heard not far from their table, causing Xiao Yan to throw his gaze over.</p><br/><p>“Chi, you are talking about the matter of the young man called Xiao Yan creating a huge mess at the Misty Cloud Sect, no?” A man curled his lips in disdain at his companion who had a mysterious looking face.</p><br/><p>“Uh, you already knew about it?” The person who spoke earlier was immediately startled as he embarrassingly asked.</p><br/><p>“A matter as big as this has already been spread around two days ago. That Xiao Yan beat the Misty Cloud Sect’s Junior Sect Leader Nalan Yanran in an official match. I heard that it seems to be because of Nalan Yanran cancelling their engagement three years ago. Looking at it now, the news of Nalan Yanran being forcefully divorced by Xiao Yan back then does indeed have some reliability to it. Seeing the strength and talent that the current Xiao Yan has displayed, he is more than enough to be worthy of being married to Nalan Yanran.”</p><br/><p>“Uh, what happened after that?”</p><br/><p>“After that, it seems that the Misty Cloud Sect wanted to forcefully retain Xiao Yan. Hee Hee. Although he is young, the strong people behind him are really terrifying to the point of leaving others speechless. I have heard that in that battle back then, not only two strong Dou Huang, but also Queen Medusa from the Snake-People race appeared. The Misty Cloud Sect may have used all their effort, but they still ended up letting Xiao Yan leave in one piece.”</p><br/><p>“Queen Medusa?” When this word left his mouth, the surrounding people exclaimed.</p><br/><p>“Hee hee, according to reliable information, that Xiao Yan is also the champion of this season’s Alchemist Grand Meeting.” The shocked gazes surrounding him caused the vanity of that man to inflate. He laughed and once again exposed surprising information.</p><br/><p>“Isn’t the champion of the Alchemist Grand Meeting called Yan Xiao?” A soft voice abruptly appeared.</p><br/><p>“Yan Xiao, Xiao Yan. Isn’t it him if we were to read it in reverse, ha ha.” The man gloatingly said with a smile.</p><br/><p>“Uh.” The surrounding people were momentarily blank. Immediately, they came to a sudden realization. Although this matter regarding the name was worth nothing once it was pointed out, what kind of normal person would have nothing better to do, but read a name in reverse?</p><br/><p>“Ah, this fellow is really incredible. At such an age, he has already done such earth-shaking things. In the future, once he grows up, won’t he be even more incredible?” The man violently poured a potent wheat wine into his mouth and sighed with envy. Which man did not have a hot-blooded dream of doing something huge? Due to their limited ability, however, many people were destined to only fantasize about such things.</p><br/><p>Xiao Yan was somewhat stunned to hear the conversation that was transmitted over, and could not help but bitterly smile and shake his head. He did not expect that the matter at the Misty Cloud Sect had actually spread over to the other side of the empire in merely a few days.</p><br/><p>“You are now a renowned person.” Queen Medusa shook the wine cup in her hand and teased.</p><br/><p>Xiao Yan spread out his hands and said, “I am not interested in such thing. Alright, let’s go and see whether the herb hall has the medicinal ingredients we need.”</p><br/><p>“Yes.”</p><br/><p>Xiao Yan and Queen Medusa stood up and were about to leave the restaurant when the conversation from the table beside them was once again transmitted over, causing Xiao Yan’s expression to change slightly.</p><br/><p>“That Xiao Yan seems to be someone from the Xiao clan at Wu Tan City, no?”</p><br/><p>“That’s right, the Xiao clan can really show their face this time around. With this clan member who is a totally terrifying person, who in the northern region would dare to be disrespectful to the Xiao clan?”</p><br/><p>“Hee hee, that may not be so. Coincidentally, I have just come over from Wu Tan City a short while ago. I heard that the Xiao clan has met some trouble during these two days.”</p><br/><p>“Hm? There is actually someone who dares to go to the Xiao clan to find trouble at this time?”</p><br/><p>“I am not sure about this. The Xiao clan is very strict on maintaining its secrets. I am also uncertain about the exact news.” That man shook his head before lowering it to drink a mouthful of wheat wine. However, he abruptly stilled. He raised his head slowly and looked at the black robed young man who had appeared in front of him. A powerful force shrouded the latter’s body, causing him, who was merely a two star Dou Zhe to swallow a mouthful of saliva. He carefully said, “This sir, is there something wrong?”</p><br/><p>“What you just said… What problem did the Xiao clan encountered?” Xiao Yan asked in a deep voice.</p><br/><p>“Uh. The little me is not very certain. I have only heard that the an overly intense fight had erupted at the Xiao clan two days ago. After that, the Xiao clan denied any outside guest from entering. Moreover, from that day on, clan leader Xiao Zhan who had frequently made appearances no longer appeared. I think that he should be sorting out the matter within the clan.” The man said in a perturbed manner.</p><br/><p>Xiao Yan’s expression gradually became dark and solemn. His heart suddenly felt an uneasiness. After saying his thanks to the man, he turned around and hurriedly walked down the stairs with Queen Medusa.</p><br/><p>“The weapon on that person’s back is rather strange.” One person suddenly said in a soft voice as they watched Xiao Yan who had disappeared from the spot where the stairs was.</p><br/><p>“Weapon? Ruler?” The man earlier was startled. Suddenly, he appeared to have recalled something. A shock gradually surfaced on his face as he cried out involuntarily, “He is Xiao Yan?! He is actually this young?”</p><br/><p>The current Xiao Yan naturally did not pay attention to the commotion in the restaurant above. After going down the stairs, he stood on the street and tightly furrowed his brows. He eyed Queen Medusa and said, “I cannot stay here. I need to return to Wu Tan City now.”</p><br/><p>Hearing this, Queen Medusa’s eyebrows were gently knit together. She faintly said, “Let’s take a look at the medicinal shop here first. If there is the medicinal ingredient that I need…”</p><br/><p>“I said, I want to return to Wu Tan City now!” Xiao Yan’s gaze was fierce as he stared at Queen Medusa while voicing each word with a pause as he spoke in a deep voice.</p><br/><p>Queen Medusa was startled at Xiao Yan’s attitude which had suddenly become firm. During these few days, Xiao Yan had never gone against what she said. It was really unexpected that he would actually directly contradict her at this moment. This caused Queen Medusa, whose identity was a queen of a race, to be a little furious.</p><br/><p>“This queen wants to find the medicinal ingredients!” Her bewitching pupils stared icily at Xiao Yan as Queen Medusa slowly said.</p><br/><p>Xiao Yan’s eyes stared intently at the pair of pupils which caused men to be obsessed over. He abruptly extended his hand and under Queen Medusa’s stunned gaze, he tightly grabbed her delicate hand which was so soft that it appeared to be boneless. Before the latter was about to explode, he coldly said, “If you want the ‘Thawing Spirit Pill’, then don’t put on your airs that belongs to a queen in front of me. Earlier, I respected you because you had helped me escape. If you continue to pester me annoyingly and become unreasonable, don’t blame me for not giving you face.”</p><br/><p>“Go!”</p><br/><p>Once he said those words, Xiao Yan pulled her along and swiftly ran toward the exterior of the city. Queen Medusa appeared to have suffered a severe shock because of Xiao Yan’s sudden explosion, which was completely different from the period of time earlier. At this moment, she actually did not have any reaction. Only her eyes carried some shocked as she stared at the former. She had never thought that there would actually be someone who dared to roar at her in such a fierce manner given her status.</p><br/><p>For a time, an emotion where she felt neither able to laugh nor cry suddenly rose within Queen Medusa’s heart. How many years had it been since she was treated in this manner by someone? Moreover, this was from a young Da Dou Shi whom she could send flying with a mere slap of hers. Did he think that his life was too long?</p><br/><p>Xiao Yan pulled Queen Medusa and dashed out of the city. He swiftly summoned out the Purple Cloud Wings and quickly flew toward Wu Tan City.</p><br/><p>By pushing himself to the limit, a partially visible city’s outline vaguely appeared in Xiao Yan’s sight in merely two hours.</p><br/>\n</div>"}