{"title": "Chapter 353: The Previous Sect Leader of the Misty Cloud Sect, Dou Zong Yun Shan", "id": 353, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-353-the-previous-sect-leader-of-the-misty-cloud-sect-dou-zong-yun-shan", "volume_title": "Volume 4", "body": "<h1>Chapter 353: The Previous Sect Leader of the Misty Cloud Sect, Dou Zong Yun Shan</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 353: The Previous Sect Leader of the Misty Cloud Sect, Dou Zong Yun Shan</u></strong></p><br/><p>The majestic force, that was like a huge dragon being awoken, instantly covered the entire Misty Cloud Mountain. An enormous pressure that Xiao Yan had never felt before spread out from deep within the Misty Cloud Mountain. Finally, it permeated the entire square. At that moment, all the Misty Cloud Sect disciples could not resist the reverence they felt in their hearts and knelt down toward the spot where the force was spreading from. Although Yun Leng and some of the other Misty Cloud Sect’s Elders did not kneel down in respect, they still respectfully bowed.</p><br/><p>“This presence.” Nalan Yanran’s pretty eyes stared in the direction of the deep regions of the Misty Cloud Sect. A shock also surfaced on her pretty face. She did not expect that today’s matter would actually disturb this grand teacher who has been in seclusion for so long.</p><br/><p>“This is bad. That old fellow really has not died!” The moment the Qi was released, Hai Bodong’s expression suddenly changed. His soft voice contained a shock that could not be hidden.</p><br/><p>“Is it the former Misty Cloud Sect Leader, Yun Shan?” Xiao Yan expression had also become much gloomier at this moment. He recalled what Hai Bodong said earlier and asked with furrowed brows.</p><br/><p>“Yes.” Hai Bodong nodded his head. In a soft voice, he said, “Seeing this presence, he has really broken the barrier of a Dou Huang and advanced to the Dou Zong class.”</p><br/><p>“A strong Dou Zong, huh.” Xiao Yan’s hands gently trembled a little. The strongest person that he had seen in his lifetime was Queen Medusa and Jia Xing Tian. Although a Dou Huang and a Dou Zong were merely a one class difference, the gap between them was like that of the heavens and earth. Earlier, Hai Bodong was able to use his strength to swiftly attack the three Dou Wangs. As for a strong person of the Dou Zong class, it would similarly not be too difficult to take on three Dou Huangs.</p><br/><p>“Dammit it. It is always this troublesome.” Xiao Yan pursed his lips. His heart had become a little impatient because of these events that were occurring one after another. Each time he thought that he could leave, there would always be something unexpected that happened.</p><br/><p>“Old Hai, since Yun Shan has really appeared, then I am afraid that you are going to step aside, no?” Xiao Yan suddenly remembered Hai Bodong’s words and softly sighed.</p><br/><p>Hearing this, Hai Bodong was at a loss. His expression was volatile. A long while later, he suddenly clenched his teeth and said, “Although a person like me does not like to get involved in things that have nothing to do with me; I must see something, that I have already begun doing, until the end. Even if Yun Shan really wants to stop us today, I will try my best to bring you away from Misty Cloud Mountain!”</p><br/><p>Xiao Yan was startled as he turned to look at Hai Bodong, who was clenching his teeth. A warmth immediately appeared in his heart. Part of the reason Hai Bodong chose not to give up at this moment may be due to the ‘Spiritual Recovery Purple Pill’, but no matter how one put it, his willingness to help Xiao Yan escape in the face of offending the Misty Cloud Sect suggested a friendship that far exceeded Xiao Yan’s expectations. At the very least, he was far better than some people.</p><br/><p>“Thank you very much, Old Hai. I, Xiao Yan, will remember your help today deeply in my heart. I will definitely return the favor in the future.” Xiao Yan inhaled a deep breath and cupped his hands toward Hai Bodong. His delicate and handsome face was extremely serious.</p><br/><p>“We will talk about the matters of the future another time. Now, we need to shake off that old fellow in front of us. The moment Yun Shan woke up, this entire Misty Cloud Mountain was covered by his aura. Currently, even if we wanted to leave, it will not be easy.” Hai Bodong smiled bitterly and shook his head. The corner of his eyes glanced at the enormous ‘Heaven Swallowing Python’ that was suspended behind Xiao Yan. He then glanced at Ling Ying a short distance away. In his heart, he was repeatedly calculating the fighting strength of both parties.</p><br/><p>As the two of them were conversing softly, the majestic force from deep within the Misty Cloud Mountain had become increasingly dense. Finally, a clear howl suddenly rushed toward the sky. Under a countless number of gazes, a white figure suddenly appeared from deep within the Misty Cloud Sect. Immediately, his feet stepped in the sky and slowly moved toward the square of the Misty Cloud Sect.</p><br/><p>The white figure did not summon Dou Qi wings, but the speed at which he was walking through the empty air was not any slower than Hai Bodong and the others. Each time his footstep landed, a circular ripple would be formed in the empty space. The ripple then disappeared and the human figure suddenly appeared over a hundred meters away in an extremely mysterious manner.</p><br/><p>By taking a few strides in this manner, the human figure flashed and appeared on top of the stone monument in the middle of the square in merely a few moments. His indifferent gaze swept across the ground that was in a mess and his brows furrowed slightly. The pressure that covered the entire ground had also become much more dense at this moment.</p><br/><p>Xiao Yan was suspended in the air as he swept his gaze toward the white figure that had appeared. He carefully looked up and down as he weighed this previous sect leader of the Misty Cloud Sect.</p><br/><p>The white figure was wearing an extremely plain, white-colored long robe. The gentle breeze brushed by and his long robes fluttered, giving him a kind of otherworldly and elegant aura. His age did not appear very old and his face did not have the wrinkles that an old man ought to have. Instead, it was like warm jade that was emitting a glow. If it were not for his long hair being snow white, Xiao Yan would really have difficulty thinking of him as a strong person of the same generation as Hai Bodong. However, from the reverence that had appeared on all the faces of the Misty Cloud Sect disciples below, it was clear that this person was the previous Misty Cloud Sect Leader, Yun Shan.</p><br/><p>“Hei, after this old fellow broke through to the Dou Zong class, he actually became a little younger. Looks like the benefits of breaking through that barrier are indeed not small.” As Hai Bodong studied Yun Shan’s exterior appearance, he could not resist smacking his lips. The envy in his soft voice was not concealed.</p><br/><p>“Yun Leng, give me an explanation. You should know that I have said not to disturb me in my quiet training unless there is some big matter.” Yun Shan gaze turned toward Yun Leng below as spoke blandly.</p><br/><p>“Old Sect Leader, you have finally come out. If you were a little later, I’m afraid that the Misty Cloud Sect would be destroyed by other people!” As Yun Shan gaze swept over, Yun Leng’s legs immediately softened. His knees involuntarily knelt down. The bloodstain on his face gave him an extremely miserable look.</p><br/><p>“Where is Yun Yun?” Yun Shan frowned slightly and asked.</p><br/><p>“Sect Leader has gone out, and has yet to return.” Yun Leng hurriedly replied.</p><br/><p>“Give me a short summary of what has happened. In so many years, this is the first time that the Misty Cloud Sect has been damaged by another to such an extent.” Yun Shan’s hands were inserted into his sleeves as he calmly said.</p><br/><p>Hearing this, Yun Leng braced up his spirit. He pointed at Xiao Yan in the sky with his hand and loudly said, “Old Sect leader, what has happened today is entirely caused by him!”</p><br/><p>As he spoke, Yun Leng hurriedly told him of the suspicion Xiao Yan had with regards to Mo Cheng’s death. Of course, one must say that Yun Leng had quite a great ability when handling such matters since he was able to become the First Elder of the Misty Cloud Sect. Therefore, when he was explaining, his action of forcing the Xiao Yan to stay behind was described as tactfully wanting Xiao Yan to temporarily rest at the Misty Cloud Sect for a few days until the matter was clarified. These words were indeed something which Yun Leng had said however, the tone in which he tried to get Xiao Yan to stay behind was completely different. Therefore, even though he said it in this manner, no one could refute his words. After which, he talked about how Xiao Yan resisted and the strong people behind him appeared one after another. Finally Yun Leng used a stance of being a protector and used the strength of the entire sect to protect the sect’s reputation, but was still no match. Only then did he have little choice but to use the whistle and invite Yun Shan, who was in seclusion, out.</p><br/><p>Most of what Yun Leng had said was the truth. However, after embellishing some of the things he said, the responsibility of the entire event now had completely become Xiao Yan’s.</p><br/><p>The entire square was completely quiet. Only Yun Leng’s voice which carried some anger, was repeatedly heard.</p><br/><p>A long while later, when Yun Leng finally said all that had to be said. He finished up in a grieved manner, “Old Sect Leader. Although Mo Cheng was only a deacon within the sect, his contributions to our Misty Cloud Sect these few years were extremely great. If we allow him to be randomly killed and do nothing about it, who would dare work for our sect in the future? Won’t it cause them to be disillusioned?”</p><br/><p>“It is also not that our Misty Cloud Sect is one of those sects who randomly wrongs people. We only asked that Xiao Yan live in the Misty Cloud Sect temporarily, for a short period of time. After we finish investigating the matter, I, Yun Leng, would have personally apologized to him if we had falsely accused him. However, he simply ignored my suggestion just because there was someone backing him. After the discussions became ineffective, he actually launched an attack. Although his own strength is nothing great, he has quite a number of helpers. Currently, the Sect Leader is absent, and I can only take the risk of disturbing old Sect Leader and ask for your assistance.”</p><br/><p>Xiao Yan folded his hands across his chest as stood in the air. He coldly watched Yun Leng who was repeatedly listing his offences and had long since given up trying to explain anything. This was because he knew that it was of not much use. People always favor their own. Could Xiao Yan hope that Yun Shan would help him by speaking to him?</p><br/><p>After hearing Yun Leng explanation, Yun Shan’s face did not have any expression. He slowly lifted his head and his gaze swept across his surroundings. He laughed faintly, “It is really unexpected that the matter today has blown up until it is this big. Even Jia Xing Tian, Fa Ma, you two old fellows have also come.”</p><br/><p>Jia Xing Tian and Fa Ma exchanged glances and smiled. They pointed toward the sky and said, “There is one more person there.”</p><br/><p>“I know, Hai Bodong right? Just now, I sensed his Qi when I came out. It is just that I did not expect that he was actually still alive after so many years. I originally thought that he had been killed by Queen Medusa.” Yun Leng lifted his head, eyed Hai Bodong as he spoke.</p><br/><p>“Hee hee, isn’t it the same for you, you old thing.” Hai Bodong parted his mouth, stepped forward and said with a smile. Coincidentally, he blocked Xiao Yan behind him as he did so.</p><br/><p>“He is Xiao Yan, right?” Yun Shan glanced at Xiao Yan behind Hai Bodong and asked.</p><br/><p>“I pay my respects to Sect Leader Yun Shan.” Xiao Yan intently watched Yun Shan whose entire body was emitting a pressurizing force. He smiled and said in neither an inferior nor arrogant manner.</p><br/><p>“Your bearing is not bad. Unfortunately, you are a little weak.” Yun Shan said faintly.</p><br/><p>“Chi, Yun Shan, when you were seventeen, forget about Dou Zong, even if you were to see a Dou Wang, you would be agitated like it is something very great.” Hai Bodong curled his lips and said.</p><br/><p>“A seventeen years old Da Dou Shi, huh.” Some shock flashed across those eyes which had been as indifferent as the breeze. He shook his head before lifting it and asked, “After listening to what Yun Leng had to say earlier, do the both of you have nothing to say to refute him?”</p><br/><p>“Ke ke, since Sect Leader Yun Shan believes his words, why do we need to do something unnecessary.” Xiao Yan smiled and replied in a somewhat mocking manner.</p><br/><p>“I believe half of what Yun Leng has said. I understand his character.” Yun Shan unexpectedly shook his head. “However, regardless of who is right or wrong with regards to this matter, the few of you need to bare some responsibility for turning the Misty Cloud Sect into this mess.”</p><br/><p>“Then what does Sect Leader Yun Shan want to do?”</p><br/><p>“I shall not say any courteous words such as letting you stay as guests. Today, you have created a lot of trouble here which has damaged quite a bit of the Misty Cloud Sect’s reputation. We must redeem our reputation. Since the few of you have caused my Misty Cloud Sect to turn into such a dire state, then let me spar with the few of you.” Yun Shan’s hands slowly extended out of his sleeves as he calmly spoke. Yun Shan then indifferently glanced over Hai Bodong, Ling Ying and the enormous ‘Heaven Swallowing Python’ that was suspended in the air.</p><br/><p>“All of you can attack together.” Yun Shan lowered his head, pulled his sleeves and carelessly added.</p><br/><p>“Hei, it is really unexpected that the Misty Cloud Sect has a strong Dou Zong. Now, it can barely squeeze into a top tier strength in the continent. Unfortunately, compared to Yun Bo Tian back then, it appears that you are still lacking by quite a bit.” Ling Ying’s body flashed and appeared in front of Xiao Yan. He faced Yun Shan below and laughed.</p><br/><p>“This is the strong person from the continent, right? Which faction do you belong to? Although I have been in seclusion for a very long time, I still do know one or two things about the factions on the continent.” Yun Leng’s hand which was pulling his sleeves came to a stop as he lifted his head.</p><br/><p>“This is something that I cannot reveal.” Ying Ling waved his hand. His face immediately turned grave as he said in a deep voice, “However, I will give you a reminder here. Don’t think that you can do as you please after becoming a Dou Zong. I advise you to not rashly touch him. Otherwise, you will definitely regret your actions!”</p><br/><p>“There are many people on this continent who can destroy your Misty Cloud Sect!”</p><br/><p>Yun Shan knit his eyebrows slightly together. He stared at Ling Ying. “Is that a threat?”</p><br/><p>“You can think of it as such! Do not doubt the truth of the words I have said!” Ling Ying gave a tit for a tat as he stared at Yun Shan and said in a soft and deep voice.</p><br/><p>“You can all attack together. The reputation the Misty Cloud Sect has accumulated over many generations cannot be destroyed in my hands. However, if you all can leave the Misty Cloud Sect from my hands, we will call it quits after today’s events.” Yun Shan sighed and did not say anything else. His body slowly rose into the air without any warning. The surge in energy actually caused the surrounding empty space to fluctuate a little.</p><br/><p>Hai Bodong’s expression was a little grave as he watched Yun Shan slowly rise into the air. He and Ling Ying exchanged glances. The former then turned his head toward Xiao Yan and said in a deep voice, “You should let that large snake protect you. He and I will go and block Yun Shan.”</p><br/><p>“The both of you be careful.” Xiao Yan hesitated for a moment before nodding his head. His gaze suddenly turned toward Ling Ying and said, “This old sir, I wonder if you…”</p><br/><p>“Don’t ask anything regarding me. Once you leave the Misty Cloud Sect, I will also leave the Jia Ma Empire. When the time is ripe in the future, you will naturally know.” Ling Ying waved his hand and took the initiative to interrupt Xiao Yan’s words.</p><br/><p>Xiao Yan was startled upon hearing this. He immediately smiled bitterly as he nodded his head. All he could do was flap his wings and pull back.</p><br/><p>“Ah, it is really unexpected that in the end, they managed to disturb Yun Shan, this old fellow and got him to come out.” As he watched the situation in the sky, Fa Ma shook his head and sighed.</p><br/><p>“Dou Zong. Hei, this old fellow actually succeeded.” Jia Xing Tian sucked his lips. An envy which he could not hide appeared on his face. He was currently at the peak of the Dou Huang class. As long as he advanced further, he could similarly enter that realm which many yearned for. Unfortunately, that one step difference was something that Jia Xing Tian could not cross even after training for so many years.</p><br/><p>“What should we do next? Should we go and mediate?” Fa Ma frowned and asked.</p><br/><p>“It’s no use.” Jia Xing Tian shook his head. His gaze swept across the square below. As he eyed those Misty Cloud Sect disciples who had fainted and the damaged square, he smiled bitterly and said, “This time, Xiao Yan’s group has really given a tight slap to the Misty Cloud Sect. In order to redeem its reputation, Yun Shan must defeat them in front of all of us. Of course, after this matter is over, he might not make things too difficult for them. After all, there is the mysterious supporter behind Xiao Yan’s back which also caused him to be extremely fearful. Therefore, before he clearly investigates the mysterious faction behind Xiao Yan’s back, Yun Shan will not carelessly touch him.”</p><br/><p>“Can Hai Bodong and that Ling Ying defeat Yun Shan?” Fa Ma nodded slightly before immediately asking.</p><br/><p>“If they can, it will be very difficult.”</p><br/><p>In the square, Yun Leng eyed the rising Yun Shan. He glanced over to Xiao Yan a distance away and a dark viciousness and a gloating cold laugh flashed across his eyes without anyone knowing.</p><br/><p>“Hai Bodong, on account of our old friendship, I will not take your actions earlier into account.” Yun Shan faintly said as he floated on the same level as Hai Bodong and Ling Ying in the sky.</p><br/><p>“Ah, just do it. It is a little late to talk about all this now.” Hai Bodong sighed and shook his head. As his fist rotated, a white-colored ice cold air overflowed from his body. Immediately, the surrounding temperature fell.</p><br/><p>“Let me see just how much stronger you are compared to back then after you have advanced to the Dou Zong class.” Hai Bodong gently exhaled. His fist abruptly twisted and ten plus snow white circular shaped icicles suddenly appeared in front of him. They rotated at high speed and after images repeatedly appeared. They even emitted waves of humming sounds.</p><br/><p>Beside him, Ling Ying’s expression had also gradually grown serious. He waved his sleeves gently and strange black-colored shadows continued to be spat out from under his feet. His palms gripped slightly and the black-colored Qi swiftly agglomerated. An instant later, it actually once again formed a long black-colored lance that was twenty to thirty feet long. The long lance waved gently and the air formed ripples at the tip of the lance.</p><br/><p>“Xiao Yan, go!” Hai Bodong let out a deep cry. He pushed his hand forward and the ten plus huge circular ice blades suddenly cut through the sky and shot explosively toward Yun Shan.</p><br/><p>The moment Hai Bodong attacked, Ling Ying also grabbed the long black-colored lance. His body twisted and immediately launched the lance out.</p><br/><p>The ice blades and the lance carried intense, frightening pressure as they directly shot toward Yun Shan a short distance away. Along the way, they actually left two long scars in the air wherever they passed.</p><br/><p>The moment these two people unleashed their attacks, Xiao Yan flapped his wings. He gently landed on the head of the ‘Heaven Swallowing Python’ and urged it on. The ‘Heaven Swallowing Python’ immediately turned its body. Its body may have been very large, but it displayed an extremely fast speed.</p><br/><p>Seeing the response of Hai Bodong and Ling Ying, Yun Shan shook his head. He did not say any more nonsense. Lifting both his hands slowly, he aimed at the circular ice blades and the long black-colored lance from a distance. His mouth moved slightly and a faint voice was softly emitted, “Wind Wall!”</p><br/><p>When Yun Shan’s voice fell, a violent gust of wind appeared. Quickly, a deep green wind wall that spanned over half of the sky, formed. The size of the wall was so large that it made everyone below it awestruck.</p><br/><p>“Bang!”</p><br/><p>The circular ice blades and the long black-colored lance instantly arrived in front of the wind wall. The two collided and a thunderclap-like explosion resonated throughout the sky. Numerous energy ripples were emitted from the point of collision. However, the dark green-colored wind wall, that was a little overly large, did not show the slightest hint of crumbling. The combined attack of Hai Bodong and Ling Ying appeared to have not posed much of a threat to Yun Shan’s defense.</p><br/><p>Hai Bodong’s and Ling Ying’s expressions changed slightly as they eyed the enormous wind wall that spanned across the sky.</p><br/><p>The corner of Yun Shan’s eyes glanced at the ‘Heaven Swallowing Python’ that was flying away. His right hand waved in the direction which it was flying. The sound of the wind caused a great tremor and a huge wind wall suddenly appeared in front of the ‘Heaven Swallowing Python’. The latter was shocked and it hurried to forcefully move its body in order to avoid colliding with it.</p><br/><p>“Ten Thousand Wind Bind!”</p><br/><p>After blocking the flying path of the ‘Heaven Swallowing Python’, Yun Shan’s hand suddenly made a fist in the direction of Hai Bodong and Ling Ying. Immediately, an essence wind rope that was agglomerated from wild wind appeared from all directions. The wind ropes were entangled with one another and finally shot through the air, like numerous long snakes. In an instant, Hai Bodong and Ling Ying suddenly realized that the two of them had been tied up without them even knowing. Immediately, the Dou Qi in their bodies flowed precipitously. However, each time they convulsed and broke some wind ropes, there would be more that whizzed and appeared in the air, binding the two of them even more firmly.</p><br/><p>“Hu, he is indeed worthy of being a strong Dou Zong. The attack method which he uses cannot be considered outstanding, but two Dou Huangs do not have the strength to fight back in his hands. Is this the difference between the two levels?” Jia Xing Tian and the others involuntarily sighed as they watched Hai Bodong and Ling Ying being tied up by Yun Shan after just a mere exchange in the sky.</p><br/><p>“It looks like Xiao Yan and the others are really completely defeated this time around.”</p><br/><p>After tying Hai Bodong and Ling Ying up, Yun Shan’s eyes glanced at the ‘Heaven Swallowing Python’ which was planning to make a detour around the wind wall that was blocking its path. His foot stepped forward. When he next appeared, he was actually in front of the ‘Heaven Swallowing Python’.</p><br/><p>The ‘Heaven Swallowing Python’ widened its snake eyes and glared at Yun Shan who had appeared in a flash. It opened its huge mouth and the seven-colored liquid which contained a potent poison shot explosively toward Yun Shan.</p><br/><p>Yun Shan waved his hand and a wind wall appeared in front of him. The seven-colored liquid poured down and swiftly corroded the substance-like wind wall into nothingness. The ‘Heaven Swallowing Python’ was preparing to continue attacking, however, a massive strength was abruptly transmitted from its tail. It twisted its head to take a look only to find that Yun Shan, who should have been in front of it, had unknowingly appeared at its tail.</p><br/><p>“Go down!” Yun Shan’s leg gently stepped on the ‘Heaven Swallowing Python’s’ tail. An enormous strength caused the ‘Heaven Swallowing Python’ to emit a shrill hiss. Its body immediately and abruptly fell.</p><br/><p>“Bang!” The ‘Heaven Swallowing Python smashed heavily on a corner of the square. Immediately, the hard ground was compressed by the enormous body until it cracked.</p><br/><p>“Grug.”</p><br/><p>Earlier, when Yun Shan unleashed a hidden force, Xiao Yan was also corroded by the hidden force as he was coincidentally on the body of the ‘Heaven Swallowing Python’. With his Da Dou Shi strength, even a mere drop of the hidden force still caused his expression to pale as he vomited a mouthful of fresh blood.</p><br/><p>Xiao Yan rolled down from the ‘Heaven Swallowing Python’s’ head. He wiped off the bloodstain from the corner of his mouth. Turning his head, he watched the ‘Heaven Swallowing Python’ with its snake eyes dimming. Its teeth involuntarily bit down and emitted a crunching sound.</p><br/><p>“You guys have lost.” As a gentle wind blew across, Yun Shan’s figure once again appeared in midair in front of Xiao Yan in a ghost-like manner as he said faintly.</p><br/><p>The corner of Xiao Yan’s mouth twitched slightly. With a choking sound, he pulled out the Heavy Xuan Ruler from his back. From a distance, he pointed at Yun Shan and spat out a mouthful of blood. He said with a cold smile, “There is still me.”</p><br/><p>Yun Shan slowly landed on the ground. After which, he walked toward Xiao Yan under everyone’s gaze.</p><br/><p>“Hiss!”</p><br/><p>Seeing Yun Shan closing in, the ‘Heaven Swallowing Python’ emitted a few sharp hisses from its mouth. Unfortunately, this did not cause Yun Shan’s footsteps to pause. A moment when Yun Shan was increasingly close, the ‘Heaven Swallowing Python’s’ huge tail was abruptly swung. It carried an enormous, dark shadow as it violently smashed toward Yun Shan.</p><br/><p>The dark shadow that came from all directions did not cause any change in Yun Shan’s expression. He waved his hand upward in a careless manner. A green-colored energy palm that was seventy feet tall appeared in the mid air. Immediately, it struck the huge tail of the ‘Heaven Swallowing Python’. The huge force that was contained within it caused the tail of the ‘Heaven Swallowing Python’ to fan over in the other direction. Over ten large trees with huge roots were smashed in the middle of their trunk through the area where the tail passed by.</p><br/><p>“Hiss.” The intense pain that was transmitted from the tail once again caused the ‘Heaven Swallowing Python’ to emit a wave of hissing sounds. Its hiss contained a pain that was difficult to hide.</p><br/><p>Yun Shan indifferently watched the huge ‘Heaven Swallowing Python’. He furrowed his brows slightly. This large fellow’s ability to withstand being hit had already far exceeded an ordinary rank 5 Magical Beast.</p><br/><p>The snake’s eyes contained a crimson color as they stared intently at Yun Shan who was approaching. It widened its mouth and the seven-colored liquid was once again spat out. This time around, however, Yun Shan did not even make the slightest move to dodge. He strolled directly through the liquid. Even the clothes on his body were not damaged as he did so.</p><br/><p>Yun Shan’s footsteps came to a slow stop. Yun Shan stared at Xiao Yan in front of him in an indifferent manner. He raised his palm and allowed it to fall gently down toward Xiao Yan.</p><br/><p>Xiao Yan stared intently at the palm which was moving increasingly closer. His face was completely flushed. This was because he had realized that at this moment, he was actually unable to move his body by even the slightest.</p><br/><p>“Stop resisting. Stay at the Misty Cloud Sect for half a year. I will not harm you. However, you must pay a little price for your own recklessness.” Yun Shan said calmly as he watched Xiao Yan who was going all out to break away from his restraints.</p><br/><p>“Hiss!” Behind him, the ‘Heaven Swallowing Python’s’ huge mouth violently bit at Yun Shan. Unfortunately, it was sent rolling with just a slap from the latter.</p><br/><p>The palm of Yun Shan was becoming larger and larger within those dark black eyes of Xiao Yan. The hand which Xiao Yan held the Heavy Xuan Ruler with was also trembling with a great intensity. His mind was completely quiet at this moment. There was only the sound of his heart pounding continuously.</p><br/><p>In that quiet world, there appeared to be some sort of extremely large force that was about to flow out turbulently.</p><br/><p>However, the moment when that enormous energy was about to surge out, it abruptly paused. Immediately, it retreated in a lightning-like manner as though it had never appeared.</p><br/><p>During the time that the enormous force was retreating, Xiao Yan’s quiet state was also broken with its retreat. He lifted his head. Yun Shan’s palm was merely half a centimeter from his own arm. Immediately, a hopeless emotion climbed into his heart.</p><br/><p>“Hiss!”</p><br/><p>At this critical moment, the ‘Heaven Swallowing Python’ behind Xiao Yan suddenly emitted a long hiss toward the sky. An intense glow abruptly surged violently from within it.</p><br/><p>The unusual change of the ‘Heaven Swallowing Python’ immediately attracted the gazes of everyone present. Even Yun Shan frowned intently at the cluster of intense glow. A moment later, however, an abrupt change finally appeared on his face which had been calm.</p><br/><p>In the intense light behind Xiao Yan, a long mellow female’s hand suddenly extended dexterously. It appeared very slow, but it coincidentally blocked Yun Shan’s palm.</p><br/><p>The moment the two hands came into contact. The ground suddenly trembled. Numerous, terror inducing, crack lines spread out over the ground, as though an earthquake had occurred.</p><br/><p>“Old Fellow, have you enjoyed the beating you gave me?”</p><br/><p>A bewitching yet cool voice that nearly caused men’s bones to become numb slowly spread throughout the square. Immediately, the faces of some of those with weaker mental strength turned as red as a cloud of flames.</p><br/><p>A countless number of gazes turned toward the location of that voice. When they saw the enchanting and bewitching woman standing behind Xiao Yan, they involuntarily held their breath. However, those like Hai Bodong who recognized her, had terrified faces.</p><br/><p>Xiao Yan swallowed a mouthful of saliva. As he slowly turned his head, an icily alluring, bewitching, and lovely beautiful face appeared in his sight.</p><br/>\n</div>"}