{"title": "Chapter 362: Yao Yan, Yun Zhi", "id": 362, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-362-yao-yan-yun-zhi", "volume_title": "Volume 4", "body": "<h1>Chapter 362: Yao Yan, Yun Zhi</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 362: Yao Yan, Yun Zhi</u></strong></p><br/><p>The ice-cold cry like angry thunder engulfed the entire mountain.</p><br/><p>All the disciples in the Misty Cloud Sect lifted their heads, and turned their gazes toward the blue sky. At that spot, two human figures were suspended in the air. Thick killing intent was overflowing from within the body of the black-robed young man who was in charge.</p><br/><p>“Xiao Yan? Why has he returned?” When some of the sharp eyed people saw the cold face of the black-robed young man, numerous shocked noises immediately and repeatedly sounded from within the Misty Cloud Sect. This young man who had turned the Misty Cloud Sect upside down days before had caused every single Misty Cloud Sect’s disciple to firmly remember this name.</p><br/><p>Xiao Yan’s dark and cold gaze slowly swept all over of the Misty Cloud Sect below. Finally, it paused on a large hall. At that spot, a white glow which contained a fury suddenly shot out explosively. Finally, it suspended in the sky and a furious roar resounded throughout the sky, “Xiao Yan, you are actually this rude. Are you seeking death?”</p><br/><p>Xiao Yan’s eyes stared intently at the green-faced Yun Leng who was suspended in midair. His right hand abruptly drew the Heavy Xuan Ruler from his back and suddenly pointed at the latter. In a thick voice, he said, “Old bastard. Even if Yun Shan wants to protect you today, I will still take your life!”</p><br/><p>“Ah, what an arrogant tone! Coincidentally, I am looking for you too. Today, I think you should stay at the Misty Cloud Sect.” Yun Leng coldly laughed. He clenched his teeth and angrily replied. Having his name directly threatened and cursed by this person who had charged into their sect really caused him to lose all his reputation within the sect.</p><br/><p>“Yun Leng, shut up!” A clear cold cry suddenly sounded in the sky. When they heard this cry, the Misty Cloud Sect’s disciples below bowed their bodies slightly and unanimously. Even Yun Leng could only violently shake his hand and take a step back.</p><br/><p>A few white lights flashed across the horizon. Immediately, a few human figures scattered and appeared in the sky. The person in the middle was wearing a moon-white robe. The corner of her skirt fluttered gently in the wind. The hair on her head was set in a phoenix shape, setting off that pretty face. Her nobility contained some dignity that was difficult to hide.</p><br/><p>Xiao Yan’s gaze slowly swept across the few people who had appeared. His gaze stopped on Yun Shan for a moment before turning toward the moon-robed woman, who was at the center. For her to be able to willfully scold Yun Leng, who was the First Elder, it was likely that her status was quite high. Within the Misty Cloud Sect, other than Yun Shan who was present, it was likely that only the current Sect Leader, Yun Yun, possessed such authority.</p><br/><p>Xiao Yan’s gaze moved upward. It finally stopped on that graceful and noble pretty face. The two gazes interacted and were momentarily at a loss. Immediately, they became suddenly dull.</p><br/><p>At this moment, a gentle breeze blew past and two dull faces which were looking at each other appeared.</p><br/><p>“Yun Zhi?”</p><br/><p>“Yao Yan?”</p><br/><p>In the quiet midair, two shocked voices which carried a perplexity were suddenly emitted from the mouths of both Xiao Yan and the Misty Cloud Sect’s Sect Leader, Yun Yun.</p><br/><p>After the words left their mouths, the both of them were startled. Their gazes took one look around them. They seemed to have sensed something and their expressions immediately underwent some changes.</p><br/><p>“Yun Zhi.”</p><br/><p>Xiao Yan’s gaze stared intently at the beautiful face, which had actually appeared a little flustered. A long while later, Xiao Yan appeared to have thought of something. He abruptly inhaled a deep cold breath. For some unknown reason, his heart had quietly become colder. His voice was trembling a little in anger, “I’m afraid that it would be more appropriate to call you the Misty Cloud Sect’s Sect Leader, Yun Yun, no?”</p><br/><p>“You…” Those pupils which were filled with dignity within the large hall earlier were now a little flustered and uncertain. Yun Yun laughed, “I didn’t think that the Xiao Yan whom Yanran had mentioned was actually you.”</p><br/><p>“Yun-er, are you acquainted with Xiao Yan?” Hearing the somewhat mindless conversation between the two, Yun Leng and the others around them were stunned. They faced each other. Beside them, Yun Shan furrowed his brows and could not resist interrupting.</p><br/><p>“Ah, we have met a couple of times. However, he had also hidden his true name, therefore…” Yun Yun appeared to be a little evasive as she softly replied.</p><br/><p>Xiao Yan’s heart slowly became disappointed upon hearing Yun Yun’s words. He mocked himself and shook his head. He then lifted it and said with a smile, “Yun Yun da-ren is the Sect Leader of the Misty Cloud Sect. I am but a nameless little fellow, how can we be acquainted? The person whom I knew was called Yun Zhi and not Yun Yun.”</p><br/><p>TL: da-ren : used to refer to someone respectfully/ an official of higher ranking</p><br/><p>The back of Yun Yun’s teeth bit her red lips. She stared at the young face which contained self ridicule. Those words of his caused Yun Yun to faintly have a pained feeling within her heart. Her hands within her sleeves had also tightened. The degree of strength used actually caused her fingers bone to become whiter.</p><br/><p>Yun Shan’s gaze swept back and forth between Xiao Yan and Yun Yun. The frown on his forehead became deeper. He could sense that something had definitely happened between the two of them.</p><br/><p>“Xiao Yan, I let you leave the last time. Why have you come to my Misty Cloud Sect this time. Moreover, you have humiliated our sect’s Elder in front of everyone. Do you really think that our Misty Cloud Sect is easy to bully? Although you have Queen Medusa supporting you, the old me would like to advise you to not go overboard in anything that you do. If you want to find soft persimmon to knead, you have come to the wrong place!” Yun Shan glanced at Queen Medusa behind Xiao Yan and shouted in a deep voice. There was a faint anger within his cry.</p><br/><p>Xiao Yan’s gaze indifferently shifted from Yun Yun toward Yun Shan. He coldly laughed, “Sect Leader Yun Shan, I’m afraid that you will have to ask First Elder Yun Leng for the reason that I have come to the Misty Cloud Sect, no?”</p><br/><p>Yun Shan’s expression changed slightly. He violently cut Yun Leng with his eyes before saying in a deep voice, “This time around, Yun Leng’s actions were merely a little impulsive. Moreover, he did not create much damage to your Xiao clan. I will send someone from the Misty Cloud Sect to compensate your clan for what has been damaged. Alright, if you have come because of that matter, you can leave.”</p><br/><p>“Ha ha,” Xiao Yan was startled when he heard Yun Shan’s words. He immediately and abruptly let out a laughter. There was a little savage killing intent within his laughter. In the next moment, Xiao Yan, who had lowered his head and let out a loud laughter, abruptly raised it. That delicate and handsome face was contorted with killing intent. “Yun Shan, I am only speaking to you this politely because I respect you as a senior. However, are you really ignorant or are you pretending to be ignorant? Do you really think that the old dog Yun Leng came to my Xiao clan merely to damage some buildings? Due to what he did this time, my entire Xiao clan was nearly exterminated. How can this consequence be completely offset by a casual mention or compensation by you?”</p><br/><p>The expressions of the few people in the sky changed slightly when they heard this. Yun Shan’s and Yun Yun’s expressions became a lot uglier. They did not expect that Yun Leng and the others had hidden so many things from them.</p><br/><p>“It is true that Yun Leng was a little overboard with regards to this matter. What compensation do you want? My Misty Cloud Sect will try our best to agree to them.” Yun Shan sternly said. This time around, his tone was a little softer perhaps because his side was in the wrong.</p><br/><p>“Compensation. All you know is compensation!” His reply sounded like thunder as a roar exploded forth and his face took on a ferocious expression.</p><br/><p>TL: All you know is compensation = you don’t know anything else/ it’s not the right solution</p><br/><p>Hearing this insult which was extremely blunt, all the Misty Cloud Sect members, including Yun Shan himself felt their heads become a little giddy. Given his status, when had he ever received such abuse? After feeling a little giddy, fury surged. Yun Shan’s expression had also become dark and solemn.</p><br/><p>“That old dog Yun Leng had chased after my father from the Xiao clan, planning to kill him. Even now, he has not returned, and we don’t know whether he is alive or not. If you don’t give me an explanation today, I will decimate the Misty Cloud Sect even if I have to gamble this life of mine!” Originally, Xiao Zhan’s disappearance had already caused Xiao Yan’s heart to be filled with killing intent and fury. Now that he had suddenly discovered Yun Zhi’s true identity, his heart became a little more fretful. Adding all this to was the total nonsense that Yun Shan had spoken, Xiao Yan’s heart, which already harbored killing intent combined with a ferociousness surging within it, finally erupted like a volcano.</p><br/><p>“Your father? Yun Leng never said that he hurt your father.” Yun Yun could not resist saying as she eyed Xiao Yan who was becoming increasingly wild.</p><br/><p>“Then do you mean that the truth which was witnessed by a few hundred members of the Xiao Clan was fabricated? In order to divert Yun Leng, those three old dogs, my father fled Wu Tan City by himself. Yun Leng and the two others gave chase. After this, my father never returned. If I don’t find the Misty Cloud Sect to settle this account, who would I find? Who? Tell me!” Xiao Yan’s expression was ferocious as he roared at Yun Yun.</p><br/><p>In so many years, this was the first time that she had been angrily roared at by some. Logically speaking, Yun Yun would have immediately become furious. For some unknown reason, however, she could not be even the slightest bit angry when faced with this person in front of her. She bit her red lips with the back of her teeth and turned her gaze toward Yun Leng. She angrily said, “Yun Leng, give me a clear explanation of this matter. Otherwise, I have the authority to get you to temporarily hand over the First Elder position!”</p><br/><p>“Sect Leader, I did not harm his father.” Some cold perspiration dripped from Yun Leng’s head as he hurriedly said, “Back then, we did indeed gave chase. However, when we were about to capture him at a certain dense forest, he had suddenly disappeared. After that, even though we searched the nearby region, we still did not find any trace of him.”</p><br/><p>“Suddenly disappeared?” Yun Yun knit her eyebrows slightly, clenched her teeth and scolded, “Xiao Zhan’s strength is merely that of the Da Dou Shi class. How can he disappear in front of you all with, one Dou Wang and two Dou Lings? If you want to lie, you should find a better excuse!”</p><br/><p>“I am also ignorant about this. But the truth is as such. If Sect Leader does not believe me, you can go and ask Yun Lei and the other. They also witnessed it with their own eyes. I can swear that I have not lied with regards to this matter.” Yun Leng smiled bitterly and said.</p><br/><p>Yun Yun and Yun Shan exchanged glances. They frowned intently. Even if they were to believe Yun Leng’s words, Xiao Yan would definitely not be willing to let things go like this. The two of them lifted their heads and indeed saw Xiao Yan’s expression gradually becoming completely dark and solemn.</p><br/><p>Xiao Yan’s gaze stared at Yun Leng in a dark and cold manner. The fury which had exploded within his heart caused him to no longer listen to any of the nonsense of the other party. He inhaled a deep breath of cool air and flipped both his hands. The huge Heavy Xuan Ruler disappeared from his palm. His right hand was gently extended out and a green colored flame curled upward in front of everyone's gaze.</p><br/><p>“If you don’t hand over the person today, I will destroy this place.” Xiao Yan stared at the green colored flame. The dark, black pupils of his reflected a ferocious green glow. The voice which was like him muttering to himself, contained a killing intent, causing the expression of everyone present to change slightly.</p><br/><p>“Xiao Yan, give me a few days. I will send people to help you search. If it is really as Yun Leng has said, your father’s life should not be in any danger.” Yun Yun hurriedly replied upon seeing that Xiao Yan had gone uncontrollably wild.</p><br/><p>“There is no need. I don’t trust the people from the Misty Cloud Sect anymore.” Xiao Yan gently shook his head. He lowered it and eyed the green colored flame seedling that was gently fluttering on his hand. “Today, I want the life of that old dog, Yun Leng.”</p><br/><p>“Xiao Yan, Yun Leng is indeed in the wrong with regards to this matter. However, isn’t it a little overboard for you to take his life just because of this?” Yun Shan said in a deep voice, “Moreover, even if you have the help of Queen Medusa, it is a little impossible to use your own strength to kill Yun Leng, no? I will not make a fuss of this matter today. Leave.”</p><br/><p>Xiao Yan eyed Yun Shan who had waved his hand and a ridicule spilled from the corner of his mouth. His left hand was slowly raised. With a shake of his hand, a thick white flame suddenly appeared in everyone's sight.</p><br/><p>“This ‘Heavenly Flame’?” The eyes of everyone present shrunk abruptly when they saw the custer of thick white flames.</p><br/><p>“Yun Shan, this is something that you have forced me to do.” Xiao Yan eyed the two different colored flames on his hand and softly muttered.</p><br/><p>His hands paused for a moment. Immediately, they began to slowly move toward each other in front of everyone's eyes.</p><br/><p>Outside the Misty Cloud Sect, a few flowing lights suddenly came flashing over. They immediately stopped on a huge tree. When their gaze swept toward the two kinds of ‘Heavenly Flame’ on Xiao Yan’s hands which were slowly being brought together, they could not resist inhaling a breath of cool air.</p><br/><p>“Heavens. This fellow is really crazy. Does he plan on completely destroying the Misty Cloud Sect? How did those idiots of the Misty Cloud Sect provoke him to this point?”</p><br/><p>Hai Bodong’s figure appeared on the top of a tree. He was stunned as he watched the green and white flame moving closer to one another. His voice was nearly dull as he mumbled.</p><br/>\n</div>"}