{"title": "Chapter 369: Advancement!", "id": 369, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-369-advancement", "volume_title": "Volume 4", "body": "<h1>Chapter 369: Advancement!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 369: Advancement!</u></strong></p><br/><p>His body was within a furnace: this was the only thing that Xiao Yan currently felt.</p><br/><p>After swallowing the medicinal pill, a fiery feeling suddenly erupted from his lower abdomen. Immediately, it turned into numerous streams of heat that forced their way into every vein of his body in a turbulent manner. The high temperature finally caused a faint, heavy gas to appear within his Qi Paths.</p><br/><p>The high temperature streams gradually became hotter with the increase in the circulation speed, resulting in the corner of Xiao Yan’s mouth gently twitching involuntarily after each complete cycle. What Yao Lao said was true, the small part of his flame that had been added to the pill really caused him to suffer.</p><br/><p>While the hot flow may have caused Xiao Yan to feel some pain, the effect was also very notable. As the threads of faint, hot, heavy gas seeped out of his Qi Paths and finally circled around the interior of his body, Xiao Yan could clearly sense that large waves of concealed energy within some parts of his body were like a layer of ice that had been melted by the heat, finally revealing itself. From the looks of it, it seemed that this was the medicinal strength that had been deposited in his body that Yao Lao had mentioned.</p><br/><p>This medicinal strength that had been deposited was vaporized by the hot, heavy gas; turning it into a faint energy fog which rose slowly. The fog would adhere itself to the Qi Paths, merging with them before continuing through the rest of the Qi Paths. In the end, it formed a complete cycle, turning the fog into pure energy. The energy was then poured into that rhombus-shaped energy crystal within the vortex. Upon receiving these waves of pure energy, the crystal body, which appeared a little dim due to over exhaustion, once again emitted a faint glow, lighting up the interior of the vortex until it appeared to be transparent.</p><br/><p>Some of the misted energy also adhered to his bones and cells. When faced with such pure energy, the bones and cells in his body had also become much greedier. With a wiggling speed that could not be seen by the naked eye, they swiftly swallowed the energy fog that came close. Once they had completely swallowed the energy, Xiao Yan could clearly sense that his bones, muscles, cells, etc., which had been injured after the big fight, were quickly being restored to their peak condition.</p><br/><p>Xiao Yan’s heart gave a gentle sigh of relief as he sensed the Dou crystal being gradually filled with energy. His mind once again settled down as he used all his strength to control the overflowing clouds of energy within his body, gathering them together and finally agglomerating them into a turbulent energy flow. Once the flow completed one circulation within his body, it was poured unceasingly toward the Dou crystal within the vortex. The thumb sized crystal was like a bottomless pit when faced with the energy which was being poured into it unceasingly, not rejecting any of it, regardless of how large the accumulated energy was.</p><br/><p>The medicinal pill of Yao Lao may not be something high-tiered. However, it was able to perform a sort of instigative role, completely dragging out all of the medicinal strength which Xiao Yan had deposited into his body over a short period of time. After which, it used this large amount of energy to swiftly restore Xiao Yan’s injured body. This method of leveraging another’s energy to heal was likely something that even Fa Ma would have difficulty performing.</p><br/><p>As an orthodox ‘Medicinal Pot’, the number of various medicinal pills which Xiao Yan had consumed were basically impossible to count. Moreover, Xiao Yan did not completely absorb most of these medicinal pills. After accumulating all of these over time, the energy deposited was naturally very large. After being dragged out by that medicinal pill of Yao Lao, the deposited medicinal strength was finally completely released and used. The extent of the energy had far exceeded what Xiao Yan, or even Yao Lao had expected.</p><br/><p>TL: Medicinal Pot = someone who eats a ton of pills, usually used to describe the sick/young masters</p><br/><p>Wave after wave of energy mist rose never endingly from all over Xiao Yan’s body. If anyone could currently see through his skin and look within Xiao Yan’s body, that person would likely widen his eyes while being completely shocked as he saw all the fog that had gathered throughout Xiao Yan’s body. Even his internal organs were completely covered by the dense energy fog.</p><br/><p>Xiao Yan was naturally unable to take control of every detail with such a large amount of energy fog being drawn out. Therefore, there were some that managed to escape and began to randomly wander through his body. In an instant, those bones, muscles, etc., within Xiao Yan’s body appeared to suddenly possess their own intelligence and began to use various different kinds of methods to swallow the energy fog that had wandered over.</p><br/><p>Although swallowing the energy in this manner allowed Xiao Yan to clearly sense that his body was becoming increasingly stronger, the parts in Xiao Yan’s body, the bones, muscles, and internal organs had an accommodation capacity that could only be increased if one were to undergo intense training. Thus, each one had their own limits. Once they absorbed more than that limit, it was likely that they would end up with the terrifying fate of bursting apart. Upon thinking of the final result of how the bones or internal organs, etc., could suddenly form a few crack lines with a ‘crack’ sound, Xiao Yan shuddered with fear.</p><br/><p>Therefore, he naturally did not dare to allow the bones and muscles to swallow as much of the energy as they wanted. He immediately and hurriedly increased his control over the energy fog within his body. Even after he did this, however, Xiao Yan could still faintly sense that his skin was emitting a fiery pain. He knew that this was due to the energy fog having already corroded the surface of his skin.</p><br/><p>Within the mountain cave, Yao Lao frowned slightly as he watched Xiao Yan’s skin, which had actually turned red. He muttered softly, “Why has this little fellow’s body accumulated so much medicinal strength?” He mused for a moment before temporarily storing the broken jade fragment in his hand. He flicked his finger gently and a green light uncurled and rose immediately. It followed the wind and expanded, finally turning into a green lotus which slowly fell.</p><br/><p>Yao Lao glanced at the magnificent-looking green lotus before waving his sleeves toward Xiao Yan. A gentle force slid across and lifted the latter before smoothly placing him on the green lotus.</p><br/><p>After Xiao Yan landed on the green lotus, a warm, green-colored circular glow slowly rose from within it. As the circle of light rose, Xiao Yan’s fiery red skin immediately became dull. His face, which had contained some pain also finally became relaxed.</p><br/><p>The warm feeling that was transmitted from outside Xiao Yan’s body was also sensed by him. He immediately sighed in relief as he muttered to himself with a bitter smile, “Dammit. The injuries in my body have already completely recovered. Why is there still so much excess energy?”</p><br/><p>Xiao Yan gradually recovered his calm after letting out a curse. He quietly thought for a while and already had a plan. “Since there is such external strength, I will use it to break through. This opportunity is the best one!”</p><br/><p>Once Xiao Yan made up his mind, he did not procrastinate any longer. His focused his mind and the energy fog which was overflowing from his body suddenly surged. The waves of fog appeared to have been towed by something as they were swiftly dragged toward his lower abdomen.</p><br/><p>As the enormous energy fog became increasingly close to the vortex, its size also drastically decreased. Its size may have become small, but some moisture began to appear in the space between the fog. When the large clump of fog entered into his Qi Paths, the fog actually completely disappeared. Replacing it was a cluster of emerald-like pure liquid energy. There were even some solid, tiny crystals that were trapped within that liquid energy.</p><br/><p>The emerald liquid followed the same route that was determined by the ‘Flame Mantra’ Qi Method and completed one full circulation. After which, it quietly stopped at the entrance of the vortex. The force which was slowly flowing was like a huge flood which was about to be discharged.</p><br/><p>“This will determine whether or not I can break through.”</p><br/><p>Xiao Yan whispered softly in his heart as he eyed the huge cluster of emerald energy. With a thought from his mind, the strength which was blocking the entrance of the vortex instantly disappeared. The surging energy immediately emitted a loud sound like that of a waterfall smashing down as it charged into the vortex.</p><br/><p>The large amount of energy swarmed into the vortex and violently smashed against the rhombus-shaped Dou crystal in the middle of the vortex.</p><br/><p>“Bang!” The moment the energy swarmed into the Dou Crystal, a roaring sound resounded within Xiao Yan’s mind. In an instant, he had nearly failed to even maintain his training state.</p><br/><p>The turbulent energy poured into the Dou Crystal unceasingly. By the end of the process, the size of the crystal had actually grown a lot larger after absorbing this large amount of energy.</p><br/><p>Following the expansion of the Dou Crystal’s size, Xiao Yan’s strong spiritual perception could clearly sense that his own strength was swiftly soaring toward the barrier that indicated the difference between the two levels.</p><br/><p>Within the cave, Yao Lao eyed Xiao Yan, whose face had become as shiny as jade. He fondled his beard and nodded slightly. With his strength, he could naturally sense the strength of Xiao Yan’s breath rising steadily.</p><br/><p>“Ding.” At a certain instance within the quiet cave, a soft groan, that was barely noticeable, was quietly emitted from Xiao Yan’s body.</p><br/><p>Following the appearance of this quiet moan, the force exuded from Xiao Yan’s body suddenly soared greatly.</p><br/><p>“He has already broke through to a two star Da Dou Shi? This is actually even faster than what I had expected. The medicinal strength deposited within this little fellow’s body is actually able to reach this large of a degree?” With Yao Lao’s strength, that soft moan would naturally not be able to escape his senses. An expression of shock immediately flashed across his eyes as he spoke in surprise.</p><br/><p>Given Xiao Yan’s current strength, he would originally would have needed at least two or three months of time to raise his strength by one level if he trained normally. Moreover, this was already considered to be quite fast. After he had gone to the Misty Cloud Sect, the repeated fighting with those above his level caused him to end up in unfavorable situations many times. However, the benefits that Xiao Yan obtained from those situations was something that even Yao Lao hadn’t been able to completely estimate.</p><br/><p>Fighting was, after all, the best way to quickly raise one’s strength. The extreme battles which Xiao Yan had experienced during this period of time were like having constructed a canal. The large amount of medicinal strength currently present was like water being poured into that canal. Now that everything had fallen into place, this was the perfect opportunity for Xiao Yan to raise his strength. This process ran so perfectly that it had even exceeded Yao Lao’s expectations.</p><br/><p>Not long after Yao Lao’s surprised voice fell, another soft groan was suddenly emitted from within Xiao Yan’s body, reverberating etherally within the cave.</p><br/><p>Yao Lao’s hand which was fondling his beard slowly paused. This time around, even Yao Lao could not keep his cool. His mouth was agape as he watched Xiao Yan, whose breath was actually still rising swiftly. A long while later, he finally let out a long sigh and smiled as said, “Hee, he is indeed a fellow that is full of surprises. Today, I really want to see what level you, this little thing, are going to reach?”</p><br/>\n</div>"}