{"title": "Chapter 366: The Big Fight Between Dou Zongs!", "id": 366, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-366-the-big-fight-between-dou-zongs", "volume_title": "Volume 4", "body": "<h1>Chapter 366: The Big Fight Between Dou Zongs!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 366: The Big Fight Between Dou Zongs!</u></strong></p><br/><p>Following the numerous strands of wild wind agglomerating around him, the white glow on the tip of Yun Shan’s finger grew increasingly eye-piercing. In its completed form, it was almost like a dazzling sun high up in the sky.</p><br/><p>“Wind’s Peak: Killer Meteorite!”</p><br/><p>At that instant, the air surrounding Yun Shan instantly solidified. His finger suddenly pointed at Xiao Yan. With a stern cry, the white glow emitted a bright flash and an extremely narrow ray of light explosively shot out.</p><br/><p>The speed of the ray of light was so fast, that it was somewhat frightening. Wherever it passed, the air became disturbed and distorted. A dark, black trace stained the blue sky, appearing extremely eye-piercing.</p><br/><p>This terrifying Dou Technique was something that Yun Yun had used before when she fought with the Amethyst Winged Lion in the past. This attack had directly cut off an Amethyst Winged Lion’s horn, which was the hardest part of its body, which also possessed the strength of a Dou Huang. From this, it could be seen just how terrifying the piercing strength of this mysterious Dou Technique was. Moreover, the Dou Technique was currently displayed by Yun Shan. Regardless of whether it was momentum or the extent of the strength of the force, the Dou Technique this time had far surpassed the power that Yun Yun had displayed back then.</p><br/><p>Once ‘Wind’s Peak’ appeared, the expressions of Jia Xing Tian and the others far away from the battleground changed at almost the same time. Immediately, they hurriedly pulled back a very great distance as though they were fleeing. From the looks of it, they already knew how frightening this Dou Technique was. They might even have personally gotten a taste of it before.</p><br/><p>Only Xiao Yan, and Queen Medusa in the sky could remain still with expressions that did not change.</p><br/><p>‘Xiao Yan’ indifferently watched the white-colored ray of light that instantly broke through the air and shot toward him. He lifted his hand gently. The thick white-colored flame shrouding his finger suddenly rose and flared up. In the blink of an eye, it completely wrapped his body within it. His right hand was extended and the huge Heavy Xuan Ruler once again appeared in his palm. It was gripped abruptly and tightly as an eye-piercing, intense light erupted from the dark, black body of the ruler.</p><br/><p>The intensity of the bright light on the ruler’s body grew increasingly extreme. In the end, it was almost like a bright sun that caused people to be afraid to look at it directly.</p><br/><p>With a serious expression, Xiao Yan let out a low cry. The heavy ruler in his hand abruptly hacked ferociously downward toward Yun Shan, who was a short distance away.</p><br/><p>“Flame Splitting Tsunami!”</p><br/><p>The cry resounded throughout the sky. A crescent-shaped, white-colored energy blade that was thirty feet in length shot explosively out of the tip of the Heavy Xuan Ruler.</p><br/><p>The huge, flaming white, crescent blade energy projectile shot across the skyline, disappearing in a flash. That hot feeling which suddenly appeared almost caused the people in the battleground to be in a wave of fire.</p><br/><p>The curved blade of energy carried numerous ear piercing explosions as it cut across the skyline. That indomitable strength even had the tendency of wanting to split the sky into half.</p><br/><p>The Dou Technique displayed was the same one, but the ‘Flame Splitting Tsunami’ this time around was at least ten times stronger than the one that Xiao Yan had displayed at the Misty Cloud Sect back then! This was the gap created by the difference in one’s strength!</p><br/><p>The crescent moon-shaped blade cut through the distant air. Under the watch of countless gazes, it finally collided with the white-colored energy beam that was shooting across the sky in a lightning-like manner. In an instant, a thunder-like roar exploded into the blue sky. Terrifying energy waves began surging out from the point of collision. That enormous pressure actually caused some of the people standing in the square to be directly pressed into a fetal position.</p><br/><p>“Is this the strength of a Dou Zong? It is indeed extremely extraordinary.” Even though Jia Xing Tian and the others were a great distance away, the energy waves that came toward them still caused their expressions to change slightly as they once again pulled back even further. After steadying himself, Jia Xing Tian lifted his head and eyed the spot where the two people were fighting with heated gazes. No matter how one put it, he was an extremely strong person who had already taken half a step into the Dou Zong class. However even if it were so, if he were faced with a true Dou Zong, he would still feel an enormous gap which was difficult to cross.</p><br/><p>“I’m afraid that the current Xiao Yan also has the strength of a Dou Zong, no? Otherwise, it would definitely be impossible for him to blow away Yun Shan’s ‘Wind’s Peak’. It should be known that when Yun Shan was still a Dou Huang back then, he had used this move to kill two strong people of the his strength from the Chu Yun Empire.” Fa Ma’s face was grave as he said.</p><br/><p>“I don’t know if you have realized, but ever since Xiao Yan’s strength suddenly soared, he has merely used that thick white-colored ‘Heavenly Flame’. He did not use even a little of that green-colored flame.” Fa Ma suddenly said. As an alchemist, it was natural for him to be extremely attentive toward flames.</p><br/><p>“Yes. But the manner in which the current Xiao Yan uses to control that white-colored flame is clearly much more refined compared to earlier.” Jia Xing Tian nodded his head and replied.</p><br/><p>“This fellow is really someone whom others cannot figure out.” Fa Ma mused for a moment, but did not even have the slightest clue. He could only shake his head and speak with a bitter smile.</p><br/><p>Jia Xing Tian nodded his head, completely sharing the same opinion. He immediately raised his head and watched the spot where the energy ripples were gradually disappearing. When he saw that Xiao Yan was still standing in midair unscathed, he said, “Looks like it is a little difficult for Yun Shan to hold Xiao Yan behind today. Moreover, there is still Queen Medusa, whose strength is not weaker than Xiao Yan’s, lurking by the side. If these two people were to combine their strength, even Yun Shan can only turtle up and hide.”</p><br/><p>“The current Yun Shan is also in a stubborn situation and has no choice but to continue. The First Elder of the Sect was killed by someone in front of so many people. Regardless of the other party’s strength, he must take action. Otherwise, the Misty Cloud Sect will greatly lose face if this news were to spread. After all, this matter is different from last time.” Fa Ma sighed, “Moreover, the enmity between both parties has already been completely formed. With Yun Shan’s character, he would definitely not let a future enemy with such terrifying potential leave successfully.”</p><br/><p>“This matter was also something that Yun Leng asked for. He had nothing to do and still ran to Wu Tan City to go against the Xiao clan. Isn’t this forcing Xiao Yan to become crazy? He thinks that he can do whatever he wants by using the Misty Cloud Sect’s name, but he never expected that he would meet a ruthless figure this time around.” Jia Xing Tian said faintly.</p><br/><p>Fa Ma smiled bitterly and shook his head. He did not voice any opinions regarding this matter. Instead, he lifted his head and watched Xiao Yan’s and Yun Shan’s bodies, which had reappeared and muttered softly, “Ah, I hope they will not cause any injuries or deaths. Otherwise, it would be a great loss to the Jia Ma Empire.”</p><br/><p>“Heh, the Sect Leader of the Misty Cloud Sect is only so-so.” Xiao Yan gently flicked his sleeves in the sky, scattering the final assaulting energy ripple that had spread toward him. A cold smile surfaced on his delicate and handsome face.</p><br/><p>Yun Shan’s expression was icy cold as he watched Xiao Yan who was actually unhurt. A long while later, he slowly inhaled a breath of air and said in a cold voice, “The current you is indeed very strong. However, I believe that there will always be a price for overdrawing your strength. My strength belongs to myself while your strength is borrowed or drawn excessively from yourself. As long as I delay you today, I don’t believe that you can continue to maintain this strength!”</p><br/><p>“The relationship between both sides has already reached a point where it is difficult to reconcile. Therefore, I will not let someone who could truly become a Dou Zong to successfully escape and continue to grow while carrying hatred for the Misty Cloud Sect within him before finally returning to obliterate my Misty Cloud Sect!” A thick and cold killing intent had actually began to shroud Yun Shan’s words.</p><br/><p>The entire place was completely silent. The words of Yun Shan undoubtedly expressed his intent to kill Xiao Yan. This was because he clearly understood that should Xiao Yan successfully escape, it would definitely be allowing the tiger to return to the mountains. In the future, the Misty Cloud Sect might pay an extremely great price for letting him escape.</p><br/><p>TL: letting a tiger return to the mountains - idiom - letting a dangerous person escape and giving it the chance to exact revenge in the future</p><br/><p>The expression of ‘Xiao Yan’ changed slightly. These words of Yun Shan were true. Although Xiao Yan was currently being controlled by Yao Lao, the latter could not truly and completely control Xiao Yan’s body. Moreover, the ‘Angry Buddha Lotus Flame’ that Xiao Yan had used earlier had exhausted quite a lot of Yao Lao’s Spiritual Strength. If it were not for the ‘Seven Magical Green Spirit Saliva’, it was likely that this ‘Angry Buddha Lotus Flame’ would have caused Yao Lao to enter into a weakened state once again.</p><br/><p>Even though Yao Lao did not enter into a weakened state because of the ‘Seven Magical Green Spirit Saliva’, it was also as Yun Shan had said. He could not really borrow Xiao Yan’s body to fight with Yun Shan for a long period of time. Once the time limit was up, he could only withdraw his Spiritual Strength. When that time comes, Xiao Yan, who had lost his protection, would definitely have difficulty escaping death.</p><br/><p>“Teacher, let’s first leave this place. Yun Shan is very strong. The current us is not able to directly attack him. Moreover, the time that you can appear is also not very long.” A weak voice suddenly sounded in ‘Xiao Yan’s’ mind.</p><br/><p>“Ke ke, relax. Although my current strength has weakened greatly, wanting to stop me with just Yun Shan alone is wishful thinking.” The old laughter comforted Xiao Yan’s emotions.</p><br/><p>“However, it is indeed not suitable to go head on against him in today’s circumstances. The united formation of the Misty Cloud Sect is a little marvellous. Once it’s activated, it would be much more troublesome to leave. Although that Queen Medusa appears to be helping you, she would definitely be unwilling to join hands with you to kill Yun Shan. A counterattack by a Dou Zong just before his death is no trivial matter. It is impossible for her to take such a big risk just because of you.” Yao Lao mused for a moment before saying softly.</p><br/><p>“Alright, today, I will not be overly entangled with him. Let’s leave here first. We will return here in the future, and teacher will definitely help you seek justice!”</p><br/><p>“Ke ke, after leaving this time around, it may be a very long time before I return to the Jia Ma Empire. When that time comes, let me, your disciple, do it. At that time, my father’s disappearance and the humiliation of the clan being forced to move will be settled by me, myself.” The weak voice contained a faint vengeance. His father’s disappearance had caused Xiao Yan to completely place this hatred and fury on the Misty Cloud Sect. If it were not because of them, Xiao Zhan would not have been chased out of Wu Tan City and would naturally not suddenly disappear. Moreover, when he was killing Yun Leng, the Misty Cloud Sect’s hindrance as well as the killing intent that Yun Shan had displayed earlier had caused Xiao Yan to completely feel an abomination toward this sect.</p><br/><p>“Ha ha, it is naturally good to have this pride.” Yao Lao smiled, feeling gratified. He said, “Since it’s like this, let us leave this place first. I cannot maintain control of your body much longer.\"</p><br/><p>In the sky, ‘Xiao Yan’ slowly lifted his head. His gaze took one look around and laughed loudly towards Yun Shan, “I have told you earlier that if I want to leave, there is no one in your Misty Cloud Sect who can stop me.”</p><br/><p>“Arrogant. Do you really think that our Misty Cloud Sect has relied on an undeserving reputation to stand in the Jia Ma Empire for so many years?” Yun Shan pulled slightly at the corner of his mouth. He suddenly waved his sleeves and a few white glows shot out from his sleeves. These white glows were scattered toward four corners of the sky. A short while later, the glow bursted brightly. A countless number of white threads were extended. In merely the blink of an eye, these white threads had covered the entire sky, finally forming a net that appeared and disappeared, shielding the entire sky.</p><br/><p>“All Elders of the Misty Cloud Sect listen up. Form the ‘Covering Sun Cloud Formation’!”</p><br/><p>With a stern cry, nearly twenty figures stood and flashed from the square. The glow immediately brightened greatly. White-colored mist pervaded from the bodies of these Elders. Finally, they agglomerated into a sea of clouds in the sky, just like the last time. The only difference was that Yun Shan was the one in the middle of the sea of clouds.</p><br/><p>The last time, Yun Leng, who was of the Dou Wang class, had relied on the ‘Covering Sun Cloud Formation’ to contend with Hai Bodong who was of the Dou Huang class. Now, the person controlling the formation had been replaced by Yun Shan, who had the strength of a Dou Zong. Without any doubt, the so called ‘Covering Sun Cloud Formation’ this time around would be even more terrifying.</p><br/><p>“Withdraw!” Before the ‘Covering Sun Cloud Formation’ was formed, Yao Lao controlled Xiao Yan’s body and appeared at where the white-colored energy was in a lightning-like manner. The thick white flame surged out from his palm and smashed ferociously against the white cloud.</p><br/><p>“Bang!” The thick white flame smashed into the white-colored energy, but it actually failed to break it in one blow. Instead, it was reflected by the soft feeling on it.</p><br/><p>“It is indeed a little bizarre.” Yao Lao let out an ‘eh’ sound as he waved his hand and once again summoning out a cluster of thick white flame. After which, he tightly adhered it onto the white colored energy barrier. This time around, the flame did not bounce back. The hot temperature caused the white energy to become a little illusionary.</p><br/><p>“You want to leave? It won’t be so easy!” Just as a hole was about to be incinerated out of the white barrier, a cold cry of Yun Shan sounded from behind ‘Xiao Yan’. As this cold cry was transmitted, there was a majestic force that was mixed with a sonic boom.</p><br/><p>Yao Lao instantly turned around. He eyed the white-colored energy force that was swiftly shooting toward him. He waved his sleeves and a huge cluster of thick white flames surged out from his sleeves. Immediately, it swiftly began to agglomerate into an ice mirror that appeared to have been formed from white fire. In addition, there was a white flame which was curling upward being adhered to the surface of the ice mirror. The ice and flame merged, mutually, surviving in one body, giving it an extremely strange appearance.</p><br/><p>“Bang!”</p><br/><p>That energy pilliar smashed heavily into the ice mirror. When the two came into contact, the white-colored flame pounced turbulently forward. Any of the energy that had become contaminated by the flame was instantly frozen into solid ice pieces.</p><br/><p>Although the white-colored flame was extremely strange, the force that was contained within the energy pillar was really too large. Therefore, when the white-colored flame had climbed to around half of the energy pillar, its energy was exhausted. Immediately, it was smashed into nothingness by the energy which was surging from the back.</p><br/><p>The energy pilliar broke through the white-colored flame and violently smashed onto the ice mirror. Immediately, the latter began crumbling. Numerous crack lines covered the ice mirror which finally broke apart with a ‘crack’ sound, turning into pieces of ice that permeated the air.</p><br/><p>“Even if you have the help of the ‘Heavenly Flame’, it will not be an easy thing to leave today!” Yun Shan’s body was suspended in the sea of clouds. The rich energy around him caused Yun Shan’s body to emit a faint glow. He coldly watched Xiao Yan and his hands were swiftly rotated. The fog in front of him wiggled. A moment later, an enormous cloud bow, which was once summoned by Yun Leng, once again surfaced. This time around, the size of the cloud bow was nearly a few times larger than it had been the previous time. At a glance it appeared that the huge bow was one that could be used to shoot the sun down.</p><br/><p>“This ‘Covering Sun Cloud Formation’ is indeed a little troublesome.” Yao Lao frowned slightly as he eyed that huge cloud bow. His gaze swept in all directions. Suddenly, he said something softly to Xiao Yan in his heart.</p><br/><p>A moment later, after Yao Lao had instructed some things, his body suddenly trembled lightly and immediately disappeared from midair.</p><br/><p>Yao Lao’s disappearance did not cause Yun Shan’s expression to change. He slowly closed his eyes and his hands formed the shape of drawing the bow. After which, his body slowly swayed, as if Yun Shan was relying on his senses to search for the target to attack.</p><br/><p>The sky suddenly descended into silence.</p><br/><p>However, the silence did not persist for very long before it was suddenly broken. Yun Shan, who had shut his eyes abruptly opened them. The hand which he used to pull the bow no longer hesitated. He relaxed his finger and following its release, the large cloud arrow on the huge cloud bow in front of him cut through the cloud layer with a ‘Chi’ sound. It shot viciously toward a certain empty space.</p><br/><p>The cloud arrow transformed into a white-colored flowing ray of light that instantly cut through the skyline. Just as it was about to strike that empty space, a turbulent thick white flame suddenly swept out, much like the flames of heaven descending and turned into a ripple shape that spread in all directions.</p><br/><p>“Bang!”</p><br/><p>When the two came into contact, another loud sound appeared. However, the thick white flame did not appear to have much effect this time around. It merely blocked the arrow for an instant before the terrifying cloud arrow broke through the flame. With a ‘xiu’ sound, it passed through a certain empty space. Unfortunately, not even a part of a human figure appeared. Similarly, there was not the slightest fresh blood appearing.</p><br/><p>Yun Shan’s gaze stared intently at the spot where the cloud arrow shot past. When he saw that the cloud arrow had struck empty space, he was startled. His expression immediately and abruptly changed. He suddenly turned around and moved his hands. The surrounding fog swiftly agglomerated. An instant later, it formed a huge cloud colored shield in front of him.</p><br/><p>The moment the white-colored cloud shield formed, a black figure suddenly flashed, and appeared from within the sea of clouds. The figure coldly watched Yun Shan who was behind the transparent cloud shield. As both of his hands moved, a green and white-colored flame actually appeared in his palm at the same time.</p><br/><p>Yun Shan’s body trembled as he looked at the two flames. His gaze looked directly at the young man’s pair of eyes. He immediately noticed that the green and white color in his eyes had actually once again turned back to being a dark, black color. As he watched those dark black pupils, Yun Shan, for some reason, suddenly thought that the current Xiao Yan had perhaps returned to his true self.</p><br/><p>“Since you want me to stay, then try the taste of this fire lotus!” The corner of Xiao Yan’s mouth lifted slightly as he spoke with a dark and cold smile. Earlier, Yao Lao had quietly informed him that once they were in close proximity, Xiao Yan should display his fiercest attack. This was because only Xiao Yan was able to control the ‘Angry Buddha Lotus Flame’!</p><br/><p>TL Arron: Angry Buddha Lotus Flame is a cheat...</p><br/><p>As the laughter fell, Xiao Yan’s hands abruptly smashed heavily together. With Yao Lao’s strength supporting him this time around, the speed at which the two colored flames merged was many times faster compared to the one earlier. In a muffled thundering sound, a green-white flame, that was around the size of a palm, swiftly rose from the middle of Xiao Yan’s palm.</p><br/><p>“Go!” The arc on the corner of Xiao Yan’s mouth grew increasingly big. He let out a soft cry and the flame immediately shot over. Finally, it heavily smashed into the cloud colored shield in front of Yun Shan’s slightly squinting eyes.</p><br/><p>“Bang!”</p><br/><p>Although the ‘Angry Buddha Lotus Flame’ this time around was not created as perfectly as the one prepared with great effort the last time, Yao Lao’s powerful strength was integrated into it. Therefore, its strength was not any weaker than the ‘Flame Splitting Tsunami’ which Yao Lao had personally displayed earlier.</p><br/><p>Following the thunderclap-like explosion being blasted, a fire lotus once again surfaced from within the sea of clouds. The cluster of energy clouds in the surroundings that were completely made up from energy had also become blurry from this attack.</p><br/><p>Yun Shan’s body swiftly descended. His expression was a little pale. An explosion at such a close proximity nearly caused him to receive the full impact of the fire lotus. Therefore, even though he had the cloud shield protecting him, he was still shaken until he had to leave the sea of clouds. Moreover, once he left the sea of clouds, he would naturally no longer be able to use the large formation.</p><br/><p>Countless Misty Cloud Sect disciples in the square watched Yun Shan, who was shaken by Xiao Yan’s attack until he actually had to leave the sea of clouds. They exchanged glances with one another and were speechless. For some unknown reason, a cold feeling rose from within their hearts.</p><br/><p>“Grand-teacher.” When she saw Yun Shan descending, Nalan Yanran’s delicate hands could not resist covering her red lips as he cried out involuntarily.</p><br/><p>“It is really worthy of being a fight between Dou Zongs. If we were in such close proximity to the fire lotus explosion, we would most likely lose half of our life, no?” Fa Ma smiled bitterly and said.</p><br/><p>“I thought that Xiao Yan could no longer use the green-colored flame. He has actually left it as a means to escape.” Jia Xing Tian shook his head and sighed.</p><br/><p>“Xiao Yan’s strength appears to have become much weaker with the flow of time.” Fa Ma suddenly knit his eyebrows. As a tier five alchemist, his Spiritual Perception had far exceeded an ordinary Dou Huang’s. Therefore, he had promptly sense the slight change of Xiao Yan.</p><br/><p>Xiao Yan hesitated for a moment in the sky after he struck Yun Shan down from the sea of clouds. He abruptly clenched his teeth and his feet stepped gently on the empty air. His body fell abruptly and immediately shot explosively toward Yun Shan.</p><br/><p>“Today, I will collect some interest!” Two colored flames swiftly shrouded both his hands. Xiao Yan swiftly approached Yun Shan who was falling. At this moment, the latter had been shaken by the terrifying explosion earlier until the Dou Qi in his body could not be connected. Hence, he could only watch as Xiao Yan approached.</p><br/><p>“Old Fellow, since you have already given the order to chase and kill me, then I will kill you first!” A cold laughter sounded as Xiao Yan’s hands heavily smashed toward Yun Shan’s chest. Just as he was about to succeed, a panicked voice suddenly sounded, “Xiao Yan, no!”</p><br/><p>When the voice sounded, a force also swiftly came attacking Xiao Yan’s back. He frowned slightly, turned his body and waved his hand gently. A white-colored flame shot out and incinerated the sharp sword aura until nothing was left. His eyes were cold as he watched Yun Yun who was holding a longsword in her hand as she was suspended in empty space. He said with a cold smile, “You also want to attack me?”</p><br/><p>“I am the Sect Leader of the Misty Cloud Sect. I must protect the Misty Cloud Sect’s reputation. Moreover, Yun Shan is my teacher. I cannot just watch you hurt him.” Yun Yun said with a bitter smile.</p><br/><p>“Do you think that I have any chance of surviving if I were to fall into his hands today?” Xiao Yan mocked.</p><br/><p>Yun Yun was silent. There was a struggle on her pretty face.</p><br/><p>Xiao Yan’s hands trembled slightly. He inhaled a deep breath of air, turned around suddenly and waved his hand, wanting to throw a flame toward Yun Shan who was falling.</p><br/><p>Seeing Xiao Yan’s action, Yun Yun clenched her white teeth. She flapped the wind wings on her back and stabbed the longsword in her hand toward Xiao Yan’s back. No matter what, her position as the Sect Leader caused her to always remember the reputation of the sect. It was impossible for her to simply watch the reputation of the Misty Cloud Sect that was built up over a few generations be terminated by Xiao Yan.</p><br/><p>The cold wind that was transmitted from behind his back caused Xiao Yan’s heart to quietly become much colder. Perhaps he was somewhat insignificant in her heart when compared to the Misty Cloud Sect.</p><br/><p>Xiao Yan sighed softly in his heart. He slowly shook his head and gave up chasing and killing Yun Shan. He turned around and watched the attacking Yun Yun indifferently.</p><br/><p>“Be careful!”</p><br/><p>At the moment when Xiao Yan turned around, two hurried cries suddenly sounded. One came from Yun Yun’s mouth while the other was a warning from Yao Lao in his body.</p><br/><p>The cry had just sounded when Xiao Yan also sensed something. He hurried to turn his head and a white figure flashed across his pupils. A dense and thick face immediately appeared. It was shockingly Yun Shan who had been falling!</p><br/><p>“It’s over, Xiao Yan!”</p><br/><p>A fist that carried a sonic boom and an enormous force of pressure caused ripples to appear in the space surrounding the fist. The fist that was wrapped in fog violently smashed against the back of the unprepared Xiao Yan like a lightning storm in front of Xiao Yan’s tightly narrowed pupils.</p><br/><p>“Glug!”</p><br/><p>The enormous force that was transmitted from his back caused Xiao Yan’s expression to pale. A mouthful of fresh blood was finally involuntarily spat out. Borrowing the pushing force from this great strength, Xiao Yan’s body shot explosively backward.</p><br/><p>“Huh.” The situation in the sky had actually changed suddenly in a split second. This change caused the faces of everyone below to be stunned.</p><br/><p>“Yun Shan, with your position, you actually launched a sneak attack. You actually have the face to do so?” Hai Bodong could not resist shouting angrily as his face changed while he looked at Xiao Yan who had vomited blood and pulled back.</p><br/><p>At the side, Jia Xing Tian and the others also frowned slightly. Clearly, they did not approve of Yun Shan’s action, but they did not open their mouths to say anything.</p><br/><p>Yun Shan’s face was cold as he ignored Hai Bodong. He clearly knew just what kind of terrifying potential Xiao Yan possessed. If he were allowed to leave, the Misty Cloud Sect might really be destroyed in his hands in the future. Therefore, even if he had to bare some notoriety, he must kill Xiao Yan today!</p><br/><p>While the sound of wind whizzed past his ear, Xiao Yan wiped the blood stain from the corner of his mouth. His eyes coldly eyed the pale faced Yun Yun. He flipped his hand and a pale-blue colored inner vest appeared in his hand. He held the inner vest and shook his head in self-ridicule. After which, he violently threw it toward Yun Yun.</p><br/><p>“Regardless of whether you are Yun Zhi or Yun Yun, we no longer have any relationship in the future! I will return this thing to you!”</p><br/><p>The decisive words were wrapped by Dou Qi and coldly transmitted into Yun Yun’s ears. Immediately, the already pale face of the latter became even more pale.</p><br/><p>As a reflexive condition, she extended her hand to receive the pale blue inner vest that was shot over. The back of her teeth bit her bottom red lip. She lowered her head and watched the inner vest which was wiped clean despite being covered with crack lines. For a moment, she was completely dull.</p><br/><p>Xiao Yan’s body collided heavily into the white-colored energy barrier. Two colored flames surged turbulently out of his back. The two flames intertwined with one another and the white colored energy swiftly melted. Immediately, Xiao Yan was like a two colored falling star as he smashed into the dense forest of the mountain where one could not see the edge.</p><br/><p>“Ha ha, Yun Shan, I, Xiao Yan, will imprint this palm today into my heart. In the future, I will make you pay ten times for this!”</p><br/><p>The body swiftly fell into the deep mountain while that thick laugh of Xiao Yan still reverberated in the sky above the square. The killing intent contained in the laughter caused a chill in some of the Misty Cloud Sect’s disciples to surge forth.</p><br/><p>Yun Shan’s face was green as he watched the spot where Xiao Yan had disappeared. He waved his hand. His cold cry echoed throughout the sect.</p><br/><p>“All the Deacons and Elders in the Misty Cloud Sect listen up! Lead your groups and immediately enter the deep regions of the mountain. Find Xiao Yan. There is a special mark which I have left in his body. He will definitely be unable to escape!”</p><br/><p>“Capture him, dead or alive!”</p><br/>\n</div>"}