{"title": "Chapter 370: Skyfire Three Mysterious Change!", "id": 370, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-370-skyfire-three-mysterious-change", "volume_title": "Volume 4", "body": "<h1>Chapter 370: Skyfire Three Mysterious Change!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 370: Skyfire Three Mysterious Change!</u></strong></p><br/><p>After the two soft groans were consecutively released within the mountain cave, Xiao Yan, who could have continued to raise his strength by an additional star did not use this force to continue charging upward. Instead, Xiao Yan slowly stabilized his Qi and began to completely digest the energy that had suddenly and abruptly soared. This was something that Yao Lao did not expect.</p><br/><p>Yao Lao’s hand stroked his beard and observed the closed-eyed young man, whose face was like warm jade. He mused for a moment and immediately came to a sudden realization before nodding in a gratified manner. He smiled again and said, “Being able to maintain his original state of mind in the face of strength and knowing when to withdraw in contentment without being greedy or arrogant is not easy. Not bad. Not bad.”</p><br/><p>The two repeated ‘not bad’ were sufficient to see Yao Lao’s admiration in regards to Xiao Yan’s current performance. Although Xiao Yan could actually borrow the medicinal strength and directly become a four star Da Dou Shi, training was, after all, not something that could be accomplished overnight. After repeatedly raising his strength by two stars today, Xiao Yan would already have some difficulty stabilizing his body’s condition. If he were to raise his strength once again, it was likely that his body’s superficial state would become his largest obstacle the next time he tried to advance!</p><br/><p>A person who had a superficial interior and a poor distribution of energy within his body would be inferior to a person whose body was full and whose energy was controlled and properly distributed. Xiao Yan was extremely clear regarding this point. Back then, his persistence on training during the three years in which he had been regarded as a useless person had caused Xiao Yan to stabilize his training foundation until it was extremely firm. Only with this starting point, which was as stable as a rock, could Xiao Yan have the opportunity to continue advancing, building a towering strength which could cause others to be shocked. Therefore, he would not let this temporarily interest destroy his rock-solid foundation of which he was most proud!</p><br/><p>One naturally need not debate which was more important between the two. Therefore, Xiao Yan was extremely firm in giving up the breakthrough once again.</p><br/><p>Xiao Yan’s face was like a piece of warm jade that emitted a faint glow as he sat cross-legged on the green lotus. It was a long while later before the glow slowly disappeared. His eyelashes trembled slightly, and he suddenly opened his eyes. A faint green-colored glow flashed through them and quickly disappeared.</p><br/><p>Following the disappearance of the glow, the powerful force that had shrouded the surface of Xiao Yan’s body also gradually withdrawn until it had completely disappeared.</p><br/><p>“Ke ke, not bad. After recuperating and training, my strength actually rose by two stars. Unfortunately, this kind of opportunity is not something that you are given whenever you want it.” Yao Lao laughed softly as he saw Xiao Yan leave his training state.</p><br/><p>A turbid air moved along Xiao Yan’s throat before being emitted. He twitched his neck and heard the clear sound of his bones cracking. After which, he sensed the surging Dou Qi flowing within his body, which was like that of a flowing river. A joy involuntarily surfaced on his face. His hands gently pressed the green lotus and his body fell in a supple manner. His fists then abruptly struck out. The blowing sound of the wind from his fist was extremely sharp.</p><br/><p>“It is enough. With my current ability, I can perfectly control the strength of my two star increase. If it were to increase by more, I may appear to have risen in strength for a short period of time but if one were to look from a long term perspective, it would not be good for me.” Xiao Yan withdrew his fist and said with a smile.</p><br/><p>Yao Lao smiled and nodded his head. He beckoned the green lotus with his hand and returned it to the storage ring. His hand then shook and the broken jade piece from earlier once again appeared in his hand while he rubbed it gently.</p><br/><p>After raising his strength, the internal injuries within Xiao Yan’s body has also completely healed. The rosiness had returned to Xiao Yan’s face once again. He raised his head and watched Yao Lao’s action before glancing at the piece of broken jade. He was slightly stunned. His heart immediately moved a little as he took two steps forward and asked probingly, “Does teacher recognize what this is?”</p><br/><p>“Ah, I have seen this kind of strange storing device before.” Yao Lao nodded his head and said.</p><br/><p>“Storing device? One can actually store things within this thing? Don’t tell me it is storing something like a Dou Technique or Qi Method?” Xiao Yan was startled momentarily before speaking as he came to a sudden realization.</p><br/><p>“Ke ke, ah. If this is what I think it is, this kind of jade storage device should be the masterpiece of the ‘Burning Flame Valley’ on the Dou Qi Continent. This is because they are the only ones with a skill that allows them to use jade as a storage device. Moreover, if one were to touch this jade piece for a long time, there is actually a faint warm feeling to it. This is the mark of things that were made by the ‘Burning Flame Valley’.” Yao Lao smiled as he spoke.</p><br/><p>“‘Burning Flame Valley’? What is that?” Xiao Yan could not help but feel somewhat at a loss upon hearing this foreign name. As a novice who had never left the Jia Ma Empire in his life, it was natural that he had never heard of this name.</p><br/><p>“The ‘Burning Flame Valley’ is a faction on the Dou Qi continent. If we were to discuss about its strength, it is likely not any weaker than the Misty Cloud Sect. They have become renowned in the Dou Qi Continent for practicing Qi Method of the fire affinity. They only specialize in violent attacking methods. Therefore, they can be considered unique in the Dou Qi continent.” Yao Lao said faintly.</p><br/><p>“Not weaker than the Misty Cloud Sect?” The corner of Xiao Yan’s mouth twitched slightly. A long while later, he could not resist laughing bitterly. It was really unexpected that this Misty Cloud Sect, which dominated the Jia Ma Empire was only mediocre on the Dou Qi continent.</p><br/><p>“Ke ke, don’t overestimate the Misty Cloud Sect. What that person called Ling Ying said was true. The Misty Cloud Sect is merely only a second tier faction in the Dou Qi continent. Although they may now have a Dou Zong, they can only be considered to be among the bottom of the first tier factions.” Yao Lao smacked his lips, contorting them with disdain.</p><br/><p>“Of course, even if that is the case, they can naturally still be considered an enormous being in front of you, a small Da Dou Shi.” Yao Lao laughed out as he watched a bitter smile appear on Xiao Yan’s face, “Little fellow. The Dou Qi continent is very big. There are as many strong people as there are clouds. The world that you have seen in the past is merely a small corner of this continent. When you step onto the continent, I believe that you will like that fabulous and exciting world. However, you should also be clear of this. Regardless of where you are, your own strength is the most important thing if you want to obtain respect!”</p><br/><p>“The strong eat the weak. This is a rule used by all in this world.” Xiao Yan nodded slightly as he let out a soft laugh.</p><br/><p>“It is naturally good that you can understand this.” Yao Lao smiled. He held the broken jade piece in his hand and said, “Back to our original topic. Do you want to know what is inside this?”</p><br/><p>“Of course.” Xiao Yan hurriedly nodded his head. Since this thing had originated from the Burning Flame Valley, which could be compared to the Misty Cloud Sect, the items within should also likely be something extraordinary.</p><br/><p>“Use a fire to burn it.” Yao Lao threw the jade piece and the storage ring toward Xiao Yan as he continued with a smile, “The things from the Burning Flame Valley are this strange. One must use a flame to burn it in order to obtain the things inside. According to logic, the more fire-resistant the jade that originates from Burning Flame Valley is, the more precious the item within it is.”</p><br/><p>Xiao Yan carefully received the jade piece. He flipped it up and down as he looked at it. It was really difficult to believe that this seemingly weak looking jade piece was actually able to withstand being burnt by a fire. However, he never doubted the words that Yao Lao said. He immediately took out a purple-colored Danwan and threw it into his mouth. He chewed slightly, widen his mouth and spat out a purple-colored flame which was immediately suspended in front of him.</p><br/><p>Xiao Yan gently flicked his finger. The jade piece immediately turned into a ray of light that shot into the purple-colored fireball.</p><br/><p>When he saw the jade piece enter the flame, Xiao Yan hurriedly focused his sight onto the fireball, observing all the changes of the jade piece.</p><br/><p>The weak looking broken jade piece charged directly into the flame. Faint flame seedlings of the purple-colored flame erupted on the surface of the jade piece. What caused Xiao Yan and Yao Lao to feel a little strange was that the jade piece did not have the slightest movement as it was being burned by the purple flame!</p><br/><p>“This…” Xiao Yan blinked his eyes. He was slightly stunned as he watched Yao Lao. No matter how one put it, the Purple Flame was a flame with quite a high temperature. It was many times stronger than an ordinary Dou Qi flame. Yet there was actually not the slightest change in this jade piece. If it was as Yao Lao had mentioned earlier, where the greater the fire-resistance, the more valuable the thing inside was, then…</p><br/><p>“Ah, I originally thought that it was merely an ordinary object. It really is unexpected that this seems to be a big fish.” A strange look flashed over Yao Lao’s face as he watched the jade piece which was still safe and sound within the flame. He could not resist smiling as he lifted his chin slightly toward Xiao Yan and said, “Little fellow, looks like your luck is really quite good. Now, use the ‘Green Lotus Core Flame’ and give it a try.”</p><br/><p>Xiao Yan was startled upon hearing this. He lifted his head and eyed Yao Lao, only to find a joy from within the other person’s eyes. Immediately, his heart understood. If this little jade piece was able to bring praise from Yao Lao, it was likely that he had truly found something good this time around.</p><br/><p>Xiao Yan’s heart quietly beat faster. He swallowed his saliva and used his strength to rub both his hands. A green-colored flame immediately rose from between his fingers.</p><br/><p>Xiao Yan waved his hand and the purple-colored fireball in front of him disappeared into nothingness. He then beckoned with his hand and the jade piece fell once again. It was instantly wrapped up by the green-colored flame which had gushed out from Xiao Yan’s finger.</p><br/><p>The black-colored broken jade piece descended into silence upon falling into the green-colored flame. Xiao Yan was, however, not anxious as he slowly raised the flame’s temperature.</p><br/><p>When the cave had become unknowingly hot, the jade piece, which had been quiet, finally began to change. The originally smooth surface suddenly began to fluctuate like that of a water wave; its appearance was as though it was about to melt.</p><br/><p>“It’s fine. Continue to raise its temperature.” Yao Lao did not panic as he watched the jade piece which was about to melt. Instead, he smiled and spoke faintly.</p><br/><p>Xiao Yan also calmed his heart after watching Yao Lao’s calm manner. He nodded his head and inhaled a deep breath of air. The Dou Qi in his body flowed swiftly and the temperature of the ‘Green Lotus Core Flame’ was once again abruptly raised!</p><br/><p>Following the increase in the flame’s temperature, the dark, black, broken jade piece finally melted completely. The jade piece no longer had that black color after it had melted. Instead, it turned into a flat, green-colored, crystal clear liquid. The liquid slowly flowed within the green flame, much like a living creature, appearing extremely strange.</p><br/><p>At one point, the flowing liquid suddenly stopped. The surface of the liquid was agitated, as though there was something that was about to break through it and surface.</p><br/><p>“The good thing is about to appear.” Yao Lao said with a smile as he watched the movement of the liquid.</p><br/><p>Xiao Yan’s heart tightened upon hearing this. His eyes stared at the flame without even blinking once.</p><br/><p>The green-colored liquid continued to rage for more than ten seconds. In an instant, an eye-piercing green light suddenly shot out from within it, and instantly concealed all the other lights within the cave.</p><br/><p>The green light may have been eye-piercing, but it did not cause Xiao Yan, or Yao Lao to close their eyes. This was because a countless number of characters and information suddenly erupted from within the liquid the instant after the green light shone. They immediately and automatically arranged themselves in mid air within the mountain cave, forming words with a special font.</p><br/><p>Xiao Yan’s gaze swept across the light curtain in midair and finally stopped on the few large character located right at the top. His mouth moved slightly and a soft voice seeped out from between his teeth.</p><br/><p>“Skyfire Three Mysterious Change?”</p><br/><p>At the side, Yao Lao’s entire body shook upon hearing this name. The glow in his eyes suddenly brightened!</p><br/>\n</div>"}