{"title": "Chapter 385: Black Ranking, Black Storm", "id": 385, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-385-black-ranking-black-storm", "volume_title": "Volume 4", "body": "<h1>Chapter 385: Black Ranking, Black Storm</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 385: Black Ranking, Black Storm</u></strong></p><br/><p>A fleet of carts quickly moved past on this black plain, lifting wisps of faint yellow dust before finally disappearing at the edge of one’s sight.</p><br/><p>Xiao Yan was seated cross-legged within a somewhat bumpy horse carriage. The person in front of him was the person in change of the merchant convoy called Duo Ma. This merchant group was indeed not very strong, as he had mentioned. Among them, the strongest person appeared to have the strength of a five star Dou Shi. Of course, as the leader of the guards hired by Duo Ma, that fellow naturally felt somewhat unhappy at Xiao Yan who had suddenly joined them. However, after Xiao Yan had ‘accidentally’ knocked him off the horse carriage with a palm while they were rushing through the journey, he had become much more honest. It was also because of this palm that Duo Ma’s warmth toward Xiao Yan had become much more fervent. It even resulted in him even directly inviting Xiao Yan to sit in his carriage to properly receive him. After all, under the danger of them being robbed anywhere, one would feel much more reassured if there was a strong person sitting among the convoy.</p><br/><p>The current Duo Ma had taken out a map, which was somewhat old and yellowed, from his chest pocket. He placed it on the table in front of him and slowly pulled it open. His finger pointed at a red dot and he smiled as he said, “This is our destination, the ‘Black Mark City’. According to our speed, we should be able to arrive by tomorrow afternoon.”</p><br/><p>Xiao Yan’s gaze stared intently at the yellowing map. His gaze paused on the dot for ‘Black Mark City’ for a moment before slowly moving along a route upward and finally saw a blue-colored star right in the middle.</p><br/><p>“That should be the Jia Nan Academy, right?” Xiao Yan’s gaze glanced at the blue-colored star. His face did not have even the slightest change as he carelessly asked.</p><br/><p>“Ah, that is the Jia Nan Academy which is renowned throughout the whole Dou Qi Continent. My daughter is within it. Ke ke.” Duo Ma nodded his head. When he mentioned his daughter, that face of his swelled with pride.</p><br/><p>Xiao Yan quietly nodded. He imprinted the route firmly into his heart. After which, his gaze once against swept toward the black-colored region surrounding the exterior of Jia Nan Academy. The black-colored region was divided into quite a number of areas, all of which were different sizes.</p><br/><p>“The current ‘Black-Corner Region’ has basically been completely divided by some big factions. Although they still repeatedly fight with and kill one another for territories, there should not be any major changes within a short period of time.” When he saw Xiao Yan’s gaze, Duo Ma, who was a merchant, could naturally understand some of Xiao Yan’s uncertainty. Although he could guess that Xiao Yan should be a new person who had just arrived at the ‘Black-Corner Region’ for the first time , the shrewd him did not mention even a little of this. Instead, he smiling explained the situation.</p><br/><p>“The ‘Black Mark City’, which we are currently heading toward, is controlled by the ‘Eight Gates’. The ‘Eight Gates’ is an old faction within the ‘Black-Corner Region’ and its strength is extremely great. It is said that the strength of their leader, Yuan Yi, can be ranked within the top ten of the ‘Black Ranking’ in the ‘Black-Corner Region’. The Great Auction Fair in the ‘Black Mark City’ is also conducted by their ‘Eight Gates’ this time.” Duo Ma’s finger pointed at a small circle surrounding ‘Black Mark City’, which had been carved out as he smiled again while he spoke.</p><br/><p>“Black Ranking?” The foreign term caused Xiao Yan to confused as he muttered softly to himself.</p><br/><p>“Ke ke, this ‘Black Ranking’ is not very different from the ranking of the strong people in some countries. It is just that the competition for the ‘Black Ranking’ here far exceeds that of other competitions of other empires. This is because, in merely less than two years, the last three positions on the ‘Black Ranking’ were directly taken over. It is said that the three who were replaced them were all strong people at the Dou Wang class.” Duo Ma shook his head and sighed.</p><br/><p>“Oh?” Xiao Yan’s face visibly moved when he heard this. It should be known that the Ten Strong of the Jia Ma Empire would have at least a decade before there was a rotation or a change. Yet, in this place, even a strong Dou Wang was eliminated this quickly. It was difficult to imagine just how brutal the competition was.</p><br/><p>“Who are those who are ranked among the top few of the ‘Black Ranking’? What is their strength like?” Xiao Yan softly asked. His voice was somewhat curious.</p><br/><p>“Not many people have seen the two who are ranked first and second due to them being excessively mysterious. Therefore, I don’t have much knowledge of them. However, the one ranked third is an extraordinary strong person. It is said that his strength is already at the peak of the Dou Huang class. Moreover, he is extremely proficient in his medicinal refining skills and could be called the best in the ‘Black-Corner Region’ when it comes to refining medicine. Therefore, many people have addressed him as ‘Medicine Emperor’.” Duo Ma voiced his thoughts.</p><br/><p>TL: Medicine in pinyin is Yao.</p><br/><p>“Medicine Emperor? Such a name carries quite some weight.” Xiao Yan smiled faintly and said, “What is his real name?”</p><br/><p>“Ah, let me think. I think he is called Han Feng.” Duo Ma rubbed his head and spoke with a smile.</p><br/><p>“Chi!”</p><br/><p>Just as the words came from Duo Fa’s mouth, Xiao Yan’s finger, which was hidden in his sleeve suddenly trembled intensely. Some thick white flame involuntarily erupted from the black-colored ring on his finger. Finally, it resulted in his finger landing on a board of the carriage and the high temperature directly burned a small hole through it.</p><br/><p>The sudden change of the ring also caused Xiao Yan’s expression to change slightly. It was however, fortunate that with the cover of the sleeves, Duo Ma in front of him did not discover this unexpected change.</p><br/><p>“Teacher, what happened to you?” Xiao Yan’s finger gently rubbed the black ring as he softly asked in his heart. The change within the ring earlier was clearly because of a sudden violent surge of Yao Lao’s emotion within it.</p><br/><p>Xiao Yan did not receive a response to his question. The current Yao Lao appeared to have become completely silent.</p><br/><p>When he sensed Yao Lao’s complete silence, Xiao Yan also wisely did not continue to ask. However, he had firmly remembered the name of ‘Han Feng’ within his heart. This person appeared to have a huge relationship with Yao Lao in the past.</p><br/><p>“Mister Yao Yan, are you alright?” Seeing that Xiao Yan’s expression had suddenly changed, Duo Ma opposite him could not help but ask somewhat uncertainly.</p><br/><p>“I’m fine.” Xiao Yan smiled. He was about to say something when he suddenly realized that there was some disturbance outside of the horse carriage. Numerous exclamations were transmitted into the horse carriage, “Everyone take note, the ‘Black Storm’ is about to approach. Hurry up and prepare to stop the carriages! Do not wander so you do not lose your way.”</p><br/><p>“Black Storm? We are really unlucky to meet it once again.” Hearing the exclamation from outside, Duo Ma’s expression changed slightly. However, he did not show extreme panic. He faced Xiao Yan and said, “Mister Yao Yan, let’s get off the carriage first. As long as we properly take necessary steps for protection, this Black Storm, which isn’t considered very big, is unlikely to cause too much danger.”</p><br/><p>Xiao Yan nodded his head, pulled aside the curtain of the carriage and leaped down. He lifted his head and took a look only to discover that the sky that had been clear just ten minutes ago was now strangely covered by a black fog. His gaze was drawn to his front but his sight was seriously hindered. Only then did he realize why Duo Ma would say that if one were to meet a Black Storm, it was useless, even if one had a map.</p><br/><p>“Ke ke, Mister Yao Yan, you need not worry. I have sensed the wind and the storm isn’t very strong. This can be considered a great fortune in an unfortunate situation.” Duo Ma stood by Xiao Yan’s side and smiled as he said, “Although the Black Storm is a weather phenomenon in the Great Plains of the Black Region, which causes people to feel despondent over, it is much better compared to those brutal, dark bandits. At the very least, if one’s luck is a little good when meeting Black Storms, one can still preserve one’s life. However, if one were to meet the large army of bandits numbering in the tens of thousands, it is likely that one can only surrender and pray that their death will be quick.”</p><br/><p>Xiao Yan nodded slightly. He was just about to say something when he discovered that the originally dusky sky had instantly become completely dark without any forewarning. Not long later, the screaming wild wind suddenly came sweeping down. Immediately, some of the people with weaker bodies were blown by the wild wind until their bodies began to sway. It frightened them until they hurriedly grabbed onto some of the things beside them.</p><br/><p>The black-colored wind came sweeping down from the sky which was a dark mass. It was like a demon that seemed to open its huge mouth, ready to swallow anything that it met.</p><br/><p>The convoy, which was connected to one another, was arranged such that it formed a circular shape, where the head and tail were connected; everyone hid within the circle. The weapons in their hands were firmly inserted into ground, firmly fixing their bodies just like nails.</p><br/><p>A darkness, in which no one could not even see his fingers, shrouded everyone. Within the screaming wind, no one could sense whether there was anyone present beside them.</p><br/><p>Xiao Yan half knelt on the ground. He violently inserted his Heavy Xuan Ruler into the ground and hid his body behind the enormous ruler’s body. He heard the crackling sound as the wind blew against the ruler’s body. His expression also changed a little. It was unexpected that the so called Black Storm was actually strong to this extent. Moreover, this was a small scale storm which Duo Ma had mentioned. If they were to meet something a little bigger, would it not directly sweep an entire person away?</p><br/><p>The darkness and wild wind persisted for an unknowingly long time. During this time, Xiao Yan, who was within the darkness, suddenly knit his eyebrows slightly. He turned his head and turned his gaze toward a spot in a certain direction that he was not aware of. At that place, there seemed to be a strange red glow flashing. Moreover, there was a vague and fuzzy sound being transmitted from that spot.</p><br/><p>Xiao Yan blinked his eyes and sensed the surrounding wild winds which appeared to display a trend of weakening. He hesitated for a moment and suddenly half-bent his body and quietly moved toward the fuzzy red glow.</p><br/><p>The movement appeared to have persisted for a few minutes within the darkness before the strange red glow finally appeared in Xiao Yan’s sight. He borrowed that slightly weak red glow and was somewhat stunned to realize that the body releasing the red-colored glow appeared to be a blurry human’s form. Didn’t the drifting appearance of it seemed to be similar to when Yao Lao appeared?</p><br/><p>“Huh? This fellow actually has a spirit body? It is just that he seemed to be quite weak. A Dou Ling class. No! There seems to something hiding in the darkness. Little fellow, Do Not Move!” Suddenly, Yao Lao who had been caught in his silence seemed to have discovered something and hurriedly shouted.</p><br/><p>Xiao Yan was stunned when he heard this. His body lay on the ground with a ‘crack’ and he dared not even release his breath.</p><br/><p>“Who exactly are all of you? Why are you chasing after me? I don’t seem to have formed a grudge with any of you!” The red-colored spiritual body swayed and moved within the wild wind. The current him was now facing the darkness of the storm. His face was somewhat distorted and afraid.</p><br/><p>“Jie Jie (ha ha)”</p><br/><p>A laughter that gave people the creeps suddenly sounded from within the darkness. Immediately, a black-colored chain abruptly shot out from within the darkness. It was like a black serpent and was extremely agile as it wrapped around the red-colored spirit body.</p><br/><p>“Jie Jie.” That energy chain, which appeared to be agglomerated from an extremely strange energy, had just touched the red-colored spirit body when waves of white smoke began to seep out of the latter’s body. A sharp, miserable cry immediately sounded. However, regardless of how the spirit body struggled, he even summoned a kind of red-colored flame in the end, he still had no solution to deal with that black-colored chain. In the end, he could only see his own spirit becoming increasingly weaker with his own eyes before finally being wrapped by a black light that was spat out from the chain.</p><br/><p>“Jie Jie, no matter how great or strong you were when you were alive, as long as you have become a spirit body, you are a hunting target for our ‘Hall of Souls’.”</p><br/><p>The awful laughter gradually became distant in the darkness until it completely disappeared.</p><br/><p>On the grass in the darkness, Xiao Yan had nearly completely shielded his breathing. Cold sweat drenched his clothes. He did not expect that he would meet the mysterious organization that was chasing after Yao Lao within this Black Storm. Moreover, the thing that caused Xiao Yan to feel shock was that the mysterious person earlier did not even need to reveal his body when he captured a Dou Ling class spirit body with the latter unable to put up any resistance. Was this kind of strength not too terrifying?</p><br/>\n</div>"}