{"title": "Chapter 394: Di Class Agility Type Dou Technique: Three Thousand Lightning Movement", "id": 394, "volume": 4, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-394-di-class-agility-type-dou-technique-three-thousand-lightning-movement", "volume_title": "Volume 4", "body": "<h1>Chapter 394: Di Class Agility Type Dou Technique: Three Thousand Lightning Movement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 394: Di Class Agility Type Dou Technique: Three Thousand Lightning Movement</u></strong></p><br/><p>The auction continued to progress slowly under the anticipation of a countless number of people. After that mysterious map fragment, there were some good things that spurred the atmosphere of the entire place. Coincidentally, the high spirit of competitiveness that Xiao Yan’s ‘Three-Lined Green Spirit Pill’ brought out was among the leaders of the auctioned items.</p><br/><p>As the highest grade ‘Green Spirit Pill’, there were seldom anyone who had seen a true ‘Three-Lined Green Spirit Pill’ even in this ‘Black-Corner Region’. After all, the requirement where one needed three different kinds of flames to refine it was really too tough to meet. Thus, the moment when the ‘Three-Lined Green Spirit Pill’ was revealed, many of the top faction representatives showed shocked in their faces.</p><br/><p>The person who ended up obtaining the ‘Three-Lined Green Spirit Pill’ was not the rich and powerful Junior Sect Leader of the Blood Sect, but someone from the ‘Sky Serpent Mansion’. That Elder Qing directly burst out a sky high price of one million five hundred thousand and nearly caused the entire place to whistle at the resolution of this woman. Under this sky high price that appeared at the very beginning, that Junior Sect Leader of the Blood Sect, Fan Ling, could only widen his mouth while fashionably wearing a green face. However, he was held back by that imposing manner of Elder Qing’s and could only give up competing for it with great unwillingness.</p><br/><p>Xiao Yan could not resist shaking his head as he watched the smiling Elder Qing sit down once again. He muttered in his heart, “What a frightening woman. She doesn’t always bid, but when she did, she went for the kill and did not allow anyone to rebound back. She si like a Sand Mandala Snake from the desert which terrifies others.</p><br/><p>The high tide brought about by the ‘Three-Lined Green Spirit Pill’ continued for a long while before it slowly calmed down. Not long after this, Xiao Yan, who had originally shrunk back in his chair to relax, having nothing better to do, was suddenly attracted by a medicinal ingredient which had been brought out on a small silver plate by the auctioneer on the crystal platform.</p><br/><p>This medicinal ingredient was completely fiery red, much like it had been bathed in fresh blood. Its entire body was around the size of a palm. At a glance, it looked like a ‎Ganoderma. When this medicinal ingredient appeared, a faint, refreshing fragrance began to spread, soothing the spirits of those people near the crystal platform.</p><br/><p>“This is the ‘Flame Core ‎Ganoderma’? Tsk tsk, little fellow, you are really lucky to actually even see such a rare ingredient. We were indeed correct to come to this auction fair.” Yao Lao’s shocked voice carried some surprise as it sounded within Xiao Yan’s heart when the blood red LingZhi had just appeared.</p><br/><p>“Flame Core ‎Ganoderma?” Xiao Yan was given a jolt when he heard this. A joy that was difficult to hide immediately surged onto his face. “Is this one of the four essential items needed to refine the ‘Ground Spirit Spill’ which teacher had mentioned? The Flame Core Ganoderma?”</p><br/><p>“Yes, the ‘Flame Core Ganoderma’ only exists at the bottom of volcanoes, absorbing the energy of the volcano as well as the flame at the underground core in order to grow. It is extremely difficult for an ordinary person to pick it. Moreover, some strong Dou Huangs or even Dou Zongs would not dare to carelessly charge into a place like the volcano.” Yao Lao smiled as he replied.</p><br/><p>Xiao Yan nodded a little and quickly muttered, “I cannot let this thing go. I want to see if that fellow will come and put his foot in again.”</p><br/><p>During the time when Xiao Yan was conversing with Yao Lao, the auctioneer on the crystal platform also gave a detailed description of the origin and use of the ‘Flame Core Ganoderma’. Under his explanation, the reaction from the auction ground was not bad. It appeared that many people had some interest in this ‘Flame Core Ganoderma’.</p><br/><p>“Ke ke, according to our estimation, the base price of this ‘Flame Core Ganoderma’ is set at seven hundred thousand. Everyone, please begin.” The white haired auctioneer smiled and eyed the auction ground after reporting this price.</p><br/><p>After this high price was revealed, most of the people in the auction ground, who originally had some interest, immediately became disappointed. It was not that they could not fork out seven hundred thousand, but with so much competition, it was a common matter for the price of this damn thing to be doubled. Their money could not be considered to be abundant. In this kind of competition, they naturally needed to act within their means.”</p><br/><p>“Seven hundred and twenty thousand!” Of course, other than some of those people who wanted to withdraw from the competition, there were still quite a number of people who had the intention to fight for it.</p><br/><p>“Seven hundred and forty thousand!”</p><br/><p>Xiao Yan sat quietly on his chair and heard the price which was rapidly rising. He was not anxious to participate and compete for it.</p><br/><p>As time slowly moved, the few groups competing for it had also begun to gradually reduce due to the high price. In the end, only two people were left competing with one another. At this moment, the price had been raised to one million seventy thousand or so.</p><br/><p>“One million two hundred thousand!” Just as the auction ground had a standoff over the prices, a lazy voice finally sounded. Countless number of gazes followed the voice and moved. They finally stopped at the black-robed person, who was slowly standing up.</p><br/><p>The sudden jump in price also caused those people in front to turn their heads over in surprise. When Fan Ling saw that the person who shouted the price was actually the black-robed person from earlier, his eyebrows once again involuntarily knit together.</p><br/><p>The price of one million two hundred thousand suppressed the last two competitors in one blow. Xiao Yan ignored the gazes that he sensed were glaring at him from all around. He tilted his head. The gaze under the black robe was shot toward Fan Ling’s face. There was a faint provocation contained within it.</p><br/><p>Seemingly having sensed the emotion contained within Xiao Yan’s gaze, that Fan Ling sneered once. Although the ‘Flame Core ‎Ganoderma’ was extremely valuable, it did not have the slightest use to him. Moreover, he had incurred a small loss earlier, spending two hundred thousand to purchase an unknown and mysterious broken thing. It was only natural that he would not act on impulse this time around.</p><br/><p>Fan Ling lifted his eyes and glanced at Xiao Yan indifferently before he lazily turned back to face the stage and did not engage in any pointless entanglement.</p><br/><p>“Chi.” Xiao Yan smacked his lips under the black robe. He lifted his head, swung his gaze over to the crystal platform and said, “Can you bring that hammer down already?”</p><br/><p>Hearing Xiao Yan’s reminder, the auctioneer hurriedly nodded his head. He inquired thrice before the auction hammer in his hand smashed down heavily.</p><br/><p>“Hu.” Xiao Yan’s heart finally heaved a long sigh of relief as he slowly sat back down upon seeing the hammer fall.</p><br/><p>After the ‘Flame Core Ganoderma’ made its appearance, the auction ground appeared to gradually approach its end. This was because, treasures that could truly be called unique objects began to make their appearance one after another during the time that remained. Various different kinds of Qi Methods, Dou Techniques, and even medicinal formulae, that caused one to be dazzled upon seeing them. The excited shouting of prices in the auction ground continued unceasingly. At one of the instances, two factions in the back rows fought for a set of Xuan Class Qi Methods and Dou Techniques until their faces were flushed. In the end, one of them actually pulled out his knife and directly attacked.</p><br/><p>Just as that man was about to strike, however, a rushing wind suddenly appeared in midair within the auction ground. A long, dark, black-colored arrow astonishingly descended from the sky before finally ferociously inserting itself in front of the man. Due to the great force, over half of the arrow’s body was inserted into the hard ground. The swaying tail of the arrow emitted an ear-piercing sound due to the extreme speed at which it trembled.</p><br/><p>The long arrow which came descending from the sky reminded the two factions who had lost some of their sense of reasoning. Their gazes swept fearfully over the surroundings of the auction ground before finally withdrawing back to their own seats grudgingly.</p><br/><p>Under the black robe, Xiao Yan slowly withdrew his gaze from the spot where the commotion had occurred. His gaze moved along his hat and eyed a certain shadow on the second story of the auction ground. That black arrow earlier, which even he felt he had to be cautious about, was shot from that spot.</p><br/><p>“This ‘Eight Gates’ does indeed have quite a strong foundation in order to be bold enough to open an auction.” Xiao Yan muttered. He did not participate in the competition earlier. Due to the ‘Flame Mantra’, Qi Methods already no longer posed much attraction to him. He was also uninterested in ordinary Dou Techniques. Therefore, other than spending four hundred thousand to purchase a medicinal cauldron named ‘Bright Square Fire’, he did not purchase any other things.</p><br/><p>The deafening cries of bidding prices reverberated throughout this large auction ground. The loud noise was nearly about to break the ceiling and charge into the clouds.</p><br/><p>When the auction fair was about to enter its final portion, an auction item that truly contained great weight finally appeared. That was a Dou Technique. Putting it more accurately, it was an Agility Type Dou Technique.</p><br/><p>“Three Thousand Lightning Movement. Agility Type Dou Technique. Class, Di Class Low Level.”</p><br/><p>The soft voice of the auctioneer instantly caused the entirely noisy auction fair to descend into silence. Countless numbers of crimson eyes turned toward that silver colored scroll on the crystal platform. Sounds of hurried breathing were like a bellow creating whirring noises.</p><br/><p>“Di Class Dou Technique.” Xiao Yan inhaled a deep breath of cold air. Even his calm heart could not help but hasten its beating. His gaze was filled with shock. Di Class Dou Technique. There was actually someone who could really take out a Dou Technique of this class out to auction off. He really knew how to squander his family’s fortune!</p><br/><p>A Dou Technique of this class would likely be treated as an important item to be carefully stored even when it came to those so called first-rate factions on the continent. Yet, there was actually someone who was willing to take it out to sell.</p><br/><p>“It is not that they are willing to take it out. It is just that the things auctioned in the ‘Black-Corner Region’ are mostly criminal goods obtained through fraudulent means. They are afraid of being discovered by others, therefore they themselves would also not dare to practice it. Therefore, they take it here to auction off.” Yao Lao said slowly.</p><br/><p>Xiao Yan came to a sudden understanding when he heard this.</p><br/><p>“According to what I know, this ‘Three Thousand Lightning Movement’ seems to be the highest grade Agility Dou Technique of the ‘Wind Lightning Pavilion’ of the continent. After one learns it, one’s body would transform into a flash of lightning, being so quick that it would be terrifying. If a Da Dou Shi were to learn this, he would be in a position where he would not lose even when contending head on against a Dou Ling. It is really unexpected that this thing, which is regarded by the ‘Wind Lightning Pavilion’ as their lifeblood, would actually end up here. I think that those fellows from the ‘Wind Lightning Pavilion’ must be flying with rage at this moment.” Yao Lao laughed faintly.</p><br/><p>Xiao Yan nodded a little. He eyed those in front of him, like the Blood Sect, whose eyes were similarly glowing. He involuntarily laughed bitterly, “Even though I am extremely interested in this ‘Three Thousand Lightning Movement’, it is clearly not up to me to contend for it.”</p><br/><p>“Yes. They will not give up this kind of thing.” Yao Lao laughed. There was suddenly some anticipation within his laughter, “It is just that I am very curious. This Di Class Dou Technique can only be considered as the second item to dominate this auction since it isn’t the last item. Just what kind of earth-shaking unique treasure will be the true item that dominates the auction?”</p><br/><p>Xiao Yan was startled. Astonishment and aghast immediately surged within his heart. Something even more valuable and rare than a Di Class Dou Technique? Just what exactly was it?</p><br/>\n</div>"}