{"title": "Chapter 403: Swallowing The Yin-Yang Mysterious Dragon Pill!", "id": 403, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-403-swallowing-the-yin-yang-mysterious-dragon-pill", "volume_title": "Volume 5", "body": "<h1>Chapter 403: Swallowing The Yin-Yang Mysterious Dragon Pill!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 403: Swallowing The Yin-Yang Mysterious Dragon Pill!</u></strong></p><br/><p>A black shadow suddenly flashed past a dense mountain forest. Occasionally, the black robe would collide with a tree branch, which grew wildly, causing the black robe to be lifted slightly to reveal a delicate and handsome young face. It was that of Xiao Yan, who was fleeing after killing Fan Ling’s group and obtaining the treasures.</p><br/><p>Seemingly because he was worried that someone would discover his footprints and other small clues if he were to run on the surface, Xiao Yan had chosen to leap from tree branch to tree branch ever since he had left the place where he had performed the act. Even when he occasionally landed on the ground, he would carefully cover his footprint and other things.</p><br/><p>Xiao Yan borrowed the cover of the dense thicket of the forest. Although he had sensed a presence, which contained an incomparable dark chillness and killing intent flying past him in the sky when he was fleeing, he was able to hide his Qi with the help of Yao Lao. Therefore, he was not discovered by the furious Fan Lao during his journey, where he was doing his best to flee. He was really quite lucky.</p><br/><p>After an entire day and night of fleeing with all his strength, Xiao Yan had finally thrown the ‘Black Mark City’ into the distance. At this moment, even if Fan Lao had the ability to communicate with the heavens, he would definitely not be able to seek Xiao Yan out in this place, which was a couple of hundred kilometers away.</p><br/><p>The black shadow suddenly shot out from within the forest and onto the back of a cliff with a pernicious slope, After which, he steadily landed on a huge rock on the edge of the cliff. After an entire day of fleeing, the black robe had become slightly dirty and messy. He lifted the Doupeng off his head and revealed the face of a young man, who had once again recovered his energy after resting for an entire night.</p><br/><p>TL: Doupeng - a hat with a cloth to cover one’s face.</p><br/><p>Xiao Yan stood at the edge of the cliff and inhaled a deep breath of air that contained a thin mist. That little tiredness, which remained, had finally completely disappeared. He eyed the path below the mountain cliff, which was like the meandering of earthworm. The corner of his mouth could not help but be lifted into a tiny arc. Closely following this, the smile became bigger and was finally transformed into a hearty laugh which resounded off the mountain cliffs for a long while.</p><br/><p>This time around, Xiao Yan was like a canary with his reward far exceeding what he had expected. Originally, he merely wanted to obtain that map fragment. It was really unexpected that Fan Ling’s group actually took the initiative to help him snatch other unique treasures like the ‘Yin-Yang Mysterious Dragon Pill’ and the ‘Three Thousand Lightning Movement’. These two treasures, which created quite an extraordinary ripple even when placed in the entire Dou Qi Continent, had landed in Xiao Yan’s hand in a somewhat comical fashion. This kind of thing was like a biscuit falling from the sky, causing the current Xiao Yan to have a trance-like feeling of being in a dream.</p><br/><p>The laughter gradually dissipated. Xiao Yan’s hand shook and an ancient map fragment appeared in his palm. Quickly following this, he tapped his finger gently on the storage ring. Another slightly larger map fragment and two other map fragments, which had been split from a single map by Hai Bodong the other time, flashed and appeared. His hands carefully put the three map fragments together and then eyed the large missing lower left corner. He could not help but laugh softly. It was really unexpected that in just a little over three years’ time, three of the map fragments, which had scattered to unknown locations of the continent, had already landed in his hand. It must be said that he was really too lucky.</p><br/><p>“It is fortunate that I had first obtained the map fragment which had the drawing of the ‘Purifying Lotus Demon Flame’ on it. Otherwise, it is likely that even teacher would not think of linking this map fragment to the ‘Purifying Lotus Demon Flame’, which is ranked third on the ‘Heavenly Flame Ranking’. If we did not not know the exact background of the map, even if we were to meet a similar map fragment in another place, it is likely that we would not act like this now, risking the danger of being chased and killed by a strong Dou Huang and a large faction in order to snatch these map fragments…” Xiao Yan was a little absentminded for a while as he faced the map before he suddenly muttered, feeling a little fortunate.</p><br/><p>After Xiao Yan rejoiced in his heart for a while, he carefully stored the map fragment. He flipped his hand and a cold jade box, that was emitting white colored mist, appeared.</p><br/><p>Xiao Yan’s eyes stared directly at the cold jade box. His throat rolled slightly. That heart of his, which had originally already calmed down, once again began to pound intensely. Xiao Yan’s mental strength had become much weaker in front of this kind of unique treasure.</p><br/><p>Xiao Yan’s hand slowly lifted the cover until a tiny gap was created. A thread of golden light shot out from within it. When he saw this, he quickly covered it again. That cautious manner of his was as though he were afraid that it would attract some strong person. After all, under the allure of a sky-high priced treasure like the ‘Yin-Yang Mysterious Dragon Pill’, it was likely that many people, other than a very few strong people whose class had already reached a certain level, or people who had no desires, would have difficulty concealing the greed in their hearts and directly kill him to snatch the treasure. Moreover, those two kinds of people that wouldn’t bother with Xiao Yan were so few in this ‘Black-Corner Region’ that they could be ignored…</p><br/><p>“Consume it. It is not safe to carry it with you…” A faint voice suddenly sounded from within Xiao Yan’s heart.</p><br/><p>“Uh? What?” Xiao Yan was startled when he heard this. He could not recover his senses for a period of time.</p><br/><p>“I said consume this ‘Yin-Yang Mysterious Dragon Pill!” Yao Lao could only helplessly repeat himself when he saw Xiao Yan looking as though his mind was blank.</p><br/><p>“Here?” Xiao Yan’s face was stunned. This was a tier seven medicinal pill. He was supposed to consume it in this place which could not be considered safe? When he consumed the ‘Three-Lines Green Spirit Pill’ in the past, he had to find a safe place where no one would disturb him in order to properly refine the medicinal strength.</p><br/><p>“Don’t say any more nonsense. Eat it!” Yao Lao impatiently urged.</p><br/><p>“...”</p><br/><p>Xiao Yan laughed bitterly and could only nod his head. He carefully lifted the cover of the cold jade box. At the moment when the box was opened, he abruptly covered it with his palm. After which, his green-colored Dou Qi surged out and blocked the golden light, which was about to shoot into the sky.</p><br/><p>Golden light roamed on the surface of the ‘Yin-Yang Mysterious Dragon Pill’ in his hand. Two tiny golden-colored divine dragons repeatedly circulated within the pill. A faint dragon roar seeped out from the medicinal pill. If one were to carefully listen, that slight dragon roar seemed to be hiding a certain strange magical strength. It was actually able to cause a person’s spirit to instantly tremble and become absent minded…</p><br/><p>“Hu…”</p><br/><p>Xiao Yan shook his head with all his might. When he looked at the ‘Yin-Yang Mysterious Dragon Pill’ once again, a little surprise could not help but appear in his eyes. It was indeed worthy of being a tier seven medicinal pill, possessing a strange energy which could influence one’s spirit. It was the first time that he had met a strange sound which could cause his spirit to fall into a trance since the start of his training...</p><br/><p>Xiao Yan held the ‘Yin-Yang Mysterious Dragon Pill’ with his hand. He inhaled a deep breath of air and then suddenly popped it into his mouth. Before he had the time to chew, the golden pill had already turned into a hot flow, moving along his throat and pouring into his body.</p><br/><p>The surging hot flow was like a flood that swarmed into his body from all directions. Xiao Yan tightly clenched his teeth and hurriedly sat cross-legged, waiting for the moment that the medicinal effect would erupt.</p><br/><p>Not long after Xiao Yan sat cross-legged, however, the expected volatilization of the medicinal effect did not appear. That hot flow that was surging like flood waters was like a flow of water entering a sponge. It slowly dissipated within his body until it completely disappeared…</p><br/><p>Xiao Yan’s originally tightly shut eyes gradually opened. He looked up and down at his body. Not the slightest activity has occurred. His mouth involuntarily twitched as he said in an utterly discomfited voice, “Teacher… don’t tell me that this damn ‘Yin-Yang Mysterious Dragon Pill’ was fake? Why is it that there is not even the slightest reaction?”</p><br/><p>“What reaction do you want? A golden glow to shine brightly all over your body? Then giving you such a great pain that you would rather die, just like the other medicinal pills which you have consumed in the past?”</p><br/><p>Xiao Yan was dull. He helplessly said, “At the very least, there should be some sort of occurrence happening. The result of consuming the ‘Yin-Yang Mysterious Dragon Pill’ is just like drinking a cup of plain water… it is, at any rate, a tier seven medicinal pill.”</p><br/><p>“Didn’t the auctioneer say during the auction fair… this ‘Yin-Yang Mysterious Dragon Pill’ is not some medicinal pill used to raise one’s strength. Its greatest use is to ‘stand after breaking’... that medicinal strength has already penetrated into your body. If you are to really enter into the juncture between life and death in the future and are lucky enough to activate it, you will naturally be able to obtain benefits which you cannot even imagine. For now… just treat it as though you have drunk a cup of water.” When Yao Lao saw Xiao Yan’s depressed expression, he could not help but feel that it was a little ridiculous as he spoke.</p><br/><p>“... Don’t tell me that there isn’t even the slightest benefit right now?” Xiao Yan was slightly relieved as he stood up from the ground. However, he was still somewhat unwilling to accept the situation as he asked once again.</p><br/><p>“That is not entirely so…”</p><br/><p>After hearing Xiao Yan’s question, Yao Lao was silent for a while before speaking after some time, “This ‘Yin-Yang Mysterious Dragon Pill’ has already reached the stage where the pill has gathered a spirit. Moreover, the items used to refine it are the monster cores from the bodies two rank six dragon type Magical Beasts which have not yet been dead for more than seven days. Therefore, it contains some thin dragon aura. This is also why the dragon roar from within the medicinal pill would cause one to feel as though one’s spirit is trembling.”</p><br/><p>“Any person who has good luck and who has consumed the ‘Yin-Yang Mysterious Dragon Pill’ would have a small chance of receiving the thin dragon aura into their body. However, the chances of this happening are quite low. The Wind zun zhe, Gu Ling, did not obtain even a little of this ability from the ‘Yin-Yang Mysterious Dragon Pill’...” When he reached this point, Yao Lao suddenly said, “If you want to try, you can repeatedly circulate the Dou Qi in your body. If there is a strange energy separating from the Dou Qi when the Dou Qi is being rapidly rotated, that means that the thin dragon aura within the ‘Yin-Yang Mysterious Dragon Pill’ has already been inherited by you…”</p><br/><p>TL: zun zhe - used to refer to a Dou Zun</p><br/><p>“What benefit is there after one possesses a dragon aura?” Xiao Yan curiously asked.</p><br/><p>“If you really possess that thin dragon aura, all you need is to obtain a scroll containing a sound attacking type Dou Technique. When you are to fight with people in the future and suddenly let out a roar that shakes the opponent’s spirit until he is distracted, won’t you gain a great advantage over them? In a battle between the strong, even a split second could well determine victory and defeat… Moreover, the sound wave containing a dragon aura has a very great lethality toward a spiritual body. If you meet any strong spiritual bodies in the future, this is a killing move against them. Otherwise, you would feel far too bounded. After all, you do not have that strange energy attack of the ‘Hall of Souls’.” Yao Lao said faintly.</p><br/><p>Xiao Yan’s eyes could not help but become much brighter when he heard these words. He stood on the edge of the cliff, inhaled a deep breath of ice cold air before gradually closing his eyes. The Dou Crystal within the vortex of his body emitted a slight tremble. Wisps of green-colored Dou Qi immediately surged forth and finally began to whiz past through his Qi Paths much like galloping waters.</p><br/><p>As the speed of the Dou Qi circulating within the body wildly and abruptly became more intense, the powerful green-colored Dou Qi had already turned into a faint mist on the surface of Xiao Yan’s body and completely shrouded Xiao Yan’s body within it. Moreover, the energy fog had actually faintly had the intention of automatically agglomerating into Dou Qi Armor, even without his control.</p><br/><p>Like a wind turbine, Dou Qi wildly circulated one wave after another. In the end, it actually emitted some strange, sharp, unusual noise. A faint throbbing pain appeared and disappeared from within his Qi Paths.</p><br/><p>“Endure for a little while…” Yao Lao hurriedly said when he sensed Xiao Yan’s slightly twisted face. For some unknown reason, there was an additional seriousness and anticipation in his voice.</p><br/><p>Xiao Yan clenched his jaw tightly. His hand had begun trembling slightly at this moment. A while later, the throbbing pain suddenly became more intense. Xiao Yan’s spirit trembled and he finally could not endure the pain any longer…</p><br/><p>However, at the moment when Xiao Yan had reached his limit, the Dou Qi swiftly rotating in his body suddenly trembled. A wisp of strange and unusual energy was finally thrown out...</p><br/><p>After this wisp of strange and unusual energy was thrown out, it appeared to be dragged by something as it directly rushed toward Xiao Yan’s throat…</p><br/><p>Xiao Yan clenched his teeth tightly. At this moment, a strange energy forcefully broke through. A unique sound wave, containing something that caused a person’s spirit to tremble, came out with a mighty roar from Xiao Yan throat!</p><br/><p>“Roar!”</p><br/><p>Under this oppressive roaring, the mountains where the roars of Magical Beasts were originally occasionally heard, completely descended into a certain frightened silence.</p><br/><p>“Ah… you are indeed a lucky fellow… it is really unexpected that you are actually able to inherit that dragon aura… If that Gu Ling knew about it, I’m afraid that his eyes might well have turned red with jealousy.” Yao Lao’s soft whisper slowly sounded as he felt the strange sound wave which came spreading out from Xiao Yan’s throat.</p><br/>\n</div>"}