{"title": "Chapter 414: Playing With Fire", "id": 414, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-414-playing-with-fire", "volume_title": "Volume 5", "body": "<h1>Chapter 414: Playing With Fire</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 414: Playing With Fire</u></strong></p><br/><p>The scattered hair of the blue-clothed young man, appearing in front of Xiao Yan, was rolled down. A lazy expression hung on his face, while his body straightened. Although his appearance was not as handsome as Bai Shan, it could still give people a harmonious feeling in their hearts. A face that appeared harmless to human and animals made it extremely easy for people to let their guard down when they looked at him. It was little wonder why Xiao Yu, given her character, would be teased by this fellow when they met for the first time.</p><br/><p>“You are Xiao Yan, right? Xiao Yu’s younger cousin brother?” While Xiao Yan was weighing the blue-clothed young man, the latter watched him with a smile and asked.</p><br/><p>“Yes.” Xiao Yan only nodded slightly, and responded when he saw that this fellow did not display an expression similar to that of Bai Shan.</p><br/><p>“Hee hee, we’re family, we’re family. Relax, brother Xiao Yan, I will hold back when the match begins in a little while and will definitely not cause you to be injured. Otherwise, I will be unlucky if Xiao Yu is infuriated.” Lu Mu immediately laughed when he saw Xiao Yan nodding his head and said with an extremely warm smile.</p><br/><p>“Uh…” Xiao Yan was speechless when he heard these words. This fellow really acted familiar all by himself. He was able to pull their relationship to that extent despite this only being their first time meeting. How talented.</p><br/><p>“Since it is like this, then I will thank Senior Lu Mu very much. However, I am also very interested in the top five spots. Is Senor Lu Mu willing to let me have it?” Xiao Yan laughed softly.</p><br/><p>“*Cough*... Brother Xiao Yan, everything we do should be down to earth, so don’t be too ambitious. Even I don’t have much confidence to get into the top five. Although you have defeated Xue Beng, you should know that fellow’s strength can only be considered the average level in the Qualifying Competition.” Lu Mu’s face reddened as he coughed and said with a smile after hearing Xiao Yan’s words.</p><br/><p>Xiao Yan could not resist smiling when he saw Lu Mu’s performance. This fellow was also quite straightforward and was unlike that dark, cold character Bai Shan.</p><br/><p>“Start!” At this moment, a middle-aged man from the judge’s seat waved his hand and yelled in a clear voice.</p><br/><p>“Senior Lu Mu, defeat Xiao Yan!”</p><br/><p>“Let him know the strength of Jia Nan Academy!”</p><br/><p>The middle-aged judge’s voice had just fell when waves of cheers were emitted from the viewing gallery. However, most of those who shouted these words were males. Additionally, following this somewhat intense reaction by the male students, it caused some female students, who had some sympathy, to feel a little unhappy. No matter how one put it, the strength that Xiao Yan had displayed yesterday was sufficient to cause many to be shocked. Moreover, Xiao Yan was also not bad looking. His tall body, as well as the delicate and handsome face, also attracted many female gazes. Therefore, not long after those shouts to defeat Xiao Yan sounded, waves of orderly clear female cheers helped Xiao Yan raise his momentum.</p><br/><p>“Ke ke, looks like this fellow Xiao Yan is quite liked by the girls. He has only been here for one day and there are already people cheering for him.” Instructor Ruo Ling could not help but cover her mouth and laugh when she heard those lovely cries.</p><br/><p>Xun Er also smiled gently by the side.</p><br/><p>“Xiao Yan, defeat this medicinal pot!” Xiao Yu was carried by the two different types of cheers that had erupted on the open ground until her face turned red. She hurriedly placed her hands by the side of her mouth and shouted out loud.</p><br/><p>Xiao Yan shook his head speechlessly as he heard the two opposing cheers in the stadium that entangled unceasingly with one another. He lifted his head, eyed Lu Mu on the opposite side and shrugged his shoulders. His hand gently grasped the hilt of the Heavy Xuan Ruler on his back. With a swash sound, the heavy ruler cut through the air and was tilted sideways as it pointed toward the ground. A green-colored Dou Qi began to slowly rise within his body and finally wrapped Xiao Yan’s entire body within it. A powerful Qi spread out.</p><br/><p>“Senior Lu Mu, please!”</p><br/><p>Lu Mu was startled as he sensed the rising, powerful Qi within Xiao Yan’s body. The lazy expression on his face immediately began to gradually disappear. Light from his storage ring flashed out and a metallic sword appeared. He gently lifted the sword and pointed it to Xiao Yan. With a serious expression, he said, “Seeing the Qi of Junior Xiao Yan, I think that you should have already advanced to the Da Dou Shi class, right? No wonder you could easily defeat Xue Beng yesterday. Your training talent is really outstanding.”</p><br/><p>“I am also very interested in the top five spots and cannot give them to you. Therefore, I can only use all my strength!”As Lu Mu’s voice fell, a powerful force, that was not much different from the one that came from Xiao Yan, surged out from within his body. After which, it turned into a cluster of red flames that wrapped Lu Mu within it. From a distance, the fiery red glow rolled and burned, much like a cluster of flame.</p><br/><p>The two people in the arena now were completely isolated from the noise of the outside world. They were attentive, and their breathing was calm. As they exchanged glances with one another, the Dou Qi that covered their bodies appeared to be breathing as it repeatedly exhaled and shrunk.</p><br/><p>The two people in the arena appeared to have remained quiet at the same time. A gentle wind swept past the arena and the swords rattled!</p><br/><p>Seemingly having sensed the fight in the arena, which would erupt at the first move, the surrounding viewing gallery also became slightly quiet.</p><br/><p>Two Qis, which had each shrouded half of the air within the arena, suddenly solidified. In an instant, everyone felt their eyes become blurry. Two shadows abruptly flashed. The sound of metal colliding and sparks flying immediately erupted from the center of the arena.</p><br/><p>Most of the people in the viewing gallery could only see vague black and blue figures in the arena, as well as hear the sound of air being split as the heavy ruler was swung. After which, they saw the crack lines on the rock surface, which were formed as it repeatedly trembled, due to the colliding of the Dou Qi in the arena. Although they could not see the exact battle, no one could deny the intensity of the fight from the two auras, which were of approximately the same level.</p><br/><p>Within the arena, Xiao Yan’s heavy ruler swung widely. He used the broad ruler’s body and each time he waved, there would be the sound of strong compressed wind. At times, when it was filled with Dou Qi, the sharp force of the ruler’s body would smash until crack lines appeared on the ground, even without coming into contact with it. From this, it could be seen just how terrifying the strength was when Xiao Yan swung the heavy ruler.</p><br/><p>The metallic sword in Lu Mu’s hand was the total opposite of Xiao Yan’s big motion attacks. It was instead like a tricky, soft snake and did not came into contact with Xiao Yan’s heavy ruler. Occasionally, when they did come into contact, he would pull back at the moment of contact and did not give the slightest opportunity for the heavy ruler to transmit the force over.</p><br/><p>The human figures on the open ground flashed, and their Dou Qi collided violently. Numerous pillar-like Dou Qi waves would gush out from their palms and finally collide together, spreading out an energy ripple which swept away all the debris on the open ground.</p><br/><p>“This fellow has very tight defense. Even with my sword speed, I am actually unable to make the slightest contact with him.” The metallic sword in Lu Mu’s hand came attacking in a lightning-like manner. Numerous afterimages, which carried a flaming red Dou Qi, surfaced in front of him. However, regardless of how fast Lu Mu attacked, that enormous ruler would instantly changed its direction. Xiao Yan borrowed the broadness of the ruler’s body and it's extremely hard material to easily block all ten plus afterimages.</p><br/><p>As the fight between both parties prolonged, the laziness on Lu Mu’s face had gradually disappeared. Only now was his face completely covered with a serious expression. The strength that Xiao Yan had displayed was sufficient to let him treat it with caution.</p><br/><p>“Hu…” Lu Mu let out a long breath as his footsteps suddenly retreated slightly. His body immediately leaned forward and the fiery red Dou Qi on the surface of his body swiftly swarmed into the metallic sword. In an instant, a longsword, that contained a cold glint, was transformed into a flaming sword that emitted a high temperature.</p><br/><p>A sleek redness also surged up onto Lu Mu’s face following the change in the longsword. His hand suddenly trembled and a clear, thunderbolt-like sound appeared from his joints. as the fire sword in his hand pierced out explosively. The high temperature cut through the sky, and even carried a faint, charred smell.</p><br/><p>Xiao Yan’s eyes became cold when he sensed this change in the other party’s longsword. His hands held the hilt of the Heavy Xuan Ruler tightly and with a low cry, the heavy ruler cast a shadow as it stood in front of him like a huge, black-colored wall.</p><br/><p>“Clang!”</p><br/><p>The fiery red longsword pierced toward the black-colored huge ruler. As this clear ring of the sword sounded, the peak of the sword suddenly bent. The longsword swayed along with the ruler’s body and flashed out of the boundary where the black ruler could block it. The longsword violently cut upward and carried a fiery cold glint as it cut toward Xiao Yan’s hand, which was holding the ruler’s hilt tightly.</p><br/><p>Xiao Yan was startled at the other party's longsword, which had suddenly transformed until it was as soft and gentle as a snake. His hand swiftly released the ruler’s hilt but his body did not pull back. Instead, he abruptly charged forward.</p><br/><p>When his hand left the Heavy Xuan Ruler, the Dou Qi, which was suppressed in Xiao Yan’s body, immediately began to soar like a flood. His speed had also greatly increased by a few times as his body turned into a black shadow, which missed the stunned face of Lu Mu in a lightning-like manner. At the moment when they passed each other, Xiao Yan’s elbow abruptly smashed downward, which coincidentally smashed into Lu Mu’s wrist. The fiery red longsword immediately fell. Lu Mu’s hand, however, had become completely numb at this moment.</p><br/><p>“Clang…” The longsword fell onto the ground as Lu Mu’s body miserably rolled away, dodging the sharp kick, which Xiao Yan had unleashed from behind him.</p><br/><p>Xiao Yan only slowly turned around when his attack was futile and appeared to give an unsmiling smile toward Lu Mu who had pulled back by more than ten steps.</p><br/><p>The lightning swift exchange finally and abruptly became slow once more. When the students at the viewing gallery saw Lu Mu rolling a couple of times like a pastry, their faces were involuntarily filled with astonishment.</p><br/><p>“What great speed. What strong force.” Lu Mu’s left hand lightly touched his wrist. He used his strength and gave a pull. The corner of his mouth shivered. After which, he shook his head with a face filled with amazement.</p><br/><p>Xiao Yan smiled. He slowly walked toward the side of the Heavy Xuan Ruler. However, he did not place his hand on it.</p><br/><p>“Ah, I have really underestimated you. Looks like I have no choice but to get serious.” Lu Mu sighed. He extended his hands out of his clothes and his gaze stared intently at Xiao Yan as he said, “You should also know of my other identity. Alchemist… the thing I am good at is not Dou Qi... but rather playing with fire!”</p><br/><p>Pride flashed across Lu Mu’s face. His hands trembled and a deep, blue-colored flame instantly seeped out, and swiftly covered his hands within them. The high temperature caused his face to become a little illusionary.</p><br/><p>Surprise flashed across Xiao Yan’s eyes as he eyed the deep, blue flame, which had swarmed out of Lu Mu’s hands. This should be a kind of ‘Beast Flame’. However, the words that Lu Mu had said caused a strange, laughable feeling to surface within his heart. Playing with fire? Hei, with his current flame controlling abilities, even a tier four alchemist would not dare to say something absurd like playing with fire in front of him.</p><br/><p>“Brother Xiao Yan, you should be careful. This Blue Crystal Flame has once wounded a strong Dou Ling.”</p><br/><p>Xiao Yan’s smile was strange as he raised his head and watched the proud face of Lu Mu. He nodded slightly and under a countless number of gazes, his long white hand also slipped slowly out of his black robe. After which, he obtained a purple-colored Danwan from his storage ring and stuffed it into his mouth. He then began chewing.</p><br/><p>Xiao Yan chewed for a moment before his middle finger and thumb gently rubbed across each other. A clear snapping sound appeared in the stadium.</p><br/><p>Following the rubbing movement of the two fingers, Xiao Yan opened his mouth. A cluster of purple flames were immediately spat out in front of many shocked eyeballs. His right hand swayed, and the purple-colored flame was suspended over his palm.</p><br/><p>Xiao Yan eyed the purple-colored flame leaping like an elf before raising his face. His actions, caused the entire stadium to descend into a silence. On the opposite side, the originally proud faced Lu Mu had also become stunned at this moment.</p><br/><p>“Ke ke, Senior Lu Mu. I’m sorry. What I specialized in is also not Dou Qi... but rather playing with fire!”</p><br/>\n</div>"}