{"title": "Chapter 420: Big Chaotic Battle", "id": 420, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-420-big-chaotic-battle", "volume_title": "Volume 5", "body": "<h1>Chapter 420: Big Chaotic Battle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 420: Big Chaotic Battle</u></strong></p><br/><p>“Do all of you understand the rules of the competition?” When there was no longer anyone entering the arena, Hu Gan’s gaze swept around once and asked in a clear voice.</p><br/><p>“Understood!” An orderly reply sounded within the arena when they heard Hu Gan’s words.</p><br/><p>“Alright, since all of you understand, I announce that…” Hu Gan slowly raised his hand. Finally, under countless number of gazes, it fell suddenly, “The final round of the Inner Academy Qualifying Competition will now begin!”</p><br/><p>“Bang!”</p><br/><p>As Hu Gan’s hand fell, the originally quiet arena immediate let out a bang. A rainbow of different colored Dou Qi abruptly erupted in a dazzling fashion. Following a muffled sound being emitted, the human figures in the arena quickly flashed. Most of the people flew swiftly toward the edge of the arena. They were all afraid that there would be someone using an underhanded method to throw them out in this kind of situation, where enemies were everywhere.</p><br/><p>Those in the viewing gallery watched the arena where a fight had broken out almost as soon as the competition began. They immediately let out sharp, excited cries which resounded throughout the clouds. Many people tore their throats as they cheered for the competitors whom they liked. This kind of huge grand battle had a stimulation that far exceeded round after round of one on one fights.</p><br/><p>“Ke ke, Deputy Headmaster, this is not a bad idea. Although it cannot be considered absolutely fair, this kind of scene where one has to take precautions against sneak attacks all the time will make it extremely easy to cultivate a person’s cautious mindset. Moreover, the people who join hands will also gradually understand the strength of a group. This method is not bad.” As he eyed the chaotic arena, an old man in the central viewing gallery turned around and spoke to Hu Gan beside him.</p><br/><p>“I am also sick of watching the one on one battles in the past, therefore, I wanted to change it to something new to try. From the looks of it now, it appears to be quite good. However, some students, who are usually not good at communicating, will not have anyone trustworthy to help guard their backs in this kind of situation where enemies are all around. They are likely going to struggle a little.” Hu Gan smiled as he spoke and threw his gaze back to the chaotic battle.</p><br/><p>There would be frequent head-on battles within the arena at this moment. However, it was clear that many people were afraid of an underhanded attack from behind. Therefore, even when fighting with one another, they would merely make contact and pull back, not daring to get tangled up in a fight. Their gaze repeatedly swept cautiously in all directions. Anyone who dared to charge into their territory would cause them to swiftly pull back or attack like a bird startled by a bowstring (panicstricken person).</p><br/><p>Although the initial competition was extremely chaotic, some students had become much smarter after seven or eight people were attacked successively and were struck out of the competition while spitting out blood. There were people who saw each other daily and quickly put in good words to draw people together. Those who did not could only pull back and search for similarly solitary people who did not have any companions. Although this kind of improvised groups did not have a good relationship or great trust between each other, this was currently the only method.</p><br/><p>Xiao Yan tilted the heavy ruler in his hand to one side while standing with Xun Er on the edge of the arena. A green-colored and yellow-colored Dou Qi wrapped around the two of them. Two extremely powerful Qis seeped out from their bodies. Those competitors who had become a little giddy because of the chaos in the arena, were frightened until they dared not carelessly charge over to this area.</p><br/><p>Currently, the two of them did not charge into the totally chaotic battleground. They knew that this kind of extremely chaotic atmosphere would not last too long. As long as Bai Shan and the others gathered their people, the chaos in the arena would gradually descend into a situation where a few strong groups survived. Then they would respect the other groups and the chaos would be greatly reduced. However, that time would be when the two of them would face a real battle.</p><br/><p>Under the numerous cries and shouts from the viewing gallery that shook the sky and ground, competitors were being repeatedly knocked out of the arena from within the competition ground. The moment this happened, the recording officers, who were already around the arena, would swiftly record the competitors who had been knocked out of the arena.</p><br/><p>As time slowly flowed by with the shouting that permeated the sky, the chaos in the battleground finally began to show the trend of being reduced. With the examples of those who were miserably struck out as lessons, some scattered individuals also began to learn how to look for companions. In a short while, the chaotic fights in the arena were greatly reduced. There were also more and more of those small groups which were formed by two or more people.</p><br/><p>Following the change from individual chaotic battles to a group battle, Xiao Yan and Xun Er finally could no longer remain isolated from the fight. When a small group, consisting of four men, failed in their attempt to surround and attack them and were instead struck out of the arena one after another, Xiao Yan abandoned his ‘wait and see’ action. His hand held the Heavy Xuan Ruler tightly while he took heavy footsteps. Green-colored Dou Qi surged out of his body like a flood, and the powerful suppressive strength of a Da Dou Shi swept horizontally across the entire arena!</p><br/><p>However, not long after Xiao Yan unleashed his strength of a Da Dou Shi, five similarly strong strengths also erupted within the chaotic battleground. They were separated into small groups that occupied each of the four corners of the arena.</p><br/><p>Xiao Yan’s gaze moved to the places where the strengths erupted, causing him to look over. He saw that other than the three of them belonging to Bai Shan, Hu Jia, and Wu Hao, the other two were men that he had never seen before. Behind each of these two men were a cluster of four or five competitors, whose strength were clearly not weak. With the exception of Bai Shan and the two others, this group was the strongest one.</p><br/><p>At this moment, the strengths of most of the groups were clearly displayed. Among them, the strongest three were naturally Bai Shan’s, Hu Jia’s, and Wu Hao’s groups. Between the three of them, Wu Hao’s group’s strength was the strongest. Other than them, it was the two groups earlier which possessed a Da Dou Shi each. These five groups belonged to the strongest ones in the arena. Other than them, there were some scattered two man groups, or even individuals. Xiao Yan and Xun Er belonged to the so-called two man small groups.</p><br/><p>Although their numbers were far from those six man groups, no one dared to underestimate their small group. It was not because of any reason other than that this group was formed by Xiao Yan and Xun Er!</p><br/><p>Any one of the two of them could squeeze into the top five in terms of individual strength. Now that the two strong people had teamed up, even strong people like Bai Shan, Wu Hao, Hu Jia, and others viewed them as strong opponents who hindered them.</p><br/><p>“Xiao Yan ge-ge, where should we fight now?” Xun Er tilted her head and asked with a smile. She glanced at the clearly distinct territories in the arena.</p><br/><p>“Let’s wait for a moment. There are at least thirty people still in the arena. This includes Bai Sha, Wu Hao, and other strong people. If the two of us don’t display our trump cards, I’m afraid that it is really impossible to completely block all of them. Therefore, we can only wait for them to exhaust each other. Perhaps Bai Shan and the other two might want to defeat us but they are also afraid that someone will strike them ruthlessly from behind. Therefore, within a short while, we need not worry about being attacked.” Xiao Yan waved the Heavy Xuan Ruler in his hand, and supported it with his shoulders.</p><br/><p>Xun Er smiled slightly and nodded. She moved her delicate hand and an eye-piercing golden light was stretched out from her palm. The strong energy contained in the golden light was something that even Xiao Yan, by her side, gave a sideward glance at.</p><br/><p>It was just as Xiao Yan had said. Although Bai Shan and the two others viewed Xiao Yan’s two-man group as their greatest opponent, they did not dare to attack at this moment. The three groups exchanged glances and immediately began to eliminate those scattered, small groups with a tacit agreement. Only after completely eliminating or swallowing these small groups would they be able to begin the final fight.</p><br/><p>Following the start of the extermination by these three groups, other than Xiao Yan’s and Xun Er’s small, two-man group within the arena, the remaining groups crumbled apart not long after coming into contact with these opponents. There were some who were lucky to escape, but most of them were forcefully expelled from the arena.</p><br/><p>Xiao Yan narrowed his eyes and watched those scattered competitors, who had been expelled until they were fleeing in all directions. He mused slightly before wildly taking a step forward in front of the gazes in the entire arena. He cried out with a deep voice, “Those people who don’t have a group. If you don’t wish to get a lousy ranking, you can come over to this side.”</p><br/><p>When they heard Xiao Yan’s cry, those competitors in the arena who had nowhere to run, immediately wildly rejoiced. As they faced being expelled by three of the strongest groups, even the other two groups who had Da Dou Shi present did not dare to accept them. Now that Xiao Yan had stepped forward, they would naturally be like drowning people grabbing the last straw as they hurriedly ran in the direction that Xiao Yan and Xun Er were in.</p><br/><p>This cry from Xiao Yan directly caused the remaining seven competitors in the arena to be embraced under his arm. In an instant, the small group, which only had two people, immediately soared to having a number of people which could contend with those groups of Bai Shan and the others. Of course, this was only in terms of numbers. Those people in the groups of Bai Shan and the two others clearly had a strength that surpassed the people in Xiao Yan’s hands, who had been forced to flee in all directions.</p><br/><p>However, Xiao Yan did not have the wishful thinking that he could defeat Bai Shan and the others by relying on these competitors. He only needed these people to exhaust some of the people his opponents had.</p><br/><p>Although this action of Xiao Yan had managed to buy people’s hearts, it caused the three strongest groups belonging to Bai Shan, Hu Jia, and Wu Hao to be a little dissatisfied. The last two were a little better but Bai Shan was one who really did not want his actions to benefit others. Moreover, this other person was Xiao Yan, whom he disliked the most. Therefore, his expression gradually became gloomy. He waved his hand and eight competitors, who were quite strong, followed him as they slowly walked in the direction where Xiao Yan’s group was standing. From the looks of it, they were actually directly declaring war on Xiao Yan’s group.</p><br/><p>“Chi.”</p><br/><p>Seeing Bai Shan’s group, whose faces were dark and solemn, come over, Xiao Yan raised his eyebrows. The heavy ruler in his hand carried the sound of pressuring wind as it rolled off his shoulders. He coldly smiled and asked, “What? You cannot endure any longer?”</p><br/><p>Xun Er, who was beside Xiao Yan, also glanced over at Bai Shan and the others. The golden-colored Dou Qi that shrouded the surface of her body became increasingly dense, awaiting the huge battle.</p><br/><p>“Four of you, go and expel the scattered individuals behind Xiao Yan. Another four will go and temporarily hold off Junior Xun Er. Leave Xiao Yan to me.” Bai Shan’s hand shook slightly and a long, silver-white lance flashed and appeared. A faint glow flowed on the body of the lance. One look at it and one would know that it was a weapon with a Monster Core inserted. As he held this long lance, he began to issue instructions blandly.</p><br/><p>Upon hearing Bai Shan’s order, the eight people behind him immediately began spreading out, dividing the work.</p><br/><p>“Xun Er, prepare to fight.” Xiao Yan tilted his head, smiled, and spoke upon seeing that Bai Shan’s group had spread out like a fan as they headed over.</p><br/><p>“Yes.” Xun Er nodded slightly. She was truly mesmerizing as the golden glow shrouded her body.</p><br/><p>The moment Bai Shan’s group began the attack, Wu Hao and Hu Jia also began to expel the other two remaining groups.</p><br/><p>The most exciting and heart-stirring head-on fight in this chaotic battle had finally arrived!</p><br/><p>At this moment, the sharp shouting and cheering from the surrounding viewing gallery sounded like a thunderclap.</p><br/>\n</div>"}