{"title": "Chapter 426: The End of the Competition", "id": 426, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-426-the-end-of-the-competition", "volume_title": "Volume 5", "body": "<h1>Chapter 426: The End of the Competition</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 426: The End of the Competition</u></strong></p><br/><p>The sudden attack of Xiao Yan in the arena was beyond anyone’s expectations. Moreover, the former attack was completed in a mere instant. Hence, many people in the viewing gallery could only see a black shadow flashing within the arena. Immediately after, there were three muffled sounds, and finally Bai Shan, Hu Jia, and Wu Hao each vomited blood and were forced back before smashing heavily into rocks.</p><br/><p>The audience watched Bai Shan and the two others, who were leaning against rock walls, struggling futilely as they made attempts with great difficulty to get up, the entire stadium was quiet. Numerous gazes, that were almost dull, stared at the tall, young man in the arena. At this moment, there was a chill that seeped out from the hearts of a countless number of people. This fellow, who usually appeared to wear a smile, was actually the most terrifying one...</p><br/><p>In the viewing gallery, Instructor Ruo Ling and Xiao Yu were similarly stunned. It was a long while before they exchanged looks with one another. Earlier, the manner of Bai Shan and the other two clearly indicated that they were in a defeated state. It was really unexpected that Xiao Yan actually gave another ferocious additional strike. Many people, including the two of them, understood that this was the revenge Xiao Yan took on behalf of Xun Er for that kick...</p><br/><p>The Deputy Headmaster, Hu Gan, and the others on the middle of the organizer’s platform in the stadium were also stunned. A long while later, Hu Gan eyed the pale-faced Hu Jia, who had a trace of blood at the corner of her mouth. His heart felt a little pained. Finally, however, he could only helplessly sigh. He had said earlier that he would not intervene in the matters between the younger generation. Since he had not said anything when Hu Jia and the other two had joined hands together to attack Xun Er and Xiao Yan earlier, now that Xiao Yan’s strength had greatly soared and defeated the three of them openly in front of a countless number of people, he had no reason to open his mouth to reprimand Xiao Yan’s actions. Hu Jia and the other two had only themselves to blame. Therefore, he had no choice other than to sigh and shake his head.</p><br/><p>“Ke ke, this Xiao Yan is ruthless enough.” On one side, Old Huo’s gaze stared at Xiao Yan in the arena, and ignored the helpless expression of the Deputy Headmaster. He nodded his head and an ugly smile surfaced on his stiff face for the first time.</p><br/><p>“Deputy Headmaster, this… is this considered against the rules?” A middle-aged judge in the judges’ seats had a face filled with a bitter smile while he eyed the Deputy Headmaster and the others on the platform above as he carefully asked. If Hu Jia was not present in the arena, he would not have much to fear. Unfortunately, that Little Witch was among them. Moreover, she was beaten to such a miserable state. Honestly speaking, having been in Jia Nan Academy for many years, it was the first time that he had seen someone who dared beat Hu Jia ,without mercy, to such a state. This was also not only because of her background but also because Hu Jia herself was an extremely pretty lady. Although her character was unrestrained, causing people to be unable to understand her but her angel-like face and devil-like figure also resulted in quite a number of people in the academy liking her. When fighting against this kind of lady, there were many people in the academy who would give in to her, even if they could win. Very seldom would one see a person like Xiao Yan, who would not show any mercy because of any scruples.</p><br/><p>“The competition this time around was originally not considered to be absolutely fair. Therefore, Xiao Yan also cannot be considered to have violated the rules. After all, we have all clearly seen his strength.” The Deputy Headmaster waved his hand and sighed. He immediately turned his gaze toward Hu Jia in the arena and said in his heart, “Girl, treat it as buying a lesson this time around. Being under my protection all these years has resulted in everything being too smooth for you. Being able to have this Xiao Yan knock you around has some benefits for you.”</p><br/><p>Xiao Yan exhaled a long breath of air in the arena. He ignored the dull gazes of the entire stadium and turned his head to allow his gaze to meet that of the green-clothed young lady who was on top of a rock within the ruins. A warm smile was drawn on his cold face. Moving his body, Xiao Yan turning into a black shadow that appeared beside Xun Er. He extended his hand and wipe off the remanent trace of blood from the corner of her mouth before inquiring in a gentle manner, “Are you alright?”</p><br/><p>“It cannot even be considered a superficial wound.” Xun Er laughed softly. Her eyes immediately flowed over Xiao Yan’s body as she pursed up her lips and said with a smile, “It was really unexpected that Xiao Yan ge-ge would actually advance during the fight. It was really shocking.”</p><br/><p>Xiao Yan shook his head helplessly when he heard this. He patted Xun Er’s head before throwing his gaze toward the judges’ seats. He asked with a clear voice, “May I inquire if the final round of the Qualifying Competition can be considered over now? If not, I can continue playing with the three of them.”</p><br/><p>“Yes, yes. The competition is over. Over.”</p><br/><p>One person from the judges’ seats hurriedly stood up and replied quickly when he heard Xiao Yan’s voice. The degree of ruthlessness that Xiao Yan had displayed earlier had already far exceeded their expectations. If they were to let him continue on like this, whether Bai Shan and the two others could leave the competition ground alive may be questionable. The background of the three of them were not ordinary. Should something happen, quite a lot of trouble would brew forth.</p><br/><p>“The Inner Academy Qualifying Competition this year is over. After an intense fight, the top five have already appeared. They are Xiao Yan, Xiao Xun Er, Wu Hao, Hu Jia, and Bai Shan!” A judge, who was older, stood up from the judges’ seats, looked around the stadium before immediately announcing in a loud voice.</p><br/><p>Once his voice sounded, overwhelming cheers suddenly rang out from the entire stadium. In this torrent-like sound wave, the entire stadium trembled as it emitted a rustling sound. A countless number of people from the viewing gallery stood up and eyed the young man and young lady, who were standing by themselves amid the rubble. Those people’s eyes were filled with envy and respect. Xiao Yan had used his own true strength to announce to everyone who the strongest person in Jia Nan Academy was this time around. At the same time, he let them know that he, Xiao Yan, had the right to be with an extremely gifted girl, favored by the heavens, like Xun Er!</p><br/><p>All of this was built upon his strength and his fists. In this academy, where strength was honored, only this method was the most convincing reasoning!</p><br/><p>While they heard the cheers and cries that reverberated throughout the entire stadium, Bai Shan, Hu Jia, and Wu Hao within the middle of the ruins, each leaned their backs against the rock wall. Their slightly twitching faces indicated the intense pain that was being transmitted from within their bodies. That earlier blow Xiao Yan had given to each of them had not shown the slightest mercy. Currently, the three of them had already completely lost their fighting strength. Moreover, it was unlikely the injuries of theirs would fully recover without seven or eight days of rest.</p><br/><p>Their hurried breathing was somewhat disorderly. The three of them raised their heads and threw their gaze toward the young man and young lady standing above the rubble. The main characters of this entire arena were now them.</p><br/><p>“This bastard, he attacked so strongly. He really isn’t a man!” The back of Hu Jia’s teeth bit her red lip. At this moment, her originally clever and sly pupils had partially visible grievances and moisture. In all these years, this was the first time that she had been thwarted by a man. Moreover, that man’s age hardly differed from hers. This caused her haughty heart to really have some difficulty accepting the outcome.</p><br/><p>“Xiao Yan, you are very strong, but I believe that I will surpass you!” Wu Hao held his chest as he let out a couple of intense coughs. A sleek redness surged onto his pale face. A heat filled his eyes. The setback he received earlier not only did not cause him to be dispirited but instead it evoked a fighting spirit within him due to Xiao Yan’s strength. This kind of character, where one became more courageous the more he was defeated, was basically an accelerator to him becoming a strong person. No wonder that Elder of the academy has disclosed that even the mysterious Headmaster said that if Wu Hao were given ten years time, he would definitely become an extremely strong person as long as he was not destroyed by his killing aura!</p><br/><p>“This matter is not considered to be over! I, Bai Shan, will definitely get you to pay for the humiliation today a hundred times over! Xiao Yan, just you wait! Sooner or later, I will let you kneel at my feet!” A pernicious glint flashed over Bai Shan’s downcast eyes. He clenched his fist tightly. At this moment, he could not even move his back a little. That heavy strike from Xiao Yan earlier had already broken a couple of his bones. However, compared to the pain on his body, the frustration and the blow to his heart was the one that Bai Shan had the greatest difficulty enduring.</p><br/><p>During these two years, he was pushed toward being an outstanding person with the highest profile within the Outer Academy through a countless number of compliments. Today, however, this title of the so-called “person of the year” was actually fragmented by Xiao Yan’s brutal attacks. In the future, when the people of Jia Nan Academy mentioned Bai Shan, they would not be filled with respect like they did when they looked up to him in the past. This was because there would forever be one person standing above his head. That person was the existence whom they respected and looked up to. This kind of situation was undoubtedly more difficult for Bai Shan, whose character was exceptionally arrogant, to accept than if he had lost his life.</p><br/><p>Once someone fell after mounting the genius shrine, whom people looked up to, they would feel as though they had an extremely great fall. Many people were unable to bear the dispiritedness or the distortion in one’s heart from this kind of fall. It was almost so for the Xiao Yan back then. The current Bai Shan was also the same!</p><br/><p>The current Xiao Yan naturally did not bother about the different emotions within the hearts of the three of them. He only knew that now that he had obtained the permit to enter the Inner Academy, the distance between him and the ‘Fallen Heart Flame’ was much closer. He had even begun to anticipate just what kind of drastic and immense change would occur after he absorbed the second kind of ‘Heavenly Flame’? Yao Lao had once said that for the ‘Flame Mantra’ swallowing one kind of flame was just a foundation. Only after the second kind of ‘Heavenly Flame’ was also successfully swallowed and the two different flames merged would it cause someone to undergo a thorough change as though one was reborn! Xiao Yan anticipated this kind of feeling. This was because he could faintly tell that after being reborn this time around, it might really let him become a truly strong person!</p><br/><p>A strong person who had the ability to seek revenge and protect his own kin! Something different from now where he needed to borrow Yao Lao’s ability for everything!</p><br/><p>“‘Fallen Heart Flame’, you belong to me!” Xiao Yan tightened his fist. His emotions surged a little. As long as he obtained that thing, he would truly possess the qualification to be among the strong people in the continent!</p><br/><p>As the judge announced the competition to be over, some students wearing alchemist robes flashed down from all over the viewing gallery. They entered the arena and lifted Bai Shan and the two others, who were seriously wounded, before scattering and leaving the place.</p><br/><p>“Hei, Xiao Yan, excellent job. Your methods… I, Lu Mu, really take my hat off for you. However, you may have obtained victory today but it is likely that you have offended all three of those fellows. If you have the chance in the future, come and muddle in the Alchemist Department. In this Jia Nan Academy, not even the Deputy Headmaster nor the Law Enforcement Unit dare to do anything drastic to people from our Alchemist Department.” A young man who was giving orders to the students from the Alchemist Department to carry away those injured suddenly turned his head over and threw his gaze toward Xiao Yan. It was actually Lu Mu, who was defeated by Xiao Yan yesterday.</p><br/><p>“Ke ke, if there is an opportunity, I naturally also want to go to the Alchemist Department to take a look.” Xiao Yan smiled as he replied. Which part of his calm manner could one see even a little of the tyranny earlier?</p><br/><p>Lu Mu smiled, turned around and followed the Alchemist group out of the competition ground.</p><br/><p>“Let’s go, the competition is over. Now, let’s wait for the notice from the Inner Academy.” Xiao Yan eyed the surrounding ruins before he spoke with a smile to Xun Er.</p><br/><p>“Yes.” Xun Er nodded with a smile. The two of them slowly walked out of the thundering noisy stadium while watched by a countless number of gazes.</p><br/><p>The largest annual competition gradually came to an end as the two of them took their leave.</p><br/>\n</div>"}