{"title": "Chapter 422: Fight", "id": 422, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-422-fight", "volume_title": "Volume 5", "body": "<h1>Chapter 422: Fight</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 422: Fight</u></strong></p><br/><p>The fist carried a hot, green-colored flame. Although it had yet to come in contact with his body, Bai Shan could still sense a burning pain, which he could not endure, erupt from his skin. He clenched his teeth to withstand the pain. Silver light once again surged and appeared on his feet. With a sway of his body, it strangely flashed and withdrew a couple of meters.</p><br/><p>However, just as Bai Shan withdrew out of Xiao Yan’s attacking range, the green figure in front of him flashed again before he had the time to lift his lance to attack. Xiao Yan’s indifferent face once again appeared in front of Bai Shan. Both of Xiao Yan’s fists appeared to be crazy as they created more than ten afterimages and ruthlessly smashed toward various parts of Bai Shan’s body. Each and every punch landed on flesh. For a period of time, the muffled sound of fist contacting flesh repeatedly sounded within the arena.</p><br/><p>“Bastard!”</p><br/><p>The waves of pain that were transmitted from all over his body caused the anger within Bai Shan’s heart to surge. Xiao Yan’s attacks were all unleashed at close range. This kind of distance did not allow him to display his lance skills. Although using the ‘Wind Lightning Movement’ Agility Dou Technique could allow him to pull some distance away, Xiao Yan, who had removed the restraint of the Heavy Xuan Ruler, was coincidentally able to use his great increase in speed to catch up with Bai Shan. Therefore, it was completely futile no matter how Bai Shan used the ‘Wind Lightning Movement’ to increase the distance between him and Xiao Yan.</p><br/><p>If he pulled back by two meters, Xiao Yan would follow and advance by two meters. No matter what happened, Xiao Yan always engaged in close combat with Bai Shan, not giving Bai Shan any opportunity to display his lance techniques. Bai Shan, who had lost the help of his strongest weapon, was undoubtedly a great tragedy when engaging in hand to hand combat with Xiao Yan.</p><br/><p>The Xiao Yan holding the Heavy Xuan Ruler was not terrifying. What was frightening was the Xiao Yan who had escaped the restraint of the weight of the Heavy Xuan Ruler as well as the strange effect of suppressed Dou Qi in his body.</p><br/><p>Perhaps Bai Shan could still use his lightning affinity Dou Qi and his outstanding lance techniques to fight with the Xiao Yan when he was holding the Heavy Xuan Ruler. However, in hand to hand combat, Bai Shan’s best option was to create a gap between the two of them as soon as possible. However, he was completely suppressed by Xiao Yan on this point. Therefore, a moment of carelessness would cause him to fall into a situation where he could not turn things around.</p><br/><p>Xiao Yan had basically turned into a vague black shadow that repeatedly shuttled around Bai Shan. His fists carried waves of ferocious wind as they violently struck Bai Shan’s body, which was completely covered with silver-colored Dou Qi. At this moment, the fist, palm, arm, elbow, leg, knee… any part of Xiao Yan’s body could turn into an attack weapon. As he waved his fists, there were afterimages that repeatedly appeared.</p><br/><p>Faced with Xiao Yan’s nearly insane melee attacks, the long lance in Bai Shan’s hand was snatched away. Although he occasionally used his fist to exchange one or two blows with Xiao Yan, was the ‘Green Lotus Core Flame,’ wrapped around Xiao Yan’s body, an ordinary thing? Each time they exchanged blows, a red swell would appear on Bai Shan’s fist. If he did not have the protection of Dou Qi, it was likely that his skin would be incinerated into pig trotters by the high temperature of the ‘Green Lotus Core Flame’ the moment it came into contact with him.</p><br/><p>In the arena, Bai Shan, who had been acting pompous earlier, had suddenly turned into a conspicuous punching bag that could only take a beating. This extremely drastic change caused a countless number of people in the viewing gallery to be totally stunned. Was that Bai Shan being chased and beaten by Xiao Yan, having no means of fighting back, really that powerful and influential genius within the academy?</p><br/><p>“Crazy fellow…” Instructor Ruo Ling’s and Xiao Yu’s faces were similarly completely stunned as they eyed Xiao Yan, who was performing his outburst. They did not expect that this fellow, who appeared to be gentle, would actually be this frightening when he was fighting seriously…</p><br/><p>“That flame on Xiao Yan’s body should be… a ‘Heavenly Flame’, right?” The old man in the middle seats of the stadium, who was addressed as Old Huo by Hu Gan, eyed the green-colored flame burning on Xiao Yan’s body. His usually calm expression had finally changed a lot as he slowly spoke.</p><br/><p>“Yes, that should be true. A temperature that would cause even us to feel some fear. It is indeed a ‘Heavenly Flame.’ It’s just that I don’t know what kind of flame it is. If Xiao Yan were to display this ‘Heavenly Flame’ when his strength has increased a little more, even a strong Dou Wang may not dare to easily receive it.” Hu Gan nodded and said.</p><br/><p>“This Xiao Yan, my Alchemist Department wants him…” Old Huo mused for a moment before he immediately spoke in a soft tone.</p><br/><p>“Uh? He is someone going into the Inner Academy, Old Huo.” Hu Gan was startled as he spoke after hearing this.</p><br/><p>“Entering the Inner Academy and entering the Alchemist Department does not conflict with one another. Xiao Yan is also an alchemist. It would only benefit him if he comes to the Alchemist Department. Moreover, this would also not hinder his training in the inner academy.” Old Huo replied faintly.</p><br/><p>“In that case, do as you please. I have no objections as long as you are able to get him to enter the Alchemist Department. After all, it is more than what I can wish for to be able to add another outstanding alchemist to the academy.” Hu Gan shook his head as he spoke with a smile.</p><br/><p>Old Huo nodded slightly, but no longer spoke. He continued to throw his gaze into the arena. Those indifferent, old eyes of his stared intently at the green-colored flame rising on Xiao Yan’s body. An extremely rare emotion of envy flashed across his eyes a long while later.</p><br/><p>Another punch violently smashed into Bai Shan’s chest. Immediately, a soft ‘Ka Cha’ sound suddenly sounded. Xiao Yan smiled coldly as he eyed the slowly shattering Dou Qi Armor on Bai Shan’s body. Another kick shot out, landing heavily on Bai Shan’s stomach. A loud sound could be heard, and the lightning Dou Qi Armor on the surface of Bai Shan’s body was actually forcefully broken by Xiao Yan.</p><br/><p>The force of this kick from Xiao Yan was extremely great. Therefore, Bai Shan bounced against the ground of the arena for dozens of meters before he came to a slow stop. He could not resist spitting out a mouthful of fresh blood. With a pale expression, he grit his teeth and stood up with a quivering body. After viciously looking at Xiao Yan in the distance, he took out a black-colored medicinal pill from within his storage ring, stuffed it into his mouth and swallowed it.</p><br/><p>At this moment, Xiao Yan was not in a hurry to bother about Bai Shan’s action. This was because he had discovered that seemingly graceful, naturally flowing Dou Qi in his body had actually began to become extremely turbulent during that wild hand to hand combat. Waves of Dou Qi flowed wildly within his Qi Paths. The air around Xiao Yan also began to fluctuate swiftly. Threads of pure energy were forming with a gushing and pouring tendency as they surged into Xiao Yan’s body. From the looks of it, it was clearly the activity that only occurred just before one was about to advance in strength!</p><br/><p>Xiao Yan actually luckily achieved the opportunity to break through during the continuous and thoroughly unconcerned display of his physical attacks earlier. This resulted in the automatic flow of Dou Qi into his body. His strength was also beginning to rise naturally as though everything had fallen into place!</p><br/><p>However, the place to raise his strength appeared to be quite bad….</p><br/><p>The activity that Xiao Yan had created could naturally not escape some of the people with good eyesight. Therefore, shocked shouting of “Xiao Yan is actually advancing his strength in combat?” quickly followed. This sounded one after another from the viewing gallery. A countless number of people were stunned as they watched the human figure, who was wrapped in the green-colored flame. Why was it that this fellow always did things that caused people to be stunned? The fight in the arena was now of a crucial moment. Yet, he actually suddenly gained the chance to advance his strength at this moment. This really caused people to be unable to laugh or cry at his luck.</p><br/><p>It should be known that when one was increasing their strength, one cannot receive too much interference. Otherwise, if it were mild interference, one would be injured, if it were serious interference, one’s life could be in danger. If it was during a normal time, many people would envy him greatly when such an event occurred. However, who would think that this situation was a place to raise one’s strength?</p><br/><p>“No way?” At this moment, Xiao Yan could not resist letting out a curse at this sudden situation that had occurred. He also understood that it was basically impossible for him to quietly raise his strength in this situation. In addition, Xiao Yan had not the slightest intention to push forward his advancement this time around. It had automatically found him and did not allow Xiao Yan to reject it. This was the point where Xiao Yan felt unable to laugh or cry. In the past, this kind of condition did not come despite him begging over a hundred times. Now that he did not want it to arrive, it actually caught up with him.</p><br/><p>“Ha ha, Xiao Yan, looks like even the heavens are helping me!” A nearly abnormal flush suddenly surged onto Bai Shan’s pale face after he consumed that pale black medicinal pill. His originally weak Qi had also abruptly soared by quite a lot. When he saw Xiao Yan standing in the same spot, unable to move and the activity around him, he came to a sudden understanding. He could not help but laugh wildly. His palm sucked at the long, silver-colored lance, which had fallen some distance away and the long lance turned into a dark shadow which shot into Bai Shan’s hand.</p><br/><p>“Xiao Yan ge-ge, you can complete your advancement. I will help you temporarily hold them back!” A pale golden figure suddenly flashed in front of Xiao Yan as Xun Er smiled and said. At this moment, the eight competitors under Bai Shan had already been totally expelled out of the arena by her.</p><br/><p>“Give me ten minutes.” Xiao Yan hesitated for a moment before clenching his teeth and nodding. He immediately and hurriedly sat cross-legged on the ground, sunk his mind into his body and controlled the energy that was wildly entering his body.</p><br/><p>Xun Er eyed Xiao Yan as he closed his eyes and controlled the disordered interior of his body. She then turned her cold gaze toward Bai Shan. A golden glow flashed on her delicate hand as she faintly said, “If you want to come over, just attack. However, I will no longer hold anything back.”</p><br/><p>Hearing these extreme words of Xun Er, a ferocity suddenly surged onto Bai Shan’s face. He inhaled a deep breath of air and suppressed the fury in his heart. Suddenly he turned his gaze toward the other side of the arena. At that spot, the groups led up Wu Hao and Hu Jia, had coincidentally , expelled the two groups who had Da Dou Shis, allowing the to take charge of the arena. At this moment, Wu Hao and Hu Jia had also clearly sensed the strange movement around Xiao Yan. Their faces were immediately astonished. Clearly, even they did not expect that Xiao Yan would meet an opportunity to raise his strength during such a situation.</p><br/><p>“Wu Hao, Hu Jia, I think that we can perhaps join hands to first get rid of Xiao Yan and Xun Er. You should also know the strength of the two of them. Moreover, Xiao Yan is now in a breakthrough stage. If he is to successfully breakthrough, his strength would greatly rise to another level. At that time, can the two of you, who fight by yourselves, stop the two of them? If this continues, we would sooner or later be defeated!” Bai Shan’s soft voice suddenly sounded by their ears just as Wu Hao and Hu Jia were feeling surprised at the strange action of Xiao Yan.</p><br/><p>The two of them were startled when they heard Bai Shan’s words and immediately knit their brows tightly together.</p><br/><p>“Hei, don’t the both of you covet Junior Xun Er? If we can get Xiao Yan out of the competition, then he would lose the qualification of entering the top five. With your status, you should know that the top five has a special examination. At that time, we will be together with Junior Xun Er. Without Xiao Yan, that annoying brat, we will only need to see who can move Junior Xun Er’s heart.” Bai Shan’s voice continued to hover over the ears of the both of them, “Hu Jia, you cannot find a second girl who has a greater temperament than Junior Xun Er in the entire Jia Nan Academy. Do you want to see her ruined by Xiao Yan? And Wu Hao, in so many years, Junior Xun Er is the only person who has moved your heart. If Xiao Yan continues to be by Xun Er side, when would you get an opportunity? Therefore, he is our common enemy! Don’t hesitate any longer. If Xiao Yan is allowed to successfully advance his strength, the ones who fail will be us!”</p><br/><p>Bai Shan’s words caused Wu Hao’s and Hu Jia’s expressions to change slightly. These words has coincidentally stomped on their weakness. A long while later, they exchanged glances and nodded. In deep voices, they replied, “Alright, let’s first get rid of Xiao Yan from the competition.”</p><br/>\n</div>"}