{"title": "Chapter 434: Tiger Roar Shaking The Mountain Forest", "id": 434, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-434-tiger-roar-shaking-the-mountain-forest", "volume_title": "Volume 5", "body": "<h1>Chapter 434: Tiger Roar Shaking The Mountain Forest</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 434: Tiger Roar Shaking The Mountain Forest</u></strong></p><br/><p>The gentle breeze blew over the endless sea of trees causing the branches to sway. The sea of trees were scattered with bursts of green-colored waves that spread out towards the edge of one’s sight.</p><br/><p>Within the sea of trees, there would occasionally be a silver, river-like waterfall present as ornaments. It carried a loud bang as well as a fog rose up and permeated the sky. Under the waterfall, the fog was spread over the surface of the lake, appearing hazy as though one was in the territory of the immortals.</p><br/><p>There, a black-robed young man was seated cross-legged on a huge rock on the edge of the lake. His hands formed the training seal and the air around his body fluctuated slightly. Threads of faint energy surfaced and unceasingly poured into the young man’s body.</p><br/><p>The clean and transparent lake, where one could see the bottom, contained the rumbling sound of the waterfall, and a dense fog filled the air. It was an artistic scene formed from its special environment. Under this environment, the energy, which swarmed out from the air surrounding the black-robed young man, was also becoming increasingly dense. The young man did not refuse the energy that came to him. His body was like a black hole which could not be filled, swallowing all that came near him and refining them.</p><br/><p>After training for an hour, the energy surrounding Xiao Yan finally began to gradually become faint. His eyelashes moved a little before he slowly opened his eyes. A clear glint shone in his dark, black eyes and disappeared swiftly.</p><br/><p>“This place is not a bad place to use for training. In just two short days, the Dou Qi in my body has been enhanced by quite a lot. According to this training speed, I might be able to advance to a seven star Da Dou Shi if I was to train here for two months.” Xiao Yan undid the seal formed by his hand and sensed the surging and flowing Dou Qi in his body as he whispered in a somewhat surprised voice.</p><br/><p>“Unfortunately, after two days of tough training, I still have not learned the trick to the ‘Lion Tiger Gold Shattering Roar’ despite having the help of the ‘Icy Spirit Throat Protecting Liquid’. Although I am now able to barely emit a sound wave, its attacking strength is too weak. It basically cannot be used to face an opponent.” Xiao Yan slowly stood up, flipped his hand, and placed it on the huge rock. He eyed the calm surface of the lake and sighed with a bitter smile.</p><br/><p>After sighing gently, Xiao Yan shook his head. He threw aside the helplessness in his heart as his gaze stopped on the calm surface of the lake, where no ripples were formed. A long while later, he slowly closed his eyes and raised his head slightly. His Spiritual Perception broke out of his body and quietly spread out. Finally, it covered the entire surface of the lake.</p><br/><p>Being wrapped by the Spiritual Perception, the quiet atmosphere that the small lake carried was instantly amplified by many dozens of times. Under the influence of this quiet atmosphere, Xiao Yan’s originally somewhat impetuous heart also gradually recovered its calmness.</p><br/><p>The black-robed young man placed his hands behind him on the huge rock as he stood up. His body was as straight as a pen, much like a long spear releasing a sharp cold aura, its vigor threatening others.</p><br/><p>Xiao Yan did not know how long he stood like this. That roaring sound of the waterfall crashing downwards suddenly gradually became more faint in his ears. At this moment, the entire world in Xiao Yan’s ears seemed to have descended into a somewhat short and bizarre temporary silence.</p><br/><p>The current him appeared to have borrowed the silent atmosphere of the lake’s surface to unknowingly enter a mysterious state.</p><br/><p>Xiao Yan was in a condition where everything was silent. At this moment, one strange roar after another swiftly flashed through his mind involuntarily. These roars were emitted by Xiao Yan during his training of the ‘Lion Tiger Gold Shattering Roar’ over the past two days. Under normal circumstances, he would not have realized the weirdness in his roar. However, during the recollection in his mind at that moment, he was like a machine that was extremely precise and accurate, identifying the tiny soundwaves from those roars.</p><br/><p>Countless number of roars sounded at the same time. One by one, the disagreement between each wierd sound wave was identified. After which, it was excluded. The roar, which was originally in disarray, began to faintly have the tendency of being synchronized. The quantity of roars also began to be reduced from the countless number, no… it could not be said to have been reduced. Instead, they had begun to merge together until they had become synchronized, turning into one single sound.</p><br/><p>The disarray in the roaring within his mind had become less and less under Xiao Yan’s nearly accustomed manner of identifying and eliminating. It also became increasingly louder and more clear.</p><br/><p>Under this strange condition, Xiao Yan did not have any concept of time. The only thing he could do in this kind of perplexing condition was to rely on his instinct to analyze the fluctuations of these roaring sounds until it achieved its final perfect form.</p><br/><p>Xiao Yan did not know how many hours the never-ending analysis continued for. However, he was slow to exit from that condition. This was because after the countless number of roaring perfectly merged into a single sound, there was no longer any progress. Although Xiao Yan also knew that the roaring sound at this moment could already be considered to have reached the initial stage of the ‘Lion Tiger Gold Shattering Roar’, he kept having the feeling that the roar seemed to be missing something…</p><br/><p>What is it missing? The thought in Xiao Yan’s mind circulated in a lightning like manner. However, he ultimately had difficulty searching for the thing he needed.</p><br/><p>“Roar!”</p><br/><p>Xiao Yan’s bitter pondering continued for an unknowingly long period of time. However, the instant before Xiao Yan had a premonition that this mysterious condition was about to disappear, a shocking roar, that shook the entire mountain forest, suddenly sounded from the mountain range in the outside world. The tiger roar followed the sea of trees and began to spread. Finally, it came mightily to the lake. The suppression that was contained in the tiger roar caused some wild beasts around the lake to completely become paralyzed.</p><br/><p>The clear and loud tiger roar was not isolated from that condition Xiao Yan was in. Therefore, that roar, which contain the might of the tiger, was transmitted directly into Xiao Yan’s ears.</p><br/><p>As the tiger roar entered his ears, the roaring sound in Xiao Yan’s mind, that had just undergone countless number of analysis in order to merge into one, suddenly fluctuated. At this moment, Xiao Yan heart suddenly brightened. What his own roar was lacking was this kind of true tiger’s might. Compared with a true tiger’s roar, his own roar merely had the shape!</p><br/><p>Within that incomparably clear mind of his, the tiger roar, which had entered his ear earlier, was actually put together and formed a winding substance-like silver-colored wave with extreme curvature. Under Xiao Yan’s control, this thread of waves began to merge with the most perfect roar of his, which he had analyzed earlier.</p><br/><p>The two sound waves entwined with one another and successfully merged perfectly without too much resistance.</p><br/><p>The moment the two sound waves merged, the mysterious condition Xiao Yan was in broke apart abruptly. He suddenly opened his eyes and a clear glint flashed through them explosively. He inhaled a deep breath of air and the Dou Qi flowed wildly within his body. A thread of dragon aura, which he had inherited from the ‘Yin-Yang Mysterious Dragon Pill’, swiftly surged out, and finally directly charged into his throat.</p><br/><p>“Roar!”</p><br/><p>Xiao Yan’s mouth filled slightly. His face was a little flushed as his hands suddenly formed a seal. His mouth widened. At that moment, a thunderclap-like loud tiger roar came explosively out of his mouth.</p><br/><p>The shapeless sound wave had just exited his mouth when the air in front of Xiao Yan began to fluctuate intensely. Immediately, the sound wave began expanding outwards in a lightning-like manner. He could only hear a loud bang. The calm lake surface appeared to have a bomb placed within it. A huge wave, that was seventy to eighty feet high, exploded and rose before falling with a bang. Splashes and fog covered the entire small valley in a thick mist.</p><br/><p>The sound of tiger roar was like angry lightning formed from densely placed storm clouds. It rolled and swept out with Xiao Yan as the center. Even the loud sound of the waterfall crashing downwards was covered by the tiger roar. One could even vaguely hear it five kilometers away. Anywhere the sound waves passed, hundreds of beasts felt weak. Even the spirit of some of the strong and powerful Magical Beasts quivered intensely due to the dragon aura that the tiger roar contained. Some of the weaker low rank Magical Beasts, who were also in close proximity from the lake, were actually directly shocked to death by this angry thunder-like sound wave.</p><br/><p>Just one roar from Xiao Yan was actually this terrifying!</p><br/><p>The roaring sound slowly became weaker a long while later. The fog that had permeated the small mountain valley also gradually disappeared. On the huge rock, the black-robed young man’s face was filled with excitement and shock as he eyed the messy ground all around him. He coughed intensely before muttered with great joy: “I have succeeded? This is the strength of the ‘Lion Tiger Gold Shattering Roar’? It is indeed very strong!”</p><br/><p>“You really are a boy blessed by the heavens. To actually be able to grasp the rhythm of the tiger roar within a short two days. Without undergoing half a year’s of tough training, normal people would definitely not be able to achieve this. Although you have borrowed the strength from entering that quiet condition in order to merge the tiger’s roar and use it for your own purpose, this speed and achievement really is extremely amazing.” Yao Lao’s voice suddenly sounded in Xiao Yan’s heart. When he saw the latter experiencing that strange situation earlier, even he could not help but feel amazed.</p><br/><p>Xiao Yan laughed when he heard this. He did not expect that by stumbling around, he would actually be able to enter into such a condition.</p><br/><p>“However, you should not be too happy. For now, you have merely grasped the initial stages of the ‘Lion Tiger Gold Shattering Roar’ and can barely display thirty to forty percent of its strength. Without some time to hone it, it will not be possible for you to reach complete mastery. Moreover, this kind of honing has no shortcuts.” Yao Lao reminded.</p><br/><p>“Yes.” Xiao Yan nodded. He twisted his neck and heard the clear cracking sound between his bones before he let out a long breath. Originally, he did not think of reaching complete mastery of the ‘Lion Tiger Gold Shattering Roar’. Being able to achieve his current achievement had already far exceeded his expectations. Therefore, he would not be too ambitious.</p><br/><p>“It is good that you know this. There is someone coming over, I will withdraw first…” Yao Lao completely disappeared after this without the slightest movement.</p><br/><p>Xiao Yan’s hand brushed the water from his clothes. His head turned towards the entrance of the small mountain valley. The tree branches moved slightly at that spot and a green-colored figure immediately flashed out in a lithe manner, much like a butterfly. Finally, she quietly stood on a small rock protruding at the side of the lake. Her silvery bell-like laughter was like the chanting of the mountain bell, causing Xiao Yan’s mind, which had not relaxed for two days and two nights, to quietly ease up.</p><br/><p>“Xiao Yan ge-ge, the two days of preparation is already up. Today, we are entering the Inner Academy. Are you prepared?” The green-clothed young lady raised her elegant and exquisite pretty face. She said smilingly with a gentle voice as she eyed the young man, whose body appeared even taller while standing on a huge rock with his arms behind his back.</p><br/><p>Xiao Yan nodded his head with a smile. He patted the large Heavy Xuan Ruler on his back. His toes pressed against the rock surface and his body turned into a black shadow that flashed and appeared at the exit of the mountain valley. After waving his hands at Xun Er, he immediately turned around and slowly walked out of the small mountain valley.</p><br/><p>“Inner Academy huh? I anticipate it greatly… hopefully it won’t disappoint me.”</p><br/><p>The human figure gradually disappeared within the thicket, leaving behind a faint voice that slowly resounded in this place.</p><br/>\n</div>"}