{"title": "Chapter 432: Lion Tiger Gold Shattering Roar", "id": 432, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-432-lion-tiger-gold-shattering-roar", "volume_title": "Volume 5", "body": "<h1>Chapter 432: Lion Tiger Gold Shattering Roar</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 432: Lion Tiger Gold Shattering Roar</u></strong></p><br/><p>As the transparent energy cluster was shot out, a sharp sound wave turned into substance-like ripples, and began to spread in all directions, with the energy cluster acting as an epicenter.</p><br/><p>Bai Shan and the others were startled at this disturbance, which had suddenly appeared. Immediately, they swiftly came to an understanding. Each of their expressions were different as they watched that black shadow, which Xiao Yan had turned into, shooting out wildly.</p><br/><p>Under the observation of the few people in the room, Xiao Yan unleashed his speed to its limit and appeared in front of the transparent energy cluster within two blinks. His hand was curled slightly, like the claws of an eagle, as he grabbed at the energy cluster in a lightning-like manner.</p><br/><p>Seemingly having sensed Xiao Yan’s actions, that energy cluster, which was originally shooting forward, suddenly paused. It shook immediately and actually began to retreat in order to dodge him.</p><br/><p>“Humph.” Sensing the nearly conditional reflex-like dodging of the transparent energy cluster, Xiao Yan let out a cold laugher. He shook his sleeves and his hand appeared to have been elongated by a section. With a grab of his claw-shaped hand, he firmly caught the transparent light cluster into his palm.</p><br/><p>Once he obtained the thing, Xiao Yan’s body did not show the slightest hesitation as he withdrew in a lightning-like manner. At this very same instance, an enormous suction force suddenly exploded out from the energy barriers within the room. Under the pull of this suction force, the energy globs that lingered and permeated the room was unceasingly being pulled back into the energy barrier. In an instant, the light clusters that permeated the place shuttled past. Countless number of light clusters, which had been spat out earlier, with the exception of the items in Xun Er, Bai Shan and the others hands, which energy covers had been broken, were once again being completely swallowed by the energy barrier at this moment.</p><br/><p>As he sensed the suction force being emitted from the energy barrier, Xiao Yan knew that this was all because they were approaching the end of their time limit. His hand grabbed the transparent light cluster in his hand, that was repeatedly shaking, wanting to flee. This thing also felt the drag of the suction force and began to want to escape from Xiao Yan’s restraint.</p><br/><p>“Xiao Yan ge-ge, quickly try and see if you can obtain the thing within it!” Xun Er hurriedly reminded when she saw Xiao Yan’s hands, which were being sucked until he was dragged towards the barrier.</p><br/><p>Only after hearing Xun Er’s words did Xiao Yan recover. His right hand held the light cluster tightly, while his left hand was abruptly inserted into it.</p><br/><p>“Bang!”</p><br/><p>Xiao Yan’s hand was inserted into the light cluster while being watched by the few of them. An instant later, a enormous force suddenly surged out and actually directly repelled Xiao Yan. Moreover, this repulsion force was large. It was sufficient to cause Xiao Yan to take quite a few steps back before he could neutralize the force.</p><br/><p>“Damnit. I actually cannot.” Xiao Yan’s expression immediately became ugly when his hand was blocked. At this moment, the suction force, that was being emitted by the energy barrier, also became increasingly stronger. There were only a few countable light clusters still lingering within the entire room.</p><br/><p>A gloating cold smile involuntarily surfaced on Bai Shan’s face as he looked at Xiao Yan’s hands, which were being bounced off the light cluster.</p><br/><p>“Xiao Yan ge-ge, hold tight. Let me try!” A green-colored shadow flashed beside Xiao Yan. Xun Er’s hand was also swiftly extended into the energy cluster.</p><br/><p>Seeing Xun Er becoming increasingly close to the cluster of light, Xiao Yan’s heart was also suddenly raised. If even Xun Er was unable to, then this Sonic Dou Technique, which had reached his hands, was likely to grow wings and fly away. At that time, Xiao Yan really could only make do with the Huang class Sonic Dou Technique from earlier.</p><br/><p>Under the intense focus of gazes in the entire room, Xun Er’s hands were abruptly inserted into the light cluster. A moment later, the kind of resistance that Xiao Yan had faced earlier did not appear. Joy surfaced on Xun Er’s face. Her hands merely stopped for an instant within the light cluster before it was swiftly withdrawn. A crystal clear-like scroll appeared in everyone’s eyes.</p><br/><p>As he eyed the scroll, which Xun Er had successfully removed, Xiao Yan’s nervous heart finally calmed down. He let out a smile on his face as though he had placed down a heavy burden.</p><br/><p>“Xiao Yan ge-ge, here.” Xun Er rubbed the perspiration on her bright and smooth forehead. She was also very afraid that her failure would lead to Xiao Yan’s disappointment. Fortunately, however, the worst case scenario, which she had expected, did not appear. She smiled and handed over the transparent scroll in her hand to Xiao Yan.</p><br/><p>“It’s really thanks to you.” Xiao Yan received the scroll and said with some heart palpitations. If it was not for Xun Er being here, it was likely that he would have to watch this thing, which had already reached his hands, once again be swallowed back with his own eyes. He licked his lips and turned his gaze towards the words on the scroll within his hands. Initially, he was a little startled, but he immediately nodded with satisfaction.</p><br/><p>“‘Lion Tiger Gold Shattering Roar’, Sonic Dou Technique, Class: High Xuan class. When the lions and tigers roar in union, all beasts submit. It has the enormous strength of shattering gold and shaking the soul…”</p><br/><p>Xiao Yan read the words on top of the scroll once, and felt a great satisfaction within his heart. The thing which he currently needed most, was a Sonic Dou Technique of this class. If it was too low, he would scorn it. If it was too high, it would be too difficult to practice and it was likely that he would have difficulty truly practicing it until he had enough power which might be a long period of time. After all, the higher the class of the Dou Technique, the higher the difficulty of practicing it would be.</p><br/><p>“I have finally obtained it…” Xiao Yan released a long breath. He carelessly threw away the High Level Huang class Dou Technique which he had obtained earlier. When it left his hand, it was wrapped by a cluster of light and finally shot back into the energy barrier before disappearing.</p><br/><p>“Let’s go.”</p><br/><p>Xiao Yan kept this Xuan class High level Sonic Dou Technique inside his storage ring and waved his hand at Xun Er. Immediately, he took the lead to turn around and walked into the tunnel, which he had entered from earlier. When he passed by Bai Shan, his footsteps paused for a moment and spoke to him with a faint smile: “Looks like I have to disappoint Senior Bai Shan. I have gotten my hands on the thing that I need.”</p><br/><p>Once he finished saying that, he did not continue to stay. Instead, he and Xun Er turned around and walked back into the dark tunnel.</p><br/><p>“umph.” Bai Shan snorted coldly when he saw Xiao Yan’s smiling expression. His face was dark and solemn as he followed. Behind him, Hu Jia and Wu Hao also followed closely.</p><br/><p>As the five of them left, the ripple-like energy barrier surrounding this room also began to slowly become smaller. An instant later, the energy barrier turned into a small point, which completely disappeared with a tiny ‘crack’ sound. At this moment, the entire large room also became empty. No one would have expected that this place was filled with countless number of treasures, which would cause a stir in the outside world, just minutes earlier.</p><br/><p>“Creak.”</p><br/><p>The tightly-shut, ancient main door was suddenly gently pulled open. A warm sunlight followed the gap of the door and shone into it, shining a long light trace within the dark tunnel,that reached all the way to the end…</p><br/><p>The main door was opened. Xiao Yan and the four others walked out. They stood at the stairs and eyed the lush, green color of the valley. Their hearts could not resist sighing in relief. The atmosphere within the ‘Book Collection Hall’ was indeed a little too heavy.</p><br/><p>“The space occupied by this ‘Book Collection Hall’ is so vast. I’m afraid that the large room which we had entered is merely one of the corners. Mystery is really seeping out from all over this place…” After walked out of the main door, the corner of Xiao Yan’s eyes swept over the two grey-robed people, who were seated on both sides, like old monks in meditation, without leaving a trace as he spoke to himself in his heart.</p><br/><p>Upon hearing the sound of the door opening, a robe of a grey robe person suddenly moved a little. Xiao Yan and the others immediately sensed a vast and majestic shapeless energy scanning them. The strength of that energy caused an aghast to surface in their hearts.</p><br/><p>The shapeless energy appeared to only have the purpose of scanning them. Therefore, it lasted for only a short ten seconds before it withdrew like the tide until it completely disappeared.</p><br/><p>“Time is up. You can go. Remember, you cannot reveal even a little bit of everything that happened here, including the information about the interior of the ‘Book Collection Hall’.” A hoarse, old voice slowly lingered over where the main door was.</p><br/><p>Xiao Yan and the others hurriedly lowered their heads when they heard this.</p><br/><p>“Ke ke, have all of you come out?” When he saw the five of the walking out, Hu Gan, who had been standing in front of the pavilion, said with a smile: “All of you didn’t leave empty handed, right?</p><br/><p>The five of them nodded.</p><br/><p>“That’s good. No matter whether the thing you obtained is what you wanted, at the very least, you have gained something.” Hu Gan smiled when he saw this. He bowed towards the two monk-like, grey-robed people beside the main door and said: “Since these little fellows have already come out, I shall not disturb you two Elders in your training. Goodbye.”</p><br/><p>The two grey-robed people still did not have any response towards Hu Gan’s words. Hu Gan also did not mind. He waved his hand at Xiao Yan and the others and said: “Follow me.”</p><br/><p>Hearing Hu Gan’s voice, Xiao Yan and the four others also bowed towards the two grey-robed people, who sat cross-legged without moving, much like wooden pillars. They slowly walked backwards, walked down the green rock stairs, before turning around and arriving at Hu Gan’s side.</p><br/><p>Hu Gan’s gaze swept over the five of them. Only when he saw that they were not injured did he once again cupped his hands towards the two grey-robed people, turned around, and walked towards the invisible doorway which was being pulled open by a shapeless large hand.</p><br/><p>“Follow me. Don’t touch those spatial folds. Otherwise, even I cannot save you.” Hu Gan turned his head around and reminded when they were about to pass through the doorway. After which, his upper body remained still as he strided out, stepping across the doorway in one go. Behind him, Xiao Yan and the others carefully followed. None of them dared to make even the slightest dissimilar movement.</p><br/><p>After they safely passed through the invisible doorway, an energy ripple was slowly formed. Xiao Yan turned around and take a look, only to see that the invisible doorway, which was ripped opened, had already begun to slowly disappear. A moment later, an extremely tight space fold wall once again appeared, hiding the ‘Book Collection Hall’ behind it.</p><br/><p>Xiao Yan’s gaze leapt across those spatial folds, that were difficult to sense and swept across the main entrance of the ‘Book Collection Hall’. His expression suddenly changed slightly. Those two grey-robed human figures, who were originally still seated cross-legged there earlier, had strangely disappeared at this moment. This movement that could be called specter-like caused a chill to continue to rise within his heart. Just who exactly were these grey-robed people guarding the ‘Book Collection Hall’?</p><br/><p>“This Jia Nan Academy could still stand after so many years while staying at the danger filled ‘Black-Corner Region’. They do indeed have an extremely substantial foundation…” Xiao Yan sighed in his heart and shook his head. He swiftly followed Hu Gan and the others in front and once again entered into that mountain cave which he had come from earlier.</p><br/><p>Following the disappearance of Xiao Yan and the others, this small mountain valley, which was hidden in an unknown location, once again reverted into the silence it had before. Only until the end of next year’s Inner Academy Qualification Competition would this place once again be opened...</p><br/>\n</div>"}