{"title": "Chapter 437: Snatching", "id": 437, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-437-snatching", "volume_title": "Volume 5", "body": "<h1>Chapter 437: Snatching</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 437: Snatching</u></strong></p><br/><p>Sporadic sunlight shown between the gaps in the tree cover.</p><br/><p>“Hey, the few of you actually have the leisure to argue at a time like this?” A faint, mocking voice suddenly sounded between the trees.</p><br/><p>The five people, who were walking, suddenly stiffened. They hurriedly raised their heads only to see that five young people descended upon them and stood on tree branches above their heads in an orderly fashion. They each wore a badge, which had the appearance of a tower on it, on their chest. At this moment, the five young men were eyeing the five people below with faces filled with ridicule. That expression was like a cat who had seen a mouse.</p><br/><p>“You’re all here to snatch the so-called ‘Fire Energy’ from us, right?” A tall and large young man amongst the five people said with a cold smile. For him to be able to rank amongst the top fifty in the Outer Academy of the Jia Nan Academy, his strength was naturally not low. He was not too afraid of these young people, who were of similar ages to him.</p><br/><p>“Smart.” A young man on the tree branch, who had a snake-like scar on his face, let out a clear snap with his fingers. He immediately smilingly said: “Since you know why we are here, then there is no need to say any more nonsense. Hand over the ‘Fire Energy’ and you’ll avoid your suffering. What do you say?”</p><br/><p>‘In your dreams?” A skinny, weak-looking man smacked his lips. However, his voice had just sounded when the human figure in front of him flashed. Immediately, a human figure appeared in front of them. A gentle breeze tore through the air suddenly sounded out. After which, a leg heavily stepped on the stomach of the skinny and weak-looking young man in a lightning-like manner. Immediately, the latter’s body shot backwards and smashed into a tree trunk. A mouthful of fresh blood was spat out. He struggled a little, but still failed to successful climb to his feet.</p><br/><p>“Attack!” Seeing that their companion had been beaten, that tall and large young man became furious. He cried out angrily, desiring to fight. However, his voice had just sounded when he heard a muffled sound behind him. He hurriedly spun around to see what had happened, only to see that his other three companions were already kicked around like a rolling gourd. Beside them were three young men with their hands crossed over their chests. Their face was filled with disdain.</p><br/><p>“Brother, remember, no matter how well you might have muddled along in the Other Academy in the past, when you enter the Inner Academy, you will coil if you are a dragon and you will lie down if you are a tiger. These are the lessons that we, your seniors, have learned after undergoing countless amounts of physical pain. Today, I will teach you this lesson for free.” A laugh suddenly sounded by the ear of the tall and large young man. A shadow immediately flashed over. A fist, the size of a casserole, violently smashed into his face. Immediately, that young man fell onto the ground. His mouth was filled with fresh blood.</p><br/><p>“If you don’t want to continue being beaten, hand over your Fire Crystal Cards.” The young man with the snake-shaped scar twisted his fist and said faintly.</p><br/><p>When they heard his words, the expressions of the five new students changed slightly. A moment later, however, they could only clench their teeth and thought in their hearts that a wise man knew better than to fight when the odds were against him before taking out the so-called Fire Crystal Cards.</p><br/><p>A heat flashed across that young man’s face as he received the cards from the hands of the five beaten students. He hugged the cards and gave them a ferocious kiss. After which, he waved his hand and threw the remaining four cards to his four companions. He flipped his hand and a pale, blue-colored card appeared in his hand. If one looked at it carefully, there was actually a fiery red number 47 on the screen of this pale-blue card.</p><br/><p>The scarred young man held the dark, black card with one hand and the pale-blue card with the other. After which, he brought them close together and rubbed it with all his might. Immediately, a light flashed from the two cards. A moment later, the light was extinguished. However, the number on that pale-blue card had become 50 at this moment. On the other hand, the number on that dark black card and turned from a 5 into a 2.</p><br/><p>“Chi, what stupid rules. We must leave two days of ‘Fire Energy’ for the new students. How wasteful.” That scarred face young man curled his lips and said with great dissatisfaction when he saw the number remaining on the black card.</p><br/><p>“Let’s go, Lin Ge. We need to maximize the time to continue to look for other groups. We have finally managed to obtain the qualification to participate in the ‘Fire Energy Hunting Competition’ with great difficulty. If we cannot obtain six days worth of ‘Fire Energy’, we will have made a big loss.” Another young man kept the Fire Crystal Card properly and threw the dark Crystal Card back to the unfortunate new students before turning towards the scar-faced young man and said.</p><br/><p>“Ah, let’s go.” The young man, who was called Lin Ge, nodded his head. He said smilingly towards the five new students on the ground: “Pitiful little fellows. This is the result of not knowing how to work as a team. You should remember this in the future. After that, you can be like us next year, coming to snatch the ‘Fire Energy’ of new, naive students. Don’t hold it against us. This is because, because this is the path that every new student who enters the Inner Academy must undergo. Ha ha, let’s go.”</p><br/><p>With a loud laugh, Lin Ge waved his hands and the five of them flashed onto the tree branches. After which they chased in the direction that led deeper into the forest, leaving behind five crestfallen and green-faced new students.</p><br/><p>As that group of older students left, the few new students could only climb to their feet with a gloomy face after being dispirited for a while. Each of them exchanged ferocious gazes with one another and actually spread out, each taking their own path.</p><br/><p>Five people were hiding within the dense thicket tens of meters from this empty ground. The direction which their gazes were looking towards was the direction in which the five new students had left. Obviously, they had clearly seen the misfortune that the five new students had encountered with their own eyes.</p><br/><p>“Looks like the ‘Fire Energy’ in these Crystal Cards seems to serve an extremely important purpose within the Inner Academy. Otherwise, those fellows would definitely not rush like a flock.” Xiao Yan slowly withdrew his gaze, and eyed the dark Crystal Card, as well as the large number 5 on it while speaking.</p><br/><p>“Yes.” Xun Er and the others nodded slightly. The target that those fellows were snatching from was extremely clear. It was merely just the ‘Fire Energy’ on the Crystal Cards.</p><br/><p>“Let’s go. Those fellows should have also left. In any case, let’s not dawdle here. Didn’t that Elder Su say that the earlier we arrive, the richer the reward we will receive? Let’s not waste more time.” Bai Shan knitted his eyebrows and urged.</p><br/><p>“Wait.” Xiao Yan waved his hand and stopped Bai Shan. The latter frowned a little and said in a cold voice: “What do you want?”</p><br/><p>Xiao Yan glanced at him and said in a slow and deliberate manner: “No matter what conflict exists between us, I think that since we are currently a group, we should perhaps know a little of the so-called team spirit. Otherwise, that group of new students earlier will be us.”</p><br/><p>Hu Jia and the others nodded. From the way that group of older students had attacked with great understanding and teamwork between one another earlier, it was clear that they were frequently worked together. Their strength was not much weaker than Xiao Yan’s group. If it was a one on one fight, the five of them might perhaps obtain victory. However, if it was a group fight, with the kind of teamwork the other party had just shown, it would not be too difficult for these people to handle Xiao Yan’s group, where each member had his or her own ulterior motive.</p><br/><p>“What do you suggest?” Hu Jia’s bright eyes stared at Xiao Yan as she asked with a frown.</p><br/><p>“Since we are in a group, we naturally need a leader. In other words, the leader will command and assign. What I suggest is that we must find a leader amongst the five of us. Otherwise, if we were to each fight on our own, we will be as strong as a pile of loose sand. I’m afraid that it would be very difficult for us to successfully leave this forest with those fellows cutting us off and surrounding us…” Xiao Yan said slowly.</p><br/><p>Hu Jia and the few others were startled when they heard this. They immediately hesitated for a moment before all of them nodded. These words Xiao Yan said were true. A group that acted on command would forever be able to display a stronger fighting strength when compared to a group of scattered individuals!</p><br/><p>“Then… who is going to be the leader?” Wu Hao, whose entire body was wrapped in a blood-colored robe, was silent for a moment before asking the most knotty question.</p><br/><p>Xiao Yan and the others all descended into silence when Wu Hao said these words. A moment later, Xun Er’s moved her footsteps and stood by Xiao Yan’s side. She used her action to indicate her choice.</p><br/><p>Seeing Xun Er’s action, the expression of Bai Shan and the others each underwent a different change. A long while later, Hu Jia, who had her eyebrows tightly knit together, could only helplessly shake her head and said: “Alright. On account of Xun Er’s face, I will trust you once.”</p><br/><p>Once she finished saying this, she also walked over to Xiao Yan’s side and threw her gaze at the other two.</p><br/><p>“Your strength… I submit. I don’t have any issues temporarily listening to your commands…” Wu Hao’s low voice slowly sounded. Immediately, he also walked towards Xiao Yan.</p><br/><p>Bai Shan’s expression was a little ugly as he watched the three people standing by Xiao Yan’s side. His eyes flashed in an undefined manner.</p><br/><p>“Bai Shan, if you are unwilling, then the four of us will leave first.” Xiao Yan’s gaze stared at Bai Shan and said faintly.</p><br/><p>“You…” Bai Shan’s expression changed when he heard this. He could only nod with hatred as he strided over to Xiao Yan’s and said coldly: “Alright, you are now the leader of our group. However, I will say this first. Don’t think of using us to fight at the front. We are not fools that will allow others to use us like hatchet men.”</p><br/><p>“These matters are common matters for our group. I will naturally not ask anyone to go and block the enemy by themselves.” Xiao Yan eyed the four of them. A sharp glint suddenly swarmed into his black eyes as he softly said: “However, now that I have already become the group leader, I hope that before we leave this forest, none of you will do something that would cause us great harm because of you being double-faced towards me. Otherwise, you should not blame me, Xiao Yan. It is not the first time that we have made contact. You should all be clear about my character. The last time, I was able to let all of you lie in the clinic for seven days. This time, I am still able to…”</p><br/><p>Hearing Xiao Yan’s words that contained a warning, Hu Jia curled her lips but did not voice any objection, Wu Hao nodded and the corner of Bai Shan’s mouth twitched. It was a long while later before Bai Shan managed to suppress the surge of emotion within his heart.</p><br/><p>However, no matter what reaction the three of them had, at the very least, Xiao Yan had currently obtained the power to command this small group in name. Next, they would need to truly break down the walls between them!</p><br/>\n</div>"}