{"title": "Chapter 456: Triumph!", "id": 456, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-456-triumph", "volume_title": "Volume 5", "body": "<h1>Chapter 456: Triumph!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 456: Triumph!</u></strong></p><br/><p>The green-purple fire lotus swiftly expanded in Luo Hou’s eyes. The terrifyingly hot energy, which penetrated the air and swept over him, caused the cold sweat appearing on his forehead to be vaporized in an instant.</p><br/><p>On the ground, the dark green grass quickly withered anywhere the fire lotus swept past. Finally, the grass turned into black-colored ashes that scattered with the wind.</p><br/><p>A horror of being helpless to fight the destructive force quietly rose in Luo Hou’s heart as he sensed it shooting explosively toward him. This kind of energy was really too large. He even had a faint intuition that if he were to be struck head on by that beautiful fire lotus, it was likely that he would be turned into nothing more than dust, just like the green grass.</p><br/><p>Luo Hou’s teeth firmly bit his lips. Blood traces flowed down from his mouth. The pain caused Luo Hou to recover from that helpless state and become a little more alert. His hands held the cold metal rod tightly while his eyes stared intently at the fire lotus, which was coming increasingly closer to him. The latter’s nearly lightning-like speed caused him to have nowhere to hide.</p><br/><p>Cold air swiftly seeped out from the cold metal rod. However, when the cold air appeared, it was incinerated by the high temperature that moved forward it until it let out a ‘chi chi’ sound. Finally, it resulted in a white, misty fog that shrouded the messy rock area, causing everyone's sight to be somewhat obstructed.</p><br/><p>Luo Hou inhaled a deep breath of air. A crunching sound emitted from the cold metal rod that he held tightly in his hand due to the great strength he used. A drop of cold sweat moved along his forehead and dripped into his eyes. The astringent-like feeling caused a fury to suddenly swarm into Luo Hou’s heart. A dignified strong Dou Ling had actually nearly given up defending because of the attack of a mere Da Dou Shi? This kind of situation caused the him, who had a haughty character, to feel ashamed.</p><br/><p>“Come! I want to see just how strong you, Xiao Yan, can be?!” A low, deep roar reverberated in his heart. Luo Hou’s hands shook. Immediately, his ten foot long cold metal rod shook and formed a couple of afterimages. Dou Qi in his body flowed wildly as it was unceasingly poured into the cold metal rod.</p><br/><p>As the Dou Qi was swiftly poured in, one could see that layers of thick frost had begun appearing on the ice-like metal rod. Moreover, the temperature surrounding the rod’s body had also begun to swiftly decline at this moment. Finally, it barely managed to isolate the heat from the fire lotus.</p><br/><p>The Dou Qi in his body was swiftly flowing until it was exhausted. The frost on the cold metal rod became increasingly rich. In a few blinks of an eye, the cold metal rod, which was originally only as thick as an arm, suddenly gained nearly half a foot of thickness. It was now like an enormous ice pillar.</p><br/><p>Luo Hou’s arms hugged the cold metal rod which had turned into an ice pillar. a sleek redness swarmed onto Luo Hou’s face. He let out a low, deep violent roar from his mouth and raised the enormous ice pillar high up before immediately smashing it down angrily!</p><br/><p>The force that was contained within the ice pillar was extremely powerful. In the short distance, there was a continuous stream low explosive sounds that were emitted in the air wherever the ice pillar passed through. In fact, when the ice pillar was still a few meters from the ground, the attack which had gathered all of Luo Hou’s strength managed to even pass through the air and shook the rocks on the ground until quite a number of crack lines were formed. From this, it could be seen that Luo Hou’s desperate attack was also not ordinary.</p><br/><p>The green-purple fire lotus cut through the air and struck toward Luo Hou. When it was less than two to three meters away, an enormous dark shadow that contained a cold wind descended from the sky. Finally, it heavily struck the fire lotus. Immediately, the space solidified for an instant. Soon after, a loud thunderclap, like an explosive thunder, resounded throughout the battlefield. Some of the people who were unable to prepare in time were even shaken by this loud sound until their ears were pressed tightly.</p><br/><p>After this thunderclap, the energy ripple that everyone had expected to form from the energy collision did not appear. The fire and ice appeared to be quietly neutralized within that rubble-filled region covered by a faint white mist. Not the slightest ripple that contained any destructive force was emitted. This somewhat bizarre scene caused many people to be a little stunned. They faced one another with faces that were at loss.</p><br/><p>At this moment, Luo Hou’s face was flushed within the white fog that people’s gazes could not reach. His palms desperately held the cold metal rod, which was shaking repeatedly. At this moment, the thick frost on the body of the rod was melting at a rate visible to the naked eye. Since his palm was in contact with the rod, Luo Hou could sense an extremely frightening hot force was continuously invading through the cold metal rod from that obscure white fog. Luo Hou was able to imagine that once the icy frost that had been agglomerated from his Dou Qi was completely exhausted, that frightening hot force would completely erupt!</p><br/><p>Although Luo Hou understood this in his heart, he did not have the slightest solution. Hence, he could only watch with his own eyes as the enormous ice pillar, which was agglomerated from the cold metal rod, melted swiftly. The heat that was transmitted from the tip of the rod was also becoming increasingly warmer.</p><br/><p>The icy frost on the cold metal rod lasted for merely ten seconds before it was completely melted. Following the disappearance of all the icy frost, one could see that the cold metal rod, with an entire body like ice, turned from snow white into fiery red at an extremely swift rate.</p><br/><p>“Chi…”</p><br/><p>The spot where Luo Hou’s hands held the cold metal rod suddenly revealed a white-colored fog and many strange sound. Quickly following this, one could hear a muffled groan that contained pain from Luo Hou. He swiftly released his hands and threw away the cold metal rod, which had nearly become burning charcoal.</p><br/><p>As the cold metal rod landed on the ground, it heavily smashed on top of a rock. In an instant, the rock burst apart. The fiery red rod’s temperature was swiftly reduced. Immediately, it turned into an ordinary metal rod. Additionally, there were crack lines that were repeatedly spreading throughout the metal rod. Clearly, this cold metal rod, which seemed to cost quite a lot, had been completely turned into a lump of scrap metal.</p><br/><p>At this moment, Luo Hou did not have the time to feel any heartache about his weapon being turned into scrap metal. This was because at the instant when that the metal rod left his hand, he could clearly see a wisp of purple-green fire glow suddenly shooting toward him from within the white fog. The hot aura incinerated the white fog around it into nothingness.</p><br/><p>As some of the white fog was being incinerated, Luo Hou could clearly see the true face of that purple-green object. Shock involuntarily flashed across his eyes. He had discovered that the attack, which he had went all out to unleash earlier, had merely cause the appearance of this beautiful fire lotus to become a little dimmer. Its original body actually did not show the slightest signs of wavering!</p><br/><p>“Just what class is this Dou Technique in? It is actually strong to such an extent?” On top of being shocked within his heart, Luo Hou, who did not have the time to dodge, could only clench his teeth and hurriedly maneuver the little Dou Qi within his body. After which, he agglomerated and formed a simple, thin Dou Qi Armor on his body. From the looks of it, it appeared that he was prepared to receive it head on.</p><br/><p>Xiao Yan’s expression was similarly pale as he stood in the messy rock area. His gaze coldly eyed the area which was covered by the white fog. He raised his hands, paused slightly before suddenly clenching it. Immediately, his originally pale face became as white as sheet. His body also involuntarily quivered.</p><br/><p>The instant that Xiao Yan clenched his fist, the expressions of Elder Su and Elder Qing on the rock platform finally changed drastically. Elder Su suddenly stood up. His body paused before immediately disappearing in a bizarre manner from the rock platform.</p><br/><p>“Bang!”</p><br/><p>A deep, low explosion sounded from the messy rocky region. Immediately, a circular terrifying energy ripple began spreading out in a wave-like manner. Rocks were completely obliterated into dust anywhere it passed. This frightening destructive strength caused the older students on the mountain slope to become dull for a moment. Immediately, under a panicked loud cry, they began to leap over the other side of the mountain slope one after another in an extremely embarrassing fashion, just like rolling gourds. In an instant, the entire place had turned totally chaotic.</p><br/><p>The energy ripple had arrived quickly and left just as quickly. When it came into contact with the mountain slope, it left half inch long crack lines before it gradually disappeared. After this continued for a while, the people behind the mountain slope finally carefully exposed their heads one at a time when they ceased hearing any activity. They eyed the area which had already turned into an extreme mess and involuntarily inhaled a breath of cold air in a quiet fashion.</p><br/><p>Currently, the messy rocky area or, perhaps, it should no longer be called a messy rocky area. This was because there was no longer a single rock existing in this place. The only thing it had now was rock ashes that covered the ground. The large rocks from earlier appeared to have disintegrated due to the energy ripple with immense destructive strength.</p><br/><p>“This… this was created by Xiao Yan?” Everyone’s eyes carried a little dullness as they stared at the messy rock area, which appearance to have changed drastically. Sha Tie, whose head had been exposed from behind a mountain slope, could not help but swallow his saliva and mutter.</p><br/><p>Su Xiao and the two other beside him stiffened their faces and nodded. Their gazes swept toward the skinny black-robed young man. In their hearts, they could not resist thinking that if this fellow were to have thrown the purple-green fire lotus when they were fighting within the forest, how many people in their groups would have survived?</p><br/><p>When they thought of this, cold sweat began to appear all over their bodies. The gazes they used to look at Xiao Yan were like they were looking at a monster. Was that fellow really only a Da Dou Shi?</p><br/><p>“Is this fellow really a Da Dou Shi? This kind of destructive strength is sufficient to catch up with some six or seven star elite Dou Lings…” Sha Tie recovered from his shock. He laughed bitterly as he slowly gave voice to what Su Xiao and the two others were thinking.</p><br/><p>Hearing this, Su Xiao and the other two nodded their heads, sharing the same feelings.</p><br/><p>“That’s right... What happened to Luo Hou?”</p><br/><p>A voice suddenly sounded from the mountain slope. Immediately all the gazes suddenly turned toward the area in middle of the messy rocky area still covered by white mist.</p><br/><p>As everyone turned their gazes, most of the white-colored fog in that region began to dissipate. Finally, Luo Hou’s figure was the first to appear in everyone's gazes… At this moment, Luo Hou was basically sitting with his butt down on the ground. That cold and indifferent face was currently in a kind of stiffened condition. However, looking at his appearance, it seemed that he was not injured?</p><br/><p>Seeing Luo Hou unharmed, a wave of shocked private conversations sounded from the mountain slope. From the looks of the destructive strength of the energy ripple that had spread out, Luo Hou’s strength should not have been enough to leave him totally unaffected.</p><br/><p>However, just as everyone’s hearts were filled with doubt, the white-colored fog finally completely disappeared. Following the disappearance of the fog, one could see Elder Su’s body standing in front of Luo Hou…</p><br/><p>“Elder Su?” The people on the mountain slope immediately let out numerous gasps as they eyed Elder Su’s figure.</p><br/><p>The old figure of the one called Elder Su had his hand maintained in an extended stance. From the looks of the huge pit in front of him, it appeared that the fire lotus attack earlier was blocked by him. No wonder Luo Hou was not the least bit injured…</p><br/><p>Elder Su stood in a straight manner on the spot, like a tree stump. A long while later, he slowly withdrew his hand with an indifferent face. After his hand had returned to his sleeves, it could not resist trembling a little. A solemness flashed across his turbid eyes.</p><br/><p>Elder Su lifted his head under everyone’s gazes and swept his gaze toward the pale-faced Xiao Yan. He was quiet for a moment before his soft voice resonated from this battlefield which had undergone a great battle.</p><br/><p>“Little fellow, you new students can be considered the victors for this year’s ‘Fire Energy Hunting Competition.’”</p><br/>\n</div>"}