{"title": "Chapter 465: Meeting For The First Time", "id": 465, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-465-meeting-for-the-first-time", "volume_title": "Volume 5", "body": "<h1>Chapter 465: Meeting For The First Time</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 465: Meeting For The First Time</u></strong></p><br/><p>One could only see a faint, white fog shrouding the spacious interior of the ancient tower. At the edge of the white fog stood the figure of an old man who was breathing quite heavily.</p><br/><p>At this moment, Elder Liu’s face was swiftly changing between different colors. At times, he was shocked, at times he was alarmed, appearing extremely wonderful to look at. More than half of the robe he was wearing had also been incinerated. The smell of burned skin came from his hair. From his overall appearance, this Elder, who possessed quite a high position in the Inner Academy, was currently reduced to a miserable state.</p><br/><p>At this moment, the other older students, who had moved aside to dodge the fire within the hall, finally recovered from their earlier panic. However, by the time they recovered and threw their gazes toward the area where the explosion had erupted from, they coincidentally saw the miserable looking Elder Liu. Immediately, their hearts, which had just recovered, were once again reclaimed by a dullness.</p><br/><p>There was an extremely strict requirement on one’s strength to be able to become a tower guardian Elder in the Inner Academy. Hence, all the the Elders within the tower were, without exception, people with extremely great strength.</p><br/><p>Although there was some shocking and exciting geniuses in the Inner Academy who were able to stand shoulder to shoulder with some Elders after undergoing tough training, these people were definitely an extremely rare existence. Moreover, each and every one of them had reached such achievement after training in the Inner Academy for four to five years. However, at this moment, Elder Liu had ended up in such a miserable state at the hands of a new student, who had just entered the Inner Academy less than three days ago. This scene was basically more shocking and difficult to believe compared to Xiao Yan leading the new students to rob the older students.</p><br/><p>The shock on Han Yue’s face continued for a minute before it was finally gradually withdrawn. Her pupils swept toward the place shrouded by white fog. There was an additional bizarreness in her originally cold and indifferent gaze. This new student was indeed very interesting.</p><br/><p>“*Cough*...”</p><br/><p>The silence in the ancient tower was suddenly broken by a coughing sound. Elder Liu’s gaze stared intently at the cluster of permeating white fog. He immediately lowered his head and dusted off his clothes, which were burned until they were in tatters and smiled as he said, “What a great Xiao Yan. No wonder the geezers were also so secretive when they mentioned you. It is actually because of that. You are really a fellow blessed by the heavens. There is not a single Elder in this tower who would not want to obtain this thing…”</p><br/><p>It was natural that the older students in the tower would not understand Elder Liu’s words. However, they were able to grasp something. This Xiao Yan seemed to have something mysterious that even the Elders desired to have.</p><br/><p>Elder Liu waved his sleeves gently. He had just scattered the white-colored fog that spread in front of him when two soft footsteps were transmitted out from within the fog. This caused him to stop his hand movement and stare intently at the fog.</p><br/><p>The sound of footsteps reverberated within the ancient tower. Everyone scrambled to turn their gazes toward the fog covered area, where the sound of footsteps originated. No matter how one put it, the powerful force that Xiao Yan had displayed earlier was sufficient to cause them to forget his identity as a new student. They did not know that this strength was not controlled by Xiao Yan and it was instead energy erupting from the ‘Green Lotus Core Flame’ in an act to protect its owner. If they were to let Xiao Yan control the ‘Green Lotus Core Flame’ by himself, and once again unleash a strength that could force Elder Liu into this manner, the chances of him failing would be more than ninety-five percent.</p><br/><p>As the sound of footsteps within the white fog become increasingly audible, a vague human figure slowly surfaced. Finally, the figure stepped out of the white fog and appeared under everyone’s gazes.</p><br/><p>A young man in black robes was carrying a huge black ruler that was as tall as him. His left hand was carrying Wu Hao, who appeared to have already fainted. He frowned slightly as his gaze slowly swept over the surrounding crowd. With the exception of a few who were not weak, those older students, whose gazes collided with his, mostly became evasive due to the shock and awe they felt from the earlier explosion.</p><br/><p>“Tsk tsk, to actually be able to rely on your own strength to wake up from the first grilling of the Heart Flame. Xiao Yan, you are the first person in many years to do so.” Seeing Xiao Yan, who had already returned to his normal condition, Elder Liu was startled and immediately sighed.</p><br/><p>“And you are?” Xiao Yan opened his mouth and asked somewhat uncertainly as he eyed the old man, who appeared in an extremely miserable state in front of him.</p><br/><p>“Ke ke, I am the Elder for the first level of the ‘Blazing Sky Qi Refining Tower.’ You can directly call me Elder Liu.” Elder Liu laughed. The kind of stern berating that he used on the other older students was actually completely absent from his words. Just this treatment which Xiao Yan had received caused the surrounding students to mutter to themselves. Within the ‘Blazing Sky Qi Refining Tower,’ and even the entire Inner Academy, the position of an Elder was extremely high. In this place, no student would dare to go against what an Elder said. Of course, this was with the exception of some outstanding people. This was because it was very possible for these outstanding people to take on the position of Elder, and become the same level as them. Within the Inner Academy, even the Elders also had to rope in strong people into their camps in consideration of their future.</p><br/><p>After all, the Elders in the Inner Academy were not completely of the same faction. In any place, fighting was unavoidable. Perhaps it was because of power, perhaps it was because of profits or perhaps it was because of other things...</p><br/><p>“Oh, Elder Liu, what happened?” Xiao Yan nodded his head as he came to a sudden understanding. He eyed Elder Liu’s appearance, and could not help but feel a little strange as he asked.</p><br/><p>“Uh… nothing. An accident happened while carelessly controlling a flame.” Elder Liu’s eyebrows could not help but twitch a couple of times when he was asked this question by the instigator. Immediately, he laughed dryly and shook his head. He did not suspect that Xiao Yan was pretending to be stupid. The terrifying flame which had erupted from Xiao Yan earlier may have been extremely terrifying, but in the eyes of Elder Liu, who had played with fire for his entire life, he understood that it was merely an autonomous counter attack of ‘that thing.’ It was not really Xiao Yan’s fault.</p><br/><p>“Then this friend of mine?” Xiao Yan pointed at Wu Hao, whom he was carrying. At this moment, the latter was in an unconscious state.</p><br/><p>“He’s fine. It is just that he is a little exhausted because he was grilled by the Heart Flame. He will be fine after resting for a night.” Elder Liu smiled and explained.</p><br/><p>“Grilled by the Heart Flame?” The foreign words caused Xiao Yan to knit his eyebrows together once again.</p><br/><p>“Ke ke, you are new to the Inner Academy. Hence you don’t know some of the rules of the ‘Blazing Sky Qi Refining Tower.’ If you have the time, would you like me to tell you about them?” Elder Liu smiled and asked.</p><br/><p>“In that case… Elder Liu, thank you very much.” Xiao Yan hesitated a little when he heard this, but agreed nonetheless. Being a newcomer, he should indeed gain some understanding about the most mysterious place within the Inner Academy. This would be in order to facilitate those new students from ‘Pan Gate’ to get in touch with opportunities as soon as possible, swiftly raise their overall strength and enabling them to have sufficient qualifications to survive in the Inner Academy, where the strong gathered.</p><br/><p>“It’s fine. This is also where my duty lies.” Elder Liu waved his hands. His gaze turned toward the students observing from around him and his smiling face could not help but sink. He cried out, “Why are all of you still around here? Are you not going to go train as soon as possible? If you feel that you have sufficient training time, I can help all of you shift from your position.”</p><br/><p>Hearing Elder Liu’s cry, the surrounding students hurriedly shook their heads. After which, they swiftly rushed toward various spots within the ancient tower. They were afraid that if they were late, they might really end up having their position, which they had obtained with difficulty, swapped away by the former.</p><br/><p>Seeing these older students, who acted proudly in front of the new students, being as obedient as lambs in Elder Liu’s hands, Xiao Yan could not help but feel that it was a little funny. However, on top of him feeling that it was funny, the weight of this Elder Liu in his heart had increased a lot. If it was not because he held actual authority within the Inner Academy, those arrogant older students would definitely not be so tame.</p><br/><p>“Ke ke, these bastards are all very haughty. If you are not a little more stern, no one will listen to you.” Elder Liu smiled and said to Xiao Yan after sending off the surrounding crowd.</p><br/><p>Xiao Yan smiled but did not voice any opinions regarding this.</p><br/><p>“Come, come, Xiao Yan. I will introduce a person to you.” Elder Liu’s gaze swept once across this level of the ancient tower before he pulled Xiao Yan toward a lady in a silver-colored dress. From her appearance, she was that Han Yue who had the qualification to enter the sixth level of the ‘Blazing Sky Qi Refining Tower’ to train.</p><br/><p>“This is Han Yue. She has already entered the Inner Academy for three years and can be considered your senior. Ke ke, her strength is also not ordinary. Moreover, she formed the ‘Moon Spirit’ faction within the Inner Academy. Her strength is not weak. There are few factions that dare to provoke her in the Inner Academy.” Elder Liu smiled as he introduced her after arriving in front of the silver-dressed lady.</p><br/><p>“Oh?”</p><br/><p>Surprise flashed across Xiao Yan’s face as he heard Elder Liu’s introduction. His gaze sized-up this lady called Han Yue. During their first encounter, the latter’s icy mountain snow lotus like cold and indifferent disposition left him with a somewhat deep impression. The most shocking thing was this lady’s strength. Although he could not see the other party’s strength with his naked eye, due to his strong Spiritual Strength, Xiao Yan was able to vaguely sense that this silver-haired woman was much stronger than Luo Hou!</p><br/><p>“This inner academy does indeed have hidden dragons and tigers. It is really unexpected that the other party, being a female, would have this kind of strength. Looks like this place… is indeed not an easy place to muddle along.” Xiao Yan bitterly laughed in his heart. However, Xiao Yan did not reveal anything on his appearance. He placed Wu Hao, whom he was carrying, onto the ground before extending his hand and smiled as he said, “Nice to meet you, Senior Han Yue.”</p><br/><p>Seeing Xiao Yan extending his hand toward Han Yue, Elder Liu could not help but be stilled. Knowing the latter’s character, he naturally understood that this lady, who had always had an extreme obsession for cleanliness, had some resistance to coming into contact with a man’s skin. Even when fighting with others, she would use Dou Qi to firmly wrap herself. Having an obsession of cleanliness to such an extent really caused people to be quite speechless.</p><br/><p>However, without waiting for Elder Liu to voice an obstruction, the lady called Han Yue hesitated for a moment before rolling out a white, jade-like wrist from the silver-colored sleeves. After which, she gently held Xiao Yan’s hand under Elder Liu’s stunned gaze. As they touched lightly and parted, a cool voice, like a spring flowing down a snowy mountain, was clearly emitted.</p><br/><p>“Nice to meet you…”</p><br/><p>When these few gazes from the ancient tower were shot over from all directions and saw their hands make contact, they were all startled. Immediately, boiling and jealous gazes focused on that black-robed young man, who caused them to gnash their teeth.</p><br/>\n</div>"}