{"title": "Chapter 460: Deterrence and Politeness", "id": 460, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-460-deterrence-and-politeness", "volume_title": "Volume 5", "body": "<h1>Chapter 460: Deterrence and Politeness</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 460: Deterrence and Politeness</u></strong></p><br/><p>When they walked out of the pavilion house, there was a large road filled with greenery. On both sides of the large road were living quarters for the other new students. Of course, compared to the small pavilion house of Xiao Yan’s group, theirs were much simpler and more crude. From the looks of it, such treatment was not something that everyone would receive.</p><br/><p>There was not the slightest shadow of a new student on the road at this moment. It was likely that they had all gathered at the exit. Xiao Yan’s four man group did not dare be slow. Their toes gently pressed on the ground and their bodies turned into wisps of light smoke as they swiftly rushed to the end of the large road.</p><br/><p>Around four to five minutes later, the swiftly traveling four-man group slowed down. They lifted their heads and eyed the end of the road. They did indeed see a large group of people squeezing together there. Noisy abuses repeatedly rang out.</p><br/><p>Xiao Yan waved his hands and lead the three others as they walked closer to the group of people. When the new students that had gathered around this place, saw Xiao Yan’s four-man group, their faces could not help but become filled with great joy. They had just cheered when they were interrupted by Xiao Yan’s hand gesture. Immediately, they hurriedly shut their mouths.</p><br/><p>Xiao Yan’s four-man group cupped their hands toward the new students and greeted them. Their gazes passed through the gaps in the crowd and eyed the exit.</p><br/><p>Currently, the exit of the main road was being blocked by seven or eight older students who wore tower-shaped badges on their chests. There was another large group of older students watching the fun from behind them. Clearly, they were very happy to see the new students being suppressed. This was because they had all undergone this hurdle in the past.</p><br/><p>On the opposite side of the eight older students was Atai, who had just went to request Xiao Yan’s help earlier. At this moment, he was leading the new students. His expression was green as he faced off against the older students.</p><br/><p>“There is no need for any more nonsense. Little brat, the ‘New Student Tribute Fee’ is a custom of the Inner Academy for so many years. We were not harsh with you at all. Therefore, just obediently hand it over. Losing wealth will help you avert disaster. Don’t tell me that you don’t know this fact?” A young man, who was around twenty-five years old, smiled as he eyed the green-faced Atai and the others opposite him. He continued with, “Everyone hand over two days worth of ‘Fire Energy’ and I guarantee that you will all be safe and secure within the Inner Academy. This transaction is actually quite a bargain.”</p><br/><p>“Hmph. Don’t think that we, new students, don’t know the rules. It was indeed true that the new students should pay the ‘Tribute Fee’ to the older students. However, the Inner Academy also has an informal rule that the new students would at most give to two factions. After paying these two factions, the other factions would have to go after those two factions and talk with them if they still wanted to collect ‘Fire Energy’ off of us. It would no longer be our problem.” Atai coldly snorted and angrily replied, “However, today, from this morning until now, no less than five factions have come. What ‘Fire Energy’ do we have to give you all?”</p><br/><p>“Hee hee, that is under normal circumstances but aren’t you all from this batch of new students very strong? In so many years, I have never heard of any new students defeating older student groups and stealing their ‘Fire Energy’ in the ‘Fire Energy Hunting Competition.’ Since you are all so special and independent, the rules that apply to you all should naturally be special.” That young man parted his mouth and spoke with a smile.</p><br/><p>“Moreover, currently, you are not as poor as ordinary new students. The ‘Fire Energy’ on your bodies may be much richer than most older students.”</p><br/><p>“You are talking nonsense. We have already said that we will not give a single day more of ‘Fire Energy.’ No matter whether we still have ‘Fire Energy’ in our hands or not, all of you can forget about it!” Atai’s face was green as he scolded them furiously. Behind him, the faces of many students were also angry. This repeated exploitation had completely infuriated them.</p><br/><p>“Hee, alright. very good… you are indeed a bunch of people with hard bones.” Hearing this, that older student could not help but laugh coldly. He spoke in a sinister manner, “Little fellows, you should not forget that this is not the Outer Academy. Other than the Fighting Arena in the Inner Academy, it may be true that one cannot take people’s life in the other parts of the Inner Academy. However, when people spar, one would usually suffer some physical pain, no?”</p><br/><p>“If you really don’t pay up today, I will not dare to guarantee that you will not receive some unjust treatment when you all leave this place. A young person should not be swayed by his emotions and act impulsively.”</p><br/><p>“You…” Seeing the dark smile of the young man, a fiery light once again rose within their hearts. Their eyes were spitting fire.</p><br/><p>“There is no need to guarantee. The new students no longer need to pay you even half a day’s worth of ‘Fire Energy.’ This senior, please return to where you came from.” A faint, cold laughter suddenly sounded from within the group of new students.</p><br/><p>“Who dares?”</p><br/><p>The expression of that young man swiftly became dark and solemn. His gaze coldly swept over the new students and his fist twisted slightly. In a cold voice, he said, “This batch of new students is indeed just like what the others had said. Their arrogance is boundless. Looks like as a senior, it is my duty to teach you all what the Inner Academy is really about.”</p><br/><p>“Ke ke, just as well. In that case, I will experience Senior’s teachings.” A cold laughter sounded once again. Immediately, the new student group parted and formed a path. Four human figures slowly walked out.</p><br/><p>“It’s Senior Xiao Yan!”</p><br/><p>Seeing the appearance of the four people, a cheer immediately sounded from the new students around. After the success of the ‘Fire Energy Hunting Competition,’ the reputation of Xiao Yan, within the hearts of the new students, was already quite high.</p><br/><p>“Xiao Yan? He is the Xiao Yan that defeated Luo Hou?” Hearing the cheers from the surroundings, some of the older students, who were watching the fun from the main road, could not help but emit surprised gasps. Their gazes carried some bizarreness as they stared at the black-robed young man.</p><br/><p>“You are Xiao Yan?”</p><br/><p>Seeing that the emotions of the new students had suddenly soared, the expressions of those older students blocking the entrance also changed a little. Clearly, they were quite afraid of Xiao Yan’s reputation. After all, Luo Hou could be considered among the top one hundred people within the entire Inner Academy. At the very least, Luo Hou had once squeezed his way into the ‘Strong Ranking.’ Although there was some luck involved in it and he only stayed within the ranking for three days, being able to even get ranked naturally represented his extraordinary strength. Yet, even this strong person was defeated by Xiao Yan’s hands. Hence, some of the older students in the Inner Academy feared Xiao Yan.</p><br/><p>Xiao Yan glanced at the young man, whose expression was changing repeatedly. He crossed his arms in front of his chest as said with a smile, “I am Xiao Yan. May I know what advice Senior has?”</p><br/><p>“Do you intend to be the bird that stands out? Although you defeated Luo Hou, you should know that there are many in this Inner Academy who are much stronger than Luo Hou!” That young man was unwilling to throw his face and withdraw in public. At that moment, he could only stiffen his neck and coldly snort.</p><br/><p>“We, the new students, do not have any intention of appearing arrogant. In the ‘Hunting Competition,’ it was merely because the actions of some older students were too extreme… We understand in our hearts that being newcomers, we should hold back our vigor. This is the best method for new people to assimilate. Therefore, we are no exceptions. We are willing to pay the ‘Tribute Fee’ that we should give according to customary rules. However, with regards to those other harsh rules, I, Xiao Yan, will clearly say this here. We will definitely not accept them. If you want to use force, the forty-six of us new students present can only go all out to take you on.” Xiao Yan gaze was slightly cold as he looked all around him and spoke with a deep voice.</p><br/><p>“Bang!”</p><br/><p>As Xiao Yan’s words filled the air, the expressions of the dozens of new students behind him immediately became excited. Their feet violently stomped against the ground and Dou Qi surged. In a moment, dozens of different Dou Qi forces agglomerated together. The pressure that formed caused the older students to hurriedly retreat a few paces.</p><br/><p>“You… Xiao Yan. Don’t think that you can be arrogant just because you have more people. We are people from ‘Qingshan.’ Offending us in the Inner Academy…” The face of that young man could not help but become ugly after being startled and forced back by the force of a group of mere new students. Immediately, he let out a furious warning. However, his warning had yet to be fully delivered when he heard the sound of rushing wind abruptly charging toward him. A black shadow immediately swept past his eyes and his shoulders suddenly sank. He was shocked to realize that an enormous black ruler was already place on his neck.</p><br/><p>“I will say this once more. We, new students, are willing to pay those that we should pay. From now on, we will not pay even half a day’s worth of ‘Fire Energy’ to those that we do not need to pay. I don’t care which faction you belong to. If you continue speaking such nonsense here, don’t blame me, Xiao Yan, for ignoring my manners…” Xiao Yan held the ruler with his left hand. His dark, black pupils stared intently at the young man, who felt the pressure from the heavy ruler until he was sinking. His voice was cold.</p><br/><p>As he saw the coldness in Xiao Yan’s eyes, the throat of the older student rolled slightly. A drop of cold sweat dripped down from the rest of older students foreheads. He could sense that there was a real, thick, cold killing intent contained in the voice of the young man who was much younger than him.</p><br/><p>“Chi…”</p><br/><p>The heavy ruler moved slightly, carrying a rushing wind sound as it was placed back on Xiao Yan’s back. Xiao Yan slowly stepped backward and finally pulled back such that he stood in front of Xun Er and the two others.</p><br/><p>“Just you wait!”</p><br/><p>The older student’s face was alternating between green and white shades after seeing Xiao Yan step back. A long while later, he finally waved his sleeves in an anger caused by shame. He turned his body and left behind some vicious words before leading his people and fleeing from this place.</p><br/><p>Seeing that Xiao Yan had actually frightened that group of older students away, all the new students could not help but once again emit cheers. The gazes they used to look upon Xiao Yan were incomparably hot. Clearly, Xiao Yan stepping forward to speak for them this time around had completely caused all these new students to approve of his position.</p><br/><p>“All the Seniors. We, this batch of new students, do not have some special ability and don’t want any special privileges. As for the ‘Fire Energy Hunting Competition,’ I have already said earlier that it was merely because the actions of the older students were too extreme… Now that we have entered the Inner Academy, as newcomers, we have no intention of taking this chance to be arrogant. Everyone here is our Senior. We, the new students, will not pay those that we don’t need to pay. Hence, everyone need not view us, this batch of new students, differently. Xiao Yan will thank all of you here.” Xiao Yan lifted his head to eye those older students, who were watching at the intersection. He cupped his hands and spoke in a clear, courteous voice.</p><br/><p>Xiao Yan had just established his might but was now speaking in such a courteous manner. This action of Xiao Yan caused some of those older students to look at one another. A moment later, some of those with a more sensitive mind could not help but quietly nod their heads. This Xiao Yan was quite the character. He knew his limits when he did things.</p><br/><p>Behind Xiao Yan, Xun Er and the two others also nodded slightly. No matter how strong they were, it was definitely impossible for them to make enemies of all the older students in the Inner Academy. If Xiao Yan appeared even a little proud after establishing his might, these matters might be passed into the ears of quite a number of strong people within the Inner Academy. At this time, it was difficult to avoid having people come and make things difficult for them. This time around, only some weaker older students had come. The next time around may well be truly strong people.</p><br/><p>They were able to defeat Luo Hou, but Luo Hou’s strength was only average within the Inner Academy. Hence, they were currently unable to do things in such a high profile manner. The most important thing was to quickly gain a foothold in the Inner Academy and do their utmost to train in order to raise their overall strength. This was the long term solution!</p><br/>\n</div>"}