{"title": "Chapter 474: Middle Grade Training Room", "id": 474, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-474-middle-grade-training-room", "volume_title": "Volume 5", "body": "<h1>Chapter 474: Middle Grade Training Room</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 474: Middle Grade Training Room</u></strong></p><br/><p>As they eyed the door of the tower being opened, the crowd immediately became noisy. Xiao Yan could only cease his introduction, and raised his hands at Han Yue. After which, he looked at the increasingly wide gap of the door.</p><br/><p>When the door was opened, the human crowd outside the tower door suddenly swarmed in, much like a flood.</p><br/><p>Xiao Yan borrowed the advantage of a large group of people as he squeezed into the crowd and rushed into the ‘Blazing Sky Qi Refining Tower.’</p><br/><p>After entering the tower Han Yue brought those few ladies that were with her and parted ways with Xiao Yan since their paths were different. Before she left, she reminded Xiao Yan to pay more attention to every action of the ‘White Gang.’</p><br/><p>Xiao Yan naturally accepted Han Yue’s good intention in his heart. After watching their backs until they disappeared from his sight, he turned to the members of ‘Pan’s Gate.’ Before entering the tower earlier, he had told them that they needed to be careful of their first grilling by the ‘Heart Flame.’ Moreover, he also told them the secret of how to correctly resolve the Heart Flame. Therefore, there was no excessively strange phenomenons occurring other than the bodies of the new students becoming stiff as their eyes tightly shut and their faces became flushed.</p><br/><p>After waiting for nearly two minutes, Xun Er was the first to open her eyes. There was a faint glow which covered her entire face. Clearly, she had gained quite a lot after the Dou Qi was refined by that cluster of Heart Flame.</p><br/><p>Xiao Yan was also a little surprised at Xun Er being able to wake up this quickly. As she had already known how to resolve the Heart Flame, the test of being grilled by the Heart Flame for the first time had naturally lost its verification purpose. Hence, that standard of one being more outstanding the longer one endured was also useless. Instead, currently, it was to see who was the one who could exhaust all of the strength of the wisp of Heart Flame and achieve the effect of strengthening their Dou Qi. It was this reason that caused Xiao Yan to feel shocked at Xun Er’s speed.</p><br/><p>Behind Xun Er was unsurprisingly Hu Jia. After her, the members of the ‘Pan’s Gate’ began to wake up one after another.</p><br/><p>Although the time they woke up was not uniform, it was clear from their glowing expressions that they had reaped quite a lot of benefits from the grilling of a wisp of Heart Flame. It appeared that the ‘Fallen Heart Flame’ did indeed grant enormous help when training.</p><br/><p>“This ‘Blazing Sky Qi Refining Tower’ is indeed a little fantastic. No wonder those older students improve so quickly. This Inner Academy actually relies on it…” A surprised expression was on Xun Er’s face. However, on top of being amazed, there seemed to be some other feeling that other people would have difficulty sensing.</p><br/><p>“Training in the tower does indeed have the effect of gaining twice the effect with only half the effort.” Hu Jia at the side also nodded joyfully. She said, “By training in the ‘Blazing Sky Qi Refining Tower,” I will definitely be able to advance to the Dou Ling class in less than a year!”</p><br/><p>The other members of ‘Pan’s Gate’ also echoed with joyful faces. That anxious manner of theirs really appeared like they wanted to immediately find a place to sit down and train.</p><br/><p>“This should be student Xiao Yan, right?”</p><br/><p>Just as Xiao Yan was prepared to bring everyone to search for a training room, a middle-aged man suddenly and swiftly walked toward them. He smiled and asked a question toward Xiao Yan.</p><br/><p>“This student is indeed Xiao Yan. Does instructor have something to discuss?” When Xiao Yan saw the special badge on this middle-aged man that only the instructors of the Inner Academy could wear, he immediately replied courteously.</p><br/><p>“I was instructed by Elder Liu to lead you all to that ‘Middle Grade Training Room’...” The middle-aged man spoke softly with a smile.</p><br/><p>Xiao Yan’s eyes brightened when he heard this. Only then did he recall that special ‘Middle Grade Training Room’ that Elder Liu had mentioned yesterday. He hurriedly cupped his hands together and said, “In that case, thank you very much for leading the way, instructor.”</p><br/><p>“Ke ke, it’s fine. Follow me.” The middle-aged man smiled and shook his head. His gaze randomly swept over Xiao Yan’s body. A moment later, he nodded slightly, turned around and led the way at the front.</p><br/><p>“Follow him.” Xiao Yan waved toward everyone behind and hurriedly followed the middle-aged instructor in front.</p><br/><p>The group of people followed behind this middle-aged man as they walked toward the area where the middle grade training rooms were inside the tower. After a few minutes of the tortuous route, everyone paused outside a somewhat old training room.</p><br/><p>As they saw this training room which appeared somewhat old and broken compared to other places, Xiao Yan’s group could not help but be speechless. Seeing their expression, the middle-aged instructor knew what they were thinking, and laughed involuntarily as he pushed the door and entered.</p><br/><p>Xiao Yan stood at the door, hesitated for a moment before leading the way in.</p><br/><p>As they walked into the room, a faint cold air moved along their feet and climbed up from the spot where their feet touched the ground, causing the bodies of Xiao Yan’s group to have a cool feeling.</p><br/><p>The faint warm light within the room was not too eye-piercing. Neither did it cause them to feel the room was dark. The size of the room was quite large with more than enough space to hold forty people. There was a large spacious platform in the middle which was piled from various pieces of dark black rocks. The platform was around two inches higher than the ground.</p><br/><p>“Xiao Yan, the black rock area in the middle is the training area.”</p><br/><p>The middle-aged man smiled, and walked toward the edge of the black rock platform. He lowered his body and pointed at some cable ties which were distinctly divided and smiled as he said, “Each person will have sufficient training space. This place has a notch which protrudes out. As long as all of you place your own Fire Crystal Card into respective ones and activate your Qi Technique, there will be an unceasing amount of Heart Flames appearing in your body. After which, all of you can use it to refine your Dou Qi, toughen your Qi Paths and bones, and raise your strengths.”</p><br/><p>Hearing this, Xiao Yan’s group hurriedly went forward and surrounded the place out of curiosity. They did indeed see that there were individual training area being drawn out on the black platform with an unknown dye. Moreover, there was a rock platform socket that was an inch higher in this training area.</p><br/><p>“This is the first day that you have entered the ‘Blazing Sky Qi Refining Tower’ to train. Hence, I need to tell you all about the rules you must take note of.” The middle-aged man straightened his body, mused for awhile before continuing, “Although the refinement using the Heart Flame can cause your training speed to soar greatly, you cannot forget about your meals nor sleep and simply just train here. This is because the Heart Flame contains the violent and wild strength of a fire. When it refines the debris within the Dou Qi, it also appends some wild and violent forces of a flame into it…”</p><br/><p>“The wild and violent forces of this kind of flame cannot be resolved by Dou Qi. Instead, one must use time to wear them off. Hence, with your current strength and your resistance to the Heart Flame, it would be best if you train for half a day then rest for some nights. Training and resting in this manner is the best…”</p><br/><p>“After you all have trained for a long time here, you can increase your training time appropriately. If you advance to the Dou Ling class, you can train for four to five days in one go within the tower without leaving. However, now… you all must take it one step at a time and follow the stipulated resting and training time. Otherwise, you will only damage yourself. This kind of thing is something that we, in the Inner Academy, don’t wish to see.” The middle-aged instructor reminded gravely.</p><br/><p>Xiao Yan’s group nodded their heads when they heard the middle-aged instructor’s reminder.</p><br/><p>The middle-aged instructor smiled when he saw this. He waved his hand and said, “Since you already understand this, then all of you should make the most of your time and train. The effects of your first time entering a training room to train will be extremely notable. Many new students with outstanding training talent advanced a level in their first training. Hopefully, all of you are able to do so too.”</p><br/><p>Once he said that, he swung his sleeves, turned around and walked out of the door.</p><br/><p>Xiao Yan mused slightly as he eyed the middle-aged instructor leaving. After which, he walked swiftly and followed him. When he sent the latter out of the door, he suddenly whispered, “Instructor, please wait.”</p><br/><p>The middle-aged instructor could not help but be stunned when he heard Xiao Yan’s words. While he was still slightly stunned, Xiao Yan swiftly stuffed a small jade bottle into his hand and spoke with a smile, “We have troubled instructor today. This is a bottle containing medicinal pills that are able to let one calm down and train. It is not considered to be very valuable…”</p><br/><p>The middle-aged instructor was about to return the item Xiao Yan had suddenly stuffed into his hands when he heard it was a medicinal pill that would enable one to calm down and train. A joy flashed across his eyes. He hesitated for a moment before he smiled stored the jade bottle away as he looked left and right. In a soft voice, he said, “Little fellow, rest assured. Coincidentally, I am in charge of this area. Hence, hee hee, you can be at ease and train.”</p><br/><p>“Ke ke, instructor, thank you very much.” Xiao Yan smiled and nodded.</p><br/><p>“If you do not dislike it, you can call me old brother Hou Hu in the future.” That middle-aged instructor laughed and replied.</p><br/><p>“In that case, the little me will do as you say even though I don’t deserve it.” Xiao Yan responded and smiled.</p><br/><p>“Ah, good. Go in and train. Don’t waste time.” Hou Hu continued to smile and spoke while he waved his hand.</p><br/><p>Xiao Yan nodded, turned around and shut the door.</p><br/><p>Seeing the room door which was shut, Hou Hu could not resist shaking his head and whispering, “This little fellow really knows how to conduct himself. Not bad, not bad, I like him…”</p><br/><p>......</p><br/><p>“Tsk tsk, this kind of strange training method is really unheard of.”</p><br/><p>Xiao Yan had just entered the room when he heard Hu Jia’s voice. He followed the voice and looked over, only to see that she was repeatedly stroking the black-colored stone platform.</p><br/><p>Xiao Yan smiled and nodded. He walked forward and his hand carefully touched the black platform. A faint warmness moved along his finger and was transmitted over. Under this strange warmth, it appeared that the speed in which the Dou Qi was circulating in his body had become much more dynamic.</p><br/><p>“It is indeed a little intriguing. Ke ke, everyone, find a place to sit. Let’s see how many people among us can advance to a higher level in our first training!” Xiao Yan drew the large Heavy Xuan Ruler from his back. He flicked his hand and returned it to his storage ring. His body leaped and he took the lead in finding a place that was a little to the left of the room.</p><br/><p>Seeing Xiao Yan taking the lead, all the members of ‘Pan’s Gate’ did as they were ordered. Their bodies flashed and each of them found a training spot.</p><br/><p>Xiao Yan crossed his legs and sat on the rock platform properly. He sensed the warmth which was becoming increasingly rich. After which, he let out a long breath and flicked his finger. A green-colored Fire Crystal Card appeared in his palm.</p><br/><p>He held the green Fire Crystal Card tightly with both hands. After which, he carefully inserted it slowly into the notch on the ground. He heard a slight creaking sound as a faint light shot out from within the notch. Following the appearance of this light, Xiao Yan could clearly see that the number, one hundred forty-eight, on his green Fire Crystal Card reduce by one. Clearly, this should be the deduction of one day’s worth of training fee, which was also one ‘Fire Energy’.</p><br/><p>Not long after the ‘Fire Energy’ was deducted, Xiao Yan slowly shut his eyes. His hands formed the training seals and his body appeared to be like an old monk in meditation, not making even the slightest movement.</p><br/><p>Soon after Xiao Yan did this, Xun Er and the rest also inserted their Fire Crystal Cards into the notch. In an instant, a slight creaking sound was repeatedly sounded within the room. Faint glows were lit at the same time and basically covered the light in the room.</p><br/><p>The glow gradually dimmed and the room, which originally had some private conversations, slowly became quiet. Only the sound of steady and strong breathing slowly reverberated throughout the room.</p><br/>\n</div>"}