{"title": "Chapter 475: Refinement", "id": 475, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-475-refinement", "volume_title": "Volume 5", "body": "<h1>Chapter 475: Refinement</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 475: Refinement</u></strong></p><br/><p>There was only the long lasting and calm sound of heartbeats slowly reverberating within his quiet and lonely space. After entering the training condition, Xiao Yan’s ability to sense the surrounding natural energy became even sharper. He could feel the hot energy within this training room, which was so rich that it left one speechless. When training in this kind of place, people who practiced a fire affinity Qi Method would undoubtedly obtain an even more notable effect compared to the others.</p><br/><p>“Pu…”</p><br/><p>Xiao Yan’s spirit became even more quiet. Suddenly, a low and slight sound appeared. Immediately, a cluster of seemingly invisible fire seedling that contained a strange undulation appeared at a spot not far away from Xiao Yan’s heart without any forewarning. Threads of warmth were being emitted, grilling the interior of Xiao Yan’s body until it was steaming hot.</p><br/><p>Xiao Yan mind focused on that wisp of invisible flame. He once again felt a fear due to the elusiveness of the ‘Fallen Heart Flame.’ Even though he was currently in an extremely prepared condition, he still did not sense just how this wisp of flame had appeared...</p><br/><p>Xiao Yan sighed quietly in his heart. He stared intently at this wisp of flame seedling. The current cluster undoubtedly appeared a little stronger than the one that Xiao Yan had met yesterday. It was likely due to this being a Middle Grade Training Room.</p><br/><p>Following the appearance of this cluster of ‘Fallen Heart Flame,’ the kind of burning feeling in his Qi Paths he felt yesterday began to appear once again. However, Xiao Yan did not use the ‘Green Lotus Core Flame’ to isolate it like he did before. After understanding the training method here, he already understood that letting the Qi Paths, bones, muscles, and even the cells slowly persist and evolve under this burning pain was a very important link in training within this ‘Blazing Sky Qi Refining Tower.’ Hence, if he were to isolate it, the benefits he would gain would become increasingly small. In that way, he would lose more than he gained.</p><br/><p>Xiao Yan clenched his teeth and endured the pain. That wisp of invisible flame seedling soared even more happily. The high temperature which curled upward seeped out and seemed to have formed an oven n his body. All the organs and even the Qi Paths in a person’s body were being with refined within this oven. Moreover, they were repeatedly becoming stronger under this refinement!</p><br/><p>The burning pain that was created from the high temperature caused the Qi Paths in Xiao Yan’s body to occasionally twitch extremely slightly. However, it was fortunate that it such pain was not impossible to endure. After withstanding it in this manner for ten minutes, Xiao Yan’s mind moved. A faint glow was suddenly emitted from that rhombus shaped Dou Crystal in the middle of the vortex. Immediately, waves of powerful Dou Qi began to unceasingly swarm out from it like a floodgate that had been discharged.</p><br/><p>Dou Qi swiftly circulated in his Qi Paths and it finally arrived by the wisp of the Fallen Heart Flame’s split body under the direction of Xiao Yan’s mind. As his mind moved, the Dou Qi that had been waiting at that spot immediately rushed over. Green-colored Dou Qi directly poured into that invisible flame!</p><br/><p>At that instant, when the Dou Qi entered the invisible flame, Xiao Yan could clearly feel that the latter had suddenly become much hotter instantaneously. The Dou Qi that had entered the flame was like boiling water that was bubbling. There was something that was repeatedly being expelled within that high temperature and stripped off...</p><br/><p>This kind of bubbling did not last for very long before that thread of Dou Qi successfully came out of the flame. After the Dou Qi exited the flame, its size was around half as much compared to when it had entered. However, the power and compactness of the energy that was contained within far exceeded what its earlier form could compare with. Clearly after being refined by the invisible flame, this thread of Dou Qi had successfully undergone a slimming process.</p><br/><p>After the first thread of Dou Qi had successfully exited the flame, it was directed by Xiao Yan’s mind and once again moved along his Qi Paths. It circulated one full cycle before being poured into the Dou Crystal. Immediately, the glow on the surface of the Dou Crystal once again soared a little.</p><br/><p>Joy immediately flowed into Xiao Yan’s heart when he saw this change of the Dou Crystal. This ‘Fallen Heart Flame’ was indeed worthy of being a training accelerator. This effect would directly cause anyone to view it with envy. If this matter were to spread, it was likely that the Jia Nan Academy would not be able to escape having people covet it even with its position in the continent.</p><br/><p>Following the first successful refinement, Xiao Yan put down the final worry in his heart. His mind flashed and threads of Dou Qi were being drawn out from the Dou Crystal unceasingly. After which, they circulated along his Qi Paths, passed through the flame and once again returned to the Dou Crystal!</p><br/><p>A perfect cycle. A perfect refinement. Under this kind of cyclic training, Xiao Yan could sense the increasingly surging Dou Qi in his Dou Crystal. According to this speed, it was likely that he would be able to reach the peak of a six star Da Dou shi without much time and break through to a seven star Da Dou Shi from this!</p><br/><p>One did not have a precise concept of time when training. When everyone was swiftly raising their strength deep within them, there was a drive that appeared to cause them to anxiously want to train until they advanced to the next level.</p><br/><p>The surface of everyone’s body in the spacious training room was wrapped by a layer of faint invisible fluctuations. Thin, faint white-colored fog rose from their heads. Immediately, it gradually became fainter until it was finally transformed into nothingness and disappeared.</p><br/><p>Occasionally, an intense quivering would appear on the invisible fluctuations on the surface of one’s body. Following the occurrence of this quivering, a faint red glow would suddenly swarm onto their faces. At that moment, if they were to carefully increase their perception, they would discover that their aura was much stronger than what it was before. Clearly, these people were extremely lucky to obtain a chance to advance the level of their strength during their first refinement.</p><br/><p>Most of those in this training room who had a chance to advance their strength were those who had quite a good training talent but whose strength were only around that of a seven or eight star Dou Shi. People similar to Xiao Yan and Xun Er, whose strength had already reached that of a seven or eight star Da Dou Shi did not show such an advancement situation. After all, most of the students who were of similar level to them had already entered the second or third level to train. This first level middle grade training room could no longer fulfill their need.</p><br/><p>The training time was like flowing water as it quietly elapsed between the gap of one’s finger. When an ancient gong unknowingly sounded throughout the entire level, all the closed-eyed individuals in the training room slowly opened them. In an instant, the Qis of some people which could not be controlled properly due to the increase in their strength immediately spread all over the place.</p><br/><p>Xiao Yan’s eyes suddenly opened as a faint glow flashed past. He exhaled a deep breath of turbid air that had been restrained in his chest for a long while. As he twisted his neck, he could hear the clear cracking sound of his bones colliding with one another and laughed involuntarily. He turned his head and swept his gaze over the members of ‘Pan’s Gate’ who had woken up, only to feel stunned. When his gaze swept over their eyes, he discovered that there was actually a thread of faint fiery redness.</p><br/><p>“This should be caused by the the wild and violent energy factor that was mixed into their Dou Qi by the ‘Fallen Heart Flame’ due to the refinement of their Dou Qi.” Since Xiao Yan was an expert in playing with fire, he was not unfamiliar with this kind of situation and managed to see the reason at a glance.</p><br/><p>“It looks like it is indeed as Hou Hu had said. Those who are not strong cannot continue to train in this place. Otherwise, if an excessive amount of the wild and violent energy factor of the flame is accumulated, it would sooner or later result in a Fire Poison that is difficult to cure and damage one’s body.” Xiao Yan muttered and sighed in his heart.</p><br/><p>“Xiao Yan ge-ge, how was your training?” A soft gentle voice suddenly sounded beside Xiao Yan. He raised his head and discovered it was Xun Er who had just woken up.</p><br/><p>Xiao Yan’s gaze swept across Xun Er intelligent eyes before he raised his eyebrow, feeling somewhat surprised. This girl actually did not have the slightest abnormality even after training for so long. That manner appeared as though the wild and violent energy factor of the flame had no effect on her.</p><br/><p>“This girl is also another one who hides her strength…” Xiao Yan muttered. He once again turned his head to where Hu Jia and Wu Hao were at and discovered that there was a wisp of an extremely faint red glow which vaguely existed in their eyes. Clearly, they, whose surface strength was similar to Xiao Yan and Xun Er, had also suffered the erosion from the wild and violent energy factor of the flame.</p><br/><p>Xiao Yan shook his hand and a crystal card appeared in his hand. He rubbed that smooth mirror surface and stared carefully at himself for awhile, only to realize somewhat surprisingly that the traces of erosion had actually not appeared in his eyes.</p><br/><p>“With the ‘Green Lotus Core Flame’ protecting your body, you can refine your Dou Qi without fear. Although the ‘Green Lotus Core Flame’ cannot compare with the ‘Fallen Heart Flame’ in terms of its ranking on the ‘Heavenly Flame Ranking,’ it would be somewhat wishful thinking if just this small little split body were to cause any harm to you, who has the ‘Green Lotus Core Flame’s’ protection. As for your little girlfriend, it is likely that she possesses some mysterious object to protect her body…” Yao Lao’s voice quietly sounded in Xiao Yan’s heart just as he was feeling doubtful.</p><br/><p>Xiao Yan only came to a sudden understanding when he heard this. He nodded without leaving a trace. His heart rejoice a little as he asked, “In that case, I can continue to stay in this ‘Blazing Sky Qi Refining Tower’ to train, and need not rest to resolve the wild and violent factor?”</p><br/><p>“Yes. As long as you are able to endure the toughness of the training, the you, who possesses the ‘Green Lotus Core Flame,’ can control the training time as you please.” Yao Lao smiled as he replied.</p><br/><p>“Ke ke, I have already endured this hardship for a few years, what can I not withstand?” Xiao Yan softly laughed. Some joy involuntarily surfaced on his face. With the ‘Green Lotus Core Flame’ protecting his body, the time he could train in the tower would greatly surpass other people. If this was the case, his training speed would also far exceed other people!</p><br/><p>“Looks like I need to find an excuse to stay in the tower fto train. I cannot just waste this precious time for no reason. If I can reach the Dou Ling class earlier, I will have the strength to snatch the ‘Fallen Heart Flame’ when there is a chance for it in the future!” A thought flashed across Xiao Yan’s heart. He stood up from the black stone platform and flashed down from it. After which, he extended his hand, found Xun Er and told her some of his plans beside her ear.</p><br/><p>Xun Er nodded after feeling a surprise in her heart. She focused on Xiao Yan’s somewhat fervent face before saying gently, “You can rest assured. Hand the matters of ‘Pan’s Gate’ to the three of us. You just need to be at ease and train.”</p><br/><p>Xiao Yan lowered his head and eyed that elegant and ethereal face. For some unknown reason, a slight ripple involuntarily surfaced in his calm heart. This girl was really becoming more and more pretty over the years. After having left to train for so many years, it was extremely difficult for Xiao Yan to meet one woman whose appearance and demeanor could compete with her.</p><br/><p>Xiao Yan shook his head with all his might and temporarily threw aside his thoughts. He gently patted Xun Er’s head before turning around and walking out of the training room by himself. Now, he needed to use some connections in order to conveniently be able to continue staying in the tower to train. Since he had the help of the ‘Green Lotus Core Flame,’ it really would not be justified if he did not grab hold of this unique opportunity.</p><br/>\n</div>"}