{"title": "Chapter 472: Meeting", "id": 472, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-472-meeting", "volume_title": "Volume 5", "body": "<h1>Chapter 472: Meeting</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 472: Meeting</u></strong></p><br/><p>The atmosphere of the well lit room contained a faint scent of gunpowder. There were over ten people standing around or sitting within this room. At this moment, there was some anger on the faces of these people.</p><br/><p>“Boss, that ‘Pan’s Gate’ really doesn’t know what is good for them. They actually dared to beat up Fu Ao until he is in such a state. If we do not get back at them, how will our ‘White Gang’ survive in the Inner Academy in the future?” A man in the room suddenly could not control himself as he slammed his palm on the table, and cried out furiously.</p><br/><p>“That’s right, Boss, we cannot let Big Brother Fu Ao just suffer this beating.” The voice of that man had just sounded when the remaining people in the room went along with it and demanded uniformly.</p><br/><p>A man was leaning on the back of his chair as he was seated on the leader’s seat in the room and his palm fondled his chin. Looking at his appearance, there was a faint similarity between him and Bai Shan. It appeared that he should be the leader of the ‘White Gang,’ Bai Shan’s older cousin and that strong person who was ranked thirty-fourth on the ‘Strong Ranking,’ Bai Cheng.</p><br/><p>Bai Cheng ignored the people in the room who were rousing to action as a group. His gaze stopped on a human figure on his left side. At this moment, half of the face of this human figure was wrapped in gauze. From the half side of the face that was exposed, one could vaguely identify this person. He was Fu Ao, who had fainted on the spot after Xiao Yan ruthlessly swung a punch at his face today.</p><br/><p>“Fu Ao, how are your injuries?” Seeing this miserable manner of Fu Ao, the man involuntarily frowned as he opened his mouth and asked.</p><br/><p>As he opened his mouth, the noisiness in the room immediately became quiet. Everyone's gaze paused on Fu Ao’s body.</p><br/><p>“I did not suffer any overly serious internal injuries. However, I will need to rest for four to five days in order to be able to fully recover.” A somewhat changed voice of Fu Ao was being emitted from the mouth belonging to Fu Ao, who had half of his face wrapped up.</p><br/><p>“What is the strength of that Xiao Yan like?” Bai Cheng nodded slightly and narrowed his eyes. That calm voice of his contained a thread of dark coldness.</p><br/><p>“His own strength is merely around that of a five or six star Da Dou Shi. However, he seems to be able to use a kind of Secret Technique in order to forcefully increase his own strength, raising it to the Dou Ling class. Additionally, the flame which he uses is also extremely domineering and powerful. The combination of a Dou Technique and an item agglomerated from Dou Qi attack which I had displayed were all neutralized by that domineering flame.” A disatisfaction flashed across Fu Ao’s eyes. The anger in his voice also became richer, “Originally, I would not have lost so miserably, but who would expect that the fellow actually knows a sonic Dou Technique. He took advantage of me when I could not defend, shaking me until I became absent-minded, and launched a heavy blow to beat me up until this manner.”</p><br/><p>Bai Cheng nodded slightly. He turned his heads to one side. The cold-faced Bai Shan was seated there. The latter nodded when he saw Bai Cheng looking over and said faintly, “Older Cousin, the details are roughly the same as what Big Brother Fu Ao had said. That Xiao Yan does indeed possess these skills. In addition, he also knows an even stronger Dou Skill. That is the mysterious flame that he used to attack Luo Hou with back then. For some unknown reason, he did not use it today.”</p><br/><p>“I have also heard of that fire lotus Dou Technique. It is indeed very strong but it seems to be very exhausting. With Xiao Yan’s strength, he may perhaps be only able to display it once or twice in his peak condition.” Bai Cheng nodded and replied.</p><br/><p>“Boss. This time around, I was at a disadvantage because I didn't know the details. If we were to fight him next time, I would definitely not lose!” Fu Ao said with extreme dissatisfaction.</p><br/><p>“Do you still think that you have not embarrassed yourself enough?” Bai Cheng’s face sunk. His palm abruptly slammed on the table. His clear voice shocked everyone in the room until they did not dare interrupt.</p><br/><p>“If you had not given that so called promise before fighting today, I would bring people to crush the ‘Pan’s Gate’ and get them to disband immediately. However, you, a fool who thinks highly of yourself, actually dared to make such a promise after clearly knowing that Xiao Yan had defeated Luo Hou. Now that the agreement has been spread throughout the Inner Academy, won’t we end up being bad-mouthed if we go and find trouble with ‘Pan’s Gate’ now? There are quite a number of people in this Inner Academy who are waiting to see us, the ‘White Gang,’ embarrass ourselves.”</p><br/><p>“Then what do we do? We cannot just simply let this pass so easily, no? If we were to act like nothing happened, it would not be beneficial to the reputation of our ‘White Gang.’” Fu Ao could only soften his voice because of the reprimand by Bai Cheng as he replied indignantly.</p><br/><p>Bai Cheng lifted the teacup beside him and took a shallow sip. He lifted his head and was quiet for a while before slowly speaking, “You have already promised not to find trouble with ‘Pan’s Gate’ for half a year. Therefore, for a brief period of time, the members of the ‘White Gang’ should try to avoid having conflicts with them…”</p><br/><p>“Older Cousin, you are thinking of leaving Xiao Yan’s group alone for half a year?” Bai Shan could not help but ask with a frown after he heard this.</p><br/><p>Bai Cheng held the teacup tightly, and mused a little before nodding. He said faintly, “They won’t be able to become much stronger in half a year. At that time, I will personally issue a challenge to ‘Pan’s Gate.’”</p><br/><p>“Isn’t this a little too risky? Who would know what kind of unexpected changes would happen in half a year’s time? That Xiao Yan is not someone that can be handled with common sense.” Bai Shan said in a deep voice.</p><br/><p>“Relax. Even if they were to spend every single day of this half a year training in the ‘Blazing Sky Qi Refining Tower,’ they would at the very most reach the peak of the Da Dou Shi class. It is not so easy to advance into the Dou Ling class. Moreover, I am also not a fool like Fu Ao. Even if I have absolute confidence in winning, I will not promise a one on one. At that time everyone from the ‘White Gang’ will move together. I want to see if their ‘Pan’s Gate’ can still struggle to stand.” Bai Cheng waved his hand and said.</p><br/><p>“This…” Bai Shan still hesitated a little when he heard this. During the period of time when he was living alongside Xiao Yan in the forest, he had seen Xiao Yan create quite a lot of miracles that caused people to be endlessly shocked. Hence, he continued to have an uncertain feeling in his heart.</p><br/><p>“This is only the initial plan. We will decide based on the situation at that time. Get someone to observe every single action of this ‘Pan’s Gate’...” Seeing that Bai Shan was still slightly perturbed, Bai Cheng could only helplessly shake his head and change his words.</p><br/><p>“Alright, it is already quite late. Everyone should dispense. Tomorrow, I will enter the ‘Blazing Sky Qi Refining Tower’ to train. It will perhaps be five to six days before I will come out. During this period of time, you, Fu Ao and the other two will look after the matters within the gang.” Bai Cheng stood up and commanded faintly.</p><br/><p>“Yes.”</p><br/><p>......</p><br/><p>In the morning of the next day, when the sky had just brightened, the lights in the new students’ residence area were brightly lit. Numerous human figures came rushing out from their rooms before they finally lined up orderly in front of the small pavilion home of Xiao Yan’s four-man group.</p><br/><p>“Creak…”</p><br/><p>A long while later, the door of the small pavilion home was slowly pushed open. Xiao Yan’s four-man group slowly walked out. They stood in front of the door and eyed those high-spirited members of the ‘Pan’s Gate,’ whose faces were filled with excitement, smiling involuntarily. Although these members were currently still quite weak, their potential was quite great. As long as they were given sufficient time, Xiao Yan believed that they would sooner or later become true strong people.</p><br/><p>“Let’s go.”</p><br/><p>Since the members were all gathered, Xiao Yan did not say any other unnecessary words. He waved his hands, and took the lead along with Wu Hao, Xun Er, and Hu Jia as they swiftly walked toward the exit. The over forty new students followed close behind.</p><br/><p>On the road that led to the ‘Blazing Sky Qi Refining Tower,’ the students coming and going eyed that large group of people who passed by them with a ‘Hu La’ sound. They could not help but be a little stunned. When some of those with sharp-eyes saw Xiao Yan and the large Heavy Xuan Ruler he was carrying on his back, surprised voices immediately sounded.</p><br/><p>“Huh? Isn’t that Xiao Yan?”</p><br/><p>“Ha, he appears quite handsome…”</p><br/><p>“The two girls that are following by his side also appear to be very beautiful. Hee hee, I wonder who will be lucky enough to get on intimate terms with them…”</p><br/><p>“These people should be the new student faction ‘Pan’s Gate’ which has caused an uproar in the Inner Academy recently, right? It seems that their aura is quite good.”</p><br/><p>“I heard that even Fu Ao from the ‘White Gang’ was beaten by Xiao Yan yesterday. Looks like this fellow does indeed have some strength.”</p><br/><p>“......”</p><br/><p>Xiao Yan let out a gentle breath as he heard the various private conversations as they passed by. Now their ‘Pan’s Gate’ could be considered to be famous in the Inner Academy. However, their current strength and reputation did not appear to match.</p><br/><p>Xiao Yan shook his head and ignored the discussions the people around were having over him and ‘Pan’s Gate.’ He let out a urging sound and the speed of the group increased. After which, they carried a slip of dust as they swiftly disappeared at the end of the road…</p><br/><p>After walking for nearly an hour, the ‘Blazing Sky Qi Refining Tower,’ that merely exposed its peak, finally appeared in their sights. When the people from ‘Pan’s Gate’ saw that extremely mysterious tower, surprised sounds involuntarily appeared one after another.</p><br/><p>“Xiao Yan ge-ge, is this the ‘Blazing Sky Qi Refining Tower?’ It is indeed very unique to be actually buried underground.” Xun Er eyed that extremely large tower, and let out a sweet soft laugh in a lovely manner, attracting quite a number of surprised gazes from the men who were waiting at this place.</p><br/><p>“Yes.”</p><br/><p>Xiao Yan smiled and nodded. He led everyone to occupy a spot which was not too near the front. According to the rules of the Inner Academy, this ‘Blazing Sky Qi Refining Tower’ had a strict opening and closing time. Hence, Xiao Yan’s group could only patiently wait for the door of the tower to be opened.</p><br/><p>As time slowly flowed passed, the human flow around them also became increasingly large. The noisy sounds as well as the human flow that gathered caused everyone in ‘Pan’s Gate’ to be shocked. It was unexpected that the Inner Academy possessed such a number of people despite the extremely harsh condition to enter it.</p><br/><p>The spot where Xiao Yan’s group was, was undoubtedly the place which attracted the most attention. During these few days, Xiao Yan and the matter of ‘Pan’s Gate’ being formed had already become the focus of attention of the entire Inner Academy during this period of time. Moreover, the matter of Xiao Yan defeating Fu Ao and causing the ‘White Gang’ to fall back had further intensified the spreading of this reputation.</p><br/><p>Xiao Yan’s group was seated cross-legged as they ignored the noisy voices and various looks they received around them.</p><br/><p>Time continued to flow past like the sand between fingers. Over twenty minutes since Xiao Yan had arrived, there was suddenly a group of people who had squeezed out from within the crowd. After which, they slowly walked toward the spot where Xiao Yan’s group was at.</p><br/><p>As this group of people walked forward, the gazes around gathered onto them. After seeing the leader of this group, their gazes turned toward the place where Xiao Yan’s group was at. Their eyes carried some delight from watching the fun.</p><br/><p>The atmosphere which had suddenly become strange caused Xiao Yan to open his eyes. He raised his head, and threw his gaze toward the group of people that walked over, and could not help but frown slightly.</p><br/><p>“Chief, be careful. That fellow is the leader of the ‘White Gang,’ Bai Cheng!” Atai, who was beside Xiao Yan, wore a solemn expression as he softly informed him.</p><br/><p>“Yes.”</p><br/><p>Xiao Yan nodded his head slightly. He waved his hand and the dozens of ‘Pan’s Gate’ members who were seated cross-legged on the ground let out a ‘swish’ sound as they stood up in union. Numerous gazes stared intently at Bai Cheng’s group which was slowly walking over.</p><br/><p>In an instant, the atmosphere outside the ‘Blazing Sky Qi Refining Tower’ had turned somewhat tense.</p><br/>\n</div>"}