{"title": "Chapter 481: Tou She Ancient Emperor", "id": 481, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-481-tou-she-ancient-emperor", "volume_title": "Volume 5", "body": "<h1>Chapter 481: Tou She Ancient Emperor</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 481: Tou She Ancient Emperor</u></strong></p><br/><p>Tou She Ancient Emperor’s Jade?</p><br/><p>Xiao Yan frowned slightly when he heard these strange words that came out from Xiao Yan’s mouth, and saw the stunned expression on her face. His hand tightly held the cool mysterious ancient jade and said, “You recognize this thing?”</p><br/><p>Xun Er inhaled a deep breath of cool air. Her expression was changing rapidly. It was a long while later before she clenched her teeth and swiftly walked to Xiao Yan’s side. She said softly, “Xiao Yan ge-ge. Where did you get this from?”</p><br/><p>“When the entire clan was moved, the Elders gave me to keep it safe.” Xiao Yan eyed Xun Er’s strange expression and his frown deepened a little. He asked in a deep voice, “What is it?”</p><br/><p>“So it is this thing… the portion of the key which the Xiao clan holds is actually the Tou She Ancient Emperor’s Jade…” Xun Er’s gazed stared intently at the ancient jade in Xiao Yan’s hand. A thought in her heart swiftly surged and rolled like flood water. A moment later, she slowly closed her eyes before immediately opening them. The shock in her eyes gradually became calm when she did so.</p><br/><p>“Xiao Yan ge-ge do not take this Tou She Ancient Emperor’s Jade out in front of anyone in the future. Remember. Anyone!” Xun Er held Xiao Yan’s hand tightly. There was a solemness that was never seen before on her face.</p><br/><p>“Although there may be extremely few people on this continent who can recognize this thing, if other people were to know that you possess the Tou She Ancient Emperor’s Jade, I’m afraid that you would immediately invite a fatal disaster. Even… this Jia Nan Academy may attack you out of desire for it.” Xun Er’s voice was extremely soft, seemingly afraid that there might be someone eavesdropping.</p><br/><p>Seeing Xun Er’s solemn expression, Xiao Yan’s face had also become much more solemn. His hand held this piece of mysterious ancient jade. A faint cool was emitted from it, causing his heart to remain calm at all times. He nodded and said softly, “Why is this thing called Tou She Ancient Emperor’s Jade? Isn’t it just a symbol of the clan head of our Xiao clan?”</p><br/><p>Xun Er nodded slightly and softly said, “After such a long time, there may currently no longer be anyone in the Xiao clan who knows about the background of this piece of jade. Hence, it is only treated as a kind of symbol the clan head passes down from mouth to mouth. Moreover, it is used to store a little spiritual imprint within it, in order to conveniently let the clan members know about the life and death of the clan head.”</p><br/><p>“What exactly is its history? Hearing you talk in this manner, this so called Tou She Ancient Emperor’s Jade seems to be an extremely extraordinary thing? Why would it be in our Xiao clan?’ Xiao Yan asked in a deep voice.</p><br/><p>“It is more than just extraordinary…” Xun Er laughed bitterly in her heart but she shook her head, “Xiao Yan ge-ge. Due to some reasons, I cannot tell you too many things now. Otherwise, it will not have the slightest benefit to you. If you believe Xun Er, then listen to me at this moment. In the future, do not take out this piece of jade in front of anyone!”</p><br/><p>Xiao Yan’s knit his brows until they formed a line. He eyed the somewhat begging face of Xun Er and his heart softened a moment later. All he could do was sigh and nod. With a flip of his hand, he stored that incomparably mysterious ancient jade into his storage ring.</p><br/><p>Xun Er sighed in relief only upon seeing Xiao Yan storing the ancient jade properly. She softly said, “Xiao Yan ge-ge. Keep it hidden. Although this piece of Tou She Ancient Emperor’s Jade in your hands is incomplete, it still hides an extremely great energy and magical strength. However, until now, the elders in the Xiao clan only researched and found out about the little insignificant ability of storing a spiritual imprint. In the future, it might provide you with a great amount of help.”</p><br/><p>Xiao Yan nodded slightly. His eyes were shining as he stared at Xun Er. In an instant, the two of them suddenly became quiet.</p><br/><p>This silent atmosphere caused Xun Er to feel extremely uneasy. This was especially so under Xiao Yan’s shining gaze. A bitter laugh involuntarily surfaced in Xun Er’s heart. She sighed, lifted her head and looked directly at Xiao Yan’s gaze. Her voice was soft and gentle as she spoke, “Xiao Yan ge-ge. There are some things I hide from you, but trust Xun Er. Those things absolutely do not pose the slightest harm to you…”</p><br/><p>“Trust me. As long as Xiao Yan ge-ge has the strength to contend with the Misty Cloud Sect, I will tell you about everything, including the faction behind Xun Er, and its relationship with the Xiao clan.”</p><br/><p>Xiao Yan’s eyes stared intently at Xun Er. A long time later, he slowly nodded. His hand rubbed Xun Er’s head, and he said in a deep and soft voice, “Alright, I will wait for the day when you reveal everything to me.” Once he said this, he took the lead in turning his body and walking directly down the stairs.</p><br/><p>Xun Er once again laughed bitterly as she eyed Xiao Yan’s back which had disappeared at the stairs. She clenched her silver teeth and said softly, “Ah, forget it. I don’t need to bother about the mission from the clan. Getting me to take away the ‘Tou She Ancient Emperor’s Jade’ from Xiao Yan ge-ge hands is something that I cannot do… In any case, there is no one else who knows about this. The people in the clan should likely not be able to guess that it is in Xiao Yan ge-ge’s hands.”</p><br/><p>......</p><br/><p>The faint moonlight scattered into the dark black room, shining into it until it was somewhat dim.</p><br/><p>Xiao Yan sat cross-legged on the bed. His spiritual strength completely broke out of his body as his spiritual perception wrapped around the entire room. Every single dark corner within the room was repeatedly searched by it. Such cautiousness continued for over ten minutes before Xiao Yan tapped on the dark black ring. Immediately, a tread of faint glow drifted out and agglomerated into an old figure a moment later.</p><br/><p>“Teacher…” Xiao Yan’s mouth moved when he saw Yao Lao’s figure. The latter waved his hand and voiced his thoughts, “I know that you want to ask about the matter regarding the ‘Tou She Ancient Emperor’s Jade.’ However, even I have only vaguely heard about this thing and have never seen it…”</p><br/><p>Xiao Yan was a little disappointed when he heard this. He probed, “Then does Teacher know what exactly is it?”</p><br/><p>“I can only tell you that this Tou She Ancient Emperor’s Jade is perhaps related to that Tou She Ancient Emperor a thousand years ago…” Yao Lao was silent for a long while before he finally spoke slowly.</p><br/><p>“Tou She Ancient Emperor?”</p><br/><p>Xiao Yan was startled. He muttered this phrase once again from his mouth. A moment later, he said uncertainly, “It’s a person?”</p><br/><p>“Perhaps it is not overboard to call him a God.” Yao Lao sighed. There was an inexplicable respect in his voice.</p><br/><p>Xiao Yan’s heart shook. His throat rolled a little. He naturally knew that there was no such thing as a Emperor in this world. If one insisted that there was, then it would be some living being that had trained Dou Qi until the pinnacle stage where they could contend with the Heavens and Earth.</p><br/><p>“Don’t tell me, he… he was a… Dou Di?”</p><br/><p>Xiao Yan’s voice trembled slightly when he spoke the last two words. In this continent, no matter who it was, one would involuntarily speak with respect when mentioning this phrase that represented an incomparable and supreme peak.</p><br/><p>“Yes.”</p><br/><p>Yao Lao’s spirit also trembled a little at this moment. His low and deep voice reverberated throughout this room, “On the Dou Qi continent, an elite Dou Sheng is perhaps considered to be as rare as a unicorn’s horn or a phoenix’s feather. However, Dou Di… is something that is extremely difficult to appear. That barrier which cannot be crossed is an enormous barrier which confronts many people with talent so outstanding that even the Heavens and Earth are amazed at. Many can only quietly withdraw. Putting aside the ancient times that were already lost, in the current era, with the exception of that Tuo She Ancient Emperor one thousand years ago, the continent, according to what I know, has yet to see another appear…”</p><br/><p>“Dou Sheng and Dou Di… although they differ by only one level, it was like the difference between the Heavens and the Earth. In so many years, those strong people who had the qualification to stand at the peak of this word ultimately end up failing to get there.”</p><br/><p>“The ‘Tou She Ancient Emperor’s Jade’ in your hand is perhaps the rumored item left behind by Tou She Ancient Emperor? Although I am not too certain about its exact use, from the looks of it, it appears to only be a small portion… However, just the name of its owner is sufficient to attract the strong people in the continent to rush over and snatch it. Hence, there is some logic from that little girlfriend of yours not letting you take this thing out in front of anyone.”</p><br/><p>Yao Lao’s expression was somewhat solemn. He had never expected that the Xiao clan would actually possess such a mysterious object that could ruffle the entire continent. Moreover, he knew very well just what kind of severe situation Xiao Yan would face if this news was to leak out. The strong people that this thing would attract were not people that the Misty Cloud Sect could compare with. It was likely that even one of those who come would have already reached strengths comparable to when he was at his peak. With Xiao Yan’s strength, he undoubtedly did not have the slightest ability to resist.</p><br/><p>“Tou She Ancient Emperor…”</p><br/><p>Xiao Yan sighed and laughed bitterly. He suddenly had an illusionary feeling. Originally, what he thought was an ordinary keepsake of the clan was suddenly now something that had a relationship with a legendary Emperor-like person. This seemingly sudden transformation had caused Xiao Yan to feel that it was somewhat surreal.</p><br/><p>“I know that the impact of this matter is a little too huge. You can just treat it as though nothing happened today. Only the three of us know about this matter and I think that it will not leak out. In the future, this Tou She Ancient Jade may perhaps have some benefits to give you. Now, however, your strength is far from being able to come into contact with its profoundness. Hence, just let it quietly stay in your storage ring.” Yao Lao helplessly shook his head and spoke when he eyed Xiao Yan’s expression.</p><br/><p>Xiao Yan laughed bitterly and nodded. This was all he could do at the moment. However, it was unavoidable for his heart to feel uncertain now that he was suddenly in possession of this kind of great treasure.</p><br/><p>“From tomorrow on, you should enter the ‘Blazing Sky Qi Refining Tower’ for a retreat and get to the Dou Ling class as soon as possible in order to increase the chances of success of snatching the ‘Fallen Heart Flame’ by a little.” Yao Lao smiled and suggested.</p><br/><p>Xiao Yan nodded his head. He mused for a moment before his heart became a little relieved. The so called whatever Dou Di was indeed so far away from him that he could not even reach it even if he tried. Now, the most important thing to him was the ‘Fallen Heart Flame’ within the ‘Blazing Sky Qi Refining Tower.’ That thing can give him actual strength. Even if one assumes that this so called Tou She Ancient Emperor’s Jade was something that was left behind by that legendary Tou She Dou Di without discussing the validity of this claim, Xiao Yan did not believe that he would be able to thoroughly understand it after some brief study given that so many ancestors of the Xiao clan failed to do so. Hence, rather than placing his hope on this Tou She Ancient Emperor’s Jade with a use that he was uncertain of, it was better for him to increase his strength and place his thoughts on the ‘Fallen Heart Flame’...</p><br/><p>This was a little more reliable and tangible.</p><br/>\n</div>"}