{"title": "Chapter 482: Green Wood Celestial Vine", "id": 482, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-482-green-wood-celestial-vine", "volume_title": "Volume 5", "body": "<h1>Chapter 482: Green Wood Celestial Vine</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 482: Green Wood Celestial Vine</u></strong></p><br/><p>When Xiao Yan came out of his room the next day, he coincidentally saw Hu Jia and Wu Hao who had returned. Hu Jia was little different from her usual self but Wu Hao’s appearance was a little ugly. His face carried little bruises. Despite carrying many injuries on his face, this fighting lunatic appears to have an excited and fanatic expression. When Xiao Yan observed his manner, he saw that there was faintly a little extra aggressiveness and sharpness to it. Clearly, having muddled along at the Fighting Arena for these few days had caused this fellow to gain something.</p><br/><p>“Xiao Yan, your level actually advanced?”</p><br/><p>When the two of them saw Xiao Yan and sensed his aura that was more mellow and stronger than a couple of days ago, the both of them involuntarily asked in surprise.</p><br/><p>Xiao Yan nodded. He stopped n the hall and smiled as he asked Wu Hao, “How is the Fighting Arena?”</p><br/><p>“There are many strong people. Moreover, they are the kind of strong people who were honed in true battles. They are far from what those people in the Outer Academy, who only know how to train, can compare with. I was there for four days and fought eight rounds, winning three and losing five. In the end, I still lost nearly twenty days of ‘Fire Energy.’” Wu Hao nodded his head. His evaluation of the Fighting Arena was quite high.</p><br/><p>“Oh?”</p><br/><p>Xiao Yan was slightly shocked when he heard this. Even someone with Wu Hao’s strength couldn't maintain a victory rate of fifty percent in the Fighting Arena. It appeared that there were really as many strong people as there were clouds within the Fighting Arena. This caused him to form some interest.</p><br/><p>“If you have the time, you can go to the Fighting Arena to try. That is a good place to hone oneself.” Wu Hao stuffed a pastry in his hand into his mouth and said vaguely, “During a period after this, I’m afraid that I will not often go to the ‘Blazing Sky Qi Refining Tower’ to train. I think that the Fighting Arena is more suitable for me.”</p><br/><p>Xiao Yan smiled. He was about to speak when he heard the footsteps behind him. When he turned around to take a look, he realized that it was Xun Er who was walking down the stairs.</p><br/><p>Xiao Yan smiled at Xun Er. He mused for a moment before speaking, “Coincidentally everyone is present. I shall inform all of you that I plan to go into a retreat within the ‘Blazing Sky Qi Refining Tower’ for a period of time. During this period of them, I will need to hand over the matters within ‘Pan’s Gate’ to the three of you.”</p><br/><p>“Retreat?” The three people in the hall were somewhat stunned when they heard Xiao Yan’s words. It was awhile later before Xun Er asked, “How long?”</p><br/><p>“Until I break through the eight star level.” Xiao Yan replied with a smile.</p><br/><p>“Ugh? You have broken through to the seven star for only a short while and you are thinking of breaking through again? Even with the help of the ‘Blazing Sky Qi Refining Tower,’ one would not have such a speed right?” Hu Jia knit her eyebrows and questioned.</p><br/><p>“One would indeed not have such a speed in the first or second level. However, don’t we possess the green Fire Crystal Card? Ke ke, this thing is sufficient to let us enter into the fifth or even sixth level to train.” Xiao Yan said as he smiled.</p><br/><p>Wu Hao eyes immediately widened when he heard this. He said, “The fifth or sixth level? Don’t you know that each time you descend the ‘Blazing Sky Qi Refining Tower’ by one level, the Heart Flame will become increasingly powerful and hot? With your strength as a seven star Da Dou Shi, you would be able to train at the third level at the very most. The fifth or sixth level would require one to be at least a four star Dou Ling and above to withstand it.”</p><br/><p>Hu Jia by the side also nodded slightly. After getting familiar with the Inner Academy during this period of time, she also knew some of the information regarding the ‘Blazing Sky Qi Refining Tower.’”</p><br/><p>“All of you can rest assured that Xiao Yan ge-ge is able to do it. Haven’t all of you seen the large number of unexpected events that occur around him?” Upon hearing Xiao Yan’s words, Xun Er’s reaction was different from Wu Hao and Hu Jia. She merely was a little startled before she immediately raised her teacup with her delicate hand and took a shallow sip before speaking in a soft voice. Her understanding of Xiao Yan was a little greater than the other two. Moreover, she also understood that given Xiao Yan’s character, it was definitely impossible for him to do things that he was not confident of.</p><br/><p>Xiao Yan nodded with a smile. The him who possessed the ‘Green Lotus Core Flame’ was able to ignore the vigor of the Heart Flame and the corrosion of the Fire Poison. From the other students perspective, these may perhaps be extremely great obstacles in training. However, in front of him, these things would not even delay his footsteps by half an inch.</p><br/><p>Seeing that Xiao Yan had already made up his mind, Wu Hao and Hu Jia could only nod their heads.</p><br/><p>“During the period where I am in retreat, you should all pay a little more attention to the ‘White Gang.’ That Bai Cheng does not appear to be a magnanimous person. I think that even with that half a year agreement, it is likely that he will quietly play some little tricks.” Xiao Yan furrowed his brows slightly when he mentioned Bai Cheng. That dark and evil fellow kept causing people to feel uneasy in their hearts.</p><br/><p>“Xiao Yan ge-ge, you can be at ease and undertake your retreat. When you come out, you will see an even stronger ‘Pan’s Gate.’ As for that Bai Cheng, if he really wants to cause obstruction secretly, he cannot blame us for not following the rules of the Inner Academy.” Xun Er nodded and spoke with a faint smile.</p><br/><p>Xiao Yan nodded slightly. With Xun Er in charge, Xiao Yan would naturally be able to completely be at ease. He did not really view a single Bai Cheng too seriously.</p><br/><p>“That’s right. Is there any place in the Inner Academy that one can obtain various medicinal ingredients or Monster Cores?” Xiao Yan gulped down the tea in his teacup at once before suddenly asking.</p><br/><p>“Medicinal ingredients? Monster Core?”</p><br/><p>Xun Er mused for a moment before nodding. She said, “The eastern region of the Inner Academy is a trading area. There are many different strange objects being sold there which include many medicinal ingredients. These things are those that the students of the Inner Academy found by themselves deep in the mountains. However, you will need ‘Fire Energy’ if you want to purchase them.”</p><br/><p>After remembering the location in his head, Xiao Yan patted his buttock and bid the three others goodbye before he left the new student residence area. After which, he walked all the way to the eastern region of the Inner Academy Xun Er had mentioned. This time around, his retreat would last for a long time. Moreover, in order to display the best effect during the training, he also needed to prepare some things.</p><br/><p>The size of the Inner Academy was extremely vast. Xiao Yan had to spend a total of half an hour to get from the new student residence area to the eastern area of the Inner Academy. However, it was fortunate that this so called transaction area within the Inner Academy could be considered to be a popular place. Therefore, there were always people coming and going along the road that led there such that Xiao Yan did not get lost.</p><br/><p>Half an hour later, Xiao Yan paused outside an extremely vast plaza. There were quite a number of stone tables set up within the plaza. At these moment, there was a dazzling assortment of various items being placed on these stone tables. The squeezing crowd was bustling outside these stone tables. The great popularity of this place caused Xiao Yan to be a little speechless.</p><br/><p>The surrounding noisiness nearly caused Xiao Yan to lose his bearing when he walked into this enormous trading area. He twisted his body and squeezed into the human crowd. His gaze repeatedly swept over the items on those stone tables. As his gaze swept over them, the surprise in his heart increased. He realized that some of the things that were sold here were actually not the slightest bit inferior to some of the large cities in the ‘Black-Corner Region.’ Perhaps it was because the Inner Academy was itself located deep within the vast mountains, but some of the rare items among those on the stone tables were things that one would have difficulty seeing in some of the shops within the ‘Black-Corner Region.’</p><br/><p>After Xiao Yan felt an astonishment in his heart, he began to search for the medicinal ingredients which he needed. The things that he needed were not to refine some high tiered medicinal pill. Hence, it was not too difficult to find them. After spending one hour to scour for treasures and spending nearly thirty days of ‘Fire Energy,’ he had nearly obtained all the medicinal ingredients he needed.</p><br/><p>Xiao Yan shook his head helplessly as he eyed the ‘Fire Energy’ on the green Fire Crystal Card which had greatly shrunk. He originally thought that over a hundred days of ‘Fire Energy’ was considered quite good. He did not expect that it could not endure his spending.</p><br/><p>After sighing over his spent ‘Fire Energy’ within his heart, Xiao Yan decided to leave this noisy place. However, his body had just turned when Yao Lao’s voice suddenly sounded in his heart, “Little fellow. The eighth stall in front of you. Go over there and take a look.”</p><br/><p>Xiao Yan was startled when he heard Yao Lao speaking suddenly. He immediately turned his head around somewhat uncertainly and threw his gaze to the eighth stall in front of him. However, he was a little stunned to realize that the originally squeezing human crowd appeared to be void from that spot. Some students who had passed through this place swiftly leaped pass the area like a rabbit.</p><br/><p>Xiao Yan carried some doubt within his heart as he lifted his footsteps and squeezed into the human flow as he walked over to the somewhat special area.</p><br/><p>As he approached that area where the human flow was cut, his eyes moved along the stall and took a glance, only to see that there was a pale grey clothed man seated cross-legged behind it. His eyes were tightly shut as he ignored the surrounding human crowd. That manner of his did not appear to be like someone who had come out to sell things.</p><br/><p>“This person… his aura is very strong. I’m afraid that even Bai Cheng cannot match him. It appears that he is another expert on the ‘Strong Ranking.’ Although his aura is very strong, it is filled with a kind of fiery and violent hostility. It appears that this fellow’s temper is not very good.” By relying on his sharp Spiritual Perception, the aura of the gray robed man was still unable to escape Xiao Yan’s senses despite the latter having kept it hidden very well. A strange thought immediately flashed across Xiao Yan’s heart as he sensed the aura.</p><br/><p>Xiao Yan’s gaze shifted from the gray-robed man to the stone platform as he slowly swept over it.</p><br/><p>As Xiao Yan’s gaze swept across him, the shock he felt in his heart become increasingly dense. There were quite a number of Monster Cores of various elements being displayed on the stone table. Moreover, these Monster Cores were around rank four. A Magical Beast of such a rank was sufficient to be a match for an elite Dou Ling. It was really unexpected that this person had taken out so many of them at once.</p><br/><p>Xiao Yan shook his head as he sighed in shock. His continuously moving gaze suddenly stilled. A low and soft shocked voice sounded in his heart as his eyes stared at an item in the middle of the stone table.</p><br/><p>The thing that attracted Xiao Yan’s gaze was a dry vine that was around half a foot long. The vine was an emerald green color, much like a good piece of jade. There were faint natural lines being drawn on it. It was wound up like a meandering green snake. The strangest thing was that this dark green dry vine still emitted a strange scent that caused one to feel refreshed. Looking at this point, one would know that this thing was not ordinary.</p><br/><p>“This is?”</p><br/><p>Although Xiao Yan was able to know that this thing should be the rarest item on the stone table by just looking at its appearance, he was unable to identify what it was with just his knowledge.</p><br/><p>“Green Wood Celestial Vine!” Yao Lao faint laughter contained a joy that was difficult to hide.</p><br/><p>“Green Wood Celestial Vine?”</p><br/><p>Xiao Yan was startled when he heard this. Immediately, his heart shook and joy quietly swarmed onto his face.</p><br/><p>Green Wood Celestial Vine. One of the necessary items to refine the ‘Ground Spirit Pill.’ It was really unexpected that he would be so lucky to find it here. It must be said that his luck was at its limit!</p><br/>\n</div>"}