{"title": "Chapter 486: Retreat", "id": 486, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-486-retreat", "volume_title": "Volume 5", "body": "<h1>Chapter 486: Retreat</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 486: Retreat</u></strong></p><br/><p>Xiao Yan clearly sensed his surroundings suddenly become much quieter after entering the third level. He lifted his head and eyed the pathway which was somewhat deserted when compared to the second level. He suddenly came to an understanding. It appeared that there was still only a small portion of students within the Inner Academy who had the qualification to enter the third level.</p><br/><p>If one were to say that the students training on the first and second levels belonged to the basic level of the Inner Academy, the third and fourth levels should belong to those whose strength were at the middle level. The potential of this group of students was extremely great. They could become a member at the peak at any time. As for the students who could enter the fifth and sixth level, they were mostly people who had stepped into the peak level within the Inner Academy. They were a group of strong people who were most respected within the Inner Academy.</p><br/><p>As this thought flashed across his heart, Xiao Yan had some gauge of his strength. He laughed bitterly. The strong people were indeed as numerous as clouds within the Inner Academy… Xiao Yan sighed in this manner within his heart. His gaze swept in all directions before slowly walking along a path and entering the level.</p><br/><p>The layout of the third level and the second level were about the same. Hence, Xiao Yan did not waste too much time. He searched for the high, middle and low grade areas. The low grade area was naturally a grade abandoned by him. His footsteps paused for a moment when he passed through the middle grade training ground. Xiao Yan stood in front of an empty middle grade training ground and hesitated for a moment. A ruthless expression immediately flashed across his face. He did not enter it. Instead he lifted his foot and walked toward the high grade training room...</p><br/><p>What kind of bitterness and difficulty had Xiao Yan not experienced when training? By relying on his own strength, he had contended with the Misty Cloud Sect which had dominated the Jia Nan Empire, and had even killed the First Elder of the other party. How many of those blessed by the Heavens within the Inner Academy had such battle results?</p><br/><p>Xiao Yan did not possess any fear even when facing the Dou Zong Yun Shan. Therefore, he did not believe that he would be forced to become a good-for-nothing from a group of students that were of similar age to him within this Inner Academy.</p><br/><p>Xiao Yan stepped forward with his feet, and walked into the high grade training area. Immediately, numerous gazes that contained partially visible enmity were shot over from all directions. Xiao Yan ignored these gazes. His similarly cold and indifferent gaze slowly swept around him. His shoulders shook, and the force of a seven star Da Dou Shi was completely unleashed. It was like a storm that came sweeping out.</p><br/><p>Sensing the powerful force that erupted from within Xiao Yan’s body, some of the expressions of the students in the high grade area involuntarily changed a little. When they looked at Xiao Yan once again, there was an additional seriousness within their gazes. In this Inner Academy where the strong were honored, acting timidly would cause others to look down on you. If one wanted to obtain the respect of others, one needed to display a strength that would cause others to give one respect!</p><br/><p>Xiao Yan was expressionless. He slowly walked deep into the high grade training room area. His gaze moved across the training rooms one at a time.</p><br/><p>There were a few more high grade training rooms on the third level than on the second level. Xiao Yan had counted them. There was a total of thirty-eight of them. Among these training rooms, there were those that could accommodate the training of twenty people, and those that could only allow one person to train.</p><br/><p>Xiao yan’s gaze swept past these high grade training rooms. There were many training rooms where a tag, which represented that someone was using it, was hung. However, Xiao Yan was not in a hurry. His footsteps slowly moved to the deeper areas.</p><br/><p>When his gaze was about to shift away from the last area of the high grade training rooms, his gaze suddenly stopped. He eyed that training room where an ‘empty’ tag was hung and quietly sighed in relief. After which he swiftly walked into it.</p><br/><p>Xiao Yan walked to the entrance of the high grade training room and touched the door gently with his hand. His eyebrows were slightly lifted. This door, which appeared to be an ordinary wooden board from afar, actually faintly emitted threads of cold air. His finger gently knocked on it and it emitted a clear strange sound. This sound did not ring like one emitted by wood. Instead, it was like a kind of metal.</p><br/><p>“It looks like this is designed in such a fashion because the Inner Academy is worried that the people training inside would be disturbed should someone suddenly kick open the door and enter, resulting in some accident during the training.” Xiao Yan felt the toughness of the door as he heard that low and deep sound. He sighed in relief within his heart. Since this was the case, he no longer needed to worry that someone would forcefully charge in and interrupt his training should he reach a critical point in his training.</p><br/><p>Xiao Yan gently pushed open the door, and slowly walked through the doorway. After which, he shut the door tightly.</p><br/><p>The moment he closed the door, Xiao Yan, whose back was facing it, naturally did not notice the shock and ridicule that some of those students strolling leisurely around this place had in their eyes when they saw that he had chosen this training room.</p><br/><p>......</p><br/><p>Xiao Yan shut the door tightly after entering the training room. After which, he began to observe his surroundings. This training room was clearly meant for a single person to train. In the middle spot of the training room, there was a black stone platform that could only accommodate two people seated cross-legged. Moreover, there were tables and chairs etc. placed in other areas. There was even a bed that was prepared in the furthest corner of the training room.</p><br/><p>“The treatment of the high grade training room in the third level is indeed a little better than that of the two levels above…” Xiao Yan clicked his tongue and praised when he saw these facilities within the training room. He walked toward the black stone platform and finally sat down crossed-legged on it.</p><br/><p>As Xiao Yan’s buttocks touched the black stone platform, a faint warmth entered into his body, causing his bones to have a sort of lazy feeling.</p><br/><p>Xiao Yan flicked his hand and a green Fire Crystal Card appeared in his palm. He took a look at the number on the Crystal Card: one hundred three. In just a short span of less than seven days, the ‘Fire Energy’ on this Crystal Card had shrunk by one third. This kind of depletion rate really caused Xiao Yan to feel ashamed.</p><br/><p>“If I am to continue squandering like this, I’m afraid that the remaining ‘Fire Energy’ will not support me for very long…”</p><br/><p>Xiao Yan laughed bitterly and shook his head. He inserted the Fire Crystal Card into the notch in front of him. A faint glow flashed. That number one hundred three immediately changed to one hundred.</p><br/><p>“As expected. Each time one descends by one level, the ‘Fire Energy’ that is needed increases by one day…” Xiao Yan sighed when he saw the number that was reduced on the Fire Crystal Card. This third level requires ‘three days’ of ‘Fire Energy’ to train for one day. This ‘Blazing Sky Qi Refining Tower’ was really a glutton that would not be full no matter how much one fed it.</p><br/><p>“Since I have already paid the fee, won’t it be a pity if I don’t train to recuperate it?” Xiao Yan shrugged his shoulders, and took out two jade bottles from his storage ring. He removed his black robe, revealing his naked body that appeared somewhat skinny but hid an explosive strength.</p><br/><p>Xiao Yan picked up the jade bottle containing a dark-red-colored paste like item. He flipped his hand and a jade piece appeared in it. After which, he used it to pry out a cluster of red-colored medicinal paste from within the jade bottle.</p><br/><p>“I wonder just how itchy it will be when the Green Ganoderma Fire Spirit Ointment is spread on my body? I’ll just go all out…” Xiao Yan’s eyes stared intently at this cluster of red-colored medicinal paste. A moment later, he clenched his teeth violently and threw it onto his naked chest. After which, he used the jade piece to spread it apart as he rubbed it all over the upper half of his body.</p><br/><p>As the Green Ganoderma Fire Spirit Ointment wrapped around his body, Xiao Yan’s entire body became stimulated and alert. He could clearly feel that his senses toward the fire affinity energy in the training room had suddenly become extremely sharp. He did not even need to use his Spiritual Perception. When he shut his eyes, he could faintly see the repeatedly drifting pale-red-colored energy within the training room...</p><br/><p>“It is indeed useful!” Xiao Yan’s heart immediately rejoiced when he sensed this kind of change. The joy had yet to spread to his face when the corner of his mouth suddenly stilled. Quickly following this, he clenched his teeth tightly together, and tiny dense perspiration instantly covered his forehead.</p><br/><p>“This… is this the side effect of the Green Ganoderma Fire Spirit Ointment… it is indeed numbing and itchy!” Threads of cold wind were released from Xiao Yan’s mouth from between his tightly clenched teeth. He could sense that his skin at the moment felt like it was filled with ants crawling over it. That numb and itchy feeling caused Xiao Yan, who was unprepared, to nearly exit from his training condition.</p><br/><p>Xiao Yan inhaled a few deep breaths of air. He clenched his teeth tightly together and placed the Green Ganoderma Fire Spirit Ointment in his hand down. After which, he grabbed a jade bottle and poured out a pale-green-colored, round medicinal pill from it.</p><br/><p>Xiao Yan opened mouth and flicked the medicinal pill into it. After which, he shut his teeth tightly once again.</p><br/><p>Not long after the Swift Wind Spirit Pill entered his mouth, it transformed into a somewhat agile and pure energy that moved along his throat, rolling and flowing downward. After which… the Dou Qi circulating within his Qi Paths appeared to be like a wild bull that had suddenly consumed some medicine as it began to circulate wildly.</p><br/><p>As he sensed the strange sound emitted by the Dou Qi within his body due to the fast circulation, Xiao Yan’s hands formed the training seal. He slowly shut his eyes. After over ten minutes of adaptation, he finally entered into his training condition.</p><br/><p>When Xiao Yan entered his training condition, one could see the fluctuations that had suddenly appeared in the training room. Waves of fire affinity energy agglomerated out of thin air. After which, they even agglomerated into waves of somewhat substantive pale-red energy… these substance-like pale-red energies whizzed and circulated over Xiao Yan’s head. After which, they appeared to receive a certain suction force as they wildly smashed into Xiao Yan’s naked body.</p><br/><p>The smashing of the energy did not cause Xiao Yan’s body to quiver. Instead, the energy appeared to have fallen into a bottomless pit, and was swallowed by Xiao Yan in an extremely strange manner.</p><br/><p>As the first wave of energy moved, those countless energies circling above Xiao Yan’s head suddenly began to collide with Xiao Yan in an unceasing manner.</p><br/><p>An extremely strange scene appeared within the training room. Due to the energy that was pouring in being too large, Xiao Yan’s body, which was seated cross-legged on the black stone platform, was completely wrapped in circular pale-red energy ball of light.</p><br/><p>The intense energy fluctuations were like ripples that began to swiftly spread within the training room. In the middle of these ripples was Xiao Yan, who was seated cross-legged on the stone platform!</p><br/><p>At this moment, Xiao Yan was like a bottomless pit that was emitting an endless suction force, completely swallowing all of the extremely rich fire affinity energy within the training room.</p><br/><p>If other people could see that nearly frightening swallowing, it was likely that they would be so shocked that they would stare at it with stunned looks created from their eyes and mouth.</p><br/>\n</div>"}