{"title": "Chapter 494: Refining In Bulk", "id": 494, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-494-refining-in-bulk", "volume_title": "Volume 5", "body": "<h1>Chapter 494: Refining In Bulk</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 494: Refining In Bulk</u></strong></p><br/><p>The next morning, the entire ‘Pan’s Gate’ began to operate like a machine. Early in the morning, Xun Er and the other two brought some people out of the new student area. After which, they rushed about the entire Inner Academy, purchasing the medicinal ingredients on the list Xiao Yan had given to them from all over the place.</p><br/><p>After being busy for nearly an entire day, the group of them finally brought back excitement and fatigue as they hurried to the new student area.</p><br/><p>Xiao Yan eyed the large pile of medicinal ingredients in front of him in a quiet, secret room in the small pavilion home. He saw the tiredness that remained on the faces of Xun Er and the other two. He involuntarily said with a gently smile, “You have worked hard.”</p><br/><p>“These medicinal ingredients spent a total of one hundred eighty plus days of ‘Fire Energy.’ Originally, the four of us were unable to scrape together these ‘Fire Energy.’ However, Atai and the other members of ‘Pan’s Gate’ took the initiative to donate and supplement a little. Now, these medicinal ingredients are basically all the remaining property of ‘Pan Gate.’” Xun Er sighed.</p><br/><p>Xiao Yan quietly nodded. He was slightly moved as he said, “You can rest assured. Remember the ‘Fire Energy’ that Atai and the rest donated will be rewarded. Once the medicinal pills are successfully sold, return double the amount to them.”</p><br/><p>“Yes.” Xun Er nodded. She touched the pile of medicinal ingredients as she knit her eyebrows slightly and said, “The price of purchasing medicinal ingredients within the Inner Academy is a little expensive. I am thinking of forming a group within ‘Pan’s Gate’ or hiring some people from within the Inner Academy to specifically search for the medicinal ingredients that we need deep in the mountains once this batch of medicinal pills is refined. After that, we will pay them a monthly pay according to the number or quality of the medicinal ingredients that each of them hand over. This way, we might greatly reduce our cost.”</p><br/><p>Xiao Yan was startled when he heard this. He immediately nodded as his gaze swept over the large pile of medicinal ingredients in front of him. There was actually not that many medicinal ingredients. However, the price of which was the painstaking effort of the entire ‘Pan’s Gate.’ Xiao Yan sighed. This burden was a little heavy...</p><br/><p>“Ke ke, Xiao Yan ge-ge, we will hand all the matters after this to you. We cannot give the slightest help in the matter of refining pills.” Xun Er laughed in a lovely manner.</p><br/><p>“Yes.” Xiao Yan nodded seriously. He said in a soft voice, “You can rest assured. I will turn all of these medicinal ingredients into the medicinal pills that we need. I will definitely not betray everyone’s expectation.”</p><br/><p>“That’s right, these are the two kind of medicinal pills that I have specially sent someone to purchase from the site where the ‘Medicine Gang’ sells their medicine. One of them is the medicinal pill to recover Dou Qi that Wu Hao mentioned. The ‘Medicine Gang’ calls it ‘Return Spring Pill.’ The other kind is a type of healing medicine which has quite a good effect on external injuries…” Xun Er suddenly took out two small jade bottles from her storage ring, and gently placed them in front of Xiao Yan.</p><br/><p>Xiao Yan was startled when he heard this. He could not help but immediately praise Xun Er’s intelligence within his heart.</p><br/><p>“Alright, Xiao Yan ge-ge, the things that follow will be entirely up to you.” Xun Er suddenly smiled. She waved her hand toward Hu Jia and Wu Hao and the three of them slowly exited the room. After which, she tightly shut the door.</p><br/><p>As the three people left, the secret room once again descended into silence. Xiao Yan stared at the large pile of medicinal ingredients in front of him. He let out a long sigh after a while before sitting down cross-legged and waving his hand. The medicinal cauldron appeared in front of him.</p><br/><p>After taking out the medicinal cauldron, Xiao Yan smoothly received the two kinds of medicinal pills that Xun Er had purchased. First, he took out the so-called ‘Return Spring Pill.’ It was a green-colored medicinal pill that contained an extremely faint medicinal fragrance. Xiao Yan gently sniffed this faint medicinal fragrance before lifting his eyebrows. He shook his head lightly with some disdain. It was likely that this so-called ‘Return Spring Pill’ did not possess over four kinds of medicinal ingredients. Moreover, they were all extremely common types of medicinal ingredients. In the eyes of Xiao Yan with his extremely rich refining skills, this so called ‘Return Spring Pill’ could merely be considered one of the first tier medicinal pills.</p><br/><p>“Looks like these people from the ‘Medicine Gang’ don’t even put in effort without the presence of any competition.” Xiao Yan laughed faintly. He took out the other bottle of healing medicine. This kind of healing medicine was in a salve form and was dark-red in color. Xiao Yan placed it under his nose to sniff. He managed to differentiate the medicinal ingredients that were blended within. He could not help but immediately shrugged his shoulders.</p><br/><p>Xiao Yan placed both kinds of medicinal pills back in their original spot. He turned his gaze toward the medicinal cauldron and his expression gradually became calm.</p><br/><p>Once Xiao Yan entered into the state before he started refining medicine, he would be in an attentive condition. His gaze calmly stared at the medicinal cauldron in front of him as a thought rolled slightly in his mind. This time around, he planned to refine three types of medicinal pills. One type of the ‘Energy Recover Pill’ that enabled one to recover Dou Qi. This kind of medicinal pill was something that Xiao Yan had already practiced until he had reached the pinnacle. With his current medicine refining standard, he could at the very least maintain his success rate of refining the ‘Energy Recovery Pill’ at around eighty-percent.</p><br/><p>The second type was a kind of healing medicine for one to orally consume. Its name was ‘Body Recovery Pill.’ This kind of medicinal pill not only had a certain healing effect on one’s internal injuries, but it also had quite a good healing effect on external injuries. This kind of ‘Body Recovery Pill’ far exceeded that type of salve healing medicine the ‘Medicine Gang’ sold regardless of whether it was in terms of medicinal effect or tier. Moreover, the most crucial factor was that the medicinal ingredients that this kind of medicinal pill needed was even lesser than that salve healing medicine that the ‘Medicine Gang’ sold!</p><br/><p>Xiao Yan had absolute confidence in this kind of healing medicine, which had low cost and great medicinal effects. As long as it was not a fool who had his head caught between the door, most people would know which to choose.</p><br/><p>The third type of medicinal pill was named ‘Quiet Ice Pill.’ Upon the consumption of this kind of medicinal pll, one would be able to extremely effectively ease the doping of the Fire Poison. If one were to discuss its tier, the ‘Quiet Ice Pill’ could perhaps enter the peak of the second tier. Looking from a certain point of view… it would not be overboard to even say that this kind of medicinal pill was that of a third tier. This was because this kind of assistance medicinal pill, one that could help people train, had a value that far exceeded healing medicines and other kinds of medicinal pills.</p><br/><p>This kind of medicinal pill would allow ‘Pan’s Gate’ to surpass the ‘Medicine Gang’ in one shot, creating a monopoly on the medicinal pill within the Inner Academy. This was because until now, the ‘Medicine Gang’ did not have a single medicinal pill that could resist the Fire Poison!</p><br/><p>The medicinal formula for the three kinds of medicinal pill flashed across his mind. Xiao Yan sighed a deep breath of air. His expression gradually became solemn. He rubbed his fingers slightly and the green-colored flame instantly rose from the tip of his finger.</p><br/><p>The curling green-colored flame was like a spirit as it jumped in a lively manner on Xiao Yan’s finger. Under the dancing of this fire spirit, the temperature within the secret room was slowly climbing…</p><br/><p>Dark-black eyes stared intently at the rising green-colored flame. A long while later, Xiao Yan flicked his finger gently. The green-colored flame drew a distorted arc through the air. It passed through the fire outlet and abruptly burned and soared within. The high temperature grilled the medicinal cauldron until it emitted a slight ‘zi zi’ sound.</p><br/><p>Xiao Yan’s eyes stared unblinkingly into the medicinal cauldron. His long finger slowly moved past the medicinal ingredient pile on the left side. Suddenly, his finger trembled. A couple of different types of medicinal ingredients were accurately clipped between his fingers.</p><br/><p>With a gentle wave of his hand, a couple of medicinal ingredients were thrown into the medicinal cauldron where the green fire was rising. Following the entrance of the medicinal ingredients into the hot cauldron, the green-colored fire seedling was abruptly extended and it was completely swallowed...</p><br/><p>There was not the slightest change in the expression on Xiao Yan’s face as the medicinal ingredients were swallowed by the fire seedling. His palm faced the medicinal cauldron in the empty air in front of it. His long finger was flicked slightly. Following the flick of his finger, one could see that the green-colored flame within the medicinal cauldron suddenly began to dance. As the flame rose, a cluster of pure pill liquid was being refined as it was suspended on the top of the fire seedling.</p><br/><p>Xiao Yan’s eyes observed the suspended pill liquid indifferently. The hot temperature was repeatedly seeping out, expelling some of the remaining impurities within the pill liquid…</p><br/><p>At this moment, Xiao Yan’s Spiritual Strength had already penetrated the medicinal cauldron. Under the micromanagement of his Spiritual Strength, the temperature of the green-colored flame would rise and fall according to his thoughts. Under this perfect control, the pill liquid was culled until it was becoming increasingly pure…</p><br/><p>Xun Er and the two others were sitting within the spacious hall. They were somewhat distracted while conversing with one another. Occasionally, their gazes would sweep toward a tightly shut door on the floor above. There was a faint anxiety in their eyes.</p><br/><p>“It is fast approaching one and a half days… why has Xiao Yan not come out yet?” Wu Hao, who had become restless because of the pressuring atmosphere, finally could not resist as he took the lead to open his mouth to speak.</p><br/><p>“Let’s wait a little longer. We are all not alchemists. Therefore, we are also uncertain about the sequence for refining medicinal pill. However, we must not disturb Xiao Yan ge-ge no matter what…” Xun Er shook her head and spoke softly.</p><br/><p>Hu Jia by the side could only helplessly sigh. The only thing that they could do was wait. Currently, nearly the entire ‘Pan’s Gate’ was waiting for Xiao Yan to come out. If he were to fail, it would be an extremely great blow for the morale of the members of ‘Pan’s Gate.’ After all, since they had come to be acquainted with the Xiao Yan, who had always appeared in the form of an ever victorious general in front of them, the latter had never failed… hopefully, this time around would not be an exception.</p><br/><p>“Creak…”</p><br/><p>The sound of a door opening suddenly rang out in the hall with an oppressive atmosphere. The three of them were startled. They immediately raised their heads and turned their gazes toward the originally tightly shut door, which was being slowly opened at this moment.</p><br/><p>Xiao Yan slowly walked out under the gaze of the three people. That delicate and handsome face may be filled with fatigue, but the joy between his brows did indeed cause the three people in the hall to quietly relax their hearts, which were as tense as a cord. They exchanged glances with one another before sighing in relief.</p><br/><p>Xiao Yan stood on the second story, and smiled toward the three people down in the hall. He swiftly walked down the stairs and came to the table in the middle of the hall. With a wave of his hand, a few hundred jade bottles instantly flashed and appeared, filling the entire table until it was full.</p><br/><p>“Three types of medicinal pills. Eighty-three ‘Energy Recovery Pill,’ sixty-two ‘Body Recovery Pill,’ and thirty-six ‘Quiet Ice Pill.’ In total, there are one hundred eighty-one pills.” A brilliant smile surfaced on Xiao Yan’s face as he laughed out with a clear voice.</p><br/><p>“So many…” The faces of the three people were shocked as they eyed the table which was filled with jade bottles. This was especially so after they heard the numbers that Xiao Yan had reported. A joy involuntarily surfaced between his brows.</p><br/><p>“It is fortunate that I did not fail my orders. I can only rely on all of you for the matter of selling it after this. I am really burned out…” Xiao Yan sat down on the soft chair. His face was filled with a tiredness as he spoke softly to the three of them.</p><br/><p>Xun Er and the other two nodded excitedly. The three of them swarmed to the side of the table and carefully counted the jade bottles.</p><br/><p>“Xiao Yan ge-ge…” Xun Er turned around after discussing the selling procedures with the other two. She had just called out but was stunned when she eyed Xiao Yan, who was sleeping with his eyes tightly shut and had his hand supporting his head. She took out a soft blanket from beside her and covered it over Xiao Yan’s body. In a gentle voice, she said, “Sleep. Xiao Yan ge-ge, when you have awoken, Xun Er will report to you the good news…”</p><br/>\n</div>"}