{"title": "Chapter 490: Progress of Training", "id": 490, "volume": 5, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-490-progress-of-training", "volume_title": "Volume 5", "body": "<h1>Chapter 490: Progress of Training</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 490: Progress of Training</u></strong></p><br/><p>Xiao Yan leaned his back against the door after he entered the training room. His originally sleek red face had suddenly become much paler. The ‘Swift Wind Spirit Pill’ that he had consumed before his training had caused the Dou Qi to increase its circulating intensity for a short period of time. However, after his training was interrupted, the side effect of the ‘Swift Wind Spirit Pill’ had appeared. The slowly circulating Dou Qi in his body caused Xiao Yan to have a weak feeling flowing all over his body. Earlier, one of the reasons that Xiao Yan had resorted to the ‘Angry Buddha Lotus Flame’ when exchanging blows with Lei Na earlier was to use it to show his might and deter others. The other hidden reason was that the weak Dou Qi in his body was insufficient to allow him to hold out for too long against Lei Na’s hands.</p><br/><p>Xiao Yan glanced at his shattered robe and sighed gently. He could not help but feel some lingering fear in his heart. If Lei Na’s attack earlier was a little faster, it was likely Xiao Yan would be forced to reveal an opening, and would end up being seriously injured. Fortunately, the appearance of the ‘Angry Buddha Lotus Flame’ had caused Lei Na to first lose his fighting spirit. The deterrent effect that he needed was also perfectly achieved. All of these had some element of luck mixed in as well.</p><br/><p>Xiao Yan softly coughed for a couple of times. He slowly walked to the black stone platform and sat cross-legged on it with some difficulty. He inhaled and exhaled the warm air deeply a couple of times before forming his training seal. After which, he once again entered his training condition, circulating his Dou Qi and slowly recovered his condition.</p><br/><p>After nearly three to four hours of training while sitting cross-legged, the weak feeling in Xiao Yan’s body gradually disappeared. The slow Dou Qi as a result of the ‘Swift Wind Spirit Pill’ also began to slowly recover its normal state.</p><br/><p>After the condition in his body recovered, Xiao Yan once again took out a ‘Swift Wind Spirit Pill’ and swallowed it. Once again, he entered into his retreat training state!</p><br/><p>Earlier Xiao Yan came to know that Liu Fei appeared to have an extremely strong older cousin from her own mouth. Moreover, from looking at the degree of respect that Lei Na had toward this so called older cousin, it was clear that this person’s strength far exceeded Lei Na. Although he was considered to have gained an advantage in this matter today because of favoritism by Elder He, he most likely had completely offended that woman because of this. This type of woman who appears to be gentle, but bones were extremely haughty would likely be unaware of what was called appeasement based on Xiao Yan’s expectations. Hence… in order to put an end to some trouble in the future, the current Xiao Yan needed to swiftly raise his strength!</p><br/><p>There was no concept of time during training. A full five days passed since the incident that had happened in the third level that day. During these five days, the name of Xiao Yan had gradually been transmitted into the ears of all the students who were training within the ‘Blazing Sky Qi Refining Tower.’</p><br/><p>A frightening fire lotus skill that had frightened Lei Na, who was a four star Dou Ling, until he had lost his fighting spirit on the spot. Xiao Yan had also not given Liu Fei, who possessed the beautiful name of Snow Fairy within the Inner Academy, even a little face, and after using such a heavy blow, he did not receive any great punishment from the usually strict Elder He. All of these mysterious incidents caused Xiao Yan to become the hottest topic of conversation within the Inner Academy in a short period of time.</p><br/><p>Of course, when they were spreading the conversation contents to one another, there were quite a number of students who involuntarily felt respect in their hearts. Forget about discussing why the usually strict Elder He would treat Xiao Yan with such politeness. Just the frightening fire lotus of Xiao Yan’s, which shocked Lei Na until the latter lost his fighting spirit, was sufficient to cause them to feel respect toward Xiao Yan. In this ‘Blazing Sky Qi Refining Tower’ and even the entire Inner Academy, the strong would ultimately be honored no matter how one put it. It was also because of the frightening fire lotus that Xiao Yan had displayed to cause some of those suitors of Liu Fei’s, who quietly admired her, not to dare look for Xiao Yan to issue a challenge. Otherwise, how would Xiao Yan be able to quietly undertake a five day retreat without anyone daring to come and interrupt him after having offended Liu Fei, the little beauty who possessed quite a great reputation within the Inner Academy?</p><br/><p>However, no matter how one put it, the deterrent effect that Xiao Yan required was indeed something that he had successfully achieved!</p><br/><p>People came and went in the spacious third level. The atmosphere was extremely lively and there would occasionally be one or two battle circles with heated fights. Many curious people surrounded these battle circles.</p><br/><p>When the human flow that came and went passed through a certain corridor in the high grade training area, they would involuntarily throw their gaze toward a high grade training room by the side where a tag representing someone was occupying it hung. These gazes were filled with curiosity and some respect. During these few days, nearly all the students training in the third level knew that this training room was the place where the new student, Xiao Yan, who had shocked the elite four star Dou Ling, Lei Na, with the frightening fire lotus until he lost his fighting spirit, was staying in.</p><br/><p>There were also quite a number of people who had come after hearing Xiao Yan’s name. They wanted get a look at this student’s appearance. However, ever since the end of the fight that day, Xiao Yan had not come out after entering that training room. This had caused them to be slightly disappointed. However, the people around could only give up the thought of seeing him. Although an ordinary Dou Zhe or even Da Dou Shi may need to eat something to fill one’s belly after training for a day, the degree of one’s resistance to hunger would become increasingly stronger following the increase in strength of one’s Dou Qi. Once one reach the class of the Da Dou Shi, one might not be able to completely ignore eating food, but when one was in a training state, the body’s consumption would reach its lowest point. If one did not consume any food for five days, there would not be any serious effect other than one’s body being a little weaker.</p><br/><p>Hence, after seeing the tightly shut training room door, the students who had come after hearing his name could only leave in disappointment. After all, they did not know just how long this retreat of Xiao Yan would continue for.</p><br/><p>“Creak…”</p><br/><p>The sudden sound of a door opening in the corridor attracted some gazes over. This was especially so when they saw the door number of the one that was being opened. They immediately became startled and their gazes became much hotter.</p><br/><p>The entire noisy corridor had suddenly become much quieter. Numerous gazes were thrown to the door which was opening.</p><br/><p>Under the focus of everyone’s gazes, the young man in black robes slowly walked out with a calm expression. When he saw those gazes in the corridor which were thrown at him, he could not help but knit his eyebrows slightly together. He helplessly shook his head, turned around and left this training room. After which, he slowly walked toward the entrance to the fourth level of the ‘Blazing Sky Qi Refining Tower.’</p><br/><p>After spending nearly seven days training on the third level, the perfect progress that Xiao Yan had obtained in his training had caused him to feel stunned. Xiao Yan was able to faintly feel that he had entered into the peak of a seven star Da Dou Shi in just this short seven days partly because of help of the ‘Swift Wind Spirit Pill,’ the ‘Green Ganoderma Fire Spirit Ointment,’ and the refining effect of the Heart Flame during this period of time. According to this speed, he might be able to touch the barrier of the eight star without much time and break through it in one go.</p><br/><p>Xiao Yan felt extremely excited at his progress. However, just as Xiao Yan was planning to continue training and break through to the eight star level in one go, he was suddenly somewhat stunned to discover that the Heart Flame could not keep up. After nearly seven days the Heart Flame and the circulating speed of the Dou Qi, the Heart Flame of the third level was beginning to be unable to provide satisfactory supply. At times, it would be choppy, causing Xiao Yan to have no choice but to cut his training and choose to come out from his retreat midway through it.</p><br/><p>Now that the strength of the Heart Flame could no longer satisfy Xiao Yan’s requirement, he could only continue down to the fourth level. Otherwise, his training speed might be greatly reduced.</p><br/><p>Under the heated gazes of everyone, Xiao Yan slowly disappeared at the edge of the corridor. When they saw the path which he was taking, the crowd in the corridor involuntarily emitted sounds of private conversations.</p><br/><p>“He appears to be intending to head to the fourth level?”</p><br/><p>“Uh, isn’t the fourth level a place that one must reach the Dou Ling class strength to be able to enter? Xiao Yan doesn’t appear to have achieved it right?”</p><br/><p>“Ah… but who knows. He can even defeat Lei Na. I think that he should be able to enter the fourth level, right?”</p><br/><p>Everyone in the corridor faced each other before they immediately laughed bitterly and shook their heads.</p><br/><p>Xiao Yan did not hear the private conversations behind him. He walked past the corridor before taking a turn, and saw the passageway which had instructors strictly guarding it. After hesitating for a moment, he walked over swiftly.</p><br/><p>“One must have the strength of a Dou Ling in order to enter the fourth level. Those whose strength has not reached it are prohibited from entering!” An instructor saw Xiao Yan who was walking over from the distance and spoke lazily.</p><br/><p>“Uh?” Xiao Yan’s footsteps paused. Surprise flashed on his face. Immediately, he let out a bitter smile. It was unexpected that the condition to enter the fourth level was this harsh. Could he only continue to train at the third level? Just thinking of how the Heart Flame was humbled when faced with the circulating Dou Qi in his body, Xiao Yan could not help but feel a little headache.</p><br/><p>“You… you are Xiao Yan?” Just when Xiao Yan felt a headache, the other instructor who had come forward to size Xiao Yan up suddenly opened his mouth and asked in surprise.</p><br/><p>Hearing the surprised voice of his companion, the instructor who had spoken lazily earlier also raised his head in astonishment. He eyed the black-robed young man who had come in front of him and saw that somewhat familiar face. Once again, he recalled the instructions of the First Elder and hurriedly said, “You are that Xiao Yan who had a conflict with Lei Na a couple of days ago?”</p><br/><p>Xiao Yan hesitated a little when he saw the surprised gazes of those two instructors. He nodded slightly before immediately cupping his hands together toward the two instructors and said, “Since this student has not met the requirement, I will continue to train at the third level. I have disturbed you, instructors.”</p><br/><p>“Hey, wait!”</p><br/><p>Seeing Xiao Yan turn around with the intention of leaving, the instructor from earlier hurriedly stopped him. The latter’s face was full of smiles as he said, “Elder He has already given instructions to us. If you want to enter the fourth level, we need to do things according to the rules. Therefore… please.”</p><br/><p>Xiao Yan could not help but be startled when he saw the smiling manner of this instructor. Joy immediately surfaced on his face. If he could enter the fourth level to train, breaking through to the eight star Da Dou Shi would be just around the corner. Immediately, he hurriedly cupped his hands toward the two of them. “Thank you very much, Elder He and instructors.”</p><br/><p>“Ke ke, there’s no harm… your level may not have reached the requirement, but in terms of strength you do have the qualification.” The two instructors smiled gently and replied when they saw the joyous face of Xiao Yan.</p><br/><p>“Alright, you should go down first. I saw that you have undertaken a retreat for quite a number of days. After entering the fourth level, you should eat something. Otherwise, your body cannot endure this kind of closed door training.”</p><br/><p>“Thank you for your concern, instructor.”</p><br/><p>Xiao Yan voiced his thanks toward the two of them, cupped his hands together and hurriedly walked into the passageway. After which, he disappeared around a corner with numerous stunned gazes behind him.</p><br/>\n</div>"}