{"title": "Chapter 504: Recruitment", "id": 504, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-504-recruitment", "volume_title": "Volume 6", "body": "<h1>Chapter 504: Recruitment</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 504: Recruitment</u></strong></p><br/><p>Three days had passed since the pill refining competition. During these three days, Xiao Yan’s amazing and envious medicinal refining skills were spread by word of mouth by most of the Inner Academy students.</p><br/><p>At this moment, the reputation of Xiao Yan in the Inner Academy was likely comparable to that of those top experts in the top ten of the ‘Strong Ranking.’ An alchemist who could refine a tier five medicinal pill would be able to enjoy the same treatment as a strong Dou Wang or even a Dou Huang no matter where one was. One could get a glimpse of this from the suddenly warm attitude that those Inner Academy Elders suddenly displayed toward Xiao Yan.</p><br/><p>In the past, those Elders merely treated Xiao Yan as a student with massive potential due to the quiet orders that First Elder gave to specially take care of Xiao Yan. However, they were now truly treating him as a person on the same level of them when they conversed. There was an additional politeness that was difficult to discern when they spoke or conversed. After all, these Elders clearly knew in their hearts that the value of an alchemist who could refine a tier five medicinal pill far exceeded a strong person of the Dou Wang class.</p><br/><p>After clearly comprehending the difference in worth between the both of them. Some Elders naturally no longer displayed that haughtiness of an Elder in front of Xiao Yan. This was because they knew their status did not contain much suppressing force compared to Xiao Yan’s. Since it was useless, what was the point of using their status to speak?</p><br/><p>During the three days, Xiao Yan’s reputation had soared within the Inner Academy. Moreover, Xiao Yan borrowed the reputation he had forged in the competition to spread the important news to the Inner Academy students that ‘Pan’s Gate’ had begun to sell medicinal pills. After witnessing Xiao Yan’s pill refinement in the Northern Stadium, quite a number of people became interested in the medicinal pills of ‘Pan’s Gate.’ Furthermore, quite a number of people began to frequent the region outside of the new student area, wanting to purchase the pills beforehand.</p><br/><p>Additionally, the five trading areas that the ‘Medicine Gang’ had promised were also successively taken over by ‘Pan’s Gate’ due to Xiao Yan’s victory in the competition. The ‘Medicine Gang’ was clearly extremely dismayed. They felt great pain handing over these trading areas with extremely high volumes of traffic, and had repeatedly found excuses to delay handing them over, this little ruse of the other party naturally crumbled after Xiao Yan invited Elder Hao to show his face.</p><br/><p>Finally, under the expressionless face of Elder Hao, the ‘Medicinal Gang’ could only clench their teeth. They watched as members of ‘Pan’s Gate’ removed the ‘Medicinal Gang’ insignia, engraved in the trading areas, and replace it with their own.</p><br/><p>After these five trading areas entered into their hands, Xiao Yan and the rest truly felt what was called having a hot human traffic. In merely one day, nearly two hundred medicinal pills were sold. As they watched the soaring ‘Fire Energy’ on the Fire Crystal Card, Xiao Yan and the few others were involuntarily a little dumbfounded.</p><br/><p>The medicinal pills were completely sold and the lock that the ‘Medicine Gang’ had placed on the medicinal ingredients had also been removed. Naturally, Xiao Yan needed to get busy. However, Xiao Yan was still unable to meet the demand even after refining for two days, all day and all night. Xiao Yan could only laugh bitterly and shake his hand. After which, he revealed to Xun Er and the rest a suggestion that had been brewing in him for a long while.</p><br/><p>“We should go and rope in some alchemists.”</p><br/><p>Xiao Yan wore dark circles around his eyes as he helplessly spread his hands toward Xun Er and the two others in the hall. “I am unable to undertake such large scale refinement work by myself. Therefore, we must hire people.”</p><br/><p>“Hire people? In that case, won’t we have to leak the medicinal formula to others?” Xun Er was somewhat startled when she initially heard Xiao Yan’s suggestion. She mused for a moment before she finally asked softly.</p><br/><p>“This is something that is unavoidable. I cannot remain locked up in the house refining medicinal pills everyday, right?” Xiao Yan shook his head with a bitter smile as he spoke, “We cannot keep the medicinal formulas a secret forever. Moreover, all of you view the value of these three medicinal formulas too highly. If there is really the day when the secret is leaked, I will naturally take out an even more outstanding medicinal formula.”</p><br/><p>These words were indeed true. The three types of medicinal formula were merely around that of the first or second tier. They could not be considered to be too valuable.</p><br/><p>Xun Er and the two others hesitated for a moment when they heard this before nodding their heads. What Xiao Yan said was true. After all, he could not stay holed up in ‘Pan’s Gate’ refining pills everyday.</p><br/><p>“I will hand the matter of looking for Alchemist to you. Remember, you must carry this out privately. You must clearly investigate every Alchemist who enters ‘Pan’s Gate’ on whether they have had any relationship with the ‘Medicine Gang’ in the past.” Xiao Yan reminded seriously.</p><br/><p>“Xiao Yan ge-ge is worried that Han Xian would send someone to secretly sneak into ‘Pan’s Gate?’” Xun Er asked with a soft laugh.</p><br/><p>“That fellow is not someone who is honest with everything. He would not rule out using such methods if it allowed him to obtain the medicinal formulas.” Xiao Yan said faintly.</p><br/><p>“Alright. I know. Leave this matter to us.”</p><br/><p>The efficiency in which Xun Er’s group did things caused Xiao Yan to be speechless. On the second day after he posed his suggestion, Xun Er had taken the lead to find three Alchemists who were around the third tier. From what Xun Er said, they were not recruited by the Alchemist Department for one reason or another. Therefore, they were not entangled with the ‘Medicine Gang’ within the Inner Academy. Instead, due to them sharing the same occupation, they were frequently bullied by the members of the ‘Medicine Gang.’ Once they heard that ‘Pan’s Gate’ had the intention of absorbing scattered Alchemists, they basically agreed without much hesitation.</p><br/><p>If it were in the past, these Alchemists might not pay much attention to a new faction like the ‘Pan’s Gate.’ However, it was different now. Although ‘Pan’s Gate’ did not have any elite Dou Lings, they had an Alchemist who could refine a tier five medicinal pill. This name was sufficient to attract quite a number of people. These Alchemists had come because of Xiao Yan’s reputation as the top alchemist within the Inner Academy.</p><br/><p>Xiao Yan did not have much doubt in Xun Er’s ability to distinguish people. After he met with the three Alchemists and saw their faces filled with worship, he felt unable to laugh nor cry. However, he discovered that the three of them had quite a good medicine refining experience after a test. Therefore, Xiao Yan immediately agreed to accept the three people into ‘Pan’s Gate.’</p><br/><p>Xiao Yan did not immediately hand the medicinal formula to them after accepting the three Alchemists. Instead, he quietly observed the conversation and conduct of the three people before calling all three of them to a secret room two days later. He then handed out three complete medicinal formulas for the three medicinal pills to the three people, and sternly instructed them not to leak them out.</p><br/><p>The three Alchemists were shocked at Xiao Yan’s generous act of imparting the medicinal formulas to them after merely three days. Only then did they bow to Xiao Yan with excited faces. There was no need to mention anything else. Just the trust of Xiao Yan alone was sufficient to cause these people, who had muddled along quite miserably due to the suppression of the ‘Medicine Gang,’ to feel a gratitude in their hearts.</p><br/><p>Xiao Yan finally quietly sighed in relief within his heart after seeing the joy and gratitude on the faces of the three people after handing the medicinal formulas to them. At the very least, these three people could be trusted based on the looks of things now.</p><br/><p>With three helpers, Xiao Yan became much more idle. During the short few days he stayed at ‘Pan’s Gate,’ he would occasionally give pointers on refining medicinal pills to the three of them. He had finally escaped from the miserable life of refining day and night just a few days earlier.</p><br/><p>Although the price of the medicine from ‘Pan’s Gate’ was a little cheaper than that of the ‘Medicine Gang,’ it could not be bought everyday. Hence, after the first few days of fervent sales were over, the fiery situation where the medicinal pills that were on display being completely purchased within an hour rarely occurred again. However, the current situation of the sales was already enough to break the monopoly of the ‘Medicine Gang’ and contend with them.</p><br/><p>Humans were ultimately a forgetful living creature. Hence, after one week, the high atmosphere caused by the medicinal pill competition had also began to become weaker. At this moment, Xiao Yan also sighed in relief. Now, there were much fewer hot-glowing needle-like gazes and people pointing at him when he went out.</p><br/><p>Only at this moment did ‘Pan’s Gate’ completely come on track. Xun Er and the others also began to take some time to enter the ‘Blazing Sky Qi Refining Tower’ to train. The training effect that they obtained also caused Xiao Yan to feel somewhat surprised. According to this training speed, it was likely that Xun Er, Hu Jia, and Wu Hao would be able to breakthrough and enter the Dou Ling class within half a year. At that time, the strength of ‘Pan’s Gate’ would take a great leap and soar!</p><br/><p>Perhaps it was because Xiao Yan had been in retreat within the ‘Blazing Sky Qi Refining Tower’ for a long period last time but he did not want to enter that underground tower with tightly shut air to train. Moreover, he also clearly understood that for him, who had just broken through a short while ago, the effects of entering the tower to train would not be very great.</p><br/><p>During his free time, Xiao Yan accompanied Wu Hao to go to the Fighting Arena a couple of times. The extremely fiery hot combat atmosphere within basically caused every person who entered to possess an extremely passionate feeling. Everyone hoped that they could become the main actor in any place. In this Fighting Arena, as long as you entered the arena, you would become the most dazzling main character.</p><br/><p>Xiao Yan’s hand held a railing unmoving as he lazily eyed the extremely intense fight below. As powerful Dou Qi spread, sand flew and rocks were thrown. Occasionally the attacks would land on the tough wall and rock fragments would splash all over the place.</p><br/><p>Xiao Yan indifferently watched the elegant Agility Dou Techniques that the competitor in the arena displayed. His heart suddenly moved as his finger slowly rubbed the storage ring. Within it was a scroll that was sufficient to cause many people’s eyes to redden. It was the Di class Agility Dou Skill: Three Thousand Lightning Movement!</p><br/><p>“It appears… it should be about time to start practicing it.” Xiao Yan muttered softly. His heart had suddenly become fiery hot.</p><br/><p>“Looks like I need to enter the deep mountains alone…” Xiao Yan laughed softly. After which, he did not wait to greet Wu Hao, who was waiting to enter the arena. Instead, he walked out of the Fighting Arena. After having rested for nearly half a month, he should add a heavy bargaining chip to his own strength.</p><br/><p>It was obviously not possible to practice the ‘Three Thousand Lightning Movement’ within the Inner Academy. Therefore, Xiao Yan intended to enter the vast deep mountains alone and stay there until he had successfully learned the ‘Three Thousand Lightning Movement!’</p><br/>\n</div>"}