{"title": "Chapter 503: Victory", "id": 503, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-503-victory", "volume_title": "Volume 6", "body": "<h1>Chapter 503: Victory</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 503: Victory</u></strong></p><br/><p>The entire stadium descended into silence because of the dark-red medicinal pill that lay quietly in the hands of the black-robed young man. A long while later, the silence was finally broken by a furious voice. One could see Han Xian swiftly walking over to where Xiao Yan was. His reddened eyes were just like a gambler who had lost until he was bankrupt, “Impossible, there is definitely some fraud. This fellow must have used the opportunity of the rising white fog earlier to cheat!”</p><br/><p>When they heard Han Xian furious roar after losing himself, not only did most of the people in the stadium frown, but displeasure also quickly flashed across Elder Hao’s face. Xiao Yan had refined under his very eyes. If one said that Xiao Yan had cheated, did that not mean that person was mocking him, saying his old eyes were muddled.</p><br/><p>“Student Han Xian. Please pay attention to your words. It is not up to you to decide whether it is fair.” Elder Hao coldly glanced at Han Xian as he cried out.</p><br/><p>Hearing Elder Hao snap at him, Han Xian finally recovered from the state where he lost himself. He hurriedly bowed and apologized when he saw the displeasure on the former’s face. He clearly understood just what kind of power these Elders had within the Inner Academy.</p><br/><p>Elder Hao’s expression only became slightly better when he saw Han Xian apologizing. His gaze turned toward Xiao Yan. Those stern eyes contained a praise that was not the least bit hidden. With such talent and mental strength, whoever could take him in as a disciple was really lucky.</p><br/><p>“Elder Hao, please verify it. Otherwise, some people might not accept it.” Xiao Yan smiled at Elder Hao as he waved his hand.</p><br/><p>Hearing this, Elder Hao hesitated for a moment before he immediately smiled and nodded. He extended his finger and carefully took the tier five medicinal pill and placed it within his hand. Those eyes contained some hot fieriness. This kind of tier five medicinal pill had extremely noticeable effects on elite Dou Wangs like himself. If they were to consume one in a fight with others, the sudden increased in strength would obtain a unique effect of catching the other person by surprise.</p><br/><p>During Elder Hao’s examination, there were suddenly some human figures flashing at the bottom of the stadium. Immediately, a couple of old figures also rushed into the arena. They smiled at Xiao Yan before surrounding Elder Hao. Those eyes of their contained some surprise as they studied the pale-red medicinal pill.</p><br/><p>“You old fellows…” Elder Hao immediately rolled his eyes when he saw these few people surrounding him. He helplessly shook his head and raised the medicinal pill in front of him and said, “Take a look. This should indeed be a ‘Dragon Strength Pill’ that has just come out of a cauldron. This medicinal pill still contains some heat.”</p><br/><p>“Ah. That cannot be fake. I have seen Old Huo from the Alchemist Department refining this ‘Dragon Strength Pill’ before. It is indeed this color and scent.” An old man, who was wearing an Elder badge on his chest, fondled his beard and nodded slightly as he praised with a smile.</p><br/><p>“It is really unexpected that this fellow could actually refine this ‘Dragon Strength Pill’ after only entering the Inner Academy for no more than three months. This medicinal pill is something that only extremely few people could refine even within the Alchemist Department.” The other few Elders also spoke praises.</p><br/><p>To the side, the expression of Han Xian, who had heard the conversation of these elders, involuntarily became much uglier.</p><br/><p>After the few elders had gathered together and muttered for awhile, they turned their bodies and left the arena. However, as they passed by in front of Xiao Yan, all of them paused their footsteps and patted him on the shoulders. Their faces were filled with a warm smile and said, “Little fellow, if we need to refine any medicinal pill in the future, we may need to come and look for you to help out.” These powerful Elders might not take much notice about some tier four Alchemist. However, a tier five alchemist was different. A medicinal pill of this tier would move most of these Elders’ hearts. Therefore, now that they had seen that Xiao Yan was able to refine a tier five medicinal pill, their attitude was naturally much more friendly.</p><br/><p>“Ke ke, as long as Elders are able to prepare their own medicinal ingredients, Xiao Yan will definitely do his best.” Xiao Yan naturally did not reject these Elders as he immediately smiled and replied. After which, he flattered the Elders until they left this place full of smiles.</p><br/><p>Xiao Yan sighed in relief after watching the last Elder leave the arena. He turned his head only to find the smiling face of Elder Hao. The corner of his mouth immediately twitched as he smiled and said, “If Elder Hao has anything that you need help with in the future, you can just come and find the little me. I will not reject you if it is within my ability.”</p><br/><p>“Ke ke, in that case, I will thank you first.” When he heard Xiao Yan speak in this manner, the smile on Elder Hao’s face became much richer. In his heart, he sighed that he was right to be this judge.</p><br/><p>“*Cough*, Han Xian, you have also heard the evaluation of those Elders earlier. Do you have any objections now?” Elder Hao turned his head. The smiling Elder Hao’s face immediately turned into an expressionless one as he spoke to Han Xian indifferently.</p><br/><p>Han Xian’s expression was like that of a pork liver at this moment. A moment later, he finally shook his head, clenched his teeth and said, “No.”</p><br/><p>Elder Hao nodded slightly and turned his head to the stadium. In a deep voice, he said, “The match is over. I announce that Xiao Yan is the victor in this pill refining competition!”</p><br/><p>“Oh!”</p><br/><p>The moment Elder Hao’s voice sounded, the members of ‘Pan’s Gate’ involuntarily cheered out loudly. Being infected by them, the other observers in the stadium also raised their hands high up and used their strength to clap, emitting a loud clapping sound above their heads that could move mountains and flip the seas.</p><br/><p>Xiao Yan’s gaze met with Xun Er’s group at the lower part of the stadium. When he saw them raise their thumbs, he also involuntarily laughed softly.</p><br/><p>“Since you have already admitted defeat, you will hand over the five trading areas that you have promised as the stakes to ‘Pan’s Gate’ within three days. Moreover, you have to remove the hidden suppression of ‘Pan’s Gate.’” Elder Hao turned his head towards the gloomy faced Han Xian, and spoke indifferently after hearing the loud clapping sound.</p><br/><p>“Yes.” Although blood was dripping in his heart, Han Xian could only shatter his teeth and swallow them since the stakes of the bet had been already released. He replied in a soft voice before flicking his sleeves and walking out of the arena. As he passed by Xiao Yan, he coldly said, “This matter is not over!”</p><br/><p>Xiao Yan turned his head over and watched Han Xian walk out of the arena. He led the ‘Medicine Gang’ to angrily leave the stadium. His gaze also slowly became cold.</p><br/><p>“Ke ke, Xiao Yan you can rest assured that since you both invited me to become the judge, I will guarantee that he will completely adhere to your betting agreement.” Elder Hao patted Xiao Yan’s shoulders and spoke with a smile.</p><br/><p>“Thank you very much Elder.”</p><br/><p>Elder Hao smiled. He played with the dark red-colored ‘Dragon Strength Pill’ in his hand, hesitated a little before handing it to Xiao Yan. He said, “This is also your victory prize. You should keep it.”</p><br/><p>Although Elder Hao merely hesitated for a moment, it did not escape Xiao Yan’s eyes. Xiao Yan immediately smiled and said, “Elder Hao, the medicinal formula of this ‘Dragon Strength Pill’ is much more expensive than this one ‘Dragon Strength Pill.’ As an exchange, this pill is yours Elder Hao.”</p><br/><p>Elder Hao’s heart was moved for a moment when he heard Xiao Yan’s words. However, he mused for a moment before shaking his head. He stuffed it into Xiao Yan’s hand and said with a bitter smile, “Forget it. The eyes of those old fellows also became fiery hot due to this ‘Dragon Strength Pill.’ If I were to keep this, I would likely be mocked by them. If you have the heart, you can give the old me one of such pills if you have excess pills from your refinement. I will remember it.”</p><br/><p>Xiao Yan hesitated when he heard this. He could only take back the ‘Dragon Strength Pill’ and stuff it into his storage ring. He smiled and said, “As long as I manage to find sufficient medicinal ingredients and refine it, I will give it to Elder at the first opportunity.”</p><br/><p>“Ke ke, it is fine as long as you have the intention… as for medicinal ingredients, ke ke… the Inner Academy has stored an unknown amount during these years. That medicinal ingredient warehouse is also coincidentally managed by me. Ke. If you have any need in the future, you can come and look around.” Elder Hao smiled. There was a couple of twists in his words. After he spoke, he patted Xiao Yan shoulders. The meaning of which was something that only the both of them understood.</p><br/><p>Xiao Yan was initially startled when he heard Elder Hao’s words before a joy immediately rushed from his eyes. He nodded his head at the former without leaving any traces. With the strength of the Inner Academy, it was likely they had stored quite a few rare and unique medicinal ingredients. These things had quite a great amount of attraction for Xiao Yan.</p><br/><p>“Oh, that’s right…” After handing the medicinal pill to Xiao Yan, Elder Hao appeared to have recalled something. He frowned and said, “Since ‘Pan’s Gate’ that you manage is already officially selling medicinal pills, according to the rules, you must pay twenty-percent of the total ‘Fire Energy’ that you have obtained by selling such medicinal pills in bulk within the Inner Academy. In other words, if you have obtained one thousand days of ‘Fire Energy’ that month, you need to pay two hundred days worth.”</p><br/><p>Xiao Yan’s face was immediately stunned when he heard this. What was this considered as? Paying taxes? Moreover, the tax was actually this expensive? A twenty-percent tax?</p><br/><p>“Don’t stare at me like that. This is a rule of the Inner Academy.” Seeing Xiao Yan’s stare, Elder Hao could not help but shake his head, saying: “You know that selling pills is something that is immensely profitable. Thus, the Inner Academy must have some restrictions. If we didn’t have such rules, all of the Fire Energy would be in the hands of factions that sell pills. In these past years, the Medicine Gang also had such a tax rate.”</p><br/><p>Xiao Yan laughed bitterly before saying softly, “Isn’t this tax a little too vicious? Elder you should know that the current price of the medicinal ingredients is also expensive. Moreover, it is not as though one would succeed every time one refines a medicinal pill.”</p><br/><p>“I also know this but the rule is like this…” Elder Hao parted his hand. When he saw Xiao Yan’s tightly knit eyebrows, he hesitated for a moment before saying, “Ah, why don’t we do this. In the future, your ‘Pan’s Gate’ need only pay up ten percent. However, do not publicize this matter. Otherwise, that Han Xian would definitely be unhappy if the ‘Medicine Gang’ were to know about this.”</p><br/><p>“Elder can randomly adjust the tax rate?” Xiao Yan spoke with some surprise when he heard Elder Hao reduce the tax with just his words.</p><br/><p>“Ke ke. Coincidentally, I am in charge of all the matters relating to the medicinal ingredients and medicinal pills within the Inner Academy.” Elder Hao smiled. However, in his heart he said, “Moreover, the First Elder has said to take special care of you. I am not going against the rules by doing this…”</p><br/><p>“In that case, thank you very much, Elder. In the future, I will definitely hand the ‘Dragon Strength Pill’ that I have refined to Elder first.” Xiao Yan quietly sigh in relief in his heart. A decrease of fifty-percent was not a small sum. Xiao Yan immediately hurriedly gave his thanks.</p><br/><p>Elder Hao smiled and nodded. He said, “Alright, I’m afraid that you have already reached your limit today due to the refinement of the pill. You should go back and rest first. Tomorrow, send some people to take over the trading area from the ‘Medicine Gang.’ Those are really good places…” Once he said this, Elder Hao took the lead to turn around and walk out of the stadium.</p><br/><p>Xiao Yan nodded slightly. He also descended from the arena and waved his hand toward Xun Er’s group. After which, that large group happily swarmed out of the stadium under the focus of numerous fiery gazes.</p><br/>\n</div>"}