{"title": "Chapter 501: Half Finished Product", "id": 501, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-501-half-finished-product", "volume_title": "Volume 6", "body": "<h1>Chapter 501: Half Finished Product</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 501: Half Finished Product</u></strong></p><br/><p>Han Xian’s expression clearly became much uglier when he heard the laughter that sounded in the stadium. A snort that suppressed his anger was emitted from his throat. His eyes stared at the golden-colored flame still rising in the medicinal cauldron. Once again, his palm swiftly grabbed the medicinal ingredients on the stone table and threw them into the medicinal cauldron.</p><br/><p>This time around, Han Xian clearly paid much more attention compared to earlier. However, his mind had similarly formed some ripples because of his first failure.</p><br/><p>Xiao Yan on the other side had completely shut his eyes at this moment. He did not make even the slightest movement from Han Xian’s action. When they saw his strange manner, the crowd in the stadium involuntarily became a little astonished.</p><br/><p>In the arena, the medicinal ingredients on the stone table were thrown into the medicinal cauldron one at a time by Han Xian. This time around, he clearly managed to progress further than before. Under his attentive focus, he had refined over twenty medicinal ingredients within a short five minutes. Seeing that his condition this time around was this good, those members of the ‘Medicine Gang’ which had come to cheer for him could not help but applaud and cheer.</p><br/><p>“This Han Xian is indeed worthy of being a tier four alchemist. He does indeed has some foundation… what exactly is that fellow Xiao Yan dong?” Hu Jia involuntarily frowned and asked softly as she eyed Han Xian who had gradually exceeded the number of medicinal ingredients that Xiao Yan had refined in his first attempt. Her voice held a little worry.</p><br/><p>Xun Er nodded. Her pupils rested on the closed-eyed Xiao Yan as she softly said, “There is no need to be anxious. There is still a lot of time. Moreover, Xiao Yan ge-ge still has two attempts.” Although she spoke in this manner, her heart was a little anxious. Xun Er did not have very deep knowledge about the world of Alchemists. Therefore, she could not maintain her usual strong confidence toward Xiao Yan.</p><br/><p>Under Han Xian’s increasingly fast refining speed, some of the initial laughter in the stadium was completely annihilated. However, compared with these students, some of the sharp eyed Elders mused for a moment before shaking their heads slightly.</p><br/><p>“Refining pills does not stress on speed. Instead, it requires a heart that is not disturbed by other things. Han Xian’s heart has already developed some fluctuations from his earlier failure. Although his progress is very good now, but… perhaps it cannot be maintained for long.” In the arena, Elder Hao placed his hands behind his back. He eyed the extremely busy Han Xian and furrowed his brows a little while sighing softly in his heart.</p><br/><p>“Xiao Yan is performing extremely well on this point. Han Xian, however, has fallen into a disadvantage. Xiao Yan is indeed worthy of being a person that the First Elder has requested to take care of by name. He already possesses such a strong mental strength at such an age. His potential is indeed extraordinary.” Elder Hao gaze turned toward the closed-eyed Xiao Yan. From the latter’s increasingly calm breath, he could sense that the earlier failure had not shaken his mind by even a little.</p><br/><p>“Puff…”</p><br/><p>A low and deep sound suddenly sounded on the arena. Upon hearing this sound, the hearts of everyone suddenly sunk. Their gazes followed the sound and looked over only to see the pale-faced Han Xian with a trembling body. Immediately, they let out a sigh. It was really unexpected that a mistake would actually appear during his refinement, which appeared extremely smooth.</p><br/><p>“Why… why did I fail again?” Han Xian expression was pale-white. His eyes stared intently at the medicinal cauldron as his mouth repeatedly muttered. Earlier, he had successfully refined all of the medicinal ingredients that he needed and was waiting to carefully merge them. However, at this juncture, his mood fluctuated quietly. The suppressed flame erupted with a wave of high temperature, completely incinerating the medicinal essence which he had refined with much difficulty into dark black soot. How could this not cause Han Xian to receive a blow?</p><br/><p>Han Xian repeatedly muttered in his mouth. Having failed twice consecutively in public had caused Han Xian’s pale-white face to gradually form an angry green.</p><br/><p>“Hu…” Just as Han Xian was buried in failure, Xiao Yan to his side suddenly let out a long breath. The former turned his head and took a look. Xiao Yan, who had shut his eyes for over ten minutes had actually opened them at this moment. Moreover, he even stretched his lazy waist; the manner was as though he had just woken up.</p><br/><p>Xiao Yan smiled at Han Xian when he saw the latter looking over. After which, he ignored Han Xian’s ugly expression. He waved his hand, and a cluster of green-colored flame poured into the medicinal cauldron. After which, his left hand would occasionally pick up a medicinal ingredient and throw it into the medicinal cauldron. Looking at this calm manner, it was totally different from his earlier manner of appearing like he was facing an enemy. Moreover, the medicinal pill that he was refining in his hand did not seem to feel like a tier five medicinal pill but merely some low tiered medicinal pill.</p><br/><p>Seeing Xiao Yan waking up from his closed-eye state, Xun Er’s group sighed in relief . They eyed the smiling face of Xiao Yan and although they did not know what exactly happened, they felt that the current Xiao Yan appeared very different from earlier. While they felt this, they were unable to voice just what kind of change had occurred with words. It was rather mysterious.</p><br/><p>Elder Hao in the arena could not help but let out a somewhat surprised ‘huh’ sound when he saw this disposition of Xiao Yan. Immediately, his gaze was mingled with the spot where those few old fellows were hiding. All of them managed to sense the shock from the others’ eyes. There was no need to mention whether Xiao Yan would be able to successfully refine the pill. Just this state of mind which was like an old well without ripples was sufficient to provide him with quite a great reward.</p><br/><p>As Han Xian watched Xiao Yan beginning to refine once again, he once again took a glance at the one set of remaining medicinal ingredients on the stone table. His extended hand suddenly paused for a moment before he immediately withdrew it. He could not continue to carelessly waste this final chance.</p><br/><p>Han Xian stopped his actions and once again turned his gaze toward Xiao Yan. He let out a cold malicious laugh in his heart, “A pretentious fellow. Believe me. You will definitely fail…”</p><br/><p>Perhaps Han Xian’s curse had a certain effect. Just as Xiao Yan threw in the last few medicinal ingredients into the medicinal cauldron, the cluster of red-colored liquid that was merged from dozens of medicinal ingredients essence suddenly began to fluctuate intensely. Immediately, it erupted with an extremely powerful force. With a ‘bang’, it shot the cover of the medicinal cauldron into the sky. With the rise of the cauldron’s cover, the medicinal liquid inside also spilled out before finally being scattered on the ground.</p><br/><p>“Ugh…”</p><br/><p>Everyone in the stadium eyed the movement on Xiao Yan’s side. All of them involuntarily widened their mouths and once again emitted a regretful sigh.</p><br/><p>“Hee hee…” Han Xian finally sighed in relief upon seeing Xiao Yan’s failure. He turned his gaze toward the final set of medicinal ingredients on the stone table. He spoke in his heart, “Looks like the both of us won’t be able to refine the ‘Dragon Strength Pill.’ I also do not intend to succeed. As long as the failed product that I refine is better than Xiao Yan’s, that will do…”</p><br/><p>As this thought flashed across his heart, Han Xian once again raised his flame. After which, he began his final attempt at refinement.</p><br/><p>However, with this kind of metal state during the refinement of the pill, where he had already adopted the thought of refining a failed product, how would he be able to refine a true medicinal pill?</p><br/><p>Xiao Yan was unconcerned about the regretful sigh from the stadium. He extended out his hand and a suction force swarmed out, sucking back the medicinal cauldron’s cover that had fallen on the ground back. After which, he gently covered it over the medicinal cauldron. The reflected green-colored flame in his dark black eyes was dancing slightly.</p><br/><p>“So it is like this…”</p><br/><p>Xiao Yan’s gaze stared at the rising green-colored flame before he suddenly laughed softly. After two failures, he had faintly grasped where some of the profoundness of this ‘Dragon Strength Pill’ lay. Therefore, this time around, he did not rest the slightest or have any hesitation. His right hand controlled the flame in the medicinal cauldron as his left hand slowly moved on the stone table. Suddenly, his hand paused. Soon after, his arm turned into numerous afterimages. Following the appearance of these afterimages, the medicinal ingredients began to be thrown into the medicinal cauldron in an unceasing matter where the end of a medicinal ingredient was in contact with the other. This speed was even faster than his first attempt at refining.</p><br/><p>Upon seeing this terrifying refining speed, everyone in the stadium was stunned. Xiao Yan had failed even after carefully refining earlier. Now, he still dared to be this fast? Does this fellow intend to break the pot and give up?</p><br/><p>Xun Er’s group was similarly a little stunned by Xiao Yan’s actions. They exchanged glances with one another and could only maintain silence. They did not dare say anything to interrupt.</p><br/><p>Under the focus of everyone’s gaze, the two people in the arena, who had poured all their attention into the refining, had begun the final refinement. Moreover, the medicinal ingredients on the table were gradually becoming less…</p><br/><p>Time quietly flowed by from between one’s fingers. The short ten plus minutes were extremely long in everyone’s eyes. A green and a gold flame were rising independently in the arena...</p><br/><p>Xun Er’s group focused intently on Xiao Yan. Their tightly clenched palms were filled with perspiration without them realizing it. However, just when their gazes did not turn, a faint medicinal fragrance was suddenly emitted from the arena. Everyone was immediately startled. Soon after, their expressions changed slightly. Their gazes followed the direction from which the medicinal fragrance came from, and turned toward the interior of Han Xian’s medicinal cauldron.</p><br/><p>The medicinal fragrance similar attracted all the other gazes in the stadium. In a moment, numerous surprised gazes were gathered on Han Xian’s body. He appeared to be about to successfully refine it?</p><br/><p>Elder Hao narrowed his eyes. A moment later, he helplessly shook his head. This fellow had actually automatically given up the chance of successfully refining the medicinal pill. Instead, he had in turn aimed to refine a kind of failed product. Elder Hao understood what Han Xian was thinking. It was likely that the later thought that Xiao Yan would also not be able to successfully refine the ‘Dragon Strength Pill.’ Therefore, since everyone was unable to successfully refine a medicinal pill, they would compete on whose failed product was better… this kind of thinking… really left one speechless.</p><br/><p>“Bang!”</p><br/><p>Another two to three minutes passed. Han Xian waved his hand abruptly and the cover of the medicinal pill automatically fell. A mottled-colored medicinal pill with a somewhat rounded shape flew out from the medicinal cauldron, and was immediately snatched by his hand.</p><br/><p>Han Xian lowered his head to eye the medicinal pill in his hand which had a mottled color and an abnormal shape. Regardless of how thick Han Xian’s face was, some red flush also involuntarily appeared on it. However, the moment he thought it was better for him to have a half-finished product compared to a completely failed product, he felt a little better. He swiftly walked away from the stone table and handed the medicinal pill in his hand to Elder Hao.</p><br/><p>Elder Hao felt neither able to laugh nor cry when he received the medicinal pill from Han Xian’s hand. Could this thing even be called a medicinal pill?</p><br/><p>“Ah…” Elder Hao sighed and carelessly held the medicinal pill. However, he ignored Han Xian and threw his gaze toward Xiao Yan whose entire attention was focused on his medicinal cauldron. A long while later, he suddenly glanced at Han Xian by the side and faintly said, “I’m afraid that Xiao Yan’s chances of winning are larger than yours this time around.”</p><br/><p>Han Xian’s expression was a little ugly when he heard this. His gaze stared intently at Xiao Yan before he coldly said, “That may not be the case…”</p><br/>\n</div>"}