{"title": "Chapter 513: Invitation", "id": 513, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-513-invitation", "volume_title": "Volume 6", "body": "<h1>Chapter 513: Invitation</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 513: Invitation</u></strong></p><br/><p>Xiao Yan smiled and spoke as he eyed the shock covered cold, alluring face, “Are you injured?”</p><br/><p>“No.” Han Yue shook her head. Her gaze was odd as she looked at Xiao Yan in front of her. The moving flush on her face was quietly reduced as she said a soft thanks. Immediately, she sighed, “It has only been two to three months since I last saw you but you have become much stronger than before. It is likely that there is hardly anyone within the Inner Academy who can surpass your speed.”</p><br/><p>The speed of the ‘Snow Demon Sky Ape’ after its mutation was something that even someone of Lin Xiuya’s strength could not dodge. Yet, Xiao Yan in front of her was able to rescue her in that split second. This speed was likely something that not one of them present could compare with. This was basically a kind of complete transformational change compared to a couple of months earlier. It was little wonder that Han Yue would lament.</p><br/><p>Xiao Yan smiled once again, but did not say anything. He turned his head and his gaze moved toward the red figure which had flashed back to the ground and appeared on an enormous rock. A solemness immediately flashed across his eyes. At this moment, the snow white fur all over ‘Snow Demon Sky Ape’ had completely turned into a kind of blood-red color. The killing intent and violence in those large scarlet eyes had become denser. Waves of seemingly substance-like fog repeatedly seeped out from within its body. Once this blood-colored fog contaminated the tree leaves, it would erode the latter until nothing was left. From the appearance of this aura, its strength had nearly soared to more than double what it was earlier.</p><br/><p>“Senior Han Yue, this large being appears to be becoming increasingly harder to stop. I think that it is best that we withdraw as soon as possible. Otherwise, I’m afraid…” Xiao Yan knit his brows slightly as he reminded. Yao Lao had mentioned before that after awakening its Wild Violent bloodline, the ‘Snow Demon Sky Ape’ would be able to contend with a strong five star Dou Wang for a short period of time. Now that Lin Xiuya had been knocked away and injured, the group would undoubtedly be unable to pose any threat to the ape with their strength. Moreover, if they were careless, it was likely that they would face with quite a great amount of injuries and deaths.</p><br/><p>“Yes.” Han Yue smiled bitterly and nodded. The sudden mutation of this ‘Snow Demon Sky Ape’ was beyond her expectations. The strength of their group was insufficient to defeat it. After having witnessed the latter’s frightening strength, she did not hold much hope of being able to obtain the ‘Core Quenching Body Milk.’</p><br/><p>Not far away, Yan Hao hurriedly waved his hand when he saw the ‘Snow Demon Sky Ape’ appear to descend into an adjusting condition after having unleashed a ferocious attack. One person flashed into the forest to search for the wounded Lin Xiuya. The remaining people carefully rushed to the tree top where Han Yue and Xiao Yan stood. Immediately, they used odd gazes to weigh Xiao Yan. The speed that he had displayed earlier was sufficient to cause these people, who belonged in the top experts in the Inner Academy, to withdraw their underestimation.</p><br/><p>“Ke ke, this friend. Are you also a student of the Inner Academy? Why have I not seen you in the past?” Yan Hao could not help but feel some doubt after observing Xiao Yan. With the latter’s speed, he ought to at least be an expert on the ‘Strong Ranking.’ Why was it that this person had an unfamiliar face.</p><br/><p>“Senior Yan Hao, he is called Xiao Yan. He is a new student who entered the Inner Academy only a couple of months ago.” Han Yue smiled and introduced him.</p><br/><p>“New student?” Yan Hao immediately exclaimed when he heard this. His gaze was a little strange. A new student who had entered the Inner Academy less than half a year ago actually possessed this kind of strength? Was it the case that the strength of the current Outer Academy had already reached this stage?</p><br/><p>A couple of gazes swept over Xiao Yan’s body. A moment later, their doubt became increasingly dense. From the looks of the degree of density of his Qi, the latter’s strength was obviously around that of a Da Dou Shi. However, why was it that the speed that he had unleashed earlier was something that even they could not catch up to?</p><br/><p>Xiao Yan merely smiled when faced with the doubtful gazes of Yan Hao and the others. He did not explain anything. All he did was cup his hands at the few of them and greet them extremely politely. No matter how one put it, these few people in front of him were all experts at the top of the Inner Academy. Their strength far exceeded someone like Bai Cheng. He would naturally not reject such an opportunity to establish a good relationship with them.</p><br/><p>“Xiao Yan? I seem to have heard this name. Some time earlier, was it not said that the new students defeated the older student groups during the ‘Fire Energy Hunting Competition?’ It seems like the leader of that new student group is called Xiao Yan, right? I think that this person should be the same person.” A yellow-clothed man with a dark complexion but exceptionally bright eyes mused for a moment before he suddenly spoke.</p><br/><p>Yan Hao and the others were startled when they heard these words. Immediately, they appeared to have recalled that news. Yan Hao smiled and said, “So that Xiao Yan is actually you. This name is extremely well known. Back then, when we entered the Inner Academy, that Lin Xiuya and I were still eventually defeated by the hands of the ‘White Demon Group.’ It is really unexpected that the wave behind pushes the one ahead. This batch of new students is even fiercer. You actually directly finished off both the ‘Black White Evil Stopper.’ You do indeed have some ability.”</p><br/><p>Xiao Yan involuntarily laughed bitterly when he saw the strange gazes of those few people. He said, “I was only lucky. Back then, Senior Yan Hao and Lin Xiuya fought the ‘Black White Evil Stopper’ by yourselves. On the other hand, I relied on the entire new student group. How can we compare these situations?” Xiao Yan had also heard a little about some of the things back then. This Yan Hao and Lin Xiuya were people with haughty bones. The other new students of that batch had difficulty entering their discerning eyes. Therefore, the two of them formed a group by themselves before going on a rampage. It was only near the end that they were narrowly defeated by the hands of the ‘White Demon Group.’ This was an huge anecdote back then.</p><br/><p>“Who cares what tactics were used. It is good to be able to win. Back then, we were a little too arrogant. Otherwise, the first group to break the curse of the ‘Fire Energy Hunting Competition’ would not have to wait until this year to appear.” Yan Hao curled his lips and laughed.</p><br/><p>During the period of time that Xiao Yan and the others were conversing, two human figures suddenly rushed out from within the forest. In a few flashes, they appeared beside everyone. They were actually Lin Xiuya, who had been beaten and sent flying into the forest as well as the person who had went to search for him earlier.</p><br/><p>“This person is?” Lin Xiuya’s face was pale-white at this moment. There was also a faint trace of blood at the corner of his mouth. The green clothes on his body were also tattered. Although his appearance was dire looking, his disposition was not weakened by much. He first smiled bitterly at everyone before involuntarily asking with some surprise when he saw Xiao Yan’s unfamiliar face.</p><br/><p>“Are you alright?” Yan Hao inquired first before giving Lin Xiuya a brief summary of Xiao Yan’s background.</p><br/><p>“It is actually brother Xiao Yan. Ke ke, this name is not something unfamiliar.” Lin Xiuya also felt shocked after hearing Yan Hao’s words. He had personally experienced just how terrifying the speed of the ‘Snow Demon Sky Ape’ was. It was unexpected that this new student who had entered the Inner Academy less than half a year ago was actually able to rescue someone from its grasp. With this ability, he did have the qualification to converse with them on the same level.</p><br/><p>“Ke ke, Senior Lin, I was coincidentally training within the mountains. Earlier I heard the commotion around here and rushed over, only to see that you were fighting with that large beast. Then I saw that Senior Han Yue was in danger, and could not just hide in the corner. Thus, I could only act. Please pardon me if I have disturbed you…” Xiao Yan glanced at the ‘Snow Demon Sky Ape’ which did not attack because of the large number of people present before he spoke with a smile to Lin Xiuya.</p><br/><p>“What is there to pardon? Since brother Xiao Yan saved Han Yue’s life, there is no need to hide anything from you. We are laying siege against this ‘Snow Demon Sky Ape’ here because it is protecting a kind of mysterious item. It is said that those who witness it will have a share. If we are truly able to get our hands on it, there will definitely be a share for brother Xiao Yan.” Lin Xiuya gave a careless smile. His random words, however, had the intention of pulling Xiao Yan into this group. This action clearly showed that he thought that Xiao Yan’s strength gave him the qualification to share this reward with them. However, he did not talk about the details of the ‘Core Quenching Body Milk.’ This thing was too precious and he had just met Xiao Yan for the first time. Naturally, he would not easily tell Xiao Yan about this secret item.</p><br/><p>Yan Hao and the others were stunned when they heard Lin Xiuya take the initiative to request Xiao Yan to join them. They exchanged glances with one another and were immediately silent. They may not really pay attention to Xiao Yan’s actual strength, but the abnormal speed which he had displayed was something that they could not underestimate. Moreover, this ‘Core Quenching Body Milk’ was something that Han Yue had discovered first. Now that Xiao Yan had saved her life, it was likely that she would not oppose this suggestion by Lin Xiuya. Therefore, after some thoughts revolved around their hearts, they did not voice any opposition.</p><br/><p>Xiao Yan was also startled by Lin Xiuya’s frankness. Other people earnestly wished to possess such a treasure by themselves. This fellow was actually able to suppress the hammer and made the most sober and wise suggestion. This mentality was quite deep. However, he could not reveal some of his things in front of other people. Therefore, he could only reject this invitation.</p><br/><p>Hence, Xiao Yan shook his head under the attention of everyone. He smiled bitterly and said, “Senior Lin, thank you for your good intentions. However, it is likely that Xiao Yan does not have the blessing to enjoy it. This ‘Snow Demon Sky Ape’ is not some lowly beast. It is said that the body of this kind of unique beast has a certain Wild Violent bloodline flowing within it. Once it is awoken, its strength will soar for a short period of time. Looking at the change of the beast now, I’m afraid that it is due to it waking up that Wild Violent bloodline. At this moment, forget about an ordinary Dou Wang, even a strong person, whose strength had reached that of a five star Dou Wang, would likely have no means to deal with it. Although my words will be a blow to some people, but I don’t think that the few of us can defeat it.”</p><br/><p>“Wild Violent bloodline?” Lin Xiuyan and the others were startled when they heard this information. Their faces immediately changed. Although they knew about this kind of unique beast, their understanding of it was naturally not as deep as Yao Lao. Therefore, they had never heard of whatever this ‘Wild Violent Bloodline’ was. However, looking at the change in the ‘Snow Demon Sky Ape’ earlier, it did match what Xiao Yan had said. Therefore, the expressions of everyone became somewhat ugly. They were naturally aware that they would be unable to eat up a Magical Beast, which could contend with a strong five star Dou Wang, with their strength.</p><br/><p>“What should we do now? Don’t tell me that we should give up?” Yan Hao knit his brows and asked Lin Xiuya. The ‘Core Quenching Body Milk’ really did have too great of an attraction to him. It was too much of a pain to ask him to give it up.</p><br/><p>Lin Xiuya laughed bitterly and mused for a long while. Only then did he grit his teeth and say, “Forget it. Let’s trust Junior Xiao Yan once. Moreover, I am quite badly injured this time. It is likely that I will require at least half a month before I can recover. Therefore, we can only think of other methods for this siege.”</p><br/><p>Yan Hao and the others were a little unwilling when they heard that Lin Xiuya had the intention of temporarily retreating. However, when their eyes swept across the ‘Snow Demon Sky Ape’ emitting a frightening aura not far away, their hearts became chilled and they could only helplessly nod their heads.</p><br/><p>“Let’s withdraw. Let’s think of other ways once we have recuperated from our injuries…” Lin Xiuya sighed before immediately cupping his hands toward Xiao Yan. He said, “Brother Xiao Yan, are you going to return to the Inner Academy with us?”</p><br/><p>Xiao Yan mused for a while when he heard this. He shook his head and said, “I have come to the mountains to practice a Dou Technique. I have yet to master the Dou Technique, so I don't have any intentions in returning yet.</p><br/><p>“Ke ke, since that is the case, we will return first. There is something that I hope brother Xiao Yan can help with. Please do not mention the matter today to anyone…” Lin Xiuya looked deeply at Xiao Yan before he cupped his hands together and spoke.</p><br/><p>“I have the sense to know what to say and what not to say.” Xiao Yan smiled and replied.</p><br/><p>“In that case, thank you very much. If there is anything that brother Xiao Yan needs help with in the future, you can come and look for me. There are quite a number of people in the Inner Academy who give me, Lin Xiuya, face.” Lin Xiuya smiled as spoke. He did have have much doubt toward Xiao Yan. Although Xiao Yan’s speed was shocking, it was impossible for him to barge into the mountain valley that was protected by the ‘Snow Demon Sky Ape’ by just relying on his strength as a Da Dou Shi.</p><br/><p>“Let’s go.” Once he said that, he waved his hand. He took the lead to turn his body and swiftly rush toward the exit of the deep mountains. Behind him, the somewhat unwilling Yan Hao and the others could only follow.</p><br/><p>“Junior Xiao Yan, be a little more careful when you train deep in the mountains.” Han Yue smiled at Xiao Yan and gave him a concerned reminder. After which, she turned her body and rushed into the distance with her silver hair drifting in the air.</p><br/><p>Xiao Yan’s gaze eyed Lin Xiuya and the others who were gradually disappearing from his sight. A long while later, Xiao Yan let out a soft sigh. He laughed bitterly and softly said, “I’m really sorry. It is indeed for your own good that I urge all of you to leave. If you are to continue to pester it, it is likely that none of you can leave this place once the ‘Snow Demon Sky Ape’ completely erupts…” After Yao Lao’s reminder, Xiao Yan clearly knew just how frightening a ‘Snow Demon Sky Ape’ was after it had awoken its blood. Forget about Lin Xiuya and the few others at the peak of the Dou Ling class. Even five true elite Dou Wangs would likely not dare entangle themselves with the ‘Snow Demon Sky Ape’ at such a time.</p><br/><p>Xiao Yan turned his head around and threw his gaze at the ‘Snow Demon Sky Ape,’ whose irritated Qi had gradually reduced after Lin Xiuya’s group took leave. Xiao Yan quietly sighed in relief. His hand gently rubbed his arm under his sleeve. At that spot was a beautiful small snake that was slightly twisting around. With this little fellow around, he would be able to put up a fight with the ‘Snow Demon Sky Ape’ at that time.</p><br/><p>As this thought turned in his heart, the corner of Xiao Yan’s mouth was suddenly lifted. He stared intently at the ‘Snow Demon Sky Ape’ and muttered, “You beast. You can act crazy now. Once you enter your weak phase at night, I will come and take care of you… your ‘Core Quenching Body Milk’ is something that I definitely want.”</p><br/><p>Xiao Yan laughed softly. His body moved and lightning swiftly formed under his feet. After which, his body turned into a black shadow and swiftly shuttled into the vast forest under the sound of low muffled thunder. He immediately disappeared...</p><br/>\n</div>"}