{"title": "Chapter 533: The Mysterious White-Clothed Little Girl", "id": 533, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-533-the-mysterious-white-clothed-little-girl", "volume_title": "Volume 6", "body": "<h1>Chapter 533: The Mysterious White-Clothed Little Girl</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 533: The Mysterious White-Clothed Little Girl</u></strong></p><br/><p>Her voice was obviously a tender one and she had a cute appearance. However, the strange aura the white-clothed little girl emitted caused Xiao Yan’s mind to tense up.</p><br/><p>He exchanged glances with her large dark-black eyes. A moment later, he laughed dryly, “Little girl, this thing tastes awful. Why don’t you give it to me.”</p><br/><p>“I need to eat them if I want to grow up!” The little girl said calmly.</p><br/><p>“It needs time for you to grow. By doing this, you are simply pulling the shoot to help it grow and does not have any benefits.” Xiao Yan’s face was calm, but his heart had become noisy. This strange little girl had already eaten one rare medicinal ingredient, and he was the only one who had just entered this medicinal ingredient management warehouse. It was likely that he would be in some trouble if Elder Hao was to look into the matter.</p><br/><p>“Time is useless to me!” The little girl’s face sunk a little when she heard Xiao Yan’s words. She used her tender tone to speak loudly.</p><br/><p>“Oh, heavens!” Xiao Yan weakly patted his forehead as he felt a wave of a headache. Just where had this monster-like little girl ran out from? Not only was her strength so great that it was frightening, but her words were also quite strange. If she was just an ordinary little girl, Xiao Yan would forcefully snatch the ‘Asparagus Ice Fire Fruit’ even if he had to bear the notoriety of being someone who bullied a child. However, when he had sensed the frightening strength of that little girl, he could only obediently keep this thoughts properly. He clearly knew that the strength of this little girl, who had caused him to be unable to move with just two fingers earlier, was likely to not end well if she were to go crazy.</p><br/><p>“Elder Hao will find trouble with you if you eat the medicinal ingredients here.” Xiao Yan laughed bitterly and said.</p><br/><p>“That old man? I am not afraid. He would not dare to do anything to me even if he knew!” The little girl snorted as she rolled her eyes cutely.</p><br/><p>Xiao Yan’s eyes twitched. His heart had started to move. This little girl was so arrogant and defiant. Could she be a granddaughter of one of the upper echelons of the Inner Academy? However, the position of Elders in the academy were similar. If their children did something wrong, none of them would dare to speak in this matter to the other Elders. Could it be that this white-clothed little girl was the granddaughter of the First Elder who had not shown himself or the granddaughter of the mysterious Headmaster?</p><br/><p>“My mood is good today, so I will not beat you up. You should hurry up and leave. Don’t bother me.” The little girl once again took another bite of the ‘Hard Gold Pu’. She spoke in a vague voice as she chewed her mouth. Once again, she swallowed a mouthful of the golden-yellow liquid. However, she knit her brows slightly and muttered, “It tastes really awful.”</p><br/><p>Xiao Yan could not help but be speechless when he heard her muttering from the side. If other alchemists were to see how she ruined such a rare medicinal ingredient, and even mutter that it taste awful, they would likely be so furious that smoke would rise from their nostrils no?</p><br/><p>Xiao Yan helplessly shook his head. He was just about to say something when his heart moved slightly. An extremely gentle smile surfaced on his face as he squatted down and said gently, “Little sister, these medicinal ingredients taste awful, no?”</p><br/><p>As his mouth uttered these words, Xiao Yan’s heart quietly scorned. These medicinal ingredients contained extremely pure medicinal strength. Their taste would naturally not be good if they were directly consumed.</p><br/><p>“Ah ha, it’s awful!” The white-clothed little girl immediately nodded her small head in agreement when she heard Xiao Yan’s words. Although she appeared to have an indifference that was unusual for a normal person, at this moment, it appeared that she was no different from an ordinary little girl.</p><br/><p>“If it taste awful, can you return this fruit to this older brother? I will treat you to something nice.” Xiao Yan smiled and made a suggestion. The smile on his face was just like that of a strange uncle deceiving a little girl.</p><br/><p>“No! It may taste awful, but will the things that you will treat me to contain a large amount of energy within them?” The little girl immediately became alert as she shook her head when she heard that Xiao Yan wanted her to hand over the ‘Asparagus Ice Fire Fruit’.</p><br/><p>Xiao Yan’s smile became dull. These medicinal ingredients were all born from the gathering of natural energy. How could an ordinary thing contain such a powerful energy? However, by listening to the meaning in her words, it appeared that she was eating these rare medicinal ingredients for the pure medicinal strength within them. What caused Xiao Yan to feel more flabbergasted was that the body of this little girl in front of him was able to withstand the assault of the energy from the medicinal ingredients that had yet to be refined. After all, they may possess pure medicinal strength, but that energy was even wilder compared to that of a medicinal pill. Xiao Yan had some doubts in his heart, but after he thought of the various unusual actions of the little girl, he quietly nodded. It was likely that this little girl was not an ordinary person.</p><br/><p>Xiao Yan rubbed his head while feeling distressed A moment later, he said in a probing manner, “Why don’t I help you slightly refine the medicinal ingredients that you want to eat and turn them into something that is tastier? This is better than eating the medicinal ingredients raw.”</p><br/><p>“Refine?” The little girl’s chewing mouth paused slightly. Her large dark-black eyes suddenly become a little brighter. “You are an alchemist?”</p><br/><p>Xiao Yan thought that this matter could work in his heart when he saw the expression of the little girl. He hurriedly nodded and said, “As long as you return this ‘Asparagus Ice Fire Fruit’ to me, I will help you refine the medicinal ingredients that you want to eat until they become tastier. What do you say?” Refining medicinal pills was an extremely troublesome task, but it would not consume too much effort if the task was merely refining a kind of medicinal ingredient until it turned into a Yaowan and quietly adding a little other ingredients that made it taste better.</p><br/><p>(TL: Danwan/Yaowan - pills that have no real medicinal effect to a human and can potentially be harmful if consumed)</p><br/><p>However, this kind of Yaowan that merely used one kind of medicinal ingredient to refine did not escape the wild and violent nature of its medicinal effect. Moreover, this kind of single medicinal effect did not have too much use. Therefore, there was seldom anyone who would waste a medicinal ingredient to refine it into a Yaowan that could not even be considered a medicinal pill.</p><br/><p>The little girl hesitated slightly when she heard this. She eyed the ‘Asparagus Ice Fire Fruit’ which appeared very tasty in her hands. After hesitating for a long while, she finally nodded unwillingly and gave it to Xiao Yan. She grimaced in pain as she said, “However, if the medicinal pill that you refine is not tasty, I will not only snatch it back, but will also eat you!”</p><br/><p>“Eat me? With that small mouth of yours?” Xiao Yan laughed in his heart. He swiftly received the ‘Asparagus Ice Fire Fruit’ before stuffing it into his storage ring, afraid that this little girl of unknown origin would regret her decision.</p><br/><p>“You have already taken the thing. Hurry up and help me refine.” The little girl handed over the ‘Hard Gold Pu’ in her hand which she had taken two bites from to Xiao Yan as she said crisply.</p><br/><p>“Hee hee, there is no need to hurry. Let us leave first, I have taken the ‘Asparagus Ice Fire Fruit’ and need to account to Elder Hao.” Xiao Yan said with a smile. After which, he took the lead to walk out of the medicinal warehouse. He wanted to bring this strange little girl to Elder Hao and tell him about the situation. Otherwise, if that old fellow were to blame this consumption of the ‘Hard Gold Pu’ on him, Xiao Yan would really suffer a great loss.</p><br/><p>“What is there to account to that old fellow.” The little girl murmured. She did not show the slightest sign of being worried as she grabbed the ‘Hard Gold Pu’ and followed Xiao Yan.</p><br/><p>Xiao Yan only sighed in relief when he heard the sound of footsteps behind him. He swiftly walked out of the medicinal warehouse and placed the white jade onto the wall. Only after he saw the energy barrier once again appear did his face immediately let out a smile as though he had placed down a heavy burden.</p><br/><p>“This broken defensive barrier does not have the slightest use. It is but a decoration when it is activated.” The little girl by his side smacked her lips. Her white, tender seemingly transparent hand pushed into the energy barrier. It shuttled past a couple of times and there seemed to be no resistance to her movement.</p><br/><p>Xiao Yan opened his mouth and eyed the actions of this little girl. A loss appeared in his eyes. Was the energy barrier really a decoration? As he had this thought in his mind, he extended his hand and jabbed at the energy barrier. However, when his hand came into contact with that round light barrier, it appeared to have touched metal. He jabbed with some strength and his finger felt a faint pain, but he did not even make the slightest entry into it. Clearly, this energy barrier had an extremely shocking defense… but… how could this little girl view it as though it was nothing?</p><br/><p>“Hee hee, stupid.” The little girl beside him eyed the actions of Xiao Yan, and immediately laughed out loud. Her clear, tender laughter reverberated unceasingly down the corridor.</p><br/><p>Xiao Yan withdrew his finger in an embarrassed manner. He was about to say something when the white-clothed little girl snorted. She turned her body in an unrestrained manner and strode toward the exit of the corridor, leaving only the back of her head to Xiao Yan.</p><br/><p>“This little girl… just what kind of a monster is she?” Xiao Yan was speechless as he eyed the back of the little girl. His heart could not help but feel a helplessness as he sighed.</p><br/><p>……</p><br/><p>Elder Hao still had his head buried in the desk in front of him within the quiet room as he looked over the document within. He did not raise his head as he smiles said after hearing the door being opened, “What? Xiao Yan, have you found the medicinal ingredient that you need?”</p><br/><p>After his words sounded, however, Elder Hao sensed that there was something wrong with the atmosphere. Only then did he lift his head and saw Xiao Yan’s face which was filled with helplessness. His gaze shifted down before a white-clothed little girl with long pale-purple hair appeared in his gaze.</p><br/><p>Elder Hao blinked his old eyes and eyed the white-clothed little girl. A moment later, he recovered and immediately leaped from his chair. He said furiously, “Why are you here again?” When his gaze saw the ‘Hard Gold Pu’ in the little girl’s hand where two bites had been taken, his furious eyes widened. “Are you treating this place of mine as a restaurant, coming here regularly to have a sumptuous meal? If you want medicinal ingredients, don’t you know to go into the deep mountains to search for them?”</p><br/><p>“It is so troublesome to look for them myself. There are ready-made ones here. Why can’t I eat them? Old man, you really speak a lot of nonsense. If you continue to grumble, be careful of me beating you up.” The little girl glanced at Elder Hao from the side of her eyes. She appeared to be protesting and had even widened her mouth to take a bite of the ‘Hard Gold Pu’.</p><br/><p>Elder Hao was angered by this little girl’s arrogance until he rolled his eyes. However, this Elder who was much respected by the students in this Inner Academy could only resent with grit teeth. Looking at his matter, it appeared that he was quite fearful of this little girl in front of him.</p><br/><p>“You should hurry up. You still need to refine something for me. If you continue to delay, I will gulp you down.” The little girl’s tender voice urged as her gaze turned toward Xiao Yan.</p><br/><p>Xiao Yan felt lost at the identity of the little girl when he saw the conversation between the two of them. He let out a bitter smile as he took a step forward and said, “Elder Hao, I have already taken the thing that I need. You can check it. Please give me two sets of medicinal ingredients for the ‘Dragon Strength Pill’. I will help you refine it.”</p><br/><p>Elder Hao’s expression quietly became a little better after hearing Xiao Yan’s words. He took out a large pile of medicinal ingredients and placed it on the table. In a soft voice, he said, “Why have you bumped into her? Are you alright?” Hearing the meaning behind his words, it appeared that this little girl was like an evil demon that ate people. Nevertheless, it was true that the latter frequently used the words ‘gulp you down’ to threaten people.</p><br/><p>“I don’t know either.” Xiao Yan shook his head while smiling bitterly. He stored the medicinal ingredients on the table properly and gave a short summary of the events earlier.</p><br/><p>“Uh… you are really quite unlucky. Ah, serve this great-grandaunt properly. Don’t let her go crazy. Otherwise, it will be very frightening.” Elder Hao patted Xiao Yan’s shoulders with some sympathy as he spoke.</p><br/><p>TL: The word great-grandaunt is used to describe a person who is very difficult to please/serve</p><br/><p>Xiao Yan’s entire body felt uneasy because of this manner of Elder Hao. He could not resist asking, “Just what kind of person is she?”</p><br/><p>“Person? Who said she is human?” Elder Hao rolled his eyes, twitched his mouth and replied.</p><br/><p>TL: The words for person / human are the same in chinese but the translation is different.</p><br/><p>“She… she is not a human?” Xiao Yan was slightly startled. His forehead was filled with cold sweat as his voice formed words.</p><br/>\n</div>"}