{"title": "Chapter 535: The Final Medicinal Ingredient", "id": 535, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-535-the-final-medicinal-ingredient", "volume_title": "Volume 6", "body": "<h1>Chapter 535: The Final Medicinal Ingredient</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 535: The Final Medicinal Ingredient</u></strong></p><br/><p>It was a long while before Xiao Yan, who was within a quiet secret room, finally recovered from the shocking news that Zi Yan had spat from her mouth. He rubbed his face with great strength and laughed bitterly. It was really unexpected that the first on the ‘Strong Ranking’, which was described by Lin Yan until it appeared that she was an immortal, was actually such a little girl. No, it should be said that it was a powerful Magical Beast with a human appearance.</p><br/><p>“This little girl is also quite cute. I wonder why Lin Yan is so afraid of her. However, with her strength, she is really able to sit in the top position. Looking from her frightening strength, it is likely that even an elite Dou Wang would not dare to fight her head on.” Xiao Yan muttered softly.</p><br/><p>“Although this little girl’s strength is so frightening that it is a little overboard, she appears to completely rely on her physical strength from the way she attacked earlier. She did not exert even the slightest energy.” Yao Lao’s voice suddenly sounded from within Xiao Yan’s heart in a slow manner.</p><br/><p>“Is Teacher able to see just what kind of Magical Beast Zi Yan is?” Xiao Yan inquired.</p><br/><p>“I cannot tell… she has consumed the ‘Body Transformation Grass’. Therefore, if she does not reveal her true form, an ordinary person would have difficulty identifying just what kind of Magical Beast she is.” Yao Lao mused for a moment before saying, “However, from this intelligence of hers and the frightening strength that she displayed, I think that her original form should be a kind of extremely rare unique beast from the ancient times. After all, it is definitely impossible for an ordinary Magical Beast to train until the Dou Wang class without at least a hundred years if it are not be blessed with extremely good opportunity. Yet, after examining this little girl’s aura, it did not appear like a Magical Beast that had trained for a hundred years. Hence, her original form should have quite an extraordinary origin.”</p><br/><p>“Oh…” Xiao Yan nodded slightly. Although Zi Yan’s actual strength was very powerful, it appeared that her mind was just like a twelve to thirteen year old little human girl. Of course, this was excluding the indifferent aura that she would occasionally reveal.</p><br/><p>Xiao Yan withdrew his curiosity for Zi Yan in his heart. He placed his entire focus back to the medicinal ingredients that had filled the area in front of him. Even he did not dare to say that he would succeed on the first try when refining this ‘Dragon Strength Pill’. Therefore, when he had opened his mouth he asked for two sets of medicinal ingredients.</p><br/><p>“Ah, refining this thing is really a toil on my mind. However, I can only go all out for that ‘Asparagus Ice Fire Fruit’...” Xiao Yan let out a bitter laughter. He once again summoned a wisp of green flame and threw it into the medicinal cauldron. A moment later, his mind gradually agglomerated as he used his entire focus to begin the refinement once again...</p><br/><p>The refinement of the ‘Dragon Strength Pill’ was nearly a hundred times more complicated and troublesome than refining the ‘Hard Gold Pu’ for Zi Yan earlier. It was fortunate that Xiao Yan’s strength had already advanced to the Dou Ling class. Regardless of whether it was in terms of the degree of force of the Dou Qi, or his control of the flame, he possessed an extremely obvious improvement. Hence, the training this time around was much more relaxing compared to when he competed with Han Xian. However, this was merely relatively speaking. From the looks of the dense perspiration that repeatedly seeped out from his forehead, he needed to put in all his effort in order to be able to refine this ‘Dragon Strength Pill’.</p><br/><p>The green flame passed through the medicinal cauldron and was imprinted on the wall within the quiet room. It danced around, making threatening gestures as though it was a vicious beast. As the flame rose, the medicinal ingredients that were placed in front of Xiao Yan were also swiftly being reduced.</p><br/><p>……</p><br/><p>Time passed swiftly during the refinement. After spending nearly eight hours, the troublesome refinement finally entered its end stage.</p><br/><p>“Coagulate!”</p><br/><p>The cry sounded from within the quiet room. Immediately, a dark-red glow shot out from within the medicinal cauldron. Finally, it was grabbed firmly in Xiao Yan’s palm. He observed it up and down before nodding with satisfaction as he placed the jade bottle into the storage ring.</p><br/><p>Although he had successfully refined a ‘Dragon Strength Pill’ during this refinement, he had also destroyed a set of medicinal ingredients. However, Xiao Yan did not feel much heartache just because of this. He clearly knew that being able to possess this success rate of fifty-percent was already quite a good result.</p><br/><p>Xiao Yan immediately collapsed with exhaustion after finishing all of this. He took out an ‘Energy Recovery Pill’ from his storage ring and stuffed it into his mouth. He ignored the fatigue that was emitted from all over his body as he hurriedly sat cross-legged and entered into his training mode. Training in this kind of situation where the Dou Qi in his body was completely exhausted reaped twice the benefits with half the effort. The matter of training was just like using drops of water to form a river. One cannot slacken even a little.</p><br/><p>The training this time around used up a total of over an hour. Only then did the feeling of an empty interior in Xiao Yan’s body disappear. He sensed the powerful Dou Qi flowing within his veins. He was slightly joyful to discover that the Dou Qi in his body had been enhanced by quite a bit. From the looks of it, the refinement of medicinal pills may cause him to be so tired that he was about to die, but this process was not completely without any benefit.</p><br/><p>Xiao Yan exhaled a long breath and stretched his lazy waist. As he heard the sound of his bones cracking against one another, a comfortable and delightful feeling of recovering from extreme fatigue spread out from deep within his heart, causing a smile to hang on the corner of his mouth.</p><br/><p>“Now that we have obtained the ‘Asparagus Ice Fire Fruit’, I only lack the final rank 6 water affinity Monster Core before it is possible to refine the ‘Ground Spirit Pill’.” Xiao Yan’s finger gently rubbed his storage ring. Immediately, that alluring fruit that had ice and fire in one entity appeared in his hand.</p><br/><p>“Rank 6… ah, that is equivalent to a Magical Beast that is as strong as an expert of the Dou Huang class. Where would I go and find it…” Xiao Yan rubbed his head and spoke softly.</p><br/><p>“Let’s think of a solution. I can faintly sense that the ‘Fallen Heart Flame’ in the ‘Blazing Sky Qi Refining Tower’ is becoming increasingly stronger recently. I’m afraid that the uprising that I have mentioned isn’t far away..” Yao Lao said slowly.</p><br/><p>“The moment of the uprising of the ‘Fallen Heart Flame’ will be our best opportunity to snatch it. We must not let it slip by. Otherwise, it is likely that the trouble we will encounter if we want to snatch it in the future would be at least ten times what it is. Hence, we must bring forward the refining of the ‘Ground Spirit Pill’ as soon as possible.”</p><br/><p>Xiao Yan smiled bitterly and nodded. He sighed, “I’ll do my best.”</p><br/><p>“Ke ke, you can relax. If it is really not possible, we can at the very most go into the deep mountains to search for a rank 6 Magical Beast. It is not possible that there isn’t a rank 6 Magical Beast hidden within such a vast mountain range.” Yao Lao comforted with a laugh.</p><br/><p>Xiao Yan smiled when he heard Yao Lao’s comforting words. However, he was not completely at ease. Perhaps there was indeed a rank 6 Magical Beast hidden within the mountain range. However, in what way was it easy to kill a Magical Beast of this rank? Moreover, even if he could kill it, it was certain that a large earthshaking battle would erupt. At that time, it was likely that Teacher would be exposed should it alarm the Elders of the Inner Academy. That would be a little troublesome…</p><br/><p>Xiao Yan sighed once again. Xiao Yan could only hide these worries. He stored the medicinal cauldron into his storage ring and patted himself. Finally, he stood up and slowly walked out of this quiet room.</p><br/><p>……</p><br/><p>Elder Hao watch as Xiao Yan came out of the room. He hurriedly stood up and asked uneasily, “How’s your refinement? Did you succeed?” Elder Hao understood a little about medicinal pill refinement. Therefore, he also understood just how high the failure rate of refining a tier five medicinal pill was.</p><br/><p>“Ke ke, I failed once, but fortunately, I did not disappoint Elder’s expectations.” Xiao Yan smiled and nodded. He stepped forward and took out a jade bottle that stored the ‘Dragon Strength Pill’ before gently placing it on the table.</p><br/><p>Elder Hao hurriedly grabbed the jade bottle on the table after seeing it. He carefully took out a round dark-red medicinal pill from within and said in a joyous manner, “You have really succeeded. Little fellow, you really do have some ability. No wonder you are even able to rein in the ‘Heavenly Flame’.”</p><br/><p>Xiao Yan smiled and replied with some modest words when he heard this.</p><br/><p>“Since you have refined a ‘Dragon Strength Pill’, that ‘Asparagus Ice Fire Fruit’ shall be yours. Ke ke, your eyes are really sharp. The rarity of this thing could be ranked among the top ten even within the entire medicinal warehouse.” Elder Hao stored the ‘Dragon Strength Pill’ properly, and waved his hand in a generous manner. He jokingly said, “If there is any other medicinal ingredients that you need in the future, you can just come and look for me. However, remember our transaction. Ha ha.”</p><br/><p>“Again? Refining one ‘Dragon Strength Pill’ has nearly caused me to collapse…” Xiao Yan smiled and thanked Elder Hao while he muttered in his heart. He cupped his hands and was about to bid Elder Hao goodbye when his heart stirred. He asked in a probing manner, “Elder Hao. I still urgently need something at this moment. May I inquire if Elder Hao can help me look for it. If it is possible, Xiao Yan will do his best to refine any medicinal pill that Elder asks for!”</p><br/><p>“Oh? What is the thing you need?” Elder Hao’s eyes brightened when he heard this as he asked with some interest.</p><br/><p>“A rank 6 water affinity Monster Core.” Xiao Yan stared intently at Elder Hao’s face. When he spoke these words, he clearly sensed the other party’s face twitch a little.</p><br/><p>“Rank 6… why do you need such a high ranked Monster Core? A rank 6 Magical Beast is equivalent to an elite Dou Huang… With my current strength, I don’t have the courage to look for their Monster Cores. Looks like there is no hope for this transaction.” Elder Hao smiled bitterly and shook his head. His back was emitting cold sweat. Was the appetite of this fellow not a little too great? He actually opened his mouth and directly asked for a rank 6 Monster Core. Did he really think that it was a stone that could be picked up by the road side?</p><br/><p>Xiao Yan could only sigh in disappointment when he heard the words of Elder Hao. He said with a bitter smile, “We shall forget about it since Elder does not have one.”</p><br/><p>Xiao Yan turned his body and left when he said this. However, after Elder Hao fondled his beard and thought for awhile, he suddenly opened his mouth and said, “It is true that I don’t possess a rank 6 water affinity Monster Core, but I may perhaps be able to refer you to an Elder. He coincidentally has a rank 6 water affinity Monster Core in his hands. One that he had luckily obtained back then.”</p><br/><p>Xiao Yan was startled when he heard this. A wild joy immediately swarmed onto his face. “Really? If Elder Hao is able to refer me to him, Xiao Yan will definitely not forget about Elder Hao’s benefits should I be able to obtain the rank 6 Monster Core.”</p><br/><p>“You should not get too excited now. That fellow has a stingy character. Back then, he had risked his life in order to rely on some luck to kill a rank 6 Magical Beast that was already seriously injured. Therefore, he has been holding onto the rank 6 Monster Core like a treasure. Occasionally, he will even boast about it in front of us. If you want to exchange for this rank 6 Monster Core from his hand, you need to take out something that he likes. Otherwise, you can be prepared to bleed profusely. Follow me.” Elder Hao waved his hand and immediately led the way out of the door.</p><br/><p>Xiao Yan hurriedly nodded. He swiftly followed Elder Hao. Being able to obtain news about a Rank 6 Monster Core at a juncture when he was pressed for time was undoubtedly good news to him. He must obtain that Rank 6 Monster Core no matter the price it took.</p><br/>\n</div>"}