{"title": "Chapter 538: Refining the Ground Spirit Pill", "id": 538, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-538-refining-the-ground-spirit-pill", "volume_title": "Volume 6", "body": "<h1>Chapter 538: Refining the Ground Spirit Pill</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 538: Refining the Ground Spirit Pill</u></strong></p><br/><p>Xiao Yan and Elder Hao exchanged glances with one another as they walked out of Elder Liu’s room. Both of them involuntarily laughed out loud.</p><br/><p>“Elder Hao, I really have to thank you very much this time around.” Xiao Yan walked a little closer and softly said, “There will definitely be a reward for you in the future.”</p><br/><p>“Ke ke, this is but a small matter. Our ears will be a little quieter now that that fellow has lost the thing he boasts about in front of us.” Elder Hao waved his hand. However, from the looks of his expression, Xiao Yan’s words still caused him to be quite happy. After all, he already had some intention of befriending Xiao Yan after witnessing the latter’s refinement skills. He was already quite happy at being able to get a tier five alchemist to owe him a favor that was neither large nor small.</p><br/><p>The two of them chatted and laughed as they walked out of this quiet area where the Elders resided. The two of them separated at a fork in the road. Elder Hao needed to return to guard the medicinal warehouse, and Xiao Yan needed to return to ‘Pan’s Gate’.</p><br/><p>Xiao Yan stood at the forked road and eyed Elder Hao’s back which had disappeared. He let out a long sigh, and the joy within his heart involuntarily surfaced on his face. Now that he had fully prepared all the things he needed, all that was left was the refinement. However, the ‘Ground Spirit Pill’ was a tier 6 medicinal pill. With his current strength, he could merely refine some common tier 5 medicinal pills. He need not even be bothered about thinking of a tier 6 medicinal pill. Therefore, it was likely that Yao Lao would need to act to refine the ‘Ground Spirit Pill’.</p><br/><p>“Now, we are pressed for time. There is no telling when the ‘Fallen Heart Flame’ will erupt. Therefore, it is best to refine this ‘Ground Spirit Pill’ as soon as possible.” Yao Lao’s voice also quietly sounded within Xiao Yan’s heart while the latter was in deep thought.</p><br/><p>Xiao Yan raised his head slightly. He eyed the deserted area around him and nodded his head without leaving a trace. His footsteps walked toward the area where ‘Pan’s Gate’ was located as he softly asked in his heart, “In that case, when does Teacher intend to act?”</p><br/><p>“It is for best that we do it during these next few days.” Yao Lao voiced his thoughts, “You should first rest for one to two days. After which, we will need to enter deep into the mountains once again. Some unusual phenomenon occurs in the sky when refining a tier 6 medicinal pill. Moreover, this ‘Ground Spirit Pill’ can be considered among the top even within the tier 6 medicinal pills. Hence, there might be quite a great movement. As such, we will definitely be exposed if we were to refine it within the Inner Academy.”</p><br/><p>Xiao Yan nodded his head, indicating that he understood. He quietly mused for a while within his heart before he gradually hastened his footsteps. A short while later, he appeared outside of ‘Pan’s Gate’. Perhaps it was because it was currently at night, but the people who were waiting at this place to challenge him had all disappeared. This caused Xiao Yan to save the trouble of secretly flying in again. He arranged his robes before openly walking in through the main entrance.</p><br/><p>……</p><br/><p>Xiao Yan spent the next two days training quietly within ‘Pan’s Gate’. He did not enter the ‘Blazing Sky Qi Refining Tower’. Moreover, no problems occurred within ‘Pan’s Gate’ during these two days. Currently, the sale of medicinal pills by ‘Pan’s Gate’ dominated seventy-percent of the market of the academy. An increasing number of older students had also wanted to enter after hearing the name of ‘Pan’s Gate’. Moreover, the number of alchemists in ‘Pan’s Gate’ increased from the original three to the current six after a stringent selection period. Therefore, the speed at which the medicinal pills were refined had also increased by quite a lot.</p><br/><p>Currently, the strength of ‘Pan’s Gate’ was already a faction that was sufficient enough to rival that of some of the top tier factions within the Inner Academy under the support of the powerful ‘Fire Energy’. Moreover, two strong people who had reached the strength of three star Dou Lings ended up joining ‘Pan’s Gate’ due to the attraction of the reward and punishment system that Xun Er and the others had set up. This was something that Xiao Yan had not expected.</p><br/><p>Hence, ‘Pan’s Gate’ currently possessed three elite Dou Lings if these two Dou Ling were included. This line-up caused it to have the qualification to truly become a top tier faction. Moreover, under the support of its powerful finances, someone who was able to become a member of ‘Pan’s Gate’ already possessed the capital to boast to people around them.</p><br/><p>The current ‘Pan’s Gate’ was as different as the clouds in the sky and the mud on the ground when compared to the ‘Pan’s Gate’ formed from new students half a year ago.</p><br/><p>By being able to transform a mediocre faction into a powerful one within half a year, Xiao Yan’s name also began to spread around the Inner Academy in an increasingly loud manner. Although he was merely ranked thirty-four on the ‘Strong Ranking’, his reputation was enough to catch up with those top experts in the top ten.</p><br/><p>Xiao Yan finally ended his training retreat on the third day. He had firmly stabilized his strength at the one star Dou Ling level today. Moreover, his Dou Qi had also advanced quite significantly due to him refining medicinal pills a couple of times. According to this speed, he would not need much time to enter into the peak of a one star Dou Ling.</p><br/><p>Xiao Yan walked downstairs after coming out of his room. He saw Hu Jia’s figure within the hall, and felt a much stronger Qi from her. Xiao Yan understood that she had actually benefited from her misfortune of being injured this time, allowing her to breakthrough to the level of a nine star Da Dou Shi. With her training talent, she might not need much time before she truly breakthrough to become a Dou Ling. At that time, ‘Pan’s Gate’ would have an additional Dou Ling. Oh no, it should be two more. He must not exclude that battle lunatic Wu Hao. With the way he crazily fought everyday in the Fighting Arena, Xiao Yan guessed that the latter might well enter the Dou Ling class earlier than Hu Jia.</p><br/><p>Xiao Yan walked into the hall and carelessly ate some breakfast. He briefly told Xun Er that he needed to once again enter the deep mountains this time around. The latter also felt somewhat stunned when she heard that Xiao Yan was going back after having only just returned for a couple of days. However, she found it hard to say anything to stop Xiao Yan when she saw his serious expression. All she did was merely nod her head obediently.</p><br/><p>“Go, be careful. I will take care of ‘Pan’s Gate’.” Xun Er said with a soft smile when she saw Xiao Yan standing up and preparing to leave after having eaten his breakfast.</p><br/><p>“Ai, you have all worked really hard. I will return after a couple of days this time around.” Xiao Yan smiled and nodded to Xun Er and Hu Jia. He pulled open the door and an eye-piercing sunlight caused him to narrow his eyes. Immediately, he let out a smile and proudly walked out.</p><br/><p>Xiao Yan ran to the exit of the Inner Academy after leaving ‘Pan’s Gate’. Only after leaving the Inner Academy did he search for a remote location. After which, he summoned his Purple Cloud Wings and swiftly rose into the air. His body transformed into a black shadow that swiftly flew into the deep mountains.</p><br/><p>……</p><br/><p>Xiao Yan flapped the Purple Cloud Wings and flew for nearly an hour. After he figured out that he had already entered the middle region of the mountain range, he gradually slowed down. He spent half an hour searching a precipitous mountain peak that was merely a few dozen feet wide before slowly descending.</p><br/><p>These few mountain peaks were nearly completely vertical. If one did not borrow the help of wings, it was impossible to climb to its peak without the support of powerful Dou Qi. Moreover, there were a couple of even taller mountain peaks standing around it. Coincidentally they covered this small mountain peak within enormous lush green trees.</p><br/><p>Yao Lao’s figure immediately drifted out when Xiao Yan landed on the top of this small mountain. The former eyed his surroundings before nodding with some satisfaction.</p><br/><p>“You should not be too far away while I am refining the ‘Ground Spirit Pill’. You need to carefully observe my refining methods. Although you are able to be extremely sought after no matter where you are given your current medicinal refinement skills, you still have an extremely large gap when compared with a true alchemist grandmaster.” Yao Lao spoke to Xiao Yan in a solemn manner.</p><br/><p>“Yes.” Xiao Yan hurriedly nodded when he heard this. Being able to observe an alchemist grandmaster refining a medicinal pill was something that one might encounter, but could not wish for. It had extremely great benefits for him.</p><br/><p>TL: something that one might encounter, but could not wish for - meaning that if one is lucky one will meet it. Otherwise, one will not get the chance regardless of how much they desire</p><br/><p>“Of course, you must keep a distance from the unnatural phenomenon when the pill is formed. Otherwise, it would be troublesome if you are accidentally injured.” Yao Lao sat cross-legged on the grass as he reminded.</p><br/><p>Xiao Yan nodded once again.</p><br/><p>“Take out the medicinal ingredients.” Yao Lao’s expression gradually became solemn as he exhaled a deep breath of air and instructed.</p><br/><p>Xiao Yan swiftly took out the few extremely rare medicinal ingredients from his storage ring when he heard Yao Lao’s instruction. He placed them orderly in front of him. In an instant, a rich medicinal fragrance covered this small mountain peak. When one inhaled a deep breath, it caused one to feel relaxed and happy.</p><br/><p>Yao Lao’s gaze slowly swept over the few medicinal ingredients. He nodded slightly before waving his hand toward Xiao Yan. The ancient dark-black ring on the latter’s hand immediately came off automatically. Finally, it floated in front of Yao Lao.</p><br/><p>The black-colored ring glowed and flickered. Immediately, a five-foot-tall, dark-black medicinal cauldron suddenly appeared.</p><br/><p>The entire body of the dark-black medicinal cauldron had strange flame lines painted all over it. At a glance, those flames appeared to have intelligence. They wiggled slightly appearing to be living creatures.</p><br/><p>The appearance of this medicinal cauldron caused Xiao Yan’s mouth to salivate more. Back then, he had seen Yao Lao summon it before. However, he was basically a novice back then. How would he be painstakingly aware of just how valuable this medicinal cauldron was within the alchemist world?</p><br/><p>“Black Demon… tsk tsk. When can I get my hands on one of these medicinal cauldrons which is on the ‘Heavenly Cauldron Ranking’?” Xiao Yan’s gaze was blurred as he eyed this dark-black medicinal cauldron with an extraordinary aura. His tone was filled with desire as he spoke. The medicinal cauldrons that he used in the past were totally piles of garbage when compared with this ‘Black Demon’.</p><br/><p>Yao Lao eyed those glowing eyes of Xiao Yan and shook his head, not knowing whether to laugh or cry. He said, “This kind of medicinal cauldron which is ranked within the ‘Heavenly Cauldron Rank’ possesses some spirituality. Moreover, I have also applied a spiritual imprint on this ‘Black Demon’. Currently, you are unable to use it. I will be able to remove the spiritual imprint once I possess a body that can host a spirit. You will be able to randomly use it at that time.”</p><br/><p>Xiao Yan let out silly laughter.</p><br/><p>“Alright. The refinement is about to begin. Little fellow, don’t be distracted.” Yao Lao laughed. His face gradually became serious. It was apparent how serious he was toward this refinement through his act of summoning the ‘Black Demon’ to refine the medicinal pill.</p><br/><p>A shriveled eagle claw like illusionary hand extended slightly. Immediately, a cluster of thick white flame appeared out of nowhere.</p><br/><p>The surrounding temperature declined greatly the moment the thick white flame appeared. Although the temperature had declined, the flame rose even more intensely. The two completely opposite perceptions caused it to appear extremely strange.</p><br/><p>Yao Lao waved his hand. The thick white flame instantly swarmed into the medicinal cauldron. In an instant, a raging intense flame rose from within the cauldron.</p><br/><p>At this moment, the refinement of the tier 6 ‘Ground Spirit Pill’ had officially begun!</p><br/>\n</div>"}