{"title": "Chapter 541: Pill Formed", "id": 541, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-541-pill-formed", "volume_title": "Volume 6", "body": "<h1>Chapter 541: Pill Formed</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 541: Pill Formed</u></strong></p><br/><p>In the azure sky above the vast mountains, a somewhat coarse energy glow shot into the clouds and did not disappear for a long while.</p><br/><p>Yao Lao slowly sat up from the ground. He glanced at the enormous light pillar and frowned slightly. With a beckon of his extended hand, the light pillar immediately trembled. Finally, a thread of blue-colored glow rushed down before being suspended above his hand.</p><br/><p>The blue-colored glow gradually diminished. Immediately, it revealed its actual body. It was actually an azure medicinal pill that was the size of a dragon’s eye. The surface of the medicinal pill was extremely round and sleek, much like the surface of a sea. The blue lines that faintly remained on it were like numerous waves, appearing extremely mysterious.</p><br/><p>Following this thread of blue-colored glow escaping from the light pillar, the enormous light pillar appeared to have lost the support of its energy. It shook slightly before it gradually became illusionary and eventually disappeared altogether.</p><br/><p>Xiao Yan only heaved a sigh of relief after eyeing the enormous light pillar completely disappear from the sky. If this activity were to continue, it was likely that the Elders in the Inner Academy would rush over after being alerted. Xiao Yan flapped his wings and slowly landed on the peak of the mountain. He curiously eyed the blue-colored medicinal pill above Yao Lao’s hand as he said, “This is the ‘Ground Spirit Pill’?”</p><br/><p>Yao Lao smiled and nodded. There appeared to be a little tiredness on his face. It appeared that refining a tier 6 medicinal pill as a spiritual body was still quite a burden to him.</p><br/><p>Xiao Yan’s eyes did not miss the tiredness of Yao Lao’s face. He said, “Teacher, you should return to the ring to rest now that the pill has already been refined.”</p><br/><p>“Alas, this spiritual body does indeed have difficulty unleashing all my strength. When did refining a tier 6 medicinal pill require so much time in the past? Now, not only does the process take a long time, but it is also extremely exhausting on my energy.” Yao Lao shook his head and sighed.</p><br/><p>“Teacher, you can rest assured. Once I obtain the ‘Fallen Heart Flame’, I will begin to try and refine a body that can accommodate your spirit. At that time, you can once again be revived should I succeed in my refinement.” Xiao Yan comforted with a smile.</p><br/><p>“I am not really anxious about the matter of my revival, having already waited for so many years.” Yao Lao smiled. However, one could see the smile on his face when he spoke these words. It revealed he still felt a little pleased from the words Xiao Yan spoke.</p><br/><p>Xiao Yan laughed. He extended his hand and grabbed toward the medicinal pill that was suspended above Yao Lao’s palm. His hand had just grabbed it when that ‘Ground Spirit Pill’ transformed into a blue glow and shot away. Finally, it lingered beside Yao Lao, appearing to have a spirit of its own.</p><br/><p>Xiao Yan was startled as he eyed the ‘Ground Spirit Pill’ that actually dodged his palm. He said in a stunned voice, “Don’t tell me that all tier 6 medicinal pills possess some level of intelligence? It actually even knows how to dodge?”</p><br/><p>“Not all of them. A medicinal pill of this tier does indeed possess some intelligence. However, it is merely the kind that gives it an extremely vague sense. An ordinary tier 6 medicinal pill would usually not possess such intelligence. However, this ‘Ground Spirit Pill’ could be considered among the top within the tier 6 medicinal pills. This is especially after being catalyzed with my ‘Bone Chilling Flame’. It naturally has a richer intelligence when compared to the other medicinal pills of the same tier.” Yao Lao smiled and explained. He immediately waved his hand and the ‘Ground Spirit Pill’ that was suspended by his side automatically flew into his hand. He took out a jade bottle and stuffed it in before tossing it to Xiao Yan.</p><br/><p>Xiao Yan carefully received the jade bottle. He eyed the ‘Ground Spirit Pill’ that was suspended within the jade bottle and smacked his mouth in surprise. He said, “A tier 6 medicinal pill already has such intelligence. Won’t even higher tier medicinal pills be able to speak a human language?” A few drops of perspiration involuntarily flowed down from Xiao Yan’s forehead when he thought of a medicinal pill being able to chat with a person.</p><br/><p>“Ke ke, a tier 7 medicinal pill does indeed have greater intelligence. Some of the medicinal pills might even automatically fly away after coming out of the cauldron if one is not careful, causing an alchemist exhausted from refining it to be stunned. A tier 8 medicinal pill can even fight with a human, do you think that is mysterious?” Yao Lao laughed out loud.</p><br/><p>Xiao Yan was speechless. A medicinal pill that can fight with a person? This… tier eight medicinal pills were actually this overwhelmingly strong?</p><br/><p>“A tier 8 medicinal pill is already this strong. What about tier 9 and tier 10? Won’t they oppose the heavens?” Xiao Yan laughed bitterly.</p><br/><p>“It is rumored that there are some tier nine medicinal pills can even take a human form.” Yao Lao’s first sentence caused Xiao Yan’s head to spin around. It was becoming more and more ridiculous. A medicinal pill that can even turn into a human?</p><br/><p>“Jiu jiu is the most honored. Above it is not called tier 10. Instead, it is the completely unique ‘God Tier’. A medicinal pill of this tier has never appeared ever since the ancient times. I have once read some ancient books. The meaning of the vague description on it seems to imply that this ‘God Tier’ medicinal pill faintly had some relationship with the rank of Dou Di, the level that merely exists in legend.” Yao Lao laughed. His final sentence was suppressed until it was very soft, seemingly afraid that someone else would hear it.</p><br/><p>TL: jiu jiu - ‘nine nine’ - alternatively, it can sound like ‘long long’ meaning forever, which is a number held in high regard</p><br/><p>TL: God tier (Di tier) - the Di comes from the rank Dou Di (strongest rank). which means god. It should be noted that the rank Di is usually the ultimate level in BTTH</p><br/><p>Xiao Yan wiped his cold sweat. This ‘God Tier’ is actually so frightening? Don’t tell me that one requires this kind of ‘God Tier’ medicinal pill to breakthrough to a Dou Di?</p><br/><p>“No one has been able to refine a ‘God Tier’ medicinal pill in a thousand years. The first reason is that there is a lack of a medicinal formula. A medicinal formula of this tier basically has an innate difference compared to the medicinal formula that we use. We are refining an elixir between the heaven and the earth. The ‘God Tier’ medicinal pill refines the heavens and earth, the mountains and the sea.” Yao Lao’s faint voice gave Xiao Yan a great shock. Refining the heavens and earth into pills? Was this not a little too frightening?</p><br/><p>“The second reason is that no one possesses that kind of strength.” Yao Lao smiled before adding, “Even if I were to recover to my peak, I am also unable to reach that extent.”</p><br/><p>Xiao Yan nodded quietly as he inhaled a deep breath of air. He did not expect that the journey of refining pills actually still possessed such a tactic that went against the heavens. This really caused him to be extremely shocked.</p><br/><p>“Alright, there is not much use for you to know about these now. You will naturally know all that you should need to know when you reach that level in the future.” Yao Lao waved his hand and stored the ‘Black Demon’ medicinal cauldron on the ground into the dark-black ring. After which, the ring shook and was placed on Xiao Yan’s finger with extremely great accuracy.</p><br/><p>Xiao Yan nodded slightly and smiled as he said, “Since the ‘Ground Spirit Pill’ has been successfully refined, shall we first return to the Inner Academy?”</p><br/><p>Yao Lao randomly nodded. His body was just about to enter the dark-black ring when his expression changed slightly. He suddenly turned his head around and eyed somewhere far away within the mountain range.</p><br/><p>“Teacher, what is it?” Yao Lao’s action also caused Xiao Yan to become slightly anxious as he hurriedly asked.</p><br/><p>“You should hide first. Someone is coming. Moreover, the strength of the person who is coming is very strong! I think that he must have been attracted by the activity when the ‘Ground Spirit Pill’ was formed earlier.” Yao Lao said in a slightly deep voice. He pondered a little before his figure turned into a light barrier that covered Xiao Yan’s body. A soft voice sounded beside Xiao Yan’s ears, “Go and hide quickly. With your strength you will definitely be unable to escape his search. Therefore, I can only use Spiritual Strength to wrap around you. Hurry!”</p><br/><p>Xiao Yan was also able to sense the great strength of the person who was rushing over upon hearing the anxiety in Yao Lao’s voice. He flapped his Purple Cloud Wings and searched quickly around him. Immediately, his body charged into a large mountain peak. Finally, his body completely disappeared within the lush greenery.</p><br/><p>Xiao Yan’s body entered the lush green forest and hid in a covert area. His gaze passed through the gaps between the tree branches and eyed the distant sky.</p><br/><p>Not long after Xiao Yan completely hid his body, a slight rushing wind sound suddenly appeared. A blurry, black shadow suddenly appeared in the distant sky. The instant his body paused, Xiao Yan could vaguely sense an extremely large invisible ripple spread over. Finally, it wrapped around all the nearby mountain peaks.</p><br/><p>This invisible ripple was just like a radar. It repeatedly scanned the place up and down. However, it was fortunate that Xiao Yan was wrapped by Yao Lao’s Spiritual Strength. Therefore, he was not discovered.</p><br/><p>The scanning came to a stop after it continued for a while on the ground. The black figure paused. When it next appeared, it appeared on the small mountain peak that Yao Lao had refined the medicinal pill on.</p><br/><p>“What frightening speed.” Xiao Yan’s heart felt shocked at the speed that the black shadow displayed. His gaze was extremely obscured as it passed through the tree branches and quietly swept over the latter. However, he was only able to identify that the other party was an old man who had white-colored hair.</p><br/><p>“This person should be someone from the Inner Academy. However, his strength is much stronger than that of those Elders. If my thinking is correct, this should be the First Elder with the greatest prestige within the Inner Academy.” Xiao Yan quietly guessed and muttered in his heart.</p><br/><p>“May I know which friend is refining medicinal pills in my Inner Academy and where you come from? If it is possible, can you come out to meet me?” The gaze of the black-robed old man looked all around him as his body landed on the top of a mountain. Looking at his calm turbid eyes, one could faintly see a flicker that was just like lightning.</p><br/><p>A sound that was doped with powerful Dou Qi repeatedly reverberated in this area. It was mighty and did not rest even after a long while.</p><br/><p>Xiao Yan would naturally not do as he asked and appear. His body was like a corpse as he lay within the thicket without making the slightest movement. His heartbeat was also suppressed to its lowest point. Adding the cover of Yao Lao’s spirit, he believed that no matter how strong the black-robed old man was, he should not be able to sense Xiao Yan’s position.</p><br/><p>The mighty sound reverberated through the air. A long time later, it completely disappeared. However, the surroundings were still as quiet as they were before. This caused the black-robed old man to involuntarily frown.</p><br/><p>“Don’t tell me that he has already left?” The black-robed old man sighed gently. He could only once again leap his body and leave. After a couple of flashes, he quietly disappeared into the horizon.</p><br/><p>Xiao Yan only let out a gentle relieved sigh when he saw the black-robed old man quietly disappearing. His body had just moved when Yao Lao’s deep voice sounded beside his ear, “Don’t move!”</p><br/><p>Xiao Yan’s body, which had just twisted a little, once again stilled. He pulled at the corner of his mouth and could only maintain this posture. This continued for nearly half an hour. Just when he was about to reach the limit of his endurance, his eyes that were looking toward a mountain peak in the distance suddenly shrunk.</p><br/><p>He could see a slight breeze suddenly blow past the mountain peak, which was originally devoid of anyone. A black-robed human figure slowly appeared within Xiao Yan’s sight just like a ghost.</p><br/><p>Xiao Yan eyed the human figure who had clearly gone far away, but had once again strangely appeared. Cold sweat instantly covered his forehead. This old fellow… was really cunning. If he did not have Yao Lao’s reminder earlier, it was likely that he would be caught red-handed the moment he appeared. This did not appear to be the first time he had met something like this.</p><br/><p>The black-robed old man who had once again appeared looked all around him. At this moment, he was finally certain that the person who had refined medicinal pill here had already gone far away. He let out a sigh. With a shake of his figure, he once again disappeared from the original spot.</p><br/><p>This time around, Xiao Yan finally completely relaxed his tense mind following the disappearance of the black-robed human figure. His body weakly lay on the tree branch, appearing to have lost all his strength as he allowed the cold sweat to drench his clothes.</p><br/>\n</div>"}