{"title": "Chapter 544: Return to the Outer Academy", "id": 544, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-544-return-to-the-outer-academy", "volume_title": "Volume 6", "body": "<h1>Chapter 544: Return to the Outer Academy</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 544: Return to the Outer Academy</u></strong></p><br/><p>A few human figures flashed out from the illusory exit of the Inner Academy. From the looks of their appearances they were actually Xiao Yan, Xun Er and the rest. Behind them was Lin Yan who had followed out of curiosity.</p><br/><p>The moment when Xiao Yan and the others had rushed out from the forest, a faint old voice sounded above the heads of everyone, “You must obtain a letter from an elder if you want to leave the Inner Academy. What does the large group of you plan to do by leaving?”</p><br/><p>Xiao Yan and the others hurriedly raised their heads when they heard this voice, only to see an old man standing on the top of a tree branch. Looking carefully, he was that Elder Su whom they had seen when they had first entered the Inner Academy.</p><br/><p>“Elder Su, I am Xiao Yan and I have an urgent matter that requires me to make a trip to the Outer Academy. Please accomodate me!” Xiao Yan took a step forward, suppressing the anxiety in his heart. He respectfully spoke to the Elder on the tree branch.</p><br/><p>“Oh? Xiao Yan?” Elder Su was startled when he heard this. His gaze was hurriedly thrown to Xiao Yan’s body. When he saw that somewhat familiar face, there was immediately an additional smile on his originally indifferent face. “Ke ke, it is actually student Xiao Yan. Why? Have you become bored after staying in the Inner Academy and want to take a walk outside?”</p><br/><p>“Where would I have such leisure? It is just that there is an urgent matter that requires me to go and take a look.” Xiao Yan laughed bitterly. He cupped his hands toward Elder Su and said, “Elder, please.”</p><br/><p>Elder Su paused for a second since according to the Inner Academy rules, without a letter, they couldn’t randomly let people leave. However, Xiao Yan was different. He was someone that the First Elder personally said to give extra attention. In addition, although he had been stationed here, he had also heard about Xiao Yan being able to refine a tier five pill. Thus, he was quite happy to help Xiao Yan.</p><br/><p>“According to the rules, I cannot let you pass since you have no letter in your hands. However, on the account of student Xiao Yan, I will bend the rules once today.” Elder Su mused for a moment before finally waving his hand and speaking with a smile.</p><br/><p>“Thank you very much, Elder!” Xiao Yan immediately rejoiced when he saw Elder Su nodding his head.</p><br/><p>“Hei, your face is quite big. I have come to find this Elder a couple of times and he always showed me the face of a dead person. If you do not hand over a letter, you are not allowed to pass. It is really unexpected that he would be lenient to you.” Behind Xiao Yan, Lin Yan was a little surprised as he spoke.</p><br/><p>Xiao Yan smiled. He was also clearly aware that the reason for these Elders being so courteous was most likely because he could refine a tier 5 medicinal pill. After all, as an alchemist, he clearly understood just what kind of an attraction a tier 5 alchemist had toward these Elders whose strength were at the Dou Wang class.</p><br/><p>“Xiao Yan ge-ge, you need not be too worried. There should not be any overly big matters that would occur within the Jia Nan Academy.” Xun Er, who had been paying attention to Xiao Yan suddenly spoke softly. Although the former hid it well, she was still able to discover a faint anxiety between Xiao Yan’s brows.</p><br/><p>Xiao Yan nodded slightly as he spoke with a soft voice, “However, you should also know Xiao Yu well. She has a haughty character. Unless there is really a big matter, she would definitely not come find me. No matter how one put it, we are also of the same clan. Moreover, the Xiao clan had been reduced to this state because of me. I also feel a little sorry for them.”</p><br/><p>Xun Er smiled. Her delicate hand gently held Xiao Yan’s palm, indicating that he need not be overly worried.</p><br/><p>As the two conversed softly, the space of the open area in front of them suddenly fluctuated intensely. Immediately, the space appeared to be forcefully torn open by an invisible hand. A silver-colored dazzling door appeared within their sights.</p><br/><p>“I have already sent a signal out. Therefore, there will be some Griffins waiting for you. The deep mountains of the Inner Academy are filled with many Magical Beasts. If there was no Griffin to ride, you would likely need to waste a week’s time in order to reach the Outer Academy.” Elder Su gently landed on the ground from the tree branch and smiled as he spoke to Xiao Yan’s group.</p><br/><p>“Elder Su, thank you very much. I will definitely return the favor that was made today.” Xiao Yan cupped his hands to Elder Su with gratitude. He did not stay for long as he took the lead to swiftly walk toward the silver-colored door. After which, his figure disappeared with a flickering glow.</p><br/><p>Xun Er and the rest followed closely after Xiao Yan. With the flicker of some silver glow, the forest had once again become empty.</p><br/><p>“Seeing that anxious manner of Xiao Yan, it appears that he does indeed have an urgent matter. I’m afraid that I will need to report to the First Elder about this.” Elder Su mused for a moment after the final person disappeared behind the silver-colored doorway. He turned around and leaped into the sky. A pair of Dou Qi wings appeared as he rushed toward the Inner Academy.</p><br/><p>……</p><br/><p>The moment they exited the silver-colored door, a boundless mountain range appeared in Xiao Yan’s sight. There was a deep bottomless gorge that extended out and finally disappeared into the edge of their sight not far in front of them.</p><br/><p>At this moment, there was an enormous Griffin which was flapping its wings beside the gorge. There were even two people driving the Griffin.</p><br/><p>“Ke ke, the few of you are heading for the Outer Academy right? Come aboard.” A person who was driving stood up and smiled. He spoke to Xiao Yan and the rest upon seeing their appearance.</p><br/><p>“Thank you very much.” Xiao Yan did not say any unnecessary words. He waved his hand and took the lead to leap onto the Griffin before his body stood straight without moving on the back of the Griffin, which was quite slippery. Xun Er and the others followed closely behind him. All of them were people with extraordinary strength. Therefore, they would naturally not show the embarrassing matter that some new students displayed back when they first entered the Inner Academy.</p><br/><p>Seeing these steady movements, the two drivers of the Griffin also let out quiet praise. Those students were indeed worthy of being students of the Inner Academy. This kind of agility was something that was far from what the Outer Academy students could compare with.</p><br/><p>“Sit tight!” A cry was let out. The Griffin sudden flapped its wings and set off in a wild gust of wind. An enormous body lifted into the sky before finally swiftly flying toward the mountain range of the Outer Academy.</p><br/><p>In the Griffin anchorage open ground of the Outer Academy.</p><br/><p>Due to the Griffins being extremely eye-catching, there were quite a number of Outer Academy students who had gathered around the open ground. These students were immediately startled when they saw a group of people filing down from a Griffin that had just landed. Xiao Yan, Xun Er, Hu Jia, and Wu Hao were basically stars that everyone in the Outer Academy knew before the four of them entered the Inner Academy. Even though over half a year had passed since then, there were still quite a number of students who remembered them. Therefore, waves of private conversations sounded when the four people showed themselves. Their eyes were filled with a fiery heat.</p><br/><p>Xiao Yan, who was in a hurry, naturally did not bother about these gazes. He lead the group out of the open ground and relied on his memory to walk to Instructor Ruo Ling’s residence.</p><br/><p>“Hei, that green-clothed girl is really beautiful. Why have I not seen her before? It is really unfortunate. If I had met her before, I might even have been able to get close and possess such a beauty.” Some of the voices involuntarily became much louder as they eyed the group of people who had disappeared from the edge of their sight. There was another batch of new students who had entered the Outer Academy during this half a year. Therefore, they had never seen Xun Er and the rest before. However, looking at the imposing manner of the group, these new students who had just arrived did not dare to be overly loud. Their voices naturally appeared now that the group had left.</p><br/><p>“Chi, brat, your skin is really itchy. That is Senior Xiao Yan’s woman. You actually want to get close to her with just your strength?” A student who appeared to be older glanced at a new student who had appeared beside him and said with a cold laughter.</p><br/><p>“Who is Xiao Yan? I have only heard of the new student king chief Yan Cheng and don’t know any Xiao Yan.” That new student was also like a thorn. Immediately, he retorted with anger.</p><br/><p>“New student king Yan Cheng? Hee hee, that is just some stuff that a group of new students who don’t know the immensity of the Heavens and Earth created, yet you dare compare with him? Back when Senior Xiao Yan entered the Inter Academy, he was already a six star Da Dou Shi. Now that he has undergone tough training within the Inner Academy for half a year, his strength will definitely have advanced a lot. He might well have reached the peak of the Da Dou Shi class. What is the rank of that Yan Cheng? With just one slap down, he would not even recognize his old mother.” An older student ridiculed. That so-called new student king was merely something that this batch of new students had chosen in their gathering. The strength of that Yan Cheng was the most outstanding one. Therefore, he was supported by a group of new students to become whatever new student king. Although the strength of the new students was not considered strong, they won in having large numbers. Therefore, it was also quite a strong faction in the Outer Academy.</p><br/><p>The expression of that new student also changed a little when he heard of that so-called peak Da Dou Shi strength. He was also clear about the enormous gap between the two and immediately no longer dared to say any frivolous words. He only tucked his tail and fled in a crestfallen manner.</p><br/><p>……</p><br/><p>Xiao Yan’s group naturally did not know of the changes that had occurred in the Outer Academy during this half a year. Moreover, they would not pay attention to it even if they knew. With the strength of the current ‘Pan’s Gate’, it was able to be ranked among the top even in the Inner Academy. Why would they need to bother about these new students who had just entered this Outer Academy?</p><br/><p>They followed the road and walked toward the place where Instructor Ruo Ling rested. Due to Xun Er and Hu Jia, they had attracted quite a number of gazes along the way. Some of the older students did recognize the few of them. However, some of the new students had faces filled with curiosity as they halted and looked over while repeatedly conversing privately among themselves.</p><br/><p>They hurried throughout the entire journey. Around ten plus minutes later, Instructor Rou Ling’s elegant home appeared in Xiao Yan’s sight. He quietly sighed in relief as he increased the pace of his footsteps. A moment later, they finally arrived in front of the door before knocking on it gently.</p><br/><p>“Creak!”</p><br/><p>The door emitted a sound as it opened. A thin, pallid, pretty face that was somewhat familiar appeared in Xiao Yan’s sight. With that straight lovely figure and the extremely representative long sleek legs, who else could it be but Xiao Yu?</p><br/><p>Xiao Yu, who had opened the door, was also stunned when she saw the large group of people in front of it. However, when her gaze turned to Xiao Yan’s face, she was immediately startled. The crystal clearness in her pretty eyes brewed gradually. It showed the traces of a storm rolling down.</p><br/><p>“Don’t cry, don’t cry. Just what happened? I have rushed out without stopping.” Xiao Yan watched Xiao Yu reveal this soft and weak attitude in front of him for the first time. He was greatly stunned and immediately spoke hurriedly.</p><br/><p>The back of Xiao Yu’s teeth bit her lower red lip tightly. She finally did not cry out. All she did was pull his hand and hurriedly ran into the house. Under this unusual behavior of hers, Xiao Yan did not dare resist even a little, and allowed her to pull him forward as she pleased.</p><br/><p>With Xiao Yu leading them, the group passed through the living room and finally arrived in front of a door. Only then did the former slow his footsteps and gently push open the door.</p><br/><p>Xiao Yan’s hand suddenly trembled slightly as he eyed Xiao Yu’s expression. He slowly walked into the room and immediately saw a bed as well as the man lying on it.</p><br/><p>The man was around twenty-five years old. At this moment, he had his eyes tightly shut and his complexion was as white as sheet. Moreover, it even contained a suffering look and his body would occasionally quiver slightly. That face of his was actually a little similar to Xiao Yan’s.</p><br/><p>Xiao Yan’s eyes stared intently at the familiar face. His fist suddenly tightened. There was faintly some blood traces spreading out from his dark-black pupils. A moment later, a low voice that suppressed an incomparable fury was quietly emitted from his throat.</p><br/><p>“Second Brother!”</p><br/>\n</div>"}