{"title": "Chapter 557: Determining Ones Opponent", "id": 557, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-557-determining-ones-opponent", "volume_title": "Volume 6", "body": "<h1>Chapter 557: Determining Ones Opponent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 557: Determining One’s Opponent</u></strong></p><br/><p>“Bang!”</p><br/><p>A human figure that was like a black-colored metal pagoda carried a sharp rushing wind sound as his feet heavily landed on the ground. In an instant, the dark-black ground made of special material quietly formed a few tiny crack lines spreading from the spot where his feet landed. Moreover, the instant he landed, the dozens of competitors on the arena clearly sensed the ground shaking viciously. Immediately, they threw surprised gazes at that black shadow. Only when their gaze took in who that person was did they come to a sudden understanding.</p><br/><p>Tyrant Spear Liu Qing. It was likely that he was the only one who possessed such a sharp overbearing brute strength.</p><br/><p>The moment Liu Qing landed, his body was as straight as the body of a spear, not even bending a little. The black-colored heavy spear on his back was as tall as him and faintly a thick, heavy aura seeped out of it.</p><br/><p>Liu Qing suddenly raised his head after landing on the ground. His gaze was thrown at a certain spot at the tall platform, and it was filled with a hot fighting intent. The place that the gaze was thrown to was the expected Lin Xiuya!</p><br/><p>The gazes of the entire place followed Liu Qing’s sight and moved. Finally, they stopped at Lin Xiuya’s body. They sensed the sharp head-to-head aura of both parties and a great anticipation was felt in their hearts. They did not know just who would emerge victorious when the true two experts at the peak of the Inner Academy were to fight.</p><br/><p>Lin Xiuya gave a faint smile when faced with the gazes of everyone present. He cupped his hands toward Xiao Yan a short distance away and immediately pressed his toes gently on the ground. His body was like a falling piece of lead as he flashed off the tall platform. A pale-green-colored tornado immediately took shape under his feet. Finally, he appeared to be walking down a flight of stairs. Each time his foot descended, it would appear like it was stepping on some kind of invisible stairs. This scene appeared to be somewhat like the realm of walking through the air. Such a skill undoubtedly caused a cheer to erupt in the stadium. All of them knew that even if it was an elite Dou Wang, he would need to borrow the force of Dou Qi wings in order to remain in the air. Something like this scene of appearing to not borrow any force to walk as though one was walking on flat ground would at least require the strength of a Dou Huang in order to be achieved.</p><br/><p>Even some of those Elders on that high platform nodded their heads slightly upon eyeing this skill that Lin Xiuya had revealed. With their sight, they were naturally able to see that the former did not truly appear to be walking on flat ground. Instead, he borrowed the wind affinity of his Dou Qi to form an invisible landing spot under his feet. It could not remain for long but even if this was the case, it was something that required an exquisite control of one’s Dou Qi. With Lin Xiuya’s current strength, being able to perform at such a level was already very astonishing.</p><br/><p>Under the shocked gazes of the entire place, Lin Xiuya slowly walked down through the air. His feet gently landed on the ground and he immediately stood with his hands behind him. His body appeared elegant. At this moment, there were already quite a number of female students in the surrounding area who had eyes that were emitting stars.</p><br/><p>“Chi…”</p><br/><p>Just as everyone was drunk from the scene of Lin Xiuya stepping on empty space earlier, the sound of low, deep thunder suddenly roared through the air. Some people hurriedly raised their heads. However, other than the flash of a silver glow, which disappeared immediately in their eyes, they did not actually discover anything else. Only when their gazes shot all over the place did some sharp-eyed people discover that there was an additional black-robed human figure that had appeared in the arena.</p><br/><p>“Xiao Yan? This fellow’s speed… is really fast.” Currently, all the students in the Inner Academy were already familiar with Xiao Yan’s appearance. Additionally, that signature Heavy Xuan Ruler also revealed his identity. In an instant, low surprised voices sounded one after another.</p><br/><p>Xiao Yan’s appearance was not as heavy or beautiful as the previous two, but in the eyes of those people with true strength it did not lose to Liu Qing or Lin Xiuya. After all, that kind of speed was indeed so fast that it was somewhat terrifying…</p><br/><p>Liu Qing, Lin Xiuya, and a few others in the arena turned their heads and threw their gazes to the quiet, black-robed, young man. An extremely obscure, shallow fear flashed across their eyes. This kind of speed was something that even they had to view seriously. Additionally, other than one or two of them, many of them knew in their hearts that even if they were to display all their strength, it was likely that they would not be able to achieve this kind of speed.</p><br/><p>“The speed of this little fellow would likely have difficulty finding many people in the Dou Ling class who can match up with him. Moreover, from the looks of his agility technique, it still appears somewhat tender. He should have just reached initial mastery. I really don’t know just how terrifying it will be once he practices it to its pinnacle point.” On the tall platform, Elder Hao, who had quite a good relationship with Xiao Yan, fondled his beard and praised sincerely.</p><br/><p>“The class of the agility technique that he is practicing is not low. Otherwise, it would definitely be impossible to achieve such an effect.” An Elder nodded his head, and had faintly guessed some clues.</p><br/><p>First Elder Su Qian stood indifferently on the spot. The somewhat familiar roar of thunder flashed in his mind. A moment later, he appeared to have remembered something and his eyes instantly narrowed. His heart was somewhat surprised as he muttered, “How could this little fellow possess such an agility technique? This is a secret by the ‘Wind Lightning Pavilion’ that isn’t given to others. If those fellows were to discover this in the future, I’m afraid that some entanglement would be unavoidable.”</p><br/><p>If Xiao Yan knew that Elder Su was able to recognise his Dou Technique at a glance, it was likely that he would be extremely stunned, feeling that the eyes of this old fellow were a little too sharp.</p><br/><p>Not long after Xiao Yan and the other two entered the arena, a white-clothed little girl slowly followed the stairs and climbed up from a certain spot under the stage. After which, under the countless number of stunned gazes, she walked to the front of the group. Her mouth appeared to be chewing something as she looked in all directions. She smiled immediately when she saw Xiao Yan, revealing her cute orderly little fangs.</p><br/><p>Not many people in the Inner Academy knew about Zi Yan’s identity. Perhaps, only just the people on the ‘Strong Ranking’ and some older students knew about her. For those new students who had come in a little later, they had never heard of this name. After all, the former did not frequently show her face in the Inner Academy. Moreover, no one dared to challenge her. Hence, this resulted in the people of the Inner Academy only knowing Liu Qing, Lin Xiuya, and the others, but they did not know that the first place on the ‘Strong Ranking,’ the person who rode over them, was actually such a cute little girl.</p><br/><p>Waves of private conversations sounded from the surrounding viewing gallery. However, the expressions of some of the competitors had turned a little unnatural. Other than those who had squeezed into the ‘Strong Ranking’ during this recent period of time, fear flashed across the faces of most of the rest of the people. The reaction of these people caused everyone in the stadium to feel at a loss.</p><br/><p>Zi Yan was too lazy to bother about the gazes around her. Her mouth repeatedly chewed the Danwans that Xiao Yan had refined for her. Her laid back manner did not appear to have the pressure that came with the approaching Grand Competition… if it was two years ago, there were indeed some opponents in this Inner Academy who could fight with her. Now, however, those elites had already graduated and left. As time flowed by, she had become the student who had remained in the Inner Academy for the longest time with the appearance of a little girl. Uh, although this student was a little strange...</p><br/><p>Therefore, with Zi Yan’s current abnormal brute strength, it was likely that even Liu Qing and the rest would have difficulty contending with her. This little fellow had already become an existence on the ‘Strong Ranking’ that exceeded common sense.</p><br/><p>“Cough!” A faint coughing sound that contained Dou Qi sounded beside the ears of everyone. Immediately, the private conversations began to soften. A moment later, they completely disappeared. Numerous gazes were lifted as they eyed the black-robed Elder in the middle of the tall platform. Their gazes were filled with respect and fear. As the First Elder whose strength and authority in the Inner Academy was merely below that of the mysterious headmaster, even an ordinary Elder maintained respect toward him, much less these students.</p><br/><p>“Since everyone is already here, the Grand Competition can begin.” Su Qian said with a faint smile, “However, I would like to give a reminder before the start of the competition. Although the Inner Academy has an open-minded culture, I still hope that everyone can do their best not to unleash a fatal blow in this competition. All of you are still students, and this is not the a place like the ‘Black-Corner Region’ where people eat one another. Although the Inner Academy has a somewhat bloody place like the Fighting Arena, its original intention is to train all of you and not to let all of you fight to the death. Therefore, everyone should gauge your strength when you strike.”</p><br/><p>Some of the competitors nodded slightly when they heard Su Qian’s words. However, most of them maintained a non-committal attitude. In this kind of competition who would not go all out in order to enter the top ten? When one went all out, one would have difficulty controlling one’s strength. It was inevitable that accidents would occur.</p><br/><p>Su Qian’s gaze swept over the faces of the competitors and helplessly shook his head. The atmosphere of the Inner Academy had gradually become fiercer recently. Those novices who did not know how to go all out and kill in the Fighting Arena had also grown into vicious wolves of the grassland with extremely rich fighting experience. It was a little difficult to contain their ferociousness at this moment.</p><br/><p>“The rules are the same as they were in the past. Opponents are determined by drawing lots.” Seeing that his words did not have much of an effect, Su Qian also ceased to speak any more unnecessary words and instead spoke in a deep voice.</p><br/><p>The moment the words sounded, he waved his sleeves gently. Immediately, a black cloth that was not far in front of them drifted down, revealing a rock table under it. There was a large wooden cylinder on the rock table which contained quite a number of bamboo sticks.</p><br/><p>“The cylinder contains twenty-five sticks with a blue bottom and twenty-five sticks with a red one. The numbers are all from one to twenty five. If you were to pick a stick with a blue bottom containing the number twelve, your opponent would be the person who holds the stick with a red bottom with the number twelve.” Su Qian summarized the rules of the lot picking once. This thing was not very complicated, therefore, those students who had experienced this for the first time could also understand.</p><br/><p>“Alright, let the lot picking begin!”</p><br/><p>The competitors orderly walked to the rock table one at a time and picked a bamboo stick from within the cylinder. They read out their number in front of everyone before withdrawing.</p><br/><p>Xiao Yan was not anxious to pick a lot. He stood in the same spot and suddenly frowned slightly. Tilting his head slightly, his gaze swept over the place behind him and coincidentally saw a vicious gaze. From his appearance, that person was actually Bai Cheng who had been defeated by him back then. This matter of his seemed like he was still bearing a grudge in his heart. Moreover, this hatred also had some dissatisfaction. Perhaps he was similar to everyone else in thinking that the reason that he had been defeated by Xiao Yan’s hands was because of the ‘Dragon Strength Pill’.</p><br/><p>Bai Cheng’s face shook a little when he saw Xiao Yan’s gaze being thrown over. He strode forward and walked to the side of the rock table. He groped a little before picking up a bamboo stick with a red bottom. With a deep voice, he read, “Red bottom, fifteen.” Once he read it out, he withdrew to one side and continued to use a vicious gaze to stare at Xiao Yan. He viciously cursed in his heart, “It would be best that you end up picking a bamboo stick with the same number as Liu Qing!”</p><br/><p>Under Bai Cheng’s curse, Xiao Yan finally slowly walked to the rock table. He randomly picked out a stick with a red bottom. He was initially a little startled when he swept the bottom with his gaze. A playful feeling immediately surfaced on the corner of his mouth.</p><br/><p>“Blue bottom… fifteen.” Xiao Yan laughed softly. His gaze was slowly lifted as he saw the cold smile on Bai Cheng’s face abruptly stiffen.</p><br/>\n</div>"}