{"title": "Chapter 564: Great Rift Coffin Splitting Claw", "id": 564, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-564-great-rift-coffin-splitting-claw", "volume_title": "Volume 6", "body": "<h1>Chapter 564: Great Rift Coffin Splitting Claw</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 564: Great Rift Coffin Splitting Claw</u></strong></p><br/><p>The entire stadium was completely silent as they eyed Liu Qing who was standing as straight as a spear rod in the arena. This situation was something that even Zi Yan had not enjoyed when she had appeared earlier. Although she may be the true number one seat on the ‘Strong Ranking’, her reputation within the Inner Academy was incomparable to Liu Qing, Lin Xiuya, and the others because she had rarely exposed herself.</p><br/><p>Liu Qing quietly stood in the arena. He ignored the various gazes around him. His eyes stayed shut as his hands hugged his chest, waiting for his opponent to appear.</p><br/><p>“Chi!”</p><br/><p>A pale-blue human figure suddenly flashed onto the stage under the focus of everyone. The person who came forth was a young man wearing blue clothes. He was around twenty-four to twenty-five years old and his face could be considered handsome. However, his face was currently covered with bitterness. Other than a few countable people within this Inner Academy, it was likely that anyone else who picked Liu Qing as their opponent would also be this dispirited.</p><br/><p>Ordinarily speaking, by meeting Liu Qing in the first round of drawing lots, one could be said to have completely lost the chance of entering the top ten. The strength of this blue-clothed young man was also not weak since he was ranked in the middle of the ‘Strong Ranking’. However, his chances of victory against Liu Qing, who had half his foot in the Dou Wang class, were basically so small that they were negligible. Not only were the students outside of the arena clearly aware of this fact, but even the blue-clothed, young man himself also knew that it was highly likely that he would lose this match.</p><br/><p>“All the competitors have arrived. Let the match begin.” Su Qaian eyed the two people facing each other in the arena as he waved his hand and spoke faintly.</p><br/><p>Following the sound of Su Qian’s voice, the gazes of everyone instantly became fiery-red. All the gazes were filled with anticipation.</p><br/><p>Although the blue-clothed, young man did not hold much hope for victory, he was still an expert who could be ranked on the ‘Strong Ranking’ no matter how one put it. He was still in possession of some mental fortitude. Hence, after Su Qian announced the start of the match, he slowly suppressed the panic in his heart. His gaze solemnly watched Liu Qing on the opposite side. With a sway of his hand, a pale-blue longsword appeared. The body of the sword had strange faint watery lines on it. The watery lines appeared to be moving anytime it shook, giving it a strange appearance.</p><br/><p>With the longsword in his hand, the aura of the blue-clothed young man had become much more real. Waves of pale-blue Dou Qi swiftly surged out of his body. Finally, it moved along his arm, and wrapped the longsword within it. In an instant, the longsword emitted the faint sound of rolling sea waves.</p><br/><p>Appearing to have sensed the gradually agglomerated aura of the other party, Liu Qing finally opened his eyes slowly and swept they indifferently over the other party. He nodded slightly. Fortunately, the courage of the other party was not as low as he had initially thought.</p><br/><p>“Senior Liu Qing, Lan Yan will seek your guidance!” The blue-clothed, young man pointed the longsword straight at Liu Qing as he spoke in a deep voice.</p><br/><p>Liu Qing twisted his head slightly. His body trembled a little as a wave of bone cracking sounds immediately sounded within his body. Both of his hands stretched out equally. His palms were larger than an ordinary person’s hand. They curled slowly, much like sharp claws.</p><br/><p>The two hands clawed in an alternating manner in front of him. A couple of invisible strikes flashed through the air before finally striking the ground, leaving behind shallow scars.</p><br/><p>Xiao Yan’s pupils, which intently observing at Liu Qing from the high platform, dilated slightly. He realized that Liu Qing had acted randomly earlier, and had not even used a single thread of Dou Qi. He had completely relied on just his physical strength earlier...</p><br/><p>“This fellow’s physical body is actually also this strong. He is indeed a powerful opponent.” Xiao Yan sighed softly. The difficulty of tempering one’s physical body was much harder than training Dou Qi. If Xiao Yan did not use numerous medicinal ingredients to supplement his bodily strength, it was likely that he would have difficulty possessing his current physical strength. Currently, however, the physical strength that Liu Qing displayed did not appear to be any weaker than his own.</p><br/><p>As Xiao Yan exclaimed, that young man in the arena, called Lan Yan, took the lead in attacking. His power was also not weak. From how Xiao Yan look at it, it appeared that he at least possessed the strength of a four star Dou Ling. At this level, one would belong among the top even within the Inner Academy. Currently. He pounced with his entire strength as his powerful Dou Qi surged over his body like the waves of the sea. In addition, the slight sound of rolling waves slowly spread and was transmitted into everyone’s ears.</p><br/><p>Lan Yan clearly knew how troublesome his opponent was. Therefore, he did not hold anything back right from the start. His Dou Qi and speed were unleashed to the limit the moment his body had moved.</p><br/><p>That Lan Yan flashed and crossed the short distance of dozens of meters in an instant. The longsword in his hand was wrapped in a rich blue-colored Dou Qi. It carried moist air as it violently pierced toward Liu Qing. The sharp sword glow appeared exceptionally dense and cold after being contaminated by the mist.</p><br/><p>“Three Shark Thorn!”</p><br/><p>A low cry was emitted from Lan Yan’s throat. The blue-colored glow suddenly soared, and a faint ferocious sharp head surfaced. Its enormous mouth had a fishy smell that carried some moisture while charging explosively toward Liu Qing!</p><br/><p>This attack from Lan Yan was basically the strongest attack that he could display within a short period of time. Although the water affinity did not specialize in attack, with the coordination of such powerful Dou Qi, it was able to create the destructive force of a bullet regardless of how gentle water is known to be.</p><br/><p>As Lan Yan’s longsword pierced out, the entire arena was covered in a moist air. Two clusters of tiny water logs even formed under his feet.</p><br/><p>Liu Qing’s expression still did not ripple much despite facing this extremely ferocious attack of Lan Yan. His eyes stared intently at the longsword that was swiftly becoming enlarged in his eyes. His hands, however, slowly curled into an extremely strange arc.</p><br/><p>“Hei!”</p><br/><p>The attacking distance was covered in the blink of an eye. Lan Yan let out a low cry as the longsword in his hand pierced out. A blue-colored glow suddenly agglomerated into a ferocious shark shape. It widened its savage mouth, and bit toward Liu Qing’s head.</p><br/><p>“Chi!”</p><br/><p>Liu Qing eyed the ferocious shark sword glow that swarmed over explosively in an indifferent manner. A pale-gold color suddenly surged onto his curled claw-shaped hands. His right hand abruptly extended, and collided with that ferocious shark sword glow in a lightning-like manner!</p><br/><p>The instant the two collided, Liu Qing’s hand claw changed into a strange arc. His fingers bent and curled and suddenly clipped violently. That thread of ferocious sword glow was firmly wedged between his fingers.</p><br/><p>“Break!”</p><br/><p>A stern cry was emitted. The pale-golden glow soared on Liu Qing’s palm, and that sword glow was immediately smushed until it collapsed and disappeared.</p><br/><p>“Shua, shua!”</p><br/><p>When the first sword glow was broken, Lan Yan’s expression immediately changed. He hurriedly shook his hand and more two sword glows shot out explosively. The two sword glows still took the shape of a shark but their strength was increasingly stronger, such that the third sword glow was a full three times stronger than the first!</p><br/><p>This kind of Dou Technique where each blow was increasingly stronger than the previous one would likely not be one with a low rank.</p><br/><p>“Great Rift Coffin Splitting Claw!”</p><br/><p>Liu Qing narrowed his eyes. His hands that were curled into a strange arc abruptly shot out. As the two claw-like hands rotated strangely, they once again firmly grabbed onto the two ferocious sword glows and immediately shattered them.</p><br/><p>The three fierce shark sword glows that would be enough to defeat an ordinary four star Dou Ling were broken by Liu Qing in such an easy manner. Even with Lan Yan’s mental fortitude, he was instantly dumbstruck. This kind of match was basically one that was of a completely different class.</p><br/><p>“The match is over.” The instant Lan Yan became dumbstruck, a faint voice was suddenly emitted from Liu Qing’s mouth. All the pores of the former stood straight as he sensed a wind instantly move close to his body. Liu Qing slihgtly pushed forward as an incomparably ferocious aura surged out, completely destroying the Dou Qi protecting Lan Yan’s body.</p><br/><p>“Grug!”</p><br/><p>Lan Yan’s face turned white. A mouthful of fresh blood was spat out. His body dragged along the ground, and was violently knocked out of the arena.</p><br/><p>The arena was completely silent as everyone eyed Lan Yan who spat out blood and rolled out of the arena. Numerous sounds of people inhaling cold air arose. Many people only saw that Lan Yan’s earlier attack had completed wrapped around Liu Qing. It was really unexpected that in the blink of an eye, the sharp attack had been completely eliminated. Lan Yan was utterly defeated… many people had a fog over their head in the face of such an ending.</p><br/><p>TL: Were confused about the ending</p><br/><p>“What a strange claw technique.” Xiao Yan’s expression was completely serious as he eyed the pair of large palms from the tall platform. Even he had to say that the attack by Lan Yan earlier was not bad. However, those three sword glows that came one after another with increasing strength were completely received by the bare-handed Liu Qing. They were even shattered. This technique really caused people to be shocked.</p><br/><p>“Liu Qing has two ultimate moves. One is the ‘Mountain Splitting Spear’, and the other is the ‘Great Rift Coffin Splitting Claw’. This claw technique is a High Xuan Dou Technique. However, in Liu Qing’s hands, it even has a strength that is comparable to a Di class Dou Technique. This is because he has honed this Dou Technique for nearly twenty years. It would not be surprising he had practiced it until he had reached the pinnacle.” A soft laughter suddenly sounded beside Xiao Yan. The latter turned around and realized that it was Lin Xiuya who had unknowingly arrived.</p><br/><p>“He is indeed very strong.” Xiao Yan was amazed as he nodded. He viewed Liu Qing much higher in his heart. This fellow was indeed extremely troublesome.</p><br/><p>“Ke ke, Senior Lin is able to defeat Liu Qing who possesses two ultimate skills. I think that your strength should be even greater.” Xiao Yan turned his head and smiled as he spoke to Lin Xiuya.</p><br/><p>Lin Xiuya smiled and shook his head as he said, “Back then, I was merely lucky to have defeated him. I wonder if I will still have that luck this time around. This fellow’s toughness and talent is something that causes even me to be amazed.” As he spoke to this point, his gaze shifted to Xiao Yan, he then continued with a smile, “If you were to use all your tactics, I think that even Liu Qing or me would likely have a difficult time winning against you should we end up fighting.”</p><br/><p>“Senior Lin is overestimating me.”</p><br/><p>Xiao Yan smiled and shook his head. His eyebrows were suddenly lifted. His gaze slowly turned back to the arena, only to see that the metal-pagoda-like battle god’s sharp eyes were firmly locked onto the two of them. As the latter’s eyes moved, the gazes of the entire stadium moved with him and instantly stopped on both Xiao Yan and Lin Xiuya.</p><br/><p>Everyone in the viewing gallery felt uncertain when they discovered that Liu Qing’s gaze had basically wrapped Xiao Yan within it. It was nothing for Lin Xiuya to be viewed this seriously given his strength. On the other hand, Xiao Yan may be considered to be the strongest dark horse in the Inner Academy, but there should still be a gap between him and those people like Lin Xiuya, who had true strength.</p><br/><p>The three gazes ignored the surrounding ones as they faced each other from a distance. A fighting intent involuntarily brewed and surged within their chests.</p><br/>\n</div>"}