{"title": "Chapter 568: Victorious!", "id": 568, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-568-victorious", "volume_title": "Volume 6", "body": "<h1>Chapter 568: Victorious!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 568: Victorious!</u></strong></p><br/><p>Yao Sheng’s face was a furious green as he eyed Xiao Yan in the sky who had a mocking smile hanging on the corner of his lips. His hands tightened their grip on the daggers as he said coldly, “Even without the ‘Black Water World’, you will be defeated sooner or later. I don’t believe that that secret technique of yours to raise your strength can endure for long.”</p><br/><p>“It is sufficient enough to finish you off.” Xiao Yan laughed softly. His arm shook a little as powerful green-colored Dou Qi carrying threads of green-colored flames, that were difficult to discover, leaped and climbed onto the heavy ruler. His gaze stared intently at Yao Sheng below, whose entire body was tense. An instant later, Xiao Yan suddenly flapped his wings, only to hear a slight ‘shua’ sound. Immediately, a vague black shadow strangely appeared behind the back of Yao Sheng’s head. The heavy ruler in his hand carried a wild and violent force as it was viciously hacked downward. That ferocious wind appeared to be intent on tearing the air in front of him apart.</p><br/><p>Yao Sheng sensed something the moment the wind from his back sounded. His feet stomped heavily on the ground, and a black water vapor abruptly surged out from under his feet. Finally, it collided with that heavy ruler.</p><br/><p>“Puff!”</p><br/><p>The moment the two came into contact, the heavy ruler heated the dark-black water until to turned into a somewhat blackish mist in an extremely easy manner. However, when it fell, the space in front of it was empty. After borrowing the instant obstruction of the water vapor earlier, Yao Sheng had already used his agility to withdraw a couple of meters.</p><br/><p>The attack by Xiao Yan’s heavy ruler had just fell when a dark and ruthless Yao Sheng once again pounced over in a lightning-like manner. His pair of dark black daggers swiftly rotated between his ten fingers. They were like two poisonous snakes, easily fatal and filled with a dense, cold luster.</p><br/><p>Xiao Yan raised his brows upon seeing that Yao Sheng had come attacking head on. The Dou Qi in his body was just like a galloping river that swiftly flowed unceasingly within his Qi Paths. It filled the various parts of his body with an extremely large quantity and have him strength. Both his hands held the heavy ruler tightly as a low cry sounded from his throat. Immediately, the heavy ruler once again viciously pierced forward.</p><br/><p>As the wind was strong, it pulled away all the air in the area where the heavy ruler passed. Low and deep gas explosion sounds repeatedly resonated, piercing one’s eardrum.</p><br/><p>Under this attack, the distance between the two of them was basically covered in the blink of an eye. However, just as the two daggers of Yao Sheng made contact with the heavy ruler, their bodies strangely twisted. Their bodies used a unique stance as they nestled close to the surface of the heavy ruler and rotated a couple of times before they suddenly appeared at the spot where Xiao Yan was holding the heavy ruler. With a dark, cold smile, the sharp daggers in his hands were unceremoniously sliding toward where Xiao Yan’s hands were.</p><br/><p>Some exclamation sounded in the stadium as everyone eyed Xiao Yan. Yao Sheng had suddenly bullied his way to get near him. Under such close distance, the strength of the heavy ruler was basically completely blocked by the other party! According to a normal situation, Xiao Yan would likely be pressured by Yao Sheng until he ended up on the losing end after this. Moreover, if Xiao Yan was careless, those tricky, vicious, poisonous snake-like daggers would even leave behind quite a deep wound on Xiao Yan’s body.</p><br/><p>There were only a couple of people knitting their brows together while the entire stadium was exclaiming. With Xiao Yan’s fighting experience and speed, how could he allow the other party to enter his own attack’s blind spot this easily?</p><br/><p>Liu Fei’s face was so excited that her face was somewhat flushed red as she watched Xiao Yan face a treacherous situation. She nearly let out a cheer. However, the eyes of Liu Qing, who was seated beside her, stared intently at Xiao Yan’s face. There was not the slightest thread of panic there. Instead, it faintly contained a cold smile. His heart immediately sank a little.</p><br/><p>Under the countless number of focused gazes in the arena, Yao Sheng’s two daggers approached Xiao Yan’s hands. The dense, cold wind on them caused the pores on Xiao Yan’s hands to open up.</p><br/><p>As the daggers approached Xiao Yan’s hand, the joy on the corner of Yao Sheng’s mouth expanded.</p><br/><p>Just as the daggers were extremely close to Xiao Yan, the latter finally made a move. He did not adopt any shocking counter attack, but instead took the initiative to release the heavy ruler in his hand. The heavy ruler flew through the air and landed heavily on the ground. The clear sound caused some people to sigh. Could the fight still continue after he had lost his weapon? Of course, there were similarly quite a number of people who adopted other thoughts. At this moment, they suddenly recalled the scene of Xiao Yan’s fight with Bai Sheng back in the Fighting Arena. At that time, the strength that Xiao Yan had displayed after losing his weapon was even wilder and more ferocious than before!</p><br/><p>Xiao Yan’s act of abandoning his weapon caused a wild joy to surge onto Yao Sheng’s face. This moment did not allow him to hesitate any more. The daggers in his hands were suddenly covered by a black-colored Dou Qi. As threads of Dou Qi lingered over them, a strange smell of fish suddenly filled the arena!</p><br/><p>“Imaginary Submerged Thorn!”</p><br/><p>A dark cry containing a dense coldness was let out as the pair of daggers swiftly shook in a strange manner. Threads of black air covered them as the daggers shook. The black air ppeared to be a poison serpent that possessed a spirit as it shot out in all directions. At this moment, each thread of black air possessed the strength to penetrate a huge rock.</p><br/><p>Xiao Yan clearly understood in his heart that these black vapors that came flying over from all directions not only possessed a shocking strength, they also contained a fatal poison. As he watched them… Xiao Yan’s hands swiftly formed some seals in front of him. He immediately let out a soft cry and wisps of green-colored flames swiftly surged out from the Acceptance Spirit within the vortex.</p><br/><p>As the flames within his body surged out, the exterior of Xiao Yan’s body was once again wrapped by a flame. Moreover, as the flame flickered, it agglomerated into a flame armor in the blink of an eye at lightning-like speed.</p><br/><p>“Chi, chi…”</p><br/><p>As the countless number of black threads heavily knocked on the armor, it appeared like ice was meeting boiling oil as a ‘chi’ sound was repeatedly emitted. The force that was sufficient to penetrate an enormous rock merely caused the flame armor to be slightly dented.</p><br/><p>As the black threads surged explosively, two dense cold glows lit up. With lightning swift momentum, they immediately pierced violently toward the flame armor. Immediately, two clear metal sounds resounded from within the arena.</p><br/><p>The two dark-black daggers were extremely large. Even though the green flame armor was extremely strong, it was still penetrated by a depth of half a finger. Even though it was penetrated, this was the daggers’ limit. The extremely hot temperature on the flame armor instantly caused the dark-black daggers to become fiery-red. Yao Sheng was holding tightly on the daggers with his hands as the daggers emitted a ‘chi chi’ sound and white vapor came rising from them. Such a situation shocked him to the point where he hurriedly maneuvered his Dou Qi and wrapped it around his hands. Despite this, he still felt a searing pain that was gradually becoming stronger.</p><br/><p>Yao Sheng violently pushed at the daggers, but they did not move even a little. Helpless, he could only swiftly release his hands. As he withdrew, his gaze stared intently at Xiao Yan, whose entire body was wrapped within the flame armor. At this moment, he appeared to faintly see a mocking gaze flash from underneath the helmet.</p><br/><p>The green flame Dou Qi suddenly soared, and the helmet flame that covered Xiao Yan’s head instantly disappeared. Xiao Yan’s face was revealed with the disappearance of the helmet. At this moment, his mouth appeared like a frog as it beat in a large rhythmic motion. His hands swiftly formed a seal.</p><br/><p>“This is bad!”</p><br/><p>The heart of Yao Sheng, who was flying back in retreat, suddenly sank as he watched Xiao Yan’s movements.</p><br/><p>However, as this thought flashed across his heart, the seal on Xiao Yan’s hands suddenly ceased. His mouth beat before it was abruptly opened. Immediately… an extremely clear tiger roar that shook one’s eardrum suddenly sounded explosively within the arena!</p><br/><p>“Lion Tiger Gold Shattering Roar!”</p><br/><p>The sound of a tiger roar surged out from Xiao Yan’s mouth. A circular substance-like sound wave spread out in a lightning-like manner much like a ripple. Instantly, it caught up to Yao Sheng. The head of the latter immediately became giddy. His stomach felt nausea as a mouthful of fresh blood surged into his throat before finally spilling out from the corner of his mouth.</p><br/><p>Under this sudden sonic attack, Yao Sheng finally suffered serious trauma. Moreover, a fatal dizziness also appeared.</p><br/><p>In this kind of exchange, such a giddiness would undoubtedly decide the victor. Given Xiao Yan’s character, he would definitely not give up on this kind of giddiness that was purposefully created. Therefore, just as Yao Sheng’s mind was being replaced by dizziness, Xiao Yan’s body finally made a move!</p><br/><p>The silver glow under his feet flickered and a faint lightning roar sounded. Immediately, everyone’s gazes were blurred as Xiao Yan’s body instantly appeared in front of Yao Sheng in a ghost-like manner.</p><br/><p>Everyone’s hearts were abruptly raised when they saw this scene. They knew that the victor was going to be decided at this moment!</p><br/><p>The dizziness in Yao Sheng’s mind merely lasted for a couple of breaths. However, when his mind gradually recovered its consciousness, a black shadow had already appeared in front of him. As shock rose in his heart, an extremely powerful wind, that carried a low sonic boom, sounded over the entire arena.</p><br/><p>“Octane Blast!”</p><br/><p>Yao Sheng had already lost his chance to dodge given such a close distance. His face was covered by shock and despair.</p><br/><p>The sound of one inhaling cool air sounded all over the arena at this moment. Under such a ferocious attack, it was likely that Yao Sheng would definitely lose.</p><br/><p>“Yao Sheng has lost!” Faint words were spat out from both Liu Qing’s and Lin Xiuya’s mouth at the same time. However, the former’s face was dark and solemn while the latter’s face was filled with amazement and smiles.</p><br/><p>Upon hearing the words that were emitted from Liu Qing’s mouth, the face of Liu Fei, who had an excited face earlier when she anticipated Yao Sheng beating Xiao Yan up until the latter begged for mercy, suddenly became pale-white. Her mouth repeatedly opened and closed thinking, how can this be?</p><br/><p>The fist that was wrapped by powerful Dou Qi passed through the obstruction of the air and carried an incomparably powerful force as it heavily smashed into the chest of the shocked Yao Sheng. His fist rotated and a force that was thrown in all directions launched out.</p><br/><p>“Grug!”</p><br/><p>An intense pain was transmitted from Yao Sheng’s chest as an unusual redness surged onto his shocked face. An instant later, he finally could not help but wildly spit out a mouthful of fresh blood. His body appeared to have suffered a serious blow as it shot backward before finally landing heavily outside of the arena. Numerous crack lines instantly appeared on the ground where he landed.</p><br/><p>The fresh blood that was spat out was vaporized by the flames when it was still around two to three feet from Xiao Yan’s body. The green flame armor on Xiao Yan’s body trembled before it swiftly turned into nothingness.</p><br/><p>Xiao Yan slowly stepped forward. He eyed the pale-white face of Yao Sheng outside of the arena in an indifferent manner. A calm voice reverberated over the arena.</p><br/><p>“You have lost…”</p><br/>\n</div>"}