{"title": "Chapter 567: Overcoming the Black Water World", "id": 567, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-567-overcoming-the-black-water-world", "volume_title": "Volume 6", "body": "<h1>Chapter 567: Overcoming the Black Water World</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 567: Overcoming the ‘Black Water World’</u></strong></p><br/><p>The entire stadium was silent as the black-robed, young man flapped his wings, suspended in mid-air.</p><br/><p>Su Qian’s face on the judges’ seats was also somewhat stunned. However, his eyes were naturally far from what the others could compare with. This was because when his gaze once again swept over the wings on Xiao Yan’s back, his stunned look gradually turned to a sudden understanding. “It is actually a Flying Dou Technique. Hei, it is really unexpected that this little fellow is even able to get his hands on such a rare Dou Technique.”</p><br/><p>As Su Qian pointed it out, the other Elders also came to a sudden understanding. An ordinary person might not have heard very much about the Flying Dou Techniques. However, with their experience, they have heard a little about such extremely rare Dou Techniques.</p><br/><p>“Fortunately… I almost thought for a second there that this little fellow had advanced to the Dou Wang class.” Some of the Elders quietly wiped off the cold sweat on their foreheads. They had went all out to desperately train for decades in order to achieve their current strength. If this young man below, who was not even twenty, had achieved this step, they would truly feel grief and indignation. Moreover, the most frightening thing was that this fellow was also a tier five alchemist...</p><br/><p>The silent atmosphere in the arena continued for a period of time. Finally, it gradually once again became active. There were also a few people on the tall platform who had recognized the origin of the wings on Xiao Yan’s back and sighed in relief because of this. There was immediately some envy within the arena. A Flying Dou Technique may not be comparable to a pair of true Dou Qi wings, but it was still able to allow one to fly in the sky. This was a target that many people had been chasing after. Especially when the Dou Wang class was so far away. One did not know just when it would be before one could train until that level.</p><br/><p>“It is actually a Flying Dou Technique...” The dull face of Yao Sheng within the arena also gradually recovered. He was able to clearly sense that Xiao Yan’s aura had yet to advance to the Dou Wang class. When he carefully studied the shape of the purple-black wings, his heart came to a sudden comprehension. His tensed up body also relaxed slowly.</p><br/><p>Yao Sheng would not be too afraid of him as long as the other party had not truly reached the Dou Wang class, even if his opponent had the advantage of flying.</p><br/><p>Yao Sheng’s feet stood in the strange black water that covered the entire arena. He raised his head and looked at Xiao Yan in the sky before speaking with a cold smile, “I don’t believe that you can continue remaining in the sky. According to my knowledge, continuously displaying a Flying Dou Technique exhausts quite a lot of Dou Qi, right?”</p><br/><p>Xiao Yan hand tightly held the heavy ruler in the sky. His gaze glanced at the arena below as he frowned slightly. It was just as Yao Sheng had said. At this moment, the entire arena had completely turned into Yao Sheng’s domain. The moment he landed on the ground, he would be stuck to that strange black water. Xiao Yan may be able to isolate that corrosiveness, but its suction strength would hinder his speed to a varying extent. When facing an opponent who specialized in swift speed, like Yao Sheng, a slight reduction in speed may result in one being pressured into a disadvantaged position.</p><br/><p>Yao Sheng held the pair of dark-black daggers tightly. He smiled coldly as he watched Xiao Yan who was suspended in mid-air. He did not move his body even a little. Since Xiao Yan had the advantage of being in the sky, Yao Sheng’s attack range could not reach him. If he were to forcefully leap into the air and attack, then he would become the other party’s target board. Hence, remaining quiet during this kind of moment was the best choice.</p><br/><p>“It is indeed quite troublesome…” Xiao Yan slowly flapped the wings on his back as his body descended greatly. Green-colored Dou Qi formed a faint energy film on the surface of his body. The dark-black heavy ruler was also completely covered by Dou Qi. His gaze stared intently at Yao Sheng in the arena while a faint silver glow suddenly formed under his feet. An instant later, the wings on his back flapped, borrowing the wind’s strength. The ‘Three Thousand Lightning Movement’ was unleashed to its limit. It came to the point where other than a few people, the remaining people could only see Xiao Yan’s body trembling before leaving behind a partially visible afterimage in the sky.</p><br/><p>The sudden spike in Xiao Yan’s speed caused Yao Sheng’s expression to change slightly. Before Xiao Yan had arrived in person, the force from his speed had already struck, causing the black water on the ground to fly up.</p><br/><p>A vague black shadow suddenly appeared in Yao Sheng’s eyes. His leg moved slightly and his body appeared like it was ice-skating as he teleported over the black water. As his body moved, the heavy ruler that contained a sharp rushing wind sound also nestled close to him as it came heavily shearing down while carrying a wave of fiery pain.</p><br/><p>When the hacking of the heavy ruler missed, the direction of its strength changed nearly instantly, forcefully stopping the downward hacking motion. The ruler was twisted and the hacking motion changed to a sweeping one that cut toward Yao Sheng’s waist.</p><br/><p>The degree of response that Xiao Yan used to change his attack far exceeded Yao Sheng’s expectations. Hence, when the heavy ruler changed direction, Yao Sheng’s entire body was covered with cold sweat. In this critical moment, his legs on the black water appeared to have slipped without thought, causing his body to fall backward. The moment he heavily fell on the water, he cleverly avoided the heavy ruler.</p><br/><p>As Yao Sheng’s body landed in the black water, not only did he not receive even the slightest bit of resistance but he also ended up just like a fish in water. His body lay in the water and flashed in a strange manner. Immediately, he appeared under Xiao Yan who was less than two meters from the ground. Both his arms shook and the dark-black daggers were just like poisonous snakes, carrying a dense, cold wind as they pierced at Xiao Yan’s chest.</p><br/><p>“Bang!”</p><br/><p>The moment that the dagger were about to reach Xiao Yan’s body, a powerful invisible wind suddenly pressed down. While being blocked by this wind, Yao Sheng’s attack paused momentarily. On the other hand, Xiao Yan borrowed this pushing force and once again leaped into the air, escaping from Yao Sheng’s attack range.</p><br/><p>“Chi!” Yao Sheng involuntarily twitched the corner of his mouth. He let out a scoffing sound after he ended up missing his chance to attack, which were difficult to come by.</p><br/><p>During the fight that occurred in a split second, both Xiao Yan and Yao Sheng had once again finished one round of dangerous encounters. Both parties respectively had a pair of wings and great agility atop the black water and they had an approximate understanding of each other's speed. The eyes of everyone outside of the arena were burning with passion because of this exciting fight.</p><br/><p>“This fellow appears to not be affected by the suction force of the black water. Instead, he is even more agile, just like a fish entering water.” Xiao Yan softly muttered as he knit his brows and watched Yao Sheng, who was nestled close to the black water. The strange agility that Yao Sheng had displayed on the black water earlier had exceeded his expectations. If he had not displayed the ‘Fire Palm’ at the last crucial moment to shock the air and unleash a wind to slow down the opponent’s attack, it was likely that he would have received some injuries in this exchange to test each other out.</p><br/><p>“Looks like I must deal with this black water. Otherwise, this fellow’s attack strength soars by over twenty percent while on it.” A thought swiftly rotated within Xiao Yan’s heart as his eyes flickered, “No matter how strange this black water is, it ultimately possesses the properties of water. As long as it is water, I am not afraid that I will not be able to vaporize all of it!”</p><br/><p>Xiao Yan did not have the slightest hesitation as this thought flashed across his heart. His ten fingers flicked gently and threads of extremely tiny green-colored flames immediately flashed out from the tips of his fingers. Following the appearance of these flames, the temperature of the arena soared greatly.</p><br/><p>Yao Sheng eyed the ten plus wisps of scattered green-colored flames in the sky from within the arena. His expression changed slightly. This was especially so when his gaze swept over the cold smile on the corner of Xiao Yan’s mouth. His heart sank slightly after that.</p><br/><p>“Go!”</p><br/><p>Xiao Yan flicked his fingers while floating in the air. Immediately, the ten plus wisps of tiny flames shot down.</p><br/><p>Yao Sheng’s body twisted and swiftly dodged when he sensed the green-colored flame fly over.</p><br/><p>However, these flames were not directed at Yao Sheng. Instead, they lingered around half a foot on top of the arena, swiftly shuttling around. Such a close distance interaction caused the black water, which was spread over the ground, to swiftly dry up at a rate visible to the naked eye. The water couldn’t withstand the frightening temperature of the ‘Green Lotus Core Flame’.</p><br/><p>Quite a number of people on the tall platform exclaimed quietly as they eyed the diminishing black water. It was unexpected that Xiao Yan would use this kind of method to restrain Yao Sheng’s ‘Black Water World’. Although this kind of method could not be considered to be rare, it was extremely effective. There was no lack of people among them who had exchanged blows with Yao Sheng before. However, without a Flying Dou Technique, they were unable to fly into the sky and dodge when faced with this extremely troublesome ‘Black Water World’. Hence, they could only forcefully resist the suction force and the corrosive strength. However, by fighting while being distracted, it was only a matter of time before Yao Sheng used his speed to wear one down unless Yao Sheng’s opponent’s strength far surpassed Yao Sheng.</p><br/><p>“Ke ke, Xiao Yan’s tactics really do cause one’s eyes to become dizzy. It is likely that Yao Sheng, who has lost the effect of ‘Black Water World,’ will be suppressed by Xiao Yan in terms of speed.” Lin Xiu Ya could not resist laughing as he watched the black water in the arena that had been reduced by half.</p><br/><p>“He is the only one who can use this technique. That ‘Black Water World’ is the coagulation of Yao Sheng’s Dou Qi and some special poisonous liquid. An ordinary flame would have difficulty dealing with it.” Han Yue nodded slightly as he spoke.</p><br/><p>“That flame is indeed very troublesome…” Lin Xiu Ya’s gaze glanced at the wisps of fire-serpent-like green-colored flames that were randomly scurrying about. A solemness flashed across his eyes.</p><br/><p>Liu Qing frowned as he eyed the swiftly reducing black water within the arena from the other side of the high platform. He shook his head and said in a deep voice, “Yao Sheng is in trouble…”</p><br/><p>Anxiety immediately flashed across Liu Fei’s pretty face by the side when she heard this. She was about to stand up and shout when Liu Qing’s expression sank. He cried out in a low voice, “Sit down. Just how do you think you look like by shouting when watching a match?”</p><br/><p>Liu Fei could only return to her seat filled with grievances when she was scolded by Liu Qing. She used her vicious gaze to stare at Xiao Yan who was suspended in mid-air while she muttered a curse, “All he does is just rely on a Flying Dou Technique. What is there to be proud about?”</p><br/><p>“As long as it is able to defeat his opponent, it can not be considered a trick. A match where one sets all sorts of rules is nothing but a sparring between children. In a real life and death match, the dead person does not have a chance to raise a dispute.” Liu Qing replied faintly. His gaze that was glancing at the arena suddenly solidified as he sighed, “Yao Sheng’s ‘Black Water World’ can be considered to have met its nemesis.”</p><br/><p>As Liu Qing’s words sounded, the final cluster of black water in the arena was turned into nothingness under the circling flames and the furious green expression of Yao Sheng.</p><br/><p>Xiao Yan beckoned with his hand in the sky. The ten plus wisps of green-colored flame, which had become a lot smaller, were withdrawn back into his body. He faintly eyed the furious green face of Yao Sheng before flapping the pair of wings on his back. The heavy ruler in his hand was once again wrapped by powerful Dou Qi...</p><br/><p>“Next, I want to see just what tactics you have left.”</p><br/>\n</div>"}