{"title": "Chapter 571: Scroll", "id": 571, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-571-scroll", "volume_title": "Volume 6", "body": "<h1>Chapter 571: Scroll</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 571: Scroll</u></strong></p><br/><p>The moon was like a silver plate as faint moonlight scattered down from the sky, covering the entire Inner Academy in a layer of obscure silver yarn-like cover.</p><br/><p>Xiao Yan sat cross-legged on the bed within his room training continuously. Threads of energy surfaced from his natural surroundings before finally pouring unceasingly into his body.</p><br/><p>“Xiao Yan ge-ge, are you asleep?” A soft knock suddenly appeared after the training progressed for nearly an hour. Xun Er’s gentle voice was immediately transmitted into the room.</p><br/><p>Xiao Yan slowly opened his eyes and glanced with uncertainty toward the door before speaking with a smile, “Come in.”</p><br/><p>The door emitted a sound as it was pushed open and a green-clothed young lady slowly walked in. Under the reflection of the faint moonlight from the window at her side, her elegant and beautiful face caused others to involuntarily revel in it.</p><br/><p>The young lady’s tall body stood prettily in front of Xiao Yan. The faint delicate fragrance that came floating over caused Xiao Yan to feel a throbbing in his heart. Without realizing it, that small follower who had wondered about behind him back then had now become watery and moving.</p><br/><p>Xiao Yan came down from the bed. His gaze stared at her exquisite watery-like spring pupils. His gaze had quietly become a little passionate as he gently asked, “Is there something?”</p><br/><p>A shallow redness surfaced over Xun Er’s white delicate face as she appeared to have sensed the fiery passionate gaze being transmitted from Xiao Yan’s eyes. This little girl’s appearance was completely different from the indifferent manner she usually displayed. It could not be denied that Xun Er possessed extraordinary charm at this moment.</p><br/><p>The fiery passion in Xiao Yan’s eyes gradually became increasingly richer. A man and a woman in a room alone in the dead of night appeared to easily provoke a person into thinking of things that were not proper.</p><br/><p>As Xiao Yan’s eyes grew increasingly passionate, the embarrassed redness on Xun Er’s face also became much richer. A moment later, she suddenly took out a black-colored scroll from her storage ring and stuffed it into Xiao Yan’s hands. After which, she turned around and fled. However, Xiao Yan’s hand and eyes were fast as he grabbed the latter’s clean white jade-like wrist and pulled slightly. Under the young lady’s exclamation, Xiao Yan pulled her into his embrace.</p><br/><p>The lovely body knocked into Xiao Yan’s hug. As she sensed the warmth that was transmitted over from beyond her clothes, the bashful redness on Xun Er’s face could basically spill water. After quietly struggling for a moment, she could only give up a pointless resistance as her voice became as tiny as a mosquito, “Don’t.”</p><br/><p>Xiao Yan’s hand quietly hugged her narrow waist, which could not even support one full embrace. That comfortable feeling of contact caused Xiao Yan’s heart to be filled with joy. He lowered his head and eyed Xun Er, who was bashfully red. He teasingly said, “I say… girl, you have come to my room in the middle of the night. Tell me honestly. What is your motive?”</p><br/><p>“The thief that cries thief.” Xun Er raised her brows and softly muttered.</p><br/><p>Xiao Yan eyed her small pouting mouth which revealed a little woman’s grieved manner. His hand which was hugging her delicate waist involuntarily tightened. A hand lifted her smooth chin as his gaze overflowed with a thread of desire. He eyed her mouthwatering, little, sleek, red mouth under Xun Er’s widened watery eyes. His head slowly lowered.</p><br/><p>“Xiao… Xiao Yan ge-ge. You must keep this thing well.” The face of Xun Er, who clearly knew what Xiao Yan wanted to do, expressed a redness that was becoming increasingly richer. Her heart beat rapidly. When the other party’s breath pounced on her face, she suddenly took the black-colored scroll that she had just stuffed into Xiao Yan’s hand and hurriedly lifted it. She coincidentally blocked the space between their two faces, which were about to make contact with each other.</p><br/><p>Xiao Yan could only cease his movement after being blocked by the scroll. He extended his hand, and took the black-colored scroll.</p><br/><p>Xun Er sighed in relief only after sensing Xiao Yan’s actions. However, besides sighing in relief, there appeared to be a hesitant feeling in her heart.</p><br/><p>Just as Xun Er’s gaze was flickering, Xiao Yan, who had received the scroll, randomly stored it into his storage ring. His hands softly held Xun Er’s face under her stunned gaze. After which, a face that carried a smile swiftly magnified in her eyes.</p><br/><p>The two faces that contained embarrassment and a smile swiftly approached each other within this quiet room. After which… they touched.</p><br/><p>A pair, a tall man and woman were in a tight embrace under the moonlight. Each of them released the fiery passion within their hearts.</p><br/><p>The kiss between the two of them was somewhat unfamiliar and awkward. However, for a man and woman who had tasted the forbidden fruit for the first time, it was undoubtedly the most ecstatic moment of their lives.</p><br/><p>The faces which touched took a long while before they parted. When they finally did, they both carried a heavy panting sound.</p><br/><p>Xiao Yan licked his mouth and lowered his head to eye the young lady in his embrace. His heart which had originally quieted a little immediately leaped wildly.</p><br/><p>At this moment, threads of black hair dangled in front of the forehead of the young lady in his embrace. Her pupils, which were always filled with a smile for him, appeared to contain a little feeling of love. Those pupils were like waves of spring water, which contained a bewitching feeling amid her purity. Under this attraction, Xiao Yan could even sense a fiery heat gradually brewing within Xiao Yan’s lower abdomen.</p><br/><p>The bodies of these two people were basically stuck together. Hence, Xiao Yan had merely displayed a slight action when Xun Er, who was snagled weakly in his embrace, fled like a shocked deer. She hurriedly stepped away from Xiao Yan’s embrace and said with an embarrassed red face, “Xiao Yan ge-ge, don’t be a rogue.”</p><br/><p>Xiao Yan laughed when he saw Xun Er in this manner. He could only withdraw the desire in his heart. Once again, he licked his mouth and savored the ecstatic softness earlier. A smile at the corner of his lips involuntarily expanded.</p><br/><p>Xun Er’s face was bright red upon seeing this proud manner of Xiao Yan. She viciously rolled her eyes at him. However, after experiencing such intense emotions, even this dirty look appeared exceptionally bewitching.</p><br/><p>Xiao Yan once again smiled. He was also someone who would leave things be. He knew that this girl was a little too shy over that manner. Therefore, he ceased teasing and lazily sat on a soft chair in one corner. He randomly took out the black-colored scroll that Xun Er had handed over earlier. His eyes drifted over it, only to have the surprise on his face become denser.</p><br/><p>The scroll was completely black in color but its luster was extremely dark and solemn. If one were to look at it carefully, one would even be able to discover that this scroll emitted an extremely faint black glow. Moreover, various kinds of unusual lines were drawn above the scroll. They wrapped all around, just like ‘tadpole writing’ (Yi Script), which was complex and unpredictable.</p><br/><p>TL: tadpole writing (Yi Script) - a complex form of ancient writing which looks somewhat like tadpole.</p><br/><p>The black-colored scroll flipped over his hand. Xiao Yan was once again stunned to realize that the substance the scroll was created with was a little strange. There was not a spot where one could open it. Its entire body was just like a bamboo scroll and was completely different from an ordinary scroll.</p><br/><p>“What is this?” Xiao Yan raised his head doubtfully as he waved the scroll in his hand toward Xun Er and asked.</p><br/><p>At this moment, the flush redness on Xun Er’s face became much paler. However, there was still a little embarrassment visible. She took repeated steps and gently shifted to Xiao Yan’s side before smiling while saying, “A scroll containing a Dou Technique. However, one must be at the Dou Wang class before one can open it.”</p><br/><p>Xiao Yan’s hand trembled upon hearing this. He nearly dropped the scroll in his hand onto the ground. A Dou Technique that required the strength of a Dou Wang before it can be opened? This was something that he had met for the first time…</p><br/><p>“What class is this Dou Technique?” The smile on Xiao Yan’s face gradually withdrew as he inquired seriously.</p><br/><p>“Won’t Xiao Yan ge-ge know when you open it?” Xun Er shook her head and avoided Xiao Yan’s question.</p><br/><p>“This thing… is too valuable…” Xiao Yan knit his brows. However, before he had finished speaking, a pair of resentful eyes were shot over from his side, causing him to stop his mouth in an awkward manner.</p><br/><p>“Since we were children, Xiao Yan ge-ge has never accepted anything from Xun Er.” Xun Er softly sighed.</p><br/><p>“Alright, alright, I will accept it…” Xiao Yan laughed bitterly upon seeing Xun Er’s resentful manner. He hesitated for a moment and nodded his head. He was an alpha male, and it was difficult for him to accept it in short notice when Xun Er suddenly took out something this extraordinary.</p><br/><p>“Remember, you must wait until you enter the Dou Wang class before you can open it and practice it. Otherwise, it will end up being detrimental to you instead,” Xun Er reminded in a soft voice. Her resentful face immediately revealed a beautiful smile when she saw that Xiao Yan had accepted the scroll.</p><br/><p>“Yes.” Xiao Yan nodded his head. His eyes were shining as he studied the green-clothed young lady opposite of him.</p><br/><p>Xun Er’s pretty face stared intently at Xiao Yan. After which, she said in an extremely serious low voice, “Additionally, Xiao Yan ge-ge, you must definitely remember Xun Er’s words regarding the ‘Tou She Ancient God’s Jade’. Otherwise, you will end up in extremely great trouble. Now, you still do not have the strength to possess it. Hence, you must definitely not leak news about it!”</p><br/><p>Xiao Yan did not dare to joke as he eyed the serious manner of Xun Er. He simply nodded gently.</p><br/><p>“Ke ke, in that case, Xun Er will return to my room first. Xiao Yan ge-ge, have a good rest. There is still a great intense battle tomorrow.” Xun Er gave Xiao Yan a sweet smile after saying this before immediately walking out of the door.</p><br/><p>Xiao Yan frowned slightly as he watched Xun Er’s back which had disappeared. For some unknown reason, he kept having the feeling that the recent Xun Er was a little strange, repeatedly leaving instructions for some things...</p><br/><p>“Perhaps I am thinking too much?” Xiao Yan moved his hand after shutting the door. The black-colored scroll once again appeared in his hand. In a deep voice, he asked, “Teacher, can you see what kind of skill is in this scroll?”</p><br/><p>“No, there is a special seal on top of the scroll. One has to forcefully break it open, otherwise, no one will know what Dou Technique is inside.” Yao Lao’s voice sounded not long later, “However, with that identity and background of this little girlfriend of yours, a Dou Technique that causes her to attach such importance to is definitely not an ordinary thing.”</p><br/><p>Xiao Yan nodded quietly. A flicker slowly flashed in his eyes before he finally let out a soft sigh.</p><br/><p>......</p><br/><p>“Xiao-jie, you have given that thing to Young Master Xiao Yan?” Ling Ying was somewhat stunned as he eyed the young lady in front of him within a room that contained a delicate fragrance. Those watery eyes of hers still revealed a faint embarrassment that was difficult to sense.</p><br/><p>Xun Er merely randomly nodded her head in the face of Lin Ying’s question. That manner was as though the thing that she had gave was merely an ordinary item.</p><br/><p>“That is something that the clan head took great pains to…” Ling Ying smiled bitterly as he spoke. This generosity…</p><br/><p>“Xiao Yan ge-ge is more suitable for it than me.” Xun Er replied with a faint smile. She immediately waved her hand and said, “Old Ling, don’t let others know about this matter. Even father cannot know.”</p><br/><p>“This… alright.” Ling Ying merely hesitated for a moment before sighing helplessly. His body immediately twitched, turning into a shadow that disappeared into the darkness.</p><br/><p>“Xiao Yan ge-ge, Xun Er has done all that she can do. It is up to you to navigate the path of a strong person. Hopefully, when we meet again in the future, you will be able to become a truly strong person. So strong that Xun Er could only look up to you.” Xun Er held the warm tea cup as her soft words quietly sounded within her heart.</p><br/>\n</div>"}