{"title": "Chapter 573: The Contest Between The Novice Dark Horse And A Veteran Expert", "id": 573, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-573-the-contest-between-the-novice-dark-horse-and-a-veteran-expert", "volume_title": "Volume 6", "body": "<h1>Chapter 573: The Contest Between The Novice Dark Horse And A Veteran Expert</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 573: The Contest Between The Novice Dark Horse And A Veteran Expert</u></strong></p><br/><p>Everyone on the tall platform looked at each other. It was really unexpected that the biggest dark horse would meet a true tiger that would block his path at such a critical juncture. It was likely that only Zi Yan and Lin Xiuya possessed the strength to fight Liu Qing in the Inner Academy. Although Xiao Yan’s performance in the two battles earlier had been impeccable, there was undoubtedly still an extremely large gap when compared to a true peak expert on the ‘Strong Ranking’ like Liu Qing.</p><br/><p>“This Xiao Yan can be considered to be unlucky…” Yan Hao sighed as he spoke to Lin Xiuya beside him.</p><br/><p>Han Yue also knit her brows slightly. Although she already held a high opinion of Xiao Yan’s strength, she had no choice but to admit that there was still a big gap when one truly compared him with a strong person like Liu Qing.</p><br/><p>Lin Xiuya’s expression was calm. No one knew what he was thinking. It was a long while later before he softly spoke, “We should come to the conclusion after the match. Although I also think that the chances of Xiao Yan losing are high, I also cannot deny that he similarly has some chance of victory. His match with Liu Qing, ugh… it is difficult to say.”</p><br/><p>The few people by his side nodded slightly. Their gazes involuntarily swept toward Liu Qing’s position. At this moment, the forehead of the latter also displayed extremely faint surprise. However, he did not reveal too much of an emotional fluctuation. His mind was calm, appearing similar to Lin Xiuya.</p><br/><p>Compared to Liu Qing’s calmness, Liu Fei beside him had nearly involuntarily leaped up and cheered loudly. The defeat of Yao Sheng at Xiao Yan’s hands yesterday had caused her to hold back a stomach full of anger. Originally, she was cursing Xiao Yan in hope that he would meet her brother Liu Qing in the competition, but it was really unexpected that the latter was really this unlucky to collide with Liu Qing in this most crucial match. This pleasant surprise that had suddenly appeared caused her to proudly spit out a word in her heart: “Retribution.”</p><br/><p>“Ugh.” Wu Hao patted Xiao Yan’s shoulders somewhat helplessly. He wanted to say something only to realize that he had nothing to say. He could only let out a sigh.</p><br/><p>“Hey, Xiao Yan, why don’t I help you beat up Liu Qing until he cannot turn up for the match? That way, you can advance directly.” Zi Yan swung her purple-colored ponytail as she waved her fist toward Xiao Yan and said.</p><br/><p>“Please, can you have a little more confidence in me?” Xiao Yan shook his head with a bitter smile. He rubbed Zi Yan’s head and looked all around him, discovering that with the exception of Xun Er, the expressions of the others were somewhat solemn. He could not help but laugh helplessly, “Although my opponent is Liu Qing, you all don’t need to show this kind of wailing manner, no? The match has yet to even begin.”</p><br/><p>Wu Hao and the others could only forcefully smile when they heard this. They knew just how importantly Xiao Yan viewed the top ten positions. Now that such an event, that left one helpless, had appeared at the most critical juncture, it was likely that Xiao Yan was also extremely frustrated.</p><br/><p>Xiao Yan did not know whether to laugh or cry as he eyed these people who appeared even more dispirited than him. Although Liu Qing was very strong, no one knew who would end up victorious if they were to really go all out and fight. If he were to completely unleash everything with his current strength, forget about an elite Dou Wang, Xiao Yan would even be able to cause a Dou Huang to be in an extremely miserable state. After all, once a true large-scale ‘Angry Buddha Lotus Flame’ was unleashed, the destructive force that caused even Yao Lao to be extremely shocked was not something simple.</p><br/><p>Of course, the side-effect of a large-scale ‘Angry Buddha Lotus Flame’ was far too great. Unless it was a life and death situation, Xiao Yan would not easily use it. This thing was also his true last hidden trump card.</p><br/><p>The private conversations in the stadium continued for awhile before everyone once again threw their gazes back to the judges’ seats.</p><br/><p>Su Qian’s gaze slowly withdrew from the spot where Xiao Yan was at. In his heart, he could only hope that this young man, who controlled a ‘Heavenly Flame’ at such a young age, would once again be able to display a miracle and charge into the top ten even after being blocked by a strong person like Liu Qing.</p><br/><p>“The first match, Yan Hao, Qian Mo!”</p><br/><p>As Su Qian’s soft cry sounded, the atmosphere in the stadium suddenly turned away from Xiao Yan’s misfortune. Numerous gazes were thrown toward those two fellows on the tall platform.</p><br/><p>Yan Hao was the first to stand up under the eyes of all the people. The expression of this man whose figure was not any thinner than Liu Qing did not change as he walked to the edge of the tall platform. After which, he leaped down and landed heavily in the arena.</p><br/><p>Once Yan Hao entered the arena, that somewhat fat Qian Mo also helplessly stood up. After which, the fat on his entire body shook as he came to the edge of the tall platform. The muscles on his body shrank and a faint wind agglomerated around his body. Immediately, that large body slowly drifted down into the arena like a balloon in front of the stunned audience.</p><br/><p>“He actually practices wind affinity Dou Qi…” Countless of people involuntarily wiped their cold sweat. The elegant and agile wind affinity Dou Qi really had a completely different feeling to it when it was used by this person in this manner.</p><br/><p>Although his other appearance was not too elegant, everyone understood in their hearts that a person who was able to occupy a spot in the top ten of the ‘Strong Ranking’ was a person with extremely frightening strength. One would definitely lose some blood if one were to judge a book by its cover.</p><br/><p>The atmosphere in the viewing gallery immediately became fiery hot as the two people entered the arena. The two of them were existences within the top ten on the ‘Strong Ranking’. It must be said that this fight could be considered to be extremely exciting.</p><br/><p>After a soft, ‘let the match begin’ by Su Qian, the two people in the arena immediately drew their weapons. Yan Hao’s weapon was still that dark-black enormous metal hammer while Qian Mo bared a circular sawtooth golden-colored item from his storage ring under everyone’s stunned gazes. The circular yellow-colored sawtooth disc was merely the size of a palm. However, the numerous sharp sawteeth on its edge faintly contained a cold penetrating glow.</p><br/><p>“It is rumored that this weapon of Qian Mo is called Golden Sawtooth Disc. It has shocking momentum when thrown. Moreover, it is extremely accurate and vicious. If ten of these Golden Sawtooth Discs were to be thrown out together, it would be something that would really cause one to have a headache.” Wu Hao softly spoke to Xiao Yan from the side.</p><br/><p>“Oh?” Xiao Yan lifted his brows in a somewhat interested manner. He did not expect that this fatty actually had such an unexpected tactic. It appeared that those who were able to enter the top ten did indeed have some skill.</p><br/><p>Qian Mo cupped his hands toward Yan Hao while the viewing gallery was engaged in waves of private conversations. He laughed dryly, “Big brother Yan, you must be a little gentler when you strike. If that black metal hammer of yours were to smash down, this body of mine would immediately become a pile of mince meat.”</p><br/><p>“Don’t give me that nonsense. Fat Qian, it has been a long time since I met you. I wonder just how much stronger that Golden Sawtooth disc is compared to the past?” Yan Hao scolded with a smile. He waved the black metal hammer in his hand. The sharp rushing sound of wind created caused the people in the viewing platform around to involuntarily cover their ears.</p><br/><p>The fat flesh on Qian Mo’s face twitched as he laughed out loud. His expression immediately became solemn as he held a golden sawtooth disc in his right hand. Dense Dou Qi surged out explosively from his body as waves of rotating wind formed around him. Finally, it agglomerated into the sawtooth disc under the former’s control.</p><br/><p>“Hah!”</p><br/><p>A low voice suddenly sounded. Qian Mo’s hand suddenly trembled and the golden sawtooth disc flickered and emitted a golden light, much like a golden bolt of lightning. It shot explosively toward Yan Hao.</p><br/><p>The golden-colored disc’s speed was so quick that it was terrifying. Everyone could vaguely see a golden-colored line flash across their eyes when the lightning struck Yan Hao.</p><br/><p>“Bang!”</p><br/><p>The dark-black metal hammer viciously smashed against the ground. Immediately, a thick arm-sized crack line swiftly spread on the ground. Waves of extremely powerful dark-yellow energy shot out from the crack lines and coincidentally struck the golden-yellow lightning, smashing it until it charged directly into the sky.</p><br/><p>“Again! There are still nine cycles of the ‘Ten Cycle Qian’... Ha ha!” Yan Hao laughed out loud. The Dou Qi in his body flowed swiftly. The skin on the surface of his body had turned into a rock-like state at this moment, emitting a grayish-white color.</p><br/><p>Qian Mo laughed bitterly and sighed. Yan Hao’s Dou Qi belonged to the ground affinity type. Moreover, it was the extremely rare rock Dou Qi. This kind of Dou Qi would enable the practitioner's body to turn as hard as rock, which coincidentally restrained his golden sawtooth discs.</p><br/><p>“Qian Mo is suppressed by Yan Hao both in terms of strength and affinity. It looks like it is very difficult for him to be victorious. Moreover, using the golden sawtooth discs consumes a lot of Dou Qi. With his strength, he is merely able to display ten strong attacks. Hence, Qian Mo also has a nickname within the Inner Academy called ‘Ten Cycle Qian’.” Wu Hao appeared like a commentator as he repeatedly explained to Xiao Yan the various names that the latter had not heard of.</p><br/><p>Xiao Yan nodded slightly. These kinds of golden sawtooth discs were not very suitable for this kind of open competition. The place where its entire strength could be displayed should be when it was used as a sneak attack. Just imagine, if one or two such golden sawtooth discs were to be shot out suddenly and unexpectedly from a corner when one was walking in the mountain forest, would it not cause one to have a headache and be frightened?</p><br/><p>Qian Mo was also clear of his own weakness within the arena. However, he did not have any other choice. Back then, his teacher had already said that if he were to become an assassin, it was likely that he would fare very well. However, if he were to face a fight head on, his fighting strength would be greatly reduced.</p><br/><p>One after another, incomparably sharp golden sawtooth discs shot out explosively from Qian Mo’s hands in a lighting-like manner. However, regardless of how tricky he was, they did not have much of an affect on Yan Hao. This was because the latter had basically used all his Dou Qi on his defense. Even if Yan Hao was occasionally unable to block a disc, the sharp golden sawtooth discs would merely leave behind a long pale-white scar on his body.</p><br/><p>Although using all his Dou Qi to defend in this manner was extremely exhausting, it was much better when compared to Qian Mo’s usage of the golden sawtooth discs. Therefore, this battle of the two of them was basically fighting to see whose Dou Qi was more powerful…</p><br/><p>This fight where one party was attacking and the other party was defending may be extremely interesting in the eyes of some ordinary students, but it was somewhat boring for Xiao Yan and the others. This was because all of them knew that Qian Mo had already descended into a disadvantage in this match. This was because the full force of his attack was unable to break the full strength of Yan Hao’s defense.</p><br/><p>After the match continued for nearly half an hour, Qian Mo finally helplessly waved his hands. He stored the last two golden sawtooth discs in his hands away and obediently admitted defeated in front of the stunned gazes all around him.</p><br/><p>Qian Mo’s admission of his loss was within the expectations of Xiao Yan and the others. After waiting for a short while, the second match also followed.</p><br/><p>Zi Yan vs. Qin Zhen. A match where the disparity of strength was even greater...</p><br/><p>Zi Yan flashed and entered the arena at the first opportunity. Yesterday, her heart was filled with a fiery anger because of that Dou Huang class Magical Beast. Now, she anxiously needed someone to help vent her anger. Therefore, the moment she entered the arena, she drew up her sleeves. Her dark-black large eyes viciously swept over the tall platform.</p><br/><p>The many people on the tall platform shrank their necks as they eyed this manner of Zi Yan. Their hearts repeatedly mourned for Qin Zhen.</p><br/><p>However, Qin Zhen did not show himself after Zi Yan had descended into the arena. Just as everyone became somewhat impatient, a weak voice finally sounded, “Qin Zhen said that he has a stomachache and cannot participate in the competition…”</p><br/><p>The entire stadium was silent. Immediately, they felt at a loss. This… was too comical, no?</p><br/><p>Xiao Yan and the others rubbed their somewhat stiff faces. Just what did Zi Yan do in the past? She actually caused all these experts on the strong ranking to be this worried or even fearful...</p><br/><p>Su Qian and the other Elders also helplessly shook their heads. However, they did not blame anyone. They similarly clearly understood that Zi Yan was basically a monster-like existence on the ‘Strong Ranking’. Even someone like Lin Xiuya and Liu Qing would not dare to pluck the tiger’s whiskers, much less anyone else.</p><br/><p>“*Cough*... since Qin Zhen has admitted defeat, let’s start the last fight for the top ten position.” Su Qian stood up, let out a cough before immediately speaking in a slow manner.</p><br/><p>As Su Qian words fell, the numerous gazes in the stadium immediately turned to the tall platform. Finally, they stopped on Xiao Yan’s and Liu Qing’s bodies.</p><br/><p>The third match today was likely the one everyone anticipated the most.</p><br/><p>The contest between the novice dark horse and the veteran expert.</p><br/>\n</div>"}