{"title": "Chapter 582: Advancement of Strength", "id": 582, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-582-advancement-of-strength", "volume_title": "Volume 6", "body": "<h1>Chapter 582: Advancement of Strength</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 582: Advancement of Strength</u></strong></p><br/><p>Xun Er quietly sat to one side in the quiet secret chamber. Her delicate hand held her cheeks and under her green-colored sleeves revealed snow-white wrists. A pair of bright treasure-like pupils used the little, gentle light to stared at Xiao Yan, who was sitting in a cross-legged manner with his eyes tightly shut.</p><br/><p>It had been five days since the ‘Strong Ranking’ Grand Competition. However, Xiao Yan had still not shown any traces of waking up from his training. This caused Wu Hao and the others to be quite worried. They had suggested forcefully waking the former up from his training state a couple of times, but they were all stopped by Xun Er. With her eyesight, she was naturally able to sense that the Dou Qi in Xiao Yan’s body was surging by the day. By the time he truly awoke, his strength would definitely advance greatly from the time when he was seriously injured. If he was woken up at this time, it would undoubtedly mean that he would lose this excellent advancement opportunity.</p><br/><p>“Looks like there are no results today…” Xun Er sighed gently again after seeing that Xiao Yan still did not have any trace of waking up despite having waited for a long time. She muttered before standing up, preparing to leave.</p><br/><p>However, the moment that Xun Er had stood up and was about to leave, a strange energy ripple suddenly surged within the secret room. Immediately, the former’s pretty face became joyous. Her gaze suddenly turned toward Xiao Yan.</p><br/><p>Not long after the ripple was emitted, a powerful aura suddenly surged out from Xiao Yan’s body, whose eyes were still tightly shut. This aura soared repeatedly, and in an extremely short amount of time, it had exceeded the aura of Xiao Yan at his peak. Moreover, it was still continuing to climb.</p><br/><p>Joy surfaced on Xun Er’s face as she sensed the aura that was swiftly climbing. It was indeed as she had guessed. Xiao Yan had been repeatedly absorbing an extremely large amount of energy into his body for the past couple of days. Now, under the assault of that large amount of energy, the barrier between the levels were easily destroyed.</p><br/><p>The sudden soaring of the aura continued for a full five minutes before the increase finally came to a gradual stop. A moment later, an energy ripple suddenly spread out from Xiao Yan’s body before finally colliding with the hard wall, shaking the secret room until it trembled.</p><br/><p>After the energy ripple surged out, the strange, sleek redness on Xiao Yan’s face gradually scattered until he recovered his usual color. His tightly shut eyes trembled slightly before finally being slowly opened to see Xun Er’s joyous gaze.</p><br/><p>As Xiao Yan’s eyes were slowly opened, a cluster of green flame abruptly shot out before shrinking back in a lightning-like manner and disappearing.</p><br/><p>“Hu…”</p><br/><p>Mottled air that contained some black color was expelled by Xiao Yan. The black air slowly rose before making contact with the tough ceiling. Immediately, it corroded a small hole in the ceiling under an extremely soft ‘chi’ sound. Xun Er’s brow were slightly knit when she witnessed this scene.</p><br/><p>A layer of pale luster surfaced on Xiao Yan’s face following the release of the mottled air. A joyous expression appeared without restraint on Xiao Yan’s face as he sensed that the Dou Qi in his body was more than a couple of times stronger than before.</p><br/><p>“Congratulations, Xiao Yan ge-ge. This serious injury has not only not left behind any seeds of trouble, but has instead allowed you to gain from misfortune. From the looks of your current aura, I think that your strength should be around that of a five star Dou Ling, no?” Xun Er parted her mouth and smiled as she saw the pleasant surprise all over Xiao Yan’s face.</p><br/><p>Xiao Yan sensed a little before nodding slightly. He smiled and said, “It should be around that of a five star Dou Ling.”</p><br/><p>Although Xiao Yan was pleasantly surprised at having advanced two levels in one go, he did not feel that it was too inconceivable. Other people might feel disbelief over his strength suddenly soaring by two stars, but he had some clues regarding it. Although this great battle was the primary instigating factor, an even greater reason was because his body had swallowed various medicinal pills and natural treasures. One example was the ‘Core Quenching Body Milk’ that he had consumed some time earlier. Although most of it was used to refine Xiao Yan’s body, there were still some remnant medicinal power that had seeped into various parts of his body. Due to Xiao Yan’s body having fallen into a completely exhausted state, that hidden medicinal power naturally and automatically seeped out. Besides helping him heal his injuries, it also gifted him with an enormous help in raising his strength.</p><br/><p>“But it seems that there are some problems within Xiao Yan ge-ge’s body?” Xun Er took repeated steps until she was beside Xiao Yan. Her bright pupils looked at the latter and probed with a serious expression.</p><br/><p>Xiao Yan was startled before immediately coming to a sudden understanding. It was likely due to her having witnessed that thread of black air earlier. Xiao Yan rubbed his head and said helplessly, “Back then, I helped Nalan Jie expel poison in order to obtain a medicinal ingredient. In the end, I got the poison into my body. However, it is fortunate that I have the protection of the ‘Heavenly Flame’, and that poison is unable to cause me any harm. Due to this, it has been hiding within my body, and I can only expel a little bit of it each time I advance my strength.”</p><br/><p>“Xiao Yan ge-ge is unable to settle it even with your alchemist skills?” Xun Er spoke in a somewhat startled manner.</p><br/><p>“This poison is a little extraordinary. Back then, Nalan Jie, whose strength was at the Dou Wang class, nearly ended up dying because of it. How would it be so easy to completely expel?” Xiao Yan shrugged his shoulders and replied.</p><br/><p>“Relax, it’s fine. As long as the ‘Heavenly Flame’ is in my body, that thing will have no effect.” Xiao Yan comforted. He immediately turned his body. He got down from the bed before twisting his body that had been sitting for a couple of days. A bone cracking sound immediately sounded in a sweet manner within the secret room, much like beans being crushed.</p><br/><p>“That’s right, what happened at the end of the ‘Strong Ranking’ Grand Competition? I should have entered the top ten right?” Xiao Yan suddenly recalled the most important matter and hurriedly asked.</p><br/><p>“Ke ke, relax. You have already entered the top ten although you are ranked last.” Xun Er curled her lips and smiled. She eyed Xiao Yan’s face, which appeared to have released a heavy burden, before immediately adding, “Liu Qing has also entered the top ten.”</p><br/><p>Xiao Yan was startled before he asked in a stunned manner, “In that case, who won?”</p><br/><p>“The First Elder says that it was a draw. Therefore, the both of you were allowed to enter the top ten together.” Xun Er spoke with a sweet smile.</p><br/><p>“So it’s like this… whatever. In any case, I don’t care how many people are in the top ten together as long as I am allowed to enter the depths of the ‘Blazing Sky Qi Refining Tower.” Xiao Yan nodded his head unconcernedly. He stretched his lazy waist before swiftly walking out of the secret room. He muttered, “My bones are about to rust after staying here for so long. Girl, let’s go and taste some fresh air…”</p><br/><p>Xun Er smiled when she heard this. She immediately nodded before following him.</p><br/><p>Quite a large commotion was created when Xiao Yan and Xun Er appeared in ‘Pan’s Gate’. During this period of time, rumors of Xiao Yan’s serious injuries being difficult to cure had been spread in the outside world. Although Xun Er and the others had refuted the rumors during this period of time, Xiao Yan not revealing himself these past few days had caused the members of ‘Pan’s Gate’ to feel some uncertainty. They were naturally filled with joy and excitement now that they saw a perfectly fine Xiao Yan with a complexion that was even better than before.</p><br/><p>Xiao Yan could not help but feel some surprise as he walked within ‘Pan’s Gate’. He discovered that there seemed to be even more members in ‘Pan’s Gate’ compared to before. Moreover, the overall atmosphere was also extremely high. As he walked, those numerous gazes that shot toward him from all directions were filled with respect and fear.</p><br/><p>“Hey, Xiao Yan, are you finally completely cured?” Lin Yan’s familiar voice suddenly sounded just as Xiao Yan was looking around him. Immediately, a human figure swiftly appeared by Xiao Yan’s side, revealing a face filled with joy as the former patted Xiao Yan’s shoulders.</p><br/><p>Xiao Yan smiled to Lin Yan. His gaze suddenly paused on the latter’s chest. An extremely familiar badge was being worn on that spot. Xiao Yan immediately had a stunned expression.</p><br/><p>“You… why are you wearing the badge for our ‘Pan’s Gate’?” Xiao Yan’s face was stunned.</p><br/><p>“Big brother Lin Yan has already joined our ‘Pan’s Gate’. Is there any problem with him wearing our badge?” Xun Er by the side could not control herself as she laughed.</p><br/><p>Xiao Yan stared dumbfoundedly. It was a long while later before he spoke with a strange face, “You, as a top ten expert in the ‘Strong Ranking’ are actually willing to lower yourself to join our ‘Pan’s Gate’?”</p><br/><p>“What, lower? The reputation of the current ‘Pan’s Gate’ is something that even Lin Xiuya’s ‘Wolf Teeth’ and Liu Qing’s ‘Splitting Mountain’ cannot contend with. Although they do have the presence of experts sitting there, ‘Pan’s Gate’ has more experts than them. Forget about the ‘Brute-Force Queen’ who remains here all day. Even you are able to contend with an expert like Liu Qing. Moreover, there is still Xun Er. Hee hee, even the ranked two Lin Xiuya was easily defeated by her? Who in this Inner Academy still dares to say that ‘Pan’s Gate’ is weak and easy to provoke?” Lin Yan laughed.</p><br/><p>“When did Xun Er defeat Lin Xiuya?” Xiao Yan was once again startled. His face showed surprise as he eyed Xun Er who was curling her mouth into a smile by his side.</p><br/><p>“It happened in the sparring matches after the ‘Strong Ranking’ Grand Competition was over. Tsk tsk, you didn’t see that scene. Lin Xiuya was defeated in Xun Er’s hands in less than ten minutes. At that time, everyone present appeared to have become dull.” Lin Yan waved his hand and laughed gloatingly.</p><br/><p>The shock in Xiao Yan’s eyes grew denser as Lin Yan spoke. He knew that Xun Er had definitely hidden her actual strength. However, he did not expect that she would be this strong when she truly erupted. That Lin Xiuya was an expert that could contend with Liu Qing. Xiao Yan had spent all his strength in order to defeat Liu Qing, only to end up with the both of them seriously injured. He did not expect that this girl would be able to defeat Lin Xiuya within a short ten minutes. That strength… was likely to have also reached the Dou Wang class, right?</p><br/><p>Xiao Yan involuntarily inhaled a breath of cold air as he thought of this possibility. This girl was really a little too frightening. Her current age appeared to be quite a lot younger than himself. A seventeen or eighteen year old Dou Wang? This kind of achievement was really able to cause those Elders within the Inner Academy to feel so inferior that they would cover their faces and weep.</p><br/><p>As this thought flew in Xiao Yan heart, he also came to a sudden understanding upon recalling the ancient faction behind Xun Er. It appeared that she could not be viewed ordinarily.</p><br/><p>Xun Er smiled gently, appearing to clearly understand the thoughts that lingered in Xiao Yan’s heart. Her delicate hand rubbed Xiao Yan’s arm. Which part of that extremely obedient manner was remaining from the cold manner that she had when challenging Lin Xiuya back then?</p><br/><p>Lin Yan smacked his mouth when she saw the gentle and obedient manner Xun Er adopted toward Xiao Yan. Even a battle crazy fellow like him could not help but feel envy surfacing in his heart. How many people in this Inner Academy could enjoy this blessing of the fairer sex?</p><br/>\n</div>"}