{"title": "Chapter 585: Entering the Lowest Level of the Blazing Sky Qi Refining Tower", "id": 585, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-585-entering-the-lowest-level-of-the-blazing-sky-qi-refining-tower", "volume_title": "Volume 6", "body": "<h1>Chapter 585: Entering the Lowest Level of the Blazing Sky Qi Refining Tower</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 585: Entering the Lowest Level of the Blazing Sky Qi Refining Tower</u></strong></p><br/><p>Xiao Yan coincidentally met both Wu Hao and Hu Jia the moment he returned to ‘Pan’s Gate’. The two saw the former’s gloomy face and looked at each other. They did not understand who had angered this fellow whose face always carried a smile.</p><br/><p>Their gazes drifted toward Xiao Yan’s back. Hu Jia appeared to have discovered something as she involuntarily asked in a soft voice, “Where is Xun Er?”</p><br/><p>Xiao Yan slowly sighed and replied, “She left.”</p><br/><p>“Left?” Wu Hao and Hu Jia were immediately stunned when they heard this. Their faces were immediately filled with surprise, “Where has she gone to? When will she be back?’</p><br/><p>“She has returned to her clan. It is likely that she will not return again in the future.” Xiao Yan’s footsteps paused at the main entrance and spoke in a faint voice. He immediately pushed the door and entered. After which, the door emitted a ‘bang’ and was heavily shut.</p><br/><p>Wu Hao and Hu Jia stared blankly at the tightly shut main entrance. It was a long while later before they sighed in a somewhat desolate manner. After having gotten along for so long, nearly everyone within ‘Pan’s Gate’ had nothing but esteem and respect toward that young lady who always carried a gentleness and a smile. It was natural that their hearts felt as though something was lacking now that they heard she had left.</p><br/><p>“Ugh, it is likely that the emotions of quite a number of ‘Pan’s Gate’ members will fall if this news is released.” Hu Jia sighed.</p><br/><p>Wu Hao nodded with a bitter smile. He spoke softly, “No wonder I kept having the feeling that Xun Er was a little strange recently. She was actually about to leave.”</p><br/><p>“It is likely that Xiao Yan doesn’t feel good in his heart.” Wu Jia helplessly spread her hands. She immediately turned around, walked toward the outside, and spoke, “Forget it. I shall not disturb him and let him be alone.”</p><br/><p>Wu Hao nodded and followed her with low spirits.</p><br/><p>The small room which contained a faint delicate fragrance still had the remnant scent of the young lady. Xiao Yan’s body lay on the soft bed and slowly shut his eyes. The moving frown and smile of that young lady within his mind was like a blade cutting at him. He deeply imprinted it into the depth of his memories.</p><br/><p>He never experienced this feeling when the beauty was around. Only now that the scented figure had gone far away did these feelings climb up from the depths of his innermost memories. It was like a total mess that was lingering around his heart… Xiao Yan inhaled a deep breath of air. He knew that her figure would likely accompany him for the rest of his life...</p><br/><p>“I will look for you…” Xiao Yan’s hand that was holding onto the blanket tightened slowly as his muttered softly to himself within the room.</p><br/><p>……</p><br/><p>The Inner Academy which was calm for a period of time once again became lively the next day. This was because today was the day that the top ten experts on the ‘Strong Ranking’ could enter the ‘Blazing Sky Qi Refining Tower’ to receive the ‘Essence Heart Flame’ and refine their body. Everyone in the Inner Academy clearly knew that as long as one managed to endure such a refinement of one’s body, it would basically pave the way for one to advance to a Dou Wang in the future. Such an opportunity, that one could meet but could not hope for, was sufficient to cause anyone to want it and feel envious.</p><br/><p>A large group of members from ‘Pan’s Gate’ swarmed in front of the small pavilion home within ‘Pan’s Gate’. They eyed the tightly shut doors and emitted soft private whispers.</p><br/><p>“Creak!”</p><br/><p>The tightly shut door suddenly emitted a slight sound. All the private conversations ceased immediately. The numerous gazes that were staring at the door contained a fiery heat and respect.</p><br/><p>A black-robed, young man slowly walked out under all the heated gazes. That seemingly warm face caused all the members of ‘Pan’ Gate’ to be roused with force and spirit. As the true leader of the current ‘Pan’s Gate’, each and every single action of Xiao Yan would affect the spirits of the entire ‘Pan’s Gate’. As long as Xiao Yan was not defeated no matter what kind of opponent he met, the members of ‘Pan’s Gate’ would have never ending fighting spirit and confidence.</p><br/><p>Wu Hao and Hu Jia quietly sighed in relief as they saw Xiao Yan recovering his original expression. If he was to still act as desolate and gloomy as yesterday in such a situation, it was likely that he would cause the emotions of everyone present to fall.</p><br/><p>Xiao Yan’s gaze looked all around the area. Each time his gaze shot to a certain area, the members of ‘Pan’s Gate’ would involuntarily lift their head and raise their chest. Their gazes were fiery hot and excited.</p><br/><p>Xiao Yan smiled slightly as he slowly raised his hand. It fell immediately as his voice spoke briefly, “Let’s go!”</p><br/><p>Upon saying this. Xiao Yan’s footsteps took the lead as they walked out of ‘Pan’s Gate’. A large group of members of ‘Pan’s Gate’ marched forth and followed closely behind him.</p><br/><p>With such a large group moving around, the commotion that they caused was quite great. Numerous gazes shot over and when they saw the young man in a black robe leading, they realized the cause of this and followed behind the proud Pan’s Gate members with faces full of envy.</p><br/><p>Due to the sale of medicinal pills, the current ‘Pan’s Gate’ had truly monopolized the entire Inner Academy’s medicinal pill market. Even that ‘Medicinal Gang’ was finding it increasingly difficult to compete with ‘Pan’s Gate’ following the increase in the latter’s strength. The abundant ‘Fire Energy’ had caused the special ‘Fire Energy’ reward and punishment system within ‘Pan’s Gate’ to become increasingly perfect. Therefore, even some of the students within the Inner Academy who had already entered long ago had become envious of the treatment that the members of ‘Pan’s Gate’ were receiving.</p><br/><p>A large group of people marched forth in a mighty manner and headed directly toward the ‘Blazing Sky Qi Refining Tower’. They met a few other factions along the way. However, their momentum and aura were undoubtedly much weaker when compared to ‘Pan’s Gate’. Although most of the leaders of the other factions were experts in the top ten of the ‘Strong Ranking’, they did not dare to show any pride in front of Xiao Yan, this special existence who could even beat Liu Qing to the point where the latter was seriously injured. After all, they clearly understood that if Xiao Yan and Liu Qing had not fought until they were both seriously injured, it was likely that the both of them would be the greatest contenders for the top three spots.</p><br/><p>Xiao Yan and Lin Xiuya’s group, which were similarly rushing over came into contact as they were about to reach the ‘Blazing Sky Qi Refining Tower’. Both groups were startled when they met before they immediately greeted one another.</p><br/><p>Xiao Yan’s gaze swept over a group of merely twenty plus people behind Lin Xiuya as they greeted one another. His heart let out a quiet praise. Although the number of people in this group were not as many as that of ‘Pan’s Gate’, all of their auras were concealed while the glow in their eyes flickered occasionally. From the agglomeration of the auras all over their bodies, most of their strength should be around that of a one star Dou Ling.</p><br/><p>“I think that this is the ‘Wolf Teeth’ that is renowned within the Inner Academy. There are not many people but each of them could fight against ten. This is a true elite.”</p><br/><p>While Xiao Yan was observing the ‘Wolf Teeth’ behind Lin Xiuya, the latter’s gaze also partially drifted toward Xiao Yan’s side. However, he did not see that figure which had been deeply imprinted in his mind. Disappointment immediately flashed across his eyes. He quickly engaged in a chat with Xiao Yan as they swiftly walked toward the top of the tower, which had appeared at the edge of their sight.</p><br/><p>The place was already crowded by a huge number of people by the time Xiao Yan’s group arrived. Due to the top ten of the ‘Strong Ranking’ about to enter the bottom of the tower, the Inner Academy had already prohibited the remaining students from entering. Although this action caused everyone to complain, they also knew that this was a rule established generations ago, and they were helpless in doing anything about it.</p><br/><p>The appearance of Xiao Yan’s large group immediately attracted the attention from everywhere. Xiao Yan, who had a current reputation and prestige that did not lose to Lin Xiuya, was naturally instantly recognized by everyone. Immediately, various voices sounded in the crowd.</p><br/><p>Xiao Yan ignored these noises. His group relied on their large number, and he like a sharp knife being inserted into the group, split them apart. Finally, they swaggered toward the empty land just outside the main entrance of the ‘Blazing Sky Qi Refining Tower’.</p><br/><p>There was a spacious area in the empty space in front of the main entrance. However, this kind of area was reserved for the use of those factions with quite a great strength. The current ‘Pan’s Gate’ naturally possessed such a qualification. Hence, the group was unceremonious as they searched for a good spot before sitting down with their legs crossed.</p><br/><p>Xiao Yan watched the group of people who were squeezing behind him and involuntarily exhaled. Over half a year ago, he too, only had the qualification to stand outside and watch those factions occupy the best spots with envy. It was unexpected that his position had currently been exchanged.</p><br/><p>“Hey, Liu Qing is also here.” Lin Xiuya’s body suddenly flashed to Xiao Yan’s side and sat down before curling his lips in one direction as he spoke.</p><br/><p>Xiao Yan was startled when he heard this. His gaze also turned in the same direction as Lin Xiuya’s and he did indeed see a commotion suddenly occurring within the crowd. After which, a group of people with an overbearing aura broke into them before rushing toward where the main entrance was. The leader of that group was Liu Qing who was carrying the Mountain Splitting Spear on his back. Behind him was Liu Fei, Yao Sheng as well as a group of men whose figures were quite strong and whose auras were not any weaker than the members of Lin Xiuya’s ‘Wolf Teeth’.</p><br/><p>Liu Qing sensed something when Xiao Yan’s eyes focused on the former. Turning his head slightly, his eyes collided with that of the black-robed, young man who was sitting cross legged on the ground.</p><br/><p>Four eyes watched each other and Liu Qing’s footsteps gradually slowed. As the focus of the entire place, each and every single action of his naturally got the attention of everyone. Hence, numerous gazes were once again turned toward Xiao Yan.</p><br/><p>The surrounding private conversations immediately became much quieter upon seeing these two opponents who could be described by the phrase ‘enemies frequently cross paths’.</p><br/><p>Liu Qing hesitated for a moment under the focus of the surrounding gazes. However, he led his group slowly toward where Xiao Yan and the others were.</p><br/><p>The members of ‘Pan’s Gate’ behind Xiao Yan immediately became much more tense when they saw Liu Qing’s large group of swarming over. Each of their gazes revealed enmity. There were even some who drew their weapons.</p><br/><p>This action of both parties immediately caused the surrounding voices to completely become quiet. They eyed these two factions that seemed to be about to engage in a large scale intense fight.</p><br/><p>Liu Qing’s footsteps stopped at a distance of around ten meters from the members of ‘Pan’s Gate’. He waved his hand and the large men with overbearing auras stopped their feet at the same time. The orderly sound of footsteps landing on the ground emitted a bang that was filled with an imposing presence.</p><br/><p>Liu Qing brought Liu Fei and Yao Sheng as he slowly stopped in front of Xiao Yan. His gaze stared intently at the smiling face of the young man. A moment later, he spoke in a deep voice, “You are very strong. I have underestimated you.”</p><br/><p>Xiao Yan smiled as he cupped his hands toward Liu Qing and said, “I was merely lucky.”</p><br/><p>“Luck does not exist in a fight.” Liu Qing said faintly. His boiling hot gaze immediately turned toward Xiao Yan as he spoke, “However, I have one additional opponent from now on. This is an extremely good thing for me. I will come and look for you to spar if there is time in the future.”</p><br/><p>Liu Qing did not wait for Xiao Yan to reply after saying those words. He turned around and brought everyone to sit down at a spot not far away, quietly waiting for the door of the tower to open.</p><br/><p>Xiao Yan helplessly shook his head as he watched Liu Qing and the others, who turned around and left. This fellow was actually quite troublesome…</p><br/><p>There were some other people who rushed over after Liu Qing’s followers all came. Finally, after nearly half an hour, the sound of rushing wind suddenly came from the sky. A couple of old figures appeared outside of the tower’s door. The person leading them was surprisingly the First Elder, Su Qian.</p><br/><p>“Ke ke, looks like everyone has arrived. In that case, I shall not say any unnecessary words.” Su Qian’s gaze took one look around. He did not waste his breath as he waved his hand. The heavy tower door creaked before slowly opening.</p><br/><p>“The eleven people within the top ten of the ‘Strong Ranking’ should follow me. Everyone else is not allowed to enter today. Otherwise, you can forget about entering it within the next half a year.” Su Qian spoke in a faint voice before immediately ignoring everyone who was shocked by this severe punishment until their necks shrank. He immediately turned around and walked toward the tower.</p><br/><p>Xiao Yan was the first to stand up after seeing Su Qian’s back. After which, he stepped into the ‘Blazing Sky Qi Refining Tower’ under numerous envious gazes!</p><br/>\n</div>"}