{"title": "Chapter 605: Fighting With Fire!", "id": 605, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-605-fighting-with-fire", "volume_title": "Volume 7", "body": "<h1>Chapter 605: Fighting With Fire!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 605: Fighting With Fire!</u></strong></p><br/><p>A colorful energy pillar appeared like a rainbow that drew across the sky. It carried traces of slightly shaken space as it violently collided with the large body of the invisible fire python. The energy explosion was like brilliant fireworks that were projected from the fire python’s body.</p><br/><p>The frightening attack that gathered the full offensive strength of all the experts in the ‘Black-Corner Region’ was something that even Su Qian would not dare receive. Therefore, despite the great strength of the invisible python, its enormous body also swiftly descended under this violent collision. A furious hissing sound pierced everyone’s ears as it resounded in the sky.</p><br/><p>A joyful expression was contained on the faces of all the experts from the ‘Black-Corner Region’ as they watched the invisible fire python being forced back. However, that joy had yet to spread when an even more terrifying and hotter energy wave suddenly surged from below.</p><br/><p>They lowered their heads in shock, only to see the enormous body of that invisible fire python appearing in their eyes in a lightning-like manner. Its large, triangular eyes contained a hot temperature that appeared to have the intention of melting all those people who had blocked it.</p><br/><p>“Stop it!”</p><br/><p>Han Feng’s expression changed a little as he let out a stern cry when he saw the invisible fire python pouncing over once again.</p><br/><p>The cry had just sounded when the experts from around him once again hurriedly summoned the Dou Qi from their bodies. However, that invisible fire python which was shooting over opened it savage mouth before they could unleash their attacks. An invisible fire pillar, which could distort space, erupted from it!</p><br/><p>The invisible fire pillar drew past the empty sky, evaporating all the air wherever it passed. A scar that was visible to the naked eye remained in the sky, causing everyone to feel quietly shocked.</p><br/><p>“Move aside!”</p><br/><p>Han Feng hurriedly cried out as he sensed the terrifying temperature contained within the fire pillar.</p><br/><p>The speed of the fire pillar was as fast as lightning. Just after Han Feng’s cry sounded, it carried an incomparable momentum as it viciously shot into the crowd that was formed from the experts from the ‘Black-Corner Region’.</p><br/><p>Han Feng and some of the other experts with strong senses managed to narrowly dodge the fire pillar the moment that it shot over in an explosive manner. Despite this being the case, the fire pillar that narrowly missed them still caused an intense searing pain to be felt on their skin.</p><br/><p>“Ah!”</p><br/><p>Only those experts who had some ability were able to escape the fire pillar. On the other hand, some of the unlucky ones were coincidentally struck by it. The invisible flame diffused their bodies, and even those who had Dou Qi protecting their bodies still felt a stabbing pain that was drilling through their hearts. The human figures in the sky flashed, and over ten burning individuals scurried randomly in all directions, doing their best to struggle and escape from the invisible flame that possessed their bodies.</p><br/><p>“Help them!”</p><br/><p>Han Feng hurriedly cried out when he saw the experts from the ‘Black-Corner Region’ whom the flame had spread to. Currently, these people were the crucial element in determining whether he could obtain the ‘Fallen Heart Flame’. Naturally, he could not easily allow anything to happen to them.</p><br/><p>Han Feng was the first to move to rescue the others after his voice sounded. However, a hot wave that shot from under him caused him to hurriedly halt his actions. When he lowered his head to take a look, he actually saw that a fire pillar that was not any weaker than the attack earlier was shot toward him.</p><br/><p>“Dammit!”</p><br/><p>Han Feng softly cursed. He clearly understood just what kind of destructive strength this fire pillar contained, and did not dare to test it even a little. He waved his hand immediately and a powerful deep-blue flame immediately shot explosively out of his body. Finally, it became like a blue-colored sky curtain that formed above his head.</p><br/><p>“Hah!”</p><br/><p>The seals in Han Feng’s hands were swiftly formed and his palms pressed down hard toward the fire pillar that shot explosively from under him. The blue-colored flaming sky curtain immediately curled down from all directions. It was like the churning sea. Waves of the ocean heavily piled onto each other before finally colliding violently with the invisible flame.</p><br/><p>“Bang!”</p><br/><p>The two kinds of ‘Heavenly Flame’ collided with a ‘bang’, and a thunder-like explosion suddenly exploded beside the ears of everyone present. The instant the flames collided, even those students from the Inner Academy could clearly sense the temperature over the entire sky suddenly soar. Some of the dried tree leaves in certain areas even began to suddenly spontaneously combust…</p><br/><p>The energy ripple that was formed from the collision of the ‘Heavenly Flames’ in the sky caused Han Feng to swiftly withdraw over a dozen steps. Only then did he stabilize his body. His gaze glanced down only to see that the invisible fire python had curled up into a snake formation in the sky. It lifted its enormous head high up and stared firmly at Han Feng. Clearly, the former was prepared to engage in a true fight with him.</p><br/><p>“This bastard. That guy also possesses a ‘Heavenly Flame’. Why is it that it must come and look for me first?” Han Feng’s face was green. His gaze glanced at Xiao Yan in the distant sky, who had folded his arms and adopted a wait and see attitude, observing the battle before cursing angrily in his heart.</p><br/><p>“Han Feng, this ‘Heavenly Flame’ is really too strong. It is likely that we won’t be able to be of much help. You don’t need to fear its frightening temperature because you already possess a ‘Heavenly Flame’, therefore, you should use some means to weaken it a little first!” A loud cry suddenly sounded. Han Feng’s heart immediately sank upon hearing this. He turned his gaze, only to see that the Gold Silver Brothers had already brought the large group of experts from the ‘Black-Corner Region’ and moved far away from this place. Clearly, the powerful attack that the invisible fire python had displayed earlier had already caused a fear to form in the hearts of these people.</p><br/><p>“A group of cowardly people who are afraid to die!” Han Feng cursed out in his heart. However, he did not dare to make any drastic move. He understood that the invisible fire python had currently locked onto him. As long as he was to retreat by even a little, the latter would immediately pounce over.</p><br/><p>“Looks like I can only use some means to quietly suppressed the flame of the ‘Fallen Heart Flame’ by a little. Otherwise, it was likely that those fellows will no longer intervene, given their cautious characters…” This thought swiftly circulated in his heart. A moment later, he could only clench his teeth and stare at the invisible fire python below with a dark, cold gaze. His arms shook and two icy-blue jade bottles immediately appeared in his hand.</p><br/><p>Everyone could immediately see a wave of dense blue-colored chilly air seeping out following the appearance of these two jade bottles. Some of those sharp eyed people could even see that the slight moisture that was contained in the air was solidified into ice fragments wherever the cold air passed.</p><br/><p>Han Feng held the jade bottle tightly and let out a cold laugh. He immediately threw it violently toward the invisible fire python!</p><br/><p>Han Feng’s hand suddenly tightened when the blue-colored jade bottle was still around ten meters from the invisible fire python. “Explode!”</p><br/><p>“Bang!”</p><br/><p>The icy-blue jade bottle suddenly burst apart. Immediately, blue-colored cold air erupted from it in all directions. Within the short blink of an eye, it covered the large patch of sky. That invisible fire python was also within the covered region.</p><br/><p>The invisible fire python felt an uneasiness as that icy-blue cold air spread. After being influenced by the cold air, the invisible flame that was writhing over its body became somewhat thinner.</p><br/><p>“This cold fog… can actually suppress the ‘Heavenly Flame’?” Xiao Yan involuntarily cried out in shock within his heart when he saw the invisible fire python becoming a little sluggish within the cold fog.</p><br/><p>“This icy-blue fog should be… ‘Sky Cold Air’. The rarity of this thing is not any less than a ‘Heavenly Flame’. It only exists deep underground in extremely cold places. An ordinary flame would definitely be automatically extinguished when it is within a certain distance from it. Only a ‘Heavenly Flame’ can withstand it. Despite this being the case, the strength of the ‘Heavenly Flame’ would be greatly reduced under the influence of the ‘Sky Cold Air’.” Yao Lao’s somewhat surprised voice sounded within Xiao Yan’s heart, “It is really unexpected that he even managed to obtain the ‘Sky Cold Air’. Looks like he has put in quite a lot of effort in order to search for a ‘Heavenly Flame’.”</p><br/><p>“Then… will he succeed?” Xiao Yan knit his brows and asked with hesitation</p><br/><p>“Relax, the ‘Sky Cold Air’ may be able to restrain the ‘Fallen Heart Flame’ a little, but a ‘Heavenly Flame’ is ultimately something that possesses the most terrifying destructive strength in nature. It is extremely difficult to subdue it even after it is restrained.” Yao Lao comforted.</p><br/><p>Xiao Yan only felt a calmness in his heart after hearing this. His gaze firmly stared at the vague cold fog. The green-colored flame slowly rose within his eyes, and that blurry feeling vanished immediately.</p><br/><p>“Hmph, bastard. No matter how much intelligence you have, you are still unable to escape your fate of being captured!” Han Feng rejoiced in his heart as he saw the ‘Fallen Heart Flame’ become somewhat sluggish within the cold fog. He let out a laugh as the dark-blue flame once again erupted from his body. Finally, it agglomerated into a swiftly spiraling flame drill bit at the tip of his finger.</p><br/><p>The flame drill bit spun wildly, emitting a humming sound that resounded through the sky.</p><br/><p>For some unknown reason, that flame drill bit appeared to be totally unaffected by the cold fog despite it clearly being present within its boundary. Its hot temperature still caused waves of distortions to appear in the sky.</p><br/><p>“Go!”</p><br/><p>With a flick of his finger, the flame drill bit shot out abruptly. Its humming sound was like that of a crying child as shock waves formed over any area that it passed.</p><br/><p>“Xiu!”</p><br/><p>The flame drill bit penetrated the cold fog in a lightning-like manner before finally drilling into the invisible fire python’s large body.</p><br/><p>“Chi!”</p><br/><p>The flame drill bit was only blocked by the scales of the invisible fire python for a moment before penetrating into its body. Immediately, a sharp, furious, strange hiss roared out like that of thunder in clear sky.</p><br/><p>The furious roar had just sounded when a frightening energy fluctuation, that caused the expressions of everyone present to immediately change, rippled and spread out. The area that had its temperature reduced by the ‘Sky Cold Air’ had its temperature raised abruptly!</p><br/><p>As the temperature soared, the cold air that spread throughout the sky actually began to gradually become thinner. Clearly, even the latter did not have much of an effect when the ‘Heavenly Flame’ truly erupted..</p><br/><p>The instant the increasingly thin ‘Sky Cold Air’ completely disappeared, the invisible flame that spread in all directions like a sky flame began to sweep out. The first to be struck by this was naturally the one who was closest to it, Han Feng!</p><br/><p>A dark-blue flame was waved out from his sleeves to force back the invisible flame that had come pouncing over. Han Feng’s gaze swept down, only to be stunned when he realized that the enormous body of the invisible fire python had actually completely vanished…</p><br/><p>Han Feng knit his brows tightly together. His gaze hurriedly swept in all directions. However, he could only see the invisible flame that was sweeping over from all directions no matter where he looked. There was not the slightest sign of the fire python’s body.</p><br/><p>“Where has that beast run off to?” Han Feng muttered somewhat uneasily in his heart. He was just about to flash out from this region surrounded by the invisible flame when the flame that had already completely wrapped around him suddenly became distorted. An enormous body appeared behind Han Feng in an extremely strange manner. Its enormous tail was swung through the air. It carried a hot wind that could collapse mountains and split the land as it violently smashed into Han Feng’s back under a countless number of stunned gazes.</p><br/><p>“Grug!”</p><br/><p>A mouthful of fresh blood was spat out from Han Feng’s mouth after suffering such a serious blow. His body also became like a cannonball that was shot toward the ground.</p><br/><p>Xiao Yan’s face was stunned as he watched Han Feng who had suddenly spat out blood from becoming injured. The latter had been acting very proud earlier. It was really unexpected that in the blink of an eye, he actually wound up in such a state. That ‘Fallen Heart Flame’ was indeed terrifying…</p><br/><p>Yao Lao’s shocked cry suddenly sounded within Xiao Yan’s heart while the latter was still stunned, causing all the pores in Xiao Yan’s body to suddenly tense up!</p><br/><p>“Xiao Yan, hurry up and leave! That beast has its eyes on you again!”</p><br/>\n</div>"}