{"title": "Chapter 600: Great and Terrible Explosion", "id": 600, "volume": 6, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-600-great-and-terrible-explosion", "volume_title": "Volume 6", "body": "<h1>Chapter 600: Great and Terrible Explosion</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 600: Great and Terrible Explosion</u></strong></p><br/><p>Xiao Yan’s soft, cold laughter was just like throwing a basin of cold water into oil. Immediately, a wave of blood-red majestic Dou Qi came surging out in all directions from within the body of the ferocious looking Fan Lao!</p><br/><p>Three shriveled pale-white claw-like hands were abruptly thrust forth, and formed some strange seals with lightning-like speed. One could see that the Dou Qi that was surging out fluctuated a little before a dark-red blood spear that was as thick as two arms swiftly formed and appeared in everyone’s eyes.</p><br/><p>Fan Lao extended his hand claw as the blood spear took form, grabbing it firmly. He lifted his head and moved his mouth slightly while facing Xiao Yan, revealing his somewhat sharp and dense white teeth.</p><br/><p>The wings on his back were flapped abruptly, and a sharp, angry roar immediately carried an incomparable amount of killing intent as it erupted from within Fan Lao’s mouth. Under this clear sonic wave, the latter’s body appeared to drift with the wind as it turned into an extremely vague blood figure that approached Xiao Yan in a lightning-like manner. The long spear in his hand carried a dense wind as it viciously pierced toward Xiao Yan’s heart.</p><br/><p>Although Fan Lao’s Dou Qi did not show any traces of soaring after using the so-called ‘Blood Transformation’, his speed had greatly increased. It had even reached the point that many people could only see his body tremble slightly when he moved. When they glanced again, they were shocked to discover that the figure had gradually turned illusionary. Clearly, this was something that would only be left behind when one’s speed reached a certain level.</p><br/><p>Xiao Yan was able to barely leave behind an afterimage in the past after having used the ‘Three Thousand Lightning Movement’. However, that afterimage was clearly incomparable to the one that Fan Lao had created. Of course, the condition that Xiao Yan was in only had the strength of the Dou Ling class. Being able to create an afterimage that even an ordinary expert Dou Wang had great difficulty creating was enough for him to be proud of.</p><br/><p>The speed that Fan Lao displayed caused a countless of people to feel completely shocked in their hearts. However, Xiao Yan, who was facing him, had a face that was not visibly moved.</p><br/><p>His dark-black eyes reflected a blood-colored light that was swiftly expanding. The next instant, the blood-colored glow suddenly turned into a savage face. That incomparably sharp energy spear passed through the hinderance of the air as it shot over while carrying a thick and cold wind.</p><br/><p>“Ding!”</p><br/><p>An enormous black shadow suddenly flashed and appeared. Its thick back was just like a shield that stood straight in front of Xiao Yan. The bloody spear heavily pressed against it. Immediately, a gale-like wind curled out wildly. The strength of that wind was such that it even carried the faint sound of thunder.</p><br/><p>The wings on Xiao Yan’s back flapped as he took two steps back. His hand shook as he completely blocked the attack of Fan Lao which contained the latter’s anger.</p><br/><p>Xiao Yan’s gaze was lifted slightly. It passed over the Heavy Xuan Ruler and saw the dark, cold, savage face of Fan Lao. The latter’s eyes was emitting an incomparable killing intent and bloodiness.</p><br/><p>“Little bastard. I want to create a countless number of bloody holes in your body!”</p><br/><p>Fan Lao laughed in a savage and creepy manner. The hand which was holding the blood spear suddenly twisted and moved the blood spear away from the ruler. It immediately carried a blood-red glowing arc as it once again pierced forward.</p><br/><p>“The current you still doesn’t have that qualification.” Xiao Yan smiled. A thread of silver glow suddenly flashed and appeared in a lightning-like manner. His body moved and it immediately sprang away from the blood spear in a ghost-like manner. A green flame containing great heat lingered over his clenched fingers as they smashed toward Fan Lao’s face without any fancy action.</p><br/><p>Fan Lao also became extremely furious when faced with Xiao Yan, who was as slippery as a loach. A similar blood aura lingered over his right hand, and his sharp blade-like fingernail was flicked gently. One could only hear a slight ‘Chi’ sound as if space had been torn apart at this moment.</p><br/><p>Those five fingers were pressed together, becoming like a sharp bloody sword that pierced toward Xiao Yan’s fist. The sharp rushing wind was like a sharp blade. The sound of a sharp blade cutting open thin paper caused a person’s body to overflow with a certain chill.</p><br/><p>Xiao Yan frowned slightly as he sensed the sharp force that was contained within the somewhat strange nail of Fan Lao. From the sound of it, the degree of sharpness of this nail was likely not weaker than the bloody spear. Such a direct collision between that nail his physical fist was extremely disadvantageous toward him.</p><br/><p>This thought swiftly flashed within his heart. In a split second, Xiao Yan’s arm suddenly trembled, and the green-colored flame that covered his fist suddenly left his hand, turning into a green-colored fireball that shot toward Fan Lao!</p><br/><p>The fireball that left his hand was like a cannonball that had just left the shell. The moment it escaped, the temperature that was suppressed earlier completely erupted. Its color immediately became much deeper. Some folds even appeared in the space where the fireball drew past, appearing like the sky of the desert. It became illusionary because of the distortions.</p><br/><p>The change in Xiao Yan’s attack was in a mere split second. Hence, by the time that Fan Lao sensed it, the dark-green-colored flame had already reached him. The hot temperature still managed to cause his skin to feel waves of searing pain despite being isolated by the Dou Qi cover.</p><br/><p>It was already impossible to dodge at such a distance. Therefore, Fan Lao did not shrink back even a little. Waves of powerful blood-colored Dou Qi poured out from the pores of his skin. Immediately, a blood-colored light film agglomerated and formed on his palm.</p><br/><p>“Explode!”</p><br/><p>Xiao Yan’ s body flashed and withdrew. He eyed the dark-green fireball that was in close proximity with Fan Lao. A clear voice was suddenly emitted as his mouth moved.</p><br/><p>A powerful light erupted from the fireball as his voice sounded. Immediately, a loud sound suddenly resounded through the sky. Hot flames curled out in all directions from the point of explosion!</p><br/><p>Xiao Yan’s sleeves were waved and a hot ripple that had spread to his front was scattered. His eyes narrowed as he watched the fire wave spread out. In his heart, he clearly knew that an attack of such strength would not be able to wound a strong person like Fan Lao.</p><br/><p>As Xiao Yan looked, a blood-colored light pillar suddenly shot and spread out from the fire wave. Fan Lao’s body slowly floated up from within the pillar of light. At this moment, his expression was still ferocious. His right hand lifted the sharp bloody spear high up while his body was half turned, adopting a throwing stance. The blood-colored Dou Qi that was spreading around his body also appeared to have encountered a suction force as it poured unceasingly into the blood spear.</p><br/><p>The color of the blood spear grew increasingly darker following a greater amount of Dou Qi being poured in. A moment later, it appeared to have become like solidified fresh blood. Its bloody stench grew increasingly dense, and blood-colored light arcs were emitting cold, bright clusters wherever it passed. The sharp spear seemed to possess the strength to penetrate all defenses!</p><br/><p>Xiao Yan’s expression gradually grew serious as the blood-colored spear agglomerated. He could clearly sense that the attack of Fan Lao this time around had truly reached the point where he had put in maximum effort. An attack that contained the full strength of a Dou Huang was sufficient to break a mountain peak. Hence, even with Yao Lao’s support, Xiao Yan still did not dare to feel the slightest underestimation for it.</p><br/><p>The Heavy Xuan Ruler in Xiao Yan’s hand was slowly lifted. Waves of powerful green fire Dou Qi surged out from within his body before being poured unceasingly into it.</p><br/><p>These two people in the sky who were less than a hundred meters apart had descended into an unusual silence at this moment. However, everyone knew that under this silence was a frightening storm front that was being brewed.</p><br/><p>In addition, the release of this storm was happening in the next moment!</p><br/><p>The bloody spear in Fan Lao’s hand finally ceased its absorption of Dou Qi under the shocked gazes of a countless number of people. At this moment, the blood spear was twisting slightly, and was actually able to create ripples in space. The energy that was contained within it had already reached a terrifying level.</p><br/><p>Fan Lao’s sharp hand firmly held the repeatedly quivering blood spear. A paleness had surfaced on his ferocious looking face at this instant. Those blood-red eyes stared intently at Xiao Yan while a strange laughter sounded in the sky, “Little bastard. Everything is over!”</p><br/><p>The strange laughter had just sounded when Fan Lao ceased providing Xiao Yan with any extra time to gather Dou Qi. His arm suddenly shook, and the blood spear that contained all his strength left it.</p><br/><p>“Great Blood Bodhisattva Devourer!”</p><br/><p>Countless numbers of people below suddenly felt an extremely dense, bloody scent pouncing over the moment that the blood spear left his hand. Everyone felt as though they were in an abyss despite being under the light of the intense sun. Their bodies felt a chill, and the originally clear sky was also covered by the hazy bloody air. The entire place was desolate and gloomy.</p><br/><p>The sudden change in their surroundings caused the fighting in the battleground within the sky to quietly become much duller. Numerous gazes carried some shock as they were thrown toward where Fan Lao and Xiao Yan were. This was especially when everyone saw the blood-colored long spear that had escaped Fan Lao’s hand. Quite a number of experts from the ‘Black-Corner Region’ immediately let out a surprised cry.</p><br/><p>“It is actually the ‘Great Blood Bodhisattva Devourer’?”</p><br/><p>“Fan Lao was actually forced by that young man to the point of having to use this kind of Dou Technique?”</p><br/><p>“This old fellow must have really lost his mind in his anger. He actually even used a Di class Dou Technique. Looks like the black-robed, young man is in a terrible situation. Most of those expert Dou Huangs who died in Fan Lao’s hands had lost to this move…</p><br/><p>While shocked cries were being transmitted in the sky, a blood-colored lightning suddenly broke through the barrier in the sky at that moment. It appeared to have teleported, and in the blink of an eye, it carried a disgusting bloody stench as it appeared in Xiao Yan’s sight.</p><br/><p>A mouthful of scorching hot air was deeply inhaled into Xiao Yan’s lungs as the dark-black, massive Heavy Xuan Ruler was being lifted high above his head. At this moment, that black color of it had turned into a deep red one, much like a ruler that contained a flame.</p><br/><p>The frightening wind that the blood-colored lightning carried caused the pores all over Xiao Yan’s body to tense up. His eyes stared at the bloody color that had broken through the air. An instant later, a sharp, stern cry was emitted and the heavy ruler immediately slashed down angrily. That posture was as though he wanted to split the land!</p><br/><p>“Flame Splitting Tsunami!”</p><br/><p>A green-colored energy pillar that was over a hundred feet long was instantly shot out from the Heavy Xuan Ruler as the cold, sharp cry was emitted. The air repeatedly shook and broke, forming distortions wherever it passed, much like glass being shattered!</p><br/><p>Under a countless number of gazes that contained various kinds of emotions, the green-colored energy pillar appeared for an instant before it collided with the meteorite-like blood color. The collision caused the color of the sky to change.</p><br/><p>At this moment, a truly great and terrifying explosion suddenly occurred!</p><br/>\n</div>"}