{"title": "Chapter 614: Intersection Between Life and Death", "id": 614, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-614-intersection-between-life-and-death", "volume_title": "Volume 7", "body": "<h1>Chapter 614: Intersection Between Life and Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 614: Intersection Between Life and Death</u></strong></p><br/><p>The naked beauty who appeared in front of Xiao Yan was bewitching and filled with allure. That nakedness that was accidentally revealed was sufficient to cause countless numbers of men to become crazy. Certainly, it would be more perfect if the cold, ice-like face of the beauty had the addition of human emotion…</p><br/><p>Of course, no matter how beautiful the beauty in front of him was, it was not good news for Xiao Yan. After all, this woman was a little too frightening. Although he had an agreement with her back then, this temperamental Queen Medusa ultimately caused Xiao Yan to feel the greatest caution in his heart.</p><br/><p>Queen Medusa had just revealed her form when the ‘Fallen Heart Flame’ sensed something. A large cluster of flame suddenly appeared and immediately swept toward the former. The hot temperature caused the expression of even someone with Queen Medusa’s strength to change a little.</p><br/><p>Queen Medusa waved her delicate hand gently, and a bright seven-colored glow surged out from within her body to completely suppress the invisible flame. Although she did not possess a ‘Heavenly Flame’, it was not easy for the ‘Fallen Heart Flame’ to refine her because of her powerful strength.</p><br/><p>Only after Queen Medusa blocked the invisible flame did she sense the surroundings she was in were not quite right. Her gaze swept out in all directions. When she saw the endless magma outside the invisible flame, she knit her eyebrows. This was especially the case when her gaze fell on the invisible flame which was wrapped on the outside. Her cold and indifferent face had finally become ugly, “Heavenly Flame?”</p><br/><p>“Hee hee, Queen Medusa, I’m really sorry. I had actually forgotten about you…” Laughter suddenly sounded. Queen Medusa’s pretty eyes which were filled with doubt slowly turned toward Xiao Yan, who was seated cross-legged on the green lotus. Her glamorous cold face immediately became chilly. She had never felt much good feeling toward this fellow who had been relying on the ‘Heaven Swallowing Python’ to threaten her.</p><br/><p>Xiao Yan moved his body back a little without leaving any trace when he sensed the somewhat icy eyes of Queen Medusa. He was exceptionally fearful of this woman. In the past, he still had some confidence when Yao Lao was around. Now that Yao Lao had descended into a deep slumber, he really had no means to resist if she wanted to do something to him.</p><br/><p>Xiao Yan’s eyes swept across Queen Medusa’s white-jade-like, lovely, pretty, naked body. Even though he clearly knew that this was a pretty female snake, who could instantly kill a person, his male nature still caused a nefarious flame to rise in his lower abdomen. This woman was really the nemesis of all males. One could not find any flaw on that heavenly masterpiece-like face. Moreover that extremely cold atmosphere caused a person’s heart to be as itchy as a monkey claw. All men were like this. Their interest would grow when it comes to something that they clearly understood they could not obtain.</p><br/><p>A beauty like a jade with a natural temptation that bewitched the world. This beauty in front of him appeared to be worthy of such an evaluation.</p><br/><p>Although Xiao Yan’s gaze had only roamed for an instant before it was swiftly turned away, it did not escape Queen Medusa senses. Her sleek, red lips lifted into a shallow arc that contained a coldness, “You don’t want your eyes?”</p><br/><p>Xiao Yan laughed dryly, but did not dare to reply. Who knew whether this temperamental woman would finish him off on the spot just because she was not pleased.</p><br/><p>“Where is this place?” The bright seven-colored glow moved with a wave of her delicate hand. It immediately turned into a red-colored dress over Queen Medusa’s naked body which covered the nakedness under it. Her long jade-like fingers pushed aside a strand of black hair that had drifted over her forehead as she opened her mouth to ask faintly.</p><br/><p>Xiao Yan rubbed his head. He hesitated for a moment before roughly explaining his predicament. However, after he spoke until the end, he clearly saw that Queen Medusa eyebrows had slowly become vertical. Her voice immediately weakened greatly.</p><br/><p>“I really regret not killing you back then!”</p><br/><p>Queen Medusa clenched her silver teeth. Her entire body was trembling. This fellow would actually bring her to this kind of place which was filled with death. Although her strength was great, she already possessed a fear toward this kind of flame after having evolved within the ‘Green Lotus Core Flame’ back then. However, she did not expect that the next time she controlled her body, she had been actually brought to this deep underground area by Xiao Yan. Moreover, there was a ‘Heavenly Flame’ which possessed an intelligence looking menacingly at them from the outside.</p><br/><p>Xiao Yan smiled in an embarrassed manner. He spoke carefully, “I didn't want to come here either. Your Majesty, don’t you agree that it is pointless for us to say anything. Why don’t we join hands, break this ‘Fallen Heart Flame’ and escape alive? What do you say?”</p><br/><p>Queen Medusa’s pretty face was cold as she completely ignored him. Her pretty eyes stared at the ‘Fallen Heart Flame’. A moment later, she waved her delicate hand and a seven-colored energy pillar shot out. It immediately smashed onto the flame. However, an attack of such strength did not have much use other than causing waves of ripples to form on the ‘Fallen Heart Flame’.</p><br/><p>A solemness flashed across Queen Medusa’s cold eyes when she saw that her attack did not have the slightest effect. Although the earlier attack was not her full strength, it was not something that could be underestimated. It was unexpected…</p><br/><p>“This place is the place where the ‘Fallen Heart Flame’ was born. It basically has an unending supply of energy in this place and it won’t be easy to break through it.” Xiao Yan at the side watched Queen Medusa’s action as he involuntarily spoke.</p><br/><p>Queen Medusa’s eyebrows became vertical. She was about to hoot coldly when the ‘Fallen Heart Flame’ which was suddenly attacked became somewhat angry. Clusters of invisible flame surged swiftly and immediately wrapped around Queen Medusa. The seven-colored glow on the surface of her body appeared to have slowly become thinner under the grilling of the frightening high temperature of the invisible flame.</p><br/><p>The Dou Qi on the surface of Queen Medusa was burned until it became thin. Her pretty face changed a little after appearing to have sensed something. Those delicate hands of hers formed a strange seal, and a circle of seven-colored glow immediately surged out, shooting apart the invisible flame over her body.</p><br/><p>Queen Medusa did not have the time to sigh in relief after the invisible flame had just be shot aside when she discovered that an increasing amount of invisible flame suddenly surfaced before sweeping toward her from all directions.</p><br/><p>Queen Medusa’s face sunk. She could only shrink back and withdraw her seven-colored Dou Qi before eventually forming a stalemate with the invisible flame beside her body.</p><br/><p>“Where is that old fellow who is in your body? Get him out. With just your strength, we won’t be able to break this ‘Heavenly Flame’ even if we were to join hands!” Queen Medusa continued the stalemate with the flame for awhile before finally recognizing that this was not a long term solution. She turned her pretty eyes toward Xiao Yan and cried out after that.</p><br/><p>“Teacher has already fallen into a slumber…” Xiao Yan laughed bitterly as he spread his hands.</p><br/><p>“Dammit!!” Queen Medusa became extremely furious upon hearing this. She raised her hand and the seven-colored energy in her palm churned repeatedly. From the looks of it, it seemed that she wanted to kill Xiao Yan with one palm.</p><br/><p>“You won’t be able to leave even if you were to kill me.” Xiao Yan could not be bothered if he provoked this woman at this stage as he spread his hands and spoke.</p><br/><p>“What kind of dangerous situation has this Queen not seen? It is not so easy if this ‘Heavenly Flame’ wants to hold me here!” Queen Medusa suddenly laughed coldly. Her body immediately moved and appeared at the edge of the flame in a ghost-like manner. A frightening wind was swiftly brewing on her delicate hand before it immediately smashed violently into the ‘Fallen Heart Flame’.</p><br/><p>“Bang!”</p><br/><p>A low, deep sound reverberated throughout this area, causing some perspiration to surge out from Xiao Yan’s forehead. Once this vicious woman broke through the seal of the ‘Fallen Heart Flame’, the sea of magma on the outside would immediately swarm in. Although she was not afraid of it, he would definitely not be able to hold out for long given his strength.</p><br/><p>Ripples surged rapidly as the frightening force smashed onto the flame. An indentation mark was revealed. However, this indentation was like a plasticine. It slowly recovered as Queen Medusa’s hand left. The ‘Fallen Heart Flame’ did indeed possess a never ending energy in this place.</p><br/><p>Queen Medusa’s expression finally became extremely solemn when such a powerful blow failed to achieve much. The danger in this perilous place was much greater than she had anticipated.</p><br/><p>“This queen, doesn’t believe that she cannot break you!”</p><br/><p>A haughtiness flashed across the cold and glamorous moving face as the glow on her fists surged greatly. However, just as she was about to continue unleashing her attacks, the ‘Fallen Heart Flame’ suddenly became as smooth as jade. Two faint green glows surfaced as an unusual hissing sound that was filled with anger resounded by Xiao Yan’s and Queen Medusa’s ears.</p><br/><p>Xiao Yan’s heart suddenly sank when he saw this change in the ‘Fallen Heart Flame’. This stupid woman had finally angered it…</p><br/><p>Queen Medusa’s pair of beautiful eyes was filled with killing intent and an iciness as she stared at the two faint lights. She was just about to move when her face suddenly changed. An unusual sleek redness surged over her white face as threads of white fog seeped out from within her body.</p><br/><p>“Dammit… what exactly is this thing? When did it enter my body?” Queen Medusa’s delicate hand held the spot where her heart was located as she clenched her teeth tightly. Dou Qi erupted from her body like a torrent and wrapped around the flames that had suddenly appeared within her body.</p><br/><p>Xiao Yan’s gaze doubtfully watched Queen Medusa’s unusually sleek red face. A moment later, he appeared to have understood something and quietly shouted “this is bad” within his heart. The instant that his voice sounded, he could clearly sense that a cluster of extremely hot heart flame had suddenly surfaced within his body…</p><br/><p>This cluster of heart flame was extremely dense and large. In just the blink of an eye, it covered every part of Xiao Yan’s body. Immediately, Xiao Yan’s entire body seemed to have been thrown into a furnace. The green flame on the surface of his body appeared to be completely useless. This was because the heat was being spread out from within Xiao Yan’s body…</p><br/><p>“This time around… it’s really going to be the end.” Xiao Yan could not help but laugh bitterly as he sensed the intense searing pain within his body that he had difficulty enduring. He could sense the increasingly hot temperature within his body. If this increase was to continue in this manner, everything within his body would gradually melt…</p><br/><p>“Ah… damn flame!”</p><br/><p>A stern sharp cry suddenly sounded just as Xiao Yan’s mind had gradually become chaotic due to the high temperature in his body. He struggled to open his eyes, forming a small gap. All he saw was that Queen Medusa was currently hugging her head with a bitter expression on her face. Moreover, there was an illusionary human figure and a snake figure around half an inch above her head which were repeatedly being entangled while being grilled by the invisible flame.</p><br/><p>“This stupid woman. Did she not know that the ‘Fallen Heart Flame’ can do enormous damage to a spirit. Since her spirit has yet to completely occupy her body, that flame will burn her spirit…”</p><br/><p>If Queen Medusa’s spirit had completely occupied the body of the ‘Heaven Swallowing Python’, the special burning effect that the ‘Fallen Heart Flame’ had toward a spirit would naturally be useless against her. Moreover, by relying on her own strength, it would be an extremely difficult task for the ‘Fallen Heart Flame’ to refine her even if she could not break the lock. Unfortunately, as it so happened, no matter whether it was the ‘Heaven Swallowing Python’ or Queen Medusa, neither of them had absolute control over the body. Hence, they had really met a true nemesis!</p><br/>\n</div>"}