{"title": "Chapter 616: Advancing to Dou Wang!", "id": 616, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-616-advancing-to-dou-wang", "volume_title": "Volume 7", "body": "<h1>Chapter 616: Advancing to Dou Wang!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 616: Advancing to Dou Wang!</u></strong></p><br/><p>Time flew by as spring left and autumn came. Without anyone realizing it, an entire year had passed since that soul-stirring battle had happened within the Inner Academy.</p><br/><p>During this one year, the Inner Academy, which had basically been turned into ruins during the great battle back then, was completely transformed. In the one year, there were old students who had left and more new students that had arrived. The entire Inner Academy was still filled with vitality. Every day, there were a countless number of students who shed perspiration like rain as they worked hard to obtain the glory of the ‘Strong Ranking’.</p><br/><p>As time flowed past one’s fingers, there would occasionally be someone who would throw their gaze toward the ‘Blazing Sky Qi Refining Tower’ that stood at the corner of the Inner Academy. They recalled the soul-stirring great battle that was gradually buried deep in their memories. They recalled the young man, who stood like a god in that battle, before eventually quietly falling, and immediately sighed repeatedly. If that person was still alive, it was likely that he would have become the strongest person of the Inner Academy besides First Elder Su Qian…</p><br/><p>In this one year, the lute had turned red and the plantain had turned green. During this one year, the speed at which the Inner Academy absorbed new students had become much faster than previous years, perhaps due to their intention to raise the competitiveness. Moreover, due to an increase in the number of people different kinds of small factions had also begun to repeatedly appear like bamboo shoots after the spring rain. The Inner Academy was a place that never lacked geniuses. Hence, within a short one year, there were quite a number of new student factions that stood up and squeezed into the top faction ranking within the Inner Academy.</p><br/><p>New students were easily arrogant. This arrogance was bred until it became more intense especially after they had obtained some results. However, no matter how wild and arrogant the new student factions were, they still did not have the slightest courage to provoke a faction which had currently grown into an enormous being. Although they knew that this faction had at the very most been established within the Inner Academy for two years, its strength was enough to look down upon the entire Inner Academy. Such a reputation was something that caused some of those in the Elder level within the Inner Academy to give it a sidelong glance. However, they did not find it surprising. This was because this faction was called ‘Pan’s Gate’!</p><br/><p>Its founder was the young man who had rescued the entire Inner Academy back then. His name was something that was extremely familiar in everyone’s mouth, even now.</p><br/><p>Xiao Yan!</p><br/><p>While time was flowing by in the lively and wonderful outside world, time appeared to have remained still in the magma world deep underground. Who would bother about the flow of time in this lifeless place?</p><br/><p>Of course, there seemed to be an exception…</p><br/><p>A large cluster of somewhat white-colored flame was slowly drifting deep within the magma. That cluster of white color was extremely eye catching in this magma world that was filled with a bright redness.</p><br/><p>Only by taking a more detailed glance and a closer look would one be able to discover that there appeared to be two faintly naked bodies within the cluster of white-colored flame. However, these two bodies were extremely quiet. Their unmoving manner gave them the appearance of corpses.</p><br/><p>There was no concept of time within the magma world. This cluster of flame appeared to be drifting aimlessly until it achieved its aim. Although it sensed that its targets this time around were difficult to chew, it was extremely patient. One year was merely something that passed by like a flick of its finger in its opinion…</p><br/><p>This was a completely dark, black space. The darkness was extremely pure and did not have the slightest thread of light. A pure consciousness appeared to be sleepwalking as it slowly flowed within it. There was no start point and no destination…</p><br/><p>No one knew how long it drifted within the darkness. Perhaps it was a year, perhaps decades. No one knew clearly. However, at a certain moment in the far distance, a faint green-colored light suddenly appeared within the black world. Being led by the green light, the drifting chaotic consciousness appeared to be like a catkins as it involuntarily slowly drifted closer…</p><br/><p>Only when the chaotic consciousness approached the faint green-colored glow did it realize that the light was a repeatedly flickering green-colored flame.</p><br/><p>The flame was not very large, but it was emitting a warm feeling that infiltrated the soul. Being shone by that warm light, the chaotic consciousness seemed to be slowly awakening. A torrent of memories swiftly surfaced, causing the consciousness to eventually find something that originally belonged to it…</p><br/><p>“I… am still alive?”</p><br/><p>An extremely faint muttering voice quietly sounded in this dark-black world. Immediately, the entire dark world suddenly began to ripple intensely. Suddenly, a few threads of light penetrated through the darkness and radiated on that consciousness, causing him to slowly open his eyes.</p><br/><p>The young man who was like a corpse that was drifting in the flames suddenly twitched his finger. Immediately, his tightly shut eyes opened in an abrupt fashion!</p><br/><p>Everywhere he saw was still the bright redness in his memory and the cluster of flame which he had once feared the most. However, having awoken or perhaps recovered from the endless darkness, he could only lower his head and look at his body, feeling at a loss. His strong fair build was not the least bit damaged. His fingers were slowly tightened in a somewhat unfamiliar manner. A strength that he had never felt before suddenly surfaced.</p><br/><p>The loss slowly disappeared from his black ink-like eyes. The mind of the naked young man moved. Without entering his training state, he was instantly able to clearly see everything within his body.</p><br/><p>The Qi Paths which had become distorted and dry before he had lost consciousness were just like numerous crystal clear spacious pipes that were emitting a faint fluorescent light. Although they did not move, he could still clearly sense that the Qi Paths that were currently in his body had a kind of drastic transformation compared to the past regardless of whether it was in terms of toughness or wideness!</p><br/><p>Xiao Yan’s mind shifted away from his Qi Paths and slowly swept across his entire body. However, he did not find any spot which showed any signs of being weak. Instead, this current body of his was completely different from before he had lost consciousness!</p><br/><p>He even thought that it was likely that the fighting strength his physical body could unleash was likely even stronger and more terrifying than his attack after using Dou Qi in the past.</p><br/><p>That’s right, Dou Qi!</p><br/><p>Xiao Yan mind moved abruptly and instantly appeared inside the vortex. His entire being suddenly became dull as he watched the completely empty vortex.</p><br/><p>“Where is the Dou Crystal? Where is the Dou Qi?”</p><br/><p>His face which had just regained some sleek blood-red color once again turned pale-white. Having once experienced life without Dou Qi, he clearly understood just what kind of frightening blow it was to lose his Dou Qi.</p><br/><p>At the moment when Xiao Yan’s mind was in a trance because of the strange disappearance of his Dou Qi, a rumbling sound was suddenly emitted from within his body. He was immediately extremely stunned to see a flood-like powerful Dou Qi suddenly surging out from every part of his body before flowing into the crystal-like Qi Paths. The crystal clear, almost transparent veins appeared to have long since built a dam, allowing the surging Dou Qi to flow and fill them. The veins shrank and expanded, emitting a kind of joyous cry that could not be heard.</p><br/><p>“This Dou Qi…”</p><br/><p>Xiao Yan was stunned as he focused on the Dou Qi that was surging like floodwater. He clearly felt this Dou Qi appeared to surge out from all over his body. It was different from the past where it would appear only after the rotation of the vortex…</p><br/><p>The young man blinked his eyes. Having recovered his alertness, he seemed to faintly understand something. His mind withdrew from his body. He slowly spread his palm before suddenly tightening it!</p><br/><p>When he clenched his palm, the space in front of him suddenly fluctuated. A cluster of fiery-red energy surfaced in a strange manner before appearing on his palm.</p><br/><p>An unusual glow was flickering in the young man’s dark-black eyes. After which, he scattered the energy on his palm and his shoulder shook gently. Dou Qi suddenly surged within his body before eventually following a strange vein route and came surging out from his back.</p><br/><p>“Peng!”</p><br/><p>Green-colored flame wings suddenly shot out from his back. They had an arc that was over ten feet in radius and appeared just like the wings of a phoenix, looking both gorgeous and stunning.</p><br/><p>“Dou Qi transformation into wings…”</p><br/><p>Xiao Yan tilted his head slightly. His eyes studied the green-colored flame wings that extended out of his back. He did not use any flying Dou Techniques nor did he use any Secret Technique. Additionally, he did not need to borrow anyone’s strength. He had completely relied on himself to display this Dou Qi transformation into wings!</p><br/><p>His expression appeared somewhat absent-minded. The green flame shone on his delicate and handsome face, which currently displayed an additionally maturity. Immediately, an arc quietly spread from the corner of his mouth. He clearly understood what being able to completely rely on his strength to transform Dou Qi into wings meant. It represented that from now on, Xiao Yan had truly stepped into the class of the strong in the continent.</p><br/><p>“Teacher, looks like fate has not cut off us teacher and disciple…” Xiao Yan lowered his head and rubbed the dark-black ring on his finger as he softly laughed.</p><br/><p>Xiao Yan ‘s gaze drifted over his fingers before his hand suddenly stilled. He immediately muttered uncertainly, “The storage ring… has disappeared?”</p><br/><p>Xiao Yan knit his brows and raised his eyes. He immediately swept one round around him only to raise his eyebrow immediately. With a swirl of his palm, he emitted a suction force, causing a pile of things to shoot over and linger around his body.</p><br/><p>Xiao Yan’s eyes swept across the Heavy Xuan Ruler, a couple of scrolls and some other things in front of him. He realized that all the medicinal pills and medicinal ingredients within the storage ring seemed to have disappeared.</p><br/><p>“Perhaps this is the reason that I was able to recover…” Xiao Yan was deep in thought. This was because he discovered that the green lotus which was under him had also vanished. It seemed like these missing things had something to do with his recovery.</p><br/><p>Xiao Yan was temporarily not bothered by all these things. He threw his gaze toward the other side. At that spot, a completely naked bewitching beauty had her eyes shut. The snake and human spirit above her head had already been mostly merged at this moment. It appeared that given a little more time, she would be able to completely merge the spirits and occupy this body.</p><br/><p>“Looks like Queen Medusa has gained the upper hand in this merger of spirits. However, they are originally one. The ‘Heaven Swallowing Python’ was born because of her while she lives because of the ‘Heaven Swallowing Python.” Xiao Yan felt some hesitation as he watched the extremely smooth merger of Queen Medusa. Finally, he abandoned the thought. This woman might be temperamental but she might be of some help to him in the future. If it was in the past, Xiao Yan would naturally be extremely afraid of her when Yao Lao falls into a slumber. Now, however, with the great increase in his strength, Xiao Yan already possessed the ability to protect himself. Even with Queen Medusa’s strength, it would no longer be as easy to kill him as in the past where killing him was as simple as killing an ant.</p><br/><p>This was the gap between a Dou Wang and Dou Ling. In the eyes of a truly strong person, only someone who had reached the Dou Wang class could be called strong.</p><br/><p>Everyone below a Dou Wang was an ant. These words were not a lie!</p><br/><p>The ‘Fallen Heart Flame’ suddenly quivered just as Xiao Yan was musing. Immediately, a pair of faint green glows slowly surfaced.</p><br/><p>A furious hiss immediately sounded when that pair of green glows swept toward the lively Xiao Yan. The glow immediately intensified and a cluster of intense heart flame once again surfaced strangely in Xiao Yan’s heart before engaging in willful destruction.</p><br/><p>Xiao Yan’s expression also changed a little the moment that the heart flame surfaced within his body. On the premise that he was nearly killed by the ‘Fallen Heart Flame’, he was currently also extremely afraid of the heart flame. However, while he was hurriedly maneuvering his Dou Qi in preparation to suppress the heart flame, he was stunned to realize that despite the cluster of heart flame going all out to unleash a frightening high temperature, it did not cause Xiao Yan any of the expected destruction or intense pain. Instead… it caused his body to be filled with a warm feeling.</p><br/><p>Xiao Yan rubbed his black hair which had regrown. His face was at a loss, “Don’t tell me that I have become accustomed to being burned?”</p><br/><p>Yao Lao had already fallen into a slumber so there was naturally no one who could answer him. However, since Xiao Yan had discovered that the ‘Fallen Heart Flame’ no longer had much effect on him, then… it was time to collect his debt.</p><br/><p>Xiao Yan slowly raised his head and stared at the two spots of faint green glows. A dense smile swiftly expanded from the corner of his mouth...</p><br/>\n</div>"}