{"title": "Chapter 611: Swallow, Seal!", "id": 611, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-611-swallow-seal", "volume_title": "Volume 7", "body": "<h1>Chapter 611: Swallow, Seal!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 611: Swallow, Seal!</u></strong></p><br/><p>“Bang!”</p><br/><p>An enormous firestorm appeared just like a mushroom cloud as it suddenly surfaced in the sky. An earth-shaking explosion caused the ears of many to ring. That wild and violent heat that came spreading from the sky caused shock to surge onto the faces of everyone.</p><br/><p>A human figure appeared to be like a ball that had been violently struck by a hammer the instant the green-white mushroom cloud surfaced as it shot down from the sky. Fresh bright-red blood splashed over the sky along the way, appearing like a fresh bloody rainbow.</p><br/><p>The expressions on the faces of those experts from the ‘Black-Corner Region’ changed drastically as they watched the human figure that shot to the ground from the sky. Although that aura was currently extremely weak, it undoubtedly belonged to Han Feng.</p><br/><p>Everyone looked at each other. Some cold perspiration seeped out from their forehead. Their gazes turned toward the other side of the sky. A black-colored figure was panting heavily there. The green fire wings on his back had become partially visible. Clearly, this was due to the interior of his body becoming weak.</p><br/><p>“This fellow… actually defeated Han Feng?”</p><br/><p>Everyone muttered to themselves. The shock in their tone was extremely obvious. Han Feng’s strength was already at the peak of the Dou Huang class. Additionally, he had the ‘Heavenly Flame’ to support him. He would at least have the ability to fight even when meeting with an extremely powerful early stage Dou Zong. Only the Gold Silver Brothers in the entire ‘Black-Corner Region’ could contend with him. Today, however, this expert who possessed an extremely great reputation in the ‘Black-Corner Region’ was defeated and reduced to such a miserable state by a young man who appeared to be only around twenty.</p><br/><p>The entire place was completely silent. Just what kind of reputation would one achieve after having defeated Han Feng, this expert who had quite the reputation even on the entire continent? At the very least, the name ‘Xiao Yan’ would become familiar in the entire ‘Black-Corner Region’ in the future.</p><br/><p>“Chi!”</p><br/><p>Two rushing wind sounds suddenly sounded in the silent sky. Immediately, two figures flashed and swiftly landed beside Han Feng and grabbed him. Only then did they help avoid the ending where the latter’s head turned into a cracked watermelon after landing on the ground.</p><br/><p>Of the two who intervened, one wore gold and the other silver. Naturally, they were the so-called Gold Silver Brothers. Han Feng was different from Fan Lao where Fan Lao could simply die. It was difficult to measure Han Feng’s value. Moreover, this fellow had yet to honor the reward for them to act this time around. How could he die?</p><br/><p>The silver-robed old man grabbed Han Feng who was covered in fresh blood and placed his hand on the latter’s chest. Only after sensing an extremely weak but still present heart beat did he sigh in relief.</p><br/><p>“Is he still alive?” The gold-robed old man frowned and asked.</p><br/><p>“Yes, there’s still a breath. Fortunately, this fellow also has a ‘Heavenly Flame’ to protect his body. Otherwise, it would definitely have been impossible for him to survive that kind of explosion.” The silver-robed old man nodded and immediately smacked his lips. He raised his head and looked at the black-robed, young man in the distance before saying, “Where did this brat come from? Why have I not heard that such a powerful fellow existed in the Jia Nan Academy?”</p><br/><p>“I don’t know.” The gold-robed old man’s face sank as he shook his head. His gaze was somewhat fearful as he stared at the enormous green-white mushroom cloud of fire. He subsequently looked at the experts from the ‘Black-Corner Region’ who had suffered great losses before speaking softly, “We cannot continue now. We should quickly leave. This fellow is seriously injured and unconscious. It is no longer possible to snatch the ‘Heavenly Flame’.”</p><br/><p>The silver-robed old man rolled his eyes before nodding slightly. He showed a hand sign to those experts from the ‘Black-Corner Region’ and those fellows immediately rushed over. Finally, they gathered into a group and cautiously looked at those Inner Academy’s experts who were looking at them with malice.</p><br/><p>“Xiao Yan, are you alright?” Su Qian also sighed in relief when he heard Han Feng had become unconscious due to his serious injury. Having lost this leader, there was no longer a need to fear those remaining fellows from the ‘Black-Corner Region’.</p><br/><p>Xiao Yan barely revealed a smile after hearing Su Qian’s cry. His pale-white face revealed the exhaustion within his heart. Although he felt somewhat regretful that Han Feng still possessed remnants of a breath, he did not have any other methods. Currently, the most important thing was that ‘Fallen Heart Flame’!</p><br/><p>That’s right. The ‘Fallen Heart Flame’... Xiao Yan’s heart suddenly quivered. His gaze swept toward the spot where the former was originally at. His eyes immediately shrank!</p><br/><p>That cluster of ‘Fallen Heart Flame,’ which had remained still in the sky, had unknowingly already appeared at the spot in the sky where the green white mushroom cloud formed by the explosion of the ‘Angry Buddha Lotus Flame’ without anyone realizing. As it approached, an enormous suction force suddenly surged out!</p><br/><p>Following the appearance of that suction force that enormous fire mushroom cloud appeared to have met a black hole as it swiftly moved and poured unceasingly into the cluster of invisible flame.</p><br/><p>The time which Xiao Yan had glanced over earlier was coincidentally the time that the ‘Fallen Heart Flame’ was swallowing the mushroom cloud. The latter’s strange action caused the uneasiness in his heart to soar. Although he was uncertain about the intention of the ‘Fallen Heart Flame’, Xiao Yan was still able to vaguely guess something after seeing this action. As a kind of pure ‘Heavenly Flame’, the ‘Fallen Heart Flame’ was able to swallow other ‘Heavenly Flames’ to strengthen itself. The fire mushroom cloud contained an extremely wild and violent ‘Heavenly Flame’ energy. This was definitely like a natural tonic to a spiritual being like the ‘Fallen Heart Flame’!</p><br/><p>Su Qian and the others sensed something the moment the suction force erupted from the ‘Fallen Heart Flame’. He immediately threw his gaze hurriedly over, only to have his expression change drastically.</p><br/><p>“Stop it!”</p><br/><p>Xiao Yan was the first to cry out loud. However, the Dou Qi in his body had temporarily signs of being completely empty due to him unleashing the ‘Angry Buddha Lotus Flame’ killing move earlier. Hence, all he could do was to issue a reminder.</p><br/><p>Xiao Yan’s voice had just sounded when Su Qian made his move. The latter’s body flashed and appeared around ten meters from the ‘Fallen Heart Flame’ in a ghost-like manner. However, he did not have the time to do anything when a large cluster of hot invisible flame charged over toward him, causing him to hurriedly dodge it.</p><br/><p>The swallowing speed of the ‘Fallen Heart Flame’ was frightening. In that short moment that Su Qian dodged, that enormous fire mushroom cloud appeared to be like a leaking balloon. It was completely swallowed into that large invisible flame less than ten feet in size. Everything occurred in just a couple of blinks.</p><br/><p>The body of the ‘Fallen Heart Flame’ had suddenly turned increasingly bright after such a majestic fire energy entered its body. An energy that was even wilder and more violent than before slowly curled out from within its body and spread across the entire Inner Academy.</p><br/><p>The expression of everyone present changed as they sensed the energy of the ‘Fallen Heart Flame,’ which had once again become wild and violent. Those Gold Silver Brothers no longer dared to stay any longer. With a cry, a large group of people shot toward the exterior of the Inner Academy in a fleeing manner, leaving behind dark and cold laughter containing a malice, which reverberated throughout the sky.</p><br/><p>“Tsk tsk, Elder Su, I shall now leave that thing for you to deal with. Hopefully, I will not hear news that the Inner Academy was completely destroyed tomorrow.”</p><br/><p>Su Qian’s face was dark and cold as he watched the experts from the ‘Black-Corner Region’ who had taken the opportunity to flee. He turned his head and shouted sternly toward the countless number of students not far away. “Everyone, leave the Inner Academy. Go into the deep mountains!”</p><br/><p>Those Inner Academy students who were gathered all over the top of some buildings also became a little chaotic after hearing Su Qian’s voice. The ‘Fallen Heart Flame’ in the sky may not have been enormous, but it was emitting a frightening destructive strength. They did not have the slightest doubt that the entire Inner Academy would be instantly destroyed if it were to descend!</p><br/><p>“Wait, Xiao Yan is still there.” Zi Yan pointed at the black figure in the distance after being pulled by Lin Yan as she spoke in an anxious manner. Her pink little face that appeared to be carved out of jade appeared a little pale under the pressure of the ‘Fallen Heart Flame’.</p><br/><p>“Relax, he can protect himself. Even Medicine Emperor Han Feng from the ‘Black-Corner Region’ was defeated by him. He will be safer than us.” Lin Yan could only try to persuade her as he watched the sea of people who appeared to be fleeing from calamity. After which, he followed everyone as they swarmed out of the Inner Academy.</p><br/><p>“All Elders, form the seal again! The survival of the Inner Academy depends on everyone!”</p><br/><p>Su Qian watched the students who were fleeing the Inner Academy like floodwater. Only then did he speak to the Elders in a deep voice.</p><br/><p>The faces of all the Elders were solemn when they heard this. Their bodies flashed up before forming a strange formation, encircling that cluster of ‘Fallen Heart Flame’.</p><br/><p>“Xiao Yan, leave quickly!”</p><br/><p>Su Qian was at the middle of the formation when he shouted to Xiao Yan who was still within the formation.</p><br/><p>Su Qian’s cry had just sounded when the ‘Fallen Heart Flame’ which had fallen into a silence after swallowing the fire mushroom cloud suddenly let out a sharp hiss. A green-colored glow slowly appeared on its surface, that seemed to be cast out of jade, much like a pair of eyes.</p><br/><p>The hissing sound had just appeared when the ‘Fallen Heart Flame’ shot out under the shocked gazes of all the Elders. From the direction of its route, its target was actually Xiao Yan, who was pausing in the sky!</p><br/><p>Xiao Yan’s expression had once again changed after being once again locked onto by the ‘Fallen Heart Flame’. He hurriedly maneuvered all the Dou Qi within his body as he turned around and rushed toward the exterior of the formation. Xiao Yan’s speed had clearly been greatly reduced after using the ‘Angry Buddha Lotus Flame’. On the other hand, the ‘Fallen Heart Flame’ had become even stronger after swallowing that ‘Heavenly Flame’ mushroom cloud. With such a difference, the ‘Fallen Heart Flame’ was about to catch up to Xiao Yan in the blink of an eye.</p><br/><p>“First Elder, form the seal quickly. Otherwise, we won’t be able to stop it once that beast leaves!”</p><br/><p>An Elder hurriedly shouted after seeing the ‘Fallen Heart Flame’ shooting explosively toward Xiao Yan.</p><br/><p>Su Qian’s face was as deep as water. He cried out, “Wait a little longer. Wait for Xiao Yan to leave.”</p><br/><p>“There’s no time!” Another Elder’s expression changed as he hurriedly spoke.</p><br/><p>Su Qian’s hand trembled slightly. All he did was use his eyes to stare at the ‘Fallen Heart Flame’ which was approaching Xiao Yan.</p><br/><p>Xiao Yan fled with all his might. Perspiration rolled down from his forehead like flowing water. His heart was just like a very tight robe as he sensed the hot temperature behind him. He did not dare to relax as his gaze stared at the edge of the formation not far away. As long as he managed to exit from there, he would be able to escape that death fire that was following him like a shadow!</p><br/><p>“Faster!” Xiao Yan repeatedly muttered within his heart. However, the temperature behind him soared just as he was less than ten meters from the edge of the formation. He turned his head around with shock and his dark-black eyes saw that cluster of invisible flame came pouncing at him. The sea of flame flowed and was about to swallow him!</p><br/><p>“Ha ha, this position of the hunter and the hunted has indeed been changed. It is just that I still failed to kill Han Feng in the end. Teacher, I’m sorry. I have implicated you… “ Xiao Yan emitted his last bitter mutterings just before he fainted.</p><br/><p>The silence in the sky appeared to solidify at this very moment.</p><br/><p>Numerous students on the many treetops outside the Inner Academy saw Xiao Yan being swallowed by the ‘Fallen Heart Flame’. All of them had suddenly become completely silent. Quite a number of female students covered their mouths and emitted numerous gasps.</p><br/><p>The hearts of Hu Jia, Wu Hao, Lin Yan, and Zi Yan slowly sank while they stood at the top of a tree. Some of the members of ‘Pan’s Gate’ revealed dull gazes, appearing at a complete loss. That leader of theirs who had never been defeated in their eyes was actually being swallowed and destroyed by that flame in front of their eyes!</p><br/><p>At that moment, the greatest support of ‘Pan’s Gate’ had completely collapsed…</p><br/><p>“Bang!”</p><br/><p>The ‘Fallen Heart Flame’ tried to charge out of the formation after swallowing Xiao Yan. However, an energy wall suddenly flashed in front of it and forced it back.</p><br/><p>The sky was completely silent. Su Qian’s expression was dark and cold, and all the Elders were quiet. They merely went all out in transmitting the Dou Qi from within their body and maintaining the firmness of this energy wall. Xiao Yan’s contribution in this great battle that affected the life and death of the Inner Academy was something that no one could match. If he had not defeated two Dou Huangs, it was likely that the ‘Black-Corner Region’ would have successfully launched a sudden attack on the Inner Academy!</p><br/><p>However, this greatest contributor to the Inner Academy was actually mercilessly swallowed by a ‘Heavenly Flame’ in front of everyone’s gaze at this very last moment...</p><br/><p>“Everyone, maintain the energy wall properly. Leave the seal to me.” Su Qian slowly recovered as he spoke with an expressionless face. He did not wait for any reply as a strange, circular, bright glow surged out from his body.</p><br/><p>“First Elder…” Some of the Elders were initially stunned when they saw Su Qian’s action. Immediately, they seemed to have understood something as they cried out in surprise.</p><br/><p>Su Qian ignored the surrounding surprised voices. The glow that surged out of his body grew increasingly intense. However, following the increase in the glow’s intensity, Su Qian’s face also swiftly became pale-white and even transparent…</p><br/><p>“Bastard, even if I risk this old life of mine, I will seal you forever in the magma today!”</p><br/><p>The dark, cold voice carried a volcano like fury as it was roared out from Su Qian’s mouth. Immediately, a ten-foot-long strange black glow swiftly surged out from Su Qian’s body and finally formed a thick black energy web in the sky. The black web shook slightly after it was formed. The next time it appeared, it had covered the ‘Fallen Heart Flame’ in an extremely strange manner!</p><br/><p>Threads of smoke immediately curled and rose from the ‘Fallen Heart Flame’ after the black web covered it. A sharp hiss resounded across the sky.</p><br/><p>Su Qian’s expression was pale. His breathing was as weak as gossamer. With a slight shift of his finger, the cluster of ‘Fallen Heart Flame’ that was struggling repeatedly slowly fell toward the ‘Blazing Sky Qi Refining Tower’. It appeared to have sensed something when it reached the top of the tower and began to go all out in its struggle. Under its intense resistant, the black web also remained still just above the top of the tower and had difficulty moving down.</p><br/><p>“Grug!”</p><br/><p>A ruthlessness flashed across Su Qian’s eyes as he saw that the ‘Fallen Heart Flame’ was still able to resist. He violently smashed his chest and a mouthful of fresh blood was spat out. Su Qian’s hand suddenly pressed down as the fresh blood was spat out and an unusually deep, dark-black energy pillar shot out explosively from his palm. It immediately smashed heavily against the ‘Fallen Heart Flame’.</p><br/><p>Hiss!</p><br/><p>A sharp hiss was once again emitted from the ‘Fallen Heart Flame’ after receiving Su Qian’s all out attack. It could no longer endure and was violently smashed into the deep underground magma world within the ‘Blazing Sky Qi Refining Tower’ while being wrapped by the black web!</p><br/><p>“Seal!”</p><br/><p>Su Qian hands formed a seal as he sensed the ‘Fallen Heart Flame,’ which was falling into the deep hold. A strange black glow surged out from within the tower. Finally, it agglomerated into a deep, dark-black energy barrier at the top of the tower. Above it was some strange energy lines that appeared to be meandering like some small snakes.</p><br/><p>The moment that the seal on the top of the tower was formed, a rich black glow slowly flowed within the last layer that was connected to the underground. Finally, the black glow surged out and became like a black sea that completely covered the entire last level. It was impossible for anyone to enter this place in the future. The ‘Fallen Heart Flame’ that was sealed deep underground would no longer have any chance of escaping!</p><br/><p>Su Qian’s body inclined slightly in the air after the seal was successfully formed. He immediately smashed head first toward the ground. Fortunately, an Elder reacted quickly and swiftly grabbed him. Only then did his body become stable.</p><br/><p>Su Qian slowly opened his blurry eyes. At this moment, his aura was so weak that it was little different from an ordinary old man. He took a glance at the sealed ‘Blazing Sky Qi Refining Tower’. This calamity of the Inner Academy was finally avoided. However… that young man who could have obtained the top achievement in the continent had died here…</p><br/><p>“Seal the last level of the ‘Blazing Sky Qi Refining Tower’ in the future. No one is allowed to enter, including me.” A faint weak old voice slowly reverberated throughout the sky. The messy Inner Academy also caused everyone to descend into a silence.</p><br/><p>“Additionally, remember that little fellow who sacrificed himself for the Inner Academy… without him, the Inner Academy would no longer exist. All of you might have been turned into powder and accompany these ruins during the eruption of the ‘Fallen Heart Flame’.”</p><br/><p>“He is the most outstanding student in all the history of the Jia Nan Academy. No one came before him and perhaps, no will will come after him…”</p><br/><p>“Remember that name. Ke ke, a stubborn little fellow…”</p><br/><p>“Xiao Yan!”</p><br/>\n</div>"}