{"title": "Chapter 618: Erode, Refine, Merge!", "id": 618, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-618-erode-refine-merge", "volume_title": "Volume 7", "body": "<h1>Chapter 618: Erode, Refine, Merge!</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 618: Erode, Refine, Merge!</u></strong></p><br/><p>The ‘Fallen Heart Flame’ immediately unleashed a frightening temperature the moment it entered Xiao Yan’s body. Under this high temperature, Xiao Yan gradually became boiling hot, resulting in a searing pain despite having the protection of the strange fluorescent light and his ‘Heavenly Flame’. This essence of the ‘Fallen Heart Flame’ may not be large, but it took shape only after accumulating for a countless number of years. Therefore, its temperature was extraordinary.</p><br/><p>Despite the searing pain once again appearing within his body, it was not to an extent where it was impossible to endure after Xiao Yan had experienced the intense pain which was worse than death the last time. He forcefully stabilized his mind. Surging green flames flowed out from his body and immediately formed a dragnet shape before surrounding the ‘Fallen Heart Flame’, which was causing destruction within Xiao Yan’s body.</p><br/><p>At this moment, the ‘Fallen Heart Flame’ clearly still possessed its own awareness despite having been absorbed into Xiao Yan’s body. Hence, it was crafty as it wiggled in all directions after being surrounded by Xiao Yan. The frightening high temperature no longer caused Xiao Yan to feel pain to the point where he no longer wanted to live. However, it was unavoidable that it would cause a frustration to form in a person’s heart if this was prolonged.</p><br/><p>The capturing continued for nearly ten minutes before Xiao Yan finally ceased this pointless action. Dragging things out in this manner was useless…</p><br/><p>“I don’t believe that I cannot capture you…”</p><br/><p>Xiao Yan’s mind slowly became quiet. Threads of dense fluorescent light suddenly seeped out from all over his body before spreading to every single corner of it.</p><br/><p>Being shined upon by the fluorescent light, the ‘Fallen Heart Flame,’ which was moving in a strange manner, finally became slightly slow. Xiao Yan grabbed this opportunity and used the ‘Green Lotus Core Flame’ to wrap around it.</p><br/><p>The ‘Fallen Heart Flame’ did not give up despite being surrounding by the green flame. Instead, it began to struggle intensely, like an imprisoned beast. It repeatedly emitted a frightening temperature. Under that increasingly intense temperature, Xiao Yan’s originally calm face slowly revealed some pain.</p><br/><p>Xiao Yan forcefully endured the searing pain. His mind moved, and the green flame whistled within his body. Finally, it swiftly moved and formed a bright green fireball. The interior of the fireball was the ‘Fallen Heart Flame’ which was struggling with all its strength in an attempt to escape.</p><br/><p>Xiao Yan’s mind passed through the flame and carried a sternness as he watched the ‘Fallen Heart Flame’ within it. His mind turned and the flame rolled. Immediately, waves of green flame came spreading out before finally becoming like numerous tunnels that were inserted into the palm-sized cream-white ‘Fallen Heart Flame’.</p><br/><p>Following the pouring in of the green flame, that cluster of ‘Fallen Heart Flame’ began to feel threatened. It immediately rolled intensely. However, due to the various interceptions from the ‘Green Lotus Core Flame’, it was difficult for it to escape this dragnet-like lock no matter how it leaped and struggled.</p><br/><p>At this moment the ‘Fallen Heart Flame’ already possessed its own will. Hence, Xiao Yan needed to remove its will if he wanted to swallow and refine it. Otherwise, swallowing it forcefully would only incur the resistance between the two kinds of ‘Heavenly Flame’. If they were to erupt at that time, the one who would be the most unlucky would be him. This action of Xiao Yan was controlling the ‘Green Lotus Core Flame’ to completely removing the will of the other flame!</p><br/><p>The ‘Fallen Heart Flame’ was also clear about Xiao Yan’s intentions. Hence, it went all out in an attempt to resist it. However, at this moment, it had already become a fish on the chopping board. It was all up to Xiao Yan whether to kill it or cut it up…</p><br/><p>Everything in this world was basically a cycle with ups and downs. Earlier, the ‘Fallen Heart Flame’ could have refined Xiao Yan, but had failed due to various reasons. At this moment, it had become Xiao Yan’s turn to call the shots. With his tactic, it was only natural that he did not give it up!</p><br/><p>The retaliation of the ‘Fallen Heart Flame’ was not of much use. Following the ‘Green Lotus Core Flame’ being poured in unceasingly, the resistance of the ‘Fallen Heart Flame’ was gradually reduced. However, this had at the very least transmitted a message to Xiao Yan. The will of the ‘Fallen Heart Flame’ had already begun to be eroded by the ‘Green Lotus Core Flame’...</p><br/><p>Xiao Yan could suddenly hear a faint sound from the ‘Fallen Heart Flame’ during the erosion. Although he was uncertain what the specific wording of this sound was, the taste of begging for mercy was extremely clear.</p><br/><p>“Begging for mercy…”</p><br/><p>The corner of Xiao Yan’s mouth was lifted in a dense and cold manner. He laughed coldly, “Back then, why did I not see you showing mercy to us when you were refining teacher and me? If not for my good luck, it is likely that I would have been swallowed by you…”</p><br/><p>Xiao Yan’s mind moved after the voice sounded. The speed at which the green flames were delivered became increasingly swift and ferocious. Xiao Yan was expressionless, and was not the least bit swayed by the ‘Fallen Heart Flame’s’ attempt to beg for mercy.</p><br/><p>The erosion proceeded extremely slowly. However, Xiao Yan was not in a hurry. No matter how one put it, a ‘Heavenly Flame’ was something that possessed the greatest destructive strength in nature. The time needed for it to agglomerate its own will was a frightening number of years. Attempting to remove this will might not need such a long period of time, but one would be daydreaming if one thought they could achieve it in a short period of time.</p><br/><p>Time gradually flowed by under this dull erosion. Xiao Yan also appeared to be like an old monk meditating, unaffected by anything in the outside world. He gathered his mind and placed all his attention on that cluster of cream-white flame.</p><br/><p>Such slow corrosion proceeded for an unknown period of time. Perhaps it was a month, perhaps it was longer. The concept of time had became extremely vague in this place…</p><br/><p>The green fire was being cycled without knowing fatigue within the green fireball. That cluster of cream-white flame had also transformed to its current silent and peaceful state compared to its intense struggle and resistance of the past. This clearly indicated that the will of the ‘Fallen Heart Flame’ was gradually disappearing…</p><br/><p>“Crack…”</p><br/><p>A slight cracking sound suddenly appeared within the quiet body. Following the appearance of this sound, Xiao Yan’s quiet mind also leaped violently. He turned toward the ‘Fallen Heart Flame’ wrapped by the layers of green flame. At this moment the ‘Fallen Heart Flame’ was suspended within it. The cream-white cluster was warm and peaceful.</p><br/><p>The thread of will within the ‘Fallen Heart Flame,’ which had been originally filled with offensive and destructive properties, had finally disappeared after prolonged corrosion by Xiao Yan. The current ‘Fallen Heart Flame’ appeared as though it had just been born, and did not possess the slightest offensive properties.</p><br/><p>“Have we finally succeeded?”</p><br/><p>Xiao Yan’s mind awoke from the dormant-like state following the disappearance of the ‘Fallen Heart Flame’ consciousness. Although he did not exactly count the time, he could faintly feel that the erosion this time around had likely taken quite a bit of time.</p><br/><p>“No matter how much time was consumed, it is far better than being trapped here forever…” Xiao Yan comforted himself within his heart. His mind moved, and the green fireball that had wrapped around the ‘Fallen Heart Flame’ swiftly disappeared. That ‘Fallen Heart Flame’ was also suspended quietly. Its temperature was lowered such that Xiao Yan no longer felt a searing pain.</p><br/><p>“Next, it should be the refinement…”</p><br/><p>Xiao Yan smiled as he watched the cluster of ‘Fallen Heart Flame’. His mind controlled the cluster of ‘Fallen Heart Flame’, and slowly moved it into his veins. After which, he began to move it along the route of the ‘Flame Mantra’ and quietly circulated it…</p><br/><p>The refinement of the ‘Fallen Heart Flame’ without its consciousness was much easier than Xiao Yan had expected. Perhaps this was due to his body having been burned by the damn flame for such a long period of time, resulting in a tacit understanding that had faintly formed between the two. In any case, the refinement of the ‘Fallen Heart Flame’ this time around was smoother than when Xiao Yan had first refined the ‘Green Lotus Core Flame’.</p><br/><p>Of course, despite the process being smooth, there was a similarity with the erosion of the will of the ‘Fallen Heart Flame’. That similarity was that it was still slow… slow to the point that it gave one the feeling of being about to collapse.</p><br/><p>Fortunately, no matter how frighteningly slow the process was, it would at the very least, ultimately reach its destination.</p><br/><p>Xiao Yan once again woke up from his dormant state the moment the ‘Fallen Heart Flame’ was successfully refined. His mind was watching the ‘Fallen Heart Flame’ flowing within his Qi Paths. A joy slowly climbed from deep within his heart before eventually causing a happy smile to appear on the young man’s face.</p><br/><p>Xiao Yan was in no hurry to control its merger with the ‘Green Lotus Core Flame’ after having refined the ‘Fallen Heart Flame’. He clearly understood that this step was the most important one in the practice of the ‘Flame Mantra,’ and also the most dangerous step.</p><br/><p>Xiao Yan slowly opened his eyes and observed the whitish flame which was wrapped around him. He let out a soft laugh. Currently, the flame which originally had a great offensive strength against him had already become like his arm. Commanding it was extremely easy with no feeling of sluggishness.</p><br/><p>Xiao Yan’s gaze turned toward the bewitching beauty within the flame. The latter was still in a state where spirits were being merged. However, from looking at the increasingly substance-like spirit above her head, it was clear that she had already entered the final stage. Perhaps in only a short time, this Queen Medusa will have complete control over that body. At that time, she would truly make a complete transformation and turn into an extremely powerful person of the Dou Zong class!</p><br/><p>Xiao Yan’s eyes carelessly swept over Queen Medusa’s lovely, naked body before quickly shifting it away. This woman was entirely filled with a kind of unusual allure toward men. Even without moving, as was currently the case, she still caused a nefarious flame to leap within one’s heart.</p><br/><p>Xiao Yan finally controlled his mind after being quiet for a period of time. His expression was solemn as he extended his heart deep into his body, and began to attempt this last extremely critical step.</p><br/>\n</div>"}