{"title": "Chapter 613: Appearance of the Snake", "id": 613, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-613-appearance-of-the-snake", "volume_title": "Volume 7", "body": "<h1>Chapter 613: Appearance of the Snake</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 613: Appearance of the Snake</u></strong></p><br/><p>The thing that woke Xiao Yan up from his training state was the repeatedly sounding weak old voice within his heart.</p><br/><p>Xiao Yan’s tightly shut eyes were slowly opened after hearing Yao Lao’s voice. His gaze glanced at the increasingly illusory dense white flame over his body and his heart involuntarily sank a little.</p><br/><p>“Little fellow, I have already reached my limit…” Yao Lao sigh slowly sounded after having appeared to sense that Xiao Yan had awakened.</p><br/><p>Xiao Yan nodded slightly as he softly spoke, “Teacher, you have worked hard…”</p><br/><p>“Ke ke.” Yao Lao laughed. His laughter had a frailness that was difficult to hide. “In another couple of minutes, you will need to block the refinement of the ‘Fallen Heart Flame’ on your own. Hopefully, you will be able to endure…”</p><br/><p>Xiao Yan was quiet. A moment later, he smiled bitterly and said, “I will do what I can as a person. The rest is up to fate…”</p><br/><p>No matter how much confidence filled Xiao Yan, he did not hold much hope in his chances of escaping from this hopeless environment where even Yao Lao could not sense much chances of survival. The only thing he could currently do was to do his best to hold out against the refinement of the ‘Fallen Heart Flame’ for a little longer.</p><br/><p>Yao Lao gradually descended into silence. He clearly knew that his slumber this time around might be an everlasting farewell. His spirit may be able to hide in the ring that he had specially constructed, but the ‘Fallen Heart Flame’ was coincidentally able to counter that. Under the incineration of this kind of flame, even a spirit would end up being incinerated into nothingness.</p><br/><p>Xiao Yan lifted his head slightly during the time that Yao Lao was quiet. His gaze swept over this large cluster of invisible flame. It was difficult to imagine that this flame actually possessed its own intelligence… Two faint green lights suddenly surfaced from a certain spot within the invisible flame as Xiao Yan was looking around. It looked like a pair of eyes containing greed as they watched the spot where Xiao Yan was at. A cluster of invisible flame suddenly surfaced with a slight flicker of the green glow. Finally, it adhered to the dense white flame that was partially above Xiao Yan’s body, incinerating and corroding it.</p><br/><p>“Little fellow, prepare yourself.”</p><br/><p>Yao Lao’s soft sigh suddenly sounded. Xiao Yan clearly knew that Yao Lao had already reached his limit. He needed to rely on himself for everything else…</p><br/><p>The corner of Xiao Yan’s mouth curled bitterly. He immediately inhaled a deep breath of air as his palm moved. Green flame flowed, following the Qi Paths in his body. Finally, it slowly seeped out and wrapped Xiao Yan’s entire body in it.</p><br/><p>The dense white-colored flame outside grew increasingly faint following the appearance of the ‘Green Lotus Core Flame’. Finally, it disappeared abruptly and the outermost layer of invisible flame swiftly swarmed in. It was about to burn the person inside when it was blocked by a cluster of green flame.</p><br/><p>“Little fellow, you have to rely on yourself next. Hopefully, you can successfully endure this. The lives of both teacher and disciple are in your hands…” Yao Lao weak voice became increasingly faint. A moment later, it disappeared completely.</p><br/><p>Xiao Yan clearly sensed Yao Lao’s awareness swiftly withdrawing from his body as his voice disappeared. The instant that Yao Lao’s awareness was about to completely withdraw, a powerful energy quietly swarmed out from Xiao Yan’s body, causing his aura to soar greatly.</p><br/><p>“Teacher, this student will not disappoint you.”</p><br/><p>Xiao Yan bit his lower lip tightly as he felt a powerful energy filling him. A redness surfaced in his eyes. He clearly understood that Yao Lao had loaned all his remaining strength to him. The latter’s body had once again hid inside the ring and descended into a slumber due to the exhaustion of his Spiritual Strength.</p><br/><p>After taking over Yao Lao’s earlier work, Xiao Yan finally understood just how great the exhaustion from contending with the ‘Fallen Heart Flame’ was. Perhaps it was due to the gap between his strength and that of Yao Lao’s. Although the ‘Green Lotus Core Flame’ and the ‘Bone Chilling Flame’ were both ‘Heavenly Flames’. The protection that Xiao Yan received from the two flames was quite different.</p><br/><p>Although Xiao Yan would feel searing pain when Yao Lao used the ‘Bone Chilling Flame’, it was not unbearable. However, when Xiao Yan was relying on himself to resist the ‘Fallen Heart Flame’ that searing pain had suddenly deepened greatly. Even the clothes on Xiao Yan’s body were grilled by the high temperature until they were increasingly thin and brittle. They even broke into a large pile of powder as Xiao Yan moved his body, leaving behind the naked body that was seated cross-legged in the green lotus.</p><br/><p>“Hiss…”</p><br/><p>Xiao Yan’s face twitched. Threads of cold air repeatedly seeped out from between the gap of Xiao Yan’s teeth. His white skin had also become a sleek red due to the heat. Some areas had even quietly broken out with blisters. At a glance, he was in an extremely miserable state.</p><br/><p>Xiao Yan forcefully suppressed the searing heart-wrenching pain. He took out a bottle of ‘Energy Recovery Pills’ from within his storage ring with much difficulty and stuffed all of them into his mouth. His body was being wrapped by the ‘Fallen Heart Flame’. Although there was still fire energy drifting around his body, it was extremely difficult to absorb while under the control of the ‘Fallen Heart Flame’. Hence, Xiao Yan could only use medicinal pills to endure for a little longer!</p><br/><p>“It is really unexpected that the ‘Fallen Heart Flame’ is actually this terrifying… no wonder even teacher is extremely afraid of it. However… according to this exhaustion rate, I’m afraid that I won’t be able to endure for even a week.” Xiao Yan’s mouth was filled with medicinal pills as he eyed the seemingly never ending invisible flame on the outside. His heart was filled with bitterness. This desperate situation caused people to be able to go nowhere.</p><br/><p>“Looks like I can only hope for a miracle to appear…”</p><br/><p>Xiao Yan’s dry mouth moved as he sensed the torturous searing pain. It was a long time later that he slowly shut his eyes. He had already done his best. After this, it was up to fate to decide whether he was to live or die…</p><br/><p>There was no concept of time in this never ending magma world and Xiao Yan did not have the slightest thought to pay attention to the flow of time under this inhumane torture. He only knew that he could turn to dust, like his clothes, at any time under this hot temperature and disappear in this magma world.</p><br/><p>A solitude and loneliness that was difficult to describe swarmed deep into Xiao Yan’s heart while under this torment. There was no sound other than the sound that was emitted from the flow of magma deep in the magma world. The entire world appeared to be completely isolated. That kind of loneliness and silence in the vast world once again caused Xiao Yan who was tortured by the high temperature to feel a sense of exhaustion and loss in his soul.</p><br/><p>Perhaps he would forget just how moving the voice that was emitted when his throat trembled after living such a life for a long time. He might even forget his identity as a human. The solitude and loneliness of the world seeped deep into his bones and could not be removed.</p><br/><p>Xiao Yan did not know how long he had endured. He merely sensed the increasingly hot temperature of the outside world as time passed. Fortunately, his skin showed faint signs of resistance to the flame after being grilled by it for such a long time. It was due to this that the repeated searing pain did not cause him to become insane.</p><br/><p>On top of the intelligence that the ‘Fallen Heart Flame’ possessed, the flame also appeared to have a patience that was far beyond what any human could compare with. One would understand the reason for this after some thought. It would be strange if it did not have patience after staying in this place for so many years. Moreover, it was because of this that it did not choose to use the most intense method to finish off Xiao Yan in the shortest amount of time. Instead it had chosen this kind of refinement with a slow flame. However, such slow refinement really did cause Xiao Yan to experience the feeling of being better off dead.</p><br/><p>Xiao Yan’s entire person appeared to be in a blurry state under the unceasing grilling by the ‘Fallen Heart Flame’. He could only maneuver the green flame in his body in a mechanical fashion to repeatedly resist the burning of the flame. After which, he would also absorb the surrounding energy that was difficult to absorb in a mechanical fashion to supplement what his body needed.</p><br/><p>This kind of mechanical operation caused Xiao Yan to faintly feel that he was becoming increasingly familiar with the control of the ‘Heavenly Flame’. However, other than allowing him to save some of the unnecessary exhaustion of the ‘Heavenly Flame’, it did not appear to allow him to escape…</p><br/><p>If this situation continued, Xiao Yan would likely be completely refined within a short period of time. The ‘Green Lotus Core Flame’ in his body would also be swallowed by the ‘Fallen Heart Flame’...</p><br/><p>Xiao Yan endured with great difficulty. No one knew just how long he had endured in this world without any concept of time. Perhaps it was two days, one week, half a month, a few months…</p><br/><p>At a certain instant, Xiao Yan had woken up from this kind of half-conscious state. Waves of a cool feeling were transmitted from his arm. This cool feeling was like ground that had been dried for countless number of years suddenly meeting heavy rain. It caused Xiao Yan’s entire spirit to tremble as he immediately opened his eyes. He tilted his head and looked at the seven-colored little snake that was lingering on his arm after having been forgotten for an unknown period of time…</p><br/><p>“Heaven Swallowing Python?” Xiao Yan’s muddled head suddenly recovered its clarity as he involuntarily cried out. Perhaps even he did not realize that his voice had become dry and hoarse compared to before.</p><br/><p>One can imagine just how excited Xiao Yan currently was when he was suddenly able to see something that could talk to him in this kind of lonely and isolated place, that caused one to become crazy.</p><br/><p>However, Xiao Yan’s heart suddenly leaped on top of his excitement when his gaze swept over those bewitching snake eyes. At this moment, the color of the latter’s eyes was repeatedly changing. That icy coldness was occasionally filled with liveliness. Clearly… the two spirits within this little body appeared to be engaged in an intense fight for the control of the body at that moment.</p><br/><p>Xiao Yan did not have any solution with regards to this fight. Hence, he could only watch with his eyes.</p><br/><p>The fight continued for nearly ten minutes or so. After which, a bright seven-colored glow surged out from the ‘Heaven Swallowing Python’. The latter violently swung its tail as a tiny figure directly shot out. It immediately flew swiftly, and seeped out from the area that was surrounded by Xiao Yan’s green flame.</p><br/><p>The ‘Heaven Swallowing Python’ had just left the area surrounded by the ‘Green Lotus Core Flame’ when the ‘Fallen Heart Flame’ that was flowing freely outside pounced over. However, just before it made contact with its body, the ‘Heaven Swallowing Python’ suddenly wiggled swiftly under that seven-colored glow. Immediately, a naked, lovely, perfect white-jade-like body slowly appeared in front of Xiao Yan’s gaze.</p><br/><p>Xiao Yan looked at the bewitching beautiful woman who was filled with allure as she appeared out of nowhere. His heart, however, slowly sank…</p><br/>\n</div>"}