{"title": "Chapter 623: Test", "id": 623, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-623-test", "volume_title": "Volume 7", "body": "<h1>Chapter 623: Test</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 623: Test</u></strong></p><br/><p>Bright-red magma covered the sky. Strangely, however, it did not scatter down, but instead solidified in mid-air. That manner was as though it was like the sky was flooded with fresh blood, appearing extremely eye-catching.</p><br/><p>The entire plaza was deadly silent. Everyone was stunned as they looked at the sudden change of the ‘Blazing Sky Qi Refining Tower’. After two years, the new students who had entered the Inner Academy were mostly unaware of the earth-shaking great battle that had erupted in the Inner Academy back then. Hence, it was the first time they had seen any change in the ‘Blazing Sky Qi Refining Tower’!</p><br/><p>The stunned looks continued for an instant before they were suddenly awaken by the wild joyous cry that resounded throughout the sky. Everyone who had yet to recover blinked their eyes while feeling at a loss. Xiao Yan? This name… seemed a little familiar.</p><br/><p>Of course, this name might be only familiar to ordinary students, but it was unforgettable to some people. Immediately, numerous shocked gazes carried disbelief as they turned toward the ‘Blazing Sky Qi Refining Tower’!</p><br/><p>“Xiao… Xiao Yan? This fellow is still alive? He is really still alive! This voice cannot be wrong! Cannot be wrong!”</p><br/><p>Wu Hao’s usual stern face was covered with an unrestrained joy at this moment. His gaze stared intently at the bright-red magma pillar which had erupted from the top of the ‘Blazing Sky Qi Refining Tower’. His voice had become somewhat hoarse in his excitement.</p><br/><p>Xiao Yu by the side was biting her lower lip with the back of her teeth. Her lovely body shook gently. Some moisture even surged into her eyes in her excitement. He was still alive? He was really still alive!</p><br/><p>Not only were the Elders on the tall platform affected, but even the indifferent faced First Elder Su Qian was also using a stunned gaze to look at the magma pillar that shot directly to the sky. A moment later, he finally said, somewhat absent-minded, “The voice just now… it appears to be Xiao Yan?”</p><br/><p>“First Elder, it’s Xiao Yan! There’s no mistake. I said that that fellow will definitely not die! Ha ha!” Lin Yan’s face turned bright-red in his excitement. For some unknown reason, he held a confidence for that fellow which was difficult for an ordinary person to understand. Even though Xiao Yan was swallowed by the ‘Heavenly Flame’, and was dragged into the endless underground, he firmly believed that the strong stubborn fellow would definitely climb out once again!</p><br/><p>Although this absolute confidence was a somewhat pedantic stubborness, he still believed it! Moreover, he did it without the slightest reason.</p><br/><p>“It is good that he didn’t die. It is good that he didn’t die…” First Elder laughed. Although his face appeared calm, his tone also revealed shock and excitement in his heart.</p><br/><p>“This fellow… really cannot be predicted with common sense.”</p><br/><p>Lin Xiuya and Liu Qing exchanged glances before smiling with a sigh. It was fortunate that they had remained behind back then. Otherwise, they would not be able to see this shocking scene today.</p><br/><p>Under the many gazes that were filled with different emotions, the magma pillar that had erupted out from the top of the ‘Blazing Sky Qi Refining Tower’ suddenly coagulated and immediately broke apart in the air. A human figure slowly appeared in front of everyone’s gazes after the magma pillar broke apart automatically.</p><br/><p>The person who was at the spot where the magma was had a tall frame and was wearing a black robe. This, accompanied by the warm smile that hung on his delicate and handsome face, gave him a uniquely handsome look. Everyone was slightly startled when they saw the young man walking out from the magma without the slightest injury. Immediately after that, they suddenly appeared to have recalled something. All the gazes suddenly turned toward the sculpture in front of the entrance of the ‘Blazing Sky Qi Refining Tower’. Numerous sounds of people inhaling cold air appeared one after another in the plaza. Now, they had finally recalled who exactly the so-called Xiao Yan was…</p><br/><p>The black-robed young man was suspended in the sky. His gaze slowly swept over the large crowd below before eventually seeing some familiar faces. A smile was lifted from the corner of his mouth as he laughed in a clear and loud manner, “Ke ke, everyone, Xiao Yan is back. Do you welcome me?”</p><br/><p>“Little fellow, it is really unexpected that we can meet again.” A smile involuntarily surfaced on Su Qian’s face as he laughed out loud after hearing that clear laughter of the young man.</p><br/><p>“After not seeing you for so long, First Elder is becoming stronger with age.” Xiao Yan smiled. He waved his sleeves and the bright-red magma all over the sky strangely rushed back and was returned to the magma pillar. Immediately, the enormous magma pillar suddenly followed the ‘Blazing Sky Qi Refining Tower’ as it smashed down in front of a countless number of shocked gazes. That great momentum caused one’s mind to tremble. Their gazes were all filled with a much denser respect the next time they looked at Xiao Yan.</p><br/><p>He had actually forced back such an enormous magma pillar by simply raising his hand. This posture of the strong caused a fiery heat to rise in the eyes of many students. This was the realm they were pursuing!</p><br/><p>Xiao Yan’s toes pressed on the air after expelling all the magma. A faint silver glow appeared, and his body flashed and appeared on the tall platform in a ghost-like manner.</p><br/><p>Everyone on the tall platform knit their brows slightly when they saw this ghost-like speed of Xiao Yan. Clearly, the current Xiao Yan seemed to be much stronger than he was in the past.</p><br/><p>“You’ve advanced to the Dou Wang class?” A glint flickered passed Su Qian’s eyes as he laughed. He knew that Xiao Yan’s true strength in the past was at the very most at the Dou Ling class. Although he was eventually able to fight with an expert Dou Huang like Han Feng, the former, given his eyesight, naturally understood that the strength did not truly belong to Xiao Yan. Now, however, he could clearly sense that Xiao Yan was really using his own strength when displaying his speed.</p><br/><p>“I think so.” Xiao Yan rubbed his head. He was also not very certain. This time around, his breakthrough was achieved in an unconscious state. Hence, he was not very clear just what class he was currently in.</p><br/><p>“Why don’t you let Lin Xiuya try?” Su Qian laughed. He was also quite curious about just what level this fellow had reached, who always caused people to witness a miracle, after not seeing him for two years.</p><br/><p>“I could not wish for more. Back then, I had ultimately not sparred with him.” Xiao Yan laughed softly. His gaze was thrown toward the eager face of Lin Xiuya behind Su Qian.</p><br/><p>“Not having exchanged blows with you has always been my regret. It is best that I make up for it today.” Lin Xiuya smiled. His toes pressed on the rock platform, and his body rushed down before eventually appearing on an empty piece of land in the plaza. After which, he raised his head and looked at Xiao Yan with eager eyes.</p><br/><p>The conversation between Su Qian and the rest had not been suppressed. Hence, everyone’s faces had immediately become excited when they saw Lin Xiuya stepping down from the platform. With a flapping sound, all of them surrounded the place until nothing could pass. There was hardly anyone who did not know of Lin Xiuya’s reputation. The founder of ‘Wolf Teeth’. Although he was currently no longer involved in the matters of ‘Wolf Teeth’, ‘Wolf Teeth’ still stood as a top tier faction within the Inner Academy by relying on his reputation. There was seldom anyone who dared to offend them.</p><br/><p>Of course, most of the thoughts people were having were about witnessing Xiao Yan’s true strength. During these years, Xiao Yan’s name had already become a legend within the Inner Academy. Although many people verbally passed on the earth-shaking battle back then, some of the new students could not help but form doubt in their hearts after hearing a lot about it as time passed on. A student who was of similar age as them back then was actually able to defeat an expert Dou Huang after having only arrived for one year? Was this not too great of an exaggeration?</p><br/><p>Hence, they were naturally extremely happy and wanted to experience an eye-opening battle. Especially now that they had witnessed Xiao Yan appearing, and was already about to spar with an expert like Lin Xiuya the moment he did so.</p><br/><p>Although Lin Xiuya had already become an Elder, he still possessed quite a great reputation among the students these few years. His great strength also caused some of the thorn-like students to be afraid of offending him. Therefore, many students felt that he was the right choice to be Xiao Yan’s opponent.</p><br/><p>Xiao Yan also involuntarily shook his head as he watched the black mass of human crowd below. Was the activity in this place not a little too large?</p><br/><p>“Little fellow, currently, the Inner Academy is even more competitive than two years ago. There are a countless number of thorny students. You don’t want your status as a Senior to be doubted by these little fellows right?” Su Qian smiled and spoke. His attempt to get Xiao Yan and Lin Xiuya to spar in public was to help raise Xiao Yan’s reputation. There were currently too many new students. People from the past tend to be easily forgotten.</p><br/><p>“Two years? I didn’t expect that two years had actually passed by with a glance…” Xiao Yan was stunned and he involuntarily sighed sobbingly. He immediately nodded and his body flashed. The next time he appeared, he was shockingly already standing in front of Lin Xiuya.</p><br/><p>“Xiao Yan, you are the leader of our ‘Pan’s Gate’ so you better not lose our face. Currently, all the brothers in ‘Pan’s Gate’ are watching you, our leader who has been missing for two years!” Xiao Yan had just stabilized his body when a loud laugh suddenly sounded from outside the battleground. He was startled before following the voice to take a look. There was a large group of black mass on a tall platform outside the plaza. The few leaders of this large group were surprisingly Wu Hao, Hu Jia, Zi Yan, and… Xiao Yu huh?</p><br/><p>A large group of people with heated gazes were behind these few people. At this moment, their gazes were searing hot as they watched the black-robed young man in the battleground. At the time they joined ‘Pan’s Gate’ they had heard quite a number of people describing the stories when ‘Pan’s Gate’ was founded and their founder. Hence, this Xiao Yan, whom they had never seen before, had a majestic position within their hearts.</p><br/><p>“I will catch up with all of you later.”</p><br/><p>Xiao Yan smiled toward Wu Hao and the others before slowly turning toward Lin Xiuya who was looking at him solemnly. The other party’s eyes were filled with an unusually intense fear. This kind of expression had appeared in Xiao Yan in the past. Now, its position had changed.</p><br/><p>Su Qian smiled on the high platform as he looked at the two who were facing each other. He asked, “How many exchanges do you think Lin Xiuya will be able to endure in Xiao Yan’s hands?”</p><br/><p>Everyone was startled when they heard this. It was a long while later before an Elder softly inquired, “Is First Elder referring to the precondition that Xiao Yan had used all the things to raise his strength?”</p><br/><p>“His own strength.” Su Qian shook his head slightly and softly spoke, “I guess that it won’t exceed three exchanges.”</p><br/><p>All the Elders were startled. It was a long while later before that Elder laughed dryly, “Lin Xiuya is currently a five star Dou Wang. It would be somewhat difficult to defeat him within three rounds even if it was an ordinary Dou Huang.”</p><br/><p>Su Qian simply smiled without speaking. Although Xiao Yan’s aura was somewhat strange making it difficult for even him to sense the former’s strength, he was still able to vaguely sense that Xiao Yan’s current strength should be somewhat terrifying…</p><br/><p>While everyone heads swarmed to focus on the ground, Xiao Yan was clenching his fist tightly and sensing the surging strength within his body. He laughed softly, “Shall we begin?”</p><br/><p>“Aye!”</p><br/><p>Lin Xiuya nodded his head. A ferocious aura that only an expert of the Dou Wang class surged out from within Lin Xiuya’s body. Two years had already allowed him to truly enter into the Dou Wang class, and had even allowed him to climb increasingly higher within it. With his current strength, he could be considered around the upper-middle level even among the Elders!</p><br/><p>“Bang!”</p><br/><p>A dark-green Dou Qi surged out from Lin Xiuya’s body. He clenched his fist and a longsword that was completely agglomerated from wind affinity energy surfaced. The longsword was swung randomly and a wind blade shot out from it, cutting a scar on the hard black rock.</p><br/><p>Xiao Yan smiled and shook his head when he saw that Lin Xiuya was nearly completely armed. A silver glow was faintly visible under his feet as a slight thundering roar quietly sounded. Xiao Yan’s entire body trembled the moment the rumbling thunder appeared!</p><br/><p>Lin Xiuya’s solemn expression immediately changed just as Xiao Yan’s body trembled. He immediately pierced the longsword violently toward his back amid the numerous stunned gazes from around him.</p><br/><p>The sword that contained a ferocious wind was pierced toward the the air but the place was empty. Such a situation caused all the pores on Lin Xiuya’s body to tense up. He had clearly sensed Xiao Yan’s aura appearing behind him...</p><br/><p>“When has this fellow’s speed become so frightening?”</p><br/><p>A thought rotated in a lightning-like manner within his heart. Although Xiao Yan’s speed was swift and fierce in the past, there was at least some traces to follow. Now, however, he seemed intangible and was difficult to sense.</p><br/><p>Lin Xiuya’s gaze swiftly shifted in all directions. His eyes suddenly shrank as the energy longsword faced his front and pierced forward fiercely!</p><br/><p>The surrounding students were completely at a loss as this sudden random piercing by Lin Xiuya. Was Xiao Yan not standing at the original spot without moving? Why did Lin Xiuya act in such a crazy manner all of a sudden?</p><br/><p>The eyesight of an ordinary students naturally could not see the mystery behind his actions. Only those who were strong could vaguely discover that Xiao Yan’s figure which remained at the original spot seemed to be somewhat illusory. Some of those who were sensitive immediately came to a sudden understanding within their hearts. It was actually an afterimage?</p><br/><p>Just what kind of strange, unpredictable agility and speed did one need to be able to leave an afterimage in such a quiet fashion?</p><br/><p>A cluster of dark-green flames suddenly appeared when the longsword that had pierced forward fiercely reached a certain part of the air. When the longsword was pierced into the cluster of flame, everyone could clearly see that the longsword which was agglomerated from energy, did not even struggle much before it was completely incinerated into nothingness by the dark-green flame.</p><br/><p>The moment the longsword turned into nothingness, a black figure suddenly appeared in front of everyone’s stunned gazes as though it had teleported.</p><br/><p>The black-robed young man smiled at Lin Xiuya. His hand which contained the dark-green flame was suddenly extended out explosively and directly grabbed toward the latter’s neck.</p><br/><p>“Blade web!”</p><br/><p>Lin Xiuya displayed his extraordinary fighting experience at this critical moment. He formed a seal in his hand and the energy in front of him rippled swiftly. Finally, it agglomerated into a dark-green energy web.</p><br/><p>However, Xiao Yan’s hand did not pause even a little when faced with this energy web which was covered with tiny wind blades. His hand continued to extend in an extremely direct fashion. Being burned by that dark-green flame, the sharp wind blade web immediately became like weak thin paper as it tore through it…</p><br/><p>Xiao Yan’s hand passed through the blade web without any resistance and slowly came to a stop when it was merely half an inch from Lin Xiuya’ neck.</p><br/><p>The entire place was silent!</p><br/><p>Everyone watched Lin Xiuya who did not dare to make the slightest move under Xiao Yan’s hand which was covered by that dark-green flame. Shock quietly climbed onto their faces.</p><br/><p>One move!</p><br/><p>A five star expert Dou Wang had actually… merely lasted for one extremely simple move in Xiao Yan’s hand!</p><br/>\n</div>"}