{"title": "Chapter 624: Bane Existence", "id": 624, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-624-bane-existence", "volume_title": "Volume 7", "body": "<h1>Chapter 624: Bane Existence</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 624: Bane Existence</u></strong></p><br/><p>This scene caused surprise to surface on the face of even Su Qian who had long since sensed that Xiao Yan’s strength had already reached an extremely powerful level…</p><br/><p>The dark-green flame on Xiao Yan’s hand swiftly disappeared amid the complete silence of the place. He smiled and spoke to Lin Xiuya whose entire body remained stiff, “Lin Xiuya, thanks for the win.”</p><br/><p>Lin Xiuya carefully shifted his head away and let out a bitter laugh. Although that dark-green flame did not touch his skin, he could sense that if Xiao Yan’s hand had moved just a little bit closer, it was likely that he would have been instantly burned into a pile of ashes by that frightening flame.</p><br/><p>“You… are too abnormal. After not seeing you for two years, you have actually become this strong.” Lin Xiuya scattered the Dou Qi on his body and sighed. Originally, he had thought that his training speed was not bad, but it was unexpected that he had merely lasted one exchange in Xiao Yan’s hand. This had caused him to be somewhat dispirited.</p><br/><p>“I had merely used the advantages of the ‘Heavenly Flame’. Senior Lin need not belittle yourself in this manner.” Xiao Yan patted Lin Xiuya’s shoulders and immediately turned his head toward the black mass of human crowd. He smiled and asked, “Has everyone seen enough?”</p><br/><p>Everyone smiled awkwardly after hearing Xiao Yan’s words. They no longer had the slightest doubt toward that great battle back then. Xiao Yan was about to defeat Lin Xiuya and the latter had no means to retaliate despite the latter’s strength. It was not impossible for one to say that Xiao Yan had defeated an expert Dou Huang.</p><br/><p>Xiao Yan and Lin Xiuya once again walked toward the tall platform. The former watched the stunned face of Su Qian and involuntarily laughed, “How is it? Can you see what level I am at now?”</p><br/><p>Su Qian fondled his beard and adopted an expression which suggested he was deep in thought. A long while later, he finally spoke slowly, “From the looks of the aura that you have revealed when you fought earlier, I think that you should be at the peak of the Dou Wang class. With this strength, it is not impossible for you to defeat Lin Xiuya in one move but… that dark green flame on your hand is exceptionally strange.”</p><br/><p>Su Qian’s face was somewhat solemn at the end when he spoke. This was because even he faintly felt a slight danger from the dark-green flame earlier. This kind of danger may be extremely tiny, but it was exceptionally clear. Such a situation caused him to feel some doubt. It was not that he had never seen a ‘Heavenly Flame’. However, even when someone of Han Feng’s strength controlled the ‘Heavenly Flame’, it merely cause him to be a little afraid. However, he had never received such a fearful feeling before.</p><br/><p>Xiao Yan nodded slightly. This dark-green flame was a newly born flame from the merger of the ‘Green Lotus Core Flame’ and the ‘Fallen Heart Flame’. A ‘Heavenly Flame’ was already extremely powerful, much less the combination of two kinds. Back then, when he was entangled with Queen Medusa underground, she was extremely afraid of it despite her strength. Clearly the power that this flame carried was extremely terrifying.</p><br/><p>“Chi!”</p><br/><p>Just as Xiao Yan had just recalled Queen Medusa, a seven-colored energy pillar suddenly shot down explosively from the sky. Finally, it became like a snake as it rushed toward Xiao Yan while emitting a ‘Chi La’ sound. The air even emitted waves of ear-piercing sound wherever the pillar passed.</p><br/><p>Xiao Yan had sensed something the moment the seven-colored energy pillar appeared. He frowned a little. This woman… she had actually yet to give up huh?</p><br/><p>Xiao Yan was about to prepare to defend himself when the expression of Su Qian, who had discovered the sudden attack at the same time, changed. He waved his sleeves and a powerful Dou Qi surged out. Finally, it violently collided with that seven-colored energy pillar. Immediately a clear sound resounded throughout the sky like thunder.</p><br/><p>“Since you are here, why do you need to act in such a stealthy manner?”</p><br/><p>Su Qian raised his hand and stared at the clear sky while he cried out coldly. He had already faintly sensed the appearance of another extremely powerful aura when Xiao Yan had just appeared. However, even with his strength, he was actually unable to accurately tell the location of that aura. He had only locked on to its location when the seven-colored energy was shot out.</p><br/><p>The collision that suddenly erupted also caused a countless number of students in the plaza to raise their heads in surprise. However, there was not a human figure in the empty sky.</p><br/><p>Not long after Su Qian’s cry sounded, the sky wiggled slightly and a graceful lovely body immediately appeared out of nowhere. Her bewitching long eyes swept over the sea of people below indifferently. Those people who were seen by those eyes, which contained an endless amount of allure, could not help but have their heart pound violently. A redness even involuntarily surfaced on their faces.</p><br/><p>Queen Medusa’s indifferent eyes swept slowly before eventually stopping on the black-robed young man who was beside Su Qian. An icy-cold killing intent flashed in them. She twisted her water-snake-like delicate waist, and her body rushed downward. In the blink of an eye, she appeared at a spot which was only a couple of meters from where Xiao Yan was located. With a swirl of her delicate hand, an enormous seven-colored energy surfaced and eventually carried a wind that could flip the seas and collapse the mountains as it violently smashed toward the latter.</p><br/><p>“This is the Inner Academy. Aren’t your actions today a little too arrogant?” Su Qian’s expression immediately sunk when he saw that the bewitching beauty had not only not replied but had unleashed an attack toward Xiao Yan once again. His body flashed and appeared in front of Xiao Yan. His shriveled hand trembled slightly and immediately made contact with that white jade-like hand.</p><br/><p>“Bang!”</p><br/><p>A wave of wild wind that carried a loud exploding sound erupted the moment both palms made contact. Numerous arm thick crack lines began to swiftly spread and cover the entire tall platform under the shocked gazes of those around.</p><br/><p>The wild wind blew everyone until they fell in all directions. Beside Su Qian, everyone more or less took a couple of steps back with the exception of Xiao Yan, who did not move.</p><br/><p>“Bang!”</p><br/><p>Both hands parted upon making contact. Amid a low and deep sounds, that graceful delicate lovely figure rushed back into the air. Her feet only became stable after stepping over ten steps in the air. On the other hand, Su Qian had also taken a couple of steps back. Each time his feet landed, they left behind a half inch deep footprint on the hard ground.</p><br/><p>Clearly, both of them were actually of similar strength in this collision!</p><br/><p>The seriousness of Su Qian’s face became denser after exchanging one head on blow with that mysterious woman. From that short exchange, he could sense that the other party was shockingly also a Dou Zong!</p><br/><p>“Who exactly are you? Can you please tell me your name!?”</p><br/><p>The woman stood in the empty sky. Her red dress flapped, wrapping a protruding and concaving figure that was filled with incomparable allure. Her exquisite face was cold and glamorous. However, it was this icy coldness that caused many people to feel a boiling heat in their hearts. Such a woman really possessed quite a lethal effect on all men.</p><br/><p>Queen Medusa’s flawless appearance caused even Su Qian to be slightly startled, much less those young students who were still extremely inexperienced. Some of those who had weak mental strength had quietly swallowed their saliva an unknown amount of times.</p><br/><p>“My target is Xiao Yan. It has nothing to do with you!”</p><br/><p>Queen Medusa coldly stared at Xiao Yan. Her red lips parted slightly and a clear numbing voice caused the bones of quite a number of people to become weak at this moment.</p><br/><p>All the gazes were gathered on Xiao Yan’s body upon hearing these words of Queen Medusa. Their surprised gazes also contained some envy. These young people viewed being called by name by such a beauty to be a kind of great glory.</p><br/><p>“Do you know her?” Su Qian knit his brows and softly asked Xiao Yan a question.</p><br/><p>“I have some conflict with her.” Xiao Yan smiled and spoke. His reply, however, was vague. After all, it was not possible for him to tell Su Qian that he did ‘that’ to her right?</p><br/><p>“Ugh, you brat. How can you provoke these troublesome people. This woman is actually also an elite Dou Zong. Even I may not be able to defeat her if we were to fight.” Su Qian felt a great headache as he spoke. It was unexpected that this fellow brought such big trouble the moment he came out. An elite Dou Zong. Even if one looked at the entire continent, they were extremely powerful existence.</p><br/><p>Xiao Yan also laughed bitterly. He raised his head and helplessly spoke to Queen Medusa, “Just what exactly do you want? You are already free. Quickly return to the place that you should return to.”</p><br/><p>Queen Medusa immediately felt extremely furious when she heard this. This bastard had done that kind of thing and actually still dared to use an irritated face to ask her what she wanted?</p><br/><p>“I will return after killing you.”</p><br/><p>“Ke ke, this friend. Xiao Yan is someone from my Inner Academy. We can sit down and talk if the both of you have any grudges. Why must you fight?” Su Qian smiled as he spoke. He would naturally not show any forceful attitude when faced with an elite Dou Zong.</p><br/><p>Queen Medusa ignored Su Qian’s words. Her pupils that were filled with an allure carried a dense coldness as they glared at Xiao Yan. A moment later, she coldly said, “Don’t think that I cannot kill you just because there is an elite Dou Zong protecting you. I don’t believe that you can follow beside him forever!”</p><br/><p>Queen Medusa’s body flashed after saying this. Subsequently, she transformed into flowing light and rushed out of the Inner Academy, disappearing in the blink of an eye.</p><br/><p>Xiao Yan watched Queen Medusa who disappeared far away helplessly. He could not resist knocking his own head, he felt a great headache forming. Did one not say that a woman would have some complicated feelings after having lost her virginity? Why was it that this woman only wanted to kill him? Would killing him be able to change the fact that he had possessed her body?</p><br/><p>“You brat, it’s good now, being locked onto by a Dou Zong. It is likely that you will suffer in the future. How troublesome.” Su Qian sighed. Being locked onto be a Dou Zong was not something fun.</p><br/><p>Xiao Yan spread his hand. Immediately, he seemed to have recalled something and spoke in an embarrassed manner, “There is another trouble that I have forgotten to tell you…”</p><br/><p>Su Qian was startled. He immediately knit his brows and asked, “What is it now? Don’t tell me that you have offended more than one Dou Zong.”</p><br/><p>“That’s not it…” Xiao Yan parted his mouth to smile as he spoke awkwardly, “That… I have accidentally refined the ‘Fallen Heart Flame’. In other words, that ‘Blazing Sky Qi Refining Tower’ of yours might no longer have any effect to raise one’s training speed in the future…”</p><br/><p>Su Qian blinked his eyes. His mind immediately felt a giddiness a moment later…</p><br/><p>“This bane existence!”</p><br/>\n</div>"}