{"title": "Chapter 629: Reinforcements", "id": 629, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-629-reinforcements", "volume_title": "Volume 7", "body": "<h1>Chapter 629: Reinforcements</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 629: Reinforcements</u></strong></p><br/><p>Xiao Yan’s gaze paused at the spot where Medusa had disappeared before slowly sighing in relief. His gaze shifted down and once again turned toward Fan Lao. His eyes were filled with killing intent.</p><br/><p>“Hei, you won’t gain any advantage even if that person left. I don’t believe that you can block all four of us with just your strength.” Fan Lao was disappointed when Medusa left. However, awe immediately surged onto his face as he sinisterly smiled.</p><br/><p>Xiao Yan did not bother with Fan Lao who had planned to use his words to force Xiao Yan back. He shook his wrist and the heavy ruler was violently inserted into the ground. A cluster of jade-green flame slowly surfaced on his right hand like that of a ghostly fire.</p><br/><p>Xiao Yan’s left hand slowly covered the dark-green flame. His eyes, however, were shut while Fan Lao and the others were frowning.</p><br/><p>Fan Lao and the others had no idea about this strange action of Xiao Yan. Hence, for a moment, no one dared to take the lead to attack.</p><br/><p>After Xiao Yan tightly shut his eyes, that cluster of dark-green flame suddenly began to fluctuate a moment later. Xiao Yan pulled both of his hands apart abruptly. A moment later, Fan Lao and the others were shocked as the dark-green flame suddenly separated into two clusters of different colored flames.</p><br/><p>Two clusters of flame. One was green in color, while the other was an invisible flame!</p><br/><p>“‘Fallen Heart Flame’? You have actually refined the ‘Fallen Heart Flame’?” Fan Lao was not surprised when his gaze swept over the cluster of green flame. However, his expression immediately changed when he saw the cluster of seemingly invisible flame. His shocked voice was sharp as it sounded.</p><br/><p>Xiao Yan indifferently stared at Fan Lao, whose expression had changed drastically. He flipped both of his hands. The newly born dark-green flame was created from the merger of the ‘Green Lotus Core Flame’ and the ‘Fallen Heart Flame’. As long as he was familiar with the control, it would not be difficult for them to separate once again. The two kinds of flames may be weaker than the dark-green flame in terms of heat and other aspects if they were used separately, but one could multi-task and use them simultaneously for different purposes. This was most suitable in the face of numerous enemies.</p><br/><p>“Attack! Kill him!”</p><br/><p>The shock on Fan Lao’s face gradually withdrew. An extremely rich killing intent replaced it. He clearly understood just what kind of frightening strength a person who controlled two different ‘Heavenly Flames’ possessed. If he continued to allow Xiao Yan to continue to train, it was difficult for him to guarantee just what kind of level he would reach. Killing Xiao Yan at this moment would undoubtedly reduce a big worry that would cause him to have difficulty sleeping and eating.</p><br/><p>Fan Lao’s cry had just sounded when his figure instantly moved. Blood-colored Dou Qi spread all over his body. The fishy stench of blood covered the entire stockade. Some of those who were weaker felt giddy upon smelling this bloody stench.</p><br/><p>The other three Dou Wangs, who possessed great fighting experience, beside Fan Lao also instantly moved their bodies the moment Fan Lao did so. The four of them formed an encirclement from four corners and shot explosively toward Xiao Yan at the middle.</p><br/><p>One Dou Huang, three Dou Wangs. Such a powerful lineup unleashed their attacks at the same time. The powerful aura that faintly agglomerated together was something that would make even an ordinary elite Dou Huang a little suffocated However, it did not have the slightest use toward Xiao Yan, who could not be predicted with common sense.</p><br/><p>“Third brother, be careful!”</p><br/><p>Although most of the powerful pressure being unleashed was blocked by Xiao Yan, who was in front of him, some of the remnant force that seeped past him caused Xiao Li’s expression to change drastically. He took two steps back before crying out to Xiao Yan in front of him.</p><br/><p>Xiao Yan nodded slightly. He narrowed his pupils and eyed Fan Lao and the three others who had approached him in the blink of an eye. The corner of his mouth moved a little, and the cluster of invisible flame on his left hand suddenly emitted a ripple.</p><br/><p>Following the emission of a ripple by the ‘Fallen Heart Flame’, the four figures that shot explosively over suddenly came to a stop. Their faces were flushed red, and the Dou Qi in all of their bodies emitted some chaotic ripples because they were caught off guard. The Dou Qi in their bodies was circulated with all their might as they tried to suppress the heart flame which had appeared within their bodies without any forewarning.</p><br/><p>The tactic the ‘Fallen Heart Flame’ specialized in was to summon a heart flame inside a person’s body once they entered a certain distance. The strength of this kind of heart flame was completely controlled by the person casting it. If it was mild, it would have the impact of refining Dou Qi. If it was wild and violent, it would cause a Dou Qi uprising within an unsuspecting person. Moreover, the high temperature which it emitted might well completely incinerate a person from inside out if one was not careful.</p><br/><p>The ‘Fallen Heart Flame’ had already been refined by Xiao Yan. The strange special effect of summoning heart flames was naturally something that he could use as he pleased. Currently, the heart flame which he had summoned when facing a strong opponent like Fan Lao was of course the kind that was wild and violent to the limit. Hence, there was a chaotic movement of Dou Qi within the bodies of Fan Lao and the other three…</p><br/><p>It was obvious that the heart flame that Xiao Yan currently summoned was unable to incinerate an expert Dou Wang to ashes. However, it was extremely easy to scramble around and put them into disarray.</p><br/><p>This kind of sudden disarray had a crucial impact of deciding the victor in such a battle between the strong.</p><br/><p>Xiao Yan raised his eyes to study Fan Lao and the other three whose Dou Qi had turned into disarray while their faces had suddenly become flushed red. The corner of Xiao Yan’s mouth was slowly raised into an arc that was filled with coldness. A silver-colored glow surfaced on his feet and his body shook. He immediately disappeared from his original position in a ghost-like manner. The Heavy Xuan Ruler which was inserted into the ground in front of him had also disappeared with him…</p><br/><p>“Chi!”</p><br/><p>The faint sound of rushing wind suddenly appeared. A person with flushed face, who was scrambling to direct the Dou Qi in their body to suppress the heart flame, suddenly felt a chill all over his body. He raised his head, only to see a faint black line rushing over in front of him.</p><br/><p>“Bang!”</p><br/><p>The large black ruler cut through the air, and a hot wind came smashing down furiously from all directions. From the looks of the force, even the strong body of an expert Dou Wang would likely become seriously injured if he was smashed.</p><br/><p>This expert Dou Wang displayed his extraordinary battle experience and agility at this moment of life and death. He forcefully endured the intense pain from the grilling of the heart flame in his body and viciously hacked the extremely large ghost head blade* in his hand which had been dyed by an unknown amount of fresh blood. The blade was incomparably sharp. Even the air appeared to be split opened at this moment.</p><br/><p>*(TL: ghost head blade - a type of knife that is extremely large (shaped like a scimitar))</p><br/><p>“Clang!”</p><br/><p>The heavy ruler suddenly fell and smashed heavily into the ghost head blade. An incomparably powerful force surged out explosively. Under this ferocious attack, that expert Dou Wang felt his legs become weak and both of his knees violently bent to touch the hard ground. The ground shook until crack lines began spreading like a spider web.</p><br/><p>“Bang!”</p><br/><p>The expert Dou Wang barely blocked this heavy ruler attack that had nearly taken his life. Before he had the time to escape, a sharp wind approached like a shadow and was swung into his chest. An explosive strength suddenly erupted, kicking this expert Dou Wang until he flew for dozens of meters. Eventually, he was dragged along the ground and formed a deep scar that was dozens of meters long before he slowly came to a stop.</p><br/><p>One ruler, one leg. Within two attacks, an expert Dou Wang was forced back after being turned into a miserable state from serious injuries. The numerous black figures within the dark shadows of the stockade could not help but inhale a breath of cold air as they watched this one-sided battle.</p><br/><p>“This little fellow… is really becoming stronger and stronger.” Xiao Li also widened his mouth and watched the expert Dou Wang, who was instantly injured. He could not resist shaking his head a moment later. Such strength was really frightening.</p><br/><p>Fan Lao and the other two experts Dou Wangs finally managed to suppress the writhing heart flame within their bodies during this short period of time where Xiao Yan had defeated an expert Dou Wang in a lightning-like manner. Their gaze swept toward the sluggish aura of their companion. They did not know if was dead or alive. All of their hearts sank.</p><br/><p>“No matter whether it was in terms of speed or strength, this bastard is much stronger than he was two years ago… Moreover, he is also able to control the ‘Fallen Heart Flame’ to force us to multi-task and suppress the heart flame within our bodies… Looks like it is going to be troublesome today.”</p><br/><p>“Hao Han, the two of you should go and capture that person. I will delay him. Hurry!”</p><br/><p>Fan Lao cried out sternly as a thought swiftly flashed within his heart. With the current situation, they must capture this person who had quite a deep relationship with Xiao Yan. Otherwise, it was likely that they would have difficulty defeating Xiao Yan even if they were to join hands.</p><br/><p>The other two expert Dou Wangs were startled when they heard Fan Lao’s cry. They immediately recovered and looked at each other. After which, they rushed in from the two sides.</p><br/><p>“Chi!”</p><br/><p>A rushing wind sound once again sounded in the battleground just as the two split. However, the moment the rushing wind sound appeared, Fan Lao clenched his teeth and moved his body. He appeared at a certain spot and blood-colored Dou Qi was shot explosively toward the space in front of him.</p><br/><p>Blood-colored Dou Qi surged out explosively. An enormous black figure which was wrapped in green flame suddenly appeared. It was immediately hacked down. Under the pressure of the green flame, that blood-colored Dou Qi had instantly and completely disappeared.</p><br/><p>“Dammit!”</p><br/><p>Fan Lao cursed in his heart after being totally restrained by Xiao Yan’s ‘Heavenly Flame’. He was about to unleash another attack again to block the latter when the heart flame within his body suddenly soared at this moment. The intense pain forced him to quickly diverted some Dou Qi to suppress it.</p><br/><p>The diversion of Dou Qi not only caused Fan Lao to divert his attention, but also resulted in his attack becoming slower and weaker.</p><br/><p>“Bang!”</p><br/><p>“Octane Blast!”</p><br/><p>The opening from this slower motion naturally did not escape Xiao Yan’s sharp eyes. Hence, his body flashed and he took the opportunity to hit Fan Lao’s chest area. His arm trembled as he tightened his five fingers. His arm was like a heavy hammer carrying a powerful attack, that caused one to shake within one’s heart, as it viciously smashed into Fan Lao’s chest.</p><br/><p>Fan Lao only had the time to form a circular blood layer on the surface of his skin at this crucial moment before Xiao Yan’s fist came crashing down. A torrential strength surged out from his fist. The former’s body shot back under this fierce attack. Moreover, a mouthful of blood was involuntarily spat out from his mouth as he did so.</p><br/><p>Xiao Yan did not give chase after sending Fan Lao flying with one punch. He turned his gaze and he immediately revealed a gloomy face as he realized the two expert Dou Wangs were only around seven or eight meters from Xiao Li.</p><br/><p>Given Xiao Li’s current injured state, his chances of victory when faced with two expert Dou Wangs was naturally extremely low. Moreover, the two expert Dou Wangs were also shocked by Xiao Yan’s strength earlier. Hence, they clearly understood that it was likely that they would have to remain in this place forever if they did not capture Xiao Li!</p><br/><p>Carrying this thought within their hearts, the two expert Dou Wangs had unleashed their strength to the maximum. Xiao Li naturally fell into a disadvantage with such strength attacking the weak.</p><br/><p>Xiao Yan was naturally well aware of Xiao Li’s disadvantage. Hence, he could not be bothered with chasing the wounded Fan Lao. His body moved and he hurriedly went to support Xiao Li. However, he had just begun to move when a fishy stench once again surged over. The pale-faced Fan Lao appeared in front of Xiao Yan in a ghost-like manner. His gaze was dark and vicious as he looked at Xiao Yan and laughed out loud, “Ha ha, Xiao Yan, so what if you are strong? As long as he lands in our hands, should we be afraid that you will cause trouble?”</p><br/><p>The two expert Dou Wangs approached Xiao Li after Fan Lao’s blocking action. Powerful Dou Qi immediately surged out. From the looks of the auras, the two people clearly intended to give a finishing blow and capture Xiao Li.</p><br/><p>Xiao Yan’s heart suddenly sank as he watched the powerful Dou Qi that the two Dou Wangs had suddenly unleashed.</p><br/><p>“Xiu!”</p><br/><p>The sharp sound of rushing wind suddenly appeared in the sky the instant the three people were about to make contact. Two figures immediately rushed down and were overbearingly inserted into the area between the two expert Dou Wangs and Xiao Li just like two meteorites. A clear and loud laugh suddenly sounded.</p><br/><p>“Ha ha, Xiao Yan, you should just finish off that old fellow. Leave these two people to Zi Yan and me.”</p><br/><p>The sudden unexpected change caused Xiao Yan to be startled. Immediately, his tight heart slowly relaxed. Reinforcements had finally arrived in time…</p><br/><p>Xiao Yan turned his head and his gaze slowly moved toward Fan Lao. A voice that was filled with a dark, cold killing intent caused the latter’s face to instantly become white.</p><br/><p>“Old dog, are you very happy blocking me?”</p><br/>\n</div>"}