{"title": "Chapter 627: The Moment of Life and Death", "id": 627, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-627-the-moment-of-life-and-death", "volume_title": "Volume 7", "body": "<h1>Chapter 627: The Moment of Life and Death</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 627: The Moment of Life and Death</u></strong></p><br/><p>Wu Hao nodded his head. He took out a map scroll from his storage ring and slowly pushed it open. He used his finger to point to a certain area and said, “According to our intelligence, a few large factions of the ‘Black Alliance’ are heading to this place. I think that your second brother should be there. According to our speed, we should be able to reach there by tomorrow morning.”</p><br/><p>Xiao Yan nodded his head slightly. He slowly calmed his somewhat anxious heart, and sat cross-legged on the griffin before shutting his eyes to recuperate.</p><br/><p>Xiao Yan’s group avoided the fatigue of traveling by ground and also the numerous troubles within the ‘Black-Corner Region’ due to them possessing the griffins, a beast that specialized in long distance air travel. Hence, within a night, they had already begun to approach their destination. If they had walked instead, it would have been impossible for them to reach this place within four to five days even if everything had been smooth along the way.</p><br/><p>Xiao Yan’s gaze studied the mountains in the distance covered by a faint mist while he stood atop a griffin. The uneasiness in his heart grew even more intense the closer he approached. Xiao Yan had continued feeling this uneasiness for a couple of minutes before he could no longer endure the emotion in his heart. He turned his head and spoke to Lin Yan, Wu Hao, and the others, “I will make a move first, all of you should hurry up and follow.”</p><br/><p>Wu Hao and the others were startled when they heard this. However, they did not try to stop him. Given the former’s strength, it was likely that one could hardly find anyone who would cause him to suffer a loss even in the ‘Black-Corner Region’. Moreover, Xiao Yan was not some little novice who had just left home. He was extremely outstanding regardless of whether it was in terms of fighting experience or other areas. Hence, Wu Hao and the others were not worried about him. They merely reminded him to be careful out of habit.</p><br/><p>Xiao Yan smiled and nodded to Wu Hao and the others. His shoulders shook, and a pair of beautiful flame wings extended from his back. Perhaps it was because his Dou Qi had turned into a dark-green color after the merger of the ‘Heavenly Flames’, but the original green flame had transformed into an emerald color. At a glance, it appeared as though it was made of emerald, having an extremely beautiful appearance that caused others feel envy. This could be inferred from the envy that had appeared on faces of everyone on those griffins behind him the moment his wings appeared.</p><br/><p>The jade-like fire wings flapped gently as Xiao Yan leaped off of the griffin’s back. After a couple of immediate flaps from the wings, his body turned into a black shadow that swiftly disappeared in front of everyone’s sight.</p><br/><p>“Ke ke, looks like we need to increase our speed. Otherwise, everything might be settled by this fellow by the time we reach there.” Wu Hao laughed as he saw Xiao Yan swift disappearance. With a wave of his hand, the ten plus griffins emitted an orderly low roar as they immediately flapped their large wings. Their enormous bodies rode the wind and rushed forward.</p><br/><p>This was a mountainous region covered in complicated terrain. The enormous trees all around were like pillars supporting the sky as they penetrated the clouds. They also made it difficult for sunlight to enter, resulting in the mountains being very dark.</p><br/><p>A large stockade stood under the cover of the enormous, dense trees in a certain spot within the deep mountains, causing this place to be quite hidden. It was difficult to find if one did not purposefully look for it.</p><br/><p>The entire stockade was extremely quiet. However, there were quite a number of human figures who were coming and going. These black figures did not make any noise under their feet as they hurriedly rushed up and down the roads. The entire stockade was filled with an anxious atmosphere but it did not appear to be flustered.</p><br/><p>A human figure who was completely wrapped in a black robe was standing tall and straight at a stage in the middle of the stockade. The dense bloody aura that was emitted from this person’s body was something that could be clearly smelled even from a great distance away. However, the hundred plus black figures under the tall stage seemed to have not smelled it as they stood in a quiet and orderly fashion. Other than the ‘hua hua’ sound that was emitted by the black clothes when the wind blew passed, there was only the extremely slight sound of footsteps.</p><br/><p>A black figure suddenly shot over from a distance amid the quiet atmosphere. Finally, he appeared under the tall stage, and knelt with one knee on the ground. His voice was low as he reported, “Chief. According to our secret investigation, around seven or eight secret sentry posts we had in the forest have been quietly destroyed. From the looks of some of the traces within the forest, it seemed that our trail seems to have been discovered. Now, this place is no longer safe.”</p><br/><p>“Has the ‘Black Alliance’ finally made a move on us.” The black-robed person on the tall stage spoke in an indifferent voice. He slowly raised his head as scattering sunlight landed on that young face where a deathly aura was seeping out. That appearance was actually Xiao Yan’s second brother, Xiao Li!</p><br/><p>“How many people are surrounding us this time around?” Although he had heard this news that would make one uneasy, Xiao Li’s face did not even change a little. He was emotionless as his eyes swept over the black figures below while he spoke indifferently.</p><br/><p>“There are at least two hundred people. All of them have quite a great strength. Moreover they cooperate with each other quite well.” The black figure reported without any hesitation.</p><br/><p>“Who is their leader?”</p><br/><p>“I have not seen him personally, but this subordinate has found members from the ‘Blood Sect’ among the factions surrounding us. The worst case scenario should be that they are led by the leader of the ‘Blood Sect’, Fan Lao.”</p><br/><p>“Fan Lao huh…” Xiao Li slowly narrowed his eyes. A moment later, a savage smile spread from the corner of his mouth. It seemed that third brother had quite a bit of a grudge with this old man who would not die? Back then, this fellow was also one of the top names who had participated in the attack on the Inner Academy.</p><br/><p>“In any case, I don’t have much time left. Today, I will stake my life and get him to be buried with my third brother.” Xiao Li gave a dark, dense smile before immediately waving his hand gently. An indifferent voice reverberated over the entire place, “Assassination unit, hide yourself in the forest and withdraw as you fight. Try your best to weaken their fighting strength. Remember, even if you die, you must pull someone to cover you as a blanket. Otherwise, your death will be worthless.”</p><br/><p>TL: buried with does not mean physically buried with</p><br/><p>“Yes sir!”</p><br/><p>Nearly half the people below suddenly responded in unison. Their bodies immediately flashed, and the black figures penetrated through the shade one after another. Finally, they leaped out of the stockade and disappeared into the vast forest. They did not question their fates of imminent death. This was because anyone within this Assassination unit who questioned Xiao Li’s words had already been removed. Those who could remain were basically people who had handed over their hearts and even their souls to Xiao Li.</p><br/><p>“Everyone else will defend the stockade. Defend with all your strength!”</p><br/><p>“Yes sir!”</p><br/><p>The remaining people also responded in unison. Finally, their bodies flashed and entered into various dark and hidden corners of the stockade. The dark black sharp daggers in their hands slowly emitted a cold glint.</p><br/><p>Xiao Li’s gaze was cold and indifferent as he watched the black figures who had disappeared. He slowly shut his eyes and a faint death aura surrounded his body as though he was the god of death.</p><br/><p>“Third brother, wait for second brother to pull someone down with me!”</p><br/><p>….</p><br/><p>Countless numbers of sharp screams were suddenly emitted from the lush green forest when morning arrived. The miserable screams reverberated over the mountains, causing one to feel a chill all over one’s body.</p><br/><p>Countless numbers of human figures filled with killing intent flashed about in the dark forest. They were just about to swiftly rush toward their target when numerous black figures suddenly shot out from the shadows of the forest. They carried a slight muffled sound of one’s flesh being cut as fresh blood was spilled...</p><br/><p>Although the sudden ambush killing caused that particular unit to suffer quite the losses, these people were clearly very experienced in combat. Hence, they were able to rely on their advantage in numbers to stabilize the situation in an extremely short amount of time. After which, both parties entered into an intense and fierce exchange…</p><br/><p>Xiao Li, who had his eyes shut while in the stockade, suddenly opened them. He eyed those dozens of black figures who had rushed back from within the forest. These figures swiftly flashed into the stockade before they finally knelt with one knee on the ground in front of the tall stage.</p><br/><p>“Chief, over half of the Assassination unit is dead. However, the other party’s death toll is more than twice ours. This time around, the troops that have come to surround us are all the elites of a couple of large factions. Moreover, they have the help of three Dou Wangs and one Dou Huang! Our Assassination unit did not obtain the results we desired.” A dark, deep voice was emitted from the mouth of a black human figure.</p><br/><p>Xiao Li’s face was indifferent. He merely nodded slightly.</p><br/><p>“According to their momentum, they will reach the stockade within ten minutes!”</p><br/><p>“Spread out. Prepare to fight to the death with those who have attacked.” Xiao Li lifted his chin and spoke indifferently.</p><br/><p>Although Xiao Li had ultimately not said anything about withdrawing, not one of these wood-like black human figures said anything. All of them completely did as they were ordered.</p><br/><p>Xiao Li lifted his gaze as he watched those human figures who had begun to scatter. After which, he gazed at the distant forest as a wild savageness surged onto his face.</p><br/><p>The actual situation was worse than reported by the black human figure. Around five minutes later, some human figures appeared from within the forest. After which, more rushed out repeatedly. Within a short couple of minutes, the entire stockade had been surrounded to the point where even water could not pass.</p><br/><p>“You must be the leader of the organization which doesn’t even have a name right?”</p><br/><p>Cold laughter suddenly sounded in the air above the stockade. Xiao Li lifted his head only to find four figures suspended in the air. A powerful aura wrapped around the entire stockade. The person in front was surprisingly the leader of the ‘Blood Sect’ who had nearly died in Xiao Yan’s hands back then, Fan Lao!</p><br/><p>Xiao Li’s gaze was dense as he stared at Fan Lao in the sky. However, he did not say anything. He clenched his hand, and a long, dark-black spear flashed and appeared. Powerful silver-colored Dou Qi carried a faint thunderous roar as it wrapped around the spear.</p><br/><p>Fan Lao indifferently watched Xiao Li who was putting up a last bit of resistance before death. The former waved his hand. “Kill him.”</p><br/><p>A fierce glint immediately surfaced within the eyes of the three expert Dou Wangs behind Fan Lao upon hearing the order. With a low cry, the three human figures carried a powerful aura as they came rushing down explosively from the sky like meteorites. The combined strength of the three Dou Wangs even caused the air to emit a rumbling sound.</p><br/><p>Xiao Li’s face was ferocious as he watched the three human figures who had rushed over. His grip on the long spear in his hand had become much tighter. He would not even have the slightest fear against one Dou Wang. He might end up descending into an annoying battle against two Dou Wangs. On the other hand, fighting against three Dou Wangs would likely result in him being at a disadvantage.</p><br/><p>Even though this was the case, Xiao Li did not even retreat in the slightest. Having not much time left, he need not even worry about his life. What else was there to fear?</p><br/><p>“Die!”</p><br/><p>A stern cry was ferociously released from the mouths of the three Dou Wangs. The three of them clearly cooperated very well with each other. Moreover, they were also ruthless individuals. Hence, the three of them joined hands to unleash a powerful blow as their first attack. Three powerful Dou Qi attacks flew through the sky before finally intertwining with one another like a trident that shot explosively toward Xiao Li!</p><br/><p>“A mere Dou Wang also dares to offend the ‘Black Alliance’. You really overestimate your strength!” Fan Lao lifted the corner of his mouth. He spoke in a dark, cold manner when he saw Xiao Li, who appeared exceptionally small under the three powerful attacks.</p><br/><p>Xiao Li’s watched the fierce attack that was rushing over with a savage gazes. His long spear quivered and a silver-colored glow soared. The sound of rolling thunder was brewed at the tip of his spear. An instant later, a lightning snake-like silver-colored Dou Qi suddenly shot out explosively before the three attacks collided heavily with one another.</p><br/><p>“Bang!”</p><br/><p>A loud sound appeared in mid-air. Powerful energy ripples spread out from it. While this wind spread, Xiao Li and the three experts were shaken and forced to take a couple of steps back. However, it was obvious that Xiao Li suffered a greater disadvantage. If one heard the low muffled sound from his throat, it appeared that he had suffered some slight injuries during collision.</p><br/><p>Fan Lao’s expression had immediately become a lot darker and colder as he stood in the sky and watched Xiao Li manage to endure the attack from three expert Dou Wangs, and had clearly only suffered slight injuries from it. His gaze was filled with malice as he watched Xiao Li taking over a dozen steps back. His body suddenly quivered before it immediately disappeared.</p><br/><p>On the ground, Xiao Li who had just stabilized his body, did not have the time to take a breath when his expression suddenly change. Immediately, his palms habitually shot out violently in front of him body.</p><br/><p>Fan Lao’s figure strangely appeared just as Xiao Li’s palm struck out. With a cold, dark laugh, his shriveled hand firmly met with Xiao Li’s palm. A frightening force immediately surged out explosively!</p><br/><p>“Grug!”</p><br/><p>Xiao Li may be strong, but there was still an extremely large gap when compared to an elite Dou Huang like Fan Lao. It was natural that he would suffer a disadvantage in such a head on collision. Hence, he immediately spat out a mouthful of fresh blood while his legs were dragged against the ground as he was forced back. Finally, his back collided with a huge rock. The force was discharged and the enormous rock behind him was immediately filled with a countless number of crack lines. At a glance, it was about to fall apart.</p><br/><p>Fan Lao coldly smiled as his eyes darkly glared at Xiao Li who had spat out blood. However, the former did not give the latter any time to recover. He clenched his fist, and a blood spear agglomerated in it. His hand shook immediately, and the blood spear carried a fishy scent as it rushed toward Xiao Li, whose Dou Qi within his body had become a little sluggish, in a lightning-like manner.</p><br/><p>“You dared kill people from my ‘Blood Sect’. Today, I will break all your limbs and rear you as a blood slave!”</p><br/><p>Due to the sluggish Dou Qi within his body, Xiao Li could only watch as the blood spear shot over to him at this moment. He did not have the slightest ability to dodge it.</p><br/><p>“Third brother, second brother is useless and is actually unable to even drag someone down with him.”</p><br/><p>A bitterness slowly surfaced on the corner of Xiao Li’s mouth as he watched the blood spear that was swiftly magnified in his eyes. He quietly shut his eyes and muttered with a sigh, “It really seems that the heavens want to destroy our Xiao clan…”</p><br/><p>“Chi!”</p><br/><p>A slight thundering sound suddenly resounded in the sky just as the blood spear was about to strike Xiao Yan. Immediately, a dark-green fire wall suddenly surfaced in front of Xiao Li, causing Fan Lao’s face to suddenly change drastically. That blood spear appeared to be like a snow meeting boiling oil and swiftly melted. Moreover, it even emitted waves of ‘chi chi’ sound.</p><br/><p>“Who is it? Our ‘Black Alliance’ is performing a mission. Please do not put your nose in other people’s business!”</p><br/><p>Fan Lao’s expression was dark and cold when he saw the dark-green flame which had suddenly appeared. He raised his head and cried out sternly.</p><br/><p>“Ke ke, Sect Leader Fan, I have not seen you for two years, but you have really become more impressive. Back then, you luckily escaped with your life. I wonder if you will still be this lucky today?”</p><br/><p>A faint laugh slowly sounded in the sky. Immediately, a black-robed human figure strangely appeared in the sky in front of numerous shocked gazes.</p><br/>\n</div>"}