{"title": "Chapter 638: Fight Between Those with the Same Teacher", "id": 638, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-638-fight-between-those-with-the-same-teacher", "volume_title": "Volume 7", "body": "<h1>Chapter 638: Fight Between Those with the Same Teacher</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 638: Fight Between Those with the Same Teacher</u></strong></p><br/><p>“You… you changed your ‘Heavenly Flame’?”</p><br/><p>Han Feng’s eyes stared intently at the dark-green flame writhing on Xiao Yan’s body. Although that kind of flame did not overtly display a monstrous aura, Han Feng could still vaguely sense just how frightening that dark-green flame was by relying on his extremely sharp Spiritual Perception.</p><br/><p>Xiao Yan smiled in the face of Han Feng’s shocked expression. A wisp of dark-green flame mischievously ran about the tips of his fingers like a spirit. Occasionally, the space would be faintly distorted when the tail of the wisp passed by.</p><br/><p>“Senior, I will help teacher settle the hurt that he suffered back then.” Xiao Yan clenched his right hand tightly, and the large Heavy Xuan Ruler appeared. With a wave, the heavy ruler carried a pressuring wind before pointing at Han Feng from a distance.</p><br/><p>Han Feng’s expression was solemn. He clenched his hand tightly as the dark-blue flame swiftly flowed. Finally, it transformed into a fire longsword that he pointed toward Xiao Yan from a distance. He spoke in a sinister manner, “Don’t use this kind of reprimanding tone to speak to me. I do not have the slightest regret for what I did back then. The only thing that caused me regret was that I still failed to obtain the ‘Flame Mantra’ in the end. However, that doesn’t matter anymore because you have already come to hand it to me.”</p><br/><p>“You are indeed an animal…” Xiao Yan sighed and shook his head. He finally ceased speaking any nonsense to this animal who was blinded by the ‘Flame Mantra’. A bright silver glow surfaced under his feet before the faint rumbling sound of thunder reverberated across the sky. Xiao Yan’s body suddenly trembled the moment the thunder sounded.</p><br/><p>“An afterimage huh? It is unexpected that you have indeed become much stronger during these two years. Now, you are able to reach this stage without using that old fellow’s strength. However, do you think that this is of any use against me?” Han Feng laughed coldly as he watched the figure of ‘Xiao Yan’ remain in the air. The deep-blue fire wings on his back flapped slightly as his body withdrew a couple of meters in a gliding fashion. A black figure suddenly surfaced in front of him just as his body moved. An enormous heavy ruler carried a frightening pressure and wind-tearing sound as it violently and fiercely hacked down!</p><br/><p>The figure twisted a little as it formed a somewhat strange posture while the heavy ruler moved along the front of Han Feng as it hacked down. The force that was contained on it did not cause Han Feng much harm under the protection of the ‘Sea Heart Flame’.</p><br/><p>“Junior, although your strength has currently increased greatly, the number of fights that this senior has undergone exceeds the number of meals you have eaten!” Han Feng dodged Xiao Yan’s attack and smiled coldly. His arm shook abruptly, and the fire longsword in his hand drew an extremely vicious arc that bypassed the heavy ruler and pierced toward Xiao Yan’s chest.</p><br/><p>“Clang!”</p><br/><p>Xiao Yan’s expression did not change in the face of this vicious attack by Han Feng. He twisted his wrist slightly, and the heavy ruler swiftly rotated and flew back up. Finally, it acted like a shield that blocked in front of Xiao Yan, completely defending him against the fire sword.</p><br/><p>“Chi! Chi!”</p><br/><p>This agile reaction of Xiao Yan caused Han Feng to raise his brows in surprise. His arm immediately shook, and the fire longsword in his hand immediately divided into a countless number of them. The many afterimages all alternated between being real and illusionary as they carried a hot wind that shot out in all directions, completely wrapping all around Xiao Yan. The attack was sharp and vicious.</p><br/><p>Xiao Yan did not panic in the face of this sharp attack by Han Feng. Although he had recently lost the support of Yao Lao’s strength, his original strength was no longer weaker than the him who had borrowed Yao Lao’s strength back then. Moreover, the strength completely belonged to him now. Hence, it was extremely smooth to control.</p><br/><p>A silver glow flickered under Xiao Yan’s feet as he used some strange footwork. His body swayed left and right in a strange manner as he dodged all the sword shadows that came from every direction. His heavy ruler was waved occasionally and completely blocked some of the glows. The sparks that emitted from it lit up the young face which appeared to be extremely calm.</p><br/><p>Xiao Yan’s body suddenly paused while it was flashing about. A glow grew extremely bright at this moment as a low cry was emitted from his throat. Immediately, the heavy ruler in his hand carried a dark-green flame as it pierced forward. Immediately, it formed what seemed like a real, yet illusory sword afterimage amid the numerous afterimages in the sky.</p><br/><p>“Clang!”</p><br/><p>A clear sound slowly resounded as the sword figures that filled the sky suddenly disappeared. Only the fire longsword collided heavily with the heavy ruler!</p><br/><p>“Heh!”</p><br/><p>Xiao Yan suddenly let out a low cry as he sensed the wild and violent force that surged over from the tip of the sword. Powerful Dou Qi surged out from each and every single part of his body before following his veins and quickly poured into his hands. Xiao Yan’s arms quietly became a little stronger with the surge of this powerful Dou Qi.</p><br/><p>Xiao Yan’s arm trembled suddenly. An explosive strength surged out from the ‘Heavy Xuan Ruler’ before it charged into the interior of the fire longsword in a peremptory manner.</p><br/><p>“Bang!”</p><br/><p>Strength was poured in in an overbearing manner. One could see that the fire longsword which had been agglomerated from the ‘Sea Heart Flame’, began to show traces of crack lines. Han Feng’s expression sank a little when he saw this change, so he swiftly released the hilt of the longsword.</p><br/><p>When his hand left the sword’s hilt, the latter immediately burst apart with a clear sound after having lost its energy support.</p><br/><p>“This fellow’s ‘Heavenly Flame’ is a little strange!” A glint swiftly flickered in Han Feng’s eyes when the fire sword burst apart. When the other party’s strength swarmed into the fire sword earlier, he had clearly sensed that the other party’s ‘Heavenly Flame’ was… splitting the ‘Sea Heart Flame’!</p><br/><p>Having gained the advantage with his attack, Xiao Yan ceased hesitating. His hand heavy struck the ruler’s hilt, and the Heavy Xuan Ruler was immediately wrapped by the jade-green flame. It became just like a dark-green lightning bolt as it charged toward Han Feng who was close by!</p><br/><p>Even with Han Feng’s speed, he had some difficulty dodging at such close distance. Therefore, he could only wrap his hand with the ‘Sea Heart Flame’ and slam it violently against the heavy ruler.</p><br/><p>“Clang!”</p><br/><p>A clear metal sound was immediately emitted when his hand slammed against the heavy ruler. The force surged wildly before sending the heavy ruler flying away. However, the moment that Han Feng’s hand came into contact with that heavy ruler, the dark-green flame was like a sticky liquid that quickly stuck to his hand. While being burned by the green flame, that ‘Sea Heart Flame’ actually began to become thinner at a rate visible to the naked eye!</p><br/><p>Some uneasiness finally rose within Han Feng’s heart as he watched the increasingly thinner ‘Sea Heart Flame’. From such close contact, he could already be certain that the ‘Heavenly Flame’ Xiao Yan used this time around was definitely not the ‘Green Lotus Core Flame’ from back then!</p><br/><p>Surging Dou Qi suddenly spat out from Han Feng’s hand. After the standoff, that dark-green flame which had stuck to his body was extinguished. Han Feng instantly stepped back. His expression was solemn as he stared at the warm smile of the black-robed, young man. This fellow had become even stranger and more difficult to deal with after having not met for two years.</p><br/><p>Surprise flashed across Xiao Yan’s face when he saw that Han Feng did not spend much effort to escape the dark-green flame. This fellow was indeed just as Yao Lao described. He had extremely outstanding talent both in terms of alchemy and training. Although Xiao Yan had grown much stronger during these two years, it was obvious that this fellow’s strength had soared by quite a lot. Moreover, it might really be as he had said. The current Han Feng had already touched the barrier of an elite Dou Zong. Perhaps, he might be able to step into that extremely powerful class one day.</p><br/><p>“A person who could catch the eye of that old fellow to take in as a student is indeed not ordinary… I underestimated you earlier.” Han Feng lowered his head to study his somewhat charred black hand. He sighed and shook his head before gently inhaling a breath of air. He lifted his head and his gaze stared viciously at Xiao Yan. With a cold smile, he said, “Although your strength has grown greatly during these two years, I did not squander away this time either…”</p><br/><p>The seal in Han Feng’s hand changed as his voice sounded. Immediately, a majestic Dou Qi surged out explosively from his body. The strength of this Dou Qi had far exceeded that of an ordinary elite peak Dou Huang. It had even… reached the level where one already had a foot into the Dou Zong class!</p><br/><p>The sudden appearance of such powerful Dou Qi caused the chaotic battleground not far away to become quiet. Numerous shocked gazes were thrown over. Moreover, these gazes immediately became excited when they paused on Han Feng’s body.</p><br/><p>“This fellow… has actually stepped into the Dou Zong class huh…”</p><br/><p>Regardless of whether one was an Inner Academy expert or one was an expert from the ‘Black-Corner Region’, everyone felt their hearts were filled with shock as they watched the messy hair of Han Feng blow about while his majestic aura spluttered out. There was hardly anyone who had seen Han Feng fight during these few years. Hence, no one knew that this fellow had unknowingly reached this stage!</p><br/><p>The earth-shaking Dou Qi that suddenly erupted caused Su Qian as well as the Gold Silver Brothers to be dull. Three pairs of eyes followed the source of the eruption of Dou Qi and looked over. Each of their eyes were immediately filled with different emotions.</p><br/><p>“This fellow is really extremely scheming. Even we were not aware that he had reached that stage…” The Gold Silver Brothers exchanged looks with one another. There was an involuntary envy in their eyes. The both of them had stopped at the peak of the Dou Huang class for nearly ten years, but they did not even advance a little since then. Han Feng, on the other hand, actually revealed the signs of stepping to a higher level within less than five years. Such speed caused them to involuntarily feel envy in their hearts.</p><br/><p>Su Qian’s heart gradually sank when he discovered that the source of the Dou Qi was Han Feng. If Han Feng had truly stepped half a foot into the Dou Zong class, his fighting strength… would likely soar a couple of times. If he were to use his ‘Heavenly Flame’, even Su Qian had to admit that he might have difficulty defeating him, much less Xiao Yan.</p><br/><p>Originally, Su Qian hoped that Xiao Yan would be able to hold Han Feng back. From the looks of the current situation, everything would likely fall through. Once Han Feng managed to free himself and join the Gold Silver Brothers, even he would be defeated. In that case, the Inner Academy might truly suffer great injuries and deaths this time around.</p><br/><p>Su Qian let out a soft despondent sigh. He immediately forced himself to become alert. Now, he could only put his hope on that little fellow who frequently created miracles. All of his other worries would not be of any help…</p><br/><p>“Little fellow, can you still block Han Feng this time around?”</p><br/><p>Su Qian shifted his gaze, and muttered softly while looking at the black-robed young man whose expression could not be seen.</p><br/>\n</div>"}