{"title": "Chapter 637: Fire Lotus Bottle", "id": 637, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-637-fire-lotus-bottle", "volume_title": "Volume 7", "body": "<h1>Chapter 637: Fire Lotus Bottle</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 637: Fire Lotus Bottle</u></strong></p><br/><p>The anxious swords-drawn atmosphere suddenly erupted following Han Feng’s voice.</p><br/><p>“Chi!”</p><br/><p>The Gold Silver Brothers were the first to move. Powerful Dou Qi entwined together and the two human figures appeared to have been merged as they turned into a ray of light that shot explosively toward Su Qian. Their bodies drew through the sky as waves of low, deep sonic booms were emitted. These two old fellows were the strongest within this chaotic ‘Black-Corner Region’. Naturally, they had some ability that ordinary people could not compare with. Such a momentum was comparable to that of an ordinary Dou Zong.</p><br/><p>Su Qian laughed coldly as he saw that the Gold Silver Brothers had a clear target. During these two years, he had fought with these two fellows no less than ten times. Although the two of them could rely on their extremely great collaboration to fight with him, this was only a temporary thing. He had the confidence that as long as no one intervened in the middle of the fight, he would definitely be able to finish off these two old fellows.</p><br/><p>Su Qian’s somewhat shriveled hand extended out from his sleeves. His gaze was once again thrown toward Xiao Yan as he spoke in a deep voice, “I will leave Han Feng to you…” After speaking those words, his body shook and transformed into a flowing light that shot out. Finally, it collided with the Gold Silver Brothers in front of a countless number of gazes. The ripple that instantaneously erupted turned into a wave that swiftly spread out from the point of contact.</p><br/><p>The three human figures had just crossed each other when they turned into vaguely visible figures amid numerous rushing wind sounds that appeared one after another. The intense Dou Qi collisions exploded rapidly, appearing like fireworks that were beautiful, but filled with danger.</p><br/><p>The auras of the experts from both sides were completely dragged out the moment Su Qian collided with the Gold Silver brothers. An instant later, numerous figures wrapped under powerful Dou Qi turned into light rays that shot out under a furious roar that had suddenly erupted. Finally, they transformed into a meteor shower that collided with a bang in front of a countless number of heated gazes below.</p><br/><p>There were a couple of expert Dou Huangs among the experts from the ‘Black-Corner Region’. On the other hand, there were fewer Dou Huangs on the Inner Academy’s side. In order to deal with those excess elite Dou Huangs, three expert Dou Wangs per Dou Huang were needed to contain them. The understanding and cooperation between these Elders from the Inner Academy was quite good. Hence, through their collaboration, they were at least able to hold back the Dou Huangs until the Dou Huangs could not leave even if they could not defeat them.</p><br/><p>“Second brother, be careful!” Xiao Yan slowly let out a breath as he watched the energy fireworks that were emitted in all directions. He turned his head to face Xiao Li who had been maintaining his silence and spoke softly.</p><br/><p>Xiao Li raised his head slightly as his gaze swept over the enormous battlefield not far away with a vicious wolf-like gaze. He immediately nodded and laughed somewhat cunningly, “Relax, I will not go and challenge a Dou Huang. As long as I don’t meet one as abnormal as you, I have the confidence in dealing with any other Dou Wang.”</p><br/><p>Xiao Yan smiled and shook his hand. A transparent palm-sized jade bottle appeared in his hand. There was a life-like green-colored flame suspended within the jade bottle. Xiao Yan’s finger touched the jade bottle before stuffing it toward Xiao Li without leaving any trace. He softly said, “You can pour Dou Qi in and quickly throw it if you meet a troublesome opponent.”</p><br/><p>“This is?” Xiao Li received it extremely quickly and inquired with an impassive face.</p><br/><p>“I have used the ‘Heavenly Flames’ after merging them to create a small scale ‘Angry Buddha Lotus Flame’. I name it ‘Fire Lotus Bottle’. Although the explosion created will not possess the kind of power of a true ‘Angry Buddha Lotus Flame’, it will certainly be quite useful during critical moments. Unfortunately, it is too difficult to create it. Otherwise, if I gave you a hundred or eighty of them, it is likely that you would be able to blow up a Dou Huang until he became badly battered should you meet one.” Xiao Yan laughed darkly. This thing was something he had coincidentally thought of. If it was in the past, it was likely that Xiao Yan would not be able to create it even if he was beaten to death. Moreover, this thing could at most be maintained for three days due to the need for the energy to maintain it. If one did not use it within three days, it would automatically disappear. On a whole, however, it was not a bad gadget.</p><br/><p>“You always like to create these things.” Xiao Li smiled and nodded. He said, “Alright, you should also be more careful. That bastard Han Feng is not someone ordinary. If you really cannot deal with him, you should flee by yourself. Remember, the Xiao clan can only rely on you!”</p><br/><p>Once he said those words, the lightning-like silver-colored wings on his back flapped. A faint rumbling thunder appeared, and his body immediately became like a blade that shot into the big chaotic battleground in the sky.</p><br/><p>Xiao Yan’s gaze sent Xiao Li off as the latter rushed into the chaotic battleground. He smiled slightly. Only then did he raise his eyes and swept them toward the only remaining person in the sky who had not moved: Han Feng!</p><br/><p>Han Feng appeared to have sensed something when Xiao Yan’s gaze was thrown toward him. The gaze which was paused in the chaotic battleground slowly turned before finally colliding with Xiao Yan’s gaze. Four eyes entwined with each other as sparks filled with killing intent seeped out.</p><br/><p>The noisy energy explosions quietly weakened as the two of them faced each other. This kind of solemn silence continued for a moment before the two quiet and unmoving figures simultaneously disappeared from their original spots in a ghost-like manner.</p><br/><p>Being the two people who had the most attention within the battleground, Xiao Yan’s and Han Feng’s disappearance caused a countless number of shocked voices to be emitted from below.</p><br/><p>“Chi!”</p><br/><p>When everyone was stunned because of the disappearance of these two people, two human figures strangely surfaced once again in a certain part of the sky. However, the distance between the two of them this time around was not more than a couple of dozens of meters.</p><br/><p>“Junior, aren’t you planning to call that old fellow out to help you this time around?” Han Feng looked at the black-robed, young man in front of him far from the chaotic battleground. The corner of his mouth was lifted into a mocking arc. He slowly raised his hand and a dark-blue flame writhed. The high temperature caused the surrounding temperature to rise. However, Xiao Yan, who was a short distance in front of him, was unmoved despite all of this. He had experienced that vile environment of the magma world. This little temperature did not have the slightest ability to shock him.</p><br/><p>“How can I ask teacher to perform something like cleaning house?” Xiao Yan’s smile was warm. However, he did not hide the coldness hidden in that smile.</p><br/><p>TL: cleaning house - eliminating traitors</p><br/><p>Han Feng’s eyes stared intently at Xiao Yan. A long while later, he suddenly said in a faint voice, “I really don’t understand. Why did he not pass the ‘Flame Mantra’ to me back then? I was his most outstanding student, and the one whom he was most pleased with. If he handed the ‘Flame Mantra’ to me, I would have definitely respected him like I did in the past. His final end was something that he sought after himself.”</p><br/><p>Xiao Yan’s expression slowly became solemn. His voice was filled with ridicule and coldness, “Without teacher, you would merely be an orphan with nothing. Teacher viewed you like his own son. However, you betrayed him just for the ‘Flame Mantra’? It is praise to call you a beast!”</p><br/><p>“Since he treated me like his own son, why did he not pass the ‘Flame Mantra’ to me? I lived with him for so many years, but he had never given it to me. What right do you have to obtain it?” Han Feng suddenly roared out angrily. His face was ferocious and frightening.</p><br/><p>“You have already obtained the ‘Flame Mantra’. It is only natural that you can act so morally. If you, as his disciple, knew that he possessed an incomparable Qi Method, but ultimately refused to pass it to you, what would you do? I’m afraid that you would be similar to me!”</p><br/><p>Xiao Yan glanced at him indifferently and spoke softly, “An animal will always use the eyes of an animal to view this world. This is something that no one can change.”</p><br/><p>Han Feng’s expression became savage. His body trembled repeatedly. It was only a long while later that he managed to suppress the impulse in his heart to tear Xiao Yan into ten thousand pieces. A stiff smile was revealed on his face as he said, “Junior, as long as you are willing to hand over the complete version of the ‘Flame Mantra’, I can hand the entire ‘Black Alliance’ to you. Aren’t you also an alchemist? I can also give you many high-tier medicinal formulas. As long as you agree, I will accept any condition you propose! What do you say?”</p><br/><p>Xiao Yan half-smiled as he studied the fellow in front of him who had changed his expression abruptly. It was just like watching a clown. A long while later, Xiao Yan actually nodded his head in front of Han Feng’s surprised gaze. The former laughed and said, “Yes, you can use your life to exchange for it.”</p><br/><p>The surprise in Han Feng’s eyes slowly withdrew. He inhaled a deep breath of air and the savageness on his face slowly disappeared. At this moment, he appeared to have once again recovered the demeanor of the Medicine Emperor in the ‘Black-Corner Region.’ His gaze was dark and dense as he stared at the smiling black-robed, young man in front of him. He said, “Since that is the case, I can only capture you. Ke ke, be assured that I have many tactics. At that time, I won’t be worried if you don't hand the ‘Flame Mantra’ over to me. Moreover, I will also take the ‘Green Lotus Core Flame’ within your heart away and let you become a completely useless person.”</p><br/><p>Xiao Yan merely smiled and shook his head in the face of Han Feng’s words that contained sinister traces. “Honestly speaking, I also value the ‘Sea Heart Flame’ in your body very much. I think that it might enable my ‘Flame Mantra’ to evolve to an extremely high level.”</p><br/><p>“In that case, I will see whether your strength is as strong as your mouth!” Han Feng smiled in a dark manner. Dou Qi flowed wildly within his body before a dark-blue flame surged to the sky from his hand. It was just like a water curtain that fell from the sky, and it possessed an extremely majestic aura.</p><br/><p>The blue-colored fire curtain that had suddenly erupted immediately attracted the countless number of gazes from the city. Shocked voices involuntarily sounded from within the city when they saw this large-scale fire.</p><br/><p>“During these two years, I have also gradually touched the barrier of an elite Dou Zong. The current me is much stronger than I was in the past. The last time, I was seriously wounded by you because I had underestimated that fire lotus of yours. You won’t have such good luck this time around.” Han Feng’s body was suspended in the dark-blue fire curtain that fell from the sky. He looked down at Xiao Yan from above as he spoke with a cold smile.</p><br/><p>Xiao Yan gently waved his sleeves as he raised his head to look at the large deep-blue fire curtain. A jade-green flame began to rise from his body before wrapping around his entire body.</p><br/><p>“A dark-jade-green flame?” Han Feng’s eyes suddenly shrank when he saw the dark-green flame appearing. He clearly remembered that the ‘Green Lotus Core Flame’ back then was not this color…</p><br/><p>Han Feng’s expression changed abruptly as he was pondering while feeling loss within his heart. He abruptly raised his head only to be shocked. He saw his deep-blue fire curtain, that fell from the sky, appeared to have felt some sort of powerful presence as it swiftly became sluggish.</p><br/><p>Han Feng was stunned as he felt the ‘Sea Heart Flame’ become somewhat sluggish. He could clearly sense a fear being emitted from the flame!</p><br/><p>Xiao Yan smiled when he watched the fire curtain that had suddenly become sluggish. A wisp of dark-green flame gently rose on his finger as he spoke with a soft laugh.</p><br/><p>“Senior, it appears that your ‘Heavenly Flame’ is a little afraid of my ‘Heavenly Flame’...”</p><br/>\n</div>"}