{"title": "Chapter 648: Practicing the Open Mountain Seal", "id": 648, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-648-practicing-the-open-mountain-seal", "volume_title": "Volume 7", "body": "<h1>Chapter 648: Practicing the Open Mountain Seal</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 648: Practicing the Open Mountain Seal</u></strong></p><br/><p>Queen Medusa gave a cold snort when she saw the bright smile on Xiao Yan’s face. She made the decision in her heart that she would definitely turn this fellow into ten thousand pieces in the future once she escaped the influence of the ‘Heaven Swallowing Python’!</p><br/><p>Xiao Yan smiled and sat up from the huge rock. He said to Medusa, “In that case, we can be considered companions from now on.”</p><br/><p>“We only have the relationship of business partners, not companions!” Queen Medusa skimmed her sleek red lips, and completely destroyed Xiao Yan’s thoughts of bringing their relationship closer.</p><br/><p>“Alright, alright, a business relationship.” Xiao Yan indifferently spread his hand and smiled before saying, “However, since we are going to be together and one year is so long, I cannot simply keep calling you Medusa, right? Why don’t I help you pick a name? Otherwise, other people will know your identity once I call your name in the future.”</p><br/><p>“There is no need to concern yourself with it!” Queen Medusa merely replied coldly to Xiao Yan’s good intentions.</p><br/><p>“Why don’t I call you Cai Lin? I think that this name really suits you.” Xiao Yan continued speaking on his own, feeling not the least bit concerned that this name was a little philistine.</p><br/><p>TL: Cai Lin - means colorful scales in reference to the colorful scales on the Heaven Swallowing Python</p><br/><p>“Get lost!” Queen Medusa was irritated by Xiao Yan’s endless words, which caused her to be furious. Her pretty eyes were filled with coldness as she stared at the young man in front of her. However, when she saw the bright warm smile on the former’s face, the fury in her eyes somewhat dissipated. She coldly said, “Queen Medusa is not just my name, but also my status. I don’t need you to change my name.” Once she said this, she turned around and rushed into the distance.</p><br/><p>“You have already transformed into a human. Not the half-human half-snake form of the past. Therefore, you naturally need a name. In the future, I will call you Cai Lin. Saying Queen Medusa is far too troublesome.” Xiao Yan raised his head somewhat recklessly, and cried out loud to Queen Medusa in the sky.</p><br/><p>Queen Medusa’s body paused slightly. Her eyes flickered for an instant. However, she did not cry out angrily this time around. Her body moved and she transformed into a light figure that rushed into the distance.</p><br/><p>“Additionally, can I trouble you to help me keep an eye on my surroundings and not let anyone disturb me. Otherwise, if an accident happens, our transaction will be null and void…”</p><br/><p>Queen Medusa completely ignored Xiao Yan’s loud cry. Her body flashed and she disappeared into the horizon. No one knew if she bore Xiao Yan’s words in her heart.</p><br/><p>Xiao Yan smiled slightly when he saw Queen Medusa’s disappear. He had finally settled this big trouble. With the so-called ‘Soul Recovery Pill’ transaction, he would no longer need to worry about when that frightening woman would appear and kill him.</p><br/><p>“Hee hee, Han Feng did indeed own a rich collection. He even possessed a medicinal formula for a medicine with such a strange effect. It is thanks to him that I am able to settle my problem this time around.” Xiao Yan rubbed the ‘Serene Sea Storage Ring’ on his hand and softly laughed. If it was just him, he naturally did not possess a medicinal formula like the ‘Soul Recovery Pill’. This thing was something he had taken from the ‘Serene Sea Storage Ring’ while he was recuperating.</p><br/><p>“Now, I can finally relax and practice the ‘God Seal Palm’...” Xiao Yan stretched his lazy waist and smiled slightly. He once again sat down cross-legged on the huge rock and shut his eyes. His mind moved as some information slowly flowed past his heart.</p><br/><p>Xiao Yan carefully read the training method for the ‘Open Mountain Seal’. It was a long while later before he knit his brows and opened his eyes. “This ‘God Seal Technique’ is indeed worthy of being a Di Class High Level Dou Technique. The difficulty involved while practicing it was many times that of the ‘Flame Splitting Tsunami’.”</p><br/><p>“It actually needs to open three specific Qi Paths before one can condense a palm and maneuver Dou Qi to unleash the Dou Technique...” Xiao Yan knit his brows tightly. The Qi Paths in one’s body were as complicated as the stars all over the sky. There were a countless number of them. Some of them were tiny and difficult to find. Moreover, they were also extremely brittle. Forget about opening them, they would crack open even if one used a slightly stronger energy to charge at it. The three specific Qi Paths of the ‘Open Mountain Seal’ were coincidentally three remote ones on his right hand. One would definitely have to spend quite a large amount of time in order to open them up.</p><br/><p>This kind of Dou Technique which required one to open up certain veins in order to use was usually one with a terrifying strength or one that belonged to the legendary class. Back then, Xiao Yan did not need to purposefully open up any Qi Paths when he practiced the ‘Flame Splitting Tsunami’. From this, one could tell just how unique this ‘God Seal Technique’ was.</p><br/><p>“Ugh…” Xiao Yan sighed softly. He shook his head helplessly. Now that things had progressed to this stage, he could only give it a try regardless of how difficult it was to open the three veins. If he were to give up practicing something that Xun Er spared no expense to leave for him, he would have really wasted her effort.</p><br/><p>Xiao Yan tossed aside the emotion within his heart. His mind gradually became quiet as he entered his training condition a moment later.</p><br/><p>Xiao Yan’s mind swiftly arrived at the three veins that needed to be opened up after he entered his training mode. He eyed the three Qi Paths which were like three blocked cylinders and sighed once again. It appeared that he was going to have a headache…</p><br/><p>Xiao Yan’s mind moved and a tiny thread of Dou Qi surged out from within his body. Finally, it circulated a couple of times under Xiao Yan’s control before it finally arrived at this remote Qi Path. After which, it obeyed Xiao Yan’s orders and carefully invaded that tiny Qi Path.</p><br/><p>Opening one’s Qi Paths was an extremely painful thing. The intense pain that occurred when Dou Qi cleared the Qi Path and expanded was not something that an ordinary person could endure. However, the expected intense pain and difficulty to widen the Qi Path did not appear when Dou Qi was poured into that tiny Qi Path. Although the flow of Dou Qi was extremely slow due to the tiny size of the Qi Path, Xiao Yan could clearly sense that the blocked feeling inside the Qi Path was slowly disappearing…</p><br/><p>“What is going on?” Xiao Yan was somewhat stunned as he studied the Qi Path that was being gradually unblocked. His heart was filled with disbelief. Since when was opening up a Qi Path this easy?</p><br/><p>Of course, at this very moment, Xiao Yan was naturally unaware of the prolonged tug of war between the ‘Fallen Heart Flame’ and the strange liquid when he had entered into his near death state while he was underground. The greatest victor during that tug of war was Xiao Yan’s body. Regardless of whether it was his bones, Qi Paths, muscles, etc., in his body, all of them had been completely refined during that tug of war. Hence, any part inside Xiao Yan’s body was tougher than those experts who had a strength similar to his.</p><br/><p>It was also due to his Qi Paths having previously been refined that Xiao Yan felt that opening up a Qi Path was this easy. This was similar to a tunnel whose outline had already been roughly constructed by someone. All the people who came after would only need to clear out some of the rock fragments that remained within the tunnel.</p><br/><p>If an ordinary person were to open their Qi Paths, it was likely that their Qi Paths would have already burst from the pressure of the Dou Qi. How would it be possible to have Xiao Yan’s progress?</p><br/><p>Although Xiao Yan was uncertain why opening a Qi Path had become this simple, this was something that did not hurt Xiao Yan even a little. Hence, in his wild joy, Xiao Yan began to unceasingly direct Dou Qi to strike this blocked Qi Path. This Qi Path, which he had never used, was quietly expanded at a slow pace by his Dou Qi…</p><br/><p>Although opening a Qi Path had become much easier because of the prior refinement of the interior of his body, it was still a process that one needed to adhere to the rules. After all, the vein was currently too fragile. If one were to quietly use a little more force, one would cause it to burst apart. This risk was something that even Xiao Yan did not dare to take.</p><br/><p>Therefore, when the opening of the vein within his body progressed at a tortoise-like pace, the somewhat impatient Xiao Yan could only enter his training condition and split his attention into two different areas…</p><br/><p>No matter how slow or tortoise-like the pace was, there would ultimately be a time when it arrived at its destination. The first Qi Path was finally opened by him five days after he had entered the deep mountains. He had formally took his first step in practicing the ‘Open Mountain Seal’!</p><br/><p>After having some experience from the first attempt, Xiao Yan was a little more familiar with his remaining Qi Paths. Although his speed was still similar to a tortoise moving, it would upset a person until he threw up blood and died if one compared his speed with another.</p><br/><p>The second Qi Path was also opened up by Xiao Yan without any incident around ten days or so after the first vein was opened. This kind of smooth training caused Xiao Yan to be so happy that he could not shut his mouth. According to this speed, it was likely that he would be able to completely finish the precondition of opening up the three Qi Paths within one month. At that time, he would be able to formally practice the ‘Open Mountain Seal’ he coveted greatly.</p><br/><p>Time quietly flowed by in the deep mountains. Perhaps Xiao Yan’s reminder had some effect on Medusa. Nothing had come to disturb him ever since he had entered his training condition. This enabled him to obtain an extremely quiet training environment.</p><br/><p>Exactly after one month, the young man on the mountain top who had his eyes shut, suddenly opened them. A substance-like glow flashed through his eyes before it gradually disappeared a moment later.</p><br/><p>Xiao Yan slowly stood up from the huge rock. He raised his head and let out a long breath. He had opened up three veins within a month. This kind of speed was something that even he himself could not quite believe. It was likely that this was quite a good result even when placed among Xun Er’s clan.</p><br/><p>“Since the Qi Paths have been opened… next, it should be the time to formally practice the ‘Open Mountain Seal’!”</p><br/><p>Xiao Yan laughed softly. His right hand formed an extremely strange hand seal in front of him. The hand seal was pushed forward. This was naturally superfluous without any Dou Qi to activate it. However, Xiao Yan clearly understood that within a short period of time, the strength that the hand seal would emit would likely shock even himself.</p><br/>\n</div>"}