{"title": "Chapter 640: Emerald Fire Lotus", "id": 640, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-640-emerald-fire-lotus", "volume_title": "Volume 7", "body": "<h1>Chapter 640: Emerald Fire Lotus</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 640: Emerald Fire Lotus</u></strong></p><br/><p>The fire lotus may have only been the size of a palm, but it was even more frightening in Han Feng’s eyes than the enormous ruler glow from earlier that had basically spanned the entire sky. This was because it was this damn thing nearly cost him his life two years earlier!</p><br/><p>The current flame was no longer the green-white color back then. Its entire emerald-like color appeared even more beautiful. However, Han Feng understood that this current fire lotus was likely even more frightening than the one back then!</p><br/><p>The strongest ‘Angry Buddha Lotus Flame’ shape in the past was merged from the ‘Green Lotus Core Flame’ and the ‘Bone Chilling Flame.’ Since the ‘Bone Chilling Flame’ was ranked a little higher on the ‘Heavenly Flame Ranking’ compared to the ‘Fallen Heart Flame’, it seemed that this current merger was weaker than that of the past from a certain point of view. However, the ‘Bone Chilling Flame’ was Yao Lao’s ‘Heavenly Flame’. Even though Xiao Yan could control it, it was basically impossible for him to reach the familiarity he had with the ‘Green Lotus Core Flame’. Therefore, the merger of those two ‘Heavenly Flames’ would more or less have some conflict. Although this kind of conflict was difficult to sense under the suppression of Xiao Yan’s powerful Spiritual Strength, it would still limited some of the strength of the fire lotus.</p><br/><p>However, things were different now. The ‘Green Lotus Core Flame’ and the ‘Fallen Heart Flame’ were completely refined by Xiao Yan. It was much smoother for him to control it. When the current Xiao Yan used the two kinds of flame to merge an ‘Angry Buddha Lotus Flame’ the exhaustion of his Dou Qi or Spiritual Strength was much less than before. Moreover, the strength wasn’t even the slightest bit reduced. Moreover, speaking from a certain point of view, the merger of these two kinds of flames without any gap caused the ‘Angry Buddha Lotus Flame’ strength to reach an extremely great degree.</p><br/><p>Therefore, the ‘Fallen Heart Flame’ might not be comparable to the ‘Bone Chilling Flame’ on the ‘Heavenly Flame Ranking’, but the strength of the ‘Angry Buddha Lotus Flame’ created was not the least bit weaker than back then!</p><br/><p>Han Feng could vaguely sense the current strength of this emerald-like fire lotus by relying on his outstanding Spiritual Strength. Therefore, his expression gradually grew darker and more solemn. He understood that he had once again been tricked by Xiao Yan.</p><br/><p>The strength of the ‘Angry Buddha Lotus Flame’ may be extremely great, but it required quite a lot of strength to agglomerate. If the merger was interrupted during this period of time, the fire lotus would naturally fail to merge successfully. However, Xiao Yan had used the collision between the ‘Flame Splitting Tsunami’ and the ‘Radiance Seal’ earlier as cover as he quietly completed the merger of the fire lotus. It was little wonder why his expression would be so pale after the energy scattered. It was not because he had received a backlash during the collision, but because he had agglomerated the ‘Angry Buddha Lotus Flame’!</p><br/><p>Xiao Yan smiled as he watched the dark and solemn expression of Han Feng. He lowered his head to watch the slowly rotating emerald fire lotus above his palm. His heart was hissing and sobbing a little. This was the first time he had completely relied on his own strength to create this large-scale strong fire lotus ever since he created the ‘Angry Buddha Lotus Flame’. The strongest ‘Angry Buddha Lotus Flame’ form which he had used in the past not only relied on the support of Yao Lao’s Spiritual Strength, but also needed to borrow a wisp of ‘Bone Chilling Flame’ in order to completely use it. Now, however…</p><br/><p>Xiao Yan gently dragged out the fire lotus in his hand. A pleased arc was lifted from the corner of his mouth. It appeared that the pain he had suffered underground during these two years had allowed him to obtain quite the good results…</p><br/><p>Xiao Yan raised his head and watched the dark and solemn face of Han Feng. He smiled and his finger gently flicked the fire lotus. The latter immediately drifted out slowly…</p><br/><p>The emerald fire lotus strangely began to expand upon leaving Xiao Yan’s hand. Within the short blink of an eye, its palm-like size was expanded until it was around five feet wide. Raging dark-green flames rose on it and set it off like a lotus platform that buddha sat on. It appeared holy, and secretly contained a frightening destructive strength.</p><br/><p>After the emerald fire lotus expanded until it was around five feet wide, the surrounding space began to fluctuate abruptly. Numerous dark-black tiny tendrils spread out into the sky. The strength that was contained in the fire lotus had actually reached the frightening point of shaking space!</p><br/><p>Quite a number of small black-colored tendrils repeatedly appeared from all around as one watched the fire lotus rotate slowly. Han Feng’s eyes suddenly shrank tightly in the distance. This frightening destructive strength was something that caused even him to feel uneasy. If he were struck by this attack, it was likely that he would be killed on the spot!</p><br/><p>“Damn fellow!”</p><br/><p>Han Feng clenched his teeth violently. He did not dare to slight it even a little. A low, deep roar suddenly sounded from his throat, and the deep-blue flame from within his body erupted out unceasingly. Finally, it transformed into a deep-blue fire sea that was around seventy to eighty feet wide. His body was at the middle of this sea of fire. Flames churned all around him, emitting the loud sound of ocean waves slapping against rocks, causing everyone’s hearts to feel some pressure. That feeling was as though they were alone in the face of a never ending large sea, causing people to be unable to pick up the courage to resist.</p><br/><p>The blue flame spread over the sky and a high temperature covered the area. Some of those experts who were stronger were a little better off, but for the rest, perspiration rained down their bodies. Some of those who were even weaker felt their eyes become white before they fell head first to the ground.</p><br/><p>A ‘Heavenly Flame’ possessed the frightening strength to change the environment. These words were indeed true. With Han Feng using his full strength to maneuver it, the surroundings of this Feng City immediately appeared as though it had experienced a drought for a long time. Even the water in the air was completely vaporized. The dry air caused people to feel a dry pain in their throats each them they inhaled air into their bodies.</p><br/><p>“Go…”</p><br/><p>Under Han Feng’s gaze, Xiao Yan flicked his finger and the slowly turning large green fire lotus trembled before it shot forward with an ear piercing sound. With a green light, it flew towards the blue fire with heated winds.</p><br/><p>“Sea Heart Magical Beast!”</p><br/><p>Han Feng watched the emerald flowing light that shot explosively over with a serious expression. His palm moved and a cry yelled out from his throat. Immediately, that enormous sea of fire churned intensely. The flame whizzed and rotated before actually becoming an extremely large dark-blue beast!</p><br/><p>The appearance of this enormous beast caused some blood color to disappear from Han Feng’s face. Clearly, this thing exhausted quite a bit of Dou Qi.</p><br/><p>The size of the enormous beast was large, and was not the least bit smaller than the fighting form of the ‘Heaven Swallowing Python’. Its shape was like a lion, but it possessed a large scorpion-like tail. A deep-blue-colored horn, that protruded from its head, displayed a flickering blue glow. The horn would occasionally sway and tiny black scars would surface in the empty space.</p><br/><p>Xiao Yan was also startled when the large head of the deep-blue enormous lion-like fire beast appeared. It was unexpected that Han Feng’s control over the ‘Sea Heart Flame’ had already reached such a stage in the two years they had not met. Xiao Yan questioned himself, and found that it was likely that even the current him would have difficulty using a ‘Heavenly Flame’ to agglomerate and form such a complex beast shape.</p><br/><p>Xiao Yan was shocked, but the emerald fire lotus which had already locked onto its target did not hesitate. It appeared to have teleported, and within a couple of flashes, it was only a short distance from Han Feng. The frightening wind was something that caused even the deep blue sea of fire spread throughout the sky to form some ripples.</p><br/><p>“Gi!”</p><br/><p>Han Feng’s expression was extremely solemn as he stared at the large fire lotus that was coming at him head-on. The seal on his hand changed, and with a low cry, the large fire lion, that had been agglomerated from his own strength, raised its head and emitted a loud thunder-like roar. Its four hooves moved immediately as it became tank-like, and fearlessly charged toward the fire lotus!</p><br/><p>The distance between the two was instantly covered. Immediately, the two frightening energies, which were enough to incinerate the mountains and boil the seas, collided with a bang, like meteors, in front of Han Feng’s and Xiao Yan’s tense minds!</p><br/><p>“Bang!”</p><br/><p>The entire sky was momentarily silent when the two made contact. Immediately, the natural energy began to become violent. Multicolored energy flew all over the sky. At a glance, it seemed as though they were wildly fleeing the area where the collision occurred…</p><br/><p>The sudden uprising of the energy in the area also caused all the experts in the sky to suddenly cease their actions. Numerous gazes carried shock that was difficult to hide as they watched this area that had suddenly turned into a vacuum of space. The terrifying energy ripples which seeped out from the fire lotus and the fire beast caused their hearts to be filled with fear. If this energy were to touch their bodies, it was likely that their bodies and bones would burst apart on the spot.</p><br/><p>“Bang!”</p><br/><p>The silence merely lasted for an instant before a catastrophic energy storm erupted from the center!</p><br/><p>The frightening fire energy storm spread and covered an area that was over a hundred meters in radius. Even the people from both sides of the chaotic battle in the sky moved their bodies and fled in all directions in a miserable manner. They clearly understood that if they were to be struck by this thing, it was likely that they would suffer despite their strength.</p><br/><p>Therefore, a comical scene appeared. The fiery hot chaotic battle that was raging in the sky had, at this very moment, turned into a scene of frightened birds fleeing. Everyone abruptly fled the area. All that remained was a countless number of stunned gazes on the ground.</p><br/><p>Su Qian struck his palm out and a powerful force shook the Gold Silver Brothers until they stepped back rapidly. A faint paleness also surfaced on the latter’s faces. Although they could contend with an elite Dou Zong by joining hands, they would still end up losing if things really did drag on. In the past, Han Feng would have long escaped from the opponents pestering him to come and help them deal with Su Qian. Now, however, not only was he held back by Xiao Yan until he could not leave, but there was also the taste of him not being able to even protect himself. As more time passed, it was only a matter of time before the two of them would be defeated in Su Qian’s hands.</p><br/><p>Su Qian smiled coldly as he observed the Gold Silver Brothers whose faces were alternating between white and green. Su Qian did not grab his advantage and give chase. He turned around and watched the center of the frightening firestorm with a solemn expression. This kind of energy collision was something that caused even someone of his strength to feel afraid.</p><br/><p>“I have really underestimated Xiao Yan. He was actually able to delay Han Feng even in such a situation… however, I wonder who will be victorious in the end.”</p><br/><p>Su Qian glanced at the frightening firestorm. He clearly understood in his heart that the victor would be determined after this exchange. He was unable to decide just who would laugh in the end…</p><br/><p>“Ugh, hopefully it will be that little fellow…”</p><br/>\n</div>"}