{"title": "Chapter 650: Three Large Factions", "id": 650, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-650-three-large-factions", "volume_title": "Volume 7", "body": "<h1>Chapter 650: Three Large Factions</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 650: Three Large Factions</u></strong></p><br/><p>“Bang!”</p><br/><p>An enormous jade-green energy handprint suddenly surfaced in the sky. It immediately carried the frightening sound of rushing wind as it violently smashed into a mountain wall like a cannonball. Immediately, the entire mountain peak forcefully exploded and violently shook the entire mountain. An arm thick crack line spread like a spiderweb from the mountain peak and covered the entire wall within a short period of time.</p><br/><p>Xiao Yan’s expression carried a trace of whiteness as he watched the mountain peak that was on the verge of collapse while wearing a pale-white expression. A joy that could not be hidden covered his dark-black eyes. After practicing for many days, he had finally learned to control the rhythm; therefore, he was able to truly use the ‘Open Mountain Seal’.</p><br/><p>Although the ‘Open Mountain Seal’ this time around was a little crude, Xiao Yan believed that he would definitely be able to reach complete mastery through practice if he was given sufficient time. At that time, the strength of this ‘Open Mountain Seal’ would likely become even more frightening.</p><br/><p>Everything was difficult at the beginning. Since Xiao Yan already possessed quite a good start, success was only a matter of time…</p><br/><p>Xiao Yan panted intensely. He flapped the dark-green wings on his back, and slowly landed on a messy mountain top. After over a month of training, he had currently reached an initial mastery of the ‘Open Mountain Seal’. If he wanted to reach complete mastery, he would need time and opportunity to hone it through actual combat experience.</p><br/><p>“It is indeed worthy of being a Di Class High Level Dou Technique. I had merely used it at its initial stage, but its strength is not any weaker than the ‘Flame Splitting Tsunami’. I will have another trump card when fighting with another in the future.” The dark-green flame wings on Xiao Yan’s back quietly disappeared as he softly laughed.</p><br/><p>“Ji!”</p><br/><p>A bird cry suddenly sounded in the sky just as Xiao Yan planned to recover the exhausted Dou Qi within his body. Xiao Yan lifted his head with some doubt before his expression slightly changed. He extended his hand and a suction force erupted. The messenger pigeon lingering in the sky was sucked down.</p><br/><p>Xiao Yan received a tiny bamboo tube from the leg of the messenger bird. He opened it and took out a piece of paper that was folded. His gaze swept over it and his expression sank. After musing for a moment, he flicked his finger and the piece of paper burst into flames. It turned into a pile of ashes that scattered down to the ground below.</p><br/><p>“Cai Lin!” Xiao Yan turned around and suddenly shouted loudly to the vast forest all around. However, there was not the slightest reaction even after a long time. Xiao Yan had no other choice as he cried out once again, “Medusa, there is a problem. Come!”</p><br/><p>This time around, a seven-colored glow finally rushed out from a certain part of the forest a short moment after the cry sounded. Within a couple of blinks, the cold, indifferent Queen Medusa appeared in front of Xiao Yan.</p><br/><p>“There are some issues that require me to go to the ‘Black-Corner Region’. Let’s go.” Xiao Yan automatically ignored the cold face of Queen Medusa as he spoke.</p><br/><p>“You can forget about getting me to be your free fighter.” Medusa’s eyebrows were vertical as she spoke in a cool voice.</p><br/><p>“There will no longer be anyone who will help you refine the ‘Soul Recovery Pill’ if I die.” Xiao Yan smiled indifferently. His back immediately shook and a beautiful pair of dark-green fire wings appeared. The fire wings flapped and Xiao Yan’s body swiftly rose up into the air as wild wind surrounded his body. Finally, he turned around and charged toward the ‘Black-Corner Region’.</p><br/><p>Xiao Yan knew that Xiao Li had met some trouble from the letter. However, he did not plan to gather helpers from the Inner Academy. With his current strength, there was basically no one who could stop him within the ‘Black-Corner Region’. Moreover, one should not forget Medusa who was currently following him after reaching an agreement to cooperate. This was a true elite Dou Zong. Moreover, she might be even stronger than Su Qian!</p><br/><p>Given Xiao Yan’s and Medusa’s strength, it was likely that they would be sufficient to sweep over the entire ‘Black-Corner Region’. The so-called Gold Silver Brothers might be able to join hands to delay Su Qian. However, if their opponent was Queen Medusa, it was likely that they would not be so lucky. After all, she was not an ordinary elite Dou Zong.</p><br/><p>Medusa clenched her hand tightly as she watched Xiao Yan’s figure that was gradually becoming distant. She hesitated for a moment before she angrily clenched her silver teeth. Her delicate legs stepped on empty sky as her figure transformed into a ray of light that swiftly caught up to the black figure in front.</p><br/><p>Feng City.</p><br/><p>At this moment, all the attention within Feng City was gathered on the grand manor at the middle of the city. That place was likely the place where the one who controlled the city would be decided.</p><br/><p>Honestly speaking, most people within the city were not very interested in who would be the one in charge of the city. In any case, they knew that regardless of who was in control, they would ultimately be simply muddling along at the lowest level. Hence, they were even happier to see many factions having a big fight for the position to govern the city, resulting in blood flowing like a river. People who gloated over another’s misery and liked to add insult to injury could be found all over the ‘Black-Corner Region’.</p><br/><p>Around half an hour ago, three large units had swaggered into Feng City before finally rushing to the manor where Medicine Emperor Han Feng had once resided. Currently, that place housed the faction who controlled Feng City, ‘Xiao Gate’.</p><br/><p>Most of the people within Feng City had heard of these three powerful factions. After all, their reputation was sufficient to spread all over the ‘Black-Corner Region’ since they were first-tier factions. Hence, almost everyone was familiar with them.</p><br/><p>Dark Sky Sect, Luo Sha Gate, and Wild Lion Gang. These three large factions were extremely renowned, powerful factions within the ‘Black-Corner Region’. The leaders of the three large factions were experts who were ranked within the top ten of the ‘Black Ranking’. Any random person among them was not weaker than Fan Lao who had died in Xiao Yan’s hands. These three large factions dominated the ‘Black-Corner Region’ and had always been overbearing. They even ignored Han Feng when he invited these three large factions to join him when he had established the ‘Black Alliance’. This kind of action might have caused Han Feng to be extremely furious, but he had let things be because he was afraid of the strength of these three large factions.</p><br/><p>Back then, the ‘Black Alliance’ was very grand. However, these three factions were able to choose to reject joining them even in that kind of situation. From this, one could tell that they possessed quite the strong capital. After all, the leaders of the three large factions were no fools. They would naturally be unwilling to offend those whom they could not afford to offend… although Han Feng was someone whom they were afraid of, it was far from the point where they had to bow before him.</p><br/><p>There were many people who felt pity for the so-called ‘Xiao Gate’ now that these three factions had sent their forces into Feng City. In the eyes of many people, ‘Xiao Gate’ was just like a student meeting a master when faced with these three old first-tier factions despite the ‘Xiao Gate’ possessing a qualification that was near a first-tier faction. If the leader of ‘Xiao Gate’ was sensible, he would obediently hand over the rights to control the city. This was the wisest choice.</p><br/><p>In an wide hall within a large courtyard, the atmosphere was extremely tense and seemed like it would explode with a single spark.</p><br/><p>There were currently four groups of people within the hall at this moment. The one furthest in was naturally ‘Xiao Gate’ who controlled the city. Those three others on the outside seemed to be the people from the so-called Dark Sky Sect, Luo Sha Gate, and Wild Lion Gang.</p><br/><p>“You are the leader of ‘Xiao Gate’ right? I shall not beat around the bush. Don’t blame us for washing this place with blood if you don’t give me a clear answer within an hour.” A middle-aged large man with a bare chest that showed an enormous lion roaring toward the sky was faintly visible on his chest glanced at Xiao Li. A smile surfaced on his face which was filled with a bloody scent.</p><br/><p>“Ahem. Sect Leader Yan is still so forthright. However, I also approve of these words of his.” The middle-aged man had just spoken when a sexily clad beautiful woman covered her mouth and gave a loving laugh. There was a flirtatious poppy flower tattooed on the side of her face near her ear. Although it was beautiful, it possessed a lethal poison.</p><br/><p>A shadowy-faced old man on the other side laughed darkly. His shriveled bone-like hand moved on the table, “The old me has not fought for a period of time. I wonder if I will be as ruthless like in the past if I do so.”</p><br/><p>There were nearly a hundred people standing in a scattered manner behind these three people. The bodies of these people were covered in blood. Their gazes were as cold as wild beasts when they swept around.</p><br/><p>Xiao Li’s gaze was dark and cold as he observed the three people who were singing the same tune. There were a hundred black-clothed men gathered behind him. The bloody stench on their bodies was not any weaker than those fellows in front of him. At one glance, one could tell that they had rich battle experience and were vicious individuals. The reason the other party did not act immediately upon their arrival was partly because of the significantly strong aura of these black-clothed individuals on Xiao Li’s side. Otherwise, they would have long since attacked right away given their character. Why else would they repeatedly chatter in this place?</p><br/><p>“I am clearly aware that the three of you have quite big fists within the ‘Black-Corner Region’. You are all strong and there is nothing I can do if you want to occupy Feng City. It is possible for me to hand over Feng City. But… there is only one city. Who should I hand it over to?” Xiao Li played with the teacup in his hand when he suddenly asked a question.</p><br/><p>There was a slight change in the atmosphere within the hall when Xiao Li’s words sounded. A moment later, that sexily clad beautiful woman laughed, “Your scheming is not bad, but this kind of plan to alienate us with one another is useless. You need not worry about who is eventually going to be in charge of this city. All you need to do is to lead your people out of Feng City.”</p><br/><p>Xiao Li’s hand tightened its grip on the teacup. He sighed with some disappointment in his heart. They were indeed very experienced and did not show any sign of falling for this ruse.</p><br/><p>“It is possible for us to leave Feng City. However, I am not the leader of ‘Xiao Gate’. Should you not wait for our leader to return if you want us to get lost?” Xiao Li frowned. Some killing intent surfaced on his cold face as he spoke in a deep voice. The current him needed to fight for some time for Xiao Yan to hurry back!</p><br/><p>“Chattering non-stop. Where did you find all this nonsense to say? The old me is not here to discuss anything with you. I am here to inform you to get out of this city!” The large man with exposed arms immediately widened his eyes at Xiao Li’s words. His palm slammed onto the table in front of him until it was in pieces as he let out a savage laugh.</p><br/><p>Xiao Li’s expression immediately became gloomy. The large group of black-clothed men behind him also emitted a ‘Clang’ sound as they drew their weapons from their waists. In an instant, the atmosphere within the hall had become anxious with swords drawn. It was one that would break out into a killing fight at the slightest disagreement.</p><br/><p>“Ke ke, you want my ‘Xiao Gate’ to get out of Feng City? Even Han Feng wasn’t qualified to do so. What makes you think you have the right?”</p><br/><p>A faint cold laugh suddenly resounded just as the atmosphere was about to completely collapse. A black figure immediately appeared in the middle of the hall in a ghost-like manner in front of everyone’s eyes...</p><br/>\n</div>"}