{"title": "Chapter 656: Deterrent", "id": 656, "volume": 7, "url": "http://boxnovel.org/battle-through-the-heavens-chapter-656-deterrent", "volume_title": "Volume 7", "body": "<h1>Chapter 656: Deterrent</h1>\n<div class=\"chr-c\" id=\"chr-content\" style=\"font-family: Minion, serif, serif; font-size: 18px; line-height: 160%;\">\n<p><strong><u>Chapter 656: Deterrent</u></strong></p><br/><p>A black figure also slowly appeared on the auction stage as that laughter sounded in the auction hall.</p><br/><p>The faces of the Gold Silver Brothers changed a little when that somewhat familiar laughter sounded. Their expressions immediately became ugly when their gazes shifted onto the human figure on the auction stage.</p><br/><p>“Xiao Yan? You have killed the Black Alliance Chief Han Feng, yet you still dare to come to the ‘Black-Corner Region?”</p><br/><p>The cold cry that was emitted from the mouths of the Gold Silver Brothers immediately caused the entire auction house to become noisy. Numerous shocked gazes started at the black-robed, young man on the stage. This extremely young fellow was actually the Xiao Yan who had killed Medicinal Emperor Han Feng?</p><br/><p>Although Xiao Yan’s reputation had spread across the entire ‘Black-Corner Region’, many people were still unfamiliar with his appearance. Hence, they felt disbelief when they saw that this strong person, who was rumored to be able to kill Han Feng, was actually this young.</p><br/><p>Xiao Yan’s gaze swept toward the ugly expressions of the Gold Silver Brothers as he laughed softly, “Both of your words are really funny. There are countless number of people who are killed in the ‘Black-Corner Region’ everyday. Don’t tell me that one must be expelled after killing someone? It is only too common for injuries and death when two people fight.”</p><br/><p>“A glib tongue. Feng City is the headquarters of the ‘Black Alliance’. Although Han Feng was already killed, we members of the ‘Black Alliance’ have the right to take it back. However, looking at your intentions now, you are actually thinking of occupying this city for yourself? Aren’t you slighting all of us?” The Gold Silver Brothers looked at one another before they spoke in a dark and sinister manner.</p><br/><p>“Han Feng has already died, and the ‘Black Alliance’ is already dissolved. The winner becomes king while the loser becomes the bandit. Being the victor, I have the right to take everything within this city. If the two of you aren’t satisfied, you can come and snatch it from me.” Xiao Yan raised his eyes. His gradually colder voice did not give the Gold Silver Brothers any face. The provocation that existed within his words was not hidden in any way.</p><br/><p>A commotion suddenly rose within the entire place after these somewhat wild and arrogant words of Xiao Yan sounded. There were not many people within this entire ‘Black-Corner Region’ who dared to speak to the Gold Silver Brothers with such a tone.</p><br/><p>The faces of the Gold Silver Brothers similarly turned green at this provocation of Xiao Yan. A moment later, a somewhat sharp voice sounded in the auction ground, “A brat who doesn’t know the immensity of the heavens and earth. Do you really think that you can dominate the ‘Black-Corner Region’ by defeating Han Feng? Back then, if Su Qian, that old fellow who won’t die, did not protect you, I would have killed you!”</p><br/><p>The private conversations within the auction hall was immediately reduced greatly when everyone saw the gold-silver brothers becoming furious. Numerous gloating gazes were looking at Xiao Yan on the stage. The people in the ‘Black-Corner Region’ were clearly aware of the tactics of the gold-silver brothers. The thing that these two old fellows hated the most was when people did not give them face in public. Now that Xiao Yan had embarrassed them in front of so many people, it seemed that it was going to be somewhat difficult for the auction to progress successfully today.</p><br/><p>“It is not difficult to let the both of you to follow Han Feng’s path if the two of you are separated.” Xiao Yan spoke faintly. Although these two old fellows could contend with a strong Dou Zong if they joined hands, they only had the strength of someone at the peak of the Dou Huang class if they were separated. It was not impossible for Xiao Yan to kill someone at the peak of the Dou Huang class given his current strength.</p><br/><p>“What naive words.” The Gold Silver Brothers merely scoffed at these words of Xiao Yan. They coldly laughed, “There is no fairness in the ‘Black-Corner Region. Only the difference between victory and defeat exists. We have always joined hands to fight during all these years, regardless of whether the other party is strong or weak. Separate? That is something that only an idiot would do. However, since you, a little brat, have mentioned this today, we shall help take revenge for Han Feng today. Otherwise, he might not be able to rest in peace.”</p><br/><p>Two powerful auras surged explosively from the Gold Silver Brothers after their voices sounded. After which, their auras merged and covered the entire auction ground!</p><br/><p>“Alright, Gold Silver Brothers, kill this little brat. We will then join hands to completely finish off the entire ‘Xiao Gate’! Feng City cannot land in the hands of these fellows!” The people behind the Gold Silver brothers, who were once members of the ‘Black Alliance,’ began to immediately cry out with excited faces when they saw the former’s actions. They similarly coveted Feng City, and naturally did not wish for such a big cake to land in Xiao Yan’s hands.</p><br/><p>The Gold Silver Brothers also gave a dark, solemn smile upon hearing everyone’s support. The aura that surged out from their bodies also gradually became stronger…</p><br/><p>The faces of most people within the auction hall became flushed red while being suppressed by the powerful aura of the Gold Silver Brothers. Only a small number of experts were able to sit unaffected without any change in their expression amid this pressuring aura.</p><br/><p>Xiao Yan’s eyes calmly watched the Gold Silver Brothers who had unleashed a powerful aura. Behind him, Xiao Li’s face was gloomy as he waved his hand. Numerous black figures sprang out from the corridor above the auction hall. The flickering cold glowing bows were pointed at those below. Arrows would rain down on the both of them upon order.</p><br/><p>“These two old fellows might well be unlucky this time around.” The leaders of the Dark Sky Sect, Luo Sha Gate, and Wild Lion Gang, who were seated at a corner of the auction hall, watched the Gold Silver Brothers as they emitted a pressuring aura. They exchanged looks with one another before letting out gloating cold laughter. Other people might be unaware but they clearly knew that there was a true elite Dou Zong within this Feng City. Moreover, this elite Dou Zong clearly had all sorts of connections with Xiao Yan. These fellows were going to suffer if they wanted to use their large numbers to behave atrociously in this place.</p><br/><p>Xiao Yan sensed the increasingly powerful aura within the auction hall. A moment later, he slowly extended his fair hands from under his sleeves in front of a countless number of gazes. His ten fingers intersected with one another as his faint voice resounded across the entire hall.</p><br/><p>“Today is the day that my ‘Xiao Gate’ is holding an auction. Anyone who behaves atrociously in this place will be viewed as an enemy. It is no different for you two old fellows.”</p><br/><p>“Hee hee, what an arrogant tone. Today, Su Qian and the many experts from the Inner Academy aren’t around. Do you think you have the right to speak to us in this manner?” The Gold Silver Brothers ended up laughing from extreme anger upon hearing Xiao Yan’s the endlessly arrogant tone.</p><br/><p>Xiao Yan glanced at the two of them, but did not speak. He slowly raised his hand and gently waved it. A gentle voice was emitted from his mouth, “Sorry to trouble you, but please have these two fellows become quiet.”</p><br/><p>Xiao Yan’s voice had just sounded when the space beside him became distorted. Immediately, a bewitching and lovely figure filled with allure slowly surfaced in front of all the gazes in a ghost-like manner.</p><br/><p>The bewitching beauty who had suddenly appeared caused some of the gazes in the entire hall to immediately shrink. Some of those with weak mental strength had faces which had turned flushed red and their throats rolled. All sorts of ugly behavior appeared under the bewitching face, which possessed far too great an allure to men.</p><br/><p>The cold smiling faces of the Gold Silver Brothers slowly stiffened the moment Medusa appeared. They had an extremely deep impression of this woman, who was so beautiful that she seemed like an evil demon. Back then, Han Feng was kicked to death by this cold-blooded woman. Moreover, the thing that caused their hearts to sink was that this woman was a true elite Dou Zong!</p><br/><p>“Dammit. Isn’t this woman chasing after Xiao Yan? Why would she appear in this place to help him?” The Gold Silver Brothers’ green faces revealed a slight paleness. The powerful aura that covered the entire hall in an overbearing manner quietly weakened under Medusa’s faint gaze. A moment later, it became just like a mouse that had seen a cat as it completely shrank back into their bodies.</p><br/><p>Although the Gold Silver Brothers were said to be able to fight with an elite Dou Zong after joining hands, they could merely contend with some of those Dou Zong at the entry level. If they met with an expert like Su Qian, they would only be able to delay the other party for a period of time before they swiftly fell into a disadvantage. The Gold Silver brothers might not be very afraid of Su Qian, but they possessed a kind of fear that came from within their hearts in the face of this bewitching demon-like beauty. This kind of terror came from nowhere, but it faintly warned them that if they were to truly fight with this bewitching beauty, they would have a ninety-percent chance of becoming a dead soul under her palm.</p><br/><p>The sudden, strange change in the Gold Silver Brothers also stirred the attention of quite a number of people. Everyone was stunned. There were immediately some smart people who had sensed something. Hence, numerous obscure gazes turned to the bewitching beauty beside Xiao Yan. A sudden understanding surged and appeared within their hearts. Just what kind of expert was this woman? She was actually able to cause even the Gold Silver Brothers to be afraid?</p><br/><p>Xiao Yan half-smiled as he watched the Gold Silver Brothers’ somewhat stiff faces. He then asked, “You two, do you think that our ‘Xiao Gate’ has the qualification to occupy ‘Feng City’?”</p><br/><p>“Gold Elder, Silver Elder, Feng City is our ‘Black Alliance’ headquarters. It must not land in the hands of these fellows. As long as the two of you give the order, our troops in Feng City will immediately act. I guarantee that we will finish off all of the strength of ‘Xiao Gate’ within half a day.” A fellow behind the Gold Silver Brothers, who did not recognize Medusa, immediately spoke when he heard Xiao Yan’s extremely provocative words.</p><br/><p>According to his thoughts, the Gold Silver Elders would definitely not do nothing in the face of such provocation by Xiao Yan given their characters. At that time, their factions would add fuel to the fire and would definitely completely eliminate ‘Xiao Gate’ today.</p><br/><p>However, this person did not see the pitying gazes that some leaders of other factions beside him threw toward him as he spoke. Some of those people even quietly shifted their seats.</p><br/><p>The shriveled faces of the Gold Silver brothers were strained as they twitched a couple of times when they heard such words at such a moment. They seemed to be able to feel a pair of cold eyes shooting down at them from the stage become increasingly colder.</p><br/><p>The Gold Silver Brothers suddenly turned around in the face of that pair of cold and merciless eyes. They immediately waved their sleeves toward the face of that reckless fellow from earlier in front of a countless of stunned gazes. The powerful force sent the latter flying. He heavily smashed down the corridor over a dozen of meters away while letting out a miserable wail.</p><br/><p>“You eyeless fool. Han Feng died in the hands of chief Xiao. He naturally has the right to take over this city. Since when is it up to you to grumble and distort things?”</p><br/><p>The large auction hall was completely silent. Everyone revealed stunned face as they watched the Gold Silver Brothers, who had suddenly scolded the man in a righteous manner. They felt a comical feeling in their hearts. These two old fellows were really shameless…</p><br/><p>Xiao Yan let out a faint smile as he watched the farce. He knew that after today, the reputation of ‘Xiao Gate’ would completely resound throughout the ‘Black-Corner Region’...</p><br/>\n</div>"}